[
  {
    "text": "Trump compares himself to Mandela and rails against Biden after filing for New Hampshire primary  —  Former President Donald Trump compared himself to anti-apartheid activist Nelson Mandela on Monday as he cast himself as the victim of federal and state prosecutors he alleges are targeting him and his businesses for political reasons.",
    "url": "https://apnews.com/article/trump-new-hampshire-filing-8351611af96b54050f1e64d55d8648dc"
  },
  {
    "text": "Trump Bizarrely Declares ‘I Was Never Indicted’ After Being Indicted Four Times  —  Former President Donald Trump took questions from reporters after officially filing for the GOP New Hampshire primary on Monday and oddly seemed to claim he was never indicted.",
    "url": "https://www.mediaite.com/politics/trump-bizarrely-declares-i-was-never-indicted-after-being-indicted-four-times/"
  },
  {
    "text": "Republicans can't govern.  Just ask them.  —  As the party flails in its search for a speaker, the GOP is increasingly acknowledging publicly that its discord is embarrassing — and even dangerous.  —  It's not clear yet that House Republicans' inability to elect a new speaker … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/23/gop-speaker-dangerous-discord/"
  },
  {
    "text": "‘5 Families’ and Factions Within Factions: Why the House G.O.P. Can't Unite  —  The Republican free-for-all for speaker reflects a web of overlapping blocs that have made the party nearly ungovernable.  —  First, House Republicans chose an establishment guy to be their speaker.",
    "url": "https://www.nytimes.com/2023/10/23/us/politics/house-republicans-divisions-speaker.html"
  },
  {
    "text": "U.S. Raises Concerns About Israel's Plan of Action in Gaza, Officials Say  —  The Pentagon has sent officers to help the Israelis with the challenges of fighting an urban war.  —  The Biden administration is concerned that Israel lacks achievable military objectives in Gaza … ",
    "url": "https://www.nytimes.com/2023/10/23/us/politics/israel-us-gaza-invasion.html"
  },
  {
    "text": "Off-duty pilot charged with 83 counts of attempted murder for allegedly trying to shut off engines on Alaska Airlines flight  —  Joseph David Emerson was taken into custody, the Port of Portland confirmed.  —  An off-duty pilot is charged with 83 counts of attempted murder after he allegedly tried … ",
    "url": "https://abcnews.go.com/US/alaska-airlines-flight-diverted-after-credible-security-threat/story?id=104223059"
  },
  {
    "text": "Alaska Air off-duty pilot tries to shut off engines on flight from Everett  —  An off-duty Alaska Airlines pilot taking a ride Sunday in the jump seat of a flight out of Everett attempted to shut down the engines inflight and had to be subdued, the pilot in charge is heard saying in a recording … ",
    "url": "https://www.seattletimes.com/business/boeing-aerospace/alaska-air-off-duty-pilot-tries-to-shut-off-engines-on-flight-from-everett/"
  },
  {
    "text": "Ramaswamy: U.S. pulling out of NATO is ‘reasonable,’ as is ‘reevaluating’ UN membership  —  His stance means at least two of the top four Republicans vying for the presidency are skeptical of America's involvement in post-World War II institutions.  —  One of the better-polling Republican … ",
    "url": "https://www.politico.com/news/2023/10/23/ramaswamy-nato-us-un-membership-00123119"
  },
  {
    "text": "Trump Plots to Pull Out of NATO — If He Doesn't Get His Way  —  At the very least, the former president wants to put the U.S. on “standby” mode — and undermine NATO's principle of collective defense  —  Donald Trump wanted to pull the United States out of NATO during his first term … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-u-s-leave-nato-1234860016/"
  },
  {
    "text": "Thoughts on Israel and Gaza  —  It's been 17 days since Hamas launched its horrific attack against Israel, killing over 1,400 Israeli citizens, including defenseless women, children and the elderly.  In the aftermath of such unspeakable brutality, the U.S. government and the American people … ",
    "url": "https://barackobama.medium.com/my-statement-on-israel-and-gaza-a6c397f09a30"
  },
  {
    "text": "Tom Emmer scrambles to fix his Trump problem  —  The majority whip is battling a whisper campaign questioning his past support for the ex-president.  —  As House Republicans sort through a field of short-timers and back-benchers to pick their next speaker, Majority Whip Tom Emmer stands out.",
    "url": "https://www.politico.com/news/2023/10/23/tom-emmer-trump-speaker-race-00122969"
  },
  {
    "text": "Bob Menendez Got Boeing Cash After Egypt Aircraft Deal  —  Cash from Apache-maker Boeing flowed to Menendez's PAC after an alleged illicit meeting over an Egyptian chopper sale. … Embattled Sen. Bob Menendez cashed in on pro-Egypt actions in more ways than one, campaign finance filings … ",
    "url": "https://www.thedailybeast.com/new-jersey-senator-bob-menendez-got-boeing-cash-after-egypt-deal-for-apache-aircraft"
  },
  {
    "text": "IDF shows foreign press Hamas bodycam videos, photos of murder, torture, decapitation  —  Government says it's revealing horrific footage collected from various sources to the media in order to fight ‘Holocaust-like denials’ of Hamas's massacres in southern Israel",
    "url": "https://www.timesofisrael.com/idf-shows-foreign-press-raw-hamas-bodycam-videos-of-murder-torture-decapitation/"
  },
  {
    "text": "Intelligence shows Iranian-backed militias are ready to ramp up their attacks against US forces in the Middle East  —  The US has intelligence that Iranian-backed militia groups are planning to ramp up attacks against US forces in the Middle East, as Iran seeks to capitalize on the backlash … ",
    "url": "https://www.cnn.com/2023/10/23/politics/iranian-militias-israel-hamas/"
  },
  {
    "text": "Trump presses ‘presidential immunity’ defense in E. Jean Carroll's defamation suit  —  The argument resembles the aggressive immunity defense that Trump's lawyers are raising in one of his criminal cases.  —  NEW YORK — A lawyer for Donald Trump told a federal appeals court on Monday … ",
    "url": "https://www.politico.com/news/2023/10/23/trump-carroll-presidential-immunity-argument-00123072"
  },
  {
    "text": "Another GOP ‘Bombshell’ About Joe Biden Turns Out To Be A Dud  —  Republicans' impeachment inquiry continues to limp along in the background of their speaker drama.  —  LOADING  —  WASHINGTON — Republicans announced Friday that they had uncovered a “direct payment” to President Joe Biden … ",
    "url": "https://www.huffpost.com/entry/james-biden-payment-joe-biden_n_6536badee4b0689b3fbd8cf1"
  },
  {
    "text": "China, US officials discuss macroeconomic developments in meeting  —  Officials from the United States and China on Monday held a two-hour long virtual meeting to discuss domestic and global macroeconomic developments, the U.S. Treasury Department said, calling the meeting “productive and substantive”.",
    "url": "https://www.reuters.com/world/china-us-officials-discuss-macroeconomic-developments-meeting-2023-10-24/"
  },
  {
    "text": "Here's where Speaker candidates stood on 4 key votes  —  The spotlight in the House is now on the nine Republican lawmakers vying for their chance at the gavel, as the lower chamber approaches nearly three weeks without an elected Speaker.  —  The House has been entangled … ",
    "url": "https://thehill.com/homenews/house/4271191-heres-where-speaker-candidates-stood-on-four-key-votes/"
  },
  {
    "text": "Ted Cruz to be at Game 7 despite Astros fan opposition  —  Some Houston Astros fans are begging Sen. Ted Cruz (R-Texas.) to not attend the Game 7 of their American League Championship Series (ALCS) against state rival the Texas Rangers due to bad luck.  —  Fans of the defending World Series … ",
    "url": "https://thehill.com/blogs/in-the-know/4271705-ted-cruz-to-be-at-game-7-despite-astro-fan-opposition/"
  }
]