[
  {
    "text": "Judge Aileen Cannon Could Get Herself Booted From Trump's Classified Documents Case  —  The Trump-friendly judge is so obviously putting her thumb on the scales of justice in favor of the ex-president that she might not end up adjudicating the trial at all.",
    "url": "https://www.thedailybeast.com/judge-aileen-cannon-could-get-herself-booted-from-trumps-classified-documents-case"
  },
  {
    "text": "Judge in Trump classified documents case proposes ‘insane’ jury instructions, experts say  —  U.S. District Judge Aileen Cannon proposed to instruct jurors a president has sole authority to declare records personal, which legal experts say would amount to dismissing the case against Trump.",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/19/donald-trump-classified-documents-jury-instructions/73027873007/"
  },
  {
    "text": "Mar-a-Lago Judge's Stark Ruling: Jury Sees Secret Files or Trump Wins  —  Trump-appointed Judge Aileen Cannon handed the jury in his Mar-a-Lago case a shocking ultimatum on Monday.  —  The MAGA-friendly federal judge who keeps siding with Donald Trump in his Mar-a-Lago classified records case … ",
    "url": "https://www.thedailybeast.com/mar-a-lago-judge-rules-jury-sees-top-secret-files-or-trump-wins"
  },
  {
    "text": "Trump needs a $464m bond in six days.  What if he can't get it?  —  The former president must pay the full amount in cash or secure a bond by 25 March  —  Donald Trump's lawyers are asking a New York court to put a $464m (£365m) fine in a civil fraud case on hold … ",
    "url": "https://www.bbc.com/news/world-us-canada-68609685"
  },
  {
    "text": "Trump Asks Supreme Court for Absolute Immunity on Election Charges  —  The court will hear arguments on April 25 over whether former presidents can be prosecuted for things they did while in office.  —  Former President Donald J. Trump urged the Supreme Court on Tuesday to rule … ",
    "url": "https://www.nytimes.com/2024/03/19/us/trump-supreme-court-immunity.html"
  },
  {
    "text": "Nelson Peltz to vote for Donald Trump over fears of Joe Biden's ‘mental condition’  —  Billionaire disavowed ex-president after January 6 riot but plans to back him again in November election  —  Billionaire investor Nelson Peltz plans to vote for Donald Trump, saying his assessment … ",
    "url": "https://www.ft.com/content/5c460531-f261-4828-a7ae-6180bb275147"
  },
  {
    "text": "Divided Supreme Court lifts stay on a Texas law giving police broad powers to arrest migrants  —  A divided Supreme Court on Tuesday allowed Texas to begin enforcing a law that gives police broad powers to arrest migrants suspected of crossing the border illegally while a legal battle over the measure plays out.",
    "url": "https://apnews.com/article/supreme-court-migrant-arrests-texas-13ffaed316d16f42e928f6958f0658f2"
  },
  {
    "text": "Supreme Court allows Texas to enforce immigration law  —  The Biden administration sued to block the law, saying it tramples on the federal government's exclusive authority to oversee immigration issues.  —  WASHINGTON — The Supreme Court on Tuesday allowed Texas to enforce a contentious … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-texas-enforce-immigration-law-rcna142971"
  },
  {
    "text": "Trump-backed Bernie Moreno wins Ohio GOP Senate primary  —  Trump-backed candidate Bernie Moreno has won the Republican nomination for Senate in Ohio to face off against incumbent Sen. Sherrod Brown (D) this November, according to Decision Desk HQ.  —  Moreno, a former car dealership owner … ",
    "url": "https://thehill.com/homenews/campaign/4542855-bernie-moreno-donald-trump-ohio-primary-senate-matt-dolan/"
  },
  {
    "text": "Trump-backed Moreno wins Ohio Senate primary  —  His victory is a relief for the former president.  —  WESTLAKE, Ohio — Bernie Moreno, a former car dealer endorsed by Donald Trump, has won a three-way GOP primary for the right to take on Democratic Sen. Sherrod Brown in Ohio.",
    "url": "https://www.politico.com/news/2024/03/19/trump-backed-moreno-wins-ohio-senate-primary-00147945"
  },
  {
    "text": "Jared Kushner says Gaza's ‘waterfront property could be very valuable’  —  Donald Trump's son-in-law also says Israel should bulldoze an area of the Negev desert and move Palestinians there  —  Jared Kushner has praised the “very valuable” potential of Gaza's “waterfront property” … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/19/jared-kushner-gaza-waterfront-property-israel-negev"
  },
  {
    "text": "McCaul apologizes after telling GOP colleague to ‘go f—’ himself at hearing  —  Rep. Michael McCaul (R-Texas) apologized for hurling an expletive at a GOP colleague after growing frustrated during a House committee hearing Tuesday.  —  McCaul told Rep. Darrell Issa (R-Calif.) to “go f … ",
    "url": "https://thehill.com/homenews/house/4543218-mccaul-apologizes-after-telling-gop-colleague-to-go-f-himself-at-hearing/"
  },
  {
    "text": "Biden wins Kansas Democratic primary  —  President Biden will win the Kansas Democratic presidential primary, according to Decision Desk HQ.  —  The Sunflower State offers 33 pledged delegates to the winner, with 11 delegates allocated based on the statewide result and 22 based on the results … ",
    "url": "https://thehill.com/homenews/campaign/4542838-biden-wins-kansas-democratic-primary/"
  },
  {
    "text": "Arizona lawmaker says she announced plans to get abortion to underscore out-of-touch laws  —  Democratic Sen. Eva Burch of Mesa told fellow lawmakers in a floor speech she was going to get an abortion because her pregnancy is no longer viable.  —  PHOENIX — A pregnant Arizona lawmaker … ",
    "url": "https://www.politico.com/news/2024/03/19/arizona-lawmaker-says-she-announced-plans-to-get-abortion-to-underscore-out-of-touch-laws-00147899"
  },
  {
    "text": "Radicalized by the right: Elon Musk puts his conspiratorial thinking on display for the world to see  —  Editor's Note: A version of this article first appeared in the “Reliable Sources” newsletter.  Sign up for the daily digest chronicling the evolving media landscape here.",
    "url": "https://ca.finance.yahoo.com/news/radicalized-elon-musk-puts-conspiratorial-055858883.html"
  },
  {
    "text": "Washington Supreme Court Rules That Bar Exam No Longer A Requirement To Practice Law, Cites Impact On “Marginalized Groups”  —  The Washington State Supreme Court has ruled that the bar exam is no longer a requirement for prospective lawyers.  On Friday, The Bar Licensure Task Force explained that the bar is … ",
    "url": "https://www.thepublica.com/washington-supreme-court-rules-that-bar-exam-no-longer-a-requirement-to-practice-law-cites-impact-on-marginalized-groups/"
  },
  {
    "text": "Climate researcher on what's causing the record rise in ocean temperatures  —  The World Meteorological Organization issued a red alert warning Tuesday about warming and climate change, saying 2024 is shaping up to be another record year.  One of the many worries about how the planet is changing … ",
    "url": "https://www.pbs.org/newshour/show/climate-researcher-on-whats-causing-the-record-rise-in-ocean-temperatures"
  },
  {
    "text": "Obama-appointee and liberal Illinois federal judge rules illegal migrants can carry guns legally  — US District Judge Sharon Johnson Coleman ruled earlier this month that an illegal immigrant could not be charged for carrying a loaded firearm  — The ruling comes as the Biden administration continues … ",
    "url": "https://www.dailymail.co.uk/news/article-13214823/Obama-liberal-Illinois-judge-illegal-migrants-guns.html"
  },
  {
    "text": "How the Slovak leader asked for the Kremlin and Orbán's help (and got it)  —  Back in 2020, Slovakia's then-Prime Minister Peter Pellegrini asked Viktor Orbán to act as a middleman between him and the Kremlin.  He aimed for an invitation to Moscow just before Slovakia's parliamentary election … ",
    "url": "https://vsquare.org/slovakia-elections-peter-pellegrini-russia-hungary-orban-szijjarto/"
  },
  {
    "text": "Pro-Trump Michigan attorney arrested after hearing in DC over leaking Dominion documents  —  An attorney facing criminal charges for illegally accessing Michigan voting machines after the 2020 election was arrested Monday after a hearing in a separate case in federal court in Washington, D.C.",
    "url": "https://apnews.com/article/voting-machines-dominion-defamation-68d3f3a4e840ccb7a81d72837c4f6b3e"
  },
  {
    "text": "Nebraska lawmaker faces calls to resign after invoking colleague's name in book's rape scene passage  —  Republican Nebraska state Sen. Steve Halloran later defended reading the graphic text but apologized for adding his colleague's name to it.  —  Republican Nebraska state Sen. Steve Halloran … ",
    "url": "https://www.nbcnews.com/politics/politics-news/nebraska-lawmaker-faces-calls-resign-invoking-colleagues-name-books-ra-rcna144050"
  },
  {
    "text": "Brazil's Bolsonaro is indicted for first time over alleged falsification of his own vaccination data  —  Former Brazilian President Jair Bolsonaro was formally accused Tuesday of falsifying his COVID-19 vaccination data, marking the first indictment for the embattled far-right leader, with more allegations potentially in store.",
    "url": "https://apnews.com/article/bolsonaro-brazil-federal-police-indicted-covid-a0c1f1dba71553096d0de0f4f39d4caa"
  },
  {
    "text": "Rep. Katie Porter regrets saying the California Senate primary she lost was rigged  —  “Obviously I wish I'd chosen a different word,” the House Democrat said on a podcast two weeks after the election.  —  Rep. Katie Porter says she regrets claiming that billionaires tried to “rig” … ",
    "url": "https://www.nbcnews.com/politics/2024-election/katie-porter-regrets-saying-california-senate-primary-was-rigged-rcna144154"
  },
  {
    "text": "The U.S. crime rate is still dropping, FBI data shows  —  Why does the public think it's going up?  “There is definitely more disorder in cities than there was five years ago,” said one expert.  “People confuse disorder and crime.”  —  New FBI data confirms previous indications that crime … ",
    "url": "https://www.nbcnews.com/news/crime-courts/us-crime-rate-still-dropping-says-fbi-rcna144100"
  },
  {
    "text": "Statement from White House Press Secretary Karine Jean-Pierre on S.B. 4  —  We fundamentally disagree with the Supreme Court's order allowing Texas' harmful and unconstitutional law to go into effect.  S.B. 4 will not only make communities in Texas less safe, it will also burden law enforcement … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/03/19/statement-from-white-house-press-secretary-karine-jean-pierre-on-s-b-4/"
  },
  {
    "text": "Trump Golf Club Settlement Hangs Alina Habba Out to Dry  —  The former president's lawyer may still face fallout for her involvement in an ex-employee's hush money deal over harassment claims at Trump's Bedminster club. … Donald Trump's golf club in Bedminster, New Jersey … ",
    "url": "https://www.thedailybeast.com/trump-new-jersey-golf-club-settlement-hangs-lawyer-alina-habba-out-to-dry"
  },
  {
    "text": "Trump II Architect Russ Vought Embraces A Christian Nationalist Vision For America  —  One of the key architects of Donald Trump's plans for a second administration has been quite public about the driving force animating that radical agenda: a “cold civil war” to be won by those willing to use … ",
    "url": "https://talkingpointsmemo.com/news/russ-vought"
  }
]