[
  {
    "text": "Trump Gutted Key Aviation Safety Committee Before D.C. Plane Crash  —  Last week, just days after his inauguration, Donald Trump eliminated the membership of a key committee that handles aviation security.  And on Wednesday night,  a passenger plane collided with a military helicopter in the Washington, D.C., area.",
    "url": "https://newrepublic.com/post/190934/trump-aviation-safety-committee-dc-plane-crash"
  },
  {
    "text": "Trump Seeks, Without Evidence, to Blame D.E.I. and Democrats for the Crash  —  President Trump's remarks, suggesting that diversity in hiring and other Biden administration policies somehow caused the disaster, reflected his instinct to immediately frame major events through his political or ideological lens.",
    "url": "https://www.nytimes.com/2025/01/30/us/politics/trump-plane-crash-dei-faa-diversity.html?unlocked_article_code=1.tE4.Z0ud.JbQhMo4mtVkd"
  },
  {
    "text": "Plane crashes in D.C.'s Potomac River with 64 on board after midair collision with Army helicopter — live updates  —  What to know about the Washington, D.C., plane crash  — Search efforts continue in the Potomac River after an American Airlines plane with 60 passengers and four crew … ",
    "url": "https://www.cbsnews.com/live-updates/plane-crash-dc-helicopter-potomac-river/"
  },
  {
    "text": "Trump lashes out at Biden, DEI efforts after D.C. plane crash … President Donald Trump on Thursday blasted former President Joe Biden and Democratic diversity measures after a midair collision between an American Airlines regional jet and an Army Black Hawk helicopter above Washington, D.C., the night before.",
    "url": "https://www.cnbc.com/2025/01/30/trump-lashes-out-at-biden-dei-efforts-after-dc-plane-crash.html"
  },
  {
    "text": "Trump blames DEI for weakening FAA in aftermath of Reagan National plane crash  —  President Trump on Thursday appeared to blame diversity initiatives at the Federal Aviation Administration (FAA) for weakening safety following a deadly midair collision near Reagan National Airport.",
    "url": "https://thehill.com/homenews/administration/5116332-trump-0faa-dei-plane-crash/"
  },
  {
    "text": "No survivors expected after midair D.C. plane crash, Trump speaks from White House  —  Officials believe that all passengers and crew onboard American Eagle Flight 5342, which collided midair Wednesday evening with an Army Black Hawk helicopter near Reagan National Airport, were killed.",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/01/30/dc-plane-crash-updates-helicopter-potomac-reagan-airport/"
  },
  {
    "text": "Alexandria Ocasio-Cortez lays out battle plan against ‘shockingly dim’ Trump White House  —  The Trump White House this week sparked chaos across the nation when it issued an executive order that resulted in Medicaid portals getting shut down in all 50 states.",
    "url": "https://www.rawstory.com/alexandria-ocasio-cortez-2671031806/"
  },
  {
    "text": "Kash Patel declines to detail his grand jury testimony in Trump documents case  —  Kash Patel, Donald Trump's nominee to lead the FBI, declined to tell senators what he testified about when he appeared before a grand jury investigating Trump's handling of classified records after his first term ended.",
    "url": "https://www.politico.com/live-updates/2025/01/30/congress/kash-patel-grand-jury-testimony-00201585"
  },
  {
    "text": "FAA Chief Quit on Jan. 20 After Elon Musk Told Him to Resign  —  The Federal Aviation Administration's leader stepped down on Jan. 20, months after Elon Musk demanded that he quit.The move by Michael Whitaker means the FAA has no Senate-confirmed leader for one of the biggest crises in its history … ",
    "url": "https://www.thedailybeast.com/faa-chief-michael-whitaker-quit-on-jan-20-after-elon-musk-told-him-to-resign/"
  },
  {
    "text": "In Tense Call, Governors Push Schumer to Fight Harder Against Trump  —  On a call with Senator Chuck Schumer, the minority leader, six Democratic governors pushed him to slow down the confirmation of President Trump's nominees and to do more to block his agenda.",
    "url": "https://www.nytimes.com/2025/01/29/us/politics/chuck-schumer-trump-agenda-cabinet.html?unlocked_article_code=1.tE4.uTbf.cKtvP65o9Anu&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Former USDA Inspector General Defies Trump Order, Escorted from Her Office  —  Security agents escorted the inspector general of the U.S. Department of Agriculture out of her office on Monday after she refused to comply with her dismissal by the Trump administration, according to Reuters.",
    "url": "https://www.newsweek.com/former-usda-inspector-general-defies-trump-order-escorted-her-office-2023069"
  },
  {
    "text": "Trump's Inaugural Approval Rating Is Historically Low Again  —  Americans divided over whether Trump's pace in addressing major U.S. problems is about right or too fast  —  WASHINGTON, D.C. — At 47%, President Donald Trump's initial job approval rating for his second term is similar … ",
    "url": "https://news.gallup.com/poll/655955/trump-inaugural-approval-rating-historically-low-again.aspx"
  },
  {
    "text": "Despite media reports, Trump has not offered federal employees a “buyout”  —  Anyone who has read reports in the Associated Press, the New York Times, CBS News, CNN, USA Today, the Los Angeles Times, NBC News, or Axios would be under the impression that the Trump administration … ",
    "url": "https://popular.info/p/despite-media-reports-trump-has-not"
  },
  {
    "text": "Criminal records of Jan. 6 rioters pardoned by Trump include rape, domestic violence  —  Editor's Note: This story includes descriptions of violent crimes and sexual abuse involving both adults and children that may be disturbing to readers.  —  On his first day in office … ",
    "url": "https://www.npr.org/2025/01/30/nx-s1-5276336/donald-trump-jan-6-rape-assault-pardons-rioters"
  },
  {
    "text": "To Pay for Trump Tax Cuts, House GOP Floats Plan to Slash Benefits for the Poor and Working Class  —  A menu of options being circulated by congressional Republicans also includes new tax cuts for corporations and the ultrawealthy.  —  One of the hallmarks of Donald Trump's presidential campaign … ",
    "url": "https://www.propublica.org/article/trump-tax-cuts-congress-republicans-plan-slash-benefits"
  },
  {
    "text": "See what Tulsi Gabbard deleted from her Senate Intel opening remarks … - The opening remarks Gabbard first provided to the Senate Intelligence Committee included lines later removed from the final version that she delivered at Thursday's hearing, according to both copies obtained by Axios.",
    "url": "https://www.axios.com/2025/01/30/tulsi-gabbard-senate-intel-opening-remarks-changes"
  },
  {
    "text": "Small airplane down in Potomac River near Ronald Reagan National Airport  —  A small aircraft is down in the Potomac River near Ronald Reagan Washington National Airport and fireboats were on the scene, the Washington fire department said.  —  The airport said late on Wednesday that all takeoffs … ",
    "url": "https://www.reuters.com/world/us/takeoffs-landings-halted-ronald-reagan-national-airport-after-aircraft-incident-2025-01-30/"
  },
  {
    "text": "Singer Marianne Faithfull dies at 78  —  Singer and actress Marianne Faithfull has died at the age of 78, her spokesperson has said.  —  Faithfull was known for hits that included As Tears Go By, which reached the UK top 10 in 1964, and starring roles in films including 1968's The Girl On A Motorcycle.",
    "url": "https://www.bbc.com/news/articles/cp8k931j423o"
  },
  {
    "text": "Trump Kicks Congress to the Curb, With Little Protest From Republicans  —  The administration is showing it doesn't view the House and Senate as equal partners.  So far, Republicans, who hold both majorities, are accepting their new status.  —  Congress passed a law shutting down TikTok, and President Trump flouted it.",
    "url": "https://www.nytimes.com/2025/01/30/us/politics/trump-congress-republicans.html"
  },
  {
    "text": "Hiding in the attic in Donald Trump's America  —  It was the best of times, it was the worst of times.  On the seventh night of Donald Trump's long-dreaded second presidency, thousands of joyous Philadelphians poured into the streets.  Not for him , of course, but because our beloved Birds … ",
    "url": "https://www.inquirer.com/columnists/attytood/immigration-raids-trump-deepseek-tech-eagles-superbowl-20250128.html"
  },
  {
    "text": "Tulsi Gabbard refuses to call Edward Snowden a “traitor” … “So, was Edward Snowden a traitor?”  — Gabbard would not give a yes or no answer, saying only that she is “committed if confirmed as Director of National Intelligence to join you in making sure that there is no future Snowden-type leak.”",
    "url": "https://www.axios.com/2025/01/30/tulsi-gabbard-edward-snowden-traitor"
  },
  {
    "text": "Ogles: ‘Did DEI play a role’ in fatal DC plane crash?  —  Rep. Andy Ogles (R-Tenn.) is questioning whether diversity, equity and inclusion (DEI) played a role in the fatal plane crash at Reagan Washington National Airport outside of Washington, D.C.  —  Ogles, in an interview … ",
    "url": "https://thehill.com/homenews/house/5116066-andy-ogles-dei-role-dca-crash/"
  },
  {
    "text": "RFK Jr. Says Trump Gave Him 1 Directive On The Abortion Pill  —  The drugs are used for 63% of abortion care and have been widely deemed safe by scientists.  —  LOADING  —  Abortion came up several times during the first of Robert F. Kennedy Jr.'s confirmation hearings for health secretary … ",
    "url": "https://www.huffpost.com/entry/rfk-jr-will-study-the-safety-of-abortion-pill-on-trumps-orders_n_679a71e5e4b0c5507e4ae06e"
  },
  {
    "text": "Justice Jackson punches out her frustrations with the conservative Supreme Court in the boxing ring  —  One of three liberals on a Supreme Court dominated by conservatives, Justice Ketanji Brown Jackson said she has found an outlet for the frustration that can result from being in the minority on the nation's highest court: boxing.",
    "url": "https://apnews.com/article/supreme-court-ketanji-brown-jackson-memoir-boxing-fbaff6e3bfe83db6d4b6a9b779280822"
  }
]