[
  {
    "text": "FTC Announces Rule Banning Noncompetes  —  FTC's final rule will generate over 8,500 new businesses each year, raise worker wages, lower health care costs, and boost innovation  —  Today, the Federal Trade Commission issued a final rule to promote competition by banning noncompetes nationwide … ",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2024/04/ftc-announces-rule-banning-noncompetes"
  },
  {
    "text": "U.S. bans noncompete agreements for nearly all jobs  —  The Federal Trade Commission narrowly voted Tuesday to ban nearly all noncompetes, employment agreements that typically prevent workers from joining competing businesses or launching ones of their own.  —  The FTC received … ",
    "url": "https://www.npr.org/2024/04/23/1246655366/ftc-bans-noncompete-agreements-lina-khan"
  },
  {
    "text": "10 senators helped advance Ukraine aid after voting against it  —  Nine Republicans and one Democrat in the Senate voted Tuesday to advance a package that includes aid for Ukraine and Israel, after opposing the legislation in a vote earlier this year.  —  The package advanced toward a final vote Tuesday in an 80-19 procedural vote.",
    "url": "https://thehill.com/homenews/senate/4616241-ten-senators-helped-advance-ukraine-aid-after-voting-against-it/"
  },
  {
    "text": "McConnell says Tucker Carlson and Trump's waffling delayed crucial Ukraine aid  —  The Senate Republican leader pointed to Carlson's “demonization of Ukraine,” along with Trump's “mixed views” and resistance to additional aid as reasons it's taken so long to pass.",
    "url": "https://www.nbcnews.com/politics/congress/mcconnell-says-tucker-carlson-trumps-waffling-delayed-crucial-ukraine-rcna149057"
  },
  {
    "text": "Trump fumes while Biden hits the trail  —  No day demonstrated the extreme asymmetry of the unfolding campaign more than Tuesday.  —  In New York on Tuesday, Donald Trump suffered through a hearing on whether he should be held in contempt of court and testimony from a tabloid publisher on a … ",
    "url": "https://www.politico.com/news/2024/04/23/trump-biden-campaign-trial-00153963"
  },
  {
    "text": "Biden Roasts Trump for Selling His Own Version of The Bible  —  In today's snapshot of the presidential campaign, the contrast between the two candidates could not be starker.  President Biden gave another fiery speech, this time from the state of Florida, a week before their draconian abortion law goes into effect.",
    "url": "https://www.dworkinsubstack.com/p/biden-roasts-trump-for-selling-his"
  },
  {
    "text": "FBI director rejects Trump's vow to investigate political rivals  —  In a wide-ranging interview with NBC News, Christopher Wray also broke with Trump over the former president's characterization of Jan. 6 defendants as “hostages.”  —  Reacting for the first time to former President Donald Trump's vow … ",
    "url": "https://www.nbcnews.com/politics/national-security/fbi-director-rejects-trumps-vow-investigate-political-rivals-rcna149056"
  },
  {
    "text": "National Enquirer made up the story about Ted Cruz's father and Lee Harvey Oswald, former publisher says  —  The Texas senator told NBC News that he's “not interested in revisiting ancient history.”  —  David Pecker, the former publisher of the National Enquirer, testified at Donald Trump's trial Tuesday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/national-enquirer-ted-cruz-father-rafael-lee-harvey-oswald-rcna149027"
  },
  {
    "text": "Ted Cruz spotted the Trump-National Enquirer alliance in 2016  —  Eight years ago this month, Sen. Ted Cruz (Tex.) was in the waning days of his bid for the Republican presidential nomination, watching Donald Trump scoop up increasing shares of delegates on his way to becoming the presumptive nominee.",
    "url": "https://www.washingtonpost.com/politics/2024/04/23/trump-trial-cruz-national-enquirer/"
  },
  {
    "text": "Bird flu virus found in grocery milk as officials say supply still safe  —  Viral fragments of bird flu have been identified in samples of milk taken from grocery store shelves in the United States, a finding that does not necessarily suggest a threat to human health but indicates the avian flu virus … ",
    "url": "https://www.washingtonpost.com/health/2024/04/23/bird-flu-virus-milk/"
  },
  {
    "text": "Secret Service prepares for if Trump is jailed for contempt in hush money case  —  Judge Merchan on Tuesday reserved decision after a contentious hearing.  —  Former President Donald Trump appears in court for his trial at Manhattan Criminal Court on April 23, 2024 in New York City.",
    "url": "https://abcnews.go.com/US/secret-services-prepares-potential-trump-contempt-order-hush/story?id=109542824"
  },
  {
    "text": "The media should be celebrating college protesters instead of demonizing them  —  Mainstream-media reporters covering the growing wave of college protests against Israel's war in Gaza have adopted an overwhelmingly negative tone about something they should be celebrating … ",
    "url": "https://presswatchers.org/2024/04/the-media-should-be-celebrating-college-protesters-instead-of-demonizing-them/"
  },
  {
    "text": "George Santos ends comeback bid for Congress after raising no money  —  Former U.S. Rep. George Santos on Tuesday said he is dropping his longshot bid to return to Congress, months after he was expelled from the House while facing a slew of federal fraud charges.",
    "url": "https://apnews.com/article/george-santos-congress-campaign-a4c4cc2ea7cb52a13ec9f8dfc5ede86c"
  },
  {
    "text": "I Thought the Bragg Case Against Trump Was a Legal Embarrassment.  Now I Think It's a Historic Mistake.  —  About a year ago, when Alvin Bragg, the Manhattan district attorney, indicted former President Donald Trump, I was critical of the case and called it an embarrassment.",
    "url": "https://www.nytimes.com/2024/04/23/opinion/bragg-trump-trial.html"
  },
  {
    "text": "Mass graves in Gaza show victims' hands were tied, says UN rights office  —  Disturbing reports continue to emerge about mass graves in Gaza in which Palestinian victims were reportedly found stripped naked with their hands tied, prompting renewed concerns about possible war crimes amid ongoing … ",
    "url": "https://news.un.org/en/story/2024/04/1148876"
  },
  {
    "text": "Tennessee House passes bill allowing armed teachers, sending measure to the governor  —  Melissa Brown Angele LathamNashville Tennessean  —  Tennessee House Republicans on Tuesday passed legislation to allow some trained teachers and school staff to carry handguns despite pleas from Democrats … ",
    "url": "https://www.tennessean.com/story/news/politics/2024/04/23/tennessee-house-republicans-pass-bill-to-allow-teachers-to-carry-handguns/73331384007/"
  },
  {
    "text": "Migrants Get Visas for Being ‘Victims’ of Ron DeSantis  —  The roughly four dozen migrants that Florida Governor Ron DeSantis helped fly from Texas to Martha's Vineyard about a year and a half ago have been granted legal designations due to the Republican's crimes against the “victims.”",
    "url": "https://www.newsweek.com/desantis-migrants-marthas-vineyard-visas-1892919"
  },
  {
    "text": "Biden scores major union backing as its leaders attack Trump  —  Joe Biden will land a major union endorsement Wednesday from North America's Building Trades Unions, whose leaders say the president has his infrastructure bill largely to thank for it.  —  In making one of their earliest ever … ",
    "url": "https://www.cnn.com/2024/04/23/politics/biden-building-trades-union-endorsement"
  },
  {
    "text": "Guidelines for Teaching, Student Accommodations, and Staff on Campus  —  Dear members of the Columbia community:  —  We are writing to share guidelines for teaching for the remainder of the semester.  Safety is our highest priority as we strive to support our students' learning and all the required academic operations.",
    "url": "https://provost.columbia.edu/news/guidelines-teaching-student-accommodations-and-staff-campus"
  },
  {
    "text": "Kari Lake says ‘unfortunately’ Arizona isn't enforcing 1864 abortion ban, flipping again  —  The Senate candidate supported the 19th-century ban in 2022, came out against it this month, and now appears to be backing it again in a new interview.  —  Arizona GOP Senate candidate Kari Lake … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kari-lake-says-unfortunately-arizona-isnt-enforcing-1864-abortion-ban-rcna148948"
  },
  {
    "text": "Biden rule grants overtime pay to 4 million US workers  —  The administration of U.S. President Joe Biden on Tuesday unveiled a rule extending mandatory overtime pay to an estimated 4 million salaried workers, going even further than an Obama-era rule that was struck down in court.",
    "url": "https://www.reuters.com/world/us/biden-rule-grants-overtime-pay-4-million-us-workers-2024-04-23/"
  }
]