[
  {
    "text": "Man killed during FBI raid in connection with threats against Biden, other officials  —  The Utah man was shot and killed during an FBI raid early Wednesday morning.  —  A Utah man was shot and killed during an FBI raid early Wednesday morning, the FBI confirmed to ABC News.",
    "url": "https://abcnews.go.com/Politics/man-killed-fbi-raid-connection-threats-biden-officials/story?id=102138966"
  },
  {
    "text": "Anti-corruption presidential candidate slain at campaign event in Ecuador's capital  —  An Ecuadorian presidential candidate known for speaking up against corruption was shot and killed Wednesday at a political rally in the capital, an attack that comes amid a wave of startling violence in the South American country.",
    "url": "https://apnews.com/article/ecuador-villavicencio-presidential-candidate-killed-ee9c726b82c09e16e5dacde2d6f005ff"
  },
  {
    "text": "Ecuador Presidential Candidate Assassinated, Suspect Shot Dead  — Anti-graft campaigner murdered less than two weeks before vote  — Soaring violence has made Ecuador more violent than Colombia  —  Ecuador presidential candidate Fernando Villavicencio, a journalist known for his crusade … ",
    "url": "https://www.bloomberg.com/news/articles/2023-08-10/ecuador-presidential-candidate-villavicencio-shot-dead-expreso"
  },
  {
    "text": "‘Derogatory and false’: Fulton DA denies rumors circulated by Trump  —  Fani Willis expected to seek indictment against Trump in week ahead  —  X  —  Fulton County District Attorney Fani Willis on Wednesday flatly denied that she had a relationship with a former client and other rumors spread … ",
    "url": "https://www.ajc.com/politics/derogatory-and-false-fulton-da-denies-rumors-circulated-by-trump/YSB6RC7KXZG25COURJFHDA5SGM/"
  },
  {
    "text": "Abortion setback in Ohio alarms GOP, as Democrats see a ‘roadmap for 2024’  —  Trump's former campaign manager warns abortion could provide “rocket fuel” to Biden's re-election bid.  A Democratic pollster says it will motivate voters “as long as sex is salient.”",
    "url": "https://www.nbcnews.com/politics/2024-election/abortion-setback-ohio-alarms-gop-democrats-see-roadmap-2024-rcna99029"
  },
  {
    "text": "Special counsel obtained search warrant for Donald Trump's Twitter account  —  Twitter's initial resistance to complying with the warrant resulted in a federal judge holding the company in contempt and levying a $350,000 fine.  —  Special Counsel Jack Smith sought and obtained a search warrant … ",
    "url": "https://www.politico.com/news/2023/08/09/special-counsel-obtained-search-warrant-for-donald-trumps-twitter-account-00110484"
  },
  {
    "text": "Trump Says He Won't Sign Pledge to Back Nominee Ahead of Republican Debate  — Former president says he'll announce debate decision next week  — Republican 2024 candidates will meet on Aug. 23 in Milwaukee  —  Republican frontrunner Donald Trump said he would announce next week whether … ",
    "url": "https://www.bloomberg.com/news/articles/2023-08-10/trump-says-he-won-t-sign-pledge-to-back-nominee-ahead-of-republican-debate"
  },
  {
    "text": "The Montgomery Brawl Was, for Some, a Clarifying Moment  —  The Alabama Sweet Tea Party.  —  That was one nickname people gave to a brawl this past Saturday on a Montgomery, Ala., riverfront dock, captured in viral videos, after a group of white people attacked Damien Pickett … ",
    "url": "https://www.nytimes.com/2023/08/09/opinion/montgomery-brawl.html"
  },
  {
    "text": "Exclusive: A veteran FBI agent told Congress that investigations into Giuliani and other Trump allies were ‘suppressed’  — An FBI veteran said his superiors suppressed investigations of Trump, Insider can exclusively reveal.  — “Are we going to do public corruption or not?” the whistleblower told Insider.",
    "url": "https://www.businessinsider.com/fbi-whistleblower-senate-judiciary-russia-giuliani-leak-trump-allies-fuks-biden-2023-8?op=1"
  },
  {
    "text": "House Oversight GOP claims they don't need to find direct payments to Joe Biden to prove corruption in Hunter Biden business dealings memo  —  House Oversight Republicans laid out their intention to accuse President Joe Biden of corruption even without direct evidence that he financially benefited … ",
    "url": "https://www.cnn.com/2023/08/09/politics/house-oversight-republicans-hunter-biden/"
  },
  {
    "text": "GOP donor Anton Lazzaro sentenced to 21 years for sex trafficking minors in Minnesota  —  A formerly well-connected GOP donor convicted of giving teenage girls gifts, alcohol and money in exchange for sex was sentenced Wednesday to 21 years in prison on sex trafficking charges.",
    "url": "https://thehill.com/homenews/state-watch/4146091-gop-donor-anton-lazzaro-sentenced-to-21-years-for-sex-trafficking-minors-in-minnesota/"
  },
  {
    "text": "'I think he's the best guy for the job': See the 2024 campaign through the eyes of Iowa voters  —  Watch John King's full report from Iowa on CNN's “Anderson Cooper 360” at 8 p.m. ET.  —  The homes are nearly identical, dotting both sides of the curvy road in a middle-class subdivision.",
    "url": "https://www.cnn.com/2023/08/09/politics/iowa-republicans-donald-trump-2024/"
  },
  {
    "text": "Coast Guard rescues people fleeing into ocean to escape Hawaii wildfires  —  The U.S. Coast Guard rescued people who jumped into the ocean off the island of Maui to escape the Hawaii wildfires fueled by an offshore hurricane, according to the Associated Press.",
    "url": "https://thehill.com/homenews/state-watch/4145612-coast-guard-rescues-people-fleeing-into-ocean-to-escape-hawaii-wildfires/"
  },
  {
    "text": "Michigan mom is charged with buying guns for son who threatened top Democrats, prosecutors say  —  The mother of a 30-year-old Michigan man who's accused of making death threats against Democratic politicians is now charged with lying when she purchased firearms later found in her son's possession.",
    "url": "https://apnews.com/article/whitmer-arrest-threats-politicians-4ef9072a6b9bfa011d8d59c1540cf363"
  },
  {
    "text": "How a swing-district Democrat is selling ‘Bidenomics’ (without saying it)  —  Good morning, Early Birds.  Richard M. Nixon resigned as president 49 years ago today.  Tips: earlytips@washpost.com.  Thanks for waking up with us. … In today's edition ... New PAC aims to elect young liberals … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/09/how-swing-district-democrat-is-selling-bidenomics-without-saying-it/"
  },
  {
    "text": "Long covid has derailed my life.  Make no mistake: It could yours, too.  —  Madeline Miller, a novelist, is the author of “The Song of Achilles” and “Circe.”  —  In 2019, I was in high gear.  I had two young children, a busy social life, a book tour and a novel in progress.",
    "url": "https://www.washingtonpost.com/opinions/2023/08/09/madeline-miller-long-covid-post-pandemic/"
  },
  {
    "text": "Ex-federal judge and prominent conservative: ‘There is no Republican Party’  —  J. Michael Luttig, a conservative retired federal judge and key adviser to former Vice President Mike Pence, declared on Wednesday that “there is no Republican Party” and said former President Donald Trump … ",
    "url": "https://www.cnn.com/2023/08/09/politics/michael-luttig-conservative-judge-republicans-cnntv/"
  }
]