[
  {
    "text": "Georgia court website briefly publishes, removes document about potential Trump charges  —  The Fulton County, Georgia, court's website briefly posted a document on Monday listing several criminal charges against former U.S. President Donald Trump that appeared related to his attempts to overturn … ",
    "url": "https://www.reuters.com/legal/us-state-georgia-appears-set-file-charges-against-donald-trump-court-document-2023-08-14/"
  },
  {
    "text": "Exclusive: Former Republican legal officials endorse special counsel's speedy trial date proposal in Trump Jan. 6 case  —  Nearly a dozen Republican-appointed former judges and high-ranking federal senior legal officials on Monday endorsed the January 2, 2024, trial date proposed … ",
    "url": "https://www.cnn.com/2023/08/14/politics/republican-legal-officials-trump-interference-case/"
  },
  {
    "text": "Trump, 18 others indicted for trying to overthrow 2020 Georgia election  —  X  —  Former President Donald Trump and 18 allies were charged on Monday with conspiring to overturn the results of the 2020 election in Georgia.  —  In a sweeping 98-page indictment handed up by a Fulton County grand jury … ",
    "url": "https://www.ajc.com/politics/trump-18-others-indicted-for-trying-to-overthrow-2020-georgia-election/PQ3N2YBIDRDJFLJGFLEBZUWM6I/"
  },
  {
    "text": "Georgia Trump Investigation  —  Grand Jurors Hear Hours of Testimony in Election Interference Case  —  Prosecutors brought at least three witnesses before a grand jury considering efforts by former President Donald J. Trump and his allies to overturn Georgia's results in the 2020 election.",
    "url": "https://www.nytimes.com/live/2023/08/14/us/trump-indictment-georgia-election"
  },
  {
    "text": "Judge rules in favor of Montana youths in landmark climate decision  —  ‘This is a monumental decision,’ said a lawyer for the young plaintiffs, and could influence how judges handle similar cases in other states  —  In the first ruling of its kind nationwide, a Montana state court decided Monday … ",
    "url": "https://www.washingtonpost.com/climate-environment/2023/08/14/youths-win-montana-climate-trial/"
  },
  {
    "text": "The Looming Supreme Court Nullification Crisis  —  “In the name of the greatest people that have ever trod this earth,” Alabama Governor George Wallace proclaimed in his 1963 inaugural address at the state capitol in Montgomery, the first seat of the Confederacy, “I draw the line in the dust … ",
    "url": "https://washingtonmonthly.com/2023/08/14/the-looming-supreme-court-nullification-crisis/"
  },
  {
    "text": "‘Blind Side’ subject Oher alleges Tuohys made millions off lie  —  Retired NFL star Michael Oher, whose supposed adoption out of grinding poverty by a wealthy, white family was immortalized in the 2009 movie “The Blind Side,” petitioned a Tennessee court Monday with allegations that a central element … ",
    "url": "https://www.espn.com/nfl/story/_/id/38190720/blind-side-subject-michael-oher-alleges-adoption-was-lie-family-took-all-film-proceeds"
  },
  {
    "text": "Philadelphia teen arrested, charged in FBI terrorism investigation  —  The 17-year-old is being charged as a juvenile.  —  A Philadelphia teen has been charged and arrested with multiple state charges stemming from an FBI terrorism investigation, officials announced Monday.",
    "url": "https://abcnews.go.com/Politics/philadelphia-teen-arrested-charged-fbi-terrorism-investigation/story?id=102263409"
  },
  {
    "text": "She Wasn't Able to Get an Abortion.  Now She's a Mom.  Soon She'll Start 7th Grade.  —  Ashley just had a baby.  She's sitting on the couch in a relative's apartment in Clarksdale, Miss., wearing camo-print leggings and fiddling with the plastic hospital bracelets still on her wrists.",
    "url": "https://time.com/6303701/a-rape-in-mississippi/"
  },
  {
    "text": "Bodycam video shows confrontation between U.S. Rep. Ronny Jackson and law enforcement  —  The footage shows Jackson being tackled to the ground and placed in handcuffs, with the Amarillo Republican directing a profanity-laced tirade toward a trooper.  His office has said Jackson, a physician … ",
    "url": "https://www.texastribune.org/2023/08/14/ronny-jackson-dps-bodycam-video/"
  },
  {
    "text": "DeSantis urges Bob Iger to drop Disney lawsuit, accept the end of ‘special privileges’  — Florida Gov. Ron DeSantis told CNBC that Disney CEO Bob Iger should drop his company's political retaliation lawsuit.  — The lawsuit centers on Walt Disney World's special tax district … ",
    "url": "https://www.cnbc.com/2023/08/14/desantis-urges-bob-iger-to-drop-disney-lawsuit-accept-the-end-of-special-privileges.html"
  },
  {
    "text": "Coast Guard rescues 4 divers who went missing off the Carolinas  —  Four divers were found and rescued about 50 miles off the coast of Cape Fear, North Carolina, after going missing on Sunday, the U.S. Coast Guard said.  Crews with the Coast Guard and the U.S. Navy had been searching for the divers since at least Sunday night.",
    "url": "https://www.cbsnews.com/news/divers-rescued-missing-coast-guard-north-carolina-south-carolina/"
  },
  {
    "text": "How America Got Mean  —  In a culture devoid of moral education, generations are growing up in a morally inarticulate, self-referential world.  —  Over the past eight years or so, I've been obsessed with two questions.  The first is: Why have Americans become so sad?",
    "url": "https://www.theatlantic.com/magazine/archive/2023/09/us-culture-moral-education-formation/674765/"
  },
  {
    "text": "The GOP Senate candidate whose Trump ambassador stint is coming back to haunt him  —  National Republicans were wary of Jeffrey Gunter's bid to begin with.  He jumped into the Nevada primary anyway.  —  Republican Senate hopeful Jeffrey Gunter is learning a painful lesson: What happens in Reykjavik doesn't always stay in Reykjavik.",
    "url": "https://www.politico.com/news/2023/08/14/jeffrey-gunter-trump-ambassador-nevada-00110865"
  },
  {
    "text": "China central bank unexpectedly cuts rates to support sputtering economy  —  China's central bank unexpectedly cut key policy rates for the second time in three months on Tuesday, in a fresh sign that the authorities are ramping up monetary easing efforts to boost a sputtering economic recovery.",
    "url": "https://www.reuters.com/world/china/china-central-bank-cuts-rates-second-time-three-months-support-economy-2023-08-15/"
  },
  {
    "text": "Nevada jumps in front of South Carolina in GOP early voting  —  After announcing its caucuses will be Feb. 8, only one of the four early states is left to set its primary date.  —  Nevada's 2024 GOP presidential caucuses will be on Feb. 8 of next year, jumping ahead of the South Carolina primary … ",
    "url": "https://www.politico.com/news/2023/08/14/nevada-jumps-south-carolina-gop-early-voting-00111105"
  },
  {
    "text": "Finger-pointing begins inside Trump team over Jan. 6 indictment  —  From the moment special counsel Jack Smith listed six co-conspirators in Donald Trump's Jan. 6 indictment but didn't name or charge them, a major question has been which of them might be tempted to flip and serve as witnesses for the prosecution.",
    "url": "https://www.washingtonpost.com/politics/2023/08/14/finger-pointing-begins-inside-trump-team-over-jan-6-indictment/"
  }
]