[
  {
    "text": "Why the Epstein Coverup Matters  —  Jeffrey Epstein damage control continues at the Justice Department, with Pam Bondi announcing this morning that Deputy Attorney General Todd Blanche is seeking a prosecutorial interview with Epsitein's co-conspirator, Ghislaine Maxwell.",
    "url": "https://www.thebulwark.com/p/why-the-epstein-coverup-matters-trump-bondi-patel-justice-fbi"
  },
  {
    "text": "House grinds to a halt as GOP tries to shut down Epstein votes  —  House Republicans have virtually stopped work on all major legislation leading up to their six-week summer recess to avoid taking votes on forcing the release of the Jeffrey Epstein files. … - “They're certainly not making it easier for themselves. ...",
    "url": "https://www.axios.com/2025/07/22/jeffrey-epstein-house-republicans-vote-democrats"
  },
  {
    "text": "House Republicans at standstill over Epstein drama  —  House Republicans may choose to scrap several floor votes this week as internal party drama over the release of Jeffrey Epstein files is derailing the work of the Rules Committee.  The panel came to a standstill, again … ",
    "url": "https://www.politico.com/live-updates/2025/07/21/congress/epstein-drama-disrupts-house-schedule-00466632"
  },
  {
    "text": "Trump's Defense Attorney Todd Blanche Will Meet with Sex Trafficker Ghislaine Maxwell to Make a Deal for His Client  —  Trump Defense Attorney Todd Blanche and Pam Bondi just announced that Blanche will meet with Ghislaine Maxwell and discuss potential cooperation deals with her.",
    "url": "https://www.emptywheel.net/2025/07/22/trumps-defense-attorney-todd-blanche-will-meet-with-sex-trafficker-ghislaine-maxwell-to-make-a-deal-for-his-client/"
  },
  {
    "text": "Deputy Attorney General seeking meeting with Epstein associate Ghislaine Maxwell  —  Deputy Attorney General Todd Blanche announced Tuesday that he is seeking a meeting with Jeffrey Epstein's associate Ghislaine Maxwell. … - “No one is above the law—and no lead is off-limits,” he wrote.",
    "url": "https://www.axios.com/2025/07/22/epstein-ghislaine-maxwell-doj-meeting"
  },
  {
    "text": "Trump's intelligence chiefs try to rewrite the history of the 2016 election  —  Five years ago, Marco Rubio said there was “irrefutable evidence of Russian meddling.”  Now, Tulsi Gabbard says that claim is “treasonous” and should be criminally investigated.",
    "url": "https://www.nbcnews.com/politics/national-security/trumps-intelligence-chiefs-try-rewrite-history-2016-election-rcna220103"
  },
  {
    "text": "Trump to pull US out of UNESCO over DEI policies, pro-Palestinian, pro-China tilt  —  WASHINGTON — President Trump is pulling the US out of the United Nations Educational, Scientific and Cultural Organization (UNESCO), citing its anti-America and anti-Israel leanings as well as its woke agenda, The Post has learned.",
    "url": "https://nypost.com/2025/07/22/us-news/trump-to-pull-us-out-of-unesco-over-dei-policies-pro-palestinian-pro-china-tilt/"
  },
  {
    "text": "FEMA search and rescue chief resigns after frustration with Texas flood response  —  The head of FEMA's Urban Search and Rescue branch, which runs a network of teams stationed across the country that can swiftly respond to natural disasters, resigned on Monday.",
    "url": "https://cnn.com/2025/07/21/politics/fema-search-and-rescue-chief-resigns"
  },
  {
    "text": "Trump's WSJ Lawsuit Raises a New Constitutional Question … The president can sue you, but you can't sue him.  —  It seems like an absurd thing to say but that's effectively the reality of our legal system today, one that has become increasingly alarming during Donald Trump's second term.",
    "url": "https://www.politico.com/news/magazine/2025/07/22/trump-lawsuit-wall-street-journal-supreme-court-ankush-khardori-column-00465728"
  },
  {
    "text": "Trump's Student Arrests, and the Lawsuit Fighting Them, Tread New Ground  —  The Trump administration's efforts to deport foreign students who espoused pro-Palestinian views under a little-used foreign policy provision have no obvious legal parallel.  —  The four veteran immigration agents … ",
    "url": "https://www.nytimes.com/2025/07/22/us/politics/trump-student-arrests-immigration-trial.html"
  },
  {
    "text": "Zohran's Bronx Science tales  —  MAMDANI PLAYS HOOKY: He's just like us.  He got detention.  He cut class to get lunch.  He says he's bad at math.  —  Democratic mayoral nominee Zohran Mamdani graduated from the public, test-in, competitive Bronx Science High School in 2010.",
    "url": "https://www.politico.com/newsletters/new-york-playbook-pm/2025/07/21/zohrans-bronx-science-tales-00465437"
  },
  {
    "text": "White House removes Wall Street Journal from Scotland press pool over Epstein bombshell … The White House is removing the Wall Street Journal from the pool of reporters covering the president's weekend trip to Scotland, White House press secretary Karoline Leavitt told POLITICO.",
    "url": "https://www.politico.com/news/2025/07/21/journal-removed-white-house-pool-epstein-00465548"
  },
  {
    "text": "From Truth Social to bitcoin empire: Trump's $2 billion pivot  —  Since President Trump's election in November, the price of bitcoin has skyrocketed.  On Election Day 2024, one bitcoin traded below $75,000.  Last week, bitcoin reached an all-time high of over $123,000.  (On Monday, it hovered around $118,000.)",
    "url": "https://popular.info/p/from-truth-social-to-bitcoin-empire"
  },
  {
    "text": "Big Law Firms Bowed to Trump.  A Corps of ‘Little Guys’ Jumped in to Fight Him.  —  Solo practitioners, former government litigators and small law offices stepped up to help challenge the Trump administration's agenda in court after the White House sought to punish many big firms.",
    "url": "https://www.nytimes.com/2025/07/21/us/politics/trump-big-law-firms-fight.html?unlocked_article_code=1.YU8.q0dW.xax88ZSjcJZs&smid=url-share"
  },
  {
    "text": "Coca-Cola Reports Second Quarter 2025 Results and Updates Full Year Guidance  —  Comparable Currency Neutral Operating Income (Non-GAAP) Grew 15%  —  Operating Margin was 34.1% versus 21.3% in the Prior Year;  —  Comparable Operating Margin (Non-GAAP) was 34.7% versus 32.8% in the Prior Year",
    "url": "https://investors.coca-colacompany.com/news-events/press-releases/detail/1138/coca-cola-reports-second-quarter-2025-results-and-updates-full-year-guidance"
  },
  {
    "text": "Malcolm-Jamal Warner, ‘Cosby Show’ actor, dies at 54 in Costa Rica drowning  —  Malcolm-Jamal Warner the actor who played teenage son Theo Huxtable on “The Cosby Show,” has died at age 54 in an accidental drowning in Costa Rica, authorities there said.  Costa Rica's Judicial Investigation Department … ",
    "url": "https://apnews.com/article/malcolm-jamal-warner-dies-drowning-330d6643dcb2cd038a3fe5a9cc8abb70"
  },
  {
    "text": "Revealed: Harvard publisher cancels entire journal issue on Palestine shortly before publication  —  As Harvard's feud with Trump escalated, so did tensions over an ‘education and Palestine’ issue of a prestigious journal.  Scholars blame the ‘Palestine exception’ to academic freedom",
    "url": "https://www.theguardian.com/education/2025/jul/22/harvard-educational-review-palestine-issue-cancelled"
  },
  {
    "text": "Judge gives ex-officer nearly 3 years in Breonna Taylor raid, rebuffs DOJ call for no prison time  —  A federal judge on Monday sentenced a former Kentucky police officer to nearly three years in prison for using excessive force during the deadly Breonna Taylor raid five years ago … ",
    "url": "https://apnews.com/article/breonna-taylor-raid-hankison-sentence-4da93877da13f506be42cc1c738cab2b"
  },
  {
    "text": "Can The Washington Post's TikTok Guy Make It Without The Post? … Dave Jorgenson is leaving The Post next month to start an online video company based on his personal YouTube channel, Local News International.  —  For years, Dave Jorgenson has been nearly synonymous with The Washington Post on social media.",
    "url": "https://www.nytimes.com/2025/07/22/business/media/dave-jorgenson-video-washington-post.html"
  },
  {
    "text": "We Need to Talk About Pedocon Theory  —  The connection been Donald Trump and Jeffrey Epstein is no accident, but reveals a deep logic at the heart of reactionary politics. … I would prefer here a precise accounting of Jeffrey Epstein's history of pedophilia.  Unfortunately, much remains unknown.",
    "url": "https://www.liberalcurrents.com/we-need-to-talk-about-pedocon-theory/"
  },
  {
    "text": "Has Brazil Invented the Future of Money?  —  And will it ever come to America?  —  Last week the House passed the GENIUS Act, which will boost the growth of stablecoins, thereby paving the way for future scams and financial crises.  On Thursday the House also passed a bill that would bar … ",
    "url": "https://paulkrugman.substack.com/p/has-brazil-invented-the-future-of"
  },
  {
    "text": "Pam Bondi Grants Hillary Clinton Email Probe Request Amid Epstein Furor  —  Attorney General Pam Bondi announced Monday that the Justice Department has released documents related to the FBI's investigation into Hillary Clinton's use of a private email server.  —  The Context",
    "url": "https://www.newsweek.com/pam-bondi-jeffrey-epstein-files-hillary-clinton-emails-2101893"
  },
  {
    "text": "The Perverse Economics of Assisted Suicide  —  In June, lawmakers in my native country, Britain, approved plans to legalize assisted suicide.  If the bill becomes law, England and Wales will join more than a dozen countries and 11 U.S. states in permitting medically assisted dying.",
    "url": "https://www.nytimes.com/2025/07/22/opinion/assisted-suicide-economics.html"
  }
]