[
  {
    "text": "Trump and EU Reach Tariff Deal, Avoiding Trade War  —  Pact imposes baseline tariff of 15% on the U.S.'s biggest trading partner  —  President Trump said he reached a trade agreement on Sunday with the European Union, avoiding a damaging trade war with the U.S.'s largest trading partner … ",
    "url": "https://www.wsj.com/economy/trade/trump-says-he-has-a-tariff-deal-with-european-union-avoiding-trade-war-3ca72c5d?st=iJpyhN&reflink=article_copyURL_share"
  },
  {
    "text": "Trump's tariffs start August 1, no extensions, Lutnick says  —  There will be no more extensions on tariff deadlines, and they will go into force as scheduled on August 1, Commerce Secretary Howard Lutnick said Sunday. … - Financial markets call it the “TACO trade” — “Trump always chickens out” … ",
    "url": "https://www.axios.com/2025/07/27/trump-tariffs-august-1"
  },
  {
    "text": "Trump sets EU tariff at 15%, lower than his original threat, after meeting in Scotland  —  TURNBERRY and ABERDEEN, Scotland — President Trump said he struck a trade deal with the European Union on Sunday after talks with the president of the European Commission, Ursula von der Leyen, at his golf course on Scotland's western coast.",
    "url": "https://www.npr.org/2025/07/27/nx-s1-5481246/trump-tariffs-european-union"
  },
  {
    "text": "What Will It Cost to Renovate the ‘Free’ Air Force One?  Don't Ask.  —  To hide the cost of renovating the plane Qatar donated to President Trump, the Air Force appears to have tucked it inside an over-budget, behind-schedule nuclear modernization program.  —  President Trump makes no secret … ",
    "url": "https://www.nytimes.com/2025/07/27/us/politics/air-force-one-trump-cost.html?unlocked_article_code=1.Zk8.1kZ2.llxYF3gaD7eI&smid=url-share"
  },
  {
    "text": "Trump Is Trying to Hide the Cost of Renovating His New Air Force One  —  The administration transferred nearly $1 billion dollars to a Pentagon project to modernize nuclear weapons, but those funds will be used to renovate Trump's “flying palace”  —  How much will it cost to renovate … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-hide-cost-renovate-air-force-one-qatar-1235394763/"
  },
  {
    "text": "Some Republicans aren't backing down from Epstein transparency push … - While some Republicans are falling in line with President Trump and making calls to move on, others are defying leadership and joining in with Democrats by continuing to criticize the administration's handling of the case.",
    "url": "https://www.axios.com/2025/07/27/epstein-republicans-trump-ghislaine-maxwell"
  },
  {
    "text": "Tom Lehrer, Musical Satirist With a Dark Streak, Dies at 97  —  A mathematician by training, he acquired a devoted following with songs that set sardonic lyrics to music that was often maddeningly cheerful.  —  Tom Lehrer, the Harvard-trained mathematician whose wickedly iconoclastic songs … ",
    "url": "https://www.nytimes.com/2025/07/27/arts/music/tom-lehrer-dead.html?unlocked_article_code=1.Zk8.j4kp.ADZ8OeduFlbp&smid=url-share"
  },
  {
    "text": "The Ripple Effects of an ICE Raid on a Nebraska Meatpacking Company … They gathered in a conference room for the weekly management meeting, even though there was hardly anyone left to manage.  Chad Hartmann, the president of Glenn Valley Foods in Omaha, pushed a few empty chairs to the side … ",
    "url": "https://www.nytimes.com/2025/07/27/us/ice-glenn-valley-foods.html?unlocked_article_code=1.Zk8.OObR.AY8qhcrmmP1I&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump demands Kamala Harris, Beyoncé, Oprah be prosecuted over 2024 campaign payouts: ‘Totally illegal’  —  President Trump demanded that former Vice President Kamala Harris be prosecuted along with Beyoncé, Oprah Winfrey and Al Sharpton — for fees that were paid to the stars during the 2024 election.",
    "url": "https://nypost.com/2025/07/27/us-news/trump-demands-kamala-harris-beyonce-oprah-be-prosecuted-over-2024-campaign-payouts-totally-illegal/"
  },
  {
    "text": "People of Good Conscience Must Stop the Starvation in Gaza  —  Forty years ago, the world's conscience was shocked into action by images of emaciated children and starving babies dying in their mothers' arms.  There was a surge in international aid, airdrops of food and activism from the world's most popular artists.",
    "url": "https://www.nytimes.com/2025/07/27/opinion/gaza-starvation-famine-israel.html?unlocked_article_code=1.Zk8.uz5G.P2y2_u5h77fG&smid=url-share"
  },
  {
    "text": "100,000 People Marched at London Trans+ Pride.  The Transphobic UK Media Ignored It.  —  The UK's biggest news outlets ignored a record-breaking march for trans equality, despite publishing dozens of trans stories each week.  —  ·  —  Just now  —  This weekend, 100,000 people took … ",
    "url": "https://medium.com/@mimmymum/100-000-people-marched-at-london-trans-pride-the-transphobic-uk-media-ignored-it-a420b51c8a8e"
  },
  {
    "text": "California Democrats debate what a Harris governor run could mean for them  —  Rep. Dave Min was chatting with reporters at the US Capitol when the California Democrat was asked about whether he wants Kamala Harris to run for governor.  —  Suddenly, Min no longer had time to talk.",
    "url": "https://cnn.com/2025/07/27/politics/kamala-harris-governor-california-democrats-debate"
  },
  {
    "text": "Speaker Johnson says all ‘credible’ Epstein files should be released: Full interview  —  In an exclusive interview with Meet the Press, House Speaker Mike Johnson (R-La.) calls the bipartisan push to force a House vote on releasing the Epstein files “reckless,” adding that it does not do enough to protect victims.",
    "url": "https://www.nbcnews.com/meet-the-press/video/speaker-johnson-says-all-credible-epstein-files-should-be-released-full-interview-243905605708"
  },
  {
    "text": "Jay Leno criticizes modern late-night comedy for alienating half the audience with partisan politics  —  The former late-night host explains why he never revealed his political leanings amid Stephen Colbert's show cancellation controversy  —  Jay Leno reflected on why he always kept … ",
    "url": "https://www.foxnews.com/entertainment/jay-leno-criticizes-modern-late-night-comedy-alienating-half-audience-partisan-politics"
  },
  {
    "text": "GOP Sen. Refuses to Admit Bush, Not Obama, Was President During Epstein's Plea Deal  —  The senator takes the “blame Obama” game to new heights  —  Sen. Markwayne Mullin tried to blame former President Barack Obama for Jeffrey Epstein's 2008 plea deal, despite Obama not being president at the time.",
    "url": "https://www.rollingstone.com/politics/politics-news/markwayne-mullin-bush-obama-epstein-plea-deal-1235394775/"
  },
  {
    "text": "‘A nightmare that no one wants’: GOP fears Mastriano's down-ballot drag in Pennsylvania … A person close to Trump's political operation — one of the four aforementioned Republicans — described the president's team as “very concerned” that a Mastriano campaign “could jeopardize or add … ",
    "url": "https://www.politico.com/news/2025/07/27/republicans-mastriano-down-ballot-fears-pennsylvania-00478155"
  },
  {
    "text": "Top MAGA Rep's 20-Year-Old Son Cited for Alleged Child Abuse  —  BUSTED  —  It's not the first time the controversial Colorado Congresswoman's eldest has had a run-in with the law.  —  MAGA Rep. Lauren Boebert's son has been slapped with misdemeanor child abuse charges—the latest in a series of encounters with law enforcement.",
    "url": "https://www.thedailybeast.com/top-maga-representative-lauren-boeberts-son-cited-for-misdemeanor-child-abuse-in-colorado/"
  },
  {
    "text": "Medicaid changes will hurt family caregivers, experts warn  —  Medicaid cuts under President Trump's sweeping tax and spending package will harm family caregivers, experts warn, by reducing access to health care for themselves and the people they care for, which could then lead to more caregiving responsibilities.",
    "url": "https://thehill.com/policy/healthcare/5421325-medicaid-cuts-caregivers/"
  },
  {
    "text": "Democrats use new tactic to highlight Trump's gutting of Medicaid: billboards in the rural US  —  The ‘big, beautiful’ bill will cut more than $1tn from the health plan, with rural hospitals feeling the brunt of it  —  The road to four struggling rural hospitals now hosts a political message: “If this hospital closes, blame Trump.”",
    "url": "https://www.theguardian.com/us-news/2025/jul/27/medicaid-cuts-billboards-democrats"
  },
  {
    "text": "Playbook: ‘The center of everything’  —  With help from Eli Okun, Bethany Irvine and Ali Bianco  —  Good Saturday morning.  This is Kimberly Leonard, the Florida Playbook author, writing from Miami.  Get in touch.  —  MAGA VS. MAHA?:  How are partisan politics affecting the Food and Drug Administration?",
    "url": "https://www.politico.com/newsletters/playbook/2025/07/26/the-center-of-everything-00478140"
  },
  {
    "text": "Sen. Graham says there will be a ‘change in strategy’ in Gaza ‘to destroy Hamas’  —  In an exclusive interview with Meet the Press, Sen. Lindsey Graham (R-S.C.) shares what he's hearing from the White House and Israeli officials about the next stage of the war, saying “there will be a full military effort … ",
    "url": "https://www.nbcnews.com/meet-the-press/video/sen-graham-says-there-will-be-a-change-in-strategy-in-gaza-to-destroy-hamas-243905605826"
  },
  {
    "text": "Can Mamdani's Message Play Outside New York?  It Already Has.  —  Zohran Mamdani's mayoral primary victory in New York follows wins by other big-city progressives.  Are voters more open to backing progressive stances?  —  In the glow of Zohran Mamdani's convincing win in the Democratic mayoral primary … ",
    "url": "https://www.nytimes.com/2025/07/27/nyregion/mamdani-wu-progressive-democrats.html"
  }
]