[
  {
    "text": "Three U.S. citizens, ages 2, 4 and 7, swiftly deported from Louisiana  —  The cases have renewed concerns that the Trump administration's expedited deportations are violating the rights of both citizens and noncitizens.  —  Three U.S. citizen children from two different families were deported … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/26/us-citizen-children-deported-ice/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NjQwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MDIyMzk5LCJpYXQiOjE3NDU2NDAwMDAsImp0aSI6IjM5MjZlNWYyLTg2NDYtNDM4Yi05YTViLTI5YjRlNzM4ZjExYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA0LzI2L3VzLWNpdGl6ZW4tY2hpbGRyZW4tZGVwb3J0ZWQtaWNlLyJ9.Rm7u0rjPmi8MkPr9rnhg_-oGfcj8fu1tJP7dscz3WEs&itid=gfta"
  },
  {
    "text": "ICE deports immigrant mother of an infant and 3 children who are US citizens, lawyers say  —  Immigration and Customs Enforcement officers have in recent days deported the Cuban-born mother of a 1-year-old girl — separating them indefinitely — and three children ages 2 … ",
    "url": "https://apnews.com/article/immigration-mothers-deported-d8c5c0353c18e9ee0c228ea15e02d759"
  },
  {
    "text": "100 days in and the public feels Trump's presidency is proceeding mostly as expected  —  Most partisans agree they are getting what they expected from Trump's second term, but 84% of Democrats think Trump is doing a poor or terrible job as president so far and 68% of Republicans think he's doing a good or great job.",
    "url": "https://apnorc.org/projects/100-days-in-and-the-public-feels-trumps-presidency-is-proceeding-mostly-as-expected/"
  },
  {
    "text": "About 4-in-10 Americans say Trump is a ‘terrible’ president amid sinking approval: Survey  —  A new poll shows that about 4 in 10 Americans say President Trump has been a “terrible” leader in his second term.  —  The Associated Press-NORC Center for Public Affairs Research also found … ",
    "url": "https://thehill.com/homenews/administration/5269499-about-4-in-10-americans-say-trump-is-a-terrible-president-amid-sinking-approval-survey/"
  },
  {
    "text": "Trump Refuses to Give Biden Air Force One Ride to Pope's Funeral  —  FLYING SOLO  —  The MAGA president broke yet another presidential tradition in attending the late Pontiff's funerary rites.  —  Not even the death of Pope Francis could bring President Donald Trump to make nice and ride with former President Joe Biden.",
    "url": "https://www.thedailybeast.com/trump-refuses-to-give-biden-air-force-one-ride-to-popes-funeral/"
  },
  {
    "text": "National Science Foundation eliminates hundreds of grants day after director resigns  —  WASHINGTON - Approximately 700 scientific research projects funded through the National Science Foundation were canceled on April 25 amid scrutiny from President Donald Trump's Department of Government Efficiency.",
    "url": "https://www.usatoday.com/story/news/politics/2025/04/26/national-science-foundation-doge-cuts/83282784007/"
  },
  {
    "text": "Trump-aligned club for the ultra rich launches in Washington  —  The launch of “Executive Branch” comes as Trump world looks to remake Washington.  —  A new club is coming to Washington — and you probably can't get in.  —  Donald Trump Jr., megadonor Omeed Malik and several other investors … ",
    "url": "https://www.politico.com/news/2025/04/26/donald-trump-washington-club-00311720"
  },
  {
    "text": "Georgia Democrat Jon Ossoff says Trump's ‘chaos and uncertainty’ hurts the economy  —  Democratic Sen. Jon Ossoff of Georgia said Saturday that President Donald Trump's unsettled economic policy is the biggest problem facing his state, saying the “chaos and uncertainty” is hurting the ability … ",
    "url": "https://apnews.com/article/jon-ossoff-trump-economy-georgia-ff63415a6c263aa0616979311b9c12c6"
  },
  {
    "text": "Trump Officials Weaken Rules Insulating Government Workers From Politics  —  A reinterpretation of the Hatch Act announced by the administration lets officials wear campaign paraphernalia like MAGA hats, and removes an independent board's role in policing violations.",
    "url": "https://www.nytimes.com/2025/04/25/us/politics/trump-hatch-act.html"
  },
  {
    "text": "Musk says DOGE's work recalls Clinton-era cuts.  Al Gore disagrees.  —  Trump has brought in outsiders to rapidly make dramatic cuts.  Clinton relied on existing government leaders to take a more targeted approach.  —  Three decades ago, President Bill Clinton and Vice President Al Gore stood … ",
    "url": "https://www.washingtonpost.com/us-policy/2025/04/26/doge-musk-clinton-cuts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NjQwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MDIyMzk5LCJpYXQiOjE3NDU2NDAwMDAsImp0aSI6ImQ4ODdmNDdlLTU2MzctNGViMC04ZjlhLWZkOGU1YTk1Y2M0OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS91cy1wb2xpY3kvMjAyNS8wNC8yNi9kb2dlLW11c2stY2xpbnRvbi1jdXRzLyJ9.g7czDqQZbD0ipS4yijJVsdZbvcZY4KZVi9qm7smIW1Q&itid=gfta"
  },
  {
    "text": "Wife of US Coast Guard member arrested over expired visa after security check for military housing  —  The wife of an active-duty Coast Guardsman was arrested earlier this week by federal immigration authorities inside the family residential section of the U.S. Naval Air Station at Key West … ",
    "url": "https://apnews.com/article/coast-guard-immigration-arrest-navy-ice-8c59f778f3245b470871e1da96bf90e7"
  },
  {
    "text": "Wisconsin Judge Monica Isham Threatens Not to Hold Court Over Hannah Dugan Arrest  —  Wisconsin Circuit Judge Monica Isham is threatening to refuse to hold court and even raise bail on defendants because of the arrest of Milwaukee Judge Hannah Dugan.  —  “Guidance requested or I Refuse to Hold Court … ",
    "url": "https://www.wisconsinrightnow.com/wisconsin-judge-monica-isham-hannah-dugan-arrest/"
  },
  {
    "text": "Trump accused of Pope Francis funeral faux pas after ‘breaking dress code’ then leaving early  —  On The Ground newsletter: Get a weekly dispatch from our international correspondents  —  President Donald Trump has been accused of breaking the dress code for Pope Francis's funeral by wearing blue … ",
    "url": "https://www.independent.co.uk/news/world/europe/trump-pope-francis-funeral-blue-suit-b2740006.html"
  },
  {
    "text": "FBI director posts photo of arrested Wisconsin judge's perp walk, possibly violating DOJ policy  —  FBI Director Kash Patel posted a photo on X Friday night of the Wisconsin judge who was arrested for allegedly obstructing immigration agents while she was handcuffed, being escorted to a vehicle by officials.",
    "url": "https://cnn.com/2025/04/26/politics/patel-wisconsin-judge-photo-violate-conduct"
  },
  {
    "text": "Can Trump Really Deport 10 Million People?  A Conversation with Dara Lind  —  Despite his draconian and lawless crackdown on immigrants and their defenders, the number of undocumented might not go down  —  Immigration policy has long been a battlefield for ideological disputes.",
    "url": "https://www.theunpopulist.net/p/can-trump-really-deport-10-million"
  },
  {
    "text": "China Quietly Exempts Some U.S.-Made Products From Tariffs  —  Beijing has been canvassing companies and waiving duties on U.S. goods in sectors where it lacks alternatives  —  BEIJING—China's government has exempted some U.S. imports that the country would struggle to immediately source … ",
    "url": "https://www.wsj.com/economy/trade/china-quietly-exempts-some-u-s-made-products-from-tariffs-b7bc033c"
  },
  {
    "text": "U.S. says “further progress was made” in third round of nuclear talks with Iran  —  The U.S. and Iran concluded on Saturday the third round of nuclear talks and agreed to meet again on May 3, said Omani foreign minister Badr Al-Busaidi, who is mediating between the parties.",
    "url": "https://www.axios.com/2025/04/26/us-iran-nuclear-talks-meet-next-week"
  },
  {
    "text": "How Trump Plays Into Putin's Hands, From Ukraine to Slashing U.S. Institutions  —  Many of President Trump's actions have been seen as benefiting Russia either directly or indirectly, so much so that Russian officials have celebrated some of his moves.  —  If President Vladimir V. Putin … ",
    "url": "https://www.nytimes.com/2025/04/26/us/politics/trump-putin-russia-ukraine.html?unlocked_article_code=1.Ck8.hbvQ.uAelxKo7ozqh&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The New Partisan Divide Is Old Gen Z vs. Young Gen Z  —  Gen Z politics is transforming before our eyes.  —  New data out of Yale's Youth Poll broke the internet last week when it revealed a partisan split within Gen Z. Given a generic Democrat vs. Republican ballot for 2026 … ",
    "url": "https://www.politico.com/news/magazine/2025/04/26/two-gen-zs-young-conservative-polling-00307375"
  },
  {
    "text": "The horrors are not aberrations.  This is the Trump administration's plan.  —  This is their plan.  But the plan is just that — a plan.  It can and must be stopped.  —  It's important to understand that this is the Trump administration's plan.  —  Kilmar Abrego Garcia, Judge Hannah Dugan, two-year-old V.L.M.",
    "url": "https://www.lawdork.com/p/the-plan-the-horrors-are-not-aberrations"
  },
  {
    "text": "Nearly 800 illegal aliens arrested in massive Florida ICE operation: ‘Tidal Wave’  —  Multiple illegal aliens arrested had violent criminal convictions  —  In a groundbreaking joint effort, U.S. Immigration and Customs Enforcement (ICE) Miami and Florida law enforcement agencies arrested … ",
    "url": "https://www.foxnews.com/us/nearly-800-illegal-aliens-arrested-massive-florida-ice-operation-tidal-wave"
  }
]