[
  {
    "text": "10/12/23 ☀️ Punchbowl News AM … But worse.  Maybe way worse. … Only the stakes this time are higher, the time frame is shorter, the opposition is larger and the House Republican Conference is angrier. … After winning the GOP speaker nomination on Wednesday — barely … ",
    "url": "https://punchbowl.news/archive/101223-punchbowl-news-am/"
  },
  {
    "text": "The New Republican Establishment  —  An alternative Trumpist governing elite gets closer to ruling the party.  —  In the final account, the rise and fall of Kevin McCarthy might read like the familiar tale of a Republican congressional leader toppled by a small but uncompromising right-wing faction.",
    "url": "https://www.nytimes.com/2023/10/12/upshot/new-republican-establishment-speaker.html"
  },
  {
    "text": "Biden aides slam Trump for calling Hezbollah ‘very smart’  —  Aides to President Biden and his campaign blasted former President Trump on Thursday for remarks a night earlier in which Trump described Hezbollah as “very smart” amid unfolding violence in Israel.",
    "url": "https://thehill.com/homenews/campaign/4251829-biden-aides-slam-trump-for-calling-hezbollah-very-smart/"
  },
  {
    "text": "Donald Trump Criticizes Israel PM Benjamin Netanyahu, Calls Hezbollah ‘Very Smart’  —  The former president admitted he could have been dishing classified information at a campaign event with a claim about the Israeli leader.  —  LOADING  —  Former President Donald Trump … ",
    "url": "https://www.huffpost.com/entry/donald-trump-israel-hezbollah_n_6527b1aae4b0102e6964bb29"
  },
  {
    "text": "U.S., Qatar agree to stop Iran from tapping $6 billion fund after Hamas attack  —  U.S. officials and the Qatari government have agreed to stop Iran from accessing a $6 billion account for humanitarian assistance in light of Hamas's attack on Israel, Deputy Treasury Secretary Wally Adeyemo told House Democrats … ",
    "url": "https://www.washingtonpost.com/business/2023/10/12/iran-oil-fund-us-israel/"
  },
  {
    "text": "Sen. Bob Menendez faces new charges accusing him of working for foreign government  —  The superseding indictment alleges Menendez, “provided sensitive U.S. Government information and took other steps that secretly aided the Government of Egypt.”  —  Sen. Bob Menendez, D-N.J. … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-bob-menendez-faces-new-charges-accusing-working-foreign-government-rcna120136"
  },
  {
    "text": "Hamas took at least 64 captives into Gaza, visual evidence suggests  —  The presence of scores of captives in Gaza, a large majority of them civilians, increases the risks involved in a possible Israeli invasion  —  Palestinian fighters took at least 64 captives into the Gaza Strip during … ",
    "url": "https://www.washingtonpost.com/investigations/2023/10/12/israel-hostage-count-videos/"
  },
  {
    "text": "Six Months Ago NPR Left Twitter.  The Effects Have Been Negligible  —  A lot of people threaten to leave Twitter.  Not many of them have actually done it.  —  This was true even before Elon Musk's purchase of the platform a year ago.  But the parade of calamities since … ",
    "url": "https://niemanreports.org/articles/npr-twitter-musk/"
  },
  {
    "text": "Israel Targets All Hamas Leaders Across Gaza in Fresh War Effort  — Military spokesman says political leaders same as army  — A ground war has not been decided but army is preparing for it  —  Israel is targeting Hamas' political leaders in Gaza as well as military ones as it seeks … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-12/israel-targets-all-hamas-leaders-across-gaza-in-fresh-war-effort"
  },
  {
    "text": "Wisconsin Republicans Retreat From Threats to Impeach Liberal Justice  —  Republicans had floated the idea of impeaching Janet Protasiewicz, newly seated on the Wisconsin Supreme Court, before she could undo the party's legislative gerrymander.  But on Thursday, they backed off.",
    "url": "https://www.nytimes.com/2023/10/12/us/politics/wisconsin-republicans-impeach-janet-protasiewicz.html"
  },
  {
    "text": "North Carolina's cautionary tale for purple states  —  Republicans have made themselves so powerful, it doesn't matter if Dems win elections. … North Carolina Republicans are having a very good year, and now that they've locked down both the legislature and the judiciary … ",
    "url": "https://www.publicnotice.co/p/north-carolina-gop-power-grab-roy-cooper"
  },
  {
    "text": "Rep. Rashida Tlaib, facing censure motion, calls Hamas actions ‘war crimes’  —  U.S. Rep. Rashida Tlaib, D-Detroit, said Wednesday evening her critics are purposefully distorting her position to make it seem she is sympathetic to Hamas and its attacks on Israel, which she called “war crimes.”",
    "url": "https://www.freep.com/story/news/politics/2023/10/11/rashida-tlaib-israel-hamas-war-crimes/71148560007/"
  },
  {
    "text": "Texas Republicans are fighting about whether it's OK to associate with white supremacists  —  Last week, Jonathan Stickland — president of the far-right Defend Texas Liberty PAC and a former state representative — met with notorious white supremacist Nick Fuentes and other right-wing extremists.",
    "url": "https://popular.info/p/texas-republicans-are-fighting-about"
  },
  {
    "text": "Trump tells court he had no duty to ‘support’ the Constitution as president  —  Former President Donald Trump is arguing to a judge in Colorado that he was not required to “support” the Constitution as president, reported Brandi Buchman from Law & Crime.  —  The argument came as he seeks … ",
    "url": "https://www.rawstory.com/trump-wont-support-constitution/"
  },
  {
    "text": "Kushner Says Schumer Told Mother's Friends He Was ‘Going to Jail’  —  Trump's son-in-law and former adviser said he spent millions in legal fees while facing accusations of campaign ties to Russia … Jared Kushner, the son-in-law of former President Donald Trump, says he had to calm … ",
    "url": "https://themessenger.com/politics/kushner-says-schumer-told-mothers-friends-he-was-going-to-jail"
  },
  {
    "text": "Yale American Studies professor justifies Hamas attacks  —  Harvard, Yale, and all the “best” academic institutions have been fatally compromised for decades.  At some point, they went full anti-American, anti-Western, and radical revolutionary.  —  Every time you hear “decolonize,” … ",
    "url": "https://hotair.com/david-strom/2023/10/12/yale-american-studies-professor-justifies-hamas-attacks-n584046"
  },
  {
    "text": "Samuel Alito Really, Really, Really Wants to Save This Racial Gerrymander in South Carolina  —  On Wednesday, the Supreme Court heard Alexander v. South Carolina State Conference of the NAACP, a challenge to South Carolina's congressional map based on the contention that it was an impermissible racial gerrymander.",
    "url": "https://slate.com/news-and-politics/2023/10/samuel-alito-wants-racial-gerrymander-south-carolina.html"
  },
  {
    "text": "It's Not Me, It's You: Cornel West's Messy Breakup  —  The presidential candidate's last-minute decision to ghost the Green Party is just the latest rift within the perennially squabbling American left.  —  Cornel West thinks the Greens can't take him where he wants to go.",
    "url": "https://www.politico.com/news/magazine/2023/10/12/cornel-west-campaign-breakup-green-party-00121048"
  },
  {
    "text": "The Massacre in Israel and the Need for a Decent Left  —  On Tuesday evening, I was drinking on the porch of my friend and neighbor Misha Shulman, the Israel-born rabbi of a progressive New York synagogue called the New Shul.  All day, he'd been on the phone with congregants deeply distraught … ",
    "url": "https://www.nytimes.com/2023/10/12/opinion/columnists/israel-gaza-massacre-left.html"
  },
  {
    "text": "Cenk Uygur running for president as Democrat  —  The News  —  Progressive pundit Cenk Uygur will challenge President Biden for the Democratic nomination, offering himself as an alternative to an incumbent who “is definitely going to lose” if he makes it to the general election.",
    "url": "https://www.semafor.com/article/10/11/2023/cenk-uygur-running-for-president-as-democrat"
  }
]