[
  {
    "text": "Trump Privately Pressuring GOP Senators To ‘Kill’ Border Deal To Deny Biden A Win  —  The former president is telling Republicans he “doesn't want Biden to have a victory” in 2024, said a source familiar with the bipartisan negotiations.  —  LOADING  —  WASHINGTON - Donald Trump … ",
    "url": "https://www.huffpost.com/entry/trump-border-deal-republicans-biden_n_65b18fa0e4b0166fc770ae46"
  },
  {
    "text": "Alina Habba Spotted At Trump Victory Party After Delaying Defamation Trial Over Illness  —  The former president's legal team requested a trial delay, saying Habba had been exposed to COVID and had a fever.  She attended the party one day later.  —  LOADING",
    "url": "https://www.huffpost.com/entry/alina-habba-trump-party-illness_n_65b14dabe4b09e7f5b9e1784"
  },
  {
    "text": "64K women and girls became pregnant due to rape in states with abortion bans, study estimates  —  The research letter, published by JAMA Internal Medicine, estimated that nearly 520,000 rapes were associated with 64,565 pregnancies across 14 states.  —  More than 64,000 women and girls became pregnant … ",
    "url": "https://www.nbcnews.com/politics/politics-news/64k-women-girls-became-pregnant-due-rape-states-abortion-bans-study-es-rcna135565"
  },
  {
    "text": "Raped, pregnant and in an abortion ban state?  Researchers gauge how often it happens  —  As an abortion provider in Montana, Dr. Samuel Dickman has seen patients routinely who tell him they became pregnant after a rape.  His sense was the patients who were telling him were only a fraction of the true number.",
    "url": "https://www.npr.org/sections/health-shots/2024/01/24/1226161416/rape-caused-pregnancy-abortion-ban-states"
  },
  {
    "text": "Oklahoma enlists notorious right-wing zealot to guide school library policy  —  Ellen Ochoa Elementary School, in Tulsa, Oklahoma, was among the dozens of schools that received bomb threats last year after being targeted by the far-right Libs of TikTok account.",
    "url": "https://popular.info/p/oklahoma-enlists-notorious-right"
  },
  {
    "text": "An Iowa bill would make students sing the national anthem every day.  One lawmaker sang it  —  When it came time for her closing comments at Wednesday's Iowa House subcommittee meeting, Rep. Sue Cahill stood — and began singing the national anthem.  —  “O say can you see, by the dawn's early light … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/25/iowa-bill-require-students-sing-national-anthem-every-day/72349739007/"
  },
  {
    "text": "U.S. economy booms with 3.3% growth in final quarter of 2023 … - The economy moderated in the September-December period compared to the previous quarter's 4.9% growth, which got a notable boost from companies building up inventories. … - That dynamic continued in the fourth quarter … ",
    "url": "https://www.axios.com/2024/01/25/us-gdp-fourth-quarter-economy-growth"
  },
  {
    "text": "Who are No Labels' donors?  Democratic groups file complaints in an attempt to find out  —  For months, the centrist group No Labels has stockpiled cash and diligently worked to secure ballot access for a potential third-party presidential bid, striking fear among allies of President Joe Biden … ",
    "url": "https://apnews.com/article/no-labels-campaign-finance-complaint-biden-trump-05062262e04b4bb346ab06eaea99630b"
  },
  {
    "text": "The Looming Contest Between Two Presidents and Two Americas  —  The general election matchup that seems likely between President Biden and former President Donald J. Trump is about fundamentally disparate visions of the nation.  —  Each of them has sat behind the Resolute Desk in the Oval Office … ",
    "url": "https://www.nytimes.com/2024/01/25/us/politics/two-presidents-two-americas.html"
  },
  {
    "text": "Exclusive: House ethics probe of Gaetz seeks information from DOJ and woman who allegedly had sex with congressman as a minor  —  The House Ethics Committee investigating Rep. Matt Gaetz has reached out to the woman whom the congressman allegedly had sexual relations with when she was a 17-year-old minor … ",
    "url": "https://www.cnn.com/2024/01/24/politics/house-ethics-matt-gaetz"
  },
  {
    "text": "Housing is now unaffordable for a record half of all U.S. renters, study finds  —  Over the past two years, Genuine Campbell was shocked at how rent for her two-bedroom apartment in Philadelphia just kept going up — from $1,300 a month to $1,600.  She's a single mom of four … ",
    "url": "https://www.npr.org/2024/01/25/1225957874/housing-unaffordable-for-record-half-all-u-s-renters-study-finds"
  },
  {
    "text": "Clerks for hire: The Supreme Court recruiting race  —  Supreme Court clerks are offered bonuses of up to $500,000 to join law firms  —  Last spring, as the Supreme Court wrapped up oral arguments for what was shaping up to be a blockbuster term, the law firm Jones Day invited a group … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/25/supreme-court-clerks-bonuses-law-firms/"
  },
  {
    "text": "Trump's super PAC raised $46 million in 6 months  —  But they have only half of that still in the bank  —  A pro-Donald Trump super PAC raised over $46 million in the second half of 2023 and ended the year with just over $23 million in cash on hand, as it gears up for the general election.",
    "url": "https://www.politico.com/news/2024/01/25/trumps-super-pac-raised-46-million-in-six-months-00137743"
  },
  {
    "text": "Penn Jillette Wants to Talk It All Out  —  Penn Jillette has a large, framed French-language poster of Renaldo and Clara behind him.  Most people wouldn't know what that is, but as a Bob Dylan fan, I do — it's his largely forgotten, widely panned 1978 film that he wrote, directed and starred in.",
    "url": "https://www.cracked.com/article_40871_penn-jillette-wants-to-talk-it-all-out.html"
  },
  {
    "text": "The RNC Shuttered Most of the Hispanic Community Centers It Touted as Critical to Winning Over Latino Voters  —  JWPlayer  —  During the 2022 cycle, the Republican Party made a commitment to Latino voters that hadn't been seen before, touting nearly two dozen RNC Hispanic Community Centers … ",
    "url": "https://themessenger.com/politics/the-rnc-shuttered-most-of-the-hispanic-community-centers-it-touted-as-critical-to-winning-over-latino-voters"
  },
  {
    "text": "Governor Abbott signals potential defiance of Supreme Court's border ruling  —  Governor Greg Abbott issued a “Statement on Texas' Constitutional Right to Self-Defense,” following calls by numerous Republican lawmakers to resist the high court's order, including three state representatives from Houston.",
    "url": "https://www.houstonpublicmedia.org/articles/news/border/2024/01/24/475398/governor-abbott-signals-potential-defiance-of-supreme-courts-border-ruling/"
  },
  {
    "text": "Biden to announce $5 billion in new infrastructure projects  —  President Biden will announce $5 billion in funding for major transportation projects during a visit Thursday to Superior, Wisconsin — part of an effort to tout his administration's investments in long-overdue infrastructure projects.",
    "url": "https://www.axios.com/2024/01/25/biden-infrastructure-projects"
  },
  {
    "text": "Democrats Are Having a Blast Making a Circus of the GOP's Hunter Biden Probe  —  “We're calling out their bullshit like every single time, and I think they're surprised by it,” one Democrat on the Oversight Committee said. … When Rep. Jared Moskowitz (D-FL) arrived at the Hunter Biden contempt hearing … ",
    "url": "https://www.thedailybeast.com/democrats-are-having-a-blast-making-a-circus-of-the-gops-hunter-biden-probe"
  },
  {
    "text": "How life is going for this former McCarthy deputy: Not great  —  Republicans in the Bayou State are privately speculating if Garret Graves made too many enemies, both in Washington and back home.  —  Louisiana is enjoying outsized control over House GOP leadership these days … ",
    "url": "https://www.politico.com/news/2024/01/25/mccarthy-deputy-louisiana-gop-00136428"
  },
  {
    "text": "Democrats win challenge to North Carolina voter election law  —  A federal judge blocked a specific provision of the law's same-day voter registration requirements.  —  Joe Biden quietly scored a legal victory in North Carolina this week, in what could prove to be a consequential development in a closely divided state.",
    "url": "https://www.politico.com/news/2024/01/24/north-carolina-voter-election-law-00137679"
  }
]