[
  {
    "text": "A Mystery $30 Million Wave of Pro-Trump Bets Has Moved a Popular Prediction Market  —  Four Polymarket accounts have systematically placed frequent wagers on a Trump election victory  —  Vice President Kamala Harris and former President Donald Trump are neck and neck in the polls.",
    "url": "https://www.wsj.com/finance/betting-election-pro-trump-ad74aa71?st=SbQdzx&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Fox News disputes Trump's claim that its employees helped write his jokes  —  Donald Trump says Fox News employees helped him write his jokes for the Al Smith dinner.  Fox says that's fake news.  The former president, whose roast of Kamala Harris and other Democrats at Thursday's Al Smith dinner pulled … ",
    "url": "https://www.politico.com/live-updates/2024/10/18/2024-elections-live-coverage-updates-analysis/trump-fox-news-jokes-00184409"
  },
  {
    "text": "“I did make a mistake”: Baier apologizes for playing edited Trump clip in Harris interview  —  The Fox News anchor's deceptive video clip left out Trump's remarks about “enemies from within”  —  Fox News anchor Bret Baier is apologizing for playing a misleadingly edited clip in an interview with Vice President Kamala Harris.",
    "url": "https://www.salon.com/2024/10/17/i-did-make-a-mistake-baier-apologizes-for-playing-edited-clip-in-harris-interview/"
  },
  {
    "text": "Trump cancels a streak of events with only days until election … - Vice President Kamala Harris, on the other hand, has been on a media blitz after enduring criticism from Republicans about a perceived lack of interviews.  — And while Harris has ventured into the unfriendly territory … ",
    "url": "https://www.axios.com/2024/10/18/trump-cancels-interviews-2024"
  },
  {
    "text": "An ‘exhausted’ Trump says no to another interview  —  Recently, it's become something of a pattern: Donald Trump is scheduled for an interview with a neutral media outlet, the date nears and then ... things fall apart.  It happened just this week to planned Trump sit-downs with NBC in Philadelphia and CNBC's … ",
    "url": "https://www.politico.com/live-updates/2024/10/18/2024-elections-live-coverage-updates-analysis/trump-skips-another-interview-00184327"
  },
  {
    "text": "“Horrible mess”: Trump called out for “ungodly” profanity-laced tirade at Catholic event  —  “Who does that?” questioned former Republican lawmaker Barbara Comstock, calling Trump a “buffoon”  —  The Alfred E. Smith Memorial Foundation Dinner, an annual Catholic charity event in New York City … ",
    "url": "https://www.salon.com/2024/10/18/horrible-mess-called-out-for-ungodly-profanity-laced-tirade-at-catholic-event/"
  },
  {
    "text": "Playbook: Trump's media backout  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  A ONE-TWO PUNCH — With 18 days left until Election Day, VP KAMALA HARRIS will be hitting the road with the two most popular members of her party: BARACK and MICHELLE OBAMA.",
    "url": "https://www.politico.com/newsletters/playbook/2024/10/18/trumps-media-backout-00184324"
  },
  {
    "text": "Jan. 6 rioter who assaulted police says she was ‘duped’ by Trump's election lies  —  Dana Jean Bell, who yelled at an officer who later died by suicide, “regrets ever having responded to Trump's call,” her lawyer wrote.  She was sentenced to 17 months in prison.",
    "url": "https://www.nbcnews.com/politics/donald-trump/jan-6-rioter-assaulted-police-says-was-duped-trumps-election-lies-rcna176025"
  },
  {
    "text": "Trump judge's latest release of Jan. 6. evidence was heavily redacted.  Here's what was included.  — A federal judge has released additional evidence against Donald Trump in his election interference case.  — The release follows a previously unsealed motion with new evidence against Trump by special counsel Jack Smith.",
    "url": "https://www.businessinsider.com/donald-trump-judge-release-additional-evidence-election-interference-case-2024-10"
  },
  {
    "text": "How Silicon Valley Billionaires Became Trump's Biggest Donors … Last February, the billionaire financier Nelson Peltz summoned a group of about 20 wealthy, predominantly Republican donors and a handful of G.O.P. strategists to dinner at his $334 million waterfront estate in Palm Beach … ",
    "url": "https://www.nytimes.com/2024/10/18/magazine/trump-donors-silicon-valley.html?unlocked_article_code=1.TE4.yMQN.L2APvfL4FtSL&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Endangered Democrats brag about Trump ties in final stretch … - The trend comes as split-ticket voting declines, making it more likely that a Senate candidate's fate will be tied to their state's presidential results. … - “Casey bucked Biden to protect fracking and he sided with Trump … ",
    "url": "https://www.axios.com/2024/10/18/senate-democrats-campaign-ads-trump-2024"
  },
  {
    "text": "Trump Is Speaking Like Hitler, Stalin, and Mussolini  —  To support The Atlantic's journalism, please consider subscribing today.  —  Rhetoric has a history.  The words democracy and tyranny were debated in ancient Greece; the phrase separation of powers became important in the 17th and 18th centuries.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-authoritarian-rhetoric-hitler-mussolini/680296/?gift=hVZeG3M9DnxL4CekrWGK34vU4G4QMrQTKJxena1OKFY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "This Is Exactly How an Elon Musk-Funded PAC Is Microtargeting Muslims and Jews With Opposing Messages  —  An Elon Musk-funded group called Future Coalition PAC is targeting Muslim voters in Michigan and Jewish voters in Pennsylvania with diametrically opposed political advertisements about Kamala Harris.",
    "url": "https://www.404media.co/this-is-exactly-how-an-elon-musk-funded-pac-is-microtargeting-muslims-and-jews-with-opposing-messages/"
  },
  {
    "text": "It Sure Looks Like Trump Watches Are Breaking Copyright Law  —  The company behind Trump Watches prominently features an iconic image of the presidential candidate on its timepieces.  There's one big problem: It's not allowed to.  —  In late September, Donald Trump gushed on Truth Social … ",
    "url": "https://www.wired.com/story/it-sure-looks-like-trump-watches-are-breaking-copyright-law/"
  },
  {
    "text": "Trump overcharged Secret Service agents to stay at his D.C. hotel, new Democratic report says  —  Then-President Donald Trump also benefited from U.S. officials and others seeking jobs and pardons who paid for stays at his downtown Washington hotel, House Democrats allege.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-secret-service-dc-hotel-emoluments-pardons-jobs-democrat-report-rcna175714"
  },
  {
    "text": "Republicans livid UK Labour staffers will stump for Harris  —  Republicans and mini-MAGA Brits are flipping their lids after a U.K. Labour aide let slip almost 100 political foot soldiers from the governing party in Britain are preparing to jet to the U.S. to knock doors for the Kamala Harris presidential campaign.",
    "url": "https://www.politico.com/live-updates/2024/10/18/2024-elections-live-coverage-updates-analysis/labour-party-campaign-kamala-harris-00184341"
  },
  {
    "text": "Majority of Americans Feel Worse Off Than Four Years Ago  —  Economic Confidence Index remains negative at -26  —  WASHINGTON, D.C. — More than half of Americans (52%) say they and their family are worse off today than they were four years ago, while 39% say they are better off and 8% volunteer that they are about the same.",
    "url": "https://news.gallup.com/poll/652250/majority-americans-feel-worse-off-four-years-ago.aspx"
  },
  {
    "text": "Donald Trump ‘Amazed’ That Harvey Weinstein, Serial Sexual Abuser, ‘Got Schlonged’  —  Trump was surprised Weinstein was held accountable because the former president thought the liberal media would protect the former Hollywood producer.  —  Donald Trump is “amazed” that Harvey Weinstein … ",
    "url": "https://www.huffpost.com/entry/donald-trump-amazed-that-harvey-weinstein-serial-sexual-abuser-got-schlonged_n_67127a1ce4b0e2b6e54bea7f"
  },
  {
    "text": "Election Officials Are ‘Nervous’ About 1 Aspect Of Voting By Mail  —  Voting by mail is safe and effective — but in an extremely tight election, any minor problems could have historic consequences.  —  The pandemic election in 2020 marked a record-breaking year for the use of mail-in ballots … ",
    "url": "https://www.huffpost.com/entry/mail-in-voting-postal-service-concerns_n_671297f3e4b03a110eb42900"
  },
  {
    "text": "Univision Town Hall Participants Unimpressed With ‘Arrogant’ Trump  —  Participants in the event expressed frustration with the former president in interviews with Rolling Stone … Three participants in the event expressed their frustration over Trump's failure to answer them directly … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-univision-town-hall-responses-latino-voters-1235137221/"
  }
]