[
  {
    "text": "How the Special Counsel's Portrayal of Biden's Memory Compares With the Transcript  —  The special counsel, Robert K. Hur, accused the president last month of “significant” memory problems.  The interview transcript offers context to his report.  —  A transcript of a special counsel's hourslong interview … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/hur-biden-memory-transcript.html"
  },
  {
    "text": "Full transcript of Biden's special counsel interview paints nuanced portrait  —  The president doesn't seem as absent-minded as Hur has made him out to be — and Hur doesn't appear as crass as Biden has portrayed him  —  President Biden was in the early stages of his interview … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/12/biden-hur-transcript-classified-documents/"
  },
  {
    "text": "Schiff Attacked Special Counsel Hur for Reporting Biden's Failing Memory.  Here's What Happened Next.  —  On Tuesday, Special Counsel Robert Hur testified in a House Judiciary hearing about his report detailing President Joe Biden's handling of classified documents.",
    "url": "https://townhall.com/tipsheet/madelineleesman/2024/03/12/hur-hearing-n2636392"
  },
  {
    "text": "News outlets that trumpeted Hur's story now discover “context” and “nuance” in transcript  —  Major news outlets that ran dozens of stories hyping then-special counsel Robert Hur's claim that President Joe Biden evinced a “poor memory” during their interview are now acknowledging that Hur's depiction … ",
    "url": "https://www.mediamatters.org/new-york-times/news-outlets-trumpeted-hurs-story-now-discover-context-and-nuance-transcript"
  },
  {
    "text": "Biden Drowns While Tucker Rebounds … TRENDING ON TOWNHALL MEDIA  —  Schiff Attacked Special Counsel Hur for Reporting Biden's Failing Memory.  Here's What Happened Next.  —  ‘Drag Him, Queen!’  Patricia Heaton SCHOOLS Mark Ruffalo on His ‘Violent’ Oscars Symbolism",
    "url": "https://hotair.com/videos/2024/03/12/biden-drowns-while-tucker-rebounds-n3784575"
  },
  {
    "text": "Trump's Corruption-Policy Nexus Comes Into Focus  —  Did the disgraced former one-term president sell Social Security and Medicare the same way he sold his position on TikTok and Bud Light?  —  ∙ Paid  —  It didn't escape the Biden campaign's notice that Donald Trump abruptly changed … ",
    "url": "https://www.offmessage.net/p/trump-corruption-policy-nexus"
  },
  {
    "text": "Trump says pardoning Capitol attackers will be one of his first acts if elected again  —  In a Truth Social post, the ex-president said he will pardon ‘hostages’ convicted for their part in the Capitol attack in 2021  —  Donald Trump has said one of his first acts if given a second presidency … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/12/trump-january-6-pardons"
  },
  {
    "text": "Ken Buck announces he will leave Congress on March 22, scrambling race to replace him that includes Lauren Boebert  —  U.S. Rep. Ken Buck will leave Congress on March 22, the Windsor Republican announced Tuesday in a surprise decision that's sure to scramble the already highly contentious … ",
    "url": "https://coloradosun.com/2024/03/12/ken-buck-congress-departure-march-22/"
  },
  {
    "text": "Buck to retire next week, narrowing House GOP majority  —  Rep. Ken Buck (R-Colo.) will retire from Congress next week, he said Tuesday, a stunning announcement that will narrow the House GOP's razor-thin majority even further.  —  Buck — who has become known for breaking from his party … ",
    "url": "https://thehill.com/homenews/house/4526727-buck-retiring-next-week/"
  },
  {
    "text": "GOP Rep. Ken Buck to leave Congress at end of next week  —  Republican Rep. Ken Buck of Colorado, a hardline conservative who has clashed with his own party at times, announced on Tuesday that he will leave Congress at the end of next week.  —  Buck criticized dysfunction on Capitol Hill … ",
    "url": "https://www.cnn.com/2024/03/12/politics/ken-buck-leaving-congress-early/"
  },
  {
    "text": "Aileen Cannon Continues To Make A Mess Of The MAL Case  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  What Cannon Hath Wrought  —  Two developments yesterday that show what an absolute mess U.S. District Judge Aileen Cannon is making of the Mar-a-Lago case.",
    "url": "https://morningmemo.talkingpointsmemo.com/p/aileen-cannon-continues-to-make-a"
  },
  {
    "text": "Judiciary takes action on ‘judge shopping’ following pressure  —  The federal judiciary's policymaking arm announced a new policy aimed at combating so-called “judge shopping,” which has allowed state attorneys general and advocates to effectively choose their judges in some cases.",
    "url": "https://thehill.com/regulation/court-battles/4526979-judiciary-takes-action-judge-shopping/"
  },
  {
    "text": "House Republicans ‘hopeful’ Trump-opposed TikTok bill passes  —  House Republicans supporting a bill that could ban TikTok said Tuesday they are hopeful it will pass in a floor vote despite vocal opposition from President Trump.  —  The House is expected to vote Wednesday on a bill … ",
    "url": "https://thehill.com/policy/technology/4527027-house-republicans-hopeful-trump-opposed-tiktok-bill-passes/"
  },
  {
    "text": "Fewer than 100 House Republicans expected to attend GOP retreat … - Members who are skipping cited grievances ranging from the location to a lack of advance information on logistics.  — Fox Business host Larry Kudlow, who was slated to speak at the event, also cancelled at the 11th hour — dealing a blow to the agenda.",
    "url": "https://www.axios.com/2024/03/12/house-republican-retreat-infighting"
  },
  {
    "text": "Former Texas GOP official sentenced to 4 centuries in prison for child sex abuse  —  Bo Michael Dresner, a former precinct chairman for the Hays County, Texas Republican Party, was sentenced to more than four centuries in prison after pleading guilty to multiple counts of child sexual abuse … ",
    "url": "https://www.rawstory.com/republican-jail-sentence/"
  },
  {
    "text": "Uvalde police chief abruptly announces resignation days after report cleared officers in massacre at Robb Elementary School  —  Hours before the Uvalde City Council was expected to reject a report clearing local police officers of wrongdoing in the Robb Elementary School massacre, the city's police chief told CNN he is resigning.",
    "url": "https://www.cnn.com/2024/03/11/us/uvalde-former-mayor-report-robb-elementary"
  },
  {
    "text": "It Sure Seems Like the Courts Have Placed Christianity Above Other Faiths  —  “Religious freedom” is having a moment in federal courts.  One of the big successful goals of the conservative legal movement was that religious freedom would be advanced in a way that it supposedly had not been before.",
    "url": "https://slate.com/news-and-politics/2024/03/supreme-court-and-religion-judges-christianity.html"
  },
  {
    "text": "Bloodbath at the RNC as Team Trump Takes Over  —  There's a new team in town and the RNC is experiencing an overhaul.  Trump has installed his leadership team.  Monday the process of letting about 60 staffers go began.  —  The RNC staffers being let go are from the political, communications, and data departments.",
    "url": "https://hotair.com/karen-townsend/2024/03/12/bloodbath-at-the-rnc-as-team-trump-takes-over-n3784513"
  },
  {
    "text": "Aaron Rodgers and Jesse Ventura Top R.F.K. Jr.'s List for Running Mate  —  Mr. Kennedy said he had been speaking with the Jets quarterback “pretty continuously” for the past month.  —  Robert F. Kennedy Jr. has recently approached the N.F.L. quarterback Aaron Rodgers and the former Minnesota governor … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/rfk-jr-aaron-rodgers-jesse-ventura.html"
  },
  {
    "text": "Donald Trump Stung as New Poll Shows How Unpopular He Is  —  Donald Trump continues to have a low favorability score among Americans, new polling shows, despite being the likely Republican nominee after winning the lion's share of primaries and seeing off his only remaining rival.",
    "url": "https://www.newsweek.com/donald-trump-unpopular-polls-2024-election-1877870"
  },
  {
    "text": "Republican women don't care about rape victims  —  Forget the theatrics of Katie Britt, Nancy Mace and Marjorie Taylor Greene — supporting Trump means backing abusers  —  It can be confusing, tracking the multiple lawsuits journalist E. Jean Carroll filed against Donald Trump … ",
    "url": "https://www.salon.com/2024/03/12/women-dont-care-about-rape-victims/"
  }
]