[
  {
    "text": "US Navy loses $60 million jet at sea after it fell overboard from aircraft carrier  —  A US Navy F/A-18 Super Hornet fighter jet has been “lost” at sea after it fell overboard from the USS Harry S. Truman aircraft carrier while it was being towed on board, the Navy said in a statement on Monday.",
    "url": "https://cnn.com/2025/04/28/politics/us-navy-jet-overboard/"
  },
  {
    "text": "Canada election: Liberals will form next government, CBC News projects  —  Too soon to say whether it will be a minority or majority  —  Canada Votes 2025: Election night results and analysis  —  Canadians will vote on April 28 in an election that will determine the next prime minister.",
    "url": "https://www.cbc.ca/news/politics/livestory/canada-election-liberals-will-form-next-government-cbc-news-projects-9.6738893"
  },
  {
    "text": "Live Updates: Mark Carney Wins New Term as Canada's Prime Minister on Anti-Trump Platform  —  CBC/Radio Canada, the national broadcaster, projected a win for the Liberal Party in an extraordinary election that was dominated by President Trump's threats to Canada's sovereignty and its economy.",
    "url": "https://www.nytimes.com/live/2025/04/28/world/canada-election"
  },
  {
    "text": "Mark Carney elected Canada's prime minister  —  Carney cemented the Liberals' fourth-straight term in government, a rare feat in Canadian politics — defeating the Conservative Party led by Pierre Poilievre.  —  OTTAWA — Mark Carney was elected Canada's prime minister Monday … ",
    "url": "https://www.politico.com/news/2025/04/28/mark-carney-wins-canada-prime-minister-election-00314480"
  },
  {
    "text": "Civil rights lawyers leave en masse as Justice Dept. mission shifts  —  Civil rights director Harmeet K. Dhillon redirected her staff to focus on combating antisemitism, anti-Christian bias and what she calls “woke ideology.”  —  The new head of the Justice Department's civil rights division … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/28/justice-civil-rights-harmeet-dhillon-trump/"
  },
  {
    "text": "Trump Recasts Mission of Justice Dept.'s Civil Rights Office, Prompting ‘Exodus’  —  Hundreds of lawyers and other staff members are fleeing the arm of the agency that defends constitutional rights, which appointees intend to reshape to enact President Trump's agenda.",
    "url": "https://www.nytimes.com/2025/04/28/us/politics/trump-doj-civil-rights.html"
  },
  {
    "text": "DOGE employees gain accounts on classified networks holding nuclear secrets  —  Two members of Elon Musk's Department of Government Efficiency have been given accounts on classified networks that hold highly guarded details about America's nuclear weapons, two independent sources tell NPR.",
    "url": "https://www.npr.org/2025/04/28/nx-s1-5378684/doge-energy-department-nuclear-secrets-access"
  },
  {
    "text": "Strengthening and Unleashing America's Law Enforcement to Pursue Criminals and Protect Innocent Citizens  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/strengthening-and-unleashing-americas-law-enforcement-to-pursue-criminals-and-protect-innocent-citizens/"
  },
  {
    "text": "National Climate Assessment Authors Are Dismissed by Trump Administration  —  The Trump administration told researchers it was “releasing” them from their roles.  It puts the future of the assessment, which is required by Congress, in doubt.  —  The Trump administration has dismissed … ",
    "url": "https://www.nytimes.com/2025/04/28/climate/national-climate-assessment-authors-dismissed.html?unlocked_article_code=1.DU8.RwQp.4ddnldLkncw1&smid=bs-share"
  },
  {
    "text": "Karl Rove Guts Donald Trump in Scathing Fox News Interview: ‘In Very Bad Shape’  —  RAPID FAIL  —  The former adviser to former Vice President Dick Cheney said Americans no longer trust the president on the economy.  —  Fox News analyst Karl Rove tore into President Donald Trump … ",
    "url": "https://www.thedailybeast.com/karl-rove-guts-donald-trump-in-scathing-fox-news-interview-in-very-bad-shape/"
  },
  {
    "text": "CNN Poll: A growing majority says Trump has made the economy worse, with most skeptical of his tariff plans  —  A 59% majority of the public now says President Donald Trump's policies have worsened economic conditions in the country, according to a new CNN poll conducted by SSRS … ",
    "url": "https://cnn.com/2025/04/28/politics/poll-trump-economy-tariffs/"
  },
  {
    "text": "Trump Floats Improbable Income-Tax Cut Tied to Tariffs  —  President suggests eliminating income taxes on most households, but math doesn't add up  —  WASHINGTON—President Trump keeps suggesting that tariffs can replace income taxes for most Americans.  One big problem: The math doesn't work.",
    "url": "https://www.wsj.com/politics/policy/tariffs-income-taxes-revenue-8b647e6b?st=eRCoS2&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Karoline Leavitt Refuses to Rule Out Arrest of Supreme Court Judges … The Trump administration is open to arresting Supreme Court judges, as White House press secretary Karoline Leavitt told it on Monday morning.  —  “You guys arrested a Milwaukee County Circuit judge … ",
    "url": "https://newrepublic.com/post/194481/karoline-leavitt-arrest-supreme-court-judges"
  },
  {
    "text": "Connolly to step down as top Dem on Oversight, paving the way for generational change  —  Rep. Gerry Connolly, the top Democrat on the House Oversight and Government Reform Committee, will step down from his leadership post on the panel and not run for reelection.",
    "url": "https://www.politico.com/live-updates/2025/04/28/congress/connolly-to-step-down-as-top-oversight-dem-00312360"
  },
  {
    "text": "Irish woman living in US for decades detained by immigration officials  —  Cliona Ward, who had returned from trip to Ireland, held over criminal record from almost 20 years ago  —  An Irish woman who has lived legally in the US for four decades has been detained by immigration officials … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/28/irish-woman-cliona-ward-us-detained-immigration"
  },
  {
    "text": "Read The Atlantic's Interview With Donald Trump  —  A conversation with the president about executive power, Signalgate, and 24-karat gold  —  Editor's Note: Read The Atlantic's related cover story, “'I Run the Country and the World.'”  —  On thursday, april 24, I joined my colleagues Ashley Parker … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/donald-trump-oval-office-interview-excerpts/682623/?gift=I7tMEMRUhGy0dyKdoKBoOutMDL_rD1KLssN3Xxa6uoc&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Protecting American Communities from Criminal Aliens  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  Federal supremacy with respect to immigration, national security, and foreign policy is axiomatic.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/protecting-american-communities-from-criminal-aliens/"
  },
  {
    "text": "Congressman Shri Thanedar Introduces Articles of Impeachment Against President Donald J. Trump for High Crimes and Misdemeanors  —  Washington, DC - Today, Congressman Shri Thanedar (MI-13) introduced articles of impeachment against Donald J. Trump, President of the United States … ",
    "url": "https://thanedar.house.gov/media/press-releases/congressman-shri-thanedar-introduces-articles-of-impeachment-against-president-donald-j-trump-for-high-crimes-and-misdemeanors"
  },
  {
    "text": "Trump administration probes Harvard Law Review for alleged race-based discrimination  —  The Trump administration is probing financial ties, oversight procedures, selection policies and other documentation for both membership and article publication.  —  The Trump administration on Monday opened … ",
    "url": "https://www.politico.com/news/2025/04/28/trump-administration-probes-harvard-law-review-for-alleged-race-based-discrimination-00314418"
  },
  {
    "text": "Government Actually Threatens Wikipedia's Editorial Freedom; Self-Proclaimed Free Speech Warriors Suddenly Have Other Plans  —  When Trump officials want to censor speech, they don't quite say “we want to censor speech” (after all, they pretend to be the party that “brought free speech back.\")",
    "url": "https://www.techdirt.com/2025/04/28/government-actually-threatens-wikipedias-editorial-freedom-self-proclaimed-free-speech-warriors-suddenly-have-other-plans/"
  },
  {
    "text": "‘A great friend’: Audio undercuts Trump US attorney nominee's disavowal of alleged Nazi sympathizer  —  Ed Martin, the Trump-appointed interim US Attorney for the District of Columbia and nominee to serve in the role permanently, says he now regrets praising a Capitol rioter … ",
    "url": "https://cnn.com/2025/04/28/politics/kfile-ed-martin-disavows-alleged-nazi-sympathizer-he-previously-praised/"
  },
  {
    "text": "Congress Moving Forward On Unconstitutional Take It Down Act  —  Here's a puzzle: How do you write a law that's so badly designed that (1) the people it's meant to help oppose it, (2) the people who hate regulation support it, and (3) everyone involved admits it will be abused?",
    "url": "https://www.techdirt.com/2025/04/28/congress-moving-forward-on-unconstitutional-take-it-down-act/"
  },
  {
    "text": "Trump to Soften Blow of Automotive Tariffs  —  Companies paying Trump's car tariffs won't also be charged for other levies  —  WASHINGTON—President Trump is expected to soften the impact of his automotive tariffs, preventing duties on foreign-made cars from stacking on top of other tariffs … ",
    "url": "https://www.wsj.com/business/autos/trump-tariffs-autos-exceptions-fc634efd?st=9fKRWK&reflink=desktopwebshare_permalink"
  },
  {
    "text": "U.S. Department of Education's Office for Civil Rights Finds the University of Pennsylvania Has Violated Title IX  —  Today, the U.S. Department of Education's (ED) Office for Civil Rights (OCR) announced its finding that the University of Pennsylvania (UPenn) violated Title IX of the Education Amendments of 1972.",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-educations-office-civil-rights-finds-university-of-pennsylvania-has-violated-title-ix"
  },
  {
    "text": "FBI, national security agencies using polygraphs for ‘leak’ hunts  —  Current and former officials say the crackdown is creating a climate of fear and harming national security.  —  National security agencies across the Trump administration are ramping up investigations into alleged leaks to the news media … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/28/leak-polygraph-fbi-justice-odni-dhs/"
  },
  {
    "text": "Dem Says ICE Took Florida Mom From Baby, Unlawfully Deported Her To Cuba  —  “The separation of mother and daughter was so sudden and traumatic that their infant daughter was taken to the hospital,” Rep. Kathy Castor (D-Fla.) told Trump.  —  WASHINGTON - Rep. Kathy Castor (D-Fla.) … ",
    "url": "https://www.huffpost.com/entry/kathy-castor-florida-mom-deported-cuba-trump_n_680fbd18e4b049bc73d5d604"
  },
  {
    "text": "I Can't Believe Anyone Thinks Trump Actually Cares About Antisemitism  —  About a decade ago, conservatives would often denounce Muslim immigration on the grounds that it threatened Western progress on gay rights.  This posture, sometimes called homonationalism, got its start in Europe … ",
    "url": "https://www.nytimes.com/2025/04/28/opinion/trump-antisemitism-jews-israel.html"
  },
  {
    "text": "Ice seeking out unaccompanied immigrant children to deport or prosecute  —  Moves sparking fears of a crackdown on such children and prompting alarm about ‘backdoor family separation’  —  Immigration and Customs Enforcement (Ice) officials are seeking out unaccompanied immigrant children … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/28/ice-unaccompanied-immigrant-children"
  },
  {
    "text": "Donald Trump Jr. co-founds new private members club, Executive Branch, with a $500,000 fee … WATCH NOW  —  A new private membership club in Washington, D.C., co-founded by Donald Trump Jr., is charging a $500,000 membership fee — and there's already a waiting list.",
    "url": "https://www.cnbc.com/2025/04/28/donald-trump-jr-private-members-club-executive-branch.html"
  },
  {
    "text": "Far-right fight groups endorse ‘youth clubs’ targeting US young men and boys  —  Using fitness and sports as an entry points to their neo-Nazi ideologies, ‘youth club’ chapters are proliferating across US  —  A national network of American neofascist fight clubs is endorsing youth-oriented offshoots aimed … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/28/active-youth-clubs-neo-nazi-groups"
  },
  {
    "text": "Rev. William Barber arrested in Capitol Rotunda after praying against Republican-led budget  —  (RNS) — While arrests of protesters at the Capitol is not unusual, the response to Barber's prayer was unusually dramatic: After issuing verbal warnings, dozens of officers expelled everyone in the Rotunda — including credentialed press.",
    "url": "https://religionnews.com/2025/04/28/william-barber-arrested-in-capitol-rotunda-after-prayer-challenging-republican-budget/"
  },
  {
    "text": "White evangelicals continue to stand out in their support for Trump  —  Roughly three months into President Donald Trump's second term, White evangelical Protestants continue to be among his strongest supporters:  — 72% approve of the way Trump is currently handling his job as president.",
    "url": "https://www.pewresearch.org/short-reads/2025/04/28/white-evangelicals-continue-to-stand-out-in-their-support-for-trump/"
  },
  {
    "text": "Trump lashes out against “fake polls” as his approval ratings sink  —  President Trump, in an early morning Truth Social post Monday, slammed “FAKE POLLS FROM FAKE NEWS ORGANIZATIONS” that he said should be “investigated for ELECTION FRAUD.”  —  The big picture: As Trump nears the first 100 days … ",
    "url": "https://www.axios.com/2025/04/28/trump-approval-ratings-slams-polls-truth-social"
  },
  {
    "text": "Judge questions US Defense Department role in Venezuelans' deportations  —  A federal judge ordered the Trump administration on Monday to turn over the names of any migrants flown recently from the U.S. naval base in Guantanamo Bay to El Salvador so he could determine whether they were deported in violation of a court order he issued.",
    "url": "https://www.reuters.com/world/us/judge-questions-us-defense-department-role-venezuelans-deportations-2025-04-28/"
  }
]