[
  {
    "text": "The Conspiracy of Silence to Protect Joe Biden  —  The president's mental decline was like a dark family secret for many elite supporters.  —  President Joe Biden walked before a row of flags and took his place at a lectern stamped with the presidential seal.",
    "url": "https://nymag.com/intelligencer/article/conspiracy-of-silence-to-protect-joe-biden.html"
  },
  {
    "text": "Disney heiress, wealthy Democratic donors say they won't finance the party until Joe Biden drops out … President Joe Biden is facing an uprising from some his own party's wealthy donors, including an heiress to the Disney family fortune, who say they will no longer fund … ",
    "url": "https://www.cnbc.com/2024/07/04/democratic-donors-wont-finance-party-until-joe-biden-drops-out.html"
  },
  {
    "text": "Biden Tells Governors He Needs to Sleep More and Work Less at Night  —  The president's opening remark to a group of key Democratic leaders — that he was in the race to stay — chilled any talk of his withdrawal, participants said.  —  President Biden told a gathering of Democratic governors … ",
    "url": "https://www.nytimes.com/2024/07/04/us/politics/biden-governors.html"
  },
  {
    "text": "Biden tells Democratic governors he needs more sleep and plans to stop scheduling events after 8 p.m.  —  President Joe Biden told Democratic governors during a meeting at the White House on Wednesday that part of his plan going forward is to stop scheduling events after 8 p.m. so that he can get more sleep … ",
    "url": "https://www.cnn.com/2024/07/04/politics/biden-governors-sleep/"
  },
  {
    "text": "Major Democratic Donors Devise Plans to Pressure Biden to Step Aside  —  The president appears intent on remaining on the ballot, while wealthy donors are discussing plans to put their money elsewhere.  —  After several days of quiet griping and hoping that President Biden would abandon … ",
    "url": "https://www.nytimes.com/2024/07/04/us/politics/biden-donors.html"
  },
  {
    "text": "Trump Turns Kamala F-Word Rant into Ad: ‘No Tax on Tips’  —  LET'S ROLL  —  The Daily Beast revealed Trump's foulmouthed verdict on his Democratic rival and his possible replacement.  But Trump focused on the tip he gave his caddy.  —  First Donald Trump was caught on video … ",
    "url": "https://www.thedailybeast.com/donald-trump-turns-kamala-harris-f-word-rant-into-campaign-ad-no-tax-on-tips"
  },
  {
    "text": "Criminal Trump is clearly unfit for office  —  It's been a brutal week for American democracy.  President Joe Biden's surprisingly poor performance in the presidential debate has thrown many in the Democratic Party into full panic mode.  —  In the aftermath of the debate … ",
    "url": "https://www.theframelab.org/unfit-for-office-trump-biden/"
  },
  {
    "text": "If Joe Biden Were as Ruthless About Immunity as Donald Trump ...  Picture if you can, imagine if you will, this Oval Office address by President Biden:  —  Good evening, my fellow Americans.  With the close of the current session of the Supreme Court, I want to report to you on my compliance … ",
    "url": "https://newrepublic.com/article/183422/joe-biden-ruthless-immunity-donald-trump"
  },
  {
    "text": "‘Bitter old man’: Trump shredded for egocentric and rambling July 4th rant  —  Former President Donald Trump kicked off the Fourth of July with a lengthy screed on Truth Social praising himself and lobbing insults at President Joe Biden and Vice President Kamala Harris … ",
    "url": "https://www.rawstory.com/trump-july-4-2668688196/"
  },
  {
    "text": "Brazilian police indict ex-President Bolsonaro in undeclared diamonds case, sources say  —  Brazil's Federal Police have indicted former President Jair Bolsonaro for money laundering and criminal association in connection with undeclared diamonds the far-right leader received from Saudi Arabia during … ",
    "url": "https://apnews.com/article/bolsonaro-indictment-brazil-money-laundering-e740dfd750f96f02c44b282aa667fea2"
  },
  {
    "text": "‘We Must Not Fail’: Cheney Offers Stark 4th of July Warning About Trump And His Threats to ‘Unravel Our Republic’  —  Ex-Rep. Liz Cheney (R-WY) offered a stark message for July 4th as the country ponders President Joe Biden's mental fitness and the likelihood of Donald Trump returning to the White House.",
    "url": "https://www.mediaite.com/news/we-must-not-fail-cheney-offers-stark-4th-of-july-warning-about-trump-and-his-threats-to-unravel-our-republic/"
  },
  {
    "text": "Viktor Orbán to meet Vladimir Putin after Kyiv trip  —  Hungary's PM seeks to broker peace talks after opposing western support for Ukraine in Russia's invasion  —  Viktor Orbán is expected to meet Vladimir Putin on Friday just after the Hungarian leader's first wartime visit … ",
    "url": "https://www.ft.com/content/d3b86bec-f847-4ed8-945e-8f00c0fe0066"
  },
  {
    "text": "South Korean Man Sentenced to 15 Years for Stabbing Party Leader  — Lee Jae-myung survived the January attack after surgery  — Assailant didn't want to see Lee become president, police say  —  A South Korean court sentenced a man to 15 years in prison for stabbing the leader … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-05/south-korean-man-sentenced-to-15-years-for-stabbing-party-leader"
  },
  {
    "text": "COVID-19 can surge throughout the year  —  AT A GLANCE … Summary  —  What CDC knows  —  In the United States, respiratory virus illnesses typically peak during the fall and winter.  These peaks are due to several factors, including human behaviors and environmental conditions … ",
    "url": "https://www.cdc.gov/ncird/whats-new/covid-19-can-surge-throughout-the-year.html"
  }
]