[
  {
    "text": "Boosts in Democratic excitement help Harris reset the race against Trump — CBS News poll  —  Boosted by Democrats, younger and Black voters becoming more engaged and likely to vote, and by women decidedly thinking she'd favor their interests more, Vice President Kamala Harris has reset the 2024 presidential race.",
    "url": "https://www.cbsnews.com/news/poll-harris-trump-cbs-news/"
  },
  {
    "text": "Trump White House Aides Desert Donald for Kamala in ‘Republicans for Harris’ Drive  —  ‘TOXIC TRUMP’  —  Defectors include former Trump White House Press Secretary Stephanie Grisham.  —  Dozens of well-known Republicans including a couple of former Trump White House staffers … ",
    "url": "https://www.thedailybeast.com/trump-white-house-aide-stefanie-grisham-joins-kamala-in-republicans-for-harris-drive"
  },
  {
    "text": "Harris team launches GOP group with endorsements from ex-Trump officials, key Republican voices  —  Vice President Harris's campaign launched “Republicans for Harris” with more than 25 GOP endorsements, including former secretaries Chuck Hagel and Ray LaHood, as well as former GOP governors and lawmakers.",
    "url": "https://thehill.com/homenews/campaign/4809725-kamala-harris-campaign-gop-initiative-prominent-republican-voices/"
  },
  {
    "text": "Republicans for Harris launches, aiming for Biden-like appeal to anti-Trump voters  —  The group known as Republicans for Biden is officially relaunching Sunday as Republicans for Harris, and aides on the revamped Democratic campaign are hoping that a much different candidate will be able … ",
    "url": "https://www.cnn.com/2024/08/04/politics/republicans-for-harris-anti-trump-gop-voters/"
  },
  {
    "text": "UAW president says Beshear, Walz are union's “top two” VP picks for Harris  —  Washington — United Auto Workers President Shawn Fain says Kentucky Gov. Andy Beshear and Minnesota Gov. Tim Walz are the union's top two picks for Vice President Kamala Harris' running mate, though he noted that the decision is hers to make.",
    "url": "https://www.cbsnews.com/news/beshear-walz-are-uaws-vp-picks-harris/"
  },
  {
    "text": "Nancy Pelosi on Harris, Trump, and “The Art of Power”  —  There is no denying the impact that Speaker Emerita Nancy Pelosi, the 19-term Democrat from California, has had on Congress and the country, as she details in her new book, “The Art of Power.”  Pelosi talks with “60 Minutes” … ",
    "url": "https://www.cbsnews.com/video/nancy-pelosi-on-harris-trump-and-the-art-of-power/"
  },
  {
    "text": "Gorsuch on Biden Supreme Court proposals: ‘Be careful’  —  The justice said an independent judiciary “means that when you're unpopular, you can get a fair hearing.”  —  Justice Neil Gorsuch is pushing back against President Joe Biden's recent proposals to restructure the Supreme Court.",
    "url": "https://www.politico.com/news/2024/08/04/gorsuch-biden-supreme-court-proposals-00172574"
  },
  {
    "text": "Democracy dies if we drop the case of Trump, Egypt and $10 million in cash  —  America's Founders were a little unclear about a lot of stuff — we're still arguing after 233 years about just what the heck they were saying about guns in the Second Amendment — but they seemed very adamant … ",
    "url": "https://www.inquirer.com/opinion/commentary/trump-sisi-egypt-10-million-bribe-20240804.html"
  },
  {
    "text": "Elon Musk PAC being investigated by Michigan secretary of state for potential violations … A political action committee backed by billionaire Elon Musk is under investigation in Michigan amid efforts to collect voter data.  —  Musk, the CEO of Tesla and SpaceX, has said he created … ",
    "url": "https://www.cnbc.com/2024/08/04/elon-musk-pac-investigated-michigan.html"
  },
  {
    "text": "Former Trump administration official Kellyanne Conway registers as lobbyist for Ukrainian billionaire with past ties to Trump  —  Victor Pinchuk donated $150,000 to Trump's charitable organization in 2015.  —  Former Trump counselor Kellyanne Conway speaks on stage on the third … ",
    "url": "https://abcnews.go.com/Politics/former-trump-adviser-kellyanne-conway-registers-lobbyist-ukrainian-victor-pinchuk/story?id=112559343"
  },
  {
    "text": "How a Washington Tax Break for Data Centers Snowballed Into One of the State's Biggest Corporate Giveaways  —  Companies have saved $474 million since 2018, with most of the windfall going to Washington-based tech giant Microsoft.  Lawmakers repeatedly expanded who qualifies, and they lowered the number of jobs expected in return.",
    "url": "https://www.propublica.org/article/washington-data-centers-tech-jobs-tax-break"
  },
  {
    "text": "Biden is a master of confronting no-win scenarios  —  Of all the cultural artifacts that the Star Trek franchise has provided us, the Kobayashi Maru scenario may loom largest.  —  First described in “Star Trek II: The Wrath of Khan,” the Kobayashi Maru wargame put aspiring Starfleet officers … ",
    "url": "https://thehill.com/opinion/white-house/4809318-biden-is-a-master-of-confronting-no-win-scenarios/"
  },
  {
    "text": "What's Rattling Trump: The Size of Harris's Crowds  —  The numbers game is everything to Donald J. Trump.  Vice President Kamala Harris's first big rally appears to have gotten under his skin.  —  When former President Donald J. Trump walked onto the stage at his rally in Atlanta on Saturday … ",
    "url": "https://www.nytimes.com/2024/08/04/us/politics/whats-rattling-trump-the-size-of-harriss-crowds.html?unlocked_article_code=1.AU4.g0O8.0wAVpWOJxFO5&smid=url-share"
  },
  {
    "text": "Ukraine finally deploying F-16 fighter jets, says Zelenskiy  —  Ukrainian pilots have started flying F-16s for operations within the nation, President Volodymyr Zelenskiy said on Sunday, confirming the long-awaited arrival of the U.S.-made fighter jets more than 29 months since Russia's invasion.",
    "url": "https://www.reuters.com/world/europe/ukraine-finally-deploying-f-16-fighter-jets-says-zelenskiy-2024-08-04/"
  },
  {
    "text": "Trump reopens old feud in Georgia.  Some Republicans are scratching their heads.  —  Some Republicans warned Trump's comments could threaten his already shaky prospects in the state.  —  Former President Donald Trump is reopening an old feud with Republicans in Georgia.",
    "url": "https://www.politico.com/news/2024/08/03/trump-brian-kemp-georgia-00172564"
  }
]