[
  {
    "text": "Conservatives plot challenge against Johnson in internal Speaker elections  —  Hardline conservatives are plotting to challenge Speaker Mike Johnson (R-La.) for the gavel during Wednesday's internal House GOP elections, four sources familiar with the matter told The Hill.",
    "url": "https://thehill.com/homenews/house/4986503-gop-conservatives-challenge-speaker-johnson/"
  },
  {
    "text": "Johnson: Trump not expected to pick more admin members from House GOP  —  House GOP leadership is urging President-elect Donald Trump to refrain from tapping any more Republican members for his administration — at least for now.  Republicans have not officially clinched the House majority yet … ",
    "url": "https://www.politico.com/live-updates/2024/11/12/congress/trump-not-expected-to-tap-more-house-members-00189003"
  },
  {
    "text": "Trump Draft Executive Order Would Create Board to Purge Generals  —  The panel could upend the military review process and raise concerns about the politicization of the military  —  WASHINGTON—The Trump transition team is considering a draft executive order that establishes a “warrior board” … ",
    "url": "https://www.wsj.com/politics/national-security/trump-draft-executive-order-would-create-board-to-purge-generals-7ebaa606?st=Phr48B&reflink=article_copyURL_share"
  },
  {
    "text": "Trump picks Kristi Noem to serve as his Homeland Security secretary  —  President-elect Donald Trump has selected South Dakota Gov. Kristi Noem as his next secretary of the Department of Homeland Security, according to two people familiar with the selection.",
    "url": "https://www.cnn.com/2024/11/12/politics/kristi-noem-homeland-security-secretary/"
  },
  {
    "text": "Putin Isn't Fighting for Land in Ukraine  —  And Biden has mere weeks to give the Ukrainians the resources they need to fight.  —  russian drone and missile strikes on Ukrainian targets have increased in frequency in the week since the U.S. election, killing civilians and destroying another dam.",
    "url": "https://www.theatlantic.com/international/archive/2024/11/biden-trump-ukraine/680632/?gift=hVZeG3M9DnxL4CekrWGK3-1_K7E1RdOWOBSJN46wpFA&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Russia Attempts to Collect Its Winnings  —  Russia has been engaged in a good deal of dick-wagging with Trump since the election.  —  After Trump won, Russia did not call to congratulate — at least as far as we know (though Viktor Orbán seems to be Trump's handler and he did).",
    "url": "https://www.emptywheel.net/2024/11/12/russia-attempts-to-collect-its-winnings/"
  },
  {
    "text": "Pentagon secrets leaker Jack Teixeira sentenced to 15 years in prison by a federal judge  —  A federal judge on Tuesday sentenced a Massachusetts Air National Guard member to 15 years in prison after he pleaded guilty to leaking highly classified military documents about the war in Ukraine.",
    "url": "https://apnews.com/article/jack-teixeira-pentagon-leak-sentence-e67e18f310101b2f1c894ca1b550a3eb"
  },
  {
    "text": "Robert F. Kennedy Jr. Reveals Plans to Fire 600 Federal Health Workers  —  The Trump ally and anti-vax conspiracist takes aim at the agencies he loathes.  —  At an event late last week in Arizona, anti-vaccine activist and Donald Trump transition team member Robert F. Kennedy Jr. said he'd fire … ",
    "url": "https://www.motherjones.com/politics/2024/11/robert-f-kennedy-jr-national-institutes-of-health/"
  },
  {
    "text": "Putin Aide Issues Ominous Warning About Trump's New “Obligations” … Donald Trump may have secured a second term in the White House, but his Russia problems are far from over—at least according to suspiciously phrased comments by some of Russian President Vladimir Putin's closest allies.",
    "url": "https://newrepublic.com/post/188284/vladimir-putin-donald-trump-election-obligations"
  },
  {
    "text": "It's 2004 all over again  —  I wish I could give you a crystal-clear sense of what Democrats felt like in 2004 after George W. Bush was elected to a second term.  But the truth is, my memories of that time are hazy.  That's partly because I was a twentysomething doing dumb twentysomething things … ",
    "url": "https://www.natesilver.net/p/its-2004-all-over-again"
  },
  {
    "text": "Rubio news triggers MAGA backlash  —  Some Trump diehards are holding out hope for Ric Grenell for the top foreign policy post.  —  Shortly after news leaked that Donald Trump was expected to name Sen. Marco Rubio as his secretary of state, some of the most MAGA-minded online warriors rushed … ",
    "url": "https://www.politico.com/news/2024/11/12/rubio-news-triggers-maga-backlash-00189024"
  },
  {
    "text": "Trump picks former Arkansas Gov. Mike Huckabee to be ambassador to Israel  —  President-elect Donald Trump will nominate former Arkansas Gov. Mike Huckabee as ambassador to Israel, Trump announced Tuesday.  Huckabee is a staunch defender of Israel and his intended nomination comes … ",
    "url": "https://apnews.com/article/trump-transition-white-house-staff-huckabee-f51121db5b18814bbab014e872c2a736"
  },
  {
    "text": "Donald Trump names former intelligence chief John Ratcliffe to CIA director  —  WASHINGTON − President-elect Donald Trump designated his former Director of National Intelligence John Ratcliffe, to become director of the Central Intelligence Agency.  —  Prior to being appointed by Trump … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/11/12/trump-john-ratcliffe-cia-transition/76201901007/"
  },
  {
    "text": "They Turned Against Kamala Harris in Decisive Numbers.  They're About to Find Out if It Was Worth It.  —  Dearborn, Michigan, turned against Kamala Harris decisively.  Now the city is about to find out if Trump was worth it.  —  On election night, at a political watch party, Abbas Alawieh … ",
    "url": "https://slate.com/news-and-politics/2024/11/election-results-2024-trump-harris-michigan-muslim.html"
  },
  {
    "text": "Mike Pence Comes Out Against Trump's Plan to Pardon January 6 Rioters: ‘Literally Praying’ Trump and Vance Uphold Their Oaths  —  Former Vice President Mike Pence spoke at the Dispatch's Summit 2024 and made clear he opposes President-elect Donald Trump's plan to pardon January 6 rioters - especially those who attacked police.",
    "url": "https://www.mediaite.com/politics/mike-pence-comes-out-against-trumps-plan-to-pardon-january-6-rioters-literally-praying-trump-and-vance-uphold-their-oaths/"
  },
  {
    "text": "Scoop: Alina Habba Emerges as Front-Runner For Trump Press Secretary  —  Alina Habba, a lawyer who represented Donald Trump in a series of high-profile cases, has emerged as a front-runner to serve as press secretary in the incoming White House, four sources told Mediaite.",
    "url": "https://www.mediaite.com/trump/scoop-alina-habba-emerges-as-front-runner-for-trump-press-secretary/"
  },
  {
    "text": "Who is Lee Zeldin?  Six things to know about Trump's selection for EPA chief  —  President-elect Trump on Monday announced former Rep. Lee Zeldin (R-N.Y.) as his nominee to lead the Environmental Protection Agency (EPA).  —  Zeldin has a fairly thin track record on environmental policy … ",
    "url": "https://thehill.com/policy/energy-environment/4985716-zeldin-epa-nominee-trump/"
  },
  {
    "text": "Hispanic groups challenge data on Trump's Latino inroads … - In Michigan, Trump won 58% of Latino voters compared to just 39% for Harris, according to the Edison poll. … - In San Diego's eighth council district, which is roughly 75% Latino, Trump got 40% of the vote, local election analyst Mason Herron points out.",
    "url": "https://www.axios.com/2024/11/12/trump-latino-voters-unidos-us"
  },
  {
    "text": "Lighthizer and his allies lay groundwork for Trump's massive new tariffs  —  Preemptive efforts to counter expected criticism of tariffs signal an even greater shake-up on trade during Trump's second term.  —  President-elect Donald Trump's former trade chief and those close to him are preparing … ",
    "url": "https://www.politico.com/news/2024/11/12/lighthizer-trump-new-tariff-plan-00189114"
  },
  {
    "text": "‘Extraordinary circumstances’: NY judge in Trump case pauses all court deadlines, sentencing  —  The 34 convictions could have placed President-elect Donald Trump in prison for up to 4 years  —  The Manhattan judge overseeing President-elect Donald Trump's trial agreed to grant a stay … ",
    "url": "https://www.foxnews.com/politics/trumps-new-york-convictions-ruling-issued"
  },
  {
    "text": "Exxon Chief to Trump: Don't Withdraw From Paris Climate Deal  —  Darren Woods was one of only a few Western oil executives attending a global climate conference in Baku, Azerbaijan.  —  Darren Woods, the chief executive of Exxon Mobil, cautioned President-elect Donald J. Trump on Tuesday … ",
    "url": "https://www.nytimes.com/2024/11/12/business/energy-environment/exxon-mobil-baku-climate-cop29.html"
  },
  {
    "text": "Trump expected to try to halt TikTok ban, allies say  —  The president-elect promised to ‘save’ the social media app, which faces a deadline early next year to find a non-China-based owner.  —  President-elect Donald Trump is expected to try to halt a potential U.S. ban of TikTok next year … ",
    "url": "https://www.washingtonpost.com/business/2024/11/12/trump-tiktok-ban-sale/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxMzg3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyNzY5OTk5LCJpYXQiOjE3MzEzODc2MDAsImp0aSI6IjBhNjM5Y2Y2LTZiNGEtNGUxYy05ODViLWE3ODIxYThkZjk1ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzExLzEyL3RydW1wLXRpa3Rvay1iYW4tc2FsZS8ifQ.B2J5DrxizzWKBOHvs2_RS81jrI7m9P44kHiRfTL9rWU"
  },
  {
    "text": "The Sickest Patients Are Fleeing Private Medicare Plans—Costing Taxpayers Billions  —  Medicare Advantage patients in the last year of life were far more likely to switch to traditional Medicare, shifting costs from insurers",
    "url": "https://www.wsj.com/health/healthcare/medicare-private-plans-insurers-389af1a0?st=fHKExT&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Kamala Harris Did Listen To Working-Class Voters.  They Didn't Listen To Trump.  —  Plus, the shocking New Jersey result, and the connection between the election and “The Big Lebowski” — all in the November 12, 2024 newsletter.  —  One week later and the Democratic Party's self-flagellation continues.",
    "url": "https://washingtonmonthly.com/2024/11/12/kamala-harris-did-listen-to-working-class-voters-they-didnt-listen-to-trump/"
  },
  {
    "text": "“Babydog” banned: Jim Justice's bulldog can't visit Senate floor … - Justice, the current West Virginia governor, is in Washington for orientation alongside his fellow incoming senators.  — He asked Tuesday if Babydog could join him on the Senate floor and was told no by staff, the sources said.",
    "url": "https://www.axios.com/2024/11/12/babydog-jim-justice-senate-floor"
  },
  {
    "text": "Will the American project survive the anger of white men?  —  At key moments throughout US history, white male anger has been privileged over national security, progress or basic welfare  —  A friend recently asked: “Do you think the United States will survive the anger of white men?”",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/12/trump-white-men-anger-american-history"
  },
  {
    "text": "Supreme Court rejects Mark Meadows appeal in Georgia election interference case  —  Donald Trump's former White House chief of staff failed in his bid to move the case to federal court to mount immunity arguments.  —  WASHINGTON — The Supreme Court on Tuesday dealt a setback … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-mark-meadows-appeal-georgia-election-interferenc-rcna178727"
  },
  {
    "text": "William McGinley tapped as Trump's White House Counsel  —  William McGinley served in the first administration for Trump as the White House Cabinet secretary  —  William McGinley is returning to the Trump White House to serve as his White House Counsel, President-elect Trump announced.",
    "url": "https://www.foxnews.com/politics/william-mcginley-tapped-trumps-white-house-counsel"
  }
]