[
  {
    "text": "Trump Pauses Military Aid to Ukraine After Clash With Zelenskiy  — Move halts all aid currently in transit to help Ukraine  — Pause comes after Trump and Zelenskiy sparred in Oval Office  —  President Donald Trump ordered a pause to all military aid to Ukraine … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-03/trump-pauses-military-aid-to-ukraine-after-clash-with-zelenskiy"
  },
  {
    "text": "Trump pauses US military aid to Ukraine while pressuring Zelenskyy to move toward quick end to war  —  President Donald Trump on Monday directed a “pause” to U.S. assistance to Ukraine as he seeks to pressure Ukrainian President Volodymyr Zelenskyy to engage in negotiations to end the war with Russia.",
    "url": "https://apnews.com/article/trump-zelenskyy-russia-ukraine-a15a459c9a3a393d040478ebbe250a9e"
  },
  {
    "text": "U.S. Hitting Brakes on Flow of Arms to Ukraine  —  Military financing has been stopped, and officials are meeting to consider suspending another type of assistance  —  The Trump administration has stopped financing new weapons sales to Ukraine and is considering freezing weapons shipments … ",
    "url": "https://www.wsj.com/politics/national-security/u-s-hitting-brakes-on-flow-of-arms-to-ukraine-980a71d1?st=aJxsDd"
  },
  {
    "text": "Dow tumbles more than 600 points, S&P 500 posts biggest loss since December as Trump says tariffs will proceed  —  The S&P 500 retreated on Monday, extending February's rout and turning red for the year after President Donald Trump's confirmation of forthcoming tariffs ratcheted up economic concerns.",
    "url": "https://www.cnbc.com/2025/03/02/stock-futures-rise-slightly-in-overnight-trading-as-investors-await-tariff-news-live-updates.html"
  },
  {
    "text": "Top FBI official forced out after criticizing Trump pursuit of agents who investigated Jan. 6  —  James Dennehy, the head of the FBI's New York office, is out one month after he urged colleagues to “dig in” after the new administration requested the names of all agents who worked on Capitol riot cases.",
    "url": "https://www.nbcnews.com/politics/justice-department/top-fbi-official-forced-criticizing-trump-pursuit-agents-investigated-rcna194610"
  },
  {
    "text": "Social Security Checks Could Stop Going Out by April, Ex-Head Warns  —  WARNING  —  The former Social Security commissioner said the system could “collapse,” causing disruptions in payments within “30 to 90 days.”",
    "url": "https://www.thedailybeast.com/former-social-security-head-warns-system-could-collapse-in-next-30-to-90-days/"
  },
  {
    "text": "‘Prelude to privatization:’ Social Security confirms workforce reduction targets, continues to shutter offices  —  The Social Security Administration in recent days has initiated a flurry of actions aimed at decimating its workforce and that Democrats warn are an effort to sabotage the agency and prepare to privatize its functions.",
    "url": "https://www.govexec.com/workforce/2025/03/prelude-privatization-social-security-confirms-workforce-reduction-targets-continues-shutter-offices/403439/"
  },
  {
    "text": "Theme of Trump's address to Congress revealed  —  President scheduled to speak before full Congress on Tuesday at 9 pm EST  —  Join Fox News for access to this content  —  FIRST ON FOX: The “Renewal of the American Dream” is the theme of President Donald Trump's first address of his second term … ",
    "url": "https://www.foxnews.com/politics/theme-trumps-address-congress-revealed"
  },
  {
    "text": "DOGE moves to cancel NOAA leases on key weather buildings … - It was designed to integrate multiple forecasting centers in one building to improve operating efficiency. … - Two ex-National Oceanic and Atmospheric Administration officials also confirmed the list.",
    "url": "https://www.axios.com/2025/03/03/doge-noaa-weather-building-leases-trump"
  },
  {
    "text": "Struggling With Errors, DOGE Deletes Billions More From List of Savings  —  For the second time in a week, Elon Musk's government overhaul effort updated its “wall of receipts” to remove mistakes that inflated its success.  —  Elon Musk's Department of Government Efficiency has deleted hundreds … ",
    "url": "https://www.nytimes.com/2025/03/03/us/politics/doge-musk-contracts-wall.html"
  },
  {
    "text": "Ontario will cut off U.S. electricity exports ‘with a smile on my face,’ Ford says  —  “They rely on our energy, they need to feel the pain,” Premier Doug Ford said Monday on cutting Ontario electricity exports to U.S.  —  OTTAWA — As Canada prepares for U.S. President Donald Trump to unleash … ",
    "url": "https://torontosun.com/news/provincial/ontario-will-cut-off-u-s-electricity-exports-with-a-smile-on-my-face-ford-says"
  },
  {
    "text": "Planes receive mysterious false midair collision alerts near Reagan National Airport  —  The Federal Aviation Administration is investigating why multiple commercial flights about to land at Ronald Reagan National Airport, near Washington DC, repeatedly received midair collision alerts … ",
    "url": "https://www.cnn.com/2025/03/03/us/planes-false-alerts-midair-collision/"
  },
  {
    "text": "Trump orders swathes of US forests to be cut down for timber  —  President's move to expand tree cutting across 280m acres evades rules to protect endangered species  —  Donald Trump has ordered that swathes of America's forests be felled for timber, evading rules to protect endangered species … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/03/trump-national-forest-executive-order"
  },
  {
    "text": "Elon Musk's $1 Spending Limit Is Paralyzing Federal Agencies  —  The DOGE-mandated credit card freeze is delaying shipments of critical supplies, stalling travel, and stopping employees from doing their jobs.  —  Last month, the Trump administration placed a $1 spending limit … ",
    "url": "https://www.wired.com/story/doge-elon-musk-spending-cuts-federal-workers/"
  },
  {
    "text": "U.S. Attorney Rebuffed by Justice Dept. in Push to Escalate Inquiry Into Schumer  —  Ed Martin, the acting U.S. attorney in Washington, has been blocked so far in seeking a grand jury investigation into remarks made by Senator Chuck Schumer about Supreme Court justices.",
    "url": "https://www.nytimes.com/2025/03/03/us/politics/us-attorney-justice-dept-schumer-inquiry.html"
  },
  {
    "text": "Shell-Shocked at CBS  —  As Paramount's merger with Skydance nears the finish line, CBS News chief Wendy McMahon and “60 Minutes” boss Bill Owens have faced escalating pressure to settle Donald Trump's lawsuit—including from incoming president Jeff Shell.",
    "url": "https://www.status.news/p/paramount-cbs-60-minutes-lawsuit-settlement-talks"
  },
  {
    "text": "Kennedy sends mixed vaccine messages amid Texas measles outbreak  —  In the first test of the Trump administration's outbreak response, Health and Human Services Secretary (HHS) Robert F. Kennedy Jr. has been sending mixed messages about a rapidly spreading measles outbreak in Texas.",
    "url": "https://thehill.com/policy/healthcare/5173889-trump-administration-measles-response/"
  },
  {
    "text": "Trump Orders Permanent Govt Shutdown - No, Really ...  It hasn't gotten a lot of attention but Donald Trump's February 11th “workforce optimization” executive order provides a very clear framework for the end stage goal of all the cutting.  After a bunch of specific imperatives listed under Section 3-C … ",
    "url": "https://talkingpointsmemo.com/edblog/trump-orders-permanent-govt-shutdown-no-really"
  },
  {
    "text": "Trump Bid to Take Over Postal Service Could Threaten Mail Voting  —  President Donald Trump may soon attempt to absorb the U.S. Postal Service (USPS), an independent agency, into his administration by issuing an executive order that reportedly would dissolve the service's leadership.",
    "url": "https://www.democracydocket.com/analysis/trump-postal-service-executive-order-mail-voting-threat/"
  },
  {
    "text": "Trump Celebrates After Killing Anti-Money-Laundering Law  —  Donald Trump is celebrating his administration's move to ignore a law that targeted money laundering.  —  On Sunday, the Treasury Department announced that it would stop enforcing “any penalties or fines associated … ",
    "url": "https://newrepublic.com/post/192244/trump-celebrates-destroy-anti-money-laundering-law"
  },
  {
    "text": "Monday check-in: Still no word from SCOTUS on USAID payments case  —  Also: A ruling that Trump illegally fired Hampton Dellinger as head of the Office of Special Counsel.  And: Three Friday rulings — on firings, trans rights, and refugees.  —  After a long week last week … ",
    "url": "https://www.lawdork.com/p/still-no-word-from-scotus-usaid-payments-case"
  }
]