[
  {
    "text": "Bongino still in limbo as Trump fumes and JD Vance seeks to play mediator, sources say  —  Several of President Donald Trump's top officials went to work on Monday with a key question unanswered: would Dan Bongino show up today?  —  The deputy FBI director did not go into the office Friday … ",
    "url": "https://cnn.com/2025/07/14/politics/dan-bongino-epstein"
  },
  {
    "text": "Trump's Jeffrey Epstein post contradicts what top Fox hosts have argued  —  Just months ago, Trump allies claimed the deep state hid the “Epstein Files.”  Trump now claims that they were fabricated all along.  —  President Donald Trump claimed Sunday that the “Epstein Files” … ",
    "url": "https://www.mediamatters.org/fox-news/trumps-jeffrey-epstein-post-contradicts-what-top-fox-hosts-have-argued"
  },
  {
    "text": "The Five MAGA Factions Waging an Epstein Civil War  —  The Leopard Will Eat the Face  —  TRUMP WORLD FELL INTO CHAOS just before the weekend, as the shock from the Justice Department's Jeffrey Epstein memo continued to reverberate.  Donald Trump's initial response—a long Saturday-afternoon post … ",
    "url": "https://www.thebulwark.com/p/five-maga-factions-waging-civil-war-jeffrey-epstein"
  },
  {
    "text": "Why Trump Can't Make the Epstein Story Go Away  —  Donald Trump's ham-fisted reversal on his promise to release a secret list of Jeffrey Epstein's clients has accomplished something long considered impossible by virtually everybody, including Trump himself: He has finally exceeded his followers' credulity.",
    "url": "https://www.theatlantic.com/politics/archive/2025/07/trump-epstein-file/683525/?gift=Ut5zkH9vG00uzi0vmoT5fxK1T_Srugc7fiYT6WBC6pE&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Supreme Court Clears the Way for Trump's Cuts to the Education Department  —  The move by the justices represents an expansion of executive power, allowing President Trump to dismantle the inner workings of a government department.  —  The Supreme Court agreed on Monday that the Trump administration … ",
    "url": "https://www.nytimes.com/2025/07/14/us/politics/supreme-court-education-department.html"
  },
  {
    "text": "Supreme Court allows Trump to lay off nearly 1,400 Education Department employees  —  The Supreme Court is allowing President Donald Trump to put his plan to dismantle the Education Department back on track — and to go through with laying off nearly 1,400 employees.",
    "url": "https://apnews.com/article/supreme-court-trump-education-layoffs-9370415531185092341b16a6bfea9344"
  },
  {
    "text": "167. The Inconsistent Court Strikes Again  —  Welcome back to “One First,” an (increasingly frequent) newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  If you're not already a subscriber, I hope you'll consider becoming one (and, if you already are … ",
    "url": "https://www.stevevladeck.com/p/167-the-inconsistent-court-strikes"
  },
  {
    "text": "Trump Kept Gold Club World Cup Trophy for Himself So FIFA Had to Give the Winners a Replica  —  OWN GOAL  —  Trump took every opportunity to make the new, expanded soccer tournament all about himself.  —  President Trump has revealed that the champions of the Club World Cup won't be getting … ",
    "url": "https://www.thedailybeast.com/trump-kept-gold-club-world-cup-trophy-for-himself-so-fifa-had-to-give-the-winners-a-replica/"
  },
  {
    "text": "Confusion as Donald Trump joins Chelsea on stage after Club World Cup win  —  United States President Donald Trump joined Chelsea on stage as they celebrated their Club World Cup success on Sunday.  —  Cole Palmer scored twice and set up another as the Blues stunned favourites Paris St Germain 3 … ",
    "url": "https://uk.sports.yahoo.com/news/confusion-donald-trump-joins-chelsea-021810251.html"
  },
  {
    "text": "Trump's new Ukraine plan, briefly explained  —  NATO countries will buy weapons from the US — and deliver them to Ukraine. … Trump said on Monday that NATO countries will start buying US weaponry to deliver to Ukraine.  While the US has been supplying Ukraine directly … ",
    "url": "https://www.vox.com/the-logoff-newsletter-trump/419763/trump-nato-ukraine-weapons-patriot-missiles-plan"
  },
  {
    "text": "How Putin Humiliated Trump  —  President Donald Trump is finally taking the fight to Vladimir Putin.  Sort of.  For now.  —  Trump's deference to Russia's authoritarian leader has been one of the most enduring geopolitical subplots of the past decade.  But his frustration with Putin has grown.",
    "url": "https://www.theatlantic.com/politics/archive/2025/07/trump-putin-russia-ukraine/683531/?gift=SCYx-5scVta3-cr_IlgTyTDiTbtyLvjUWQTqlVZK6ZU"
  },
  {
    "text": "US imposes a 17% duty on fresh Mexican tomatoes in hopes of boosting domestic production  —  The U.S. government said Monday it is immediately placing a 17% duty on most fresh Mexican tomatoes after negotiations ended without an agreement to avert the tariff.",
    "url": "https://apnews.com/article/mexico-tomatoes-duty-commerce-e1b113bfb9458d2443d5bb999795375c"
  },
  {
    "text": "Key Senate Republican to meet with Trump on funding clawback request  —  Sen. Eric Schmitt is heading to the White House Monday to meet with President Donald Trump on the administration's effort to claw back $9.4 billion in funding, according to a person granted anonymity to disclose the private gathering.",
    "url": "https://www.politico.com/live-updates/2025/07/14/congress/key-senate-republican-to-meet-with-trump-on-funding-clawback-request-00451417"
  },
  {
    "text": "ICE declares millions of undocumented immigrants ineligible for bond hearings  —  A memo from ICE's acting director instructs officers to hold immigrants who entered the country illegally “for the duration of their removal proceedings,” which can take months or years.",
    "url": "https://www.washingtonpost.com/immigration/2025/07/14/ice-trump-undocumented-immigrants-bond-hearings/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUyNDY1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzODQ3OTk5LCJpYXQiOjE3NTI0NjU2MDAsImp0aSI6ImQyNzRmNjMwLWE4MjQtNDMwYi1hZDU1LTUxNjg3NzA1MWU4NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA3LzE0L2ljZS10cnVtcC11bmRvY3VtZW50ZWQtaW1taWdyYW50cy1ib25kLWhlYXJpbmdzLyJ9.rceL8rWTDoUkGGjtDBssAsvEI63vqxUKB2RvL1BdsCA&itid=gfta"
  },
  {
    "text": "Marc Andreessen and the Billionaire Victims Club  —  The gripes of this bigwig of the tech right don't stand up to scrutiny.  —  ∙ Paid  —  1. White People  —  Over the weekend the Washington Post got hold of a text chain in which Marc Andreessen explained some facts of life to his fellow travelers in the Trump White House.",
    "url": "https://www.thebulwark.com/p/marc-andreesen-and-the-billionaire"
  },
  {
    "text": "Landlord seeks to evict Republican congressman over unpaid rent at D.C. apartment  —  Florida Rep. Cory Mills is accused of failing to pay $85,000 in rent between March and July.  He said a faulty online payment link is the problem, and that he has sought to resolve the issue.",
    "url": "https://www.nbcnews.com/politics/congress/landlord-seeks-evict-florida-republican-cory-mills-dc-apartment-rent-rcna218790"
  },
  {
    "text": "Exclusive: NIH to dismiss dozens of grant reviewers to align with Trump priorities … - Max Kozlov  —  Search author on:  —  PubMed Google Scholar  —  In an unprecedented move, the US National Institutes of Health (NIH) will soon disinvite dozens of scientists who were about to take positions … ",
    "url": "https://www.nature.com/articles/d41586-025-02221-6"
  },
  {
    "text": "House GOP blocks Dem maneuver to force release of Epstein files  —  House Republicans on Monday night voted against attaching a Democratic amendment to landmark cryptocurrency legislation that would force the Justice Department to release the Jeffrey Epstein files.",
    "url": "https://www.axios.com/2025/07/15/trump-epstein-khanna-doj-democrats-republicans"
  },
  {
    "text": "Cuomo to Fight On in Mayor's Race After Bruising Primary Loss to Mamdani  —  Former Gov. Andrew M. Cuomo is expected to announce his commitment to a third-party run against Assemblyman Zohran Mamdani, who soundly defeated him in the Democratic primary for New York City mayor.",
    "url": "https://www.nytimes.com/2025/07/14/nyregion/andrew-cuomo-mamdani-nyc-mayor.html?unlocked_article_code=1.WU8.nwO-.AWpGD56nTku7&smid=url-share"
  },
  {
    "text": "Trump administration says it won't publish major climate change reports on NASA website as promised  —  The Trump administration on Monday took another step to make it harder to find major, legally mandated scientific assessments of how climate change is endangering the nation and its people.",
    "url": "https://apnews.com/article/climate-change-nasa-reports-trump-hidden-doc-1ade1eb89bb4785f7cdd6e1d6ba31a21"
  },
  {
    "text": "Defense Department to begin using Grok, Musk's controversial AI Model  —  Elon Musk's artificial intelligence start-up said its models are now available to federal agencies.  —  The U.S. Department of Defense will begin using Grok, the AI chatbot built by Elon Musk's start-up xAI, the company announced in a post on Monday.",
    "url": "https://www.washingtonpost.com/technology/2025/07/14/elon-musk-grok-defense-department/"
  },
  {
    "text": "House Democratic leaders won't whip against crypto bills  —  House Democratic leaders will not whip against the landmark cryptocurrency bills that will be on the floor later this week despite opposition from the party's top member on the Financial Services Committee.",
    "url": "https://www.politico.com/live-updates/2025/07/14/congress/house-dems-crypto-bills-waters-clark-french-hill-00451763"
  },
  {
    "text": "Dinesh D'Souza Tells Viewers It's ‘Time to Move On’ From Epstein: ‘They Have Closed the Case’  —  Conservative commentator Dinesh D'Souza told his viewers it was “time to move on” from investigating documents related to the late sex offender Jeffrey Epstein on Monday, arguing it was more important … ",
    "url": "https://www.mediaite.com/politics/dinesh-dsouza-tells-viewers-its-time-to-move-on-from-epstein-they-have-closed-the-case/"
  },
  {
    "text": "Foreign journalists in the U.S. are self-censoring to protect themselves from the Trump administration  —  Non-citizen journalists working in the U.S. report wiping their social media accounts, canceling travel plans and pulling bylines  —  In 2021, Venezuelan journalist Luz Mely Reyes moved … ",
    "url": "https://www.poynter.org/reporting-editing/2025/foreign-journalists-in-the-u-s-are-self-censoring-to-protect-themselves-from-the-trump-administration/"
  },
  {
    "text": "Arizona senators press Trump's interior secretary on response to Grand Canyon wildfire  —  As of Monday, the Dragon Bravo fire on the North Rim had consumed more than 5,700 acres and was not contained, according to the U.S. Forest Service.  —  Arizona's senators are demanding answers … ",
    "url": "https://www.nbcnews.com/politics/congress/arizona-senators-doug-burgum-grand-canyon-wildfire-dragon-bravo-rcna218773"
  },
  {
    "text": "DOGE told regulator to ‘rubber stamp’ nuclear … The meeting was held after President Donald Trump signed a May 23 executive order that would supplant the NRC's historical role as the sole agency responsible for ensuring commercial nuclear projects are safe and won't threaten public health.",
    "url": "https://www.politico.com/news/2025/07/14/doge-to-regulator-rubber-stamp-nuclear-00450658"
  },
  {
    "text": "Pam Bondi ousts ethics watchdog amid DOJ purge  —  Attorney General Pam Bondi fired the ethics director at the Department of Justice on Friday, removing the staff in charge of advising her and other officials on how to navigate conflicts of interest. … - Tirrell has worked for the DOJ for 16 years … ",
    "url": "https://www.axios.com/2025/07/14/pam-bondi-fires-ethics-chief-doj-purge"
  }
]