[
  {
    "text": "First lady Jill Biden tests positive for Covid-19  —  First lady Jill Biden tested positive for Covid-19 Monday, the White House announced.  —  “This evening, the First Lady tested positive for COVID-19.  She is currently experiencing only mild symptoms.  She will remain at their home … ",
    "url": "https://www.cnn.com/2023/09/04/politics/jill-biden-covid/"
  },
  {
    "text": "Biden's Age, Economic Worries Endanger Re-Election in 2024, WSJ Poll Finds  —  Nearly three-quarters of voters say the president is too old to run again  —  Voters overwhelmingly think President Biden is too old to run for re-election and give him low marks for handling the economy … ",
    "url": "https://www.wsj.com/politics/elections/bidens-age-economic-worries-endanger-re-election-in-2024-wsj-poll-finds-67a7bba8?mod=followamazon"
  },
  {
    "text": "Chris Christie is actually gaining support for president.  From Democrats.  —  They can't get enough of his new Trump-bashing persona.  —  SALEM, N.H. — Chris Christie is running away with support from at least one major voting bloc in his presidential bid.",
    "url": "https://www.politico.com/news/2023/09/04/new-hampshire-democrats-chris-christie-00111379"
  },
  {
    "text": "Kim Jong-un and Putin Plan to Meet in Russia to Discuss Weapons  —  Russia seeks more weaponry for its war in Ukraine, and a North Korean delegation recently traveled to Russia by train to plan for Mr. Kim's visit this month, officials say.  —  Kim Jong-un, the leader of North Korea … ",
    "url": "https://www.nytimes.com/2023/09/04/us/politics/putin-kim-meeting-russia-north-korea-weapons.html"
  },
  {
    "text": "Peter Navarro to Face Contempt Trial Over Defiance of Jan. 6 Committee  —  A federal judge allowed the trial to proceed after finding little evidence that the former president authorized Mr. Navarro to ignore a subpoena from Congress.  —  For weeks after the 2020 election had been called … ",
    "url": "https://www.nytimes.com/2023/09/04/us/politics/peter-navarro-trial-contempt-congress-jan-6.html"
  },
  {
    "text": "Chinese Gate-Crashers at U.S. Bases Spark Espionage Concerns  —  Washington has tracked about 100 incidents involving Chinese nationals trying to access American military and other installations  —  WASHINGTON—Chinese nationals, sometimes posing as tourists, have accessed military bases … ",
    "url": "https://www.wsj.com/politics/national-security/chinese-gate-crashers-at-u-s-bases-spark-espionage-concerns-cdef8187?mod=followamazon"
  },
  {
    "text": "Elon Musk blames ADL for lost revenue, says he's ‘against anti-Semitism of any kind’  —  The tech mogul said Monday he was considering legal action after blaming pressure from the Anti-Defamation League for lost advertisers.  —  Elon Musk posted that he was against antisemitism Monday … ",
    "url": "https://www.nbcnews.com/tech/tech-news/elon-musk-blames-adl-lost-revenue-says-anti-semitism-kind-rcna103292"
  },
  {
    "text": "Putin says he won't renew the grain deal until the West meets his demands.  The West says it has  —  Russian President Vladimir Putin said Monday that a landmark deal allowing Ukraine to export grain safely through the Black Sea amid the war won't be restored until the West meets Moscow's demands on its own agricultural exports.",
    "url": "https://apnews.com/article/russia-ukraine-turkey-putin-erdogan-sochi-ac41cb453a6d6c597d543873850414eb"
  },
  {
    "text": "Three service secretaries to Tuberville: Stop this dangerous hold on senior officers  —  Carlos Del Toro is secretary of the Navy.  Frank Kendall is secretary of the Air Force.  Christine Wormuth is secretary of the Army.  —  As the civilian leaders of the Navy, Air Force, Space Force and Army … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/04/army-navy-air-force-secretaries-tuberville-military-hold/"
  },
  {
    "text": "Wisconsin GOP weighs moves to sideline elections chief and liberal Supreme Court majority  —  Wisconsin Republicans, after a string of losses in hotly contested statewide races, are taking steps toward sidelining the state's nonpartisan elections chief and undercutting the new liberal majority on the state Supreme Court.",
    "url": "https://www.cnn.com/2023/09/04/politics/wisconsin-republicans-election-fight/"
  },
  {
    "text": "Why the White House thinks impeachment may prove risky for Republicans  —  And that's not the only political hot spot Biden aides are gearing up to confront.  —  The White House has been gradually preparing for a GOP impeachment inquiry into President Joe Biden and increasingly feels … ",
    "url": "https://www.politico.com/news/2023/09/04/white-house-biden-impeachment-00113824"
  },
  {
    "text": "An effort to ban caste discrimination in California has touched a nerve  —  California would be the first state to explicitly ban the practice, but the process has been divisive.  —  SACRAMENTO, Calif. — Caste discrimination wasn't on the radar of many lawmakers in California.",
    "url": "https://www.politico.com/news/2023/09/04/ban-caste-discrimination-california-bill-00113817"
  },
  {
    "text": "Invasive species are costing society more than $423 billion a year: report  —  A new report by the United Nations found that the global economic cost of invasive alien species exceeded more than $423 billion annually in 2019, noting costs have at least quadrupled in every decade since 1970.",
    "url": "https://thehill.com/policy/energy-environment/4186575-invasive-species-are-costing-society-more-than-423-billion-a-year-report/"
  },
  {
    "text": "Twitter accused of helping Saudi Arabia commit human rights abuses  —  Lawsuit says network discloses user data at request of Saudi authorities at much higher rate than for US, UK and Canada  —  The social media company formerly known as Twitter has been accused in a revised civil US lawsuit … ",
    "url": "https://www.theguardian.com/world/2023/sep/04/twitter-saudi-arabia-human-rights-abuses"
  },
  {
    "text": "UN nuclear watchdog report seen by AP says Iran slows its enrichment of near-weapons-grade uranium  —  Iran has slowed the pace at which it is enriching uranium to nearly weapons-grade levels, according to a report by the United Nations' nuclear watchdog seen by The Associated Press on Monday.",
    "url": "https://apnews.com/article/iran-uranium-enrichment-iaea-us-tensions-af4a183a2e97375708a494d5324c2836"
  }
]