[
  {
    "text": "We've Been Entertaining an Illusion About the Supreme Court.  It's Finally Been Shattered.  —  There will be no more self-soothing after this.  —  For three long years, Supreme Court watchers mollified themselves (and others) with vague promises that when the rubber hit the road … ",
    "url": "https://slate.com/news-and-politics/2024/04/supreme-court-immunity-arguments-which-way-now.html"
  },
  {
    "text": "Conservative Legal Philosophy Was All a Lie, Too  —  Great analysis of yesterday's oral arguments across The Bulwark: Kim Wehle was on the site and then talked with Mona and Gregg Nunziata on the livestream.  Sarah and George Conway did an emergency pod.  Andrew Egger had good stuff in Morning Shots.",
    "url": "https://www.thebulwark.com/p/conservative-legal-philosophy-was"
  },
  {
    "text": "Samuel Alito's Resentment Goes Full Tilt on a Black Day for the Court  —  On the day Donald Trump took office in January 2017, pondering what he might do to the country's democratic norms and institutions, I wrote these words: “Trump will destroy them, if keeping Trump on top requires it.  Or try to.",
    "url": "https://newrepublic.com/post/181023/samuel-alito-trump-immunity-black-day-supreme-court"
  },
  {
    "text": "This Whole King Trump Thing Is Getting Awfully Literal  —  Donald Trump's claim that he has absolute immunity for criminal acts taken in office as president is an insult to reason, an assault on common sense and a perversion of the fundamental maxim of American democracy: that no man is above the law.",
    "url": "https://www.nytimes.com/2024/04/26/opinion/trump-immunity-supreme-court.html"
  },
  {
    "text": "Trump Melts Institutions, SCOTUS Edition  —  No topper to ease you in today; too much to get through.  Happy Friday.  —  Where's SCOTUS Going?  —  How much should people freak out over Thursday's SCOTUS oral arguments about Trump's claims that he can't be prosecuted for election crimes due to presidential immunity?",
    "url": "https://www.thebulwark.com/p/trump-melts-institutions-scotus-edition"
  },
  {
    "text": "SCOTUS majority abandons conservative principles to mount bizarre defense of Trump's immunity claim  —  Our justice system may leave Americans with one choice  —  Yesterday's message from the rightwing justices of the Supreme Court, particularly the male justices, was shocking to any believer in true … ",
    "url": "https://www.salon.com/2024/04/26/scotus-majority-abandons-conservative-principles-to-mount-bizarre-defense-of-trumps-immunity-claim/"
  },
  {
    "text": "The Trumpification of the Supreme Court  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  The notion that Donald Trump's supporters believe that he should be able to overthrow the government and get away with it sounds like hyperbole … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/trump-presidential-inmunity-supreme-court/678193/"
  },
  {
    "text": "Trump VP contender Kristi Noem writes of killing dog - and goat - in new book  —  South Dakota governor includes bloody tale in campaign volume - and admits 'a better politician ... wouldn't tell the story here'  —  In 1952, as a Republican candidate for vice-president … ",
    "url": "https://www.theguardian.com/books/2024/apr/26/trump-kristi-noem-shot-dog-and-goat-book"
  },
  {
    "text": "Scoop: Biden changes walking routine to Marine One … - Weeks ago the president told aides that he'd prefer a less formal approach, a White House official told Axios. … White House staffers and reporters alike noticed the sudden change in Biden's walk routine beginning in mid-April … ",
    "url": "https://www.axios.com/2024/04/26/biden-walkers-white-house-marine-one"
  },
  {
    "text": "Thieves snatch Rep. Adam Schiff's luggage in S.F. He gives dinner speech without a suit  —  Hello to the city, goodbye to your luggage.  That was Senatorial candidate Adam Schiff's rude introduction to San Francisco's vexing reputation for car burglaries Thursday when thieves swiped the bags … ",
    "url": "https://www.sfchronicle.com/bayarea/article/car-burglars-snatch-rep-adam-schiff-s-luggage-19424026.php"
  },
  {
    "text": "Election Updates: Biden says he is ‘happy to’ debate Trump, a notable shift.  —  Biden, asked if he's planning to debate Trump, says ‘I am happy to.’  —  President Biden said on Friday that he would participate in a general-election debate with former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/live/2024/04/26/us/biden-trump-election"
  },
  {
    "text": "Trump's isolation deepens after his coup crew is hit with Arizona criminal indictments  —  The January 6 co-conspirators are likely too wrapped up in their criminal cases to help Trump with another coup  —  Because Donald Trump himself wasn't indicted, there was a surprisingly muted response … ",
    "url": "https://www.salon.com/2024/04/26/isolation-deepens-after-his-coup-crew-is-hit-with-arizona-criminal-indictments/"
  },
  {
    "text": "Biden Administration Drops Plan to Ban Menthol Cigarettes  —  White House had been weighing health benefit of ban against angering Black voters  —  The Biden administration is reversing course on its plan to ban menthol cigarettes, after the White House weighed the potential public-health benefits … ",
    "url": "https://www.wsj.com/politics/policy/menthol-cigarette-ban-explained-0c41df7a"
  },
  {
    "text": "The dishonest — and ironic — push to blame campus protests on George Soros  —  There is very obviously an element of opposition to the ongoing protests on college campuses that is rooted in familiar partisan rhetoric.  The political right's hostility to college professors and insistences … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/26/dishonest-ironic-push-blame-campus-protests-george-soros/"
  },
  {
    "text": "No One Has a Right to Protest in My Home  —  The difference between a private yard and a public forum  —  as a constitutional scholar and the dean of the UC Berkeley School of Law, I strongly defend the right to speak one's mind in public forums.  But the rancorous debate over the Israel-Hamas war seems … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/04/campus-protest-first-amendment-berkeley/678186/"
  },
  {
    "text": "Blinken tells CNN the US has seen evidence of China attempting to influence upcoming US elections  —  US Secretary of State Antony Blinken said the US has seen evidence of Chinese attempts to “influence and arguably interfere” with the upcoming US elections, despite an earlier commitment from leader Xi Jinping not to do so.",
    "url": "https://www.cnn.com/2024/04/26/politics/blinken-china-interview-intl-hnk"
  },
  {
    "text": "The Court is Corrupt.  Say It With Me.  —  I was watching cable news this afternoon at the gym.  And I saw one of those examples of what has now become a Trump/Roberts Court-era set piece, where principled and very smart lawyers and/or legal academics have to say, I guess I was a chump.",
    "url": "https://talkingpointsmemo.com/edblog/the-court-is-corrupt-say-it-with-me"
  },
  {
    "text": "Top Democrats pressed for Rahm Emanuel to lead Biden campaign  —  The Scoop  —  At the low point of President Joe Biden's polling this winter, top New York Democratic donors pushed to bring the legendary Democratic politico Rahm Emanuel back from his posting in Japan to run the re-election campaign.",
    "url": "https://www.semafor.com/article/04/26/2024/top-democrats-pressed-for-rahm-emanuel-to-lead-biden-campaign"
  },
  {
    "text": "Trump Allies Draw Up Plans to Blunt Fed's Independence  —  Some Trump advisers argue that the president should be consulted on interest-rate decisions",
    "url": "https://www.wsj.com/economy/central-banking/trump-allies-federal-reserve-independence-54423c2f"
  }
]