[
  {
    "text": "Trump's top general calls ex-president ‘fascist to the core’ and ‘most dangerous person to this country,’ new book says  —  Your support helps us to tell the story  —  This election is still a dead heat, according to most polls.  In a fight with such wafer-thin margins … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-fascist-general-woodward-book-b2627972.html"
  },
  {
    "text": "Trump's top general calls former president “fascist” and “dangerous” threat … - “I had suspicions when I talked to you about his mental decline and so forth, but now I realize he's a total fascist,” Milley, who served from 2019 to 2023, said to Woodward. … Milley has been criticized by the far right.",
    "url": "https://www.axios.com/2024/10/11/mark-milley-trump-fascist-bob-woodward-book"
  },
  {
    "text": "Kremlin confirms Trump sent Russia Covid-19 tests, after former president denied Bob Woodward claim  —  Russia has confirmed that Donald Trump sent the Kremlin sample Covid-19 tests in the early days of the pandemic, after revelations in veteran journalist Bob Woodward's new book raised further questions … ",
    "url": "https://www.cnn.com/2024/10/11/europe/kremlin-confirms-trump-covid-tests-intl/"
  },
  {
    "text": "Musk Is Going All In to Elect Trump  —  Elon Musk is planting himself in Pennsylvania, has brought his brain trust to help and may even knock on doors himself.  —  In the final weeks of the presidential campaign, the richest man in the world has involved himself in the U.S. election in a manner unparalleled in modern history.",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/elon-musk-donald-trump-pennsylvania.html?unlocked_article_code=1.RU4.hLOY.jvVZPOk1gLaB&smid=url-share"
  },
  {
    "text": "Vance, Given 5 Chances to Say Trump Lost in 2020, Takes None  —  In an interview with The New York Times, Senator JD Vance repeatedly refused to acknowledge Donald J. Trump's defeat and said he would not have certified the 2020 results.  —  Heading into the final three weeks of the 2024 election … ",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/vance-trump-2020-election-results.html"
  },
  {
    "text": "Justice Department Sues Virginia for Violating Federal Law's Prohibition on Systematic Efforts to Remove Voters Within 90 Days of an Election  —  For Immediate Release  —  The Justice Department announced today that it has filed a lawsuit against the State of Virginia … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-virginia-violating-federal-laws-prohibition-systematic-efforts"
  },
  {
    "text": "Justice Department Sues Virginia Officials Over State's Noncitizen Voter Roll Purge  —  The U.S. Department of Justice (DOJ) is suing Virginia over its voter roll maintenance program, alleging that the state is illegally removing voters from the rolls too close to the 2024 general election.",
    "url": "https://www.democracydocket.com/news-alerts/justice-department-sues-virginia-officials-over-states-noncitizen-voter-roll-purge/"
  },
  {
    "text": "GOP senator touts ‘support’ of colleague — who didn't endorse her  —  Sen. Deb Fischer (R-NE) is facing a competitive election for the first time in years — and she's trying to whip out bipartisan credentials to stave off the threat.  —  The problem is, the senator whose “support” … ",
    "url": "https://www.rawstory.com/deb-fischer/"
  },
  {
    "text": "Trump requests military aircraft and vehicles amid Iran threat  —  There is no evidence tying Iran to either of the recent assassination attempts, but the FBI has not ruled out the possibility.  —  Donald Trump's campaign requested military aircraft for Trump to fly in during the final weeks … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/11/trump-security-threats-iran-election-2024-campaign/"
  },
  {
    "text": "Trump Is Said to Consider Brooke Rollins for White House Chief of Staff  —  Ms. Rollins, a conservative lawyer who ran domestic policy in the Trump administration, is said to be under consideration for the role should Donald J. Trump win the election.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/trump-brooke-rollins-chief-of-staff.html"
  },
  {
    "text": "Damning Video Shows Roger Stone Is Plotting a Coup for November  —  A nine-minute, unedited, undercover interview with Roger Stone revealed some of the MAGA ally's more disturbing goals for a second Trump administration.  —  The covert recording of a discussion between Stone … ",
    "url": "https://newrepublic.com/post/187088/roger-stone-donald-trump-coup-november-video"
  },
  {
    "text": "California officials reject more SpaceX rocket launches, with some citing Musk's X posts  —  SpaceX's plans to launch more rockets from the California coast were rejected by a state commission this week, with some officials citing Elon Musk's political posts on X and raising concerns … ",
    "url": "https://www.latimes.com/california/story/2024-10-11/la-me-spacex-coastal-commission"
  },
  {
    "text": "Harris ad bashes Trump for criticizing Detroit  —  Vice President Harris's campaign released an ad titled “Like Detroit” on Friday, criticizing former President Trump for his unfavorable comments about the city.  —  “They said we were dead.  That our best days were behind us,” … ",
    "url": "https://thehill.com/homenews/state-watch/4929218-harris-campaign-trump-detroit-comments/"
  },
  {
    "text": "From the Storm to the Stormtroopers  —  The Fascist Logic of Climate Lying  —  Today, our American fascists blame the hurricanes on the meteorologists and disrupt the government response.  Tomorrow they will blame climate change on the climate scientists and deport their enemies of choice.",
    "url": "https://snyder.substack.com/p/from-the-storm-to-the-stormtroopers"
  },
  {
    "text": "Rumors on X Are Becoming the Right's New Reality  —  The site formerly known as Twitter has become the center of a fantastical political culture.  —  A curious set of claims has recently emerged from the right-wing corners of the social-media platform X: FEMA is systematically abandoning … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/10/rumors-x-twitter-musk/680219/"
  },
  {
    "text": "Six GOP congressmen sue to have Pa. military and overseas ballots set aside in November election  —  Six Republican members of Congress are suing the Pennsylvania Department of State, arguing that ballots from overseas voters — including members of the U.S. military — are susceptible to fraud … ",
    "url": "https://www.inquirer.com/politics/overseas-ballots-pennsylvania-20241010.html"
  },
  {
    "text": "Ex-State Department official says Trump campaign is an influence Operation' — and experts agree  —  A prominent former U.S. State Department official who worked to fight Russian disinformation has labeled the Trump presidential campaign an “influence operation,” with several experts echoing his assessment.",
    "url": "https://www.alternet.org/richard-stengal-trump/"
  },
  {
    "text": "Yes.  Political Journalism Remains Wired for the GOP.  —  I heard from a reader yesterday who saw one of the country's top political journalists give a public presentation about the race.  The run-down I got of that event crystallized something I've been giving a lot of thought … ",
    "url": "https://talkingpointsmemo.com/edblog/yes-political-journalism-remains-wired-for-the-gop"
  },
  {
    "text": "Friday Smiles: Some Very Savvy People Break Down the Democratic Freak Out  —  Besides roaming the interwebs and combing through so many different X accounts myself, I'm lucky enough to have a dear friend from high school who once worked in Congress.  Nowadays, he does his own thing … ",
    "url": "https://hotair.com/tree-hugging-sister/2024/10/11/friday-smiles-some-very-savvy-people-break-down-the-democratic-freak-out-n3795687"
  },
  {
    "text": "Judge Chutkan approves release of Trump Jan. 6 documents that could reveal more damning testimony  —  The documents could reveal witness testimony before the congressional Jan. 6 committee  —  Judge Tanya S. Chutkan, the federal judge overseeing Donald Trump's Jan. 6 case … ",
    "url": "https://www.salon.com/2024/10/11/chutkan-approves-release-of-jan-6-documents-that-could-reveal-more-damning-testimony/"
  },
  {
    "text": "The world according to Mike Johnson … That's longer than Kevin McCarthy lasted in the role.  —  And with 25 days until Election Day, we wanted to catch up with Johnson to discuss his views on the speakership, the upcoming lame-duck session and what 2025 will look like if Republicans keep control of the House.",
    "url": "https://punchbowl.news/article/house/mike-johnson-nearly-one-year-as-speaker/"
  },
  {
    "text": "FOX NEWS CHANNEL'S HARRIS FAULKNER TO PRESENT TOWN HALL ON WOMEN'S ISSUES FEATURING FORMER PRESIDENT DONALD TRUMP ON OCTOBER 16TH  —  One-Hour Town Hall to Feature All-Female Audience in Cumming, Georgia and Air on “The Faulkner Focus” at 11 AM/ET  —  Please click here to apply for media credentials for this event.",
    "url": "https://press.foxnews.com/2024/10/fox-news-channels-harris-faulkner-to-present-town-hall-on-womens-issues-featuring-former-president-donald-trump-on-october-16th"
  },
  {
    "text": "Veeps: Vance More Popular Than Walz  —  After Democrat Tim Walz and Republican J.D. Vance met in their only televised debate, the GOP vice presidential candidate gets higher marks from voters.  —  The latest Rasmussen Reports national telephone and online survey finds that 50% … ",
    "url": "https://www.rasmussenreports.com/public_content/politics/biden_administration/veeps_vance_more_popular_than_walz"
  }
]