[
  {
    "text": "Trump Deflates  —  It wasn't just Putin who lost in the House vote on Ukraine aid.  —  Ukraine won.  Trump lost.  —  The House vote to aid Ukraine renews hope that Ukraine can still win its war.  It also showed how and why Donald Trump should lose the 2024 election.",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/trump-republican-vote-ukraine-aid/678148/"
  },
  {
    "text": "The House votes for possible TikTok ban in the US, but don't expect the app to go away anytime soon  —  The House passed legislation Saturday that would ban TikTok in the United States if the popular social media platform's China-based owner doesn't sell its stake within a year, but don't expect the app to go away anytime soon.",
    "url": "https://apnews.com/article/tiktok-us-ban-sale-china-congress-de12b4d22aa8095e62cb0982a6e62235"
  },
  {
    "text": "Playbook: How the push to unseat Johnson could unfold  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT UNION JOE IS READING — “Tennessee workers at VW plant vote to unionize with UAW,” by The Tennessean's Todd Price and Gary Estwick … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/20/how-the-push-to-unseat-johnson-could-unfold-00153483"
  },
  {
    "text": "US House approves $61bn in military aid for Ukraine after months of stalling  —  Ukrainian president thanks America after Speaker Mike Johnson secures bipartisan support for funding Ukraine, Israel and Taiwan  —  After months of stalling, the US House of Representatives finally approved … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/20/us-house-approves-61bn-aid-ukraine"
  },
  {
    "text": "Proud Boys appear at Trump rally, drawing condemnation from Biden  —  Members of the violent extremist group were calling for the release of everyone charged in the Jan. 6, 2021, attack on the Capitol.  Trump has pledged to pardon rioters.  —  WILMINGTON, N.C. — At least 10 men wearing … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/20/trump-rally-proud-boys-north-carolina/"
  },
  {
    "text": "Trump Rally, a Return to the Campaign Trail, Is Called Off Because of Storms  —  After a week stuck in a courtroom, Donald Trump was planning to speak to hundreds of supporters in North Carolina, until the weather turned dangerous.  —  After former President Donald J. Trump sat in a courtroom … ",
    "url": "https://www.nytimes.com/2024/04/20/us/politics/trump-rally-canceled.html"
  },
  {
    "text": "Trump forced to listen silently to people insulting him as he trades a cocoon of adulation for court  —  He seems “selfish and self-serving,” said one woman.  The way he carries himself in public “leaves something to be desired,” said another.  —  His “negative rhetoric and bias,” said another man, is what is “most harmful.”",
    "url": "https://apnews.com/article/trump-trial-jurors-hush-money-criticism-b4fe05a61ed566a587523d1120b46a76"
  },
  {
    "text": "Trump Privately Rages About His Sketch Artist, Courtroom Nap Reports  —  The former president's anger during the first week of his New York hush money trial was “maxed out, even for him,” a source tells Rolling Stone  —  Donald Trump, if you take it from him, is cherishing the opportunity … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-trial-mad-haberman-sketch-artist-1235007794/"
  },
  {
    "text": "Michael Avenatti says he's talking to Trump's legal team — and would testify for the ex-prez  —  Disgraced Stormy Daniels' attorney Michael Avenatti has been in contact with former President Trump's legal defense team and is ready and willing to testify against his former client, he told The Post in an interview from jail.",
    "url": "https://nypost.com/2024/04/20/us-news/michael-avenatti-says-hes-in-conversations-with-trump-legal-team/"
  },
  {
    "text": "Biden marks 25th anniversary of Columbine shooting  —  President Biden, joined by other members of his administration, on Saturday marked the 25th anniversary of the Columbine High School Massacre and attempted bombing.  —  On April 20, 1999, two twelfth-grade students murdered 12 students … ",
    "url": "https://thehill.com/homenews/administration/4608754-biden-marks-25th-anniversary-of-columbine-shooting/"
  },
  {
    "text": "‘Yes, I Did It’: Politician Confesses to Murdering Wife on Social Media  —  ‘I DID EVERYTHING RIGHT’  —  “The lying wretch got what she deserved,” he wrote, among other disturbing things.  —  A politician in Russia's Tver region has sent shockwaves through the country after apparently confessing … ",
    "url": "https://www.thedailybeast.com/yes-i-did-it-politician-confesses-to-murdering-wife-on-social-media"
  },
  {
    "text": "US weighs sending additional military advisers to Ukraine as Russia gains momentum  —  The troops would be serving in a non-combat role, officials said.  —  The U.S. is considering sending additional military advisers to the embassy in Kyiv, the latest show of American commitment to Ukraine … ",
    "url": "https://www.politico.com/news/2024/04/20/us-troops-ukraine-00153499"
  },
  {
    "text": "Trump's legal bills drain millions more from his political committees  —  The former president's legal bills account for more than a quarter of the spending by his political committees in March, new campaign finance filings show  —  Donald Trump is picking up his fundraising pace … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/20/trump-legal-bills-fundraising-reports/"
  },
  {
    "text": "Biden celebrates Tennessee Volkswagen plant's vote to join UAW  —  President Biden celebrated the “historic vote” Friday for workers at a Tennessee Volkswagen plant to join the United Auto Workers (UAW) union.  —  “Congratulations to the workers at Volkswagen in Chattanooga, Tennessee … ",
    "url": "https://thehill.com/homenews/state-watch/4608235-biden-celebrates-tennessee-volkswagen-plant-vote-join-uaw/"
  },
  {
    "text": "Hillary Clinton: ‘What Trump really wants’ is to ‘kill his opposition’  —  Former Secretary of State Hillary Clinton said that former President Trump aspires to be like Russian President Vladimir Putin  —  Former Secretary of State Hillary Clinton suggested on a podcast Friday that her old rival … ",
    "url": "https://www.foxnews.com/media/hillary-clinton-what-trump-really-wants-kill-opposition"
  }
]