[
  {
    "text": "Michigan Supreme Court rejects ‘insurrectionist ban’ case and keeps Trump on 2024 primary ballot  —  The Michigan Supreme Court has rejected an attempt to remove former President Donald Trump from the 2024 ballot based on the US Constitution's “insurrectionist ban.”",
    "url": "https://www.cnn.com/2023/12/27/politics/michigan-supreme-court-rejects-insurrectionist-ban-case-and-keeps-trump-on-2024-primary-ballot/"
  },
  {
    "text": "Trump shares cryptic ‘dictatorship’ word cloud on Truth Social  —  It's not the first time Trump has called himself a dictator, but it's the first time he's said it via word cloud.  —  Voters surveyed by the Daily Mail described former President Donald Trump's political goals as “corruption,” “revenge” and “dictatorship.”",
    "url": "https://www.politico.com/news/2023/12/26/trump-cryptic-dictatorship-truth-social-00133219"
  },
  {
    "text": "Trump Is Testing the Bounds of Presidential Immunity—and Losing  —  At just about every turn, Trump is trying to hide behind the presidential seal for immunity.  His gambit doesn't seem to be working, for some very essential reasons.  —  For years, Donald Trump has hid behind the presidential seal … ",
    "url": "https://www.thedailybeast.com/trump-is-testing-the-bounds-of-presidential-immunityand-losing"
  },
  {
    "text": "Exclusive data: Trump lowers his own social media punch  —  Former President Trump has curtailed the reach of his campaign message by not returning to X, according to an Axios analysis. … - His engagement on Truth Social is much smaller — and actually shrinking.",
    "url": "https://www.axios.com/2023/12/27/trump-tweets-twitter-truth-social-x"
  },
  {
    "text": "Vivek Ramaswamy's campaign stops all TV ad spending less than a month before Iowa and New Hampshire  —  A spokesperson for the GOP candidate's presidential campaign said it has “the ability to be nimble and hyper targeted” in ad spending going forward.  —  Vivek Ramaswamy's presidential campaign … ",
    "url": "https://www.nbcnews.com/politics/2024-election/vivek-ramaswamys-campaign-stops-tv-ad-spending-less-month-iowa-new-ham-rcna131240"
  },
  {
    "text": "Nikki Haley's Bold Strategy to Beat Trump: Play It Safe  —  Ms. Haley still trails far behind the former president in polls.  Yet she is not deviating from the cautious approach that has led her this far.  —  At a packed community center in southwestern Iowa, Nikki Haley broke … ",
    "url": "https://www.nytimes.com/2023/12/27/us/politics/nikki-haley-trump.html"
  },
  {
    "text": "Thousands — and some city officials — want Trump's Hollywood star removed  —  An activist is forcing Los Angeles city officials to confront an unprecedented question: Whether former President Trump's star on the Hollywood Walk of Fame can be withdrawn, the Los Angeles Times reports.",
    "url": "https://www.axios.com/2023/12/27/trump-hollywood-walk-of-fame-star-removal"
  },
  {
    "text": "Israeli military leader says war in Gaza will go on for ‘many more months’  —  Israel expects the war in Gaza will go on for “many more months,” Israel Defense Forces (IDF) Chief of the General Staff Herzi Halevi said.  —  “The war will continue for many more months, and we will operate in various ways … ",
    "url": "https://thehill.com/policy/defense/4378784-israeli-military-leader-says-war-in-gaza-will-go-on-for-many-more-months/"
  },
  {
    "text": "Matt Napolitano, Fox News audio anchor and reporter, dies at 33 after a brief illness  —  Napolitano wrote and produced segments for all Fox News audio platforms.  He contributed sports-related coverage for Fox Business Network's “Cavuto: Coast to Coast” weekday series anchored by Neil Cavuto.",
    "url": "https://www.nbcnews.com/news/us-news/matt-napolitano-fox-news-audio-anchor-reporter-dies-33-brief-illness-rcna131275"
  },
  {
    "text": "Melania Thinks It's Time to ‘Leave Her Mark on History’  —  OUT OF THE SHADOWS  —  Melania Trump is reportedly ready for her moment in the spotlight.  The former first lady, who's made only a handful of public appearances since Donald Trump left office, was reportedly encouraged by her … ",
    "url": "https://www.thedailybeast.com/melania-trump-thinks-its-time-to-leave-her-mark-on-history"
  },
  {
    "text": "A Fake Trump Elector in Michigan Told Prosecutors of Regret, Anger  —  The Trump supporter is the only one of the 16 fake Michigan electors who has agreed to cooperate with the authorities and had charges against him dropped.  —  One of the Republicans in Michigan who acted as a fake elector … ",
    "url": "https://www.nytimes.com/2023/12/27/us/michigan-trump-fake-elector.html"
  },
  {
    "text": "A Private Liberal Arts College Is Drowning in Debt.  Should Alabama Rescue It?  —  Birmingham-Southern College was on the verge of receiving a multimillion-dollar loan, but the state treasurer balked, saying it was not a justifiable use of taxpayer money.  —  On a crisp fall … ",
    "url": "https://www.nytimes.com/2023/12/27/us/politics/birmingham-southern-alabama-financial-rescue.html"
  },
  {
    "text": "Hunt to Announce UK Budget March 6 as Tories Push for Giveaways  — Treasury announces budget date in emailed statement Wednesday  — Timing gives Conservatives leeway over when to call election  —  Chancellor of the Exchequer Jeremy Hunt will announce the UK's next budget on March 6 … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-27/hunt-to-announce-uk-budget-march-6-as-tories-push-for-giveaways"
  },
  {
    "text": "As migration surges, immigration court case backlog swells to over 3 million  —  The nation's immigration-court backlog swelled by more than a million cases in 2023, according to new data, as the number of migrants seeking asylum at the U.S. border surged.  —  The backlog surpassed 3 million cases … ",
    "url": "https://www.usatoday.com/story/news/nation/2023/12/27/immigration-court-backlog-grows/72030952007/"
  }
]