[
  {
    "text": "Kristi Noem Cries ‘Fake News’ After Disastrous Interview on CBS  —  DOGGED BY SCANDAL  —  The South Dakota governor complained that the host of “Face the Nation” had interrupted her “once every 25 seconds”—something that would never happen to, say, Gretchen Whitmer.",
    "url": "https://www.thedailybeast.com/kristi-noem-cries-fake-news-after-disastrous-interview-on-cbs"
  },
  {
    "text": "Kristi Noem Suggests Biden's Dog Should Have Been Killed, Too  —  The South Dakota governor, defending her tale of shooting and killing her family's dog, suggested that President Biden's German shepherd, Commander, had merited a similar fate.  —  Gov. Kristi Noem of South Dakota … ",
    "url": "https://www.nytimes.com/2024/05/05/us/politics/kristi-noem-biden-dog.html"
  },
  {
    "text": "Trump's real-time reviews of 2024 VP possibles and other surrogates … - Sen. Tim Scott (R-S.C.) — “As a candidate he did a good job, but as a surrogate he's unbelievable.”  — Sen. J.D. Vance (R-Ohio) — “He wasn't a supporter of mine at the very beginning... He was saying things … ",
    "url": "https://www.axios.com/2024/05/05/trump-vice-president-audio-mar-a-lago"
  },
  {
    "text": "Who believes the most “taboo” conspiracy theories?  It might not be who you think  —  White men with graduate degrees, a new study finds, are highly likely to hold especially noxious beliefs  —  Like Henry Ford before him, Elon Musk has emerged as America's top conspiracy spreader.  But he's hardly alone.",
    "url": "https://www.salon.com/2024/05/05/believes-the-most-taboo-conspiracy-theories-it-might-not-be-you-think/"
  },
  {
    "text": "Scoop: U.S. put a hold on an ammunition shipment to Israel … - The incident raised serious concerns inside the Israeli government and sent officials scrambling to understand why the shipment was held, Israeli officials said.  — President Biden is facing sharp criticism among Americans who oppose his support of Israel.",
    "url": "https://www.axios.com/2024/05/05/israel-us-ammunition-shipment-hold"
  },
  {
    "text": "The GOP's deep generational split on immigration … - Gen Z Republicans are more likely to support more legal immigration pathways.  — They're more likely to question negative narratives about immigrants than older generations, the survey found.  — They're less likely than Boomer … ",
    "url": "https://www.axios.com/2024/05/05/republicans-immigration-age-gen-z-boomers"
  },
  {
    "text": "White House: Trump Gestapo comment echoes ‘appalling rhetoric of fascists’  —  The White House on Sunday slammed former President Trump after he compared the Biden administration to the Gestapo police force in Nazi Germany.  —  “Instead of echoing the appalling rhetoric of fascists … ",
    "url": "https://thehill.com/homenews/campaign/4645186-white-house-trump-gestapo-comment-echoes-appalling-rhetoric-of-fascists/"
  },
  {
    "text": "Three soldiers killed in Hamas rocket barrage toward Kerem Shalom, aid crossing closed  —  The rockets were reportedly launched from the Rafah area.  The Kerem Shalom crossing was closed after the attack.  —  Three IDF soldiers were killed and at least three others were seriously wounded … ",
    "url": "https://www.jpost.com/breaking-news/article-799923"
  },
  {
    "text": "Ex-Fulton County prosecutor Nathan Wade speaks out: ‘Workplace romances are as American as apple pie ... it happened to the two of us’  —  Wade conceded he had certain regrets.  —  Fulton County District Attorney Fani Willis speaks at a press conference next to prosecutor Nathan Wade … ",
    "url": "https://abcnews.go.com/US/fulton-county-prosecutor-nathan-wade-speaks-workplace-romances/story?id=109939216"
  },
  {
    "text": "RNC co-chair Lara Trump: ‘You cannot have ballots counted after elections are over’  —  Republican National Committee co-chair Lara Trump argued Sunday that ballots should not be counted after elections are over.  —  While speaking to Fox News host Maria Bartiromo, Trump explained why her party … ",
    "url": "https://www.rawstory.com/lara-trump-counting-ballots/"
  },
  {
    "text": "Pro-Palestinian protesters are backed by a surprising source: Biden's biggest donors  —  Some of the most outspoken groups against Biden and Israel get funding from foundations attached to some of the biggest names in Democratic circles.  —  President Joe Biden has been dogged for months … ",
    "url": "https://www.politico.com/news/2024/05/05/pro-palestinian-protests-columbia-university-funding-donors-00156135"
  },
  {
    "text": "Anti-war protesters leave USC after police arrive, while Northeastern ceremony proceeds calmly  —  Students protesting the war in Gaza abandoned their camp at the University of Southern California early Sunday after being surrounded by police and threatened with arrest, while Northeastern … ",
    "url": "https://apnews.com/article/israel-palestine-gaza-war-universities-campus-protests-3afafc2d56c6dc87635549475d94e1d6"
  },
  {
    "text": "Chicago teachers' $50B demands include pay hikes, abortions, migrant accommodation  —  The demands include members getting 9% annual wage increases through fiscal year 2028  —  The Chicago Teachers Union (CTU) is negotiating a new contract with the public schools system and is understood … ",
    "url": "https://www.foxnews.com/us/chicago-teachers-50b-demands-includes-pay-hikes-abortions-migrant-accommodation"
  },
  {
    "text": "‘They May Be Republicans, But They Still Come in for Services’  —  Many Latinas in conservative South Florida support abortion rights.  But will they vote to enshrine the right in the state constitution?  —  HIALEAH, Florida —  The clinic usually doesn't open until around 9 a.m. … ",
    "url": "https://www.politico.com/news/magazine/2024/05/05/abortion-ban-florida-women-00156107"
  }
]