[
  {
    "text": "Trump's billionaires set to take government by storm … - They've been picked to lead the departments of Treasury (Scott Bessent), Commerce (Howard Lutnick), Education (Linda McMahon), Interior (Doug Burgum), the Small Business Administration (Kelly Loeffler) and NASA (Jared Isaacman).",
    "url": "https://www.axios.com/2024/12/06/trump-billionaires-cabinet-elon-musk"
  },
  {
    "text": "Trump has assembled an uber-wealthy Cabinet, raising risks of ethics conflicts  —  President-elect Trump is stacking his cabinet with billionaires and centi-millionaires, whose financial entanglements pose conflict of interest challenges.  —  A month after securing the White House … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/06/trump-billionaires-cabinet-ethics/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzNDYxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0ODQzNTk5LCJpYXQiOjE3MzM0NjEyMDAsImp0aSI6IjgzODI5MmJjLWE4MjYtNDU4NC05MGFkLTI0ZmExODNiNjc5MiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEyLzA2L3RydW1wLWJpbGxpb25haXJlcy1jYWJpbmV0LWV0aGljcy8ifQ.43xYPJC7w0sehcC1HB1hyu0q_3BxRj-5CApv3FROIl4&itid=gfta"
  },
  {
    "text": "Trump announces new role for his administration, names PayPal co-founder ‘White House AI and crypto czar’  —  David Sacks is a longtime ally of Elon Musk and the former COO of PayPal.  —  In this July 15, 2024, file photo, David Sacks, CEO of Yammer, speaks during the first day of the 2024 … ",
    "url": "https://abcnews.go.com/Politics/trump-announces-new-role-administration-names-paypal-founder/story?id=116509911"
  },
  {
    "text": "A big insurer backed off its plan to pay less for anesthesia.  That's bad.  —  Support independent journalism that matters — become a Vox Member today.  —  In November, the American Society of Anesthesiologists (ASA) issued a dire warning: One of America's largest insurance companies … ",
    "url": "https://www.vox.com/policy/390031/anthem-blue-cross-blue-shield-anesthesia-limits-insurance"
  },
  {
    "text": "Of Course Joe Biden Was Right to Pardon His Son  —  People need to stop asking Democrats to play by different rules than Republicans, and they need to stop asking Biden to be a worse father than any of us would be in his place.  —  Bluesky  —  Pocket  —  Ido not believe I have read … ",
    "url": "https://www.thenation.com/article/politics/joe-biden-hunter-pardon-was-right-mystal/"
  },
  {
    "text": "Malliotakis says Republicans should keep investigating Hunter Biden after pardon  —  Rep. Nicole Malliotakis (R-N.Y.) said House Republicans' investigation into President Biden's son, Hunter Biden, should continue despite the president's decision to pardon his son on Sunday.",
    "url": "https://thehill.com/homenews/house/5027053-malliotakis-hunter-biden-pardon-house-republicans/"
  },
  {
    "text": "Trump has an obsession with House members … - House members, by contrast, have to run for reelection every two years and are typically more in touch with the fanatically pro-Trump GOP base.  — “We know what people expect. … - Another two have served in the House … ",
    "url": "https://www.axios.com/2024/12/06/trump-cabinet-congress-house"
  },
  {
    "text": "USDA orders testing of milk for bird flu  —  The mandate targeting bulk milk transporters and dairy processors is meant to help identify herds that have caught the virus, which has spread among livestock.  —  The national milk supply must be tested for bird flu under a federal order announced Friday … ",
    "url": "https://www.nbcnews.com/health/health-news/usda-orders-testing-milk-bird-flu-rcna183212"
  },
  {
    "text": "The Rage and Glee That Followed a C.E.O.'s Killing Should Ring All Alarms  —  It started barely minutes after the horrifying news broke that the chief executive of UnitedHealthcare, Brian Thompson, was fatally shot in midtown Manhattan.  Even before any details were available … ",
    "url": "https://www.nytimes.com/2024/12/06/opinion/united-health-care-ceo-shooting.html"
  },
  {
    "text": "Melania Trump sells Christmas ornaments during Fox News appearance  —  Melania Trump — set to return to the White House in January as first lady — showcased her new Christmas ornament collection during a recent appearance on Fox News.  —  “After I left the White House … ",
    "url": "https://thehill.com/homenews/media/5026920-melania-trump-christmas-ornaments-fox-appearance/"
  },
  {
    "text": "Paul Krugman retires as Times columnist  —  After nearly 25 years as an Opinion columnist, Paul is signing off.  —  I want to take you back to Jan. 2, 2000, a day when Y2K was in the rearview mirror and the dot-com bubble burst was just around the corner, when the Dow stood at a mighty 11,500 … ",
    "url": "https://www.nytco.com/press/paul-krugman-retires-as-times-columnist/"
  },
  {
    "text": "Millions will lose health coverage if ACA subsidies expire: CBO  —  A new report released by the Congressional Budget Office (CBO) found that if the Affordable Care Act's (ACA) extended subsidies are allowed to expire at the end of 2025, millions of people will become uninsured and premiums will rise.",
    "url": "https://thehill.com/policy/healthcare/5026478-affordable-care-act-subsidies-expiration-health-coverage/"
  },
  {
    "text": "Exclusive: Trump may cancel US Postal Service electric mail truck contract, sources say  —  Donald Trump's transition team is considering canceling the United States Postal Service's contracts to electrify its delivery fleet, as part of a broader suite of executive orders targeting electric vehicles … ",
    "url": "https://www.reuters.com/business/autos-transportation/trump-may-cancel-us-postal-service-electric-mail-truck-contract-sources-say-2024-12-06/"
  },
  {
    "text": "TikTok Faces U.S. Ban After Losing Bid to Overturn New Law  —  The law will ban the video app in the United States by Jan. 19 if its owner, ByteDance, does not sell it to a non-Chinese company.  —  TikTok is one step closer to disappearing in the United States after a panel of federal judges … ",
    "url": "https://www.nytimes.com/2024/12/06/business/media/tiktok-ban-court-decision.html"
  },
  {
    "text": "Everybody Loves FRED: How America Fell for a Data Tool  —  From Facebook political debates to college classrooms, the St. Louis Fed's data tool has gained a major following.  —  Fans post about him on social media.  Swag bearing his name sells out on the regular.",
    "url": "https://www.nytimes.com/2024/12/06/business/economy/fred-economic-data-fandom.html"
  },
  {
    "text": "Hegseth Brings His Nomination Back from the Brink  —  DONALD TRUMP WANTS HIS CABINET nominees to “earn” their confirmation on their own.  —  But on Friday, the president-elect went out of his way to give an attaboy to Pete Hegseth just hours after the defense secretary pick scolded reporters … ",
    "url": "https://www.thebulwark.com/p/hegseth-brings-his-nomination-back"
  },
  {
    "text": "California Capitol building evacuated after receiving threat  —  The state Assembly and Senate are currently on recess until Jan. 6.  —  SACRAMENTO, California — The California Capitol building in Sacramento was evacuated on Friday morning after receiving a threat.",
    "url": "https://www.politico.com/news/2024/12/06/california-capitol-evacuated-threat-00193046"
  },
  {
    "text": "Owner of Los Angeles Times Plans ‘Bias Meter’ Next to Coverage  —  Dr. Patrick Soon-Shiong said that he planned to introduce the tool, which he said would appear next to the paper's news articles and opinion pieces, in January.  —  Patrick Soon-Shiong, the billionaire owner of The Los Angeles Times … ",
    "url": "https://www.nytimes.com/2024/12/06/business/media/la-times-owner-bias-meter.html?unlocked_article_code=1.fU4.t5Jt.c6WAUfp8E65h"
  },
  {
    "text": "Pre-election research shows disturbing trend among Republicans  —  Public opinion research conducted in October shows a shift in one political party that might make Donald Trump's election on Nov. 5 less of a surprise.  A majority of the party now agrees with a sentiment about immigration … ",
    "url": "https://www.alternet.org/trump-poisoning-the-blood/"
  },
  {
    "text": "How measles, whooping cough and worse could roar back on RFK Jr.'s watch  —  The availability of safe, effective COVID vaccines less than a year into the pandemic marked a high point in the 300-year history of vaccination, seemingly heralding an age of protection against infectious diseases.",
    "url": "https://www.npr.org/sections/shots-health-news/2024/12/06/nx-s1-5218574/rfk-vaccines-anti-vaccine-infectious-disease"
  },
  {
    "text": "Kash Patel's Podcast Problem  —  “Factions of Republican lawmakers at war over how to slash federal spending,” Politico reports, “are scrambling to recruit Elon Musk and Vivek Ramaswamy to their cause”: … And how better to do that than by lobbying Trump's quasi-governmental billionaire pals?",
    "url": "https://www.thebulwark.com/p/kash-patels-podcast-problem"
  },
  {
    "text": "Elon Musk was behind mysterious pro-Trump super PAC that invoked Ruth Bader Ginsburg  —  The world's richest man was likely the single largest individual political donor of the 2024 election.  —  Elon Musk was the sole funder of a super PAC formed in the final weeks of the election … ",
    "url": "https://www.politico.com/elon-musk-trump-donations-super-pac"
  },
  {
    "text": "Eric Adams doesn't rule out switch to the GOP: ‘Cancel me’  —  The New York City mayor has been at odds with national Democrats over immigration.  —  NEW YORK — New York City Mayor Eric Adams, a Democrat who has taken a soft touch with President-elect Donald Trump, left open the possibility … ",
    "url": "https://www.politico.com/news/2024/12/06/new-york-eric-adams-republican-party-00192988"
  },
  {
    "text": "The Trump NIH Pick Who Wants to Take On ‘Cancel Culture’ Colleges  —  Jay Bhattacharya would consider academic freedom at universities and medical schools seeking NIH grants  —  President-elect Donald Trump's nominee to lead the National Institutes of Health wants to take on campus culture … ",
    "url": "https://www.wsj.com/health/healthcare/jay-bhattacharya-national-institute-health-grants-cancel-culture-645101f5"
  },
  {
    "text": "Many targeted for removal by Trump can't be deported, ICE data shows  —  Barriers to sending some immigrants home are among the legal and logistical obstacles President-elect Donald Trump faces as he pledges mass deportations  —  Nearly half of the 1.4 million people in the U.S. immigration system … ",
    "url": "https://www.washingtonpost.com/immigration/2024/12/06/mass-deportation-obstacles-trump-migrants/"
  },
  {
    "text": "Breaking news.  Romanian court cancels presidential election in latest political earthquake  —  The first round of the elections saw a previously unknown far-right nationalist candidate Călin Georgescu top the polls in a shock result.  —  The Romanian presidential run-off between … ",
    "url": "https://www.euronews.com/my-europe/2024/12/06/romanian-constitutional-court-blocks-presidential-run-off"
  },
  {
    "text": "Republican senators launch inquiry into unpublished NIH study on puberty blockers for trans youth  —  Six Republican senators in a letter to National Institutes of Health (NIH) Director Monica Bertagnolli said they are “concerned about the transparency” of studies funded by the NIH … ",
    "url": "https://thehill.com/homenews/lgbtq/5027047-nih-study-puberty-blockers-letter/"
  }
]