[
  {
    "text": "Scoop: Biden rebels in Congress see their revolt crumbling … - One shell-shocked lawmaker who was present at the meeting would offer only one word to characterize it: “Intense.”  — Another described the mood as “pretty much unanimous” that Biden has “got to step down,” adding … ",
    "url": "https://www.axios.com/2024/07/09/biden-house-democrats-withdraw-nominee"
  },
  {
    "text": "House Dems' ‘sad’ venting session yields no clear path forward on Biden's future  —  In a private Tuesday meeting, multiple House Democrats made the case for replacing the president at the top of the ticket, while House Minority Leader Hakeem Jeffries advised members to stay unified.",
    "url": "https://www.politico.com/news/2024/07/09/house-dems-vent-00167036"
  },
  {
    "text": "Playbook PM: Haley releases delegates to Trump  —  THE CATCH-UP  —  SCOOP: HALEY RELEASES DELEGATES — Former South Carolina Gov. NIKKI HALEY is releasing all of her 97 delegates and urging them to vote for DONALD TRUMP at next week's Republican National Convention, our colleague Meridith McGraw reports.",
    "url": "https://www.politico.com/newsletters/playbook-pm/2024/07/09/scoop-haley-releases-delegates-to-trump-00132333"
  },
  {
    "text": "Poll finds Biden damaged by debate; with Harris and Clinton best positioned to win  —  Vice President Kamala Harris is now running ahead of Trump, 42 percent to 41 percent, the survey found.  —  A top Democratic pollster has a new survey showing President Joe Biden still in contention against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/09/biden-clinton-harris-democrat-poll-00166937"
  },
  {
    "text": "Kamala Harris beats Donald Trump, new poll shows, performs better than Joe Biden  —  WASHINGTON — Vice President Kamala Harris could narrowly beat Donald Trump in November, according to a new national poll from a Democratic pollster.  —  Harris is ahead by 1 point in the poll conducted … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/09/harris-beat-trump-poll-biden/74333759007/"
  },
  {
    "text": "The Democratic Party Must Speak the Plain Truth to the President  —  For voters who held out hope that President Biden's failure to communicate during last month's debate was an aberration, the intervening days have offered little comfort.  —  Donald Trump's candidacy for a second term poses a grave threat to American democracy.",
    "url": "https://www.nytimes.com/2024/07/08/opinion/editorials/democrats-biden-truth.html"
  },
  {
    "text": "The Biden-Parkinson's mini-controversy, explained  —  One effect of Biden's poor debate performance?  New eagerness to uncover evidence of Biden's physical failings.  —  For some time, there had been little question that the White House was taking steps to protect President Biden from scrutiny.",
    "url": "https://www.washingtonpost.com/politics/2024/07/09/biden-debate-physical-issues/"
  },
  {
    "text": "How Biden's Inner Circle Worked to Keep Signs of Aging Under Wraps  —  Aides kept a tight rein on the president's travel plans, news conferences, public appearances and meetings with donors while Biden's stumbles became increasingly obvious",
    "url": "https://www.wsj.com/politics/policy/joe-biden-age-public-election-campaign-343a47bf"
  },
  {
    "text": "The media has been breathlessly attacking Biden.  What about Trump?  —  The bigger story is Donald Trump's appalling unfitness for office.  He tried to overturn a legitimate election and is a felon  —  It's possible for two conflicting ideas to be true at once.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/09/biden-media-attacks-trump-felon"
  },
  {
    "text": "Navy sailor tried to access Biden's medical records multiple times  —  A junior Navy sailor attempted to access the medical records of President Biden from a military medical database three times in February but was unable to do so, the U.S. Navy confirms to CBS News.",
    "url": "https://www.cbsnews.com/news/navy-sailor-tries-to-access-biden-medical-records/"
  },
  {
    "text": "J.D. Vance Has a Problem on His Face  —  J.D. VANCE IS THE BEST BET on the predictive markets to be Donald Trump's running mate.  But an only-in-MAGAville issue might stand in the Ohio Republican's way: facial hair.  —  “J.D. has a beard.  But Trump is a clean-shaven guy.",
    "url": "https://www.thebulwark.com/p/jd-vance-has-a-problem-on-his-face"
  },
  {
    "text": "China's army shows up on NATO's border  —  with PHELIM KINE  —  HELLO CHINA WATCHERS.  For once your Europe-China correspondent Stuart Lau is also in (a very hot) Washington, covering the NATO summit which is set to begin today.  Phelim Kine will write to you from the very same city on Thursday.",
    "url": "https://www.politico.eu/newsletter/china-watcher/chinas-army-shows-up-on-natos-border/"
  },
  {
    "text": "The alarming new power Trump will claim in a second term  —  Donald Trump says that if he returns to the White House in 2025, he will have the power to effectively cancel any federal program — or even an entire agency — by refusing to spend money appropriated by Congress.",
    "url": "https://popular.info/p/the-alarming-new-power-trump-will"
  },
  {
    "text": "Marla Maples Is Reportedly Ready to Throw Her Hat in the Trump VP Ring  —  ALL IS FORGIVEN  —  The former president's second wife opened up on her relationship with Trump and 2024 in a new interview, and sources tell the Evening Standard she's ready to join the veepstakes.",
    "url": "https://www.thedailybeast.com/marla-maples-is-reportedly-ready-to-throw-her-hat-in-the-trump-vp-ring"
  },
  {
    "text": "A Dangerous Double Standard  —  All our energies must go to defeating Trump  —  What a weekend.  You know I have seen some things in my seven decades covering American politics.  I have never seen anything quite like the wrangling, hand-wringing, and behind-the-scenes gamesmanship currently swirling around President Biden.",
    "url": "https://steady.substack.com/p/a-dangerous-double-standard"
  },
  {
    "text": "U.S. Officials Say Russia Is Unlikely to Take Much More Ukrainian Territory  —  Russian forces continue to inflict pain, but NATO leaders gathering in Washington can say that their efforts to strengthen Ukraine are working.  —  Russia is unlikely to make significant territorial gains … ",
    "url": "https://www.nytimes.com/2024/07/09/us/politics/russia-ukraine-nato.html"
  }
]