[
  {
    "text": "How Trump Is Scrambling to Raise Cash  —  The former president is facing converging financial crunches as he and the Republican Party confront a shortfall against President Biden and the Democrats.  —  As many as three nights a week, Donald J. Trump has been hosting private dinners at Mar-a-Lago … ",
    "url": "https://www.nytimes.com/2024/03/16/us/politics/trump-finances-money-fundraising.html"
  },
  {
    "text": "Republican Senate Slugfest in Ohio Fuels Jitters About Trump's Candidate  —  The former president will appear alongside Bernie Moreno on Saturday, one potential sign that Mr. Moreno could use an 11th-hour assist.  —  The former president will appear alongside Bernie Moreno on Saturday … ",
    "url": "https://www.nytimes.com/2024/03/16/us/politics/ohio-republican-senate-primary-trump.html"
  },
  {
    "text": "Laura Ingraham Apologizes for Graphic of Wrong Black Lawyer  —  On The Ingraham Angle, attorney Terrence Bradley was substituted for Nathan Wade in a graphic alongside Fani Willis.  —  Fox News host Laura Ingraham apologized Friday night for a graphic that erroneously identified attorney Terrence Bradley … ",
    "url": "https://www.thedailybeast.com/laura-ingraham-apologizes-for-graphic-of-wrong-black-lawyer"
  },
  {
    "text": "Exclusive: Musk's SpaceX is building spy satellite network for US intelligence agency, sources say  —  SpaceX is building a network of hundreds of spy satellites under a classified contract with a U.S. intelligence agency, five sources familiar with the program said, demonstrating deepening … ",
    "url": "https://www.reuters.com/technology/space/musks-spacex-is-building-spy-satellite-network-us-intelligence-agency-sources-2024-03-16/"
  },
  {
    "text": "‘Democracy is teetering’: at ground zero for Trump's big lie in Arizona  —  The state Republican party is undaunted by electoral defeats for those claiming voting is rigged - and election officials are bearing the brunt of their fury  —  On a glorious spring day in Phoenix … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/16/arizona-election-denial-consequences"
  },
  {
    "text": "The Great Resignation hits Congress: Lawmakers are quitting, too  —  The 118th Congress has been so unpopular among members of the House themselves that it's leading to an unprecedented number of resignations  —  Despite all the congressional gridlock these days, lawmakers have succeeded … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/16/congress-lawmakers-resignations/"
  },
  {
    "text": "Creditors demand Rudy Giuliani sell his $3.5 million Florida condo to pay debts  — Creditors want to force Rudy Giuliani to sell his $3.5 million Florida condo to help pay off his nearly $152 million in debt.  — Giuliani has argued that he does not have the funds to pay his debts … ",
    "url": "https://www.cnbc.com/2024/03/16/rudy-giuliani-should-sell-3point5-million-florida-condo-creditors-claim.html"
  },
  {
    "text": "New Welsh leader ‘honored’ to be Europe's first Black national leader  —  Vaughan Gething, son of a Welsh father and Zambian mother, said he is honored to be “the first black leader in any European country.”  —  Vaughan Gething won the Welsh Labour Party leadership contest on Saturday … ",
    "url": "https://www.nbcnews.com/news/world/new-welsh-leader-honored-europes-first-black-national-leader-rcna143711"
  },
  {
    "text": "Leaked SpaceX documents show company forbids employees to sell stock if it deems they've misbehaved  —  ‘An act of dishonesty against the company’ is among the violations cited  —  SpaceX requires employees to agree to some unusual terms related to their stock awards, which have a chilling effect on staff … ",
    "url": "https://techcrunch.com/2024/03/15/spacex-employee-stock-sales-forbidden/"
  },
  {
    "text": "For the country's sake, Vice President Harris should step aside  —  The Democratic Party's indulgence of identity politics has proved successful in building a diverse organization, but its strategy of courting (and pandering to) minority voters is the road to ruin.",
    "url": "https://www.washingtonpost.com/opinions/2024/03/15/kamala-harris-quit-biden-2024/"
  },
  {
    "text": "Ukraine attacks Russian city and refinery on second day of presidential election  —  A Ukrainian missile attack killed two people in western Russia and a separate drone strike set an oil refinery ablaze on Saturday, the second day of an election that President Vladimir Putin has accused Kyiv of trying to disrupt.",
    "url": "https://www.reuters.com/world/europe/ukraine-strikes-russian-city-refinery-day-two-presidential-vote-2024-03-16/"
  },
  {
    "text": "‘Engage on this issue’: House GOP leadership tells members to take on abortion; IVF  —  WASHINGTON — Republican leaders are encouraging Congressional candidates not to shy away from discussing abortion and in vitro fertilization during the election this fall.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/16/gop-tells-candidates-abortion-ivf-important-issues/72990434007/"
  },
  {
    "text": "SBF Considered ‘Coming Out as a Republican’ Amid FTX Collapse  — Prosecutors disclose Bankman-Fried plans in sentencing memo  — SBF considered going on Tucker Carlson, opposing woke ‘agenda’  —  Sam Bankman-Fried came up with a lot of ideas to rehabilitate his image and launch … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-15/sbf-considered-coming-out-as-a-republican-amid-ftx-collapse"
  },
  {
    "text": "‘We are losing our kids to a satanic cult,’ Sen. Tommy Tuberville warns during Utah campaign stop  —  The Alabama Republican has endorsed Republican U.S. Senate candidate Trent Staggs in the race to replace Utah Sen. Mitt Romney in Congress.  —  Alabama Republican U.S. Sen. Tommy Tuberville … ",
    "url": "https://www.sltrib.com/news/politics/2024/03/15/we-are-losing-our-kids-satanic/"
  }
]