[
  {
    "text": "The Colorado Decision: Heads Trump Wins.  Tails America Loses.  —  1. The Sunshine State  —  I don't have a firm opinion about the Colorado Supreme Court's ruling that Donald Trump cannot appear on the state's presidential ballot.  —  As a matter of law, I can see it both ways.",
    "url": "https://plus.thebulwark.com/p/the-colorado-decision-heads-trump"
  },
  {
    "text": "Disqualifying Trump from the Ballot is a Step Too Far  —  The political case against Colorado's legal ruling  —  Colorado's Supreme Court ruled that Donald Trump can be disqualified from the presidential ballot on the basis of the 14th Amendment to the Constitution, which bars people … ",
    "url": "https://nymag.com/intelligencer/2023/12/colorado-court-trump-disqualified-ballot-insurrection-case-against.html"
  },
  {
    "text": "Will the U.S.Supreme Court Keep Donald Trump Off the Ballot ?  Some Initial Thoughts  —  I am traveling and so I offer only some brief and initial thoughts here about what the United States Supreme Court may and should do in light of the Colorado Supreme Court's determination that Donald Trump … ",
    "url": "https://electionlawblog.org/?p=140303"
  },
  {
    "text": "Donald Trump banned from Colorado ballot in historic ruling by state's Supreme Court  —  A divided Colorado Supreme Court on Tuesday declared former President Donald Trump ineligible for the White House under the U.S. Constitution's insurrection clause and removed him from the state's … ",
    "url": "https://apnews.com/article/trump-insurrection-14th-amendment-2024-colorado-d16dd8f354eeaf450558378c65fd79a2"
  },
  {
    "text": "Sen. Thom Tillis moves to block other states from disqualifying Trump after Colorado decision  —  Sen. Thom Tillis, R-N.C., is moving to give the U.S. Supreme Court sole power to review presidential candidate qualifications after a controversial Colorado Supreme Court's decision … ",
    "url": "https://www.usatoday.com/story/news/politics/2023/12/20/tillis-bill-colorado-disqualifies-trump/71982452007/"
  },
  {
    "text": "Texas Lt. Gov. Floats Removing Biden From State Ballot in Response to Colorado Dumping Trump  —  Dan Patrick cited the border when considering the move in response to Trump's current 2024 legal battle  —  Republican Texas Lt. Gov. Dan Patrick floated the idea of booting President Joe Biden … ",
    "url": "https://themessenger.com/politics/texas-dan-patrick-biden-ballot-removal-trump-colorado"
  },
  {
    "text": "How Christie became a ‘monumental problem’ for Haley — and a potential boon to Trump  —  The former New Jersey governor could complicate Nikki Haley's math in New Hampshire, some prominent Republicans say.  —  Chris Christie has singularly devoted his presidential campaign to tearing down Donald Trump.",
    "url": "https://www.politico.com/news/2023/12/20/chris-christie-nikki-haley-trump-spoiler-00132567"
  },
  {
    "text": "4 takeaways from the Colorado Supreme Court's disqualifying Trump  —  Tuesday will go down as a momentous date in American political history, with the Colorado Supreme Court ruling that a former president engaged in insurrection and is therefore disqualified from the presidency.",
    "url": "https://www.washingtonpost.com/politics/2023/12/19/4-takeaways-colorado-supreme-courts-disqualifying-trump/"
  },
  {
    "text": "Booting Trump off the ballot isn't just legally correct — it's the smart move for the Supreme Court  —  This is one of those rare situations where what's good for the country is also good for the GOP  —  Let's just get this out the way up front: If Donald Trump is removed from enough state ballots … ",
    "url": "https://www.salon.com/2023/12/20/booting-off-the-ballot-isnt-just-legally-correct--its-the-smart-move-for-the/"
  },
  {
    "text": "Giuliani's Money Woes Were a Focus of Ukraine Inquiry, Records Reveal  —  F.B.I. agents scrutinizing Rudolph W. Giuliani's efforts to oust the American ambassador to Ukraine thought financial problems might be motivating his actions.  —  Before Rudolph W. Giuliani was ordered to pay $148 million … ",
    "url": "https://www.nytimes.com/2023/12/19/nyregion/giuliani-trump-ukraine-fbi.html"
  },
  {
    "text": "Xi warned Biden during summit that Beijing will reunify Taiwan with China  —  The Chinese leader's message in San Francisco got the attention of U.S. officials because it was delivered at a meeting that was intended to reduce tensions.  —  WASHINGTON — Chinese President Xi Jinping bluntly … ",
    "url": "https://www.nbcnews.com/news/china/xi-warned-biden-summit-beijing-will-reunify-taiwan-china-rcna130087"
  },
  {
    "text": "How Ron DeSantis' $100 Million ‘Death Star’ Collapsed  —  The super PAC Never Back Down was supposed to win DeSantis the GOP nomination.  Instead, it became a political cautionary tale.  —  Long before Ron DeSantis' presidential ambitions began to falter, it was clear to anyone paying close attention … ",
    "url": "https://www.thedailybeast.com/how-ron-desantis-dollar100-million-death-star-never-back-down-super-pac-collapsed"
  },
  {
    "text": "Judge reverses earlier decision and allows removal of Confederate memorial at Arlington Cemetery  —  The allegations that the removal efforts amounted to grave desecration “were, at best, ill-informed and, at worst, inaccurate,” the judge wrote.  —  ALEXANDRIA, Va. — A federal judge … ",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-reverses-earlier-decision-allows-removal-confederate-memorial-ar-rcna130566"
  },
  {
    "text": "Trump, Attacked for Echoing Hitler, Says He Never Read ‘Mein Kampf’  —  The former president's comments on migrants have been widely criticized as racist and xenophobic.  —  Former President Donald J. Trump on Tuesday doubled down on his widely condemned comment that undocumented immigrants are … ",
    "url": "https://www.nytimes.com/2023/12/19/us/politics/trump-immigrants-hitler-mein-kampf.html"
  },
  {
    "text": "Humanitarian groups urge Austin to halt Israel aid over Gaza operations  —  The push from Amnesty International, Human Rights Watch and others comes as the Pentagon chief presses his Israeli counterparts to scale back action.  —  A group of prominent humanitarian organizations is calling … ",
    "url": "https://www.politico.com/news/2023/12/20/humanitarian-groups-urge-austin-to-halt-israel-aid-over-gaza-operations-00132694"
  },
  {
    "text": "US defense secretary makes unannounced visit to USS Gerald R Ford aircraft carrier defending Israel  —  U.S. Defense Secretary Lloyd Austin flew out to the USS Gerald R. Ford aircraft carrier Wednesday to meet with the sailors he has ordered to remain at sea to prevent the Israel-Hamas war … ",
    "url": "https://apnews.com/article/israel-palestinians-us-austin-b606e2bc61b57493cd2d322ebd1885d6"
  }
]