[
  {
    "text": "Musk says all federal employees need to explain their work immediately — or be let go  —  Federal employees received an email Saturday afternoon, and gave them a deadline of Monday night.  —  All federal government employees will have to share what they've been working on in the last week or face dismissal, Elon Musk said Saturday.",
    "url": "https://www.politico.com/news/2025/02/22/musk-federal-employees-explanation-dismissal-00205613"
  },
  {
    "text": "Feds must answer email on what they did last week — or lose jobs, Musk says  —  Emails began going out to the 2.3-million federal employees Saturday asking for five bullet points of their accomplishments.  —  Federal workers began receiving emails Saturday asking them to describe what they did last week … ",
    "url": "https://www.washingtonpost.com/nation/2025/02/22/musk-email-federal-workers/"
  },
  {
    "text": "Federal employees told to justify jobs in email or Musk says they face dismissal  —  Federal workers began receiving emails Saturday asking them to explain what work they did last week, as Elon Musk announced that “failure to respond will be taken as a resignation.”",
    "url": "https://www.cnn.com/2025/02/22/politics/elon-musk-employees-emails"
  },
  {
    "text": "Elon Musk Threatens FBI Agents and Air Traffic Controllers With Forced Resignation If They Don't Respond to an Email  —  Employees throughout the federal government have until 11:59pm ET Monday to detail five things they accomplished in the last week.  —  Elon Musk is once again leaving … ",
    "url": "https://www.wired.com/story/doge-elon-musk-forced-resignation-email-twitter/"
  },
  {
    "text": "FBI Director Kash Patel to be named ATF chief  —  Patel is set to lead an agency that's been a frequent target of Republicans, including an effort to abolish it altogether.  —  President Donald Trump's newly-confirmed FBI director, Kash Patel, is expected to take on another top law enforcement role … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-director-kash-patel-named-atf-chief-rcna193332"
  },
  {
    "text": "Trump expected to name Kash Patel as acting ATF director: Sources  —  An official said Patel will likely be sworn into the position early next week.  —  FBI Director nominee Kash Patel gestures as he walks on stage to speak during the inaugural parade inside Capital One Arena, in Washington, DC, on Jan. 20, 2025.",
    "url": "https://abcnews.go.com/Politics/trump-expected-kash-patel-acting-atf-director/story?id=119086967"
  },
  {
    "text": "In Pursuit of a ‘Warrior Ethos,’ Hegseth Targets Military's Top Lawyers  —  The defense secretary has repeatedly derided the military lawyers for war crime prosecutions and battlefield rules of engagement.  —  Defense Secretary Pete Hegseth's decision to fire the top lawyers for the Army … ",
    "url": "https://www.nytimes.com/2025/02/22/us/politics/hegseth-firings-military-lawyers-jag.html"
  },
  {
    "text": "Trump Tells CPAC His Goal Is a ‘Lasting’ Republican Majority  — President sees GOP lawmakers falling in line behind his agenda  — Conservative meeting draws Trump allies Meloni, Duda and Milei  —  President Donald Trump expressed optimism about negotiations in Congress to push forward … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-22/trump-tells-cpac-his-goal-is-a-lasting-republican-majority"
  },
  {
    "text": "As sales drop, artists weigh canceling Kennedy Center shows in protest  —  Ticket sales dropped roughly 50 percent week-over-week after Trump announced his takeover, sources said.  Meanwhile, performers are mulling their options.  —  W. Kamau Bell was scheduled to perform at the Kennedy Center … ",
    "url": "https://www.washingtonpost.com/entertainment/2025/02/22/artists-cancel-kennedy-center-shows-ticket-sales/"
  },
  {
    "text": "Kennedy Center reeling from ‘stunning’ ticket sales collapse after Trump takeover: report  —  A decision by Donald Trump to fire everyone and wrest control of the John F. Kennedy Center for the Performing Arts on the banks of the Potomac has led to an alarming downward spiral in ticket sales … ",
    "url": "https://www.rawstory.com/trump-kennedy-center/"
  },
  {
    "text": "U.S.A.I.D. Appointees Fire Hundreds Working on Urgent Humanitarian Aid  —  The firings added to doubts about whether Secretary of State Marco Rubio, the agency's acting head, supports lifesaving humanitarian assistance, as he has said he does.  —  Trump administration appointees running … ",
    "url": "https://www.nytimes.com/2025/02/22/us/politics/usaid-urgent-aid-firings.html"
  },
  {
    "text": "Measles Outbreaks in Texas and New Mexico Sicken Nearly 100 People  —  Texas reported 90 cases this week, while New Mexico reported nine.  A majority of the cases have been in a Texas county where vaccination rates have lagged behind the rest of the state.  —  Outbreaks of measles in parts … ",
    "url": "https://www.nytimes.com/2025/02/22/us/texas-measles-outbreak.html?unlocked_article_code=1.y04.4uZP.Cl0OlTn70tou&smid=url-share"
  },
  {
    "text": "Musk's cost-cutting team is laying off workers at the auto safety agency overseeing his car company  —  Elon Musk's cost-cutting team is eliminating jobs at the vehicle safety agency that oversees Tesla and has launched investigations into deadly crashes involving his company's cars.",
    "url": "https://apnews.com/article/musk-trump-autonomous-selfdriving-doge-auto-safety-99b369c5e3ccd3e7c09b6951604b3a0a"
  },
  {
    "text": "Musk's DOGE says it has saved $55 billion.  Not so fast.  —  A Washington Post analysis found that hundreds of the canceled contracts DOGE listed represent savings of $0 each.  —  Elon Musk's U.S. DOGE Service claimed this week to have saved an estimated $55 billion through a combination of layoffs … ",
    "url": "https://www.washingtonpost.com/business/2025/02/22/doge-savings-found-list-analysis/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwMjAwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxNTc5MTk5LCJpYXQiOjE3NDAyMDA0MDAsImp0aSI6Ijk1YWFkZTllLTU0NDAtNGQ0Yi1iZWI3LWMwMDg5M2NhMTYxNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzIyL2RvZ2Utc2F2aW5ncy1mb3VuZC1saXN0LWFuYWx5c2lzLyJ9.Y-VGkg7MWDYtyE5gBTQmGlQjkV8RurPAEMvxlaGw3sY&fbclid=PAZXh0bgNhZW0CMTEAAaYJ_9C-it2tY45pxnA33j5qgGkOf7NRCvw0gZdhXHFP8bkwnzt2LmackZg_aem_O_QhatWnnhDiFgAqR7R4zA"
  },
  {
    "text": "With Pentagon purge, Trump thrusts military into uncharted territory  —  The abrupt removal of six top officers has deepened concern among the president's critics, who fear he intends to impose his political will on the nonpartisan institution.  —  President Donald Trump's Friday night purge … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/22/trump-pentagon-purge-charles-q-brown/"
  },
  {
    "text": "Trump's Firing of Gen. Charles Q. Brown May Have Roots in George Floyd Protests  —  A four-minute video appears to have been a turning point for the president and Gen. Charles Q. Brown Jr., the ousted Joint Chiefs chairman.  —  For the second time, the killing of George Floyd by a police officer … ",
    "url": "https://www.nytimes.com/2025/02/22/us/politics/trump-cq-brown-george-floyd.html?unlocked_article_code=1.zE4.rxN4.uDFfrW_HISFr&smid=bs-share"
  },
  {
    "text": "‘Trump Recruited as Moscow Asset,’ Says Ex-KGB Spy Chief  —  Alnur Mussayev, former head of Kazakhstan's security service, who rose up the ranks of the Soviet KGB, claims Moscow groomed Trump under pseudonym “Krasnov” in 1987.  —  US President Donald Trump was groomed 37 years ago … ",
    "url": "https://www.kyivpost.com/post/47630"
  },
  {
    "text": "CDC Shutters PRAMS Program on Maternal and Infant Health  —  The Pregnancy Risk Assessment Monitoring System (PRAMS) is a federal data collection system, run out of CDC, “designed to identify groups of women and infants at high risk for health problems, to monitor changes in health status … ",
    "url": "https://talkingpointsmemo.com/edblog/cdc-shutters-prams-program-on-maternal-and-infant-health"
  },
  {
    "text": "Federal Judge to Trump: No, You Can't Ban DEI  —  For now, the administration can't “impede, block, cancel, or terminate” diversity and inclusion funds and obligations.  —  On Friday, a federal judge partly blocked President Donald Trump's attempt to root out programs related to diversity … ",
    "url": "https://www.motherjones.com/politics/2025/02/federal-judge-trump-dei-order-blocked/"
  },
  {
    "text": "CT man accused of cannibalism and murder is granted conditional release  —  A man accused of cannibalism and murder has been granted conditional release, according to the Connecticut Psychiatric Security Review Board (PSRB).  —  The board granted Tyree Smith's release after a careful review of his clinical progress, officials said.",
    "url": "https://www.nbcboston.com/news/local/ct-man-accused-cannibalism-murder-granted-conditional-release/3638850/"
  },
  {
    "text": "Federal prisons prep to move trans inmates as early as next week  —  The Bureau of Prisons is pushing ahead with plans to move transgender inmates out of prisons that align with their gender identity and into facilities corresponding to their sex at birth.  The moves could happen as early as next week … ",
    "url": "https://www.npr.org/2025/02/21/nx-s1-5305282/trans-inmates-federal-prison-policy-transfers"
  },
  {
    "text": "Pope Francis is in critical condition after long respiratory crisis, requiring oxygen at high flow  —  Pope Francis was in critical condition Saturday after he suffered a long asthmatic respiratory crisis that required high flows of oxygen, the Vatican said.",
    "url": "https://apnews.com/article/pope-francis-pneumonia-sepsis-vatican-respiratory-infection-bab5b9a141517171d4efc71fadafa0a4"
  }
]