[
  {
    "text": "Trump and DeSantis meet privately in Florida  —  Former president Donald Trump and Florida Gov. Ron DeSantis met privately Sunday morning in Miami, according to people familiar with the matter, breaking a years-long chill between the presumptive Republican nominee and his onetime chief primary rival.",
    "url": "https://www.washingtonpost.com/politics/2024/04/28/trump-desantis-meeting/"
  },
  {
    "text": "CNN Poll: Trump maintains lead over Biden in 2024 matchup as views on their presidencies diverge  —  Donald Trump continues to hold an advantage over President Joe Biden as the campaign - and the former president's criminal trial - move forward, according to a new CNN poll conducted by SSRS.",
    "url": "https://www.cnn.com/2024/04/28/politics/cnn-poll-trump-biden-matchup/"
  },
  {
    "text": "CBS News poll finds Biden-Trump race tight in Michigan, Pennsylvania, Wisconsin  —  For years, they've been three of the handful of states that decided presidential elections.  In the summer of 2020, amid the COVID pandemic and lockdown debates, sizable majorities in Michigan, Wisconsin, and Pennsylvania rated state economies badly.",
    "url": "https://www.cbsnews.com/news/biden-trump-poll-michigan-pennyslvania-wisconsin/"
  },
  {
    "text": "The Far Right's Campaign to Explode the Population  —  Behind the scenes at the first Natal Conference, where a motley alliance is throwing out the idea of winning converts to their cause and trying to make their own instead.  —  The threat, we are told here this weekend, is existential, biological, epoch-defining.",
    "url": "https://www.politico.com/news/magazine/2024/04/28/natalism-conference-austin-00150338"
  },
  {
    "text": "Texans wide receiver among 10 hit in mass shooting  —  Houston Texans wide receiver Tank Dell is out of the hospital after suffering an injury in a mass shooting in Florida on Sunday.  —  Dell was at a private event hosted by the restaurant Cabana Live.  Typically, the restaurant limits … ",
    "url": "https://www.washingtonexaminer.com/news/crime/2982458/texans-wide-receiver-among-10-hit-in-mass-shooting/"
  },
  {
    "text": "The Supreme Court's men aren't here to protect you  —  This week's arguments at the U.S. Supreme Court were disturbing.  They also, however, can and should serve as a warning siren.  Attention on the courts must be centered in our political discussions to ensure that our courts can serve … ",
    "url": "https://www.lawdork.com/p/the-supreme-courts-men-arent-here"
  },
  {
    "text": "Green Party presidential candidate among those arrested as campus protests multiply  —  “Physical altercations” occurred Sunday on the UCLA campus when demonstrators breached a security barrier set up to keep people protesting the Israeli war in Gaza separate from counterprotesters, the school said in a statement.",
    "url": "https://www.usatoday.com/story/news/nation/2024/04/28/gaza-war-campus-protests-arrests/73491973007/"
  },
  {
    "text": "Kristi Noem defends dog slaying as ‘responsible’  —  The story of Noem shooting and killing her 14-month-old puppy named has taken a toll on the potential VP pick's public image.  —  Amid waves of backlash from both sides of the aisle, South Dakota Gov. Kristi Noem on Sunday defended … ",
    "url": "https://www.politico.com/news/2024/04/28/kristi-noem-defends-dog-slaying-00154842"
  },
  {
    "text": "Israeli Officials Believe I.C.C. Is Preparing Arrest Warrants Over War  —  Israeli officials increasingly believe that the International Criminal Court is preparing to issue arrest warrants for senior government officials on charges related to the conflict with Hamas, according to five Israeli and foreign officials.",
    "url": "https://www.nytimes.com/2024/04/28/world/middleeast/icc-arrest-warrants-israel-hamas.html"
  },
  {
    "text": "Sanders says there's not ‘any doubt’ what Netanyahu is doing now is ‘ethnic cleansing’  —  Sen. Bernie Sanders (I-Vt.) took aim at Israeli Prime Minister Benjamin Netanyahu again on Sunday, saying that Israel's actions in Gaza are “ethnic cleansing.”  —  Sanders reiterated his familiar call on CNN's … ",
    "url": "https://thehill.com/homenews/senate/4627250-bernie-sanders-benjamin-netanyahu-ethnic-cleansing-israel-gaza/"
  },
  {
    "text": "Former Kansas attorney general announces bid for Congress  —  Former Kansas Attorney General Derek Schmidt (R) announced Friday that he will run for Congress in a bid to replace outgoing Rep. Jake LaTurner (R-Kan.).  —  Schmidt announced his campaign just a week after LaTurner said he will retire from Congress.",
    "url": "https://thehill.com/homenews/campaign/4627771-former-kansas-ag-announces-bid-for-congress/"
  },
  {
    "text": "McConnell: Flipping Senate “most important” thing before leaving leadership … - McConnell announced his plans to leave leadership in February but has committed to staying in Congress until 2027, when his current term expires. … - Brennan had asked what could be done to counter Trump … ",
    "url": "https://www.axios.com/2024/04/28/mitch-mcconnell-2024-election-senate"
  },
  {
    "text": "Fund manager indicates Jim Biden was in business with Qatari officials  —  The alleged arrangements would be some of the closest known links between a Biden relative and a foreign government.  —  New details about Jim Biden's foreign fundraising efforts are spilling out in a Kentucky bankruptcy court … ",
    "url": "https://www.politico.com/news/2024/04/28/jim-biden-qatar-testimony-00154704"
  },
  {
    "text": "Trump allies face criminal trials in majority of key 2024 swing states … - Even a dragged-out process on presidential immunity after Thursday's Supreme Court hearing — which has frozen his federal Jan. 6 case — could avoid a verdict before the election.",
    "url": "https://www.axios.com/2024/04/28/trump-swing-states-fake-electors-indictments"
  },
  {
    "text": "Trump's Economic Confidants Battle for Sway on Tax, Fed Policy  — Policy advisers in Trump's orbit clash over economic ideas  — Trump's team seeking to quell unauthorized policy proposals  —  Economic advisers in Donald Trump's orbit are clashing over their favored policy ideas … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-28/trump-s-economic-confidants-battle-for-sway-on-tax-fed-policy"
  }
]