[
  {
    "text": "Trump announces 30% tariffs against EU, Mexico to begin Aug. 1, rattling major US trading partners  —  President Donald Trump on Saturday announced he's levying tariffs of 30% against the European Union and Mexico starting Aug. 1, a move that could cause massive upheaval between the United States and two of its biggest trade partners.",
    "url": "https://apnews.com/article/trump-tariffs-eu-mexico-66bf84d97dcd69bbd1f1108e42283afd"
  },
  {
    "text": "GOP warning sign in new poll: Trump's voters don't love his tariffs … The survey is a warning sign for Republicans, given how much the president has focused on trade and the promises he's made to bring industries back to the U.S. Trump has also reignited global trade tensions in recent days … ",
    "url": "https://www.politico.com/news/2025/07/12/donald-trump-trade-poll-00449708"
  },
  {
    "text": "Trump threatens to strip Rosie O'Donnell of U.S. citizenship.  —  President Trump said he was weighing using the power of the government against one of his longtime entertainment world nemeses, the comedian and actress Rosie O'Donnell, threatening to revoke her citizenship.",
    "url": "https://www.nytimes.com/2025/07/12/us/politics/trump-rosie-odonnell-citizenship.html"
  },
  {
    "text": "Trump threatens to revoke US citizenship of longtime critic Rosie O'Donnell … The White House declined to comment on whether Trump was serious about the threat, or how he would revoke the American actor's citizenship — a move for which there is no clear legal precedent.",
    "url": "https://www.politico.com/news/2025/07/12/trump-revoke-citizenship-rosie-odonnell-00449920"
  },
  {
    "text": "Trump Thinks He Can Take Away Citizenship From Anyone He Doesn't Like  —  The president is now musing about trying to revoke Rosie O'Donnell's birthright citizenship because he doesn't like her  —  Since the first day of his second term, President Donald Trump has been trying … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-us-citizenship-rosie-o-donnell-zohran-mamdani-1235384436/"
  },
  {
    "text": "Trump Pleads With Followers to Back Bondi in Dispute Over Epstein Inquiry  —  In a long social media post, President Trump said that Attorney General Pam Bondi was doing a “FANTASTIC JOB,” and told his followers to “not waste Time and Energy” on the Jeffrey Epstein case.",
    "url": "https://www.nytimes.com/2025/07/12/us/politics/trump-bondi-epstein-bongino.html?unlocked_article_code=1.WE8.RFDy.jjKymSGwUuDS&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump posts support for embattled Attorney General Pam Bondi  —  The Attorney General was at the heart of a recent confrontation with the FBI's second in command over the DOJ's handling of the Jeffrey Epstein files.  —  President Donald Trump has come out in support of embattled Attorney … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/trump-posts-support-embattled-attorney-general-pam-bondi-rcna218481"
  },
  {
    "text": "Inside Dan Bongino's tense meeting with White House officials over Jeffrey Epstein fallout  —  Deputy Director Bongino reportedly lashed out at top Trump officials after DOJ and FBI were criticized for closing Epstein inquiry  —  FBI Deputy Director Dan Bongino was outraged this week during … ",
    "url": "https://www.foxnews.com/politics/inside-dan-bonginos-tense-meeting-white-house-officials-over-jeffrey-epstein-fallout"
  },
  {
    "text": "Tech billionaire Trump adviser Marc Andreesen says universities will ‘pay the price’ for DEI  —  The investor in a private group chat also criticized Stanford and said colleges are biased against Trump voters: “My people are furious.”  —  Influential tech investor and Trump adviser Marc Andreessen recently … ",
    "url": "https://www.washingtonpost.com/technology/2025/07/12/marc-andreessen-private-chat-universities-diversity/"
  },
  {
    "text": "Grok Chatbot Mirrored X Users' ‘Extremist Views’ in Antisemitic Posts, xAI Says  —  Elon Musk's artificial intelligence company said its Grok chatbot had also undergone a code update that caused it to share antisemitic messages this week.  —  Elon Musk's artificial intelligence company … ",
    "url": "https://www.nytimes.com/2025/07/12/technology/x-ai-grok-antisemitism.html"
  },
  {
    "text": "xAI issues lengthy apology for violent and antisemitic Grok social media posts  —  Elon Musk's artificial intelligence company xAI issued a lengthy apology Saturday for a series of violent and antisemitic posts from its Grok chatbot this week, blaming a system update.",
    "url": "https://cnn.com/2025/07/12/tech/xai-apology-antisemitic-grok-social-media-posts"
  },
  {
    "text": "ICE Set to Vastly Expand Its Reach With New Funds … Thousands of new deportation agents deployed into American cities.  A doubling of detention space to hold tens of thousands of immigrants before they are expelled.  Miles of new border wall, along with surveillance towers equipped with artificial intelligence.",
    "url": "https://www.nytimes.com/2025/07/12/us/politics/ice-expansion-concerns.html"
  },
  {
    "text": "Charges dropped against Utah doctor accused of throwing away $28,000 in COVID vaccine doses  —  The federal government on Saturday dismissed charges against a Utah plastic surgeon accused of throwing away COVID-19 vaccines, giving children saline shots instead of the vaccine and selling faked vaccination cards.",
    "url": "https://apnews.com/article/utah-doctor-covid-fraud-charges-dropped-41927573624f0e8e2ee08822633ca5de"
  },
  {
    "text": "Justice Department purge continues, firings include Trump classified document case investigators and Jan. 6 prosecutors  —  The ongoing purge of Justice Department officials who investigated President Trump and his allies continued this week, with the Justice Department firing more than 20 employees … ",
    "url": "https://www.cbsnews.com/news/justice-department-firings-include-trump-investigators-jan-6-prosecutors/"
  },
  {
    "text": "Texas Court Seals Records in Ken Paxton's Divorce Case  —  The order meant details in the case, which involves allegations of adultery, would not be public as the Texas attorney general challenges Senator John Cornyn in the 2026 primary.  —  A state court on Friday ordered records in the divorce … ",
    "url": "https://www.nytimes.com/2025/07/12/us/texas-ag-paxton-divorce-records.html"
  },
  {
    "text": "Senate GOP faces ‘gut check time’ on axing global HIV program  —  Senate Republicans remain wary of eliminating the popular and successful global HIV/AIDS program PEPFAR, as they face down a July 18 deadline to vote on President Trump's first tranche of rescissions requests.",
    "url": "https://thehill.com/policy/healthcare/5397689-pepfar-funding-debate-republicans/"
  },
  {
    "text": "A year after Trump's near-assassination, friends and allies see some signs of a changed man  —  President Donald Trump was on stage at the Iowa State Fairgrounds earlier this month, kicking off the country's 250th anniversary celebration, when he heard what sounded like fireworks in the distance.",
    "url": "https://apnews.com/article/trump-butler-anniversary-assassination-0ef1ccff5da47f795e6d5c3a47e7f9cf"
  },
  {
    "text": "Gavin Newsom Rages At ‘Fascist Cuck’ Stephen Miller Through Spox Over Trump-Blocking Court Order In Late-Night Victory Dance  —  Governor Gavin Newsom (D-CA) raged through a spokesperson at White House Deputy Chief of Staff for Policy Stephen Miller over a new ruling blocking Trump deportation forces … ",
    "url": "https://www.mediaite.com/media/news/gavin-newsom-rages-at-fascist-cuck-stephen-miller-over-trump-blocking-court-order-in-late-night-victory-dance/"
  }
]