[
  {
    "text": "Harris is in much better shape than Biden.  But she has one big problem.  —  It's the Electoral College.  —  ∙ Paid  —  The Silver Bulletin presidential election forecast model relaunched today, and there's some good news for Democrats: Kamala Harris is in a considerably better position … ",
    "url": "https://www.natesilver.net/p/harris-trump-electoral-college"
  },
  {
    "text": "Whoa: Trump Hits 52% in New Harvard/Harris Poll  —  Say, whose honeymoon is this, anyway?  Supposedly, Kamala Harris has “totally upended” the race with The Anointment and the media's rush to proclaim the advent of “Kamalot.”  Also, Donald Trump only has a ceiling in the mid-40s … ",
    "url": "https://hotair.com/ed-morrissey/2024/07/30/whoa-trump-hits-52-in-new-harvardharris-poll-n3792463"
  },
  {
    "text": "Harris takes 4-point lead in Pennsylvania; Casey up 5 on McCormick: poll  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/campaign/4800420-harris-lead-pennsylvania-casey-mccormick-poll/"
  },
  {
    "text": "Kamala Harris Wipes Out Trump's Swing-State Lead in Election Dead Heat  —  The vice president is polling better than Biden was before he dropped out, according to the latest Bloomberg News/Morning Consult survey.  —  Kamala Harris has wiped out Donald Trump's lead across seven battleground states … ",
    "url": "https://www.bloomberg.com/news/features/2024-07-30/kamala-harris-erases-trump-s-swing-state-lead-in-2024-election-poll"
  },
  {
    "text": "It's not just ‘cat ladies’: JD Vance has a history of disparaging people without kids  —  Republican vice presidential nominee Sen. JD Vance has a history of making disparaging remarks toward people without children, a CNN KFile review of his comments shows, including fundraising off his now-infamous … ",
    "url": "https://www.cnn.com/2024/07/30/politics/kfile-jd-vance-history-disparaging-people-without-kids/"
  },
  {
    "text": "Murkowski slams Vance's ‘childless cat lady’ comments as ‘offensive’ to women  —  Sen. Lisa Murkowski (R-Alaska) hit her party's own vice presidential nominee, Sen. JD Vance (R-Ohio), for what she called “offensive” comments about “childless cat ladies.”  “If the Republican Party is trying … ",
    "url": "https://www.politico.com/live-updates/2024/07/30/congress/murkowski-critical-vance-cat-lady-trump-republicans-senate-00171864"
  },
  {
    "text": "Project 2025 to end policy work after Democratic attacks angered Trump  —  The Trump campaign grew furious with the Heritage Foundation over press coverage tying the candidate to unpopular policy proposals  —  The right-wing policy operation that became a rallying cry for Democrats … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/30/project-2025-director-paul-dans-leaves-heritage-foundation/"
  },
  {
    "text": "Head of Project 2025 Steps Down Following Trump Criticism  —  The group had set an agenda for a second Trump term but was criticized by the former president  —  WASHINGTON—The Heritage Foundation official who leads Project 2025, the conservative roadmap for the next Republican administration … ",
    "url": "https://www.wsj.com/politics/elections/project-2025-head-steps-down-89cba52b?st=p4sjndltdejmfeh"
  },
  {
    "text": "Project 2025 director leaves Heritage Foundation after Democratic attacks and Trump criticism  —  The director of the Heritage Foundation's Project 2025 vision for a complete overhaul of the federal government stepped down Tuesday after facing pressure from Donald Trump's campaign … ",
    "url": "https://apnews.com/article/project-2025-heritage-foundation-trump-e2674ea34da786d85e97c0908b0b98a8"
  },
  {
    "text": "‘White Dudes for Harris’ X Suspension Sparks Fury: ‘Election Interference’  —  A social-media account for white male supporters of  —  was briefly suspended from X, formerly  —  , sparking anger online.  —  Newsweek observed that the White Dudes for Harris X account had been temporarily suspended … ",
    "url": "https://www.newsweek.com/white-dudes-harris-x-suspension-1931827"
  },
  {
    "text": "Twitter Suspends ‘White Dudes For Harris’ Account After $4 Million Fundraising Call  —  The video call, which featured celebs like Jeff Bridges and Josh Groban, attracted nearly 200,000 supporters of Kamala Harris' presidential campaign.  —  LOADING  —  The social platform X, formerly Twitter … ",
    "url": "https://www.huffpost.com/entry/x-suspends-white-dudes-harris-account_n_66a8f206e4b0a3cd43f73fe1"
  },
  {
    "text": "Norah O'Donnell to leave “CBS Evening News” anchor desk after 2024 election for new role at network  —  “CBS Evening News” anchor and managing editor Norah O'Donnell has announced that she will leave her role at the anchor desk after the 2024 election and take on a new position at the network.",
    "url": "https://www.cbsnews.com/news/norah-odonnell-to-leave-cbs-evening-news-anchor-desk-new-role-at-network/"
  },
  {
    "text": "Biden adviser Anita Dunn leaving White House to help pro-Harris super PAC  —  Her departure marks the first change to the White House senior team after the president bowed out of his reelection effort.  —  Anita Dunn, a top adviser to President Biden and architect of his 2020 campaign … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/30/anita-dunn-biden-harris-2024/"
  },
  {
    "text": "Exclusive: Harris and her VP pick will tour battleground states next week - sources  —  Vice President Kamala Harris will tour battleground states next week with her vice presidential candidate, two sources familiar with the planning said on Tuesday, a signal the selection process for her running mate is coming to a close.",
    "url": "https://www.reuters.com/world/us/harris-her-vp-pick-will-tour-battleground-states-next-week-sources-2024-07-30/"
  },
  {
    "text": "Lara Trump Compares Harris to a Fashion Designer's Faux ‘Trash Bag’  —  It was the latest in a series of vicious personal attacks Republicans have lobbed at the vice president since Democrats coalesced around her as their presidential nominee.  —  Lara Trump, the Republican Party co-chair … ",
    "url": "https://www.nytimes.com/2024/07/30/us/politics/lara-trump-kamala-harris-trash-bag.html"
  },
  {
    "text": "Democracy Will Suffer a Relatively Quiet Death.  We Simulated It.  —  PICTURE THIS: It's March 2025, and Donald Trump is back in the White House.  Despite the burst of euphoria that followed Joe Biden's withdrawal from the presidential race, Trump managed to eke out a narrow Electoral College victory.",
    "url": "https://www.thebulwark.com/p/democracy-suffer-quiet-death-simulated-trump"
  },
  {
    "text": "Black Journalists' Association Says Yes to Trump, No to Kamala Harris  —  ‘AN AFFRONT’  —  NABJ bosses declined Harris' request to speak at the convention virtually because of logistical matters, while members are outraged that Trump will appear at the Chicago event.",
    "url": "https://www.thedailybeast.com/nabj-co-chair-karen-attiah-steps-down-after-trump-accepts-convention-invite"
  },
  {
    "text": "Exclusive: The inside story of John Roberts and Trump's immunity win at the Supreme Court  —  The Supreme Court's toughest cases during Chief Justice John Roberts' tenure have often generated internal suspense, with shifting votes, last-minute switches and the chief's own push toward compromises … ",
    "url": "https://www.cnn.com/2024/07/30/politics/supreme-court-john-roberts-trump-immunity-6-3-biskupic/"
  },
  {
    "text": "Trump Media Quietly Enters Deal With a Republican Donor Who Could Benefit From a Second Trump Administration  —  This month, former President Donald Trump's media company announced it was making its first major purchase: technology to help stream TV on Truth Social, its Twitter-like platform.",
    "url": "https://www.propublica.org/article/trump-media-truth-social-jedtec-james-davison-conflict-of-interest"
  },
  {
    "text": "Tim Walz has friends in Congress.  They say his political chops could help Harris as VP.  —  The Minnesota governor, 60, isn't well-known nationally but his relationships in Congress and history of winning a tough midwestern district could appeal to the Harris campaign.",
    "url": "https://www.nbcnews.com/politics/2024-election/tim-walz-kamala-harris-vice-president-pick-congress-rcna164349"
  },
  {
    "text": "Maddow points out frightening truth about Trump's lack of concern about votes  —  Rachel Maddow rounds up instances in which Donald Trump not only assures his supporters that if he is elected they won't have to vote in the future, but also that even for this 2024 election he does not need votes.",
    "url": "https://www.msnbc.com/rachel-maddow/watch/maddow-points-out-frightening-truth-about-trump-s-lack-of-concern-about-votes-215958085917"
  }
]