[
  {
    "text": "4 senior campaign officials for Mark Robinson step down in wake of CNN report  —  Four top operatives on Mark Robinson's campaign for North Carolina governor have stepped down, the campaign announced on Sunday.  —  General consultant and senior advisor Conrad Pogorzelski III … ",
    "url": "https://www.cnn.com/2024/09/22/politics/mark-robinson-campaign-resignations"
  },
  {
    "text": "Mark Robinson's porn site scandal greeted with shrugs by some Trump backers  —  The revelations surrounding the N.C. gubernatorial candidate mark a test of voters' tolerance for disturbing allegations in the Trump era.  —  WILMINGTON, N.C. — The scandal engulfing Mark Robinson's campaign … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/22/mark-robinson-trump-cnn-porn-site-reaction/"
  },
  {
    "text": "Poll: Newly popular Harris builds momentum, challenging Trump for the mantle of change  —  The latest NBC News national poll shows Harris leading Trump 49%-44%, within the margin of error, while Trump holds advantages on the economy, inflation and the border.",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-newly-popular-harris-challenging-trump-change-rcna171308"
  },
  {
    "text": "Harris shows some gains and economic views brighten a bit — CBS News poll  —  The 2024 presidential race clearly remains a contest either Donald Trump or Kamala Harris can win, CBS News' latest polling finds.  —  But with interest rates and gas prices coming down, the number of voters saying the economy is good has ticked up.",
    "url": "https://www.cbsnews.com/news/trump-harris-poll-debate-economy-09-22-2024/"
  },
  {
    "text": "Trump says he doesn't see himself running in 2028 if he loses in November … I think ... that will be it.  I don't see that at all,\" the GOP nominee said on “Full Measure” with Sharyl Attkisson when asked whether he saw himself running again in four years if he's unsuccessful in 2024.",
    "url": "https://www.axios.com/2024/09/22/trump-2028-presidential-election"
  },
  {
    "text": "Trump says he will not run again if he loses in November, ‘that will be it’  —  Republican Donald Trump said that he will not make a fourth consecutive run for the U.S. presidency if he loses the Nov. 5 election, saying “that will be it” in an interview released on Sunday.",
    "url": "https://www.reuters.com/world/us/trump-says-he-will-not-run-again-if-he-loses-november-that-will-be-it-2024-09-22/"
  },
  {
    "text": "Trump Will Stage an Emergency to Ban Jack Smith's Book Report  —  I expect, on top of everything else this week, Trump's lawyers are going to claim an emergency to try to ban Jack Smith's book report, currently due Thursday.  —  As you'll recall, after Judge Tanya Chutkan finally got … ",
    "url": "https://www.emptywheel.net/2024/09/22/trump-will-stage-an-emergency-to-ban-jack-smiths-book-report/"
  },
  {
    "text": "Janet Jackson Apologizes for Kamala Harris ‘Confusion’  —  WHOOPS NOW  —  “She deeply respects Vice President Kamala Harris and her accomplishments as a Black and Indian woman,” a spokesperson for Jackson said.  —  Singer Janet Jackson apologized through a representative … ",
    "url": "https://www.thedailybeast.com/janet-jackson-apologizes-for-kamala-harris-confusion"
  },
  {
    "text": "Janet Jackson Apologizes to Kamala Harris, Blames ‘Misinformation’ for Comments  —  “Janet apologizes for any confusion caused and acknowledges the importance of accurate representation in public discourse,” Jackson's manager says after singer questioned if Harris was black",
    "url": "https://www.rollingstone.com/music/music-news/janet-jackson-apologizes-kamala-harris-blames-misinformation-1235108908/"
  },
  {
    "text": "Johnson rolls out plan B to avert government shutdown  —  House GOP leaders on Sunday unveiled a plan to keep the government funded for three months after Speaker Mike Johnson's (R-La.) opening gambit to avoid a shutdown failed due to opposition from Republicans.",
    "url": "https://thehill.com/homenews/house/4892931-government-funding-continuing-resolution-deal-mike-johnson/"
  },
  {
    "text": "As Taliban starts restricting men, too, some regret not speaking up sooner  —  Beside imposing severe rules on women, new laws require men to grow fist-length beards and bar them from imitating non-Muslims in appearance or behavior.  —  As the Taliban starts enforcing draconian new rules … ",
    "url": "https://www.washingtonpost.com/world/2024/09/22/afghanistan-taliban-restrictions-men-beards/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2OTc3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4MzU5OTk5LCJpYXQiOjE3MjY5Nzc2MDAsImp0aSI6ImViZTdkYWQ5LTRmZTUtNDcyOS04YWNhLTcwMGIyNjNjNGRiMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI0LzA5LzIyL2FmZ2hhbmlzdGFuLXRhbGliYW4tcmVzdHJpY3Rpb25zLW1lbi1iZWFyZHMvIn0.CmVe9z_W0yAMj6rAkx2u1DPFXJ0b3N4Cg0WQk0XB5pU&itid=gfta"
  },
  {
    "text": "Hezbollah hits back with rockets as it declares an ‘open-ended battle’ with Israel  —  Hezbollah fired over 100 rockets early Sunday across northern Israel, with some landing near the city of Haifa, as Israel launched hundreds of strikes on Lebanon.  A Hezbollah leader declared an … ",
    "url": "https://apnews.com/article/israel-lebanon-hezbollah-news-09-22-2024-fb1aa8ae061885ba86855f7fe9ec5be7"
  },
  {
    "text": "Over 700 high-ranking national security officials endorse Harris  —  Over 700 high-ranking national security officials have endorsed Democratic candidate Vice President Harris in her run for the White House, with some leaders expressing concerns about former President Trump's “scary authoritarian streak.”",
    "url": "https://thehill.com/homenews/4892381-national-security-officials-endorse-harris/"
  },
  {
    "text": "‘I hate Trump, she likes him - we both think he staged assassination attempts’  —  Wild Mother - the online alias of a woman called Desirée - lives in the mountains of Colorado, where she posts videos to 80,000 followers about holistic wellness and bringing up her little girl.",
    "url": "https://www.bbc.com/news/articles/cvglm0rjy2go"
  },
  {
    "text": "New York City's interim police commissioner says federal authorities seized materials from his homes  —  Federal authorities searched the homes of New York City's newly named interim police commissioner and seized materials unrelated to his police work, he said.",
    "url": "https://apnews.com/article/nypd-commissioner-donlon-searched-e5aafbff1ab6425788a7539cbc55221e"
  }
]