[
  {
    "text": "Trump allies prepare to infuse ‘Christian nationalism’ in second administration  —  Spearheading the effort is Russell Vought, president of The Center for Renewing America, part of a conservative consortium preparing for Trump's return to power.  —  Russell Vought is president of The Center … ",
    "url": "https://www.politico.com/news/2024/02/20/donald-trump-allies-christian-nationalism-00142086"
  },
  {
    "text": "Trump's Final Hours in Office Were Consumed With Fury at Snoop Dogg  —  Trump's rage at Snoop Dogg created “chaos” in his administration's last moments — and nearly killed clemency for Harry-O … The source of the then-outgoing president's anger had nothing to do with his failed attempts … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trumps-snoop-dogg-pardon-final-hours-president-1234969914/"
  },
  {
    "text": "She's not quitting.  Takeaways from Nikki Haley's push to stay in the GOP contest against Trump  —  KIAWAH ISLAND, S.C. (AP) — Nikki Haley's team is bracing for a home state embarrassment in South Carolina's Republican presidential primary on Saturday.  Conventional wisdom suggests she'll be forced to drop out.",
    "url": "https://apnews.com/article/nikki-haley-president-trump-interview-takeaways-b1eeeab91bd644d39ae575200592ceb2"
  },
  {
    "text": "Trump's RNC Takeover Is on the Brink of Becoming a ‘Purge’  —  From top to bottom, the national GOP organization could soon be rid of anyone seen as insufficiently MAGA.  —  First came the internal grumbling about Ronna McDaniel, the chairwoman of the Republican National Committee.",
    "url": "https://www.thedailybeast.com/trumps-rnc-takeover-is-on-the-brink-of-becoming-a-purge"
  },
  {
    "text": "Home sweet home?  Donald Trump trounces Nikki Haley in exclusive South Carolina poll  —  Donald Trump is poised to trounce Nikki Haley Saturday in her home state of South Carolina, an exclusive Suffolk University/USA TODAY poll finds, with a yawning advantage that hasn't been diminished … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/20/exclusive-poll-donald-trump-nikki-haley-south-carolina/72656833007/"
  },
  {
    "text": "Nikki Haley hasn't yet won a GOP contest.  But she's vowing to keep fighting Donald Trump  —  There are no wins on the horizon for Nikki Haley.  Those close to the former United Nations ambassador, the last major Republican candidate standing in Donald Trump's path to the GOP's 2024 presidential nomination … ",
    "url": "https://apnews.com/article/nikki-haley-donald-trump-election-2024-b1582a35c3617eee49b36288523a1ea6"
  },
  {
    "text": "US to announce ‘major sanctions package’ on Russia following Navalny death  —  The sanctions will “hold Russia accountable for what happened to Mr. Navalny,” the National Security Council spokesperson said.  —  The Biden administration will unveil a “major sanctions package” … ",
    "url": "https://www.politico.com/news/2024/02/20/russia-sanctions-navalny-putin-00142183"
  },
  {
    "text": "Trump fraud ruling adds to his string of legal losses in New York  —  Donald Trump's latest legal defeat in a New York court — a jaw-dropping $354 million judgment to claw back the proceeds of a decade of fraud, plus almost $100 million in interest — puts an exclamation point on an unprecedented losing streak in his home state.",
    "url": "https://www.cbsnews.com/news/trump-fraud-ruling-new-york-legal-losses/"
  },
  {
    "text": "'You're both traitors': Speaker Johnson's thumbs-up photo-op with Trump doesn't go well  —  House Speaker Mike Johnson made his pilgrimage to Mar-a-Lago for a photo-op with former President Donald Trump — but when he took it X Monday, it didn't get the kind of reception he'd hoped.",
    "url": "https://www.rawstory.com/trump-johnson-2667318263/"
  },
  {
    "text": "Oops!  DeSantis says book challenges have gone too far  —  In an extraordinary press conference last week, Florida Governor Ron DeSantis (R) acknowledged that challenges to books in the state's school libraries are out of control.  Over the course of the event, DeSantis blamed teachers … ",
    "url": "https://popular.info/p/oops-desantis-says-book-challenges"
  },
  {
    "text": "Supreme Court turns away House GOP lawmakers' appeal over mask rule violations  —  The Supreme Court on Tuesday refused to revive a lawsuit from three House Republicans after their pay was docked for not complying with a pandemic-era mask requirement on the chamber floor.",
    "url": "https://thehill.com/homenews/house/4478298-supreme-court-turns-away-house-gop-lawmakers-appeal-over-mask-rule-violations/"
  },
  {
    "text": "Kari Lake can't say who ‘stole’ her election, says criticism of McCain was meant as a joke  —  In a radio interview, Lake also said she wouldn't support a federal abortion ban and characterized Ukraine's war against Russia as a lost cause.  —  A defensive Kari Lake acknowledged … ",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/02/20/kari-lake-news-senate-candidate-talks-elections-ukraine-and-abortion/72665895007/"
  },
  {
    "text": "Frozen embryos are children, Ala. high court says in unprecedented ruling  —  The Alabama Supreme Court ruled Friday that frozen embryos are people and someone can be held liable for destroying them, a decision that reproductive rights advocates say could imperil in vitro fertilization (IVF) … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/19/alabama-supreme-court-embryos-children-ivf/"
  },
  {
    "text": "Supreme Court won't review admissions at Va.'s Thomas Jefferson HS  —  The Supreme Court will not review a challenge to the admissions system for a prestigious Northern Virginia magnet school, the Thomas Jefferson High School for Science and Technology, which administrators said opened … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/20/supreme-court-affirmative-action-thomas-jefferson-high-school/"
  },
  {
    "text": "Biden campaign touts $42M raised in January  —  The Democratic president and DNC ended January with $130 million cash on hand.  —  President Joe Biden's political operation said it raised $42 million in January, continuing to amass cash as he gears up for a likely rematch with former President Donald Trump.",
    "url": "https://www.politico.com/news/2024/02/20/biden-campaign-fundraising-00142130"
  },
  {
    "text": "Supreme Court declines to undo sanctions on pro-Trump 2020 campaign lawyers  —  The Supreme Court on Tuesday declined to undo sanctions against several lawyers allied with former President Trump for filing a meritless lawsuit challenging Michigan's 2020 presidential election results.",
    "url": "https://thehill.com/regulation/court-battles/4478279-supreme-court-sanctions-pro-trump-2020-campaign-lawyers/"
  },
  {
    "text": "Eric Hovde launches Wisconsin Senate bid, handing GOP a boost  —  Republican Eric Hovde made his campaign to take on Sen. Tammy Baldwin (D-Wis.) official on Tuesday, handing the GOP one of the final pieces to their 2024 map puzzle in a key battleground state.",
    "url": "https://thehill.com/homenews/campaign/4478760-eric-hovde-wisconsin-senate-gop/"
  },
  {
    "text": "Ex-GOP Lawmaker Sums Up Current Republican Platform With 2 Stinging Words  —  David Jolly also named and shamed the Republican lawmakers who “faceplant on the knee of Donald Trump.”  —  LOADING  —  Former Rep. David Jolly (R-Fla.) on Monday offered a critical take on the GOP's shift in stance on Russia.",
    "url": "https://www.huffpost.com/entry/david-jolly-republicans-follow-trump_n_65d483bfe4b0f7fbe7b4017b"
  },
  {
    "text": "DNC intervenes in GOP effort to nullify Arizona election manual  —  Democrats are challenging a Republican effort to nullify the manual used to oversee Arizona election rules and results.  —  The Democratic National Committee is looking to jump into a pair of Arizona election lawsuits Tuesday morning … ",
    "url": "https://www.politico.com/news/2024/02/20/dnc-challenge-rnc-arizona-election-manual-00142156"
  },
  {
    "text": "US proposes a ‘temporary ceasefire’ in Gaza in draft UN resolution  —  New York CNN  —  The United States has proposed a United Nations Security Council draft resolution on Gaza calling for a temporary ceasefire in Israel's war against Hamas and warning against an Israeli ground incursion into Rafah … ",
    "url": "https://www.cnn.com/2024/02/19/politics/us-un-security-council-temporary-ceasefire-draft-intl/"
  }
]