[
  {
    "text": "Trump crowd goes silent as he confuses Biden and Obama again  —  'Putin has so little respect for Obama that he's starting to throw around the nuclear word,' Trump says  —  The crowd of Trump supporters gathered in Richmond, Virginia to hear Donald Trump speak on Saturday night went silent … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-biden-obama-b2506194.html"
  },
  {
    "text": "CBS News poll finds voters remember Trump's economy as good, boosting Trump to national lead over Biden today  —  As Super Tuesday makes an historic rematch all but official, voters are comparing not just two presidents, but two presidencies.  —  And right now former President Donald Trump emerges … ",
    "url": "https://www.cbsnews.com/news/poll-trump-leads-biden-economy/"
  },
  {
    "text": "Haley wins DC GOP primary  —  Nikki Haley will win the Washington, D.C., Republican presidential primary, netting her first victory of the GOP nominating process, Decision Desk HQ projects.  —  Haley garnered 1,274 votes to former President Trump's 676 with all precincts reporting, according to DDHQ.",
    "url": "https://thehill.com/homenews/campaign/4503364-haley-takes-the-victory-in-dc-gop-primary/"
  },
  {
    "text": "Nikki Haley wins D.C. primary, her first victory in GOP nominating race  —  Former South Carolina Gov. Nikki Haley won her first contest in the Republican presidential nomination race on Sunday after triumphing in Washington, D.C.'s primary.  It won't likely change the contest's trajectory.",
    "url": "https://www.washingtonpost.com/politics/2024/03/03/gop-primary-dc/"
  },
  {
    "text": "A Supreme Court decision could come Monday in a case about barring Trump from the 2024 ballot  —  A Supreme Court decision could come as soon as Monday in the case about whether former President Donald Trump can be kicked off the ballot over his efforts to undo his defeat in the 2020 election.",
    "url": "https://apnews.com/article/supreme-court-trump-capitol-riot-colorado-maine-d784759ab9376d4c3a6e3ae72465f448"
  },
  {
    "text": "Kamala Harris says there must be an ‘immediate ceasefire’ in Gaza  —  Vice president says pause in fighting ‘for at least six weeks’ needed to save hostages, ensure aid for besieged civilians  —  Kamala Harris demands ‘immediate ceasefire’ in Gaza: ‘The condition is inhumane’",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/kamala-harris-ceasefire-gaza-b2506271.html"
  },
  {
    "text": "Trump's White House Was ‘Awash in Speed’ — and Xanax  —  Under Trump, the White House Medical Unit was “like the Wild West,” and staffers had easy access to powerful stimulants and sedatives, sources tell Rolling Stone  —  IF YOU EVER looked at the actions of the Trump White House and wondered, ‘Are they on drugs?’",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-white-house-drugs-speed-xanax-1234979503/"
  },
  {
    "text": "‘Five-alarm fire’: Trump's latest public schools threat causes experts to panic  —  Donald Trump said something about public schools that got no media coverage, yet it's causing political analysts, ex-prosecutors, and other onlookers to sound the alarm.  —  Trump began hinting last year that … ",
    "url": "https://www.rawstory.com/trump-public-school-threat-vaccines/"
  },
  {
    "text": "AG Garland pledges to fight voter ID laws, election integrity measures  —  Garland appeared in Selma, Alabama Sunday alongside Vice President to mark the 59th anniversary of Blood Sunday  —  Attorney General Merrick Garland appeared alongside Vice President Kamala Harris in Selma … ",
    "url": "https://www.foxnews.com/politics/ag-garland-pledges-fight-voter-id-laws-election-integrity-measures"
  },
  {
    "text": "The apocalypse we choose  —  In four months as Speaker of the House, Mike Johnson has given Russia a chance to win its war in Ukraine, and thereby turn the world towards tyranny.  —  Subscribe now  —  Johnson's term of office consists of stratagems to avoid funding Ukraine.",
    "url": "https://snyder.substack.com/p/the-apocalypse-we-choose"
  },
  {
    "text": "Kari Lake Switches Her Abortion Stance Ahead of Arizona Senate Contest  —  ‘ANYTHING TO GET ELECTED’  —  Kari Lake has appeared to soften her stance on abortion on Saturday, walking back past praise for aggressive restrictions in a move that reflected how much of a poisoned arrow the issue has become for the Republican Party.",
    "url": "https://www.thedailybeast.com/kari-lake-switches-up-abortion-stance-ahead-of-arizona-senate-contest"
  },
  {
    "text": "Florida is swamped by disease outbreaks as quackery replaces science  —  The state is in the grip of a measles outbreak, yet Joseph Ladapo, the surgeon general, continues to ignore medical science to stop it  —  Shortly before Joseph Ladapo was sworn in as Florida's surgeon general in 2022 … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/03/florida-measles-outbreak-preventable"
  },
  {
    "text": "Mitch McConnell is the arsonist who set America on fire and ran away  —  The lyrics to Kenny Rogers' “The Gambler” are branded onto my brain.  In the summer of 1979, I was a 20-year-old so eager to break into journalism I took a job at a tiny paper in Peoria, Ill., and lived there with my grandparents.",
    "url": "https://www.inquirer.com/opinion/commentary/mitch-mcconnell-destroyed-america-runs-away-20240303.html"
  },
  {
    "text": "The anti-abortion playbook for restricting birth control  —  Contraception, like IVF, poses problems for those claiming personhood begins at conception.  —  The national debate over IVF, unfolding after an Alabama court decision prompted multiple clinics in the state to halt operations, prompts a question: What might be next?",
    "url": "https://www.vox.com/24087411/anti-abortion-roe-dobbs-birth-control-contraception-ivf"
  }
]