[
  {
    "text": "Trump vows a peaceful transfer of power if reelected  —  Trump insisted that he peacefully turned over power to Biden in 2021, though he's been indicted for his role in trying to overturn the results of the 2020 election.  —  If reelected president in 2024, Donald Trump vowed Friday … ",
    "url": "https://www.politico.com/news/2023/12/22/trump-biden-reelection-2020-00133089"
  },
  {
    "text": "Supreme Court Won't Hear Case on Trump's Immunity Defense for Now  —  Jack Smith, the special counsel prosecuting former President Donald J. Trump, had urged the justices to move with extraordinary speed, bypassing a federal appeals court.  —  The Supreme Court declined on Friday to decide … ",
    "url": "https://www.nytimes.com/2023/12/22/us/politics/trump-supreme-court-immunity.html"
  },
  {
    "text": "Supreme Court sidesteps decision on Trump presidential immunity claim in federal election interference case  —  Trump is claiming broad immunity for actions he took in office, including efforts to overturn the 2020 presidential election results for which he faces criminal prosecution.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-sidesteps-decision-trump-presidential-immunity-claim-fed-rcna130769"
  },
  {
    "text": "Former President Donald Trump On President Biden, Support for Israel, The War In Ukraine, Campaign 2024, and What a Second Trump Term Would Look Like  —  Former President Trump Donald Trump joined me this morning:  —  Audio:  —  12-22hhs-trump  —  Transcript:",
    "url": "https://hughhewitt.com/former-president-donald-trump-on-president-biden-support-for-israel-the-war-in-ukraine-campaign-2024-and-what-a-second-trump-term-would-look-like"
  },
  {
    "text": "Trump hints at possible picks for Pentagon chief in a second term  —  The GOP frontrunner brought up Christopher Miller, who once said he couldn't wait to leave DOD.  —  Former President Donald Trump on Friday dropped hints about who he would pick to lead the Pentagon if he wins a second term.",
    "url": "https://www.politico.com/news/2023/12/22/trump-pentagon-second-term-00133110"
  },
  {
    "text": "I'm Michigan's Chief Election Official.  Trump's Still a Threat to Democracy, So Let's Be Prepared.  —  The new report about Trump's attempt to interfere with my state's election certification doesn't surprise me.  We must stay vigilant over the danger he'll bring in 2024.",
    "url": "https://www.thedailybeast.com/im-michigans-chief-election-official-trumps-still-a-threat-to-democracy"
  },
  {
    "text": "Trump's 2020 Bullying of Michigan Election Officials Is Blatant Authoritarianism  —  If you're still brushing off the ex-president as some kind of harmless rascal and diagnosing his critics as suffering from “derangement syndrome”—you might be the problem.",
    "url": "https://www.thedailybeast.com/trumps-2020-bullying-of-michigan-election-officials-is-blatant-authoritarianism"
  },
  {
    "text": "Wisconsin Supreme Court rules legislative maps unconstitutional, orders new boundaries for 2024 vote  —  Molly Beck Jessie OpoienMilwaukee Journal Sentinel  —  MADISON - The Wisconsin Supreme Court on Friday ordered the Republican-controlled state Legislature to draw new legislative boundaries ahead … ",
    "url": "https://www.jsonline.com/story/news/politics/2023/12/22/wisconsin-supreme-court-rules-legislative-maps-unconstitutional/72010456007/"
  },
  {
    "text": "Trump asking allies about possibility of Nikki Haley for vice president  —  Former President Donald Trump has been asking allies and advisers for their thoughts about Nikki Haley as a potential vice presidential candidate, two sources familiar with the conversations tell CBS News.",
    "url": "https://www.cbsnews.com/news/trump-nikki-haley-vice-president-possiblity/"
  },
  {
    "text": "Joe Rogan Corrected On-Air for Blaming Trump Gaffe on Biden  —  The podcaster was caught off guard by a live fact-check from his own team that revealed it was Trump—not Biden—who made the gaffe in question.  —  Joe Rogan has done it again.  But this time, even his own producers couldn't help … ",
    "url": "https://www.thedailybeast.com/joe-rogan-corrected-on-air-for-blaming-trump-gaffe-on-biden"
  },
  {
    "text": "Ron DeSantis' super PAC cancels remaining ad reservations as another group aims to fills the void  —  Never Back Down, which has been the main outside group backing DeSantis, will focus on its field operation, while Fight Right will handle TV ad spending.  —  Never Back Down … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-super-pac-cancels-remaining-2024-ad-reservations-rcna130941"
  },
  {
    "text": "Statement from President Joe Biden on Gad Haggai  —  Jill and I are heartbroken by the news that American Gad Haggai is now believed to have been killed by Hamas on October 7.  We continue to pray for the well-being and safe return of his wife, Judy.  Their daughter joined by phone my meeting with the families of hostages last week.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/22/statement-from-president-joe-biden-on-gad-haggai/"
  },
  {
    "text": "Statement from President Joe Biden on H.R. 2670, National Defense Authorization Act for Fiscal Year 2024  —  Today, I have signed into law H.R. 2670, the “National Defense Authorization Act (NDAA) for Fiscal Year 2024” (the “Act\").  The Act authorizes fiscal year appropriations principally … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/22/statement-from-president-joe-biden-on-h-r-2670-national-defense-authorization-act-for-fiscal-year-2024/"
  },
  {
    "text": "Police have recovered second Ziegler sex video, sources say  —  A  sex video involving Sarasota School Board member Bridget Ziegler and an unidentified woman has been recovered by police as part of the ongoing criminal investigation of a rape allegation made against Bridget's husband … ",
    "url": "https://flcga.org/police-have-recovered-second-ziegler-sex-video-sources-say/"
  },
  {
    "text": "A Proclamation on Granting Pardon for the Offense of Simple Possession of Marijuana, Attempted Simple Possession of Marijuana, or Use of Marijuana  —       In Proclamation 10467 of October 6, 2022 (Granting Pardon for the Offense of Simple Possession of Marijuana), I exercised my authority under … ",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2023/12/22/a-proclamation-on-granting-pardon-for-the-offense-of-simple-possession-of-marijuana-attempted-simple-possession-of-marijuana-or-use-of-marijuana/"
  }
]