[
  {
    "text": "Trump's Recipe for a Shockingly Raw Power Grab  —  The former president and his allies are reportedly planning to lay siege to the rule of law.  —  Former President Donald Trump speaks at a rally on Apr. 23, 2022 in Delaware, Ohio.  Joe Maiorana/AP  —  You can't say Donald Trump didn't warn us.",
    "url": "https://www.politico.com/news/magazine/2023/11/07/mag-shafer-trump-dictator-00125767"
  },
  {
    "text": "What Trump stands to lose in his New York civil fraud trial  —  Former President Donald Trump is at risk of losing the New York real estate empire that the rest of his career was built on.  —  The big picture: Forcibly dismantling Trump's company is so unusual that no one is quite certain how it would play out.",
    "url": "https://www.axios.com/2023/11/07/trump-civil-fraud-trial-business-empire"
  },
  {
    "text": "The Art of the Bluster  —  It's election day in Ohio, Virginia, Mississippi, Pennsylvania, and Kentucky, which means that there is a restless herd of hot takes straining to be loosed on the world in about 12 hours.  Brace yourself.  —  In the meantime, we get to ponder the bizarre scene … ",
    "url": "https://plus.thebulwark.com/p/the-art-of-the-bluster"
  },
  {
    "text": "Trump's day in court paints a dark preview of the national ordeal ahead  —  The judge in Donald Trump's civil fraud trial despairingly pressed the ex-president's lawyer: “I beseech you to control him if you can.”  —  Judge Arthur Engoron's plea reflected his frustration at an incorrigible witness … ",
    "url": "https://www.cnn.com/2023/11/07/politics/trump-court-appearance-2024-election-season"
  },
  {
    "text": "Trump attorney says New York attorney general is ‘just not that bright’  —  Former President Trump's attorney Alina Habba went after New York Attorney General Letitia James on Monday, saying she's “just not that bright.”  —  James is leading the ongoing civil trial against Trump alleging … ",
    "url": "https://thehill.com/regulation/court-battles/4297060-alina-habba-hits-letitia-james-new-york-fraud-trial/"
  },
  {
    "text": "House Republicans Toil for a Spending Strategy With a Shutdown Close at Hand  —  Speaker Mike Johnson is facing many of the same challenges his predecessor did as he looks for a way to avoid a government shutdown that will be acceptable to his deeply divided conference.",
    "url": "https://www.nytimes.com/2023/11/07/us/politics/house-republicans-spending-shutdown.html"
  },
  {
    "text": "‘Morning in America’ Eludes Biden, Despite Economic Gains  —  Seeking re-election in 1984, Ronald Reagan presided over an economy similar in many ways to today's.  But he sold a message of progress and promise.  —  President Ronald Reagan rode a “Morning in America” message … ",
    "url": "https://www.nytimes.com/2023/11/07/business/economy/biden-economy.html"
  },
  {
    "text": "Mike Johnson embodies evangelicals' embattlement strategy.  It may be backfiring.  —  (RNS) — Since Rep. Mike Johnson was elected speaker of the House of Representatives, much has been written about his evangelical Christian faith and its influence on his right-wing political views.",
    "url": "https://religionnews.com/2023/11/06/mike-johnsons-embodies-evangelicals-embattlement-strategy-it-may-be-backfiring/"
  },
  {
    "text": "White House says Israel should not reoccupy Gaza, after Netanyahu remarks  —  He told ABC's David Muir Israel would oversee Gaza for “an indefinite period.”  —  Israeli Prime Minister Benjamin Netanyahu speaks with ABC News World News Tonight anchor David Muir, Nov. 6, 2023.",
    "url": "https://abcnews.go.com/Politics/white-house-israel-reoccupy-gaza-after-netanyahu-remarks/story?id=104698360"
  },
  {
    "text": "Republican Candidate Charged With Child Porn Offenses Hours Before Election  —  A Texas Republican city council candidate is facing felony child pornography charges after being arrested just hours before the elections.  —  Brad Benson, a candidate for Place #4 on the city council of Granbury … ",
    "url": "https://www.newsweek.com/texas-republican-candidate-brad-benson-charged-child-porn-offences-hours-before-election-1841474"
  },
  {
    "text": "Scoop: Biden tells Bibi 3-day fighting pause could help secure release of some hostages  —  President Biden urged Israeli Prime Minister Benjamin Netanyahu in their call on Monday to agree to a three-day pause in the fighting to allow progress in releasing some of the hostages held by Hamas in Gaza, two U.S. and Israeli officials said.",
    "url": "https://www.axios.com/2023/11/07/biden-netanayhu-gaza-hamas-ceasefire-pause-hostages"
  },
  {
    "text": "Who are the five candidates that qualified for the third GOP debate  —  Five candidates will take the stage in the next GOP presidential primary debate, excluding former President Donald Trump who is voluntarily not attending but leading all candidates in the polls.",
    "url": "https://www.nbcnews.com/now/video/who-are-the-five-candidates-that-qualified-for-the-third-gop-debate-197303877548"
  },
  {
    "text": "Sherman High School transgender student loses lead theater role over gender policy  —  SHERMAN, Texas (KXII) - A Sherman High School policy has taken a lead role away from a transgender theater student.  —  Senior, Max Hightower, has been a member of Bearcat Theater throughout high school.",
    "url": "https://www.kxii.com/2023/11/06/sherman-high-school-transgender-student-loses-lead-theater-role-over-gender-policy/"
  },
  {
    "text": "High court seems likely to allow gun bans for those under protective orders  —  The Supreme Court on Tuesday appeared inclined to uphold a federal statute that forbids people who are the subject of domestic-violence restraining orders from possessing firearms.",
    "url": "https://www.washingtonpost.com/politics/2023/11/07/supreme-court-guns-domestic-violence-rahimi/"
  },
  {
    "text": "Axelrod on Biden: I didn't tell him to drop out  —  Still, the comments from the longtime Democratic operative is the latest element of friction between the Obama-Biden camps.  —  CHICAGO — Less than a day after he suggested that Joe Biden should consider dropping out of the 2024 race … ",
    "url": "https://www.politico.com/news/2023/11/07/david-axelrod-joe-biden-2024-campaign-comments-00125784"
  },
  {
    "text": "US Army Brass: Send in the Clowns  —  Right about now, I am almost without words at the complete chaos the United States Army has devolved into.  Believe me, I'm going to find plenty of words, but it is just such a gob-smacking, indescribable, totally avoidable, epic cluster flock that I almost … ",
    "url": "https://hotair.com/tree-hugging-sister/2023/11/07/us-army-brass-send-in-the-clowns-n590598"
  },
  {
    "text": "Squad: It's Super ‘Dangerous’ to Criticize Us, You Guys  —  This is their typical modus operandi.  They say and do outrageous and even bigoted things, then instantly play the victim card to stifle pushback, insisting that their lives are endangered by the resulting criticism.",
    "url": "https://townhall.com/tipsheet/guybenson/2023/11/07/squad-its-super-dangerous-to-criticize-us-you-guys-n2630863"
  },
  {
    "text": "When Will We Have Election Results?  —  It's not unreasonable to hope for results in a timely manner on Tuesday.  —  It is, of course, impossible to predict exactly when election results will be available.  —  But in these off-year elections, with most polls closing between 7 and 8 p.m. Eastern time … ",
    "url": "https://www.nytimes.com/2023/11/07/us/politics/election-results-what-time.html"
  },
  {
    "text": "I Was Branded the ‘Central Park Karen’.  I Still Live in Hiding  —  “Slit your wrists,” strangers texted me.  —  “If anyone deserves prison rape, it's you,” people I had never met called me to say.  —  “The noble thing to do is to remove yourself from society...so please kill yourself.”",
    "url": "https://www.newsweek.com/i-was-branded-central-park-karen-i-still-live-hiding-1839483"
  }
]