[
  {
    "text": "Speaker Kevin McCarthy On The Attack On Israel And What The GOP Caucus Must Do Next  —  Speaker Kevin McCarthy joined me this morning:  —  Audio:  —  10-09hhs-mccarthy  —  Transcript:  —  HH: I'm joined by Speaker Kevin McCarthy, longtime friend of mine and of the program.  Good morning, Mr. Speaker.",
    "url": "https://hughhewitt.com/speaker-kevin-mccarthy-on-the-attack-on-israel-and-what-the-gop-caucus-must-do-next"
  },
  {
    "text": "Kevin McCarthy says he's willing to return as House speaker  —  Rep. Kevin McCarthy (R-Calif.) said Monday that he is willing to resume serving as House speaker if enough of the Republicans who voted in favor of his ouster last week are open to his reinstatement.",
    "url": "https://www.washingtonpost.com/politics/2023/10/09/house-republican-speaker/"
  },
  {
    "text": "Robert F. Kennedy Jr. to Run for President as Independent, Leaving Democratic Primary  —  The political scion told supporters he would end his campaign as a Democratic candidate and run as an independent, potentially upsetting the dynamics of the 2024 election.",
    "url": "https://www.nytimes.com/2023/10/09/us/politics/robert-f-kennedy-jr-independent.html"
  },
  {
    "text": "One of Trump's Georgia Co-Defendants Suggests She'll Be His Next White House Press Secretary  —  Trevian Kutti, a former publicist for Ye, posted: “I look forward to redeeming Black women in politics by becoming Press Secretary to the 47th President of the United States @realDonaldTrump”",
    "url": "https://themessenger.com/politics/trump-georgia-codefendant-trevian-kutti-ye-white-house-press-secretary"
  },
  {
    "text": "Team Trump Is Using ‘Fyre Festival Strategies’ in N.Y. Fraud Case  —  There's no chance of actually winning on the merits.  So Trump and his lawyers are hoping to score some PR points, kick up as much dirt as possible, enrage the judge, trash some of the witnesses, and turn the process into a media circus",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-team-new-york-fraud-case-media-circus-1234848510/"
  },
  {
    "text": "Nine Americans Killed by Hamas in Israel, US Confirms  —  The United States on Monday said nine Americans were killed in Israel and other U.S. citizens were missing, following Saturday's unprecedented Hamas attack that killed 700 Israelis.  —  “At this time, we can confirm the deaths of nine U.S. citizens … ",
    "url": "https://freebeacon.com/latest-news/nine-americans-killed-in-massive-hamas-terror-attack-on-israel-us-confirms/"
  },
  {
    "text": "9 US citizens dead in Israel conflict  —  Nine US citizens have died in the conflict in Israel, US authorities said Monday, and an unknown number remain missing.  —  “At this time, we can confirm the death of nine U.S. citizens.  We extend our deepest condolences to the victims and to the families … ",
    "url": "https://www.cnn.com/2023/10/09/politics/americans-israel-gaza/"
  },
  {
    "text": "Republicans respond to attack on Israel by demonstrating their unfitness  —  From Tim Scott to Trump, they couldn't resist smearing Biden with shameless lies. … During a Fox News hit Saturday, RNC Chair Ronna McDaniel reacted to Hamas's attack on Israel by calling it a “great opportunity” for Republican candidates.",
    "url": "https://www.publicnotice.co/p/hamas-attack-israel-republican-responses-lies"
  },
  {
    "text": "‘Rudderless and leaderless’: House GOP lurches forward after Israel attacks  —  Lawmakers appear to have three options to move legislation without a permanent speaker, but they're all problematic.  —  Hamas' deadly attack on Israel has prompted a wave of speculation about whether the House … ",
    "url": "https://www.politico.com/news/2023/10/09/rudderless-and-leaderless-house-gop-lurches-forward-after-israel-attacks-00120585"
  },
  {
    "text": "There Are No Rules  —  States and quasi-states are using extreme, uninhibited violence against civilian populations.  —  The “rules-based world order” is a system of norms and values that describe how the world ought to work, not how it actually works.  This aspirational order is rooted … ",
    "url": "https://www.theatlantic.com/international/archive/2023/10/israel-war-hamas-terrorism-ukraine-russia/675590/"
  },
  {
    "text": "Scoop: Netanyahu tells Biden “we have to go” into Gaza … “We have to go in,” the Israeli leader said, according to three Israeli and U.S. sources briefed on the call. … - “We have to go in. … - The White House and the Israeli Prime Minister's Office declined to comment.",
    "url": "https://www.axios.com/2023/10/09/netanyahu-ground-invasion-gaza-israel-hamas-biden"
  },
  {
    "text": "Top Senate Republicans seek to reprimand Willis over Trump charges  —  Georgia Senate leaders ask new state panel to launch investigation into Fulton's top prosecutor  —  Georgia Senate Republicans filed a formal complaint to punish Fulton County District Attorney Fani Willis after she sought charges … ",
    "url": "https://www.ajc.com/politics/top-senate-republicans-seek-to-reprimand-willis-over-trump-charges/2HB45YLJUNCFLODJXRHQ4USPN4/"
  },
  {
    "text": "What is the Gaza Strip?  Who controls it?  Here's what to know  —  The Hamas attack that has killed hundreds was launched from one of the most densely populated and impoverished strips of land in the world.  —  What is the Gaza Strip?  —  The Gaza Strip refers to a narrow strip … ",
    "url": "https://www.nbcnews.com/news/gaza-strip-controls-s-know-rcna119405"
  },
  {
    "text": "White House blasted for throwing barbecue as war rages in Israel  —  The White House came under criticism on Sunday for holding a barbecue with a live band while war continues to rage in Israel, with United States citizens confirmed to be among the deceased after Hamas's surprise terror attacks.",
    "url": "https://www.washingtonexaminer.com/news/white-house/bbq-criticism-war-israel"
  },
  {
    "text": "Israel steps up Gaza strikes and battles Hamas fighters as deaths near 1,200  —  Protests erupt after Israel strikes Gaza  —  Five Gazan children from same family found dead after Israeli airstrike  —  Israel increased airstrikes on the Gaza Strip and sealed it off from food, fuel … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-airstrikes-hostages-4377e096f62bf535bebcdff38cf16049"
  },
  {
    "text": "A Fake Loan Could Mean Real Trouble for George Santos  —  Representative George Santos was seemingly implicated in a fraudulent loan scheme that his treasurer admitted in her guilty plea.  —  Of all of the revelations to emerge from the federal prosecution of Representative George Santos's treasurer … ",
    "url": "https://www.nytimes.com/2023/10/09/nyregion/george-santos-nancy-marks.html"
  },
  {
    "text": "Nikki Haley Raises $11 Million, Battling With DeSantis to Take on Trump  —  The former South Carolina governor has made gains in recent months — in fund-raising and polling — that have helped her compete for the No. 2 spot in the primary field.  —  Nikki Haley, the former governor of South Carolina … ",
    "url": "https://www.nytimes.com/2023/10/09/us/politics/haley-fundraising-2024-desantis.html"
  },
  {
    "text": "Army to Congress: Do your job so we can help Israel and Ukraine  —  Urgent requests for weapons will run up against the House speaker drama and the looming shutdown.  —  The U.S. Army wants to help supply both its Ukrainian and Israeli allies with as many bombs and other equipment as they need in their separate wars.",
    "url": "https://www.politico.com/news/2023/10/09/army-congress-israel-ukraine-military-aid-00120618"
  }
]