[
  {
    "text": "Head of I.R.S. Is Ousted in Treasury's Power Struggle With Elon Musk  —  Treasury Secretary Scott Bessent complained to President Trump that the acting commissioner had been installed without his knowledge.  —  President Trump has replaced the acting commissioner of the Internal Revenue Service … ",
    "url": "https://www.nytimes.com/2025/04/18/us/politics/irs-scott-bessent-elon-musk.html?unlocked_article_code=1.Ak8.73ER.apF4cHc5pdP_&smid=url-share"
  },
  {
    "text": "Trump is replacing the acting IRS commissioner, part of a dispute between treasury and Elon Musk  —  The move comes after Treasury Secretary Scott Bessent told Trump that Gary Shapley was placed in the position without his knowledge and at Elon Musk's direction.",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-replacing-acting-irs-commissioner-rcna201907"
  },
  {
    "text": "Abrego Garcia's deportation case exposes a rift among Democrats over how to take on Trump  —  As some Democrats vocally push for the release of the man the administration says was mistakenly deported, others have sought to steer clear and focus on high prices and economic issues.",
    "url": "https://www.nbcnews.com/politics/immigration/abrego-garcias-deportation-case-exposes-rift-democrats-take-trump-rcna201723"
  },
  {
    "text": "Maryland Deportee Told Senator He Had Been in Isolation in El Salvador Prison  —  Senator Chris Van Hollen said that Kilmar Armando Abrego Garcia,who was deported and incarcerated in El Salvador, reported having been transferred after weeks in a maximum-security prison.",
    "url": "https://www.nytimes.com/2025/04/18/us/politics/abrego-garcia-chris-van-hollen-el-salvador.html?unlocked_article_code=1.Ak8.C8GQ.bqaPyFjEQ4jn&smid=url-share"
  },
  {
    "text": "THE ORIGIN  —  1.  —  The virus possesses a biological characteristic that is not found in nature.  —  2.  —  Data shows that all COVID-19 cases stem from a single introduction into humans.  This runs contrary to previous pandemics where there were multiple spillover events.  —  3.",
    "url": "https://www.whitehouse.gov/lab-leak-true-origins-of-covid-19/"
  },
  {
    "text": "‘Lab Leak,’ a flashy page on the virus' origins, replaces government COVID sites  —  The White House has taken down some government websites providing COVID-19 information and replaced them with a new boldly styled page dedicated to the controversial theory that the pandemic was caused … ",
    "url": "https://www.npr.org/sections/shots-health-news/2025/04/18/g-s1-61324/lab-leak-white-house-covid-origins"
  },
  {
    "text": "Top Trump econ adviser says White House is studying ways to fire Powell  —  President Trump's top economic adviser told reporters Friday the White House is exploring how to fire Federal Reserve Chair Jerome Powell despite the legal guardrails on his position.",
    "url": "https://thehill.com/business/5256173-trump-exploring-firing-fed-chair/"
  },
  {
    "text": "The New America: Federal (ICE) Agents Boarding Trains?  —  As an attorney I'm deeply alarmed by an incident that occurred just this week and feel compelled to share it—to raise awareness of the legal and constitutional crossroads we are rapidly approaching.",
    "url": "https://weknowwhatsup.blogspot.com/2025/04/the-new-america-federal-ice-agents.html"
  },
  {
    "text": "Immigrants prove they are alive, forcing Social Security to undo death label  —  The immigrants are among more than 6,000 who were falsely added to a deaths database by DHS and the U.S. DOGE Service in a bid to pressure them to leave the United States.  —  Immigrants falsely labeled dead … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/18/immigrants-dead-social-security-alive/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0OTQ4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MzMxMTk5LCJpYXQiOjE3NDQ5NDg4MDAsImp0aSI6IjA1NWY5NGJiLWE1M2UtNDk2MC1hMmExLTI5OTJhYWRmMDM2ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzE4L2ltbWlncmFudHMtZGVhZC1zb2NpYWwtc2VjdXJpdHktYWxpdmUvIn0.oCvuSF9ChTLwF38H1DMe2vay7BCg9D6oTSC_paYochs&itid=gfta"
  },
  {
    "text": "Trump administration may form task force to handle China tariff impact  —  Trump administration officials, anticipating supply chain strains due to steep tariffs on Chinese goods, have discussed forming a working group to deal with the problems with urgency if there's no breakthrough with Beijing, multiple sources told CBS News.",
    "url": "https://www.cbsnews.com/news/trump-administration-china-tariff-task-force/"
  },
  {
    "text": "The State Department is changing its mind about what it calls human rights  —  The Trump administration is substantially scaling back the State Department's annual reports on international human rights to remove longstanding critiques of abuses such as harsh prison conditions … ",
    "url": "https://www.npr.org/2025/04/18/nx-s1-5357511/state-department-human-rights-report-cuts"
  },
  {
    "text": "Rubio Says Trump to ‘Move On’ From Ukraine Peace Talks if No Progress Soon  —  “If it is not possible to end the war in Ukraine, we need to move on,” Secretary of State Marco Rubio said as he departed meetings in Paris.  —  The United States will abandon efforts to end the war in Ukraine … ",
    "url": "https://www.nytimes.com/2025/04/18/world/europe/rubio-ukraine-russia-war-paris.html"
  },
  {
    "text": "Trump moves to invoke Schedule F to make it easier to fire some federal workers  —  President Donald Trump has begun making one of the controversial personnel changes for government employees that was spelled out in the conservative Project 2025 blueprint for his second term.",
    "url": "https://apnews.com/article/donald-trump-civil-service-workforce-e6e4cf979b910b0f89877a9a09e7c4a4"
  },
  {
    "text": "DOGE Is Building a Master Database to Surveil and Track Immigrants  —  DOGE is knitting together data from the Department of Homeland Security, Social Security Administration, and IRS that could create a surveillance tool of unprecedented scope.  —  Operatives from Elon Musk's so-called Department … ",
    "url": "https://www.wired.com/story/doge-collecting-immigrant-data-surveil-track/"
  },
  {
    "text": "Pentagon turmoil deepens: Top Hegseth aide leaves post  —  Other Defense Department officials were placed on leave earlier this week.  —  Joe Kasper, Defense Secretary Pete Hegseth's chief of staff will leave his role in the coming days for a new position at the agency … ",
    "url": "https://www.politico.com/news/2025/04/18/defense-secretary-chief-of-staff-joe-kasper-departure-00299508"
  },
  {
    "text": "Trump Advisers Took Advantage of Navarro's Absence to Push for Tariff Pause  —  Peter Navarro, an adviser to Trump in favor of wide-ranging tariffs, had been a fixture on the president's side after ‘Liberation Day’  —  They needed to get the president alone.  —  On April 9, financial markets were going haywire.",
    "url": "https://www.wsj.com/politics/policy/trump-tariff-pause-navarro-bessent-lutnick-b9e864fb?st=44RMeA&reflink=article_copyURL_share"
  },
  {
    "text": "FSU Shooter Shows Radicalized White Men Are The Threats to College Campuses—Not Student Protestors  —  In this Teen Vogue Take, news & politics editor Lex McMenamin analyzes the April 17th Florida State University shooting and the politics of alleged gunman Phoenix Ikner, 20.",
    "url": "https://www.teenvogue.com/story/fsu-shooter-radicalized-white-man-real-threat-oped"
  },
  {
    "text": "DOGE Visits National Gallery of Art to Discuss Museum's Legal Status  —  The move is the latest from Elon Musk's unofficial cost-cutting agency to exert influence beyond traditional federal agencies.  —  Representatives from Elon Musk's Department of Government Efficiency met with leadership … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-18/washington-dc-national-gallery-of-art-gets-a-visit-from-doge"
  },
  {
    "text": "What to know about the nationwide ‘50501’ protests planned against Trump  —  Organizers say the demonstrations are expected in cities across the U.S., focused on different issues and include ‘day of action’ community service elements.  —  A national action against the Trump administration's policies … ",
    "url": "https://www.washingtonpost.com/nation/2025/04/18/50501-protests-anti-trump-movement-hands-off/"
  },
  {
    "text": "Why do Trump voters have no regrets?  Because the people they hate are getting hurt more  —  Even amid political chaos and rising prices, what matters most to his supporters is a macabre form of payback and vengeance  —  The stock market is plunging, prices are rising … ",
    "url": "https://www.theguardian.com/commentisfree/2025/apr/18/donald-trump-voters-people-hate-politics-prices"
  },
  {
    "text": "13 Trump Voters on the Highs and Lows of His Term So Far  —  “There's a lot of social media saying: Hey, are you Republicans or MAGA people regretting your vote?  And no, I'm not,” one participant told us in Opinion's latest conversation with voters in our America in Focus series.",
    "url": "https://www.nytimes.com/interactive/2025/04/18/opinion/trump-approval-focus-group.html"
  },
  {
    "text": "Why Trump's Embattled US Attorney in DC Is Talking About Russia  —  Ed Martin, the acting US attorney in Washington, who has earned some notoriety through attempts to use his office to attack political opponents of the Trump administration, recently turned his sights on Special Counsel Robert … ",
    "url": "https://www.motherjones.com/politics/2025/04/ed-martin-why-trumps-embattled-us-attorney-in-dc-is-talking-about-russia/"
  },
  {
    "text": "Judge orders halt to mass firings at Consumer Financial Protection Bureau  —  About 1,500 employees were set to be jettisoned at the bureau.  —  A security officer works inside of the Consumer Financial Protection Bureau building headquarters Monday, Feb. 10, 2025, in Washington.",
    "url": "https://abcnews.go.com/Politics/judge-orders-halt-mass-firings-consumer-financial-protection/story?id=120951391"
  },
  {
    "text": "Wisconsin governor can lock in 400-year school funding increase using a veto, court says  —  The Democratic governor of Wisconsin's creative use of his uniquely powerful veto can lock in a school funding increase for 400 years, the state Supreme Court ruled Friday.",
    "url": "https://apnews.com/article/wisconsin-400-year-veto-supreme-court-5a1be188f78ab5e4223b2c7c7ad3ca7d"
  },
  {
    "text": "For now, Pentagon and DHS won't recommend that Trump invoke the Insurrection Act  —  Defense Secretary Pete Hegseth and Homeland Security Secretary Kristi Noem will not recommend invoking the Insurrection Act in a memo the Pentagon and the Department of Homeland Security are preparing to send … ",
    "url": "https://cnn.com/2025/04/18/politics/pentagon-dhs-wont-recommend-insurrection-act/"
  },
  {
    "text": "You Cannot Appease Someone Who Intends to Destroy You  —  Last month, the law firm of Paul Weiss struck a deal with the White House, promising to donate $40 million in pro bono legal services to Trump-approved causes in order to avoid a cartoonishly unconstitutional executive order targeting the firm and its clients.",
    "url": "https://ballsandstrikes.substack.com/p/you-cannot-appease-someone-who-intends"
  },
  {
    "text": "Trump-Allied Prosecutor Sends Letters to Medical Journals Alleging Bias  —  An interim U.S. attorney is demanding information about the selection of research articles and the role of N.I.H. Experts worry this will have a chilling effect on publications.  —  A federal prosecutor has sent letters … ",
    "url": "https://www.nytimes.com/2025/04/18/health/trump-martin-us-attorney-medical-journals.html?unlocked_article_code=1.Ak8.EMaq.FgyJDGc6D7I_&smid=url-share"
  },
  {
    "text": "DHS tells US citizen and immigration advocate to leave the country … Aldo Martinez received an email April 11 from the Department of Homeland Security (DHS), telling him to leave the country or he would be removed.  It read: … “I was born in National City, California,” Martinez said.",
    "url": "https://www.nbcsandiego.com/nbc-7-responds-2/dhs-us-citizen-immigration-leave-country/3806750/"
  },
  {
    "text": "Housing Secretary Lets Staff Go Home Early For Easter To Reflect On Jesus  —  “We go into this holy weekend with freedoms that the world has never known,” reads a department-wide email from Scott Turner's chief of staff.  —  WASHINGTON - Housing and Urban Development Secretary Scott Turner told … ",
    "url": "https://www.huffpost.com/entry/hud-scott-turner-easter-us-citizens_n_67f93f90e4b060848e3e3f56"
  },
  {
    "text": "New Trump policy to speed deportations cannot be implemented, US judge rules  —  A U.S. judge on Friday barred the Trump administration from implementing a new policy allowing it to rapidly deport hundreds if not thousands of migrants to countries other than their own without giving them a chance … ",
    "url": "https://www.reuters.com/world/us/new-trump-policy-speed-deportations-cannot-be-implemented-us-judge-rules-2025-04-18/"
  },
  {
    "text": "Trump is wrapping up 100 days of historic failure  —  America has seen ruinous periods, but never when the president was the one knowingly causing the ruin.  —  By any reasonable measure, President Donald Trump's first 100 days will be judged an epic failure.  —  He has been a legislative failure.",
    "url": "https://www.washingtonpost.com/opinions/2025/04/18/trump-100-days-failure/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0OTQ4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MzMxMTk5LCJpYXQiOjE3NDQ5NDg4MDAsImp0aSI6IjU5YzE0NzczLWJlYmItNDUzZi1hOGZkLWE3ODYxNTFiYmIxYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA0LzE4L3RydW1wLTEwMC1kYXlzLWZhaWx1cmUvIn0.KRNKLRGdKtW8a0iF-_VbzPaSTFQKKiAkGMLNAZmx1zQ&itid=gfta"
  },
  {
    "text": "Travel to the U.S. from almost everywhere is falling under Trump  —  Charts show the scale of a steep drop in visitors from key countries and regions after President Donald Trump returned to office.  —  Overseas travel to the United States has declined sharply since President Donald Trump returned to office.",
    "url": "https://www.washingtonpost.com/world/2025/04/18/us-tourism-travel-trump/"
  },
  {
    "text": "Trump administration eyes elimination of program that helps low-income people heat and cool their homes  —  The Trump administration is considering support for the end of a program that helps low-income people heat and cool their homes.  —  A draft budget request document reviewed … ",
    "url": "https://thehill.com/policy/energy-environment/5255650-trump-administration-considering-low-income-home-energy-assistance-program-elimination/"
  }
]