[
  {
    "text": "‘A Day of Love’: How Trump Inverted the Violent History of Jan. 6  —  The president-elect and his allies have spent four years reinventing the Capitol attack — spreading conspiracy theories and weaving a tale of martyrdom to their ultimate political gain.  —  In two weeks, Donald J. Trump … ",
    "url": "https://www.nytimes.com/2025/01/05/us/politics/january-6-capitol-riot-trump.html?unlocked_article_code=1.m04.Bau7.PKFnFK8BJjxA"
  },
  {
    "text": "Donald Trump is about to get the Jan. 6 that he denied Joe Biden  —  Monday's certification of Trump's victory will be the antithesis of the carnage at the Capitol four years ago.  —  The transfer of power to Donald Trump is shaping up to be, well, peaceful.",
    "url": "https://www.politico.com/news/2025/01/05/trump-january-6-peaceful-00196493"
  },
  {
    "text": "Sen. Adam Schiff says the New Orleans attack shows Kash Patel shouldn't lead the FBI  —  Schiff told NBC News' “Meet the Press” that it was an “easy” decision to vote against Patel, President-elect Donald Trump's pick to lead the FBI.  —  Sen. Adam Schiff, D-Calif., said Sunday that the New Year's … ",
    "url": "https://www.nbcnews.com/politics/congress/adam-schiff-new-orleans-attack-kash-patel-fbi-rcna186284"
  },
  {
    "text": "As Trump rewrites history, victims of the Jan. 6 riot say they feel ‘betrayed’  —  For the millions of Americans who watch the presidential inauguration every four years, the Lower West Terrace Tunnel of the U.S. Capitol is a familiar site.  —  The incoming president walks through that tunnel … ",
    "url": "https://www.npr.org/2025/01/05/nx-s1-5200594/jan-6-attack-capitol-riot-victims-violence"
  },
  {
    "text": "Trump's Propaganda Victory: The Rewriting Of Jan. 6  —  You can believe your own eyes or Donald Trump's words — and many Americans are choosing to believe him.  —  WASHINGTON — It took decades for defenders of the Confederacy to rewrite the history of the Civil War to recast Southern … ",
    "url": "https://www.huffpost.com/entry/trump-jan-6-lost-cause_n_67786658e4b03c84a28dacd5"
  },
  {
    "text": "Trump Sees the U.S. as a ‘Disaster.’ The Numbers Tell a Different Story.  —  President Biden is bequeathing his successor a nation that by many measures is in good shape, even if voters remain unconvinced.  —  To hear President-elect Donald J. Trump tell it, he is about to take over a nation ravaged … ",
    "url": "https://www.nytimes.com/2025/01/05/us/politics/trump-us-disaster-numbers.html?unlocked_article_code=1.m04.2j5b.V9KE911Ep5nT&smid=url-share"
  },
  {
    "text": "No, Jeff Bezos is not “obeying in advance”  —  Ann Telnaes, a giant of the editorial cartoonist world who won the Pulitzer Prize in 2001, has resigned from The Washington Post after the paper killed a cartoon she submitted depicting Post owner Jeff Bezos (among others) negatively.  Telnaes explains:",
    "url": "https://www.findinggravity.net/p/no-jeff-bezos-is-not-obeying-in-advance"
  },
  {
    "text": "Melania Trump, Amazon partner to release new film about her life in theaters worldwide  —  The documentary will be released in the second half of 2025 and executive produced by Mrs. Trump  —  EXCLUSIVE: Amazon Prime has exclusively licensed a documentary film for global theatrical … ",
    "url": "https://www.foxnews.com/politics/melania-trump-amazon-partner-release-new-film-about-her-life-theaters-worldwide"
  },
  {
    "text": "Director Brett Ratner, marginalized after ‘#MeToo’ allegations, will direct Melania Trump documentary  —  The News  —  The director and producer Brett Ratner, forced out of Hollywood at the peak of the #MeToo movement, will direct a documentary about First Lady Melania Trump for Amazon, the studio confirmed Sunday.",
    "url": "https://www.semafor.com/article/01/05/2025/director-brett-ratner-back-from-metoo-will-direct-melania-trump-documentary"
  },
  {
    "text": "As Trump's election is certified, Americans should declare war on stupidity  —  Shame is what keeps us in check, or at least it should.  It certainly used to.  Trump, devoid of shame, has gone to great lengths to eviscerate that societal check.  —  On the eve of Donald Trump's election certification … ",
    "url": "https://www.usatoday.com/story/opinion/columnist/2025/01/05/trump-presidential-election-certification-embrace-stupidity/77409672007/"
  },
  {
    "text": "Fears grow for voting rights as Trump plots to reshape US justice department  —  Experts warn that incoming president could direct DoJ officials to scale back enforcement of Voting Rights Act  —  Donald Trump could use a second term atop the justice department to gut enforcement … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/05/trump-voting-rights-justice-department"
  },
  {
    "text": "Things Worth Remembering: ‘He Died Standing Up’  —  Jeannette Bougrab's partner was murdered at Charlie Hebdo 10 years ago—in the name of values, she said, 'that we've forgotten to defend.' … This has been a week of mourning for the families of the Americans who lost their lives to Islamism in New Orleans.",
    "url": "https://www.thefp.com/p/things-worth-remembering-he-died-standing-up-charlie-hebdo-attack"
  },
  {
    "text": "Driving into Manhattan?  That'll cost you, as new congestion toll starts Sunday  —  New York's new toll for drivers entering the center of Manhattan debuted Sunday, meaning many people will pay $9 to access the busiest part of the Big Apple during peak hours.",
    "url": "https://apnews.com/article/nyc-congestion-pricing-manhattan-traffic-5a8a6de4495d687079290918f5a499c2"
  },
  {
    "text": "Biden to deliver two major speeches in his final days in office  —  The remarks include a foreign policy speech followed by a farewell address, people familiar with the plans told NBC News.  —  President Joe Biden plans to deliver two major speeches before leaving office as part of an effort … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-deliver-two-major-speeches-final-days-office-rcna186257"
  },
  {
    "text": "Biden honors Dem donor George Soros, Hillary Clinton with Presidential Medal of Freedom, sparking outrage: ‘A national disgrace’  —  President Biden bestowed woke Democratic megadonor George Soros with the Presidential Medal of Freedom on Saturday — outraging critics  who ripped the selection as a “national disgrace.”",
    "url": "https://nypost.com/2025/01/04/us-news/joe-biden-bestows-presidential-medal-of-freedom-to-george-soros-hillary-clinton/"
  }
]