[
  {
    "text": "Trump: ‘I Need the Kind of Generals That Hitler Had’  —  To support The Atlantic's journalism, please consider subscribing today.  —  In April 2020, Vanessa Guillén, a 20-year-old Army private, was bludgeoned to death by a fellow soldier at Fort Hood, in Texas.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-military-generals-hitler/680327/?gift=guxsrl_dAdXUP9zqbQPWxeXgG6TzRGw9UxuZ0SJ0TQw&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "With Election Looming, John Kelly Speaks Out on Trump  —  The former White House chief of staff and retired Marine general explained in a series of interviews why Americans should consider a candidate's character.  —  Few top officials spent more time behind closed doors in the White House … ",
    "url": "https://www.nytimes.com/2024/10/22/us/politics/john-kelly-trump-fitness-character.html"
  },
  {
    "text": "Rudy Giuliani must give control of luxury items and Manhattan apartment to Georgia election workers he defamed, judge rules  —  A federal judge on Tuesday ordered former Donald Trump attorney and New York mayor Rudy Giuliani to turn over all his valuable possessions and his Manhattan penthouse apartment … ",
    "url": "https://www.cnn.com/2024/10/22/politics/rudy-giuliani-bankruptcy-georgia-election-workers"
  },
  {
    "text": "A jittery Harris campaign makes big plans to clinch a narrow win  —  With two weeks to go until Election Day, Kamala Harris' top advisers are staring down numbers that show a wide majority of Americans saying the country is on the wrong track.  —  They're also confident that the next two weeks … ",
    "url": "https://www.cnn.com/2024/10/22/politics/kamala-harris-campaign-final-weeks/"
  },
  {
    "text": "Democrats brace for a possible crack in the blue wall and signs of North Carolina slipping  —  The Harris campaign has privately flagged concerns about Michigan.  But officials stress the race is close across the board.  —  The “blue wall” states of Wisconsin, Michigan and Pennsylvania … ",
    "url": "https://www.nbcnews.com/politics/2024-election/democrats-brace-crack-blue-wall-signs-north-carolina-slipping-rcna176046"
  },
  {
    "text": "Los Angeles Times won't endorse for president  —  The Scoop  —  The owner of the Los Angeles Times has blocked the paper from endorsing a candidate for president this year.  —  Last week, the LA Times published its electoral endorsements for the 2024 election.",
    "url": "https://www.semafor.com/article/10/22/2024/los-angeles-times-wont-endorse-for-president"
  },
  {
    "text": "Trump set to go on Joe Rogan's podcast  —  Former President Donald Trump is expected to record an interview with podcasting behemoth Joe Rogan on Friday.  The interview will take place at Rogan's studio in Austin, Texas, according to a person familiar with the plans who was granted anonymity to discuss the matter.",
    "url": "https://www.politico.com/live-updates/2024/10/22/2024-elections-live-coverage-updates-analysis/trump-joe-rogan-podcast-00184894"
  },
  {
    "text": "Trump attacks Harris with racist stereotype, eyes ‘extreme power’ as president  —  An event with Latino supporters quickly swerved off topic as Trump bashed solar farms as a threat to rabbits and pushed falsehoods about electric vehicles.  —  DORAL, Fla. — Republican nominee Donald Trump used … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/22/trump-attacks-harris-racist-stereotype-florida/"
  },
  {
    "text": "Harris eyes Howard University for her election night headquarters  —  The HBCU is Harris' alma mater, and it's one of the venues her campaign is considering for election night.  —  WASHINGTON — Vice President Kamala Harris plans to spend election night in Washington D.C. … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-eyes-howard-university-election-night-headquarters-rcna176598"
  },
  {
    "text": "Judge who tossed Trump's classified docs case on list of proposed candidates for attorney general  —  Federal Judge Aileen Cannon dismissed Trump's classified documents case in July.  —  Republican presidential nominee, former President Donald Trump takes the stage during a campaign rally … ",
    "url": "https://abcnews.go.com/US/judge-tossed-trumps-classified-docs-case-list-proposed/story?id=114997807"
  },
  {
    "text": "Walz slams Musk for ‘skipping like a dips‑‑‑’ at Trump rallies  —  Democratic vice presidential candidate Tim Walz blasted billionaire Elon Musk on Tuesday for his relationship with former President Trump, mocking his appearance at a recent Trump rally and warning of Musk's role … ",
    "url": "https://thehill.com/homenews/campaign/4947640-tim-walz-elon-musk-trump/"
  },
  {
    "text": "Georgia Supreme Court rejects Republican effort to restore last-minute election rules  —  Decision means that State Election Board's rules remain invalid for Nov. 5 election  —  The Georgia Supreme Court unanimously denied the Republican Party's attempt Tuesday to reinstate State Election Board rules … ",
    "url": "https://www.ajc.com/politics/georgia-supreme-court-rejects-republican-effort-to-restore-last-minute-election-rules/XXAPHD43KJDAVO4HCWBUMSV4ZU/"
  },
  {
    "text": "Trump ground game faces new fraud claims as video shows door-knock hack  —  Exclusive: clip from canvasser for Musk's America Pac reveals apparent ease in which GPS location can be spoofed  —  Donald Trump's ground game in Arizona and Nevada may be undercut by canvassers working … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/22/trump-ground-game-door-knock-hack-gps"
  },
  {
    "text": "Ex-Abercrombie CEO arrested on sex trafficking charges  —  The former CEO of fashion giant Abercrombie & Fitch (A&F) and his British partner have been arrested and are facing sex trafficking charges.  —  Mike Jeffries, his partner Matthew Smith and the couple's alleged middleman were arrested on Tuesday morning.",
    "url": "https://www.bbc.com/news/articles/cgj4j05wy31o"
  },
  {
    "text": "McDonald's Quarter Pounder burgers linked to E. coli outbreak  —  McDonald's Quarter Pounder burgers and some ingredients will be temporarily unavailable in some states to protect customers after the food was linked to an E. coli outbreak, according to a press release from the Centers for Disease Control and Prevention (CDC) on Tuesday.",
    "url": "https://thehill.com/policy/healthcare/4947556-mcdonalds-quarter-pounder-e-coli/"
  },
  {
    "text": "Army ordered to release records on Trump's Arlington cemetery visit  —  A federal judge has ordered Army officials to release their records by the end of this week regarding President Donald Trump's controversial visit to Arlington National Cemetery this summer.",
    "url": "https://www.militarytimes.com/news/pentagon-congress/2024/10/22/army-ordered-to-release-records-on-trumps-arlington-cemetery-visit/"
  },
  {
    "text": "A CNN investigation reveals how deceptive political fundraising has misled elderly Americans into giving away millions of dollars  —  The 80-year-old communications engineer from Texas had saved for decades, driving around in an old car and buying clothes from thrift stores so he'd have enough money to enjoy his retirement years.",
    "url": "https://www.cnn.com/interactive/2024/10/politics/political-fundraising-elderly-election-invs-dg/"
  },
  {
    "text": "Early-voting data shows Republican reversal appears to be paying off  —  Record-setting turnout includes GOP voters, who appear to be responding to former president Trump's pivot from trashing early voting to encouraging it.  —  Americans are voting ahead of Election Day in historic numbers this year.",
    "url": "https://www.washingtonpost.com/politics/2024/10/22/early-voting-republicans-democrats-trump-harris/"
  },
  {
    "text": "Voters prefer Harris's agenda to Trump's — they just don't realize it.  Take our quiz.  —  Try our interactive quiz to see how well you (and other voters) align with each candidate's agenda.  —  As presidential candidates, Kamala Harris and Donald Trump are neck and neck in polls.",
    "url": "https://www.washingtonpost.com/opinions/interactive/2024/trump-harris-policy-quiz/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5NTY5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwOTU1NTk5LCJpYXQiOjE3Mjk1Njk2MDAsImp0aSI6IjI1NmIxNGNlLWMxMmEtNDA5YS04YTI4LWY2NDNmOWIyMWYyYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy9pbnRlcmFjdGl2ZS8yMDI0L3RydW1wLWhhcnJpcy1wb2xpY3ktcXVpei8ifQ.cKETRuytzHkf7UWkJx7IyAE2NDGYU-fzV8J86R4vVLM&itid=gfta"
  },
  {
    "text": "Judge tosses Mark Meadows' bid to obtain White House records for use in Ga. criminal case  —  Donald Trump's former White House chief of staff hoped to use the records to aid in his legal defense.  —  A federal judge has thrown out former Trump White House Chief of Staff Mark Meadows' bid … ",
    "url": "https://www.politico.com/news/2024/10/22/mark-meadows-georgia-criminal-case-00184897"
  },
  {
    "text": "Unknown substance posted with political signs in Ahwatukee; roads closed  —  PHOENIX (AZFamily) — Authorities closed roads in a community south of Phoenix after bags of a substance were found at multiple locations Tuesday morning.  —  Around 3 a.m., Phoenix Fire and Police responded near a health care facility for an emergency.",
    "url": "https://www.azfamily.com/2024/10/22/substance-found-ahwatukee-health-care-facility-roads-closed/"
  },
  {
    "text": "Biden says global leaders are terrified of Trump quietly tell him, 'He can't win'  —  President Joe Biden has torn into his predecessor, suggesting that international leaders are terrified of what Donald Trump's return to the White House could do to democratic rule around the world",
    "url": "https://www.washingtonpost.com/politics/2024/10/22/biden-sanders-new-hampshire-drug-prices/0bdfbbda-90bb-11ef-b5b1-75167840d9f3_story.html"
  },
  {
    "text": "Kamala Harris Got Into Law School Via a Program She Didn't Qualify For  —  Kamala Harris graduated from Howard University without honors.  Harris then applied to law school.  She was admitted to Hastings School of Law at the University of California.  Hastings is considered a good law school but not “elite.”",
    "url": "https://redstate.com/jimthompson/2024/10/22/kamala-got-into-law-school-based-on-program-she-didnt-quality-for-n2180892"
  },
  {
    "text": "Remember: Donald Trump shouldn't even be eligible for the presidency after Jan. 6  —  The Roberts court cleared the way for the GOP's leader to become president again, despite his constitutionally disqualifying engagement in insurrection.  —  This article is the second in a five-part series called “Protecting the Election.”",
    "url": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-shouldnt-be-eligible-presidency-jan-6-rcna175458"
  },
  {
    "text": "Kurt Olsen Helped Trump Fight His 2020 Defeat.  Trump Is Talking to Him Again.  —  Mr. Olsen, a lawyer, has spoken to the former president multiple times in recent weeks.  He's insisted it's important to make legal demands concerning voting-machine data before Election Day.",
    "url": "https://www.nytimes.com/2024/10/22/us/politics/kurt-olsen-trump-2020-lawyer.html"
  },
  {
    "text": "When an Older White Catholic Man Admits, “This Toxicity that Exists Is Really Embarrassing”  —  When I vowed to stop calling Liz Cheney “BabyDick” when she announced she would vote to impeach Donald Trump, the second time, I wrote: … I thought back on it as I watched this clip … ",
    "url": "https://www.emptywheel.net/2024/10/22/when-an-older-white-catholic-man-admits-this-toxicity-that-exists-is-really-embarrassing/"
  }
]