[
  {
    "text": "Trump White House official Navarro convicted of contempt after defying House Jan. 6 subpoena  —  Trump White House official Peter Navarro was found guilty Thursday of contempt of Congress charges for refusing to cooperate with a congressional investigation into the Jan. 6, 2021, attack on the U.S. Capitol.",
    "url": "https://apnews.com/article/trump-white-house-navarro-contempt-congress-jan-6-a4ad58e1f590e5884fd347c86c121a8a"
  },
  {
    "text": "Peter Navarro Convicted of Contempt of Congress Over Jan. 6 Subpoena  —  The verdict made Mr. Navarro the second top adviser to former President Donald J. Trump to be found guilty of contempt for defying the Jan. 6 committee's investigation.  —  Peter Navarro, a trade adviser to President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/09/07/us/politics/navarro-contempt-trial-jury.html"
  },
  {
    "text": "Former Trump aide Peter Navarro's trial set for closing arguments in contempt of Congress case  —  The trial has moved at a brisk pace, with opening statements and witness testimony taking just one day.  The jury is expected to begin deliberating Thursday.  —  Closing arguments are scheduled … ",
    "url": "https://www.nbcnews.com/politics/politics-news/former-trump-aide-peter-navarros-trial-set-closing-arguments-contempt-rcna103790"
  },
  {
    "text": "Willis blasts congressman's ‘interference’ in Fulton Trump probe  —  X  —  Fulton County District Attorney Fani Willis Thursday blasted a congressman who has pledged to investigate her handling of an indictment of former President Donald Trump and others.  —  U.S. Rep. Jim Jordan … ",
    "url": "https://www.ajc.com/politics/willis-blasts-congressmans-interference-in-fulton-trump-probe/IU5USCA3H5A3RJKTMT2WFCL3VU/"
  },
  {
    "text": "Jim Jordan seeks docs from Jack Smith's dealings with attorney in Trump classified records fight  —  House Judiciary Chairman Jim Jordan (R-Ohio) on Thursday asked special counsel Jack Smith to turn over information relating to attorney Stanley Woodward, who has represented numerous Mar-a-Lago employees in dealings with prosecutors.",
    "url": "https://thehill.com/homenews/house/4193068-jim-jordan-seeks-docs-from-jack-smiths-dealings-with-attorney-representing-defendants-in-trump-classified-records-fight/"
  },
  {
    "text": "Disney drops all but free speech claim in political retaliation suit against DeSantis  —  Disney on Thursday amended its federal lawsuit against Florida Gov. Ron DeSantis to focus solely on its First Amendment claim that the governor politically retaliated against the company.",
    "url": "https://www.cnbc.com/2023/09/07/disney-drops-all-but-free-speech-claim-in-political-retaliation-suit-against-desantis.html"
  },
  {
    "text": "Justice Kavanaugh says ethics changes may be coming to Supreme Court  —  CLEVELAND — Justice Brett M. Kavanaugh said Thursday that he is “hopeful” the Supreme Court soon will take specific steps to deal with ethics issues at the court and boost public confidence in the institution.",
    "url": "https://www.washingtonpost.com/politics/2023/09/07/justice-kavanaugh-ethics-supreme-court/"
  },
  {
    "text": "Climate protester glues feet to floor, interrupting US Open semifinal between Gauff and Muchova  —  The U.S. Open semifinal between Coco Gauff and Karolina Muchova was delayed by 50 minutes because of a disruption by environmental activists in the Arthur Ashe Stadium stands on Thursday night.",
    "url": "https://apnews.com/article/us-open-delay-women-semifinals-gauff-muchova-00a82f465076adea36b098aa6ca08a0d"
  },
  {
    "text": "Press Forward Will Award More Than $500 Million to Revitalize Local News  —  A national coalition of donors catalyzes local news and information for stronger communities.  —  A coalition of 22 donors today announced Press Forward, a national initiative to strengthen communities and democracy … ",
    "url": "https://www.macfound.org/press/press-releases/press-forward-will-award-more-than-500-million-to-revitalize-local-news"
  },
  {
    "text": "Republicans are trying to find a new term for ‘pro-life’ to stave off more electoral losses  —  Sen. Todd Young, R-Ind., summarized the closed-door meeting on Capitol Hill as being focused on “pro-baby policies.”  —  WASHINGTON — Republican strategists are exploring a shift away from … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-try-find-new-term-life-stave-electoral-losses-rcna103924"
  },
  {
    "text": "Biden's semi-subtle reminder of the stakes for democracy in 2024  —  There was a period before the 2008 presidential election when it seemed as though the Republican nominee might be former Arkansas governor Mike Huckabee.  At two points in the cycle, he was polling at or near the front-runner … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/07/bidens-semi-subtle-reminder-stakes-democracy-2024/"
  },
  {
    "text": "The Supreme Court's Fake Praying Coach Case Just Got Faker  —  Last year, the Supreme Court ruled in favor of high school football coach's right to engage in “brief, quiet, personal” prayer—despite photographic evidence that his prayers were drawn-out, loud, and extremely public.",
    "url": "https://slate.com/news-and-politics/2023/09/supreme-court-praying-coach-joe-kennedy-fake.html"
  },
  {
    "text": "Republicans Are Freaking Out Over Imaginary COVID Mandates  —  South Carolina's Governor is the latest state Republican to vow never to bring back mask mandates.  —  A group of Republican presidential candidates and lawmakers have spent the week raising hell at the prospect of COVID mask mandates … ",
    "url": "https://www.thedailybeast.com/republicans-are-freaking-out-over-imaginary-covid-mandates-including-south-carolina-guv-henry-mcmaster"
  },
  {
    "text": "Tim Scott suggests opponents are planting stories about his unmarried status  —  The South Carolina senator has been slowly rising in early-state polls in the Republican presidential contest.  —  RYE, N.H. — Sen. Tim Scott suggested during a Thursday campaign stop in New Hampshire … ",
    "url": "https://www.nbcnews.com/politics/2024-election/tim-scott-suggests-opponents-are-planting-stories-unmarried-status-rcna103984"
  },
  {
    "text": "Trump notifies judge he may try to move Georgia case to federal court  —  Former President Trump on Thursday signaled he may attempt to move his Georgia charges to federal court.  —  “President Trump hereby notifies the Court that he may seek removal of his prosecution to federal court,” … ",
    "url": "https://thehill.com/regulation/court-battles/4192540-trump-notifies-judge-he-may-try-to-move-georgia-case-to-federal-court/"
  },
  {
    "text": "Chaos, Comedy, and ‘Crying Rooms’: Inside Jimmy Fallon's ‘Tonight Show’  —  Sixteen current and former staffers say Fallon's erratic behavior spoiled their “dream” of working on The Tonight Show  —  I … The host, known for his warm and congenial presence onscreen, was acting especially dismissive … ",
    "url": "https://www.rollingstone.com/tv-movies/tv-movie-features/jimmy-fallon-tonight-show-toxic-work-environment-crying-rooms-nbc-1234819421/"
  },
  {
    "text": "They Did This to Themselves  —  THE DREAD IS PALPABLE.  —  Donald Trump's dominance over the Republican party and his overwhelming lead in primary polling has some conservatives shaking their fists at the sky.  —  “What, in Heaven's name, is the case for keeping him around?” asks an exasperated Charles Cooke in National Review.",
    "url": "https://plus.thebulwark.com/p/they-did-this-to-themselves"
  },
  {
    "text": "DOJ Shouldn't Explore for Crimes to Indict Hunter Biden  —  The likely imminent indictment of the president's son is what happens when prosecutors cast about for something, anything, to charge. … The Justice Department's announcement that Special Counsel David Weiss intends … ",
    "url": "https://www.thedailybeast.com/doj-shouldnt-explore-for-crimes-to-indict-hunter-biden"
  },
  {
    "text": "Anti-police activist discovers the consequences of ‘dismantling’ the police  —  Shivanthi Sathanandan describes herself on Twitter as ‘2nd Vice Chair, Minnesota Democratic-Farmer-Labor Party’—which is what the Democratic Party calls itself in Minnesota.  And we learned today that she was pretty viciously attacked:",
    "url": "https://twitchy.com/aaronwalker/2023/09/07/shivanthi-sathanandan-discovers-consequences-of-dismantling-the-police-n2386950"
  },
  {
    "text": "Federal appeals court says Texas' floating barriers can remain in Rio Grande for now  —  The 5th US Circuit Court of Appeals issued a temporary stay Thursday night allowing the state of Texas to keep floating barriers in the Rio Grande.  —  A lower court judge had ordered Texas … ",
    "url": "https://www.cnn.com/2023/09/07/politics/texas-water-barriers-migrants-appeal/"
  },
  {
    "text": "Famed tech journalist deletes X account with epic rant at Elon Musk and his ‘cesspool’ site  —  Tech writer legend slams X owner Elon Musk for threatening to ban and sue the Anti-Defamation League  —  Elon Musk's Billion-Dollar Borrowing Spree: SpaceX Funds His Twitter Acquisition",
    "url": "https://www.independent.co.uk/tech/walt-mossberg-elon-musk-twitter-x-b2407123.html"
  },
  {
    "text": "White House Press Secretary Karine Jean-Pierre Has Made History—And Waves  —  In June 2019, Karine Jean-Pierre was moderating a forum for presidential candidates when a protester rushed the stage.  It's a famous video: Finding herself seated between the oncoming protester and then senator Kamala Harris … ",
    "url": "https://www.vogue.com/article/karine-jean-pierre-profile-october-2023"
  },
  {
    "text": "Biden administration considers forcing migrant families to remain in Texas  —  Immigration and the Border  —  The Biden administration is considering forcing some migrant families who enter the country without authorization to remain near the border in Texas  —  can we just list the border states then?",
    "url": "https://www.latimes.com/politics/story/2023-09-07/biden-migrant-families-border"
  }
]