[
  {
    "text": "Jeffrey Epstein's Friends Sent Him Bawdy Letters for a 50th Birthday Album.  One Was From Donald Trump.  —  The leather-bound book was compiled by Ghislaine Maxwell.  The president says the letter ‘is a fake thing.’  —  It was Jeffrey Epstein's 50th birthday, and Ghislaine Maxwell was preparing a special gift to mark the occasion.",
    "url": "https://www.wsj.com/politics/trump-jeffrey-epstein-birthday-letter-we-have-certain-things-in-common-f918d796?st=wfUHDm&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump's WSJ Epstein Fury … On Thursday, anticipation rippled through political and media circles as insiders awaited a potentially explosive Wall Street Journal story examining Donald Trump's ties to the late Jeffrey Epstein.  The article, said to be in the works for days … ",
    "url": "https://www.status.news/p/wall-street-journal-trump-epstein-emma-tucker"
  },
  {
    "text": "Trump's Budget Chief Gives The Middle Finger To Congress And The Constitution  —  Russ Vought said to expect more massive spending cuts because Trump is “not cowing to a legislative branch's understanding of its own authorities and powers.”  —  WASHINGTON — President Donald Trump's budget … ",
    "url": "https://www.huffpost.com/entry/russ-vought-scoffs-congress-spending-cuts_n_687907bce4b007ebff46dc4e"
  },
  {
    "text": "Russ Vought: Appropriations process ‘has to be less bipartisan’  —  Office of Management and Budget Director Russ Vought isn't interested in giving assurances to lawmakers on Capitol Hill that the White House will abide by any bipartisan spending agreements made this year.",
    "url": "https://www.politico.com/live-updates/2025/07/17/congress/russ-vought-appropriations-process-has-to-be-less-bipartisan-00459479"
  },
  {
    "text": "CBS to Cancel ‘Late Show With Stephen Colbert’ Citing ‘Financial Decision’  —  TV's ongoing problems with late night have come for Stephen Colbert, with CBS announcing Thursday that it plans to end his “Late Show” after the next TV season, citing a “financial decision.”",
    "url": "https://variety.com/2025/tv/news/cbs-cancel-late-show-stephen-colbert-financial-decision-1236464356/"
  },
  {
    "text": "White House defends handling of Epstein files, chides press for coverage  —  White House press secretary Karoline Leavitt defended the Trump administration's handling of the case of deceased sex offender Jeffrey Epstein, saying “some of the most trusted voices in the Republican Party movement” … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/17/trump-presidency-news/"
  },
  {
    "text": "Maurene Comey warns her former colleagues: ‘Fear is the tool of the tyrant’ … NEW YORK — One day after being fired by the Justice Department, Maurene Comey told her former colleagues that “fear is the tool of a tyrant,” appearing to take aim at the upper ranks of DOJ and perhaps the president … ",
    "url": "https://www.politico.com/news/2025/07/17/maurene-comey-letter-firing-00459560"
  },
  {
    "text": "Prosecutor Fired by Trump Calls Fear the ‘Tool of a Tyrant’  —  Maurene Comey, who helped prosecute Jeffrey Epstein and Sean Combs, was dismissed without a detailed explanation.  She is the daughter of James B. Comey, a longtime adversary of President Trump.",
    "url": "https://www.nytimes.com/2025/07/17/nyregion/maurene-comey-fired-trump.html"
  },
  {
    "text": "Trump diagnosed with chronic venous insufficiency following leg swelling  —  President Donald Trump was examined for swelling in his legs and has been diagnosed with chronic venous insufficiency, the White House announced Thursday.  —  Trump, 79, underwent a “comprehensive examination … ",
    "url": "https://cnn.com/2025/07/17/politics/trump-leg-swelling-chronic-venous-insufficiency"
  },
  {
    "text": "Trump administration hands over Medicaid recipients' personal data, including addresses, to ICE  —  Immigration and Customs Enforcement officials will be given access to the personal data of the nation's 79 million Medicaid enrollees, including home addresses and ethnicities … ",
    "url": "https://apnews.com/article/immigration-medicaid-trump-ice-ab9c2267ce596089410387bfcb40eeb7"
  },
  {
    "text": "Justice Dept. Asks for 1-Day Sentence for Ex-Officer Convicted in Breonna Taylor Raid  —  The move was a stunning reversal of Biden-era efforts to address racial disparities in local law enforcement.  —  The Justice Department's civil rights chief has asked a federal judge to sentence … ",
    "url": "https://www.nytimes.com/2025/07/17/us/politics/justice-department-brett-hankison-sentence-breonna-taylor.html?unlocked_article_code=1.XE8.DiU9.p_GjRd1NwVmq&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Ex-Casino Boss Claims Trump and ‘Best Friend’ Jeffrey Epstein Were Once Caught Bringing Underage Girls to Casino Floor  —  A former executive at Trump's Atlantic City casino told CNN that the duo brought three girls to the gambling floor who were not yet 21.  The White House is calling his story “fabricated”",
    "url": "https://people.com/ex-casino-boss-claims-trump-epstein-brought-underage-girls-casino-floor-11774374"
  },
  {
    "text": "This Democrat Won't Let Go of the Jeffrey Epstein Case, Either  —  Senator Ron Wyden has found that four banks waited until Mr. Epstein's arrest on federal charges to flag $1.5 billion in suspicious transactions.  Mr. Wyden wants the documents made public.  —  President Trump and his administration … ",
    "url": "https://www.nytimes.com/2025/07/17/business/epstein-banks-wyden-trump.html?unlocked_article_code=1.XE8.Htgu.HiwOJbDA06Zd&smid=url-share"
  },
  {
    "text": "Alligator Alcatraz isn't meant for minors.  A 15 year old ended up there anyway  —  In the rush to open a detention camp in the Florida Everglades for “some of the most vicious” migrants illegally in the country, state and federal officers detained a 15-year-old boy with no criminal record … ",
    "url": "https://www.miamiherald.com/news/politics-government/state-politics/article310785240.html"
  },
  {
    "text": "Donald Trump set to open US retirement market to crypto investments  —  President preparing executive order to allow 401k plans to tap broad pool of alternative assets  —  Donald Trump is preparing to open the $9tn US retirement market to cryptocurrency investments, gold … ",
    "url": "https://www.ft.com/content/07906211-5ab8-4917-bcad-5397c0bc3170"
  },
  {
    "text": "Trump administration shuts down LGBTQ youth suicide hotline  —  The 988 Suicide & Crisis Lifeline's LGBTQ youth service, which has provided queer youths with specialized services since 2022, was officially terminated Thursday.  —  The Trump administration on Thursday afternoon officially terminated … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/trump-shuts-down-lgbtq-youth-suicide-hotline-rcna219090"
  },
  {
    "text": "Top oversight Democrat sends letter to Fox News demanding answers on edits to Trump's 2024 Epstein comments  —  A top oversight Democrat sent a letter on Thursday to Fox Corp chairman Lachlan Murdoch and Fox News Media CEO Suzanne Scott demanding answers about Fox's editing of a Donald Trump interview … ",
    "url": "https://cnn.com/2025/07/17/media/trump-epstein-fox-news-edits-house-democrats-oversight"
  },
  {
    "text": "New U.S. assessment finds American strikes destroyed only one of three Iranian nuclear sites  —  President Donald Trump rejected a military plan for more comprehensive strikes on Iran's nuclear program that would have lasted weeks, NBC News has also learned.",
    "url": "https://www.nbcnews.com/politics/national-security/new-us-assessment-finds-american-strikes-destroyed-only-one-three-iran-rcna218761"
  },
  {
    "text": "Former Voice of America Employee Indicted for Threatening Rep. Marjorie Taylor Greene  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  WASHINGTON - An indictment unsealed today in the District of Columbia charges a Maryland resident with influencing … ",
    "url": "https://www.justice.gov/usao-dc/pr/former-voice-america-employee-indicted-threatening-rep-marjorie-taylor-greene"
  },
  {
    "text": "Trump's approval rating on immigration and government spending has slipped, new AP-NORC poll finds  —  Only about one-quarter of U.S. adults say that President Donald Trump's policies have helped them since he took office, according to a new poll that finds underwhelming marks for him on key issues … ",
    "url": "https://apnews.com/article/poll-trump-approval-policies-economy-health-immigration-45681b8cd07782ba7a143d323efe9dd7"
  },
  {
    "text": "When institutions crumble, strongmen step in  —  Trump wants to be the sole authority.  With trust in institutions cratering, he sees his opportunity.  —  What would it take to put the swirling conspiracy theories about Jeffrey Epstein to bed?  Nothing complicated; just an authoritative … ",
    "url": "https://www.washingtonpost.com/opinions/2025/07/17/trust-institutions-authoritarianism-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUyNzI0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0MTA3MTk5LCJpYXQiOjE3NTI3MjQ4MDAsImp0aSI6IjM5OWFlYjA1LTU2YjktNGE0OC1iZTIxLWJlNmEwN2IzMzcwNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA3LzE3L3RydXN0LWluc3RpdHV0aW9ucy1hdXRob3JpdGFyaWFuaXNtLXRydW1wLyJ9.79uEl7NS5fWfwl__Wt0hhGXBrSHQBfo65QNcGRkH3jc&itid=gfta"
  },
  {
    "text": "Fascism For First Time Founders  —  from the democracy-is-actually-important-for- innovation dept  —  Over the last year or so I've seen a disturbing tendency in tech/startup/VC worlds to buy into the neoreactionary view that for startups to be successful they need to get on board the Trump train.",
    "url": "https://www.techdirt.com/2025/07/17/fascism-for-first-time-founders/"
  },
  {
    "text": "DOGE Put Free Tax Filing Tool on Chopping Block After One Meeting With Lobbyists  —  A key operative from DOGE initiated plans to potentially kill Direct File, the free tax filing tool developed by the IRS, after offering assurances it would be spared from cuts.",
    "url": "https://www.wired.com/story/doge-direct-file-chopping-block/"
  },
  {
    "text": "Flight Manifests Reveal Dozens of Previously Unknown People on Three Deportation Flights to El Salvador  —  The flight manifests for three legally contested deportation flights from Texas to El Salvador contain dozens of additional, unaccounted for passengers than a previously published Department … ",
    "url": "https://www.404media.co/flight-manifests-reveal-dozens-of-previously-unknown-people-on-three-deportation-flights-to-el-salvador/"
  },
  {
    "text": "Trump faces backlash as 69% believe Epstein details concealed, Reuters/Ipsos poll finds  —  Most Americans think President Donald Trump's administration is hiding information about accused sex-trafficker Jeffrey Epstein and give it poor marks on the issue after pledging to make public documents in the case, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/trump-faces-backlash-69-believe-epstein-details-concealed-reutersipsos-poll-2025-07-17/"
  },
  {
    "text": "White House Prepares Executive Order Targeting ‘Woke AI’  —  Order would be one of several expected to outline Trump's vision for winning AI race with China  —  White House officials are preparing an executive order targeting tech companies with what they see as “woke” artificial-intelligence models … ",
    "url": "https://www.wsj.com/tech/ai/white-house-prepares-executive-order-targeting-woke-ai-e68e8e24?st=FzmZQi&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Voting age to be lowered to 16 by next general election  —  Sixteen and 17-year-olds would be able to vote at the next general election, under government plans to lower the voting age.  —  The pledge is part of a raft of measures being introduced through a new Elections Bill.",
    "url": "https://www.bbc.com/news/articles/c628ep4j5kno"
  },
  {
    "text": "Former Intel Chief Banned From Dog's Graduation Ceremony  —  The pettiness of the administration's retribution campaign begins to bite.  —  Earlier this year, an adorable yellow Lab named Susan completed a CIA training program for “detection K9s.”  She was a natural at sniffing out concealed explosives … ",
    "url": "https://www.theatlantic.com/national-security/archive/2025/07/james-clapper-cia-dog-trump/683575/"
  },
  {
    "text": "Democratic Senators Walk Out Of Trump Judicial Nominee Emil Bove's Hearing  —  Republicans say the controversial nominee is ready for a floor vote.  Democrats say they're moving too fast.  —  Democratic members of the Senate Judiciary Committee abruptly walked out of a Thursday hearing … ",
    "url": "https://www.huffpost.com/entry/democratic-senators-trump-judicial-nominee-emil-bove-hearing_n_68791c88e4b007ebff46f72e"
  }
]