[
  {
    "text": "Playbook: How Mike Johnson boxed himself in  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT JEN O'MALLEY DILLON IS READING — The GOP-backed bid to change Nebraska's presidential elector system to a winner-take-all setup — likely giving DONALD TRUMP … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/04/how-mike-johnson-boxed-himself-in-00150544"
  },
  {
    "text": "Why Mike Johnson's perch has suddenly grown precarious  —  Facing escalating internal clashes, the new speaker watches the walls close in.  —  To hear Mike Johnson tell it, he's not having much fun as speaker.  He has complained about the long hours and constant travel … ",
    "url": "https://www.politico.com/news/2024/04/04/mike-johnsons-perch-grows-more-precarious-00150547"
  },
  {
    "text": "Greene keeps alive campaign to oust Johnson and warns against new push for Ukraine aid  —  Rep. Marjorie Taylor Greene bluntly warned Speaker Mike Johnson on Wednesday that moving ahead with an aid package for Ukraine would be one of “the most egregious things he could do” as she said she was … ",
    "url": "https://www.cnn.com/2024/04/03/politics/marjorie-taylor-greene-speaker-johnson/"
  },
  {
    "text": "Scoop: Johnson faces new pressure from Democrats on foreign aid … - “He's a bit boxed in,” one House Democrat said of Johnson. … - “No matter which path he walks down ... one's with alligators, one's with piranhas. … - In addition to Ukraine and Gaza, the letter calls for aid to Sudan … ",
    "url": "https://www.axios.com/2024/04/04/mike-johnson-ukraine-aid-bill-israel"
  },
  {
    "text": "Biden moves to defang political assaults on federal workforce  —  The move is widely seen as a response to former President Donald Trump's efforts to root out what he called a “deep state” that thwarted his policies.  —  The Biden administration put the finishing touches Thursday on a plan … ",
    "url": "https://www.politico.com/news/2024/04/04/biden-moves-to-defang-political-assaults-on-federal-workforce-00150446"
  },
  {
    "text": "Trump tests gag order by sharing articles on judge's family  —  Former President Trump shared articles critical of Judge Juan Merchan and his family on Wednesday, appearing to test the bounds of the gag order placed on Trump in his New York hush money case.  —  Merchan expanded the gag order Monday … ",
    "url": "https://thehill.com/regulation/court-battles/4574362-trump-tests-gag-order-by-sharing-articles-on-judges-family/"
  },
  {
    "text": "Nebraska legislators buck Trump by blocking Electoral College vote change — for now  —  Former President Donald Trump and Republican Gov. Jim Pillen have called on lawmakers to change the state's Electoral College vote allocation to a winner-take-all system.",
    "url": "https://www.nbcnews.com/politics/2024-election/nebraska-legislators-buck-trump-blocking-electoral-college-vote-change-rcna146321"
  },
  {
    "text": "Attempt to consolidate Electoral College votes fails in Nebraska Legislature  —  ‘Winner-take-all’ change would eliminate Democrats' opportunity to repeat the 2020 ‘blue dot’ win for Biden  —  LINCOLN, Neb. (WOWT) - An attempt to turn Nebraska into a “winner-take-all” state … ",
    "url": "https://www.wowt.com/2024/04/03/nebraska-lawmakers-pushing-consolidate-states-electoral-college-votes/"
  },
  {
    "text": "Former President Donald Trump On Israel's War, 2024 And Much More  —  Former President Donald Trump joined me this morning:  —  Audio:  —  04-04hhs-trump  —  Transcript:  —  HH: Joined by our very special guest, former President Donald Trump.  Mr. President, welcome back.",
    "url": "https://hughhewitt.com/former-president-donald-trump-on-israels-war-2024-and-much-more"
  },
  {
    "text": "Trump's GOP isn't built to win, but only to protect himself  —  Donald Trump's family has taken personal control of the Republican National Committee, and it is already beginning to resemble the D.C. branch of the Trump Organization rather than one that represents all Republicans.",
    "url": "https://thehill.com/opinion/campaign/4573421-trumps-gop-isnt-built-to-win-but-only-to-protect-himself/"
  },
  {
    "text": "Missouri's ridiculous lawfare against Media Matters  —  AG Andrew Bailey is punishing the watchdog group for making Elon Musk sad. … Move over Ken Paxton!  There's a new crazy state attorney general in town, and he's coming for your crooked crown.  —  Last week, Missouri Attorney General … ",
    "url": "https://www.publicnotice.co/p/missouri-media-matters-lawsuit-ag-andrew-bailey"
  },
  {
    "text": "John Eastman Asks for Delay in Disbarment Citing Hefty Legal Fees  —  BILLS TO PAY  —  The former Trump lawyer says he could be facing a total outlay of $3 million.  —  Former Donald Trump lawyer John Eastman is asking a judge to pause his disbarment so he can continue to work and earn income … ",
    "url": "https://www.thedailybeast.com/john-eastman-asks-for-delay-in-disbarment-citing-hefty-legal-fees"
  },
  {
    "text": "Elon Musk's viral lie about the 2024 election uses bogus data  —  In October 2022, Elon Musk completed his purchase of Twitter.  He then dramatically changed the algorithm to boost his own tweets.  The new algorithm, according to a February 2023 report by Platformer, “artificially boosted Musk's tweets … ",
    "url": "https://popular.info/p/elon-musks-viral-lie-about-the-2024"
  },
  {
    "text": "UN body approves first resolution protecting rights of intersex people  —  The United Nations Human Rights Council voted Thursday to adopt a first-of-its-kind initiative protecting the rights of intersex people.  —  Twenty-four countries voted in favor of the draft resolution … ",
    "url": "https://thehill.com/homenews/lgbtq/4574605-un-body-approves-first-resolution-protecting-rights-of-intersex-people/"
  },
  {
    "text": "EPA awards $20 billion in green bank grants for clean energy projects nationwide  —  DETROIT (AP) — The Environmental Protection Agency on Thursday awarded $20 billion in federal “green bank” grants to eight community development banks and nonprofit organizations to use on projects combating climate change … ",
    "url": "https://apnews.com/article/epa-billions-clean-green-energy-community-grants-8f6c76cb41783a5e838ac4f7f7cce086"
  },
  {
    "text": "Judge Orders Timely Housing for Migrant Children Waiting at Border  —  The decision established that minors at open-air sites were in legal custody of the Department of Homeland Security and thus must receive safe shelter, even if they had not yet been formally processed.",
    "url": "https://www.nytimes.com/2024/04/04/health/migrant-children-border-housing.html"
  },
  {
    "text": "How Steve Bannon guided the MAGA movement's rebound from Jan. 6  —  A shroud of black mesh fence closed around the bright marble colonnades of the U.S. Capitol campus.  The twelve‐foot barrier, topped with razor wire and guarded by troops in combat fatigues with flak vests and long rifles … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/04/steve-bannon-maga-january-6/"
  },
  {
    "text": "Biden extends some immigrant work permits, potentially saving thousands of jobs  —  The Biden administration on Thursday is announcing an extension of work permits for certain categories of immigrants, potentially preventing hundreds of thousands of people from losing their jobs overnight.",
    "url": "https://thehill.com/latino/4573404-biden-immigrant-work-permits/"
  },
  {
    "text": "Biden says U.S. economy is world's best.  Trump calls it a ‘cesspool.’ Data is clear. … U.S. President Joe Biden, delivers remarks on the U.S. economy and his administration's effort to revive American manufacturing, during his visit in Flex LTD, a factory that makes solar energy microinverters … ",
    "url": "https://www.cnbc.com/2024/04/04/biden-us-economy-worlds-best-trump-claims-cesspool-data-is-clear.html"
  },
  {
    "text": "Judge Won't Delay Trump's Criminal Trial to Wait for Immunity Ruling  —  The former president had asked the judge to push back his Manhattan criminal trial, slated to begin April 15, until after the Supreme Court decides whether he is immune from prosecution.",
    "url": "https://www.nytimes.com/2024/04/03/nyregion/trump-merchan-immunity-ruling.html"
  },
  {
    "text": "As Elections Loom, Congressional Maps Challenged as Discriminatory Will Remain in Place  —  With control of the House of Representatives hanging in the balance, the time-consuming appeals process means elections in multiple districts will take place using maps that have been challenged as discriminatory to voters of color.",
    "url": "https://www.propublica.org/article/elections-district-maps-deemed-discriminatory-south-carolina-florida"
  },
  {
    "text": "Trump Spoke Recently With Saudi Leader  —  It is not clear what the former president discussed with Prince Mohammed bin Salman, but news of their call came amid Biden administration negotiations with the Saudis over a Middle East peace plan.  —  Former President Donald J. Trump spoke recently … ",
    "url": "https://www.nytimes.com/2024/04/03/us/politics/trump-spoke-recently-with-saudi-leader.html"
  },
  {
    "text": "Jack Smith puts Judge Aileen Cannon on notice  —  Judge Aileen M. Cannon has left many legal experts dumbfounded with her handling of the criminal classified documents case against former president Donald Trump, the man who nominated her to the federal bench.  —  And special counsel Jack Smith appears to be losing patience with her.",
    "url": "https://www.washingtonpost.com/politics/2024/04/03/jack-smith-puts-judge-aileen-cannon-notice/"
  },
  {
    "text": "New Bill Clinton memoir coming after November election … - “I knew as I entered this new chapter of my life that I'd keep score the way I always have,” Clinton says in the announcement.  — “Are people better off when you quit than when you started?",
    "url": "https://www.axios.com/2024/04/04/bill-clinton-book-citizen-november-2024-release"
  },
  {
    "text": "Migrant border crossings dip in March, with U.S. officials crediting crackdown by Mexico  —  Washington — The number of migrants apprehended along the U.S.-Mexico border dipped in March, internal government statistics obtained by CBS News show, a surprising trend that American officials … ",
    "url": "https://www.cbsnews.com/news/immigration-migrant-border-crossings-march-mexico/"
  },
  {
    "text": "Has televising Congress dumbed it down?  —  During the 1970s, the U.S. House debated whether to televise its floor proceedings and, if so, how best to do it.  Should there be a network pool of cameras, or should they use an House-owned and operated system?  With the strong guidance of Speaker Thomas … ",
    "url": "https://thehill.com/opinion/congress-blog/4573756-has-televising-congress-dumbed-it-down/"
  },
  {
    "text": "Rejected and ‘returned for correction’: Docs for Trump's $175M bond get bounced  —  A review of the New York County Supreme Court docket on Wednesday shows that paperwork for former President Donald Trump's newly-secured bond of $175 million was temporarily rejected and “returned for correction.”",
    "url": "https://lawandcrime.com/high-profile/rejected-and-returned-for-correction-docs-for-trumps-175m-bond-get-bounced/"
  }
]