[
  {
    "text": "Supreme Court to post a decision Monday, possibly on Trump ballot access  —  The outcome of Donald Trump's challenge to a Colorado ruling barring him from the ballot is highly anticipated ahead of Super Tuesday  —  The Supreme Court is set to announce at least one opinion Monday morning … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/03/trump-colorado-ballot-supreme-court-decision/"
  },
  {
    "text": "A Supreme Court decision could come Monday in a case about barring Trump from the 2024 ballot  —  A Supreme Court decision could come as soon as Monday in the case about whether former President Donald Trump can be kicked off the ballot over his efforts to undo his defeat in the 2020 election.",
    "url": "https://apnews.com/article/supreme-court-trump-capitol-riot-colorado-maine-d784759ab9376d4c3a6e3ae72465f448"
  },
  {
    "text": "Another GOP senator announces she won't vote for Trump in 2024  —  And then there were two: Lisa Murkowski and Mitt Romney are incumbent Republican senators who've publicly said they won't vote for Donald Trump in 2024.  —  After launching her Republican presidential campaign in February 2023 … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/another-gop-senator-announces-wont-vote-trump-2024-rcna141606"
  },
  {
    "text": "Supreme Court keeps Trump on ballot, rejects Colorado voter challenge  —  Decision comes a day before Super Tuesday and as justices weigh other key cases affecting Donald Trump  —  The Supreme Court on Monday unanimously sided with Donald Trump, allowing the former president to remain … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/04/supreme-court-trump-ballot-decision/"
  },
  {
    "text": "The Supreme Court saves Trump's bacon  —  This free edition of PN is made possible by paid subscribers.  If you aren't one already, hit the button and sign up to support our independent journalism.  —  ⚖️ Subscribe to Public Notice ⚖️",
    "url": "https://www.publicnotice.co/p/supreme-court-trump-immunity-explained"
  },
  {
    "text": "Joe Biden's Last Campaign  —  Trailing Trump in polls and facing doubts about his age, the President voices defiant confidence in his prospects for reëlection.  —  “I'll show you where Trump sat and watched the revolution,” Joe Biden said, stepping out from behind his desk in the Oval Office.",
    "url": "https://www.newyorker.com/magazine/2024/03/11/joe-bidens-last-campaign?currentPage=all"
  },
  {
    "text": "Nikki Haley wins the District of Columbia's Republican primary and gets her first 2024 victory  —  WASHINGTON (AP) — Nikki Haley has won the Republican primary in the District of Columbia, notching her first victory of the 2024 campaign.  —  Her victory Sunday at least temporarily halts Donald Trump's sweep … ",
    "url": "https://apnews.com/article/nikki-haley-republicans-donald-trump-dc-primary-7b5eec7a5398379b0f1c9ed9f50b6ce3"
  },
  {
    "text": "Haley wins DC GOP primary  —  Nikki Haley will win the Washington, D.C., Republican presidential primary, netting her first victory of the GOP nominating process, Decision Desk HQ projects.  —  Haley garnered 1,274 votes to former President Trump's 676 with all precincts reporting, according to DDHQ.",
    "url": "https://thehill.com/homenews/campaign/4503364-haley-takes-the-victory-in-dc-gop-primary/"
  },
  {
    "text": "AI-generated images of Trump with Black voters being spread by supporters  —  No evidence to tie fake images, including one created by Florida radio host, to Trump campaign, BBC Panorama investigation finds  —  Dozens of fake, artificial intelligence-generated photos showing Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/04/trump-ai-generated-images-black-voters"
  },
  {
    "text": "Trump supporters target black voters with faked AI images  —  Donald Trump supporters have been creating and sharing AI-generated fake images of black voters to encourage African Americans to vote Republican.  —  BBC Panorama discovered dozens of deepfakes portraying black people as supporting the former president.",
    "url": "https://www.bbc.com/news/world-us-canada-68440150"
  },
  {
    "text": "Key Figure in Trump's Business Will Plead Guilty to Perjury  —  Allen H. Weisselberg, the former Trump Organization finance chief, has already spent time at the Rikers Island jail complex.  A perjury plea could send him back.  —  Allen H. Weisselberg, a longtime lieutenant … ",
    "url": "https://www.nytimes.com/2024/03/04/nyregion/weisselberg-guilty-trump-business.html"
  },
  {
    "text": "Trump's White House Was ‘Awash in Speed’ — and Xanax  —  Under Trump, the White House Medical Unit was “like the Wild West,” and staffers had easy access to powerful stimulants and sedatives, sources tell Rolling Stone  —  IF YOU EVER looked at the actions of the Trump White House and wondered, ‘Are they on drugs?’",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-white-house-drugs-speed-xanax-1234979503/"
  },
  {
    "text": "Mitch McConnell is the arsonist who set America on fire and ran away  —  The lyrics to Kenny Rogers' “The Gambler” are branded onto my brain.  In the summer of 1979, I was a 20-year-old so eager to break into journalism I took a job at a tiny paper in Peoria, Ill., and lived there with my grandparents.",
    "url": "https://www.inquirer.com/opinion/commentary/mitch-mcconnell-destroyed-america-runs-away-20240303.html"
  },
  {
    "text": "Fury after Exxon chief says public to blame for climate failures  —  Darren Woods tells Fortune consumers not willing to pay for clean-energy transition, prompting backlash from climate experts  —  The world is off track to meet its climate goals and the public is to blame, Darren Woods … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/04/exxon-chief-public-climate-failures"
  },
  {
    "text": "Kamala Harris says there must be an ‘immediate ceasefire’ in Gaza  —  Vice president says pause in fighting ‘for at least six weeks’ needed to save hostages, ensure aid for besieged civilians  —  Kamala Harris demands ‘immediate ceasefire’ in Gaza: ‘The condition is inhumane’",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/kamala-harris-ceasefire-gaza-b2506271.html"
  },
  {
    "text": "Clarence Thomas's conflict is clear — he must recuse himself from the Trump immunity case  —  Much ink has been spilled documenting Justice Clarence Thomas's ethical improprieties and the damage they do to the standing of the court on which he sits.  But the Supreme Court's decision … ",
    "url": "https://thehill.com/opinion/judiciary/4501934-clarence-thomass-conflict-is-clear-he-must-recuse-himself-from-the-trump-immunity-case/"
  },
  {
    "text": "AG Garland pledges to fight voter ID laws, election integrity measures  —  Garland appeared in Selma, Alabama Sunday alongside Vice President to mark the 59th anniversary of Blood Sunday  —  Attorney General Merrick Garland appeared alongside Vice President Kamala Harris in Selma … ",
    "url": "https://www.foxnews.com/politics/ag-garland-pledges-fight-voter-id-laws-election-integrity-measures"
  }
]