[
  {
    "text": "No. 2 Senate GOP leader: Trump should debate Harris again  —  Senate Republican Whip John Thune (N.D.), the No. 2-ranking Senate GOP leader, says former President Trump should agree to a second debate with Vice President Harris.  —  Thune, a leading candidate to succeed Sen. Mitch McConnell … ",
    "url": "https://thehill.com/homenews/senate/4878151-thune-urges-trump-debate-harris/"
  },
  {
    "text": "ABC's Bias Deprived Voters of a Fair Debate  —  They called Trump out on every falsehood but let Harris get away with one lie after another.  —  Like most Americans who watched Tuesday's debate, we both thought Kamala Harris had defeated Donald Trump.  She knew her lines and threw him on the defensive, and he couldn't keep up.",
    "url": "https://www.wsj.com/opinion/abcs-bias-deprived-voters-of-a-fair-debate-2024-presidential-election-trump-harris-01410617"
  },
  {
    "text": "If True, the ABC News Presidential Debate Could Be Rocked by Explosive Scandal  —  Anyone who watched the presidential debate hosted by ABC News on Tuesday knows that the moderators were biased and repeatedly fact-checked Trump while letting Kamala Harris's lies go unchallenged.",
    "url": "https://pjmedia.com/matt-margolis/2024/09/12/if-true-the-abc-news-presidential-debate-could-be-rocked-by-explosive-scandal-n4932479"
  },
  {
    "text": "Harris campaign suggests Trump avoiding debate because he doesn't want to defend ‘toxic positions’  —  Vice President Harris's campaign on Friday argued that former President Trump shared a handful of “toxic positions” on the debate stage earlier this week and suggested he's avoiding another debate so he doesn't have to defend them.",
    "url": "https://thehill.com/homenews/campaign/4878206-harris-campaign-trump-toxic-positions-debate/"
  },
  {
    "text": "Election 2024 live updates: Trump to hold news conference, campaign in Nev.; Harris back in Pa.  —  Trump says he won't debate Harris again before election  —  Election 2024  —  Follow live updates on the 2024 election and the contest between Vice President Kamala Harris … ",
    "url": "https://www.washingtonpost.com/elections/2024/09/13/2024-election-campaign-updates-harris-trump/"
  },
  {
    "text": "Trump's mental capacity is now topic one  —  The Donald Trump who melted down on the debate stage Tuesday night is not a well man.  —  He sounded like a lunatic.  He expressed his belief in things that simply aren't true.  (Think: “They're eating the dogs.  They're eating the cats.\")",
    "url": "https://presswatchers.org/2024/09/trumps-mental-capacity-is-now-topic-one/"
  },
  {
    "text": "Donald Trump's Go-To Move When Debates Don't Go Well  —  The former president has a habit of working the referees before debates, and then complaining about them if things don't go as he hoped.  —  As former President Donald J. Trump sought to minimize the damage done by Tuesday night's debate … ",
    "url": "https://www.nytimes.com/2024/09/12/us/politics/trump-debate.html"
  },
  {
    "text": "Triple Hearsay: Original Sources of the Claim that Haitians Eat Pets in Ohio Admit No First-Hand Knowledge  —  “I'm not sure I'm the most credible source because I don't actually know the person who lost the cat,” Kimberly Newton told NewsGuard.  She is the Springfield, Ohio, resident whose story started it all",
    "url": "https://www.newsguardrealitycheck.com/p/origins-haitians-eating-pets-claim"
  },
  {
    "text": "Texas comes for the right to interstate travel  —  States' rights for me, not for thee. … During Tuesday's debate, as Donald Trump tried to take credit for the demise of Roe while pretending a second Trump administration wouldn't obliterate abortion protections at a national level … ",
    "url": "https://www.publicnotice.co/p/texas-medical-records-abortion"
  },
  {
    "text": "Trump allies alarmed by far-right activist's influence on him … - “Marjorie Taylor Greene is right. … - Greene, a GOP firebrand known for her politically provocative speeches in Congress, has had a series of disagreements with Loomer long before this week.",
    "url": "https://www.axios.com/2024/09/13/trump-allies-far-right-activist-loomer"
  },
  {
    "text": "Project 2025 cuts Social Security: Are you on the chopping block?  Check this map.  —  Should the Social Security Retirement Age Be Raised?  Yes.  — Heritage Foundation  —  You gotta hand it to the clever folks at the Heritage Foundation!  How do you make it even harder for seniors struggling with their healthcare and expenses?",
    "url": "https://thedemlabs.org/2024/09/12/project-2025-cuts-social-security-map-of-who-gets-hurt/"
  },
  {
    "text": "Bipartisan group of lawmakers signs pledge to certify 2024 election results  —  More than 30 House members, including a half-dozen Republicans, have signed a bipartisan pledge to uphold the results of the 2024 election amid an increased focus on Congress' role in certifying the tally next January.",
    "url": "https://www.politico.com/live-updates/2024/09/13/congress/house-centrists-vow-to-certify-2024-election-00178945"
  },
  {
    "text": "In blow to Newsmax, judge rules Smartmatic's case over 2020 election lies will go to trial this month  —  A major defamation case against Newsmax will proceed to trial later this month, a judge ruled Thursday, dealing a blow to the right-wing network and setting the stage for the 2020 election … ",
    "url": "https://www.cnn.com/smartmatic-newsmax-trial-2020-election-fox/"
  },
  {
    "text": "Is There More to JD Vance's MAGA Alliance Than Meets the Eye?  —  The New Right has a blueprint for taking power.  JD Vance could be following it.  —  JD Vance's political career has been defined by an apparent paradox.  On the one hand, Vance is a member of the upper echelon of America's ruling elite … ",
    "url": "https://www.politico.com/news/magazine/2024/09/13/jd-vance-new-right-political-movement-00177203"
  },
  {
    "text": "How Elon Musk Secretly Tried to Oust a Texas Prosecutor  —  In a bid to counter George Soros, the Tesla chief executive unsuccessfully backed the opponent of a progressive district attorney  —  Elon Musk secretly channeled hundreds of thousands of dollars into a local race in Travis County … ",
    "url": "https://www.wsj.com/us-news/elon-musk-texas-da-jose-garza-oust-atempt-206db043?st=0r4kfh0mlpe0euo"
  },
  {
    "text": "Robert F. Kennedy Jr. Has Sabotaged Early Voting in a Critical Swing State  —  The North Carolina Supreme Court tossed a grenade into the state's election on Monday, violating both state and federal law to grant Robert F. Kennedy Jr.'s cynical, last-minute removal from the ballot.",
    "url": "https://slate.com/news-and-politics/2024/09/north-carolina-robert-kennedy-early-voting-trump-sabotage.html"
  },
  {
    "text": "Republicans and Democrats Agree: Campaigning in Extreme Heat Is Brutal  —  Campaigns in Arizona and Nevada have been getting out the vote despite temperatures of 110F, with some canvassers wearing ice vests and neck fans to cool down. … The candidates vying to represent Arizona's 3rd congressional district … ",
    "url": "https://www.bloomberg.com/news/features/2024-09-13/brutal-heat-changes-how-campaigns-woo-voters-in-arizona-nevada?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTcyNjIyNzMwNCwiZXhwIjoxNzI2ODMyMTA0LCJhcnRpY2xlSWQiOiJTSlFaV1dEV1JHRzAwMCIsImJjb25uZWN0SWQiOiJFMkUzODg2QzgzREM0NTUxOEVFM0M2MDRGN0ZBRTlGMyJ9.XgL8bZJJljSx6ZWX0T4Qvgc_chH1MUhKz0SvGRNGxgM"
  },
  {
    "text": "The New York Times' Republicans-only Opinion Feature  —  A regular New York Times opinion feature includes outside writers — but only conservatives  —  If you read yesterday's New York Times, you likely came across a feature headlined “'Trump Brought Darkness; Harris Brought Light': 14 Writers on Who Won the Presidential Debate.”",
    "url": "https://www.findinggravity.net/p/the-new-york-times-republicans-only"
  },
  {
    "text": "Coin-toss election gives young voters new sway … - For Trump, that means gunning for the “bro” vote with testosterone-fueled appearances on podcasts and at UFC fights.  — Harris is betting that young women — who appear to be moving left much faster than young men are moving right … ",
    "url": "https://www.axios.com/2024/09/13/trump-harris-campaign-young-voters"
  }
]