[
  {
    "text": "What everyone should know about the new House Speaker, Mike Johnson  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  On Wednesday, after weeks of chaos, House Republicans unanimously selected Congressman Mike Johnson (R-LA) as the new Speaker.  Compared to the previous Republican candidates … ",
    "url": "https://popular.info/p/what-everyone-should-know-about-the"
  },
  {
    "text": "Playbook: What's in store for Speaker Johnson  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  LATEST IN MAINE — Lewiston Sun Journal: “At least 16 people were killed and dozens more injured in multiple shootings here Wednesday night, in what is likely the deadliest shooting in Maine's history.”",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/26/whats-in-store-for-speaker-johnson-00123692"
  },
  {
    "text": "New speaker of the House Mike Johnson once wrote in support of the criminalization of gay sex  —  Speaker of the House Mike Johnson has a history of harsh anti-gay language from his time as an attorney for a socially conservative legal group in the mid-2000s.",
    "url": "https://www.cnn.com/2023/10/25/politics/mike-johnson-gay-sex-criminalization-kfile/"
  },
  {
    "text": "At least 16 dead, dozens wounded in Lewiston shootings; police give few details on overnight search for gunman  —  A commercial man lift falls off trailer and blocks Route 4 in Rangeley  —  Hundreds of new laws take effect in Maine Wednesday.  Here's what you need to know",
    "url": "https://www.sunjournal.com/2023/10/25/multiple-victims-reported-following-shootings-in-lewiston/"
  },
  {
    "text": "Maine mass shootings: Police scour Lewiston for suspect  —  Hundreds of police fanned out across the state of Maine hunting for a man wanted in connection with mass shootings at a bar and a bowling alley in the town of Lewiston, as news outlets reported a death toll ranging from 16 to 22, with dozens more wounded.",
    "url": "https://www.reuters.com/world/us/police-scour-maine-man-sought-lewiston-mass-shootings-2023-10-26/"
  },
  {
    "text": "At Least 16 Killed in Maine Shootings With Suspect at Large  —  A man opened fire at a bowling alley and a bar in Lewiston, Maine, on Wednesday night, killing at least 16 people and engulfing the state's second-largest city in chaos.  The suspect remained at large as authorities ordered residents … ",
    "url": "https://www.bloomberg.com/en/news/thp/2023-10-26/urgent-police-say-there-s-an-active-shooter-in-lewiston-maine-and-they-are-investigating-multiple-scenes"
  },
  {
    "text": "ACLU sides with Trump, argues Jan. 6 case gag order is unconstitutional  —  The American Civil Liberties Union (ACLU) on Wednesday urged the judge overseeing former President Trump's federal 2020 election criminal case in D.C. to reevaluate her gag order, arguing it is unconstitutionally over-broad and vague.",
    "url": "https://thehill.com/regulation/court-battles/4275146-aclu-trump-jan-6-gag-order-unconstitutional/"
  },
  {
    "text": "Judge orders Trump to take the stand in N.Y. fraud trial, fines him $10,000 for violating gag order again  —  Trump was called to testify for the first time in the New York trial and was fined $10,000 for violating his gag order again.  —  Donald Trump stormed out of a Manhattan courtroom Wednesday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-orders-trump-take-stand-ny-fraud-trial-fines-10000-violating-gag-rcna122199"
  },
  {
    "text": "Colo. judge rejects Trump's bid to toss lawsuit aimed at keeping him off 2024 ballot  —  The lawsuit seeks to bar the former president from the state's 2024 ballot over his connection to the Jan. 6, 2021, riot at the U.S. Capitol.  —  A Colorado judge on Wednesday denied the latest attempt … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/colo-judge-rejects-trumps-bid-toss-lawsuit-aimed-keeping-2024-ballot-rcna122281"
  },
  {
    "text": "Justice Thomas Did Not Repay Substantial Portion of $267,230 Loan, Finance Committee Investigation Reveals; Failed to Report Forgiven Debt on Ethics Filings, Raising Questions About Tax Compliance  —  Documents Show Businessman Forgave the Loan, which Thomas used to Purchase a Luxury RV",
    "url": "https://www.finance.senate.gov/chairmans-news/justice-thomas-did-not-repay-substantial-portion-of-267230-loan-finance-committee-investigation-reveals-failed-to-report-forgiven-debt-on-ethics-filings-raising-questions-about-tax-compliance"
  },
  {
    "text": "The inmates elect their new asylum leader  —  Also: Bellingcat's Eliot Higgins on the golden age of Twitter disinformation.  —  ∙ Paid … The latter part of this newsletter features a Q&A with Bellingcat's Eliot Higgins.  But before we get to that, I want to share some quick thoughts on the new House speaker.",
    "url": "https://www.publicnotice.co/p/speaker-maga-mike-johnson-explained"
  },
  {
    "text": "U.S. economy grows at blockbuster pace in third quarter  —  GDP grew at an annual rate of 4.9 percent from July to September, the highest reading since 2021  —  The U.S. economy grew by an annual rate of 4.9 percent in the third quarter, the strongest pace since 2021, as spending … ",
    "url": "https://www.washingtonpost.com/business/2023/10/26/gdp-third-quarter-economy-growth/"
  },
  {
    "text": "Texas Lawmakers Vote to Let Local Police Arrest Migrants  —  The proposal, which has now cleared both houses of the Legislature, poses a direct challenge to the federal government's authority over policing the borders.  —  In a direct challenge to federal power over immigration … ",
    "url": "https://www.nytimes.com/2023/10/26/us/texas-house-border-migrants-arrest.html"
  },
  {
    "text": "Bowman pleads guilty to misdemeanor for pulling fire alarm in House office building  —  Rep. Jamaal Bowman (D-N.Y.) pleaded guilty to one misdemeanor for falsely pulling a fire alarm in the Cannon House Office Building last month ahead of a key House vote.  —  Bowman appeared … ",
    "url": "https://thehill.com/regulation/court-battles/4276452-bowman-pleads-guilty-to-misdemeanor-for-pulling-fire-alarm-in-house-office-building/"
  },
  {
    "text": "DeSantis is right about terrorist sympathizers  —  Gov. Ron DeSantis (R-FL) took a hard stance against foreign nationals in the United States promoting terrorism.  Since the brutal Oct. 7 Hamas attack on southern Israel that left over 1,400 civilians dead, people have been protesting in major American cities in favor of Hamas.",
    "url": "https://www.washingtonexaminer.com/restoring-america/patriotism-unity/desantis-is-right-about-terrorist-sympathizers"
  },
  {
    "text": "Virginia Republicans Look to Neutralize Abortion as an Election Issue  —  The state's governor, Glenn Youngkin, has a strategy to win the state.  If it halts Democrats' momentum on the issue, it could be a model for the party in 2024.  —  Abortion has been a losing issue at the polls … ",
    "url": "https://www.nytimes.com/2023/10/26/us/politics/abortion-virginia-republicans-youngkin.html"
  }
]