[
  {
    "text": "The Big Companies Funding Trump's Inauguration Despite Denouncing Jan. 6  —  The second Trump inaugural fund is on track to be the most lucrative yet  —  Four years ago, dozens of companies denounced the invasion of the U.S. Capitol and pledged to withhold support from those who disputed the 2020 election results.",
    "url": "https://www.wsj.com/business/trump-inauguration-sponsors-large-company-donations-a3cc1b92?st=gUfJeV&reflink=article_copyURL_share"
  },
  {
    "text": "Companies Are Scrambling to Fund Trump's Inauguration.  He's Keeping Track  —  The president-elect is expected to raise more money than ever for his second inauguration.  He's keeping tabs on who's donating — and who hasn't",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-companies-fund-inauguration-1235217360/"
  },
  {
    "text": "Playbook: Mr. Musk goes to Washington  —  Presented by With help from Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  Merry Christmas and happy Hanukkah from Playbook's resident Jew, filling in today while the usual authors take a well-deserved respite under the tree.",
    "url": "https://www.politico.com/newsletters/playbook/2024/12/25/mr-musk-goes-to-washington-00196031"
  },
  {
    "text": "Biden pledges more U.S. arms to Ukraine after Russia's Christmas attack … - At least one person in the eastern Dnipropetrovsk region died and six others in Kharkiv were injured during the attacks, according to local officials.  —  What they're saying: “The purpose of this outrageous attack … ",
    "url": "https://www.axios.com/2024/12/26/russia-christmas-attack-ukraine-biden-us-weapons"
  },
  {
    "text": "Statement from President Joe Biden on Russia's Overnight Aerial Attacks against  —  In the early hours of Christmas, Russia launched waves of missiles and drones against Ukrainian cities and critical energy infrastructure.  The purpose of this outrageous attack was to cut off … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/25/statement-from-president-joe-biden-on-russias-overnight-aerial-attacks-against/"
  },
  {
    "text": "‘I Probably Could Have Flipped Over a Few More Tables’  —  Outgoing Rep. Cori Bush gets candid about her time in Congress and how progressives should respond to 2024.  —  Rep. Cori Bush was swept into office in 2020 on a wave of liberal energy, defeating a longtime Democratic incumbent … ",
    "url": "https://www.politico.com/news/magazine/2024/12/25/cori-bush-congress-exit-interview-00195630"
  },
  {
    "text": "At CNN, lower TV ratings and heightened anxieties about what's ahead  —  With traditional viewership on a decline, the cable news network leans into its strong digital presence as it heads into uncertain times covering the second Trump administration.  —  If you had to guess which member … ",
    "url": "https://www.washingtonpost.com/style/media/2024/12/25/cnn-ratings-decline-trump/"
  },
  {
    "text": "Trump Threatens to Take Over Canada, Panama Canal, Greenland in Christmas Day Message  —  The president-elect referred to Prime Minister Justin Trudeau as the “Governor” of Canada  —  President-elect Donald Trump has once again repeated his desires for U.S. territorial expansion.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-canada-panama-canal-greenland-1235217402/"
  },
  {
    "text": "Mark Zuckerberg and Meta got a big win.  They have the House GOP to thank.  —  The billionaire and his company needed Speaker Mike Johnson's help to stop legislation that would have regulated social media for the first time.  —  In the waning days of 2024, Facebook founder Mark Zuckerberg … ",
    "url": "https://www.politico.com/news/2024/12/25/mark-zuckerberg-meta-congress-bill-00195958"
  },
  {
    "text": "New Mexico's Governor Was A Liberal Hero.  Then She Got Blunt about Crime.  —  Gov. Michelle Lujan Grisham has clashed with her own party over how to tackle the nexus of addiction, mental illness and violence in New Mexico.  —  The New Mexico governor's mansion sits on a hilltop in Santa Fe, roughly 7,100 feet above sea level.",
    "url": "https://www.nytimes.com/2024/12/25/business/new-mexico-michelle-grisham-crime.html"
  },
  {
    "text": "Trump and his allies say the GOP is the party of free speech.  Their actions say otherwise.  —  For them, free speech means they get to shout the loudest and silence everyone who disagrees with them.  —  If you listened to President-elect Donald Trump and his Republican allies during the campaign … ",
    "url": "https://www.msnbc.com/top-stories/latest/trump-free-speech-hypocrisy-rcna184445"
  },
  {
    "text": "Biden signs a bill officially making the bald eagle the national bird of the US  —  The bald eagle, a symbol of the power and strength of the United States for more than 240 years, earned an overdue honor on Tuesday: It officially became the country's national bird.",
    "url": "https://apnews.com/article/biden-bill-sign-bald-eagle-bird-national-7d9ae832ac8d249891d5daf11bf3ceb2"
  },
  {
    "text": "How to have a Trumpy Christmas, and make the president-elect richer, too  —  Donald Trump is profiting off his election in unprecedented ways as his family business sells $92 MAGA hat Christmas ornaments and $22 golden wrapping paper.  —  The Trump Store has a gift for every patriot on your Christmas list.",
    "url": "https://www.washingtonpost.com/politics/2024/12/25/how-have-trumpy-christmas-make-president-elect-richer-too/"
  },
  {
    "text": "Bonds forged during a wartime Christmas 83 years ago could soon be at risk  —  CNN  —  Editor's Note: This story was originally published in CNN's Meanwhile in America, the email about US politics for global readers.  —  Next year will bring new strains to the transatlantic alliance … ",
    "url": "https://www.cnn.com/2024/12/24/politics/fdr-churchill-christmas-1941-analysis"
  },
  {
    "text": "Judge Strikes Down Portions of Arkansas Law That Threatened Librarians  —  Republicans passed the law in 2023, joining other conservative states and counties that have sought to restrict the availability of certain books.  —  A federal judge has struck down portions of an Arkansas law … ",
    "url": "https://www.nytimes.com/2024/12/24/us/arkansas-book-ban-law.html?unlocked_article_code=1.kE4.ef5d.WkGT7NCFTUcN&smid=nytcore-ios-share&referringSource=articleShare"
  }
]