[
  {
    "text": "How Far Trump Would Go  —  The former President, at Mar-a-Lago on April 12, is rallying the right at home and seeking common cause with autocratic leaders abroad.Photograph by Philip Montgomery for TIME  —  Donald Trump thinks he's identified a crucial mistake of his first term: He was too nice.",
    "url": "https://time.com/6972021/donald-trump-2024-election-interview/"
  },
  {
    "text": "‘Frustrated’ ex-Trump aide says she won't vote for former president  —  Sarah Matthews, an ex-staffer of former President Trump, said Monday she would not cast her vote in November for Trump, signaling she could instead vote for President Biden.  —  “When we have a candidate on the ballot … ",
    "url": "https://thehill.com/homenews/campaign/4632165-sarah-matthews-former-donald-trump-aide-vote-joe-biden-2024/"
  },
  {
    "text": "Kristi Noem doubled down on dog-killing to win over MAGA — now her story is backfiring in her face  —  South Dakota's governor gets the sadism of Trump supporters, but screws up by saying the quiet parts out loud  —  Squint hard enough and perhaps one can see how Gov. Kristi Noem, R-S.D. … ",
    "url": "https://www.salon.com/2024/04/30/kristi-noem-doubled-down-on-dog-to-win-over-maga--now-her-story-is-backfiring-in-her-face/"
  },
  {
    "text": "The biggest political deception of 2024  —  In the 2024 presidential election, one of the central attacks that Trump and his political allies are levying against Biden is that Biden is responsible for a “migrant crime” wave.  The argument was summarized by Trump in a March 22 video:",
    "url": "https://popular.info/p/the-biggest-political-deception-of"
  },
  {
    "text": "FBI data shows America is seeing a ‘considerable’ drop in crime.  Trump says the opposite.  —  Jeff Asher is a New Orleans-based crime data analyst who has worked at the CIA and Department of Defense.  He leans towards caution when describing trends in his line of work.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/30/trump-crime-fbi-data-murder-statistics/73443631007/"
  },
  {
    "text": "Trump, Venting About Lawyer in His Criminal Trial, Seeks More Aggression  —  Todd Blanche upended his career to represent Donald J. Trump and has been the former president's favorite.  But Mr. Trump has made him a focus of his episodic wrath.  —  Donald J. Trump's Manhattan criminal trial … ",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/trump-trial-todd-blanche.html"
  },
  {
    "text": "Trump Faces Possible $10,000 Contempt Fine as Trial Resumes  —  As Donald J. Trump's criminal trial enters its third week, new witnesses will appear and the judge will weigh a request to hold him in contempt for violating his gag order.  —  As Donald J. Trump's Manhattan criminal trial enters … ",
    "url": "https://www.nytimes.com/2024/04/30/nyregion/trump-hush-money-trial.html"
  },
  {
    "text": "Trump Holds Edge Over Biden in Seven Key Swing State Polls  —  Home Polls Trump Holds Edge Over Biden in Seven Key Swing State Polls  —  Democrats Maintain Lead over Republicans in Five Senate Races  —  New Emerson College Polling/The Hill swing state polls find President Biden trailing … ",
    "url": "https://emersoncollegepolling.com/trump-holds-edge-over-biden-in-seven-key-swing-state-polls/"
  },
  {
    "text": "Ted Cruz Wants Airlines to Keep Your Cash When They Cancel Your Flight  —  Cruz and three other congressional lawmakers offered legislation that could undermine the Biden administration's new airline refund rule  —  AFTER THE BIDEN administration issued a final rule last week … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ted-cruz-airlines-automatic-refunds-faa-reauthorization-1235012248/"
  },
  {
    "text": "GOP lawmakers say Marjorie Taylor Greene's motion to vacate has fizzled … - “Even trolls online have said they don't want it,” one member told Axios.  — “I dont think she's going to do it - I think that window for her has passed,” another argued.",
    "url": "https://www.axios.com/2024/04/30/marjorie-taylor-greene-johnson-motion-vacate-gop"
  },
  {
    "text": "Former NSA Employee Sentenced to Over 21 Years in Prison for Attempted Espionage  —  For Immediate Release  —  Jareh Sebastian Dalke, 32, of Colorado Springs, was sentenced today to 262 months in prison for attempted espionage in connections with his efforts to transmit classified National … ",
    "url": "https://www.justice.gov/opa/pr/former-nsa-employee-sentenced-over-21-years-prison-attempted-espionage"
  },
  {
    "text": "Revealed: Tyson Foods dumps millions of pounds of toxic pollutants into US rivers and lakes  —  Nitrogen, phosphorus, chloride, oil and cyanide among the 371m lb of pollutants released by just 41 plants in five years  —  Nina Lakhani in Dakota City and Lexington, Nebraska, with graphics by Alvin Chang",
    "url": "https://www.theguardian.com/environment/2024/apr/30/tyson-foods-toxic-pollutants-lakes-rivers"
  },
  {
    "text": "Senate Democrats unveil Big Oil report after 3-year investigation … - The joint 66-page report from the Senate Budget and House Oversight Committees claims some of the largest oil companies have internally acknowledged since the 1960s that fossil fuels cause climate change.",
    "url": "https://www.axios.com/2024/04/30/senate-democrats-big-oil-report-climate-change"
  },
  {
    "text": "Yet another dubious election deadline maneuver, in Florida  —  The retirement-announcement two-step strikes again  —  Rep. Bill Posey (R-Fla.) staunchly supported challenging the 2020 election results in the run-up to Jan. 6, 2021.  “Running fair and transparent elections is something America must live up to,” he said that day.",
    "url": "https://www.washingtonpost.com/politics/2024/04/29/yet-another-dubious-election-deadline-maneuver-florida/"
  },
  {
    "text": "India's Modi government operated ‘nest of spies’ in Australia before being disrupted by ASIO  —  abc.net.au/news/modi-government- operated-nest-of-spies-in-australia-/ 103786892  —  Indian spies were kicked out of Australia after being caught trying to steal secrets about sensitive defence projects … ",
    "url": "https://www.abc.net.au/news/2024-04-30/modi-government-operated-nest-of-spies-in-australia-/103786892"
  },
  {
    "text": "Hunter Biden demands that Fox News remove ‘intimate’ images from its platforms  —  Hunter Biden is demanding that Fox News remove from its platforms sexually explicit images that President Joe Biden's son says are private, according to a letter obtained by CNN, as part of his strategy to publicly fight back against conservative media.",
    "url": "https://www.cnn.com/2024/04/29/politics/hunter-biden-fox-letter/"
  },
  {
    "text": "Why an Immunity Ruling in Trump's Favor Might Not Alter the Shape of His Trial  —  Prosecutors believe Donald J. Trump's official acts in trying to overturn the election should be admissible evidence even if the Supreme Court rules they cannot be the basis of the charges.",
    "url": "https://www.nytimes.com/2024/04/29/us/politics/immunity-trump-supreme-court.html"
  },
  {
    "text": "The Maryland Senate race testing Democrats' commitment to diversity  —  David Trone says his money would free up national Democrats to focus on other states — but Angela Alsobrooks would make history.  —  Nearly every major Democrat in Maryland is lining up behind Angela Alsobrooks' attempt … ",
    "url": "https://www.politico.com/news/2024/04/30/maryland-senate-democrat-primary-00155060"
  },
  {
    "text": "Can former CNN pundit John Avlon flip a Long Island congressional seat blue with his West Wing throwback politics?  —  It was a Saturday afternoon in mid-March, and John Avlon was comparing himself to a Norman Rockwell painting.  “You know,” he told me, the one where “there's the guy standing … ",
    "url": "https://nymag.com/intelligencer/article/john-avlon-district-1-ny.html"
  }
]