[
  {
    "text": "Republican-appointed judges raise alarm over Trump attacks on law  —  Federal D.C. Judge Reggie B. Walton warned Trump's attacks on hush-money trial judge and others could lead to violence.  Reagan, Bush-appointed judges decry Jan. 6 revisionism, threats.  —  A Republican-appointed judge … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/03/29/trump-judge-attacks-violence/"
  },
  {
    "text": "Federal judge warns of Trump's attacks in extraordinary rebuke  —  A sitting federal judge on Thursday harshly criticized Donald Trump's attacks on the judge overseeing the former president's criminal case tied to alleged hush money payments, telling CNN that such statements threaten the viability of the American legal system.",
    "url": "https://www.cnn.com/2024/03/29/politics/federal-judge-donald-trump-rebuke/"
  },
  {
    "text": "The Trump Docket: A forgotten legal battle is about to rear its ugly head  —  Ghosts from Donald Trump's presidential past are coming back to haunt him personally and in just a few short weeks, a case that could soon involve allegations of assault and battery and intentional infliction … ",
    "url": "https://lawandcrime.com/high-profile/the-trump-docket-a-forgotten-legal-battle-is-about-to-rear-its-ugly-head/"
  },
  {
    "text": "Trump Posts Image of Joe Biden Kidnapped And Bound With Rope  —  Trump signals approval of violent imagery targeting his political opponents  —  On Truth Social, Trump posted a video of Trump themed vehicles driving in New York.  One of the trucks has an image of Joe Biden on the back bound with rope,.",
    "url": "https://www.meidastouch.com/news/trump-posts-image-of-joe-biden-kidnapped-and-bound-with-rope"
  },
  {
    "text": "Donald Trump shares image of Joe Biden with hands and feet tied  —  Former president Donald Trump disseminated on social media on Friday an image of President Biden with his hands and feet tied, the latest example of the Republican candidate's use of increasingly violent rhetoric and imagery this campaign season.",
    "url": "https://www.washingtonpost.com/politics/2024/03/29/donald-trump-joe-biden-bound-and-gagged/"
  },
  {
    "text": "Family of Brian Sicknick, D.C. officer who died after Jan. 6 riot, slam Trump attending wake for NYPD cop Jonathan Diller  —  The father and brother of Brian Sicknick, the police officer who died during the Jan. 6, 2021 riots at the U.S. Capitol, blasted Donald Trump's appearance at a wake Thursday … ",
    "url": "https://www.nydailynews.com/2024/03/29/family-of-brian-sicknick-d-c-officer-who-died-after-jan-6-riot-slam-trump-attending-wake-for-nypd-cop-jonathan-diller/"
  },
  {
    "text": "‘In office forever’: Trump's Project 2025 partner calls for ending presidential term limit  —  Conservatives are advocating to repeal the U.S. Amendment that limits presidential terms, prompting President Joe Biden's campaign to warn an election year victory for former President Donald Trump … ",
    "url": "https://www.rawstory.com/trump-term-limits/"
  },
  {
    "text": "Federal judge strikes down county lines for this year's election  —  Quraishi agrees with Kim that county lines represent irreparable harm to candidates  —  In a monumental decision released today, U.S. District Judge Zahid Quraishi struck down the county organizational line … ",
    "url": "https://newjerseyglobe.com/judiciary/quraishi-overturns-the-county-line/"
  },
  {
    "text": "RFK Jr.'s campaign is celebrating Cesar Chavez Day.  The labor icon's family is not having it  —  During the 1980 presidential primaries, Fernando Chavez traveled for months with Robert F. Kennedy Jr. as they worked on the presidential campaign of his uncle Sen. Ted Kennedy.",
    "url": "https://www.latimes.com/politics/story/2024-03-29/cesar-chavez-robert-f-kennedy-jr-rk-campaign"
  },
  {
    "text": "Best Buy offers to screen LGBTQ nonprofit donations after conservative pressure, filing shows  —  In an email exchange with a conservative think tank, tucked into an SEC filing, the electronics retailer offered to screen its employee groups' donations to LGBTQ causes.",
    "url": "https://www.nbcnews.com/nbc-out/out-news/best-buy-offers-screen-lgbtq-nonprofit-donations-conservative-pressure-rcna145603"
  },
  {
    "text": "Trump stays silent on detained U.S. reporter as he avoids criticizing Putin  —  Trump has consistently gone out of his way to avoid criticizing the Russian president and routinely demonizes reporters  —  Former president Donald Trump, the presumptive Republican nominee … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/29/trump-gershkovich-putin-journalist/"
  },
  {
    "text": "Gov. Hochul asked to leave wake for slain NYPD Officer Jonathan Diller  —  Gov. Kathy Hochul was asked to leave the wake for slain NYPD Officer Jonathan Diller on Friday afternoon.  —  Hochul arrived at the Massapequa Funeral Home on Long Island for the second day of viewings around 1:45 p.m.",
    "url": "https://nypost.com/2024/03/29/us-news/kathy-hochul-asked-to-leave-slain-nypd-officer-jonathan-dillers-wake/"
  },
  {
    "text": "Hogan Pressed For Bigger Ships, Despite Safety Warnings  —  Days after a massive cargo ship collided with the Francis Scott Key Bridge in Baltimore, Republican U.S. Senate candidate Larry Hogan called for the federal government to foot the bill for the bridge's reconstruction.",
    "url": "https://www.levernews.com/hogan-pressed-for-bigger-ships-despite-safety-warnings/"
  },
  {
    "text": "NYC's AI Chatbot Tells Businesses to Break the Law  —  The Microsoft-powered bot says bosses can take workers' tips and that landlords can discriminate based on source of income … In October, New York City announced a plan to harness the power of artificial intelligence to improve the business of government.",
    "url": "https://themarkup.org/news/2024/03/29/nycs-ai-chatbot-tells-businesses-to-break-the-law"
  },
  {
    "text": "Exclusive poll: Americans strongly back abortion pill access, FDA drug powers … - But the public is split almost evenly on obtaining pills through the mail, which is among the FDA permissions that anti-abortion doctors are challenging at high court.  — 6 in 10 strongly or somewhat agree … ",
    "url": "https://www.axios.com/2024/03/29/abortion-pill-supreme-court-case-poll"
  },
  {
    "text": "Louis Gossett Jr., 1st Black man to win supporting actor Oscar, dies at 87  —  Louis Gossett Jr., the first Black man to win a supporting actor Oscar and an Emmy winner for his role in the seminal TV miniseries “Roots,” has died.  He was 87.  —  Gossett's first cousin Neal L. Gossett told … ",
    "url": "https://apnews.com/article/louis-gossett-jr-dies-1e86e1441ec8b614a282f3de22490a07"
  },
  {
    "text": "Rudy Giuliani begs bankruptcy court to let him keep his Florida condo so he can keep podcasting to pay creditors  —  When Rudy Giuliani defamed two poll workers with bunk allegations of election fraud in 2020, it triggered a wave of threats so acute, one of the workers was forced to flee her longtime home in Georgia.",
    "url": "https://lawandcrime.com/uncategorized/rudy-giuliani-begs-bankruptcy-court-to-let-him-keep-his-florida-condo-so-he-can-keep-podcasting-to-pay-creditors/"
  },
  {
    "text": "Georgia lawmakers make it easier to challenge a voter's registration  —  Legislators change state laws including increasing documentation officials need to certify elections  —  The fight for democracy is supported by  —  Georgia legislators changed state election laws in the midnight hours of Friday … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/29/georgia-state-election-law-changes"
  },
  {
    "text": "Lizzo accusers' attorney: DNC ‘shameful’ for hiring Lizzo for fundraiser  —  Thank you for signing up!  —  The Scoop Entertainment Newsletter  —  Submit … (NewsNation) — An attorney for Lizzo's former backu p dancers, Arianna Davis, Crystal Williams and Noelle Rodriguez … ",
    "url": "https://www.newsnationnow.com/entertainment-news/lizzo-victims-attorney-dnc-shameful-hiring-disgusting-lizzo-for-funder/"
  },
  {
    "text": "All three of John Fetterman's top communications staffers have resigned in the last month  —  Clout learns there's been some serious turnover in Sen. John Fetterman's office.  In the last month, all three of Fetterman's top communications staffers have left Capitol Hill.Nick Gavio … ",
    "url": "https://www.inquirer.com/politics/clout/john-fetterman-staffers-joe-cavello-20240329.html"
  },
  {
    "text": "Inflation, Immigration Rank Among Top U.S. Issue Concerns  —  Worry about illegal immigration and terrorism has increased most over past year among 14 issues rated  —  WASHINGTON, D.C. — Amid the heightened numbers of migrants entering the United States at the Southern border and discord … ",
    "url": "https://news.gallup.com/poll/642887/inflation-immigration-rank-among-top-issue-concerns.aspx"
  },
  {
    "text": "Americans Really Don't Like Trump's Health-Care Plans  —  Health care may turn out to be a major winning issue for Democrats.  —  Expanding access to health care has been a shared policy priority for Joe Biden and the former Democratic presidents who joined him onstage at a lucrative … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/03/biden-winning-health-care-trump/677912/"
  }
]