[
  {
    "text": "A Polling Risk for Trump  —  His advantage may not be as stable as it looks.  —  The polls have shown Donald Trump with an edge for eight straight months, but there's a sign his advantage might not be quite as stable as it looks: His lead is built on gains among voters who aren't paying close attention … ",
    "url": "https://www.nytimes.com/2024/05/24/briefing/a-polling-risk-for-trump.html"
  },
  {
    "text": "The Shaky Foundation of Trump's Lead: Disengaged Voters  —  The Biden team faces questions of its own: Why have these voters backed away from him, and can his campaign find a way to reach them?  —  The polls have shown Donald J. Trump with an edge for eight straight months … ",
    "url": "https://www.nytimes.com/2024/05/24/upshot/trump-biden-polls-voters.html"
  },
  {
    "text": "Robert De Niro Narrates an Anti-Trump Ad for Biden  —  The ad uses the actor's distinctive voice to try to remind voters of the chaos of Donald Trump's presidency and warn them about a second Trump term.  —  President Biden's campaign released a new ad on Friday narrated by the actor Robert De Niro … ",
    "url": "https://www.nytimes.com/2024/05/24/us/politics/robert-deniro-trump-biden-ad.html"
  },
  {
    "text": "Even Donald Trump has trouble getting New York's attention  —  The former president came to the Bronx on Thursday night for an unusual campaign rally.  The Bronx didn't take much notice.  —  NEW YORK — You could hear Donald Trump sporadically through the trees.",
    "url": "https://www.washingtonpost.com/politics/2024/05/24/even-donald-trump-has-trouble-getting-new-yorks-attention/"
  },
  {
    "text": "What If Trump Is Right About America?  —  1. Donny from the Bronx  —  One of the Trump campaign's beliefs about 2024 is that the the former president's criminal indictments will help him with black voters.  The theory is, since Trump is an (alleged) criminal, many black people who are also criminals(?), will begin to support him.",
    "url": "https://www.thebulwark.com/p/what-if-trump-is-right-about-america"
  },
  {
    "text": "Exclusive: Putin wants Ukraine ceasefire on current frontlines  —  Russian President Vladimir Putin is ready to halt the war in Ukraine with a negotiated ceasefire that recognises the current battlefield lines, four Russian sources told Reuters, saying he is prepared to fight on if Kyiv and the West do not respond.",
    "url": "https://www.reuters.com/world/europe/putin-wants-ukraine-ceasefire-current-frontlines-sources-say-2024-05-24/"
  },
  {
    "text": "Playbook: Rick Scott plots the ultimate McConnell revenge  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  ABOUT LAST NIGHT — DONALD TRUMP's rally in the Bronx last night featured many of his greatest hits — touting his record, slamming JOE BIDEN … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/24/rick-scott-plots-the-ultimate-mcconnell-revenge-00159853"
  },
  {
    "text": "Trump isn't joking about serving 3 or more terms  —  He wouldn't leave power willingly the first time.  He won't if he returns to power. … During Donald Trump's first term, Republicans dismissed well-founded concerns that he wouldn't leave office willingly as “silly.”  And then January 6 happened.",
    "url": "https://www.publicnotice.co/p/trump-third-term-nra-speech-dallas"
  },
  {
    "text": "IDF recovers bodies of three hostages from north Gaza, who were killed on October 7  —  Military says it recently got intel confirming Orión Hernández Radoux, Hanan Yablonka, Michel Nisenbaum were kidnapped near Mefalsim, murdered there or en route to Gaza in Hamas onslaught",
    "url": "https://www.timesofisrael.com/idf-recovers-bodies-of-three-hostages-from-north-gaza-who-were-killed-on-october-7/"
  },
  {
    "text": "Republican Rep's Daughter and Son-in-Law Killed in Haiti Gang Attack  —  ‘MY HEART IS BROKEN’  —  “I've never felt this kind of pain,” Ben Baker wrote on Facebook on Friday.  —  Missouri state Rep. Ben Baker said Friday that his “heart is broken in a thousand pieces” … ",
    "url": "https://www.thedailybeast.com/missouri-state-rep-ben-bakers-daughter-son-in-law-killed-in-haiti"
  },
  {
    "text": "At least 66 members of far-right group in rural Oregon standing for office  —  Revealed: anti-government People's Rights Network, founded by Ammon Bundy, appearing to follow ‘entryism’ strategy  —  At least 66 members of an anti-government group founded by far-right militia figure Ammon Bundy … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/24/people-rights-network-oregon-elections"
  },
  {
    "text": "Red Flag Warning  —  Lordy, there's a second flag.  And it's worse than the first.  —  To kick things off, a quick refresher.  Last time on Justices Gone Rogue, Alito was confronted with reports of a U.S. flag flying upside down at his home, just 11 days after the January 6th attack.",
    "url": "https://statuskuo.substack.com/p/red-flag-warning"
  },
  {
    "text": "‘Just a scandal’: Jamie Raskin envisions radical overhaul of Supreme Court  —  Rep. Jamie Raskin (D-MD) called for a radical overhaul of the scandal-plagued U.S. Supreme Court.  —  The court has been rocked by ethics scandals - particularly those involving justices Clarence Thomas and Samuel Alito … ",
    "url": "https://www.rawstory.com/supreme-court-reform/"
  },
  {
    "text": "The odds, the stakes and the scariest media news I saw all week  —  On the great divide in how Americans get their news and how it affects their political views  —  First off, thanks so much to quite a few new subscribers, who made it clear that they care — a lot — about how the news media is dealing with threats to democracy.",
    "url": "https://margaretsullivan.substack.com/p/the-odds-the-stakes-and-the-scariest"
  },
  {
    "text": "Trump says he would ‘absolutely’ have Navarro back if reelected  —  Former President Trump said he would “absolutely” rehire his former White House adviser Peter Navarro if reelected in November, despite Navarro currently being in prison.  Navarro is two months into his four-month sentence … ",
    "url": "https://thehill.com/regulation/court-battles/4684155-trump-navarro-back-reelected/"
  },
  {
    "text": "Trump Has Already Sown Doubts About the 2024 Election Results  —  Former President Donald J. Trump has baselessly and publicly cast doubt about the fairness of the 2024 election about once a day, on average, since he announced his candidacy for president, according to an analysis by The New York Times.",
    "url": "https://www.nytimes.com/interactive/2024/05/24/us/politics/trump-election-results-doubt.html"
  },
  {
    "text": "Are Russia and North Korea planning an ‘October surprise’ that aids Trump?  —  U.S. officials are bracing for Pyongyang to take military actions close to the U.S. presidential election, possibly at the urging of Vladimir Putin.  —  WASHINGTON — The Biden administration is increasingly concerned … ",
    "url": "https://www.nbcnews.com/news/investigations/are-russia-north-korea-planning-october-surprise-aids-trump-rcna153828"
  },
  {
    "text": "Media Matters Lays Off a Dozen Staffers Amid Elon Musk Lawsuit  —  ‘LEGAL ASSAULT’  —  The liberal media watchdog let go of a number of veteran researchers and writers on Thursday as it faces a number of legal threats from Musk and Republicans.  —  Months after edgelord billionaire Elon Musk launched a … ",
    "url": "https://www.thedailybeast.com/media-matters-lays-off-a-dozen-staffers-amid-elon-musk-lawsuit"
  }
]