[
  {
    "text": "Trump to pause enforcement of law banning bribery of foreign officials … - CNBC Councils  — CNBC on Peacock  — Join the CNBC Panel  — Supply Chain Values  — Select Shopping  — Ad Choices  — News Tips  —  Got a confidential news tip?  We want to hear from you.",
    "url": "https://www.cnbc.com/2025/02/10/trump-doj-foreign-corrupt-practices-act-pause.html"
  },
  {
    "text": "Scoop: Trump planning to pardon Rod Blagojevich … - Blagojevich, who was a Democrat while in office, supported Trump in the 2024 election and attended the Republican National Convention.  — The former governor defended Trump after Trump was indicted in the New York hush money case and likened Trump's legal problems to his own.",
    "url": "https://www.axios.com/2025/02/10/trump-pardon-rod-blagojevich"
  },
  {
    "text": "The federal judge in Rhode Island said the Trump administration had failed to comply with his order unfreezing billions of dollars in federal grants.  —  A federal judge on Monday said the White House has defied his order to release billions of dollars in federal grants … ",
    "url": "https://www.nytimes.com/2025/02/10/us/trump-unfreezing-federal-grants-judge-ruling.html?unlocked_article_code=1.v04.xIcU.OwbtX7agS7FL&smid=url-share"
  },
  {
    "text": "The Courts Blocked Trump's Federal Funding Freeze.  Agencies Are Withholding Money Anyway.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  When the federal courts first blocked … ",
    "url": "https://www.propublica.org/article/trump-administration-funding-freeze-workarounds"
  },
  {
    "text": "Federal judge halts Trump administration cuts to NIH research payments in 22 states  —  Attorneys general seek court order to halt 15% cap on research overhead costs  —  Attorneys general representing 22 states sued the Trump administration on Monday, asking a federal judge to temporarily block … ",
    "url": "https://www.statnews.com/2025/02/10/nih-indirect-costs-lawsuit-state-attorneys-general-sue-to-block-research-spending-cuts/"
  },
  {
    "text": "Justice Dept. Seeks Dismissal of Federal Corruption Case Against Adams  —  The New York City mayor cultivated a close relationship with President Trump, who said they had both been persecuted.  —  The Justice Department on Monday told federal prosecutors in Manhattan to drop the corruption charges … ",
    "url": "https://www.nytimes.com/2025/02/10/nyregion/eric-adams-charges-doj-trump.html?unlocked_article_code=1.v04.xV7N.XsN0iYwQoAJQ"
  },
  {
    "text": "Justice officials tell prosecutors to drop charges against N.Y. Mayor Eric Adams  —  A top Justice official said New York Mayor Eric Adams should not have to face trial given his reelection campaign and the fight against crime and illegal immigration.  —  NEW YORK — The Justice Department … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/10/new-york-mayor-eric-adams-charges-drop-justice/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5MTYzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwNTQ1OTk5LCJpYXQiOjE3MzkxNjM2MDAsImp0aSI6ImRiOWM0MTQzLThmNTEtNDc1MS1iYjQ4LWExZTExZjE1MWY2MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzEwL25ldy15b3JrLW1heW9yLWVyaWMtYWRhbXMtY2hhcmdlcy1kcm9wLWp1c3RpY2UvIn0.p61-pFMCc_DX6FHdZVTMWKeNScpO1EC8ghdzkgWDCFw&itid=gfta"
  },
  {
    "text": "19-year-old Musk surrogate has State Department email address  —  The move illustrates that Elon Musk's U.S. DOGE Service aides are being asked to fulfill multiple roles at once.",
    "url": "https://www.washingtonpost.com/business/2025/02/10/musk-doge-state-department-surrogate/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5MTYzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwNTQ1OTk5LCJpYXQiOjE3MzkxNjM2MDAsImp0aSI6IjRiNjg2NDU1LTI5MWUtNGJhNS1hMTEyLTgwYjU0MmQzMWYxYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzEwL211c2stZG9nZS1zdGF0ZS1kZXBhcnRtZW50LXN1cnJvZ2F0ZS8ifQ.WQGnPJJFbq3W4fuvq3tZXdbERXUkuXikg8hmmMMI7Ss&itid=gfta"
  },
  {
    "text": "Trump's Actions Have Created a Constitutional Crisis, Scholars Say  —  Law professors have long debated what the term means.  But now many have concluded that the nation faces a reckoning as President Trump tests the boundaries of executive power.  —  There is no universally accepted definition … ",
    "url": "https://www.nytimes.com/2025/02/10/us/politics/trump-constitutional-crisis.html?unlocked_article_code=1.v04.x4i1.WILJBjRGOlrC&smid=url-share"
  },
  {
    "text": "Military Drops Recruiting Efforts at Prestigious Black Engineering Awards Event  —  The Army and other service branches are abandoning recruiting efforts at a prestigious Black engineering event this week, turning down access to a key pool of highly qualified potential applicants amid President … ",
    "url": "https://www.military.com/daily-news/2025/02/10/military-drops-recruiting-efforts-prestigious-black-engineering-awards-event.html"
  },
  {
    "text": "Trump removes Government Ethics Office director  —  It's the latest in Trump's efforts to remove people charged with oversight of his administration.  —  President Donald Trump has removed the director of the Office of Government Ethics, an official tasked with ensuring government workers comply … ",
    "url": "https://www.politico.com/news/2025/02/10/trump-removes-government-ethics-office-director-00203418"
  },
  {
    "text": "Exclusive |  Elon Musk-Led Group Makes $97.4 Billion Bid for Control of OpenAI  —  The unsolicited offer complicates Sam Altman's plans to convert OpenAI to a for-profit company.",
    "url": "https://www.wsj.com/tech/elon-musk-openai-bid-4af12827?st=j5pQRs&reflink=article_copyURL_share"
  },
  {
    "text": "Vance out of the country ahead of Gabbard confirmation vote  —  Senate Republicans might need Vice President JD Vance to help confirm Tulsi Gabbard to be the director of national intelligence — even as he's out of the country for a series of previously scheduled events and meetings.",
    "url": "https://www.politico.com/live-updates/2025/02/10/congress/jd-vance-gabbard-confirmation-00203406"
  },
  {
    "text": "Trump Imposes Global 25% Steel, Aluminum Tariffs  —  ‘This is the beginning of making America rich again,’ president says  —  WASHINGTON—President Trump on Monday announced 25% tariffs on imports of steel and aluminum to the U.S., reinstating global duties without exceptions for allies such as Canada … ",
    "url": "https://www.wsj.com/politics/policy/trump-imposes-global-25-steel-aluminum-tariffs-49df0110"
  },
  {
    "text": "Trump reveals whether he sees JD Vance as his successor  —  President Donald Trump sits down with Fox News anchor Bret Baier for an exclusive interview.",
    "url": "https://www.foxnews.com/video/6368618661112"
  },
  {
    "text": "Robert Rubin, Lawrence Summers, Timothy Geithner, Jacob Lew, Janet Yellen: DOGE Is a Threat to U.S. Democracy.  —  When we had the honor of being sworn in as the 70th, 71st, 75th, 76th and 78th secretaries of the Treasury, we took an oath to support and defend the United States Constitution.",
    "url": "https://www.nytimes.com/2025/02/10/opinion/treasure-secretaries-doge-musk.html?unlocked_article_code=1.v04.xpIv.R1v_8atRr8zP&smid=url-share"
  },
  {
    "text": "The NSA's “Big Delete”  —  Today, the National Security Agency (NSA) is planning a “Big Delete” of websites and internal network content that contain any of 27 banned words, including “privilege,” “bias,” and “inclusion.”  The “Big Delete,” according to an NSA source and internal correspondence reviewed … ",
    "url": "https://popular.info/p/the-nsas-big-delete"
  },
  {
    "text": "USAID watchdog warns of lack of oversight of $8.2 billion in unspent aid after Trump moves  —  The U.S. Agency for International Development has lost almost all ability to track $8.2 billion in unspent humanitarian aid after the Trump administration's foreign funding freeze and idling of staff, a government watchdog warned Monday.",
    "url": "https://www.therepublic.com/2025/02/10/usaid-watchdog-warns-of-lack-of-oversight-of-8-2-billion-in-unspent-aid-after-trump-moves/"
  },
  {
    "text": "Judge extends freeze on Trump's unprecedented plan to get millions of federal workers to resign  —  U.S. District Judge George A. O'Toole Jr. said the pause would continue until he ruled on the legality of Trump's “deferred resignation” plan.  —  A federal judge in Boston on Monday continued … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-extends-freeze-trumps-unprecedented-plan-get-millions-federal-wo-rcna191542"
  },
  {
    "text": "Tesla Is Elon Musk's Soft Underbelly  —  Tesla's brand is toxic and its sales are in the toilet.  That's how you hurt Musk.  —  ∙ Paid  —  1. Consequences  —  Tesla sales have fallen off a cliff.  —  This fact is satisfying on moral, spiritual, and psychosexual levels.",
    "url": "https://www.thebulwark.com/p/tesla-is-elon-musks-soft-underbelly"
  },
  {
    "text": "Farmers on the hook for millions after Trump freezes USDA funds  —  The White House had repeatedly said the funding freeze would not impact benefits that go directly to individuals.  —  Farmers report missing millions of dollars of funding they were promised by the U.S. Agriculture Department … ",
    "url": "https://www.washingtonpost.com/nation/2025/02/10/farmers-agriculture-funding-frozen/"
  },
  {
    "text": "Democracy is Crumbling.  Is Anybody Doing Anything?  —  This past weekend a federal district court in Massachusetts issued a nationwide injunction ordering Elon Musk and his team of young tech supremacists to stop accessing payment and other systems at the Department of Treasury … ",
    "url": "https://sherrilyn.substack.com/p/democracy-is-crumbling-is-anybody"
  },
  {
    "text": "The GOP Says They Love Elon.  Privately, They're Expressing Concerns.  —  REPUBLICANS IN CONGRESS HAVE WIDELY praised Elon Musk as he's gone about restructuring and in certain cases eliminating entire parts of the government.  —  But in private, they've expressed quite a different perspective … ",
    "url": "https://www.thebulwark.com/p/the-gop-says-they-love-elon-privately"
  },
  {
    "text": "Scoop: FBI finds secret JFK assassination records after Trump order … - The existence of the new documents was disclosed Friday to the White House, when the Office of the Director of National Intelligence submitted its plan to disclose the assassination records under Trump's order.",
    "url": "https://www.axios.com/2025/02/10/trump-jfk-assassination-records"
  },
  {
    "text": "Why many Republicans think shrinking Medicaid will make it better  —  Congressional leaders are looking to make big reductions to federal spending to pay for President Trump's priorities, and they've singled out Medicaid as a program where they could find significant savings.",
    "url": "https://www.npr.org/sections/shots-health-news/2025/02/10/nx-s1-5289001/trump-republicans-medicaid-proposals"
  }
]