[
  {
    "text": "Not Hyperbole Anymore: Musk Is In Charge of the US Government  —  These are wild times at TPM because they're wild times in the American government.  It's hard to keep up with everything happening from one moment to the next.  I had not had a chance to look at the new DOGE executive order President signed … ",
    "url": "https://talkingpointsmemo.com/edblog/not-hyperbole-anymore-musk-is-in-charge-of-the-us-government"
  },
  {
    "text": "Implementing The President's “Department of Government Efficiency” Workforce Optimization Initiative  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/02/implementing-the-presidents-department-of-government-efficiency-workforce-optimization-initiative/"
  },
  {
    "text": "Trump Softens Tone on Inflation After Pledging to Lower Prices  —  President Trump pledged to lower costs on “Day 1” as a candidate.  His administration now acknowledges it will take more time.  —  President Trump promised voters that, if elected, he would enact policies that would bring prices down on “Day 1” in office.",
    "url": "https://www.nytimes.com/2025/02/12/business/trump-inflation-prices.html"
  },
  {
    "text": "Consumer prices rise 0.5% in January, higher than expected as annual rate rises to 3% … WATCH NOW  —  Inflation perked up more than anticipated in January, providing further incentive for the Federal Reserve to hold the line on interest rates.  —  The consumer price index … ",
    "url": "https://www.cnbc.com/2025/02/12/cpi-january-2025.html"
  },
  {
    "text": "AP statement on Oval Office access  —  The Associated Press issued this statement on Tuesday from Executive Editor Julie Pace:  —  As a global news organization, The Associated Press informs billions of people around the world every day with factual, nonpartisan journalism.",
    "url": "https://www.ap.org/the-definitive-source/announcements/ap-statement-on-oval-office-access/"
  },
  {
    "text": "Dozens of CFPB Workers Fired in After-Hours Blitz  —  Some affected employees of the Consumer Financial Protection Bureau were notified with an email that addressed them as [EmployeeFirstName][EmployeeLastName], [Job Title], [Division].  —  Dozens of Consumer Finance Protection Bureau employees … ",
    "url": "https://www.wired.com/story/dozens-of-cfpb-workers-terminated-in-after-hours-firing-blitz/"
  },
  {
    "text": "Live Updates: Musk Asserts Without Proof That He's Fixing a Bureaucracy Rife With Fraud  —  The billionaire, chosen by President Trump to lead a federal overhaul, insisted he was working transparently, but his team's secretive actions have delivered shocks across the government.",
    "url": "https://www.nytimes.com/live/2025/02/11/us/president-trump-news?unlocked_article_code=1.wE4.WfgP.YTN1EGV1bPtM&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Scoop: Dems “pissed” at liberal groups MoveOn, Indivisible … - “People are pissed,” a senior House Democrat who was at the meeting said of lawmakers' reaction to the calls.  — The Democrat said Jeffries himself is “very frustrated” at the groups, who are trying to stir up a more confrontational opposition to Trump.",
    "url": "https://www.axios.com/2025/02/12/democrats-jeffries-move-on-indivisible-trump"
  },
  {
    "text": "Trump fires USAID inspector general one day after blistering report  —  Paul K. Martin, appointed by President Joe Biden, was dismissed a day after issuing a report assessing the Trump administration implemented its aid freeze and stop-work order.  —  February 11, 2025",
    "url": "https://www.washingtonpost.com/politics/2025/02/11/trump-fires-usaid-inspector-general/"
  },
  {
    "text": "Hegseth's visit to U.S. base in Germany met with student walkout  —  The civil disobedience by dozens of middle schoolers — and some adults — was aimed at the Trump administration's rollback of DEI initiatives.  —  February 11, 2025  —  Live updates: Trump signs executive order calling on agencies to work with Elon Musk-led group",
    "url": "https://www.washingtonpost.com/national-security/2025/02/11/hegseth-dei-protests-germany/"
  },
  {
    "text": "Project 2025 Is Gutting Medical Funding That Helped Russell Vought's Own Kid  —  The National Institutes of Health, the federal government's leading medical research agency, came under attack by Project 2025 well before its architect, Russell Vought, was confirmed to Donald Trump's second-term cabinet … ",
    "url": "https://www.motherjones.com/politics/2025/02/project-2025-vought-medical-funding/"
  },
  {
    "text": "US Republicans find unity on taxes a heavy lift in Trump ‘golden age’  —  Barely a month after predicting a new “golden age” under President Donald Trump, congressional Republicans are struggling to move forward on the president's tax-cut agenda, despite their control of both the Senate and House of Representatives.",
    "url": "https://www.reuters.com/world/us/us-republicans-find-unity-taxes-heavy-lift-trump-golden-age-2025-02-12/"
  },
  {
    "text": "Treasury officials: Musk ally ‘mistakenly’ had power to alter payments system  —  The incident prompted an internal forensic investigation that remains ongoing.  —  Treasury Department officials said Tuesday that the agency last week “mistakenly” and “briefly” gave a member of Elon Musk's team … ",
    "url": "https://www.politico.com/news/2025/02/11/musk-ally-mistakenly-power-alter-payments-system-00203714"
  },
  {
    "text": "This obscure law is one reason Trump's agenda keeps losing in court  —  Lawsuits challenging Trump policies raise big constitutional questions, but they also rely on a law that requires the government to follow the correct procedures when changing course.  —  WASHINGTON — Lawyers challenging … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-losing-court-boring-reason-adminitrative-procedure-act-rcna191113"
  },
  {
    "text": "Trump's feared DOJ enforcer has a secret: He, too, investigated Jan. 6  —  The acting DOJ official behind a potential witch hunt against prosecutors and FBI agents who investigated the Capitol riot worked on Jan. 6 cases himself.  —  In the months after the Jan. 6 attacks … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trumps-feared-doj-enforcer-secret-investigated-jan-6-rcna191796"
  },
  {
    "text": "Voters Were Right About the Economy.  The Data Was Wrong.  —  Here's why unemployment is higher, wages are lower and growth less robust than government statistics suggest.  —  Before the presidential election, many Democrats were puzzled by the seeming disconnect between “economic reality” … ",
    "url": "https://www.politico.com/news/magazine/2025/02/11/democrats-tricked-strong-economy-00203464"
  },
  {
    "text": "Cutting Cancer Research  —  Sometimes, it gets personal.  —  My daughter is finishing up a master's degree.  Her work is completely over my head, but it involves the intersection of nutrition, agriculture, and climate change. … In other words, she's doing important work, real work that could help make many lives better.",
    "url": "https://joycevance.substack.com/p/cutting-cancer-research"
  },
  {
    "text": "Trump Humiliated in the ‘Most Powerless Image Ever’ of a U.S. President: O'Donnell  —  Trump has always craved is the attention of the “truly rich,” and how he finally has it, MSNBC's Lawrence O'Donnell said.",
    "url": "https://www.thedailybeast.com/lawrence-odonnell-musk-humiliates-trump-in-most-powerless-image-ever/"
  },
  {
    "text": "Americans Are Actually in a Position to Make Elon Musk Feel Our Rage  —  The company is in a precarious position.  This is a case where buying choices can effectively communicate rage.  —  There are myriad reasons to loathe Elon Musk, the CEO of Tesla, who has become a top ally of Donald Trump.",
    "url": "https://slate.com/business/2025/02/elon-musk-tesla-stock-valuation-consumer-boycott.html"
  },
  {
    "text": "Why the COVID Deniers Won  —  Lessons from the pandemic and its aftermath  —  Five years ago, the coronavirus pandemic struck a bitterly divided society.  —  Americans first diverged over how dangerous the disease was: just a flu (as President Donald Trump repeatedly insisted) or something much deadlier.",
    "url": "https://www.theatlantic.com/magazine/archive/2025/03/covid-deniers-anti-vax-public-health-politics-polarization/681435/"
  },
  {
    "text": "USAID Kept My Troops Safe in Afghanistan  —  IN 2008, I DEPLOYED TO AFGHANISTAN for the first time on a Provincial Reconstruction Team.  Our group included active-duty airmen and soldiers as well as reservists and guardsmen.  But the linchpin of our team was our USAID embed, David.",
    "url": "https://www.thebulwark.com/p/usaid-kept-my-troops-safe-in-afghanistan"
  },
  {
    "text": "How Mexico's Leader Is Writing the Playbook for Handling Trump  —  President Claudia Sheinbaum impressed Trump by sticking to her guns without antagonizing him  —  MEXICO CITY—When President Trump called her last week, President Claudia Sheinbaum was prepared to speak with a U.S. leader who wouldn't yield on tariffs.",
    "url": "https://www.wsj.com/world/americas/mexico-sheinbaum-trump-tariffs-conversation-b9ce80cd"
  },
  {
    "text": "Top FEMA Official Is Fired Over Payments for N.Y.C. Migrant Shelters  —  The Trump administration fired the Federal Emergency Management Agency's chief financial officer and three others after Elon Musk misleadingly claimed the agency had used disaster-relief funds for migrant services.",
    "url": "https://www.nytimes.com/2025/02/11/nyregion/fema-fired-nyc-migrant-hotels.html"
  },
  {
    "text": "Egypt's President Sisi to stay away from White House if Gaza displacement on agenda  —  Egypt's President Abdel Fattah al-Sisi will not travel to Washington for talks at the White House as long as the agenda includes U.S. President Donald Trump's plan to displace Palestinians from Gaza, two Egyptian security sources said.",
    "url": "https://www.reuters.com/world/africa/egypts-president-sisi-not-attend-any-white-house-talks-if-gaza-displacement-2025-02-12/"
  },
  {
    "text": "The Staffers Helping Elon Musk Dismantle and Downsize the U.S. Government, One Agency at a Time  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  The Trump administration is not even a month old … ",
    "url": "https://www.propublica.org/article/elon-musk-doge-staffers-additional-names"
  },
  {
    "text": "It's a Good Thing Democrats Didn't Pack the Courts  —  Without an independent judiciary, the Constitution would be no match for Donald Trump's authoritarian impulses.  —  As disturbing as the first three weeks of the second Donald Trump administration have been, we can take solace … ",
    "url": "https://washingtonmonthly.com/2025/02/12/its-a-good-thing-democrats-didnt-pack-the-courts/"
  },
  {
    "text": "Danish MEP slams ‘absurd’ proposal to rename Greenland ‘Red, White and Blueland’  —  Member of Congress said the U.S. will “proudly welcome” Greenlanders to “join the freest nation to ever exist.”  —  A Danish MEP denounced a proposal by an American lawmaker to rename Greenland “Red … ",
    "url": "https://www.politico.eu/article/donald-trump-greenland-red-white-and-blueland-anders-vistisen/"
  }
]