[
  {
    "text": "Behind the Curtain: Trump's conviction scenario  —  Former President Trump is breezing to the GOP nomination — but, in private, is bracing for the genuine possibility that he'll be the first convicted felon in U.S. history to represent a major party.",
    "url": "https://www.axios.com/2024/02/02/trump-conviction-trial-jan-6-court"
  },
  {
    "text": "Trump Is Inching Closer to the Worst Legal Defeat of his Life  —  It sure looks like Trump's business empire is about to get hammered.  —  Former President Donald Trump has suffered through plenty of painful courtroom defeats during his lengthy career as one of America's most litigious businessmen.",
    "url": "https://www.vice.com/en/article/g5yn8x/trump-is-inching-closer-to-the-worst-legal-defeat-of-his-life"
  },
  {
    "text": "Trump's Former Finance Chief in Negotiations to Plead Guilty to Perjury  —  Allen H. Weisselberg would admit to lying on the stand during the former president's civil fraud trial, according to people familiar with the talks.  —  Allen H. Weisselberg, a longtime lieutenant to Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/02/01/nyregion/weisselberg-perjury-trump-fraud.html"
  },
  {
    "text": "Trump PAC Paid to Investigate Stupidity of Trump's Own Lawyers  —  Donald Trump's fans paid for his revenge lawsuits, a private defamation case, his bail, and many more legal headaches.  But they also paid to investigate his lawyers. … As Donald Trump fights off four criminal indictments … ",
    "url": "https://www.thedailybeast.com/trump-pac-paid-to-investigate-stupidity-of-trumps-own-lawyers"
  },
  {
    "text": "What Biden *really* says about Trump behind closed doors  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  With help from producer Raymond Rapada.  —  President JOE BIDEN has a reputation for salty language behind closed doors.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/02/01/what-biden-really-says-about-trump-behind-closed-doors-00139178"
  },
  {
    "text": "U.S. Voters: Biden, Most in House Don't Deserve Another Term  —  WASHINGTON, D.C. — Fewer than four in 10 U.S. registered voters say President Joe Biden deserves to be reelected, while less than a quarter say the same about most members of the U.S. House.  As is almost always the case … ",
    "url": "https://news.gallup.com/poll/609602/voters-biden-house-don-deserve-term.aspx"
  },
  {
    "text": "Inside Biden's obsession with “Morning Joe”  —  When White House aides appear on MSNBC's “Morning Joe,” they're often booked between 7 and 7:40 a.m. ET.  That's so they'll reach one crucial and loyal viewer: President Biden. … - During the day, Biden has long asked his staff whether they saw a story … ",
    "url": "https://www.axios.com/2024/02/02/biden-obsession-morning-joe-msnbc-media"
  },
  {
    "text": "New report points to blockbuster U.S. job growth as 2024 begins  —  By every metric, the latest jobs report points to an incredibly strong U.S. job market.  The political implications have the potential to be dramatic.  —  Expectations heading into this morning showed projections … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/new-report-points-blockbuster-us-job-growth-2023-begins-rcna136921"
  },
  {
    "text": "U.S. economy added 353,000 jobs in January, much better than expected  — Nonfarm payrolls expanded by 353,000 for the month, better than the Dow Jones estimate for 185,000.  The unemployment rate held at 3.7%, against the estimate for 3.8%.  — Average hourly earnings increased 0.6%, double the monthly estimate.",
    "url": "https://www.cnbc.com/2024/02/02/us-economy-added-353000-jobs-in-january-much-better-than-expected.html"
  },
  {
    "text": "Special counsel questioned witnesses about 2 rooms FBI didn't search inside Trump's Mar-a-Lago residence: Sources  —  The FBI missed the rooms in their search for classified documents, said sources.  —  In this June 9, 2017, file photo, President Donald Trump is shown at the White House in Washington, D.C.",
    "url": "https://abcnews.go.com/US/special-counsel-questioned-witnesses-2-rooms-fbi-search/story?id=106826552"
  },
  {
    "text": "He Was Accused of Sexual Misconduct.  Then Trump Hired Him.  Then He Was Indicted in Mar-a-Lago Case.  —  Trump body man Walt Nauta is a critical figure in the Mar-a-Lago documents case.  Trump only hired him after Nauta was dismissed from the White House after sexual harassment claims.",
    "url": "https://www.thedailybeast.com/walt-nauta-was-accused-of-sexual-misconduct-then-trump-hired-him-then-he-was-indicted-in-mar-a-lago-case"
  },
  {
    "text": "House Democrats continue to do the legislative heavy lifting  —  When the House passed a $78 billion tax package, it was members of the Democratic minority who provided most of the votes.  This keeps happening.  —  As awful as the current Congress is, it would be an overstatement to argue … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/house-democrats-continue-legislative-heavy-lifting-rcna136749"
  },
  {
    "text": "Christian Ziegler Told His Wife to ‘Hunt’ For Sex Partners  —  New police records also show Ziegler's Google searches for “OnlyFans” and the average settlement amount for sexual battery.  —  Former Florida GOP chair Christian Ziegler and his wife, Bridget—known for promoting “family values” … ",
    "url": "https://www.thedailybeast.com/christian-ziegler-told-his-wife-to-hunt-for-sex-partners"
  },
  {
    "text": "Fani Willis, the DA who charged Trump in Georgia, subpoenaed by House GOP  —  House Judiciary Committee Chairman Jim Jordan says Fulton County District Attorney Fani Willis has failed to comply with two earlier requests for documents.  —  WASHINGTON — House Judiciary Committee Chairman Jim Jordan … ",
    "url": "https://www.nbcnews.com/politics/congress/fani-willis-da-charged-trump-georgia-subpoenaed-house-gop-rcna136683"
  },
  {
    "text": "Wisconsin redistricting experts tell Supreme Court Republican map proposals are gerrymanders  —  Consultants hired by the Wisconsin Supreme Court to examine maps redrawing state legislative districts said Thursday that plans submitted by the Republican Legislature and a conservative law firm … ",
    "url": "https://apnews.com/article/wisconsin-redistricting-legislature-5bc5c0347b26a40fd615f4faf7583b46"
  },
  {
    "text": "Inflation has fallen.  Why are groceries still so expensive?  —  Ongoing supply chain disruptions, droughts, avian flu, labor shortage and more continue to keep grocery prices high  —  Americans are finally getting a break from inflation, with prices for gasoline, used cars and health insurance … ",
    "url": "https://www.washingtonpost.com/business/2024/02/02/grocery-price-inflation-biden/"
  },
  {
    "text": "Ken Paxton's lawlessness previews Trump's second term  —  And it's terrifying. … Last May, the Texas House voted 121-23 to impeach Attorney General Ken Paxton.  The following September, after a sustained pressure campaign by his political allies and donors, he was acquitted by the Senate of all the charges.",
    "url": "https://www.publicnotice.co/p/ken-paxton-trump-texas-supreme-court-explained"
  },
  {
    "text": "Wall Street Journal shakes up D.C. bureau with big layoffs  —  The Wall Street Journal took a hatchet to its Washington bureau on Thursday, laying off roughly 20 staffers in a restructuring that adds to a brutal start to 2024 for the journalism industry.  —  The cuts focused … ",
    "url": "https://www.washingtonpost.com/style/media/2024/02/01/wall-street-journal-shakes-up-dc-bureau-with-big-layoffs/"
  },
  {
    "text": "Speaker Mike Johnson's Favorite Way to Dodge Questions: Answering the Phone  —  Speaker Mike Johnson, who once routinely stopped for hallway interviews, has taken to pressing his iPhone to his ear as he walks through the Capitol, avoiding questions as he navigates a tough new job.",
    "url": "https://www.nytimes.com/2024/02/02/us/politics/mike-johnson-speaker-phone.html"
  },
  {
    "text": "The Knives Are Already Out in the Trump VP Race  —  The jockeying between two top Republicans to be Trump's No. 2 has gotten dirty, and fast, as the GOP primary wraps up. … WATCH YOUR BACK  —  As the race for the Republican presidential nomination cools down, the race to be Donald Trump's running mate … ",
    "url": "https://www.thedailybeast.com/the-knives-are-already-out-in-the-trump-2024-vp-race"
  },
  {
    "text": "Andy Kim leads Tammy Murphy by double digits in NJ Senate race, poll says  —  The race to replace Bob Menendez is a test of the Garden State's unique party boss system.  —  Rep. Andy Kim is the leading candidate for Senate in New Jersey, with a double-digit lead over his chief rival … ",
    "url": "https://www.politico.com/news/2024/02/02/poll-andy-kim-tammy-murphy-00139064"
  },
  {
    "text": "Ex-CIA hacker who leaked secrets to WikiLeaks gets 40 years in prison  —  A former CIA software engineer who was convicted of carrying out the largest data breach in the agency's history was sentenced to 40 years in prison on Thursday, the Department of Justice announced.",
    "url": "https://www.axios.com/2024/02/02/cia-hacker-wikileaks-joshua-schulte-sentenced"
  },
  {
    "text": "123 passengers sickened aboard cruise ship: CDC  —  More than 100 passengers and crew aboard a Queen Victoria cruise ship have fallen sick with a gastrointestinal illness, the Centers for Disease Control and Prevention (CDC) reported.  —  The Cunard Cruise Line ship departed on Jan. 22 … ",
    "url": "https://thehill.com/policy/healthcare/4443658-123-passengers-sickened-aboard-cruise-ship-cdc/"
  }
]