[
  {
    "text": "Why Nikki Haley isn't dropping out of the GOP presidential race  —  Nikki Haley's team is bracing for a home state embarrassment in South Carolina's Republican presidential primary on Saturday.  Conventional wisdom suggests she'll be forced to drop out.  But that may not apply in 2024.",
    "url": "https://apnews.com/article/nikki-haley-president-trump-interview-takeaways-b1eeeab91bd644d39ae575200592ceb2"
  },
  {
    "text": "Haley vows not to drop out, calls Trump ‘meaner and more offensive by the day’  —  The former South Carolina governor says she isn't going anywhere, will stay in “until the last person votes.”  —  GREENVILLE, S.C. — Nikki Haley cast herself on Tuesday as a steadfast candidate of last resort … ",
    "url": "https://www.politico.com/news/2024/02/20/haley-trump-2024-message-00142233"
  },
  {
    "text": "Biden instructed aides to dial up attacks on Trump's wild comments  —  President Joe Biden personally directed his senior campaign aides in recent days to focus more aggressively on former President Donald Trump's inflammatory comments, according to two sources familiar with the president's edict.",
    "url": "https://www.cnn.com/2024/02/20/politics/joe-biden-donald-trump-wild-comments/"
  },
  {
    "text": "Trump allies prepare to infuse ‘Christian nationalism’ in second administration  —  Spearheading the effort is Russell Vought, president of The Center for Renewing America, part of a conservative consortium preparing for Trump's return to power.  —  Russell Vought is president of The Center … ",
    "url": "https://www.politico.com/news/2024/02/20/donald-trump-allies-christian-nationalism-00142086"
  },
  {
    "text": "Alito issues fiery 10-page dissent as Supreme Court declines to review elite high school admissions case  —  Justices Samuel Alito and Clarence Thomas said the high court should have heard a case challenging admissions program of elite Virginia high school  —  Join Fox News for access to this content",
    "url": "https://www.foxnews.com/politics/alito-issues-fiery-10-page-dissent-supreme-court-declines-review-high-school-admissions-case"
  },
  {
    "text": "Supreme Court won't review sanctions against pro-Trump lawyers who filed frivolous 2020 election suits  —  The Supreme Court on Tuesday declined to revisit sanctions levied against two pro-Trump attorneys who filed frivolous lawsuits challenging the outcome of the 2020 election in Michigan.",
    "url": "https://www.cnn.com/2024/02/20/politics/sidney-powell-lin-wood-supreme-court/"
  },
  {
    "text": "California 2024 Poll: Schiff Continues to Lead U.S. Senate Primary with 28%  —  Home Polls California 2024 Poll: Schiff Continues to Lead U.S. Senate Primary with 28%  —  A new Emerson College Polling/Inside California Politics/The Hill survey finds Democratic Rep. Adam Schiff maintaining … ",
    "url": "https://emersoncollegepolling.com/california-2024-poll-schiff-continues-to-lead-u-s-senate-primary-with-28/"
  },
  {
    "text": "Alito says he was right to fear that opponents of gay marriage would be treated as bigots  —  The justice raised that complaint about a trial judge's dismissal of potential jurors in a workplace discrimination case.  —  WASHINGTON − Supreme Court Justice Samuel Alito attempted an … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/02/20/alito-jurors-homosexuality-sin/72672733007/"
  },
  {
    "text": "Justice Alito Renews Criticism of Landmark Ruling on Same-Sex Marriage  —  In a statement, the justice raised concerns that those with “traditional religious views” would be “'labeled as bigots and treated as such' by the government.”  —  Justice Samuel A. Alito Jr. on Tuesday renewed … ",
    "url": "https://www.nytimes.com/2024/02/20/us/alito-supreme-court-same-sex-marriage.html"
  },
  {
    "text": "“That makes him a mark”: Experts warn Trump could get desperate as his fraud appeal appears doomed  —  Experts worry what Trump may do as he is “scrambling to pay his bills” after $400+ million in judgments  —  Former President Donald Trump faces long odds if he tries to appeal the $355 fraud ruling against him, legal experts say.",
    "url": "https://www.salon.com/2024/02/20/that-makes-him-a-mark-experts-warn-could-get-desperate-as-his-fraud-appeal-appears-doomed/"
  },
  {
    "text": "Fani Willis turns the tables on her attackers  —  Fulton County, Ga., District Attorney Fani Willis took the stand last week under attack from Michael Roman, former henchman 0f four-times-indicted former president Donald Trump, and many in the media and legal community.",
    "url": "https://www.washingtonpost.com/opinions/2024/02/20/fani-willis-disqualification/"
  },
  {
    "text": "Oklahoma banned trans students from bathrooms.  Now a bullied student is dead after a fight  —  Nex Benedict died one day after a fight in a school bathroom.  Their mother Sue Benedict tells Bevan Hurley that the gender fluid teenager endured more than a year of abuse simply for being who they were",
    "url": "https://www.independent.co.uk/news/world/americas/nex-benedict-dead-oklahoma-b2499332.html"
  },
  {
    "text": "Notorious ransomware provider Lockbit taken over by law enforcement  —  Washington — A ransomware service provider that has targeted over 2,000 systems across the globe, including hospitals in the U.S., with demands for hundreds of millions of dollars was taken down Monday … ",
    "url": "https://www.cbsnews.com/news/lockbit-law-enforcement-takeover-ransomware/"
  },
  {
    "text": "Clarence Thomas has 30 days to resign if he wants millions from John Oliver  —  When it comes to Supreme Court reform, John Oliver is tired of just talking about term limits and ethics codes.  Instead, the late-night talk-show host said he's taking a page out of the playbook used by the rich and powerful … ",
    "url": "https://www.washingtonpost.com/style/2024/02/19/john-oliver-clarence-thomas-supreme-court-offer/"
  },
  {
    "text": "Keep your phone number private with Signal usernames  —  Signal's mission and sole focus is private communication.  For years, Signal has kept your messages private, your profile information (like your name and profile photo) private, your contacts private, and your groups private - among much else.",
    "url": "https://signal.org/blog/phone-number-privacy-usernames/"
  },
  {
    "text": "How Google is killing independent sites like ours  —  And why you shouldn't trust product recommendations from big media publishers ranking at the top of Google  —  Big media publishers are inundating the web with subpar product recommendations you can't trust",
    "url": "https://housefresh.com/david-vs-digital-goliaths/"
  },
  {
    "text": "Judge threatens ex-Trump aide Navarro with contempt in records fight  —  Trump's former trade adviser has claimed the documents were personal, but a federal judge says at least some of them must be returned to the government.  —  A federal judge threatened Tuesday to hold former Trump White … ",
    "url": "https://www.politico.com/news/2024/02/20/judge-trump-navarro-legal-00142196"
  },
  {
    "text": "Alex Jones Estate Liquidation Gets Sandy Hook Families' Vote  —  Search by Law Firm Search by Topic  —  The families of Sandy Hook school shooting victims voted overwhelmingly in favor of a plan to wrap up Alex Jones' bankruptcy proceedings by liquidating the right wing talk show host's assets.",
    "url": "https://news.bloomberglaw.com/bankruptcy-law/sandy-hook-families-vote-to-liquidate-alex-jones-bankrupt-estate"
  },
  {
    "text": "Aileen Cannon Might Actually Get Herself Kicked Off the Trump Classified Docs Case  —  The recent news about possible Russian space nukes reminds us that we live in a very insecure world.  That is why perhaps none of Donald Trump's four criminal cases is more troubling than the federal prosecution brought … ",
    "url": "https://slate.com/news-and-politics/2024/02/aileen-cannon-trump-classified-disqualification.html"
  },
  {
    "text": "Kari Lake can't say who ‘stole’ her election, says criticism of McCain was meant as a joke  —  In a radio interview, Lake also said she wouldn't support a federal abortion ban and characterized Ukraine's war against Russia as a lost cause.  —  A defensive Kari Lake acknowledged … ",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/02/20/kari-lake-news-senate-candidate-talks-elections-ukraine-and-abortion/72665895007/"
  },
  {
    "text": "'You're both traitors': Speaker Johnson's thumbs-up photo-op with Trump doesn't go well  —  House Speaker Mike Johnson made his pilgrimage to Mar-a-Lago for a photo-op with former President Donald Trump — but when he took it X Monday, it didn't get the kind of reception he'd hoped.",
    "url": "https://www.rawstory.com/trump-johnson-2667318263/"
  },
  {
    "text": "‘What you are seeing is done in third-world countries’: Librarians, schoolteachers could become felons as censorship law advances  —  As book bans continue to sweep the United States, public librarians, educators, schools and museums could soon be exposed to criminal prosecution for showing children … ",
    "url": "https://lawandcrime.com/high-profile/what-you-are-seeing-is-done-in-third-world-countries-librarians-schoolteachers-could-become-felons-as-censorship-law-advances/"
  },
  {
    "text": "Biden wants people to know most of the money he's seeking for Ukraine would be spent in the US  —  At a bustling construction site outside of Dallas, there are hopes that Congress can finally pass nearly $95 billion in foreign aid including funding for Ukraine — because factory jobs in the United States depend on that money.",
    "url": "https://apnews.com/article/biden-ukraine-johnson-factories-aid-62cbb83a184fd14b1573e25a73475767"
  }
]