[
  {
    "text": "Pro-Trump Arab American group changes its name after the president's Gaza ‘Riviera’ comments  —  A group that played a key role in Donald Trump's voter outreach to the Arab American community alongside his allies is rebranding itself after the president said that the U.S. would “take over” the Gaza Strip.",
    "url": "https://apnews.com/article/arab-americans-trump-gaza-name-peace-479f6777cac7bac52fb098daa0821cb5"
  },
  {
    "text": "Michigan's Arab American community offers muted response to Trump's Gaza takeover plan  —  Residents of the largest Arab American community in the U.S. had plenty to say during the 2024 presidential campaign about the roiling politics in the Middle East.  But after President Donald Trump's … ",
    "url": "https://apnews.com/article/trump-arab-americans-michigan-gaza-plan-6014edae5196aa5bc2c1681452ec4cf8"
  },
  {
    "text": "The Madness of Donald Trump  —  To Benjamin Netanyahu's delight, Trump proposes the wholesale ethnic cleansing of Gaza and the creation of a new “Riviera.”  —  More than five hundred years ago, Machiavelli, the philosopher of political practice and modern republicanism, suggested, in … ",
    "url": "https://www.newyorker.com/news/the-lede/the-madness-of-donald-trump"
  },
  {
    "text": "Inside Trump's Hastily Written Proposal to ‘Own’ Gaza  —  Although the president had been talking about the idea for weeks, there had been no meetings on the subject, and senior members of his government were taken by surprise.  —  When President Trump announced his proposal for the United States … ",
    "url": "https://www.nytimes.com/2025/02/05/us/politics/trump-gaza-takeover.html"
  },
  {
    "text": "Trump administration evicts former Coast Guard leader from her house with 3 hours notice  —  Trump fired Linda Fagan, the first female Coast Guard commandant, on his second day in office.  A Trump official told her she had three hours to leave her house on Tuesday.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-administration-evicts-former-coast-guard-linda-fagan-3-hours-rcna190820"
  },
  {
    "text": "Pam Bondi Instructs Trump DOJ to Criminally Investigate Companies That Do DEI  —  On Wednesday evening, newly installed Attorney General Pam Bondi sent staff in several divisions of the Department of Justice more than a dozen memos within a 15-minute span, laying out the agency's new policies … ",
    "url": "https://slate.com/news-and-politics/2025/02/pam-bondi-trump-doj-memo-prosecute-dei-companies.html"
  },
  {
    "text": "Trump administration agrees to restrict DOGE access to Treasury Department payment systems  —  The agreement came in response to a lawsuit accusing Treasury of committing an “unlawful action” by giving private info to Elon Musk's Department of Government Efficiency.",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-administration-agrees-restrict-doge-access-treasury-department-p-rcna190898"
  },
  {
    "text": "Judge weighs short-term block on Musk allies' ability to share Treasury records outside the department  —  A lawsuit alleges that the so-called Department of Government Efficiency is compromising Treasury's payment system.  —  A federal judge on Wednesday declined to immediately block … ",
    "url": "https://www.politico.com/news/2025/02/05/elon-musk-lawsuit-treasury-records-00202736"
  },
  {
    "text": "White House Says Musk Will Police His Own Conflicts of Interest  —  The White House said Elon Musk, the billionaire leading President Donald Trump's government cost-cutting efforts, will determine if there are conflicts of interest between his work reviewing federal spending and his overlapping empire of six companies.",
    "url": "https://www.bloomberg.com/news/articles/2025-02-05/white-house-says-musk-will-police-his-own-conflicts-of-interest?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczODc4OTIzOCwiZXhwIjoxNzM5Mzk0MDM4LCJhcnRpY2xlSWQiOiJTUjg3NTZEV1gyUFMwMCIsImJjb25uZWN0SWQiOiI1Q0UxNDZFN0UyMzA0RUM5OEIxOUI3MjU4M0NDNzM0MiJ9.wM3FV7fqGfrIqhAWCmEkoYviTEM1wCsisVNZLMqWZ_Y"
  },
  {
    "text": "Pam Bondi issued a flurry of orders on Day 1 as Trump's attorney general  —  Trump's newly sworn in AG released a series of directives.  —  Pam Bondi is officially in control of the Justice Department — and she's gone right to work.  —  President Donald Trump's attorney general issued … ",
    "url": "https://www.politico.com/news/2025/02/05/pam-bondi-issued-a-flurry-of-orders-on-day-1-as-trumps-attorney-general-00202756"
  },
  {
    "text": "Democrats To Take Over Senate Floor All Night To Oppose White House Budget Office Nominee  —  “He's the architect of the dismantling of our federal government,” Sen. Brian Schatz, one of dozens taking part in a 30-hour talkathon, said of Russell Vought.  —  LOADING",
    "url": "https://www.huffpost.com/entry/democrats-senate-floor-talkathon-oppose-russell-vought-omb_n_67a3b554e4b0bfc253ffc510"
  },
  {
    "text": "NOAA Employees Told to Pause Work With ‘Foreign Nationals’  —  An internal email obtained by WIRED shows that NOAA workers received orders to pause all “ALL INTERNATIONAL ENGAGEMENTS.”  —  A number of federal employees at the National Oceanic and Atmospheric Administration (NOAA) … ",
    "url": "https://www.wired.com/story/noaa-employees-foreign-nationals/"
  },
  {
    "text": "The Real Reason Musk Is Mad at Us  —  ELON MUSK, OUR NEW UNELECTED OVERLORD, is mad at Bill Kristol.  Very, very mad.  And because this is the world we live in now, his hordes of online minions are mad, too.  —  Let me explain.  This week, Elon has been amplifying several tweets alleging … ",
    "url": "https://www.thebulwark.com/p/the-real-reason-musk-is-mad-at-us"
  },
  {
    "text": "White House Orders C.I.A. to Send an Unclassified Email With Names of Some Employees  —  The list of partial names was provided in an effort to comply with an executive order to trim the federal work force.  —  The White House ordered the C.I.A. to send an unclassified email listing … ",
    "url": "https://www.nytimes.com/2025/02/05/us/politics/cia-names-list.html?unlocked_article_code=1.uk4.jLCR.AnsTfF5SjWV-&smid=url-share"
  },
  {
    "text": "DOGE Aides Search Medicare Agency Payment Systems for Fraud  —  Elon Musk's allies have been on site at Centers for Medicare and Medicaid Services offices this week  —  Representatives of Elon Musk's Department of Government Efficiency have been working at the Centers for Medicare and Medicaid Services … ",
    "url": "https://www.wsj.com/politics/elon-musk-doge-medicare-medicaid-fraud-e697b162?st=N9byaJ"
  },
  {
    "text": "Elon Musk Says His Efficiency Team Will Tackle F.A.A. Technology  —  His announcement comes after an outage last week to the primary system that provides pilots safety alerts in real time.  —  Elon Musk's team will now dig into the nation's aviation system, the Trump administration announced on Wednesday.",
    "url": "https://www.nytimes.com/2025/02/05/us/politics/elon-musk-doge-faa.html"
  },
  {
    "text": "Google Unwinds Employee Diversity Goals, Citing Trump's D.E.I. Orders  —  The Silicon Valley giant also said it was reviewing other diversity programs and initiatives and would update them if they seemed risky or ineffective.  —  Google tried for years to diversify its work force … ",
    "url": "https://www.nytimes.com/2025/02/05/technology/google-diversity-goals-dei-trump.html"
  },
  {
    "text": "List: Examples of Trump's Actions That Are Defying Legal Limits  —  Other presidents have occasionally claimed a constitutional right to bypass particular laws.  But in the opening weeks of his second term, President Trump and his administration have opened the throttle on blowing through … ",
    "url": "https://www.nytimes.com/interactive/2025/02/05/us/trump-agenda-defying-law.html"
  },
  {
    "text": "The World's Richest Men Take On the World's Poorest Children  —  The world's richest man is boasting about destroying the United States Agency for International Development, which saves the lives of the world's poorest children, saying he shoved it “into the wood chipper.”",
    "url": "https://www.nytimes.com/2025/02/05/opinion/usaid-spending-trump-musk.html?unlocked_article_code=1.u04.EThS.R3quQVZJl7sD&smid=url-share"
  },
  {
    "text": "Tesla's European Sales Drop in January After Musk Disrupts Politics There  —  The U.S. electric car company's sales are sliding across Europe, amid what many see as interference in local affairs by Tesla's chief executive, Elon Musk.  —  Tesla's sales in Germany plunged 59 percent in January … ",
    "url": "https://www.nytimes.com/2025/02/05/business/tesla-germany-elon-musk.html"
  },
  {
    "text": "The US is ‘no longer the America we used to know,’ warns Germany's Merz  —  Friedrich Merz, the frontrunner to become Germany's next leader, is “highly concerned” about recent developments in the United States under Donald Trump's second presidency.  —  The German chancellor candidate told … ",
    "url": "https://www.politico.eu/article/us-politics-germany-eu-europe-donald-trump-friedrich-merz-white-house/"
  },
  {
    "text": "Two Dem lawmakers barge into House speaker's office in backlash against Musk  —  Reps. Judy Chu (D-Calif.) and Gwen Moore (D-Wisc.) barged into House Speaker Mike Johnson's office unscheduled on Wednesday and challenged him about Elon Musk's team gaining access to a sensitive payment system at the Treasury Department.",
    "url": "https://www.politico.com/live-updates/2025/02/05/congress/two-dem-lawmakers-invade-house-speakers-office-in-backlash-against-musk-00202667"
  },
  {
    "text": "Republican ire at USAID finds an unusual target: Politico  —  Elon Musk and elected officials falsely said Politico was subsidized by the government.  Turns out, government officials were just paying for subscriptions.",
    "url": "https://www.washingtonpost.com/politics/2025/02/05/republican-ire-usaid-finds-an-unusual-target-politico/"
  },
  {
    "text": "Democrats' phones bombarded with calls to “fight harder” … - Sen. Richard Blumenthal (D-Conn.) told Axios: “What I think we need to do more is: Put the onus on Republicans, so that the calls that we're getting are directed toward Republicans.”  — “There has definitely been some tension … ",
    "url": "https://www.axios.com/2025/02/06/democrats-congress-trump-musk-doge-calls"
  },
  {
    "text": "L.A. Times Owner Has Financial Motivations for Boosting RFK Jr.  —  Dr. Patrick Soon-Shiong's biotech firm is preparing three applications needing approval from the Food and Drug Administration.  —  Robert F. Kennedy Jr. testifies during a Senate HELP Committee hearing for his pending confirmation … ",
    "url": "https://prospect.org/power/2025-02-05-la-times-owner-financial-motivations-boosting-rfk-jr/"
  },
  {
    "text": "Susan Collins Tells Reporters She Is ‘Concerned’ About Elon Musk's Power Over Federal Spending  —  Sen. Susan Collins (R-ME) told reporters on Capitol Hill Wednesday that she was concerned about Elon Musk unilaterally gutting USAID and seizing control over the Treasury Department's payment system.",
    "url": "https://www.mediaite.com/politics/susan-collins-tells-reporters-she-is-concerned-about-elon-musks-power-over-federal-spending/"
  },
  {
    "text": "‘My jaw dropped’: Ex-NSA workers stunned after museum covers names of women and minorities  —  President Donald Trump's sweeping anti-diversity executive action struck again - this time in the halls of the National Cryptologic Museum - where staff were ordered to cover up displays celebrating women … ",
    "url": "https://www.rawstory.com/trump-dei-2671104179/"
  }
]