[
  {
    "text": "Detroit synagogue president Samantha Woll found dead outside her home  —  A politically connected Detroit synagogue president was found stabbed dead this morning outside her home in the city's Lafayette Park neighborhood, east of downtown.  —  Samantha Woll, 40, led the Isaac Agree Downtown Detroit Synagogue … ",
    "url": "https://www.freep.com/story/news/local/michigan/detroit/2023/10/21/samantha-woll-dead-isaac-agree-downtown-detroit-synagogue-president/71271616007/"
  },
  {
    "text": "President of Detroit synagogue found stabbed to death outside home, police say  —  The president of a Detroit synagogue board was found dead Saturday morning with multiple stab wounds outside her home, police said.  —  The victim, Samantha Woll, was the president of the board … ",
    "url": "https://www.cnn.com/2023/10/21/us/detroit-synagogue-president-killing/"
  },
  {
    "text": "What to know about Speaker candidate Kevin Hern  —  The House GOP is in chaos amid attempts to elect a Speaker after Rep. Jim Jordan (R-Ohio) lost his third attempt at securing the gavel in a floor vote Friday.  —  Nine congressmen have stepped up for the job, or have signaled … ",
    "url": "https://thehill.com/homenews/house/4268915-kevin-hern-official-gop-speaker-bid/"
  },
  {
    "text": "GOP lawmaker urges Republicans to sign unity pledge to back eventual Speaker nominee  —  Rep. Mike Flood (R-Neb.) is urging his caucus to vote together as chaos over the House Speakership continues, launching a unity pledge for lawmakers to commit to a single candidate.",
    "url": "https://thehill.com/homenews/house/4268966-gop-unity-pledge-house-speaker-nominee/"
  },
  {
    "text": "Concerns about Jordan's election denialism flare during failed bid for speaker  —  As Rep. Jim Jordan (R-Ohio) waged his battle to become House speaker, some House Republicans were uncomfortable with the possibility of having an election denier occupying the most powerful legislative seat … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/20/jim-jordan-2020-election-denier-house-speaker/"
  },
  {
    "text": "Chesebro attorney argues client never believed Trump's ‘big lie’ of election fraud  —  Kenneth Chesebro, one of former President Trump's 18 co-defendants in the George election fraud case, didn't truly believe the 2020 election was stolen, according to his attorney.",
    "url": "https://thehill.com/regulation/court-battles/4268727-chesebro-attorney-client-never-believed-2020-election-fraud/"
  },
  {
    "text": "Back-to-back plea deals pose grave legal threat to Donald Trump  —  Two stalwart allies of former President Donald Trump flipped against him in the past 36 hours, a staggering turn of events that could now pose a grave threat to his ability to fend off criminal charges related to his efforts to overturn the 2020 presidential election.",
    "url": "https://www.cnn.com/2023/10/21/politics/chesebro-powell-plea-deals-trump-takeaways/"
  },
  {
    "text": "EXCLUSIVE: Israeli morgue worker says horrors inflicted on Hamas's victims are ‘worse than the Holocaust’ including decapitated pregnant woman and her beheaded unborn child  — Shari says the atrocities committed by Hamas are ‘worse than the Holocaust’  — She and her team spend 12 hours a day cleaning mutilated corpses",
    "url": "https://www.dailymail.co.uk/news/article-12653435/Israeli-morgue-worker-says-horrors-inflicted-Hamass-victims-worse-Holocaust-including-decapitated-pregnant-woman-beheaded-unborn-child.html"
  },
  {
    "text": "Google owes executive $1 million after losing gender bias lawsuit … A jury found Google guilty of sexual discrimination and awarded female Google Cloud executive Ulku Rowe, who filed the complaint, $1.1 million.  Rowe's lawsuit alleged that the company gave higher pay to less-experienced male cohorts … ",
    "url": "https://www.theverge.com/2023/10/21/23926501/google-cloud-lawsuit-ulku-rowe-verdict"
  },
  {
    "text": "7 influential accounts are warping Israel-Hamas news on X, researchers find  —  The University of Washington's Center for an Informed Public said that the most popular posts about the crisis revealed how news on the platform is “faster, more disorienting, and potentially more shaped by Musk himself.”",
    "url": "https://www.nbcnews.com/tech/social-media/7-accounts-warp-israel-hamas-war-news-x-musk-rcna121465"
  },
  {
    "text": "U.S. Marshals Searching for Fugitive Wanted for the Murder of a State Judge  —  Pedro Manuel Argote now the target of an interstate manhunt  —  For Immediate Release  —  District of Maryland  —  (410) 362-7550  —  Baltimore, MD - The U.S. Marshals Service is seeking the public's assistance … ",
    "url": "https://www.usmarshals.gov/news/press-release/us-marshals-searching-fugitive-wanted-murder-of-state-judge"
  },
  {
    "text": "Leading Democrats need to go to the White House to ask Biden and Harris to step aside  —  Playtime is over.  We have to put the toys away and have the adults in the room re-exert their authority.  —  It's one thing when the issues of the day are identity politics; “green” energy … ",
    "url": "https://thehill.com/opinion/white-house/4268156-leading-democrats-need-to-go-to-the-white-house-to-ask-biden-and-harris-to-step-aside/"
  },
  {
    "text": "Senior official: US, European countries pushing Israel to delay Gaza ground offensive  —  Western governments believe invasion may scuttle chances of further hostage releases; Biden publicly draws link between Hamas onslaught and efforts for Saudi-Israel normalization",
    "url": "https://www.timesofisrael.com/senior-official-us-european-countries-pushing-israel-to-delay-gaza-ground-offensive/"
  },
  {
    "text": "Bill Maher Goes Off on Harvard Kids for ‘Siding With Terrorists’  —  “As an Ivy League graduate who knows the value of a liberal education I have one piece of advice for the youth of America—don't go to college,” Maher said Friday night.  —  After 34 Harvard student groups signed … ",
    "url": "https://www.thedailybeast.com/bill-maher-goes-off-on-harvard-kids-for-siding-with-terrorists-on-real-time"
  },
  {
    "text": "AP visual analysis: Rocket from Gaza appeared to go astray, likely caused deadly hospital explosion  —  (AP animation: Marshall Ritzel, AP video: Angie Wang)  —  Shortly before 7 p.m. Tuesday, a volley of rockets lit up the darkened sky over Gaza.  Videos analyzed by The Associated Press show … ",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-hospital-rocket-gaza-e0fa550faa4678f024797b72132452e3"
  }
]