[
  {
    "text": "Trump seeks Supreme Court intervention in election interference case  —  Former President Donald Trump is turning to the justices in a last-ditch effort to prevent his prosecution in the federal election interference case from moving closer to trial.  —  WASHINGTON — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/trump-seeks-supreme-court-intervention-election-interference-case-rcna137694"
  },
  {
    "text": "G.O.P. Officials, Once Critical, Stand by Trump After NATO Comments  —  Defending Donald Trump or deflecting his statements, some top G.O.P. officials reflected the trajectory of a party that the former president has largely bent to his will.  —  After Donald J. Trump suggested he had threatened … ",
    "url": "https://www.nytimes.com/2024/02/12/us/politics/trump-nato-republicans.html"
  },
  {
    "text": "The Republican Plot Against Donald Trump  —  The Republican Plot Against Donald Trump  —  The inside story of how Congress is pursuing endless war in Ukraine—and trying to stop a Trump election.  —  This weekend, Senate Democrats (joined by a few Republicans, including most Republican leadership) … ",
    "url": "https://www.theamericanconservative.com/how-congress-is-pursuing-endless-war-in-ukraine-and-trying-to-stop-a-trump-election/"
  },
  {
    "text": "The Supreme Court will soon decide whether to sabotage Trump's most important criminal trial  —  Trump wants the justices to delay his election theft trial forever.  —  The Supreme Court now has two Trump-sized problems to deal with.  —  Last Thursday, the justices heard oral arguments … ",
    "url": "https://www.vox.com/scotus/2024/2/12/24070539/supreme-court-donald-trump-election-theft-jack-smith-immunity-stay-dc-circuit"
  },
  {
    "text": "Haley: ‘Rogue golf ball’ is closest Trump has come to combat  —  GOP presidential candidate Nikki Haley again slammed former President Trump for his comments mocking her deployed husband, saying a “rogue golf ball” is the closest the former president has ever come to combat.",
    "url": "https://thehill.com/homenews/campaign/4463197-haley-golf-trump-combat/"
  },
  {
    "text": "‘Wow!’  Morning Joe Crew Stunned By Montage of Trump Repeated Gaffes from Weekend Rallies  —  Joe Scarborough and Mika Brzezinski were equally stunned by a montage of confusing gaffes by former President Donald Trump over a weekend of political rallies, each exclaiming “wow!” coming out of the montage aired on Monday's Morning Joe.",
    "url": "https://www.mediaite.com/tv/wow-morning-joe-crew-stunned-by-montage-of-trump-repeated-gaffes-from-weekend-rallies/"
  },
  {
    "text": "Republicans play cleanup on aisle Trump after former president's NATO comments  —  One of the things I'm not going to do any longer is respond to every comment Donald Trump makes and say ‘Do you still support him?’  I do and I support him because Joe Biden's a disaster.  —  Sen. Marco Rubio, R-Fla.",
    "url": "https://www.npr.org/2024/02/12/1230950457/trump-nato-haley-south-carolina-primary-rubio-gop-lawmakers"
  },
  {
    "text": "Herbert Hoover stans fight back  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  With help from producer Raymond Rapada.  —  President JOE BIDEN has a rotation of names for former President DONALD TRUMP (not all of which are appropriate in public).",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/02/12/herbert-hoover-stans-fight-back-00141060"
  },
  {
    "text": "Police have identified the woman who opened fire in a Houston megachurch.  Here's what we know  —  A woman who walked into a popular Texas megachurch Sunday afternoon with a long gun and a young child opened fire before she was killed by law enforcement officers on scene.",
    "url": "https://www.cnn.com/2024/02/12/us/joel-osteen-lakewood-church-shooting-monday/"
  },
  {
    "text": "Call and Response: Putin Demanded Greater Russia and Trump Agreed  —  Over the weekend, Putin and Donald Trump seem to have come to public agreement that, if elected in November, Trump would help Putin pursue Greater Russia.  —  In his session with Tucker Carlson, after all … ",
    "url": "https://www.emptywheel.net/2024/02/12/call-and-response-putin-is-demanding-greater-russia/"
  },
  {
    "text": "Donald Trump and Tucker Carlson gave Putin exactly want he wants  —  It is no coincidence that Trump made his biggest threat against NATO right after Tucker Carlson sat with Putin  —  As we all know, the biggest story in the world is the breaking news that President Joe Biden is old.",
    "url": "https://www.salon.com/2024/02/12/donald-and-tucker-carlson-gave-putin-exactly-want-he-wants/"
  },
  {
    "text": "Donald J. Trump is talking about endorsing Lara Trump for R.N.C. co-chair.  —  Elgin, S.C.  —  Orangeburg, S.C.  —  Conway, S.C.  —  Conway, S.C.  —  Sean Rayford for The New York Times",
    "url": "https://www.nytimes.com/live/2024/02/12/us/trump-biden-election-news"
  },
  {
    "text": "Trump plans to attend Georgia hearing on misconduct allegations against prosecutors  —  ATLANTA — Former president Donald Trump plans to attend a Thursday hearing in Atlanta on allegations that Fulton County District Attorney Fani T. Willis (D) engaged in an improper personal relationship … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/12/fani-willis-hearing-trump-georgia-case/"
  },
  {
    "text": "The Legal Coup  —  In late 2020, a group of conservative movement attorneys set out to build a legal pathway by which Donald Trump could stay in power, having lost the election.  —  We've known about the outcome of their work for three years now: how it led to the violence of Jan. 6 … ",
    "url": "https://talkingpointsmemo.com/feature/intro-chesebro-docs"
  },
  {
    "text": "Republican Michigan lawmaker loses staff and committee assignment after online racist post  —  A Republican lawmaker in Michigan has lost his committee assignment and staff, days after posting an image of a racist ideology on social media  —  For free real time breaking news alerts sent straight … ",
    "url": "https://www.independent.co.uk/news/ap-republican-michigan-gretchen-whitmer-black-b2494937.html"
  },
  {
    "text": "Why I Am Now Deeply Worried for America  —  Until a few days ago, I was feeling fairly sanguine about America's prospects.  Economically, we've had a year of strong growth and plunging inflation — and aside from committed Republicans, who see no good, hear no good and speak no good when a Democrat … ",
    "url": "https://www.nytimes.com/2024/02/12/opinion/biden-trump-america.html"
  },
  {
    "text": "A Neuroscientist Weighs In On Biden's Cognitive Abilities  —  Special Counsel Robert K. Hur's report, in which he declined to prosecute President Biden for his handling of classified documents, also included a much-debated assessment of Mr. Biden's cognitive abilities.",
    "url": "https://www.nytimes.com/2024/02/12/opinion/neuroscientist-on-biden-age-memory.html"
  },
  {
    "text": "R-E-S-P-E-C-T?  Trump Dominates Biden  —  Among recent presidents and their chief rivals, former President Donald Trump is most respected by voters.  —  The latest Rasmussen Reports national telephone and online survey finds that 42% of Likely U.S. Voters say they respect Trump most as a leader … ",
    "url": "https://www.rasmussenreports.com/public_content/politics/biden_administration/r_e_s_p_e_c_t_trump_dominates_biden"
  }
]