[
  {
    "text": "Wildfire response threatens to end Karen Bass' extended honeymoon  —  The Los Angeles mayor returned home from Ghana on Wednesday and said she was in “constant contact” while abroad.  —  LOS ANGELES — Karen Bass probably has second thoughts about that trip to Ghana.",
    "url": "https://www.politico.com/news/2025/01/08/wildfire-threatens-karen-bass-extended-honeymoon-00197228"
  },
  {
    "text": "Mayor's Absence Is Considered a Sign L.A. Underestimated Fire Risks  —  Some residents said Mayor Karen Bass should have canceled her trip to Ghana when weather warnings in Los Angeles grew increasingly dire.  —  When a series of dangerous, wind-driven fires broke out on Tuesday in the Los Angeles area … ",
    "url": "https://www.nytimes.com/2025/01/09/us/los-angeles-mayor-fire-response.html?unlocked_article_code=1.n04.5t0A.WyWaW0sxz7OM&smid=url-share"
  },
  {
    "text": "Soon, The Buck Stops With Him  —  Plus: Devastation and blame game in LA and the original guy to come up with the “Gulf of America.”  —  Out in southern California, things just keep looking worse.  The winds keep blowing, the fires keep spreading, and the death and devastation keeps growing … ",
    "url": "https://www.thebulwark.com/p/soon-the-buck-stops-with-him"
  },
  {
    "text": "Trump speaks with Justice Alito amid push to halt criminal sentencing  —  Alito spoke to Trump to recommend an ex-clerk for a job in his administration.  —  President-elect Donald Trump speaks during a news conference at Mar-a-Lago, Jan. 7, 2024, in Palm Beach, Fla.",
    "url": "https://abcnews.go.com/US/trump-speaks-justice-alito-amid-push-halt-criminal/story?id=117386419"
  },
  {
    "text": "Elon Musk says DOGE probably won't find $2 trillion in federal budget cuts  —  Musk previously said his Department of Government Efficiency would be able to recommend cuts to the federal budget of “at least $2 trillion.”  —  Tech billionaire Elon Musk said Wednesday that his budget-cutting effort … ",
    "url": "https://www.nbcnews.com/politics/politics-news/elon-musk-says-doge-probably-wont-find-2-trillion-federal-budget-cuts-rcna186924"
  },
  {
    "text": "'Can't Even Respond': Gavin Newsom Reacts To Trump's Los Angeles Wildfires Attack  —  The California governor wasn't having it with the president-elect blaming him for the devastating fires.  —  LOADING  —  California Gov. Gavin Newsom (D) swiftly dismissed Donald Trump's efforts to … ",
    "url": "https://www.huffpost.com/entry/gavin-newsom-donald-trump-politicize-los-angeles-wildfires_n_677f6a02e4b018662a3bdc11"
  },
  {
    "text": "Trump's Ugly, Hateful Eruptions Over CA Wildfires Hint at Darker Story  —  With wildfires raging in Los Angeles, Donald Trump unleashed some ugly and hateful tirades on Truth Social.  He attacked California Governor Gavin Newsom with a vile slur, blamed the fires on him and President Biden … ",
    "url": "https://newrepublic.com/article/190022/trumps-ugly-hateful-eruptions-ca-wildfires-hint-darker-story"
  },
  {
    "text": "The '90s weren't that great  —  Nostalgia isn't what it used to be  —  Today's guest post is from the author of Cartoons Hate Her, a Substack about social dynamics (including parenting, marriage, sex and friendship) from the hybrid mind of a terminally online sicko and a normie liberal mom.",
    "url": "https://www.slowboring.com/p/the-90s-werent-that-great"
  },
  {
    "text": "Donald Trump Jr.'s visit was ‘staged,’ says Greenland lawmaker  —  “We know how they treat the Inuit in Alaska.  Make that great before trying to invade us,” Pipaluk Lynge tells POLITICO.  —  A senior Greenlandic politician slammed Donald Trump Jr.'s visit to the island as “staged,” … ",
    "url": "https://www.politico.eu/article/donald-trump-junior-visit-was-staged-says-greenland-lawmaker/"
  },
  {
    "text": "Karen Pence Snubs Donald Trump At Jimmy Carter's Funeral  —  This was the first time Mike Pence and Donald Trump have been together publicly since the insurrection.  —  LOADING  —  Former second lady Karen Pence appeared to snub President-elect Donald Trump on Thursday at former President Jimmy Carter's funeral.",
    "url": "https://www.huffpost.com/entry/karen-pence-snubs-donald-trump-jimmy-carter-funeral_n_677ff987e4b0dc0efd13adb0"
  },
  {
    "text": "Taking Trump's imperialist trolling seriously (for a moment)  —  We've come a long way from bringing down egg prices.  —  ∙ Paid  —  Speaking as someone who's been covering Trump for nine years now, paying attention to what he's doing instead of obsessing over what he's saying is generally a good rule of thumb.",
    "url": "https://www.publicnotice.co/p/trump-greenland-canada-paul-frymer-interview"
  },
  {
    "text": "Scoop: Trump's 100 executive orders … - Senators were given previews of some of what they were told would be 100 executive orders, two sources who were in the room told Axios.  — Stephen Miller, Trump's longtime immigration adviser, dove into how they intend to use executive power … ",
    "url": "https://www.axios.com/2025/01/09/trump-immigration-executive-orders-stephen-miller"
  },
  {
    "text": "More than 15,000 doctors sign letter urging Senate to reject RFK Jr. as health secretary  —  Their letter calls the choice of Robert F. Kennedy Jr., who is known for promoting false medical claims, “a slap in the face” to health care professionals.  —  More than 15,000 doctors have signed … ",
    "url": "https://www.nbcnews.com/news/us-news/rfk-jr-health-secretary-doctors-urge-senate-block-trump-administration-rcna186807"
  },
  {
    "text": "Lessons, Painful At Times, Are Only Lessons If They're Eventually Learned  —  The devastation in Southern California is almost beyond measure.  A little over half of Pacific Palisades is gone.  Most of the seaside parts of Malibu are in ruins.  There are now seven active fires in Los Angeles … ",
    "url": "https://hotair.com/generalissimo/2025/01/09/lessons-painful-at-times-are-only-lessons-if-theyre-eventually-learned-n3798625"
  },
  {
    "text": "Ex-FBI informant behind fake Biden-Ukraine bribery allegations sentenced to 6 years in prison  —  The disgraced former FBI informant who falsely accused President Joe Biden and his son Hunter Biden of taking a $10 million bribe from Ukraine was sentenced Wednesday to six years in federal prison, according to court records.",
    "url": "https://www.cnn.com/2025/01/08/politics/ex-fbi-informant-fake-biden-ukraine-bribery-allegations-alexander-smirnov"
  },
  {
    "text": "Kremlin, on Trump remarks on Greenland and Canada, says Russia has Arctic interests  —  The Kremlin on Thursday said that Russia had strategic national interests in the Arctic when asked to comment on U.S. President-elect Donald Trump's remarks about acquiring Greenland, absorbing Canada and taking control of the Panama Canal.",
    "url": "https://www.reuters.com/world/kremlin-trump-remarks-greenland-canada-says-russia-has-arctic-interests-2025-01-09/"
  },
  {
    "text": "The Army of God Comes Out of the Shadows … on the thursday night after Donald Trump won the presidential election, an obscure but telling celebration unfolded inside a converted barn off a highway stretching through the cornfields of Lancaster County, Pennsylvania.",
    "url": "https://www.theatlantic.com/magazine/archive/2025/02/new-apostolic-reformation-christian-movement-trump/681092/"
  },
  {
    "text": "Republicans on North Carolina Supreme Court block certification of Democratic justice's election victory  —  On Monday, Congress certified the results of the 2024 presidential election in routine fashion.  Some concluded that, due to Trump's victory, there would be no attacks on the democratic process this year.",
    "url": "https://popular.info/p/update-republicans-on-north-carolina"
  },
  {
    "text": "Trump Is Poised to Turn the DOJ Into His Personal Law Firm … No president has ever attempted to do what Donald Trump now proposes to do—assemble a small team of former personal attorneys and install it at the highest levels of the Department of Justice.  The president-elect first named lawyers … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/01/trump-doj-appointments-protection/681247/?gift=OFof2ZDTWx1CqiUu1ALJNLBon2d2tSDUpjGafkRmHSk&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "WOW: Leaked Letter from Fire Chief Kristin Crowley Makes Mayor Karen Bass Look Even WORSE (Screenshot)  —  While our pals on the Left are screeching about climate change being at fault for the devastating fires we're all watching in California in real-time, the reality of the situation … ",
    "url": "https://twitchy.com/samj/2025/01/09/crowley-warned-bass-n2406363"
  },
  {
    "text": "Falsehoods around the L.A. fires are proliferating on the right  —  Anything to keep the realities of climate change from spreading.  —  There is nothing political about the wildfires that have annihilated thousands of buildings around Los Angeles this week, with two exceptions.",
    "url": "https://www.washingtonpost.com/politics/2025/01/09/los-angeles-fires-politics/"
  },
  {
    "text": "Fact check: As wildfires rage, Trump lashes out with false claims about FEMA and California water policy  —  Another natural disaster, another series of false claims from President-elect Donald Trump.  —  For years, Trump has littered his statements on California wildfires and other disasters with inaccurate assertions.",
    "url": "https://www.cnn.com/2025/01/09/politics/fact-check-trump-california-wildfires-fema"
  }
]