[
  {
    "text": "Initial Rescissions Of Harmful Executive Orders And Actions  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:  —  Section 1.  Purpose and Policy.  The previous administration has embedded deeply unpopular … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/initial-rescissions-of-harmful-executive-orders-and-actions/"
  },
  {
    "text": "PROTECTING THE MEANING AND VALUE OF AMERICAN CITIZENSHIP  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  The privilege of United States citizenship is a priceless and profound gift.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/protecting-the-meaning-and-value-of-american-citizenship/"
  },
  {
    "text": "Trump executive order will attempt to end birthright citizenship  —  The incoming president plans to take at least 10 actions related to the border or immigration, including ramping up deportations and suspending refugee resettlement.  —  The U.S. government will no longer recognize … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/20/trump-immigration-executive-orders/"
  },
  {
    "text": "Actually, the 14th Amendment Still Exists  —  Trump signed an executive order purporting to rewrite birthright citizenship.  That's not how the Constitution works.  —  President Donald Trump signed an executive order Monday declaring that the federal government would no longer recognize … ",
    "url": "https://www.motherjones.com/politics/2025/01/trump-birthright-citizenship-executive-order-14th-amendment-still-exists/"
  },
  {
    "text": "Trump rescinds Biden's census order, clearing a path for reshaping election maps  —  Among the dozens of Biden-era executive orders that President Trump revoked on Monday was one that had reversed the first Trump administration's unprecedented policy of altering a key set of census results.",
    "url": "https://www.npr.org/2025/01/20/nx-s1-5268958/trump-order-census-citizenship-question-apportionment"
  },
  {
    "text": "Trump Administration Fires Immigration Court Officials as Crackdown Begins  —  Four immigration court officials were removed from their positions on Monday.  It's unclear who is in charge at this point.  —  The acting head of the U.S. immigration court system and three other top officials … ",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/trump-administration-fires-immigration-judges.html"
  },
  {
    "text": "Trump pardons almost all involved in Jan. 6 riot, commutes remaining 14 sentences  —  Trump ordered those still incarcerated to be released immediately from federal prison.  —  41 minutes of fear: A video timeline from inside the Capitol siege  —  President Donald Trump announced Monday evening … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/01/20/trump-pardons-jan-6-defendants/"
  },
  {
    "text": "Portrait of General Milley Is Removed From Pentagon  —  The decision was an early salvo by the new administration against a military that President Trump has assailed for a variety of perceived offenses.  —  The Pentagon on Monday removed a portrait of Gen. Mark A. Milley … ",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/general-mark-milley-portrait.html"
  },
  {
    "text": "Right-Wing Extremists Are Abuzz Over Musk's Straight-Arm Salute  —  “Incredible things are happening already lmao,” wrote Gab founder and Hitlerbot innovator Andrew Torba  —  Right-wing extremists, white nationalists, and neo-Nazis are celebrating an alarming gesture made by the world's richest man.",
    "url": "https://www.rollingstone.com/politics/politics-news/elon-musk-salute-reaction-right-wing-extremists-1235241866/"
  },
  {
    "text": "Elon Musk Ignites Online Speculation Over the Meaning of a Hand Gesture  —  Speaking at a celebratory rally in Washington, Mr. Musk twice extended his arm out with his palm facing down, drawing comparisons to the Nazi salute.  —  Elon Musk ignited speculation and chatter online … ",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/elon-musk-hand-gesture-speech.html"
  },
  {
    "text": "Get out of DOGE: How Musk helped eject Ramaswamy  —  Ramaswamy is leaving the so-called Department of Government Efficiency and plans to run for Ohio governor.  —  Elon Musk has already achieved his first cut at the so-called Department of Government Efficiency: his co-leader Vivek Ramaswamy.",
    "url": "https://www.politico.com/news/2025/01/20/doge-musk-helped-eject-ramaswamy-00199487"
  },
  {
    "text": "APPLICATION OF PROTECTING AMERICANS FROM FOREIGN ADVERSARY CONTROLLED APPLICATIONS ACT TO TIKTOK  —  By the authority vested in me as President by the Constitution and the laws of the United States of America it is hereby ordered:  —  Section 1.  Policy.  The Protecting Americans … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/application-of-protecting-americans-from-foreign-adversary-controlled-applications-act-to-tiktok/"
  },
  {
    "text": "WITHDRAWING THE UNITED STATES FROM THE WORLD HEALTH ORGANIZATION  —  WITHDRAWING THE UNITED STATES FROM THE WORLD  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/withdrawing-the-united-states-from-the-worldhealth-organization/"
  },
  {
    "text": "Trump Withdraws U.S. from World Health Organization  —  Public health experts say U.S. withdrawal from the W.H.O. would undermine the nation's standing as a global health leader and make it harder to fight the next pandemic.  —  President Trump moved quickly on Monday to withdraw the United States … ",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/trump-world-health-organization.html?unlocked_article_code=1.q04.6_VH.VcT84ufm4HK4&smid=url-share"
  },
  {
    "text": "GRANTING PARDONS AND COMMUTATION OF SENTENCES FOR CERTAIN OFFENSES RELATING TO THE EVENTS AT OR NEAR THE UNITED STATES CAPITOL ON JANUARY 6, 2021  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  This proclamation ends a grave national injustice that has been perpetrated upon … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/granting-pardons-and-commutation-of-sentences-for-certain-offenses-relating-to-the-events-at-or-near-the-united-states-capitol-on-january-6-2021/"
  },
  {
    "text": "DEFENDING WOMEN FROM GENDER IDEOLOGY EXTREMISM AND RESTORING BIOLOGICAL TRUTH TO THE FEDERAL GOVERNMENT  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 7301 of title 5, United States Code, it is hereby ordered:",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/defending-women-from-gender-ideology-extremism-and-restoring-biological-truth-to-the-federal-government/"
  },
  {
    "text": "Exclusive: Trump administration canceling flights for nearly 1,660 Afghan refugees, say U.S official, advocate  —  Nearly 1,660 Afghans cleared by the U.S. government to resettle in the U.S., including family members of active duty U.S. military personnel, are having their flights canceled … ",
    "url": "https://www.reuters.com/world/us/trump-administration-canceling-flights-nearly-1660-afghan-refugees-say-us-2025-01-20/"
  },
  {
    "text": "Trump Plans to Enact 25% Tariffs on Mexico, Canada by Feb. 1  —  President Donald Trump said that he plans to enact tariffs of as much as 25% on Mexico and Canada by Feb. 1, reiterating his contention that the US's two immediate neighbors are allowing the flow of migrants and drugs into the country.",
    "url": "https://www.bloomberg.com/news/articles/2025-01-21/trump-plans-to-enact-25-tariffs-on-mexico-canada-by-feb-1?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczNzQzMzMyMywiZXhwIjoxNzM4MDM4MTIzLCJhcnRpY2xlSWQiOiJTUUVZREZUMEcxS1cwMCIsImJjb25uZWN0SWQiOiJGOUU0RDg4NjE3MkM0Nzc3QUVFMDk3NTdCODRDQTlBRCJ9.xmphyhn9dUNewD3zMm4YYB8Gq_u20bJ4F4yNom92jvQ"
  },
  {
    "text": "Clarifying The Military's Role In Protecting The Territorial Integrity Of The United States  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  (a)  As Chief Executive and as Commander … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/clarifying-the-militarys-role-in-protecting-the-territorial-integrity-of-the-united-states/"
  },
  {
    "text": "Statement from President Joe Biden  —  I am issuing pardons to Gerald G. Lundergan and Ernest William Cromartie.  I am also commuting the life sentence imposed on Leonard Peltier so that he serves the remainder of his sentence in home confinement.  —  My family has been subjected … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/20/statement-from-president-joe-biden-16/"
  },
  {
    "text": "Fetterman rips rumors he'll switch to GOP: ‘Rocket sled to Palookaville’  —  Sen. John Fetterman (D-PA) shot down rumors that he would switch to the Republican Party.  —  Speaking to Semafor, Fetterman dismissed such rumors as “amateur hour s***,” vowing to remain with the Democratic Party.",
    "url": "https://www.washingtonexaminer.com/news/senate/3294872/fetterman-rips-rumors-switch-republican/"
  },
  {
    "text": "Elon Musk already has a White House email address  —  On President Trump's first day in office, Elon Musk already has a coveted White House email address.  —  A source tells The Hill that Musk, the billionaire who will head up the Department of Government Efficiency (DOGE) … ",
    "url": "https://thehill.com/homenews/administration/5096177-musk-white-house-email-address/"
  }
]