[
  {
    "text": "Zuckerberg wears $900,000 watch to announce end of Meta fact checks  —  Mark Zuckerberg wore a rare Swiss watch worth about $900,000 in a video explaining his company's decision to end third-party fact checking on its social media platforms in the U.S.  —  Play Video",
    "url": "https://torontosun.com/business/money-news/zuckerberg-wears-900000-watch-to-announce-end-of-meta-fact-checks"
  },
  {
    "text": "More Speech and Fewer Mistakes  —  Meta's platforms are built to be places where people can express themselves freely.  That can be messy.  On platforms where billions of people can have a voice, all the good, bad and ugly is on display.  But that's free expression.",
    "url": "https://about.fb.com/news/2025/01/meta-more-speech-fewer-mistakes/"
  },
  {
    "text": "Meta is ending its fact-checking program in favor of a ‘community notes’ system similar to X  —  Meta CEO Mark Zuckerberg announced a series of major changes to the company's moderation policies and practices, saying that the election felt like a “cultural tipping point.”",
    "url": "https://www.nbcnews.com/tech/social-media/meta-ends-fact-checking-program-community-notes-x-rcna186468"
  },
  {
    "text": "Meta to get rid of factcheckers and recommend more political content  —  Mark Zuckerberg says company will ‘dramatically reduce censorship’ across Facebook, Instagram and Threads  —  Meta will get rid of factcheckers, “dramatically reduce the amount of censorship” and recommend … ",
    "url": "https://www.theguardian.com/technology/2025/jan/07/meta-facebook-instagram-threads-mark-zuckerberg-remove-fact-checkers-recommend-political-content"
  },
  {
    "text": "Transition Live Updates: Trump Hints at U.S. Territorial Expansion and Airs Grievances  —  Here's what to know  — In an hourlong news conference at Mar-a-Lago, President-elect Donald J. Trump refused to rule out using military force to retake the Panama Canal, which was returned by treaty … ",
    "url": "https://www.nytimes.com/live/2025/01/07/us/trump-news"
  },
  {
    "text": "Cannon temporarily blocks report on Trump classified-documents probe  —  Two Trump employees charged alongside him in the classified documents case separately asked Judge Aileen Cannon to block the release.  —  The federal judge in Florida who dismissed the case against Donald Trump … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/07/jack-smith-trump-special-counsel-report-garland/"
  },
  {
    "text": "Judge Cannon Blocks Release of Special Counsel's Final Report on Trump Documents Investigation  —  Judge Aileen M. Cannon, a Trump appointee who dismissed the documents case in its entirety this summer, on Tuesday temporarily barred the special counsel, Jack Smith, from releasing the results of his investigation to the public.",
    "url": "https://www.nytimes.com/2025/01/07/us/politics/trump-documents-case-jack-smith-report.html?unlocked_article_code=1.nU4.owQZ.ld7D9HbGiGFl&smid=url-share"
  },
  {
    "text": "In sum: Trump just left open using military force against a NATO ally  —  Trump regularly declines to rule things out, but this one on Greenland is different.  —  President-elect Donald Trump is the king of not ruling things out.  It's his default response when a possibility … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/07/trump-panama-greenland-nato-military-force/"
  },
  {
    "text": "Donald Trump Jr. arrives in Greenland with a message from his dad: 'We're going to treat you well'  —  President-elect Donald Trump told residents of Greenland that “we're going to treat you well” as his oldest son visited the mineral-rich Danish territory that's home to a large U.S. military base … ",
    "url": "https://apnews.com/article/greenland-us-trumps-son-visit-56bc01f1d3431c035b22ad6564579938"
  },
  {
    "text": "‘Greenland belongs to the Greenlanders,’ says Danish PM as Donald Trump Jr. arrives  —  Greenland has made it clear that it is not for sale, Danish Prime Minister Mette Frederiksen said Tuesday, in response to U.S. President-elect Donald Trump's fixation with buying the massive Arctic island.",
    "url": "https://www.politico.eu/article/greenland-not-for-sale-danish-pm-mette-frederiksen-us-donald-trump-jr/"
  },
  {
    "text": "New York appeals court denies halting Trump's sentencing  —  A New York appellate judge on Tuesday declined to suspend President-elect Trump's Friday sentencing on his hush money criminal conviction.  —  Judge Ellen Gesmer of the state's midlevel appeals court rejected Trump's emergency petition … ",
    "url": "https://thehill.com/regulation/court-battles/5071977-appeals-court-trump-sentencing/"
  },
  {
    "text": "Melania Trump Documentary Scores Massive Amazon Payday  —  It's 2025, and even the Walt Disney Co. is kissing Donald Trump's ring.  But it's still stunning that Amazon is paying a whopping $40 million to license the Brett Ratner-directed Melania Trump documentary.",
    "url": "https://puck.news/melania-trump-documentary-scores-massive-amazon-payday/"
  },
  {
    "text": "Federal prosecutors say they've uncovered ‘additional criminal conduct’ by NYC Mayor Adams  —  Federal prosecutors who indicted Mayor Adams on corruption charges last year allege they have uncovered “additional criminal conduct” that the mayor and others engaged in.",
    "url": "https://www.nydailynews.com/2025/01/07/federal-prosecutors-additional-criminal-conduct-by-nyc-mayor-adams-turkey-corruption/"
  },
  {
    "text": "Trump's one-bill two-step perplexes GOP senators  —  GOP senators are questioning the president-elect's commitment to “one powerful bill.”  —  If Donald Trump thought he was settling the GOP's most important strategy dispute, Senate Republicans are not getting the message.",
    "url": "https://www.politico.com/news/2025/01/07/trump-gop-confusion-reconciliation-plan-00196745"
  },
  {
    "text": "Biden admin finalizes rule to ban medical debt from credit reports … - The CFPB estimates that for Americans with medical debt, the new rule could raise their credit scores by an average of 20 points.  — “People who get sick shouldn't have their financial future upended,” CFPB Director Rohit Chopra said in the press release.",
    "url": "https://www.axios.com/2025/01/07/medical-debt-ban-credit-reports-bidn-cfpb-rule"
  },
  {
    "text": "Jean-Marie Le Pen, French far-right leader known for fiery rhetoric against immigration, dies at 96  —  Jean-Marie Le Pen, the founder of France's far-right National Front who was known for fiery rhetoric against immigration and multiculturalism that earned him both staunch supporters and widespread condemnation, has died.",
    "url": "https://apnews.com/article/jean-marie-le-pen-france-obituary-67c1f95b9c864374b2bcba20f746d530"
  },
  {
    "text": "FIRE to defend veteran pollster J. Ann Selzer in Trump lawsuit over outlier election poll  —  “Punishing someone for their political prediction is about as unconstitutional as it gets,” said FIRE Chief Counsel Bob Corn-Revere.  “This is America.  No one should be afraid to predict the outcome of an election.",
    "url": "https://www.thefire.org/news/fire-defend-veteran-pollster-j-ann-selzer-trump-lawsuit-over-outlier-election-poll"
  },
  {
    "text": "Washington Post Lays Off 4 Percent of Its Work Force  —  The layoffs will affect employees across The Post's business operations, not its newsroom.  —  The Washington Post has started laying off roughly 4 percent of its work force, the company said on Tuesday, as the newspaper struggles to stem millions of dollars in annual losses.",
    "url": "https://www.nytimes.com/2025/01/07/business/media/washington-post-layoffs.html"
  },
  {
    "text": "Scoop: Senate Dems delay Tulsi Gabbard nomination … - Sen. Mark Warner (D-Va.), the vice chair of the Senate Intelligence Committee, is balking at GOP requests to hold a hearing for Gabbard early next week, according to multiple sources familiar with the conversations.",
    "url": "https://www.axios.com/2025/01/07/tulsi-gabbard-senate-democrats-delay-hearing"
  },
  {
    "text": "Statement by Press Secretary Ernesto Apreza on Vice President Harris' Travel to Singapore, Bahrain, and Germany  —  Vice President Kamala Harris will travel to Singapore, Bahrain, and Germany from January 13 to January 17.  —  On January 15, the Vice President will meet with leaders in Singapore and visit Changi Naval Base.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/07/statement-by-press-secretary-ernesto-apreza-on-vice-president-harris-travel-to-singapore-bahrain-and-germany/"
  }
]