[
  {
    "text": "More Speech and Fewer Mistakes  —  Meta's platforms are built to be places where people can express themselves freely.  That can be messy.  On platforms where billions of people can have a voice, all the good, bad and ugly is on display.  But that's free expression.",
    "url": "https://about.fb.com/news/2025/01/meta-more-speech-fewer-mistakes/"
  },
  {
    "text": "Live Updates: Meta to End Fact-Checking Program in Shift Ahead of Trump Term  —  The social networking giant will stop using third-party fact-checkers on Facebook, Threads and Instagram and instead rely on users to add notes to posts.  It is likely to please President-elect Trump and his allies.",
    "url": "https://www.nytimes.com/live/2025/01/07/business/meta-fact-checking"
  },
  {
    "text": "Meta is ending its fact-checking program in favor of a ‘community notes’ system similar to X  —  Meta CEO Mark Zuckerberg announced a series of major changes to the company's moderation policies and practices, saying that the election felt like a “cultural tipping point.”",
    "url": "https://www.nbcnews.com/tech/social-media/meta-ends-fact-checking-program-community-notes-x-rcna186468"
  },
  {
    "text": "Meta to get rid of factcheckers and recommend more political content  —  Mark Zuckerberg says company will ‘dramatically reduce censorship’ across Facebook, Instagram and Threads  —  Meta will get rid of factcheckers, “dramatically reduce the amount of censorship” and recommend … ",
    "url": "https://www.theguardian.com/technology/2025/jan/07/meta-facebook-instagram-threads-mark-zuckerberg-remove-fact-checkers-recommend-political-content"
  },
  {
    "text": "Mark Zuckerberg Is a Surrender Monkey  —  1. Daggett Industries  —  Meta (née Facebook) is deep into a sustained campaign of capitulation to Donald Trump.  —  Last Thursday Mark Zuckerberg named Joel Kaplan as the company's head of public policy.  Kaplan is, of course … ",
    "url": "https://www.thebulwark.com/p/mark-zuckerberg-is-a-surrender-monkey"
  },
  {
    "text": "Cannon temporarily blocks report on Trump classified-documents probe  —  Two Trump employees charged alongside him in the classified documents case separately asked Judge Aileen Cannon to block the release.  —  The federal judge in Florida who dismissed the case against Donald Trump … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/07/jack-smith-trump-special-counsel-report-garland/"
  },
  {
    "text": "Trump urges Garland to block release of Jack Smith's final report  —  His lawyers wrote to Attorney General Merrick Garland.  —  Donald Trump and two of his allies are making a last-minute push to block special counsel Jack Smith from issuing his final report on his two dismissed criminal cases against the president-elect.",
    "url": "https://www.politico.com/news/2025/01/06/trump-garland-jack-smith-filing-00196786"
  },
  {
    "text": "Melania Trump Documentary Scores Massive Amazon Payday  —  It's 2025, and even the Walt Disney Co. is kissing Donald Trump's ring.  But it's still stunning that Amazon is paying a whopping $40 million to license the Brett Ratner-directed Melania Trump documentary.",
    "url": "https://puck.news/melania-trump-documentary-scores-massive-amazon-payday/"
  },
  {
    "text": "Biden admin finalizes rule to ban medical debt from credit reports … - The CFPB estimates that for Americans with medical debt, the new rule could raise their credit scores by an average of 20 points.  — “People who get sick shouldn't have their financial future upended,” CFPB Director Rohit Chopra said in the press release.",
    "url": "https://www.axios.com/2025/01/07/medical-debt-ban-credit-reports-bidn-cfpb-rule"
  },
  {
    "text": "Trump's one-bill two-step perplexes GOP senators  —  GOP senators are questioning the president-elect's commitment to “one powerful bill.”  —  If Donald Trump thought he was settling the GOP's most important strategy dispute, Senate Republicans are not getting the message.",
    "url": "https://www.politico.com/news/2025/01/07/trump-gop-confusion-reconciliation-plan-00196745"
  },
  {
    "text": "Danish king changes coat of arms amid row with Trump over Greenland  —  Design shows intent to keep control of Faroe Islands and Greenland - which Trump says he would like the US to buy  —  The Danish king has shocked some historians by changing the royal coat of arms to more prominently feature Greenland … ",
    "url": "https://www.theguardian.com/world/2025/jan/06/danish-king-changes-coat-of-arms-in-apparent-rebuke-to-donald-trump"
  },
  {
    "text": "‘Greenland belongs to the Greenlanders,’ says Danish PM as Donald Trump Jr. arrives  —  Greenland has made it clear that it is not for sale, Danish Prime Minister Mette Frederiksen said Tuesday, in response to U.S. President-elect Donald Trump's fixation with buying the massive Arctic island.",
    "url": "https://www.politico.eu/article/greenland-not-for-sale-danish-pm-mette-frederiksen-us-donald-trump-jr/"
  },
  {
    "text": "Trump announces $20 billion foreign investment to build new U.S. data centers … President-elect Donald Trump on Tuesday announced a $20 billion foreign investment to build new data centers across the United States.  —  Emirati billionaire Hussain Sajwani, a Trump associate and founder … ",
    "url": "https://www.cnbc.com/2025/01/07/trump-investment-hussain-sajwani-damac-data-centers.html"
  },
  {
    "text": "Why Mike Johnson's fake “Jefferson prayer” matters  —  Replacing facts with phony history is a linchpin of the Christian nationalist movement  —  One cannot say for certain that Rep. Mike Johnson was deliberately lying during his acceptance speech to return as Speaker of the House.",
    "url": "https://www.salon.com/2025/01/07/why-mike-johnsons-fake-jefferson-prayer-matters/"
  },
  {
    "text": "Washington Post Lays Off 4 Percent of Its Work Force  —  The layoffs will affect employees across The Post's business operations, not its newsroom.  —  The Washington Post has started laying off roughly 4 percent of its work force, the company said on Tuesday, as the newspaper struggles to stem millions of dollars in annual losses.",
    "url": "https://www.nytimes.com/2025/01/07/business/media/washington-post-layoffs.html"
  },
  {
    "text": "How Democrats should talk about Trump's corruption  —  “There's really a need for a whole new set of reforms,” Noah Bookbinder says.  —  ∙ Paid  —  Donald Trump is the most brazenly self-dealing president in history.  He's surrounded these days by an obscene cast of billionaires … ",
    "url": "https://www.publicnotice.co/p/noah-bookbinder-2025-interview-trump-corruption"
  },
  {
    "text": "Former French far-right leader Jean-Marie Le Pen dies aged 96  —  Jean-Marie Le Pen, founder of the far-right National Front party who tapped into working class concerns over immigration and globalisation, shaking up the French political establishment, has died, sources close to his daughter Marine Le Pen said on Tuesday.",
    "url": "https://www.reuters.com/world/europe/former-french-far-right-leader-jean-marie-le-pen-dies-aged-96-media-reports-2025-01-07/"
  },
  {
    "text": "Trump could be setting himself up for a ‘powerful’ early failure  —  Trump wants to go big with his first legislative priority, but major pitfalls await — if he even recognizes them.  —  President-elect Donald Trump has never been terribly concerned with the legitimate obstacles in front of him or the finer points of legislating.",
    "url": "https://www.washingtonpost.com/politics/2025/01/07/trump-reconciliation-one-bill-congress-senate/"
  },
  {
    "text": "Trump pushes “president-elect immunity” to fight hush money case sentencing … - Trump has waged a legal battle to get out of the Jan. 10 court date, despite the fact that Judge Juan Merchan has already indicated that he won't face jail time.  — Trump's filing comes … ",
    "url": "https://www.axios.com/2025/01/07/trump-dismiss-hush-money-conviction-sentencing"
  },
  {
    "text": "10 corporations that kept their promises after January 6, 2021  —  After a violent mob stormed the Capitol building on January 6, 2021, hundreds of corporations took action to communicate to the public that democracy itself was more important than maximizing their political influence.",
    "url": "https://popular.info/p/10-corporations-that-kept-their-promises"
  },
  {
    "text": "Former VP Mike Pence praises VP Kamala Harris for certifying election, Trump's victory  —  It is “particularly admirable that Vice President Harris would preside over the certification of a presidential election that she lost,” the former Vice President said.  —  Julia Gomez Kinsey CrowleyUSA TODAY",
    "url": "https://www.usatoday.com/story/news/politics/2025/01/07/mike-pence-kamala-harris-trump-election-certification/77504563007/"
  },
  {
    "text": "Pressure mounts on EU to use legal weapons against Musk's interference  —  European Commission says it will study whether X gives unfair boost to far right in German election.  —  What are you waiting for, Brussels?  —  Elon Musk's decision to host German far-right leader Alice Weidel … ",
    "url": "https://www.politico.eu/article/elon-musk-interference-alice-weidel-x-livestream-afd-germany-eu-digital-services-act/"
  }
]