[
  {
    "text": "MAGA Republicans are normalizing violent threats  —  Public Notice just celebrated its second birthday.  Click the button to take advantage of our special anniversary offer.  —  Click to redeem 2nd anniversary offer  —  It scarcely drew the attention of the media last month … ",
    "url": "https://www.publicnotice.co/p/jim-jordan-violent-threats-trump-republicans"
  },
  {
    "text": "Jim Jordan won't be the next speaker  —  Good morning, Early Birds.  We'd like to applaud Rep. Chip Roy (R-Tex.) for incorporating a reference to the Whigs — the extinct 19th-century political party — into his tweets about the speakership fight.  Rep. Mike Collins (R-Ga.) is still funnier, though.",
    "url": "https://www.washingtonpost.com/politics/2023/10/19/jim-jordan-wont-be-next-speaker/"
  },
  {
    "text": "Miller-Meeks Statement on Speaker Vote and Death Threats  —  WASHINGTON, D.C. - Yesterday, I voted to support Jim Jordan's candidacy for Speaker of the House.  I voted for Jim Jordan for the greater good of the House Republican party, based on our Conference meeting and the test Speaker ballot that was cast earlier this week.",
    "url": "https://millermeeks.house.gov/media/press-releases/miller-meeks-statement-speaker-vote-and-death-threats"
  },
  {
    "text": "10/19/23 ☀️ Punchbowl News AM  —  It seems as if reality is finally beginning to creep into Rep. Jim Jordan's (R-Ohio) orbit. … On Tuesday, 20 GOP lawmakers voted against Jordan.  A day later, he lost 22 Republican votes.  —  Put simply, the votes aren't moving toward Jordan, they're moving away from him.",
    "url": "https://punchbowl.news/archive/101923-punchbowl-news-am/"
  },
  {
    "text": "Why the McHenry bubble might pop  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  OVERNIGHT — “Russia Detains a U.S. Journalist,” by NYT's Ivan Nechepurenko: “ALSU KURMASHEVA, who holds dual U.S.-Russian citizenship and works in Prague … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/19/why-the-mchenry-bubble-might-pop-00122410"
  },
  {
    "text": "Why House Republicans Can't Function, According to a House Republican  —  The House of Representatives has been enmeshed in chaos since the former Republican speaker Kevin McCarthy was voted out on Oct. 3 by members of his own conference.  Steve Scalise then ran for the speakership but withdrew … ",
    "url": "https://www.nytimes.com/2023/10/19/opinion/don-bacon-republicans-gaetz.html"
  },
  {
    "text": "BREAKING: Sidney Powell reaches plea deal in Trump case  —  Attorney Sidney Powell has reached a plea deal with prosecutors in the Fulton County election probe.  —  Powell was charged with racketeering and other counts for her role in a Coffee County election system data breach.",
    "url": "https://www.ajc.com/politics/breaking-sidney-powell-reaches-plea-deal-in-trump-case/YQ4T2FIHLNB2RAANDGMWBCMQNM/"
  },
  {
    "text": "Trump attorney Sidney Powell pleads guilty in Georgia election subversion case  —  Former Donald Trump attorney Sidney Powell has pleaded guilty in the Georgia election subversion case, one day before her trial was set to start.  —  Fulton County prosecutors are recommending a sentence of six years probation.",
    "url": "https://www.cnn.com/2023/10/19/politics/sidney-powell-fulton-county-georgia-2020-election-subversion/"
  },
  {
    "text": "Trump Is Winning Over Swing-State Voters Wary of Biden's Economic Plan  — Voters in seven states trust Trump more on economy, poll shows  — Suburban women swing-state voters are a bright spot for Biden  —  Donald Trump is leading President Joe Biden in several key swing states … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-19/trump-leads-biden-in-key-us-states-as-voters-worry-about-economy-poll"
  },
  {
    "text": "Morning Consult |  Bloomberg News: How Biden vs. Trump Perform on Swing-State Ballots … This survey, which identifies key issues in the 2024 election and measures how much voters trust Biden vs. Trump on these issues and how Biden vs. Trump perform on a ballot in swing states … ",
    "url": "https://pro.morningconsult.com/articles/morning-consult-bloomberg-swing-states-2024"
  },
  {
    "text": "American journalist detained and charged in Russia  —  Alsu Kurmasheva's detention follows the arrest of Wall Street Journal reporter Evan Gershkovich, who is still awaiting trial on espionage charges.  —  A U.S. journalist has been detained in Russia, her employer said, the second such case since the w ar in Ukraine started.",
    "url": "https://www.nbcnews.com/news/world/american-journalist-detained-russia-alsu-kurmasheva-foreign-agent-rcna121173"
  },
  {
    "text": "Biden, in Israel, hits notes of loyalty, emotion — and caution  —  In an extraordinary moment, an 80-year-old president flies into a war zone  —  In an emotional speech carried live across Israel and around the world, President Biden sought to embody America's ties to the Jewish state … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/18/biden-israel-speech-visit-war/"
  },
  {
    "text": "Exclusive: Tech billionaire Peter Thiel was an FBI informant  —  Peter Thiel has worn many hats over the years: Silicon Valley founder, Trump megadonor, cryptocurrency booster, democracy skeptic.  —  But there is yet another facet to Thiel, one that has remained secret until now: FBI informant.",
    "url": "https://www.businessinsider.com/peter-thiel-fbi-informant-charles-johnson-johnathan-buma-chs-genius-2023-10?op=1"
  },
  {
    "text": "Here's the available evidence of what happened at Al Ahli Arab Hospital in Gaza  —  Video and photographic evidence, along with eyewitness accounts, are providing some clues about Tuesday's massive explosion at Gaza's Al Ahli Arab Hospital, which Palestinian officials say killed hundreds.",
    "url": "https://www.npr.org/2023/10/18/1206795861/heres-the-available-evidence-of-what-happened-at-al-ahli-arab-hospital-in-gaza"
  },
  {
    "text": "Multiple members are detailing death threats and other intimidation they've faced for opposing Jim Jordan's speakership bid.  —  Jordan said the threats “are terrible and that should never happen.”",
    "url": "https://www.politico.com/live-updates/2023/10/19/congress/speaker-race-threats-house-00122416"
  },
  {
    "text": "‘Major expansion’: China now has more than 500 nukes, Pentagon says  —  DOD also estimates China will likely double that to more than 1,000 nuclear warheads by 2030.  —  China has blown past previous projections for the size of its nuclear arsenal and is now producing even more weapons … ",
    "url": "https://www.politico.com/news/2023/10/19/major-expansion-china-now-has-more-than-500-nukes-pentagon-says-00122440"
  },
  {
    "text": "Man Who Spread Misinformation on Trump's Behalf Sentenced to 7 Months  —  The man, Douglass Mackey, spread internet memes meant to fool people into not voting for Hillary Clinton in 2016.  —  A digital-age dirty-trickster who used Twitter posts that looked like Hillary Clinton ads … ",
    "url": "https://www.nytimes.com/2023/10/18/nyregion/douglass-mackey-trump-sentencing.html"
  },
  {
    "text": "Forget dating apps.  Sen. Grassley's office has produced 20 marriages.  —  Alex and Molly Severn held hands near the front of an Iowa church a few years ago, excited for the pastor to pronounce them husband and wife.  But for a moment, Molly thought the pastor was going to ruin her wedding.",
    "url": "https://www.washingtonpost.com/nation/2023/10/19/senator-chuck-grassley-married-couples-weddings/"
  },
  {
    "text": "Media Confidence in U.S. Matches 2016 Record Low  —  WASHINGTON, D.C. — The 32% of Americans who say they trust the mass media “a great deal” or “a fair amount” to report the news in a full, fair and accurate way ties Gallup's lowest historical reading, previously recorded in 2016.",
    "url": "https://news.gallup.com/poll/512861/media-confidence-matches-2016-record-low.aspx"
  },
  {
    "text": "Donald Trump Is Going to Get Someone Killed  —  Donald Trump's life has been a master class in the evasion of consequences.  Six of his businesses have declared bankruptcy but he is still acclaimed as a business visionary; he's been married three times but is still beloved by evangelicals … ",
    "url": "https://www.nytimes.com/2023/10/19/opinion/trump-gag-order-violence.html"
  }
]