[
  {
    "text": "First on CNN: Three US troops killed in drone attack in Jordan, at least two dozen injured  —  Three US Army soldiers were killed and at least two dozen service members were injured in a drone attack overnight on a small US outpost in Jordan, US officials told CNN, marking the first time US troops … ",
    "url": "https://www.cnn.com/2024/01/28/politics/us-troops-drone-attack-jordan"
  },
  {
    "text": "Statement from President Joe Biden on Attack on U.S. Service Members in Northeastern Jordan Near the Syria Border  —  Today, America's heart is heavy.  Last night, three U.S. service members were killed—and many wounded—during an unmanned aerial drone attack on our forces stationed in northeast Jordan near the Syria border.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/28/statement-from-president-joe-biden-on-attack-on-u-s-service-members-in-northeastern-jordan-near-the-syria-border/"
  },
  {
    "text": "Three Americans killed, ‘many’ wounded in drone attack by Iran-backed militia in Jordan, Biden says  —  COLUMBIA, S.C. (AP) — Three American service members were killed and “many” were wounded in a drone strike in northeast Jordan near the Syrian border, President Joe Biden said in a statement Sunday.",
    "url": "https://apnews.com/article/biden-american-service-members-killed-jordan-iran-5cb774fd835a558d840ae91263037489"
  },
  {
    "text": "Republican hawks call for retaliation after 3 killed in Iranian-backed strike  —  Sens. Roger Wicker, Lindsey Graham and others pushed for a military response.  —  Calls for retaliation began pouring in from Republican members of Congress moments after U.S. Central Command revealed Sunday … ",
    "url": "https://www.politico.com/news/2024/01/28/revenge-members-congress-killed-jordan-iran-backed-attack-00138245"
  },
  {
    "text": "The Trump defense industrial complex goes a bit quiet after Carroll verdict  —  ‘Trump chaos is baked in the cake at this point,’ one Republican strategist said.  —  The most notable thing about the Republican call-and-response following the E. Jean Carroll verdict was that there was barely any response at all.",
    "url": "https://www.politico.com/news/2024/01/28/gop-reaction-trump-carroll-verdict-00138230"
  },
  {
    "text": "Trump brags about efforts to stymie border talks: ‘Please blame it on me’  —  The Republican front-runner slams bipartisan talks in the Senate for a deal as Biden calls for emergency authority to address surging crossings  —  Republican front-runner Donald Trump said he wants to be held responsible … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/27/trump-border-biden/"
  },
  {
    "text": "State of the Union  —  DANA BASH, CNN HOST (voice-over): Gone South.  —  As his GOP rival gets under his skin...  NIKKI HALEY (R), PRESIDENTIAL CANDIDATE: Donald, keep them coming.  —  BASH: ... Donald Trump wants to pivot.  —  DONALD TRUMP, FORMER PRESIDENT OF THE UNITED STATES (R) … ",
    "url": "https://transcripts.cnn.com/show/sotu/date/2024-01-28/segment/01"
  },
  {
    "text": "Noem spars with CNN's Dana Bash over border deal  —  South Dakota Gov. Kristi Noem (R) sparred with CNN anchor Dana Bash on Sunday over the border deal, suggesting that President Biden already has the power he needs to shut down the border and that no additional legislation is needed.",
    "url": "https://thehill.com/homenews/house/4434127-noem-spars-with-cnns-dana-bash-over-border-deal/"
  },
  {
    "text": "Biden offers fresh assurances he would shut down border ‘right now’ if Congress sends him a deal  —  COLUMBIA, South Carolina (AP) — Bidding to salvage a border deal in Congress that also would unlock money for Ukraine, President Joe Biden offered fresh assurances Saturday night … ",
    "url": "https://apnews.com/article/biden-border-deal-mexico-migration-south-carolina-b83f83ed39e59ebb38b7ff093da14706"
  },
  {
    "text": "Falling inflation, rising growth give U.S. the world's best recovery  —  The European economy, hobbled by unfamiliar weakness in Germany, is barely growing.  China is struggling to recapture its sizzle.  And Japan continues to disappoint.  —  But in the United States, it's a different story.",
    "url": "https://www.washingtonpost.com/business/2024/01/28/global-economy-gdp-inflation/"
  },
  {
    "text": "US historians sign brief to support Colorado's removal of Trump from ballot  —  Twenty-five civil war and Reconstruction scholars support invoking 14th amendment to bar Trump from ballot over January 6  —  Twenty-five historians of the civil war and Reconstruction filed a US supreme court brief … ",
    "url": "https://www.theguardian.com/law/2024/jan/28/us-historians-sign-brief-to-support-colorados-removal-of-trump-from-ballot"
  },
  {
    "text": "First-of-its-kind campaign fundraiser in the works with Bill Clinton, Barack Obama and Biden  —  The Biden campaign is planning a spring fundraiser for the president to appear with his two Democratic predecessors.  —  WASHINGTON — President Joe Biden's campaign is trying to organize … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-campaign-fundraiser-president-bill-clinton-barack-obama-rcna136020?taid=65b655122fcc0f0001ff2a9b"
  },
  {
    "text": "Biden administration discussing slowing some weaponry deliveries to Israel to pressure Netanyahu  —  U.S. officials are considering pausing or slowing some U.S. arms shipments to Israel to convince the government to heed U.S. calls to scale back its military assault in Gaza,",
    "url": "https://www.nbcnews.com/politics/white-house/biden-administration-discussing-slowing-weaponry-deliveries-israel-pre-rcna136035"
  },
  {
    "text": "GOP legislatures in some states seek ways to undermine voters' ability to determine abortion rights  —  CHICAGO (AP) — Legislative efforts in Missouri and Mississippi are attempting to prevent voters from having a say over abortion rights, building on anti-abortion strategies seen in other states, including last year in Ohio.",
    "url": "https://apnews.com/article/abortion-ballot-initiatives-voters-democracy-2024-602ebb8a74d7ae45163d79c065a23ef0"
  }
]