[
  {
    "text": "Behind the Curtain: “Getting shot in the face changes a man” … - He can unify the party. … - He could unify America. … - He could box out Democrats. … - He could show a different side of himself.",
    "url": "https://www.axios.com/2024/07/15/trump-convention-speech-rnc-milwaukee"
  },
  {
    "text": "Multiple things are true about Trump's shooting  —  PN is a reader-supported publication made possible by paid subscribers.  Appreciate our independent journalism?  Then please sign up to support us.  —  ✍️ Subscribe to Public Notice ✍️  —  I picked a hell of a night to log off.",
    "url": "https://www.publicnotice.co/p/trump-shooting-butler-pennsylvania"
  },
  {
    "text": "Grateful, defiant Trump recounts surviving ‘surreal’ assassination attempt at rally: 'I'm supposed to be dead'  —  A grateful and at times defiant Donald Trump told The Post Sunday he's “supposed to be dead” as he recalled the harrowing moment a would-be assassin shot him at a Pennsylvania campaign rally.",
    "url": "https://nypost.com/2024/07/14/us-news/grateful-defiant-trump-recounts-surreal-assassination-attempt-at-rally-im-supposed-to-be-dead/"
  },
  {
    "text": "Trump rewrites Republican convention speech to focus on unity not Biden  —  WORLD EXCLUSIVE — Former President Donald Trump has completely rewritten his convention speech in light of the assassination attempt against him on Saturday and will call on Thursday for a new effort at national unity.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3082180/trump-rewrites-republican-convention-speech-focus-unity-not-biden/"
  },
  {
    "text": "‘BlueAnon’ conspiracy theories flood social media after Trump rally shooting  —  Researchers who track online conspiracies say liberals are increasingly vulnerable to — and generating — QAnon-like bursts of misinformation.  —  Minutes after Saturday's shooting at a Trump rally in Butler … ",
    "url": "https://www.washingtonpost.com/technology/2024/07/14/blueanon-conspiracy-theories-trump-rally-shooting/"
  },
  {
    "text": "Trump Allies Try to Bully Dems, Media to Shut Up About His Fascist Plans  —  Republicans are seeking to capitalize on Trump's assassination attempt — using it to demand everyone stop talking about his threats to democracy  —  As Donald Trump recovers from an assassination attempt … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-allies-fascist-plans-dems-media-1235060142/"
  },
  {
    "text": "Federal judge dismisses Trump classified documents case over concerns with prosecutor's appointment  —  The federal judge presiding over the classified documents case of former President Donald Trump in Florida dismissed the prosecution on Monday, siding with defense lawyers who said the special counsel … ",
    "url": "https://apnews.com/article/trump-classified-documents-smith-c66d5ffb7ba86c1b991f95e89bdeba0c"
  },
  {
    "text": "Judge dismisses classified documents case against Donald Trump  —  A federal judge on Monday dismissed the classified documents case against Donald Trump, a shock ruling that clears away one of the major legal challenges facing the former president.  —  In a 93-page ruling … ",
    "url": "https://www.cnn.com/2024/07/15/politics/classified-documents-case-trump-dismissed-aileen-cannon/"
  },
  {
    "text": "Judge Dismisses Classified Documents Case Against Trump  —  Judge Aileen Cannon ruled that the entire case should be thrown out because the appointment of the special counsel who brought the case, Jack Smith, had violated the Constitution.  Her decision is sure to be appealed.",
    "url": "https://www.nytimes.com/2024/07/15/us/politics/trump-document-case-dismissed.html"
  },
  {
    "text": "Trump's classified documents case dismissed by Judge Aileen Cannon  —  The Florida judge accepted a long-shot legal argument, embraced by conservatives, that special counsel Jack Smith was improperly appointed.  —  The federal judge overseeing the classified documents charges … ",
    "url": "https://www.washingtonpost.com/national-security/2024/07/15/trump-classified-trial-dismisssed-cannon/"
  },
  {
    "text": "Trump documents case dismissed by federal judge  —  Washington — The federal judge overseeing the case alleging former President Donald Trump mishandled sensitive government documents after leaving the White House has dismissed the charges against him and his two codefendants.",
    "url": "https://www.cbsnews.com/news/trump-documents-case-dismissed-by-federal-judge/"
  },
  {
    "text": "History Shows Democrats Can't Lose the Presidency and Win the House  —  One of the ideas coming out of the agonizing intra-Democratic debate about Joe Biden's fitness to beat Donald Trump is a sort of plan B. Donors, we are told, are considering shifting resources to an effort to flip control of the House … ",
    "url": "https://nymag.com/intelligencer/article/biden-trump-house-flip-2024-election.html"
  },
  {
    "text": "Get a Grip, Democrats.  You Can Still Win This  —  “The presidential contest ended last night,” an unnamed “veteran Democratic political consultant” told NBC News the day after former President Donald Trump was grazed in the ear by an attempted assassin's bullet.",
    "url": "https://washingtonmonthly.com/2024/07/15/get-a-grip-democrats-you-can-still-win-this/"
  },
  {
    "text": "Trump Rally Gunman Was ‘Definitely Conservative,’ Classmate Recalls  —  ‘STANDING ALONE’  —  A former classmate of the 20-year-old man who tried unsuccessfully to kill former President Donald Trump at a Pennsylvania rally on Saturday recalled him being staunchly to the right of the political spectrum.",
    "url": "https://www.thedailybeast.com/trump-rally-gunman-thomas-crooks-was-definitely-conservative-classmate-recalls"
  },
  {
    "text": "‘Morning Joe’ pulled from air Monday because of Trump shooting  —  New York CNN  —  MSNBC will not air “Morning Joe,” its celebrated politics roundtable program, on Monday, opting to instead air continued breaking news coverage of the attempted assassination of former President Donald Trump.",
    "url": "https://www.cnn.com/2024/07/14/media/msnbc-morning-joe-pulled-trump-assassination/"
  },
  {
    "text": "Political Violence  —  Reflections from the 1920s and 1930s  —  What to make of the assassination attempt?  —  I am sharing a few thoughts about where we are, based on assassinations during the interwar period, the 1920s and 1930s.  It is distant enough that perhaps we can attend … ",
    "url": "https://snyder.substack.com/p/political-violence"
  },
  {
    "text": "Sen. Marsha Blackburn to deliver primetime speech at RNC  —  U.S. Sen. Marsha Blackburn will have a leading role at the Republican National Convention in Milwaukee this week with a primetime speaking slot.  — Blackburn is scheduled to speak Monday evening.",
    "url": "https://www.axios.com/local/nashville/2024/07/15/marsha-blackburn-speech-rnc"
  }
]