[
  {
    "text": "Claudine Gay's defenders have embarrassed themselves  —  Harvard University President Claudine Gay has finally resigned, embarrassing Harvard and her defenders in the process.  Their judgment should not be trusted anymore.  —  Gay's resignation on Tuesday came after it was revealed … ",
    "url": "https://www.washingtonexaminer.com/opinion/claudine-gays-defenders-have-embarrassed-themselves"
  },
  {
    "text": "Harvard president's resignation highlights new conservative weapon against colleges: plagiarism  —  (Jan 02) (AP video by Rodrique Ngowi) (AP production by Javier Arciga)  —  American higher education has long viewed plagiarism as among the most serious of offenses.",
    "url": "https://apnews.com/article/harvard-president-plagiarism-claudine-gay-3b048da1f2ee17b5edec3680b5828e8f"
  },
  {
    "text": "Powerful donors managed to push out Harvard's Claudine Gay.  But at what cost?  —  Not until now have major donors so brazenly used their financial influence to hound presidents out of office  —  Amid accusations of plagiarism and continuing outrage among Harvard's major donors … ",
    "url": "https://www.theguardian.com/commentisfree/2024/jan/03/powerful-donors-managed-to-push-out-harvards-claudine-gay-but-at-what-cost"
  },
  {
    "text": "1/3/24 ☀️ Punchbowl News AM … The first hearing will take place on Jan. 10, with a possible second hearing to be held the following week. … Green accused Mayorkas of misusing taxpayer dollars and purposefully ignoring border security measures.",
    "url": "https://punchbowl.news/archive/1324-punchbowl-news-am/"
  },
  {
    "text": "Mayorkas: Texas governor's migrant busing is a ‘failure of governance’  —  Abbott has been sending a steady flow of buses filled with asylum seekers from Texas to Democratic-led cities including New York, New Jersey and Chicago.  —  Homeland Security Secretary Alejandro Mayorkas took aim … ",
    "url": "https://www.politico.com/news/2024/01/03/mayorkas-texas-governors-migrant-busing-00133605"
  },
  {
    "text": "More than 100 killed in blasts at memorial for top Iranian general Soleimani  —  Gen. Qassem Soleimani was killed by a U.S. drone strike in January 2020, sparking angry protests in Iran and across the region.  —  Two explosions rocked a memorial event for Iranian Gen. Qassem Soleimani … ",
    "url": "https://www.nbcnews.com/news/world/iran-explosions-qassem-soleimani-memorial-quds-force-us-drone-strike-rcna132039"
  },
  {
    "text": "At least 20 killed in ‘terrorist attacks’ near Iranian Guards commander Soleimani's tomb during ceremony  —  Two explosions caused by ‘terrorist attacks’ killed at least 20 people and wounded dozens near a cemetery in Iran where a ceremony was being held to mark the 2020 death … ",
    "url": "https://www.reuters.com/world/middle-east/iran-media-report-explosion-near-guards-commander-soleimanis-tomb-anniversary-2024-01-03/"
  },
  {
    "text": "Biden campaign amps up focus on reelection with speech on Jan. 6 anniversary  —  “We are running a campaign like the fate of our democracy depends on it.  Because it does,” Biden campaign manager Julie Chavez Rodriguez told reporters  —  President Biden is scheduled to travel to Valley Forge … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/03/biden-jan-6-trump-election-2024/"
  },
  {
    "text": "Biden to travel to Mother Emanuel AME in South Carolina  —  The president's visit to the historic Black church, coming two days after Harris' visit to the state, underscores the campaign's effort to bolster support among Black voters.  —  President Joe Biden is headed to Charleston … ",
    "url": "https://www.politico.com/news/2024/01/03/biden-south-carolina-mother-emanuel-00133574"
  },
  {
    "text": "Tom Emmer endorses Trump in unified show of support from top four House Republicans  —  EXCLUSIVE — House Majority Whip Tom Emmer (R-MN) endorsed former President Donald Trump in the 2024 Republican primary, giving him the endorsement of the top four House Republicans going into the Iowa caucus later this month.",
    "url": "https://www.washingtonexaminer.com/news/house/tom-emmer-endorses-donald-trump"
  },
  {
    "text": "Haley campaign says it hauled in $24M in fourth-quarter fundraising  —  Nikki Haley's presidential campaign announced Wednesday that the former United Nations ambassador and GOP rival to former President Trump hauled in $24 million in the most recent fundraising quarter.",
    "url": "https://thehill.com/homenews/campaign/4386590-haley-campaign-24m-fourth-quarter-fundraising/"
  },
  {
    "text": "First on Fox: Haley more than doubles her fundraising with a $24 million haul the past three months  —  Haley's fundraising haul the past three months appears to be the latest sign of her recent momentum in the race for the Republican presidential nomination",
    "url": "https://www.foxnews.com/politics/first-on-fox-haley-more-than-doubles-her-fundraising-with-24-million-haul-past-three-months.amp"
  },
  {
    "text": "Sen. Bob Menendez facing even more charges in new superseding indictment  —  The Democrat is now accused of making positive comments about Qatar for gifts.  —  Sen. Bob Menendez, D-N.J., departs the Senate floor in the Capitol, Sept. 28, 2023, in Washington.",
    "url": "https://abcnews.go.com/Politics/sen-bob-menendez-facing-charges-new-superseding-indictment/story?id=106056419"
  },
  {
    "text": "Rep. John Curtis officially running for Romney's Senate seat  —  SALT LAKE CITY — Utah's 3rd District Rep. John Curtis is officially running for U.S. Senate, hoping to fill the upcoming empty seat that Sen. Mitt Romney is leaving.  —  On Tuesday, Curtis told KSL TV that one of the reasons … ",
    "url": "https://ksltv.com/611775/rep-john-curtis-officially-running-for-romneys-senate-seat/"
  },
  {
    "text": "Emergency rooms not required to perform life-saving abortions, federal appeals court rules  —  The Biden administration reminded hospitals of their obligation to perform life-saving abortions under the Emergency Medical Treatment and Labor Act after the overturn of Roe v. Wade.",
    "url": "https://www.texastribune.org/2024/01/02/texas-abortion-fifth-circuit/"
  },
  {
    "text": "Jack Smith Keeps Telegraphing Some Seriously Scandalous Trump Crimes  —  Did Donald Trump accept a bribe?  Order his FBI director to fake evidence?  Tell the National Guard to kill critics?  Sell nuclear secrets?  Jack Smith is being awfully suggestive.  —  As Special Counsel Jack Smith makes … ",
    "url": "https://www.thedailybeast.com/jack-smith-keeps-telegraphing-some-seriously-scandalous-trump-crimes"
  },
  {
    "text": "Why Democrats can't rely on abortion ballot initiatives to help them win  —  Voters decisively upheld abortion rights in every single case.  But those margins were largely driven by Republican voters who also voted for GOP candidates.  —  Democrats are scrambling to put state abortion-rights initiatives … ",
    "url": "https://www.politico.com/news/2024/01/03/abortion-democrats-2024-election-00133506"
  }
]