[
  {
    "text": "Inside the breakup of Haley and Trump's partnership over her U.N. role  —  Nikki Haley began her time as U.S. ambassador to United Nations with diplomatic successes.  Although she veered right on some issues to satisfy Trump, he attacks her as a ‘globalist’ in their primary fight.",
    "url": "https://www.washingtonpost.com/politics/2024/01/19/haley-trump-united-nations-frayed-relationship/"
  },
  {
    "text": "Statement from President Joe Biden on Nearly $5 Billion in Additional Student Debt Cancellation for 74,000 Borrowers  —  Today, my Administration approved debt cancellation for another 74,000 student loan borrowers across the country, bringing the total number of people who have gotten … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/19/statement-by-president-joe-biden-on-nearly-5-billion-in-additional-student-debt-cancellation-for-74000-borrowers/"
  },
  {
    "text": "Republican leaders forced to rely on Democrats to govern (again)  —  To prevent a government shutdown, Republican leaders grudgingly embraced the obvious solution they wanted to avoid: They relied on Democrats to govern.  —  As 2023 came to an end, and members of Congress wrapped up their work … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/republican-leaders-forced-rely-democrats-govern-rcna134670"
  },
  {
    "text": "Media outlets making their own coverage decisions isn't “authoritarian”  —  Trump's call to take them off the air is  —  Sen. Marco Rubio (R-FL) is worried about creeping authoritarianism in the United States.  Not from Donald Trump, whose presidential bid Rubio endorsed Sunday despite … ",
    "url": "https://www.mediamatters.org/donald-trump/media-outlets-making-their-own-coverage-decisions-isnt-authoritarian"
  },
  {
    "text": "Exclusive: Attorney General Merrick Garland says there should be ‘speedy trial’ of Trump as 2024 election looms  —  Attorney General Merrick Garland said in an interview with CNN that he believes there should be a “speedy trial” in the election subversion case against Donald Trump … ",
    "url": "https://www.cnn.com/2024/01/19/politics/merrick-garland-trump-speedy-trial/"
  },
  {
    "text": "How a Judge in India Prevented Americans From Seeing a Blockbuster Report  —  Free speech on the internet took a huge hit when the news agency Reuters took down an important hacking investigation to comply with an overseas legal challenge.  —  Two months ago, the news agency Reuters published … ",
    "url": "https://www.politico.com/news/magazine/2024/01/19/india-judge-reuters-story-00136339"
  },
  {
    "text": "The DeSantis Team Ran the Worst Campaign in History  —  The bizarre decisions behind a $130 million debacle.  —  Tim Pawlenty's and Scott Walker's presidential campaigns can breathe a sigh of relief.  The mantle of Worst Republican Presidential Campaign Ever has been lifted from their shoulders … ",
    "url": "https://www.politico.com/news/magazine/2024/01/19/the-desantis-team-ran-the-worst-campaign-in-history-00136527"
  },
  {
    "text": "Comer Statement on Transcribed Interview with Kevin Morris  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) issued the following statement on today's transcribed interview with Kevin Morris, a Hollywood lawyer and Democrat donor:",
    "url": "https://oversight.house.gov/release/comer-statement-on-transcribed-interview-with-kevin-morris%EF%BF%BC/"
  },
  {
    "text": "Half of recent US inflation due to high corporate profits, report finds  —  Thinktank report says ‘resounding evidence’ shows companies continue to keep prices high even as their inflationary costs drop  —  A new report claims “resounding evidence” shows that high corporate profits … ",
    "url": "https://www.theguardian.com/business/2024/jan/19/us-inflation-caused-by-corporate-profits"
  },
  {
    "text": "NATO admiral warns of potential all-out war with Russia  —  Top NATO official Adm. Rob Bauer warned Thursday that a larger war with Russia and other adversaries is a real threat amid the ongoing conflict in Ukraine.  —  Bauer, chair of the Western security alliance's Military Committee … ",
    "url": "https://thehill.com/policy/defense/4417551-nato-admiral-war-russia-ukraine/"
  },
  {
    "text": "U.S. seeks jail for Trump adviser Navarro in Jan. 6 contempt case  —  The former Trump White House trade adviser acted without a lawyer in defying a House subpoena and failed to substantiate a claim that Trump asserted executive privilege to bar his testimony",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/01/19/navarro-sentencing-recommendation-contempt/"
  },
  {
    "text": "I once hated America, and I was so wrong  —  “I take this obligation freely, without any mental reservation or purpose of evasion; so help me God.”  —  Just a few days ago, I said these words in front of the friends who had accompanied me to take my Oath of Allegiance to become an American citizen.",
    "url": "https://thehill.com/opinion/immigration/4416136-i-once-hated-america-and-i-was-so-wrong/"
  },
  {
    "text": "Outrage as Oklahoma Republican's bill labels Hispanic people ‘terrorists’  —  Lawmaker JJ Humphrey seeks punishments for ‘acts of terrorism’ and defines terrorist as ‘any person who is of Hispanic descent’  —  An Oklahoma lawmaker is facing backlash for proposing a discriminatory bill … ",
    "url": "https://www.theguardian.com/us-news/2024/jan/18/oklahoma-bill-labels-hispanic-people-terrorists"
  },
  {
    "text": "McConnell, Republican lawmakers sign Supreme Court brief on keeping Trump on ballot  —  Nearly 180 congressional Republicans signed on to an amicus brief to the U.S. Supreme Court in support of Donald Trump's legal battle to remain on the primary election ballot in Colorado.",
    "url": "https://www.washingtonpost.com/politics/2024/01/18/mcconnell-trump-supreme-court-colorado-ballot/"
  },
  {
    "text": "Andrew Yang Backs Biden Primary Rival, Says President Can't ‘Reinvent Grandpa’  —  Yang previously campaigned for President Joe Biden after ending his own White House bid in the 2020 election  —  Former Democratic presidential candidate Andrew Yang has pledged his support to Rep. Dean Phillips … ",
    "url": "https://themessenger.com/politics/andrew-yang-backs-biden-primary-rival-says-president-cant-reinvent-grandpa"
  },
  {
    "text": "Elon Musk's scheme to gut worker protections nationally  —  For a guy who claims to want to save humanity, he's got some strange ideas. … “This is a battle for the future of civilization,” Elon Musk tweeted in 2022.  “If free speech is lost even in America, tyranny is all that lies ahead.”",
    "url": "https://www.publicnotice.co/p/elon-musk-space-x-national-labor-relations-board"
  },
  {
    "text": "What do angry farmers in Nevada and Germany have in common?  They're being exploited by the far right  —  Populists are taking advantage of agrarian protests sparked by genuine crises - and it all feels horribly familiar  —  When environmental activists calling for less pollution sit in the streets … ",
    "url": "https://www.theguardian.com/commentisfree/2024/jan/19/angry-farmers-nevada-germany-far-right-protest"
  },
  {
    "text": "California 2024 Poll: Schiff and Garvey Gain Support in Crowded Primary  —  An Emerson College Polling/Inside California Politics survey of the California Senate Election finds a quarter of voters (25%) support Democratic Representative Adam Schiff, while 18% support former Los Angeles Dodger … ",
    "url": "https://emersoncollegepolling.com/california-2024-poll-schiff-and-garvey-gain-support-in-crowded-primary/"
  }
]