[
  {
    "text": "Biden campaign announces pulling in $90M in March  —  The president's war chest swamps that of former President Donald Trump — even if Biden is still struggling in the polls.  —  President Joe Biden's campaign said it raised $90 million in March, a sum that's likely to grow … ",
    "url": "https://www.politico.com/news/2024/04/06/biden-campaign-march-fundraising-90-million-00150868"
  },
  {
    "text": "March fundraising numbers show Biden significantly outpacing Trump  —  The Biden reelection campaign and the Democratic National Committee significantly outraised former President Donald Trump and the Republican Party in the month of March, according to new fundraising numbers released by the Biden campaign today.",
    "url": "https://npr.org/2024/04/06/1243189101/biden-trump-campaign-money"
  },
  {
    "text": "Trump's team shows growing pains in pivot to general election … - It's the latest in a series of reversals by Trump's team at the RNC, now led by chair Michael Whatley and Lara Trump, his daughter-in-law.  — Those who've been rehired include most of the RNC's staff in key states … ",
    "url": "https://www.axios.com/2024/04/06/trump-campaign-rnc-2024-election"
  },
  {
    "text": "Biden campaign hits Trump over guests at upcoming Palm Beach high-dollar fundraiser  —  President Biden's reelection campaign hit former President Trump on Friday over the guest list for his high-dollar fundraiser in Palm Beach, Fla., on Saturday.  —  Trump is aiming to outraise Biden's $26 … ",
    "url": "https://thehill.com/homenews/campaign/4575614-biden-campaign-hits-trump-over-guests-at-upcoming-palm-beach-high-dollar-fundraiser/"
  },
  {
    "text": "The Trump Docket: A window into Trump's ‘private’ acts on Jan. 6 may soon be opened by a federal judge  —  Very soon, a federal judge in Washington, D.C., is expected to issue a ruling that could expose key pieces of discovery that some lawyers say prove Donald Trump acted in his “private” … ",
    "url": "https://lawandcrime.com/high-profile/the-trump-docket-a-window-into-trumps-private-acts-on-jan-6-may-soon-be-opened-by-a-federal-judge/"
  },
  {
    "text": "Verdict: Colorado Springs-area resident found guilty on all charges in Capitol breach trial in D.C.  —  After a lengthy deliberation that's been rare for Capitol breach cases, Falcon resident Rebecca Lavrenz, known on social media as the “J6 Praying Grandma,” was convicted … ",
    "url": "https://gazette.com/news/crime/verdict-colorado-springs-area-resident-found-guilty-on-all-charges-in-capitol-breach-trial-in/article_41e439fe-f0fc-11ee-9887-4fc0904851b5.html"
  },
  {
    "text": "Trump's Lawyers Told the Court That No One Would Give Him a Bond.  Then He Got a Lifeline, but They Didn't Tell the Judges.  —  An appeals court reduced Trump's bond by more than 60% after his attorneys claimed it was a “practical impossibility” to pay the full amount.",
    "url": "https://www.propublica.org/article/trump-bond-disclosure-appeals-court-hankey"
  },
  {
    "text": "Trump relies on a doctor who is a member of his golf club to vouch for his health  —  Former president has declined to release details about his own condition beyond a short letter from his physician, contrasting with Biden's detailed report  —  BEDMINSTER, N.J. — As former president Donald Trump escalated … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/06/trump-doctor-bruce-aronwald-bedminster-golf-club/"
  },
  {
    "text": "Lauren Boebert secures top spot on Republican primary ballot in Colorado's 4th Congressional District  —  PUEBLO — U.S. Rep. Lauren Boebert's name will be first on the June 25 Republican primary ballot in Colorado's 4th Congressional District after she won the district's GOP nominating assembly Friday.",
    "url": "https://coloradosun.com/2024/04/05/lauren-boebert-4th-congressional-district/"
  },
  {
    "text": "Biden Will Try Again to Wipe Out Student Loan Debt for Millions of Borrowers  —  The Supreme Court blocked President Biden's first attempt at large-scale student debt relief last summer.  —  President Biden will announce a new effort on Monday to reduce or eliminate student loan debt … ",
    "url": "https://www.nytimes.com/2024/04/05/us/politics/biden-student-loan-debt.html"
  },
  {
    "text": "Trump again asks hush money judge to recuse himself less than two weeks before trial starts  —  His lawyers cited Judge Juan Merchan's daughter's job at a company that does work for Democratic candidates as the main reason he should step aside.  —  Lawyers for Donald Trump have again asked … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-asks-hush-money-judge-recuse-less-two-weeks-trial-starts-rcna146659"
  },
  {
    "text": "Voter ID and absentee-ballot limits: the South tightens key voting laws ahead of election  —  When Michael McClanahan was growing up, his grandmother would tell him stories about what it was like to vote during the pre-Civil Rights era in their small town in northwest Louisiana.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/06/alabama-louisiana-mississippi-target-ballot-harvesting-2024/73106732007/"
  },
  {
    "text": "When a top Republican says Russian propaganda has infected the GOP  —  House Foreign Affairs Committee Chairman Michael McCaul is the latest to point out such a problem in his party  —  During the first impeachment inquiry into President Donald Trump in 2019, former Trump national security aide Fiona Hill made an extraordinary plea.",
    "url": "https://www.washingtonpost.com/politics/2024/04/06/when-top-republican-says-russian-propaganda-has-infected-gop/"
  },
  {
    "text": "Trump's bizarre, vindictive incoherence has to be heard in full to be believed  —  Excerpts from his speeches do not do justice to Trump's smorgasbord of vendettas, non sequiturs and comparisons to famous people  —  Donald Trump's speeches on the 2024 campaign trail so far have been focused … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/06/donald-trump-speech-analysis"
  },
  {
    "text": "US preparing for significant Iran attack on US or Israeli assets in the region as soon as next week  —  The US is on high alert and actively preparing for a “significant” attack that could come as soon as within the next week by Iran targeting Israeli or American assets in the region in response … ",
    "url": "https://www.cnn.com/2024/04/05/politics/us-israel-iran-retaliation-strike"
  },
  {
    "text": "With no way out of a worsening war, Zelensky's options look bad or worse  —  KYIV — As Russia steps up airstrikes and once again advances on the battlefield in Ukraine more than two years into its bloody invasion, there is no end to the fighting in sight.  And President Volodymyr Zelensky's options … ",
    "url": "https://www.washingtonpost.com/world/2024/04/06/ukraine-war-zelensky-options/"
  }
]