[
  {
    "text": "Trump Campaign Prepares Attack Plan for Harris in Case Biden Withdraws  —  The effort, which includes expansive advertising and polling, assumes that the vice president would be the most likely candidate to replace the president at the top of the Democratic ticket.",
    "url": "https://www.nytimes.com/2024/07/20/us/politics/trump-harris-strategy.html"
  },
  {
    "text": "Democratic consensus solidifies around Harris, should Biden step aside  —  No one quite knows what the process of picking a new nominee would be if Joe Biden did step aside - but many Democrats say that any process is likelier than ever to quickly end with Vice President Kamala Harris as the nominee.",
    "url": "https://www.cnn.com/2024/07/20/politics/democratic-consensus-harris-should-biden-step-aside/"
  },
  {
    "text": "‘Ready to step up’: VP Harris gains Capitol Hill cheerleaders as Biden isolates with Covid … Vice President Kamala Harris has gained more public support from Democratic lawmakers as a potential replacement for President Joe Biden, should he decide to drop out of the race against former President Donald Trump.",
    "url": "https://www.cnbc.com/2024/07/20/mark-takano-biden-election-harris-nominee.html"
  },
  {
    "text": "A Searing Reminder That Trump Is Unwell  —  Donald Trump's bizarre diatribe at the RNC shows why the pro-democracy coalition is so worried about beating him.  —  Donald Trump's bizarre diatribe at the Republican National Convention shows why the prodemocracy coalition is so worried about beating … ",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/07/a-searing-reminder-that-trump-is-unwell/679170/"
  },
  {
    "text": "Biden family grapples with pressure on their patriarch to step aside  —  Family members seek to provide private support while confronting a new level of scrutiny amid Democratic calls for Biden to end his candidacy.  —  President Biden had just arrived back at the White House following … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/20/biden-family-grapples-biden-calls-withdraw/"
  },
  {
    "text": "There are still key questions about Trump's injuries after attempted assassination  —  It has been nearly a week since gunfire erupted at Republican presidential candidate Donald Trump's rally in Butler, Pennsylvania, resulting in an injury to the former president, the death of one attendee … ",
    "url": "https://www.cnn.com/2024/07/18/health/dr-sanjay-gupta-analysis-trump/"
  },
  {
    "text": "‘In the clear’: Dr. Anthony Fauci weighs in on Trump injury after shooting  —  Dr. Anthony Fauci, former White House chief medical adviser, assuaged concerns around former President's Donald Trump's health and injuries following last weekend's attempted assassination.",
    "url": "https://www.usatoday.com/story/news/politics/2024/07/20/fauci-trump-assassination-attempt/74481481007/"
  },
  {
    "text": "Trump shooter flew drone over venue hours before attempted assassination, source says  —  The gunman was killed after he shot former President Donald Trump in the ear in an assassination attempt.  A motive remains unknown.  —  The gunman who shot former President Donald Trump in the ear … ",
    "url": "https://www.nbcnews.com/news/us-news/trump-shooter-flew-drone-venue-hours-attempted-assassination-source-sa-rcna162817"
  },
  {
    "text": "How Project 2025 would change American life … - At least 140 former Trump administration officials contributed to Project 2025, CNN reports.  — Trump has publicly disavowed the project; his campaign has pointed to his own policy plan, Agenda47, and the official Republican Party platform as his agenda if he wins in November.",
    "url": "https://www.axios.com/2024/07/20/project-2025-trump-what-to-know"
  },
  {
    "text": "Joe Biden, Kamala Harris or Someone Else?  The Convention Rules Might Decide.  —  The rules might determine who gets the nomination.  —  It's been decades since America last witnessed an actual contested convention, so it's easy to forget something important as Democrats barrel toward … ",
    "url": "https://www.politico.com/news/magazine/2024/07/20/biden-democratic-convention-nominee-rules-00169821"
  },
  {
    "text": "Sheila Jackson Lee, long-serving Democratic congresswoman and advocate for Black Americans, dies at 74  —  Sheila Jackson Lee, a longtime Democratic congresswoman from Texas who was an outspoken advocate for Black Americans for decades, has died.  She was 74.",
    "url": "https://www.cnn.com/2024/07/19/politics/sheila-jackson-lee-texas-dies/"
  },
  {
    "text": "Trump's GOP is no country for MAGA women  —  At the Republican National Convention, MAGA women learn there's no place for them in Trump's GOP  —  MILWAUKEE — On the third night of the Republican National Convention, Donald Trump's WWE-inspired entrance to the came complete with a trollish musical cue … ",
    "url": "https://www.salon.com/2024/07/20/the-clearest-message-of-the-convention-is-no-country-for-maga-women/"
  },
  {
    "text": "JD Vance's wife faces racist online backlash from far-right social media posts  —  Usha Chilukuri Vance is the daughter of Indian immigrants.  —  Republican vice presidential candidate Sen. J.D. Vance and his wife Usha Chilukuri Vance during the Republican National Convention in Milwaukee, WI, July 17, 2024.",
    "url": "https://abcnews.go.com/Politics/jd-vances-wife-faces-racist-online-backlash-social/story?id=112096897"
  },
  {
    "text": "Tossing Trump's case was risky for Judge Cannon — at least for now  —  Judge Aileen Cannon sidestepped key legal rulings to find that special counsel Jack Smith was improperly appointed to investigate Donald Trump.  —  Judge Aileen M. Cannon's stunning dismissal this week … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/20/cannon-trump-florida-appeal-special-counsel/"
  },
  {
    "text": "Israel strikes Yemen in response to Houthi drone attack on Tel Aviv … - The Houthis, an Islamist militant group backed by Iran, have harassed and attacked commercial ships in the Red Sea for months in response to Israel's war in Gaza.  — Houthi officials said the Israeli strike hit oil facilities … ",
    "url": "https://www.axios.com/2024/07/20/israel-yemen-houthis-tel-aviv-drone"
  },
  {
    "text": "July 19, 2024  —  Today a Russian court sentenced 32-year-old Wall Street Journal reporter Evan Gershkovich to 16 years in a high-security penal colony after convicting him of espionage in a secret three-day trial.  The U.S. government considers Gershkovich “wrongly detained,” … ",
    "url": "https://heathercoxrichardson.substack.com/p/july-19-2024"
  },
  {
    "text": "Three courts agree that a woman deemed wrongfully convicted should be freed.  She still isn't.  —  A woman whose murder conviction was overturned after she served 43 years of a life sentence was released Friday, despite attempts in the last month by Missouri's attorney general to keep her behind bars.",
    "url": "https://apnews.com/article/sandra-hemme-conviction-overturned-56831edcb2aa99b0430c0dbf0408dc5d"
  }
]