[
  {
    "text": "Trump Falsely Claims That the Crowds Seen at Harris Rallies Are Fake  —  The former president, in a series of social media posts, said that Vice President Kamala Harris had used A.I. technology to create images of fake crowds at her events.  —  Former President Donald J. Trump has taken … ",
    "url": "https://www.nytimes.com/2024/08/11/us/politics/trump-harris-crowds-ai.html?unlocked_article_code=1.CU4.IU4A.laO56X6syKZM&smid=url-share"
  },
  {
    "text": "Playbook: The unwritten Harris agenda  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  VIBE CHECK — “Harris is pushing joy.  Trump paints a darker picture.  Will mismatched moods matter?” by AP's Will Weissert and Michelle L. Price … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/12/the-unwritten-harris-agenda-00173589"
  },
  {
    "text": "Trump falsely claims Harris Michigan rally crowd 'didn't exist,' was generated with AI  —  Former President Donald Trump took to social media on Sunday to falsely claim that Vice President Kamala Harris' campaign faked photos of the crowd at her Detroit-area rally last week using artificial intelligence.",
    "url": "https://ny1.com/nyc/all-boroughs/politics/2024/08/11/trump-kamala-harris-michigan-rally-ai"
  },
  {
    "text": "Harris is pushing joy.  Trump paints a darker picture.  Will mismatched moods matter?  —  At the top of his first speech as her running mate, Minnesota Gov. Tim Walz turned to Vice President Kamala Harris and declared, “Thank you for bringing back the joy.”",
    "url": "https://apnews.com/article/trump-harris-walz-joy-positive-optimism-gloom-ff1818feee5c8661decaa9d48f6927af"
  },
  {
    "text": "Trump falsely accuses Harris campaign of fabricated AI crowd photos  —  In the days following President Joe Biden's announcement that he would step aside as the Democratic nominee, conspiracy theorists and far-right influencers have promoted a number of falsehoods targeted at the Harris campaign.",
    "url": "https://www.washingtonpost.com/politics/2024/08/11/trump-falsely-accuses-harris-campaign-fabricated-ai-crowd-photos/"
  },
  {
    "text": "Early numbers show violent crime dropping sharply … - It also gives Vice President Kamala Harris, a former prosecutor in San Francisco and California attorney general, a potent defense against attacks from the right on crime. … - 54 of the 69 major cities in the report saw drops in violent crime … ",
    "url": "https://www.axios.com/2024/08/12/violent-crime-harris-trump-election"
  },
  {
    "text": "Trump Is a Threat Whether He Wins or Loses, Biden Says  —  “He's a genuine danger to American security,” Biden said of Trump in his first TV interview since dropping out of the race.  —  In his first interview since dropping out of the election last month and endorsing Vice President Kamala Harris … ",
    "url": "https://www.motherjones.com/politics/2024/08/trumps-a-threat-whether-he-wins-or-loses-biden-says/"
  },
  {
    "text": "JD Vance's Campaign Won't Deny That's Him in Viral Drag Photo  —  ‘SOFA LAUREN’  —  The GOP's vice presidential pick is a vocal critic of gender affirming care for minors and once opposed federal protections for gay and interracial marriages.  —  Journalist",
    "url": "https://www.thedailybeast.com/jd-vances-campaign-wont-deny-thats-him-in-viral-drag-photo"
  },
  {
    "text": "Exclusive: DNC launches first Harris-Walz ad blitz … - The DNC says it is launching more than 80 billboards, which will run in English and Spanish, in and around the major metropolitan areas in the swing states of Arizona, Georgia, Michigan, North Carolina, Nevada, Pennsylvania and Wisconsin.",
    "url": "https://www.axios.com/2024/08/12/dnc-harris-walz-billboards-2024-democrats"
  },
  {
    "text": "Delays hit 40% of Biden's major IRA manufacturing projects  —  FT research shows that $84bn of initiatives announced in first year of the IRA and Chips Act have experienced slowdowns  —  Some 40 per cent of the biggest US manufacturing investments announced in the first year … ",
    "url": "https://www.ft.com/content/afb729b9-9641-42b2-97ca-93974c461c4c"
  },
  {
    "text": "White House launches broad new regulatory effort, as Harris prepares to unveil economic plan … The Biden Administration on Monday unveiled a new, multi-agency regulatory initiative to target corporate practices that officials claim are designed to waste consumers' time and needlessly burden … ",
    "url": "https://www.cnbc.com/2024/08/12/biden-harris-new-regulations-would-target-corporations-that-waste-consumers-time.html"
  },
  {
    "text": "New Israeli intelligence suggests Iran prepares to attack Israel within days: sources … - But one of the sources who has direct knowledge of the intelligence said the situation is “still fluid.”  —  The assessment, which was drafted in the last 24 hours, represents a shift, the sources said.",
    "url": "https://www.axios.com/2024/08/11/iran-attack-israel-intelligence-updated"
  },
  {
    "text": "State House Speaker Scott Saiki loses Democratic primary to Kim Coco Iwamoto  —  Hawaii's longtime House speaker lost his Democratic Party primary election to a former state Board of Education member who campaigned on tackling corruption in government.  —  Speaker Scott Saiki was ousted by Kim Coco Iwamoto.",
    "url": "https://apnews.com/article/hawaii-state-house-primary-democratic-ccbe2264b5a2c15e5ccd67cb98a3ae4e"
  },
  {
    "text": "What “Center” Is That, Exactly?  —  Hey friends!  If you've read Very Fine People and enjoyed it, why not leave a quick rating or review on Amazon or Goodreads?  It would help bunches!  —  I really can't get over the signs.  —  The Republicans held what was basically a Nuremberg rally … ",
    "url": "https://www.the-reframe.com/what-center-is-that-exactly/"
  },
  {
    "text": "JD Vance: Trump Can't Be Racist Because He Called Wife Usha ‘Beautiful’  —  ‘RIDICULOUS ATTACKS’  —  The vice presidential pick also defended Trump's decision to dine with white supremacist Nick Fuentes.  —  JD Vance said Donald Trump could not be racist—despite his past association … ",
    "url": "https://www.thedailybeast.com/jd-vance-trump-cant-be-racist-because-he-called-wife-usha-beautiful"
  }
]