[
  {
    "text": "An ugly case of ‘false balance’ in the New York Times  —  I once asked Jill Abramson, the former top editor of the New York Times, to name the best reporters she had ever encountered.  —  I recall she mentioned her friend and co-author Jane Mayer — definitely on my list, too — and a few others.",
    "url": "https://margaretsullivan.substack.com/p/an-ugly-case-of-false-balance-in"
  },
  {
    "text": "White House official says Biden and Harris weren't invited to Arlington cemetery by families of service members killed during Afghanistan withdrawal  —  Biden and Harris' teams pushed back on claims from GOP Sen. Tom Cotton and former Rep. Tulsi Gabbard that the president and vice president had been invited alongside Trump.",
    "url": "https://www.nbcnews.com/politics/white-house/biden-harris-werent-invited-arlington-abbey-gate-trump-rcna169154"
  },
  {
    "text": "Others Have Politicized Arlington, but Trump's Approach Has No Precedent  —  Donald J. Trump isn't the first candidate to run afoul of the ban on partisan activity in Arlington National Cemetery.  But no one else has responded as hostilely as his campaign has.",
    "url": "https://www.nytimes.com/2024/09/01/us/politics/trump-arlington-cemetery-army.html"
  },
  {
    "text": "There Are No Backsies on Dobbs  —  Since the day after the debate in June, I have conceived of the shift from a Joe Biden to a Kamala Harris campaign in three ways: The Vice President would more vigorously explain the wildly successful policies of the Biden-Harris Administration.",
    "url": "https://www.emptywheel.net/2024/09/01/there-are-no-backsies-on-dobbs/"
  },
  {
    "text": "Trump Flips on Florida Abortion Measure Again  —  When Florida Governor Ron DeSantis dropped out of the GOP presidential primary and tossed his support to former President Donald Trump, he appeared to be doing Trump a significant favor.  He also welcomed Trump as the newest permanent resident … ",
    "url": "https://hotair.com/jazz-shaw/2024/09/01/trump-flips-on-florida-abortion-measure-again-n3793933"
  },
  {
    "text": "Bodies of 6 hostages, murdered by Hamas just days ago, found in Rafah - IDF  —  Hersh Goldberg-Polin, Eden Yerushalmi, Ori Danino, Alex Lubnov, Carmel Gat, Almog Sarusi discovered in Gaza tunnel; families forum urges protests; autopsy said to find all 6 had gunshot wounds",
    "url": "https://www.timesofisrael.com/bodies-of-6-hostages-murdered-by-hamas-just-days-earlier-found-in-rafah-idf/"
  },
  {
    "text": "Americans love big cars, but new analysis suggests that the heaviest vehicles kill more people than they save  —  Witnesses said the driver showed no signs of slowing down.  On June 3rd Nicole Louthain and her six-year-old daughter were stopped at a red light in Grand Forks … ",
    "url": "https://www.economist.com/interactive/united-states/2024/08/31/americans-love-affair-with-big-cars-is-killing-them"
  },
  {
    "text": "Harris's Team, With a Wink, Insists She's an Underdog  —  Her campaign's message that Democrats are losing, which she never voiced when President Biden was tanking the ticket, is an artful attempt to lower expectations.  —  Days before the debate that ended up cutting off President Biden's path … ",
    "url": "https://www.nytimes.com/2024/09/01/us/politics/harris-democrats-trump.html"
  },
  {
    "text": "GOP network props up liberal third-party candidates in key states, hoping to siphon off Harris votes  —  WASHINGTON (AP) — Italo Medelius was leading a volunteer drive to put Cornel West on North Carolina's presidential ballot last spring when he received an unexpected call from a man named Paul who said he wanted to help.",
    "url": "https://apnews.com/article/cornel-west-jill-stein-republican-network-harris-4089fb0c9ebb16002e56a1c254a21b0e"
  },
  {
    "text": "Tulsi Gabbard's journey to Donald Trump is an ominous sign of Putin's power  —  From Democrat to pro-Putin isolationist: How did Tulsi Gabbard get here?  —  On Monday, former Democratic House member Tulsi Gabbard, D-HI, endorsed Donald Trump for the presidency and became one of his surrogates on the campaign trail.",
    "url": "https://www.salon.com/2024/09/01/tulsi-gabbards-journey-to-donald-is-an-ominous-sign-of-putins-power/"
  },
  {
    "text": "The kleptocrats aren't just stealing money.  They're stealing democracy … Donald Trump opened Trump Tower on Fifth Avenue in 1983 and occupied the penthouse himself.  The building was intended to advertise its owner's wealth, and also to attract other rich tenants — including, ironically, the very secretive rich.",
    "url": "https://www.ft.com/content/0876ef7a-bf88-463e-b8ca-bd9b4a11665c?accessToken=zwAGIQ6jzGSgkc8Idu96v4hGPtO4yr2bShFmXA.MEUCIAjwvv97o-GbDWICTJI-1kTLgIEmpcxXnmKwyCJyAEX8AiEAlIQ0PFuVHD2nCcw9QF_fmrHm03OPnWdNSPjMpn70j5k&sharetype=gift&token=cbe21496-8086-4af8-a07c-7c2201d2995e"
  },
  {
    "text": "Conservative Columnist Tells Bemused CNN Host Vance ‘Has Not Had One Misstep’  —  POBODY'S NERFECT  —  Vance is Vance is “not necessarily the most warm and fuzzy campaigner,” Rich Lowry asserted, “but he is proven a tireless, fearless, really effective spokesman for this ticket.”",
    "url": "https://www.thedailybeast.com/national-review-eic-rich-lowry-tells-bemused-cnn-host-jd-vance-has-not-had-one-misstep"
  },
  {
    "text": "Justice Jackson says people “are entitled to know” what gifts judges accept … - A Gallup poll from July showed that just 43% of Americans approve of how the Supreme Court is doing its job.  — 66% of Republicans supported the court's work this previous term, 44% of Independents and 15% of Democrats said the same.",
    "url": "https://www.axios.com/2024/09/01/supreme-court-gifts-ketanji-brown-jackson-ethics-reform"
  },
  {
    "text": "Harris doesn't get convention bounce, but widens gap with women: POLL  —  Other key takeaways from ABC's poll include white men shifting to Trump.  —  Democratic presidential nominee and U.S. Vice President Kamala Harris takes the stage on Day 4 of the Democratic National Convention in Chicago, Illinois, Aug. 22, 2024.",
    "url": "https://abcnews.go.com/Politics/harris-trump-abc-news-ipsos-poll-convention-bounce-widens-gap-women/story?id=113246534"
  },
  {
    "text": "Trump Is Making New, Sketchy Foreign Business Deals  —  From Saudi Arabia to Serbia, despots are cozying up, likely in preparation for a second term.  —  When Donald Trump launched his first presidential campaign nearly a decade ago, there was a deluge of concerns about his foreign financial entanglements.",
    "url": "https://nymag.com/intelligencer/article/trump-is-making-new-sketchy-foreign-business-deals.html"
  },
  {
    "text": "Musk's Twitter investors have lost billions in value  —  Elon Musk bought Twitter with a combination of his own money, bank loans and capital raised from friends and associates.  Here's how far his investors are underwater.  —  When Elon Musk bought Twitter and renamed it X, he didn't do it alone.",
    "url": "https://www.washingtonpost.com/technology/2024/09/01/musk-twitter-investors-underwater/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI1MTYzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2NTQ1NTk5LCJpYXQiOjE3MjUxNjMyMDAsImp0aSI6IjQ1Y2NkMWI5LTNkZmUtNDM3OC1iNjFkLWU4YmFiZGE3NGU0NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDkvMDEvbXVzay10d2l0dGVyLWludmVzdG9ycy11bmRlcndhdGVyLyJ9.r88ML3FI4pKvj91hBZUYiLfLuIwMcsXjEoP8xc2mxBI&itid=gfta"
  },
  {
    "text": "How Authoritarians Target Universities  —  Welcome back to Lucid, and hello to all new subscribers.  Our next Q&A is tonight, Sunday, Sept. 1, 8-9pmET.  Our guest will be Jason Stanley, Jacob Urowski Professor of Philosophy at Yale University and author of the forthcoming book Erasing History … ",
    "url": "https://lucid.substack.com/p/how-authoritarians-target-universities"
  },
  {
    "text": "Thousands Of U.S. Hotel Workers Are On Strike  —  The walkouts hit more than two dozen hotels in eight cities, according to the workers' union.  —  LOADING  —  Thousands of hotel workers around the country walked off the job Sunday amid labor disputes with several major hotel chains.",
    "url": "https://www.huffpost.com/entry/thousands-us-hotel-workers-strike_n_66d49470e4b0f968d26ceca8"
  }
]