[
  {
    "text": "Trump campaign staff had altercation with official at Arlington National Cemetery  —  Two members of Donald Trump's campaign staff had a verbal and physical altercation Monday with an official at Arlington National Cemetery where the former president participated in a wreath laying ceremony, NPR has learned.",
    "url": "https://www.npr.org/2024/08/27/nx-s1-5091154/trump-arlington-cemetery"
  },
  {
    "text": "Trump visit to Arlington Cemetery sparks alleged altercation with aides  —  An NPR source said a cemetery official was pushed and verbally accosted as they tried to block campaign aides from photographing.  —  Arlington National Cemetery officials on Tuesday acknowledged an unspecified … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/27/trump-arlington-cemetery-npr-incident/"
  },
  {
    "text": "Jack Smith Isn't Backing Down  —  When the Supreme Court ruled last month that presidents are immune from prosecution for anything done as an official act, many observers reacted with immediate horror.  They warned that the ruling would allow future presidents to act as despots, doing whatever they like without fear of accountability.",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/jack-smith-isnt-backing-down/679635/"
  },
  {
    "text": "New federal indictment filed against Trump in federal Jan. 6 case  —  The superseding indictment brought by special counsel Jack Smith follows a historic Supreme Court ruling granting broad immunity to presidents for official acts.  —  Special counsel Jack Smith has filed a new indictment … ",
    "url": "https://www.washingtonpost.com/national-security/2024/08/27/trump-dc-indictment-new-charges-jan-6/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0NzMxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2MTEzNTk5LCJpYXQiOjE3MjQ3MzEyMDAsImp0aSI6ImRmNThmNzM0LTcwMTQtNGU5NC05MDA1LTEyOWEzMzk0MTQ3NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI0LzA4LzI3L3RydW1wLWRjLWluZGljdG1lbnQtbmV3LWNoYXJnZXMtamFuLTYvIn0.T1RTMQOPlpCKKHBtnRCVXK2tCpj4jGeeyMHiMyDN5DA&itid=gfta"
  },
  {
    "text": "Trump charged in superseding indictment in election interference case following SCOTUS ruling  —  The new indictment adjusts the charges to the Supreme Court's immunity ruling.  —  LIVE  —  Republican presidential nominee, former President Donald Trump greets the crowd before speaking during … ",
    "url": "https://abcnews.go.com/Politics/donald-trump-charged-superseding-indictment-federal-election-subversion/story?id=113193224"
  },
  {
    "text": "Mark Zuckerberg's letter about Facebook censorship is not what it seems  —  This week Mark Zuckerberg sent Rep. Jim Jordan (R-OH) a letter outlining how the Biden administration pressured his company to “censor” free speech on Facebook — specifically misinformation about Covid-19.",
    "url": "https://www.vox.com/technology/369136/zuckerberg-letter-facebook-censorship-biden"
  },
  {
    "text": "Harris and Walz to sit with CNN for exclusive first joint interview since campaign began  —  Vice President Kamala Harris and Minnesota Gov. Tim Walz will sit with CNN for their first joint interview on Thursday as Democrats work to broaden their base's excitement from last week's Democratic National Convention.",
    "url": "https://www.cnn.com/2024/08/27/politics/kamala-harris-cnn-interview"
  },
  {
    "text": "Kamala's Campaign Pushes Trump's Impulse Control Problems  —  I don't think that even the outlets that recognize the troll are giving the Kamala Harris campaign enough credit for the jujitsu they're engaged in with the debate.  Before I explain why, though, here's a video of Barack Obama's skewering … ",
    "url": "https://www.emptywheel.net/2024/08/27/kamalas-campaign-pushes-trumps-impulse-control-problems/"
  },
  {
    "text": "North Carolina Moves to Toss Up; Minnesota and New Hampshire Shift to Likely Democrat  —  Since the beginning of this cycle, Democrats were confident that President Joe Biden could win North Carolina.  Its demographic profile as an ethnically diverse and rapidly suburbanizing state looks similar … ",
    "url": "https://www.cookpolitical.com/analysis/national/national-politics/north-carolina-moves-toss-minnesota-and-new-hampshire-shift"
  },
  {
    "text": "'He's got to pay a price': Unaired footage reveals Nancy Pelosi's Jan. 6 fury  —  Previously unaired footage reviewed by POLITICO reveals how the former speaker quickly turned her focus to impeaching Donald Trump after Congress certified the 2020 election.  —  Nancy Pelosi spent the duration … ",
    "url": "https://www.politico.com/news/2024/08/27/nancy-pelosi-jan-6-fury-00176529"
  },
  {
    "text": "Robert F. Kennedy Jr. Sawed the Head Off a Whale and Drove It Home, Daughter Says  —  Three decades later, an environmental organization is calling for an investigation.  —  It is a violation of longstanding federal law to collect parts from the carcass of a protected marine animal if there are still “soft tissues” attached.",
    "url": "https://www.nytimes.com/2024/08/27/us/politics/rfk-jr-whale-head.html?unlocked_article_code=1.GU4.or3n.sY_XKxzY_FRY&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Trump's Approach to Florida's High-Stakes Abortion Amendment: Don't Ask.  Won't Tell.  —  TWENTY DAYS AGO, DONALD TRUMP promised he would soon discuss how he'll vote on Florida's abortion rights initiative.  But a number of evangelical leaders and advisers think he should just shut up about it.",
    "url": "https://www.thebulwark.com/p/trump-approach-to-florida-abortion-amendment-dont-ask-wont-tell"
  },
  {
    "text": "Scoop: Democrats dare GOP to impeach Biden … - “The whole investigation has been a debacle for them, they have egg all over their face,” said Rep. Jamie Raskin (D-Md.), who is House Minority Leader Hakeem Jeffries' (D-N.Y.) point-man on impeachment as ranking member of the Oversight Committee.",
    "url": "https://www.axios.com/2024/08/28/house-democrats-republicans-biden-impeachment"
  },
  {
    "text": "Lowe's becomes latest company to dial back DEI efforts aimed at LGBTQ groups  —  Lowe's changes follow closely on the heels of announcements by Harley Davidson and Jack Daniel's, as well as similar changes made by Tractor Supply, John Deere and Best Buy.  —  Home goods retailer Lowe's … ",
    "url": "https://www.nbcnews.com/business/business-news/lowes-becomes-later-paring-back-dei-efforts-rcna168380"
  },
  {
    "text": "Why Texas Republicans are souring on crypto  —  Playing the state's energy market has become more profitable than mining bitcoin  —  Cryptocurrency is now campaign talk, thanks to Donald Trump.  Last month, in their party platform, Republicans announced plans to bring an end to the … ",
    "url": "https://www.economist.com/united-states/2024/08/27/why-texas-republicans-are-souring-on-crypto"
  },
  {
    "text": "First rioter to enter Capitol during Jan. 6 attack is sentenced to over 4 years in prison  —  A Kentucky man who was the first rioter to enter the U.S. Capitol during a mob's attack on the building was sentenced on Tuesday to more than four years in prison.  —  A police officer who tried … ",
    "url": "https://www.latimes.com/world-nation/story/2024-08-27/first-rioter-to-enter-capitol-during-jan-6-attack-is-sentenced-to-over-4-years-in-prison"
  },
  {
    "text": "Walz appears on popular social media account SubwayTakes, latest stop in influencer battle  —  James Powel Sarah D. Wire Rachel BarberUSA TODAY  —  Democratic vice-presidential nominee and Minnesota Governor Tim Walz appeared on the popular social media account “SubwayTakes” Monday … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/27/tim-walz-subwaytakes-appearance-2024-election/74970834007/"
  },
  {
    "text": "Vance says new indictment against Trump is Fed's effort to do ‘more election interference’  —  Sen. JD Vance told reporters on Tuesday that the new indictment filed by Special Council Jack Smith in Donald Trump's Jan. 6 case is “an effort to influence the election.”  —  MORE VIDEOS",
    "url": "https://apnews.com/video/donald-trump-jd-vance-jd-vance-indictments-legal-proceedings-f428e50efd704f819aaa49cf404de340"
  },
  {
    "text": "How the media blew 2024′s election  —  I'm back — back from Chicago and also back, inshallah, with weekly newsletters from now until Election Day.  Friends and neighbors who watched on TV keep asking me what covering the Democratic National Convention was really like.",
    "url": "https://www.inquirer.com/columnists/attytood/media-elections-dnc-kamala-harris-military-20240827.html"
  }
]