[
  {
    "text": "Grateful, defiant Trump recounts surviving ‘surreal’ assassination attempt at rally: 'I'm supposed to be dead'  —  A grateful and at times defiant Donald Trump told The Post Sunday he's “supposed to be dead” as he recalled the harrowing moment a would-be assassin shot him at a Pennsylvania campaign rally.",
    "url": "https://nypost.com/2024/07/14/us-news/grateful-defiant-trump-recounts-surreal-assassination-attempt-at-rally-im-supposed-to-be-dead/"
  },
  {
    "text": "Multiple things are true about Trump's shooting  —  PN is a reader-supported publication made possible by paid subscribers.  Appreciate our independent journalism?  Then please sign up to support us.  —  ✍️ Subscribe to Public Notice ✍️  —  I picked a hell of a night to log off.",
    "url": "https://www.publicnotice.co/p/trump-shooting-butler-pennsylvania"
  },
  {
    "text": "Trump rally shooting upends Democrats' Biden crisis … - “We're all just focused on expressing condolences ... and keeping our teams safe,” said one House Democrat who has been fiercely critical of Biden.  — A senior House Democrat suggested the post shooting atmosphere in the party is too … ",
    "url": "https://www.axios.com/2024/07/14/house-democrats-biden-trump-rally-shooting"
  },
  {
    "text": "Trump rewrites Republican convention speech to focus on unity not Biden  —  WORLD EXCLUSIVE — Former President Donald Trump has completely rewritten his convention speech in light of the assassination attempt against him on Saturday and will call on Thursday for a new effort at national unity.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3082180/trump-rewrites-republican-convention-speech-focus-unity-not-biden/"
  },
  {
    "text": "Behind the Curtain: “Getting shot in the face changes a man” … - He can unify the party. … - He could unify America. … - He could box out Democrats. … - He could show a different side of himself.",
    "url": "https://www.axios.com/2024/07/15/trump-convention-speech-rnc-milwaukee"
  },
  {
    "text": "Democrats fret about the political fallout from the Trump rally shooting  —  “The presidential contest ended last night,” said a veteran Democratic consultant.  —  MILWAUKEE — In the hours after a would-be assassin fired a bullet through former President Donald Trump's ear, Panfilo DiCenzo … ",
    "url": "https://www.nbcnews.com/politics/2024-election/democrats-fret-political-fallout-trump-rally-shooting-rcna161789"
  },
  {
    "text": "Trump Allies Try to Bully Dems, Media to Shut Up About His Fascist Plans  —  Republicans are seeking to capitalize on Trump's assassination attempt — using it to demand everyone stop talking about his threats to democracy  —  As Donald Trump recovers from an assassination attempt … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-allies-fascist-plans-dems-media-1235060142/"
  },
  {
    "text": "‘BlueAnon’ conspiracy theories flood social media after Trump rally shooting  —  Researchers who track online conspiracies say liberals are increasingly vulnerable to — and generating — QAnon-like bursts of misinformation.  —  Minutes after Saturday's shooting at a Trump rally in Butler … ",
    "url": "https://www.washingtonpost.com/technology/2024/07/14/blueanon-conspiracy-theories-trump-rally-shooting/"
  },
  {
    "text": "Get a Grip, Democrats.  You Can Still Win This  —  Biden's not far behind, the economic conditions remain excellent, and a vile assassination attempt in July doesn't determine November's outcome.  —  “The presidential contest ended last night,” an unnamed “veteran Democratic political consultant” … ",
    "url": "https://washingtonmonthly.com/2024/07/15/get-a-grip-democrats-you-can-still-win-this/"
  },
  {
    "text": "Why Thomas Matthew Crooks tried to assassinate Donald Trump is a mystery to investigators and his ex-classmates  —  BETHEL PARK, Pa. — In the sea of caps and gowns, Thomas Matthew Crooks hardly stood out.Few people clapped when his name was called.  A YouTube video of his graduation … ",
    "url": "https://www.inquirer.com/news/pennsylvania/thomas-matthew-crooks-trump-shooting-bethel-park-20240714.html"
  },
  {
    "text": "FBI probing motives, background of Thomas Matthew Crooks, the Western Pa. gunman behind Donald Trump assassination attempt  —  A defiant Donald Trump called for unity and resilience a day after surviving an attempted assassination at a campaign rally in Western Pennsylvania … ",
    "url": "https://www.inquirer.com/news/pennsylvania/thomas-matthew-crooks-trump-shooter-id-butler-20240714.html"
  },
  {
    "text": "Donald Trump and the language of violence  —  In a shocking act on July 13, a man attempted to assassinate Donald Trump at a campaign rally in Butler, Pennsylvania.  Trump will recover from his wound but, tragically, a 50-year-old man attending the rally was shot and killed.",
    "url": "https://www.theframelab.org/donald-trump-language-of-violence/"
  },
  {
    "text": "Political Violence  —  Reflections from the 1920s and 1930s  —  What to make of the assassination attempt?  —  I am sharing a few thoughts about where we are, based on assassinations during the interwar period, the 1920s and 1930s.  It is distant enough that perhaps we can attend … ",
    "url": "https://snyder.substack.com/p/political-violence"
  },
  {
    "text": "‘Morning Joe’ pulled from air Monday because of Trump shooting  —  New York CNN  —  MSNBC will not air “Morning Joe,” its celebrated politics roundtable program, on Monday, opting to instead air continued breaking news coverage of the attempted assassination of former President Donald Trump.",
    "url": "https://www.cnn.com/2024/07/14/media/msnbc-morning-joe-pulled-trump-assassination/"
  },
  {
    "text": "Sen. Marsha Blackburn to deliver primetime speech at RNC  —  U.S. Sen. Marsha Blackburn will have a leading role at the Republican National Convention in Milwaukee this week with a primetime speaking slot.  — Blackburn is scheduled to speak Monday evening.",
    "url": "https://www.axios.com/local/nashville/2024/07/15/marsha-blackburn-speech-rnc"
  }
]