[
  {
    "text": "Trump puts new limits on Elon Musk  —  The president convened his secretaries, with Musk, to clarify power.  —  President Donald Trump convened his Cabinet in person on Thursday to deliver a message: You're in charge of your departments, not Elon Musk.  —  According to two administration officials … ",
    "url": "https://www.politico.com/news/2025/03/06/trump-cabinet-musk-025093"
  },
  {
    "text": "DOGE targets child support database full of income data  —  Associates of Elon Musk's group provoked yet another clash with career civil servants over sensitive government records  —  Just now  —  Representatives of the U.S. DOGE Service have sought access to a powerful database of nearly … ",
    "url": "https://www.washingtonpost.com/business/2025/03/06/doge-hhs-ssa-data/"
  },
  {
    "text": "Republicans push Musk to let Congress vote on DOGE cuts  —  Republicans pushed Elon Musk on Wednesday in a pair of private meetings to move his efforts to slash federal spending and the federal workforce through Congress, as lawmakers vie for a seat at the table in the sweeping effort to overhaul government.",
    "url": "https://www.cnn.com/2025/03/05/politics/musk-doge-republicans/"
  },
  {
    "text": "We Found Elon Musk's DOGE Email Address and We're Fighting to Reveal His Messages  —  The Freedom of Information Act is a vital tool to expose how the U.S. government operates, and it's especially critical when it comes to Elon Musk's so-called Department of Government Efficiency.",
    "url": "https://theintercept.com/2025/03/06/elon-musk-doge-email-address-foia/"
  },
  {
    "text": "Trump Press Sec Accidentally Blurts Out Real Goal of His Tariff Scam  —  In his speech to Congress, President Trump kept lying about his tariffs, falsely claiming that Canada is letting huge amounts of fentanyl into our country and suggesting the trade wars will only get worse.",
    "url": "https://newrepublic.com/article/192391/trump-press-sec-accidentally-reveals-ugly-scam-behind-tariffs"
  },
  {
    "text": "Trump administration floats more exemptions from tariffs on Canadian and Mexican goods  —  Commerce Secretary Howard Lutnick said Thursday he expects Trump to make an announcement exempting goods compliant with the USMCA trade agreement.  —  Commerce Secretary Howard Lutnick suggested … ",
    "url": "https://www.nbcnews.com/politics/economics/trump-administration-floats-exemptions-tariffs-canadian-mexican-goods-rcna195110"
  },
  {
    "text": "Trump may have already planted the seeds of his political collapse  —  Over the last six weeks, President Trump has been spending political capital like a drunk at a casino who insists he's got “a system.”  If history is any predictor, his second term trajectory may already be set — right off a cliff, pedal to the floor.",
    "url": "https://thehill.com/opinion/campaign/5178643-trump-may-have-already-planted-the-seeds-of-his-political-collapse/"
  },
  {
    "text": "Exclusive: Trump plans to revoke legal status of Ukrainians who fled to US, sources say  —  U.S. President Donald Trump's administration is planning to revoke temporary legal status for some 240,000 Ukrainians who fled the conflict with Russia, a senior Trump official and three sources familiar … ",
    "url": "https://www.reuters.com/world/us/trump-plans-revoke-legal-status-ukrainians-who-fled-us-sources-say-2025-03-06/"
  },
  {
    "text": "DOGE is driving Social Security cuts and will make mistakes, acting head says privately  —  The Social Security Administration's acting commissioner said members of Elon Musk's cost-cutting team are outsiders who are unfamiliar with the nuances of the agency's programs.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/03/06/doge-is-driving-social-security-cuts-will-make-mistakes-acting-head-says-privately/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxMjM3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNjE1OTk5LCJpYXQiOjE3NDEyMzcyMDAsImp0aSI6ImI1NWM2ODdkLWYyNGYtNGRiMy1iZDEzLTVjN2I2YWQwMjNhYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzA2L2RvZ2UtaXMtZHJpdmluZy1zb2NpYWwtc2VjdXJpdHktY3V0cy13aWxsLW1ha2UtbWlzdGFrZXMtYWN0aW5nLWhlYWQtc2F5cy1wcml2YXRlbHkvIn0.YuFgrKQpIsfmrFc7hUR5Q9nksxXiarod42OowD2eJVw&itid=gfta"
  },
  {
    "text": "Social Security Workers Aren't Allowed to Read This Story  —  New internet restrictions at the embattled SSA have cut off access to WIRED, along with other “general news” websites like The Washington Post and The New York Times.  —  Employees at the Social Security Administration (SSA) … ",
    "url": "https://www.wired.com/story/social-security-workers-arent-allowed-to-read-this-story/"
  },
  {
    "text": "Social Security Administration bars employees from reading the news at work  —  In a Thursday morning email, the Social Security Administration said it was “implementing additional restrictions” on web-browsing.  —  The Social Security Administration wrote in a Thursday morning email … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/social-security-administration-bars-employees-reading-news-work-rcna195096"
  },
  {
    "text": "Gavin Newsom breaks with Democrats on trans athletes in sports  —  The Democratic California governor made the stunning remarks in his debut podcast with conservative guest Charlie Kirk.  —  California Gov. Gavin Newsom, a pioneer for LGBTQ+ rights who decades ago upset leaders in his own party … ",
    "url": "https://www.politico.com/news/2025/03/06/gavin-newsom-breaks-with-democrats-on-trans-athletes-in-sports-00215436"
  },
  {
    "text": "The Advice Elissa Slotkin Didn't Take  —  Right around the time that Donald Trump was arriving at the U.S. Capitol to address a joint session of Congress—the longest such speech, it would turn out, in the history of the presidency—Elissa Slotkin, the newly elected Michigan senator tasked … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/elissa-slotkin-democratic-resistance/681933/?gift=Anx5_Gw2ocfAXDdTqoOT9zh7SzkF8bra1oqZ4EHCuyg&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Draft of Trump Executive Order Aims to Eliminate Education Department  —  Secretary Linda McMahon would be directed to ‘take all necessary steps to facilitate the closure’  —  President Trump is expected to issue an executive order as soon as Thursday aimed at abolishing the Education Department … ",
    "url": "https://www.wsj.com/politics/policy/draft-of-trump-executive-order-aims-to-eliminate-education-department-5315c3a4?st=i92oTT"
  },
  {
    "text": "US employers cut more jobs last month than any February since 2009  —  The Trump administration's massive federal cuts and swelling feelings of economic uncertainty helped fuel a recession-level spike in layoffs last month, new data showed Thursday.  —  US-based employers last month announced plans … ",
    "url": "https://www.cnn.com/2025/03/06/economy/us-jobs-report-february-preview/"
  },
  {
    "text": "Trump considering major NATO policy shift  —  The president has discussed possibly favoring members of the alliance that spend a set percentage of their GDP on defense, sources told NBC News.  —  WASHINGTON — President Donald Trump is considering a major change to the U.S.' participation … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-considering-major-nato-policy-shift-rcna195089"
  },
  {
    "text": "As Trump pivots to Russia, allies weigh sharing less intel with U.S.  —  Members of the so-called Five Eyes spy alliance, as well as Israeli and Saudi officials, fear the identities of foreign assets could inadvertently be shared with Moscow.  —  Some U.S. allies are considering scaling … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-pivots-russia-allies-weigh-sharing-less-intel-us-rcna194420"
  },
  {
    "text": "Small World … The White House is, at least according to Bloomberg, well on its way to creating a sovereign wealth fund, despite having no authority to create one and no legal source of money to fund it.  But now they've hired a guy to run it, Michael Grimes.  And small world, he's Elon's banker.",
    "url": "https://talkingpointsmemo.com/edblog/small-world-5"
  },
  {
    "text": "Inside the Trump White House's relentless strategy to dominate the news  —  The Trump administration has transformed its traditional press shop into a rapid-response influencer operation, and “they're all offense, all the time.”  —  When actress Selena Gomez posted an Instagram video … ",
    "url": "https://www.washingtonpost.com/technology/2025/03/06/trump-white-house-media-social-influencers/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxMjM3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNjE1OTk5LCJpYXQiOjE3NDEyMzcyMDAsImp0aSI6ImJiMTQ4MTlkLWQ2MTMtNDg1YS1iYmJhLWNmNjU2NTVhYzI2OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDMvMDYvdHJ1bXAtd2hpdGUtaG91c2UtbWVkaWEtc29jaWFsLWluZmx1ZW5jZXJzLyJ9.tOM9BXPU1d-LVQieSuub1V4iS7euDtF2RSDp2EzMiZA&itid=gfta"
  },
  {
    "text": "‘People Are Going Silent’: Fearing Retribution, Trump Critics Muzzle Themselves … More than six weeks into the second Trump administration, there is a chill spreading over political debate in Washington and beyond.By Kenny Holston/The New York Times  —  The silence grows louder every day.",
    "url": "https://www.nytimes.com/2025/03/06/us/politics/trump-democracy.html?unlocked_article_code=1.104.bA78.onhUDRzXTMl3"
  },
  {
    "text": "Trump's US destroying world order, says Ukraine's UK ambassador  —  LONDON — Ukraine's ambassador to the United Kingdom on Thursday accused the United States under Donald Trump of “destroying” the world order, as he attacked U.S. handling of the war in Ukraine.",
    "url": "https://www.politico.eu/article/donald-trump-world-order-us-ukraine-kremlin-russia-uk-ambassador/"
  },
  {
    "text": "D.C. U.S. attorney tells Georgetown he won't hire from any school with ‘DEI’  —  Trump appointee Ed Martin made the claim in a letter to the Georgetown University law school dean.  Martin has called the school a “locus” of anti-Trump activity.  —  Interim D.C. U.S. Attorney Ed Martin demanded … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/03/05/dc-us-attorney-ed-martin-georgetown-law-dei/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxMTUwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyNTI5NTk5LCJpYXQiOjE3NDExNTA4MDAsImp0aSI6ImE0OTNmYTMwLTJhZDUtNGU3My04M2RmLTM2NzJmNGRjNzM2ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzAzLzA1L2RjLXVzLWF0dG9ybmV5LWVkLW1hcnRpbi1nZW9yZ2V0b3duLWxhdy1kZWkvIn0.Uujxg57xqPkIGE-3fDop4fwqrWHG5T8Mcm_JRXzFTLA&itid=gfta"
  },
  {
    "text": "Why Elon Musk and Ben Shapiro want Trump to pardon George Floyd's murderer  —  The video depicting Floyd's murder hasn't changed in five years.  But the Republican Party has.  —  Shortly after the video of George Floyd's death went viral in May 2020, a popular conservative pundit released … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/derek-chauvin-pardon-trump-ben-shapiro-elon-musk-rcna194497"
  },
  {
    "text": "FEMA's top lawyer placed on leave after less than one week in role  —  The Handbasket is 100% subscriber-funded.  If you want to support independent media during these dark times for democracy, become a paid subscriber today.  —  Video  —  Joshua Stanton had served as Acting Chief Counsel … ",
    "url": "https://www.thehandbasket.co/p/fema-lawyer-on-leave-josh-stanton"
  },
  {
    "text": "Facing Trump's threats, Columbia investigates students critical of Israel  —  Columbia University senior Maryam Alwan was visiting family in Jordan over winter break when she received an email from the school accusing her of harassment.  Her supposed top offense: writing an op-ed … ",
    "url": "https://apnews.com/article/columbia-university-campus-protests-trump-congress-ba0eddec4679d70287202831c52ebed6"
  }
]