[
  {
    "text": "Trump nominates Charles Kushner, father of Jared Kushner, as US Ambassador to France  —  WASHINGTON - President-elect Donald Trump selected Charles Kushner, father of Jared Kushner, to serve as U.S. Ambassador to France on Saturday.  —  “I am pleased to nominate Charles Kusher, of New Jersey … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/11/30/trump-charles-kushner-france-ambassador/76677177007/"
  },
  {
    "text": "Trump wants pardoned real estate developer Charles Kushner to become US ambassador to France  —  President-elect Donald Trump said Saturday he intends to nominate real estate developer Charles Kushner, father of Trump's son-in-law Jared Kushner, to serve as ambassador to France.",
    "url": "https://apnews.com/article/trump-france-ambassador-charles-kushner-pardon-c3835be92b1fbd1dffcd05707cba9f52"
  },
  {
    "text": "Trump Names Charles Kushner as Pick for Ambassador to France  —  The announcement elevated Mr. Kushner, the father of President Donald J. Trump's son-in-law and the recipient of a presidential pardon at the end of Mr. Trump's first term.  —  President-elect Donald J. Trump announced on Saturday … ",
    "url": "https://www.nytimes.com/2024/11/30/us/politics/trump-charles-kushner-france-ambassador.html"
  },
  {
    "text": "Charles Kushner, pardoned in 2020, to be nominated ambassador to France  —  The New Jersey real estate developer, political donor and philanthropist is also the father of Trump's son-in-law Jared Kushner.  —  President-elect Donald Trump said on Saturday he would nominate Charles Kushner … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/30/donald-trump-charles-kushner/"
  },
  {
    "text": "Trump Says He Will Nominate Kash Patel to Run F.B.I.  —  President-elect Donald J. Trump turned to a firebrand loyalist to become director of the bureau, which he sees as part of a ‘deep state’ conspiracy against him.  —  President-elect Donald J. Trump said on Saturday that he wants … ",
    "url": "https://www.nytimes.com/2024/11/30/us/politics/trump-replace-christopher-wray.html"
  },
  {
    "text": "Corporate America Launches Unorthodox Campaign to Gain Trump's Attention  —  Companies look at scrubbing left-leaning policies from their websites and scoping out appearances on conservative podcasts  —  Corporate America is unleashing an unorthodox campaign to influence Donald Trump's agenda … ",
    "url": "https://www.wsj.com/politics/trump-transition-lobbying-company-image-ffd42d2e?st=JPBsv7&reflink=article_copyURL_share"
  },
  {
    "text": "Journalists flock to Bluesky as X becomes increasingly ‘toxic’  —  Journalists are finding more readers and less hate on Bluesky than on the platform they used to know as Twitter.  —  When Ashton Pittman, an award-winning news editor and reporter, first joined the app Bluesky, he said … ",
    "url": "https://www.nbcnews.com/tech/social-media/bluesky-x-becomes-social-media-rcna181685"
  },
  {
    "text": "Trump threatens 100% tariff on the BRIC bloc of nations if they act to undermine US dollar  —  President-elect Donald Trump on Saturday threatened 100% tariffs against a bloc of nine nations if they act to undermine the U.S. dollar.  His threat was directed at countries in the so-called BRIC alliance … ",
    "url": "https://apnews.com/article/trump-dollar-dominance-brics-treasury-8572985f41754fe008b98f38180945c3"
  },
  {
    "text": "What to know about sudden rebel gains in Syria's 13-year war and why it matters  —  The 13-year civil war in Syria has roared back into prominence with a surprise rebel offensive on Aleppo, one of Syria's largest cities and an ancient business hub.  The push is among the rebels' strongest … ",
    "url": "https://apnews.com/article/syria-hts-assad-aleppo-fighting-2be43ee530b7932b123a0f26b158ac22"
  },
  {
    "text": "Democrats Weigh Dumping Nadler, Regrouping to Counter Trump  —  Some House Democrats want to oust aging committee leaders like Representative Jerrold Nadler in favor of younger lawmakers who they see as better suited to take on the president.  —  House Democrats are considering pushing aside … ",
    "url": "https://www.nytimes.com/2024/11/30/us/politics/democrats-nadler-raskin.html?unlocked_article_code=1.d04.O4Lp.-L_mNecSV85s&smid=url-share"
  },
  {
    "text": "Pete Hegseth's Mom Said He Abused ‘Many’ Women in Bombshell Email  —  CLOSE TO HOME  —  The family matriarch said in a 2018 email that she had “no respect” for the Fox News host turned Trump defense secretary nominee.  —  Pete Hegseth's mother trashed his character in a blistering email shortly … ",
    "url": "https://www.thedailybeast.com/pete-hegseths-mom-said-he-abused-many-women-in-bombshell-email/"
  },
  {
    "text": "Emboldened ‘manosphere’ accelerates threats and demeaning language toward women after US election  —  In the days after the presidential election, Sadie Perez began carrying pepper spray with her around campus.  Her mom also ordered her and her sister a self-defense kit that included keychain spikes … ",
    "url": "https://apnews.com/article/trump-harris-election-womens-rights-social-media-d5cea53480437ac8bf837aaa821e5681"
  },
  {
    "text": "Trump says he will replace FBI Director Wray with loyalist Kash Patel  —  Because FBI directors serve 10-year terms, Trump would have to fire Wray — or Wray would have to resign — for Patel to take over the bureau.",
    "url": "https://www.washingtonpost.com/politics/2024/11/30/trump-kash-patel-fbi-director/"
  },
  {
    "text": "Dems fear Harris' continued fundraising ‘erodes trust’  —  The fundraising emails sound as urgent as ever, even following her defeat.  —  The 2024 election is over.  But Kamala Harris' fundraising emails keep coming — and sound as urgent as ever.  —  “Even a quick donation of $50 is enough … ",
    "url": "https://www.politico.com/news/2024/11/30/harris-campaign-fundraising-democrats-trust-00191919"
  },
  {
    "text": "Trump promised Jan. 6 pardons.  His post-election silence is making loyalists nervous.  —  His die-hard supporters — as well as some federal judges — are left to speculate about his clemency plans.  —  Donald Trump campaigned on a pledge to pardon a vast swath of supporters who stormed the Capitol on Jan. 6, 2021.",
    "url": "https://www.politico.com/news/2024/11/30/trump-january-6-pardons-00192036"
  },
  {
    "text": "After two flops, pollsters think they finally figured out Trump  —  In Donald Trump's last election, pollsters say they ultimately cracked the challenge of pinning down his voters.  —  For pollsters hoping to accurately forecast an election with Donald Trump at the top of the ticket … ",
    "url": "https://www.politico.com/news/2024/11/30/polling-trump-pollsters-2024-00192027"
  }
]