[
  {
    "text": "George Conway calls Trump an ‘evil man’ with ‘no conscience’ after defamation verdict  —  Conservative attorney George Conway railed against former President Trump, calling him an “evil man,” after a jury ruled Trump must pay columnist E. Jean Carroll for defaming her by repeatedly denying her sexual assault allegations.",
    "url": "https://thehill.com/regulation/court-battles/4433185-george-conway-trump-evil-man-after-defamation-verdict/"
  },
  {
    "text": "Details of Trump's $83.3 Million Payment to E. Jean Carroll  —  Donald J. Trump — the rare defendant who can afford a judgment of this size — could secure a bond to cover it while his appeals play out.  —  Donald J. Trump might one day have to pay E. Jean Carroll the $83.3 million she was awarded, but that day is not today.",
    "url": "https://www.nytimes.com/2024/01/26/nyregion/trump-carroll-pay-83-million.html"
  },
  {
    "text": "$83.3 Million  —  I had not intended to write about the E Jean Carroll trial again tonight; I was going to give you a night off.  But it's impossible not to, with the jury reaching its decision after just a few hours of deliberation.  Beyond the verdict, there were some interesting … ",
    "url": "https://joycevance.substack.com/p/833-million"
  },
  {
    "text": "Democrats' not-so-secret weapon in House races: Donald Trump  —  Democrats trying to claim competitive House seats in New York are hoping to tie GOP opponents to the former president.  —  ALBANY, N.Y. — A noun, a verb and Donald Trump.  —  Democrats are banking on the former president again … ",
    "url": "https://www.politico.com/news/2024/01/27/trump-election-house-races-00138162"
  },
  {
    "text": "On Trump-Biden rematch, many senators say bring it on  —  Republicans and Democrats see the general election as historic moment pitting clearly different visions and records  —  Congressional bureau chief  —  Unlike some American voters, senators have come to grips with the reality … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/27/biden-trump-rematch-senators/"
  },
  {
    "text": "Trump's ‘achilles heel’?  Haley's refusal to drop out infuriates ex-president  —  A surprisingly disciplined campaign risks derailment as Trump lashes out at his former UN ambassador for staying in race  —  It was a moment for Donald Trump to be gracious, magnanimous, perhaps even presidential.",
    "url": "https://www.theguardian.com/us-news/2024/jan/27/donald-trump-nikki-haley-republican-nomination"
  },
  {
    "text": "Trump Bashes ‘Worst’ Ever Border as He Arm-Twists GOP Lawmakers to Block Border Bill  —  Trump calls American border ‘worst ever in the history of the world,’ yet is working furiously behind the scenes to block bipartisan bill to boost security  —  Former President Donald Trump on Saturday attacked … ",
    "url": "https://themessenger.com/politics/trump-bashes-worst-ever-border-as-he-arm-twists-gop-lawmakers-to-block-border-bill"
  },
  {
    "text": "Biden says he'll shut down the border if deal gives him authority  —  The White House statement comes after a week of frantic negotiations in the Senate.  —  President Joe Biden on Friday urged Congress to pass a bipartisan bill to address the immigration crisis at the nation's southern border … ",
    "url": "https://www.politico.com/news/2024/01/26/biden-urges-bipartisan-border-deal-00138206"
  },
  {
    "text": "The 2024 door is closing faster than Haley thinks.  Here's what the delegate math shows.  —  Nikki Haley isn't wrong when she says it's early in the GOP primary — less than 3 percent of delegates have been awarded so far.  —  But the rest of the states are coming fast … ",
    "url": "https://www.politico.com/news/2024/01/27/republican-delegates-haley-trump-00138191"
  },
  {
    "text": "UNRWA Is Investigating Charges of Workers' Involvement in Oct. 7 Attacks  —  The United States temporarily cut off funding to UNRWA, the agency that aids Palestinians, citing allegations that 12 of its workers were involved in the Hamas-led assault on southern Israel.",
    "url": "https://www.nytimes.com/2024/01/26/world/middleeast/un-aid-israel-oct-7-attacks.html"
  },
  {
    "text": "We Need Your Email Address  —  Join the newsletter to get the latest updates.  —  Success  —  Great!  Check your inbox and click the link.  —  Error  —  Please enter a valid email address.  —  You might have noticed that over the last few days, we've begun requiring readers to sign … ",
    "url": "https://www.404media.co/why-404-media-needs-your-email-address/"
  },
  {
    "text": "Donald Trump is preparing for a massive new trade war with China  —  The former president has talked to advisers about imposing a 60 percent tariff sure to enrage Beijing  —  Former president Donald Trump is weighing options for a major new economic attack on China if reelected … ",
    "url": "https://www.washingtonpost.com/business/2024/01/27/trump-china-trade-war/"
  },
  {
    "text": "Giuliani Notes Trump's ‘Unpaid Legal Fees’ in Bankruptcy Filing  —  He says his monthly net income is just $2,308.  —  A beleaguered and broke Rudy Giuliani listed a “possible claim for unpaid legal fees against Donald J. Trump” in bankruptcy filings submitted to court Friday.",
    "url": "https://www.thedailybeast.com/giuliani-notes-trumps-unpaid-legal-fees-in-bankruptcy-filing"
  },
  {
    "text": "The News Business Really Is Cratering  —  The state of the industry is more dire than ever.  —  Journalists across the country burst into flames of panic this week, as bad news for the news business crested and erupted everywhere all at once.  —  Patrick Soon-Shiong … ",
    "url": "https://www.politico.com/news/magazine/2024/01/27/is-the-journalism-death-spasm-finally-here-00138187"
  },
  {
    "text": "Eager for Economic Wins, Biden to Announce Billions for Advanced Chips  —  Industry, lawmakers worry semiconductor production could take years because of negotiations, permitting and worker shortages  —  WASHINGTON—The Biden administration, eager to highlight a signature economic initiative … ",
    "url": "https://www.wsj.com/politics/policy/eager-for-economic-wins-biden-to-announce-billions-for-advanced-chips-7e341e30?mod=followamazon"
  },
  {
    "text": "Trader Joe's Follows SpaceX in Arguing US Labor Board Is Unconstitutional  — Grocery chain tries new argument to fight union-busting charge  — Decision on constitutionality is unlikely before an appeal … At a Jan. 16 National Labor Relations Board hearing in Connecticut … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-26/trader-joe-s-follows-spacex-in-arguing-nlrb-is-unconstitutional"
  },
  {
    "text": "Joe Biden Can—and Should—Take Over the Texas National Guard  —  If Greg Abbott is going to use his National Guard to flout the Constitution, the president should do as Dwight D. Eisenhower once did and nationalize the state agency entirely. … Listen to this full episode of The New Abnormal … ",
    "url": "https://www.thedailybeast.com/joe-biden-canand-shouldtake-over-the-texas-national-guard"
  }
]