[
  {
    "text": "‘Enough to make Reagan ill’: Trump's NATO remarks under fire  —  “Honestly this seems kinda important,” said Sen. Brian Schatz.  —  Democrats and some Republicans were quick to condemn Donald Trump after the former president said Saturday night he would “encourage” Russia to attack … ",
    "url": "https://www.politico.com/news/2024/02/11/trump-nato-remarks-democrats-putin-00140848"
  },
  {
    "text": "GOP senators defy Trump by advancing foreign aid bill  —  The vote was a decisive 67-27.  —  Donald Trump spent the weekend telling senators they should not pass more unconditional U.S. foreign aid.  More than a dozen Republicans ignored him Sunday, moving forward on a bill to send $95 billion in aid to Ukraine, Israel and Taiwan.",
    "url": "https://www.politico.com/news/2024/02/11/gop-senators-defy-trump-by-advancing-foreign-aid-00140868"
  },
  {
    "text": "Favoring Foes Over Friends, Trump Threatens to Upend International Order  —  Former President Donald J. Trump suggested that he would incite Russia to attack “delinquent” U.S. allies, foreshadowing potentially far-reaching changes in the world order if he wins the White House again.",
    "url": "https://www.nytimes.com/2024/02/11/us/politics/trump-nato.html"
  },
  {
    "text": "Trump says he would ‘encourage’ Russia to attack Nato allies who do not pay their bills  —  Watch: Trump would not protect countries from attack by Russia if they do not pay enough into Nato  —  Donald Trump has said he would “encourage” Russia to attack any Nato member that fails to pay … ",
    "url": "https://www.bbc.com/news/world-us-canada-68266447"
  },
  {
    "text": "Trump says he wouldn't defend NATO allies from Russia if they're ‘delinquent’  —  CONWAY, S.C. - Former President Donald Trump said America would not defend NATO allies against Russia if they did not meet his definition of contributing enough defense spending, threatening to upend the alliance if elected president again in 2024.",
    "url": "https://www.npr.org/2024/02/11/1230658309/trump-would-encourage-russia-to-attack-nato-allies-who-dont-pay-bills"
  },
  {
    "text": "Trump says he would encourage Russia to ‘do whatever the hell they want’ to any NATO country that doesn't pay enough  —  Former President Donald Trump on Saturday said he would encourage Russia to do “whatever the hell they want” to any NATO member country that doesn't meet spending guidelines … ",
    "url": "https://www.cnn.com/2024/02/10/politics/trump-russia-nato/"
  },
  {
    "text": "Trump meets with GOP megadonor Miriam Adelson  —  The former president had dinner with the casino executive on Thursday.  —  Former President Donald Trump dined with casino executive Miriam Adelson in Las Vegas on Thursday, his latest indication he is moving to consolidate the support of the Republican donor class.",
    "url": "https://www.politico.com/news/2024/02/11/trump-gop-megadonor-miriam-adelson-00140860"
  },
  {
    "text": "Trump says he would encourage Russia to attack Nato allies who pay too little  —  Republican senator Marco Rubio seeks to downplay meaning of remarks as White House describes them as ‘unhinged’  —  A Republican senator has sought to calm rising European security anxieties created by Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/11/donald-trump-says-he-would-encourage-russia-to-attack-nato-countries-who-dont-pay-bills"
  },
  {
    "text": "Nato says Trump comments ‘undermine all of our security’  —  And so it begins.  Nine months still to go before the next US presidential election and already the Republican party favourite and former President Donald Trump is sending eyebrows and blood pressure skywards in Nato capitals with his provocative statements.",
    "url": "https://www.bbc.com/news/world-us-canada-68268817"
  },
  {
    "text": "Biden's no-win immigration problem  —  President Biden's struggles with the chaos at the border are partly of his own doing.  But no president in recent history — including Donald Trump — has faced an immigration crisis of the scale that Biden has.",
    "url": "https://www.axios.com/2024/02/11/biden-immigration-border-crisis"
  },
  {
    "text": "Overwhelming majority of Americans think Biden is too old for another term: POLL  —  A majority also think Trump is too old for a second term.  —  President Joe Biden delivers remarks in the State Dining Room of the White House in Washington, D.C., on Feb. 6, 2024.",
    "url": "https://abcnews.go.com/Politics/poll-americans-on-biden-age/story?id=107126589"
  },
  {
    "text": "Biden moving closer to a breach with Netanyahu over war in Gaza  —  Some of Biden's aides are urging him to publicly criticize the Israeli prime minister as casualties mount  —  President Biden and his top aides are closer to a breach with Israeli Prime Minister Benjamin Netanyahu … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/11/biden-netanyahu-closer-to-a-breach/"
  },
  {
    "text": "Defense Secretary Lloyd Austin taken to hospital again, for potential ‘emergent bladder issue’  —  “The Secretary is retaining the functions and duties of his office.”  —  U.S. Defense Secretary Lloyd Austin delivers remarks during a meeting with Kenyan Defense Minister Aden Duale at the Pentagon on Feb. 07, 2024 in Arlington, Va.",
    "url": "https://abcnews.go.com/Politics/defense-secretary-lloyd-austin-hospitalized-potential-emergent-bladder/story?id=107142946"
  },
  {
    "text": "McCarthy foes face blowback as primary threats grow and GOP donors shut their wallets  —  Watch CNN's coverage of the eight House Republicans who voted to oust former Speaker Kevin McCarthy on “Inside Politics Sunday with Manu Raju” at 11 a.m. ET.  —  CNN  —  Donors no longer want to contribute to their campaigns.",
    "url": "https://www.cnn.com/2024/02/11/politics/kevin-mccarthy-foes-blowback/"
  }
]