[
  {
    "text": "Israel responds to fire from Syria with artillery and mortar  —  Drone footage captures extent of destruction caused by Israeli airstrikes in Gaza City  —  Concerns mount over Israel's next move as government vows to siege Gaza  —  Israel continues retaliation on fourth day of war",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-airstrikes-hostages-bf6c42f84526c4d9416978c8effd932a"
  },
  {
    "text": "Playbook: Will Dems keep standing with Israel?  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  ISRAEL LATEST — 11 Americans dead; some “likely” taken hostage ... IDF estimates 1,500 terrorists dead inside Israel ... U.S. begins arms shipments … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/10/will-dems-keep-standing-with-israel-00120673"
  },
  {
    "text": "Biden decries “evil” Hamas attack, says Americans being held hostage  —  The president vowed to stand by Israel and said it has a “duty” to respond  —  President Biden said Tuesday that Americans were among the hostages being held by Hamas, in addition to the 14 who have been killed … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/biden-israel-us-gaza-hamas/"
  },
  {
    "text": "A tantalizing detail in a new Trump legal filing  —  The government signals it plans to prove Donald Trump's much-debated intent for taking and keeping classified documents  —  Donald Trump's many legal problems have led to a veritable fire hose of often-mundane, procedural court filings.",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/trump-classified-documents-motive/"
  },
  {
    "text": "After years of exaggerating his business assets, Trump confronts them in court  —  A civil case entering its second week threatens to put on display unprecedented details about how Trump's business operated  —  When Donald Trump needed to value his Trump Tower apartment for homeowner's insurance in 2010 … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/trump-fraud-trial-property-value-wealth/"
  },
  {
    "text": "Prosecutors Ask if Trump Will Blame His Lawyers as Defense in Election Case  —  The special counsel asked a judge to require the former president to disclose whether he would blame poor legal advice for his attempts to overturn his 2020 election loss.  —  Federal prosecutors asked a judge … ",
    "url": "https://www.nytimes.com/2023/10/10/us/politics/prosecutors-trump-blame-lawyers.html"
  },
  {
    "text": "AOC knocks ‘bigotry and callousness’ of Times Square rally for Palestinians  —  “It should not be hard to shut down hatred and antisemitism where we see it.  That is a core tenet of solidarity,” Ocasio-Cortez said.  —  NEW YORK — The New York City chapter of the Democratic Socialists … ",
    "url": "https://www.politico.com/news/2023/10/10/aoc-pro-palestine-nyc-rally-00120684"
  },
  {
    "text": "Heat for NYC-DSA after pro-Palestine rally  —  HAPPENING TODAY: Former Rep. Tom Suozzi is expected to launch his comeback bid for the seat now held by Rep. George Santos, three people familiar with the plan told Playbook.  The Democrat — and many other challengers — are thinking … ",
    "url": "https://www.politico.com/newsletters/new-york-playbook/2023/10/10/heat-for-nyc-dsa-after-pro-palestine-rally-00120675"
  },
  {
    "text": "Former Dodgers star and Republican Steve Garvey enters U.S. Senate race  —  After nearly two decades of statewide Republican candidates being rejected by California's left-leaning electorate, former Dodger All-Star Steve Garvey hopes to drag the GOP back toward political relevance.",
    "url": "https://www.latimes.com/politics/story/2023-10-10/dodgers-star-steve-garvey-senate-race-feinstein-schiff-porter-lee"
  },
  {
    "text": "North Carolina Republicans override governor's veto on key election law  —  Gov. Roy Cooper (D) has cast the bill as a threat to democracy in the state.  Republicans say it takes politics out of the process of administering the vote.  —  North Carolina Republican lawmakers on Tuesday overrode … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/north-carolina-republican-override-veto/"
  },
  {
    "text": "Gallego leads Lake, Sinema in Arizona Senate race: poll  —  Rep. Ruben Gallego (D-Ariz.) is leading both former Arizona gubernatorial candidate Kari Lake (R) and Sen. Krysten Sinema (I-Ariz.) in a hypothetical three-way race for Sinema's Arizona Senate seat, according to a new poll.",
    "url": "https://thehill.com/homenews/campaign/4246848-gallego-leads-lake-sinema-in-arizona-senate-race-poll/"
  },
  {
    "text": "Jim Jordan's new shutdown threat highlights an unnerving right-wing trend  —  Republicans spend more time talking about the practical problems posed by the U.S.-Mexico border than any other issue — even as much of what they propose to address them is utter fantasy.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/10/jim-jordan-house-gop-government-shutdown/"
  },
  {
    "text": "McCarthy loyalists vow to draw out painful speakership battle  —  House Republicans' state of emotional limbo is particularly problematic, since they'd otherwise welcome the chance to move quickly on aiding Israel.",
    "url": "https://www.politico.com/live-updates/2023/10/10/congress/mccarthy-speaker-vote-israel-math-00120720"
  },
  {
    "text": "In Search of Kamala Harris  —  After nearly three years, the vice president is still struggling to make the case for herself — and feels she shouldn't have to.  —  All the conditions seemed right for a chance to reset the narrative.  —  At the Munich Security Conference in February … ",
    "url": "https://www.nytimes.com/2023/10/10/magazine/kamala-harris.html"
  },
  {
    "text": "RFK Jr. super PAC raises $11 million within hours and courts Elon Musk's support  —  The environmental lawyer-turned-politician is mounting a formidable independent bid.  —  Just hours after Robert F. Kennedy Jr. announced he would run for president as an independent, more than $11 million gushed … ",
    "url": "https://www.politico.com/news/2023/10/10/rfk-jr-raises-11-million-elon-musk-00120731"
  },
  {
    "text": "War in the Middle East  —  A Statement from President Claudine Gay  —  As the events of recent days continue to reverberate, let there be no doubt that I condemn the terrorist atrocities perpetrated by Hamas.  Such inhumanity is abhorrent, whatever one's individual views of the origins of longstanding conflicts in the region.",
    "url": "https://www.harvard.edu/president/news/2023/war-in-the-middle-east/"
  },
  {
    "text": "Russia fails to return to UN rights body after losing vote  —  Russia failed in its bid to return to the United Nations' top human rights body on Tuesday, with rivals winning considerably more votes at the General Assembly in an election seen as a key test of Western efforts to keep Moscow isolated.",
    "url": "https://www.reuters.com/world/russian-bid-return-un-rights-body-fails-after-vote-2023-10-10/"
  },
  {
    "text": "Fani Willis: Pro-Trump Lawyer Not Covered by Attorney-Client Privilege for Documents Allegedly Plotting ‘Fake Elector’ Plan  —  In a filing Tuesday, the Fulton County DA argued memos and emails are not covered by attorney-client privilege that allegedly show Kenneth Chesebro was the ‘architect’ of the fake electors plot",
    "url": "https://themessenger.com/politics/willis-chesebro-fake-electors-documents-exhibits-attorney-client-privilege"
  },
  {
    "text": "Putin Offers Muted Response to Attack on Israel.  That Speaks Volumes.  —  Vladimir Putin has long projected friendly ties to Israel.  But his silence since Saturday's assault illustrates how the war in Ukraine has strained the relationship between the two countries.",
    "url": "https://www.nytimes.com/2023/10/10/world/europe/israel-hamas-russia-putin.html"
  },
  {
    "text": "Former Maryland Governor Hogan Says He's Not Closing Door on 2024 Presidential Bid  — Former Maryland governor says Nikki Haley's on the ascent  — Hogan calls Matt Gaetz ‘a cancer’ on the GOP, Congress  —  Former Maryland Governor Larry Hogan said he hasn't ruled out running for president in 2024 … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-10/hogan-says-he-s-not-closing-door-on-2024-presidential-bid"
  },
  {
    "text": "Special Counsel Interviewed Biden About Classified Documents  —  Robert Hur, the special counsel appointed to investigate how sensitive material ended up at the home and office of President Biden, met with the president over the past two days.  —  President Biden met over the past two days … ",
    "url": "https://www.nytimes.com/2023/10/09/us/special-counsel-biden-interview.html"
  },
  {
    "text": "IDF says Gaza border finally sealed, bodies of 1,500 terrorists found inside Israel  —  Breaches in barrier being mined; military continues to notify relatives of those taken to Gaza; airstrikes target hundreds of sites in Strip, including Gaza City power base Rimal",
    "url": "https://www.timesofisrael.com/idf-says-gaza-border-finally-sealed-bodies-of-1500-terrorists-found-inside-israel/"
  },
  {
    "text": "A watchdog group found a big flaw in a major environmental policy  —  Findings by the Environmental Investigation Agency point to a perceived loophole in the Montreal Protocol.  —  For more than 35 years, millions of people worldwide have benefited from an international treaty that has phased … ",
    "url": "https://www.washingtonpost.com/climate-environment/2023/10/10/montreal-protocol-ozone-climate/"
  }
]