[
  {
    "text": "A ‘whale’ of a tale: Trump continues to distort cognitive test he took  —  The Montreal Cognitive Assessment, a test aimed at detecting dementia or cognitive decline, never included the combination of animals Trump identified this week  —  Donald Trump this week bragged about purportedly acing … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/19/trump-cognitive-test/"
  },
  {
    "text": "Deposition video shows Trump claiming he prevented “nuclear holocaust” as president  —  Combative, angry and prone to grandiose claims — newly unveiled footage of an April 2023 deposition gives a glimpse into how former President Donald Trump behaves when testifying under oath.",
    "url": "https://www.cbsnews.com/news/trump-deposition-video-testimony-new-york-fraud-case-nuclear-holocaust/"
  },
  {
    "text": "Stefanik's Fierce Support for Trump Puts Her in the VP Conversation  —  New York lawmaker has drawn criticism for Jan. 6 remarks, political shift  —  WASHINGTON—The political evolution of Rep. Elise Stefanik from a moderate into a strong defender of Donald Trump helped catapult her into House GOP leadership.",
    "url": "https://www.wsj.com/politics/elections/stefaniks-fierce-support-for-trump-puts-her-in-the-vp-conversation-ab15176b?mod=followamazon"
  },
  {
    "text": "Trump mocks Nikki Haley's first name.  It's his latest example of attacking rivals based on race  —  ATLANTA (AP) — Donald Trump used his social media platform Friday to mock Nikki Haley 's birth name, the latest example of the former president keying on race and ethnicity to attack people of color, especially his political rivals.",
    "url": "https://apnews.com/article/trump-nikki-haley-58b7ffa7e49f626bae481060cf9975d2"
  },
  {
    "text": "Trump lobs racially charged attacks against Haley ahead of N.H. primary  —  Former president Donald Trump is lobbing racially charged attacks at Republican rival Nikki Haley, a daughter of Indian immigrants who served as his U.N. ambassador, days before a hotly contested New Hampshire primary … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/19/trump-haley-race/"
  },
  {
    "text": "Microsoft Actions Following Attack by Nation State Actor Midnight Blizzard  —  The Microsoft security team detected a nation-state attack on our corporate systems on January 12, 2024, and immediately activated our response process to investigate, disrupt malicious activity, mitigate the attack, and deny the threat actor further access.",
    "url": "https://msrc.microsoft.com/blog/2024/01/microsoft-actions-following-attack-by-nation-state-actor-midnight-blizzard/"
  },
  {
    "text": "Growing number of Senate Democrats question Biden's Israel strategy  —  Discomfort with Israel's onslaught, which started with the party's liberals, is moving to the Democratic mainstream  —  Five Senate Democrats on Friday signed onto a measure that would condition aid to Israel on its compliance … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/19/senate-democrats-question-biden-israel/"
  },
  {
    "text": "Sports Illustrated's Publisher Guts Staff.  Future Unclear … Staffers at Sports Illustrated were notified on Friday of massive layoffs—some immediately, others in short time, with potential for the entire staff to be gone in three months.  —  Authentic, the licensing group … ",
    "url": "https://frontofficesports.com/sports-illustrateds-publisher-lays-off-entire-staff-future-unclear/"
  },
  {
    "text": "Iran's IRGC says 4 members killed in Israeli attack on Syria's Damascus  —  Iran's Islamic Revolutionary Guard Corps (IRGC) says four of its “military advisers” have been killed in an Israeli air strike on a residential building in Syria's capital, Damascus.",
    "url": "https://www.aljazeera.com/news/2024/1/20/israeli-strike-hits-residential-building-in-damascus-syrian-state-media"
  },
  {
    "text": "Comer's habit of cherry-picking depositions comes back to haunt him  —  One of the arguments offered by attorneys for President Biden's son Hunter when responding to a subpoena from the House Oversight Committee for a closed-door deposition was that the committee had shown a pattern … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/19/comers-habit-cherry-picking-depositions-comes-back-haunt-him/"
  },
  {
    "text": "DC bar authorities file disciplinary charges against pro-Trump 2020 election lawyers  —  The charges are the latest in a slew of disciplinary proceedings against attorneys who aided Donald Trump's bid to subvert the election.  —  Washington, D.C. bar investigators have filed disciplinary charges … ",
    "url": "https://www.politico.com/news/2024/01/19/dc-trump-2020-election-lawyers-00136667"
  },
  {
    "text": "Bank records: DA Willis and special prosecutor traveled together during Trump probe  —  Bank records show that special prosecutor Nathan Wade purchased airline tickets in his and Fulton County District Attorney Fani Willis' name for trips to San Francisco and Miami, according to a court motion filed Friday.",
    "url": "https://www.ajc.com/live-updates/politics/bank-records-da-wills-and-special-prosecutor-traveled-together-during-trump-probe/ZNDCH5RHDFGC5CKRWNS7HI2R5M/"
  },
  {
    "text": "Palestinian-American teenager killed by Israeli forces in West Bank- Palestinian officials  —  A Palestinian-American teenager was killed by Israeli security forces on Friday in the occupied West Bank, Palestinian health officials said.  —  The Israeli military did not immediately respond to a request for comment.",
    "url": "https://www.reuters.com/world/middle-east/palestinian-american-teenager-killed-by-israeli-forces-west-bank-palestinian-2024-01-19/"
  },
  {
    "text": "Entire Town's Newspapers Stolen On Day It Runs Story About Rape At Police Chief's Home  —  “It's pretty clear that someone didn't want the community to read the news this week,” said Ouray County Plaindealer co-publisher Erin McIntyre.  —  LOADING  —  It's an old-fashioned paper caper ― but maybe don't call the cops.",
    "url": "https://www.huffpost.com/entry/ouray-stolen-newspapers-police-chief-rape_n_65aa9f5fe4b076abd7ab6a90"
  },
  {
    "text": "S&P 500 hits new record high amid signs of easing US economic gloom  —  Index climbs to all-time high of 4,838, clearing record set two years ago, as US consumer confidence rises while inflation concerns ease  —  The S&P 500 scaled a new all-time high on Friday amid signs that the economic despondency … ",
    "url": "https://www.theguardian.com/business/2024/jan/19/us-economy-consumer-sentiment-rises"
  },
  {
    "text": "Louisiana Legislature spurns Johnson, enacts new House map he opposed  —  The new map means an all-but-certain pickup for House Democrats.",
    "url": "https://www.politico.com/live-updates/2024/01/19/congress/louisiana-gives-dems-a-leg-up-00136673"
  },
  {
    "text": "Robb grand jury forms to examine investigation  —  Editor's note: This story was updated at 5:20 p.m. on Jan. 19 to clarify how the jury will operate.  —  A jury has been convened in Uvalde to determine if law enforcement officers will face criminal charges related to the attack at Robb Elementary School.",
    "url": "https://www.uvaldeleadernews.com/articles/grand-jury-begins-examining-robb-school-investigation/"
  },
  {
    "text": "Announcement of Presidential Task Forces  —  Dear Members of the Harvard Community,  —  Among the repercussions of conflict in the Middle East have been the loss of family and friends among many members of our community, as well as feelings of uncertainty, abandonment, mistrust, and fear.",
    "url": "https://www.harvard.edu/president/news/2024/announcement-of-presidential-task-forces/"
  },
  {
    "text": "Police won't charge ex-Florida GOP chair with sexual battery, forward voyeurism allegations to prosecutors  —  The investigation into an alleged sexual encounter between a woman and former Florida GOP chair Christian Ziegler has rocked state politics.  —  TALLAHASSEE, Fla. … ",
    "url": "https://www.nbcnews.com/politics/2024-election/police-wont-charge-ex-florida-gop-chair-sexual-battery-forward-voyeuri-rcna134819"
  },
  {
    "text": "Global Millionaires Say Yes to Taxing Extreme Wealth, Poll Finds  —  But by US standards, they may not be rich enough to matter.  —  Millionaires from around the world support wealth taxes as a way to curb extreme inequality, according to a new poll that was released to coincide with the meeting … ",
    "url": "https://www.motherjones.com/politics/2024/01/poll-patriotic-millionaires-support-extreme-wealth-tax/"
  }
]