[
  {
    "text": "Immigration Authorities Arrest Pro-Palestinian Activist at Columbia  —  Mahmoud Khalil, who recently completed a graduate program at Columbia, has legal permanent residency, his lawyer said.  —  Federal immigration authorities on Saturday detained a well-known activist who played a major role … ",
    "url": "https://www.nytimes.com/2025/03/09/nyregion/ice-arrests-palestinian-activist-columbia-protests.html"
  },
  {
    "text": "Immigration agents arrest Palestinian activist who helped lead Columbia University protests  —  Federal immigration authorities arrested a Palestinian activist Saturday who played a prominent role in Columbia University's protests against Israel, a significant escalation in the Trump administration's pledge … ",
    "url": "https://apnews.com/article/columbia-university-mahmoud-khalil-ice-15014bcbb921f21a9f704d5acdcae7a8"
  },
  {
    "text": "ICE arrests Palestinian activist who led Columbia University protests, lawyer says  —  A prominent Palestinian activist who helped lead Columbia University's 2024 student encampment protests was arrested Saturday night in New York City by federal immigration authorities who claimed they were acting … ",
    "url": "https://www.cbsnews.com/newyork/news/ice-arrest-mahmoud-khalil-palestinian-activist-columbia-protests/"
  },
  {
    "text": "China's Tariffs on U.S. Agricultural Products Take Effect  —  The action came in response to the higher levies on Chinese imports that President Trump announced last week.  —  Beijing began imposing tariffs on Monday on many farm products from the United States, for which China is the largest overseas market.",
    "url": "https://www.nytimes.com/2025/03/10/business/china-tariffs-us.html?unlocked_article_code=1.204.ecdH.l0DfAUX_9cj5&smid=url-share"
  },
  {
    "text": "Massive turnout at Democratic lawmakers' town halls as Republicans hide from voters  —  As Republican lawmakers dodge in-person town halls, avoiding direct engagement with voters furious over the Trump administration's devastating policies, LGBTQ+ Democrats like Washington Rep. Emily Randall … ",
    "url": "https://www.advocate.com/politics/huge-turnout-democratic-town-halls"
  },
  {
    "text": "Liberal leadership race: Mark Carney elected by landslide to be next prime minister  —  Political newcomer promises to ‘fight’ for Canadian economy, sovereignty  —  Who is Mark Carney, Canada's next prime minister?  —  How Mark Carney went from his upbringing in Alberta to central banker … ",
    "url": "https://www.cbc.ca/news/politics/livestory/liberal-leadership-race-mark-carney-elected-by-landslide-to-be-next-prime-minister-9.6678061"
  },
  {
    "text": "US added to international watchlist for rapid decline in civic freedoms  —  Civicus, an international non-profit, puts country alongside Democratic Republic of Congo, Italy, Pakistan and Serbia  —  The United States has been added to the Civicus Monitor Watchlist, which identifies countries … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/09/watchlist-decline-civic-freedoms-civicus"
  },
  {
    "text": "Ukrainian journalist Victoria Roshchyna died after savage torture and extreme emaciation in Russian captivity  —  The 27-year-old journalist, who lived for her work, had travelled to occupied Zaporizhzhia oblast in order to find out about Russia's torture prisons on occupied territory",
    "url": "https://khpg.org/en/1608814479"
  },
  {
    "text": "Britain urged to form breakaway ‘Four Eyes’ alliance without the US after Trump's ‘unprecedented’ decision to block intelligence sharing with Ukraine  —  Britain must develop a ‘Four Eyes’ intelligence sharing alliance in response to Donald Trump's actions over Ukraine, defence sources have said.",
    "url": "https://www.dailymail.co.uk/news/article-14477803/Britain-urged-form-breakaway-Four-Eyes-alliance-without-US-Trumps-unprecedented-decision-block-intelligence-sharing-Ukraine.html"
  },
  {
    "text": "Israel cuts off electricity supply to Gaza, affecting a desalination plant producing drinking water  —  Israel cut off the electricity supply to Gaza, officials said Sunday, affecting a desalination plant producing drinking water for part of the arid territory.  Hamas called it part of Israel's “starvation policy.”",
    "url": "https://apnews.com/article/gaza-israel-palestinians-war-news-ba90f0de3d4f64a1762d1a39f787817f"
  },
  {
    "text": "Athol Fugard, South African Playwright Who Dissected Apartheid, Dies at 92  —  In works that included “Blood Knot,” “Sizwe Banzi Is Dead” and “The Island,” he exposed the realities of racial separatism in his homeland.  —  Athol Fugard, the South African playwright whose portrayals … ",
    "url": "https://www.nytimes.com/2025/03/09/obituaries/athol-fugard-dead.html?unlocked_article_code=1.204.JalK.tPVAnzHGp_vd"
  },
  {
    "text": "Rubio and Musk turn on Polish foreign minister in spat over Starlink use in Ukraine: ‘Be quiet small man’  —  Secretary of State presses on with Trump administration's efforts to make European nations profess gratitude … Your support helps us to tell the story",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/rubio-musk-poland-starlink-twitter-ukraine-b2711840.html"
  },
  {
    "text": "Former Social Security official describes hostile takeover by Musk team  —  DOGE officials also put millions of taxpayers' private data at risk and refused to say why they needed access to it, the official says.  —  Just now  —  They came in aggressively, a former official … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/10/musk-social-security-data-doge-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNTc5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyOTYxNTk5LCJpYXQiOjE3NDE1NzkyMDAsImp0aSI6ImJmYWUxYTQxLTdhOTMtNDlmYi04ZGQyLWUzOTVmZjAzZjBhMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzEwL211c2stc29jaWFsLXNlY3VyaXR5LWRhdGEtZG9nZS10cnVtcC8ifQ.AlPKblxerWCHfgWFayOk_oCfKLDV7omsOVDsIL03bno&itid=gfta"
  },
  {
    "text": "Secretary Hegseth says the DOD does not do ‘climate change crap’  —  Pete Hegseth responds to post, saying the Department of Defense ‘does not do climate change crap’  —  U.S. Department of Defense (DOD) Secretary Pete Hegseth said Sunday that his department “does not do climate change crap … ",
    "url": "https://www.foxnews.com/politics/secretary-hegseth-says-dod-does-not-do-climate-change-crap"
  },
  {
    "text": "Democratic media leader dating US senator  —  One of the Democratic Party's most notable digital media leaders is dating one of the party's most media-friendly lawmakers, according to a Washington Democrat and a pointed Instagram post.  —  Tara McGowan, the CEO of the network … ",
    "url": "https://www.semafor.com/article/03/09/2025/democratic-media-leader-dating-us-senator"
  }
]