[
  {
    "text": "Biden Tells Allies He Knows He Has Only Days to Salvage Candidacy  —  The president's conversations are the first indication that he is seriously considering whether he can recover after a devastating performance on the debate stage in Atlanta.  The White House said the report was false.",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/biden-withdraw-election-debate.html"
  },
  {
    "text": "Trump Caught on Video Claiming ‘Broken-Down’ Biden Has Quit: 'It's Kamala'  —  ‘SO F***ING BAD’  —  In a leaked video, Trump offers a frank analysis of his rival's performance in the first presidential debate, calling Biden a “broken-down pile of cr*p.”  —  Donald Trump delivered … ",
    "url": "https://www.thedailybeast.com/donald-trump-caught-on-video-claiming-broken-down-joe-biden-has-quit-its-kamala"
  },
  {
    "text": "Biden tells governors he got a medical checkup  —  Two governors also expressed concern over whether the president could still carry their blue-leaning states.  —  President Joe Biden on Wednesday evening told more than 20 Democratic governors in a private meeting that he underwent … ",
    "url": "https://www.politico.com/news/2024/07/03/biden-tells-governors-he-got-a-medical-check-up-00166579"
  },
  {
    "text": "Biden wins crucial support of Democratic governors to continue campaign: 'We're going to have his back' - as it happened  —  This blog is now closed  —  ABC to air full Joe Biden interview on Friday Newsom on Biden: 'He's all in - and so am I'  —  Whitmer gives backing to Biden: 'He's in it to win it and I support him'",
    "url": "https://www.theguardian.com/us-news/live/2024/jul/03/biden-debate-democrats-kamala-harris-election-updates"
  },
  {
    "text": "Playbook: Biden goes from bunker to blitz  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  JULY FOURTH READING — “The partisan gap in views of American greatness,” by WaPo's Philip Bump: “Democrats are more proud of the U.S. Republicans are more likely … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/04/biden-goes-from-bunker-to-blitz-00166585"
  },
  {
    "text": "Netflix Co-founder Becomes One of the Biggest Democratic Donors to Call for Biden to Step Aside  —  A public declaration from a megadonor is another crack in the armor in the president's foundation of support.  —  Reed Hastings, the Netflix co-founder who in recent years has become … ",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/reed-hastings-netflix-biden-withdraw.html"
  },
  {
    "text": "Biden privately remains torn between defiance and acceptance amid calls to step aside  —  In some discussions, Biden has acknowledged that the blowback may grow too large to overcome, while in others he's been dismissive of any notion that he might walk away.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-privately-remains-torn-defiance-acceptance-debate-rcna160274"
  },
  {
    "text": "Biden Tells Governors That He Is Staying in the Race  —  At a meeting with Democratic governors at the White House, the president was grilled about the path forward as he worked to solidify support from elected leaders.  —  President Biden told a group of Democratic governors on Wednesday … ",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/biden-governors-presidential-election-debate.html"
  },
  {
    "text": "Trump Widens Lead After Biden's Debate Debacle, Times/Siena Poll Finds  —  Donald Trump is ahead of President Biden by six percentage points among likely voters in a new national survey.  Overall, 74 percent of voters view him as too old for the job, an uptick since the debate.",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/poll-debate-biden-trump.html"
  },
  {
    "text": "Raúl Grijalva Is Second House Democrat to Call for Biden to Drop Out  —  His remarks came a day after Representative Lloyd Doggett, a Texas Democrat, became the first member of his party in the House to call on Mr. Biden to withdraw.  —  Representative Raúl M. Grijalva … ",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/raul-grijalva-biden-drop-out.html"
  },
  {
    "text": "The partisan gap in views of American greatness  —  Democrats are more proud of the U.S. Republicans are more likely to view it as the greatest country on Earth.  —  America, we are often told, is less a country than an idea.  That idea can be nebulous in its formulation, but it generally centers on opportunity and around freedom.",
    "url": "https://www.washingtonpost.com/politics/2024/07/04/republicans-democrats-america-polling/"
  },
  {
    "text": "The Supreme Court Has Murdered the Constitution  —  America's founding document is now an all-but-meaningless scrap of paper.  Happy Fourth!  —  Chief Justice John Roberts is seen before the State of the Union address to a joint session of Congress at the Capitol on March 7, 2024.",
    "url": "https://prospect.org/justice/2024-07-04-supreme-court-roberts-murdered-constitution/"
  },
  {
    "text": "“Bloodless if the left allows it to be”  —  A week ago, I started my post to you with some comments made by Kevin Roberts, the head of the Heritage Foundation and architect of Project 2025, when he learned Democrats were making plans to take on Project 2025.",
    "url": "https://joycevance.substack.com/p/bloodless-if-the-left-allows-it-to"
  },
  {
    "text": "Romanian ruling coalition agrees parliamentary, presidential election dates  —  Romania's ruling coalition of leftist Social Democrats and centre-right Liberals has agreed to hold a presidential election on Nov. 24 and Dec. 8, with parliamentary polls in between, they said on Thursday.",
    "url": "https://www.reuters.com/world/europe/romanian-ruling-coalition-agrees-parliamentary-presidential-election-dates-2024-07-04/"
  }
]