[
  {
    "text": "Trump's Claim of Immunity Reaches Appeals Court  —  Judges Seem Skeptical of Trump's Claim of Immunity  —  Judges heard from a lawyer for Donald J. Trump who argued that a president could face criminal charges only if impeached and convicted first, even if the case involved the assassination of a political rival.",
    "url": "https://www.nytimes.com/live/2024/01/09/us/trump-immunity-hearing"
  },
  {
    "text": "Trump warns of ‘bedlam,’ declines to rule out violence after court hearing  —  The former president spoke after his lawyers argued he should be immune from prosecution for trying to overturn the 2020 election  —  Republican polling leader Donald Trump on Tuesday threatened unrest … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/09/trump-comments-violence-bedlam/"
  },
  {
    "text": "'He doesn't give a damn about people:' Biden campaign hits Trump comments on economy crashing  —  President Biden's reelection campaign bashed former President Trump on Tuesday after he said he hoped the U.S. economy crashed in the next 12 months, arguing he doesn't care about people.",
    "url": "https://thehill.com/homenews/campaign/4398028-biden-campaign-hits-trump-comments-economy-crashing-he-doesnt-give-a-damn-about-people/"
  },
  {
    "text": "Georgia court weighs voting machines at heart of Trump election fraud claims  —  A Georgia trial will cast a spotlight on the security of the state's voting machines, which have long come under attack by the former president and his allies.  —  A federal court will begin hearing arguments Tuesday … ",
    "url": "https://www.politico.com/news/2024/01/09/georgia-court-voting-machines-trump-election-fraud-00134420"
  },
  {
    "text": "How Trump's Unhinged Immunity Demand Could Unleash a Second-Term Crime Spree  —  Donald Trump and his lawyers are making an extraordinary demand in the D.C. Circuit Court of Appeals: They want Trump granted immunity from criminal charges related to his subversion of the 2020 election … ",
    "url": "https://newrepublic.com/article/177940/trump-immunity-second-term-crime-spree"
  },
  {
    "text": "Biden highlights the connection between rejecting democracy and race  —  President Biden's visit to South Carolina on Monday and the speech he gave at Mother Emanuel AME Church in Charleston have been connected, including by the president, to his speech at Valley Forge, Pa., last week … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/09/democracy-race-jan6-trump-biden/"
  },
  {
    "text": "5 ways the Supreme Court may try to defuse its newest Trump bomb  —  As the justices confront a historic case with enormous political stakes, they might seek a narrow way out.  —  After years of dodging Donald Trump-related questions, the Supreme Court is now facing the most consequential one of all … ",
    "url": "https://www.politico.com/news/2024/01/08/trump-supreme-court-ballot-insurrection-offramps-00134364"
  },
  {
    "text": "CNN Poll: Haley trims Trump's lead to single digits in New Hampshire  —  Former South Carolina Gov. Nikki Haley has trimmed former President Donald Trump's lead in the Republican primary race in New Hampshire to single digits, according to a new CNN Poll conducted by the University of New Hampshire.",
    "url": "https://www.cnn.com/2024/01/09/politics/cnn-new-hampshire-poll/"
  },
  {
    "text": "Defense Secretary Lloyd Austin diagnosed with prostate cancer  —  Austin was diagnosed with prostate cancer in December and underwent a minimally invasive procedure, officials from Walter Reed said in a statement Tuesday.  —  WASHINGTON — Defense Secretary Lloyd Austin was diagnosed … ",
    "url": "https://www.nbcnews.com/politics/white-house/defense-secretary-lloyd-austin-diagnosed-prostate-cancer-rcna133120"
  },
  {
    "text": "Austin Was Hospitalized for Complications From Prostate Cancer Surgery  —  The defense secretary was admitted at Walter Reed National Military Medical Center on Jan. 1 with severe abdominal, hip and leg pain after a minor procedure the week before, officials said.",
    "url": "https://www.nytimes.com/2024/01/09/us/politics/lloyd-austin-hospitalized-prostate-cancer.html"
  },
  {
    "text": "Homeland Security Chief Alejandro Mayorkas' Failures Are Not Impeachable  —  He's bad at his job and is enforcing wrongheaded Biden administration border policies, but there is no current evidence he is corrupt or committed an impeachable offense. … Secretary of Homeland Security Alejandro Mayorkas … ",
    "url": "https://www.thedailybeast.com/homeland-security-chief-alejandro-mayorkas-failures-are-not-impeachable"
  },
  {
    "text": "5th Circuit announces takeover of Department of Energy  —  Here we go again:  —  As silly as the finding of standing is, the 5th Circuit's position on the merits that any regulation issued by a Democratic administration is “arbitrary and capricious” is even worse!",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/01/5th-circuit-announces-takeover-of-department-of-energy"
  },
  {
    "text": "Roger Stone Plotted Assassinating Democrats, Bombshell Report Says  —  Explosive new audio of Roger Stone reveals the longtime Trump ally was trying to plot the assassinations of two outspoken Democratic congressmen.  —  A few weeks before the 2020 election, Stone told a member … ",
    "url": "https://newrepublic.com/post/177935/roger-stone-audio-assasinate-democrats-swalwell-nadler"
  },
  {
    "text": "Pizzagate, QAnon and the ‘Epstein List’: Why the Far Right Is Obsessed with Sex Trafficking  —  An expert on conspiracy theories explains why MAGA figures are embracing the latest twist in the Jeffrey Epstein saga.  —  A day before the so-called Epstein list was supposed to drop … ",
    "url": "https://www.politico.com/news/magazine/2024/01/09/why-maga-is-obsessed-with-jeffrey-epstein-00134394"
  },
  {
    "text": "Trump doubles down after DC hearing: 'Most people agree that we're entitled to immunity' - live  —  If the judges rule in favor of Trump, it could lead to the dropping of the criminal charges brought by special counsel Jack Smith  —  Trump: 'Most people agree that we're entitled ... to immunity'",
    "url": "https://www.theguardian.com/us-news/live/2024/jan/09/trump-immunity-hearing-jan-6-case-dc-politics-latest-updates"
  },
  {
    "text": "BREAKING: Filing alleges ‘improper’ relationship between Fulton DA, top Trump prosecutor  —  Fani Willis hired alleged romantic partner as special prosecutor, court motion says  —  District Attorney Fani Willis improperly hired an alleged romantic partner to prosecute Donald Trump … ",
    "url": "https://www.ajc.com/politics/breaking-filing-alleges-improper-relationship-between-fulton-da-top-trump-prosecutor/A2N2OWCM7FFWJBQH2ORAK2BKMQ/"
  },
  {
    "text": "Progressives MIA in San Francisco mayor's race  —  THE BUZZ: MOD-ON-MOD FIGHT — Progressives apparently don't want to run the most liberal major city in America.  —  The emerging field in the 2024 San Francisco mayor's race includes an incumbent and two well-known challengers all campaigning … ",
    "url": "https://www.politico.com/newsletters/california-playbook/2024/01/09/progressives-mia-in-san-francisco-mayors-race-00134451"
  },
  {
    "text": "Elections and Disinformation Are Colliding Like Never Before in 2024  —  A wave of elections coincides with state influence operations, a surge of extremism, A.I. advances and a pullback in social media protections.  —  Billions of people will vote in major elections this year … ",
    "url": "https://www.nytimes.com/2024/01/09/business/media/election-disinformation-2024.html"
  },
  {
    "text": "Democratic Donors Bought Hunter Biden's Artwork, Gallery Owner Tells House Investigators  —  Sources with direct knowledge of the interview of a New York art dealer said Hunter Biden's artwork was sold to two or three Democratic donors  —  A New York art dealer who sells Hunter Biden's work … ",
    "url": "https://themessenger.com/politics/democratic-donors-bought-hunter-bidens-artwork-gallery-owner-tells-house-investigators"
  },
  {
    "text": "RFK Jr. backs out of his own birthday fundraiser gala after Martin Sheen, Mike Tyson said they're not attending  —  Robert F. Kennedy Jr. is backing out of his own birthday fundraiser gala after celebrity guests Martin Sheen, Dionne Warwick, Mike Tyson and Andrea Bocelli, who were reported to be attending … ",
    "url": "https://www.cbsnews.com/news/rfk-jr-backs-out-birthday-fundraiser-gala-martin-sheen-mike-tyson-not-attending/"
  },
  {
    "text": "Mike Pence's brother is latest Republican retiring from Congress  —  Rep. Greg Pence (R-Ind.), the brother of former Vice President Mike Pence, announced Tuesday that he is retiring from Congress after three terms. … - “In 2017, I ran for Congress because I was Ready to Serve Again.",
    "url": "https://www.axios.com/2024/01/09/greg-pence-republican-retire-congress-indiana"
  }
]