[
  {
    "text": "Inside the Democratic rebellion against Biden over the Gaza war  —  The depth of Democratic Party anger over President Joe Biden's handling of the Gaza war has caught his campaign off guard and could depress support in November's election, according to Reuters interviews with more than a dozen senior party … ",
    "url": "https://www.reuters.com/world/us/inside-democratic-rebellion-against-biden-over-gaza-war-2024-02-27/"
  },
  {
    "text": "My Nikki Haley Theory  —  From the day she came in third in Iowa to her 20-point loss to Donald Trump on Saturday in South Carolina, Nikki Haley and her aims have been the subject of intense speculation.  Clearly, in the absence of a lightning bolt from the blue that strikes Donald Trump … ",
    "url": "https://www.commentary.org/john-podhoretz/my-nikki-haley-theory/"
  },
  {
    "text": "Trump's ‘Dominance’ of the GOP Primary Is an Illusion  —  Sure, he's fully vanquished the competition at the ballot box, but it's not like all Republicans are MAGA.  Far from it, in fact. … Are the media guilty of judging Joe Biden more harshly than Donald Trump when it comes to things … ",
    "url": "https://www.thedailybeast.com/trumps-dominance-of-the-gop-primary-is-an-illusion"
  },
  {
    "text": "“Suicide for our country”: Nikki Haley goes scorched earth on Trump … - “This may be his survival mode to pay his legal fees and get out of some sort of legal peril, but this is like suicide for our country,” she said of the former president, who faces 91 criminal counts across four cases.",
    "url": "https://www.axios.com/2024/02/27/nikki-haley-trump-wall-street-journal-interview"
  },
  {
    "text": "Trump Has a Hilarious New Excuse for Why He Can't Put Up Bond  —  Donald Trump is arguing that he shouldn't have to post the massive bond in E. Jean Carroll's defamation case against him ... because he's simply too rich.  —  Trump owes Carroll $83.3 million for defaming her in 2019 when she first accused him of sexual assault.",
    "url": "https://newrepublic.com/post/179308/trump-excuse-cant-post-bond-e-jean-carroll"
  },
  {
    "text": "Jack Smith Pounds Trump For His Unprecedented Conduct In MAL Case  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  No One Has Ever Done What Trump Did  —  Special Counsel Jack Smith unleashed a tight, targeted fusillade in the Mar-a-Lago case … ",
    "url": "https://morningmemo.talkingpointsmemo.com/p/jack-smith-pounds-trump-for-his-unprecedented"
  },
  {
    "text": "Schumer, Jeffries say Ukraine discussion was ‘intense’  —  Senate Majority Leader Chuck Schumer (D-N.Y.) and House Minority Leader Hakeem Jeffries (D-N.Y.) both characterized a Tuesday meeting between President Biden and congressional leaders as “intense” amid tension over Ukraine aid.",
    "url": "https://thehill.com/homenews/4491739-schumer-jeffries-say-ukraine-discussion-was-intense/"
  },
  {
    "text": "Pride flags would be largely banned in Tennessee classrooms in bill advanced by GOP lawmakers  —  The GOP-led Tennessee House has passed a bill that would largely ban displaying pride flags in public school classrooms  —  NASHVILLE, Tenn. — A bill that would largely ban displaying pride flags … ",
    "url": "https://abcnews.go.com/Politics/wireStory/pride-flags-largely-banned-tennessee-classrooms-bill-advanced-107568221"
  },
  {
    "text": "Senate Democrats to force a vote on bill to protect IVF access  —  Sens. Tammy Duckworth (D-Ill.) and Patty Murray (D-Wash.) said Tuesday they will try to force a vote on their legislation to protect access to in vitro fertilization (IVF) treatment in response to the Alabama Supreme Court ruling … ",
    "url": "https://thehill.com/policy/healthcare/4491501-senate-democrats-to-force-a-vote-on-bill-to-protect-ivf-access/"
  },
  {
    "text": "Former Australian PM: Trump acts like 12-year-old boy around Putin  —  Former Australian Prime Minister Malcolm Turnbull described former President Trump's rhetoric around Russian President Vladimir Putin as an admiring “12-year-old boy.”  —  Speaking on Australian ABC's “Q+A” show … ",
    "url": "https://thehill.com/policy/international/4491800-former-australian-pm-trump-acts-like-12-year-old-around-putin/"
  },
  {
    "text": "After Roe Fell, I Moved My Embryos Out of a Red State.  I Hate That I Was Right.  —  When I first heard Roe v. Wade would be overturned, I knew I had to move my embryos out of a red state.  The past few weeks have proven why.  —  Nearly two years ago, late into the night on a Monday … ",
    "url": "https://slate.com/news-and-politics/2024/02/ivf-mess-women-response-losing-roe.html"
  },
  {
    "text": "'The numbers right now aren't good.'  —  FOR YEARS, DONALD TRUMP'S CAMPAIGN STAFF struggled to get him to make donor calls and take fundraising seriously.  —  But that was before Trump faced an incumbent president and a primary opponent who was outraising him.",
    "url": "https://plus.thebulwark.com/p/trump-fundraising-more-than-ever"
  },
  {
    "text": "Kroger's “nefarious bargain”  —  This is a special joint edition of Popular Information and Fingers, a newsletter about drinking in America by journalist Dave Infante.  Fingers is a must-read for anyone who cares about the business, culture, and chaos of booze.  Sign up HERE.",
    "url": "https://popular.info/p/krogers-nefarious-bargain"
  },
  {
    "text": "In leaked audio, Supreme Court Justice John Devine railed against “brainwashed” GOP colleagues  —  Devine, a former anti-abortion activist, faces a heated primary challenge that has focused on questions about his ethics.  —  Speaking to a group of East Texas voters in September … ",
    "url": "https://www.texastribune.org/2024/02/27/john-devine-texas-supreme-court-conservatives/"
  },
  {
    "text": "Two candidates for mayor of a Mexican city are shot dead within hours of each other  —  Candidates Armando Pérez and Miguel Ángel Zavala were found dead days before campaigning was set to formally begin.  —  MEXICO CITY — Two candidates for mayor in the Mexican city of Maravatio … ",
    "url": "https://www.nbcnews.com/news/latino/mexican-mayoral-candidates-shot-dead-hours-rcna140739"
  },
  {
    "text": "The economy is roaring.  Immigration is a key reason.  —  Momentum in the job market picked up aggressively over the past year — all while Washington is deadlocked on a border deal.  —  Immigration has propelled the U.S. job market further than just about anyone expected … ",
    "url": "https://www.washingtonpost.com/business/2024/02/27/economy-immigration-border-biden/"
  },
  {
    "text": "US Army is slashing thousands of jobs in major revamp to prepare for future wars  —  WASHINGTON (AP) — The U.S. Army is slashing the size of its force by about 24,000, or almost 5%, and restructuring to be better able to fight the next major war, as the service struggles with recruiting shortfalls … ",
    "url": "https://apnews.com/article/army-cuts-soldiers-recruiting-shortfall-9f2f41cbe512f6330ce6008709e3435b"
  },
  {
    "text": "U.S. Launches Antitrust Investigation of Healthcare Giant UnitedHealth  —  Investigators have been interviewing healthcare industry officials who compete with UnitedHealth  —  The Justice Department has launched an antitrust investigation into UnitedHealth Group, owner of the nation's biggest health insurer … ",
    "url": "https://www.wsj.com/health/healthcare/u-s-launches-antitrust-investigation-of-healthcare-giant-unitedhealth-ff5a00d2"
  },
  {
    "text": "School board member bragged of drinking Fireball and Coors Light in Capitol on Jan. 6, FBI says  —  Miles Adkins, a member of the Frederick County School Board in Virginia, was charged in connection with the Jan. 6 attack after he was identified by online sleuths.",
    "url": "https://www.nbcnews.com/politics/justice-department/school-board-member-bragged-drinking-fireball-coors-light-capitol-jan-rcna140744?taid=65de3f5691c8590001ce0caf"
  },
  {
    "text": "This ex-congressman couldn't take it anymore  —  Elizabeth Becker, a former Post correspondent, began her career covering the war in Cambodia and its aftermath under Pol Pot.  She is the author of five books, including “You Don't Belong Here: How Three Women Rewrote the Story of War.",
    "url": "https://www.washingtonpost.com/opinions/2024/02/27/jim-mcdermott-expat-france-trump/"
  },
  {
    "text": "Vice president's SUV was partially ‘airborne’ during 2022 motorcade accident, records show  —  The Secret Service agent involved in the accident was allowed to avoid defensive driving training.  —  The back end of the vehicle carrying Vice President Kamala Harris “became momentarily airborne” … ",
    "url": "https://www.nbcnews.com/news/us-news/president-kamala-harris-suv-airborne-2022-accident-driver-rcna140599"
  },
  {
    "text": "House GOP chairs subpoena DOJ for Biden special counsel investigation documents  —  A trio of House GOP chairs fired off a subpoena to Attorney General Merrick Garland Tuesday requesting documents related to special counsel Robert Hur's investigation into President Biden's mishandling of classified documents.",
    "url": "https://thehill.com/homenews/house/4492049-house-gop-subpoena-doj-biden-special-counsel-documents/"
  }
]