[
  {
    "text": "A guide to the coming attacks on Kamala Harris  —  On Sunday at 1:46 PM Eastern Time, President Joe Biden announced he would end his campaign for reelection.  Seconds later, the attacks on Vice President Kamala Harris began.  —  Harris is not yet the nominee.",
    "url": "https://popular.info/p/a-guide-to-the-coming-attacks-on"
  },
  {
    "text": "This Is Exactly What the Trump Team Feared  —  On the evening of Super Tuesday, March 5, shortly before Donald Trump effectively ended the Republican primary and earned a general-election rematch with President Joe Biden, I asked the co-managers of Trump's presidential campaign what they feared most about Biden.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-campaign-biden-dropping-out/679183/"
  },
  {
    "text": "Trump and His Allies Are Freaking Out Over Biden Leaving Race  —  The former president is falling apart at the prospect of facing Kamala Harris instead of the president … “It's not over!  Tomorrow Crooked Joe Biden's going to wake up and forget that he dropped out of the race today!” … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-maga-allies-freak-out-biden-race-harris-1235064883/"
  },
  {
    "text": "Biden's Timing: Undercutting Bibi  —  There are many things that explain the timing of President Biden's decision to drop out of the race.  Most importantly, after staying reasonably steady with Trump in the polls, the combined weight of the Democratic firing squad, and — probably … ",
    "url": "https://www.emptywheel.net/2024/07/22/bidens-timing-undercutting-bibi/"
  },
  {
    "text": "Playbook: The Kamala Harris juggernaut  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  INSIDE THE HARRIS BLITZ — In a matter of hours yesterday, VP KAMALA HARRIS garnered endorsements of a majority of House Democrats (153 as of this morning) … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/22/the-kamala-harris-juggernaut-00170254"
  },
  {
    "text": "Harris is quickly consolidating support among House Democrats … - A handful of Democratic lawmakers, donors and party officials have advocated for a genuinely contested process, but those voices have thus far largely been drowned out. … - House Democratic Caucus Chair Pete Aguilar … ",
    "url": "https://www.axios.com/2024/07/22/kamala-harris-2024-endorse-house-democrats"
  },
  {
    "text": "Scoop: Biden doubted Harris' election chances … - Biden, Bill and Hillary Clinton and many Democratic lawmakers quickly endorsed Harris, but others — including former House Speaker Nancy Pelosi, House Democratic leader Hakeem Jeffries, Senate Majority Leader Chuck Schumer … ",
    "url": "https://www.axios.com/2024/07/22/biden-kamala-harris-election-chances"
  },
  {
    "text": "Democrats Will Pay for the Biden Big Lie  —  By dropping out, he removes all doubt that Americans were played for suckers.  —  President Biden told ABC's George Stephanopoulos earlier this month that only “the Lord Almighty” could get him to abandon his failing bid for re-election.",
    "url": "https://www.wsj.com/articles/democrats-will-pay-for-the-biden-big-lie-coverup-election-2024-6d120e5c"
  },
  {
    "text": "Prominent Biden donor says he won't fundraise for Harris  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions  — descriptions off, selected",
    "url": "https://thehill.com/homenews/campaign/4785500-democratic-donor-wont-fundraise-harris/"
  },
  {
    "text": "By Withdrawing in Favor of Kamala Harris, Joe Biden Proves That Only the GOP Is a Personality Cult  —  Democrats acted as a proper political party, while Republicans remain in thrall to a dangerous authoritarian.  —  Pocket  —  Joe Biden's decision on Sunday to withdraw from the presidential race … ",
    "url": "https://www.thenation.com/article/politics/trump-republican-personality-cult/"
  },
  {
    "text": "Exclusive: All 50 Democratic party US state chairs back Harris -sources  —  All 50 Democratic party state chairs have thrown their weight behind Vice President Kamala Harris to be the party's new presidential nominee, according to sources familiar with the matter.",
    "url": "https://www.reuters.com/world/us/all-50-democratic-party-us-state-chairs-back-harris-sources-2024-07-21/"
  },
  {
    "text": "Democrats Forego the Iceberg  —  Did you all enjoy your weekend?  What weekend?  —  There ought to be a law against doing this sort of thing on a Sunday.  Nota bene to all future presidents mulling stepping aside: Save it for the work week!  Happy Monday.  —  Trump's Too Old",
    "url": "https://www.thebulwark.com/p/democrats-forego-the-iceberg"
  },
  {
    "text": "Now, We Beat Trump.  —  OK Everyone!  It's time to rise out of our despair!  It's been 24 days of mourning since the debate debacle sunk all of us into believing this election was over, that we were going to be abused by Trump for another four years.  A sick, sick feeling.",
    "url": "https://www.michaelmoore.com/p/now-we-beat-trump"
  },
  {
    "text": "ActBlue rakes in nearly $50 million in 7 hours after Harris campaign launch  —  Correction: A total of $47 million was donated via ActBlue to all races in the seven hours after Harris launched her campaign Sunday.  A previous version of this article contained incorrect information.",
    "url": "https://thehill.com/elections/4785224-harris-campaign-fundraising-actblue/"
  },
  {
    "text": "RFK Jr. floated a job in a Trump White House as he weighed endorsing Trump  —  The independent candidate suggested being given a senior job overseeing a portfolio of health and medical issues, an idea that the Trump campaign rejected  —  Independent presidential candidate Robert F. Kennedy Jr. held talks … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/22/rfk-jr-floated-job-trump-white-house-he-weighed-endorsing-trump/"
  },
  {
    "text": "Trump's Alarming New Rant Praising Dictators Shows Media Is Failing Us … At a rally in Michigan over the weekend, Donald Trump uncorked one of his longest rants ever in praise of the world's autocrats, strongmen, and dictators.  He hailed Xi Jinping of China as “brilliant” … ",
    "url": "https://newrepublic.com/article/184076/trumps-alarming-new-rant-praising-dictators-shows-media-failing-us"
  },
  {
    "text": "Are Republicans ready for Kamala Harris, the queen of opposition research?  —  At some point in the next 100 days, something awful and potentially career-ending is going to come out about Sen. J.D. Vance (R-OH), former President Donald Trump's vice presidential pick.  It might involve a sexual scandal.",
    "url": "https://www.washingtonexaminer.com/restoring-america/fairness-justice/3093511/are-republicans-ready-for-kamala-harris-the-queen-of-opposition-research/"
  }
]