[
  {
    "text": "Trudeau expected to announce resignation before national caucus meeting Wednesday  —  ////Justin Trudeau is expected to announce as early as Monday that he will resign as Liberal Party Leader, three sources said Sunday, as the Prime Minister faces a caucus revolt and dismal public opinion polls … ",
    "url": "https://www.theglobeandmail.com/politics/article-trudeau-expected-to-announce-resignation-before-national-caucus/"
  },
  {
    "text": "Canada PM Trudeau to announce resignation as early as Monday, Globe and Mail reports  —  Canadian Prime Minister Justin Trudeau is expected to announce as early as Monday that he will resign as Liberal Party Leader, The Globe and Mail reported on Sunday, citing three sources.",
    "url": "https://www.reuters.com/world/americas/canada-pm-trudeau-announce-resignation-early-monday-globe-mail-reports-2025-01-06/"
  },
  {
    "text": "What Americans should remember about Jan. 6  —  Four years ago, our democracy was put to the test — and prevailed.  —  Joe Biden is president of the United States.  —  On this Jan. 6, order will be called.  Clerks, staff and members of Congress will gather to certify the results of a free … ",
    "url": "https://www.washingtonpost.com/opinions/2025/01/05/president-biden-jan-6-democracy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2MDUzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3NDM1NTk5LCJpYXQiOjE3MzYwNTMyMDAsImp0aSI6ImFlMjc4YmZjLTRlOGUtNGZjOS1hZDQ5LWNlOWY5Zjg0ODE5YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzAxLzA1L3ByZXNpZGVudC1iaWRlbi1qYW4tNi1kZW1vY3JhY3kvIn0.D7SX-A_K83IvLq493kb52ukRKWvbmxjl25eZLxCGvyo&itid=gfta"
  },
  {
    "text": "DOJ: 200 Jan. 6 cases pending as Trump prepares to retake office  —  It's the first time prosecutors have estimated how many uncharged Jan. 6 cases remain.  —  Federal prosecutors are weighing charging as many as 200 more people for their involvement in the Jan. 6 attack on the Capitol … ",
    "url": "https://www.politico.com/news/2025/01/06/january-6-cases-donald-trump-00196501"
  },
  {
    "text": "Kash Patel Believes the FBI Planned January 6th  —  His embrace of this wild conspiracy theory should disqualify him from leading the bureau.  —  “WHAT WAS THE FBI DOING PLANNING January 6th for a year?”  —  Kash Patel, President-elect Donald Trump's nominee to serve as FBI director … ",
    "url": "https://www.thebulwark.com/p/kash-patel-fbi-director-nominee-january-6th-conspiracy-theories"
  },
  {
    "text": "Trump Weighs Jan. 6 Clemency With Congress Set to Ratify His Win  — Trump promised pardons for 2021 mob; form and timing unclear  — Prosecutors, judges press on as White House transition nears  —  Four years after a mob attacked the US Capitol to support Donald Trump's last-gasp effort … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-05/trump-weighs-jan-6-clemency-with-congress-set-to-ratify-his-win"
  },
  {
    "text": "Paper Cuts  —  The Washington Post is expected to lay off dozens of staffers this week, Status has learned.  —  Layoffs are expected to rock The Washington Post this week, according to people familiar with the matter. … One person familiar with the matter said that the cuts will be deep, impacting many dozens of employees.",
    "url": "https://www.status.news/p/washington-post-layoffs"
  },
  {
    "text": "Thune has privately told Trump that Hegseth has the votes to be confirmed as Defense Secretary, sources say  —  Senate Majority Leader John Thune has privately told President-elect Donald Trump that he believes Pete Hegseth will have the votes to be confirmed as Secretary of Defense, according to three sources.",
    "url": "https://www.cbsnews.com/news/pete-hegseth-votes-confirmation-defense-secretary-john-thune-donald-trump/"
  },
  {
    "text": "The queer people who are buying guns to prepare for Trump's America  —  On a brisk Saturday afternoon, A. crouched in a boxer's stance, knees bent, one hip forward, raised her new Ruger Security-380 pistol aloft with both hands, and pulled the trigger.  Spent gold casings clinked to the ground … ",
    "url": "https://www.inquirer.com/identity/guns-trump-lgbt-philadelphia-20250105.html"
  },
  {
    "text": "N.Y. Judge's Ruling Shows How Legal Issues Will Follow Trump Into Office  —  Donald Trump may not face a penalty for his conviction in the hush-money case, but he could still be the first felon to be president — and civil proceedings against him continue.  —  As President-elect Donald J … ",
    "url": "https://www.nytimes.com/2025/01/05/us/politics/new-york-case-trump-merchan-inauguration.html"
  },
  {
    "text": "Brennan presses Homan on Trump administration's deportation plans  —  CBS News's Margaret Brennan pressed President-elect Trump's new border czar Tom Homan on the next administration's mass deportation plans.  —  Homan joined Brennan on “Face the Nation” on Sunday, where he was asked … ",
    "url": "https://thehill.com/homenews/administration/5068050-brennan-presses-homan-over-trump-administration-deportation-plans/"
  },
  {
    "text": "Sen. Adam Schiff says the New Orleans attack shows Kash Patel shouldn't lead the FBI  —  Schiff told NBC News' “Meet the Press” that it was an “easy” decision to vote against Patel, President-elect Donald Trump's pick to lead the FBI.  —  Sen. Adam Schiff, D-Calif., said Sunday that the New Year's … ",
    "url": "https://www.nbcnews.com/politics/congress/adam-schiff-new-orleans-attack-kash-patel-fbi-rcna186284"
  },
  {
    "text": "As Trump's election is certified, Americans should declare war on stupidity  —  Shame is what keeps us in check, or at least it should.  It certainly used to.  Trump, devoid of shame, has gone to great lengths to eviscerate that societal check.  —  On the eve of Donald Trump's election certification … ",
    "url": "https://www.usatoday.com/story/opinion/columnist/2025/01/05/trump-presidential-election-certification-embrace-stupidity/77409672007/"
  },
  {
    "text": "For Donald Trump, the Only Loyalty Is Fealty  —  Four years ago this Monday, Donald Trump pressured Mike Pence to pursue a surreal interpretation of the vice president's constitutional role in counting the Electoral College's votes.  Mr. Pence refused, igniting Mr. Trump's fury … ",
    "url": "https://www.nytimes.com/2025/01/05/opinion/trump-loyalty-cabinet-presidents.html"
  },
  {
    "text": "Director Brett Ratner, marginalized after ‘#MeToo’ allegations, will direct Melania Trump documentary  —  The News  —  The director and producer Brett Ratner, forced out of Hollywood at the peak of the #MeToo movement, will direct a documentary about First Lady Melania Trump for Amazon, the studio confirmed Sunday.",
    "url": "https://www.semafor.com/article/01/05/2025/director-brett-ratner-back-from-metoo-will-direct-melania-trump-documentary"
  }
]