[
  {
    "text": "Is Unfit to Lead Donald Trump Is Unfit to Lead  —  The editorial board is a group of opinion journalists  —  Next week, for the third time in eight years, Donald Trump will be nominated as the Republican Party's candidate for president of the United States.",
    "url": "https://www.nytimes.com/interactive/2024/07/11/opinion/editorials/donald-trump-2024-unfit.html"
  },
  {
    "text": "Playbook: What Obama and Pelosi are doing about Biden  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  This morning, we have a look at how, at a moment of unprecedented crisis for the Democratic Party, two of its most powerful and popular personalities … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/11/what-obama-and-pelosi-are-doing-about-biden-00167520"
  },
  {
    "text": "Democratic Sen. Peter Welch: Biden should withdraw for the good of the country  —  The stakes this November could not be higher.  —  Peter Welch, a Democrat, represents Vermont in the U.S. Senate.  —  I have great respect for President Biden.  He saved our country from a tyrant.",
    "url": "https://www.washingtonpost.com/opinions/2024/07/10/welch-biden-withdraw/"
  },
  {
    "text": "The Bonfire of the Democrats  —  We were really hoping to make today's newsletter squarely about the implications of the Law of the Sea Treaty but, you know, this Biden storyline!  And so, we've decided to dutifully keep covering it, with a mix of some fresh reporting, exclusive focus group data … ",
    "url": "https://www.thebulwark.com/p/the-bonfire-of-the-democrats"
  },
  {
    "text": "What Obama and Pelosi are doing about Biden  —  Two of the party's most prominent figures have served as sounding boards for people seeking to push the president aside.  —  Two of the Democratic Party's most powerful and popular personalities have assumed quiet, behind-the scenes roles … ",
    "url": "https://www.politico.com/news/2024/07/11/obama-pelosi-democratic-party-biden-00167522"
  },
  {
    "text": "Scoop: Schumer open to dumping Biden in 2024 … - Over the last 12 days, Schumer has been listening to donors' ideas and suggestions about the best way forward for the party, according to three people familiar with the matter.  — The majority leader is one of several Democrats … ",
    "url": "https://www.axios.com/2024/07/10/schumer-biden-dump-donors-2024-election"
  },
  {
    "text": "Trump's Lead Just Got Scarier—but This Dem Still Sees a Path for Biden  —  With President Biden forcefully declaring that he isn't leaving the presidential race, the latest polling looks frightening.  The Cook Political Report just released new polling averages showing Donald Trump leading Biden nationally by three points.",
    "url": "https://newrepublic.com/article/183675/trumps-lead-just-got-scarierbut-dem-still-sees-path-biden"
  },
  {
    "text": "The Night President Biden Lost George Clooney's Support  —  Hollywood fundraiser meant to turbocharge the president's re-election bid was the beginning of the end for one of his staunchest supporters  —  Less than four weeks ago, George Clooney stood on a stage in downtown Los Angeles … ",
    "url": "https://www.wsj.com/politics/elections/the-night-president-biden-lost-george-clooneys-support-4bd459d5"
  },
  {
    "text": "Most Democrats want Biden to drop out, but overall race is static, poll finds  —  More than half of Democrats say Biden should end his candidacy.  Overall, 2 in 3 adults say the president should step aside, including more than 7 in 10 independents.  —  Most Democrats nationwide … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/11/poll-biden-drop-out-election/"
  },
  {
    "text": "Conservatives See a Conspiracy Around Joe Biden's Stumbles  —  The right has become obsessed with the media after the president's bad debate.  —  Since before the 2020 election, Republicans and their conservative allies have loudly proclaimed that Joe Biden's lack of mental fitness disqualifies him from America's highest office.",
    "url": "https://www.politico.com/news/magazine/2024/07/11/biden-age-conservatives-conspiracy-00167438"
  },
  {
    "text": "IRS collects milestone $1 billion in back taxes from high-wealth taxpayers  —  The IRS announced Thursday that it has collected $1 billion in back taxes from high-wealth tax cheats — a milestone meant to showcase how the agency is making use of the money it received as part … ",
    "url": "https://apnews.com/article/irs-audits-wealthy-taxes-biden-treasury-b12a48b200834a7c9a04dc293e3273c2"
  },
  {
    "text": "Live Updates: Inflation Cooled Further in June  —  The Consumer Price Index rose 3 percent in June on an annual basis, a sharper slowdown in inflation than economists had expected.  On a monthly basis, prices dropped 0.1 percent.  —  The inflation cool-down was good news for all the right reasons.",
    "url": "https://www.nytimes.com/live/2024/07/11/business/cpi-inflation-fed"
  },
  {
    "text": "Donald Trump's fake rejection of Project 2025 has angered his biggest fans  —  Far-right trolls Alex Jones and Nick Fuentes don't seem to get Trump is only pretending to be more moderate  —  Steve Bannon has been in prison just over a week, and already one can see the strain on MAGA world … ",
    "url": "https://www.salon.com/2024/07/11/donald-fake-rejection-of-project-2025-has-angered-his-biggest-fans/"
  },
  {
    "text": "Hungary's Viktor Orbán to Visit Trump Following NATO Summit and Putin Meeting  —  Former President Donald Trump will meet with Hungarian Prime Minister Viktor Orbán in Florida on Thursday, according to people familiar with the matter, less than a week after he met with Russian President Vladimir Putin in Moscow.",
    "url": "https://time.com/6997281/viktor-orban-donald-trump-putin-nato/"
  },
  {
    "text": "Trump/Thomas 2024  —  History books will tell you that the Republican Party's 1996 ticket was Bob Dole and Jack Kemp.  And it's certainly true that if Dole had won, Kemp would've been sworn in as Vice President.  But for campaign purposes, those of us who were involved in the effort … ",
    "url": "https://www.findinggravity.net/p/trumpthomas-2024"
  },
  {
    "text": "How Trump played the media on abortion  —  Donald Trump has created a powerful political base of supporters, many of whom are attracted to his swashbuckling style.  But much of Trump's policy agenda is deeply unpopular — particularly with swing voters.  There is little support for enacting tax cuts … ",
    "url": "https://popular.info/p/how-trump-played-the-media-on-abortion"
  },
  {
    "text": "Trump's ‘secretary of retribution’ has a ‘target list’ of 350 people he wants arrested  —  Retribution is at the center of Donald Trump's third presidential election campaign.  —  “I am your warrior,” Trump proclaimed earlier this year.  “I am your justice, and for those who have been wronged and betrayed, I am your retribution.”",
    "url": "https://www.rawstory.com/raw-investigates/ivan-raiklin/"
  }
]