[
  {
    "text": "Trump swoops into Iowa fair, defying customs and clashing with DeSantis  —  Pork chops, protesters of the Florida governor and a swift visit by the former president were at the center of a high-drama day  —  DES MOINES — The crowd that had craned to watch Florida Gov. Ron DeSantis (R) … ",
    "url": "https://www.washingtonpost.com/elections/2023/08/12/iowa-state-fair-trump-desantis/"
  },
  {
    "text": "How Trump Benefits From an Indictment Effect  —  In polling, fund-raising and conservative media, the former president has turned criminal charges into political assets.  —  Early on March 18, former President Donald J. Trump hit send on a social media post saying he would be “arrested on Tuesday of next week.”",
    "url": "https://www.nytimes.com/2023/08/13/us/politics/trump-indictment-effect.html"
  },
  {
    "text": "DeSantis Gets Heckled and Trolled on His Big Day With Trump in Iowa  —  The Florida governor was hoping to have the stage to himself, but Donald Trump and his supporters have made that hard to achieve.  —  It's been said that a bad day at the fair is always better than a good day at work.",
    "url": "https://www.nytimes.com/2023/08/12/us/politics/iowa-state-fair-desantis-trump.html"
  },
  {
    "text": "Exclusive: Georgia prosecutors have messages showing Trump's team is behind voting system breach  —  Atlanta-area prosecutors investigating efforts to overturn the 2020 election results in Georgia are in possession of text messages and emails directly connecting members of Donald Trump's legal team … ",
    "url": "https://www.cnn.com/2023/08/13/politics/coffee-county-georgia-voting-system-breach-trump/"
  },
  {
    "text": "First on CNN: Fulton County DA to present Trump election subversion case to grand jury early next week  —  An Atlanta-area prosecutor has notified at least one witness to appear before a grand jury early next week, the most significant indication of her intention to seek indictments … ",
    "url": "https://www.cnn.com/2023/08/12/politics/geoff-duncan-georgia-election-probe/"
  },
  {
    "text": "BREAKING: Fulton grand jury to hear Trump case early next week  —  X  —  Fulton County District Attorney Fani Willis will begin presenting her 2020 elections interference case against former President Donald Trump and others to a grand jury early next week.",
    "url": "https://www.ajc.com/politics/breaking-fulton-grand-jury-to-hear-trump-case-early-next-week/EL7JW7LHTBGHRE2AMJ6OR6AYJ4/"
  },
  {
    "text": "Trump Election Interference Case to Go to Grand Jury in Georgia Early Next Week  —  Atlanta-area prosecutors have indicated that they will go before a grand jury early next week to present the results of their investigation into election interference by former President Donald J. Trump and his allies … ",
    "url": "https://www.nytimes.com/2023/08/12/us/trump-georgia-election-trial.html"
  },
  {
    "text": "The Supreme Court is taking a wrecking ball to the wall between church and state  —  The Court's Republican majority has ground the Constitution's establishment clause down to a nub.  —  Last June, a previously obscure Oklahoma state board voted to allow two Roman Catholic dioceses to operate a charter school in that state.",
    "url": "https://www.vox.com/scotus/2023/8/13/23822822/supreme-court-establishment-clause-church-state-separation-carson-bremerton"
  },
  {
    "text": "Argentina set for primary vote with ruling Peronists fighting for survival  —  Argentines head to the polls on Sunday in primary elections, with voters set to punish the ruling center-left Peronist coalition, angry at inflation scraping 116% and a cost of living crisis that has left four in 10 people in poverty.",
    "url": "https://www.reuters.com/world/americas/argentina-set-primary-vote-with-ruling-peronists-fighting-survival-2023-08-13/"
  },
  {
    "text": "Trump creates spectacle with debate guessing game  —  Former President Trump is seeking to keep the spotlight on him by drawing out his decision on whether or not to join his fellow candidates in the first GOP presidential primary debate later this month.  —  Trump has been threatening … ",
    "url": "https://thehill.com/homenews/campaign/4149489-trump-creates-spectacle-with-debate-guessing-game/"
  },
  {
    "text": "Death toll from Maui wildfire reaches 89, making it the deadliest in the US in more than 100 years  —  A fire that swept through a picturesque town in Maui this week has killed at least 89 people, authorities said Saturday, making it the deadliest U.S. wildfire of the past century.",
    "url": "https://thehill.com/homenews/state-watch/4150640-death-toll-from-maui-wildfire-reaches-89-making-it-the-deadliest-in-the-us-in-more-than-100-years/"
  },
  {
    "text": "Vos says lawmakers may consider impeachment if Protasiewicz doesn't recuse from redistricting cases  —  MADISON - If Wisconsin Supreme Court Justice Janet Protasiewicz does not recuse from lawsuits challenging the state's legislative boundaries, Republicans who control the state Legislature … ",
    "url": "https://www.jsonline.com/story/news/politics/2023/08/11/protasiewicz-must-recuse-from-redistricting-cases-or-risk-impeachment-vos-says-supreme-court/70578220007/"
  },
  {
    "text": "Violent threats against public officials are rising.  Here's why  —  For extremism researchers, the shooting death this week of a Utah man who was alleged to have made violent threats against President Joe Biden and other public officials highlights a concerning trend.",
    "url": "https://www.npr.org/2023/08/12/1193463117/violent-threats-against-public-officials-are-rising-heres-why"
  },
  {
    "text": "Former Rep. Al Lawson's Florida congressional seat could come back under new agreement  —  “This is a promising step forward for Black voters,” said the director of litigation and policy for the National Redistricting Foundation.  —  TALLAHASSEE, Fla. — A major legal challenge … ",
    "url": "https://www.politico.com/news/2023/08/12/florida-house-seat-al-lawson-00110962"
  }
]