[
  {
    "text": "Senate moves ahead on shutdown votes  —  Democrats agreed to speed up consideration of the bill to allow a vote on Friday in exchange for votes on four amendments.  —  Senate leaders struck a deal on Friday to pave the way for passage of the House GOP's seven-month stopgap spending bill and avoid a government shutdown.",
    "url": "https://www.politico.com/news/2025/03/14/senate-moves-ahead-on-shutdown-votes-00231437"
  },
  {
    "text": "Dem Civil War Erupts With ‘Screaming’ and Primary Threats Behind Closed Doors  —  Democrats are finally fighting amid MAGA 2.0—but it is with each other.  President Donald Trump picked a side in the party's burgeoning civil war Friday, praising his longtime foe, Senate Democratic leader Chuck Schumer … ",
    "url": "https://www.thedailybeast.com/dem-civil-war-erupts-over-government-shutdown-as-aoc-and-chuck-schumer-go-at-it/"
  },
  {
    "text": "Ex-Democratic Leader Schumer  —  Today on TAP: He has defied the will of the vast majority of Senate Democrats and played right into the hands of Trump.  Time for a new leader.  —  Senate Minority Leader Chuck Schumer (D-NY) leaves a Senate Democratic caucus luncheon outside the Senate Chamber … ",
    "url": "https://prospect.org/blogs-and-newsletters/tap/2025-03-14-ex-democratic-leader-schumer/"
  },
  {
    "text": "Democrats join with Republicans to advance House-passed government spending bill  —  Senate Democrats joined Republicans Friday on a key procedural vote to advance a bill that would ultimately avert a government shutdown at midnight, despite intensifying pressure from across the Democratic Party to block the GOP's funding measure.",
    "url": "https://www.cnn.com/2025/03/14/politics/government-funding-bill-senate-shutdown"
  },
  {
    "text": "Inside House Dems' furious anti-Schumer movement  —  House Democrats from across the party's ideological spectrum — united in their fury at Senate Minority Leader Chuck Schumer (D-N.Y.) — are engaged in a campaign to get Senate Democrats to defy their leader.",
    "url": "https://www.axios.com/2025/03/14/house-democrats-chuck-schumer-shutdown"
  },
  {
    "text": "10 Democrats help Republicans advance GOP funding bill to avoid shutdown  —  A group of 10 Democrats, including Senate Minority Leader Chuck Schumer (D-N.Y.), on Friday voted to advance a Republican-crafted bill to fund the government through Sept. 30, taking a crucial step toward avoiding … ",
    "url": "https://thehill.com/homenews/senate/5195254-gop-funding-bill-democrats-advance-senate/"
  },
  {
    "text": "Trump Demands Major Changes in Columbia Discipline and Admissions Rules  —  A letter outlining “immediate next steps” arrived less than a week after the administration said it was canceling $400 million in grants and contracts.  —  The Trump administration on Thursday demanded … ",
    "url": "https://www.nytimes.com/2025/03/13/nyregion/columbia-university-students-disciplined-hamilton-hall.html?unlocked_article_code=1.304.x6dC.bRQuLvmztnFc&smid=nytcore-android-share"
  },
  {
    "text": "Trump demands admissions overhaul and control of academic department at Columbia University  —  The Trump administration has delivered an extraordinary ultimatum to Columbia University, threatening to permanently end federal funding to the Ivy League school unless it cedes control … ",
    "url": "https://www.pbs.org/newshour/education/trump-demands-admissions-overhaul-and-control-of-academic-department-at-columbia-university"
  },
  {
    "text": "Trump calls his opponents ‘scum’ and lawbreakers in bellicose speech at Justice Department  —  For more than an hour, he delivered an insult-laden speech that shattered the traditional notion of DOJ independence.  —  President Donald Trump on Friday walked into the Department of Justice … ",
    "url": "https://www.politico.com/news/2025/03/14/trump-doj-speech-prison-opponents-00231438"
  },
  {
    "text": "The right dominates the online media ecosystem, seeping into sports, comedy, and other supposedly nonpolitical spaces  —  A new Media Matters analysis found 9 out of the 10 top online shows assessed are right-leaning … The 2024 presidential election has been dubbed the “podcast election” … ",
    "url": "https://www.mediamatters.org/google/right-dominates-online-media-ecosystem-seeping-sports-comedy-and-other-supposedly"
  },
  {
    "text": "Trump's quest to conquer Canada is confusing everyone  —  Canadians and Republicans alike are confounded as President Donald Trump increasingly links a trade war to his push to annex America's northern neighbor.  —  Eight years ago, President Donald Trump spoke about the U.S.-Canada relationship in glowing terms.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-quest-conquer-canada-confusing-everyone-rcna195657"
  },
  {
    "text": "Musk Immediately Calls for Judges to Be Impeached After DOGE Rulings  —  Elon Musk threw a tantrum after his Department of Government Efficiency (DOGE) was dealt a series of legal setbacks, immediately calling for the impeachment of federal judges.  “Without judicial reform … ",
    "url": "https://www.thedailybeast.com/elon-musk-immediately-calls-for-judges-to-be-impeached-after-rulings-overturn-doge-firings/"
  },
  {
    "text": "Boehler withdraws nomination as special presidential envoy for hostages affairs  —  Adam Boehler, who oversaw unprecedented direct negotiations with Hamas on behalf of President Trump, has withdrawn his nomination for the position of special presidential envoy for hostage affairs, according to two White House officials.",
    "url": "https://www.axios.com/2025/03/15/adam-boehler-nomination-special-presidential-envoy-hostages"
  },
  {
    "text": "After JD Vance is booed, Kennedy Center head urges ‘diversity and inclusion’  —  In a staff email, interim president Richard Grenell, a Trump ally, condemned a chorus of boos directed at the vice president and his wife at a concert Thursday night.  —  When Vice President JD Vance took … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/13/jd-vance-booed-kennedy-center/"
  },
  {
    "text": "Fear and Loathing in the West Wing  —  Inside the revolt against Elon Musk...  Welcome back to The Red Letter.  —  The tolerance for Elon Musk inside of the White House is wearing thin, as they deal with the fallout of his calamitous interview with Larry Kudlow when he touched the third rail - entitlements.",
    "url": "https://www.tarapalmeri.com/p/fear-and-loathing-in-the-west-wing"
  },
  {
    "text": "Kevin Drum, Influential Early Political Blogger, Dies at 66  —  Writing on his own and for Washington Monthly and Mother Jones, he earned a reputation as a serious policy thinker.  He also invented Friday cat blogging.  —  Kevin Drum, who gave up his day job in software marketing to write online … ",
    "url": "https://www.nytimes.com/2025/03/14/us/kevin-drum-dead.html?unlocked_article_code=1.304.ojLS.RMshLU9HeBBO&smid=url-share"
  },
  {
    "text": "A Close Elon Musk Friend Joins His Effort on Social Security  —  The involvement of Antonio Gracias, an investor who has known Elon Musk for two decades, suggests that Mr. Musk has made overhauling the Social Security Administration a priority.  —  A private equity investor … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/elon-musk-antonio-gracias-social-security-administration.html?unlocked_article_code=1.304.3qGa.Mvo8u9YKWHD3&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Office for Civil Rights Initiates Title VI Investigations into Institutions of Higher Education  —  WASHINGTON - The U.S. Department of Education's Office for Civil Rights (OCR) opened investigations into 45 universities under Title VI following OCR's February 14 Dear Colleague Letter (DCL) … ",
    "url": "https://www.ed.gov/about/news/press-release/office-civil-rights-initiates-title-vi-investigations-institutions-of-higher-education-0"
  },
  {
    "text": "Under Trump, AI Scientists Are Told to Remove ‘Ideological Bias’ From Powerful Models  —  A directive from the National Institute of Standards and Technology eliminates mention of “AI safety” and “AI fairness.”  —  The National Institute of Standards and Technology (NIST) … ",
    "url": "https://www.wired.com/story/ai-safety-institute-new-directive-america-first/"
  },
  {
    "text": "Trump moves to close facility that helps track planet-warming pollution  —  The lab is connected to the Mauna Loa Observatory, where scientists gather data to produce the Keeling Curve, a chart on the daily status of atmospheric carbon dioxide concentrations.",
    "url": "https://www.washingtonpost.com/climate-environment/2025/03/14/trump-cancels-greenhouse-gas-laboratory-lease/"
  },
  {
    "text": "Arlington Cemetery website scrubs links about Black and female veterans  —  Pentagon leaders have ordered that their websites and social media pages remove articles and images that “promote” DEI.  —  Arlington National Cemetery has scrubbed information about prominent Black … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/03/14/arlington-cemetery-website-dei-removals/"
  },
  {
    "text": "US court allows Trump to enforce ban on DEI programs, for now  —  A U.S. appeals court on Friday temporarily paused a judge's ruling that had blocked the administration of President Donald Trump from implementing bans on diversity, equity and inclusion programs at federal agencies and businesses … ",
    "url": "https://www.reuters.com/world/us/us-court-allows-trump-enforce-ban-dei-programs-now-2025-03-14/"
  },
  {
    "text": "Trump Admin Nixed Contract Helping Kidnapped Ukrainian Children  —  Even as President Donald Trump and government-demolition czar Elon Musk appear to actively favor Russia's interests amid discussions of how to end the Russia-Ukraine war, Secretary of State Marco Rubio has struck a studiously neutral posture.",
    "url": "https://newrepublic.com/article/192790/trump-kidnapped-ukrainian-kids-nixed-contract"
  },
  {
    "text": "Draft List for New Travel Ban Proposes Trump Target 43 Countries  —  A draft circulating inside the administration lists three tiers of countries whose citizens may face restrictions on entering the United States.  —  The Trump administration is considering targeting the citizens … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/trump-travel-ban.html"
  },
  {
    "text": "Focus group: Trump swing voters in Michigan have buyers' remorse  —  Most Michigan swing voters in our latest Engagious/Sago focus groups said that although they voted for President Trump in November, they have objections, frustrations and fears about his behavior since he returned to power.",
    "url": "https://www.axios.com/2025/03/14/trump-harris-michigan-focus-group"
  },
  {
    "text": "David French: Trump Admits He's Violating the Constitution  —  Trump & company aren't even attempting to create a pretext for why they're punishing the free speech of political opponents.  They are basically confessing in writing to violating the First Amendment.",
    "url": "https://www.thebulwark.com/p/david-french-trump-admits-hes-violating"
  },
  {
    "text": "Mace sued for defamation by man she accused of abuse in floor speech  —  The legal action seeks to carve out an exception from the speech or debate clause of the Constitution.  —  Rep. Nancy Mace (R-S.C.) is facing a defamation lawsuit filed by one of the four men she has publicly accused … ",
    "url": "https://www.politico.com/news/2025/03/14/nancy-mace-defamation-lawsuit-025919"
  }
]