[
  {
    "text": "BREAKING: First Trump RICO defendant takes plea agreement  —  X  —  Bail bondsman Scott Hall on Friday became the first defendant in the Fulton County election interference case to take a plea agreement with prosecutors.  —  During an impromptu hearing before Fulton Superior Court Judge Scott McAfee … ",
    "url": "https://www.ajc.com/politics/breaking-first-trump-rico-defendant-takes-plea-agreement/3L3OZWOFIJHWHLJUTQSNHO4VL4/"
  },
  {
    "text": "First co-defendant in Trump Georgia election case pleads guilty  — Scott Hall, one of 18 co-defendants of former President Donald Trump in the Georgia election interference case, pleaded guilty to the charges against him.  — Hall, a bail bondsman, is the first defendant in the case to plead guilty in the case.",
    "url": "https://www.cnbc.com/2023/09/29/first-co-defendant-in-trump-georgia-election-case-pleads-guilty.html"
  },
  {
    "text": "Trump floats plan to attend New York trial on business fraud  —  The surprise move would bring Trump face-to-face with a Manhattan judge he has repeatedly derided.  —  Former President Donald Trump plans to show up in person for at least the first week of a civil trial set to open in New York … ",
    "url": "https://www.politico.com/news/2023/09/29/trump-attend-business-fraud-trial-00119198"
  },
  {
    "text": "IRS contractor charged with stealing Donald Trump's tax returns, which were leaked to press  —  Federal prosecutors announced charges Friday against a contractor with the Internal Revenue Service who allegedly stole the tax returns of a high-ranking government official.",
    "url": "https://www.cnn.com/2023/09/29/politics/irs-contractor-trump-taxes/"
  },
  {
    "text": "UPDATED: IRS consultant charged in massive leak of taxpayer data  —  DOJ said Charles Littlejohn stole the files while working as a government contractor and gave them to a news organization.  —  A consultant for the IRS has been charged with leaking to the news media private tax information … ",
    "url": "https://www.politico.com/news/2023/09/29/irs-leak-charge-00119190"
  },
  {
    "text": "GOP senators say they won't stop Democrats from replacing Feinstein on Judiciary Committee  —  Sen. Dianne Feinstein's death creates a vacancy on the powerful panel that oversees President Biden's judicial nominees.  Without her, Democrats don't have a majority on it.",
    "url": "https://www.nbcnews.com/politics/congress/republicans-replace-dianne-feinstein-judiciary-committee-rcna118151"
  },
  {
    "text": "Trump Wins Delay on Deposition So He Can Attend Fraud Trial  —  A federal judge in Florida agreed to delay Donald Trump's deposition in his $500 million lawsuit against Michael Cohen by a week because the former president said he wants to attend the start of his New York state civil fraud trial.",
    "url": "https://www.bloomberg.com/news/articles/2023-09-29/trump-wins-delay-on-deposition-so-he-can-attend-fraud-trial"
  },
  {
    "text": "In a shift, McCarthy floats a clean stopgap without Ukraine aid  —  Speaker Kevin McCarthy (R-Calif.) on Friday evening floated passing a “clean” continuing resolution without Ukraine aid, marking a clear shift in the possibilities he is willing to consider to avert — or end … ",
    "url": "https://thehill.com/homenews/house/4231342-in-a-shift-mccarthy-floats-a-clean-stopgap-without-ukraine-aid/"
  },
  {
    "text": "Elon Musk attacked German support for migrants and promoted a call to support a far-right extremist political party  — Germany has responded to an attack from Elon Musk, saying it's “saving lives” by helping migrants.  — The billionaire had promoted the claim that Germany is facilitating “illegal” immigration to Europe.",
    "url": "https://www.businessinsider.com/elon-musk-immigration-migrants-germany-far-right-extremism-twitter-x-2023-9?op=1"
  },
  {
    "text": "With Shutdown Looming, Biden Calls Out Speaker McCarthy for a “Terrible Bargain” With MAGA Republicans  —  In a wide-ranging video interview being published Sunday, the president also addressed broad threats to democracy, ethical concerns about the Supreme Court and more.",
    "url": "https://www.propublica.org/article/biden-interview-shutdown-mccarthy-impeachment-gop"
  },
  {
    "text": "Matt Gaetz is reaching out to Dems about a McCarthy ouster  —  Among the lawmakers he spoke to as he threatens the speaker's gavel: Congressional Progressive Caucus Chair Rep. Pramila Jayapal (D-Wash.).",
    "url": "https://www.politico.com/live-updates/2023/09/29/congress/gaetz-courts-dems-00119085"
  },
  {
    "text": "Flooding in New York  —  A ‘Fire Hose of Moisture’ Inundates New York Streets and Subways  —  Gov. Kathy Hochul declared a state of emergency and urged people to stay off roads during what one official described as “the wettest day we've had since Hurricane Ida.”  —  Friday's rainfall in New York broke records.",
    "url": "https://www.nytimes.com/live/2023/09/29/nyregion/nyc-rain-flash-flooding"
  },
  {
    "text": "EXCLUSIVE: Robert F. Kennedy Jr. Planning to Announce Independent Run  —  2024 presidential candidate Robert F. Kennedy Jr. plans to announce he will run as an independent on October 9 in Pennsylvania, Mediaite has learned.  —  Kennedy's campaign machine is now planning “attack ads” … ",
    "url": "https://www.mediaite.com/politics/exclusive-robert-f-kennedy-jr-planning-to-announce-independent-run/"
  },
  {
    "text": "Ramaswamy fires back at Mexican president in border spat: ‘New daddy in town’  —  Obrador urged Mexican-Americans not to support the 38-year-old GOP hopeful during a recent press conference  —  FIRST ON FOX — Republican presidential candidate Vivek Ramaswamy is doubling … ",
    "url": "https://www.foxnews.com/politics/ramaswamy-fires-back-mexican-president-border-new-daddy-in-town"
  },
  {
    "text": "Man tied to suspected shooter in Tupac Shakur's 1996 killing arrested in Las Vegas, AP sources say  —  One of the last living witnesses to the 1996 killing of rapper Tupac Shakur has been arrested in the Las Vegas-area, a long-awaited breakthrough in a case that has frustrated investigators … ",
    "url": "https://apnews.com/article/tupac-shakur-killing-duane-keefe-davis-vegas-3f7050c2a68813d86a96b96fbb3f1d1a"
  },
  {
    "text": "Appeals court upholds Tennessee, Kentucky bans on transgender care for minors  —  A federal appeals court on Thursday allowed Tennessee and Kentucky to enforce laws banning gender-affirming medical care for minors, such as puberty blockers, hormones and surgery.",
    "url": "https://www.reuters.com/legal/appeals-court-upholds-tennessee-kentucky-bans-transgender-care-minors-2023-09-29/"
  },
  {
    "text": "Biden to convene his Cabinet early next week to discuss continuity of government  —  President Joe Biden is expected to convene his Cabinet early next week to discuss continuity of government after a potential shutdown begins Sunday, four administration officials familiar with the plans told CNN.",
    "url": "https://www.cnn.com/2023/09/29/politics/biden-cabinet-meeting-congress-shutdown/"
  }
]