[
  {
    "text": "Trump calls his globe-trotting ex-diplomat ‘my envoy.’ Neither is in office.  —  Richard Grenell is meeting with far-right foreign leaders, attacking President Biden and offering a glimpse at what U.S. foreign policy could be like in a second Trump term  —  After an anti-corruption crusader … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/28/richard-grenell-trump-envoy-serbia-guatemala/"
  },
  {
    "text": "These 50 companies have donated over $23 million to election deniers since January 6, 2021  —  Donald Trump lost the 2020 election.  —  Then, according to the report of the bipartisan January 6 Commission, Trump engaged in a “multi-part conspiracy to overturn the lawful results of the 2020 Presidential election.”",
    "url": "https://popular.info/p/these-50-companies-have-donated-over"
  },
  {
    "text": "How Greene's bid to topple Johnson could blow up the House — or in her own face  —  One House Republican summed up the fear: Her move could “deliver aid to Ukraine” by giving Johnson no choice but to seek common cause with Democrats.  —  Marjorie Taylor Greene's bid to vote … ",
    "url": "https://www.politico.com/news/2024/03/28/marjorie-taylor-greene-mike-johnson-ouster-00149325"
  },
  {
    "text": "Joseph Lieberman, senator and vice presidential nominee, dies at 82  —  Joseph I. Lieberman, the doggedly independent four-term U.S. senator from Connecticut who was the Democratic nominee for vice president in 2000, becoming the first Jewish candidate on the national ticket of a major party, died March 27 in New York City.",
    "url": "https://www.washingtonpost.com/obituaries/2024/03/27/joe-lieberman-senator-vice-president-dead/"
  },
  {
    "text": "Judge Forges Ahead With Pretrial Motions In Trump Georgia Election Interference Case  —  Lawyers for Trump argued that the charges in the Georgia election interference case seek to criminalize speech that is protected by the First Amendment.  —  LOADING  —  The charges against former … ",
    "url": "https://www.huffpost.com/entry/georgia-election-indictment_n_6605562be4b05f4de327e927"
  },
  {
    "text": "Judge to consider if Trump can throw out Georgia election subversion case on First Amendment grounds  —  For the first time since a judge ruled that Fulton County District Attorney Fani Willis can continue to oversee the Georgia 2020 election interference case against former President Donald Trump … ",
    "url": "https://www.cnn.com/2024/03/28/politics/fulton-county-trump-first-amendment-hearing/"
  },
  {
    "text": "Matt Schlapp's Accuser Was Paid to Drop Sexual Assault Suit  —  EXONERATED?  —  The GOP operative who sued Matt Schlapp over allegations of sexual assault dropped his lawsuit, prompting Schlapp to take a victory lap.  It's more complicated, however.",
    "url": "https://www.thedailybeast.com/matt-schlapps-accuser-was-paid-to-drop-sexual-assault-suit"
  },
  {
    "text": "Biden campaign to bring in massive $25M haul at star-packed fundraiser  —  The money is more than the president's team raised in all of February.  —  President Joe Biden will shatter fundraising records with a star-studded event on Thursday, with his campaign saying that it will bring … ",
    "url": "https://www.politico.com/news/2024/03/28/biden-campaign-fundraiser-00149490"
  },
  {
    "text": "Tale of a Tampon  —  Scenes from a sit-in at Vanderbilt.  —  Let me tell you about some Vanderbilt girl's tampon.  —  It all started yesterday morning, when a wave of undergrad students rushed Kirkland Hall, where Vanderbilt's chancellor's office is located.",
    "url": "https://www.thefp.com/p/tale-of-a-tampon"
  },
  {
    "text": "GOP scrambles to organize early and mail voting despite Trump's attacks  —  Republicans are playing catch-up to Democrats on voting before Election Day in battleground states, but Trump disparages those methods  —  In December, Donald Trump called for the end of mail-in voting in presidential elections.",
    "url": "https://www.washingtonpost.com/elections/2024/03/28/trump-mail-early-voting-republicans/"
  },
  {
    "text": "Trump Bibles make a mockery of Christianity — and that's exactly why MAGA will eat them up  —  Faith without morality or theology, much less that “soyboy” Jesus?  Sign MAGA Republicans up!  —  Earlier this week, Donald Trump unveiled his newest grift to squeeze money out of his cult followers: Trump-branded Bibles.",
    "url": "https://www.salon.com/2024/03/28/bibles-make-a-mockery-of-christianity--and-thats-exactly-why-maga-will-eat-them-up/"
  },
  {
    "text": "Judge rules John Eastman should be disbarred over efforts to overturn 2020 election  —  A California judge on Wednesday recommended disbarring a lawyer at the center of former President Trump's efforts to overturn the results of the 2020 election.  —  State Bar Judge Yvette Roland found … ",
    "url": "https://thehill.com/regulation/court-battles/4560409-judge-rules-john-eastman-should-be-disbarred-over-efforts-to-overturn-2020-election/"
  },
  {
    "text": "Next U.S. census will have new boxes for ‘Middle Eastern or North African,’ ‘Latino’  —  On the next U.S. census and future federal government forms, the list of checkboxes for a person's race and ethnicity is officially getting longer.  —  The Biden administration has approved proposals … ",
    "url": "https://npr.org/2024/03/28/1237218459/census-race-categories-ethnicity-middle-east-north-africa"
  },
  {
    "text": "Trump Launches Fresh Attack on Judge's Daughter After Gag Order  —  Less than 24 hours after Donald Trump got hit with a gag order in his hush-money trial, he launched a fresh attack on the judge and his family.  —  In posts on Truth Social Wednesday morning, Trump blasted Judge Juan Merchan and his family … ",
    "url": "https://newrepublic.com/post/180183/trumps-wild-response-judges-gag-order-trumpy"
  },
  {
    "text": "Legal experts worry about presidential abuse of the Insurrection Act.  Here's why  —  A bipartisan group of legal experts is sounding an alarm about presidential power this election season.  —  They're pushing Congress to update a cluster of laws known as the Insurrection Act and limit … ",
    "url": "https://npr.org/2024/03/28/1241141939/insurrection-act"
  },
  {
    "text": "NBC offered Ronna McDaniel a better contract to appear on MSNBC  —  The cable channel was part of the broad push to clinch a contributor deal for McDaniel, whose hiring caused an uproar  —  MSNBC President Rashida Jones participated in recruiting former Republican National Committee chair … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/27/ronna-mcdaniel-nbc-msnbc-contract/"
  },
  {
    "text": "MyPillow, owned by election denier Mike Lindell, formally evicted from Minnesota warehouse  —  A court ordered the eviction Wednesday of MyPillow from a suburban Minneapolis warehouse that it formerly used, but company founder and prominent election denier Mike Lindell said that it's … ",
    "url": "https://apnews.com/article/mike-lindell-mypillow-eviction-election-denier-11cd7e09f86f1ab03527281e51922730"
  },
  {
    "text": "Fugitive US Militant Ammon Bundy Geolocated to Utah  —  In February 2024, American anti-government agitator Ammon Bundy posted a video with a provocative title to his YouTube channel: ‘Want to know where Ammon Bundy is?’  —  Earlier in 2023, Bundy was ordered by an Idaho court to pay … ",
    "url": "https://www.bellingcat.com/news/2024/03/27/fugitive-us-militant-ammon-bundy-geolocated-to-utah/"
  },
  {
    "text": "Trump Attacks Judge's Daughter After Gag Order in Hush-Money Case  —  Donald Trump said a photo of him behind bars on Loren Merchan's X account meant he could not get a fair trial, but a court official said someone had appropriated the account.  —  It was an explosive claim from Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/03/27/nyregion/trump-social-media-attack.html"
  },
  {
    "text": "Kellyanne Conway considers return to Trumpworld … - Senior Trump advisers tell Axios no offer is on the table, however.  — What is clear is that Conway has been inserting herself into several hot policy debates in what many Republicans — with mixed feelings — see as an effort … ",
    "url": "https://www.axios.com/2024/03/28/kellyanne-conway-return-trump-campaign-2024"
  },
  {
    "text": "Trump claims crime rates are soaring.  The numbers indicate otherwise.  —  The presumptive Republican nominee frequently paints a picture of ever-increasing crime under Democrats.  But figures from police departments and the FBI indicate otherwise.  —  Surging crime levels, out-of-control Democratic cities and “migrant crime.”",
    "url": "https://www.nbcnews.com/politics/donald-trump/trumps-claims-crime-rates-clash-police-data-rcna145353"
  },
  {
    "text": "Here's What It Would Look Like to Remove Judge Cannon  —  Plus: The actions she could take if she were determined to kill off the classified documents case against Donald Trump.  —  THE JUDGE PRESIDING OVER Donald Trump's classified documents prosecution just gave Special Counsel Jack Smith … ",
    "url": "https://plus.thebulwark.com/p/what-it-would-look-like-to-remove-judge-cannon"
  },
  {
    "text": "Stop Putin now or war will come your way, Ukraine's leader warns U.S.  —  Eastern Ukraine — Ukraine's President Volodymyr Zelenskyy met our CBS News team at an undisclosed, bombed-out building in the far east of his country.  Bombed-out buildings aren't hard to come by here.",
    "url": "https://www.cbsnews.com/news/ukraine-russia-war-zelenskyy-says-putin-will-threaten-nato-quickly-if-not-stopped/"
  },
  {
    "text": "Trump's RNC struggles in swing states as Biden's team grows … - About a third of those ousted staffers were state directors and regional political directors, jobs that are key to recruiting, training and mobilizing volunteers far ahead of Election Day.  — They've been in limbo for two weeks … ",
    "url": "https://www.axios.com/2024/03/28/rnc-struggles-swing-states-biden"
  },
  {
    "text": "Jon Stewart benefited by 829% ‘overvalue’ of his NYC home even as he labels Trump's civil case ‘not victimless’  —  Comedian Jon Stewart ranted this week that Donald Trump's civil real-estate case overvaluing his properties was “not victimless,” yet when it came to his own home, Stewart benefited from a similar inflation.",
    "url": "https://nypost.com/2024/03/27/real-estate/jon-stewart-found-to-have-overvalued-his-nyc-home-by-829/"
  }
]