[
  {
    "text": "The Supreme Court Should Rule Swiftly on Trump's Immunity Claim  —  On Thursday, the U.S. Supreme Court will hear Donald Trump's arguments that he is immune from prosecution for his efforts to steal the 2020 presidential election.  It is likely that all — or nearly all … ",
    "url": "https://www.nytimes.com/2024/04/22/opinion/trump-immunity-supreme-court.html"
  },
  {
    "text": "Will a Mountain of Evidence Be Enough to Convict Trump?  —  Monday will see opening statements in the People of the State of New York v. Donald J. Trump.  The state's case seems strong, but a conviction is far from assured.  —  In the official record, the case is known as the People … ",
    "url": "https://www.nytimes.com/2024/04/21/nyregion/trump-trial-hush-money-evidence.html"
  },
  {
    "text": "Columbia University faces full-blown crisis as rabbi calls for Jewish students to ‘return home’  —  Columbia University is facing a full-blown crisis heading into Passover as a rabbi linked to the Ivy League school urged Jewish students to stay home and tense confrontations on campus sparked condemnation … ",
    "url": "https://www.cnn.com/2024/04/21/us/columbia-university-jewish-students-protests/"
  },
  {
    "text": "White House condemns ‘blatantly antisemitic’ protests as agitators engulf Columbia University  —  The White House condemned “in the strongest terms” the ongoing anti-Israel protests at colleges across the U.S., including at Columbia University in New York City, on Sunday, saying they have no place anywhere in the U.S.",
    "url": "https://www.foxnews.com/politics/white-house-condemns-blatantly-antisemitic-protests-agitators-engulf-columbia-university"
  },
  {
    "text": "Columbia rabbi warns Jewish students to go home, don't come back to campus because of ‘extreme antisemitism’  —  A prominent rabbi at Columbia University warned Jewish students to go home Sunday and not return to campus because of “extreme antisemitism,” while the Ivy League school said it would allow them to work online.",
    "url": "https://nypost.com/2024/04/21/us-news/columbia-rabbi-warns-jewish-students-to-go-home-dont-come-back-to-campus-because-of-extreme-antisemitism/"
  },
  {
    "text": "House Republicans blame Greene and Freedom Caucus for lack of border wins … - GOP leadership brought up border security provisions alongside their foreign aid package — but the package was blocked by Republicans from reaching the House floor under normal rules.",
    "url": "https://www.axios.com/2024/04/22/house-republicans-greene-border-security-foreign-aid"
  },
  {
    "text": "Playbook: The Biden polling bump persists  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TOP-ED — Former VP MIKE PENCE in the NYT: “Donald Trump Has Betrayed the Pro-Life Movement”  —  NEW POLL — Encouraging signs for President JOE BIDEN in a new NBC News poll:",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/21/the-biden-polling-bump-persists-00153528"
  },
  {
    "text": "Newsom proposes law to help Arizonans get abortions in California  —  California Gov. Gavin Newsom (D) said Sunday he would introduce legislation that would help Arizonans get abortions in his state, a move that comes after the Arizona Supreme Court this month ruled that a near-total abortion ban … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/21/gavin-newsom-abortion-arizona/"
  },
  {
    "text": "Hakeem Jeffries emerges as Congress' shadow speaker … - Former House Speaker Nancy Pelosi (D-Calif.), a master legislative tactician, heaped praise on her successor: “He is fabulous. … - One senior House Democrat told Axios: “It easily could have fallen apart ... He played the cards the way you'd want to play them.”",
    "url": "https://www.axios.com/2024/04/21/hakeem-jeffries-speaker-mike-johnson-israel-ukraine"
  },
  {
    "text": "RFK Jr. rarely mentions abortion — and sends mixed signals when he does  —  For many Americans, November's presidential election is about one issue: abortion.  President Biden hopes that a pro-abortion rights message will carry him to reelection, and Donald Trump regularly brags about his role … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/rfk-jr-abortion-mixed-signals/"
  },
  {
    "text": "Biden Earth Day Event Will Try to Reach Young Voters, a Crucial Bloc  —  At a national park in Virginia on Monday, the president will point to investments in clean energy and appear with future members of his American Climate Corps.  —  President Biden will travel to a national park in Virginia on Monday … ",
    "url": "https://www.nytimes.com/2024/04/22/us/politics/biden-climate-young-voters.html"
  },
  {
    "text": "Terry Anderson, AP reporter abducted in Lebanon and held captive for years, has died at 76  —  Terry Anderson, the globe-trotting Associated Press correspondent who became one of America's longest-held hostages after he was snatched from a street in war-torn Lebanon in 1985 and held for nearly seven years, has died at 76.",
    "url": "https://apnews.com/article/terry-anderson-dies-associated-press-c266353298c04dbf874ab4d94536f2b3"
  },
  {
    "text": "Some Trump chats with foreign leaders annoy Biden's team … - Biden administration officials privately have questioned whether some of Trump's meetings were appropriate, even as President Biden has jumped at the chance to accuse Trump of aligning with far-righters, strongmen and dictators.",
    "url": "https://www.axios.com/2024/04/22/trump-meetings-foreign-leaders-biden"
  },
  {
    "text": "Can cities criminalize camping?  Here's what to know about Supreme Court case. … Real news can be honest, hopeful, credible, constructive.  —  What is the Monitor difference?  Tackling the tough headlines - with humanity.  Listening to sources - with respect.",
    "url": "https://www.csmonitor.com/USA/Justice/2024/0421/supreme-court-grants-pass-v.-johnson-eighth-amendment-homelessness"
  },
  {
    "text": "Papua New Guinea leader takes offense after Biden implies an uncle was eaten by cannibals  —  MELBOURNE, Australia (AP) — Papua New Guinea's Prime Minister James Marape accused Joe Biden of disparaging the South Pacific island nation by implying that an uncle of the U.S. president had been eaten by … ",
    "url": "https://apnews.com/article/papua-new-guinea-biden-ambrose-finnegan-marape-cannibals-9479088c4262fe6879258e5ad135238f"
  },
  {
    "text": "Chinese-Americans Are Pushing San Francisco Toward the Political Center  —  Many are turning against the left over issues like anti-Asian crime and education policy  —  SAN FRANCISCO—Phil Wong used to reliably back incumbents in this liberal city.  But in 2022, he voted … ",
    "url": "https://www.wsj.com/politics/elections/chinese-american-voters-san-francisco-hate-crimes-b70a065e"
  },
  {
    "text": "Legal fees pile up for embattled Squad member Cori Bush … - From January through March, Bush paid law firms approximately $86,000, according to recently released campaign finance records.  — In the final months before the August primary election, Bush's campaign has $528,000 with $91,000 … ",
    "url": "https://www.axios.com/2024/04/21/cori-bush-legal-fees-primary-congress"
  }
]