[
  {
    "text": "Montana GOP Senate candidate says he lied to ranger about gunshot wound in 2015  —  Tim Sheehy was cited for illegally discharging a weapon in a national park but says he made up the gunshot to cover up a bullet wound he received as a Navy SEAL in Afghanistan that he never reported to superiors",
    "url": "https://www.washingtonpost.com/politics/2024/04/06/tim-sheehy-montana-senate-gunshot-wound-national-park/"
  },
  {
    "text": "GOP Candidate Says He Lied to Ranger About How He Was Shot  —  CURIOUSER AND CURIOUSER  —  One of the Republican Party's top recruits for 2024 has reportedly been telling inconsistent accounts of how he received a gunshot wound in his arm.  —  Montana Senate candidate Tim Sheehy … ",
    "url": "https://www.thedailybeast.com/gop-montana-candidate-tim-sheehy-says-he-lied-to-ranger-in-2015-about-how-he-was-shot"
  },
  {
    "text": "Trump's team shows growing pains in pivot to general election … - It's the latest in a series of reversals by Trump's team at the RNC, now led by chair Michael Whatley and Lara Trump, his daughter-in-law.  — Those who've been rehired include most of the RNC's staff in key states … ",
    "url": "https://www.axios.com/2024/04/06/trump-campaign-rnc-2024-election"
  },
  {
    "text": "Biden may have trouble getting on Ohio's general election ballot, state's top elections official warns  —  In a letter to Ohio's Democratic Party chair, Secretary of State Frank LaRose warns that the Democratic National Convention will take place after a state deadline to declare a candidate.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-may-trouble-getting-ohios-general-election-ballot-rcna146706"
  },
  {
    "text": "Biden could face challenges getting on Ohio general ballot  —  The state's Dems were alerted Joe Biden could be non-compliant with state law.  —  President Joe Biden delivers remarks during a campaign event with Vice President Kamala Harris in Raleigh, N.C., March 26, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-face-challenges-ohio-general-ballot/story?id=108912620"
  },
  {
    "text": "Trump's bizarre, vindictive incoherence has to be heard in full to be believed  —  Excerpts from his speeches do not do justice to Trump's smorgasbord of vendettas, non sequiturs and comparisons to famous people  —  Donald Trump's speeches on the 2024 campaign trail so far have been focused … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/06/donald-trump-speech-analysis"
  },
  {
    "text": "Anonymous users are dominating right-wing discussions online.  They also spread false information  —  NEW YORK (AP) — The reposts and expressions of shock from public figures followed quickly after a user on the social platform X who uses a pseudonym claimed that a government website had revealed … ",
    "url": "https://apnews.com/article/misinformation-anonymous-accounts-social-media-2024-election-8a6b0f8d727734200902d96a59b84bf7"
  },
  {
    "text": "When a top Republican says Russian propaganda has infected the GOP  —  House Foreign Affairs Committee Chairman Michael McCaul is the latest to point out such a problem in his party  —  During the first impeachment inquiry into President Donald Trump in 2019, former Trump national security aide Fiona Hill made an extraordinary plea.",
    "url": "https://www.washingtonpost.com/politics/2024/04/06/when-top-republican-says-russian-propaganda-has-infected-gop/"
  },
  {
    "text": "Trump Is Accidentally Exposing Aileen Cannon's Shady Pro-MAGA Game  —  When Judge Aileen Cannon handed down her latest ruling in the prosecution of Donald Trump for stealing classified documents, many legal observers immediately understood the shady gamesmanship lurking behind it.",
    "url": "https://newrepublic.com/article/180514/trump-judge-aileen-cannon-ruling-shady-maga-game"
  },
  {
    "text": "April 5, 2024  —  Today offered yet more evidence that Biden's rejection of the Republicans' supply-side economics in favor of investing in ordinary Americans is paying off with high growth, low unemployment, and strong wages.  —  Today's jobs report from the U.S. Department of Labor … ",
    "url": "https://heathercoxrichardson.substack.com/p/april-5-2024"
  },
  {
    "text": "Do our leaders, ‘experts’ and pundits want World War III?  —  At least within the circles I run, people who encounter purposely-created insanity and danger openly acknowledge the insanity and danger and, for reasons of self-protection and survival, want it stopped as fast as possible.",
    "url": "https://thehill.com/opinion/international/4577779-do-our-leaders-experts-and-pundits-want-world-war-iii/"
  },
  {
    "text": "Trump's Lawyers Told the Court That No One Would Give Him a Bond.  Then He Got a Lifeline, but They Didn't Tell the Judges.  —  An appeals court reduced Trump's bond by more than 60% after his attorneys claimed it was a “practical impossibility” to pay the full amount.",
    "url": "https://www.propublica.org/article/trump-bond-disclosure-appeals-court-hankey"
  },
  {
    "text": "‘Extreme’ US anti-abortion group ramps up lobbying in Westminster  —  The UK branch of the Alliance Defending Freedom has increased its spending and is forging ties with key MPs  —  A rightwing Christian lobby group that wants abortion to be banned has forged ties with an adviser … ",
    "url": "https://www.theguardian.com/world/2024/apr/06/extreme-us-anti-abortion-group-ramps-up-lobbying-in-westminster"
  },
  {
    "text": "‘The Israelis usually fire and then ask questions’ in my experience: Former Defense Secretary  —  Leon Panetta, former defense secretary for the Obama administration, said it's “not surprising” that Israel admitted mistakes after an airstrike killed aid workers earlier this week … ",
    "url": "https://thehill.com/policy/defense/4578364-israelis-fire-then-ask-questions-my-experience-former-defense-secretary/"
  }
]