[
  {
    "text": "Trump executive order will attempt to end birthright citizenship  —  The incoming president plans to take at least 10 actions related to the border or immigration, including ramping up deportations and suspending refugee resettlement.  —  The U.S. government will no longer recognize … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/20/trump-immigration-executive-orders/"
  },
  {
    "text": "Senate Passes Border Crackdown Bill, Teeing Up Final House Vote  —  The measure, which increases deportations for undocumented migrants charged with crimes, is likely to be the first bill to reach President Trump's desk.  It must pass one more House vote to clear Congress.",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/senate-passes-border-crackdown-bill.html"
  },
  {
    "text": "Trump's pledge to rename Denali rankles Alaskan lawmakers  —  President Donald Trump's pledge to rename the highest mountain in North America put Alaska's all-Republican congressional delegation in varying states of dismay after he reiterated plans to change Denali back to Mount McKinley in his inaugural address Monday.",
    "url": "https://www.politico.com/live-updates/2025/01/20/donald-trump-inauguration-day-news-updates-analysis/trump-denali-mckinley-alaska-00199491"
  },
  {
    "text": "All of the Day 1 executive actions Trump has announced so far  —  For updates, context and analysis of Donald Trump's 2025 inauguration, check out NPR's live blog throughout the day Monday.  —  President Trump is expected to sign a flurry of executive orders, memorandums and proclamations … ",
    "url": "https://www.npr.org/2025/01/20/g-s1-43698/trump-inauguration-executive-orders-2025-day-1"
  },
  {
    "text": "Statement from President Joe Biden  —  I am issuing pardons to Gerald G. Lundergan and Ernest William Cromartie.  I am also commuting the life sentence imposed on Leonard Peltier so that he serves the remainder of his sentence in home confinement.  —  My family has been subjected … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/20/statement-from-president-joe-biden-16/"
  },
  {
    "text": "Trump pardons roughly 1,500 criminal defendants charged in the Jan. 6 Capitol attack  —  The sweeping pardons would mark the beginning of the end of one of the largest investigations in FBI history.  —  WASHINGTON — President Donald Trump said on Monday that he was issuing roughly 1,500 pardons … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-set-pardon-defendants-stormed-capitol-jan-6-2021-rcna187735"
  },
  {
    "text": "Trump preparing sweeping pardons for Jan. 6 defendants, with commutations for violent offenders: Sources  —  President Donald Trump is preparing to issue a sweeping series of pardons for defendants charged in the Jan. 6, 2021, attack on the U.S. Capitol, including commuting the prison sentences … ",
    "url": "https://www.goodmorningamerica.com/news/story/trump-teases-pardoning-jan-6-rioters-day-1-117880690"
  },
  {
    "text": "Get out of DOGE: How Musk helped eject Ramaswamy  —  Ramaswamy is leaving the so-called Department of Government Efficiency and plans to run for Ohio governor.  —  Elon Musk has already achieved his first cut at the so-called Department of Government Efficiency: his co-leader Vivek Ramaswamy.",
    "url": "https://www.politico.com/news/2025/01/20/doge-musk-helped-eject-ramaswamy-00199487"
  },
  {
    "text": "Elon Musk's DOGE to be sued within minutes of Trump inauguration  —  The legal status of Musk's government waste panel will be challenged in federal court almost as soon as the president-elect is sworn in.",
    "url": "https://www.washingtonpost.com/business/2025/01/20/doge-trump-musk-ramaswamy/"
  },
  {
    "text": "Right-Wing Extremists Are Abuzz Over Musk's Straight-Arm Salute  —  “Incredible things are happening already lmao,” wrote Gab founder and Hitlerbot innovator Andrew Torba  —  Right-wing extremists, white nationalists, and neo-Nazis are celebrating an alarming gesture made by the world's richest man.",
    "url": "https://www.rollingstone.com/politics/politics-news/elon-musk-salute-reaction-right-wing-extremists-1235241866/"
  },
  {
    "text": "Elon Musk Ignites Online Speculation Over the Meaning of a Hand Gesture  —  Speaking at a celebratory rally in Washington, Mr. Musk twice extended his arm out with his palm facing down, drawing comparisons to the Nazi salute.  —  Elon Musk ignited speculation and chatter online … ",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/elon-musk-hand-gesture-speech.html"
  },
  {
    "text": "Initial Rescissions Of Harmful Executive Orders And Actions  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:  —  Section 1.  Purpose and Policy.  The previous administration has embedded deeply unpopular … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/initial-rescissions-of-harmful-executive-orders-and-actions/"
  },
  {
    "text": "Musk Is Likely to Get a West Wing Office for His Cost-Cutting Project  —  The world's richest man had been expected to be situated in the Eisenhower Executive Office Building, but a West Wing office would give him closer access to President Trump.  —  Elon Musk, the world's richest man … ",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/elon-musk-office-west-wing.html?unlocked_article_code=1.qk4.Vyfy.Cuz6tX0UTBRF&smid=url-share"
  },
  {
    "text": "Portrait of General Milley Is Removed From Pentagon  —  The decision was an early salvo by the new administration against a military that President Trump has assailed for a variety of perceived offenses.  —  The Pentagon on Monday removed a portrait of Gen. Mark A. Milley … ",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/general-mark-milley-portrait.html"
  },
  {
    "text": "GRANTING PARDONS AND COMMUTATION OF SENTENCES FOR CERTAIN OFFENSES RELATING TO THE EVENTS AT OR NEAR THE UNITED STATES CAPITOL ON JANUARY 6, 2021  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  This proclamation ends a grave national injustice that has been perpetrated upon … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/granting-pardons-and-commutation-of-sentences-for-certain-offenses-relating-to-the-events-at-or-near-the-united-states-capitol-on-january-6-2021/"
  },
  {
    "text": "Inside Trump's Oval Office—Version 2.0  —  Spoiler alert: The Diet Coke button is back.",
    "url": "https://www.wsj.com/politics/policy/inside-trumps-oval-officeversion-2-0-9b1da2c8?st=QgqicY&reflink=article_copyURL_share"
  },
  {
    "text": "Cecile Richards, former Planned Parenthood president and feminist activist, has died  —  Richards died Monday of an aggressive brain cancer.  She was 67.  —  Cecile Richards, the former president of Planned Parenthood and feminist activist, died Monday of an aggressive brain cancer, her family confirmed in a statement.",
    "url": "https://19thnews.org/2025/01/cecile-richards-former-planned-parenthood-president-and-feminist-activist-has-died/"
  },
  {
    "text": "APPLICATION OF PROTECTING AMERICANS FROM FOREIGN ADVERSARY CONTROLLED APPLICATIONS ACT TO TIKTOK  —  By the authority vested in me as President by the Constitution and the laws of the United States of America it is hereby ordered:  —  Section 1.  Policy.  The Protecting Americans … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/application-of-protecting-americans-from-foreign-adversary-controlled-applications-act-to-tiktok/"
  },
  {
    "text": "Joe Biden Grants Clemency To Leonard Peltier  —  The ailing Native American rights activist has been in prison for nearly 50 years after the U.S. government lied to put him there.  —  LOADING  —  WASHINGTON ― With literally minutes left in his presidency, Joe Biden on Monday granted clemency … ",
    "url": "https://www.huffpost.com/entry/joe-biden-leonard-peltier-clemency_n_67608b04e4b0d06419ec6367"
  },
  {
    "text": "Exclusive: Trump administration canceling flights for nearly 1,660 Afghan refugees, say U.S official, advocate  —  Nearly 1,660 Afghans cleared by the U.S. government to resettle in the U.S., including family members of active duty U.S. military personnel, are having their flights canceled … ",
    "url": "https://www.reuters.com/world/us/trump-administration-canceling-flights-nearly-1660-afghan-refugees-say-us-2025-01-20/"
  },
  {
    "text": "Trump doesn't place hand on Bible during swearing-in  —  Chief Justice John Roberts administered the oath of office.  —  Donald Trump is sworn in as the 47th president of the United States by Chief Justice John Roberts as Melania Trump holds the Bible during the 60th Presidential Inauguration … ",
    "url": "https://abcnews.go.com/Politics/trump-inauguration-hand-bible-swearing-in/story?id=117897715"
  }
]