[
  {
    "text": "Special Counsel asks Supreme Court to immediately decide Trump immunity question  —  A federal judge had rejected former President Donald Trump's immunity claim over his prosecution in election interference case.  —  WASHINGTON — Special Counsel Jack Smith on Monday asked the Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/special-counsel-asks-supreme-court-immediately-decide-trump-immunity-q-rcna129088"
  },
  {
    "text": "Jack Smith asks Supreme Court to keep Trump trial on track  —  Without the Supreme Court's swift intervention, Trump's federal election-subversion trial could be indefinitely delayed, the special counsel warned.  —  Special counsel Jack Smith is urging the Supreme Court … ",
    "url": "https://www.politico.com/news/2023/12/11/trump-supreme-court-jack-smith-trial-00131112"
  },
  {
    "text": "Special Counsel Asks Supreme Court to Decide Whether Trump Is Immune From Prosecution  —  The request was unusual in two ways: Jack Smith asked the justices to rule before an appeals court acted, and he urged them to move with exceptional speed.  —  Jack Smith, the special counsel prosecuting … ",
    "url": "https://www.nytimes.com/2023/12/11/us/politics/trump-supreme-court-immunity-election-case.html"
  },
  {
    "text": "Texas woman who sought court permission for abortion leaves state for the procedure, attorneys say  —  A pregnant Texas woman who sought court permission for an abortion in an unprecedented challenge to one of the most restrictive bans in the U.S. has left the state to obtain the procedure, her attorneys said Monday.",
    "url": "https://apnews.com/article/abortion-texas-ban-7d865cdfd75bdc6b2f4186f4d1e6e8bd"
  },
  {
    "text": "The Texas abortion case blows up the abortion ban rationale  —  Abortion rights activists, medical professionals and ordinary women warned the Supreme Court in advance of the Dobbs v. Jackson Women's Health Organization decision: Legislatures cannot dictate medical decisions without creating horrendous injustices and medical travesties.",
    "url": "https://www.washingtonpost.com/opinions/2023/12/11/abortion-ban-texas/"
  },
  {
    "text": "CNN Polls: Trump leads Biden in Michigan and Georgia as broad majorities hold negative views of the current president  —  Former President Donald Trump has the upper hand over President Joe Biden in two critical battleground states - Michigan and Georgia - with broad majorities … ",
    "url": "https://www.cnn.com/2023/12/11/politics/cnn-polls-trump-biden-michigan-georgia/"
  },
  {
    "text": "Michigan Gov. Gretchen Whitmer's latest move on abortion highlights Democrats' 2024 push  —  In an interview with NBC News before repealing a remaining state restriction on abortion, Whitmer said, “When you stay in the fight, you can win.”  —  Michigan Gov. Gretchen Whitmer on Monday repealed … ",
    "url": "https://www.nbcnews.com/politics/politics-news/gretchen-whitmers-abortion-move-highlights-democrats-2024-push-rcna128930"
  },
  {
    "text": "Iowa Poll: Donald Trump holds overwhelming lead; Ron DeSantis edges ahead of Nikki Haley  —  A new nationally renowned Iowa Poll shows that a shrinking field has only made Donald Trump's lead grow as Nikki Haley and Ron DeSantis fail to capitalize on powerful endorsements",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2023/12/11/iowa-poll-ron-desantis-nikki-haley-unable-to-shrink-donald-trumps-overwhelming-lead-iowa-caucuses/71850893007/"
  },
  {
    "text": "Israel used U.S.-supplied white phosphorus in Lebanon attack  —  DHEIRA, Lebanon — Israel used U.S.-supplied white phosphorus munitions in an October attack in southern Lebanon that injured at least nine civilians in what a rights group says should be investigated as a war crime … ",
    "url": "https://www.washingtonpost.com/investigations/2023/12/11/israel-us-white-phosphorus-lebanon/"
  },
  {
    "text": "“Bombshell”: Does Harvard's President Also Have a Plagiarism Scandal?  Update: Billionaire donor demands Gay's firing  —  Isn't the anti-Semitism and hypocrisy scandal enough for Claudine Gay?  Harvard's board has gotten very quiet over the past week after its president's congressional testimony outraged practically everyone.",
    "url": "https://hotair.com/ed-morrissey/2023/12/11/bombshell-does-harvards-president-also-have-a-plagiarism-scandal-n598202"
  },
  {
    "text": "House Speaker Mike Johnson pursues impeachment strategy he once said could cause ‘irreparable damage’ to the country  —  House Speaker Mike Johnson is pursuing an impeachment strategy against President Joe Biden that he once said could cause “irreparable damage” to the country when Democrats sought … ",
    "url": "https://www.cnn.com/2023/12/11/politics/kfile-johnson-impeachment-strategy-irreparable-damage-invs/"
  },
  {
    "text": "Dover Man Arrested and Charged with Threatening to Kill a Presidential Candidate  —  For Immediate Release  —  U.S. Attorney's Office, District of New Hampshire  —  CONCORD - A Dover man has been arrested and charged in connection with sending text messages that threatened a presidential candidate … ",
    "url": "https://www.justice.gov/usao-nh/pr/dover-man-arrested-and-charged-threatening-kill-presidential-candidate"
  },
  {
    "text": "Civil rights lawyer Sherrilyn Ifill leaving X after Alex Jones account reinstated  —  Prominent civil rights attorney Sherrilyn Ifill announced she is leaving X, the social media platform formerly known as Twitter, due to the Elon Musk-owned platform reinstating far-right conspiracy theorist Alex Jones's account.",
    "url": "https://thehill.com/homenews/4354003-sherrilyn-ifill-leaving-x-alex-jones-musk/"
  },
  {
    "text": "Right Deed, Wrong Reason  —  The firing of Penn president Liz Magill, along with the embattled status of her peers at MIT and Harvard, owes to an irony: they are being condemned not for their many abuses of free speech but for their one correct articulation of it.  —  / Eye on the News / The Social Order, Education",
    "url": "https://www.city-journal.org/article/right-deed-wrong-reason"
  },
  {
    "text": "Rudy Giuliani defamation damages trial set to begin in DC  —  Rudy Giuliani's defamation damages trial is set to begin Monday as the court considers the monetary damages the former Donald Trump attorney must pay two election workers.  —  The trial, which is expected to last four days … ",
    "url": "https://www.cnn.com/2023/12/11/politics/rudy-giuliani-defamation-trial/"
  },
  {
    "text": "Air Force watchdog finds alleged Pentagon leaker Jack Teixeira's unit “failed” to take action after witnessing questionable activity  —  The Air Force inspector general found that individuals in alleged Pentagon leaker Jack Teixeira's unit failed to take proper action after at least four separate security incidents.",
    "url": "https://www.cbsnews.com/news/air-force-pentagon-leaker-jack-teixeira-investigation-report/"
  },
  {
    "text": "Majority of Americans Back Israel as Democrats Split Over War With Hamas, WSJ Poll Finds  —  Republicans and independents are more sympathetic to Israelis than Palestinians; Biden gets low marks for handling of conflict  —  WASHINGTON—U.S. public opinion remains favorable toward Israel … ",
    "url": "https://www.wsj.com/politics/majority-of-americans-back-israel-as-democrats-split-over-war-with-hamas-wsj-poll-finds-030f22c2?mod=followamazon"
  },
  {
    "text": "Former Rep. George Santos in plea deal talks with prosecutors, court filing says  — Federal prosecutors are “engaged in plea negotiations” with former Rep. George Santos to resolve his criminal fraud case in New York, a court filing said.  — The Republican was ousted from Congress at the beginning of December.",
    "url": "https://www.cnbc.com/2023/12/11/former-rep-george-santos-in-plea-talks-with-prosecutors.html"
  },
  {
    "text": "Hunter Biden moves to dismiss Delaware gun charges  —  Hunter Biden filed a series of motions challenging gun charges brought against him in Delaware, arguing special counsel David Weiss “buckled under political pressure” in bringing the case.  —  Biden's motion to dismiss the case as a … ",
    "url": "https://thehill.com/regulation/court-battles/4354453-hunter-biden-moves-to-dismiss-delaware-gun-charges/"
  }
]