[
  {
    "text": "The Trump Administration Accidentally Texted Me Its War Plans  —  The world found out shortly before 2 p.m. eastern time on March 15 that the United States was bombing Houthi targets across Yemen.  —  I, however, knew two hours before the first bombs exploded that the attack might be coming.",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151/?gift=kPTlqn0J1iP9IBZcsdI5IVJpB2t9BYyxpzU4sooa69M&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Six Short Thoughts on the Most Insane Trump Story of All Time  —  Trump's “Team of Amateurs” Screwed Up in the Most Hilarious (and Troublesome) Way  —  This afternoon, just before 1 pm ET, The Atlantic posted what is, hands down, the wildest and most insane story I have ever read about US national security … ",
    "url": "https://www.doomsdayscenario.co/p/six-short-thoughts-on-the-most-insane-trump-story-of-all-time"
  },
  {
    "text": "Waltz's future in doubt following accidental war plan leak  —  “You can't have recklessness as the national security adviser,” one official said.  —  The stunning revelation that top administration officials accidentally included a reporter in a group chat discussing war plans … ",
    "url": "https://www.politico.com/news/2025/03/24/mike-waltz-signal-chat-resign-00246541"
  },
  {
    "text": "If Pete Hegseth Had Any Honor, He Would Resign  —  I don't know how Pete Hegseth can look service members in the eye.  He's just blown his credibility as a military leader.  —  On Monday, The Atlantic's Jeffrey Goldberg published one of the most extraordinary stories I've ever read.",
    "url": "https://www.nytimes.com/2025/03/24/opinion/atlantic-hegseth-vance-houthis.html"
  },
  {
    "text": "A Conversation With Jeffrey Goldberg About His Extraordinary Scoop  —  How The Atlantic's editor in chief found himself in a group chat with Trump-administration officials who were planning an attack on Yemen  —  The Trump administration has provided many jaw-dropping moments … ",
    "url": "https://www.theatlantic.com/newsletters/archive/2025/03/jeffrey-goldberg-group-chat-military-houthi-yemen/682160/?gift=49wmX9XxesaxFXKJmFp0PiUM0jF-UVSY5Pe5ceBgrPY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "“Heads should roll”: Congress erupts over stunning Trump admin leak  —  Members of Congress in both parties exploded in anger Monday after the editor-in-chief of The Atlantic revealed he was inadvertently included in a highly-sensitive Trump administration Signal chat on airstrikes in Yemen.",
    "url": "https://www.axios.com/2025/03/24/atlantic-yemen-signal-hegseth-jeffrey-goldberg"
  },
  {
    "text": "Trump Officials in Signal Fiasco Attended Secret Mar-a-Lago Dinner Shortly After Celebrating Bombing  —  Trump officials accidentally invited the editor-in-chief of The Atlantic to their Signal group chat.  Hours after bombs dropped on Yemen, they partied at a $1-million-per-seat Mar-a-Lago dinner.",
    "url": "https://www.wired.com/story/trump-officials-signal-chat-candlelight-dinner-mar-a-lago-yemen/"
  },
  {
    "text": "‘Amateur hour’: Washington aghast at Trump administration's war plan group chat  —  One Democratic lawmaker also called for immediate hearings on the incident.  —  Members of Congress and national security staffers were stunned Monday by a bombshell report that top Trump administration officials … ",
    "url": "https://www.politico.com/news/2025/03/24/hegseth-national-security-group-chat-atlantic-reaction-00244983"
  },
  {
    "text": "Social Security rushing service cuts at White House request, sources say  —  The Social Security Administration is rushing cuts to phone services at the White House's request, the agency's acting commissioner told Social Security advocates in a meeting on Monday, two sources who attended tell Axios.",
    "url": "https://www.axios.com/2025/03/24/social-security-cuts-doge"
  },
  {
    "text": "Long waits, waves of calls, web crashes: Social Security is breaking down  —  A flood of cuts led by Elon Musk has sent the agency into chaos as a new commissioner prepares to take charge.  —  Just now  —  The Social Security Administration website crashed four times in 10 days this month … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/25/social-security-phones-doge-cuts/"
  },
  {
    "text": "Jordan briefs Trump on plans to rein in federal judges  —  House Judiciary Chair Jim Jordan said he briefed President Donald Trump over the weekend about his panel's plans to examine how the federal judiciary is working to block key parts of the administration's agenda.",
    "url": "https://www.politico.com/live-updates/2025/03/24/congress/jordan-briefs-trump-on-plans-to-rein-in-federal-judges-00246748"
  },
  {
    "text": "DHS Sec. Noem says will move to ‘eliminate’ FEMA, a long-time Trump target  —  The News  —  US Homeland Security Secretary Kristi Noem told a Cabinet meeting Monday that the department would move to “eliminate” the government's disaster relief agency, days after President Donald Trump signed … ",
    "url": "https://www.semafor.com/article/03/24/2025/dhs-sec-kristi-noem-says-administration-will-move-to-eliminate-fema"
  },
  {
    "text": "USPS chief Louis DeJoy resigns as Trump eyes overhauling mail agency  —  The postmaster general had said in February that he would stay on until a successor was chosen.  —  U.S. Postmaster General Louis DeJoy will resign at the end of the day Monday, concluding a five-year tenure that began … ",
    "url": "https://www.washingtonpost.com/business/2025/03/24/louis-dejoy-steps-down-usps-chief/"
  },
  {
    "text": "Columbia Student Hunted by ICE Sues to Prevent Deportation  —  Yunseo Chung, a legal permanent resident who has lived in the U.S. since she was 7, participated in pro-Palestinian demonstrations.  Immigration agents visited residences looking for her.  —  A 21-year-old Columbia University student … ",
    "url": "https://www.nytimes.com/2025/03/24/nyregion/columbia-student-ice-suit-yunseo-chung.html?unlocked_article_code=1.6U4.Yj1G.FUi0xl3HHpi2&smid=url-share"
  },
  {
    "text": "Lobbyist And Government Contractor Bought JD Vance's Home For $170,000 Over Asking Price  —  A government contractor and lobbyist who served in President Donald Trump's first administration bought Vice President JD Vance's Virginia home in an above-market deal, a sale his spokesperson says was based on the market.",
    "url": "https://www.forbes.com/sites/zacheverson/2025/03/24/jd-vance-house-sale-government-contractor-lobbyist-trump/"
  },
  {
    "text": "Oscar-winning Palestinian director is attacked by Israeli settlers and detained by the army  —  Israeli settlers beat up one of the Palestinian co-directors of the Oscar-winning documentary film “ No Other Land ” on Monday in the occupied West Bank before he was detained by the Israeli military … ",
    "url": "https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2"
  },
  {
    "text": "Trump's portrait to be taken down at Colorado Capitol after president claimed it was ‘distorted’  —  A painting of Donald Trump hanging with other presidential portraits at the Colorado state Capitol will be taken down after Trump claimed that his was “purposefully distorted,” according to a letter obtained by The Associated Press.",
    "url": "https://apnews.com/article/trump-portrait-colorado-capitol-president-2f60271ddd58d979627ec5d2cd5dea89"
  },
  {
    "text": "Trump nominates Susan Monarez for CDC director, elevating from acting role  —  President Trump has decided to pick Susan Monarez to be the new nominee to head the Centers for Disease Control and Prevention, making permanent the acting role she has served at the public health agency in recent months.",
    "url": "https://www.cbsnews.com/news/susan-monarez-cdc-director-nominee-trump/"
  },
  {
    "text": "Russian-American businessman who loaned $8M to Trump Media in 2021-2022 sent $10.8M to firm that may link to Don Jr. and Eric Trump's new business partners  —  Last year The Guardian reported that Russian-American businessman Anton Postolnikov, the nephew of an ally of Russian President Vladimir Putin … ",
    "url": "https://newstracs.com/news-on-russian-american-financier-who-loaned-money-to-trump-media/2025/03/24/"
  },
  {
    "text": "SCOTUS Hears Latest Conservative Assault on the Voting Rights Act  —  The U.S. Supreme Court heard oral argument Monday in two Louisiana redistricting cases consolidated into one — Louisiana v. Callais and Robinson v. Callais — centered on the state's newly minted second majority-Black congressional district.",
    "url": "https://www.democracydocket.com/news-alerts/scotus-hears-latest-conservative-assault-on-the-voting-rights-act/"
  },
  {
    "text": "Trump cuts $3B from congressional deal he hated  —  The Scoop  —  President Donald Trump is cutting nearly $3 billion in spending, much of it reserved for foreign aid, by unwinding part of a 2023 fiscal deal loathed by conservatives, three senior White House officials told Semafor.",
    "url": "https://www.semafor.com/article/03/24/2025/trump-cuts-3b-in-emergency-spending-congress-approved"
  },
  {
    "text": "23andMe files for bankruptcy, Anne Wojcicki steps down as CEO … Embattled genetic testing company 23andMe, once valued at $6 billion, filed for Chapter 11 bankruptcy protection in Missouri federal court on Sunday night.  —  The company's CEO, Anne Wojcicki, has resigned from her role … ",
    "url": "https://www.cnbc.com/2025/03/24/23andme-files-for-bankruptcy-anne-wojcicki-steps-down-as-ceo.html"
  }
]