[
  {
    "text": "Poll: Biden's standing hits new lows amid Israel-Hamas war  —  Young voters are breaking from Biden, helping give Trump a narrow lead for the first time in NBC News polling, though the gap is within the margin of error.  —  President Joe Biden's approval rating has declined to the lowest level … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-bidens-standing-hits-new-lows-israel-hamas-war-rcna125251"
  },
  {
    "text": "Biden campaign works to ease Democratic anxiety over reelection chances  —  The president and his team are facing calls to become more active and aggressive in highlighting the contrast with his most likely opponent, Donald Trump  —  Over the last full weekend of September … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/19/biden-campaign-democrats-anxiety-trump/"
  },
  {
    "text": "Biden campaign facing heat over plans to deal with his age  —  Everyone recognizes there's an issue.  Not everyone thinks it's critical.  And there is no consensus on the best way to approach it.  —  At the Democratic National Committee's September fundraiser retreat … ",
    "url": "https://www.politico.com/news/2023/11/19/biden-biggest-vulnerability-00127937"
  },
  {
    "text": "Israel and Hamas reach tentative U.S.-brokered deal to pause conflict, free dozens of hostages  —  A five-day pause in fighting, monitored by aerial surveillance, could see dozens of women and children freed from captivity in Gaza, according to people familiar with the terms of the agreement",
    "url": "https://www.washingtonpost.com/national-security/2023/11/18/us-israel-hamas-reach-tentative-deal-pause-conflict-free-dozens-hostages/"
  },
  {
    "text": "Ron DeSantis refuses to condemn Elon Musk's endorsement of antisemitic conspiracy theory  —  WASHINGTON — 2024 Republican presidential hopeful and Florida Gov. Ron DeSantis refused on Sunday to condemn Elon Musk over his endorsement of an antisemitic conspiracy theory that falsely accused Jewish people … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/11/19/ron-desantis-elon-musk-antisemitism-2024-gop/71645125007/"
  },
  {
    "text": "Antisemitism was rising online.  Then Elon Musk's X supercharged it.  —  The Israel-Gaza war has raised tensions over what had already been a growing presence on the web.  —  In the weeks following the Oct. 7 Hamas attack on Israel, Twitter user @breakingbaht criticized leftists, academics and … ",
    "url": "https://www.washingtonpost.com/technology/2023/11/19/antisemiticism-interent-elon-musk-israwl-war/"
  },
  {
    "text": "Newsom ad targets DeSantis' six-week abortion ban  —  California Gov. Gavin Newsom (D) on Sunday released a new ad digging into Florida Gov. Ron DeSantis's (R) six-week ban on abortion as the two governors prepare to debate one another later this month.  —  The ad, released by Newsom … ",
    "url": "https://thehill.com/homenews/campaign/4317453-newsom-ad-targets-desantis-six-week-abortion-ban/"
  },
  {
    "text": "Newsom TV ad hits DeSantis on abortion as Fox debate looms  —  California's Democratic governor is airing a new ad in Florida and Washington criticizing his Florida Republican nemesis over his state's six-week abortion ban.  —  SAN FRANCISCO — California Gov. Gavin Newson is sending … ",
    "url": "https://www.politico.com/news/2023/11/19/newsom-desantis-tv-ad-debate-00127932"
  },
  {
    "text": "Tucker Carlson spreads antisemitic message in interview with Candace Owens  —  A handful of influential right-wing talk show hosts have spread antisemitic tropes to their millions of followers.  CNN's Oliver Darcy has the story.  —  Top business news  16 videos",
    "url": "https://www.cnn.com/videos/media/2023/11/18/antisemitism-right-wing-media-darcy-dnt-lead-vpx.cnn"
  },
  {
    "text": "I Read Mike Johnson's Legal Filings.  They Reveal a Distinctive Pattern.  —  The new speaker's view is “the First Amendment for me but not for thee.”  —  The newly elected speaker of the House of Representatives, J. Michael Johnson (R-La.), spent years as a practicing lawyer before his election … ",
    "url": "https://www.politico.com/news/magazine/2023/11/19/mike-johnson-legal-filings-00127832"
  },
  {
    "text": "A Jan. 6 Defendant Pleads His Case to the Son Who Turned Him In  —  The Capitol attacks ruptured their mutual trust.  In the weeks before Brian Mock's sentencing, could he mend the divide with his son A.J.?  —  By Eli SaslowPhotographs by Erin Schaff  —  The trial was over and the verdict was in … ",
    "url": "https://www.nytimes.com/2023/11/19/us/politics/jan-6-trial-father-son.html"
  },
  {
    "text": "Channels of Rage  —  On the vile and corrosive replacement myth, those who push it and why they do, and what it really replaces. … OK phew!  —  It was a busy but mostly fun couple weeks.  I'll tell you about it sometime maybe.  —  I'm back, just as I warned.  —  Where did we leave off?",
    "url": "https://armoxon.substack.com/p/channels-of-rage"
  },
  {
    "text": "In a swing Wisconsin county, everyone is tired of politics  —  DOOR COUNTY, Wis. — She didn't trust the government.  She didn't trust the news.  She didn't know whom to trust, so Kathy Nichols eased into the armchair facing her psychic.  —  “What comes up in my future?” she asked.",
    "url": "https://www.washingtonpost.com/nation/interactive/2023/wisconsin-door-county-voters-politics-fatigue/"
  },
  {
    "text": "Gov. Evers says ‘Neo-Nazis, antisemitism, and white supremacy have no home in Wisconsin’ after demonstration on state Capitol grounds  —  MADISON — A group of nearly two dozen people waving swastika flags and chanting antisemitic rhetoric marched on the Wisconsin state Capitol grounds Saturday afternoon … ",
    "url": "https://www.jsonline.com/story/news/politics/2023/11/18/neo-nazi-group-marches-on-state-capital/71636061007/"
  },
  {
    "text": "Militants believed to be Houthi rebels use helicopter to seize Japanese tanker in Red Sea  —  The attack off the coast of Yemen comes just days after the Houthis issued a graphic with captions in Hebrew, Arabic and English that said, “We will sink your ships.”",
    "url": "https://www.nbcnews.com/news/world/militants-believed-houthi-rebels-use-helicopter-seize-japanese-tanker-rcna125883"
  }
]