[
  {
    "text": "‘Exhausted,’ ‘bad episode’: Biden doubles down on debate explanations in ABC News exclusive  —  : Speaking with George Stephanopoulos, he dismissed concerns about mental fitness.  —  President Joe Biden speaks with George Stephanopoulus on July 5, 2024, in an ABC News exclusive.",
    "url": "https://abcnews.go.com/Politics/exhausted-bad-episode-biden-doubles-debate-explanations-abc/story?id=111695168"
  },
  {
    "text": "Healey, a top Biden ally, urges him to consider dropping out of the race  —  “The best way forward right now is a decision for the President to make,” she says.  —  BOSTON — One of Joe Biden's high-profile campaign surrogates is publicly urging him to consider exiting the presidential race.",
    "url": "https://www.politico.com/news/2024/07/05/maura-healey-biden-debate-consider-dropping-out-00166654"
  },
  {
    "text": "Democrats start moving to Harris as Biden digs in  —  Amid the ongoing fallout from Joe Biden's debate performance, talk in many top Democratic circles has already moved to who Kamala Harris' running mate would be.  —  That's how certain a widening group of leading party officials … ",
    "url": "https://www.cnn.com/2024/07/05/politics/kamala-harris-democrats-biden/"
  },
  {
    "text": "Donors pledge $2 million for ‘mini-primary’ if Biden drops out  —  A Democratic donor says he and others are seeking presidential debates among potential nominees if President Biden decides to step aside.  —  Bill Harris, a former chief executive of Intuit and PayPal, said he is leading … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/05/biden-replacement-mini-primary/"
  },
  {
    "text": "Sen. Mark Warner seeks to assemble group of Democratic senators to ask Biden to exit race  —  There's increasing sentiment among Democratic senators that Biden cannot stay in the race.  —  Sen. Mark R. Warner (D-Va.) is attempting to assemble a group of Democratic senators to ask Joe Biden … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/05/mark-warner-joe-biden-exit-race-democratic-senators/"
  },
  {
    "text": "Trump torches Heritage Foundation's Project 2025 … - Trump's disavowal comes two days after Heritage Foundation president Kevin Roberts drew outrage from Democrats with his comments about a “second American Revolution” on Steve Bannon's radio show.  — “[W]e are in the process … ",
    "url": "https://www.axios.com/2024/07/05/trump-project-2025-heritage-foundation"
  },
  {
    "text": "Donald Trump Claims Republicans' Project 2025 has Nothing to Do With Him: ‘Abysmal’  —  OK, SURE  —  The 900-page conservative wish-list includes a massive abortion crackdown.  Now Trump claims he knows nothing about it.  —  Donald Trump rushed to distance himself from the Republicans … ",
    "url": "https://www.thedailybeast.com/donald-trump-claims-republicans-project-2025-has-nothing-to-do-with-him-abysmal"
  },
  {
    "text": "MAGA ‘freak out’ starts as Trump game plan threatens to ‘backfire’: analyst  —  A controversial campaign tactic is backfiring on former President Donald Trump as powerful celebrities warn of a imminent authoritarian regime that could put an end to “recreational sex” as part of a “fascistic game plan … ",
    "url": "https://www.rawstory.com/trump-project-2025-2668691343/"
  },
  {
    "text": "A ‘scared’ Biden aide sounds an alarm  —  The Scoop  —  Midday on the Fourth of July, I received a call from a government official with regular access to the West Wing, who said they had reached a breaking point and wanted to sound the alarm.  —  The person insisted on careful ground rules … ",
    "url": "https://www.semafor.com/article/07/05/2024/a-scared-biden-aide-sounds-an-alarm"
  },
  {
    "text": "Biden staff “miserable,” alarmed as pressure builds … “Even if you're trying to focus on work, nothing is going to break through or get any acknowledgment” from bosses.  —  A high-ranking Democratic National Committee official told Axios: “The only thing that can really allay concerns … ",
    "url": "https://www.axios.com/2024/07/05/biden-staffs-white-house-dnc-campaign-miserable-2024"
  },
  {
    "text": "MAGA Gov Candidate's Ugly, Hateful Rant: “Some Folks Need Killing!”  —  Mark Robinson, the extremist GOP nominee for governor in North Carolina, appeared to endorse political violence in a bizarre and extended rant he delivered on June 30 in a small-town church.  —  “Some folks need killing!”",
    "url": "https://newrepublic.com/article/183443/mark-robinson-north-carolina-gov-candidate-hateful-rant-killing"
  },
  {
    "text": "Trump seeks new pause in classified documents case, citing Supreme Court's immunity ruling  —  Trump is trying to wield immunity as a shield in all of criminal cases.  —  Donald Trump says the Supreme Court's ruling that he has blanket immunity from prosecution for his “official acts” … ",
    "url": "https://www.politico.com/news/2024/07/05/trump-immunity-classified-documents-00166653"
  },
  {
    "text": "Kansas Supreme Court Strikes Down Two Anti-Abortion Laws  —  The pair of 5-1 decisions suggests that other abortion restrictions — even ones decades on the books — might not withstand legal challenges.  —  LOADING  —  Kansas' highest court strongly reaffirmed Friday … ",
    "url": "https://www.huffpost.com/entry/kansas-abortion-laws-supreme-court_n_66882b22e4b0c732b46232fb"
  },
  {
    "text": "Trump's Far-Right Army Is Threatening Bloodshed.  Believe Them.  —  We must not only resist, but prevail.  If we do not, it will be nearly impossible to reverse the course that America's right-wing billionaires have set us on.  —  Kevin Roberts, who heads the Heritage Foundation … ",
    "url": "https://www.commondreams.org/opinion/far-right-violence-trump-supporters"
  },
  {
    "text": "Boxer Who Showed off to Donald and Barron Trump Banned for Racist Rant  —  KNOCKOUT BLOW  —  Ryan Garcia shadow boxed in front of the ex-president and son Barron at Mar-a-Lago but is now banned from his sport.  —  A top-ranked prize fighter who put on a shadow boxing display … ",
    "url": "https://www.thedailybeast.com/boxer-ryan-garcia-who-showed-off-to-donald-and-barron-trump-banned-for-racist-rant"
  },
  {
    "text": "‘Investigate!’  Outrage as MAGA candidate accused of misdeeds at dangerous daycare he ran  —  North Carolina Lt. Gov. Mark Robinson, currently running for governor on a far-right MAGA platform, came under fire today for his proclamation endorsing political violence.",
    "url": "https://www.rawstory.com/trump-mark-robinson-dangerous-daycare/"
  }
]