[
  {
    "text": "Behind the Curtain: Kamala Harris' epic edge … - Rep. Bennie Thompson (D-Miss.), who chaired the House Jan. 6 committee, told Axios' Hans Nichols that Harris is “incredibly strong ... You can't say Biden has done a good job without saying she's done a good job.” … Of course, all this may take a while.",
    "url": "https://www.axios.com/2024/07/04/kamala-harris-replace-biden-2024-election"
  },
  {
    "text": "Trump Caught on Video Claiming ‘Broken-Down’ Biden Has Quit: 'It's Kamala'  —  ‘SO F***ING BAD’  —  In a leaked video, Trump offers a frank analysis of his rival's performance in the first presidential debate, calling Biden a “broken-down pile of cr*p.”  —  Donald Trump delivered … ",
    "url": "https://www.thedailybeast.com/donald-trump-caught-on-video-claiming-broken-down-joe-biden-has-quit-its-kamala"
  },
  {
    "text": "Biden tells governors he got a medical checkup  —  Two governors also expressed concern over whether the president could still carry their blue-leaning states.  —  President Joe Biden on Wednesday evening told more than 20 Democratic governors in a private meeting that he underwent … ",
    "url": "https://www.politico.com/news/2024/07/03/biden-tells-governors-he-got-a-medical-check-up-00166579"
  },
  {
    "text": "Playbook: Biden goes from bunker to blitz  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  JULY FOURTH READING — “The partisan gap in views of American greatness,” by WaPo's Philip Bump: “Democrats are more proud of the U.S. Republicans are more likely … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/04/biden-goes-from-bunker-to-blitz-00166585"
  },
  {
    "text": "The Supreme Court Has Murdered the Constitution  —  America's founding document is now an all-but-meaningless scrap of paper.  Happy Fourth!  —  Chief Justice John Roberts is seen before the State of the Union address to a joint session of Congress at the Capitol on March 7, 2024.",
    "url": "https://prospect.org/justice/2024-07-04-supreme-court-roberts-murdered-constitution/"
  },
  {
    "text": "State of Tennessee tells U.S. Navy veteran he's not an American citizen and cancels his driver's license  —  NASHVILLE, Tenn. (WTVF) — As we celebrate the nation's birthday and what it means to be an American, a U.S. Navy veteran who has lived in the U.S. for more than seven decades … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/state-of-tennessee-tells-u-s-navy-veteran-hes-not-an-american-citizen-and-cancels-his-drivers-license"
  },
  {
    "text": "Strongman, Weak State  —  The dispiriting vision of American governance offered by the Roberts Court  —  The hinges of history, the moments that determine the shape of our world, are usually only obvious in retrospect.  Sometimes, dramatic political events, like assassinations, announce their own importance.",
    "url": "https://donmoynihan.substack.com/p/strongman-weak-state"
  },
  {
    "text": "There Is Apparently No Accountability — Ever — for Donald Trump  —  We tell children — or at least we used to — that actions have consequences.  What goes around comes around.  Watch your behavior.  You'll answer for it someday.  —  Donald Trump is the living, lying contradiction of that.",
    "url": "https://www.nytimes.com/2024/07/04/opinion/donald-trump-immunity.html"
  },
  {
    "text": "Trump's New Racist Insult  —  The former president's recent attack on Senator Chuck Schumer is like an Everlasting Gobstopper of offense, with new layers emerging one after another.  —  Weird things happen on the debate stage—just ask Joe Biden.  So when Donald Trump used Palestinian … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-racist-insult-palestinian-schumer/678902/"
  },
  {
    "text": "The untold story of the most chaotic Nato summit ever  —  Told by the people who witnessed the 2018 Trump show first hand  —  Donald Trump was going to pull out of Nato.  As the president's motorcade powered through the early morning light of July 12 2018, bound for a summit … ",
    "url": "https://www.ft.com/content/8985b970-0015-479f-9585-7a9b234715a4"
  },
  {
    "text": "Le Pen Set to Fall Short of French Majority, Polling Shows  — Far right and allies seen winning 210-240 seats, Ifop says  — Voters head to polling stations for second round on Sunday  —  Marine Le Pen's National Rally is set to fall well short of an absolute majority … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-04/le-pen-set-to-fall-short-of-majority-in-france-polling-shows"
  },
  {
    "text": "“Bloodless if the left allows it to be”  —  A week ago, I started my post to you with some comments made by Kevin Roberts, the head of the Heritage Foundation and architect of Project 2025, when he learned Democrats were making plans to take on Project 2025.",
    "url": "https://joycevance.substack.com/p/bloodless-if-the-left-allows-it-to"
  },
  {
    "text": "Ex-DOJ prosecutor: Trump could sell pardons for ‘a million bucks a pop’ — thanks to SCOTUS  —  When the U.S. Supreme Court issued its controversial 6-3 immunity ruling in Trump v. the United States, Justice Sonia Sotomayor's scathing dissent laid out a variety of possible abuses that she fears.",
    "url": "https://www.alternet.org/news-politics/scotus-trump-pardons/"
  },
  {
    "text": "The partisan gap in views of American greatness  —  Democrats are more proud of the U.S. Republicans are more likely to view it as the greatest country on Earth.  —  America, we are often told, is less a country than an idea.  That idea can be nebulous in its formulation, but it generally centers on opportunity and around freedom.",
    "url": "https://www.washingtonpost.com/politics/2024/07/04/republicans-democrats-america-polling/"
  },
  {
    "text": "Portugal plans to reintroduce tax breaks for foreign residents  —  The Portuguese government is planning to reintroduce tax breaks for foreign residents in an effort to attract skilled workers despite criticism in the past that the scheme stoked housing prices, the economy minister said on Thursday.",
    "url": "https://www.reuters.com/world/europe/portugal-plans-reintroduce-tax-breaks-foreign-residents-2024-07-04/"
  }
]