[
  {
    "text": "How Harris Has Completely Upended the Presidential Race, in 14 Maps  —  With Kamala Harris now at the top of the ticket, the enthusiasm and confidence within the Democratic Party feel stronger than at any point I've seen since Barack Obama ran for president in 2008.",
    "url": "https://www.nytimes.com/interactive/2024/08/16/opinion/harris-trump-electoral-college-map.html?unlocked_article_code=1.DU4.8g43.y4Py7KogJAVh&smid=url-share"
  },
  {
    "text": "On a Scrambled 2024 Map, North Carolina Democrats Say Harris Has a Shot  —  As Kamala Harris visits to unroll her economic agenda, Democrats in the state are feeling hopeful.  Working against her is over four decades of Republican victories, interrupted only by Barack Obama.",
    "url": "https://www.nytimes.com/2024/08/16/us/politics/kamala-harris-north-carolina.html"
  },
  {
    "text": "Kamala Harris unveils populist policy agenda, with $6,000 credit for newborns  —  The vice president endorses government action on housing, groceries, medical debt, drugs and other issues.  —  Vice President Kamala Harris on Friday unveiled an aggressively populist economic agenda … ",
    "url": "https://www.washingtonpost.com/business/2024/08/16/kamala-harris-2024-policy-child-tax-credit/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MTYzMTk5LCJpYXQiOjE3MjM3ODA4MDAsImp0aSI6ImIwOGVkYmUxLWI1M2EtNGQ2Yi04MGNlLWQ3ZDVkMjc0YmQ4MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzA4LzE2L2thbWFsYS1oYXJyaXMtMjAyNC1wb2xpY3ktY2hpbGQtdGF4LWNyZWRpdC8ifQ.bc3_5kWepKED7-eQhF5M7miIJDXGbng1J-AQqoVNtM8&itid=gfta"
  },
  {
    "text": "JD Vance Officially Has a Lower Favorability Rating Than Sarah Palin  —  LOW BLOW  —  Ohio Sen. JD Vance is now the most unpopular vice presidential nominee in modern history—soaring past former Alaska Gov. Sarah Palin's unfavorability ratings during the 2008 campaign.",
    "url": "https://www.thedailybeast.com/jd-vance-has-lower-favorability-rating-than-sarah-palin-and-tim-kaine-polls-say"
  },
  {
    "text": "Americans' first impressions of Walz are positive, negative for Vance  —  Washington Post-ABC-Ipsos poll finds more Americans like Walz than Vance  —  Minnesota Gov. Tim Walz has made a positive first impression after Vice President Kamala Harris announced him as her running mate.",
    "url": "https://www.washingtonpost.com/politics/2024/08/16/vance-walz-post-poll/"
  },
  {
    "text": "Trump Warns That if Kamala Harris Wins, ‘Everybody Gets Health Care’  —  Donald Trump repeatedly lies about single-payer health care — an idea he and Harris both previously supported but no longer do … Vice President Kamala Harris did, too.  Neither candidate backs the idea now.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-kamala-harris-wins-everybody-gets-health-care-1235081328/"
  },
  {
    "text": "Trump to resume outdoor rallies with bulletproof glass  —  The U.S. Secret Service is arranging for former President Donald Trump to resume outdoor campaign rallies a month after a gunman targeted him at a rally in Pennsylvania.  —  The Secret Service plans to surround Trump's podium with bulletproof glass … ",
    "url": "https://www.cbsnews.com/news/trump-resume-outdoor-rallies-bulletproof-glass/"
  },
  {
    "text": "Harris brings her ad blitz to Fox News … - The Harris campaign on Wednesday began running four spots on the network, a Fox News spokesperson confirmed to Axios.  — The ads are largely positive about Harris' life, a sharp contrast with the network's often-critical programming about her.",
    "url": "https://www.axios.com/2024/08/16/kamala-harris-fox-news-ads"
  },
  {
    "text": "A Trump official criticized the media for talking “about Project 2025, which has nothing to do with our campaign.”  She worked on Project 2025.  —  During a recent interview, Trump National Press Secretary Karoline Leavitt criticized the media for talking “about Project 2025, which has nothing to do with our campaign.”",
    "url": "https://www.mediamatters.org/project-2025/trump-official-karoline-leavitt-criticized-media-talking-about-project-2025-which-has"
  },
  {
    "text": "When your opponent calls you ‘communist,’ maybe don't propose price controls?  —  It's hard to exaggerate how bad Kamala Harris's price-gouging proposal is.  —  “Price gouging” is the focus of Vice President Kamala Harris's economic agenda, her presidential campaign says.",
    "url": "https://www.washingtonpost.com/opinions/2024/08/15/kamala-harris-price-gouging-groceries/"
  },
  {
    "text": "Behind the Curtain: Trump's “caught on tape” women problem … - A Quinnipiac Poll out this week found a gender gulf among likely voters in the critical swing state of Pennsylvania: Women backed Harris 54% to 41%, while men went for Trump, 49% to 42%.",
    "url": "https://www.axios.com/2024/08/16/trump-vance-women-problem-voters"
  },
  {
    "text": "Trump says presidential civilian award is ‘better’ than top military honor whose recipients are ‘dead’ or ‘hit’ by bullets  —  Trump praised Republican donor Miriam Adelson for having received the Presidential Medal of Freedom, a top civilian award.  —  BEDMINSTER, N.J. … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-presidential-civilian-award-better-top-military-honor-whose-rcna166855"
  },
  {
    "text": "Trump VP pick JD Vance is seen posing with three female classmates at boys' urinals in unearthed high school photo  — 18-year-old JD Vance was snapped posing with three girls in the boys' bathroom  — The photo appeared in the 2003 yearbook of Middletown High School in Ohio",
    "url": "https://www.dailymail.co.uk/news/article-13742781/JD-Vance-posing-female-classmates-urinals-photo.html"
  },
  {
    "text": "FBI raids Rappahannock County property  —  Federal agents descended on a Huntly property Tuesday and have maintained a steady presence there since.  —  “The FBI conducted court-authorized law enforcement activity.  We have no further comment as this is an ongoing matter,” … ",
    "url": "https://www.rappnews.com/news/crime/fbi-raids-rappahannock-county-property/article_6e1a2c48-5b34-11ef-9e3a-aff26918eef9.html"
  },
  {
    "text": "Tim Walz's remarkably courageous stand for LGBT youth  —  Walz supported gay kids at a time when most Democrats did not. … In Boston on Wednesday, Democratic vice presidential candidate Tim Walz talked about his desire to engage with young voters without resorting to fear.",
    "url": "https://www.publicnotice.co/p/tim-walz-gay-straight-alliance-mankato"
  },
  {
    "text": "FACT FOCUS: Trump blends falsehoods and exaggerations at rambling NJ press conference  —  Former President Donald Trump on Thursday gave his second news conference in as many weeks as he adjusts to a newly energized Democratic ticket ahead of next week's Democratic National Convention.",
    "url": "https://apnews.com/article/trump-press-conference-new-jersey-misinformation-fact-check-f8ed52f64a12cf450b0d0f2591c9d92b"
  },
  {
    "text": "Trump Made $300,000 for Endorsing Bible, Financial Disclosure Shows  —  Donald J. Trump also listed $100 million in liabilities over judgments he owes in civil cases, and over $1 million in crypto holdings as he courts the industry for his campaign.  —  Donald J. Trump's latest financial disclosure lists … ",
    "url": "https://www.nytimes.com/2024/08/15/us/politics/trump-financial-disclosure-bibles-liabilities.html"
  },
  {
    "text": "New College of Florida tosses hundreds of library books, empties gender diversity library  —  Hundreds of New College of Florida library books, including many on LGBTQ+ topics and religious studies, are headed to a landfill.  —  A dumpster in the parking lot of Jane Bancroft Cook Library … ",
    "url": "https://www.heraldtribune.com/story/news/education/2024/08/15/new-college-of-florida-throws-away-hundreds-of-library-books-diversity-lgbtq/74814756007/"
  },
  {
    "text": "Democratic fundraising spooks House Republicans … - NRCC Chairman Richard Hudson (R-N.C.) said on a Thursday conference call that the GOP faces a new reality, but they still have a path to picking up seats, a source on the call told Axios.  — Speaker Mike Johnson (R-La.) … ",
    "url": "https://www.axios.com/2024/08/16/house-republicans-harris-democrats-fundraising"
  },
  {
    "text": "Man Arrested for Explosives Threats and Attack on Energy Facility  —  For Immediate Release  —  U.S. Attorney's Office, Middle District of Florida  —  Orlando, Florida - United States Attorney Roger B. Handberg announces the return of an indictment charging Hashem Younis Hashem Hnaihen … ",
    "url": "https://www.justice.gov/usao-mdfl/pr/jordanian-national-indicted-explosives-threats-and-attack-energy-facility"
  }
]