[
  {
    "text": "Trump kicks off a Pennsylvania rally by talking about Arnold Palmer's genitalia  —  Donald Trump's campaign suggested he would begin previewing his closing argument Saturday night with Election Day barely two weeks away.  But the former president kicked off his rally with a detailed story … ",
    "url": "https://apnews.com/article/trump-arnold-palmer-closing-arguments-latrobe-pennsylvania-2bea9620c523e531a55259200215284e"
  },
  {
    "text": "Mike Johnson Doesn't Want to Hear About Trump Discussing Arnold Palmer's Manhood  —  “Don't say it again.  We don't have to say it.  I get it,” the House speaker said testily when asked about the comments  —  House Speaker Mike Johnson doesn't want to hear about Arnold Palmer's johnson.",
    "url": "https://www.rollingstone.com/politics/politics-news/mike-johnson-trump-arnold-palmer-manhood-1235138445/"
  },
  {
    "text": "Trump calls Harris a ‘s— vice president’ and mentions Arnold Palmer's genitals in bizarre rally  —  Harris on Saturday ripped Trump for meandering in his public remarks, saying that the former president “generally for the life of him cannot finish a thought.”",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-calls-harris-s-president-personal-attacks-escalate-rcna176259"
  },
  {
    "text": "The Very Real Scenario Where Trump Loses and Takes Power Anyway  —  If Trump overturns the 2024 election, here's how it could happen.  —  Four years ago, a sitting president — rejected by American voters — attempted to seize a second term anyway, plunging the nation into confusion, conflict and, in its last gasp, violence.",
    "url": "https://www.politico.com/news/magazine/2024/10/20/trump-overturn-2024-election-plan-00184103"
  },
  {
    "text": "Pennsylvania Gov. Shapiro: Law enforcement should ‘take a look at’ Elon Musk voter payments  —  On Saturday, Musk announced that he would pay registered voters $1 million per day until Election Day to sign a petition circulated by his super PAC.  —  Pennsylvania Gov. Josh Shapiro on Sunday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/pennsylvania-gov-shapiro-law-enforcement-take-look-elon-musk-voter-pay-rcna176279"
  },
  {
    "text": "Elon Musk Veers Into Clearly Illegal Vote Buying, Offering $1 Million Per Day Lottery Prize Only to Registered Voters  —  Hugo Lowell: “Elon Musk says on stage at a town hall that America PAC will be awarding $1 million every day until the election to a registered Pennsylvania voter who has signed his petition.",
    "url": "https://electionlawblog.org/?p=146397"
  },
  {
    "text": "Trump had little regard for the Constitution while in office.  He's an even bigger threat to the rule of law now.  —  Trump had little regard for the Constitution while in office.  He's an even bigger threat to the rule of law now.  Because of the Supreme Court's ill-conceived presidential immunity ruling … ",
    "url": "https://www.inquirer.com/opinion/editorials/inq2/trump-threat-putin-manchurian-candidate-rule-law-20241020.html#loaded"
  },
  {
    "text": "Trump Media Whistleblower Blasts Company for Outsourcing Jobs Abroad as Betrayal of “America First”  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  An internal whistleblower complaint … ",
    "url": "https://www.propublica.org/article/trump-media-whistleblower-complaint-devin-nunes"
  },
  {
    "text": "At least 7 dead in Georgia dock collapse on US Atlantic coast  —  At least seven people were killed after part of a boat dock collapsed, sending at least 20 into the Atlantic waters off the coast of the U.S. state of Georgia.  —  U.S. Coast Guard ships were searching Saturday night for missing people.",
    "url": "https://www.reuters.com/world/us/least-7-dead-georgia-dock-collapse-us-atlantic-coast-2024-10-20/"
  },
  {
    "text": "This HAS To Be Normal  —  Nazism is on the ballot this year, and people who consider themselves Nazis know it, even if so many of the rest of us seem not to want to.  So it came to pass that Nazis came to the pro-Trump boat show in Jupiter Florida last week.",
    "url": "https://www.the-reframe.com/this-has-to-be-normal/"
  },
  {
    "text": "VOICES: One vote for Sherrod Brown  —  I have always run for office under the banner of the Republican Party, am a conservative and usually vote a straight Republican ticket.  Although still a Republican, I will be making an exception this year in Ohio's U.S. Senate race by supporting Sherrod Brown.",
    "url": "https://www.daytondailynews.com/ideas-voices/voices-one-vote-for-sherrod-brown/FCBQW3SBFVCFXBRJK5LWTMN4SA/"
  },
  {
    "text": "The CIA analyst who triggered Trump's first impeachment asks: Was it worth it?  —  The whistleblower's lonely stand upended his career and put his life at risk.  Now he's speaking about it for the first time.  —  The young CIA analyst waited anxiously for Fiona Hill to pick up her phone.",
    "url": "https://www.washingtonpost.com/politics/2024/10/20/cia-analyst-whistleblower-trump-impeachment-ukraine/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5Mzk2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwNzgyNzk5LCJpYXQiOjE3MjkzOTY4MDAsImp0aSI6IjM5NmZmZDc2LTA5NDctNDhmOC1iYzAwLTIyOGEyNmY4ZTYyNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzIwL2NpYS1hbmFseXN0LXdoaXN0bGVibG93ZXItdHJ1bXAtaW1wZWFjaG1lbnQtdWtyYWluZS8ifQ.qhC77t1wZ4UCKBXFk9K-Wy_bKNAT-Spp-SxUKteiN5s&itid=gfta"
  },
  {
    "text": "Harris says Trump is ‘cruel’ at Georgia rally as she spotlights abortion restrictions  —  ATLANTA — Vice President Kamala Harris said Saturday that Republican former President Donald Trump was “cruel” for how he talked about the grieving family of a Georgia mother who died after waiting 20 hours … ",
    "url": "https://www.npr.org/2024/10/20/g-s1-29102/harris-says-trump-is-cruel-at-georgia-rally-as-she-spotlights-abortion-restrictions"
  },
  {
    "text": "Who's Mailing the Catholic Tribune?  It's Not the Church, It's Partisan Media.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.",
    "url": "https://www.propublica.org/article/church-no-affiliation-catholic-tribune-metric-media"
  },
  {
    "text": "Sen. Lindsey Graham to Republicans supporting Harris: ‘What the hell are you doing?’  —  The senator on Sunday blasted those in the GOP who are backing the Vice President's campaign, saying “You're supporting the most radical nominee in the history of American politics.”",
    "url": "https://www.nbcnews.com/politics/2024-election/lindsey-graham-republicans-supporting-harris-hell-are-you-doing-rcna176277"
  },
  {
    "text": "How to Read the Immunity Appendix  —  I'm still working through a deeper dive of the appendix to his immunity brief that Jack Smith released on Friday.  —  But I thought I'd share how I'm reading it, as I'll need to refer back to that when I write up some of the interesting things I've found.",
    "url": "https://www.emptywheel.net/2024/10/20/how-to-read-the-immunity-appendix/"
  },
  {
    "text": "'It's real': Kamala Harris appears to say Israel committing genocide in Gaza  —  “Listen, what he's talking about, it's real.  It's real.  That's not the subject that I came to discuss today, but it's real, and I respect his voice.”  —  US presidential candidate Kamala Harris appeared … ",
    "url": "https://www.jpost.com/diaspora/article-825264"
  }
]