[
  {
    "text": "Court hears arguments on whether Steve Bannon should be begin prison sentence  —  The former Trump adviser was sentenced to four months in prison for refusing to comply with Jan. 6 Committee subpoenas, but it had been put on hold while he appealed.  —  WASHINGTON — A federal judge … ",
    "url": "https://www.nbcnews.com/politics/justice-department/court-hears-arguments-whether-steve-bannon-begin-prison-sentence-rcna155209"
  },
  {
    "text": "Former Trump aide Steve Bannon ordered to jail by July 1 to serve contempt of Congress sentence … A federal judge in Washington, D.C., at a hearing Thursday ordered former Trump White House aide Steve Bannon to report to jail by July 1 to begin serving a four-month sentence for his criminal contempt of Congress conviction.",
    "url": "https://www.cnbc.com/2024/06/06/steve-bannon-ordered-to-jail-bail-revoked.html"
  },
  {
    "text": "Exclusive: Biden tells Muir he wouldn't pardon son Hunter, says Trump got ‘fair trial’  —  Biden is in Normandy commemorating the 80th anniversary of D-Day.  —  ABC News' David Muir sat down exclusively with President Joe Biden in Normandy, France, on the 80th anniversary of D-Day on June 6, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-tells-muir-wouldnt-pardon-son-hunter/story?id=110904482"
  },
  {
    "text": "Biden says he wouldn't pardon son in felony gun case in Delaware  —  The White House press secretary has said previously the president would not pardon his son, Hunter Biden.  —  President Biden said Thursday he would not pardon his son, Hunter Biden, if he is convicted in his felony gun trial in Delaware.",
    "url": "https://www.washingtonpost.com/politics/2024/06/06/joe-biden-hunter-not-pardon/"
  },
  {
    "text": "Biden's D-Day Speech Nailed the Threat of Modern Fascism  —  80 YEARS ON  —  Speaking on sacred ground in Normandy, the president correctly drew parallels between America's enemies in World War II and the threats we face domestically and globally today.",
    "url": "https://www.thedailybeast.com/bidens-d-day-speech-nailed-the-threat-of-modern-fascism"
  },
  {
    "text": "Tesla CEO Elon Musk could leave if $56 billion pay package not approved, shareholders warned … Tesla board chair Robyn Denholm is calling on the company's shareholders to approve Elon Musk's massive $56 billion pay package or risk driving the billionaire CEO to greener pastures.",
    "url": "https://www.theverge.com/2024/6/6/24173064/tesla-board-chair-warn-elon-musk-leave-pay-shareholders"
  },
  {
    "text": "Several Pa. House Republicans boo officers who defended Capitol on Jan. 6  —  Harry Dunn and Aquilino Gonell were invited to Pennsylvania's House of Representatives — but several GOP lawmakers booed and some walked out, Democratic lawmakers said.  —  Two former law enforcement officers … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/06/pennsylvania-house-republicans-capitol-walkout/"
  },
  {
    "text": "DeSantis high court majority: DeSantis can easily oust people's elected prosecutors  —  On a 6-1 vote Thursday, the Florida Supreme Court gave its governor all-but-unfettered power to remove locally elected prosecutors — a power that could quickly render Floridians' “freedom” to “vote” … ",
    "url": "https://www.lawdork.com/p/desantis-worrell-florida-supreme-court"
  },
  {
    "text": "YouTuber's Wacko Lamborghini Stunt Ends in Federal Charges  —  FROM CLICKS TO CLINK  —  He took aim at a $300,000 Italian supercar from a helicopter with an arsenal of fireworks onboard.  —  What's more American than celebrating July 4 by taking aim at a $300,000 Italian supercar … ",
    "url": "https://www.thedailybeast.com/youtuber-alex-chois-wacko-lamborghini-stunt-ends-in-federal-charges"
  },
  {
    "text": "The Myth That Biden Had Nothing to Do with the Prosecutions of Trump … The five criminal and civil prosecutions of Donald Trump all prompt heated denials from Democrats that President Biden and Democrat operatives had a role in any of them.  —  But Joe Biden has long let it be known … ",
    "url": "https://amgreatness.com/2024/06/06/the-myth-that-biden-had-nothing-to-do-with-the-prosecutions-of-trump/"
  },
  {
    "text": "Going Retrograde  —  Today was an important day to be paying attention.  In many ways, we seem to be going backward.  Only our votes can ultimately change that.  —  Senate Republicans blocked a measure that would have created a federal right to contraception access today.",
    "url": "https://joycevance.substack.com/p/going-retrograde"
  },
  {
    "text": "Alito's former neighbor says justice is ‘at best mistaken’ in flap over upside-down US flag  —  A former neighbor of Supreme Court Justice Samuel Alito on Wednesday disputed his account of a neighborhood spat that led to the hoisting of an upside-down US flag on his property in Virginia … ",
    "url": "https://www.cnn.com/2024/06/05/politics/alito-former-neighbor-flags-cnntv/"
  },
  {
    "text": "The Billionaires Have Captured Donald Trump  —  One of the most enduring—and ridiculous—#Resistance narratives of the Trump era was the idea that the president of the United States was a literal Manchurian Candidate, a man who had been compromised for years (perhaps even decades) by a foreign power, namely Russia.",
    "url": "https://newrepublic.com/article/182300/donald-trump-compromised-billionaires-selling-presidency"
  },
  {
    "text": "Exclusive: Cows infected with bird flu have died in five US states  —  Dairy cows infected with avian flu in five U.S. states have died or been slaughtered by farmers because they did not recover, state officials and academics told Reuters.  —  Reports of the deaths suggest the bird flu outbreak … ",
    "url": "https://www.reuters.com/world/us/cows-infected-with-bird-flu-have-died-five-us-states-2024-06-06/"
  },
  {
    "text": "Israeli Prime Minister Benjamin Netanyahu to address Congress on July 24  —  Washington — Israeli Prime Minister Benjamin Netanyahu will address a joint meeting of Congress on July 24, multiple sources told CBS News.  —  The top four leaders of the House and Senate formally invited Netanyahu last week … ",
    "url": "https://www.cbsnews.com/news/netanyahu-congress-address-july-24/"
  },
  {
    "text": "Hunter Biden trial live updates: Hallie Biden testifies about drug addictions that rocked the Biden family  —  She said she started using drugs after Hunter Biden introduced them to her and that he was sometimes in denial about his addiction.  She also testified about finding his gun in his car.",
    "url": "https://www.nbcnews.com/politics/politics-news/live-blog/hunter-biden-trial-live-updates-rcna155733"
  },
  {
    "text": "Progressives Urge Biden to Push Harder on ‘Greedflation’  —  It's a moniker about corporate price increases that has bolstered some Democratic senators, and now the president is being encouraged to lean in on the issue for his economic messaging.  —  As high prices at grocery stores … ",
    "url": "https://www.nytimes.com/2024/06/06/us/politics/biden-inflation-greedflation-economy.html"
  },
  {
    "text": "Scoop: Justice Brett Kavanaugh plans legal memoir … - Kavanaugh originally signed a contract with Regnery Publishing, a leading conservative house.  — But after Regnery was sold to Skyhorse Publishing in December, the project moved to the Center Street imprint at Hachette Book Group.",
    "url": "https://www.axios.com/2024/06/06/scotus-brett-kavanaugh-writing-book-memoir"
  },
  {
    "text": "'It's Really Shameful': House Republicans Accuse Rep. Troy Nehls of Stolen Valor Over Military Award Pin … House Republicans are accusing Rep. Troy Nehls of “stolen valor” for continuing to wear a lapel pin for infantrymen or Special Forces who fought in active combat.  —  “It matters.",
    "url": "https://www.notus.org/congress/troy-nehls-combat-infantry-badge-pin-revoked"
  },
  {
    "text": "Milwaukee-based retail giant Kohl's says ‘No’ to sponsoring Republican convention events … Milwaukee based department store giant Kohl's says it will not sponsor any events related to the Republican National Convention in that city this summer, where Donald Trump will be crowned the party's nominee for president.",
    "url": "https://www.cnbc.com/2024/06/06/kohls-donation-trump-republican-national-convention.html"
  },
  {
    "text": "Multiple Hospitalized At Trump Rally Due To Extreme Heat Wave  —  At least 11 people in Phoenix were hospitalized with heat exhaustion, officials said.  —  LOADING  —  Eleven people have been hospitalized while waiting for a rally featuring Donald Thursday in Phoenix … ",
    "url": "https://www.huffpost.com/entry/trump-rally-phoenix-heat-wave_n_66623130e4b0f9f6da80881d"
  },
  {
    "text": "Florida Supreme Court backs Ron DeSantis on removal of Soros-backed prosecutor  —  DeSantis accused State Attorney Monique Worrel of ‘dereliction of duty’  —  Join Fox News for access to this content  —  The Florida Supreme Court ruled in favor of Florida Gov. Ron DeSantis' decision to remove a Soros-backed prosecutor on Thursday.",
    "url": "https://www.foxnews.com/politics/florida-supreme-court-backs-ron-desantis-removal-soros-backed-prosecutor"
  },
  {
    "text": "Progressive Caucus rescinds endorsement of former Rep. Mondaire Jones  —  The Congressional Progressive Caucus PAC unendorsed one of its former members after the New York Democrat backed a primary rival to another progressive lawmaker.  —  WASHINGTON — The Congressional Progressive Caucus PAC … ",
    "url": "https://www.nbcnews.com/politics/2024-election/progressive-caucus-rescinds-endorsement-former-rep-mondaire-jones-rcna155754?taid=6661dd57acd5750001e05bec"
  },
  {
    "text": "Trump search for a VP candidate narrows, with senators dominating list  —  At least eight people have been asked to provide documents to the campaign.  —  Donald Trump's search for a vice-presidential running mate has reached a more intensive phase, with his campaign requesting documents … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/06/trump-vice-president-list/"
  },
  {
    "text": "Trump Can't Carry a Gun, but He Might Have the Nuclear Codes Again  —  FEDERALISM FOLLIES  —  Donald Trump's losing his NYC concealed carry permit, an emblematic example of the wackiness of the American system. … Donald Trump's license to carry a gun is about to be revoked … ",
    "url": "https://www.thedailybeast.com/trump-cant-carry-a-gun-but-he-might-have-the-nuclear-codes-again"
  }
]