[
  {
    "text": "The Self-Immolation of the AZ GOP  —  Inflation is still running a little hot, according to the Department of Labor.  Overall inflation was at 3.5 percent year-over-year, with more stable “core” inflation at 3.8 percent.  While it's moving in the right direction, it's not returning … ",
    "url": "https://www.thebulwark.com/p/the-self-immolation-of-the-az-gop"
  },
  {
    "text": "Abortion ruling is a full-on disaster for Arizona Republicans  —  Opinion: With the return of an 1864 abortion ban, Republicans now face a five-alarm fire that could consume their grip on Arizona.  If you are Trump or Kari Lake, you are freaking out right now.",
    "url": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2024/04/09/abortion-ruling-disaster-arizona-republicans/73263944007/"
  },
  {
    "text": "‘Shame!  Shame!’:  Arizona Republican leaders block effort to repeal abortion ban  —  Democrats stymied after state supreme court rules that 1864 law with no exceptions for rape or incest can go into effect  —  Arizona's state Republican leadership halted an effort by Democrats on Wednesday … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/10/arizona-republicans-block-repeal-state-abortion-ban"
  },
  {
    "text": "Arizona Republicans condemn their own abortion policy  —  On Tuesday, the Arizona Supreme Court issued a bombshell decision banning virtually all abortions in the state.  The majority found that since the Supreme Court overturned Roe v. Wade, a near-total ban from 1864 — before Arizona was a state — was back in effect.",
    "url": "https://popular.info/p/arizona-republicans-condemn-their"
  },
  {
    "text": "Matt Gaetz Is Winning … Usually, you need about 10 minutes to walk from the Rayburn House Office Building to the House Chamber.  But if you're running from a reporter, it'll only take you five.  —  When Matt Gaetz spotted me outside his office door one afternoon early last November … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/matt-gaetz-house-republican-congress-profile/677915/"
  },
  {
    "text": "Playbook: Why Trump is Johnson's best friend right now  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  JUST POSTED — “Matt Gaetz Is Winning,” by The Atlantic's Elaine Godfrey: Rep. MATT GAETZ (R-Fla.) “is a creature of our time: versed in the art … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/11/why-trump-is-johnsons-best-friend-right-now-00151686"
  },
  {
    "text": "US will require background checks for gun shows and online firearm sales  —  ‘Historic’ action by justice department closes ‘doggone dangerous’ loophole in Biden administration's fight against gun violence  —  The sale of firearms on the internet and at gun shows in the US will in future … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/11/gun-show-internet-sale-mandatory-background-check"
  },
  {
    "text": "Biden Administration Approves Expansion of Background Checks on Gun Sales  —  The new rule, which is likely to face legal challenges, is an attempt to regulate a fast-growing shadow market of weapons that has fueled gun violence.  —  The Biden administration has approved the broadest expansion … ",
    "url": "https://www.nytimes.com/2024/04/11/us/politics/biden-guns-background-checks.html"
  },
  {
    "text": "Florida 2024 Poll: Plurality Plan to Vote “Yes” on Abortion Protection Ballot Measure  —  A new Emerson College Polling survey in Florida finds 42% of voters plan to vote yes on the November ballot measure that will provide a constitutional right to abortion before fetal viability, 32% are unsure, and 25% will vote no.",
    "url": "https://emersoncollegepolling.com/florida-2024-poll-plurality-plan-to-vote-yes-on-abortion-protection-ballot-measure/"
  },
  {
    "text": "Truong My Lan: Vietnamese billionaire sentenced to death for $44bn fraud  —  Truong My Lan is accused of looting one of Vietnam's largest banks over a period of 11 years  —  It was the most spectacular trial ever held in Vietnam, befitting one of the greatest bank frauds the world has ever seen.",
    "url": "https://www.bbc.com/news/world-asia-68778636"
  },
  {
    "text": "GOP Reps Have a Familiar Strategy for Trump Trial: What About Hunter Biden?  —  STORM HUNTERS  —  As Trump starts his first criminal trial, GOP allies are laying the groundwork for a potential foil to the central hush money issue.  Surprise—it's Hunter Biden again.",
    "url": "https://www.thedailybeast.com/gop-reps-have-a-familiar-strategy-for-trump-trial-whatabout-hunter-biden"
  },
  {
    "text": "RNC under Lara Trump spreads ‘massive fraud’ claims about 2020 election  —  The Republican National Committee last week sent out a scripted call to voters' phones on behalf of new co-chair Lara Trump saying Democrats committed “massive fraud” in the 2020 election.",
    "url": "https://www.cnn.com/2024/04/10/politics/lara-trump-rnc-2020-election-fraud-claims/"
  },
  {
    "text": "The Trump donor whom Biden can't fire is running the U.S. Postal Service directly into the ground—just what everyone warned about when he was confirmed during the pandemic  —  Technology has afforded us the ability to connect with nearly anyone, anytime—and free of charge.",
    "url": "https://fortune.com/2024/04/10/usps-dejoy-price-hikes-customer-dissatisfaction/"
  },
  {
    "text": "Before He Died in Prison, Aleksei Navalny Wrote a Memoir.  It's Coming This Fall.  —  In the book, Navalny tells his story in his own words, chronicling his life, his rise as an opposition leader, and the attempts on his life.  —  During the years leading up to his death in a Russian prison … ",
    "url": "https://www.nytimes.com/2024/04/11/books/booksupdate/aleksei-navalny-memoir.html"
  },
  {
    "text": "Bankruptcy documents detail how GOP NC governor nominee Mark Robinson failed to file federal income taxes for 5 years  —  Mark Robinson claims Democrats have caused the “death” of “responsibility.”  —  North Carolina Lieutenant Governor Mark Robinson, whom Republican presidential candidate … ",
    "url": "https://abcnews.go.com/US/bankruptcy-documents-detail-gop-nc-governor-nominee-mark/story?id=108763847"
  },
  {
    "text": "Biden Loses Support Among Black Men, WSJ Poll Finds  —  New survey of seven battleground states also shows some Black women are weighing other options",
    "url": "https://www.wsj.com/politics/elections/biden-trump-black-men-support-election-2024-poll-a7d9da22"
  },
  {
    "text": "About 1 in 4 U.S. teachers say their school went into a gun-related lockdown in the last school year  —  Twenty-five years after the mass shooting at Columbine High School in Colorado, a majority of public K-12 teachers (59%) say they are at least somewhat worried about the possibility of a shooting ever happening at their school.",
    "url": "https://www.pewresearch.org/short-reads/2024/04/11/about-1-in-4-us-teachers-say-their-school-went-into-a-gun-related-lockdown-in-the-last-school-year/"
  },
  {
    "text": "The GOP Is the Party of Putin  —  The Russians' takeover of the Republican party is arguably the most successful influence operation in history.  —  “RUSSIAN PROPAGANDA HAS MADE ITS WAY into the United States, unfortunately, and it's infected a good chunk of my party's base.”",
    "url": "https://www.thebulwark.com/p/the-gop-is-the-party-of-putin"
  },
  {
    "text": "Alabama Man Charged with Detonating an Explosive Device Outside of Alabama Attorney General's Office  —  For Immediate Release  —  An Alabama man was indicted for his alleged role in detonating an explosive device in downtown Montgomery, Alabama.  —  On April 10, law enforcement arrested … ",
    "url": "https://www.justice.gov/opa/pr/alabama-man-charged-detonating-explosive-device-outside-alabama-attorney-generals-office"
  }
]