[
  {
    "text": "Trump Keeps Watching Clip of Himself Being Shot at: ‘May Legit Have PTSD’  —  ‘OVER AND OVER AGAIN’  —  Sources close to the ex-president's campaign have said he's particularly fixated on a single seven-second clip.  —  Those close to Donald Trump fear the former president “may have legit PTSD” … ",
    "url": "https://www.thedailybeast.com/trump-keeps-watching-clip-of-himself-being-shot-may-legit-have-ptsd"
  },
  {
    "text": "Campaign spending booms in race to define Harris … - Harris and Trump are rushing to lock in perceptions about her for a sliver of the electorate in the six or seven swing states likely to decide the winner on Nov. 5.  — Through Thursday, the Harris and Trump campaigns and their supporting groups … ",
    "url": "https://www.axios.com/2024/08/15/trump-harris-ad-spending-2024-august"
  },
  {
    "text": "Franklin & Marshall Poll Release: August 2024  —  I'm writing to share our summary report for the August 2024 Franklin & Marshall College Poll.  I've highlighted a few of the key findings below, but I encourage you to read the full report, which is also included.",
    "url": "https://www.fandmpoll.org/franklin-marshall-poll-release-august-2024/"
  },
  {
    "text": "August 2024 National Poll: Harris 50%, Trump 46%  —  Home Polls August 2024 National Poll: Harris 50%, Trump 46%  —  Independents, Younger Voters Swing Toward Harris  —  The first Emerson College Polling national survey following President Biden's decision not to seek re-election finds … ",
    "url": "https://emersoncollegepolling.com/august-2024-national-poll-harris-50-trump-46/"
  },
  {
    "text": "Fox News Poll: New matchup, same result — Trump bests Harris by one point  —  Highest share of voters in over two years rate their personal finances positively  —  Join Fox News for access to this content  —  No matter how many major events intervene, and goodness knows there have been several … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-new-matchup-same-result-trump-bests-harris-one-point"
  },
  {
    "text": "Robert F. Kennedy Jr. tried to meet with Kamala Harris to discuss Cabinet job  —  Harris has rebuffed the offer of an endorsement, while Kennedy has also had conversations with Republican nominee Donald Trump about a role in his administration.  —  Independent presidential candidate Robert … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/14/rfk-jr-kamala-harris-cabinet-trump/"
  },
  {
    "text": "JD Vance in 2020 agreed grandmothers raising children is ‘whole purpose of the postmenopausal female’  —  While appearing on “The Portal” podcast in April 2020, Sen. JD Vance (R-OH) agreed with host Eric Weinstein's claim that “postmenopausal females” exist just to help take care of children.",
    "url": "https://heartlandsignal.com/2024/08/14/jd-vance-in-2020-agreed-grandmothers-raising-children-is-whole-purpose-of-the-postmenopausal-female/"
  },
  {
    "text": "The case for Harris embracing nationwide free school meals  —  It's good policy and good politics. … Last weekend at a rally in Las Vegas, Kamala Harris announced one of her first explicit new policy positions: a plan to “eliminate taxes on tips for service and hospitality workers.”",
    "url": "https://www.publicnotice.co/p/kamala-harris-walz-free-school-meals-nationwide"
  },
  {
    "text": "Gov. Tim Walz agrees to VP debate hosted by CBS News on Oct. 1  —  Washington — Gov. Tim Walz on Wednesday agreed to participate in a vice presidential debate hosted by CBS News on Oct. 1 in New York City.  —  Former President Donald Trump's campaign has not yet agreed to the date … ",
    "url": "https://www.cbsnews.com/news/vp-debate-tim-walz-jd-vance/"
  },
  {
    "text": "George Helmy will be new U.S. Senator from New Jersey  —  Gov. Phil Murphy intends to appoint George S. Helmy, his former chief of staff, to the United States Senate to replace Bob Menendez, the New Jersey Globe has confirmed.  —  Murphy is expected to formally offer Helmy the post on Thursday … ",
    "url": "https://newjerseyglobe.com/congress/george-helmy-will-be-new-u-s-senator-from-new-jersey/"
  },
  {
    "text": "Russians fleeing Ukraine's incursion say Putin has abandoned them  —  ‘Lies are causing civilians to die’, says resident of town captured by Kyiv's forces  —  On the day Ukrainian forces started rolling into Russia's Kursk region, a group of about 40 people, mostly women, filmed a video about what was happening in their town.",
    "url": "https://www.ft.com/content/c7c40edb-9eba-41c3-916d-566b6b036c29"
  },
  {
    "text": "Nevada Senate Race Now Favors Democrat, Report Says  —  The nonpartisan Cook Political Report moved the race from “tossup” to “lean Democrat” after polling shows Senator Jacky Rosen with a large edge.  —  Senator Jacky Rosen of Nevada, a Democrat seeking re-election to her seat for the first time … ",
    "url": "https://www.nytimes.com/2024/08/15/us/politics/jacky-rosen-nevada-senate.html"
  },
  {
    "text": "Trump effort to push back oral arguments in case against Fani Willis denied … - Postponed oral arguments were requested by Trump's lawyer Steve Sadow to accommodate a pre-paid international trip with his wife to celebrate his 70th birthday and their 45th wedding anniversary, the Atlanta Journal-Constitution reported.",
    "url": "https://www.axios.com/2024/08/14/fani-willis-oral-arguments-december-trump"
  },
  {
    "text": "JD Vance: Amazon funded Black Lives Matter so riots would destroy rival retailers  —  Loading...  WASHINGTON  —  In 2021, J.D. Vance gave a speech to a conservative think tank on “woke capital” - and accused Amazon of funding Black Lives Matter in order to burn down the competition.",
    "url": "https://www.csmonitor.com/USA/Politics/2024/0815/jd-vance-speech-bezos-amazon-abortion"
  },
  {
    "text": "Why Facebook blocked Popular Information's reporting on Laura Loomer  —  Yesterday, Popular Information published a detailed report on the close relationship between former President Donald Trump and Laura Loomer, a far-right conspiracy theorist who says America should be a “white Judeo-Christian ethnostate.”",
    "url": "https://popular.info/p/update-why-facebook-blocked-popular"
  },
  {
    "text": "Arizona will call fetuses “unborn human beings” in abortion initiative description … - Arizona for Abortion Access, the campaign backing the initiative, sued to change the language to “fetus,” arguing it was a more impartial term.  — The Maricopa County Superior Court sided with the campaign … ",
    "url": "https://www.axios.com/local/phoenix/2024/08/14/arizona-abortion-intitiative-unborn-human-beings"
  },
  {
    "text": "When Is “Recyclable” Not Really Recyclable?  When the Plastics Industry Gets to Define What the Word Means.  —  Companies whose futures depend on plastic production are trying to persuade the federal government to allow them to put the label “recyclable” on plastic shopping bags … ",
    "url": "https://www.propublica.org/article/plastics-industry-redefine-recyclable-ftc-grocery-bags"
  },
  {
    "text": "Russian court gives 12-year treason sentence to Russian-American over $50 charity donation  —  A Russian court has sentenced a Russian-American woman to 12 years in prison for treason after she made a donation of just over $50 to a US-based charity supporting Ukraine.",
    "url": "https://www.cnn.com/2024/08/15/europe/ksenia-karelina-russia-america-sentence-treason-intl"
  },
  {
    "text": "Exclusive: Biden channels $50 million to help auto suppliers on EVs … Michigan, a critical swing state, is getting the largest share.  But money is flowing to several very red states, too.  — It's an example of what backers hope makes the Inflation Reduction Act durable … ",
    "url": "https://www.axios.com/2024/08/15/exclusive-biden-channels-50-million-to-help-auto-suppliers-on-evs"
  },
  {
    "text": "Walz's false claim that Vance never voted for any pro-worker bills  —  Walz relies on a dubious metric, which misses at least two pro-worker bills supported by Vance. … — Democratic vice-presidential nominee Tim Walz, in a speech in Los Angeles to a conference of the American Federation of State … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/15/walzs-false-claim-that-vance-never-voted-any-pro-worker-bills/"
  },
  {
    "text": "Prepare for Trump to be sentenced to prison on September 18  —  The objective here is to enable VP Kamala Harris and the media-Democratic complex to label Trump ‘a convicted felon sentenced to prison’ as voting begins  —  To the surprise of no one, Judge Juan Merchan has yet again denied … ",
    "url": "https://www.foxnews.com/opinion/andrew-mccarthy-prepare-trump-sentenced-prison-september-18"
  }
]