[
  {
    "text": "Trump Says He Lost 15 Pounds ‘The Hard Way’  —  “You look like you're in fighting shape!”  Fox host Brian Kilmeade gushed while aboard the indicted former president's plane.  —  Fox & Friends co-host Brian Kilmeade spoke with former President Donald Trump ahead of his final rally … ",
    "url": "https://www.thedailybeast.com/trump-says-he-lost-15-pounds-the-hard-way"
  },
  {
    "text": "Trump Wins NH Primary, But Not Quite the Victory He Wanted  —  Trump secured a win in the New Hampshire primary, but it was hardly what he was looking for.  —  CONCORD, New Hampshire—If Donald Trump ever had a chance of having his march to the Republican presidential nomination sidetracked … ",
    "url": "https://www.thedailybeast.com/trump-wins-nh-primary-but-not-quite-the-victory-he-wanted"
  },
  {
    "text": "New Hampshire exit poll: Majority of GOP primary voters aren't MAGA, but most would be satisfied with Trump nomination  —  The voters who turned out for New Hampshire's GOP presidential primary on Tuesday were less staunchly conservative and less closely tied to the Republican Party … ",
    "url": "https://www.cnn.com/2024/01/23/politics/exit-poll-new-hampshire-primary/"
  },
  {
    "text": "New Hampshire primary live updates: Biden and Trump win, NBC News projects … Donald Trump wins New Hampshire Republican primary  —  NBC News projects that Donald Trump has won the New Hampshire Republican primary, securing at least 11 of the state's 22 delegates.",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/new-hampshire-primary-live-updates-rcna134576"
  },
  {
    "text": "Elise Stefanik's Deranged Defense of Trump Offers Democrats a Lesson  —  When it comes to Donald Trump's legal travails, there are two general schools of thought among Democrats.  In one, a jury's finding that Trump is liable for sexually abusing E. Jean Carroll—and his pending trials … ",
    "url": "https://newrepublic.com/article/178320/elise-stefanik-deranged-defense-trump-democrats-lesson"
  },
  {
    "text": "Biden wins the New Hampshire primary after Democrats write him on the ballot  —  MANCHESTER, N.H. — President Biden won the New Hampshire Democratic primary on Tuesday, an unusual race that he skipped after the party changed its rules in favor of seeing South Carolina hold the first nominating contest of the year.",
    "url": "https://www.npr.org/2024/01/23/1225663027/joe-biden-wins-nh-primary-results"
  },
  {
    "text": "The Los Angeles Times plunges into ‘chaos’ as brutal layoffs loom and senior editors call it quits  —  Editor's Note: A version of this article first appeared in the “Reliable Sources” newsletter.  Sign up for the daily digest chronicling the evolving media landscape here.  —  New York CNN  —",
    "url": "https://www.cnn.com/2024/01/23/media/los-angeles-times-layoffs-strike/"
  },
  {
    "text": "Alaska Airlines CEO: We found ‘many’ loose bolts on our Max 9s following near-disaster  —  “I'm angry,” said Alaska CEO Ben Minicucci.  “This happened to Alaska Airlines.  It happened to our guests and happened to our our people.”  —  The CEO of Alaska Airlines said new … ",
    "url": "https://www.nbcnews.com/business/business-news/alaska-airlines-found-more-loose-bolts-boeing-737-max-9-ceo-says-rcna135316"
  },
  {
    "text": "Delta Boeing plane loses wheel while taxiing for takeoff  —  A Delta Air Lines Boeing plane lost a nose wheel before it took off Saturday from the Hartsfield-Jackson Atlanta International Airport.  —  A spokesperson for the Federal Aviation Administration (FAA) said in a statement … ",
    "url": "https://thehill.com/regulation/transportation/4425300-delta-boeing-plane-loses-wheel/"
  },
  {
    "text": "Audio recording reveals the moment that senior Republican figure tried to bribe Kari Lake not to run for Senate  —  An audio recording obtained by DailyMail.com reveals the extraordinary moment when what appears to be Arizona's top Republican official tried to bribe populist firebrand Kari Lake not to run in the state's Senate race.",
    "url": "https://www.dailymail.co.uk/news/article-12996297/EXCLUSIVE-Audio-recording-reveals-moment-senior-Republican-figure-tried-bribe-Kari-Lake-not-run-Senate.html"
  },
  {
    "text": "FTC Orders Maker of TurboTax to Cease “Deceptive” Advertising  —  The federal agency, after an investigation prompted by ProPublica's reporting, blasted Intuit for misleading customers about its “free” tax-filing program and directed the company to take specific steps to fix its ads.",
    "url": "https://www.propublica.org/article/ftc-intuit-turbotax-cease-deceptive-advertising-free-filing-taxes"
  },
  {
    "text": "Donors sue No Labels for ‘bait and switch’ 3rd party threat  —  Two New York mega-donors have sued No Labels for an alleged “bait and switch” maneuver, accusing the third-party organization of accumulating donations for bipartisan governing initiatives that are now instead funding a “unity ticket” for a 2024 presidential run.",
    "url": "https://thehill.com/regulation/court-battles/4424710-donors-sue-no-labels/"
  },
  {
    "text": "Turkey's parliament approves Sweden's NATO membership, lifting a key hurdle  —  Turkish legislators on Tuesday endorsed Sweden's membership in NATO, lifting a major hurdle on the previously nonaligned country's entry into the military alliance.  Lawmakers ratified Sweden's accession protocol 287 to 55 … ",
    "url": "https://apnews.com/article/turkey-sweden-nato-kurdish-militants-quran-ff81aa2d36160428d766579963f97fce"
  },
  {
    "text": "Higher vehicle hoods significantly increase pedestrian deaths, study finds  —  Single-vehicle, single-pedestrian crash data for 2016-2021 finds hoods a problem.  —  It's hard to escape the fact that American trucks and SUVs have been on a steroid-infused diet for the last few years.",
    "url": "https://arstechnica.com/cars/2024/01/higher-vehicle-hoods-significantly-increase-pedestrian-deaths-study-finds/"
  },
  {
    "text": "Breaking: Travel bans proposed in Tennessee & Oklahoma  —  We knew it was never going to stop with Idaho.  —  Tennessee Republican Rep. Jason Zachary introduced a travel ban yesterday—legislation that would make it a Class C felony to take a minor out-of-state for abortion care.",
    "url": "https://jessica.substack.com/p/breaking-travel-bans-proposed-in"
  },
  {
    "text": "The White House has its own pharmacy—and, boy, was it shady under Trump  —  It wasted $750K during the Trump years and freely handed out Ambien and Provigil.  —  The White House has its own pharmacy that, until recently, could perhaps best be described as a hot mess, according … ",
    "url": "https://arstechnica.com/science/2024/01/the-white-house-has-its-own-pharmacy-and-boy-was-it-shady-under-trump/"
  },
  {
    "text": "Heaven knows I'm miserable now!  The Smiths star recoils at Trump using his song  —  Donald Trump isn't known for his love of classic British guitar band The Smiths — even though they have a song called “Bigmouth Strikes Again” that could be an ideal soundtrack for his planned return to the White House.",
    "url": "https://www.politico.eu/article/the-smiths-johnny-marr-donald-trump-rally-election/"
  }
]