[
  {
    "text": "Mike Pence Says He Won't Endorse Donald Trump For President  —  This should come as “no surprise,” Trump's former vice president said.  —  Former Vice President Mike Pence confirmed Friday that he will not be endorsing Donald Trump for president.  —  “It should come as no surprise … ",
    "url": "https://www.huffpost.com/entry/mike-pence-not-endorsing-donald-trump-2024-election_n_65f4ab9de4b0b4d0b8995cbe"
  },
  {
    "text": "Pence declines to endorse Trump, won't back Biden  —  Former Vice President Mike Pence has declined to endorse his onetime running mate, former President Trump, in a bombshell announcement Friday.  —  Pence, whose relationship soured with Trump after the January 6 riots wherein the president faulted … ",
    "url": "https://www.foxnews.com/media/pence-declines-to-endorse-trump-wont-back-biden"
  },
  {
    "text": "How Trump Is Scrambling to Raise Cash  —  The former president is facing converging financial crunches as he and the Republican Party confront a shortfall against President Biden and the Democrats.  —  As many as three nights a week, Donald J. Trump has been hosting private dinners at Mar-a-Lago … ",
    "url": "https://www.nytimes.com/2024/03/16/us/politics/trump-finances-money-fundraising.html"
  },
  {
    "text": "Pence says he ‘cannot in good conscience’ endorse Trump  —  Former Vice President Mike Pence on Friday said he “cannot in good conscience” endorse presumptive GOP nominee Donald Trump, arguing that Trump is pursuing an agenda that is “at odds with the conservative agenda.”",
    "url": "https://www.cnn.com/2024/03/15/politics/pence-will-not-endorse-trump/"
  },
  {
    "text": "Trump aide Peter Navarro asks Supreme Court to keep him out of prison  —  A senior aide to former president Donald Trump asked the Supreme Court on Friday to keep him out of prison while he appeals his conviction for refusing to testify before Congress about his involvement in efforts to overturn the 2020 election.",
    "url": "https://www.washingtonpost.com/politics/2024/03/15/peter-navarro-supreme-court/"
  },
  {
    "text": "Laura Ingraham Apologizes for Graphic of Wrong Black Lawyer  —  On The Ingraham Angle, attorney Terrence Bradley was substituted for Nathan Wade in a graphic alongside Fani Willis.  —  Fox News host Laura Ingraham apologized Friday night for a graphic that erroneously identified attorney Terrence Bradley … ",
    "url": "https://www.thedailybeast.com/laura-ingraham-apologizes-for-graphic-of-wrong-black-lawyer"
  },
  {
    "text": "Mike Johnson Suddenly Seems Ready to Stick a Shiv in MAGA  —  Poor Mike Johnson is in quite a bind.  The House speaker simply doesn't have a governing majority: It is borderline impossible to pass anything with only Republican votes, because the hard-right MAGA bloc wants to thwart governing at all costs.",
    "url": "https://newrepublic.com/article/179861/mike-johnson-ukraine-aid-bill-shiv-maga"
  },
  {
    "text": "Secret Service, Justice Dept locate person of interest in swatting attacks on DHS Secretary Mayorkas and other officials  —  Federal agents have located a person of interest in over 100 swatting calls, which included calls targeting  Homeland Security Secretary Alejandro Mayorkas … ",
    "url": "https://www.cbsnews.com/news/swatting-suspect-mayorkas-secret-service-justice-dept/"
  },
  {
    "text": "Leaked SpaceX documents show company forbids employees to sell stock if it deems they've misbehaved  —  ‘An act of dishonesty against the company’ is among the violations cited  —  SpaceX requires employees to agree to some unusual terms related to their stock awards, which have a chilling effect on staff … ",
    "url": "https://techcrunch.com/2024/03/15/spacex-employee-stock-sales-forbidden/"
  },
  {
    "text": "‘We are losing our kids to a satanic cult,’ Sen. Tommy Tuberville warns during Utah campaign stop  —  The Alabama Republican has endorsed Republican U.S. Senate candidate Trent Staggs in the race to replace Utah Sen. Mitt Romney in Congress.  —  Alabama Republican U.S. Sen. Tommy Tuberville … ",
    "url": "https://www.sltrib.com/news/politics/2024/03/15/we-are-losing-our-kids-satanic/"
  },
  {
    "text": "Security footage of Boeing repair before door-plug blowout was overwritten  —  NTSB: Boeing “unable to find the records documenting” repair work on 737 Max 9.  —  A government investigation into a Boeing 737 Max 9 plane's door-plug blowout has been hampered by a lack of repair records … ",
    "url": "https://arstechnica.com/tech-policy/2024/03/boeing-door-plug-probe-stalled-by-missing-records-overwritten-security-footage/"
  },
  {
    "text": "2 Orange school board conservatives ousted by recalls with LGBTQ+ policies at the center  —  Voters in the city of Orange appear to have ousted two conservative school board members who had spearheaded policies widely opposed by advocates for LGBTQ+ youth in a recall election viewed … ",
    "url": "https://www.latimes.com/california/story/2024-03-15/orange-unified-school-board-members-who-embraced-culture-wars-are-ousted"
  },
  {
    "text": "Republican Senate Slugfest in Ohio Fuels Jitters About Trump's Candidate  —  The former president will appear alongside Bernie Moreno on Saturday, one potential sign that Mr. Moreno could use an 11th-hour assist.  —  The former president will appear alongside Bernie Moreno on Saturday … ",
    "url": "https://www.nytimes.com/2024/03/16/us/politics/ohio-republican-senate-primary-trump.html"
  },
  {
    "text": "Justice Ginsburg's Family Decries Bestowing RBG Award on Elon Musk and Rupert Murdoch  —  The awards are being handed out by a foundation chaired by a Trump donor.  —  On Wednesday, the Dwight D. Opperman Foundation announced the 2024 recipients of the Justice Ruth Bader Ginsburg Leadership Award.",
    "url": "https://www.motherjones.com/politics/2024/03/justice-ginsburgs-family-decries-bestowing-rbg-award-on-elon-musk-and-rupert-murdoch/"
  },
  {
    "text": "How CrowdTangle predicted the future  —  Eight years after buying the data analysis tool CrowdTangle, and four years after it began exasperating the executives responsible for it, Meta said Thursday that it would shut down the tool on August 14.  —  CrowdTangle, a data analysis tool … ",
    "url": "https://www.platformer.news/meta-crowdtangle-shutdown-dsa-platform-transparency/"
  },
  {
    "text": "‘Engage on this issue’: House GOP leadership tells members to take on abortion; IVF  —  WASHINGTON — Republican leaders are encouraging Congressional candidates not to shy away from discussing abortion and in vitro fertilization during the election this fall.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/16/gop-tells-candidates-abortion-ivf-important-issues/72990434007/"
  },
  {
    "text": "Supreme Court Narrowly Interprets Landmark Reduced Sentencing Law  —  The justices sided with the government in a case focused on who is eligible for shorter prison sentences under the bipartisan First Step Act passed in 2018.  —  The Supreme Court sided with the government on Friday … ",
    "url": "https://www.nytimes.com/2024/03/15/us/politics/supreme-court-sentencing-first-step-act.html"
  }
]