[
  {
    "text": "Fox News Poll: The first 100 days of President Trump's second term  —  82% are extremely or very concerned about inflation, down from 89% in January  —  As Donald Trump approaches the 100th day of his second term, a Fox News survey finds voters pleased with the job he is doing on border security … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-first-100-days-president-trumps-second-term"
  },
  {
    "text": "72% of American Jews disapprove of Donald Trump's performance so far, poll finds … Nearly three quarters of American Jews disapprove of the job Donald Trump is doing as president and most dislike how he is handling antisemitism in the United States, according to a new survey.",
    "url": "https://www.jta.org/2025/04/24/politics/72-of-american-jews-disapprove-of-donald-trumps-performance-so-far-poll-finds"
  },
  {
    "text": "Trump Lashes Out at Rupert Murdoch Over Fox News' ‘Trump Hating, Fake Pollster’ After Survey Reveals Record-Low Approval Ratings  —  President also calls on media mogul to make changes at Wall Street Journal: ‘It sucks’  —  President Trump is unhappy with Fox News Channel again … ",
    "url": "https://variety.com/2025/tv/news/trump-rupert-murdoch-fox-news-poll-record-low-approval-1236377066/"
  },
  {
    "text": "China tells US to ‘cancel all unilateral tariffs’ if it wants talks  —  Beijing says claims it is nearing a deal with Washington to resolve the trade war are ‘fake news’  —  Beijing has called on the US to “completely cancel all unilateral tariff measures” if it wants trade talks … ",
    "url": "https://www.ft.com/content/3e076fb5-3988-4e21-9119-3fc637afebb8"
  },
  {
    "text": "Trump to target ActBlue in presidential memorandum  —  The action is expected to come Thursday.  —  In a shot at ActBlue, the left's major online donation platform, President Donald Trump plans to sign a presidential memorandum on Thursday cracking down on foreign contributions in American elections … ",
    "url": "https://www.politico.com/news/2025/04/24/trump-to-target-actblue-in-presidential-memorandum-00307251"
  },
  {
    "text": "Trump to target Democratic fundraising powerhouse ActBlue with DOJ probe  —  President Donald Trump is slated to issue a memorandum on Thursday targeting ActBlue, the Democratic Party's main fundraising platform - taking aim at one of the key pillars of the financial infrastructure for Democratic candidates.",
    "url": "https://cnn.com/2025/04/24/politics/actblue-trump-memo-doj-probe/"
  },
  {
    "text": "The Untold Story of How Ed Martin Ghostwrote Online Attacks Against a Judge — and Still Became a Top Trump Prosecutor  —  Martin's career is dotted with ethical and professional questions, records show.  Some of the most serious ones about the interim U.S. attorney for D.C. have remained buried … ",
    "url": "https://www.propublica.org/article/ed-martin-trump-interim-dc-us-attorney-secret-judge-attacks"
  },
  {
    "text": "Trump admin must seek return of another man who was improperly deported to El Salvador, judge rules  —  A Trump-appointed judge ruled that the administration deported a 20-year-old Venezuelan man last month in violation of a legally binding, court-approved settlement agreement.",
    "url": "https://www.politico.com/news/2025/04/24/trump-el-salvador-deportation-venezuelan-minor-judge-00307336"
  },
  {
    "text": "Trump Tells Putin to ‘STOP!’  After Deadly Russian Attack on Kyiv  —  The attack, which killed at least 12 people, was the deadliest on Ukraine's capital in nearly a year.  President Trump called on President Vladimir V. Putin to “STOP!” in a post on social media.",
    "url": "https://www.nytimes.com/2025/04/24/world/europe/ukraine-kyiv-russia-attack.html"
  },
  {
    "text": "‘I Like That Question’: Trump Approves After Reporter Asks if He Deserves a Nobel Peace Prize  —  President Donald Trump expressed approval Thursday after a reporter asked Norwegian Prime Minister Jonas Gahr Støre whether Trump should be nominated for a Nobel Peace Prize for his efforts to end the war between Russia and Ukraine.",
    "url": "https://www.mediaite.com/tv/i-like-that-question-trump-approves-after-reporter-asks-if-he-deserves-a-nobel-peace-prize/"
  },
  {
    "text": "U.S. Sidelines Lawyers Who Doubted Their Own Case on Congestion Pricing  —  The Trump administration replaced lawyers who had exposed flaws in its legal battle over New York City's congestion pricing program.  —  The U.S. Department of Transportation on Thursday said it took the extraordinary step … ",
    "url": "https://www.nytimes.com/2025/04/24/nyregion/nyc-congestion-pricing-duffy-lawyers.html?unlocked_article_code=1.CE8.vgqL.VKDKYVyrggAf"
  },
  {
    "text": "Nayib Bukele, 2028 Republican Frontrunner  —  Kilmar Abrego Garcia has become the face of the migrants deported to El Salvador for a simple reason: He was the one whose process rights were most trampled by the mass deportation, since a judge had formerly ruled he couldn't be deported … ",
    "url": "https://www.thebulwark.com/p/nayib-bukele-2028-republican-frontrunner-a8c"
  },
  {
    "text": "Judge Halts Trump's Anti-Voting Executive Order  —  A federal judge in Washington, D.C., Thursday blocked federal agencies from carrying out parts of President Donald Trump's sweeping executive order on elections.  —  The Democratic Party, the League of United Latin American Citizens … ",
    "url": "https://www.democracydocket.com/news-alerts/judge-halts-trumps-anti-voting-executive-order/"
  },
  {
    "text": "100 days of DOGE: lots of chaos, not so much efficiency  —  At the Social Security Administration, lawyers, statisticians and other high-ranking agency officials are being sent from the Baltimore headquarters to regional offices to replace veteran claims processors who have been fired or taken buyouts from the Trump administration.",
    "url": "https://www.reuters.com/world/us/100-days-doge-lots-chaos-not-so-much-efficiency-2025-04-24/"
  },
  {
    "text": "Trump officials consider shrinking 6 national monuments in the West  —  Interior Department officials are considering scaling back the boundaries of national monuments in the West to encourage energy development on public lands.  —  Trump officials are analyzing whether to remove federal protections … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/04/24/trump-national-monument-reductions-mining-oil/"
  },
  {
    "text": "Runaway Tren  —  How a Colorado slumlord's psyop turned into a brand-new ‘forever war’ on Venezuela  —  Earlier this month, a middle-aged woman with shaggy, silvery hair and a pleasant smoker's contralto flew from Denver to Washington to testify before the House Judiciary Committee.",
    "url": "https://prospect.org/justice/2025-04-24-runaway-tren-de-aragua-colorado-housing-gangs/"
  },
  {
    "text": "Trump Is a Virus  —  Chaos is about to take its toll  —  Hammering out a few words before getting on the bike.  —  It has been amazing to watch the stock market gyrating in response to things that aren't even policy changes — they're hints and rumors of policy changes.",
    "url": "https://paulkrugman.substack.com/p/trump-is-a-virus"
  },
  {
    "text": "Stacey Abrams considers third run for governor as some Georgia Democrats move on  —  After two losses, Abrams still commands attention and respect.  But her political machine has faded and the primary field is filling up.  —  Eight years ago, Stacey Abrams delivered a speech at an Atlanta union hall … ",
    "url": "https://www.ajc.com/politics/stacey-abrams-considers-third-run-for-governor-as-some-georgia-democrats-move-on/VXPLEABTTZHUBLX3ZFBI63NIXY/"
  },
  {
    "text": "‘He gets him what he needs’: Hegseth's new favorite adviser helped set up Signal on one of secretary's computers at Pentagon  —  Last month, after news broke that Secretary of Defense Pete Hegseth was using Signal to discuss sensitive military operations in violation of Pentagon policy … ",
    "url": "https://cnn.com/2025/04/24/politics/hegseth-adviser-signal-computer/"
  },
  {
    "text": "If A.I. Systems Become Conscious, Should They Have Rights?  —  As artificial intelligence systems become smarter, one A.I. company is trying to figure out what to do if they become conscious.  —  One of my most deeply held values as a tech columnist is humanism.",
    "url": "https://www.nytimes.com/2025/04/24/technology/ai-welfare-anthropic-claude.html?https://www.nytimes.com/2025/04/24/technology/ai-welfare-anthropic-claude.html"
  },
  {
    "text": "Illinois Lt. Gov. Juliana Stratton becomes the first to launch a bid for Dick Durbin's Senate seat  —  Stratton, who came into office alongside Gov. JB Pritzker in 2018, announced on Thursday she will seek Durbin's spot in the Senate.  —  CHICAGO — And the race is officially on.",
    "url": "https://www.nbcnews.com/politics/2026-election/illinois-lt-gov-juliana-stratton-first-run-dick-durbins-senate-seat-rcna202729?taid=680a2fc60c1f320001015ccb"
  },
  {
    "text": "Fact check: Trump lies about the price of eggs, groceries and gas  —  Gas.  Groceries.  Eggs.  Over the last week, President Donald Trump has lied about the price of all of them — using this repeated deception to try to minimize widespread concerns that his tariffs will fuel inflation.",
    "url": "https://cnn.com/2025/04/23/politics/price-of-eggs-gas-trump-fact-check/"
  },
  {
    "text": "Musk Goons Purged Living U.S. Citizens from Social Security  —  RESURRECTION DAY  —  Elon Musk and his DOGE foot soldiers effectively killed the financial lives of “countless” citizens through their database meddling.  —  What might be called Day of the Dead Living is being continually played … ",
    "url": "https://www.thedailybeast.com/doges-social-security-cuts-create-chaotic-day-of-the-dead-living/"
  },
  {
    "text": "U.S. Texts Barnard Employees and Asks if They Are Jewish  —  A questionnaire from a federal commission also inquired about whether professors and other college staff members had been harassed.  —  The personal cellphones of dozens of current and former Barnard College employees pinged Monday evening … ",
    "url": "https://www.nytimes.com/2025/04/23/nyregion/barnard-faculty-eeoc-text-jewish.html"
  },
  {
    "text": "Exclusive: Trump administration moved Venezuelan to Texas for possible deportation despite judge's order  —  President Donald Trump's administration moved a Venezuelan man who had worked in construction in Philadelphia to Texas for possible deportation after a federal judge had issued … ",
    "url": "https://www.reuters.com/world/us/trump-administration-moved-venezuelan-texas-possible-deportation-despite-judges-2025-04-24/"
  },
  {
    "text": "Wrong turn leads to hundreds of immigrant arrests at the Detroit-Canada border bridge  —  Warning: this story contains description of a suicide attempt.  —  The road that leads to the Ambassador Bridge, which connects Detroit to Canada, is notoriously difficult to navigate, even for locals.",
    "url": "https://www.npr.org/2025/04/24/nx-s1-5374937/immigrant-arrests-detroit-canada-border-bridge-detention"
  },
  {
    "text": "Pentagon to resume medical care for transgender troops  —  The move is another setback for Defense Secretary Pete Hegseth, who has made culture war issues a major part of his role.  —  The Pentagon will resume gender-affirming care for transgender service members, according to a memo obtained by POLITICO … ",
    "url": "https://www.politico.com/news/2025/04/24/transgender-troops-military-care-00306827"
  }
]