[
  {
    "text": "Chef Jose Andres says Israel targeted his aid workers ‘systematically, car by car’  —  Celebrity chef Jose Andres told Reuters in an emotional interview on Wednesday that an Israeli attack that killed seven of his food aid workers in Gaza had targeted them “systematically, car by car.”",
    "url": "https://www.reuters.com/world/middle-east/chef-jose-andres-says-israel-targeted-his-aid-workers-systematically-car-by-car-2024-04-03/"
  },
  {
    "text": "‘Lavender’: The AI machine directing Israel's bombing spree in Gaza  —  The Israeli army has marked tens of thousands of Gazans as suspects for assassination, using an AI targeting system with little human oversight and a permissive policy for casualties, +972 and Local Call reveal.",
    "url": "https://www.972mag.com/lavender-ai-israeli-army-gaza/"
  },
  {
    "text": "‘The machine did it coldly’: Israel used AI to identify 37,000 Hamas targets  —  Israeli intelligence sources reveal use of ‘Lavender’ system in Gaza war and claim permission given to kill civilians in pursuit of low-ranking militants  —  The Israeli military's bombing campaign in Gaza used … ",
    "url": "https://www.theguardian.com/world/2024/apr/03/israel-gaza-ai-database-hamas-airstrikes"
  },
  {
    "text": "Jack Smith puts Judge Aileen Cannon on notice  —  Judge Aileen M. Cannon has left many legal experts dumbfounded with her handling of the criminal classified documents case against former president Donald Trump, the man who nominated her to the federal bench.  —  And special counsel Jack Smith appears to be losing patience with her.",
    "url": "https://www.washingtonpost.com/politics/2024/04/03/jack-smith-puts-judge-aileen-cannon-notice/"
  },
  {
    "text": "Why Judge Aileen Cannon is on thin ice in Trump's Mar-a-Lago case  —  Editor's Note: Norman Eisen, who served as counsel to House Democrats in the first Trump impeachment, is a senior fellow at Brookings.  E. Danya Perry, a founding partner of Perry Guha LLP, formerly served as a federal prosecutor … ",
    "url": "https://www.cnn.com/2024/04/03/opinions/aileen-cannon-trump-mar-a-lago-case-eisen-perry-kolb"
  },
  {
    "text": "Two Individuals Plead Guilty To Participating In Insider Trading Scheme Based On SPAC Merger With Trump Media & Technology Group  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Michael Shvartsman and Gerald Shvartsman Made More Than $22 Million … ",
    "url": "https://www.justice.gov/usao-sdny/pr/two-individuals-plead-guilty-participating-insider-trading-scheme-based-spac-merger"
  },
  {
    "text": "Two investors in Trump Media insider trading case plead guilty  —  New York CNN  —  Florida venture capitalist Michael Shvartsman and his brother Gerald Shvartsman pleaded guilty on Wednesday to participating in an insider trading scheme linked to the blockbuster deal … ",
    "url": "https://www.cnn.com/2024/04/03/business/trump-truth-social-insider-trading/"
  },
  {
    "text": "Man who used megaphone to lead attack on police during Capitol riot gets more than 7 years in prison  —  A Washington state man who used a megaphone to orchestrate a mob's attack on police officers guarding the U.S. Capitol was sentenced on Wednesday to more than seven years in prison.",
    "url": "https://apnews.com/article/taylor-johnatakis-capitol-riot-sentencing-f97acd68b8860d36b212e408ac80abd4"
  },
  {
    "text": "Federal judge condemns ‘normalization’ of January 6 while sentencing defiant rioter  —  A federal judge on Wednesday blasted a convicted January 6 rioter for downplaying the US Capitol attack and using the kind of revisionist rhetoric that former President Donald Trump often uses on the campaign trial.",
    "url": "https://www.cnn.com/2024/04/03/politics/trump-criticism-judge-royce-lamberth-january-6/"
  },
  {
    "text": "Judge Won't Delay Trump's Criminal Trial to Wait for Immunity Ruling  —  The former president had asked the judge to push back his Manhattan criminal trial, slated to begin April 15, until after the Supreme Court decides whether he is immune from prosecution.",
    "url": "https://www.nytimes.com/2024/04/03/nyregion/trump-merchan-immunity-ruling.html"
  },
  {
    "text": "Rejected and ‘returned for correction’: Docs for Trump's $175M bond get bounced  —  A review of the New York County Supreme Court docket on Wednesday shows that paperwork for former President Donald Trump's newly-secured bond of $175 million was temporarily rejected and “returned for correction.”",
    "url": "https://lawandcrime.com/high-profile/rejected-and-returned-for-correction-docs-for-trumps-175m-bond-get-bounced/"
  },
  {
    "text": "Nebraska Republicans' bid to help Trump win the Electoral College, explained  —  The state has an odd rule that gave Biden an electoral vote in 2020.  Trump wants to change that.  Can he?  —  On Tuesday, Nebraska Gov. Jim Pillen (R) urged his state's legislature to change its rules … ",
    "url": "https://www.vox.com/politics/2024/4/3/24119984/nebraska-electoral-college-vote-trump-biden-kirk"
  },
  {
    "text": "Top Israeli official Ron Dermer began yelling during a meeting with U.S. officials about Gaza, officials say  —  The meeting grew tense after the Americans questioned an Israeli plan to evacuate more than 1 million Palestinian civilians from Rafah and house them in tents.",
    "url": "https://www.nbcnews.com/politics/national-security/top-israeli-official-ron-dermer-yelling-meeting-us-officials-gaza-rcna146293"
  },
  {
    "text": "‘Angry’ Biden not changing Israel policy after deadly strike on aid workers  —  It's another example of the United States criticizing Israel's conduct of the war against Hamas while remaining reluctant to use leverage to affect course corrections.  —  The Biden administration has no plans … ",
    "url": "https://www.politico.com/news/2024/04/03/biden-israel-strike-aid-workers-gaza-00150356"
  },
  {
    "text": "Trump Spoke Recently With Saudi Leader  —  It is not clear what the former president discussed with Prince Mohammed bin Salman, but news of their call came amid Biden administration negotiations with the Saudis over a Middle East peace plan.  —  Former President Donald J. Trump spoke recently … ",
    "url": "https://www.nytimes.com/2024/04/03/us/politics/trump-spoke-recently-with-saudi-leader.html"
  },
  {
    "text": "Trump Leads Biden in Six of Seven Swing States, WSJ Poll Finds  —  Incumbent trails in most battlegrounds that decided 2016 and 2020 elections",
    "url": "https://www.wsj.com/politics/elections/trump-biden-poll-swing-states-ad594acb"
  },
  {
    "text": "Democratic tactics against RFK Jr. are rattling his campaign  —  Recent digital and in-person protests have prompted the independent campaign to enact some evasive maneuvers.  —  A billboard truck paid for by the DNC has been circling Robert F. Kennedy Jr.'s campaign events.",
    "url": "https://www.politico.com/news/2024/04/03/rfk-jr-democrats-third-party-00150497"
  },
  {
    "text": "GOP Senate candidates cash out at Mar-a-Lago  —  Republican Senate candidates have flocked to Mar-a-Lago in recent months to raise funds for their campaigns, and the results have been lucrative, Axios has learned. … - Republican Bernie Moreno, who won a contentious GOP Senate primary in Ohio last month … ",
    "url": "https://www.axios.com/2024/04/03/trump-mar-a-lago-fundraising-republicans"
  },
  {
    "text": "Cable lobby vows “years of litigation” to avoid bans on blocking and throttling  —  FCC sets April 25 vote to restore net neutrality rules repealed under Ajit Pai.  —  The Federal Communications Commission has scheduled an April 25 vote to restore net neutrality rules similar … ",
    "url": "https://arstechnica.com/tech-policy/2024/04/fcc-democrats-schedule-net-neutrality-vote-making-cable-lobbyists-sad-again/"
  },
  {
    "text": "NASA tasked with creating a time zone for the moon  —  The White House has asked NASA to create a new time zone for the moon.  —  Arati Prabhakar, the head of the White House Office of Science and Technology Policy (OSTP), said in a letter Tuesday that the office wants NASA to establish … ",
    "url": "https://thehill.com/homenews/4573225-nasa-tasked-creating-time-zone-moon/"
  },
  {
    "text": "Greene says Speaker Johnson is a ‘Democrat,’ comparable to Nancy Pelosi  —  Rep. Marjorie Taylor Greene (R-Ga.) on Wednesday likened Speaker Mike Johnson (R-La.) to a Democrat as she doubled down on threats to push forward with an effort to oust him from his post.",
    "url": "https://thehill.com/homenews/4573642-greene-says-speaker-johnson-is-a-democrat-comparable-to-nancy-pelosi/"
  },
  {
    "text": "Youngkin mourns K-9 dog stabbed to death by ‘barbaric’ MS-13 gang members: ‘Will be held accountable’  —  The K-9 dog named Rivan was ‘repeatedly stabbed and kicked by the inmates’  —  FIRST ON FOX: Gov. Glenn Youngkin, R-Va., vows to hold a group of “barbaric” MS-13 members accountable … ",
    "url": "https://www.foxnews.com/politics/youngkin-mourns-dog-stabbed-ms-13-gang-members-held-accountable"
  },
  {
    "text": "Yes, we're divided.  But new AP-NORC poll shows Americans still agree on most core American values  —  WASHINGTON (AP) — Despite the country's deep political polarization, most Americans share many core beliefs about what it means to be an American, according to a new poll.",
    "url": "https://apnews.com/article/ap-poll-democracy-rights-freedoms-election-b1047da72551e13554a3959487e5181a"
  },
  {
    "text": "Trump's Bond Backer Repo'd Soldier Cars  —  HANKEY PANKY  —  Don Hankey's company agreed to a settlement with Trump's DOJ after systematically violating the rights of military employees by illegally repossessing their cars. … When billionaire financier Don Hankey underwrote Donald Trump's … ",
    "url": "https://www.thedailybeast.com/trumps-bond-backer-don-hankey-was-also-sued-by-the-trump-administration"
  },
  {
    "text": "Donald Trump has no idea what to do on abortion  —  No modern presidency has been as consequential for the anti abortion movement as Donald Trump's.  And perhaps no present-day politician appears as uncertain about what to do about the issue now as Donald Trump.",
    "url": "https://www.washingtonpost.com/politics/2024/04/03/donald-trump-has-no-idea-what-do-abortion/"
  }
]