[
  {
    "text": "Trump's Case Against Man Deported in “Error” Just Took Another Big Hit  —  As Trump administration officials seek to defend their refusal to return Kilmar Abrego Garcia to the United States after deporting him in “error,” one of the government's chief justifications has been that he was a member of the MS-13 gang.",
    "url": "https://newrepublic.com/article/194010/kilmar-abrego-garcia-case-trump-deported-error-another-hit"
  },
  {
    "text": "Abrego Garcia and MS-13: What Do We Know?  —  The allegation seems to stem from double hearsay in a document authored by a later suspended police detective.  —  Meet The Authors … In multiple filings, the government has conceded that it wrongfully removed Kilmar Armando Abrego Garcia … ",
    "url": "https://www.lawfaremedia.org/article/abrego-garcia-and-ms-13--what-do-we-know"
  },
  {
    "text": "‘Alien Enemies’ or Innocent Men?  Inside Trump's Rushed Effort to Deport 238 Migrants  —  The Trump administration sent them to a prison in El Salvador under a wartime act, calling them members of a Venezuelan gang.  But a New York Times investigation found little evidence of criminal backgrounds or links to the gang.",
    "url": "https://www.nytimes.com/2025/04/15/world/americas/trump-migrants-deportations.html?unlocked_article_code=1._04.x9FD.FNEo2ecTisGA&smid=bs-share"
  },
  {
    "text": "A whistleblower's disclosure details how DOGE may have taken sensitive labor data  —  In the first days of March, a team of advisers from President Trump's new Department of Government Efficiency initiative arrived at the Southeast Washington, D.C., headquarters of the National Labor Relations Board.",
    "url": "https://www.npr.org/2025/04/15/nx-s1-5355896/doge-nlrb-elon-musk-spacex-security"
  },
  {
    "text": "Trump Tests the True Limits of Presidential Power  —  Greetings and welcome to this week's midair performance of the Carnival of Fools!  Like a prestige subscription-service drama, our story resumes from a potent cliff-hanger: Last week, Donald Trump had invoked the laws of cartoon physics … ",
    "url": "https://www.nationalreview.com/carnival-of-fools/trump-tests-the-true-limits-of-presidential-power/"
  },
  {
    "text": "Trump's immigration agenda is not popular  —  To start this post, I am going to ask you a key question about immigration policy.  But first, I need to establish a few facts based on recent news:  —  On Monday, April 14, 2025, Donald Trump met with the President of El Salvador, Nayib Bukele, in the Oval Office.",
    "url": "https://www.gelliottmorris.com/p/trumps-immigration-agenda-isnt-popular"
  },
  {
    "text": "The Supreme Court Got It Badly Wrong  —  Today, the Trump administration made it clear: they will have to be forced to comply with the law.  They will not do it voluntarily.  It's just that simple, and that complicated.  Worst of all, it's completely unsurprising that we've come to this juncture.",
    "url": "https://joycevance.substack.com/p/the-supreme-court-got-it-badly-wrong"
  },
  {
    "text": "Trump is halfway to making America a police state  —  The president's refusal to accept a Supreme Court ruling on illegal deportation is a turning point  —  At around noon on April 14 2025, America ceased to have a law-abiding government.  Some would argue that had already happened on January 20, when Donald Trump was inaugurated.",
    "url": "https://www.ft.com/content/4c4b0f14-3e85-4436-94de-204d3f518f3c"
  },
  {
    "text": "State Terror  —  Yesterday the president defied a Supreme Court ruling to return a man who was mistakenly sent to a gulag in another country, celebrated the suffering of this innocent person, and spoke of sending Americans to foreign concentration camps.  —  This is the beginning … ",
    "url": "https://snyder.substack.com/p/state-terror"
  },
  {
    "text": "Bring.  Him.  Home.  —  Reminder: I'll be talking with Paul Krugman on Substack today, live at 12:30 p.m. Eastern.  —  1. Five Questions  —  We're going to give elected leaders in the Democratic party a charge and then talk about how the public can rally.  But first, I have some questions to consider.",
    "url": "https://www.thebulwark.com/p/bring-him-home"
  },
  {
    "text": "Levin and Martinez express support for Harvard amid funding fight with Trump administration  —  University president Jonathan Levin '94 and Provost Jenny Martinez expressed support for Harvard after its president Alan Garber M.D. '83 — a Stanford Medicine professor emeritus … ",
    "url": "https://stanforddaily.com/2025/04/15/levin-martinez-back-harvard-president/"
  },
  {
    "text": "US Economy to Lose Billions as Foreign Tourists Stay Away … The US economy is set to lose billions of dollars in revenue in 2025 from a pullback in foreign tourism and boycotts of American products, adding to a growing list of headwinds keeping recession risk elevated.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-15/us-economy-is-set-to-lose-billions-as-foreign-tourists-stay-away?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NDcyMTA2NiwiZXhwIjoxNzQ1MzI1ODY2LCJhcnRpY2xlSWQiOiJTVUlONTZUMVVNMFcwMCIsImJjb25uZWN0SWQiOiIxNTI1ODQyQjlGOEY0MDMzQUVGNjI4MTNFMkIxMEY0OSJ9.wS0IkqtQyQvATuAxGJy6lWTZtnEbLJ5lfphLYnw6BdU"
  },
  {
    "text": "Exclusive: Top Hegseth adviser Dan Caldwell put on leave in Pentagon leak probe  —  One of U.S. Defense Secretary Pete Hegseth's leading advisers, Dan Caldwell, was escorted from the Pentagon on Tuesday after being identified during an investigation into leaks at the Department of Defense, a U.S. official told Reuters.",
    "url": "https://www.reuters.com/world/us/top-hegseth-advisor-dan-caldwell-put-leave-pentagon-leak-probe-2025-04-15/"
  },
  {
    "text": "Happy Tax Evasion Day!  —  It's April 15th, Tax Day.  Today all good Americans will pay the taxes they owe.  Not so good Americans, on the other hand, will pay less than they owe, hoping to get away with it.  And their odds of getting away with tax evasion this year are a lot higher … ",
    "url": "https://paulkrugman.substack.com/p/happy-tax-evasion-day"
  },
  {
    "text": "Inside DOGE's push to defy a court order and access Social Security data  —  Musk's cost-cutting team repeatedly sought to get around a judge's order to gain access to private details about millions of beneficiaries.",
    "url": "https://www.washingtonpost.com/politics/2025/04/15/doge-social-security-data-judge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0Njg5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MDcxOTk5LCJpYXQiOjE3NDQ2ODk2MDAsImp0aSI6IjJhMjUzYTY1LThkNGEtNDBmNi04NGEyLWY2ZWRkY2EzMmNhZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzE1L2RvZ2Utc29jaWFsLXNlY3VyaXR5LWRhdGEtanVkZ2UvIn0.IegOl1YOKLh5dyQs5AZntGDV2vz31Xc6neYvFqCP86c&itid=gfta"
  },
  {
    "text": "4chan Is Down Following What Looks to Be a Major Hack Spurred By Meme War  —  The notorious imageboard 4chan is down following what appears to be a major hack of its backend.  The hackers claim to have exposed code for the site, the emails of moderators, and a list of mod communications.",
    "url": "https://www.404media.co/4chan-is-down-following-what-looks-to-be-a-major-hack-spurred-by-meme-war/"
  },
  {
    "text": "The Vibe Shifts Against the Right  —  Alex Kaschuta's podcast, “Subversive,” used to be a node in the network between weird right-wing internet subcultures and mainstream conservatism.  She hosted men's rights activists and purveyors of “scientific” racism, neo-reactionary online personalities … ",
    "url": "https://www.nytimes.com/2025/04/14/opinion/dissident-right-trump.html?unlocked_article_code=1._04.sl24.OWMmanBrjj5U&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "JD Vance: My message to Europe America doesn't want a vassal continent  —  “It's not good for Europe to be the permanent security vassal of the United States.”  So says JD Vance during a phone conversation with UnHerd on Monday, his first major interview with a European outlet since taking office as Vice President.",
    "url": "https://unherd.com/2025/04/jd-vance-my-message-to-europe/"
  },
  {
    "text": "Trump and DOGE Are Planning Deregulation at a Massive Scale … At the Department of Health and Human Services, Trump administration officials want to reverse a regulation that has required nursing homes to have more medical staff on duty.  —  At the Mine Safety and Health Administration … ",
    "url": "https://www.nytimes.com/2025/04/15/us/politics/trump-doge-regulations.html?unlocked_article_code=1._04.DssR.oTOM7pWte8bU&smid=url-share"
  },
  {
    "text": "Why President Trump isn't signing many laws … Trump and Republican congressional leaders often claim his new administration has been the most productive in recent memory.  —  Except when it comes to passing laws.  —  Trump has signed fewer bills into law at this point in his presidency … ",
    "url": "https://punchbowl.news/article/white-house/trump-bills-first-hundred-days/"
  },
  {
    "text": "Autism rate increased, CDC says in report that contradicts RFK Jr. on cause  —  In a sample of communities, the biennial autism surveillance report found that 1 in 31 8-year-olds had the condition.  The CDC attributed the increase to better screening.  —  One in 31 8-year-olds had autism … ",
    "url": "https://www.washingtonpost.com/health/2025/04/15/autism-rfk-jr-trump-cdc/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0Njg5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MDcxOTk5LCJpYXQiOjE3NDQ2ODk2MDAsImp0aSI6IjAyYzM3ZDY1LTU4YjYtNDM4My1hMjNlLTAyZWRhZGYyZmM2ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wNC8xNS9hdXRpc20tcmZrLWpyLXRydW1wLWNkYy8ifQ.H0ENRVaxryUv70rJ_OnlegIQKyVirGC8zpfCbEtpmiU&itid=gfta"
  },
  {
    "text": "China orders its airlines to stop accepting deliveries of Boeing jets, report says  —  The Chinese government has told the country's domestic airlines to stop accepting deliveries of Boeing jets as a trade war between the world's two largest economies escalates, Bloomberg News reports.",
    "url": "https://www.cbsnews.com/news/china-boeing-orders-halt-to-jet-deliveries-bloomberg-trump-tariffs/"
  },
  {
    "text": "Pentagon's ‘SWAT team of nerds’ resigns en masse  —  Employees of a defense tech unit say they were sidelined by DOGE.  “Either we die quickly or we die slowly,” says the director.  —  Under pressure from the Elon Musk-led Department of Government Efficiency, nearly all the staff … ",
    "url": "https://www.politico.com/news/2025/04/15/pentagons-digital-resignations-00290930"
  },
  {
    "text": "DOGE targets Brookfield Zoo  —  Happy Tuesday, Illinois.  Spring is here.  It's Tax Day.  —  TOP TALKER  —  WHAT A ZOO: The White House's Department of Government Efficiency office has targeted a behavioral diversity program to be cut from Brookfield Zoo.",
    "url": "https://www.politico.com/newsletters/illinois-playbook/2025/04/15/doge-targets-brookfield-zoo-00290522"
  },
  {
    "text": "Senator Chuck Grassley grilled at Iowa town hall over ‘shameful’ Trump policies  —  The Republican, 91, was confronted by attendees angered over mass deportations and executive overreach  —  The Republican senator Chuck Grassley struggled to control a town hall meeting on Tuesday … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/15/chuck-grassley-town-hall"
  },
  {
    "text": "Kamala Harris for governor?  Poll shows how California voters feel about the idea.  —  California's Democratic voters cheer the potential of Harris for governor, but warning signs are lurking.  —  Political influencers in California are greeting Kamala Harris' potential bid for governor with a shrug … ",
    "url": "https://www.politico.com/news/2025/04/15/poll-voters-kamala-harris-governor-run-00290514"
  },
  {
    "text": "US Derails G-7 Condemnation of Russian Missile Strike on Ukraine  —  The US has told Group of Seven allies it won't endorse a statement condemning Russia's deadliest attack on Ukraine this year because it wants to keep negotiations with Moscow on track.  —  Russia fired two short-range … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-15/us-derails-g-7-condemnation-of-russian-missile-strike-on-ukraine"
  },
  {
    "text": "Two Dictators Walk Into a Bar...  No time to give it its due, what with the constitutional crisis, but we can't fully pass over Trump's wild assertion yesterday that Ukraine started the war with Russia: “You don't start a war against someone twenty times your size and then hope that people give you some missiles.”",
    "url": "https://www.thebulwark.com/p/two-dictators-walk-into-a-bar-trump-bukele-oval-office-abraham-lincoln-marc-thiessen"
  },
  {
    "text": "Exclusive: A Stronger Playbook For House Resistance  —  An internal memo shows Senate Democrats aren't the only ones who can gum up the works.  —  ∙ Paid  —  We stand perilously close to a point of no return, where mass action is the only form of opposition that might save the country.",
    "url": "https://www.offmessage.net/p/exclusive-a-stronger-playbook-for"
  },
  {
    "text": "Investors dodge U.S. dollar and Treasurys, scared by Trump's trade war  —  The dollar has lost almost 10 percent of its value since Inauguration Day with roughly half of that decline coming this month.  —  The U.S. dollar is an early casualty of President Donald Trump's us-against-the-world trade war.",
    "url": "https://www.washingtonpost.com/business/2025/04/15/dollar-investors-treasuries-safety/"
  },
  {
    "text": "Joint Task Force to Combat Anti-Semitism Statement Regarding Harvard University  —  Today, the Joint Task Force to Combat Anti-Semitism released the following statement:  —  “Harvard's statement today reinforces the troubling entitlement mindset that is endemic in our nation's … ",
    "url": "https://www.ed.gov/about/news/press-release/joint-task-force-combat-anti-semitism-statement-regarding-harvard-university"
  },
  {
    "text": "Trump donors eye potential bonanza if US succeeds with Greenland land-grab  —  Ethical doubts over role of campaign backers and investors with financial ties to president worth hundreds of millions  —  Some of Donald Trump's biggest campaign donors and investors, who collectively have hundreds … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/15/trump-greenland-donors-investors-finance"
  },
  {
    "text": "More Than 20,000 I.R.S. Employees Offer to Resign  —  The I.R.S. had about 100,000 employees before President Trump took office.  Between resignations and layoffs, the I.R.S. is on track to lose about a third of its staff this year.  —  About 22,000 employees at the Internal Revenue Service … ",
    "url": "https://www.nytimes.com/2025/04/15/us/politics/irs-resignations-trump.html"
  }
]