[
  {
    "text": "RFK Jr. forces out Peter Marks, FDA's top vaccine scientist  —  Marks, an architect of Operation Warp Speed, warned that a recent measles outbreak shows how confidence in science and public health is being “undermined.”  —  The Trump administration on Friday pushed out Peter Marks … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/28/rfk-jr-fda-vaccine-scientist-peter-marks/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzMTM0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0NTE2Nzk5LCJpYXQiOjE3NDMxMzQ0MDAsImp0aSI6ImY4NTk0MjBkLTkyYzUtNDYzZS1hOWNkLTAxZGZiOTIxNDM5NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI4L3Jmay1qci1mZGEtdmFjY2luZS1zY2llbnRpc3QtcGV0ZXItbWFya3MvIn0.ceXoDFKEOs6cJhrid_4Dpqcn5gKkKhuy7uuMw7TuBRU&itid=gfta"
  },
  {
    "text": "Top F.D.A. Vaccine Official Resigns, Citing Kennedy's ‘Misinformation and Lies’  —  Dr. Peter Marks, a veteran of the agency, wrote that undermining confidence in vaccines is irresponsible and a danger to public health.  —  The Food and Drug Administration's top vaccine official … ",
    "url": "https://www.nytimes.com/2025/03/28/health/fda-vaccines-rfk-jr-peter-marks.html?unlocked_article_code=1.7k4.68LK.jmdwzhmyp8uv&smid=url-share"
  },
  {
    "text": "Top Vaccine Official Out at FDA  —  In his resignation letter, Dr. Peter Marks cited ‘misinformation and lies’ from Health and Human Services Secretary RFK Jr.  —  The Food and Drug Administration's top vaccine official has been pushed out, according to people familiar with the matter.",
    "url": "https://www.wsj.com/politics/top-vaccine-official-out-at-fda-f39a5a16?st=KWBQgQ"
  },
  {
    "text": "The CDC Buried a Measles Forecast That Stressed the Need for Vaccinations  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Leaders at the Centers for Disease Control and Prevention ordered staff … ",
    "url": "https://www.propublica.org/article/measles-vaccine-rfk-cdc-report"
  },
  {
    "text": "Judges block Trump executive orders targeting law firms tied to Mueller probe  —  Two federal judges in separate rulings late Friday froze parts of President Donald Trump's executive orders targeting the law firms Jenner & Block and WilmerHale, both firms linked to the Robert Mueller investigation Trump has sought to punish.",
    "url": "https://cnn.com/2025/03/28/politics/law-firms-fighting-trump-executive-order"
  },
  {
    "text": "Two major law firms fight back against Trump orders seen as retribution  —  Two major law firms are suing the Trump administration.  They're asking a judge to block executive orders that punish them because of their clients and the lawyers that they hired.  —  AILSA CHANG, HOST:",
    "url": "https://www.npr.org/2025/03/28/nx-s1-5343616/two-major-law-firms-fight-back-against-trump-orders-seen-as-retribution"
  },
  {
    "text": "Hegseth Brought His Wife to Sensitive Meetings With Foreign Military Officials  —  Defense secretary's wife is a former Fox News executive.  His handling of sensitive information is under fire after he shared details about a strike on Houthi militants in a group chat on a commercial messaging platform.",
    "url": "https://www.wsj.com/politics/national-security/hegseth-brought-his-wife-to-sensitive-meetings-with-foreign-military-officials-c16db0ea?st=a9QEVq&reflink=share_mobilewebshare"
  },
  {
    "text": "Vance, citing threats from Russia and China, urges Greenland to ‘cut a deal’ with the U.S.  —  “When the president says 'We've got to have Greenland,' he's saying this island is not safe,” the vice president said.  —  Vice President JD Vance on Friday did not rule out using military action … ",
    "url": "https://www.politico.com/news/2025/03/28/vance-greenland-military-deal-00005407"
  },
  {
    "text": "Trump Commutes Ozy Media Founder's Sentence Just Before His Surrender  —  Carlos Watson, who started the now-defunct digital media company, had been sentenced to almost 10 years in prison for trying to defraud investors and lenders.  —  President Trump on Friday commuted the sentence of Carlos Watson … ",
    "url": "https://www.nytimes.com/2025/03/28/business/carlos-watson-ozy-media-trump.html?unlocked_article_code=1.7k4.es5N.DjBJhOK1VMNd&smid=url-share"
  },
  {
    "text": "Collision warning sounds in cockpit of Delta plane due to close call with Air Force jet near Reagan National Airport  —  A close call between a Delta Air Lines Airbus A319 taking off from Ronald Reagan Washington National Airport and a US Air Force T-38 jet, often used by the military for training … ",
    "url": "https://cnn.com/2025/03/28/us/delta-military-jet-close-call-dca"
  },
  {
    "text": "Musk's xAI buys Musk's X social media platform for $33 billion  —  Elon Musk's xAI artificial intelligence firm has acquired Musk's X, the social media outfit formerly known as Twitter for $33 billion.  —  The all-stock deal announced on Friday consolidates two of Musk's multiple portfolio companies … ",
    "url": "https://www.reuters.com/markets/deals/musks-xai-buys-social-media-platform-x-45-billion-2025-03-28/"
  },
  {
    "text": "Hegseth's younger brother is serving in a key role inside the Pentagon  —  Defense Secretary Pete Hegseth's younger brother is serving in a key position inside the Pentagon as a Department of Homeland Security liaison and senior adviser, Hegseth's office confirmed.",
    "url": "https://www.defensenews.com/pentagon/2025/03/28/hegseths-younger-brother-is-serving-in-a-key-role-inside-the-pentagon/"
  },
  {
    "text": "USAID terminates nearly all its remaining employees  —  The Trump administration is terminating nearly all of the remaining 900 employees of the United States Agency for International Development, in a final reduction-in-force.  —  Virtually no one will be spared, not even political appointees … ",
    "url": "https://www.npr.org/sections/goats-and-soda/2025/03/28/g-s1-56968/usaid-terminates-nearly-all-its-remaining-employees"
  },
  {
    "text": "RFK Jr. to gut vaccine promotion and HIV prevention office, sources say  —  The entire staff of the federal government's Office of Infectious Disease and HIV/AIDS Policy is expected to be laid off, multiple federal health officials told CBS News Friday.  The moves are part of a broader … ",
    "url": "https://www.cbsnews.com/news/rfk-jr-to-gut-vaccine-promotion-and-hiv-prevention-office-sources-say/"
  },
  {
    "text": "Appeals court clears way for Trump to fire leaders of ‘independent’ federal agencies  —  The ruling is a victory for Trump's effort to control regulatory bodies that Congress intended to operate with some independence.  —  A federal appeals court has cleared the way for President Donald Trump … ",
    "url": "https://www.politico.com/news/2025/03/28/appeals-court-ruling-trump-independent-federal-agencies-00258300"
  },
  {
    "text": "What is the Smithsonian, and why is President Trump unhappy with it?  —  President Donald Trump's executive order titled “Restoring Truth and Sanity to American History” targets the Smithsonian Institution — which has, he contends, “come under the influence of a divisive, race-centered ideology.”",
    "url": "https://apnews.com/article/smithsonian-trump-executive-order-e0132b9c865901ec702329b1f6e0c35e"
  },
  {
    "text": "Columbia University's President, Katrina Armstrong, Resigns  —  Katrina Armstrong is leaving the post a week after the university agreed to a list of demands from the White House.  —  Columbia University changed its president on Friday evening, one week after the university bowed to a series … ",
    "url": "https://www.nytimes.com/2025/03/28/us/columbia-universitys-president-resigns.html"
  },
  {
    "text": "Elon Musk stepping down from DOGE in May. Here's what he said  —  Elon Musk may be getting out of DOGE.  —  On Thursday, Musk said he plans to step down from his role in Donald Trump's administration this spring.  —  The head of Tesla and X owner said he plans on stepping down in May during … ",
    "url": "https://www.yahoo.com/news/elon-musk-stepping-down-doge-155302029.html"
  },
  {
    "text": "Federal judge blocks Trump from dismantling Consumer Financial Protection Bureau  —  A federal judge agreed Friday to block the Trump administration from dismantling the Consumer Financial Protection Bureau, an agency that was targeted for mass firings before the court's intervention.",
    "url": "https://apnews.com/article/trump-consumer-financial-protection-bureau-d091cfb0794813e40098a40e00a6d1c2"
  },
  {
    "text": "Judge releases detained Venezuelan couple with temporary protected status  —  The judge said the detention of the couple was baseless and unlawful.",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/03/28/judge-releases-detained-venezuelans-temporary-protected-status/"
  },
  {
    "text": "Trump Admin Spies on Social Media of Student Visa Holders  —  Ideological purge of foreign students revealed in new leaked directive  —  The Trump administration is requiring that foreign students studying in, or seeking to study in the United States, pass an ideological test in order to obtain a visa … ",
    "url": "https://www.kenklippenstein.com/p/exclusive-trump-admin-spies-on-social"
  },
  {
    "text": "Russian medical researcher at Harvard, who protested the Ukraine war, detained by ICE  —  Kseniia Petrova's attorney said her previous arrest in Russia and social media activity “will almost certainly ensure a nice, hefty jail sentence for her” if she is deported back.",
    "url": "https://www.nbcnews.com/news/us-news/russian-medical-researcher-harvard-protested-ukraine-war-detained-ice-rcna198528"
  },
  {
    "text": "Trump blocked from deporting migrants to countries where they're not citizens  —  A federal judge said deportees must first have a “meaningful opportunity” to seek humanitarian protection in the United States.  —  A federal judge in Boston issued a temporary emergency order blocking … ",
    "url": "https://www.washingtonpost.com/immigration/2025/03/28/judge-blocks-trump-deportations-migrants-other-countries/"
  },
  {
    "text": "Vance and top Trump advisers suggested firing Waltz  —  The national security adviser almost got fired.  He still might.  —  On Wednesday evening — following a brutal day of headlines surrounding the now-infamous Signal chat — Vice President JD Vance, chief of staff Susie Wiles … ",
    "url": "https://www.politico.com/news/2025/03/28/waltz-trump-vance-wiles-private-meeting-00258904"
  },
  {
    "text": "Winning: Notorious Venezuelan Illegal Alien ‘Influencer’ Repatriated  —  In another win for the Trump administration and the American people, an extremely annoying Venezuelan illegal immigrant, Leonel Moreno, has been sent back to Venezuela.  —  And boy, is the schadenfreude strong with this one.",
    "url": "https://redstate.com/wardclark/2025/03/28/winning-notorious-venezuelan-illegal-alien-influencer-repatriated-n2187229"
  },
  {
    "text": "Consumer sentiment worsens as inflation fears grow, University of Michigan survey shows … The deterioration in consumer sentiment was even worse than anticipated in March as worries over inflation intensified, according to a University of Michigan survey released Friday.",
    "url": "https://www.cnbc.com/2025/03/28/consumer-sentiment-worsens-as-inflation-fears-grow-university-of-michigan-survey-shows.html"
  },
  {
    "text": "Strong earthquake strikes central Myanmar, panic in Bangkok  —  A powerful earthquake killed more than 140 people in Myanmar on Friday, authorities said, toppling buildings and wrecking infrastructure across a wide area, including a skyscraper under construction in neighbouring Thailand.",
    "url": "https://www.reuters.com/world/asia-pacific/strong-earthquake-central-myanmar-panic-bangkok-2025-03-28/"
  },
  {
    "text": "UAW's Shawn Fain slams Trump executive order targeting federal unions  —  Shawn Fain, the president of the United Automobile Workers, assailed a new executive order signed this week by President Trump as an attack on federal workers.  —  He compared it to the 1981 air traffic controller strike … ",
    "url": "https://www.cbsnews.com/news/shawn-fain-uaw-face-the-nation/"
  },
  {
    "text": "DOGE Plans to Rebuild SSA Code Base in Months, Risking Benefits and System Collapse  —  Social Security systems contain tens of millions of lines of code written in COBOL, an archaic programming language.  Safely rewriting that code would take years—DOGE wants it done in months.",
    "url": "https://www.wired.com/story/doge-rebuild-social-security-administration-cobol-benefits/"
  },
  {
    "text": "Secretary of Defense Pete Hegseth's ‘kafir’ tattoo draws criticism.  What does it mean?  —  Hegseth has previously attracted attention over his many tattoos.  This time, new photos show that he has the word ‘kafir’ on his upper arm.  What does that mean and what do critics say it's indicating?",
    "url": "https://www.usatoday.com/story/news/politics/2025/03/27/pete-hegseth-tattoo-kafir/82696572007/"
  },
  {
    "text": "Trump admin offers Voice of America employees buyouts as judge blocks it from being shut down  —  Just as a federal judge issued an order blocking the administration's efforts to dismantle the broadcaster, U.S. Agency for Global Media staffers received an email offering them a renewed opportunity … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/voice-of-america-trump-restraining-order-b2723614.html"
  },
  {
    "text": "Conservative US appeals court judge knocks calls to impeach jurists  —  A conservative federal appeals judge who President Donald Trump considered a potential candidate for a U.S. Supreme Court nomination during his first term said impeaching judges was not the way to address court rulings with which parties disagreed.",
    "url": "https://www.reuters.com/legal/government/conservative-us-appeals-court-judge-knocks-calls-impeach-jurists-2025-03-28/"
  },
  {
    "text": "Harvard Dismisses Leaders of Center for Middle Eastern Studies  —  Interim Harvard Dean of Social Science David M. Cutler '87 dismissed the faculty leaders of the Center for Middle Eastern Studies on Wednesday, according to a faculty member familiar with the situation … ",
    "url": "https://www.thecrimson.com/article/2025/3/29/harvard-cmes-director-departure/"
  }
]