[
  {
    "text": "Live updates: President Joe Biden ends his 2024 bid  —  President Joe Biden says he's ready to return to the campaign trail, even as a growing chorus of Democratic lawmakers called for him to step aside.  —  Meanwhile, Donald Trump on Saturday held his first public campaign rally since … ",
    "url": "https://apnews.com/live/biden-trump-election-campaign-updates"
  },
  {
    "text": "Election 2024 live updates: Biden says he will end his re-election bid  —  President Joe Biden said he is stepping aside from the presidential race in a letter posted to X.  “It has been the greatest honor of my lift to serve as your president,” he wrote.  “And while it has been my intention … ",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/trump-biden-president-election-live-updates-rcna162646"
  },
  {
    "text": "Republicans could file challenges if Biden replaced, Speaker Johnson says  —  “Every state has its own system,” he said of election laws.  —  House Speaker Mike Johnson reiterated Sunday that any attempt by Democrats to sub in a new candidate in place of President Joe Biden is likely to be met by legal challenges.",
    "url": "https://www.politico.com/news/2024/07/21/biden-johnson-2024-elections-laws-00169973"
  },
  {
    "text": "GOP lawmakers call for Biden to resign presidency after dropout bombshell  —  Immediately after Joe Biden dropped the bombshell that he was dropping out of the presidential race, congressional Republicans started to openly call for him to resign from the White House now.",
    "url": "https://www.politico.com/live-updates/2024/07/21/joe-biden-drops-out-election/gop-calls-on-biden-to-resign-presidency-00169992"
  },
  {
    "text": "Biden drops out of 2024 presidential race  —  He struggled to recover from a disastrous debate and Democrats' doubts.  —  LIVE  —  President Joe Biden speaks alongside Prime Minister of the Czech Republic Petr Fiala before a bilateral meeting in the Oval Office of the White House, April 15, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-drops-2024-presidential-race/story?id=111648603"
  },
  {
    "text": "Election 2024 live updates  —  Biden steps aside as Democratic nominee, endorses Harris  —  President Biden is ending his presidential campaign, a momentous decision that upends the 2024 presidential race, and is endorsing Vice President Harris for the top of the ticket.",
    "url": "https://www.washingtonpost.com/elections/2024/07/21/election-2024-biden-trump-campaign-updates/"
  },
  {
    "text": "Trump favorability rises following shooting, majority of Americans want Biden to end campaign: POLL  —  More Americans also blame Trump for rise in political violence.  —  Republican presidential nominee and former President Donald Trump gives his acceptance speech at the Republican National Convention … ",
    "url": "https://abcnews.go.com/Politics/trump-favorability-rises-shooting-majority-americans-biden-end/story?id=112112043"
  },
  {
    "text": "Trump's edge over Biden takes notable leap in Michigan, new battleground state poll shows  —  An exclusive new Free Press poll of likely Michigan voters shows former President Donald Trump has taken a notable 7-percentage-point lead over incumbent President Joe Biden in the state … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/21/michigan-poll-trump-biden-polling/74488606007/"
  },
  {
    "text": "Election Live Updates: Trump, Leaving Unity Behind, Insults Biden, Who Remains Sidelined With Covid  —  President Biden wrote on social media that he was ending his campaign for re-election after intense pressure from within his own party.  He endorsed Vice President Kamala Harris to replace him atop the Democratic ticket.",
    "url": "https://www.nytimes.com/live/2024/07/21/us/trump-biden-election"
  },
  {
    "text": "Biden Drops Out of Race, Scrambling the Campaign for the White House  —  The president's withdrawal under pressure from fellow Democrats cleared the way for a new nominee to take on former President Donald J. Trump in the fall.  He quickly endorsed Vice President Kamala Harris.",
    "url": "https://www.nytimes.com/2024/07/21/us/politics/biden-drops-out.html?unlocked_article_code=1.800.jMyx.DWSPPbIWWCL_&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "How I Would Script This Moment for Biden and the Democrats  —  The Paley Center for Media just opened an exhibition celebrating the 25th anniversary of “The West Wing,” the NBC series I wrote from 1999 to 2003.  Some of the show's story points have become outdated in the last quarter-century … ",
    "url": "https://www.nytimes.com/2024/07/21/opinion/biden-west-wing-aaron-sorkin.html?unlocked_article_code=1.800.mJpZ.eTOV3Li2kEkN&smid=url-share"
  },
  {
    "text": "President Joe Biden drops out of 2024 presidential race  —  Biden, after a five-decade political career, faced a reckoning over his age and whether he could defeat Donald Trump.  His party now faces a historic effort to replace him.  —  WASHINGTON — President Joe Biden announced Sunday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/president-joe-biden-drops-2024-presidential-race-rcna159867"
  },
  {
    "text": "Since Leaving Butler, Trump Has Foregone the Best Medical Care and Is Withholding CT Scan Results  —  Fresh off his stunt calls for Joe Biden to be drug tested during the debate, Ronny Jackson — the lapsed doctor who turned the White House into a pill mill and covered up Trump's near-lethal COVID … ",
    "url": "https://www.emptywheel.net/2024/07/21/since-butler-trump-has-foregone-competent-medical-care-and-is-withholding-ct-scan-results/"
  },
  {
    "text": "Pulitzer-winning author Anne Applebaum: ‘Often, for autocrats, the second time in power is worse’  —  The journalist tells of her fears for democracy's future, the dangers of another Trump presidency and how her husband became Poland's foreign minister  —  A couple of years ago … ",
    "url": "https://www.theguardian.com/books/article/2024/jul/21/anne-applebaum-autocracy-inc-donald-trump-vladimir-putin-gaza-european-elections-propaganda-keir-starmer"
  },
  {
    "text": "‘I Guess This Is Normal Politics Now’  —  He had closed down the office of the Butler County Democrats and suspended local campaigning.  And nearly every hour since a 20-year-old man had tried to assassinate Donald Trump at a rally on the edge of town, Phil Heasley, a party co-chair … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/butler-pennsylvania-trump-shooting/679173/"
  }
]