[
  {
    "text": "Musk Is Going All In to Elect Trump  —  Elon Musk is planting himself in Pennsylvania, has brought his brain trust to help and may even knock on doors himself.  —  In the final weeks of the presidential campaign, the richest man in the world has involved himself in the U.S. election in a manner unparalleled in modern history.",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/elon-musk-donald-trump-pennsylvania.html?unlocked_article_code=1.RU4.hLOY.jvVZPOk1gLaB&smid=url-share"
  },
  {
    "text": "The One Thing Obama Got Wrong  —  Hey, you!  Yeah, I'm talking to you, you resident of Philadelphia, Pittsburgh, Detroit, or these cities' environs!  —  We're coming your way next week—come hang out with us!  And in the meantime: Happy Friday.  —  What Obama Said  —  by Bill Kristol",
    "url": "https://www.thebulwark.com/p/the-one-thing-obama-got-wrong"
  },
  {
    "text": "Obama admonishes Black men for hesitancy in supporting Harris  —  Former president suggests some in the Black community are uncomfortable voting for a woman and are coming up with excuses  —  PITTSBURGH — Former president Barack Obama on Thursday made a direct, impassioned plea to black men … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/10/obama-harris-rally-pittsburgh/"
  },
  {
    "text": "Battle for Swing States Is Tied, Trump Has Edge on Top Issues, WSJ Poll Shows  —  Voters prefer the Republican on economy and border security, but Harris still has a path to Electoral College win  —  WASHINGTON—Voters in the nation's seven battleground states see Donald Trump as better equipped … ",
    "url": "https://www.wsj.com/politics/elections/trump-harris-swing-state-poll-october-2024-c3ca9414?st=CEGcMA&reflink=desktopwebshare_permalink"
  },
  {
    "text": "What ‘The Apprentice’ Gets Exactly Right About Trump  —  “The Apprentice,” a new movie that dramatizes the early years of Donald Trump's career, ends with a scene between Mr. Trump and an actor who plays me.  The year is 1986 and I'm interviewing Mr. Trump for the first time, to begin ghostwriting … ",
    "url": "https://www.nytimes.com/2024/10/11/opinion/trump-movie-apprentice.html"
  },
  {
    "text": "Trump ghostwriter ‘deeply unsettled’ by evidence of ex-president's ‘psychopathy’  —  Donald Trump's ghostwriter for his myth-making memoir “The Art of the Deal” explained how the new film “The Apprentice” reveals how the former president's childhood trauma warped him into a “psychopath” … ",
    "url": "https://www.rawstory.com/tony-schwartz-trump-psychopathy/"
  },
  {
    "text": "Harris campaign launches ‘Souls to the Polls’ effort to turn out Black churchgoers as Election Day approaches  —  The get-out-the-vote program includes the creation of a faith advisory board.  —  Vice President Kamala Harris speaks at the National Baptist Convention on Sept. 8, 2022 in Houston.",
    "url": "https://abcnews.go.com/Politics/harris-campaign-launches-souls-polls-effort-turn-black/story?id=114655614"
  },
  {
    "text": "I'm Running Out of Ways to Explain How Bad This Is … The truth is, it's getting harder to describe the extent to which a meaningful percentage of Americans have dissociated from reality.  As Hurricane Milton churned across the Gulf of Mexico last night, I saw an onslaught … ",
    "url": "https://www.theatlantic.com/technology/archive/2024/10/hurricane-milton-conspiracies-misinformation/680221/?gift=bQgJMMVzeo8RHHcE1_KM0QW0K3DKS019CAwkgCJs0j8&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Michigan newspaper issues correction after Trump claims he won man of year award  —  A Michigan newspaper issued a correction after former President Trump cited the paper at a speech in Detroit, claiming he was Michigan's “Man of the Year” in 2023.  —  The former president pulled out a printout … ",
    "url": "https://thehill.com/homenews/4928489-trump-michigan-man-year-correction/"
  },
  {
    "text": "Cities seek more than $750K in unpaid bills for Trump campaign events since 2016  —  At least four cities and a county are still waiting to be reimbursed for costs associated with local law enforcement and first responders during Trump's visits.  —  Former President Donald Trump held … ",
    "url": "https://www.nbcnews.com/politics/2024-election/cities-seek-750k-unpaid-bills-trump-campaign-events-rcna174757"
  },
  {
    "text": "'He's Not Well': Trump's Bizarre Off-Topic Ramble Raises Alarm Over ‘Mental Capacity’  —  The former president jumped from topic to topic to topic during a stream-of-consciousness rant.  —  LOADING  —  Donald Trump's rambling speech at the Detroit Economic Club on Thursday at times veered … ",
    "url": "https://www.huffpost.com/entry/donald-trump-detroit-ramble_n_6708d8aae4b0c34b3eba97a4"
  },
  {
    "text": "Fox News's Cavuto: Trump hurricane ‘misinformation’ cannot be ‘tolerated’  —  Fox News anchor Neil Cavuto took a shot at former President Trump for spreading falsehoods about hurricane relief money for people in North Carolina, Florida and other states impacted by extreme weather in recent weeks.",
    "url": "https://thehill.com/homenews/media/4928371-fox-news-neil-cavuto-donald-trump-hurricane-fema-misinformation/"
  },
  {
    "text": "Vice President Kamala Harris on Her Race to the Finish  —  If politics is a game best played in temperate weather, Kamala Harris's arrival in Ripon, Wisconsin, on October 3 caught the luck of an unseasonably warm sun.  It's 71 degrees—by Wisconsin standards, summer—when Air Force Two touches … ",
    "url": "https://www.vogue.com/article/kamala-harris-digital-cover-october-2024-interview"
  },
  {
    "text": "Roger Stone Suggests Using ‘Armed Guards’ During Election in Secret Video  —  The Trump ally explains how to ensure the former president returns to office in undercover footage from liberal documentarian Lauren Windsor  —  DONALD TRUMP IS still mad he lost in 2020, and this year he and his allies … ",
    "url": "https://www.rollingstone.com/politics/politics-features/roger-stone-armed-guards-election-secret-audio-1235131014/"
  },
  {
    "text": "In Texas' Third-Largest County, the Far Right's Vision for Local Governing Has Come to Life  —  From cutting social services to changing election rules, Tarrant County Judge Tim O'Hare has pushed his agenda with an uncompromising approach.  His term offers a rare look at what happens … ",
    "url": "https://www.propublica.org/article/tarrant-county-judge-tim-ohare-far-right"
  },
  {
    "text": "James Carville on Aging, Edibles and His Anxieties About Harris … Mr. Carville was among the first prominent Democrats to urge Mr. Biden to drop out of the presidential race.  “I could have been embarrassed.  He could have run and won.  But it never occurred to me that I was wrong,” he said.",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/james-carville-harris-biden-trump.html"
  },
  {
    "text": "Vance, Given 5 Chances to Say Trump Lost in 2020, Takes None  —  In an interview with The New York Times, Senator JD Vance repeatedly refused to acknowledge Donald J. Trump's defeat and said he would not have certified the 2020 results.  —  Heading into the final three weeks of the 2024 election … ",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/vance-trump-2020-election-results.html"
  },
  {
    "text": "Mark Milley fears being court-martialed if Trump wins, Woodward book says  —  Retired US army general fears unusual action of being recalled to uniform for retribution, veteran reporter writes  —  Mark Milley, a retired US army general who was chair of the joint chiefs of staff under Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/11/bob-woodward-book-mark-milley-trump"
  },
  {
    "text": "Trump Aides Sought Enhanced Security for Closing Stages of Campaign  —  Susie Wiles, a top Trump campaign adviser, was in contact with the White House chief of staff and the head of the Secret Service seeking military assets and other steps.  —  Former President Donald J. Trump's campaign … ",
    "url": "https://www.nytimes.com/2024/10/11/us/politics/trump-campaign-security.html"
  },
  {
    "text": "When the Hurricane-Relief Worker Turns Out To Be a Neo-Nazi  —  Seizing on the politicization of the government response, white supremacist groups have turned out to help after recent storms in North Carolina and Florida in order to boost recruitment and burnish their image",
    "url": "https://www.wsj.com/us-news/hurricane-relief-misinformation-white-supremacists-85f3df64"
  },
  {
    "text": "Behind the Curtain: The Republican welfare state … - This helps explain the massive surge in government spending under Trump, his continued opposition to trade agreements, his scorn for GOP ideas to gut Social Security and Medicare, and his us-vs.-them rhetoric.  —  Trump saw what establishment Republicans missed:",
    "url": "https://www.axios.com/2024/10/11/trump-welfare-government-aid-social-security"
  },
  {
    "text": "The Problem With This Conspiracy Theory Is Reality  —  According to Tim Sheehy, the Republican nominee for the U.S. Senate in Montana, young people have been “indoctrinated” on the issue of abortion.  —  “Young people, listen up, they've been indoctrinated for too long.",
    "url": "https://www.nytimes.com/2024/10/11/opinion/republicans-indoctrination-college-young-voters.html"
  },
  {
    "text": "Scranton firefighters were not holding pro-Trump signs at rally  —  The Scranton Fire Department firefighters' union had nothing to do with several signs stating “Scranton Firefighters for Trump” held and displayed by members of the public at the former president's campaign event Wednesday in Scranton, the union announced on Facebook.",
    "url": "https://www.thetimes-tribune.com/news/scranton-firefighters-were-not-holding-pro-trump-signs-at-rally/article_9b65e850-8716-11ef-bd15-ebdbf6083192.html"
  }
]