[
  {
    "text": "Exclusive: Trump ground game in key states flagged as potentially fake  —  Data suggests canvassers linked to Elon Musk's America Pac falsely claimed to have visited homes of potential voters  —  Donald Trump's campaign may be failing to reach thousands of voters they hope to turn out in Arizona and Nevada … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/19/trump-campaign-leaked-data-voters-elon-musk"
  },
  {
    "text": "Exclusive: Pro-Trump group funded by Musk struggles with outreach targets, inflation of doorknocking figures  —  The political action committee funded by billionaire Elon Musk to help re-elect former U.S. President Donald Trump is struggling in some swing states to meet doorknocking goals … ",
    "url": "https://www.reuters.com/world/us/pro-trump-group-funded-by-musk-struggles-with-outreach-targets-inflation-2024-10-18/"
  },
  {
    "text": "What Elon Musk Really Wants  —  The Tesla and X mogul has long dreamed of redesigning the world in his own extreme image.  Trump may be his Trojan horse.  —  In Elon Musk's vision of human history, Donald Trump is the singularity.  If Musk can propel Trump back to the White House … ",
    "url": "https://www.theatlantic.com/books/archive/2024/10/donald-trump-is-elon-musks-trojan-horse/680309/"
  },
  {
    "text": "Western Wisconsin farmers say Van Orden behavior derailed meeting on agricultural policy … Two farmers from western Wisconsin are speaking out after a meeting last month on agricultural policy with Republican Rep. Derrick Van Orden was derailed by the congressman when he and his staff interrupted … ",
    "url": "https://wisconsinindependent.com/politics/western-wisconsin-farmers-van-orden-behavior-derailed-meeting-agricultural-policy/"
  },
  {
    "text": "America's gullibility crisis … In the last few weeks alone:  — MAGA influencers breathlessly spread the false claim that Vice President Kamala Harris used a teleprompter during her Univision town hall, which the X algorithm then promoted in its trending topics as fact.",
    "url": "https://www.axios.com/2024/10/19/musk-ackman-election-misinformation"
  },
  {
    "text": "JD Vance's Most Recent Comment About His Wife Having Three Kids Is Going Viral Because People Think It's Really, Really Creepy  —  “I've never heard a man refer to his kids as my wife's children.  That's insane.”  —  Michaela Bramwell— BuzzFeed  —  JD Vance is on my timeline yet again … ",
    "url": "https://www.huffpost.com/entry/jd-vance-wife-kids-comment_n_67129574e4b0e2b6e54bfb5a"
  },
  {
    "text": "Elon Musk's Fake Sites and Fake Texts Impersonating the Harris Campaign  —  There's deeply cynical and then there's things which might be illegal.  In the first category we have an Elon Musk-funded PAC microtargeting Jewish and Arab communities with diametrically opposed ads about Kamala Harris's support for Israel or Palestine.",
    "url": "https://talkingpointsmemo.com/edblog/elon-musks-fake-sites-and-texts-impersonating-the-harris-campaign"
  },
  {
    "text": "(5th LD) N. Korea decides to send around 10,000 soldiers to support Russia in Ukraine war: Seoul  —  (ATTN: UPDATES with response from NATO chief in paras 17-18)  —  South Korea's spy agency on Friday confirmed that North Korea has decided to send around 10,000 troops to support Russia … ",
    "url": "https://en.yna.co.kr/view/AEN20241018006856315"
  },
  {
    "text": "Microphone malfunction: Trump waits on stage for 18 minutes during ‘technical difficulties’  —  Donald Trump's rally in Detroit hit a snag on Friday night when the audio stopped working and the Republican presidential nominee passed the time walking around on the stage for about 18 minutes waiting for a fix.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/18/trump-microphone-problem-detroit/75742522007/"
  },
  {
    "text": "Obama: ‘You would be worried if your grandpa was acting’ like Trump  —  Former President Obama took a swipe at former President Trump's competence Friday, mocking the GOP nominee for his recent rhetoric.  —  “He called himself ‘the father IVF,’” Obama said during a rally in battleground Arizona.",
    "url": "https://thehill.com/homenews/campaign/4942571-barack-obama-donald-trump-competence-arizona/"
  },
  {
    "text": "Montana park ranger says Senate candidate Tim Sheehy lied about combat wound  —  Sheehy has claimed that he was wounded in Afghanistan, but ranger says he investigated accidental shooting in park in 2015  —  A former Montana park ranger has now publicly accused Tim Sheehy … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/19/tim-sheehy-gunshot-wound-montana-park-ranger"
  },
  {
    "text": "Here's why sex discrimination at work doesn't go away until women are in charge  —  New research reveals men pay little heed to women in mixed-sex teams  —  Single-sex teams are something for the football pitch, not the workplace.  It's not the 1950s.  Many studies show the benefits of mixed teams … ",
    "url": "https://www.theguardian.com/commentisfree/2024/oct/19/heres-why-sex-discrimination-at-work-doesnt-go-away-until-women-are-in-charge"
  },
  {
    "text": "Defense Secretary Tom Cotton?  Here's who could be in Trump's Cabinet.  —  Former President Donald Trump, who is in the throes of a tight campaign, has not engaged in formal conversations about a potential Cabinet.  But that hasn't stopped him from spitballing potential contenders during … ",
    "url": "https://www.politico.com/interactives/2024/potential-cabinets/trump-second-term-cabinet/"
  },
  {
    "text": "Trump considers bucking presidential transition system  —  The former president is busting presidential transition norms, with implications for government coordination, cybersecurity and transparency.  —  Former President Donald Trump is weighing a go-it-alone approach to presidential transition planning … ",
    "url": "https://www.politico.com/news/2024/10/18/trump-transition-distrust-feds-00184404"
  },
  {
    "text": "It Was Gross to Watch Trump Yuck It Up with Cardinal Dolan at the Al Smith Dinner  —  He seemed to be the only one who considered his remarks comedy.  —  Regulars at this here shebeen know that we have little or no use for Timothy Dolan, cardinal archbishop of the Diocese of New York.",
    "url": "https://www.esquire.com/news-politics/politics/a62651745/trump-cardinal-dolan-al-smith-dinner/"
  },
  {
    "text": "Polling a People: Survey Analysis of the Political and Policy Preferences of 2024's Jewish Electorate  —  Key Takeaways  —  Between October 5th and 9th of 2024, the Manhattan Institute polled a representative sample of 658 Jewish registered voters across the U.S. on their feelings … ",
    "url": "https://manhattan.institute/article/survey-analysis-of-political-and-policy-preferences-of-2024-jewish-electorate"
  },
  {
    "text": "Split-Ticket Voters Buoy Democrats in Key Senate Races  —  In the battleground state of Arizona and other important pockets of the country, polling suggests that voters backing the former president are eschewing Republican Senate candidates.  —  On matters of substance and style … ",
    "url": "https://www.nytimes.com/2024/10/19/us/politics/split-ticket-voters-trump-senate.html"
  },
  {
    "text": "A week before the election, Trump will hold his most unsettling spectacle yet  —  Trump's planned rally at Madison Square Garden will be the ultimate act of ego and the climax of his Hitlerian rhetoric  —  For the apotheosis of his entire “poisoning of the blood” campaign … ",
    "url": "https://www.theguardian.com/commentisfree/2024/oct/18/donald-trump-madison-square-garden-rally"
  },
  {
    "text": "Secretary of State Pete Buttigieg?  Here's who could be in Harris' Cabinet.  —  If Kamala Harris wins the election, she will likely approach the task of filling out her Cabinet and West Wing much like she did when she took over Joe Biden's campaign operation this summer.",
    "url": "https://www.politico.com/interactives/2024/potential-cabinets/harris-who-could-be-in-cabinet/"
  },
  {
    "text": "New evidence unsealed of how Trump's Jan. 6, 2021 rally was funded  —  Bart Jansen Josh Meyer Aysha BagchiUSA TODAY  —  WASHINGTON - A trove of new records released in the federal election-interference case against former President Donald Trump described how money was spent on Trump's … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/18/donald-trump-election-interference-case-new-evidence/75714784007/"
  },
  {
    "text": "The Ghosts of John Tanton  —  Climate change and anti-immigrant hate are colliding, foretelling a volatile future.  —  Reporting Highlights  — Tanton's Network: Today's contentious immigration debate is the construct of one man's effort to halt overpopulation, brace for climate change and preserve “European” culture.",
    "url": "https://www.propublica.org/article/john-tanton-far-right-extremism-environmentalism-climate-change"
  },
  {
    "text": "Trump's GOP Is Running on a Platform of Freeing Seditionists and Cop Assailants  —  I'm halfway done my first review of the materials Jack Smith released today.  —  All of us who have followed this have concluded there's not any new news (though the presentation of it reveals certain things about Smith's investigation).",
    "url": "https://www.emptywheel.net/2024/10/18/trumps-gop-is-running-on-a-platform-of-freeing-seditionists-and-cop-assailants/"
  },
  {
    "text": "Trump's campaign leans on climate change denial: Six misleading claims debunked  —  Former President Donald Trump and Vice President Kamala Harris are both campaigning on climate as the 2024 presidential race enters its final days.  —  While Harris has repeatedly referred to climate change as a … ",
    "url": "https://www.usatoday.com/story/news/factcheck/2024/10/19/donald-trump-climate-change-science-claims-debunked/75184149007/"
  }
]