[
  {
    "text": "From 9/11 to Benjamin Netanyahu: The world is learning that toxic masculinity can't keep us safe  —  Feminists have long warned about men who hide incompetence with belligerence — Israel proves them right  —  In his Oval Office address following the Oct. 7 attacks, President Joe Biden … ",
    "url": "https://www.salon.com/2023/11/02/from-911-to-benjamin-netanyahu-the-world-is-learning-that-masculinity-cant-keep-us-safe/"
  },
  {
    "text": "Donald Trump Jr. asked courtroom artist to make him ‘look sexy’ like an illustration of Sam Bankman-Fried  — “Make me look sexy,” Donald Trump Jr. told a courtroom illustrator after he finished testifying Thursday.  — The ex-president's son pointed out an image of Sam Bankman-Fried as inspiration.",
    "url": "https://www.businessinsider.com/donald-trump-jr-requests-sexy-courtroom-illustration-2023-11?op=1"
  },
  {
    "text": "Operation Dark Horse: Surprise entry in 2024 GOP race  —  has faced long odds before and won.  —  As an Air Force major and combat pilot, he helped end the military's reluctance to face up to the threat of electromagnetic pulse warfare and start building defenses of strategic bases.",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/operation-dark-horse-surprise-entry-in-2024-gop-race"
  },
  {
    "text": "Trump's Truth Social page is a riot of witness intimidation  —  Even his lawyers can't really defend it. … On August 6, Alabama man Arthur Ray Hanson, II, left a voicemail threatening Fulton County District Attorney Fani Willis with violence if she charged Donald Trump with interference in the 2020 election.",
    "url": "https://www.publicnotice.co/p/trump-witness-intimidation-gag-order-explained"
  },
  {
    "text": "‘You just gaslit her’: How Dean Phillips' first town hall went off the rails in N.H.  —  MANCHESTER, N.H. — Rep. Dean Phillips (D-Minn.) says he will host 119 town halls in his long-shot primary challenge against President Biden.  If the reception at his first is any indication of the next potential 118 … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/02/dean-phillips-town-hall-new-hampshire/"
  },
  {
    "text": "Minnesota Supreme Court grapples with Trump's eligibility to run in 2024  —  The court heard arguments on a constitutional provision that bars people from holding office if they engaged in insurrection.  —  Minnesota's top judges expressed skepticism on Thursday about the role of state courts … ",
    "url": "https://www.politico.com/news/2023/11/02/trump-ballot-eligibility-minnesota-00125123"
  },
  {
    "text": "Ivanka Trump Loses Court Fight to Block Her Testimony Next Week  —  The former president's daughter had better luck with her first appeal, which led to the dismissal of the claims against her  —  The former president's daughter Ivanka Trump lost her effort to pause her testimony on Wednesday … ",
    "url": "https://themessenger.com/politics/ivanka-trump-loses-must-testify-next-week"
  },
  {
    "text": "How Microsoft is making a mess of the news after replacing staff with AI  —  False claims that President Joe Biden fell asleep during a moment of silence for victims of the Maui wildfire.  A conspiracy theory that the latest surge in Covid-19 cases is being orchestrated by the Democratic Party ahead of the election.",
    "url": "https://www.cnn.com/2023/11/02/tech/microsoft-ai-news/"
  },
  {
    "text": "DeSantis Makes Cringey Attempt to Reclaim ‘Bootgate’ Narrative  —  For some reason, the 2024 hopeful offered to... wear a boot on his head at next week's GOP primary debate?  —  Republican presidential candidate Ron DeSantis on Thursday contributed to the seemingly never-ending discourse … ",
    "url": "https://www.thedailybeast.com/desantis-makes-cringey-attempt-to-reclaim-bootgate-narrative"
  },
  {
    "text": "Christie Makes New Hampshire Push to Revive Campaign: 'We're the Only Way to Stop Donald Trump'  —  The former New Jersey governor is hoping to pick up independents, who are eligible to vote in the Republican primary  —  Republican presidential candidate and former New Jersey Gov. Chris Christie … ",
    "url": "https://themessenger.com/politics/christie-makes-new-hampshire-push-to-revive-campaign-were-the-only-way-to-stop-donald-trump"
  },
  {
    "text": "Biden weighs border deal — altering asylum law for Ukraine aid  —  Republicans placed a political lighting rod of an issue squarely into the biggest legislative matter before Congress.  —  Top Biden officials are preparing Democratic lawmakers and immigration policy advocates for the likelihood … ",
    "url": "https://www.politico.com/news/2023/11/02/biden-ukraine-aid-deal-00125125"
  },
  {
    "text": "Students walk out of Hillary Clinton's Columbia class in protest after anti-Israel students exposed by ‘doxxing trucks’  —  Thirty students walked out of Hillary Clinton's class at Columbia University to “shame” the Ivy League school for how they perceive it allowed its students who signed … ",
    "url": "https://nypost.com/2023/11/02/metro/students-walk-out-of-hillary-clintons-columbia-class-in-protest/"
  },
  {
    "text": "Biden quietly tapped Obama to help shape his AI strategy  —  Former President Barack Obama advised the White House over the past five months on its plan to address artificial intelligence.  —  WASHINGTON — Former President Barack Obama quietly advised the White House over the past five months … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-quietly-tapped-obama-help-shape-ai-strategy-rcna123238"
  },
  {
    "text": "Court tosses EPA ban on pesticide linked to brain damage in kids  —  A federal appeals court on Thursday is tossing the Environmental Protection Agency's (EPA) ban on a pesticide that has been linked to brain damage in children.  —  The decision from the 8th Circuit Court of Appeals to send … ",
    "url": "https://thehill.com/policy/energy-environment/4291117-court-tosses-epa-ban-pesticide/"
  },
  {
    "text": "US Ports From New Jersey to Alaska Win $653 Million in Funding  — Forty-one projects across 26 states, territories won funding  — Largest awards to aid projects in California, Washington  —  The White House announced more than $653 million in awards for port infrastructure projects across … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-03/41-us-ports-from-new-jersey-to-alaska-win-653-million-in-funds"
  },
  {
    "text": "MAGA and Christian nationalism: Bigger threat to America than Hamas could ever be  —  Even Mitch McConnell is trying to push back against Mike Johnson and the MAGA lunatics.  It isn't working  —  The world inches closer to a war that only psychopaths want to see.",
    "url": "https://www.salon.com/2023/11/02/maga-and-christian-nationalism-bigger-to-america-than-hamas-could-ever-be/"
  },
  {
    "text": "New Zealand National Party Needs Two Partners to Govern  — National loses two seats in official election results  — Maori Party gains two seats to six, tripling number of MPs  —  New Zealand's National Party will need the support of two smaller parties to form a new government after losing two seats in final election results.",
    "url": "https://www.bloomberg.com/news/articles/2023-11-03/new-zealand-national-party-loses-two-seats-in-final-vote-count"
  },
  {
    "text": "Second woman sues Steven Tyler, alleging he sexually assaulted her when she was a teen  —  The woman alleges that Aerosmith frontman Steven Tyler sexually assaulted her twice in one day after they met when she was 17 in 1975.  —  A second woman has come forward with allegations … ",
    "url": "https://www.nbcnews.com/news/second-woman-sues-steven-tyler-alleging-sexually-assaulted-was-teen-rcna123397"
  },
  {
    "text": "I fought to get sober.  Political weaponization of my addiction hurts more than me.  —  My struggles and my mistakes have been fodder for a vile and sustained disinformation campaign against my father, President Joe Biden, and an all-out annihilation of my reputation.",
    "url": "https://www.usatoday.com/story/opinion/voices/2023/11/02/hunter-biden-addiction-substance-abuse-not-political-ploy/71332255007/"
  }
]