[
  {
    "text": "Health Update  —  With a heavy heart, I have to tell you that after a long battle with cancer my husband Kevin Drum passed away on Friday, March 7, 2025.  —  No public memorial services are planned.  —  In lieu of flowers, please donate to the charity or political cause of your choice.",
    "url": "https://jabberwocking.com/health-update-100/"
  },
  {
    "text": "Trump says a transition period for the economy is likely: 'You can't really watch the stock market' … WATCH NOW  —  President Donald Trump and other senior White House officials have spent the past several days bracing Americans for a potential economic slowdown that they say will then lead to stronger growth ahead.",
    "url": "https://www.cnbc.com/2025/03/10/trump-says-transition-period-likely-for-economy-and-you-cant-watch-the-stock-market.html"
  },
  {
    "text": "Be Prepared  —  Trump is sabotaging the economy, but we shouldn't assume public opinion will follow automatically.  —  ∙ Paid  —  Donald Trump has done rapid, serious damage to the U.S. economy, and the MAGA elite knows it.  —  Saturated as the Trump movement is in fantasies … ",
    "url": "https://www.offmessage.net/p/be-prepared"
  },
  {
    "text": "Top ‘Washington Post’ columnist resigns, accusing publisher of killing piece  —  A top political columnist for The Washington Post resigned today, accusing Post chief executive and publisher Will Lewis of killing her column that criticized owner Jeff Bezos's drive to overhaul the opinion pages to focus on his libertarian priorities.",
    "url": "https://www.npr.org/2025/03/10/nx-s1-5323136/washington-post-editor-ruth-marcus-resigns"
  },
  {
    "text": "Exclusive: Washington Post to overhaul newsroom structure  —  The Washington Post is making major changes to its newsroom that are meant to broaden the outlet's coverage and reach a wider audience, according to a staff memo from executive editor Matt Murray obtained by Axios.",
    "url": "https://www.axios.com/2025/03/10/washington-post-to-overhaul-newsroom-structure"
  },
  {
    "text": "Immigration agents arrest Palestinian activist who helped lead Columbia University protests  —  Federal immigration authorities arrested a Palestinian activist Saturday who played a prominent role in Columbia University's protests against Israel, a significant escalation in the Trump administration's pledge … ",
    "url": "https://apnews.com/article/columbia-university-mahmoud-khalil-ice-15014bcbb921f21a9f704d5acdcae7a8"
  },
  {
    "text": "Arrested Palestinian Columbia student moved to Louisiana jail as lawyers fight deportation effort  —  The Palestinian student activist at New York's Columbia University detained as part of U.S. President Donald Trump's crackdown on some anti-Israel protesters has been moved to a federal jail … ",
    "url": "https://www.reuters.com/world/arrested-palestinian-columbia-student-moved-louisiana-jail-lawyers-fight-2025-03-10/"
  },
  {
    "text": "Firm Targeted by Trump Over Clinton Campaign Work Hires Top Litigators  —  President Trump stripped Perkins Coie of access to federal buildings and personnel, citing its work for Hillary Clinton's 2016 campaign.  The firm hired Williams & Connolly, which is skilled in fighting the government, to represent it.",
    "url": "https://www.nytimes.com/2025/03/10/us/politics/trump-perkins-coie.html"
  },
  {
    "text": "Kash Patel inquires about private security detail, direct phone line to WH  —  FBI Director Kash Patel has inquired about replacing his FBI security detail with private guards, and has also asked about maintaining a direct phone line to the White House, including in his car, two FBI officials familiar with the matter told NBC News.",
    "url": "https://www.nbcnews.com/politics/politics-news/live-blog/live-updates-trump-government-shutdown-china-tariffs-labor-ukraine-rcna195479/rcrd74677"
  },
  {
    "text": "Deleted tweets show top State Department official spread false rumor about Rubio's sexuality, called him ‘low IQ’  —  A top acting State Department official deleted at least half a dozen tweets that ridiculed his now boss, Secretary of State Marco Rubio, including ones calling him “low IQ” … ",
    "url": "https://www.cnn.com/2025/03/10/politics/darren-beattie-marco-rubio-deleted-tweets-kfile"
  },
  {
    "text": "Over texts and ‘eyeball to eyeball,’ Republicans succeed in persuading Musk.  But Democrats hit dead ends  —  When a multi-million federal grant program for dairy businesses was shut down earlier this month in line with Elon Musk's Department of Government Efficiency push to downsize the government … ",
    "url": "https://www.cnn.com/2025/03/10/politics/republican-lawmakers-doge-musk-success/"
  },
  {
    "text": "Will Dems Pick Up Their Sword? … (Ed. Note: I go into a lot of detail below.  The bottom line is Democrats have about 48 hours to convince D senators to clip Elon's wings.  It's still totally doable.  But it has to happen in the next 48 hours.)  —  We're now down to the wire with the so-called “continuing resolution” fight.",
    "url": "https://talkingpointsmemo.com/edblog/will-dems-pick-up-their-sword"
  },
  {
    "text": "Ukraine Must Cede Territory in Any Peace Deal, Rubio Says  —  The secretary of state, heading to talks with Ukrainian officials in Saudi Arabia, said future talks with Moscow will be needed to determine what Russia is willing to give up to end the war.  —  Secretary of State Marco Rubio … ",
    "url": "https://www.nytimes.com/2025/03/10/us/politics/rubio-ukraine-russia.html"
  },
  {
    "text": "X down: Twitter not working amid major outage  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing.  Whether it's investigating the financials of Elon Musk's pro-Trump PAC … ",
    "url": "https://www.the-independent.com/tech/x-down-twitter-not-working-elon-musk-latest-b2712094.html"
  },
  {
    "text": "Musk Blames a ‘Massive Cyberattack’ on X for Series of Outages … Elon Musk blamed widespread disruptions on his social media platform X on a “massive cyberattack,” which he speculated was orchestrated by a “large, coordinated group” or country.  —  Tens of thousands of users globally … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-10/musk-s-x-experiences-intermittent-outages-across-the-globe"
  },
  {
    "text": "Musk Humiliated as Trump's Own Advisers Brutally Expose DOGE Fiasco  —  The rift between Elon Musk and Republicans is about to get worse.  The New York Times reports that in an extraordinary Oval Office meeting, President Trump's senior agency heads fought bitterly with Musk.",
    "url": "https://newrepublic.com/article/192509/musk-humiliated-trumps-advisers-brutally-expose-doge-fiasco"
  },
  {
    "text": "Trump-appointed judge quits judicial group over warning about threats  —  A prominent conservative U.S. appeals court judge resigned from the largest association of federal judges over its decision to speak out against a rise in criticism, threats and violence directed at the judiciary … ",
    "url": "https://www.reuters.com/legal/government/trump-appointed-judge-quits-judicial-group-over-warning-about-threats-2025-03-10/"
  },
  {
    "text": "Amazon to begin streaming Trump's ‘The Apprentice’  —  The show will be available on Prime Video for the first time, highlighting the close link between Trump's time as a reality TV personality and his two-time presidency.  —  Amazon has announced it will begin streaming “The Apprentice” … ",
    "url": "https://www.nbcnews.com/news/us-news/amazon-begin-streaming-trumps-apprentice-rcna195590"
  },
  {
    "text": "Dem Sen. Chris Murphy caught ‘cuddling’ on date with progressive media publisher — amid separation from his wife  —  WASHINGTON — Sen. Chris Murphy was spotted at a Washington, DC, watering hole on a date with a progressive media mogul and strategist who's boosted his efforts as a leading anti … ",
    "url": "https://nypost.com/2025/03/10/us-news/dem-sen-chris-murphy-caught-cuddling-on-date-with-progressive-media-publisher/"
  },
  {
    "text": "DOGE hunts for ‘wins’ amid tensions with Trump administration, backlash  —  As turmoil spills into public view, Elon Musk's DOGE is racing to finish slashing federal bureaucracy and move on to the more constructive work of building digital tools for the government.",
    "url": "https://www.washingtonpost.com/technology/2025/03/10/doge-musk-rebrand-trump-conflicts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNTc5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyOTYxNTk5LCJpYXQiOjE3NDE1NzkyMDAsImp0aSI6ImNhNmE4MmRjLWZkZTYtNDdjYy04MmYxLTc2OTE1NDJkYjlhZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDMvMTAvZG9nZS1tdXNrLXJlYnJhbmQtdHJ1bXAtY29uZmxpY3RzLyJ9.eyRbbkRGqCmc3KPzZCA3phDNCPoIiUN7npfFF4BRY1o&itid=gfta"
  },
  {
    "text": "At SXSW, Bluesky CEO Jay Graber pokes fun at Mark Zuckerberg with Latin phrase T-shirt  —  When Bluesky CEO Jay Graber walked on stage at SXSW 2025 for her keynote discussion, she wore a large black T-shirt with her hair pulled back into a bun.  At first glance, it might appear … ",
    "url": "https://techcrunch.com/2025/03/10/at-sxsw-bluesky-ceo-jay-graber-pokes-fun-at-mark-zuckerberg-with-latin-phrase-t-shirt/"
  },
  {
    "text": "Trump's Call to Scrap ‘Horrible’ Chip Program Spreads Panic  —  The president's attack on the key tenet of the Biden administration's industrial policy has set off concerns that he may claw back its funding.  —  As President Trump addressed Congress last week, he veered off script to attack … ",
    "url": "https://www.nytimes.com/2025/03/10/technology/trump-chips-act.html"
  },
  {
    "text": "Trans punk star Laura Jane Grace sings at Bernie Sanders rally, infuriating right-wingers  —  Trans punk rock star Laura Jane Grace made a surprise appearance at a Bernie Sanders rally recently, infuriating the usual anti-trans, right-wing brigade who were quick to take to social media to denounce her performance.",
    "url": "https://www.thepinknews.com/2025/03/10/laura-jane-grace-bernie-sanders/"
  },
  {
    "text": "Former Social Security official describes hostile takeover by Musk team  —  DOGE officials also put millions of taxpayers' private data at risk and refused to say why they needed access to it, the official says.  —  Just now  —  They came in aggressively, a former official … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/10/musk-social-security-data-doge-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNTc5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyOTYxNTk5LCJpYXQiOjE3NDE1NzkyMDAsImp0aSI6ImJmYWUxYTQxLTdhOTMtNDlmYi04ZGQyLWUzOTVmZjAzZjBhMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzEwL211c2stc29jaWFsLXNlY3VyaXR5LWRhdGEtZG9nZS10cnVtcC8ifQ.AlPKblxerWCHfgWFayOk_oCfKLDV7omsOVDsIL03bno&itid=gfta"
  },
  {
    "text": "Veterans Administration therapists forced to provide mental health counseling in open cubicles  —  As part of the Trump administration's frenzied push to end remote work arrangements for federal government workers, the Veterans Administration (VA) is forcing therapists to provide mental health counseling in open cubicles.",
    "url": "https://popular.info/p/veterans-administration-therapists"
  },
  {
    "text": "At Harvard Talk, Former Israeli PM Joked He Would Give Exploding Pagers to Protesters  —  Former Israeli Prime Minister Naftali Bennett joked to hundreds of people about sending explosive devices to dissenting event attendees at a talk at the Harvard Business School on Thursday, according to six people present at the discussion.",
    "url": "https://www.thecrimson.com/article/2025/3/10/naftali-bennett-hbs-talk/"
  },
  {
    "text": "Trump's Jan. 6 pardon doesn't cover rioter's plot to kill FBI agents, judge rules  —  A federal judge ruled that Jan. 6 rioter Edward Kelley's actions after his initial arrest were “separated from the defendant's conduct in the D.C. Case by years and miles.”",
    "url": "https://www.nbcnews.com/politics/justice-department/trumps-jan-6-pardon-doesnt-cover-rioters-plot-kill-fbi-agents-judge-ru-rcna195673"
  },
  {
    "text": "The Road from ‘Citizens United’ to Trump, Musk, and Corruption  —  WHAT HAPPENS WHEN a greedy geezer with the most powerful job in the world cements himself to a greedy grabber who is the richest man in the world?  You get Donald Trump, Elon Musk, and a superpower emeritus about ready to be stripped for parts.",
    "url": "https://www.thebulwark.com/p/the-road-from-citizens-united-to-trump-musk-and-corruption-campaign-finance-supreme-court"
  },
  {
    "text": "U.S. Energy Secretary Pledges to Reverse Focus on Climate Change  —  To applause from oil and gas executives, Chris Wright said natural gas was preferable to renewable energy and climate change was a “side effect of building the modern world.”  —  Before a packed crowd of oil and gas executives on Monday … ",
    "url": "https://www.nytimes.com/2025/03/10/climate/energy-secretary-climate-change-fossil-fuels.html"
  },
  {
    "text": "New Data: Republican Voters Want Authoritarianism  —  1. Values Voters  —  Why did a plurality of voters choose Trump?  —  The question is a Rorschach.  The most complete answer is that voters chose him for all the reasons.  Seventy-seven million people voted for the guy.",
    "url": "https://www.thebulwark.com/p/new-data-republican-voters-want-authoritarianism"
  }
]