[
  {
    "text": "Republican battleground-state legal blitz falters ahead of election  —  Donald Trump's Republican allies have suffered a string of courtroom setbacks in battleground U.S. presidential election states as Election Day draws closer, losses which could boost voter turnout and speed certification of the eventual winner.",
    "url": "https://www.reuters.com/world/us/republican-battleground-state-legal-blitz-falters-ahead-us-presidential-election-2024-10-27/"
  },
  {
    "text": "Trump-aligned group is already planning lawsuits over election results  —  A Trump-aligned group that has filed lawsuits in several swing states challenging voter registration lists is already planning to sue over this year's election results, one of the group's founders told USA TODAY.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/27/election-result-lawsuits-planned/75828364007/"
  },
  {
    "text": "Kamala Harris says her first priority as president is to “stop this pain” resulting from abortion bans  —  The Beyoncé song “Freedom” has become Kamala Harris' anthem - and it was a message the vice president took to the campaign trail, as CBS News traveled with Harris over two days … ",
    "url": "https://www.cbsnews.com/news/kamala-harris-on-abortion-first-priority-as-president-restoring-roe-v-wade/"
  },
  {
    "text": "Ex-WaPo Editor: This Is a Straight Bezos-Trump ‘Quid Pro Quo’  —  DIRTY DEAL  —  Robert Kagan tells the Daily Beast that Donald Trump's meeting with Blue Origin executives the day its founder Jeff Bezos killed his paper's Kamala Harris endorsement is proof of a backroom deal.  —  EXCLUSIVE",
    "url": "https://www.thedailybeast.com/ex-washington-post-editor-robert-kagan-this-is-a-straight-jeff-bezos-donald-trump-quid-pro-quo/"
  },
  {
    "text": "Harris regains slight lead nationally yet Electoral College holds the cards: POLL  —  Harris has regained a slight lead with likely voters nationally, the poll finds.  —  Democratic presidential nominee Vice President Kamala Harris speaks at a campaign rally at James R. Hallford Stadium, Oct. 24, 2024, in Clarkston, Ga.",
    "url": "https://abcnews.go.com/Politics/harris-regains-slight-lead-nationally-electoral-college-holds/story?id=115083875"
  },
  {
    "text": "Why Is Trump Holding a Rally at Madison Square Garden?  —  New York is not exactly a battleground state.  Here are five reasons Donald J. Trump is holding a rally there in the final days of the presidential campaign.  —  When former President Donald J. Trump decided to take a day off … ",
    "url": "https://www.nytimes.com/2024/10/26/us/politics/trump-rally-madison-square-garden.html"
  },
  {
    "text": "October 26, 2024  —  Beginning in 1943, the War Department published a series of pamphlets for U.S. Army personnel in the European theater of World War II.  Titled Army Talks, the series was designed “to help [the personnel] become better-informed men and women and therefore better soldiers.”",
    "url": "https://heathercoxrichardson.substack.com/p/october-26-2024"
  },
  {
    "text": "It has fallen to me, the humor columnist, to endorse Harris for president  —  Isn't this what a newspaper is supposed to do?  —  The Washington Post is not bothering to endorse a candidate in the 2024 presidential election.  (Jeff Bezos, the founder of Blue Origin and the founder … ",
    "url": "https://www.washingtonpost.com/opinions/2024/10/26/washington-post-endorses-kamala-harris-satire/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5OTE1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMzAxMTk5LCJpYXQiOjE3Mjk5MTUyMDAsImp0aSI6IjZmNDVhNGI3LTk2NzUtNDQ2Ny1hOTE1LTJlOTc4YWI4YWFmMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEwLzI2L3dhc2hpbmd0b24tcG9zdC1lbmRvcnNlcy1rYW1hbGEtaGFycmlzLXNhdGlyZS8ifQ.-e7OOyCCBjp8Hw059JyTEdGNCsm5REJ6MeNHgnETEnI&itid=gfta"
  },
  {
    "text": "Trust, Bewilderment and Billionairedom: Understanding the Backlash Against Bezos  —  It's part of the stock in trade of liberal American discourse: threatening or claiming to cancel a subscription to this or that once-revered journalistic institution in response to bad behavior, bad reporting … ",
    "url": "https://talkingpointsmemo.com/edblog/trust-bewilderment-and-billionairedom-understanding-the-backlash-against-bezos"
  },
  {
    "text": "Who won the day?  Harris  —  For at least a couple hours Friday, Kamala Harris assembled a rally star-studded enough to drown out the growing chorus of doubters in her own party.  Those in the crowd wore light-up bracelets flashing red, white and blue, and the screens above the stage read … ",
    "url": "https://www.politico.com/live-updates/2024/10/25/2024-elections-live-coverage-updates-analysis/who-won-the-day-00185667"
  },
  {
    "text": "Texas poll worker assaulted during early voting  —  An election clerk in San Antonio was allegedly assaulted late Thursday and the suspect, a voter, was arrested, officials said.  —  The suspect was arrested on suspicion of injury to an elderly person, a felony.",
    "url": "https://www.alternet.org/poll-worker/"
  },
  {
    "text": "More than 1,000 faith leaders endorse Harris as vice president leans on her faith to turn out Black voters  —  More than a thousand religious leaders endorsed Kamala Harris on Sunday, bolstering the Democratic presidential nominee's push to emphasize how faith is informing her campaign ahead of next week's election.",
    "url": "https://www.cnn.com/2024/10/27/politics/faith-leaders-harris-endorsement/"
  },
  {
    "text": "Democracy |  As Fascism Looms, the Free Press Must Stand and Report in the Breach  — Click to email a link to a friend (Opens in new window)  —  It was a cool, dark night in Berlin on May 10, 1933, as a mob of white Nazi college students pulled thousands of “subversive” … ",
    "url": "https://www.mississippifreepress.org/democracy-as-fascism-looms-the-free-press-must-stand-and-report-in-the-breach/"
  },
  {
    "text": "A growing number of Americans are concerned with Trump's age, but still not as many who worried about Biden  —  Voters did not have the same concerns about age for Kamala Harris  —  Your support helps us to tell the story  —  This election is still a dead heat, according to most polls.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-age-voters-mental-health-b2636214.html"
  },
  {
    "text": "Vance says Russian election interference is ‘bad’ but not worth a response  —  Republican vice presidential nominee Sen. J.D. Vance (R-OH) condemned a Russia-funded video circulating online that purports to capture a person tearing up ballots in the critical battleground state of Pennsylvania … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3204898/vance-says-russian-election-interference-bad-not-worth-a-response/"
  },
  {
    "text": "Florida Democrat Blasts Republican Sen. Rick Scott Over State's Home Insurance Crisis  —  Debbie Mucarsel-Powell is hoping voters make the connection between Scott's eight years as governor and the escalating cost of home insurance.  —  LOADING  —  Wetter, more destructive hurricanes … ",
    "url": "https://www.huffpost.com/entry/florida-home-insurance-rick-scott-debbie-murcarsel-powell-climate-change_n_671bfc03e4b0fdf4fef462e7"
  }
]