[
  {
    "text": "Biden's polling denial: Why he doesn't believe he's behind … - That bedrock belief has informed Biden's largely steady-as-she-goes campaign — even as many Democrats outside the White House are agitating for the campaign to change direction, given that Biden is polling well behind where he was four years ago.",
    "url": "https://www.axios.com/2024/05/14/biden-polls-denial-trump-2024-election"
  },
  {
    "text": "Trump blasts his trial judges.  Then his fans call for violence  —  When Donald Trump attacks the integrity of judges hearing cases against him, his followers often respond with posts urging that the jurists be beaten, tortured and killed.  —  On a recent Tuesday morning … ",
    "url": "https://www.reuters.com/investigates/special-report/usa-election-threats-courts/"
  },
  {
    "text": "Top House Democrat demands answers on Trump dinner with oil executives - live  —  Jamie Raskin writes to nine executives after report says Trump promised to repeal regulations if they each gave $1bn to campaign  —  Top House Democrat demands answers from oil executives after report on Trump dinner",
    "url": "https://www.theguardian.com/us-news/live/2024/may/14/mike-johnson-trump-trial-congress-politics-updates"
  },
  {
    "text": "Mike Johnson acts as proxy for ‘friend’ Trump as he bashes judge's daughter and ‘sham trial’ outside court  —  The Republican speaker's defense of Trump comes in the midst of Michael Cohen's testimony  —  Republican House Speaker Mike Johnson vocally defended former president Donald Trump outside … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-mike-johnson-cohen-trial-b2544905.html"
  },
  {
    "text": "Live Updates: Defense Tries to Cast Cohen as Motivated by Vengeance Against Trump  —  Michael D. Cohen, the key witness in Donald J. Trump's criminal trial, is under tough questioning by the defense.  He has described buying the silence of a porn star and his reimbursement by Mr. Trump, which is at the center of the charges.",
    "url": "https://www.nytimes.com/live/2024/05/14/nyregion/trump-trial-news-michael-cohen"
  },
  {
    "text": "DOJ requests judge order Steve Bannon to begin prison sentence  —  An appeals court upheld Bannon's contempt of Congress conviction last week.  —  Steve Bannon, former adviser to Donald Trump, speaks at the Turning Point Action conference in West Palm Beach, Fla., July 16, 2023.",
    "url": "https://abcnews.go.com/Politics/doj-requests-judge-order-steve-bannon-begin-prison/story?id=110209704"
  },
  {
    "text": "Biden Hits Chinese Electric Vehicles, Chips and Other Goods With Higher Tariffs  —  The president announced increased taxes on Chinese imports in strategic industries, building on former President Donald J. Trump's tariffs.  —  President Biden announced on Tuesday a sharp increase in tariffs … ",
    "url": "https://www.nytimes.com/2024/05/14/us/politics/biden-china-tariffs.html"
  },
  {
    "text": "Teen gunman who ‘sprayed DC neighborhood with 26 rounds from an AR-15’ is released on bail by self-confessed ‘woke’ judge  — Judge Lloyd Nolan Jr. sparked backlash after freeing Amonte Moody, 18  — Moody is accused of spraying a sleepy neighborhood with bullets from an AR-15",
    "url": "https://www.dailymail.co.uk/news/article-13413621/teen-gunman-washington-dc-ar-15-bail-soros-judge-nolan.html"
  },
  {
    "text": "Nazi Stormtrooper Slogan Lands AfD's Hoecke With Fine  — German far-right politician found guilty in trial over speech  — Hoecke tells court his prosecution is politically motivated  —  One of the most prominent regional leaders of the far-right Alternative for Germany party was found guilty of using a Nazi slogan.",
    "url": "https://www.bloomberg.com/news/articles/2024-05-14/german-far-right-politician-convicted-in-trial-over-nazi-slogan"
  },
  {
    "text": "NFL player rips Biden for ‘murder of innocent babies’ at college commencement speech  —  Kansas City Chiefs kicker Harrison Butker criticized President Joe Biden during a commencement speech at Benedictine College on Saturday.  —  Butker, an outspoken and devout Catholic … ",
    "url": "https://www.washingtonexaminer.com/news/3002728/nfl-player-rips-biden-for-murder-of-innocent-babies-at-college-commencement-speech/"
  },
  {
    "text": "Fox News and the MAGA media are lining up their shot at American democracy  —  With the presidential election less than half a year away, evidence is everywhere that the right is planning to end the American experiment in representative government if it fails to legitimately return Donald Trump to the White House.",
    "url": "https://www.mediamatters.org/fox-news/fox-news-and-maga-media-are-lining-their-shot-american-democracy"
  },
  {
    "text": "Clarence Thomas Hates the “Hideous Place” That Made Him Rich  —  Supreme Court justices are not above shaping their own public images.  Many of them write books, either biographies about their own lives or general treatises about their view on the law.  They often speak to law students … ",
    "url": "https://newrepublic.com/article/181538/clarence-thomas-hideous-washington-made-rich"
  },
  {
    "text": "Gaza: Israelis Attacking Known Aid Worker Locations  —  End Unlawful Attacks, Ensure Accountability  —  Israeli forces have carried out at least eight strikes on aid workers' convoys and premises in Gaza since October 2023, even though aid groups had provided their coordinates … ",
    "url": "https://www.hrw.org/news/2024/05/14/gaza-israelis-attacking-known-aid-worker-locations"
  },
  {
    "text": "Judge rejects Hunter Biden's bid to delay his June trial on federal gun charges  —  Hunter Biden's federal gun case will go to trial next month, a judge said Tuesday, denying a bid by lawyers for the president's son to delay the prosecution.  U.S. District Judge Maryellen Noreika rejected … ",
    "url": "https://apnews.com/article/hunter-biden-trial-firearms-charges-f7e30bff8d0e96e850fa17c67fc13eb6"
  },
  {
    "text": "Lawyer: Stormy Daniels Wore A Bulletproof Vest To Court For Trump Trial Testimony … LOADING",
    "url": "https://www.huffpost.com/entry/stormy-daniels-bulletproof-vest-trump-testimony_n_66438039e4b0d915e0fba30b"
  },
  {
    "text": "Even When a Cop Is Killed With an Illegally Purchased Weapon, the Gun Store's Name Is Kept Secret  —  Under the Gun: How Gun Violence Is Impacting the Nation  —  As America emerged from the pandemic, communities continued to experience a rising tide of gun violence.",
    "url": "https://www.propublica.org/article/guns-chicago-police-ella-french-indiana-tiahrt-amendment"
  },
  {
    "text": "Mike Johnson expected to join Trump at N.Y. criminal trial … - North Dakota Gov. Burgum, a Trump VP contender, is also expected in court on Tuesday, Axios has learned.  — So is fellow VP contender Vivek Ramaswamy, his spokesperson confirmed to Axios on Monday.",
    "url": "https://www.axios.com/2024/05/14/mike-johnson-new-york-trump-criminal-trial"
  }
]