[
  {
    "text": "Exclusive: Trump to sign order Thursday aimed at eliminating Education Department  —  Trump will direct his education secretary, Linda McMahon, to take ‘all necessary steps to facilitate the closure of the Department of Education.’  —  Joey Garrison Zachary SchermeleUSA TODAY",
    "url": "https://www.usatoday.com/story/news/education/2025/03/19/trump-eliminate-education-department-order/82235735007/?taid=67db3cffea562000016a0b1f"
  },
  {
    "text": "Trump is seeking to deport another academic who is legally in the country, lawsuit says  —  Badar Khan Suri, a fellow at Georgetown, says he is being punished because of the suspected views of his wife, a U.S. citizen with Palestinian heritage.  —  A Georgetown University researcher … ",
    "url": "https://www.politico.com/news/2025/03/19/trump-deportation-georgetown-graduate-student-00239754"
  },
  {
    "text": "Scoop: Schumer faces growing House Dem calls to step down  —  Senate Minority Leader Chuck Schumer (D-N.Y.) is facing more calls to step aside than have previously been reported, with the possibility of more soon to come, Axios has learned.  —  Why it matters: No senators have called for Schumer to step down.",
    "url": "https://www.axios.com/2025/03/19/chuck-schumer-house-democrat-calls-step-down"
  },
  {
    "text": "I'm the Canadian who was detained by Ice for two weeks.  It felt like I had been kidnapped  —  I was stuck in a freezing cell without explanation despite eventually having lawyers and media attention.  Yet, compared with others, I was lucky  —  There was no explanation, no warning.",
    "url": "https://www.theguardian.com/us-news/2025/mar/19/canadian-detained-us-immigration-jasmine-mooney"
  },
  {
    "text": "Musk Donates to G.O.P. Members of Congress Who Support Impeaching Judges  —  Amid a controversy over whether President Trump will abide by court rulings, Elon Musk gave the maximum to the campaigns of Republicans who back ousting judges who impede the administration.",
    "url": "https://www.nytimes.com/2025/03/19/us/politics/musk-donations-congress-judges.html?unlocked_article_code=1.5E4.VADz.hdASSaebxU33&smid=bs-share"
  },
  {
    "text": "Europe looks to poach US researchers as Trump cuts funding  —  Twelve EU capitals want programs to bring over American scholars.  —  A group of European countries is devising a strategy to poach researchers in the United States in response to American government cuts in education and research.",
    "url": "https://www.politico.eu/article/europe-us-research-education-donald-trump-ekaterina-zaharieva/"
  },
  {
    "text": "Columbia Is Nearing Agreement to Give Trump What He Wants  —  The school faces a deadline to yield to administration demands, with $400 million in federal funding at stake  —  Columbia University is getting close to yielding to President Trump's demands in negotiations to restore $400 million … ",
    "url": "https://www.wsj.com/us-news/education/columbia-is-nearing-agreement-to-give-trump-what-he-wants-14315bb3?st=Qdpxz1&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Emails Reveal Top IRS Lawyer Warned Trump Firings Were a “Fraud” on the Courts  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  On Feb. 20, nearly 7,000 probationary employees … ",
    "url": "https://www.propublica.org/article/trump-irs-firings-doge-fraud-law-job-performance"
  },
  {
    "text": "Jury Orders Greenpeace to Pay Pipeline Company More Than $660 Million  —  The environmental group had said the lawsuit, over its role in a protest movement, could mean an end to its operations in the United States.  —  A North Dakota jury on Wednesday awarded damages totaling more than $660 million … ",
    "url": "https://www.nytimes.com/2025/03/19/climate/greenpeace-energy-transfer-dakota-access-verdict.html"
  },
  {
    "text": "Immigrant rights activist's arrest marks big shift in enforcement  —  The arrest of a longtime immigrant rights activist — who made national headlines when she took sanctuary in a Denver church during President Trump's first term — has rattled advocates and immigrants across the country.",
    "url": "https://www.axios.com/2025/03/19/immigrant-activist-arrest-jeanette-vizguerra-trump"
  },
  {
    "text": "Trump-Musk Scandal on Ukrainian Kids Stolen by Russia Just Got Darker  —  Update: CNN reports that the State Department is now confirming cancellation of the contract tracking abducted Ukrainian kids, claiming it's not in U.S. interests.  Also, a State Department spokesperson said the data … ",
    "url": "https://newrepublic.com/article/192924/trump-musk-scandal-ukrainian-kids-stolen-russia"
  },
  {
    "text": "Trump-appointed prosecutor's office drops assault case against Enrique Tarrio  —  Ryan J. Reilly and Ted Oberg  —  The U.S. Attorney's for the District of Columbia has dropped an assault case against Enrique Tarrio, the Proud Boys member who was serving 22 years in federal prison following … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-administration-russia-ukraine-putin-zelenskyy-doge-immigration-rcna196781/rcrd75235?canonicalCard=true"
  },
  {
    "text": "DOGE official takes a leadership role at USAID, an agency Musk's team has helped dismantle  —  A senior official at Elon Musk's Department of Government Efficiency is taking a leadership role at the U.S. Agency for International Development, according to an email obtained by The Associated Press … ",
    "url": "https://apnews.com/article/usaid-doge-musk-trump-state-department-b04f4fe0d9c9c0475d337282ec69b3a0"
  },
  {
    "text": "Menaced by Trump, Canada Prepares to Join E.U. Military Industry Buildup  —  Canada's draft deal to participate in Europe's defense industry will bring contracts to Canadian manufacturers and help lessen dependence on the United States.  —  Canada is in advanced talks with the European Union … ",
    "url": "https://www.nytimes.com/2025/03/19/world/canada/canada-eu-military-industry-trump.html?unlocked_article_code=1.5E4.SuMZ._0pgVzy-RXbn&smid=url-share"
  },
  {
    "text": "With Orders, Investigations and Innuendo, Trump and G.O.P. Aim to Cripple the Left  —  The president and his allies in Congress are targeting the financial, digital and legal machinery that powers the Democratic Party and much of the progressive political world.  —  Executive actions intended to cripple top Democratic law firms.",
    "url": "https://www.nytimes.com/2025/03/19/us/politics/trump-republicans-attack-democrats-actblue.html?unlocked_article_code=1.5E4.AHkx.wn_vYh7OIbeu&smid=bs-share"
  },
  {
    "text": "Germany updates US travel advice after citizens detained  —  Germany updated its travel advisory for the United States to emphasise that a visa or entry waiver does not guarantee entry for its citizens after several Germans were detained at the border recently, a foreign ministry spokesperson said.",
    "url": "https://www.reuters.com/world/europe/germany-updates-us-travel-advice-after-citizens-detained-2025-03-19/"
  },
  {
    "text": "Trump proposes US ownership of Ukraine's nuclear plants  —  President Trump proposed a takeover of Ukrainian power plants as a form of protection, suggesting the U.S. could deter Russian attacks, amid a push for a partial ceasefire between Kyiv and Moscow covering energy facilities and infrastructure.",
    "url": "https://thehill.com/policy/international/5203609-donald-trump-ukraine-nuclear-power-plant/"
  },
  {
    "text": "Trump team makes plans for military to hold migrants at border  —  If enacted, miles of buffer zone would become a temporary military installation, giving U.S. troops their most direct role yet in the president's enforcement mission.  —  The Trump administration is evaluating plans … ",
    "url": "https://www.washingtonpost.com/national-security/2025/03/19/trump-border-military-buffer-zone/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyMzU2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzNzM5MTk5LCJpYXQiOjE3NDIzNTY4MDAsImp0aSI6ImFmYjlkYWMyLWVmMmEtNDRlYy1iYTdkLThkMDE2ZGUyMTBkMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAzLzE5L3RydW1wLWJvcmRlci1taWxpdGFyeS1idWZmZXItem9uZS8ifQ.c981-mNyN5ClnuF8qdg2VLdOxgM7-bTz9Awn876aPas&itid=gfta"
  },
  {
    "text": "Massive purge of Pentagon websites includes content on Holocaust remembrance, sexual assault and suicide prevention  —  Articles about the Holocaust, September 11, cancer awareness, sexual assault and suicide prevention are among the tens of thousands either removed or flagged for removal … ",
    "url": "https://www.cnn.com/2025/03/19/politics/pentagon-website-purge"
  },
  {
    "text": "BREAKING: DOGE Strong-Armed USIP Security Contractors to Switch Sides … Each time we hear more about the unfolding situation with the takeover of the U.S. Institute of Peace, the story gets darker and involves greater abuses of power.  My colleague Kate Riga is, as I write … ",
    "url": "https://talkingpointsmemo.com/edblog/breaking-doge-strong-armed-usip-security-contractors-to-switch-sides"
  },
  {
    "text": "A list of the Social Security offices across the US expected to close this year  —  Dozens of Social Security Administration offices across the country are slated to close this year due to actions taken by Elon Musk's Department of Government Efficiency as part of the Trump administration's … ",
    "url": "https://apnews.com/article/social-security-offices-closures-doge-trump-b2b1a5b2ba4fb968abc3379bf90715ff"
  },
  {
    "text": "Kari Lake Accosted Ruben Gallego at a Posh D.C. Club  —  INSIDE NED'S CLUB WASHINGTON, DC—the swanky new private members' club featuring vintage gold and green furnishings, a renowned chef and mixologist, and a rooftop with views of the White House—cable news figures can often … ",
    "url": "https://www.thebulwark.com/p/kari-lake-accosted-ruben-gallego-at-posh-dc-club-mark-kelly-town-hall-immigration"
  },
  {
    "text": "Stephen Miller Has a Plan  —  During the first Trump administration, when Stephen Miller's immigration policy proposals hit obstacles in federal court, rumors would circulate about his plans to dust off arcane presidential powers.  Government lawyers were wary of overreach … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/stephen-miller-presidency/682097/"
  },
  {
    "text": "Jackie Robinson's Army career wiped from military website in DEI purge  —  Robinson trained as an officer and was assigned to a tank regiment during World War II.  —  The military story of Jackie Robinson, who broke the color barrier in Major League Baseball after serving as a 2nd lieutenant in the Army … ",
    "url": "https://www.nbcnews.com/news/nbcblk/jackie-robinson-army-history-dei-military-department-defense-rcna197067"
  },
  {
    "text": "Murkowski says her colleagues are ‘afraid’ of Trump and Musk: 'I'm not going to compromise my own integrity'  —  “That's why you've got everybody just like, zip lip, not saying a word because they're afraid they're going to be taken down,” she said.  —  Alaska Sen. Lisa Murkowski … ",
    "url": "https://www.politico.com/news/2025/03/19/lisa-murkowski-musk-primary-026590"
  },
  {
    "text": "USDA halts millions of dollars worth of deliveries to food banks  —  The halt in deliveries comes after the Trump administration separately slashed $1 billion for schools and food banks to buy food from farms.  —  The Agriculture Department has halted millions of dollars worth of deliveries … ",
    "url": "https://www.politico.com/news/2025/03/19/usda-halts-deliveries-food-banks-trump-00239453"
  },
  {
    "text": "Trump's Sister Declared The Immigration Law He Used Unconstitutional  —  Stuart Anderson writes about immigration, business and globalization.  —  SaveComment  —  In a historical twist, Donald Trump's sister was the federal judge who ruled unconstitutional the immigration law … ",
    "url": "https://www.forbes.com/sites/stuartanderson/2025/03/19/trumps-sister-declared-the-immigration-law-he-used-unconstitutional/"
  },
  {
    "text": "Trump aides prep new tariffs on imports worth trillions for ‘Liberation Day’  —  The administration has already unnerved investors with duties on Canada, Mexico and China.  Advisers are readying a bigger move.  —  White House aides are preparing to impose new tariffs on most imports on April 2 … ",
    "url": "https://www.washingtonpost.com/business/2025/03/19/trump-tariffs-imports-liberation-day/"
  },
  {
    "text": "Voice of America journalist speaks out as China and Russia celebrate Trump silencing news outlet  —  The Trump administration is silencing government-funded news outlets, including Voice of America.  Voice of America chief national correspondent Steve Herman joins Ana Cabrera to speak … ",
    "url": "https://www.msnbc.com/ana-cabrera-reports/watch/voice-of-america-journalist-speaks-out-as-china-and-russia-celebrate-trump-silencing-news-outlet-234818117612"
  }
]