[
  {
    "text": "Trump warns of ‘bedlam,’ declines to rule out violence after court hearing  —  The former president spoke after his lawyers argued he should be immune from prosecution for trying to overturn the 2020 election  —  Republican polling leader Donald Trump on Tuesday threatened unrest … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/09/trump-comments-violence-bedlam/"
  },
  {
    "text": "Trump team argues assassination of rivals is covered by presidential immunity  —  Former President Trump's legal team suggested Tuesday that even a president directing SEAL Team Six to kill a political opponent would be an action barred from prosecution given a former executive's broad immunity to criminal prosecution.",
    "url": "https://thehill.com/regulation/court-battles/4398223-trump-team-argues-assassination-of-rivals-is-covered-by-presidential-immunity/"
  },
  {
    "text": "How Trump's Unhinged Immunity Demand Could Unleash a Second-Term Crime Spree  —  Donald Trump and his lawyers are making an extraordinary demand in the D.C. Circuit Court of Appeals: They want Trump granted immunity from criminal charges related to his subversion of the 2020 election … ",
    "url": "https://newrepublic.com/article/177940/trump-immunity-second-term-crime-spree"
  },
  {
    "text": "Trump's Claim of Immunity Reaches Appeals Court  —  Judges Seem Skeptical of Trump's Claim of Immunity  —  Judges heard from a lawyer for Donald J. Trump who argued that a president could face criminal charges only if impeached and convicted first, even if the case involved the assassination of a political rival.",
    "url": "https://www.nytimes.com/live/2024/01/09/us/trump-immunity-hearing"
  },
  {
    "text": "Georgia court weighs voting machines at heart of Trump election fraud claims  —  A Georgia trial will cast a spotlight on the security of the state's voting machines, which have long come under attack by the former president and his allies.  —  A federal court will begin hearing arguments Tuesday … ",
    "url": "https://www.politico.com/news/2024/01/09/georgia-court-voting-machines-trump-election-fraud-00134420"
  },
  {
    "text": "Iowa voters voice support for Trump as he claims total immunity from election interference  —  Former President Donald Trump voluntarily appeared in court just six days before the Iowa caucuses in a pitch to convince Republican voters that he is a victim— a pitch that has won over some Iowa voters.",
    "url": "https://www.nbcnews.com/meet-the-press/video/iowa-voters-voice-support-for-trump-as-he-claims-total-immunity-from-election-interference-201630789763"
  },
  {
    "text": "'He doesn't give a damn about people:' Biden campaign hits Trump comments on economy crashing  —  President Biden's reelection campaign bashed former President Trump on Tuesday after he said he hoped the U.S. economy crashed in the next 12 months, arguing he doesn't care about people.",
    "url": "https://thehill.com/homenews/campaign/4398028-biden-campaign-hits-trump-comments-economy-crashing-he-doesnt-give-a-damn-about-people/"
  },
  {
    "text": "CNN Poll: Haley trims Trump's lead to single digits in New Hampshire  —  Former South Carolina Gov. Nikki Haley has trimmed former President Donald Trump's lead in the Republican primary race in New Hampshire to single digits, according to a new CNN Poll conducted by the University of New Hampshire.",
    "url": "https://www.cnn.com/2024/01/09/politics/cnn-new-hampshire-poll/"
  },
  {
    "text": "RFK Jr. won't attend birthday party fundraiser after celebrity blowback  —  Independent presidential candidate Robert F. Kennedy Jr. won't attend a birthday party fundraiser, his campaign said, after multiple celebrities who had been announced as attendees denied that they ever planned to attend.",
    "url": "https://thehill.com/homenews/campaign/4398472-rfk-jr-birthday-party-fundraiser-celebrity-2024/"
  },
  {
    "text": "RFK Jr. backs out of his own birthday fundraiser gala after Martin Sheen, Mike Tyson said they're not attending  —  Robert F. Kennedy Jr. is backing out of his own birthday fundraiser gala after celebrity guests Martin Sheen, Dionne Warwick, Mike Tyson and Andrea Bocelli, who were reported to be attending … ",
    "url": "https://www.cbsnews.com/news/rfk-jr-backs-out-birthday-fundraiser-gala-martin-sheen-mike-tyson-not-attending/"
  },
  {
    "text": "Defense Secretary Lloyd Austin diagnosed with prostate cancer  —  Austin was diagnosed with prostate cancer in December and underwent a minimally invasive procedure, officials from Walter Reed said in a statement Tuesday.  —  WASHINGTON — Defense Secretary Lloyd Austin was diagnosed … ",
    "url": "https://www.nbcnews.com/politics/white-house/defense-secretary-lloyd-austin-diagnosed-prostate-cancer-rcna133120"
  },
  {
    "text": "1/9/2024 ☀️ Punchbowl News AM … Former President Donald Trump is on the path to the GOP presidential nomination.  Speaker Mike Johnson is in an increasingly perilous position with his right flank.  —  Does it sound like Congress is going to approve a border security and immigration deal?",
    "url": "https://punchbowl.news/archive/192024-punchbowl-news-am-2/"
  },
  {
    "text": "5th Circuit announces takeover of Department of Energy  —  Here we go again:  —  As silly as the finding of standing is, the 5th Circuit's position on the merits that any regulation issued by a Democratic administration is “arbitrary and capricious” is even worse!",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/01/5th-circuit-announces-takeover-of-department-of-energy"
  },
  {
    "text": "Lauren Boebert's Ex-Husband Gives His Side of Restaurant Fight Story: “I Was Telling Her I Want Her Back”  —  Jayson Boebert says that he regrets calling the police Saturday following his public spat with Colorado's most infamous lawmaker. … “I wish this all hadn't happened.”",
    "url": "https://www.westword.com/news/lauren-boeberts-ex-husband-gives-his-side-of-restaurant-fight-story-18805078"
  },
  {
    "text": "Pizzagate, QAnon and the ‘Epstein List’: Why the Far Right Is Obsessed with Sex Trafficking  —  An expert on conspiracy theories explains why MAGA figures are embracing the latest twist in the Jeffrey Epstein saga.  —  A day before the so-called Epstein list was supposed to drop … ",
    "url": "https://www.politico.com/news/magazine/2024/01/09/why-maga-is-obsessed-with-jeffrey-epstein-00134394"
  },
  {
    "text": "Roger Stone Plotted Assassinating Democrats, Bombshell Report Says  —  Explosive new audio of Roger Stone reveals the longtime Trump ally was trying to plot the assassinations of two outspoken Democratic congressmen.  —  A few weeks before the 2020 election, Stone told a member … ",
    "url": "https://newrepublic.com/post/177935/roger-stone-audio-assasinate-democrats-swalwell-nadler"
  },
  {
    "text": "Dave McCormick-Led Hedge Fund Shed Hundreds Of Jobs After Pocketing State Money  —  The Republican Senate candidate in Pennsylvania has run as an expert in job creation.  —  LOADING  —  Dave McCormick, an extremely wealthy hedge fund manager running as a Republican for U.S. Senate in Pennsylvania … ",
    "url": "https://www.huffpost.com/entry/dave-mccormick-job-creator-layoffs-connecticut_n_659d701ce4b075f4cfd402ce"
  },
  {
    "text": "Biden highlights the connection between rejecting democracy and race  —  President Biden's visit to South Carolina on Monday and the speech he gave at Mother Emanuel AME Church in Charleston have been connected, including by the president, to his speech at Valley Forge, Pa., last week … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/09/democracy-race-jan6-trump-biden/"
  },
  {
    "text": "Democratic Donors Bought Hunter Biden's Artwork, Gallery Owner Tells House Investigators  —  Sources with direct knowledge of the interview of a New York art dealer said Hunter Biden's artwork was sold to two or three Democratic donors  —  A New York art dealer who sells Hunter Biden's work … ",
    "url": "https://themessenger.com/politics/democratic-donors-bought-hunter-bidens-artwork-gallery-owner-tells-house-investigators"
  },
  {
    "text": "Wenstrup Releases Statement Following Day 1 of Dr. Fauci's Testimony  —  WASHINGTON — Select Subcommittee on the Coronavirus Pandemic Chairman Brad Wenstrup (R-Ohio) issued the following statement after day one of Dr. Anthony Fauci's two-day, 14-hour transcribed interview:",
    "url": "https://oversight.house.gov/release/wenstrup-releases-statement-following-first-day-of-dr-faucis-testimony/"
  },
  {
    "text": "Asa Hutchinson reminds Iowans who forgot him: 'I'm still running'  —  The former Arkansas governor has carried on with a campaign that has barely registered a blip in the first GOP caucus state  —  WAUKEE, Iowa — Asa Hutchinson surveyed the beer and burger joint.",
    "url": "https://www.washingtonpost.com/politics/2024/01/09/asa-hutchinson-campaign-iowa-2024/"
  },
  {
    "text": "REVEALED: Tennessee Rep. Andy Ogles faces ethics complaint, comparison to George Santos  —  Non-partisan Campaign Legal Center ask federal ethics agency to investigate irregularities uncovered by NewsChannel 5  —  NASHVILLE, Tenn. (WTVF) — A nonpartisan watchdog group has asked … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/revealed/revealed-tennessee-rep-andy-ogles-faces-ethics-complaint-comparison-to-george-santos"
  }
]