[
  {
    "text": "Trump's freewheeling speeches offer a dark vision of a second term  —  A close examination of one appearance in Rock Hill, S.C., offers an anatomy of a signature rally by the former president  —  A Donald Trump rally is a freewheeling extravaganza.  A festival of grievance and retribution.",
    "url": "https://www.washingtonpost.com/politics/2024/03/11/trump-campaign-speech-anatomy/"
  },
  {
    "text": "Trump's $91.6 million question  —  New York juries have found, by a preponderance of the evidence, that former President Donald Trump sexually assaulted writer E. Jean Carroll in a Bergdorf Goodman dressing room in the mid-90s and then repeatedly defamed her, falsely accusing Carroll of lying about the incident.",
    "url": "https://popular.info/p/trumps-916-million-question"
  },
  {
    "text": "The media is still selling a fantasy version of Trump  —  We should all know better by now. … Nikki Haley spent the dying days of her presidential campaign reminding anyone who'd listen that Donald Trump is unhinged and unfit.  But when she ended her candidacy last week after Super Tuesday … ",
    "url": "https://www.publicnotice.co/p/axios-new-york-times-nbc-trump-fantasy-version"
  },
  {
    "text": "Forget the presidential race.  Statehouses are where it's at.  —  Good morning, Early Birds.  Today is the first full day of Ramadan.  Ramadan Mubarak to all those who observe.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2024/03/11/forget-presidential-race-statehouses-are-where-its/"
  },
  {
    "text": "Donald Trump won't give ‘a penny’ to Ukraine if elected, Orbán says  —  Hungarian leader praised Republican front-runner as a “man of peace.”  —  Donald Trump will totally stop funding Ukraine if he wins the U.S. election in November, Hungarian Prime Minister Viktor Orbán … ",
    "url": "https://www.politico.eu/article/viktor-orban-donald-trump-wont-give-a-penny-to-ukraine-if-elected/"
  },
  {
    "text": "There should be newspapers that we work at where we do this  —  Katie Britt, the Republican junior United States senator from Alabama, became a national punchline Thursday night by delivering a  deeply bizarre and disastrous State of the Union rebuttal.  Social media was already going nuts … ",
    "url": "https://flaminghydra.com/there-should-be-newspapers-that-we-work-at-where-we-do-this/"
  },
  {
    "text": "Sex trafficking victim says Sen. Katie Britt telling her story during SOTU rebuttal is ‘not fair’  —  The woman whose story Alabama Sen. Katie Britt appeared to have shared in the Republican response to the State of the Union as an example of President Joe Biden's failed immigration policies told CNN … ",
    "url": "https://www.cnn.com/2024/03/10/politics/katie-britt-sex-trafficking-victim-interview"
  },
  {
    "text": "Netanyahu vows to defy Biden's ‘red line’ on Rafah  —  Paul Ronzheimer is the deputy editor-in-chief of BILD and a senior journalist reporting for Axel Springer, the parent company of POLITICO.  —  TEL AVIV — Israeli Prime Minister Benjamin Netanyahu says he intends to press ahead … ",
    "url": "https://www.politico.eu/article/israels-netanyahu-says-he-will-defy-bidens-red-line-and-invade-rafah/"
  },
  {
    "text": "The Trump campaign paid an expert $750,000 to find fraud in the 2020 election, only for him to dismiss their complaints in minutes  — A new book sheds light on the lengths Trump's campaign went to find fraud in the 2020 election.  — Ken Block, a software engineer, revealed he was paid about $750,000 to help conduct the search.",
    "url": "https://www.businessinsider.com/ken-block-disproven-book-trump-campaign-election-fraud-2024-3"
  },
  {
    "text": "Trump says TikTok is a national security threat, Facebook is ‘enemy of the people’  —  Trump recently reversed his support of a ban on TikTok.  —  Former President Donald Trump said he believes TikTok is a national security threat, but that he couldn't support Congress banning the popular app … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-tiktok-national-security-threat-facebook-enemy-people-rcna142733"
  },
  {
    "text": "Trump supporters hoping to oust Wisconsin leader say they have enough signatures to force recall  —  MADISON, Wis. (AP) — Backers of an effort to oust Wisconsin Republican Assembly Speaker Robin Vos from office over his opposition to former President Donald Trump announced Sunday … ",
    "url": "https://apnews.com/article/wisconsin-speaker-recall-robin-vos-c12e8391c9e254327c5de344b640d067"
  },
  {
    "text": "Palestinians in Gaza begin Ramadan with hunger worsening and no end in sight to the Israel-Hamas war  —  A ship belonging to Spanish aid group Open Arms was expected to make a pilot voyage to Gaza from nearby Cyprus “as soon as possible.”  Efforts to deliver aid to Gaza by sea have moved ahead … ",
    "url": "https://apnews.com/article/israel-hamas-war-news-03-11-2024-c6835d50f91dff0443e0f7fdf5e3229f"
  },
  {
    "text": "Sure, Biden and Trump are important — but there's another boomer who could actually decide the election  —  Jay Powell would very much like to stay out of politics, especially in an election year.  The Federal Reserve chair doesn't want to be perceived as having a horse in the race come November … ",
    "url": "https://www.businessinsider.com/federal-reserve-jerome-powell-election-trump-biden-president-interest-rates-2024-3"
  },
  {
    "text": "Conservatives seize counselor shortage to press school chaplains … - Since Texas introduced it own blueprint last year, allowing schools to use safety funds to hire chaplains who do not have the same licensing as counselors, similar bills have ricocheted across more than a dozen states including Florida … ",
    "url": "https://www.axios.com/2024/03/11/chaplains-in-schools-movement-florida-texas"
  },
  {
    "text": "Kimmel knocks Britt for SOTU rebuttal at Oscars: She's an ‘adult woman with the brain of a child’  —  Jimmy Kimmel is taking a knock at Sen. Katie Britt at the Academy Awards for the Alabama Republican's much-mocked State of the Union rebuttal.  —  The late-night TV host took to the stage … ",
    "url": "https://thehill.com/homenews/4522991-kimmel-knocks-britt-for-sotu-rebuttal-at-oscars-shes-an-adult-woman-with-the-brain-of-a-child/"
  },
  {
    "text": "Biden budget proposal would raise taxes on large corporations, lower deficit over 10 years  —  President Biden on Monday will unveil his budget proposal for the coming fiscal year, calling for tax increases for large corporations and for billionaires to pay a minimum 25 percent tax rate.",
    "url": "https://thehill.com/homenews/administration/4522786-biden-budget-proposal-would-raise-taxes-on-large-corporations-lower-deficit-over-10-years/"
  },
  {
    "text": "The Body Shop is closing down all US operations after filing for bankruptcy  —  The Body Shop announced this month that it has closed all its stores in the United States as it filed for bankruptcy.  —  The Body Shop Canada Limited, the Canadian subsidiary of the UK-based cosmetics company … ",
    "url": "https://thehill.com/business/4523260-the-body-shop-is-closing-down-all-us-operations-after-filing-for-bankruptcy/"
  },
  {
    "text": "The GOP can't leave MAGA — “Americans must electorally mercy-kill the Republican Party”  —  An ex-MAGA activist warns “no civic savior is coming” as Donald Trump's cognitive decline becomes undeniable  —  Power not used is power wasted.  Fascism is corrupt power.",
    "url": "https://www.salon.com/2024/03/11/the-cant-leave-maga--americans-must-electorally-mercy-the-party/"
  },
  {
    "text": "Conservatives are furious, but they're not threatening Speaker Johnson's job  —  For a small but passionate band of Republicans, reality appears to be setting in that they won't be able to bend a divided Congress to their will through the election of a speaker.",
    "url": "https://www.nbcnews.com/politics/congress/conservatives-are-furious-not-threatening-speaker-johnsons-job-rcna142489"
  },
  {
    "text": "Democratic Senate group reserves $239 million in ads to defend seats in seven states  —  The reservations include more than $100 million to defend Ohio's Sherrod Brown and Pennsylvania's Bob Casey in a tough cycle for the majority party  —  Senate Majority PAC, an independent group associated … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/11/senate-democrats-ads-super-pac/"
  }
]