[
  {
    "text": "Illinois shut out of Medicaid after Trump administration halts federal grants and loans  —  The Trump administration's federal freeze has shut Illinois out of Medicaid, according to Gov. JB Pritzker's office.  The government-funded health insurance program covered about 3.9 million people … ",
    "url": "https://chicago.suntimes.com/politics/donald-trump/2025/01/28/illinois-medicaid-federal-funding-freeze-trump-administration"
  },
  {
    "text": "D.C. federal judge temporarily blocks Trump plan to pause federal aid spending  —  The order from Judge Loren AliKhan runs through next Monday, when further arguments in the case are scheduled.  —  Trump administration freezes nearly all federal grants and loans",
    "url": "https://www.nbcnews.com/politics/donald-trump/dc-federal-judge-temporarily-blocks-trump-plan-pause-federal-aid-spend-rcna189706"
  },
  {
    "text": "White House says Medicaid portal ‘will be back online shortly’ after Trump funding freeze blamed … Medicaid reimbursement portals were down Tuesday in every U.S. state on the heels of a funding freeze ordered by the Trump administration of federal grants and loans, Sen. Ron Wyden said.",
    "url": "https://www.cnbc.com/2025/01/28/trump-funding-freeze-medicaid-state-portals-omb.html"
  },
  {
    "text": "Republican congressman suggests some children receiving free school lunches should work at McDonald's instead  —  Rep. Rich McCormick said that the freeze on federal aid would allow the government to review all programs including ones that provide free school lunches to low-income children.",
    "url": "https://www.nbcnews.com/politics/congress/republican-congressman-suggests-children-receiving-free-school-lunches-rcna189614"
  },
  {
    "text": "As some Medicaid sites freeze up, White House acts to clarify pause on grants and programs  —  Payments system appears to be an issue after budget office issued broadly worded memo  —  WASHINGTON — A memo from the White House budget office indicates that Medicaid payments should not be affected … ",
    "url": "https://www.statnews.com/2025/01/28/federal-grant-pause-disrupts-medicaid-trump-freeze-executive-order/"
  },
  {
    "text": "Legal battle looms as Trump orders a funding freeze during a review of federal loans and grants  —  The White House is pausing federal grants and loans starting Tuesday as President Donald Trump's administration begins an across-the-board ideological review of its spending … ",
    "url": "https://apnews.com/article/donald-trump-pause-federal-grants-aid-f9948b9996c0ca971f0065fac85737ce"
  },
  {
    "text": "Scoop: Trump offering buyouts to all federal workers, source says … We're five years past COVID and just 6 percent of federal employees work full-time in office.  That is unacceptable,\" a senior administration official tells Axios.",
    "url": "https://www.axios.com/2025/01/28/trump-federal-workers-quit-severance"
  },
  {
    "text": "Trump administration will offer all 2 million federal workers a buyout to resign  —  An email is set to go out to federal workers beginning Tuesday.  —  President Donald Trump's administration is set to offer every single federal worker the chance to take a “deferred resignation” … ",
    "url": "https://www.nbcnews.com/politics/white-house/trump-administration-offer-federal-workers-buyouts-resign-rcna189661"
  },
  {
    "text": "Live Updates: White House Defends Trump's Funding Freeze as Opponents Rush to Block It  —  Where Things Stand  — Federal aid pause: The White House budget office ordered a pause in grants, loans and other federal financial assistance, a sweeping move it said was necessary to bring … ",
    "url": "https://www.nytimes.com/live/2025/01/28/us/trump-news-executive-orders"
  },
  {
    "text": "Caroline Kennedy warns senators of ‘predator’ RFK Jr. in searing letter  —  In a letter to lawmakers, the former U.S. ambassador to Australia and cousin of Trump's HHS nominee, questions Robert F. Kennedy's ethics and views on vaccines.  —  Caroline Kennedy on Tuesday warned senators … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/28/kennedy-lettor-rfk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MDQwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NDIyNzk5LCJpYXQiOjE3MzgwNDA0MDAsImp0aSI6ImZhNmJjNWE5LTg3OTEtNDQyZC1hMGU3LTUxZmJhMDIyY2UzZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzI4L2tlbm5lZHktbGV0dG9yLXJmay8ifQ.fW4r9jt8DqylCfb5j_rzlwhNhNQfMJ2GaIAA7wUH7mU"
  },
  {
    "text": "Trump moves to fire members of EEOC, NLRB boards, breaking with precedent  —  The dismissals target two independent agencies that oversee large swaths of U.S. workers, employers and labor unions.  —  President Donald Trump has moved to fire Democratic members of two independent federal commissions … ",
    "url": "https://www.washingtonpost.com/business/2025/01/28/trump-fire-eeoc-nlrb-board-members/"
  },
  {
    "text": "Trump Ousts Top Labor Board Leaders Who Backed Broader Worker Rights  —  Jennifer Abruzzo says she was fired by email late on Monday  —  Donald Trump is forcing out top leaders of the US labor board, ushering in a swift reboot of workplace law enforcement while testing the limits of presidential authority.",
    "url": "https://www.bloomberg.com/news/articles/2025-01-28/trump-fires-nlrb-general-counsel-jennifer-abruzzo?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczODA0NDU3MywiZXhwIjoxNzM4NjQ5MzczLCJhcnRpY2xlSWQiOiJTUVNCTTlUMEcxS1cwMCIsImJjb25uZWN0SWQiOiJDQThGQ0Y4NkY1QjY0ODlCODA4ODkwNTFBNjMxRERBRCJ9.X3-2wWPj_m7Ef39_-TnjwoHOki3vNE5WcSUjtT-97gs&leadSource=uverify%20wall"
  },
  {
    "text": "Americans sour on some of Trump's early moves, Reuters/Ipsos poll finds  —  Americans have a dim view of some of President Donald Trump's early barrage of executive orders, including his attempt to do away with so-called birthright citizenship and his decision to rename the Gulf of Mexico, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/americans-sour-some-trumps-early-moves-reutersipsos-poll-finds-2025-01-28/"
  },
  {
    "text": "Michigan's Gary Peters won't seek reelection to U.S. Senate.  Here's why  —  Washington ― Gary Peters, Michigan's senior senator and a former congressman, said he won't seek reelection next year and will retire from the U.S. Senate when his second term ends in January 2027.",
    "url": "https://www.detroitnews.com/story/news/politics/2025/01/28/michigan-democratic-senator-gary-peters-will-not-run-for-reelection-to-us-senate-seat-2026/77985876007/"
  },
  {
    "text": "Scoop: Pete Buttigieg taking “serious look” at Michigan Senate race in 2026 … - “Pete is exploring all of his options on how he can be helpful and continue to serve,” said a person close to Buttigieg.  — “He's honored to be mentioned for this and he's taking a serious look.”",
    "url": "https://www.axios.com/2025/01/28/pete-buttigieg-michigan-senate"
  },
  {
    "text": "120. The Impoundment Crisis of 2025  —  The Trump administration's Monday spending freeze is likely to provoke a crisis over the constitutionality of “impoundment”—one that the justices could well have to resolve *very* soon.  —  Welcome back to “One First,” a weekly newsletter that aims … ",
    "url": "https://www.stevevladeck.com/p/120-the-impoundment-crisis-of-2025"
  },
  {
    "text": "France floated sending troops to Greenland, foreign minister says  —  The comments came as Denmark's prime minister travels to Berlin, Paris and Brussels to shore up support from allies.  —  PARIS — France has discussed with Denmark sending troops to Greenland in response … ",
    "url": "https://www.politico.eu/article/france-fm-jean-noel-barrot-floats-sending-troops-to-greenland-denmark/"
  },
  {
    "text": "Departing the New York Times  —  As many people reading this know, last month I retired from my position as an opinion writer at the New York Times—a job I had done for 25 years.  Despite the encomiums issued by the Times, it was not a happy departure.  If you check out my Substack … ",
    "url": "https://contrarian.substack.com/p/departing-the-new-york-times"
  },
  {
    "text": "White House on mysterious drone swarms: “This was not the enemy” … - “After research and study, the drones that were flying over New Jersey in large numbers were approved by the FAA for research and various other reasons. … - More “mysterious” drone sightings had been reported just this week … ",
    "url": "https://www.axios.com/2025/01/28/drone-swarms-trump-white-house-briefing"
  },
  {
    "text": "Democrats' playbook for Trump 2.0: Tune out the noise and focus on economic issues  —  As Trump floods the zone in his first week in office, Democrats are departing from their “resistance” strategy in his first term and zeroing in on issues that cost them the last election.",
    "url": "https://www.nbcnews.com/politics/congress/democrats-playbook-trump-tune-noise-focus-economic-issues-rcna189180"
  },
  {
    "text": "Senate Democrats block GOP's ICC sanctions bill  —  Senate Democrats on Tuesday blocked Republicans from advancing legislation to sanction the International Criminal Court, arguing the bill had sweeping consequences on allies and American businesses.  —  Republicans failed to get the 60 votes needed … ",
    "url": "https://thehill.com/homenews/senate/5111458-senate-democrats-block-icc-sanctions-bill/"
  },
  {
    "text": "Trump's Tariffs Hit US Growth Before, and Threaten to Again  —  Newly released transcripts from the Federal Reserve show just how much policymakers were scrambling to keep growth intact.  —  For skeptics of President Donald Trump's threatened tariffs, the concern raised most often at home … ",
    "url": "https://www.bloomberg.com/news/features/2025-01-28/could-trump-s-tariffs-slow-us-growth-it-happened-last-time"
  },
  {
    "text": "All undocumented immigrants are “criminals,” Trump administration says … The big picture: Asked by a reporter how many of the 3,500 immigrants arrested since Trump took office have criminal records, Leavitt said, “all of them because they illegally broke our nation's laws.”",
    "url": "https://www.axios.com/2025/01/28/trump-immigrants-criminals-white-house-briefing"
  },
  {
    "text": "Senator Ted Cruz is trying to block Wi-Fi hotspots for schoolchildren … US Senator Ted Cruz (R-Texas) is trying to block a plan to distribute Wi-Fi hotspots to schoolchildren, claiming it will lead to unsupervised Internet usage, endanger kids, and possibly restrict kids' exposure to conservative viewpoints.",
    "url": "https://arstechnica.com/tech-policy/2025/01/senator-ted-cruz-is-trying-to-block-wi-fi-hotspots-for-schoolchildren/"
  }
]