[
  {
    "text": "Transition Live Updates: Trump Hints at U.S. Territorial Expansion and Airs Grievances  —  Here's what to know  — In an hourlong news conference at Mar-a-Lago, President-elect Donald J. Trump refused to rule out using military force to retake the Panama Canal, which was returned by treaty … ",
    "url": "https://www.nytimes.com/live/2025/01/07/us/trump-news"
  },
  {
    "text": "Donald Trump Jr. arrives in Greenland with a message from his dad: 'We're going to treat you well'  —  President-elect Donald Trump told residents of Greenland that “we're going to treat you well” as his oldest son visited the mineral-rich Danish territory that's home to a large U.S. military base … ",
    "url": "https://apnews.com/article/greenland-us-trumps-son-visit-56bc01f1d3431c035b22ad6564579938"
  },
  {
    "text": "Zuckerberg wears $900,000 watch to announce end of Meta fact checks  —  Mark Zuckerberg wore a rare Swiss watch worth about $900,000 in a video explaining his company's decision to end third-party fact checking on its social media platforms in the U.S.  —  Play Video",
    "url": "https://torontosun.com/business/money-news/zuckerberg-wears-900000-watch-to-announce-end-of-meta-fact-checks"
  },
  {
    "text": "More Speech and Fewer Mistakes  —  Meta's platforms are built to be places where people can express themselves freely.  That can be messy.  On platforms where billions of people can have a voice, all the good, bad and ugly is on display.  But that's free expression.",
    "url": "https://about.fb.com/news/2025/01/meta-more-speech-fewer-mistakes/"
  },
  {
    "text": "Zuckerberg Achieves Trump Lap Monkey Badge And Other Platform News  —  You've likely seen that Mark Zuckerberg, newly re-branded as Donald Trump's fluffy lap monkey, has announced that Facebook and Meta's other properties are getting out of the content moderation business.",
    "url": "https://talkingpointsmemo.com/edblog/zuckerberg-achieves-trump-lap-monkey-badge-and-other-platform-news/sharetoken/f5db6ef4-9cba-4d0d-a7a0-d168f20079e1"
  },
  {
    "text": "Meta is ending its fact-checking program in favor of a ‘community notes’ system similar to X  —  Meta CEO Mark Zuckerberg announced a series of major changes to the company's moderation policies and practices, saying that the election felt like a “cultural tipping point.”",
    "url": "https://www.nbcnews.com/tech/social-media/meta-ends-fact-checking-program-community-notes-x-rcna186468"
  },
  {
    "text": "Cannon temporarily blocks report on Trump classified-documents probe  —  Two Trump employees charged alongside him in the classified documents case separately asked Judge Aileen Cannon to block the release.  —  The federal judge in Florida who dismissed the case against Donald Trump … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/07/jack-smith-trump-special-counsel-report-garland/"
  },
  {
    "text": "New York appeals court denies halting Trump's sentencing  —  A New York appellate judge on Tuesday declined to suspend President-elect Trump's Friday sentencing on his hush money criminal conviction.  —  Judge Ellen Gesmer of the state's midlevel appeals court rejected Trump's emergency petition … ",
    "url": "https://thehill.com/regulation/court-battles/5071977-appeals-court-trump-sentencing/"
  },
  {
    "text": "Judge Cannon Blocks Release of Special Counsel's Final Report on Trump Documents Investigation  —  Judge Aileen M. Cannon, a Trump appointee who dismissed the documents case in its entirety this summer, on Tuesday temporarily barred the special counsel, Jack Smith, from releasing the results of his investigation to the public.",
    "url": "https://www.nytimes.com/2025/01/07/us/politics/trump-documents-case-jack-smith-report.html?unlocked_article_code=1.nU4.owQZ.ld7D9HbGiGFl&smid=url-share"
  },
  {
    "text": "SALT emerges as redline for blue state Republicans in reconciliation negotiations  —  As House Republicans grapple with intraparty disagreements over what to include in President-elect Donald Trump's reconciliation bill, some GOP lawmakers are making specific tax provision demands they say will be necessary for their support.",
    "url": "https://www.washingtonexaminer.com/news/house/3279360/salt-emerges-redline-blue-state-republicans-reconciliation/"
  },
  {
    "text": "Trump Calls SALT-Focused Republicans to Florida Before Tax Fight  —  A cohort of about 20 Republican House members from New York, New Jersey and California was invited to meet with President-elect Donald Trump at his Mar-a-Lago estate Saturday ahead of a looming fight over an extension of his 2017 tax cuts.",
    "url": "https://www.bloomberg.com/news/articles/2025-01-07/trump-calls-salt-focused-republicans-to-florida-before-tax-fight"
  },
  {
    "text": "Trump Blurs Lines in $20 Billion Data Center Announcement and Other Deals  —  Even before the start of the new administration, there has been repeated blurring of lines between the federal government efforts and Trump family businesses.  —  President-elect Donald J. Trump … ",
    "url": "https://www.nytimes.com/2025/01/07/us/politics/trump-hussain-sajwani-damac-crypto-deals.html"
  },
  {
    "text": "GOP-controlled North Carolina Supreme Court blocks certification of Democrat as winner of close high court race  —  The order allows the state Supreme Court to hear a challenge by the Republican candidate in the race — who trails by just 734 votes — to have 60,000 ballots thrown out.",
    "url": "https://www.nbcnews.com/politics/elections/north-carolina-supreme-court-blocks-certification-democrat-winner-clos-rcna186662"
  },
  {
    "text": "Melania Trump Documentary Scores Massive Amazon Payday  —  It's 2025, and even the Walt Disney Co. is kissing Donald Trump's ring.  But it's still stunning that Amazon is paying a whopping $40 million to license the Brett Ratner-directed Melania Trump documentary.",
    "url": "https://puck.news/melania-trump-documentary-scores-massive-amazon-payday/"
  },
  {
    "text": "Federal prosecutors say they've uncovered ‘additional criminal conduct’ by NYC Mayor Adams  —  Federal prosecutors who indicted Mayor Adams on corruption charges last year allege they have uncovered “additional criminal conduct” that the mayor and others engaged in.",
    "url": "https://www.nydailynews.com/2025/01/07/federal-prosecutors-additional-criminal-conduct-by-nyc-mayor-adams-turkey-corruption/"
  },
  {
    "text": "Scoop: Senate Dems delay Tulsi Gabbard nomination … - Sen. Mark Warner (D-Va.), the vice chair of the Senate Intelligence Committee, is balking at GOP requests to hold a hearing for Gabbard early next week, according to multiple sources familiar with the conversations.",
    "url": "https://www.axios.com/2025/01/07/tulsi-gabbard-senate-democrats-delay-hearing"
  },
  {
    "text": "FIRE to defend veteran pollster J. Ann Selzer in Trump lawsuit over outlier election poll  —  “Punishing someone for their political prediction is about as unconstitutional as it gets,” said FIRE Chief Counsel Bob Corn-Revere.  “This is America.  No one should be afraid to predict the outcome of an election.",
    "url": "https://www.thefire.org/news/fire-defend-veteran-pollster-j-ann-selzer-trump-lawsuit-over-outlier-election-poll"
  },
  {
    "text": "New Dem additions to a plum panel are spurring private angst  —  An under-the-radar decision to add Rep. Alexandria Ocasio-Cortez and about half a dozen other members to the House Energy and Commerce is causing some angst among House Democrats, according to three people familiar with the matter … ",
    "url": "https://www.politico.com/live-updates/2025/01/07/congress/dem-committee-assignments-cause-problems-00196852"
  },
  {
    "text": "Washington Post Lays Off 4 Percent of Its Work Force  —  The layoffs will affect employees across The Post's business operations, not its newsroom.  —  The Washington Post has started laying off roughly 4 percent of its work force, the company said on Tuesday, as the newspaper struggles to stem millions of dollars in annual losses.",
    "url": "https://www.nytimes.com/2025/01/07/business/media/washington-post-layoffs.html"
  }
]