[
  {
    "text": "Black House Democrats embrace Biden at another critical juncture  —  “You've had my back, and I'll continue to have yours,” Biden told the Congressional Black Caucus on a Monday night call, echoing the 2020 race.  —  When the naysayers doubted that Joe Biden could win the 2020 presidential primary … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/08/black-house-democrats-cbc-biden-congressional-black-caucus/"
  },
  {
    "text": "AOC Breaks Her Post-Debate Silence With Ringing Biden Endorsement  —  ‘MATTER IS CLOSED’  —  Rep. Alexandria Ocasio-Cortez (D-NY) told reporters Monday that after speaking “extensively” with President Joe Biden over the weekend, she is supporting his reelection bid.",
    "url": "https://www.thedailybeast.com/aoc-breaks-her-post-debate-silence-with-ringing-biden-endorsement"
  },
  {
    "text": "Democrats hold pivotal meetings on Biden, as divisions deepen after Trump debate … House Democrats convened at their national party headquarters in Washington, D.C., on Tuesday for a pivotal closed-door meeting, as members weigh whether to continue backing President Joe Biden's reelection bid or seek his withdrawal.",
    "url": "https://www.cnbc.com/2024/07/09/biden-campaign-democrats-updates.html"
  },
  {
    "text": "Poll finds Biden damaged by debate; with Harris and Clinton best positioned to win  —  Vice President Kamala Harris is now running ahead of Trump, 42 percent to 41 percent, the survey found.  —  A top Democratic pollster has a new survey showing President Joe Biden still in contention against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/09/biden-clinton-harris-democrat-poll-00166937"
  },
  {
    "text": "Kamala Harris beats Donald Trump, new poll shows, performs better than Joe Biden  —  WASHINGTON — Vice President Kamala Harris could narrowly beat Donald Trump in November, according to a new national poll from a Democratic pollster.  —  Harris is ahead by 1 point in the poll conducted … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/09/harris-beat-trump-poll-biden/74333759007/"
  },
  {
    "text": "Playbook: The Democratic split to watch  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  DEPT. OF SHIT-STIRRING — “Poll finds Biden damaged by debate; with Harris and Clinton best positioned to win,” by Christopher Cadelago: “The national poll … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/09/the-democratic-split-to-watch-00166992"
  },
  {
    "text": "The media has been breathlessly attacking Biden.  What about Trump?  —  The bigger story is Donald Trump's appalling unfitness for office.  He tried to overturn a legitimate election and is a felon  —  It's possible for two conflicting ideas to be true at once.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/09/biden-media-attacks-trump-felon"
  },
  {
    "text": "J.D. Vance Has a Problem on His Face  —  J.D. VANCE IS THE BEST BET on the predictive markets to be Donald Trump's running mate.  But an only-in-MAGAville issue might stand in the Ohio Republican's way: facial hair.  —  “J.D. has a beard.  But Trump is a clean-shaven guy.",
    "url": "https://www.thebulwark.com/p/jd-vance-has-a-problem-on-his-face"
  },
  {
    "text": "White House doctor offers explanation for Parkinson's expert's visits  —  The doctor held regular Neurology clinics at the White House, she said  —  In a letter released late Monday night by the president's physician, Dr. Kevin O'Connor, he confirmed that Dr. Kevin Cannard … ",
    "url": "https://abcnews.go.com/Politics/white-house-doctor-offers-explanation-parkinsons-experts-visits/story?id=111764565"
  },
  {
    "text": "Former Sen. Jim Inhofe, Prolific Climate Denier, Dies At 89  —  The longtime Oklahoma Republican leaves behind a long legacy of disinformation about the mounting threat of global warming.  —  Longtime former Oklahoma Republican Sen. Jim Inhofe, one of the most vehement climate change deniers … ",
    "url": "https://www.huffpost.com/entry/james-inhofe-oklahoma-climate-denier-dead_n_668d4d03e4b0a62057b85fc2"
  },
  {
    "text": "Trump plans to block hearings in January 6 case before 2024 election  —  Lawyers for ex-president preparing to shut down possibility of high-profile officials testifying at evidentiary hearings  —  Donald Trump is expected to launch a new legal battle to suppress any damaging evidence … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/09/trump-january-6-witnesses-election"
  },
  {
    "text": "The alarming new power Trump will claim in a second term  —  Donald Trump says that if he returns to the White House in 2025, he will have the power to effectively cancel any federal program — or even an entire agency — by refusing to spend money appropriated by Congress.",
    "url": "https://popular.info/p/the-alarming-new-power-trump-will"
  },
  {
    "text": "Marla Maples Is Reportedly Ready to Throw Her Hat in the Trump VP Ring  —  ALL IS FORGIVEN  —  The former president's second wife opened up on her relationship with Trump and 2024 in a new interview, and sources tell the Evening Standard she's ready to join the veepstakes.",
    "url": "https://www.thedailybeast.com/marla-maples-is-reportedly-ready-to-throw-her-hat-in-the-trump-vp-ring"
  },
  {
    "text": "U.S. Officials Say Russia Is Unlikely to Take Much More Ukrainian Territory  —  Russian forces continue to inflict pain, but NATO leaders gathering in Washington can say that their efforts to strengthen Ukraine are working.  —  Russia is unlikely to make significant territorial gains … ",
    "url": "https://www.nytimes.com/2024/07/09/us/politics/russia-ukraine-nato.html"
  },
  {
    "text": "A Dangerous Double Standard  —  All our energies must go to defeating Trump  —  What a weekend.  You know I have seen some things in my seven decades covering American politics.  I have never seen anything quite like the wrangling, hand-wringing, and behind-the-scenes gamesmanship currently swirling around President Biden.",
    "url": "https://steady.substack.com/p/a-dangerous-double-standard"
  }
]