[
  {
    "text": "How criticism of Zelensky's clothing made it to the Oval Office  —  It was the first thing President Donald Trump said when Ukraine President Volodymyr Zelensky stepped out of his car at the White House on Friday.  —  “You're all dressed up today,” Trump said as he greeted him … ",
    "url": "https://www.bbc.com/news/articles/c1d4r9yvqzpo"
  },
  {
    "text": "FAA Officials Ordered Staff to Find Funding for Elon Musk's Starlink  —  The Federal Aviation Administration directed staff to locate tens of millions of dollars for a Starlink deal, sources tell Rolling Stone … However, on Friday, FAA officials ordered staff to begin finding tens of millions … ",
    "url": "https://www.rollingstone.com/politics/politics-features/elon-musk-starlink-faa-officials-find-funding-1235285246/"
  },
  {
    "text": "Israel cuts off Gaza aid to pressure Hamas to accept new ceasefire proposal  —  Israel stopped the entry of all goods and supplies into the Gaza Strip on Sunday and warned of “additional consequences” if Hamas doesn't accept a new proposal to extend a fragile ceasefire.",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-02-2025-99402570996dcf33239d0492d99909e4"
  },
  {
    "text": "UK pledges export financing for air defense as world leaders discuss ending war in Ukraine  —  British Prime Minister Keir Starmer said Sunday he does not see the U.S. as an unreliable ally, but Europe must continue to provide funding for Ukraine to put it in a stronger position if peace is negotiated.",
    "url": "https://apnews.com/article/ukraine-britain-zelenskyy-europe-starmer-trump-russia-b980170ead74a1a7914c565f14ee6cc9"
  },
  {
    "text": "In Ukraine, Many Watch and Wait for Signs of Hope From Abroad  —  After a summit of European leaders in London, Prime Minister Kier Starmer said a “coalition of the willing” would be assembled to defend Ukraine, but he did not name the countries expected to participate.  —  Stephen Castle and Jeanna Smialek",
    "url": "https://www.nytimes.com/live/2025/03/02/us/trump-news-zelensky-europe?unlocked_article_code=1.004.1Vhs.RD4JB8HptudB&smid=url-share"
  },
  {
    "text": "CNN Poll: Public remains negative on Trump ahead of address to Congress  —  The American public's view of Donald Trump's presidency and the direction he's leading the country is more negative than positive just ahead of his first formal address to Congress since returning to office, according to a new CNN poll conducted by SSRS.",
    "url": "https://www.cnn.com/2025/03/02/politics/poll-trump-negative-congress-address/"
  },
  {
    "text": "AOC calls Elon Musk a ‘leech’ on the public as their tit-for-tat feud continues  —  ‘No matter how many billions he gets in tax cuts and government contracts, it will never be enough for him,’ Alexandria Ocasio-Cortez said  —  Your support helps us to tell the story",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/alexandria-ocasio-cortez-elon-musk-leech-doge-b2707377.html"
  },
  {
    "text": "Playbook: Democrats in despair  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Happy Sunday.  You have roughly eight hours to catch up on Oscars movies before the big awards show begins tonight at 7 p.m. Drop me a line: [email protected].  —  DRIVING THE DAY",
    "url": "https://www.politico.com/newsletters/playbook/2025/03/02/democrats-in-despair-00206883"
  },
  {
    "text": "Centrist Dem group rails against leftist identity politics and purity tests  —  Centrist Democrats produced a five-page document of takeaways at a retreat organized by Third Way.  —  When several dozen Democratic political operatives and elected officials gathered at a tony resort off … ",
    "url": "https://www.politico.com/news/2025/03/02/third-way-patriotism-democrats-campaign-00206890"
  },
  {
    "text": "DOGE Claims Credit for Killing Contracts That Were Already Dead  —  Elon Musk's group claimed credit for canceling procurement agreements that had been completed years earlier, the latest in a string of public errors on its site.  —  While George W. Bush was president … ",
    "url": "https://www.nytimes.com/2025/03/02/us/politics/doge-musk-contracts-errors.html?unlocked_article_code=1.004.cQmy.o6z0GzXWryLU"
  },
  {
    "text": "Trump names cryptocurrencies in strategic reserve; prices spike  —  U.S. President Donald Trump announced the names of five digital assets he expects to include in a new U.S. crypto strategic reserve on Sunday, spiking the market value of each.  —  Trump said on social media … ",
    "url": "https://www.reuters.com/world/us/trump-says-cryptocurrency-strategic-reserve-includes-xrp-sol-ada-2025-03-02/"
  },
  {
    "text": "Putin ally pushes deal to restart Nord Stream 2 with US backing  —  Ex-spy Warnig's plan to involve American investors shows breadth of Trump's rapprochement with Russian president  —  A former spy and close friend of Vladimir Putin has been engineering a restart of Russia's Nord Stream 2 gas pipeline … ",
    "url": "https://www.ft.com/content/dc9c51ab-03cb-47ba-ad0a-09c4deed9b50"
  },
  {
    "text": "'It Feels Like It's Chaotic on Purpose'  —  “It's chaotic, and it feels like it's chaotic on purpose.”  —  Late Friday night the Trump administration, as part of its push to modernize the government with software, laid off roughly 90 people from the General Services Administration … ",
    "url": "https://www.theatlantic.com/technology/archive/2025/03/doge-elon-musk-18f-elimination-efficiency/681894/?gift=PUGLa-mGupQ6uJoaPKPPdwivlLeouh-LdcHAREwWF7g&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Judge rules Trump's firing of federal workforce watchdog was illegal  —  Decision reinstating special counsel sets up executive power fight that Supreme Court is likely to resolve  —  A federal judge ruled Saturday that President Donald Trump's firing of a federal workforce watchdog was illegal … ",
    "url": "https://www.politico.com/news/2025/03/01/judge-rules-trumps-firing-of-federal-workforce-watchdog-was-illegal-00206877"
  },
  {
    "text": "How DOGE detonated a crisis at a highly sensitive nuclear weapons agency  —  Perfunctory mass firings sparked alarm across the country, as cost-cutting missteps throughout government rattle lawmakers  —  Amid the tumult of mass firings, the Trump administration's dismissal of workers … ",
    "url": "https://www.washingtonpost.com/business/2025/03/02/doge-nuclear-worker-firings-musk-trump/"
  },
  {
    "text": "Canada PM Trudeau says protecting independence is his priority in talks with King Charles  —  Canadian Prime Minister Justin Trudeau said his priority in talks with King Charles on Monday will be protecting his country's sovereignty after U.S. President Donald Trump recently suggested making Canada the 51st U.S. state.",
    "url": "https://www.reuters.com/world/uk/canada-pm-trudeau-says-protecting-independence-is-his-priority-talks-with-king-2025-03-02/"
  },
  {
    "text": "Speaker Johnson says it's ‘absurd’ to claim Republicans support Putin: Full interview  —  In an interview with Meet the Press, House Speaker Mike Johnson (R-La.) defends President Trump's hostile meeting with Ukrainian President Volodymyr Zelenskyy, but says Republicans “understand” … ",
    "url": "https://www.nbcnews.com/meet-the-press/video/speaker-johnson-says-it-s-absurd-to-claim-republicans-support-putin-full-interview-233290309782"
  },
  {
    "text": "As JD Vance takes ski weekend in Vermont, protesters give him the cold shoulder  —  Anger over Oval Office dispute with Ukrainian President Volodymyr Zelensky draws demonstrators  —  WARREN, Vt. — Fresh powder covered the mountains at Sugarbush Resort on Saturday morning … ",
    "url": "https://www.bostonglobe.com/2025/03/01/metro/jd-vance-vermont-visit-sugarbush-resort/"
  },
  {
    "text": "Russia celebrates US foreign policy that now ‘coincides’ with Moscow's worldview  —  Moscow hopes to take advantage of a growing rift between the U.S. and Ukraine, and Europe more broadly.  —  The Kremlin on Sunday cheered the shift in U.S. foreign policy under President Donald Trump … ",
    "url": "https://www.politico.eu/article/russia-celebrates-united-states-foreign-policy-coinciding-moscow-ukraine/"
  },
  {
    "text": "John Gotti would have OK'd the Trump-Vance mob hit on Zelensky  —  The late American architect Philip Johnson is famous for his iconic 20th-century skyscrapers and also less well-known — while fascinating his biographers — for a 1930s flirtation with rising global fascism during … ",
    "url": "https://www.inquirer.com/opinion/commentary/trump-zelensky-ukraine-mob-boss-20250302.html"
  }
]