[
  {
    "text": "SCOTUS pushes Trump immunity decision to after debate … - Trump's two federal cases — one on his alleged efforts to undermine the results of the 2020 election and the other on his handling of classified documents after his time in the White House — hinge on the court's decision.",
    "url": "https://www.axios.com/2024/06/27/trump-immunity-decision-deabte-scotus"
  },
  {
    "text": "Scoop: Biden seizes debate limelight for “Project 2025” push … - The Trump campaign points instead to the Agenda47 website for policies explicitly endorsed by former President Trump. … - Google search interest in “Project 2025” surged earlier this month, and a John Oliver segment … ",
    "url": "https://www.axios.com/2024/06/27/biden-project-2025-trump-debate"
  },
  {
    "text": "Trump allies' 920 page plan to give Trump more power over your daily life, gut democratic checks and balances, and consolidate power in the Oval office.  —  Project 2025 is the plan by Donald Trump's MAGA Republican allies to give Trump more power over your daily life, gut democratic checks and balances … ",
    "url": "https://joebiden.com/project2025/"
  },
  {
    "text": "Here's what could actually move the 2024 needle during tonight's debate  —  Everything will be under a microscope — from the candidates to the moderators to the mics.  —  Joe Biden and Donald Trump will have just 90 minutes tonight to set the tone for the next phase of the presidential campaign … ",
    "url": "https://www.politico.com/news/2024/06/27/trump-biden-debate-political-strategists-00165284"
  },
  {
    "text": "Debate day brings bad news for Biden  —  DEBATE DAY BRINGS BAD NEWS FOR BIDEN.  It's only natural for pollsters and other political professionals to try to take the public's temperature about a presidential race right before a big debate.  The debate might have little effect on the race … ",
    "url": "https://www.washingtonexaminer.com/daily-memo/3061070/debate-day-brings-bad-news-for-biden/"
  },
  {
    "text": "In a scathing dissent, Justice Ketanji Brown Jackson says Idaho abortion ruling is ‘not a victory for pregnant patients’  —  The 5-4 decision allows Idaho patients to obtain emergency abortions for now, but sidestepped a ruling on whether Idaho's strict abortion law conflicts with federal law.",
    "url": "https://www.nbcnews.com/politics/supreme-court/scathing-dissent-justice-ketanji-brown-jackson-says-idaho-abortion-rul-rcna159250"
  },
  {
    "text": "Supreme Court allows emergency abortion access in Idaho for now  —  The decision is a temporary win for the Biden administration.  —  The Supreme Court, June 26, 2024, in Washington, D.C.  —  The Supreme Court on Thursday issued a ruling that will allow emergency abortion access in Idaho … ",
    "url": "https://abcnews.go.com/Politics/supreme-court-allows-emergency-abortion-access-idaho-now/story?id=111458290"
  },
  {
    "text": "Supreme Court blocks EPA's interstate air pollution regulation  —  The Environmental Protection Agency's “good neighbor” rule is aimed at reducing air pollution that crosses state lines and contributes to smog.  —  WASHINGTON — The Supreme Court on Thursday blocked a Biden administration … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-blocks-epas-interstate-air-pollution-reg-rcna141387"
  },
  {
    "text": "The Supreme Court strips the SEC of a critical enforcement tool in fraud cases  —  The Supreme Court on Thursday stripped the Securities and Exchange Commission of a major tool in fighting securities fraud in a decision that also could have far-reaching effects on other regulatory agencies.",
    "url": "https://apnews.com/article/supreme-court-regulatory-agencies-sec-36f16444b1d4fc52985fdb68896362bb"
  },
  {
    "text": "Exclusive: Michelle Obama's private frustration with the Bidens … - Michelle Obama also was initially reluctant to campaign for Biden after he became the Democratic nominee in 2020, people familiar with the situation told Axios.  — Biden's team says the relationship between the families is strong … ",
    "url": "https://www.axios.com/2024/06/27/michelle-obama-private-frustration-bidens-2024-election"
  },
  {
    "text": "Supreme Court blocks Purdue Pharma opioid settlement  —  The justices ruled that a bankruptcy judge did not have the authority to let members of Sackler family evade facing future lawsuits.  —  WASHINGTON — The Supreme Court on Thursday blew up the massive bankruptcy reorganization … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-blocks-purdue-pharma-opioid-settlement-rcna139066"
  },
  {
    "text": "US intel indicates war between Israel and Hezbollah inching closer  —  The State Department urged U.S. citizens Thursday to “strongly reconsider” travel to Lebanon.  —  A large-scale confrontation between Israel and Hezbollah is likely to break out in the next several weeks if Jerusalem … ",
    "url": "https://www.politico.com/news/2024/06/27/us-intelligence-israel-hezbollah-war-00165338"
  },
  {
    "text": "The Supreme Court rules that state officials can engage in a little corruption, as a treat  —  On a 6-3 party-line vote, the Supreme Court ruled on Wednesday that state officials may accept “gratuities” from people who wish to reward them for their official actions, despite a federal anti-corruption statute … ",
    "url": "https://www.vox.com/scotus/357170/supreme-court-snyder-united-states-corruption"
  },
  {
    "text": "25+ Years of Daily Show Clips Gone as Paramount Axes Comedy Central Site  —  First on LateNighter: One of the richest repositories of late-night videos is no longer.  —  ComedyCentral.com had been home to clips from every episode of The Daily Show since 1999, and the entire run of The Colbert Report … ",
    "url": "https://latenighter.com/news/paramount-axes-comedy-central-website-show-clips-library/"
  },
  {
    "text": "Right-wing group gets Anne Frank's Diary and other Holocaust books taken from Texas school  —  Pastor Luis Cabrera and his conservative group threatened to shut down school board meetings if a superintendent of a school district in the Rio Grande Valley of Texas did not heed their demands … ",
    "url": "https://www.rawstory.com/book-ban-texas-mission-cisd/"
  },
  {
    "text": "Meadows quietly fights for his White House records  —  Newly disclosed court filings show that Meadows has been pressing the National Archives and special counsel Jack Smith since May to turn over massive troves of records.  —  Donald Trump's former chief of staff, Mark Meadows … ",
    "url": "https://www.politico.com/news/2024/06/27/mark-meadows-white-house-records-00165364"
  },
  {
    "text": "Kari Lake skips out on Arizona Senate GOP primary debate as she looks ahead to November  —  The frontrunner for the Republican Senate nomination held a town hall instead Wednesday night, leaving her primary opponent, Mark Lamb, alone on the stage.  —  TUCSON, Ariz. — On the eve … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kari-lake-skips-arizona-senate-gop-primary-debate-rcna158055"
  },
  {
    "text": "What Kind of ‘Psycho’ Calls Dead Americans ‘Losers’ and ‘Suckers’?  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  Perhaps you've noticed lately that Donald Trump, a man not known for subtlety, has been testing the limits of the Streisand effect.",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/what-kind-of-psycho-calls-dead-americans-losers-and-suckers/678807/"
  }
]