[
  {
    "text": "Dems freak out over Biden's debate performance: ‘Biden is toast’  —  One prominent operative texted, “Time for an open convention.”  —  President Joe Biden opened the debate with a raspy voice and disjointed, rambling answers, reigniting Democratic concerns about his age and ability to take on former President Donald Trump.",
    "url": "https://www.politico.com/news/2024/06/27/biden-debate-opening-concerns-00165595"
  },
  {
    "text": "Biden's Shaky Debate Performance Has Democrats Panicking  —  President Biden's shaky, halting debate performance has Democrats talking about replacing him on the ticket.  —  Leer en español阅读.体中文.閱讀.體中文.",
    "url": "https://www.nytimes.com/2024/06/27/us/politics/biden-debate-democrats.html"
  },
  {
    "text": "Democrats Privately Discuss Replacing Biden on Presidential Ticket  —  Halting debate performance spurs turmoil in the party over 2024 candidate  —  ATLANTA—President Biden's halting performance against Donald Trump on Thursday left the Democratic Party in turmoil, with officials trying … ",
    "url": "https://www.wsj.com/politics/elections/democrats-privately-discuss-replacing-biden-on-presidential-ticket-73622773"
  },
  {
    "text": "Fact checking the CNN presidential debate  —  Both President Joe Biden and former President Donald Trump made false and misleading claims during CNN's presidential debate on Thursday - but Trump did so far more than Biden, just like in their debates in 2020.  —  Trump made more than 30 false claims at the Thursday debate.",
    "url": "https://www.cnn.com/2024/06/27/politics/fact-checking-the-cnn-presidential-debate/"
  },
  {
    "text": "Biden-Trump 2024 debate live updates: Candidates slug it out over economy and immigration  —  President Joe Biden and former President Donald Trump are facing off in the first debate of the 2024 election cycle.  It's the first time they've met since the 2020 campaign. … FACT CHECK",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/presidential-debate-trump-biden-live-updates-rcna157191?canonicalCard=true"
  },
  {
    "text": "Joe Biden Mumbles and Stumbles the Democrats Into Crisis  —  PLEASE JOE, NO  —  Two old men, the incumbent and the former president, faced off in Atlanta.  Amid fierce but farcical exchanges, Biden came off worse.  —  With the future of American democracy at stake, the first presidential debate … ",
    "url": "https://www.thedailybeast.com/bidens-gaffes-hand-trump-a-weapon-finally-beat-medicare"
  },
  {
    "text": "SCOTUS is going into July, destroying executive agency powers along the way  —  In SEC and EPA decisions, the conservatives are on a “power grab,” as Justice Sotomayor told us in dissent.  Also: We got the EMTALA disposition.  —  “You had one job.”  —  By 10:30 a.m. Thursday … ",
    "url": "https://www.lawdork.com/p/scotus-is-going-into-july-destroying"
  },
  {
    "text": "The Supreme Court just lit a match and tossed it into dozens of federal agencies  —  On Thursday, the Court handed down a 6-3 decision, on a party-line vote, that could render a simply astonishing array of federal laws unenforceable.  As Justice Sonia Sotomayor writes in dissent … ",
    "url": "https://www.vox.com/scotus/357554/supreme-court-sec-jarkesy-roberts-sotomayor-chaos"
  },
  {
    "text": "Supreme Court sidesteps ruling on emergency room abortion-access dispute  —  The court opted against deciding whether Idaho's abortion ban conflicts with a federal law that sets standards for hospital emergency room care, leaving legal question unresolved.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court-sidesteps-ruling-emergency-room-abortion-access-dispute-rcna159111"
  },
  {
    "text": "Judge Aileen Cannon pushes back on idea that more hearings will delay Trump classified documents case  —  Judge Aileen Cannon wants to hold additional hearings on Donald Trump's attempts to challenge key evidence in his classified documents case and will allow the former president's lawyers … ",
    "url": "https://www.cnn.com/2024/06/27/politics/aileen-cannon-trump-mar-a-lago-search-warrant-hearing/"
  },
  {
    "text": "Oklahoma's State Superintendent Requires Public Schools to Teach the Bible  —  The state superintendent, Ryan Walters, said the Bible was a “necessary historical document” that must be taught in certain grades.  —  Oklahoma's state superintendent on Thursday directed all public schools to teach the Bible … ",
    "url": "https://www.nytimes.com/2024/06/27/us/oklahoma-public-schools-bible.html"
  },
  {
    "text": "Trump Should Never Have Had This Platform  —  The debate was a travesty—because its whole premise was to treat a failed coup leader as a legitimate candidate for the presidency again.  —  The first question about January 6 was asked at Minute 41.  —  Donald Trump replied with a barrage of crazy lies … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/debate-trump-platform-january-6/678818/"
  },
  {
    "text": "Man on trial for threatening to kill presidential candidates found dead as jury was deciding verdict  —  CONCORD, N.H. (AP) — A New Hampshire man on trial for threatening the lives of presidential candidates last year has been found dead while a jury was deciding his verdict, according to court filings.",
    "url": "https://apnews.com/article/death-threats-trial-presidential-candidates-ff728a4116a4ab7b21fdaf64e7173b25"
  },
  {
    "text": "Arizona RNC delegation chair: ‘I would lynch’ county election official  —  Shelby Busch has framed her quest to unearth election fraud in the battleground state in the language of a religious holy war.  —  PHOENIX — Earlier this month Shelby Busch — chair of Arizona's delegation … ",
    "url": "https://www.washingtonpost.com/national-security/2024/06/27/shelby-busch-stephen-richer-arizona-lynching/"
  },
  {
    "text": "Prosecutors Accuse Illegal Alien, Freed into U.S. by Biden's DHS, of Murdering Girl on Her 21st Birthday  —  An illegal alien, released into the United States by President Joe Biden's Department of Homeland Security (DHS), has been accused of murdering a young woman on her twenty-first birthday … ",
    "url": "https://www.breitbart.com/crime/2024/06/27/prosecutors-accuse-illegal-alien-freed-into-u-s-bidens-dhs-murdering-girl-her-21st-birthday/"
  },
  {
    "text": "Biden makes stunning omission while claiming no troops died ‘anywhere in the world’ on his watch  —  13 US service members were killed by an ISIS-K suicide bomber during the Biden administration's botched Afghanistan withdrawal  —  President Biden claimed during the CNN Presidential Debate … ",
    "url": "https://www.foxnews.com/politics/biden-makes-stunning-omission-while-claiming-no-troops-died-anywhere-in-world"
  },
  {
    "text": "Inside the Right-Wing Campaign to End Protections for Endangered Species  —  Leonard Leo's dark money hubs have funneled over $2 million to climate denial groups working to gut the Endangered Species Act  —  Leonard Leo, best known as the architect of the Supreme Court's conservative supermajority … ",
    "url": "https://www.rollingstone.com/politics/politics-features/leonard-leo-right-wing-campaign-endangered-species-act-1235047191/"
  }
]