[
  {
    "text": "‘Pennsylvania is such a mess’: Inside Team Harris' unusual levels of finger-pointing  —  Many of the state's most well-connected Democrats have been worried about the operation for months.  —  PHILADELPHIA — Top Democrats in Pennsylvania are worried Vice President Kamala Harris' operation … ",
    "url": "https://www.politico.com/news/2024/10/16/kamala-harris-pennsylvania-campaign-drama-00183844"
  },
  {
    "text": "“His brain is completely out of commission”: Moderator repeatedly calls out Trump for rambling  —  The 78-year-old Republican could not stay focused nor answer basic questions about tariffs and his economic agenda  —  Speaking at the Economic Club of Chicago on Tuesday … ",
    "url": "https://www.salon.com/2024/10/16/his-brain-is-completely-out-of-commission-moderator-repeatedly-calls-out-for-rambling/"
  },
  {
    "text": "The Delusions of the Donald  —  We'll see you tomorrow, Philadelphia!  Happy Wednesday.  —  Uh, What Was That?  —  by Andrew Egger  —  Back in January, the great McKay Coppins wrote a piece for the Atlantic titled “You Should Go to a Trump Rally.”  The idea was that secondhand media accounts … ",
    "url": "https://www.thebulwark.com/p/the-delusions-of-the-donald"
  },
  {
    "text": "Republicans Tell Trump That Elon Musk's Super PAC Is Blowing It  —  Donald Trump's allies have been warning him that Musk's field operation is failing in key states — and that it's being led by DeSantis' failed team  —  Donald Trump has largely outsourced his 2024 campaign's … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-elon-musk-republicans-super-pac-election-2024-1235134877/"
  },
  {
    "text": "Druckenmiller Says Market Is ‘Very Convinced’ Trump Will Win  —  Druckenmiller Says He'll Probably Write-In Someone When He Votes  —  Billionaire investor Stan Druckenmiller said markets are pricing in a Donald Trump victory ahead of next month's US presidential election.",
    "url": "https://www.bloomberg.com/news/articles/2024-10-16/druckenmiller-says-market-is-very-convinced-trump-will-win"
  },
  {
    "text": "MAGA host says friends are ‘moving to foreign countries’ if Kamala Harris beats Trump  —  Pro-MAGA TV host Gina Loudon revealed that her friends are “moving to a foreign country” if Vice President Kamala Harris wins her bid for the White House.  —  Loudon made the admission during a Wednesday broadcast on Real America's Voice.",
    "url": "https://www.rawstory.com/trump-fans-moving-if-harris-wins/"
  },
  {
    "text": "‘Off the charts:’ How Trump tariffs would shock U.S., world economies  —  If implemented, the former president's tariff plans would lead to higher costs, stock market volatility and feuds with the rest of the world.  —  Former president Donald Trump is campaigning on the most significant increase … ",
    "url": "https://www.washingtonpost.com/business/2024/10/16/trump-tariffs-impact-economy/"
  },
  {
    "text": "Fulton County DA asks appeals court to restore three election subversion charges against Donald Trump  —  Fulton County District Attorney Fani Willis has asked the state's Court of Appeals to reinstate six counts in the election subversion case against Donald Trump and his co-defendants … ",
    "url": "https://www.cnn.com/2024/10/16/politics/fulton-county-fani-willis-donald-trump"
  },
  {
    "text": "Jimmy Carter votes for Kamala Harris  —  The former president, who turned 100 earlier this month, said he wanted to live long enough to vote for the Democratic presidential nominee.  —  Former President Jimmy Carter told his family he was more interested in voting for Vice President Kamala Harris … ",
    "url": "https://www.ajc.com/politics/jimmy-carter-just-turned-100-fulfilled-wish-to-vote-for-kamala-harris/HTE7BVP3AZDIJJNZE3XPYPNGXI/"
  },
  {
    "text": "Fact check: Trump makes at least 19 false claims in one-hour Fox town hall with women  —  Former President Donald Trump, who trails with women in recent national polls, participated in a Fox News town hall event on Tuesday in front of a female audience.  —  He told a bunch of lies.",
    "url": "https://www.cnn.com/2024/10/16/politics/fact-check-trump-false-claims-fox-townhall/"
  },
  {
    "text": "Stealth Edit: FBI Quietly Revises Violent Crime Stats  —  When the FBI originally released the “final” crime data for 2022 in September 2023, it reported that the nation's violent crime rate fell by 2.1%.  This quickly became, and remains, a Democratic Party talking point to counter Donald Trump's claims of soaring crime.",
    "url": "https://www.realclearinvestigations.com/articles/2024/10/16/stealth_edit_fbi_quietly_revises_violent_crime_stats_1065396.html"
  },
  {
    "text": "Supreme Court clears way for Biden's plan to cut power plant emissions  —  The Biden administration has said its plan would protect communities from pollution and help the nation meet long-term goals to combat the climate crisis.  —  The Supreme Court cleared the way Wednesday … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/16/supreme-court-biden-power-plant-emissions-climate/"
  },
  {
    "text": "Donald Trump bears responsibility for Jan. 6 attack, Jack Smith argues in new filing  —  The special counsel says Trump “willfully caused his supporters to obstruct and attempt to obstruct” the certification of Joe Biden's victory in 2020.  —  WASHINGTON — A team of federal prosecutors led … ",
    "url": "https://www.nbcnews.com/politics/justice-department/donald-trump-bears-responsibility-jan-6-attack-jack-smith-argues-new-f-rcna175707"
  },
  {
    "text": "Trump calls himself ‘father of IVF,’ doubles down on ‘enemy within’ remarks in town hall  —  Trump also doubled down on his “enemy from within” comments.  —  Republican presidential nominee former President Donald Trump speaks during a break in a Fox News town hall with Harris Faulkner, Oct. 15, 2024, in Cumming, Ga.",
    "url": "https://abcnews.go.com/Politics/trump-calls-father-ivf-women-town-hall-fox/story?id=114853544"
  },
  {
    "text": "I'm an Undecided Hobbit, Torn Between a Dark Lord Who Promises an Age of Chaos and an Elf Queen Whom I Just Wish I Knew More About  —  I'm a well-informed Hobbit—a Boffin from Overhill, thank you very much—who is in a kerfuffle about whom to throw my Hobbit-sized support behind.",
    "url": "https://www.mcsweeneys.net/articles/im-an-undecided-hobbit-torn-between-a-dark-lord-who-promises-an-age-of-chaos-and-an-elf-queen-whom-i-just-wish-i-knew-more-about"
  },
  {
    "text": "America revolted against Tostitos and Ruffles.  Now they're making big changes  —  New York CNN  —  PepsiCo is unshrinking shrinkflation.  —  The owner of Lay's, Doritos, Tostitos and Ruffles chips will put more chips in some bags to claw back customers tired of higher prices with skimpier bags.",
    "url": "https://www.cnn.com/2024/10/16/business/tostitos-chips-shrinkflation-pepsi/"
  },
  {
    "text": "JD Vance Adviser Posted on Reddit for Years About Use of Cocaine, ‘Gas Station Heroin,’ Other Drugs  —  Aaron Kofsky, JD Vance's financial policy adviser, called Vance “a Trump boot licker” and instructed users on how to transport drugs through TSA in the posts.  “Coke then opiates is always my go-to,” he wrote.",
    "url": "https://www.wired.com/story/jd-vance-adviser-posted-drug-use-reddit-cocaine-gas-station-heroin/"
  },
  {
    "text": "Democrats flooded with cash in fight for Congress as the GOP tries to stretch its money  —  Democrats in key Senate and House races once again posted huge fundraising numbers, vastly outspending their Republican opponents from July through September.  —  New fundraising reports detail … ",
    "url": "https://www.nbcnews.com/politics/2024-election/democrats-flooded-cash-fight-congress-gop-stretch-money-rcna175636"
  },
  {
    "text": "Trump's campaign is trying to hide his sad state from voters  —  His decline is undeniable.  They're hoping you don't notice in time. … MAGA-friendly CNBC host Joe Kernen dropped an interesting nugget right as Squawk Box went to commercial break on Tuesday.  —  “Well, Trump canceled, and he was going to come on,” Kernen said.",
    "url": "https://www.publicnotice.co/p/trump-cancels-cnbc-cnn-debate"
  },
  {
    "text": "Swing State Poll 2024: Georgia, North Carolina: Trump Holds Lead In GA, Harris On Upside Of Tight Race In NC, Quinnipiac University Poll Finds; NC Gubernatorial Race: Stein Leads Robinson By Double Digits  —  mail_outline  —  GEORGIA: Trump 52%, Harris 45%, other candidates 2%",
    "url": "https://poll.qu.edu/poll-release?releaseid=3914"
  },
  {
    "text": "The U.S. Presidential Contest, October 16, 2024  —  Marist National Poll  —  Harris +5 Points Against Trump Nationally  —  In the presidential contest, Vice President Kamala Harris leads former President Donald Trump by five points among likely voters, including those who are undecided yet leaning toward a candidate.",
    "url": "https://maristpoll.marist.edu/polls/the-u-s-presidential-contest-october-16-2024/"
  },
  {
    "text": "GOP Senate candidate: Department of Education only created to help ‘little Black girls’  —  The Montana U.S. Senate race took a turn when controversial businessman Tim Sheehy said that the U.S. should eliminate the Department of Education because it was turning children into slaves.",
    "url": "https://www.rawstory.com/tim-sheehy-education/"
  },
  {
    "text": "Elon Musk Helped Fund The Most Cynical Super PAC Of The 2024 Election  —  Future Coalition PAC has argued to Arab American voters that Kamala Harris is too pro-Israel — and to Jewish voters that she is too pro-Palestinian.  —  LOADING  —  A super PAC engaged in a cynical two-step designed … ",
    "url": "https://www.huffpost.com/entry/elon-musk-funds-most-cynical-super-pac_n_670ef96be4b0c5b8c0afcc86"
  },
  {
    "text": "You should be using an RSS reader (permalink)  —  No matter how hard we all wish it were otherwise, the sad fact is that there aren't really individual solutions to systemic problems.  For example: your personal diligence in recycling will have no meaningful impact on the climate emergency.",
    "url": "https://pluralistic.net/2024/10/16/keep-it-really-simple-stupid/#read-receipts-are-you-kidding-me-seriously-fuck-that-noise"
  },
  {
    "text": "The Twilight of America's Excuses  —  Over the last decade we've created a stream of rationalizations for why so many voters want Trumpism.  That stream is about to dry up.  —  ∙ Paid  —  Sarah, Tim, and I taped a gigantic, super-sized TNL last night in preparation … ",
    "url": "https://www.thebulwark.com/p/the-twilight-of-americas-excuses"
  },
  {
    "text": "Revealed: International ‘race science’ network secretly funded by US tech boss  —  Group promoting ‘dangerous’ scientific racism ideology teamed up with rightwing extremist, recordings reveal  —  An international network of “race science” activists seeking to influence public debate … ",
    "url": "https://www.theguardian.com/world/2024/oct/16/revealed-international-race-science-network-secretly-funded-by-us-tech-boss"
  },
  {
    "text": "Alabama Voter Roll Purge Before Election Is Blocked by Judge  — Alabama officials violated federal ‘quiet’ period, judge rules  — Justice Department also suing Virginia over pre-election cull  —  A federal judge blocked Alabama election officials from carrying out a last-minute purge … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-16/alabama-voter-roll-purge-before-election-is-blocked-by-judge"
  },
  {
    "text": "Donald Trump, American Fascist  —  Please note: I will add an audio version of this piece by Wednesday morning.  Thank you for your patience.  —  Donald Trump's closing pitch to the American people is rage, intimidation, and vengeful violence.  He is threatening - or promising, if you ask his supporters - fascism.",
    "url": "https://thomaszimmer.substack.com/p/donald-trump-american-fascist"
  },
  {
    "text": "Justice Department to monitor voting in Ohio county after sheriff's comment about Harris supporters  —  The U.S. Justice Department will send election monitors to an Ohio county where a sheriff was recently accused of intimidating voters in a social media post, federal officials announced Tuesday.",
    "url": "https://apnews.com/article/ohio-sheriff-harris-yard-signs-justice-department-279b00173bac36f4547f5ae69fe62403"
  }
]