[
  {
    "text": "Trump rushed to safety as Secret Service opens fire on man with AK-47 near golf course  —  Donald Trump was rushed to safety by the Secret Service after agents spotted a man with an AK-47 near his golf course and agents opened fire, law enforcement sources said.",
    "url": "https://nypost.com/2024/09/15/us-news/shooting-reported-at-donald-trumps-golf-club-while-ex-president-was-on-grounds/"
  },
  {
    "text": "Trump was the subject of an apparent assassination attempt at his Florida golf club, the FBI says … The FBI said Donald Trump was the target of “what appears to be an attempted assassination” at his golf club in West Palm Beach, Florida, on Sunday, just nine weeks after the Republican … ",
    "url": "https://apnews.com/article/trump-shooting-gunshots-florida-f62f8378d3a8ce7b2e99d6a8fb40aba9"
  },
  {
    "text": "Election 2024 latest news: FBI investigating incident at Trump's golf course as potential assassination attempt  —  Who is ahead in Harris vs. Trump 2024 presidential polls right now?  —  Earlier today  —  Trump golf course incident investigated as potential assassination attempt  —  Just now",
    "url": "https://www.washingtonpost.com/elections/2024/09/15/2024-election-campaign-updates-harris-trump/"
  },
  {
    "text": "Harris expresses relief Trump safe after gunshots  —  Vice President Harris on Sunday expressed relief that former President Trump was safe following what the FBI said appeared to be a new assassination attempt on him in Florida.  —  “I have been briefed on reports of gunshots fired near … ",
    "url": "https://thehill.com/homenews/campaign/4881018-vice-president-harris-briefed-gunshots/"
  },
  {
    "text": "Trump assassination attempt Sunday under investigation: What to know  —  James Powel Phillip M. BaileyUSA TODAY  —  Update: This story has been updated with information from a press conference  —  The Federal Bureau of Investigation said Sunday that it is investigating … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/15/trump-assassination-attempt-florida-golf-course-investigation-news/75239826007/"
  },
  {
    "text": "JD Vance admits he is willing to ‘create stories’ to get media attention  —  Republican vice-presidential candidate defends spreading false, racist claims demonizing Haitian immigrants  —  In a stunning admission, Republican vice-presidential candidate JD Vance said he is willing … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/15/jd-vance-lies-haitian-immigrants"
  },
  {
    "text": "Trump is safe, his campaign says, after a shooting is reported at his golf course.  —  Senator JD Vance stood by debunked claims about Haitian immigrants, saying he was willing to “create stories” about issues.  Former President Donald J. Trump expressed disdain for Taylor Swift … ",
    "url": "https://www.nytimes.com/live/2024/09/15/us/harris-trump-election"
  },
  {
    "text": "John Roberts' Secret Trump Memo Revealed in Huge SCOTUS Leak  —  BOMBSHELL  —  A memo obtained by The New York Times indicated the chief justice wanted to act quick—and decisively—on Donald Trump's presidential immunity.  —  The Supreme Court was hit by a flurry of damaging new leaks Sunday … ",
    "url": "https://www.thedailybeast.com/john-roberts-secret-trump-memo-revealed-in-huge-scotus-leak"
  },
  {
    "text": "How Roberts Shaped Trump's Supreme Court Winning Streak  —  Behind the scenes, the chief justice molded three momentous Jan. 6 and election cases that helped determine the former president's fate.  —  Last February, Chief Justice John G. Roberts Jr. sent his eight Supreme Court colleagues … ",
    "url": "https://www.nytimes.com/2024/09/15/us/justice-roberts-trump-supreme-court.html?unlocked_article_code=1.K04.Hw-C.FVxaHPVlsDTE&smid=url-share"
  },
  {
    "text": "GOP Gov. DeWine defends Haitian immigrants: ‘They came to Springfield to work’  —  Ohio city has been subject of rumors and threats in the presidential race.  —  In this July 14, 2024, file photo, Ohio Governor Mike DeWine takes part in a sound check at the Fiserv Forum ahead … ",
    "url": "https://abcnews.go.com/Politics/gop-gov-dewine-defends-haitian-immigrants-springfield-work/story?id=113690058"
  },
  {
    "text": "Mike Lindell Group Accused of ‘Impersonating’ Election Cybersecurity Initiative  —  Lindell's Election Crime Bureau emailed election officials requesting their home addresses and info about how they monitor security threats … Lindell is a prolific supporter of election denial causes … ",
    "url": "https://www.rollingstone.com/politics/politics-features/mike-lindell-group-accused-impersonating-election-cybersecurity-1235102625/"
  },
  {
    "text": "Trump's Iowa lead shrinks significantly as Kamala Harris replaces Biden, Iowa Poll shows  —  The nationally recognized Iowa Poll's first test of Kamala Harris' strength against Donald Trump indicates she's a more formidable opponent than President Biden in solid-red Iowa",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/2024/09/15/iowa-poll-donald-trump-iowa-lead-shrinks-as-kamala-harris-replaces-joe-biden/75180245007/"
  },
  {
    "text": "Ronald Reagan's former staff back Harris-Walz ticket: “Today is a choice between integrity and demagoguery.”  —  Seventeen former staff members of the late Republican President Ronald Reagan are endorsing the Democratic nominee, Vice President Kamala Harris.",
    "url": "https://www.cbsnews.com/news/ronald-reagan-former-staff-back-harris-walz-ticket/"
  },
  {
    "text": "Data center emissions probably 662% higher than big tech claims.  Can it keep up the ruse?  —  Emissions from in-house data centers of Google, Microsoft, Meta and Apple may be 7.62 times higher than official tally  —  Big tech has made some big claims about greenhouse gas emissions in recent years.",
    "url": "https://www.theguardian.com/technology/2024/sep/15/data-center-gas-emissions-tech"
  },
  {
    "text": "Taliban begins enforcing new draconian laws, and Afghan women despair  —  Afghan religious police wield new power to enforce a ban on women raising their voices in public and looking at men other than their husbands or relatives.  —  As the Taliban begins enforcing new draconian laws … ",
    "url": "https://www.washingtonpost.com/world/2024/09/15/taliban-afghanistan-laws-women-rights/"
  },
  {
    "text": "Trump loses Electric Avenue song legal fight  —  Former US President Donald Trump has been found liable to pay damages to London singer and songwriter Eddy Grant for using his song Electric Avenue without permission.  —  It has taken Mr Grant, 76, more than four years to sue the Republican candidate … ",
    "url": "https://www.bbc.com/news/articles/c1488zz8jnzo"
  }
]