[
  {
    "text": "Biden's big donors fume over Israel criticism … - “Bad, Bad, Bad, decision, on all levels, Pls reconsider,” he wrote in a message obtained by Axios and other news outlets.  — He added: “Let's not forget that there are more Jewish voters, who care about Israel, than Muslim voters that care about Hamas.”",
    "url": "https://www.axios.com/2024/05/10/israel-gaza-biden-rafah-donors"
  },
  {
    "text": "‘We would need to make choices’: Why Biden is threatening Israel now  —  Biden's announcement is an unintentional admission that his efforts to privately sway Netanyahu have had limited effects.  —  After watching Israel flatten much of Gaza, President Joe Biden decided to draw the line at the city of Rafah.",
    "url": "https://www.politico.com/news/2024/05/09/why-biden-is-threatening-israel-rafah-00157203"
  },
  {
    "text": "House Democrats' Surprise Campaign Play: Embracing Border Security  —  Republicans blamed Biden for surge in illegal crossings but blocked bipartisan deal  —  WASHINGTON—Some House Democrats are leaning into border security on the campaign trail after years of playing defense against Republican criticism … ",
    "url": "https://www.wsj.com/politics/elections/house-democrats-surprise-campaign-play-embracing-border-security-7d2bf74f"
  },
  {
    "text": "Jim Jordan's quiet power play for 2025 … - Jordan privately told colleagues what he would be doing differently than Johnson during the recent fight over foreign aid funding, multiple sources told Axios.  — The Ohio Republican has been noticed handing out more campaign checks to colleagues, multiple lawmakers told Axios.",
    "url": "https://www.axios.com/2024/05/09/mike-johnson-jim-jordan-trump-speaker"
  },
  {
    "text": "At a Dinner, Trump Assailed Climate Rules and Asked $1 Billion From Big Oil  —  At a private meeting at Mar-a-Lago, the former president said fossil fuel companies should donate to help him beat President Biden.  —  Former President Donald J. Trump told a group of oil executives … ",
    "url": "https://www.nytimes.com/2024/05/09/climate/trump-oil-gas-mar-a-lago.html"
  },
  {
    "text": "California Students Get $1 Million After They Were Expelled for Wearing Supposedly Racist Acne Masks  —  During a sleepover in August 2017, three 14-year-old boys, two of whom were about to start attending St. Francis High School in Mountain View, California, took a picture of themselves wearing dark green acne masks.",
    "url": "https://reason.com/2024/05/09/california-students-get-1-million-after-they-were-expelled-for-wearing-supposedly-racist-acne-masks/"
  },
  {
    "text": "Trump's trial trap: Voters to be his most important jury … - “It really is an all-or-nothing strategy in the sense that the delaying tactic could be a complete victory if he were to be elected president,” said Robert Mintz, a former federal prosecutor.  — Judges have latitude in sentencing … ",
    "url": "https://www.axios.com/2024/05/10/trump-criminal-trials-2024-election"
  },
  {
    "text": "BREAKING: President Pollack to Retire After Seven Years of Leadership  —  President Martha Pollack announced that she will retire from her position on June 30, in an email sent to the Cornell community on Thursday, May 9.  —  Provost Michael Kotlikoff will serve as interim president … ",
    "url": "https://cornellsun.com/2024/05/09/breaking-president-pollack-to-retire-after-seven-years-of-leadership/"
  },
  {
    "text": "The simple reason Republican Sunday show hits are disasters  —  It's hard to defend the indefensible. … Not so long ago, the Sunday morning news shows were a vital part of the political ecosphere.  Politicians and government officials clamored for the mainstream platform provided by ABC's This Week … ",
    "url": "https://www.publicnotice.co/p/stephanopoulos-mace-sununu-gop-sunday-shows"
  },
  {
    "text": "Exclusive: Jared Kushner pitching donors on father-in-law Trump, sources say  —  Donald Trump's son-in-law, Jared Kushner, has been making calls to encourage donors to attend a Trump fundraiser in New York, two sources told Reuters, in one of the first indications of Kushner working to help re-elect his father-in-law.",
    "url": "https://www.reuters.com/world/us/jared-kushner-pitching-donors-father-in-law-trump-sources-say-2024-05-09/"
  },
  {
    "text": "Medical residents are starting to avoid states with abortion bans, data shows  —  Isabella Rosario Blum was wrapping up medical school and considering residency programs to become a family practice physician when she got some frank advice: If she wanted to be trained to provide abortions, she shouldn't stay in Arizona.",
    "url": "https://www.npr.org/sections/health-shots/2024/05/09/1250057657/medical-residents-starting-avoid-states-abortion-bans"
  },
  {
    "text": "Biden Set to Impose Tariffs on China EVs, Strategic Sectors  — US set to target electric vehicles, reject across-board hikes  — Action comes after multi-year review of Trump-era duties  —  President Joe Biden's administration is poised to unveil a sweeping decision on China tariffs … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-10/biden-poised-to-impose-tariffs-on-china-evs-strategic-sectors"
  },
  {
    "text": "Live Updates: After Stormy Daniels, Testimony Turns to Trump's White House  —  Hours of heated testimony from Ms. Daniels focused on her account of a liaison with Donald J. Trump.  Madeleine Westerhout, who was a key gatekeeper for Mr. Trump during his presidency, followed a Trump Organization employee … ",
    "url": "https://www.nytimes.com/live/2024/05/09/nyregion/trump-trial-stormy-daniels"
  },
  {
    "text": "There's A GOP Plan For An Execution Spree If Trump Wins The White House  —  Buried on page 554 of the plan is a directive to execute every remaining person on federal death row — and dramatically expand the use of the death penalty.  —  LOADING  —  During the final six months … ",
    "url": "https://www.huffpost.com/entry/gop-plan-for-executions-if-trump-wins_n_663b97a7e4b0bcaefbf76812"
  },
  {
    "text": "Shell company steering $2.6 million to Republican PACs raises concerns of illicit funding scheme  —  A complaint with the Federal Election Commission alleges that a corporation with ties to the former chief financial officer of the Republican State Leadership Committee illegally steered nearly $2.6 million … ",
    "url": "https://www.opensecrets.org/news/2024/05/shell-company-steering-millions-to-republican-pacs-raises-concerns-of-illicit-funding-sch"
  },
  {
    "text": "Back-to-back rulings against Hunter Biden pave way for June gun trial  —  Hunter Biden's latest attempts to throw out his federal gun case were rejected in back-to-back rulings Thursday, teeing up a high-stakes criminal trial next month in Delaware.  —  The president's son had asked … ",
    "url": "https://www.cnn.com/2024/05/09/politics/hunter-biden-gun-charge/"
  }
]