[
  {
    "text": "White House to brief lawmakers as House chairman warns of ‘serious national security threat’  —  Lawmakers said the issue is serious but shouldn't cause immediate alarm.  —  National Security Advisor Jake Sullivan speaks during a press briefing at the White House in Washington, Feb. 14, 2024.",
    "url": "https://abcnews.go.com/Politics/white-house-plans-brief-lawmakers-house-chairman-warns/story?id=107232293"
  },
  {
    "text": "US warned allies about Russian space, nuclear capabilities, source says  —  The United States has told Congress and allies in Europe about new intelligence related to Russian nuclear capabilities that could pose an international threat, a source briefed on the matter told Reuters on Wednesday.",
    "url": "https://www.reuters.com/world/us/us-congressional-intelligence-chair-warns-serious-national-security-threat-2024-02-14/"
  },
  {
    "text": "Russia's Advances on Space-Based Nuclear Weapon Draw U.S. Concerns  —  A congressman's cryptic statement about new intelligence set Washington abuzz and infuriated White House officials.  —  The United States has informed Congress and its allies in Europe about Russian advances on a new … ",
    "url": "https://www.nytimes.com/2024/02/14/us/politics/intelligence-russia-nuclear.html"
  },
  {
    "text": "Powerful House GOP chair retiring after Mayorkas impeachment … - Green's decision to retire comes on the same week as the House voted to impeach Homeland Security Secretary Alejandro Mayorkas.  — Green joins House Appropriations Committee Chair Kay Granger (R-Texas) … ",
    "url": "https://www.axios.com/2024/02/14/mark-green-retire-congress-mayorkas-impeachment"
  },
  {
    "text": "Putin says Biden would be better for Russia as president than Trump  —  Russian president also dismissed criticism of Joe Biden's mental fitness.  —  Russian President Vladimir Putin said Wednesday Joe Biden would be better for Russia as president than Donald Trump, ahead of a potential rematch between … ",
    "url": "https://www.politico.eu/article/biden-would-be-a-better-president-than-trump-says-putin/"
  },
  {
    "text": "Special counsel asks Supreme Court to let Trump's 2020 election case proceed to trial without delay  —  Special counsel Jack Smith urged the U.S. Supreme Court on Wednesday to let former President Donald Trump's 2020 election interference case proceed to trial without further delay.",
    "url": "https://apnews.com/article/trump-special-counsel-election-interference-january-6-c2dcc83e56a541804d4785f6bb6cd45c"
  },
  {
    "text": "Tucson school district drops instructor after OnlyFans exposure  —  The woman who resigned as head of an NAACP chapter in 2015 after mispresenting herself as Black, Rachel Dolezal, was working for the Catalina Foothills Unified School District until its officials learned Tuesday of social media content under her current name.",
    "url": "https://tucson.com/news/local/education/precollegiate/rachel-dolezal-tucson-catalina-foothills-school-district-onlyfans/article_7adc55f6-cb6e-11ee-8803-3bcd55b84f0c.html"
  },
  {
    "text": "Senior Republicans fear Trump will tap the RNC to cover legal bills again  —  The president is going to put his people in place on the committee.  Major changes are in store.  —  Several senior Republican officials are concerned that Donald Trump's expected takeover of the RNC will ultimately pave … ",
    "url": "https://www.politico.com/news/2024/02/14/trump-rnc-legal-bills-00141540"
  },
  {
    "text": "Updated: Incident at National Archives Rotunda Closes Galleries to Public  —  Press Release  —  The National Archives Rotunda and galleries in Washington, DC, closed to the public today after two individuals dumped red powder on the encasement protecting the U.S. Constitution at approximately 2:30 pm.",
    "url": "https://www.archives.gov/press/press-releases/2024/nr24-14"
  },
  {
    "text": "Conservative group tells judge it has no evidence to back its claims of Georgia ballot stuffing  —  A conservative group has told a Georgia judge that it doesn't have evidence to support its claims of illegal ballot stuffing during the the 2020 general election and a runoff two months later.",
    "url": "https://apnews.com/article/georgia-elections-true-vote-ballot-stuffing-199113b47bc2df79c63fdf007cd23115"
  },
  {
    "text": "Arizona GOP introduces resolution to declare Trump 2024 winner regardless of the vote  —  Republicans in the Arizona House of Representatives have introduced a resolution that would seek to declare former President Donald Trump the winner of the 2024 presidential election … ",
    "url": "https://www.rawstory.com/trump-2024-arizona/"
  },
  {
    "text": "Huma Abedin Reveals Relationship with George Soros' Son Alex  —  Hilary Clinton's longtime aide reshared a photo showing the two cuddled-up in a booth at a restaurant in Paris.  —  Hilary Clinton's longtime aide Huma Abedin has apparently moved on from her scandal-scarred ex-husband Anthony Weiner … ",
    "url": "https://www.thedailybeast.com/huma-abedin-reveals-relationship-with-george-soros-son-alex-soros"
  },
  {
    "text": "ASSISTANT DEMOCRATIC LEADER CLYBURN STATEMENT ON HOUSE LEADERSHIP ROLE  —  WASHINGTON, D.C. — Today, U.S. House Assistant Democratic Leader James E. Clyburn released the following statement on his decision to step down from House Democratic leadership:  —  “I have informed Leader Hakeem Jeffries … ",
    "url": "https://assistantdemocraticleader.house.gov/media/press-releases/assistant-democratic-leader-clyburn-statement-house-leadership-role"
  },
  {
    "text": "Biden attacked Hur for asking him when Beau died.  That didn't happen, sources say.  —  The president raised his son's death after being asked about his workflow at a Virginia rental home, where he said he found classified materials, two sources said.  —  President Joe Biden lashed … ",
    "url": "https://www.nbcnews.com/politics/justice-department/biden-attacked-hur-asking-beau-died-didnt-happen-sources-say-rcna138709"
  },
  {
    "text": "Mozilla lays off 60 people, wants to build AI into Firefox  —  Memo details layoffs, “strategic corrections,” and a desire for “trustworthy” AI.  —  Mozilla got a new “interim” CEO just a few days ago, and the first order of business appears to be layoffs.",
    "url": "https://arstechnica.com/gadgets/2024/02/mozilla-lays-off-60-people-wants-to-build-ai-into-firefox/"
  },
  {
    "text": "Military says Russian landing ship sunk in Black Sea  —  Editor's Note: This is a developing story and will continue to be updated.  —  The Russian landing ship Caesar Kunikov was sunk in the Black Sea in the morning of Feb. 14, the General Staff of Ukraine's Armed Forces confirmed.",
    "url": "https://kyivindependent.com/media-russian-landing-ship-allegedly-sunk-by-drones-in-black-sea/"
  },
  {
    "text": "America's poorer counties are new investment boomtowns: study  —  There's an unprecedented building boom underway in America.  With it has come a less-noticed phenomenon: a surge of investment into communities left behind in the last economic expansion.",
    "url": "https://www.axios.com/2024/02/14/biden-economy-low-income-investment-study"
  },
  {
    "text": "George Santos Mercilessly Trolls GOP After Democrats Win His Old Seat  —  He even took the time to text his former colleagues to call them “f***ing idiots.”  —  Disgraced former congressman George Santos tore into the Republican Party on Tuesday night after a Democrat won his old House seat … ",
    "url": "https://www.thedailybeast.com/george-santos-mercilessly-trolls-gop-after-democrats-win-his-old-seat"
  }
]