[
  {
    "text": "Trump, GOP seize on campus protests to depict chaos under Biden  —  Republicans highlights images of turmoil, though most of the pro-Palestinian demonstrations have been peaceful  —  Former president Donald Trump and other prominent Republicans are seizing on the eruption of campus protests across … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/29/gaza-college-campus-protests-republicans-attack-biden-chaos/"
  },
  {
    "text": "Green Party presidential candidate among those arrested as campus protests multiply  —  “Physical altercations” occurred Sunday on the UCLA campus when demonstrators breached a security barrier set up to keep people protesting the Israeli war in Gaza separate from counterprotesters, the school said in a statement.",
    "url": "https://www.usatoday.com/story/news/nation/2024/04/28/gaza-war-campus-protests-arrests/73491973007/"
  },
  {
    "text": "Trump and DeSantis meet privately in Florida  —  Former president Donald Trump and Florida Gov. Ron DeSantis met privately Sunday morning in Miami, according to people familiar with the matter, breaking a years-long chill between the presumptive Republican nominee and his onetime chief primary rival.",
    "url": "https://www.washingtonpost.com/politics/2024/04/28/trump-desantis-meeting/"
  },
  {
    "text": "Israeli Officials Believe I.C.C. Is Preparing Arrest Warrants Over War  —  Israeli officials increasingly believe that the International Criminal Court is preparing to issue arrest warrants for senior government officials on charges related to the conflict with Hamas, according to five Israeli and foreign officials.",
    "url": "https://www.nytimes.com/2024/04/28/world/middleeast/icc-arrest-warrants-israel-hamas.html"
  },
  {
    "text": "Playbook: Will MTG put up or shut up?  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  LIVE FROM RIYADH — AP's Matthew Lee: “U.S. Secretary of State ANTHONY BLINKEN said Monday that Israel must still do more to increase the flow of humanitarian aid … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/29/will-mtg-put-up-or-shut-up-00154883"
  },
  {
    "text": "The Far Right's Campaign to Explode the Population  —  Behind the scenes at the first Natal Conference, where a motley alliance is throwing out the idea of winning converts to their cause and trying to make their own instead.  —  The threat, we are told here this weekend, is existential, biological, epoch-defining.",
    "url": "https://www.politico.com/news/magazine/2024/04/28/natalism-conference-austin-00150338"
  },
  {
    "text": "The Supreme Court's men aren't here to protect you  —  This week's arguments at the U.S. Supreme Court were disturbing.  They also, however, can and should serve as a warning siren.  Attention on the courts must be centered in our political discussions to ensure that our courts can serve … ",
    "url": "https://www.lawdork.com/p/the-supreme-courts-men-arent-here"
  },
  {
    "text": "Koch Group Attacks Biden on the Economy, Hoping to Engage Latino Voters  —  Libre, an arm of the conservative network, is set to spend millions of dollars on outreach and advertising as Republicans seek to expand inroads with Hispanic voters.  —  Libre, part of the political network created … ",
    "url": "https://www.nytimes.com/2024/04/29/us/politics/libre-koch-biden-economy.html"
  },
  {
    "text": "Texans wide receiver among 10 hit in mass shooting  —  Houston Texans wide receiver Tank Dell is out of the hospital after suffering an injury in a mass shooting in Florida on Sunday.  —  Dell was at a private event hosted by the restaurant Cabana Live.  Typically, the restaurant limits … ",
    "url": "https://www.washingtonexaminer.com/news/crime/2982458/texans-wide-receiver-among-10-hit-in-mass-shooting/"
  },
  {
    "text": "What Nikki Haley's Supporters Mean for Trump's Chances in November  —  Haley primary voters could play an outsize role in swing-state contests  —  Share of Republican primary votes, by date of election  —  Note: Excludes primaries and caucuses that didn't provide vote totals or didn't have both candidates on the ballot.",
    "url": "https://www.wsj.com/politics/elections/nikki-haley-primary-voters-donald-trump-support-election-82666934"
  },
  {
    "text": "Palestinian leader appeals to US to stop Israel's Rafah offensive  —  More than half of Gaza's population has been displaced to Rafah  —  Palestinian President Mahmoud Abbas says the US is the only country that can stop Israel from attacking Rafah, the southern Gaza city where more than a million people are taking refuge.",
    "url": "https://www.bbc.com/news/world-middle-east-68916315"
  },
  {
    "text": "Secretary Blinken's Travel to Saudi Arabia, Jordan, and Israel  —  Secretary Antony Blinken will travel to Saudi Arabia, Jordan, and Israel April 29-May 1 to meet with regional partners.  The Secretary will discuss ongoing efforts to achieve a ceasefire in Gaza that secures the release … ",
    "url": "https://www.state.gov/secretary-blinkens-travel-to-saudi-arabia-2/"
  },
  {
    "text": "Kristi Noem defends dog slaying as ‘responsible’  —  The story of Noem shooting and killing her 14-month-old puppy named has taken a toll on the potential VP pick's public image.  —  Amid waves of backlash from both sides of the aisle, South Dakota Gov. Kristi Noem on Sunday defended … ",
    "url": "https://www.politico.com/news/2024/04/28/kristi-noem-defends-dog-slaying-00154842"
  },
  {
    "text": "Former Kansas attorney general announces bid for Congress  —  Former Kansas Attorney General Derek Schmidt (R) announced Friday that he will run for Congress in a bid to replace outgoing Rep. Jake LaTurner (R-Kan.).  —  Schmidt announced his campaign just a week after LaTurner said he will retire from Congress.",
    "url": "https://thehill.com/homenews/campaign/4627771-former-kansas-ag-announces-bid-for-congress/"
  },
  {
    "text": "CNN Poll: Trump maintains lead over Biden in 2024 matchup as views on their presidencies diverge  —  Donald Trump continues to hold an advantage over President Joe Biden as the campaign - and the former president's criminal trial - move forward, according to a new CNN poll conducted by SSRS.",
    "url": "https://www.cnn.com/2024/04/28/politics/cnn-poll-trump-biden-matchup/"
  }
]