[
  {
    "text": "Jeffries and Schumer privately warned Biden he could imperil Democrats  —  The Democratic leaders pointed Biden to polls suggesting his candidacy could damage the party's hopes of controlling the House and Senate  —  House Minority Leader Hakeem Jeffries and Senate Majority Leader Charles E. Schumer … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/17/jeffries-schumer-biden-hurting-democrats/"
  },
  {
    "text": "Pelosi privately told Biden polls show he cannot win and will take down the House; Biden responded with defensiveness  —  Former House Speaker Nancy Pelosi privately told President Joe Biden in a recent conversation that polling shows that the president cannot defeat Donald Trump and that Biden … ",
    "url": "https://www.cnn.com/2024/07/17/politics/nancy-pelosi-biden-conversation/"
  },
  {
    "text": "Donors' cash is drying up, Katzenberg warns Biden in private meeting  —  The Scoop  —  Joe Biden met privately in Las Vegas Wednesday with Jeffrey Katzenberg, the film producer and a top campaign adviser, who conveyed a warning: The president's donors' patience is wearing thin, and their cash soon will, too.",
    "url": "https://www.semafor.com/article/07/17/2024/donors-cash-is-drying-up-jeffrey-katzenberg-warns-biden-in-private-meeting"
  },
  {
    "text": "Schumer, Jeffries, Pelosi Reportedly Warn Biden Against Running  —  Senate Majority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries have warned President Joe Biden that his continued candidacy imperils the Democratic Party's chances in the November election, according to multiple news reports.",
    "url": "https://www.bloomberg.com/news/articles/2024-07-18/schumer-jeffries-reportedly-warned-biden-against-his-candidacy"
  },
  {
    "text": "Biden is trying to salvage his campaign.  Democrats say things are only getting worse  —  President Joe Biden has said repeatedly that there is a simple cure for his political troubles: Get out there and show the skeptics that he has what it takes to run for - and win - a second term.",
    "url": "https://www.cnn.com/2024/07/17/politics/biden-outreach-democrats-falls-flat/"
  },
  {
    "text": "President Joe Biden has tested positive for Covid-19  —  President Joe Biden tested positive for Covid-19 on Wednesday and is experiencing mild symptoms, according to the White House.  —  Biden, 81, tested positive following his first event in Las Vegas, where he was expected to later speak at the UnidosUS annual conference.",
    "url": "https://www.cnn.com/2024/07/17/politics/joe-biden-tests-positive-covid-19/"
  },
  {
    "text": "Playbook: The walls close in around Biden  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  For weeks, the Democratic Party has been paralyzed by uncertainty about whether President JOE BIDEN should stay atop the ticket or step aside.",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/18/the-walls-close-in-around-biden-00169335"
  },
  {
    "text": "The VP is clearly the stronger candidate  —  The case for Kamala Harris, from a former hater  —  I did not support selecting Kamala Harris as Joe Biden's running mate in 2020.  —  My reasons for this were pretty boring.  It's genuinely difficult to make it to the top of the political pyramid … ",
    "url": "https://www.slowboring.com/p/the-vp-is-clearly-the-stronger-candidate"
  },
  {
    "text": "Democratic Sen. Bob Menendez tells allies he will resign after bribery conviction  —  The New Jersey lawmaker has faced calls to step down from fellow Democrats, including Gov. Phil Murphy, who will, appoint a senator to finish out Menendez's term.  —  WASHINGTON — Sen. Bob Menendez … ",
    "url": "https://www.nbcnews.com/politics/congress/democratic-sen-bob-menendez-tells-allies-will-resign-bribery-convictio-rcna116970"
  },
  {
    "text": "Biden tests positive for COVID, cancels speaking engagement on Strip  —  Video  —  Poll shows many Latino voters still on fence over Biden, Trump  —  ‘Something went wrong’: Parallels seen between Oct. 1 shooting, Trump assassination attempt  —  Washoe County reverses vote, certifies 2 recounts as legal action looms",
    "url": "https://www.reviewjournal.com/news/politics-and-government/nevada/biden-tests-positive-for-covid-cancels-speaking-engagement-on-strip-3096562/"
  },
  {
    "text": "Biden administration cancels another $1.2B in student debt … - PSLF allows public employees, such as teachers, firefighters, members of law enforcement, and people who work for nonprofit organizations, to apply for forgiveness after making 10 years' worth of payments on their federal student loan balance.",
    "url": "https://www.axios.com/2024/07/18/biden-cancels-student-debt-pslf-program"
  },
  {
    "text": "Project 2025 *is* the GOP platform  —  Don't let them fool you. … Project 2025 — the right-wing template for a second Trump term — is so exhaustively evil, so vast in scope, that it feels impossible to fully comprehend it.  —  However, as the GOP faithful gather in Milwaukee … ",
    "url": "https://www.publicnotice.co/p/project-2025-explained-2024-gop-platform"
  },
  {
    "text": "Trump has given no official info about his medical care for days since an assassination attempt  —  Four days after a gunman's attempt to assassinate former President Donald Trump at a Pennsylvania rally, the public is still in the dark over the extent of his injuries, what treatment … ",
    "url": "https://apnews.com/article/trump-shooting-transparency-db2f4437237ad03d3b04b0b5f1573977"
  },
  {
    "text": "Secret Service was told police could not watch building used by Trump rally shooter  —  Amid probes of security lapses during assassination attempt, Senate Minority Leader Mitch McConnell calls for Secret Service director to resign  —  Local police alerted the Secret Service … ",
    "url": "https://www.washingtonpost.com/nation/2024/07/17/secret-service-trump-rally-shooting-homeland-security-investigation/"
  },
  {
    "text": "J.D. Vance's radical plan to build a government of Trump loyalists  —  Donald Trump's allies have laid out sweeping plans to reshape the executive branch of the federal government if he is returned to power, plans that involve firing perhaps tens of thousands of career civil servants and replacing them with handpicked MAGA allies.",
    "url": "https://www.vox.com/politics/361455/jd-vance-trump-vice-president-rnc-speech"
  },
  {
    "text": "In landmark ruling, South Korea's top court confirms state benefits for gay couples  —  South Korea's supreme court on Thursday upheld a ruling that a same-sex partner was eligible for spousal benefits from state health insurance, a move hailed as a win for LGBTQ rights in a country that has lagged others in the region.",
    "url": "https://www.reuters.com/world/asia-pacific/south-koreas-top-court-upholds-landmark-ruling-over-same-sex-spousal-state-2024-07-18/"
  }
]