[
  {
    "text": "Russian activist and Putin critic Alexei Navalny dies in prison  —  Opposition leader, 47, was being held in jail about 40 miles north of Arctic Circle  —  The Russian opposition leader Alexei Navalny has died in jail, the country's prison service has said, in what is likely to be seen … ",
    "url": "https://www.theguardian.com/world/2024/feb/16/russian-activist-and-putin-critic-alexei-navalny-dies-in-prison"
  },
  {
    "text": "Alexei Navalny, the fiercest foe of Russia's Putin, has died, Russian authorities say  —  Alexei Navalny, the fiercest foe of Russian President Vladimir Putin who crusaded against official corruption and staged massive anti-Kremlin protests, died in prison Friday, Russia's prison agency said.",
    "url": "https://apnews.com/article/russia-navalny-dead-opposition-leader-2d11644f7ae5332587b39150f1fd1738"
  },
  {
    "text": "Alexei Navalny, Russian opposition leader, dies in prison, officials say  —  RIGA, Latvia — Russia's jailed opposition leader, Alexei Navalny, died in a Russian prison colony on Friday, Russia's prison service announced early afternoon, without giving the cause of his death.",
    "url": "https://www.washingtonpost.com/world/2024/02/16/alexei-navalny-dead-russia-prsion/"
  },
  {
    "text": "Putin critic Alexei Navalny, 47, dies in Arctic Circle jail  —  Russia's most significant opposition leader for the past decade, Alexei Navalny, has died in an Arctic Circle jail, the prison service said.  —  Seen as President Vladimir Putin's most vociferous critic, Navalny was serving … ",
    "url": "https://www.bbc.com/news/world-europe-68315943"
  },
  {
    "text": "FBI informant charged with lying about Joe and Hunter Biden's ties to Ukrainian energy company  —  An FBI informant has been charged with fabricating a multimillion-dollar bribery scheme involving President Joe Biden, his son Hunter and a Ukrainian energy company, a claim that is central … ",
    "url": "https://apnews.com/article/hunter-biden-burisma-fbi-informant-lying-6969656f6012780a23a4b8841ce2689b"
  },
  {
    "text": "Special counsel charges FBI informant with lying to the bureau about Hunter and Joe Biden  —  Alexander Smirnov, 43, disliked President Joe Biden, according to the Justice Department.  He was arrested in Las Vegas after returning from a trip overseas.  —  WASHINGTON — An FBI confidential human source … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/special-counsel-charges-fbi-informant-lying-bureau-hunter-joe-biden-rcna139091"
  },
  {
    "text": "Former FBI informant charged with lying about the Bidens' role in Ukraine business, undercutting GOP impeachment inquiry  —  Special counsel David Weiss charged a former FBI informant with lying about President Joe Biden and his son Hunter Biden's involvement in business dealings … ",
    "url": "https://www.cnn.com/2024/02/15/politics/former-fbi-informant-charged-biden-burisma/"
  },
  {
    "text": "Trump permits Jan. 6-related lawsuits against him to advance — for now  —  The former president decided against asking the Supreme Court to intervene and declare him immune but signaled he may challenge the suits later.  —  Donald Trump is passing up the chance to add a fourth case to a trio … ",
    "url": "https://www.politico.com/news/2024/02/15/trump-jan-6-civil-immunity-00141851"
  },
  {
    "text": "Rosendale drops Montana Senate bid — after less than a week  —  Rosendale had just launched his long-anticipated Senate bid last Friday.  —  GOP Rep. Matt Rosendale is dropping his Montana Senate bid less than a week after he officially launched it, he confirmed to POLITICO.",
    "url": "https://www.politico.com/news/2024/02/15/rosendale-drops-montana-senate-bid-00141812"
  },
  {
    "text": "Reporter asks Ron DeSantis why he can affirm his height with lifts, but stands against gender-affirming care  —  In a Thursday morning press conference in Florida, Republican Gov. Ron DeSantis, a failed 2024 presidential candidate, flanked by representatives from the Southern Poverty Law … ",
    "url": "https://www.advocate.com/politics/ron-desantis-shoe-lifts-presser"
  },
  {
    "text": "Fani Willis takes the stand as she fights to stay on Trump criminal case  —  A bid by Trump and other defendants to disqualify her over her romantic relationship with a fellow prosecutor is “contrary to democracy,” she said on the stand.  —  The lead prosecutor in the Georgia case … ",
    "url": "https://www.politico.com/news/2024/02/15/trump-election-interference-georgia-prosecutors-misconduct-hearing-00141651"
  },
  {
    "text": "Witness Told Feds She Was Paid for Sex Parties With Matt Gaetz  —  The Ethics Committee is investigating Gaetz—and has text messages between the congressman and a woman who claims she had sex with Gaetz at parties she was paid to attend. … When ABC News reported on Wednesday … ",
    "url": "https://www.thedailybeast.com/witness-told-feds-she-was-paid-for-sex-parties-with-matt-gaetz"
  },
  {
    "text": "Greece legalizes same-sex marriage despite church opposition  —  ATHENS, Greece — Greece on Thursday became the first Orthodox Christian country to legalize same-sex civil marriage, despite opposition from the influential, socially conservative Greek Church.",
    "url": "https://www.npr.org/2024/02/15/1231881652/greece-legalizes-same-sex-marriage"
  },
  {
    "text": "Joe Rogan and Bret Weinstein Promote AIDS Denialism to an Audience of Millions  —  Weinstein repeated discredited theories to Rogan about HIV not being the cause of AIDS, alarming and infuriating public health experts.  —  Bret Weinstein, the evolutionary biology professor turned podcaster … ",
    "url": "https://www.vice.com/en/article/jg543y/joe-rogan-and-bret-weinstein-promote-aids-denialism-to-an-audience-of-millions"
  },
  {
    "text": "House GOP sets rule-vote failure record  —  Presented by With assists from POLITICO's Congress team  —  WHY RULE VOTE FAILURES COULD ONLY GET WORSE FOR JOHNSON  —  Failing to pass a rule.  It's typically a process that leadership gives little thought, a minor bump on the path to passage.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/02/15/house-gop-sets-rule-vote-failure-record-00141801"
  },
  {
    "text": "The top doctor for CBP tried to order fentanyl lollipops for a helicopter mission in New York, whistleblowers say  —  The whistleblowers also allege Dr. Alexander Eastman was already under investigation for trying to procure narcotics for a friend who worked as a chopper pilot for the border agency.",
    "url": "https://www.nbcnews.com/politics/immigration/cbp-doctor-tried-order-fentanyl-lollipops-helicopter-mission-new-york-rcna139116"
  },
  {
    "text": "Donald Trump Will Be the First Former President to Face a Criminal Trial, Judge Rules  —  Trump's New York case will begin in March.  —  A New York judge ruled Thursday that Donald Trump will stand trial in March on charges related to the Stormy Daniels coverup.",
    "url": "https://www.motherjones.com/politics/2024/02/donald-trump-stormy-daniels-new-york-trial/"
  },
  {
    "text": "Puck: White House Reporters Knew About Biden All Along  —  According to a recent ABC News/Ipsos poll, 86% of Americans now believe Joe Biden's too old to serve as president.  The mainstream media's fluffing of Biden and deflection to the fitness of Donald Trump hasn't fooled most voters, and that includes 73% of Democrats.",
    "url": "https://hotair.com/ed-morrissey/2024/02/15/puck-white-house-reporters-all-know-bidens-unfit-but-wont-report-it-n3782999"
  },
  {
    "text": "Has Wired Given Up On Fact Checking?  Publishes Facts-Optional Screed Against Section 230 That Gets Almost Everything Wrong  —  from the that's-not-how-any-of-this-works dept  —  What is going on at Wired Magazine?  A few years ago, the magazine went on a bit of a binge with some articles that completely misrepresented Section 230.",
    "url": "https://www.techdirt.com/2024/02/15/has-wired-given-up-on-fact-checking-publishes-facts-optional-screed-against-section-230-that-gets-almost-everything-wrong/"
  }
]