[
  {
    "text": "‘Russian bombers are burning en masse’ — Ukraine's SBU drones hit ‘more than 40’ aircraft in mass attack, source says  —  An operation by Ukraine's Security Service (SBU) using first-person-view (FPV) drones smuggled deep inside Russian and hidden inside trucks has hit 41 Russian heavy bombers … ",
    "url": "https://kyivindependent.com/enemy-bombers-are-burning-en-masse-ukraines-sbu-drones-hit-more-than-40-russian-aircraft/"
  },
  {
    "text": "Ukraine Says It Destroyed Dozens of Warplanes Deep Inside Russia  —  Clandestine drone attack, 18 months in planning, deals biggest blow of the war against Moscow's long-range bomber fleet  —  KYIV—Ukraine launched audacious drone attacks on four military airports inside Russia … ",
    "url": "https://www.wsj.com/world/russia/ukraine-says-its-drones-destroyed-warplanes-deep-inside-russia-50a634c6?st=YaHdwV&reflink=article_copyURL_share"
  },
  {
    "text": "Ukraine launches major drone attack on Russian bombers, security official says  —  Reported strikes on four airbases in Siberia mark escalation in cross-border incursions before planned peace talks  —  Ukraine has launched a “large-scale” drone attack against Russian military bombers in Siberia … ",
    "url": "https://www.theguardian.com/world/2025/jun/01/ukraine-launches-major-drone-attack-on-russian-bombers-security-official-says"
  },
  {
    "text": "NEWSFLASH: Russian airfields burning after massive, covert Ukrainian assault  —  After days of Ukraine getting pounded by drones/missiles, a secret Ukrainian attack launched from Russian territory struck 4+ airfields, part of a wider campaign of sabotage behind enemy lines.  —  ∙ Paid",
    "url": "https://www.counteroffensive.news/p/newsflash-russian-airfields-burning"
  },
  {
    "text": "FBI director calls incident at Boulder's Pearl Street Mall in Colorado a “targeted terror attack;” multiple injured  —  Colorado police are responding to what they called an attack at Boulder's Pearl Street Mall that left multiple people injured.  —  Authorities said the violent incident happened … ",
    "url": "https://www.cbsnews.com/colorado/news/colorado-police-responding-to-boulder-pearl-street-mall-attack-multiple-injured/"
  },
  {
    "text": "Police Respond to Attack at a Colorado Event Raising Awareness of Israeli Hostages  —  A joint statement from the Jewish community in Boulder, Colo., said that an “incendiary device” was thrown at walkers at the event.  —  The authorities responded on Sunday afternoon to an attack in Boulder … ",
    "url": "https://www.nytimes.com/2025/06/01/us/boulder-colorado-attack.html"
  },
  {
    "text": "Musk Fends Off Trump Questions in Tense Interview Exchange  —  DONALD WHO?  —  The Tesla CEO bristled when asked about politics.  —  A CBS interview with Elon Musk went off the rails after he was asked about President Donald Trump's crusade against Harvard.",
    "url": "https://www.thedailybeast.com/musk-fends-off-trump-questions-in-tense-interview-exchange/"
  },
  {
    "text": "Elon Musk on DOGE and why he doesn't want to “take responsibility for everything the administration's doing”  —  In the beginning, Donald Trump and Elon Musk got along great.  “He is a truly incredible guy,” Trump said at a campaign rally last October, “and I don't say that that often.”",
    "url": "https://www.cbsnews.com/news/elon-musk-on-doge-trump-administration-and-responsibility-for-cuts/"
  },
  {
    "text": "Trump Spreads Bizarre Conspiracy Theory That Biden Was Executed and Replaced by a Robot Clone  —  “Democrats don't know the difference,” claimed a Truth Social post that the president shared  —  Donald Trump reposted a baseless conspiracy theory claiming Joe Biden was “executed in 2020” and replaced with a robot clone.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-conspiracy-biden-robot-clone-1235352122/"
  },
  {
    "text": "Trump Amplifies Outlandish Robot Biden Conspiracy Theory  —  President Trump reposted another user's claim that the former president had been “executed” in 2020 and replaced by a robotic clone.  —  President Trump shared an outlandish conspiracy theory on social media on Saturday night … ",
    "url": "https://www.nytimes.com/2025/06/01/us/politics/trump-biden-conspiracy-theory.html"
  },
  {
    "text": "Israeli troops kill over 30 near U.S. aid site in Gaza, health officials say  —  Over 170 were wounded heading to a Gaza Humanitarian Foundation aid point, the Health Ministry said.  Israel's military said it was “unaware of injuries caused by IDF fire.”  —  JAFFA, Israel … ",
    "url": "https://www.washingtonpost.com/world/2025/06/01/israel-gaza-aid-rafah-shooting/"
  },
  {
    "text": "Palestinians gunned down while trying to reach food aid site in Gaza, hospital says  —  Witnesses say Israeli forces opened fire on people near distribution point run by Israel-backed foundation  —  Lorenzo Tondo in Jerusalem and Malak A Tantesh in Gaza  —  More than 30 Palestinians … ",
    "url": "https://www.theguardian.com/world/2025/jun/01/palestinians-gunned-down-while-trying-to-reach-food-aid-site-in-gaza-hospital-says"
  },
  {
    "text": "'It's completely unsustainable': Republican lawmaker doubles down, knocks Trump tax bill  —  Sen. Ron Johnson, R-Wisconsin, is doubling down on his concerns about a bill that would make sweeping changes to taxes, Medicaid, food stamps and more after it was passed last month in the Republican-led House … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/06/01/republican-senator-johnson-trump-bill-hold-out/83978647007/"
  },
  {
    "text": "CNN Poll: A record share of Americans want the government to get more done.  Few trust either party to do it  —  Neither the Republican nor the Democratic Party has consolidated a majority of the public behind its approach, with more than 4 in 10 saying that neither party can get things done … ",
    "url": "https://cnn.com/2025/06/01/politics/cnn-poll-republicans-democrats"
  },
  {
    "text": "Johnson says 4.8 million Americans won't lose Medicaid access ‘unless they choose to do so’  —  Speaker Mike Johnson (R-La.) doubled down on his claim that there won't be Medicaid cuts in President Trump's “big, beautiful bill,” despite projections that millions of low-income individuals … ",
    "url": "https://thehill.com/homenews/sunday-talk-shows/5327723-mike-johnson-gop-bill-medicaid-cuts/"
  },
  {
    "text": "Ernst posts snarky reply after telling town hall ‘we all are going to die’  —  The outrage over the senator's glib response to concerns about Medicaid cuts was immediate.  Then, Ernst doubled down on her remarks with a sarcastic post.  —  Sen. Joni Ernst, an Iowa Republican facing reelection in 2026 … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/01/joni-ernst-medicaid-comments/"
  },
  {
    "text": "Are International Students Good for American Universities?  —  Several years ago, a colleague teaching at Miami University, a large state school in Ohio, kindly invited me to give a talk there.  After picking me up at the airport, he suggested that we have lunch at a Sichuan restaurant near campus.",
    "url": "https://www.nytimes.com/2025/06/01/opinion/international-students-harvard-trump.html?unlocked_article_code=1.Lk8.aBEy.sRtbhKOGLKp-&smid=url-share"
  },
  {
    "text": "Unease at F.B.I. Intensifies as Patel Ousts Top Officials … The F.B.I. headquarters in Washington.Erin Schaff/The New York Times  —  Before being confirmed as the director of the F.B.I., Kash Patel made clear his intent to remake it in his own image, reflecting a larger desire by the White House to bend the agency to its will.",
    "url": "https://www.nytimes.com/2025/06/01/us/politics/fbi-patel.html?unlocked_article_code=1.Lk8.iy2D.fnawKJ4lmbN6&smid=url-share"
  },
  {
    "text": "Exclusive: US veterans agency orders scientists not to publish in journals without clearance  —  Move that seeks political control of doctors' and scientists' published research fits a pattern of censorship by the Trump administration, veterans advocates say",
    "url": "https://www.theguardian.com/us-news/2025/jun/01/us-veterans-affairs-agency-doctors-scientists-research"
  },
  {
    "text": "Trump Is Said to Have Known About NASA Nominee's Donations Before Picking Him  —  President Trump withdrew his nomination of Jared Isaacman, an ally of Elon Musk, because of donations he had made to Democrats.  But people with knowledge of the events say Mr. Isaacman had disclosed the contributions.",
    "url": "https://www.nytimes.com/2025/06/01/us/politics/trump-musk-isaacman-nasa.html"
  }
]