[
  {
    "text": "Trump Spurned by 30 Companies as He Seeks Bond in $454 Million Judgment  —  Donald J. Trump's lawyers said in a court filing that he faces “insurmountable difficulties” as he tries to raise cash for the civil fraud penalty he faces in New York.  —  Donald J. Trump's lawyers disclosed on Monday … ",
    "url": "https://www.nytimes.com/2024/03/18/nyregion/trump-bond-civil-fraud-case.html"
  },
  {
    "text": "Trump has been unable to get bond for $464 million judgment, his lawyers say  —  In a filing to an appeals court, Trump's attorneys said getting the bond needed to halt proceedings while they appeal is a “practical impossibility.”  —  Former President Donald Trump has not been able to get a bond … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-unable-get-bond-464-million-judgment-lawyers-say-rcna143860"
  },
  {
    "text": "Liz Cheney fires back at Trump on Jan. 6: 'Lying in all caps doesn't make it true'  —  Former Rep. Liz Cheney (R-Wyo.) on Monday fired back at former President Trump's recent call for her to be prosecuted over allegedly withholding evidence and testimony from the House Jan. 6 committee investigation.",
    "url": "https://thehill.com/homenews/campaign/4539536-liz-cheney-fires-back-trump-jan-6/"
  },
  {
    "text": "The Good, Bad and Ugly in a New Poll on Trump's Trials and the Supreme Court  —  A new POLITICO Magazine/Ipsos poll suggests a conviction in the Manhattan trial could turn off independents.  —  Some Americans' opinions on Donald Trump's guilt may be a proxy for their views on him more generally … ",
    "url": "https://www.politico.com/news/magazine/2024/03/18/poll-conviction-trump-2024-elections-00147338"
  },
  {
    "text": "Trump calls for Liz Cheney to be jailed for investigating him over Capitol attack  —  Former president's posts on Truth Social about Republican critic stoke fears of persecution of opponents if he wins 2024 election  —  Donald Trump has renewed calls for Liz Cheney - his most prominent Republican critic … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/18/trump-liz-cheney-prison-jan-6-investigation"
  },
  {
    "text": "Pence's refusal to back Trump points to a larger problem  —  Republican officeholders are overwhelmingly in Trump's camp.  Those who served most closely with him — much less so.  —  Both of Donald Trump's defense secretaries have warned in no uncertain terms about how dangerous he is … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/18/pences-refusal-back-trump-points-larger-problem/"
  },
  {
    "text": "Trump is eyeing Paul Manafort for 2024 campaign role  —  The former campaign manager was pardoned by Trump for bank and tax fraud convictions and accusations he hid millions he made consulting for pro-Russian Ukrainian politicians  —  Former president Donald Trump is expected to enlist Paul Manafort … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/18/trump-manafort-2024-campaign/"
  },
  {
    "text": "Trump Considers Adding Paul Manafort—a “Grave Counterintelligence Threat”—to His Campaign  —  What could possibly go wrong?  —  From the Nothing Matters News Desk comes this report: Donald Trump is considering bringing back Paul Manafort as a top campaign adviser.",
    "url": "https://www.motherjones.com/politics/2024/03/trump-considers-adding-paul-manafort-a-grave-counterintelligence-threat-to-his-campaign/"
  },
  {
    "text": "Justice Breyer, Off the Bench, Sounds an Alarm Over the Supreme Court's Direction  —  In an interview in his chambers and in a new book, the justice, who retired in 2022, discussed Dobbs, originalism and the decline of trust in the court.  —  Justice Stephen G. Breyer's Supreme Court chambers … ",
    "url": "https://www.nytimes.com/2024/03/18/us/breyer-supreme-court-interview.html"
  },
  {
    "text": "Supreme Court likely to reject limits on White House social media contacts  —  The Supreme Court seemed prepared Monday to reject a Republican-led effort to sharply limit the federal government from pressuring social media companies to remove harmful posts and misinformation from their platforms.",
    "url": "https://www.washingtonpost.com/politics/2024/03/18/supreme-court-social-media-free-speech-biden/"
  },
  {
    "text": "“Obama would be jealous”: How Biden's rivalry with his ex-boss shapes his presidency … - “Obama would be jealous,” Biden sometimes says when speaking about a perceived accomplishment, according to two Biden aides familiar with such instances.  — The competitive dynamic has informed Biden's approach … ",
    "url": "https://www.axios.com/2024/03/18/biden-obama-rivalry-presidency"
  },
  {
    "text": "Niger ordered US troops to leave after Biden officials warned about ties to Russia, Iran: Pentagon  —  Niger is pulling its military cooperation deal with the United States and ordering some 1,000 American military personnel to leave the country, a startling development that comes … ",
    "url": "https://thehill.com/policy/defense/4539830-niger-ends-us-military-deal/"
  },
  {
    "text": "Conservative Influencer Accused of Swiping Table Used to Attack Cops on Jan. 6  —  Isabella DeLuca, now a conservative influencer, allegedly fired off Instagram messages saying Trump should declare martial law.  —  The conservative influencer Isabella DeLuca, a former intern of Rep. Paul Gosar … ",
    "url": "https://www.thedailybeast.com/ex-congressional-intern-isabella-deluca-accused-of-swiping-table-used-to-attack-cops-on-jan-6"
  },
  {
    "text": "What the Data Says About Pandemic School Closures, Four Years Later  —  The more time students spent in remote instruction, the further they fell behind.  And, experts say, extended closures did little to stop the spread of Covid.  —  Four years ago this month, schools nationwide began to shut down … ",
    "url": "https://www.nytimes.com/2024/03/18/upshot/pandemic-school-closures-data.html"
  },
  {
    "text": "Biden administration bans ongoing uses of asbestos  —  The Biden administration will ban or phase out ongoing uses of asbestos, the agency said Monday.  —  The Environmental Protection Agency issued a rule that set deadlines for industry to transition away from using the substance, which causes lung cancer.",
    "url": "https://thehill.com/policy/energy-environment/4539253-biden-epa-bans-asbestos-use/"
  },
  {
    "text": "MAGA Reps Suddenly Face an Existential Threat: Themselves  —  The 2024 primaries are just getting started, but there's good reason to believe this year could be a lot more brutal for Republicans than recent ones.  —  It would be hard to argue that Rep. Mike Bost (R-IL) … ",
    "url": "https://www.thedailybeast.com/maga-reps-suddenly-face-an-existential-threat-themselves"
  },
  {
    "text": "Father of Laken Riley addresses slain daughter's legacy amid heated immigration debate  —  Riley, a 22-year-old nursing student, was killed on the University of Georgia campus while on a run.  The incident has fueled the political debate over U.S. immigration policies.",
    "url": "https://www.nbcnews.com/news/us-news/laken-riley-dad-today-interview-rcna143742"
  },
  {
    "text": "Susan Glasser Slams ABC Panel: Take Trump's Words As Fact  —  The New Yorker reporter reminded her panel members that Trump is “peddling an alternate reality vision of America that is built on lies.”  —  Can you help us out?  —  For nearly 20 years we have been exposing Washington lies … ",
    "url": "https://crooksandliars.com/2024/03/susan-glasser-slams-abc-panel-take-0"
  },
  {
    "text": "A Suspicious Pattern Alarming the Ukrainian Military  —  A Ukrainian military source believes that Russia's long-range strikes are aimed using satellite imagery provided by U.S. companies.  —  Earlier this month, Ukrainian President Volodymyr Zelensky got unusually testy over the failure … ",
    "url": "https://www.theatlantic.com/international/archive/2024/03/american-satellites-russia-ukraine-war/677775/"
  }
]