[
  {
    "text": "Trump Is Poised to Accept a Luxury 747 From Qatar for Use as Air Force One  —  The plan raises substantial ethical issues, given the immense value of the lavishly appointed plane and that Mr. Trump intends to take ownership of it after he leaves office.  —  The Trump administration plans … ",
    "url": "https://www.nytimes.com/2025/05/11/us/politics/trump-qatar-jet-gift-air-force-one.html"
  },
  {
    "text": "Trump administration poised to accept ‘palace in the sky’ as a gift for Trump from Qatar: Sources  —  The luxury jumbo jet is to be used as Air Force One, sources told ABC News.  —  In what may be the most valuable gift ever extended to the United States from a foreign government … ",
    "url": "https://abcnews.go.com/Politics/trump-administration-poised-accept-palace-sky-gift-trump/story?id=121680511"
  },
  {
    "text": "Qatar says no final decision made on gifting Trump a jet to use as Air Force One  —  President Donald Trump reportedly is ready to accept a luxury Boeing 747-8 jumbo jet as a gift from the ruling family of Qatar during his trip to the Middle East this coming week, and U.S. officials … ",
    "url": "https://apnews.com/article/trump-qatar-gift-jet-air-force-one-7f9afb461c6b3ac16fca3bb0973715ff"
  },
  {
    "text": "Trump to accept luxury jet from Qatar to use as Air Force One  —  The Trump administration is set to accept a luxury plane from the Qatari royal family that will be retrofitted and used as Air Force One during the president's second term, two people familiar with the agreement told CNN.",
    "url": "https://cnn.com/2025/05/11/politics/trump-luxury-jet-qatar-air-force-one"
  },
  {
    "text": "Qatari Royals Give Trump a Plane … Fascinating details emerging with the Qatari royal family giving Donald Trump the personal gift of a fully blinged out 747.  Yes, they're giving him a plane.  —  When I first heard this story a few days ago it at least sounded like Trump had finally lost patience … ",
    "url": "https://talkingpointsmemo.com/edblog/qatari-royals-give-trump-a-plane"
  },
  {
    "text": "U.S. officials say ‘substantial progress’ made in China trade talks  —  The White House said it was announcing a trade deal without providing any details.  Representatives from the U.S. and China had been meeting in Switzerland.  —  Bessent: ‘Substantial progress’ in US-China trade talks",
    "url": "https://www.washingtonpost.com/business/2025/05/11/us-china-trade-talks-switzerland/"
  },
  {
    "text": "Flights Could Be Disrupted Across U.S., Transportation Secretary Warns  —  After a series of problems at Newark Liberty International Airport, the secretary, Sean Duffy, said he would meet with airline leaders on Wednesday to plan to scale back Newark flights.",
    "url": "https://www.nytimes.com/2025/05/11/nyregion/newark-airport-flight-disruptions-duffy.html?unlocked_article_code=1.GU8.jg6x.m8ofFo8O4sXJ&smid=url-share"
  },
  {
    "text": "Trump to sign executive order he says will slash drug prices by up to 80%  —  Trump calls out Democrats and announces plans to drop prices of prescription drugs ‘almost immediately’  —  President Donald Trump announced he plans to sign an executive order on Monday that will reduce the cost … ",
    "url": "https://www.foxnews.com/politics/trump-sign-executive-order-he-says-slash-drug-prices-up-80"
  },
  {
    "text": "Trump Says He Will Sign Executive Order Aimed at Lowering Drug Prices  —  President wants to tie drug prices U.S. pays to those paid by other countries  —  WASHINGTON—President Trump on Sunday said he would sign an executive order aimed at lowering the cost of prescription drugs … ",
    "url": "https://www.wsj.com/politics/policy/trump-says-he-will-sign-executive-order-aimed-at-lowering-drug-prices-2a5b9b28"
  },
  {
    "text": "White South Africans Granted Refugee Status by Trump Leave for U.S.  —  Dozens of Afrikaners who claim discrimination in their home country left Johannesburg on Sunday.  Their departure for the U.S. came as the Trump administration was halting virtually all refugee admissions.",
    "url": "https://www.nytimes.com/2025/05/11/world/africa/white-south-africans-granted-refugee-status-by-trump-leave-for-us.html"
  },
  {
    "text": "Will we allow ICE to behave as a secret police?  —  I had missed the story from two weeks ago about what happened after (apparent) agents of the U.S. Immigration and Customs Enforcement (ICE), one wearing a balaclava to hide his face, seized two men at the Charlottesville, Va. courthouse.",
    "url": "https://walterolson.substack.com/p/will-we-allow-ice-to-behave-as-a"
  },
  {
    "text": "How Tariffs Are Crushing Small Businesses: ‘Nobody in Power Seems to Care’  —  Owners are laying off staff and tapping personal savings, hoping to hold out until a trade deal with China; an $8,752 fee on a $5,649 order  —  The owner of a San Francisco card-game company cashed in his money-market funds.",
    "url": "https://www.wsj.com/business/entrepreneurship/small-business-tariffs-e6dfaccb?st=YG4MXP&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Proposal Cutting Medicaid Aims for GOP Middle Ground  —  House bill is set to include work requirements but not deeper reductions some fiscal hawks demanded  —  WASHINGTON—House Republicans are releasing their plan to cut Medicaid spending, with the program's defenders in the GOP appearing … ",
    "url": "https://www.wsj.com/politics/policy/house-republicans-medicaid-cuts-8164a810"
  },
  {
    "text": "Trump administration fires top copyright official days after firing Librarian of Congress  —  The Trump administration has fired the nation's top copyright official , Shira Perlmutter, days after abruptly terminating the head of the Library of Congress, which oversees the U.S. Copyright Office.",
    "url": "https://apnews.com/article/copyright-director-firing-government-trump-7ab99992a96131bce7de853b66feec68"
  },
  {
    "text": "Dem Crypto Ally Defends Fundraiser With Trump Crypto Donor  —  Democrats have gotten too “pure,” Arizona Sen. Ruben Gallego argued at a Pennsylvania town hall to explain his ties to crypto investor Marc Andreessen  —  Sen. Ruben Gallego (D-Ariz.) traveled to Pennsylvania for a town hall … ",
    "url": "https://www.rollingstone.com/politics/politics-news/gallego-democrat-crypto-fundraiser-andreessen-trump-1235336588/"
  },
  {
    "text": "Elon Musk's regulatory troubles have begun to melt away in Trump's second term  —  The Trump administration has halted some regulatory matters involving Musk's companies and fired people from agencies investigating Tesla, SpaceX and Neuralink.  —  Tech billionaire Elon Musk's regulatory problems have started to fade into the past.",
    "url": "https://www.nbcnews.com/tech/elon-musk/elon-musks-regulatory-issues-begun-melt-away-trumps-second-term-rcna202848"
  },
  {
    "text": "Pope Leo XIV calls for peace in Ukraine and Gaza in symbolically rich blessing on Mother's Day  —  Pope Leo XIV called for a genuine and just peace in Ukraine and an immediate ceasefire in Gaza, in his first Sunday noon blessing as pontiff that featured some symbolic gestures suggesting a message of unity in a polarized Catholic Church.",
    "url": "https://apnews.com/article/vatican-pope-leo-xiv-a16ff59f75260ca8baf5d90890523766"
  },
  {
    "text": "Barrasso: 'I don't believe' suggested habeas corpus suspension will ‘come to Congress’  —  Senate Majority Whip John Barrasso (R-Wyo.) said he doesn't believe that the White House's suggested habeas corpus suspension will reach Congress.  —  During an appearance on NBC's “Meet The Press” … ",
    "url": "https://thehill.com/homenews/sunday-talk-shows/5294430-barrasso-habeas-corpus-suspension-congress/"
  },
  {
    "text": "Zelenskyy agrees to meet Putin after Trump post; unclear if Russian president will join  —  “I will be waiting for Putin in Türkiye on Thursday,” Zelenskyy wrote on X.  —  KYIV − Ukrainian President Volodymyr Zelenskyy said he would agree to meet Kremlin leader Vladimir Putin … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/05/11/zelenskyy-meeting-putin-after-trump-weighs-in/83570885007/"
  }
]