[
  {
    "text": "The Most Satisfying Moment of the Harris-Trump Debate  —  It was about as close to perfect as Kamala Harris has come in a debate, and it was as close to self-parody as Donald Trump—who doesn't comprehend parody—can manage.  Harris repeatedly laid out the bait, and Trump couldn't resist taking it … ",
    "url": "https://slate.com/news-and-politics/2024/09/kamala-harris-abortion-answer-best-moment-trump-debate.html"
  },
  {
    "text": "Laura Loomer, who promoted a 9/11 conspiracy theory, joins Trump for ceremonies marking the attacks  —  Laura Loomer, a right-wing activist who posted last year that 9/11 was an “inside job,” joined Republican presidential nominee Donald Trump in New York and Pennsylvania on Wednesday as he commemorated the anniversary of the attacks.",
    "url": "https://apnews.com/article/laura-loomer-trump-911-conspiracy-theories-18198b8ea2ce567467acfd6bf7f19f1e"
  },
  {
    "text": "GOP grapples with fallout from Trump's rocky debate  —  Campaign Report  —  The Big Story  —  Republicans are regrouping after the former president repeatedly lost his composure, and Vice President Harris was widely viewed as the winner of the night, with some admitting Trump had a poor showing … ",
    "url": "https://thehill.com/newsletters/campaign-report/4874817-gop-grapples-with-fallout-from-trumps-rocky-debate/"
  },
  {
    "text": "Trump Says He Had a Great Debate.  His Allies Privately Say Otherwise.  —  Donald J. Trump's aggressive spinning of his debate performance suggested he knew it was suboptimal, and left aides considering how to move ahead with eight weeks to go.  —  Former President Donald J. Trump went … ",
    "url": "https://www.nytimes.com/2024/09/11/us/politics/trump-debate-performance.html?unlocked_article_code=1.KE4.ndCr.FLSXb_RNU_JU&smid=url-share"
  },
  {
    "text": "Over 67 Million Viewers Tune In for ABC News Harris-Trump Debate … The ABC News debate was the first debate between the two participating candidates and second of this election cycle.  Including ABC, the debate aired live on 17 television networks reported by Nielsen … ",
    "url": "https://www.nielsen.com/news-center/2024/over-67-million-viewers-tune-in-for-abc-news-harris-trump-debate/"
  },
  {
    "text": "Harris trolls Trump by posting most of debate as ‘new ad’  —  Vice President Harris's campaign posted most of Tuesday's debate on the social platform X, referring to it as a new ad.  —  “Our newest ad just dropped,” the campaign captioned its Wednesday video post.",
    "url": "https://thehill.com/homenews/campaign/4875149-harris-trump-debate-ad/"
  },
  {
    "text": "A Catastrophic Debate for Trump  —  He was angry and fixated on the past, and he failed to define Harris or her policies.  —  Tuesday's debate between Kamala Harris and Donald Trump was a train wreck for him, far worse than anything Team Trump could have imagined.",
    "url": "https://www.wsj.com/opinion/a-catastrophic-debate-for-trump-2024-presidential-election-d2e5aa7f"
  },
  {
    "text": "67.1 Million People Watched Harris and Trump, Outdrawing Last Debate  —  The TV audience for the Harris-Trump matchup was roughly comparable to the second Trump-Clinton debate in 2016.  —  There is a new most-watched moment of the 2024 presidential campaign.",
    "url": "https://www.nytimes.com/2024/09/11/business/media/harris-trump-debate-ratings.html"
  },
  {
    "text": "How Swing Voters Reacted to the Trump-Harris Debate  —  Before last night's debate, I got a text from a friend who summed up Kamala Harris's predicament: She has to appear feminine but not dainty.  She has to be firm but not nasty.  She has to call out Donald Trump's lies but not be naggy.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/kamala-harris-trump-debate-sexism-bar/679791/?gift=uKslbwaP7RTOWQxPvEFBMerC6cHEXbXoHIs5fLDh1tw&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Kamala Harris Broke Donald Trump  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  Last night in Philadelphia, Kamala Harris did to Donald Trump what Donald Trump had done to Joe Biden: She broke her opponent on a debate stage.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/kamala-harris-broke-donald-trump/679780/?gift=T7Rc-usB5FOiIPROxn3jvnVuS3Prqq3lk-Vov8FvMC8&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump's Trainwreck  —  You know who cares about the notorious bias of the media-Democrat complex?  Conservatives.  You know who was not the relevant, target audience for last night's debate between presidential candidates?  Conservatives.  —  If you're obsessing over how bad … ",
    "url": "https://www.nationalreview.com/corner/trumps-trainwreck/"
  },
  {
    "text": "Arizona GOP billboards implore voters to ‘EAT LESS KITTENS’  —  Arizona's Republican Party erected about a dozen billboards in the Phoenix area that say “EAT LESS KITTENS” and look similar to Chick-fil-A's promos.  —  At first glance, new billboards in Arizona look like Chick-fil-A's iconic “Eat Mor Chikin” promos.",
    "url": "https://www.washingtonpost.com/politics/2024/09/11/arizona-gop-eat-cats-billboards/"
  },
  {
    "text": "Dad Demands Donald Trump and JD Vance Stop Exploiting His Son's Death  —  ‘MORALLY BANKRUPT’  —  The father of an Ohio boy who died in a bus crash involving a Haitian immigrant called on Donald Trump and JD Vance to stop using his son's name to demonize immigrants.",
    "url": "https://www.thedailybeast.com/nathan-clark-father-of-aidan-clark-who-was-killed-in-ohio-slams-jd-vance-and-donald-trump"
  },
  {
    "text": "No, Taylor Swift Did Not Coordinate Her Kamala Harris Endorsement With the Campaign  —  Music experts say Swift's backing Harris is unlikely to affect the pop star's popularity  —  About an hour after Taylor Swift endorsed Kamala Harris for president, the Democratic candidate's campaign … ",
    "url": "https://www.wsj.com/politics/elections/taylor-swift-kamala-harris-instagram-endorsement-debate-f085c0f2"
  },
  {
    "text": "DHS designates Jan. 6 a National Special Security Event  —  The Secret Service said Thursday that the upcoming Jan. 6 “has been designated a National Special Security Event by the Secretary of Homeland Security.”  —  “The 2025 Counting and Certification of Electoral Votes in Washington … ",
    "url": "https://thehill.com/homenews/administration/4875481-dhs-jan-6-a-national-special-security-event/"
  },
  {
    "text": "New video, witnesses challenge Israel's account of U.S. activist's killing  —  The IDF said Aysenur Eygi was shot “unintentionally” during a “violent riot.”  A Post analysis shows clashes had subsided and protesters had retreated.  —  BEITA, West Bank — It was Aysenur Eygi's … ",
    "url": "https://www.washingtonpost.com/world/2024/09/11/american-activist-aysenur-eygi-killed-idf-west-bank/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2MDI3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI3NDA5NTk5LCJpYXQiOjE3MjYwMjcyMDAsImp0aSI6IjY5ODE3ZGE1LWVmMWUtNGZkNC1iZmU0LTk4NmM1MDI2ZmQ0OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI0LzA5LzExL2FtZXJpY2FuLWFjdGl2aXN0LWF5c2VudXItZXlnaS1raWxsZWQtaWRmLXdlc3QtYmFuay8ifQ.72giBWtlV-ZjlFRBPVGuVTzeAaeDs8jt9CcCT3hTvmM&itid=gfta"
  },
  {
    "text": "Scoop: Schumer cornering GOP on Trump IVF plan … - The IVF bill will hit the Senate floor over the next two weeks, a source familiar with the plans told Axios. … - It is a re-vote on a bill that Schumer and Senate Democrats offered up this summer.  — Trump endorsed universal coverage for IVF treatments earlier this month.",
    "url": "https://www.axios.com/2024/09/12/schumer-trump-ivf-vote-senate"
  },
  {
    "text": "Mark Zuckerberg says he's done apologizing  —  The home of the Golden State Warriors was packed on Tuesday evening this week, but it wasn't to watch Steph Curry.  Thousands of fans gathered at the Chase Center in downtown San Francisco to watch one of Silicon Valley's biggest ballers … ",
    "url": "https://techcrunch.com/2024/09/11/mark-zuckerberg-says-hes-done-apologizing/"
  }
]