[
  {
    "text": "Harris Puts Four Sun Belt States Back in Play, Times/Siena Polls Find  —  Kamala Harris and Donald Trump are in close races across Arizona, Georgia, Nevada and North Carolina, crucial swing states that Mr. Trump had seemed en route to run away with just a few weeks ago.",
    "url": "https://www.nytimes.com/2024/08/17/us/elections/kamala-harris-trump-az-nc-ga-nv.html?unlocked_article_code=1.Dk4.h1jB.r4PD8EvalJH3&smid=url-share"
  },
  {
    "text": "Playbook: How Harris is remaking the 2024 election  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  If you needed yet more evidence that KAMALA HARRIS has dramatically transformed the contours of the 2024 race, there's a glut of it this morning.",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/17/how-harris-is-remaking-the-2024-election-00174485"
  },
  {
    "text": "Harris reset the election, and congressional Dems are starting to shift strategies  —  Democrats are seeing new energy — and poll numbers.  But they also know they still have a serious fight on their hands in November.  —  Battleground Democrats are suddenly jumping at the chance to campaign with the top of the ticket.",
    "url": "https://www.politico.com/news/2024/08/17/house-senate-democrats-kamala-harris-congress-00174480"
  },
  {
    "text": "‘When they go low, we go with the flow’: Dems ramp up attacks on Trump  —  Democrats are embracing snark.  —  If Democrats in 2016 rallied around Michelle Obama's mantra that “when they go low, we go high,” today they're burying that ambition under a hill of insults, memes and snark.",
    "url": "https://www.politico.com/news/2024/08/17/democrats-trump-attacks-00174470"
  },
  {
    "text": "Trolling the Troll  —  Kamala Harris knows how to get under Donald's skin  —  Americans have known for a while that my uncle has the thinnest skin on the planet.  We now know that Vice President Kamala Harris is all the way under it because Donald keeps admitting it.  —  “I'm very angry at her,” Donald said Thursday.",
    "url": "https://www.marytrump.org/p/trolling-the-troll"
  },
  {
    "text": "Donald Trump Has No Idea What Has Hit Him, and It's a Joy to Watch … It continues.  Six days ago, The New York Times ran a story under the headline “Inside the Worst Three Weeks of Donald Trump's 2024 Campaign.”  Usually, when the country's most important newspaper runs a story like that … ",
    "url": "https://newrepublic.com/article/184951/donald-trump-flailing-harris"
  },
  {
    "text": "Age-based attacks are boomeranging back on Trump  —  The Harris campaign wants to make a more nuanced version of the argument.  —  Donald Trump spent months framing his opponent as a doddering old man who couldn't be trusted with the country's future.  Now he's facing a similar attack from Kamala Harris.",
    "url": "https://www.politico.com/news/2024/08/16/harris-trump-old-age-2024-00174466"
  },
  {
    "text": "Armed and Underground: Inside the Turbulent, Secret World of an American Militia  —  This story discusses threats of violence and contains a racial slur.  —  Reporting Highlights  — Militias After Jan. 6: Internal messages reveal how AP3, one of the largest U.S. militias … ",
    "url": "https://www.propublica.org/article/inside-secret-ap3-militia-american-patriots-three-percent"
  },
  {
    "text": "Bronze statue of John Lewis replaces more than 100-year-old Confederate monument  —  A large bronze statue of the late civil rights icon leader and Georgia congressman John Lewis was installed Friday, at the very spot where a contentious monument to the confederacy stood for more than 110 years … ",
    "url": "https://apnews.com/article/john-lewis-bronze-statue-replaced-confederate-georgia-b0c51086a4b83750ff38b1af2167abde"
  },
  {
    "text": "Georgia replaces confederate monument with bronze statue of late Rep. John Lewis  —  Workers placed a bronze statue of the late Rep. John Lewis (D-Ga.) on the grounds of the Dekalb County Courthouse Friday — the same site where a Confederate monument was removed in 2020.",
    "url": "https://thehill.com/homenews/state-watch/4832700-georgia-john-lewis-bronze-statue-courthouse/"
  },
  {
    "text": "Experts: Pro-Trump officials could face “severe” punishments if they refuse to certify election  —  “The threat of disruption looms large in this year's election” — but anti-certification efforts likely to backfire  —  Pro-Trump local election officials may try to slow down the certification … ",
    "url": "https://www.salon.com/2024/08/17/experts-pro-officials-could-face-severe-punishments-if-they-refuse-to-certify/"
  },
  {
    "text": "VFW Admonishes Former President for Medal of Honor Remarks  —  The following is a message from VFW National Commander Al Lipphardt  —  WASHINGTON — “On Thursday, former President Donald Trump spoke at an event where he made some flippant remarks about the Medal of Honor and the heroes who have received it.",
    "url": "https://www.vfw.org/media-and-events/latest-releases/archives/2024/8/vfw-admonishes-former-president-for-medal-of-honor-remarks"
  },
  {
    "text": "‘Keyboard warrior’ jailed for part in UK disorder  —  A man who posted material on social media to stir up racial hatred during recent unrest across the UK has been jailed for three years.  —  Wayne O'Rourke, who had more than 90,000 followers to his X account, posted misinformation … ",
    "url": "https://www.bbc.com/news/articles/c5y3gre3y9yo"
  },
  {
    "text": "George Santos to plead guilty to multiple charges in fraud case Monday  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/regulation/court-battles/4832761-george-santos-fraud-case-guilty-plea-expected/"
  },
  {
    "text": "Keep talking, JD!  Vance's creepy views on ‘females’ are repelling women voters  —  Does Donald Trump's running mate think there is any point to ‘postmenopausal females’ beyond free childcare?  —  JD Vance puts his futon in his mouth again  —  Consider, if you will, the mysterious role of the postmenopausal female.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/aug/17/jd-vance-women"
  },
  {
    "text": "Fox News Flames Harris: Real Leaders Don't Eat Doritos  —  ARE YOU KIDDING ME?  —  “That's the emotional response of the leader of the free world—to binge-eat a bag of Doritos,” Elisabeth Hasselbeck asked Sean Hannity on Friday night.  —  Former The View host Elisabeth Hasselbeck tore … ",
    "url": "https://www.thedailybeast.com/fox-news-elisabeth-hasselbeck-flames-kamala-harris-on-sean-hannity-real-leaders-dont-eat-doritos"
  },
  {
    "text": "Jared Kushner wants to turn a wild stretch of Albania into a luxury resort  —  Kushner's use of foreign funds is again coming under scrutiny.  Environmentalists fear his planned resort could destroy a delicate ecosystem.  —  ZVERNEC, Albania — In one of his several trips to Albania … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/17/jared-kushner-resort-albania-environment/"
  }
]