[
  {
    "text": "GOP official who claimed 2020 was stolen voted illegally nine times, judge rules  —  A Georgia Republican official who pushed false claims that the 2020 election was “stolen” was found to have voted illegally nine times, a judge ruled this week.  —  Brian Pritchard, first vice chairman … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/28/georgia-republican-illegal-voting/"
  },
  {
    "text": "A Judge Finally Found Fraudulent Votes.  They're All From a Republican.  —  A prominent Georgia state Republican, who has repeatedly claimed the 2020 election was stolen, was found to have voted illegally nine times.  —  Brian Pritchard, the first vice chairman of the state Republican Party … ",
    "url": "https://newrepublic.com/post/180230/georgia-official-vote-illegally"
  },
  {
    "text": "Crystal Mason: Texas woman sentenced to five years over voting error acquitted  —  Appeals court rules Mason, now 49, did not know she was ineligible when she voted in 2016 and throws out conviction  —  The fight for democracy is supported by  —  A Texas appeals court has thrown … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/28/crystal-mason-texas-woman-acquitted"
  },
  {
    "text": "Kentucky bill strips governor of power to appoint senator  —  The Kentucky Senate sent a bill to Gov. Andy Beshear (D) Thursday that would strip him of his power to appoint people to the U.S. Senate.  —  The bill seeks to hold special elections for Senate vacancies in Kentucky, according to The Associated Press.",
    "url": "https://thehill.com/homenews/state-watch/4562312-kentucky-bill-strips-governor-power-appoint-senator/"
  },
  {
    "text": "RNC weighs limiting NBC's access at this summer's convention  —  It is the latest fallout from Ronna McDaniel's ouster from the network.  —  The Republican National Committee is weighing whether to restrict NBC's access to this summer's convention, following the network's decision … ",
    "url": "https://www.politico.com/news/2024/03/28/rnc-nbc-convention-ronna-mcdaniel-00149620"
  },
  {
    "text": "Anti-Israel protesters disrupt Biden's lavish NYC fundraiser with Obama, Clinton, where tickets went for up to $500K: ‘War pig’  —  Several waves of protesters disrupted President Biden's grandiose fundraiser at Radio City Music Hall Thursday, where he kicked it with former Presidents Barack Obama … ",
    "url": "https://nypost.com/2024/03/28/us-news/biden-holds-lavish-nyc-grassroots-fundraiser-with-obama-clinton-in-tow-tickets-going-for-up-to-500k/"
  },
  {
    "text": "Trump attends NYPD officer's wake as he highlights crime on the campaign trail  —  President Biden will also be in the state for a fundraiser with Obama, Clinton.  —  Former President Donald Trump arrives for the wake for New York Police Department (NYPD) Officer Jonathan Diller in Massapequa, Long Island, N.Y., March 28, 2024.",
    "url": "https://abcnews.go.com/Politics/trump-attends-nypd-officers-wake-highlights-crime-campaign/story?id=108605672"
  },
  {
    "text": "Suicide Mission  —  What Boeing did to all the guys who remember how to build a plane  —  A Boeing Dreamlifter sits on the tarmac at their campus in North Charleston, South Carolina, May 30, 2023.  —  John Barnett had one of those bosses who seemed to spend most of his waking hours scheming to inflict humiliation upon him.",
    "url": "https://prospect.org/infrastructure/transportation/2024-03-28-suicide-mission-boeing/"
  },
  {
    "text": "U.S. updates how it classifies people by race, ethnicity for first time in decades  —  The changes, announced Thursday by the U.S. Office of Management and Budget, aim to better capture an increasingly diverse country and give policymakers a fuller view of Americans",
    "url": "https://www.washingtonpost.com/politics/2024/03/28/census-update-race-ethnicity/"
  },
  {
    "text": "A ship crashed into a Baltimore bridge and demolished the lies about immigration  —  From the day in the mid-2000s when a then-20-year-old Maynor Yassir Suazo Sandoval crossed the border into America, he never stopped working.  The youngest of eight children, Suazo was fleeing numbing poverty … ",
    "url": "https://www.inquirer.com/opinion/baltimore-bridge-collapse-immigrant-deaths-20240328.html#loaded"
  },
  {
    "text": "Racists called Baltimore Mayor Brandon Scott a ‘DEI mayor.’ Here's how he responded  —  Mayor Brandon Scott has come to expect overt and not-so-overt racism.  —  The latest example came in the aftermath of Tuesday night's Francis Scott Key Bridge collapse.",
    "url": "https://www.thebaltimorebanner.com/politics-power/national-politics/brandon-scott-dei-mayor-racist-C3MWO3BVX5FJZM5MENNLC2X2BI/"
  },
  {
    "text": "Statement from President Joe Biden on the Stabbing Attack in Rockford, Illinois  —  Jill and I were horrified to learn of the brutal attack carried out in Rockford last night, which took the lives of four people, including one fifteen-year-old.  Seven others were tragically wounded as a result of this senseless violence.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/03/28/statement-from-president-joe-biden-on-the-stabbing-attack-in-rockford-illinois/"
  },
  {
    "text": "GOP Biden impeachment witness sues Fox News co-host Tarlov  —  Tony Bobulinski, a former associate of Hunter Biden, filed a $30 million defamation lawsuit against Fox News host Jessica Tarlov over her comments about his legal fees, which she corrected a day later.",
    "url": "https://thehill.com/media/4562793-gop-biden-impeachment-witness-sues-fox-news-co-host-tarlov/"
  },
  {
    "text": "Pro-Trump fake electors in Arizona have pleaded the Fifth before grand jury  —  Requiring the targets of the probe to invoke their rights in front of grand jurors is an unusual tactic that raises a risk of bias, legal experts say.  —  Arizona Republicans who falsely posed as electors … ",
    "url": "https://www.politico.com/news/2024/03/28/arizona-fake-electors-grand-jury-plead-fifth-00149605"
  },
  {
    "text": "GOP Michigan state rep mistakenly claims Gonzaga team buses are for ‘illegal invaders’  —  A Republican state legislator in Michigan railed against buses of “illegal invaders” landing at his local airport Wednesday, but garnered criticism after it was discovered the buses carried a college basketball team.",
    "url": "https://thehill.com/homenews/state-watch/4561569-gop-michigan-state-rep-mistakenly-claims-gonzaga-team-buses-for-illegal-invaders/"
  },
  {
    "text": "Marylanders plot a Hill bridge response  —  With assists from POLITICO's Congress team  —  SPAN AND DELIVER  —  As if lawmakers didn't have enough to address when they return next month from their two-week recess, they're going to have to add a response to the collapse of Baltimore's Francis Scott Key Bridge to their to-do list.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/03/28/marylanders-plot-a-hill-bridge-response-00149621"
  },
  {
    "text": "Biden restores some, but not all, ESA protections  —  Energy & Environment  —  The Big Story  —  The Biden administration finalized a rule on Thursday that reverses some Trump-era rollbacks of protections for endangered species — but left others in place.  —  © Charlie Neibergall, Associated Press file",
    "url": "https://thehill.com/newsletters/energy-environment/4562705-biden-restores-some-but-not-all-esa-protections/"
  },
  {
    "text": "Hostage families told Netanyahu they get better treatment from the White House … - Senior members of Netanyahu's government, including ultranationalist finance minister Betzalel Smotrich, have said the hostages should not be Israel's top priority and it is more important to destroy Hamas.",
    "url": "https://www.axios.com/2024/03/28/israel-hostage-families-netanyahu-biden-treatment"
  },
  {
    "text": "House GOP misses “Fire Pelosi” on 2024 campaign trail … - “He's not shown that type of lightning rod negativity,” House Majority Whip Tom Emmer (R-Minn.) told Axios.  — “I think some of these members, and maybe this is Nancy's issue, they get to a certain age and they just get very caustic.”",
    "url": "https://www.axios.com/2024/03/28/house-republicans-pelosi-jeffries-fundraising"
  },
  {
    "text": "Scoop: Trump and Emmer bury the hatchet with Mar-a-Lago fundraiser … - Trump showed up and spoke at the event, multiple sources told Axios, which raised over $300,000 for Emmer's fundraising committee. … - Trump urged Republicans not to vote for Emmer for speaker in October, calling him “RINO Tom Emmer.”",
    "url": "https://www.axios.com/2024/03/28/trump-tom-emmer-fundraiser-mar-a-lago"
  },
  {
    "text": "James Comer sums up his ‘evidence’ of Biden crimes.  It's scant.  —  The Fact Checker  —  In an interview Monday with conservative talk radio host Jimmy Failla, Rep. James Comer (R-Ky.), chairman of the House Oversight Committee, provided an unusually succinct description of his case against President Biden.",
    "url": "https://www.washingtonpost.com/politics/2024/03/28/james-comer-sums-up-his-evidence-biden-crimes-its-scant/"
  },
  {
    "text": "House to send Mayorkas impeachment charges to Senate on April 10  —  Speaker Mike Johnson (R-La.) and House Republican impeachment managers informed Senate Majority Leader Chuck Schumer (D-N.Y.) in a letter Thursday that they will send two impeachment charges against Homeland Security Secretary … ",
    "url": "https://thehill.com/homenews/senate/4561860-house-mayorkas-impeachment-charges-senate/"
  },
  {
    "text": "The Foreign-Born Share and Number at Record Highs in February 2024  —  A look at the size and growth of the immigrant population in the United States  —  Analysis of the Census Bureau's Current Population Survey (CPS) shows that the total foreign-born or immigrant population (legal and illegal) … ",
    "url": "https://cis.org/Report/ForeignBorn-Share-and-Number-Record-Highs-February-2024"
  },
  {
    "text": "Boeing union wants a board seat and a say on plane safety … - The International Association of Machinists is taking the opportunity to negotiate beyond standard line items like pay and retirement benefits — they want a real say in quality and safety standards.",
    "url": "https://www.axios.com/2024/03/28/boeing-union-board-contract"
  },
  {
    "text": "Army suffers two Apache helicopter crashes within 48 hours  —  The Army has had two Apache helicopter crashes within 48 hours, with the latest sending two soldiers to the hospital when their aircraft went down Wednesday evening near Fort Carson, Colo., the service confirmed Thursday.",
    "url": "https://thehill.com/policy/defense/4562466-army-suffers-two-apache-helicopter-crashes-within-48-hours/"
  }
]