[
  {
    "text": "Judge dismisses some charges against Trump in the Georgia 2020 election interference case  —  The judge overseeing the Georgia 2020 election interference case on Wednesday dismissed some of the charges against former President Donald Trump and others, but many counts in the sweeping racketeering indictment remain intact.",
    "url": "https://apnews.com/article/georgia-election-interference-2020-trump-46e0b68c25719c404130f7e6eab69dcd"
  },
  {
    "text": "Cheney fuels speculation about her next move  —  Speculation is growing about the role former Rep. Liz Cheney (R-Wyo.) will play in the 2024 election as President Biden and former President Trump barrel toward a rematch.  —  Cheney has vowed that she'll do whatever it takes to keep Trump from returning to the White House.",
    "url": "https://thehill.com/homenews/campaign/4526744-cheney-fuels-speculation-about-her-next-move/"
  },
  {
    "text": "Judge in Georgia election interference case dismisses three counts against Trump  —  Judge Scott McAfee found some of the counts against the former president and some of his co-defendants were lacking details.  —  ATLANTA — The judge presiding over the election interference case in Georgia … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-georgia-election-interference-case-dismisses-three-counts-trump-rcna143182"
  },
  {
    "text": "Putin Recalls Trump Acting Like Jealous GF in Private  —  According to him, Trump made no attempt to hide his own insecurities about Joe Biden.  —  Russia's Vladimir Putin has revealed an apparently previously unreported conversation with Donald Trump in which he claims the then-American president … ",
    "url": "https://www.thedailybeast.com/putin-recalls-trump-being-jealous-of-sleepy-joe-biden-in-private"
  },
  {
    "text": "Trailing Trump in Polls, Biden Can Be More Bullish in One Battleground  —  The president faces lagging energy in many key states.  But in Wisconsin, which he will visit on Wednesday, rolling clashes over abortion rights and democracy have kept Democratic voters fired up.",
    "url": "https://www.nytimes.com/2024/03/13/us/politics/biden-wisconsin-trump.html"
  },
  {
    "text": "‘Make the RNC White Again’: GOP Ends Minority Outreach Program  —  With Trump allies taking over the RNC and cleaning house, one of the casualties was a minority outreach program that seemed to be working for Republicans. … After years of accusations of financial mismanagement … ",
    "url": "https://www.thedailybeast.com/make-the-rnc-white-again-gop-ends-minority-outreach-program"
  },
  {
    "text": "Trump's GOP is already dying  —  For Donald Trump, last week must have seemed like a final, crowning victory over his lingering Republican critics.  On Friday the Republican National Committee made official what Trump had already decreed weeks ago, electing Trump's daughter-in-law, Lara Trump, as party co-chair.",
    "url": "https://thehill.com/opinion/campaign/4528680-trumps-gop-is-already-dying/"
  },
  {
    "text": "House approves TikTok bill that could lead to a ban of the app  —  The House on Wednesday approved legislation that would require TikTok's Chinese parent company, ByteDance, to sell it within 180 days or risk having the app barred from app stores and web hosting services in the United States.",
    "url": "https://www.washingtonpost.com/technology/2024/03/13/tiktok-ban-house-vote-live/"
  },
  {
    "text": "Panic Time for Democrats As Joe Biden Gets No Bump From Terrible State of the Union Speech  —  The disconnect between the press and average Americans was laid bare following Joe Biden's angry and divisive State of the Union speech in early March.  —  As RedState reported … ",
    "url": "https://redstate.com/bonchie/2024/03/13/panic-time-for-democrats-as-joe-biden-gets-no-bump-from-terrible-state-of-the-union-speech-n2171315"
  },
  {
    "text": "Hunter Biden declines request to appear at public hearing  —  President Biden's son, Hunter Biden, won't appear before Congress at a slated March 20 hearing, with his attorney telling House Republicans that he “declines your invitation to this carnival side show.”",
    "url": "https://thehill.com/homenews/4528859-hunter-biden-declines-request-to-appear-at-public-hearing/"
  },
  {
    "text": "Say gay, Florida  —  This week, the State of Florida agreed to settle a lawsuit challenging the constitutionality of the Parental Rights in Education Act, better known as the “Don't Say Gay” law.  The bill's text prohibited “classroom instruction by school personnel or third parties … ",
    "url": "https://popular.info/p/update-say-gay-florida"
  },
  {
    "text": "Brett Kavanaugh knows truth of alleged sexual assault, Christine Blasey Ford says in book  —  In memoir, professor whose accusation rocked 2018 supreme court hearings says rightwing justice not ‘consummately honest person’  —  The US supreme court justice Brett Kavanaugh is not a … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/13/christine-blasey-ford-book-supreme-court-brett-kavanaugh-sexual-assault"
  },
  {
    "text": "$500K Sand Dune Designed to Protect Coastal Homes Washes Away in Just 3 Days  —  CRUMBLED  —  In a drastic attempt to protect their beachfront homes, residents in Salisbury, Massachusetts, invested $500,000 in a sand dune to defend against encroaching tides.",
    "url": "https://www.thedailybeast.com/dollar500k-dune-designed-to-protect-massachusetts-homes-last-just-3-days"
  },
  {
    "text": "On popular online platforms, predatory groups coerce children into self-harm  —  Vulnerable teens are blackmailed into degrading and violent acts by abusers who then boast about it  —  Editor's note: This story describes extremely disturbing events that may be upsetting for some people.",
    "url": "https://www.washingtonpost.com/investigations/interactive/2024/764-predator-discord-telegram/"
  },
  {
    "text": "“Trump Employee 5” details Trump's mob-like management style  —  Brian Butler dishes to CNN and reminds us why his former boss should be nowhere near the presidency. … CNN dropped an interview on Monday night that, in normal times, would spell a death knell for a presidential bid … ",
    "url": "https://www.publicnotice.co/p/trump-employee-5-brian-butler-cnn-interview"
  },
  {
    "text": "Study: Fox News ran nearly 400 weekday segments on “migrant crime” in the first 10 weeks of 2024  —  RESEARCH CONTRIBUTIONS FROM TYLER MONROE, SAGE HODIL & BEN VAN BLOEM … Fox has designed its coverage to stoke its audience's fears that migrants will endanger their families and spur anger … ",
    "url": "https://www.mediamatters.org/fox-news/study-fox-news-ran-nearly-400-weekday-segments-migrant-crime-first-10-weeks-2024"
  },
  {
    "text": "Aaron Rodgers and Jesse Ventura Top R.F.K. Jr.'s List for Running Mate  —  Mr. Kennedy said he had been speaking with the Jets quarterback “pretty continuously” for the past month.  —  Robert F. Kennedy Jr. has recently approached the N.F.L. quarterback Aaron Rodgers and the former Minnesota governor … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/rfk-jr-aaron-rodgers-jesse-ventura.html"
  }
]