[
  {
    "text": "How Far Trump Would Go  —  The former President, at Mar-a-Lago on April 12, is rallying the right at home and seeking common cause with autocratic leaders abroad.Photograph by Philip Montgomery for TIME  —  Donald Trump thinks he's identified a crucial mistake of his first term: He was too nice.",
    "url": "https://time.com/6972021/donald-trump-2024-election-interview/"
  },
  {
    "text": "Read the Full Transcripts of Donald Trump's Interviews With TIME … Over the course of the interviews, Trump discussed his agenda for a second term, which includes deporting millions of people, cutting the U.S. civil service, and intervening more directly in Justice Department prosecutions than his predecessors.",
    "url": "https://time.com/6972022/donald-trump-transcript-2024-election/"
  },
  {
    "text": "Biden and Democrats Seize on Trump's Striking Interview  —  The president and other top Democrats moved quickly to capitalize politically on Donald J. Trump's interview with Time magazine, particularly his comments on abortion.  —  The Biden campaign is mounting a concerted push … ",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/biden-democrats-trump-interview.html"
  },
  {
    "text": "Trump's most revealing quotes yet on what he'll do if he wins in 2024 … “If they weren't able to, then I'd use [other parts of] the military.”  — In response to a question over whether he would override the Posse Comitatus Act, which forbids the use of the military against civilians … ",
    "url": "https://www.axios.com/2024/04/30/donald-trump-time-magazine-interview-news"
  },
  {
    "text": "Judge holds Trump in contempt for violating gag order in hush money trial  —  Prosecutors from the Manhattan District Attorney's Office accused Trump of violating the gag order numerous times since it went into effect.  —  The judge presiding over Donald Trump's hush money case on Tuesday held … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-holds-trump-contempt-violating-gag-order-hush-money-trial-rcna149101"
  },
  {
    "text": "Live Updates: Lawyer for Stormy Daniels Takes Stand in Trump Criminal Trial  —  Keith Davidson, who negotiated the $130,000 hush-money payment at the heart of the case, has begun testifying.  Earlier, the judge overseeing the trial fined Donald J. Trump $9,000 and warned he could be jailed if he continued to violate his gag order.",
    "url": "https://www.nytimes.com/live/2024/04/30/nyregion/trump-hush-money-trial"
  },
  {
    "text": "Trump, Venting About Lawyer in His Criminal Trial, Seeks More Aggression  —  Todd Blanche upended his career to represent Donald J. Trump and has been the former president's favorite.  But Mr. Trump has made him a focus of his episodic wrath.  —  Donald J. Trump's Manhattan criminal trial … ",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/trump-trial-todd-blanche.html"
  },
  {
    "text": "Marjorie Taylor Greene struggles to find GOP support for deposing Mike Johnson  —  Only two Republicans have signed onto Greene's effort to oust the House speaker, and neither would say when or if a vote is planned.  —  WASHINGTON — Rep. Marjorie Taylor Greene, R-Ga. … ",
    "url": "https://www.nbcnews.com/politics/congress/marjorie-taylor-greene-struggles-find-gop-support-deposing-mike-johnso-rcna149965"
  },
  {
    "text": "US drug control agency will move to reclassify marijuana in a historic shift, AP sources say  —  The U.S. Drug Enforcement Administration will move to reclassify marijuana as a less dangerous drug, The Associated Press has learned, a historic shift to generations of American drug policy … ",
    "url": "https://apnews.com/article/marijuana-biden-dea-criminal-justice-pot-f833a8dae6ceb31a8658a5d65832a3b8"
  },
  {
    "text": "Biden administration plans to reclassify marijuana, easing restrictions nationwide  —  Cannabis is currently classified along with drugs like heroin and LSD.  The DEA is expected to reschedule it into a category that includes Tylenol and steroids.  —  WASHINGTON — The Biden administration … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-administration-plans-reclassify-marijuana-easing-restrictions-na-rcna149424"
  },
  {
    "text": "Why I'm Resigning From The Intercept  —  I resigned from The Intercept today in order to pursue a new kind of journalism here on Substack, one more hard-hitting than what's possible in the corporate world.  The Intercept has been taken over by suits who have abandoned its founding mission … ",
    "url": "https://www.kenklippenstein.com/p/why-im-resigning-from-the-intercept"
  },
  {
    "text": "Northwestern Cuts Deal with Encampment Organizers, Establishes Full-Ride Scholarship for Palestinian Students  —  After five days of anti-Israel demonstrators occupying Deering Meadow on Northwestern University's campus, Northwestern president Michael Schill and the rest of the university's leadership decided … ",
    "url": "https://www.nationalreview.com/news/northwestern-cuts-deal-with-encampment-organizers-establishes-full-ride-scholarship-for-palestinian-students/"
  },
  {
    "text": "Kristi Noem kills puppy, unites America  —  Kristi Noem is not going to be vice president.  But history could remember her as one of the most unifying politicians of her generation.  —  In her new autobiography — her second in two years .... who knew there was so much going on in South Dakota?",
    "url": "https://thehill.com/opinion/campaign/4633016-kristi-noem-kills-puppy-goat-shoots-gun-america-vice-president/"
  },
  {
    "text": "Supreme Court Allows, for Now, Texas Law Restricting Access to Porn  —  The law, meant to shield minors from sexual materials on the internet by requiring adults to prove they are 18, was challenged on First Amendment grounds.  —  The Supreme Court refused on Tuesday to block a Texas law … ",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/supreme-court-porn.html"
  },
  {
    "text": "Trump Holds Edge Over Biden in Seven Key Swing State Polls  —  Home Polls Trump Holds Edge Over Biden in Seven Key Swing State Polls  —  Democrats Maintain Lead over Republicans in Five Senate Races  —  New Emerson College Polling/The Hill swing state polls find President Biden trailing … ",
    "url": "https://emersoncollegepolling.com/trump-holds-edge-over-biden-in-seven-key-swing-state-polls/"
  },
  {
    "text": "Sex is biological fact, NHS declares in landmark shift against gender ideology  —  Campaigners welcome change to constitution, which will ban trans women from female-only wards, as ‘return to common sense’  —  The NHS is to declare that sex is a matter of biology in a landmark shift against gender ideology.",
    "url": "https://www.telegraph.co.uk/news/2024/04/30/nhs-sex-biological-landmark-shift-against-gender-ideology/"
  },
  {
    "text": "How a Few Secret Donors Are Fueling the New Right-Wing Infrastructure  —  The Bradley Impact Fund helps finance the work of groups led by Michael Flynn and Stephen Miller.  Most of the money can be traced to four undisclosed sources, documents show.  —  In early 2021, Stephen Miller … ",
    "url": "https://www.motherjones.com/politics/2024/04/bradly-impact-fund-michael-flynn-stephen-miller-culture-war-project-veritas-american-first-legal-cpi/"
  },
  {
    "text": "‘Frustrated’ ex-Trump aide says she won't vote for former president  —  Sarah Matthews, an ex-staffer of former President Trump, said Monday she would not cast her vote in November for Trump, signaling she could instead vote for President Biden.  —  “When we have a candidate on the ballot … ",
    "url": "https://thehill.com/homenews/campaign/4632165-sarah-matthews-former-donald-trump-aide-vote-joe-biden-2024/"
  },
  {
    "text": "War Zone Surveillance Technology Is Hitting American Streets … Big Brother isn't just watching you: He's using your cell phone, smartwatch, wireless earbuds, car entertainment systems and license plates to track your location in real time.  —  Contracting records and notes … ",
    "url": "https://www.notus.org/technology/war-zone-surveillance-border-us"
  },
  {
    "text": "Fox News Quietly Deletes Hunter Biden ‘Mock Trial’ Series  —  ‘HOLDING THEM ACCOUNTABLE’  —  The conservative cable giant has quickly moved to comply with the presidential scion's demands. … Fox News appears to be taking Hunter Biden's lawsuit threat quite seriously.",
    "url": "https://www.thedailybeast.com/fox-news-quietly-deletes-hunter-biden-mock-trial-special-following-lawsuit-threat"
  },
  {
    "text": "Why Some Abortion Rights Groups Aren't Backing Pro-Choice Amendments  —  There's an internal struggle playing out right now in many states where abortion rights will likely be on the November ballot.  —  Eloisa Lopez is the executive director for Pro-Choice Arizona and the Abortion Fund of Arizona … ",
    "url": "https://www.huffpost.com/entry/why-some-abortion-rights-groups-not-backing-pro-choice-amendments_n_662fe875e4b0c9bc875862d4"
  },
  {
    "text": "The biggest political deception of 2024  —  In the 2024 presidential election, one of the central attacks that Trump and his political allies are levying against Biden is that Biden is responsible for a “migrant crime” wave.  The argument was summarized by Trump in a March 22 video:",
    "url": "https://popular.info/p/the-biggest-political-deception-of"
  }
]