[
  {
    "text": "Matt Gaetz says he will attempt to oust Kevin McCarthy from the speakership this week  —  Rep. Matt Gaetz is planning to attempt to oust Speaker Kevin McCarthy from the role this week after the House leader worked with Democrats to avoid a government shutdown on Saturday.",
    "url": "https://www.cnn.com/2023/10/01/politics/house-republicans-infighting-matt-gaetz-kevin-mccarthy-shutdown/"
  },
  {
    "text": "Gaetz says he will force vote to oust McCarthy as House speaker  —  Rep. Matt Gaetz (R-Fla.) said Sunday that he is determined to try to oust Rep. Kevin McCarthy (R-Calif.) from his position as House speaker after McCarthy passed a stopgap measure to fund the government with Democratic support.",
    "url": "https://www.washingtonpost.com/politics/2023/10/01/kevin-mccarthy-matt-gaetz-house-speaker/"
  },
  {
    "text": "Gaetz Says He Will Move to Oust McCarthy for Working With Democrats  —  A day after the Republican speaker turned to Democrats for help passing a stopgap spending bill to avert a shutdown, the far-right congressman promised to try to remove him from his post.",
    "url": "https://www.nytimes.com/2023/10/01/us/politics/mccarthy-speaker-gaetz.html"
  },
  {
    "text": "Who is this man and what has he done with Kevin McCarthy?  —  For eight months, there were no adults working in the House Republican day-care center.  —  Day after day, the toddlers of the far right threw tantrum after tantrum.  But instead of giving the brats in his caucus a timeout … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/30/mccarthy-government-shutdown-avoided/"
  },
  {
    "text": "McCarthy, McConnell suffer setbacks over control of their caucuses  —  The House speaker and Senate minority leader faced rejection on different fronts: McCarthy forced into leaning on Democrats to keep the government open and McConnell defied by GOP senators on Ukraine  —  Congressional bureau chief",
    "url": "https://www.washingtonpost.com/politics/2023/10/01/mccarthy-mcconnell-congress-government-shutdown/"
  },
  {
    "text": "Gaetz says he'll push to unseat McCarthy this week  —  Rep. Matt Gaetz (R-Fla.) on Sunday said he will push to unseat House Speaker Kevin McCarthy (R-Calif.) this week, vowing to make good on his threat after McCarthy backed a measure to prevent a government shutdown a day earlier that won broad bipartisan support.",
    "url": "https://thehill.com/homenews/house/4232514-gaetz-says-hell-push-to-unseat-mccarthy-this-week/"
  },
  {
    "text": "Inside McCarthy's Shutdown Turnabout That Left His Speakership at Risk  —  The Republican speaker opted to keep the government open the only way he could — by partnering with Democrats — in a surprise reversal that left him as politically vulnerable as ever.",
    "url": "https://www.nytimes.com/2023/10/01/us/politics/mccarthy-shutdown-turnabout.html"
  },
  {
    "text": "Fetterman: 'I'm done normalizing this dysfunction'  —  Pennsylvania Sen. John Fetterman (D) expressed his frustration with the recent state of Congress in the wake of the Senate voting to approve a continuing resolution (CR) to keep the government funded Saturday.",
    "url": "https://thehill.com/homenews/senate/4232340-fetterman-im-done-normalizing-this-dysfunction/"
  },
  {
    "text": "The Case for Amplifying Trump's Insanity  —  The “Banality of Crazy” has warped American politics, as few voters recognize just how deranged, delusional, and dangerous Donald Trump is...because the press rarely reports on his routine insanity. … Sometimes, you have to write when you're angry.",
    "url": "https://www.forkingpaths.co/p/the-case-for-amplifying-trumps-insanity"
  },
  {
    "text": "Meghan Markle Linked to Run for Dianne Feinstein's Senate Seat  —  Plus, hackers crash the royal website, Harry and Meghan backstage at Invictus Games, stay at Diana's childhood home, and why does runner William want to trademark race numbers? … Meghan “long-shot” replacement for Feinstein seat",
    "url": "https://www.thedailybeast.com/meghan-markle-linked-to-run-for-dianne-feinsteins-senate-seat"
  },
  {
    "text": "How the right's elevation of Robert F. Kennedy Jr. could now backfire  —  The American right's efforts to elevate Robert F. Kennedy Jr. were as transparent as they were cynical.  The idea, as advanced by Stephen K. Bannon and the like, was clearly to try to embarrass President Biden in the Democratic primary.",
    "url": "https://www.washingtonpost.com/politics/2023/10/01/how-rights-elevation-robert-f-kennedy-jr-could-now-backfire/"
  },
  {
    "text": "One Reason the Trump Fever Won't Break  —  The more I consider the challenge posed by Christian nationalism, the more I think most observers and critics are paying too much attention to the wrong group of Christian nationalists.  We mainly think of Christian nationalism as a theology or at least as a philosophy.",
    "url": "https://www.nytimes.com/2023/10/01/opinion/christian-nationalism-trump-renew-america.html"
  },
  {
    "text": "Trump goes to trial in New York before a judge who just ruled he's a fraud  —  The $250 million civil trial starts Monday — and Trump may be there in person.  —  NEW YORK — Donald Trump is set to go to trial Monday in New York's civil lawsuit accusing him of extensive business fraud … ",
    "url": "https://www.politico.com/news/2023/10/01/trump-civil-trial-new-york-00119297"
  },
  {
    "text": "Newsom vetoes bill that would allow striking workers to get unemployment checks  —  California Gov. Gavin Newsom (D) on Saturday vetoed a bill that would have allowed workers on strike to become eligible for Unemployment Insurance (UI) benefits.  —  In his note to the California State Senate … ",
    "url": "https://thehill.com/homenews/state-watch/4232479-newsom-vetoes-bill-that-would-allow-striking-workers-to-get-unemployment-checks/"
  },
  {
    "text": "Grant Shapps to ramp up support for Volodymyr Zelensky  —  UK to boost training for Ukrainian soldiers and Navy may help protect grain vessels  —  Britain will ramp up its training programme for Ukrainian soldiers under plans being discussed with military chiefs, the new Defence Secretary has disclosed.",
    "url": "https://www.telegraph.co.uk/politics/2023/09/30/grant-shapps-to-send-uk-troops-to-ukraine/"
  }
]