[
  {
    "text": "Full transcript: Read Kristen Welker's interview with Trump  —  NBC's “Meet the Press” moderator Kristen Welker conducted a wide-ranging interview with former President Donald Trump.  —  Full Trump Interview: 'I don't consider us to have much of a democracy right now'",
    "url": "https://www.nbcnews.com/meet-the-press/transcripts/full-transcript-read-meet-the-press-kristen-welker-interview-trump-rcna104778"
  },
  {
    "text": "Trump says he doesn't worry about going to jail: 'I don't even think about it'  —  Former President Donald Trump isn't losing sleep over the prospect that he could end up behind bars, he said in an exclusive interview with NBC's “Meet the Press” moderator Kristen Welker.",
    "url": "https://www.nbcnews.com/meet-the-press/meet-the-press/trump-doesnt-worry-going-jail-meet-the-press-rcna105312"
  },
  {
    "text": "Trump Plans Two Mar-a-Lago Fundraisers for Campaign, Legal Fees  — Separate events said to include a dinner for $100,000 per seat  — Former president has been fundraising on his four indictments  —  Former President Donald Trump is planning separate fundraisers at Mar-a-Lago in October … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-16/trump-plans-two-mar-a-lago-fundraisers-for-campaign-legal-fees"
  },
  {
    "text": "Letter shows Pope Pius XII probably knew about Holocaust early on  —  Wartime Pope Pius XII knew details about the Nazi attempt to exterminate Jews in the Holocaust as early as 1942, according to a letter found in the Vatican archives that conflicts with the Holy See's official position … ",
    "url": "https://www.reuters.com/world/letter-shows-pope-pius-xii-probably-knew-about-holocaust-early-2023-09-17/"
  },
  {
    "text": "Pope Pius XII Likely Knew of Holocaust, Newly Discovered Letter Suggests  —  The newly discovered letter, written by a German Jesuit to Pope Pius XII's personal secretary, suggests that the pope knew of Hitler's atrocities but chose to remain silent.  —  A letter found among the private papers … ",
    "url": "https://www.nytimes.com/2023/09/16/world/europe/pope-pius-holocaust.html"
  },
  {
    "text": "Jann Wenner Removed From Rock Hall Board After Times Interview  —  The Rolling Stone co-founder's exit comes a day after The New York Times published an interview in which he made widely criticized comments.  —  Jann Wenner, the co-founder of Rolling Stone magazine, has been removed … ",
    "url": "https://www.nytimes.com/2023/09/16/arts/music/jann-wenner-removed-rock-hall.html"
  },
  {
    "text": "Man groped by Lauren Boebert during frisky ‘Beetlejuice’ date owns gay-friendly bar that hosts drag shows  —  A bar owned by Rep. Lauren Boebert's apparent new beau has staged at least one drag show, according to a review of social media posts.  —  In January, the Hooch Craft Cocktail Bar in Aspen … ",
    "url": "https://nypost.com/2023/09/16/lauren-boeberts-new-man-owns-gay-friendly-bar-which-hosts-drag-shows/"
  },
  {
    "text": "Democratic Leaders Are More Optimistic About Biden 2024 Than Voters  —  Party leaders have rallied behind the president's re-election bid, but as one top Democratic strategist put it, “The voters don't want this, and that's in poll after poll after poll.”  —  As President Biden shifts … ",
    "url": "https://www.nytimes.com/2023/09/17/us/politics/biden-democrats-voter-concerns.html"
  },
  {
    "text": "'We'll be fine': Top US military officer confident there won't be a Jan. 6 repeat  —  Gen. Milley said he was not concerned about more riot threats after he retires.  —  As former President Donald Trump continues to falsely claim he won the last election while he campaigns … ",
    "url": "https://abcnews.go.com/Politics/fine-top-us-military-officer-confident-jan-6/story?id=103253206"
  },
  {
    "text": "COVID levels are so high, they're hovering near 2020's initial peak, as the WHO urges those at high risk to take any booster they can get their hands on  —  IRFAN KHAN, LOS ANGELES TIMES VIA GETTY IMAGES  —  U.S. COVID infections are hovering near levels of the pandemic's first peak in 2020 … ",
    "url": "https://fortune.com/well/2023/09/16/united-states-covid-levels-approach-first-pandemic-peak-2020-who-urges-vaccination-boosters-high-risk/"
  },
  {
    "text": "Russell Brand accused of rape, sexual assaults and abuse  —  Four women, including one who was just 16, make allegations after an investigation by The Sunday Times, The Times and Channel 4 Dispatches  —  The comedian and actor Russell Brand has been accused of rape, sexual assaults … ",
    "url": "https://www.thetimes.co.uk/article/russell-brand-rape-sexual-assault-abuse-allegations-investigation-v5hxdlmb6"
  },
  {
    "text": "Sore throat, then congestion: Common Covid symptoms follow a pattern now, doctors say  —  Doctors who treat Covid describe the ways the illness has gotten milder and shifted over time to mostly affect the upper respiratory tract.  —  How Covid symptoms have evolved since the pandemic",
    "url": "https://www.nbcnews.com/health/health-news/covid-symptoms-mild-follow-pattern-doctors-say-rcna105090"
  },
  {
    "text": "Presidential Straw Poll Results: Pray Vote Stand Summit 2023  —  These are the results from the straw poll held at the Pray Vote Stand Summit 2023 in Washington, D.C.  —  Votes for President:  —  CandidateCountPercent  —  63.9%  —  27.3%  —  2.2%  —  1.9%  —  1.7%  —  1.5%  —  0.9%",
    "url": "https://washingtonstand.com/news/presidential-straw-poll-results-pray-vote-stand-summit-2023"
  },
  {
    "text": "Texas Attorney General Ken Paxton acquitted in impeachment trial  —  Paxton was impeached for allegedly taking bribes, but ultimately members of his party chose not to vote for his conviction and removal from office.  —  Impeached Texas Attorney General Ken Paxton was acquitted … ",
    "url": "https://www.nbcnews.com/politics/politics-news/texas-attorney-general-ken-paxton-acquitted-impeachment-trial-rcna104816"
  },
  {
    "text": "Military officers begin to speak out on the harm done by Sen. Tuberville's holds on promotions  —  In the months since a single senator froze military promotions over the Pentagon's abortion policy, the uniformed officers affected have been largely silent, wary of stepping into a political fray.",
    "url": "https://apnews.com/article/tuberville-holds-military-nominations-664c15d00d330b2b06b75ebeda8e3f01"
  }
]