[
  {
    "text": "Powerful House GOP chair retiring after Mayorkas impeachment … - Green's decision to retire comes on the same week as the House voted to impeach Homeland Security Secretary Alejandro Mayorkas.  — Green joins House Appropriations Committee Chair Kay Granger (R-Texas) … ",
    "url": "https://www.axios.com/2024/02/14/mark-green-retire-congress-mayorkas-impeachment"
  },
  {
    "text": "Trump ramps up calls to Congress to impeach Biden  —  Trump's remarks were the second time in less than 24 hours that the former president has pushed for Biden's impeachment  —  Former president Donald Trump escalated his calls for Congress to impeach President Biden, just one day after … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/14/trump-urges-congress-impeach-biden/"
  },
  {
    "text": "Putin says Biden would be better for Russia as president than Trump  —  Russian president also dismissed criticism of Joe Biden's mental fitness.  —  Russian President Vladimir Putin said Wednesday Joe Biden would be better for Russia as president than Donald Trump, ahead of a potential rematch between … ",
    "url": "https://www.politico.eu/article/biden-would-be-a-better-president-than-trump-says-putin/"
  },
  {
    "text": "Biden Must Win.  But How?  —  Like many Democrats, I'm stuck on a doomsday merry-go-round: Joe Biden shouldn't be running for president.  Joe Biden is running for president.  Donald Trump shouldn't be running for president.  Donald Trump is running for president.  —  But this isn't 2020.",
    "url": "https://www.nytimes.com/2024/02/15/opinion/biden-2024-election.html"
  },
  {
    "text": "White House to brief lawmakers as House chairman warns of ‘serious national security threat’  —  Lawmakers said the issue is serious but shouldn't cause immediate alarm.  —  National Security Advisor Jake Sullivan speaks during a press briefing at the White House in Washington, Feb. 14, 2024.",
    "url": "https://abcnews.go.com/Politics/white-house-plans-brief-lawmakers-house-chairman-warns/story?id=107232293"
  },
  {
    "text": "Trump hearings in N.Y., Georgia on Thursday as trial schedule comes into focus  —  The former president is expected at a pre-trial conference in Manhattan, while some of his lawyers will be at Atlanta hearing focused on D.A. Fani Willis  —  Donald Trump is expected at the defendant's table … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/14/trump-hearings-new-york-atlanta-fani-willis/"
  },
  {
    "text": "Special counsel asks Supreme Court to let Trump's 2020 election case proceed to trial without delay  —  Special counsel Jack Smith urged the U.S. Supreme Court on Wednesday to let former President Donald Trump's 2020 election interference case proceed to trial without further delay.",
    "url": "https://apnews.com/article/trump-special-counsel-election-interference-january-6-c2dcc83e56a541804d4785f6bb6cd45c"
  },
  {
    "text": "Senior Republicans fear Trump will tap the RNC to cover legal bills again  —  The president is going to put his people in place on the committee.  Major changes are in store.  —  Several senior Republican officials are concerned that Donald Trump's expected takeover of the RNC will ultimately pave … ",
    "url": "https://www.politico.com/news/2024/02/14/trump-rnc-legal-bills-00141540"
  },
  {
    "text": "The Truth About Trump's RNC Shakeup—and Why the GOP Will Suffer  —  A shakeup at the RNC may mean less money for anyone not named Donald Trump.  And that's terrible news for state parties desperate for cash. … Donald Trump doesn't want his snowballing legal troubles to just be his problem … ",
    "url": "https://www.thedailybeast.com/the-truth-about-trumps-rnc-shakeupand-why-the-gop-will-suffer"
  },
  {
    "text": "Conservative group tells judge it has no evidence to back its claims of Georgia ballot stuffing  —  A conservative group has told a Georgia judge that it doesn't have evidence to support its claims of illegal ballot stuffing during the the 2020 general election and a runoff two months later.",
    "url": "https://apnews.com/article/georgia-elections-true-vote-ballot-stuffing-199113b47bc2df79c63fdf007cd23115"
  },
  {
    "text": "Tucson school district drops instructor after OnlyFans exposure  —  The woman who resigned as head of an NAACP chapter in 2015 after mispresenting herself as Black, Rachel Dolezal, was working for the Catalina Foothills Unified School District until its officials learned Tuesday of social media content under her current name.",
    "url": "https://tucson.com/news/local/education/precollegiate/rachel-dolezal-tucson-catalina-foothills-school-district-onlyfans/article_7adc55f6-cb6e-11ee-8803-3bcd55b84f0c.html"
  },
  {
    "text": "Biden attacked Hur for asking him when Beau died.  That didn't happen, sources say.  —  The president raised his son's death after being asked about his workflow at a Virginia rental home, where he said he found classified materials, two sources said.  —  President Joe Biden lashed … ",
    "url": "https://www.nbcnews.com/politics/justice-department/biden-attacked-hur-asking-beau-died-didnt-happen-sources-say-rcna138709"
  },
  {
    "text": "How Senate Democrats Flipped the Border Issue on Republicans  —  Senator Chuck Schumer was wary of tying immigration policy to emergency aid for Ukraine, but he saw an opening to address border turmoil that was becoming a political liability — and to call Republicans' bluff.",
    "url": "https://www.nytimes.com/2024/02/14/us/border-senate-schumer.html"
  },
  {
    "text": "Updated: Incident at National Archives Rotunda Closes Galleries to Public  —  Press Release  —  The National Archives Rotunda and galleries in Washington, DC, closed to the public today after two individuals dumped red powder on the encasement protecting the U.S. Constitution at approximately 2:30 pm.",
    "url": "https://www.archives.gov/press/press-releases/2024/nr24-14"
  },
  {
    "text": "Arizona GOP introduces resolution to declare Trump 2024 winner regardless of the vote  —  Republicans in the Arizona House of Representatives have introduced a resolution that would seek to declare former President Donald Trump the winner of the 2024 presidential election … ",
    "url": "https://www.rawstory.com/trump-2024-arizona/"
  },
  {
    "text": "Huma Abedin Reveals Relationship with George Soros' Son Alex  —  Hilary Clinton's longtime aide reshared a photo showing the two cuddled-up in a booth at a restaurant in Paris.  —  Hilary Clinton's longtime aide Huma Abedin has apparently moved on from her scandal-scarred ex-husband Anthony Weiner … ",
    "url": "https://www.thedailybeast.com/huma-abedin-reveals-relationship-with-george-soros-son-alex-soros"
  },
  {
    "text": "ASSISTANT DEMOCRATIC LEADER CLYBURN STATEMENT ON HOUSE LEADERSHIP ROLE  —  WASHINGTON, D.C. — Today, U.S. House Assistant Democratic Leader James E. Clyburn released the following statement on his decision to step down from House Democratic leadership:  —  “I have informed Leader Hakeem Jeffries … ",
    "url": "https://assistantdemocraticleader.house.gov/media/press-releases/assistant-democratic-leader-clyburn-statement-house-leadership-role"
  },
  {
    "text": "Mozilla lays off 60 people, wants to build AI into Firefox  —  Memo details layoffs, “strategic corrections,” and a desire for “trustworthy” AI.  —  Mozilla got a new “interim” CEO just a few days ago, and the first order of business appears to be layoffs.",
    "url": "https://arstechnica.com/gadgets/2024/02/mozilla-lays-off-60-people-wants-to-build-ai-into-firefox/"
  },
  {
    "text": "US Cancels Multibillion-Dollar Classified Military Satellite Program  — Contractor discloses Space Force ‘termination for convenience’  — Cancellation driven by cost, payload performance, people say  —  The US Space Force canceled a multibillion-dollar Northrop Grumman Corp. program … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-15/us-space-force-cancels-northrop-s-multibillion-dollar-military-satellite"
  },
  {
    "text": "George Santos puts former congressional colleagues in group chat to call them ‘f***ing idiots’  —  The News  —  Ex-Congressman George Santos is on a revenge tour after Republicans lost the seat vacated by his expulsion — and blowing up the New York delegation group chat along the way.",
    "url": "https://www.semafor.com/article/02/14/2024/george-santos-puts-former-congressional-colleagues-in-group-chat-to-call-them-fing-idiots"
  }
]