[
  {
    "text": "As Trump fumes, Republicans wince at ‘public nervous breakdown’  —  Republicans are reeling from Trump's undisciplined approach to the opening stages of his race against Harris.  —  Donald Trump spent Monday morning labeling the turmoil in the global financial markets the “Kamala Crash,” … ",
    "url": "https://www.politico.com/news/2024/08/05/republicans-cringe-trump-harris-attacks-00172724"
  },
  {
    "text": "Trump Pulls Bulk of Voters' Concerns About Age, Mental Fitness With Biden Out of Contest  —  Vice President Kamala Harris is seen as more mentally fit than Trump — and garners more trust than Biden on policy issues",
    "url": "https://pro.morningconsult.com/analysis/donald-trump-age-concerns-august-2024"
  },
  {
    "text": "Market sell-off puts Democrats on edge  —  “We cannot win if people think we're headed into a recession,” one Democratic National Committee member said.  —  Democrats aren't ready for the Kamala Harris honeymoon to end.  Monday's stock market plunge is reminding them it can't last forever.",
    "url": "https://www.politico.com/news/2024/08/06/market-sell-off-democrats-harris-00172740"
  },
  {
    "text": "Arizona GOP mayor invited to DNC and Harris campaign rally  —  A Republican mayor in Arizona who bucked his party to endorse Vice President Harris was invited to attend the Democratic National Convention in Chicago later this month, he told The Arizona Republic on Monday.",
    "url": "https://thehill.com/homenews/campaign/4812797-john-giles-invited-dnc-harris-rally-arizona/"
  },
  {
    "text": "US Supreme Court declines to halt Trump's sentencing in hush money case  —  The U.S. Supreme Court on Monday rejected a bid by the state of Missouri to halt Donald Trump's upcoming sentencing for his conviction in New York on felony charges involving hush money paid to a porn star and left … ",
    "url": "https://www.reuters.com/world/us/us-supreme-court-declines-halt-trumps-sentencing-hush-money-case-2024-08-05/"
  },
  {
    "text": "Supreme Court rejects longshot effort by Missouri to block Trump sentencing in New York case  —  Washington — The Supreme Court on Monday rejected a longshot bid by the state of Missouri to halt former President Donald Trump's impending sentence and lift the gag order imposed in the New York … ",
    "url": "https://www.cbsnews.com/news/supreme-court-rejects-missouri-trump-sentencing-new-york-case/"
  },
  {
    "text": "Google loses massive antitrust lawsuit over its search dominance  —  New York CNN  —  Google has violated US antitrust law with its search business, a federal judge ruled Monday, handing the tech giant a staggering court defeat with the potential to reshape how millions of Americans … ",
    "url": "https://www.cnn.com/2024/08/05/business/google-loses-antitrust-lawsuit-doj/"
  },
  {
    "text": "‘Google Is a Monopolist,’ Judge Rules in Landmark Antitrust Case  —  The ruling on Google's search dominance was the first antitrust decision of the modern internet era in a case against a technology giant.  —  Google acted illegally to maintain a monopoly in online search … ",
    "url": "https://www.nytimes.com/2024/08/05/technology/google-antitrust-ruling.html?unlocked_article_code=1.Ak4.5YFq.BNXgssAZjWWq&smid=url-share"
  },
  {
    "text": "Former Trump attorney Jenna Ellis agrees to cooperate in Arizona elector case  —  In a deal that allows Ellis to avoid potential jail time, she has agreed to provide prosecutors with evidence that could implicate other defendants.  —  PHOENIX — Arizona Attorney General Kris Mayes (D) … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/05/jenna-ellis-arizona/"
  },
  {
    "text": "Ex-Trump adviser Conway registers as lobbyist for Ukrainian oligarch  —  Former Trump adviser Kellyanne Conway has registered to lobby on behalf of a Ukrainian oligarch, according to a new foreign agent disclosure filing.  —  Conway registered Friday to represent Ukrainian billionaire Victor … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/4812748-ex-trump-adviser-conway-registers-as-lobbyist-for-ukrainian-oligarch/"
  },
  {
    "text": "“A Terrible Vulnerability”: Cybersecurity Researcher Discovers Yet Another Flaw in Georgia's Voter Cancellation Portal  —  The flaw would have allowed anyone to submit a voter registration cancellation request for any Georgian using their name, date of birth and county of residence — information that is easily discoverable online.",
    "url": "https://www.propublica.org/article/cybersecurity-expert-finds-another-flaw-in-georgia-voter-portal"
  },
  {
    "text": "RFK Jr. admits to dumping a dead bear in Central Park, solving a decade-old mystery  —  For more on the 2024 election, head to the NPR Network's live updates page.  —  A decade after the shocking discovery of a bear cub carcass in Manhattan's Central Park, the mystery of who dumped it there has finally been solved.",
    "url": "https://www.npr.org/2024/08/05/nx-s1-5063939/rfk-jr-central-park-bear-bicycle"
  },
  {
    "text": "Dow drops 1,000 points, and Japanese stocks suffer worst crash since 1987 as markets quake worldwide  —  Nearly everything on Wall Street is tumbling as fear of a slowing U.S. economy grows and sets off another sell-off for financial markets around the world.",
    "url": "https://apnews.com/article/stocks-markets-nikkei-economy-c6240977e9482bf7207abc53b2a11e58"
  },
  {
    "text": "Justice Thomas Failed to Reveal More Private Flights, Senator Says  —  Senator Ron Wyden sent a letter to the wealthy conservative donor Harlan Crow's lawyer after records showed undisclosed flights between Hawaii and New Zealand with the Supreme Court justice in 2010.",
    "url": "https://www.nytimes.com/2024/08/05/us/politics/clarence-thomas-harlan-crow-private-jet.html?unlocked_article_code=1.Ak4.i_ro.GYqTCY16me1G&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Harris prepares to name running mate and launch multistate tour  —  Her selection will complete the Democratic ticket after the nearly unprecedented turmoil that followed Biden's withdrawal from the race.  —  Vice President Harris holed up at her residence at the Naval Observatory on Monday … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/05/harris-running-mate-tour-decision/"
  },
  {
    "text": "Project 2025 Is an Unmitigated Polling Disaster for Trump and Republicans  —  Democrats are planning to “smother” Donald Trump, J.D. Vance, and the GOP with Project 2025 until November.  New polls shows why  —  ACROSS THE DEMOCRATIC Party's most senior levels — within Vice President Kamala … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-vance-republicans-project-2025-polling-disaster-1235074488/"
  },
  {
    "text": "Kamala Harris has MAGA world freaking out about demons and the apocalypse  —  From comparisons to biblical spirits to accusations that she's an “extinctionist,” top pro-Trump voices see a Harris presidency as the end of the world.  —  It's always the end of the world for the Make America Great Again movement.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/kamala-harris-maga-jezebel-apocalypse-rcna164922"
  },
  {
    "text": "On Biden's Exit, Pelosi Says She Was Driven by Need to Defeat Trump  —  A new book by the former speaker details her clashes with the former president, but it was written before her most recent exercise of political might: helping persuade President Biden to end his re-election bid.",
    "url": "https://www.nytimes.com/2024/08/05/us/politics/pelosi-book-trump-biden.html"
  },
  {
    "text": "A fight broke out at the opening of a Trump campaign office in Valdosta, police say  —  An altercation broke out at a recent Donald Trump campaign office opening in Valdosta when a conservative activist confronted a Republican state legislator who sponsored changes to the state's election laws … ",
    "url": "https://www.ajc.com/politics/a-fight-broke-out-at-the-opening-of-a-trump-campaign-office-in-valdosta-police-say/2HYC2E3ZUVADZHWPHXYUMEUXO4/"
  },
  {
    "text": "States have spent nearly $500 million on anti-abortion counseling centers since fall of Roe  —  States that ban or restrict abortion have flooded anti-abortion counseling centers with nearly $500 million in taxpayer funding since the Supreme Court overturned Roe v. Wade two years ago, according to a new report.",
    "url": "https://www.cbsnews.com/news/abortion-states-have-spent-nearly-500-million-on-anti-abortion-counseling-centers/"
  },
  {
    "text": "Exclusive: US personnel wounded in attack against base in Iraq, officials say  —  At least five U.S. personnel were injured in an attack against a military base in Iraq on Monday, U.S. officials told Reuters, as the Middle East braced for a possible new wave of attacks by Iran and its allies following … ",
    "url": "https://www.reuters.com/world/middle-east/us-personnel-hurt-attack-against-base-iraq-officials-say-2024-08-05/"
  },
  {
    "text": "Trump Got a Free Cybertruck From Streamer Adin Ross.  Is That Legal?  —  The controversial content creator, known for platforming white supremacists in the past, may have violated FEC rules on campaign contributions during a sycophantic live interview today",
    "url": "https://www.rollingstone.com/politics/politics-news/adin-ross-trump-rolex-cybertruck-interview-1235074316/"
  }
]