[
  {
    "text": "Former Trump adviser Peter Navarro's testimony in contempt case is ‘weak sauce,’ judge says  —  The federal judge overseeing Peter Navarro's contempt of Congress criminal case on Monday called his defense arguments “pretty weak sauce,” injecting last-minute uncertainty into how the former Donald Trump adviser … ",
    "url": "https://www.cnn.com/2023/08/28/politics/peter-navarro-testimony-contempt-of-congress-case/"
  },
  {
    "text": "Peter Navarro says Trump told him to assert privilege during Jan. 6 committee investigation  —  Washington — Former top Trump White House economic adviser Peter Navarro told a federal judge that Donald Trump made it “very clear” that he wanted Navarro to invoke certain privileges and not respond … ",
    "url": "https://www.cbsnews.com/news/trump-aide-peter-navarro-trump-assert-privilege-jan-6-committee/"
  },
  {
    "text": "Meadows testifies in Atlanta; March trial date for Trump in D.C.  —  Trump D.C. trial set to begin in March amid GOP primaries and other trial dates  —  U.S. prosecutor says Trump's social media posts show need for quick trial  —  'Let's take the temperature down,' judge says in D.C. hearing",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/28/trump-jan-6-trial-date/"
  },
  {
    "text": "Mark Meadows takes stand in bid to derail Georgia criminal charges  —  The former top Trump aide testified that he viewed nearly everything as part of his official duties — an argument he hopes will give him immunity.  —  ATLANTA — Former Trump White House Chief of Staff Mark Meadows took … ",
    "url": "https://www.politico.com/news/2023/08/28/meadows-testimony-georgia-hearing-00113215"
  },
  {
    "text": "EXCLUSIVE: Eminem sends Vivek Ramaswamy a cease and desist letter demanding he stop rapping his music on the campaign trail  — Rapper Eminem has objected to Republican candidate Vivek Ramaswamy using his music on the campaign trail, DailyMail.com can exclusively report",
    "url": "https://www.dailymail.co.uk/news/article-12453955/Im-REAL-Slim-Shady-Eminem-sends-skinny-Vivek-Ramaswamy-cease-desist-letter-demanding-stop-rapping-music-campaign-trail.html"
  },
  {
    "text": "Faculty member shot and killed in a campus building, says University of North Carolina official  —  A University of North Carolina faculty member was shot and killed in a campus building, officials said Monday.  A suspect was arrested about an hour and a half after shots were reported … ",
    "url": "https://apnews.com/article/university-north-carolina-chapel-hill-shooting-9a264145d183eeb7c28bb7d6a467ab39"
  },
  {
    "text": "GOP silences ‘Tennessee Three’ Democrat on House floor for day on ‘out of order’ rule; crowd erupts  —  Republican lawmakers voted Monday to temporarily silence a Democratic member of the so-called Tennessee Three during an already tense House floor session after determining … ",
    "url": "https://apnews.com/article/tennessee-special-session-gun-control-f0af470eb6f377633735c5a1dcefa66f"
  },
  {
    "text": "Samuel Wurzelbacher, Celebrated as ‘Joe the Plumber,’ Dies at 49  —  For Republicans in 2008, he briefly became a symbol of Middle America when he questioned the presidential candidate Barack Obama in an impromptu televised encounter.  —  Samuel Joseph Wurzelbacher, who briefly became … ",
    "url": "https://www.nytimes.com/2023/08/28/us/politics/samuel-wurzelbacher-joe-the-plumber-dead.html"
  },
  {
    "text": "The Limits of Vivek Ramaswamy's Racist Con Game The Limits of Vivek Ramaswamy's Racist Con Game  —  While the emerging GOP star benefits from the right's version of affirmative action, his ugly response to the Jacksonville shootings shows the cost—and constraints—of his strategy.  —  Pocket",
    "url": "https://www.thenation.com/article/politics/vivek-ramaswamys-racist-jacksonville-shootings/"
  },
  {
    "text": "Media #MeToo Men Mount Pathetic Comebacks  —  This week, Confider checked on some of the media stars felled during #MeToo and learned that some of them have been trying to mount comebacks—with varying degrees of success. … Summer 2023 has been a busy time for alleged serial sexual harassers hoping … ",
    "url": "https://www.thedailybeast.com/media-metoo-men-mount-pathetic-comebacks"
  },
  {
    "text": "A federal hate crime probe is underway after 3 people were killed in a racist rampage in Jacksonville, officials say.  Here's what we know  —  A federal hate crime investigation is underway after a White gunman with a swastika-emblazoned assault rifle killed three Black people at a Dollar General store … ",
    "url": "https://www.cnn.com/2023/08/28/us/jacksonville-florida-shooting-what-we-know/"
  },
  {
    "text": "“Fake news”: DeSantis campaign denies Trump claim he might drop out of 2024 race  —  GOP Gov. Ron DeSantis' presidential campaign on Monday dismissed former President Trump's suggestion that he had plans to drop out of the 2024 race. … - “Clearly, Donald Trump and his army of consultants … ",
    "url": "https://www.axios.com/2023/08/28/trump-desantis-presidential-campaign-2024-drop-out-fake-news"
  },
  {
    "text": "‘Doing the right thing’ was worth $40 million to this ex-Marine mother of three  —  When Sarah Feinberg left the Corps, she took a job at a prestigious D.C. contractor.  But when she suspected it was overcharging taxpayers $500 million, she became a whistleblower.",
    "url": "https://www.nbcnews.com/news/investigations/marine-sarah-feinberg-whistleblower-booz-allen-69-million-rcna102098"
  },
  {
    "text": "The administration's love letter to unions  —  A new Treasury Department report found unions help to raise wages and benefits for workers and can lead to positive economic “spillover effects.”  —  Treasury Secretary Janet Yellen described her agency's report Monday as “the administration's latest action … ",
    "url": "https://thehill.com/newsletters/business-economy/4175613-the-administrations-love-letter-to-unions/"
  },
  {
    "text": "OAN Staffers ‘Embarrassed’ by Host's Cringey MAGA Rap Video  —  ‘BIZARRE’ … That cringe-inducing pro-Trump rap video starring multiple One America News hosts has left staffers at the little-watched cable outlet deeply embarrassed, multiple sources told Confider.",
    "url": "https://www.thedailybeast.com/oan-staffers-embarrassed-by-hosts-cringey-maga-rap-video"
  },
  {
    "text": "Biden is ‘old,’ Trump is ‘corrupt’: AP-NORC poll has ominous signs for both in possible 2024 rematch  —  WASHINGTON (AP) — Old.  Confused.  Corrupt.  Dishonest.  —  Those are among the top terms Americans use when they're asked to describe President Joe Biden and former President Donald Trump … ",
    "url": "https://apnews.com/article/biden-trump-2024-poll-old-corrupt-12b806876e2072790f9a67793761c688"
  }
]