[
  {
    "text": "Estimated Budgetary Effects of H.R. 1, the One Big Beautiful Bill Act  —  As passed by the House of Representatives on May 22, 2025  —  Estimated budgetary effects of H.R. 1, the One Big Beautiful Bill Act, as passed by the House of Representatives on May 22, 2025.",
    "url": "https://www.cbo.gov/publication/61461"
  },
  {
    "text": "After Muscling Their Bill Through the House, Some Republicans Have Regrets  —  The sprawling legislation carrying President Trump's domestic agenda squeaked through the House with one vote to spare, but some Republicans now say they didn't realize what they voted for.",
    "url": "https://www.nytimes.com/2025/06/03/us/politics/house-republicans-policy-bill-regrets.html?unlocked_article_code=1.MU8.tMWQ.omif1j6IpCdO&smid=url-share"
  },
  {
    "text": "House GOP gets megabill's official price tag: $2.4T  —  The numbers will influence what Republicans are able to include in the final package they hope to clear for President Donald Trump's signature this summer.  —  Congress' nonpartisan scorekeeper released its full score Wednesday of the tax … ",
    "url": "https://www.politico.com/news/2025/06/04/house-gop-gets-megabills-official-price-tag-2-4t-00384596"
  },
  {
    "text": "GOP bill for Trump's agenda would add $2.4 trillion to the debt, budget office says  —  The nonpartisan Congressional Budget Office found that the House-passed package would decrease revenue by $3.7 trillion and cut spending by $1.3 trillion over 10 years.  —  WASHINGTON — The sweeping Republican bill … ",
    "url": "https://www.nbcnews.com/politics/congress/gop-bill-trumps-agenda-add-24-trillion-debt-budget-office-says-rcna210749"
  },
  {
    "text": "Hegseth Orders Navy to Strip Name of Gay Rights Icon Harvey Milk from Ship  —  Defense Secretary Pete Hegseth has ordered the Navy to take the rare step of renaming a ship, one that bears the name of a gay rights icon, documents and sources show.  —  Military.com reviewed a memorandum … ",
    "url": "https://www.military.com/daily-news/2025/06/03/hegseth-orders-navy-strip-name-of-gay-rights-icon-harvey-milk-ship.html"
  },
  {
    "text": "Higher Tariffs on Steel and Aluminum Imports Go Into Effect  —  The president has ratcheted up the rate on foreign metals to 50 percent, double the previous rate, saying the levies weren't high enough to help the U.S. industry.  —  U.S. tariffs on steel and aluminum imports doubled on Wednesday … ",
    "url": "https://www.nytimes.com/2025/06/04/business/economy/trump-tariffs-steel-aluminum.html"
  },
  {
    "text": "A sweeping new ICE operation shows how Trump's focus on immigration is reshaping federal law enforcement  —  Members of other agencies are getting detailed to assist ICE, while Justice Department personnel shift to immigration-focused teams and prioritize immigration-related cases.",
    "url": "https://www.nbcnews.com/politics/justice-department/ice-operation-trump-focus-immigration-reshape-federal-law-enforcement-rcna193494"
  },
  {
    "text": "Trump officials delayed farm trade report over deficit forecast  —  Administration officials blocked publication of written analysis that normally accompanies the report because they disliked what it said about the deficit.  —  Trump administration officials delayed and redacted … ",
    "url": "https://www.politico.com/news/2025/06/04/trump-officials-farm-product-trade-deficit-forecast-00382549"
  },
  {
    "text": "What's next for the Iowan who shouted ‘people will die’ at Joni Ernst over Medicaid cuts  — India May, a 33-year-old Democrat from Charles City, is running for the Iowa House after sparking a viral moment at U.S. Sen. Joni Ernst's town hall.  — May interrupted Ernst's answer on Medicaid cuts to shout, “people will die!”",
    "url": "https://eu.desmoinesregister.com/story/news/politics/2025/06/04/meet-india-may-whose-shout-evoked-iowa-senator-joni-ernst-viral-medicaid-comment/83994580007/"
  },
  {
    "text": "CMS Statement on Emergency Medical Treatment and Labor Act (EMTALA)  —  The Department of Health and Human Services and Centers for Medicare & Medicaid Services (\"CMS\") are rescinding July 2022 guidance from CMS with the subject “Reinforcement of EMTALA Obligations specific to Patients … ",
    "url": "https://www.cms.gov/newsroom/press-releases/cms-statement-emergency-medical-treatment-and-labor-act-emtala"
  },
  {
    "text": "Publicly announced cancellations  —  N.I.H. grants, awarded in a competitive process, are typically paid out in installments.  A researcher with a $1 million four-year grant, for instance, will get about $250,000 a year.  Scientists can use this money to buy equipment and supplies and to pay … ",
    "url": "https://www.nytimes.com/interactive/2025/06/04/health/trump-cuts-nih-grants-research.html?unlocked_article_code=1.MU8.fooD.09Zw0Ce5H7UE&smid=nytcore-ios-share&referringSource=articleShare&sgrp=g"
  },
  {
    "text": "Florida higher ed board stuns UF, blocks Santa Ono from becoming president  —  In a stunning move, the board that oversees Florida's higher education system voted against the confirmation of Dr. Santa Ono, formerly president of the University of Michigan, as the University of Florida's 14th president.",
    "url": "https://eu.gainesville.com/story/news/education/2025/06/03/board-of-governors-rejects-santa-ono-as-university-of-florida-president/84007003007/"
  },
  {
    "text": "FBI discovers cache of guns, armor and Nazi paraphernalia while raiding home in Washington state  —  Law enforcement discovered a cache of weaponry and armor, including a machine gun and grenade launchers, along with Nazi paraphernalia during a raid of a home in Washington state, authorities said Tuesday.",
    "url": "https://apnews.com/article/nazi-white-supremacist-guns-fbi-washington-2246cf68af02d592d192a9b52d8941e3"
  },
  {
    "text": "‘Big Balls’ Is Officially a Full-Time Government Employee  —  The first wave of DOGE staffers was supposed to be gone after 130 days.  Instead, core members of the team have signed on for the long haul.  —  Although Elon Musk has said that he is largely exiting his role at the so-called Department … ",
    "url": "https://www.wired.com/story/big-balls-young-doge-converted-into-full-time-government-employees/"
  },
  {
    "text": "The New York Times Is About to Do More Damage to Trans People  —  The paper's six-part podcast “The Protocol” looks to continue a pattern of coverage so problematic that over 1,200 of its own contributors have criticized it.  —  ∙ Paid  —  The New York Times has announced that … ",
    "url": "https://www.readtpa.com/p/the-new-york-times-is-about-to-do"
  },
  {
    "text": "Laura Loomer's White House access erases the line between the fringe and mainstream  —  In a normal White House, right-wing activists like Loomer wouldn't have access.  But that's not Donald Trump's White House.  —  Amid speculation that people close to Donald Trump have grown weary … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/laura-loomers-white-house-access-erases-line-fringe-mainstream-rcna210863"
  },
  {
    "text": "Democrats set out to study young men.  Here are their findings.  —  A widely mocked project to get under the hood about why Democrats are losing young men has sobering results.  —  The Democrats trying to understand young American men know people are roasting their plan.",
    "url": "https://www.politico.com/news/2025/06/03/democrats-young-men-study-00384370"
  },
  {
    "text": "Internal Docs Raise Questions About Trump IRS Pick Billy Long's ‘No-Show Jobs’ And ‘Strange’ Schedule Inside A Powerful Agency  —  It's not quite clear what is happening with former Missouri Congressman Billy Long and his associates at the federal Office of Personnel Management … ",
    "url": "https://talkingpointsmemo.com/news/billy-long-office-of-personnel-management-irs"
  },
  {
    "text": "The fascinating backstory behind a bizarre State Department Substack post  —  How a Catholic theocrat started speaking for Trump's State Department. … Last week, the State Department published a strikingly radical screed on its official Substack.  Titled “The Need for Civilizational Allies in Europe … ",
    "url": "https://www.vox.com/on-the-right-newsletter/415360/state-department-substack-samuel-samson-adrian-vermeule-integralism"
  },
  {
    "text": "Trump's Bedminster Golf Club Flagged For 18 Health Violations In Latest Inspection—Earned Lowest Grade In County  —  Topline  —  One of President Donald Trump's New Jersey golf clubs received a 32 out of 100 health inspection score in May, the lowest grade in Somerset County … ",
    "url": "https://www.forbes.com/sites/zacheverson/2025/06/04/trump-health-inspection-violations-golf-club-bedminster/"
  },
  {
    "text": "FBI sent anti-Catholic memo to over 1,000 employees, new records show  —  The FBI circulated an anti-Catholic intelligence memo to more than 1,000 employees nationwide during the Biden administration — a much broader internal reach than what former FBI Director Christopher Wray acknowledged … ",
    "url": "https://www.washingtonexaminer.com/news/3430094/fbi-anti-catholic-memo-sent-to-over-1000-employees-new-records-show/"
  },
  {
    "text": "(News Focus) Hard-bitten and pragmatic, Lee stages ultimate comeback with presidential election win  —  Lee Haye-ah  —  President-elect Lee Jae-myung has been known to be a fighter, overcoming crisis after crisis in both his professional and personal lives while appearing cool and focused … ",
    "url": "https://en.yna.co.kr/view/AEN20250602004300315"
  },
  {
    "text": "Donald Trump and the art of the Oval Office confrontation  —  Leaders watch as Trump upends the traditional Oval Office visit, worrying they could be next.  “This is the Trump show,” a senior White House official said.  —  Ukrainian President Volodymyr Zelensky was the first to see his Oval Office meeting … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/04/donald-trump-oval-office-ambush/"
  },
  {
    "text": "US immigration officers ordered to arrest more people even without warrants  —  Exclusive: Ice officers told to get ‘creative’ with arrests, including of undocumented people encountered by chance  —  Senior US immigration officials over the weekend instructed rank-and-file officers to … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/04/immigration-officials-increased-detentions-collateral-arrests"
  }
]