[
  {
    "text": "CNN Poll: Haley trims Trump's lead to single digits in New Hampshire  —  Former South Carolina Gov. Nikki Haley has trimmed former President Donald Trump's lead in the Republican primary race in New Hampshire to single digits, according to a new CNN Poll conducted by the University of New Hampshire.",
    "url": "https://www.cnn.com/2024/01/09/politics/cnn-new-hampshire-poll/"
  },
  {
    "text": "Trump's Claim of Immunity Reaches Appeals Court  —  Judges Seem Skeptical of Trump's Claim of Immunity  —  Judges heard from a lawyer for Donald J. Trump who argued that a president could face criminal charges only if impeached and convicted first, even if the case involved the assassination of a political rival.",
    "url": "https://www.nytimes.com/live/2024/01/09/us/trump-immunity-hearing"
  },
  {
    "text": "5 ways the Supreme Court may try to defuse its newest Trump bomb  —  As the justices confront a historic case with enormous political stakes, they might seek a narrow way out.  —  After years of dodging Donald Trump-related questions, the Supreme Court is now facing the most consequential one of all … ",
    "url": "https://www.politico.com/news/2024/01/08/trump-supreme-court-ballot-insurrection-offramps-00134364"
  },
  {
    "text": "1/9/2024 ☀️ Punchbowl News AM … Former President Donald Trump is on the path to the GOP presidential nomination.  Speaker Mike Johnson is in an increasingly perilous position with his right flank.  —  Does it sound like Congress is going to approve a border security and immigration deal?",
    "url": "https://punchbowl.news/archive/192024-punchbowl-news-am-2/"
  },
  {
    "text": "BREAKING: Filing alleges ‘improper’ relationship between Fulton DA, top Trump prosecutor  —  Fani Willis hired alleged romantic partner as special prosecutor, court motion says  —  District Attorney Fani Willis improperly hired an alleged romantic partner to prosecute Donald Trump … ",
    "url": "https://www.ajc.com/politics/breaking-filing-alleges-improper-relationship-between-fulton-da-top-trump-prosecutor/A2N2OWCM7FFWJBQH2ORAK2BKMQ/"
  },
  {
    "text": "Roger Stone Plotted Assassinating Democrats, Bombshell Report Says  —  Explosive new audio of Roger Stone reveals the longtime Trump ally was trying to plot the assassinations of two outspoken Democratic congressmen.  —  A few weeks before the 2020 election, Stone told a member … ",
    "url": "https://newrepublic.com/post/177935/roger-stone-audio-assasinate-democrats-swalwell-nadler"
  },
  {
    "text": "Trump doubles down after DC hearing: 'Most people agree that we're entitled to immunity' - live  —  If the judges rule in favor of Trump, it could lead to the dropping of the criminal charges brought by special counsel Jack Smith  —  Trump: 'Most people agree that we're entitled ... to immunity'",
    "url": "https://www.theguardian.com/us-news/live/2024/jan/09/trump-immunity-hearing-jan-6-case-dc-politics-latest-updates"
  },
  {
    "text": "5th Circuit announces takeover of Department of Energy  —  Here we go again:  —  As silly as the finding of standing is, the 5th Circuit's position on the merits that any regulation issued by a Democratic administration is “arbitrary and capricious” is even worse!",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/01/5th-circuit-announces-takeover-of-department-of-energy"
  },
  {
    "text": "Judge Judy endorses Nikki Haley in 2024 presidential election  —  Famed television court personality “Judge” Judy Sheindlin endorsed 2024 presidential hopeful Nikki Haley in the GOP primary Monday, calling the former South Carolina governor “whip smart.”  —  “She is principled … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/09/judge-judy-endorses-nikki-haley-2024-presidential-election/72161100007/"
  },
  {
    "text": "The fleecing of America's hourly workers  —  More than 200,000 workers across the country are owed $163.3 million in back pay, according to a website maintained by the Department of Labor (DOL).  This is money companies have paid after they were found liable for wage theft violations … ",
    "url": "https://popular.info/p/the-fleecing-of-americas-hourly-workers"
  },
  {
    "text": "Wenstrup Releases Statement Following Day 1 of Dr. Fauci's Testimony  —  WASHINGTON — Select Subcommittee on the Coronavirus Pandemic Chairman Brad Wenstrup (R-Ohio) issued the following statement after day one of Dr. Anthony Fauci's two-day, 14-hour transcribed interview:",
    "url": "https://oversight.house.gov/release/wenstrup-releases-statement-following-first-day-of-dr-faucis-testimony/"
  },
  {
    "text": "Israel has a long track record of assassinating its enemies.  Will it work against Hamas?  —  Previous “targeted killing” campaigns against Hamas' leadership failed to inflict permanent damage on the group and had unintended consequences.  —  Last week, the head of Israel's Mossad intelligence agency issued … ",
    "url": "https://www.nbcnews.com/news/world/israel-mossad-assassinates-enemies-munich-olympics-hamas-rcna132908"
  },
  {
    "text": "Sprawling storm wallops US with tornado reports, damage and heavy snow, closing roads and schools  —  Winter weather may dampen turnout for 2024 Iowa caucuses  —  A sprawling winter storm hit the South with strong thunderstorms and tornado warnings that blew roofs off homes and tossed … ",
    "url": "https://apnews.com/article/midwest-snowstorm-effects-linger-tuesday-1e8f125fa357c014c6761acddb00cae0"
  },
  {
    "text": "Progressives MIA in San Francisco mayor's race  —  THE BUZZ: MOD-ON-MOD FIGHT — Progressives apparently don't want to run the most liberal major city in America.  —  The emerging field in the 2024 San Francisco mayor's race includes an incumbent and two well-known challengers all campaigning … ",
    "url": "https://www.politico.com/newsletters/california-playbook/2024/01/09/progressives-mia-in-san-francisco-mayors-race-00134451"
  },
  {
    "text": "Georgia court weighs voting machines at heart of Trump election fraud claims  —  A Georgia trial will cast a spotlight on the security of the state's voting machines, which have long come under attack by the former president and his allies.  —  A federal court will begin hearing arguments Tuesday … ",
    "url": "https://www.politico.com/news/2024/01/09/georgia-court-voting-machines-trump-election-fraud-00134420"
  },
  {
    "text": "Chaos on the borders, but rising immigration is driving California's population and labor force growth  —  Even as busloads of migrants sent north by border-state officials have strained cities and stirred new political firestorms in Washington, fresh data are driving home the increasingly crucial role … ",
    "url": "https://www.latimes.com/business/story/2024-01-09/california-immigration-driving-population-labor-force-growth"
  },
  {
    "text": "Aiming to retake House, DCCC invests $35 million to mobilize voters of color  —  The Democratic Congressional Campaign Committee will invest millions of dollars in an initiative that aims to engage with and persuade voters of color to support Democratic candidates as part of its effort to take back the House majority in November.",
    "url": "https://www.washingtonpost.com/politics/2024/01/09/dccc-minority-voters-initiative/"
  }
]