[
  {
    "text": "Salvadoran president says he won't return wrongly deported man to U.S.  —  Salvadoran President Nayib Bukele said Monday that he did not plan to return to Kilmar Abrego García to the United States.  “How can I return him to the United States?”  Bukele asked Monday during a meeting with President Donald Trump in the Oval Office.",
    "url": "https://www.washingtonpost.com/politics/2025/04/14/trump-presidency-news-tariffs-deportations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0NjAzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1OTg1NTk5LCJpYXQiOjE3NDQ2MDMyMDAsImp0aSI6IjRmM2RjYWMwLTNhMGYtNGE3Yy1iNDQ4LTkyYWIxYWUzMGQ4MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzE0L3RydW1wLXByZXNpZGVuY3ktbmV3cy10YXJpZmZzLWRlcG9ydGF0aW9ucy8ifQ.hZb2Ub_MMIgoinvra0B8PoWuSGkoBStMCaevwUm9cpE&itid=gfta"
  },
  {
    "text": "The Trump Administration Is Sticking to Its Gulag Plan in Defiance of the Supreme Court  —  The Trump administration escalated its defiance of federal court orders over the weekend, adamantly refusing to reverse its illegal deportation of a Maryland father, Kilmar Abrego Garcia, to an El Salvador prison.",
    "url": "https://slate.com/news-and-politics/2025/04/trump-defying-supreme-court-el-salvador-bukele.html"
  },
  {
    "text": "Bukele's Offense Against the American People  —  Here's how I look at today's White House spectacle.  —  I don't really care what these two men say.  The only next step I'm focused on is the one that now faces the Supreme Court.  The White House is now brazenly ignoring the crystal clear import … ",
    "url": "https://talkingpointsmemo.com/edblog/bukeles-offense-against-the-american-people"
  },
  {
    "text": "Harvard Will Fight Trump's Demands  —  Harvard will not comply with the Trump administration's demands to dismantle its diversity programming and limit student protests in exchange for its federal funding, University President Alan M. Garber '76 announced in a message to affiliates Monday afternoon.",
    "url": "https://www.thecrimson.com/article/2025/4/15/harvard-denies-trump-demands/"
  },
  {
    "text": "Harvard Says It Will Not Comply With Trump Administration's Demands  —  Federal officials said Harvard must enact “merit-based reform” in hiring and admissions, among other things.  Harvard called the demands unlawful.  —  Harvard University said on Monday that it had rejected policy changes requested … ",
    "url": "https://www.nytimes.com/2025/04/14/us/harvard-trump-reject-demands.html"
  },
  {
    "text": "Harvard rejects Trump administration's demands with federal funding at risk  —  The university's response comes after the government announced a federal review of nearly $9 billion in funding to Harvard and its affiliates.  —  With billions of dollars in federal funding at risk … ",
    "url": "https://www.washingtonpost.com/education/2025/04/14/harvard-rejects-trump-administration-demands/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0NjAzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1OTg1NTk5LCJpYXQiOjE3NDQ2MDMyMDAsImp0aSI6IjcyZjRmMzcxLWE3MGYtNGVlNC1iOGQ4LTM3YTBkY2ExMGRiYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lZHVjYXRpb24vMjAyNS8wNC8xNC9oYXJ2YXJkLXJlamVjdHMtdHJ1bXAtYWRtaW5pc3RyYXRpb24tZGVtYW5kcy8ifQ.4tnnKPBmyPcT2LmVsUPYy_LuwArdGP0zRi6-CxGr2u8&itid=gfta"
  },
  {
    "text": "The Promise of American Higher Education  —  For three-quarters of a century, the federal government has awarded grants and contracts to Harvard and other universities to help pay for work that, along with investments by the universities themselves, has led to groundbreaking innovations across … ",
    "url": "https://www.harvard.edu/president/news/2025/the-promise-of-american-higher-education/"
  },
  {
    "text": "Despite a court order, White House bars AP from Oval Office event  —  Despite a court order, a reporter and photographer from The Associated Press were barred from an Oval Office news conference on Monday with President Donald Trump and his counterpart from El Salvador, Nayib Bukele.",
    "url": "https://apnews.com/article/trump-ap-press-freedom-court-gulf-caffd32aa8ec6b04a50b8c5277d7c9cb"
  },
  {
    "text": "AP says journalists blocked from Oval Office after judge's order  —  The Associated Press on Monday said its journalists were barred from covering an Oval Office event featuring President Trump and El Salvador President Nayib Bukele in defiance of a court injunction.",
    "url": "https://thehill.com/homenews/media/5248116-ap-blocked-white-house/"
  },
  {
    "text": "Palestinian Student Leader Was Called In for Citizenship Interview — Then Arrested by ICE  —  Mohsen K. Mahdawi arrived at the U.S. Citizenship and Immigration Services office in Colchester, Vermont, on Monday.  A Palestinian student at Columbia University, he hoped that, after 10 years in the U.S. … ",
    "url": "https://theintercept.com/2025/04/14/ice-columbia-student-mohsen-mahdawi-citizenship-interview/"
  },
  {
    "text": "Suspect in arson at Pennsylvania Gov. Josh Shapiro's residence being treated at hospital, police say  —  A man who authorities said scaled an iron security fence in the middle of the night, eluded police and broke into the Pennsylvania governor's mansion where he set a fire is in police custody … ",
    "url": "https://apnews.com/article/josh-shapiro-arson-charges-pennsylvania-governor-c3ccfc0f23a40f2b10bd6ba767d53f80"
  },
  {
    "text": "President Trump says CBS and ‘60 Minutes’ should ‘pay a big price’ for going after him  —  President Donald Trump bitterly attacked “60 Minutes” shortly after the CBS newsmagazine broadcast stories on Ukraine and Greenland on Sunday, saying the network was out of control and should “pay a big price” for going after him.",
    "url": "https://apnews.com/article/trump-cbs-60-minutes-2c8a32df63f3ec50cfffe94a26436fda"
  },
  {
    "text": "Trump plan would slash State Dept. funding by nearly half, memo says  —  An internal document reviewed by The Post targets spending on humanitarian assistance, global health and international organizations such as the U.N. and NATO.  —  Just now  —  The Trump administration proposed to cut … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/14/state-department-budget-cuts-trump-rubio/"
  },
  {
    "text": "Ex-January 6 prosecutors urge attorney disciplinary board to investigate Trump's controversial pick to be DC's top prosecutor  —  Five former prosecutors who worked on criminal cases stemming from the January 6, 2021, attack on the US Capitol are urging the disciplinary office governing lawyers in Washington … ",
    "url": "https://cnn.com/2025/04/14/politics/ed-martin-us-attorney-dc-board-letter/"
  },
  {
    "text": "EU issues US-bound staff with burner phones over spying fears  —  European Commission officials heading to IMF and World Bank spring meetings advised to travel with basic devices  —  The European Commission is issuing burner phones and basic laptops to some US-bound staff to avoid the risk of espionage … ",
    "url": "https://www.ft.com/content/20d0678a-41b2-468d-ac10-14ce1eae357b?accessToken=zwAGMryv_5T4kc8g0GeKQbJGjdOsEBTOHq41ew.MEUCIDsa22gKDazrF-bvCFniVoHyrP8AEz8pt-tH2OBtTURiAiEAmYeeAJ9PAelTe6CxpbpVv2h16BrbmAq6X6bBn1vB4Eo&sharetype=gift&token=65748ec0-30cc-4991-bc81-f10c9dd23dcd"
  },
  {
    "text": "Trump Just Defied the Supreme Court.  What Is John Roberts Going to Do About It?  —  Is he scared, deluded, or clever?  —  ∙ Paid  —  Quick note: Tomorrow I'll be doing a Substack Live with Paul Krugman at 12:30 p.m. Eastern.  It'll be here.  —  JVL + Krugman.  Tuesday.  12:30.",
    "url": "https://www.thebulwark.com/p/what-is-john-roberts-thinking"
  },
  {
    "text": "White House readies plan for Congress to ax ‘all’ public broadcasting funds, codify DOGE aid cuts  —  WASHINGTON — The White House has begun to notify Congress of a request to eliminate “all” public broadcasting funding and codify foreign-aid cuts identified by Elon Musk's Department of Government Efficiency, The Post has learned.",
    "url": "https://nypost.com/2025/04/14/us-news/white-house-sends-congress-plan-to-ax-all-public-broadcasting-funds-and-codify-doge-aid-cuts/"
  },
  {
    "text": "HHS Systems Are in Danger of Collapsing, Workers Say  —  The purging of IT and cybersecurity staff at the Department of Health and Human Services could threaten the systems used by the agency's staff and the safety of critical health data.  —  Much of the IT and cybersecurity infrastructure underpinning … ",
    "url": "https://www.wired.com/story/department-health-human-services-possible-collapse/"
  },
  {
    "text": "Kleptocracy, Inc.  —  Under Trump, conflicts of interest are just part of the system.  —  as the stock markets crashed on Friday, April 4, Donald Trump left Washington, D.C. He did not go to New York to consult with Wall Street.  He did not go to Dover, Delaware, to receive the bodies … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/04/trump-kleptocracy-autocracy-inc/682281/?gift=hVZeG3M9DnxL4CekrWGK34ayvhDI7RVUDRSgLkNluMk&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump's $1 Billion Law Firm Deals Are the Work of His Personal Lawyer  —  Boris Epshteyn, who doesn't work for the government, has negotiated with a series of law firms to cajole them into entering deals  —  President Trump has reached around $1 billion in deals with the country's top law firms … ",
    "url": "https://www.wsj.com/us-news/law/trumps-1-billion-law-firm-deals-are-the-work-of-his-personal-lawyer-77bd7b8c?st=jMX5Kp&reflink=mobilewebshare_permalink"
  },
  {
    "text": "North Carolina Republicans might just get away with stealing an election  —  If Republicans get away with all of it, this will be a stain on American democracy that will challenge the legitimacy of our elections for generations to come.  —  Well, it's probably happening.",
    "url": "https://www.usatoday.com/story/opinion/columnist/2025/04/14/nc-supreme-court-race-votes-griffin-republicans/83010571007/"
  }
]