[
  {
    "text": "Federal Inquiry Traced Payments From Gaetz to Women  —  A document prepared by federal investigators bolsters claims by women who say they were hired for sex by Matt Gaetz, President-elect Donald J. Trump's choice for attorney general, who denies wrongdoing.",
    "url": "https://www.nytimes.com/2024/11/20/us/politics/matt-gaetz-venmo-payments-sex.html?unlocked_article_code=1.bU4.7Vtf.lA2L36DCJRKv&smid=url-share"
  },
  {
    "text": "House Ethics panel does not agree to release the Gaetz report  —  The House Ethics Committee on Wednesday did not agree to release the long-anticipated report into Matt Gaetz.  “There was not an agreement by the committee to release the report,” Chair Michael Guest (R-Miss.) told reporters after the meeting ended.",
    "url": "https://www.politico.com/live-updates/2024/11/20/congress/ethics-panel-does-not-agree-to-release-gaetz-report-00190655"
  },
  {
    "text": "Republicans on House Ethics reject for now releasing report on Matt Gaetz  —  House Ethics Committee Republicans voted Wednesday against releasing the panel's long-running investigation into President-elect Donald Trump's nominee for attorney general, former Rep. Matt Gaetz, the top Democrat on the panel said.",
    "url": "https://apnews.com/article/gaetz-trump-attorney-general-sexual-misconduct-5f9c684bb695df143beffbf8f956b09c"
  },
  {
    "text": "Trump rages as absent Senate Republicans help confirm Biden judges … - Trump posted Wednesday on “X”: “The Democrats are trying to stack the Courts with Radical Left Judges on their way out the door. … Democrats confirmed two more judges on Wednesday by 50-48 margins, with Republican Sens. Ted Cruz … ",
    "url": "https://www.axios.com/2024/11/20/trump-senate-judges-confirmations"
  },
  {
    "text": "Elon Musk and Vivek Ramaswamy: The DOGE Plan to Reform Government  —  Following the Supreme Court's guidance, we'll reverse a decadeslong executive power grab.  —  Our nation was founded on the basic idea that the people we elect run the government.  That isn't how America functions today.",
    "url": "https://www.wsj.com/opinion/musk-and-ramaswamy-the-doge-plan-to-reform-government-supreme-court-guidance-end-executive-power-grab-fa51c020?st=9M7A13&reflink=article_imessage_share"
  },
  {
    "text": "Musk, Ramaswamy lay out plans for ‘mass’ federal layoffs, rule rollbacks under Trump  —  Tech entrepreneurs Elon Musk and Vivek Ramaswamy said Wednesday that their brand-new government efficiency panel will identify “thousands” of regulations for President-elect Trump to eliminate … ",
    "url": "https://thehill.com/policy/technology/5000448-elon-musk-vivek-ramaswamy-government-efficiency/"
  },
  {
    "text": "Linda McMahon's background as Trump's pick for education secretary  —  Her nomination has come under scrutiny this week.  —  Linda McMahon speaks during the last day of the 2024 Republican National Convention at the Fiserv Forum in Milwaukee, Wisconsin, on July 18, 2024.",
    "url": "https://abcnews.go.com/Politics/linda-mcmahons-background-trumps-pick-education-secretary/story?id=116058197"
  },
  {
    "text": "MSNBC Faces Potential for Big Changes in Comcast Cable Spin-Off  —  MSNBC fans who are disappointed in the progressive-leaning network after Donald Trump's victory in the 2024 election may no longer have it to kick around.  —  The cable-news outlet could have to consider changing its name … ",
    "url": "https://variety.com/2024/tv/news/msnbc-faces-big-changes-comcast-cable-spin-off-rachel-maddow-mark-lazarus-1236215502/"
  },
  {
    "text": "Speaker Johnson announces policy barring trans women from Capitol bathrooms  —  Speaker Mike Johnson (R-La.) announced on Wednesday that transgender women are not permitted to use bathrooms in the Capitol that match their gender identity, taking a stance on the hot-button issue that has overtaken the Capitol in recent days.",
    "url": "https://thehill.com/homenews/house/5000006-speaker-johnson-transgender-bathroom-policy/"
  },
  {
    "text": "Trump taps Russ Vought, one of the authors of Project 2025, to lead budget office again  —  President-elect Donald Trump is expected to name Russ Vought to lead the Office of Management and budget, according to two sources close to the transition.  —  If confirmed, this will be Vought's second time in the role.",
    "url": "https://www.cbsnews.com/news/trump-russ-vought-office-of-management-budget/"
  },
  {
    "text": "Republicans in North Carolina pass sweeping changes to consolidate power  —  The last-minute inclusions in a lame-duck bill will strip the incoming Democratic governor and attorney general of significant authority before the GOP loses its legislative supermajority.",
    "url": "https://www.washingtonpost.com/politics/2024/11/20/north-carolina-legislature-governor-elections/"
  },
  {
    "text": "The Technology the Trump Administration Could Use to Hack Your Phone  —  Other Western democracies have been roiled by the use of spyware to target political opponents, activists, journalists, and other vulnerable groups.  Could it happen here?  —  In September, the Department of Homeland Security … ",
    "url": "https://www.newyorker.com/news/news-desk/the-technology-the-trump-administration-could-use-to-hack-your-phone"
  },
  {
    "text": "Merkel eviscerates ‘emotional’ Trump in upcoming memoir  —  European politicians preparing for United States President-elect Donald Trump's second term in the White House have so far made a point of not saying anything that could upset him.  —  But Angela Merkel, who was Germany's chancellor for 16 years … ",
    "url": "https://www.politico.eu/article/angela-merkel-donald-trumo-memoir-book-us-germany-politics-cdu-pope-francis/"
  },
  {
    "text": "Mandate?  Fuller election results increasingly show GOP gains were small.  —  A holistic look — down to the state legislative level — reinforces the fact that early Trump and GOP claims to a huge “mandate” were overblown.  —  From the moment he claimed victory in the 2024 presidential election … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/20/mandate-fuller-election-results-increasingly-show-gop-gains-were-small/"
  },
  {
    "text": "MASCOT Update - U.S. Embassy Kyiv, Ukraine  —  Message for U.S. Citizens in Ukraine  —  Security Alert: U.S. Embassy Kyiv, Ukraine (November 20, 2024)  —  Event: The U.S. Embassy in Kyiv has received specific information of a potential significant air attack on November 20.",
    "url": "https://ua.usembassy.gov/mascot-update-u-s-embassy-kyiv-ukraine/"
  },
  {
    "text": "WATCH: Dem Rep. Jasmine Crockett Goes Nuts During Hearing, Starts Shouting About the ‘White Man’  —  The House of Representatives is becoming more of an insane asylum every day, and Rep. Jasmine Crockett is the perfect example of that.  During a hearing on Wednesday, the Texas congresswoman went nuts … ",
    "url": "https://redstate.com/bonchie/2024/11/20/watch-dem-rep-jasmine-crockett-goes-nuts-during-hearing-starts-shouting-about-the-white-man-n2182253"
  },
  {
    "text": "Trump Tells Republicans to ‘Kill’ Reporter Shield Bill Passed Unanimously by House  —  The bill, known as the PRESS Act, would codify protections against federal investigators seizing reporters' records.  It is now less likely the legislation would clear the Senate before the current session ends.",
    "url": "https://www.nytimes.com/2024/11/20/us/politics/trump-press-act-freedom-reporters.html"
  },
  {
    "text": "Trump eyes right-wing personality Dan Bongino among current and former agents for US Secret Service director  —  Donald Trump is considering a right-wing media personality, people who have served on his US Secret Service detail, as well as others to run the agency that has been plagued … ",
    "url": "https://www.cnn.com/2024/11/20/politics/secret-service-trump-director-discussions/"
  },
  {
    "text": "Judge rules Youngkin administration can't pull Virginia out of greenhouse gas agreement  —  A Virginia court ruled Wednesday that Gov. Glenn Youngkin's (R) administration cannot withdraw from an interstate carbon emission-capping compact without approval from the state Legislature.",
    "url": "https://thehill.com/policy/energy-environment/5000563-glenn-youngkin-withdrawal-greenhouse-gas-agreement-rejected/"
  },
  {
    "text": "Trump nominates former House Republican for US ambassador to Canada  —  President-elect Trump announced Wednesday that he was announcing former Rep. Pete Hoekstra (R-Mich.) to be the U.S. ambassador to Canada.  —  “I am very pleased to announce that former Ambassador, and former Congressman … ",
    "url": "https://thehill.com/homenews/administration/5001400-trump-nominates-former-house-republican-for-us-ambassador-to-canada/"
  },
  {
    "text": "Florida man arrested in alleged plot to bomb New York Stock Exchange  —  FBI agents have arrested a Florida man in connection with an alleged plot to bomb the New York Stock Exchange, according to charging documents unsealed on Wednesday.  —  South Florida resident Harun Abdul-Malik Yener … ",
    "url": "https://www.cbsnews.com/news/fbi-arrest-harun-abdul-malik-yener-alleged-plot-to-bomb-new-york-stock-exchange/"
  },
  {
    "text": "Exclusive: GOP senator demands “extensive” vetting for Trump health appointees … - To her, “that means a background check, it means extensive committee investigations and questionnaires and public hearings,” she told Axios' Peter Sullivan.  — Collins, who called for additional federal funding … ",
    "url": "https://www.axios.com/2024/11/20/collins-trump-health-appointees-extensive-vetting-senate"
  },
  {
    "text": "Trump's cabinet picks are agents of his contempt, rage and vengeance  —  With them, Trump will tear down any person or institution that tried to restrain his worst impulses or hold him accountable  —  “Shock” suddenly became the most commonly uttered word in habitually nonplussed Washington DC.",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/20/trump-cabinet-picks-contempt-rage-vengeance"
  },
  {
    "text": "Supreme Court rejects RFK Jr. group's attempt to protect anti-Covid-vaccine doctors from investigations  —  Justice Elena Kagan turned away an emergency request from Children's Health Defense, the anti-vaccine group founded by Donald Trump's pick for secretary of health and human services.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-rfk-jr-groups-attempt-protect-anti-covid-vaccine-rcna181061"
  }
]