[
  {
    "text": "Don't fall for Trump's new abortion position claims  —  While once again taking credit for the end of Roe v. Wade and the constitutional right to an abortion, Donald Trump nonetheless tried to distance himself on Monday from the most extreme anti-abortion positions of his party in an explicit effort to “win elections.”",
    "url": "https://www.lawdork.com/p/dont-fall-for-trumps-new-abortion-position"
  },
  {
    "text": "What Trump really said about abortion  —  During the 2024 presidential campaign, former President Donald Trump boasted that he would “come together with all groups” on abortion and “negotiate something” that would “make both sides happy.”  According to Trump, the country will … ",
    "url": "https://popular.info/p/what-trump-really-said-about-abortion"
  },
  {
    "text": "Donald Trump asks appeals court to intervene in last-minute bid to delay hush-money criminal case  —  NEW YORK (AP) — Donald Trump asked a New York appeals court on Monday to reverse his gag order and move his hush-money criminal trial out of Manhattan in an eleventh-hour bid for a delay just a week before it is scheduled to start.",
    "url": "https://apnews.com/article/donald-trump-juan-merchan-hush-money-appeal-lawsuit-6abe221a7cb2ea670eb3ed1a7a134643"
  },
  {
    "text": "Appeals Court Denies Another Trump Attempt to Delay Trial  —  Donald J. Trump's lawyers sought to pause his Manhattan criminal trial as they argued that it should be moved, but a judge rejected their appeal.  —  One week before Donald J. Trump is set to go on trial for criminal charges in Manhattan … ",
    "url": "https://www.nytimes.com/2024/04/08/nyregion/trump-hush-money-trial-delay.html"
  },
  {
    "text": "Elon Musk Didn't Want His Latest Deposition Released.  Here It Is.  —  Musk is being sued for falsely suggesting a 22-year-old Jewish man was part of a neo-Nazi brawl.  —  Elon Musk was deposed last month over his role in allegedly promoting a false conspiracy theory that a 22-year-old Jewish man participated in a neo-Nazi brawl.",
    "url": "https://www.huffpost.com/entry/elon-musk-didnt-want-his-latest-deposition-released-here-it-is_n_66133d2ce4b0d81853f9a766"
  },
  {
    "text": "‘Profoundly ahistorical’: 4-star generals side with Jack Smith, tell Supreme Court Trump's immunity claims are ‘assault’ on democracy  —  A distinguished group of retired four-star generals and admirals from the U.S. military have argued in a brief filed in the U.S. Supreme Court on Monday … ",
    "url": "https://lawandcrime.com/high-profile/profoundly-ahistorical-4-star-generals-side-with-jack-smith-tell-supreme-court-trumps-immunity-claims-are-assault-on-democracy/"
  },
  {
    "text": "Sonia Sotomayor's retirement is a political IQ test  —  Are you into politics to win — or to feel good about yourself?  —  Sonia Sotomayor, one of the three remaining liberal Supreme Court justices, will turn 70 years old in June, is diabetic and had one parent who died at a young age.",
    "url": "https://www.natesilver.net/p/sonia-sotomayors-retirement-is-a"
  },
  {
    "text": "Which Trump lies stick?  Republicans believe some falsehoods more than they did six years ago, our poll finds.  —  Fictions, misleading claims, wild exaggerations, lies — former president Donald Trump dispenses untruths of one variant or another relentlessly.",
    "url": "https://www.washingtonpost.com/politics/2024/04/09/some-trump-falsehoods-stick-more-than-others-fact-checker-poll-finds/"
  },
  {
    "text": "Las Vegas attorney kills 2, self in Summerlin law office shooting: sources  —  LAS VEGAS (KLAS) — Three people are dead following a shooting Monday morning in a law office in a building near the Red Rock resort in Summerlin, according to Las Vegas Metropolitan Police Department Sheriff Kevin McMahill.",
    "url": "https://www.8newsnow.com/news/local-news/shooting-at-las-vegas-office-building-in-summerlin/"
  },
  {
    "text": "European court rules human rights violated by climate inaction  —  A group of older Swiss women have won the first ever climate case victory in the European Court of Human Rights.  —  The women, mostly in their 70s, said that their age and gender made them particularly vulnerable to the effects of heatwaves linked to climate change.",
    "url": "https://www.bbc.com/news/science-environment-68768598"
  },
  {
    "text": "How Donald Trump's mug shot became a defiant and divisive 2024 symbol  —  CONWAY, S.C. — After Quinzell Williams stepped out of an Uber near a campaign rally featuring Donald Trump, a passing couple did a double take.  —  “Aren't you embarrassed to be wearing that?” they asked, Williams recalled.",
    "url": "https://www.washingtonpost.com/politics/interactive/2024/mugshot-trump-2024-election-campaign/"
  },
  {
    "text": "“It's Been Soiled”: Trump Bizarrely Suggests Biden Has S—t on Oval Office Desk at Billionaire Fundraiser  —  He also pledged to keep attendees' taxes low and doubled down on his desire to have immigrants from “nice” countries, like Norway and Denmark, come to the US.",
    "url": "https://www.vanityfair.com/news/donald-trump-bizarrely-suggests-biden-has-s-t-on-oval-office-desk"
  },
  {
    "text": "‘Donald Trump did this’: New Biden abortion ad features a woman who says she almost died because of the Texas ban  —  The ad was released hours after Trump said that he believes abortion laws should be left to the states, sidestepping the national ban that some of his supporters want.",
    "url": "https://www.nbcnews.com/politics/2024-election/donald-trump-new-biden-abortion-ad-features-woman-says-almost-died-tex-rcna146869"
  },
  {
    "text": "As Kushner's Investment Firm Steps Out, the Potential Conflicts Are Growing  —  Jared Kushner's Affinity Partners has invested more than $1.2 billion, much of it in firms abroad, drawing new scrutiny as his father-in-law, Donald Trump, again seeks the presidency.",
    "url": "https://www.nytimes.com/2024/04/09/us/politics/jared-kushner-affinity-partners.html"
  },
  {
    "text": "Ted Cruz Is Turning an Allied Super PAC Into a Media Company  —  CRUZ CONTROL  —  Ted Cruz is once again pushing the bounds of campaign finance laws, this time with his super PAC pocketing hundreds of thousands of dollars for his podcast appearances.",
    "url": "https://www.thedailybeast.com/ted-cruz-is-turning-an-allied-super-pac-into-a-media-company"
  },
  {
    "text": "CSIS warned Prime Minister's Office in 2023 that China ‘clandestinely and deceptively’ interfered in elections  —  Top secret document claims at least 11 candidates, 13 staffers were implicated in foreign interference  —  Canada's spy agency believes the Chinese government … ",
    "url": "https://www.cbc.ca/news/politics/pmo-briefing-leaks-1.7167090"
  },
  {
    "text": "Mitch McConnell backs House TikTok bill that could lead to ban  —  Washington — Senate Minority Leader Mitch McConnell on Monday endorsed a bill that could lead to a ban of TikTok in the U.S. after its momentum slowed in the Senate following its whirlwind passage in the House last month.",
    "url": "https://www.cbsnews.com/news/mcconnell-tiktok-ban-senate-house-bill/"
  },
  {
    "text": "Idaho Man Arrested for Attempting to Provide Material Support to ISIS  —  For Immediate Release  —  Alexander Scott Mercurio, 18, of Coeur d'Alene, Idaho, was arrested Saturday, April 6, 2024, in Coeur d'Alene for attempting to provide material support and resources to ISIS.",
    "url": "https://www.justice.gov/opa/pr/idaho-man-arrested-attempting-provide-material-support-isis"
  }
]