[
  {
    "text": "Playbook: Why Biden world has gone quiet on the Trump trial  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE BUZZ OF THE LEGAL WORLD — “2 of Trump's jurors are lawyers.  Would they acquit on a technicality?” by Betsy Woodruff Swan … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/18/why-biden-world-has-gone-quiet-on-the-trump-trial-00152989"
  },
  {
    "text": "Kennedy family to endorse Biden in show of force against RFK Jr. … - With a substantial number of voters telling pollsters they are dissatisfied with both Biden and Trump, Democrats are increasingly petrified that a Kennedy name on the ballot will throw the election to Trump.",
    "url": "https://www.axios.com/2024/04/18/kennedy-family-biden-endorsement-rfk-jr"
  },
  {
    "text": "Biden camp decides not to take the bait on Trump's stormy trial  —  The president and his team plan a judicious approach to the courtroom drama engulfing their opponent.  —  The Biden campaign has a straightforward strategy for navigating former President Donald Trump's time in the courthouse.",
    "url": "https://www.politico.com/news/2024/04/18/bidens-response-trump-democrats-00152940"
  },
  {
    "text": "Conservatives corner Mike Johnson in House floor confrontation … - The House changed its rules this Congress to allow a single member to challenge the speaker's job with a motion to vacate.  — One option being urged by Johnson allies is to change House rules in coming days to force … ",
    "url": "https://www.axios.com/2024/04/18/mike-johnson-gaetz-motion-to-vacate-ukraine"
  },
  {
    "text": "4/18/24 ☀️ Punchbowl News AM … This comes as Johnson faces another uprising from his right.  —  Right now, any member can file a motion to vacate the chair, which triggers a potential snap referendum on the speaker.  This was how hardliners ousted former Speaker Kevin McCarthy in October.",
    "url": "https://punchbowl.news/archive/41824-punchbowl-news-am/"
  },
  {
    "text": "Miscalculation Led to Escalation in Clash Between Israel and Iran  —  Israeli officials say they didn't see a strike on a high-level Iranian target in Syria as a provocation, and did not give Washington a heads-up about it until right before it happened.  —  Israel was mere moments away … ",
    "url": "https://www.nytimes.com/2024/04/17/world/middleeast/iran-israel-attack.html"
  },
  {
    "text": "US and UK impose fresh Iran sanctions in wake of Israel attack  —  Most of the sanctions are linked to Iranian drone production  —  LONDON — The United States and United Kingdom unveiled fresh sanctions in the wake of Iran's attack on Israel.  —  The U.S. Treasury Department announced Thursday … ",
    "url": "https://www.politico.eu/article/us-uk-slap-sanctions-iran-linked-to-israel-attack/"
  },
  {
    "text": "Trump is funneling campaign money into cash-strapped businesses.  Experts say it looks bad.  —  Donald Trump's main 2024 White House campaign fundraising operation sharply increased spending at the former president's properties in recent months, funneling money into his businesses … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/18/trump-campaign-funnels-money-to-his-businesses/73344744007/"
  },
  {
    "text": "GOP makes weak pitch as Senate rejects Mayorkas impeachment articles  —  Republicans are pretending that Democrats set a dangerous precedent by discarding Alejandro Mayorkas' impeachment without a trial.  They have it backwards.  —  More than a month after House Republicans impeached … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/gop-makes-weak-pitch-senate-rejects-mayorkas-impeachment-articles-rcna148343"
  },
  {
    "text": "Complaint Asks the FBI to Probe Trump Claims on a $50 Million Loan  —  GIMME SHELTER  —  A government watchdog group is filing a complaint about a $50 million loan that Trump claimed for years on government disclosure forms but which may have never existed.",
    "url": "https://www.thedailybeast.com/complaint-asks-the-fbi-to-probe-trump-claims-on-a-dollar50-million-loan"
  },
  {
    "text": "Live Updates: One Juror Dismissed as Selection Continues in Trump Trial  —  The third day of Donald J. Trump's criminal trial began with the dismissal of one of the seven jurors who had already been seated.  The former president is accused of falsifying business records to cover up a sex scandal.",
    "url": "https://www.nytimes.com/live/2024/04/18/nyregion/trump-hush-money-trial"
  },
  {
    "text": "Chinese Exports Are Threatening Biden's Industrial Agenda  —  The president is increasingly hitting back with tariffs and other measures meant to restrict imports, raising tensions with Beijing.  —  President Biden's trillion-dollar effort to invigorate American manufacturing and speed … ",
    "url": "https://www.nytimes.com/2024/04/18/us/politics/china-exports-biden-industrial-agenda.html"
  },
  {
    "text": "Rep. Mike Gallagher hints death threats may be behind his early resignation  —  GREEN BAY, Wisc.  (WLUK) — With just days until he leaves his seat in Congress, Rep. Mike Gallagher, R-Wisc., could be shedding some light on the reasoning behind his early resignation",
    "url": "https://nbcmontana.com/news/connect-to-congress/rep-mike-gallagher-hints-young-family-death-threats-may-be-behind-his-early-resignation-house-select-committee-on-the-chinese-communist-party-alejandro-mayorkas-fbi-capitol-police-swatting-family-secret-service-law-enforcement-reporters-fentanyl-china"
  },
  {
    "text": "Biden suggests uncle eaten by ‘cannibals’ in New Guinea — but military says his WWII plane lost at sea  —  President Biden twice implied Wednesday that his uncle Ambrose Finnegan was eaten by cannibals in New Guinea after his plane crashed during World War II — even though military records show … ",
    "url": "https://nypost.com/2024/04/17/us-news/biden-suggests-uncle-eaten-by-cannibals-in-new-guinea-but-military-says-his-wwii-plane-lost-at-sea/"
  },
  {
    "text": "Jawbone of Long Dead U.S. Marine Found in Kid's Rock Collection  —  ‘UNEXPECTED’  —  He was laid to rest at a cemetery in Missouri back in 1951, and there had reportedly never been any inkling that the grave did not contain all of his remains.  —  Capt. Everett Leland Yager of the U.S. Marine Corps … ",
    "url": "https://www.thedailybeast.com/jawbone-of-long-dead-us-marine-found-in-kids-rock-collection"
  },
  {
    "text": "WaPo Gives Bill Barr Platform to Attack Joe Biden without Mentioning Barr's Role in Framing Biden  —  WaPo wrote a story on Bill Barr's statement on Fox News that he would support Trump over Biden because Biden would represent a “continuation of the Biden administration is national suicide.”",
    "url": "https://www.emptywheel.net/2024/04/18/wapo-gives-bill-barr-platform-to-attack-joe-biden-without-mentioning-barrs-role-in-framing-biden/"
  },
  {
    "text": "Kennedy family members will endorse Biden at Philadelphia event  —  The move is a rebuke of Robert F. Kennedy Jr., who is pursing the White House as an independent  —  Several Kennedy family members plan to endorse President Biden for reelection at a campaign event in Philadelphia on Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/18/kennedy-family-members-endorse-biden/"
  },
  {
    "text": "The two-party system isn't the problem  —  See: Netanyahu, Benjamin.  —  ∙ Paid … The US two-party system is a perennial punching bag.  —  “Can the US ever break the two-party binary?”  Al Jazeera asked earlier this year.  “How to fix democracy: Move beyond the two-party system … ",
    "url": "https://www.publicnotice.co/p/two-party-system-isnt-the-problem-israel-england"
  },
  {
    "text": "‘Banned in the USA’  —  America's right-wing forces would have you believe that they are the courageous entities standing up for free speech.  —  But, as they try to claim that mantle, many of those same forces in media and politics are behind a disturbing wave of book bans sweeping the nation.",
    "url": "https://view.newsletters.cnn.com/messages/1713313853316c053e6206eed/raw"
  },
  {
    "text": "Raskin: Greene ‘recycling direct Russian propaganda’  —  Rep. Jamie Raskin (D-Md.) said on Wednesday that Rep. Marjorie Taylor Greene (R-Ga.) is “recycling” Russian propaganda in falsely saying Ukraine is a Nazi state.  —  In an interview on MSNBC's “The Reid Out,” Raskin noted concerns … ",
    "url": "https://thehill.com/homenews/house/4602186-raskin-greene-recycling-direct-russian-propaganda/"
  },
  {
    "text": "Plastics industry heats world four times as much as air travel, report finds  —  Pollution from the plastics industry is a major force behind the heating of the planet, according to a new report from the federal government.  —  The industry releases about four times as many planet-warming chemicals … ",
    "url": "https://thehill.com/policy/energy-environment/4601309-plastics-industry-heats-world-four-times-as-much-as-air-travel-report-finds/"
  },
  {
    "text": "Senate nominee bankrolled by far-right activist trashing MLK and the Civil Rights Act  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  Last month, Bernie Moreno won the Republican nomination for U.S. Senate in Ohio.  Moreno benefited from an early endorsement from Turning Point Action … ",
    "url": "https://popular.info/p/senate-nominee-bankrolled-by-far"
  },
  {
    "text": "Pelosi memoir ‘The Art of Power’ planned for August release  —  A new memoir penned by former House Speaker Nancy Pelosi (D-Calif.) will be available later this year, according to publisher Simon & Schuster.  —  In the book, titled “The Art of Power,” Pelosi details her years in public service … ",
    "url": "https://thehill.com/blogs/in-the-know/4602454-pelosi-memoir-the-art-of-power-planned-for-august-release/"
  }
]