[
  {
    "text": "Fulton County special grand jury recommended charges against Lindsey Graham, David Perdue and Kelly Loeffler  —  The special grand jury in Fulton County investigating the 2020 presidential election in Georgia recommended charges against Republican Sen. Lindsey Graham of South Carolina … ",
    "url": "https://www.cnn.com/2023/09/08/politics/fulton-county-special-grand-jury-report/"
  },
  {
    "text": "A reminder of how one juror could save Trump  —  The big news from the newly released Fulton County, Ga., special grand jury report is that the panel recommended charges for many more than the 19 people (including Donald Trump) who were ultimately indicted.  Among them: a sitting U.S. senator … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/08/reminder-how-one-juror-could-save-trump/"
  },
  {
    "text": "Judge denies Mark Meadows effort to move Georgia case to federal court  —  The ruling is a blow to Meadows's efforts in federal court to dismiss his case and could influence former president Donald Trump as he decides whether to seek removal himself.  —  A federal judge denied a request Friday … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/08/mark-meadows-court-decision-georgia/"
  },
  {
    "text": "Graham defends 2020 election actions after Fulton grand jury recommended prosecution  —  Sen. Lindsey Graham (R-S.C.) defended his actions surrounding the 2020 election after a grand jury report in Fulton County, Ga., released Friday showed jurors recommended that he be prosecuted.",
    "url": "https://thehill.com/homenews/senate/4194321-graham-defends-2020-election-actions-after-fulton-grand-jury-recommended-prosecution/"
  },
  {
    "text": "Newsom: Democrats need to ‘move on’ from worries over Biden re-election  —  In an exclusive interview with Meet the Press, Gov. Gavin Newsom (D-Calif.) says Democrats “need to move past” their worries about whether President Biden is really running for re-election.",
    "url": "https://www.nbcnews.com/meet-the-press/video/newsom-democrats-need-to-move-on-from-worries-over-biden-re-election-192476741785"
  },
  {
    "text": "Elon Musk Acknowledges Withholding Satellite Service to Thwart Ukrainian Attack  —  The Starlink satellite internet service, which is operated by Mr. Musk's rocket company SpaceX, has been a digital lifeline for soldiers and civilians in Ukraine.  —  A top adviser to Ukraine's president accused Elon Musk … ",
    "url": "https://www.nytimes.com/2023/09/08/world/europe/elon-musk-starlink-ukraine.html"
  },
  {
    "text": "Trump overstated net worth by up to $3.6 billion each year, NY attorney general alleges in new filing  — Former President Donald Trump's net worth was inflated by billions of dollars each year more than the New York attorney general's office originally estimated, the office alleged in a new court filing.",
    "url": "https://www.cnbc.com/2023/09/08/trump-overstated-net-worth-by-up-to-3point6-billion-per-year-ny-ag-alleges-in-new-filing.html"
  },
  {
    "text": "Trump allies urge a wake-up call for his lagging Iowa campaign operation  —  As the stretch run to the Iowa caucuses begins, Trump's polling lead belies a small campaign organization getting outstripped by rivals.  —  A number of Donald Trump's allies are growing concerned that his lead … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-allies-urge-wake-call-lagging-iowa-campaign-operation-rcna103556"
  },
  {
    "text": "IRS cracking down on 1,600 millionaires over back taxes  —  The IRS is launching an initiative to crack down on 1,600 millionaires and 75 large businesses it says owe hundreds of millions of dollars in back taxes, the agency announced Friday.  —  The program takes advantage of additional funding … ",
    "url": "https://thehill.com/business/4193872-irs-cracking-down-on-1600-millionaires-over-back-taxes/"
  },
  {
    "text": "Pelosi to run again, ending speculation — for now — about her future  —  The move would extend her 36-year House career and continue to freeze her would-be California successors in a longstanding holding pattern.  —  Nancy Pelosi isn't done yet.  —  The San Francisco Democrat … ",
    "url": "https://www.politico.com/news/2023/09/08/pelosi-will-seek-reelection-00114722"
  },
  {
    "text": "Alito rejects call to recuse in tax case  —  The conservative justice granted a series of interviews to a lawyer working with The Wall Street Journal.  —  Justice Samuel Alito is emphatically rejecting calls for him to recuse himself from a closely watched tax case because he sat for interviews … ",
    "url": "https://www.politico.com/news/2023/09/08/alito-rejects-call-to-recuse-in-tax-case-00114735"
  },
  {
    "text": "FAA orders Musk's SpaceX to take 63 corrective actions on Starship, keeps rocket grounded  — The Federal Aviation Administration said Elon Musk's SpaceX must keep its Starship Super Heavy rocket grounded.  — The federal agency had been probing the April launch, which saw SpaceX's Starship explode in mid-flight.",
    "url": "https://www.cnbc.com/2023/09/08/faa-starship-grounded-corrective-action.html"
  },
  {
    "text": "New tapes reveal MyPillow CEO Mike Lindell meltdown in 2020 election deposition  — The clips of the depositions show Mike Lindell snapping and ripping attorneys who are leading a lawsuit against him.  — Eric Coomer, former director of product strategy and security at Dominion Voting Systems, has sued Lindell for defamation.",
    "url": "https://www.cnbc.com/2023/09/08/my-pillow-ceo-mike-lindell-melts-down-in-trump-2020-deposition.html"
  },
  {
    "text": "Another Christian influencer arrested for child abuse: Why conservatives keep falling for these cons  —  Ruby Franke was yet another Duggar knock-off, putting a shiny happy gloss on religious oppression  —  In many ways, it's the least surprising story of our times: A showily Christian … ",
    "url": "https://www.salon.com/2023/09/08/another-christian-influencer-arrested-for-child-abuse-why-conservatives-keep-falling-for-these-cons/"
  },
  {
    "text": "BLASTPASS: NSO Group iPhone Zero-Click, Zero-Day Exploit Captured in the Wild  —  Apple has just issued an update for Apple products including iPhones, iPads, Mac computers, and Apple Watches.  We encourage all users to immediately update their devices.  —  We urge all at-risk users … ",
    "url": "https://citizenlab.ca/2023/09/blastpass-nso-group-iphone-zero-click-zero-day-exploit-captured-in-the-wild/"
  },
  {
    "text": "Mifepristone maker asks Supreme Court to make ultimate decision on abortion drug in 2024  —  The Supreme Court is once again being asked to make a major ruling on abortion in an election year.  —  A manufacturer of the widely used abortion drug mifepristone asked the Supreme Court on Friday … ",
    "url": "https://www.cnn.com/2023/09/08/politics/mifepristone-supreme-court-appeal/"
  },
  {
    "text": "Fla. Supreme Court justices question longstanding abortion protections  —  The case centers on whether the state constitution's privacy clause covers the right to abortion  —  Members of Florida's conservative Supreme Court appeared skeptical during a hearing Friday that the state constitution … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/08/florida-supreme-court-abortion/"
  },
  {
    "text": "Kristi Noem is suddenly front and center in the veepstakes  —  The South Dakota governor will appear with Donald Trump at an event in Rapid City on Friday.  —  Not long ago, it looked like Kristi Noem's star was flaming out.  Following a turbulent first term, the South Dakota governor elected … ",
    "url": "https://www.politico.com/news/2023/09/08/kristi-noem-veepstakes-00114586"
  },
  {
    "text": "Biden administration considering plan to force migrants to remain in Texas: report  —  Texas is in the midst of a feud with the administration over the state's migrant bussing program and floating barriers  —  The Biden administration is considering forcing migrants who cross … ",
    "url": "https://www.foxnews.com/politics/biden-administration-considering-plan-forcing-migrants-remain-texas"
  }
]