[
  {
    "text": "Haitian nonprofit in Springfield files criminal charges against Donald Trump, JD Vance  —  Affidavit uses state statute allowing private citizens to file charges  —  The leader of the nonprofit Haitian Bridge Alliance filed charges against former president Donald Trump and his running mate … ",
    "url": "https://www.news5cleveland.com/news/local-news/haitian-nonprofit-in-springfield-files-criminal-charges-against-donald-trump-jd-vance"
  },
  {
    "text": "Haitian group in Springfield, Ohio, files citizen criminal charges against Trump and Vance  —  The leader of a nonprofit representing the Haitian community of Springfield, Ohio, filed criminal charges Tuesday against former President Donald Trump and his running mate, JD Vance … ",
    "url": "https://apnews.com/article/haitian-immigrants-springfield-charges-trump-vance-012af00a8677da5caed55d03e8779774"
  },
  {
    "text": "Survey: Enthusiasm for Harris catapults Asian American voters … - It's the first major survey of Asian American voters since President Biden dropped out of the race and Harris entered. … Only 6% said they were undecided or would back another candidate.",
    "url": "https://www.axios.com/2024/09/24/harris-asian-american-voters-survey"
  },
  {
    "text": "Presidential Race Tight in Nevada  —  Generic Vote Tilts Blue  —  Just weeks out from Election Day, the race to the White House is dead heat among Nevada likely voters.  According to recent public opinion polling data from Noble Predictive Insights' (NPI) latest Nevada Public Opinion Pulse … ",
    "url": "https://www.noblepredictiveinsights.com/post/presidential-race-tight-in-nevada"
  },
  {
    "text": "Man charged with attempted assassination of Trump at Florida golf course as case is assigned to Judge Aileen Cannon  —  Prosecutors on Tuesday filed the charge of attempted assassination of a major presidential candidate against Ryan Wesley Routh, the man they say camped outside … ",
    "url": "https://www.cnn.com/2024/09/24/politics/ryan-routh-additional-charges-trump-assassination-attempt/"
  },
  {
    "text": "Manchin won't endorse Harris over vow to gut filibuster to codify abortion rights: ‘Shame on her’  —  Vice President Kamala Harris' vow to gut the Senate's filibuster rule to pass a bill codifying abortion rights has cost her an endorsement from a leading Senate moderate: Joe Manchin.",
    "url": "https://www.cnn.com/2024/09/24/politics/joe-manchin-not-endorse-harris-filibuster"
  },
  {
    "text": "Kamala Harris tells WPR she supports eliminating the filibuster to restore abortion rights  —  The presidential candidate appears on WPR's ‘Wisconsin Today’ shortly after her fourth campaign visit to the state  —  Vice President and Democratic nominee for president Kamala Harris told WPR's … ",
    "url": "https://www.wpr.org/news/kamala-harris-presidential-campaign-vice-president-housing-affordability-pfas-pollution-wpr-interview"
  },
  {
    "text": "Supreme Court allows Missouri to execute Marcellus Williams  —  The Supreme Court refused to block Missouri from executing Marcellus Williams on Tuesday amid questions about the jury selection process and key evidence used in convicting him of murder in 2001.",
    "url": "https://thehill.com/regulation/court-battles/4897389-supreme-court-marcellus-williams-missouri-execution/"
  },
  {
    "text": "SCOTUS conservatives let Missouri kill Marcellus Williams  —  [UPDATE, 7:30 p.m. ET: Missouri has killed Marcellus Williams.]  —  [UPDATE, 5:50 p.m. ET: The U.S. Supreme Court, over the objection of the three Democratic appointees, refused to stop Missouri's scheduled execution of Marcellus Williams on Tuesday.]",
    "url": "https://www.lawdork.com/p/scotus-clemency-marcellus-williams"
  },
  {
    "text": "The New York Times is washed  —  SFGATE columnist Drew Magary is done with caring about the Times, and you should be, too  —  We're just over a month away from the presidential election and, if you ask the New York Times, the race between Vice President Kamala Harris and former president … ",
    "url": "https://www.sfgate.com/sf-culture/article/new-york-times-washed-19780600.php"
  },
  {
    "text": "Harris campaign office damaged by gunfire in Arizona  —  No one was present or injured at the office, a state Democratic Party spokesperson said.  Tempe, Arizona, police said they are investigating it as a property crime.  —  TEMPE, Arizona — Tempe, Arizona, police are investigating … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-campaign-office-damaged-gunfire-arizona-rcna172463"
  },
  {
    "text": "Teens Say Trump's Former Personal Aide and Project 2025 Higher-Up Made Them Uncomfortable in Chats  —  Two women tell WIRED that when they were 18-year-old college freshmen, John McEntee, a former Trump administration official and co-founder of a Peter Thiel-backed dating app … ",
    "url": "https://www.wired.com/story/teens-john-mcentee-trump-aide-project-2025-chats/"
  },
  {
    "text": "Noticias Univision Announces 2024 Townhalls with Former President Donald Trump & Vice President Kamala Harris  —  Presidential Candidates Will Engage with Undecided Hispanic Voters to Discuss Important Issues Facing the Community and Nation  —  Enrique Acevedo to Moderate Townhalls … ",
    "url": "https://corporate.televisaunivision.com/press/2024/09/24/noticias-univision-announces-townhalls-with-former-president-donald-trump-vice-president-kamala-harris/"
  },
  {
    "text": "Project 2025 mastermind allegedly told colleagues he killed a dog with a shovel  —  Revealed: former colleagues claim Kevin Roberts told them he killed a neighbor's pit bull around 2004  —  The man behind Project 2025, the rightwing policy manifesto that includes calls for a sharp increase … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/24/project-2025-kevin-roberts-killed-dog"
  },
  {
    "text": "Mark Zuckerberg's Political Evolution … It was only a little more than a decade ago that Mark Zuckerberg had few qualms about airing his politics.  —  Earnest and optimistic — perhaps naïvely so — he rushed onto the national stage to discuss issues he cared about: immigration, social justice, inequality, democracy in action.",
    "url": "https://www.nytimes.com/2024/09/24/technology/mark-zuckerberg-trump-politics.html"
  },
  {
    "text": "Nebraska governor: No plans for special session on winner-take-all electoral system  —  Nebraska Gov. Jim Pillen (R) said Tuesday that he would not be calling a special session for lawmakers to consider changing the state's electoral system to winner-take-all after one key GOP lawmaker rejected a bid to flip his vote.",
    "url": "https://thehill.com/homenews/state-watch/4896689-nebraska-jim-pillen-decision-electoral-system-change-2024/"
  },
  {
    "text": "DOJ sues Visa for monopolizing debit card market … - This case could result in the market being opened up for more players, depending on what remedy DOJ seeks. … - Using that ubiquity as leverage, DOJ claims that Visa effectively forced merchants to send almost all of their payments through its network … ",
    "url": "https://www.axios.com/2024/09/24/visa-antitrust-debit-card-monopoly-lawsuit"
  },
  {
    "text": "Son of Ryan Routh, accused in Trump assassination attempt, arrested for child pornography  —  Oran Routh had “hundreds” of files of child pornography, prosecutors said.  —  The Department of Justice seal is seen during a news conference at the DOJ office in Washington, May 16, 2023.",
    "url": "https://abcnews.go.com/US/son-ryan-routh-accused-trump-assassination-attempt-arrested/story?id=113959628"
  },
  {
    "text": "Trump mixes up the name of Charlottesville, Virginia, during his speech in Georgia  —  Donald Trump flubbed the name of Charlottesville, Virginia, while going off script during a speech on Tuesday otherwise focused on economic policy, slamming Vice President Kamala Harris for lying about “Charlottestown.”",
    "url": "https://apnews.com/article/trump-charlottesville-flub-georgia-economic-speech-a9bc57710091fc0194bc072229d146f4"
  },
  {
    "text": "Trump Is Spiraling, and Getting Creepier, About Women Voters  —  In 2012, the GOP fielded candidates who didn't know how our bodies worked.  In 2024, Trump drones on about protecting us, and is equally disturbing.  —  Pocket  —  In 2012, it seemed like Republicans hit their low in talking about women.",
    "url": "https://www.thenation.com/article/politics/trump-women-voters/"
  },
  {
    "text": "Comcast, a Backer of Reproductive Rights, Donates to DeSantis's Anti-Abortion PAC  —  AFTER THE U.S. SUPREME COURT'S DOBBS DECISION in 2022, telecommunications giant Comcast announced it would give employees seeking to terminate a pregnancy as much as $10,000 to travel from states … ",
    "url": "https://www.thebulwark.com/p/comcast-donation-to-desantis-anti-abortion-pac"
  },
  {
    "text": "Judge Rules Jack Smith Can Submit 180 Pages Of Evidence Of Trump's Alleged 1/6 Crimes Before The Election  —  Judge Chutkan ruled that Special Counsel Jack Smith can submit 180 pages of evidence of Trump's alleged 1/6 crimes to the court before the election.  —  Judge Chutkan wrote in her opinion and order:",
    "url": "https://www.politicususa.com/2024/09/24/jack-smith-evidence-trump-1-6.html"
  },
  {
    "text": "Wisconsin Today  —  “Wisconsin Today” explores the people, places and ideas shaping life in Wisconsin.  Join hosts Rob Ferrett and Kate Archer Kent for news and in-depth conversations that you can't find anywhere else.  —  Don't miss “Wisconsin Today: Morning News,” our weekday news podcast … ",
    "url": "https://www.wpr.org/shows/wisconsin-today-2"
  },
  {
    "text": "US Navy Oiler Runs Aground, Forcing Carrier Strike Group to Scramble for Fuel  —  by John Konrad - gCaptain has received multiple reports that the US Navy oiler USNS Big Horn ran aground yesterday and partially flooded off the coast of Oman, leaving the Abraham Lincoln Carrier Strike Group without its primary fuel source.",
    "url": "https://gcaptain.com/us-navy-oiler-usns-big-horn-aground-forcing-carrier-strike-group-to-scramble-for-fuel/"
  },
  {
    "text": "Florida, Georgia Teamsters break with national leadership by endorsing Harris-Walz ticket  —  Since the non-endorsement by the national governing board, Harris-Walz have received endorsements from local councils in important battleground states like Michigan, Wisconsin and Pennsylvania.",
    "url": "https://www.palmbeachpost.com/story/news/politics/government/2024/09/24/florida-georgia-teamsters-endorse-kamala-harris-tim-walz-campaign/75366776007/"
  },
  {
    "text": "Special counsel can present ‘substantial’ new evidence against Trump in January 6 case, judge rules  —  Special counsel Jack Smith this week will be allowed to file hundreds of pages of legal arguments and evidence gathered in the 2020 election subversion and January 6 US Capitol attack criminal case … ",
    "url": "https://www.cnn.com/2024/09/24/politics/special-counsel-trump-substantial-evidence"
  },
  {
    "text": "WHITE NOISE  —  At a time when we've never needed good to prevail over evil more, I simply don't trust enough of my fellow white men in America to do the right thing in November.  —  As an expert spanning 64 years on this sore subject, I want to spend a few minutes kicking that — and us — around a bit today.",
    "url": "https://dearlstephens.substack.com/p/white-noise"
  },
  {
    "text": "The Trump Posts You Probably Aren't Seeing  —  His Truth Social posts are even worse than you think.  —  Do you remember what it was like when Donald Trump couldn't stop tweeting?  When it felt like, no matter the time of day or what you were doing, his caps-lock emeses were going to find you, like a heat-seeking, plain-text missile?",
    "url": "https://www.theatlantic.com/technology/archive/2024/09/trump-truth-social-posts/680003/"
  },
  {
    "text": "Hundreds of Pregnant Women Prosecuted The Year After Roe v. Wade Fell  —  A new report finds at least 210 women faced pregnancy-related charges in the year after the Supreme Court ended the federal right to an abortion  —  AT LEAST 210 women faced criminal charges related to pregnancy … ",
    "url": "https://www.rollingstone.com/politics/politics-news/pregnant-women-prosecuted-supreme-court-abortion-1235111112/"
  },
  {
    "text": "Israel Deliberately Blocked Humanitarian Aid to Gaza, Two Government Bodies Concluded.  Antony Blinken Rejected Them.  —  Blinken told Congress, “We do not currently assess that the Israeli government is prohibiting or otherwise restricting” aid, even though the U.S. Agency for International Development … ",
    "url": "https://www.propublica.org/article/gaza-palestine-israel-blocked-humanitarian-aid-blinken"
  }
]