[
  {
    "text": "Congress Has the Opportunity to Do the Funniest Thing Ever  —  The Speaker election looks tight.  The presidential election certification is just days away.  Could Republicans impose their own January 6th through sheer obstinacy?  —  House Speaker Mike Johnson (R-LA) … ",
    "url": "https://prospect.org/politics/2025-01-02-congress-republicans-speaker-mike-johnson-january-6/"
  },
  {
    "text": "Democrats rage as Johnson restricts their ability to oust him … - “This makes it clear that they have no intention of working together to find common ground,” Rep. Jim McGovern (D-Mass.), the top Democrat on the House Rules Committee, said of the rules change in a statement.",
    "url": "https://www.axios.com/2025/01/02/mike-johnson-democrats-motion-to-vacate-rules"
  },
  {
    "text": "Johnson doesn't have the votes to remain speaker.  But his allies insist it's trending his way.  —  With less than 24 hours left until the start of the 119th Congress, Mike Johnson doesn't have the votes yet to remain speaker.  The Louisiana Republican has been working diligently … ",
    "url": "https://www.politico.com/live-updates/2025/01/02/congress/johnson-allies-think-hell-win-speakership-00196249"
  },
  {
    "text": "Driver in Las Vegas Cybertruck explosion identified as Army Green Beret from Colorado Springs  —  Truck was rented in Colorado Springs, according to federal sources  —  LAS VEGAS — The driver of the Tesla Cybertruck that exploded in front of a Las Vegas hotel on New Year's Day has been identified … ",
    "url": "https://www.denver7.com/news/local-news/cybertruck-that-exploded-outside-trump-hotel-in-las-vegas-rented-in-colorado"
  },
  {
    "text": "Suspects in Vegas explosion, New Orleans attack served at same Army base, sources tell Denver7 Investigates  —  Authorities were investigating the link as a possible connection between the two attacks, those sources said.  —  DENVER — The Colorado Springs resident suspected of detonating … ",
    "url": "https://www.denver7.com/news/local-news/suspects-in-vegas-explosion-new-orleans-attack-served-at-same-army-base-sources-tell-denver7-investigates"
  },
  {
    "text": "The man who died in a Tesla Cybertruck explosion was an active-duty US Army soldier, officials say  —  The person who died in the explosion of a Tesla Cybertruck packed with explosives outside President-elect Donald Trump's Las Vegas hotel was an active-duty U.S. Army soldier, officials said Thursday.",
    "url": "https://apnews.com/article/trump-hotel-explosion-tesla-cybertruck-5c5a8fd13a50e2bcde46370ae926d427"
  },
  {
    "text": "Trump blames ‘open borders’ for New Orleans, Las Vegas attacks  —  President-elect Trump blamed the situation at the U.S.-southern border for the recent attacks in New Orleans and Las Vegas, railing against President Biden for his immigration policies as both cases are being investigated.",
    "url": "https://thehill.com/homenews/administration/5063169-donald-trump-joe-biden-open-borders-new-orleans-las-vegas-attacks/"
  },
  {
    "text": "I Was Wrong About the 2024 Election.  Here's Why.  —  I thought Kamala Harris would win.  I was wrong.  While I'm sure we Democrats can argue that the loss wasn't a landslide or take a little solace in our House performance, the most important thing for us now is to face that we were wrong and take action on the prevailing “why.”",
    "url": "https://www.nytimes.com/2025/01/02/opinion/democrats-donald-trump-economy.html"
  },
  {
    "text": "10 policies Republicans could use to pay for new tax cuts  —  Extending the expiring 2017 tax cuts could add $5 trillion to the national debt; Trump and GOP lawmakers are are considering these policies to offset that cost.  —  Advisers to President-elect Donald Trump and congressional Republicans … ",
    "url": "https://www.washingtonpost.com/business/2025/01/02/trump-budget-cuts-national-debt/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM1Nzk0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3MTc2Mzk5LCJpYXQiOjE3MzU3OTQwMDAsImp0aSI6ImYxOWFlMjllLTE3MjktNGU2ZC04MzQ4LWZjOWQzNmZmMjljNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzAyL3RydW1wLWJ1ZGdldC1jdXRzLW5hdGlvbmFsLWRlYnQvIn0.zP-LMyjcYn7upLoPMEZsLJX9AL0AO4VnzALE2tB_kdA&itid=gfta"
  },
  {
    "text": "Net Neutrality Rules Struck Down by Appeals Court  —  After nearly two decades of fighting, the battle over regulations that treat broadband providers like utilities came to an end on Thursday.  —  A federal appeals court struck down the Federal Communications Commission's landmark net neutrality rules … ",
    "url": "https://www.nytimes.com/2025/01/02/technology/net-neutrality-rules-fcc.html?unlocked_article_code=1.mE4.-uFh.y-1QX1by865j&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump flunks 3 key tests following deadly New Orleans attack  —  Within hours of the New Year's attack in New Orleans, the president-elect simultaneously flunked tests of accuracy, decency and credibility.  —  As the public first started learning the details of the deadly attack in New Orleans … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-flunks-3-key-tests-deadly-new-orleans-attack-rcna185965"
  },
  {
    "text": "Meta's Nick Clegg to step down, will be replaced by well-connected Republican … - “Joel is quite clearly the right person for the right job at the right time - ideally placed to shape the company's strategy as societal and political expectations around technology continue to evolve.”",
    "url": "https://www.axios.com/2025/01/02/meta-nick-clegg-step-down-republican-joel-kaplan"
  },
  {
    "text": "Live updates New Orleans attacker acted alone, FBI says  —  FBI on New Orleans attack: ‘This was an act of terrorism’  —  The man who plowed a rented pickup truck into a crowd in New Orleans early New Year's Day is believed to have worked alone, an FBI official said in a news conference Thursday.",
    "url": "https://www.washingtonpost.com/nation/2025/01/02/new-orleans-truck-attack-investigation-updates/"
  },
  {
    "text": "Why Don't the Tech Bros Just Hire from MAGA?  —  Decoding the DOGE-MAGA civil war.  —  ∙ Paid  —  1. MSG  —  I remain fascinated by the intraparty MAGA-DOGE fight.  The MAGA position seems to be:  — Elite college-grad Americans are bad because they're woke or whatever.",
    "url": "https://www.thebulwark.com/p/why-dont-the-tech-bros-just-hire"
  },
  {
    "text": "Elon Musk Defends His Petty Revenge on MAGA Critics  —  Technocrat billionaire Elon Musk finally owned up Wednesday to restricting his critics' X accounts.  But the self-described “free speech absolutist” doesn't see anything wrong with it.  —  Last week, Musk began stripping the verifications … ",
    "url": "https://newrepublic.com/post/189770/elon-musk-x-critics-verification-immigration-visa"
  },
  {
    "text": "Cybertruck blast suspect was a ‘Rambo type’ who loved Trump, family says  —  Exclusive: Matthew Livelsberger's shocked uncle told The Independent that the Green Beret was a ‘supersoldier’  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech … ",
    "url": "https://www.independent.co.uk/news/world/americas/cybertruck-explosion-suspect-matthew-livelsberger-vegas-b2672940.html"
  },
  {
    "text": "Liz Cheney Is Among 20 Chosen to Receive Presidential Citizens Medal  —  Two close advisers to President Biden will also be honored, in addition to career lawmakers who have worked across the aisle and advocates for liberal causes.  —  President Biden will award the Presidential Citizens Medal … ",
    "url": "https://www.nytimes.com/2025/01/02/us/politics/presidential-citizens-medal-liz-cheney.html"
  },
  {
    "text": "Newborns are being left in dumpsters in Texas, but Republicans don't seem to care  —  Why the GOP is unwilling to prevent infant abandonment  —  Abortion bans don't just kill women.  They kill babies.  This is evident in the data, which shows a dramatic rise in the state's infant mortality after Texas banned abortion.",
    "url": "https://www.salon.com/2025/01/02/newborns-are-being-left-in-dumpsters-in-texas-but-dont-seem-to-care/"
  }
]