[
  {
    "text": "John Fetterman isn't the politician you thought he'd be — and he doesn't care  —  John Fetterman's had a rollercoaster of a year.  —  In January, he was sworn into office as Pennsylvania's new Democratic senator despite suffering from a debilitating stroke on the campaign trail.",
    "url": "https://www.politico.com/news/2023/12/27/john-fetterman-q-and-a-00133217"
  },
  {
    "text": "Michigan Supreme Court rejects ‘insurrectionist ban’ case and keeps Trump on 2024 primary ballot  —  The Michigan Supreme Court has rejected an attempt to remove former President Donald Trump from the 2024 ballot based on the US Constitution's “insurrectionist ban.”",
    "url": "https://www.cnn.com/2023/12/27/politics/michigan-supreme-court-rejects-insurrectionist-ban-case-and-keeps-trump-on-2024-primary-ballot/"
  },
  {
    "text": "Trump shares cryptic ‘dictatorship’ word cloud on Truth Social  —  It's not the first time Trump has called himself a dictator, but it's the first time he's said it via word cloud.  —  Voters surveyed by the Daily Mail described former President Donald Trump's political goals as “corruption,” “revenge” and “dictatorship.”",
    "url": "https://www.politico.com/news/2023/12/26/trump-cryptic-dictatorship-truth-social-00133219"
  },
  {
    "text": "Trans Actress Accuses Delta Staff of ‘Human Rights Violation’ in Viral Row  —  Tommy Dorfman claimed one of the airline workers had “intentionally” referred to her with the wrong pronoun.  —  Transgender actress Tommy Dorfman accused Delta Air Lines workers of committing a “human rights violation” … ",
    "url": "https://www.thedailybeast.com/tommy-dorfman-trans-actress-accuses-delta-staff-of-human-rights-violation-in-viral-row"
  },
  {
    "text": "Viral Video of Trans Actress Being Misgendered by Delta Staff Sparks Debate  —  A video by transgender actress Tommy Dorfman, in which she accuses Delta Air Lines Employees of “intentionally” misgendering her, quickly went viral and sparked a fiery debate on social media.",
    "url": "https://www.newsweek.com/viral-video-trans-actress-being-misgendered-delta-staff-sparks-debate-1855671"
  },
  {
    "text": "Thousands — and some city officials — want Trump's Hollywood star removed  —  An activist is forcing Los Angeles city officials to confront an unprecedented question: Whether former President Trump's star on the Hollywood Walk of Fame can be withdrawn, the Los Angeles Times reports.",
    "url": "https://www.axios.com/2023/12/27/trump-hollywood-walk-of-fame-star-removal"
  },
  {
    "text": "GOP congressman traveled to Uganda to support anti-LGBTQ death penalty law  —  Rep. Tim Walberg co-chairs the National Prayer Breakfast — and urged Uganda to “stand firm” on “death to gays” law  —  In a little-noticed October speech in Uganda, Rep. Tim Walberg, R-Mich. … ",
    "url": "https://www.salon.com/2023/12/27/congressman-traveled-to-uganda-to-support-anti-lgbtq-penalty-law_partner/"
  },
  {
    "text": "Alabama lawmakers vow to keep fighting on Space Command, and it could involve Trump  —  “We've got two paths, both of which are good,” House Armed Services Chair Mike Rogers said.  —  Despite President Joe Biden's decision this summer to reverse a Trump-era move and keep U.S. Space Command in Colorado … ",
    "url": "https://www.politico.com/news/2023/12/27/space-command-alabama-00133200"
  },
  {
    "text": "A Fake Trump Elector in Michigan Told Prosecutors of Regret, Anger  —  The Trump supporter is the only one of the 16 fake Michigan electors who has agreed to cooperate with the authorities and had charges against him dropped.  —  One of the Republicans in Michigan who acted as a fake elector … ",
    "url": "https://www.nytimes.com/2023/12/27/us/michigan-trump-fake-elector.html"
  },
  {
    "text": "The Biden Administration Is Quietly Shifting Its Strategy in Ukraine  —  For two years, Biden and Zelenskyy have been focused on driving Russia from Ukraine.  Now Washington is discussing a move to a more defensive posture.  —  President Joe Biden has shifted from promising the U.S. would back Ukraine for … ",
    "url": "https://www.politico.com/news/magazine/2023/12/27/biden-endgame-ukraine-00133211"
  },
  {
    "text": "Matt Napolitano, Fox News audio anchor and reporter, dies at 33 after a brief illness  —  Napolitano wrote and produced segments for all Fox News audio platforms.  He contributed sports-related coverage for Fox Business Network's “Cavuto: Coast to Coast” weekday series anchored by Neil Cavuto.",
    "url": "https://www.nbcnews.com/news/us-news/matt-napolitano-fox-news-audio-anchor-reporter-dies-33-brief-illness-rcna131275"
  },
  {
    "text": "After Sandy Hook, they voted no. Now these senators want new gun laws.  —  Reflecting on a decade of mass killings and surging AR-15 sales, four current and three former senators recant some or all of their 2013 positions on gun laws in emotional interviews with The Post",
    "url": "https://www.washingtonpost.com/politics/interactive/2023/assault-weapons-ban-debate-gun-control-ar-15-mass-shootings/"
  },
  {
    "text": "Democratic group makes a $5.9 million bet on flipping George Santos' House seat  —  First on NBC News: House Majority PAC plans to spend heavily on TV, digital and mail ads to win a special election that it is calling a harbinger for the November battle over the chamber.",
    "url": "https://www.nbcnews.com/politics/congress/democratic-group-makes-59-million-bet-flipping-george-santos-house-sea-rcna131042"
  },
  {
    "text": "Trump Demands MAGA Group Give Him ‘Millions.’ That's Not Legal, Experts Say  —  Trump wants a cut from a think tank raising money to support his agenda and staff his administration, sources tell Rolling Stone. … At least that's how former President Donald Trump sees it.",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-maga-group-millions-cash-america-first-1234936525/"
  },
  {
    "text": "Melania Thinks It's Time to ‘Leave Her Mark on History’  —  OUT OF THE SHADOWS  —  Melania Trump is reportedly ready for her moment in the spotlight.  The former first lady, who's made only a handful of public appearances since Donald Trump left office, was reportedly encouraged by her … ",
    "url": "https://www.thedailybeast.com/melania-trump-thinks-its-time-to-leave-her-mark-on-history"
  },
  {
    "text": "Ramaswamy campaign stops TV ad spending  —  The biotech entrepreneur's campaign for the Republican nomination has been sputtering in recent months.  —  Vivek Ramaswamy's presidential campaign has ceased spending on television advertising ahead of next month's Republican presidential contests, NBC News reported Tuesday.",
    "url": "https://www.politico.com/news/2023/12/26/ramaswamy-campaign-stops-tv-ad-spending-00133221"
  }
]