[
  {
    "text": "RFK Jr. Cancels $500 Million In Funding For Vaccine Development  —  The mRNA vaccines are credited with slowing the 2020 coronavirus pandemic.  —  The Department of Health and Human Services will cancel contracts and pull funding for some vaccines that are being developed to fight respiratory viruses like COVID-19 and the flu.",
    "url": "https://www.huffpost.com/entry/rfk-vaccine-funding-mrna_n_68928569e4b0d3424bc41392"
  },
  {
    "text": "RFK Jr. pulls $500 million in funding for vaccine development  —  The Department of Health and Human Services will cancel contracts and pull funding for some vaccines that are being developed to fight respiratory viruses like COVID-19 and the flu.  Robert F. Kennedy Jr. … ",
    "url": "https://apnews.com/article/kennedy-vaccines-mrna-pfizer-moderna-1fb5b9436f2957075064c18a6cbbe3c9"
  },
  {
    "text": "RFK Jr. cuts $500 million in mRNA vaccine contracts, dealing major blow to promising area of research  —  The cuts add to mounting evidence that Kennedy is pursuing an aggressive anti-vaccine agenda.  —  The Trump administration is terminating 22 contracts focused on developing mRNA vaccines … ",
    "url": "https://www.nbcnews.com/health/health-news/rfk-jr-cuts-500-million-mrna-vaccine-contracts-dealing-major-blow-prom-rcna223281"
  },
  {
    "text": "STAT+: Health secretary RFK Jr. shuts door on U.S. investment in mRNA vaccine research  —  Health secretary Robert F. Kennedy Jr. on Tuesday announced that the government's emergency preparedness agency will no longer fund work on messenger RNA vaccines, delivering a crippling blow … ",
    "url": "https://www.statnews.com/2025/08/05/mrna-vaccine-development-canceled-by-kennedy-hhs/"
  },
  {
    "text": "Democrats draw up plans to retaliate if Republicans gerrymander Texas — but they face legal hurdles  —  California is eyeing a ballot initiative this fall to redraw its House map for 2026 — only if Texas Republicans redistrict to gain more seats.  New York Democrats may have to wait until 2028.",
    "url": "https://www.nbcnews.com/politics/2026-election/democrats-plans-redistricting-retaliate-texas-republicans-legal-rcna223128"
  },
  {
    "text": "‘Trumpmandering’ — a nationwide scheme to undermine Black and Hispanic voters  —  In a desperate power grab to preserve Republican control of the U.S. House in the 2026 elections, President Trump is demanding Republican elected officials in Texas and other states redraw congressional district boundaries.",
    "url": "https://thehill.com/opinion/campaign/5436443-trump-abbott-gerrymandering-texas/"
  },
  {
    "text": "Abbott sues to remove Texas House Democratic Caucus Chair Gene Wu from seat  —  Texas Gov. Greg Abbott (R) has sued to remove Texas House Democratic Caucus Chair Gene Wu from his seat amid a battle between Texas Democrats and Republicans over redistricting.  —  “What is at stake here?",
    "url": "https://thehill.com/regulation/court-battles/5437860-abbott-sues-remove-texas-house-democratic-caucus-chair-gene-wu/"
  },
  {
    "text": "Top Trump officials will discuss Epstein strategy at Wednesday dinner hosted by Vance  —  Top Trump administration officials will gather at the vice president's residence Wednesday evening as they continue to weigh whether to publish an audio recording and transcript of Deputy Attorney General … ",
    "url": "https://cnn.com/2025/08/05/politics/trump-blanche-epstein-maxwell-vance-bondi-patel-meeting"
  },
  {
    "text": "Trump threatens federal takeover of D.C. after attack on DOGE worker  —  Trump floats taking federal control of the city after the man known online as ‘Big Balls’ was injured in a carjacking.  Elon Musk also says city should be taken over.  —  A protégé of Elon Musk … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/08/05/trump-doge-worker-washington-dc-crime/"
  },
  {
    "text": "Trump threatens federal control of D.C. following attack on administration staffer known as ‘Big Balls’  —  Edward Coristine, the Trump administration employee nicknamed “Big Balls,” was the victim of a carjacking and assault in Washington over the weekend, police said.",
    "url": "https://www.nbcnews.com/politics/trump-administration/trump-threatens-federal-control-dc-attack-doge-staffer-coristine-rcna223293"
  },
  {
    "text": "FEMA Employees Reassigned to ICE  —  Probationary employees who had been on paid leave were told to report to ICE within seven days or lose their jobs.  It could signal problems with ICE recruitment.  —  A number of employees with the Federal Emergency Management Agency (FEMA) … ",
    "url": "https://prospect.org/labor/2025-08-06-fema-employees-reassigned-to-ice/"
  },
  {
    "text": "Trump is favoring China over India on trade  —  As President Trump's tariffs begin to bite more widely, hard data on their actual consequences will soon arrive.  Of course, the rationale for many of the tariff levels remains opaque, and, despite the August 1 “deadline,” negotiations continue with several important trading partners.",
    "url": "https://thehill.com/opinion/international/5437224-trump-is-favoring-china-over-india-on-trade/"
  },
  {
    "text": "Miss United States Files Restraining Order Against GOP Rep. Cory Mills  —  Lindsey Langston, a Florida Republican state committeewoman and the reigning Miss United States, has filed a restraining order against Florida Republican Rep. Cory Mills, after reporting him to local and state law enforcement … ",
    "url": "https://www.dropsitenews.com/p/miss-united-states-lindsey-langston-files-restraining-order-rep-cory-mills"
  },
  {
    "text": "Establishing the White House Task Force on the 2028 Summer Olympics  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, and in anticipation of the 2028 Summer Olympics, it is hereby ordered:  —  Section 1.  Purpose.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/08/establishing-the-white-house-task-force-on-the-2028-summer-olympics/"
  },
  {
    "text": "Trump, Apple to Announce Fresh $100 Billion US Investment  —  President Donald Trump will announce that Apple Inc. will commit to spend another $100 billion on domestic manufacturing, the latest pledge by the tech giant to increase US production of its products as it seeks to avoid punishing tariffs on its flagship iPhones.",
    "url": "https://www.bloomberg.com/news/articles/2025-08-06/trump-apple-to-announce-fresh-100-billion-in-us-manufacturing"
  },
  {
    "text": "LAWSUIT: FIRE challenges unconstitutional provisions Rubio uses in crusade to deport legal immigrants over protected speech  — The First Amendment trumps the statutes that the government is abusing to deport people for speech alone  — This lawsuit seeks a landmark ruling … ",
    "url": "https://www.thefire.org/news/lawsuit-fire-challenges-unconstitutional-provisions-rubio-uses-crusade-deport-legal-immigrants"
  },
  {
    "text": "Trump's War on Big Law Means It's Harder to Challenge the Administration  —  Some of America's largest law firms are refusing to take pro bono and paid legal work from groups that seek to hold the government to account on issues like environmental protection, LGBTQ+ rights and police accountability.",
    "url": "https://www.propublica.org/article/trump-law-firms-accountability-environment-police-lgbtq"
  },
  {
    "text": "FBI crime report says violent crime decreased by 4.5% in 2024  —  Violent crime is defined as murder and nonnegligent manslaughter, rape, robbery and aggravated assault.  —  Statistics released Tuesday by the FBI indicate that violent crime decreased overall in the United States by 4.5% last year.",
    "url": "https://www.nbcnews.com/news/us-news/fbi-crime-report-says-violent-crime-decreased-45-2024-rcna223201"
  },
  {
    "text": "The Banality of Weasel  —  Yesterday, the president of the United States appeared without explanation on the roof of the White House, walked aimlessly for a bit, shouted back-and-forth with reporters, said some hard-to-interpret things about nuclear weapons, gesticulated oddly, and then left.",
    "url": "https://www.thebulwark.com/p/the-banality-of-weasel-trump-kevin-hassett-economics-jobs-numbers-fired"
  },
  {
    "text": "Senator Marsha Blackburn Will Run for Governor of Tennessee  —  A conservative Trump ally in the Senate, Ms. Blackburn will now try to become the first woman to serve as governor.  —  Senator Marsha Blackburn of Tennessee announced on Wednesday that she would run for governor, less than a year after winning another term in the Senate.",
    "url": "https://www.nytimes.com/2025/08/06/us/politics/marsha-blackburn-governor-tennessee.html"
  },
  {
    "text": "Adult son ‘canceled’ his grandma, uncle and cousin.  We are heartbroken.  —  Grandma's views on women, and uncle and cousin's use of racial slurs, crossed the line for the letter writer's 26-year-old son.  —  Just now … — Canceled  —  Canceled: Oh, this is so unfortunate.",
    "url": "https://www.washingtonpost.com/advice/2025/08/06/meghan-leahy-son-family-estrangement/"
  },
  {
    "text": "MPD Makes Two Arrests in Swann Street Attempted Carjacking  —  The Metropolitan Police Department announces the arrests of two suspects in an attempted unarmed carjacking that occurred in Northwest.  —  at approximately 3:00 a.m., the suspects approached the victims, who were standing next to their vehicle … ",
    "url": "https://mpdc.dc.gov/release/mpd-makes-two-arrests-swann-street-attempted-carjacking"
  },
  {
    "text": "Glenn Kessler Believes Fact-Checkers Are Getting Easier to Ignore … Last week Glenn Kessler, the longtime writer of the Washington Post's Fact Checker column, announced that he had accepted a buyout, joining dozens of his former colleagues in walking away from the storied institution.",
    "url": "https://www.cjr.org/the-interview/glenn-kessler-interview-fact-checker-easy-ignore-washington-post-trump-lies.php"
  },
  {
    "text": "MAGA expectations soar after DOJ orders Russia grand jury probe  —  The MAGA movement has spent the past 10 years demanding the arrests of President Trump's political enemies.  — Now, for the first time, the levers of power are aligned to pursue that goal from inside the federal government.",
    "url": "https://www.axios.com/2025/08/06/russia-investigation-criminal-charges-trump-maga"
  },
  {
    "text": "Trump Suggests Vance is MAGA Movement's Heir Apparent  —  President Trump said Vice President JD Vance was “probably favorite at this point” to succeed him as leader of the hard-right political movement.  —  President Trump said on Tuesday that Vice President JD Vance was “most likely” … ",
    "url": "https://www.nytimes.com/2025/08/06/us/politics/trump-vance-rubio-maga-2028.html"
  }
]