[
  {
    "text": "Judge severs Trump's Georgia election interference case, and 16 others, from trial starting in October  —  Kenneth Chesebro and Sidney Powell will be tried starting Oct. 23.  —  The judge overseeing the Georgia election interference case has severed the case, ordering that 17 defendants … ",
    "url": "https://abcnews.go.com/US/judge-severs-17-defendants-including-trump-oct-23/story?id=103185589"
  },
  {
    "text": "Judge rejects request to try all Trump Georgia defendants together next month  —  A state judge on Thursday rejected prosecutors' request to try all 19 defendants together in the Georgia 2020 election interference case next month.  —  “The Court joins the skepticism expressed by several federal courts … ",
    "url": "https://thehill.com/regulation/court-battles/4204049-judge-rejects-request-to-try-all-trump-georgia-defendants-together-next-month/"
  },
  {
    "text": "Fulton judge splits Fulton Trump defendants into two groups  —  X  —  The Fulton County judge overseeing the sprawling election interference probe involving former President Donald Trump on Thursday split the case's 19 defendants into two groups for trial — and suggested that more divisions could be merited.",
    "url": "https://www.ajc.com/politics/fulton-judge-splits-fulton-trump-defendants-into-two-groups/OH2BJFAB6FAKVCY6HIPWTGZBZI/"
  },
  {
    "text": "The deep state tells Biden to retire  —  It's the worst-kept secret in Washington.  —  Joe Biden is too old to be president.  His increasing senility cannot be hidden from the public any longer.  Recent polling indicates that more than two-thirds of Democrats think Biden is too elderly to serve another term in the Oval Office.",
    "url": "https://www.washingtonexaminer.com/restoring-america/fairness-justice/the-deep-state-tells-biden-to-retire"
  },
  {
    "text": "'You're screwed': Romney's exit threatens a collapse of Senate's middle  —  If Joe Manchin and Kyrsten Sinema follow the Utahn out the door, they'll leave a void in a chamber that's handed Joe Biden remarkable bipartisan deals.  —  Mitt Romney's retirement shines a glaring spotlight … ",
    "url": "https://www.politico.com/news/2023/09/14/romney-exit-senate-middle-dealmakers-00115785"
  },
  {
    "text": "Kim Davis must pay $100,000 to US same-sex couple she denied marriage license  —  Jury awards damages to David Ermold and David Moore, who sued former Kentucky county clerk over 2015 incident  —  A former Kentucky county clerk is being ordered to pay $100,000 to a local couple who sued … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/14/kim-davis-damages-same-sex-marriage-license-kentucky"
  },
  {
    "text": "Republican Primary Divide  —  Voters split between Trump and the rest of the field on nomination, issues  —  West Long Branch, NJ - It is a tale of two electorates in the South Carolina Republican presidential primary.  The Monmouth (\"Mon-muth\") University-Washington Post Poll … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_sc_091423/"
  },
  {
    "text": "DeSantis took undisclosed private flights and lodging through wealthy donors  —  The trips included a private flight to the prestigious home of the Masters tournament, with an overnight stay and a round of golf  —  Florida Gov. Ron DeSantis took at least six undisclosed trips on private jets … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/ron-desantis-private-flights/"
  },
  {
    "text": "DeSantis discourages latest covid boosters, contradicting federal guidance  —  Florida Gov. Ron DeSantis (R) and the state's surgeon general are warning residents under age 65 against the new covid-19 booster, going against the advice of federal health officials who have recommended the shots.",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/florida-covid-vaccine-desantis-ladapo/"
  },
  {
    "text": "Video appears to show Lauren Boebert giving the middle finger to an usher after being kicked out of a performance of ‘Beetlejuice’  — Rep. Lauren Boebert was escorted out of a performance of “Beetlejuice” in Denver over the weekend.  — Surveillance footage appears to show her giving … ",
    "url": "https://www.businessinsider.com/footage-shows-lauren-boebert-giving-middle-finger-beetlejuice-usher-2023-9?op=1"
  },
  {
    "text": "Threats mount against prosecutors and FBI agents working on Hunter Biden probe  —  The FBI has created a stand-alone unit to investigate threats from members of the public who think agents and prosecutors haven't been tough enough on the president's son.  —  Prosecutors and FBI agents involved … ",
    "url": "https://www.nbcnews.com/politics/justice-department/prosecutors-fbi-agents-hunter-biden-investigation-threatened-rcna104932"
  },
  {
    "text": "A mistress almost takes the stand in Texas AG's impeachment trial  —  AUSTIN — The star witness swept into the Texas Capitol on Wednesday, red coat and flashy Balenciaga-emblazoned handbag tucked under her arms, her white sheath, red lipstick and signature platinum pixie all a dramatic contrast … ",
    "url": "https://www.washingtonpost.com/nation/2023/09/13/paxton-texas-attorney-general-mistress/"
  },
  {
    "text": "A closer look at California's $267 million war on “organized retail crime”  —  On Tuesday, California Governor Gavin Newsom (D) announced the state would spend hundreds of millions of dollars to combat “organized retail crime.”  More than $267 million will be distributed in grants to 55 cities and counties across the state.",
    "url": "https://popular.info/p/a-closer-look-at-californias-267"
  },
  {
    "text": "Elon Musk Slammed by Second Country in Disastrous Week for Diplomacy  —  The world's richest man drew a rebuke from Taiwan's foreign ministry just days after being called out by Ukrainian officials.  —  The foreign minister of Taiwan has called out Elon Musk directly after the billionaire appeared … ",
    "url": "https://www.thedailybeast.com/elon-musk-slammed-by-taiwan-over-china-comments"
  },
  {
    "text": "Statement from President Joe Biden Announcing the New U.S. Special Representative for Ukraine's Economic Recovery  —  Today, I am proud to announce that I am appointing Penny Pritzker to serve as the new U.S. Special Representative for Ukraine's Economic Recovery.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/09/14/statement-from-president-joe-biden-announcing-the-new-u-s-special-representative-for-ukraines-economic-recovery/"
  },
  {
    "text": "Texas was state with most book bans in 2022, report shows  —  Number of book challenges nationwide doubled from 2021 as book ban movement gathers speed in Republican-led states  —  Texas made the most attempts to ban or restrict books in 2022, according to a new report from the American Library Association (ALA).",
    "url": "https://www.theguardian.com/us-news/2023/sep/14/texas-most-book-bans-2022"
  },
  {
    "text": "House Republicans wrestle with key decisions as they plot next steps on impeachment inquiry  —  House Speaker Kevin McCarthy unilaterally gave his conference the green light to launch an impeachment inquiry into President Joe Biden.  Now the harder work begins.",
    "url": "https://www.cnn.com/2023/09/14/politics/impeachment-next-steps-house-republicans/"
  },
  {
    "text": "What Republicans are doing to Wisconsin is a warning sign to all Americans  —  The state's so gerrymandered that Republicans can lose the popular vote and win supermajorities.  Now they want to impeach a liberal justice before she's ruled on a single case  —  f you need a reminder … ",
    "url": "https://www.theguardian.com/commentisfree/2023/sep/13/wisconsin-warning-democracy-gerrymandering"
  }
]