[
  {
    "text": "Hegseth claims US ‘obliterated’ Iranian nuclear sites despite lack of assessment  —  US defense secretary praises Trump at first news briefing but Pentagon says it is too early for full damage assessment  —  The US defense secretary, Pete Hegseth, on Sunday repeated claims by Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/22/hegseth-iran-nuclear-sites-pentagon"
  },
  {
    "text": "Vance says U.S. 'not at war with Iran, we're at war with Iran's nuclear program'  —  President Donald Trump said Saturday night that the U.S. had dropped bombs on three Iranian nuclear sites, the first time the U.S. has directly attacked Iran.  —  WASHINGTON — Vice President JD Vance … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/vance-says-us-not-war-iran-re-war-irans-nuclear-program-rcna214329"
  },
  {
    "text": "A mad king's pointless war is where Donald Trump was always heading  —  “We will measure our success not only by the battles we win, but also by the wars that we end, and perhaps most importantly, the wars we never get into.”  — Donald Trump's second inaugural address, Jan. 20In a sense, you gotta hand it to Donald Trump.",
    "url": "https://www.inquirer.com/opinion/donald-trump-bombs-iran-20250622.html"
  },
  {
    "text": "‘There Is No Intel’: Trump's Attacks on Iran Were Based on Vibes, Sources Say  —  Following Trump's attacks on Iran, an admin official tells Rolling Stone, “The intelligence assessments have not really changed” … Just months ago, Trump's Director of National Intelligence Tulsi Gabbard testified … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-iran-attack-no-intel-nuclear-1235369641/"
  },
  {
    "text": "Trump has opened a Pandora's box  —  The US president hopes that his display of power in Iran will stop the war — but that is not his decision to make  —  They say with Donald Trump that accusation is confession.  Having warned during the 2024 campaign that Joe Biden, then Kamala Harris … ",
    "url": "https://www.ft.com/content/c6894992-5366-4f30-a3ff-d3e837a7c8e6"
  },
  {
    "text": "Trump Says Key Nuclear Sites Were ‘Obliterated’  —  President Trump said the aim of attacking the three facilities was to destroy Iran's nuclear capability.  Iran said the sites had been hit but did not immediately describe the damage.  —  “Thank you very much.",
    "url": "https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump?unlocked_article_code=1.Q08.OoFc.YX6pwPAUBdnS&smid=url-share"
  },
  {
    "text": "U.S. strikes on Iran nuclear facilities see Hamas and the Houthis vow retaliation, as world leaders react  —  The U.S. strike on Iran's nuclear sites has fueled fears that Israel's war with Tehran could escalate into a wider regional conflict, and other countries reacted Sunday with calls for diplomacy and words of caution.",
    "url": "https://www.cbsnews.com/news/us-strikes-iran-nuclear-sites-world-reaction-israel-hamas-houthis/"
  },
  {
    "text": "Live updates: US intervenes in war between Israel and Iran by striking 3 Iranian nuclear sites  —  The U.S. military struck three sites in Iran early Sunday, inserting itself into Israel's effort to decapitating Iran's nuclear program in a risky gambit to weaken a longtime foe amid Tehran's threat … ",
    "url": "https://apnews.com/live/israel-iran-war-updates"
  },
  {
    "text": "Trump's Courageous and Correct Decision  —  For decades, a succession of American presidents pledged that they were willing to use force to prevent Iran from acquiring nuclear weapons.  But it was President Trump who, by bombing three of Iran's key nuclear sites on Sunday morning … ",
    "url": "https://www.nytimes.com/2025/06/22/opinion/us-military-strike-iran-trump.html"
  },
  {
    "text": "US urges China to dissuade Iran from closing Strait of Hormuz  —  U.S. Secretary of State Marco Rubio on Sunday called on China to encourage Iran to not shut down the Strait of Hormuz after Washington carried out strikes on Iranian nuclear sites.  —  Rubio's comments on Fox News' … ",
    "url": "https://www.reuters.com/world/china/us-urges-china-dissuade-iran-closing-strait-hormuz-2025-06-22/"
  },
  {
    "text": "Iran's Parliament Votes To Close Straits of Hormuz After US Attacks  —  The Iranian Parliament has voted in support of closing the Strait of Hormuz, one of the world's most critical oil transit chokepoints, according to media reports.  —  Any final decision on retaliation, however … ",
    "url": "https://www.newsweek.com/iran-parliament-vote-close-straits-hormuz-us-attacks-2088968"
  },
  {
    "text": "Bill Clinton Endorses Andrew Cuomo for New York City Mayor  —  The former president's endorsement is the latest example of how establishment Democrats seem to prefer Mr. Cuomo to his prime rival, Zohran Mamdani.  —  Former President Bill Clinton will offer a last-minute boost of support … ",
    "url": "https://www.nytimes.com/2025/06/22/nyregion/bill-clinton-endorse-cuomo-mayor.html?unlocked_article_code=1.Q08.tGef.ms0hR8bCURNQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "GOP Provision That Makes Trump A King Breaks Senate Rules, Says Parliamentarian  —  Language tucked into Republicans' tax bill that makes it too expensive for anyone to sue the Trump administration is likely on its way out.  —  WASHINGTON ― A provision in the GOP's tax-and-spending bill … ",
    "url": "https://www.huffpost.com/entry/gop-tax-bill-courts-bonds-trump-senate-rules_n_685806dee4b05236097fb6ac"
  },
  {
    "text": "Senate parliamentarian greenlights state AI law freeze in GOP megabill  —  Both parties made their arguments before the parliamentarian Thursday.  —  The Senate's rules referee late Saturday allowed Republicans to include in their megabill a 10-year moratorium on enforcing state … ",
    "url": "https://www.politico.com/news/2025/06/22/senate-parliamentarian-greenlights-state-ai-law-freeze-in-gop-megabill-00416499"
  },
  {
    "text": "More Provisions in Republicans' “One Big, Beautiful Bill” Are Subject to Byrd Rule, Parliamentarian Advises  —  WASHINGTON, D.C. - Today, further advice was provided by the Senate Parliamentarian that provisions in the Republican “One Big, Beautiful Bill” violate the Senate's Byrd Rule … ",
    "url": "https://www.budget.senate.gov/ranking-member/newsroom/press/more-provisions-in-republicans-one-big-beautiful-bill-are-subject-to-byrd-rule-parliamentarian-advises"
  },
  {
    "text": "EXCLUSIVE: The Onion calls out ‘cowardice’ of Congress in full-page NYT ad  —  The ad features a scathing editorial, a physical copy of which was sent to all House and Senate members.  —  If you want to support The Handbasket's 100% independent journalism, become a paid subscriber or leave a tip.",
    "url": "https://www.thehandbasket.co/p/exclusive-the-onion-nyt-ad-congress-cowardice"
  },
  {
    "text": "Republican's Life-Threatening Pregnancy Collided With Florida's Abortion Politics  —  Due in August with her first child, Rep. Kat Cammack says doctors last year hesitated to treat her ectopic pregnancy  —  Rep. Kat Cammack arrived at the emergency room in May 2024 terrified by what she had just learned … ",
    "url": "https://www.wsj.com/politics/policy/republicans-life-threatening-pregnancy-collided-with-floridas-abortion-politics-ad96f8d4"
  }
]