[
  {
    "text": "Sen. Mark Warner seeks to assemble group of Democratic senators to ask Biden to exit race  —  There's increasing sentiment among Democratic senators that Biden cannot stay in the race.  —  Sen. Mark R. Warner (D-Va.) is attempting to assemble a group of Democratic senators to ask Joe Biden … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/05/mark-warner-joe-biden-exit-race-democratic-senators/"
  },
  {
    "text": "Behind the Curtain: Trump's Kamala Harris plan … President Biden insisted again Thursday in an unscripted remark, after a supporter at a Fourth of July event on the White House South Lawn yelled that they needed him, and to keep up the fight: “You got me, man!  I'm not going anywhere.”",
    "url": "https://www.axios.com/2024/07/05/behind-the-curtain-trumps-kamala-harris-plan"
  },
  {
    "text": "Democrats start moving to Harris as Biden digs in  —  Amid the ongoing fallout from Joe Biden's debate performance, talk in many top Democratic circles has already moved to who Kamala Harris' running mate would be.  —  That's how certain a widening group of leading party officials … ",
    "url": "https://www.cnn.com/2024/07/05/politics/kamala-harris-democrats-biden/"
  },
  {
    "text": "Trump stays relatively quiet, unseen as Biden struggles to save political future  —  “We're trying something new and shutting up,” one source said of the strategy.  —  Former President Donald Trump attends the LIV Golf Miami Tournament, April 7, 2024, in Doral, Florida.",
    "url": "https://abcnews.go.com/Politics/trump-stays-quiet-unseen-biden-struggles-save-political/story?id=111693816"
  },
  {
    "text": "Trump torches Heritage Foundation's Project 2025 … - Trump's disavowal comes two days after Heritage Foundation president Kevin Roberts drew outrage from Democrats with his comments about a “second American Revolution” on Steve Bannon's radio show.  — “[W]e are in the process … ",
    "url": "https://www.axios.com/2024/07/05/trump-project-2025-heritage-foundation"
  },
  {
    "text": "MAGA ‘freak out’ starts as Trump game plan threatens to ‘backfire’: analyst  —  A controversial campaign tactic is backfiring on former President Donald Trump as powerful celebrities warn of a imminent authoritarian regime that could put an end to “recreational sex” as part of a “fascistic game plan … ",
    "url": "https://www.rawstory.com/trump-project-2025-2668691343/"
  },
  {
    "text": "Donald Trump Claims Republicans' Project 2025 has Nothing to Do With Him: ‘Abysmal’  —  OK, SURE  —  The 900-page conservative wish-list includes a massive abortion crackdown.  Now Trump claims he knows nothing about it.  —  Donald Trump rushed to distance himself from the Republicans … ",
    "url": "https://www.thedailybeast.com/donald-trump-claims-republicans-project-2025-has-nothing-to-do-with-him-abysmal"
  },
  {
    "text": "Project 2025 was supposed to boost Donald Trump's campaign — but it may be backfiring instead  —  Trump's authoritarian game plan is breaking through the post-debate noise and it's starting to scare people  —  When Project 2025 was released, a number of progressives expressed surprise … ",
    "url": "https://www.salon.com/2024/07/05/project-2025-was-supposed-to-boost-donald-campaign--but-it-may-be-backfiring-instead/"
  },
  {
    "text": "Biden staff “miserable,” alarmed as pressure builds … “Even if you're trying to focus on work, nothing is going to break through or get any acknowledgment” from bosses.  —  A high-ranking Democratic National Committee official told Axios: “The only thing that can really allay concerns … ",
    "url": "https://www.axios.com/2024/07/05/biden-staffs-white-house-dnc-campaign-miserable-2024"
  },
  {
    "text": "MAGA Gov Candidate's Ugly, Hateful Rant: “Some Folks Need Killing!”  —  Mark Robinson, the extremist GOP nominee for governor in North Carolina, appeared to endorse political violence in a bizarre and extended rant he delivered on June 30 in a small-town church.  —  “Some folks need killing!”",
    "url": "https://newrepublic.com/article/183443/mark-robinson-north-carolina-gov-candidate-hateful-rant-killing"
  },
  {
    "text": "Kansas Supreme Court Strikes Down Two Anti-Abortion Laws  —  The pair of 5-1 decisions suggests that other abortion restrictions — even ones decades on the books — might not withstand legal challenges.  —  LOADING  —  Kansas' highest court strongly reaffirmed Friday … ",
    "url": "https://www.huffpost.com/entry/kansas-abortion-laws-supreme-court_n_66882b22e4b0c732b46232fb"
  },
  {
    "text": "Boxer Who Showed off to Donald and Barron Trump Banned for Racist Rant  —  KNOCKOUT BLOW  —  Ryan Garcia shadow boxed in front of the ex-president and son Barron at Mar-a-Lago but is now banned from his sport.  —  A top-ranked prize fighter who put on a shadow boxing display … ",
    "url": "https://www.thedailybeast.com/boxer-ryan-garcia-who-showed-off-to-donald-and-barron-trump-banned-for-racist-rant"
  },
  {
    "text": "Wisconsin Supreme Court changes course, will allow expanded use of ballot drop boxes this fall  —  MADISON, Wis. (AP) — The Wisconsin Supreme Court ruled Friday that officials can place ballot drop boxes around their communities in this fall's elections, overturning its own ruling … ",
    "url": "https://apnews.com/article/wisconsin-supreme-court-ballot-drop-boxes-2024-9d3973ea65b78436df478e7d8ae28cce"
  },
  {
    "text": "Trump seeks new pause in classified documents case, citing Supreme Court's immunity ruling  —  Trump is trying to wield immunity as a shield in all of criminal cases.  —  Donald Trump says the Supreme Court's ruling that he has blanket immunity from prosecution for his “official acts” … ",
    "url": "https://www.politico.com/news/2024/07/05/trump-immunity-classified-documents-00166653"
  },
  {
    "text": "‘The claims are just outrageous’: Republican ex-governor condemns Arizona election lies  —  Jan Brewer has had it with election denialism - and she's speaking out to defend poll workers across the political divide  —  The fight for democracy is supported by",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/05/arizona-election-denialism-jan-brewer"
  }
]