[
  {
    "text": "Poll: 49% of Independents think Trump should drop out post-guilty verdict … - 49% of Independents and 15% of Republicans said Trump should end his campaign because of the conviction.  — The polls found the race effectively tied nationally in a 1-on-1 with Biden at 45% and Trump at 44%.",
    "url": "https://www.axios.com/2024/06/01/poll-trump-conviction-election-independent-voters"
  },
  {
    "text": "More than half of voters approve of Donald Trump's New York conviction  —  But a vast majority of Republicans want Trump to stay in the race against President Joe Biden, according to a new survey conducted after the jury's verdict … Many Americans support the New York jury's decision … ",
    "url": "https://pro.morningconsult.com/analysis/donald-trump-polling-guilty-verdict-jury-trial"
  },
  {
    "text": "Biden goes all-in on calling Trump a “convicted felon” … - It also marked a departure from Biden's approach in remarks at the White House hours earlier, when he danced around the “convicted felon” label while criticizing Trump's attack on the U.S. justice system.",
    "url": "https://www.axios.com/2024/06/01/biden-trump-convicted-felon-2024-election"
  },
  {
    "text": "Exclusive: One in 10 Republicans less likely to vote for Trump after guilty verdict, Reuters/Ipsos poll finds  —  Ten percent of Republican registered voters say they are less likely to vote for Donald Trump following his felony conviction for falsifying business records to cover … ",
    "url": "https://www.reuters.com/world/us/one-10-republicans-less-likely-vote-trump-after-guilty-verdict-reutersipsos-poll-2024-05-31/"
  },
  {
    "text": "Trump Has Few Ways to Overturn His Conviction as a New York Felon  —  New York appellate courts rarely overturn a jury decision without evidence of serious errors.  The judge in Donald J. Trump's case closed off many avenues.  —  “This is long from over,” Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/06/01/nyregion/trump-appeal-conviction.html"
  },
  {
    "text": "Donald Trump's attorney was ‘shocked’ the former president took the verdict with ‘solemnness’  —  Donald Trump's lawyer told The Associated Press he was surprised at Trump's stoic demeanor as he listened to the verdict that made him the first former U.S. president convicted of a crime.",
    "url": "https://apnews.com/article/trump-todd-blanche-4361e2bd70c287f38ba68b920e13ff81"
  },
  {
    "text": "This reluctant prosecutor just made Donald Trump a felon  —  Alvin Bragg convicted Trump — winning praise on the left, scorn on the right and a spot in history.  —  NEW YORK — Manhattan District Attorney Alvin Bragg won more than just the case when a jury found Donald Trump guilty of 34 felony counts.",
    "url": "https://www.politico.com/news/2024/06/01/alvin-bragg-prosecutor-trump-trial-impact-00161112"
  },
  {
    "text": "Romney scorches Bragg's ‘political decision’ in Trump case: ‘Malpractice’  —  ‘Democrats think they can put out the Trump fire with oxygen,’ Romney said.  —  Join Fox News for access to this content  —  Sen. Mitt Romney, R-Utah, said Manhattan District Attorney Alvin Bragg committed … ",
    "url": "https://www.foxnews.com/politics/romney-bragg-political-decision-trump-case-malpractice"
  },
  {
    "text": "Exclusive: Inside Hunter Biden's secret legal battle … - The trials — the gun case that starts Monday in Delaware and the tax case set for Sept. 5 in California — are likely to include embarrassing revelations about the Biden family that almost certainly will be touted by Republicans in light of Donald Trump's felony conviction.",
    "url": "https://www.axios.com/2024/06/01/hunter-biden-court-trial-2024-election"
  },
  {
    "text": "Study: Same-sex marriage in 20 years had no negative effects … - For Pride Month this year, Axios will examine the legacy of the Massachusetts decision and see where marriage equity is at risk if there is an attempt to reverse the landmark 2015 U.S. Supreme Court ruling.",
    "url": "https://www.axios.com/2024/06/01/same-sex-marriage-us-20-years-pride-month"
  },
  {
    "text": "'He's Had Great Challenges': Giuliani Holds 80th Birthday Amid Many Woes  —  The indicted and increasingly isolated former New York mayor celebrated his birthday over pasta and meatballs.  Donald J. Trump sent a video.  —  Consider this Midtown split screen.",
    "url": "https://www.nytimes.com/2024/06/01/us/politics/rudy-giuliani-birthday-donald-trump-new-york.html"
  },
  {
    "text": "Remarks by President Biden on the Middle East  —  THE PRESIDENT:  Hello, folks.  —  (The President checks his watch.)  Just checking it's afternoon.  (Laughter.)  Good afternoon.  Before I begin my remarks, I just wanted to say a few words about what happened yesterday in New York City.",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2024/05/31/remarks-by-president-biden-on-the-middle-east-2/"
  },
  {
    "text": "Retired Navy Admiral and Business Executives Arrested for Bribery Scheme  —  For Immediate Release  —  A retired Navy Admiral and two business executives were arrested today on criminal charges related to their roles in a bribery scheme that involved a U.S. government contract.",
    "url": "https://www.justice.gov/opa/pr/retired-navy-admiral-and-business-executives-arrested-bribery-scheme"
  },
  {
    "text": "For Michael Cohen and Stormy Daniels, a ‘vindicating’ moment at last  —  Trump's guilty verdict is welcomed by two unlikely star witnesses who faced years of doubt and derision.  —  The jury that found former president Donald Trump guilty of 34 felony charges delivered not only a historic verdict … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/01/michael-cohen-stormy-daniels-trump-guilty/"
  }
]