[
  {
    "text": "New Marquette Law School Poll national survey finds Harris leading Trump and outperforming Biden against Trump; enthusiasm to vote among Democrats having risen substantially  —  MILWAUKEE - A new Marquette Law School Poll national survey finds Vice President Kamala Harris is the choice … ",
    "url": "https://law.marquette.edu/poll/2024/08/07/mlspsc21-release/"
  },
  {
    "text": "Trump complains about campaign as advisers try to focus on attacking Harris  —  The GOP nominee has grown increasingly upset about Kamala Harris's surging poll numbers and media coverage since replacing Joe Biden on the ticket.  —  Donald Trump's candidacy appeared all but destined for victory only weeks ago.",
    "url": "https://www.washingtonpost.com/politics/2024/08/07/trump-election-campaign/"
  },
  {
    "text": "Harris's Rise Has Unsettled Trump, Who Is Struggling to Focus, Supporters Say  —  Donald J. Trump's allies want him to talk about the issues, but he seems distracted by Kamala Harris's burst of momentum.  —  Former President Donald J. Trump dialed into “Fox & Friends” on Wednesday morning … ",
    "url": "https://www.nytimes.com/2024/08/08/us/politics/trump-harris-campaign.html"
  },
  {
    "text": "Biden “not confident” Trump will accept 2024 election results  —  President Biden said he is “not confident at all” that there will be a peaceful transfer of power in January 2025 if former President Donald Trump is defeated.  —  “He means what he says.  We don't take him seriously.  He means it.",
    "url": "https://www.cbsnews.com/news/biden-on-dropping-out-2024-race-donald-trump-cbs-sunday-morning-exclusive-interview/"
  },
  {
    "text": "Trump Says He Will Hold a News Conference at Mar-a-Lago on Thursday  —  The former president's prominence in news coverage has slipped since President Biden withdrew from the race and endorsed Vice President Kamala Harris.  —  Donald J. Trump plans to hold a “general news conference” … ",
    "url": "https://www.nytimes.com/2024/08/08/us/politics/trump-news-conference.html"
  },
  {
    "text": "Vibes and Polls and Positioning of the Harris Candidacy  —  Trump campaign staffers may be able to define her if she doesn't beat them to the punch.  —  As I wrote Tuesday, Kamala Harris passed on an opportunity to define herself as a moderate when she selected the progressive favorite Tim Walz … ",
    "url": "https://www.nytimes.com/2024/08/08/upshot/kamala-harris-polls-vibes.html"
  },
  {
    "text": "JD Vance's TikTok flop  —  BALANCE OF POWER — When Kamala Harris opened her own personal TikTok account in late July, separate from her existing campaign account, within days she received millions of likes and hundreds of thousands of supportive comments welcoming her to the app.",
    "url": "https://www.politico.com/newsletters/politico-nightly/2024/08/07/jd-vances-tiktok-flop-00172378"
  },
  {
    "text": "Why Harris isn't taking questions  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  —  There is a line in the movie “Bull Durham” where CRASH DAVIS, the sage journeyman catcher played by KEVIN COSTNER, tells “NUKE” LaLOOSH … ",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/08/07/why-harris-isnt-taking-questions-00173115"
  },
  {
    "text": "BREAKING: The New York Times helps JD Vance Swiftboat Tim Walz  —  Tim Walz “enlisted Army National Guard in Nebraska in 1981 and retired honorably in 2005,” according to his military records.  Months after Tim Walz retired from the Army National Guard in 2005, his unit received orders to deploy to Iraq.",
    "url": "https://www.findinggravity.net/p/breaking-the-new-york-times-helps"
  },
  {
    "text": "Tim Walz's military record, National Guard departure get new scrutiny  —  The Harris-Walz campaign has cited his Army experience as an asset.  But Republicans and some who served with him have questioned claims about his service.  —  Tim Walz was weighing a life-altering decision when he stepped … ",
    "url": "https://www.washingtonpost.com/elections/2024/08/07/tim-walz-military-record/"
  },
  {
    "text": "Tim Walz's normal dad energy is causing MAGA to come unglued  —  Walz is the opposite of weird: Kamala Harris' running mate shows masculinity can be about love and not hate  —  In their first go-round in attacking Gov. Tim Walz, the Donald Trump campaign bet that maximum hyperbole … ",
    "url": "https://www.salon.com/2024/08/08/tim-walzs-normal-energy-is-causing-maga-to-come-unglued/"
  },
  {
    "text": "Elon Musk shares fake news claiming UK rioters will be sent to ‘detainment camps’  —  LONDON — Elon Musk is at it again.  —  Amid an ongoing feud with the British government about unrest on the country's streets, the billionaire X owner boosted, and then deleted, an entirely-manufactured … ",
    "url": "https://www.politico.eu/article/elon-musk-share-fake-news-uk-rioters-detainment-camp/"
  },
  {
    "text": "CNN's Media Chronicler Strikes Out on His Own  —  Oliver Darcy is starting a subscription-based news site dedicated to covering the media industry, joining a crowded field.  —  Just how big is the market for news about the news?  —  That's a question that Oliver Darcy, a veteran media reporter, is poised to answer.",
    "url": "https://www.nytimes.com/2024/08/08/business/media/oliver-darcy-status-media.html"
  },
  {
    "text": "Steve Martin turns down Walz role on ‘SNL’: 'I'm not an impressionist'  —  Comedian and actor Steve Martin has reportedly turned down the role of Minnesota Gov. Tim Walz (D) on “Saturday Night Live” (SNL).  —  Martin, according to the Los Angeles Times, was reached out to by the show's executive producer … ",
    "url": "https://thehill.com/blogs/in-the-know/4818107-steve-martin-tim-walz-saturday-night-live-role/"
  },
  {
    "text": "Presidential Campaign Reset: Arizona, Georgia and Nevada Move From Lean Republican to Toss Up  —  Three weeks ago, Donald Trump was leading President Joe Biden in the Cook Political Report national vote tracker by about 2.5%.  Today, Kamala Harris leads Trump by less than one point … ",
    "url": "https://www.cookpolitical.com/analysis/national/national-politics/presidential-campaign-reset-arizona-georgia-and-nevada-move"
  },
  {
    "text": "‘I think this settles it’: Vance busted over resurfaced post jabbing ‘undisputed war hero’  —  A two-year-old social media post written by Sen. J.D. Vance (R-OH) resurfaced on Wednesday, and it's not helping his campaign for vice president.  —  During his candidacy for the Senate in 2022 … ",
    "url": "https://www.rawstory.com/news/j-d-vance-2668920972/"
  },
  {
    "text": "‘Massive disinformation campaign’ is slowing global transition to green energy  —  UN says a global ‘backlash’ against climate action is being stoked by fossil fuel companies  —  Fossil fuel companies are running “a massive mis- and disinformation campaign” so that countries will slow … ",
    "url": "https://www.theguardian.com/environment/article/2024/aug/08/fossil-fuel-industry-using-disinformation-campaign-to-slow-green-transition-says-un"
  },
  {
    "text": "Tim Walz's Sudden Rise in the Democratic Party Was No Accident  —  More than a year ago, Tim Walz and his aides decided to be ready in case an irresistible opportunity arose.  Their tightly held strategy helped them catch political lightning in a bottle.  —  Shortly after the 2022 midterms … ",
    "url": "https://www.nytimes.com/2024/08/07/us/politics/tim-walz-kamala-harris-2024.html"
  }
]