[
  {
    "text": "How the US economy went from booming to a recession scare in only 20 days  —  New York CNN  —  Just 20 days ago, the US stock market was sitting at all-time highs.  The US economy appeared to be growing at a solid pace.  And a recession was nowhere in sight.  —  Now, the R-word is seemingly everywhere.",
    "url": "https://www.cnn.com/2025/03/11/business/recession-economy-trump-dow-stocks/"
  },
  {
    "text": "This Is the Greatest Threat to Free Speech Since the Red Scare  —  On Saturday, immigration agents showed at the apartment building of Mahmoud Khalil, a leader of last year's pro-Palestinian protests at Columbia University, and told him his student visa had been revoked and that he was being detained.",
    "url": "https://www.nytimes.com/2025/03/10/opinion/mahmoud-khalil-free-speech.html?unlocked_article_code=1.204.qmHQ.0t0JSq_Flry5&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Johnson's spending holdouts  —  Presented by IN TODAY'S EDITION:  — Johnson, White House hammer holdouts  — Thune taps a debt-limit whisperer  — More tax complications on GOP agenda  —  EAT LIKE A LAWMAKER — POLITICO Magazine is out this morning with a rundown of where Republicans … ",
    "url": "https://www.politico.com/newsletters/inside-congress/2025/03/11/johnsons-spending-holdouts-00223195"
  },
  {
    "text": "Trump vows to ‘lead the charge’ to oust Massie  —  President Trump is vowing to “lead the charge” to unseat Republican Rep. Thomas Massie (Ky.), who has said he will not support the GOP's short-term government funding bill ahead of Friday's shutdown deadline.",
    "url": "https://thehill.com/homenews/administration/5187685-trump-threatens-massie-re-election/"
  },
  {
    "text": "Musk Melts Down as Tesla Stock Price Plunges  —  The electric vehicle company has become a toxic brand as its CEO wreaks havoc in Washington … But mixed in were a number of posts about Tesla, the electric vehicle manufacturer that still counts him as CEO despite his seemingly full … ",
    "url": "https://www.rollingstone.com/culture/culture-news/musk-tesla-stock-price-plunge-1235292855/"
  },
  {
    "text": "Justice Dept. Official Says She Was Fired After Opposing Restoring Mel Gibson's Gun Rights  —  Elizabeth G. Oyer, the former pardon attorney, said that she was not told why she was dismissed, but that as events unfolded she feared they might lead to her firing.",
    "url": "https://www.nytimes.com/2025/03/10/us/politics/justice-department-mel-gibson.html?unlocked_article_code=1.3E4.9xqZ.oziqQOWfRdAK"
  },
  {
    "text": "His Daughter Was America's First Measles Death in a Decade  —  A visit with a family in mourning  —  Peter greeted me in the mostly empty gravel parking lot of a Mennonite church on the outskirts of Seminole, a small city in West Texas surrounded by cotton and peanut fields.",
    "url": "https://www.theatlantic.com/health/archive/2025/03/texas-measles-outbreak-death-family/681985/"
  },
  {
    "text": "Kennedy Links Measles Outbreak to Poor Diet and Health, Citing Fringe Theories  —  In a recent interview, the health secretary also suggested that the measles vaccine had harmed children in West Texas, center of an outbreak.  —  In a sweeping interview, Robert F. Kennedy Jr. … ",
    "url": "https://www.nytimes.com/2025/03/10/health/measles-texas-kennedy-fox.html?unlocked_article_code=1.204.sAQR.wAUh7GrZlYMr&smid=url-share"
  },
  {
    "text": "Trump Administration Live Updates: President Escalates Confrontation With Canada  —  Where Things Stand  — Confronting Canada: President Trump said in a social media post on Tuesday morning that he would impose an additional 25 percent tariff on steel and aluminum coming from Canada … ",
    "url": "https://www.nytimes.com/live/2025/03/11/us/trump-news"
  },
  {
    "text": "Former President Rodrigo Duterte arrested in the Philippines on an ICC warrant over drug killings  —  Former Philippine President Rodrigo Duterte was arrested Tuesday on a warrant from the International Criminal Court accusing him of crimes against humanity over deadly anti-drugs crackdowns … ",
    "url": "https://apnews.com/article/rodrigo-duterte-manila-philippines-icc-9b9d08b8832b43282db53418535fb245"
  },
  {
    "text": "131. Five Questions About the Khalil Case  —  The government's arrest and detention of a pro-Palestinian Columbia student (and green card holder) raises difficult questions about both technical immigration statutes and the First Amendment.  —  Welcome back to “One First,” an (increasingly frequent) … ",
    "url": "https://www.stevevladeck.com/p/131-five-questions-about-the-khalil"
  },
  {
    "text": "Musk eyes Social Security and benefit programs for cuts while claiming widespread fraud  —  Elon Musk pushed debunked theories about Social Security on Monday while describing federal benefit programs as rife with fraud, suggesting they will be a primary target in his crusade to reduce government spending.",
    "url": "https://apnews.com/article/elon-musk-donald-trump-doge-b21b74f56f30012a6450a629e7232a1a"
  },
  {
    "text": "USDA cancels $1B in local food purchasing for schools, food banks  —  States have been notified that they will not receive 2025 funding for schools to buy food from nearby farms.  —  The Agriculture Department has axed two programs that gave schools and food banks money to buy food … ",
    "url": "https://www.politico.com/news/2025/03/10/usda-cancels-local-food-purchasing-for-schools-food-banks-00222796"
  },
  {
    "text": "Judge orders urgent release of DOGE records, citing ‘unprecedented’ power and ‘unusual secrecy’  —  It's the first significant ruling in a growing legal push to pierce DOGE's secretive veil, a decision that undercuts Musk's repeated insistence about the operation's transparency.",
    "url": "https://www.politico.com/news/2025/03/10/judge-orders-doge-record-release-00223151"
  },
  {
    "text": "Dems' own polling shows massive brand problem ahead of 2026  —  The poll's findings will be presented at the House Democratic Caucus Issues Conference on Wednesday.  —  The Democratic Party's brand is in rough shape in the congressional battlegrounds.  —  Nearly two months into the second Donald … ",
    "url": "https://www.politico.com/news/2025/03/11/poll-democrats-jobs-economy-00222988"
  },
  {
    "text": "Washington Post Columnist Resigns After Paper Spiked Criticism of Jeff Bezos  —  Ruth Marcus, a longtime columnist at The Post, said its publisher refused to run her critique of the new focus for the paper's opinion section.  —  Ruth Marcus, a columnist and editor for The Washington Post's opinion section … ",
    "url": "https://www.nytimes.com/2025/03/10/business/media/washington-post-ruth-marcus-resigns.html"
  },
  {
    "text": "Ukraine Targets Moscow With Large-Scale Drone Attack  —  The mayor of the Russian capital called the attack the war's largest against the city.  It appeared to be a reminder of Ukraine's power to strike as its president proposes an air truce.  —  Russian officials said Ukraine attacked Moscow … ",
    "url": "https://www.nytimes.com/2025/03/11/world/europe/ukraine-russia-moscow-war-drones.html"
  },
  {
    "text": "What Really Happened With the DDoS Attacks That Took Down X  —  Elon Musk said a “massive cyberattack” disrupted X on Monday and pointed to “IP addresses originating in the Ukraine area” as the source of the attack.  Security experts say that's not how it works.",
    "url": "https://www.wired.com/story/x-ddos-attack-march-2025/"
  },
  {
    "text": "Vance gives hard sell for spending patch to House Republicans  —  Vice President JD Vance told House Republicans hours ahead of an expected vote on a seven-month funding patch on Tuesday that Republicans will take the blame for a government shutdown if they don't pass the legislation … ",
    "url": "https://www.politico.com/live-updates/2025/03/11/congress/jd-vance-house-gop-shutdown-stopgap-00223400"
  },
  {
    "text": "Pleas on X, Biden dirt and attacks on the FBI: As Trump flexes his pardon powers, defendants angle for their get-out-of-jail free card  —  White-collars defendants are responding in droves as the president opens the door to more clemency.  —  President Donald Trump's moves to expand the use … ",
    "url": "https://www.politico.com/news/2025/03/11/trump-pardons-white-collar-defendant-interest-00219801"
  },
  {
    "text": "‘Unlawful’ suspension of USAID funding probably violated Constitution, judge says  —  The Trump administration probably violated separation of powers by withholding nearly $2 billion in Congress-approved foreign aid funds, a U.S. district judge ruled.  —  A U.S. district judge ruled Monday … ",
    "url": "https://www.washingtonpost.com/nation/2025/03/11/usaid-foreign-funding-suspension-unlawful/"
  },
  {
    "text": "How Eric Adams Has Backed a Secretive NYPD Unit Ridden With Abuses  —  After NYPD officials warned about a unit's aggressive policing, the mayor boosted the team led by his allies.  “The unit effectively reported directly to City Hall,” a former police official said.",
    "url": "https://www.propublica.org/article/eric-adams-nypd-community-response-team-police-nyc-misconduct-transparency"
  },
  {
    "text": "The Economic Excuse Industry is Booming  —  No, we don't need an economic “detox”  —  First, we got big promises.  Now we're getting lame excuses.  However, one thing has been consistent about Donald Trump's economic rhetoric: rank dishonesty.  —  Trump made a lot of extravagant economic … ",
    "url": "https://paulkrugman.substack.com/p/the-economic-excuse-industry-is-booming"
  }
]