[
  {
    "text": "Jen Rubin exits Washington Post, joins Norm Eisen to launch new outlet countering ‘authoritarian threat’  —  New York CNN  —  Veteran opinion columnist Jennifer Rubin is becoming the latest in a long list of Washington Post figures to leave the troubled institution.",
    "url": "https://www.cnn.com/2025/01/13/media/jennifer-rubin-norm-eisen-contrarian-washington-post/"
  },
  {
    "text": "I Have Resigned from The Washington Post, effective today  —  Corporate and billionaire owners of major media outlets have betrayed their audiences' loyalty and sabotaged journalism's sacred mission — defending, protecting and advancing democracy.  The Washington Post's billionaire owner … ",
    "url": "https://contrarian.substack.com/p/i-have-resigned-from-the-washington"
  },
  {
    "text": "Begun, the MAGA Wars Have  —  1. #TeamBannon  —  Over the weekend Steve Bannon unleashed on Elon Musk: … That was Bannon's marker.  His actual critique of Musk?  Buckle up, Francis. … Bannon went on to describe Musk's preferred objective as “techno-feudalism.”  —  Some observations:",
    "url": "https://www.thebulwark.com/p/begun-the-maga-wars-have-133"
  },
  {
    "text": "Judge to allow release of Jack Smith's report on Trump election interference case  —  The section of Jack Smith's report that deals with Donald Trump's actions on Jan. 6 and his efforts to overturn his 2020 election loss could be released as soon as Tuesday.",
    "url": "https://www.nbcnews.com/politics/justice-department/judge-allow-release-jack-smiths-report-trump-election-interference-cas-rcna186829"
  },
  {
    "text": "Judge clears way for partial release of special counsel's report on Trump investigations  —  Washington — A federal judge on Monday cleared the way for the Justice Department to release one of the two volumes that make up special counsel Jack Smith's final report detailing his investigations into President-elect Donald Trump.",
    "url": "https://www.cbsnews.com/news/jack-smith-trump-report-special-counsel-2020-election/"
  },
  {
    "text": "Incoming Trump Team Is Questioning National Security Council Staff Over Loyalty  —  Nonpolitical career civil servants are reportedly being grilled over who they voted for, their political contributions and more.  —  LOADING  —  Incoming senior Trump administration officials … ",
    "url": "https://www.huffpost.com/entry/donald-trump-nsc-loyalty-questions_n_6785077ae4b038251e9354a1"
  },
  {
    "text": "Rachel Maddow Will Return to Nightly Shows on MSNBC for Trump's First 100 Days  —  The cable news network rejiggers its prime-time lineup ahead of Donald Trump's second stint in the White House.  —  Rachel Maddow pared back her on-air schedule during President Biden's time in office … ",
    "url": "https://www.nytimes.com/2025/01/13/us/politics/rachel-maddow-msnbc-trump.html?unlocked_article_code=1.o04.P6rG.0IDsxxyahe7E&smid=url-share"
  },
  {
    "text": "In Praise of California  —  It has its flaws — what place doesn't? — but it plays a big role in America's greatness  —  One of the unwritten rules of American politics is that it's OK to sneer at and smear our big cities and the people who live in them, while it's an outrageous act … ",
    "url": "https://paulkrugman.substack.com/p/in-praise-of-california"
  },
  {
    "text": "Trump's thuggish response to the California fires is a bad omen  —  Southern California is experiencing its most devastating winter fire season in more than 40 years.  As of Sunday, ongoing wildfires have destroyed more than 12,000 homes and killed at least 24 people while burning through an area larger than San Francisco.",
    "url": "https://www.publicnotice.co/p/trump-california-wildfires-response-newsom"
  },
  {
    "text": "House Republicans and Trump discuss tying California wildfire aid to debt ceiling  —  The current California fires could become the costliest natural disaster in U.S. history.  —  A group of House Republicans and President-elect Donald Trump talked about tying wildfire aid … ",
    "url": "https://www.politico.com/news/2025/01/13/house-republicans-trump-wildfire-aid-00197766"
  },
  {
    "text": "How Lagging Vaccination Could Lead to a Polio Resurgence  —  In its original form, the virus survives in just two countries.  But a type linked to an oral vaccine used in other nations has already turned up in the West.  —  Most American parents hardly give thought to polio beyond the instant … ",
    "url": "https://www.nytimes.com/2025/01/13/health/polio-vaccine-outbreaks.html?unlocked_article_code=1.o04.0LDE.6-Avucxzh7Ab&smid=url-share"
  },
  {
    "text": "Don't Call Kennedy a Vaccine Skeptic.  Call Him What He Is: A Cynic.  —  The news media labels Robert F. Kennedy Jr. a “vaccine skeptic.”  He's not.  I'm an actual vaccine skeptic.  In fact, everyone who serves with me on the Food and Drug Administration's vaccine advisory committee is a vaccine skeptic.",
    "url": "https://www.nytimes.com/2025/01/13/opinion/rfk-jr-is-a-vaccine-cynic.html?unlocked_article_code=1.o04.Z733.bTqiMVnTMqsm&smid=url-share"
  },
  {
    "text": "NVIDIA Statement on the Biden Administration's Misguided ‘AI Diffusion’ Rule  —  For decades, leadership in computing and software ecosystems has been a cornerstone of American strength and influence worldwide.  The federal government has wisely refrained from dictating the design … ",
    "url": "https://blogs.nvidia.com/blog/ai-policy/"
  },
  {
    "text": "Suspect arrested with ‘flamethrower’ near LA Fire is an illegal immigrant: sources  —  The homeless man tackled and zip-tied by onlookers who say he was trying to start fires with a blowtorch near a Los Angeles wildfire is an illegal immigrant who will likely be protected by California's sanctuary city status, according to sources.",
    "url": "https://nypost.com/2025/01/13/us-news/suspect-arrested-with-flamethrower-near-kenneth-fire-is-an-illegal-immigrant-report/"
  },
  {
    "text": "The people should own the town square  —  For any enquiry regarding this announcement, please contact press@joinmastodon.org  —  Mastodon was founded on the principles that people should be able to control their social circle online, curate their own timeline, and convene freely with any community of their choosing.",
    "url": "https://blog.joinmastodon.org/2025/01/the-people-should-own-the-town-square/"
  },
  {
    "text": "Before Taking Office, L.A.'s Mayor Said She Would Not Go Abroad  —  Mayor Karen Bass of Los Angeles has been criticized for being out of the country when the wildfires broke out.  Three years ago, she promised in an interview to cut back on her world travel and focus on the city.",
    "url": "https://www.nytimes.com/2025/01/12/us/karen-bass-ghana-wildfire-travel-los-angeles.html"
  },
  {
    "text": "Meta Is Blocking Links to Decentralized Instagram Competitor Pixelfed  —  Pixelfed said it is “seeing unprecedented levels of traffic.”  —  Meta is deleting links to Pixelfed, a decentralized Instagram competitor.  On Facebook, the company is labeling links to Pixelfed.social as “spam” and deleting them immediately.",
    "url": "https://www.404media.co/meta-is-blocking-links-to-decentralized-instagram-competitor-pixelfed/"
  },
  {
    "text": "Trump's deportation vows only for ‘rabid’ Republicans and will fail, says Newt Gingrich  —  Former US House speaker says documented people, Dreamers, mothers and children must not be deported  —  Newt Gingrich, the former US House speaker and presidential hopeful, said a section … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/13/trump-immigration-newt-gingrich"
  },
  {
    "text": "Statement from President Joe Biden on Approving Student Debt Cancellation for Over 5 Million Americans  —  Today, my Administration is approving student loan relief for more than 150,000 borrowers - bringing the total number of Americans who have had their student debt cancelled by my Administration to over 5 million.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/13/statement-from-president-joe-biden-on-approving-student-debt-cancellation-for-over-5-million-americans/"
  },
  {
    "text": "Republicans Considering Cutting SNAP Benefits As Part Of Deficit Reduction Plan  —  The proposed cut would reverse a permanent boost put in place by President Joe Biden.  —  LOADING  —  WASHINGTON — More than 22 million households could see their food budgets shrink as part of the Republican agenda to reduce federal spending.",
    "url": "https://www.huffpost.com/entry/republicans-snap-cuts_n_67854e1be4b038251e938a35"
  },
  {
    "text": "Defense pick Pete Hegseth repeatedly criticized removing names of Confederate generals from US bases  —  Pete Hegseth, President-elect Donald Trump's pick for secretary of defense, has voiced strong opposition to removing the names of Confederate generals from US military bases, repeatedly saying the names should be changed back.",
    "url": "https://www.cnn.com/2025/01/13/politics/pete-hegseth-confederate-generals-military-bases/"
  },
  {
    "text": "Carrie Underwood to perform at Trump's inauguration … - The Armed Forces Chorus and the United States Naval Academy Glee Club will accompany her.  — A representative from CAA, which represents Underwood, did not provide Axios with comment before publication.",
    "url": "https://www.axios.com/2025/01/13/carrie-underwood-trump-inauguration"
  }
]