[
  {
    "text": "Graham breaks with Trump on national abortion ban  —  Sen. Lindsey Graham (R-S.C.) broke with former President Trump Monday over Trump's decision to back away from endorsing a national 15-week abortion ban, declaring that leaving the issue entirely to the states “runs contrary to an American consensus … ",
    "url": "https://thehill.com/homenews/senate/4580756-graham-trump-abortion-ban/"
  },
  {
    "text": "Anti-abortion groups rally behind Trump despite their disappointment  —  “We are deeply disappointed in President Trump's position,” said Marjorie Dannenfelser, president of Susan B. Anthony Pro-Life America.  —  Anti-abortion rights groups are dismayed with Donald Trump for failing to endorse a national ban.",
    "url": "https://www.politico.com/news/2024/04/08/trump-anti-abortion-group-ban-00151037"
  },
  {
    "text": "Trump says abortion should be a states' rights issue, Republicans ‘must also win elections’  —  Trump said what individual states decide “must be the law of the land.”  —  After months of dodging questions about his abortion position, former president Donald Trump rejected calls to endorse … ",
    "url": "https://abcnews.go.com/Politics/trump-abortion-states-rights-issue/story?id=108976038"
  },
  {
    "text": "Biden slams Trump abortion comments: ‘simply lying’  —  President Biden slammed former President Trump on Monday for saying he thinks abortion policies are best left to the states, and for the presumptive GOP presidential nominee's role in overturning Roe v. Wade.",
    "url": "https://thehill.com/homenews/administration/4580772-biden-slams-trump-abortion-comments/"
  },
  {
    "text": "Trump's $175 Million Bond Is Even Shadier Than It Looks  —  BOILERPLATE  —  New information shows that the insurance company that swooped in and bailed out Trump with a $175 million bond isn't on a list of vetted companies—and wrote a bizarre contract.",
    "url": "https://www.thedailybeast.com/trumps-dollar175-million-bond-is-even-shadier-than-it-looks"
  },
  {
    "text": "Jamie Dimon on Ukraine: Staying on sidelines not an option  —  JP Morgan Chase CEO Jamie Dimon, a key voice in U.S. business and finance circles, said the U.S. cannot stand on the sidelines in Ukraine's fight against Russia, pushing back on calls from some in the GOP to pull back from the war.",
    "url": "https://thehill.com/business/4580742-jamie-dimon-on-ukraine-staying-on-sidelines-not-an-option/"
  },
  {
    "text": "Trump to Sue Judge in Last-Ditch Attempt to Avert Manhattan Trial  —  Donald J. Trump's lawyers indicated they would file an action asking an appeals court to delay the first prosecution of a former president.  The move is unlikely to succeed.  —  Donald J. Trump, a week away from standing trial … ",
    "url": "https://www.nytimes.com/2024/04/08/nyregion/trump-hush-money-trial-delay.html"
  },
  {
    "text": "RFK Jr.'s New York state director says her ‘No. 1 priority’ is preventing a Biden victory  —  A New York-based campaign official for Robert F. Kennedy Jr. is pitching Republican voters to support his independent presidential bid by arguing that Kennedy will help Donald Trump defeat Joe Biden if he's on the ballot in New York.",
    "url": "https://www.cnn.com/2024/04/08/politics/rfk-jr-new-york-biden-trump/"
  },
  {
    "text": "President Joe Biden Outlines New Plans to Deliver Student Debt Relief to Over 30 Million Americans Under the Biden-Harris Administration  —  Today, Biden-Harris Administration leaders will fan out across the country as President Biden announces his Administration's new plans to cancel student debt for tens of millions of Americans.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/08/president-joe-biden-outlines-new-plans-to-deliver-student-debt-relief-to-over-30-million-americans-under-the-biden-harris-administration/"
  },
  {
    "text": "Donald Trump Fundraiser May Have Broken the Law  —  A fundraising event hosted by a charitable organization and linked to Donald Trump may have broken the law if it explicitly benefited his campaign, as an IRS rule bars charities from endorsing candidates for elections.",
    "url": "https://www.newsweek.com/donald-trump-fundraiser-florida-law-border-foundation-1887858"
  },
  {
    "text": "Men punching random women in NYC: A desperate last gasp of the male rage fueling MAGA  —  Random NYC attacks are an extreme manifestation of men feeling entitled to women's time and attention  —  Men are punching random women on the streets of New York City.",
    "url": "https://www.salon.com/2024/04/08/men-punching-random-women-in-nyc-a-desperate-last-gasp-of-the-male-rage-fueling-maga/"
  },
  {
    "text": "Trump's RNC takeover triggers strife and staff exits as purge partly backfires  —  Presumptive Republican nominee installed allies to run party but loyalty tests have led to weakening of certain areas, including data  —  Donald Trump's allies installed to run the Republican National Committee … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/08/rnc-trump-takeover-republican-strife"
  },
  {
    "text": "Traduzione in lingua inglese  —  Declaration “Dignitas Infinita”  —  on Human Dignity Presentation  —  During the Congresso of 15 March 2019, the then-Congregation for the Doctrine of the Faith decided to commence “the drafting of a text highlighting the indispensable nature of the dignity … ",
    "url": "https://press.vatican.va/content/salastampa/it/bollettino/pubblico/2024/04/08/0284/00588.html#en"
  },
  {
    "text": "Inside the Election Denial Groups Planning to Disrupt November  —  Groups like True the Vote and Michael Flynn's America Project want to mobilize thousands of Trump supporters by pushing baseless claims about election fraud—and are rolling out new technology to fast-track their efforts.",
    "url": "https://www.wired.com/story/election-denial-groups-november-2024/"
  },
  {
    "text": "San Francisco's sticky stolen-goods dilemma  —  THE BUZZ: IN PLAIN SIGHT — Each day in San Francisco, vendors line busy city streets with a plethora of fully packaged items: shampoo, mouth wash, multi-vitamins, deodorant and laundry detergent.  —  Mayor London Breed calls it … ",
    "url": "https://www.politico.com/newsletters/california-playbook/2024/04/08/san-franciscos-sticky-stolen-goods-dilemma-00150984"
  },
  {
    "text": "Trump's Cabinet was in flux.  Biden's has barely changed.  —  Former president Donald Trump saw more turnover in his Cabinet than any other recent president, and it's not close.  President Biden, on the other hand, has had relatively little change in his administration's top roles so far.",
    "url": "https://www.washingtonpost.com/politics/2024/04/08/trump-biden-cabinet-turnover/"
  }
]