[
  {
    "text": "Live Updates: Musk Asserts Without Proof That He's Fixing a Bureaucracy Rife With Fraud  —  The billionaire, chosen by President Trump to lead a federal overhaul, insisted he was working transparently, but his team's secretive actions have delivered shocks across the government.",
    "url": "https://www.nytimes.com/live/2025/02/11/us/president-trump-news?unlocked_article_code=1.wE4.WfgP.YTN1EGV1bPtM&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Hegseth's visit to U.S. base in Germany met with student walkout  —  The civil disobedience by dozens of middle schoolers — and some adults — was aimed at the Trump administration's rollback of DEI initiatives.  —  February 11, 2025  —  Live updates: Trump signs executive order calling on agencies to work with Elon Musk-led group",
    "url": "https://www.washingtonpost.com/national-security/2025/02/11/hegseth-dei-protests-germany/"
  },
  {
    "text": "The Staffers Helping Elon Musk Dismantle and Downsize the U.S. Government, One Agency at a Time  —  Musk and his lieutenants are reshaping the government and its mission with the blessing of President Trump.  ProPublica has confirmed the names and roles of more than 30 staffers affiliated with the billionaire.",
    "url": "https://www.propublica.org/article/elon-musk-doge-staffers-additional-names"
  },
  {
    "text": "AP statement on Oval Office access  —  The Associated Press issued this statement on Tuesday from Executive Editor Julie Pace:  —  As a global news organization, The Associated Press informs billions of people around the world every day with factual, nonpartisan journalism.",
    "url": "https://www.ap.org/the-definitive-source/announcements/ap-statement-on-oval-office-access/"
  },
  {
    "text": "FEMA official ignores judge's latest order, demands freeze on grant funding  —  Federal workers are being swept into the fight between Donald Trump and federal courts, with four FEMA aides fired Tuesday for being “deep state activists.”  —  WASHINGTON — A senior official … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/fema-official-ignores-judge-order-freeze-grant-funding-rcna191674"
  },
  {
    "text": "Top FEMA Official Is Fired Over Payments for N.Y.C. Migrant Shelters  —  The Trump administration fired the Federal Emergency Management Agency's chief financial officer and three others after Elon Musk misleadingly claimed the agency had used disaster-relief funds for migrant services.",
    "url": "https://www.nytimes.com/2025/02/11/nyregion/fema-fired-nyc-migrant-hotels.html"
  },
  {
    "text": "Implementing The President's “Department of Government Efficiency” Workforce Optimization Initiative  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/02/implementing-the-presidents-department-of-government-efficiency-workforce-optimization-initiative/"
  },
  {
    "text": "Not Hyperbole Anymore: Musk Is In Charge of the US Government  —  These are wild times at TPM because they're wild times in the American government.  It's hard to keep up with everything happening from one moment to the next.  I had not had a chance to look at the new DOGE executive order President signed … ",
    "url": "https://talkingpointsmemo.com/edblog/not-hyperbole-anymore-musk-is-in-charge-of-the-us-government"
  },
  {
    "text": "Scoop: Dems “pissed” at liberal groups MoveOn, Indivisible … - “People are pissed,” a senior House Democrat who was at the meeting said of lawmakers' reaction to the calls.  — The Democrat said Jeffries himself is “very frustrated” at the groups, who are trying to stir up a more confrontational opposition to Trump.",
    "url": "https://www.axios.com/2025/02/12/democrats-jeffries-move-on-indivisible-trump"
  },
  {
    "text": "Project 2025 Is Gutting Medical Funding That Helped Russell Vought's Own Kid  —  The National Institutes of Health, the federal government's leading medical research agency, came under attack by Project 2025 well before its architect, Russell Vought, was confirmed to Donald Trump's second-term cabinet … ",
    "url": "https://www.motherjones.com/politics/2025/02/project-2025-vought-medical-funding/"
  },
  {
    "text": "Trump fires USAID inspector general one day after blistering report  —  Paul K. Martin, appointed by President Joe Biden in December 2023, was informed of his dismissal through an email from the White House  —  The White House fired the independent inspector general for the U.S. Agency … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/11/trump-fires-usaid-inspector-general/"
  },
  {
    "text": "Voters Were Right About the Economy.  The Data Was Wrong.  —  Here's why unemployment is higher, wages are lower and growth less robust than government statistics suggest.  —  Before the presidential election, many Democrats were puzzled by the seeming disconnect between “economic reality” … ",
    "url": "https://www.politico.com/news/magazine/2025/02/11/democrats-tricked-strong-economy-00203464"
  },
  {
    "text": "Musk's ‘Doge’ guts nearly $1bn in US education department's research office  —  Cuts in effect wipe out Institute of Education Sciences, one of the country's largest funders of education research  —  Elon Musk and the Trump administration's so-called “department of government efficiency” … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/11/doge-education-department-cuts-trump"
  },
  {
    "text": "Treasury officials: Musk ally ‘mistakenly’ had power to alter payments system  —  The incident prompted an internal forensic investigation that remains ongoing.  —  Treasury Department officials said Tuesday that the agency last week “mistakenly” and “briefly” gave a member of Elon Musk's team … ",
    "url": "https://www.politico.com/news/2025/02/11/musk-ally-mistakenly-power-alter-payments-system-00203714"
  },
  {
    "text": "Appeals court rejects Trump administration bid to reinstate funding freeze  —  The 1st U.S. Circuit Court of Appeals denied the Justice Department's request to pause a judge's order while it challenges the order in court.  —  A federal appeals court on Tuesday rejected the Trump administration's bid … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/appeals-court-rejects-trump-administration-bid-reinstate-funding-freez-rcna191671"
  },
  {
    "text": "Dozens of CFPB Workers Fired in After-Hours Blitz  —  Some affected employees of the Consumer Financial Protection Bureau were notified with an email that addressed them as [EmployeeFirstName][EmployeeLastName], [Job Title], [Division].  —  Dozens of Consumer Finance Protection Bureau employees … ",
    "url": "https://www.wired.com/story/dozens-of-cfpb-workers-terminated-in-after-hours-firing-blitz/"
  },
  {
    "text": "Judge orders HHS, CDC and FDA to restore deleted webpages with health information  —  Washington — A federal judge on Tuesday ordered the Department of Health and Human Services, Centers for Disease Control and Prevention and Food and Drug Administration to restore webpages and data … ",
    "url": "https://www.cbsnews.com/news/judge-orders-hhs-cdc-fda-restore-deleted-webpages-health-information/"
  },
  {
    "text": "Apple Is Renaming Gulf of Mexico to Gulf of America on Maps App  — Change to occur for US users and then roll out globally later  — Move follows Google; Microsoft and MapQuest haven't made shift  —  Apple Inc. is renaming the Gulf of Mexico to Gulf of America on its Maps app … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-11/apple-is-renaming-gulf-of-mexico-to-gulf-of-america-on-maps-app"
  },
  {
    "text": "Elon Musk's Business Empire Scores Benefits Under Trump Shake-Up … Elon Musk controls six companies, including Tesla.  Mr. Musk's companies secured $13 billion in federal contracts over the past five years.Carly Zavala for The New York Times  —  President Trump has been in office less than a month … ",
    "url": "https://www.nytimes.com/2025/02/11/us/politics/elon-musk-companies-conflicts.html?unlocked_article_code=1.wE4.xICu.jhbVQ9KvEjCg&smid=url-share"
  },
  {
    "text": "DOGE teen ran image-sharing site linked to URLs referencing pedophilia and the KKK  —  Edward Coristine, a 19-year-old member of Elon Musk's Department of Government Efficiency (DOGE), launched an image-sharing website in 2021 that featured custom “shitposting” web addresses that redirected to content hosted on his site.",
    "url": "https://www.muskwatch.com/p/doge-teen-ran-image-sharing-site"
  },
  {
    "text": "Federal Agency Fires Staff, Calls It an Error, Fires Them Again  — Small Business Administration workers receive series of emails  — Firings align with Musk's effort to reduce federal workforce  —  President Donald Trump's Small Business Administration told probationary staff members … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-12/trump-sba-tells-staff-it-didn-t-mean-to-fire-them-then-fires-them-the-next-day"
  },
  {
    "text": "President Elon Musk Suddenly Realizes He Might Not Know How to Govern  —  A weekend interaction between Vanity Fair's Molly Jong-Fast and Elon Musk unexpectedly showcased just how little the world's richest man understands about the effects of his slashing spree at the top of the federal government.",
    "url": "https://newrepublic.com/post/191402/president-elon-musk-not-know-cancer-research"
  },
  {
    "text": "Please Don't Use Nancy Mace's So-Called Victim Hotline, Advocates Say  —  On the House floor Monday night—in a speech that was jarring, graphic, and nearly an hour long—Rep. Nancy Mace (R-S.C.) made disturbing allegations of sexual abuse against four men from her home state, one of whom is her ex-fiancé.",
    "url": "https://www.motherjones.com/politics/2025/02/please-dont-use-nancy-maces-so-called-victim-hotline-advocates-say/"
  },
  {
    "text": "Senator Accuses F.B.I. Nominee of Covertly Directing Dismissals  —  A top Democrat demanded an investigation and suggested that the nominee, Kash Patel, may have lied under oath, citing what he described as multiple sources.  —  The top Democrat on the Senate Judiciary Committee … ",
    "url": "https://www.nytimes.com/2025/02/11/us/politics/kash-patel-fbi-durbin.html"
  },
  {
    "text": "Almost $500 million in food is at risk of spoilage after USAID pause, report says  —  Almost $500 million in food aid is at risk of spoilage as it sits in ports, ships and warehouses after funding for the U.S. Agency for International Development, or USAID, was paused by the Trump administration … ",
    "url": "https://www.cbsnews.com/news/usaid-trump-funding-pause-500-million-food-spoilage-risk/?linkId=744832809"
  },
  {
    "text": "Trump DOJ Accused of Deleting Evidence In Jan. 6 Court Cases  —  Videos are mysteriously missing from an online portal that is legally required to house evidence related to Jan. 6 cases, according to a new lawsuit.  —  LOADING  —  Federal courts and judges have repeatedly ordered … ",
    "url": "https://www.huffpost.com/entry/trump-doj-deleting-jan-6-evidence_n_67abbe5de4b0b904f1e2b2d0"
  },
  {
    "text": "Carter introduces bill renaming Greenland  —  WASHINGTON, D.C. - Rep. Earl L.  “Buddy” Carter (R-GA) released the following statement today after introducing a bill authorizing President Trump to acquire Greenland and renaming it Red, White, and Blueland:  —  “America is back and will soon … ",
    "url": "https://buddycarter.house.gov/news/documentsingle.aspx?DocumentID=15398"
  },
  {
    "text": "The Path to American Authoritarianism  —  What Comes After Democratic Breakdown  —  Donald Trump's first election to the presidency in 2016 triggered an energetic defense of democracy from the American establishment.  But his return to office has been met with striking indifference.",
    "url": "https://www.foreignaffairs.com/united-states/path-american-authoritarianism-trump"
  },
  {
    "text": "Donald Trump Is Delusional  —  AMONG THE REALITY-BASED COMMUNITY—those of us who acknowledge Donald Trump's prodigious history of false statements—there's a longstanding debate.  Some think Trump knows better and is simply lying.  Others think he's sincerely delusional.",
    "url": "https://www.thebulwark.com/p/donald-trump-delusional-fox-news-interview-lies-gaza-tariffs-canada-usaid"
  },
  {
    "text": "Trump to nominate Sean Cairncross as national cyber director  —  Cairncross is a former top official at the RNC and previously led a federal foreign aid agency during the first Trump administration.  —  President Donald Trump intends to nominate former administration official … ",
    "url": "https://www.politico.com/news/2025/02/11/sean-cairncross-cyber-director-nomination-00203759"
  }
]