[
  {
    "text": "Biden goes all-in on calling Trump a “convicted felon” … - It also marked a departure from Biden's approach in remarks at the White House hours earlier, when he danced around the “convicted felon” label while criticizing Trump's attack on the U.S. justice system.",
    "url": "https://www.axios.com/2024/06/01/biden-trump-convicted-felon-2024-election"
  },
  {
    "text": "Exclusive: One in 10 Republicans less likely to vote for Trump after guilty verdict, Reuters/Ipsos poll finds  —  Ten percent of Republican registered voters say they are less likely to vote for Donald Trump following his felony conviction for falsifying business records to cover … ",
    "url": "https://www.reuters.com/world/us/one-10-republicans-less-likely-vote-trump-after-guilty-verdict-reutersipsos-poll-2024-05-31/"
  },
  {
    "text": "Poll: 49% of Independents think Trump should drop out post-guilty verdict … - 49% of Independents and 15% of Republicans said Trump should end his campaign because of the conviction.  — The polls found the race effectively tied nationally in a 1-on-1 with Biden at 45% and Trump at 44%.",
    "url": "https://www.axios.com/2024/06/01/poll-trump-conviction-election-independent-voters"
  },
  {
    "text": "Trump Announces Nearly $53 Million Fund-Raising Haul After Guilty Verdict  —  Cash has been one of President Biden's advantages so far in 2024, and post-conviction money will help Mr. Trump close the gap with the Democratic incumbent.  —  Donald J. Trump's campaign announced on Friday evening … ",
    "url": "https://www.nytimes.com/2024/05/31/us/politics/trump-fundraising-verdict.html"
  },
  {
    "text": "Trump Has Few Ways to Overturn His Conviction as a New York Felon  —  New York appellate courts rarely overturn a jury decision without evidence of serious errors.  The judge in Donald J. Trump's case closed off many avenues.  —  “This is long from over,” Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/06/01/nyregion/trump-appeal-conviction.html"
  },
  {
    "text": "Trump classified documents judge is target of more than 1,000 complaints, appeals court reveals … The Florida federal judge overseeing the criminal classified documents case against former President Donald Trump has been the target of more than 1,000 complaints in just one week … ",
    "url": "https://www.cnbc.com/2024/05/31/trump-classified-documents-aileen-cannon-complaints.html"
  },
  {
    "text": "Trump supporters try to doxx jurors and post violent threats after his conviction  —  On social media and web forums, users called for jurors, judges and prosecutors to be killed after the former president was found guilty on 34 felony counts.  —  WASHINGTON — The 34 felony guilty verdicts returned Thursday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-supporters-try-doxx-jurors-violent-threats-conviction-rcna154882"
  },
  {
    "text": "Statement on the Passing of Mrs. Marian Robinson from Barack and Michelle Obama, Craig and Kelly Robinson, and their children  —  Marian Lois Shields Robinson — our mother, mother-in-law, and grandmother — had a way of summing up the truths about life in a word or two … ",
    "url": "https://t.co/F7T6q625PC"
  },
  {
    "text": "For Michael Cohen and Stormy Daniels, a ‘vindicating’ moment at last  —  Trump's guilty verdict is welcomed by two unlikely star witnesses who faced years of doubt and derision.  —  The jury that found former president Donald Trump guilty of 34 felony charges delivered not only a historic verdict … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/01/michael-cohen-stormy-daniels-trump-guilty/"
  },
  {
    "text": "Debunking misinformation about Donald Trump's conviction in hush money trial |  Fact check  —  The first felony conviction of a former U.S. president has spawned a lot of discussion that strays from reality.  —  A jury found former President Donald Trump guilty of 34 charges … ",
    "url": "https://www.usatoday.com/story/news/factcheck/2024/05/31/donald-trump-guilty-verdict-fact-check/73923265007/"
  },
  {
    "text": "‘2,000 Mules’ Producer Apologizes to Man Depicted Committing Election Fraud  —  Salem Media Group, which co-produced the 2022 film, issued the apology to a Georgia man who was falsely depicted as stuffing a ballot box near Atlanta.  —  The conservative media company Salem Media Group … ",
    "url": "https://www.nytimes.com/2024/05/31/us/politics/2000-mules-salem-georgia-apology.html"
  },
  {
    "text": "Neighbors say Alitos used security detail car to intimidate them after sign dispute  —  Emily Baden says after a disagreement over political lawn signs with the US supreme court justice's wife, a black car began parking at her mother's home  —  Neighbors of Samuel Alito and his wife described … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/31/samuel-alito-flag-neighbor-interview"
  },
  {
    "text": "Retired Navy Admiral and Business Executives Arrested for Bribery Scheme  —  For Immediate Release  —  A retired Navy Admiral and two business executives were arrested today on criminal charges related to their roles in a bribery scheme that involved a U.S. government contract.",
    "url": "https://www.justice.gov/opa/pr/retired-navy-admiral-and-business-executives-arrested-bribery-scheme"
  },
  {
    "text": "King Alito's Arrogance Has Reached Frightening New Levels  —  As the Supreme Court careens toward the explosive end of its term, Justice Samuel Alito keeps digging himself deeper into an ethics scandal that is equal parts comical and execrable.  Alito sent a letter to congressional Democrats … ",
    "url": "https://slate.com/news-and-politics/2024/05/samuel-alito-upside-down-american-flag-supreme-court.html"
  },
  {
    "text": "Fact check: Trump's post-conviction monologue was filled with false claims  —  Former President Donald Trump said he was going to hold a “press conference” on Friday in the wake of his Thursday conviction in Manhattan on felony charges of falsifying business records.",
    "url": "https://www.cnn.com/2024/05/31/politics/fact-check-trump-post-conviction-speech/"
  },
  {
    "text": "Biden details a 3-phase hostage deal aimed at winding down the Israel-Hamas war  —  President Joe Biden on Friday detailed a three-phase deal proposed by Israel to Hamas militants that he says would lead to the release of the remaining hostages in Gaza and could end the grinding, nearly 8-month-old Mideast war.",
    "url": "https://apnews.com/article/biden-israel-hamas-58169a607d4a7c4d7fc34f43160076b8"
  }
]