[
  {
    "text": "Here's who was with Trump at RNC's Spring Meeting at Mar-a-Lago  —  Former President Trump held a private lunch event at his Mar-a-Lago Club over the weekend that hosted many top GOP donors and high-profile party leaders.  —  The fundraiser was largely seen as an audition for Trump's vice president within the GOP.",
    "url": "https://thehill.com/homenews/campaign/4644552-donald-trump-rnc-gop-mar-a-lago/"
  },
  {
    "text": "At a private donor event, Trump likens the Biden administration to the ‘Gestapo’  —  Trump referenced the Nazi secret police as he was railing against the legal troubles he and his supporters are facing.  —  PALM BEACH, Fla. — Donald Trump compared President Joe Biden's administration … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-biden-administration-gestapo-private-donor-event-rcna150743"
  },
  {
    "text": "Trump escalates attacks on prosecutors, says Democrats run ‘a Gestapo administration’  —  Saturday's sometimes profane remarks illustrate the central role his legal cases are playing in his bid to return to the White House for a second term.  —  PALM BEACH, Fla. — Former president Donald Trump escalated … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/04/trump-indictments-attacks-democrats-gestapo/"
  },
  {
    "text": "At Donor Retreat, Trump Calls Biden Administration the ‘Gestapo’  —  The speech by Donald J. Trump at a Republican National Committee fund-raising retreat came during his criminal trial in New York.  He faces a total of 88 criminal charges across four indictments.",
    "url": "https://www.nytimes.com/2024/05/04/us/politics/trump-donors.html"
  },
  {
    "text": "Top RNC lawyer resigns after rift grows with Trump  —  The former president was angered by Charlie Spies's criticism of his false 2020 election-fraud claims.  —  The top lawyer at the Republican Party is resigning after he cited conflicts with his other work obligations and after Donald Trump grew angry … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/04/trump-rnc-spies-election-fraud/"
  },
  {
    "text": "RNC lawyer Charlie Spies to step down just 2 months after taking the job  —  Spies was “pushed out,” according to a source familiar with the move.  —  Republican National Committee chief counsel Charlie Spies is parting ways with the party apparatus just months after stepping into the role.",
    "url": "https://www.nbcnews.com/politics/2024-election/republican-national-committee-lawyer-charlie-spies-step-tumult-rcna150745"
  },
  {
    "text": "Sen. Tim Scott dodges on whether he would accept 2024 election results  —  The senator, who ran for the Republican nomination for president last year, repeatedly refused to say whether he'd accept this year's presidential election results, regardless of who wins.",
    "url": "https://www.nbcnews.com/politics/2024-election/sen-tim-scott-dodges-whether-accept-2024-election-results-rcna150758"
  },
  {
    "text": "Don't give in to ‘the smallest, angriest group,’ university president says  —  “We just don't negotiate with people who scream the loudest,” former Sen. Ben Sasse said.  —  University of Florida President Ben Sasse said Sunday that he won't copy other university leaders in prioritizing … ",
    "url": "https://www.politico.com/news/2024/05/05/ben-sasse-florida-protests-00156168"
  },
  {
    "text": "6 months out, a tight presidential race with battle between issues and attributes: POLL  —  Trump has 46% support among U.S. adults and Biden 44% in a head-to-head matchup.  —  President Joe Biden speaks at a campaign rally for Democratic gubernatorial candidate Wes Moore at Bowie State University … ",
    "url": "https://abcnews.go.com/Politics/6-months-out-tight-presidential-race-trump-biden-poll/story?id=109909175"
  },
  {
    "text": "Scoop: U.S. put a hold on an ammunition shipment to Israel … - The incident raised serious concerns inside the Israeli government and sent officials scrambling to understand why the shipment was held, Israeli officials said.  — President Biden is facing sharp criticism among Americans who oppose his support of Israel.",
    "url": "https://www.axios.com/2024/05/05/israel-us-ammunition-shipment-hold"
  },
  {
    "text": "Gallows Humor and Talk of Escape: Trump's Possible Return Rattles Capital  —  At Washington dinner parties, dark jokes abound about where to go into exile if the former president reclaims the White House.  —  It has become the topic of the season at Washington dinner parties and receptions.",
    "url": "https://www.nytimes.com/2024/05/05/us/politics/trump-biden-election-dc.html"
  },
  {
    "text": "How Pope Francis opened the Vatican to transgender sex workers  —  The outreach, reflecting the most radical stage of his papacy, has prompted backlash while also altering the lives of the nearly 100 people he has met.  —  VATICAN CITY — Sea gulls soared over St. Peter's Square as Laura Esquivel … ",
    "url": "https://www.washingtonpost.com/world/2024/05/05/pope-francis-transgender-sex-workers/"
  },
  {
    "text": "‘The law is catching up’: Gensler's SEC racks up legal wins against crypto  —  The clash underscores sharply different views of crypto: Many regulators see the industry as rife with corruption.  Supporters hail it as the wave of the future.  —  The cryptocurrency industry is counting … ",
    "url": "https://www.politico.com/news/2024/05/05/gary-gensler-sec-crypto-00154769"
  },
  {
    "text": "Driver dies after crashing into White House perimeter gate  —  There was no threat to the president's home, law enforcement authorities said.  —  WASHINGTON — A driver died after a vehicle crashed into a gate at the White House Saturday night, but the fatal collision is being investigated … ",
    "url": "https://www.politico.com/news/2024/05/05/driver-dies-after-crashing-into-white-house-perimeter-gate-00156159"
  }
]