[
  {
    "text": "Pence told Jan. 6 special counsel harrowing details about 2020 aftermath, warnings to Trump: Sources  —  The former VP is the top official known to have spoken with investigators.  —  In this Nov. 24, 2020 file photo President Donald Trump and Vice President Mike Pence prepare to speak … ",
    "url": "https://abcnews.go.com/US/pence-told-jan-6-special-counsel-harrowing-details/story?id=105183391"
  },
  {
    "text": "Bid to hold Trump accountable for Jan. 6 violence stalls at appeals court  —  The long-awaited D.C. Circuit ruling in a trio of civil lawsuits could influence Trump's criminal cases as well.  —  A federal appeals court mulling Donald Trump's legal liability for Jan. 6 violence is approaching a conspicuous anniversary of inaction.",
    "url": "https://www.politico.com/news/2023/11/27/trump-immunity-appeal-00128786"
  },
  {
    "text": "‘Take It Seriously’: Presidential Historian Issues Warning Over New Donald Trump Vow  —  “This is what authoritarians do.  This is what fascists do,” said Michael Beschloss, who explained why the former president must be taken at his word.  —  LOADING  —  NBC News presidential historian … ",
    "url": "https://www.huffpost.com/entry/michael-beschloss-donald-trump-second-term_n_6565a0fae4b05f498ba1b36d"
  },
  {
    "text": "Sports Illustrated Published Articles by Fake, AI-Generated Writers  —  There was nothing in Drew Ortiz's author biography at Sports Illustrated to suggest that he was anything other than human.  —  “Drew has spent much of his life outdoors, and is excited to guide you through his never-ending list … ",
    "url": "https://futurism.com/sports-illustrated-ai-generated-writers"
  },
  {
    "text": "The Hunter Biden counter-offensive: A strategy long overdue, or a political minefield  —  The president's son has a new legal plan, and it will play out in parallel with his father's reelection campaign.  —  For years, as Hunter Biden faced a protracted criminal probe … ",
    "url": "https://www.politico.com/news/2023/11/28/hunter-biden-legal-strategy-00127787"
  },
  {
    "text": "Hunter Biden's team weighs House subpoena as James Biden cooperates with GOP panel  —  The Republican-led House Oversight Committee issued subpoenas to President Joe Biden's son and brother in early November and is seeking closed-door interviews with both men.",
    "url": "https://www.nbcnews.com/politics/congress/hunter-biden-house-subpoena-impeachment-james-biden-rcna126884?taid=6565d652aea4890001994dc0"
  },
  {
    "text": "‘Stop the price gouging’: Biden hits corporations over high consumer costs  — President Joe Biden took aim at corporations for charging prices he said were artificially high.  — “Any corporation that has not brought their prices back down, even as inflation has come down … ",
    "url": "https://www.cnbc.com/2023/11/27/white-house-supply-chain-bidenomics-wins.html"
  },
  {
    "text": "Trump's New Gambit to Delay His Trials Isn't Quite Working  —  The New York judge overseeing Donald Trump's hush money trial won't even consider pushing it back, especially after prosecutors accused defense lawyers of delay games. … Donald Trump's calendar is filling up—and not with campaign events.",
    "url": "https://www.thedailybeast.com/trumps-new-gambit-to-delay-his-trials-isnt-quite-working"
  },
  {
    "text": "Antagonisms flare as red states try to dictate how blue cities are run  —  Despite long advocating small government and local control, Republican governors and legislators across a significant swath of the country are increasingly overriding the actions of Democratic cities … ",
    "url": "https://www.washingtonpost.com/nation/2023/11/27/red-states-blue-cities-preemption-control/"
  },
  {
    "text": "Uncharitable giving  —  In the United States, the federal tax deduction for charitable giving was created in 1917.  The idea was that non-profit organizations provide tangible benefits to society, and donations should be encouraged.  The tax deduction effectively lowers the cost of donations to worthy causes through a public subsidy.",
    "url": "https://popular.info/p/uncharitable-giving"
  },
  {
    "text": "Why the Fifth Circuit Keeps Making Such Outlandish Decisions  —  Where to even start in cataloging the most ridiculous—and alarming—recent rulings to come out of the U.S. Court of Appeals for the Fifth Circuit?  —  There's a case about whether a class action could go forward that boiled … ",
    "url": "https://www.theatlantic.com/politics/archive/2023/11/fifth-circuit-conservative-supreme-court/676116/"
  },
  {
    "text": "Expelling George Santos: Democrats May Force GOP's Hand  —  Democrats may make the first move if Santos doesn't resign, or if GOP leaders don't act  —  As GOP leaders agonize over how to handle disgraced Rep. George Santos, R-N.Y., whose expulsion from Congress seemed inevitable last week, Democrats have a plan to force action.",
    "url": "https://themessenger.com/politics/expelling-george-santos-democrats-may-force-gops-hand"
  },
  {
    "text": "Word of the Year 2023  —  ‘Authentic,’ plus ‘rizz,’ ‘deepfake,’ ‘coronation,’ and other words that defined the year  —  Merriam-Webster's Word of the Year for 2023 is authentic—the term for something we're thinking about, writing about, aspiring to, and judging more than ever.",
    "url": "https://www.merriam-webster.com/wordplay/word-of-the-year"
  },
  {
    "text": "In Alabama, another small-town paper hit in ‘open season’ on free press  —  It's an increasingly familiar drama: Local authorities go after journalists and publishers of small papers, which find themselves on the First Amendment's front lines.  —  ATMORE, Ala. — When Don Fletcher checked … ",
    "url": "https://www.washingtonpost.com/style/media/2023/11/27/atmore-news-arrests-alabama/"
  },
  {
    "text": "GOP faces ominous signs in effort to avoid January shutdown  —  No government funding bills are scheduled to hit the House floor this week, an ominous sign for Republicans returning to Washington for the first time since their Thanksgiving recess.  —  Lawmakers face a mid-January deadline … ",
    "url": "https://thehill.com/homenews/house/4329841-house-gop-funding-bills/"
  },
  {
    "text": "Russian court extends detention of WSJ reporter Evan Gershkovich until end of January  —  The hearing took place behind closed doors because authorities say details of the criminal case against the American journalist are classified.  —  MOSCOW — A court in Moscow on Tuesday extended … ",
    "url": "https://www.nbcnews.com/news/world/russian-court-extends-detention-wsj-reporter-evan-gershkovich-end-janu-rcna126941"
  },
  {
    "text": "Biden campaign jumps into ObamaCare fight  —  The Big Story  —  President Biden's reelection campaign is enthusiastically jumping into a fight with former President Trump over the Affordable Care Act, also known as ObamaCare.  —  © Greg Nash, The Hill",
    "url": "https://thehill.com/newsletters/health-care/4329922-obamacare-fight-biden-trump/"
  },
  {
    "text": "Jonathan Braun, the drug smuggler Trump pardoned, once flew to California to beat an associate with a belt, prosecutors alleged  — A drug smuggler pardoned by Trump was accused of “viciously” beating a younger employee with a belt.  — Braun's “brutal assault left the 'kid's' entire body ‘black and blue,’” prosecutors alleged.",
    "url": "https://www.businessinsider.com/jonathan-braun-beat-associate-belt-prosecutors-trump-pardon-2023-11"
  },
  {
    "text": "How Christie dropping out could help Haley  —  Yes, polls suggest his supporters would largely move to her.  But it's probably helpful only in one state, and it's not nearly enough.  —  A battery of recent New Hampshire polls has shown Nikki Haley and Chris Christie running second and third … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/27/how-christie-dropping-out-could-help-haley/"
  },
  {
    "text": "Biden condemns shooting of Palestinian students: ‘No place for violence or hate in America’  —  President Biden on Monday condemned the shooting in Burlington, Vt., that seriously injured three Palestinian college students visiting the city for Thanksgiving.",
    "url": "https://thehill.com/homenews/4329557-biden-condemns-shooting-palestinian-students-vermont/"
  },
  {
    "text": "Two women arrested in NYC attack on Jewish victim who confronted them for tearing down hostage posters: cops  —  Two women have been slapped with hate crime charges for allegedly attacking a Jewish person who confronted them on the Upper West Side for tearing down posters of Israelis kidnapped by Hamas, cops said Monday.",
    "url": "https://nypost.com/2023/11/27/metro/2-women-arrested-in-nyc-hate-crime-attack-on-jewish-victim/"
  },
  {
    "text": "Constitution Scholar: Lawfare Punishing Me For Advising Trump Will Cost Me $3 Million  —  John Eastman has been harassed unceasingly since assisting Trump in 2020 constitutional litigation.  —  Three lawsuits attempting to bankrupt a constitutional scholar for giving the prior Republican … ",
    "url": "https://thefederalist.com/2023/11/27/constitution-scholar-lawfare-punishing-me-for-advising-trump-will-cost-me-3-million/"
  }
]