[
  {
    "text": "Trump says it's ‘very unlikely’ he'd pardon himself if elected  —  In an interview with NBC's “Meet the Press,” former President Donald Trump said that in his final days in office, he told people, “The last thing I'd ever do is give myself a pardon.”  —  Trump: ‘I could have had a pardon’ before leaving office",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-unlikely-pardon-convicted-presidency-meet-the-press-rcna104779"
  },
  {
    "text": "‘They did it to me’: Trump says Biden impeachment inquiry might be motivated by revenge  —  Trump told former Fox and NBC host Megyn Kelly that GOP attempts to indict Joe Biden could be next.  —  Former President Donald Trump has “no idea” whether Republicans will vote to impeach President Joe Biden.",
    "url": "https://www.politico.com/news/2023/09/14/trump-biden-impeachment-revenge-00116027"
  },
  {
    "text": "“Meet the Press” booking Trump for first show with new host is how FASCISM is normalized  —  Please call NBC to tell them this is wrong!  —  NBC's “Meet the Press” could've booked any political person for the debut this Sunday of the show's new moderator, Kristen Welker.",
    "url": "https://deanobeidallah.substack.com/p/meet-the-press-booking-trump-for"
  },
  {
    "text": "Behind the scenes, Ron DeSantis is making things worse for Kevin McCarthy  —  The Florida governor strategized Wednesday with leaders of the House cadre pushing Speaker Kevin McCarthy to the brink.  —  In the high-stakes fight that is threatening to shut down the federal government next month … ",
    "url": "https://www.politico.com/news/2023/09/14/desantis-leans-into-shutdown-fight-00115892"
  },
  {
    "text": "As House Republicans bicker, the government shutdown threat grows  —  Tensions among House Republicans came to a head Thursday morning, as Speaker Kevin McCarthy struggled to unite his narrow majority around a plan to avert a government shutdown at the end of the month - while protecting his job as speaker from far-right opposition.",
    "url": "https://www.npr.org/2023/09/14/1199492126/house-republicans-speaker-mccarthy-spending-shutdown"
  },
  {
    "text": "Judge severs Trump's Georgia election interference case, and 16 others, from trial starting in October  —  Kenneth Chesebro and Sidney Powell will be tried starting Oct. 23.  —  The judge overseeing the Georgia election interference case has severed the case, ordering that 17 defendants … ",
    "url": "https://abcnews.go.com/US/judge-severs-17-defendants-including-trump-oct-23/story?id=103185589"
  },
  {
    "text": "Hunter Biden indicted on federal gun charges  —  The indictment against the president's son comes after a plea agreement on tax and gun charges fell apart in July and amid a probe of his finances by House Republicans.  —  Federal prosecutors have indicted Hunter Biden, son of President Joe Biden, on gun charges, court documents show.",
    "url": "https://www.nbcnews.com/politics/politics-news/hunter-biden-indicted-federal-gun-charges-rcna39623"
  },
  {
    "text": "Trump Turns New York AG Case Against Judge  —  Trump's lawyers are going after Judge Arthur F. Engoron, saying he's overstepped his bounds. … In a frantic last-minute attempt to derail a trial that threatens to destroy Donald Trump's corporate empire, the former president's lawyers … ",
    "url": "https://www.thedailybeast.com/trump-turns-new-york-ag-case-against-judge-arthur-f-engoron"
  },
  {
    "text": "‘You sell yourself so cheap?’  Romney's stark indictment of GOP cowardice.  —  The headline Wednesday was that Sen. Mitt Romney of Utah is retiring — another Trump-critical GOP lawmaker heading for the exits in a party that is, relatedly, still dominated by Donald Trump.",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/you-sell-yourself-so-cheap-romneys-stark-indictment-gop-cowardice/"
  },
  {
    "text": "Wisconsin Republicans vote to fire elections director, who may not leave the job  —  The vote creates a dispute over who is in charge of overseeing elections in a state that is expected to play a critical role in next year's presidential campaign  —  MADISON, Wis. — Republicans … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/wisconsin-republicans-fire-election-director/"
  },
  {
    "text": "‘It will take years to recover’ from Tuberville blockade, top Navy nominee says  —  Adm. Lisa Franchetti, the Navy's No. 2 officer, has been leading the service on an acting basis because of the impasse.  —  President Joe Biden's nominee to be the Navy's top officer, Adm. Lisa Franchetti … ",
    "url": "https://www.politico.com/news/2023/09/14/tuberville-blockade-franchetti-00115936"
  },
  {
    "text": "Ukrainian President Volodymyr Zelensky to visit Washington next week  —  Zelensky's visit was coordinated with the Biden administration in a joint push to Congress to provide $24 billion in aid  —  Ukrainian President Volodymyr Zelensky is set to travel to Washington next week after a gathering … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/zelensky-washington-visit-ukraine-aid/"
  },
  {
    "text": "A mistress almost takes the stand in Texas AG's impeachment trial  —  AUSTIN — The star witness swept into the Texas Capitol on Wednesday, red coat and flashy Balenciaga-emblazoned handbag tucked under her arms, her white sheath, red lipstick and signature platinum pixie all a dramatic contrast … ",
    "url": "https://www.washingtonpost.com/nation/2023/09/13/paxton-texas-attorney-general-mistress/"
  },
  {
    "text": "Kim Davis must pay $100,000 to US same-sex couple she denied marriage license  —  Jury awards damages to David Ermold and David Moore, who sued former Kentucky county clerk over 2015 incident  —  A former Kentucky county clerk is being ordered to pay $100,000 to a local couple who sued … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/14/kim-davis-damages-same-sex-marriage-license-kentucky"
  },
  {
    "text": "Trump Pushing RNC to Change Third GOP Debate Venue (Exclusive)  —  The former president did not attend the first debate last month and has said he will skip the second debate, set for Sept. 27  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/trump-pushing-rnc-to-change-third-gop-debate-venue-exclusive"
  },
  {
    "text": "Gen Z Voices Lackluster Trust in Major U.S. Institutions  —  Members of Generation Z in the U.S. — those between the ages of 12 and 26 — generally lack trust in political and societal institutions, according to a new study from Gallup and Walton Family Foundation.",
    "url": "https://news.gallup.com/opinion/gallup/510395/gen-voices-lackluster-trust-major-institutions.aspx"
  },
  {
    "text": "Biden planning speech on threats to democracy in coming weeks, sources say  —  President Joe Biden plans to deliver a speech focused on threats to democracy in the coming weeks, according to two sources familiar with the plans.  —  Democratic donors gathered in Chicago for a fundraising retreat learned … ",
    "url": "https://www.cnn.com/2023/09/14/politics/democracy-speech-joe-biden/"
  },
  {
    "text": "Planned Parenthood to resume providing abortions in Wisconsin  —  Planned Parenthood said Thursday that it will resume providing abortions in Wisconsin following a July court ruling that found a law from 1849 doesn't apply to voluntary abortions.  —  The organization said abortions … ",
    "url": "https://thehill.com/policy/healthcare/4204571-planned-parenthood-to-resume-providing-abortions-in-wisconsin/"
  },
  {
    "text": "Ibram X. Kendi's Ivory Tower Comes Crashing Down  —  A university think tank led by “antiracism” guru Ibram X. Kendi is slashing a third of its workforce, the latest in a string of layoffs to hit left-wing activist groups.  —  The Boston University Center for Antiracist Research … ",
    "url": "https://freebeacon.com/democrats/ibram-x-kendis-ivory-tower-comes-crashing-down/"
  },
  {
    "text": "Sanders, Marshall reach agreement on community health center funding  —  A bipartisan Senate bill from Health Committee Chairman Bernie Sanders (I-Vt.) and Sen. Roger Marshall (R-Kan.) would provide a significant funding increase for community health centers and other primary care programs … ",
    "url": "https://thehill.com/policy/healthcare/4205249-sanders-marshall-reach-agreement-on-community-health-center-funding/"
  }
]