[
  {
    "text": "Dozens of Hezbollah members wounded in Lebanon when pagers exploded, sources and witnesses say  —  At least eight people were killed and 2,750 others including Hezbollah fighters, medics and Iran's envoy to Beirut were wounded on Tuesday when the pagers they use to communicate exploded across Lebanon … ",
    "url": "https://www.reuters.com/world/middle-east/dozens-hezbollah-members-wounded-lebanon-when-pagers-exploded-sources-witnesses-2024-09-17/"
  },
  {
    "text": "Hezbollah Pagers Explode in Apparent Attack Across Lebanon  —  Eight people were killed and 2,750 wounded, country's health minister says  —  BEIRUT—Pagers carried by thousands of Hezbollah operatives exploded at about the same time Tuesday afternoon in what appeared to be an unprecedented attack … ",
    "url": "https://www.wsj.com/world/middle-east/hundreds-of-hezbollah-operatives-pagers-explode-in-apparent-attack-across-lebanon-cf31cad4?st=trumvlry6nd9rff&reflink=article_copyURL_share"
  },
  {
    "text": "Trump, without evidence, blames ‘rhetoric’ of Biden, Harris for possible assassination attempt  —  Former president Trump, who has a long history of inflammatory rhetoric, repeated the claim on his social media platform Truth Social.  —  Former president Donald Trump on Monday blamed the … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/16/trump-blames-biden-harris-rhetoric-potential-assassination-attempt/"
  },
  {
    "text": "U.S. Authorities Were Warned About Suspected Trump Gunman  —  Ryan Routh criticized Trump and threatened to kill Vladimir Putin, setting off alarm bells among those involved in Ukraine assistance efforts  —  in West Palm Beach, Fla., and Vera Bergengruen in Washington",
    "url": "https://www.wsj.com/us-news/u-s-authorities-were-warned-about-suspected-trump-gunman-153dab6f?st=dHi5Ft&reflink=article_copyURL_share"
  },
  {
    "text": "Judge Aileen Cannon Failed to Disclose a Right-Wing Junket  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Federal Judge Aileen M. Cannon, the controversial jurist who tossed … ",
    "url": "https://www.propublica.org/article/judge-aileen-cannon-trump-documents-case-travel-disclosures"
  },
  {
    "text": "Harris soars to record 6-point lead over Trump in post-debate poll … - “A majority of likely voters — including 1 in 5 Republicans — believe Harris won the debate, and performance appears to be crystalizing her national lead over the former president,” said Eli Yokley, political analyst at Morning Consult, in an emailed statement.",
    "url": "https://www.axios.com/2024/09/17/harris-leads-trump-poll-after-debate-record"
  },
  {
    "text": "Small Movement Post-Debate  —  Large gender gaps on trust to handle immigration, abortion  —  West Long Branch, NJ - Vice President Kamala Harris continues to hold slightly more voter support than former President Donald Trump in the 2024 race for president.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_091724/"
  },
  {
    "text": "Vance: Trump's Health-Care Plan Is to Let Insurers Charge More for Preexisting Conditions … Donald Trump infamously said at the presidential debate he had the “concept of a plan” to replace Obamacare.  As is often the case when Trump commits verbal self-harm, it fell to J.D. Vance to turn … ",
    "url": "https://nymag.com/intelligencer/article/trump-health-plan-charge-more-preexisting-conditions-concept-plan-j-d-vance.html"
  },
  {
    "text": "JD Vance got a former professor to delete a blog post Vance wrote in 2012 attacking GOP over anti-immigrant rhetoric  —  A week after President Barack Obama won reelection in November 2012, JD Vance, then a law student at Yale, wrote a scathing rebuke of the Republican Party's stance on migrants … ",
    "url": "https://www.cnn.com/2024/09/17/politics/jd-vance-delete-2012-blog-post-attacking-gop-anti-immigrant-rhetoric/"
  },
  {
    "text": "Senate GOP abandons anti-Biden strategy after unexpected backfire … - Sen. James Lankford (R-Okla.) told Axios they were “not actually getting anything done” with the votes, but it created a situation in which Democrats “can send a message that they're pretending to back home.”",
    "url": "https://www.axios.com/2024/09/17/senate-biden-cra-votes-congress-tester-brown"
  },
  {
    "text": "Trump Rolls Out His New Cryptocurrency Business  —  In a livestream, Donald Trump formally introduced World Liberty Financial, a crypto venture led by two digital currency entrepreneurs with little experience running high-profile businesses.  —  A day after an apparent assassination attempt … ",
    "url": "https://www.nytimes.com/2024/09/16/technology/trump-crypto-world-liberty-financial.html"
  },
  {
    "text": "“Depressed, disgusted and horrified”: These lifelong Republicans say they're finally done with Trump  —  Former Republicans opposed to Donald Trump are working to give conservatives “permission” to vote for a Democrat  —  Robert Nix, a 62-year-old lawyer from Philadelphia, was a lifelong Republican before Donald Trump came to office.",
    "url": "https://www.salon.com/2024/09/17/depressed-disgusted-and-horrified-these-lifelong-say-theyre-finally-done-with/"
  },
  {
    "text": "Overseas threats hit the Ohio city where Trump and Vance lied about Haitians eating pets  —  SPRINGFIELD, Ohio (AP) — Ohio stationed state police at Springfield schools Tuesday in response to a rash of bomb threats — the vast majority that officials said came from overseas —",
    "url": "https://apnews.com/article/trump-vance-haitian-immigrants-ohio-threats-8035cbe409b471e61fe2e5457870d7b4"
  },
  {
    "text": "You're Allowed to Call Trump a Threat to Democracy  —  Would-be assassins and migrant pogroms grab the headlines, but the most electorally important event of the week may be the much more boring one coming tomorrow: The Federal Reserve is set to cut interest rates for the first time in two years.",
    "url": "https://www.thebulwark.com/p/youre-allowed-to-call-trump-a-threat"
  },
  {
    "text": "Suspicious packages sent to election officials in at least 6 states  —  Suspicious packages were sent to election officials in at least six states on Monday, but there were no reports that any of the packages contained hazardous material.  —  Powder-containing packages were sent to secretaries … ",
    "url": "https://apnews.com/article/suspicious-packages-election-powder-iowa-nebraska-tennessee-63c85689b94f0f55cf68c64dd05bea8f"
  },
  {
    "text": "Court may decide if Arizonans with missing citizenship records can vote in state races  —  Arizona officials discovered they have no records showing if nearly 100,000 longtime residents provided proof of citizenship, which is required by law to vote in state and local races.",
    "url": "https://www.washingtonpost.com/politics/2024/09/17/arizona-noncitizen-voters/"
  },
  {
    "text": "Mehdi Hasan sounds off  —  “The media is too timid, too cautious, too cowardly.”  —  ∙ Paid … Mehdi Hasan thinks elite media institutions are failing us, which is why he founded Zeteo, an “independent and unfiltered” news and commentary site that has grown exponentially since its debut earlier this year.",
    "url": "https://www.publicnotice.co/p/mehdi-hasan-interview-2024"
  },
  {
    "text": "In an Unprecedented Move, Ohio Is Funding the Construction of Private Religious Schools  —  The state is giving millions in taxpayer dollars directly to private schools to help them renovate and expand their campuses.  It may be the next frontier in the push to increase the use of school vouchers, proponents say.",
    "url": "https://www.propublica.org/article/ohio-taxpayer-money-funding-private-religious-schools"
  },
  {
    "text": "Georgia Ban Kills Young Mother  —  Click to skip ahead: A Death in Georgia looks at a horrific ProPublica story about a young mother who was killed by an abortion ban.  Criminalizing Pregnancy tells the story of a woman in South Carolina charged with murder for her miscarriage.",
    "url": "https://jessica.substack.com/p/georgia-ban-kills-young-mother"
  }
]