[
  {
    "text": "The Supreme Court's “Unanimous” Trump Ballot Ruling Is Actually a 5-4 Disaster  —  On Monday, the Supreme Court unanimously reversed a Colorado Supreme Court decision removing Donald Trump from the ballot because of his engagement in an insurrection on Jan. 6.",
    "url": "https://slate.com/news-and-politics/2024/03/supreme-court-trump-colorado-ballot-disaster.html"
  },
  {
    "text": "Supreme Court rules Trump cannot be kicked off ballot  —  The decision swiftly ended the legal fight over whether states could bar Trump from state ballots based on the Constitution's 14th Amendment.  —  WASHINGTON — The Supreme Court on Monday handed a sweeping win to former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rules-trump-cannot-kicked-colorado-ballot-rcna132291"
  },
  {
    "text": "Scoop: Top Democrat “working on” bill responding to Trump ballot ruling … - “Congress will have to try and act,” Rep. Jamie Raskin (D-Md.), the ranking member of the House Oversight Committee, told Axios. … - Raskin pointed to legislation he introduced with Rep. Debbie Wasserman Schultz … ",
    "url": "https://www.axios.com/2024/03/04/jamie-raskin-trump-ballot-ruling-supreme-court"
  },
  {
    "text": "The institutions of government aren't going to protect democracy  —  There is no real question about the intent of the riot at the Capitol on Jan. 6, 2021.  —  Donald Trump made clear his interest in undermining the results of the 2020 election for months beforehand, sowing misleading … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/04/trump-ballot-supreme-court-ruling/"
  },
  {
    "text": "Supreme Court keeps Trump on ballot, rejects Colorado voter challenge  —  Decision comes a day before Super Tuesday and as justices weigh other key cases affecting Donald Trump  —  The Supreme Court on Monday unanimously sided with Donald Trump, allowing the former president to remain … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/04/supreme-court-trump-ballot-decision/"
  },
  {
    "text": "It's Past Time to Quit Hoping the Courts Are Going to Stop Trump  —  The latest decisions out of the Supreme Court, first on when to hear former President Donald Trump's immunity appeal, then on how to deal with his Colorado ballot disqualification, have made one thing very clear … ",
    "url": "https://slate.com/news-and-politics/2024/03/supreme-court-trump-presidency-colorado-immunity-ouch.html"
  },
  {
    "text": "Joe Biden's Last Campaign  —  Trailing Trump in polls and facing doubts about his age, the President voices defiant confidence in his prospects for reëlection.  —  “I'll show you where Trump sat and watched the revolution,” Joe Biden said, stepping out from behind his desk in the Oval Office.",
    "url": "https://www.newyorker.com/magazine/2024/03/11/joe-bidens-last-campaign?currentPage=all"
  },
  {
    "text": "Settlement in Wisconsin fake elector case offers new details on the strategy by Trump lawyers  —  MADISON, Wis. (AP) — Two attorneys for then-President Donald Trump orchestrated a plan for fake electors to file paperwork falsely saying the Republican won Wisconsin in a strategy … ",
    "url": "https://apnews.com/article/electors-trump-settlement-ballot-2020-wisconsin-f416cd04adfa9f92c382b7c9e8a94ce7"
  },
  {
    "text": "Allen Weisselberg, Former Trump CFO, Pleads Guilty to Perjury  —  Allen H. Weisselberg, the former Trump Organization finance chief, has already spent time at the Rikers Island jail complex.  The perjury plea will send him back.  —  Allen H. Weisselberg, former President Donald J. Trump's … ",
    "url": "https://www.nytimes.com/2024/03/04/nyregion/weisselberg-guilty-trump-business.html"
  },
  {
    "text": "Former Trump CFO Allen Weisselberg pleads guilty to perjury in ex-president's civil fraud trial  —  NEW YORK (AP) — Allen Weisselberg, the former chief financial officer of the Trump Organization, pleaded guilty Monday in New York to perjury in connection with testimony he gave at the ex-president's civil fraud trial.",
    "url": "https://apnews.com/article/trump-fraud-weisselberg-perjury-0101a9972cefd1e1fb4ba6d36e69fecb"
  },
  {
    "text": "Trump supporters target black voters with faked AI images  —  Donald Trump supporters have been creating and sharing AI-generated fake images of black voters to encourage African Americans to vote Republican.  —  BBC Panorama discovered dozens of deepfakes portraying black people as supporting the former president.",
    "url": "https://www.bbc.com/news/world-us-canada-68440150"
  },
  {
    "text": "FBI hunts for suspected Iranian assassin targeting Trump-era officials  —  The Scoop  —  The U.S. government is intensifying a manhunt for an Iranian intelligence operative whom the Federal Bureau of Investigation believes has been plotting to assassinate current and former American officials … ",
    "url": "https://www.semafor.com/article/03/04/2024/fbi-hunts-for-suspected-iranian-assassin-targeting-trump-era-officials"
  },
  {
    "text": "Donald Trump's String of Gaffes Over Weekend Raises Eyebrows  —  Donald Trump has been criticized for making a string of gaffes during two weekend campaign speeches.  —  The Republican presidential candidate addressed crowds on Saturday in Richmond, Virginia, and Greensboro, North Carolina … ",
    "url": "https://www.newsweek.com/donald-trump-campaign-speech-gaffes-errors-mistakes-virginia-north-carolina-1875462"
  },
  {
    "text": "France becomes first country to explicitly enshrine abortion rights in constitution  —  PARIS — With the endorsement of a specially convened session of lawmakers at Versailles, France on Monday became the first country in the world to explicitly enshrine abortion rights in its constitution … ",
    "url": "https://www.washingtonpost.com/world/2024/03/04/france-abortion-constitution/"
  },
  {
    "text": "Sinead O'Connor's estate asks Donald Trump to stop playing her music at rallies  —  The estate of Sinead O'Connor has asked Donald Trump not to play her music at campaign rallies.  It says the late singer considered the former president a “biblical devil.”  —  The latest shake … ",
    "url": "https://apnews.com/article/sinead-oconnor-music-donald-trump-campaign-4e3d65969d2d01895accb4e02165a5ad"
  },
  {
    "text": "JetBlue Airways and Spirit Airlines Call Off Merger Deal  —  A federal judge ruled against the $3.8 billion deal in January, siding with antitrust enforcers  —  JetBlue Airways and Spirit Airlines terminated their merger agreement, weeks after a judge ruled that the $3.8 billion deal … ",
    "url": "https://www.wsj.com/business/earnings/jetblue-airways-scraps-3-8-billion-takeover-of-spirit-airlines-e1d014b0"
  },
  {
    "text": "Fox News Stars Flip Out When Reminded That Trump ‘Had Dinner With Nazis’  —  A Fox News anchor and a right-wing pundit freaked out on their liberal on-air guest when he merely stated a fact about Trump and Nick Fuentes dining together.  —  Fox News anchor Harris Faulkner and star pundit Tammy Bruce … ",
    "url": "https://www.thedailybeast.com/fox-news-stars-flip-out-when-reminded-that-trump-had-dinner-with-nazis"
  },
  {
    "text": "Cassidy Hutchinson sued by Tony Bobulinski in $10 million defamation suit  —  Tony Bobulinski, a former business partner of Hunter Biden, filed a lawsuit against former Trump White House aide Cassidy Hutchinson alleging she defamed him.  —  Bobulinski's lawsuit filed in the U.S. District Court … ",
    "url": "https://www.washingtonexaminer.com/news/justice/2901249/cassidy-hutchinson-sued-by-bobulinski-in-defamation-suit/"
  },
  {
    "text": "Philly LGBT Affairs executive director yells, ‘I work for the mayor,’ as she films her and her husband's arrest  —  Philadelphia's head of LGBT affairs and her husband were arrested by a state trooper Saturday, in what the mayor is calling a “very concerning,” interaction … ",
    "url": "https://www.cnn.com/2024/03/03/us/philadephia-lgbt-affairs-arrest-footage/"
  },
  {
    "text": "Federal appeals court to allow controversial Texas immigration law to take effect, if SCOTUS doesn't intervene  —  A federal appeals court granted a temporary stay of a lower court's decision to block the enforcement of a controversial Texas immigration law, paving the way for it to go into effect … ",
    "url": "https://www.cnn.com/2024/03/03/politics/texas-immigration-law-appeals-court/"
  },
  {
    "text": "Free COVID-19 test program to be suspended for now  —  The federal government's free at-home COVID-19 test program will be suspended beginning on Friday in response to a drop in respiratory diseases.  —  The Biden administration brought back the free test program last year ahead of the respiratory viral season.",
    "url": "https://thehill.com/policy/healthcare/4507266-free-covid-19-test-program-to-be-suspended-for-now/"
  }
]