[
  {
    "text": "How Trump Deflected MAGA's Wrath Over Epstein, at Least for Now  —  By tapping into other grievances, President Trump managed to turn one of the most fractious moments for his base into a unifying one.  —  In the week after the Justice Department walked back its promise to release … ",
    "url": "https://www.nytimes.com/2025/07/21/us/politics/trump-epstein-maga-base.html"
  },
  {
    "text": "Does Trump's alleged letter to Epstein “sound like” Trump?  An investigation.  —  On Thursday, the Wall Street Journal published a bombshell report about President Trump's relationship with convicted pedophile Jeffrey Epstein.  According to the Journal, the materials collected as part … ",
    "url": "https://popular.info/p/does-trumps-alleged-letter-to-epstein"
  },
  {
    "text": "Trump officials accused of defying 1 in 3 judges who ruled against him  —  A comprehensive analysis of hundreds of lawsuits against Trump policies shows dozens of examples of defiance, delay and dishonesty, which experts say pose an unprecedented threat to the U.S. legal system.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/07/21/trump-court-orders-defy-noncompliance-marshals-judges/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzMDcwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0NDUyNzk5LCJpYXQiOjE3NTMwNzA0MDAsImp0aSI6IjUwNWM3ZDUwLTMxM2QtNDQzYS04ZmU5LTUzMDdlNGJkZWRkYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA3LzIxL3RydW1wLWNvdXJ0LW9yZGVycy1kZWZ5LW5vbmNvbXBsaWFuY2UtbWFyc2hhbHMtanVkZ2VzLyJ9.8tERJVOOy1THG3bMGL9I268xALakhv-XIVqCK2E3RqU&itid=gfta"
  },
  {
    "text": "EU to ramp up retaliation plans as US tariff deal prospects dim  —  The European Union is exploring a broader set of possible counter-measures against the United States as prospects for an acceptable trade agreement with Washington fade, according to EU diplomats.",
    "url": "https://www.reuters.com/business/autos-transportation/eu-ramp-up-retaliation-plans-us-tariff-deal-prospects-dim-2025-07-21/"
  },
  {
    "text": "How John Roberts Built the New American Presidency  —  The country is witnessing the creation of an all-powerful institution, and one man is responsible.  —  No one on the Supreme Court has gone further to enable Donald Trump's extreme exercise of presidential power than the chief justice of the United States, John Roberts.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/07/supreme-court-roberts-trump-dictator/683576/?gift=mRAZp9i2kzMFnMrqWHt67aRoyUR1CMNKg4fhka6Kboc"
  },
  {
    "text": "How Trump's game-planning for the 2026 midterms  —  President Trump is already fixated behind the scenes on next year's midterm elections for the House and Senate — unleashing his billion-dollar political operation and personally burrowing into the minutiae of races.",
    "url": "https://www.axios.com/2025/07/21/trump-2026-midterms-congress-control"
  },
  {
    "text": "Migrants at Ice jail in Miami made to kneel to eat ‘like dogs’, report alleges  —  Incident in which migrants were shackled with hands tied of one succession of alleged abuses at jails in Florida  —  Migrants at a Miami immigration jail were shackled with their hands tied behind their backs … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/21/migrants-miami-ice-jail-abuses"
  },
  {
    "text": "This ‘violently racist’ hacker claims to be the source of The New York Times' Mamdani scoop … It's an anime-loving neo-Nazi whose hobbies include furry drawings, posting fan art of a video game character, and hacking universities.  On X, the alleged hacker is followed by New York Times … ",
    "url": "https://www.theverge.com/cyber-security/710480/columbia-hacker-nazi-nyt-affirmative-action"
  },
  {
    "text": "How Trump Killed Cancer Research  —  Attempting to eliminate funding for certain kinds of “woke” studies, the Trump administration erased hundreds of millions of dollars being used for cancer research.  —  When donald trump moved back into the White House, the United States was years … ",
    "url": "https://www.wired.com/story/how-trump-killed-cancer-research/"
  },
  {
    "text": "X slams French criminal probe over alleged algorithm ‘manipulation’  —  Lawmaker reported allegations over moderation and rightwing content on social media platform  —  Elon Musk's X has attacked a French criminal probe over “the alleged manipulation of its algorithm”, calling it politically motivated and a threat to free speech.",
    "url": "https://www.ft.com/content/21818d23-71d7-45a4-ae8c-e7940f5d9e00"
  },
  {
    "text": "How Trump's Big Bad Bill Will Kill Americans  —  What research tells us about how Trump policies are bad for your health  —  When confronted by a constituent claiming that “people are going to die” from the massive Medicaid cuts in Trump's just-passed Big Bad Bill, Iowa Senator Joni Ernst … ",
    "url": "https://donmoynihan.substack.com/p/how-trumps-big-bad-bill-will-kill"
  },
  {
    "text": "Trump, 79, Posts Deranged AI Video of Obama Being Arrested  —  SUNDAY SCARIES  —  The bizarre post came as the president seeks to move on from the Epstein controversy tearing apart his base.  —  President Donald Trump shared a bizarre fake video depicting the arrest and imprisonment … ",
    "url": "https://www.thedailybeast.com/donald-trump-79-posts-deranged-ai-video-of-barack-obama-being-arrested/"
  },
  {
    "text": "US: Immigrants Abused in Florida Detention Sites  —  Pervasive Overcrowding, Medical Neglect, Degrading Treatment  — Detainees in Florida immigration detention centers are being subjected to inhuman conditions, including denial of medical care, overcrowding, and degrading treatment.",
    "url": "https://www.hrw.org/news/2025/07/21/us-immigrants-abused-in-florida-detention-sites"
  },
  {
    "text": "Russia's drone swarms pierce Ukraine's defences at record rate  —  Proportion of Shaheds hitting targets tripled in recent months, according to analysis of official data  —  Charles Clover in London and Christopher Miller in Kyiv  —  Russia's “swarm” tactics against Ukraine … ",
    "url": "https://www.ft.com/content/1a19df67-3453-4a16-abf1-9fda36142f4b"
  },
  {
    "text": "Trump threatens Washington stadium deal unless NFL team readopts Redskins name  —  U.S. President Donald Trump threatened on Sunday to interfere with a deal to build a new football stadium in Washington, D.C., unless the local NFL team, now known as the Commanders, changes its name back to Redskins.",
    "url": "https://www.reuters.com/sports/trump-threatens-washington-stadium-deal-unless-nfl-team-readopts-redskins-name-2025-07-20/"
  },
  {
    "text": "Republicans fear Washington headed for shutdown after bruising spending fights  —  Republican lawmakers fear Washington may be headed for a government shutdown later this year after two bruising fights over President Trump's One Big, Beautiful Bill Act and a $9 billion rescissions package has created bad blood on Capitol Hill.",
    "url": "https://thehill.com/homenews/senate/5409351-gop-lawmakers-fear-government-shutdown/"
  },
  {
    "text": "Making America Alone Again  —  History Offers Few Parallels for Washington's Repudiation of Its Own Alliances  —  Henry Kissinger once compared himself to the lone cowboy who rode into town to sort out the bad guys.  But the U.S. secretary of state, who also served as national security adviser … ",
    "url": "https://www.foreignaffairs.com/north-america/making-america-alone-again"
  },
  {
    "text": "Over half of Americans say ‘big, beautiful bill’ going to raise health care costs: Poll  —  More than half of Americans — 57 percent — said in a new survey that they think the GOP's sweeping package extending tax cuts and slashing welfare services will increase their health-care costs.",
    "url": "https://thehill.com/policy/healthcare/5411435-gop-megabill-health-care-costs-survey/"
  },
  {
    "text": "Feds recall 5 million pools linked to drowning deaths of 9 children  —  The U.S. Consumer Product Safety Commission is recalling roughly 5 million above-ground pools linked to the deaths of nine children over the last two decades.  —  The federal agency said in a recall notice that the pools … ",
    "url": "https://www.cbsnews.com/news/pools-recalled-drowning-incidents-cpsc/"
  },
  {
    "text": "New study: State medical examiners wrongly excused homicides committed by Maryland police officers  —  When former Minneapolis police officer Derek Chauvin was tried for the murder of George Floyd, former Maryland Chief Medical Examiner David Fowler testified for the defense.",
    "url": "https://radleybalko.substack.com/p/new-study-state-medical-examiners"
  },
  {
    "text": "Global hack on Microsoft product hits U.S., state agencies, researchers say  —  Unknown attackers exploited a “significant vulnerability” in Microsoft's SharePoint collaboration software, hitting targets around the world.  —  Hackers exploited a major security flaw in widely used Microsoft server software … ",
    "url": "https://www.washingtonpost.com/technology/2025/07/20/microsoft-sharepoint-hack/"
  },
  {
    "text": "A MAGA bot network on X is divided over the Trump-Epstein backlash  —  Researchers have found hundreds of fake X accounts that support the Trump administration.  —  A previously unreported network of hundreds of accounts on X is using artificial intelligence to automatically reply … ",
    "url": "https://www.nbcnews.com/tech/internet/maga-ai-bot-network-divided-trump-epstein-backlash-rcna219167"
  },
  {
    "text": "The demise of Trump's lawsuit against Bob Woodward offers a reminder to his other targets  —  The demise of the president's case against the journalist offers a broader lesson about the benefits of fighting back — and the folly of appeasement.  —  Late Friday, Donald Trump announced … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/demise-trumps-lawsuit-bob-woodward-offers-reminder-targets-rcna219958"
  },
  {
    "text": "Can Europe break free of American tech supremacy?  —  The continent's dependence on US groups for digital infrastructure is causing growing concern among executives and policymakers  —  Benjamin Revcolevschi, an engineer by training, did not imagine one of his future jobs … ",
    "url": "https://www.ft.com/content/5e25c397-61d1-4b48-b5c5-65561a4c9df2"
  },
  {
    "text": "Playbook: Dems aim to close the ‘attention gap’  —  With help from Eli Okun, Bethany Irvine and Ali Bianco  —  Good Monday morning.  This is Adam Wren, happy to be your humble guide at the start of another wild week in Washington.  Get in touch.  —  In today's Playbook ...",
    "url": "https://www.politico.com/newsletters/playbook/2025/07/21/dems-aim-to-close-the-attention-gap-00465142"
  },
  {
    "text": "My Fix for the Confused and Leaderless Democrats  —  Constipated.  Leaderless.  Confused.  A cracked-out clown car.  Divided.  These are the words I hear my fellow Democrats using to describe our party as of late.  The truth is they're not wrong: The Democratic Party is in shambles.",
    "url": "https://www.nytimes.com/2025/07/21/opinion/carville-democrats-midterms-mamdani.html"
  }
]