[
  {
    "text": "Trump Launches $399 Sneaker Brand A Day After $355 Million Verdict Against Him  —  Former President Donald Trump hawked his new Trump-branded sneakers at “Sneaker Con,” a gathering that bills itself as the “The Greatest Sneaker Show On Earth!”.  —  LOADING",
    "url": "https://www.huffpost.com/entry/trump-launches-sneaker-line-at-sneaker-con_n_65d12c70e4b04daca6972e41"
  },
  {
    "text": "Trump launches sneaker line  —  Former President Donald Trump launched a line of sneakers ranging in price from $199 to $399.  —  If anyone was waiting for the other shoe to drop in the upcoming presidential race, former President Donald Trump just did, launching his own line of tennis shoes on Saturday.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-launches-sneaker-line-rcna139334"
  },
  {
    "text": "Trump Allies Plan New Sweeping Abortion Restrictions  —  His supporters are seeking to attack abortion rights and abortion access from a variety of angles should he regain the White House, including using a long-dormant law from 1873.  —  Allies of former President Donald J. Trump and officials … ",
    "url": "https://www.nytimes.com/2024/02/17/us/politics/trump-allies-abortion-restrictions.html"
  },
  {
    "text": "Trump unveiled his line of gold sneakers at Sneaker Con in Philadelphia  —  Former President Donald Trump made a brief stop in Philadelphia on Saturday to announce his new sneaker brand and remind a crowd of sneakerheads to vote.Just hours before a planned campaign rally in Michigan … ",
    "url": "https://www.inquirer.com/politics/nation/donald-trump-sneakercon-philadelphia-sneaker-culture-20240217.html"
  },
  {
    "text": "Asa Hutchinson: RNC leader should have to pledge not to pay Trump legal fees  —  Former Gov. Asa Hutchinson (R-Ark.) argued that the leader of the Republican National Committee (RNC) should pledge not to pay former President Trump's legal fees, as concerns rise over how the former president will fund his mounting bills.",
    "url": "https://thehill.com/regulation/court-battles/4474535-asa-hutchinson-rnc-should-pledge-not-to-pay-trump-legal-fees/"
  },
  {
    "text": "Rep. Mike Turner: The White House seemed to be ‘sleepwalking’ on Russian nuclear threat  —  Rep. Mike Turner, R-Ohio, told NBC's “Meet the Press” on Saturday that he was concerned the White House was “hiding ... some inaction” on this threat.  —  Rep. Mike Turner told NBC's “Meet the Press” … ",
    "url": "https://www.nbcnews.com/politics/congress/rep-mike-turner-white-house-seemed-sleepwalking-russian-nuclear-threat-rcna139354"
  },
  {
    "text": "Biden Says Ukrainian City's Fall Shows Impact of Aid Delays  — Senior Republican calls for passage, cites Navalny's legacy  — Emergency aid to Ukraine stuck in congressional deadlock  —  President Joe Biden blamed US lawmakers' failure to approve emergency aid to Ukraine for the fall of Avdiivka … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-17/biden-says-ukrainian-city-s-fall-shows-the-cost-of-us-aid-delays"
  },
  {
    "text": "George Santos Sues Jimmy Kimmel for Pranking Him on Cameo  —  The Republican fraudster wants at least $750,000 in damages.  —  “Put up or shut up,” former congressman George Santos likes to tell his haters.  Now, he's adding late night host Jimmy Kimmel to that list.",
    "url": "https://www.thedailybeast.com/george-santos-sues-jimmy-kimmel-for-pranking-him-on-cameo"
  },
  {
    "text": "Lyin' expelled ex-Rep. George Santos makes Jimmy Kimmel's ‘wishes come true’ by suing host over misusing Cameo clips  —  This is no laughing matter.  —  Expelled ex-Rep. George Santos is suing television host Jimmy Kimmel for allegedly misusing his Cameo clips on his show, The Post has learned.",
    "url": "https://nypost.com/2024/02/17/us-news/lyin-expelled-ex-rep-george-santos-makes-jimmy-kimmels-wishes-come-true-by-suing-host-over-misusing-cameo-clips/"
  },
  {
    "text": "Rep. Rashida Tlaib urges Michigan Democrats to vote against Biden in the primary  —  The Michigan congresswoman urged voters to “vote uncommitted” while she stood outside an early voting site in a video posted to X on Saturday  —  Rep. Rashida Tlaib, D-Mich., is urging Democrats in Dearborn … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rep-rashida-tlaib-urges-michigan-democrats-vote-biden-primary-rcna139360"
  },
  {
    "text": "Phillips announces campaign layoffs, says he will remain in race  —  “Today, sadly, I had to announce layoffs to a lot of my staff members,” the Minnesota lawmaker said in a video posted to X, formerly known as Twitter.  —  Longshot Democratic presidential contender Dean Phillips announced … ",
    "url": "https://www.politico.com/news/2024/02/17/dean-phillips-campaign-layoffs-00142053"
  },
  {
    "text": "Jimmy Carter's Long Goodbye  —  The former president is on the verge of having spent a year in hospice care, once again confounding expectations in a life that has lasted nearly a century.  —  Practically no one ever thought he would be elected president in the first place.",
    "url": "https://www.nytimes.com/2024/02/17/us/politics/jimmy-carter-hospice-anniversary.html"
  },
  {
    "text": "Speaker Johnson says he has priorities.  So why hasn't he acted on them?  —  Four months into his speakership, Rep. Mike Johnson (R-La.) is a leader in name only, failing to act on the policies he says are his priorities  —  House Speaker Mike Johnson (R-La.) has held his position for barely four months … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/17/speaker-johnson-fails-act/"
  },
  {
    "text": "U.S. Fears Russia Might Put a Nuclear Weapon in Space  —  American spy agencies are divided on whether Moscow would go so far, but the concern is urgent enough that Secretary of State Antony J. Blinken has asked China and India to try to talk Russia down.  —  When Russia conducted a series … ",
    "url": "https://www.nytimes.com/2024/02/17/us/politics/russia-nuclear-weapon-space.html"
  }
]