[
  {
    "text": "Pelosi privately told Biden polls show he cannot win and will take down the House; Biden responded with defensiveness  —  Former House Speaker Nancy Pelosi privately told President Joe Biden in a recent conversation that polling shows that the president cannot defeat Donald Trump and that Biden … ",
    "url": "https://www.cnn.com/2024/07/17/politics/nancy-pelosi-biden-conversation/"
  },
  {
    "text": "Jeffries and Schumer privately warned Biden he could imperil Democrats  —  The Democratic leaders pointed Biden to polls suggesting his candidacy could damage the party's hopes of controlling the House and Senate  —  House Minority Leader Hakeem Jeffries and Senate Majority Leader Charles E. Schumer … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/17/jeffries-schumer-biden-hurting-democrats/"
  },
  {
    "text": "Playbook: The walls close in around Biden  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  For weeks, the Democratic Party has been paralyzed by uncertainty about whether President JOE BIDEN should stay atop the ticket or step aside.",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/18/the-walls-close-in-around-biden-00169335"
  },
  {
    "text": "Donors' cash is drying up, Katzenberg warns Biden in private meeting  —  The Scoop  —  Joe Biden met privately in Las Vegas Wednesday with Jeffrey Katzenberg, the film producer and a top campaign adviser, who conveyed a warning: The president's donors' patience is wearing thin, and their cash soon will, too.",
    "url": "https://www.semafor.com/article/07/17/2024/donors-cash-is-drying-up-jeffrey-katzenberg-warns-biden-in-private-meeting"
  },
  {
    "text": "Biden is trying to salvage his campaign.  Democrats say things are only getting worse  —  President Joe Biden has said repeatedly that there is a simple cure for his political troubles: Get out there and show the skeptics that he has what it takes to run for - and win - a second term.",
    "url": "https://www.cnn.com/2024/07/17/politics/biden-outreach-democrats-falls-flat/"
  },
  {
    "text": "The VP is clearly the stronger candidate  —  The case for Kamala Harris, from a former hater  —  I did not support selecting Kamala Harris as Joe Biden's running mate in 2020.  —  My reasons for this were pretty boring.  It's genuinely difficult to make it to the top of the political pyramid … ",
    "url": "https://www.slowboring.com/p/the-vp-is-clearly-the-stronger-candidate"
  },
  {
    "text": "July 2024 Swing State Polls  —  Trump Leads Biden in Swing States and National Poll as Biden's Support Declines  —  New polling conducted July 15-16 by Emerson College Polling and sponsored by Democrats for Next Generation finds former President Trump leading Biden in seven swing states and in a national poll.",
    "url": "https://emersoncollegepolling.com/july-2024-swing-state-polls/"
  },
  {
    "text": "Virginia 2024 Poll: Trump 45%, Biden 43%  —  Home Polls Virginia 2024 Poll: Trump 45%, Biden 43%  —  A new Emerson College Polling/The Hill survey of Virginia voters finds 45% support former President Donald Trump and 43% support President Biden in a 2024 election.  Eleven percent are undecided.",
    "url": "https://emersoncollegepolling.com/virginia-2024-poll-trump-45-biden-43/"
  },
  {
    "text": "Biden Forgives $1.2 Billion in Student Loans in Latest Relief  — Debt assistance will help 35,000 public service workers  — Education Department has now forgiven $168.5 billion in debt  —  President Joe Biden canceled an additional $1.2 billion in student debt for public servants on Thursday … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-18/biden-forgives-1-2-billion-in-student-loans-in-latest-relief"
  },
  {
    "text": "Project 2025 *is* the GOP platform  —  Don't let them fool you. … Project 2025 — the right-wing template for a second Trump term — is so exhaustively evil, so vast in scope, that it feels impossible to fully comprehend it.  —  However, as the GOP faithful gather in Milwaukee … ",
    "url": "https://www.publicnotice.co/p/project-2025-explained-2024-gop-platform"
  },
  {
    "text": "Trump brags about ending Roe.  No one's talking about it in Milwaukee.  —  Heading into the final day of the Republican Party's first national gathering since the Supreme Court's landmark decision, the issue has barely received a passing mention.  —  MILWAUKEE — Overturning Roe … ",
    "url": "https://www.politico.com/news/2024/07/18/trump-abortion-rnc-00169304"
  },
  {
    "text": "Democratic Sen. Bob Menendez tells allies he will resign after bribery conviction  —  The New Jersey lawmaker has faced calls to step down from fellow Democrats, including Gov. Phil Murphy, who will, appoint a senator to finish out Menendez's term.  —  WASHINGTON — Sen. Bob Menendez … ",
    "url": "https://www.nbcnews.com/politics/congress/democratic-sen-bob-menendez-tells-allies-will-resign-bribery-convictio-rcna116970"
  },
  {
    "text": "Fiery private chats reveal how deeply Biden has divided Dem delegates  —  Messages shared between Democratic delegates and activists in California, the biggest and one of the bluest states, lay bare the infighting over their nominee's fitness for a presidential run.",
    "url": "https://www.politico.com/news/2024/07/17/california-democratic-delegates-private-chats-biden-00169210"
  },
  {
    "text": "‘One screen, two movies’: Conflicting conspiracy theories emerge from Trump shooting  —  A former president is shot, the gunman quickly neutralized, and all of it is caught on camera.  But for those who don't believe their eyes, that's just the start of the story.",
    "url": "https://apnews.com/article/trump-assassination-attempt-x-biden-misinformation-bf345b7cd72cc8c243084fe6ba8fa53a"
  },
  {
    "text": "3 takeaways from J.D. Vance's big speech … - If there's one thing Donald Trump really likes, it's people lining up to sing his praises. … - In his roughly 35-minute speech, Vance spent the first five minutes praising Trump for all sorts of things — his economic policies … ",
    "url": "https://www.axios.com/2024/07/18/3-takeaways-jd-vance-big-speech"
  },
  {
    "text": "Biden tests positive for COVID, cancels speaking engagement on Strip  —  Video  —  Poll shows many Latino voters still on fence over Biden, Trump  —  ‘Something went wrong’: Parallels seen between Oct. 1 shooting, Trump assassination attempt  —  Washoe County reverses vote, certifies 2 recounts as legal action looms",
    "url": "https://www.reviewjournal.com/news/politics-and-government/nevada/biden-tests-positive-for-covid-cancels-speaking-engagement-on-strip-3096562/"
  },
  {
    "text": "Trump has given no official info about his medical care for days since an assassination attempt  —  Four days after a gunman's attempt to assassinate former President Donald Trump at a Pennsylvania rally, the public is still in the dark over the extent of his injuries, what treatment … ",
    "url": "https://apnews.com/article/trump-shooting-transparency-db2f4437237ad03d3b04b0b5f1573977"
  },
  {
    "text": "First Term  —  Is a  —  Warning  —  This week, Republicans have tried to rewrite the four years of Trump's presidency as a time of unparalleled peace, prosperity and tranquility: “the strongest economy in history,” as Senator Katie Britt of Alabama put it.  The difference between Trump and Biden?",
    "url": "https://www.nytimes.com/interactive/2024/07/18/opinion/trump-presidency-record.html"
  },
  {
    "text": "The GOP's big, mysterious enemy: “They” … - In Trump's MAGA world, exactly who “they” are usually isn't defined.  — But it's typically some combination of Democrats, the federal government, what the former president's supporters call media “elites,” and other shadowy forces.",
    "url": "https://www.axios.com/2024/07/18/republican-convention-speeches-they-trump"
  },
  {
    "text": "J.D. Vance's radical plan to build a government of Trump loyalists  —  Donald Trump's allies have laid out sweeping plans to reshape the executive branch of the federal government if he is returned to power, plans that involve firing perhaps tens of thousands of career civil servants and replacing them with handpicked MAGA allies.",
    "url": "https://www.vox.com/politics/361455/jd-vance-trump-vice-president-rnc-speech"
  }
]