[
  {
    "text": "Trump Claims He Has Helicopter Trip Records and Threatens to Sue  —  Former President Donald J. Trump insisted that he was in a dangerous helicopter landing, though the man he said he was with said it never happened.  —  Former President Donald J. Trump on Friday afternoon vehemently maintained … ",
    "url": "https://www.nytimes.com/2024/08/09/us/politics/trump-helicopter-landing.html?unlocked_article_code=1.Bk4.2Xdy.ZnpbPWUHWbI3&smid=url-share"
  },
  {
    "text": "Trump's plane diverted in Montana due to mechanical issue  —  Former President Donald Trump's plane was forced to divert its landing in Montana Friday due to a mechanical issue, a law enforcement source confirmed to CBS News.  —  Trump is scheduled to hold a rally in Bozeman, Montana … ",
    "url": "https://www.cbsnews.com/news/donald-trump-plane-diverted-montana/"
  },
  {
    "text": "The other Black politician who says he was with Trump in that near-fatal chopper crash  —  Former Los Angeles city councilman and state senator Nate Holden said in an exclusive interview late Friday that he remembers the near-death experience well.  —  The man who almost crashed in a helicopter … ",
    "url": "https://www.politico.com/news/2024/08/09/trump-plane-crash-california-00173487"
  },
  {
    "text": "Yes, Trump Was in a Scary Helicopter Ride.  But Not With That Politician.  —  There was a helicopter.  It did make an emergency landing.  But a former California lawmaker says Donald Trump has mixed up one Black lawmaker for another.  —  Donald J. Trump was doubling down on Friday … ",
    "url": "https://www.nytimes.com/2024/08/10/us/politics/trump-helicopter-crash-willie-brown.html"
  },
  {
    "text": "Tim Walz ‘misspoke’ when he discussed using weapons ‘in war,’ campaign says  —  The statement from the Harris campaign follows criticism of Walz's military record by vice presidential candidate Sen. JD Vance and other Republicans.  —  Minnesota Gov. Tim Walz “misspoke” … ",
    "url": "https://www.nbcnews.com/politics/2024-election/tim-walz-misspoke-discussed-using-weapons-war-campaign-says-rcna166038"
  },
  {
    "text": "Assessing claims about Tim Walz's military service  —  Republicans are attacking the Democratic vice-presidential nominee on his retirement timing and with allegations of “stolen valor.”  —  When Vice President Kamala Harris on Tuesday introduced her running mate, Minnesota Gov. Tim Walz … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/09/assessing-claims-about-walz-service/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMTc2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0NTU4Mzk5LCJpYXQiOjE3MjMxNzYwMDAsImp0aSI6IjE1ZGEzNWM5LTRmODAtNGEzYy04ZjA5LTAxODljMjA5MzExMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzA5L2Fzc2Vzc2luZy1jbGFpbXMtYWJvdXQtd2Fsei1zZXJ2aWNlLyJ9.Bt-jLzguzJkh4KOsdKYgzCO4oG6PVRy_cGxy00im3KM"
  },
  {
    "text": "Harris Rides Momentum to Arizona, for What Campaign Says Is Largest Rally Yet  —  Kamala Harris and her running mate, Gov. Tim Walz of Minnesota, drew 15,000 at a rally near Phoenix, the campaign said.  To win in Arizona, they will need the diverse coalition that gave President Biden the state in 2020.",
    "url": "https://www.nytimes.com/2024/08/09/us/politics/harris-walz-arizona.html"
  },
  {
    "text": "GOP nominee to run North Carolina schools advocated pro-Trump military coup in January 6 video  —  Michele Morrow, the Republican nominee to run K-12 public education in North Carolina, filmed a video after attending the January 6 riot at the US Capitol urging then-President Donald Trump to put … ",
    "url": "https://www.cnn.com/2024/08/09/politics/kfile-michele-morrow-january-6-comments/"
  },
  {
    "text": "Elon Musk is bringing lawsuits to Texas.  A judge with Tesla stock keeps hearing them  —  Billionaire Elon Musk seems to have found a new favorite federal judge: Reed O'Connor in Fort Worth, Texas.  —  Musk's social media company X has filed two major lawsuits against groups he sees as antagonists … ",
    "url": "https://www.npr.org/2024/08/09/g-s1-16087/elon-musk-lawsuits-texas-same-judge-hears-them-tesla-stock"
  },
  {
    "text": "Man who violently fought cops gets 2nd longest Jan. 6 sentence: 20 years  —  David Dempsey he came prepared for battle, prosecutors said.  He pleaded guilty earlier this year to two counts of assaulting police with dangerous or deadly weapons.  —  David N. Dempsey came to the Jan. 6, 2021 … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/08/09/david-dempsey-jan-6-sentencing/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMTc2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0NTU4Mzk5LCJpYXQiOjE3MjMxNzYwMDAsImp0aSI6Ijc0YjhiYWI2LWM3MDQtNDM4Mi1iMzU5LTVlNjYwNjI5ODRmNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI0LzA4LzA5L2RhdmlkLWRlbXBzZXktamFuLTYtc2VudGVuY2luZy8ifQ.j3-x4ZmD0wS6_150iVQTkK_a1uwIVt6cJeQKCb1fafY&itid=gfta"
  },
  {
    "text": "New Nevada poll sees Harris with biggest lead over Trump yet  —  The poll also found that Nevada's three Democratic congressional incumbents lead their re-election races.  —  Election 2024 Elections Polls  —  A new poll of likely Nevada voters found Vice President Kamala Harris … ",
    "url": "https://thenevadaindependent.com/article/new-nevada-poll-sees-harris-with-biggest-lead-over-trump-yet"
  },
  {
    "text": "Arizona Judge Ruling Protects Identity of Election Workers  —  A judge in the Maricopa Superior Court in Arizona ruled on Thursday that the office of the county's recorder doesn't have to disclose the names of low level election workers to the public.  —  The ruling stems from a records … ",
    "url": "https://www.democracydocket.com/news-alerts/arizona-judge-ruling-protects-identity-of-election-workers/"
  },
  {
    "text": "Joe Rogan likes RFK Jr., and that's bad news for Trump  —  Comedian and podcaster Joe Rogan voiced support for Independent presidential candidate Robert F. Kennedy Jr., throwing a possible wrench into the 2024 campaign cycle.  —  Kennedy's initial foray into the race surprised some last year … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3116610/joe-rogan-endorsed-rfk-bad-trump/"
  },
  {
    "text": "Walz and legions of ‘dudes’ want to give men permission to vote Democrat  —  When Vice President Harris introduced her running mate, Minnesota Gov. Tim Walz, to the nation this week, she ran through his biography - dad, military member, high school football coach, teacher … ",
    "url": "https://www.npr.org/2024/08/08/g-s1-15974/tim-walz-kamala-harris-men-for-harris-dudes-for-harris"
  },
  {
    "text": "US troops attacked in Syria, no initial reports of injuries, official says  —  U.S. troops in northeastern Syria were attacked by a drone, a U.S. official told Reuters on Friday, although there were no injuries according to initial reports.  —  This is the second attack in recent days … ",
    "url": "https://www.reuters.com/world/middle-east/us-troops-attacked-syria-no-initial-reports-injuries-official-says-2024-08-10/"
  },
  {
    "text": "Trump Has Started to Piss Off White Supremacists  —  White supremacist, Hitler fan, and far-right political pundit Nick Fuentes shockingly revoked his support from Donald Trump's campaign early Friday, announcing on social media that he and his allies believed that the presidential bid is headed for a “catastrophic loss.”",
    "url": "https://newrepublic.com/post/184729/donald-trump-nick-fuentes-white-supremacists-support"
  },
  {
    "text": "Long COVID is a $1 trillion problem with no cure.  Experts plead for governments to wake up  —  For months, governmental officials around the world have appeared to want to forgo discussing the specter of long COVID.  As a new review makes clear, that is wishful thinking … ",
    "url": "https://fortune.com/well/article/long-covid-cost-1-trillion-treatment-cure/"
  },
  {
    "text": "State Rep. Devan Seabaugh charged with DUI in collision with cyclist  —  District 34 lawmaker received citations involving alcohol, drugs  —  Georgia Rep. Devan Seabaugh was arrested Thursday night after he hit a cyclist in a bike lane while he was driving in Grant Park, the Georgia State Patrol said.",
    "url": "https://www.ajc.com/news/crime/state-rep-devan-seabaugh-arrested-accused-of-hitting-cyclist/TEUF7ADDO5AOPASIJPWLECGNFY/"
  },
  {
    "text": "Joy!  Irrational exuberance soars to new levels  —  JOY!  IRRATIONAL EXUBERANCE SOARS TO NEW LEVEL.  The polls suggest that many Democratic voters feel better about the new and untested candidacy of Kamala Harris than they did about the old and enfeebled candidacy of Joe Biden.",
    "url": "https://www.washingtonexaminer.com/daily-memo/3117048/joy-irrational-exuberance-soars-to-new-levels/"
  },
  {
    "text": "MSNBC Host Lawrence O'Donnell Slams His Own Network on Air Over Trump's Press Conference  —  SEEN ENOUGH  —  He also took it upon himself to “correct” a “mistake” the network made in its coverage of Kamala Harris.  —  MSNBC's Lawrence O'Donnell launched a scathing attack on the way cable news networks … ",
    "url": "https://www.thedailybeast.com/msnbc-host-lawrence-odonnell-slams-his-own-network-on-air-over-trumps-press-conference"
  },
  {
    "text": "Kamala Harris' Sorority Sisters Launch a PAC  —  SECRET WEAPON  —  The new committee could be used to funnel donations to the campaign.  —  Good sisters always come through.  —  Vice President Kamala Harris' sorority, Alpha Kappa Alpha, has launched a political action committee … ",
    "url": "https://www.thedailybeast.com/kamala-harris-sorority-sisters-launch-a-pac"
  }
]