[
  {
    "text": "Jen Rubin exits Washington Post, joins Norm Eisen to launch new outlet countering ‘authoritarian threat’  —  New York CNN  —  Veteran opinion columnist Jennifer Rubin is becoming the latest in a long list of Washington Post figures to leave the troubled institution.",
    "url": "https://www.cnn.com/2025/01/13/media/jennifer-rubin-norm-eisen-contrarian-washington-post/"
  },
  {
    "text": "I Have Resigned from The Washington Post, effective today  —  Corporate and billionaire owners of major media outlets have betrayed their audiences' loyalty and sabotaged journalism's sacred mission — defending, protecting and advancing democracy.  The Washington Post's billionaire owner … ",
    "url": "https://contrarian.substack.com/p/i-have-resigned-from-the-washington"
  },
  {
    "text": "Judge Cannon OKs release of special counsel's report into Trump and election subversion  —  Judge Aileen Cannon said on Monday that she would not block the release of special counsel Jack Smith's report on his investigation into Donald Trump and efforts to overturn the 2020 election.",
    "url": "https://www.cnn.com/2025/01/13/politics/special-counsel-trump-january-6-report-judge-cannon/"
  },
  {
    "text": "Begun, the MAGA Wars Have  —  1. #TeamBannon  —  Over the weekend Steve Bannon unleashed on Elon Musk: … That was Bannon's marker.  His actual critique of Musk?  Buckle up, Francis. … Bannon went on to describe Musk's preferred objective as “techno-feudalism.”  —  Some observations:",
    "url": "https://www.thebulwark.com/p/begun-the-maga-wars-have-133"
  },
  {
    "text": "Bannon's Rage at Musk Suddenly Goes Nuclear as MAGA Meltdown Worsens … Over the weekend, Steve Bannon's fury at Elon Musk truly went off the rails.  Bannon, who has been feuding with Musk over immigration, vowed that he will run Musk out of the MAGA movement by Inauguration Day … ",
    "url": "https://newrepublic.com/article/190133/bannons-rage-musk-suddenly-goes-nuclear-maga-meltdown-worsens"
  },
  {
    "text": "Incoming Trump team is questioning civil servants at National Security Council about their loyalty  —  Incoming senior Trump administration officials have begun questioning career civil servants who work on the White House National Security Council about who they voted for in the 2024 election … ",
    "url": "https://apnews.com/article/trump-biden-nsc-loyalty-waltz-21913da0464f472cb9fef314fed488e5"
  },
  {
    "text": "Team Trump Suddenly Backtracks on Key Campaign Promise  —  Donald Trump is backtracking on his big campaign promise to end the Ukraine war in 24 hours, according to his special envoy to Ukraine.  —  On Sunday, Keith Kellogg told Fox News that the Russia-Ukraine war would come to a “solvable solution in the near term.”",
    "url": "https://newrepublic.com/post/190143/trump-promise-ukraine-war-end-backtrack"
  },
  {
    "text": "In Praise of California  —  It has its flaws — what place doesn't? — but it plays a big role in America's greatness  —  One of the unwritten rules of American politics is that it's OK to sneer at and smear our big cities and the people who live in them, while it's an outrageous act … ",
    "url": "https://paulkrugman.substack.com/p/in-praise-of-california"
  },
  {
    "text": "Trump's thuggish response to the California fires is a bad omen  —  Southern California is experiencing its most devastating winter fire season in more than 40 years.  As of Sunday, ongoing wildfires have destroyed more than 12,000 homes and killed at least 24 people while burning through an area larger than San Francisco.",
    "url": "https://www.publicnotice.co/p/trump-california-wildfires-response-newsom"
  },
  {
    "text": "How Lagging Vaccination Could Lead to a Polio Resurgence  —  In its original form, the virus survives in just two countries.  But a type linked to an oral vaccine used in other nations has already turned up in the West.  —  Most American parents hardly give thought to polio beyond the instant … ",
    "url": "https://www.nytimes.com/2025/01/13/health/polio-vaccine-outbreaks.html?unlocked_article_code=1.o04.0LDE.6-Avucxzh7Ab&smid=url-share"
  },
  {
    "text": "The people should own the town square  —  For any enquiry regarding this announcement, please contact press@joinmastodon.org  —  Mastodon was founded on the principles that people should be able to control their social circle online, curate their own timeline, and convene freely with any community of their choosing.",
    "url": "https://blog.joinmastodon.org/2025/01/the-people-should-own-the-town-square/"
  },
  {
    "text": "Suspect arrested with ‘flamethrower’ near LA Fire is an illegal immigrant: sources  —  The homeless man tackled and zip-tied by onlookers who say he was trying to start fires with a blowtorch near a Los Angeles wildfire is an illegal immigrant who will likely be protected by California's sanctuary city status, according to sources.",
    "url": "https://nypost.com/2025/01/13/us-news/suspect-arrested-with-flamethrower-near-kenneth-fire-is-an-illegal-immigrant-report/"
  },
  {
    "text": "Maybe It Was Never About the Factory Jobs  —  The theory that populist economic policies can win back the working class for Democrats has been tried, and it has failed.  —  if there was any place in America where President Joe Biden's economic agenda ought to have won him votes, it would have been Lordstown, Ohio.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/01/biden-economic-populism-failure/681289/"
  },
  {
    "text": "North Carolina Judge Denies Republicans' Request To Toss 60,000 Ballots  —  Today, a North Carolina judge rejected a request from the Republican National Committee (RNC), North Carolina GOP, Wake County GOP and two voters to toss out nearly 60,000 ballots cast in all November 2024 statewide races.",
    "url": "https://www.democracydocket.com/news-alerts/north-carolina-judge-denies-republicans-request-to-toss-60000-ballots/"
  },
  {
    "text": "Before Taking Office, L.A.'s Mayor Said She Would Not Go Abroad  —  Mayor Karen Bass of Los Angeles has been criticized for being out of the country when the wildfires broke out.  Three years ago, she promised in an interview to cut back on her world travel and focus on the city.",
    "url": "https://www.nytimes.com/2025/01/12/us/karen-bass-ghana-wildfire-travel-los-angeles.html"
  },
  {
    "text": "Pete Hegseth Is a Test  —  Inside the Senate's torturous debates over Donald Trump's worst cabinet nominee.  —  Pete Hegseth is, by every measure, an abysmal nominee to run the American military.  The Army National Guard veteran and former Fox News commentator has no experience managing enormous … ",
    "url": "https://nymag.com/intelligencer/article/inside-the-senate-battle-over-pete-hegseths-nomination.html"
  },
  {
    "text": "Meta Is Blocking Links to Decentralized Instagram Competitor Pixelfed  —  Meta is deleting links to Pixelfed, a decentralized Instagram competitor.  On Facebook, the company is labeling links to Pixelfed.social as “spam” and deleting them immediately.  —  Pixelfed is an open-source … ",
    "url": "https://www.404media.co/meta-is-blocking-links-to-decentralized-instagram-competitor-pixelfed/"
  },
  {
    "text": "NVIDIA Statement on the Biden Administration's Misguided ‘AI Diffusion’ Rule  —  For decades, leadership in computing and software ecosystems has been a cornerstone of American strength and influence worldwide.  The federal government has wisely refrained from dictating the design … ",
    "url": "https://blogs.nvidia.com/blog/ai-policy/"
  },
  {
    "text": "Trump's deportation vows only for ‘rabid’ Republicans and will fail, says Newt Gingrich  —  Former US House speaker says documented people, Dreamers, mothers and children must not be deported  —  Newt Gingrich, the former US House speaker and presidential hopeful, said a section … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/13/trump-immigration-newt-gingrich"
  }
]