[
  {
    "text": "My Nikki Haley Theory  —  From the day she came in third in Iowa to her 20-point loss to Donald Trump on Saturday in South Carolina, Nikki Haley and her aims have been the subject of intense speculation.  Clearly, in the absence of a lightning bolt from the blue that strikes Donald Trump … ",
    "url": "https://www.commentary.org/john-podhoretz/my-nikki-haley-theory/"
  },
  {
    "text": "Trump's ‘Dominance’ of the GOP Primary Is an Illusion  —  Sure, he's fully vanquished the competition at the ballot box, but it's not like all Republicans are MAGA.  Far from it, in fact. … Are the media guilty of judging Joe Biden more harshly than Donald Trump when it comes to things … ",
    "url": "https://www.thedailybeast.com/trumps-dominance-of-the-gop-primary-is-an-illusion"
  },
  {
    "text": "Playbook: What Joe Biden has to fear from Michigan  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  A NEWSY EPISODE OF ‘LATE NIGHT’ — President JOE BIDEN addressed prospects for a cease-fire in the Israel-Hamas war during his appearance on NBC's … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/27/what-joe-biden-has-to-fear-from-michigan-00143487"
  },
  {
    "text": "Trump Has a Hilarious New Excuse for Why He Can't Put Up Bond  —  Donald Trump is arguing that he shouldn't have to post the massive bond in E. Jean Carroll's defamation case against him ... because he's simply too rich.  —  Trump owes Carroll $83.3 million for defaming her in 2019 when she first accused him of sexual assault.",
    "url": "https://newrepublic.com/post/179308/trump-excuse-cant-post-bond-e-jean-carroll"
  },
  {
    "text": "Trump throws Truth Social tantrum demanding all cases against him “must be immediately halted”  —  On the heels of his South Carolina primary win, Trump spent the night (and early morning) complaining of legal woes  —  Donald Trump began his Monday raging about the slew of civil … ",
    "url": "https://www.salon.com/2024/02/26/throws-truth-social-tantrum-demanding-all-cases-against-him-must-be-immediately-halted/"
  },
  {
    "text": "This time, Trump's going to have to pay his own bills  —  With nearly a half-billion dollars in legal judgments to pay, a tepid GoFundMe fundraiser from supporters just isn't going to cut it for the Republican presidential front-runner  —  Soon after New York State Supreme Court Justice … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/27/trump-trials-money-fundraising/"
  },
  {
    "text": "Pride flags would be largely banned in Tennessee classrooms in bill advanced by GOP lawmakers  —  The GOP-led Tennessee House has passed a bill that would largely ban displaying pride flags in public school classrooms  —  NASHVILLE, Tenn. — A bill that would largely ban displaying pride flags … ",
    "url": "https://abcnews.go.com/Politics/wireStory/pride-flags-largely-banned-tennessee-classrooms-bill-advanced-107568221"
  },
  {
    "text": "Republicans' Absurdist Reproductive Policies Are Coming for Us All  —  When I first heard Roe v. Wade would be overturned, I knew I had to move my embryos out of a red state.  The past few weeks have proven why.  —  Nearly two years ago, late into the night on a Monday … ",
    "url": "https://slate.com/news-and-politics/2024/02/ivf-mess-women-response-losing-roe.html"
  },
  {
    "text": "A Spike in Heart Disease Deaths Since Covid Is Puzzling Scientists  —  Mortality data of the past four years show a wave of deadly cardiovascular and metabolic illness.  —  Almost three weeks before Covid-19 was reported to be spreading in the US, Patricia Cabello Dowd dropped dead in the kitchen of her San Jose, California, home.",
    "url": "https://www.bloomberg.com/news/articles/2024-02-26/covid-made-heart-disease-deadlier-puzzling-scientists"
  },
  {
    "text": "Jack Smith Pounds Trump For His Unprecedented Conduct In MAL Case  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  No One Has Ever Done What Trump Did  —  Special Counsel Jack Smith unleashed a tight, targeted fusillade in the Mar-a-Lago case … ",
    "url": "https://morningmemo.talkingpointsmemo.com/p/jack-smith-pounds-trump-for-his-unprecedented"
  },
  {
    "text": "Senate Democrats to force a vote on bill to protect IVF access  —  Sens. Tammy Duckworth (D-Ill.) and Patty Murray (D-Wash.) said Tuesday they will try to force a vote on their legislation to protect access to in vitro fertilization (IVF) treatment in response to the Alabama Supreme Court ruling … ",
    "url": "https://thehill.com/policy/healthcare/4491501-senate-democrats-to-force-a-vote-on-bill-to-protect-ivf-access/"
  },
  {
    "text": "Trans Virginia lawmaker storms out of chamber after being called ‘sir’ by Lt Gov Winsome Sears  —  Virginia state Sen Danica Roem is state's first transgender legislator  —  A transgender lawmaker stormed out of the Virginia Senate chamber in protest after Lt. Gov. Winsome Sears referred to the lawmaker as “sir” on Monday.",
    "url": "https://www.foxnews.com/politics/trans-virginia-lawmaker-storms-out-chamber-being-called-sir-lt-gov-winsome-sears"
  },
  {
    "text": "House Democrats fume at Mike Johnson as government shutdown threat grows … - “The odds of a government shutdown go up every hour that we don't see legislative text for a budget vote,” Rep. Wiley Nickel (D-N.C.) told Axios. … - “The Speaker has a day or two to decide who comes first … ",
    "url": "https://www.axios.com/2024/02/27/house-democrats-mike-johnson-government-shutdown"
  },
  {
    "text": "Monica Lewinsky urges shoppers to vote in new fashion collection  —  Women's clothing brand Reformation has tapped activist and author Monica Lewinsky to be the face of their latest voting campaign to get shoppers to the ballot boxes this November.  —  Reformation's “You've Got the Power” … ",
    "url": "https://thehill.com/blogs/in-the-know/4492002-monica-lewinsky-urges-shoppers-to-vote-in-new-fashion-collection/"
  },
  {
    "text": "Apple to Wind Down Electric Car Effort After Decadelong Odyssey  — Executives tell staff to end work on endeavor known as Titan  — Employees on some car teams will move to Apple's AI division  —  Apple Inc. is canceling a decadelong effort to build an electric car … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-27/apple-cancels-work-on-electric-car-shifts-team-to-generative-ai"
  },
  {
    "text": "Scoop: U.S. wants Israeli written assurances on using U.S. weapons in Gaza by mid-March … - It also stresses that a country that uses U.S. weapons in conflict areas needs to provide “credible and reliable written assurances” that it will “facilitate and not arbitrarily deny, restrict … ",
    "url": "https://www.axios.com/2024/02/27/israel-sign-letter-international-law-weapons-us-aid"
  },
  {
    "text": "Former Australian PM: Trump acts like 12-year-old boy around Putin  —  Former Australian Prime Minister Malcolm Turnbull described former President Trump's rhetoric around Russian President Vladimir Putin as an admiring “12-year-old boy.”  —  Speaking on Australian ABC's “Q+A” show … ",
    "url": "https://thehill.com/policy/international/4491800-former-australian-pm-trump-acts-like-12-year-old-around-putin/"
  },
  {
    "text": "Two candidates for mayor of a Mexican city are shot dead within hours of each other  —  Candidates Armando Pérez and Miguel Ángel Zavala were found dead days before campaigning was set to formally begin.  —  MEXICO CITY — Two candidates for mayor in the Mexican city of Maravatio … ",
    "url": "https://www.nbcnews.com/news/latino/mexican-mayoral-candidates-shot-dead-hours-rcna140739"
  },
  {
    "text": "'The numbers right now aren't good.'  —  FOR YEARS, DONALD TRUMP'S CAMPAIGN STAFF struggled to get him to make donor calls and take fundraising seriously.  —  But that was before Trump faced an incumbent president and a primary opponent who was outraising him.",
    "url": "https://plus.thebulwark.com/p/trump-fundraising-more-than-ever"
  },
  {
    "text": "In leaked audio, Supreme Court Justice John Devine railed against “brainwashed” GOP colleagues  —  Devine, a former anti-abortion activist, faces a heated primary challenge that has focused on questions about his ethics.  —  Speaking to a group of East Texas voters in September … ",
    "url": "https://www.texastribune.org/2024/02/27/john-devine-texas-supreme-court-conservatives/"
  },
  {
    "text": "US Army is slashing thousands of jobs in major revamp to prepare for future wars  —  WASHINGTON (AP) — The U.S. Army is slashing the size of its force by about 24,000, or almost 5%, and restructuring to be better able to fight the next major war, as the service struggles with recruiting shortfalls … ",
    "url": "https://apnews.com/article/army-cuts-soldiers-recruiting-shortfall-9f2f41cbe512f6330ce6008709e3435b"
  },
  {
    "text": "Kroger's “nefarious bargain”  —  This is a special joint edition of Popular Information and Fingers, a newsletter about drinking in America by journalist Dave Infante.  Fingers is a must-read for anyone who cares about the business, culture, and chaos of booze.  Sign up HERE.",
    "url": "https://popular.info/p/krogers-nefarious-bargain"
  },
  {
    "text": "Controversial Ohio GOP congressional candidate considers dropping out (again)  —  House Republican leaders have been desperate to stop J.R. Majewski from winning the nomination to take on Democratic Rep. Marcy Kaptur, who defeated him in 2022.  —  J.R. Majewski, the controversial Ohio congressional candidate … ",
    "url": "https://www.politico.com/news/2024/02/27/majewski-considering-dropping-out-ohio-00143604"
  },
  {
    "text": "U.S. Launches Antitrust Investigation of Healthcare Giant UnitedHealth  —  Investigators have been interviewing healthcare industry officials who compete with UnitedHealth  —  The Justice Department has launched an antitrust investigation into UnitedHealth Group, owner of the nation's biggest health insurer … ",
    "url": "https://www.wsj.com/health/healthcare/u-s-launches-antitrust-investigation-of-healthcare-giant-unitedhealth-ff5a00d2"
  },
  {
    "text": "Vice president's SUV was partially ‘airborne’ during 2022 motorcade accident, records show  —  The Secret Service agent involved in the accident was allowed to avoid defensive driving training.  —  The back end of the vehicle carrying Vice President Kamala Harris “became momentarily airborne” … ",
    "url": "https://www.nbcnews.com/news/us-news/president-kamala-harris-suv-airborne-2022-accident-driver-rcna140599"
  },
  {
    "text": "Schumer, Jeffries say Ukraine discussion was ‘intense’  —  Senate Majority Leader Chuck Schumer (D-N.Y.) and House Minority Leader Hakeem Jeffries (D-N.Y.) both characterized a Tuesday meeting between President Biden and congressional leaders as “intense” amid tension over Ukraine aid.",
    "url": "https://thehill.com/homenews/4491739-schumer-jeffries-say-ukraine-discussion-was-intense/"
  }
]