[
  {
    "text": "Exclusive: John Kelly goes on the record to confirm several disturbing stories about Trump  —  John Kelly, the longest-serving White House chief of staff for Donald Trump, offered his harshest criticism yet of the former president in an exclusive statement to CNN.",
    "url": "https://www.cnn.com/2023/10/02/politics/john-kelly-donald-trump-us-service-members-veterans/"
  },
  {
    "text": "John Bolton: It's ‘entirely possible’ Trump wants his supporters to kill Mark Milley  —  Former National Security Adviser John Bolton warned CNN's Jake Tapper on Monday that former President Donald Trump may actually want one of his followers to take matters into their own hands and mete … ",
    "url": "https://www.rawstory.com/trump-supporters-mark-milley/"
  },
  {
    "text": "Trump fundraises off fraud trial: ‘Nothing can break me’  —  Former President Trump on Monday was quick to fundraise off of his fraud trial in New York after proceedings wrapped for the day.  —  Trump's campaign blasted out a fundraising email with a subject line of “I just left the courthouse” … ",
    "url": "https://thehill.com/homenews/campaign/4234676-trump-fundraises-off-fraud-trial-nothing-can-break-me/"
  },
  {
    "text": "Trump says he would prefer to die by electrocution in bizarre campaign rant  —  Former president and frontrunner for the 2024 Republican nomination delivered the odd remarks during a speech in Iowa  —  Faced with a litany of criminal charges, Donald Trump on Sunday told a campaign rally … ",
    "url": "https://www.theguardian.com/us-news/2023/oct/02/donald-trump-electrocution-campaign-event-iowa"
  },
  {
    "text": "Trump's decision to show up in New York for start of his civil trial was as personal as it was political  —  For former President Donald Trump, showing up in New York for the start of his civil trial Monday was more than a political stop to boost his 2024 campaign.  It was also deeply personal.",
    "url": "https://www.cnn.com/2023/10/02/politics/trump-new-york-civil-trial-appearance/"
  },
  {
    "text": "John Kelly confirms Trump's ‘suckers’ remark about war dead  —  Former White House chief of staff John Kelly confirmed several remarks his former boss, former President Trump, reportedly made during his time in the administration, including one where Trump referred to dead U.S. service members as “suckers.”",
    "url": "https://thehill.com/homenews/administration/4235005-john-kelly-confirms-trumps-suckers-remark-about-war-dead/"
  },
  {
    "text": "Rep. Matt Gaetz files resolution to oust Kevin McCarthy as speaker of the House  —  Republican Rep. Matt Gaetz filed a resolution late Monday to oust Kevin McCarthy as speaker, setting up a likely showdown vote in the House in the days ahead.  The far-right Republican from Florida … ",
    "url": "https://apnews.com/article/kevin-mccarthy-matt-gaetz-speaker-vacate-congress-e7e5ccc6cf79ccbf5b4a7b73b9d5a3ae"
  },
  {
    "text": "Gaetz moves to oust Speaker McCarthy  —  Rep. Matt Gaetz (R-Fla.) on Monday moved to force a vote on ousting Speaker Kevin McCarthy (R-Calif.), following through with his pledge to do so after the Speaker put a “clean” continuing resolution (CR) to fund the government on the House floor.",
    "url": "https://thehill.com/homenews/house/4233982-gaetz-moves-to-oust-speaker-mccarthy/"
  },
  {
    "text": "Democrats Weigh Whether to Rescue McCarthy From G.O.P. Ouster Bid  —  Party officials said that without promises to address their policy priorities, the speaker should not count on Democratic votes to save him.  —  The hard-right threat to oust Speaker Kevin McCarthy from his post … ",
    "url": "https://www.nytimes.com/2023/10/02/us/politics/democrats-mccarthy-speaker.html"
  },
  {
    "text": "Matt Gaetz files motion to oust Kevin McCarthy as House speaker  —  Rep. Matt Gaetz (R-Fla.) introduced a resolution Monday evening to remove Speaker Kevin McCarthy (R-Calif.) from his seat, triggering an expected intraparty clash and setting up a showdown for the House to decide whether to depose McCarthy likely within 48 hours.",
    "url": "https://www.washingtonpost.com/politics/2023/10/02/kevin-mccarthy-matt-gaetz/"
  },
  {
    "text": "What was Elon Musk's strategy for Twitter?  —  A year after the world's richest man acquired the social media platform, a game plan published by a fired Trump White House staffer provides a clue.  —  On the day that public records revealed that Elon Musk had become Twitter's biggest shareholder … ",
    "url": "https://www.nbcnews.com/tech/was-elon-musks-strategy-twitter-rcna118490"
  },
  {
    "text": "EMILYs List Statements on Laphonza Butler's Appointment to the U.S. Senate  —  FOR IMMEDIATE RELEASE  —  WASHINGTON, D.C. - Today, in response to the news that Gov. Gavin Newsom will name EMILYs List President Laphonza Butler to the U.S. Senate from California, EMILYs List released the following statements:",
    "url": "https://emilyslist.org/news/emilys-list-statements-on-laphonza-butlers-appointment-to-the-u-s-senate/"
  },
  {
    "text": "My Fellow Republicans: It's Time to Grow Up  —  Extremists in my party have threatened to try and remove Speaker Kevin McCarthy for relying on the votes of Democrats to keep the government open.  Some of them appear to be authoritarian separatists who reject pluralism … ",
    "url": "https://www.nytimes.com/2023/10/02/opinion/kevin-mccarthy-house-republicans-shutdown.html"
  },
  {
    "text": "Clarence Thomas recuses himself as Supreme Court rejects ex-Trump lawyer John Eastman's appeal  —  Thomas, who is under fire over claims of ethical lapses, was criticized for not recusing himself from a separate Jan. 6-related case because his wife, Virginia “Ginni” Thomas … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/clarence-thomas-recuses-supreme-court-rejects-trump-lawyer-eastman-rcna117607"
  },
  {
    "text": "Error in New York's Civil Fraud Case Against Trump Is Flagged by Industry Insiders, Who Say Valuation of Mar-a-Lago Cited by Judge Is Based on a Misunderstanding of Basic Real Estate Practice  —  Apparent mistake by Judge Engoron surfaces in his use of a Palm Beach County appraisal of Mar-a-Lago that … ",
    "url": "https://www.nysun.com/article/error-in-new-yorks-civil-fraud-case-against-trump-is-flagged-by-industry-insiders-who-say-valuation-of-mar-a-lago-cited-by-judge-is-based-on-a-misunderstanding-of-basic-real-estate-practice"
  },
  {
    "text": "'They're just meat': Russia deploys punishment battalions in echo of Stalin  —  Drunk recruits.  Insubordinate soldiers.  Convicts.  —  They're among hundreds of military and civilian offenders who've been pressed into Russian penal units known as “Storm-Z” squads and sent to the frontlines … ",
    "url": "https://www.reuters.com/world/europe/theyre-just-meat-russia-deploys-punishment-battalions-echo-stalin-2023-10-03/"
  },
  {
    "text": "Putin's Pals Brag: Elon Musk ‘Really Is Our Agent!’  —  Kremlin propagandists are rejoicing after Congress omitted aid to Ukraine from its most recent government funding bill.  —  Russian experts have long predicted that it's only a matter of time before U.S. aid to Ukraine is jeopardized by war fatigue and domestic issues.",
    "url": "https://www.thedailybeast.com/russian-state-tv-brags-elon-musk-really-is-our-agent"
  },
  {
    "text": "Pentagon official charged with participating in dog fighting ring  —  Frederick D. Moorefield Jr., a deputy chief information officer, is accused of training fighting dogs for more than 20 years  —  A senior member of the Department of Defense communications staff has been arrested and charged … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/10/02/moorefield-charged-dog-fighting-department-defense/"
  },
  {
    "text": "Rep. Cuellar unharmed in armed carjacking in DC  —  Rep. Henry Cuellar (D-Texas) was carjacked in Washington, D.C. on Monday night, according to a staffer from his office.  —  Cuellar was parking his car outside of his apartment in Navy Yard, D.C. when three armed individuals approached … ",
    "url": "https://thehill.com/homenews/house/4235073-rep-cuellar-unharmed-in-armed-carjacking-in-dc/"
  },
  {
    "text": "Bowman camp slams ‘Nazi’ Republicans after fire alarm flap  —  Republicans have vowed to punish the progressive in the wake of the incident, with one member already introducing a motion to expel him from Congress.",
    "url": "https://www.politico.com/live-updates/2023/10/02/congress/bowmans-damage-control-00119493"
  },
  {
    "text": "Matt Gaetz's father seeking return to Florida Senate  —  Don Gaetz, Rep. Matt Gaetz's (R-Fla.) father, announced on Monday that he will be running again for the Florida Senate, where he served from 2006 to 2016.  —  Don Gaetz, a Republican, said that he has no intentions of seeking higher office … ",
    "url": "https://thehill.com/homenews/state-watch/4234410-matt-gaetzs-father-seeking-return-to-florida-senate/"
  }
]