[
  {
    "text": "U.S. intelligence, law enforcement candidates face Trump loyalty test  —  Candidates for top intelligence and law enforcement jobs were asked to give “yes” or “no” responses to questions such as: Was Jan. 6 “an inside job?”  —  Candidates for top national security positions in the Trump administration … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/08/trump-administration-job-candidates-loyalty-screening/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4OTkwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMzczMTk5LCJpYXQiOjE3Mzg5OTA4MDAsImp0aSI6ImJhY2ZmMzQ4LTUyNjQtNDFiZS1iOWNkLWQ0Mzk5MjJmZGRjNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzA4L3RydW1wLWFkbWluaXN0cmF0aW9uLWpvYi1jYW5kaWRhdGVzLWxveWFsdHktc2NyZWVuaW5nLyJ9.yxvFgWdeOV9RrerwIJTWnzd_J5k4UIFHbwb3lUoMHcM&itid=gfta"
  },
  {
    "text": "NIH cuts billions of dollars in biomedical funding, effective immediately  —  The move halts a large slice of money for most universities and research institutions virtually overnight, imperiling vital research in everything from cancer to heart disease.  —  The Trump administration … ",
    "url": "https://www.washingtonpost.com/health/2025/02/08/nih-cuts-billions-dollars-biomedical-funding-effective-immediately/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4OTkwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMzczMTk5LCJpYXQiOjE3Mzg5OTA4MDAsImp0aSI6IjU5NWFmNTI5LTEwMTYtNDhmZC1iOGJiLTU4NTdmYWNkMWVjZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMi8wOC9uaWgtY3V0cy1iaWxsaW9ucy1kb2xsYXJzLWJpb21lZGljYWwtZnVuZGluZy1lZmZlY3RpdmUtaW1tZWRpYXRlbHkvIn0.OcEQXaQ6GEgeA8scM1_Xktlj4L_KU_yq77TQ8tne0EU&itid=gfta"
  },
  {
    "text": "Trump stripping the security clearances of numerous antagonists — including NY AG Letitia James, DA Alvin Bragg  —  President Trump has ordered security clearances stripped from a new hit list of antagonists.  —  Just days after revoking Joe Biden's access to classified information … ",
    "url": "https://nypost.com/2025/02/08/us-news/trump-stripping-the-security-clearances-from-a-new-hit-list-of-antagonists-including-ny-ag-letitia-james-da-alvin-bragg/"
  },
  {
    "text": "Trump removes Antony Blinken, Letitia James, Alvin Bragg's security clearances among others  —  President Donald Trump decided Saturday to remove security clearances for several Democrats, including former Secretary of State Antony Blinken, Manhattan District Attorney Alvin Bragg … ",
    "url": "https://www.foxnews.com/politics/trump-removes-antony-blinken-letitia-james-alvin-braggs-security-clearances-among-others"
  },
  {
    "text": "In chaotic Washington blitz, Elon Musk's ultimate goal becomes clear  —  Shrink government, control data and — according to one official closely watching the billionaire's DOGE — replace “the human workforce with machines.”  —  Billionaire Elon Musk's blitzkrieg on Washington has brought … ",
    "url": "https://www.washingtonpost.com/business/2025/02/08/doge-musk-goals/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4OTkwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMzczMTk5LCJpYXQiOjE3Mzg5OTA4MDAsImp0aSI6Ijg1Y2M3ODM1LTEzODgtNDdiMS05YzA5LTAxNmE5MDMwYmI2NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzA4L2RvZ2UtbXVzay1nb2Fscy8ifQ.R0LGPHHjFHSZMic-TXDTaBm8cNZweQrcDobIjt_lVHM&itid=gfta"
  },
  {
    "text": "Federal Financial Watchdog Ordered to Cease Activity  —  In an email to staff of the Consumer Financial Protection Bureau, the agency's acting director ordered workers to cease “all supervision and examination activity.”  —  Employees of the Consumer Financial Protection Bureau were instructed to cease … ",
    "url": "https://www.nytimes.com/2025/02/08/us/politics/cfpb-vought-staff-finance-watchdog.html?unlocked_article_code=1.vk4.tkNM.755KLwhrxD95"
  },
  {
    "text": "A Tent City Is Rising at Guantánamo Bay  —  These are the first independent images to emerge from the migrant operation that the Trump administration has begun at the Navy base.  —  The Trump administration has moved more than 30 people described as Venezuelan gang members … ",
    "url": "https://www.nytimes.com/2025/02/08/us/politics/guantanamo-bay-migrants.html?unlocked_article_code=1.vU4.Li_i.pz26KdUtcHGJ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "American farmers ruined by Musk killing USAID: Check this map  —  USAID bought $2 billion a year of rice, wheat, lentils, and peas from American farmers.  —  Musk has taken steps to dismantle the U.S. Agency for International Development (USAID).  The agency's headquarters have been shuttered … ",
    "url": "https://thedemlabs.org/2025/02/08/american-farmers-ruined-by-musk-killing-usaid-check-this-map/"
  },
  {
    "text": "Trump rules out deporting Prince Harry: 'He's got enough problems with his wife'  —  Prince Harry can breathe freely in Montecito, because President Donald Trump has ruled out deporting the self-exiled British royal.  —  Harry's immigration status is the subject of litigation in Washington DC … ",
    "url": "https://nypost.com/2025/02/08/us-news/trump-rules-out-deporting-prince-harry-takes-jab-at-meghan-markle/"
  },
  {
    "text": "Trump's Conquest of the Kennedy Center Is Accelerating  —  The president has begun purging the board of Washington's premier arts organization.  —  Donald Trump's hostile takeover of the John F. Kennedy Center for the Performing Arts is moving quickly.  —  On Friday night … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/02/trump-kennedy-center-board/681623/"
  },
  {
    "text": "The Cybertruck Appears to Be More Deadly Than the Infamous Ford Pinto, According to a New Analysis  —  On New Years morning this year, US Army Master Sergeant Matthew Livelsberger rolled his rental cybertruck up near the front doors of Trump International Hotel Las Vegas.",
    "url": "https://futurism.com/the-byte/cybertruck-ford-pinto-comparison"
  },
  {
    "text": "The Recruitment Effort That Helped Build Elon Musk's DOGE Army  —  At least three individuals associated with Palantir or its cofounder Peter Thiel were involved in an online recruiting effort for DOGE late last year, WIRED has learned.  —  The establishment of Elon Musk's so-called Department … ",
    "url": "https://www.wired.com/story/elon-musk-doge-recruiting-palantir/"
  },
  {
    "text": "‘The feel of a coup’: Elon Musk said to be poised to ‘defy’ major judicial order  —  Elon Musk appears poised to defy a judicial order, according to observers.  —  Musk, the richest man in the world and an appointee of Donald Trump, was dealt a blow over the weekend when a judge reportedly … ",
    "url": "https://www.rawstory.com/trump-elon-coup-defy-order/"
  },
  {
    "text": "Why would a ‘Christian’ destroy the world's largest relief agency?  —  For Christians here and across the world, the ongoing confrontation over the fate of USAID dramatically illustrates the moral degeneration of the politicians who most fervently profess their piety.",
    "url": "https://www.alternet.org/franklin-graham-2671119286/"
  },
  {
    "text": "Far-Right Leaders Rally in Spain to ‘Make Europe Great Again’  —  At a gathering in Madrid, members of Europe's far-right parties set aside any trepidation they might have about President Trump's threats, and instead focused on a common enemy — the European Union.",
    "url": "https://www.nytimes.com/2025/02/08/world/europe/far-right-spain-rally.html?unlocked_article_code=1.vU4.uTVE.9Gxuw_DMfBm1"
  },
  {
    "text": "The Department of Education Told Employees to End Support for Transgender Students  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  The U.S. Department of Education told employees late Friday … ",
    "url": "https://www.propublica.org/article/department-of-education-transgender-students-email"
  },
  {
    "text": "In a harbinger of illiberalism, Trump fired the Archivist of the United States without telling her or Congress why  —  Good afternoon from Washington, where my daughter and I made blueberry pancakes and took the dogs for a walk before the rains rolled in.  I hope you and yours are well this morning.",
    "url": "https://civic-texts.ghost.io/in-a-harbinger-of-illiberalism-trump-fires-archivist-of-the-united-states-2/"
  },
  {
    "text": "New York lawmakers moving to deny House GOP a key vote  —  A new proposal would allow New York Gov. Kathy Hochul to set a special election for later in the year.  —  ALBANY, New York — New York Democrats are poised to delay until November the special election to fill Rep. Elise Stefanik's House seat … ",
    "url": "https://www.politico.com/news/2025/02/08/new-york-lawmakers-moving-to-deny-house-gop-a-key-vote-00203249"
  },
  {
    "text": "Federal judge temporarily blocks DOGE from accessing sensitive Treasury Department payment systems  —  The decision comes after 19 state attorneys general sued the federal government alleging DOGE staffers didn't have authority to access the systems.  —  A federal judge on Saturday temporarily … ",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-temporarily-blocks-doge-sensitive-treasury-department-systems-rcna191316/"
  },
  {
    "text": "Protesters denounce Trump immigration policies outside his Florida golf club  —  A handful of demonstrators gathered outside Trump International Golf Club on Saturday to protest President Donald Trump's immigration policies while the commander-in-chief spent leisure time at the club.",
    "url": "https://www.reuters.com/world/us/protesters-denounce-trump-immigration-policies-outside-his-florida-golf-club-2025-02-08/"
  },
  {
    "text": "Children's Wisconsin hospital reinstates gender-affirming care for trans teen after canceling in wake of Trump's executive order  —  The order is being challenged in court as illegal and unconstitutional.  —  Reading Time: 4 minutes … The Gender Health Clinic at Children's Wisconsin hospital … ",
    "url": "https://wisconsinwatch.org/2025/02/wisconsin-milwaukee-hospital-transgender-gender-affirming-care-trump/"
  },
  {
    "text": "She's in House GOP Leadership.  Here's How She Responds to Trump Tweets.  —  Rep. Lisa McClain helps shape Republican messaging in the Trump era — and she's eager to defend his “out-of-the-box thinking.”  —  Speaker Mike Johnson and his leadership team spent most of Thursday huddled in the White House … ",
    "url": "https://www.politico.com/news/magazine/2025/02/08/lisa-mcclain-trump-meeting-00203198"
  },
  {
    "text": "This senator says Democrats need to invoke villains, namely Elon Musk  —  Sen. Chris Murphy of Connecticut calls on his party to be more aggressive in going after Trump's billionaire allies as it tries to win back the hearts of voters.  —  Sen. Chris Murphy thinks that Democrats have been too timid … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/08/democrats-trump-strategy-chris-murphy/"
  },
  {
    "text": "Who is helping Elon Musk gut the US government?  —  The billionaire's cost-cutting ‘Doge’ staff includes wealthy executives, far-right ideologues and young engineers  —  Elon Musk's rapid attempt to defund and depopulate the federal government has thrown US politics into chaos while the billionaire's … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/08/elon-musk-doge-team-staff"
  },
  {
    "text": "Trump dismisses archivist to the United States  —  The National Archives became the target of Trump's ire when the independent agency sought to retain documents from his Mar-a-Lago estate in 2022.  —  President Donald Trump has terminated the head of the National Archives and Records Administration … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/08/national-archives-trump-dismissal/"
  }
]