[
  {
    "text": "Trump world considers having the former president deliver the official GOP State of the Union response  —  Two sources told NBC News that Trump is leaning against doing it.  The decision ultimately rests with the Republican leadership in Congress.  —  WASHINGTON — Aides and allies close … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-world-former-president-deliver-gop-state-union-response-rcna138979"
  },
  {
    "text": "Trump says he purposefully mixes up politicians' names … - Biden's campaign seized on the moment by sharing it on social media, and in a campaign ad.  — He's mixed up Biden and former President Obama at least seven times in recent months, per Forbes.",
    "url": "https://www.axios.com/2024/02/15/trump-biden-memory-age-attacks"
  },
  {
    "text": "Trump's first criminal trial will start March 25, judge says  —  The schedule means Trump will spend weeks in court instead of on the campaign trail.  —  Former President Donald Trump's first criminal trial will start on March 25 as scheduled, a judge said in New York on Thursday as he denied Trump's attempts to throw out the charges.",
    "url": "https://www.politico.com/news/2024/02/15/trump-hush-money-criminal-case-hearing-update-00141621"
  },
  {
    "text": "The investigation that led to the charges spanned nearly five years.  —  Ruling that the case against Donald J. Trump can proceed, Justice Juan M. Merchan said he planned to begin the trial on March 25.  —  A judge rejected a bid to toss the hush-money case.  Here's the latest.",
    "url": "https://www.nytimes.com/live/2024/02/15/nyregion/trump-manhattan-criminal-case"
  },
  {
    "text": "Trump hush money trial to start March 25, judge denies dismissal request  — A New York judge said that jury selection in the hush money trial of former President Donald Trump will begin March 25.  — The judge denied Trump's request to dismiss charges in the case.",
    "url": "https://www.cnbc.com/2024/02/15/trump-in-new-york-courr-for-stormy-daniels-hush-money-case-hearing-.html"
  },
  {
    "text": "Scoop: Hur making plans to testify to GOP panel about Biden … - Biden, his White House and his personal lawyer have been bashing Hur over his report, which cleared Biden of criminal wrongdoing but painted the president, 81, as having “diminished faculties” and a “poor memory.”",
    "url": "https://www.axios.com/2024/02/15/robert-hur-congress-testimony-biden-memory"
  },
  {
    "text": "Biden's lawyers forcefully protested Hur report before its release  —  Exchange of impassioned letters between Biden's team and Justice Department show concerns over description of the president's memory  —  President Biden's top attorneys exchanged confrontational letters … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/15/biden-hur-memory-angry-lawyers/"
  },
  {
    "text": "BREAKING: Witness Testifies Fani, Wade Relationship Began in 2019  —  Well, my my my.  The disqualification hearing for Fani Willis in the Fulton County RICO case began this morning, and it's already going south for the DA and her boyfriend, Nathan Wade.  In a filing with the court two weeks ago … ",
    "url": "https://hotair.com/ed-morrissey/2024/02/15/breaking-witness-testifies-fani-wade-relationship-began-in-2019-n3782995"
  },
  {
    "text": "The final repudiation of ‘2000 Mules’  —  Since Donald Trump left office in January 2021, there has been no more influential presentation of his theory that the election was stolen than the film “2000 Mules,” created by activist — and Trump pardon recipient — Dinesh D'Souza.",
    "url": "https://www.washingtonpost.com/politics/2024/02/15/dsouza-2000-mules-repudiation/"
  },
  {
    "text": "Texas Active Club Leader Blurred His Face But Forgot to Scrub His Socials  —  The Texas Observer and Bellingcat have identified the leader of a white nationalist group that distributed antisemitic and racist flyers in Weatherford, Mineral Wells, and Eagle Pass, three small Texas cities, over the last year.",
    "url": "https://www.bellingcat.com/news/2024/02/15/texas-active-club-leader-blurred-his-face-but-forgot-to-scrub-his-socials/"
  },
  {
    "text": "US disrupts Russian hacking campaign that infiltrated home, small business routers: DOJ  —  The FBI coordinated with other foreign partners to disrupt the GRU-led campaign.  —  A laptop is seen on a Russian flag in this undated stock photo.  —  The FBI announced Thursday it successfully disrupted … ",
    "url": "https://abcnews.go.com/Politics/us-disrupts-russian-hacking-campaign-infiltrated-home-small/story?id=107258976"
  },
  {
    "text": "Truth Social merger deal wins key approval, a victory for Trump  —  The former president's stake in the post-merger company would be valued, at today's share price, at nearly $4 billion.  —  The Securities and Exchange Commission has approved the merger proposal of former president Donald Trump's media start … ",
    "url": "https://www.washingtonpost.com/technology/2024/02/15/truth-social-trump-merger-sec/"
  },
  {
    "text": "Russia has obtained a ‘troubling’ emerging anti-satellite weapon, the White House says  —  The White House on Thursday publicly confirmed that Russia's has obtained a “troubling” emerging anti-satellite weapon but said it cannot directly cause “physical destruction” on Earth.",
    "url": "https://apnews.com/article/russia-anti-satellite-weapon-threat-technology-2880f9c55122dcafe87188bc92dd6cde"
  },
  {
    "text": "Air Canada's chatbot gave a B.C. man the wrong information.  Now, the airline has to pay for the mistake  —  Air Canada has been ordered to compensate a B.C. man because its chatbot gave him inaccurate information.  —  The Civil Resolution Tribunal's decision on the dispute was posted online Wednesday … ",
    "url": "https://bc.ctvnews.ca/air-canada-s-chatbot-gave-a-b-c-man-the-wrong-information-now-the-airline-has-to-pay-for-the-mistake-1.6769454"
  },
  {
    "text": "Joe Manchin floats Mitt Romney as a potential running mate as he weighs a presidential bid  —  Manchin made the comment Thursday in Cleveland, the latest stop on his “listening tour” as the West Virginia senator ponders a third-party White House campaign.  —  CLEVELAND — Sen, Joe Manchin … ",
    "url": "https://www.nbcnews.com/politics/2024-election/joe-manchin-floats-mitt-romney-potential-running-mate-rcna138977"
  },
  {
    "text": "White House hits Johnson for going on recess without passing Ukraine aid  —  The White House on Thursday bashed Speaker Mike Johnson (R-La.) for starting the House recess without bringing the Senate-passed Ukraine aid package to the floor for a vote.  —  The Senate early Tuesday approved … ",
    "url": "https://thehill.com/homenews/administration/4470043-white-house-hits-johnson-for-going-on-recess-without-passing-ukraine-aid/"
  },
  {
    "text": "Rep. Barbara Lee in California Senate race says minimum wage should be raised to $50  —  Candidates vying for California's U.S. Senate seat met onstage Monday for a relatively tame second debate, where California's cost of living was raised as a key issue.  —  In a standout moment … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/02/15/barbara-lee-minimum-wage/72611446007/"
  },
  {
    "text": "Russia Using Thousands of Musk's Starlink Systems in War, Ukrainian General Says  —  Estimate of Russian use suggests Moscow is eroding a major Ukrainian battlefield advantage  —  KYIV—Ukraine's top military-intelligence officer said Russian invasion forces in his country are using thousands … ",
    "url": "https://www.wsj.com/world/russia-using-thousands-of-musks-starlink-systems-in-war-ukrainian-general-says-29303242"
  },
  {
    "text": "Maryland 2024 Poll: Former Gov. Larry Hogan Starts Strong in Election for Open Senate Seat  —  Trump's Criminal Indictments Raise More Doubts for Voters than Bidens' Age  —  Economy and Crime are Top Issues for Maryland Voters  —  The first Emerson College Polling/The Hill/DC News Now survey … ",
    "url": "https://emersoncollegepolling.com/maryland-2024-poll-former-gov-larry-hogan-starts-strong-in-election-for-open-senate-seat/"
  },
  {
    "text": "McConnell ‘will be involved’ in Montana Senate GOP primary  —  Senate Republican Leader Mitch McConnell (Ky.) says he will be involved in the Senate Republican primary in Montana to help businessman Tim Sheehy, who now faces a challenge from Rep. Matt Rosendale (R-Mont.), win the GOP the nomination.",
    "url": "https://thehill.com/homenews/senate/4470752-mcconnell-will-be-involved-in-montana-senate-gop-primary/"
  }
]