[
  {
    "text": "US Institute of Peace says DOGE has broken into its building  —  President Trump targeted the organization and a few others in a Feb. 19 executive order aiming to shrink the federal government  —  Employees of Elon Musk's Department of Government Efficiency entered the U.S. Institute … ",
    "url": "https://www.nbcwashington.com/news/president-trump-politics/us-institute-of-peace-doge-trump-administration/3869923/"
  },
  {
    "text": "Trump administration guts board of US Institute of Peace.  Group says DOGE arrives  —  The Trump administration fired most of the board of the U.S. Institute of Peace and sent its new leader into the Washington headquarters of the independent organization on Monday, in its latest effort … ",
    "url": "https://apnews.com/article/doge-trump-us-institute-of-peace-03362c3440884c6b29e28ad0d88f5014"
  },
  {
    "text": "For four Venezuelan friends, Alien Enemies Act cuts short an American dream  —  The men had just begun new lives in Dallas when officers arrived at their home and arrested them.  Their relatives deny that they have any connection to the Tren de Aragua gang.  —  Just now",
    "url": "https://www.washingtonpost.com/immigration/2025/03/18/trump-migrants-venezuelans-deportation-bukele/"
  },
  {
    "text": "Elon Musk's Starlink Expands Across White House Complex  —  Trump administration officials said the company donated the internet service, saying the gift had been vetted by the lawyer overseeing ethics issues in the White House Counsel's Office.  —  Starlink, the satellite internet service operated … ",
    "url": "https://www.nytimes.com/2025/03/17/us/politics/elon-musk-starlink-white-house.html?unlocked_article_code=1.404.YQoK.rMD9xAA-77wW&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump calls for impeachment of judge who tried to halt deportations  —  It represents a significant escalation of the president's attempts to push the boundaries of the separation of powers with the courts.  —  President Donald Trump on Tuesday called for the impeachment of the federal judge … ",
    "url": "https://www.politico.com/news/2025/03/18/trump-impeachment-judge-deportations-00235173"
  },
  {
    "text": "Israel resumes war in Gaza with a series of massive airstrikes against Hamas  —  Israel resumed the war in Gaza with a series of massive airstrikes against what it described as Hamas targets all across the enclave overnight.  —  The big picture: The strikes come exactly two months … ",
    "url": "https://www.axios.com/2025/03/18/israel-gaza-war-resumes-airstrikes-hamas"
  },
  {
    "text": "Israel Carries Out ‘Extensive Strikes’ in Gaza, Imperiling Cease-Fire  —  Prime Minister Benjamin Netanyahu's office said he had ordered the attack early Tuesday, saying Israel would “act against Hamas with increasing military strength.”  —  Israeli forces launched a large-scale attack across … ",
    "url": "https://www.nytimes.com/2025/03/17/world/middleeast/israel-gaza-airstrikes.html"
  },
  {
    "text": "Chinese Nationalists Praise Trump's Cuts to Voice of America  —  Beijing has long criticized the outlet, as well as Radio Free Asia, for highlighting human rights abuses in China.  —  Chinese state media is gloating about drastic budget cuts to Voice of America and Radio Free Asia … ",
    "url": "https://www.nytimes.com/2025/03/18/world/asia/china-trump-voice-of-america.html?unlocked_article_code=1.404.AGrb.cTZqkZ_TMexD&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Wired is dropping paywalls for FOIA-based reporting.  Others should follow  —  The news business isn't just any business — it serves a vital role in our democracy, recognized by the First Amendment.  But media outlets can't serve that role if they're bankrupt.",
    "url": "https://freedom.press/issues/wired-is-dropping-paywalls-for-foia-based-reporting-others-should-follow/"
  },
  {
    "text": "This is why Kamala Harris really lost  —  Democrats have spent months debating how and why they lost the 2024 election.  But the full picture of what happened on Election Day is only now coming into view.  —  The most authoritative election analyses draw on a variety of different data sources … ",
    "url": "https://www.vox.com/politics/403364/tik-tok-young-voters-2024-election-democrats-david-shor"
  },
  {
    "text": "Trump Administration Aims to Eliminate E.P.A.'s Scientific Research Arm  —  More than 1,000 chemists, biologists and other scientists could be laid off under a plan to dismantle the Office of Research and Development.  —  The Environmental Protection Agency plans to eliminate its scientific research arm … ",
    "url": "https://www.nytimes.com/2025/03/17/climate/trump-eliminates-epa-science.html?unlocked_article_code=1.404.Vc0I.g23y4hW1tBly&smid=url-share"
  },
  {
    "text": "Trump Says a Recession Might Be Worth the Cost.  Economists Disagree.  —  President Trump and his advisers say his policies may cause short-term pain but will produce big gains over time.  Many economists are skeptical of those arguments.  —  Presidents usually do all they can to avoid recessions … ",
    "url": "https://www.nytimes.com/2025/03/18/business/economy/trump-recession-tariffs-inflation.html"
  },
  {
    "text": "Trump to hold call with Putin in test of deal-making strength  —  U.S. President Donald Trump will speak with Russian President Vladimir Putin on Tuesday in an attempt to convince his counterpart to accept a ceasefire in Russia's war with Ukraine and move toward a more permanent end to the three-year conflict.",
    "url": "https://www.reuters.com/world/europe/trump-hold-call-with-putin-test-deal-making-strength-2025-03-18/"
  },
  {
    "text": "Leaked memo: DOGE plots to cut Social Security phone support  —  An internal memo from the Social Security Administration proposes changes to its phone service that could derail the benefits application process for many Americans.  —  Why it matters: The Trump administration has repeatedly … ",
    "url": "https://www.axios.com/2025/03/17/social-security-trump-doge"
  },
  {
    "text": "Europe courts US scientists fleeing Trump crackdown  —  Cambridge university among institutions seeing chance to hire talent unsettled by US spending cuts  —  Science institutions in Europe and beyond are racing to hire researchers from the US looking to flee the Donald Trump administration's crackdown on research agencies.",
    "url": "https://www.ft.com/content/cdcbe3df-9475-4816-9a95-0df64838566f"
  },
  {
    "text": "Schumer is doing damage control.  It isn't working.  —  The Senate minority leader and his aides have been talking privately with liberal groups.  —  Chuck Schumer is in damage-control mode.  It isn't going great.  —  The Senate minority leader and his aides in recent days … ",
    "url": "https://www.politico.com/news/2025/03/17/schumer-damage-control-liberal-base-00234321"
  },
  {
    "text": "Amid ‘DEI’ purge, Pentagon removes webpage on Iwo Jima flag-raiser  —  Pages celebrating Navajo code talkers and other minority service members were also erased.  —  Jon Swaine is an investigative reporter on Signal at jonswaine.55.  Alex Horton is a national security reporter on Signal at alexhorton.85.",
    "url": "https://www.washingtonpost.com/investigations/2025/03/17/pentagon-dei-native-american-iwo-jima/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyMTg0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzNTY2Mzk5LCJpYXQiOjE3NDIxODQwMDAsImp0aSI6IjFkMTljZThmLTg5MmMtNDc4Ni1hNDgxLTAwZTI3Y2JkOTNkMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI1LzAzLzE3L3BlbnRhZ29uLWRlaS1uYXRpdmUtYW1lcmljYW4taXdvLWppbWEvIn0.Vl4_XrW7cle1xIII9cLwLdvk1HC6o_v-NX15bYKI6FI&itid=gfta"
  },
  {
    "text": "Exclusive: Gates warns White House he can't fill shortfalls in US global health funding  —  Bill Gates is personally lobbying Trump administration officials to keep funding health programs worldwide, from childhood vaccination to HIV treatment, and warning that his foundation cannot step in to fill gaps … ",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/gates-warns-white-house-he-cant-fill-shortfalls-us-global-health-funding-2025-03-18/"
  },
  {
    "text": "The Political Fight of the Century  —  For the first time in decades, America has a chance to define its next political order.  Trump offers fear, retribution, and scarcity.  Liberals can stand for abundance.  —  Donald Trump has promised a “golden age of America.”",
    "url": "https://www.theatlantic.com/ideas/archive/2025/03/abundance-americas-next-political-order/682069/"
  },
  {
    "text": "The Stages of Trumpist Economic Grief  —  Or, how Scott Bessent (sort of) became spiritual  —  While much of MAGA is motivated by hatred of an open society — by racism, misogyny and the desire to end all things woke — the swing voters who put Donald Trump over the top thought they were supporting … ",
    "url": "https://paulkrugman.substack.com/p/the-stages-of-trumpist-economic-grief"
  },
  {
    "text": "How Matt Gaetz poisoned the House Ethics Committee  —  The panel is still reeling from accusations of leaks and breaches of confidentiality in the previous Congress.  —  Scandal-ridden former Rep. Matt Gaetz is gone from Congress, but the wounds he inflicted on the House Ethics Committee that investigated him remain fresh.",
    "url": "https://www.politico.com/news/2025/03/17/house-ethics-committee-matt-gaetz-00232686"
  },
  {
    "text": "At Kennedy Center, Trump envisions remaking Honors, suggests he could host  —  Trump and his board suggested several artists for the awards, including Sylvester Stallone, Andrea Bocelli, Elvis Presley and Babe Ruth.  —  President Donald Trump visited the Kennedy Center on Monday … ",
    "url": "https://www.washingtonpost.com/entertainment/theater/2025/03/17/trump-kennedy-center-honors-board-meeting/"
  },
  {
    "text": "Public Records Reveal How Agencies Complied With Trump's Anti-Trans Order  —  FOIA documents show how agencies dropped everything to comply with Trump order—and that FOIA is still sort of working. … Using the Freedom of Information Act, 404 Media has obtained several memos that government agencies … ",
    "url": "https://www.404media.co/public-records-reveal-how-agencies-complied-with-trumps-anti-trans-order/"
  },
  {
    "text": "There Is No Method to Trump's Madness.  He's Simply Insane. … “They say an old man is twice a child,” Rosencrantz remarks in Shakespeare's Hamlet, as he and the prince of Denmark observe Polonius.  It's a borrowed line, dating back to antiquity: Sophocles wrote, “For the aged man is once again a child.”",
    "url": "https://newrepublic.com/article/192786/trump-tariffs-insane-method-madness"
  }
]