[
  {
    "text": "Family of woman found dead on highway angered by Trump's speech  —  GRAND RAPIDS, Mich. (WOOD) — The sister of murder victim Ruby Garcia said she and her family were home watching live, in disbelief, as former President Donald Trump told an audience in Grand Rapids that he had spoken with “some of her family.”",
    "url": "https://www.woodtv.com/news/target-8/family-of-woman-found-dead-on-highway-angered-by-trumps-speech/"
  },
  {
    "text": "Trump wants “Christian visibility day” … - “You know what it's going to be called? … - His supporters — who queued in a half mile long line in hail and freezing temperatures — shouted their approval. … - “We must make America pray again,” said Trump, who encouraged supporters … ",
    "url": "https://www.axios.com/2024/04/03/trump-wants-christian-visibility-day"
  },
  {
    "text": "Exclusive: Trump Media saved in 2022 by Russian-American under criminal investigation  —  Trump's social media company went public relying partly on loans from trust managed by person of interest to prosecutors  —  Donald Trump's social media company Trump Media managed to go public last week … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/03/trump-media-es-family-trust-2022-loans"
  },
  {
    "text": "Frustrated Prosecutors Ask Trump Documents Judge to Act on Key Claim  —  The push for a quick decision on one of the former president's most far-fetched claims is an unusual and risky move in a case Judge Aileen Cannon has allowed to become bogged down.  —  In an open display of frustration … ",
    "url": "https://www.nytimes.com/2024/04/03/us/politics/trump-documents-case-judge-cannon.html"
  },
  {
    "text": "Special counsel pushes back at Judge Cannon in classified documents case, claims “not a single” Trump White House official backed up former president's claims of privatizing records  —  Washington — Special counsel Jack Smith urged a federal judge to keep a presidential recordkeeping law … ",
    "url": "https://www.cbsnews.com/news/trump-jack-smith-special-counsel-jury-instructions-documents-case/"
  },
  {
    "text": "A humanitarian catastrophe  —  A U.N.-backed report published in mid-March found residents of Gaza are facing “high levels of acute food insecurity.”  According to aid groups, the number of people in Gaza experiencing “catastrophic hunger” has doubled since December.",
    "url": "https://popular.info/p/a-humanitarian-catastrophe"
  },
  {
    "text": "Trump Leads Biden in Six of Seven Swing States, WSJ Poll Finds  —  Incumbent trails in most battlegrounds that decided 2016 and 2020 elections",
    "url": "https://www.wsj.com/politics/elections/trump-biden-poll-swing-states-ad594acb"
  },
  {
    "text": "Trump and RNC raised nearly $66 million in March  —  Former President Trump's campaign and the Republican National Committee (RNC) raised $65.6 million in March, leaders for the two operations announced Wednesday, a sizable haul after fundraising lagged in the first two months of the year.",
    "url": "https://thehill.com/homenews/campaign/4571850-trump-and-rnc-raised-nearly-66-million-in-march/"
  },
  {
    "text": "Trump, RNC raised $65.6 million in March  —  Trump's allies hope the amount will ease concerns about his fundraising.  —  Former President Donald Trump and the Republican National Committee raised $65.6 million in March and ended the month with $93.1 million in cash on hand, according to figures provided to POLITICO.",
    "url": "https://www.politico.com/news/2024/04/03/trump-rnc-raised-65-6-million-march-00150300"
  },
  {
    "text": "Project 2025 reveals its goal: Trump as president for life  —  They're now openly in favor of abolishing the 22nd Amendment. … Project 2025, the Republican plan to functionally annihilate not just the federal government but democracy as well if Trump wins in November, is an unceasing parade of horrors.",
    "url": "https://www.publicnotice.co/p/project-2025-trump-president-for-life"
  },
  {
    "text": "Let People Eat  —  In the worst conditions you can imagine — after hurricanes, earthquakes, bombs and gunfire — the best of humanity shows up.  Not once or twice but always.  —  The seven people killed on a World Central Kitchen mission in Gaza on Monday were the best of humanity.",
    "url": "https://www.nytimes.com/2024/04/03/opinion/jose-andres-let-people-eat.html"
  },
  {
    "text": "Amazon Ditches ‘Just Walk Out’ Checkouts at Its Grocery Stores  —  Amazon Fresh is moving away from a feature of its grocery stores where customers could skip checkout altogether.  —  Amazon is phasing out its checkout-less grocery stores with “Just Walk Out” technology, first reported by The Information Tuesday.",
    "url": "https://gizmodo.com/amazon-reportedly-ditches-just-walk-out-grocery-stores-1851381116"
  },
  {
    "text": "Scoop: Anti-Trump lawyer George Conway gives $900,000 to Biden … The minimum gift for the event is $500.  — The lead hosts are Melissa Moss, a strategic consultant who's very visible around Washington, and her husband, Jonathan Silver.",
    "url": "https://www.axios.com/2024/04/03/george-conway-biden-donation-fundraiser-campaign"
  },
  {
    "text": "U.S. states are cutting off Chinese citizens and companies from land ownership  —  Skepticism about federal protections spurs surge in laws aimed to firewall states from perceived malign Chinese influence through land purchases.  —  State lawmakers are producing a wave of legislation aimed … ",
    "url": "https://www.politico.com/news/2024/04/03/state-laws-china-land-buying-00150030"
  },
  {
    "text": "Oklahoma official with white nationalist ties is ousted in recall vote  —  Judd Blevins, who marched alongside neo-Nazis in Charlottesville, Virginia, in 2017, lost his fight to remain on Enid's City Council.  —  ENID, Okla. — Voters in Enid decided by a nearly 20-point margin Tuesday … ",
    "url": "https://www.nbcnews.com/news/us-news/oklahoma-judd-blevins-enid-city-council-recall-election-rcna146029"
  },
  {
    "text": "House GOP looks beyond impeachment for new Biden targets  —  All told, House Republican Committee chairs sent nearly 50 oversight requests from several different committees.  —  Their impeachment inquiry of President Joe Biden is fizzling.  And now, House Republicans are setting their sights … ",
    "url": "https://www.politico.com/news/2024/04/03/house-gop-impeachment-biden-00150266"
  },
  {
    "text": "Statement from Congresswoman Lauren Boebert's campaign:  —  Yesterday afternoon, Congresswoman Lauren Boebert was admitted to UCHealth Medical Center of the Rockies in Loveland after experiencing severe swelling in her upper left leg.  After undergoing a CT Scan, doctors found an acute blood clot … ",
    "url": "https://www.facebook.com/laurenboebert/posts/pfbid02mzadSWknemesgQEGFZt97nqzduL1Cb89fvYksuEQ4dMnbRn48sKPS7MBUSE9mHHQl"
  },
  {
    "text": "House Republicans want to rename Virginia's Dulles Airport after Donald Trump  —  The bill seeks to rename the airport to “Donald J. Trump International Airport.”  —  Washington Dulles International Airport in Dulles, Va., on March 15, 2023.  —  House Republicans have introduced a bill … ",
    "url": "https://abcnews.go.com/Politics/house-republicans-rename-virginias-dulles-airport-after-donald/story?id=108759614"
  },
  {
    "text": "Blinken Arrives Late to NATO Forum After Latest Plane Breakdown  —  Secretary of State Antony Blinken's latest European tour hit a speed bump in Paris on Wednesday when his official plane broke down, necessitating an hours-long drive to Brussels.  —  A State Department spokesperson … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-03/blinken-arrives-late-to-nato-forum-after-latest-plane-breakdown"
  },
  {
    "text": "Sources: UT lays off at least 60 employees previously in DEI-related position, closes DCCE  —  A week after state Sen. Brandon Creighton warned Texas university system administrators about the state's expectations for higher education institutions to comply with Senate Bill 17 … ",
    "url": "https://www.statesman.com/story/news/politics/state/2024/04/02/texas-senate-bill-17-anti-dei-ut-fires-four-staff-related-positions-two-sources-confirm/73179902007/"
  },
  {
    "text": "Biden Bests Trump on Likability; Trump Seen as Better Leader  —  Biden's character ratings worse than in 2020; Trump's are unchanged  —  WASHINGTON, D.C. — Americans are less likely now than they were in 2020 to believe a number of positive personal qualities and characteristics apply to President Joe Biden.",
    "url": "https://news.gallup.com/poll/643100/biden-bests-trump-likability-trump-seen-better-leader.aspx"
  },
  {
    "text": "Taylor Swift among 141 new billionaires in ‘amazing year for rich people’  —  Combined assets of $14.2tn are more than the GDP of every country except China and the US  —  There are more billionaires than ever before.  The world has 2,781 people with fortunes exceeding $1bn (£800m) … ",
    "url": "https://www.theguardian.com/business/2024/apr/02/world-gains-141-new-billionaires-in-amazing-year-for-rich-people"
  },
  {
    "text": "Mandatory DEI Statements Are Ideological Pledges of Allegiance.  Time to Abandon Them.  —  Council on Academic Freedom at Harvard  —  On a posting for a position as an assistant professor in international and comparative education at the Harvard Graduate School of Education … ",
    "url": "https://www.thecrimson.com/column/council-on-academic-freedom-at-harvard/article/2024/4/2/kennedy-abandon-dei-statements/"
  }
]