[
  {
    "text": "An Infuriating Poll Finding About Trump Should Galvanize Democrats  —  You've probably heard that Donald Trump has “tightened his grip on the Republican Party,” or that he's “bent the party to his will.”  Pundits repeat such formulations constantly, because, well, it's true … ",
    "url": "https://newrepublic.com/article/178951/poll-biden-blamed-border-deal-galvanize-democrats"
  },
  {
    "text": "McConnell urges Mike Johnson to allow vote on Ukraine aid … - “What I do think is appropriate is for the House to be able to work its will on Ukraine, which obviously was the most controversial part of what we did,” McConnell said. … - The debate over the package has taken months … ",
    "url": "https://www.axios.com/2024/02/13/mcconnell-mike-johnson-ukraine-aid-vote"
  },
  {
    "text": "Republicans Are No Longer a Political Party  —  It's become yet another subsidiary of Trump Inc.  —  When historians chronicle the end of the Grand Old Party, they may mark 2024 as the turning point.  Something called the Republican Party will surely exist for years to come … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/republicans-are-no-longer-political-party/677437/"
  },
  {
    "text": "Chief justice gives Jack Smith one week to respond to Trump's bid to stave off trial  —  Trump wants the Supreme Court to keep his federal election trial on hold while he appeals a decision denying him immunity.  —  Chief Justice John Roberts is giving prosecutors a week to respond … ",
    "url": "https://www.politico.com/news/2024/02/13/chief-justice-gives-jack-smith-one-week-to-respond-to-trumps-bid-to-stave-off-trial-00141163"
  },
  {
    "text": "Trump Is Losing It  —  It is unclear whether Donald Trump has forgotten the precise nature of NATO or whether he ever fully grasped it in the first place.  —  What is clear, however, is that Trump — who ostensibly spent four years as president of the United States — has little clue of what NATO is or what NATO does.",
    "url": "https://www.nytimes.com/2024/02/13/opinion/trump-campaign-biden-aging.html"
  },
  {
    "text": "Supreme Court Gives Prosecutors a Week to Respond in Trump Immunity Case  —  The schedule the justices set was not particularly speedy, though nothing prevents the special counsel from filing sooner than the court's Feb. 20 deadline.  —  The Supreme Court on Tuesday gave Jack Smith … ",
    "url": "https://www.nytimes.com/2024/02/13/us/politics/supreme-court-trump-immunity-case.html"
  },
  {
    "text": "Scoop: Inside the GOP plan to stoke fear on Biden's age … - The GOP planning includes hearings and possibly even subpoenas for documents and recordings. … These sources think that any fight will make the White House look bad — and keep a huge Biden vulnerability in the headlines.",
    "url": "https://www.axios.com/2024/02/13/biden-age-republicans-robert-hur-report"
  },
  {
    "text": "Tesla worker killed in fiery crash may be first ‘Full Self-Driving’ fatality  —  Evidence suggests the advanced driver-assistance system was engaged during a fatal crash that killed recruiter Hans von Ohain in 2022  —  The following footage obtained by The Washington Post shows Colorado … ",
    "url": "https://www.washingtonpost.com/technology/interactive/2024/tesla-full-self-driving-fatal-crash/"
  },
  {
    "text": "CDC plans to drop five-day covid isolation guidelines  —  Americans who test positive for the coronavirus no longer need to routinely stay home from work and school for five days under new guidance planned by the Centers for Disease Control and Prevention.  —  The agency is loosening … ",
    "url": "https://www.washingtonpost.com/health/2024/02/13/covid-isolation-guidelines-cdc-change/"
  },
  {
    "text": "Marjorie Taylor Greene rips ‘Curb Your Enthusiasm’: HBO show depicts Trump supporters as ‘racists and red necks’  —  Rep. Marjorie Taylor Greene (R-Ga.) is blasting a politically charged episode of “Curb Your Enthusiasm,” saying it “lied” and painted conservatives in her state and supporters … ",
    "url": "https://thehill.com/blogs/in-the-know/4465171-marjorie-taylor-greene-curb-your-enthusiasm-hbo-georgia/"
  },
  {
    "text": "George Santos and the ‘scandal penalty’  —  A POLITICO analysis shows voters typically punish the party associated with a scandal in the proceeding special election, which could be bad news for Republicans in New York on Tuesday.  —  The Republican in Tuesday's special election in New York … ",
    "url": "https://www.politico.com/news/2024/02/13/george-santos-scandal-new-york-election-00141174"
  },
  {
    "text": "It took me three tries to register to vote in Texas — and I'm an elections reporter  —  Moments after I became a naturalized citizen in 2023, I registered to vote.  Here's what happened next. … When I started working at Votebeat more than a year ago, I knew little about elections.",
    "url": "https://www.texastribune.org/2024/02/13/exas-voter-registration-election-2024/"
  },
  {
    "text": "On Capitol Hill, Republicans Use Bigoted Attacks Against Political Foes  —  House and Senate Republicans have denigrated fellow lawmakers, Biden administration officials and witnesses in racist ways, both in casual comments and in official settings.  —  When Representative Marjorie Taylor Greene … ",
    "url": "https://www.nytimes.com/2024/02/13/us/politics/republicans-racist-language.html"
  },
  {
    "text": "GOP State Rep. Josh Schriver loses staff, committee post after sharing racist conspiracy  —  Arpan Lobo Clara HendricksonDetroit Free Press  —  State Rep. Josh Schriver, R-Oxford, lost his staff and his spot on a legislative committee as punishment for sharing a social media post amplifying a racist conspiracy theory.",
    "url": "https://www.freep.com/story/news/politics/2024/02/12/michigan-josh-schriver-racist-theory/72569870007/"
  },
  {
    "text": "California Democrat Porter says age limits ‘for all elected officials’ should be discussed  —  Rep. Katie Porter (D-Calif.), who's running for the Senate in California, said Monday that age limits “for all elected officials” should be a matter of discussion.",
    "url": "https://thehill.com/homenews/campaign/4464922-california-democrat-porter-says-age-limits-for-all-elected-officials-should-be-discussed/"
  },
  {
    "text": "GOP's Star Witness in Hunter Biden Probe Has Ties to Russian Oligarch  —  House Republicans want voters to take Tony Bobulinski's word over everyone else in Hunter Biden's orbit—except Bobulinski has some unsavory connections of his own  —  Tony Bobulinski, the high-flying investor … ",
    "url": "https://www.thedailybeast.com/gops-star-witness-tony-bobulinski-in-hunter-biden-probe-has-ties-to-russian-oligarch"
  },
  {
    "text": "Scoop: Israeli minister blocking flour Bibi promised Biden would be allowed into Gaza  —  Israeli ultranationalist Finance Minister Bezalel Smotrich is blocking a U.S.-funded flour shipment to Gaza because its recipient is the UN Relief and Works Agency (UNRWA), two Israeli and U.S. officials told Axios.",
    "url": "https://www.axios.com/2024/02/13/israel-gaza-flour-shipment"
  },
  {
    "text": "Senate GOP campaign arm endorses Kari Lake  —  Lake, a one-time anti-establishment MAGA darling, has worked to build relationships with Republicans in D.C. for her Senate bid.  —  Kari Lake's months of courting the Republican establishment in D.C. are paying off.",
    "url": "https://www.politico.com/news/2024/02/13/kari-lake-nrsc-endorsement-00141107"
  }
]