[
  {
    "text": "Live Updates: Trump Lashes Out at Israel and Iran as Fragile Truce Is Tested  —  Mr. Trump suggested that both Israel and Iran had continued fighting despite a cease-fire that both had agreed to hours earlier.  He warned Israel that further attacks would be a “major violation.”  —  Beersheba, Israel",
    "url": "https://www.nytimes.com/live/2025/06/24/world/ceasefire-iran-israel-trump?unlocked_article_code=1.RU8.rCan.toHYhYBQKsMQ&smid=url-share"
  },
  {
    "text": "Trump announces Israel-Iran ceasefire  —  U.S. President Donald Trump said on Monday that a “complete and total” ceasefire between Israel and Iran will go into force with a view to ending the conflict between the two nations.  —  Trump appeared to suggest that Israel and Iran … ",
    "url": "https://www.reuters.com/world/middle-east/trump-announces-israel-iran-ceasefire-2025-06-23/"
  },
  {
    "text": "Trump on Israel, Iran continuing fight: 'They don't know what the f‑‑‑ they're doing'  —  President Trump unleashed on the Israelis and the Iranians on Tuesday, expressing his displeasure at continued fighting between the two adversaries after he announced the parameters of a ceasefire the day before.",
    "url": "https://thehill.com/homenews/5365719-trump-israel-iran-ceasefire/"
  },
  {
    "text": "The Shock-and-Awe Deportations Will Get Worse  —  Last night, Donald Trump sounded relieved as he announced an Israel and Iran ceasefire.  “CONGRATULATIONS TO EVERYONE!” he wrote.  “This is a War that could have gone on for years, and destroyed the entire Middle East, but it didn't, and never will!”",
    "url": "https://www.thebulwark.com/p/the-shock-and-awe-deportations-will-get-worse-supreme-court-trump-israel-iran"
  },
  {
    "text": "Trump successfully pressures Israel to scale back retaliation strike in Iran  —  Under pressure from President Trump, Israeli Prime Minister Benjamin Netanyahu significantly scaled back planned retaliation against Iran's violation of a ceasefire agreement, Israeli and U.S. officials said Tuesday.",
    "url": "https://www.axios.com/2025/06/24/trump-israel-iran-ceasefire-violation"
  },
  {
    "text": "Trump's Cease-Fire Announcement Catches His Own Top Officials by Surprise  —  Before asserting that Iran and Israel had agreed to a cease-fire, President Trump spoke to Prime Minister Benjamin Netanyahu of Israel and Iranian officials, with Qatar helping to mediate.",
    "url": "https://www.nytimes.com/2025/06/23/world/middleeast/trump-ceasefire-israel-iran.html"
  },
  {
    "text": "The Supreme Court just stripped thousands of immigrants of their right to due process  —  In a short, one-paragraph order, the Republican justices ruled on Monday evening that President Donald Trump may effectively nullify a federal law and an international treaty that is supposed to protect immigrants from torture.",
    "url": "https://www.vox.com/scotus/417583/supreme-court-convention-torture-deportation-south-sudan-dhs-dvd"
  },
  {
    "text": "161. The Court's Disastrous Ruling in the Third-Country Removal Case  —  Welcome back to “One First,” an (increasingly frequent) newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  If you're not already a subscriber, I hope you'll consider becoming one (and … ",
    "url": "https://www.stevevladeck.com/p/161-the-courts-disastrous-ruling"
  },
  {
    "text": "Supreme Court eases rapid deportations to countries where immigrants have no ties  —  The high court's majority offered no explanation for its ruling.  —  The Supreme Court on Monday cleared the way for the Trump administration to swiftly deport foreigners to countries where they have no previous ties.",
    "url": "https://www.politico.com/news/2025/06/23/supreme-court-third-party-country-deporations-00419210"
  },
  {
    "text": "Justice Dept. Leader Suggested Violating Court Orders, Whistle-Blower Says  —  Emil Bove III, a Trump judicial nominee, voiced his intent to disobey court orders as others stonewalled and misled judges, according to a complaint.  —  A senior Justice Department official, Emil Bove III … ",
    "url": "https://www.nytimes.com/2025/06/24/us/politics/justice-department-emil-bove-trump-deportations-reuveni.html?unlocked_article_code=1.RU8.o_g5.739ROt8Cpqgp&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Provisions Continue to Violate the Byrd Rule in the Republicans' “One Big, Beautiful Bill”  —  WASHINGTON, D.C. - Today, the Senate Parliamentarian again advised that several provisions in the Republicans' “One Big, Beautiful Bill,” would be subject to a 60-vote threshold if they remain in the bill.",
    "url": "https://www.budget.senate.gov/ranking-member/newsroom/press/provisions-continue-to-violate-the-byrd-rule-in-the-republicans-one-big-beautiful-bill"
  },
  {
    "text": "Senate parliamentarian rejects offshore oil, gas drilling provisions in GOP megabill  —  Senate Parliamentarian Elizabeth MacDonough has ruled against provisions in the GOP megabill to enact President Trump's agenda that would dramatically accelerate the approval of offshore oil and gas projects … ",
    "url": "https://thehill.com/homenews/senate/5365699-senate-parliamentarian-offshore-drilling-gop-megabill/"
  },
  {
    "text": "How the United States Helped Create Iran's Nuclear Program  —  A reactor in Tehran is a monument to the U.S. relationship with Iran when the country was led by a secular, pro-Western monarch.  —  “Atoms for Peace” was born of a speech President Dwight D. Eisenhower delivered in 1953 … ",
    "url": "https://www.nytimes.com/2025/06/24/us/politics/us-iran-nuclear-program.html"
  },
  {
    "text": "Cassidy calls for postponing RFK Jr's vaccine advisory panel meeting  —  Sen. Bill Cassidy (R-La.) called for the delay of this week's meeting of a federal vaccine advisory panel handpicked by Health and Human Services Secretary Robert F. Kennedy Jr, citing concerns about members' lack of experience and potential bias towards vaccines.",
    "url": "https://thehill.com/policy/healthcare/5365441-cassidy-rfk-jr-vaccine-advisory-panel-meeting/"
  },
  {
    "text": "BREAKING: Stephen Miller's Financial Stake in ICE Contractor Palantir Raises Conflict Concerns  —  POGO report shows top Trump adviser owned six-figure stock in company profiting off deportations.  —  Notes  —  WASHINGTON — Stephen Miller, the influential Trump administration aide behind … ",
    "url": "https://migrantinsider.com/p/stephen-miller-palantir"
  },
  {
    "text": "Rep. Robert Garcia elected as the top Democrat on the House Oversight Committee  —  Garcia, 47, in just his second term, defeated a more senior lawmaker to succeed the late Rep. Gerry Connolly on the panel, which provides oversight of the Trump administration.",
    "url": "https://www.nbcnews.com/politics/congress/rep-robert-garcia-elected-top-democrat-house-oversight-committee-rcna214696"
  },
  {
    "text": "Palestinian health authorities say Israel kills 25 waiting on aid as war death toll exceeds 56,000  —  Israeli forces and drones opened fire toward hundreds of people waiting for aid trucks in central Gaza early Tuesday, killing at least 25 people, Palestinian witnesses and hospitals said … ",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-06-24-2025-dbbdba6c1986376e6e09900650814412"
  },
  {
    "text": "Trump Administration to End Protections for 58 Million Acres of National Forests  —  Agriculture Secretary Brooke Rollins said the Clinton-era rule barring road construction and logging was outdated and “absurd.”  —  The Trump administration said on Monday that it would open up 58 million acres … ",
    "url": "https://www.nytimes.com/2025/06/23/climate/trump-end-protections-for-58-million-acres-of-national-forests.html?unlocked_article_code=1.RU8.Dnq0.qdqpUIK2gLwu&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Behind Closed Doors, Harvard Officials Debate a Risky Truce With Trump  —  The university is trying to avoid the appearance of appeasement, something other powerful institutions that made deals with President Trump found impossible.  —  Harvard University, battered by a devastating conflict … ",
    "url": "https://www.nytimes.com/2025/06/24/us/politics/harvard-debate-settlement-trump.html"
  },
  {
    "text": "A majority of Americans disapproves of Trump's Iran airstrikes, CNN poll finds  —  President Donald Trump's decision to launch airstrikes against Iran is broadly unpopular with Americans, according to a new CNN poll conducted by SSRS after the strikes.  —  Americans disapprove of the strikes … ",
    "url": "https://cnn.com/2025/06/24/politics/trump-iran-strikes-poll-cnn-ssrs"
  },
  {
    "text": "GOP probes aim to keep spotlight — and blame — on Biden  —  Republicans have now launched four separate investigations into former President Biden and whether his declining health affected his abilities in the White House.  —  Why it matters: Democrats don't want to talk about Biden after last year's elections.",
    "url": "https://www.axios.com/2025/06/24/republicans-investigations-biden-trump"
  },
  {
    "text": "Parents rally, LGBTQ+ groups push back on online child safety bill  —  The Washington Post's essential guide to tech policy news  —  Happy Tuesday!  Welcome to the heat dome.  Send news tips to: will.oremus@washpost.com  —  Momentum is building behind a bill that would reshape … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/24/kosa-lgbtq-transgender-wachowski-blackburn-coppa/"
  }
]