[
  {
    "text": "J.D. Vance Wanted a Constitutional Crisis  —  An interesting new Politico/Ipsos poll, out today, sheds more light on the electorate's reaction to Donald Trump's recent felony conviction.  Team Trump has been triaging the political damage with relentless messaging of a rigged trial … ",
    "url": "https://www.thebulwark.com/p/jd-vance-wanted-a-constitutional"
  },
  {
    "text": "Trump maintains big lead over Biden and RFK Jr. despite felony conviction, Iowa Poll shows … Two weeks after he was convicted in a New York courtroom of multiple felony counts, former Republican president Donald Trump still holds a double-digit lead over Democratic incumbent Joe Biden in Iowa.",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/2024/06/17/2024-election-donald-trump-vs-joe-biden-vs-robert-kennedy-jr-iowa-poll/74088665007/"
  },
  {
    "text": "New Polling Shows the Real Fallout From the Trump Conviction  —  A new POLITICO Magazine/Ipsos poll shows that Trump's criminal conviction hurts him with independents.  —  Donald Trump's criminal conviction didn't instantly upend the 2024 presidential race.  But the results of a new poll should be worrying for Trump.",
    "url": "https://www.politico.com/news/magazine/2024/06/17/trouble-for-trump-in-a-new-poll-on-his-conviction-00163498"
  },
  {
    "text": "Closing asset loophole could add billions to tax collections, IRS says  —  The Treasury Department said it will enact rules to prevent certain large businesses from depreciating the same asset repeatedly.  —  The Biden administration plans to stop businesses and wealthy individuals … ",
    "url": "https://www.washingtonpost.com/business/2024/06/17/tax-basis-shifting-irs-partnerships/"
  },
  {
    "text": "The IRS wants to end another major tax loophole for the wealthy and raise $50 billion in the process  —  The IRS plans to end a major tax loophole for wealthy taxpayers that could raise more than $50 billion in revenue over the next decade, the U.S. Treasury Department says.",
    "url": "https://apnews.com/article/irs-treasury-tax-audit-income-7c10474b3129c11d28a3e6a6cb245743"
  },
  {
    "text": "“The peanut gallery”: Experts say Cannon opened door to “unheard of” GOP intervention in Trump case  —  GOP attorneys general back Trump after Cannon allowed “everyone under the sun to chime in,” lawyer says  —  There should be no consequences for Donald Trump lying about federal law enforcement officers … ",
    "url": "https://www.salon.com/2024/06/17/the-peanut-gallery-experts-say-cannon-opened-door-to-unheard-of-intervention-in-case/"
  },
  {
    "text": "Maryland governor to pardon 175,000 marijuana convictions in sweeping order  —  The blanket pardon by Gov. Wes Moore is among the country's most far reaching and will forgive decades of low-level marijuana possession charges for an estimated 100,000 people.  —  Maryland Gov. Wes Moore … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/06/16/maryland-mass-pardon-marijuana-conviction/"
  },
  {
    "text": "The war cabinet is gone.  Who's left in Netanyahu's inner circle?  —  Israeli Daytime Pause in Combat Appears to Take Hold in Gaza … The daily pause applies to part of southern Gaza, but not to some of the places most in need.  —  The Israeli military said on Monday … ",
    "url": "https://www.nytimes.com/live/2024/06/17/world/israel-gaza-war-hamas"
  },
  {
    "text": "New Jersey AG charges Democratic power broker George Norcross in bombshell indictment  —  He has long been the subject of scrutiny by law enforcement and a political task force, but has never been charged.  —  New Jersey's attorney general on Monday charged one of the state's most powerful Democrats … ",
    "url": "https://www.politico.com/news/2024/06/17/george-norcross-indictment-new-jersey-corruption-00163700"
  },
  {
    "text": "Sinclair floods local news websites with hundreds of deceptive articles about Biden's mental fitness  —  This month, Sinclair Broadcast Group has flooded a vast network of local news websites with misleading articles suggesting that President Biden is mentally unfit for office.",
    "url": "https://popular.info/p/sinclair-floods-local-news-websites"
  },
  {
    "text": "Surgeon General: Why I'm Calling for a Warning Label on Social Media Platforms  —  One of the most important lessons I learned in medical school was that in an emergency, you don't have the luxury to wait for perfect information.  You assess the available facts, you use your best judgment, and you act quickly.",
    "url": "https://www.nytimes.com/2024/06/17/opinion/social-media-health-warning.html"
  },
  {
    "text": "White House Tears Into New York Post, Other Outlets For New Biden ‘Freeze’ Claim  —  Deputy press secretary Andrew Bates said the Post's ethics “could deal with a little unfreezing.”  —  LOADING  —  White House spokesperson Andrew Bates accused the New York Post, amid other right-wing media … ",
    "url": "https://www.huffpost.com/entry/joe-biden-freeze-hollywood-fundraiser-obama_n_66701d53e4b08889dbe58560"
  },
  {
    "text": "Incoming Post editor tied to self-described ‘thief’ who claimed role in his reporting  —  Unpublished book drafts and other documents raise questions about Robert Winnett's journalistic record just months before he is to assume a top newsroom role.  —  LONDON — The alleged offense was trying … ",
    "url": "https://www.washingtonpost.com/investigations/2024/06/16/washington-post-editor-robert-winnett/"
  },
  {
    "text": "'I'm Like Speechless': CNN's Harry Enten Says Trump ‘Careening Towards A Historic Performance’ With Black Voters  —  CNN senior data reporter Harry Enten said on that Monday former President Donald Trump is hurtling toward a remarkable performance with black voters in the 2024 election.",
    "url": "https://dailycaller.com/2024/06/17/speechless-cnns-harry-enten-says-trump-careening-towards-historic-performance-black-voters/"
  },
  {
    "text": "Trump, Kevin McCarthy and other Republicans gang up on Freedom Caucus chair in primary  —  Rep. Bob Good, R-Va., is facing a hotly contested primary Tuesday against state Sen. John McGuire.  —  GOOCHLAND, Va. — For Rep. Bob Good, Tuesday's primary is about much more than the next member … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-kevin-mccarthy-republicans-bob-good-primary-rcna157442"
  },
  {
    "text": "Greek coastguard threw migrants overboard to their deaths, witnesses say  —  The Greek coastguard has caused the deaths of dozens of migrants in the Mediterranean over a three-year period, witnesses say, including nine who were deliberately thrown into the water.",
    "url": "https://www.bbc.com/news/articles/c0vv717yvpeo"
  },
  {
    "text": "Mystery fundraising firm takes in millions from the Trump campaign  —  The campaign says it has fulfilled its legal reporting obligation, though the spending appears to mirror past attempts to mask who is actually receiving donor cash.  —  Former President Donald Trump's political operation … ",
    "url": "https://www.nbcnews.com/politics/2024-election/mystery-fundraising-firm-takes-millions-trump-campaign-rcna156755"
  },
  {
    "text": "Biden's Title IX rule blocked by judge in 6 additional states  —  A federal judge on Monday temporarily blocked the Biden administration's new Title IX rule expanding protections for LGBTQ+ students in six additional states, dealing another setback for a policy that has been under legal attack by Republican attorneys general.",
    "url": "https://apnews.com/article/title-ix-education-department-9f7b89ec50657436e0e8110799b576d4"
  },
  {
    "text": "Texas Man Sentenced to Nearly 3 Years in Federal Prison for Threatening Violence Against Los Angeles-Area Congresswoman  —  For Immediate Release  —  U.S. Attorney's Office, Central District of California  —  LOS ANGELES - A Texas man was sentenced today to 33 months in federal prison … ",
    "url": "https://www.justice.gov/usao-cdca/pr/texas-man-sentenced-nearly-3-years-federal-prison-threatening-violence-against-los"
  },
  {
    "text": "A tradwife drops a racist slur: Why the right's trolling economy made Lilly Gaddis' rise inevitable  —  Cashing in as a “cancel culture” martyr is getting harder, so attention addicts have to get more extreme  —  Let's stipulate up front that it is theoretically possible that Lilly Gaddis … ",
    "url": "https://www.salon.com/2024/06/17/a-tradwife-drops-a-slur-why-the-rights-trolling-economy-made-lilly-gaddis-rise-inevitable/"
  },
  {
    "text": "Psaki agrees to sit for interview with House panel probing Afghanistan withdrawal  —  Former White House press secretary and current MSNBC host Jen Psaki has agreed to be interviewed by the House Foreign Affairs Committee, Chair Michael McCaul (R-Texas) said this week.",
    "url": "https://thehill.com/policy/defense/4725775-jen-psaki-msnbc-afghanistan-michael-mccaul-foreign-affairs/"
  },
  {
    "text": "Florida Used to Be a Swing State.  Now Democrats Can Only Cling to Glimmers of Hope.  —  Democrats in the state are veering from cautious optimism to complete pessimism about their chances in 2024, with two liberal-leaning ballot measures having the potential to boost turnout.",
    "url": "https://www.nytimes.com/2024/06/17/us/politics/florida-trump-biden-democrats.html"
  },
  {
    "text": "Majority of Hispanics Now Favor Mass Deportation  —  A recent poll found that a majority of Hispanic people favor the mass deportation of undocumented immigrants living in the U.S. illegally.  —  The  —  News/YouGov poll found that a majority of registered voters overall (62 percent) … ",
    "url": "https://www.newsweek.com/majority-hispanics-favor-mass-deportation-1913510"
  },
  {
    "text": "Trump's Tariff Is a Scheme to Shift the Tax Burden to the Non-Rich … Imagine you were a close observer of American politics who fell asleep, say, 25 years ago and woke up last week.  You discover the Republican Party's leader is a wealthy heir who is broadly supported by CEOs and other rich people.",
    "url": "https://nymag.com/intelligencer/article/trumps-tariff-is-a-scheme-to-shift-tax-burden-to-non-rich.html"
  }
]