[
  {
    "text": "Trump urges Christians to vote: 'You won't have to do it' in four years  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4795823-trump-encourages-christians-vote/"
  },
  {
    "text": "Trump Cryptically Declares, 'You Won't Have to Vote Anymore' If He Wins Second Term  —  Former President Donald Trump urged members of a crowd in Florida to vote and said that if he wins, they “won't have to vote anymore.”  —  Speaking at a Turning Point Action event in West Palm Beach on Friday … ",
    "url": "https://www.mediaite.com/trump/trump-cryptically-declares-you-wont-have-to-vote-anymore-if-he-wins-second-term/"
  },
  {
    "text": "How Trump and Vance went from a ‘threat to democracy’ to ‘weird’  —  With Harris at the top of the ticket, Democrats shift to a simpler characterization of Trump.  —  In the days since Vice President Kamala Harris has taken over the campaign against former President Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/26/trump-vance-weird-00171470"
  },
  {
    "text": "Republicans Keep Trying to Copy Trump's Humor — And Voters Keep Cringing  —  Far-right candidates just can't duplicate the flair Trump brings from his TV career.  —  On Monday, in the midst of a speech in his hometown of Middletown, Ohio, one of JD Vance's half-jokes landed with a thud.",
    "url": "https://www.politico.com/news/magazine/2024/07/27/jd-vance-trump-imitation-00171375"
  },
  {
    "text": "Republicans are already souring on JD Vance  —  “I'm a little surprised they didn't vet him as thoroughly as they should have,” said one GOP strategist.  —  JD Vance has had a difficult week, and some Republicans aren't hiding their frustration.  —  Despite momentum after former President … ",
    "url": "https://www.politico.com/news/2024/07/26/republicans-jd-vance-attacks-00171473"
  },
  {
    "text": "This is a misogyny emergency.  A huge outpouring is coming in the runup to the US election  —  This time Kamala Harris will be the target for the social media platforms that promote prejudice  —  In 2016, a historically unprecedented incident took place.  And yet, barely anyone even noticed.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/27/misogyny-emergency-huge-outpouring-kamala-harris-us-electionction"
  },
  {
    "text": "Usha Vance told friends Trump appalled her.  Now she's working to elect him.  —  The potential second lady found Trump's actions on Jan. 6 “deeply disturbing,” a friend said.  But ambition and devotion to her husband ultimately drove her to a place in the former president's campaign.",
    "url": "https://www.washingtonpost.com/politics/2024/07/27/usha-vance-trump-jan6/"
  },
  {
    "text": "Biden to announce plans to reform US supreme court - report  —  US president also to seek constitutional amendment to limit immunity for presidents and various officeholders  —  Joe Biden will announce plans to reform the US supreme court on Monday, Politico reported, citing two people familiar … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/26/biden-to-announce-plans-to-reform-us-supreme"
  },
  {
    "text": "Biden will announce Supreme Court reform plans next week  —  Biden is likely to endorse term limits for the justices, an ethics code and a constitutional amendment limiting presidential immunity.  —  President Joe Biden plans to unveil a proposal on Monday for dramatically reforming the Supreme Court … ",
    "url": "https://www.politico.com/news/2024/07/26/biden-supreme-court-reform-plans-00171493"
  },
  {
    "text": "Donald Trump Seen in Public Without Ear Bandage  —  LOOKS GOOD  —  The former president has ditched the gauze over his right ear which became a viral meme after the Republican National Convention.  —  Journalist  —  Donald Trump ditched his ear bandage for his meeting with Israeli Prime Minister Benjamin Netanyahu on Friday.",
    "url": "https://www.thedailybeast.com/donald-trump-seen-in-public-without-ear-bandage-after-assassination-attempt"
  },
  {
    "text": "Harris Erases Trump's Lead, WSJ Poll Finds  —  Two candidates are effectively tied after Biden's exit shakes up race  —  The presidential race between Kamala Harris and Donald Trump is essentially tied, according to a new Wall Street Journal poll that shows heightened support … ",
    "url": "https://www.wsj.com/politics/elections/harris-erases-trumps-lead-wsj-poll-finds-e286144d"
  },
  {
    "text": "Justice Department reaches $2M in settlements with FBI officials whose texts infuriated Trump  —  Other portions of Peter Strzok's lawsuit over his firing will continue as former FBI attorney Lisa Page's case is resolved.  —  The Justice Department has agreed to pay a total of $2 million … ",
    "url": "https://www.politico.com/news/2024/07/26/peter-strzok-lawsuit-settlement-00171498"
  },
  {
    "text": "Major Democratic donors want Kamala Harris to fire the FTC chair if she becomes president  —  FTC Chair Lina Khan has taken an aggressive approach to antitrust enforcement  —  Not even a week after Kamala Harris took over as the Democratic presidential nominee, major donors are already making demands of her potential administration.",
    "url": "https://qz.com/kamala-harris-democrat-donor-ftc-lina-khan-linkedin-iac-1851606256"
  },
  {
    "text": "Kamala Harris Ignores Hillary Clinton's Playbook  —  could become the U.S.'s first female president, which many had hoped  —  would have been, but Harris hasn't been playing that up.  —  Harris, who is  —  next month, is set to make history if elected in November.",
    "url": "https://www.newsweek.com/kamala-harris-ignores-hillary-clinton-playbook-1930639"
  },
  {
    "text": "As GOP Attacks Harris On ‘Defund The Police,’ It Defends A Criminal Who Honors Cop-Beaters  —  At his rallies, Donald Trump literally salutes the violent insurrectionists who assaulted police on Jan. 6, and he has promised to pardon them if elected president.",
    "url": "https://www.huffpost.com/entry/trump-harris-police-republicans_n_66a41240e4b09577ebd46273"
  },
  {
    "text": "WATCH: Joe Biden's Senior Moment of the Week (Rest in Peace Edition)  —  Weep not for the memories  —  We regret to inform you that Joe Biden is no longer with us.  He was 81 years young.  God rest his soul.  —  OK, sure, he's technically still alive and president of the United States … ",
    "url": "https://freebeacon.com/biden-administration/watch-joe-bidens-senior-moment-of-the-week-rest-in-peace-edition/"
  },
  {
    "text": "Trump meets with Netanyahu for first time since departing White House  —  Former President Donald Trump met with Israeli Prime Minister Benjamin Netanyahu on Friday, the first such meeting between the two men since Trump left the White House more than three years ago.",
    "url": "https://www.cnn.com/2024/07/26/politics/trump-netanyahu-meeting-mar-a-lago/"
  },
  {
    "text": "Cindy and Meghan McCain: Mark Kelly Will Deliver Arizona for Kamala  —  COUNTRY FIRST  —  The McCain family is getting behind Sen. Mark Kelly (R-AZ) for vice president under Kamala Harris.  The late Sen. John McCain's widow, Cindy McCain, and daughter, former The View co-host Meghan McCain … ",
    "url": "https://www.thedailybeast.com/cindy-and-meghan-mccain-mark-kelly-will-deliver-arizona-for-kamala-harris"
  }
]