[
  {
    "text": "Republicans Unite To Block Border Bill Again As Election Year Fight Heats Up  —  Democrats criticized the GOP for walking away from a chance to fix the border, something they have been calling an urgent crisis for years.  —  LOADING  —  WASHINGTON — The Senate rejected for a second … ",
    "url": "https://www.huffpost.com/entry/border-bill-senate-election_n_664f4817e4b042129b89cf01"
  },
  {
    "text": "The White House to the left: We told you so on crime  —  ‘Well-meaning ideas have gone too far, and we need a sensible approach.’  —  The defeat of a liberal Portland prosecutor at the hands of a tough-on-crime challenger has hardened a view among top White House officials that Democrats need … ",
    "url": "https://www.politico.com/news/2024/05/23/white-house-oregan-turn-towards-center-00159588"
  },
  {
    "text": "Louisiana Lawmakers Vote to Make Abortion Pills Controlled Substances  —  The legislation would make possession of the drugs without a prescription a crime in Louisiana, punishable with jail time.  —  Louisiana lawmakers passed legislation on Thursday to make the state the first in the nation … ",
    "url": "https://www.nytimes.com/2024/05/23/us/politics/louisiana-abortion-pills-controlled-substances.html"
  },
  {
    "text": "Louisiana Legislature approves bill classifying abortion pills as controlled dangerous substances  —  Two abortion-inducing drugs could soon be reclassified as controlled and dangerous substances in Louisiana under a first-of-its-kind bill that received final legislative passage Thursday … ",
    "url": "https://apnews.com/article/abortion-pills-louisiana-legislature-controlled-substance-06ea3e8df86b72b473efe8fc71054ddf"
  },
  {
    "text": "Louisiana lawmakers pass criminal penalties for abortion pill possession  —  It now heads to the desk of GOP Gov. Jeff Landry, who has not publicly weighed in on the legislation but is expected to sign it.  —  Louisiana lawmakers on Thursday approved legislation making the possession … ",
    "url": "https://www.politico.com/news/2024/05/23/louisiana-abortion-pill-criminal-penalties-00159735"
  },
  {
    "text": "Top Biden campaign official held Zoom call with Haley supporters hours after she endorsed Trump  —  “The common theme was, they feel homeless and they need a reason to vote for Biden.  A lot of them are just not there yet.”  —  A top official with Joe Biden's presidential campaign held … ",
    "url": "https://www.politico.com/news/2024/05/23/biden-nikki-haley-supporters-trump-endorsement-00159692"
  },
  {
    "text": "Supreme Court allows disputed South Carolina voting map, a win for GOP  —  At issue was whether the map was an unconstitutional attempt to divvy voters up by race — or was permitted partisan gerrymandering.  —  The Supreme Court on Thursday allowed the use of a South Carolina congressional map … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/23/supreme-court-ruling-south-carolina-voting-map-gerrymander/"
  },
  {
    "text": "Another Flag for Alito  —  Don't Despair, Vote  —  My God.  —  Tonight, more reporting from Jodi Kantor, joined by Aric Toler and Judy Tate at The New York Times, on Justice Alito's flag-flying practices.  It turns out that in the summer of 2023, the Alitos flew an “Appeal to Heaven” flag at their summer beach house in New Jersey.",
    "url": "https://joycevance.substack.com/p/another-flag-for-alito"
  },
  {
    "text": "A Unique Election Driven by a Traditional Issue  —  There are a lot of unique and untested variables in this upcoming presidential election.  It is the first race in more than 100 years between an incumbent and former incumbent president (both of whom would be the oldest ever to be inaugurated).",
    "url": "https://www.cookpolitical.com/survey-research/2024-swing-state-project/unique-election-driven-traditional-issue"
  },
  {
    "text": "Clarence Thomas attacks Brown v. Education ruling amid 70th anniversary … - Those remedies came through “extravagant uses of judicial power” to end racial segregation in the 1950s and 60s, Thomas wrote.  — Federal courts have limited power to grant equitable relief … ",
    "url": "https://www.axios.com/2024/05/23/clarence-thomas-supreme-court-racial-segregation"
  },
  {
    "text": "Garland calls Trump's false claim of Biden DOJ plan to potentially assassinate him during FBI's Mar-a-Lago search ‘extremely dangerous’  —  He noted the FBI had a similar policy during the search of Biden's home.  —  A police car is seen outside former President Donald Trump's residence in Mar-A-Lago … ",
    "url": "https://abcnews.go.com/Politics/garland-calls-trumps-false-claim-biden-doj-plan/story?id=110504598"
  },
  {
    "text": "Obama State Dept blocked FBI from arresting supporters of Iran nuclear program in US: Emails  —  The State Department blocked arrests of several individuals suspected of aiding Iran's nuclear program as the Obama administration was negotiating the JCPOA  —  EXCLUSIVE: The Obama-Biden State Department … ",
    "url": "https://www.foxnews.com/politics/obama-state-dept-blocked-fbi-arresting-supporters-iran-nuclear-program-us-emails"
  },
  {
    "text": "Justice Department Sues Live Nation-Ticketmaster for Monopolizing Markets Across the Live Concert Industry  —  For Immediate Release  —  Live Nation-Ticketmaster's Exclusionary Conduct and Dominance Across the Live Concert Ecosystem Harms Fans, Innovation, Artists, and Venues",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-live-nation-ticketmaster-monopolizing-markets-across-live-concert"
  },
  {
    "text": "Natalie Harp: Gatekeeper to the Reich  —  I want to unpack a Marc Caputo story about Natalie Harp, who he says is the person who posted the Reich meme video to Trump's Truth Social account this week.  —  Trump's account posted the Reich video on Monday.  —  On Tuesday, AP identified a troll … ",
    "url": "https://www.emptywheel.net/2024/05/23/natalie-harp-gatekeeper-to-the-reich/"
  },
  {
    "text": "Congressman Andy Ogles admits his claims to have loaned $320,000 to his campaign were not true  —  GOP opponent Courtney Johnston: 'If Andy Ogles is willing to lie about his own money, what won't he lie about?'  —  NASHVILLE, Tenn. (WTVF) — Tennessee Congressman Andy Ogles filed 11 amendments … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/revealed/congressman-andy-ogles-admits-his-claims-to-have-loaned-320-000-to-his-campaign-were-not-true"
  },
  {
    "text": "Florida attorney general says state will investigate Starbucks for DEI practices  —  Florida's top legal officer on Wednesday said the state will investigate Starbucks, the multinational chain of coffeehouses, for its diversity, equity and inclusion practices.",
    "url": "https://www.usatoday.com/story/news/nation/2024/05/23/florida-investigates-dei-starbucks/73816554007/"
  },
  {
    "text": "Will RFK Jr. Swing the Election to Biden?  —  Third parties never win, but on occasion they've been known to determine the loser.  —  No third-party candidate will win the 2024 presidential election or even a single state.  But a third-party candidate could decide the election's outcome.",
    "url": "https://www.wsj.com/articles/will-rfk-jr-swing-the-election-to-biden-307b113e"
  },
  {
    "text": "Spain, Ireland to recognize Palestinian state  —  with ZOYA SHEFTALOVICH  —  PALESTINIAN STATEHOOD  —  SPAIN AND IRELAND TO RECOGNIZE PALESTINIAN STATE TODAY: The governments of Spain and Ireland will today move to recognize Palestinian statehood, in an announcement coordinated with at least … ",
    "url": "https://www.politico.eu/newsletter/brussels-playbook/spain-ireland-to-recognize-palestinian-state/"
  },
  {
    "text": "The Minnesota GOP endorsed an anti-semite for U.S. Senate.  Republicans are silent.  —  Earlier this month, Congressman Tom Emmer (R-MN) blasted college students protesting Israel's military operations in Gaza.  “By these students' own admission, they're not just standing in solidarity with this pro-Hamas … ",
    "url": "https://popular.info/p/the-minnesota-gop-endorsed-an-anti"
  },
  {
    "text": "Do you need a college degree to succeed?  Here's what the data shows.  —  College was once widely viewed as a pathway to success, but today only about 1 in 4 Americans say a bachelor's degree is necessary to secure a well-paying job, according to a new survey from the Pew Research Center.",
    "url": "https://www.cbsnews.com/news/college-degree-income-is-college-worth-it-pew/"
  },
  {
    "text": "Judge Outlines ‘Shell Game’ Played with Classified Docs at Mar-a-Lago  —  THIS WEEK'S MOST IMPORTANT NEWS is barely making headlines: On Tuesday, it was revealed that a federal judge found over a year ago that there is sufficient evidence, if believed by a jury, to find that Donald J. Trump … ",
    "url": "https://www.thebulwark.com/p/judge-outlines-mar-a-lago-shell-game-classified"
  },
  {
    "text": "Far-right ID group expels Alternative for Germany  —  The AfD has been hit by scandals, including potential connections to China and Russia.  —  Germany's far-right Alternative for Germany party (AfD) has been expelled from its pan-European group Identity and Democracy in the European Parliament following … ",
    "url": "https://www.politico.eu/article/far-right-identity-and-democracy-group-expels-alternative-for-germany/"
  }
]