[
  {
    "text": "Trump Has Devoured the Republican Establishment  —  It was almost 15 months ago that The New York Post published a full-page cover photo of Ron DeSantis with the headline “DeFUTURE.”  His 19-point victory in the Florida governor's race was one of the few bright spots of the 2022 elections … ",
    "url": "https://www.nytimes.com/2024/01/30/opinion/trump-republican-establishment.html"
  },
  {
    "text": "First look: John Bolton's predictions for a second Trump term  —  John Bolton — Donald Trump's former national security adviser — is laying out his nightmare scenarios for a second Trump term in a foreword to the paperback edition of his memoir “The Room Where It Happened,” out Tuesday.",
    "url": "https://www.axios.com/2024/01/30/trump-john-bolton-second-term-2024-election"
  },
  {
    "text": "E. Jean Carroll Delivered the Sound Bite That Could Win Trump the Election  —  There's the liberal media's crusade against the former president, but then there's E. Jean Carroll's war against Trump, which is something otherworldly.  She's filed multiple lawsuits against Donald Trump.",
    "url": "https://townhall.com/tipsheet/mattvespa/2024/01/29/e-jean-carroll-delivered-a-huge-in-kind-contribution-to-trump-during-her-msnbc-interview-n2634353"
  },
  {
    "text": "Trump's PACs Spent Roughly $50 Million on Legal Expenses in 2023  —  The former president is facing four criminal indictments and potential trials that could drive his legal bills even higher as he seeks to lock up the Republican presidential nomination.  —  Donald J. Trump piled up legal expenses … ",
    "url": "https://www.nytimes.com/2024/01/30/us/politics/trump-legal-fees.html"
  },
  {
    "text": "Trump Allies Pledge ‘Holy War’ Against Taylor Swift  —  Taylor Swift hasn't even endorsed Joe Biden's 2024 campaign, but Trump is already privately grousing he's “more popular” than her  —  Singer-songwriter Taylor Swift hasn't even endorsed President Joe Biden for reelection yet.",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-more-popular-taylor-swift-maga-biden-1234956829/"
  },
  {
    "text": "E. Jean Carroll Lawyer Threatens to Seek Sanctions Against Trump Attorney for ‘Utterly Baseless’ Claims Judge Was Her ‘Mentor’  —  Trump's lawyer Alina Habba claimed the judge had a conflict of interest based on a tabloid rumor of an alleged 30-year-old professional tie",
    "url": "https://themessenger.com/politics/e-jean-carroll-roberta-kaplan-trump-alina-habba-judge-mentor"
  },
  {
    "text": "IDF says it killed 3 terrorists planning Oct. 7-like attack hiding in Jenin hospital  —  CCTV footage shows undercover forces in fake beards or dressed as Muslim women before they killed 3 armed Hamas members in West Bank medical center, in dramatic 10-minute raid",
    "url": "https://www.timesofisrael.com/idf-says-it-killed-3-terrorists-planning-oct-7-like-attack-hiding-in-jenin-hospital/"
  },
  {
    "text": "Pluralistic: My McLuhan lecture on enshittification (30 Jan 2024)  — My McLuhan lecture on enshittification: Live from Berlin.  — Hey look at this: Delights to delectate.  — This day in history: 2014, 2019, 2023  — Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading",
    "url": "https://pluralistic.net/2024/01/30/go-nuts-meine-kerle/"
  },
  {
    "text": "House Republicans poised to torpedo GOP's best chance in years to pass border bill  —  House Republicans appear to be on the precipice of torpedoing their best opportunity in years of passing border legislation.  —  Republicans had long insisted on changes to border and migration policy … ",
    "url": "https://thehill.com/homenews/house/4436245-house-republicans-border-deal/"
  },
  {
    "text": "GOP moderates send warning shot to Johnson over tax deal  —  Moderate House Republicans sent a warning shot to Speaker Mike Johnson (R-La.) on Tuesday, coming close to blocking legislative action on the House floor in protest of the bipartisan, bicameral tax deal not including an increase in the state and local tax deduction (SALT).",
    "url": "https://thehill.com/homenews/house/4437928-gop-moderates-house-tax-deal-warning-shot/"
  },
  {
    "text": "CONFIRMED: House Democrat Being Criminally Investigated Is ‘Squad’ Member Cori Bush  —  As RedState reported on Monday, a House Democrat is currently under criminal investigation for the misuse of government funds under the guise of paying for “security” services.",
    "url": "https://redstate.com/bonchie/2024/01/30/confirmed-house-democrat-being-criminally-investigated-is-squad-member-cori-bush-n2169406"
  },
  {
    "text": "The ‘Take Our Border Back’ Convoy Is Already a Complete Mess  —  Instead of immigrants, the group of extremists mostly battled each other, paranoia, and their GPS systems.  —  On Monday morning, the organizers of the Take Our Border Back convoy kicked off their road trip to the Texas-Mexico border in Virginia Beach.",
    "url": "https://www.wired.com/story/day-one-take-our-border-back-convoy-texas/"
  },
  {
    "text": "Ohio Man Sentenced to 18 Years in Prison for Firebombing a Church that Planned to Host Drag Show Events  —  For Immediate Release  —  An Ohio man was sentenced yesterday to 216 months in prison followed by three years of supervised release for attempting to burn down a church because of its support for the LGBTQ+ community.",
    "url": "https://www.justice.gov/opa/pr/ohio-man-sentenced-18-years-prison-firebombing-church-planned-host-drag-show-events"
  },
  {
    "text": "Inside Kyrsten Sinema's reelection decision: Will ‘voters even care’ about her record?  —  As she pushes for another tricky bipartisan accomplishment, the deadline nears for the Arizona independent senator to decide on reelection  —  Sen. Kyrsten Sinema (I-Ariz.) has spent the past few months … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/30/kyrsten-sinema-weighs-reelection-arizona-senator/"
  },
  {
    "text": "Justice Sotomayor speaks on frustration following some Supreme Court rulings  —  Supreme Court Justice Sonia Sotomayor opened up on Monday about the “frustration” she said she experiences daily as the high court's conservative supermajority continues to move the country further to the right.",
    "url": "https://www.cnn.com/2024/01/29/politics/sotomayor-supreme-court-frustration/"
  },
  {
    "text": "New US-made longer-range bomb expected to arrive as soon as Wednesday in Ukraine  —  The Ground-Launched Small Diameter Bomb doesn't even exist in the U.S. inventory.  —  The Pentagon has successfully tested a new long-range precision bomb for Ukraine that is expected to arrive on the battlefield … ",
    "url": "https://www.politico.com/news/2024/01/30/new-us-made-longer-range-bomb-expected-to-arrive-as-soon-wednesday-in-ukraine-00138566"
  },
  {
    "text": "Not Just Claudine Gay.  Harvard's Chief Diversity Officer Plagiarized and Claimed Credit for Husband's Work, Complaint Alleges  —  It's not just Claudine Gay.  Harvard University's chief diversity and inclusion officer, Sherri Ann Charleston, appears to have plagiarized extensively in her academic work … ",
    "url": "https://freebeacon.com/campus/not-just-claudine-gay-harvards-chief-diversity-officer-plagiarized-and-claimed-credit-for-husbands-work-complaint-alleges/"
  },
  {
    "text": "Iraq's Kataib Hezbollah suspends attacks on US forces  —  Iran-aligned Iraqi armed group Kataib Hezbollah announced on Tuesday the suspension of all its military operations against U.S. troops in the region, in a decision aimed at preventing “embarrassment” of the Iraqi government, the group said.",
    "url": "https://www.reuters.com/world/middle-east/iraqs-kataib-hezbollah-suspends-military-operations-us-forces-statement-2024-01-30/"
  },
  {
    "text": "Ron DeSantis Calls For Ilhan Omar To Be Expelled From Congress, Denaturalized And Deported  —  Florida Republican Gov. Ron DeSantis called Tuesday for Minnesota Democratic Rep. Ilhan Omar to be expelled from Congress, denaturalized as a U.S. citizen and deported back to Somalia in response … ",
    "url": "https://dailycaller.com/2024/01/30/ron-desantis-call-ilhan-omar-expel-congress-denaturalize-deport/"
  },
  {
    "text": "Proposed bill would give Arizona Legislature authority to override popular vote  —  An Arizona lawmaker wants to give the state Legislature the power to appoint presidential electors regardless of who wins the popular vote.  —  Currently, the candidate who wins the popular vote gets Arizona's electors.",
    "url": "https://www.knau.org/knau-and-arizona-news/2024-01-29/proposed-bill-would-give-arizona-legislature-authority-to-override-popular-vote"
  }
]