[
  {
    "text": "Biden Allows Ukraine to Strike Russia With Long-Range U.S. Missiles  —  With two months left in office, the president for the first time authorized the Ukrainian military to use the system known as ATACMS to help defend its forces in the Kursk region of Russia.",
    "url": "https://www.nytimes.com/2024/11/17/us/politics/biden-ukraine-russia-atacms-missiles.html?unlocked_article_code=1.ak4.aBOC.aSmYrVBqcXMF&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Biden allows Ukraine to use US arms to strike inside Russia  —  President Joe Biden's administration will allow Ukraine to use U.S.-provided weapons to strike deep into Russian territory, three sources familiar with the matter said, in a significant change to Washington's policy in the Ukraine-Russia conflict.",
    "url": "https://www.reuters.com/world/biden-lifts-ban-ukraine-using-us-arms-strike-inside-russia-2024-11-17/"
  },
  {
    "text": "Biden authorizes Ukraine to use US-supplied long-range missiles for deeper strikes inside Russia  —  President Joe Biden has authorized Ukraine to use U.S.-supplied long-range missiles to strike deeper inside Russia, easing limitations on the weapons as Russia deploys thousands of North Korean troops … ",
    "url": "https://apnews.com/article/biden-ukraine-long-range-weapons-russia-52d424158182de2044ecc8bfcf011f9c"
  },
  {
    "text": "Biden approves Ukraine's use of long-range U.S. weapons inside Russia, reversing policy  —  The Biden administration will allow Kyiv limited use of ATACMS to strike enemy positions in Russia, according to senior U.S. officials.  —  President Joe Biden has authorized Ukraine to use … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/17/ukraine-russia-north-korea-atacms/"
  },
  {
    "text": "Trump Signals a ‘Seismic Shift,’ Shocking the Washington Establishment  —  The president-elect's early transition moves amount to a generational test of a system as he seeks to rewrite the balance of power and install lieutenants to blow up key parts of government.  —  Somehow disruption doesn't begin to cover it.",
    "url": "https://www.nytimes.com/2024/11/17/us/politics/trump-signals-a-seismic-shift-shocking-the-washington-establishment.html"
  },
  {
    "text": "Republicans suddenly think the economy's great and the election wasn't rigged  —  Less than two weeks since Donald Trump's victory, consumer sentiment in the Republican Party has skyrocketed.  Democrats, meanwhile, are despondent.  —  The vibes have officially shifted.  —  The economy Donald Trump said was broken?",
    "url": "https://www.politico.com/news/2024/11/17/republicans-trump-win-economy-election-security-confidence-00189941"
  },
  {
    "text": "After Flurry of Cabinet Picks, Trump Rethinks Candidates for Treasury Secretary  —  President-elect Donald J. Trump is expected to invite the contenders for the role, including Kevin Warsh and Marc Rowan, to Mar-a-Lago this week.  —  President-elect Donald J. Trump is eyeing a new candidate … ",
    "url": "https://www.nytimes.com/2024/11/17/us/politics/trump-treasury-candidates.html"
  },
  {
    "text": "Enough  —  For the past decade, as Donald Trump has risen in political stature, I have waited for that precarious but inevitable moment when his well-documented liabilities would end his political ascendancy, when it would all finally be too much.  I waited through scandalous allegations … ",
    "url": "https://www.nytimes.com/2024/11/17/opinion/america-trump-tolerance.html"
  },
  {
    "text": "Trump Makes RFK Jr. Pose with McDonald's Meal  —  Robert F. Kennedy Jr., who's set to run the Health and Human Services Department, recently complained that flying with Trump means eating “poison”  —  Robert F. Kennedy Jr., who is Donald Trump's pick to run the Department of Health and Human Services … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-rfk-jr-mcdonalds-meal-seed-oil-1235169870/"
  },
  {
    "text": "Undocumented migrants hope Trump mass deportations only ‘for criminals’  —  Gabriela entered the United States more than two decades ago, gasping for breath under a pile of corn stalks in the boot of a smuggler's car.  —  Now a housekeeper in Maryland, the Bolivian national … ",
    "url": "https://www.bbc.com/news/articles/c79zxjj0j55o"
  },
  {
    "text": "Pollster Ann Selzer ending election polling, moving ‘to other ventures and opportunities’  —  Public opinion polling has been my life's work.  I collected my first research data as a freshman in college, if you don't count a neighborhood poll I did at age 5.",
    "url": "https://www.desmoinesregister.com/story/opinion/columnists/2024/11/17/ann-selzer-conducts-iowa-poll-ending-election-polling-moving-to-other-opportunities/76334909007/"
  },
  {
    "text": "A study found that X's algorithm now loves two things: Republicans and Elon Musk … Elon Musk's X may have tweaked its algorithm to boost his account, along with those of other conservative-leaning users, starting around the time he announced his support of Donald Trump's presidential campaign.",
    "url": "https://www.theverge.com/2024/11/17/24298669/musk-trump-endorsement-x-boosting-republican-posts-july-algorithm-change"
  },
  {
    "text": "From the Amazon rainforest, Biden declares nobody can reverse US progress on clean energy  —  Joe Biden witnessed the devastation of drought up close as the first sitting American president to visit the Amazon rainforest Sunday, declaring that nobody can reverse “the clean energy revolution that's underway … ",
    "url": "https://apnews.com/article/biden-amazon-peru-g20-3cc827382d1e3c32865a14616ddfe467"
  },
  {
    "text": "Trump Team Is Seeking to Ease US Rules for Self-Driving Cars  — Policy leaders are being pursued for key Musk priority  — Tesla CEO, named to efficiency role, plans push on robotaxis  —  Members of President-elect Donald Trump's transition team have told advisers they plan … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-17/trump-team-said-to-want-to-ease-us-rules-for-self-driving-cars"
  },
  {
    "text": "Philippines, United States to sign military intelligence-sharing deal  —  The Philippines and the United States will sign on Monday a military intelligence-sharing deal, Manila's defence ministry said, in a further deepening of security ties between the two defence treaty allies.",
    "url": "https://www.reuters.com/world/philippines-united-states-sign-military-intelligence-sharing-deal-2024-11-18/"
  },
  {
    "text": "Speaker Mike Johnson leaves the door open to recess appointments  —  The House speaker Johnson told “Fox News Sunday” that “we'll have to see how this develops” when asked whether he'd let Trump bypass the usual Senate confirmation process.  —  House Speaker Mike Johnson on Sunday left … ",
    "url": "https://www.nbcnews.com/politics/congress/mike-johnson-leaves-door-open-recess-appointments-trump-cabinet-rcna180540"
  },
  {
    "text": "Playbook: Heritage comes out of the bunker  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  SIREN FOR THE E RING — “PETE HEGSETH, President-elect DONALD TRUMP's pick for secretary of defense, paid a woman who accused him of sexual assault as part … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/17/heritage-comes-out-of-the-bunker-00190035"
  }
]