[
  {
    "text": "Speaker Kevin McCarthy On The Attack On Israel And What The GOP Caucus Must Do Next  —  Speaker Kevin McCarthy joined me this morning:  —  Audio:  —  10-09hhs-mccarthy  —  Transcript:  —  HH: I'm joined by Speaker Kevin McCarthy, longtime friend of mine and of the program.  Good morning, Mr. Speaker.",
    "url": "https://hughhewitt.com/speaker-kevin-mccarthy-on-the-attack-on-israel-and-what-the-gop-caucus-must-do-next"
  },
  {
    "text": "Kevin McCarthy says he's willing to return as House speaker  —  Rep. Kevin McCarthy (R-Calif.) said Monday that he is willing to resume serving as House speaker if enough of the Republicans who voted in favor of his ouster last week are open to his reinstatement.",
    "url": "https://www.washingtonpost.com/politics/2023/10/09/house-republican-speaker/"
  },
  {
    "text": "Nine Americans Killed by Hamas in Israel, US Confirms  —  The United States on Monday said nine Americans were killed in Israel and other U.S. citizens were missing, following Saturday's unprecedented Hamas attack that killed 700 Israelis.  —  “At this time, we can confirm the deaths of nine U.S. citizens … ",
    "url": "https://freebeacon.com/latest-news/nine-americans-killed-in-massive-hamas-terror-attack-on-israel-us-confirms/"
  },
  {
    "text": "9 US citizens dead in Israel conflict  —  Nine US citizens have died in the conflict in Israel, US authorities said Monday, and an unknown number remain missing.  —  “At this time, we can confirm the death of nine U.S. citizens.  We extend our deepest condolences to the victims and to the families … ",
    "url": "https://www.cnn.com/2023/10/09/politics/americans-israel-gaza/"
  },
  {
    "text": "9 U.S. citizens have died in the Israel-Gaza conflict, U.S. officials say  —  Nine U.S. citizens have died after the attack on Israel from Gaza by Hamas, officials from the U.S. State Department and the National Security Council confirmed Monday.  —  Three days since the conflict began … ",
    "url": "https://www.npr.org/2023/10/09/1204639253/israel-gaza-hamas-us-citizens-killed"
  },
  {
    "text": "Robert F. Kennedy Jr. to Run for President as Independent, Leaving Democratic Primary  —  The political scion told supporters he would end his campaign as a Democratic candidate and run as an independent, potentially upsetting the dynamics of the 2024 election.",
    "url": "https://www.nytimes.com/2023/10/09/us/politics/robert-f-kennedy-jr-independent.html"
  },
  {
    "text": "Team Trump Is Using ‘Fyre Festival Strategies’ in N.Y. Fraud Case  —  There's no chance of actually winning on the merits.  So Trump and his lawyers are hoping to score some PR points, kick up as much dirt as possible, enrage the judge, trash some of the witnesses, and turn the process into a media circus",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-team-new-york-fraud-case-media-circus-1234848510/"
  },
  {
    "text": "Republicans respond to attack on Israel by demonstrating their unfitness  —  From Tim Scott to Trump, they couldn't resist smearing Biden with shameless lies. … During a Fox News hit Saturday, RNC Chair Ronna McDaniel reacted to Hamas's attack on Israel by calling it a “great opportunity” for Republican candidates.",
    "url": "https://www.publicnotice.co/p/hamas-attack-israel-republican-responses-lies"
  },
  {
    "text": "Scoop: Netanyahu tells Biden “we have to go” into Gaza … “We have to go in,” the Israeli leader said, according to three Israeli and U.S. sources briefed on the call. … - “We have to go in. … - The White House and the Israeli Prime Minister's Office declined to comment.",
    "url": "https://www.axios.com/2023/10/09/netanyahu-ground-invasion-gaza-israel-hamas-biden"
  },
  {
    "text": "A Fake Loan Could Mean Real Trouble for George Santos  —  Representative George Santos was seemingly implicated in a fraudulent loan scheme that his treasurer admitted in her guilty plea.  —  Of all of the revelations to emerge from the federal prosecution of Representative George Santos's treasurer … ",
    "url": "https://www.nytimes.com/2023/10/09/nyregion/george-santos-nancy-marks.html"
  },
  {
    "text": "Top Senate Republicans seek to reprimand Willis over Trump charges  —  Georgia Senate leaders ask new state panel to launch investigation into Fulton's top prosecutor  —  Georgia Senate Republicans filed a formal complaint to punish Fulton County District Attorney Fani Willis after she sought charges … ",
    "url": "https://www.ajc.com/politics/top-senate-republicans-seek-to-reprimand-willis-over-trump-charges/2HB45YLJUNCFLODJXRHQ4USPN4/"
  },
  {
    "text": "There Are No Rules  —  States and quasi-states are using extreme, uninhibited violence against civilian populations.  —  The “rules-based world order” is a system of norms and values that describe how the world ought to work, not how it actually works.  This aspirational order is rooted … ",
    "url": "https://www.theatlantic.com/international/archive/2023/10/israel-war-hamas-terrorism-ukraine-russia/675590/"
  },
  {
    "text": "White House blasted for throwing barbecue as war rages in Israel  —  The White House came under criticism on Sunday for holding a barbecue with a live band while war continues to rage in Israel, with United States citizens confirmed to be among the deceased after Hamas's surprise terror attacks.",
    "url": "https://www.washingtonexaminer.com/news/white-house/bbq-criticism-war-israel"
  },
  {
    "text": "The Roots of Today's Authoritarianism Come From a 19th Century Supreme Court Ruling  —  In 1883, the Supreme Court refused to do away with racial segregation.  And that's helped set the stage for today's massive resistance to multiracial power.  —  A new Supreme Court term is upon us … ",
    "url": "https://www.politico.com/news/magazine/2023/10/09/supreme-court-history-race-authoritarianism-00119955"
  },
  {
    "text": "What is the Gaza Strip?  Who controls it?  Here's what to know  —  The Hamas attack that has killed hundreds was launched from one of the most densely populated and impoverished strips of land in the world.  —  What is the Gaza Strip?  —  The Gaza Strip refers to a narrow strip … ",
    "url": "https://www.nbcnews.com/news/gaza-strip-controls-s-know-rcna119405"
  },
  {
    "text": "Newsom signs landmark emissions, climate risk disclosure laws  —  California Gov. Gavin Newsom (D) signed off on a pair of rules that will require large corporations that do business in the Golden State to disclose their greenhouse gas emissions and climate-related risk.",
    "url": "https://thehill.com/homenews/state-watch/4245951-newsom-signs-landmark-emissions-climate-risk-disclosure-laws/"
  },
  {
    "text": "The inside story of how Newsom picked Butler for Senate  —  The madcap 48 hours that went into Gov. Gavin Newsom naming Laphonza Butler a U.S. senator.  —  SACRAMENTO, Calif. — California Gov. Gavin Newsom knew he needed a succession plan for Sen. Dianne Feinstein's seat.  He just didn't want to believe it.",
    "url": "https://www.politico.com/news/2023/10/09/gavin-newsom-laphonza-butler-pick-00120477"
  },
  {
    "text": "Nobel economics prize awarded to Claudia Goldin for women's role in workplace  —  The Harvard professor was honored for ‘groundbreaking research’ on women's job market outcomes  —  Professor Claudia Goldin, a trailblazing economist at Harvard University, on Monday was awarded the Nobel Memorial Prize … ",
    "url": "https://www.washingtonpost.com/business/2023/10/09/nobel-prize-economics-claudia-goldin-2023/"
  },
  {
    "text": "As false war information spreads on X, Musk promotes unvetted accounts  —  Information researchers said that the new outbreak of violence between Israel and Hamas is an early test of how the revamped X conveys accurate data during a major crisis.  —  As false information … ",
    "url": "https://www.washingtonpost.com/technology/2023/10/08/israel-hamas-disinfo-musk-twitter-x/"
  }
]