[
  {
    "text": "Judge rules Donald Trump defrauded banks, insurers while building real estate empire  —  A judge ruled Tuesday that Donald Trump committed fraud for years while building the real estate empire that catapulted him to fame and the White House.  Judge Arthur Engoron, ruling in a civil lawsuit brought … ",
    "url": "https://apnews.com/article/donald-trump-letitia-james-fraud-lawsuit-1569245a9284427117b8d3ba5da74249"
  },
  {
    "text": "Judge Finds Trump Inflated Property Values, a Victory for New York A.G.  —  The decision will simplify the path for Attorney General Letitia James, who has accused former President Donald J. Trump of overvaluing his holdings by as much as $2.2 billion.  —  The New York attorney general won … ",
    "url": "https://www.nytimes.com/2023/09/26/nyregion/trump-james-fraud-trial.html"
  },
  {
    "text": "Trump fraudulently inflated his net worth by up to $2.2 billion, New York judge rules  —  The ruling is a major blow for Trump and his business empire in the run-up to a civil fraud trial.  —  NEW YORK — A state judge on Tuesday found Donald Trump and his company liable for fraud for inflating … ",
    "url": "https://www.politico.com/news/2023/09/26/trump-fraud-trial-inflate-net-worth-00118269"
  },
  {
    "text": "Judge rules Trump engaged in repeated fraud, effectively deciding central question in $250M civil trial  —  The civil case is scheduled to go to trial on Oct. 2.  —  Former President Donald Trump submitted “fraudulent valuations” for assets that were then used by himself … ",
    "url": "https://abcnews.go.com/Politics/donald-trump-submitted-fraudulent-valuations-assets-secure-loans/story?id=103508205"
  },
  {
    "text": "New Senate Proposal Aims to Head Off Weekend Government Shutdown  —  An agreement between Senate Republicans and Democrats would keep agencies open through mid-November and provide billions in aid for Ukraine and disaster relief.  But House Republicans are likely to balk.",
    "url": "https://www.nytimes.com/2023/09/26/us/politics/senate-bill-government-shutdown.html"
  },
  {
    "text": "Inside the spending cuts House Republicans are fighting for  —  Good morning, Early Birds.  If you like Kehinde Wiley's famous portrait of former president Barack Obama, check out his new exhibition of portraits of 11 African leaders.  Tips: earlytips@washpost.com.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/09/26/inside-spending-cuts-house-republicans-are-fighting/"
  },
  {
    "text": "Scoop: Biden team's don't-let-him-trip mission … - With a physical therapist, Biden has been doing exercises to improve his balance as far back as November 2021.  — Since his stumble in June, he has been wearing tennis shoes more often to avoid slipping — and using the short stairs on Air Force One … ",
    "url": "https://www.axios.com/2023/09/26/biden-trip-2024-campaign-sneakers"
  },
  {
    "text": "Commander Biden bites another Secret Service agent, the 11th known incident  —  President Joe Biden's younger dog, Commander, bit another US Secret Service agent at the White House Monday evening, CNN has learned, the 11th known biting incident involving the 2-year-old German Shepherd.",
    "url": "https://www.cnn.com/2023/09/26/politics/commander-biden-biting-incident/"
  },
  {
    "text": "Cassidy Hutchinson warns second Trump term wouldn't have ‘guardrails’  —  Cassidy Hutchinson, a former White House aide who became a star witness for the committee investigating the Jan. 6, 2021, attack on the Capitol, warns that a second term for President Trump would be more chaotic than the first one.",
    "url": "https://thehill.com/homenews/4224175-cassidy-hutchinson-warns-second-trump-term-wouldnt-have-guardrails/"
  },
  {
    "text": "Target Closes Select Stores to Prioritize Team Member and Guest Safety  —  At Target, we take the decision to close stores very seriously, and only do so after taking meaningful steps to invest in the guest experience and improve business performance.  With that said, we have made the difficult decision … ",
    "url": "https://corporate.target.com/press/releases/2023/09/Target-Closes-Select-Stores-to-Prioritize-Team-Mem"
  },
  {
    "text": "The Sick, Racist Message Behind Why Trump Chose That Particular Gun Store  —  During a campaign trip to South Carolina, Donald Trump took some time to visit the gun store that sold weapons to the racist Jacksonville, Florida, mass shooter.  —  Trump visited Palmetto State Armory on Monday … ",
    "url": "https://newrepublic.com/post/175764/trump-gun-store-south-carolina-palmetto-state-armory-racist-message"
  },
  {
    "text": "The GOP's defenses of Bob Menendez, and what they ignore  —  The dam is breaking on Democrats urging Sen. Bob Menendez (D-N.J.) to resign.  They responded with cautious silence Friday after the Justice Department announced Menendez's indictment on bribery charges; by Tuesday … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/26/gops-defenses-bob-menendez-what-they-ignore/"
  },
  {
    "text": "From secretaries to secretary of state, Biden documents probe casts wide net: Sources  —  Investigators have interviewed scores of witnesses — some more than once.  —  The federal investigation into President Joe Biden's handling of classified documents prior to becoming president has grown … ",
    "url": "https://abcnews.go.com/US/secretaries-secretary-state-biden-documents-probe-casts-wide/story?id=103504213"
  },
  {
    "text": "Fulton DA prosecuting Trump, Young Thug says her family has been threatened  —  'It's been very troubling,' Fani Willis tells event crowd  —  X  —  Fulton County District Attorney Fani Willis, whose office is prosecuting cases involving former President Donald Trump … ",
    "url": "https://www.ajc.com/news/crime/fulton-da-prosecuting-trump-young-thug-says-her-family-has-been-threatened/QJZMKODGUJHWBGSBIMSPV3WDEM/"
  },
  {
    "text": "Hunter Biden received $250K wires originating in Beijing with beneficiary address listed as Joe Biden's home  —  EXCLUSIVE: Hunter Biden received wires that originated in Beijing for more than $250,000 from Chinese business partners during the summer of 2019 — wires that listed the Delaware home … ",
    "url": "https://www.foxnews.com/politics/hunter-biden-received-250k-wire-from-beijing-with-beneficiary-address-listed-as-joe-biden-delaware-home"
  },
  {
    "text": "FTC Sues Amazon for Illegally Maintaining Monopoly Power  —  Amazon's ongoing pattern of illegal conduct blocks competition, allowing it to wield monopoly power to inflate prices, degrade quality, and stifle innovation for consumers and businesses  —  The Federal Trade Commission … ",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2023/09/ftc-sues-amazon-illegally-maintaining-monopoly-power"
  },
  {
    "text": "CBS News poll: Trump leads in Iowa and New Hampshire, where retail campaigning hasn't closed the gap  —  The conventional wisdom is that retail politics — the door-knocking, hand-shaking grassroots campaigning for months before the primaries — make Iowa and New Hampshire different from what we see nationally.",
    "url": "https://www.cbsnews.com/news/trump-2024-poll-gop-primary-iowa-new-hampshire/"
  },
  {
    "text": "California is first state to levy a tax on guns and ammo to fund safety programs  —  SACRAMENTO, Calif. — California will ban people from carrying firearms in most public places while doubling the taxes on guns and ammunition sold in the state under two new laws Gov. Gavin Newsom signed Tuesday … ",
    "url": "https://www.npr.org/2023/09/26/1201879555/california-is-only-state-to-levy-a-tax-on-guns-and-ammunition-to-fund-safety-pro"
  },
  {
    "text": "Pro-Trump Lawyer Tells Georgia Judge ‘Less Than Two Months’ of Legal Advice Isn't Racketeering  —  Ken Chesebro says his role in the alleged conspiracy fell “well short of the substantial period of time” required for a RICO prosecution  —  A Facebook icon representing an external link … ",
    "url": "https://themessenger.com/politics/ken-chesebro-georgia-trump-racketeering-rico"
  },
  {
    "text": "A fire at a wedding hall in northern Iraq has killed more than 100 people and injured 150  —  A fire that raced through a hall hosting a Christian wedding in northern Iraq killed at least 100 people and injured 150 others, authorities said Wednesday, warning the death toll could rise.",
    "url": "https://apnews.com/article/iraq-wedding-hall-fire-1d8a5dbbda46a01b1688a547b95b39a3"
  },
  {
    "text": "‘Thwarted diabolical plot’: Man arrested minutes before mass shooting at Northern Virginia church, police say  —  Authorities arrested a man who they say was minutes away from carrying out a mass shooting at a church in Northern Virginia on Sunday morning.  —  Rui Jiang, 35 … ",
    "url": "https://www.nbcwashington.com/news/local/northern-virginia/man-arrested-minutes-before-mass-shooting-at-northern-virginia-church-authorities/3430595/"
  },
  {
    "text": "Decapitation Victim's Dad Pleads for Leniency for Sex Killer  —  “Everybody makes bad choices,” Michael Thyrion said of Taylor Schabusiness.  —  Warning: This story contains graphic description of violence.  —  A Wisconsin woman on Tuesday was sentenced to life in prison without the possibility … ",
    "url": "https://www.thedailybeast.com/taylor-schabusiness-sentenced-to-life-without-parole-after-shad-thyrions-father-urges-leniency"
  },
  {
    "text": "Trump expands criminal defense team  —  Emil Bove, a former federal prosecutor, and Kendra Wharton, a white collar defense lawyer, joined the former president's legal team after the abrupt departures of three Trump attorneys over the summer.  —  Donald Trump has added at least two veteran attorneys … ",
    "url": "https://www.politico.com/news/2023/09/26/trump-criminal-defense-team-prosecutor-00118258"
  },
  {
    "text": "Senators reveal bipartisan plan to avert shutdown for 7 weeks  —  The measure effectively punts bigger fights on Ukraine aid and disaster relief in order to move the agreement more quickly through the Senate.",
    "url": "https://www.politico.com/live-updates/2023/09/26/congress/senate-unveils-spending-stopgap-00118227"
  }
]