[
  {
    "text": "Trump interferes with House GOP messaging on Cuellar indictment … - The National Republican Congressional Committee plans to accuse Democrats of a double standard if they stay mum on Cuellar following their pressure on ex-Rep. George Santos (R-N.Y.) to resign, Politico reports.",
    "url": "https://www.axios.com/2024/05/06/trump-house-gop-cuellar-resign"
  },
  {
    "text": "Playbook: GOP eyes some Santos payback  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — Gaza cease-fire talks appear to have collapsed following a Hamas rocket attack yesterday that killed three soldiers at an Israeli checkpoint … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/06/gop-eyes-some-santos-payback-00156216"
  },
  {
    "text": "400 Rich People Pay $40K to Hear Trump Glorify Cop Assailants  —  On Saturday, a bunch of people paid a lot of money — at least $40,0000 apiece, and one or two people took Trump up on an offer to speak if they gave $1 million — to hear Trump glorify cop assailants.",
    "url": "https://www.emptywheel.net/2024/05/06/400-rich-people-pay-40k-to-hear-trump-glorify-cop-assailants/"
  },
  {
    "text": "Hunter Biden's revenge  —  Smear campaigns have consequences.  —  ∙ Paid … Have you noticed that after years of saturation coverage, Fox News hosts have suddenly cooled it on the Hunter Biden stuff?  There's a reason for that.  —  Last week, Fox News pulled the six-part series … ",
    "url": "https://www.publicnotice.co/p/hunter-biden-sues-fox-news-explained"
  },
  {
    "text": "Noem suggests Biden's dog Commander should suffer a similar fate to Cricket, the dog she shot  —  South Dakota Gov. Kristi Noem suggests in her new book that President Joe Biden's dog Commander should suffer a similar fate to the working dog she shot on her farm.",
    "url": "https://www.cnn.com/2024/05/05/politics/kristi-noem-dog-commander-biden/"
  },
  {
    "text": "Behind the Curtain: 6% of six states … - Those were the battlegrounds disputed by Donald Trump after the 2020 election. … - A seventh state, North Carolina, is included in some swing-state polls. … Republicans think they're winning.  The swing-state map is a big reason why.",
    "url": "https://www.axios.com/2024/05/06/biden-trump-election-swing-states"
  },
  {
    "text": "It's a tie: Biden 37%-Trump 37% as Hispanic, Black and younger voters shift - Exclusive  —  Susan Page Sudiksha Kochi Rachel BarberUSA TODAY  —  It couldn't be closer.  —  Six months before Election Day, President Joe Biden and former President Donald Trump are tied 37%-37% … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/06/biden-trump-tie-hispanic-black-younger-voters/73504174007/"
  },
  {
    "text": "Congressman praises racist heckling.  Will his corporate backers stand by him?  —  On Thursday, Jaylin Smith, a graduate student at the University of Mississippi, participated in a small, non-violent protest calling for a ceasefire in Gaza.  Smith and the other protesters were greeted … ",
    "url": "https://popular.info/p/congressman-praises-racist-heckling"
  },
  {
    "text": "Sen. Bernie Sanders Will Run For Reelection  —  The 82-year-old Vermont independent is seeking a fourth term in the Senate.  —  LOADING  —  WASHINGTON ― Sen. Bernie Sanders (I-Vt.) announced on Monday his intention to seek reelection to a fourth term in the Senate, citing the threats to democracy at home and abroad.",
    "url": "https://www.huffpost.com/entry/bernie-sanders-reelection_n_6638f12ae4b00641c4961dff"
  },
  {
    "text": "Prosecutors move deeper into Trump's orbit as testimony in hush money trial enters a third week  —  AP is live outside Trump Tower in New York as Donald Trump's hush money trial enters a third week.  —  Photos  —  The judge presiding over Donald Trump's hush money trial fined him $1,000 … ",
    "url": "https://apnews.com/article/trump-trial-hush-money-c41df6a82434247352fe7a110daae981"
  },
  {
    "text": "Congress voted against funding a cure for cancer just to block a win for Biden  —  Some Republicans, refusing to give President Joe Biden a ‘win,’ voted against the renewal of funding for cancer research.  Vote for those who do not politicize Americans' health.  —  I'm afraid I have some bad news.",
    "url": "https://www.usatoday.com/story/opinion/voices/2024/05/05/biden-cancer-moonshot-initiative-congress-funding/73525016007/"
  },
  {
    "text": "Right-Wing Nonprofit Paid Millions to Companies With Ties to Insiders  —  The Conservative Partnership Institute's three highest-paid contractors had connections to the group's leaders or their relatives, raising concerns about self-dealing.  —  The Conservative Partnership Institute … ",
    "url": "https://www.nytimes.com/2024/05/06/us/politics/trump-conservative-partnership-institute-funds.html"
  },
  {
    "text": "Hamas announces it has accepted an Egyptian-Qatari cease-fire proposal  —  Israel's army has told Palestinians to temporarily evacuate from parts of Rafah in southern Gaza, signaling that a ground invasion is imminent.  People were told to move to Muwasi, an Israeli-declared humanitarian area near the coast.",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-humanitarian-aid-8659eae6e0a7362504f0aa4aa4be53e0"
  },
  {
    "text": "Readout of President Joe Biden's Call with Prime Minister Netanyahu of Israel  —  President Biden spoke this morning with Prime Minister Netanyahu.  The President reaffirmed his message on Yom HaShoah, Holocaust Remembrance Day.  The two leaders discussed the shared commitment of Israel … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/05/06/readout-of-president-joe-bidens-call-with-prime-minister-netanyahu-of-israel-5/"
  },
  {
    "text": "Trump's lawyers are trying to use his trial to generate conspiracy theories — but it's not working  —  Even the most MAGA-deluded voters struggle to pretend Trump is the victim in the Stormy Daniels plot  —  Donald Trump's lawyers famously spend a lot of their time placating … ",
    "url": "https://www.salon.com/2024/05/06/lawyers-are-trying-to-use-his-trial-to-generate-conspiracy-theories--but-its-not-working/"
  },
  {
    "text": "Columbia cancels commencement amid campus protests … - The university's administration and police have cracked down through a wave of arrests, suspensions and class cancellations. … - Instead, the school will focus on “Class Days and school-level ceremonies, where students … ",
    "url": "https://www.axios.com/2024/05/06/columbia-university-graduation-commencement-canceled"
  },
  {
    "text": "George Washington U Students Hold ‘Trial,’ Sentence Administrators to Death  —  As students call for the death of school administrators and trustees, D.C. law enforcement officials and the Mayor have denied George Washington University's request for the police to clear out the encampment that has taken over their campus.",
    "url": "https://hotair.com/david-strom/2024/05/06/george-washington-u-students-hold-trial-sentence-administrators-to-death-n3787796"
  }
]