[
  {
    "text": "Arizona state House passes a bill to repeal 1864 abortion ban  —  On their third try in three weeks, state House lawmakers voted to reverse a near-total ban on the procedure following an Arizona Supreme Court ruling.  —  On their third attempt in three weeks, Arizona state House lawmakers voted Wednesday … ",
    "url": "https://www.nbcnews.com/politics/arizona-abortion-ban-lawmakers-repeal-rcna149181?taid=66293ac2029dc600017aa414"
  },
  {
    "text": "Arizona House votes to repeal abortion ban, advancing issue to state Senate  —  PHOENIX — The Arizona House voted Wednesday to repeal a Civil War-era ban on nearly all abortions that is set to take effect as early as June 8.  The measure now heads to the state Senate, which could grant final passage next week.",
    "url": "https://www.washingtonpost.com/politics/2024/04/24/arizona-abortion-ban/"
  },
  {
    "text": "Trump's 2020 ‘fake electors’ charged with state crimes in Arizona  —  The indictments follow an investigation led by Arizona Attorney General Kris Mayes, a Democrat, into efforts to subvert the results of the 2020 election.  —  A state grand jury in Arizona on Wednesday indicted so-called … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trumps-2020-fake-electors-charged-state-crimes-arizona-rcna149214"
  },
  {
    "text": "Trump, Giuliani, Meadows are unindicted co-conspirators in Michigan fake elector case, hearing reveals  —  The Michigan AG last year charged 16 Republicans with being “fake electors.”  —  Former President Donald Trump speaks to supporters during a Farmers for Trump campaign event … ",
    "url": "https://abcnews.go.com/US/trump-giuliani-meadows-unindicted-conspirators-michigan-fake-elector/story?id=109578220"
  },
  {
    "text": "Team Trump Is Ready to Lose the Supreme Court Immunity Case.  They're Celebrating  —  Trump's lawyers don't expect the Supreme Court to bless his absurd immunity claims.  “We already pulled off the heist,” says a source close to Trump … But what the high court does now is almost beside the point: Trump already won.",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-celebrating-supreme-court-immunity-heist-1235009838/"
  },
  {
    "text": "Ukraine uses long-range missiles secretly provided by US to hit Russian-held areas, officials say  —  Ukraine for the first time has begun using long-range ballistic missiles provided secretly by the United States, bombing a Russian military airfield in Crimea last week and Russian forces … ",
    "url": "https://apnews.com/article/russia-ukraine-war-long-range-missiles-4d2254639eb5a503d8b0a291ed0680e9"
  },
  {
    "text": "A Message from The Gateway Pundit Founder Jim Hoft to Our Readers  —  A message from our Founder:  —  TGP Communications, the parent company of The Gateway Pundit, recently made the decision to seek protection under Chapter 11 of the United States Bankruptcy Code in the Southern District … ",
    "url": "https://www.thegatewaypundit.com/2024/04/message-gateway-pundit-founder-jim-hoft-our-readers/"
  },
  {
    "text": "Rightwing US website that spreads election conspiracies declares bankruptcy  —  Gateway Pundit, run by Jim Hoft, is being sued for defamation by Georgia election workers Ruby Freeman and Shaye Moss and others  —  The Gateway Pundit, a rightwing website known for spreading election conspiracies … ",
    "url": "https://www.theguardian.com/world/2024/apr/24/gateway-pundit-rightwing-website-bankruptcy"
  },
  {
    "text": "The Republicans Who Want American Carnage  —  Calls for the National Guard to stop campus protests are not about safety.  —  Tom Cotton has never seen a left-wing protest he didn't want crushed at gunpoint.  —  On Monday, the Arkansas senator demanded that President Joe Biden send … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/04/columbia-national-guard-tom-cotton/678163/"
  },
  {
    "text": "House Speaker Johnson drowned out by booing crowds at Columbia University speech on Gaza protests … Speaker of the U.S. House of Representatives Mike Johnson (R-LA) attends a news conference at Columbia University in response to demonstrators protesting in support of Palestinians … ",
    "url": "https://www.cnbc.com/2024/04/24/speaker-johnson-columbia-university-gaza-protests-speech.html"
  },
  {
    "text": "How “The Nelson Mandela of America” Is Making Bank Off His Criminal Trial  —  IN THE FIRST WEEK OF HIS CRIMINAL TRIAL, Donald Trump raised about $5.6 million online by warning his small dollar-donors that the “Deep State” was out to lock him up.  —  “I JUST STORMED INTO COURT,” … ",
    "url": "https://www.thebulwark.com/p/trump-making-bank-off-his-criminal-trial"
  },
  {
    "text": "GOP senator: Greene ‘dragging our brand down’  —  Sen. Thom Tillis (R-N.C.) took a shot at Rep. Marjorie Taylor Greene (R-Ga.) Tuesday, saying she is “dragging our brand down.”  —  “She is a horrible leader,” Tillis said of Greene, according to audio played on CNN's “Erin Burnett OutFront.”",
    "url": "https://thehill.com/homenews/senate/4617334-gop-senator-thom-tillis-says-greene-dragging-our-brand-down/"
  },
  {
    "text": "Biden-Harris Administration Announces Final Rule Requiring Automatic Refunds of Airline Tickets and Ancillary Service Fees  —  Rule makes it easy to get money back for cancelled or significantly changed flights, significantly delayed checked bags, and additional services not provided",
    "url": "https://www.transportation.gov/briefing-room/biden-harris-administration-announces-final-rule-requiring-automatic-refunds-airline"
  },
  {
    "text": "Why is Trump giving someone a ‘key to the White House’?  —  From Jan. 20, 2017, until Jan. 20, 2021, Donald Trump was president of the United States.  This is a position that includes many perks, offered to the person who was selected by American voters to serve as chief executive.",
    "url": "https://www.washingtonpost.com/politics/2024/04/24/trump-key-to-white-house/"
  },
  {
    "text": "DISGUSTING: Hamas Releases Propaganda Video of American Hostage Missing His Arm  —  Hamas has released a propaganda video featuring one of the American hostages it holds.  In it, Hersh Goldberg-Polin is seen reading a pre-prepared script blaming Israel for October 7th and everything that has transpired since.",
    "url": "https://redstate.com/bonchie/2024/04/24/disgusting-hamas-releases-propaganda-video-of-american-hostage-missing-his-arm-n2173239"
  },
  {
    "text": "Supreme Court wrestles with fallout of Dobbs in arguments on emergency abortions  —  Slippery slopes, tension on the bench and other takeaways from Wednesday's arguments.  —  The Supreme Court heard nearly two hours of heated arguments Wednesday on the tension between Idaho's near-total abortion ban … ",
    "url": "https://www.politico.com/news/2024/04/24/scotus-dobbs-idaho-emergency-abortions-00154173"
  },
  {
    "text": "New York governor to Mike Johnson: Stay in Washington  —  New York Gov. Kathy Hochul said House Speaker Mike Johnson should be focusing on Washington instead of “politicizing” the ongoing crisis at Columbia University.  —  ALBANY, New York — Gov. Kathy Hochul doesn't see the benefit … ",
    "url": "https://www.politico.com/news/2024/04/24/mike-johson-columbia-new-york-hochul-00154114"
  },
  {
    "text": "2024 Race: Dead Heat: Biden 46%, Trump 46%, Quinnipiac University National Poll Finds; Support For Legal Abortion Reaches All-Time High  —  mail_outline  —  If the election for president were being held today, the race would be a dead heat between President Joe Biden and former President Donald Trump … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3896"
  },
  {
    "text": "'You're not dumb, you're insulting!'  Sparks fly on Fox News set over Trump ‘lies’  —  Fox News guest host Charles Payne clashed with co-host Leslie Marshall over the difference between President Joe Biden's misstatements and former President Donald Trump's false claims.",
    "url": "https://www.rawstory.com/biden-gaffes/"
  },
  {
    "text": "How the House GOP's Biden impeachment effort fell apart  —  House Oversight Committee Chairman James Comer was eager to take the reins of a high-stakes investigation into President Joe Biden and his family, seen as central to the House Republican agenda - a coveted perch that brought the added benefit of elevating his national profile.",
    "url": "https://www.cnn.com/2024/04/24/politics/house-gop-biden-impeachment-effort"
  },
  {
    "text": "New Jersey Rep. Donald Payne Jr. dead at 65  —  Rep. Donald Payne Jr. (D-N.J.), who represented New Jersey in the House for more than a decade, has died at the age of 65.  —  New Jersey Gov. Phil Murphy (D) confirmed Payne's death in a statement on Wednesday.",
    "url": "https://thehill.com/homenews/house/4618099-donald-payne-jr-dead-new-jersey/"
  }
]