[
  {
    "text": "Biden's new strategy: Go for Trump's jugular … Biden has told friends he thinks Trump is wobbly, both intellectually and emotionally, and will explode if Biden mercilessly gigs and goads him — “go haywire in public,” as one adviser put it.  — Other sources tell us that Biden is looking for a fight.",
    "url": "https://www.axios.com/2024/03/05/biden-new-strategy-attack-trump-2024-election"
  },
  {
    "text": "Why a Fox News pundit may not have heard bad news about Trump  —  Fox News's Harris Faulkner hosted a panel on Monday afternoon to discuss a “Saturday Night Live” sketch mocking President Biden.  In short order, though, things went in a different direction.",
    "url": "https://www.washingtonpost.com/politics/2024/03/05/why-fox-news-pundit-may-not-have-heard-bad-news-about-trump/"
  },
  {
    "text": "Maddening New Poll: Voters Are Unaware of Trump “Dictator” Threats  —  President Biden's brain trust appears confident that he will ultimately prevail over Donald Trump due to the threat Trump poses to our constitutional system.  By November, the election's “focus will become overwhelmingly on democracy … ",
    "url": "https://newrepublic.com/article/179548/poll-voters-trump-dictator-threats"
  },
  {
    "text": "Nikki Haley Raises the Big Questions About Jan. 6th  —  NIKKI HALEY IS FINALLY ACKNOWLEDGING the most important reason to defeat Donald Trump in this year's election: his use of violence on January 6th to block the peaceful transfer of power.  —  In an interview that aired Sunday on Meet the Press … ",
    "url": "https://plus.thebulwark.com/p/haley-raises-big-questions-about-january-6th"
  },
  {
    "text": "The Supreme Court's ballot ruling is absurd.  They don't care.  —  There are more important things than logic and legal principles. … Last week, the Supreme Court gave Donald Trump a big assist by agreeing to hear his presidential immunity claim, dragging their feet long enough to ensure … ",
    "url": "https://www.publicnotice.co/p/scotus-ballot-ruling-trump-colorado-explained"
  },
  {
    "text": "Biden to form ‘strike force’ to go after price-gouging  —  President Biden will announce Tuesday the formation of a “strike force” to hold companies accountable for price-gouging practices.  —  The announcement comes days before the State of the Union, where Biden is expected … ",
    "url": "https://thehill.com/business/4507871-biden-strike-force-price-gouging-junk-fees-inflation/"
  },
  {
    "text": "Michelle Obama's office says the former first lady ‘will not be running for president’ in 2024  —  Democrats and Republicans have mused about a Michelle Obama candidacy, albeit for different reasons.  —  WASHINGTON — Former President Barack Obama has said he's “all in” for President Joe Biden's re-election effort.",
    "url": "https://www.nbcnews.com/politics/2024-election/michelle-obama-former-first-lady-not-running-president-2024-rcna141767"
  },
  {
    "text": "New Filing in Fani Willis Case: Witness Tampering?  —  Just when we all thought this case couldn't get any nuttier.  A late filing yesterday in the disqualification hearing might force Judge Scott McAfee to reopen the evidentiary portion of the hearing.  Or it might send him running for the hills, and who would blame him?",
    "url": "https://hotair.com/ed-morrissey/2024/03/05/new-filing-in-fani-willis-case-witness-tampering-n3784097"
  },
  {
    "text": "‘Trump offers no alternative means’: Carroll lawyer hits back at move to delay paying $83M to writer  —  In response to Donald Trump's continued promises to a judge in New York that he will pay the $83.3 million he owes to writer E. Jean Carroll for defaming her — without posting security … ",
    "url": "https://lawandcrime.com/high-profile/trump-offers-no-alternative-means-carroll-lawyer-hits-back-at-move-to-delay-paying-83m-to-writer/"
  },
  {
    "text": "Online opt-in polls can produce misleading results, especially for young people and Hispanic adults  —  As polling takes center stage again this election year, understanding its strengths and weaknesses is critical.  At Pew Research Center, we've looked hard at the advantages and limitations of our methods.",
    "url": "https://www.pewresearch.org/short-reads/2024/03/05/online-opt-in-polls-can-produce-misleading-results-especially-for-young-people-and-hispanic-adults/"
  },
  {
    "text": "The Supreme Court did Trump no favors.  He'll be facing a fall trial.  —  While leaving him on the ballot in the 14th Amendment case (but refusing to rule out that Jan. 6, 2021, was an “insurrection\"), the Supreme Court has taken every opportunity to delay four-times-indicted former president Donald Trump's Jan. 6 trial.",
    "url": "https://www.washingtonpost.com/opinions/2024/03/05/supreme-court-timing-trump-trial/"
  },
  {
    "text": "California man is first in the U.S. to be charged with smuggling greenhouse gases, prosecutors say  —  It's the first prosecution in the U.S. to include charges related to a 2020 law that prohibits the importation of hydrofluorocarbons.  —  SAN DIEGO — A Southern California man was arrested Monday … ",
    "url": "https://www.nbcnews.com/news/us-news/california-man-first-us-charged-smuggling-greenhouse-gases-prosecutors-rcna141811"
  },
  {
    "text": "France protects abortion rights, preventing U.S.-like rollback  —  On protecting abortion rights, policymakers in France saw the United States, not as a model, but as a cautionary tale.  —  For reproductive rights advocates, this week's breakthrough in France was one of the most striking international victories in recent memory.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/france-protects-abortion-rights-preventing-us-rollback-rcna141831"
  },
  {
    "text": "“They frankly laugh behind the backs of their own voters”: How Republicans bamboozle rural whites  —  In “White Rural Rage,” Paul Waldman and Thomas Schaller reject the narrative that treats Trump voters like children  —  It's become a tedious trope, the Beltway journalist who goes … ",
    "url": "https://www.salon.com/2024/03/05/-the-media-should-stop-treating-rural-people-like-children/"
  },
  {
    "text": "AOC Loses It When Protesters Accuse Her of Being Insufficiently Antisemitic  —  The pro-Hamas protests are getting ugly, and we're not just talking about the ones taking place on America's university campuses.  Small groups of protesters are spilling out into the streets and hunting … ",
    "url": "https://hotair.com/jazz-shaw/2024/03/05/aoc-loses-it-when-protesters-accuse-her-of-being-insufficiently-antisemitic-n3784095"
  },
  {
    "text": "Biden administration ADMITS flying 320,000 migrants secretly into the U.S. to reduce the number of crossings at the border has national security ‘vulnerabilities’  — A lawsuit reveals Biden's CBP is refusing to disclose airports where it is flying undocumented aliens from other countries",
    "url": "https://www.dailymail.co.uk/news/article-13155765/biden-illegal-migrant-flying-program-national-security-vulnerability.html"
  },
  {
    "text": "The problem with Poolesville  —  Blue America needs to want to grow  —  Poolesville, Maryland is a small town of about 6,000 people that lies 33 miles northwest of Washington, DC, just east of the Potomac River.  Leesburg, Virginia is a larger town of 45,000 people located 39 miles northwest of Washington … ",
    "url": "https://www.slowboring.com/p/the-problem-with-poolesville-0ed"
  },
  {
    "text": "Russian Officers Hit With Arrest Warrants for Alleged War Crimes … They were charged for alleged crimes committed between October 2022 until and March 2023, when Ukraine's power plants and sub-stations faced a fierce campaign of air strikes.  The Hague-based court issued warrants … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-05/top-russian-officers-hit-with-arrest-warrants-over-war-crimes"
  },
  {
    "text": "Independent Sen. Kyrsten Sinema will not run for re-election in Arizona  —  The Democrat-turned-independent is retiring from the Senate after one term.  —  Independent Sen. Kyrsten Sinema announced Tuesday that she will not run for re-election this year, leaving the Senate after one term … ",
    "url": "https://www.nbcnews.com/politics/congress/independent-sen-kyrsten-sinema-will-not-run-re-election-arizona-rcna124499"
  },
  {
    "text": "Racial disparities in voter turnout have grown since Supreme Court ruling, study says  —  The turnout gap between white and nonwhite voters in the U.S. is growing fastest in jurisdictions that were stripped of a federal civil rights-era voting protection a decade ago, according to a new study.",
    "url": "https://npr.org/2024/03/05/1235521824/voter-turnout-race-disparities-supreme-court"
  },
  {
    "text": "US and Europe try to tame surveillance capitalism  —  Trade watchdog argues that browsing and location data are sensitive and deserve to be defended  —  The US Federal Trade Commission on Monday warned that data brokers need to rethink how they define sensitive data in light … ",
    "url": "https://www.theregister.com/2024/03/05/us_europe_capitalism/"
  }
]