[
  {
    "text": "MAYOR RAS J. BARAKA'S STATEMENT ON ICE RAID ON NEWARK BUSINESS ESTABLISHMENT  —  “Today, U.S. Immigration and Customs Enforcement (ICE) agents raided a local establishment in the City of Newark, detaining undocumented residents as well as citizens, without producing a warrant.",
    "url": "https://www.newarknj.gov/news/mayor-ras-j-barakas-statement-on-ice-raid-on-newark-business-establishment"
  },
  {
    "text": "Newark mayor: ICE raided business without a warrant, detained U.S. citizens  —  U.S. Immigration and Customs Enforcement agents carried out a raid on a Newark business Thursday, detaining non-citizens and citizens alike, according to Mayor Ras J. Baraka.  —  The incident, which could not immediately … ",
    "url": "https://www.nj.com/essex/2025/01/newark-mayor-ice-raided-business-without-a-warrant-detained-us-citizens.html"
  },
  {
    "text": "Trump Officials Move to Quickly Expel Migrants Biden Allowed In Temporarily  —  A memo appears to allow Immigration and Customs Enforcement officers to target programs that let in more than a million people.  —  The Trump administration is giving Immigration and Customs Enforcement officers … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-immigrants-deportation.html?unlocked_article_code=1.rk4.jkfQ.TGWT4A93zYdo&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The Border Debate Is Over.  Dems Lost.  —  Trump is claiming a mandate to terrorize communities and edit the Constitution like a Wikipedia page, while his opponents and critics are trying to regroup.  —  ONE OF MY FAVORITE nuggets about immigration (yes, I have favorite immigration trivia) … ",
    "url": "https://www.thebulwark.com/p/democrats-lost-border-debate-immigration-trump-miller"
  },
  {
    "text": "Trump Says States Should Manage Disasters.  Former FEMA Leaders Agree.  —  “I'd rather see the states take care of their own problems,” the president said.  Federal emergency managers from both parties have made the same argument.  —  President Trump plans to tour damage on Friday … ",
    "url": "https://www.nytimes.com/2025/01/24/climate/trump-says-states-should-manage-disasters-former-fema-leaders-agree.html"
  },
  {
    "text": "Trump's DEI orders may halt progress for disabled workers … - At the same time there was a big push within the federal government to hire folks with disabilities. … About 9.4% of the federal workforce were disabled in 2022, up from 8.9% in 2014, per federal data.",
    "url": "https://www.axios.com/2025/01/24/dei-orders-disabled-workers-telework"
  },
  {
    "text": "There Is No Resistance  —  To see how far the lines of normal have moved since President Donald Trump freed the January 6ers, briefly return to the closing days of the 2024 presidential campaign.  At the time, a hot issue was whether Trump harbored fascist tendencies, as some of his former aides alleged.",
    "url": "https://www.theatlantic.com/politics/archive/2025/01/republicans-rationalization-trump-pardons/681433/"
  },
  {
    "text": "Paul Krugman on Leaving the New York Times  —  The paper wanted to take away his newsletter or make him write less frequently, he says.  —  For two and a half decades, Paul Krugman's columns in the New York Times were beacons of intelligence and common sense.",
    "url": "https://www.cjr.org/analysis/paul-krugman-leaving-new-york-times-heavy-hand-editing-less-frequent-columns-newsletter.php"
  },
  {
    "text": "Rutgers Center Cancels Conference in Response to Trump DEI Orders  —  The Rutgers University Center for Minority Serving Institutions announced Thursday that it has canceled an upcoming virtual conference about registered apprenticeship programs as a result of President Trump's executive … ",
    "url": "https://www.insidehighered.com/news/quick-takes/2025/01/24/rutgers-cancels-hbcu-event-align-trump-dei-orders"
  },
  {
    "text": "White House says migrant deportation flights with military aircraft have begun  —  The Trump administration has started flying immigrants who entered the U.S. illegally out of the country using military aircraft, a White House spokesperson said Friday.  —  White House press secretary Karoline … ",
    "url": "https://thehill.com/homenews/administration/5104685-migrant-deportation-military-aircraft/"
  },
  {
    "text": "Trump staff ‘furious’ after Musk trashes AI project  —  “It's clear he has abused the proximity to the president,” said one ally of the president.  —  Some of President Donald Trump's key aides and allies are furious with Elon Musk for publicly trashing his $500 billion artificial intelligence mega-deal.",
    "url": "https://www.politico.com/news/2025/01/23/trump-staff-musk-conflict-00200311"
  },
  {
    "text": "Elon Musk doesn't deserve the benefit of the doubt  —  Since Donald Trump's rise to power, some liberals have developed a bad habit of seeing secret Nazi imagery everywhere on the right.  —  Be it Laura Ingraham allegedly sieg-heiling at the 2016 Republican National Convention … ",
    "url": "https://www.vox.com/politics/396535/elon-musk-nazi-salute-trump-inauguration"
  },
  {
    "text": "Wall Street Journal knocks Trump for leaving former aides unprotected  —  The editorial board of the Wall Street Journal is blasting President Trump over a decision to revoke the security details from former top aides to his first administration.  —  “The possibility of falling … ",
    "url": "https://thehill.com/homenews/media/5104723-trump-revokes-security-details/"
  },
  {
    "text": "Instagram and Facebook Blocked and Hid Abortion Pill Providers' Posts  —  Some posts related to obtaining abortion pills were recently hidden on Instagram and Facebook and some accounts were suspended, before being later restored.  —  Instagram and Facebook have recently blurred … ",
    "url": "https://www.nytimes.com/2025/01/23/technology/instagram-facebook-abortion-pill-providers.html?unlocked_article_code=1.rk4.o9WP.YpCM4kgrojZx&smid=tw-share"
  },
  {
    "text": "“A pact with the devil”  —  David de Jong on oligarchs getting in bed with fascists.  —  ∙ Paid  —  Donald Trump now has many of the country's richest and most powerful executives explicitly on his side.  That was evident this week as Elon Musk, Mark Zuckerberg, Jeff Bezos … ",
    "url": "https://www.publicnotice.co/p/david-de-jong-nazi-interview-trump-musk"
  },
  {
    "text": "House GOP measure would let Trump seek third term … - Republican House members have rushed to introduce bills that would codify Trump's vision for expanding the U.S. borders by acquiring Greenland and the Panama Canal, for instance.  — The measure is an extreme long-shot … ",
    "url": "https://www.axios.com/2025/01/24/trump-third-term-republican-constitution-ogles"
  },
  {
    "text": "Sensing Political Support, Abortion Opponents Raise Ambitions  —  The March for Life on Friday will bring together a movement invigorated by some early moves of the second Trump administration.  —  Anti-abortion activists are charging ahead with their ultimate mission to end all abortions nationwide … ",
    "url": "https://www.nytimes.com/2025/01/24/us/abortion-march-for-life.html"
  },
  {
    "text": "Women, gays, transgender and queer Americans serve in the military because men won't  —  When I worked on the 1st Marine Division's staff back from 2004-2007, I was part of a team that had to “find” officers and senior enlisted Marines to send to Iraq.  Later, I was part of a team … ",
    "url": "https://thehill.com/opinion/5104066-military-recruitment-issues/"
  },
  {
    "text": "RFK Jr. applauds Trump's order to declassify RFK, JFK assassination files  —  Robert F. Kennedy Jr., said on Thursday he supports President Trump's executive order to declassify files related to the assassination of his uncle, former President John F. Kennedy.",
    "url": "https://thehill.com/homenews/administration/5104616-robert-f-kennedy-jr-supports-trump-executive-order-jfk/"
  },
  {
    "text": "“Excluding Indians”: Trump admin questions Native Americans' birthright citizenship in court  —  The Trump admin is leaning on a pre-14th Amendment law in its fight to redefine birthright citizenship  —  In the Trump administration's arguments defending his order to suspend birthright citizenship … ",
    "url": "https://www.salon.com/2025/01/23/excluding-indians-admin-questions-native-americans-birthright-citizenship-in/"
  },
  {
    "text": "Trump's budget pick, Russ Vought, is starting to upend Washington  —  The president's nominee for the Office of Management and Budget aims to slash spending and regulation — and push the limits of presidential power to achieve Trump's agenda.  —  Even before he takes the reins … ",
    "url": "https://www.washingtonpost.com/business/2025/01/24/russell-vought-trump-budget/"
  },
  {
    "text": "Orbán's new threat: I'll end Russia sanctions unless Ukraine pumps Putin's gas  —  But diplomats still expect the Hungarian prime minister to ultimately back down, perhaps as soon as Monday.  —  Hungary again delayed the renewal of the EU's Russia sanctions on Friday … ",
    "url": "https://www.politico.eu/article/hungary-viktor-orban-threat-sanction-russia-ukraine-putin-gas/"
  },
  {
    "text": "Even some RFK Jr. allies are worried about his vaccine agenda  —  Robert F. Kennedy's Jr. advisers are sparring over how far he should go on vaccines as health secretary.  —  Top advisers to Robert F. Kennedy Jr. are battling over how aggressively to target vaccines during his first days … ",
    "url": "https://www.politico.com/news/2025/01/24/rfk-jr-allies-child-vaccinations-00200364"
  },
  {
    "text": "Trump 2.0 softens on China … - Trump held a phone call with Xi just days before inauguration to discuss trade, fentanyl and TikTok — the Chinese-owned app that the president is now seeking to protect from a U.S. ban.  — Beijing's readout of the call was exceedingly warm … ",
    "url": "https://www.axios.com/2025/01/24/trump-china-policies-tariffs-elon-musk"
  },
  {
    "text": "Biden embraced diversity efforts.  Trump has moved to demolish them.  —  Trump and Biden have long been on opposite sides of America's issues with racism, the fight against discrimination and for diversity, equity and inclusion.  —  Presidents Donald Trump and Joe Biden couldn't be further apart … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/24/trump-dei-biden-diversity-plans-federal/"
  },
  {
    "text": "Trump's White House Press Secretary Reveals Her Failed Campaign Spent $200K in Illicit Contributions  —  On Thursday, Karoline Leavitt's failed congressional campaign amended every FEC filing it had ever made to reveal that she failed to disclose hundreds of thousands of dollars … ",
    "url": "https://www.notus.org/whitehouse/trump-white-house-press-secretary-200k-illicit-contributions"
  },
  {
    "text": "DOJ orders federally funded legal service providers to stop providing support at immigration courts  —  Legal service providers help individuals navigate immigration court proceedings.  —  The seal of the U.S. Justice Department is seen on the podium in the Department's headquarters briefing room … ",
    "url": "https://abcnews.go.com/US/doj-orders-federally-funded-legal-service-providers-stop/story?id=118027656"
  }
]