[
  {
    "text": "Trump exempts phones, computers, chips from new tariffs … Smartphones and computers will be exempted from President Donald Trump's reciprocal tariffs, according to new guidance from U.S. Customs and Border Protection.  —  The guidance comes after Trump earlier this month imposed 125% tariffs … ",
    "url": "https://www.cnbc.com/2025/04/12/trump-exempts-phones-computers-chips-tariffs-apple-dell.html"
  },
  {
    "text": "CSMS # 64724565 - UPDATED GUIDANCE - Reciprocal Tariff Exclusion for Specified Products; April 5, 2025 Effective Date  —  The purpose of this message is to provide further guidance on the additional duties due on imported merchandise which were imposed by Executive Order 14257, issued April 2 … ",
    "url": "https://content.govdelivery.com/bulletins/gd/USDHSCBP-3db9e55?wgt_ref=USDHSCBP_WIDGET_2"
  },
  {
    "text": "Apple, Nvidia Score Relief From US Tariffs With Exemptions  —  President Donald Trump's administration exempted smartphones, computers and other electronics from its so-called reciprocal tariffs, representing a major reprieve for global technology manufacturers including Apple Inc. and Nvidia Corp. even if it proves a temporary one.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-12/trump-exempts-phones-computers-chips-from-reciprocal-tariffs?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NDQ2NDkyNCwiZXhwIjoxNzQ1MDY5NzI0LCJhcnRpY2xlSWQiOiJTVUxUU1VUMEFGQjQwMCIsImJjb25uZWN0SWQiOiI2RjBCMUFFQTQyOEI0RjhFQTVGQ0FDRUZCRjAzQjkzMCJ9.8zuBSNQRg3bMXIiiZxTSqO_Gy5nKuCb8ajtGSiBsh7o&leadSource=uverify%20wall"
  },
  {
    "text": "Trump administration says wrongly deported man is alive in El Salvador prison  —  The U.S. government continued to refuse to provide any details about whether it has taken any steps to return him to the United States.  —  The Trump administration confirmed Saturday that Kilmar Abrego Garcia … ",
    "url": "https://www.politico.com/news/2025/04/12/abrego-garcia-el-salvador-alive-00287678"
  },
  {
    "text": "Team Trump Is Gaming Out How to Ship U.S. Citizens to El Salvador  —  Trump officials are talking internally about denaturalizing American citizens — and potentially sending some to El Salvador  —  Donald Trump and his White House have moved to deport green-card holders for espousing pro-Palestinian views … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-el-salvador-us-citizens-denaturalization-1235315975/"
  },
  {
    "text": "Americans Must Prepare to Fight for the Citizenship Rights of U.S. Prisoners  —  If there is something you can do, even one thing, to ensure humanity exists behind bars, do it.  —Albert Woodfox (2019)  —  Sherrilyn's Newsletter is a reader-supported publication.",
    "url": "https://sherrilyn.substack.com/p/americans-must-prepare-to-fight-for"
  },
  {
    "text": "Trump administration overrode Social Security staff to list immigrants as dead  —  A senior executive who objected was marched out of his office and put on leave, while earlier warnings about the agency's deaths database were ignored.  —  Just now  —  Two days after the Social Security … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/12/trump-immigrants-dead-social-security/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0NDMwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1ODEyNzk5LCJpYXQiOjE3NDQ0MzA0MDAsImp0aSI6ImRkOWI5MzkzLWFmMWUtNGQ5Zi04NzVkLWU5NWYwNDViMTIyZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzEyL3RydW1wLWltbWlncmFudHMtZGVhZC1zb2NpYWwtc2VjdXJpdHkvIn0.hgTD0d-mBwWvUvRMgm_JeeYh4t2iZSGyg8tbs0wg8BU&itid=gfta"
  },
  {
    "text": "Harvard Professors Sue Trump Administration Over Threat to Cut Funding  —  The administration is reviewing about $9 billion in federal funding that the university receives.  —  Two groups representing Harvard professors sued the Trump administration on Friday, saying that its threat … ",
    "url": "https://www.nytimes.com/2025/04/12/us/politics/harvard-professors-trump-lawsuit-funding.html"
  },
  {
    "text": "Whitmer Shows How Democrats Are Playing With Fire in Cozying Up to Trump  —  The Michigan governor's awkward Oval Office appearance reflected how several Democratic state leaders are cultivating cordial but politically risky relationships with the president.",
    "url": "https://www.nytimes.com/2025/04/12/us/politics/gretchen-whitmer-trump-democrats.html?unlocked_article_code=1._E4.ZKo8.mwpBvyOIe_dU&smid=url-share"
  },
  {
    "text": "Trump Can't Recall the Details of His Favorite Cognitive Test  —  AN APPLE A DAY  —  Trump told reporters aboard Air Force One, “It's a pretty well known test.  Whatever it is.  I got every one right.”  —  President Donald Trump was unable to recall the details of the cognitive test … ",
    "url": "https://www.thedailybeast.com/trump-cant-recall-the-details-of-his-favorite-cognitive-test/"
  },
  {
    "text": "‘One million.’ The private goal driving Trump's push for mass deportations.  —  Immigration officers and analysts are increasingly skeptical the Trump administration can deport that many immigrants in a single year.  —  Just now  —  As the Trump administration aggressively pushes to deport … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/12/one-million-deportations-goal/"
  },
  {
    "text": "‘Why are high fertility people always so weird?’:  A weekend with the pronatalists  —  CNN's Meena Duerson travels to Austin to join roughly 200 “pronatalists” for the second-ever Natal Conference, an event devoted to discussing the world's declining birth rates and potential solutions.",
    "url": "https://cnn.com/2025/04/11/us/video/natalism-conference-population-decline-natalcon-digvid"
  },
  {
    "text": "Dozens of DHS staffers, including top FEMA officials, given lie detector tests over alleged leaks  —  The Department of Homeland Security has administered lie detector tests to about 50 staffers in recent weeks, including FEMA's acting administrator and roughly a dozen officials at the disaster relief agency … ",
    "url": "https://cnn.com/2025/04/12/politics/dhs-fema-lie-detector-tests-leaks"
  },
  {
    "text": "Paris said au revoir to cars.  Air pollution maps reveal a dramatic change.  —  Air pollution fell substantially as the city restricted car traffic and made way for parks and bike lanes.  —  Over the past 20 years, Paris has undergone a major physical transformation, trading automotive arteries … ",
    "url": "https://www.washingtonpost.com/climate-solutions/2025/04/12/air-pollution-paris-health-cars/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0NDMwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1ODEyNzk5LCJpYXQiOjE3NDQ0MzA0MDAsImp0aSI6ImIxNGYwZWM2LTM0NTItNGQzZS1iMjVjLWJkN2U2YzNiNjBlMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jbGltYXRlLXNvbHV0aW9ucy8yMDI1LzA0LzEyL2Fpci1wb2xsdXRpb24tcGFyaXMtaGVhbHRoLWNhcnMvIn0.L7FE8DP8pBKNgcvNiIol_1JTdnzoytzcsRRIgEnte7Q&itid=gfta"
  },
  {
    "text": "Trump admin tells judge man wrongly deported to El Salvador is alive, still detained  —  A Maryland man who was wrongly deported to El Salvador is alive and still detained in the country, the Trump administration said in a filing to a federal judge on Saturday.",
    "url": "https://www.npr.org/2025/04/12/nx-s1-5363234/trump-administration-judge-update-on-kilmar-armando-abrego-garcia"
  },
  {
    "text": "So You Want to Be a Dissident?  —  A practical guide to courage in Trump's age of fear.  —  Once upon a time—say, several weeks ago—Americans tended to think of dissidents as of another place, perhaps, and another time.  They were overseas heroes—names like Alexei Navalny and Jamal Khashoggi … ",
    "url": "https://www.newyorker.com/news/the-weekend-essay/so-you-want-to-be-a-dissident"
  },
  {
    "text": "“Slow Pay, Low Pay or No Pay”  —  Uncovered: How the Insurance Industry Denies Coverage to Patients  — Shortchanged: Blue Cross Louisiana OK'd mastectomies and breast reconstructions for women with cancer but refused to pay a hospital's full bills.  For some claims, it paid nothing.",
    "url": "https://www.propublica.org/article/blue-cross-blue-shield-louisiana-insurance-lawsuit-breast-cancer-doctors"
  },
  {
    "text": "Donald Trump is now badly wounded.  Europe and the UK can seize an advantage  —  It's time to fashion a new global trade order without the US  —  The game-changing geopolitical event last week was the near collapse of the immense $29tn market in US government debt, threatening the stability … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/12/donald-trump-is-now-badly-wounded-europe-and-the-uk-can-seize-an-advantage"
  },
  {
    "text": "In Trump's Washington, MAGA fashionistas lay claim to American hotness  —  At a party thrown by a conservative lifestyle publication, an “objectively beautiful lifestyle” and an “objectively superior worldview” go hand in hand.  —  “We are the zeitgeist now.”",
    "url": "https://www.washingtonpost.com/style/2025/04/11/maga-fashion-america-is-hot-again/"
  },
  {
    "text": "Canadians freeze visits to the US over Trump  —  Tourism from the north tanks amid annexation talk, tariff whiplash and border stops.  —  NEW YORK — Marketers for top U.S. destinations are trumpeting a reminder to Canadians amid a dive in tourism: You're welcome here regardless of who's president.",
    "url": "https://www.politico.com/news/2025/04/12/not-going-to-support-that-guy-canadians-freeze-visits-to-the-u-s-over-trump-00285346"
  },
  {
    "text": "Far-right Republicans tease rebellion but fall in line when Trump asks  —  The House Freedom Caucus, which used to drive a hard bargain on spending, is facing an identity crisis and has capitulated when pressured by the president.  —  Just now  —  First, they threatened … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/12/house-freedom-caucus-johnson-trump/"
  },
  {
    "text": "Wisconsin teen allegedly killed parents in extremist plot to assassinate Trump, FBI says  —  Nikita Casap, 17, is accused of killing his mother and stepfather.  —  Nikita Casap is shown in court in the screen grab from a video.  —  WISN  —  A Wisconsin teen allegedly killed his parents to … ",
    "url": "https://abcnews.go.com/US/wisconsin-teen-allegedly-killed-parents-extremist-plot-assassinate/story?id=120750496"
  },
  {
    "text": "Bill Maher Praises ‘Gracious,’ ‘Measured’ Trump After Wild White House Meeting: 'You Can Hate Me For It, But I'm Not a Liar'  —  Bill Maher praised President Donald Trump as “gracious” and “measured” during their recent White House meeting while providing a “book report” from the night's events to his audience.",
    "url": "https://www.mediaite.com/tv/bill-maher-praises-gracious-measured-trump-after-wild-white-house-meeting-you-can-hate-me-for-it-but-im-not-a-liar/"
  }
]