[
  {
    "text": "RNC Moving to Declare Trump Its Presumptive Nominee  —  An RNC committeeman has submitted the proposal despite Nikki Haley's vow to stay in the race.  —  The Republican National Committee (RNC) is reviewing a draft resolution that, if approved, would declare Donald Trump … ",
    "url": "https://thedispatch.com/newsletter/dispatch-politics/rnc-moving-to-declare-trump-its-presumptive-nominee/"
  },
  {
    "text": "GOP senators seethe as Trump blows up delicate immigration compromise  —  Senior Senate Republicans are furious that Donald Trump may have killed an emerging bipartisan deal over the southern border, depriving them of a key legislative achievement on a pressing national priority and offering … ",
    "url": "https://www.cnn.com/2024/01/25/politics/gop-senators-angry-trump-immigration-deal/"
  },
  {
    "text": "Republican National Committee pulls resolution declaring Trump as the ‘presumptive 2024 nominee’  —  The Republican National Committee has pulled a resolution to consider declaring Donald Trump the party's “presumptive 2024 nominee” before he formally clinches the requisite number of delegates … ",
    "url": "https://apnews.com/article/rnc-trump-presumptive-nominee-haley-2024-campaign-74c529ab8d3804622276f8e197cd3a5c"
  },
  {
    "text": "Trump's stubborn defiance of normal political gravity  —  Trump's Haley/Pelosi gaffe would've ended most campaigns.  For him it was just another Friday. … One week ago tonight in New Hampshire, Donald Trump confused Republican presidential candidate Nikki Haley with former House Speaker Nancy Pelosi … ",
    "url": "https://www.publicnotice.co/p/why-does-nothing-trump-says-matter"
  },
  {
    "text": "Republican National Committee considering move that would declare Trump the presumptive nominee  —  A draft resolution circulating among the Republican National Committee would formally declare Donald Trump the Republican Party's 2024 presumptive nominee.  —  While the former president … ",
    "url": "https://www.cnn.com/2024/01/25/politics/rnc-trump-presumptive-nominee-resolution"
  },
  {
    "text": "‘Preposterous’: Federal judge decries efforts to downplay Jan. 6 violence, label perpetrators ‘hostages’  —  Judge Royce Lamberth, who has handled dozens of Jan. 6 cases, lamented the false rhetoric spread by Donald Trump and his allies.  —  The longest-serving district judge on the federal bench … ",
    "url": "https://www.politico.com/news/2024/01/25/judge-lamberth-jan-6-trump-00137960"
  },
  {
    "text": "Justice Department Announces Surge of Resources to Fight Violent Crime in Washington, D.C.  —  For Immediate Release  —  The Justice Department announced today that it will surge additional law enforcement tools and resources to target those most responsible for violent crime and carjackings in Washington, D.C.",
    "url": "https://www.justice.gov/opa/pr/justice-department-announces-surge-resources-fight-violent-crime-washington-dc"
  },
  {
    "text": "Feds to Dispatch More Resources to Fight Washington's Violent-Crime Surge  —  Justice Department says FBI-led effort aims to curb homicides and carjackings, which are rising in D.C. as they drop in other U.S. cities  —  WASHINGTON—The Justice Department will commit more federal prosecutors … ",
    "url": "https://www.wsj.com/us-news/feds-to-dispatch-more-resources-to-fight-washingtons-violent-crime-surge-772ee754?mod=followamazon"
  },
  {
    "text": "Widening Mideast Crisis: U.N. Court Orders Israel to Prevent Genocide, but Does Not Demand Stop to War  —  U.N. Court Orders Israel to Prevent Genocide, but Does Not Demand Stop to War  —  The International Court of Justice ruled that Israel must prevent any genocidal acts by its forces, and must let more aid in to Gaza.",
    "url": "https://www.nytimes.com/live/2024/01/26/world/israel-hamas-gaza-news"
  },
  {
    "text": "Israel-Hamas war live updates: ICJ stops short of ordering cease-fire, tells Israel to prevent acts of genocide in Gaza … The United Nations' top court has told Israel it must take measures to prevent its forces from committing acts of genocide against Palestinians — but stopped short … ",
    "url": "https://www.nbcnews.com/news/live-blog/israel-hamas-war-live-updates-rcna135801/rcrd32151?canonicalCard=true"
  },
  {
    "text": "Border standoff between Texas, feds intensifies as governor defies Supreme Court ruling  —  This week, the Supreme Court sided with federal agents to remove razor wire put in place by Texas along the Rio Grande.  The state is using wire and state agents to block Border Patrol from accessing a section of the border in Eagle Pass.",
    "url": "https://www.pbs.org/newshour/show/border-standoff-between-texas-feds-intensifies-as-governor-defies-supreme-court-ruling"
  },
  {
    "text": "Matt Gaetz Privately Told Colleagues His Real Motivation for Kevin McCarthy Ouster Was Ethics Probe  —  In private communications reviewed by The Daily Beast, Matt Gaetz indicated his vendetta against Kevin McCarthy was rooted in the Ethics Committee investigation against Gaetz.",
    "url": "https://www.thedailybeast.com/matt-gaetz-privately-told-colleagues-his-real-motivation-for-mccarthy-ouster-was-ethics-probe"
  },
  {
    "text": "Exclusive: China presses Iran to rein in Houthi attacks in Red Sea, sources say  —  Chinese officials have asked their Iranian counterparts to help rein in attacks on ships in the Red Sea by the Iran-backed Houthis, or risk harming business relations with Beijing, four Iranian sources and a diplomat familiar with the matter said.",
    "url": "https://www.reuters.com/world/middle-east/china-presses-iran-rein-houthi-attacks-red-sea-sources-say-2024-01-26/"
  },
  {
    "text": "Scoop: Biden tells Bibi he's not in it for a year of war in Gaza  —  President Biden last week pressed Israeli Prime Minister Benjamin Netanyahu to scale down the Israeli military operation in Gaza, stressing he is not in it for a year of war, two U.S. officials told Axios.",
    "url": "https://www.axios.com/2024/01/26/biden-netanyahu-israel-hamas-war-gaza-timetable"
  },
  {
    "text": "The Story of the Decade  —  New documents strengthen—perhaps conclusively—the lab-leak hypothesis of Covid-19's origins.  —  / Health Care  —  / Eye on the News / Health Care  —  The day is growing ever closer when Washington may have to add to its agenda with Beijing a nettlesome item … ",
    "url": "https://www.city-journal.org/article/new-documents-bolster-lab-leak-hypothesis"
  },
  {
    "text": "Meet the Texas Billionaire Quietly Becoming the New George Soros  —  John Arnold has spent nearly $50 million on progressive criminal justice reforms  —  A Texas billionaire is on track to replace George Soros as the largest donor in the fight to remake America's criminal justice system.",
    "url": "https://freebeacon.com/democrats/meet-the-texas-billionaire-quietly-becoming-the-new-george-soros/"
  }
]