[
  {
    "text": "Judge blocks Trump administration's mass firings of federal workers  —  A federal judge ruled that the terminations at several agencies, including the Department of Defense, were likely illegal.  —  SAN FRANCISCO — A federal judge on Thursday ordered the Office of Personnel Management … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/02/27/judge-probationary-federal-employee-firings-lawsuit/"
  },
  {
    "text": "Judge temporarily blocks Trump's mass firings at federal agencies  —  Judge says US Office of Management lacks power to order firings, including those of probationary employees  —  A federal judge in California has temporarily blocked the Trump administration from ordering the US defense department … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/27/judge-temporarily-blocks-trump-firings"
  },
  {
    "text": "Behind the scenes, GOP senators challenge legality of Trump's aid cuts  —  Sen. Lindsey Graham, a close Trump ally who lauded the USAID cuts, quietly joined Democrats in expressing alarm.  —  Just now  —  A handful of Republican senators have joined their Democratic colleagues in expressing alarm … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/27/usaid-senators-graham-rubio/"
  },
  {
    "text": "BREAKING: SEC halts fraud prosecution of Chinese national who sent Trump millions  —  In December, Popular Information reported that Chinese crypto entrepreneur Justin Sun purchased $30 million in crypto tokens from World Liberty Financial (WLF), a new venture backed by President Donald Trump and his family.",
    "url": "https://popular.info/p/breaking-sec-halts-fraud-prosecution"
  },
  {
    "text": "NOAA begins firing hundreds of staffers  —  The National Oceanic and Atmospheric Administration (NOAA) began the process of firing hundreds of probationary workers Thursday, the latest mass job cuts within federal agencies, three sources with knowledge of internal operations told The Hill.",
    "url": "https://thehill.com/policy/energy-environment/5167978-noaa-firings-probationary-workers-doge/"
  },
  {
    "text": "‘Cruel and thoughtless’: Trump fires hundreds at US climate agency Noaa  —  Employees informed by email that their jobs would be cut off at end of day in move a worker called ‘wrong all around’  — Don't let a billionaire's algorithm control what you read.  Download our free app to get trusted reporting.",
    "url": "https://www.theguardian.com/us-news/2025/feb/27/trump-noaa-cuts-climate"
  },
  {
    "text": "FBI investigating Trump EPA claims of fraud in $20B Biden grant fund  —  While career prosecutors in two U.S. attorney offices and a U.S. judge balked at a court-ordered freeze, Citibank has locked down billions without explanation.  —  Just now  —  FBI agents this week questioned … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/02/27/trump-fbi-epa-grant-investigation/"
  },
  {
    "text": "MAGA Loses It as DOGE Staffer Identities Revealed  —  The New York Times identified several dozen employees working for the Department of Government Efficiency, but conservatives were surprisingly unhappy about the transparency.  —  “The so-called New York Times outs 45 people working for DOGE … ",
    "url": "https://newrepublic.com/post/192086/maga-doge-staffers-identities-revealed"
  },
  {
    "text": "Oscar-winner Gene Hackman, wife Betsy Arakawa and their dog were dead for some time, warrant shows  —  Oscar-winner Gene Hackman, his wife and their dog were found dead in different rooms of their Santa Fe home, and they had apparently been dead for some time, according to investigators.",
    "url": "https://apnews.com/article/gene-hackman-found-dead-f6c106e92987aeaaab7b35c1b956a5c8"
  },
  {
    "text": "Attorney General Pamela Bondi Releases First Phase of Declassified Epstein Files  —  Today, Attorney General Pamela Bondi, in conjunction with the Federal Bureau of Investigation (FBI), declassified and publicly released files related to convicted sex offender Jeffrey Epstein and his sexual exploitation … ",
    "url": "https://www.justice.gov/opa/pr/attorney-general-pamela-bondi-releases-first-phase-declassified-epstein-files"
  },
  {
    "text": "Here's what on the Jeffrey Epstein list that the Trump DOJ is set to release later today  —  WASHINGTON — The Justice Department is preparing to release notorious sex trafficker Jeffrey Epstein's personal address book Thursday, The Post has learned.  —  A source who has reviewed the files … ",
    "url": "https://nypost.com/2025/02/27/us-news/heres-what-on-the-jeffrey-epstein-list-that-the-trump-doj-is-set-to-release-later-today/"
  },
  {
    "text": "RFK Jr. Takes a Sledgehammer to Two Major Vaccine Developments  —  Multiple vaccine projects have been paused by the Department of Health and Human Services Secretary Robert F. Kennedy Jr.  —  Kennedy paused a multimillion-dollar project to create a new Covid-19 vaccine in pill form on Tuesday … ",
    "url": "https://newrepublic.com/post/192059/rfk-jr-vaccines-flu-covid-hhs"
  },
  {
    "text": "Former defense chiefs denounce Trump's ‘reckless’ Pentagon firings  —  The five former leaders urged Congress to hold the president accountable for what they called his unjustified removal of the Joint Chiefs chairman and other top military officers.  —  Five former defense secretaries … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/27/mattis-defense-secretaries-trump-pentagon-firings/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNjMyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMDExMTk5LCJpYXQiOjE3NDA2MzI0MDAsImp0aSI6ImVhNDNhZDE1LTVjNmMtNGZhZS04ZDY4LWJhNTMxNzM0YmY3MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzI3L21hdHRpcy1kZWZlbnNlLXNlY3JldGFyaWVzLXRydW1wLXBlbnRhZ29uLWZpcmluZ3MvIn0.Y0W1SvJIllke98Rq4gwJAp7E4Bwf9UQBHTJOaPrEVyE&itid=gfta"
  },
  {
    "text": "Judge orders Trump administration officials to give sworn testimony on DOGE  —  The Justice Department fought the effort to put staffers involved in the controversial cost-slashing effort under oath.  —  A federal judge has ordered Trump administration officials involved in Elon Musk's … ",
    "url": "https://www.politico.com/news/2025/02/27/doge-depositions-union-lawsuits-00206542"
  },
  {
    "text": "23 Dem AGs think they've cracked the code to fighting Trump  —  Democratic state attorneys general have been planning their lawsuits for a year.  —  The resistance meets daily on Microsoft Teams.  —  The country's 23 Democratic state attorneys general log on at 4pm ET … ",
    "url": "https://www.politico.com/news/2025/02/27/democrats-taking-trump-musk-winning-00206310"
  },
  {
    "text": "Inside Kash Patel's Whirlwind Start at the FBI  —  The new FBI director ordered officials to undertake a $100 million restructuring with no clear way to fund it—and took on a second job  —  WASHINGTON—FBI officials from regional field offices gathered on a video call this week to hear … ",
    "url": "https://www.wsj.com/politics/policy/kash-patel-fbi-director-start-actions-c3d5d57f?st=MURWfs&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Education Department Opens Snitch Line Against Diversity  —  The snitch portal was launched in association with the extremist group Moms for Liberty … Tiffany Justice, of Moms for Liberty, touted the launch of the portal, highlighting it as an opportunity for parents to push back against … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-education-department-snitch-portal-against-diversity-1235282457/"
  },
  {
    "text": "U.S. Terminates Funding for Polio, H.I.V., Malaria and Nutrition Programs Around the World  —  Here are some of the 5,800 contracts the Trump administration formally canceled this week in a wave of terse emails.  —  Starting Wednesday afternoon, a wave of emails went out from the State Department … ",
    "url": "https://www.nytimes.com/2025/02/27/health/usaid-contract-terminations.html?unlocked_article_code=1.0E4.MuCt.9hGUQZ9l81ZH&smid=url-share"
  },
  {
    "text": "Inside DOGE's Clash With the Federal Workforce  —  With a surprise incursion in the first minutes of the Trump presidency, Elon Musk's programmers seized control of a key personnel agency; ‘rogue bureaucrats’ fight back  —  WASHINGTON, D.C.-At 12:01 p.m. on Jan. 20, as Donald Trump … ",
    "url": "https://www.wsj.com/politics/policy/inside-doge-elon-musk-government-employees-b87fc17a?st=76SP5J&reflink=article_copyURL_share"
  },
  {
    "text": "Harsh findings on Trump's aid freeze kept secret by USAID watchdog  —  Two reports showing dire impacts on Africa and Gaza have not been released in fear of Trump's wrath, official says  —  The watchdog for the U.S. Agency for International Development has yet to release two critical reports … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/27/usaid-trump-gaza-aid-probe/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNjMyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMDExMTk5LCJpYXQiOjE3NDA2MzI0MDAsImp0aSI6ImRmMjI2NTc4LTVlNjItNDQxOC04Nzk5LTMxMzZkNzNjMWJjYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAyLzI3L3VzYWlkLXRydW1wLWdhemEtYWlkLXByb2JlLyJ9.n47qLmxS0qiHuz-o8Xlw5KVXoIoEJ0AIGF-rq_9hUdA&itid=gfta"
  },
  {
    "text": "CDC Statement on Measles Outbreak  —  RELEASE  —  CDC Media Relations  —  (404) 639-3286  —  media@cdc.gov  —  CDC continues to be in close communication with Texas health authorities about the measles outbreak in West Texas, following the death of a child.  HHS sends its deepest condolences to the family.",
    "url": "https://www.cdc.gov/media/releases/2025/2025-cdc-statement-on-measles-outbreak.html"
  },
  {
    "text": "CNN Fact-Checker Floored By Trump Cabinet Meeting: ‘There Was Just So Much’  —  Daniel Dale picked apart the president's statements during the first meeting of his new administration's department heads.  —  President Donald Trump's first Cabinet meeting Wednesday of his new administration … ",
    "url": "https://www.huffpost.com/entry/daniel-dale-donald-trump-cabinet-meeting-2025_n_67c04533e4b0c1f0afe3bc57"
  },
  {
    "text": "Elon Musk says upgrade of FAA's air traffic control system is failing and SpaceX needs to take over Verizon's contract  —  New York CNN  —  Elon Musk said Thursday that Verizon's efforts to provide a critically needed upgrade to the FAA's air traffic control system is failing.",
    "url": "https://www.cnn.com/2025/02/27/business/elon-musk-faa-air-traffic-control-failing-spacex/"
  },
  {
    "text": "Trump's biggest power grab just reached the Supreme Court  —  On Wednesday night, Chief Justice John Roberts temporarily halted a lower court order, which would have required the Trump administration to make approximately $2 billion in foreign aid payments that it had stopped as part … ",
    "url": "https://www.vox.com/scotus/401838/supreme-court-usaid-impoundment-trump-aids-vaccine"
  },
  {
    "text": "Pentagon directs removal of trans service members from military  —  The Pentagon has directed that service members and recruits with gender dysphoria be separated from the U.S. military in accordance with an executive order issued a month ago by President Trump.",
    "url": "https://www.npr.org/2025/02/27/g-s1-51057/transgender-soldiers-military-ban-trump"
  },
  {
    "text": "Iowa lawmakers pass bill removing trans civil rights protections, sending it to governor  —  Stephen Gruber-Miller Marissa Payne Sabine MartinDes Moines Register  —  Over the protests of hundreds of Iowans chanting “no hate in our state,” Iowa's Republican-dominated Legislature voted Thursday … ",
    "url": "https://www.desmoinesregister.com/story/news/politics/2025/02/27/iowa-civil-rights-act-transgender-protections-vote-house-file-583/80546396007/"
  },
  {
    "text": "Social Security Administration could cut up to 50% of its workforce  —  The Social Security Administration is preparing to lay off at least 7,000 people from its workforce of 60,000, according to a person familiar with the agency's plans who is not authorized to speak publicly.",
    "url": "https://apnews.com/article/social-security-layoffs-doge-musk-trump-93efbed33957af5ec8ac37744d0592de"
  },
  {
    "text": "She hoped Trump's victory would change her life, but not like this  —  Ryleigh Cooper is normally more focused on motherhood than politics.  Then came DOGE.  —  BALDWIN, Mich. — Ryleigh Cooper exhaled as she slid onto the couch after nine hours of work for the U.S. Forest Service … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/27/fired-federal-worker-trump-voter/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNjMyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMDExMTk5LCJpYXQiOjE3NDA2MzI0MDAsImp0aSI6ImQ5Njg0YjRjLWY2YjQtNGYyZi1iNTJkLTVmYmIyMjQ1NWQ0YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAyLzI3L2ZpcmVkLWZlZGVyYWwtd29ya2VyLXRydW1wLXZvdGVyLyJ9.GNimSAzg0sKyVizF2U76D8Ltq_VP8FXvxp5YLrMsTq0"
  }
]