[
  {
    "text": "University of Pennsylvania president steps down amid criticism of antisemitism testimony  —  The chair of the Penn Board of Trustees announced that Liz Magill has voluntarily stepped down as president of the Ivy League school.  —  University of Pennsylvania President Liz Magill resigned … ",
    "url": "https://www.nbcnews.com/news/us-news/university-pennsylvania-president-steps-criticism-antisemitism-testimo-rcna128712"
  },
  {
    "text": "Exclusive: Wharton board tries to increase pressure on Penn president Liz Magill  —  The next several days could be critical for the future of University of Pennsylvania president Elizabeth Magill, who remains under fire for her testimony at a congressional hearing on antisemitism.",
    "url": "https://www.axios.com/2023/12/09/wharton-penn-antisemitism-pressure-congress"
  },
  {
    "text": "Penn's President Resigns After Her Responses About Antisemitism  —  At a congressional hearing this week, Elizabeth Magill had appeared to dodge questions of whether she would discipline students if they called for the genocide of Jews.  —  The president of the University of Pennsylvania … ",
    "url": "https://www.nytimes.com/2023/12/09/us/university-of-pennsylvania-president-resigns.html"
  },
  {
    "text": "Jack Smith reveals sweeping scope of bid to debunk Trump election machine claims  —  In a new filing, his team described interviewing more than a dozen of the top intelligence officials in Trump's administration.  —  Special counsel Jack Smith on Saturday sharply rejected Donald Trump's contention … ",
    "url": "https://www.politico.com/news/2023/12/09/jack-smith-reveals-sweeping-scope-of-bid-to-debunk-trump-election-machine-claims-00130965"
  },
  {
    "text": "Texas Supreme Court temporarily halts order that allowed pregnant woman to have abortion  —  The Texas Supreme Court on Friday temporarily halted an order allowing a woman who is 20 weeks pregnant to get an abortion — reversing a lower-court ruling that marks the first case of a pregnant woman seeking … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/08/texas-abortion-ruling-kate-cox-supreme-court/"
  },
  {
    "text": "Trump defends dictator comments amid NYC soiree filled with MAGA diehards  —  At an event with key figures within the MAGA movement, the former president repeated comments that he wants to be a dictator on “day one.”  —  NEW YORK — The chairman of an Austrian political party founded by ex-Nazis … ",
    "url": "https://www.politico.com/news/2023/12/10/trump-defends-dictator-comments-amid-nyc-soiree-filled-with-extremists-maga-diehards-00130968"
  },
  {
    "text": "Sheila Jackson Lee loses Houston mayor's race to tough-on-crime state senator  —  The showdown illuminates the faultlines within the Democratic Party over how to deal with crime on a local level.  —  Democratic state Sen. John Whitmire defeated Democratic Rep. Sheila Jackson Lee … ",
    "url": "https://www.politico.com/news/2023/12/09/john-whitmire-sheila-jackson-lee-houston-mayor-00130873"
  },
  {
    "text": "Trump hits Casey DeSantis over call for out-of-state backers to ‘be a part of the caucus’ in Iowa  —  The Florida first lady told Fox News viewers that “you do not have to be a resident of Iowa to be able to participate in the caucus.”  —  Former president Donald Trump seized on an apparent blunder … ",
    "url": "https://www.politico.com/news/2023/12/09/trump-hits-casey-desantis-over-false-iowa-caucus-claims-00130952"
  },
  {
    "text": "‘We Only Need Some Metal Things’  —  Will America abandon Ukraine?  —  In the summer of 1940, when Great Britain was fighting Nazi Germany alone, Winston Churchill asked to borrow a few dozen aging American destroyers to defend the English coast from imminent invasion.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/12/ukraine-russia-war-aid/676287/"
  },
  {
    "text": "Trump Takes 2024 Lead as Biden Approval Hits New Low, WSJ Poll Finds  —  Unhappiness with Biden's performance is pervasive, with economic pessimism weighing him down  —  WASHINGTON—President Biden's political standing is at its weakest point of his presidency, a new Wall Street Journal poll finds … ",
    "url": "https://www.wsj.com/politics/elections/trump-takes-2024-lead-as-biden-approval-hits-new-low-wsj-poll-finds-fb4fca0c?mod=followamazon"
  },
  {
    "text": "Trump lawyer says he will take stand in fraud trial regardless of gag order  —  Former President Trump's attorney Alina Habba claimed Friday that her client would take the stand on Monday in his civil fraud trial, despite the judge's gag order and discouragement from his legal team.",
    "url": "https://thehill.com/regulation/court-battles/4351358-alina-habba-trump-will-take-stand-fraud-trial-despite-gag-order/"
  },
  {
    "text": "ISRAEL - M830A1 120MM TANK CARTRIDGES  —  The Secretary of State has approved a possible Foreign Military Sale to the Government of Israel of 120mm M830A1 High Explosive Anti-Tank Multi-Purpose with Tracer (MPAT) tank cartridges and related equipment for an estimated cost of $106.5 million.",
    "url": "https://www.dsca.mil/press-media/major-arms-sales/israel-m830a1-120mm-tank-cartridges"
  },
  {
    "text": "ACLU to Represent NRA in Supreme Court Free-Speech Case  —  The civil liberties group says it opposes the N.R.A. and its mission but has agreed to represent it in the Supreme Court in a free-speech case.  —  The American Civil Liberties Union and the National Rifle Association agree about very little.",
    "url": "https://www.nytimes.com/2023/12/09/us/aclu-nra-scotus-free-speech.html"
  },
  {
    "text": "Her Online Sex Life Was Exposed.  She Lost Her Election.  Now She's Speaking Out.  —  Susanna Gibson's campaign was rocked when an opponent exposed her private digital life to the public.  She won't be the last.  —  It is not often that a state legislative campaign in an off-season election seizes the national spotlight.",
    "url": "https://www.politico.com/news/magazine/2023/12/09/susanna-gibson-virginia-digital-privacy-00130883"
  }
]