[
  {
    "text": "Trump-Putin 2024  —  Happy Presidents' Day—a quick missive today, and we'll let you get back to your holiday.  —  Hanging Putin Around Trump's Neck  —  Not to be a Debbie Downer on Presidents' Day, but I want to talk about Donald Trump and Vladimir Putin.",
    "url": "https://plus.thebulwark.com/p/trump-putin-2024"
  },
  {
    "text": "Biden administration is leaning toward supplying Ukraine with long-range missiles  —  If Republicans continue to block U.S. military aid to Ukraine, the White House could turn to an ally to provide Kyiv with ATACM missiles capable of striking Russian-held Crimea.",
    "url": "https://www.nbcnews.com/investigations/biden-administration-leaning-supplying-ukraine-long-range-missiles-rcna139394"
  },
  {
    "text": "How Trump Is Killing Off the ‘Reagan Republican’ in Congress  —  Ukraine aid is showing how isolationist the new GOP is under Donald Trump. … Less than a decade ago, all but a few Republicans in Congress would have taken the title of “Reagan Republican” as a badge of honor.",
    "url": "https://www.thedailybeast.com/how-trump-is-killing-off-the-reagan-republican-in-congress"
  },
  {
    "text": "Wisconsin fake elector on why he signed phony electoral document for Trump  —  The month after the presidential election in 2020, Democratic and Republican electors representing the candidate who won the popular vote in their states gathered across the country to formally cast electoral votes for president.",
    "url": "https://www.cbsnews.com/news/wisconsin-fake-elector-says-he-was-tricked-into-signing-phony-document-claiming-trump-won-60-minutes-transcript/"
  },
  {
    "text": "Anti-Trump Burnout: The Resistance Says It's Exhausted  —  Bracing for yet another election against Donald Trump, America's liberals are feeling the fatigue.  “We're kind of, like, crises-ed out,” one Democrat said.  —  In 2017 they donned pink hats to march on Washington … ",
    "url": "https://www.nytimes.com/2024/02/19/us/politics/trump-resistance-democrats-voters.html"
  },
  {
    "text": "John Oliver Offers Clarence Thomas Millions to Resign Immediately  —  “Your move, Clarence,” the “Last Week Tonight” host said at the end of his 11th season premiere.  “Your fucking move.”  —  There's a reason John Oliver and his Last Week Tonight crew keep winning Emmys … ",
    "url": "https://www.thedailybeast.com/john-oliver-offers-clarence-thomas-millions-to-resign-immediately"
  },
  {
    "text": "Lauren Boebert Tries to Convince New District She's Not All Drama  —  Colorado Republican has fundraising and recognition advantages but faces chilly reception from local groups in crowded primary race  —  KIOWA, Colo.—Campaign swag for one of the nation's most visible and controversial members … ",
    "url": "https://www.wsj.com/politics/elections/lauren-boebert-colorado-district-election-2024-7414ca32"
  },
  {
    "text": "High-profile Republicans head for the exits amid House GOP dysfunction  —  House Republicans were shocked by some of the recent high-profile retirements announced by their colleagues, which have included powerful committee chairs and rising stars inside the GOP.",
    "url": "https://www.cnn.com/2024/02/19/politics/republicans-retiring-house/"
  },
  {
    "text": "Ursula von der Leyen announces bid for 2nd term  —  One of Europe's most powerful leaders is poised for another 5 years running the European Commission.  —  BERLIN — She wants five more years.  —  After months of speculation, European Commission President Ursula von der Leyen announced … ",
    "url": "https://www.politico.eu/article/ursula-von-der-leyen-second-term-european-commission-president/"
  },
  {
    "text": "Federal agencies scramble to finish Biden's rules — and protect his legacy from Trump  —  Green groups don't want regulations to fall prey to rollbacks as they did when Donald Trump won the presidency.  —  President Joe Biden's allies are getting antsy about his administration's pileup … ",
    "url": "https://www.politico.com/news/2024/02/19/deadline-biden-environmental-rules-00141383"
  },
  {
    "text": "Nikki Haley says she would pardon Donald Trump if elected president  —  Presidential candidate Nikki Haley has vowed to pardon former US President Donald Trump should she defeat him in the Republican Primary and win against Joe Biden in November.  —  Speaking at a town hall in South Carolina on Sunday … ",
    "url": "https://www.independent.co.uk/tv/news/nikki-haley-pardon-donald-trump-us-election-b2498415.html"
  },
  {
    "text": "'No one's coming to save us': Abortion campaigns scramble for limited cash  —  From deep-red Arkansas and Missouri to purple Arizona and Nevada, activists are already competing with each other.  —  Abortion rights could be on the ballot in nearly a quarter of states this November … ",
    "url": "https://www.politico.com/news/2024/02/19/abortion-access-map-funding-00141436"
  },
  {
    "text": "‘China has a lot more to lose’: U.S. considering sanctioning Chinese firms aiding Russia's war  — The U.S. is considering slapping sanctions on Chinese companies it believes are helping Russia fuel its war in Ukraine, members of Congress told CNBC.  — Lawmakers may “very soon” … ",
    "url": "https://www.cnbc.com/2024/02/19/china-has-a-lot-more-to-lose-us-considering-sanctioning-chinese-firms-aiding-russias-war.html"
  },
  {
    "text": "New presidential rankings place Obama in top 10, Reagan and Trump below Biden  —  Some recent presidents were more likely to have a partisan divide in rankings  —  A new ranking of presidents by a group of self-styled experts determined that Abraham Lincoln is America's greatest president, while Donald Trump ranks last.",
    "url": "https://www.foxnews.com/us/new-presidential-rankings-place-obama-top-10-reagan-trump-below-biden"
  },
  {
    "text": "Suspect dead amid shooting that claimed the lives of 2 officers, 1 first responder, group says  —  A desperate call for help from a home in suburban Minneapolis early Sunday turned deadly for two police officers and a first responder who were shot and killed, according to officials.",
    "url": "https://apnews.com/article/officers-medic-shot-killed-burnsville-minnesota-e742b13f0d2ddca009e38337f46435b5"
  }
]