[
  {
    "text": "Justice Department Told Trump in May That His Name Is Among Many in the Epstein Files  —  Bondi also told president at the meeting that Justice decided to not release more Jeffrey Epstein documents because of the presence of child pornography and the need to protect victims",
    "url": "https://www.wsj.com/politics/justice-department-told-trump-name-in-epstein-files-727a8038?st=zBt3ap&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump's Epstein Fiasco Takes Darker Turn as Dem Senator Drops New Bomb  —  A few days ago, as the Jeffrey Epstein scandal gripped Washington, Senator Ron Wyden offered a striking revelation in an interview with The New York Times.  The Oregon Democrat said that his investigators had discovered … ",
    "url": "https://newrepublic.com/article/198247/trump-epstein-fiasco-ron-wyden"
  },
  {
    "text": "About That Japan Deal  —  So the Trump administration has triumphantly announced a trade deal with Japan, and I guess I should post something about it, even though my regular morning post — on a completely different topic — is already up.  —  There are three main things you should take away from this deal:",
    "url": "https://paulkrugman.substack.com/p/about-that-japan-deal"
  },
  {
    "text": "I Watched It Happen in Hungary.  Now It's Happening Here.  —  As the most recent U.S. ambassador to Viktor Orban's Hungary, I'm often asked if the Trump administration's tactics and policies feel familiar.  The short answer is yes.  But the more important — and unsettling — question is this … ",
    "url": "https://www.nytimes.com/2025/07/23/opinion/hungary-viktor-orban.html?unlocked_article_code=1.Yk8.qQ44.XCu7XaoxN_Lu&smid=bs-share"
  },
  {
    "text": "Scoop: Cooper plans to enter North Carolina Senate race next week  —  Former North Carolina Gov. Roy Cooper (D) is preparing to launch his Senate campaign next week, multiple sources told Axios. … - Cooper, a popular former governor, will instantly become the Democratic favorite to challenge … ",
    "url": "https://www.axios.com/2025/07/23/roy-cooper-run-north-carolina-senate-democrat"
  },
  {
    "text": "‘POTUS is clearly furious’: White House is frustrated by all-consuming Epstein coverage … “POTUS is clearly furious,” said a person close to the White House, who, like others in this story, was granted anonymity to discuss the mood inside the West Wing.  “It's the first time I've seen them sort of paralyzed.”",
    "url": "https://www.politico.com/news/2025/07/23/potus-is-clearly-furious-white-house-is-frustrated-by-all-consuming-epstein-coverage-00469547"
  },
  {
    "text": "Judge Denies Request to Unseal Epstein Grand Jury Transcripts in Florida  —  The president and his subordinates, including Attorney General Pam Bondi, have come under enormous pressure to release further details about the disgraced financier Jeffrey Epstein.",
    "url": "https://www.nytimes.com/2025/07/23/us/politics/florida-epstein-transcripts-unsealed-denied.html?unlocked_article_code=1.Yk8.Il_R.ZiBOWbFkq-sD&smid=url-share"
  },
  {
    "text": "Investigation of Harvard University Participation in the Exchange Visitor Program  —  The U.S. Department of State is opening an investigation into Harvard University's continued eligibility as a sponsor for the Exchange Visitor Program.  —  All sponsors participating in this program … ",
    "url": "https://www.state.gov/releases/office-of-the-spokesperson/2025/07/investigation-of-harvard-university-participation-in-the-exchange-visitor-program/"
  },
  {
    "text": "Hegseth Signal messages came from email classified ‘SECRET,’ watchdog told  —  The revelation contradicts the Trump administration's longstanding claims that no classified information was shared by the defense secretary's account during the “Signalgate” scandal.",
    "url": "https://www.washingtonpost.com/national-security/2025/07/23/hegseth-signalgate-classified-secret/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzMjQzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0NjI1NTk5LCJpYXQiOjE3NTMyNDMyMDAsImp0aSI6IjJhNTM1Yjc2LThkNjAtNDJiZS04YjIxLTY0ZGVlMmQxNjU2NSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzIzL2hlZ3NldGgtc2lnbmFsZ2F0ZS1jbGFzc2lmaWVkLXNlY3JldC8ifQ.0ZfVmHOagV4Sqob7oYKs_hKt-ZMnzh36CPqRqAZKRsw&itid=gfta"
  },
  {
    "text": "U.S. deportees, freed from Salvadoran prison, describe ‘horror movie’  —  Three Venezuelans, released last week from the Terrorism Confinement Center, said they were repeatedly beaten and denied access to lawyers.  —  just now  —  Julio González Jr. had agreed to be deported to Venezuela.",
    "url": "https://www.washingtonpost.com/world/2025/07/22/salvador-cecot-detainee-describes-beatings/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzMTU2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0NTM5MTk5LCJpYXQiOjE3NTMxNTY4MDAsImp0aSI6IjgzNGM5Mjc2LWQwOWUtNGQwOC1hODdiLWZhMWJkYmQ0ZTc1ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzA3LzIyL3NhbHZhZG9yLWNlY290LWRldGFpbmVlLWRlc2NyaWJlcy1iZWF0aW5ncy8ifQ.ItxKO60K_zj4bEqQUIfpnTTLmpPTcUEvaI6nuIxLcbg&itid=gfta"
  },
  {
    "text": "JD Vance Claims One of Our Worst Traditions as His Own  —  More than most recent vice presidents, JD Vance seems to be locked out of the room where it happens.  —  Stephen Miller, the White House deputy chief of staff, is by most accounts the president's point person on mass deportation and immigration enforcement.",
    "url": "https://www.nytimes.com/2025/07/23/opinion/jd-vance-claremont-american-citizen.html?unlocked_article_code=1.Yk8.klbn.qJ7gbDecGo1x&smid=url-share"
  },
  {
    "text": "Democrats Are Running Circles Around Republicans on Epstein … When it comes to fighting President Donald Trump, Democrats across the nation have complained for months about the sluggish reflexes of party leaders in Washington.  —  Who would have guessed that a MAGA-fueled conspiracy theory would change all that?",
    "url": "https://www.politico.com/news/magazine/2025/07/23/house-democrats-jeffrey-epstein-trump-politics-00469042"
  },
  {
    "text": "E.P.A. Is Said to Draft a Plan to End Its Ability to Fight Climate Change  —  According to two people familiar with the draft, it would eliminate the bedrock scientific finding that greenhouse-gas emissions threaten human life by dangerously warming the planet.",
    "url": "https://www.nytimes.com/2025/07/22/climate/epa-endangerment-finding-rescind.html?unlocked_article_code=1.Yk8.ASYE.FzW5jm0o_jfC&smid=url-share"
  },
  {
    "text": "American Convicted of Murder Is Freed by Trump From Venezuela Prison  —  The Trump administration said it was protecting Americans unjustly held abroad.  One of the rescued men, Dahud Hanid Ortiz, killed three people, according to court documents.  —  When the State Department secured … ",
    "url": "https://www.nytimes.com/2025/07/23/world/americas/venezuela-american-convicted-murder.html"
  },
  {
    "text": "Skydance Tells FCC It Will Create CBS News Ombudsman, Eliminate DEI at Paramount  —  The company said it would commit to a “comprehensive review” post-transaction. … Skydance has told the Federal Communications Commission that once its acquisition of Paramount Global is complete … ",
    "url": "https://www.hollywoodreporter.com/business/business-news/skydance-paramount-fcc-cbs-news-ombudsman-media-bias-1236326955/"
  },
  {
    "text": "What a Democrat Could Do With Trump's Power  —  When Democrats return to power, how much of Trump's damage can they undo?  —  In this first year of his second term, President Donald Trump has claimed broad powers to unilaterally restructure much of how the U.S. government functions.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/07/democrats-undo-trump-supreme-court/683615/?gift=guxsrl_dAdXUP9zqbQPWxTNLwkgkUY6LEdwhSqGVM10"
  },
  {
    "text": "Pete Hegseth hit by deeply embarrassing allegations as leaked letter calling for his removal rips through the Pentagon  —  An effort is under way among some Pentagon officials to denounce Pete Hegseth as unfit to serve as Defense Secretary, DailyMail.com can reveal.",
    "url": "https://www.dailymail.co.uk/news/article-14925677/inside-revolt-pentagon-Pete-Hegseth-letter-defense-secretary-ouster.html"
  },
  {
    "text": "Some Democrats may finally be ready to play dirty over redistricting  —  A new kind of political battle is emerging between America's parties — one centers on the composition of Congress and congressional redistricting.  This process usually occurs every decade, after the US Census finishes … ",
    "url": "https://www.vox.com/congress/420827/texas-fair-map-democrats-republicans-new-redistricting-war-gerrymandering-congress-trump"
  },
  {
    "text": "U.S. Quietly Drafts Plan to End Program That Saved Millions From AIDS  —  PEPFAR, the campaign to end H.I.V. globally, would morph into an effort to detect disease outbreaks and sell American products, according to documents obtained by The Times.  —  The federal program to combat H.I.V … ",
    "url": "https://www.nytimes.com/2025/07/23/health/pepfar-shutdown.html"
  },
  {
    "text": "Macrons file US lawsuit over claims France's first lady was born male  —  Case against rightwing influencer Candace Owens is a rare defamation suit from a serving world leader  —  Kaye Wiggins in New York, Leila Abboud in Paris and Lauren Fedor in Washington",
    "url": "https://www.ft.com/content/d9bf7d2b-b834-4c19-8c66-8629e3046f24"
  },
  {
    "text": "Russ Vought bills CFPB $5M for his security detail  —  The director of the White House's budget office wears multiple hats, including the temporary head of the Consumer Financial Protection Bureau.  —  The Office of Management and Budget is now billing CFPB $4.7 million for Russ Vought's security detail … ",
    "url": "https://www.govexec.com/management/2025/07/russ-vought-bills-cfpb-5m-his-security-detail/406928/"
  },
  {
    "text": "Jeffrey Epstein's Former Attorney Who Secured Plea Deal Dead at 80  —  Roy Black, the prominent defense attorney who helped secure Jeffrey Epstein's 2008 plea deal, has died, according to his law partner.  —  Black died on Monday at his home in Coral Gables at the age of 80 after an illness, his law partner Howard Srebnick said.",
    "url": "https://www.newsweek.com/roy-black-dead-80-jeffrey-epstein-attorney-plea-deal-2102731"
  },
  {
    "text": "Silicon Valley AI Startups Are Embracing China's Controversial ‘996’ Work Schedule  —  In an industry once known for cushy perks, some founders are now asking staff to commit to a 72-hour weekly schedule.  You're either in or you're out.  —  Would you like to work nearly double the standard 40-hour week?",
    "url": "https://www.wired.com/story/silicon-valley-china-996-work-schedule/"
  },
  {
    "text": "How Many Obama Arrest Threats Does It Take to Change a Storyline?  —  Among the various silly and dangerous things House Republicans are doing these days—about which more below—perhaps the silliest is trying to rename the opera theater inside the Kennedy Center after Melania Trump.",
    "url": "https://www.thebulwark.com/p/how-many-obama-arrest-threats-does-it-take-change-storyline-trump-epstein-arrest"
  },
  {
    "text": "Behind the Curtain: Losing by winning  —  President Trump, in terms of raw accomplishments, crushed his first six months in historic ways.  Massive tax cuts.  Record-low border crossings.  Surging tariff revenue.  Stunning air strikes in Iran.  Modest inflation.",
    "url": "https://www.axios.com/2025/07/23/trump-polling-six-months"
  },
  {
    "text": "GOP Senator, 73, Freezes During Fox Business Interview  —  GERONTOCRACY  —  Senator John Kennedy of Louisiana had a frightening freeze-up on Tuesday afternoon.  —  Another GOP member of Congress has had what appears to be a health scare, with septuagenarian Senator John Kennedy freezing during a Fox Business interview on Tuesday.",
    "url": "https://www.thedailybeast.com/gop-senator-john-kennedy-73-freezes-during-fox-news-interview/"
  },
  {
    "text": "Trump Wants to Deport a Children's Hospital Chaplain to Egypt, Where He ‘Faces Death’  —  To so many in Cincinnati, Imam Ayman Soliman was a beloved Children's Hospital chaplain known for comforting the parents of dying kids  —  CINCINNATI — In recent years, if you lived … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-cincinnati-children-hospital-ayman-soliman-egypt-1235392459/"
  }
]