[
  {
    "text": "Johnson aide discouraged Hutchinson subpoena over concerns about lawmakers' ‘sexual texts’  —  The move was intended in part to prevent the release of sexually explicit texts that lawmakers sent Cassidy Hutchinson.",
    "url": "https://www.washingtonpost.com/politics/2025/01/23/cassidy-hutchinson-lawmakers-texts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NjA4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4OTkwNzk5LCJpYXQiOjE3Mzc2MDg0MDAsImp0aSI6Ijc0NWQyMGVmLTIwNDEtNDEyNi1iYjNkLTJkNjM5NmU2ZjMwMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzIzL2Nhc3NpZHktaHV0Y2hpbnNvbi1sYXdtYWtlcnMtdGV4dHMvIn0.7Ls-g5QQAxsT3ZwpfrOAlVcnD6OWWF6dR_ihLvpdR94&itid=gfta"
  },
  {
    "text": "Pete Hegseth's nomination to lead the Pentagon clears a key hurdle in the Senate  —  Senators voted 51-49 to advance Hegseth's defense secretary bid, which has been mired in a series of controversies.  —  WASHINGTON — The Senate on Thursday voted to advance Pete Hegseth's nomination … ",
    "url": "https://www.nbcnews.com/politics/congress/pete-hegseths-nomination-lead-pentagon-clears-key-hurdle-senate-rcna188932"
  },
  {
    "text": "Senate confirms John Ratcliffe to be Trump's CIA director  —  Ratcliffe becomes the second Trump nominee to be approved by the Republican-led Senate.  —  WASHINGTON — The Senate voted Thursday to confirm John Ratcliffe as the next CIA director under President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-confirms-john-ratcliffe-trumps-cia-director-rcna188588"
  },
  {
    "text": "Pete Hegseth Paid $50,000 To Woman Who Accused Him Of 2017 Sex Assault  —  Pete Hegseth, President Donald Trump's nominee for defense secretary, paid $50,000 to the woman who accused him of sexual assault in 2017.  —  LOADING  —  Pete Hegseth, President Donald Trump's nominee for defense secretary … ",
    "url": "https://www.huffpost.com/entry/pete-hegseth-payment-sexual-assault_n_6792badce4b0629837bf0f04"
  },
  {
    "text": "What It Means That Republicans Aren't Acting on the Pete Hegseth Allegations  —  Update: The Senate voted to proceed on the nomination, 51-49, on Jan. 23.  Two Republicans, Susan Collins and Lisa Murkowski, voted against moving forward to a final vote on Mr. Hegseth's nomination.",
    "url": "https://www.nytimes.com/2025/01/22/opinion/pete-hegseth-republicans-trump-loyalty.html"
  },
  {
    "text": "A federal judge temporarily blocks Trump's executive order redefining birthright citizenship  —  A federal judge on Thursday temporarily blocked President Donald Trump's executive order redefining birthright citizenship, calling it “blatantly unconstitutional” during the first hearing in a multi-state effort challenging the order.",
    "url": "https://apnews.com/article/birthright-citizenship-donald-trump-lawsuit-immigration-9ac27b234c854a68a9b9f8c0d6cd8a1c"
  },
  {
    "text": "Judge Temporarily Blocks Trump's Plan to End Birthright Citizenship  —  A federal judge in Seattle has issued a temporary order halting the president's plan.  —  A federal judge on Thursday temporarily blocked President Trump's executive order to end automatic citizenship to babies born on American soil … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/judge-blocks-birthright-citizenship.html"
  },
  {
    "text": "Trump administration defends his birthright citizenship order in court for the first time  —  A federal district court hearing Thursday in Seattle will be the first action in what promises to be a protracted and wide-ranging battle over the new administration's agenda.",
    "url": "https://www.nbcnews.com/politics/immigration/trump-administration-defends-birthright-citizenship-order-court-first-rcna188851"
  },
  {
    "text": "Judge blocks Trump's ‘blatantly unconstitutional’ executive order that aims to end birthright citizenship  —  A federal judge said Thursday that President Donald Trump's executive order ending birthright citizenship was “blatantly unconstitutional” and issued a temporary restraining order to block it.",
    "url": "https://www.cnn.com/2025/01/23/politics/birthright-citizenship-lawsuit-hearing-seattle"
  },
  {
    "text": "Declassification of Records Concerning the Assassinations  —  OF PRESIDENT JOHN F. KENNEDY, SENATOR ROBERT F. KENNEDY, AND THE REVEREND DR. MARTIN LUTHER KING, JR.  —  EXECUTIVE ORDER  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/declassification-of-records-concerning-the-assassinations-of-president-john-f-kenned/"
  },
  {
    "text": "Trump Revokes Security Detail for Pompeo and Others Despite Threats From Iran  —  The officials had been part of an aggressive posture against Iran during President Trump's first term.  —  President Trump revoked security protection for his former secretary of state, Mike Pompeo … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-pompeo-security-iran.html?unlocked_article_code=1.rU4.6oMb.eKfhCujI5hAG&smid=url-share"
  },
  {
    "text": "‘The Holocaust is not a joke’: Elon Musk finally goes too far for Anti-Defamation League  —  The Anti-Defamation League took criticism earlier this week when it declined to condemn X owner Elon Musk for making a salute at a Trump rally that many overt racists approvingly interpreted as a Nazi salute.",
    "url": "https://www.rawstory.com/elon-musk-adl/"
  },
  {
    "text": "Well, Well, Well: Trump Can't Lower Egg Prices After All  —  Donald Trump's decision to press pause on communications from health organizations amid an escalating bird flu breakout could take America's soaring egg prices and make them even worse.  —  The consumer price index found that egg prices … ",
    "url": "https://newrepublic.com/post/190592/donald-trump-egg-prices-bird-flu"
  },
  {
    "text": "DOGE's Top Lawyer to Depart  —  Bill McGinley, the group's counsel, is planning to return to the private sector  —  The top lawyer at Elon Musk's Department of Government Efficiency is announcing his departure just days after President Trump's return to the White House.",
    "url": "https://www.wsj.com/politics/policy/doges-top-lawyer-to-depart-b3fe71a1?st=jXuXyY&reflink=article_copyURL_share"
  },
  {
    "text": "Justice Dept. revokes job offers to young lawyers in elite honors program  —  Students or graduates from Harvard, Duke, Georgetown, Stanford and other top law schools lost job offers from the Attorney General's Honors Program.  —  The Justice Department has abruptly revoked recent job offers … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/23/justice-revokes-job-offers-young-lawyers/"
  },
  {
    "text": "Rubio instructs staff to freeze passport applications with ‘X’ sex markers  —  Secretary of state tells staff ‘sex is not changeable’ in email following Trump executive order on gender  —  The US state department has frozen all applications for passports with “X” sex markers and changes … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/23/trump-rubio-x-gender-passport"
  },
  {
    "text": "CNN Plots Major Overhaul as It Enters a New Trump Era  —  Mark Thompson has promised to reinvent CNN since he arrived in 2023.  Now, he is remaking the network's TV lineup and its work force.  —  Give people news when and where they want it.  —  That, says Mark Thompson, CNN's chief executive … ",
    "url": "https://www.nytimes.com/2025/01/23/business/media/cnn-layoffs-mark-thompson.html?unlocked_article_code=1.rU4.Ktql.gY13zafutkB6&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Mississippi lawmaker introduces ‘Contraception Begins at Erection Act’  —  The bill, which is unlikely to pass, would make it unlawful for “a person to discharge genetic material without the intent to fertilize an embryo.”  —  Mississippi state Sen. Bradford Blackmon, a Democrat … ",
    "url": "https://www.nbcnews.com/politics/politics-news/mississippi-lawmaker-introduces-contraception-begins-erection-act-rcna188938"
  },
  {
    "text": "Trump's First Shot in His War on the ‘Deep State’  —  Shortly after taking the oath of office, President Donald Trump signed an executive order revoking the security clearances of about four dozen former national-security officials.  Their offense was that in 2020, they had signed … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/01/trump-executive-order-security/681423/?gift=kPTlqn0J1iP9IBZcsdI5Id-xVwitdv0v4KVTsB0RaiM&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "What Republicans Could Cut to Pay for Trump's Tax Cuts: Medicaid and More  —  President Trump wants a massive tax cut and immigration crackdown bill.  Now Republicans must decide what to cut to help pay for it.  —  Top Republicans are passing around an extensive menu of ideas to cover … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-tax-cuts-immigration-house-republicans.html"
  },
  {
    "text": "President Donald Trump says he'll ‘demand that interest rates drop immediately’  —  WATCH NOW  —  President Donald Trump lobbed his first volley at the Federal Reserve, saying Thursday that he will apply pressure to bring down interest rates.  —  Speaking to an assembly of global leaders … ",
    "url": "https://www.cnbc.com/2025/01/23/president-donald-trump-says-hell-demand-that-interest-rates-drop-immediately.html"
  },
  {
    "text": "Trump moves to close Pentagon office focused on curbing civilian deaths  —  Officials are drafting a proposal to defund and potentially ‘disestablish’ the Civilian Protection Center of Excellence, though Congress would have to approve doing so.  —  The Trump administration is moving to abolish … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/23/trump-pentagon-civilian-deaths/"
  },
  {
    "text": "Donald Trump Is Running Riot  —  I have never been more concerned about the rule of law in the United States.  —  I was born in 1969 — five years after the Civil Rights Act was passed — and I have no memory of the legal system operated in the Jim Crow South, when there was one code … ",
    "url": "https://www.nytimes.com/2025/01/23/opinion/trump-pardons-bolton-jan-6.html"
  },
  {
    "text": "After Trump orders Denali renamed, a McKinley descendant promotes a compromise  —  Trump wants North America's tallest peak renamed in honor of President William McKinley, drawing heat from many in Alaska.  —  When President Donald Trump signed an executive order on his first day back in office … ",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-orders-denali-renamed-mount-mckinley-presidential-descendant-sup-rcna188868"
  },
  {
    "text": "The Truth Speakers  —  In a terrible week for our country, three stars shone brightly through the gloom.  —  There's been no shortage of rich men kissing Trump's ass lately, even showing up to his inauguration to cozy up to him and his fascist new bestie, Elon Musk.",
    "url": "https://statuskuo.substack.com/p/the-truth-speakers"
  },
  {
    "text": "Jeffries draws red line on debt-for-aid deal: ‘Nonstarter’  —  Top House Democrats are pouring cold water on a Republican proposal to trade a debt limit increase for California wildfire aid, with House Minority Leader Hakeem Jeffries telling reporters it was a “nonstarter.”",
    "url": "https://www.politico.com/live-updates/2025/01/23/congress/dems-fire-aid-debt-limit-00200221"
  },
  {
    "text": "Vulnerable House Republicans warn leaders against cutting Obamacare  —  House Republicans in competitive districts warned GOP leaders Thursday: We could lose our seats if you gut Obamacare to pay for a massive border, energy and tax bill.  A group of about a dozen centrist Republicans delivered … ",
    "url": "https://www.politico.com/live-updates/2025/01/23/congress/gop-centrists-defend-obamacare-00200287"
  }
]