[
  {
    "text": "B-2 bombers moving to Guam amid Middle East tensions, US officials say  —  The United States is moving B-2 bombers to the Pacific island of Guam, two U.S. officials told Reuters on Saturday, as President Donald Trump weighs whether the United States should take part in Israel's strikes against Iran.",
    "url": "https://www.reuters.com/business/aerospace-defense/b-2-bombers-moving-guam-amid-middle-east-tensions-us-officials-say-2025-06-21/"
  },
  {
    "text": "Scoop: Trump's backchannel to Iran failed after supreme leader went dark  —  President Trump and Turkish President Recep Tayyip Erdoğan quietly sought to arrange a meeting between senior U.S. and Iranian officials in Istanbul last week amid Israel's escalating war with Iran.",
    "url": "https://www.axios.com/2025/06/21/trump-iran-turkey-negotiations-israel-war"
  },
  {
    "text": "Ayatollah Ali Khamenei, Planning for His Possible Assassination, Picks Successors  —  Ayatollah Ali Khamenei has not only picked replacements in his chain of military command in case they are killed in Israeli strikes, he has also named three senior clerics to replace him should he, too, be slain.",
    "url": "https://www.nytimes.com/2025/06/21/world/middleeast/iran-ayatollah-israel-war.html?unlocked_article_code=1.Qk8.rGG2.RWqm4_VcFOLs&smid=url-share"
  },
  {
    "text": "B-2 Stealth Bombers Depart Whiteman AFB for Andersen AFB, Guam, Amid Iran Conflict  —  Following a large number of tanker positioning movements over the previous few days, aviation enthusiasts have now confirmed the departure of B-2 Spirits from Whiteman AFB en route to Guam.",
    "url": "https://theaviationist.com/2025/06/21/b-2-guam-amid-iran-conflict/"
  },
  {
    "text": "MAGA star Steve Bannon plays outsized role in Trump's Iran decision: Sources  —  Trump's debate on Iran exposed a rift within the GOP.  —  Steve Bannon speaks during the Semafor World Economy Summit 2025, April 23, 2025 in Washington.  —  By the time President Donald Trump … ",
    "url": "https://abcnews.go.com/Politics/maga-star-steve-bannon-plays-outsized-role-trumps/story?id=123054297"
  },
  {
    "text": "A White Nationalist Wrote a Law School Paper Promoting Racist Views.  It Won Him an Award.  —  The University of Florida student won an academic honor after he argued in a paper that the Constitution applies only to white people.  From there, the situation spiraled.",
    "url": "https://www.nytimes.com/2025/06/21/us/white-supremacist-university-of-florida-paper.html?unlocked_article_code=1.Qk8.Zdse.9h3KhkfNOqv2&smid=url-share"
  },
  {
    "text": "Trump and GOP's tax bill would sell off USPS's brand-new EVs  —  Postal Service officials told lawmakers the proposal would cause “substantial harm” to “our customers, your constituents.”  —  A little-noticed provision of President Donald Trump and Republicans' massive tax and immigration legislation … ",
    "url": "https://www.washingtonpost.com/business/2025/06/21/trump-usps-trucks-taxes/"
  },
  {
    "text": "‘Petty and unserious’: Padilla blasts Vance for calling him ‘Jose Padilla’  —  The vice president referred to his former Senate colleague by the wrong name on Friday.  —  Sen. Alex Padilla snapped back at Vice President JD Vance Saturday, calling the vice president “petty and unserious” … ",
    "url": "https://www.politico.com/news/2025/06/21/alex-padilla-jd-vance-fight-00416393"
  },
  {
    "text": "Stephen Miller's Fingerprints Are on Everything in Trump's Second Term  —  The deputy chief of staff has played an outsize role in immigration—and amassed more power than almost anyone else at the White House  —  Stephen Miller wanted to keep the planes in the air—and that is where they stayed.",
    "url": "https://www.wsj.com/politics/policy/stephen-miller-trump-immigration-c1e0e924?st=vGtF1T&reflink=desktopwebshare_permalink"
  },
  {
    "text": "‘A good day’: Detained U.S. citizen said agents bragged after arresting dozens at Home Depot  —  A 37-year-old U.S. citizen who was tackled to the ground and arrested after filming federal agents at Home Depot on Thursday said he was held for more than an hour at Dodger Stadium … ",
    "url": "https://www.latimes.com/california/story/2025-06-20/border-patrol-agents-brag-in-front-of-detained"
  },
  {
    "text": "Harvard and Trump Restart Talks to Potentially End Bitter Dispute  —  Details about the discussions emerged after President Trump said the two sides, which have been locked in court battles for weeks, might reach a settlement soon.  —  Harvard University and the Trump administration … ",
    "url": "https://www.nytimes.com/2025/06/20/us/politics/harvard-federal-funding-trump.html?unlocked_article_code=1.Qk8.0K_m.N3CJMIcyCt7J&smid=url-share"
  },
  {
    "text": "Abandoned by Trump, a farmer and a migrant search for a better future  —  For this story, John Woodrow Cox interviewed more than 40 farmers across the country.  He and photographer Matt McClain reported from Colorado while Sarah Blaskey talked to more than two dozen employees … ",
    "url": "https://www.washingtonpost.com/investigations/interactive/2025/trump-farmers-grants-freeze-usda-migrants"
  },
  {
    "text": "Harvard hired a researcher to uncover its ties to slavery.  He says the results cost him his job: ‘We found too many slaves’  —  When the extent of the university's involvement with slavery was unearthed, a scholar tracking descendants of enslaved workers was suddenly fired",
    "url": "https://www.theguardian.com/news/2025/jun/21/harvard-slavery-decendants-of-the-enslaved"
  },
  {
    "text": "56,397 People Now Detained by ICE, Possibly Highest in History  —  According to the latest data published by Immigration and Customs Enforcement (ICE) on Friday, the number of immigrants held in detention on June 15 reached 56,397.1 This might be the largest detained population on record.",
    "url": "https://austinkocher.substack.com/p/55654-people-now-detained-by-ice"
  },
  {
    "text": "Trump admin shortens ACA enrollment window  —  The Trump administration on Friday narrowed the period to sign up for Affordable Care Act coverage and imposed other restrictions aimed at rolling back Biden-era flexibilities for the program.  —  Why it matters: The Centers for Medicare … ",
    "url": "https://www.axios.com/2025/06/20/trump-admin-aca-coverage-changes"
  },
  {
    "text": "“Neither our media nor our political system is designed to deal with a far right authoritarian party”  —  Mark Copelovitch unpacks his signature phrase.  —  ∙ Paid … “Performative public lying is a hallmark of far right authoritarian parties.”  —  “Neither our media nor … ",
    "url": "https://www.publicnotice.co/p/mark-copelovitch-interview-2025"
  },
  {
    "text": "How Trump Treats Black History Differently Than Other Parts of America's Past  —  Since taking office in January, President Trump has tried to reframe the country's past involving racism and discrimination by de-emphasizing that history or at times denying that it happened.  —  NEWS ANALYSIS",
    "url": "https://www.nytimes.com/2025/06/20/us/politics/trump-black-history-federal-holidays.html"
  },
  {
    "text": "New insight into Texas family detention reveals adults fighting kids for clean water  —  Adults fighting kids for clean water, despondent toddlers and a child with swollen feet denied a medical exam — these first-hand accounts from immigrant families at detention centers included in a motion filed … ",
    "url": "https://apnews.com/article/migrants-child-supervision-texas-e4994b2b6786717ea79a4be230e476bf"
  },
  {
    "text": "Pakistan to nominate Donald Trump for Nobel peace prize  —  Islamabad says US president helped resolve India conflict but critic says 'Israel's sugar daddy in Gaza' not candidate for any prize  —  Pakistan has said it will recommend Donald Trump for the Nobel peace prize for his work … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/21/pakistan-trump-nobel-prize-recommendation-india-ceasefire"
  },
  {
    "text": "Trump's Threat to Unleash Troops in Cities Just Got Darker and Scarier  —  On Thursday, President Donald Trump scored a temporary victory after an appeals court ruled that he can continue deploying the National Guard as part of his watch-me-play-fascist-on-TV response to anti-ICE protests in Los Angeles.",
    "url": "https://newrepublic.com/article/197074/trump-threat-unleash-troops-cities"
  },
  {
    "text": "Senate GOP's plan to push food aid costs onto states axed from megabill  —  The cost-share plan was a critical way for Republicans to trim spending to pay for their massive reconciliation package and farm bill programs.  —  Senate Republicans' plan to force states to share the cost … ",
    "url": "https://www.politico.com/news/2025/06/21/senate-republicans-snap-cost-share-plan-axed-megabill-00416367"
  },
  {
    "text": "Foreign Students Help Make America Great  —  Trump has recognized this repeatedly, but some of his policies risk hindering American innovation.  —  Click for Sound  —  The competition for economic supremacy between the U.S. and China is compounded by the view that American trade policy is unbalanced.",
    "url": "https://www.wsj.com/opinion/international-students-help-make-america-great-higher-education-colleges-universities-8ad3ba1a"
  },
  {
    "text": "Gen Z's stunning partisan split  —  America's youngest voters are far likelier to vote Republican than their older siblings.  —  Why it matters: Generation Z may be better understood as two distinct sub-generations — divided, in large part, by how they experienced the shock of COVID-19.",
    "url": "https://www.axios.com/2025/06/21/gen-z-partisan-split-young-voters"
  },
  {
    "text": "Trump turned soccer into a political battleground — and fans are fighting back  —  A year ahead of the World Cup, the sport is creating a hub of resistance to Trump's worst actions.  —  President Donald Trump had some unusual guests at the White House this week: players and staff members … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-ice-protests-soccer-los-angeles-rcna213749"
  }
]