[
  {
    "text": "At a private donor event, Trump likens the Biden administration to the ‘Gestapo’  —  Trump referenced the Nazi secret police as he was railing against the legal troubles he and his supporters are facing.  —  PALM BEACH, Fla. — Donald Trump compared President Joe Biden's administration … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-biden-administration-gestapo-private-donor-event-rcna150743"
  },
  {
    "text": "At Donor Retreat, Trump Calls Biden Administration the ‘Gestapo’  —  The speech by Donald J. Trump at a Republican National Committee fund-raising retreat came during his criminal trial in New York.  He faces a total of 88 criminal charges across four indictments.",
    "url": "https://www.nytimes.com/2024/05/04/us/politics/trump-donors.html"
  },
  {
    "text": "Gallows Humor and Talk of Escape: Trump's Possible Return Rattles Capital  —  At Washington dinner parties, dark jokes abound about where to go into exile if the former president reclaims the White House.  —  It has become the topic of the season at Washington dinner parties and receptions.",
    "url": "https://www.nytimes.com/2024/05/05/us/politics/trump-biden-election-dc.html"
  },
  {
    "text": "A Great American Con Led to the Mess on College Campuses.  Everyone Fell for It—Again.  —  A time-honored tactic by right-wing agitators brought on the “crisis” on American campuses.  Everyone fell for it—again.  —  In 2001, a Vietnam-era student radical named David Horowitz decided to once again start causing trouble on campus.",
    "url": "https://slate.com/news-and-politics/2024/05/university-protests-columbia-college-republicans.html"
  },
  {
    "text": "RNC lawyer Charlie Spies to step down just 2 months after taking the job  —  Spies was “pushed out,” according to a source familiar with the move.  —  Republican National Committee chief counsel Charlie Spies is parting ways with the party apparatus just months after stepping into the role.",
    "url": "https://www.nbcnews.com/politics/2024-election/republican-national-committee-lawyer-charlie-spies-step-tumult-rcna150745"
  },
  {
    "text": "Driver dies after crashing into White House perimeter gate  —  There was no threat to the president's home, law enforcement authorities said.  —  WASHINGTON — A driver died after a vehicle crashed into a gate at the White House Saturday night, but the fatal collision is being investigated … ",
    "url": "https://www.politico.com/news/2024/05/05/driver-dies-after-crashing-into-white-house-perimeter-gate-00156159"
  },
  {
    "text": "“May the 4th be with you”: Biden celebrates Star Wars Day with Luke Skywalker actor … - “Always,” Hamill added.  — The actor who played Luke Skywalker said he was “honored” to visit the White House, per the AP.",
    "url": "https://www.axios.com/2024/05/04/star-wars-day-biden-mark-hamill"
  },
  {
    "text": "Australia Pledges to Slash About $2 Billion From Student Debt  — Debt will retrospectively be capped at the lower of CPI or WPI  — Changes will cut the debt of about three million people  —  Australia plans to wipe out about A$3 billion ($2 billion) from student loans … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-05/australia-pledges-to-slash-about-2-billion-from-student-debt"
  },
  {
    "text": "Noem: 'They're just attacking me like crazy right now.'  —  The South Dakota governor has come under intense criticism for her decision to shoot and kill her dog 20 years ago.  —  Kristi Noem cast herself as the victim of a liberal- and media-run smear campaign at a Republican donor retreat on Saturday … ",
    "url": "https://www.politico.com/news/2024/05/04/noem-dog-attack-00156153"
  },
  {
    "text": "Trump lawyer John Eastman can't pratice law in D.C. temporarily, court says  —  The suspension of Eastman's license was in response to a similar decision in California.  —  The D.C. Court of Appeals has temporarily suspended John Eastman's law license after a similar decision in California … ",
    "url": "https://www.washingtonpost.com/national-security/2024/05/04/john-eastman-trump-lawyer-disbarred/"
  },
  {
    "text": "Crenshaw becomes latest Republican to hit Greene over Johnson ouster plan  —  Rep. Dan Crenshaw (R-Texas) became the latest Republican to hit Rep. Marjorie Taylor Greene (R-Ga.) over her plan to oust Speaker Mike Johnson (R-La.).  —  “She needs her time in the spotlight, you know … ",
    "url": "https://thehill.com/homenews/house/4643376-crenshaw-becomes-latest-republican-to-hit-greene-over-johnson-ouster-plan/"
  },
  {
    "text": "How Do I Prepare My Phone for a Protest?  (Updated 2024)  —  Simple steps to take before hitting the streets  —  This article is an updated version of The Markup's original article on how to prepare your phone for a protest, published in 2020.  —  Gaza solidarity encampments have appeared … ",
    "url": "https://themarkup.org/the-breakdown/2024/05/04/how-do-i-prepare-my-phone-for-a-protest-updated-2024"
  },
  {
    "text": "Senior UN official says northern Gaza is now in ‘full-blown famine’  —  WASHINGTON — A top U.N. official said Friday that hard-hit northern Gaza was now in “full-blown famine” after more than six months of war between Israel and Hamas and severe Israeli restrictions on food deliveries to the Palestinian territory.",
    "url": "https://www.npr.org/2024/05/04/1249153712/united-nations-northern-gaza-famine"
  },
  {
    "text": "Michigan's Graduation Is Disrupted by Pro-Palestinian Parade  —  Protesters briefly interrupted the commencement ceremony but were blocked from the stage by the state police.  Several universities were bracing for demonstrations at graduations this weekend.  —  Here's what we're covering:",
    "url": "https://www.nytimes.com/live/2024/05/04/us/college-campus-protests"
  },
  {
    "text": "Congressman appears to praise University of Mississippi students, including one making monkey gestures, who taunted a lone Black Gaza protester  — Rep. Mike Collins appeared to praise University of Mississippi students for racist chants.  — A video on X showed students engaging in racial taunts towards a Black war protester.",
    "url": "https://www.businessinsider.com/ole-miss-students-taunting-black-gaza-protester-approval-from-rep-2024-5"
  }
]