[
  {
    "text": "Pete Hegseth's Mother Accused Her Son of Mistreating Women for Years  —  Penelope Hegseth made the accusation in an email to her son in 2018, amid his contentious divorce.  She said on Friday that she regretted the email and had apologized to him.  —  The mother of Pete Hegseth … ",
    "url": "https://www.nytimes.com/2024/11/29/us/politics/pete-hegseth-mother-email.html?unlocked_article_code=1.d04.hkIK.QnXcVaptGbvi&smid=url-share"
  },
  {
    "text": "Text of the Email That Pete Hegseth's Mother Sent Him  —  Penelope Hegseth sent the email to her son in 2018 as he was in the middle of divorcing his wife, Samantha. … Son,  —  I have tried to keep quiet about your character and behavior, but after listening to the way you made Samantha feel today, I cannot stay silent.",
    "url": "https://www.nytimes.com/2024/11/29/us/politics/hegseth-email-text.html?unlocked_article_code=1.d04.9f-K.N-9gETW23a9n&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump defense secretary nominee Pete Hegseth's mother called him ‘an abuser of women’  —  Email from mother, published in the New York Times, said he mistreated women and displayed a lack of character  —  The family dynamics of Pete Hegseth, Donald Trump's nominee for secretary of defense … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/30/trump-defense-secretary-pick-pete-hegseth-mother-abuser-of-women"
  },
  {
    "text": "Corporate America Launches Unorthodox Campaign to Gain Trump's Attention  —  Companies look at scrubbing left-leaning policies from their websites and scoping out appearances on conservative podcasts  —  Corporate America is unleashing an unorthodox campaign to influence Donald Trump's agenda … ",
    "url": "https://www.wsj.com/politics/trump-transition-lobbying-company-image-ffd42d2e?st=JPBsv7&reflink=article_copyURL_share"
  },
  {
    "text": "Rogan says the ‘greatest media psy-op in history’ was waged against Trump: 'They've distorted who he is'  —  'What you're seeing with Trump, regardless of his flaws, is a massive concentrated psy-op,' Rogan said  —  Joe Rogan argued that the establishment media that once was friendly … ",
    "url": "https://www.foxnews.com/media/rogan-says-greatest-media-psy-op-history-waged-against-trump-theyve-distorted-who-he-is"
  },
  {
    "text": "Trump Vowed to Kill Biden's Climate Law.  Republicans Say Not So Fast.  —  Billions of dollars and tens of thousands of jobs are at stake in red states  —  WASHINGTON—Donald Trump's campaign-trail vow to end President Biden's signature climate law is running into a cold reality: Too many Republican lawmakers want to keep it.",
    "url": "https://www.wsj.com/politics/policy/trump-biden-climate-bill-renewable-energy-b3e5fe03"
  },
  {
    "text": "For Rising Democrats, the Quiet Race to Lead the Party Began Months Ago  —  As Kamala Harris dominated attention on the 2024 trail, ambitious Democrats were also blanketing the country, building relationships that could pay dividends in the fight for the party's future.",
    "url": "https://www.nytimes.com/2024/11/30/us/politics/2028-democrats-whitmer-shapiro-newsom.html"
  },
  {
    "text": "Emboldened ‘manosphere’ accelerates threats and demeaning language toward women after US election  —  In the days after the presidential election, Sadie Perez began carrying pepper spray with her around campus.  Her mom also ordered her and her sister a self-defense kit that included keychain spikes … ",
    "url": "https://apnews.com/article/trump-harris-election-womens-rights-social-media-d5cea53480437ac8bf837aaa821e5681"
  },
  {
    "text": "How Our Messed-Up Dating Culture Leads to Loneliness, Anger and Donald Trump  —  Joe Rogan.  Elon Musk.  Representatives of bro culture are on the ascent, bringing with them an army of disaffected young men.  But where did they come from?  Many argue that a generation of men are resentful … ",
    "url": "https://www.nytimes.com/2024/11/30/opinion/dating-bro-culture-manosphere-trump-cinderella.html?unlocked_article_code=1.d04.pcRs.Jt6MhG9ZzSMz&smid=url-share"
  },
  {
    "text": "Musk could use the ‘Department of Government Efficiency’ for self-enrichment  —  He's said $42.45bn spent by the US for rural internet isn't efficient.  His Starlink company stands to benefit if he reduces that investment  —  Elon Musk, named by Donald Trump to co-lead a commission aimed … ",
    "url": "https://www.theguardian.com/technology/2024/nov/30/elon-musk-government-efficiency-self-enrichment"
  },
  {
    "text": "Democrats Weigh Dumping Nadler, Regrouping to Counter Trump  —  Some House Democrats want to oust aging committee leaders like Representative Jerrold Nadler in favor of younger lawmakers who they see as better suited to take on the president.  —  House Democrats are considering pushing aside … ",
    "url": "https://www.nytimes.com/2024/11/30/us/politics/democrats-nadler-raskin.html"
  },
  {
    "text": "How Kennedy Has Worked Abroad to Weaken Global Public Health Policy  —  The health secretary pick and his organization have worked around the world to undermine longstanding policies on measles, AIDS and more.  —  Robert F. Kennedy Jr., who is in line to lead the Department of Health … ",
    "url": "https://www.nytimes.com/2024/11/30/world/africa/rfk-jr-kennedy-international-work-public-health-policies.html"
  },
  {
    "text": "Is it safe to have a child?  Americans rethink family planning ahead of Trump's return  —  Some in the US are reconsidering children, with fears over reproductive healthcare and the climate crisis front of mind  —  Chris Peterson wasn't surprised that Donald Trump won the 2024 presidential election.",
    "url": "https://www.theguardian.com/us-news/2024/nov/30/family-planning-trump"
  },
  {
    "text": "Trudeau in Florida to meet with Donald Trump in wake of tariff threat  —  U.S. president-elect said earlier this week he would impose hefty tariffs on Canada and Mexico  —  Prime Minister Justin Trudeau is in Palm Beach, Fla. to meet with U.S. president-elect Donald Trump, according to senior government sources.",
    "url": "https://www.cbc.ca/news/politics/trudeau-trump-tariff-1.7397564"
  },
  {
    "text": "What women veterans think of Pete Hegseth's views about combat roles  —  Donald Trump's nominee for defense secretary says women shouldn't serve in combat.  These vets say his attitude is outdated, uninformed and inaccurate.  —  The Army veteran and Fox News Channel host … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/30/pete-hegseth-military-women-combat/"
  },
  {
    "text": "How Kristi Noem, Trump's homeland security pick, became an immigration ‘zealot’  —  By sending the South Dakota National Guard to the border, the governor built her national profile but paid less attention to the details.  —  Gov. Kristi L. Noem was about to seize the spotlight, and she wanted to make the most of it.",
    "url": "https://www.washingtonpost.com/politics/2024/11/29/noem-national-guard-border/"
  }
]