[
  {
    "text": "Boycott The Donald Trump Show  —  Playing captive to the lies he'll tell at his coming address to Congress is weak, conveys weakness, and surrenders the whole national stage to him.  —  ∙ Paid  —  There's one form of mass anger sweeping the country, and it's all directed at Donald Trump … ",
    "url": "https://www.offmessage.net/p/boycott-the-donald-trump-show"
  },
  {
    "text": "Top HHS spokesperson quits after clashing with RFK Jr.  —  Thomas Corry resigned over disagreements with the HHS secretary and his approach to the measles outbreak.  —  The top spokesperson at the Health and Human Services Department has abruptly quit after clashing with Secretary Robert F. Kennedy Jr … ",
    "url": "https://www.politico.com/news/2025/03/03/top-hhs-spokesperson-quits-00207000"
  },
  {
    "text": "What a Weekend for Putin!  —  It was a hell of a weekend for bad men getting what they paid for out of Donald Trump.  And while we'll focus on Vladimir Putin here, we don't want to fully ignore venture capitalist David Sacks, Donald Trump's “crypto czar,” who seemingly stands … ",
    "url": "https://www.thebulwark.com/p/what-a-weekend-for-putin"
  },
  {
    "text": "‘America First’ Is a Lie  —  Donald Trump and Republicans explain their worldview by calling it “America First.”  That's a lie.  —  American foreign policy has always put America first.  That's what nations do.  It's axiomatic.  Why did the United States do Lend-Lease with Britain … ",
    "url": "https://www.thebulwark.com/p/america-first-is-a-lie-a76"
  },
  {
    "text": "U.S.A.I.D. Memos Detail Human Costs of Cuts to Foreign Aid  —  The world is likely to see millions more malaria infections and 200,000 cases of paralytic polio each year, according to an agency whistle-blower.  —  The Trump administration's decision to withdraw foreign aid and dismantle … ",
    "url": "https://www.nytimes.com/2025/03/02/health/usaid-cuts-deaths-infections.html?unlocked_article_code=1.1E4.lGCw.EBGGOENXCAzY&smid=url-share"
  },
  {
    "text": "Wałęsa condemns Trump treatment of Zelensky, likening it to communist interrogation … Former Polish president and Nobel Peace Prize winner Lech Wałęsa has written a letter, co-signed by 38 other former political prisoners of Poland's communist regime, to Donald Trump … ",
    "url": "https://notesfrompoland.com/2025/03/03/walesa-condemns-trump-treatment-of-zelensky-likening-it-to-communist-interrogation/"
  },
  {
    "text": "Struggling With Errors, DOGE Deletes Billions More From List of Savings  —  For the second time in a week, Elon Musk's government overhaul effort updated its “wall of receipts” to remove mistakes that inflated its success.  —  Elon Musk's Department of Government Efficiency has deleted hundreds … ",
    "url": "https://www.nytimes.com/2025/03/03/us/politics/doge-musk-contracts-wall.html"
  },
  {
    "text": "Tesla's plummeting sales risk its lucrative emissions credit earnings  —  CEO Elon Musk has angered European customers and governments, undercutting his EV brand.  —  BRUSSELS — Elon Musk's political meddling in Europe is cratering Tesla's sales — and that's putting at risk its revenue … ",
    "url": "https://www.politico.eu/article/tesla-plummeting-sales-risk-emissions-credit-earning/"
  },
  {
    "text": "Treasury Department Announces Suspension of Enforcement of Corporate Transparency Act Against U.S. Citizens and Domestic Reporting Companies  —  The Treasury Department is announcing today that, with respect to the Corporate Transparency Act, not only will it not enforce any penalties … ",
    "url": "https://home.treasury.gov/news/press-releases/sb0038"
  },
  {
    "text": "Donald Trump Is Backed by the Business Elite  —  Over lunch last week with a friend of mine — a major technology investor who has been an ardent Democrat — the talk quickly turned to politics.  Like many businessmen, he refuses to air his views publicly to avoid drawing fire.  In private, he's more forthcoming.",
    "url": "https://www.nytimes.com/2025/03/03/opinion/trump-wall-street-biden-big-business.html"
  },
  {
    "text": "CFPB to Employees: When We Said Stop Work, We Didn't Mean Stop Work!  —  The illegal plan to dismantle the consumer agency is failing.  So Russ Vought and his charges are engaging in some CYA.  —  Russell Vought speaks during a Senate Budget Committee hearing on his nomination to lead … ",
    "url": "https://prospect.org/economy/2025-03-03-cfpb-we-didnt-mean-stop-work-russell-vought/"
  },
  {
    "text": "Car Prices Are Poised for $12,000 Surge on Trump's New Tariffs  — Auto bosses warn Trump administration of economic consequences  — Companies rush to stockpile parts, engines in US warehouses  —  Impending tariffs on Canada and Mexico risk driving up US car prices by as much as $12,000 … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-03/car-prices-are-poised-for-12-000-surge-on-trump-s-new-tariffs?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0MTAxMDM3NSwiZXhwIjoxNzQxNjE1MTc1LCJhcnRpY2xlSWQiOiJTU0VGV0dUMEFGQjQwMCIsImJjb25uZWN0SWQiOiJDNjVGQzRGMzI5QkU0ODE2QkZFRTI0MEY1NEU5RkQ1NyJ9.iaz4vgPss3-P_g-ff7O8LYkywbP9hrJ-SqP4tHIJlAQ"
  },
  {
    "text": "Trump to hold Ukraine meeting on next steps including possible aid freeze … - The White House didn't immediately respond to questions.  — The New York Times first reported about the meeting. … - “The American people's patience is not unlimited, their wallets are not unlimited … ",
    "url": "https://www.axios.com/2025/03/03/trump-ukraine-meeting-aid-freeze"
  },
  {
    "text": "New deputy FBI director Dan Bongino previously called for imprisoning Democrats  —  For more than 100 years, the role of FBI deputy director has been filled by a career agent with previous bureau experience and an insider's understanding of day-to-day operations of federal law enforcement.",
    "url": "https://www.npr.org/2025/03/03/nx-s1-5308020/dan-bongino-trump-fbi-director-conspiracies-podcast"
  },
  {
    "text": "Trump, Chip Maker TSMC Expected to Announce $100 Billion Investment in U.S.  —  It is the latest effort by Trump to persuade companies to make big investments in the U.S.  —  WASHINGTON—Taiwan Semiconductor Manufacturing Co. intends to invest $100 billion in chip-manufacturing plants … ",
    "url": "https://www.wsj.com/tech/trump-chip-maker-tsmc-expected-to-announce-100-billion-investment-in-u-s-02a44399?st=HfvBaF&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Atlanta Fed's GDPNow Estimate Falls Again  —  The Federal Reserve Bank of Atlanta's running forecast for first-quarter gross domestic product slid again on Monday.  —  The Atlanta Fed's GDPNow estimate now calls for a first-quarter GDP decline of 2.8%, down from a decline of 1.5% on Friday.",
    "url": "https://www.barrons.com/livecoverage/stock-market-today-030325/card/atlanta-fed-s-gdpnow-estimate-falls-again-kv9ZZAC5h68mreyNgjBk"
  },
  {
    "text": "Exclusive: Honda to produce next Civic in Indiana, not Mexico, due to US tariffs, sources say  —  Honda (7267.T) has decided to produce its next-generation Civic hybrid in the U.S. state of Indiana, instead of Mexico, to avoid potential tariffs on one of its top-selling car models, according to three people familiar with the matter.",
    "url": "https://www.reuters.com/business/autos-transportation/honda-produce-next-civic-indiana-not-mexico-due-us-tariffs-sources-say-2025-03-03/"
  },
  {
    "text": "Trump credit card freeze crippling cancer and Alzheimer's research  —  On February 26, President Trump issued an executive order expanding the power of the United States DOGE Service (DOGE), the government initiative controlled by Elon Musk.  The purpose of the order is to limit any spending … ",
    "url": "https://popular.info/p/trump-credit-card-freeze-crippling"
  },
  {
    "text": "Tim Walz says he may run for president in 2028 — despite failure of Harris campaign: ‘Do whatever it takes’  —  Failed 2024 Democratic vice presidential nominee Tim Walz has said he would “certainly consider” running for president in 2028 — despite his crushing defeat alongside then-Vice President Kamala Harris this past November.",
    "url": "https://nypost.com/2025/03/03/us-news/tim-walz-says-he-may-run-for-president-in-2028/"
  },
  {
    "text": "Where Jeff Bezos Went Wrong With The Washington Post … The day the world learned that Jeff Bezos would buy The Washington Post, the Amazon founder offered assurances that he would not cower when faced with threats from a vengeful president and his appointees.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/03/bezos-appease-trump-administration/681899/?gift=49wmX9XxesaxFXKJmFp0Pq8Cg-TWFp9jiXnDCR2akOc&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "DC to drop its Jan. 6 civil suit against Proud Boys, Oath Keepers  —  Attorney General Brian Schwalb's office says his office needs to commit its resources elsewhere. … WASHINGTON — The D.C. Attorney General's Office (OAG) moved to dismiss a years-old civil case Friday against members … ",
    "url": "https://www.wusa9.com/article/news/national/capitol-riots/dc-moves-to-dismiss-jan-6-civil-suit-against-proud-boys-oath-keepers-enrique-tarrio-stewart-rhodes-brian-schwalb-donald-trump/65-c9f7d6b0-e55d-4f4d-a2ab-0f3e87440663"
  },
  {
    "text": "White House seeks plan for possible Russia sanctions relief, sources say  —  The United States is drawing up a plan to potentially give Russia sanctions relief as President Donald Trump seeks to restore ties with Moscow and stop the war in Ukraine, a U.S. official and another person familiar with the matter told Reuters.",
    "url": "https://www.reuters.com/world/white-house-seeks-plan-possible-russia-sanctions-relief-sources-say-2025-03-03/"
  },
  {
    "text": "RFK Jr. and His Allies Target Trump's Beloved Soda  —  Within the Trump administration, the push to strip soda from state food-aid programs is getting personal  —  WASHINGTON—Robert F. Kennedy Jr. calls it “poison.”  President Trump has multiple cans of it every day.  Welcome to the 2025 soda wars.",
    "url": "https://www.wsj.com/health/rfk-jr-and-his-allies-target-trumps-beloved-soda-8f65b234"
  },
  {
    "text": "Trump blames town hall drama on paid ‘troublemakers’  —  President Donald Trump on Monday dismissed a spate of contentious town halls that congressional Republicans have faced in recent weeks as being the work of “paid ‘troublemakers.’” Trump's Truth Social post came after a new round … ",
    "url": "https://www.politico.com/live-updates/2025/03/03/congress/trump-brushes-off-town-hall-drama-00207009"
  },
  {
    "text": "Senate Republican: Putin ‘killing anyone who disagrees with him’  —  Sen. Bill Cassidy (R-La.) criticized Russian President Vladimir Putin's track record of killing his perceived enemies on Monday, coming as President Trump and his Cabinet studiously avoid criticizing the Russian leader as they pursue peace talks.",
    "url": "https://thehill.com/homenews/5172977-senate-republican-putin-killing-anyone-who-disagrees-with-him/"
  }
]