[
  {
    "text": "Don't let MAGA theatrics fool you: Donald Trump's 34 felony convictions are not helping him  —  Many people mistake cynicism for savviness.  So, of course, it took no time at all for some political pundits to rush forward to declare that Donald Trump's historic 34 felony convictions would somehow “help” him.",
    "url": "https://www.salon.com/2024/06/04/dont-let-maga-theatrics-fool-you-donald-34-felony-convictions-are-not-helping-him/"
  },
  {
    "text": "Biden Twists the ‘Convicted Felon’ Knife  —  Joe Biden called Donald Trump a “convicted felon,” and you know what?  The Trump campaign just can't believe a U.S. president would say something so low-down and mean.  —  That word is “shameful,” campaign spokeswoman Karoline Leavitt … ",
    "url": "https://www.thebulwark.com/p/biden-twists-the-convicted-felon"
  },
  {
    "text": "Read the Full Transcript of President Joe Biden's Interview With TIME  —  President Joe Biden sat down for an interview with TIME at the White House on May 28.  —  Over the course of the interview, Biden spoke at length about his foreign policy agenda, including his views on China, Taiwan … ",
    "url": "https://time.com/6984968/joe-biden-transcript-2024-interview/"
  },
  {
    "text": "Biden: ‘Every reason’ to think Netanyahu wants war with Hamas to go on  —  Biden also said that Israel made the “mistake” of conducting a Gaza campaign in similar ways to the U.S. invasions of Afghanistan and Iraq.  —  There is “every reason” for people in Israel to conclude their prime minister … ",
    "url": "https://www.politico.com/news/2024/06/04/biden-netanyahu-hamas-war-00161414"
  },
  {
    "text": "Chief Financial Officer Of Multinational Media Company Charged With Participating In Scheme To Launder At Least $67 Million In Fraud Proceeds  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Damian Williams, the United States Attorney for the Southern District … ",
    "url": "https://www.justice.gov/usao-sdny/pr/chief-financial-officer-multinational-media-company-charged-participating-scheme"
  },
  {
    "text": "DOJ Says Epoch Times Newspaper Is an Epic Money-Laundering Operation  —  One of the strangest stories in media over the past decade is the Epoch Times, a formerly free newspaper distributed on the streets of New York that focuses on conspiracist, right-wing takes and reports that are extremely critical of the Chinese Communist Party.",
    "url": "https://nymag.com/intelligencer/article/doj-says-epoch-times-is-an-epic-money-laundering-operation.html"
  },
  {
    "text": "Feds raid corporate landlord, escalating nationwide criminal probe of rent increases  —  Over the last four years, rents have skyrocketed by an average of over 30% nationwide and are a major factor in the overall inflation rate.  There are a variety of factors behind the increases, including an overall housing shortage.",
    "url": "https://popular.info/p/feds-raid-corporate-landlord-escalating"
  },
  {
    "text": "How politics, timing shaped Biden's border gambit … - He's also using the power of the presidency to stare down his critics in Congress, confident that voters want to see action — not just rhetoric — on the border.  — Biden's willing to risk a defeat in the courts and anger … ",
    "url": "https://www.axios.com/2024/06/04/biden-border-gambit-trump-2024-election"
  },
  {
    "text": "Lawmakers expensed millions in 2023 under new program that doesn't require receipts  —  Critics say the program's lack of transparency and record-keeping opens it up to abuse.  Matt Gaetz was the program's top spender.  —  More than 300 House lawmakers were reimbursed at least $5.2 million … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/04/house-representatives-expenses-receipts-lodging/"
  },
  {
    "text": "‘I will not be intimidated’: Garland to rebut contempt threats from House GOP  —  House Republicans are expected to grill the attorney general about the federal prosecutions of Donald Trump and Hunter Biden.  —  Attorney General Merrick Garland will use an appearance on Capitol Hill on Tuesday … ",
    "url": "https://www.washingtonpost.com/national-security/2024/06/04/merrick-garland-testimony-judiciary-fbi-trump/"
  },
  {
    "text": "How a Drop in Small-Dollar Donations Is Shaking Up Both Parties … For years, Anna Cypert responded to the daily texts, calls and letters that she received from Democrats asking for money, often marked URGENT or SOS.  The former nurse sent what she could: $5 to the Democratic Congressional Campaign Committee … ",
    "url": "https://www.notus.org/2024-election/small-dollar-donations"
  },
  {
    "text": "New Washington Post editor Matt Murray meets staff after abrupt Buzbee exit  —  Executive editor Sally Buzbee urged a delay of William Lewis's plan to restructure the newsroom.  Her abrupt replacement by a veteran Wall Street Journal editor triggered questions from staff.",
    "url": "https://www.washingtonpost.com/style/media/2024/06/03/matt-murray-sally-buzbee-washington-post/"
  },
  {
    "text": "Congress braces for “large” boycott, disruptions of Netanyahu speech … - Netanyahu's 2015 speech to Congress, which was a major snub of the Obama administration, was skipped by 58 Democratic lawmakers.  — Many Democrats this year argued against inviting Netanyahu in the first place … ",
    "url": "https://www.axios.com/2024/06/04/democrats-boycott-benjamin-netanyahu-speech-congress"
  },
  {
    "text": "Fraud trial juror reports getting bag of $120,000 and promise of more if she'll acquit  —  A juror was dismissed Monday after reporting that a woman dropped a bag of $120,000 in cash at her home and offered her more money if she would vote to acquit seven people charged with stealing … ",
    "url": "https://apnews.com/article/minnesota-feeding-our-future-pandemic-fraud-73610b59bb60bf33f2aa06063bb592d2"
  },
  {
    "text": "Big Media Ignoring the Who What When Why of GOP Apology for Trump's Crimes  —  Even before and especially in the wake of Trump's guilty verdict, members of the MAGAt Party has stumbled over themselves to declare fealty to Donald Trump, and in the process to demean rule of law.  —  Video",
    "url": "https://www.emptywheel.net/2024/06/03/big-media-ignoring-the-who-what-when-why-of-gop-apology-for-trumps-crimes/"
  },
  {
    "text": "The $64 million mystery: How a wave of anonymous donations is fueling the 2024 presidential campaign  —  Washington hates a secret.  —  Yet in the summer of 2020, when a blandly named entity called the Impetus Fund received a $64 million donation from a single anonymous source … ",
    "url": "https://www.cbsnews.com/news/the-64-million-mystery-anonymous-donations-2024-presidential-campaign/"
  },
  {
    "text": "Trump's appeal hearing on Fani Willis set for October, likely pushing trial past election  —  Trump is appealing the ruling that led DA Fani Willis stay on his election case.  —  Former President Donald Trump attends UFC 302 at Prudential Center on June 1, 2024, in Newark, N.J.",
    "url": "https://abcnews.go.com/Politics/georgia-court-tentatively-sets-donald-trumps-appeal-hearing/story?id=110788890"
  },
  {
    "text": "Harvard Faculty of Arts and Sciences Will No Longer Require Diversity Statements  —  Harvard's Faculty of Arts and Sciences will stop requiring a diversity, inclusion, and belonging statement as part of its faculty hiring process, Dean of Faculty Affairs and Planning Nina Zipser announced in a Monday morning email.",
    "url": "https://www.thecrimson.com/article/2024/6/4/dei-faculty-hiring-stopped/"
  },
  {
    "text": "Menendez files independent bid for Senate seat  —  Sen. Bob Menendez (D-N.J.) filed to run for another term in the Senate as an independent on Monday, as his federal bribery trial continues.  Menendez had announced in March that he would not seek the Democratic nomination for his Senate seat … ",
    "url": "https://thehill.com/homenews/campaign/4701281-bob-menendez-senate-files-independent-bid/"
  }
]