[
  {
    "text": "Fulton County special grand jury recommended charges against Lindsey Graham, David Perdue and Kelly Loeffler  —  The special grand jury in Fulton County investigating the 2020 presidential election in Georgia recommended charges against Republican Sen. Lindsey Graham of South Carolina … ",
    "url": "https://www.cnn.com/2023/09/08/politics/fulton-county-special-grand-jury-report/"
  },
  {
    "text": "Graham defends 2020 election actions after Fulton grand jury recommended prosecution  —  Sen. Lindsey Graham (R-S.C.) defended his actions surrounding the 2020 election after a grand jury report in Fulton County, Ga., released Friday showed jurors recommended that he be prosecuted.",
    "url": "https://thehill.com/homenews/senate/4194321-graham-defends-2020-election-actions-after-fulton-grand-jury-recommended-prosecution/"
  },
  {
    "text": "Trump overstated net worth by up to $3.6 billion each year, NY attorney general alleges in new filing  — Former President Donald Trump's net worth was inflated by billions of dollars each year more than the New York attorney general's office originally estimated, the office alleged in a new court filing.",
    "url": "https://www.cnbc.com/2023/09/08/trump-overstated-net-worth-by-up-to-3point6-billion-per-year-ny-ag-alleges-in-new-filing.html"
  },
  {
    "text": "IRS cracking down on 1,600 millionaires over back taxes  —  The IRS is launching an initiative to crack down on 1,600 millionaires and 75 large businesses it says owe hundreds of millions of dollars in back taxes, the agency announced Friday.  —  The program takes advantage of additional funding … ",
    "url": "https://thehill.com/business/4193872-irs-cracking-down-on-1600-millionaires-over-back-taxes/"
  },
  {
    "text": "Kristi Noem is suddenly front and center in the veepstakes  —  The South Dakota governor will appear with Donald Trump at an event in Rapid City on Friday.  —  Not long ago, it looked like Kristi Noem's star was flaming out.  Following a turbulent first term, the South Dakota governor elected … ",
    "url": "https://www.politico.com/news/2023/09/08/kristi-noem-veepstakes-00114586"
  },
  {
    "text": "Republicans are trying to find a new term for ‘pro-life’ to stave off more electoral losses  —  Sen. Todd Young, R-Ind., summarized the closed-door meeting on Capitol Hill as being focused on “pro-baby policies.”  —  WASHINGTON — Republican strategists are exploring a shift away from … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-try-find-new-term-life-stave-electoral-losses-rcna103924"
  },
  {
    "text": "Alito rejects call to recuse in tax case  —  The conservative justice granted a series of interviews to a lawyer working with The Wall Street Journal.  —  Justice Samuel Alito is emphatically rejecting calls for him to recuse himself from a closely watched tax case because he sat for interviews … ",
    "url": "https://www.politico.com/news/2023/09/08/alito-rejects-call-to-recuse-in-tax-case-00114735"
  },
  {
    "text": "Elon Musk Acknowledges Withholding Satellite Service to Thwart Ukrainian Attack  —  The Starlink satellite internet service, which is operated by Mr. Musk's rocket company SpaceX, has been a digital lifeline for soldiers and civilians in Ukraine.  —  A top adviser to Ukraine's president accused Elon Musk … ",
    "url": "https://www.nytimes.com/2023/09/08/world/europe/elon-musk-starlink-ukraine.html"
  },
  {
    "text": "Trump allies urge a wake-up call for his lagging Iowa campaign operation  —  As the stretch run to the Iowa caucuses begins, Trump's polling lead belies a small campaign organization getting outstripped by rivals.  —  A number of Donald Trump's allies are growing concerned that his lead … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-allies-urge-wake-call-lagging-iowa-campaign-operation-rcna103556"
  },
  {
    "text": "Pelosi will seek reelection  —  The move would extend her 36-year House career and continue to freeze her would-be California successors in a long-standing holding pattern.  —  Nancy Pelosi isn't done yet.  —  The San Francisco Democrat and first female speaker of the House told volunteers … ",
    "url": "https://www.politico.com/news/2023/09/08/pelosi-will-seek-reelection-00114722"
  },
  {
    "text": "Another Christian influencer arrested for child abuse: Why conservatives keep falling for these cons  —  Ruby Franke was yet another Duggar knock-off, putting a shiny happy gloss on religious oppression  —  In many ways, it's the least surprising story of our times: A showily Christian … ",
    "url": "https://www.salon.com/2023/09/08/another-christian-influencer-arrested-for-child-abuse-why-conservatives-keep-falling-for-these-cons/"
  },
  {
    "text": "Newsom on a potential 2024 run: Not going to happen  —  “We need to move past this notion that [Joe Biden is] not going to run,” Newsom said.  —  California Gov. Gavin Newsom has a message to voters who think President Joe Biden won't run again.  —  “We need to move past this notion … ",
    "url": "https://www.politico.com/news/2023/09/08/newsom-biden-harris-2024-00114684"
  },
  {
    "text": "BLASTPASS: NSO Group iPhone Zero-Click, Zero-Day Exploit Captured in the Wild  —  Apple has just issued an update for Apple products including iPhones, iPads, Mac computers, and Apple Watches.  We encourage all users to immediately update their devices.  —  We urge all at-risk users … ",
    "url": "https://citizenlab.ca/2023/09/blastpass-nso-group-iphone-zero-click-zero-day-exploit-captured-in-the-wild/"
  },
  {
    "text": "FAA orders Musk's SpaceX to take 63 corrective actions on Starship, keeps rocket grounded  — The Federal Aviation Administration said Elon Musk's SpaceX must keep its Starship Super Heavy rocket grounded.  — The federal agency had been probing the April launch, which saw SpaceX's Starship explode in mid-flight.",
    "url": "https://www.cnbc.com/2023/09/08/faa-starship-grounded-corrective-action.html"
  },
  {
    "text": "Border Crisis Comes to Blue Cities After Migrants Are Bused North  —  The strain of migrants in New York, Chicago, Los Angeles and other cities has taxed resources, divided Democrats and put pressure on President Biden to act.  —  When Gov. Greg Abbott of Texas began sending migrants … ",
    "url": "https://www.nytimes.com/2023/09/08/us/politics/gop-migrants-blue-cities.html"
  },
  {
    "text": "Protest Stops U.S. Open Semifinal Match  —  The delay of 49 minutes during the match between Coco Gauff and Karolina Muchova was caused by environmental protesters, including one who glued his feet to the ground.  —  The U.S. Open semifinal match on Thursday night between Coco Gauff … ",
    "url": "https://www.nytimes.com/2023/09/07/sports/tennis/protest-stops-us-open-semifinal-match.html"
  },
  {
    "text": "Pence says he supports an impeachment inquiry by House Republicans  —  House Republicans are floating the possibility of an impeachment inquiry of President Biden  —  Former Vice President Pence said there is an “ethical cloud” hanging over the Biden family and President Biden's administration … ",
    "url": "https://www.foxnews.com/politics/pence-says-ethical-cloud-hangs-over-biden-family-would-support-an-impeachment-inquiry-by-house-gop"
  },
  {
    "text": "Trump Hates Hillary Clinton.  He Might Hate This Judge More.  —  Donald Trump's revenge lawsuit against Hillary Clinton has turned into a retaliatory plot against a judge he has history with.  And now he's testing his ability to target judges.  —  Donald Trump is still so bitter … ",
    "url": "https://www.thedailybeast.com/trump-hates-hillary-clinton-he-might-hate-this-judge-more"
  }
]