[
  {
    "text": "Senate GOP approves framework for Trump's tax breaks and spending cuts after late-night session  —  Senate Republicans plugged away overnight and into early Saturday morning to approve their multitrillion-dollar tax breaks and spending cuts framework, hurtling past hardened Democratic opposition toward … ",
    "url": "https://apnews.com/article/senate-budget-tax-cuts-trump-485845a9c0b7dfc5d2194d4c1e4723ae"
  },
  {
    "text": "House Republican moves to rein in tariff powers  —  Nebraska Rep. Don Bacon said he plans to introduce a companion bill to the bipartisan Senate legislation aimed at reclaiming Congress' authority over tariffs, becoming the first House Republican to openly challenge the powers President Donald Trump … ",
    "url": "https://www.politico.com/live-updates/2025/04/04/congress/don-bacon-tariff-powers-bill-00273307"
  },
  {
    "text": "Senate Approves G.O.P. Budget Plan After Overnight Vote-a-Thon  —  Republicans pushed through their blueprint for tax and spending cuts after Democrats forced them to cast politically painful votes into the early morning on every element of President Trump's agenda.",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/senate-budget.html"
  },
  {
    "text": "Tariffs bring overnight economic chaos  —  In one 48-minute speech, President Trump scrambled every American's budget, every U.S. company's balance sheet and every global alliance.  — Tariffs, a sometimes obscure economic tool, have massive power, especially when enacted this expansively.",
    "url": "https://www.axios.com/2025/04/05/trump-tariffs-companies-inflation"
  },
  {
    "text": "Obama calls on citizens, colleges and law firms to resist Trump agenda  —  In a campus speech, the former president said universities should be prepared to lose federal funds to defend academic freedom, rather than be “intimidated.”  —  Just now  —  Former president Barack Obama called … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/05/obama-trump-universities-intimidation/"
  },
  {
    "text": "Obama Calls for Universities to Stand Up for Core Values  —  As the Trump administration threatens universities, the former president suggested schools shouldn't be intimidated.  But he also offered a critique of campus culture, saying it had too often shut out opposing voices.",
    "url": "https://www.nytimes.com/2025/04/04/us/politics/obama-trump-college-speech.html"
  },
  {
    "text": "Big Law Firms Struck a Truce With Trump—and Set Off a Clash With Recruits  —  Law students at top schools reconsider offers at Skadden and other firms while associates cancel interviews in protest  —  Campus recruiting is the newest front in the Trump-induced turmoil at some of the country's most prominent law firms.",
    "url": "https://www.wsj.com/lifestyle/careers/big-law-firms-struck-a-truce-with-trumpand-set-off-a-clash-with-recruits-bef68b62?st=qjTNhD&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Hundreds of law firms, former judges sign onto briefs in support of Perkins Coie  —  Hundreds of law firms and former judges have signed onto friend-of-the-court briefs in support of Perkins Coie as the law firm challenges President Trump's executive order targeting it.",
    "url": "https://thehill.com/regulation/court-battles/5233200-law-firms-judges-trump-executive-order-perkins-coie/amp/"
  },
  {
    "text": "Trump Admin Dismisses Judge's Order to Bring Back Man Accidentally Sent to El Salvador  —  “We suggest the judge contact President Bukele,” said White House Press Secretary Karoline Leavitt … “We suggest the judge contact President Bukele because we are unaware of the judge having jurisdiction … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-admin-order-man-accidentally-deported-el-salvador-1235311289/"
  },
  {
    "text": "138. Abrego Garcia, Constructive Custody, and Federal Judicial Power  —  Federal courts don't have jurisdiction over foreign prisons.  That doesn't mean that they're powerless when the U.S. government wrongly removes someone from the United States.  —  Welcome back to “One First,” an … ",
    "url": "https://www.stevevladeck.com/p/138-abrego-garcia-constructive-custody"
  },
  {
    "text": "DHS officials ask IRS to use tax data to locate up to 7 million immigrants  —  The agencies have still not reached an agreement on sharing information.  But immigration officials now say they're seeking records on millions of people suspected of being in the United States without authorization.",
    "url": "https://www.washingtonpost.com/business/2025/04/05/irs-tax-data-immigration-enforcement/"
  },
  {
    "text": "I was a British tourist trying to leave America.  Then I was detained, shackled and sent to an immigration detention centre  —  Graphic artist Rebecca Burke was on the trip of a lifetime.  But as she tried to leave the US she was stopped, interrogated and branded an illegal alien by ICE.",
    "url": "https://www.theguardian.com/us-news/2025/apr/05/i-was-a-british-tourist-trying-to-leave-america-then-i-was-detained-shackled-and-sent-to-an-immigration-detention-centre"
  },
  {
    "text": "A stunning number of electric vehicle, battery factories are being canceled  —  Billions of dollars in clean energy projects have been canceled since Donald Trump took office again.  —  Just now  —  Over the past few years, electric vehicle manufacturing facilities producing lithium batteries … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/04/03/ev-factories-canceled/"
  },
  {
    "text": "These Are the 381 Books Removed From the Naval Academy Library  —  The office of Defense Secretary Pete Hegseth ordered the college to adhere to an executive order from President Trump banning educational material related to diversity, equity and inclusion topics.",
    "url": "https://www.nytimes.com/2025/04/04/us/politics/naval-academy-dei-books-removed.html?unlocked_article_code=1.9U4.JFJ4.WperrD1CmCW6&smid=url-share"
  },
  {
    "text": "US embassy's response to Russia's Kryvyi Rih attack ‘unpleasantly surprising,’ Zelensky says.  —  The U.S. Embassy to Ukraine's response to Russia's attack on the Ukrainian city of Kryvyi Rih on April 4, which killed 19 people and injured 68, was “unpleasantly surprising,” President Volodymyr Zelensky said on April 5.",
    "url": "https://kyivindependent.com/us-embassys-response-to-russias-kryvyi-rih-attack-unpleasantly-surprising-zelensky-says/"
  },
  {
    "text": "Video Shows Aid Workers Killed in Gaza Under Gunfire Barrage, With Ambulance Lights On  —  The U.N. has said Israel killed the workers.  The video appears to contradict Israel's version of events, which said the vehicles were “advancing suspiciously” without headlights or emergency signals.",
    "url": "https://www.nytimes.com/2025/04/04/world/middleeast/gaza-israel-aid-workers-deaths-video.html?unlocked_article_code=1.9U4.ueq4.aNDLWwV-_2T3&smid=url-share"
  },
  {
    "text": "President Trump's Tariff Formula Makes No Economic Sense.  It's Also Based on an Error.  —  President Trump on Wednesday announced tariffs on practically every foreign country (and some non-countries), ranging from a 10 percent minimum all the way up to 50 percent.",
    "url": "https://www.aei.org/economics/president-trumps-tariff-formula-makes-no-economic-sense-its-also-based-on-an-error/"
  },
  {
    "text": "RFK Jr. said HHS would rehire thousands of fired workers.  That wasn't true.  —  The health department has no plan to mass reinstate employees it cut earlier this week.  —  When HHS Secretary Robert F. Kennedy Jr. said Thursday that he planned to rehire 20 percent of the employees he'd just terminated … ",
    "url": "https://www.politico.com/news/2025/04/04/rfk-jr-said-hhs-would-rehire-thousands-of-fired-workers-that-wasnt-true-00274034"
  },
  {
    "text": "You're Not Crazy.  America Has Gone Mad  —  American politics has become so insane that being reasonable feels like a malady, and MAGA agrees. … This is an oft-quoted passage from Hannah Arendt's The Origins of Totalitarianism.  And it's one that has proven especially popular … ",
    "url": "https://www.liberalcurrents.com/youre-not-crazy-america-has-gone-mad/"
  },
  {
    "text": "Prosecutors seek 7 years in prison for disgraced former Rep. George Santos in federal fraud case  —  The 87-month sentence proposed by prosecutors is on the high end of court guidelines for such cases.  A sentencing hearing is scheduled for April 25.  —  / Source: The Associated Press",
    "url": "https://www.nbcnews.com/politics/congress/george-santos-prosecutors-seek-7-years-prison-fraud-case-rcna199808"
  },
  {
    "text": "‘Hands Off!’ protests against Trump and Musk are planned across the US  —  Opponents of President Donald Trump and billionaire Elon Musk plan to rally across the U.S. on Saturday to protest the administration's actions on government downsizing, the economy, human rights and other issues.",
    "url": "https://apnews.com/article/trump-musk-doge-protests-hands-off-472c574303260cbac315367cc808960d"
  }
]