[
  {
    "text": "Trump is injured but ‘fine’ after apparent assassination attempt leaves rally-goer and gunman dead  —  Donald Trump was whisked off the stage at a rally in Butler, Pennsylvania after apparent gunshots rang through the crowd.  He quickly ducked behind the podium as agents from his protective detail rushed … ",
    "url": "https://apnews.com/article/trump-rally-assassination-attempt-db24c5bfbbe7d09fa2437c3c836bb434"
  },
  {
    "text": "MAGA Narratives about the Trump Assassination Attempt  —  Welcome back to Lucid, and hello to all new subscribers.  I am “on vacation” in Italy, but the dramatic news from the U.S. has drawn me back to the computer.  —  I am not going to comment on the facts of the attempted assassination … ",
    "url": "https://lucid.substack.com/p/maga-narratives-about-the-trump-assassination"
  },
  {
    "text": "Local officer retreated from shooter at Trump rally before shots were fired  —  A local law enforcement officer reportedly encountered the shooter who attempted to assassinate former President Donald Trump before he started shooting.  —  Officials who spoke to the Associated Press on condition … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3082010/local-officer-retreated-from-shooter-at-trump-rally-before-shots-were-fired/"
  },
  {
    "text": "An Expert on Political Violence Sees a Way Out of America's Crisis  —  Despite the bitter atmosphere, there are real ways to ease political tensions  —  The attempted assassination of former President Donald Trump shocked the nation — but not everyone was totally surprised.",
    "url": "https://www.politico.com/news/magazine/2024/07/14/how-to-curb-political-violence-qa-00168105"
  },
  {
    "text": "America is staring into the abyss  —  After the attempted assassination of Donald Trump, an already existential election is now even more fraught  —  It is not just Donald Trump who dodged a bullet.  Half an inch to the left and the cartridge that grazed Trump's ear would have turned him into a martyr.",
    "url": "https://www.ft.com/content/1d3c12b2-99ed-4935-bcb0-0fd700081c83"
  },
  {
    "text": "FBI identifies Trump rally shooter as 20-year-old Thomas Matthew Crooks  —  Authorities have identified the gunman involved in the attack against former US President Donald Trump on Saturday as 20-year-old Thomas Matthew Crooks, who was killed by Secret Service agents at the scene after the shooting.",
    "url": "https://www.cnn.com/2024/07/14/us/trump-shooting-thomas-matthew-crooks-intl-hnk/"
  },
  {
    "text": "The FBI Identifies Suspected Gunman in Trump Rally Shooting: What to Know  —  Authorities identified the gunman as a 20-year-old man from Bethel Park, a town about an hour's drive from the site of the shooting.  —  The 20-year-old gunman who attempted to assassinate former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/07/14/us/politics/trump-gunman-thomas-crooks.html"
  },
  {
    "text": "Suspected Shooter Had Explosive Devices in His Car, Sources Say  —  Authorities found explosive devices in the car of the man who officials say tried to assassinate former President Donald Trump, according to people briefed on the investigation.  —  The car, which was driven by Thomas Matthew Crooks … ",
    "url": "https://www.wsj.com/livecoverage/trump-rally-incident/card/suspected-shooter-had-explosive-devices-in-his-car-sources-say-nqpDI2AqQQNtSvYtEpS9"
  },
  {
    "text": "Democrat push to replace Biden is ‘over’ after Trump assassination attempt, president's allies say: report  —  Biden's critics have lost ‘all momentum’ due to the attack  —  The effort to replace President Biden as the Democratic Party's 2024 nominee has lost all momentum and is essentially … ",
    "url": "https://www.foxnews.com/politics/democrat-push-replace-biden-trump-assassination-attempt-presidents-allies-say-report"
  },
  {
    "text": "The Gunman and the Would-Be Dictator  —  Violence stalks the president who has rejoiced in violence to others.  —  When a madman hammered nearly to death the husband of then-House Speaker Nancy Pelosi, Donald Trump jeered and mocked.  One of Trump's sons and other close Trump supporters … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/07/donald-trump-democracy-dictator/679006/"
  },
  {
    "text": "Former fire chief shot, killed at Trump rally  —  PITTSBURGH — The former fire chief for Buffalo Township, Corey Comperatore, was the person killed in the crowd at the Trump rally in Butler County, Channel 11 has learned.  —  Trump injured in assassination attempt at rally in Butler; 1 attendee, suspected shooter killed",
    "url": "https://www.wpxi.com/news/local/former-fire-chief-shot-killed-trump-rally/HJXCL4CSN5AZJIPZCT6GWFQ4JE/"
  },
  {
    "text": "Top Democratic strategist pushed reporters to consider ‘staged’ shooting  —  The Scoop  —  The top political adviser to Democratic mega-donor Reid Hoffman suggested that the attack on Donald Trump could have been “staged,” even as Hoffman was criticized for joking before Saturday's attack about Trump becoming a “martyr.”",
    "url": "https://www.semafor.com/article/07/14/2024/top-democrat-pushed-reporters-to-consider-staged-shooting"
  },
  {
    "text": "Secret Service under scrutiny over gunman's access to a clear Trump view  —  Lawmakers call on agency director to testify before Congress while some current and former agents express shock at the apparent security lapse.",
    "url": "https://www.washingtonpost.com/nation/2024/07/14/secret-service-trump-rally-shooting/"
  },
  {
    "text": "The true, tactical significance of Project 2025 (permalink)  —  Like you, I have heard a lot about Project 2025, the Heritage Foundation's roadmap for the actions that Trump should take if he wins the presidency.  Given the Heritage Foundation's centrality to the American authoritarian project … ",
    "url": "https://pluralistic.net/2024/07/14/fracture-lines/#disassembly-manual"
  },
  {
    "text": "Photo Appears to Capture Path of Bullet Used in Assassination Attempt  —  Michael Harrigan, a retired F.B.I. special agent, said the image captured by Doug Mills, a New York Times photographer, seems to show a bullet streaking past former President Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/07/14/us/politics/photo-path-trump-assassination.html"
  },
  {
    "text": "Gov. Tony Evers seeks to bar firearms near RNC but the move is unlikely to succeed  —  Jessie Opoien Alison DirrMilwaukee Journal Sentinel  —  Wisconsin Gov. Tony Evers has requested that the decision to allow firearms within the soft perimeter of the Republican National Convention in Milwaukee … ",
    "url": "https://www.jsonline.com/story/news/politics/2024/07/14/tony-evers-seeks-to-bar-firearms-near-rnc-following-trump-shooting/74402463007/"
  }
]