[
  {
    "text": "Top Senate Republican Protests Trump Bid to Withhold Spending  —  Senator Susan Collins of Maine, the chairwoman of the Appropriations Committee, joined top Democrats in insisting that the president does not have the power to “pick and choose” what to fund.  —  A top Senate Republican … ",
    "url": "https://www.nytimes.com/2025/03/27/us/politics/susan-collins-appropriations-trump.html"
  },
  {
    "text": "Trump Asks Stefanik to Withdraw Bid to Be U.N. Ambassador  —  The president said he wanted the New York Republican to stay in Congress to bolster the party's slim House margin and protect her seat.  —  President Trump on Thursday said he had asked Representative Elise Stefanik … ",
    "url": "https://www.nytimes.com/2025/03/27/us/politics/stefanik-trump-cabinet.html?unlocked_article_code=1.7E4.zbKC.iu_Il1C211HF&smid=url-share"
  },
  {
    "text": "Restoring Truth and Sanity to American History  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  Over the past decade, Americans have witnessed a concerted … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/restoring-truth-and-sanity-to-american-history/"
  },
  {
    "text": "Trump executive order on Smithsonian targets funding to programs with ‘improper ideology’  —  President Donald Trump revealed his intentions to reshape the Smithsonian Institution with an executive order Thursday that targets funding to programs with “divisive narratives” and “improper ideology.”",
    "url": "https://apnews.com/article/trump-smithsonian-executive-order-improper-ideology-558ebfab722f603e94e02a1a4b06ed4d"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Restores Truth and Sanity to American History  —  RESTORING TRUTH IN AMERICAN HISTORY: Today, President Donald J. Trump signed an Executive Order restoring truth and sanity to American history by revitalizing key cultural institutions and reversing the spread of divisive ideology.",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/03/fact-sheet-president-donald-j-trump-restores-truth-and-sanity-to-american-history/"
  },
  {
    "text": "Bondi Indicates Signal Chat Episode Will Not Be Criminally Investigated  —  The attorney general said the focus should be on the success of the U.S. military strike in Yemen, not that military information was shared in advance in a group text among top officials.",
    "url": "https://www.nytimes.com/2025/03/27/us/politics/signal-leak-prosecution-bondi.html"
  },
  {
    "text": "Internal White House document details layoff plans across U.S. agencies  —  While officials stressed the estimates were subject to change, the snapshot suggests how agencies are working to meet Trump's mandate to shrink government.  —  Just now  —  Federal officials are preparing for agencies … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/27/federal-worker-layoffs-government-agencies/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzMDQ4MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0NDMwMzk5LCJpYXQiOjE3NDMwNDgwMDAsImp0aSI6ImIyZTNhZjA0LWU0OTEtNGNhMS04ZjUyLTViYjE2MzQ3Y2M1NSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI3L2ZlZGVyYWwtd29ya2VyLWxheW9mZnMtZ292ZXJubWVudC1hZ2VuY2llcy8ifQ.ZhLUWAC6kS9DZEhxOy5BeViRYcRkYvIsFgeNBNFIlsY&itid=gfta"
  },
  {
    "text": "RFK Jr. Plans 10,000 Job Cuts in Major Restructuring of Health Department  —  Changes would reshape the nation's health agencies and close regional offices  —  WASHINGTON—Health and Human Services Secretary Robert F. Kennedy Jr. is set to significantly cut the size of the department he leads … ",
    "url": "https://www.wsj.com/politics/policy/rfk-jr-plans-10-000-job-cuts-in-major-restructuring-of-health-department-bdec28b0?st=pg8HKY"
  },
  {
    "text": "Skadden, a Top Law Firm, Is in Talks to Avert an Executive Order  —  The discussions come as other major firms are said to be trying to cut deals with the White House.  —  The elite law firm Skadden, Arps, Slate, Meagher & Flom has had discussions with President Trump's advisers about a deal … ",
    "url": "https://www.nytimes.com/2025/03/27/business/trump-law-firms-skadden-arps.html?unlocked_article_code=1.7E4.3mWR.RWGkLydk7UHE"
  },
  {
    "text": "Tufts graduate student already transferred out of state before judge issued order to stay in Mass., prosecutor says  —  The Immigration and Customs Enforcement had already transferred Tufts graduate student Rumeysa Ozturk out of the state before a federal judge ordered her kept in Massachusetts … ",
    "url": "https://www.bostonglobe.com/2025/03/27/metro/rumeysa-ozturk-judge-sets-ice-deadline/"
  },
  {
    "text": "Addressing Risks From WilmerHale  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Background.  My Administration is committed to addressing the significant risks associated with law firms … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-wilmerhale/"
  },
  {
    "text": "Israel Supplied Intelligence in Airstrike Discussed in Signal Chat, Officials say  —  Houthi missile expert was tracked with help of Israeli human source in Yemen  —  WASHINGTON—Israel provided sensitive intelligence from a human source in Yemen on a key Houthi military operative targeted … ",
    "url": "https://www.wsj.com/politics/national-security/israel-supplied-intelligence-in-airstrike-discussed-in-signal-chat-officials-say-9a9e0abf?st=ToysDc&reflink=mobilewebshare_permalink"
  },
  {
    "text": "A DHS staffer faces serious punishment for accidentally adding a reporter to a group email  —  The episode, which has not been previously reported, raises questions about unequal punishment for inadvertent leakers in the Trump administration.  —  A federal worker accidentally includes … ",
    "url": "https://www.nbcnews.com/politics/national-security/dhs-staffer-faces-serious-punishment-accidentally-adding-reporter-grou-rcna198233"
  },
  {
    "text": "Cassidy says RFK Jr. briefed him on HHS job cuts, but reported study on vaccines, autism didn't come up  —  Senator had previously secured health secretary's commitments on support for vaccines  —  WASHINGTON — Sen. Bill Cassidy, the chairman of the Senate health committee … ",
    "url": "https://www.statnews.com/2025/03/27/rfk-jr-meets-with-louisiana-senator-bill-cassidy-no-word-on-controversial-vaccine-autism-study/"
  },
  {
    "text": "Signal Chat Leak Angers U.S. Military Pilots  —  Men and women who have taken to the air on behalf of the United States expressed bewilderment after the leak of attack plans.  “You're going to kill somebody,” one pilot said.  —  The intelligence breach was bad enough, current and former fighter pilots said.",
    "url": "https://www.nytimes.com/2025/03/27/us/politics/pilots-signal-leak.html?unlocked_article_code=1.7E4.ZPcI.ZHMyML38GPF9&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "This Is the Land of Wolves Now  —  1. POWs  —  Two weeks ago Donald Trump invoked the Alien Enemies Act, a law that grants the president extraordinary powers during times of war.  Here's his proclamation: … Some of the individuals who have been apprehended under the Alien Enemies Act … ",
    "url": "https://www.thebulwark.com/p/this-is-the-land-of-wolves-now"
  },
  {
    "text": "UA student reportedly detained by ICE  —  Senior send-off: Sarah Ashlee Barker's storied college career coming to an end  —  Alabama head coach Rob Vaughn ejected in 9-2 loss over Tennessee  —  City Council approves business alcohol license despite concerns",
    "url": "https://thecrimsonwhite.com/120415/news/ua-student-reportedly-detained-by-ice/"
  },
  {
    "text": "Trump Accidentally Reveals Just How Clueless He Is on Basic Intel  —  The American public knew before Donald Trump that top administration officials had conducted airstrikes on Yemen via a Signal chat, and now it appears that the president has been left in the dark on other intelligence matters too.",
    "url": "https://newrepublic.com/post/193235/donald-trump-intelligence-group-chat-lithuania"
  },
  {
    "text": "Trump says US will ‘go as far as we have to’ to get control of Greenland  —  The president suggested that “the world needs us to have Greenland.”  —  President Donald Trump speaks to the press before signing an executive order in the Oval Office of the White House, Mar. 26, 2025 in Washington.",
    "url": "https://abcnews.go.com/International/trump-us-control-greenland/story?id=120208823"
  },
  {
    "text": "Even More Venmo Accounts Tied to Trump Officials in Signal Group Chat Left Data Public  —  WIRED has found four new Venmo accounts that appear to be associated with Trump officials who were in an infamous Signal chat.  One made a payment with a note consisting solely of an eggplant emoji.",
    "url": "https://www.wired.com/story/even-more-venmo-accounts-tied-to-trump-officials-in-signal-group-chat-left-data-public/"
  },
  {
    "text": "Canada - US Aviation: Airlines Respond to Weakening Demand  —  The latest weekly update of OAG schedules data suggests that airline capacity between Canada and the US remains broadly unchanged for the summer season.  However, a closer look at recent weeks reveals a downward trend in airline capacity … ",
    "url": "https://www.oag.com/blog/canada-us-airline-capacity-aviation-market"
  },
  {
    "text": "Senate votes to overturn CFPB overdraft rule, in new blow for agency  —  The Senate voted 52-48 on Thursday to overturn a Consumer Financial Protection Bureau rule capping the overdraft fees that banks can charge, in another blow to the beleaguered agency.  The resolution under … ",
    "url": "https://www.politico.com/live-updates/2025/03/27/congress/senate-overturn-cfpb-overdraft-rule-00251896"
  },
  {
    "text": "What's next for Waltz and Hegseth  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Good Thursday morning.  This is Jack Blanchard, already excited for my first cup of tea with Marjorie Taylor Greene.  —  More importantly ... This is my first Opening Day and the forecast looks great.",
    "url": "https://www.politico.com/newsletters/playbook/2025/03/27/whats-next-for-waltz-and-hegseth-00253200"
  },
  {
    "text": "Elon Musk pressured Reddit's CEO on content moderation  —  Reddit took action after Musk messaged CEO Steve Huffman about users blocking X links and threatening DOGE staffers. … Nearly two months ago, Elon Musk went on a public crusade against Reddit.  —  On X, he said it was “insane” … ",
    "url": "https://www.theverge.com/command-line-newsletter/637083/elon-musk-reddit-ceo-content-moderation"
  },
  {
    "text": "New York County Clerk Blocks Texas Court Filing Against Doctor Over Abortion Pills  —  The showdown catapults the interstate abortion wars to a new level.  —  A New York county clerk on Thursday blocked Texas from filing a legal action against a New York doctor for prescribing and sending abortion pills to a Texas woman.",
    "url": "https://www.nytimes.com/2025/03/27/health/new-york-texas-abortion-shield-law.html?unlocked_article_code=1.7E4.VxUG.w8_FPxLNvFfM&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "75% of US scientists who answered Nature poll consider leaving … - Alexandra Witze  —  You can also search for this author in  —  PubMed Google Scholar  —  The massive changes in US research brought about by the new administration of President Donald Trump are causing many scientists … ",
    "url": "https://www.nature.com/articles/d41586-025-00938-y"
  },
  {
    "text": "UK's Gun Control Worked So Good They're Now Targeting ‘Ninja Swords’  —  The United Kingdom has some of the most restrictive gun control laws in the world.  Many were passed after a mass shooting in Dunblaine, Scotland, but have also been advanced as a way to address violent crime.",
    "url": "https://townhall.com/tipsheet/tomknighton/2025/03/27/uks-gun-control-worked-so-good-theyre-now-targeting-ninja-swords-n2654582"
  }
]