[
  {
    "text": "Donald Trump's Go-To Move When Debates Don't Go Well  —  The former president has a habit of working the referees before debates, and then complaining about them if things don't go as he hoped.  —  As former President Donald J. Trump sought to minimize the damage done by Tuesday night's debate … ",
    "url": "https://www.nytimes.com/2024/09/12/us/politics/trump-debate.html"
  },
  {
    "text": "Trump's mental capacity is now topic one  —  The Donald Trump who melted down on the debate stage Tuesday night is not a well man.  —  He sounded like a lunatic.  He expressed his belief in things that simply aren't true.  (Think: “They're eating the dogs.  They're eating the cats.\")",
    "url": "https://presswatchers.org/2024/09/trumps-mental-capacity-is-now-topic-one/"
  },
  {
    "text": "$47 Million Flowed Into Harris Campaign in 24 Hours After Debate  —  The sum included donations from 600,000 individuals.  Vice President Kamala Harris already had a significant financial edge over former President Donald J. Trump entering September.  —  Vice President Kamala Harris raised $47 million … ",
    "url": "https://www.nytimes.com/2024/09/12/us/politics/harris-debate-donations.html"
  },
  {
    "text": "Harris Extends Lead Over Trump After First Presidential Debate  —  The Democratic nominee leads the Republican by 5 points among likely voters following Tuesday's face-off  —  Data Downloads  —  A sortable CSV of results among likely voters in the Kamala Harris-Donald Trump presidential match-up",
    "url": "https://pro.morningconsult.com/instant-intel/harris-trump-first-debate-poll"
  },
  {
    "text": "Trump Defends Debate Performance and Calls for Ending Tax on Overtime  —  Speaking at an event in Tucson, Ariz., former President Donald J. Trump called for eliminating taxes on overtime pay as he declared Tuesday's debate a “monumental victory” for him.  —  Although it had been billed … ",
    "url": "https://www.nytimes.com/2024/09/12/us/politics/trump-debate-tucson-rally-arizona.html"
  },
  {
    "text": "Texas comes for the right to interstate travel  —  States' rights for me, not for thee. … During Tuesday's debate, as Donald Trump tried to take credit for the demise of Roe while pretending a second Trump administration wouldn't obliterate abortion protections at a national level … ",
    "url": "https://www.publicnotice.co/p/texas-medical-records-abortion"
  },
  {
    "text": "In blow to Newsmax, judge rules Smartmatic's case over 2020 election lies will go to trial this month  —  A major defamation case against Newsmax will proceed to trial later this month, a judge ruled Thursday, dealing a blow to the right-wing network and setting the stage for the 2020 election … ",
    "url": "https://www.cnn.com/smartmatic-newsmax-trial-2020-election-fox/"
  },
  {
    "text": "Robert F. Kennedy Jr. Has Sabotaged Early Voting in a Critical Swing State  —  The North Carolina Supreme Court tossed a grenade into the state's election on Monday, violating both state and federal law to grant Robert F. Kennedy Jr.'s cynical, last-minute removal from the ballot.",
    "url": "https://slate.com/news-and-politics/2024/09/north-carolina-robert-kennedy-early-voting-trump-sabotage.html"
  },
  {
    "text": "Manchin opens door for Schumer on judicial confirmations … - That's a huge win for Schumer, who was previously looking to capitalize on GOP absences or rely on Vice President Kamala Harris to break ties.  —  In a surprise, Manchin voted to advance the nomination of Kevin Ritz … ",
    "url": "https://www.axios.com/2024/09/13/manchin-schumer-judicial-confirmations-biden-trump"
  },
  {
    "text": "How Elon Musk Secretly Tried to Oust a Texas Prosecutor  —  In a bid to counter George Soros, the Tesla chief executive unsuccessfully backed the opponent of a progressive district attorney  —  Elon Musk secretly channeled hundreds of thousands of dollars into a local race in Travis County … ",
    "url": "https://www.wsj.com/us-news/elon-musk-texas-da-jose-garza-oust-atempt-206db043?st=0r4kfh0mlpe0euo"
  },
  {
    "text": "These people have seen Harris in the Situation Room.  Here's what they have to say.  —  Harris is “more hard-line than most people think,” says a retired four-star general who has briefed her many times.  —  Would Kamala Harris make a good president and commander in chief?",
    "url": "https://www.washingtonpost.com/opinions/2024/09/12/harris-commander-predictions-colleagues/"
  },
  {
    "text": "Springfield City Hall, schools, county hit by bomb threat tied to Haitian issues  —  City Hall evacuated, county offices closed, parents at one Springfield school asked to pick up children early  —  Several city, county and school buildings around Springfield were closed Thursday because of a bomb threat … ",
    "url": "https://www.springfieldnewssun.com/news/springfield-city-hall-evacuated-due-to-unspecified-threat/LEJGCXXHZRHT3HH3HYHABRZGT4/"
  },
  {
    "text": "Judge narrows election interference case against Trump in Georgia  —  Judge Scott McAfee wrote in his decision that 3 of the counts could no longer stand because they involved accusations of perjury or false statements under federal jurisdiction.  —  ATLANTA — The judge in election interference case … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-narrows-election-interference-case-trump-georgia-rcna170898"
  },
  {
    "text": "Triple Hearsay: Original Sources of the Claim that Haitians Eat Pets in Ohio Admit No First-Hand Knowledge  —  “I'm not sure I'm the most credible source because I don't actually know the person who lost the cat,” Kimberly Newton told NewsGuard.  She is the Springfield, Ohio, resident whose story started it all",
    "url": "https://www.newsguardrealitycheck.com/p/origins-haitians-eating-pets-claim"
  },
  {
    "text": "The New Right Has a Blueprint for Seizing Power.  Is JD Vance Executing It?  —  There may be more to the alliance between MAGA and the New Right than political convenience.  —  JD Vance's political career has been defined by an apparent paradox.  On the one hand, Vance is a member … ",
    "url": "https://www.politico.com/news/magazine/2024/09/13/jd-vance-new-right-political-movement-00177203"
  },
  {
    "text": "Coin-toss election gives young voters new sway … - For Trump, that means gunning for the “bro” vote with testosterone-fueled appearances on podcasts and at UFC fights.  — Harris is betting that young women — who appear to be moving left much faster than young men are moving right … ",
    "url": "https://www.axios.com/2024/09/13/trump-harris-campaign-young-voters"
  },
  {
    "text": "Project 2025 cuts Social Security: Are you on the chopping block?  Check this map.  —  Should the Social Security Retirement Age Be Raised?  Yes.  — Heritage Foundation  —  You gotta hand it to the clever folks at the Heritage Foundation!  How do you make it even harder for seniors struggling with their healthcare and expenses?",
    "url": "https://thedemlabs.org/2024/09/12/project-2025-cuts-social-security-map-of-who-gets-hurt/"
  }
]