[
  {
    "text": "Trump's Tariffs Disrupt Global Trade Without a Clear Strategy  —  The global trading system is only one example of the administration tearing something apart, only to reveal that it has no plan for how to replace it.  —  As the breadth of the Trump revolution has spread across Washington in recent weeks … ",
    "url": "https://www.nytimes.com/2025/04/08/us/politics/trump-tariffs-global-trade-war.html?unlocked_article_code=1.-U4.rWiU.5pG7ye5YNBjg"
  },
  {
    "text": "IRS chief to quit over deal to share data with immigration authorities  —  Melanie Krause clashed with Treasury Department officials who sought to circumvent IRS executives so immigration authorities could access taxpayers' information.  —  The acting head of the Internal Revenue Service plans … ",
    "url": "https://www.washingtonpost.com/business/2025/04/08/irs-dhs-tax-data-immigrants/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0MDg0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1NDY3MTk5LCJpYXQiOjE3NDQwODQ4MDAsImp0aSI6Ijk0OGIxYjYwLWJhMjEtNGY1ZC1iOWI3LTcyN2EyMmY3OTc5YyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA0LzA4L2lycy1kaHMtdGF4LWRhdGEtaW1taWdyYW50cy8ifQ.pVamhXTS8KgTc8iTVzJe8CF1XrkHOxZYJ5aoOW6F_RI&itid=gfta"
  },
  {
    "text": "DOGE to Shutter DOJ Tax Division … I didn't know this until this morning.  And I'm surprised it hasn't gotten more press attention.  We know that DOGE is in the process of gutting the IRS.  According to internal IRS estimates reviewed by The Washington Post this internal sabotage … ",
    "url": "https://talkingpointsmemo.com/edblog/doge-to-shutter-doj-tax-division/sharetoken/86f023ca-b4a0-4bb4-9e09-df7e05237d43"
  },
  {
    "text": "US IRS chief to quit over deal to share data with immigration officials, report says  —  The acting head of the U.S. Internal Revenue Service plans to resign over a new agreement to share the tax data of undocumented immigrants with Homeland Security personnel, the Washington Post reported on Tuesday … ",
    "url": "https://www.reuters.com/world/us/us-irs-chief-quit-over-deal-share-data-with-immigration-officials-report-says-2025-04-08/"
  },
  {
    "text": "AP wins reinstatement to White House events after judge rules government can't bar its journalists  —  A federal judge ordered the White House on Tuesday to restore The Associated Press' full access to cover presidential events, affirming on First Amendment grounds that the government cannot punish … ",
    "url": "https://apnews.com/article/trump-ap-media-court-white-house-events-access-f346a0efe87c1dec4d6f90e6041abd09"
  },
  {
    "text": "Federal judge says White House's punishment of Associated Press is unconstitutional  —  The White House's decision to punish the Associated Press by eliminating its access to President Donald Trump's events, the Oval Office and Air Force One is unconstitutional, a federal judge said Tuesday.",
    "url": "https://cnn.com/2025/04/08/politics/judge-restores-associated-press-access-to-white-house/"
  },
  {
    "text": "Trump White House Won't Respond to Some Journalists Who Display Their Pronouns  —  Some Trump administration officials have declined to answer questions from several journalists on the basis of their email signatures.  —  The Trump administration formally barred federal workers from listing … ",
    "url": "https://www.nytimes.com/2025/04/08/business/media/white-house-journalists-pronouns.html"
  },
  {
    "text": "Scoop: A dozen House Republicans mull defying Trump on tariff bill  —  At least a dozen House Republicans are considering signing onto Rep. Don Bacon's (R-Neb.) bill to restrict the White House's ability to impose tariffs unilaterally, Axios has learned.  —  Why it matters … ",
    "url": "https://www.axios.com/2025/04/08/house-republicans-tariff-bill-trump-don-bacon"
  },
  {
    "text": "Trump Administration Freezes $1 Billion for Cornell and $790 Million for Northwestern, Officials Say  —  The funding pause amid civil rights investigations into both universities sharply escalates the Trump administration's campaign against elite colleges.  —  The Trump administration … ",
    "url": "https://www.nytimes.com/2025/04/08/us/politics/cornell-northwestern-university-funds-trump.html"
  },
  {
    "text": "Live news: Treasuries hit as market turmoil intensifies  —  Treasuries hit as market turmoil intensifies  —  Global market turmoil intensified on Wednesday after Donald Trump's sweeping tariffs took effect, with government bonds and stocks selling off.  —  US Treasuries were hit hard … ",
    "url": "https://www.ft.com/content/f3e0ee58-47a0-41c4-b021-ed19d27da6e7"
  },
  {
    "text": "Trump's tariffs will damage the world  —  The trade deficits will remain roughly unchanged — the globe will just end up poorer  —  Now we know which economy is the gravest threat to the US after China: Lesotho.  China currently has a combined tariff of 54 per cent under Donald Trump's new plan.",
    "url": "https://www.ft.com/content/d96d4a44-2b75-4222-b77a-afe72c1b9174"
  },
  {
    "text": "DOJ: Some Jan. 6 defendants should be repaid money they sent to Congress  —  Prosecutors say those whose convictions were wiped out are entitled to reimbursement of the restitution they paid.  —  Jan. 6 defendants whose convictions were wiped out by President Donald Trump are entitled … ",
    "url": "https://www.politico.com/news/2025/04/08/doj-jan-6-congress-00280031"
  },
  {
    "text": "Trump Claims Nazis Treated Jewish Prisoners With “Love” … In his latest rewrite of European history, Donald Trump made a ridiculous and sympathetic declaration about the Nazis.  —  Amid the tariff chaos he spurred, Trump met with Israeli Prime Minister Benjamin Netanyahu in the Oval Office Monday … ",
    "url": "https://newrepublic.com/post/193725/donald-trump-israel-hostages-nazis-jewish-prisoners-love"
  },
  {
    "text": "Trump Signs Orders Aimed at Reviving a Struggling Coal Industry  —  The moves include loosening environmental rules, but it is unclear how much they can help reverse the sharp decline in coal power over the last two decades.  —  President Trump signed four executive orders Tuesday aimed … ",
    "url": "https://www.nytimes.com/2025/04/08/climate/trump-order-coal-mining.html"
  },
  {
    "text": "In Trump Cases, Supreme Court Retreats From Confrontation  —  In a series of narrow rulings, the justices have seemed to take pains to avoid a showdown with a president who has challenged the judiciary's legitimacy.  —  6 MIN READ  —  Justices Give Trump a Tentative Win in Push to Fire 16,000 Federal Workers",
    "url": "https://www.nytimes.com/2025/04/08/us/supreme-court-trump-confrontation.html"
  },
  {
    "text": "White House Confirms Trump Is Exploring Ways To ‘Deport’ U.S. Citizens  —  The administration could try removing American citizens if it identifies a pathway it can claim to be legal.  —  Video  —  White House press secretary Karoline Leavitt said Tuesday that President Donald Trump … ",
    "url": "https://www.huffpost.com/entry/white-house-confirms-trump-is-exploring-ways-to-deport-us-citizens_n_67f580abe4b0a5ea5c7608d2"
  },
  {
    "text": "There's something big missing from Trump's post-war manufacturing fantasy  —  Those who credit manufacturing jobs for a glorious past America mistake correlation for causation.  —  Many Trump supporters are celebrating his new tariffs on the hope that they'll make America great again … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-tariffs-manufacturing-jobs-stock-market-rcna200058"
  },
  {
    "text": "New Social Security rules will create hurdles for millions of seniors, report finds  —  Americans seeking retirement or survivor benefits from the Social Security Administration will no longer be able to apply over the phone, starting on Monday.  —  Instead, they will have to seek services online … ",
    "url": "https://www.npr.org/2025/04/08/nx-s1-5356476/social-security-new-rules"
  },
  {
    "text": "DOGE head denies responsibility for mass firings in private group chat message  —  WASHINGTON — Amy Gleason, acting administrator of the Department of Government Efficiency, denied responsibility for widespread government layoffs in a message to industry colleagues obtained by the Chronicle.",
    "url": "https://www.sfchronicle.com/politics/article/doge-amy-gleason-group-chat-20258581.php"
  },
  {
    "text": "Video of arrest, new details in Trump administration's case targeting Georgetown postdoctoral fellow Dr. Khan Suri for speech on Palestinian rights  —  RICHMOND, Va. - Today Georgetown professor and postdoctoral fellow Dr. Badar Khan Suri filed an amended complaint in his case Khan Suri v. Trump challenging … ",
    "url": "https://ccrjustice.org/home/press-center/press-releases/video-arrest-new-details-trump-administration-s-case-targeting"
  },
  {
    "text": "Ken Paxton Says He Will Challenge Senator John Cornyn in 2026  —  The announcement by Mr. Paxton, the attorney general of Texas and a firebrand conservative, set up what is expected to be a blockbuster showdown in Texas.  —  Ken Paxton, the attorney general of Texas, officially announced … ",
    "url": "https://www.nytimes.com/2025/04/08/us/ken-paxton-john-cornyn-senate-race.html"
  },
  {
    "text": "17 Montana Republicans Cross Party Lines, Defeat Anti-Trans Bill After Nonbinary Rep's Speech  —  Erin In The Morning is a reader-supported publication.  To receive new posts and support my work, consider becoming a subscriber.  —  On Tuesday, Montana's House considered Senate Bill 164 … ",
    "url": "https://www.erininthemorning.com/p/17-montana-republicans-cross-party"
  },
  {
    "text": "Wall Street Bursts With Anger Over Tariff ‘Stupidity’  —  Billionaire investors are in an unfamiliar position, watching and cringing as tariffs roll on and the stock market reels.  —  Wall Street billionaires are not used to being on the outside looking in.",
    "url": "https://www.nytimes.com/2025/04/08/business/trump-tariff-wall-street-reaction.html"
  },
  {
    "text": "Trump admin cuts funding to Princeton University over climate programs  —  The Trump administration is pulling nearly $4 million in funding from Princeton University, the U.S. Department of Commerce announced Tuesday.  —  The big picture: The cuts come days after the administration already paused dozens … ",
    "url": "https://www.axios.com/2025/04/08/princeton-university-funding-cuts-climate-programs"
  },
  {
    "text": "Two Law Firms File for Permanent Relief From Trump's Executive Orders  —  Jenner & Block and WilmerHale are seeking summary judgments against what one of them called “a plain violation of the First Amendment.”  —  Two big law firms that have come under attack by the Trump administration filed court papers … ",
    "url": "https://www.nytimes.com/2025/04/08/business/jenner-block-trump-filing.html"
  }
]