[
  {
    "text": "Kennedy's Lawyer Has Asked the F.D.A. to Revoke Approval of the Polio Vaccine  —  Aaron Siri, who specializes in vaccine lawsuits, has been at Robert F. Kennedy Jr.'s side reviewing candidates for top jobs at the Department of Health and Human Services.  —  The lawyer helping Robert F … ",
    "url": "https://www.nytimes.com/2024/12/13/health/aaron-siri-rfk-jr-vaccines.html"
  },
  {
    "text": "Trump Advisers Seek to Shrink or Eliminate Bank Regulators  —  Advisers asked potential nominees whether Trump could abolish the FDIC  —  The Trump transition team has started to explore pathways to dramatically shrink, consolidate or even eliminate the top bank watchdogs in Washington.",
    "url": "https://www.wsj.com/finance/regulation/trump-advisers-bank-regulations-fdic-efa761dc?st=nN2iCh"
  },
  {
    "text": "FBI didn't deploy undercover agents on Jan. 6, watchdog report finds, undercutting conspiracy theories  —  The DOJ inspector general also said the FBI should have done more to canvass its sources in advance of Jan. 6 to try to understand the potential for violence.",
    "url": "https://www.politico.com/news/2024/12/12/fbi-jan-6-undercover-agents-inspector-general-report-00194036"
  },
  {
    "text": "Jeff Bezos' Amazon Plans to Donate $1 Million to Trump's Inauguration  —  The tycoon, long a Trump foe, is among tech leaders seeking improved ties with the president-elect  —  Amazon.com is planning a $1 million donation to president-elect Donald Trump's inaugural fund … ",
    "url": "https://www.wsj.com/politics/elections/jeff-bezos-amazon-plans-to-donate-1-million-to-trumps-inauguration-dc3705ac?st=n7hrfD"
  },
  {
    "text": "Trump's Middle East Adviser Pick Is a Small-Time Truck Salesman  —  The lore around Massad Boulos, Tiffany Trump's father-in-law, is that he is a billionaire dealmaker.  Records show otherwise.  —  The lore around Massad Boulos, Tiffany Trump's father-in-law, is that he is a billionaire dealmaker.",
    "url": "https://www.nytimes.com/2024/12/12/world/africa/trump-massad-boulos-middle-east.html?unlocked_article_code=1.g04.kvZk.eE-d0JxFTQec&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "University of Michigan May Fire D.E.I. Official Over Antisemitism Claim  —  The official, an administrator of multicultural programs, was accused of making antisemitic remarks in a private conversation.  She has denied the allegations.  —  The University of Michigan is considering firing … ",
    "url": "https://www.nytimes.com/2024/12/12/us/university-of-michigan-dei-administrator-antisemitism.html"
  },
  {
    "text": "It's Time to Break Up Big Medicine  —  The saga of the UnitedHealth Care CEO assassination has, as could be expected, now turned into a discussion of our health care system.  Elizabeth Warren, for instance, is making the obvious point that people hate the health care system.",
    "url": "https://www.thebignewsletter.com/p/its-time-to-break-up-big-medicine"
  },
  {
    "text": "Christopher Wray Is Preparing to Sabotage Trump and Patel  —  On Wednesday, Christopher Wray announced that he is resigning as director of the FBI.  —  “After weeks of careful thought, I've decided the right thing for the bureau is for me to serve until the end of the current administration … ",
    "url": "https://pjmedia.com/matt-margolis/2024/12/12/christopher-wray-is-preparing-to-sabotage-trump-and-patel-n4935055"
  },
  {
    "text": "Biden clemency announcement gets mixed reviews on Capitol Hill: 'Where's the bar?'  —  ‘Does that tell you how corrupt he thinks this administration has been?’ asked one House Republican  —  President Biden's act of clemency, the largest in a single day, has left some congressional Republicans unhappy … ",
    "url": "https://www.foxnews.com/politics/biden-clemency-announcement-gets-mixed-reviews-capitol-hill-wheres-bar"
  },
  {
    "text": "Wellness Goes to Washington  —  On Instagram, the wellness women don't seem like a political movement.  Their pictures scroll by like snapshots from heaven.  Angels with luminous skin offer glimpses into their lives—earth-toned vignettes of gleaming countertops and root vegetables.",
    "url": "https://www.theatlantic.com/politics/archive/2024/12/wellness-rfk-washington/680977/"
  },
  {
    "text": "Trump says reducing food prices will be ‘very hard,’ after campaign promise to cut costs  —  Trump said he would pardon people convicted of participating in the Jan. 6, 2021, assault on the Capitol within the first minutes or hours of taking office.",
    "url": "https://www.washingtonpost.com/politics/2024/12/12/trump-time-food-costs-jan-6-transgender-rights/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzOTc5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM1MzYxOTk5LCJpYXQiOjE3MzM5Nzk2MDAsImp0aSI6ImI3YjA5ZjVlLTk4MWYtNGI1Yi04MWUyLWJhMGFiMTIyNjFiOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEyLzEyL3RydW1wLXRpbWUtZm9vZC1jb3N0cy1qYW4tNi10cmFuc2dlbmRlci1yaWdodHMvIn0.TzvopiDkP0LFNNFMKUmRVsHwqHntBa2_YGe3EM_im2A&itid=gfta"
  },
  {
    "text": "'Now she's the world's problem': Some Arizona Republicans relieved Lake is heading to Washington  —  She's still expected to play a role in Arizona politics.  —  President-elect Donald Trump's pick of longtime loyalist Kari Lake to lead Voice of America has some Arizona Republicans breathing a sigh of relief.",
    "url": "https://www.politico.com/news/2024/12/12/kari-lake-voa-republicans-00194096"
  },
  {
    "text": "China's Xi is likely to decline Trump's inauguration invitation, seeing it as too risky to attend  —  Chinese leader Xi Jinping would likely see President-elect Donald Trump's invitation to attend his inauguration as too risky to accept, and the gesture from Trump may have little bearing … ",
    "url": "https://apnews.com/article/trump-xi-china-inauguration-invitation-a0fbde24ca2ccafa9a953813955d532f"
  },
  {
    "text": "SEC charges Cantor Fitzgerald, led by Trump's Commerce pick, with breaking securities laws … WASHINGTON — The Securities and Exchange Commission on Thursday charged global financial services firm Cantor Fitzgerald with violating laws related to disclosures by so-called blank-check companies before they raised money from the public.",
    "url": "https://www.cnbc.com/2024/12/12/sec-cantor-fitzgerald-charges-howard-lutnick-trump-commerce-spac-.html"
  },
  {
    "text": "Republicans clash over ‘SALT’ deduction as they seek to extend Trump's tax law  —  Early battle lines are forming over a contentious issue that has split Republicans in high-tax states from their other colleagues as they plan a big tax bill next year.  —  WASHINGTON — A group … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-clash-salt-deduction-extend-trump-tax-law-rcna183876"
  },
  {
    "text": "House Republicans launch investigation into CVS Caremark for potential antitrust violations  —  House Republicans want to know whether pharmacy benefit manager (PBM) CVS Caremark violated federal antitrust laws by threatening independent pharmacies to keep them from using money-saving tools outside the PBM's network.",
    "url": "https://thehill.com/policy/healthcare/5037786-house-republicans-launch-investigation-into-cvs-caremark-for-potential-antitrust-violations/"
  },
  {
    "text": "White House releases strategy to counter anti-Muslim, anti-Arab hate  —  U.S. President Joe Biden on Thursday released a long-awaited strategy for countering anti-Muslim and anti-Arab hate, up sharply since the start of the Israel-Gaza war, calling for urgent, continued work to reduce discrimination and bias.",
    "url": "https://www.reuters.com/world/us/white-house-releases-strategy-counter-anti-muslim-anti-arab-hate-2024-12-12/"
  },
  {
    "text": "Biden commutes sentence for Kids-for-Cash judge  —  Former Luzerne County Judge Michael T. Conahan, who gained notoriety for wrongfully imprisoning juveniles in the Kids-for-Cash scandal, is one of nearly 1,500 inmates whose sentences President Joe Biden commuted Thursday as his term in office comes to a close.",
    "url": "https://www.citizensvoice.com/2024/12/12/biden-commutes-sentence-for-kids-for-cash-judge/"
  },
  {
    "text": "Jeffries super PAC looks deep into GOP territory for 2026 map  —  A super PAC closely aligned with House Minority Leader Hakeem Jeffries (D-N.Y.) is circling districts that voted for their Republican incumbents by as much as 30 percentage points as it charts a course back to the majority",
    "url": "https://www.axios.com/2024/12/13/jeffries-2026-elections-republican-seats"
  },
  {
    "text": "Was mocking Musk a mistake?  Democrats think about warmer relationship with the billionaire  —  Democrats had soured on the richest man on the planet.  But a few are starting to wonder if that was a mistake.  —  Ro Khanna is trading texts with Elon Musk.  Josh Shapiro took a call from him.",
    "url": "https://www.politico.com/news/2024/12/12/democrats-elon-musk-relationship-000579"
  },
  {
    "text": "EXCLUSIVE: Biden Races To Sell Off Border Wall Parts Before Trump Takes Office  —  ‘The goal is to move all of it off the border before Christmas,’ Arizona border patrol agent tells The Daily Wire  —  The Biden administration is using its final weeks to haul a massive amount … ",
    "url": "https://www.dailywire.com/news/exclusive-biden-races-to-sell-off-border-wall-parts-before-trump-takes-office"
  },
  {
    "text": "Los Angeles Times Owner Wades Deeper Into Opinion Section  —  Dr. Patrick Soon-Shiong's public comments and actions, including recently blocking an editorial weighing in on President-elect Trump's cabinet picks, have concerned many staff members.  —  After President-elect Donald J. Trump announced … ",
    "url": "https://www.nytimes.com/2024/12/12/business/media/la-times-patrick-soon-shiong.html"
  },
  {
    "text": "Democrats Ask That Trump Cabinet Picks Produce Communications With Epshteyn  —  The two top Democrats on the Senate Judiciary Committee said prospective nominees should be prepared to testify about any discussions with Boris Epshteyn about their selections.  —  The two top Democrats … ",
    "url": "https://www.nytimes.com/2024/12/12/us/politics/boris-epshteyn-senate.html"
  },
  {
    "text": "Exclusive: Officer who killed Ashli Babbitt abandoned US Capitol post for card game, lied to investigators about it, source says  —  The U.S. Capitol Police lieutenant who shot and killed Ashli Babbitt at the Capitol on Jan. 6 was recommended for termination in 2001 for abandoning his post … ",
    "url": "https://www.theblaze.com/news/exclusive-officer-who-killed-ashli-babbitt-abandoned-us-capitol-post-for-card-game-lied-to-investigators-about-it-source-says"
  },
  {
    "text": "Rand Paul balks at Trump GOP's big-dollar border agenda  —  Sen. Rand Paul (R-Ky.) is deeply skeptical of some of President-elect Trump's and GOP leadership's aggressive border plans. … Paul, an infamous deficit hawk and libertarian, will chair the committee that oversees the Department of Homeland Security.",
    "url": "https://www.axios.com/2024/12/13/rand-paul-trump-thune-border-immigration"
  },
  {
    "text": "AOC faces Pelosi-led slugfest for Oversight role … - The fight comes as several septuagenarian committee ranking members are facing desperate battles against - or yielding to - younger challengers.  — “Many members are concerned about [the] precedent these races are setting,” one senior House Democrat told Axios.",
    "url": "https://www.axios.com/2024/12/12/aoc-pelosi-oversight-committee-connolly-raskin"
  },
  {
    "text": "The Postal Service's electric mail trucks are way behind schedule  —  Defense contractor Oshkosh had only delivered 93 trucks by November — compared to 3,000 originally expected by now.  The delays put Biden's climate goals at risk.  —  Bogage has covered the Postal Service since 2020 … ",
    "url": "https://www.washingtonpost.com/business/2024/12/11/biden-usps-ev-oshkosh-climate/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzOTc5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM1MzYxOTk5LCJpYXQiOjE3MzM5Nzk2MDAsImp0aSI6IjNmNzEzNDkzLTczYmYtNGNhZi1iM2JlLWRhZTg3OTMzMjhhZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzEyLzExL2JpZGVuLXVzcHMtZXYtb3Noa29zaC1jbGltYXRlLyJ9.SVL0UHR5u2dtF97ar0tbE-nXEC3iK9esjf0mbsImLZI&itid=gfta"
  },
  {
    "text": "Trump to have private dinner with Shinzo Abe's widow at Mar-a-Lago: Report  —  President-elect Donald Trump is reportedly set to have a private dinner on Sunday with Akie Abe at Mar-a-Lago, the widow of the former Japanese Prime Minister Shinzo Abe, who was assassinated in 2022.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3259549/donald-trump-have-private-dinner-akie-abe-widow-mar-a-lago/"
  }
]