[
  {
    "text": "Dismissed Nuclear Bomb Specialists Recalled by Energy Department  — About 300-400 workers tied to nuclear programs were dismissed  — Agency seeks to bring back workers after chaotic terminations  —  The Energy Department is seeking to bring back nuclear energy specialists … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-14/dismissed-nuclear-bomb-specialists-recalled-by-energy-department"
  },
  {
    "text": "Trump officials fired nuclear staff not realizing they oversee the country's weapons stockpile, sources say  —  Trump administration officials fired more than 300 staffers Thursday night at the National Nuclear Security Administration — the agency tasked with managing the nation's nuclear stockpile … ",
    "url": "https://www.cnn.com/2025/02/14/climate/nuclear-nnsa-firings-trump"
  },
  {
    "text": "‘Like a tornado hit’: Stunned federal workers take stock of mass layoffs — and brace for repercussions  —  The Trump administration could face political backlash from voters in Republican and Democratic states who suddenly find a host of services vanish.  —  Americans could soon start … ",
    "url": "https://www.politico.com/news/2025/02/15/trump-purges-real-world-consequences-disasters-00204475"
  },
  {
    "text": "Justice officials move to drop Adams case after 7 lawyers refuse, resign in protest  —  Acting deputy attorney general Emil Bove told prosecutors in Washington to find someone who would seek to have the case dismissed, or risk losing their jobs  —  The Justice Department on Friday filed … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/14/justice-prosecutors-resignation-trump-eric-adams-corruption/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NTA5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwODkxNTk5LCJpYXQiOjE3Mzk1MDkyMDAsImp0aSI6ImViZTI0YjBiLTJmMzMtNDZlYi05YTI1LTVjNjFhNzlhMWRkNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzE0L2p1c3RpY2UtcHJvc2VjdXRvcnMtcmVzaWduYXRpb24tdHJ1bXAtZXJpYy1hZGFtcy1jb3JydXB0aW9uLyJ9.Xqn0QerOwS_yqEQceaLRNmxa69s4wYZgiu7RxfozVU0&itid=gfta"
  },
  {
    "text": "Elon Musk's DOGE Posts Classified Data On Its New Website  —  “People are scrambling” to see if their sensitive information has been accessed by Musk's programmers, said one federal intelligence employee.  —  LOADING  —  WASHINGTON — Elon Musk's team at the so-called Department … ",
    "url": "https://www.huffpost.com/entry/elon-musk-doge-posts-classified-data_n_67ae646de4b0513a8d767112"
  },
  {
    "text": "See inside DOGE's playbook for eliminating DEI  —  Documents obtained by The Washington Post detail step-by-step plans the U.S. DOGE Service developed to purge federal agencies of diversity, equity, and inclusion workers and offices.  DOGE, which stands for Department of Government Efficiency … ",
    "url": "https://www.washingtonpost.com/politics/interactive/2025/doge-playbook-dei-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NTk1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwOTc3OTk5LCJpYXQiOjE3Mzk1OTU2MDAsImp0aSI6IjcyMWRkYjNjLTk4YjEtNDliYi1hNzAxLWVlM2EwY2FjYWMxMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy9pbnRlcmFjdGl2ZS8yMDI1L2RvZ2UtcGxheWJvb2stZGVpLXRydW1wLyJ9.4lvmQoZt50V-ggL2sPe9B8awZ7JZ6HAV7oibb4oyVJc&itid=gfta"
  },
  {
    "text": "Records show how DOGE planned Trump's DEI purge — and who gets fired next  —  A DOGE team plans to fire federal workers who are not in DEI roles and employees in offices that protect equal rights, internal documents show.  —  A team of workers from the U.S. DOGE Service developed step … ",
    "url": "https://www.washingtonpost.com/nation/2025/02/15/doge-fire-federal-employees-trump-dei/"
  },
  {
    "text": "Trump strangles Europe … - Defense Secretary Pete Hegseth perplexed and perturbed allies on his first visit to NATO by seemingly taking some of Ukraine's bargaining chips off the table before those talks began. … - Back at home, Trump announced “reciprocal” tariffs on every country … ",
    "url": "https://www.axios.com/2025/02/15/trump-vance-europe-russia-ukraine-nato"
  },
  {
    "text": "This is a perfectly fine hill for the AP to die on  —  The wire service's reporters have been barred from White House events.  Next time, it could be you.  —  The world is now filled with media critics, media analysts, media prognosticators, media experts, media everything.",
    "url": "https://www.washingtonpost.com/opinions/2025/02/14/ap-white-house-trump-gulf-america/"
  },
  {
    "text": "German Chancellor Rebukes Vance for Supporting Party That Downplays Nazis  —  At the Munich Security Conference, Olaf Scholz accused the U.S. vice president of unacceptable interference in Germany's coming elections.  —  Chancellor Olaf Scholz of Germany on Saturday accused Vice President JD Vance … ",
    "url": "https://www.nytimes.com/2025/02/15/world/europe/scholz-vance-munich-germany.html"
  },
  {
    "text": "Inside The ‘Bizarre’ Meeting Where DOGE Requested ‘Extensive System Access’ At IRS  —  The Internal Revenue Service has now joined the list of federal agencies and offices experiencing life on the “DOGE” side.  Two sources told TPM that a staffer affiliated with President Trump and Elon Musk's controversial … ",
    "url": "https://talkingpointsmemo.com/news/doge-irs-extensive-system-access"
  },
  {
    "text": "Top US Election Security Watchdog Forced to Stop Election Security Work  —  The US Cybersecurity and Infrastructure Security Agency has frozen efforts to aid states in securing elections, according to an internal memo viewed by WIRED.  —  The Cybersecurity and Infrastructure Security Agency … ",
    "url": "https://www.wired.com/story/cisa-election-security-freeze-memo/"
  },
  {
    "text": "Naval Academy faculty told to avoid ‘divisive concepts’ like ‘systemic racism’  —  The guidance from the provost follows President Trump's recent DEI-focused executive order, which some say seeks to erase history and diversity.  —  Faculty at the Naval Academy are no longer permitted … ",
    "url": "https://www.thebaltimorebanner.com/education/higher-education/naval-academy-racism-sexism-faculty-NR7NUMXN3RBRVG7EXQHR35TCWQ/"
  },
  {
    "text": "Seeking a Mar-a-Lago Vibe, Trump Considers Paving Over Grass in Rose Garden  —  The president has been discussing plans to rip up the grass in one of the White House's most iconic locations and put in a hard surface to serve as a patio like the one at his Florida home and club.",
    "url": "https://www.nytimes.com/2025/02/14/us/politics/mar-a-lago-trump-grass-rose-garden.html"
  },
  {
    "text": "As federal workers and aid recipients reel, Trump's team says: So what?  —  “They get the one starving kid in Sudan that isn't going to have a USAID bottle, and they make everything DOGE has done about the starving kid in Sudan,” a White House official said.",
    "url": "https://www.washingtonpost.com/politics/2025/02/15/federal-workers-aid-recipients-reel-trumps-team-says-so-what/"
  },
  {
    "text": "Trump-Musk Scandal at USAID Takes Unnerving Turn With Vile Leaked Memo … Shockingly, it turns out that empowering the richest human being on the planet to maliciously and gratuitously heap additional misery on that planet's most poor, hungry, and desperate people might—just might … ",
    "url": "https://newrepublic.com/article/191578/trump-musk-scandal-usaid-leaked-memo"
  },
  {
    "text": "Maryland National Guard out of Frederick Douglass parade after DoD order declares Black History Month ‘dead’  —  Strict guidance from the national defense department crushed plans for an Eastern Shore parade held in honor of Frederick Douglass' 207th birthday because it was being held during … ",
    "url": "https://www.thebaltimorebanner.com/politics-power/maryland-national-guard-frederick-douglass-parade-UM7PE6LNMZG5NNQ3Q3OHD6E47E/"
  },
  {
    "text": "Don't Assume Trump Is Wrong About Birthright Citizenship  —  On his first day in office, President Trump issued an executive order that purports to end birthright citizenship for certain children.  It does so despite Section 1 of the 14th Amendment, which declares, “All persons born … ",
    "url": "https://www.nytimes.com/2025/02/15/opinion/trump-birthright-citizenship.html?unlocked_article_code=1.xE4.OCZA.QtpiNIig_NCZ&smid=url-share"
  },
  {
    "text": "Penn scrubs diversity initiatives from its website to comply with Trump order  —  The University of Pennsylvania's medical school plans to dissolve committees having to do with diversity, equity, and inclusion and any roles that implement such efforts.That's what Roy Hamilton, vice dean for inclusion … ",
    "url": "https://www.inquirer.com/education/university-pennsylvania-dei-donald-trump-order-20250215.html"
  },
  {
    "text": "In Trump's Cuts to Aid and Refugees, a Clash Over Christian Values  —  Vice President JD Vance and the Pope square off, as faith-based groups face an existential crisis.  —  Since World War II, as refugees fled Europe, Christian charity groups have delivered lifesaving American assistance around the world.",
    "url": "https://www.nytimes.com/2025/02/15/us/trump-usaid-christian-aid.html"
  },
  {
    "text": "Special counsel Jack Smith discloses ‘gift’ of $140,000 in free legal services  —  It's not clear precisely why Smith sought outside legal advice.  —  Jack Smith, the special counsel who brought two criminal cases against President Donald Trump, received $140,000 in pro bono legal services … ",
    "url": "https://www.politico.com/news/2025/02/14/jack-smith-justice-department-019350"
  },
  {
    "text": "Is corporate America already souring on Trump?  —  Optimism at the prospect of tax cuts and lighter regulation has given way to anxiety over trade policies",
    "url": "https://www.ft.com/content/a7c9376b-4cb2-4cf2-a665-66f75b72f4c2"
  }
]