[
  {
    "text": "The GOP Is Already Clashing Over Trump's VP Pick  —  While Trump tries to sew up the nomination, his camp is already feuding about his future running mate — and hoping it isn't Nikki Haley.  —  As the vice-presidential field continues to develop, many consider what a Nikki Haley vice presidency could mean for the GOP.",
    "url": "https://www.politico.com/news/magazine/2024/01/18/maga-nightmare-trump-loyalists-move-to-head-off-haley-vp-pick-00136282"
  },
  {
    "text": "Biden, Harris to mark Roe anniversary with abortion-focused rally in Virginia  —  The Biden campaign is planning an aggressive effort to highlight the stakes of the 2024 election for abortion access around what would have been the 51st anniversary of Roe v. Wade.",
    "url": "https://thehill.com/homenews/campaign/4415405-biden-harris-to-mark-roe-anniversary-rally-virginia/"
  },
  {
    "text": "Texas refuses to comply with Biden administration's cease-and-desist letter on border access  —  The Department of Homeland Security had directed the state to stop blocking the U.S. Border Patrol's access to roughly 2½ miles of the U.S.-Mexico border.",
    "url": "https://www.nbcnews.com/politics/immigration/texas-refuses-comply-biden-administrations-cease-desist-letter-border-rcna134423"
  },
  {
    "text": "Conservative justices, lawyers ready a path for ending agency deference  —  In nearly four hours of arguments on Wednesday, the justices of the U.S. Supreme Court debated who should be deciding how are laws in our country are implemented.  By the end of the arguments, the six-justice … ",
    "url": "https://www.lawdork.com/p/scotus-chevron-deference-arguments"
  },
  {
    "text": "Loose bolts open door to racism  —  On January 9th, a Boeing 737 Max 9 aircraft operated by Alaska Airlines was forced to make an emergency landing after a door panel flew off mid-air.  No deaths were reported, but multiple passengers required medical attention, officials said.",
    "url": "https://popular.info/p/loose-bolts-open-door-to-racism"
  },
  {
    "text": "Pakistan launches airstrikes in Iran, killing 9, after an earlier attack by Tehran  —  Pakistan's air force launched retaliatory airstrikes early Thursday in Iran against alleged militant hideouts, killing at least nine people and further raising tensions between the neighbors.",
    "url": "https://apnews.com/article/pakistan-iran-air-force-strikes-638f2ee4ccfb1a56d26e8f28f7e91699"
  },
  {
    "text": "This GOP Rep.'s Anti-Abortion Stances Keep Vanishing From Her Website  —  Rep. Monica De La Cruz (R-TX) initially ran for Congress with an unabashed anti-abortion stance.  Ever since then, abortion has quietly been disappearing from her campaign website.",
    "url": "https://www.thedailybeast.com/rep-monica-de-la-cruzs-anti-abortion-stances-keep-vanishing-from-her-website"
  },
  {
    "text": "United States of Ozempic: Where anti-obesity drugs are taking off  —  For every 1,000 people in Kentucky, roughly 21 were prescribed a drug that belongs to a buzzy class of diabetes and anti-obesity medications last year — the highest rate of any state, according to insurance claims data provided … ",
    "url": "https://www.axios.com/2024/01/18/ozempic-wegovy-weight-loss-drugs-states-map"
  },
  {
    "text": "Missouri Could Become the Latest State to Put Abortion on the Ballot in 2024  —  Abortion rights activists have scored a series of wins since the Supreme Court overturned Roe v. Wade, and voters in more states could weigh in on the issue this year  —  Missouri could become the latest state … ",
    "url": "https://themessenger.com/politics/missouri-could-become-the-latest-state-to-put-abortion-on-the-ballot-in-2024"
  },
  {
    "text": "A Democratic mainstay is set to run against Eric Adams  —  Scott Stringer, who also ran in 2021, is launching a committee and exploring a bid for mayor.  —  NEW YORK — New York City Mayor Eric Adams has his first viable reelection challenger — and he'll face a familiar foe.",
    "url": "https://www.politico.com/news/2024/01/18/scott-stringer-to-run-against-eric-adams-00136258"
  },
  {
    "text": "Phillips battles DEI controversy at the worst possible time  —  The Democratic presidential candidate is scrambling to tamp down an uproar just days before New Hampshire's primary.  —  At a crucial moment in his longshot campaign, Democratic presidential candidate Dean Phillips … ",
    "url": "https://www.politico.com/news/2024/01/17/dean-phillips-dei-cnn-interview-00136156"
  },
  {
    "text": "White House: GOP's Mayorkas impeachment push is unconstitutional  —  The White House argued on Thursday that the House GOP's push to impeach Homeland Security Secretary Alejandro Mayorkas is unconstitutional, urging them to drop it and work with President Biden on immigration reform.",
    "url": "https://thehill.com/homenews/administration/4415438-white-house-republicans-mayorkas-impeachment-push-is-unconstitutional/"
  },
  {
    "text": "Justice Department report finds ‘critical failures’ in response to Uvalde attack  —  Listen To Our Podcast  —  Every weekday, NPR's best political reporters are there to explain the big news coming out of Washington and the campaign trail.  They don't just tell you what happened.",
    "url": "https://www.npr.org/2024/01/18/1225340219/uvalde-report"
  },
  {
    "text": "John Fetterman Endorses Andy Kim in High-Stakes New Jersey Senate Primary  —  The Pennsylvania senator, the first among his colleagues to weigh in on the primary battle to oust the indicted Senator Robert Menendez, said he had concerns about Tammy Murphy's G.O.P. history.",
    "url": "https://www.nytimes.com/2024/01/18/us/politics/john-fetterman-andy-kim-new-jersey-senate.html"
  },
  {
    "text": "“Here's why that's bad news for Biden”: A chat with NYT Pitchbot  —  The legend himself speaks to Public Notice.  —  ∙ Paid … If you're active on twitter — or were before Elon Musk started making everyone more progressive than Steve Bannon think about deleting their account … ",
    "url": "https://www.publicnotice.co/p/doug-balloon-new-york-times-pitchbot-interview"
  },
  {
    "text": "Trump warns campaigns: Do not hire ex-DeSantis operative Jeff Roe  —  The admonition is another example of the former president's penchant for punishing people perceived as disloyal.  —  Former President Donald Trump and people in his inner circle have told down-ballot Republican candidates … ",
    "url": "https://www.politico.com/news/2024/01/18/trump-jeff-roe-republican-strategist-00136240"
  },
  {
    "text": "The Donald Trump Doom Loop  —  Sitting in a courtroom, feet away from the woman he sexually assaulted, the ex-President keeps trying to outrun the consequences of his own bad acts.  —  At Donald Trump's first criminal arraignment, in April, the security measures were out of a Hollywood action movie.",
    "url": "https://www.newyorker.com/news/our-local-correspondents/the-donald-trump-doom-loop"
  },
  {
    "text": "State Board of Education Passes Rule to Permanently Prohibit DEI in the Florida College System  —  ~ State Board also replaced “Principles of Sociology” with an American History course as an option on the list of social studies general education core courses ~",
    "url": "https://www.fldoe.org/newsroom/latest-news/state-board-of-education-passes-rule-to-permanently-prohibit-dei-in-the-florida-college-system.stml"
  }
]