[
  {
    "text": "Kamala Harris agreed to CNN town hall  —  The cable network also extended an offer to former President Donald Trump.  —  Vice President Kamala Harris will participate in a town hall with CNN on Oct. 23, her campaign announced Thursday.  —  Harris' participation comes after former President Donald Trump … ",
    "url": "https://www.politico.com/news/2024/10/10/kamala-harris-cnn-town-hall-00183249"
  },
  {
    "text": "FCC chair denounces Trump's calls for CBS to ‘lose its license’ over Harris' ‘60 Minutes’ interview  —  New York CNN  —  Federal Communications Commission chairwoman Jessica Rosenworcel denounced former President Donald Trump's “threats against free speech” Thursday after he attacked CBS … ",
    "url": "https://www.cnn.com/2024/10/10/media/fcc-rosenworcel-trump-cbs-license-60-minutes/"
  },
  {
    "text": "Donald Trump Goes to Detroit and Insults the Entire City  —  READ THE ROOM  —  He suggested Michiganders should vote for him if they don't want America to mimic their largest city.  —  Donald Trump on Thursday addressed business leaders in Detroit, where he insulted their city and big companies.",
    "url": "https://www.thedailybeast.com/donald-trump-goes-to-detroit-and-insults-the-entire-city-in-his-speech"
  },
  {
    "text": "Exclusive: Harris overtakes Trump among suburban voters, Reuters/Ipsos polling shows  —  Democratic presidential candidate Kamala Harris has erased Republican rival Donald Trump's advantage in the vast middle of American society: suburban residents and middle-income households, an analysis of Reuters/Ipsos polling shows.",
    "url": "https://www.reuters.com/world/us/harris-overtakes-trump-among-suburban-voters-reutersipsos-polling-shows-2024-10-10/"
  },
  {
    "text": "Taylor Lorenz leaves ‘Washington Post’ after rift with editors  —  When tech columnist Taylor Lorenz left the Washington Post last week, she did so with a splash: An interview with The Hollywood Reporter about launching her own digital magazine, called User Mag.",
    "url": "https://www.npr.org/2024/10/10/g-s1-27366/taylor-lorenz-leaves-washington-post-after-rift-with-editors"
  },
  {
    "text": "Trump Delivers Historically Illiterate Lecture on Tariffs … Donald Trump has grown increasingly fixated on tariffs, which he seems to think, contrary to the consensus among economists, are borne by foreigners.  Trump understands at some level that economists and most business owners disagree with him … ",
    "url": "https://nymag.com/intelligencer/article/trump-tariffs-detroit-economic-club-history-revenue-smoot-hawley.html"
  },
  {
    "text": "Gateway Pundit settles with Georgia election workers in defamation suit  —  The far-right publisher, which frequently reported false election-fraud claims, wrote repeatedly about Shaye Moss and her mother, Ruby Freeman.  —  The Gateway Pundit, a far-right news site that repeatedly published … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/10/gateway-pundit-defamation-ruby-freeman/"
  },
  {
    "text": "The FBI conducted a sham investigation into Brett Kavanaugh.  Surprised?  —  The bureau shamefully allowed itself to be used as a prop in political theater, orchestrated by the Trump administration  —  Maybe it was always obvious that the whole thing was a sham.",
    "url": "https://www.theguardian.com/commentisfree/2024/oct/10/brett-kavanaugh-fbi-donald-trump-investigation-sham"
  },
  {
    "text": "More than 3 million without power as Hurricane Milton slams Florida, causes deaths and flooding  —  Florida residents returned to the familiar ritual of assessing hurricane damage Thursday, the day after Milton smashed through many coastal communities and spawned a barrage of tornadoes … ",
    "url": "https://apnews.com/article/hurricane-milton-tampa-florida-5f6a112986eb6e21720f0f17c504afe8"
  },
  {
    "text": "Federal judges decline to extend voter registration deadline in Georgia and Florida as states face hurricane damage  —  Two federal judges have rejected requests to immediately reopen voter registration in Georgia and Florida as the southeast continues to grapple with significant storm damage ahead of the November election.",
    "url": "https://www.cnn.com/2024/10/10/politics/georgia-florida-voter-registration-deadlines"
  },
  {
    "text": "Plane with banner telling Trump to watch ‘The Apprentice’ flies near Pennsylvania rally  —  The distribution company behind the movie “The Apprentice” promoted the controversial film outside former President Trump's rally on Wednesday, flying a plane carrying a banner that urged the GOP nominee … ",
    "url": "https://thehill.com/blogs/in-the-know/4927482-plane-banner-trump-apprentice-movie/"
  },
  {
    "text": "Marshawn Lynch hints at run for Oakland mayor  —  The former NFL and Cal Berkeley star hinted at a run on his podcast with Gavin Newsom and Doug Hendrickson.  —  Marshawn Lynch, the former star NFL running back and Super Bowl champ, hinted at a possible run for mayor of Oakland on the podcast … ",
    "url": "https://www.politico.com/news/2024/10/10/marshawn-lynch-oakland-mayor-00183302"
  },
  {
    "text": "GOP Rep. Lori Chavez-DeRemer Says She Didn't Support 6-Week Abortion Ban She Supported  —  The Oregon Republican is disputing something that's ... right there in plain sight.  —  LOADING  —  WASHINGTON ― Rep. Lori Chavez-DeRemer (R-Ore.) is in one of the most closely watched congressional races … ",
    "url": "https://www.huffpost.com/entry/lori-chavez-deremer-six-week-abortion-ban_n_6707f441e4b047df57070601"
  },
  {
    "text": "Cards Against Humanity to pay swing-state non-voters to make a plan to vote  —  Cards Against Humanity (CAH) is jumping into the 2024 White House election by offering to pay blue-leaning non-voters in swing states to create a plan to vote.  —  The company behind the popular card game rolled … ",
    "url": "https://thehill.com/homenews/campaign/4927786-cards-against-humanity-to-pay-swing-state-non-voters-to-make-a-plan-to-vote/"
  },
  {
    "text": "Jim Jordan warns FTC to back off suing car dealer accused of overcharging Latinos  —  House Judiciary Committee chairman Jim Jordan (R-OH) fired off a warning shot at Federal Trade Commission chair Lina Khan, according to the New York Post: stop investigating civil rights matters.",
    "url": "https://www.rawstory.com/jim-jordan-2669376570/"
  },
  {
    "text": "CRINGE VIDEO: Gretchen Whitmer, in a Camo Harris-Walz Cap, Feeds Doritos to a Woman on Her Knees  —  It used to be that we had somewhat serious people in elected office, or at least they hid their foibles somewhat, knowing the importance of being respected and having respect for their office.",
    "url": "https://redstate.com/jenvanlaar/2024/10/10/cringe-video-gretchen-whitmer-in-a-camo-harris-walz-cap-feeds-doritos-to-a-woman-on-her-knees-n2180397"
  },
  {
    "text": "Republican Farmers Featured in Harris Ad Are Not Actors, Not Democrats  —  Este artículo estará disponible en español en El Tiempo Latino.  —  Quick Take  —  An ad from Vice President Kamala Harris features a Pennsylvania farming couple who say they are “lifelong Republicans” but are voting for Harris.",
    "url": "https://www.factcheck.org/2024/10/republican-farmers-featured-in-harris-ad-are-not-actors-not-democrats/"
  },
  {
    "text": "The Polls *Are Not* Underestimating Trump This Time  —  We have good data on his ceiling.  He's already near it.  —  ∙ Paid  —  1. No Fear  —  One of the persistent concerns about the race is that in 2016 and 2020, polling somewhat underestimated Donald Trump's final vote share.",
    "url": "https://www.thebulwark.com/p/the-polls-are-not-underestimating"
  },
  {
    "text": "Trump Says He Was ‘Man of the Year.’ His Source Says It Isn't True.  —  Fact-checkers have found no evidence over the years that former President Donald J. Trump once received the honor in Michigan.  —  Former President Donald J. Trump expressed irritation on Thursday that anyone would challenge … ",
    "url": "https://www.nytimes.com/2024/10/10/us/politics/trump-man-of-year.html"
  },
  {
    "text": "When Populists Rise, Economies Usually Fall  —  Summary.  —  Business leaders are quick to abhor left-wing populism, with its government giveaways to supporters, spending on boondoggle projects, and disregard for financial discipline and investor confidence.",
    "url": "https://hbr.org/2024/10/when-populists-rise-economies-often-fall"
  },
  {
    "text": "A lost Trump interview comes back to life  —  The yet-to-be-president holds forth on strength, friendship, dealmaking, public service and building violations.  —  One evening in February 1989, my Watergate reporting partner Carl Bernstein bumped into Donald Trump at a dinner party in New York.",
    "url": "https://www.washingtonpost.com/opinions/interactive/2024/bob-woodward-trump-interview-1989/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4NTMyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5OTE1MTk5LCJpYXQiOjE3Mjg1MzI4MDAsImp0aSI6ImQ3MjQ5MzMyLTczYjEtNDVhOC1iZTIyLTI0NjQ3ZmQ1YjU4YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy9pbnRlcmFjdGl2ZS8yMDI0L2JvYi13b29kd2FyZC10cnVtcC1pbnRlcnZpZXctMTk4OS8ifQ.e9mjXnR1ROXrG3WYx-E7DD0zgfYId1rsB4pL33_gHZ8&itid=gfta"
  },
  {
    "text": "Judge agrees to unseal additional filings from Jan. 6 case as Trump signals challenge  —  U.S. District Judge Tanya Chutkan on Thursday agreed to unseal additional filings from Special Counsel Jack Smith laying out his election interference case against former President Trump, something Trump's attorneys signaled they plan to challenge.",
    "url": "https://thehill.com/regulation/court-battles/4927545-trump-election-interference-case/"
  },
  {
    "text": "Major papers are giving Trump's Jan. 6 indictment dramatically less attention than they did Clinton's server  —  RESEARCH CONTRIBUTIONS FROM ROB SAVILLO & HARRISON RAY … After months of right-wing caterwauling that Clinton's email use constituted a criminal scheme, Comey announced … ",
    "url": "https://www.mediamatters.org/new-york-times/major-papers-are-giving-trumps-jan-6-indictment-dramatically-less-attention-they-did"
  }
]