[
  {
    "text": "The Supreme Court Put Nationwide Injunctions to the Torch  —  That isn't the disaster for birthright citizenship that some fear.  —  Yesterday, in a 6-3 decision in Trump v. Casa, the United States Supreme Court sided with the Trump administration in a case involving an executive order … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/supreme-court-trump-injunctions/683354/?gift=c04SMsUDu_5IHrILqcoSg28sKQdP6i7Erpt87QNMVVo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump says he will move aggressively to undo nationwide blocks on his agenda  —  Emboldened by Friday's U.S. Supreme Court ruling, the president said his administration will flex its authority on issues ranging from immigration to higher education.  —  Summary3",
    "url": "https://www.washingtonpost.com/politics/2025/06/28/trump-nationwide-inunctions-supreme-court-ruling/"
  },
  {
    "text": "Senate Judiciary's updated megabill text omits provision limiting judicial powers  —  The Senate Judiciary Committee released its updated text for Trump's “big, beautiful bill” late Friday night, which omitted some provisions that Democrats had sought to strip from the bill.",
    "url": "https://www.politico.com/live-updates/2025/06/27/congress/senate-judiciary-updated-megabill-text-judicial-powers-00430646"
  },
  {
    "text": "SCOTUS conservatives end “universal injunctions” in birthright citizenship cases  —  Justice Barrett wrote the 6-3 decision that created more complications than it provided answers.  Stark dissents questioned the ruling's effect on the rule of law.  —  On Friday morning … ",
    "url": "https://www.lawdork.com/p/scotus-conservatives-end-universal"
  },
  {
    "text": "Senate Blocks War Powers Resolution to Limit Trump's Ability to Strike Iran Again  —  The vote against the measure was mostly along party lines, with Republicans opposing it and Democrats almost unanimously in favor.  —  The Senate on Friday blocked a Democratic resolution … ",
    "url": "https://www.nytimes.com/2025/06/27/us/politics/trump-war-powers-iran-strike.html"
  },
  {
    "text": "Playbook: Republicans ready to floor it on the megabill  —  With help from Eli Okun, Bethany Irvine and Ali Bianco  —  Good Saturday morning.  This is Garrett Ross in the driver's seat.  Let me know what's going on.  —  POD RAVE AMERICA: President Donald Trump has UFC CEO Dana White … ",
    "url": "https://www.politico.com/newsletters/playbook/2025/06/28/republicans-ready-to-floor-it-on-the-megabill-00430939"
  },
  {
    "text": "Senate GOP adds SNAP waivers for Alaska, Hawaii in new megabill text  —  Alaska and Hawaii could be temporarily exempted from paying for some costs of the nation's largest anti-hunger program after last-minute negotiating from lawmakers, according to Senate Republicans' new megabill text.",
    "url": "https://www.politico.com/live-updates/2025/06/28/congress/senate-gop-snap-waivers-alaska-hawaii-megabill-00430999"
  },
  {
    "text": "Senate Republicans make steep cuts to wind and solar in updated megabill text  —  Senate Republicans released updated megabill text late Friday that would make sharp cuts to the Inflation Reduction Act's solar and wind tax credits after a late-stage push by President Donald Trump to crack down further on the incentives.",
    "url": "https://www.politico.com/live-updates/2025/06/28/congress/senate-republicans-make-steep-cuts-to-wind-and-solar-in-updated-megabill-text-00430686"
  },
  {
    "text": "Senate Republicans remove pension overhaul provisions from megabill text  —  Senate Republicans stripped provisions aimed at overhauling the federal government's pension program from their policy megabill, according to new text released Friday night.  The Senate Homeland Security … ",
    "url": "https://www.politico.com/live-updates/2025/06/28/congress/senate-gop-removes-pension-overhaul-from-megabill-00430853"
  },
  {
    "text": "Justice Department abruptly fires 3 prosecutors involved in Jan. 6 criminal cases, AP sources say  —  The Justice Department on Friday fired at least three prosecutors involved in U.S. Capitol riot criminal cases, the latest moves by the Trump administration targeting attorneys connected … ",
    "url": "https://apnews.com/article/jan-6-prosecutions-capitol-riot-trump-bondi-1107441a68cef171dfff4e680e438452"
  },
  {
    "text": "Republican Rep. Don Bacon to Announce Retirement from Congress  —  Bacon's formal announcement that he is retiring from Congress is expected next week.  — Copy  —  Republican Rep. Don Bacon of Nebraska will not seek re-election next year, according to four sources familiar with the situation … ",
    "url": "https://www.notus.org/republicans/don-bacon-retirement"
  },
  {
    "text": "Eric Trump suggests he could run for president when his father's term ends  —  Forty-one-year-old has stayed away from politics, but says ‘political path would be an easy one’ if he chose to pursue it  —  Eric Trump has hinted that he or another of the Trump family could run for president … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/28/eric-trump-suggests-he-could-run-for-president-when-donald-term-ends"
  },
  {
    "text": "Morale craters at State Department as mass layoffs loom  —  Secretary of State Marco Rubio has called the agency “bloated,” yet as violence spiked in the Middle East, staff say they've been asked to work extra hours.  —  The Trump administration's plan for mass layoffs at the State Department … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/28/state-department-layoffs-trump-rubio/"
  },
  {
    "text": "Award-Winning Journalist Arrested and Charged with Possession of Child Pornography  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  WASHINGTON - Thomas Pham LeGro, 48, made his first appearance today in U.S. District Court for allegedly possessing child pornography.",
    "url": "https://www.justice.gov/usao-dc/pr/award-winning-journalist-arrested-and-charged-possession-child-pornography"
  },
  {
    "text": "DOGE loses control over government grants website, freeing up billions  —  The DOGE team's loss of control is the latest sign of its declining influence following Elon Musk's departure from Washington.  —  The U.S. DOGE Service has lost the power to control the government's process … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/27/doge-loses-control-federal-grants/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwOTk2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyMzc5MTk5LCJpYXQiOjE3NTA5OTY4MDAsImp0aSI6Ijg5MDBiZTk1LTc0ODktNGUyMC1iNmY0LTZjOWZhNGFmODNlMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzI3L2RvZ2UtbG9zZXMtY29udHJvbC1mZWRlcmFsLWdyYW50cy8ifQ.Sd0lvhogISrMbsfmJpF3BJJZwMZe82DlkqnlEq2e8Kg&itid=gfta"
  },
  {
    "text": "Judge blocks Trump order targeting law firm tied to Fox News, Dominion settlement  —  A federal judge on Friday blocked the Trump administration from implementing an executive order targeting Susman Godfrey, the law firm that represented Dominion Voting Systems in its lawsuit with Fox News … ",
    "url": "https://thehill.com/regulation/court-battles/5374913-donald-trump-executive-order-susman-godfrey-blocked/"
  },
  {
    "text": "Tuberville says ‘inner city rats’ live off the American taxpayers: Trump should send them ‘back home’  —  Alabama U.S. Sen. Tommy Tuberville says President Donald Trump should defund major American cities where leadership is “godawful.”  —  Tuberville appeared on The Benny Show with Benny Johnson … ",
    "url": "https://www.al.com/politics/2025/06/tuberville-says-inner-city-rats-live-off-the-american-taxpayers-trump-should-send-them-back-home.html"
  },
  {
    "text": "DHS ends deportation protection for Haitians, says Haiti is ‘safe’  —  DHS Secretary Kristi Noem said allowing Haitians to stay in the country was against the “national interest.”  —  The Trump administration announced an end to temporary legal protections for Haitian migrants in the United States … ",
    "url": "https://www.washingtonpost.com/immigration/2025/06/28/haiti-dhs-tps-temporary-protected-status/"
  },
  {
    "text": "Behind the Curtain: Unprecedented new precedents … - Presidents can limit the classified information they share with lawmakers after bombing a foreign country without the approval of Congress.  — Presidents can usurp Congress's power to levy tariffs, provided they declare a national emergency.",
    "url": "https://www.axios.com/2025/06/28/trump-precedents-executive-power"
  },
  {
    "text": "South Korea police detain six Americans trying to send cash, rice to North Korea  —  South Korean police have detained six U.S. citizens who were attempting to deliver around 1,300 plastic bottles filled with rice, dollar notes and Bibles to North Korea, a police official said on Friday.",
    "url": "https://www.reuters.com/world/asia-pacific/south-korea-police-detain-six-americans-trying-send-cash-rice-north-korea-2025-06-27/"
  }
]