[
  {
    "text": "Can the GOP ever come to grips with the lies of 2020?  —  Mike Johnson's election, and the process getting there, showed a party not willing to address the fundamental question facing it.  —  Rep. Mike Johnson (R-La.) was hours away from winning the speakership when a reporter asked … ",
    "url": "https://www.politico.com/news/2023/10/26/donald-trump-january-6-mike-johnson-00123714"
  },
  {
    "text": "And the Winner Is...  “If you don't think that moving from Kevin McCarthy to MAGA Mike Johnson shows the ascendance of this movement and where the power in the Republican Party truly lies, then you're not paying attention,” — Matt Gaetz to Steve Bannon Wednesday morning.  —  And of course, he was right.",
    "url": "https://plus.thebulwark.com/p/and-the-winner-is"
  },
  {
    "text": "The inmates elect their new asylum leader  —  Also: Bellingcat's Eliot Higgins on the golden age of Twitter disinformation.  —  ∙ Paid … The latter part of this newsletter features a Q&A with Bellingcat's Eliot Higgins.  But before we get to that, I want to share some quick thoughts on the new House speaker.",
    "url": "https://www.publicnotice.co/p/speaker-maga-mike-johnson-explained"
  },
  {
    "text": "Playbook: What's in store for Speaker Johnson  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  LATEST IN MAINE — Lewiston Sun Journal: “At least 16 people were killed and dozens more injured in multiple shootings here Wednesday night, in what is likely the deadliest shooting in Maine's history.”",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/26/whats-in-store-for-speaker-johnson-00123692"
  },
  {
    "text": "Republican Speaker Nominee Mike Johnson Has a Plan to Avoid a November Shutdown  —  House Republican speaker nominee Mike Johnson is working to convince ultraconservatives to avert a Nov. 18 government shutdown, a signal that even hardliners in the GOP may be willing to compromise on a short-term spending deal.",
    "url": "https://www.bloomberg.com/news/articles/2023-10-25/gop-speaker-nominee-johnson-has-plan-to-avoid-november-shutdown"
  },
  {
    "text": "Before Mike Johnson Was Speaker, He Was Blaming Abortion for School Shootings  —  What is it about Representative Mike Johnson that ended Republicans' spasms of disunity, electing him Speaker of the House on Wednesday?  The initial response was befuddlement, a collective who?",
    "url": "https://nymag.com/intelligencer/2023/10/mike-johnson-abortion-school-shootings.html"
  },
  {
    "text": "What everyone should know about the new House Speaker, Mike Johnson  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  On Wednesday, after weeks of chaos, House Republicans unanimously selected Congressman Mike Johnson (R-LA) as the new Speaker.  Compared to the previous Republican candidates … ",
    "url": "https://popular.info/p/what-everyone-should-know-about-the"
  },
  {
    "text": "Colo. judge rejects Trump's bid to toss lawsuit aimed at keeping him off 2024 ballot  —  The lawsuit seeks to bar the former president from the state's 2024 ballot over his connection to the Jan. 6, 2021, riot at the U.S. Capitol.  —  A Colorado judge on Wednesday denied the latest attempt … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/colo-judge-rejects-trumps-bid-toss-lawsuit-aimed-keeping-2024-ballot-rcna122281"
  },
  {
    "text": "Special counsel urges court to reimpose Trump gag order in election interference case  —  Special counsel Jack Smith is urging a federal judge to reimpose the partial gag order on Donald Trump in his federal election interference case, arguing that the former president continues to try … ",
    "url": "https://www.npr.org/2023/10/26/1208777351/trump-gag-order-jan-6-case-smith-special-counsel"
  },
  {
    "text": "Robert Card: What we know about Maine shooting person of interest  —  Maine police have identified a person of interest in the mass shootings across the state Wednesday night that left at least 18 dead and dozens injured.  —  The Lewiston Maine Police Department identified 40-year-old Robert Card as a … ",
    "url": "https://www.washingtonexaminer.com/news/robert-card-maine-shooting-person-of-interest"
  },
  {
    "text": "At least 16 dead, dozens wounded in Lewiston shootings; police give few details on overnight search for gunman  —  A commercial man lift falls off trailer and blocks Route 4 in Rangeley  —  Hundreds of new laws take effect in Maine Wednesday.  Here's what you need to know",
    "url": "https://www.sunjournal.com/2023/10/25/multiple-victims-reported-following-shootings-in-lewiston/"
  },
  {
    "text": "Mitt Romney is the fixed point revealing the Republicans' slide  —  A new biography shows how far that slide has gone  —  So a politician in the evening of his career, with a vast family, a rich spiritual life and great wealth to fall back upon, summoned the nerve to declare … ",
    "url": "https://www.economist.com/united-states/2023/10/26/mitt-romney-is-the-fixed-point-revealing-the-republicans-slide"
  },
  {
    "text": "Bowman pleads guilty to misdemeanor for pulling fire alarm in House office building  —  Rep. Jamaal Bowman (D-N.Y.) pleaded guilty to one misdemeanor for falsely pulling a fire alarm in the Cannon House Office Building last month ahead of a key House vote.  —  Bowman appeared … ",
    "url": "https://thehill.com/regulation/court-battles/4276452-bowman-pleads-guilty-to-misdemeanor-for-pulling-fire-alarm-in-house-office-building/"
  },
  {
    "text": "Texas House passes three immigration bills after contentious night of debate  —  Democrats fumed when Republicans tried to block more amendments on a bill that would create a new state crime for illegally crossing the border into Texas.  —  Editor's note: This story contains explicit language.",
    "url": "https://www.texastribune.org/2023/10/25/texas-legislature-house-immigration-bills/"
  },
  {
    "text": "U.S. economy grows at blockbuster pace in third quarter  —  GDP grew at an annual rate of 4.9 percent from July to September, the highest reading since 2021  —  The U.S. economy grew by an annual rate of 4.9 percent in the third quarter, the strongest pace since 2021, as spending … ",
    "url": "https://www.washingtonpost.com/business/2023/10/26/gdp-third-quarter-economy-growth/"
  },
  {
    "text": "Democrats' Rating of Biden Slips; Overall Approval at 37%  —  WASHINGTON, D.C. — President Joe Biden's job approval rating among Democrats has tumbled 11 percentage points in the past month to 75%, the worst reading of his presidency from his own party.  This drop has pushed his overall approval rating … ",
    "url": "https://news.gallup.com/poll/513305/democrats-ratings-biden-slip-overall-approval.aspx"
  },
  {
    "text": "Statement from President Joe Biden on the Shooting in Lewiston, Maine  —  Once again, our nation is in mourning after yet another senseless and tragic mass shooting.  Today, Jill and I are praying for the Americans who've lost their lives, for those still in critical care, and for the families … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/10/26/statement-from-president-joe-biden-on-the-shooting-in-lewiston-maine/"
  }
]