[
  {
    "text": "Texas Reopens the Gerrymander Wars  —  Congress could limit the mutual assured political destruction as partisans move to redistrict more than once a decade.  —  Dozens of Texas Democrats skedaddled on Sunday, fleeing the state to prevent Republicans from passing a new U.S. House map that's intended … ",
    "url": "https://www.wsj.com/opinion/texas-gerrymandering-house-seats-democrats-republicans-congress-f1514f89?st=TmFT9z&reflink=article_copyURL_share"
  },
  {
    "text": "Texas House votes to issue arrest warrants for Democrats who left state to block congressional redistricting  —  The warrants apply only within state lines, making them largely symbolic as most of the legislators in question decamped to Illinois, New York and Massachusetts.",
    "url": "https://www.texastribune.org/2025/08/04/texas-democrats-house-warrants-arrest-quorum-break/"
  },
  {
    "text": "GOP effort forms to shut down Texas vs. California redistricting war … - The bill would “stop a damaging redistricting war from breaking out across the country,” Kiley said in a press release previewing the measure.  — Rep. Don Bacon (R-Neb.), who previously told Axios he is uneasy … ",
    "url": "https://www.axios.com/2025/08/04/california-texas-redistricting-newsom-abbott"
  },
  {
    "text": "Trump “happy to hear” DOJ launched grand jury probe of Obama officials  —  President Trump on Tuesday said he was “happy to hear” that Attorney General Pam Bondi directed federal prosecutors to launch a grand jury probe into the Obama administration's handling of the investigation into Russia's involvement in the 2016 election.",
    "url": "https://www.axios.com/2025/08/05/trump-obama-russia-bondi-grand-jury"
  },
  {
    "text": "DOJ launching grand jury investigation into Russiagate conspiracy allegations  —  Pam Bondi acts on Tulsi Gabbard's criminal referral claiming intelligence community suppression  —  EXCLUSIVE: Attorney General Pam Bondi directed her staff Monday to act on the criminal referral from Director … ",
    "url": "https://www.foxnews.com/politics/doj-launching-grand-jury-investigation-russiagate-conspiracy-allegations"
  },
  {
    "text": "Duffy to announce nuclear reactor on the moon … President Donald Trump named Duffy as interim administrator in July after abruptly withdrawing the nomination of billionaire Jared Isaacman amid a spat with the nominee's ally, Elon Musk.  —  Duffy also offered a directive to more quickly replace … ",
    "url": "https://www.politico.com/news/2025/08/04/nasa-china-space-station-duffy-directives-00492172"
  },
  {
    "text": "Trump administration debating releasing transcript of Ghislaine Maxwell interview with DOJ, sources say  —  The Justice Department has an audio recording of the interview it conducted with Jeffrey Epstein associate Ghislaine Maxwell last month, and the administration is considering releasing … ",
    "url": "https://cnn.com/2025/08/05/politics/trump-blanche-epstein-maxwell-interview-transcript"
  },
  {
    "text": "White House Preps Order to Punish Banks That Discriminate Against Conservatives  —  The president is expected to sign an executive order as soon as this week that targets so-called debanking of businesses including crypto companies  —  The White House is preparing to step up pressure … ",
    "url": "https://www.wsj.com/finance/regulation/white-house-preps-order-to-punish-banks-that-discriminate-against-conservatives-8af18854?st=jrSrHp"
  },
  {
    "text": "MTG asks Trump to pardon George Santos … “George Santos has taken responsibility.  He's shown remorse.  It's time to correct this injustice,” Greene said on X.  —  Santos, who pleaded guilty in April and reported to federal prison in New Jersey on July 25, became a household name shortly … ",
    "url": "https://www.politico.com/news/2025/08/04/mtg-asks-trump-to-pardon-george-santos-00493507"
  },
  {
    "text": "Donald Trump rules out Scott Bessent for Federal Reserve chair  —  President says US Treasury secretary took his name out of consideration  —  Donald Trump has ruled out appointing Treasury secretary Scott Bessent to the Federal Reserve, as he narrows the list of candidates to lead the US central bank.",
    "url": "https://www.ft.com/content/2a6d5b89-9f22-4edf-a3ce-d27e892853b9"
  },
  {
    "text": "After Trump's Firing of BLS Commissioner, Republicans Fall in Line With His Criticism  —  President Trump's decision to fire the head of the Bureau of Labor Statistics forced his allies into the awkward spot of criticizing an agency they had freely cited in the past.",
    "url": "https://www.nytimes.com/2025/08/04/us/politics/trump-republicans-bls-jobs-analysis.html"
  },
  {
    "text": "National Park Service to restore and reinstall Albert Pike statue  —  WASHINGTON - The National Park Service announced today that it will restore and reinstall the bronze statue of Albert Pike, which was toppled and vandalized during riots in June 2020.  The restoration aligns … ",
    "url": "https://www.nps.gov/nama/learn/news/pike.htm"
  },
  {
    "text": "A Look Inside Jeffrey Epstein's Manhattan Lair … A sculpture of a bride clinging to a rope dangled in a central atrium of Jeffrey Epstein's mansion.  —  As a gift for Jeffrey Epstein's 63rd birthday, friends sent letters in tribute to the wealthy financier and convicted sex offender.",
    "url": "https://www.nytimes.com/2025/08/05/us/jeffrey-epstein-mansion-photos.html?unlocked_article_code=1.b08.dOob.ioSkJfE1u_Fc&smid=url-share"
  },
  {
    "text": "New non-profit law firm in DC aims to challenge Trump's executive power  —  A group of well-known Washington lawyers is opening a law firm focused on challenging President Donald Trump's executive orders and agency actions as he strives to dramatically reshape the federal government during his second term.",
    "url": "https://cnn.com/2025/08/04/politics/washington-litigation-group-trump-executive-power"
  },
  {
    "text": "Brazil Supreme Court orders house arrest of ex-president Bolsonaro  —  Brazil's Supreme Court ordered the house arrest of former President Jair Bolsonaro on Monday as he awaits trial over an alleged coup plot to overturn his 2022 election loss, which the Trump ally denies.",
    "url": "https://www.axios.com/2025/08/04/brazil-bolsonaro-house-arrest-supreme-court"
  },
  {
    "text": "Epstein Was Still a Member of Trump's Mar-a-Lago Long After He Was Indicted  —  IN THE CLUB  —  Trump claims he got rid of Epstein for “stealing” his staff.  But club records raise new questions.  —  EXCLUSIVE  —  Jeffrey Epstein continued to be a member of Donald Trump's luxury private members club … ",
    "url": "https://www.thedailybeast.com/epstein-stayed-a-member-of-trumps-mar-a-lago-long-after-he-was-indicted/"
  },
  {
    "text": "Trump's Deal-Making With Other Elite Schools Scrambles Harvard Negotiations  —  The university was open to spending $500 million, but a $50 million settlement with Brown has prompted new debates in Cambridge.  —  By the start of last week, Harvard University had signaled its readiness … ",
    "url": "https://www.nytimes.com/2025/08/04/us/politics/harvard-trump-brown.html"
  },
  {
    "text": "Purdue student detained by ICE released after stay in troubled Louisiana holding facility  —  Yeonsoo Go, 20, was detained after her immigration hearing in Manhattan and taken away by ICE agents. … WEST LAFAYETTE, Ind. — A 20-year-old Purdue University student who was detained by Immigration … ",
    "url": "https://www.wthr.com/article/news/politics/national-politics/purdue-student-detained-by-ice-and-taken-to-louisiana-holding-facility-yeonsoo-go-immigration-south-korea-pharmacy-episcopal-customs-enforecment-visa/531-87482652-6ea4-4ff9-9d7a-d60c34869820"
  },
  {
    "text": "Public schools are closing as Arizona's school voucher program soars  —  Arizona, with a marketplace of school options, offers a window into the GOP vision for K-12 education  —  PHOENIX — The party at John R. Davis Elementary School was in full swing, but at the snow cone station, the school's librarian was in tears.",
    "url": "https://www.washingtonpost.com/education/2025/08/05/arizona-public-school-closures-voucher-program/"
  },
  {
    "text": "Pope Leo Most Favorably Viewed of 14 Newsmakers  —  WASHINGTON, D.C. — Among 14 prominent U.S. and global figures, Pope Leo XIV has the most positive image by far, with many more Americans viewing him favorably than unfavorably.  His 57% favorable rating and 11% unfavorable rating result … ",
    "url": "https://news.gallup.com/poll/693155/pope-leo-favorably-viewed-newsmakers.aspx"
  },
  {
    "text": "Black Hawk pilot launches challenge to battleground House Republican Nick LaLota … “My entire life's been kind of grounded in service,” Gallant told POLITICO in an interview.  “I've always placed the mission first throughout all of my careers, and I'm doing the same now.",
    "url": "https://www.politico.com/news/2025/08/05/gallant-lalota-long-island-00493460"
  },
  {
    "text": "Inside Trump's New Tactic to Separate Immigrant Families … Evgeny and Evgeniia, who fled their native Russia to seek political asylum, have been separated from their 8-year-old son, Maksim, since May.The New York Times  —  Evgeny and Evgeniia faced an excruciating choice.",
    "url": "https://www.nytimes.com/2025/08/05/us/politics/trump-administration-family-separation.html"
  },
  {
    "text": "Netanyahu decides on full occupation of Gaza Strip, IDF activity in areas with hostages, PMO says  —  An Israeli official told the ‘Post’ that Netanyahu will convene a meeting on Gaza and a hostage deal, noting that “the prime minister is considering all available options regarding next steps.",
    "url": "https://www.jpost.com/israel-news/article-863225"
  },
  {
    "text": "A Maine Woman Paid Her Back Rent.  Her Record Still Says She Was Evicted.  —  Repayment plans are supposed to help public housing tenants avoid eviction.  In Maine, these deals have put evictions on their permanent records, even if they've fulfilled all the terms and were never actually evicted.",
    "url": "https://www.propublica.org/article/maine-public-housing-eviction-repayment-agreements"
  },
  {
    "text": "Comer subpoenas the Clintons, Trump's DOJ in House Oversight's Epstein probe  —  Others subpoenaed Tuesday include former FBI directors and attorneys general  —  FIRST ON FOX: The House Oversight Committee has subpoenaed former President Bill Clinton and former Secretary of State Hillary Clinton … ",
    "url": "https://www.foxnews.com/politics/comer-subpoenas-clintons-trumps-doj-house-oversights-epstein-probe"
  },
  {
    "text": "Almost 90% Of Americans Are Worried About The Cost Of Groceries  —  Topline  —  Almost 90% of American adults say they're stressed about the cost of groceries, a new poll out Monday shows, as the price of food rises and items like poultry, ground beef and eggs see the biggest cost jumps.",
    "url": "https://www.forbes.com/sites/maryroeloffs/2025/08/04/almost-90-of-americans-are-worried-about-the-cost-of-groceries/"
  },
  {
    "text": "How Corey Lewandowski's power at the Department of Homeland Security keeps growing  —  As Homeland Security Secretary Kristi Noem jetted across South America last week, there was one familiar face from President Donald Trump's orbit frequently at her side: Corey Lewandowski.",
    "url": "https://cnn.com/2025/08/05/politics/corey-lewandowski-growing-power-dhs"
  },
  {
    "text": "Inside Laura Loomer's rise: ‘Obsessive’ research, Oval Office visits  —  Laura Loomer has leveraged a personality that friends label “obsessive” and an extreme loyalty to Trump to emerge as a powerful figure in the president's orbit.  —  Just now  —  Laura Loomer's application … ",
    "url": "https://www.washingtonpost.com/politics/2025/08/05/loomer-trump-influence/"
  },
  {
    "text": "Rwanda Agrees to Accept 250 Migrants as Part of Trump Deportation Plan  —  The country is the latest African nation to agree to take in migrants from the United States.  —  Rwanda has agreed to accept 250 deportees from the United States, a Rwandan government spokeswoman said on Tuesday … ",
    "url": "https://www.nytimes.com/2025/08/05/world/africa/rwanda-trump-deportees.html"
  },
  {
    "text": "Trump, Murdoch agree to delay deposition in WSJ libel lawsuit  —  Attorneys for President Trump and Rupert Murdoch have agreed to delay a deposition Trump's team wants the media mogul to sit for as part of the president's lawsuit against The Wall Street Journal.",
    "url": "https://thehill.com/homenews/media/5436298-murdoch-trump-legal-battle/"
  },
  {
    "text": "Donald Trump Doubles Down on Mathematically Impossible Drug Price Cuts  —  President Donald Trump has doubled down on his claim of reducing drug prices by amounts that are mathematically impossible.  —  Trump told reporters on Sunday that his administration had cut the price of some prescription drugs by as much as 1,500 percent.",
    "url": "https://www.newsweek.com/donald-trump-doubles-down-impossible-drug-price-cuts-2108365"
  },
  {
    "text": "Trump's White House Renovation Is Awful—and Fitting  —  ON A SUNNY MORNING IN MAY 1984, I reported for a job as First Lady Nancy Reagan's speechwriter.  I drove my Toyota Corolla up to the Ellipse, careful to display the special tag permitting me to park quite close to the East Wing … ",
    "url": "https://www.thebulwark.com/p/trump-white-house-renovation-awful-fitting-architecture-ballroom"
  },
  {
    "text": "Judge halts Arkansas law mandating Ten Commandments display in classrooms in the largest school districts  —  A federal judge on Monday decided to halt an Arkansas law that mandated the display of the Ten Commandments in public school classrooms, barring four of the state's largest school districts … ",
    "url": "https://www.washingtonexaminer.com/news/3491046/judge-halts-arkansas-law-mandating-ten-commandments-display-classrooms/"
  }
]