[
  {
    "text": "Trump escalates gendered personal insults against Harris, defying GOP pressure  —  The Republican nominee also stoked Democrats' rift over Israel by baselessly claiming Harris passed over Gov. Josh Shapiro to be her running mate because he is Jewish.  —  WILKES-BARRE, Pa. … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/17/trump-harris-presidential/"
  },
  {
    "text": "Democrats still might invoke the 25th Amendment to make Harris president  —  Politics aside, it's understandable that some now view President Joe Biden as a “broken man,” walking alone in a deep valley of depression, confusion and anger.  One day he is declaring that he is the Democratic nominee … ",
    "url": "https://thehill.com/opinion/campaign/4831471-democrats-might-invoke-the-25th-amendment-to-make-harris-president/"
  },
  {
    "text": "Harris Puts Four Sun Belt States Back in Play, Times/Siena Polls Find  —  Kamala Harris and Donald Trump are in close races across Arizona, Georgia, Nevada and North Carolina, crucial swing states that Mr. Trump had seemed en route to run away with just a few weeks ago.",
    "url": "https://www.nytimes.com/2024/08/17/us/elections/kamala-harris-trump-az-nc-ga-nv.html?unlocked_article_code=1.Dk4.h1jB.r4PD8EvalJH3&smid=url-share"
  },
  {
    "text": "Trump tries to undermine Harris' legitimacy as a candidate  —  “Why is she going to the convention?  Because it's a rigged convention, obviously,” he said.  —  For former President Donald Trump, the 2024 race is a contest between him and Vice President Kamala Harris.  And President Joe Biden.",
    "url": "https://www.politico.com/news/2024/08/17/trump-rally-pennsylvania-kamala-harris-rigged-00174502"
  },
  {
    "text": "Trump campaign attempts to reset with candidate who sometimes has his own plans  —  Kamala Harris's entry into the race has scrambled Donald Trump's plans and revived concerns about whether he can focus his attacks.  —  Donald Trump's top brass gathered reporters in West Palm Beach, Fla. … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/17/trump-campaign-harris/"
  },
  {
    "text": "Election 2024 live updates  —  Trump holding rally in Pennsylvania; Tim Walz spoke in suburban Omaha  —  Former president Donald Trump is campaigning this afternoon in Wilkes-Barre, Pa., about 20 miles from President Joe Biden's birthplace of Scranton.  Minnesota Gov. Tim Walz (D) … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/17/2024-election-campaign-updates-harris-trump/"
  },
  {
    "text": "You Should Know  —  I flagged this on social media.  But I wanted to make sure you knew.  Trump just announced a “crime and safety” rally for next Tuesday in Howell, Michigan, a town that has been heavily associated with the KKK for decades.  Indeed, just late last month White Supremacists marched … ",
    "url": "https://talkingpointsmemo.com/edblog/you-should-know"
  },
  {
    "text": "Mark Robinson, Who Often Calls Abortion Murder: ‘We Had an Abortion’  —  The North Carolina Republican gubernatorial candidate previously said mass shootings were karma for the “murder of infants” … He compared supporters of reproductive rights to people who fought to preserve slavery.",
    "url": "https://www.rollingstone.com/politics/politics-features/mark-robinson-abortion-murder-north-carolina-1235082406/"
  },
  {
    "text": "‘Things I Trust More Than Donald Trump’ List Goes Viral: ‘Dinner with Jeffrey Dahmer’  —  ‘A CASEY ANTHONY DAYCARE’  —  When “The View” co-host Anna Navarro posted the list to her Instagram account, numerous social media users added their own comments.  —  A viral list called … ",
    "url": "https://www.thedailybeast.com/the-view-co-host-anna-navarro-posts-things-i-trust-more-than-donald-trump-list"
  },
  {
    "text": "Keep talking, JD!  Vance's creepy views on ‘females’ are repelling women voters  —  Does Donald Trump's running mate think there is any point to ‘postmenopausal females’ beyond free childcare?  —  JD Vance puts his futon in his mouth again  —  Consider, if you will, the mysterious role of the postmenopausal female.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/aug/17/jd-vance-women"
  },
  {
    "text": "George Santos to plead guilty to multiple charges in fraud case Monday  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/regulation/court-battles/4832761-george-santos-fraud-case-guilty-plea-expected/"
  },
  {
    "text": "Ohio lawmaker: Vance ‘not good for Ohio’ and ‘not good for America’  —  Rep. Joyce Beatty (D-Ohio) went after her fellow Ohioan and current Republican vice presidential nominee, Sen. JD Vance, saying he “is not good for Ohio” in an interview Saturday.  —  “JD Vance is not good for Ohio … ",
    "url": "https://thehill.com/homenews/campaign/4832987-ohio-lawmaker-vance-not-good-for-ohio-and-not-good-for-america/"
  },
  {
    "text": "Armed and Underground: Inside the Turbulent, Secret World of an American Militia  —  This story discusses threats of violence and contains a racial slur.  —  Reporting Highlights  — Militias After Jan. 6: Internal messages reveal how AP3, one of the largest U.S. militias … ",
    "url": "https://www.propublica.org/article/inside-secret-ap3-militia-american-patriots-three-percent"
  },
  {
    "text": "‘Keyboard warrior’ jailed for part in UK disorder  —  A man who posted material on social media to stir up racial hatred during recent unrest across the UK has been jailed for three years.  —  Wayne O'Rourke, who had more than 90,000 followers to his X account, posted misinformation … ",
    "url": "https://www.bbc.com/news/articles/c5y3gre3y9yo"
  },
  {
    "text": "VP Kamala Harris' stepdaughter Ella Emhoff pushes ketamine, ‘shorter work days’ in ‘pain management’ rant  —  Vice President Kamala Harris' stepdaughter, Ella Emhoff, revealed this week that she grew up with a spinal condition that caused a “hunchback” - and suggested using the controversial drug ketamine … ",
    "url": "https://nypost.com/2024/08/17/us-news/vp-kamala-harris-stepdaughter-ella-emhoff-pushes-ketamine-shorter-work-days-in-pain-management-rant/"
  },
  {
    "text": "Experts: Pro-Trump officials could face “severe” punishments if they refuse to certify election  —  “The threat of disruption looms large in this year's election” — but anti-certification efforts likely to backfire  —  Pro-Trump local election officials may try to slow down the certification … ",
    "url": "https://www.salon.com/2024/08/17/experts-pro-officials-could-face-severe-punishments-if-they-refuse-to-certify/"
  },
  {
    "text": "Election Countdown, 80 Days to Go: Media Failure Reaches a Turning Point.  —  The tone of American politics may finally be brightening.  Maybe the mainstream press will recognize that a time for change has come for it as well.  —  ∙ Paid  —  This post is about a recent convergence of articles … ",
    "url": "https://fallows.substack.com/p/election-countdown-80-days-to-go"
  },
  {
    "text": "Brutal New Poll for J.D. Vance Reveals a Big Trump-MAGA Weakness  —  No vice presidential running mate in recent memory has been scrutinized in quite the way that J.D. Vance has.  Because he presents himself as an intellectual standard-bearer of the MAGA movement—and has a long trail … ",
    "url": "https://newrepublic.com/article/184978/brutal-new-poll-jd-vance-reveals-big-trump-maga-weakness"
  }
]