[
  {
    "text": "Biden Tells Governors He Needs to Sleep More and Work Less at Night  —  The president's opening remark to a group of key Democratic leaders — that he was in the race to stay — chilled any talk of his withdrawal, participants said.  —  President Biden told a gathering of Democratic governors … ",
    "url": "https://www.nytimes.com/2024/07/04/us/politics/biden-governors.html"
  },
  {
    "text": "Criminal Trump is clearly unfit for office  —  It's been a brutal week for American democracy.  President Joe Biden's surprisingly poor performance in the presidential debate has thrown many in the Democratic Party into full panic mode.  —  In the aftermath of the debate … ",
    "url": "https://www.theframelab.org/unfit-for-office-trump-biden/"
  },
  {
    "text": "The Conspiracy of Silence to Protect Joe Biden  —  The president's mental decline was like a dark family secret for many elite supporters.  —  President Joe Biden walked before a row of flags and took his place at a lectern stamped with the presidential seal.",
    "url": "https://nymag.com/intelligencer/article/conspiracy-of-silence-to-protect-joe-biden.html"
  },
  {
    "text": "Trump Turns Kamala F-Word Rant into Ad: ‘No Tax on Tips’  —  LET'S ROLL  —  The Daily Beast revealed Trump's foulmouthed verdict on his Democratic rival and his possible replacement.  But Trump focused on the tip he gave his caddy.  —  First Donald Trump was caught on video … ",
    "url": "https://www.thedailybeast.com/donald-trump-turns-kamala-harris-f-word-rant-into-campaign-ad-no-tax-on-tips"
  },
  {
    "text": "Behind the Curtain: Kamala Harris' epic edge … - Rep. Bennie Thompson (D-Miss.), who chaired the House Jan. 6 committee, told Axios' Hans Nichols that Harris is “incredibly strong ... You can't say Biden has done a good job without saying she's done a good job.” … Of course, all this may take a while.",
    "url": "https://www.axios.com/2024/07/04/kamala-harris-replace-biden-2024-election"
  },
  {
    "text": "If Joe Biden Were as Ruthless About Immunity as Donald Trump ...  Picture if you can, imagine if you will, this Oval Office address by President Biden:  —  Good evening, my fellow Americans.  With the close of the current session of the Supreme Court, I want to report to you on my compliance … ",
    "url": "https://newrepublic.com/article/183422/joe-biden-ruthless-immunity-donald-trump"
  },
  {
    "text": "Strongman, Weak State  —  The dispiriting vision of American governance offered by the Roberts Court  —  The hinges of history, the moments that determine the shape of our world, are usually only obvious in retrospect.  Sometimes, dramatic political events, like assassinations, announce their own importance.",
    "url": "https://donmoynihan.substack.com/p/strongman-weak-state"
  },
  {
    "text": "Brazilian police indict ex-President Bolsonaro in undeclared diamonds case, sources say  —  Brazil's Federal Police have indicted former President Jair Bolsonaro for money laundering and criminal association in connection with undeclared diamonds the far-right leader received from Saudi Arabia during … ",
    "url": "https://apnews.com/article/bolsonaro-indictment-brazil-money-laundering-e740dfd750f96f02c44b282aa667fea2"
  },
  {
    "text": "‘Bitter old man’: Trump shredded for egocentric and rambling July 4th rant  —  Former President Donald Trump kicked off the Fourth of July with a lengthy screed on Truth Social praising himself and lobbing insults at President Joe Biden and Vice President Kamala Harris … ",
    "url": "https://www.rawstory.com/trump-july-4-2668688196/"
  },
  {
    "text": "State of Tennessee tells U.S. Navy veteran he's not an American citizen and cancels his driver's license  —  NASHVILLE, Tenn. (WTVF) — As we celebrate the nation's birthday and what it means to be an American, a U.S. Navy veteran who has lived in the U.S. for more than seven decades … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/state-of-tennessee-tells-u-s-navy-veteran-hes-not-an-american-citizen-and-cancels-his-drivers-license"
  },
  {
    "text": "COVID-19 can surge throughout the year  —  AT A GLANCE … Summary  —  What CDC knows  —  In the United States, respiratory virus illnesses typically peak during the fall and winter.  These peaks are due to several factors, including human behaviors and environmental conditions … ",
    "url": "https://www.cdc.gov/ncird/whats-new/covid-19-can-surge-throughout-the-year.html"
  },
  {
    "text": "The Supreme Court Has Murdered the Constitution  —  America's founding document is now an all-but-meaningless scrap of paper.  Happy Fourth!  —  Chief Justice John Roberts is seen before the State of the Union address to a joint session of Congress at the Capitol on March 7, 2024.",
    "url": "https://prospect.org/justice/2024-07-04-supreme-court-roberts-murdered-constitution/"
  },
  {
    "text": "Why a New Conservative Brain Trust Is Resettling Across America  —  Pro-Trump professionals aren't just talking about remaking Western civilization.  Some are uprooting their lives to show that they mean it.  —  Fed up by what they see as an increasingly hostile and disordered secular culture … ",
    "url": "https://www.nytimes.com/2024/07/04/us/claremont-institute-trump-conservatives.html"
  },
  {
    "text": "Why Biden must withdraw  —  The president and his party portray themselves as the saviours of democracy.  Their actions say otherwise  —  The presidential debate was awful for Joe Biden, but the cover-up has been worse.  It was agony to watch a befuddled old man struggling to recall words and facts.",
    "url": "https://www.economist.com/leaders/2024/07/04/why-biden-must-withdraw"
  },
  {
    "text": "American Pride Remains Near Record Low  —  Republicans continue to express more pride in the U.S. than Democrats and independents  —  WASHINGTON, D.C. — Two in five Americans, 41%, say they are “extremely proud” to be American, the fifth consecutive year this reading has been in the 38% to 43% range.",
    "url": "https://news.gallup.com/poll/646655/american-pride-remains-near-record-low.aspx"
  }
]