[
  {
    "text": "Playbook: How the push to unseat Johnson could unfold  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT UNION JOE IS READING — “Tennessee workers at VW plant vote to unionize with UAW,” by The Tennessean's Todd Price and Gary Estwick … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/20/how-the-push-to-unseat-johnson-could-unfold-00153483"
  },
  {
    "text": "House to vote on Ukraine, Israel aid bills  —  The House plans to vote Saturday on a $95 billion package of foreign aid bills that would provide funding for Ukraine, Israel and Taiwan, among other priorities.  The bills have moved forward despite a far-right threat to oust House Speaker Mike Johnson (R-La.) if he advances Ukraine aid.",
    "url": "https://www.washingtonpost.com/politics/2024/04/20/house-vote-ukraine-israel-aid-johnson/"
  },
  {
    "text": "House passes foreign aid bills to Israel, Ukraine and Taiwan  —  The House of Representatives has voted to pass roughly a $95 billion foreign aid package that includes funding to Ukraine, Israel and Taiwan.  —  Democratic support outweighed Republican opposition from those who had various frustrations … ",
    "url": "https://npr.org/2024/04/20/1245993370/house-ukraine-israel-aid-bills"
  },
  {
    "text": "US House approves $61bn in military aid for Ukraine after months of stalling  —  Ukrainian president thanks America after Speaker Mike Johnson secures bipartisan support for funding Ukraine, Israel and Taiwan  —  After months of stalling, the US House of Representatives finally approved … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/20/us-house-approves-61bn-aid-ukraine"
  },
  {
    "text": "Volkswagen workers in Tennessee pass historic vote to unionize  —  Victory marks the first win in the United Auto Workers campaign to organize the Southern factories of a dozen automakers  —  Volkswagen workers in Chattanooga, Tenn., passed a historic vote to join the United Auto Workers on Friday … ",
    "url": "https://www.washingtonpost.com/business/2024/04/19/vw-uaw-tennessee-vote/"
  },
  {
    "text": "Biden celebrates Tennessee Volkswagen plant's vote to join UAW  —  President Biden celebrated the “historic vote” Friday for workers at a Tennessee Volkswagen plant to join the United Auto Workers (UAW) union.  —  “Congratulations to the workers at Volkswagen in Chattanooga, Tennessee … ",
    "url": "https://thehill.com/homenews/state-watch/4608235-biden-celebrates-tennessee-volkswagen-plant-vote-join-uaw/"
  },
  {
    "text": "Trump forced to listen silently to people insulting him as he trades a cocoon of adulation for court  —  He seems “selfish and self-serving,” said one woman.  The way he carries himself in public “leaves something to be desired,” said another.  —  His “negative rhetoric and bias,” said another man, is what is “most harmful.”",
    "url": "https://apnews.com/article/trump-trial-jurors-hush-money-criticism-b4fe05a61ed566a587523d1120b46a76"
  },
  {
    "text": "Where Jurors in Trump Hush-Money Trial Say They Get Their News  —  Prosecutors and defense lawyers tried to divine the political leanings of prospective jurors in the former president's Manhattan criminal trial from their answers to questions about what media they consume.",
    "url": "https://www.nytimes.com/2024/04/19/nyregion/trump-trial-jury-news.html"
  },
  {
    "text": "Musk Says Maher Hit Bullseye Comparing Nickelodeon to Neverland Ranch  —  ANTI-WOKE  —  “Wow, Bill Maher hits the bullseye,” Musk wrote on social media.  —  Bill Maher has labeled kids' TV network Nickelodeon as “Neverland Ranch with craft services”—and teed off on progressives' views … ",
    "url": "https://www.thedailybeast.com/elon-musk-says-bill-maher-hit-bullseye-comparing-nickelodeon-to-neverland-ranch"
  },
  {
    "text": "‘We Just Finally Saw the Dam Break’: How House Republicans Embraced the Chaos  —  Veteran Rep. Tom Cole is fed up with his party's insurgents.  —  Speaker Mike Johnson is on the verge of his biggest legislative victory yet — and it might mean his undoing.",
    "url": "https://www.politico.com/news/magazine/2024/04/20/grow-up-a-veteran-republican-is-tired-of-his-partys-insurgents-00153454"
  },
  {
    "text": "Russia's War Against Evangelicals  —  After they beat Azat Azatyan so bad blood came out of his ears; after they sent electric shocks up his genitals; after they wacked him with pipes and truncheons, the Russians began to interrogate him about his faith.  “When did you become a Baptist?",
    "url": "https://time.com/6969273/russias-war-against-evangelicals/"
  },
  {
    "text": "How R.F.K. Jr. Got on the Michigan Ballot, With Only Two Votes  —  The independent candidate persuaded a tiny party to give him its line on the ballot in a key 2024 battleground state, sparing him a costly, arduous organizing effort.  —  In January, when Doug Dern, the state chairman … ",
    "url": "https://www.nytimes.com/2024/04/20/us/politics/rfk-jr-michigan-ballot.html"
  },
  {
    "text": "Four ‘Three Percenter’ militia members sentenced to prison over Jan. 6 charges  —  Four “Three Percenter” militia members were sentenced to prison Friday over charges related to the Jan. 6, 2021 Capitol riot, according to a press release from the U.S. Attorney's Office for the District of Columbia.",
    "url": "https://thehill.com/regulation/court-battles/4608101-three-percenter-militia-members-sentenced-prison-jan-6-charges/"
  },
  {
    "text": "The Greatest Book a Politician Ever Wrote  —  The late Bob Graham's book is everything politics should be.  —  The bellhop at the Orlando hotel delivered a large red bag to the Cypress Penthouse, where he was met at the door by a woman in a green-and-white dress with a green-and-white “Shevin for Governor” sash around her neck.",
    "url": "https://www.politico.com/news/magazine/2024/04/20/bob-graham-political-book-00153402"
  }
]