[
  {
    "text": "Trump speaks with Justice Alito amid push to halt criminal sentencing  —  Alito spoke to Trump to recommend an ex-clerk for a job in his administration.  —  President-elect Donald Trump speaks during a news conference at Mar-a-Lago, Jan. 7, 2024, in Palm Beach, Fla.",
    "url": "https://abcnews.go.com/US/trump-speaks-justice-alito-amid-push-halt-criminal/story?id=117386419"
  },
  {
    "text": "Alito Spoke With Trump Shortly Before Supreme Court Filing  —  The justice said that the call was a routine job reference for one of his former clerks and that the request to stay the president-elect's sentencing did not come up.  —  Justice Samuel A. Alito Jr. spoke with President-elect Donald J. Trump … ",
    "url": "https://www.nytimes.com/2025/01/08/us/justice-alito-trump.html"
  },
  {
    "text": "Taking Trump's imperialist trolling seriously (for a moment)  —  We've come a long way from bringing down egg prices.  —  ∙ Paid  —  Speaking as someone who's been covering Trump for nine years now, paying attention to what he's doing instead of obsessing over what he's saying is generally a good rule of thumb.",
    "url": "https://www.publicnotice.co/p/trump-greenland-canada-paul-frymer-interview"
  },
  {
    "text": "Kremlin, on Trump remarks on Greenland and Canada, says Russia has Arctic interests  —  The Kremlin on Thursday said that Russia had strategic national interests in the Arctic when asked to comment on U.S. President-elect Donald Trump's remarks about acquiring Greenland, absorbing Canada and taking control of the Panama Canal.",
    "url": "https://www.reuters.com/world/kremlin-trump-remarks-greenland-canada-says-russia-has-arctic-interests-2025-01-09/"
  },
  {
    "text": "Biden postpones Italy trip amid raging Los Angeles fires  —  President Biden will no longer travel to Italy this weekend as fires rage in Los Angeles County, the White House said Wednesday.  —  “After returning this evening from Los Angeles, where earlier today he had met with police … ",
    "url": "https://thehill.com/homenews/administration/5075775-biden-cancels-italy-trip-california-fires/"
  },
  {
    "text": "Statement from Press Secretary Karine Jean-Pierre  —  After returning this evening from Los Angeles, where earlier today he had met with police, fire and emergency personnel fighting the historic fires raging in the area and approved a Major Disaster declaration for California … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/08/statement-from-press-secretary-karine-jean-pierre-5/"
  },
  {
    "text": "Wildfire response threatens to end Karen Bass' extended honeymoon  —  The Los Angeles mayor returned home from Ghana on Wednesday and said she was in “constant contact” while abroad.  —  LOS ANGELES — Karen Bass probably has second thoughts about that trip to Ghana.",
    "url": "https://www.politico.com/news/2025/01/08/wildfire-threatens-karen-bass-extended-honeymoon-00197228"
  },
  {
    "text": "Mayor's Absence Is Considered a Sign L.A. Underestimated Fire Risks  —  Some residents said Mayor Karen Bass should have canceled her trip to Ghana when weather warnings in Los Angeles grew increasingly dire.  —  When a series of dangerous, wind-driven fires broke out on Tuesday in the Los Angeles area … ",
    "url": "https://www.nytimes.com/2025/01/09/us/los-angeles-mayor-fire-response.html?unlocked_article_code=1.n04.5t0A.WyWaW0sxz7OM&smid=url-share"
  },
  {
    "text": "With Bass abroad, even Democrats are slamming LA mayor over wildfires  —  Los Angeles Times owner Patrick Soon-Shiong and developer Rick Caurso led the chorus of criticism against the mayor.  Tommy Vietor, a former Obama staffer and Pod Save America host, piled on.",
    "url": "https://www.politico.com/news/2025/01/08/los-angeles-fires-mayor-karen-bass-handling-criticized-00197137"
  },
  {
    "text": "Live updates Jimmy Carter's funeral to be held at Washington National Cathedral  —  Jimmy Carter will be honored in Washington one last time Thursday, with a state funeral for the former president before a flight back home to be buried.  Public visitation at the U.S. Capitol ended Wednesday morning.",
    "url": "https://www.washingtonpost.com/nation/2025/01/09/jimmy-carter-funeral-live-updates/"
  },
  {
    "text": "Republicans on North Carolina Supreme Court block certification of Democratic justice's election victory  —  On Monday, Congress certified the results of the 2024 presidential election in routine fashion.  Some concluded that, due to Trump's victory, there would be no attacks on the democratic process this year.",
    "url": "https://popular.info/p/update-republicans-on-north-carolina"
  },
  {
    "text": "Elon Musk says DOGE probably won't find $2 trillion in federal budget cuts  —  Musk previously said his Department of Government Efficiency would be able to recommend cuts to the federal budget of “at least $2 trillion.”  —  Tech billionaire Elon Musk said Wednesday that his budget-cutting effort … ",
    "url": "https://www.nbcnews.com/politics/politics-news/elon-musk-says-doge-probably-wont-find-2-trillion-federal-budget-cuts-rcna186924"
  },
  {
    "text": "Prepare to Be Shocked: Los Angeles' Fire Chief Is a DEI-Obsessed ‘LGBTQ’ Woman Who Wasted Millions  —  In perhaps the most unexpected, shocking revelation to come out of the devastating Los Angeles wildfires, it turns out their Fire Chief is an “LGBTQ+” woman who is obsessed with DEI.",
    "url": "https://redstate.com/bonchie/2025/01/08/in-a-shocking-turn-of-events-las-fire-chief-is-a-dei-obsessed-lgbtq-woman-n2184093"
  },
  {
    "text": "Trump Is Poised to Turn the DOJ Into His Personal Law Firm … No president has ever attempted to do what Donald Trump now proposes to do—assemble a small team of former personal attorneys and install it at the highest levels of the Department of Justice.  The president-elect first named lawyers … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/01/trump-doj-appointments-protection/681247/?gift=OFof2ZDTWx1CqiUu1ALJNLBon2d2tSDUpjGafkRmHSk&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Poking Fun at Trump, Mexico's President Suggests Renaming the U.S.  —  President Claudia Sheinbaum of Mexico also said Donald Trump was ill-informed when he said Mexico was “essentially run by the cartels.”  —  Mexico's president rejected several of President-elect Donald J. Trump's assertions … ",
    "url": "https://www.nytimes.com/2025/01/08/us/politics/mexico-president-mexican-america-trump.html?unlocked_article_code=1.nk4._okz.NQR-QhN5oSkY&smid=url-share"
  },
  {
    "text": "Billy Long, Trump's pick to lead IRS, pushed a tax credit that raises red flags, Sen. Warren says  —  Billy Long, President-elect Donald Trump's pick to run the IRS, is facing questions about his qualifications to lead the tax agency from Sen. Elizabeth Warren, a Democrat from Massachusetts who serves on the Senate's Finance Committee.",
    "url": "https://www.cbsnews.com/news/trump-billy-long-irs-ertc-tax-credit-senator-elizabeth-warren/"
  },
  {
    "text": "Zelenskiy Warns Allies Not to ‘Drop the Ball’ on War Support  — Ahead of Trump inauguration, Ukrainian leader presses case  — Austin, at last Ramstein meeting, confirms $500 million in aid  —  Ukrainian President Volodymyr Zelenskiy made a plea to press on with support … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-09/zelenskiy-warns-it-d-be-crazy-to-drop-the-ball-on-war-effort"
  },
  {
    "text": "Disgraced former US Rep. George Santos granted 3-month delay in sentencing for fraud and ID theft  —  Disgraced former congressman George Santos, facing a federal prison sentence, has won a few months' freedom to come up with more than half a million dollars in court fines — including from work on his new podcast.",
    "url": "https://apnews.com/article/george-santos-fraud-sentencing-delayed-podcast-c24d7679a4b99c4bfb7b141fd2eb8660"
  },
  {
    "text": "Trump transition considering D.C.-area showcase immigration raid in first days of administration  —  The raid under consideration would target immigrants allegedly living in the U.S. illegally at a workplace in the Washington, D.C., metropolitan area.  —  The incoming Trump administration … ",
    "url": "https://www.nbcnews.com/investigations/trump-raid-undocumented-immigrants-washington-dc-high-profile-rcna186780"
  },
  {
    "text": "Trump urges Republican senators to stick together on his Cabinet picks  —  President-elect Donald Trump, during a meeting Wednesday night on Capitol Hill, urged Senate Republicans to stick together during the confirmation process for his Cabinet picks.  Hearings begin next week … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/09/trump-administration-transition/"
  },
  {
    "text": "Hawaii Gov: RFK Jr.'s Anti-Vax Misinformation Left Dozens Of Kids Dead In Samoa  —  The Senate is poised to make “an absolute life-or-death decision” in confirming Kennedy as HHS secretary, warned Gov. Josh Green, who is also a physician.  —  LOADING  —  WASHINGTON — Hawaii Gov. Josh Green … ",
    "url": "https://www.huffpost.com/entry/hawaii-governor-josh-green-rfk-jr-vaccines-hhs_n_677ebc3ce4b0f751b99402ae"
  },
  {
    "text": "Robert F Kennedy Jr accused of voter fraud over New York ballot  —  Watchdog files complaint after Trump nominee cast vote from address court ruled was not his place of residence  —  Robert F Kennedy Jr has been accused of committing voter fraud in November's presidential election by casting … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/08/robert-f-kennedy-accused-voter-fraud"
  },
  {
    "text": "Scoop: Trump's 100 executive orders … - Senators were given previews of some of what they were told would be 100 executive orders, two sources who were in the room told Axios.  — Stephen Miller, Trump's longtime immigration adviser, dove into how they intend to use executive power … ",
    "url": "https://www.axios.com/2025/01/09/trump-immigration-executive-orders-stephen-miller"
  },
  {
    "text": "As L.A. burns, Trump blames Newsom — and California governor pushes back  —  The president-elect sought to blame the climate-change-exacerbated crisis in Southern California on the state's water management.  Experts disputed his claims.",
    "url": "https://www.washingtonpost.com/politics/2025/01/08/california-fires-trump-newsom-biden-politicians/"
  }
]