[
  {
    "text": "Is it too late for McCarthy to save his job as speaker? … But it might be too late.  —  With the House on the brink of voting on a motion to oust McCarthy, there's very strong sentiment inside the Democratic Caucus against helping the speaker, according to multiple aides and lawmakers.",
    "url": "https://punchbowl.news/article/kevin-mccarthy-running-out-of-time-to-save-job/"
  },
  {
    "text": "Will House Speaker Kevin McCarthy lose his job?  Here are the scenarios.  —  Rep. Matt Gaetz (R-Fla.) followed through his pledge to trigger a vote to oust Speaker Kevin McCarthy (R-Calif.) on Monday evening, kicking off a complicated process that will determine McCarthy's fate.",
    "url": "https://www.washingtonpost.com/politics/2023/10/03/kevin-mccarthy-house-speaker-vote/"
  },
  {
    "text": "McCarthy tells GOP lawmakers that House will vote today on effort to oust him as speaker  —  House Speaker Kevin McCarthy (R-Calif.) told Republican lawmakers that the House will vote Tuesday afternoon on a motion to table a resolution to remove him as speaker, according to two people familiar … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/03/kevin-mccarthy-house-speaker-vote-motion-to-vacate/"
  },
  {
    "text": "Republicans must expel Matt Gaetz  —  Newt Gingrich, a Republican from Georgia, was speaker of the House of Representatives from 1995 to 1999.  —  Rep. Matt Gaetz (R-Fla.) is an anti-Republican who has become actively destructive to the conservative movement.  —  Drama has filled the halls of Congress for 234 years.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/03/newt-gingrich-matt-gaetz-remove/"
  },
  {
    "text": "Kevin McCarthy's House speaker job under threat, with vote possible today  —  House Speaker Kevin McCarthy (R-Calif.) is at risk of losing his job as early as Tuesday, as a faction of hard-right Republicans seeks to oust him and Democrats signaled they are not willing to vote to save him.",
    "url": "https://www.washingtonpost.com/politics/2023/10/03/kevin-mccarthy-house-speaker-vote-2/"
  },
  {
    "text": "Judge Gags Trump After Ex-President Attacks His Law Clerk  —  Shortly before a lunch break, Trump circulated a false rumor about Manhattan Supreme Court Justice Arthur Engoron, which traces its origins to a now-shuttered satirical website  —  A Facebook icon representing an external link … ",
    "url": "https://themessenger.com/politics/trump-gag-order-new-york-engoron-clerk-truth-social"
  },
  {
    "text": "Judge Shuts Down Trump's Claim That He Reversed Himself on Statute of Limitations  —  The former president claimed the judge ‘overruled’ himself and would knock out ‘80%’ of the case, but the judge began day two of the trial by shooting that down  —  A Facebook icon representing an external link … ",
    "url": "https://themessenger.com/politics/judge-rejects-trump-claim-overruled-statute-of-limitations"
  },
  {
    "text": "Trump fraud trial live updates: Day 2 begins with testimony from ex-Trump accountant  —  Trump appears in court for Day 2 of civil fraud trial … 2m ago / 6:59 PM UTC  —  Trump appears to delete post attacking judge's law clerk  —  Dan Gallo  —  Amid all the delays … ",
    "url": "https://www.nbcnews.com/politics/live-blog/trump-fraud-trial-live-updates-rcna118408"
  },
  {
    "text": "Neither Party Well-Liked, but GOP Holds Advantage on Issues  — Republican and Democratic Parties viewed unfavorably on balance  — Between the two, Republican Party trusted more on economy and security  — GOP also ahead on which party can handle “most important problem”",
    "url": "https://news.gallup.com/poll/511979/neither-party-liked-gop-holds-advantage-issues.aspx"
  },
  {
    "text": "RNC warns Christie and Ramaswamy not to hold joint Fox News segment  —  The two candidates will now sit down for separate interviews.  —  The Republican National Committee told former New Jersey Gov. Chris Christie and entrepreneur Vivek Ramaswamy Monday night that if they went through … ",
    "url": "https://www.politico.com/news/2023/10/03/rnc-chris-christie-vivek-ramaswamy-debate-fox-00119629"
  },
  {
    "text": "No Labels makes its choice  —  No Labels claims to be a non-partisan centrist organization.  It describes itself as a movement for the “politically homeless.”  But in practice, it has supported Republicans and very conservative Democrats.  This year, No Labels has spent millions … ",
    "url": "https://popular.info/p/no-labels-makes-its-choice"
  },
  {
    "text": "How red-state politics are shaving years off American lives  —  ASHTABULA, Ohio — Mike Czup unspooled the hose to wash his hearse.  It was time to pick up the body of yet another neighbor who had died in the prime of life.  —  Since he started working at 15 in the funeral business, Czup has seen plenty of tragedies.",
    "url": "https://www.washingtonpost.com/health/interactive/2023/republican-politics-south-midwest-life-expectancy/"
  },
  {
    "text": "Buckle up: McCarthy's future to be decided on Tuesday  —  The speaker said he would not make a deal with Democrats to save his gavel: “They haven't asked for anything.  I'm not going to provide anything.”",
    "url": "https://www.politico.com/live-updates/2023/10/03/congress/mccarthy-wont-deal-with-dems-00119620"
  },
  {
    "text": "Rep. Cuellar unharmed in armed carjacking in DC  —  Rep. Henry Cuellar (D-Texas) was carjacked in Washington, D.C. on Monday night, according to a staffer from his office.  —  Cuellar was parking his car outside of his apartment in Navy Yard, D.C. when three armed individuals approached … ",
    "url": "https://thehill.com/homenews/house/4235073-rep-cuellar-unharmed-in-armed-carjacking-in-dc/"
  },
  {
    "text": "Schwarzenegger advises Trump on weight loss: ‘Run around your cell three times’  —  Arnold Schwarzenegger has some exercise advice for former President Trump: Do some laps around a jail cell.  —  “If he would ask me what should you do for fitness, I would just say, 'Run around your cell three times.",
    "url": "https://thehill.com/blogs/in-the-know/4235722-schwarzenegger-advises-trump-on-weight-loss-run-around-your-cell-three-times/"
  },
  {
    "text": "Supreme Court appears hesitant to upend Consumer Financial Protection Bureau  —  The Supreme Court justices at oral arguments Tuesday appeared hesitant to upend the Consumer Financial Protection Bureau (CFPB) by finding the agency's funding mechanism unconstitutional.",
    "url": "https://thehill.com/regulation/court-battles/4236078-supreme-court-appears-hesitant-to-upend-consumer-financial-protection-bureau/"
  },
  {
    "text": "Why MAGA Wants to Betray Ukraine  —  So the federal government wasn't shut down over the weekend, although we may have to go through this whole drama again in six weeks.  Kevin McCarthy, the speaker of the House, ended up doing the obvious: bringing a funding bill to the floor that could pass … ",
    "url": "https://www.nytimes.com/2023/10/02/opinion/columnists/maga-republicans-ukraine.html"
  },
  {
    "text": "'They're just meat': Russia deploys punishment battalions in echo of Stalin  —  Drunk recruits.  Insubordinate soldiers.  Convicts.  —  They're among hundreds of military and civilian offenders who've been pressed into Russian penal units known as “Storm-Z” squads and sent to the frontlines … ",
    "url": "https://www.reuters.com/world/europe/theyre-just-meat-russia-deploys-punishment-battalions-echo-stalin-2023-10-03/"
  }
]