[
  {
    "text": "Federal Appeals Court Upholds Bannon's Contempt Conviction  —  Stephen Bannon, a longtime ally of Donald Trump, had been found guilty of defying a subpoena from the House Jan. 6 committee.  He now faces a four-month prison sentence.  —  A federal appeals court on Friday upheld … ",
    "url": "https://www.nytimes.com/2024/05/10/us/politics/stephen-bannon-contempt-upheld.html"
  },
  {
    "text": "Appeals court upholds Steve Bannon's conviction for defying Jan. 6 probe  —  The ruling could send the longtime Donald Trump adviser to federal prison.  —  A federal appeals court on Friday upheld the criminal conviction of Steve Bannon, a longtime adviser to Donald Trump … ",
    "url": "https://www.politico.com/news/2024/05/10/appeals-court-upholds-steve-bannons-conviction-for-defying-jan-6-probe-00157301"
  },
  {
    "text": "Trump White House aide Steve Bannon loses appeal of contempt of Congress conviction … Steve Bannon, former adviser to Donald Trump, arrives to federal court in Washington, D.C., U.S., on Wednesday, March 16, 2022.  —  A federal appeals court on Friday upheld the criminal contempt … ",
    "url": "https://www.cnbc.com/2024/05/10/appeals-court-upholds-steve-bannon-contempt-of-congress-conviction.html"
  },
  {
    "text": "Virginia school board votes to restore Confederate names to two schools  —  School board members in Virginia's Shenandoah County voted early Friday to restore the names of two schools that previously honored Confederate leaders - four years after those names had been removed.",
    "url": "https://www.cnn.com/2024/05/09/us/shenandoah-county-confederate-school-names-reaj/"
  },
  {
    "text": "Israeli war cabinet votes to expand Rafah operation area, amid growing U.S. concerns … - The third source said the approved expansion includes actions that could be interpreted by the U.S. as crossing Biden's red line. … - The three sources said the cabinet also instructed … ",
    "url": "https://www.axios.com/2024/05/10/israel-gaza-rafah-operation-expansion"
  },
  {
    "text": "The simple reason Republican Sunday show hits are disasters  —  It's hard to defend the indefensible. … Not so long ago, the Sunday morning news shows were a vital part of the political ecosphere.  Politicians and government officials clamored for the mainstream platform provided by ABC's This Week … ",
    "url": "https://www.publicnotice.co/p/stephanopoulos-mace-sununu-gop-sunday-shows"
  },
  {
    "text": "Kari Lake keeps giving Republicans new reasons to worry  —  Lake keeps reversing her own positions and stirring up feuds, and some in the GOP see other states as better targets this fall.  —  National Republicans embraced Kari Lake's Arizona Senate bid, reasoning she was likely to win the primary with or without their support.",
    "url": "https://www.politico.com/news/2024/05/10/gop-kari-lake-questions-00157290"
  },
  {
    "text": "Trump Hush-Money Payment Revealed in Bank Records  —  Evidence at the center of Trump's criminal trial was just released by the FBI in response to an ongoing FOIA lawsuit. … How I got these documents is kind of a long story.  Five years ago, I filed a FOIA lawsuit against the FBI.",
    "url": "https://www.bloomberg.com/news/newsletters/2024-05-10/trump-trial-bank-records-show-130k-hush-money-payment-to-stormy-daniels"
  },
  {
    "text": "Trump gets Barron's age wrong when asked about his youngest son's convention role  —  In an interview with Telemundo 51, Trump offered that Barron, who turned 18 in March, is 17 years old.  —  Former President Donald Trump misstated the age of his youngest son in an interview that aired Thursday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-gets-barrons-age-wrong-asked-youngest-sons-convention-role-rcna151596"
  },
  {
    "text": "Biden to Quadruple Tariffs on Chinese EVs  —  Administration is preparing to announce higher levies on a range of Chinese goods next week  —  WASHINGTON—The Biden administration is preparing to raise tariffs on clean-energy goods from China in the coming days, with the levy … ",
    "url": "https://www.wsj.com/economy/trade/biden-to-quadruple-tariffs-on-chinese-evs-203127bf"
  },
  {
    "text": "Nancy Mace says staff ‘sabotaged’ her: Republican accuses ex-aides of mismanaging $1million, hacking her phone, spying on medical records and dumping office devices in water in extraordinary interview  — Mace says her new staff are still repairing the damage left behind by her ‘sabotaging’ former aides",
    "url": "https://www.dailymail.co.uk/news/article-13393357/Nancy-Mace-staffers-1-million.html"
  },
  {
    "text": "Raging Solar Storm Could Bring Northern Lights and Communications Snafus  —  FLARING UP  —  NOAA officials have issued a “Severe G4” level of space storm watch for the first time in almost 20 years.  —  A huge burst of energy produced by a powerful solar storm could strike the Earth as early as Friday … ",
    "url": "https://www.thedailybeast.com/raging-solar-storm-could-bring-northern-lights-and-communications-snafus"
  },
  {
    "text": "Strapped down, blindfolded, held in diapers: Israeli whistleblowers detail abuse of Palestinians in shadowy detention center  —  By CNN's International Investigations and Visuals teams  —  Sde Teiman, Israel CNN  —  At a military base that now doubles as a detention center in Israel's Negev desert … ",
    "url": "https://www.cnn.com/2024/05/10/middleeast/israel-sde-teiman-detention-whistleblowers-intl-cmd/"
  },
  {
    "text": "Biden Hasn't ‘Abandoned’ Anybody  —  Quick programming note before we start: Bill's out next week, so Andrew (and a rotating cast of guest stars!) will be holding down Morning Shots in the meantime.  Happy Friday.  —  Speaking of guest stars, let's kick the morning off with an item … ",
    "url": "https://www.thebulwark.com/p/biden-hasnt-abandoned-anybody"
  },
  {
    "text": "Biden's big donors fume over Israel criticism … - “Bad, Bad, Bad, decision, on all levels, Pls reconsider,” he wrote in a message obtained by Axios and other news outlets.  — He added: “Let's not forget that there are more Jewish voters, who care about Israel, than Muslim voters that care about Hamas.”",
    "url": "https://www.axios.com/2024/05/10/israel-gaza-biden-rafah-donors"
  },
  {
    "text": "Mike Johnson Told Us What He Really Thinks About Joe Biden, Hakeem Jeffries and Donald Trump  —  Fresh off fending off a hard-right coup attempt, the House speaker opened up about his strategy in a lengthy interview.  —  Mike Johnson was impersonating Donald Trump talking about Mike Johnson.",
    "url": "https://www.politico.com/news/magazine/2024/05/10/mike-johnson-interview-strategy-00157133"
  },
  {
    "text": "Trump Is Not Invincible  —  In the folk wisdom of recent American politics, Donald Trump is a figure of herculean invulnerability to traditional scandal.  What lands as a crippling blow to most politicians leaves nary a scratch on Trump, who effortlessly deflected the slings and arrows … ",
    "url": "https://www.nytimes.com/2024/05/10/opinion/trump-trial-not-invincible.html"
  },
  {
    "text": "Trump team throws out GOP plan and builds a ‘leaner’ 2024 operation  —  The new plan calls for fewer offices, less staff and a focus on new partnerships with outside groups — raising concerns among some Republicans.  —  Donald Trump's 2020 campaign called itself a “juggernaut” … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/10/trump-gop-field-operation/"
  },
  {
    "text": "Crypto is Trump's new weapon against Biden  —  It's the first time crypto has become an issue in the general election of a presidential race.  —  Donald Trump is making presidential history all over again: He's poised to be the first major party nominee to court cryptocurrency traders.",
    "url": "https://www.politico.com/news/2024/05/10/trump-crypto-biden-00157051"
  },
  {
    "text": "Elderly climate activists damage Magna Carta case at British Library  —  Two climate protesters aged 82 and 85 smashed parts of the reinforced case holding an original text of the Magna Carta in the British Library in London on Friday before the pair - one an Anglican priest - were stopped by security staff.",
    "url": "https://www.reuters.com/world/uk/elderly-climate-activists-damage-magna-carta-case-british-library-2024-05-10/"
  },
  {
    "text": "Rick Scott tries to rewrite history on $1.7 billion Medicare fraud controversy  —  Conventional political wisdom would typically advise candidates to steer clear of mentioning their past controversies.  —  But U.S. Sen. Rick Scott went out of his way, quite literally, on Thursday … ",
    "url": "https://www.yahoo.com/news/rick-scott-attend-donald-trump-140134845.html"
  },
  {
    "text": "GOP rep files impeachment articles using Dem precedent set during Trump administration  —  Florida Republican Rep. Cory Mills accused Biden of a ‘quid pro quo’  —  FIRST ON FOX: Rep. Cory Mills, R-Fla., formally filed articles of impeachment against President Biden on Friday over his recent comments … ",
    "url": "https://www.foxnews.com/politics/gop-rep-files-impeachment-articles-using-dem-precedent-set-during-trump-administration"
  },
  {
    "text": "Biden administration won't conclude Israel violated terms of US weapons agreement, AP sources say  —  WASHINGTON (AP) — A soon-to-be-released Biden administration review of Israel's use of U.S.-provided weapons in its war in Gaza does not conclude that Israel has violated the terms for their use … ",
    "url": "https://apnews.com/article/us-israel-gaza-war-nsm-international-law-c83b6f39ce2799e5d2c473a337e2f857"
  }
]