[
  {
    "text": "Sources say two Minnesota lawmakers have been shot  —  Sources have told 5 EYEWITNESS NEWS' Tom Hauser that two Minnesota Lawmakers have been shot.  —  Minnesota state senator John Hoffman in Champlin and Minnesota state representative Melissa Hortman in Brooklyn Park were reportedly shot … ",
    "url": "https://kstp.com/kstp-news/top-news/sources-say-two-minnesota-lawmakers-have-been-shot/"
  },
  {
    "text": "Minnesota Gov. Tim Walz: former House speaker and husband killed in politically motivated shooting  —  Minnesota Gov. Tim Walz says former state House Speaker Melissa Hortman and her husband were killed in a politically motivated assassination.  A second lawmaker and his wife were shot and wounded.",
    "url": "https://apnews.com/article/minnesota-lawmakers-shot-d7983e1e4f1a7573a487cab1a98cd172"
  },
  {
    "text": "Rep. Melissa Hortman, her husband killed; Sen. John Hoffman, his wife shot in ‘targeted’ shootings  — Two Minnesota lawmakers and their spouses were shot by someone impersonating a police officer early Saturday morning.  — Rep. Melissa Hortman and her husband Mark were killed.",
    "url": "https://www.fox9.com/news/melissa-hortman-john-hoffman-lawmakers-shot-minnesota"
  },
  {
    "text": "Brooklyn Park police searching for suspect in ‘multiple targeted shootings’  —  Gov. Tim Walz said there were targeted shootings in both Brooklyn Park and Champlin on Saturday. … Emergency vehicles were on the scene of a reported shooting in Brooklyn Park on Saturday morning.",
    "url": "https://www.startribune.com/brooklyn-park-police-searching-for-suspect-in-multiple-targeted-shootings/601372993"
  },
  {
    "text": "2 Minnesota lawmakers shot in apparent ‘targeted’ incidents, in grave condition; manhunt underway  —  The shootings took place in Champlin and Brooklyn Park, Minnesota.  —  Minnesota State Representative Melissa Hortman and Minnesota State Senator John Hoffman are shown in these undated file photos.",
    "url": "https://abcnews.go.com/US/2-minnesota-lawmakers-shot-targeted-incident-officials/story?id=122840751"
  },
  {
    "text": "Minnesota Rep. Hortman and husband killed, Sen. Hoffman and wife wounded in politically motivated shooting, Gov. Walz says  —  Minnesota Gov. Tim Walz announced Saturday morning that state Rep. Melissa Hortman and her husband are dead, and state Sen. John Hoffman and his wife are wounded following … ",
    "url": "https://www.cbsnews.com/minnesota/news/minnesota-lawmakers-targeted-shootings-champlin-brooklyn-park-john-hoffman-melissa-hortman/"
  },
  {
    "text": "Who Are the Lawmakers Who Were Shot?  —  Officials urged residents to avoid anti-Trump protests while they hunt for the gunman, concerned that he might be planning to target the demonstrations after killing a Democratic state representative and her husband and attacking a state senator.",
    "url": "https://www.nytimes.com/live/2025/06/14/us/minnesota-shootings"
  },
  {
    "text": "‘Targeted shootings’ in eastern Minnesota, Gov. Walz says  —  The Brooklyn Park Police Department issued a shelter-in-place alert for an area surrounding the Edinburgh Golf Course Saturday morning in its quest for a suspect.  —  There have been “targeted shootings” in eastern Minnesota, according to Gov. Tim Walz.",
    "url": "https://www.nbcnews.com/news/us-news/targeted-shootings-minnesota-rcna212831"
  },
  {
    "text": "Former appointee of Tim Walz sought in deadly shootings of Minnesota lawmaker and her husband, had ‘No Kings’ flyers in car: sources  —  A former appointee of Minnesota Gov. Tim Walz is being sought in connection with the assassination of a state lawmaker and the shooting of another, police sources said.",
    "url": "https://nypost.com/2025/06/14/us-news/suspect-in-deadly-minnesota-shootings-identified-as-vance-luther-boelter/"
  },
  {
    "text": "Dem Assassin Is Armed Guard Boss With Anti-Abortion Hit-List  —  HE PLANS MORE  —  The suspect is Vance Boelter, 57, according to police sources.  —  The man suspected of killing a top Minnesota state lawmaker has been identified as Vance Boelter, law enforcement sources told the Associated Press.",
    "url": "https://www.thedailybeast.com/who-is-the-minnesota-democratic-assassin-and-what-do-we-know-about-him/"
  },
  {
    "text": "Live updates on MN lawmaker shootings: Rep. Hortman and her husband dead, suspect impersonating police  — A shelter-in-place order is in effect in Brooklyn Park after two state lawmakers and their spouses were shot by someone impersonating a police officer.",
    "url": "https://www.fox9.com/news/brooklyn-park-champlin-shootings-suspect-impersonating-police"
  },
  {
    "text": "The ‘No Kings’ mass mobilization debunks Trump's biggest myth  —  While the president hosts a grand parade, we hold a parade of the people.  —  President Donald Trump wants to celebrate his birthday like a king: not with cake or candles, but with a $45 million military parade through … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/no-kings-protests-trump-military-parade-rcna212922"
  },
  {
    "text": "Live Updates: Protests Against Trump Policies Kick Off Across the Country  —  Demonstrations have started in Nashville, Houston, Atlanta and Newark, N.J. Los Angeles said it was preparing for a turnout that “may be unprecedented” after days of sustained protests against the Trump administration's crackdown on immigration.",
    "url": "https://www.nytimes.com/live/2025/06/14/us/protests-news?unlocked_article_code=1.O08.61ao.4kN20xHE8N0S&smid=url-share"
  },
  {
    "text": "Trump Relishes Troops in American Streets While Shunning Conflict Overseas  —  The seemingly disparate postures of recent days speak to the president's complicated relationship with the military.  —  When President Trump first sought to stage a military parade in Washington … ",
    "url": "https://www.nytimes.com/2025/06/14/us/politics/trump-military-parade-israel-iran.html?unlocked_article_code=1.O08.TJl2.yA3aClTP65su&smid=bs-share"
  },
  {
    "text": "Trump Shifts Deportation Focus, Pausing Raids on Farms, Hotels and Eateries  —  The abrupt pivot on an issue at the heart of Mr. Trump's presidency suggested his broad immigration crackdown was hurting industries and constituencies he does not want to lose.  —  The Trump administration … ",
    "url": "https://www.nytimes.com/2025/06/13/us/politics/trump-ice-raids-farms-hotels.html?unlocked_article_code=1.O08.-3wV.Z_Osb56HSwak&smid=url-share"
  },
  {
    "text": "Critical Damage Dealt to Key Iranian Nuclear Site, IAEA Says  —  Israeli airstrikes dealt critical damage to a key Iranian nuclear facility, according to the United Nations atomic watchdog, likely setting back the Islamic Republic's uranium fuel cycle by months.",
    "url": "https://www.bloomberg.com/news/articles/2025-06-14/critical-damage-dealt-to-key-iranian-nuclear-sites-iaea-reports"
  },
  {
    "text": "Trump administration considers adding 36 countries to travel ban list  —  An internal memo reviewed by The Post sets a 60-day deadline for the targeted nations to conform with certain requirements, or face a full or partial entry ban.  —  The United States is considering restricting entry … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/14/trump-travel-ban-expansion/"
  },
  {
    "text": "Antisemitism Is an Urgent Problem.  Too Many People Are Making Excuses.  —  The list of horrific antisemitic attacks in the United States keeps growing.  Two weeks ago in Boulder, Colo., a man set fire to peaceful marchers who were calling for the release of Israeli hostages.",
    "url": "https://www.nytimes.com/2025/06/14/opinion/antisemitism-jewish-hate.html?unlocked_article_code=1.O08.0EBs.toYySdebHwGG&smid=url-share"
  }
]