[
  {
    "text": "House Dems go into “complete meltdown” as Schumer folds  —  House Democrats erupted into apoplexy Thursday night after Senate Minority Leader Chuck Schumer (D-N.Y.) said he would support Republicans' stopgap government funding measure.  —  Why it matters: House Democrats feel like they “walked the plank,” in the words of one member.",
    "url": "https://www.axios.com/2025/03/14/house-democrats-angry-chuck-schumer-shutdown"
  },
  {
    "text": "Ex-Democratic Leader Schumer  —  Today on TAP: He has defied the will of the vast majority of Senate Democrats and played right into the hands of Trump.  Time for a new leader.  —  Senate Minority Leader Chuck Schumer (D-NY) leaves a Senate Democratic caucus luncheon outside the Senate Chamber … ",
    "url": "https://prospect.org/blogs-and-newsletters/tap/2025-03-14-ex-democratic-leader-schumer/"
  },
  {
    "text": "Young Democrats' Anger Boils Over as Schumer Retreats on Shutdown  —  A generational divide, seen in newer lawmakers' impatience with bipartisanship and for colleagues who don't understand new media, has emerged as one of the deepest rifts within the party.  —  Senator Chuck Schumer's sudden decision … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/government-shutdown-spending-bill-schumer-democrats.html?unlocked_article_code=1.304.uWoP.gHG4QdvsYpJc&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Inside House Dems' furious anti-Schumer movement  —  House Democrats from across the party's ideological spectrum — united in their fury at Senate Minority Leader Chuck Schumer (D-N.Y.) — are engaged in a campaign to get Senate Democrats to defy their leader.",
    "url": "https://www.axios.com/2025/03/14/house-democrats-chuck-schumer-shutdown"
  },
  {
    "text": "Ocasio-Cortez mobilizes Democrats against Schumer plan as colleagues privately urge her to consider primary challenge  —  New York Rep. Alexandria Ocasio-Cortez said Thursday that she plans to mobilize her massive base of followers to oppose what she described as an “acquiesce” … ",
    "url": "https://www.cnn.com/2025/03/13/politics/ocasio-cortez-schumer-democratic-shutdown-plan/"
  },
  {
    "text": "Trump Demands Major Changes in Columbia Discipline and Admissions Rules  —  A letter outlining “immediate next steps” arrived less than a week after the administration said it was canceling $400 million in grants and contracts.  —  The Trump administration on Thursday demanded … ",
    "url": "https://www.nytimes.com/2025/03/13/nyregion/columbia-university-students-disciplined-hamilton-hall.html?unlocked_article_code=1.304.x6dC.bRQuLvmztnFc&smid=nytcore-android-share"
  },
  {
    "text": "First They Came for Columbia  —  Like many autocrats before him, Donald Trump has launched what could be a devastating attack on universities.  —  Over the last week, the Trump administration has cancelled $400 million in grants and contracts to Columbia University and $800 million in grants to Johns Hopkins University.",
    "url": "https://www.thecrimson.com/article/2025/3/14/enos-levitsky-harvard-columbia-trump/"
  },
  {
    "text": "Fear and Loathing in the West Wing  —  Inside the revolt against Elon Musk...  Welcome back to The Red Letter.  —  The tolerance for Elon Musk inside of the White House is wearing thin, as they deal with the fallout of his calamitous interview with Larry Kudlow when he touched the third rail - entitlements.",
    "url": "https://www.tarapalmeri.com/p/fear-and-loathing-in-the-west-wing"
  },
  {
    "text": "USPS signs agreement with DOGE, agrees to cut 10,000 workers: ‘Broken business model’  —  The service plans to cut 10,000 employees in the next 30 days through a voluntary early-retirement program  —  U.S. Postmaster General Louis DeJoy informed members of Congress on Thursday he has signed … ",
    "url": "https://www.foxnews.com/politics/usps-signs-agreement-doge-agrees-cut-10000-workers-broken-business-model"
  },
  {
    "text": "The right dominates the online media ecosystem, seeping into sports, comedy, and other supposedly nonpolitical spaces  —  A new Media Matters analysis found 9 out of the 10 top online shows assessed are right-leaning … The 2024 presidential election has been dubbed the “podcast election” … ",
    "url": "https://www.mediamatters.org/google/right-dominates-online-media-ecosystem-seeping-sports-comedy-and-other-supposedly"
  },
  {
    "text": "Canada is so furious at the US right now  —  The US and Canada are meant to be the best of friends, but they're in the midst of a pretty ugly fight.  —  It began with President Donald Trump's ascent to the White House, when he began referring to his outgoing Canadian counterpart as … ",
    "url": "https://www.vox.com/politics/403927/canada-tariffs-alcohol-steel-trump-51st-state-boycott"
  },
  {
    "text": "After JD Vance is booed, Kennedy Center head urges ‘diversity and inclusion’  —  In a staff email, interim president Richard Grenell, a Trump ally, condemned a chorus of boos directed at the vice president and his wife at a concert Thursday night.  —  When Vice President JD Vance took … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/13/jd-vance-booed-kennedy-center/"
  },
  {
    "text": "Trump Admin Nixed Contract Helping Kidnapped Ukrainian Kids: Sources  —  Even as President Donald Trump and government-demolition czar Elon Musk appear to actively favor Russia's interests amid discussions of how to end the Russia-Ukraine war, Secretary of State Marco Rubio has struck a studiously neutral posture.",
    "url": "https://newrepublic.com/article/192790/trump-kidnapped-ukrainian-kids-nixed-contract"
  },
  {
    "text": "Focus group: Trump swing voters in Michigan have buyers' remorse  —  Most Michigan swing voters in our latest Engagious/Sago focus groups said that although they voted for President Trump in November, they have objections, frustrations and fears about his behavior since he returned to power.",
    "url": "https://www.axios.com/2025/03/14/trump-harris-michigan-focus-group"
  },
  {
    "text": "Fiasco for Musk as He Craters in New Polls and DOGE Cuts Lose in Court  —  Elon Musk is suddenly facing lots of bad news.  A judge just ordered the Trump administration to reinstate thousands of fired federal workers, a blow to Musk's so-called Department of Government Efficiency.",
    "url": "https://newrepublic.com/article/192747/fiasco-musk-craters-new-polls-doge-cuts-lose-court"
  },
  {
    "text": "Everybody Hates Elon  —  And other tales of collapsing confidence  —  After Donald Trump won the 2024 election, progressives had one great fear about his economic policies — namely, that he wouldn't do much.  Oh, he'd slap on a few tariffs, make a big show of eliminating “woke” spending … ",
    "url": "https://paulkrugman.substack.com/p/everybody-hates-elon"
  },
  {
    "text": "VIDEO: Columbia University Student Whose Visa Was Revoked for Supporting Hamas and Terrorist Activities Used CBP Home App to Self-Deport  —  Another student who supported Hamas was arrested by ICE HSI for overstaying her student visa.  —  WASHINGTON - Today, Secretary of Homeland Security … ",
    "url": "https://www.dhs.gov/news/2025/03/14/video-columbia-university-student-whose-visa-was-revoked-supporting-hamas-and"
  },
  {
    "text": "A Close Elon Musk Friend Joins His Effort on Social Security  —  The involvement of Antonio Gracias, an investor who has known Elon Musk for two decades, suggests that Mr. Musk has made overhauling the Social Security Administration a priority.  —  A private equity investor … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/elon-musk-antonio-gracias-social-security-administration.html?unlocked_article_code=1.304.3qGa.Mvo8u9YKWHD3&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Washington, DC, Region Braces for ‘Devastating’ Cuts from Congress  —  Local leaders across the DC metro area are raising alarms about a stopgap measure in Congress that would trigger a $1 billion budget shortfall for the city.  —  A decision before Congress to strip $1.1 billion … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-14/washington-dc-virginia-and-maryland-brace-for-cuts-to-schools-transit-police"
  },
  {
    "text": "Trump moves to close facility that helps track planet-warming pollution  —  The lab is connected to the Mauna Loa Observatory, where scientists gather data to produce the Keeling Curve, a chart on the daily status of atmospheric carbon dioxide concentrations.",
    "url": "https://www.washingtonpost.com/climate-environment/2025/03/14/trump-cancels-greenhouse-gas-laboratory-lease/"
  },
  {
    "text": "Musk Immediately Calls for Judges to Be Impeached After DOGE Rulings  —  Elon Musk threw a tantrum after his Department of Government Efficiency (DOGE) was dealt a series of legal setbacks, immediately calling for the impeachment of federal judges.  “Without judicial reform … ",
    "url": "https://www.thedailybeast.com/elon-musk-immediately-calls-for-judges-to-be-impeached-after-rulings-overturn-doge-firings/"
  },
  {
    "text": "Office for Civil Rights Initiates Title VI Investigations into Institutions of Higher Education  —  WASHINGTON - The U.S. Department of Education's Office for Civil Rights (OCR) opened investigations into 45 universities under Title VI following OCR's February 14 Dear Colleague Letter (DCL) … ",
    "url": "https://www.ed.gov/about/news/press-release/office-civil-rights-initiates-title-vi-investigations-institutions-of-higher-education-0"
  }
]