[
  {
    "text": "Judges Begin Freeing Jan. 6 Defendants and Dismissing Their Cases  —  Two prominent far-right extremists with central roles in the Capitol attack, Enrique Tarrio of the Proud Boys and Stewart Rhodes of the Oath Keepers militia, have been set free.  —  One day after President Donald J … ",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/jan-6-defendants-freed.html"
  },
  {
    "text": "PROTECTING THE MEANING AND VALUE OF AMERICAN CITIZENSHIP  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  The privilege of United States citizenship is a priceless and profound gift.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/protecting-the-meaning-and-value-of-american-citizenship/"
  },
  {
    "text": "The Trump executive orders that threaten democracy  —  Ever since Donald Trump declared he'd act like a dictator on Day 1 during his presidential campaign, there have been real concerns that he'd be true to his word — that he'd take a series of unilateral actions that threaten the integrity of American democracy.",
    "url": "https://www.vox.com/policy/395860/trump-executive-orders-democracy-january-6-pardon-birthright-schedule-f"
  },
  {
    "text": "Trump Starts Immigration Crackdown, Enlisting the Military and Testing the Law  —  The president's Day 1 actions included directives that fly in the face of legal limits on involving the military in domestic operations and the constitutional guarantee of birthright citizenship.",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/trump-starts-immigration-crackdown-enlisting-the-military-and-testing-the-law.html"
  },
  {
    "text": "States, civil rights groups sue to stop Trump's birthright citizenship order  —  Constitutional scholars said the president's executive order would upend precedent and is unlikely to pass legal muster.  —  President Donald Trump's executive order to end birthright citizenship faced a flurry … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/20/trump-birthright-citizenship-immigrants/"
  },
  {
    "text": "Trump signs order seeking to rename Alaska's Denali and the Gulf of Mexico  —  President Donald Trump said the Gulf of Mexico will be called Gulf of America, while the Denali mountain peak will revert to its old name, Mount McKinley.  —  President Donald Trump on Monday issued … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/21/trump-gulf-of-america-mexico-denali-mckinley/"
  },
  {
    "text": "Restoring Names That Honor American Greatness  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  It is in the national interest to promote the extraordinary heritage … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/restoring-names-that-honor-american-greatness/"
  },
  {
    "text": "Coast Guard Commandant terminated over border lapses, recruitment, DEI focus: official  —  Senior DHS official confirms to Fox News Digital Coast Guard Adm. Linda Fagan has been relieved of her post  —  EXCLUSIVE: The Commandant of the U.S. Coast Guard has been terminated over concerns about the border … ",
    "url": "https://www.foxnews.com/politics/coast-guard-commandant-terminated-over-border-lapses-recruitment-dei-focus-official"
  },
  {
    "text": "DEFENDING WOMEN FROM GENDER IDEOLOGY EXTREMISM AND RESTORING BIOLOGICAL TRUTH TO THE FEDERAL GOVERNMENT  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 7301 of title 5, United States Code, it is hereby ordered:",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/defending-women-from-gender-ideology-extremism-and-restoring-biological-truth-to-the-federal-government/"
  },
  {
    "text": "GRANTING PARDONS AND COMMUTATION OF SENTENCES FOR CERTAIN OFFENSES RELATING TO THE EVENTS AT OR NEAR THE UNITED STATES CAPITOL ON JANUARY 6, 2021  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  This proclamation ends a grave national injustice that has been perpetrated upon … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/granting-pardons-and-commutation-of-sentences-for-certain-offenses-relating-to-the-events-at-or-near-the-united-states-capitol-on-january-6-2021/"
  },
  {
    "text": "Musk responds to backlash over gesture at Trump rally  —  Elon Musk has caused outrage over a one-armed gesture he gave during a speech celebrating the inauguration of Donald Trump.  —  Musk thanked the crowd for “making it happen”, before placing his right hand over his heart and then thrusting … ",
    "url": "https://www.bbc.com/news/articles/cy48v1x4dv4o"
  },
  {
    "text": "WITHDRAWING THE UNITED STATES FROM THE WORLD HEALTH ORGANIZATION  —  WITHDRAWING THE UNITED STATES FROM THE WORLD  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/withdrawing-the-united-states-from-the-worldhealth-organization/"
  },
  {
    "text": "Why Ruben Gallego's Laken Riley vote is a warning for Democrats  —  In backing the Laken Riley Act, the Arizona senator said he's breaking with a party that's “largely out of touch with where your average Latino is.”  —  Ruben Gallego didn't run to be the next John McCain or Kyrsten Sinema … ",
    "url": "https://www.politico.com/news/2025/01/20/ruben-gallego-democrats-trump-00001925"
  },
  {
    "text": "Trump to announce up to $500 billion in private sector AI infrastructure investment  —  President Trump is set to announce billions of dollars in private sector investment to build artificial intelligence infrastructure in the United States, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/trump-announces-private-sector-ai-infrastructure-investment/"
  },
  {
    "text": "No Time for Wonkery  —  This is hell, nor are we out of it  —  Donald Trump's second inaugural speech was as vile as expected, but also surprisingly dull.  —  OK, I guess his promise to take back the Panama Canal was a bit exciting.  But nobody took him seriously.",
    "url": "https://paulkrugman.substack.com/p/no-time-for-wonkery"
  },
  {
    "text": "Distorting Trump's Language  —  In the flurry of boasts, exaggerations, and untruths that President Trump emitted during yesterday's Inaugural Address, he made evident his intention to turn reality on its head.  Taking his predecessor's successes in reducing crime, increasing oil and gas production … ",
    "url": "https://contrarian.substack.com/p/distorting-trumps-language"
  },
  {
    "text": "Time to Admit It: Trump Is a Great President.  He's Still Trying To Be a Good One.  —  The most consequential presidents divided the nation—before “reuniting it on a new level of understanding.”  —  Donald J. Trump in his second inaugural address was everything his supporters hoped he would be … ",
    "url": "https://www.politico.com/news/magazine/2025/01/21/harris-column-trump-great-president-00199564"
  },
  {
    "text": "Decentralized Social Media Is the Only Alternative to the Tech Oligarchy  —  If it wasn't already obvious, the last 72 hours have made it crystal clear that it is urgent to build and mainstream alternative, decentralized social media platforms that are resistant to government censorship and control … ",
    "url": "https://www.404media.co/decentralized-social-media-is-the-only-alternative-to-the-tech-oligarchy/"
  },
  {
    "text": "Bored German Translator Caught Calling Trump's Speech ‘S***’ on Hot Mic  —  SWEARING IN  —  A bored German translator was caught in a hot mic moment after being heard calling Donald Trump's presidential speech “s—.”  The translator, working for German TV channel Phoenix … ",
    "url": "https://www.thedailybeast.com/bored-german-reporter-caught-calling-trumps-speech-s-in-mic-cock-up/"
  },
  {
    "text": "Instagram hides search results for ‘Democrats’  —  Meta says its working urgently to fix a problem with Instagram which results in a “results hidden” message when users search for the terms “Democrat” or “Democrats”.  —  Some social media users have accused the company of political bias … ",
    "url": "https://www.bbc.com/news/articles/c4g32yxpdz0o"
  },
  {
    "text": "The White House Press Corps Gears Up for Another Trump Term  —  Plenty to worry about—but some are looking forward to the press having better access.  —  The return of Donald Trump to the White House has prompted predictable worries among many DC-based reporters about how his administration might seek … ",
    "url": "https://www.cjr.org/political_press/white-house-press-corps-gears-up-second-trump-term-lahut.php"
  },
  {
    "text": "Trump's initial orders reverse Biden on health care costs, protections from discrimination  —  President orders federal workers back to the office, freezes most hiring  —  WASHINGTON — President Trump began his second term Monday with a sweeping order aimed at reversing dozens … ",
    "url": "https://www.statnews.com/2025/01/20/trump-executive-orders-health-care-drug-pricing-aca-covid-gender-discrimination/"
  },
  {
    "text": "Elon Musk to fund UK far-right ringleader Tommy Robinson's legal fight, supporters claim  —  Robinson's representatives post ‘heartfelt gratitude’ to the X owner on Telegram.  —  LONDON — Elon Musk has agreed to pay legal fees racked up by jailed British far-right agitator Tommy Robinson, Robinson's representatives have claimed.",
    "url": "https://www.politico.eu/article/elon-musk-fund-uk-far-right-ringleader-tommy-robinson-legal-fight/"
  }
]