[
  {
    "text": "Trump to take more than 200 executive actions on day one  —  EXCLUSIVE: President-elect Trump will sign more than 200 executive actions on Inauguration Day—a massive, first wave of policy priorities focused on border security, energy, reducing the cost of living for American families … ",
    "url": "https://www.foxnews.com/politics/trump-take-more-than-200-executive-actions-day-one"
  },
  {
    "text": "TikTok is coming back online after Trump pledged to restore it  —  New York CNN  —  TikTok appears to be coming back online just hours after President-elect Donald Trump pledged Sunday that he would sign an executive order Monday that aims to restore the banned app.",
    "url": "https://www.cnn.com/2025/01/19/tech/tiktok-ban/"
  },
  {
    "text": "TikTok Flickers Back to Life After Trump Says He Will Stall a Ban  —  Some users saw the social media app come back online on Sunday, following a shutdown when a federal law went into effect requiring a sale or ban.  —  TikTok flickered back to life in the United States on Sunday … ",
    "url": "https://www.nytimes.com/2025/01/19/technology/trump-tiktok-ban-executive-order.html"
  },
  {
    "text": "Trump to Sign Executive Orders on Immigration, Energy, Government Hiring  —  The president-elect's team briefed senior Republican leaders about the plans on Sunday  —  President-elect Donald Trump is readying a blitz of executive orders that he plans to issue just hours after he is sworn into office … ",
    "url": "https://www.wsj.com/politics/elections/trump-to-sign-executive-orders-on-immigration-energy-government-hiring-2e7e82c0?st=httjFX"
  },
  {
    "text": "TikTok says it is ‘restoring service’ after Trump announces he will issue executive order  — TikTok says it is “restoring service” in the United States.  — The company had turned off its app for its 170 million US users on Saturday.  — President-elect Donald Trump said he will issue … ",
    "url": "https://www.businessinsider.com/tiktok-back-online-us-shutdown-biden-trump-media-app-2025-1"
  },
  {
    "text": "Donald Trump, crypto billionaire … - After another massive overnight rally, as of Sunday morning Trump's crypto holdings were worth as much as $58 billion on paper, enough — with his other assets — to make him one of the world's 25 richest people.",
    "url": "https://www.axios.com/2025/01/19/donald-trump-crypto-billionaire"
  },
  {
    "text": "Trump's Cryptocurrency Surges to Become One of the World's Most Valuable  —  The new business venture by the Trump family is generating intensifying criticism, even as it has turned into an overnight phenomenon, generating a windfall on paper.  —  The Trump family's new crypto token surged … ",
    "url": "https://www.nytimes.com/2025/01/19/us/politics/trump-cryptocurrency-surges.html?unlocked_article_code=1.qk4.LdH6.reJymwrcjNgW&smid=url-share"
  },
  {
    "text": "Vivek Ramaswamy expected to depart DOGE  —  Vivek Ramaswamy, President-elect Donald Trump's choice to co-lead the Department of Government Efficiency (DOGE) with entrepreneur Elon Musk, is expected to soon step away from the task force, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/vivek-ramaswamy-expected-to-depart-doge/"
  },
  {
    "text": "Trump is back.  But a return of total resistance would be a bad strategy.  —  A guide for how liberals should approach the next four years.  —  When Donald Trump was first elected president in the fall of 2016, his elevation to the most powerful office in the world seemed like an aberration.",
    "url": "https://www.bostonglobe.com/2025/01/19/opinion/trump-resistance-second-term/"
  },
  {
    "text": "Scores of career State Dept. diplomats resign before Trump's inauguration  —  Trump's team requested the high-level resignations as the president-elect prepares a sharp break with the Biden administration.  —  Scores of senior career diplomats are resigning from the State Department effective … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/19/trump-state-department-resignations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3MjYyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4NjQ1MTk5LCJpYXQiOjE3MzcyNjI4MDAsImp0aSI6IjA3ZjJkZjU3LWRkODktNDFmMC1hMzc3LWVmN2IyN2ZmMzRmNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzE5L3RydW1wLXN0YXRlLWRlcGFydG1lbnQtcmVzaWduYXRpb25zLyJ9.F2w85PZoKMacD_JnaSMCeRKPTHY3NCBuVGx8blr8zTE&itid=gfta"
  },
  {
    "text": "Statement from President Joe Biden on Clemency Actions  —  America is a country built on the promise of second chances.  As President, I have used my clemency power to make that promise a reality by issuing more individual pardons and commutations than any other President in U.S. history.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/19/statement-from-president-joe-biden-on-clemency-actions-3/"
  },
  {
    "text": "Trump Barely Won the Popular Vote.  Why Doesn't It Feel That Way?  —  In 2024, Donald Trump won the popular vote by 1.5 points.  Trump and Democrats alike treated this result as an overwhelming repudiation of the left and a broad mandate for the MAGA movement.  But by any historical measure, it was a squeaker.",
    "url": "https://www.nytimes.com/2025/01/19/opinion/trump-mandate-zuckerberg-masculinity.html"
  },
  {
    "text": "‘Lady McBiden’: Alexandra Pelosi Blasts the First Lady  —  The feud between the president and ex-speaker intensifies in the waning days of his presidency.  —  Since breaking her hip in Europe last month, Speaker Emerita Nancy Pelosi has been deluged with messages, flowers and calls of concern … ",
    "url": "https://www.politico.com/news/magazine/2025/01/19/lady-mcbiden-alexandra-pelosi-first-lady-00199164"
  },
  {
    "text": "Most Americans optimistic about Trump's return to office: Poll  —  A new survey found that most Americans are optimistic about President-elect Trump returning to the White House.  —  The survey, conducted by CBS News and YouGov, found that 60 percent of respondents say they feel optimistic about Trump's second term.",
    "url": "https://thehill.com/homenews/administration/5094460-most-americans-optimistic-about-trumps-return-to-office-poll/"
  },
  {
    "text": "Schools Using AI Emulation of Anne Frank That Urges Kids Not to Blame Anyone for Holocaust  —  The Anne Frank Experience  —  You're probably familiar with Anne Frank, a European Jewish girl whose posthumously-published diary documents her time hiding from Nazi persecution … ",
    "url": "https://futurism.com/the-byte/ai-anne-frank-blame-holocaust"
  },
  {
    "text": "Alabama and Mississippi will also honor Robert E. Lee on Martin Luther King Jr. Day  —  The U.S. is set to mark Martin Luther King Jr. Day, the federal holiday set aside to honor the life of the civil rights icon.  But in Alabama and Mississippi, Monday is also Robert E. Lee Day in honor of the Confederate general.",
    "url": "https://apnews.com/article/martin-luther-king-jr-holiday-alabama-mississippi-0f535594cf50af7103ca2d953e1bc9a1"
  },
  {
    "text": "National Guard troops worry Trump will deploy them for mass deportations  —  “I don't want to be seen as a Gestapo,” one former senior military official said.  —  National Guard members fear landing in the center of a political tussle between red state governors and blue state attorneys general … ",
    "url": "https://www.politico.com/news/2025/01/19/trump-national-guard-mass-deporations-fears-00199063"
  }
]