[
  {
    "text": "Kristi Noem's story of killing her dog points to class two misdemeanor  —  South Dakota governor's account of family dog Cricket killing neighbor's chickens may be an offence, according to state law  —  Kristi Noem, the South Dakota governor and Republican vice-presidential hopeful … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/29/kristi-noem-misdemeanour-shooting-dog"
  },
  {
    "text": "Trump Allies Hope Kristi Noem's Puppy Killing Also Kills Her VP Chances  —  The South Dakota governor's story about executing a 14-month-old dog is a gift to her political rivals … Several Republicans close to Trump — who, admittedly, are aligned with others vying for the Trump VP slot … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-allies-kristi-noem-dog-killing-vp-bid-1235011996/"
  },
  {
    "text": "Kristi Noem has ‘no shot’ as Trump's VP pick after puppy-killing controversy: sources  —  South Dakota Republican Gov. Kristi Noem has “no shot” at being Donald Trump's running mate after revealing in a forthcoming book that she shot and killed her puppy, sources close to the 45th president tell The Post.",
    "url": "https://nypost.com/2024/04/29/us-news/kristi-noem-has-no-shot-as-trumps-vp-pick-after-puppy-killing-controversy-sources/"
  },
  {
    "text": "Michael Cohen is cashing in on the Trump trial with TikTok livestreams — and it could be a problem  —  “Trump 2024?  More like Trump 20-24 years,” Cohen said on a recent stream.  —  Michael Cohen, Donald Trump's former attorney, appears on a series of TikTok live streams in April, 2024.",
    "url": "https://abcnews.go.com/US/michael-cohen-cashing-trump-trial-tiktok-livestreams-problem/story?id=109695141"
  },
  {
    "text": "Bill Barr says Trump often suggested executing his rivals during heated White House outbursts  —  Despite Bill Barr's repeatedly voicing concerns about Donald Trump, he has now said he will vote for him again this November  —  Bill Barr has claimed Donald Trump often suggested executing … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/bill-barr-donald-trump-execution-b2536602.html"
  },
  {
    "text": "Ex-NSA staffer gets 21 years for trying to sell defense information to ‘friends’ in Russia  —  The letter from the former National Security Agency employee, written in Cyrillic characters, is not at all what you would expect to end up in the hands of a Russian agent.  —  “My friends!”",
    "url": "https://www.usatoday.com/story/news/nation/2024/04/29/nsa-sentenced-prison-espionage-act-russia/73505746007/"
  },
  {
    "text": "Former NSA Employee Sentenced to Over 21 Years in Prison for Attempted Espionage  —  For Immediate Release  —  Jareh Sebastian Dalke, 32, of Colorado Springs, was sentenced today to 262 months in prison for attempted espionage in connections with his efforts to transmit classified National … ",
    "url": "https://www.justice.gov/opa/pr/former-nsa-employee-sentenced-over-21-years-prison-attempted-espionage"
  },
  {
    "text": "Pelosi accuses MSNBC host of being ‘apologist for Donald Trump’  —  Former House Speaker Nancy Pelosi (D-Calif.) accused MSNBC's Katy Tur of being an “apologist” for former President Trump on Monday.  —  During an appearance on the network, Pelosi touted President Biden's record on the economy … ",
    "url": "https://thehill.com/homenews/media/4630117-pelosi-msnbc-katy-tur-trump/"
  },
  {
    "text": "Lawyers for Hunter Biden plan to sue Fox News ‘imminently’  —  A letter obtained by NBC News says action is pending because of Fox's alleged “conspiracy and subsequent actions to defame Mr. Biden and paint him in a false light.”  —  Lawyers for Hunter Biden plan to sue Fox News “imminently … ",
    "url": "https://www.nbcnews.com/politics/politics-news/lawyers-hunter-biden-plan-sue-fox-news-rcna149707"
  },
  {
    "text": "Michigan AG executes search warrants on Google and X in ongoing 2020 fake electors probe  —  Google and X, formerly Twitter, recently provided hundreds of files to Michigan prosecutors for their 2020 election subversion probe, complying with search warrants that investigators obtained … ",
    "url": "https://www.cnn.com/2024/04/29/politics/michigan-search-warrants-google-twitter-2020-fake-electors/"
  },
  {
    "text": "Congress May Cancel Your Automatic Flight Refunds  —  The Biden administration last week announced a new rule promising that when airlines cancel or significantly delay flights, passengers will automatically be given their money back without having to “navigate a patchwork of cumbersome processes … ",
    "url": "https://www.levernews.com/congress-may-cancel-your-automatic-flight-refunds/"
  },
  {
    "text": "Cigna's nopeinator (permalink)  —  Cigna - like all private health insurers - has two contradictory imperatives:  —  I. To keep its customers healthy; and  —  II. To make as much money for its shareholders as is possible.  —  Now, there's a hypothetical way to resolve these contradictions … ",
    "url": "https://pluralistic.net/2024/04/29/what-part-of-no/#dont-you-understand"
  },
  {
    "text": "OAN Retracts Article Regarding Michael Cohen Story About His Alleged Affair With Stormy Daniels And Extortion Plan  —  OAN today has retracted its March 27 article entitled “Whistleblower: Avenatti Alleged Cohen Daniels Affair Since 2006, Pre-2016 Trump Extortion Plan,” and is taking … ",
    "url": "https://www.oann.com/newsroom/oan-retracts-article-regarding-michael-cohen-story-about-his-alleged-affair-with-stormy-daniels-and-extortion-plan/"
  },
  {
    "text": "Texas governor says state will ignore ‘illegal’ Biden Title IX revisions  —  Texas Gov. Greg Abbott (R) said on Monday his state will not abide by the Biden administration's sweeping new changes to Title IX, the federal civil rights law prohibiting sex-based discrimination at government-funded schools.",
    "url": "https://thehill.com/homenews/state-watch/4629807-texas-governor-says-state-will-ignore-illegal-biden-title-ix-revisions/"
  },
  {
    "text": "Attorneys inside and outside the administration urge Biden to cut off arms to Israel  —  So far more than 90 lawyers have signed on to a legal letter alleging Israel's conduct in Gaza violates U.S. and international law.  —  A coalition of lawyers domestic and abroad … ",
    "url": "https://www.politico.com/news/2024/04/29/lawyers-israel-arm-sales-biden-00154958"
  },
  {
    "text": "Poll: Biden and Trump supporters sharply divided by the media they consume  —  Those who don't follow political news feel more positively about Donald Trump and Robert F. Kennedy Jr. and more negatively about Joe Biden.  —  Supporters of President Joe Biden and former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-biden-trump-supporters-sharply-divided-media-consume-rcna149497"
  },
  {
    "text": "Statement from Columbia University President Minouche Shafik  —  Dear fellow members of the Columbia community,  —  Our University is committed to four core principles, which underpin all of our work and our shared values as a community:  —  First, we must keep all members of our community physically safe on campus.",
    "url": "https://president.columbia.edu/news/statement-columbia-university-president-minouche-shafik-4-29"
  },
  {
    "text": "Tenn. lawmakers react to new bill allowing teachers to carry guns in schools  —  Tennessee State Reps. Justin Jones and Gloria Johnson join Ali Velshi to discuss Gov. Bill Lee (R-Tenn.) signing a bill allowing teachers to carry firearms in schools, how unpopular the bill is across the state, and the true motives behind the decision.",
    "url": "https://www.msnbc.com/ali-velshi/watch/-insane-tn-state-reps-react-to-new-bill-allowing-teachers-to-carry-guns-in-schools-209851973646"
  },
  {
    "text": "More than half of voters think Trump has committed crimes: Poll  —  More than half of voters think former President Trump has committed crimes for which he should be convicted, according to a new Harvard CAPS-Harris poll shared with The Hill.  —  Fifty-five percent of surveyed voters … ",
    "url": "https://thehill.com/homenews/campaign/4629539-more-than-half-of-voters-think-trump-has-committed-crimes-poll/"
  },
  {
    "text": "Gaetz gets last-minute primary challenger in Florida  —  A former naval aviator has launched a last-minute primary challenge against Rep. Matt Gaetz (R-Fla.), filing last week to run for the House in Florida's 1st Congressional District.  —  Aaron Dimmock filed to run as a Republican … ",
    "url": "https://thehill.com/homenews/campaign/4629308-gaetz-primary-challenger-florida-aaron-dimmock/"
  },
  {
    "text": "US determines 5 Israeli security units committed human rights violations before outbreak of Gaza war  —  The US State Department has determined that five Israeli security units committed gross violations of human rights prior to the outbreak of the war with Hamas in Gaza … ",
    "url": "https://www.cnn.com/2024/04/29/politics/us-determines-5-israeli-security-units-committed-human-rights-violations-before-outbreak-of-gaza-war"
  },
  {
    "text": "‘Double Hater’ Voters Are Not Sold on Biden, Trump, or Kennedy  —  Inflation, immigration, abortion are influential issues for voters  —  West Long Branch, NJ - There has been very little movement in a presidential election that continues to show nearly equal levels of potential support … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_042924/"
  }
]