[
  {
    "text": "As the World Smolders, the New Speaker Trolls Biden  —  It didn't take long for the new House speaker, Mike Johnson, to demonstrate to the world that he will not be a serious partner for American allies or for those who still believe that governing is not a petty little game.",
    "url": "https://www.nytimes.com/2023/11/01/opinion/mike-johnson-israel-ukraine.html"
  },
  {
    "text": "Does New Speaker of the House Mike Johnson Have a Bank Account?  —  Speaker Mike Johnson has never listed a bank account on his financial disclosure.  In fact, on his newest disclosure he doesn't list a single asset at all. … Newly elected Speaker of the House Mike Johnson (R-LA) does not have a bank account.",
    "url": "https://www.thedailybeast.com/does-new-speaker-of-the-house-mike-johnson-have-a-bank-account"
  },
  {
    "text": "Another wave of Israeli strikes hit Gaza refugee camp as crossing opens for foreigners and wounded  —  The Hamas-run government said the strikes killed and wounded many people, but the exact toll was not yet known.  —  RAFAH, Gaza Strip — Israeli airstrikes hit apartment buildings … ",
    "url": "https://www.politico.com/news/2023/11/01/gaza-refugee-camp-israeli-strikes-00124706"
  },
  {
    "text": "Transformed Trump family will take center stage in New York courtroom  —  Once Trump's right hand, daughter Ivanka has stepped back, while Trump sons Eric and Don Jr. defend his business and political legacy  —  Donald Trump had been a pariah on Wall Street for years when a banker … ",
    "url": "https://www.washingtonpost.com/nation/2023/10/31/trump-family-new-york-civil-trial/"
  },
  {
    "text": "Trump's Allies Want a New Style of Lawyer if He Returns to Power  —  Politically appointed lawyers sometimes frustrated Donald J. Trump's ambitions.  His allies are planning to install more aggressive legal gatekeepers if he regains the White House.  —  Close allies of Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/11/01/us/politics/trump-2025-lawyers.html"
  },
  {
    "text": "EXCLUSIVE: Jenna Ellis' lawyer talks guilty plea in Fulton Trump case  —  Frank Hogue says deal came together in just days  —  When Fulton County prosecutors huddled with lawyers for Jenna Ellis, they said the former Trump campaign lawyer could resolve her case by pleading guilty to being part … ",
    "url": "https://www.ajc.com/politics/exclusive-jenna-ellis-lawyer-talks-about-her-guilty-plea-in-fulton-trump-case/XBRM3YYH4BD2XERHQJZFENA6UA/"
  },
  {
    "text": "RFK Jr.'s donor data reveals his 2024 threat  —  A POLITICO analysis of his donor base reveals a lot about who is powering this unconventional candidate.  —  Robert F. Kennedy Jr. is collecting checks from past Donald Trump donors at a much higher rate than former Joe Biden contributors … ",
    "url": "https://www.politico.com/news/2023/11/01/rfk-jr-2024-campaign-donors-00124621"
  },
  {
    "text": "Christian Nationalism ‘Is No Longer Operating Beneath the Surface’  —  Mike Johnson is the first person to become speaker of the House who can be fairly described as a Christian nationalist, a major development in America history in and of itself.  Equally important, however … ",
    "url": "https://www.nytimes.com/2023/11/01/opinion/mike-johnson-christian-nationalism-speaker.html"
  },
  {
    "text": "Powerful Granger not running again for Congress  —  U.S. Rep. Kay Granger, R-Fort Worth, announced Wednesday morning she won't run for reelection.  —  She plans to serve out the remainder of her term.  —  “Serving my community has been the greatest honor, and I have always fought to improve … ",
    "url": "https://fortworthreport.org/2023/10/31/powerful-granger-not-running-again-for-congress-sources-say/"
  },
  {
    "text": "Sen. John Fetterman faces a left-wing backlash over his stance on Israel.  He isn't budging.  —  The progressive senator from Pennsylvania has resisted calls from some of his supporters and former staffers to call for an immediate cease-fire in the region.  —  In the wake of Hamas' Oct. 7 attack … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-john-fetterman-faces-left-wing-backlash-israel-rcna122204"
  },
  {
    "text": "The GOP voter suppression jamboree comes to North Carolina  —  The state's extreme gerrymander represents the latest Republican effort to secure permanent rule. … Republican policies are not broadly popular.  Rather than alter those policies to win elections, Republicans have chosen to alter elections.",
    "url": "https://www.publicnotice.co/p/north-carolina-gerrymandered-congressional-maps"
  },
  {
    "text": "The Virginia voter purge  —  Election officials working under Virginia Governor Glenn Youngkin (R) have admitted to removing “nearly 3,400 qualified voters from the state's rolls.”  The Youngkin administration originally discovered the mistake at the beginning of October but grossly underestimated the number of voters affected.",
    "url": "https://popular.info/p/the-virginia-voter-purge"
  },
  {
    "text": "Democrats launch attack ads against vulnerable Republicans over election of Speaker Johnson  —  EXCLUSIVE — House Democrats are targeting vulnerable Republicans over their decision to elect Mike Johnson (R-LA) as their newest speaker, accusing GOP lawmakers of appointing a “MAGA Republican extremist” … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/democrats-attack-vulnerable-republicans-over-speaker-johnson"
  },
  {
    "text": "Hungary bans teens from visiting World Press Photo exhibition over LGBTQ images  —  The prestigious global photo exhibition, on display in Hungary's National Museum in Budapest, receives over 4 million visitors from around the world every year.  —  BUDAPEST, Hungary … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/hungary-bans-teens-visiting-world-press-photo-exhibition-lgbtq-images-rcna122777"
  },
  {
    "text": "Joe Biden received $40K in ‘laundered China money’ from brother in 2017, Comer says  —  Rep James Comer says James Biden paid Joe Biden $40K as a ‘loan repayment’ after receiving funds from Hunter Biden linked to China's CEFC  —  House Oversight Committee Chairman James Comer said President Biden … ",
    "url": "https://www.foxnews.com/politics/joe-biden-received-40k-in-laundered-china-money-from-brother-in-2017-comer-says"
  },
  {
    "text": "Some Hamas killers were high on amphetamine, officials say  —  The Scoop  —  Some of the Hamas militants who attacked southern Israel on October 7 were fueled by a synthetic amphetamine called Captagon, which U.S. and Israeli officials believe was used to suppress fear and anxiety during … ",
    "url": "https://www.semafor.com/article/10/31/2023/hamas-killers-were-high-on-amphetamine-officials-say"
  },
  {
    "text": "AOC accuses pro-Israel PAC of being ‘extremist organization that destabilizes US democracy’  —  AIPAC torched Rep Alexandria Ocasio-Cortez over her peddling ‘of the same tired lies [and] spin’  —  Rep. Alexandria Ocasio-Cortez, D-N.Y., accused a pro-Israel political action committee (PAC) … ",
    "url": "https://www.foxnews.com/politics/aoc-accuses-pro-israel-pac-being-extremist-organization-destabilizes-us-democracy"
  },
  {
    "text": "Iowa Poll: Majority say Trump is best candidate to handle Israel war.  Haley comes second  —  In a Des Moines Register/NBC News/Mediacom Iowa Poll, 52% of likely GOP caucusgoers say Trump would do the best job handling the Israel-Hamas war, followed by Nikki Haley at 22%",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2023/11/01/iowa-poll-donald-trump-nikki-haley-get-most-support-for-handling-israel-war-hamas-gaza/71331777007/"
  },
  {
    "text": "New House speaker once partnered with so-called ‘ex-gay’ conversion group  —  Speaker of the House Mike Johnson closely collaborated with a group in the mid-to-late 2000s that promoted “conversion therapy,” a discredited practice that asserted it could change the sexual orientation of gay and lesbian individuals.",
    "url": "https://www.cnn.com/2023/11/01/politics/mike-johnson-kfile-invs/"
  },
  {
    "text": "Republicans Are Rationalizing Cruelty Toward Gaza  —  Israel has legitimate cause to fight and defeat Hamas.  That doesn't mean we should tell our ally to embrace cruelty and brutality in their response.  —  TWENTY-TWO YEARS AGO, when terrorists massacred Americans in the name of Islam … ",
    "url": "https://plus.thebulwark.com/p/republicans-rationalizing-cruelty-toward-gaza"
  },
  {
    "text": "“A kind of Stepford wife”: It's more than a prayer keeping Mike Johnson's wife suddenly out of view  —  The new speaker's Christian right radicalism really comes into view when looking at his marriage  —  When Rep. Mike Johnson, R-La., was elected Speaker of the House … ",
    "url": "https://www.salon.com/2023/11/01/a-kind-of-stepford-wife-its-more-than-a-prayer-keeping-mike-johnsons-wife-suddenly-out-of-view/"
  },
  {
    "text": "“Faith and Family” vs Democracy  —  On the normalization of Mike Johnson, the media's inclination to accommodate power, and the perpetuation of “real American” extremism  —  What animates the man who rose through the latest round of Republican Speaker chaos in the House to become one of the nation's most powerful politicians?",
    "url": "https://thomaszimmer.substack.com/p/faith-and-family-vs-democracy"
  }
]