[
  {
    "text": "Trump ousts at least 14 independent inspectors general in late-night purge  —  The dismissals appeared to violate federal law, which requires Congress to receive 30 days' notice of any intent to fire a Senate-confirmed inspector general.",
    "url": "https://www.washingtonpost.com/politics/2025/01/24/trump-fire-inspectors-general-federal-agencies/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3Njk0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MDc3MTk5LCJpYXQiOjE3Mzc2OTQ4MDAsImp0aSI6IjM0ZGM3MzVkLTU4ODktNDEzOC04MWQ1LTEwZjQzOGY3NjUzZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzI0L3RydW1wLWZpcmUtaW5zcGVjdG9ycy1nZW5lcmFsLWZlZGVyYWwtYWdlbmNpZXMvIn0.8XF_Noz3ifkriOenjwC09PgmWb3cN91LcQD73dnY3uA&itid=gfta"
  },
  {
    "text": "Trump Fires at Least 12 Inspectors General in Late-Night Purge  —  The internal government watchdogs were believed to have been dismissed at several major agencies, though the Justice Department's was not said to have been among them.  —  President Trump fired at least 12 inspectors general late … ",
    "url": "https://www.nytimes.com/2025/01/24/us/politics/trump-fires-inspectors-general.html"
  },
  {
    "text": "Trump fires independent inspectors general in Friday night purge  —  The watchdogs say the removals may be invalid for failing to comply with a 2022 law requiring a 30-day notification to Congress before removals.  —  President Donald Trump fired multiple independent federal watchdogs … ",
    "url": "https://www.politico.com/news/2025/01/25/donald-trump-inspectors-general-firing-00200611"
  },
  {
    "text": "Trump fires 17 independent inspectors general at federal agencies, source says  —  U.S. President Donald Trump fired 17 independent watchdogs at multiple government agencies on Friday, a person with knowledge of the matter said, eliminating a critical oversight component and clearing the way to replace them with loyalists.",
    "url": "https://www.reuters.com/world/us/trump-fires-least-12-independent-inspectors-general-washington-post-reports-2025-01-25/"
  },
  {
    "text": "Playbook: Trump's play for LA  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Happy Saturday.  This is Debra Kahn, California policy editor, writing from Los Angeles nice and early.  Get in touch: [email protected].  —  DRIVING THE DAY",
    "url": "https://www.politico.com/newsletters/playbook/2025/01/25/trumps-play-for-la-00200612"
  },
  {
    "text": "Pete Hegseth Is Confirmed as Defense Secretary By Slim Margin  —  Pete Hegseth has vowed to bring his “warrior” ethos to the Pentagon.  Democrats had assailed him as unfit for the job, and his confirmation came down to Vice President JD Vance serving as tiebreaker.",
    "url": "https://www.nytimes.com/live/2025/01/24/us/pete-hegseth-defense-secretary-vote"
  },
  {
    "text": "VP Vance breaks tie in the Senate to confirm Pete Hegseth as defense secretary  —  Three Republicans voted with every Democrat against Trump's controversial pick to lead the Pentagon, forcing Vance to step in and put Hegseth over the top.  —  WASHINGTON — The Republican-controlled Senate … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-vote-confirm-pete-hegseth-defense-secretary-rcna189058"
  },
  {
    "text": "Mexico refuses to accept a U.S. deportation flight  —  The Mexican government has criticized President Donald Trump's unilateral immigration actions, and the landing would have required Mexico's assistance.  —  WASHINGTON — Mexico denied a U.S. military plane access to land Thursday … ",
    "url": "https://www.nbcnews.com/politics/immigration/mexico-refuses-accept-us-deportation-flight-rcna189182"
  },
  {
    "text": "Secret Service Agents — Not ICE — Denied Entry At Chicago School  —  Editor's note: This story has been updated with new information correcting earlier information provided by CPS officials.  —  BACK OF THE YARDS - U.S. Secret Service agents - not Immigration and Customs Enforcement agents … ",
    "url": "https://blockclubchicago.org/2025/01/24/ice-agents-denied-entry-at-cps-school-in-back-of-the-yards/"
  },
  {
    "text": "Keene man arrested for storming the Capitol on Jan. 6 rejects Trump's pardon  —  On his first day in office this week, President Donald Trump pardoned all rioters at the Jan. 6 attack on the U.S. Capitol.  Jason Riddle served time in jail for his participation in the 2021 riot where he stole … ",
    "url": "https://www.nhpr.org/nh-news/2025-01-24/keene-man-arrested-for-storming-the-capitol-on-jan-6-rejects-trumps-pardon"
  },
  {
    "text": "Trump Officials Pause Programs to Let In Immigrants, Including Ukrainians  —  The pause on several initiatives that allowed immigrants to enter the country temporarily will block the entrance of people fleeing some of the most unstable and desperate places in the world.",
    "url": "https://www.nytimes.com/2025/01/24/us/politics/trump-immigration-pause.html"
  },
  {
    "text": "Trump signs anti-abortion policies after speaking to March for Life  —  Those impacted include overseas health organizations that distribute contraception and help combat HIV.  —  President Donald Trump's campaign-trail promise to leave abortion regulation to the states lasted just a few days into his presidency.",
    "url": "https://www.politico.com/news/2025/01/24/trump-issues-executive-orders-reviving-anti-abortion-policies-00200212"
  },
  {
    "text": "Scientists at NIH can't purchase supplies for their studies after Trump administration pauses outside communications  —  Scientists at the National Institutes of Health have been told the communications pause announced by the Trump Administration earlier this week includes a pause on all purchasing … ",
    "url": "https://www.cnn.com/2025/01/24/health/nih-scientists-purchase-supplies-trump-administration-pauses-communications/"
  },
  {
    "text": "Wall Street Banks Prepare to Sell Billions of Dollars of X Loans  —  Banks are hoping to sell the X debt at around 90 to 95 cents on the dollar  —  Banks are getting ready to sell billions of dollars in debt borrowed by Elon Musk's X, bringing Wall Street a step closer to exiting … ",
    "url": "https://www.wsj.com/finance/banking/wall-street-banks-prepare-to-sell-billions-of-dollars-of-x-loans-c609beb1?st=qi4q4y&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump's Early Actions Mirror Project 2025, the Blueprint He Once Dismissed  —  President Donald Trump made clear during his campaign that he wanted little to do with Project 2025, the sweeping and controversial conservative policy blueprint created by the Heritage Foundation.",
    "url": "https://time.com/7209901/donald-trump-executive-actions-project-2025/"
  },
  {
    "text": "Idaho Lawmakers Want Supreme Court to Overturn Same-Sex Marriage Decision  —  A state legislative committee has advanced a resolution asking that the power to regulate marriage be returned to the states.  —  Since 1793, when the U.S. Supreme Court declined a request by President George Washington … ",
    "url": "https://www.nytimes.com/2025/01/24/us/idaho-same-sex-marriage-supreme-court.html"
  },
  {
    "text": "Trump's Crypto Venture Divides the Industry He Aims to Support  —  The president's promotion of a speculative digital coin left some crypto investors feeling blindsided, while others saw it as a gimmick that undermined the industry's credibility.  —  Dressed in ball gowns, tuxedos and … ",
    "url": "https://www.nytimes.com/2025/01/25/us/politics/trumps-crypto-venture-divides-the-industry-he-aims-to-support.html"
  },
  {
    "text": "‘Hit Him Back Twice as Hard’: Canada's No. 1 Populist Has a Risky Trump Strategy  —  Eight years ago, Justin Trudeau was the face of Canadian resistance to Trump.  Not anymore.  —  “I'm a street fighter in politics,” Ontario Premier Doug Ford said.  “If someone throws a punch at me, I'm going to hit him back twice as hard.”",
    "url": "https://www.politico.com/news/magazine/2025/01/25/doug-ford-trump-trade-resistance-00200457"
  },
  {
    "text": "Rubio orders freeze of new funding for nearly all U.S. foreign aid programs  —  Secretary of State Marco Rubio has sent an order to all U.S. diplomatic and consular posts instructing a pause on “all new obligations of funding, pending a review, for foreign assistance programs funded by or through the Department and USAID.”",
    "url": "https://www.cbsnews.com/news/rubio-orders-freeze-new-funding-u-s-foreign-aid-programs/"
  },
  {
    "text": "Kia recalling 80,000 electric and hybrid vehicles over improper air bag deployment  —  Kia is recalling more than 80,000 electric and hybrid vehicles in the United States because of improper airbag and seat belt deployment, the U.S. National Highway Traffic Safety Administration said on Saturday.",
    "url": "https://www.cbsnews.com/news/kia-recall-electric-hybrid-vehicles-improper-air-bag-deployment/"
  }
]