[
  {
    "text": "Trump appointee who assaulted Capitol officers on Jan. 6 sentenced to nearly 6 years  —  “Hell yea I'm going.  I'm a Trump appointee,” Federico Klein wrote in a message ahead of the Capitol attack.  —  WASHINGTON — A former Donald Trump political appointee at the State Department who tried … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-appointee-assaulted-capitol-officers-jan-6-sentenced-nearly-6-ye-rcna123188"
  },
  {
    "text": "Trump State Department appointee sentenced to nearly 6 years for role in Jan. 6 attack  —  The State Department appointee was involved in the Jan. 6 attack on the Capitol.  —  LIVE  —  In this image from U.S. Capitol Police security video, released and annotated by the Justice Department … ",
    "url": "https://abcnews.go.com/Politics/trump-state-department-appointee-sentenced-6-years-role/story?id=104604054"
  },
  {
    "text": "Judge finds Eastman culpable for ethics breaches in 2020 bid to keep Trump in power  —  California authorities will now present “aggravation” evidence in their effort to strip Eastman of his law license.  —  A California judge made a “preliminary finding” Thursday that attorney John Eastman … ",
    "url": "https://www.politico.com/news/2023/11/03/john-eastman-trump-disbarment-culpable-00125219"
  },
  {
    "text": "Trump's Truth Social page is a riot of witness intimidation  —  Even his lawyers can't really defend it. … On August 6, Alabama man Arthur Ray Hanson, II, left a voicemail threatening Fulton County District Attorney Fani Willis with violence if she charged Donald Trump with interference in the 2020 election.",
    "url": "https://www.publicnotice.co/p/trump-witness-intimidation-gag-order-explained"
  },
  {
    "text": "Kentucky 2023 Poll: Cameron Catches Up to Beshear in Governor's Race  —  Home Polls Kentucky 2023 Poll: Cameron Catches Up to Beshear in Governor's Race  —  Trump Supporters Rally to Cameron as Election Approaches  —  The final Emerson College Polling survey of Kentucky voters … ",
    "url": "https://emersoncollegepolling.com/kentucky-2023-poll-cameron-catches-up-to-beshear-in-governors-race/"
  },
  {
    "text": "Operation Dark Horse: Surprise entry in 2024 GOP race  —  has faced long odds before and won.  —  As an Air Force major and combat pilot, he helped end the military's reluctance to face up to the threat of electromagnetic pulse warfare and start building defenses of strategic bases.",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/operation-dark-horse-surprise-entry-in-2024-gop-race"
  },
  {
    "text": "Complaint Calls for Trump New York Trial Judge's Clerk to Be Disbarred for Excessive Political Donations  —  The top clerk for New York Justice Arthur Engoron, Allison Greenfield, appears to have violated judicial rules preventing officers of the court from making excessive political donations, Breitbart News has learned.",
    "url": "https://www.breitbart.com/politics/2023/11/02/complaint-calls-for-trump-new-york-trial-judges-clerk-to-be-disbarred-for-excessive-political-donations/"
  },
  {
    "text": "John Fetterman predicts Joe Manchin is ‘not going to be around much longer’ in the Senate: 'I'm going to get his parking space'  — Sen. John Fetterman predicted that fellow Democratic Sen. Joe Manchin won't be “around much longer.”  — Manchin hasn't announced 2024 plans.",
    "url": "https://www.businessinsider.com/fetterman-manchin-dress-code-not-senator-much-longer-2023-11?op=1"
  },
  {
    "text": "Netanyahu: No temporary ceasefire without our hostages released; no fuel into Gaza  —  In a brief televised statement before the start of Shabbat, Prime Minister Benjamin Netanyahu says he has told visiting US Secretary of State Antony Blinken that he rejects any temporary halt to the fight … ",
    "url": "https://www.timesofisrael.com/liveblog_entry/netanyahu-no-temporary-ceasefire-without-our-hostages-released-no-fuel-into-gaza/"
  },
  {
    "text": "Biden quietly tapped Obama to help shape his AI strategy  —  Former President Barack Obama advised the White House over the past five months on its plan to address artificial intelligence.  —  WASHINGTON — Former President Barack Obama quietly advised the White House over the past five months … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-quietly-tapped-obama-help-shape-ai-strategy-rcna123238"
  },
  {
    "text": "Nikki Haley isn't divulging what she said in paid private speeches  —  The GOP presidential candidate earned between $100,000 and $1 million for each of a dozen appearances.  Her team says she didn't keep records of her words.  —  Nikki Haley doesn't have transcripts … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-isnt-divulging-paid-private-speeches-corporations-rcna123281"
  },
  {
    "text": "Chase Strangio on asking SCOTUS to review Tennessee's trans care ban, a Law Dork Q&A  —  “We are going to the Supreme Court because the Sixth Circuit opinion was catastrophically wrong as a doctrinal matter and as moral matter.”  —  On Nov. 1, lawyers for Tennessee families and medical providers asked … ",
    "url": "https://www.lawdork.com/p/chase-strangio-scotus-trans-care-ban-qa"
  },
  {
    "text": "Court tosses EPA ban on pesticide linked to brain damage in kids  —  A federal appeals court on Thursday is tossing the Environmental Protection Agency's (EPA) ban on a pesticide that has been linked to brain damage in children.  —  The decision from the 8th Circuit Court of Appeals to send … ",
    "url": "https://thehill.com/policy/energy-environment/4291117-court-tosses-epa-ban-pesticide/"
  },
  {
    "text": "Biden weighs border deal — altering asylum law for Ukraine aid  —  Republicans placed a political lighting rod of an issue squarely into the biggest legislative matter before Congress.  —  Top Biden officials are preparing Democratic lawmakers and immigration policy advocates for the likelihood … ",
    "url": "https://www.politico.com/news/2023/11/02/biden-ukraine-aid-deal-00125125"
  },
  {
    "text": "How Microsoft is making a mess of the news after replacing staff with AI  —  False claims that President Joe Biden fell asleep during a moment of silence for victims of the Maui wildfire.  A conspiracy theory that the latest surge in Covid-19 cases is being orchestrated by the Democratic Party ahead of the election.",
    "url": "https://www.cnn.com/2023/11/02/tech/microsoft-ai-news/"
  },
  {
    "text": "Mike Johnson, House Republicans pass Israel aid bill, setting up clash with Schumer, McConnell and Biden  —  Ken Tran Francesca Chambers Riley BegginUSA TODAY  —  WASHINGTON - The House of Representatives approved more than $14 billion in Israel aid Thursday afternoon setting … ",
    "url": "https://www.usatoday.com/story/news/politics/2023/11/02/house-israel-aid-mcconnell-schumer-biden/71393928007/"
  },
  {
    "text": "Ivanka Trump Loses Court Fight to Block Her Testimony Next Week  —  The former president's daughter had better luck with her first appeal, which led to the dismissal of the claims against her  —  The former president's daughter Ivanka Trump lost her effort to pause her testimony on Wednesday … ",
    "url": "https://themessenger.com/politics/ivanka-trump-loses-must-testify-next-week"
  }
]