[
  {
    "text": "Male Pollsters Shocked — Shocked!!  — When a Woman Pollster Discovers Women Voters  —  On Friday, Nate Silver tweeted and substacked a piece declaring that there must be herding going on in the casino.  —  His substack analysis didn't acknowledge, however, that this herding was going on in his casino.",
    "url": "https://www.emptywheel.net/2024/11/03/male-pollsters-shocked-shocked-when-a-woman-pollster-discovers-women-voters/"
  },
  {
    "text": "Major pollster drops final battleground poll numbers  —  Harris hold slim leads in four of the seven main battleground states  —  The final New York Times/Siena College Battleground poll of the 2024 race shows a razor-tight election in the battleground states just days before the election.",
    "url": "https://www.foxnews.com/politics/major-pollster-drops-final-battleground-poll-numbers"
  },
  {
    "text": "Trump talks about reporters being shot and says he shouldn't have left White House after 2020 loss  —  Donald Trump gave a profane and conspiracy-laden speech two days before the presidential election, talking about reporters being shot and suggesting he “shouldn't have left” the White House after his 2020 loss to Democrat Joe Biden.",
    "url": "https://apnews.com/article/donald-trump-kamala-harris-presidential-election-a310fbc211ad8f0f5e290547ec284187"
  },
  {
    "text": "Trump Boasts ‘Every Rally Is Full’ as Camera Immediately Pans to Empty Seats, People Leaving  —  The former president falsely claimed his rallies “do not have any seats that are empty”  —  A savvy camera operator fact checked Donald Trump live.  —  During his rally in Greensboro … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-rally-full-empty-seats-1235151596/"
  },
  {
    "text": "Trump Forgets What State He's in During Home-Stretch Rally Blitz  —  The GOP presidential nominee was lethargic during his appearance in Kinston, North Carolina on Sunday  —  Donald Trump appeared to be running out of steam and memory on Sunday during his fifth rally out of six that he planned … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-forgets-what-state-north-carolina-rally-1235152016/"
  },
  {
    "text": "Trump says he doesn't mind someone shooting at journalists at rally  —  Trump's latest comments were an escalation of violent language he and his supporters have used in recent days.  —  Trump says he 'doesn't mind much' if press is shot at  —  LITITZ, Pa. — Donald Trump told a crowd … ",
    "url": "https://www.washingtonpost.com/elections/2024/11/03/trump-rally-media-shooting/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwNjA2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxOTkyMzk5LCJpYXQiOjE3MzA2MDY0MDAsImp0aSI6IjM4ZDkxYTkyLTQwNjEtNDBmMC05Mzc4LTgxZTFlY2ViNDdjOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbGVjdGlvbnMvMjAyNC8xMS8wMy90cnVtcC1yYWxseS1tZWRpYS1zaG9vdGluZy8ifQ.u0AgLzo6btS1kp8GmlD4N0JpRfGuYPw5mRLJ3Pahtuw&itid=gfta"
  },
  {
    "text": "Harris campaign: The Iowa poll is exciting, but...  Democrats were giddy Saturday when a gold-standard poll found Kamala Harris narrowly leading Donald Trump in deep-red Iowa.  But Harris' senior campaign officials are cautioning against getting too excited about the Des Moines Register survey.",
    "url": "https://www.politico.com/live-updates/2024/11/03/2024-elections-live-coverage-updates-analysis/kamala-harris-iowa-poll-reaction-00187008"
  },
  {
    "text": "Teenager wearing Trump shirt charged with punching Harris supporter, 70  —  STUART — With election day just three days away, a teenager and apparent supporter of former President Donald Trump was arrested here Saturday at a rally in support of Vice President Kamala Harris and charged with punching a 70-year-old woman in the stomach.",
    "url": "https://www.tcpalm.com/story/news/local/martin-county/2024/11/02/stuart-police-charge-teen-with-punching-harris-supporter-70/76014623007/"
  },
  {
    "text": "Univision Poll: More than 60% of Latino voters in Pennsylvania support Kamala Harris amid the controversy over calling Puerto Rico a “floating island of garbage” at a Trump rally  —  A Univision and YouGov survey shows that 69% of respondents considered comments defining Puerto Rico as … ",
    "url": "https://www.univision.com/noticias/elecciones-en-estados-unidos-2024/yougov-univision-poll-pennsylvania-latino-voters-show-strong-support-for-kamala-harris-amid-controversial-trump-rally-remarks"
  },
  {
    "text": "Nevada Republicans hold 50,000 ballot lead over Democrats after end of early voting  —  About a half-million more ballots can be expected to be cast in Nevada, based on turnout from the 2020 election.  —  Nevada Democrats have their work cut out for them between now Election Day on Tuesday if early voting turnout is any indication.",
    "url": "https://www.rgj.com/story/news/politics/elections/2024/11/02/nevada-republicans-hold-50000-early-vote-lead-over-democrats/76010274007/"
  },
  {
    "text": "If Trump wins the election, these 11 issues will be under threat  —  The impact will be felt in many aspects of American life and across the world  —  This is the first part of the standfirst This is the second part of the standfirst  —  Headline what's at stake?",
    "url": "https://www.theguardian.com/us-news/ng-interactive/2024/nov/03/if-trump-wins-the-election-these-11-issues-will-be-under-threat"
  },
  {
    "text": "After their son came out, this conservative Christian couple went into a closet of their own  —  As soon as Greg McDonald Jr. saw his parents, he knew he was in trouble.  His father stood waiting for him with his arms folded and his brow furrowed.  Beside him was Greg's mother, her eyes red and puffy.",
    "url": "https://www.cnn.com/2024/11/03/us/conservative-christian-coming-out-gay-cec/"
  },
  {
    "text": "North Carolina—and Iowa?  —  I did not see this coming  —  N.B.—Please join me for the last “Ask Mary Anything within Reason” before the election.  It's going to be a good one!  —  Thanks to Donald and the fact that we've been subjected to the Big Lie for almost four years … ",
    "url": "https://www.marytrump.org/p/north-carolinaand-iowa"
  },
  {
    "text": "Trump doesn't rule out banning vaccines if he becomes president: 'I'll make a decision'  —  In an interview with NBC News, the former president also said that a push by RFK Jr. to remove fluoride in water “sounds OK to me.”  —  Former President Donald Trump said that Robert F. Kennedy Jr. would have a … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-banning-vaccines-president-rfk-fluoride-rcna178570"
  },
  {
    "text": "How women's phones became a tool for abortion surveillance  —  Americans shouldn't accept a reality where their phones are sleeper agents for stalkers and fundamentalist politicians.  —  For years, data brokers have abused Americans' most personal data in every way possible … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/abortion-data-brokers-phones-google-apple-wyden-rcna178479"
  },
  {
    "text": "Security fencing goes up around White House, Capitol, VP residence  —  New security fencing went up around the White House, U.S. Capitol and Vice President Harris's residence in Washington, D.C. as authorities prepare for Election Day in the event there may be political unrest in the coming days.",
    "url": "https://thehill.com/homenews/campaign/4969264-security-fencing-goes-up-around-white-house-capitol-vp-residence/"
  },
  {
    "text": "Texas OB-GYNs leaving state in face of strict abortion laws  —  Texas' strict abortion laws have hindered doctors in the state, leaving them unable to offer comprehensive maternity care to pregnant women, according to Dr. Emily Briggs, an obstetrician and family physician who works in central Texas.",
    "url": "https://www.cbsnews.com/news/texas-abortion-ob-gyn-doctor-training-60-minutes/"
  },
  {
    "text": "Georgia election officials defend voting system against barrage of false claims, conspiracy theories  —  More than 70 million people have already voted in the 2024 election, and Gabriel Sterling, chief operating officer for the Georgia Secretary of State's office, knows what he'll say to people who will inevitably challenge the results.",
    "url": "https://www.cbsnews.com/news/georgia-election-officials-defend-system-after-trump-fraud-claims-60-minutes/"
  }
]