[
  {
    "text": "Mike Johnson expected to join Trump at N.Y. criminal trial … - North Dakota Gov. Burgum, a Trump VP contender, is also expected in court on Tuesday, Axios has learned.  — So is fellow VP contender Vivek Ramaswamy, his spokesperson confirmed to Axios on Monday.",
    "url": "https://www.axios.com/2024/05/14/mike-johnson-new-york-trump-criminal-trial"
  },
  {
    "text": "Speaker Johnson to attend Trump trial in Manhattan in show of support  —  House Speaker Mike Johnson is in Manhattan on Tuesday morning, his office tells Fox News Digital  —  House Speaker Mike Johnson, R-La., is expected in downtown Manhattan on Tuesday morning to show solidarity with former President Trump during his criminal trial.",
    "url": "https://www.foxnews.com/politics/speaker-johnson-attend-trump-trial-manhattan-show-support"
  },
  {
    "text": "With eyes shut, Trump endures testimony from his nemesis  —  The former president's demeanor Monday was markedly different than last week, when Stormy Daniels testified.  —  NEW YORK — Face to face in court on Monday with his fixer-turned-nemesis Michael Cohen — the witness whose testimony … ",
    "url": "https://www.politico.com/news/2024/05/13/trump-endures-trial-testimony-cohen-00157728"
  },
  {
    "text": "DOJ requests judge order Steve Bannon to begin prison sentence  —  An appeals court upheld Bannon's contempt of Congress conviction last week.  —  Steve Bannon, former adviser to Donald Trump, speaks at the Turning Point Action conference in West Palm Beach, Fla., July 16, 2023.",
    "url": "https://abcnews.go.com/Politics/doj-requests-judge-order-steve-bannon-begin-prison/story?id=110209704"
  },
  {
    "text": "Playbook: The 2024 campaign heads to the House floor  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  CLICKER — “Trump's Lawyers Are Making Major Mistakes,” by Ankush Khardori: “Put simply, [DONALD] TRUMP's legal team has made several considerable … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/14/the-2024-campaign-heads-to-the-house-floor-00157791"
  },
  {
    "text": "Louisiana lawmakers insist child rape victims must carry their pregnancy to term  —  Former President Donald Trump, now the presumptive Republican nominee, boasts that he “broke Roe v. Wade.”  In the aftermath, according to Trump, “states are working very brilliantly” to impose various restrictions … ",
    "url": "https://popular.info/p/louisiana-lawmakers-insist-child"
  },
  {
    "text": "UNC-Chapel Hill BOT votes to divert DEI funding, redirecting it to campus public safety  —  The UNC-Chapel Hill Board of Trustees has voted to divert $2.3 million away from diversity, equity and inclusion programs and into “public safety.”  —  The unanimous vote occurred at a special Board of Trustees meeting Monday morning.",
    "url": "https://www.wunc.org/education/2024-05-13/dei-unc-chapel-hill-trustees-vote-redirect-funding-police"
  },
  {
    "text": "Trump is gagged.  So his surrogates say the forbidden stuff for him.  —  Three GOP senators have appeared with Trump in court and conveniently proceeded to say precisely what he can't.  —  Donald Trump's mouth and keyboard fingers have been relatively disciplined — by his own standards … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/13/trump-is-gagged-so-his-surrogates-say-forbidden-stuff-him/"
  },
  {
    "text": "FACT SHEET: President Biden Takes Action to Protect American Workers and Businesses from China's Unfair Trade Practices  —  President Biden's economic plan is supporting investments and creating good jobs in key sectors that are vital for America's economic future and national security.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/05/14/fact-sheet-president-biden-takes-action-to-protect-american-workers-and-businesses-from-chinas-unfair-trade-practices/"
  },
  {
    "text": "Biden Signs Ban on Imports of Russian Nuclear Reactor Fuel  — Russian supplies of enriched uranium to be barred in 90 days  — Move could boost costs for US nuclear plants, risk retaliation  —  President Joe Biden on Monday signed legislation banning the import of Russian enriched uranium … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-13/biden-signs-ban-on-imports-of-russian-nuclear-reactor-fuel"
  },
  {
    "text": "MIT Hired Six New Diversity Deans.  Two of Them Are Serial Plagiarists, Complaint Alleges.  —  In dissertation titled ‘Cite a Sista,’ Tracie Jones-Barrett stole an entire passage on ‘ethical considerations’ from her classmate  —  In June 2021, a year into the cultural aftershocks of George Floyd's death … ",
    "url": "https://freebeacon.com/campus/mit-hired-six-new-diversity-deans-two-of-them-are-serial-plagiarists-complaint-alleges/"
  },
  {
    "text": "Biden's polling denial: Why he doesn't believe he's behind … - That bedrock belief has informed Biden's largely steady-as-she-goes campaign — even as many Democrats outside the White House are agitating for the campaign to change direction, given that Biden is polling well behind where he was four years ago.",
    "url": "https://www.axios.com/2024/05/14/biden-polls-denial-trump-2024-election"
  },
  {
    "text": "Biden Levies Sweeping Tariffs on China, Intensifying Trade Fight With Trump  —  Presumed 2024 election foes are taking competing protectionist approaches against Beijing  —  WASHINGTON—One day after news broke that President Biden was planning to raise tariffs on Chinese electric vehicles to roughly 100% … ",
    "url": "https://www.wsj.com/politics/elections/biden-trump-tariffs-d405cbca"
  },
  {
    "text": "Debate devolves into snark-fest between Bowman and Latimer  —  The Democratic House challengers accused each other of colluding with Republicans.  —  NEW YORK — Sniping, snark and incessant interruptions defined the first televised debate in one of the country's most competitive primaries Monday night … ",
    "url": "https://www.politico.com/news/2024/05/13/ny-house-debate-bowman-latimer-00157772"
  },
  {
    "text": "2 Democratic candidates named Bob Ferguson withdraw from WA governor's race  —  SEATTLE (KOMO) — Washington Attorney General (AG) Bob Ferguson addressed recent developments in the state's governor's race Monday morning, days after two people named Robert Ferguson joined the ballot.",
    "url": "https://www.komonews.com/news/local/washington-governor-bob-ferguson-race-ballot-three-3-candidates-democrat-democratic-attorney-general-election-general-november-glen-morgan-campaign-press-conference-dave-reichert-jay-inslee"
  },
  {
    "text": "Order Regarding the Acquisition of Certain Real Property of Cheyenne Leads by MineOne Cloud Computing Investment I L.P.  —       By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 721 of the Defense Production Act of 1950 … ",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2024/05/13/order-regarding-the-acquisition-of-certain-real-property-of-cheyenne-leads-by-mineone-cloud-computing-investment-i-l-p/"
  },
  {
    "text": "Foreign-Born Population Grew by 5.1 Million in the Last Two Years  —  The largest two-year increase ever recorded  —  The foreign-born or immigrant population (legal and illegal) hit new record highs in March 2024 of 51.6 million and 15.6 percent of the total U.S. population.",
    "url": "https://cis.org/Report/ForeignBorn-Population-Grew-51-Million-Last-Two-Years"
  },
  {
    "text": "United Nations halves estimate of women and children killed in Gaza  —  Without any announcement, the United Nations (UN) significantly lowers its previously stated casualty list in the Gaza Strip  —  The United Nations has significantly adjusted Palestinian casualty figures for the ongoing war … ",
    "url": "https://nationalpost.com/news/world/israel-middle-east/united-nations-halves-estimate-of-women-and-children-killed-in-gaza"
  },
  {
    "text": "Tennessee woman denied abortion after fetus' ‘brain not attached’ slams state ban  —  State lawmakers 'don't see the mourning and the grieving that these moms' experience after getting a heartbreaking diagnosis, Breanna Cecil tells , Kelly Rissman  —  A Tennessee woman who was denied … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/tennessee-denied-abortion-ban-lawsuit-b2529144.html"
  }
]