[
  {
    "text": "A jittery Harris campaign makes big plans to clinch a narrow win  —  With two weeks to go until Election Day, Kamala Harris' top advisers are staring down numbers that show a wide majority of Americans saying the country is on the wrong track.  —  They're also confident that the next two weeks … ",
    "url": "https://www.cnn.com/2024/10/22/politics/kamala-harris-campaign-final-weeks/"
  },
  {
    "text": "Democrats brace for a possible crack in the blue wall and signs of North Carolina slipping  —  The Harris campaign has privately flagged concerns about Michigan.  But officials stress the race is close across the board.  —  The “blue wall” states of Wisconsin, Michigan and Pennsylvania … ",
    "url": "https://www.nbcnews.com/politics/2024-election/democrats-brace-crack-blue-wall-signs-north-carolina-slipping-rcna176046"
  },
  {
    "text": "Trump has a slight edge in Georgia over Harris, latest AJC poll finds  —  The Atlanta Journal-Constitution poll shows the race remains very close  —  Former President Donald Trump appears to have a slight edge in Georgia over Vice President Kamala Harris in an Atlanta Journal-Constitution poll … ",
    "url": "https://www.ajc.com/politics/trump-has-a-slight-edge-in-georgia-over-harris-latest-ajc-poll-finds/LVP66TCGKJCF5CEDNUBAYU3EW4/"
  },
  {
    "text": "Bruce Springsteen to headline Thursday's Harris-Obama rally in Atlanta  —  Rock legend Bruce Springsteen will headline Vice President Kamala Harris' first joint rally with former President Barack Obama in Atlanta on Thursday, kicking off a series of concerts in battleground states.",
    "url": "https://www.ajc.com/politics/bruce-springsteen-to-headline-thursdays-harris-obama-rally-in-atlanta/X3NAKIIEFVGIZKV3ZUUVJHSTWQ/"
  },
  {
    "text": "Trump ground game faces new fraud claims as video shows door-knock hack  —  Exclusive: clip from canvasser for Musk's America Pac reveals apparent ease in which GPS location can be spoofed  —  Donald Trump's ground game in Arizona and Nevada may be undercut by canvassers working … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/22/trump-ground-game-door-knock-hack-gps"
  },
  {
    "text": "Trump set to go on Joe Rogan's podcast  —  Former President Donald Trump is expected to record an interview with podcasting behemoth Joe Rogan on Friday.  The interview will take place at Rogan's studio in Austin, Texas, according to a person familiar with the plans who was granted anonymity to discuss the matter.",
    "url": "https://www.politico.com/live-updates/2024/10/22/2024-elections-live-coverage-updates-analysis/trump-joe-rogan-podcast-00184894"
  },
  {
    "text": "Jamie Dimon Privately Supports Kamala Harris.  He Just Won't Say So.  —  JPMorgan's chief executive has told associates of his support for the vice president, and his dislike of Donald Trump.  But fearful of blowback, he won't say it publicly.  —  When Jamie Dimon surprised the political … ",
    "url": "https://www.nytimes.com/2024/10/22/business/jamie-dimon-jpmorgan-harris-trump.html"
  },
  {
    "text": "What's Wrong With Donald Trump?  —  You've probably seen the clip by now.  Donald Trump is holding a town hall.  It's Monday, Oct. 14, in Pennsylvania.  He was being asked softball questions by Kristi Noem, the Republican governor of South Dakota, and there is a medical emergency in the crowd.",
    "url": "https://www.nytimes.com/2024/10/22/opinion/donald-trump-ezra-klein-podcast.html?unlocked_article_code=1.UE4.Vul5.qrxypmVNxcC1&smid=url-share"
  },
  {
    "text": "Rudy Giuliani must give control of luxury items and Manhattan apartment to Georgia election workers he defamed, judge rules  —  A federal judge on Tuesday ordered former Donald Trump attorney and New York mayor Rudy Giuliani to turn over all his valuable possessions and his Manhattan penthouse apartment … ",
    "url": "https://www.cnn.com/2024/10/22/politics/rudy-giuliani-bankruptcy-georgia-election-workers"
  },
  {
    "text": "Federal appeals court upholds trespassing charge used in hundreds of Jan. 6 prosecutions  —  WASHINGTON - A divided federal appeals court upheld a trespassing charge Tuesday against a defendant in the Capitol attack on Jan. 6, 2021, reinforcing a charge that contributed to nearly 300 sentencings so far.",
    "url": "https://www.usatoday.com/story/news/politics/2024/10/22/jan-6-trespassing-upheld-circuit-court-appeals/75792047007/"
  },
  {
    "text": "Army ordered to release records on Trump's Arlington cemetery visit  —  A federal judge has ordered Army officials to release their records by the end of this week regarding President Donald Trump's controversial visit to Arlington National Cemetery this summer.",
    "url": "https://www.militarytimes.com/news/pentagon-congress/2024/10/22/army-ordered-to-release-records-on-trumps-arlington-cemetery-visit/"
  },
  {
    "text": "Trump cancels — again (this time, on RFK Jr.)  —  Donald Trump was scheduled to appear at a virtual town hall with Robert F. Kennedy Jr. and former Rep. Tulsi Gabbard (D-Hawaii) today at 2 p.m. — but it was canceled, with the organizers citing “changes in Trump's schedule.”",
    "url": "https://www.politico.com/live-updates/2024/10/22/2024-elections-live-coverage-updates-analysis/trump-rfk-gabbard-town-hall-00184884"
  },
  {
    "text": "Trump has made more than 100 threats to prosecute or punish perceived enemies  —  With just two weeks remaining until the presidential election, former President Donald Trump has used his most recent appearances on podcast and cable interviews to escalate attacks on fellow Americans whom he calls “the enemy from within.”",
    "url": "https://www.npr.org/2024/10/21/nx-s1-5134924/trump-election-2024-kamala-harris-elizabeth-cheney-threat-civil-liberties"
  },
  {
    "text": "Ex-Abercrombie CEO arrested on sex trafficking charges  —  The former CEO of fashion giant Abercrombie & Fitch (A&F) and his British partner have been arrested and are facing sex trafficking charges.  —  Mike Jeffries, his partner Matthew Smith and the couple's alleged middleman were arrested on Tuesday morning.",
    "url": "https://www.bbc.com/news/articles/cgj4j05wy31o"
  },
  {
    "text": "When an Older White Catholic Man Admits, “This Toxicity that Exists Is Really Embarrassing”  —  When I vowed to stop calling Liz Cheney “BabyDick” when she announced she would vote to impeach Donald Trump, the second time, I wrote: … I thought back on it as I watched this clip … ",
    "url": "https://www.emptywheel.net/2024/10/22/when-an-older-white-catholic-man-admits-this-toxicity-that-exists-is-really-embarrassing/"
  },
  {
    "text": "Fox News gave nearly 500 times more coverage to McDonald's stunt than Trump's threats to Social Security  —  Trump's tax, trade, and deportation policies could deplete the Social Security Trust Fund by 2031, resulting in huge benefit cuts for seniors  —  RESEARCH CONTRIBUTIONS FROM TYLER MONROE & NOAH DOWE",
    "url": "https://www.mediamatters.org/social-security/fox-news-gave-nearly-500-times-more-coverage-mcdonalds-stunt-trumps-threats-social"
  },
  {
    "text": "A CNN investigation reveals how deceptive political fundraising has misled elderly Americans into giving away millions of dollars  —  The 80-year-old communications engineer from Texas had saved for decades, driving around in an old car and buying clothes from thrift stores so he'd have enough money to enjoy his retirement years.",
    "url": "https://www.cnn.com/interactive/2024/10/politics/political-fundraising-elderly-election-invs-dg/"
  },
  {
    "text": "Voters prefer Harris's agenda to Trump's — they just don't realize it.  Take our quiz.  —  Try our interactive quiz to see how well you (and other voters) align with each candidate's agenda.  —  As presidential candidates, Kamala Harris and Donald Trump are neck and neck in polls.",
    "url": "https://www.washingtonpost.com/opinions/interactive/2024/trump-harris-policy-quiz/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5NTY5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwOTU1NTk5LCJpYXQiOjE3Mjk1Njk2MDAsImp0aSI6IjI1NmIxNGNlLWMxMmEtNDA5YS04YTI4LWY2NDNmOWIyMWYyYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy9pbnRlcmFjdGl2ZS8yMDI0L3RydW1wLWhhcnJpcy1wb2xpY3ktcXVpei8ifQ.cKETRuytzHkf7UWkJx7IyAE2NDGYU-fzV8J86R4vVLM&itid=gfta"
  },
  {
    "text": "Charlamagne tha God laughs off claim Trump is not racist: 'It's hysterical'  —  Radio host Charlamagne tha God blasted Lara Trump on Monday for claims that her father-in-law, former President Trump, is not racist.  —  In an interview on “The Breakfast Club,” the younger Trump said she had … ",
    "url": "https://thehill.com/homenews/race-politics/4946861-charlamagne-tha-god-donald-trump-racist-lara-trump-breakfast-club-harris-biden/"
  },
  {
    "text": "Kamala Harris Plagiarized Pages of Congressional Testimony From a Republican Colleague.  Plus, a Fictionalized Story About Human Trafficking.  —  On April 24, 2007, Kamala Harris testified before Congress in support of the John R. Justice Prosecutors and Defenders Incentive Act of 2007.",
    "url": "https://freebeacon.com/democrats/kamala-harris-plagiarized-pages-of-congressional-testimony-from-a-republican-colleague-plus-a-fictionalized-story-about-human-trafficking/"
  },
  {
    "text": "Judge tosses Mark Meadows' bid to obtain White House records for use in Ga. criminal case  —  Donald Trump's former White House chief of staff hoped to use the records to aid in his legal defense.  —  A federal judge has thrown out former Trump White House Chief of Staff Mark Meadows' bid … ",
    "url": "https://www.politico.com/news/2024/10/22/mark-meadows-georgia-criminal-case-00184897"
  },
  {
    "text": "Trump's growing threats to strip broadcast licenses send chills across industry  —  New York CNN  —  Broadcast television licensing is not ordinarily a hot topic during a presidential election.  But Donald Trump's threats are not ordinary, either.  —  In the past two years … ",
    "url": "https://www.cnn.com/2024/10/22/media/trump-strip-tv-station-licenses-punish-media/"
  },
  {
    "text": "Will LA voters pony up to fight homelessness?  —  A FOR AMBIVALENT?  — Los Angeles residents say homelessness is the issue that worries them most, but that doesn't necessarily mean they're ready to spend more to address the problem.  —  In the balance is Los Angeles County's Measure A … ",
    "url": "https://www.politico.com/newsletters/california-playbook-pm/2024/10/21/will-la-voters-pony-up-to-fight-homelessness-00184735"
  },
  {
    "text": "Americans split on idea of putting immigrants in militarized “camps”  —  A policy proposed by former President Trump to round up and deport undocumented immigrants — even if it requires using military-guarded encampments — has Americans divided, per a new survey.",
    "url": "https://www.axios.com/2024/10/22/trump-mass-deportation-immigrant-camps"
  },
  {
    "text": "So Help Me God: Lawyers, Encryption, and Insurrection  —  I still owe you a longer post on what I gleaned from my deep dive into the mostly sealed immunity appendix over the weekend.  Here's my evolving understanding of the appendix so far. … But for now, I want to share a hypothesis … ",
    "url": "https://www.emptywheel.net/2024/10/22/lawyers-encryption-and-insurrection/"
  },
  {
    "text": "A Second Trump Administration Would Be a Carnival of Corruption and Greed  —  By now, the story has made the rounds.  Back in June, Oklahoma's superintendent for public instruction, Ryan Walters, ordered every classroom in the state to teach the Bible between fifth grade and high school.",
    "url": "https://www.nytimes.com/2024/10/22/opinion/trump-second-term-corruption.html"
  },
  {
    "text": "The Many Links Between Project 2025 and Trump's World  —  Former president Donald J. Trump has repeatedly claimed that he had nothing to do with Project 2025, the Heritage Foundation's conservative policy initiative to reshape the federal government.  Mr. Trump has said that he has not read … ",
    "url": "https://www.nytimes.com/interactive/2024/10/22/us/politics/project-2025-trump-heritage-foundation.html?unlocked_article_code=1.UE4.6Xr7.2oxoPYMDI8aZ&smid=url-share"
  },
  {
    "text": "CBS News Producer Wonders: ‘Are Jews Really Human Like Us?’  —  Say, remember when CBS News put anchor Tony Dokoupil through a Maoist struggle session for the crime of asking tough questions to Ta-Nehisi Coates for his ignorant take on the Israeli-Palestinian conflict?",
    "url": "https://hotair.com/ed-morrissey/2024/10/22/cbs-news-producer-wonders-are-jews-really-human-like-us-n3796118"
  }
]