[
  {
    "text": "Former aide: Trump ‘feels this election slipping away’  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions  — descriptions off, selected",
    "url": "https://thehill.com/homenews/campaign/4825718-sarah-matthews-trump-aide-election/"
  },
  {
    "text": "The Media's Double Standard Favors Donald Trump, Not Kamala Harris … Conservatives are complaining about media bias, as is their wont, especially when Republicans are losing.  They are correct that Kamala Harris has enjoyed fairly positive coverage to date.",
    "url": "https://nymag.com/intelligencer/article/medias-bias-kamala-harris-donald-trump-double-standard.html"
  },
  {
    "text": "12:30 Report — GOP presses Trump to abandon insults  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/newsletters/1230-report/4825830-gop-presses-donald-trump-to-abandon-insults/"
  },
  {
    "text": "The Trump Campaign's ‘Please Shut Up’ Phase  —  That was a crazy public service provided by Elon Musk and X.  —  The X Spaces interview delivered Donald Trump without makeup or dress-up, talking unselfconsciously: manic, boastful, untruthful, aggrieved, abusive, obsessive, random, ignorant … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/trump-campaign-musk-interview/679451/"
  },
  {
    "text": "Kamala Harris would debate Donald Trump in Grand Rapids on this condition, campaign says  —  GRAND RAPIDS, MI — Campaign officials for Vice President Kamala Harris said they would consider debating Donald Trump in Grand Rapids, but first he must demonstrate his willingness to participate in an earlier commitment.",
    "url": "https://www.mlive.com/politics/2024/08/kamala-harris-would-debate-donald-trump-in-grand-rapids-on-this-condition-campaign-says.html"
  },
  {
    "text": "Trump rambles, slurs his way through Elon Musk interview.  It was an unmitigated disaster.  —  For a fascism-curious billionaire who loves cuddling up to right-wing loons, Elon Musk sure is good at making right-wing politicians look stupid.  —  For a fascism-curious billionaire who loves cuddling … ",
    "url": "https://www.usatoday.com/story/opinion/columnist/2024/08/12/trump-musk-interview-x-twitter-spaces-disaster/74774628007/"
  },
  {
    "text": "Missouri voters could face choice between continued abortion ban and new constitutional amendment  —  Missouri voters will decide in November whether to guarantee a right to abortion with a constitutional amendment that would reverse the state's near-total ban on the procedure.",
    "url": "https://apnews.com/article/abortion-ballot-measures-sports-betting-minimum-wage-0c0a28e5176a647b47aaca5a5d287628"
  },
  {
    "text": "With over 577,000 signatures verified, Arizona will put abortion rights on the ballot  —  Arizona voters will get to decide in November whether to add the right to an abortion to the state constitution.  —  The Arizona secretary of state's office said Monday that it had certified 577,971 signatures … ",
    "url": "https://apnews.com/article/arizona-abortion-ballot-petitions-ff88d989019a1e4bf10fabd5d7acc801"
  },
  {
    "text": "UAW hits Musk, Trump with federal labor charges over union-busting comments … The United Auto Workers union on Tuesday filed federal labor charges with the National Labor Relations Board against former President Donald Trump and billionaire Elon Musk for publicly applauding the practice of firing employees who threaten to strike.",
    "url": "https://www.cnbc.com/2024/08/13/musk-trump-uaw-labor-union-x-interview.html"
  },
  {
    "text": "Trump Email Hack Is A Moment Of Reckoning For Him—Or The News Media  —  Outlets like the New York Times owe their readers frenzied coverage of his campaign's emails, or a mea culpa for their history-altering emails fixation in 2016  —  You might say Politico won the weekend with a metascoop.",
    "url": "https://www.offmessage.net/p/trump-email-hack-is-a-moment-of-reckoning"
  },
  {
    "text": "News outlets were leaked insider material from the Trump campaign.  They chose not to print it  —  At least three news outlets were leaked confidential material from inside the Donald Trump campaign, including its report vetting JD Vance as a vice presidential candidate.",
    "url": "https://apnews.com/article/trump-vance-leak-media-wikileaks-e30bdccbdd4abc9506735408cdc9bf7b"
  },
  {
    "text": "Workers allege ‘nightmare’ conditions at Kentucky startup JD Vance helped fund  —  As a venture capitalist, JD Vance repeatedly touted his guiding principles for investing in a company: A business should not only turn a profit, it should also help American communities.",
    "url": "https://www.cnn.com/2024/08/13/politics/kentucky-startup-appharvest-jd-vance/"
  },
  {
    "text": "Republican who voted to convict Trump says he'll support him in November  —  Former Sen. Richard Burr (R-N.C.) says he plans to vote for former President Donald Trump this November, even though he voted to convict Trump at his second impeachment trial.  —  What You Need To Know",
    "url": "https://spectrumlocalnews.com/nc/triangle-sandhills/news/2024/08/13/richard-burr-trump-impeachment"
  },
  {
    "text": "How Long Until Trump Fires His Campaign Managers?  —  Chris and Susie best be sleeping with one eye open.  —  ∙ Paid  —  1. Pear-Shaped  —  One of the Iron Laws of Trumpism is that it's always someone else's fault.  So when Donald Trump looks out today and surveys the world, someone will have to be blamed.",
    "url": "https://www.thebulwark.com/p/how-long-until-trump-fires-his-campaign"
  },
  {
    "text": "Donald Trump Says He Will Go to Venezuela if He Loses Election  —  During his interview with billionaire donor  —  said they could “meet next time in Venezuela” if he loses November's election.  —  “If something happens with this election, which would be a horror show … ",
    "url": "https://www.newsweek.com/donald-trump-flee-venezuela-loses-election-elon-musk-interview-1938321"
  },
  {
    "text": "Starbucks gets new CEO following boycott sparked by Gaza conflict  —  Starbucks announced a new CEO seeking to caffeinate the coffee chain's sales, which fell slightly in the previous quarter due to lighter customer traffic.  —  New CEO Brian Niccol, the current CEO of Chipotle, will replace outgoing CEO Laxman Narasimhan.",
    "url": "https://www.washingtonexaminer.com/news/business/3120266/starbucks-new-ceo-boycott-gaza-conflict/"
  },
  {
    "text": "Recent Voter Registration Data Offers Hint of Enthusiasm for Democrats  —  Two swing states have seen a boost in Democratic sign-ups since Kamala Harris entered the race.  —  Ever since Vice President Kamala Harris entered the presidential campaign three weeks ago, polls and campaign finance data have shown how the race has changed.",
    "url": "https://www.nytimes.com/2024/08/13/upshot/democrats-voter-registration.html"
  },
  {
    "text": "Historic Gun Suit Survives Serious Legal Threat Engineered by Indiana Republicans  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.",
    "url": "https://www.propublica.org/article/gary-indiana-lawsuit-guns-gunmakers-gop-glock-smith-wesson"
  },
  {
    "text": "A Consensus No Longer  —  The American Society of Plastic Surgeons becomes the first major medical association to challenge the consensus of medical groups over “gender-affirming care” for minors.  —  / Eye on the News / Health Care, The Social Order  —  The main justification for … ",
    "url": "https://www.city-journal.org/article/a-consensus-no-longer"
  },
  {
    "text": "Nate Silver on Kamala Harris's Chances and the Mistakes of the ‘Indigo Blob’  —  Nate Silver came to fame in American politics for election forecasting.  But before Silver was in politics, he was a poker player.  And after getting into politics, he went back to being a poker player.",
    "url": "https://www.nytimes.com/2024/08/13/opinion/ezra-klein-podcast-nate-silver.html"
  },
  {
    "text": "Scoop: An inside look at Harris' Senate brain trust … - Harris's team also is relying on longtime ally Sen. Catherine Cortez Masto (D-Nevada), multiple Democratic sources told Axios. … - Sens. Cory Booker (D-N.J.), Laphonza Butler (D-Calif.) and Alex Padilla (D-Calif.) are also part of Harris' Senate brain trust.",
    "url": "https://www.axios.com/2024/08/13/kamala-harris-senate-democrats-campaign"
  },
  {
    "text": "Does Donald Trump understand how the ocean works?  —  Once again Monday night, he claimed that rising sea levels would create “more oceanfront property.”  —  There was no shortage of false claims and exaggerations offered by former president Donald Trump during his conversation with Elon Musk on Monday night.",
    "url": "https://www.washingtonpost.com/politics/2024/08/13/does-donald-trump-understand-how-ocean-works/"
  },
  {
    "text": "Brussels slaps down Thierry Breton over ‘harmful content’ letter to Elon Musk  —  Internal market commissioner's warning to owner of social media site X was not approved  —  Brussels has accused its internal market commissioner of going rogue by sending a letter to Elon Musk threatening punishment … ",
    "url": "https://www.ft.com/content/09cf4713-7199-4e47-a373-ed5de61c2afa"
  },
  {
    "text": "Watergate convinced us that the system works — until Trump showed otherwise  —  Fifty years ago last week, Richard Nixon resigned from the presidency.  His resignation was compelled by the impending release of the infamous White House tape recordings, which the Supreme Court, in a case that I argued, had just ordered disclosed.",
    "url": "https://thehill.com/opinion/campaign/4824212-watergate-convinced-us-that-the-system-works-until-trump-showed-otherwise/"
  }
]