[
  {
    "text": "Trump's Defense: He Intended to Steal Boxes and Boxes of Classified Documents  —  As I have been noting for months, in all of Jack Smith's rebuttals to Trump's claims that Presidents have absolute immunity, he floated scenarios that are pretty similar to stuff that Trump is known or suspected of doing.",
    "url": "https://www.emptywheel.net/2024/02/23/trumps-defense-he-intended-to-steal-boxes-and-boxes-of-classified-documents/"
  },
  {
    "text": "Wisconsin ethics commission refers Trump fundraising arm for prosecution  —  The bipartisan body recommended felony charges against Donald Trump's Save America committee as well as other Republicans  —  MADISON, Wis. — Bipartisan ethics regulators in Wisconsin have recommended felony charges … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/23/wisconsin-ethics-trump-fundraising-charges/"
  },
  {
    "text": "Trump moves to dismiss classified documents case  —  In a series of seven motions, he argued that the criminal charges against him in Florida are flawed.  —  Donald Trump is asking a federal judge in Florida to throw out his criminal case for hoarding classified secrets at his Mar-a-Lago estate … ",
    "url": "https://www.politico.com/news/2024/02/23/trump-classified-documents-case-00142907"
  },
  {
    "text": "Trump's takeover of the RNC will destroy it from within  —  His hand-picked candidates to lead the party don't show an understanding of what the job actually entails, and the GOP will pay the price.  —  As a real estate developer, Donald Trump loved to put his name on other people's buildings.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-lara-ronna-mcdaniel-rnc-chair-rcna139993"
  },
  {
    "text": "How a Bill Barr ‘assignment’ led to a Biden impeachment effort based on a lie  —  The Fact Checker  —  “We were not making a representation that everything in this 1023 [FBI report] was credible.”  — Former U.S. attorney Scott Brady in an interview with congressional investigators, Oct. 23",
    "url": "https://www.washingtonpost.com/politics/2024/02/23/how-bill-barr-assignment-led-biden-impeachment-effort-based-lie/"
  },
  {
    "text": "Biden's cheat sheets at fundraisers worry donors … - The staged Q&A sessions have left some donors wondering whether Biden can withstand the rigors of a presidential campaign, let alone potential debates with former President Trump, 77.  —  Biden advisers say the president is given notecards … ",
    "url": "https://www.axios.com/2024/02/23/biden-notecards-fundraisers-donors-age"
  },
  {
    "text": "No one is replacing Joe Biden, ffs  —  The bed-wetting needs to stop. … New York Times columnist Ezra Klein argued last week that President Joe Biden should step aside and not run for another term.  Klein argues Biden is too old to successfully run for president, and that Democrats … ",
    "url": "https://www.publicnotice.co/p/joe-biden-ezra-klein-wtf-man"
  },
  {
    "text": "A New Orleans magician says a Democratic operative paid him to make the fake Biden robocall  —  Dean Phillips' presidential campaign denounced the alleged actions of one of its consultants and said it may take legal action against him.  —  NEW ORLEANS — A Democratic consultant who worked … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-robocall-new-hampshire-strategist-rcna139760"
  },
  {
    "text": "Trump struggles to say ‘evangelical’ and muddles up Israel in wild, incoherent speech at Christian event  —  Republican candidate arrived late to Nashville speech looking flushed and exhausted to rant about Democrats, the Department of Education, the Capitol riot and the ‘silencing’ of religious groups",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-incoherent-speech-nashville-christians-b2501342.html"
  },
  {
    "text": "Trump Frames Election as Battle Against ‘Wicked’ System Bent on Attacking Christians  —  Speaking at a Christian media convention in Nashville, former President Donald J. Trump claimed that a “radical left, corrupt political class” was persecuting Christians.",
    "url": "https://www.nytimes.com/2024/02/22/us/politics/trump-national-christian-broadcasters.html"
  },
  {
    "text": "The Cash-Strapped Trump Campaign Is Trying to Get Away With a New Donor Loophole  —  As a cash crunch looms, Trump's campaign is miraculously not reporting donor refunds—an untested trick that makes it harder to tell how tired his donors really are. … Campaign donor refunds have been a part … ",
    "url": "https://www.thedailybeast.com/the-cash-strapped-trump-campaign-is-trying-to-get-away-with-a-new-donor-loophole"
  },
  {
    "text": "What Would Happen if Every American Got a Heat Pump  —  Getting these climate superheroes into more US homes would massively cut emissions, and it would be cost-effective.  Here's how the revolution would play out.  —  One of the most powerful weapons you can wield to fight climate change is ... an appliance.",
    "url": "https://www.wired.com/story/what-would-happen-if-every-american-got-a-heat-pump/"
  },
  {
    "text": "Statement from President Joe Biden Ahead of the Two-Year Anniversary of Russia's Brutal Assault Against Ukraine  —  Two years ago tomorrow, shortly before dawn, Russian missiles began exploding near the capital city of Kyiv.  Russian troops marched across the border into Ukraine.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/23/statement-from-president-joe-biden-ahead-of-the-two-year-anniversary-of-russias-brutal-assault-against-ukraine/"
  },
  {
    "text": "An ectopic pregnancy put her life at risk.  A Texas hospital refused to treat her.  —  The 25-year-old woman and her mother blame the state's abortion ban for a delay in care that doctors say put her “in extreme danger of losing her life”  —  ARLINGTON, Tex. — Kelsie Norris-De La Cruz tried … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/23/texas-woman-ectopic-pregnancy-abortion/"
  },
  {
    "text": "Florida surgeon general defies science amid measles outbreak  —  As a Florida elementary school tries to contain a growing measles outbreak, the state's top health official is giving advice that runs counter to science and may leave unvaccinated children at risk of contracting … ",
    "url": "https://www.washingtonpost.com/health/2024/02/22/florida-measles-outbreak-ladapo/"
  },
  {
    "text": "Justice Who Ruled That Embryos Are ‘Children’ Appeared On QAnon Conspiracist's Show  —  Alabama Chief Justice Tom Parker indicated on the show he was a proponent of the “Seven Mountains Mandate,” an explicitly theocratic doctrine at the heart of Christian nationalism.",
    "url": "https://www.huffpost.com/entry/tom-parker-alabama-ivf-embryo_n_65d7ea34e4b0cc1f2f7b3e26"
  },
  {
    "text": "Alabama IVF ruling a political gift for Democrats, headache for Republicans  —  An Alabama court ruling that frozen embryos created through fertility treatment are children has delivered an election-year opportunity for Democrats - and a political headache for Republicans.",
    "url": "https://www.bbc.com/news/world-us-canada-68377136"
  },
  {
    "text": "CBS seizes confidential files of fired reporter pursuing Hunter Biden laptop story in ‘unprecedented’ move: sources  —  The acclaimed CBS reporter who was investigating the Hunter Biden laptop scandal before she was fired last week had her personal files seized by the network in an “unprecedented” … ",
    "url": "https://nypost.com/2024/02/22/business/cbs-seizes-confidential-files-of-fired-reporter-pursuing-hunter-biden-laptop-story-in-unprecedented/"
  },
  {
    "text": "Democratic Presidential Candidate Dean Phillips Says He's Open to Being Nikki Haley's Running Mate on a ‘Unity Ticket’  —  Democratic presidential candidate Rep. Dean Phillips (D-MN) said on Thursday he would be open to becoming Republican presidential candidate Nikki Haley's running mate on a … ",
    "url": "https://www.mediaite.com/politics/democratic-presidential-candidate-dean-phillips-says-hes-open-to-being-nikki-haleys-running-mate-on-a-unity-ticket/"
  },
  {
    "text": "The Americans Who Need Chaos  —  They're embracing nihilism and upending politics.  —  Several years ago, the political scientist Michael Bang Petersen, who is based in Denmark, wanted to understand why people share conspiracy theories on the Internet.  He and other researchers designed … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/need-for-chaos-politicsl-science-concept/677536/"
  }
]