[
  {
    "text": "Ruling Against Trump Cuts to the Heart of His Identity  —  The finding by a judge in a New York civil case that Donald Trump committed fraud in valuing his real estate properties undermined the narrative of the business career that launched him in politics.  —  Nearly every aspect … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-fraud-ruling.html"
  },
  {
    "text": "How much would your house be worth if the Trump Organization owned it?  —  A year offering no shortage of bad news for Donald Trump outdid itself Tuesday afternoon, with New York Supreme Court Justice Arthur Engoron ruling that the former president's namesake business, the Trump Organization … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/trump-property-inflated-values/"
  },
  {
    "text": "New York judge finds Donald Trump liable for fraud  —  A New York judge found Donald Trump and his adult sons liable for fraud and canceled the Trump Organization's business certification, a shocking ruling that poses an existential threat to the former president's financial empire as he runs for a second term in the White House.",
    "url": "https://www.cnn.com/2023/09/26/politics/trump-organization-business-fraud/"
  },
  {
    "text": "The Republican debate is fake  —  With Trump dominating the GOP primary, the debate is a cosplay of a competitive election — and a distraction from an ugly truth.  —  Tonight's Republican primary debate is not a real event.  It is a performance, a show, a pantomime: a shiny object … ",
    "url": "https://www.vox.com/2024-elections/2023/9/27/23890683/second-republican-debate-gop-fake-rnc-trump"
  },
  {
    "text": "Biden tops Trump by 5 points in new survey  —  President Biden tops former President Trump by 5 points among registered voters in a 2024 hypothetical matchup, new polling shows.  —  Asked who they'd back if Trump and Biden were their respective party's nominees, 45 percent of registered voters … ",
    "url": "https://thehill.com/homenews/campaign/4225778-biden-tops-trump-by-5-points-in-new-survey/"
  },
  {
    "text": "President Drink Bleach says what?  Trump now claims he beat George W. Bush and Barack Obama  —  The press should cover his decline anyway  —  Donald Trump is skipping another GOP primary debate this week and the theories abound as to why.  Some paint it as a smart strategy … ",
    "url": "https://www.salon.com/2023/09/27/drink-bleach-says-what-now-claims-he-beat-george-w-bush-and-barack-obama/"
  },
  {
    "text": "McCarthy's new shutdown strategy: Shifting the blame  —  Good morning, Early Birds.  The New York Times's Vanessa Friedman says it's “a cliché” to wear a Patagonia fleece vest in the office if you don't work in outdoor recreation — but it's so cold in The Post's newsroom.  What's a man to do?",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/mccarthys-new-shutdown-strategy-shifting-blame/"
  },
  {
    "text": "Trump Adds Two Attorneys to Criminal Defense Team  —  The former president has been stacking his defense team as he prepares for the trove of legal cases against him and their upcoming trials  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/trump-adds-two-attorneys-to-criminal-defense-team"
  },
  {
    "text": "Target says it will close nine stores in major cities, citing violence and theft  — Target said it will close nine stores across the country after struggling with crime and safety threats at those locations.  — Target, which has nearly 2,000 stores in the U.S., has been outspoken … ",
    "url": "https://www.cnbc.com/2023/09/26/target-says-it-will-close-nine-stores-citing-violence-and-theft-.html"
  },
  {
    "text": "US secures the release of the soldier who crossed into North Korea 2 months ago  —  The U.S. has secured the release of a U.S. soldier who sprinted across a heavily fortified border into North Korea more than two months ago, the White House announced Wednesday.  U.S. ally Sweden and rival China helped with the transfer.",
    "url": "https://apnews.com/article/north-korea-us-soldier-travis-king-00c171778e378d95fe1115fe31612ec2"
  },
  {
    "text": "Menendez ordered to turn over personal passport at arraignment  —  Sen. Bob Menendez (D-N.J.), who pleaded not guilty to federal bribery charges Wednesday, must turn over his personal passport as a condition for his release, multiple reports indicated following the senator's arraignment in Manhattan.",
    "url": "https://thehill.com/regulation/court-battles/4225703-menendez-ordered-to-turn-over-personal-passport-at-arraignment/"
  },
  {
    "text": "My President Joined a Picket Line  —  No matter what you think of Joe Biden, his decision to stand with UAW workers is historic.  And it might just get him reelected.  —  Pocket  —  Abraham Lincoln, arguably the most class-conscious president in American history, declared in his first annual message to the US Congress,",
    "url": "https://www.thenation.com/article/politics/biden-picket-line-uaw-strike/"
  },
  {
    "text": "The Quotable Milley: The chair's most memorable lines from the past four years  —  From white rage to Ukraine to the need for haircuts, Gen. Mark Milley hasn't been shy about giving his opinion.  —  If there is one military officer the average American can name, it is Gen. Mark Milley … ",
    "url": "https://www.politico.com/news/2023/09/27/mark-milley-quotes-ukraine-00117971"
  },
  {
    "text": "Tuberville says he opposed Joint Chiefs chair over ‘equal opportunity’ push  —  Alabama Sen. Tommy Tuberville (R) said he voted against the nomination of the Pentagon's next Joint Chiefs of Staff chairman over the military officer's push to promote “woke policies.”",
    "url": "https://thehill.com/policy/defense/4225842-tuberville-says-he-opposed-joint-chiefs-chair-over-equal-opportunity-push/"
  },
  {
    "text": "FCC chair proposes reinstating Obama-era net neutrality rules  —  Federal Communications Commission (FCC) Chairwoman Jessica Rosenworcel said on Tuesday that she plans to put forward a proposal to reinstate net neutrality rules that were repealed under former President Trump.",
    "url": "https://thehill.com/policy/technology/4224200-fcc-chair-proposes-reinstating-obama-era-net-neutrality-rules/"
  },
  {
    "text": "Arrest made in connection to 2015 disappearance and murder of Crystal Rogers, Kentucky mother of 5  —  A man has been arrested in connection with the 2015 disappearance and murder of Crystal Rogers, a Kentucky mother of five, the Louisville FBI office said in a statement Wednesday morning.",
    "url": "https://www.cbsnews.com/news/crystal-rogers-murder-disappearance-brooks-houck-arrested-kentucky/"
  },
  {
    "text": "Public Wants Budget Compromise to Avoid Government Shutdown  —  Neither party in Washington is seen as looking out for average Americans  —  West Long Branch, NJ - By a 2 to 1 margin, Americans want Congress to compromise on the federal budget in order to avoid a government shutdown.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_092723/"
  },
  {
    "text": "Unraveling what's really happening in Florida school libraries  —  On Tuesday, Popular Information reported that librarians in Charlotte County, Florida, were instructed by the school district superintendent to remove all books with LGBTQ characters.  This story was based on a document dated July 24 … ",
    "url": "https://popular.info/p/update-unraveling-whats-really-happening"
  },
  {
    "text": "“They've already succeeded”: Will Bunch on the GOP's impeachment clown show  —  They don't have evidence.  But they don't need any for their purposes.  —  ∙ Paid … As House Republicans turn the impeachment process into a joke with their evidence-free Joe Biden fishing expedition … ",
    "url": "https://www.publicnotice.co/p/biden-impeachment-inquiry-explained-will-bunch"
  },
  {
    "text": "Biden administration announces visa-free travel for Israelis  —  Israel will be joining the US Visa Waiver Program, allowing Israeli citizens to soon enter the United States without a visa and vice versa, the Biden administration has announced.  —  Israeli citizens will be expected to be able … ",
    "url": "https://www.cnn.com/2023/09/27/politics/biden-admin-israel-visa-waiver-program/"
  },
  {
    "text": "Comer Reveals Wires from China Have Joe Biden's Wilmington Home as the Beneficiary Address￼  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today announced the House Oversight Committee subpoenaed and obtained two bank wires revealing Hunter … ",
    "url": "https://oversight.house.gov/release/comer-reveals-wires-from-china-have-joe-bidens-wilmington-home-as-the-beneficiary-address%EF%BF%BC/"
  }
]