[
  {
    "text": "The Washington Post is in deep turmoil as Bezos remains silent on non-endorsement  —  New York CNN  —  One day after The Washington Post announced it would not endorse a presidential candidate in this year's election or in the future, its billionaire owner remains silent as the newspaper's staff are in turmoil.",
    "url": "https://www.cnn.com/2024/10/26/media/washington-post-jeff-bezos-endorsement-turmoil/"
  },
  {
    "text": "BREAKING: The Washington Post Has Died  —  Its stunning refusal to endorse Kamala Harris is the end of the venerable newspaper ...  D. Earl Stephens ✍️  —  1,021  —  I have been a subscriber of The Washington Post for 26 years.  —  I devoured it each day while riding … ",
    "url": "https://dearlstephens.substack.com/p/breaking-the-washington-post-has"
  },
  {
    "text": "It has fallen to me, the humor columnist, to endorse Harris for president  —  Isn't this what a newspaper is supposed to do?  —  The Washington Post is not bothering to endorse a candidate in the 2024 presidential election.  (Jeff Bezos, the founder of Blue Origin and the founder … ",
    "url": "https://www.washingtonpost.com/opinions/2024/10/26/washington-post-endorses-kamala-harris-satire/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5OTE1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMzAxMTk5LCJpYXQiOjE3Mjk5MTUyMDAsImp0aSI6IjZmNDVhNGI3LTk2NzUtNDQ2Ny1hOTE1LTJlOTc4YWI4YWFmMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEwLzI2L3dhc2hpbmd0b24tcG9zdC1lbmRvcnNlcy1rYW1hbGEtaGFycmlzLXNhdGlyZS8ifQ.-e7OOyCCBjp8Hw059JyTEdGNCsm5REJ6MeNHgnETEnI&itid=gfta"
  },
  {
    "text": "Elon Musk, enemy of ‘open borders,’ launched his career working illegally  —  Investors in Musk's first company worried about “our founder being deported” and gave him a deadline for obtaining a work visa.  —  PALO ALTO, Calif. — Long before he became one of Donald Trump's biggest donors … ",
    "url": "https://www.washingtonpost.com/business/2024/10/26/elon-musk-immigration-status/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5OTE1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMzAxMTk5LCJpYXQiOjE3Mjk5MTUyMDAsImp0aSI6IjQxZGVhY2ExLTg4NzQtNDAyYy05ZGU2LTMzYjZjODBjZDQwMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzEwLzI2L2Vsb24tbXVzay1pbW1pZ3JhdGlvbi1zdGF0dXMvIn0.A_tsea6jQIWaQ1Q1Rp1WROrhBlr0IksHUlC4vxqZXY0&itid=gfta"
  },
  {
    "text": "Harris' polling in NYC is lowest in decades for Democratic nominee: NYT poll  —  Harris has suffered a sharp decline in support, compared to President Biden's 2020 win in the Big Apple  —  Join Fox News for access to this content  —  A New York Times/Siena College poll has Vice-President Harris polling … ",
    "url": "https://www.foxnews.com/politics/harris-polling-in-nyc-is-lowest-in-decades-for-democratic-nominee-nyt-poll"
  },
  {
    "text": "5 things a tardy Trump said in Traverse City  —  Donald Trump was three hours late to his Friday night rally in Traverse City, Michigan.  We still watched it.  Here's what you missed: Trump apologized for being tardy to his event ... by telling the crowd in this critical battleground state … ",
    "url": "https://www.politico.com/live-updates/2024/10/25/2024-elections-live-coverage-updates-analysis/5-things-a-tardy-trump-said-in-traverse-city-00185674"
  },
  {
    "text": "Daughter of L.A. Times Owner Says Endorsement Decision Stemmed From Harris Stance on Gaza War  —  The decision by the owner, Patrick Soon-Shiong, to cancel the paper's planned endorsement of Kamala Harris sent shock waves through the organization.  It was not the first time he had gotten involved in newsroom affairs.",
    "url": "https://www.nytimes.com/2024/10/26/us/los-angeles-times-endorsement-soon-shiong.html?unlocked_article_code=1.VE4.30gn.uuGrsJAhi3Rr&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "‘I See You, and I Am With You.’ Texas Women Needed That Harris Rally.  —  The vice president's boisterous, joyous, and emotional Houston event Friday night proved the value of representation.  Abortion rights weren't just discussed — they were the whole point.  — Click to email a link to a friend (Opens in new window)",
    "url": "https://thebarbedwire.com/2024/10/26/i-see-you-and-i-am-with-you-texas-women-needed-that-harris-rally/"
  },
  {
    "text": "Man In MAGA Hat Arrested For Allegedly Punching Election Worker  —  Officials called the episode “ugly” and urged calm.  —  LOADING  —  A man wearing a pro-Trump hat repeatedly punched an elderly election worker in San Antonio, Texas, Thursday evening, according to police … ",
    "url": "https://www.huffpost.com/entry/maga-hat-punch-elderly-election-worker-police_n_671c131be4b00589e7dd14df"
  },
  {
    "text": "Ben Bradlee's Posthumous Advice to Jeff Bezos: You Need to Sell The Washington Post.  —  A spiked editorial puts the owner's conflicts in a sharp light.  And the uproars are only going to keep coming.  —  In the summer of 2013, the then-owner of POLITICO, Robert Allbritton … ",
    "url": "https://www.politico.com/news/magazine/2024/10/26/ben-bradlee-jeff-bezos-washington-post-00185685"
  },
  {
    "text": "5 takeaways from Trump's 3-hour interview with Joe Rogan  —  Former President Trump sat with Joe Rogan Friday for a three-hour interview, marking the GOP nominee's debut on one of the most popular podcasts in the country.  —  The two men appeared to show a mutual admiration for one another … ",
    "url": "https://thehill.com/homenews/campaign/4954999-donald-trump-joe-rogan-podcast-takeaways/"
  },
  {
    "text": "Obeying in advance  —  Greetings from Oklahoma.  Here are a few thoughts from here on video about the decisions of the owners of the Washington Post and the LA Times to suppress their editorial boards' decisions to endorse Kamala Harris.  —  A problem with the very wealthy is that, alas … ",
    "url": "https://snyder.substack.com/p/obeying-in-advance"
  },
  {
    "text": "Trump Praises Chinese President For Controlling Citizens ‘With An Iron Fist’  —  In an interview with Joe Rogan, Donald Trump praised Chinese President Xi Jinping as “a brilliant guy.”  —  LOADING  —  Former President Donald Trump heaped praise on authoritarian Chinese President Xi Jinping during … ",
    "url": "https://www.huffpost.com/entry/trump-praises-chinese-president-for-controlling-citizens-with-an-iron-fist_n_671d1644e4b07a44a28e2211"
  },
  {
    "text": "Ballots that arrive after Election Day are invalid, federal appeals court rules  —  A federal appeals court ruled Friday that votes in federal elections must be received by state officials by the time polls close, striking down a Mississippi law that allowed ballots to arrive after Election Day.",
    "url": "https://www.politico.com/live-updates/2024/10/25/2024-elections-live-coverage-updates-analysis/mail-in-voting-ruling-00185653"
  },
  {
    "text": "RFK Jr.'s presence on Michigan, Wisconsin ballots raises concerns for Trump  —  Robert F. Kennedy Jr.'s presence on the ballot in the swing states of Michigan and Wisconsin is raising concerns that he could inadvertently draw crucial votes from former President Trump.",
    "url": "https://thehill.com/homenews/campaign/4954034-kennedy-ballot-concerns-trump/"
  },
  {
    "text": "John Fetterman Fears Trump Is Stronger Than Ever  —  Philip Montgomery for The New York Times  —  Whatever the result of this election, Democrats will be in a moment of transformation afterward.  For nearly a decade, the party's energies have been devoted to defeating Donald Trump.",
    "url": "https://www.nytimes.com/2024/10/26/magazine/john-fetterman-interview.html"
  }
]