[
  {
    "text": "Gov. Greg Abbott pardons Daniel Perry, veteran who killed police brutality protester in 2020  —  A Travis County jury sentenced Perry to 25 years in prison last year, prompting Abbott to ask the state parole board to review his case.  —  More than a year after a Travis County jury convicted Daniel Perry … ",
    "url": "https://www.texastribune.org/2024/05/16/daniel-perry-greg-abbott-pardon/"
  },
  {
    "text": "Texas governor pardons ex-Army sergeant convicted of killing Black Lives Matter protester  —  Texas Gov. Greg Abbott issued a full pardon Thursday for a former U.S. Army sergeant convicted of murder for fatally shooting an armed demonstrator in 2020 during nationwide protests against police violence and racial injustice.",
    "url": "https://apnews.com/article/army-sergeant-murder-parole-black-lives-matter-4b1d0c54b0de451642bcf1e8cd75a7e5"
  },
  {
    "text": "Texas Gov. Greg Abbott pardons Daniel Perry, who killed Black Lives Matter protester in 2020  —  Serena Lin Tony PlohetskiUSA TODAY NETWORK  —  Gov. Greg Abbott on Thursday granted a full pardon to Daniel Perry, who was convicted of murder for the 2020 death of a Black Lives Matter protester … ",
    "url": "https://www.usatoday.com/story/news/nation/2024/05/16/texas-gov-pardon-daniel-perry-murder-black-lives-matter-protestor/73720504007/"
  },
  {
    "text": "At Justice Alito's House, a ‘Stop the Steal’ Symbol on Display … A photo obtained by The Times shows an inverted flag at the Alito residence on Jan. 17, 2021, three days before the Biden inauguration.  —  After the 2020 presidential election, as some Trump supporters falsely claimed … ",
    "url": "https://www.nytimes.com/2024/05/16/us/justice-alito-upside-down-flag.html"
  },
  {
    "text": "Scripps News Exclusive: Trump willing to include Kennedy in debates with Biden  —  Trump and President Biden have agreed to debate twice before 2024 election.  —  In an exclusive interview with Scripps News on Thursday, former President Donald Trump said he would have “no problem” … ",
    "url": "https://www.scrippsnews.com/politics/presidential-election/scripps-news-exclusive-trump-willing-to-include-kennedy-in-debates-with-biden"
  },
  {
    "text": "NC Senate votes to ban people from wearing masks in public for health reasons  —  RALEIGH, N.C. (WRAL) - The North Carolina Senate voted along party lines Wednesday to ban anyone from wearing masks in public for health reasons, following an emotional debate about the wisdom of the proposal.",
    "url": "https://www.wect.com/2024/05/16/nc-senate-votes-ban-people-wearing-masks-public-health-reasons/"
  },
  {
    "text": "DeSantis signs bill wiping climate change references from Florida law … - The heat index in Key West hit a record 115°F on Wednesday and the National Weather Service warned South Florida could expect well-above average temperatures with “hazardous heat index values this week.",
    "url": "https://www.axios.com/2024/05/16/desantis-florida-climate-change-law"
  },
  {
    "text": "Federal Consumer Financial Watchdog Survives Supreme Court Scrutiny  —  Justices reject claim CFPB funding structure violates Constitution  —  WASHINGTON—The Supreme Court on Thursday rejected a constitutional challenge that could have dismantled the Consumer Financial Protection Bureau … ",
    "url": "https://www.wsj.com/finance/regulation/federal-consumer-financial-watchdog-survives-supreme-court-scrutiny-e90485bd"
  },
  {
    "text": "One Area Where Biden Is Leading Trump: His Number of Donors  —  President Biden may be struggling in national polls, but he recently overtook former President Donald J. Trump in at least one important measure: the total number of donors who have given to his campaign, which is often seen as a proxy for voter engagement.",
    "url": "https://www.nytimes.com/interactive/2024/05/16/us/elections/biden-trump-donors.html"
  },
  {
    "text": "Biden asserts executive privilege over Hur audio files ahead of House contempt proceedings against Garland  —  President Joe Biden moved to assert executive privilege over recordings of his interview with special counsel Robert Hur as House Republicans press ahead with contempt proceedings … ",
    "url": "https://www.cnn.com/2024/05/16/politics/house-panels-contempt-garland-biden-audio"
  },
  {
    "text": "Georgia Republican files for divorce from blonde bombshell oncologist wife who teases ‘he will not be forthcoming’ about how their marriage REALLY unraveled after 12 years together raising seven children  — McCormick's wife texted Daily Mail: 'I'm sure that he will not be forthcoming'",
    "url": "https://www.dailymail.co.uk/news/article-13426423/rep-rich-mccormick-files-divorce-wife-debra-miller.html"
  },
  {
    "text": "Menendez co-defendants reveal strategy to beat the rap in high-stakes corruption trial  —  Defense attorneys for businessmen Wael Hana and Fred Daibes opened day four of New Jersey Democratic Sen. Bob Menendez's corruption trial  —  The federal government's case in its corruption prosecution … ",
    "url": "https://www.foxnews.com/politics/menendez-co-defendants-reveal-strategy-beat-rap-high-stakes-corruption-trial"
  },
  {
    "text": "‘Lone wolf’ charged in shooting of Slovakian prime minister Robert Fico  —  .  —  The Slovak interior minister said Thursday that a “lone wolf” has been charged in the shooting that seriously wounded Prime Minister Robert Fico and prompted soul-searching among leaders in the deeply divided society.",
    "url": "https://www.washingtonexaminer.com/news/world/3006142/lone-wolf-charged-in-shooting-of-slovakian-prime-minister-robert-fico/"
  },
  {
    "text": "US House votes to force weapons shipments to Israel, rebuking Biden  —  The Republican-led U.S. House of Representatives passed a bill on Thursday that would force President Joe Biden to send weapons to Israel, seeking to rebuke the Democrat for delaying bomb shipments as he urges Israel … ",
    "url": "https://www.reuters.com/world/us/us-house-votes-force-weapons-shipments-israel-rebuking-biden-2024-05-16/"
  },
  {
    "text": "House Democrats quietly fueled end-run around GOP leadership … - House Minority Whip Katherine Clark (D-Mass.) urged her colleagues to sign the petition at a closed-door Democratic Caucus meeting on Wednesday, one of the sources said.  — It's the first time since 2015 that such a petition … ",
    "url": "https://www.axios.com/2024/05/16/house-democrats-congress-gop-discharge-petition"
  },
  {
    "text": "Biden ending new leases in America's top coal region  —  In a pair of controversial environmental decisions, the Biden administration is moving to end all new coal leasing in the country's largest producing coal region, the Powder River Basin of Wyoming and Montana.",
    "url": "https://www.npr.org/2024/05/16/1251856806/biden-ending-new-leases-in-americas-top-coal-region"
  },
  {
    "text": "Clarence Thomas Won't Divulge If He Repaid Rich Pal's Loan, Dems Say … Faced with a barrage of ethics scandals that have tarred the Supreme Court as riddled with corruption, Justice Clarence Thomas has sought to cast them as merely an outgrowth of politics in Washington, D.C. “It's a hideous place … ",
    "url": "https://newrepublic.com/article/181627/clarence-thomas-rv-loan-democrats-letter"
  },
  {
    "text": "MAGA Rep's Insane Biden Claim Is Too Much Even for Maria Bartiromo  —  ‘JACKED UP’  —  Rep. Murphy offered to show his so-called evidence to Bartiromo “offline,” prompting the stunned Fox host to ask, “Show me what?!”  —  Rep. Greg Murphy (R-NC) made a bizarre claim Thursday … ",
    "url": "https://www.thedailybeast.com/maga-rep-greg-murphys-insane-biden-claim-is-even-too-much-for-maria-bartiromo"
  },
  {
    "text": "DOJ releases proposed rule to reclassify marijuana  —  The drug would be listed as Schedule III substance if the proposal is approved.  —  Marijuana plants for the adult recreational market are seen inside a greenhouse at Hepworth Farms in Milton, New York, July 15, 2022.",
    "url": "https://abcnews.go.com/Politics/doj-releases-proposed-rule-reclassify-marijuana/story?id=110309786"
  },
  {
    "text": "Biden's labor report card: Historian gives ‘Union Joe’ a higher grade than any president since FDR  —  Joe Biden has pledged repeatedly to go further than any of his predecessors with his support for U.S. labor rights.  —  “I intend to be the most pro-union president leading … ",
    "url": "https://theconversation.com/bidens-labor-report-card-historian-gives-union-joe-a-higher-grade-than-any-president-since-fdr-228771"
  },
  {
    "text": "DHS Announces 26 Additional PRC-Based Textile Companies to the UFLPA Entity List  —  Largest Ever One-Time Expansion Will Help Responsible Companies Keep Forced Labor out of their Supply Chain  —  WASHINGTON - Today, the U.S. Department of Homeland Security (DHS) announced the addition … ",
    "url": "https://www.dhs.gov/news/2024/05/16/dhs-announces-26-additional-prc-based-textile-companies-uflpa-entity-list"
  },
  {
    "text": "West Virginia secretary of state candidate loses primary and gets bitten by snake while removing campaign signs  —  .  —  A Republican who was running for West Virginia secretary of state has been hospitalized after suffering multiple snake bites while he removed campaign signs on Wednesday.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/state/3006947/west-virginia-secretary-of-state-candidate-loses-primary-and-gets-bitten-by-snake-while-removing-campaign-signs/"
  },
  {
    "text": "Morehouse College might halt graduation ‘on the spot’ if there are disruptions when President Biden speaks  —  Morehouse College President David A. Thomas said Thursday he would shut down commencement ceremonies “on the spot” rather than allow police to remove student protesters … ",
    "url": "https://www.cnn.com/2024/05/16/us/morehouse-college-graduation-biden-commencement/"
  },
  {
    "text": "Biden-Harris campaign accepts VP debate invite from CBS … - “We look forward to the Trump campaign accepting one of these dates so that the full debate calendar for this campaign can be set,” the Biden campaign said. … - Trump, who has yet to select a running mate … ",
    "url": "https://www.axios.com/2024/05/16/biden-harris-vp-debate-trump-cbs"
  },
  {
    "text": "Supreme Court clears way for Louisiana congressional map with 2 Black districts  —  The ruling could be a boon for Democrats and Black voters if the map is used for the November elections.  —  The Supreme Court has put the effort to redraw Louisiana's congressional districts for a second … ",
    "url": "https://www.politico.com/news/2024/05/15/supreme-court-louisiana-redistricting-00158249"
  }
]