[
  {
    "text": "President Biden pardons his son Hunter Biden  —  The decision, which was first reported by NBC News, is a reversal for the president, who repeatedly said he would not use his authority to pardon his son or commute his sentence.  —  WASHINGTON — Joe Biden pardoned his son Hunter Sunday night … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/joe-biden-issue-pardon-son-hunter-biden-rcna182369"
  },
  {
    "text": "Statement from President Joe Biden  —  Today, I signed a pardon for my son Hunter.  From the day I took office, I said I would not interfere with the Justice Department's decision-making, and I kept my word even as I have watched my son being selectively, and unfairly, prosecuted.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/01/statement-from-president-joe-biden-11/"
  },
  {
    "text": "Joe Biden pardons his son Hunter  —  The president had promised not to pardon Hunter Biden, who was convicted of gun-related charges and had pleaded guilty in a tax case.  —  President Joe Biden has pardoned his son Hunter, a controversial decision that reverses his long-standing pledge … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/01/hunter-biden-pardon/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzMDI5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0NDExNTk5LCJpYXQiOjE3MzMwMjkyMDAsImp0aSI6IjFiZjNjZGUzLTU1M2EtNDBkNS1hNWUwLTc4MTJjNjYxMTFiMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEyLzAxL2h1bnRlci1iaWRlbi1wYXJkb24vIn0.wDR5B7Va6DfPBILpasUZQCzM544s_elWQdvB92ojoas"
  },
  {
    "text": "Biden pardons his son Hunter despite previous pledges not to  —  President Joe Biden pardoned his son, Hunter, on Sunday night, sparing the younger Biden a possible prison sentence for federal felony gun and tax convictions and reversing his past promises not to use the extraordinary powers … ",
    "url": "https://apnews.com/article/biden-son-hunter-charges-pardon-pledge-24f3007c2d2f467fa48e21bbc7262525"
  },
  {
    "text": "Republicans say Biden is a ‘liar’ after he pardons Hunter, his son  —  The president's decision to absolve his son lit a firestorm among Republicans — and some Democrats.  —  Republicans called President Joe Biden a “liar” for pardoning his son, who was convicted on gun charges and pleaded guilty to tax fraud this summer.",
    "url": "https://www.politico.com/news/2024/12/01/republicans-pounce-on-biden-pardoning-his-son-hunter-00192091"
  },
  {
    "text": "President Pardons His Son, Hunter Biden  —  The “full and unconditional pardon” comes weeks before President Biden leaves office.  The president's spokeswoman had denied for months that he had any intention of granting clemency for his son.  —  The extraordinary action comes in the final weeks of Biden's presidency.",
    "url": "https://www.nytimes.com/live/2024/12/01/us/hunter-biden-pardon-live"
  },
  {
    "text": "A Constitutional Crisis Greater Than Watergate  —  For more than four decades before Donald Trump assumed the presidency, the FBI director was a position above politics.  A new president might choose a political ally as attorney general, but the FBI director was different.",
    "url": "https://www.theatlantic.com/politics/archive/2024/12/trumps-fbi-kash-patel/680840/"
  },
  {
    "text": "Pete Hegseth's Secret History  —  A whistle-blower report and other documents suggest that Trump's nominee to run the Pentagon was forced out of previous leadership positions for financial mismanagement, sexist behavior, and being repeatedly intoxicated on the job.",
    "url": "https://www.newyorker.com/news/news-desk/pete-hegseths-secret-history"
  },
  {
    "text": "Trump taps Massad Boulos, another in-law, as adviser on Middle East  —  The president-elect often named family members to posts during his campaign and in his first term.  —  President-elect Donald Trump said Sunday that he would nominate Massad Boulos, a Lebanese American businessman … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/01/trump-massad-boulos-middle-east/"
  },
  {
    "text": "How Do You Like That Filibuster Now?  —  As Republicans prepare to take control of both chambers of Congress and the presidency, Senator Joe Manchin, the conservative West Virginia Democrat turned independent, has a question for his former Democratic teammates: “How do you like that filibuster now?”",
    "url": "https://www.nytimes.com/2024/12/02/opinion/donald-trump-senate.html"
  },
  {
    "text": "Biden surges arms to Ukraine, fearing Trump will halt U.S. aid  —  The directive has stirred debate, as some officials worry it will cut too deeply into American stockpiles and jeopardize the military's needs elsewhere.  —  The Biden administration is engaged in an eleventh-hour scramble … ",
    "url": "https://www.washingtonpost.com/national-security/2024/12/02/biden-trump-ukraine-russia/"
  },
  {
    "text": "Amid worry about Trump, calls for career Justice Dept. staff to stay  —  An unusually high number of Justice Department lawyers are exploring jobs elsewhere since Donald Trump's reelection, according to interviews.  —  Attorney General Merrick Garland and top Justice Department officials … ",
    "url": "https://www.washingtonpost.com/national-security/2024/12/02/trump-justice-department-merrick-garland/"
  },
  {
    "text": "The Great Grocery Squeeze  —  How a federal policy change in the 1980s created the modern food desert  —  The concept of the food desert has been around long enough that it feels almost like a fact of nature.  Tens of millions of Americans live in low-income communities with no easy access … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/12/food-deserts-robinson-patman/680765/"
  },
  {
    "text": "Wikler for Chair  —  Today, Ben Wikler, the Wisconsin Democratic chairman, announced he was entering the race to lead the Democratic National Committee.  —  This is important.  The person who runs the DNC is the key organizer for the Democratic Party between now, the 2026 midterms … ",
    "url": "https://robertreich.substack.com/p/winkler-for-chair"
  },
  {
    "text": "Trump's Next Term Could See America's First True Oligarchs, Warns Democracy Activist Garry Kasparov  —  Elon Musk's DOGE plan could mix public and private interests in a way previously not seen in American politics, the former world chess champion said.  —  LOADING",
    "url": "https://www.huffpost.com/entry/trump-musk-america-oligarchs_n_6746b6efe4b0800c73f710a5"
  }
]