[
  {
    "text": "Live Updates: Judge Says Fani Willis Can Stay on Trump Case If Ex-Boyfriend Withdraws  —  The Atlanta district attorney's romantic relationship with the lead prosecutor she hired to oversee the case created an “appearance of impropriety,” the judge said, ruling that the prosecution can't proceed unless he leaves or she steps aside.",
    "url": "https://www.nytimes.com/live/2024/03/15/us/fani-willis-trump-georgia"
  },
  {
    "text": "Fani Willis can stay on Trump Georgia case, but only if Wade steps aside, judge says  —  ATLANTA — The judge overseeing the Georgia election interference case against former president Donald Trump and his allies ruled that Fulton County District Attorney Fani T. Willis (D) … ",
    "url": "https://www.washingtonpost.com/national-security/2024/03/15/fani-willis-trump-georgia-case/"
  },
  {
    "text": "Fulton County DA Fani Willis case against Trump can continue if she or special prosecutor Wade remove themselves, judge rules  —  Trump co-defendant Michael Roman accused Willis of misconduct for her “clandestine” relationship with Nathan Wade, whom she appointed as special counsel.",
    "url": "https://www.nbcnews.com/politics/donald-trump/fani-willis-trump-georgia-rcna139810"
  },
  {
    "text": "I Listened to Trump's Rambling, Unhinged, Vituperative Georgia Rally—and So Should You  —  The ex-President is building a whole new edifice of lies for 2024.  —  I'm sure you had better things to do on Saturday evening than watch Donald Trump rant for nearly two hours to an audience of cheering fans in Rome, Georgia.",
    "url": "https://www.newyorker.com/news/letter-from-bidens-washington/i-listened-to-trumps-rambling-unhinged-vituperative-georgia-rally-and-so-should-you"
  },
  {
    "text": "Biden's team to Speaker Johnson: Your impeachment inquiry is over … - House Republicans have spent the last year and a half on an impeachment probe that appears unlikely to end in charges against President Biden.  — The investigation — launched amid Republicans' allegations … ",
    "url": "https://www.axios.com/2024/03/15/biden-team-johnson-letter-impeachment-over"
  },
  {
    "text": "Schumer discusses ‘long-shot scenario’ with Manchin: Last-ditch Senate run in West Virginia  —  Hear more from Sen. Joe Manchin and the fight for control of the US Senate on “Inside Politics Sunday with Manu Raju” at 8 a.m. ET and 11 a.m. ET.  —  Senate Majority Leader Chuck Schumer recently discussed … ",
    "url": "https://www.cnn.com/2024/03/14/politics/joe-manchin-independent-senate-run/"
  },
  {
    "text": "Ginsburg family blasts plan to give RBG Award to Musk, Murdoch, others  —  The family of the late Ruth Bader Ginsburg and some of the Supreme Court justice's former colleagues have denounced this year's slate of honorees for an award that a philanthropic foundation bestows in the name of the liberal icon.",
    "url": "https://www.washingtonpost.com/style/power/2024/03/15/ruth-bader-ginsburg-award-backlash/"
  },
  {
    "text": "Powerful Realtor Group Agrees to Slash Commissions to Settle Lawsuits  —  The National Association of Realtors will pay $418 million in damages and will amend several rules that housing experts say will drive down housing costs.  —  American homeowners could see a significant drop in the cost … ",
    "url": "https://www.nytimes.com/2024/03/15/realestate/national-association-realtors-commission-settlement.html"
  },
  {
    "text": "Supreme Court Narrowly Interprets Landmark Reduced Sentencing Law  —  The justices sided with the government in a case focused on who is eligible for shorter prison sentences under the bipartisan First Step Act passed in 2018.  —  The Supreme Court sided with the government on Friday … ",
    "url": "https://www.nytimes.com/2024/03/15/us/politics/supreme-court-sentencing-first-step-act.html"
  },
  {
    "text": "‘Squid Game’ actor O Yeong-su convicted of sexual harassment and given a suspended sentence  —  As he was leaving the court, O told reporters he planned to appeal against the decision.  —  SEOUL — South Korean actor O Yeong-su, who starred in the first season of the hit Netflix series … ",
    "url": "https://www.nbcnews.com/news/world/squid-game-actor-o-yeong-su-convicted-sexual-harassment-suspended-sent-rcna143595"
  },
  {
    "text": "As Trump continues to remake RNC in his image, new memo outlines what that looks like  —  Every tool that the other side has used, we need to wield for ourselves.  —  As former President Donald Trump reshapes the Republican National Committee into the party apparatus he wants … ",
    "url": "https://npr.org/2024/03/15/1238765442/rnc-trump-republicans-whatley-lara-election-integrity-voter-fraud-early-voting"
  },
  {
    "text": "Eight Possible Explanations — Many Bad, Some Good — for SDNY's Delay in Turning Over Cohen Files  —  As Adam Klasfeld and others reported yesterday, Trump is asking to delay his New York trial on charges that he engaged in fraud to cover up the hush payments he made to get elected in 2016.",
    "url": "https://www.emptywheel.net/2024/03/15/eight-possible-explanations-many-bad-some-good-for-sdnys-delay/"
  },
  {
    "text": "It's not just our democracy at stake, it's our freedom  —  Political journalists covering the 2024 presidential election are missing the big picture in a big way.  —  Most of them are covering it like a popularity contest or a horse race, which, given the stakes, is utterly inexcusable.",
    "url": "https://presswatchers.org/2024/03/its-not-just-our-democracy-at-stake-its-our-freedom/"
  },
  {
    "text": "Trump hush money trial: 15,000 more pages of potential evidence coming  —  A growing fight over more than 100,000 pages of new information is likely to delay the start of Donald Trump's first criminal trial  —  NEW YORK — New York prosecutors said Friday that they expect to get an additional 15,000 pages … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/15/trump-hush-money-trial-bragg-delay/"
  },
  {
    "text": "Mainstream G.O.P. Group to Target Bob Good As It Shifts Mission and Members  —  An organization founded to support Republican moderates is taking aim at a Representative Bob Good of Virginia and backing a hard-right candidate who aligns with its new focus: purging Congress of G.O.P. rebels.",
    "url": "https://www.nytimes.com/2024/03/15/us/politics/mainstream-gop-group-to-target-bob-good-as-it-shifts-mission-and-members.html"
  },
  {
    "text": "France, Germany, and Poland pledge more weapons for Ukraine in show of unity  —  On 15 March, French President Emmanuel Macron, German Chancellor Olaf Scholz, and Polish Prime Minister Donald Tusk convened in Berlin for a Weimar Triangle meeting to discuss and coordinate further military support for Ukraine.",
    "url": "https://euromaidanpress.com/2024/03/15/macron-scholz-and-tusk-reaffirm-support-for-ukraine-pledge-more-weapons/"
  },
  {
    "text": "Republicans don't actually want you to remember 4 years ago  —  This free edition of PN is made possible by paid subscribers.  If you aren't one already, hit the button and sign up to support our independent journalism.  —  ✍️ Subscribe to Public Notice ✍️",
    "url": "https://www.publicnotice.co/p/are-you-better-off-2024-election-gop-trump"
  },
  {
    "text": "Moms for Liberty to advise librarians on book removals in Florida  —  Some of Florida's loudest advocates for public school book removals make up half of a state government-sponsored group to advise school districts on how to select titles and when to pull them off shelves.",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/15/florida-moms-for-liberty-members-create-librarian-training/72985946007/"
  }
]