[
  {
    "text": "Trump's become a runaway train in the GOP primary.  Here's why.  —  A POLITICO analysis shows Trump's supporters are more conservative and more assured in their candidate than voters backing other Republican candidates.  —  They're more conservative than other Republicans.  More likely to be men.",
    "url": "https://www.politico.com/news/2023/09/16/trump-gop-poll-voting-00116382"
  },
  {
    "text": "'It was a very nice note: Trump says he left Biden a message when he departed the White House  —  Former President Trump talks about his views on a potential vice president, the note he left for President Biden and whether age should be an issue for voters.",
    "url": "https://www.nbcnews.com/meet-the-press/video/-it-was-a-very-nice-note-trump-says-he-left-biden-a-message-when-he-departed-the-white-house-193106501996"
  },
  {
    "text": "Trump's indictments — and mug shot — are deepening his supporters' anger and revving up their support  —  Phil Jensen wore a bright red T-shirt with Donald Trump's mug shot and “NEVER SURRENDER!” printed on it to the former president's rally in Rapid City, South Dakota, last week.",
    "url": "https://www.cnn.com/2023/09/16/politics/trump-supporters-indictments-mug-shot/"
  },
  {
    "text": "Trump keeps distance from impeachment inquiry while assailing Biden  —  The former president has shown more interest in lobbying to expunge his own impeachments  —  Former president Donald Trump often shows more interest in expunging his impeachments than impeaching President Biden.",
    "url": "https://www.washingtonpost.com/politics/2023/09/16/trump-impeachment-inquiry-house-republicans/"
  },
  {
    "text": "Trump says he likes ‘the concept’ of a female VP pick  —  In an interview with NBC “Meet the Press” moderator Kristen Welker, the former president talked about a running mate, age limits for presidents and the letter he left for Biden.  —  Former President Donald Trump said he hasn't yet given … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-likes-concept-female-vp-pick-meet-the-press-interview-rcna105323"
  },
  {
    "text": "Florida Republicans reject DeSantis for Trump in loyalty pledge fight  —  “People will be pissed if we keep Trump off the ballot,” said one state GOP member.  —  ORLANDO — The latest contest between former President Donald Trump and Gov. Ron DeSantis in Florida came down to a loyalty pledge.",
    "url": "https://www.politico.com/news/2023/09/15/florida-republicans-desantis-trump-pledge-00116387"
  },
  {
    "text": "Boebert, caught on video, apologizes for inappropriate behavior at ‘Beetlejuice’ show  —  The congressmember had denied acting inappropriately until surveillance video surfaced showing her disrupting the performance.  —  Colorado Rep. Lauren Boebert apologized after she and a male companion … ",
    "url": "https://www.politico.com/news/2023/09/16/boebert-video-apologizes-beetlejuice-show-00116390"
  },
  {
    "text": "Lauren Boebert Now Admits She Vaped in Theater: 'I'm Truly Sorry'  —  “There's not a person walking the face of this planet that hasn't had a moment of weakness and fallen short and I think people will get that,” Boebert told The Daily Beast.  —  Rep. Lauren Boebert (R-CO) … ",
    "url": "https://www.thedailybeast.com/lauren-boebert-now-admits-she-vaped-in-theater-im-truly-sorry"
  },
  {
    "text": "Special counsel seeks ‘narrowly tailored’ gag order against Trump, citing ‘disparaging and inflammatory attacks’  —  The court filing accuses Trump of engaging in a campaign of disinformation.  —  Special counsel Jack Smith and his team have requested a federal judge in Washington, D.C. … ",
    "url": "https://abcnews.go.com/US/special-counsel-seeks-narrowly-tailored-gag-order-trump/story?id=103197976"
  },
  {
    "text": "Ramaswamy wants to end the H-1B visa program he used 29 times  —  The GOP candidate pledges to get rid of a the system he calls “indentured servitude.”  —  GOP candidate Vivek Ramaswamy has vowed to “gut” the system for H-1B temporary worker visas if he wins the White House.",
    "url": "https://www.politico.com/news/2023/09/16/ramaswamy-h1b-visa-gop-visa-00116383"
  },
  {
    "text": "Speaker McCarthy steps into the breach as his conference toils  —  The next two weeks will put the California Republican to the test of whether he can unite Republican lawmakers and avert a government shutdown  —  After a drawn-out fight to attain the speakership in early January … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/16/kevin-mccarthy-government-shutdown/"
  },
  {
    "text": "Trump lawyer Jenna Ellis turns on ‘malignant narcissist’ ex-president  —  Ellis, one of 18 Trump associates charged in Georgia election subversion case, says she 'simply can't support him' again  —  Jenna Ellis - the Donald Trump lawyer who like the former president faces criminal charges … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/15/trump-lawyer-jenna-ellis"
  },
  {
    "text": "Inside Trump's Gambit to Get Rid of a Judge by Suing Him  —  Trump is attempting to at least slam the brakes on the New York AG case against him by taking on the judge.  It's extremely unlikely to work for a number of good reasons. … For nearly a year, Donald Trump has been forcefully trying … ",
    "url": "https://www.thedailybeast.com/inside-trumps-gambit-to-get-rid-of-judge-arthur-engoron-by-suing-him"
  },
  {
    "text": "Trumpworld is still figuring out the Hunter Biden indictment conspiracy  —  In theory, the announcement Thursday that President Biden's son Hunter was indicted on charges related to his purchase of a gun in 2018 would seem like an obvious political win for the president's opponents.",
    "url": "https://www.washingtonpost.com/politics/2023/09/15/biden-trump-hunter-indicted/"
  },
  {
    "text": "The hard right is getting closer to power all over Europe  —  It does not need to join governments to affect policymaking  —  Enjoy more audio and podcasts on iOS or Android.  —  In sint-genesius-rode, a well-to-do commuter town in the hills south of Brussels, a crowd of 50 or so gathered … ",
    "url": "https://www.economist.com/briefing/2023/09/14/the-hard-right-is-getting-closer-to-power-all-over-europe"
  }
]