[
  {
    "text": "FBI Director Christopher Wray to resign before Trump takes office  —  President-elect Donald Trump has said he will nominate Kash Patel as FBI director, sending a message to Christopher A. Wray that he should resign or prepare to be fired.  —  FBI Director Christopher A. Wray announced Wednesday … ",
    "url": "https://www.washingtonpost.com/national-security/2024/12/11/christopher-wray-resigns-fbi-director-trump-nominee/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzODkzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM1Mjc1NTk5LCJpYXQiOjE3MzM4OTMyMDAsImp0aSI6ImRhYTdjNjg1LWMwYjgtNDJhNS04YmI2LWI2ODBjZmQ3MDY4NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI0LzEyLzExL2NocmlzdG9waGVyLXdyYXktcmVzaWducy1mYmktZGlyZWN0b3ItdHJ1bXAtbm9taW5lZS8ifQ.hhha7PC4vhhxuQqrZIYS4KGa2J9NI1OqdzqejntJwKg&itid=gfta"
  },
  {
    "text": "Christopher Wray Says He'll Step Down as F.B.I. Director  —  The F.B.I. director, Christopher A. Wray, told bureau employees on Wednesday that he intended in January, bowing to the reality that President-elect Donald J. Trump had publicly declared his desire to replace him.",
    "url": "https://www.nytimes.com/live/2024/12/11/us/trump-news?unlocked_article_code=1.gk4.nrBl.-FY8bOi0dezX&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The Situation: Chris Wray Rolls Out the Red Carpet for Kash Patel  —  Wray faced no good option here.  He chose the worst.  —  Meet The Authors … The Situation on Monday saw me acknowledging faint optimism about the Senate's advice and consent function.  —  Today, FBI Director Chris Wray announced he was stepping down.",
    "url": "https://www.lawfaremedia.org/article/the-situation--chris-wray-rolls-out-the-red-carpet-for-kash-patel"
  },
  {
    "text": "Manchin, Sinema block Democratic control of NLRB  —  The Senate on Wednesday blocked Lauren McFerran's re-nomination to the National Labor Relations Board, opening the door for Republican control of the board starting next year under President-elect Trump.  —  Senators voted 49 to 50 … ",
    "url": "https://thehill.com/homenews/senate/5035142-senate-blocks-nlrb-re-nomination/"
  },
  {
    "text": "Schumer torpedoed by Manchin and Sinema on crucial NLRB vote … - Schumer gambled that he had the votes without knowing how Sens. Kyrsten Sinema (I-Ariz.) and Joe Manchin (I-W.Va.) would vote on the nomination for Lauren McFerran.  — Both voted “No” on a crucial procedural vote that would clear the way for confirmation.",
    "url": "https://www.axios.com/2024/12/11/schumer-nlrb-vote-manchin-sinema"
  },
  {
    "text": "Mark Zuckerberg's Meta Donates $1 Million to Trump's Inaugural Fund  —  President-elect had blasted the tech tycoon during the presidential campaign, but ties have been improving  —  Meta Platforms has donated $1 million to president-elect Donald Trump's inaugural fund … ",
    "url": "https://www.wsj.com/tech/mark-zuckerbergs-meta-donates-1-million-to-trumps-inaugural-fund-32a999c1?st=h2hPN8&reflink=article_copyURL_share"
  },
  {
    "text": "Trump invites China's Xi Jinping to inauguration  —  President-elect Donald Trump has invited Chinese President Xi Jinping to attend his inauguration next month, multiple sources told CBS News, and inauguration officials are making plans for additional foreign dignitaries to attend the swearing-in ceremony.",
    "url": "https://www.cbsnews.com/news/trump-invites-china-xi-jinping-inauguration/"
  },
  {
    "text": "U.S. Rep. Nancy Mace Calls Police on Prominent Foster Youth Advocate; Eyewitnesses Dispute Her Assault Allegations  —  Stunned onlookers say the disturbing turn of events followed a routine celebration of a landmark child welfare law  —  This breaking news story will be updated as more information becomes available.",
    "url": "https://imprintnews.org/top-stories/nancy-mace-calls-police-prominent-foster-youth-advocate/256826"
  },
  {
    "text": "Progressive lawmakers say the reaction to the UHC CEO killing is a ‘wake-up call’  — The UHC CEO killing has led to an outpouring of frustration toward the healthcare industry.  — Some progressive Democrats on Capitol Hill say it's the “right time” to talk about it.",
    "url": "https://www.businessinsider.com/unitedhealthcare-ceo-shooting-wake-up-call-ocasio-cortez-2024-12"
  },
  {
    "text": "Decivilization May Already Be Under Way  —  The line between a normal, functioning society and catastrophic decivilization can be crossed with a single act of mayhem.  This is why, for those who have studied violence closely, the brazen murder of a CEO in Midtown Manhattan—and, more important … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/12/decivilization-political-violence-civil-society/680961/"
  },
  {
    "text": "CNN Poll: Most Americans approve how Trump is handling his return to the White House  —  Most Americans expect President-elect Donald Trump to do a good job upon his return to the White House next month (54%) and a majority approves of how he's handling the presidential transition so far … ",
    "url": "https://www.cnn.com/2024/12/11/politics/cnn-poll-trump-transition"
  },
  {
    "text": "Time magazine to name Trump ‘Person of the Year’  —  He also won the honor in 2016.  —  Donald Trump is expected to be named Time magazine's “Person of the Year” — and to celebrate the unveiling of the cover, the president-elect will ring the opening bell of the New York Stock Exchange on Thursday morning … ",
    "url": "https://www.politico.com/news/2024/12/11/time-trump-person-of-the-year-000498"
  },
  {
    "text": "Flag planting at Ohio State would be felony under proposed law  —  If an Ohio lawmaker gets his way, teams attempting to plant their flags in the middle of Ohio Stadium during Ohio State games will be dealing with more than just pepper spray.  —  Ohio state Rep. Josh Williams introduced … ",
    "url": "https://www.espn.com/college-football/story/_/id/42913316/flag-planting-ohio-state-felony-proposed-law"
  },
  {
    "text": "Annual inflation rate accelerates to 2.7% in November, as expected … WATCH NOW  —  Consumer prices rose at a faster annual pace in November, a reminder that inflation remains an issue both for households and policymakers.  —  The consumer price index showed a 12-month inflation rate … ",
    "url": "https://www.cnbc.com/2024/12/11/cpi-inflation-november-2024-annual-inflation-rate-accelerates-to-2point7percent-in-november-as-expected.html"
  },
  {
    "text": "From X to Bluesky: why are people fleeing Elon Musk's ‘digital town square’?  —  Musk's platform has lost 2.7 million active US users in two months, while its rival has gained 2.5 million  —  A mass departure from Elon Musk's X has led to the site losing about 2.7 million active Apple … ",
    "url": "https://www.theguardian.com/media/2024/dec/11/from-x-to-bluesky-why-are-people-abandoning-twitter-digital-town-square"
  },
  {
    "text": "Trump picks hardline Republican Kari Lake to lead Voice of America  —  U.S. President-elect Donald Trump on Wednesday said he was picking Kari Lake, a former news anchor and a hardline Republican who failed to win an Arizona Senate seat last month, to be the director of U.S. government-funded media outlet Voice of America.",
    "url": "https://www.reuters.com/world/us/trump-picks-hardline-republican-kari-lake-lead-voice-america-2024-12-12/"
  },
  {
    "text": "South Korea's ruling party backs impeachment as president refuses to step down over martial law  —  South Korea's ruling party has thrown its support behind attempts to impeach embattled President Yoon Suk Yeol over his ill-fated decision to declare martial law that sparked a political crisis and widespread public anger in the country.",
    "url": "https://www.cnn.com/2024/12/11/asia/south-korea-ruling-party-impeachment-hnk-intl"
  },
  {
    "text": "MSNBC ratings collapse postelection, Fox News surges as cable faces an uncertain future  —  When a sports team loses, its fans don't hang around for the postgame show.  —  The same goes for the tribal habits of cable news audiences.  —  Viewers have fled left-leaning MSNBC since Vice … ",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2024-12-11/fox-news-dominates-2024-ratings-but-cable-news-still-faces-challenges"
  },
  {
    "text": "Biden Administration Cracks Down on Bank Overdraft Fees  —  Rule change would take effect in October 2025 if it isn't overturned or altered  —  The Biden administration is overhauling rules for how banks can charge overdraft fees to customers, despite an intense lobbying campaign from the industry … ",
    "url": "https://www.wsj.com/politics/policy/biden-administration-cracks-down-on-bank-overdraft-fees-8fb249ee"
  },
  {
    "text": "Trump plans to scrap policy restricting ICE arrests at churches, schools, hospitals  —  The long-standing policy has prevented ICE agents from arresting immigrants at so-called “sensitive locations” except under certain circumstances.  —  The incoming Trump administration intends to rescind … ",
    "url": "https://www.nbcnews.com/investigations/trump-scrap-restriction-ice-arrests-churches-schools-rcna183688"
  },
  {
    "text": "Mitch McConnell Says Trump Win Puts Americans In A ‘Very Dangerous World’  —  The GOP's outgoing Senate leader said he plans to spend his final two years in office pushing back against the Trump-fueled isolationism within his party.  —  LOADING  —  Sen. Mitch McConnell (R-Ky.) … ",
    "url": "https://www.huffpost.com/entry/mitch-mcconnell-trump-americans-dangerous-world_n_675a09cae4b02802b83c4117"
  },
  {
    "text": "The ultimate marker of Dems' generational shift: AOC's Oversight ascension  —  Ocasio-Cortez has earned the support of the majority of the panel's Democrats, based on interviews with a dozen members.  —  Rep. Alexandria Ocasio-Cortez is poised to become the top Democrat on the House Oversight Committee … ",
    "url": "https://www.politico.com/news/2024/12/11/aoc-oversight-generational-shakeup-00193849"
  },
  {
    "text": "Even Some CBC Members Are Starting to Question the Seniority System in Congress  —  “The idea that having institutional knowledge — that most people rely upon when they are a longer serving member — I don't think that really matters at this moment because, honestly, the institution is burning … ",
    "url": "https://www.notus.org/congress/even-some-cbc-members-starting-to-question-seniority-system-in-congress"
  },
  {
    "text": "Schumer says Senate will vote on Social Security changes  —  Senate Majority Leader Chuck Schumer (D-N.Y.) said Wednesday that he's “doing everything” he can to try to pass legislation that would enact some Social Security before Congress ushers in a new class next month.",
    "url": "https://thehill.com/homenews/senate/5035633-senate-majority-leader-schumer-social-security-legislation/"
  }
]