[
  {
    "text": "‘This is horrifying’: Top New Jersey Democrats call on Bob Menendez to resign after his second indictment  —  Democrats figured there would be new developments in the Bob Menendez investigation, but the charges are far more serious than any of them anticipated.",
    "url": "https://www.politico.com/news/2023/09/22/new-jersey-democrats-menendez-indictment-00117693"
  },
  {
    "text": "Statement by Governor Murphy on Today's Indictment Against U.S. Senator Robert Menendez  —  “The allegations in the indictment against Senator Menendez and four other defendants are deeply disturbing.  These are serious charges that implicate national security and the integrity of our criminal justice system.",
    "url": "https://nj.gov/governor/news/news/562023/approved/20230922a.shtml"
  },
  {
    "text": "Eye Opener: New Jersey Sen. Robert Menendez indicted  —  New Jersey Sen. Robert Menendez has been indicted on bribery charges.  Meanwhile, Ukraine's latest missile attack on Russian-occupied Crimea has struck a blow against Russian power.  All that and all that matters in today's Eye Opener.",
    "url": "https://www.cbsnews.com/video/eye-opener-new-jersey-sen-robert-menendez-indicted/"
  },
  {
    "text": "Andy Kim tells Menendez to resign  —  Democratic congressman: ' It doesn't matter what your job title is or your politics — no one in America is above the law'  —  Rep. Andy Kim (D-Moorestown) is calling on U.S. Senator Bob Menendez to resign following his indictment on federal corruption charges.",
    "url": "https://newjerseyglobe.com/congress/andy-kim-tells-menendez-to-resign/"
  },
  {
    "text": "Biden to join the picket line in UAW strike  —  His decision to stand alongside the striking workers represents perhaps the most significant display of union solidarity ever by a sitting president.  —  President Joe Biden will travel to Michigan to join the picket line of auto workers on strike nationwide, he said on Friday afternoon.",
    "url": "https://www.politico.com/news/2023/09/22/biden-to-join-the-picket-line-in-uaw-strike-00117749"
  },
  {
    "text": "Michigan lawmaker calls UAW strike a ‘fundamental struggle’ that will benefit all  —  Rep. Dan Kildee (D-Mich.) joined the United Auto Workers picket line in his home state on Friday, claiming the union members' “fundamental struggle” will help all families in the communities he represents.",
    "url": "https://thehill.com/homenews/house/4219534-dan-kildee-uaw-strike-a-fundamental-struggle/"
  },
  {
    "text": "US mother sentenced to two years in prison for giving daughter abortion pills  —  Jessica Burgess pleaded guilty in July to providing an abortion after 20 weeks and tampering with human remains  —  Jessica Burgess, a Nebraska mother accused of helping her teenage daughter use pills to end her pregnancy … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/22/burgess-abortion-pill-nebraska-mother-daughter"
  },
  {
    "text": "Nebraska Mother Gets Prison For Giving Abortion Pills To Pregnant Daughter  —  The woman was sentenced Friday to two years in prison for assisting her teen daughter with an abortion and helping to conceal it.  —  LOADING  —  A Nebraska mother who pleaded guilty to giving her teenage daughter pills … ",
    "url": "https://www.huffpost.com/entry/ap-us-abortion-charges-nebraska_n_650de46be4b0e83cc0dad7cc"
  },
  {
    "text": "McCarthy stares into the shutdown abyss  —  The speaker has only one clear exit route away from a government closure: working with Democrats.  It's a path he still refuses to take.  —  Speaker Kevin McCarthy has only one way out of next week's impending government shutdown: working with Democrats.",
    "url": "https://www.politico.com/news/2023/09/23/mccarthy-stares-into-shutdown-abyss-00117658"
  },
  {
    "text": "Jack Smith adds war crimes prosecutor — his deputy from the Hague — to special counsel team  —  The special counsel's office is gearing up to put Donald Trump on trial in two criminal cases next year.  —  Special counsel Jack Smith has added a veteran war crimes prosecutor … ",
    "url": "https://www.politico.com/news/2023/09/22/jack-smith-special-counsel-prosecutor-trump-00117736"
  },
  {
    "text": "Judge asked to decide if Trump property valuations were fraud or “genius”  —  Did former President Donald Trump commit fraud when he valued properties far higher than appraisers when applying for loans, or was he applying his “investment genius” to the valuations?",
    "url": "https://www.cbsnews.com/news/donald-trump-new-york-fraud-trial/"
  },
  {
    "text": "Newsom vetoes bill that would require parents to affirm child's gender identity in custody battles  —  Assemblywoman Lori Wilson, who introduced the bill, said she is ‘extremely disappointed’ in Newsom's veto  —  California Gov. Gavin Newsom, a Democrat, vetoed a bill late Friday night … ",
    "url": "https://www.foxnews.com/politics/newsom-vetoes-bill-would-require-parents-affirm-childs-gender-identity-custody-battles"
  },
  {
    "text": "Former White House staffer Cassidy Hutchinson says Trump is “dangerous for the country”  —  Cassidy Hutchinson, a former senior advisor to White House chief of staff Mark Meadows, made international headlines when she testified before the House Select Committee to Investigate the January 6 Attack.",
    "url": "https://www.cbsnews.com/news/former-white-house-staffer-cassidy-hutchinson-says-trump-is-dangerous-for-the-country/"
  },
  {
    "text": "Coast Guard Academy banned a retired captain from its grounds after CNN reported he sexted a student.  Now more allegations are surfacing.  —  The US Coast Guard Academy on Friday announced it had banned a retired captain from its grounds following a CNN report this week that revealed the captain … ",
    "url": "https://www.cnn.com/2023/09/22/politics/coast-guard-glenn-sulmasy-invs/"
  },
  {
    "text": "The Dangerous DEI Bloat at Virginia's Public Universities  —  Authors:  —  KEY TAKEAWAYS  —  Virginia leads the nation as the state with the largest diversity, equity, and inclusion (DEI) bureaucracies in its public universities.  —  DEI staff and departments urge students … ",
    "url": "https://www.heritage.org/education/report/the-dangerous-dei-bloat-virginias-public-universities"
  }
]