[
  {
    "text": "Trump and Harris Neck and Neck After Summer Upheaval, Times/Siena Poll Finds  —  The survey finds that Donald J. Trump is retaining his support and that, on the eve of the debate, voters are unsure they know enough about where Kamala Harris stands.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/09/08/us/politics/trump-and-harris-times-siena-poll.html?unlocked_article_code=1.JE4.hi1f.f26wReRbISmY&smid=url-share"
  },
  {
    "text": "The mistakes of 2019 could cost Harris the election  —  Voters think she's too far to the left — but there's plenty of room to define Trump as radical.  —  For the second time this weekend, I'm upending previously laid plans to cover a more time-sensitive story: the New York Times/Siena College poll that came out this morning.",
    "url": "https://www.natesilver.net/p/the-mistakes-of-2019-could-cost-harris"
  },
  {
    "text": "Harris v. Trump CBS News poll finds Pennsylvania, Michigan, Wisconsin race tight ahead of debate  —  In Pennsylvania, Michigan and Wisconsin — all tight races — we see the larger contours of the entire presidential contest ahead of the first Harris-Trump debate.  —  What makes these states close?",
    "url": "https://www.cbsnews.com/news/harris-trump-poll-pennsylvania-michigan-wisconsin-debate/"
  },
  {
    "text": "Harris falling behind among male voters in key states  —  New polls show Vice President Harris has a major challenge in winning over male voters and is losing men by a bigger margin than she's winning women in key states such as Pennsylvania, Nevada and North Carolina.",
    "url": "https://thehill.com/homenews/campaign/4866756-harris-trump-male-voters/"
  },
  {
    "text": "September 7, 2024  —  By rights, tonight's post should be a picture, but Trump's behavior today merits a marker because it feels like a dramatic escalation of the themes we've seen for years.  Please feel free to ignore—as I often say, I am trying to leave notes for a graduate student in 150 years … ",
    "url": "https://heathercoxrichardson.substack.com/p/september-7-2024"
  },
  {
    "text": "Trump's real Project 2025 was written for him in Moscow by Vladimir Putin's men  —  Unless you work on the politics desk of the New York Times or Washington Post, it's getting harder and harder not to notice the increasingly incoherent yet also dangerously unhinged nature … ",
    "url": "https://www.inquirer.com/opinion/commentary/gop-trump-campaign-russia-propaganda-20240908.html"
  },
  {
    "text": "Trump pledges authoritarian crackdown, saying enemies to be prosecuted at levels “never seen before”  —  The Republican candidate promised to imprison those whom he falsely claimed stole the 2020 election from him  —  Former President Donald Trump is promising to carry out what he described … ",
    "url": "https://www.salon.com/2024/09/08/pledges-authoritarian-crackdown-saying-enemies-to-be-prosecuted-at-levels-never-seen-before/"
  },
  {
    "text": "Trump, lying about migrants and crime, says mass deportations “will be a bloody story”  —  The former president has claimed he would use police and soldiers to deport at least 12 million undocumented people  —  Donald Trump is threatening that a proposed mass deportation of undocumented immigrants … ",
    "url": "https://www.salon.com/2024/09/08/trump-lying-about-migrants-and-crime-says-mass-deportations-will-be-a-bloody-story/"
  },
  {
    "text": "Variety Asked Elton John About Donald Trump and the TDS Afflicted Will NOT Like His Answer  —  Those on the Left afflicted with Trump Derangement Syndrome might not be fully satisfied by Elton John's response to a question from a Variety reporter at the Toronto Film Festival … ",
    "url": "https://twitchy.com/dougp/2024/09/07/variety-asked-elton-john-about-donald-trump-and-the-tds-afflicted-will-not-like-his-answer-n2400652"
  },
  {
    "text": "Elton John's New Remarks About Trump Are Likely to Have Dems Losing Their Minds  —  Democrats and media have been going all in to demonize former President Donald Trump as we count down to the election.  We see that in the constant drumbeat of bad press for him and positive press for Kamala Harris, for example.",
    "url": "https://redstate.com/nick-arama/2024/09/08/elton-john-remarks-n2179048"
  },
  {
    "text": "Cooper says he's ‘tired of seeing texts’ from students telling parents they're afraid of school shootings.  ‘We cannot normalize this.’  —  North Carolina Gov. Roy Cooper (D) said in an interview Sunday that he is “tired of seeing texts from children in a school telling their parents … ",
    "url": "https://thehill.com/homenews/education/4868568-cooper-says-hes-tired-of-seeing-texts-from-students-telling-parents-theyre-afraid-of-school-shootings/"
  },
  {
    "text": "‘This Week’ Transcript 9-8-24: Former Rep. Liz Cheney and Gov. Sarah Huckabee Sanders  —  Former Wyoming Congressman Liz Cheney announces her father's support for Democratic candidate Kamala Harris on the second day of panels at the 14th annual Texas Tribune Festival in downtown Austin, Texas.",
    "url": "https://abcnews.go.com/Politics/week-transcript-9-8-24-former-rep-liz/story?id=113487189"
  },
  {
    "text": "Cheney says Trump is an ‘unrecoverable catastrophe’ in call for GOP to vote for Harris  —  The former congresswoman says not voting for Trump is not enough.  —  Rep. Liz Cheney Vice Chairwoman of the Select Committee to Investigate the January 6th Attack on the U.S. Capitol … ",
    "url": "https://abcnews.go.com/Politics/cheney-trump-unrecoverable-catastrophe-call-gop-vote-harris/story?id=113486970"
  },
  {
    "text": "G.O.P. Report to Denounce Biden Administration Over Afghanistan Withdrawal  —  In an election-season document, Republicans are set to offer few new revelations but instead heap blame on the “Biden-Harris administration” while absolving former President Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/09/08/us/politics/republicans-biden-harris-afghanistan-withdrawal.html"
  },
  {
    "text": "Trump cashes in during final weeks of his presidential campaign  —  No presidential candidate has ever so closely linked his election with personal for-profit enterprises, selling items from shoes to books to pieces of his suit.  —  With less than 10 weeks before the presidential election … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/08/trump-cash-merchandise-books-cards/"
  },
  {
    "text": "Anti-Abortion Extremists Call the Shots in Trump's GOP  —  Trump's epic flip flop abortion is why Democratic fears about Project 2025 and a Federal abortion ban are well-founded.  —  The generally accepted — and oft-repeated — narrative about Trump is that he is a cult-leader who can bend the Republican base to his will.",
    "url": "https://www.messageboxnews.com/p/anti-abortion-extremists-call-the"
  }
]