[
  {
    "text": "Statement from President Joe Biden on Russia's Overnight Aerial Attacks against  —  In the early hours of Christmas, Russia launched waves of missiles and drones against Ukrainian cities and critical energy infrastructure.  The purpose of this outrageous attack was to cut off … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/25/statement-from-president-joe-biden-on-russias-overnight-aerial-attacks-against/"
  },
  {
    "text": "Biden pledges more U.S. arms to Ukraine after Russia's Christmas attack … - At least one person in the eastern Dnipropetrovsk region died and six others in Kharkiv were injured during the attacks, according to local officials.  —  What they're saying: “The purpose of this outrageous attack … ",
    "url": "https://www.axios.com/2024/12/26/russia-christmas-attack-ukraine-biden-us-weapons"
  },
  {
    "text": "The Big Companies Funding Trump's Inauguration Despite Denouncing Jan. 6  —  The second Trump inaugural fund is on track to be the most lucrative yet  —  Four years ago, dozens of companies denounced the invasion of the U.S. Capitol and pledged to withhold support from those who disputed the 2020 election results.",
    "url": "https://www.wsj.com/business/trump-inauguration-sponsors-large-company-donations-a3cc1b92?st=gUfJeV&reflink=article_copyURL_share"
  },
  {
    "text": "Companies Are Scrambling to Fund Trump's Inauguration.  He's Keeping Track  —  The president-elect is expected to raise more money than ever for his second inauguration.  He's keeping tabs on who's donating — and who hasn't",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-companies-fund-inauguration-1235217360/"
  },
  {
    "text": "Playbook: Mr. Musk goes to Washington  —  Presented by With help from Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  Merry Christmas and happy Hanukkah from Playbook's resident Jew, filling in today while the usual authors take a well-deserved respite under the tree.",
    "url": "https://www.politico.com/newsletters/playbook/2024/12/25/mr-musk-goes-to-washington-00196031"
  },
  {
    "text": "Kazakhstan's senate chief: cause of Azerbaijan Airlines plane crash unknown for now  —  Kazakhstan's senate chairman said on Thursday that the cause of the Azerbaijan Airlines plane crash was still unknown.  —  “None of these countries - neither Azerbaijan, Russia nor Kazakhstan - is interested in hiding information.",
    "url": "https://www.reuters.com/world/asia-pacific/kazakhstans-senate-chief-cause-azerbaijan-airlines-plane-crash-unknown-now-2024-12-26/"
  },
  {
    "text": "Trump Threatens to Take Over Canada, Panama Canal, Greenland in Christmas Day Message  —  The president-elect referred to Prime Minister Justin Trudeau as the “Governor” of Canada  —  President-elect Donald Trump has once again repeated his desires for U.S. territorial expansion.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-canada-panama-canal-greenland-1235217402/"
  },
  {
    "text": "New Mexico's Governor Was A Liberal Hero.  Then She Got Blunt about Crime.  —  Gov. Michelle Lujan Grisham has clashed with her own party over how to tackle the nexus of addiction, mental illness and violence in New Mexico.  —  The New Mexico governor's mansion sits on a hilltop in Santa Fe, roughly 7,100 feet above sea level.",
    "url": "https://www.nytimes.com/2024/12/25/business/new-mexico-michelle-grisham-crime.html"
  },
  {
    "text": "A Reflective Biden Harbors Some Regrets as His Term Winds Down  —  President Biden will seek solace and “relief” during a visit with Pope Francis next month, according to people familiar with his plans.  His public comments have offered a glimpse into what is on his mind.",
    "url": "https://www.nytimes.com/2024/12/25/us/politics/biden-regrets-reflection.html?unlocked_article_code=1.kE4.eiZZ.adeFQoL3r6wq&smid=re-share"
  },
  {
    "text": "‘I Probably Could Have Flipped Over a Few More Tables’  —  Outgoing Rep. Cori Bush gets candid about her time in Congress and how progressives should respond to 2024.  —  Rep. Cori Bush was swept into office in 2020 on a wave of liberal energy, defeating a longtime Democratic incumbent … ",
    "url": "https://www.politico.com/news/magazine/2024/12/25/cori-bush-congress-exit-interview-00195630"
  },
  {
    "text": "China Ousts Two Military Lawmakers as Xi's Defense Purge Widens  —  China abruptly ousted two military lawmakers from its national parliament without explanation, as a purge of key personnel in the upper echelons of the nation's defense establishment shows no sign of easing.",
    "url": "https://www.bloomberg.com/news/articles/2024-12-26/china-ousts-two-military-lawmakers-as-xi-s-defense-purge-widens"
  },
  {
    "text": "Mark Zuckerberg and Meta got a big win.  They have the House GOP to thank.  —  The billionaire and his company needed Speaker Mike Johnson's help to stop legislation that would have regulated social media for the first time.  —  In the waning days of 2024, Facebook founder Mark Zuckerberg … ",
    "url": "https://www.politico.com/news/2024/12/25/mark-zuckerberg-meta-congress-bill-00195958"
  },
  {
    "text": "At CNN, lower TV ratings and heightened anxieties about what's ahead  —  With traditional viewership on a decline, the cable news network leans into its strong digital presence as it heads into uncertain times covering the second Trump administration.  —  If you had to guess which member … ",
    "url": "https://www.washingtonpost.com/style/media/2024/12/25/cnn-ratings-decline-trump/"
  },
  {
    "text": "Former Taipei mayor charged for bribery, misuse of political donations  —  Taiwan prosecutors have charged a former mayor of Taipei who heads a small opposition party with accepting T$17.1 million ($522,392) in bribes over a major property development in the capital and misuse of political donations.",
    "url": "https://www.reuters.com/world/asia-pacific/former-taipei-mayor-charged-bribery-misuse-political-donations-2024-12-26/"
  }
]