[
  {
    "text": "Trump's Dire Words Raise New Fears About His Authoritarian Bent  —  The former president is focusing his most vicious attacks on domestic political opponents, setting off fresh worries among autocracy experts.  —  Donald J. Trump rose to power with political campaigns that largely attacked external targets … ",
    "url": "https://www.nytimes.com/2023/11/20/us/politics/trump-rhetoric-fascism.html"
  },
  {
    "text": "What happens after Donald Trump's ‘final battle’?  —  I was driving with my kids on Sunday, mind wandering as I steered.  I was looking at a cluster of leafless trees when the first words from a social media post by Donald Trump popped into my mind.  —  “2024 is our final battle.”",
    "url": "https://www.washingtonpost.com/politics/2023/11/20/trump-final-battle-evangelicals/"
  },
  {
    "text": "‘Did Trump Change, or Did You?’:  We Asked a Pro-Impeachment Republican Why He'd Back Trump  —  In a new Q&A, former GOP Rep. Peter Meijer defends his decision to back Donald Trump if he's the Republican nominee.  —  Things have gotten complicated for Peter Meijer when it comes to his feelings about Donald Trump.",
    "url": "https://www.politico.com/news/magazine/2023/11/20/peter-meijer-senate-donald-trump-00128137"
  },
  {
    "text": "Trump calls to ‘revamp the RNC’ if GOP debates go ahead  —  “GREAT POLLS JUST RELEASED - BEST EVER!  Harvard/Harris TRUMP 67%, DeSanctimonious 9%, Birdbrain 8%, Ramaswamy 5%, Christie - dead in the water, a total loser!  TRUMP UP 7% to 10% on CROOKED JOE BIDEN,” Trump wrote on his Truth Social platform … ",
    "url": "https://thehill.com/homenews/campaign/4319600-trump-calls-to-revamp-the-rnc-if-gop-debates-go-ahead/"
  },
  {
    "text": "Maria Bartiromo Floats Bonkers New COVID Conspiracy About Trump and China  —  While “just asking questions,” the once-respected anchor suggested China unleashed COVID-19 on the world just to destroy Trump.  —  Fox Business Network anchor Maria Bartiromo was once again just asking questions … ",
    "url": "https://www.thedailybeast.com/foxs-maria-bartiromo-floats-bonkers-new-covid-conspiracy-about-trump-and-china"
  },
  {
    "text": "The ‘faith-based’ leader for Philly's Moms for Liberty chapter is a registered sex offender  —  Phillip Fisher Jr. is a pastor and Republican ward leader who coordinates faith-based outreach for Philadelphia's Moms for Liberty chapter.He's also a registered sex offender … ",
    "url": "https://www.inquirer.com/politics/philadelphia/moms-for-liberty-philadelphia-pastor-sex-offender-20231120.html"
  },
  {
    "text": "Right-Wing ‘Moms for Liberty’ Organizer Is a Convicted Sex Offender  —  Phillip Fisher Jr., who does faith-based outreach for the group in Philadelphia, abused a 14-year-old in 2011, The Philadelphia Inquirer reported on Monday  —  MOMS FOR LIBERTY is a conservative parental rights group … ",
    "url": "https://www.rollingstone.com/politics/politics-news/moms-for-liberty-organizer-convicted-sex-offender-1234887013/"
  },
  {
    "text": "Federal appeals court ruling threatens enforcement of the Voting Rights Act  —  The decision from the 8th Circuit is likely headed to the Supreme Court.  —  A federal appeals court issued a ruling Monday that could gut the Voting Rights Act, saying only the federal government … ",
    "url": "https://www.politico.com/news/2023/11/20/federal-court-deals-devastating-blow-to-voting-rights-act-00128069"
  },
  {
    "text": "Appeals court judges express skepticism as Trump lawyer fights to reverse gag order in Jan. 6 case  —  At oral arguments debating whether a temporarily-lifted gag order on Donald Trump in his election subversion case in Washington, D.C., is warranted, it was a question of the First Amendment and faith … ",
    "url": "https://lawandcrime.com/high-profile/appeals-court-judges-express-skepticism-as-trump-lawyer-fights-to-reverse-gag-order-in-jan-6-case/"
  },
  {
    "text": "Sen. Mike Lee promotes a debunked conspiracy theory about a Jan. 6 rioter  —  Kevin Lyons stole a photo and a wallet from Nancy Pelosi's office, but conservative figures are using a video of the Trump supporter to spread misinformation about Jan. 6.  —  WASHINGTON — A Republican senator … ",
    "url": "https://www.nbcnews.com/politics/justice-department/sen-mike-lee-promotes-debunked-conspiracy-theory-jan-6-rioter-rcna125993"
  },
  {
    "text": "Biden quips about his age while pardoning Thanksgiving turkeys on his birthday  —  President Biden made a few jokes about his age while pardoning Thanksgiving turkeys at the White House, an annual tradition that fell on his 81st birthday.  —  He thanked the chair of the National Turkey Federation … ",
    "url": "https://thehill.com/homenews/administration/4318917-biden-birthday-pardons-thanksgiving-turkeys/"
  },
  {
    "text": "The Real Reason Why Biden Shouldn't Drop Out  —  Panicked Democrats, vibrating with anxiety over the polls, continue to nurture an unlikely fantasy: Joe Biden looks at his family across the Thanksgiving table on Nantucket and says with a weary sigh, “I can't do this for another five years.",
    "url": "https://newrepublic.com/article/177020/real-reason-biden-shouldnt-drop"
  },
  {
    "text": "The lion, the wig and the warrior.  Who is Javier Milei, Argentina's president-elect?  —  His legions of fans call him “the madman” and “the wig” due to his ferocity and unruly mop of hair.  He refers to himself as “the lion.”  He thinks sex education is a Marxist plot to destroy the family … ",
    "url": "https://apnews.com/article/javier-milei-profile-argentina-election-82488d49cca5aee10d4b911bde530922"
  },
  {
    "text": "Trump's Georgia Co-Defendant Harrison Floyd Fights Back on Fani Willis' Bid to Revoke His Bail  —  The former leader of ‘Black Voices for Trump’ is scheduled to appear Tuesday afternoon at a hearing in Fulton County to determine if he should be sent to jail while awaiting trial  —  JWPlayer",
    "url": "https://themessenger.com/politics/harrison-floyd-bond-conditions-trump-response-georgia-fani-willis"
  },
  {
    "text": "Secretive White House Surveillance Program Gives Cops Access to Trillions of US Phone Records  —  A WIRED analysis of leaked police documents verifies that a secretive government program is allowing federal, state, and local law enforcement to access phone records of Americans who are not suspected of a crime.",
    "url": "https://www.wired.com/story/hemisphere-das-white-house-surveillance-trillions-us-call-records/"
  },
  {
    "text": "Trump's Retribution … The New York Times political correspondent Maggie Haberman tells Jamie that a second Trump will be defined by unfettered score settling.  Plus:  —Trump's social media strategy  —Bannon friction -Trump/Carlson 24?  —Trump's totalitarian rhetoric -The trials are happening",
    "url": "https://thedispatch.com/podcast/dispatch-podcast/trumps-retribution/"
  },
  {
    "text": "New York Jets icon Joe Namath allegedly allowed sexual abuse at his camp, lawsuit says  —  Philip Lyle Smith, 64, said he was sexually abused by a high school football coach at Namath's camps in the 1970s, according to the lawsuit.  —  A Florida real estate broker accused New York Jets icon Joe Namath … ",
    "url": "https://www.nbcnews.com/news/us-news/joe-namath-accused-allowing-sexual-abuse-football-camp-rcna125977"
  },
  {
    "text": "Statement from President Joe Biden on Transgender Day of Remembrance  —  There is no place for hate in America and no one should be discriminated against simply for being themselves.  Today, on Transgender Day of Remembrance we are reminded that there is more to do meet that promise … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/11/20/statement-from-president-joe-biden-on-transgender-day-of-remembrance/"
  },
  {
    "text": "A New Group Linked to DeSantis Allies Pops Up in Iowa  —  The group, Fight Right, was registered in recent days as Gov. Ron DeSantis tries to boost his momentum heading into the Iowa caucuses.  —  A new political group with ties to Gov. Ron DeSantis of Florida began reserving airtime in Iowa on Monday … ",
    "url": "https://www.nytimes.com/2023/11/20/us/politics/desantis-iowa-new-group.html"
  },
  {
    "text": "Support for Abortion Access Is Near Record, WSJ-NORC Poll Finds  —  Some 55% of respondents say a pregnant woman should be able to get an abortion for any reason  —  Santana De'LaBay, a 29-year-old Republican with six children, thinks her party is wrong to back broad abortion restrictions.",
    "url": "https://www.wsj.com/politics/policy/support-for-abortion-access-is-near-record-wsj-norc-poll-finds-6021c712?mod=followamazon"
  },
  {
    "text": "Former Chicago Mayor Rahm Emanuel's Michigan home spray-painted with the word ‘Nazis’  —  Rahm Emanuel, the U.S. ambassador to Japan, was not at the cottage in Gordon Beach in southwest Michigan.  He thanked law enforcement for its handling of the incident.",
    "url": "https://chicago.suntimes.com/2023/11/19/23968320/with-antisemitism-on-the-rise-former-mayor-rahm-emanuels-michigan-home-defaced-with-the-word-nazis"
  }
]