[
  {
    "text": "Why a Second Trump Presidency May Be More Radical Than His First  —  Donald Trump has long exhibited authoritarian impulses, but his policy operation is now more sophisticated, and the buffers to check him are weaker.  —  Donald Trump has long exhibited authoritarian impulses … ",
    "url": "https://www.nytimes.com/2023/12/04/us/politics/trump-2025-overview.html"
  },
  {
    "text": "Trump's revenge?  GOP braces for daily blasts from ‘orange Jesus’  —  His reascension, as nominee or the eventual winner, threatens to spark the same clashes with the Hill GOP that took a heavy toll on the party.  —  Congressional Republicans are steeling themselves for a return to daily life … ",
    "url": "https://www.politico.com/news/2023/12/04/trump-revenge-gop-00129418"
  },
  {
    "text": "If Trump Wins  —  The staff of The Atlantic on the threat a second term poses to American democracy.  —  For The Atlantic's January/February 2024 issue, 24 contributors consider what Donald Trump could do if he were to return to the White House.  Trump's second term, they conclude, would be much worse.",
    "url": "https://www.theatlantic.com/magazine/archive/2024/01/donald-trump-second-term-policies/676176/"
  },
  {
    "text": "Trump seeks “urgent review” of gag order ruling in New York civil fraud case  —  Former President Donald Trump intends to appeal a ruling that upheld a gag order in his civil fraud trial in New York, with his attorneys saying Monday that they plan to ask the state's highest court to review the decision.",
    "url": "https://www.cbsnews.com/news/trump-gag-order-new-york-fraud-case-appeal/"
  },
  {
    "text": "How Donald Trump uses dishonesty  —  You don't need to know a lot about Donald Trump to have a broad understanding of what motivates him and how he approaches power.  You only really need to know that he is someone who spent decades running a private company focused on selling real estate in New York City.",
    "url": "https://www.washingtonpost.com/politics/2023/12/04/trump-misinformation-republicans/"
  },
  {
    "text": "Hundreds rally for Gaza in Philly, stop to protest outside Goldie falafel shop  —  Hundreds of protesters marched through Center City and University City to show their support for Gaza and demand a permanent cease-fire.  It's the latest in sustained local efforts aiming to call attention … ",
    "url": "https://www.inquirer.com/news/philadelphia/philly-palestine-protest-goldie-center-city-20231203.html"
  },
  {
    "text": "CNN's Bash has tense exchange over Hamas rapes with Jayapal  —  CNN anchor Dana Bash pressed Rep. Pramila Jayapal (D-Wash.) on the silence from some fellow progressive leaders on Hamas's use of rape as a weapon of war against Israeli women, in a tense exchange in a Sunday interview.",
    "url": "https://thehill.com/policy/international/4340811-cnn-bash-jayapal-hamas-violence-rape-women-israel/"
  },
  {
    "text": "Senate Dems say border talks are dead.  Republicans say it's merely a flesh wound.  —  Hanging in the balance is Biden's foreign policy agenda.  —  The lead Democrat in the Senate border negotiations warned Monday that those discussions have fallen apart, endangering a major part of President Joe Biden's foreign policy agenda.",
    "url": "https://www.politico.com/news/2023/12/04/senate-dems-border-talks-are-dead-senate-republicans-theres-still-a-pulse-00129900"
  },
  {
    "text": "Israel investigates possible trading knowledge ahead of Oct 7 Hamas attack  —  Israeli authorities are investigating claims by U.S. researchers that some investors may have known in advance of a Hamas plan to attack Israel on Oct. 7 and used that information to profit from Israeli securities.",
    "url": "https://www.reuters.com/world/middle-east/israel-investigates-possible-trading-knowledge-ahead-oct-7-hamas-attack-2023-12-04/"
  },
  {
    "text": "Burgum suspends 2024 GOP presidential campaign  —  North Dakota Gov. Doug Burgum (R) is suspending his campaign in the Republican presidential primary after failing to gain traction in the crowded field.  —  Burgum's campaign was seen as a longshot from its conception.",
    "url": "https://thehill.com/homenews/campaign/4289981-burgum-suspends-2024-gop-presidential-campaign/"
  },
  {
    "text": "Swiss bank Banque Pictet admits hiding $5.6 billion of Americans' money from IRS  — A major Swiss bank admits it conspired with U.S. taxpayers and others to hide over $5.6 billion from the Internal Revenue Service.  — Banque Pictet, the private banking division of Pictet Group … ",
    "url": "https://www.cnbc.com/2023/12/04/swiss-bank-banque-pictet-admits-hiding-americans-income-from-irs.html"
  },
  {
    "text": "Koch network faces internal scrutiny after Nikki Haley endorsement  —  Americans for Prosperity's decision to endorse Nikki Haley for president roiled rank-and-file members of the group who aren't on board.  —  The political branch of the powerful Koch network is facing scrutiny as operatives chafe … ",
    "url": "https://www.nbcnews.com/politics/2024-election/koch-network-faces-internal-scrutiny-nikki-haley-endorsement-rcna127838"
  },
  {
    "text": "Former U.S. Ambassador and National Security Council Official Charged with Secretly Acting as an Agent of the Cuban Government  —  For Immediate Release  —  Federal prosecutors have charged Victor Manuel Rocha, 73, of Miami, Florida, a former U.S. Department of State employee who served … ",
    "url": "https://www.justice.gov/opa/pr/former-us-ambassador-and-national-security-council-official-charged-secretly-acting-agent"
  },
  {
    "text": "Ousted propaganda scholar Joan Donovan accuses Harvard of bowing to Meta  —  In a whistleblower complaint, she breaks her silence over events that unsettled other misinformation researchers  —  A prominent disinformation scholar has accused Harvard University of dismissing her to curry favor … ",
    "url": "https://www.washingtonpost.com/technology/2023/12/04/joan-donovan-harvard-dismissal-complaint/"
  },
  {
    "text": "Kari Lake struggles to court moderates, imperiling GOP Senate pickup  —  Lake's outreach has been met with skepticism after her 2022 gubernatorial campaign resulted in deep-seated resentments  —  PHOENIX — When she ran for governor of Arizona last year, Kari Lake unapologetically pilloried … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/04/kari-lake-struggles-court-moderates-imperiling-gop-senate-pickup/"
  },
  {
    "text": "Republican Senate frontrunner in Montana calls for returning ‘healthcare to pure privatization’  —  The Scoop  —  Tim Sheehy, a lead contender for the Republican Senate nomination in Montana, said earlier this year that he wants to privatize the U.S. healthcare system, according to audio obtained by Semafor.",
    "url": "https://www.semafor.com/article/12/03/2023/sheey-montana-senate-healthcare-privatization"
  },
  {
    "text": "SHOCK: Fox News, CNN, MSNBC Shoot Down Prospect of George Santos Hire  —  There are a few well trodden paths for former members of Congress, erstwhile White House officials and failed presidential candidates.  They can choose a life of lobbying, making up for the lost time of a government salary.",
    "url": "https://www.mediaite.com/media/scoop-cable-news-networks-say-they-are-not-interested-in-hiring-george-santos/"
  },
  {
    "text": "Scoop: Kushner, Jewish business leaders huddle with Qatari PM  —  Jared Kushner and Ivanka Trump organized a private meeting in New York last Wednesday with Qatar's prime minister and a bipartisan group mostly of Jewish businessmen and billionaires, three sources with direct knowledge of the meeting tell Axios.",
    "url": "https://www.axios.com/2023/12/04/jared-kushner-jewish-business-leaders-qatar"
  },
  {
    "text": "Comer mischaracterizes Hunter Biden car payment reimbursement to his dad  —  The payments Hunter Biden made to his father came two years after the elder Biden had left the vice presidency  —  As House Republicans move toward a floor vote to authorize an impeachment inquiry against President Biden … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/04/comer-mischaracterizes-hunter-biden-car-payment-reimbursement-his-dad/"
  },
  {
    "text": "In GOP's proposed Georgia congressional map, a key question is which voters are legally protected  —  A push by Georgia Republicans to maintain their congressional majority is likely to come down to a decades-old legal question that has never been settled by the U.S. Supreme Court … ",
    "url": "https://apnews.com/article/gerrymandering-georgia-congress-black-vote-ef6e4cd11f47a51586fb090fcd951105"
  },
  {
    "text": "Santos-inspired bill would ban pensions for expelled lawmakers  —  A House Republican on Monday introduced legislation barring lawmakers who are expelled from Congress from receiving congressional pensions. … - Nunn was among the more than 100 Republicans who voted to expel Santos following … ",
    "url": "https://www.axios.com/2023/12/04/santos-pension-republican-house-bill-nunn"
  }
]