[
  {
    "text": "In Which Ian Miles Cheong Understands Trump's Campaign Better than NYT  —  The second I saw video of Vice President Harris rolling up to a hangar at Detroit's airport on Air Force Two, then alighting with Tim Walz in front of cheering crowds, I knew it would break Donald Trump's brain.",
    "url": "https://www.emptywheel.net/2024/08/12/in-which-ian-miles-cheong-understands-trumps-campaign-better-than-nyt/"
  },
  {
    "text": "The Reintroduction of Kamala Harris  —  The soundtrack suggested a Beyoncé concert.  The light-up bracelets evoked the Eras Tour.  And the exuberant crowd—more than 14,000 strong, lining up in the rain—resembled the early days of Barack Obama.  Inside a Philadelphia arena on Aug. 6 … ",
    "url": "https://time.com/7009317/reintroduction-of-kamala-harris/"
  },
  {
    "text": "Harris becomes betting favorite in presidential election odds after swing state barnstorm  —  Democratic presidential nominee Vice President Kamala Harris stands as the slight betting favorite over Republican nominee former President Donald Trump to win the White House.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/12/harris-trump-presidential-election-odds-swing-state-tour/74762000007/"
  },
  {
    "text": "Trump Falsely Claims That the Crowds Seen at Harris Rallies Are Fake  —  The former president, in a series of social media posts, said that Vice President Kamala Harris had used A.I. technology to create images of fake crowds at her events.  —  Former President Donald J. Trump has taken … ",
    "url": "https://www.nytimes.com/2024/08/11/us/politics/trump-harris-crowds-ai.html?unlocked_article_code=1.CU4.IU4A.laO56X6syKZM&smid=url-share"
  },
  {
    "text": "Trump reportedly used a slur against Harris in private conversations  —  Former President Donald Trump reportedly has used a slur often targeted at women to describe Vice President Kamala Harris during at least two private conversations.  His campaign denies it.",
    "url": "https://apnews.com/article/donald-trump-kamala-harris-slur-women-5aeb94facc4cad8c57de072fe85027d3"
  },
  {
    "text": "The most expensive political ad of all time  —  In 2022, Elon Musk purchased Twitter, one of the world's largest social networks, for $44 billion.  From a financial perspective, it has not worked out well.  Over the last two years, the value of Twitter — which Musk renamed X — has plunged.",
    "url": "https://popular.info/p/the-most-expensive-political-ad-of"
  },
  {
    "text": "Far-right rallies abandoned amid warnings of 10-year sentences  —  Anti-racism marches attract large crowds as foreign secretary says rioters forgot ‘what it means to be English’  —  Planned far-right rallies did not materialise over the weekend, amid a large turnout of anti-racist protesters … ",
    "url": "https://www.theguardian.com/politics/article/2024/aug/11/far-right-demonstrations-abandoned-amid-warnings-of-10-year-sentences"
  },
  {
    "text": "Poll: Democratic attacks on JD Vance are working  —  The Scoop  —  New polling shared exclusively with Semafor shows Democrats' attacks on JD Vance's views on abortion, divorce and “childless cat ladies” are sticking with voters.  —  A pair of surveys by Blueprint, the centrist Democratic pollster backed … ",
    "url": "https://www.semafor.com/article/08/12/2024/poll-democratic-attacks-on-jd-vance-are-working"
  },
  {
    "text": "Early numbers show violent crime dropping sharply … - It also gives Vice President Kamala Harris, a former prosecutor in San Francisco and California attorney general, a potent defense against attacks from the right on crime. … - 54 of the 69 major cities in the report saw drops in violent crime … ",
    "url": "https://www.axios.com/2024/08/12/violent-crime-harris-trump-election"
  },
  {
    "text": "White House launches broad new regulatory effort, as Harris prepares to unveil economic plan … The Biden Administration on Monday unveiled a new, multi-agency regulatory initiative to target corporate practices that officials claim are designed to waste consumers' time and needlessly burden … ",
    "url": "https://www.cnbc.com/2024/08/12/biden-harris-new-regulations-would-target-corporations-that-waste-consumers-time.html"
  },
  {
    "text": "Americans' refusal to keep paying higher prices may be dealing a final blow to US inflation spike  —  The great inflation spike of the past three years is nearly spent — and economists credit American consumers for helping slay it.  Some of America's largest companies, from Amazon to Disney to Yum Brands … ",
    "url": "https://apnews.com/article/inflation-prices-consumers-economy-spending-federal-reserve-c69408f05baeffac0023ceb76b747999"
  },
  {
    "text": "House Freedom Caucus sets its terms for September spending fight  —  The House Freedom Caucus is ramping up pressure on GOP leaders to back a short-term funding bill into early 2025 — seeking to punt major spending decisions into a potential Trump administration.",
    "url": "https://www.politico.com/live-updates/2024/08/12/congress/preview-of-the-spending-fight-00173600"
  },
  {
    "text": "Trump to sue DOJ for $100M over Mar-a-Lago raid, alleging ‘political persecution’  —  Trump attorney says ‘unconstitutional’ raid should never have been approved by Garland, Wray  —  Join Fox News for access to this content  —  EXCLUSIVE: Former President Donald Trump is set to sue … ",
    "url": "https://www.foxnews.com/politics/trump-sue-doj-100m-over-mar-a-lago-raid-alleging-political-persecution"
  },
  {
    "text": "Walz's candidacy is making kindness great again  —  When Kamala Harris picked Minnesota Gov. Tim Walz as her running mate, my heart burst with pride for my home state.  As a daughter of Minnesota, it has been thrilling to watch how quickly the country has gone wild for Walz.",
    "url": "https://thehill.com/opinion/campaign/4820687-tim-walz-kamala-harris-minnesota/"
  },
  {
    "text": "FACT SHEET: Biden-Harris Administration Launches New Effort to Crack Down on Everyday Headaches and Hassles That Waste Americans' Time and Money  —  New actions will take on corporate tricks and scams like excessive paperwork, long wait times, and more that pad the profits of big business … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/08/12/fact-sheet-biden-harris-administration-launches-new-effort-to-crack-down-on-everyday-headaches-and-hassles-that-waste-americans-time-and-money/"
  },
  {
    "text": "Trump shooting task force demands documents from top Biden officials in probe kickoff  —  The House of Representatives is kicking off its formal probe into the attempted assassination of former President Trump on Monday.  —  The bipartisan Trump shooting task force sent a pair of letters announcing … ",
    "url": "https://www.foxnews.com/politics/trump-shooting-task-force-demands-documents-biden-officials-probe"
  },
  {
    "text": "Delays hit 40% of Biden's major IRA manufacturing projects  —  FT research shows that $84bn of initiatives announced in first year of the IRA and Chips Act have experienced slowdowns  —  Some 40 per cent of the biggest US manufacturing investments announced in the first year … ",
    "url": "https://www.ft.com/content/afb729b9-9641-42b2-97ca-93974c461c4c"
  },
  {
    "text": "Amicable Walz learned hardball politics in the House  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions  — descriptions off, selected",
    "url": "https://thehill.com/homenews/campaign/4821219-walz-house-hardball-politics/"
  },
  {
    "text": "Exclusive: DNC launches first Harris-Walz ad blitz … - The DNC says it is launching more than 80 billboards, which will run in English and Spanish, in and around the major metropolitan areas in the swing states of Arizona, Georgia, Michigan, North Carolina, Nevada, Pennsylvania and Wisconsin.",
    "url": "https://www.axios.com/2024/08/12/dnc-harris-walz-billboards-2024-democrats"
  }
]