[
  {
    "text": "Judge rescinds permission for Trump to give his own closing argument at his civil fraud trial  —  Donald Trump won't make his own closing argument in his New York civil business fraud trial after his lawyers objected to the judge's insistence that the former president would stick to “relevant” matters.",
    "url": "https://apnews.com/article/trump-fraud-trial-closing-arguments-420997f889922423dbce8a0945f0c348"
  },
  {
    "text": "Republican Voters Can — and Should — Rethink Nominating Trump  —  To say Donald Trump is the front-runner for the Republican nomination is an understatement.  He is above 60 percent in national polling averages and leads by roughly 30 points in Iowa.  His lead is much narrower in New Hampshire … ",
    "url": "https://www.nationalreview.com/2024/01/republican-voters-can-and-should-rethink-nominating-trump/"
  },
  {
    "text": "Trump vowed he'd ‘never’ help Europe if it's attacked, top EU official says  —  ‘By the way NATO is dead,’ the former (and potential future) US president added in private meeting.  —  BRUSSELS — One of Europe's most senior politicians recounted how former U.S. President Donald Trump privately warned … ",
    "url": "https://www.politico.eu/article/donald-trump-vow-never-help-europe-attack-thierry-breton/"
  },
  {
    "text": "Trump's Bad Day in Court  —  The first of many to come  —  Following Tuesday morning's oral argument in the District of Columbia, Donald Trump made some predictable comments to the press from a Washington, D.C., hotel.  As he finished, a reporter shouted out a request that he use the moment to tell his followers, “No violence.”",
    "url": "https://joycevance.substack.com/p/trumps-bad-day-in-court"
  },
  {
    "text": "Trump won't be allowed to give his own closing argument in N.Y. fraud trial  —  NEW YORK — Donald Trump will not be allowed to personally argue during summations at his business fraud civil trial Thursday after his attorneys would not agree to have him stick to case-related topics.",
    "url": "https://www.washingtonpost.com/politics/2024/01/10/trump-closing-argument-new-york-fraud-trial/"
  },
  {
    "text": "Judge Signals Trump Is Doomed in New E. Jean Carroll Trial  —  In a 27-page order, the judge overseeing the E. Jean Carroll case essentially sides entirely against Trump and suggests the case is basically already decided.  —  With Donald Trump's second rape defamation trial only one week away … ",
    "url": "https://www.thedailybeast.com/judge-signals-trump-is-doomed-in-new-e-jean-carroll-trial"
  },
  {
    "text": "‘You have no balls’: Hunter Biden derails GOP vote to hold him in contempt  —  The president's son made his second straight surprise appearance designed to rattle the Republicans investigating him.  It seemed to work.",
    "url": "https://www.politico.com/live-updates/2024/01/10/congress/hunter-biden-appears-at-contempt-me-00134740"
  },
  {
    "text": "Mike Johnson urges fellow Republicans to leave him alone on social media … - Facing a Jan. 19 deadline, some hardliners have said they are not opposed to shutting down the government in an attempt to get more concessions.  — Democrats have noted that Republicans have very little leverage due … ",
    "url": "https://www.axios.com/2024/01/10/mike-johnson-budget-republicans-social-media"
  },
  {
    "text": "Trump promotes ‘totally baseless’ birther conspiracy theory against Nikki Haley  —  The former U.N. ambassador was born in South Carolina and is a U.S. citizen.  —  DES MOINES, Iowa — Donald Trump, the chief propagator of false birther claims first against then-President Barack Obama … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-promotes-baseless-birther-conspiracy-theory-nikki-haley-rcna133166"
  },
  {
    "text": "PA 2024 Elections: Biden On Upside Of Too-Close-To-Call Race, Quinnipiac University Pennsylvania Poll Finds; Casey Opens Up Double-Digit Lead In Senate Race  —  mail_outline  —  In the key swing state of Pennsylvania, President Joe Biden and former President Donald Trump remain in a too-close … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3888"
  },
  {
    "text": "Trump prosecutor accused of ‘improper’ relationship with Georgia DA Fani Willis billed $4K for meetings with WH officials  —  The special prosecutor that Georgia District Attorney Fani Willis is accused of having an “improper” relationship with billed the Fulton County DA's office $4,000 … ",
    "url": "https://nypost.com/2024/01/10/news/trump-prosecutor-nathan-wade-billed-georgia-da-4000-for-white-house-meetings/"
  },
  {
    "text": "Republican governors in 15 states reject summer food money for kids  —  Moving beyond efforts to block expansion of health care for the poor and disabled, Republican governors in 15 states are now rejecting a new, federally funded summer program to give food assistance to hungry children.",
    "url": "https://www.washingtonpost.com/nation/2024/01/10/republican-governors-summer-lunch-program/"
  },
  {
    "text": "Florida school district removes dictionaries from libraries, citing law championed by DeSantis  —  The Escambia County School District, located in the Florida panhandle, has removed several dictionaries from its library shelves over concerns that making the dictionaries available to students would violate Florida law.",
    "url": "https://popular.info/p/florida-school-district-removes-dictionaries"
  },
  {
    "text": "Wenstrup Releases Statement Following Dr. Fauci's Two-Day Testimony  —  WASHINGTON — Select Subcommittee on the Coronavirus Pandemic Chairman Brad Wenstrup (R-Ohio) issued the following statement after the second day of Dr. Anthony Fauci's transcribed interview:",
    "url": "https://oversight.house.gov/release/wenstrup-releases-statement-following-dr-faucis-two-day-testimony/"
  },
  {
    "text": "Stefanik slams NYC move to shift migrants to high school, forcing students into remote learning: ‘Outrageous’  —  Adams' office said the move was out of an abundance of ‘caution’  —  Read this article for free!  —  Plus get unlimited access to thousands of articles, videos and more with your free account!",
    "url": "https://www.foxnews.com/politics/stefanik-slams-nyc-move-shift-migrants-high-school-forcing-students-remote-learning-outrageous"
  },
  {
    "text": "New Arizona Poll Finds Sinema Trails Gallego, Lake in Three-Way Matchup (Exclusive)  —  Biden and Trump are also locked in a dead heat in the state  —  A new poll from Arizona found that Independent Sen. Kyrsten Sinema is far behind her potential general election opponents.",
    "url": "https://themessenger.com/politics/new-arizona-poll-finds-sinema-trails-gallego-lake-in-three-way-matchup-exclusive"
  },
  {
    "text": "Lauren Boebert's Ex-Husband Arrested on Weapons and Assault Charges  —  In addition to the assault and weapons counts, Boebert was also charged with harassment (\"strikes shoves, kicks\"), disorderly conduct, and trespassing, jail records show.  —  Jayson Boebert, the former husband of Rep. Lauren Boebert … ",
    "url": "https://www.thedailybeast.com/lauren-boeberts-ex-husband-arrested-on-weapons-and-assault-charges"
  },
  {
    "text": "Ecuador president says country is at war as gangs hold prison staff hostage  —  Ecuador President Daniel Noboa said on Wednesday that his country was “at war” with drug gangs who are holding more than 130 prison guards and other staff hostage and who briefly captured a TV station live on air … ",
    "url": "https://www.reuters.com/world/americas/more-than-130-ecuador-prison-staff-held-hostage-armed-forces-target-crime-gangs-2024-01-10/"
  }
]