[
  {
    "text": "Steve Scalise is the GOP's next pick for speaker  —  The Louisiana Republican defeated Judiciary Chair Jim Jordan in a secret-ballot vote on Wednesday.",
    "url": "https://www.politico.com/live-updates/2023/10/11/congress/scalise-gop-speaker-majority-house-00120940"
  },
  {
    "text": "‘We have 8 people who are insane’: Republican inside speaker vote bashes colleagues  —  WASHINGTON — Republicans are behind closed doors Wednesday trying to figure out how to get to electing a new Speaker of the House so they can navigate the impending demands of the war in Israel and a possible government shutdown.",
    "url": "https://www.rawstory.com/raw-investigates/inane-people-house-speaker/"
  },
  {
    "text": "Marjorie Taylor Greene won't support her party's choice for House speaker because he has cancer  — House Republicans just narrowly nominated Rep. Steve Scalise to be their candidate for speaker.  — But Marjorie Taylor Greene is withholding her support, citing his cancer diagnosis.",
    "url": "https://www.businessinsider.com/marjorie-taylor-greene-steve-scalise-house-speaker-cancer-2023-10?op=1"
  },
  {
    "text": "House Speaker Election  —  The choice is a vote of confidence for the party's No. 2 House leader, but the rifts in his conference could still make for a chaotic election in the full chamber.  —  Here's the latest on the speaker nomination.  —  Republicans narrowly nominated Representative Steve Scalise … ",
    "url": "https://www.nytimes.com/live/2023/10/11/us/house-speaker-vote-news"
  },
  {
    "text": "Cenk Uygur running for president as Democrat  —  Progressive pundit Cenk Uygur will challenge President Biden for the Democratic nomination, offering himself as an alternative to an incumbent who “is definitely going to lose” if he makes it to the general election.",
    "url": "https://www.semafor.com/article/10/11/2023/cenk-uygur-running-for-president-as-democrat"
  },
  {
    "text": "Sen. Mitt Romney urged Democratic senators to challenge Biden — and he named names  —  At the Park City E2 Summit with Republican donors and influencers, the Utah senator made another plea for the anti-Trump crowd to coalesce around a single opponent to Trump",
    "url": "https://www.deseret.com/2023/10/10/23910516/mitt-romney-e2-summit-trump-israel-biden"
  },
  {
    "text": "Democrats furious over Van Orden outburst during White House briefing on Israel terrorist attack  —  Multiple attendees described Van Orden as acting belligerent towards the Biden administration briefers when he asked questions.",
    "url": "https://www.politico.com/live-updates/2023/10/11/congress/van-orden-outburst-house-israel-00120961"
  },
  {
    "text": "U.S. intelligence indicates Iranian leaders were surprised by Hamas attack  —  But Biden administration officials say Iran was “complicit” in the attack since it has armed and trained Hamas for decades.  —  American spy agencies have obtained “exquisite” intelligence that shows Iranian leaders … ",
    "url": "https://www.nbcnews.com/news/investigations/us-intelligence-indicates-iranian-leaders-surprised-hamas-attack-rcna119946"
  },
  {
    "text": "Supreme Court likely to side with South Carolina GOP in racial gerrymandering case  —  A lower court had ruled that the state's Republican-drawn map was a racial gerrymander.  —  The Supreme Court's conservative majority on Wednesday appeared likely to uphold a Republican-drawn congressional district … ",
    "url": "https://www.politico.com/news/2023/10/11/supreme-court-likely-to-side-with-south-carolina-gop-in-racial-gerrymandering-case-00121003"
  },
  {
    "text": "The Supreme Court appears determined to make it easy to draw gerrymanders  —  The Republican Party had a great day in the Supreme Court today.  Voting rights did not.  —  The Supreme Court's Republican-appointed majority spent Wednesday morning seemingly hunting for a reason to uphold … ",
    "url": "https://www.vox.com/scotus/2023/10/11/23912904/supreme-court-voting-rights-gerrymander-south-carolina-alexander-naacp"
  },
  {
    "text": "Oklahoma Judge Who Texted During Murder Trial Faces Removal  —  The chief justice of the Oklahoma Supreme Court is recommending the removal of District Judge Traci Soderstrom, who exchanged more than 500 texts with her courtroom bailiff during the trial.  —  Video",
    "url": "https://www.huffpost.com/entry/bc-us-oklahoma-judge-cellphone_n_6526ebace4b0a32c15c144c6"
  },
  {
    "text": "Judge Accused of Sending Wildly Inappropriate Texts During Her First Murder Trial  —  The Oklahoma judge swapped more than 500 texts about everything from a prosecutor's genitals to a “pretty” cop, an investigation found.  —  An Oklahoma judge could be booted from the bench after an investigation found … ",
    "url": "https://www.thedailybeast.com/oklahoma-judge-traci-soderstrom-busted-sending-inappropriate-texts-during-murder-trial"
  },
  {
    "text": "GOP lawmaker helps evacuate Americans in Israel  —  Rep. Cory Mills (R-Fla.) is in Israel to aid Americans in escaping the country, which has been ravaged by fighting over the last few days.  —  Former Rep. Mayra Flores (R-Texas) posted a photo of the Florida Republican in Israel on social media … ",
    "url": "https://thehill.com/homenews/house/4250324-gop-lawmaker-evacuate-americans-israel/"
  },
  {
    "text": "At least 40 babies, some beheaded, found by Israel soldiers in Hamas-attacked village  —  IDF Maj Gen Itai Veruv described scene in Kfar Aza as ‘a massacre’  —  Israel's military has discovered unspeakable horrors in an Israeli community that was attacked by Hamas on Saturday … ",
    "url": "https://www.foxnews.com/world/40-babies-some-beheaded-found-israel-soldiers-hamas-attacked-village"
  },
  {
    "text": "I apologize, Kentucky  —  Bluegrass Freedom Action, a political action committee supporting Republican Daniel Cameron, is airing this ad touting former President Donald Trump's endorsement in the race for Kentucky governor.  (Screenshot)  —  I owe Kentucky an apology and should have made it before now.",
    "url": "https://kentuckylantern.com/2023/10/11/i-apologize-kentucky/"
  },
  {
    "text": "Republican lawmakers to introduce resolution to expel Rep. George Santos from Congress  —  The movement came a day after Santos, also a Republican, was charged with fraud and identity theft.  —  A group of House Republicans from New York are introducing a resolution to expel Rep. George Santos, R-N.Y., from Congress.",
    "url": "https://www.nbcnews.com/politics/congress/new-york-house-republicans-introduce-resolution-expel-rep-george-santo-rcna119917"
  },
  {
    "text": "National Republicans knew Lake was unbeatable.  So they joined her.  —  The failed gubernatorial candidate has professionalized her operation.  —  SCOTTSDALE, Ariz. — Kari Lake launched her long-awaited Senate campaign with a 50-minute speech on Tuesday that bore little resemblance … ",
    "url": "https://www.politico.com/news/2023/10/11/kari-lake-arizona-senate-campaign-00120888"
  },
  {
    "text": "She was told her twin sons wouldn't survive.  Texas law made her give birth anyway.  —  Miranda Michel, 26, couldn't leave the state for an abortion.  But she also couldn't bear the idea of carrying a nonviable pregnancy to term.  —  Editor's note: This story includes images some people may find distressing.",
    "url": "https://www.texastribune.org/2023/10/11/texas-abortion-law-texas-abortion-ban-nonviable-pregnancies/"
  },
  {
    "text": "Pennsylvania 2024 Poll: Young Voters Hesitant to Support Biden but Stick With Sen. Casey  —  Home Polls Pennsylvania 2024 Poll: Young Voters Hesitant to Support Biden but Stick With Sen. Casey  —  Casey Holds Eight-Point Lead Over McCormick in 2024 Matchup",
    "url": "https://emersoncollegepolling.com/pennsylvania-2024-poll-young-voters-hesitant-to-support-biden-but-stick-with-sen-casey/"
  },
  {
    "text": "Scoop: Zelensky asks to visit Israel in show of solidarity  —  Ukrainian President Volodymyr Zelensky wants to visit Israel in a show of solidarity with the country amid the fighting in Gaza, two Ukrainian and Israeli officials told Axios. … - The officials said the talks on the issue … ",
    "url": "https://www.axios.com/2023/10/11/zelensky-israel-hamas-war-gaza-visit-netanyahu"
  },
  {
    "text": "Fulton County DA rebuffs Jim Jordan's request for information on her investigation of Trump  —  Fulton County District Attorney Fani Willis declined to provide House Judiciary Chairman Jim Jordan with any additional information about her investigation of former President Donald Trump … ",
    "url": "https://www.cnn.com/2023/10/11/politics/fani-willis-jim-jordan/"
  },
  {
    "text": "Hamas Seeds Violent Videos on Sites With Little Moderation  —  The strategy mirrors efforts by extremist groups like the Islamic State and Al Qaeda in years past.  —  A video of a Hamas gunman firing his assault rifle at a car full of Israeli civilians was viewed more than one million times on X … ",
    "url": "https://www.nytimes.com/2023/10/10/technology/hamas-violent-videos-online.html"
  },
  {
    "text": "Pro-Trump Lawyers Kenneth Chesebro and Sidney Powell Try - Again - to Dismiss Georgia RICO Charges Against Them  —  Fulton County Superior Court Judge Scott McAfee on Wednesday heard pre-trial arguments to dismiss the Georgia election-racketeering case before the trial begins with jury selection on Oct. 20",
    "url": "https://themessenger.com/politics/trump-georgia-mcafee-hearing-rico-chesebro-powell"
  },
  {
    "text": "How to think morally about the Israel-Hamas war  —  Massacring civilians is neither decolonization nor self-defense.  —  In southern Israel, Hamas terrorists broke into a room where a family of five was hiding and slaughtered every one of them.  In Gaza, a father wrapped in gauze held his child … ",
    "url": "https://www.vox.com/world-politics/23911550/israel-hamas-war-gaza-palestine-leftist-democrats"
  },
  {
    "text": "Charles Koch's audacious new $5 billion political scheme  —  Billionaire Charles Koch, who will turn 88 on November 1, is funneling his wealth into two secretive organizations that can continue his right-wing political advocacy for years.  Koch structured more than $5 billion in donations … ",
    "url": "https://popular.info/p/charles-kochs-5-billion-tax-loophole"
  },
  {
    "text": "Democrat raises more funds than GOP incumbent in Mississippi governor's race  —  Brandon Presley, the Democrat challenging incumbent Mississippi Gov. Tate Reeves (R), has outraised Reeves heading into November's election, according to financial reports filed Tuesday.",
    "url": "https://thehill.com/homenews/state-watch/4250620-democrat-raises-more-funds-than-gop-incumbent-in-mississippi-governors-race/"
  }
]