[
  {
    "text": "Trump Media auditor warns that losses ‘raise substantial doubt’ about company's ability to continue  —  The Truth Social parent, which trades under the stock ticker DJT, said it lost more than $58 million last year.  —  An auditor has raised doubts about the ability of Donald Trump's publicly traded company … ",
    "url": "https://www.nbcnews.com/business/business-news/trump-media-auditor-warns-losses-raise-doubt-company-rcna145831"
  },
  {
    "text": "Trump's net worth plunges $1 billion as his media stock tumbles  —  New York CNN  —  Shares of Truth Social owner Trump Media & Technology Group plunged Monday after the company disclosed that it lost more than $58 million and generated very little revenue in 2023.",
    "url": "https://www.cnn.com/2024/04/01/media/truth-social-trump-media-stock-losses/"
  },
  {
    "text": "Trump Media stock closes 21% lower after company reports $58 million loss for 2023 … This photo illustration shows an image of former President Donald Trump reflected in a phone screen that is displaying the Truth Social app, in Washington, DC, on February 21, 2022.",
    "url": "https://www.cnbc.com/2024/04/01/trump-media-lost-58-million-last-year-sec-filing-shows.html"
  },
  {
    "text": "Trump Media Shares Slump as Early Fervor Fades  —  A rapid fall in price erased billions of dollars in the market value of the parent company of Truth Social, eating into some of the gains made in the volatile stock's public debut.  —  Shares of former President Donald J. Trump's social media company slumped … ",
    "url": "https://www.nytimes.com/2024/04/01/business/trump-media-stock.html"
  },
  {
    "text": "Donald Trump has posted a $175 million bond to avert asset seizure as he appeals NY fraud penalty  —  Donald Trump posted a $175 million bond on Monday in his New York civil fraud case, halting collection of the more than $454 million he owes and preventing the state from seizing his assets … ",
    "url": "https://apnews.com/article/donald-trump-civil-fraud-trial-feb0593a5bbd3837edc0db195554eda1"
  },
  {
    "text": "Trump secures $175 million bond in New York civil fraud case  —  An appeals court last week reduced the amount of bond he was required to post.  —  Former President Donald Trump speaks at a campaign rally in Rome, GA, March 9, 2024.  —  Former President Donald Trump and his co-defendants … ",
    "url": "https://abcnews.go.com/US/trump-secures-175-million-bond-new-york-civil/story?id=108715465"
  },
  {
    "text": "Trump posts $175M bond to keep N.Y. authorities from seizing property  —  NEW YORK — Donald Trump posted a $175 million bond on Monday to prevent New York authorities from seizing his assets, including properties such as Trump Tower, pending appeal of a civil fraud judgment against him of nearly a half-billion dollars.",
    "url": "https://www.washingtonpost.com/national-security/2024/04/01/trump-new-york-bond-175-million/"
  },
  {
    "text": "Florida Supreme Court allows one of nation's strictest abortion bans to take effect  —  The high court simultaneously ruled that a referendum enshrining abortion rights can go on the November ballot  —  Florida's conservative Supreme Court ruled Monday that the state's constitution does … ",
    "url": "https://www.washingtonpost.com/nation/2024/04/01/abortion-florida-supreme-court-ballot/"
  },
  {
    "text": "Florida Supreme Court upholds state's 15-week abortion ban, but voters will soon have a say  —  The Florida Supreme Court on Monday cleared the way for the state to ban abortions after six weeks of pregnancy, before many women know they are pregnant, while also giving voters a chance to remove restrictions in November.",
    "url": "https://apnews.com/article/florida-abortion-ban-supreme-court-ruling-6a4949fc7459afe9b5e298086a793126"
  },
  {
    "text": "Florida's abortion ruling puts Trump on the spot over DeSantis' bans  —  The relationship between the two Republicans has deteriorated, and they're still throwing jabs.  —  Ron DeSantis made a risky political bet by signing abortion bans into law in Florida.  Now, it's Donald Trump who could pay for it.",
    "url": "https://www.politico.com/news/2024/04/01/florida-abortion-desantis-trump-00150024"
  },
  {
    "text": "Gag Order Against Trump Is Expanded to Bar Attacks on Judge's Family  —  Donald Trump had in recent days targeted the daughter of Juan Merchan, the judge overseeing his criminal trial in Manhattan, in blistering social media posts.  —  The New York judge overseeing Donald J. Trump's upcoming … ",
    "url": "https://www.nytimes.com/2024/04/01/nyregion/trump-gag-order-juan-merchan.html"
  },
  {
    "text": "First human case of avian flu in Texas raises alarm  —  Potential cow-to-cow avian flu transmission in Idaho is worrying pandemic experts.  —  A Texas dairy worker has tested positive for the avian flu, marking the first identified human case of an illness in the U.S. that has sickened … ",
    "url": "https://www.politico.com/news/2024/04/01/first-human-avian-flu-case-texas-00149949"
  },
  {
    "text": "The Church of Trump: How He's Infusing Christianity Into His Movement  —  Ending many of his rallies with a churchlike ritual and casting his prosecutions as persecution, the former president is demanding — and receiving — new levels of devotion from Republicans.",
    "url": "https://www.nytimes.com/2024/04/01/us/politics/trump-2024-religion.html"
  },
  {
    "text": "Trump's Call for Israel to ‘Finish Up’ War Alarms Some on the Right  —  Recent private remarks he made urging an end to the Gaza conflict, with no insistence on freeing Israeli hostages first, were another departure from conservatives' support for Benjamin Netanyahu.",
    "url": "https://www.nytimes.com/2024/04/01/us/politics/trump-israel-conservative.html"
  },
  {
    "text": "Letter to the nation's teaching hospitals and medical schools  —  To the nation's teaching hospitals and medical schools:  —  Today, the Department of Health and Human Services (the Department), through the Centers for Medicare & Medicaid Services (CMS), released new guidance to reiterate … ",
    "url": "https://www.hhs.gov/about/news/2024/04/01/letter-to-the-nations-teaching-hospitals-and-medical-schools.html"
  },
  {
    "text": "Conservative US judge says AI could strengthen ‘originalist’ movement  —  A conservative federal appeals court judge on Monday said future developments in artificial intelligence could revolutionize how judges like himself tie their rulings to the past by interpreting the U.S. Constitution based on the nation's history and tradition.",
    "url": "https://www.reuters.com/legal/transactional/conservative-us-judge-says-ai-could-strengthen-originalist-movement-2024-04-01/"
  },
  {
    "text": "Ex-Trump aide Hope Hicks expected to testify in former president's New York criminal trial  —  The former White House communications director met with prosecutors from the Manhattan District Attorney's Office last year.  —  Former White House communications director Hope Hicks is expected … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/hope-hicks-expected-testify-donald-trumps-hush-money-trial-rcna145895"
  },
  {
    "text": "Exclusive: Trump allies plot anti-racism protections — for white people … Targets would range from decades-old policies aimed at giving minorities economic opportunities, to more recent programs that began in response to the pandemic and the killing of George Floyd.",
    "url": "https://www.axios.com/2024/04/01/trump-reverse-racism-civil-rights"
  },
  {
    "text": "Melania Trump Is Back — But Maybe Not for Long  —  Melania Trump has been found, but don't throw out your “Where is Melania?” flyers or call off the search planes just yet.  —  The former First Lady appeared at Donald Trump's November 2022 presidential-campaign announcement.",
    "url": "https://nymag.com/intelligencer/article/melania-trump-back-missing-again.html"
  },
  {
    "text": "Migrants in Iowa wonder whether to leave over a bill that could see some arrested and deported  —  A bill in Iowa that would allow the state to arrest and deport some migrants is stoking anxiety among immigrant communities, leaving some to wonder: “Should I leave Iowa?”",
    "url": "https://apnews.com/article/iowa-bill-deport-immigrants-police-texas-6e650bfaa39c5a0332194dd1e1ba7363"
  },
  {
    "text": "A biased test kept thousands of Black people from getting a kidney transplant.  It's finally changing  —  (AP Video by Tassanee Vejpongsa; Production by Shelby Lum)  —  Jazmin Evans had been waiting for a new kidney for four years when her hospital revealed shocking news … ",
    "url": "https://apnews.com/article/kidney-transplant-race-black-inequity-bias-d4fabf2f3a47aab2fe8e18b2a5432135"
  },
  {
    "text": "Scoop: Sullivan to meet MBS to push Saudi side of Israel mega-deal … - U.S. officials hope to reach a bilateral agreement with the Saudis and then possibly present it to Israeli Prime Minister Benjamin Netanyahu, whose side of the deal would include committing to a path toward a two-state solution.",
    "url": "https://www.axios.com/2024/04/02/saudi-arabia-israel-normalization-deal-sullivan"
  },
  {
    "text": "Driver rams into front gate of Atlanta FBI office, taken into custody  —  The car appeared to try to follow an authorized vehicle entering the gate.  —  A man rammed a vehicle into the FBI entrance gate at the Atlanta field office, April 1, 2024.  —  A driver rammed into the front gate … ",
    "url": "https://abcnews.go.com/US/driver-rams-front-gate-atlanta-fbi-office-custody/story?id=108718475"
  },
  {
    "text": "How Republicans texted and emailed their way into a money problem  —  Small-dollar donations to Trump and the GOP are way down since 2019 and 2020.  But the former president's team says they see a turnaround.  —  In the years after Donald Trump lost the presidency to Joe Biden … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/01/trump-republican-small-donations-problems/"
  },
  {
    "text": "A U.S. Senator Is Shaming Universities Into Returning Native American Human Remains  —  “The worst kind of colonialism,” Sen. Brian Schatz (D-Hawaii) said of schools and museums holding onto thousands of stolen bones.  But it's complicated.  —  WASHINGTON - A couple of months ago … ",
    "url": "https://www.huffpost.com/entry/brian-schatz-native-american-human-remains-nagpra_n_65d523b2e4b0f7fbe7b463f2"
  },
  {
    "text": "DeSantis blasts Biden for denying trans visibility declaration on Easter: 'Who's running the presidency?'  —  Biden said he 'didn't do that' when asked about the official White House proclamation declaring March 31 ‘Transgender Day of Visibility’  —  Florida Gov. Ron DeSantis slammed President Biden … ",
    "url": "https://www.foxnews.com/politics/desantis-blasts-biden-denying-trans-visibility-declaration-easter-whos-running-presidency"
  }
]