[
  {
    "text": "A “Delicate Matter”: Clarence Thomas' Private Complaints About Money Sparked Fears He Would Resign  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship with real estate tycoon Harlan Crow … ",
    "url": "https://www.propublica.org/article/clarence-thomas-money-complaints-sparked-resignation-fears-scotus"
  },
  {
    "text": "Biden said to be increasingly frustrated by dismal poll numbers  —  In one recent meeting he said poll numbers were unacceptably low and he wanted to know what his team and his campaign were doing about it  —  The night before President Biden departed Washington to celebrate Thanksgiving on Nantucket … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/18/joe-biden-polls-campaign/"
  },
  {
    "text": "'Biden's too old,' Nikki Haley says in new campaign ad  —  Republican presidential candidate Nikki Haley has launched a new campaign ad calling President Biden “too old,” in one of the most direct attacks on the president's age this election cycle.  —  “I'll just say it: Biden's too old,” Haley, 51, says in the ad.",
    "url": "https://www.washingtonpost.com/politics/2023/12/18/nikki-haley-joe-biden-age/"
  },
  {
    "text": "Biden unharmed after car strikes president's motorcade in Delaware  —  It was not immediately clear why the sedan smashed into an SUV that was part of the motorcade.  The driver was surrounded by agents who had their guns drawn.  —  A sedan smacked into a Secret Service vehicle that was part … ",
    "url": "https://www.nbcnews.com/politics/politics-news/biden-unharmed-car-strikes-presidents-motorcade-delaware-rcna130189"
  },
  {
    "text": "Trump reprises dehumanizing language on undocumented immigrants, warns of ‘invasion’  —  Former president Donald Trump on Sunday accused undocumented immigrants of waging an “invasion” of the United States, in a speech that highlighted his frequent use of dehumanizing language and exaggerated terms … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/18/trump-immigrants-invasion-dehumanizing/"
  },
  {
    "text": "Conservatives move to keep abortion off the 2024 ballot  —  “We don't believe those rights should be subjected to majority vote.”  —  Conservatives are testing new tactics to keep abortion off the ballot following a series of high-profile defeats.  —  In Arizona, Florida, Nevada and other states … ",
    "url": "https://www.politico.com/news/2023/12/18/first-rule-of-the-anti-abortion-playbook-dont-let-the-public-vote-on-abortion-00132049"
  },
  {
    "text": "Southwest's $140M penalty ‘should put all airlines on notice’ after travel debacle  —  Last year's travel mess left 16,900 flights canceled and more than two million passengers stranded.  —  The Transportation Department is slapping Southwest Airlines with the largest consumer protection penalty … ",
    "url": "https://www.politico.com/news/2023/12/18/southwest-airlines-fine-2022-transportation-00132222"
  },
  {
    "text": "Pope Francis Allows Priests to Bless Same-Sex Relationships  —  A church official said the blessings amounted to “a real development” that nevertheless did not amend “the traditional doctrine of the Church about marriage.”  —  Pope Francis has taken one of the most concrete steps in his efforts … ",
    "url": "https://www.nytimes.com/2023/12/18/world/europe/pope-gay-lesbian-same-sex-blessing.html"
  },
  {
    "text": "Elon Musk's Big Lie About Tesla Is Finally Exposed  —  More than 2 million of the cars are being recalled — because Tesla's “self-driving” systems have always been anything but  —  BACK IN 2016, Elon Musk claimed that Tesla cars could “drive autonomously with greater safety than a person.",
    "url": "https://www.rollingstone.com/culture/culture-commentary/elon-musk-tesla-crash-1234930544/"
  },
  {
    "text": "Biden's daughter owes thousands in income taxes, lien documents show  —  Read this article for free!  —  Plus get unlimited access to thousands of articles, videos and more with your free account!  —  FIRST ON FOX: Ashley Biden, President Biden's daughter, owes $5,000 in income taxes beginning in 2015 … ",
    "url": "https://www.foxnews.com/politics/ashley-biden-owes-thousands-taxes-lien-documents-show?intcmp=tw_fnc"
  },
  {
    "text": "Scoop: Crypto leaders build colossal $78 million war chest for 2024  —  Cryptocurrency industry leaders have poured $78 million into super PACs aimed at bolstering and growing the ranks of crypto-friendly lawmakers on Capitol Hill, Axios has learned. … - Crypto-focused super PAC Fairshake … ",
    "url": "https://www.axios.com/2023/12/18/crypto-super-pac-fairshake-2024-elections"
  },
  {
    "text": "White House pushes back against ‘extreme Congressional Republicans’ in year-end memo  —  The White House in a year-end memo on Monday pushed back against congressional Republicans, calling them “extreme” and saying they don't have a strong economic plan.  —  Communications Director Ben … ",
    "url": "https://thehill.com/homenews/administration/4365389-white-house-extreme-congressional-republicans-year-end-memo/"
  },
  {
    "text": "Trump says Nevada fake electors treated ‘unfairly’  —  Former President Trump praised the fake electors charged in Nevada, during a campaign rally in Reno on Sunday, and lamented that they were being treated “unfairly.”  —  Trump's words of encouragement come ahead of a Monday arraignment for six so-called … ",
    "url": "https://thehill.com/homenews/campaign/4365400-trump-nevada-fake-electors-treated-unfairly/"
  },
  {
    "text": "No Labels Is Pushing a Lie That Will Elect Trump  —  There's no path to victory for a third-party candidate.  —  With a rematch between President Joe Biden and Donald Trump almost set in stone, it's time to put a farce to rest: The notion that a third-party candidate could actually win the presidency in 2024.",
    "url": "https://www.politico.com/news/magazine/2023/12/18/third-party-2024-no-labels-00132066"
  },
  {
    "text": "Florida Republican Party suspends chairman and demands his resignation amid rape investigation  —  TALLAHASSEE, Fla. (AP) — The Republican Party of Florida suspended Chairman Christian Ziegler and demanded his resignation during an emergency meeting Sunday, adding to calls by Gov. Ron DeSantis … ",
    "url": "https://apnews.com/article/christian-ziegler-rape-accusation-florida-republican-party-8d1cb7c6f2f3e009a88e47a735eacc4c"
  }
]