[
  {
    "text": "Do You Remember the Ecstasy of Electing Joe Biden?  —  How the coalition that defeated Donald Trump crumbled.  —  We danced in the streets when Joe Biden was elected.  Do you remember?  American cities staged the greatest spontaneous outpouring of joy since V-J Day with cars honking … ",
    "url": "https://nymag.com/intelligencer/article/can-joe-biden-win-2024-presidential-election-anti-trump-coalition.html"
  },
  {
    "text": "Florida Democrats flip Republican House seat in Special Election  —  ORANGE COUNY, Fla. — Florida Democrats scored a win Tuesday night in a special election to fill a vacant House seat with Tom Keen defeating Erika Booth in a closely watched race that saw major outside spending and an avalanche of mailers and TV ads.",
    "url": "https://www.wftv.com/news/local/florida-democrats-flip-republican-house-seat-special-election/BDGBNIJ3CZECRMX6NTSZQVYZX4/"
  },
  {
    "text": "Democrat Keen wins state House 35 special election over GOP's Booth  —  In a race seen as a bellwether for Democratic chances in November, Democrat Tom Keen flipped what had been a Republican state House seat in Central Florida in a special election held Tuesday.",
    "url": "https://www.orlandosentinel.com/2024/01/16/democrat-keen-wins-state-house-35-special-election-over-gops-booth/"
  },
  {
    "text": "Judge Aileen Cannon Is Quietly Sabotaging the Trump Classified Documents Case  —  On Friday, District Judge Aileen Cannon issued a new order in the Donald Trump classified documents case adding to the mountain of evidence that she is firmly in the former president's pocket.",
    "url": "https://slate.com/news-and-politics/2024/01/judge-aileen-cannon-trump-classifed-sabotage.html"
  },
  {
    "text": "DeSantis Super PAC Begins Layoffs, Even as He Projects Confidence  —  The number of layoffs at the super PAC, Never Back Down, was unclear on Wednesday morning, but an official said that those being laid off were being paid through the end of January.  —  The super PAC supporting Gov. Ron DeSantis … ",
    "url": "https://www.nytimes.com/2024/01/17/us/politics/desantis-layoffs-super-pac.html"
  },
  {
    "text": "E&C Investigation Uncovers Earliest Known SARS-CoV-2 Sequence Released Outside of China  —  Discovery that shows virus sequence existed two weeks earlier than previously known undercuts China's timeline of events  —  Washington, D.C. — The House Energy and Commerce Committee's investigation … ",
    "url": "https://energycommerce.house.gov/posts/e-and-c-investigation-uncovers-earliest-known-sars-co-v-2-sequence-released-outside-of-china"
  },
  {
    "text": "David Weiss Buries Bill Barr Right Alongside Tony Bobulinski  —  For a second time, David Weiss' Special Counsel team has buried an inconvenient (some)body to avoid accounting for the politicization of the investigation they claim is not political.  —  This time, it's Bill Barr.",
    "url": "https://www.emptywheel.net/2024/01/17/david-weiss-buries-bill-barr-right-alongside-tony-bobulinski/"
  },
  {
    "text": "Right-wing media mogul buys the Baltimore Sun  —  David D. Smith, the executive chairman of Sinclair Broadcast Group (Sinclair), purchased the Baltimore Sun — the largest newspaper in Maryland — for an undisclosed sum.  The acquisition means another powerful media outlet will be under … ",
    "url": "https://popular.info/p/right-wing-media-mogul-buys-the-baltimore"
  },
  {
    "text": "New Biden rule cracks down on insurers' use of prior authorization  —  A new Biden administration rule released Wednesday aims to streamline the prior authorization process used by insurers to approve medical procedures and treatments.  —  Prior authorization is a common tool used by insurers … ",
    "url": "https://thehill.com/policy/healthcare/4413508-biden-rule-health-insurer-prior-authorization/"
  },
  {
    "text": "The Suicide of an Alabama Mayor Shows That Pre-Stonewall Horrors Aren't Just Coming Back.  They're Here.  — Many Queers Can't Bring Themselves to Face the Emotion They're Really Feeling Right Now.  We Must.  —  The practice of press outlets terrorizing gender-nonconforming people … ",
    "url": "https://slate.com/human-interest/2024/01/bubba-copeland-lgbtq-trans-outing-stonewall-history.html"
  },
  {
    "text": "Netanyahu Accused of Risking WWIII to Save His Own Skin  —  Critics of the Israeli PM say he is so desperate to avoid political consequences that he is prolonging the crisis and raising the specter of a full-blown war.  —  The Middle East is sitting on a powder keg and the longer … ",
    "url": "https://www.thedailybeast.com/netanyahu-accused-of-risking-wwiii-to-save-his-own-skin"
  },
  {
    "text": "Let's Look at the Iowa Results With a Cold Eye  —  It was a huge win for Trump.  Don't tell me it's all going to work out fine in November.  —  Let us be completely honest.  There is no silver lining to the results of Monday's Iowa caucuses.  What coverage I watched on TV—truth be told … ",
    "url": "https://www.esquire.com/news-politics/politics/a46410329/iowa-caucuses-results-trump-victory/"
  },
  {
    "text": "The ‘Sleeping Giant’ Case that Could Upend Jack Smith's Prosecution of Trump  —  The Supreme Court has agreed to consider a case that doesn't mention the former president, but that could invalidate half of the Jan. 6 charges against him.  —  There's been a lot of attention paid … ",
    "url": "https://www.politico.com/news/magazine/2024/01/17/supreme-court-case-trump-prosecution-00135852"
  },
  {
    "text": "The House G.O.P.'s Incredible Shrinking Majority  —  Another Republican resignation and medical absences are cutting into the party's already shaky hold on the chamber.  —  When Republicans assumed control of the House early last year after winning a narrow majority in the 2022 midterms … ",
    "url": "https://www.nytimes.com/2024/01/16/us/politics/republicans-house-majority.html"
  },
  {
    "text": "The big reason banks despise the Fed's capital rule  —  Editor's note: Morning Money is a free version of POLITICO Pro Financial Services morning newsletter, which is delivered to our subscribers each morning at 5:15 a.m. The POLITICO Pro platform combines the news you need with tools you can use … ",
    "url": "https://www.politico.com/newsletters/morning-money/2024/01/17/the-big-reason-banks-despise-the-feds-capital-rule-00136009"
  },
  {
    "text": "Americans are actually pretty happy with their finances  —  Americans overall have a surprising degree of satisfaction with their economic situation, according to findings from the Axios Vibes survey by The Harris Poll. … - The Axios Vibes poll has found that when asked … ",
    "url": "https://www.axios.com/2024/01/17/americans-are-actually-pretty-happy-with-their-finances"
  },
  {
    "text": "US police killed a record number of people in 2023: Research  —  The number of people killed by police officers in the United States reached a new high in 2023, according to new research.  —  The Mapping Police Violence project, which has been tracking police killings in the country since 2013 … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/4413518-police-killings-record-2023/"
  },
  {
    "text": "Johnson: Now is not ‘the time for comprehensive immigration reform’  —  Speaker Mike Johnson (R-La.) voiced his skepticism of a deal being crafted in the Senate to pair border and migration policy changes with Ukraine aid, and said that now is not the time for comprehensive immigration reform.",
    "url": "https://thehill.com/homenews/house/4413501-mike-johnson-immigration-reform/"
  }
]