[
  {
    "text": "How every GOP presidential candidate performed with likely caucusgoers in new Iowa Poll  —  From Donald Trump and Ron DeSantis to Ryan Binkley and Francis Suarez, how 14 Republican candidates performed in the new Des Moines Register/NBC News/Mediacom Iowa Poll",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2023/08/21/iowa-poll-shows-how-much-gop-support-donald-trump-ron-desantis-tim-scott-have-in-state-2024-election/70638832007/"
  },
  {
    "text": "Gov. Chris Sununu: This Is How to Beat Trump  —  This week, Republican primary candidates for president will have a chance to make their case before a national audience — with or without Donald Trump on the debate stage.  To win, they must break free of Mr. Trump's drama, step out of his shadow … ",
    "url": "https://www.nytimes.com/2023/08/21/opinion/governor-sununu-republicans-trump.html"
  },
  {
    "text": "GOP will lose ‘up and down the ballot’ with Trump, New Hampshire governor warns  —  In an op-ed, Republican Chris Sununu, governor of the first-in-the-nation primary state, urges second-tier candidates to drop out and consolidate behind an alternative.  —  New Hampshire Gov. Chris Sununu … ",
    "url": "https://www.nbcnews.com/politics/2024-election/gop-will-lose-trump-new-hampshire-gov-chris-sununu-warns-rcna101013"
  },
  {
    "text": "Trump's legal woes are part of his quasi-religious mythology of martyrdom  —  These criminal entanglements are not only means but ends - not a sideshow, but the heart and soul of Trump's campaign  —  n 16 or perhaps 17 July 2024, in Milwaukee, the Republican national convention will likely nominate … ",
    "url": "https://www.theguardian.com/commentisfree/2023/aug/21/trump-election-giuliani-sidney-blumenthal"
  },
  {
    "text": "Trump legal team agrees to $200,000 bond after meeting with Fulton County district attorney's office  —  Former President Donald Trump has agreed to a $200,000 bond and other release conditions after his lawyers met with the Fulton County District Attorney's office on Monday, according to court documents reviewed by CNN.",
    "url": "https://www.cnn.com/2023/08/21/politics/fulton-county-da-office-negotiations-trump/"
  },
  {
    "text": "Eastman agrees to $100K bond in Georgia election case  —  Attorney John Eastman, one of former President Trump's 18 co-defendants in his recent Georgia indictment, has agreed to a $100,000 bond, court filings show.  —  A judge on Monday morning signed off on pretrial release conditions … ",
    "url": "https://thehill.com/regulation/court-battles/4162818-eastman-agrees-to-100k-bond-in-georgia-election-case/"
  },
  {
    "text": "Virginia Democrats raise alarms that Gov. Glenn Youngkin could be building toward a national bid  —  Youngkin has built a robust statewide political operation.  Virginia Democrats worry the national party isn't doing enough.  —  Virginia Democrats are worried the national party isn't doing enough … ",
    "url": "https://www.nbcnews.com/politics/2024-election/virginia-democrats-raise-alarms-gov-glenn-youngkin-building-national-b-rcna100435"
  },
  {
    "text": "Vivek Ramaswamy wants to know how many ‘federal agents’ were on the planes that hit the Twin Towers: ‘I want the truth about 9/11’  — Vivek Ramaswamy is again raising questions about what happened on September 11, 2001.  — The GOP contender says it's “legitimate” to ask “how many federal agents” were on the planes.",
    "url": "https://www.businessinsider.com/vivek-ramaswamy-truth-federal-agents-planes-twin-towers-2023-8?op=1"
  },
  {
    "text": "Elon Musk's Shadow Rule  —  How the U.S. government came to rely on the tech billionaire—and is now struggling to rein him in.  —  Last October, Colin Kahl, then the Under-Secretary of Defense for Policy at the Pentagon, sat in a hotel in Paris and prepared to make a call to avert disaster in Ukraine.",
    "url": "https://www.newyorker.com/magazine/2023/08/28/elon-musks-shadow-rule?currentPage=all"
  },
  {
    "text": "Freedom Caucus rebels against a short-term funding bill with new demands  —  The new list of policy changes sought by the ultraconservative House lawmakers drew immediate pushback from Democratic leaders, who warned it would cause a shutdown.  —  WASHINGTON — The ultraconservative House Freedom Caucus … ",
    "url": "https://www.nbcnews.com/politics/congress/freedom-caucus-rebels-short-term-funding-bill-new-demands-rcna100993"
  },
  {
    "text": "Scoop: Inside Trump's new plan to limit immigration  —  Former President Trump wants unprecedented restrictions on immigration and the border if he's elected in 2024 — such as screening prospective immigrants for “Marxist” ideologies and a naval blockade to target drug smugglers, Axios has learned.",
    "url": "https://www.axios.com/2023/08/21/trump-immigration-border-mexico-cartels-2024-election"
  },
  {
    "text": "A right-wing sheriffs group that challenges federal law is gaining acceptance around the country  —  A national group of sheriffs that claims the top law enforcers in American counties are not bound by federal law has successfully spread its doctrine to dozens of states in recent years",
    "url": "https://abcnews.go.com/Politics/wireStory/wing-sheriffs-group-challenges-federal-law-gaining-acceptance-102427098"
  },
  {
    "text": "Conservation groups sue to keep Virginia in Youngkin-opposed climate program  —  A group of Virginia-based environmental and conservation groups sued the state Monday over Virginia's withdrawal from the Regional Greenhouse Gas Initiative (RGGI), a carbon-capping agreement encompassing several other East Coast states.",
    "url": "https://thehill.com/policy/energy-environment/4163002-conservation-groups-sue-to-keep-virginia-in-youngkin-opposed-climate-program/"
  },
  {
    "text": "Five indications Joe Biden will not run in 2024  —  We don't see Biden on the campaign trail defending his presidency or touting his accomplishments  —  Standing before a New Mexico audience recently, President Biden unintelligibly joked that, “I hibernated in a while - all, you know, in Iowa for a while.”",
    "url": "https://www.foxnews.com/opinion/5-indications-joe-biden-not-run-2024"
  },
  {
    "text": "Run It Cold: Why Xi Jinping Is Letting China's Economy Flail  —  China is steering clear of big stimulus even in the face of deflation risks.  —  Xi Jinping's quest to rewrite the playbook that drove China's economic miracle for a generation is facing its sternest test yet.",
    "url": "https://www.bloomberg.com/news/features/2023-08-20/xi-jinping-is-running-china-s-economy-cold-on-purpose"
  },
  {
    "text": "DeSantis defends ‘listless vessels’ remark: These lawmakers putting ‘entertainment,’ ‘personality’ first  —  GOP presidential candidate and Florida Gov. Ron DeSantis (R) on Monday defended his remarks calling for Republicans to not be “listless vessels” automatically supporting former President Trump … ",
    "url": "https://thehill.com/homenews/campaign/4163165-desantis-defends-listless-vessels-remark-these-lawmakers-putting-entertainment-personality-first/"
  },
  {
    "text": "Biden Visiting Hawaii to Inspect Wildfire Damage  —  After remaining secluded since Friday, the president will break away from his vacation for a brief trip to Maui, where flames have demolished a town and killed more than 100 people.  —  President Biden is set to break away from his summer vacation … ",
    "url": "https://www.nytimes.com/2023/08/21/us/politics/biden-maui-hawaii-wildfires.html"
  }
]