[
  {
    "text": "Republicans cringe at Trump's undisciplined attacks on Harris: ‘A public nervous breakdown’  —  Republicans are reeling from Trump's undisciplined approach to the opening stages of his race against Harris.  —  Donald Trump spent Monday morning labeling the turmoil in the global financial markets the … ",
    "url": "https://www.politico.com/news/2024/08/05/republicans-cringe-trump-harris-attacks-00172724"
  },
  {
    "text": "Trump Pulls Bulk of Voters' Concerns About Age, Mental Fitness With Biden Out of Contest  —  Vice President Kamala Harris is seen as more mentally fit than Trump — and garners more trust than Biden on policy issues",
    "url": "https://pro.morningconsult.com/analysis/donald-trump-age-concerns-august-2024"
  },
  {
    "text": "Has Harris finally broken Trump?  He's flailing, glitching and running scared.  —  Vice President Harris, what have you done to this already very unstable man?  The cheese has somehow slid farther off his cracker.  —  Folks, I think Vice President Kamala Harris has broken Donald Trump.",
    "url": "https://www.usatoday.com/story/opinion/columnist/2024/08/05/trump-insults-harris-strength-election/74636226007/"
  },
  {
    "text": "Google loses massive antitrust lawsuit over its search dominance  —  New York CNN  —  Google has violated US antitrust law with its search business, a federal judge ruled Monday, handing the tech giant a staggering court defeat with the potential to reshape how millions of Americans … ",
    "url": "https://www.cnn.com/2024/08/05/business/google-loses-antitrust-lawsuit-doj/"
  },
  {
    "text": "‘Google Is a Monopolist,’ Judge Rules in Landmark Antitrust Case  —  The ruling on Google's search dominance was the first antitrust decision of the modern internet era in a case against a technology giant.  —  Google acted illegally to maintain a monopoly in online search … ",
    "url": "https://www.nytimes.com/2024/08/05/technology/google-antitrust-ruling.html?unlocked_article_code=1.Ak4.5YFq.BNXgssAZjWWq&smid=url-share"
  },
  {
    "text": "Former Trump attorney Jenna Ellis agrees to cooperate in Arizona elector case  —  In a deal that allows Ellis to avoid potential jail time, she has agreed to provide prosecutors with evidence that could implicate other defendants.  —  PHOENIX — Arizona Attorney General Kris Mayes (D) … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/05/jenna-ellis-arizona/"
  },
  {
    "text": "Attorney General Mayes Announces Cooperation Agreement in Fake Electors Case  —  PHOENIX - Attorney General Kris Mayes today announced a cooperation agreement with a defendant in the fake electors' case.  Jenna Ellis signed the agreement earlier this morning.",
    "url": "https://www.azag.gov/press-release/attorney-general-mayes-announces-cooperation-agreement-fake-electors-case"
  },
  {
    "text": "US Supreme Court declines to halt Trump's sentencing in hush money case  —  The U.S. Supreme Court on Monday rejected a bid by the state of Missouri to halt Donald Trump's upcoming sentencing for his conviction in New York on felony charges involving hush money paid to a porn star and left … ",
    "url": "https://www.reuters.com/world/us/us-supreme-court-declines-halt-trumps-sentencing-hush-money-case-2024-08-05/"
  },
  {
    "text": "What Does Robert F. Kennedy, Jr., Actually Want?  —  The third-party Presidential candidate has a troubled past, a shambolic campaign, and some surprisingly good poll numbers.  —  In December of 2021, the pollster Jeremy Zogby began designing a national survey to capture the radical changes … ",
    "url": "https://www.newyorker.com/magazine/2024/08/12/robert-f-kennedy-jr-profile-presidential-campaign?currentPage=all"
  },
  {
    "text": "RFK Jr. admits to dumping a dead bear in Central Park, solving a decade-old mystery  —  For more on the 2024 election, head to the NPR Network's live updates page.  —  A decade after the shocking discovery of a bear cub carcass in Manhattan's Central Park, the mystery of who dumped it there has finally been solved.",
    "url": "https://www.npr.org/2024/08/05/nx-s1-5063939/rfk-jr-central-park-bear-bicycle"
  },
  {
    "text": "Justice Thomas Failed to Reveal More Private Flights, Senator Says  —  Senator Ron Wyden sent a letter to the wealthy conservative donor Harlan Crow's lawyer after records showed undisclosed flights between Hawaii and New Zealand with the Supreme Court justice in 2010.",
    "url": "https://www.nytimes.com/2024/08/05/us/politics/clarence-thomas-harlan-crow-private-jet.html?unlocked_article_code=1.Ak4.i_ro.GYqTCY16me1G&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Dow drops 1,000 points, and Japanese stocks suffer worst crash since 1987 as markets quake worldwide  —  Nearly everything on Wall Street is tumbling as fear of a slowing U.S. economy grows and sets off another sell-off for financial markets around the world.",
    "url": "https://apnews.com/article/stocks-markets-nikkei-economy-c6240977e9482bf7207abc53b2a11e58"
  },
  {
    "text": "“A Terrible Vulnerability”: Cybersecurity Researcher Discovers Yet Another Flaw in Georgia's Voter Cancellation Portal  —  The flaw would have allowed anyone to submit a voter registration cancellation request for any Georgian using their name, date of birth and county of residence — information that is easily discoverable online.",
    "url": "https://www.propublica.org/article/cybersecurity-expert-finds-another-flaw-in-georgia-voter-portal"
  },
  {
    "text": "Kamala Harris has MAGA world freaking out about demons and the apocalypse  —  From comparisons to biblical spirits to accusations that she's an “extinctionist,” top pro-Trump voices see a Harris presidency as the end of the world.  —  It's always the end of the world for the Make America Great Again movement.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/kamala-harris-maga-jezebel-apocalypse-rcna164922"
  },
  {
    "text": "Nevada Court Rejects Trump Campaign's Attempt To Throw Out Some Mail-in Ballots  —  The Trump campaign and the Republican National Committee (RNC) have lost yet another attempt to weaken mail-in voting ahead of the November election.  This time, a state court judge has denied the campaign's request … ",
    "url": "https://www.democracydocket.com/news-alerts/nevada-court-rejects-trump-campaigns-attempt-to-throw-out-some-mail-in-ballots/"
  },
  {
    "text": "Former KY Gov. Matt Bevin's adopted son reportedly removed from abusive facility in Jamaica  —  No one came for him after authorities removed eight boys from Atlantis Leadership Academy, reports Sunday Times of London  —  As Kentucky governor, Matt Bevin said his overriding goal was to reform … ",
    "url": "https://kentuckylantern.com/2024/08/04/former-ky-gov-matt-bevins-adopted-son-reportedly-removed-from-abusive-facility-in-jamaica/"
  },
  {
    "text": "Russell Vought, a Project 2025 architect, is ready to shock Washington if Trump wins second term … Russell Vought sounds like a general marshaling troops for combat when he talks about taming a “woke and weaponized” federal government.  He recently described political opposition as … ",
    "url": "https://apnews.com/article/project-2025-russell-vought-trump-federal-government-38fc446832062e40fc2ccad6f3348dfd"
  },
  {
    "text": "On Biden's Exit, Pelosi Says She Was Driven by Need to Defeat Trump  —  A new book by the former speaker details her clashes with the former president, but it was written before her most recent exercise of political might: helping persuade President Biden to end his re-election bid.",
    "url": "https://www.nytimes.com/2024/08/05/us/politics/pelosi-book-trump-biden.html"
  },
  {
    "text": "Harris VP announcement coming Tuesday, likely with video  —  Biden's 2020 introduction of Harris is a likely model, campaign insiders say.  —  Vice President Kamala Harris is bringing her crash search for a running mate to a close, with a final decision expected over the next 24 hours … ",
    "url": "https://www.politico.com/news/2024/08/05/harris-vp-announcement-coming-tuesday-with-likely-video-00172616"
  },
  {
    "text": "EXCLUSIVE - Federal Air Marshal Whistleblowers Report Tulsi Gabbard Actively Under Surveillance via Quiet Skies Program  —  In an exclusive breaking story, several Federal Air Marshal whistleblowers have come forward with information showing that former U.S. Representative … ",
    "url": "https://uncoverdc.com/2024/08/04/fams-whistleblowers-report-tulsi-gabbard-on-quiet-skies-list"
  },
  {
    "text": "Trump hikes Mar-a-Lago membership to $1m, raising concerns of selling access  —  Four new spots at his resort have opened at a 43% spike in a move seen as buying political influence  —  Donald Trump has set a million-dollar price tag for the ability to whisper in his ear should he win … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/05/trump-mar-a-lago-membership-price-hike"
  },
  {
    "text": "Virginia man charged with threatening to kill Vice President Kamala Harris  —  A Virginia man has been charged with making death threats against Vice President Kamala Harris and appeared in federal court on Monday.  —  According to court records, Frank Lucio Carillo made several threats against Harris … ",
    "url": "https://www.cnn.com/2024/08/05/politics/death-threats-kamala-harris-virginia-man-arrested/"
  },
  {
    "text": "States have spent nearly $500 million on anti-abortion counseling centers since fall of Roe  —  States that ban or restrict abortion have flooded anti-abortion counseling centers with nearly $500 million in taxpayer funding since the Supreme Court overturned Roe v. Wade two years ago, according to a new report.",
    "url": "https://www.cbsnews.com/news/abortion-states-have-spent-nearly-500-million-on-anti-abortion-counseling-centers/"
  },
  {
    "text": "Trumpworld Trashes Kellyanne Conway After She Registers as a Foreign Agent for Ukraine  —  “She's been pushing Trump to bring her back in, and meanwhile, she's getting paid by the Ukrainians,” an informal adviser to Trump told NOTUS.  “Basically, it's a hostile takeover attempt by the Ukrainian government.”",
    "url": "https://www.notus.org/trump-2024/trumpworld-kellyanne-conway-foreign-agent-ukraine"
  },
  {
    "text": "The Woman Who Engineered Donald Trump's Rise From the Ashes of 2020  —  In an excerpt of Trump in Exile, Meridith McGraw reveals how the former president was overwhelmed by the dysfunction his election loss brought upon Mar-a-Lago—until Susie Wiles took the wheel of his comeback campaign.",
    "url": "https://www.vanityfair.com/news/story/susie-wiles-donald-trump-rise-2020"
  }
]