[
  {
    "text": "‘Wildly underprepared’: National Guard troops seen sleeping on floors in exclusive photos  —  President Donald Trump's rush to deploy California National Guard troops to Los Angeles has left dozens of soldiers without adequate sleeping arrangements, forced to pack together in one or more federal buildings … ",
    "url": "https://www.sfchronicle.com/california/article/national-guard-california-photos-20368334.php"
  },
  {
    "text": "About 700 Marines being mobilized in response to LA protests, sources tell CNN  —  More than 700 Marines based out of the Marine Corps Air Ground Combat Center in California have been mobilized to respond to the protests in Los Angeles, according to three people familiar with the matter … ",
    "url": "https://cnn.com/2025/06/09/politics/marines-mobilized-los-angeles-protests"
  },
  {
    "text": "Exclusive: DHS secretary seeks military arrests in Los Angeles in leaked letter  —  One day before the Trump administration deployed U.S. Marines to confront protesters in Los Angeles, U.S. Homeland Security Secretary Kristi Noem asked Defense Secretary Pete Hegseth to direct the military to detain or arrest … ",
    "url": "https://www.sfchronicle.com/us-world/article/noem-immigration-protests-letter-20369001.php"
  },
  {
    "text": "Cries of Defiance and Songs of Joy in Los Angeles  —  The protesters are being called unspeakably violent by the Trump administration.  I mostly saw clergy sit-ins and Tejano bands.  —  Dayen-LAprotests1-060925  —  Protesters at the El Pueblo de Los Angeles Historic Monument on June 9, 2025.",
    "url": "https://prospect.org/justice/cries-defiance-songs-joy-los-angeles-ice-protests-immigration-raids/"
  },
  {
    "text": "Pentagon draws up rules on possible use of force by Marines deployed to LA protests  —  The Pentagon was scrambling Monday to establish rules to guide U.S. Marines who could be faced with the rare and difficult prospect of using force against citizens on American soil, now that the Trump administration … ",
    "url": "https://apnews.com/article/marines-protests-california-deployed-trump-503e1de25b45c760218d8ae879c8d2d3"
  },
  {
    "text": "This Is What Autocracy Looks Like  —  Since Donald Trump was elected again, I've feared one scenario above all others: that he'd call out the military against people protesting his mass deportations, putting America on the road to martial law.  Even in my more outlandish imaginings, however … ",
    "url": "https://www.nytimes.com/2025/06/09/opinion/autocracy-trump-la-protests.html"
  },
  {
    "text": "Marines Are Deploying to Los Angeles Area  —  Move comes in the wake of weekend protests over immigration  —  Roughly 500 Marines are deploying to the Los Angeles area to protect federal buildings and personnel in the wake of weekend protests over immigration that have already led President Trump … ",
    "url": "https://www.wsj.com/politics/national-security/marines-are-deploying-to-los-angeles-area-fe9a4ed6"
  },
  {
    "text": "700 Marines deployed to Los Angeles  —  Seven-hundred Marines in California have been ordered to assist in Los Angeles and they're expected to arrive over the next 24 hours, a U.S. official confirmed.  —  The Marines are from the 2nd Battalion, 7th Marines at Twentynine Palms, California … ",
    "url": "https://abcnews.go.com/US/live-updates/la-immigration-protests-live-updates-trump-deploys-2000/?id=122621279&entryId=122667907&cid=social_twitter_abcn"
  },
  {
    "text": "RFK Jr.: HHS Moves to Restore Public Trust in Vaccines  —  We're reconstituting an advisory committee to avoid conflicts of interest.  —  Vaccines have become a divisive issue in American politics, but there is one thing all parties can agree on: The U.S. faces a crisis of public trust.",
    "url": "https://www.wsj.com/opinion/rfk-jr-hhs-moves-to-restore-public-trust-in-vaccines-45495112"
  },
  {
    "text": "Health Secretary RFK Jr. abruptly fires CDC vaccine advisory panel  —  Kennedy said the move is needed to ‘re-establish public confidence,’ but experts expressed shock  —  Health Secretary Robert F. Kennedy Jr. has taken the extraordinary step of firing the expert panel that advises the Centers … ",
    "url": "https://www.statnews.com/2025/06/09/rfk-jr-fires-every-member-of-cdc-vaccine-expert-panel-acip/"
  },
  {
    "text": "Kennedy Removes All C.D.C. Vaccine Panel Experts  —  The U.S. health secretary chose to “retire” members of a committee that makes significant decisions about who receives immunizations, including the vaccines for children.  —  Robert F. Kennedy Jr., the U.S. health secretary … ",
    "url": "https://www.nytimes.com/2025/06/09/health/rfk-jr-cdc-vaccine-panel.html?unlocked_article_code=1.Nk8.0_Do.42Z_luhZ9z7F&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "RFK Jr. ousts entire CDC vaccine advisory committee  —  Health Secretary Robert F. Kennedy Jr. on Monday removed every member of a scientific committee that advises the Centers for Disease Control and Prevention on how to use vaccines and pledged to replace them with his own picks.",
    "url": "https://apnews.com/article/kennedy-cdc-acip-vaccines-3790c89f45b6314c5c7b686db0e3a8f9"
  },
  {
    "text": "RFK Jr. purges every vaccine adviser on CDC panel; will pick replacements  —  Kennedy said the Advisory Committee on Immunization Practices, a group of experts who recommend vaccines, has been “plagued with persistent conflicts of interest.”  —  Health and Human Services Secretary Robert F. Kennedy Jr … ",
    "url": "https://www.washingtonpost.com/health/2025/06/09/rfk-ousts-vaccine-advisory-committee-acip/"
  },
  {
    "text": "Mark Green says he'll retire from House after megabill vote  —  Rep. Mark Green said Monday he plans to resign from Congress after four terms to accept a private-sector job offer.  The Tennessee Republican and Homeland Security Committee said his retirement would begin after the House votes again … ",
    "url": "https://www.politico.com/live-updates/2025/06/09/congress/mark-green-to-retire-after-megabill-vote-00395343"
  },
  {
    "text": "Florida agency tells newspaper to halt reporting angle on foundation associated with governor's wife  —  Florida's child welfare agency sent a letter to a Florida newspaper telling it to “cease and desist” its reporting on foster families for a story about a nonprofit associated … ",
    "url": "https://apnews.com/article/orlando-sentinel-florida-desantis-welfare-9636452a8bf8eb230489513db64d86f7"
  },
  {
    "text": "Justice Jackson warns the Supreme Court is manipulating the rules to benefit Trump  —  On Friday, the Supreme Court handed down a brief order permitting the Department of Government Efficiency, the enigmatic White House entity that billionaire Elon Musk previously ran, to access a wide range … ",
    "url": "https://www.vox.com/scotus/416073/supreme-court-justice-ketanji-brown-jackson-shadow-docket-trump"
  },
  {
    "text": "NIH scientists publish “Bethesda Declaration” rebuking Trump admin … Over 300 researchers from the National Institutes of Health have published a letter rebuking its director and the Trump administration for deep, politically motivated cuts to research funding, as well as disrupting global collaboration … ",
    "url": "https://arstechnica.com/health/2025/06/culture-of-fear-and-suppression-nih-staff-speak-out-against-trump-admin/"
  },
  {
    "text": "6/10/25 ☀️ AM: … But the reconciliation fight is impacting what's already going to be a brutal partisan struggle over FY2026 government spending.  DOGE funding cuts, tens of thousands of federal employees laid off, a $9 billion-plus rescissions package, the end of USAID … ",
    "url": "https://punchbowl.news/archive/61025-am/"
  },
  {
    "text": "Latinas For Trump Co-Founder Rips Trump Immigration Policies As ‘Unacceptable And Inhumane’  —  “This is not what we voted for,” said Florida state Sen. Ileana Garcia (R), while accusing Trump of undermining “the sense of fairness and justice.”  —  A Republican Florida state senator … ",
    "url": "https://www.huffpost.com/entry/ileana-garcia-condemns-trump-immigration-policies_n_6846ea24e4b0ee4cf20cef74"
  }
]