[
  {
    "text": "Special counsel Jack Smith resigns from DOJ  —  The special counsel's departure was disclosed in a court filing submitted Saturday afternoon to U.S. District Judge Aileen Cannon.  —  Special counsel Jack Smith has completed his work on two criminal investigations of President-elect Donald Trump … ",
    "url": "https://www.politico.com/news/2025/01/11/jack-smith-resigns-justice-department-trump-criminal-investigation-00197694"
  },
  {
    "text": "Jack Smith, Who Led Prosecutions of Trump, Resigns  —  Mr. Smith, a special counsel appointed by Attorney General Merrick B. Garland, had signaled that he would step down before Donald J. Trump's inauguration.  —  Jack Smith, the special counsel who brought two unsuccessful federal prosecutions … ",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/jack-smith-special-counsel-resigns.html"
  },
  {
    "text": "DOJ says judge was ‘plainly’ wrong to block Trump election interference report  —  The Justice Department filed an emergency motion late Friday pushing for the speedy release of special counsel Jack Smith's investigative report on President-elect Donald Trump's alleged effort to overturn … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2025/01/11/justice-department-jack-smith-trump-report-release/77624205007/"
  },
  {
    "text": "Biden Awards Medal of Freedom to Pope Francis  —  President Biden, a Catholic, awarded the medal with distinction to the pontiff, to whom he has turned for personal guidance.  —  President Biden awarded the Presidential Medal of Freedom with Distinction to Pope Francis on Saturday … ",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/biden-medal-of-freedom-pope-francis.html"
  },
  {
    "text": "President Biden Awards Presidential Medal of Freedom with Distinction to His Holiness Pope Francis  —  Today, President Biden spoke with His Holiness Pope Francis and named him as a recipient of the Presidential Medal of Freedom with Distinction.  The Presidential Medal of Freedom … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/11/president-biden-awards-presidential-medal-of-freedom-with-distinction-to-his-holiness-pope-francis/"
  },
  {
    "text": "Republican congressman calls for halting of disaster relief to California  —  Warren Davidson of Ohio says aid should be withheld until the state ravaged by wildfires reforms forestry management  —  A Republican US congressman from Ohio has called for federal disaster relief to be withheld … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/11/warren-davidson-republican-disaster-relief-california-wildfires"
  },
  {
    "text": "F.B.I. Briefs Top Senators on Armed Services Panel About Hegseth  —  The committee's Republican chairman and its top Democrat were briefed on F.B.I. findings into Pete Hegseth, Donald Trump's defense secretary pick.  Democrats questioned whether there were gaps.",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/fbi-briefing-hegseth-senators.html?unlocked_article_code=1.oU4.AuHV.Z8LZQkOPNoG-&smid=url-share"
  },
  {
    "text": "Jeff Bezos' WaPo reeling from losses and ‘internal drama’ as Trump returns to DC: report  —  At a time when the always newsworthy Donald Trump is headed back to the White House, the venerable Washington Post should be gearing up to cover his second term but instead is being subjected to an exodus … ",
    "url": "https://www.rawstory.com/bezos-washington-post/"
  },
  {
    "text": "More than a dozen states have passed new laws that led to restrictions on pornography.  Now, the Supreme Court will weigh in  —  In Texas, Florida, and more than a dozen other states, users who try to access the world's largest pornography website are greeted by a surprising sight … ",
    "url": "https://www.cnn.com/2025/01/11/politics/invs-porn-age-verification-laws-supreme-court/"
  },
  {
    "text": "Trump border czar privately tempers Republican lawmaker expectations on administration's initial deportation operation  —  President-elect Donald Trump's border czar Tom Homan has privately told Republican lawmakers to temper their expectations for the incoming administration's initial deportation operation … ",
    "url": "https://www.cnn.com/2025/01/11/politics/trump-border-czar-tom-homan-deportations/"
  },
  {
    "text": "Vance Says Violent Jan. 6 Protesters Shouldn't Be Pardoned  —  Vice President-elect JD Vance tempered his boss's promise to pardon all the protesters involved in the US Capitol riot on Jan. 6, 2021, saying those who behaved violently should “obviously” not receive pardons.",
    "url": "https://www.bloomberg.com/news/articles/2025-01-12/vance-says-violent-jan-6-protesters-shouldn-t-be-pardoned"
  },
  {
    "text": "Dem senator warns ‘LA fires are preview of coming atrocities,’ claims Trump bought off by ‘Big Oil’  —  Ed Markey claims there is a ‘climate crisis’  —  As fires wreak havoc in California, Sen. Ed Markey, D-Mass., claimed in a post on X the catastrophe is “what a climate emergency looks like.”",
    "url": "https://www.foxnews.com/politics/dem-senator-warns-la-fires-preview-coming-atrocities-claiming-trump-bought-off-big-oil"
  },
  {
    "text": "Trump charms GOP rebels at Mar-a-Lago, with Musk in tow  —  “Unity was a huge part” of the confab, one of several House GOP meetings the president-elect has scheduled this weekend.  —  Donald Trump is working to smooth over roadblocks to his massive legislative agenda this weekend at his Florida resort … ",
    "url": "https://www.politico.com/news/2025/01/11/trump-freedom-caucus-mar-a-lago-00000260"
  },
  {
    "text": "Trump tells House Republicans to find a ‘fair number’ on SALT  —  New York Republicans left a meeting with the incoming president saying he supported increasing the cap on the SALT deduction.  —  New York Republicans came out of a Mar-a-Lago meeting with Donald Trump on Saturday confident … ",
    "url": "https://www.politico.com/news/2025/01/11/trump-tells-house-republicans-to-find-a-fair-number-on-salt-00197703"
  },
  {
    "text": "Scott Bessent, Trump's Billionaire Treasury Pick, Will Shed Assets to Avoid Conflicts  —  Financial disclosure forms show hundreds of millions of assets including property in the Bahamas and investments in Bitcoin and China's currency.  —  Scott Bessent, the billionaire hedge fund manager … ",
    "url": "https://www.nytimes.com/2025/01/11/business/scott-bessent-treasury-divest.html"
  },
  {
    "text": "Tulsa Massacre Was a ‘Coordinated, Military-Style Attack,’ Federal Report Says  —  The Justice Department's conclusion follows an investigation of the 1921 atrocity in Oklahoma in which up to 300 Black residents were killed.  —  The Tulsa Race Massacre of 1921, in which a prosperous Black neighborhood … ",
    "url": "https://www.nytimes.com/2025/01/11/us/tulsa-race-massacre-report.html?unlocked_article_code=1.oU4.Nd7q.uK9WZ2oE7wcj&smid=url-share"
  },
  {
    "text": "The Second Time as Farce: Imperialism in the 21st Century  —  Hegel remarks somewhere that all great world-historic facts and personages appear, so to speak, twice.  He forgot to add: the first time as tragedy, the second time as farce.  — Karl Marx, “The Eighteen Brumaire of Louis Bonaparte”, 1851",
    "url": "https://nathangoldwag.wordpress.com/2025/01/11/the-second-time-as-farce-imperialism-in-the-21st-century/"
  },
  {
    "text": "Mike Pence Shares the First Thing He Said to Trump in Four Years  —  Though Mike Pence hadn't seen Donald Trump since leaving the White House, the former vice president said he was grateful to get a moment to speak with him at Jimmy Carter's state funeral this week.",
    "url": "https://www.christianitytoday.com/2025/01/mike-pence-donald-trump-carter-funeral-russell-moore/"
  },
  {
    "text": "Supreme Court to examine stalled Biden plan cancelling debt for defrauded students  —  The U.S. Supreme Court said on Friday it will review a lower court's decision to block a Biden administration rule that helped forgive student debt held by borrowers who were defrauded by their colleges.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2025/01/11/supreme-court-biden-student-debt-rule/77626456007/"
  },
  {
    "text": "'There are a lot of bitter people here, I'm one of them': rust belt voters on why they backed Trump again despite his broken promises  —  Many in Youngstown, Ohio, believe the president-elect will tackle the town's decline this time.  Others are worried about his character flaws.",
    "url": "https://www.theguardian.com/us-news/2025/jan/11/there-are-a-lot-of-bitter-people-here-im-one-of-them-rust-belt-voters-on-why-they-backed-trump-again-despite-his-broken-promises"
  },
  {
    "text": "Scoop: Denmark sent Trump team private messages on Greenland … - Trump has repeatedly declared that controlling Greenland — the world's largest island — is necessary for U.S. national security vis-a-vis Russia and China. … - Climate change is opening up the Arctic for competition between superpowers … ",
    "url": "https://www.axios.com/2025/01/11/denmark-response-trump-greenland-threat"
  }
]