[
  {
    "text": "Donald Trump is going to win the election and democracy will be just fine  —  The BDN Opinion section operates independently and does not set news policies or contribute to reporting or editing articles elsewhere in the newspaper or on bangordailynews.com  —  Jared Golden represents Maine's … ",
    "url": "https://www.bangordailynews.com/2024/07/02/opinion/opinion-contributor/jared-golden-donald-trump-going-to-win-election-democracy-be-just-fine/"
  },
  {
    "text": "Biden's Lapses Are Said to Be Increasingly Common and Worrisome  —  People who have spent time with President Biden over the last few months or so said the lapses appear to have grown more frequent, more pronounced and, after Thursday's debate, more worrisome.",
    "url": "https://www.nytimes.com/2024/07/02/us/politics/biden-lapses.html"
  },
  {
    "text": "Biden Plunges in Swing States in Leaked Post-Debate Poll  —  The president is losing critical support in key battlegrounds, according to data from a premier Democratic firm, and putting previously noncompetitive states in play.  Also, for the first time, he's polling behind Kamala Harris.",
    "url": "https://puck.news/biden-plunges-in-swing-states-in-leaked-post-debate-poll/"
  },
  {
    "text": "“Freaking the f*** out”: Turmoil in the White House over Biden … - “It's the first topic of every conversation,” one White House official said. … - Another official put it more bluntly: “Everyone is freaking the f*** out.”  — “The uncertainty after Thursday is palpable and anxiety … ",
    "url": "https://www.axios.com/2024/07/02/biden-white-house-campaign-staff-freaking-out-debate"
  },
  {
    "text": "Scoop: Inside House Democrats' anti-Biden vent session … - Much of the meeting was taken up by members expressing their irritation and misgivings toward Biden and his team, according to a member in the meeting and another source briefed on the matter.  — Biden was repeatedly referred … ",
    "url": "https://www.axios.com/2024/07/02/house-democrats-biden-vent-session"
  },
  {
    "text": "Obama voices concerns after shaky debate, offers Biden his advice  —  The former president told allies that Biden's already-tough path to reelection grew more challenging after his debate performance on Thursday.  —  Former president Barack Obama has privately told allies who have reached … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/02/biden-obama-debate/"
  },
  {
    "text": "A new national poll turns post-debate conventional wisdom on its head  —  As always, though, we should be cautious about reading too much into one poll.  —  It has been less than a week since President Biden walked out onto the stage of the first presidential debate in Atlanta and upended his political legacy.",
    "url": "https://www.washingtonpost.com/politics/2024/07/02/biden-replacement-debate-harris-cnn-poll/"
  },
  {
    "text": "KATU Exclusive: Congresswoman Gluesenkamp Perez says “Biden is going to lose to Trump”  —  PORTLAND, Ore. (KATU) — A Washington Democratic Congresswoman says she believes President Biden will lose to former President Donald Trump in November.  —  Democrat Marie Gluesenkamp Perez (WA-3) … ",
    "url": "https://katu.com/news/your-voice-your-vote/katu-exclusive-congresswoman-gluesenkamp-perez-says-biden-is-going-to-lose-to-trump-marie-washington-third-congressional-district-president-joe-donald"
  },
  {
    "text": "Scoop: Donors eye Senate, House to hedge against a Biden loss … - It's the beginning of a potential massive political hedge, as skittish donors weigh where their dollars can have the most impact.  — It's also an acknowledgment that they view Biden's chances of besting Trump on Nov. 5 as diminishing.",
    "url": "https://www.axios.com/2024/07/02/biden-democratic-donors-senate-house-trump"
  },
  {
    "text": "White House's Day from Hell as Dems Open Fire on Biden  —  COMING UNDONE  —  Tuesday was Joe Biden's day from hell.  But Wednesday could turn out to be much worse.  —  Joe Biden's presidency went from teetering on the brink to being in full freefall on Tuesday.",
    "url": "https://www.thedailybeast.com/joe-bidens-presidency-is-in-freefall-as-democrats-round-on-him-and-talk-kamala-harris-as-replacement"
  },
  {
    "text": "Justice Dept. plans to pursue Trump cases past Election Day, even if he wins  —  If Donald Trump is elected president, the finish line for federal prosecutors is Inauguration Day, not Election Day, people familiar with the discussions said  —  Justice Department officials plan to pursue … ",
    "url": "https://www.washingtonpost.com/national-security/2024/07/02/justice-dept-trump-prosecute-after-election/"
  },
  {
    "text": "We're Releasing Our Full, Unedited Interview With Joe Biden From September  —  Following Biden's poor debate performance against Donald Trump, we're releasing the full and unedited 21-minute interview we conducted with President Joe Biden nine days before his interview with Special Counsel Robert K. Hur.",
    "url": "https://www.propublica.org/article/biden-interview-unedited-september-2023"
  },
  {
    "text": "Highlighting journalism on Mastodon  —  A new feature for media organizations, journalists and bloggers  —  To reinforce and encourage Mastodon as the go-to place for journalism, we're launching a new feature today.  You will notice that underneath some links shared on Mastodon … ",
    "url": "https://blog.joinmastodon.org/2024/07/highlighting-journalism-on-mastodon/"
  },
  {
    "text": "Robert F Kennedy Jr brushes off sexual assault allegation: ‘I am who I am’  —  Independent candidate says ‘I am not a church boy’ after ex-nanny tells Vanity Fair he assaulted her at his home in 1998  —  Robert F Kennedy Jr has responded to an allegation that he sexually assaulted an employee by stating … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/02/robert-f-kennedy-jr-sexual-assault-allegation-response"
  },
  {
    "text": "Trump immunity decision shows that conservative ‘originalism’ is a farce  —  In Trump v. United States, the Supreme Court's far-right majority showed Americans once again that “textualism” and “originalism” are a ruse.  —  Writing for a 6-3 majority, Chief Justice Roberts announced … ",
    "url": "https://thehill.com/opinion/judiciary/4751056-trump-immunity-decision-shows-that-conservative-originalism-is-a-farce/"
  },
  {
    "text": "She won a Pulitzer for exposing how the country's poorest state spent federal welfare money.  Now she might go to jail.  —  “The rabbit's got the gun now,” said a lawyer for former Mississippi Gov. Phil Bryant, who is trying to force reporter Anna Wolfe to reveal her sources.",
    "url": "https://www.nbcnews.com/investigations/anna-wolfe-pulitzer-mississippi-welfare-scandal-phil-bryant-rcna159936"
  },
  {
    "text": "Trump campaign blocks pair of anti-abortion activists from RNC platform committee  —  The shakeup, which has not been previously reported, comes as anti-abortion groups petition Trump, his campaign advisers and members of the RNC not to make significant changes to the party's platform on abortion.",
    "url": "https://www.politico.com/news/2024/07/02/anti-abortion-delegates-committee-gop-platform-debate-00166323"
  }
]