[
  {
    "text": "Epic double debacle stings House GOP  —  It's 10 minutes of humiliation that will live in House lore. … - Speaker Mike Johnson lost by one vote — a Republican vote! — the first impeachment of a Cabinet official in 148 years. … - GOP lawmakers openly criticized leaders for bringing … ",
    "url": "https://www.axios.com/2024/02/07/house-republicans-mike-johnson-impeachment-israel"
  },
  {
    "text": "Chuck Schumer to push stripped-down Israel and Ukraine aid package after GOP blocks Senate border bill  —  The vote comes after Republican senators made clear there isn't enough support for a bipartisan border security bill that included foreign aid to Ukraine, Israel and Taiwan.",
    "url": "https://www.nbcnews.com/politics/congress/chuck-schumer-push-stripped-israel-ukraine-aid-package-gop-blocks-sena-rcna137661"
  },
  {
    "text": "Chip Roy knocks Trump over border claim: 'That didn't happen'  —  Rep. Chip Roy (R-Texas) took a dig at former President Trump in a House floor speech on Tuesday, denying the former president's claim that any executive could unilaterally close the southern border.",
    "url": "https://thehill.com/homenews/house/4452898-chip-roy-donald-trump-border/"
  },
  {
    "text": "Al Green, in Hospital Garb, Delivers Vote to Kill Mayorkas Impeachment  —  The Democrat from Texas had undergone abdominal surgery but rushed to the Capitol because he said the vote was “personal.”  —  With the final minutes for the vote dwindling, the House watched intently on Tuesday night … ",
    "url": "https://www.nytimes.com/2024/02/06/us/politics/al-green-mayorkas-impeachment.html"
  },
  {
    "text": "‘None of these candidates’ beats out Haley in Nevada primary that Trump skipped  —  Donald Trump skipped the contest, which does not count for delegates to the nominating convention.  On the Democratic side, President Biden won easily.  —  Former U.N. ambassador Nikki Haley suffered … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/06/nevada-biden-haley-primary/"
  },
  {
    "text": "Behind the border mess: Open GOP rebellion against McConnell  —  The Republican leader told POLITICO that his critics “had their shot” already.  But conservatives are not done whacking him over the immigration-for-Ukraine aid implosion.  —  Conservative hardliners once celebrated Mitch McConnell … ",
    "url": "https://www.politico.com/news/2024/02/07/mcconnell-gop-rebellion-border-deal-00139972"
  },
  {
    "text": "Playbook: Two leaders in trouble  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  OUCH — “Worse than you can imagine: Haley loses to ‘none of these candidates’ in Nevada,” by Chris Cadelago: “[NIKKI] HALEY's second-place drubbing to the disembodied alternative … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/07/two-leaders-in-trouble-00140077"
  },
  {
    "text": "Democrats have a once-in-a-lifetime chance to win the border fight — will they take it?  —  2024 is looking to be the year America's most durable political alliances come unglued.  —  The Trump era is driving a deep rethink of what makes a Democrat and what makes a Republican.",
    "url": "https://thehill.com/opinion/immigration/4453139-democrats-have-a-once-in-a-lifetime-chance-to-win-the-border-fight-will-they-take-it/"
  },
  {
    "text": "Putin interview with Tucker Carlson shows Kremlin outreach to Trump's GOP  —  MOSCOW — As Russian state television propagandists salivated over Tucker Carlson's interview with President Vladimir Putin, the first of Carlson's falsehoods about his visit to Moscow was punctured, fittingly enough … ",
    "url": "https://www.washingtonpost.com/world/2024/02/07/tucker-carlson-putin-russia-ukraine/"
  },
  {
    "text": "Kremlin: We Reject All Western Media but Tucker Carlson Is Different  —  He's just not like those other Western journalists in one very important way, the Russian president's spokesman said.  —  The Kremlin confirmed Wednesday that an interview between Tucker Carlson and Vladimir Putin … ",
    "url": "https://www.thedailybeast.com/kremlin-we-reject-all-western-media-but-tucker-carlson-is-different"
  },
  {
    "text": "The Memo: Former Trump White House lawyer predicts crushing defeat at Supreme Court  —  A former attorney for the Trump White House predicts that the Supreme Court will rule unanimously against the 45th president on his claims to be immune from criminal prosecution.",
    "url": "https://thehill.com/regulation/court-battles/4451952-trump-immunity-ty-cobb-predicts-crushing-defeat-supreme-court/"
  },
  {
    "text": "Kellyanne Conway Sure Looks Like She's Auditioning to Be Trump's Veep  —  The ex-White House adviser mused about avoiding “diversity hires” in the 2024 GOP veepstakes, but it sure looks like she's pitching a “pick me” case to her former boss. … Former Trump senior presidential adviser … ",
    "url": "https://www.thedailybeast.com/kellyanne-conway-is-auditioning-to-be-trumps-veep"
  },
  {
    "text": "Inside Donald Trump's Incredible Cash Crunch  —  Two New York laws are about to smack Trump in the face, no matter if he plans to appeal two massive civil judgments that could wipe out all the cash in his pocket. … Donald Trump is just days away from getting slammed with a court judgment … ",
    "url": "https://www.thedailybeast.com/inside-donald-trumps-incredible-cash-crunch"
  },
  {
    "text": "After Libs of TikTok posted, at least 21 bomb threats followed  —  The FBI and local law enforcement said bomb threats across the country have tied up government resources even when they turn out to be hoaxes.  —  Last March, police in Coralville, Iowa, investigated a bomb threat targeting a junior high school.",
    "url": "https://www.nbcnews.com/tech/internet/libs-tiktok-x-chaya-raichik-bomb-threat-twitter-of-libsoftiktok-rcna102784"
  },
  {
    "text": "Pluralistic: The CHIPS Act treats the symptoms, but not the causes (07 Feb 2024)  — The CHIPS Act treats the symptoms, but not the causes: Monopoly destroyed America's high-tech capacity.  — Hey look at this: Delights to delectate.  — This day in history: 2004, 2009, 2014, 2019, 2023",
    "url": "https://pluralistic.net/2024/02/07/farewell-mr-chips/"
  },
  {
    "text": "Alleged aspiring militia “sniper” with plans to attack agents at border arrested  —  A Tennessee militia member who told an undercover federal agent that the U.S. is “being invaded” by migrants was planning to travel to the southern border with a stockpile of weapons and commit acts of violence … ",
    "url": "https://www.cbsnews.com/news/militia-sniper-paul-faye-southern-border-attack-federal-agents/"
  },
  {
    "text": "Joe Biden just did the rarest thing in US politics: he stood up to the oil industry  —  The Biden administration suspended new permits for natural gas terminals.  Can we see more of this kind of backbone?  —  Ten days ago Joe Biden did something remarkable, and almost without precedent - he actually said no to big oil.",
    "url": "https://www.theguardian.com/commentisfree/2024/feb/07/joe-biden-big-oil-lng-permits"
  },
  {
    "text": "Jeanine Pirro Stuns Fox News Co-Hosts by Calling Black Colleague an ‘Oreo’  —  During a Fox News segment on how New York Mayor Eric Adams applauded his “chocolate” administration, things got a bit awkward.  —  Fox News host Jeanine Pirro called her Black colleague an “Oreo” … ",
    "url": "https://www.thedailybeast.com/jeanine-pirro-calls-black-colleague-an-oreo-during-fox-segment"
  },
  {
    "text": "Inside the deadly new GOP plan to rapidly privatize Medicare  —  Want to invest in a scam that lets you make billions with virtually no risk?  If you're morbidly rich, all you have to do is to open or buy an insurance company that's offering Medicare Advantage plans.",
    "url": "https://www.rawstory.com/raw-investigates/medicare-advantage-2667187728/"
  },
  {
    "text": "For First Time in Two Decades, U.S. Buys More From Mexico Than China  —  The United States bought more goods from Mexico than China in 2023 for the first time in 20 years, evidence of how much global trade patterns have shifted.  —  In the depths of the pandemic, as global supply chains buckled … ",
    "url": "https://www.nytimes.com/2024/02/07/business/economy/united-states-china-mexico-trade.html"
  },
  {
    "text": "Shocking Fox News Moment Sees Guardian Angels Give Man ‘Pain Compliance’ On Live TV  —  “His mother back in Venezuela felt the vibrations,” the group's founder Curtis Sliwa boasted to Sean Hannity, adding the man is now “sucking concrete.”  —  LOADING  —  Fox News host Sean Hannity's interview … ",
    "url": "https://www.huffpost.com/entry/sean-hannity-guardian-angels-fox-news_n_65c364a0e4b0dbc806aec1af"
  },
  {
    "text": "Israel-Hamas war: Blinken briefs Israeli leaders on cease-fire and hostage talks  —  Gaza situation desperate after four months of war  —  Israeli Prime Minister Benjamin Netanyahu has rejected Hamas demands for a cease-fire and vowed to press ahead with Israel's military offensive in Gaza until achieving “absolute victory.”",
    "url": "https://apnews.com/article/israel-hamas-war-news-02-07-2024-6ceffca2970243cd039e90268c32c617"
  },
  {
    "text": "Senior Biden officials set to meet with Arab American, Muslim community in Michigan  —  Senior Biden administration officials are expected to meet with members of the Arab American and Muslim community in Michigan on Thursday, four sources familiar with planning told CNN.",
    "url": "https://www.cnn.com/2024/02/07/politics/biden-team-arab-american-muslim-michigan-meeting/"
  },
  {
    "text": "Ronna McDaniel, R.N.C. Chairwoman, Plans to Step Down  —  Donald Trump is likely to back a supporter of his false claims of election fraud, Michael Whatley, the head of the North Carolina G.O.P., to replace her.  —  The chairwoman of the Republican National Committee, Ronna McDaniel … ",
    "url": "https://www.nytimes.com/2024/02/06/us/politics/ronna-mcdaniel-rnc-trump.html"
  }
]