[
  {
    "text": "Former Trump official Stephanie Grisham to speak at the Democratic convention  —  Grisham resigned from the Trump administration immediately after the Jan. 6 attack on the U.S. Capitol.  —  CHICAGO — Trump White House press secretary Stephanie Grisham will speak at the Democratic National Convention … ",
    "url": "https://www.nbcnews.com/politics/2024-election/former-trump-official-stephanie-grisham-speak-democratic-convention-rcna167296?taid=66c460b137120500013ac828"
  },
  {
    "text": "Harris, Needling Trump, Holds a Rally at His Convention Site  —  In her latest move that seems meant to get under Donald Trump's skin, Kamala Harris will hold an event at the same Milwaukee arena where he accepted the Republican nomination.  —  Vice President Kamala Harris will hold a rally … ",
    "url": "https://www.nytimes.com/2024/08/20/us/politics/harris-trump-rally-milwaukee-fiserv.html"
  },
  {
    "text": "Hillary Clinton gets her Trump revenge moment  —  Hillary Clinton is finally getting (one form of) revenge on Donald Trump.  The former secretary of state used her primetime speech at the Democratic National Convention to rip into her former presidential rival as a selfish criminal who Democrats now have … ",
    "url": "https://www.politico.com/live-updates/2024/08/19/dnc-live-updates-coverage/hillary-clinton-gets-revenge-00174880"
  },
  {
    "text": "In 2016, Obama Passed a Baton.  Tonight, He'll Aim to Resurrect a Movement.  —  In his speech at the Democratic National Convention, the former president will have the tricky task of helping to reassemble the kind of coalition that powered his own rise.  —  “Fair to say, this is not your … ",
    "url": "https://www.nytimes.com/2024/08/20/us/politics/obama-dnc-harris.html"
  },
  {
    "text": "5 takeaways from the Democratic convention, Biden's speech on Day 1  —  Biden's swan song, Ocasio-Cortez's coming-out party and a heavy Trump focus.  —  CHICAGO — Welcome to The Campaign Moment, your guide to the biggest developments in the 2024 election, where the Democratic National Convention so far is largely about Donald Trump.",
    "url": "https://www.washingtonpost.com/politics/2024/08/20/dnc-day-1-takeaways-biden-speech/"
  },
  {
    "text": "Kamala Harris Understands The Real Challenge  —  This is what a party looks like when it's purpose-built to hold the anti-Trump coalition together.  —  ∙ Paid  —  Early in Donald Trump's presidency—perhaps as early as one day after his inauguration, when millions … ",
    "url": "https://www.offmessage.net/p/kamala-harris-understands-the-challenge"
  },
  {
    "text": "Why This DNC Is Different: A New Generation Is Steering, Finally  —  Even as Democrats on Monday gave President Joe Biden the warmest appreciation of his five-decade career and celebrated his decision to forego re-nomination, the sepia-hued nostalgia betrayed the not-so-subtle gnashing of the party's rank-and-file.",
    "url": "https://time.com/7012501/dnc-aoc-speech-biden-age/"
  },
  {
    "text": "Proud and Impassioned, Joe Biden Passes the Torch at the D.N.C.  —  In a valedictory speech in Chicago, the President mapped his legacy and asked to be remembered as a man who pulled the country from the maw of tragedy.  —  For years, Joe Biden has told fellow-politicians, with rueful wisdom … ",
    "url": "https://www.newyorker.com/culture/the-lede/proud-and-impassioned-biden-passes-the-torch"
  },
  {
    "text": "Democrats blame ‘raucous applause’ for massive delays to convention programming  —  It's something in the way they cheered.  Or at least that's how Democratic convention officials spun it.  Democrats pushed President Joe Biden out of primetime on Monday — just a few weeks after driving him out of the race altogether.",
    "url": "https://www.politico.com/live-updates/2024/08/19/dnc-live-updates-coverage/biden-scheduling-delays-00174912"
  },
  {
    "text": "Elon Musk's Twitter Takeover Is Now the Worst Buyout for Banks Since the Financial Crisis  —  Loans of around $13 billion have remained ‘hung’ for nearly two years, bringing in interest payments but weighing on banks' balance sheets  —  The $13 billion that Elon Musk borrowed to buy Twitter … ",
    "url": "https://www.wsj.com/tech/elon-musks-twitter-takeover-is-now-the-worst-buyout-for-banks-since-the-financial-crisis-3f4272cb?st=rhkmf50w84i9epx&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Project 25 co-author says the quiet part on tape  —  Russ Vought is confident that Trump will come through once again for anti-choice Republicans.  —  🚨 This special five-edition week of PN is made possible by paid subscribers 🚨 If you aren't one already, please sign up to support our independent journalism.",
    "url": "https://www.publicnotice.co/p/russ-vought-abortion-project-2025-secret-audio"
  },
  {
    "text": "Roanoke College Poll: Harris holds slim lead over Trump in Virginia  —  Lead within margin of error; Cao trails Kaine in race for Senate seat  —  Vice President Kamala Harris holds a slim three-point lead over former President Donald Trump (47%-44%) in a head-to-head matchup in Virginia and a similar lead … ",
    "url": "https://www.roanoke.edu/news/rcpoll/august2024"
  },
  {
    "text": "Beware the Pundit-Brained Version of the Democratic Convention  —  It's one of those moments that is tattooed on your brain forever—if your brain is the kind that is fully occupied by an encyclopedic memory of inane political moments that normal people forget: Donald Trump steps out onto … ",
    "url": "https://newrepublic.com/article/184990/pundit-brained-media-democratic-convention"
  },
  {
    "text": "A friendly media grows grumbly in Chicago  —  The Scoop  —  Kamala Harris has ridden a wave of positive press coverage to the United Center in Chicago, but to judge by the grumbling here in Chicago, the honeymoon may be ending soon.  —  The Democratic National Convention … ",
    "url": "https://www.semafor.com/article/08/19/2024/a-friendly-media-grows-grumbly-in-chicago"
  },
  {
    "text": "A Major U.S. Defense Investor Has Links To Sanctioned Russian Oligarchs  —  Two children of alleged Kremlin allies work on the investment team at 8VC, the firm led by Palantir cofounder Joe Lonsdale.  —  Venture capital firm 8VC, which has invested in U.S. defense contractors like Palantir and Anduril … ",
    "url": "https://www.forbes.com/sites/davidjeans/2024/08/20/8vc-russian-oligarchs/"
  },
  {
    "text": "The Old Man Who Saved American Democracy.  Twice.  —  1. Joe  —  I hope you drank it in last night.  It was one of the most human moments I've ever seen in politics, from the second the president stepped on stage and embraced his daughter.  —  But it was more than that.",
    "url": "https://www.thebulwark.com/p/the-old-man-who-saved-american-democracy"
  },
  {
    "text": "Biden's Valediction: Twenty Pounds ... As Always  —  Give Joe Biden this much credit — he stayed up past his bedtime.  And mine, and pretty much everyone's east of the Colorado River.  For some reason, the organizers of the Democrats'  national convention let the schedule slide more than an hour … ",
    "url": "https://hotair.com/ed-morrissey/2024/08/20/bidens-valediction-twenty-pounds-as-always-n3793393"
  },
  {
    "text": "Fact-checking Day 1 of the 2024 Democratic National Convention  —  Speakers said that Trump called for injecting bleach, wrote love letters to dictators and advocated that women be punished for abortion, among other claims.  —  The first night of the 2024 Democratic National Convention featured … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/20/fact-check-democratic-national-convention-day-1/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0MTI2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1NTA4Nzk5LCJpYXQiOjE3MjQxMjY0MDAsImp0aSI6ImQyZDU1MjBkLWNiMDEtNDNlNS1iODA0LTZlZTg4ODYxMzA1NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzIwL2ZhY3QtY2hlY2stZGVtb2NyYXRpYy1uYXRpb25hbC1jb252ZW50aW9uLWRheS0xLyJ9.C2W6Nq6SgrISxT1sqUWHYBFpF_7cXvH5CiDKYxIK9fs&itid=gfta"
  },
  {
    "text": "DNC makes Teamsters president sweat … - The Teamsters boss became the first-ever union president to speak at an RNC last month, delivering fiery remarks before a party that has a track record of opposing labor movements.  — Rank-and-file Teamsters retirees have been invited to attend the DNC … ",
    "url": "https://www.axios.com/2024/08/20/dnc-teamsters-sean-obrien-democrats"
  }
]