[
  {
    "text": "The 2024 door is closing faster than Haley thinks.  Here's what the delegate math shows.  —  Nikki Haley isn't wrong when she says it's early in the GOP primary — less than 3 percent of delegates have been awarded so far.  —  But the rest of the states are coming fast … ",
    "url": "https://www.politico.com/news/2024/01/27/republican-delegates-haley-trump-00138191"
  },
  {
    "text": "Democrats' not-so-secret weapon in House races: Donald Trump  —  Democrats trying to claim competitive House seats in New York are hoping to tie GOP opponents to the former president.  —  ALBANY, N.Y. — A noun, a verb and Donald Trump.  —  Democrats are banking on the former president again … ",
    "url": "https://www.politico.com/news/2024/01/27/trump-election-house-races-00138162"
  },
  {
    "text": "Trump's ‘achilles heel’?  Haley's refusal to drop out infuriates ex-president  —  A surprisingly disciplined campaign risks derailment as Trump lashes out at his former UN ambassador for staying in race  —  It was a moment for Donald Trump to be gracious, magnanimous, perhaps even presidential.",
    "url": "https://www.theguardian.com/us-news/2024/jan/27/donald-trump-nikki-haley-republican-nomination"
  },
  {
    "text": "On Trump-Biden rematch, many senators say bring it on  —  Republicans and Democrats see the general election as historic moment pitting clearly different visions and records  —  Congressional bureau chief  —  Unlike some American voters, senators have come to grips with the reality … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/27/biden-trump-rematch-senators/"
  },
  {
    "text": "George Conway calls Trump an ‘evil man’ with ‘no conscience’ after defamation verdict  —  Conservative attorney George Conway railed against former President Trump, calling him an “evil man,” after a jury ruled Trump must pay columnist E. Jean Carroll for defaming her by repeatedly denying her sexual assault allegations.",
    "url": "https://thehill.com/regulation/court-battles/4433185-george-conway-trump-evil-man-after-defamation-verdict/"
  },
  {
    "text": "Details of Trump's $83.3 Million Payment to E. Jean Carroll  —  Donald J. Trump — the rare defendant who can afford a judgment of this size — could secure a bond to cover it while his appeals play out.  —  Donald J. Trump might one day have to pay E. Jean Carroll the $83.3 million she was awarded, but that day is not today.",
    "url": "https://www.nytimes.com/2024/01/26/nyregion/trump-carroll-pay-83-million.html"
  },
  {
    "text": "Rudy Giuliani targets Donald Trump for ‘unpaid legal fees’ in new bankruptcy filing  —  Mr Giuliani filed for bankruptcy last month after he was ordered to pay $148m to Georgia election workers he defamed  —  Rudy Giuliani announces lawsuit against Joe Biden",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/rudy-giuliani-defamation-trump-legal-fees-b2485911.html"
  },
  {
    "text": "Nikki Haley targeted in ‘swatting’ incident at her South Carolina home  —  Authorities responded to a fake emergency at the South Carolina home of Republican presidential candidate Nikki Haley last month after a man claimed to have shot a woman and threatened to harm himself at her home, according to town records obtained by Reuters.",
    "url": "https://www.reuters.com/world/us/republican-presidential-candidate-nikki-haley-targeted-swatting-incident-2024-01-27/"
  },
  {
    "text": "Statement on allegations about UNRWA staff and 7 October attacks  —  The FCDO has issued a statement in response to allegations that UN Relief and Works Agency staff were involved in the 7 October attack against Israel  —  An FCDO spokesperson said: … Media enquiries  —  Email newsdesk@fcdo.gov.uk",
    "url": "https://www.gov.uk/government/news/statement-on-allegations-about-unrwa-staff-and-7-october-attacks"
  },
  {
    "text": "Biden says he'll shut down the border if deal gives him authority  —  The White House statement comes after a week of frantic negotiations in the Senate.  —  President Joe Biden on Friday urged Congress to pass a bipartisan bill to address the immigration crisis at the nation's southern border … ",
    "url": "https://www.politico.com/news/2024/01/26/biden-urges-bipartisan-border-deal-00138206"
  },
  {
    "text": "Trump's sanctions are still hurting everyday Venezuelans — and fueling migration  —  Five years ago Sunday, Donald Trump announced a major escalation of U.S. sanctions against Venezuela.  On top of sweeping financial restrictions imposed in 2017, the new measures targeted the very heart of the Venezuelan economy, oil.",
    "url": "https://thehill.com/opinion/4433251-trumps-sanctions-are-still-hurting-everyday-venezuelans-and-fueling-migration/"
  },
  {
    "text": "Journalism may never again make money.  So it should focus on mission.  —  America is struggling with several crises, most notably a radical, antidemocratic leader and movement controlling one of its major political parties.  America's journalism industry is also in crisis … ",
    "url": "https://www.washingtonpost.com/opinions/2024/01/27/new-journalism-mission-save-america-make-money/"
  },
  {
    "text": "We Need Your Email Address  —  Join the newsletter to get the latest updates.  —  Success  —  Great!  Check your inbox and click the link.  —  Error  —  Please enter a valid email address.  —  You might have noticed that over the last few days, we've begun requiring readers to sign … ",
    "url": "https://www.404media.co/why-404-media-needs-your-email-address/"
  },
  {
    "text": "On The Record with Will Lewis  —  ON THE RECORD  —  Semafor Business' signature interview series, On The Record, brings you conversations with the people running, shaping, and changing our economy.  Read Liz Hoffman's earlier conversations with Mattel CEO Ynon Kreiz on Hollywood's golden age of IP … ",
    "url": "https://www.semafor.com/article/01/26/2024/semafor-interview-with-washington-post-ceo-will-lewis"
  },
  {
    "text": "Donald Trump is preparing for a massive new trade war with China  —  The former president has talked to advisers about imposing a 60 percent tariff sure to enrage Beijing  —  Former president Donald Trump is weighing options for a major new economic attack on China if reelected … ",
    "url": "https://www.washingtonpost.com/business/2024/01/27/trump-china-trade-war/"
  },
  {
    "text": "Cheney accuses Stefanik of deleting 2021 statement condemning Jan. 6 protesters  —  As of Saturday morning, Stefanik's House website showed no press releases prior to 2023.  —  Former GOP House chair Liz Cheney on Saturday accused her successor Elise Stefanik of deleting a press release … ",
    "url": "https://www.politico.com/news/2024/01/27/stefanik-deletes-jan-6-statement-after-cheney-callout-00138214"
  }
]