[
  {
    "text": "‘Missing’ GOP Congresswoman Not Seen For Six Months Finally Found Living at Dementia Care Home  —  A Republican Congresswoman who has been “missing” for the past six months has finally been found.  —  Rep. Kay Granger has served as the representative for Texas's 12th Congressional District since 1997.",
    "url": "https://wcbm.com/national-headline/missing-gop-congresswoman-not-seen-for-six-months-finally-found-living-at-dementia-care-home/"
  },
  {
    "text": "EXCLUSIVE: Where is Congresswoman Kay Granger?  —  Amid the ongoing drama in D.C. with Congress furiously debating and voting on an interim spending bill a key question has arisen from constituents in Texas Congressional District 12, “Where is Congresswoman Kay Granger?”",
    "url": "https://dallasexpress.com/tarrant/exclusive-where-is-congresswoman-kay-granger/"
  },
  {
    "text": "How Trump and Musk set off the shutdown crisis — but got little in return  —  The past week provides a preview of what spending battles could be like in a closely divided Congress and with warring GOP factions  —  Some time after Donald Trump won the Nov. 5 election, he told House Speaker Mike Johnson … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/21/trump-musk-shutdown-demands-defeat/"
  },
  {
    "text": "New ethics inquiry details more trips by Clarence Thomas paid for by wealthy benefactors  —  Investigation by Senate Democrats found that Thomas accepted gifts and travel worth more than $4.75m since 1991  —  A nearly two-year investigation by Democratic senators of supreme court ethics details … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/21/ethics-inquiry-supreme-court"
  },
  {
    "text": "Trump Appoints ‘The Apprentice’ Producer as Special Envoy to Britain  —  Mark Burnett and President-elect Donald J. Trump had a long and successful collaboration that made Mr. Trump a household name.  —  President-elect Donald J. Trump has tapped Mark Burnett, the producer who helped turn … ",
    "url": "https://www.nytimes.com/2024/12/21/us/politics/mark-burnett-special-envoy.html"
  },
  {
    "text": "‘The Apprentice’ creator tapped as Trump's United Kingdom envoy  —  President-elect Trump announced that Mark Burnett will serve as the special envoy to the United Kingdom in his next administration in a Saturday post on Truth Social.  —  “With a distinguished career in television production and business … ",
    "url": "https://thehill.com/blogs/in-the-know/5052405-mark-burnett-trump-adminsitration-the-apprentice/"
  },
  {
    "text": "Statement from President Joe Biden on the Bipartisan Government Funding Bill  —  The bipartisan funding bill I just signed keeps the government open and delivers the urgently needed disaster relief that I requested for recovering communities as well as the funds needed to rebuild the Francis Scott Key Bridge.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/21/statement-from-president-joe-biden-on-the-bipartisan-government-funding-bill-2/"
  },
  {
    "text": "Private messages detail an alleged campaign to tarnish Blake Lively after she accused Justin Baldoni of misconduct on the set of “It Ends With Us.”  —  Last summer, as the release of “It Ends With Us” approached, Justin Baldoni, the director and a star of the film, and Jamey Heath … ",
    "url": "https://www.nytimes.com/2024/12/21/business/media/blake-lively-justin-baldoni-it-ends-with-us.html?unlocked_article_code=1.jE4.yE_4._RPuitPEWM2c&smid=nytcore-ios-share&referringSource=articleShare&tgrp=ctr"
  },
  {
    "text": "Trump: Panama will lose control of Canal if it continues to ‘rip-off’ US  —  President-elect Trump took issue with fees charged to use the Panama Canal, a vital shipping route, on Saturday night, claiming that he will demand oversight of the waterway be given back to the U.S. when he returns to office if it's not changed.",
    "url": "https://thehill.com/policy/international/5052505-trump-panama-canal-fees/"
  },
  {
    "text": "NYPD's top cop Jeffrey Maddrey abruptly resigns after allegedly demanding underling perform sexual favors — including ‘kiss his penis’ — in exchange for overtime  —  The NYPD's highest-ranking uniformed officer abruptly resigned late Friday night after The Post uncovered explosive allegations … ",
    "url": "https://nypost.com/2024/12/21/us-news/nypds-top-cop-jeffrey-maddrey-abruptly-resigns-after-allegedly-demanding-underling-perform-sexual-favors-in-exchange-for-overtime/"
  },
  {
    "text": "U.S. Super Hornet Shot Down Over Red Sea in Friendly Fire Incident; Aviators Safe  —  This post has been updated with additional information on the timing of the incident.  —  Two U.S. Navy aviators are safe after their two-seat F/A-18F Super Hornet was shot down by an American ship by mistake … ",
    "url": "https://news.usni.org/2024/12/21/u-s-super-hornet-shot-down-over-red-sea-in-friendly-fire-incident-aviators-safe"
  },
  {
    "text": "Lara Trump removes herself from Florida Senate sweepstakes  —  Lara Trump, who recently stepped down from her post as co-chair of the Republican National Committee, announced her decision Saturday evening in a social media post.  —  TALLAHASSEE, Florida — Lara Trump says she is taking … ",
    "url": "https://www.politico.com/news/2024/12/21/lara-trump-florida-senate-sweepstakes-00195819"
  },
  {
    "text": "Girl unresponsive 3 months after crash caused by suspect in Trump assassination attempt  —  WPTV spoke to Norka Pardo about her daughter's condition  —  ST. LUCIE COUNTY, Fla. — For the first time, we're hearing from the mother of the 6-year-old girl who was seriously hurt in a Martin County car crash in September.",
    "url": "https://www.wptv.com/news/treasure-coast/region-st-lucie-county/girl-unresponsive-3-months-after-crash-caused-by-suspect-in-trump-assassination-attempt"
  },
  {
    "text": "Senile Biden's insult to families of Marines murdered in disastrous Afghan withdrawal  —  Joe Biden kept the grieving relatives of the Marines killed in Afghanistan waiting for three hours while he napped on Air Force One on the tarmac before a dignified transfer, multiple military families have told Daily Mail.",
    "url": "https://www.dailymail.co.uk/news/article-14210847/biden-insult-senile-health-coverup-marine-families-afghanistan.html"
  },
  {
    "text": "The Woody Johnson Republicans  —  This week's budget fiasco carries bad omens for governing in 2025.  —  Mike Johnson is still Speaker of the House, but this week Republicans have behaved as if the Speaker is another Johnson—as in Woody of the New York Jets.",
    "url": "https://www.wsj.com/opinion/mike-johnson-republicans-budget-congress-elon-musk-donald-trump-woody-johnson-2dc5a626"
  },
  {
    "text": "These 20 GOP senators voted against the Social Security bill  —  Twenty GOP senators voted against legislation approved by the Senate late Friday that would bolster Social Security benefits for over 2 million American citizens working in a range of occupations.",
    "url": "https://thehill.com/homenews/senate/5052213-social-security-benefits-bill-repeal/"
  },
  {
    "text": "A Win for the Vibecession Story  —  Guess what?  Popular economic narratives aren't reliable  —  Still experimenting with this newsletter.  My original plan was to write most weekdays and take weekends off.  But there's so much to write about!  So I will sometimes put up relatively brief … ",
    "url": "https://paulkrugman.substack.com/p/a-win-for-the-vibecession-story"
  }
]