[
  {
    "text": "Mark Meadows Is a Warning About a Second Trump Term  —  On Monday, Mark Meadows, a former White House chief of staff, testified in an effort to move the Georgia racketeering case against his former boss Donald Trump and co-defendants to federal court.  On the stand, he said that he believed … ",
    "url": "https://www.nytimes.com/2023/08/31/opinion/mark-meadows-georgia-trump.html"
  },
  {
    "text": "The Key Players in Trump's Plot to Upend the Election, Mapped  —  Ms. Cottle is a member of the editorial board.  Mr. Eisen is a senior fellow at the Brookings Institution.  Ms. Maggiacomo is a graphics editor in Opinion.  —  Upending the outcome of a free and fair presidential election is no minor endeavor.",
    "url": "https://www.nytimes.com/interactive/2023/08/31/opinion/politics/trump-indictment-election-key-players.html"
  },
  {
    "text": "Trump Inflated Property Values by Up to $2.2 Billion, New York A.G. Says  —  Letitia James, the attorney general, asked a judge to find, without a trial, that the former president had fraudulently overvalued his assets.  —  Before Donald J. Trump was indicted four times over … ",
    "url": "https://www.nytimes.com/2023/08/30/nyregion/trump-james-civil-lawsuit-trial.html"
  },
  {
    "text": "Rudy Giuliani Literally Can't Afford to Be Defaming People  —  Rudy Giuliani can't even afford to lie about random people anymore.  —  A federal judge in Georgia ordered Giuliani on Wednesday to forfeit a defamation suit filed by two poll workers, whom he falsely claimed had tampered with ballots after the 2020 election.",
    "url": "https://nymag.com/intelligencer/2023/08/rudy-giuliani-forfeits-ruby-freeman-defamation-in-georgia.html"
  },
  {
    "text": "McConnell quickly convenes with allies after second public freeze  —  Some senators were already seeking more information about McConnell's status Wednesday afternoon, according to one person familiar with the dynamics.  —  Mitch McConnell's latest health scare guarantees Republican senators … ",
    "url": "https://www.politico.com/news/2023/08/30/mcconnell-second-public-freeze-00113542"
  },
  {
    "text": "45 New Victims Allegedly ID'd in Leaked Chats From Andrew Tate's ‘War Room’  —  Paying members allegedly discussed chilling techniques to abuse and groom women into sex work.  —  Members of influencer Andrew Tate's “War Room” group discussed techniques for how to groom women … ",
    "url": "https://www.thedailybeast.com/45-new-victims-allegedly-idd-in-leaked-chats-from-andrew-tates-war-room"
  },
  {
    "text": "Former North Shore Pizzeria Owner Sentenced to Two Years in Prison for COVID Fraud  —  For Immediate Release  —  U.S. Attorney's Office, District of Massachusetts  —  Defendant purchased alpaca farm using fraudulently obtained pandemic relief funds  —  BOSTON - A former North Shore resident … ",
    "url": "https://www.justice.gov/usao-ma/pr/former-north-shore-pizzeria-owner-sentenced-two-years-prison-covid-fraud"
  },
  {
    "text": "Clarence Thomas officially discloses private trips on GOP donor Harlan Crow's plane  —  Justice Clarence Thomas disclosed Thursday that Republican megadonor Harlan Crow paid for private jet trips for Thomas in 2022 to attend a speech in Texas and a vacation at Crow's luxurious New York estate … ",
    "url": "https://www.cnn.com/2023/08/31/politics/thomas-alito-supreme-court-disclosures/"
  },
  {
    "text": "Feinstein is a silent character in her sad and messy final chapter  —  Feinstein's daughter battles her stepsisters over the senator's share of a fortune that exceeds an estimated $1 billion.  Daughter's role scrutinized by trustees in new legal motion.  —  SAN FRANCISCO — A beach house in an exclusive neighborhood.",
    "url": "https://www.politico.com/news/2023/08/31/dianne-feinstein-trust-dispute-00112420"
  },
  {
    "text": "Top North Carolina judge faces potential sanctions for talking about racial discrimination  —  North Carolina Supreme Court Justice Anita Earls is being threatened with sanctions for criticizing the court's approach to racial and gender discrimination.  Earls, the only Black woman on the court … ",
    "url": "https://popular.info/p/top-north-carolina-judge-faces-potential"
  },
  {
    "text": "RNC Members Acknowledge Their Fundraising Is ‘in the Toilet’  —  The Republican National Committee is having some serious money problems. … Pay Dirt is a weekly foray into the pigpen of political funding.  Subscribe here to get it in your inbox every Thursday.",
    "url": "https://www.thedailybeast.com/rnc-members-acknowledge-their-fundraising-is-in-the-toilet"
  },
  {
    "text": "Vivek Ramaswamy, Political Performance Artist  —  He has no government experience, but plenty of conspiratorial demagoguery to sell.  —  A particularly low point of last week's GOP presidential debate came at around the 39-minute mark, when an unusually glib, shallow, overbearing … ",
    "url": "https://www.wsj.com/articles/ramaswamy-the-gop-flimflam-man-vivek-debate-trump-conspiracy-election-candidate-voters-b54ebf13?mod=followamazon"
  },
  {
    "text": "A Texas judge has declared unconstitutional a law championed by Gov. Greg Abbott that limits the power of Democrat-led cities  — A Texas judge declared a law that prevented cities from passing some local ordinances unconstitutional.  — The law, championed by Republican Gov. Greg Abbott … ",
    "url": "https://www.businessinsider.com/texas-judge-death-star-bill-greg-abbott-unconstitutional-2023-8?op=1"
  },
  {
    "text": "Liberals raise alarms, calling on Biden to sharpen reelection pitch  —  Left-leaning Democrats have backed the president, but some worry his second-term agenda lacks ambition  —  President Biden notched an array of early endorsements from progressive groups.  He has won the support of top liberals in Congress for his campaign.",
    "url": "https://www.washingtonpost.com/politics/2023/08/31/liberals-push-biden-ambitious-agenda/"
  },
  {
    "text": "Poll shows Matt Rosendale up big over NRSC-backed Tim Sheehy  —  The Scoop  —  National Republicans may have a problem on their hands in Montana.  While the NRSC is backing 37-year old veteran Tim Sheehy for Senate, Montana Rep. Matt Rosendale would start with a sizable lead if he entered the race … ",
    "url": "https://www.semafor.com/article/08/30/2023/poll-shows-matt-rosendale-up-big-over-nrsc-backed-tim-sheehy"
  },
  {
    "text": "HUD releases new aid for low-income families to keep up with rising rents  —  The Department of Housing and Urban Development said that fair market rents for fiscal year 2024 will rise about 12 % nationwide and that the department has increased funding for housing choice vouchers.",
    "url": "https://www.nbcnews.com/politics/white-house/hud-releases-new-aid-low-income-families-keep-rising-rents-rcna102521"
  },
  {
    "text": "Americans are getting wise to Joe Biden's corruption — despite his media gatekeepers  —  Almost half the country thinks Joe Biden is corrupt, according to a new YouGov poll.  —  While most Democrats are being ostriches, even 52% of independents don't believe the “Honest Joe” malarkey about the “poorest man in Congress” anymore.",
    "url": "https://nypost.com/2023/08/30/americans-are-getting-wise-to-joe-bidens-corruption-despite-his-media-gatekeepers/"
  },
  {
    "text": "Alabama attorney general says he has right to prosecute people who facilitate travel for out-of-state abortions  —  Alabama's Republican attorney general said in a court filing that he has the right to prosecute people who make travel arrangements for pregnant women to have out-of-state abortions.",
    "url": "https://www.cnn.com/2023/08/31/politics/alabama-attorney-general-abortion-prosecute/"
  },
  {
    "text": "Biden administration announces $450M in funding to beat overdose epidemic  —  The Biden administration announced more than $450 million in new funding to combat the overdose epidemic with the goal to reduce deaths, support recovery efforts and invest in information campaigns that target young people.",
    "url": "https://thehill.com/homenews/administration/4180715-biden-administration-announces-450m-in-funding-to-beat-overdose-epidemic/"
  }
]