[
  {
    "text": "Supreme Court Justice Alito's Beach House Displayed ‘Appeal to Heaven’ Flag … The “Appeal to Heaven” flag flew outside the Alitos' New Jersey vacation home last summer, along with a “2022” Phillies flag and a Long Beach Island flag.  —  Last summer, two years after an upside-down American flag … ",
    "url": "https://www.nytimes.com/2024/05/22/us/justice-alito-flag-appeal-to-heaven.html"
  },
  {
    "text": "“Everyone is absolutely terrified”: Inside a US ally's secret war on its American critics  —  I met Raqib Naik, a journalist who had fled his native India, at a coffee shop in suburban Maryland.  We sat at the same metal table where he once discussed the prospect of his assassination with FBI agents.",
    "url": "https://www.vox.com/world-politics/24160779/inside-indias-secret-campaign-to-threaten-and-harass-americans"
  },
  {
    "text": "Israel Rages as Ireland, Spain, and Norway Move to Recognize Palestinian State  —  ‘REWARD HAMAS’  —  The historic move will be punished with “severe consequences,” Israel's foreign minister said.  —  Ireland, Spain, and Norway on Wednesday said they will officially recognize a Palestinian state … ",
    "url": "https://www.thedailybeast.com/israel-rages-as-ireland-spain-and-norway-move-to-recognize-palestinian-state"
  },
  {
    "text": "Trump email falsely says Biden was ‘locked & loaded’ to ‘take me out’ in Mar-a-Lago search  —  A former president falsely accusing his successor and rival of posing a threat to his life is without precedent in modern U.S. history.  —  Donald Trump on Tuesday falsely claimed … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/21/trump-mar-a-lago-raid-fbi-deadly-force/"
  },
  {
    "text": "Biden administration canceling student loans for another 160,000 borrowers  —  The Biden administration is canceling student loans for another 160,000 borrowers through a combination of existing programs.  The Education Department announced the latest round of cancellation on Wednesday … ",
    "url": "https://apnews.com/article/biden-student-loan-cancellation-debt-forgiveness-60ffeaec17737d6317b4aee188893cc4"
  },
  {
    "text": "The Algebra Problem: How Middle School Math Became a National Flashpoint  —  Top students can benefit greatly by being offered the subject early.  But many districts offer few Black and Latino eighth graders a chance to study it.  —  From suburbs in the Northeast to major cities on the West Coast … ",
    "url": "https://www.nytimes.com/2024/05/22/nyregion/middle-school-math-algebra.html"
  },
  {
    "text": "Colorado GOP calls for all children to be pulled from public schools  —  The party's latest move to the hard right is a directive to parents to remove kids from the public education system.  —  COLORADO, USA — The Colorado Republican Party is issuing a call to its members to pull their children … ",
    "url": "https://www.9news.com/article/news/local/next/next-with-kyle-clark/colorado-gop-kids-pulled-from-public-schools/73-e121fe9e-9a2b-498d-8a80-1efe2a179758"
  },
  {
    "text": "Trump maintains leads in most critical swing states  —  Robert F. Kennedy Jr.'s standing has slipped since October, hurting him most notably in Wisconsin … President Joe Biden and former President Donald Trump continue to face tight contests in the potentially pivotal “Blue Wall” … ",
    "url": "https://pro.morningconsult.com/analysis/swing-state-polling-may-2024"
  },
  {
    "text": "Is Oreo About to Be the Next Bud Light?  —  Oreo could be the latest big brand to get the Bud Light treatment.  —  The cookie company's Chicago-headquartered parent organization, Mondelēz International, will be confronted at its annual shareholder meeting on Wednesday over how its LGBTQ marketing … ",
    "url": "https://townhall.com/tipsheet/miacathell/2024/05/22/oreo-shareholder-meeting-n2639163"
  },
  {
    "text": "Hunter Biden trial on tax charges delayed until September  —  Hunter Biden's trial on tax charges has been moved to September 5, after the judge presiding over the case made Biden's attorney promise he would not seek further delays.  —  In asking for a delay in the case, Abbe Lowell … ",
    "url": "https://www.cnn.com/2024/05/22/politics/hunter-biden-trial-on-tax-charges-delayed-until-september/"
  },
  {
    "text": "James Comer teams up with Katie Porter on bipartisan presidential ethics bill  —  House Oversight Committee Chairman James Comer (R-KY) and Rep. Katie Porter (D-CA) are pairing up in a rare moment of bipartisanship to introduce legislation that seeks to prevent presidential candidates from “profiting from their proximity to power.”",
    "url": "https://www.washingtonexaminer.com/news/house/3012937/comer-porter-oversight-bill-presidential-ethics/"
  },
  {
    "text": "Hacked data reveals which US gun sellers are behind Mexican cartel violence  —  USA TODAY exclusive: Massive data leak ties names of American shops and buyers to thousands of guns recovered at Mexican crime scenes.  —  A massive leak of Mexican military intelligence has exposed … ",
    "url": "https://www.usatoday.com/story/news/investigations/2024/05/22/mexican-cartels-supplied-trafficked-guns-from-us/73700258007/"
  },
  {
    "text": "Rishi Sunak will call general election for July in surprise move - sources  —  PM says he wants to hold summer poll after claiming inflation is back under control and economy is improving  —  Rishi Sunak will on Wednesday afternoon call a surprise early election for July … ",
    "url": "https://www.theguardian.com/politics/article/2024/may/22/rishi-sunak-will-call-general-election-for-july-in-surprise-move-sources"
  },
  {
    "text": "Majority of Americans wrongly believe US is in recession - and most blame Biden  —  Exclusive Harris poll for the Guardian shows 55% believe economy is shrinking, in troubling sign for president's re-election bid  —  Nearly three in five Americans wrongly believe the US is in an economic recession … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/22/poll-economy-recession-biden"
  },
  {
    "text": "Meet Trump's ‘Human Printer’  —  WHENEVER DONALD TRUMP BRANDISHES a stack of papers or reads a printout of a social media post, he's relying on the work of Natalie Harp.  —  Harp, 32, occupies a unique role in the history of presidential campaigns: aide who travels with a portable printer … ",
    "url": "https://www.thebulwark.com/p/meet-trumps-human-printer-natalie-harp"
  },
  {
    "text": "What's breaking up the Texas Republican party?  School vouchers  —  Out-of-state donors are funneling millions of dollars into state legislative races to defeat Republicans who opposed the governor's top education priority.  —  When nearly two dozen Republican state lawmakers defied Texas … ",
    "url": "https://www.politico.com/news/2024/05/22/texas-republican-primary-school-vouchers-choice-00159219"
  },
  {
    "text": "Schumer Plans Vote on Contraception Access, Teeing Up a Campaign Issue  —  Democrats are planning to spotlight Republicans' opposition to legislation protecting birth control access nationwide, as part of an election-year push.  —  Senator Chuck Schumer, Democrat of New York and the majority leader … ",
    "url": "https://www.nytimes.com/2024/05/22/us/politics/schumer-contraception-ivf-democrats.html"
  },
  {
    "text": "Ivanka Trump looks like the comeback kid - and we should all be afraid  —  The closer Ivanka Trump is to her father, the closer Donald Trump is to the White House.  And lately, the former first daughter seems to be testing the political waters  —  Forget polls or statistical modelling … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/may/22/ivanka-trump-looks-like-the-comeback-kid-we-should-all-be-afraid"
  },
  {
    "text": "‘Silicon Valley Princess’: Inside the Life of Nicole Shanahan, R.F.K. Jr.'s Running Mate  —  Ms. Shanahan, a lawyer who was married to Sergey Brin, a Google founder, led a rarefied and sometimes turbulent life in Silicon Valley, according to a Times examination.",
    "url": "https://www.nytimes.com/2024/05/22/technology/nicole-shanahan-rfk-jr-vp.html"
  },
  {
    "text": "Families of Uvalde school shooting victims announce $2M settlement, lawsuit against Texas DPS  —  Christopher Cann Tony PlohetskiUSA TODAY  —  Families of the victims of the massacre at Robb Elementary School in Uvalde, Texas, on Wednesday announced a $2 million settlement with the city … ",
    "url": "https://www.usatoday.com/story/news/nation/2024/05/22/uvalde-cisd-police-chief-resigns-school-shooting/73800080007/"
  },
  {
    "text": "An Expert's Guide to Surviving Extreme Plane Turbulence  —  HOLD ON TIGHT  —  News that a 73-year-old man died when wild turbulence hit a Singapore Airlines flight on Tuesday is the stuff of most fliers' nightmares.  —  News that a 73-year-old man died and seven others were critically injured … ",
    "url": "https://www.thedailybeast.com/an-experts-guide-to-surviving-extreme-plane-turbulence-on-flights"
  },
  {
    "text": "In fractured GOP majority, Jeffries amasses unusual amount of power as minority leader  —  When House Democratic Leader Hakeem Jeffries negotiated a pair of major government funding bills with Speaker Mike Johnson earlier this year, he also quietly secured a significant victory for his own party … ",
    "url": "https://www.cnn.com/2024/05/22/politics/house-democratic-leader-jeffries/"
  },
  {
    "text": "Republican National Committee headquarters under lockdown after being sent vials of blood  —  A hazardous materials team from the Capitol Police responded to the situation.  —  The Republican National Committee headquarters in Washington, D.C., was under lockdown Wednesday morning … ",
    "url": "https://www.nbcnews.com/politics/politics-news/republican-national-committee-headquarters-lockdown-sent-vials-blood-rcna153462"
  },
  {
    "text": "Voting machine firm Smartmatic alleges Newsmax has deleted evidence in lawsuit over false vote-rigging claims  —  Smartmatic is suing Fox News, Newsmax, Rudy Giuliani and others over false claims of vote-rigging and fraud in the 2020 election.  —  Smartmatic alleges that Newsmax … ",
    "url": "https://www.nbcnews.com/politics/elections/smartmatic-alleges-newsmax-deleted-evidence-lawsuit-vote-rig-claims-rcna153231"
  }
]