[
  {
    "text": "Trump to Begin Large-Scale Deportations Tuesday  —  Chicago will be early target and the government will send as many as 200 officers to carry out the operation, according to people familiar with the planning  —  The incoming Trump administration is planning a large-scale immigration raid … ",
    "url": "https://www.wsj.com/politics/policy/trump-to-begin-large-scale-deportations-tuesday-e1bd89bd?st=47HCM3&ref=paydayreport.com"
  },
  {
    "text": "The indoor inauguration's winners and losers  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BEHIND THE HPSCI CURTAIN — As we wrote in yesterday's Playbook, Speaker MIKE JOHNSON's move to fire Chair MIKE TURNER and remake the House Intelligence Committee … ",
    "url": "https://www.politico.com/newsletters/playbook/2025/01/18/the-indoor-inaugurations-winners-and-losers-00199152"
  },
  {
    "text": "Trump's Deportation Plan Is Said to Start Next Week in Chicago  —  The size of the planned immigration raids is unclear, but they would be the opening step in the president-elect's goal of overseeing the largest deportation program in history.  —  The incoming Trump administration intends to carry out … ",
    "url": "https://www.nytimes.com/2025/01/17/us/politics/trump-immigration-raids-chicago.html"
  },
  {
    "text": "Trump administration planning illegal immigrant arrests throughout US on ‘day one’  —  The incoming Trump administration is eyeing immigration arrests of illegal immigrants across the country as soon as day one, as top officials say they are ready to “take the handcuffs off” Immigration and Customs Enforcement (ICE).",
    "url": "https://www.foxnews.com/politics/trump-administration-planning-illegal-immigrant-arrests-across-us-day-one"
  },
  {
    "text": "Under Trump's Big Tent, Republicans Are Starting to Clash  —  Donald J. Trump won his battle with establishment Republicans.  Now, it's disputes over immigration, taxes and foreign policy that will test his party's unity.  —  Democrats have long been viewed as the big-tent party … ",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/donald-trump-inauguration-republican-party.html"
  },
  {
    "text": "Trump launches meme coin, apparently makes more than $25 billion overnight … - It also speaks to the nature of the crypto industry that someone could have $25 billion worth of something that literally did not exist 24 hours previously. … - His website bills it as “the only official Trump meme.”",
    "url": "https://www.axios.com/2025/01/18/trump-meme-coin-25-billion"
  },
  {
    "text": "Trump launches first official cryptocurrency  —  President-elect Trump launched his first official cryptocurrency, which shot up in value quickly to kick off his inauguration weekend.  —  “My NEW Official Trump Meme is HERE!  It's time to celebrate everything we stand for: WINNING!",
    "url": "https://thehill.com/business/5093360-donald-trump-cryptocurrency-launches/"
  },
  {
    "text": "Trump says he will ‘most likely’ give TikTok a 90-day extension to avoid a ban  —  Trump spoke to NBC News' Kristen Welker in an exclusive phone interview Saturday, discussing his plans on what to do about the popular social media app.  —  President-elect Donald Trump told NBC News' … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-likely-give-tiktok-90-day-extension-avoid-ban-rcna188258"
  },
  {
    "text": "Marc Andreessen Seems to Think Hillary Clinton Was Actually President  —  The New York Times made a sneaky edit to its own transcript to make Andreessen sound more coherent. … Marc Andreessen, the billionaire tech investor who co-founded Netscape, has recently been making the rounds … ",
    "url": "https://gizmodo.com/marc-andreessen-seems-to-think-hillary-clinton-was-actually-president-2000552062"
  },
  {
    "text": "Shove the Presidency Down Trump's Throat  —  The most recent entry in the “good advice for Democrats” canon comes from occasional TNR contributor and Bulwark writer Jonathan V. Last, who wrote, “The job of the Democratic party comes in two parts.  First: Do not help Republicans.  Not in any way.",
    "url": "https://newrepublic.com/post/190337/trump-second-term-democrats-respond"
  },
  {
    "text": "Canada Prepares for Trump Tariff Threat With Three-Stage Plan  —  Canadian officials are preparing retaliatory measures if the new U.S. administration imposes tariffs on Canadian imports.  —  Orange juice from Florida.  Whiskey from Tennessee.  Peanut butter from Kentucky.",
    "url": "https://www.nytimes.com/2025/01/17/world/canada/canada-trump-tariffs.html?unlocked_article_code=1.qE4.CZVk.mWWEtM54elN3&smid=bs-share"
  },
  {
    "text": "Curtis Yarvin Says Democracy Is Done.  Powerful Conservatives Are Listening.  —  Philip Montgomery for The New York Times  —  For a long time, Curtis Yarvin, a 51-year-old computer engineer, has written online about political theory in relative obscurity.",
    "url": "https://www.nytimes.com/2025/01/18/magazine/curtis-yarvin-interview.html?unlocked_article_code=1.qE4.g1_N.MPg0zn-z3kN-&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Support for Trump's Policies Exceeds Support for Trump  —  A new poll found the public is sympathetic to the president-elect's plans to deport migrants and reduce America's presence overseas.  —  Many Americans who otherwise dislike President-elect Donald J. Trump share his bleak assessment … ",
    "url": "https://www.nytimes.com/2025/01/18/us/politics/trump-policies-immigration-tariffs-economy.html?unlocked_article_code=1.qE4.Axo4.bt2hEdcb0Ofc&smid=url-share"
  },
  {
    "text": "The Real Story Behind Mike Turner's Firing  —  The speaker's decision to cashier his Intelligence chair wasn't about Donald Trump.  —  When Speaker Mike Johnson summarily fired House Intelligence Chair Mike Turner this week, everyone assumed it was about Donald Trump.",
    "url": "https://www.politico.com/news/magazine/2025/01/18/mike-johnson-mike-turner-firing-column-00199129"
  },
  {
    "text": "Israel to free up to 1,904 Palestinians in 1st stage of hostage deal, including killers  —  Figures comprises 737 jailed Palestinians, 1,167 Gazans detained in ground op; notorious terrorist Zakaria Zubeidi, others responsible for the murder of dozens, to be freed",
    "url": "https://www.timesofisrael.com/israel-to-free-1904-palestinians-in-1st-stage-of-hostage-deal-including-killers/"
  },
  {
    "text": "How moving Trump's inauguration inside spurred an all-out scramble  —  The sudden weather-induced change forced a scramble for hundreds of thousands of people who had spent months planning for the swearing-in of the nation's 47th president.  —  President-elect Donald Trump on Friday ordered … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/01/17/why-trump-inauguration-moved-indoors-capitol-rotunda-extreme-cold/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3MDkwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4NDcyMzk5LCJpYXQiOjE3MzcwOTAwMDAsImp0aSI6ImFjMjQ5MTk3LWYwN2ItNDNiNS1hOWJhLTc0ODA5NGQ2MmIxMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzAxLzE3L3doeS10cnVtcC1pbmF1Z3VyYXRpb24tbW92ZWQtaW5kb29ycy1jYXBpdG9sLXJvdHVuZGEtZXh0cmVtZS1jb2xkLyJ9.xPLtkG3VmpJZ9tnEnG631S1lWhNfLmYRpBLi1Psj8Nc&itid=gfta"
  },
  {
    "text": "Commerce Nominee Lutnick Is Backer of Outlaws' Favorite Cryptocurrency  —  Cantor Fitzgerald holds assets for Tether, the stablecoin used by drug traffickers, terrorists and scammers to move money around the world.  —  To the crypto company Tether, the account was identified only by a 31-character string … ",
    "url": "https://www.bloomberg.com/news/features/2025-01-18/trump-commerce-nominee-lutnick-is-backer-of-outlaws-favorite-cryptocurrency"
  },
  {
    "text": "President-elect Donald Trump to hold ‘victory rally’ in Washington, DC before inauguration  —  President-elect Donald Trump is set to hold a victory rally in Washington, D.C. on Sunday, one day before returning back to the White House for a second term.  —  Preparations were underway … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/01/18/trump-rally-washington-dc/77747982007/"
  },
  {
    "text": "Fox News' Jessica Tarlov Hits Sean Hannity With Blunt Reality Check On Biden  —  Tarlov spotted the “reason” why Donald Trump “wants to take credit” for numbers coming out of the Biden administration.  —  LOADING  —  Fox News' Jessica Tarlov on Friday took on network host Sean Hannity … ",
    "url": "https://www.huffpost.com/entry/fox-news-jessica-tarlov-sean-hannity-biden-trump_n_678b3f56e4b0aa5a1d95ddd5"
  },
  {
    "text": "Trump Just Handed Steve Bannon a Big Weapon in His War With Elon Musk … Republicans may not know it yet, but they're in the process of handing Steve Bannon a powerful weapon to wield in his war with Elon Musk over visas granted to high-skilled immigrants.  This could further divide … ",
    "url": "https://newrepublic.com/article/190405/trump-bannon-weapon-elon-musk"
  },
  {
    "text": "Treasury Increases Financial Pressure on the Houthis  —  WASHINGTON — Today, the Department of the Treasury's Office of Foreign Assets Control (OFAC) is sanctioning Yemen-based Yemen Kuwait Bank for Trade and Investment Y.S.C (Yemen Kuwait Bank) for its financial support to Ansarallah, commonly known as the Houthis.",
    "url": "https://home.treasury.gov/news/press-releases/jy2794"
  },
  {
    "text": "Can He Do That?  Here's What Biden's Move on the Equal Rights Amendment Means.  —  Presidents have no direct role in approving constitutional amendments.  So what could President Biden's pronouncement recognizing a new one actually do?  —  President Biden on Friday declared that he believes … ",
    "url": "https://www.nytimes.com/2025/01/17/us/politics/biden-equal-rights-amendment-explained.html"
  },
  {
    "text": "Former Trump aides are warning newbies: Buy legal insurance or risk a hefty bill  —  Many staffers who worked in Trump's first administration saw the need for an attorney when many were dragged before congressional committees and grand juries.  —  WASHINGTON — As Republicans gear up for new jobs … ",
    "url": "https://www.nbcnews.com/politics/white-house/former-trump-aides-are-warning-newbies-buy-legal-insurance-risk-hefty-rcna187505"
  }
]