[
  {
    "text": "Tux-Wearing Christian Nationalists Laugh About Their Influence, Live From Mar-a-Lago  —  The pastor with whom Speaker Mike Johnson prayed to ward off God's judgment made the case for Christian dominion at Trump's Florida domain  —  CHRISTIAN NATIONALISTS WERE out in force at Mar-a-Lago on Friday night … ",
    "url": "https://www.rollingstone.com/politics/politics-features/christian-nationalists-influence-mar-a-lago-1234889682/"
  },
  {
    "text": "House Speaker Mike Johnson Visits Trump at Mar-a-Lago  —  It was the speaker's first trip to see the former president since he won his post, and it came as he faced anger from right-wing lawmakers for moving to fund the government.  —  Speaker Mike Johnson on Monday night visited former … ",
    "url": "https://www.nytimes.com/2023/11/21/us/politics/johnson-trump-mar-a-lago.html"
  },
  {
    "text": "The Trump Threat Is Growing.  Lawyers Must Rise to Meet This Moment.  —  American democracy, the Constitution and the rule of law are the righteous causes of our times, and the nation's legal profession is obligated to support them.  But with the acquiescence of the larger conservative legal movement … ",
    "url": "https://www.nytimes.com/2023/11/21/opinion/trump-lawyers-constitution-democracy.html"
  },
  {
    "text": "Ignore Trump?  Democrats Now Want Him Plastered All Over the News.  —  The former president has been relatively quiet, out of the headlines and off mainstream social media.  Democrats are hoping that more attention on him can help turn around President Biden's fortunes.",
    "url": "https://www.nytimes.com/2023/11/21/us/politics/trump-democrats-biden.html"
  },
  {
    "text": "Texas attorney general opens probe into Media Matters over report on X ads  —  Texas Attorney General Ken Paxton (R) said Monday that his office is opening an investigation into Media Matters for America over its recent reports accusing X, the platform formerly known as Twitter … ",
    "url": "https://thehill.com/policy/technology/4320745-texas-attorney-general-ken-paxton-opens-probe-media-matters-x-ads/"
  },
  {
    "text": "New pro-Ron DeSantis super PAC ad tries to tie Nikki Haley to Hillary Clinton  —  The ad by the new super PAC Fair Right takes an old Haley quote out of context to suggest that the Democratic presidential candidate was her “role model.”  —  Fight Right, a newly formed super PAC backing Florida … ",
    "url": "https://www.nbcnews.com/politics/2024-election/new-ron-desantis-super-pac-ad-tries-tie-nikki-haley-hillary-clinton-rcna126195"
  },
  {
    "text": "Ron DeSantis' team was going after Nikki Haley.  They turned on each other instead.  —  Haley's rise has posed an existential threat to DeSantis' candidacy, and his team has struggled in how to counter it.  —  Leaders of Ron DeSantis' Never Back Down super PAC met privately last Tuesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-nikki-haley-fight-right-never-back-down-rcna126102"
  },
  {
    "text": "Israel-Hamas deal on hostage release and ceasefire is imminent, sources say  —  A deal between Israel and Hamas to free dozens of hostages and declare a multi-day ceasefire is imminent and could be announced by the Qatari mediators as soon as Tuesday, two sources with direct knowledge of the issue told Axios.",
    "url": "https://www.axios.com/2023/11/21/israel-hamas-hostage-ceasefire-deal-imminent"
  },
  {
    "text": "Billionaires are lining up to fund Donald Trump's anti-democratic agenda  —  The more disturbing Trump's public proclamations become, the more US plutocrats seem to want him to win  —  As an ever-greater portion of the nation's total wealth goes to the top, it's hardly surprising that ever … ",
    "url": "https://www.theguardian.com/commentisfree/2023/nov/21/donald-trump-anti-democratic-agenda-billionaires-neofascism"
  },
  {
    "text": "How a Maine Businessman Made the AR-15 Into America's Best-Selling Rifle  —  Neither a gun enthusiast nor a right-wing ideologue, Richard Dyke used political connections and lobster giveaways to build Bushmaster, the company that popularized assault-style rifles.  —  Under the Gun: How Gun Violence Is Impacting the Nation",
    "url": "https://www.propublica.org/article/how-bushmaster-made-ar-15-into-best-selling-rifle-us"
  },
  {
    "text": "Binance Founder Changpeng Zhao Agrees to Step Down, Plead Guilty  —  Zhao's crypto exchange will also admit wrongdoing and agree to pay $4.3 billion in fines  —  The chief executive of Binance, the largest global cryptocurrency exchange, plans to step down and plead guilty … ",
    "url": "https://www.wsj.com/finance/currencies/binance-ceo-changpeng-zhao-step-down-plead-guilty-01f72a40?mod=followamazon"
  },
  {
    "text": "Mike Johnson's America: Revisit landmark SCOTUS decisions and use government to ‘restrain evil’  —  Mike Johnson, the new speaker of the House, voiced support for revisiting Supreme Court decisions that struck down restrictions on the use of contraception, barred bans on gay sex … ",
    "url": "https://www.cnn.com/2023/11/21/politics/mike-johnson-kfile-invs"
  },
  {
    "text": "Wisconsin supreme court appears poised to strike down legislative maps and end Republican dominance  —  Decision from four liberal justices in lawsuit could eliminate some of the most gerrymandered districts in the United States  —  The fight for democracy is supported by",
    "url": "https://www.theguardian.com/us-news/2023/nov/21/wisconsin-supreme-court-redistricting-lawsuit"
  },
  {
    "text": "Federal appeals court strikes Maryland handgun rule  —  A federal appeals court struck down part of Maryland's laws regulating handguns Tuesday, overturning a requirement to obtain a handgun license before purchasing a firearm.  —  In a 2-1 ruling, a panel of the Virginia-based 4th Circuit Court … ",
    "url": "https://thehill.com/regulation/court-battles/4321243-federal-appeals-court-strikes-maryland-handgun-rule/"
  },
  {
    "text": "Rudy Giuliani Dragged Into Court Again Over a Measly $10K  —  “America's Mayor” stiffed the accountants who helped him through his most recent divorce, according to a lawsuit obtained by The Daily Beast.  —  Rudy Giuliani is drowning in debt, and yet another pissed-off associate has come knocking—for a paltry $10,000.",
    "url": "https://www.thedailybeast.com/rudy-giuliani-dragged-into-court-again-over-a-measly-dollar10k"
  },
  {
    "text": "Following Significant Uptick in Anti-Muslim and Antisemitic Rhetoric on Social Media, Governor Hochul Deploys New Resources to Combat Online Hate  —  Data Tracked by New York State Division of Homeland Security and Emergency Services Shows 425 Percent Increase in Online Hate Speech … ",
    "url": "https://www.governor.ny.gov/news/following-significant-uptick-anti-muslim-and-antisemitic-rhetoric-social-media-governor-hochul"
  },
  {
    "text": "House GOP's Biden impeachment effort heads into final stage  —  The conference plans to depose Hunter Biden in December and is working to tie up other threads before January — when advocates hope they can start moving toward a vote.  —  House Republicans are closing in on a make-or-break moment … ",
    "url": "https://www.politico.com/news/2023/11/21/house-republicans-biden-impeachment-00128154"
  },
  {
    "text": "Matt Gaetz at 21% approval rating in Florida, poll says  —  A new poll shows U.S. Rep. Matt Gaetz is a polarizing figure in Florida, both in and outside of the Republican Party.  —  A poll from the Florida Atlantic University Mainstreet PolCom Lab released last week showed that 57% … ",
    "url": "https://www.pnj.com/story/news/politics/2023/11/21/congressman-matt-gaetz-at-21-approval-following-house-speaker-drama/71653429007/"
  },
  {
    "text": "Appeal filed in Colorado 14th Amendment case  —  The six Republican and unaffiliated Colorado voters who challenged Donald Trump's eligibility to be on the ballot following his actions on January 6th last night filed an appeal with the Colorado Supreme Court challenging the judge's rulings … ",
    "url": "https://www.citizensforethics.org/news/press-releases/appeal-filed-in-colorado-14th-amendment-case/"
  },
  {
    "text": "Attorney for Alleged MI Fake Elector Wants Co-Defendants to ‘Shut Up’  —  Some defendants in a scheme to overturn Michigan's 2020 presidential election results claim they were acting on Trump's orders.  —  During a September fundraiser for his client, an attorney for a defendant … ",
    "url": "https://www.thedailybeast.com/kevin-kijewski-attorney-for-alleged-mi-fake-elector-clifford-frost-wants-co-defendants-to-shut-up"
  },
  {
    "text": "The ‘Anti-Defeat’ Candidate  —  Like many politicians, Representative Dean Phillips likes to look people in the eye.  And because he's a politician, Phillips can glean things, just as President George W. Bush did when he peered into Vladimir Putin's eyes and saw his soul.",
    "url": "https://www.theatlantic.com/politics/archive/2023/11/dean-phillips-2024-election-new-hampshire-primary/676058/"
  }
]