[
  {
    "text": "US to Israel: Don't do something you'll regret  —  In private calls and public moves, President Joe Biden and his aides are pointing to reasons to look for an off-ramp.  —  The Biden administration's main message for Israel following Iran's aerial assault comes down to this: Stop and think.",
    "url": "https://www.politico.com/news/2024/04/14/us-israel-responding-iran-00152150"
  },
  {
    "text": "Iran's Attack on Israel Has U.S. Politicians Scrambling … As the world waits to see what will come next between Israel and Iran, politicians in America are scrambling to determine their own next steps.  —  The roiling Israel policy debate has remained near the center of U.S. politics … ",
    "url": "https://www.notus.org/congress/israel-iran-strike-congress-biden-response"
  },
  {
    "text": "Israel Repelled Iran's Huge Attack.  But Only With Help From U.S. and Arab Partners.  —  Working with partners, it fended off worst of Iranian strikes; what comes next will test powers in the Middle East and beyond  —  Saturday's Iranian strike on Israel was huge by any standard.",
    "url": "https://www.wsj.com/world/middle-east/analysis-israel-repelled-irans-huge-attack-but-only-with-help-from-u-s-and-arab-partners-a7844065"
  },
  {
    "text": "How to pick a jury that can judge Donald Trump  —  Tailoring questions to probe prospective jurors' political biases and opinions of the former president is more art than science.  —  Former President Donald Trump's criminal trial in New York begins Monday with an immediate and fundamental challenge … ",
    "url": "https://www.politico.com/news/2024/04/14/jury-selection-donald-trump-00151962"
  },
  {
    "text": "How a hush money scandal turned into a criminal case: The whirlwind history of People v. Trump  —  It was nicknamed the “zombie” case.  Now it's finally going to trial.  —  On Monday, nearly eight years after Donald Trump allegedly orchestrated a scheme to pay a porn star to keep quiet … ",
    "url": "https://www.politico.com/news/2024/04/15/trump-hush-money-case-history-00152172"
  },
  {
    "text": "Trump attorney calls hush money case a ‘6-week-long media extravaganza’  —  An attorney for former President Trump brushed off the significance of his first criminal trial, which is scheduled to begin Monday, saying the case is merely a “six-week-long media extravaganza.”",
    "url": "https://thehill.com/regulation/court-battles/4593635-trump-attorney-call-hush-money-case-a-six-week-long-media-extravaganza/"
  },
  {
    "text": "Tax Day reveals a major split in how Joe Biden and Donald Trump would govern  —  Tax Day reveals a major split in how Joe Biden and Donald Trump would govern: The presidential candidates have conflicting ideas about how much to reveal about their own finances and the best ways to boost the economy through tax policy.",
    "url": "https://apnews.com/article/trump-biden-income-taxes-irs-returns-filings-55d3031de64251169eb247f52430618d"
  },
  {
    "text": "Mark Cuban says he's proud to pay $288 million in taxes this year, unlike a certain former president  — Mark Cuban says he'll be paying $288 million in taxes to the IRS.  — “I pay what I owe,” Cuban wrote on X.  — The billionaire says he's “proud to pay my taxes every single year,” unlike one ex-president.",
    "url": "https://www.businessinsider.com/mark-cuban-proud-to-pay-taxes-unlike-certain-ex-president-2024-4"
  },
  {
    "text": "Far Right's Ties to Russia Sow Rising Alarm in Germany  —  As cases proliferate, opponents fear the Alternative for Germany party is becoming a tool of Russian influence operations to undermine support for Ukraine.  —  To enter a secret session of Germany's Parliament, lawmakers must lock their phones and leave them outside.",
    "url": "https://www.nytimes.com/2024/04/15/world/europe/germany-afd-russia.html"
  },
  {
    "text": "Senate spotlight: A Trump Republican's China problem  —  November's election will not only determine which party controls the White House but also the United States Senate.  Currently, the Democratic caucus holds a narrow 51-49 advantage.  Control of the chamber will come down to a handful of competitive races.",
    "url": "https://popular.info/p/senate-spotlight-a-trump-republicans"
  },
  {
    "text": "Democrats descend on Chicago as specter of '68 convention looms  —  Protests over Israel-Gaza war expected as party nominates President Joe Biden.  —  Democrats from across the country are converging in Chicago this week to lay the groundwork for their upcoming convention … ",
    "url": "https://www.politico.com/news/2024/04/15/democrats-chicago-convention-unrest-00152164"
  },
  {
    "text": "Pentagon Reviews Events Before Attack That Killed 13 U.S. Troops in Kabul  —  A team conducted new interviews to address lingering questions about the bombing in the final days of U.S. military involvement in Afghanistan.  —  A new Pentagon review of the events leading up to the bombing … ",
    "url": "https://www.nytimes.com/2024/04/15/us/politics/us-troops-kabul-airport-bombing.html"
  },
  {
    "text": "Scoop: Teamsters make another move toward GOP … - In the past, the PAC has given overwhelmingly to Democrats, but Hawley has made a point to align himself with the labor movement, joining picket lines with the Teamsters and the United Auto Workers.  — In total, Hawley's … ",
    "url": "https://www.axios.com/2024/04/14/teamsters-donation-josh-hawley-senate-republicans"
  },
  {
    "text": "‘The damage is done’: Ruben Gallego says repealing Arizona's near-total abortion ban now would be too little, too late  —  Gallego argued a repeal through the state is just the first step in rectifying what he sees as injustice.  —  PHOENIX — Democratic Rep. Ruben Gallego argued this week … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ruben-gallego-says-repealing-arizonas-total-abortion-ban-now-little-la-rcna147734"
  }
]