[
  {
    "text": "'We've all enabled the situation': Dems turn on Biden's inner sanctum post debate  —  The senior team's management of Biden has grown more strictly controlled as his term has gone on.  —  Over the course of his presidency, Joe Biden's small clutch of advisers have built … ",
    "url": "https://www.politico.com/news/2024/07/02/biden-campaign-debate-inner-circle-00166160"
  },
  {
    "text": "CNN Poll: Most voters think Democrats have a better chance of keeping White House if Biden isn't the nominee  —  Three-quarters of US voters say the Democratic Party would have a better shot at holding the presidency in 2024 with someone other than President Joe Biden at the top of the ticket … ",
    "url": "https://www.cnn.com/2024/07/02/politics/cnn-poll-post-debate/"
  },
  {
    "text": "Manchin threatened to break with Biden before senior Democrats intervened  —  “Nobody wants to be the first one to knife Julius Caesar,” one Democratic Party official said.  —  As panic and confusion over President Biden's faltering debate performance swept the ranks of Democratic lawmakers late last week … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/02/joe-manchin-biden-debate-democrats-drop-out/"
  },
  {
    "text": "Democratic senator criticizes Biden campaign's ‘dismissive attitude’ after debate  —  A Democratic senator chastised President Biden's re-election campaign for their aggressive attempt to quell intensified age concerns in the wake of a disastrous debate performance which sent tremors through the Democratic Party.",
    "url": "https://www.semafor.com/article/07/01/2024/democratic-senator-criticizes-biden-campaigns-dismissive-attitude-after-debate"
  },
  {
    "text": "Democrats begin attacking Biden's performance and campaign  —  Rep. Lloyd Doggett (D-Texas) said the president needs to step aside and usher in a “new generation of leaders.”  —  Top Democrats have begun forcefully and aggressively criticizing President Joe Biden's debate performance … ",
    "url": "https://www.politico.com/news/2024/07/02/democrats-biden-debate-fallout-00166208"
  },
  {
    "text": "A new national poll turns post-debate conventional wisdom on its head  —  As always, though, we should be cautious about reading too much into one poll.  —  It has been less than a week since President Biden walked out onto the stage of the first presidential debate in Atlanta and upended his political legacy.",
    "url": "https://www.washingtonpost.com/politics/2024/07/02/biden-replacement-debate-harris-cnn-poll/"
  },
  {
    "text": "How much did debate hurt Biden's re-election bid?  New poll offers insight.  —  Trump's new, narrow advantage signals a close contest, not a decisive lead.  But other exclusive poll findings raise red flags for the president.  —  Susan Page Rachel BarberUSA TODAY",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/02/biden-trump-poll-post-debate/74263315007/"
  },
  {
    "text": "Judge Delays Trump's Sentencing Until Sept. 18 After Immunity Claim  —  Donald J. Trump's lawyers want to argue that a Supreme Court decision giving presidents immunity for official acts should void his felony conviction for covering up hush money paid to a porn star.",
    "url": "https://www.nytimes.com/2024/07/02/nyregion/trump-sentencing-hush-money-trial.html"
  },
  {
    "text": "The Supreme Court's disastrous Trump immunity decision, explained  —  The Court's six Republicans handed down a decision on Monday that gives Donald Trump such sweeping immunity from prosecution that there are unlikely to be any legal checks on his behavior if he returns to the White House.",
    "url": "https://www.vox.com/scotus/358292/supreme-court-trump-immunity-dictatorship"
  },
  {
    "text": "The Trump-SCOTUS Doom Loop  —  Orbánism is already here.  —  ∙ Paid  —  1. Clarity  —  I have a theory about the Supreme Court's reasoning:  —  Had the subject of presidential immunity come to the High Court concerning any normal president—Ford, Carter, Reagan, Bush … ",
    "url": "https://www.thebulwark.com/p/the-trump-scotus-doom-loop"
  },
  {
    "text": "A Better Way To Respond To The Supreme Court's Intolerable Immunity Decision  —  Sauce for the goose is sauce for the gander.  —  ∙ Paid  —  If you're about my age or older, and a subscriber to this newsletter, you're familiar with this uncanny sensation of living through a moment when history turns.",
    "url": "https://www.offmessage.net/p/biden-response-supreme-court-immunity"
  },
  {
    "text": "RFK Jr.'s Family Doesn't Want Him to Run.  Even They May Not Know His Darkest Secrets.  —  A shocking photograph.  Blowback from a Trump meeting.  Alleged sexual assault.  The Kennedys have voiced support for Joe Biden, but certain aspects of Robert F. Kennedy Jr.'s character are only just now coming to light.",
    "url": "https://www.vanityfair.com/news/story/robert-kennedy-jr-shocking-history"
  },
  {
    "text": "Justice Roberts buried for smug ‘sit down, little ladies’ smear of liberal colleagues  —  Lost in the shuffle of the outrage over the conservative majority Supreme Court's 6-3 decision to hand Donald Trump a get-out-of-jail-free card with their expansive presidential immunity ruling on Monday … ",
    "url": "https://www.alternet.org/news-politics/supreme-court-chief-justice-john-roberts/"
  },
  {
    "text": "Giuliani is disbarred in New York as court finds he repeatedly lied about Trump's 2020 election loss  —  Rudolph Giuliani, the former New York City mayor, federal prosecutor and legal adviser to Donald Trump, was disbarred in New York on Tuesday after a court found he repeatedly made false statements about Trump's 2020 election loss.",
    "url": "https://apnews.com/article/giuliani-new-york-disbarred-81b327f9ab1f98548cb888f8e652c9a8"
  },
  {
    "text": "‘Elites will not save you’: Rallying cry issued for mass action against ‘Dictator Trump’  —  America faces an immediate future of military occupations, political executions and concentration camps unless millions of its citizens unite against “dictator” Donald Trump, a furious and frightened political analyst wrote Tuesday.",
    "url": "https://www.rawstory.com/trump-dictator-2668670361/"
  },
  {
    "text": "President Joe Biden to sit down with ABC News on Friday for first TV interview since debate  —  The president has faced calls to drop out of the race following the debate.  —  President Joe Biden delivers remarks during the CNN Presidential Debate, June 27, 2024, in Atlanta.",
    "url": "https://abcnews.go.com/Politics/president-joe-biden-sit-abc-news-friday-interview/story?id=111618360"
  },
  {
    "text": "Hunter Biden has joined White House meetings as he stays close to the president post-debate  —  While he is regularly at the White House residence and events, it is unusual for the president's son to be in and around meetings that his father is having with his team.",
    "url": "https://www.nbcnews.com/politics/white-house/hunter-biden-white-house-meetings-president-debate-rcna159975"
  },
  {
    "text": "Leonard Peltier Denied Parole After Nearly 50 Years In Prison  —  President Joe Biden is likely the last hope for the ailing, 79-year-old Native American rights activist to ever go home.  —  LOADING  —  Leonard Peltier was denied parole on Tuesday, meaning there's likely only one other way the ailing … ",
    "url": "https://www.huffpost.com/entry/leonard-peltier-parole-denied-biden_n_668419f4e4b038babc7d147f"
  },
  {
    "text": "Behind the Curtain: The imperial presidency in waiting … - A re-elected Trump would quickly set up vast camps and deport millions of people in the U.S. illegally. … - In Washington, Trump would move to fire potentially tens of thousands of civil servants using a controversial interpretation of law and procedure.",
    "url": "https://www.axios.com/2024/07/02/trump-2025-imperial-us-presidency"
  }
]