[
  {
    "text": "Senior House Republican says GOP members ready to block Jordan  —  A number of House Republicans are in talks to block Rep. Jim Jordan's path to the speakership as the Ohio Republican tries to force a floor vote on Tuesday, according to multiple GOP sources.",
    "url": "https://www.cnn.com/2023/10/15/politics/jim-jordan-house-republicans-speaker/"
  },
  {
    "text": "Jordan Activates Right-Wing Pressure Campaign in Push to Win Speakership  —  Allies of the Ohio Republican, who must persuade scores of his colleagues to support his bid for speaker, are threatening right-wing retribution to any G.O.P. lawmakers who dare oppose him.",
    "url": "https://www.nytimes.com/2023/10/14/us/house-speaker-republicans-jordan.html"
  },
  {
    "text": "Turner: If GOP can't elect Speaker then ‘deal will have to be done’ with Democrats  —  Rep. Mike Turner (R-Ohio) said Sunday if House Republicans cannot elect a Speaker soon then a “deal will have to be done” with Democrats in order to get the chamber running again, as it nears two weeks since … ",
    "url": "https://thehill.com/homenews/house/4257216-turner-if-gop-cant-elect-speaker-then-deal-will-have-to-be-done-with-democrats/"
  },
  {
    "text": "Rep. Crenshaw Knocks Jim Jordan Speaker Supporters' ‘High-Pressure Campaign’: ‘Dumbest Thing You Can Do’  —  The Texas Republican is supporting the nominee but warned his fellow GOP members against ‘whipping up Twitter’ against each other … Rep. Dan Crenshaw, R-Texas, is supporting Rep. Jim Jordan … ",
    "url": "https://themessenger.com/politics/rep-crenshaw-knocks-jim-jordan-speaker-supporters-high-pressure-campaign-dumbest-thing-you-can-do"
  },
  {
    "text": "Jim Jordan's pressure campaign the ‘dumbest thing you can do,’ one House Republican says  —  Nobody likes a bully, Rep. Dan Crenshaw said.  —  Rep. Dan Crenshaw (R-Texas) has some advice for Rep. Jim Jordan as he and his allies attempt to pressure his way to the speakership:  —  Chill.",
    "url": "https://www.politico.com/news/2023/10/15/jim-jordan-bullying-dan-crenshaw-00121609"
  },
  {
    "text": "Biden Warns Israel Not to Occupy Gaza  —  While the president has stood strongly behind Israel since Hamas attacked, he said on “60 Minutes” that a new occupation of Gaza would “be a big mistake.”  —  President Biden warned Israel in an interview aired on Sunday not to reoccupy Gaza … ",
    "url": "https://www.nytimes.com/2023/10/15/us/politics/biden-israel-gaza.html"
  },
  {
    "text": "Israel-Gaza war live updates  —  Gaza residents flee south as Israel prepares for ‘next stages of war’  —  Hundreds of thousands of people in northern Gaza are fleeing in buses, cars and on foot, crowding onto narrow roads leading south after Israel's evacuation warning.",
    "url": "https://www.washingtonpost.com/world/2023/10/15/israel-gaza-war-updates-hamas-palestine/"
  },
  {
    "text": "Man targeted 6-year-old boy, woman in deadly Plainfield stabbing because they are Muslim: detectives  —  71-year-old Joseph M. Czuba charged with hate crime: Will County Sheriff's Office  —  PLAINFIELD, Ill. (WLS) — A man stabbed a child to death and critically injured a woman … ",
    "url": "https://abc7chicago.com/plainfield-murder-joseph-m-czuba-stabbing-16200-s-lincoln-hwy-il/13918623/"
  },
  {
    "text": "Opposition wins Polish election, according to exit poll  —  WARSAW — Poland's opposition parties look like they've won a solid victory in the country's general election — and if the result holds it signals a radical change both in Poland and in the EU, where the current Law and Justice … ",
    "url": "https://www.politico.eu/article/opposition-wins-polish-election-according-to-exit-poll-poland-kaczynski-duda-tusk-election-rule-of-law/"
  },
  {
    "text": "Boebert spent campaign cash at Beetlejuice boyfriend's bar  —  The Colorado congresswoman dropped a few hundred bucks at Hooch, a place that hosts drag shows.  —  Well before Rep. Lauren Boebert and her date got thrown out of a local theater showing of Beetlejuice for being disruptive and frisky … ",
    "url": "https://www.politico.com/news/2023/10/15/boebert-campaign-cash-beetlejuice-bar-00121606"
  },
  {
    "text": "Driving 100 miles in labor; giving birth in the ER: Fears rise as 3 maternity units prepare to close in Alabama  —  The state has one of the country's highest maternal mortality rates.  Now, three hospitals plan to stop delivering babies, putting some pregnant women at even higher risk.",
    "url": "https://www.nbcnews.com/health/womens-health/3-hospitals-closing-maternity-labor-delivery-units-alabama-rcna111374"
  },
  {
    "text": "GOPer cut off by CNN host for anti-immigrant rant when asked about Gaza refugees  —  During an appearance on CNN on Sunday morning, host Victor Blackwell was forced to shut down a House Republican who took advantage of a question about what to do with Palestinian refugees to attack President Joe Biden over immigration in the U.S.",
    "url": "https://www.rawstory.com/gaza-palestinian-refugees/"
  },
  {
    "text": "Security Alert #10  —  Home الصفحة الرئيسية / News & Events / Security Alert #10  —  Event:  The U.S. government is assisting U.S. nationals and their immediate family members with a valid travel document … ",
    "url": "https://il.usembassy.gov/security-alert-10/"
  },
  {
    "text": "House Republicans' Chaos Is Making Biden's Split-Screen Strategy a Lot Easier  —  Biden wants to run on his ability to govern.  House Republicans' inability to do just that plays into the Democrat's 2024 strategy … Joe Biden's reelection strategy relies on painting Republicans as chaotic, disorganized, and unserious.",
    "url": "https://themessenger.com/politics/biden-house-republican-chaos-contrast-strategy"
  }
]