[
  {
    "text": "The Deportation Wars Begin  —  Trump has a mandate, but protests in California show the trouble that might lie ahead.  —  Rounding up and deporting millions of illegal migrants was never going to go down without protest.  But President Trump is determined to do it, and no one can say he didn't tell voters during the campaign.",
    "url": "https://www.wsj.com/opinion/the-deportation-wars-begin-d3cb4f8d?st=KxYCxt&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Jumps at the Chance for a Standoff in California Over Immigration  —  The situation has all the elements that the president seeks: a showdown with a top political rival in a deep blue state over an issue core to his agenda.  —  It is the fight President Trump had been waiting for … ",
    "url": "https://www.nytimes.com/2025/06/08/us/politics/trump-california-immigration.html"
  },
  {
    "text": "The Legal Issues Surrounding Trump's Plan to Use Troops to Suppress Protests  —  President Trump has long mused about using troops to crush violent protests or riots in blue-state cities.  He is now moving to do so in Los Angeles.  —  Setting up a rare use of military force on domestic soil … ",
    "url": "https://www.nytimes.com/2025/06/08/us/trump-los-angeles-national-guard-explainer.html?unlocked_article_code=1.NU8.8xIk.aTAKs3T6TctI&smid=url-share"
  },
  {
    "text": "Trump says he's meeting with military leaders at Camp David  —  President Trump told reporters on Sunday that he's heading to Camp David to meet with military leaders, among others, shortly before he posted a message online calling Los Angeles protesters an “insurrectionist mob.”",
    "url": "https://thehill.com/homenews/5339483-trump-camp-david-military-los-angeles/"
  },
  {
    "text": "'Tom, arrest me.  Let's go.': Gov. Gavin Newsom responds to Trump border czar's threat  —  In an exclusive interview with NBC News' Jacob Soboroff, California Governor Gavin Newsom said that President Trump “has created the conditions” surrounding the Los Angeles protests.",
    "url": "https://www.msnbc.com/msnbc/watch/gov-newsom-tells-president-trump-to-stand-down-amid-l-a-protests-241152581707"
  },
  {
    "text": "LA anti-ICE riots are latest instance of Democrats ‘on the wrong side’: Joe Concha  —  The Washington Examiner's Joe Concha was critical of Democratic leadership in Los Angeles and California and their response to riots being held to oppose U.S. Immigration and Customs Enforcement raids in the city.",
    "url": "https://www.washingtonexaminer.com/news/crime/3434911/la-anti-ice-riots-democrats-wrong-side-joe-concha/"
  },
  {
    "text": "Newsom Slams Trump as ‘Stone-Cold Liar’ Over Phone Call  —  California Gov. Gavin Newsom slammed Donald Trump as a “stone-cold liar” in an MSNBC interview on Sunday, insisting the president's angry public posturing doesn't match the tone he struck during a Friday phone call.Trump has been attacking … ",
    "url": "https://www.thedailybeast.com/gavin-newsom-slams-donald-trump-as-stone-cold-liar-over-phone-call/"
  },
  {
    "text": "Live updates: Protest spills onto 101 Freeway in downtown LA … What to Know  — Crowds gathered in downtown Los Angeles and Boyle Heights Sunday for a third straight day of protests over recent immigration raids.  — A march that began Sunday in Boyle Heights arrived … ",
    "url": "https://www.nbclosangeles.com/news/local/los-angeles-immigration-protests/3718195/"
  },
  {
    "text": "Trump Is Using the National Guard as Bait  —  Don't give him the pretext he wants.  —  President donald trump is about to launch yet another assault on democracy, the Constitution, and American traditions of civil-military relations, this time in Los Angeles.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/trump-provoke-not-pacify-los-angeles/683080/?gift=otEsSHbRYKNfFYMngVFweH25hY2p_rsKIBWUs1l7ZV4&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "2 New York Representatives Are Denied Access to ICE Facility  —  Representatives Adriano Espaillat and Nydia Velázquez were turned away when seeking to inspect a migrant detention area inside a Manhattan federal building.  —  Federal officials prevented two members of Congress on Sunday … ",
    "url": "https://www.nytimes.com/2025/06/08/nyregion/ice-detention-federal-plaza-nyc.html?unlocked_article_code=1.Nk8.ZKNX.TulXnK8V1kuv&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The stealth Senate dealmaker who could deliver Trump's tax cuts  —  Finance Chair Mike Crapo is facing the highest-stakes political test of his nearly three-decade Senate career.  —  Some of the most critical components of President Donald Trump's agenda are in the hands of a soft-spoken senator … ",
    "url": "https://www.politico.com/news/2025/06/09/the-stealth-senate-dealmaker-who-could-deliver-trumps-tax-cuts-00393250"
  },
  {
    "text": "How Trump broke the politics of Medicaid  —  Until this cycle, the word “Medicaid” was barely used in campaign ads.  —  Republicans used to cheer the possibility of Medicaid cuts.  Now, as the GOP advances President Donald Trump's “Big Beautiful Bill” that would reduce Medicaid spending … ",
    "url": "https://www.politico.com/news/2025/06/09/medicaid-realignment-politics-gop-megabill-00393331"
  },
  {
    "text": "The Bluesky bubble hurts liberals and their causes  —  The social media network was doomed to fail as users tried to re-create Twitter.  —  Ever since Elon Musk bought Twitter, changed the social media site's name to X and altered its moderation policies, progressives have been hunting for a substitute.",
    "url": "https://www.washingtonpost.com/opinions/2025/06/08/blue-sky-twitter-liberals/"
  },
  {
    "text": "ABC News suspends journalist after calling Trump and adviser ‘world-class’ haters  —  Terry Moran to be evaluated after now deleted post said Stephen Miller is ‘richly endowed with capacity for hatred’  —  ABC News has suspended its senior national correspondent after he described top White … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/08/abc-news-suspends-journalist-stephen-miller-trump"
  },
  {
    "text": "Trump promised Britain a trade deal.  So where is it?  —  LONDON — In a much-hyped split-screen Oval Office phone call a month ago, U.S. President Donald Trump promised Britain's Prime Minister Keir Starmer that the two had struck an “historic” trade deal.",
    "url": "https://www.politico.eu/article/donald-trump-white-house-britain-uk-deal-tariffs/"
  },
  {
    "text": "Israeli forces prevent aid boat carrying Greta Thunberg and other activists from reaching Gaza  —  Israeli forces stopped a Gaza-bound aid boat carrying Greta Thunberg and other activists early Monday and diverted it to Israel, enforcing a longstanding blockade of the Palestinian territory … ",
    "url": "https://apnews.com/article/mideast-wars-gaza-flotilla-greta-thunberg-b64e897fb37ee374e4494381304ff9be"
  }
]