[
  {
    "text": "Exclusive: John Kelly goes on the record to confirm several disturbing stories about Trump  —  John Kelly, the longest-serving White House chief of staff for Donald Trump, offered his harshest criticism yet of the former president in an exclusive statement to CNN.",
    "url": "https://www.cnn.com/2023/10/02/politics/john-kelly-donald-trump-us-service-members-veterans/"
  },
  {
    "text": "John Bolton: It's ‘entirely possible’ Trump wants his supporters to kill Mark Milley  —  Former National Security Adviser John Bolton warned CNN's Jake Tapper on Monday that former President Donald Trump may actually want one of his followers to take matters into their own hands and mete … ",
    "url": "https://www.rawstory.com/trump-supporters-mark-milley/"
  },
  {
    "text": "DeSantis steps up offensive with a message that Trump isn't the same person  —  After declaring Donald Trump “missing in action” at last week's Republican presidential primary debate, Florida Gov. Ron DeSantis followed up by taking shot after shot at the former president.",
    "url": "https://www.cnn.com/2023/10/03/politics/desantis-attacks-trump/"
  },
  {
    "text": "Trump's decision to show up in New York for start of his civil trial was as personal as it was political  —  For former President Donald Trump, showing up in New York for the start of his civil trial Monday was more than a political stop to boost his 2024 campaign.  It was also deeply personal.",
    "url": "https://www.cnn.com/2023/10/02/politics/trump-new-york-civil-trial-appearance/"
  },
  {
    "text": "Rep. Matt Gaetz files resolution to oust Kevin McCarthy as speaker of the House  —  Republican Rep. Matt Gaetz filed a resolution late Monday to oust Kevin McCarthy as speaker, setting up a likely showdown vote in the House in the days ahead.  The far-right Republican from Florida … ",
    "url": "https://apnews.com/article/kevin-mccarthy-matt-gaetz-speaker-vacate-congress-e7e5ccc6cf79ccbf5b4a7b73b9d5a3ae"
  },
  {
    "text": "10/3/23 ☀️ Punchbowl News AM … But it might be too late.  —  With the House on the brink of voting on a motion to oust McCarthy, there's very strong sentiment inside the Democratic Caucus against helping the speaker, according to multiple aides and lawmakers.",
    "url": "https://punchbowl.news/archive/10323-punchbowl-news-am/"
  },
  {
    "text": "Gaetz moves to oust Speaker McCarthy  —  Rep. Matt Gaetz (R-Fla.) on Monday moved to force a vote on ousting Speaker Kevin McCarthy (R-Calif.), following through with his pledge to do so after the Speaker put a “clean” continuing resolution (CR) to fund the government on the House floor.",
    "url": "https://thehill.com/homenews/house/4233982-gaetz-moves-to-oust-speaker-mccarthy/"
  },
  {
    "text": "Here's What Happens Now That Gaetz Has Moved to Oust McCarthy  —  The “motion to vacate” that Representative Matt Gaetz put forward on Monday sets up a two-day showdown between the speaker and hard-right Republicans in the House.  —  Representative Matt Gaetz pressed forward on Monday evening … ",
    "url": "https://www.nytimes.com/2023/10/03/us/politics/mccarthy-gaetz-motion-to-vacate.html"
  },
  {
    "text": "Democrats Weigh Whether to Rescue McCarthy From G.O.P. Ouster Bid  —  Party officials said that without promises to address their policy priorities, the speaker should not count on Democratic votes to save him.  —  The hard-right threat to oust Speaker Kevin McCarthy from his post … ",
    "url": "https://www.nytimes.com/2023/10/02/us/politics/democrats-mccarthy-speaker.html"
  },
  {
    "text": "What was Elon Musk's strategy for Twitter?  —  A year after the world's richest man acquired the social media platform, a game plan published by a fired Trump White House staffer provides a clue.  —  On the day that public records revealed that Elon Musk had become Twitter's biggest shareholder … ",
    "url": "https://www.nbcnews.com/tech/was-elon-musks-strategy-twitter-rcna118490"
  },
  {
    "text": "Nobel Prize Awarded to Covid Vaccine Pioneers  —  The physiology or medicine prize for Katalin Karikó and Drew Weissman recognized work that led to the development of vaccines that were administered to billions around the world.  —  Katalin Karikó and Drew Weissman … ",
    "url": "https://www.nytimes.com/2023/10/02/health/nobel-prize-medicine.html"
  },
  {
    "text": "Congressman Henry Cuellar carjacked at gunpoint in Washington  —  Congressman Cuellar was carjacked at gunpoint Monday.  —  LIVE  —  Democratic Texas Rep. Henry Cuellar was carjacked at gunpoint Monday night near his residence in the Navy Yard area of Washington, D.C. just blocks from the Capitol.",
    "url": "https://abcnews.go.com/Politics/congressman-henry-cuellar-carjacked-gunpoint-washington-sources/story?id=103676681"
  },
  {
    "text": "Pentagon official charged with participating in dog fighting ring  —  Frederick D. Moorefield Jr., a deputy chief information officer, is accused of training fighting dogs for more than 20 years  —  A senior member of the Department of Defense communications staff has been arrested and charged … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/10/02/moorefield-charged-dog-fighting-department-defense/"
  },
  {
    "text": "Playbook: Inside a new senator's big decision  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  CAREFUL OUT THERE — Rep. HENRY CUELLAR (D-Texas) was carjacked at gunpoint last night outside his apartment building south of the Capitol, Sarah Ferris and Nick Wu first reported.",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/03/inside-a-new-senators-big-decision-00119609"
  },
  {
    "text": "No Labels makes its choice  —  No Labels claims to be a non-partisan centrist organization.  It describes itself as a movement for the “politically homeless.”  But in practice, it has supported Republicans and very conservative Democrats.  This year, No Labels has spent millions … ",
    "url": "https://popular.info/p/no-labels-makes-its-choice"
  },
  {
    "text": "Hunter Biden Set to Be Arraigned Over Federal Gun Charges  —  Mr. Biden intends to plead not guilty, but if convicted, he could face up to 25 years in prison and $750,000 in fines.  —  Hunter Biden's hopeful arrival at the federal courthouse in Wilmington, Del., in July ended in chaos … ",
    "url": "https://www.nytimes.com/2023/10/03/us/politics/hunter-biden-arraignment-gun-charges.html"
  },
  {
    "text": "'They're just meat': Russia deploys punishment battalions in echo of Stalin  —  Drunk recruits.  Insubordinate soldiers.  Convicts.  —  They're among hundreds of military and civilian offenders who've been pressed into Russian penal units known as “Storm-Z” squads and sent to the frontlines … ",
    "url": "https://www.reuters.com/world/europe/theyre-just-meat-russia-deploys-punishment-battalions-echo-stalin-2023-10-03/"
  },
  {
    "text": "Error in New York's Civil Fraud Case Against Trump Is Flagged by Industry Insiders, Who Say Valuation of Mar-a-Lago Cited by Judge Is Based on a Misunderstanding of Basic Real Estate Practice  —  Apparent mistake by Judge Engoron surfaces in his use of a Palm Beach County appraisal of Mar-a-Lago that … ",
    "url": "https://www.nysun.com/article/error-in-new-yorks-civil-fraud-case-against-trump-is-flagged-by-industry-insiders-who-say-valuation-of-mar-a-lago-cited-by-judge-is-based-on-a-misunderstanding-of-basic-real-estate-practice"
  },
  {
    "text": "Amid liberal revolt, pope signals openness to blessings for gay couples  —  COLOGNE, Germany — In the shadow of Cologne's Gothic cathedral, the St. Stephan's Youth Choir struck up a chorus of “All You Need Is Love” as couples — men with men, women with women, and women with men … ",
    "url": "https://www.washingtonpost.com/world/2023/10/02/pope-francis-gay-blessings-synod/"
  }
]