[
  {
    "text": "Trump's Biggest Lies From His ‘Meet the Press’ Interview  —  From immigrants to Obamacare, the president-elect continued his campaign trail falsehoods  —  Donald Trump gave his first network interview since the election and spread falsehoods about immigrants, the Affordable Care Act and — of course — the 2020 election.",
    "url": "https://www.rollingstone.com/politics/politics-news/trumps-lies-meet-the-press-2024-1235196576/"
  },
  {
    "text": "Trump says he can't guarantee tariffs won't raise US prices and won't rule out revenge prosecutions  —  Donald Trump said he can't guarantee that his promised tariffs on key U.S. foreign trade partners won't raise prices for American consumers and he suggested once more that some political rivals … ",
    "url": "https://apnews.com/article/trump-immigration-tariffs-pardons-abortion-prosecutions-riot-72c08269f0a870d20e29033319201e22"
  },
  {
    "text": "Trump aims to end birthright citizenship, says American citizens with family here illegally may be deported  —  President-elect Donald Trump, in an exclusive interview with “Meet the Press,” also said he is open to working with Democrats on a legislative way to keep Dreamers in the United States.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-aims-end-birthright-citizenship-says-american-citizens-family-il-rcna183274"
  },
  {
    "text": "Read the full transcript: President-elect Donald Trump interviewed by “Meet the Press” moderator Kristen Welker  —  Trump spoke with NBC News for more than an hour in an interview that covered a range of topics.  —  KRISTEN WELKER:  —  President-elect Donald Trump, welcome back to Meet the Press.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-interview-meet-press-kristen-welker-election-president-rcna182857"
  },
  {
    "text": "The Syrian Regime Collapsed Gradually—And Then Suddenly  —  Assad's fall offers the possibility of change.  —  As Hemingway once wrote of bankruptcy, the collapse of autocratic regimes tends to happen gradually and then suddenly—slowly, and then all at once.  This is not just a literary metaphor.",
    "url": "https://www.theatlantic.com/international/archive/2024/12/sudden-collapse-bashar-assad/680917/?gift=hVZeG3M9DnxL4CekrWGK39JslY0QVDPx4BZRvytxmgI&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Biden Weighs Approach to Rebels in Syria Amid Secret Message Exchange  —  President Biden faces the challenge of deciding how to engage the main armed group that toppled President Bashar al-Assad, even though it remains designated a terrorist organization by the United States.",
    "url": "https://www.nytimes.com/2024/12/08/us/politics/biden-syria-assad-isis.html"
  },
  {
    "text": "Khamenei Loses Everything  —  The October 7 attack on Israel has now cost Iran its regional proxy forces.  —  When Hamas's Yahya Sinwar launched Operation Al-Aqsa Flood against Israel on October 7, 2023, he intended to deal a decisive blow against a powerful nation-state—and he succeeded.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/12/khamenei-iran-syria/680920/?gift=5Jt_OsUNCrDLh-WaaPKh0XxkVqXiByOZektEmQ-ztgE"
  },
  {
    "text": "Trump will ‘most likely’ pardon Capitol rioters on Day 1 and says Jan. 6 committee members should be jailed  —  The president-elect also said during an exclusive interview with “Meet the Press” that he won't request a special prosecutor to investigate outgoing President Joe Biden.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-will-likely-pardon-capitol-rioters-day-1-says-jan-6-committee-me-rcna183275"
  },
  {
    "text": "Trump Suggests Kennedy Will Examine Debunked Link Between Vaccines and Autism  —  The president-elect has promoted the theory for more than a decade and said on Sunday that he was “open to anything” to address a nationwide rise in autism.  —  President-elect Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/12/08/us/politics/trump-rfk-jr-vaccines-autism.html"
  },
  {
    "text": "Trump says RFK Jr. will investigate the discredited link between vaccines and autism: ‘Somebody has to find out’  —  Researchers attribute a rise in autism diagnoses to increased screening and changing definitions of the condition.  Hundreds of studies have found childhood vaccines to be safe.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-rfk-jr-will-investigate-discredited-link-vaccines-autism-so-rcna183273"
  },
  {
    "text": "Weakened US public broadcasters will fight for their lives in 2025  —  The Scoop  —  Last week, Republican Sen. John Kennedy introduced the subtly named “No Propaganda Act.”  If enacted, it would end federal funding for America's public media.  —  He joined an effort by billionaires Elon Musk … ",
    "url": "https://www.semafor.com/article/12/08/2024/weakened-us-public-broadcasters-will-fight-for-their-lives-in-2025"
  },
  {
    "text": "Trump's FBI pick co-hosted a show for a conspiracy-filled, far-right media organization  —  The show could receive fresh scrutiny as Kash Patel faces Senate confirmation hearings.  —  Rampant FBI misconduct, election fraud, the deep state.  Such were the weekly topics on “Kash's Corner,” … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trumps-fbi-pick-co-hosted-show-conspiracy-filled-far-right-media-organ-rcna182823"
  },
  {
    "text": "Boeing failing to keep track of non-conforming parts, whistleblower says: “It's like Russian roulette”  —  When a panel known as a door plug blew off an Alaska Airlines flight minutes after takeoff earlier this year,  a quality investigator at the factory where the Boeing plane was manufactured … ",
    "url": "https://www.cbsnews.com/news/boeing-whistleblowers-speak-out-60-minutes/"
  },
  {
    "text": "Trump is stacking his White House roster with uber-rich backers … Donald Trump's first administration was chock full of super-rich figures whose combined wealth exceeded $5 billion, marking an unprecedented marriage of money and executive power.  —  Trump's second term could make that total look like chump change.",
    "url": "https://www.cnbc.com/2024/12/08/trump-billionaires-white-house-cabinet.html"
  }
]