[
  {
    "text": "Kevin McCarthy on Trump: America doesn't want “retribution”  —  California Republican Kevin McCarthy holds a place in history as the first-ever Speaker of the House to be voted out of that position.  Historic, but looking at how his tenure began, hardly a shock.",
    "url": "https://www.cbsnews.com/news/kevin-mccarthy-on-trump-america-doesnt-want-retribution/"
  },
  {
    "text": "Trump the ‘human gumball machine’ will ‘impose his will’ on the nation if elected, Romney says  —  “A thought or a notion comes in and it comes out of his mouth.  There's not a lot of filter that goes on,” he said of Trump.  —  Some Republicans have read former President Donald Trump's comment … ",
    "url": "https://www.politico.com/news/2023/12/10/trump-romney-election-2024-00130972"
  },
  {
    "text": "'America doesn't want' retribution from Trump, McCarthy says  —  “What President Trump needs to do in this campaign, it needs to be about rebuilding, restoring, renewing America.  It can't be about revenge,” McCarthy said.  —  Former House Speaker Kevin McCarthy has officially pledged … ",
    "url": "https://www.politico.com/news/2023/12/10/trump-wants-retribution-mccarthy-says-00130996"
  },
  {
    "text": "Iowa poll: Trump surpasses 50% support ahead of first GOP contest  —  The former president leads Ron DeSantis among likely Iowa caucusgoers, 51% to 19%, with Nikki Haley at 16%.  —  Former President Donald Trump has expanded his lead over his GOP rivals with five weeks until … ",
    "url": "https://www.nbcnews.com/politics/2024-election/iowa-poll-trump-surpasses-50-support-ahead-first-gop-contest-rcna128217"
  },
  {
    "text": "Republicans to meet allies of Hungary's Viktor Orbán on ending Ukraine aid  —  Hungarian appearance at two-day event part of Orbán's transatlantic attempt to bolster Russia's war  —  Allies of Hungary's far-right prime minister Viktor Orbán will hold a closed-door meeting … ",
    "url": "https://www.theguardian.com/us-news/2023/dec/10/hungary-viktor-orban-republicans-ukraine-aid"
  },
  {
    "text": "House GOP chips away at centrist resistance on Biden impeachment inquiry  —  About a half-dozen members are still undecided, but there's only one public ‘no’ vote in POLITICO's whip count.  It's a rare sign of unity for the conference.  —  House Republicans are inches away … ",
    "url": "https://www.politico.com/news/2023/12/11/house-gop-chips-away-at-centrist-resistance-on-biden-impeachment-inquiry-00130909"
  },
  {
    "text": "In a reversal, Donald Trump says he will not testify in his own defense in New York fraud trial  —  Trump was scheduled to take the stand Monday as the months-long $250 million civil fraud trial against him and his company enters its final week.  —  In an 11th hour reversal … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/reversal-donald-trump-says-will-not-testify-defense-new-york-fraud-tri-rcna128749"
  },
  {
    "text": "Trump defends dictator comments amid NYC soiree filled with MAGA diehards  —  At an event with key figures within the MAGA movement, the former president repeated comments that he wants to be a dictator on “day one.”  —  NEW YORK — The chairman of an Austrian political party founded by ex-Nazis … ",
    "url": "https://www.politico.com/news/2023/12/10/trump-defends-dictator-comments-amid-nyc-soiree-filled-with-extremists-maga-diehards-00130968"
  },
  {
    "text": "Tucker Carlson Is Launching His Own Streaming Service  —  ‘Tucker Carlson Network’ is expected to go live on Monday and cost $9 a month  —  Tucker Carlson is launching his own subscription streaming service, people familiar with the matter said, the former Fox News host's official foray … ",
    "url": "https://www.wsj.com/business/media/tucker-carlson-is-launching-his-own-streaming-service-5fc2f9ba?mod=followamazon"
  },
  {
    "text": "As Fury Erupts Over Campus Antisemitism, Conservatives Seize the Moment  —  Republicans have been attacking elite universities for years.  After a tense congressional hearing last week, many on the left are joining them.  —  For years, conservatives have struggled to persuade American voters … ",
    "url": "https://www.nytimes.com/2023/12/10/us/universities-antisemitism-conservatives-liberals.html"
  },
  {
    "text": "Less appetite — and opportunity — to serve as fake Trump electors in 2024  —  Amid a growing number of criminal investigations into the 2020 election, some who once cast electoral college votes for the former president say they would not do it again  —  Republican Party activist Ken Carroll thought … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/10/trump-fake-electors-charges/"
  },
  {
    "text": "Former Rep. George Santos says no shortage of corruption in Congress after his expulsion on “The Point with Marcia Kramer”  —  The Point  —  George Santos has left the U.S. House of Representatives, but apparently not the public arena.  He's making personalized videos on Cameo … ",
    "url": "https://www.cbsnews.com/newyork/news/george-santos-interview-corruption-in-congress-the-point-with-marcia-kramer/"
  },
  {
    "text": "George Santos earning so much on Cameo, he picks up tab for political pals while hanging with Rep. Lauren Boebert in NYC  —  George Santos is making so much dough on Cameo — he picked up the tab for his political pals on Saturday night.  —  The ousted pol was hanging with “ball of energy” … ",
    "url": "https://pagesix.com/2023/12/10/gossip/george-santos-with-rep-lauren-boebert-at-late-night-nyc-bash/"
  },
  {
    "text": "Antony Blinken Defends Lone U.S. Veto On UN Cease-Fire Resolution For Gaza  —  The secretary of state also claimed the U.S. cares about protecting Palestinian civilians, but just bypassed Congress to approve more arms sales to Israel.  —  LOADING  —  Secretary of State Antony Blinken defended … ",
    "url": "https://www.huffpost.com/entry/antony-blinken-defends-us-veto-un-ceasefire-gaza_n_657600e5e4b0fca7ad21261e"
  },
  {
    "text": "The Guns Were Said to Be Destroyed.  Instead, They Were Reborn.  —  Communities across the U.S. are fueling a secondary arms market by giving seized and surrendered guns to disposal services that destroy one part and resell the rest.  —  When Flint, Mich., announced in September … ",
    "url": "https://www.nytimes.com/2023/12/10/us/guns-disposal-recycling.html"
  }
]