[
  {
    "text": "After a Blowout Week, Wall Street Decision Makers Brace for More Chaos  —  The financial titans who backed Trump are now dealing with the fallout from his tariffs.  They spent the weekend surveying the damage of last week's major sell-off.  —  There was little rest on Wall Street this weekend.",
    "url": "https://www.nytimes.com/2025/04/06/business/stock-market-plunge-investment-bank-impact.html?unlocked_article_code=1.9k4.thee.Qx6AABTI3Kyw"
  },
  {
    "text": "Dow futures fall 1,500 points Sunday as Trump tariff market rout escalates: Live updates  —  U.S. stock futures dropped on Sunday evening as the White House remained defiant even after a two-day historic stock market rout that followed President Donald Trump's rollout of shockingly high tariff rates on most key U.S. trading partners.",
    "url": "https://www.cnbc.com/2025/04/06/stock-market-today-live-updates.html"
  },
  {
    "text": "Stocks in Asia Fall Sharply, Extending a Rout Caused by Trump's Tariffs  —  Futures on the S&P 500, which allow investors to trade the index before regular trading begins on Monday, added to last week's sell-off.  —  Financial markets were hit hard by another wave of selling at the start … ",
    "url": "https://www.nytimes.com/2025/04/06/business/stocks-trump-tariffs.html"
  },
  {
    "text": "U.S. Stock Futures, Nikkei Plunge as Tariff Turmoil Deepens  —  Oil prices and Treasury yields also fell as President Trump stood firm on imposing tariffs that investors fear will clobber the global economy  —  More pain appears to be in store for markets after their worst week to start a quarter since 2008.",
    "url": "https://www.wsj.com/livecoverage/stock-market-trump-tariffs-trade-war-04-07-25"
  },
  {
    "text": "Trump, Unbowed, Is Enacting Change on Scale Rarely Seen Before  —  Financial markets, universities, law firms and world leaders are reeling from the president's agenda, but White House officials say this was always the plan  —  WASHINGTON—And it's only been 77 days.",
    "url": "https://www.wsj.com/politics/policy/trump-unbowed-is-enacting-change-on-scale-rarely-seen-before-a582db3a"
  },
  {
    "text": "Trump not trying to crash market with tariffs, says White House economic advisor … A crashing stock market is not part of an intentional strategy by President Donald Trump, White House National Economic Council director Kevin Hassett told ABC's “This Week” on Sunday.",
    "url": "https://www.cnbc.com/2025/04/06/kevin-hassett-stock-market-crash-not-part-of-trumps-strategy.html"
  },
  {
    "text": "Trump to America as Markets Crash: ‘Sometimes You Have to Take Medicine’  —  The president said Sunday he is not deliberately tanking the markets, as U.S. market futures dropped again following his tariff announcement  —  Donald Trump said Sunday he is not deliberately tanking the stock market … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-tariffs-market-crash-take-medicine-america-1235311613/"
  },
  {
    "text": "Trump administration deports gay makeup artist to prison in El Salvador  —  Andry Hernandez Romero, a gay makeup artist who came to the United States last year in search of asylum, is one of 238 Venezuelan migrants who were flown from the U.S. to a maximum security prison in El Salvador three weeks ago.",
    "url": "https://www.cbsnews.com/news/venezuelan-migrants-deportations-el-salvador-prison-60-minutes/"
  },
  {
    "text": "Judge says deportation of Maryland man to an El Salvador prison was ‘wholly lawless’  —  The U.S. government's decision to arrest a Maryland man and send him to a notorious prison in El Salvador appears to be “wholly lawless,” a federal judge wrote Sunday in a legal opinion explaining … ",
    "url": "https://apnews.com/article/ice-trump-immigration-el-savador-5d2f7b919cb1a4ed5ce31d44f391d8f5"
  },
  {
    "text": "Kennedy announces support for measles vaccine amid outbreak  —  The statement is a surprising turn for the health secretary and comes amid reports of a second child's death.  —  Health Secretary Robert F. Kennedy Jr., who spent years promoting debunked theories and sowing doubts about the safety … ",
    "url": "https://www.politico.com/news/2025/04/06/kennedy-support-measles-vaccine-outbreak-00276021"
  },
  {
    "text": "Treasury Sec. Bessent says 'there doesn't have to be a recession': Full interview  —  Treasury Sec. Scott Bessent exclusively joins Meet the Press days after President Donald Trump unveiled expansive tariffs on the United States' largest trading partners.",
    "url": "https://www.nbcnews.com/meet-the-press/video/treasury-sec-bessent-says-there-doesn-t-have-to-be-a-recession-full-interview-236654149913"
  },
  {
    "text": "Sen. Mullin suggests ‘fake news’ would decline if violence could ‘still’ settle disputes  —  Journalists would write fewer “fake news” stories if disputes over coverage could be handled through violence, U.S. Sen. Markwayne Mullin suggested on social media.  —  In a video posted over the weekend … ",
    "url": "https://eu.oklahoman.com/story/news/2025/04/06/markwayne-mullin-fake-news-remarks-us-senator-capitol/82963694007/"
  },
  {
    "text": "NIH scientists have a cancer breakthrough.  Layoffs are delaying it.  —  A big step forward in cancer therapy has been slowed by layoffs and new restrictions at the National Institutes of Health, where it was developed.",
    "url": "https://www.washingtonpost.com/science/2025/04/06/nih-firings-cancer-immunotherapy-treatment/"
  },
  {
    "text": "Trump Will Get His Showy (And Likely Expensive) Military Parade in D.C.  —  President Donald Trump for years has lusted after a big military parade over which he could preside—just like he sees leaders do in other mostly authoritative countries.  —  During his first term in 2018 … ",
    "url": "https://washingtoncitypaper.com/article/761814/trump-parade-military-dc/"
  },
  {
    "text": "Chinese woman detained by US border patrol in Arizona dies by suicide  —  Officials reportedly didn't publicly acknowledge death until inquiries were made about woman, 52, who overstayed visa  —  A woman being detained in Arizona by US border patrol for overstaying her visa has died by suicide … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/06/chinese-woman-border-patrol-arizona-suicide"
  },
  {
    "text": "Try that in a small town  —  ICE disappeared a mother and 3 children.  Neighbors of Trump's Border Czar said hell no. … If you want to support independent media during these dark times for democracy, become a paid subscriber today. … Principal Jaime Cook describes one of the third graders … ",
    "url": "https://www.thehandbasket.co/p/sackets-harbor-tom-homan-jaime-cook"
  },
  {
    "text": "Younger Democrats want to force an uncomfortable conversation about age  —  Many complain the party is dominated by an older generation of leaders who have lost touch with Americans' day-to-day struggles.  —  Just now  —  LOS ANGELES — Democrat Saikat Chakrabarti decided to challenge … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/06/young-democrats-age-leadership/"
  }
]