[
  {
    "text": "Republicans can't govern.  Just ask them.  —  As the party flails in its search for a speaker, the GOP is increasingly acknowledging publicly that its discord is embarrassing — and even dangerous.  —  It's not clear yet that House Republicans' inability to elect a new speaker … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/23/gop-speaker-dangerous-discord/"
  },
  {
    "text": "Exclusive poll: Biden and Trump tie at 37% as RFK Jr. costs Trump a narrow lead  —  The arithmetic gets complicated and the politics unsettled in a 2020 rematch with at least one significant independent candidate, and perhaps more.  —  Susan Page Sudiksha Kochi Savannah Kuchar",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/10/23/biden-trump-rfk-jr-poll/71281814007/"
  },
  {
    "text": "Intelligence shows Iranian-backed militias are ready to ramp up their attacks against US forces in the Middle East  —  The US has intelligence that Iranian-backed militia groups are planning to ramp up attacks against US forces in the Middle East, as Iran seeks to capitalize on the backlash … ",
    "url": "https://www.cnn.com/2023/10/23/politics/iranian-militias-israel-hamas/"
  },
  {
    "text": "U.S. Advises Israel to Delay Gaza Invasion, Officials Say  —  The Biden administration has suggested that more time is needed for hostage negotiations, the delivery of aid to Palestinians and mapping out ways to avoid more civilian casualties.  —  The Biden administration has advised Israel … ",
    "url": "https://www.nytimes.com/2023/10/22/us/politics/us-hostages-israel-gaza.html"
  },
  {
    "text": "Alaska Air off-duty pilot tries to shut off engines on flight from Everett  —  An off-duty Alaska Airlines pilot taking a ride Sunday in the jump seat of a flight out of Everett attempted to shut down the engines inflight and had to be subdued, the pilot in charge is heard saying in a recording … ",
    "url": "https://www.seattletimes.com/business/boeing-aerospace/alaska-air-off-duty-pilot-tries-to-shut-off-engines-on-flight-from-everett/"
  },
  {
    "text": "Off-duty pilot charged with 83 counts of attempted murder for allegedly trying to shut off engines on Alaska Airlines flight  —  Joseph David Emerson was taken into custody, the Port of Portland confirmed.  —  An off-duty pilot is charged with 83 counts of attempted murder after he allegedly tried … ",
    "url": "https://abcnews.go.com/US/alaska-airlines-flight-diverted-after-credible-security-threat/story?id=104223059"
  },
  {
    "text": "Trump Plots to Pull Out of NATO — If He Doesn't Get His Way  —  At the very least, the former president wants to put the U.S. on “standby” mode — and undermine NATO's principle of collective defense  —  Donald Trump wanted to pull the United States out of NATO during his first term … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-u-s-leave-nato-1234860016/"
  },
  {
    "text": "Tom Emmer scrambles to fix his Trump problem  —  The majority whip is battling a whisper campaign questioning his past support for the ex-president.  —  As House Republicans sort through a field of short-timers and back-benchers to pick their next speaker, Majority Whip Tom Emmer stands out.",
    "url": "https://www.politico.com/news/2023/10/23/tom-emmer-trump-speaker-race-00122969"
  },
  {
    "text": "Trump claims Sidney Powell was ‘never’ his lawyer after her plea deal  —  Trump's assertion in a social media post could help prosecutors sidestep attorney-client privilege issues.  —  Former President Donald Trump is distancing himself from attorney Sidney Powell in the wake of her guilty plea … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-distances-sidney-powell-plea-deal-rcna121695"
  },
  {
    "text": "Trump Bizarrely Declares ‘I Was Never Indicted’ After Being Indicted Four Times  —  Former President Donald Trump took questions from reporters after officially filing for the GOP New Hampshire primary on Monday and oddly seemed to claim he was never indicted.",
    "url": "https://www.mediaite.com/politics/trump-bizarrely-declares-i-was-never-indicted-after-being-indicted-four-times/"
  },
  {
    "text": "Thoughts on Israel and Gaza  —  It's been 17 days since Hamas launched its horrific attack against Israel, killing over 1,400 Israeli citizens, including defenseless women, children and the elderly.  In the aftermath of such unspeakable brutality, the U.S. government and the American people … ",
    "url": "https://barackobama.medium.com/my-statement-on-israel-and-gaza-a6c397f09a30"
  },
  {
    "text": "Editors' Note: Gaza Hospital Coverage  —  On Oct. 17, The New York Times published news of an explosion at a hospital in Gaza City, leading its coverage with claims by Hamas government officials that an Israeli airstrike was the cause and that hundreds of people were dead or injured.",
    "url": "https://www.nytimes.com/2023/10/23/pageoneplus/editors-note-gaza-hospital-coverage.html"
  },
  {
    "text": "Another GOP ‘Bombshell’ About Joe Biden Turns Out To Be A Dud  —  Republicans' impeachment inquiry continues to limp along in the background of their speaker drama.  —  LOADING  —  WASHINGTON — Republicans announced Friday that they had uncovered a “direct payment” to President Joe Biden … ",
    "url": "https://www.huffpost.com/entry/james-biden-payment-joe-biden_n_6536badee4b0689b3fbd8cf1"
  },
  {
    "text": "US renews warning it will defend Philippines after incidents with Chinese vessels in South China Sea  —  The United States renewed a warning Monday that it would defend the Philippines in case of an armed attack under a 1951 treaty, after Chinese ships blocked and collided with two Filipino vessels off … ",
    "url": "https://apnews.com/article/south-china-sea-philippines-collision-67aa7e2ca5df4f4e3a7c3bceff46c26f"
  },
  {
    "text": "Ukrainian spies with deep ties to CIA wage shadow war against Russia  —  KYIV — The cluttered car carrying a mother and her 12-year-old daughter seemed barely worth the attention of Russian security officials as it approached a border checkpoint.  But the least conspicuous piece of luggage … ",
    "url": "https://www.washingtonpost.com/world/2023/10/23/ukraine-cia-shadow-war-russia/"
  }
]