[
  {
    "text": "‘Russian bombers are burning en masse’ — Ukraine's SBU drones hit ‘more than 40’ aircraft in mass attack, source says  —  An operation by Ukraine's Security Service (SBU) using first-person-view (FPV) drones smuggled deep inside Russian and hidden inside trucks has hit 41 Russian heavy bombers … ",
    "url": "https://kyivindependent.com/enemy-bombers-are-burning-en-masse-ukraines-sbu-drones-hit-more-than-40-russian-aircraft/"
  },
  {
    "text": "Ukraine Says It Destroyed Dozens of Warplanes Deep Inside Russia  —  Clandestine drone attack, 18 months in planning, deals biggest blow of the war against Moscow's long-range bomber fleet  —  KYIV—Ukraine launched audacious drone attacks on four military airports inside Russia … ",
    "url": "https://www.wsj.com/world/russia/ukraine-says-its-drones-destroyed-warplanes-deep-inside-russia-50a634c6?st=YaHdwV&reflink=article_copyURL_share"
  },
  {
    "text": "Ukraine launches major drone attack on Russian bombers, security official says  —  Reported strikes on four airbases in Siberia mark escalation in cross-border incursions before planned peace talks  —  Ukraine has launched a “large-scale” drone attack against Russian military bombers in Siberia … ",
    "url": "https://www.theguardian.com/world/2025/jun/01/ukraine-launches-major-drone-attack-on-russian-bombers-security-official-says"
  },
  {
    "text": "NEWSFLASH: Russian airfields burning after massive, covert Ukrainian assault  —  After days of Ukraine getting pounded by drones/missiles, a secret Ukrainian attack launched from Russian territory struck 4+ airfields, part of a wider campaign of sabotage behind enemy lines.  —  ∙ Paid",
    "url": "https://www.counteroffensive.news/p/newsflash-russian-airfields-burning"
  },
  {
    "text": "Musk Fends Off Trump Questions in Tense Interview Exchange  —  DONALD WHO?  —  The Tesla CEO bristled when asked about politics.  —  A CBS interview with Elon Musk went off the rails after he was asked about President Donald Trump's crusade against Harvard.",
    "url": "https://www.thedailybeast.com/musk-fends-off-trump-questions-in-tense-interview-exchange/"
  },
  {
    "text": "Elon Musk on DOGE and why he doesn't want to “take responsibility for everything the administration's doing”  —  In the beginning, Donald Trump and Elon Musk got along great.  “He is a truly incredible guy,” Trump said at a campaign rally last October, “and I don't say that that often.”",
    "url": "https://www.cbsnews.com/news/elon-musk-on-doge-trump-administration-and-responsibility-for-cuts/"
  },
  {
    "text": "Are International Students Good for American Universities?  —  Several years ago, a colleague teaching at Miami University, a large state school in Ohio, kindly invited me to give a talk there.  After picking me up at the airport, he suggested that we have lunch at a Sichuan restaurant near campus.",
    "url": "https://www.nytimes.com/2025/06/01/opinion/international-students-harvard-trump.html?unlocked_article_code=1.Lk8.aBEy.sRtbhKOGLKp-&smid=url-share"
  },
  {
    "text": "Trump Spreads Bizarre Conspiracy Theory That Biden Was Executed and Replaced by a Robot Clone  —  “Democrats don't know the difference,” claimed a Truth Social post that the president shared  —  Donald Trump reposted a baseless conspiracy theory claiming Joe Biden was “executed in 2020” and replaced with a robot clone.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-conspiracy-biden-robot-clone-1235352122/"
  },
  {
    "text": "Trump Shares Unhinged Conspiracy Theory That Biden Is a Robot Clone  —  ROBO-POTUS  —  “There is no Joe Biden,” the post reads, claiming that the former president was actually murdered in 2020.  —  With one repost from President Donald Trump, former president Joe Biden has joined a storied pantheon … ",
    "url": "https://www.thedailybeast.com/donald-trump-shares-bonkers-conspiracy-theory-about-joe-biden-being-replaced-by-clones/"
  },
  {
    "text": "Johnson says 4.8 million Americans won't lose Medicaid access ‘unless they choose to do so’  —  Speaker Mike Johnson (R-La.) doubled down on his claim that there won't be Medicaid cuts in President Trump's “big, beautiful bill,” despite projections that millions of low-income individuals … ",
    "url": "https://thehill.com/homenews/sunday-talk-shows/5327723-mike-johnson-gop-bill-medicaid-cuts/"
  },
  {
    "text": "Unease at F.B.I. Intensifies as Patel Ousts Top Officials … The F.B.I. headquarters in Washington.Erin Schaff/The New York Times  —  Before being confirmed as the director of the F.B.I., Kash Patel made clear his intent to remake it in his own image, reflecting a larger desire by the White House to bend the agency to its will.",
    "url": "https://www.nytimes.com/2025/06/01/us/politics/fbi-patel.html?unlocked_article_code=1.Lk8.iy2D.fnawKJ4lmbN6&smid=url-share"
  },
  {
    "text": "Israeli troops kill over 30 near U.S. aid site in Gaza, health officials say  —  Over 170 were wounded heading to a Gaza Humanitarian Foundation aid point, the Health Ministry said.  Israel's military said it was “unaware of injuries caused by IDF fire.”  —  JAFFA, Israel … ",
    "url": "https://www.washingtonpost.com/world/2025/06/01/israel-gaza-aid-rafah-shooting/"
  },
  {
    "text": "CNN Poll: A record share of Americans want the government to get more done.  Few trust either party to do it  —  Neither the Republican nor the Democratic Party has consolidated a majority of the public behind its approach, with more than 4 in 10 saying that neither party can get things done … ",
    "url": "https://cnn.com/2025/06/01/politics/cnn-poll-republicans-democrats"
  },
  {
    "text": "Immigration Research Shows Stephen Miller Wrong About American Science  —  Stuart Anderson writes about immigration, business and globalization.  —  SaveComment  —  Stephen Miller, the chief architect of the Trump administration's immigration policy, said recently that American scientific achievement owes little to immigrants.",
    "url": "https://www.forbes.com/sites/stuartanderson/2025/06/01/immigration-research-shows-stephen-miller-wrong-about-american-science/"
  },
  {
    "text": "How to Dismantle a Democracy, One Job Posting at a Time  —  OPM's new hiring memo imports the authoritarian playbook—quietly, bureaucratically, and by design.  —  The Office of Personnel Management (OPM) recently unveiled a “Merit Hiring Plan” that, despite its name, signals a profound departure … ",
    "url": "https://data4democracy.substack.com/p/how-to-dismantle-a-democracy-one"
  },
  {
    "text": "Federal agent's tattoo stokes fear  —  ICE denies connections between the officer and white supremacy.  —  A federal immigration enforcer's tattoo that matches the description of a symbol used by white supremacists has caused some Vineyarders to sound alarm bells.",
    "url": "https://www.mvtimes.com/2025/05/30/federal-agents-tattoo-stokes-fear/"
  },
  {
    "text": "F.D.A. Updates Recall of Tomatoes, Warning of a High Risk of Illness or Death  —  The recall of tomatoes distributed in three southern states was upgraded to the most severe warning the agency issues.  —  The Food and Drug Administration has updated an ongoing recall of tomatoes distributed … ",
    "url": "https://www.nytimes.com/2025/06/01/health/tomato-recall-fda-salmonella.html?unlocked_article_code=1.Lk8.QIIL._Osju3cWthaI&smid=url-share"
  },
  {
    "text": "Immigrants Rebuilt a Pennsylvania Town — Then Became Targets  —  Haitians in Charleroi filled pews and revived stores.  Now they face deportation and backlash.  —  Larry Celaschi summons me to look at his cell phone, which displays a photo of a truck.  The picture, which someone shared with Celaschi … ",
    "url": "https://www.bloomberg.com/opinion/features/2025-06-01/haitian-immigrants-rebuilt-charleroi-pennsylvania-then-trump-attacked"
  },
  {
    "text": "Ukrainian proposals for June 2 talks with Russia in Istanbul  —  Reuters has seen the text of the peace proposals that Ukrainian negotiators plan to present to the Russian side at peace talks scheduled to take place on June 2 in Istanbul.  —  The text of the Ukrainian document is published in full with no changes.",
    "url": "https://www.reuters.com/world/europe/ukrainian-proposals-june-2-talks-with-russia-istanbul-2025-06-01/"
  },
  {
    "text": "Gov. Tim Walz calls on Democrats to be ‘fierce’ and ‘bully the s-t’ out of President Trump  —  Minnesota Governor Tim Walz encouraged Democrats to be ‘meaner’ and to ‘bully the s-t’ our of President Donald Trump during a speech in South Carolina.  —  The failed 2024 vice presidential candidate … ",
    "url": "https://nypost.com/2025/05/31/us-news/gov-tim-walz-calls-on-democrats-to-be-meaner-and-bully-the-s-t-out-of-wannabe-dictator-president-trump/"
  },
  {
    "text": "Will America's National Parks Survive Trump?  —  Like a cinnamon river overflowing its banks, thousands of elk have been making their way across Jackson Hole, Wyo., to their summer range below the high, jagged peaks of Grand Teton National Park.  —  This is one of the world's most spectacular migrations … ",
    "url": "https://www.nytimes.com/2025/06/01/opinion/trump-parks-budget-cuts.html"
  },
  {
    "text": "Gabbard Wants Fox Hosts to Feed Trump Top Secret Intel: 'Doesn't Read'  —  BURN AFTER WATCHING  —  Because the president is “on broadcast all the time,” the director of national security plans to revamp his daily intelligence briefings.  —  Director of National Security Tulsi Gabbard wants … ",
    "url": "https://www.thedailybeast.com/tulsi-gabbard-wants-fox-hosts-to-feed-trump-intel-doesnt-read/"
  },
  {
    "text": "Senate rankings: The 5 seats most likely to flip  —  The 2026 midterm cycle is already bustling with activity as Senate Republicans gear up to defend their majority and Democrats try to reverse course from a difficult few years and chart a path forward.  —  The fields are starting to take shape … ",
    "url": "https://thehill.com/homenews/senate/5326426-senate-seats-likely-flip-2026/"
  },
  {
    "text": "AI robots are stealing college grads' jobs in 2025's ‘Summer of Hallucination’  —  Always wear sunscreen.  You might need it on the unemployment line.This spring's commencement speeches just wrapped up, and most college grads got the usual good if vague advice.",
    "url": "https://www.inquirer.com/opinion/commentary/ai-killing-jobs-college-grads-20250601.html"
  }
]