[
  {
    "text": "A Weary Trump Appears to Doze Off in Courtroom Ahead of Criminal Trial  —  The former president flashed signs of irritation at times, but also seemed to fall asleep, before jolting back awake.  —  Former President Donald J. Trump seemed alternately irritated and exhausted Monday morning … ",
    "url": "https://www.nytimes.com/2024/04/15/nyregion/trump-asleep-criminal-trial.html"
  },
  {
    "text": "The reality of being a criminal defendant on trial finally dawned on Trump.  He didn't take it well.  —  Donald Trump will spend most of this spring in a drab county courtroom, and he's not happy about it.  —  Donald Trump is learning a hard lesson: Criminal defendants don't get to set their own schedules.",
    "url": "https://www.politico.com/news/2024/04/16/trump-trial-reality-criminal-defendant-00152421"
  },
  {
    "text": "As hush money trial begins, Trump's sex life emerges as key theme  —  Before jurors are questioned, judge spends hours hashing out what a jury should know about allegations involving women other than Stormy Daniels  —  NEW YORK — The opening day of Donald Trump's criminal trial delved deep … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/15/trump-hush-money-trial-sex-tabloids/"
  },
  {
    "text": "Johnson gambles on plan separating Israel aid from Ukraine funds  —  Marjorie Taylor Greene called the decision to put four different foreign aid bills on the floor a ‘scam,’ but it's unclear whether she will try to oust Johnson for it  —  After months of inaction, House Speaker Mike Johnson unveiled … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/15/mike-johnson-israel-ukraine-aid-house-republicans/"
  },
  {
    "text": "US Supreme Court lets Idaho enforce ban on transgender care for minors  —  The conservative-majority U.S. Supreme Court on Monday let a Republican-backed law in Idaho that criminalizes gender-affirming care for transgender minors broadly take effect after a federal judge blocked it as unconstitutional.",
    "url": "https://www.reuters.com/legal/us-supreme-court-lets-idaho-enforce-ban-transgender-care-minors-2024-04-15/"
  },
  {
    "text": "Verified pro-Nazi X accounts flourish under Elon Musk  —  An NBC News review identified 150 verified “Premium” accounts that have posted or amplified pro-Nazi content.  —  Elon Musk's X is a thriving hub for Nazi support and propaganda, with paid subscribers sharing speeches by Adolf Hitler or content praising his genocidal regime.",
    "url": "https://www.nbcnews.com/tech/social-media/x-twitter-elon-musk-nazi-extremist-white-nationalist-accounts-rcna145020"
  },
  {
    "text": "Bidens Report Earning $620,000 and Paying $181,000 in Taxes in 2023  —  The couple's tax return showed a 7 percent jump in income from 2022, a result of higher taxable interest income this year.  —  President Biden and Jill Biden, the first lady, reported earning roughly $620,000 in 2023 … ",
    "url": "https://www.nytimes.com/2024/04/15/us/politics/biden-tax-returns.html"
  },
  {
    "text": "A tax mystery: Why are fewer people getting refunds?  —  The number of people who owe the government has also been rising.  —  If it seems like you're not getting a tax refund like you used to, you're not alone.  —  The share of taxpayers who get money back at tax time is slowly and, a little mysteriously, shrinking.",
    "url": "https://www.politico.com/news/2024/04/15/tax-fewer-people-getting-refunds-00152248"
  },
  {
    "text": "Maine joins effort to elect president by popular vote with new law  —  Maine will become the latest state to join an interstate effort to elect the nation's president by a popular vote, Gov. Janet Mills (D) announced Monday.  —  Mills said she will allow the legislation to become law without her signature … ",
    "url": "https://thehill.com/homenews/state-watch/4596054-maine-joins-effort-to-elect-president-by-popular-vote-with-new-law/"
  },
  {
    "text": "Trump's Truth Social Stock Is Plummeting — Again  —  The company's stock value tanked 18% after it announced a plan to add more shares.  —  LOADING  —  Shares of Trump Media & Technology Group, the parent company of Donald Trump's Truth Social platform, plummeted Monday … ",
    "url": "https://www.huffpost.com/entry/trump-truth-social-stock-tanks_n_661d658fe4b015646f789caa"
  },
  {
    "text": "Sydney mall attack: Confronting pro-Kremlin troll on false claims Jewish student was killer  —  Simeon Boikov, known as Aussie Cossack online, fled to the Russian consulate in Sydney last year  —  “I never falsely suggested anything,” Simeon Boikov tells me.",
    "url": "https://www.bbc.com/news/world-australia-68822846"
  },
  {
    "text": "Supreme Court takes its deepest plunge into Jan. 6, with possible implications for Trump  —  The Supreme Court is expected to grapple Tuesday in detail for the first time with the chaos and violence of the Jan. 6, 2021, riot at the Capitol when it hears arguments in a case that could upend hundreds … ",
    "url": "https://www.politico.com/news/2024/04/16/supreme-court-obstruction-jan-6-00152406"
  },
  {
    "text": "They quit liberal public schools.  Now they teach kids to be anti-'woke.'  —  SOUTHWEST FLORIDA — Kali Fontanilla repeated the lesson title to herself one last time — “'A Com-plete History of Slavery in America'” — sipped her peppermint tea and hit record.",
    "url": "https://www.washingtonpost.com/education/2024/04/15/kali-joshua-fontanilla-exodus-institute/"
  },
  {
    "text": "Crickets from Chirp Systems in Smart Lock Key Leak  —  The U.S. government is warning that “smart locks” securing entry to an estimated 50,000 dwellings nationwide contain hard-coded credentials that can be used to remotely open any of the locks.  The lock's maker Chirp Systems remains unresponsive … ",
    "url": "https://krebsonsecurity.com/2024/04/crickets-from-chirp-systems-in-smart-lock-key-leak/"
  },
  {
    "text": "Democrats seek to seize control of deadlocked Michigan House in special elections  —  Democratic lawmakers are hoping to win back a majority in the deadlocked Michigan House and regain control of the state government in two special elections on Tuesday.  Democrat Mai Xiong is taking … ",
    "url": "https://apnews.com/article/michigan-election-majority-democrats-house-deadlocked-77f6261041701e9839c9ce2069d7c24b"
  },
  {
    "text": "Audit cites potential legal violations in purchase of $19,000 lectern for Arkansas governor  —  LITTLE ROCK, Ark. (AP) — Arkansas Gov. Sarah Huckabee Sanders' office potentially violated state laws on purchasing, state property and government records when it purchased a $19,000 lectern … ",
    "url": "https://apnews.com/article/arkansas-huckabee-sanders-lectern-audit-19000-eb69927a5df693ac3e131b3c80f34b37"
  },
  {
    "text": "Tesla lays off more than 10% of staff globally as sales fall  —  Tesla (TSLA.O) told staff it is laying off more than 10% of its global workforce, an internal memo seen by Reuters on Monday shows, as it grapples with falling sales and an intensifying price war for electric vehicles (EVs).",
    "url": "https://www.reuters.com/business/autos-transportation/tesla-lay-off-more-than-10-its-staff-electrek-reports-2024-04-15/"
  },
  {
    "text": "Left-Wing Dark Money Behemoth Behind Bail Fund for ‘Free Palestine’ Bridge Blockers  —  Community Justice Exchange, part of the Soros-funded Tides Center, solicits legal defense donations for arrested protesters  —  Scores of “Free Palestine” protesters across the United States took … ",
    "url": "https://freebeacon.com/israel/left-wing-dark-money-behemoth-behind-bail-fund-for-free-palestine-bridge-blockers/"
  },
  {
    "text": "Justice Thomas misses Supreme Court session Monday with no explanation  —  Supreme Court Justice Clarence Thomas was absent from the court Monday with no explanation.  Thomas, 75, also was not participating remotely in arguments, as justices sometimes do when they are ill or otherwise can't be there in person.",
    "url": "https://thehill.com/homenews/ap/ap-politics/ap-justice-thomas-misses-supreme-court-session-monday-with-no-explanation/"
  }
]