[
  {
    "text": "'He's a child' Trump is imploding because he thinks 'rules don't apply to him': biographer  —  Former President Donald Trump had a bad day on the witness stand at his civil fraud trial in New York, snapping at state attorneys and offering contradictory stories about his company's dubious property valuations … ",
    "url": "https://www.rawstory.com/trump-child-rules-dont-apply/"
  },
  {
    "text": "Iowa Gov. Kim Reynolds says Trump can't win in 2024 as she endorses Ron DeSantis  —  Reynolds and DeSantis spoke about the state of the 2024 race and what led to the Iowa governor's endorsement in a joint interview with NBC News.  —  DES MOINES, Iowa  — Iowa Gov. Kim Reynolds touted Ron … ",
    "url": "https://www.nbcnews.com/politics/2024-election/iowa-gov-kim-reynolds-says-trump-cant-win-2024-endorses-ron-desantis-rcna123788"
  },
  {
    "text": "Playbook: Four big Election Day questions  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  COACH BAGGAGE — Senate Republicans are set to discuss a possible resolution to Sen. TOMMY TUBERVILLE's blockade of military promotions this afternoon, and … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/07/four-big-election-day-questions-00125728"
  },
  {
    "text": "Biden's stumbles spark concerns about ad strategy and surrogate operation  —  The campaign says it's not revamping its approach amid stagnant polls and fear-filled Democrats.  —  In late August, Joe Biden's reelection campaign announced a massive ad buy to run on television and online in key battleground states.",
    "url": "https://www.politico.com/news/2023/11/07/internal-debates-in-biden-world-over-whether-to-go-harder-at-trump-00125705"
  },
  {
    "text": "Ted Cruz says he expects to run for president again, criticizes Democrats for pro-Palestine rhetoric  —  In an interview about his upcoming book “Unwoke: How to Defeat Cultural Marxism in America,” Cruz talks about 2024, antisemitism and “woke” politics.  —  WASHINGTON — U.S. Sen. Ted Cruz … ",
    "url": "https://www.texastribune.org/2023/11/07/ted-cruz-president-2024-woke-book/"
  },
  {
    "text": "Sen. Ted Cruz Teases Another White House Run, Says First Attempt at Presidency Was ‘Fun’  —  Cruz said he decided not to run for president in this election cycle because the timing wasn't right  —  While promoting his new book “Unwoke: How to Defeat Cultural Marxism in America,” Sen. Ted Cruz … ",
    "url": "https://themessenger.com/politics/sen-ted-cruz-teases-another-white-house-run-says-first-attempt-at-presidency-was-fun"
  },
  {
    "text": "Woman arrested after driving car into Indianapolis building she thought was ‘Israel school’  —  The woman “told one officer she has been watching the news and couldn't breathe anymore.  She referenced her people back in Palestine,” according to a news release from the Indianapolis Metropolitan Police Department.",
    "url": "https://www.nbcnews.com/news/us-news/woman-arrested-driving-car-indianapolis-building-thought-was-israel-sc-rcna123974"
  },
  {
    "text": "Netanyahu to ABC's Muir: ‘No cease-fire’ without release of hostages  —  He spoke exclusively with “World News Tonight” anchor David Muir.  —  Israeli Prime Minister Benjamin Netanyahu speaks with ABC World News Tonight anchor David Muir, Nov. 6, 2023.  —  Israeli Prime Minister Benjamin Netanyahu … ",
    "url": "https://abcnews.go.com/Politics/netanyahu-abcs-muir-cease-fire-release-hostages/story?id=104661239"
  },
  {
    "text": "Democratic senator expresses worries about potential World War III  —  Sen. Tim Kaine (D-Va.) shared concerns Monday over the war between Israel and Hamas in Gaza, saying he's had to consider whether it could escalate into a global conflict amid rising tensions across the Middle East.",
    "url": "https://thehill.com/policy/defense/4297134-kaine-worries-world-war-iii-israel-hamas/"
  },
  {
    "text": "Marjorie Taylor Greene Shows Congress How to Lose Friends and Not Influence People  —  Marjorie Taylor Greene's latest spat with her fellow Republican members is doing her no favors.  —  As House Republicans try to move past the rifts demonstrated during their three-week speakership quagmire … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-shows-congress-how-to-lose-friends-and-not-influence-people"
  },
  {
    "text": "Eye Opener: Former President Donald Trump clashes with judge in New York fraud trial  —  Former President Donald Trump takes the stand in his New York fraud trial, appearing to dodge questions and lashing out at the judge as prosecutors make their case.  Also, one month into Israel's war with Hamas … ",
    "url": "https://www.cbsnews.com/video/eye-opener-former-president-donald-trump-clashes-with-judge-in-new-york-fraud-trial/"
  },
  {
    "text": "Montana Democrat Jon Tester's First TV Spot Highlights His Roots in the State  —  He's reprising a theme that worked for him in 2018 as he gears up for his toughest race yet  —  Democratic Sen. Jon Tester, the last remaining statewide elected Democrat in Montana, is facing the toughest race of his career.",
    "url": "https://themessenger.com/politics/montana-democrat-jon-testers-first-tv-spot-highlights-his-roots-in-the-state"
  },
  {
    "text": "Criminalizing dissent  —  Sixty-one activists appeared before Fulton County Court yesterday on racketeering charges related to their protest of Atlanta's new “Public Safety Training Center,” commonly known as Cop City.  The arraignment comes after the Georgia Attorney General's Office alleged … ",
    "url": "https://popular.info/p/criminalizing-dissent"
  },
  {
    "text": "Behind the Hunter Biden Investigation: Mistrust, Mutual Suspicion, Delays  —  Special Counsel David Weiss will defend his probe with lawmakers behind closed doors  —  The yearslong criminal investigation into Hunter Biden has aired a lot of dirty laundry about the president's son's attempts … ",
    "url": "https://www.wsj.com/us-news/behind-the-hunter-biden-investigation-mistrust-mutual-suspicion-delays-11ac16a5?mod=followamazon"
  },
  {
    "text": "Dems see a big upside to Johnson's conservative funding push  —  The new speaker has leaned into the right flank's spending crusade, giving House Democrats plenty of election messaging on cuts to education, Amtrak, LGBTQ policies and abortion rights.  —  House Democrats were already attacking … ",
    "url": "https://www.politico.com/news/2023/11/07/dems-upside-johnson-conservative-funding-push-00125486"
  },
  {
    "text": "Larry Hogan's PAC releases presidential-style ad focused on foreign policy  —  Former Maryland Republican Gov. Larry Hogan's PAC released a new advertisement Tuesday focused on foreign policy, namely toward Israel and Ukraine.  The video's presidential style also added fuel to speculation … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/larry-hogan-pac-presidential-style-ad-foreign-policy"
  },
  {
    "text": "Capitol Hill Targets Legacy Preferences for College Admissions  —  Bipartisan bill comes amid scrutiny of diversity and fairness after Supreme Court decision  —  WASHINGTON—Senators are taking fresh aim at legacy and donor preferences for admission to college, as advantages given … ",
    "url": "https://www.wsj.com/us-news/education/capitol-hill-targets-legacy-preferences-for-college-admissions-f827125f?mod=followamazon"
  }
]