[
  {
    "text": "Mike Johnson's Wife Runs Counseling Service That Compares Being Gay To Bestiality, Incest  —  The newly elected Republican House speaker and his wife, Kelly, have long intertwined their political and business lives.  —  LOADING  —  The wife of newly elected House Speaker Mike Johnson … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-wife-homosexuality-bestiality-incest_n_653abfb6e4b00110fef0462e"
  },
  {
    "text": "For Mike Johnson, Religion Is at the Forefront of Politics and Policy  —  The new House speaker has put his faith at the center of his political career, and aligned himself with a newer cohort of conservative Christianity that some describe as Christian nationalism.",
    "url": "https://www.nytimes.com/2023/10/27/us/politics/mike-johnson-speaker-religion.html"
  },
  {
    "text": "Not an accidental speaker: How Mike Johnson positioned himself for the gavel  —  The Louisianan has long ensured he is in line ideologically with the hard right without going to tactical extremes.  —  Much of the media has regarded Mike Johnson's two-day-old speakership as something of an accident of history.",
    "url": "https://www.politico.com/news/2023/10/27/how-mike-johnson-positioned-himself-for-the-gavel-00124050"
  },
  {
    "text": "Biden takes swipe at Trump, GOP at fundraiser: ‘Democracy is at stake in 2024’  —  President Biden made the stakes of the 2024 election clear for his supporters at a campaign fundraiser in Washington on Friday, taking a shot at his likely opponent, former President Trump.",
    "url": "https://thehill.com/homenews/campaign/4281141-biden-trump-democracy-at-stake-in-2024/"
  },
  {
    "text": "Biden asks ‘who the hell’ needs a high-capacity assault weapon after Maine shooting  —  President Biden questioned the need for high-capacity magazines for assault weapons on Friday, amid calls for new gun control legislation after a mass shooting in Maine.  —  “Who the hell needs … ",
    "url": "https://thehill.com/homenews/administration/4280952-biden-high-capacity-assault-weapons-maine-shooting/"
  },
  {
    "text": "Live updates |  Palestinian officials say death toll rises from expanded Israel military operation  —  Mother and newborn in Gaza suffering due to lack of milk and diapers  —  Israel says Hamas uses Gaza hospitals for protection  —  Israel launched an expanded ground operation on Saturday … ",
    "url": "https://apnews.com/article/israel-hamas-war-live-updates-10-28-2023-3348f0544aa6d66b280c8cab1637a3db"
  },
  {
    "text": "Misinformation is flowing ahead of Ohio abortion vote.  Some is coming from a legislative website  —  The inflammatory language targeting a reproductive rights measure on Ohio's fall ballot is the type of messaging that is common in the closing weeks of a highly contested initiative campaign … ",
    "url": "https://apnews.com/article/election-2023-ohio-abortion-amendment-misinformation-6b870f06abe5d70e8aa0a535b2e9dd1a"
  },
  {
    "text": "Ivanka Trump to testify Friday in the NY civil fraud trial - here's how she can hurt her father and brothers  — On Friday, Trump's NY fraud-trial judge ruled Ivanka Trump must testify next week.  — She had tried to quash her subpoena, saying it was overly broad and improperly served.",
    "url": "https://www.businessinsider.com/ivanka-trumps-ny-fraud-trial-testimony-can-hurt-donald-trump-2023-10?op=1"
  },
  {
    "text": "Johnson's speakership win fails to end House GOP infighting  —  The centrist vs. conservative spending fight is rearing its head again.  New York Republicans are pushing to expel George Santos.  Matt Gaetz is still openly taking aim at Kevin McCarthy and others.",
    "url": "https://www.politico.com/news/2023/10/27/spending-gaetz-santos-house-gop-infighting-00124049"
  },
  {
    "text": "Faced with abortion bans, doctors beg hospitals for help with key decisions  —  Vague state laws, and a lack of guidance on how to interpret them, have led to some patients being denied care until they are critically ill  —  Amelia Huntsberger pulled up a list of the top administrators … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/28/abortion-bans-medical-exceptions/"
  },
  {
    "text": "Colorado Man Sentenced on Felony and Misdemeanor Charges for Actions During Jan. 6 Capitol Breach  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  Defendant Hit Capitol Police Officer with Wooden 2x4 Plank  —  WASHINGTON - A Colorado man was sentenced today … ",
    "url": "https://www.justice.gov/usao-dc/pr/colorado-man-sentenced-felony-and-misdemeanor-charges-actions-during-jan-6-capitol"
  },
  {
    "text": "US Freezes Gun Exports, Reviews Backing of Firearm Industry  — Commerce wants to ensure it's not undermining policy interests  — Action follows Bloomberg investigation documenting federal aid  —  The Commerce Department is halting exports of most US-made firearms for 90 days … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-28/us-freezes-gun-exports-reviews-its-backing-of-firearm-industry"
  },
  {
    "text": "State rep. pays tribute to men acquitted in governor kidnap plot  —  ALLEGAN, Mich. (WOOD) — A West Michigan state legislator paid tribute Friday to two men acquitted in the failed plot to kidnap Gov. Gretchen Whitmer, with Rep. Rachelle Smit saying she was doing so on behalf of the state.",
    "url": "https://www.woodtv.com/news/allegan-county/state-rep-pays-tribute-to-men-acquitted-in-governor-kidnap-plot/"
  },
  {
    "text": "Chemical crisis: The unseen toxic threat contaminating wildlife worldwide  —  An unseen but growing chemical contamination crisis is threatening wildlife across all seven continents, exacerbating a host of environmental threats they're already facing.  —  Plastic pollution in the oceans … ",
    "url": "https://thehill.com/opinion/energy-environment/4279490-chemical-crisis-the-unseen-toxic-threat-contaminating-wildlife-worldwide/"
  }
]