[
  {
    "text": "Ann Coulter Breaks Down Why Trump Can't Beat Biden and ‘Trump Voters Are Morons’  —  Conservative pundit Ann Coulter expressed her frustration with Republican Trump voters over the weekend and made the case for why she doesn't believe the former president can beat President Joe Biden in a general election.",
    "url": "https://www.mediaite.com/politics/ann-coulter-breaks-down-why-trump-cant-beat-biden-and-trump-voters-are-morons/"
  },
  {
    "text": "Election 2024: Iowa caucuses will test Trump's grip on Republican politics  —  Trump wins Iowa caucuses in crucial victory at the outset of the Republican presidential campaign  —  Survey shows a majority of caucus-goers say they identify with Trump's ‘Make America Great Again’",
    "url": "https://apnews.com/article/trump-iowa-caucus-haley-desantis-cold-voting-begins-0af10f1ba21d488af54776b2c8d4028c"
  },
  {
    "text": "AP VoteCast: Iowa caucusgoers want big changes, see immigration as more important than the economy  —  WASHINGTON (AP) — Iowa Republicans are headed to their state's caucuses Monday with a greater desire to focus on immigration than address the health of the U.S. economy … ",
    "url": "https://apnews.com/article/iowa-caucus-who-voted-how-poll-votecast-4d1d5eb89b32fbba3afedee90334148c"
  },
  {
    "text": "Live updates: DeSantis and Haley race for second place in Iowa  —  Donald Trump has won Iowa's leadoff presidential caucuses.  The former president's victory gives him a strong start in the race for the 2024 Republican presidential nomination as the contest moves to New Hampshire.",
    "url": "https://apnews.com/live/iowa-republican-caucuses-live-updates#0000018d-0fea-d051-a3bd-dffe2b310000"
  },
  {
    "text": "Trump says he is ‘honored,’ ‘invigorated’ after winning Iowa caucuses: ‘We want to Make America Great Again’  —  EXCLUSIVE: Former President Trump said he feels “invigorated” and “greatly honored” after winning the 2024 Iowa caucuses, telling Fox News Digital that he feels “strong” for our country.",
    "url": "https://www.foxnews.com/politics/trump-says-he-is-honored-invigorated-after-winning-iowa-caucuses-make-america-great-again"
  },
  {
    "text": "Vivek Ramaswamy Crosses Trump Just in Time for Iowa Caucus  —  Trump and his team finally recognized the grandest conspiracy of all: If you were trying to steal votes directly from Trump, you'd run a campaign like Ramaswamy.  —  URBANDALE, Iowa—Before talking to a crowd of Iowa retirees … ",
    "url": "https://www.thedailybeast.com/vivek-ramaswamy-crosses-trump-just-in-time-for-iowa-caucus"
  },
  {
    "text": "Key Trump Lawyer Withdraws as Manhattan Criminal Trial Nears  —  Joseph Tacopina brought extensive experience with high-profile cases to former president Donald J. Trump's legal team.  —  Joseph Tacopina, the trial lawyer on Donald J. Trump's legal team with the most successes defending high-profile clients … ",
    "url": "https://www.nytimes.com/2024/01/15/us/politics/tacopina-trump-lawyer.html"
  },
  {
    "text": "Trump lawyer Joe Tacopina withdraws from ex-president's cases  —  Joe Tacopina, one of former President Trump's New York trial lawyers who is known for representing high-profile clients, is withdrawing from Trump's cases.  —  Tacopina had represented Trump in both his criminal hush money case … ",
    "url": "https://thehill.com/regulation/court-battles/4409344-trump-lawyer-joe-tacopina-withdraws-from-ex-presidents-cases/"
  },
  {
    "text": "Explosions reported near US Consulate in Iraq; Iran claims responsibility  —  Iran's Revolutionary Guard claimed it was targeting “the headquarters of spies.”  —  This is a breaking news story please check back for updates.  —  Several explosions were reported near the U.S. Consulate in Erbil … ",
    "url": "https://abcnews.go.com/International/explosions-reported-us-consulate-iraq-iran-claims-responsibility/story?id=106390671"
  },
  {
    "text": "Iran's Guards attack ‘espionage centers’ in Iraq's Erbil - state media  —  Iran's Revolutionary Guards said they attacked espionage centers and “gatherings of anti-Iranian terrorist groups” near Iraq's northern city of Erbil with ballistic missiles, Iranian state media said late on Monday.",
    "url": "https://www.reuters.com/world/middle-east/irans-revolutionary-guards-say-they-have-attacked-espionage-centers-iraqs-erbil-2024-01-15/"
  },
  {
    "text": "Nota Bene  —  Keep an eye on how the national press covers this.  The White House, as you know, has been under immense pressure to offer concessions to address the continuing large number of migrants coming to the US-Mexico border.  Now there's a bipartisan compromise bill in the Senate.",
    "url": "https://talkingpointsmemo.com/edblog/nota-bene-7"
  },
  {
    "text": "The Baltimore Sun purchased by Sinclair's David D. Smith  —  The Baltimore Sun, the largest newspaper in Maryland, has been acquired in a private deal by David D. Smith, executive chairman of Hunt Valley-based television station owner Sinclair Inc.  —  Smith said Monday that he acquired Baltimore Sun Media … ",
    "url": "https://www.baltimoresun.com/2024/01/15/baltimore-sun-media-sold-david-d-smith/"
  },
  {
    "text": "Iowa Caucus Results  —  Donald J. Trump wins the Iowa Republican caucus.  —  Race called by The Associated Press.  —  Latest results from just now  —  39% of votes in  —  Republican Caucus  —  Candidate Votes  —  Pct.  Delegates Del.  —  23,736  —  52.8%  —  8,994  —  20.0%",
    "url": "https://www.nytimes.com/interactive/2024/01/15/us/elections/results-iowa-caucus.html"
  },
  {
    "text": "State of the Nations: Canadians fear for the impacts of another Trump term as U.S. Election 2024 looms  —  Half say United States may be on its way to becoming an authoritarian state  —  The 2024 American Presidential election looks starkly familiar to the 2020 edition … ",
    "url": "https://angusreid.org/us-canada-democracy-authoritarianism-trump-biden-2024-presidential-election/"
  },
  {
    "text": "Nikki Haley Refuses to Say a Man Cannot Become a Woman During Campaign Event  —  The Iowa Caucus is just hours away and social issues seem to be top of mind for at least some voters in the Hawkeye State.  —  Extreme weather conditions in Iowa limited the 2024 GOP hopefuls to mostly virtual events … ",
    "url": "https://www.megynkelly.com/2024/01/15/nikki-haley-can-a-man-become-a-woman-iowa/"
  },
  {
    "text": "FBI's MLK Jr. Tweet Gets Truly Epic Community Note … LOADING",
    "url": "https://www.huffpost.com/entry/fbi-mlk-tweet-community-note_n_65a5bc5ae4b01a497bab5d2d"
  },
  {
    "text": "Dean Phillips floats a Cabinet post for Musk or Ackman  —  The representative spoke with the tech giant and his allies on a forum Monday night.  —  In a forum with Elon Musk on Monday afternoon, Democratic presidential primary challenger Dean Phillips floated a possible Cabinet post for the billionaire and his tech allies.",
    "url": "https://www.politico.com/news/2024/01/15/dean-phillips-floats-a-cabinet-post-for-musk-or-ackman-00135640"
  },
  {
    "text": "DeSantis Has Enough Cash to Sustain 2024 Bid Into March, Adviser Says  — Roy Bailey predicts DeSantis will ‘shock’ the world in Iowa  — DeSantis team is seeking to quell worries about fundraising  —  Ron DeSantis has enough cash to sustain his 2024 US presidential bid past Monday's … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-15/desantis-has-cash-to-sustain-2024-bid-into-march-adviser-says"
  }
]