[
  {
    "text": "Pro-Israel Agitator Shouts ‘Kill the Jews,’ Gets Everyone Else Arrested  —  HATE SPEECH  —  Around 100 protesters were arrested on Saturday at a pro-Palestine encampment at Northeastern University, but not the one whose hate speech got everything shut down.",
    "url": "https://www.thedailybeast.com/pro-israel-agitator-shouts-kill-the-jews-gets-everyone-else-arrested"
  },
  {
    "text": "Kremlin Disputes Report Putin Didn't Order Navalny's Death  —  OWNING UP?  —  Dmitry Peskov said the report had “very empty reasoning.”  —  Russia has dismissed a report claiming Vladimir Putin did not order the killing of famed dissident Alexei Navalny, who died in an Arctic prison in February.",
    "url": "https://www.thedailybeast.com/kremlin-disputes-report-vladimir-putin-didnt-order-alexei-navalnys-death"
  },
  {
    "text": "Dems, GOP bash Kristi Noem for shooting her dog  —  The South Dakota governor has seen her political caché skyrocket in recent years and is reportedly a top contender to become Donald Trump's 2024 running mate.  —  Both Democrats and Republicans are piling on after South Dakota … ",
    "url": "https://www.politico.com/news/2024/04/27/dems-gop-bash-kristi-noem-memoir-00154789"
  },
  {
    "text": "Shocker From Top Conservative Judge: Trump Likely To Skate Completely  —  “I'm profoundly disturbed about the apparent direction of the court,” J. Michael Luttig told me.  “I now believe that it is unlikely Trump will ever be tried for the crimes he committed in attempting to overturn the 2020 election.”",
    "url": "https://newrepublic.com/article/181059/luttig-trump-january-6-case"
  },
  {
    "text": "Biden will give election-year roast at annual correspondents' dinner as protests await over Gaza war  —  An election-year roast of President Joe Biden before journalists, celebrities and politicians at the annual White House correspondents' dinner Saturday butted up against growing public discord … ",
    "url": "https://apnews.com/article/biden-white-house-correspondents-dinner-colin-jost-5843271c1d3a868d700cfc525ddc7f8d"
  },
  {
    "text": "A ‘coat hanger’ could unlock Mar-a-Lago storage room where Trump stored classified docs: Witness  —  The account was relayed to FBI agents by an unidentified aide to Trump.  —  In this March 5, 2024, file photo, Republican presidential candidate, former President Donald Trump attends … ",
    "url": "https://abcnews.go.com/US/coat-hanger-unlock-mar-lago-storage-room-trump/story?id=109716197"
  },
  {
    "text": "Harvey Weinstein Isn't Alone.  Our Institutions Are Rapists  —  VOTE THEM OUT  —  In state after state, governments dominated by white men are dehumanizing and taking ownership over women's bodies.  Every branch of our government commodifies and devalues women.",
    "url": "https://www.thedailybeast.com/alyssa-milano-harvey-weinstein-isnt-alone-our-institutions-are-rapists"
  },
  {
    "text": "Arizona Dem says state is bluer ‘not because Arizona is necessarily a blue state,’ but from distaste for GOP ‘extremism’  — An Arizona lawmaker says GOP “extremism” has led many state voters to increasingly back Democrats.  — “The Republican party has become extreme in the age of Trumpism,” the state senator told Politico.",
    "url": "https://www.businessinsider.com/arizona-extreme-gop-abortion-ban-trump-biden-2024-4"
  },
  {
    "text": "Press Conference: Under Israeli Pressure, Guinea Bissau Moves to Withdraw Flotilla Flags  —  ISTANBUL, TÜRK&Iabove;YE:  —  On Thursday afternoon, the Freedom Flotilla Coalition was contacted by the Guinea Bissau International Ships Registry (GBISR), requesting an inspection of our lead ship - Akdenez.",
    "url": "https://freedomflotilla.org/2024/04/27/press-conference-under-israeli-pressure-guinea-bissau-moves-to-withdraw-flotilla-flags/"
  },
  {
    "text": "Progressive NY Rep. Jamaal Bowman duped by fake ‘Chief rabbi of Gaza’  —  Rep. Jamaal Bowman and his campaign were duped by the parody social-media account of the fake “Chief Rabbi of Gaza.”  —  The phony X account of “Rabbi Linda Goldstein” is infamous for spouting anti-Zionist vitriol … ",
    "url": "https://nypost.com/2024/04/27/us-news/progressive-ny-rep-jamaal-bowman-duped-by-fake-rabbi-of-gaza/"
  },
  {
    "text": "Mastodon forms new U.S. non-profit  —  As part of our commitment to supporting the growth and operational capabilities of Mastodon, we have established a 501(c)(3) non-profit entity in the United States aimed at facilitating our efforts, including being able to receive tax-deductible U.S. donations and in-kind support.",
    "url": "https://blog.joinmastodon.org/2024/04/mastodon-forms-new-u.s.-non-profit/"
  },
  {
    "text": "Trump on trial: Personal anguish, political defiance and a loss of control  —  The former president has tried to campaign during his New York trial, but it's constraining him  —  NEW YORK — For 20 minutes Donald Trump campaigned like everything was normal.",
    "url": "https://www.washingtonpost.com/elections/2024/04/27/trump-trial-election-2024-campaign/"
  },
  {
    "text": "Exclusive: Some US officials say in internal memo Israel may be violating international law in Gaza  —  Some senior U.S. officials have advised Secretary of State Antony Blinken that they do not find “credible or reliable” Israel's assurances that it is using U.S.-supplied weapons in accordance … ",
    "url": "https://www.reuters.com/world/middle-east/some-us-officials-say-internal-memo-israel-may-be-violating-international-law-2024-04-27/"
  },
  {
    "text": "Harvey Weinstein hospitalized after his return to New York from upstate prison  —  Harvey Weinstein's lawyer said Saturday that the onetime movie mogul has been hospitalized for a battery of tests after his return to New York City following an appeals court ruling nullifying his 2020 rape conviction.",
    "url": "https://apnews.com/article/weinstein-hospital-rikers-bellevue-conviction-12b765ba6ec3b9522d2ff5ed46cc7af6"
  }
]