[
  {
    "text": "Why the Polls Might Be Wrong — in Kamala Harris' Favor  —  It's taken pollsters eight years to pin down Trump's voters.  Is 100 days really enough to accurately capture potential Harris voters?  —  For eight years, pollsters have been striving to accurately capture former President Donald Trump's level of support among voters.",
    "url": "https://www.politico.com/news/magazine/2024/11/01/shy-kamala-harris-voters-polling-00186653"
  },
  {
    "text": "How Harris or Trump Could Win This Deadlocked Presidential Race, in 19 Maps  —  The best evidence that American politics is deeply, stubbornly and immovably stuck is that the presidential race is back where it started in the Electoral College race for 270 votes, despite the work … ",
    "url": "https://www.nytimes.com/interactive/2024/11/01/opinion/harris-trump-electoral-college-prediction.html?unlocked_article_code=1.Wk4.5EAA.EktNU2c4wI2Q&smid=url-share"
  },
  {
    "text": "Hugh Hewitt quits Washington Post after storming off livestream talk over dispute with liberal columnists: 'I won't come back'  —  Conservative radio host Hugh Hewitt resigned from the Washington Post after he stormed off a livestreamed discussion on Friday amid a dispute … ",
    "url": "https://nypost.com/2024/11/01/media/hugh-hewitt-quits-washington-post-after-storming-off-broadcast/"
  },
  {
    "text": "Hugh Hewitt resigns from Washington Post after storming out of live interview  —  Hewitt abruptly left a live broadcast of the Post's show “First Look,” leaving the host and his fellow guest stunned.  —  Conservative radio host Hugh Hewitt resigned Friday from his columnist position at The Washington Post … ",
    "url": "https://www.politico.com/news/2024/11/01/hugh-hewitt-washington-post-00186778"
  },
  {
    "text": "Longtime Washington Post columnist Hugh Hewitt quits newspaper  —  Hewitt quit after walking off newspaper's ‘Washington Post Live’ show  —  Longtime Washington Post columnist Hugh Hewitt quit the newspaper on Friday, he told Fox News Digital.  —  Hewitt, a conservative who hosts … ",
    "url": "https://www.foxnews.com/media/longtime-washington-post-columnist-hugh-hewitt-quits-newspaper-after-seven-year-run"
  },
  {
    "text": "When You Thought He Couldn't Sink Lower  —  Donald Trump's two strongest personality traits each had a moment on the campaign trail yesterday.  —  At a rally in Albuquerque, New Mexico, the buffoon: “I'm here for one very simple reason.  I like you very much, and it's good for my credentials with the Hispanic and Latino community.”",
    "url": "https://www.thebulwark.com/p/when-you-thought-he-couldnt-sink"
  },
  {
    "text": "Trump Assails Liz Cheney and Imagines Guns ‘Shooting at Her’  —  Former President Donald J. Trump used violent imagery as he slammed one of his leading Republican critics while criticizing U.S. involvement in foreign conflicts.  —  Former President Donald J. Trump assailed Liz Cheney … ",
    "url": "https://www.nytimes.com/2024/11/01/us/politics/trump-liz-cheney-tucker-carlson.html"
  },
  {
    "text": "AP sources: White House altered record of Biden's ‘garbage’ remarks despite stenographer concerns  —  White House press officials altered the official transcript of a call in which President Joe Biden appeared to take a swipe at supporters of Donald Trump, drawing objections from the federal workers … ",
    "url": "https://apnews.com/article/biden-garbage-transcript-puerto-rico-trump-326e2f516a94a470a423011a946b6252"
  },
  {
    "text": "Trump targets Washington Post, CBS with long-shot legal actions over Harris coverage, ads … Days before the presidential election, Donald Trump and his campaign have launched legal actions against two major media outlets, claiming that they are illegally helping Kamala Harris through their news coverage and advertising.",
    "url": "https://www.cnbc.com/2024/11/01/trump-media-legal-action-fec-harris-election.html"
  },
  {
    "text": "How Risky Is a Trump Second Term?  —  He'd slow the left's coercive march, but his policies are likely to be a jump ball. … Unlimited access across all platforms and devices.",
    "url": "https://www.wsj.com/opinion/donald-trump-candidacy-2024-election-kamala-harris-f8f99a69"
  },
  {
    "text": "A Pregnant Teenager Died After Trying to Get Care in Three Visits to Texas Emergency Rooms  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Candace Fails screamed for someone in the Texas hospital to help her pregnant daughter.",
    "url": "https://www.propublica.org/article/nevaeh-crain-death-texas-abortion-ban-emtala"
  },
  {
    "text": "Liz Cheney Fires Back at Trump, Accuses Him of Threatening Her ‘With Death’ in Blistering Counter  —  Liz Cheney shot back at former President Donald Trump's comments from Thursday night, where he darkly floated a scenario where guns were firing at the former Republican Congressional leader and Kamala Harris supporter.",
    "url": "https://www.mediaite.com/politics/liz-cheney-fires-back-at-trumps-threatening-her-with-death-with-blistering-counter-attack/"
  },
  {
    "text": "Elon Musk's Machine for Fascism: A One-Stop Shop for Disinformation and Violence  —  Just over a year ago, I described how Twitter had been used as a way to sow false claims in support of Trump in 2016 and 2020.  —  I described how, in 2016, trolls professionalized their efforts … ",
    "url": "https://www.emptywheel.net/2024/11/01/elon-musks-machine-for-fascism-a-one-stop-shop-for-disinformation-and-violence/"
  },
  {
    "text": "Some Maga men seem to think women don't have rights - starting with their wives  —  The 2024 election is in part about whether women can be free and equal citizens of this republic.  Right now too many cannot  —  This week, the fundamentalist Christian pastor Dale Partridge argued in a series … ",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/01/maga-trump-men-supporters-womens-rights"
  },
  {
    "text": "Texas hospitals must now ask patients whether they're in the US legally.  Here's how it works  —  Texas hospitals must ask patients starting Friday whether they are in the U.S. legally and track the cost of treating people without legal status following an order by Republican Gov. Greg Abbott … ",
    "url": "https://apnews.com/article/texas-immigration-hospital-health-care-abbott-florida-aeee92d7515a18b492c737b3657569ab"
  },
  {
    "text": "Shifting $677m from the banks to the people, every year, forever (permalink)  —  “Switching costs” are one of the great underappreciated evils in our world: the more it costs you to change from one product or service to another, the worse the vendor, provider, or service you're using today can treat you without risking your business.",
    "url": "https://pluralistic.net/2024/11/01/bankshot/#personal-financial-data-rights"
  },
  {
    "text": "Donald Trump Is Done With Checks and Balances  —  What does it mean to say that “democracy is on the ballot” on Election Day?  —  In her speech on Tuesday in Washington, D.C., delivered from the same place near the White House where Donald Trump incited a crowd to attack the Capitol on Jan. 6 … ",
    "url": "https://www.nytimes.com/2024/11/01/opinion/donald-trump-kamala-harris-election-power.html?unlocked_article_code=1.Wk4.S1lK.O7tbymT0gllX&smid=url-share"
  },
  {
    "text": "‘All hell has broken loose’: Inside Elon Musk's high-stakes pro-Trump door-knocking effort  —  More than a half-dozen operatives and canvassers connected to America PAC described an inordinate number of suspect entries and having to canvass during Hurricane Helene.",
    "url": "https://www.nbcnews.com/politics/2024-election/elon-musks-high-stakes-trump-door-knocking-effort-america-pac-rcna176255?taid=6724d0249f2d880001f6fdb4"
  },
  {
    "text": "Listen to Jeffrey Epstein Spill Intel on Donald Trump's White House  —  OH LORDY  —  A new recording captures Epstein dishing on Trump.  —  Michael Wolff, the explosive chronicler of Donald Trump's four years in the White House, has released what he says is a recording of Jeffrey Epstein … ",
    "url": "https://www.thedailybeast.com/listen-to-jeffrey-epstein-spill-intel-on-donald-trumps-white-house-on-tape-released-by-author-michael-wolff/"
  },
  {
    "text": "Mishaps in Michigan spur spread of misleading election claims  —  In the closely watched battleground state of Michigan, election officials are under the microscope, with isolated mistakes or missteps serving as fodder for election deniers to lay the groundwork for widespread doubt of election results.",
    "url": "https://www.cnn.com/2024/11/01/politics/viral-incidents-spur-misleading-election-claims-invs/"
  },
  {
    "text": "Justice Department to Monitor Polls in 27 States for Compliance with Federal Voting Rights Laws  —  For Immediate Release  —  Civil Rights Division Staff Available to Receive Nationwide Reports Throughout Election Day  —  The Justice Department announced today that it plans to monitor compliance … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-monitor-polls-27-states-compliance-federal-voting-rights-laws"
  },
  {
    "text": "Schumer gives a Senate Democratic forecast — including a Nebraska independent  —  Senate Majority Leader Chuck Schumer told a group of supporters this week that he believed Democrats could pick up three seats next week — including Nebraska, where independent candidate Dan Osborn has distanced himself from the party.",
    "url": "https://www.politico.com/live-updates/2024/11/01/2024-elections-live-coverage-updates-analysis/schumer-osborn-nebraska-senate-00186766"
  },
  {
    "text": "“Voter Report Card” mailings described as “creepy” and “insulting,” defended as effective tool  —  Julia Ramsey is used to a deluge of election-related mail.  Campaign mailings have clogged her Pennsylvania mailbox day after day for months, but one she received this week stood out from the rest.",
    "url": "https://www.cbsnews.com/news/voter-report-card-mailings-described-as-creepy-and-insulting-defended-as-effective-tool/"
  },
  {
    "text": "What Happens When Trump Exploits Your Daughter's Murder  —  When Mollie Tibbetts was killed by an undocumented immigrant, Trump tried to hijack her story.  Her mom says his divisiveness “has got to stop”  —  BROOKLYN, Iowa — It's been more than six years since Mollie Tibbetts … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-exploits-daughter-mollie-tibbetts-murder-1235149834/"
  },
  {
    "text": "Donald Trump's campaign of relentless lying  —  The United States that Donald Trump describes in his rally speeches would be pretty bad if it actually existed.  —  Schools secretly sending children for gender-affirming surgeries without parental consent.  Towns and even cities conquered by illegal immigrants.",
    "url": "https://www.cnn.com/2024/11/01/politics/analysis-donald-trumps-campaign-of-relentless-lying/"
  }
]