[
  {
    "text": "5 takeaways from the Republican Iowa caucuses  —  Former president Donald Trump won the Iowa caucuses Monday in the first step toward the 2024 Republican presidential nomination, keeping him on course for the coronation that has looked likely for months.  —  With an estimated 88 percent of the vote in … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/15/iowa-results-2024-takeaways/"
  },
  {
    "text": "New York's Top Court Denies Trump's Gag Order Appeal  —  ‘No substantial constitutional question is directly involved,’ the ruling reads following a lower court upholding the gag order  —  The New York Court of Appeals has shot down an appeal from Donald Trump against a gag order issued in his civil fraud trial.",
    "url": "https://themessenger.com/politics/new-york-court-denies-trump-gag-order-appeal"
  },
  {
    "text": "No more going wobbly in climate fight, Trump supporters vow  —  For all his bombast, the former president's agencies hesitated to rewrite federal climate reports or install loyalists atop key science agencies.  Some of his allies expect that to change.  —  Former President Donald Trump pulled … ",
    "url": "https://www.politico.com/news/2024/01/12/trump-second-term-climate-science-2024-00132289"
  },
  {
    "text": "Europe prepares to stand alone as Trump returns  —  Disruptions to trade and security feared as Trump's Iowa caucus victory sets him on track to win Republican presidential nomination.  —  STRASBOURG — Belgian Prime Minister Alexander De Croo warned that Europe must be ready to stand alone … ",
    "url": "https://www.politico.eu/article/europe-prepares-stand-alone-as-us-trump-returns-2024-elections/"
  },
  {
    "text": "Iowa was Trump's to win.  Can anyone stop his march to the nomination?  —  The race for the Republican nomination heads to New Hampshire, where the pressure is on for Nikki Haley or Ron DeSantis to wrest a win from the former president  —  DES MOINES — Iowa was never destined to surprise.",
    "url": "https://www.washingtonpost.com/politics/2024/01/15/trumps-iowa-victory-analysis/"
  },
  {
    "text": "New York high court denies Trump appeal of fraud case gag order  —  New York's top court has dismissed former President Trump's appeal of a gag order imposed in his civil fraud trial, which came to a close last week.  —  The New York Court of Appeals tossed the challenge because it involved no … ",
    "url": "https://thehill.com/regulation/court-battles/4411393-new-york-court-trump-appeal-fraud-case-gag-order/"
  },
  {
    "text": "Iowa Caucus Results  —  Donald J. Trump wins the Iowa Republican caucus.  —  Race called by The Associated Press.  —  Latest results from just now  —  39% of votes in  —  Republican Caucus  —  Candidate Votes  —  Pct.  Delegates Del.  —  23,736  —  52.8%  —  8,994  —  20.0%",
    "url": "https://www.nytimes.com/interactive/2024/01/15/us/elections/results-iowa-caucus.html"
  },
  {
    "text": "‘Scared to death’: Local election officials on edge ahead of 2024 vote  —  America's frontline election workers are bracing for another torrent of conspiracy theories and attacks from election deniers.  —  Election officials across the U.S. are confident they can overcome foreign … ",
    "url": "https://www.politico.com/news/2024/01/16/election-officials-fears-2024-00135378"
  },
  {
    "text": "GOP Rep Blasts Speaker Johnson's Staff For Giving Him ‘Terrible Counsel’ (Exclusive)  —  ‘His staff is undermining his confidence,’ Rep. Matt Rosendale told The Messenger, adding, ‘I think they all should be fired’  —  Montana GOP Rep. Matt Rosendale believes House Speaker Mike Johnson wants … ",
    "url": "https://themessenger.com/politics/gop-rep-blasts-speaker-johnsons-staff-for-giving-him-terrible-counsel-exclusive"
  },
  {
    "text": "NEW: Capitol Police Investigating Roger Stone Remarks About Assassinating Members of Congress  —  The Capitol Police are investigating remarks made by pro-Trump political operative Roger Stone discussing the assassination of two prominent House Democrats.  A source told Mediaite the FBI is aiding with the investigation.",
    "url": "https://www.mediaite.com/trump/new-capitol-police-investigating-roger-stone-remarks-about-assassinating-members-of-congress/"
  },
  {
    "text": "Wyden, Smith Announce Agreement on Tax Framework to Help Families and Main Street Businesses  —  Three-Year Proposal Would Help Families, Spur Innovation, Improve Economic Competitiveness, Boost Affordable Housing  —  Washington, D.C. - Senate Finance Committee Chairman Ron Wyden (D-Ore.) … ",
    "url": "https://www.finance.senate.gov/chairmans-news/wyden-smith-announce-agreement-on-tax-framework-to-help-families-and-main-street-businesses"
  },
  {
    "text": "Sen. Bob Menendez and his wife seek separate trials in bribery case  —  Menendez and his wife have pleaded not guilty to charges alleging they accepted hundreds of thousands of dollars in exchange for the senator's influence in order to benefit three New Jersey businessmen and the Egyptian government.",
    "url": "https://www.nbcnews.com/politics/congress/sen-bob-menendez-wife-seek-separate-trials-bribery-case-rcna134059"
  },
  {
    "text": "Post-Affirmative Action, Views on Admissions Differ by Race  —  WASHINGTON, D.C. — A Gallup Center on Black Voices survey finds that about two in three Americans (68%) say the Supreme Court's June 2023 ruling to end the use of race and ethnicity in university admission decisions is “mostly a good thing.”",
    "url": "https://news.gallup.com/poll/548528/post-affirmative-action-views-admissions-differ-race.aspx"
  },
  {
    "text": "USCENTCOM Seizes Iranian Advanced Conventional Weapons Bound for Houthis  —  TAMPA, Fla. - On 11 January 2024, while conducting a flag verification, U.S. CENTCOM Navy forces conducted a night-time seizure of a dhow conducting illegal transport of advanced lethal aid from Iran to resupply Houthi forces … ",
    "url": "https://www.centcom.mil/MEDIA/PRESS-RELEASES/Press-Release-View/Article/3645241/uscentcom-seizes-iranian-advanced-conventional-weapons-bound-for-houthis/"
  },
  {
    "text": "Federal Judge Blocks JetBlue's $3.8 Billion Acquisition of Spirit Airlines  —  Justice Department under Biden administration has taken tougher stand on airline consolidation  —  A federal judge on Tuesday blocked JetBlue Airways from acquiring Spirit Airlines , agreeing with the Justice Department … ",
    "url": "https://www.wsj.com/business/airlines/jetblue-spirit-airline-merger-blocked-4b2ba920?mod=followamazon"
  },
  {
    "text": "Nikki Haley Insists That America's ‘Never Been a Racist Country’  —  The 2024 candidate's declaration that the United States has never been racist comes just weeks after she omitted slavery as a cause of the Civil War.  —  A day after the United States honored the memory of civil rights leader … ",
    "url": "https://www.thedailybeast.com/nikki-haley-insists-to-fox-news-americas-never-been-a-racist-country"
  }
]