[
  {
    "text": "The Young, Inexperienced Engineers Aiding Elon Musk's Government Takeover  —  Engineers between 19 and 24, most linked to Musk's companies, are playing a key role as he seizes control of federal infrastructure.  —  Elon Musk's takeover of federal government infrastructure is ongoing … ",
    "url": "https://www.wired.com/story/elon-musk-government-young-engineers/"
  },
  {
    "text": "Musk Says DOGE Halting Treasury Payments to US Contractors  — Musk Calls USAID ‘a criminal organization’ that should ‘die’  — Billionaire expanding his reach across government spending  —  Elon Musk said his “DOGE team” of government efficiency enforcers is shutting down payments … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-02/musk-says-doge-is-rapidly-shutting-down-treasury-payments"
  },
  {
    "text": "USAID security leaders on leave after trying to keep Musk's DOGE from classified info, officials say  —  The Trump administration has placed two top security chiefs at the U.S. Agency for International Development on leave after they refused to turn over classified material in restricted areas … ",
    "url": "https://apnews.com/article/doge-musk-trump-classified-information-usaid-security-35101dee28a766e0d9705e0d47958611"
  },
  {
    "text": "Senior USAID security officials put on leave after refusing Musk's DOGE access to agency systems  —  Two top security officials at the US Agency for International Development were put on administrative leave Saturday night after refusing to allow officials from Elon Musk's Department … ",
    "url": "https://www.cnn.com/2025/02/02/politics/usaid-officials-leave-musk-doge/"
  },
  {
    "text": "Trump's Move to Put Tariff Hikes Ahead of Tax Cuts Has Spooked Almost Everyone  —  The president has an ambitious economic plan, starting with trade, and doesn't appear interested in negotiations—yet  —  WASHINGTON—President Trump's aggressive move to place tariffs on hundreds of billions … ",
    "url": "https://www.wsj.com/politics/policy/trumps-move-to-put-tariff-hikes-ahead-of-tax-cuts-has-spooked-almost-everyone-7b9b1813"
  },
  {
    "text": "Trudeau Announces Retaliatory Tariffs Against the U.S. … Where Things Stand  — Retaliation begins: A day after President Trump announced stiff tariffs on Mexico, Canada and China, the Canadian government detailed its own retaliatory 25 percent tariffs on more than $100 billion worth of U.S. goods … ",
    "url": "https://www.nytimes.com/live/2025/02/02/us/trump-tariffs"
  },
  {
    "text": "Dow futures drop more than 450 points after Trump hits U.S. trading partners with tariffs: Live updates  —  Stock futures tumbled Sunday night to kick off a new trading month, as investors weighed new U.S. tariffs on goods from key trade partners and their potential impact on the economy and corporate profits.",
    "url": "https://www.cnbc.com/2025/02/02/stock-market-today-live-updates.html"
  },
  {
    "text": "Top F.B.I. Agent in New York Vows to ‘Dig In’ After Removals at Agency  —  James E. Dennehy, the highly respected leader of the largest and most important field office in the bureau, said in an email to staff that the F.B.I. was in a “battle of our own.”  —  The top agent at the F.B.I.'s … ",
    "url": "https://www.nytimes.com/2025/02/02/us/politics/fbi-new-york-email-trump.html?unlocked_article_code=1.t04.JDug.6QRxLrLXK-8y&smid=url-share"
  },
  {
    "text": "Agents ‘have started to pack up their desks’ as fear of FBI mass firings swirls  —  Some agents have been sent a 12-question survey about their role in Jan. 6 cases.  An FBI agent group advised agents overall to “stay calm and refrain from making any statements.”",
    "url": "https://www.nbcnews.com/politics/national-security/agents-started-pack-desks-fear-fbi-mass-firings-swirls-rcna190342"
  },
  {
    "text": "MAGA intellectual Darren Beattie will fill key State Department role  —  The Scoop  —  Secretary of State Marco Rubio will appoint Darren Beattie, a speechwriter in President Donald Trump's first term, acting undersecretary of state for public diplomacy, two people briefed on the plans said.",
    "url": "https://www.semafor.com/article/02/02/2025/maga-intellectual-darren-beattie-will-fill-key-state-department-role"
  },
  {
    "text": "Trump administration taps controversial conservative journalist for top job  —  Darren Beattie is the acting under secretary in a top State Department role.  —  A sign for the U.S. Department of State is captured on the outside of the Harry S. Truman Federal Building on Oct. 8, 2024 in Washington, D.C.",
    "url": "https://abcnews.go.com/US/trump-administration-taps-controversial-conservative-journalist-top-job/story?id=118369945"
  },
  {
    "text": "Trump to cut off all future funding to South Africa  —  U.S. President Donald Trump said on Sunday that he would cut off all future funding to South Africa because he claimed, without evidence, that “certain classes of people” were being treated “very badly.”",
    "url": "https://www.reuters.com/world/africa/trump-cut-off-all-future-funding-south-africa-2025-02-02/"
  },
  {
    "text": "Trump Vows to Cut Off Aid to South Africa Over Land Policy  —  President Donald Trump said the US would stop sending aid to South Africa over its land expropriation policies, sparking a selloff in the rand.  —  “The United States won't stand for it, we will act,” Trump said in a Sunday evening post on Truth Social.",
    "url": "https://www.bloomberg.com/news/articles/2025-02-02/trump-pledges-to-cut-aid-to-south-africa-over-land-expropriation"
  },
  {
    "text": "ICE raided his family's North Philly car wash. Here is Jeffrey Lee's account of what happened.  —  Jeffrey Lee, 35, was en route to his family's business, Complete Autowash Philly, when a call came through his car's speaker.  The caller ID read “Dad” but there was an ICE agent on the other end … ",
    "url": "https://www.inquirer.com/news/philadelphia/ice-raid-account-north-philly-car-wash-20250202.html"
  },
  {
    "text": "The Logic of Destruction  —  What is a country?  The way its people govern themselves.  America exists because its people elect those who make and execute laws.  The assumption of a democracy is that individuals have dignity and rights that they realize and protect by acting together.",
    "url": "https://snyder.substack.com/p/the-logic-of-destruction"
  },
  {
    "text": "Union official says Education Department employees were placed on leave after taking diversity training during Trump's first term  —  A letter to the affected employees obtained by NBC News said they would continue to receive their full salaries and benefits and would not be required to do any work-related tasks.",
    "url": "https://www.nbcnews.com/politics/donald-trump/union-official-education-department-employees-leave-dei-training-rcna190337"
  },
  {
    "text": "Why Write About the Illegality of What Trump and Musk are Doing?  —  NYU Law professor Noah Rosenblum posted on Bluesky yesterday that “[t]here has never been a larger gap in my (admittedly quite short) professional life between how lay folks and law profs are talking about what is happening in government right now.",
    "url": "https://buttondown.com/sbagen/archive/why-write-about-the-illegality-of-what-trump-and/"
  },
  {
    "text": "Rubio says Panama must reduce Chinese influence around the canal or face possible US action  —  U.S. Secretary of State Marco Rubio brought a warning to Panamanian leader José Raúl Mulino on Sunday: Immediately reduce what President Donald Trump says is Chinese influence … ",
    "url": "https://apnews.com/article/panama-rubio-trump-canal-mulino-illegal-immigration-f159e218e66812bc0e462d8fb8bb5b5f"
  },
  {
    "text": "Sen. McConnell on what he'll do as President Trump shakes up Washington with an onslaught of executive orders  —  Sen. Mitch McConnell, after stepping down from his Senate leadership position, bucked President Trump and was one of only three Republicans to vote against the president's nominee for defense secretary.",
    "url": "https://www.cbsnews.com/news/mitch-mcconnell-trump-relationship-60-minutes/"
  }
]