[
  {
    "text": "US, Colombia clash over deportations and raise tariffs in show of Trump's pledge to limit migration  —  The White House claimed victory in a showdown with Colombia over accepting flights of deported migrants from the U.S. on Sunday, hours after President Donald Trump threatened steep tariffs … ",
    "url": "https://apnews.com/article/colombia-immigration-deportation-flights-petro-trump-us-67870e41556c5d8791d22ec6767049fd"
  },
  {
    "text": "Trump's Colombia tariffs threaten surge in coffee prices … - Coffee futures are up 45% in the last six months.  — Bloomberg reported last week that wholesale prices recently eclipsed all-time highs set in the late 1970s, and that it was only a matter of days to a few weeks until retail prices followed suit.",
    "url": "https://www.axios.com/2025/01/26/trump-colombia-tariffs-coffee"
  },
  {
    "text": "Trump to Hold Off on 25% Colombia Tariffs, Reaches Deal on Migrants  —  US President Donald Trump will hold off on imposing threatened tariffs and sanctions on Colombia after reaching a deal on the return of deported migrants, the White House said.  —  The South American nation … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-27/us-to-hold-off-on-colombia-tariffs-white-house-says"
  },
  {
    "text": "Brazil slams US after dozens of deportees arrive handcuffed  —  Douglas Magno with Facundo Fernandez Barrio in Sao Paolo  —  Brazil's government expressed outrage on Saturday after dozens of immigrants deported from the United States arrived by plane in handcuffs, calling it a “flagrant disregard” for their rights.",
    "url": "https://uk.news.yahoo.com/brazil-slams-us-dozens-deportees-065725919.html"
  },
  {
    "text": "Trump issuing ‘emergency 25% tariffs’ against Colombia after country turned back deportation flights  —  President Donald Trump on Sunday announced retaliatory tariffs on Colombia after its president said he blocked US military deportation flights, the first instance of Trump using economic pressure … ",
    "url": "https://www.cnn.com/2025/01/26/politics/colombia-tariffs-trump-deportation-flights/"
  },
  {
    "text": "Trump Aides Want to Hit Mexico, Canada With Tariffs Before Talks  —  The 25% import levy could go into place as soon as Feb. 1  —  Momentum is growing among President Trump's advisers to place 25% tariffs on Mexico and Canada as soon as Saturday, bucking conventional wisdom in Washington … ",
    "url": "https://www.wsj.com/world/americas/trump-aides-want-to-hit-mexico-canada-with-tariffs-before-talks-3ff27f14"
  },
  {
    "text": "Trump Hits Colombia With Tariffs in Feud Over Military Deportation Flights  —  Gustavo Petro said on X that the United States should not treat Colombian migrants as criminals and that he had already turned away U.S. military flights carrying deportees.  —  Colombia refused to accept military … ",
    "url": "https://www.nytimes.com/2025/01/26/world/americas/colombia-us-deportation-flights.html?unlocked_article_code=1.sE4.PSWj.vfudvzkGajXv"
  },
  {
    "text": "Trump wiped January 6 convicts' records clean.  Now his DOJ is wiping evidence of rioters' crimes from the internet  —  As President Donald Trump this week sought to rewrite the history of his supporters' attack on the US Capitol, a database detailing the vast array of criminal charges … ",
    "url": "https://www.cnn.com/2025/01/25/politics/january-6-justice-department-database/"
  },
  {
    "text": "Trump officials issue quotas to ICE officers to ramp up arrests  —  The administration wants to increase the number of arrests from a few hundred per day to at least 1,200 to 1,500, increasing the chances that non-criminals will be detained.",
    "url": "https://www.washingtonpost.com/immigration/2025/01/26/ice-arrests-raids-trump-quota/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3ODY3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MjQ5OTk5LCJpYXQiOjE3Mzc4Njc2MDAsImp0aSI6IjBhNTUxZTYzLWVkYTMtNGE0ZC05Zjg4LTRhMGMwYzA0MzQ4YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAxLzI2L2ljZS1hcnJlc3RzLXJhaWRzLXRydW1wLXF1b3RhLyJ9.pfp6DdjsiK2DaxcRVZb2G65qXW62DOulWFgYU9pTbDU&itid=gfta"
  },
  {
    "text": "In policy reversal, Trump eliminates help for Black and Latino communities hit harder by pollution  —  For four years, the Environmental Protection Agency made environmental justice one of its biggest priorities, working to improve health conditions in heavily-polluted communities often … ",
    "url": "https://apnews.com/article/climate-health-trump-environmental-justice-pollution-59baf164c81049d3995d2dfe1eceda8c"
  },
  {
    "text": "Children of the 1960s watch in pain as the story of our lifetime is erased  —  My almost pathological obsession with what historians now call “the Long Sixties” — especially the years between JFK's assassination in 1963 and Richard Nixon's Watergate downfall in 1974 — includes … ",
    "url": "https://www.inquirer.com/opinion/commentary/trump-presidency-1960s-civil-rights-20250126.html"
  },
  {
    "text": "Trump Pushes Jordan and Egypt to Take in Palestinians to ‘Clean Out’ Gaza  —  President Trump said he had spoken to Jordan's leader and planned to call Egypt's.  Mr. Trump's suggestion echoes proposals from far-right Israelis.  A Hamas official rejected the idea.",
    "url": "https://www.nytimes.com/2025/01/26/world/middleeast/trump-gaza-jordan-egypt.html"
  },
  {
    "text": "Trump Administration Begins Immigration Arrests in Chicago  —  The number of arrests was uncertain.  Illinois officials, including the governor, said they had not been given advance notice.  —  The Justice Department announced Sunday it had begun a multiagency immigration enforcement operation in Chicago … ",
    "url": "https://www.nytimes.com/2025/01/26/us/politics/chicago-deportation-emil-bove-trump.html"
  },
  {
    "text": "Elon Musk's call for Germany to ‘move beyond’ Nazi guilt is dangerous, Holocaust memorial chair says  —  Musk made a virtual appearance at a campaign event for Germany's far-right AfD party, saying “children should not be guilty of the sins of their parents.”",
    "url": "https://www.nbcnews.com/news/world/elon-musks-call-germany-move-nazi-guilt-dangerous-holocaust-memorial-c-rcna189316"
  },
  {
    "text": "Perplexity AI proposes TikTok merger with 50% U.S. government ownership stake  —  Perplexity AI has presented a new proposal to TikTok's parent company that would allow the U.S. government to own up to 50% of a new entity that merges Perplexity with TikTok's U.S. business, according to a person familiar with the matter.",
    "url": "https://www.cbsnews.com/news/perplexity-ai-tiktok-merger-proposal/?linkId=727277059"
  },
  {
    "text": "This Man is a Coward.  —  Mark Zuckerberg sat in the safety of his bubble this week, silent as Donald Trump dismantled and declawed the National Institutes of Health.  Forty billion dollars in research funding now hangs frozen.  Thousands of scientists wait in limbo.",
    "url": "https://www.theindex.media/this-man-is-a-coward/"
  },
  {
    "text": "Sen. Adam Schiff says Trump ‘broke the law’ by firing 18 inspectors general  —  In an interview on NBC News' “Meet the Press,” the California Democrat blasted Trump for firing 18 of the federal agency watchdogs over the weekend.  —  Sen. Adam Schiff, D-Calif., on Sunday blasted President Donald … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/adam-schiff-trump-broke-law-firing-inspectors-general-rcna189327"
  },
  {
    "text": "Bill Gates Rips Musk for His Right-Wing Pivot: ‘Insane S***’  —  Microsoft founder Bill Gates weighed in on his fellow billionaire Elon Musk's international political ambitions—twice calling the Tesla and SpaceX owner's support for far-right movements abroad “insane.”",
    "url": "https://www.thedailybeast.com/bill-gates-rips-into-elon-musk-for-his-right-wing-pivot-insane-s/"
  }
]