[
  {
    "text": "‘Of course he lost’: Ron DeSantis rejects Trump's 2020 election claims  —  Florida Gov. Ron DeSantis on Sunday rejected Donald Trump's claim that he was the true winner of the 2020 presidential election in his most forceful comments to date on the matter.  —  “Whoever puts their hand … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-of-course-trump-lost-2020-election-rcna98200"
  },
  {
    "text": "There's a Good Reason Trump Aides Don't Think the New Indictment Is a Joke  —  A number of Donald Trump's current aides are involved in the latest case against their boss.  That could put them in some very difficult positions. … Donald Trump has publicly joked about the four latest felony charges brought against him.",
    "url": "https://www.thedailybeast.com/theres-a-good-reason-trump-aides-dont-think-the-new-indictment-is-a-joke"
  },
  {
    "text": "The Pelosi Factor … If you were going to draw up a list of the people most responsible for the latest indictment of Donald Trump, the former president himself would be at the top, followed by the prosecutors who have brought the case.  Republicans in Congress perversely deserve a great deal of credit … ",
    "url": "https://nymag.com/intelligencer/2023/08/how-nancy-pelosi-long-game-led-to-trumps-indictment.html"
  },
  {
    "text": "‘Fake’ elector plot raised concerns over legal peril, indictment shows  —  A contingency plan, a crime or a ‘donkey show’?  Doubts across seven states and within the Trump campaign  —  Six weeks after the 2020 election, senior campaign officials for Donald Trump called a group … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/07/fake-electors-trump-indictment/"
  },
  {
    "text": "Will Trump's Social Media Behavior Cost Him in Court?  —  “If you go after me, I'm coming after you.”  That's what Donald Trump posted Friday afternoon on Truth Social.  —  Uh-oh.  Experts immediately suggested that a few more posts like that could land a fellow in contempt of court for defiance of an order.",
    "url": "https://plus.thebulwark.com/p/will-trump-social-media-behavior-cost-him-court"
  },
  {
    "text": "Fulton County insiders expect former President Donald Trump to be indicted this week in Georgia  —  It would be a state indictment and could be the most significant out of all the indictments since someone can only be pardoned on federal charges.  —  ATLANTA — Many people in Fulton County … ",
    "url": "https://www.11alive.com/article/news/special-reports/ga-trump-investigation/fulton-county-insiders-expect-former-president-donald-trump-indicted-this-week-georgia/85-10b10a28-e537-49a5-a17e-042d86dd4777"
  },
  {
    "text": "Most disapprove of Biden's handling of climate change, Post-UMD poll finds  —  Less than 3 in 10 Americans say they know a good or great deal about the Inflation Reduction Act, though many voters in both parties support some of its key climate programs  —  Nearly one year after President Biden enacted … ",
    "url": "https://www.washingtonpost.com/climate-environment/2023/08/07/biden-white-house-climate-policy/"
  },
  {
    "text": "The Weaponization of Loneliness  —  To defend America against those who would exploit our social disconnection, we need to rebuild our communities.  —  The question that preoccupied me and many others over much of the past eight years is how our democracy became so susceptible to a would-be strongman and demagogue.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/08/hillary-clinton-essay-loneliness-epidemic/674921/"
  },
  {
    "text": "America's economy is decimated.  As president, I have a plan to rebuild it.  —  We will declare our economic independence from the failed elites who orchestrated American decline and from never-ending federal spending that inflated prices and left nation on brink of insolvency.",
    "url": "https://www.usatoday.com/story/opinion/2023/08/07/desantis-plan-strengthen-us-economy-middle-class/70521175007/"
  },
  {
    "text": "Some conservatives have surprising ‘Barbie’ take despite criticisms of liberal agenda  —  ‘Barbie’ surpassed $1 billion in global box office sales, despite ‘woke’ claims  —  Some conservatives are standing by the film “Barbie,” despite criticisms and reviews that blasted the blockbuster film for an allegedly liberal agenda.",
    "url": "https://www.foxnews.com/politics/some-conservatives-surprising-barbie-take-despite-criticisms-liberal-agenda"
  },
  {
    "text": "Partisan Gaps Expand Most on Government Power, Climate  —  WASHINGTON, D.C. — Republicans and Democrats are highly polarized on a number of prominent U.S. social and policy issues, but there has been significant variation in the trends associated with these partisan gaps over the past two decades.",
    "url": "https://news.gallup.com/poll/509129/update-partisan-gaps-expand-government-power-climate.aspx"
  },
  {
    "text": "Exclusive: North Korean hackers breached top Russian missile maker  —  An elite group of North Korean hackers secretly breached computer networks at a major Russian missile developer for at least five months last year, according to technical evidence reviewed by Reuters and analysis by security researchers.",
    "url": "https://www.reuters.com/technology/north-korean-hackers-breached-top-russian-missile-maker-2023-08-07/"
  },
  {
    "text": "Kevin McCarthyism: Why the GOP's culture war on the troops will end badly  —  MAGA Republicans could learn a lot from the fall of another notorious McCarthy. … Today's Republican Party could learn a lot from “Tailgunner” Joe McCarthy's disastrous effort 70 years ago to treat the military as a right-wing political plaything.",
    "url": "https://www.publicnotice.co/p/kevin-mccarthyism-gop-war-on-troops-tuberville"
  },
  {
    "text": "Former Minneapolis officer sentenced to nearly 5 years for role in George Floyd's killing  —  Former Minneapolis police officer Tou Thao, the last officer facing state sentencing in George Floyd's death, was sentenced Monday to 4 years and 9 months in prison for his role in the May 2020 arrest … ",
    "url": "https://www.usatoday.com/story/news/nation/2023/08/07/tou-thao-sentenced-george-floyd-death/70541218007/"
  }
]