[
  {
    "text": "Haley blames a ‘Democratic plant’ for Civil War question that tripped her up  —  The former South Carolina governor also said that the war was, indeed, about slavery.  —  Hours after declining to do so, Nikki Haley said on Thursday morning that she believed slavery was, indeed, the cause of the Civil War.",
    "url": "https://www.politico.com/news/2023/12/28/nikki-haley-civil-war-comments-response-00133268"
  },
  {
    "text": "Nikki Haley, asked what caused the Civil War, leaves out slavery.  It's not the first time  —  Republican presidential candidate Nikki Haley was asked Wednesday by a New Hampshire voter about the reason for the Civil War, and she didn't mention slavery in her response — leading the voter to say he was “astonished” by her omission.",
    "url": "https://apnews.com/article/haley-election-civil-war-slavery-a509ff9d7cc5e271c42592276b75735c"
  },
  {
    "text": "Nikki Haley acknowledges Civil War ‘about slavery’ after facing backlash  —  NORTH CONWAY, N.H. — Nikki Haley on Thursday acknowledged the Civil War was “about slavery,” after facing swift criticism for making no mention of it when asked about the cause of the conflict at a town hall.",
    "url": "https://www.washingtonpost.com/politics/2023/12/28/nikki-haley-slavery-civil-war-cause-answer/"
  },
  {
    "text": "Ex-GOP student leader's links to Jan. 6 Capitol riot and a neo-Nazi web site  —  The young man is seen running with the crowd of Trump supporters toward the U.S. Capitol early in the afternoon of Jan. 6, 2021.  He wears a thigh-length dark blue coat, his face almost fully covered with a mask.",
    "url": "https://www.usatoday.com/story/news/investigations/2023/12/28/oliver-krvaric-jan-6-capitol-riot/71971697007/"
  },
  {
    "text": "Jan. 6 riot suspect revealed as Trump administration employee who praised Hitler: report  —  A full-time employee of the Trump administration appears to have taken part in the Jan. 6 insurrection, according to a new analysis.  —  USA Today reported that Oliver Krvaric, who was working at the time as a … ",
    "url": "https://www.rawstory.com/jan-6-2666817731/"
  },
  {
    "text": "Dems Target GOP State Lawmakers With Jan. 6 Credentials  —  Democrats are going after Republicans who came to Washington, D.C., on Jan. 6 to cheer on overturning the election. … In Donald Trump's Republican Party, being in Washington on Jan. 6, 2021, is far from a mark on a candidate's record—it's more like a credential.",
    "url": "https://www.thedailybeast.com/dems-target-gop-state-lawmakers-with-jan-6-credentials"
  },
  {
    "text": "India targets Apple over its phone hacking notifications  —  NEW DELHI — A day after Apple warned independent Indian journalists and opposition party politicians in October that government hackers may have tried to break into their iPhones, officials under Prime Minister Narendra Modi promptly took action — against Apple.",
    "url": "https://www.washingtonpost.com/world/2023/12/27/india-apple-iphone-hacking/"
  },
  {
    "text": "The conservative pin-up calendar is harmless kitsch, not pornography  —  In the dumbest possible online nontroversy that has been branded #Calendargate, a handful of conservatives — and disproportionately, conservative women — are apoplectic over a calendar featuring photo shoots of various right-wing bloggers and “influencers.”",
    "url": "https://www.washingtonexaminer.com/opinion/the-conservative-pin-up-calendar-is-harmless-kitsch-not-porn"
  },
  {
    "text": "Christie says Trump will ‘burn America to the ground’  —  Chris Christie is stepping up his rhetoric attacking GOP presidential frontrunner and rival former President Trump, releasing a new ad declaring Trump will “burn America to the ground.”  —  Christie, the former New Jersey governor … ",
    "url": "https://thehill.com/homenews/campaign/4380102-christie-says-trump-will-burn-america-to-the-ground/"
  },
  {
    "text": "Colorado Republican Party Says It Asked Supreme Court to Keep Trump on Ballot  —  The party's petition urged the justices to review a ruling from the Colorado Supreme Court, which said the former president had engaged in insurrection and is ineligible to hold office.",
    "url": "https://www.nytimes.com/2023/12/27/us/colorado-supreme-court-trump.html"
  },
  {
    "text": "Seattle Supporters Watch Black Lives Matter Garden Leveled After It Was Overrun by Drug Users, Homeless  —  The garden was established by community organizers and demonstrators during the summer of 2020, to memorialize those individuals of color who have been killed with police bullets",
    "url": "https://themessenger.com/news/seattle-black-lives-matter-garden-leveled-homeless-drug-use"
  },
  {
    "text": "Biden Knew Carter Was in Trouble in 1979.  Now He's in the Same Boat.  —  Both presidents faced inflation and foreign-policy challenges as they sought a second term  —  WASHINGTON—When an unpopular Democratic incumbent president was struggling to build support for a second term … ",
    "url": "https://www.wsj.com/politics/elections/biden-knew-carter-was-in-trouble-in-1979-now-hes-in-the-same-boat-74c96cdb?mod=followamazon"
  },
  {
    "text": "America has a life expectancy crisis.  But it's not a political priority.  —  The commissioner of the Food and Drug Administration had an urgent message last winter for his colleagues, brandishing data that life expectancy in the United States had fallen again — the biggest two-year decline in a century.",
    "url": "https://www.washingtonpost.com/health/2023/12/28/life-expectancy-no-political-response/"
  },
  {
    "text": "Bucks County mom behind conservative school movement charged with assault, giving teens alcohol  —  Chris Ullery Bethany RodgersUSA TODAY NETWORK  —  A former Pennsylvania lieutenant governor candidate and outspoken voice in the conservative “parental rights” school movement has been charged … ",
    "url": "https://www.phillyburbs.com/story/news/politics/2023/12/28/clarice-schillinger-conservative-pa-schools-activist-charged-with-assault-bucks-county-pac-lt-gov/72038859007/"
  },
  {
    "text": "2024 may be the hottest year in recorded history  —  2024 may be even hotter than the “gobsmackingly” hot 2023, which featured extreme — and often deadly — weather and climate events around the globe. … But ‘the normal pattern’ may not exist anymore,\" said Andrew Dessler, a climate scientist at Texas A&M University.",
    "url": "https://www.axios.com/2023/12/28/climate-change-extreme-heat-outlook"
  },
  {
    "text": "FTC sues Grand Canyon University, alleging misleading advertising, illegal telemarketing  —  The Federal Trade Commission is suing Grand Canyon University and its president over what it says were deceptive advertising practices.  —  In the lawsuit filed Wednesday, the FTC accused Grand Canyon University … ",
    "url": "https://www.usatoday.com/story/news/education/2023/12/27/federal-trade-commission-sues-grand-canyon-university/72043590007/"
  }
]