[
  {
    "text": "Boosts in Democratic excitement help Harris reset the race against Trump — CBS News poll  —  Boosted by Democrats, younger and Black voters becoming more engaged and likely to vote, and by women decidedly thinking she'd favor their interests more, Vice President Kamala Harris has reset the 2024 presidential race.",
    "url": "https://www.cbsnews.com/news/poll-harris-trump-cbs-news/"
  },
  {
    "text": "Trump White House Aides Desert Donald for Kamala in ‘Republicans for Harris’ Drive  —  ‘TOXIC TRUMP’  —  Defectors include former Trump White House Press Secretary Stephanie Grisham.  —  Dozens of well-known Republicans including a couple of former Trump White House staffers … ",
    "url": "https://www.thedailybeast.com/trump-white-house-aide-stefanie-grisham-joins-kamala-in-republicans-for-harris-drive"
  },
  {
    "text": "Harris team launches GOP group with endorsements from ex-Trump officials, key Republican voices  —  Vice President Harris's campaign launched “Republicans for Harris” with more than 25 GOP endorsements, including former secretaries Chuck Hagel and Ray LaHood, as well as former GOP governors and lawmakers.",
    "url": "https://thehill.com/homenews/campaign/4809725-kamala-harris-campaign-gop-initiative-prominent-republican-voices/"
  },
  {
    "text": "Ex-GOP congressman Riggleman endorses Harris, rips Trump's ‘thirst for power’  —  The former congressman was twice endorsed by Donald Trump but broke with him over Jan. 6.  —  RICHMOND — Former congressman Denver Riggleman, a Virginia Republican who ran twice with Donald Trump's backing … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/08/04/riggleman-harris-endorsement-trump/"
  },
  {
    "text": "Republicans for Harris launches, aiming for Biden-like appeal to anti-Trump voters  —  The group known as Republicans for Biden is officially relaunching Sunday as Republicans for Harris, and aides on the revamped Democratic campaign are hoping that a much different candidate will be able … ",
    "url": "https://www.cnn.com/2024/08/04/politics/republicans-for-harris-anti-trump-gop-voters/"
  },
  {
    "text": "Democracy dies if we drop the case of Trump, Egypt and $10 million in cash  —  America's Founders were a little unclear about a lot of stuff — we're still arguing after 233 years about just what the heck they were saying about guns in the Second Amendment — but they seemed very adamant … ",
    "url": "https://www.inquirer.com/opinion/commentary/trump-sisi-egypt-10-million-bribe-20240804.html"
  },
  {
    "text": "Gorsuch on Biden Supreme Court proposals: ‘Be careful’  —  The justice said an independent judiciary “means that when you're unpopular, you can get a fair hearing.”  —  Justice Neil Gorsuch is pushing back against President Joe Biden's recent proposals to restructure the Supreme Court.",
    "url": "https://www.politico.com/news/2024/08/04/gorsuch-biden-supreme-court-proposals-00172574"
  },
  {
    "text": "Biden is a master of confronting no-win scenarios  —  Of all the cultural artifacts that the Star Trek franchise has provided us, the Kobayashi Maru scenario may loom largest.  —  First described in “Star Trek II: The Wrath of Khan,” the Kobayashi Maru wargame put aspiring Starfleet officers … ",
    "url": "https://thehill.com/opinion/white-house/4809318-biden-is-a-master-of-confronting-no-win-scenarios/"
  },
  {
    "text": "Trump reopens old feud in Georgia.  Some Republicans are scratching their heads.  —  Some Republicans warned Trump's comments could threaten his already shaky prospects in the state.  —  Former President Donald Trump is reopening an old feud with Republicans in Georgia.",
    "url": "https://www.politico.com/news/2024/08/03/trump-brian-kemp-georgia-00172564"
  },
  {
    "text": "Nancy Pelosi on Harris, Trump, and “The Art of Power”  —  There is no denying the impact that Speaker Emerita Nancy Pelosi, the 19-term Democrat from California, has had on Congress and the country, as she details in her new book, “The Art of Power.”  Pelosi talks with “60 Minutes” … ",
    "url": "https://www.cbsnews.com/video/nancy-pelosi-on-harris-trump-and-the-art-of-power/"
  },
  {
    "text": "Fetterman has concerns about Shapiro for VP, aides tell Harris' team  —  The conversations reveal the intensity of the scrutiny surrounding her selection of a running mate  —  PHILADELPHIA — Pennsylvania Sen. John Fetterman is concerned about the possibility that Vice President Kamala Harris might choose … ",
    "url": "https://www.politico.com/news/2024/08/03/fetterman-shapiro-harris-vp-00172557"
  },
  {
    "text": "How a Washington Tax Break for Data Centers Snowballed Into One of the State's Biggest Corporate Giveaways  —  Companies have saved $474 million since 2018, with most of the windfall going to Washington-based tech giant Microsoft.  Lawmakers repeatedly expanded who qualifies, and they lowered the number of jobs expected in return.",
    "url": "https://www.propublica.org/article/washington-data-centers-tech-jobs-tax-break"
  },
  {
    "text": "Trump congratulates Putin over deal that brought Evan Gershkovich home  —  Trump also seemed to lash out at the deal after it was trumpeted Thursday by President Biden and Vice President Harris, who met the freed prisoners in an emotional ceremony.  —  ATLANTA — Former president Donald … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/03/trump-putin-prisoner-swap-gershkovich/"
  },
  {
    "text": "Sen. Tim Scott Shares LOVELY Wedding Pics of Himself With His Bride and A-Hole Lefties Just Can't DEEEAL  —  Sen. Tim Scott was good enough to share some of his wedding pictures on Twitter and they are just lovely.  —  See for yourselves:  —  Beautiful, right?  Many congratulations to them both.",
    "url": "https://twitchy.com/samj/2024/08/04/tim-scott-wedding-n2399213"
  },
  {
    "text": "Oklahoma schools in revolt over Bible mandate  —  Educators in Oklahoma are refusing a state order to incorporate the Bible into their lesson plans, setting up an inevitable showdown with the start of the school year just weeks away.  —  State Superintendent Ryan Walters last week released guidelines … ",
    "url": "https://thehill.com/homenews/education/4806459-oklahoma-schools-bible-mandate-ten-commandments-church-and-state/"
  }
]