[
  {
    "text": "If Republicans Want to Win, They Need Trump to Lose — Big  —  To dominate the country once more, Republicans need to hasten the move to a post-Trump party.  —  Accepting his party's nomination in 1984, Democrat Walter Mondale vowed to cut the deficit with a memorable line about the tough medicine either … ",
    "url": "https://www.politico.com/news/magazine/2024/09/04/kamala-harris-republicans-after-trump-00177194"
  },
  {
    "text": "Playbook: The Republicans secretly rooting for a Trump loss  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  DEVELOPING OVERNIGHT — “Ukraine foreign minister resigns amid war's biggest reshuffle,” by Reuters' Olena Harmash in Kyiv … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/09/04/the-republicans-secretly-rooting-for-a-trump-loss-00177272"
  },
  {
    "text": "Trump appears to have misled Gold Star families on troop deaths in Afghanistan  —  Trump frequently suggests, as he did in a TikTok filmed at Arlington Cemetery, that an 18-month period without hostile-fire deaths took place entirely in his presidency.",
    "url": "https://www.washingtonpost.com/politics/2024/09/04/trump-misled-gold-star-families-troop-deaths-afghanistan/"
  },
  {
    "text": "The ugly truth we're missing on Trump, Arlington  —  There's an old saying: Never take any time off in 2024.  OK, I just made that up, but no sooner did I decide to skip a few column slots to recover from the joy, or whatever, of Chicago's Democratic National Convention, than all heck broke loose.",
    "url": "https://www.inquirer.com/columnists/attytood/trump-arlington-cemetery-sundown-towns-ferguson-20240903.html"
  },
  {
    "text": "How the Media Let Trump Off the Hook for His Arlington National Cemetery Stunt  —  Mainstream outlets downplayed a blatant violation of sacred norms, turning a clear scandal into a partisan dispute.  —  Last week, I wrote about former President Donald Trump's tacky, potentially illegal publicity stunt at Arlington National Cemetery.",
    "url": "https://www.readtpa.com/p/how-the-media-let-trump-off-the-hook"
  },
  {
    "text": "Silver Bulletin 2024 presidential election forecast  —  All the numbers for Trump vs. Harris.  —  ∙ Paid … Let's cut to the chase: So, who's gonna win the election?  —  Well, honestly, we don't know — but we can give you our best probabilistic guess.",
    "url": "https://www.natesilver.net/p/nate-silver-2024-president-election-polls-model"
  },
  {
    "text": "Republicans fret over Trump's freefall among women  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/campaign/4860681-trump-support-among-women-voters/"
  },
  {
    "text": "Poll: Half of Gen Z voters support Harris, one-third back Trump  —  The NBC News Stay Tuned Gen Z Poll powered by SurveyMonkey shows Harris with a significant lead over Trump, but not quite the deficit Trump suffered in 2020.  —  Half of Gen Z voters say they'll vote for Vice President Kamala Harris … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-half-gen-z-voters-support-kamala-harris-one-third-back-donald-tru-rcna169025"
  },
  {
    "text": "CNN polls across six battlegrounds find Georgia and Pennsylvania are key toss-ups  —  The 2024 presidential campaign's home stretch kicks off with a mixed outlook across six key battlegrounds, according to new CNN polls conducted by SSRS in each state.  Vice President Kamala Harris holds … ",
    "url": "https://www.cnn.com/2024/09/04/politics/cnn-polls-battleground-states/"
  },
  {
    "text": "Ginni Thomas Privately Praised Group Working Against Supreme Court Reform: “Thank You So, So, So Much”  —  In a call with donors, First Liberty Institute's Kelly Shackelford read the supportive email he said came from Thomas.  The leader of the religious-rights group also labeled Justice Elena Kagan … ",
    "url": "https://www.propublica.org/article/ginni-thomas-email-scotus-ethics-reform-first-liberty-institute"
  },
  {
    "text": "Josh Marshall on how the “liberal media” works against Dems  —  “Republicans in the national political conversation have trained the press to think, ‘We play hard.  We break the rules sometimes.’”  —  ∙ Paid … How is it possible that the elite press, comprised largely … ",
    "url": "https://www.publicnotice.co/p/josh-marshall-interview-2024-media-trump-harris"
  },
  {
    "text": "SURPRISE!  —  Hello again, it's Brian Stelter — yes, really.  —  I am thrilled to share that I am returning as the lead author of CNN's Reliable Sources newsletter, the digest I founded in 2015.  —  But this is not going to be a “Back to the Future” remake.",
    "url": "https://view.newsletters.cnn.com/messages/1725400860804a11dd2d3fed6/raw"
  },
  {
    "text": "Trump admits he lost 2020 election ‘by a whisker’ during Lex Fridman podcast  —  Trump repeats false claims about voter fraud as he concedes 2020 loss in podcast interview  —  Support truly  —  independent journalism  —  Our mission is to deliver unbiased, fact-based reporting that holds power to account and exposes the truth.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-lex-fridman-podcast-interview-b2606533.html"
  },
  {
    "text": "Meghan McCain says she won't support Harris or Trump  —  Meghan McCain, the daughter of the late Sen. John McCain (R-Ariz.), said she will not support Vice President Harris or former President Trump in November.  —  Her comment comes just hours after her brother, Jimmy McCain, threw his support behind Harris.",
    "url": "https://thehill.com/homenews/campaign/4861019-meghan-mccain-kamala-harris-donald-trump-2024/"
  },
  {
    "text": "House GOP leaders weigh options as Trump pushes for a government shutdown fight  —  House Republican leaders are considering tying federal funding to a GOP election bill that Democrats say is a poison pill.  The deadline to avoid a shutdown is Sept. 30.  —  WASHINGTON — Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/congress/trump-government-shutdown-2024-election-citizenship-voting-bill-gop-rcna169349"
  },
  {
    "text": "Former Trump Aide Peter Navarro Implores MAGA Fans To Avoid Kamala Harris Mistake  —  The election-overthrow plotter used a soccer analogy to make his point.  —  LOADING  —  Peter Navarro, Donald Trump's former adviser who helped plot the attempted election overthrow in 2020, had a message for MAGA world.",
    "url": "https://www.huffpost.com/entry/peter-navarro-no-kamala-harris-first-name_n_66d8464ce4b09a3ee66d0165"
  },
  {
    "text": "US charges Hamas leader, other militants in connection with Oct. 7 massacre in Israel  —  The Justice Department announced criminal charges Tuesday against Hamas leader Yahya Sinwar and other senior militants in connection with the Oct. 7, 2023, rampage in Israel, marking the first effort … ",
    "url": "https://apnews.com/article/justice-department-hamas-sinwar-87674285aa9b066392953db1310312ca"
  },
  {
    "text": "Republicans pushing Christianity into public schools are hitting resistance — even in red states  —  New policies in places like Florida, Louisiana and Oklahoma are rekindling the debate over the separation of church and state.  —  Florida now allows chaplains in public schools.",
    "url": "https://www.politico.com/news/2024/09/04/republicans-religion-schools-resistance-00177181"
  },
  {
    "text": "Hackers breach social media accounts of Lara and Tiffany Trump  —  Fake posts on X touted a Trump family cryptocurrency venture.  —  Hackers apparently breached the social media accounts of Lara and Tiffany Trump on Tuesday, distributing what the former president's son said were two fake posts touting a family cryptocurrency venture.",
    "url": "https://www.politico.com/news/2024/09/03/lara-tiffany-trump-social-media-hack-00177261"
  },
  {
    "text": "Central NY House fight plays out on air  —  The ad war in the Syracuse-area House district represented by one of the country's most vulnerable Republicans has been lopsided for weeks.  —  Democratic groups that see Rep. Brandon Williams' seat as ripe for the flipping have been pummeling … ",
    "url": "https://www.politico.com/newsletters/new-york-playbook/2024/09/04/central-ny-house-fight-plays-out-on-air-00177257"
  },
  {
    "text": "Attorney General Bailey Files Suit against Third Biden-Harris Illegal Student Loan Scheme Days after SCOTUS Sides with Missouri, Blocks Second  —  JEFFERSON CITY, MO. - Today, Missouri Attorney General Andrew Bailey led a multistate coalition in filing suit against the Biden-Harris Administration's … ",
    "url": "https://ago.mo.gov/attorney-general-bailey-files-suit-against-third-biden-harris-illegal-student-loan-scheme-days-after-scotus-sides-with-missouri-blocks-second/"
  },
  {
    "text": "Why thousands of Florida students are not being taught sex ed  —  In May 2023, Florida Governor Ron DeSantis (R) signed Florida House Bill 1069, a law that requires sex education classes in the state to conform to right-wing ideology.  Specifically, the law requires all sex education classes … ",
    "url": "https://popular.info/p/why-thousands-of-florida-students"
  },
  {
    "text": "To fight wokeness, vote Harris  —  The left's worst ideas flourish under Trump … Subscribe to I Might Be Wrong  —  Trump wants the election to be about wokeness.  He rails about wokeness constantly — it's in his speeches even more than Hannibal Lecter, feckless whinging about the Biden-Harris switch … ",
    "url": "https://www.slowboring.com/p/to-fight-wokeness-vote-harris"
  },
  {
    "text": "Elon Musk's attacks on Kamala Harris become more unhinged, with help from AI  —  Elon Musk's disdain for the Democratic Party was never subtle, but in recent weeks his commentary on the upcoming US presidential election and his attacks against Vice President Kamala Harris have intensified … ",
    "url": "https://www.cnn.com/2024/09/03/media/elon-musk-x-kamala-harris-trump-misinformation/"
  },
  {
    "text": "Classic Gold: Doocy Grills WH About Kamala's Fake Accent and KJP Implodes  —  Kamala Harris seems to have learned something from Joe Biden and Hillary Clinton: how to make things up to appeal to your audience.  —  Hillary Clinton pulled out the hot sauce story and a fake Southern accent.",
    "url": "https://redstate.com/nick-arama/2024/09/03/doocy-destroys-kjp-over-kamalas-changeable-accents-n2178884"
  }
]