[
  {
    "text": "Defense pick Hegseth paid accuser but denies sexual assault, attorney says  —  Documents obtained by The Post provide extensive detail about allegation and the response by Trump's defense secretary pick.  —  Pete Hegseth, President-elect Donald Trump's pick for secretary of defense … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/16/pete-hegseth-sexual-assault-accuser-paid/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxNzMzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMzMTE1NTk5LCJpYXQiOjE3MzE3MzMyMDAsImp0aSI6IjBhYTFkOWE3LWQ3YzAtNGJkZi1iODExLWFjZmE3MzMzYWQ4ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzE2L3BldGUtaGVnc2V0aC1zZXh1YWwtYXNzYXVsdC1hY2N1c2VyLXBhaWQvIn0.taA1whYLQ3FV4lj5EpmAipAymzU03UcBrTwLwnL2KI8&itid=gfta"
  },
  {
    "text": "Pollster Ann Selzer ending election polling, moving ‘to other ventures and opportunities’  —  Public opinion polling has been my life's work.  I collected my first research data as a freshman in college, if you don't count a neighborhood poll I did at age 5.",
    "url": "https://www.desmoinesregister.com/story/opinion/columnists/2024/11/17/ann-selzer-conducts-iowa-poll-ending-election-polling-moving-to-other-opportunities/76334909007/"
  },
  {
    "text": "Trump transition team compiling list of current and former U.S. military officers for possible courts-martial  —  All of the officers were involved in the chaotic U.S. withdrawal from Afghanistan, which independent reviews have blamed on both the Trump and Biden administrations.",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-transition-team-compiling-list-current-former-us-military-office-rcna180489"
  },
  {
    "text": "Tesla Has the Highest Fatal Accident Rate of All Auto Brands, Study Finds  —  Tesla vehicles suffer fatal accidents at a rate that's twice the industry average, according to a new report.  —  Tesla's vehicles have the highest fatal accident rate among all car brands in America … ",
    "url": "https://www.roadandtrack.com/news/a62919131/tesla-has-highest-fatal-accident-rate-of-all-auto-brands-study/"
  },
  {
    "text": "Trump picks fracking firm CEO Chris Wright to be energy secretary  —  The executive has taken a defiant approach to fighting climate change by attacking policies that call for shifting away from fossil fuels.",
    "url": "https://www.washingtonpost.com/politics/2024/11/16/energy-secretary-trump-chris-wright/"
  },
  {
    "text": "Trump's shock-and-awe approach to transition is both shocking and awful  —  This week a flurry of controversial and extremist picks for Trump's cabinet came at a hectic pace with a level of provocation that made heads spin  —  “Welcome back,” Joe Biden told Donald Trump, his predecessor and successor … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/17/trump-transition-biden"
  },
  {
    "text": "How to survive the broligarchy: 20 lessons for the post-truth world  —  In the wake of Trump's unnerving appointees, the investigative journalist and veteran of the libel court offers pointers on coping in an age of surveillance  —  1 When someone tells you who they are, believe them.",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/17/how-to-survive-the-broligarchy-20-lessons-for-the-post-truth-world-donald-trump"
  },
  {
    "text": "Secret Trump voters have post-election coming out party  —  They're donning MAGA hats in cafes, celebrating on social media and flying Trump flags: Supporters of President-elect Trump in deep blue cities and states are no longer keeping it to themselves.",
    "url": "https://www.axios.com/2024/11/17/secret-trump-voters-blue-states"
  },
  {
    "text": "Election Reveals Right-Wing Shift of Social Media Platforms  —  If the election underscored anything about the internet, it was the ascendancy of social platforms for the right.  That puts Democrats at a disadvantage.  —  After Donald J. Trump won the election this month … ",
    "url": "https://www.nytimes.com/2024/11/17/technology/election-right-wing-social-media.html"
  },
  {
    "text": "Trump's early moves show he wants to disrupt government and exact retribution  —  Eight years ago, Trump's transition got off to a slow and stumbling start.  This time, he is moving swiftly to fill key roles with loyal but controversial picks.  —  The opening phase of President-elect Donald … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/17/trumps-early-moves-show-he-wants-disrupt-government-exact-retribution/"
  },
  {
    "text": "Donald Trump Is Already Starting to Fail  —  That was quick.  —  Donald Trump is planting the seeds of his own political demise.  The corrupt, incompetent and extremist men and women he's appointing to many of the most critical posts in his cabinet are direct threats to the well-being of the country … ",
    "url": "https://www.nytimes.com/2024/11/17/opinion/trump-kennedy-gaetz-hegseth.html?unlocked_article_code=1.ak4.pugY.oU5QB5PdczoZ&smid=url-share"
  },
  {
    "text": "Trump won.  The celebrations started.  Then the trouble began.  —  The president-elect has been operating off his own script, making Cabinet picks that have posed immediate political challenges.",
    "url": "https://www.washingtonpost.com/politics/2024/11/16/trump-transition-cabinet-controversy/"
  },
  {
    "text": "Readout of President Joe Biden's Meeting with President Xi Jinping of the People's Republic of China  —  President Joseph R. Biden Jr. met with President Xi Jinping of the People's Republic of China (PRC) in Lima, Peru today.  This meeting is the third between the two Presidents and follows their April 2, 2024, telephone call.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/11/16/readout-of-president-joe-bidens-meeting-with-president-xi-jinping-of-the-peoples-republic-of-china-3/"
  },
  {
    "text": "Harris' campaign blew $2.6M on private jets in final weeks of campaign  —  Vice President Kamala Harris' campaign shelled out $2.6 million on private jet travel in the final, dying gasps of her presidential run — bringing her failed campaign's total tally on the environmentally unfriendly mode … ",
    "url": "https://nypost.com/2024/11/16/us-news/harris-campaign-blew-2-6m-on-private-jets-in-final-weeks-of-campaign/"
  },
  {
    "text": "Kamala Harris raised $1 billion-plus in defeat.  She's still sending persistent appeals to donors  —  Kamala Harris and the Democratic Party's prodigious fundraising operation raised more than $1 billion in her loss to Donald Trump, but the vice president is still pushing donors for more money after the election.",
    "url": "https://apnews.com/article/harris-postelection-fundraising-dnc-gaetz-trump-donors-806eeb3b92eced3242aeb29a964ca259"
  }
]