[
  {
    "text": "Senators receive affidavit containing new allegations against Pete Hegseth, who denies the claims  —  The former sister-in-law of Trump's defense secretary pick said that Hegseth made his second wife fear for her safety.  Hegseth's second wife said, “There was no physical abuse in my marriage.”",
    "url": "https://www.nbcnews.com/politics/national-security/senators-received-affidavit-containing-new-allegations-pete-hegseth-de-rcna188342"
  },
  {
    "text": "Hegseth Ex-Sister-in-Law Tells Senators He Was ‘Abusive’ to Second Wife  —  A woman once married to the brother of Pete Hegseth, the defense secretary nominee, submitted a sworn statement to the Senate in a late-hour complication to his confirmation.  His attorney denied her account.",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/hegseth-senators-affidavit.html?unlocked_article_code=1.q04.WqU2.FjpnG4Psf5Uq&smid=url-share"
  },
  {
    "text": "Senate learns of new allegations against Hegseth  —  The Defense secretary nominee's former sister-in-law, in an affidavit, said she witnessed his drunken aggression and that his second wife worried about her safety.  —  Pete Hegseth's former sister-in-law, in an affidavit given to senators on Tuesday … ",
    "url": "https://www.politico.com/news/2025/01/21/hegseth-new-allegations-00199730"
  },
  {
    "text": "Hegseth Routinely Passed Out from Alcohol Abuse, Witness Says  —  Trump's Pentagon pick has denied allegations, calling them part of a ‘smear campaign’  —  Pete Hegseth, President Trump's pick to run the Pentagon, regularly abused alcohol to the point that he passed out at family gatherings … ",
    "url": "https://www.wsj.com/politics/policy/pete-hegseth-affidavit-witness-drunk-passing-out-e216ca85?st=TXviBX"
  },
  {
    "text": "Trump picks fights with his party  —  The Scoop  —  As jubilant as Republican lawmakers are over Donald Trump's second term, they're facing a familiar reality: The president is back to picking fights with them and trying to bend them to his will.  —  From pardoning Jan. 6 offenders … ",
    "url": "https://www.semafor.com/article/01/21/2025/mcconnell-criticizes-trumps-broad-pardon-of-capitol-riot-defendants"
  },
  {
    "text": "Great-grandson of the man who established birthright citizenship slams Trump's new executive order  —  “He's feeding off the American mindset, and it's not a healthy one,” said the great-grandson of Wong Kim Ark, whose 1898 Supreme Court case helped guarantee birthright citizenship.",
    "url": "https://www.nbcnews.com/news/asian-america/wong-kim-ark-birthright-citizenship-trump-executive-order-rcna188481"
  },
  {
    "text": "Change to Birthright Citizenship Would Affect Visa Holders, Too  —  President Trump's public rhetoric has focused on undocumented immigrants, but the raft of new orders he signed would also affect those seeking to enter the U.S. legally.  —  President Trump's executive order … ",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/birthright-citizenship-visa-holders.html"
  },
  {
    "text": "U.S. expands expedited deportations beyond border areas as part of Trump crackdown  —  Washington — The Trump administration on Tuesday dramatically broadened the scope of expedited deportations, enacting a nationwide expansion of an immigration policy known as “expedited removal” … ",
    "url": "https://www.cbsnews.com/news/u-s-expands-expedited-deportations-beyond-border-areas-trump-crackdown/"
  },
  {
    "text": "Bishop Calls Out Trump and Vance To Their Face  —  This stunning video highlights the first direct call out received by Trump and Vance since taking office.  —  This afternoon, Bishop Mariann Edgar Budde fearlessly called out Donald Trump and JD Vance to their faces at a national prayer service.",
    "url": "https://meidasnews.com/news/bishop-calls-out-trump-and-vance-to-their-face"
  },
  {
    "text": "‘All Americans legally female’: Trump invites mockery with sloppy executive order  —  President Donald Trump published two executive orders late Monday that targeted transgender people, but critics couldn't help but note that the clunky language declared all Americans legally female.",
    "url": "https://www.rawstory.com/trump-transgender-2670902521/"
  },
  {
    "text": "AOC slams ADL for excusing Elon Musk's ‘awkward gesture:’ 'You're defending a Heil Hitler salute'  —  Musk spoke at an inauguration event for President Trump after he was sworn in on Monday  —  Rep. Alexandria Ocasio-Cortez, D-N.Y., attacked the Anti-Defamation League (ADL) … ",
    "url": "https://www.foxnews.com/media/aoc-slams-adl-excusing-elon-musks-awkward-gesture-youre-defending-heil-hitler-salute"
  },
  {
    "text": "Trump Says He Will Impose 10% Tariffs on Chinese Imports on Feb. 1  —  The president said the planned duties were a response to China's failure to curb fentanyl exports.  —  President Trump said on Tuesday that he intended to impose a 10 percent tariff on Chinese imports into the United States on Feb. 1 … ",
    "url": "https://www.nytimes.com/2025/01/21/business/trump-tariffs-china.html"
  },
  {
    "text": "Donald Trump's Medicare Executive Order Explained  —  's executive order 14087, which was put in place to lower the cost of prescription drugs for Americans.  —  Newsweek has reached out to the Trump transition team outside of regular working hours via email for comment.  —  Why It Matters",
    "url": "https://www.newsweek.com/donald-trump-medicare-executive-order-explained-2018138"
  },
  {
    "text": "Democrats plot strategy for fighting Trump on funding freeze  —  Less than 24 hours after President Donald Trump's Day One blitz of executive actions, Democrats on Capitol Hill mobilized Tuesday to fight his move to freeze a broad range of federal cash.  House Minority Leader Hakeem Jeffries … ",
    "url": "https://www.politico.com/live-updates/2025/01/21/congress/democrats-house-funding-freeze-trump-00199805"
  },
  {
    "text": "Trump announces AI infrastructure investment backed by Oracle, OpenAI and Softbank",
    "url": "https://www.cnbc.com/2025/01/21/trump-ai-openai-oracle-softbank.html"
  },
  {
    "text": "Trump to announce up to $500 billion in private sector AI infrastructure investment  —  President Trump is set to announce billions of dollars in private sector investment to build artificial intelligence infrastructure in the United States, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/trump-announces-private-sector-ai-infrastructure-investment/"
  },
  {
    "text": "Trump terminates John Bolton's security detail within hours of taking office  —  Within hours of taking office, President Donald Trump terminated the Secret Service detail that was assigned to his former national security adviser John Bolton, Bolton confirmed to CNN on Tuesday.",
    "url": "https://www.cnn.com/2025/01/21/politics/john-bolton-security-detail-trump"
  },
  {
    "text": "Trump pardons Silk Road creator Ross Ulbricht … - He added, “The scum that worked to convict him were some of the same lunatics who were involved in the modern day weaponization of government against me.”",
    "url": "https://www.axios.com/2025/01/22/trump-ross-ulbricht-silk-road"
  },
  {
    "text": "Trump officials pause health agencies' communications, citing review  —  The agencies are charged with making decisions that touch the lives of every American and are the source of crucial information to health-care providers.  —  The Trump administration has instructed federal health agencies … ",
    "url": "https://www.washingtonpost.com/health/2025/01/21/trump-hhs-cdc-fda-communication-pause/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NDM1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4ODE3OTk5LCJpYXQiOjE3Mzc0MzU2MDAsImp0aSI6ImEzODFhN2UxLTRhOGUtNGFjOS1hNGRmLTEyNDk5ZWIzNGFiOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMS8yMS90cnVtcC1oaHMtY2RjLWZkYS1jb21tdW5pY2F0aW9uLXBhdXNlLyJ9.cY26hIDkmu_AWumnD7uJ1Ge-rGGy5hoacMYbVpbSyJM&itid=gfta"
  },
  {
    "text": "Decentralized Social Media Is the Only Alternative to the Tech Oligarchy  —  If it wasn't already obvious, the last 72 hours have made it crystal clear that it is urgent to build and mainstream alternative, decentralized social media platforms that are resistant to government censorship and control … ",
    "url": "https://www.404media.co/decentralized-social-media-is-the-only-alternative-to-the-tech-oligarchy/"
  },
  {
    "text": "Trump signs order seeking to rename Alaska's Denali and the Gulf of Mexico  —  President Donald Trump said the Gulf of Mexico will be called Gulf of America, while the Denali mountain peak will revert to its old name, Mount McKinley.  —  President Donald Trump on Monday issued … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/21/trump-gulf-of-america-mexico-denali-mckinley/"
  },
  {
    "text": "Instagram hides search results for ‘Democrats’  —  Meta says its working urgently to fix a problem with Instagram which results in a “results hidden” message when users search for the terms “Democrat” or “Democrats”.  —  Some social media users have accused the company of political bias … ",
    "url": "https://www.bbc.com/news/articles/c4g32yxpdz0o"
  },
  {
    "text": "Trump pushes Hill GOP on recess appointments, debt limit  —  A White House meeting on the president's first full day back in office emphasized unity.  —  President Donald Trump prodded congressional leaders to consider recess appointments for his top nominees and expressed interest … ",
    "url": "https://www.politico.com/news/2025/01/21/trump-johnson-thune-white-house-005697"
  },
  {
    "text": "Coast Guard Commandant terminated over border lapses, recruitment, DEI focus: official  —  Senior DHS official confirms to Fox News Digital Coast Guard Adm. Linda Fagan has been relieved of her post  —  EXCLUSIVE: The Commandant of the U.S. Coast Guard has been terminated over concerns about the border … ",
    "url": "https://www.foxnews.com/politics/coast-guard-commandant-terminated-over-border-lapses-recruitment-dei-focus-official"
  }
]