[
  {
    "text": "The Supreme Court Did This to Itself  —  The Supreme Court is on a collision course with itself, and it's not clear that the justices even know it.  We are now witnessing a five-car pileup of Trump-slash-Jan. 6 cases that will either be heard by the Supreme Court or land on their white marble steps in the coming weeks.",
    "url": "https://slate.com/news-and-politics/2023/12/supreme-court-trump-cases-democracy-disaster.html"
  },
  {
    "text": "Washington Post Editorial Board: The Supreme Court Should Toss the Colorado Decision  —  People (including our own Ed Morrissey) have been saying this since the decision appeared Tuesday but I'm still a bit surprised to see the Washington Post's editorial board making the same case.",
    "url": "https://hotair.com/john-s-2/2023/12/21/washington-post-editorial-board-the-supreme-court-should-toss-the-colorado-decision-n600478"
  },
  {
    "text": "Trump advisers and Colorado Republicans huddle after shock ruling  —  Republicans in the state are hoping the ex-president will make a swing through in a show of support.  —  Top officials with Donald Trump's presidential campaign and the Colorado Republican Party spoke on Thursday … ",
    "url": "https://www.politico.com/news/2023/12/21/trump-colorado-ballot-2024-campaign-00132900"
  },
  {
    "text": "New Trump Cases Shadowed by Rocky Relationship With Supreme Court  —  Though he appointed three justices, his administration had the worst track record before the justices since at least the 1930s.  —  “I'm not happy with the Supreme Court,” President Donald J. Trump said on Jan. 6, 2021.",
    "url": "https://www.nytimes.com/2023/12/21/us/politics/trump-supreme-court.html"
  },
  {
    "text": "Former Trump lawyer Rudy Giuliani files for bankruptcy protection, lists more than $100 million in debts  — Rudy Giuliani filed for Chapter 11 bankruptcy protection in New York.  — The former New York City mayor listed debts that include a recent nearly $150 million civil judgment … ",
    "url": "https://www.cnbc.com/2023/12/21/former-trump-lawyer-rudy-giuliani-files-for-bankruptcy-protection.html"
  },
  {
    "text": "Rudy Giuliani files for Chapter 11 bankruptcy in New York after defamation case  —  Rudy Giuliani has filed for chapter 11 bankruptcy in New York, one day after a federal judge ruled that he must immediately pay the $148 million he owes two Georgia women he falsely accused of helping to steal the 2020 election.",
    "url": "https://www.washingtonpost.com/national-security/2023/12/21/rudy-giuliani-bankruptcy/"
  },
  {
    "text": "Harvard President Claudine Gay to Submit 3 Additional Corrections, Corporation Says Improper Citations Fall Short of Research Misconduct  —  Harvard President Claudine Gay will request three corrections to her 1997 Ph.D. dissertation in the latest series of updates Gay has submitted amid mounting allegations of plagiarism.",
    "url": "https://www.thecrimson.com/article/2023/12/21/gay-plagiarism-dissertation-corrections/"
  },
  {
    "text": "Harvard Finds More Instances of ‘Duplicative Language’ in President's Work  —  Claudine Gay has faced growing criticism of not only her response to antisemitism on campus but also her scholarship.  —  Harvard University, in the face of mounting questions over possible plagiarism … ",
    "url": "https://www.nytimes.com/2023/12/20/us/harvard-claudine-gay-plagiarism.html"
  },
  {
    "text": "New Poll by Saint Anselm College Survey Center finds Nikki Haley is the clear choice of voters that have an unfavorable opinion of former President Donald Trump  —  A new poll conducted by the Saint Anselm College Survey Center (SACSC) at the New Hampshire Institute of Politics (NHIOP) … ",
    "url": "https://www.anselm.edu/about/anselmian-hub/news/new-poll-saint-anselm-college-survey-center-finds-nikki-haley-clear-choice-voters-have-unfavorable-opinion-former-president-donald-trump"
  },
  {
    "text": "Fetterman, Breaking With the Left on Israel, Rejects ‘Progressive’ Label  —  The Pennsylvania senator, who has angered liberal Democrats with his staunchly pro-Israel stance and position on immigration, assailed the left and said he no longer considers himself a progressive.",
    "url": "https://www.nytimes.com/2023/12/21/us/politics/john-fetterman-progressive-israel.html"
  },
  {
    "text": "Jack Smith Swings Back at Trump in Push to Start Working on South Florida Jury Questionnaire  —  The special counsel's office on Thursday doubled down on its call for Judge Cannon to set an important Feb. 2 deadline that can kickstart the vetting of potential jurors",
    "url": "https://themessenger.com/politics/jack-smith-trump-judge-cannon-florida-jury-questionnaire"
  },
  {
    "text": "No Labels floats the possibility of a coalition government or Congress selecting the president in 2024  —  The group, which is trying to mount a third-party presidential campaign, could block a major party nominee from winning the Electoral College outright.",
    "url": "https://www.nbcnews.com/politics/2024-election/no-labels-coalition-government-electoral-college-rcna130709"
  },
  {
    "text": "Statement from National Economic Advisor Lael Brainard on U.S. Steel  —  The President believes U.S. Steel was an integral part of our arsenal of democracy in WWII and remains a core component of the overall domestic steel production that is critical to our national security.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/21/statement-from-national-economic-advisor-lael-brainard-on-u-s-steel/"
  },
  {
    "text": "N.H. man indicted after allegedly sending death threats to presidential candidates  —  The DOJ charged 30-year-old Tyler Anderson, of Dover, with three counts of transmitting in interstate commerce a threat to injure the person of another.  —  A New Hampshire man was indicted … ",
    "url": "https://www.politico.com/news/2023/12/21/new-hampshire-man-death-threats-candidates-00132931"
  },
  {
    "text": "The case of al-Shifa: Investigating the assault on Gaza's largest hospital  —  JERUSALEM — Weeks before Israel sent troops into al-Shifa Hospital, its spokesman began building a public case.  —  The claims were remarkably specific — that five hospital buildings were directly involved in Hamas activities … ",
    "url": "https://www.washingtonpost.com/world/2023/12/21/al-shifa-hospital-gaza-hamas-israel/"
  },
  {
    "text": "Schiff riding high amidst scramble for 2nd place in CA Senate race  —  Morning Consult poll reveals Rep. Adam Schiff as a clear leader in the race with Republican Steve Garvey and Democratic Reps. Katie Porter and Barbara Lee tied for second place.  —  LOS ANGELES — Rep. Adam Schiff holds … ",
    "url": "https://www.politico.com/news/2023/12/21/schiff-california-senate-00132816"
  },
  {
    "text": "Jordan expands probe into Smith's handling of Trump cases  —  House Judiciary Chair Jim Jordan (R-Ohio) expanded his probe into special counsel Jack Smith, asking him to turn over all documents and records related to his prosecutions of former President Trump.",
    "url": "https://thehill.com/homenews/house/4371789-jim-jordan-jack-smith-probe-trump-cases/"
  },
  {
    "text": "U.S. House quietly investigated separate sex tape scandal  —  The Scoop  —  The high-profile Senate sex scandal that rocked Washington, D.C. this month, was, in fact, the time in less thantwo years that sexually explicit videos filmed in the U.S. Capitol prompted an investigation.",
    "url": "https://www.semafor.com/article/12/20/2023/us-house-quietly-investigated-separate-sex-tape-scandal"
  }
]