[
  {
    "text": "Trump's inauguration expected to be moved indoors  —  President-elect Donald Trump's inauguration is expected to be moved indoors Monday due to dangerously cold temperatures projected in the nation's capital, multiple sources with direct knowledge of the plans told CNN.",
    "url": "https://www.cnn.com/2025/01/17/politics/inauguration-moving-indoors-cold-weather"
  },
  {
    "text": "Trump's inauguration moving indoors due to weather: Sources  —  Trump is expected to be sworn in inside the Capitol Rotunda, sources said.  —  A member of the U.S. Secret Service closes a security gate near the presidential Inauguration parade review stand on Pennsylvania Avenue on the north side … ",
    "url": "https://abcnews.go.com/Politics/trumps-inauguration-moving-indoors-due-weather-sources/story?id=117792480"
  },
  {
    "text": "Trump Moves Inauguration Indoors Amid Forecast of Extreme Cold  —  The change, a rare break with tradition, will deny Mr. Trump the pomp and large audience he hoped for at his second swearing-in.  —  President-elect Donald J. Trump said Friday that his inauguration would be moved inside the Capitol Rotunda because of weather concerns.",
    "url": "https://www.nytimes.com/2025/01/17/us/politics/trump-indoor-inauguration-cold.html?unlocked_article_code=1.p04.8POf.v9zmY1tZjtzE&smid=url-share"
  },
  {
    "text": "Statement from President Joe Biden on the Equal Rights Amendment  —  I have supported the Equal Rights Amendment for more than 50 years, and I have long been clear that no one should be discriminated against based on their sex.  We, as a nation, must affirm and protect women's full equality once and for all.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/17/statement-from-president-joe-biden-on-the-equal-rights-amendment/"
  },
  {
    "text": "Biden says the Equal Rights Amendment is law.  What happens next is unclear  —  President Biden on Friday declared that he considers the Equal Rights Amendment to the Constitution is “the law of the land,” a surprising declaration that does not have any formal force of effect … ",
    "url": "https://www.npr.org/2025/01/17/nx-s1-5264378/biden-era-national-archivist-constitution"
  },
  {
    "text": "Biden says the Equal Rights Amendment should be considered ratified  —  President Joe Biden announced Friday that the Equal Rights Amendment should be considered a ratified addition to the U.S. Constitution, making a symbolic statement that's unlikely to alter a decades-long push for gender equality.",
    "url": "https://apnews.com/article/joe-biden-equal-rights-amendment-era-16b554dfe913797a52f894b72684bc45"
  },
  {
    "text": "'I'm Urging You Not to Run': How Schumer Pushed Biden to Drop Out  —  The New York senator, who swallowed concerns for months and then dragged his feet on sharing them with President Biden, ultimately told him he risked going down as one of the “darkest figures.”",
    "url": "https://www.nytimes.com/2025/01/17/us/politics/schumer-biden-2024-election.html?unlocked_article_code=1.p04.D3Rb.sg4LPljl-qnD&smid=url-share"
  },
  {
    "text": "How Biden Destroyed His Legacy  —  During his four years in office, Joe Biden notched significant legislative victories with the narrowest of majorities in the Senate.  He presided over a virtuoso rollout of the COVID vaccines, the rapidity of which saved hundreds of thousands of lives … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/01/how-biden-destroyed-his-legacy/681342/"
  },
  {
    "text": "Supreme Court upholds law that would ban TikTok in the U.S.  —  Washington — The Supreme Court on Friday upheld a new law that would lead to a ban of the social media platform TikTok, clearing the way for the widely popular app to shutter in the U.S. as soon as Sunday.",
    "url": "https://www.cbsnews.com/news/supreme-court-tiktok-ban-ruling/"
  },
  {
    "text": "Statement from President Joe Biden on Additional Clemency Actions  —  Today, I am commuting the sentences of nearly 2,500 people convicted of non-violent drug offenses who are serving disproportionately long sentences compared to the sentences they would receive today under current law, policy, and practice.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/17/statement-from-president-joe-biden-on-additional-clemency-actions/"
  },
  {
    "text": "This Storm-Battered Town Voted for Trump.  He Has Vowed to Overturn the Law That Could Fix Its Homes.  —  Cynthia Robertson could be forgiven for feeling that the banner was aimed at her.  Its white-on-black lettering — “FUCK BIDEN AND FUCK YOU FOR VOTING FOR HIM” — hung from the wooden house right across the street from her own.",
    "url": "https://www.propublica.org/article/trump-biden-ira-climate-red-states"
  },
  {
    "text": "HHS Announces 15 Additional Drugs Selected for Medicare Drug Price Negotiations in Continued Effort to Lower Prescription Drug Costs for Seniors  —  Medicare has selected 15 more drugs to negotiate directly with participating drug companies.  Building on the success of the first round of negotiations … ",
    "url": "https://www.cms.gov/newsroom/press-releases/hhs-announces-15-additional-drugs-selected-medicare-drug-price-negotiations-continued-effort-lower"
  },
  {
    "text": "Vivek Ramaswamy plans to announce Ohio gubernatorial run  —  The co-leader of Trump's Department of Government Efficiency initiative plans to announce a run for Ohio governor, two people familiar with his plans said.  —  Biotech entrepreneur and former presidential candidate Vivek Ramaswamy plans … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/17/vivek-ramaswamy-ohio-governor-run/"
  },
  {
    "text": "Pamela Paul Is Out at the Times Opinion Section  —  The New York Times Opinion section is negotiating the exit of columnist Pamela Paul, according to multiple sources familiar with the matter.  Her impending departure is part of a handful of job cuts being made at the section.",
    "url": "https://nymag.com/intelligencer/article/pamela-paul-is-out-at-the-times-opinion-section.html"
  },
  {
    "text": "Antiabortion advocates look for men to report their partners' abortions  —  Boyfriends and husbands can have uniquely personal and specific information necessary to help surface new lawsuits in states with abortion bans.  —  As anti abortion advocates launch legal efforts to stop abortion pills … ",
    "url": "https://www.washingtonpost.com/investigations/2025/01/17/texas-abortion-pills-lawsuit/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3MDkwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4NDcyMzk5LCJpYXQiOjE3MzcwOTAwMDAsImp0aSI6ImYxZTlkNTE0LTlhMzktNDkzYi04YWRkLTRkYjZlMjA2YzQ1YyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI1LzAxLzE3L3RleGFzLWFib3J0aW9uLXBpbGxzLWxhd3N1aXQvIn0.-_kt4NsOkKcVPEZDocEnXtcgjXRJEE7X7fN4B7fYY1M&itid=gfta"
  },
  {
    "text": "How Democrats Drove Silicon Valley Into Trump's Arms  —  Marc Andreessen explains the newest faction of conservatism. … Ross Douthat: I'm someone who follows politics primarily and Silicon Valley secondarily.  And the alliance between the tech industry and the Democratic Party has always seemed … ",
    "url": "https://www.nytimes.com/2025/01/17/opinion/marc-andreessen-trump-silicon-valley.html?unlocked_article_code=1.p04.n5Ns.1xEHwQ3w_TZE&smid=url-share"
  },
  {
    "text": "Acosta at a Midnight Crossroads  —  CNN chief Mark Thompson wants Jim Acosta to take up the network's graveyard shift, delivering the anchor the proposal days before Donald Trump takes office. … Thompson, I'm told, delivered the veteran journalist a sudden and strange proposal: Move your show to midnight and anchor it until 2am ET.",
    "url": "https://www.status.news/p/jim-acosta-cnn-mark-thompson-midnight-offer"
  },
  {
    "text": "Donald Trump taps Sylvester Stallone, Mel Gibson and Jon Voight to be Hollywood ‘ambassadors’  —  Lights, camera, action.  —  President-elect Donald Trump tapped a group of well-known actors to become “special ambassadors” − not to represent the U.S. overseas but rather at home.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2025/01/16/trump-stallone-voight-gibson-hollywood-ambassadors/77750227007/"
  }
]