[
  {
    "text": "Secret Service rushes Trump off stage after popping noises heard at his Pennsylvania rally  —  A spectator at the rally was killed and two spectators were critically injured in an attack decried as “sick” by President Joe Biden.  The shooter is dead.  —  BUTLER, Pa. — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/secret-service-rushes-trump-stage-shots-fired-pennsylvania-rally-rcna161735"
  },
  {
    "text": "Trump rally shooting live updates: Shooter was a 20-year-old man from Pennsylvania, officials say  —  Donald Trump's campaign said in a statement that he was “fine” after being whisked off the stage at a rally in Butler, Pennsylvania after apparent gunshots rang through the crowd.",
    "url": "https://apnews.com/live/election-biden-trump-campaign-updates-07-13-2024"
  },
  {
    "text": "Trump says he was shot at rally in assassination attempt; spectator killed and shooter dead  —  A Trump spokesperson said the former president was “fine.”  —  Republican presidential candidate former President Donald Trump is surrounded by U.S. Secret Service agents at a campaign rally, Saturday, July 13, 2024, in Butler, Pa.",
    "url": "https://abcnews.go.com/Politics/trump-rushed-off-stage-disturbance-pennsylvania-rally/story?id=111913361"
  },
  {
    "text": "Trump is SHOT in the side of the head and left with blood strewn across his face in horrifying assassination attempt  —  Donald Trump was left bleeding from his ear after being shot on stage at a rally in a horrific attack by a would-be assassin.  —  A barrage of rifle rounds rained … ",
    "url": "https://www.dailymail.co.uk/news/article-13631849/Donald-Trump-shots-fired-Pennsylvania.html"
  },
  {
    "text": "Trump is fine after assassination attempt at his rally  —  BUTLER, Pa. — Former President Donald Trump was the target of an assassination attempt Saturday when a gunman opened fire at him at a rally about 30 miles north of Pittsburgh.  —  One person was killed in the shooting and two critically wounded, the U.S. Secret Service said.",
    "url": "https://www.npr.org/2024/07/13/g-s1-10048/trump-rally-gunshots"
  },
  {
    "text": "‘He just won the election’: Hill Republicans predict Trump rally shooting will ease path to White House  —  The shooting is sending shockwaves into an already tumultuous election.  —  Congressional Republicans already believed Donald Trump was headed back to the White House.",
    "url": "https://www.politico.com/news/2024/07/13/hill-republicans-trump-rally-shooting-00167995"
  },
  {
    "text": "Thomas Matthew Crooks ID'd as gunman who shot Trump during Pa. rally  —  The gunman who attempted to assassinate former President Donald Trump Saturday was identified as 20-year-old Thomas Matthew Crooks, sources told The Post.  —  Crooks, of Bethel Park, Pa., squeezed off shots … ",
    "url": "https://nypost.com/2024/07/13/us-news/thomas-matthew-crooks-idd-as-gunman-who-shot-trump-during-pa-rally/"
  },
  {
    "text": "Trump ‘felt the bullet ripping through the skin’ during campaign rally shooting  —  The former president was injured during a shooting at a rally in western Pennsylvania that killed one and injured two others.  —  Donald Trump survived a shooting Saturday evening at a campaign rally … ",
    "url": "https://www.politico.com/news/2024/07/13/trump-rushed-off-stage-at-pennsylvania-rally-after-possible-gunfire-00167977"
  },
  {
    "text": "Secret Service Rushed Donald Trump Offstage at His Pennsylvania Rally  —  The former president said he was shot and Secret Service said at least one attendee was killed at an event in Pennsylvania.  — Copy  —  Former President Donald Trump was wounded in a shooting at his campaign rally on Saturday night.",
    "url": "https://www.notus.org/trump-2024/donald-trump-pennsylvania-rally-secret-service"
  },
  {
    "text": "Statement from President Joe Biden  —  I have been briefed on the shooting at Donald Trump's rally in Pennsylvania.  —  I'm grateful to hear that he's safe and doing well.  I'm praying for him and his family and for all those who were at the rally, as we await further information.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/07/13/statement-from-president-joe-biden-6/"
  },
  {
    "text": "Biden spoke with Trump: White House official  —  President Biden spoke with Trump, a White House official told ABC News.  —  Biden also spoke with Pennsylvania Gov. Josh Shapiro and Butler Mayor Bob Dandoy, the official said.  —ABC News' Mary Bruce  —  Male shooter was killed by Secret Service counter-sniper: Source",
    "url": "https://abcnews.go.com/Politics/live-updates/donald-trump-rally-shooting-assassination-attempt/?id=111916828&entryId=111920910&cid=social_twitter_tw"
  },
  {
    "text": "Nikki Haley invited to speak at the Republican convention  —  As of Tuesday, an aide to the former Republican presidential candidate told NBC News that she had not yet received an invitation.  —  MILWAUKEE, Wis. — Former South Carolina Gov. Nikki Haley has been invited to speak … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-invited-speak-republican-convention-rcna161730"
  },
  {
    "text": "Joe Biden for President  —  I will do all that I can to see that President Biden is re-elected.  Why?  Despite my disagreements with him on particular issues, he has been the most effective president in the modern history of our country and is the strongest candidate to defeat Donald Trump — a demagogue and pathological liar.",
    "url": "https://www.nytimes.com/2024/07/13/opinion/joe-biden-president.html"
  },
  {
    "text": "Unbowed by Jan. 6 Charges, Republicans Pursue Plans to Contest a Trump Defeat … Nearly four years ago, Mr. Trump's attempt to challenge the election results was chaotic and improvised.  This year, his allies are systematically searching for any vulnerability in the nation's election system.Scott McIntyre for The New York Times",
    "url": "https://www.nytimes.com/2024/07/13/us/politics/republican-election-campaign-2024.html"
  },
  {
    "text": "Elon Musk Endorses Trump, Moments After Shooting at His Rally  —  Mr. Musk has drifted rightward considerably during the Biden era.  —  The tech billionaire Elon Musk endorsed former President Donald J. Trump's presidential campaign mere minutes after Mr. Trump was rushed from the stage at his rally in Pennsylvania.",
    "url": "https://www.nytimes.com/2024/07/13/us/politics/elon-musk-trump-endorsement.html"
  },
  {
    "text": "What Is Project 2025?  Inside the Far-Right Plan Threatening Everything from the Word ‘Gender’ to Public Education  —  Trump's allies started Project 2025 as a blueprint for marrying church and state at the highest levels of government if he's elected  —  A sweeping proposal for how Donald Trump … ",
    "url": "https://people.com/what-is-project-2025-inside-far-right-plan-trump-presidency-8622964"
  },
  {
    "text": "Inside Biden's sputtering campaign to restore Dems' confidence  —  Senate Democrats are sitting on their hands as the Biden campaign sputters.  —  Three of Joe Biden's senior aides entered a Senate Democratic lunch on Thursday armed with internal and external polls showing … ",
    "url": "https://www.politico.com/news/2024/07/13/democrats-biden-concerns-00167915"
  }
]