[
  {
    "text": "What to watch — and what to avoid — on election night  —  It's not about where to watch.  It's about how to watch.  —  Well, we made it.  It's Election Day.  —  Today could go down as one of the most important days in the history of our country as the nation decides between Vice President Kamala Harris … ",
    "url": "https://www.poynter.org/commentary/2024/what-to-watch-what-to-avoid-election-night/"
  },
  {
    "text": "Editor Jon Ralston's 2024 Nevada election predictions  —  I should have done the mic drop in 2022.  —  Picking the winners in the top two races, both of which were agonizingly close, should have been the swan song, the ride off into the sunset on my oracular career.",
    "url": "https://thenevadaindependent.com/article/editor-jon-ralstons-2024-nevada-election-predictions"
  },
  {
    "text": "Heads I win, tails you lose  —  In 2020, Donald Trump declared himself the winner of any state where a partial tally of votes showed him ahead.  —  As more votes were counted and Trump fell behind in states where he previously had an advantage, Trump claimed that was evidence of cheating.",
    "url": "https://popular.info/p/heads-i-win-tails-you-lose"
  },
  {
    "text": "Harris and Trump tie in Dixville Notch midnight vote to kick off Election Day  —  Vice President Kamala Harris and former President Donald Trump have tied with three votes each in the tiny New Hampshire township of Dixville Notch, kicking off Election Day in one of the first places in the country to report its presidential preference.",
    "url": "https://www.cnn.com/2024/11/05/politics/dixville-notch-new-hampshire-2024-results/"
  },
  {
    "text": "Trump and allies have primed supporters to falsely believe he has no chance of losing  —  It's possible former President Donald Trump wins the election - and also quite possible he loses.  But many in Trump's orbit keep falsely telling his supporters the only way that happens is because of cheating.",
    "url": "https://www.npr.org/2024/11/05/nx-s1-5179073/trump-and-allies-have-primed-supporters-to-falsely-believe-he-has-no-chance-of-losing"
  },
  {
    "text": "X's plan to interfere with the election  —  With polls essentially tied and hours to go until Election Day, no one knows for certain who will win the 2024 US presidential election.  But we can say with some certainty what will happen if the result is anything other than a landslide victory for Donald Trump … ",
    "url": "https://www.platformer.news/x-election-elon-musk-voter-fraud-misinformation/"
  },
  {
    "text": "The MAGA Propaganda Machine Has Successfully Censored Voices Calling Out its Lies  —  In 2020, the U.S. found itself in the midst of an unprecedented election—one defined not only by candidates or policies, but by a fight over what was real.  During that election, I was one of the leaders … ",
    "url": "https://www.theunpopulist.net/p/the-maga-propaganda-machine-has-successfully"
  },
  {
    "text": "A Trump Field Director Was Fired for Being a White Nationalist  —  A white nationalist worked on the Trump campaign in an important position in Pennsylvania for five months — until Friday, when the Pennsylvania GOP fired him after learning about his views from my reporting.",
    "url": "https://www.politico.com/news/magazine/2024/11/04/white-nationalist-trump-campaign-00187282"
  },
  {
    "text": "Musk's Twitter Is the Blueprint for a MAGA Government  —  Fire everyone.  Turn it into a personal political weapon.  Let chaos reign.  —  In a recent interview, the former Republican presidential candidate Vivek Ramaswamy made an offhanded comment that connected a few dots for me.",
    "url": "https://www.theatlantic.com/technology/archive/2024/11/elon-musk-twitter-federal-government/680530/?gift=bQgJMMVzeo8RHHcE1_KM0djcEb7-jcI6_OT23Kani-E&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Judges deny requests to block DOJ from monitoring polls  —  Federal judges denied two states' requests to bar the Justice Department (DOJ) from dispatching lawyers to monitor adherence to federal voting rights laws on Election Day.  —  Both Missouri and Texas asked federal courts to keep DOJ lawyers away from their polls.",
    "url": "https://thehill.com/regulation/court-battles/4972091-judge-wont-block-doj-election-poll-monitors/"
  },
  {
    "text": "Joint ODNI, FBI, and CISA Statement  —  Today, the Office of the Director of National Intelligence (ODNI), the Federal Bureau of Investigation (FBI), and the Cybersecurity and Infrastructure Security Agency (CISA) released the following statement:  —  Since our statement on Friday … ",
    "url": "https://www.fbi.gov/news/press-releases/joint-odni-fbi-and-cisa-statement-110424"
  },
  {
    "text": "MAGA outrage over wives voting for Kamala Harris is funny — but it's also dangerous  —  When it comes to political bait, it was the tastiest sort: a cheeky ad run by Vote Common Good, and voiced by Julia Roberts, reminding women that they don't have to tell their husbands if they vote for Vice President Kamala Harris.",
    "url": "https://www.salon.com/2024/11/05/bracing-for-magas-backlash-the-strategy-behind-secret-kamala-harris-is-safety/"
  },
  {
    "text": "Proud Boys claim they'll be at polling places as Trump ups violent rhetoric and election fraud claims  —  Though several Proud Boys leaders remain in prison on Jan. 6 charges, the far-right militia group remains active, with some chapters saying they'll watch the polls Tuesday.",
    "url": "https://www.nbcnews.com/politics/2024-election/proud-boys-claim-polling-places-trump-ups-violent-rhetoric-election-fr-rcna178386"
  },
  {
    "text": "Election 2024 live updates Polls open with Trump, Harris locked in a tight race  —  Election Day voting has begun in the high-stakes presidential race between Vice President Kamala Harris and former president Donald Trump that polls show to be incredibly close and likely to be decided by voters in a handful of battleground states.",
    "url": "https://www.washingtonpost.com/elections/2024/11/05/election-live-updates-trump-harris/"
  },
  {
    "text": "Georgia Poll Worker Arrested for Making Bomb Threat to Election Workers  —  For Immediate Release  —  A Georgia poll worker was arrested today for mailing a letter to the Jones County Elections Superintendent threatening poll workers.  —  According to the criminal complaint, Nicholas Wimbish … ",
    "url": "https://www.justice.gov/opa/pr/georgia-poll-worker-arrested-making-bomb-threat-election-workers"
  },
  {
    "text": "A pro-Trump influencer says a Russian agent paid him $100 to post a fake voter fraud video.  It wasn't the first time  —  An American social media influencer said he was paid $100 by a pro-Kremlin propagandist to post a fake video of Haitian immigrants claiming to vote in the US presidential election.",
    "url": "https://www.cnn.com/2024/11/04/politics/fake-georgia-voting-video-russian-disinformation/"
  },
  {
    "text": "Trump Announces Dumbest Person You Know Will Lead Missile Defense … Herschel Walker is back and ready to lead our country's missile defense system.  —  That is not some cruel joke, but a very real thing Donald Trump proposed at his Georgia rally on Sunday—minutes after Walker confused … ",
    "url": "https://newrepublic.com/post/187873/trump-dumbest-person-missile-defense-herschel-walker"
  },
  {
    "text": "Essentials, November 4, 2024  —  A compendium of the best reporting and commentary surrounding the pivotal 2024 elections in the United States.  You will rarely find horse race coverage here, or the standard “both sides” BS that passes so often for political journalism.",
    "url": "https://cornerstone.ghost.io/essentials-november-3-2024/"
  },
  {
    "text": "Georgia Judge Rejects Third Lawsuit From GOP Fulton County Election Official  —  A Georgia judge rejected a third lawsuit from Julie Adams — a GOP member of the Fulton County Board of Elections and Registration — seeking additional election records she claims she needs to certify tomorrow's election results.",
    "url": "https://www.democracydocket.com/news-alerts/georgia-judge-rejects-third-lawsuit-from-gop-fulton-county-election-official/"
  },
  {
    "text": "Americans Who Want Out  —  Some liberals insist that they're not joking this time: They are very scared, and very ready to leave the country if Donald Trump is reelected.  —  Every four years, some liberal Americans threaten to leave the country if a Republican wins the presidency.",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/americans-who-want-leave-country-election/680486/"
  },
  {
    "text": "Newspapers rapidly kill off the presidential endorsement … - Trump received seven endorsements last cycle. … - Tribune Publishing and MediaNews Group, both owned by Alden Global Capital, said their more than 68 daily and 300 weekly papers would no longer endorse presidents in 2022.",
    "url": "https://www.axios.com/2024/11/05/presidential-election-newspaper-endorsements"
  },
  {
    "text": "I was at Trump's side in 2016 — here's why he'll win again  —  Almost 10 years into former President Donald Trump's historic political movement, his critics still cannot grasp what makes him so popular with everyday hardworking Americans — and they still demonize the men and women who support him.",
    "url": "https://nypost.com/2024/11/04/opinion/i-was-at-trumps-side-in-2016-heres-why-hell-win-again/"
  },
  {
    "text": "If Trump were running against Biden right now, he'd be up 7 points  —  New YouGov polling offered Americans an alternative history: What if President Joe Biden hadn't dropped out?  —  Elections are riddled with what-ifs.  Some are immediate: What if we had spent more on television?",
    "url": "https://www.washingtonpost.com/politics/2024/11/05/trump-biden-harris-alternative-universes/"
  },
  {
    "text": "What ProPublica Reporters Will Be Watching on Election Day  —  Reporters from ProPublica will be on the ground watching stories they've covered unfold as voters head to the polls.  Among the issues: abortion, extremism, poll workers and election administration in battleground states.",
    "url": "https://www.propublica.org/article/election-day-2024-propublica-reporters"
  }
]