[
  {
    "text": "READ: Harris-Trump presidential debate transcript  —  Harris and Trump are meeting for the first time on the debate stage.  —  LIVE  —  Former President Donald Trump and Vice President Kamala Harris participate in a presidential debate in Philadelphia, Sept. 10, 2024.",
    "url": "https://abcnews.go.com/Politics/harris-trump-presidential-debate-transcript/story?id=113560542"
  },
  {
    "text": "Trump repeats false pet-eating claims leaving Harris dumbfounded as Republican nominee goes off rails  —  Former president repeats false claims that immigrants in Ohio were eating pets  —  Your support helps us to tell the story  —  As your White House correspondent, I ask the tough questions and seek the answers that matter.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-ohio-pets-springfield-debate-fact-check-b2610589.html"
  },
  {
    "text": "Trump pushes baseless claim about immigrants ‘eating the pets’  —  The former president was referring to rumors that have spread on social media for days claiming that Haitian immigrants in Ohio are abducting and eating pets.  —  Former President Donald Trump, during Tuesday's presidential debate … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-pushes-baseless-claim-immigrants-eating-pets-rcna170537"
  },
  {
    "text": "Economic fact-checks on Kamala Harris and Donald Trump's 1st presidential debate  —  The presidential debate was a tense back-and-forth between the two contenders.  —  Viewers gather to watch a debate between Democratic presidential nominee Vice President Kamala Harris and Republican … ",
    "url": "https://abcnews.go.com/Politics/economic-fact-checks-kamala-harris-donald-trumps-1st/story?id=113580112"
  },
  {
    "text": "House Republicans bemoan Trump debate performance: ‘Not good’  —  House Republicans are bemoaning former President Trump's performance in the first — and potentially only — debate against Vice President Harris, acknowledging that the Democratic nominee successfully got under her GOP opponent's skin.",
    "url": "https://thehill.com/homenews/house/4873509-trump-harris-debate-house-republicans/"
  },
  {
    "text": "Harris campaign wants a second presidential debate with Trump  —  The second meeting, if Trump agrees, would come in addition to an Oct. 1 debate between both major-party vice-presidential nominees  —  Vice President Kamala Harris wants to go another debate round with former president Donald Trump.",
    "url": "https://www.washingtonpost.com/politics/2024/09/10/harris-campaign-wants-second-presidential-debate-with-trump/"
  },
  {
    "text": "‘Trump Had A Bad Night’: Conservative Pundits Declare Kamala Harris Winner Of Debate  —  “Whoever prepared Donald Trump should be fired.  He was not good tonight at all,” former New Jersey Gov. Chris Christie said of the former president.  —  LOADING  —  Conservative pundits acknowledged … ",
    "url": "https://www.huffpost.com/entry/kamala-harris-donald-trump-debate-conservative-pundits_n_66e10734e4b027873082458d"
  },
  {
    "text": "Political consultant points out ‘Nate Silver is paid by Peter Thiel’ after 538 projects Trump victory  —  On Sunday, September 8, polling expert and FiveThirtyEight founder Nate Silver updated his presidential election forecast and gave GOP nominee Donald Trump a 63.8 percent chance of winning … ",
    "url": "https://www.alternet.org/nate-silver-stuart-stevens-polymarket/"
  },
  {
    "text": "More Bad News Hits Kamala on Night of Crucial Debate With Trump  —  It's debate night, and these aren't the headlines the Kamala Harris camp wanted to see leading up to what could be the decisive moment for the 2024 election.  The vice president must convince a large swath of voters who are undecided about her.",
    "url": "https://townhall.com/tipsheet/mattvespa/2024/09/10/kamala-harris-policy-section-has-a-serious-issue-n2644541"
  },
  {
    "text": "A quarter of Republicans think Trump should seize power even if he loses  —  As the election approaches, new polling shows the breadth of support for Trump's authoritarian tendencies.  —  If the 2024 presidential election were held today, it's not clear who would win.",
    "url": "https://www.washingtonpost.com/politics/2024/09/10/quarter-republicans-think-trump-should-seize-power-even-if-he-loses/"
  },
  {
    "text": "Taylor Swift endorses Kamala Harris  —  The musician's endorsement had been eagerly anticipated.  —  Pop superstar Taylor Swift endorsed Vice President Kamala Harris' presidential candidacy on Tuesday night after the conclusion of the high-stakes debate.  —  “I will be casting my vote … ",
    "url": "https://www.nbcnews.com/politics/2024-election/taylor-swift-endorses-kamala-harris-rcna170547"
  },
  {
    "text": "Trump on ObamaCare repeal: ‘I have concepts of a plan’  —  Former President Trump said during Tuesday night's debate he was interested in trying to repeal ObamaCare again, but indicated he doesn't have a plan to replace it.  —  “We are working on things.  We're going to do it.",
    "url": "https://thehill.com/policy/healthcare/4873254-trump-debate-obamacare-replacement/"
  },
  {
    "text": "Vance would have asked for new electors instead of certifying 2020 election results  —  Trump's current running mate said Pence “could have done more.”  —  Republican vice presidential nominee JD Vance said he would have had states submit new electors instead of certifying the 2020 election results … ",
    "url": "https://www.politico.com/news/2024/09/10/vance-electors-2020-election-00178266"
  },
  {
    "text": "GOP race to replace McConnell heats up  —  The leadership race to replace retiring Senate Republican Leader Mitch McConnell (Ky.) is heating up as Senate Republican Whip John Thune (S.D.) announced Tuesday that he will transfer $4 million to the National Republican Senatorial Committee (NRSC) … ",
    "url": "https://thehill.com/homenews/senate/4872532-senate-republican-leader-race/"
  },
  {
    "text": "Centrist Maine Democrat says he'll support GOP's short-term funding bill  —  A centrist House Democrat said Tuesday that he will back the Republicans' short-term government funding bill if it hits the floor Wednesday, as scheduled, becoming the first Democrat to announce support for the controversial spending package.",
    "url": "https://thehill.com/homenews/house/4872236-jared-golden-gop-funding-bill/"
  },
  {
    "text": "Trump's Awful Arlington Scandal Takes Its Most Disturbing Turn Yet  —  In recent days, Donald Trump has offered a highly distorted account of the confrontation at Arlington National Cemetery over his aides' use of the site as a backdrop for a slickly produced campaign video.",
    "url": "https://newrepublic.com/article/185783/trump-arlington-scandal-disturbing-turn"
  },
  {
    "text": "South Carolina congressman collapses at Ukraine event  —  Rep. Joe Wilson (R-S.C.) collapsed Tuesday night while attending Ukraine's Independence Day celebration in Washington D.C. .  —  Wilson appeared responsive as he received medical treatment.  Other attendees at the event said Wilson appeared to receive CPR after he fell.",
    "url": "https://thehill.com/homenews/house/4872930-rep-joe-wilson-collapses-ukraine-independence-day/"
  },
  {
    "text": "South Africa's DA Says Education Bill Poses Threat to Coalition  — President Ramaphosa plans to sign changes to law on Friday  — Dispute is first sign of cracks in three-month old coalition  —  South Africa's second-biggest political party warned that President Cyril Ramaphosa's plan … ",
    "url": "https://www.bloomberg.com/news/articles/2024-09-11/south-africa-s-da-says-education-bill-poses-threat-to-coalition"
  }
]