[
  {
    "text": "Inside the Explosive Meeting Where Trump Officials Clashed With Elon Musk  —  Simmering anger at the billionaire's unchecked power spilled out in a remarkable Cabinet Room meeting.  The president quickly moved to rein in Mr. Musk.  — 3.5k  —  Marco Rubio was incensed.",
    "url": "https://www.nytimes.com/2025/03/07/us/politics/trump-musk-doge-power.html?unlocked_article_code=1.2E4.f8eL.HfFykWbEEPJx&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "'I don't trust a word of it': Federal workers deeply skeptical that Trump will rein in Musk  —  The president and Republicans have faced political blowback over steep cuts to the workforce.  —  Federal workers, Democrats and even some Republican lawmakers want to believe that President Donald … ",
    "url": "https://www.politico.com/news/2025/03/07/musk-trump-federal-workers-firing-00218733"
  },
  {
    "text": "Marco Rubio Melts Down at Musk in Furious Cabinet Shouting Match  —  Marco Rubio blew up at Elon Musk at a closed-door Cabinet meeting after the DOGE head accused the secretary of state of failing to slash his staff, according to a report.Musk, the world's richest man, told the secretary of state … ",
    "url": "https://www.thedailybeast.com/marco-rubio-clashes-with-elon-musk-in-furious-cabinet-meeting-meltdown/"
  },
  {
    "text": "Is DOGE Losing Steam?  —  President Donald Trump's shift on the Department of Government Efficiency began with a warning from an unlikely source.  —  Jesse Watters, a co-host of the Fox News hit show The Five, is usually a slick deliverer of MAGA talking points.",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/trump-musk-power-restraints/681974/"
  },
  {
    "text": "EXCLUSIVE: Trump Makes Aggressive New Claim of Executive Power To Circumvent The Senate  —  In email obtained by TPM, White House claims that Trump can appoint whoever he wants - absent Congress.  —  The Trump White House has taken its attempt to seize direct control over the entire executive branch … ",
    "url": "https://talkingpointsmemo.com/news/exclusive-trump-makes-aggressive-new-claim-of-executive-power-to-circumvent-the-senate"
  },
  {
    "text": "I'm sad to share that I was fired today from the job I have poured my heart and soul into for the last three years.  I am so proud of the team we built in the Office of the Pardon Attorney, who will carry on our important work.  I'm very grateful for the many extraordinary people I've had the opportunity to connect with on this journey.",
    "url": "https://www.linkedin.com/posts/liz-oyer-245042206_im-sad-to-share-that-i-was-fired-today-from-activity-7303903623426560002-CneR"
  },
  {
    "text": "A Europe in Emotional Shock Grapples With a New Era  —  It remains to be seen how far President Trump's embrace of Russia and abandonment of traditional allies will go.  But “the West” may be gone.  —  For decades a core objective of the Soviet Union was to “decouple” the United States from Europe.",
    "url": "https://www.nytimes.com/2025/03/08/world/europe/a-europe-in-emotional-shock-grapples-with-a-new-era.html"
  },
  {
    "text": "Homeland Security ends TSA collective bargaining agreement, in effort to dismantle union protections  —  The Department of Homeland Security said Friday that it is ending the collective bargaining agreement with the tens of thousands of frontline employees at the Transportation Security Administration … ",
    "url": "https://apnews.com/article/collective-bargaining-agreement-tsa-homeland-security-e3eb1d5e0ae8e1b4a6fdb87cd7f6bd39"
  },
  {
    "text": "Federal prosecutors who worked on the Eric Adams case escorted out of workplace  —  It's the latest way the move to dismiss the case against New York City's mayor has roiled the Justice Department.  —  Two federal prosecutors in the Southern District of New York who worked on the case … ",
    "url": "https://www.nbcnews.com/politics/justice-department/federal-prosecutors-worked-eric-adams-case-escorted-workplace-rcna195398"
  },
  {
    "text": "Trump administration cancels $400 million in grants for Columbia University  —  The move comes shortly after the administration notified Columbia University that it was conducting a “comprehensive review” of its federal grants and contracts.  —  The Trump administration on Friday announced … ",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-administration-cancels-400-million-grants-columbia-university-rcna195373"
  },
  {
    "text": "Lauren Boebert Accuses Black Lawmaker of Waving ‘Pimp Cane’ at Trump  —  Rep. Lauren Boebert (R-CO) suggested that the Black lawmaker who yelled at President Donald Trump during a joint address to Congress is a “pimp.”  —  During Trump's speech on Tuesday, Rep. Al Green (D-TX) … ",
    "url": "https://www.mediaite.com/tv/lauren-boebert-accuses-black-lawmaker-of-waving-pimp-cane-at-trump/"
  },
  {
    "text": "Exclusive: Donald Trump Jr. Considering a Run For President in 2028  —  When President Donald Trump sat down for an interview with Fox News last month, anchor Bret Baier asked what should have been a softball question: “Do you view Vice President JD Vance as your successor, the Republican nominee in 2028?”",
    "url": "https://www.mediaite.com/politics/donald-trump-jr-considering-a-run-for-president-in-2028-sources/"
  },
  {
    "text": "DOGE Has Deployed Its GSAi Custom Chatbot for 1,500 Federal Workers  —  Elon Musk's DOGE team is automating tasks as it continues its purge of the federal workforce.  —  Elon Musk's so-called Department of Government Efficiency has deployed a proprietary chatbot called GSAi to 1,500 federal workers … ",
    "url": "https://www.wired.com/story/gsai-chatbot-1500-federal-workers/"
  },
  {
    "text": "Charlie Kirk warns “all these campuses that don't treat us well at Turning Point USA” may have their funding cut  —  Pro-Trump podcaster Kyle Forgeard talks about YouTube's event during Trump's inauguration weekend  —  Media Matters weekly newsletter, March 7  —  Broadcast correspondents covering climate change in 2024",
    "url": "https://www.mediamatters.org/charlie-kirk/charlie-kirk-warns-all-these-campuses-dont-treat-us-well-turning-point-usa-may-have"
  },
  {
    "text": "Many Fulbright scholars say they feel stranded after the Trump administration suspended their funding  —  ATHENS, Ohio (WOUB) - When an Ohio University international student woke up last Friday, he was expecting to see a deposit in his bank account, but he found an email in his inbox instead.",
    "url": "https://woub.org/2025/03/07/fulbright-scholars-feel-stranded-trump-administration-suspends-funding/"
  },
  {
    "text": "Trump names Fox News's Laura Ingraham, Maria Bartiromo to Kennedy Center board  —  President Trump announced Friday he's appointing Fox News hosts Laura Ingraham and Maria Bartiromo to the board of the Kennedy Center, after naming himself chair of the performing arts center last month.",
    "url": "https://thehill.com/blogs/in-the-know/5183864-trump-laura-ingraham-maria-bartiromo-kennedy-center/"
  },
  {
    "text": "Trans women transferred to men's prisons despite rulings against Trump's order  —  Incarcerated trans women report being groped by male guards and suicidal thoughts: 'I'm punished for existing'  —  Transgender women incarcerated in the US prison system have been transferred … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/07/transgender-women-prison-trump"
  },
  {
    "text": "Trump Tightens Grip on FBI and Justice Department  —  FBI Director Kash Patel's early requests at agency included how to securely contact the Oval Office  —  WASHINGTON—Among Kash Patel's first questions as FBI director was one that underscored who was now in charge.",
    "url": "https://www.wsj.com/politics/policy/trump-fbi-doj-control-84785a0e?st=YcLpm8&reflink=mobilewebshare_permalink"
  },
  {
    "text": "“Hundreds of Dead”: Inside the Fallout from Trump's Ukraine Intel Pause … In an emailed statement to TIME on Friday, Maxar Technologies confirmed the disruption to service in Ukraine.  “The U.S. government has decided to temporarily suspend Ukrainian accounts” in the system that the government uses … ",
    "url": "https://time.com/7265679/satellites-front-failing-hundreds-dead-fallout-trump-ukraine-aid-pause/"
  },
  {
    "text": "OCC Clarifies Bank Authority to Engage in Certain Cryptocurrency Activities  —  WASHINGTON—The Office of the Comptroller of the Currency (OCC) today took action to reaffirm that a range of cryptocurrency activities are permissible in the federal banking system.",
    "url": "https://occ.gov/news-issuances/news-releases/2025/nr-occ-2025-16.html"
  },
  {
    "text": "With Drones and North Korean Troops, Russia Pushes Back Ukraine's Offensive  —  Russia has retaken about two-thirds of the territory Ukraine seized last summer in the Kursk region of Russia, but at a fearful cost in lives.  —  Russian and North Korean forces have made significant battlefield advances … ",
    "url": "https://www.nytimes.com/2025/03/08/world/europe/ukraine-russia-north-korea-kursk.html"
  },
  {
    "text": "New DOGE Staffer Has Ties to a Sanctioned Russian Oligarch  —  Sam Corcos, a new member of Elon Musk's DOGE team, reportedly showed up at the IRS demanding detailed info about American taxpayers to hunt for fraud  —  There is a new staffer from the so-called Department of Government Efficiency seeking access … ",
    "url": "https://www.rollingstone.com/politics/politics-features/doge-staffer-corcos-wife-ties-russian-oligarch-1235291673/"
  },
  {
    "text": "Trump Administration Forces Out More Senior Justice Dept. Officials  —  The Trump administration targeted veteran career lawyers who managed pardon work, bankruptcy litigation and other legal issues in the latest wave of forced departures.  —  The Trump administration on Friday forced … ",
    "url": "https://www.nytimes.com/2025/03/07/us/politics/trump-justice-dept-ousters.html"
  },
  {
    "text": "Thrust into unemployment, axed federal workers face relatives who celebrate their firing  —  NEW YORK (AP) — Scrambling to replace their health insurance and to find new work, some laid-off federal workers are running into another unexpected unpleasantry: Relatives cheering their firing.",
    "url": "https://www.bostonherald.com/2025/03/07/trump-doge-family-strife/"
  },
  {
    "text": "DOGE's Latest Casualty: The Government's Texting Service For Urgent Reminders  —  Code in the agency's web site says the service is no longer available.  Sources tell Forbes most of the team that manages it have been “fired, transferred, or have resigned.”  —  Cyrus Farivar is a Forbes senior writer who covers retail and more.",
    "url": "https://www.forbes.com/sites/cyrusfarivar/2025/03/07/doges-latest-casualty-the-governments-texting-service-for-urgent-reminders/"
  },
  {
    "text": "‘Just following Hispanic people’: Citizen detained by ICE questions vote for Trump  —  Manassas man says he was pulled over on his way to work by agents looking for another man  —  A naturalized Hispanic man says he was detained by Immigration and Customs Enforcement agents who were looking … ",
    "url": "https://www.nbcwashington.com/news/local/northern-virginia/just-following-hispanic-people-citizen-detained-by-ice-questions-vote-for-trump/3861172/"
  },
  {
    "text": "Sam Bankman-Fried Ramps Up Effort for a Pardon From Trump  —  Mr. Bankman-Fried's family and allies are trying to help him escape a 25-year prison sentence for fraud related to the collapse of his cryptocurrency exchange, FTX.  —  Consulting with a lawyer who has ties to President Trump.",
    "url": "https://www.nytimes.com/2025/03/07/technology/sam-bankman-fried-pardon-trump.html"
  },
  {
    "text": "Fox Business host on ‘shocking decline’ in consumer spending: ‘The boom times are over’  —  Fox Business Network host Charles Payne said the apparent decline in consumer spending was “shocking” on Friday, and said a return to “boom times” was not on the horizon.",
    "url": "https://thehill.com/business/5183167-fox-business-host-on-shocking-decline-in-consumer-spending-the-boom-times-are-over/"
  }
]