[
  {
    "text": "Senate Version of Trump's Policy Bill Would Slash Medicaid Spending Even More  —  Analysis from the nonpartisan Congressional Budget Office found that Republicans' new version of the legislation would make far deeper cuts and lead to more people becoming uninsured than previous proposals.",
    "url": "https://www.nytimes.com/2025/06/29/us/politics/trump-policy-bill-health-insurance-cuts.html?unlocked_article_code=1.Sk8.Z70s.6Fin2_Yt0XQQ&smid=re-share"
  },
  {
    "text": "Senate's “big, beautiful bill” would add $3.3 trillion in new debt: CBO  —  The Senate reconciliation package being debated this weekend would add nearly $3.3 trillion in budget deficits over the next 10 years, according to a new estimate by the Congressional Budget Office (CBO).",
    "url": "https://www.axios.com/2025/06/29/senate-big-beautiful-bill-deficits-debt"
  },
  {
    "text": "Republican Senate tax bill would add $3.3 trillion to the US debt load, CBO says  —  The changes made to President Donald Trump's big tax bill in the Senate would pile trillions onto the nation's debt load while resulting in even steeper losses in health care coverage, the nonpartisan … ",
    "url": "https://apnews.com/article/cbo-trump-tax-bill-republicans-senate-5f591bea21bd95eec45ba90c93c50687"
  },
  {
    "text": "Senate rulekeeper deals blows to revised ‘big, beautiful bill’  —  A Medicaid carveout for Alaska was among the “Byrd bath” casualties.  —  The Senate's rewritten domestic policy bill faces new hurdles after the parliamentarian advised senators Sunday that several provisions violate … ",
    "url": "https://www.politico.com/news/2025/06/29/megabill-byrd-alaska-megabill-parliamentarian-00431730"
  },
  {
    "text": "G.O.P. Toils to Find Votes for Policy Bill as Senate Prepares to Debate  —  New official estimates showed the bill would swell deficits while slashing health programs and insurance coverage, posing potential problems as the legislation moved forward in the Senate.",
    "url": "https://www.nytimes.com/2025/06/29/us/politics/senate-trump-domestic-policy-bill.html"
  },
  {
    "text": "Sen. Thom Tillis won't run for reelection in 2026  —  Sen. Thom Tillis won't run for re-election in 2026, the North Carolina Republican announced Sunday. … - “It's not a hard choice, and I will not be seeking re-election,” Tillis said in a statement announcing his plans.",
    "url": "https://www.axios.com/2025/06/29/thom-tillis-retire-senate-north-carolina"
  },
  {
    "text": "Thom Tillis, Republican Senator, Won't Seek Re-election Amid Trump's Primary Threats  —  The day after President Trump castigated the North Carolina Republican for opposing the policy bill carrying his domestic agenda, the senator announced he would not seek a third term.",
    "url": "https://www.nytimes.com/2025/06/29/us/politics/thom-tillis-retirement.html"
  },
  {
    "text": "Trump reacts to Tillis not seeking re-election, sends warning to ‘cost cutting Republicans’  —  North Carolina Republican was one of only two GOP senators who voted against advancing Trump's ‘big, beautiful bill’  —  President Donald Trump celebrated the retirement announcement … ",
    "url": "https://www.foxnews.com/politics/trump-reacts-tillis-not-seeking-re-election-sends-warning-cost-cutting-republicans?intcmp=tw_fnc&taid=6861cb180066c10001c99b41"
  },
  {
    "text": "GOP Sen. Thom Tillis says he's not running for re-election in North Carolina  —  The announcement comes one day after Tillis voted against advancing a massive bill for Trump's agenda in the Senate.  —  WASHINGTON — Sen. Thom Tillis, R-N.C., announced Sunday that he would not run for re-election … ",
    "url": "https://www.nbcnews.com/politics/2026-election/gop-sen-thom-tillis-not-running-re-election-north-carolina-rcna215819"
  },
  {
    "text": "Multiple firefighters shot in Coeur d'Alene, Idaho, while responding to a brush fire  —  Multiple firefighters have been shot while responding to a brush fire in Coeur d'Alene, Idaho, according to Northern Lakes Fire Protection Chief Pat Riley.  —  Kootenai County Emergency Management … ",
    "url": "https://cnn.com/2025/06/29/us/coeur-dalene-idaho-shooter"
  },
  {
    "text": "Sheriff says 2 killed after firefighters shot at near Coeur d'Alene, police are ‘taking sniper fire’  —  A sniper ambushed firefighters responding to a blaze in an Idaho mountain community Sunday, killing at least two people and unleashing barrages of gunfire over several hours in an attack the governor called a “heinous” assault.",
    "url": "https://apnews.com/article/coeur-dalene-idaho-shooting-57e4143642c5a0e98d134051a7147a89"
  },
  {
    "text": "Intercepted call of Iranian officials downplays damage of U.S. attack  —  The officials were heard saying Trump's strike on Iran proved less devastating than expected.  The administration calls the intelligence insignificant.",
    "url": "https://www.washingtonpost.com/national-security/2025/06/29/trump-iran-nuclear-damage-intercepted-call/"
  },
  {
    "text": "Zohran Mamdani doubles down on plan to target ‘whiter neighborhoods’ with higher taxes — and says billionaires shouldn't exist  —  Socialist New York City mayoral candidate Zohran Mamdani doubled down Sunday on his plan to jack up property taxes on “richer and whiter neighborhoods” — while asserting billionaires shouldn't exist.",
    "url": "https://nypost.com/2025/06/29/us-news/zohran-mamdani-doubles-down-on-plan-to-target-richer-and-whiter-neighborhoods/"
  },
  {
    "text": "Iran could restart enriching uranium in months, says nuclear watchdog chief  —  Comments by IAEA's Rafael Grossi follow week of conflicting claims about damage done by US and Israeli strikes  —  Iran could be able to start producing enriched uranium again “in a matter of months” … ",
    "url": "https://www.ft.com/content/b639c6ab-49ac-438c-9a3c-dfda75b2f4dd"
  },
  {
    "text": "Trump says there will be ‘temporary pass’ for migrant farm, hotel workers  —  President Trump said that there will be a temporary pass issued for migrants working at farms and in the hospitality industry to allow employers to have more control after the administration has sent mixed messages … ",
    "url": "https://thehill.com/homenews/administration/5375717-trump-temporary-pass-migrant-farm-hotel-workers/"
  },
  {
    "text": "Rick Scott drafts key Medicaid amendment ahead of voting marathon  —  Florida Sen. Rick Scott is circulating text of his amendment to the GOP megabill that would effectively end a key Medicaid financing mechanism after 2030.  The provision won the backing of Senate Majority Leader John Thune during … ",
    "url": "https://www.politico.com/live-updates/2025/06/29/congress/rick-scott-medicaid-amendment-00432227"
  },
  {
    "text": "In Sudan, where children clung to life, doctors say USAID cuts have been fatal  —  The Trump administration's cuts to USAID had an immediate and deadly impact in war-ravaged Sudan, according to civilians, doctors and aid officials.  —  QUAZ NAFISA, Sudan — The 3-year-old boy darted among the mourners … ",
    "url": "https://www.washingtonpost.com/world/2025/06/29/sudan-usaid-funding-cuts-trump-musk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxMTY5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyNTUxOTk5LCJpYXQiOjE3NTExNjk2MDAsImp0aSI6IjFjMmUyZjZhLTJiNTItNDk1MS1iODc1LTc3OWJmNmFjYmRhMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzA2LzI5L3N1ZGFuLXVzYWlkLWZ1bmRpbmctY3V0cy10cnVtcC1tdXNrLyJ9.-eu12N37wEKFEzuv7q2jbfb3b91idbSw7EpJ9aMBZC8&itid=gfta"
  },
  {
    "text": "How Zohran Mamdani Brought New Voters to the Polls  —  Mr. Mamdani, the likely winner of the Democratic primary for mayor of New York City, drew tens of thousands of new voters to the polls.  Here's how.  —  Upstart challengers in political races often begin with the goal of drawing new or disillusioned voters to their cause.",
    "url": "https://www.nytimes.com/2025/06/29/nyregion/zohran-mamdani-voters-strategy.html?unlocked_article_code=1.Sk8.md1v.BJkCrKImVM5k&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Tim Walz eulogizes slain lawmaker as a historic Minnesotan — and friend  —  Minnesota Gov. Tim Walz sat in a front pew during Melissa and Mark Hortman's funeral alongside former president Joe Biden and former vice president Kamala Harris.  —  Scores of mourners tearfully bid farewell … ",
    "url": "https://www.washingtonpost.com/nation/2025/06/28/melissa-hortman-minnesota-funeral-boetler/"
  }
]