[
  {
    "text": "Exclusive: Kamala Harris could join podcaster Joe Rogan for an interview - sources  —  Democratic presidential nominee Kamala Harris could sit down with popular podcaster Joe Rogan for an interview in the final stretch of the U.S. presidential campaign, three sources with knowledge of the matter said on Monday.",
    "url": "https://www.reuters.com/world/us/kamala-harris-could-join-podcaster-joe-rogan-an-interview-sources-2024-10-15/"
  },
  {
    "text": "Harris Goes On Fox.  Trump Sticks to the Henhouse.  —  With Harris taking some real risks in the closing weeks, the ex-president is basically talking to fanboys.  —  Three weeks to go!  Happy Tuesday.  —  Playing to Win  —  Until now, Kamala Harris's campaign has executed a smooth … ",
    "url": "https://www.thebulwark.com/p/harris-goes-on-fox-trump-sticks-to"
  },
  {
    "text": "Trump Is Big Mad That Fox News Is Interviewing Harris  —  After the network announced that the vice president would sit down for an interview, Trump raged on social media  —  REPUBLICAN PRESIDENTIAL NOMINEE Donald Trump, increasingly prone to temper tantrums and outbursts of violent rhetoric … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-mad-fox-news-harris-interview-1235133638/"
  },
  {
    "text": "Trump sways and bops to music for 39 minutes in bizarre town hall episode  —  The scene comes as Vice President Kamala Harris has called Trump, 78, unstable and called into question his mental acuity.  —  OAKS, Pa. — The town hall, moderated by South Dakota Gov. Kristi L. Noem (R) … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/14/trump-music-sways-town-hall/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4ODc4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwMjYwNzk5LCJpYXQiOjE3Mjg4Nzg0MDAsImp0aSI6IjhiMTg0YzljLTMzNzEtNGU0YS05N2JjLWZjODAxZGFhY2QyOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzE0L3RydW1wLW11c2ljLXN3YXlzLXRvd24taGFsbC8ifQ.pyvRxp5n3WOTnCOWjyKNFh1y73JJFJf7B-qB-nKRbns"
  },
  {
    "text": "Trump Plots to Declare 2024 ‘Rigged’ — Using GOP Efforts to Slow the Vote Count  —  The former president and his allies have worked to make sure 2024 mail-in ballots are counted slowly, so he can again demand officials “stop the count”  —  WITH JUST WEEKS left in the 2024 presidential contest … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-election-rigged-slow-vote-count-2024-1235133890/"
  },
  {
    "text": "Trump's GOP moves to dramatically revamp election rules  —  Republican allies of former President Trump have embarked on a sweeping effort to restrict voting and purge voter rolls across the country since the 2020 election, something critics fear could stymie participation in the November contest … ",
    "url": "https://thehill.com/regulation/national-security/4932080-trump-allies-restrict-voting/"
  },
  {
    "text": "Georgia judge rules county election officials must certify election results  —  A Georgia judge on Tuesday ruled that county election officials may not delay or decline to certify election results based on suspicions of fraud.  —  Fulton County Superior Court Judge Robert McBurney wrote … ",
    "url": "https://thehill.com/regulation/court-battles/4933902-georgia-judge-election-results-certification/"
  },
  {
    "text": "Why I just endorsed Kamala Harris  —  Some conservatives reject Trump but cannot bring themselves to vote for the one candidate who could stop him.  I refuse to be one of them.  —  In Dante's “Inferno,” as I've previously written, moral cowards aren't even allowed into hell.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/wisconsin-republican-endorsing-kamala-harris-donald-trump-rcna175321"
  },
  {
    "text": "Neil Gorsuch's New Book Is an Embarrassment  —  The conservative Supreme Court justice produced a tendentious account of the legal system in service of a political narrative — and he won't answer his critics.  —  The Supreme Court began its new term last week at a perilous moment for the institution.",
    "url": "https://www.politico.com/news/magazine/2024/10/15/neil-gorsuch-book-supreme-court-00183518"
  },
  {
    "text": "Donald Trump's Fascist Romp  —  After the former president described American citizens as “the enemy within,” Glenn Youngkin reveals his own complicity.  —  Over the past week, Donald Trump has been on a fascist romp.  At rallies in Colorado and California, he amped up his usual rants … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/donald-trumps-fascist-romp/680252/?gift=otEsSHbRYKNfFYMngVFweL5rDnTTbYjSsuGhjoo5nyU"
  },
  {
    "text": "The Glaring Truth About That Man With Guns Arrested at a Trump Rally  —  MAGA Republicans have begun touting the arrest of an armed man outside Donald Trump's rally Saturday as a “thwarted” third assassination attempt, but federal investigators said that there was no indication that the man … ",
    "url": "https://newrepublic.com/post/187149/donald-trump-third-assassination-attempt-truth"
  },
  {
    "text": "‘Donald Trump gives up on speaking’: Fox News correspondent blasts ‘strange’ MAGA town hall  —  Fox News national correspondent Bryan Llenas detailed his experience as a Donald Trump town hall attendee in Oaks, Pennsylvania Monday night, after the former president stopped speaking and “started playing music” instead.",
    "url": "https://www.alternet.org/fox-news-correspondent-trump-rally/"
  },
  {
    "text": "Tradeoffs are real  —  Sorry, but it's true  —  The other day, I found myself clicking on a link to a report from the Roosevelt Institute and the Climate & Community Institute titled “Planning to Build Faster: A Solar Energy Case Study.”  This is a topic that I'm really interested in.",
    "url": "https://www.slowboring.com/p/tradeoffs-are-real"
  },
  {
    "text": "Trump's Campaign Manager Chris LaCivita's Multi-Million Payday Revealed  —  HOW MUCH?  —  Chris LaCivita, the Republican strategist entrusted with returning Trump to the White House, has eye-opening deals with the campaign, the Daily Beast has learned.",
    "url": "https://www.thedailybeast.com/donald-trumps-campaign-manager-chris-lacivitas-multi-million-payday-revealed"
  },
  {
    "text": "JD Vance Awfully Quiet After Report on How His Mom Got Health Care  —  JD Vance credited Donald Trump for his family being able to get off of Medicaid and onto private health insurance, at the vice presidential debate earlier this month.  But he isn't telling the whole story: that it was due to Obamacare.",
    "url": "https://newrepublic.com/post/187152/jd-vance-report-mom-health-care"
  },
  {
    "text": "The American economy has left other rich countries in the dust  —  “On present policies and performance, the United States is condemned to slower growth than the other main industrial countries for the foreseeable future.”  So declared the Competitiveness Policy Council … ",
    "url": "https://www.economist.com/special-report/2024/10/14/the-american-economy-has-left-other-rich-countries-in-the-dust"
  },
  {
    "text": "The Kavanaugh cover-up  —  Over the last few years, the Supreme Court majority has issued a series of rulings that have fundamentally reshaped America — ending federal protections for abortion rights, upending the ability of federal agencies to issue regulations, and granting the president near-total immunity from criminal prosecution.",
    "url": "https://popular.info/p/the-kavanaugh-cover-up"
  },
  {
    "text": "Republican Operatives Function as Hidden Hand Behind Pro-Trump Efforts  —  A political nonprofit organization called Building America's Future has raised and spent more than $100 million over the past four years.  —  A group of Republican donors and operatives has been the hidden hand behind … ",
    "url": "https://www.nytimes.com/2024/10/15/us/elections/trump-money-building-americas-future.html"
  },
  {
    "text": "“Brain flaws”: Understanding MAGA as an epidemic disease  —  Epidemiologist Dr. Gary Slutkin: MAGA is a “dangerous and lethal syndrome” of “Authoritarian Violence Disorder”  —  The American people are being smothered by public opinion polls.  Every day there seems to be some new poll expected … ",
    "url": "https://www.salon.com/2024/10/15/brain-flaws-understanding-maga-as-an-epidemic-disease/"
  },
  {
    "text": "Behind the Curtain — Election scenario 2: Harris sweep … - Democrats would race to make American courts less conservative, and hope for a Republican-appointed Supreme Court justice to retire.  —  This period of unified Democratic power would likely last two years, until the next congressional races … ",
    "url": "https://www.axios.com/2024/10/15/kamala-harris-election-win-scenario-democrats"
  }
]