[
  {
    "text": "In Which Ian Miles Cheong Understands Trump's Campaign Better than NYT  —  The second I saw video of Vice President Harris rolling up to a hangar at Detroit's airport on Air Force Two, then alighting with Tim Walz in front of cheering crowds, I knew it would break Donald Trump's brain.",
    "url": "https://www.emptywheel.net/2024/08/12/in-which-ian-miles-cheong-understands-trumps-campaign-better-than-nyt/"
  },
  {
    "text": "Donald Trump Is Freaked Out in Ways He Never Imagined Were Possible  —  The Harris-Walz campaign proved two important things last week.  First, it proved that sometimes all you really have to do is answer attacks—the mere fact of answering them deflates their momentum.",
    "url": "https://newrepublic.com/article/184754/donald-trump-freaked-out-harris-walz-attacks"
  },
  {
    "text": "Republicans can't replace their old man nominee, so they're pretending JD Vance is the GOP candidate  —  Donald Trump's running mate weirds voters out, but at least he's not an incoherent mess like his boss  —  “What a stupid question this is!”  Donald Trump recently raged at a journalist during … ",
    "url": "https://www.salon.com/2024/08/12/cant-replace-their-old-man-nominee-so-theyre-pretending-jd-vance-is-the-candidate/"
  },
  {
    "text": "The Reintroduction of Kamala Harris  —  The soundtrack suggested a Beyoncé concert.  The light-up bracelets evoked the Eras Tour.  And the exuberant crowd—more than 14,000 strong, lining up in the rain—resembled the early days of Barack Obama.  Inside a Philadelphia arena on Aug. 6 … ",
    "url": "https://time.com/7009317/reintroduction-of-kamala-harris/"
  },
  {
    "text": "Desperate times: Trumpers launch Swiftboating 2.0  —  They're taking a page out of Karl Rove's shameful playbook. … Donald Trump is down so bad that his campaign is bringing back Republican dirty tricks from 20 years ago.  —  Kamala Harris is packing arenas and rising in the polls … ",
    "url": "https://www.publicnotice.co/p/swiftboating-vance-walz-military-record"
  },
  {
    "text": "The most expensive political ad of all time  —  In 2022, Elon Musk purchased Twitter, one of the world's largest social networks, for $44 billion.  From a financial perspective, it has not worked out well.  Over the last two years, the value of Twitter — which Musk renamed X — has plunged.",
    "url": "https://popular.info/p/the-most-expensive-political-ad-of"
  },
  {
    "text": "Poll: Democratic attacks on JD Vance are working  —  The Scoop  —  New polling shared exclusively with Semafor shows Democrats' attacks on JD Vance's views on abortion, divorce and “childless cat ladies” are sticking with voters.  —  A pair of surveys by Blueprint, the centrist Democratic pollster backed … ",
    "url": "https://www.semafor.com/article/08/12/2024/poll-democratic-attacks-on-jd-vance-are-working"
  },
  {
    "text": "Far-right rallies abandoned amid warnings of 10-year sentences  —  Anti-racism marches attract large crowds as foreign secretary says rioters forgot ‘what it means to be English’  —  Planned far-right rallies did not materialise over the weekend, amid a large turnout of anti-racist protesters … ",
    "url": "https://www.theguardian.com/politics/article/2024/aug/11/far-right-demonstrations-abandoned-amid-warnings-of-10-year-sentences"
  },
  {
    "text": "Trump to sue DOJ for $100M over Mar-a-Lago raid, alleging ‘political persecution’  —  Trump attorney says ‘unconstitutional’ raid should never have been approved by Garland, Wray  —  Join Fox News for access to this content  —  EXCLUSIVE: Former President Donald Trump is set to sue … ",
    "url": "https://www.foxnews.com/politics/trump-sue-doj-100m-over-mar-a-lago-raid-alleging-political-persecution"
  },
  {
    "text": "White House launches broad new regulatory effort, as Harris prepares to unveil economic plan … The Biden Administration on Monday unveiled a new, multi-agency regulatory initiative to target corporate practices that officials claim are designed to waste consumers' time and needlessly burden … ",
    "url": "https://www.cnbc.com/2024/08/12/biden-harris-new-regulations-would-target-corporations-that-waste-consumers-time.html"
  },
  {
    "text": "Early numbers show violent crime dropping sharply … - It also gives Vice President Kamala Harris, a former prosecutor in San Francisco and California attorney general, a potent defense against attacks from the right on crime. … - 54 of the 69 major cities in the report saw drops in violent crime … ",
    "url": "https://www.axios.com/2024/08/12/violent-crime-harris-trump-election"
  },
  {
    "text": "‘A different level than 2020’: Trump's plan to steal election is taking shape  —  Trump's refusal to accept the 2020 election results serves as a preview to expected challenges in November  —  The fight for democracy is supported by  —  There wasn't anything particularly controversial … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/12/trump-overturn-result-presidential-election-vote"
  },
  {
    "text": "Delays hit 40% of Biden's major IRA manufacturing projects  —  FT research shows that $84bn of initiatives announced in first year of the IRA and Chips Act have experienced slowdowns  —  Some 40 per cent of the biggest US manufacturing investments announced in the first year … ",
    "url": "https://www.ft.com/content/afb729b9-9641-42b2-97ca-93974c461c4c"
  },
  {
    "text": "Betsy DeVos would consider working with Trump again — under one condition  —  Donald Trump's former education secretary Betsy DeVos has changed her mind on serving in his administration if he wins re-election.  —  DeVos resigned on Jan. 7, 2021, following the U.S. Capitol riot, which she called … ",
    "url": "https://www.rawstory.com/betsy-devos-2668949091/"
  },
  {
    "text": "Americans' refusal to keep paying higher prices may be dealing a final blow to US inflation spike  —  The great inflation spike of the past three years is nearly spent — and economists credit American consumers for helping slay it.  Some of America's largest companies, from Amazon to Disney to Yum Brands … ",
    "url": "https://apnews.com/article/inflation-prices-consumers-economy-spending-federal-reserve-c69408f05baeffac0023ceb76b747999"
  },
  {
    "text": "Obama secretly running Kamala Harris campaign: ex-Speaker McCarthy  —  Former President Barack Obama is secretly running Kamala Harris' presidential campaign, using his people to direct her bid, ex-Republican House Speaker Kevin McCarthy claimed Sunday.  —  “If you're watching the campaign now … ",
    "url": "https://nypost.com/2024/08/11/us-news/obama-secretly-running-kamala-harris-campaign-ex-speaker-mccarthy/"
  }
]