[
  {
    "text": "Workers Say They Were Tricked and Threatened as Part of Elon Musk's Get-Out-the-Vote Effort  —  America PAC door knockers were flown to Michigan, driven in the back of a U-Haul, and told they'd have to pay hotel bills unless they met unrealistic quotas.  One was surprised they were working to elect Donald Trump.",
    "url": "https://www.wired.com/story/elon-musk-america-pac-blitz-canvassing-michigan-uhaul/"
  },
  {
    "text": "Biden ‘Garbage’ Remark Causes Big Stink: Latest Responses  —  Kamala Harris delivered the closing argument of her campaign on Tuesday night, telling about 75,000 people assembled on the Ellipse in Washington that she will work to deliver for everyday Americans, while Donald Trump is a “petty tyrant” who's “obsessed with revenge.”",
    "url": "https://nymag.com/intelligencer/article/did-biden-call-trump-supporters-garbage-latest-responses.html"
  },
  {
    "text": "Biden's ‘Garbage’ Comment Complicates Harris Campaign, Worrying Insiders  —  President Biden did not attend Vice President Kamala Harris's speech on Tuesday night, but his ill-timed flub in a video interview caused headaches for her campaign.  —  Vice President Kamala Harris's strategists … ",
    "url": "https://www.nytimes.com/2024/10/30/us/politics/biden-comments-harris-campaign.html"
  },
  {
    "text": "Billionaire Trump Awkwardly Dresses Up as a Garbage Truck Driver  —  Trump climbed onto a campaign-themed garbage truck in an attempt to seize on disputed remarks by Biden made earlier this week  —  Republican presidential candidate and billionaire Donald Trump once again made a mockery … ",
    "url": "https://www.rollingstone.com/politics/politics-news/billionaire-trump-dresses-up-garbage-truck-driver-1235148279/"
  },
  {
    "text": "No, Corporate Media.  This Isn't the October Surprise You've Been Waiting For  —  Joe called hateful rhetoric “garbage,” end of story  —  This morning as I was reviewing the Press coverage of Kamala's historic DC event, something else caught my attention that was too ridiculous to ignore.",
    "url": "https://www.dworkinsubstack.com/p/no-corporate-media-this-isnt-the"
  },
  {
    "text": "Trump Doubles Down After Elon's Shocking “Tank the Economy” Confession  —  Just hours after Elon Musk admitted Donald Trump's policies will tank the entire economy, the former president confirmed his plans to let Musk be a part of the destruction, claiming that “nobody is going to feel it.”",
    "url": "https://newrepublic.com/post/187712/elon-musk-trump-tank-economy"
  },
  {
    "text": "Elon Musk asks voters to brace for economic ‘hardship,’ deep spending cuts in potential Trump Cabinet role  —  Donald Trump wants the Tesla and SpaceX CEO, who himself has taken in billions from federal contracts, to oversee “efficiency” efforts for the government.",
    "url": "https://www.nbcnews.com/business/economy/economy-if-trump-wins-second-term-could-mean-hardship-for-americans-rcna177807"
  },
  {
    "text": "The Washington Post's non-endorsement led to record-breaking weeks at other news orgs  —  The Philadelphia Inquirer had its best week for new subscriptions ever and The Guardian U.S. broke its single-day fundraising record — twice.  —  You may have heard that an eye-watering 250,000 subscribers … ",
    "url": "https://www.niemanlab.org/2024/10/the-washington-posts-non-endorsement-led-to-record-breaking-weeks-at-other-news-orgs/"
  },
  {
    "text": "The Billionaire Is the Threat, Not the Solution  —  I learned how to read by reading Baltimore Orioles game recaps in the sports section of the Washington Post.  I remember sitting on our couch as my dad pointed to words like “Cal Ripken” and “Mike Mussina” and “baseball” and “Orioles,” … ",
    "url": "https://www.404media.co/the-billionaire-is-the-threat-not-the-solution/"
  },
  {
    "text": "America's youngest voters become major election liars … - “There's a new privacy emerging here, where it's far more convenient to either lie or not talk about it,” said John Gerzema, CEO of The Harris Poll, which is not affiliated with Vice President Harris' campaign.",
    "url": "https://www.axios.com/2024/10/30/election-gen-z-voting-lies"
  },
  {
    "text": "Close friend of Clarence Thomas is helping Trump's transition team write policy for DOJ  —  Mark Paoletta, a well-connected conservative lawyer and close friend of Justice Clarence Thomas, is helping Donald Trump's transition team craft the policy playbook for the Justice Department if Trump returns to power … ",
    "url": "https://www.politico.com/live-updates/2024/10/30/2024-elections-live-coverage-updates-analysis/making-trumps-doj-00186401"
  },
  {
    "text": "Jeff Bezos Should Donate the Washington Post to a Charity  —  His conflicts of interests are insurmountable.  He can take a heroic path to strengthen journalism.  —  With one ill-timed decision, Jeff Bezos undermined eleven years of positive behavior as a newspaper owner.",
    "url": "https://www.cjr.org/opinion/waldman-bezos-washington-post-donation-charity-goodwill-endorsements-harris-spiked.php"
  },
  {
    "text": "Elon Musk ordered to attend $1 million voter lottery suit hearing in Philadelphia court … Elon Musk must attend an emergency court hearing in Philadelphia on Thursday morning to address a bid by the city's top prosecutor to stop the Tesla CEO and his political action committee from continuing … ",
    "url": "https://www.cnbc.com/2024/10/30/elon-musk-ordered-to-attend-1-million-voter-lottery-suit-hearing-in-philadelphia.html"
  },
  {
    "text": "Brigadier General Buzz Aldrin Endorses Donald J. Trump for President of the United States  —  Brigadier General Buzz Aldrin endorses Donald J. Trump for President of the United States.  General Aldrin, Lunar Module Pilot on Apollo 11 and Gemini 12 pilot, provides the following statement:",
    "url": "https://www.prnewswire.com/news-releases/brigadier-general-buzz-aldrin-endorses-donald-j-trump-for-president-of-the-united-states-302291636.html"
  },
  {
    "text": "Kim K's Son Deletes YouTube Channel After Anti-Harris Posts  —  The channel mysteriously disappeared Wednesday, leaving many to believe Kardashian saw the posts and shut it down.  —  Dewan's Fiancé Denies Laughing at Kravitz and Tatum's Split  —  ‘GET A LIFE’",
    "url": "https://www.thedailybeast.com/kim-kardashians-son-deletes-youtube-channel-after-anti-kamala-harris-posts/"
  },
  {
    "text": "Chinese student to face criminal charges for voting in Michigan.  Ballot will apparently count  —  A University of Michigan student who is from China and not a U.S. citizen allegedly voted Sunday in Ann Arbor and is being charged with two crimes, six days before a pivotal presidential election.",
    "url": "https://www.detroitnews.com/story/news/politics/elections/2024/10/30/chinese-university-of-michigan-college-student-voted-presidential-election-michigan-china-benson/75936701007/"
  },
  {
    "text": "Speak Out Now Republicans, Or You'll Regret It  —  I HAVE A QUESTION FOR FORMER Trump administration officials, Republican electeds (and former electeds), business leaders, and conservative writers and pundits who recognize Donald Trump for the threat he is.",
    "url": "https://www.thebulwark.com/p/speak-out-now-republicans-or-youll"
  },
  {
    "text": "Beauty queen claims Donald Trump groped her after luring her back to suite at New York's Plaza Hotel  — Beatrice Keul, 53, was invited to US by Trump after Miss Switzerland pageant  —  He was grabbing and touching my body everywhere'  —  Donald Trump ‘jumped’ on a blonde 6' 1' pageant queen … ",
    "url": "https://www.dailymail.co.uk/news/article-13983755/beauty-queen-beatrice-keul-donald-trump-groped-plaza-hotel.html"
  },
  {
    "text": "Donald Trump's cognitive decline becoming a troubling concern  —  VIEW MORE OF THE SUN'S OPINION SECTION",
    "url": "https://lasvegassun.com/news/2024/oct/30/trumps-decline-has-been-alarming/"
  },
  {
    "text": "Reggaetón star Nicky Jam rescinds Trump endorsement over offensive Puerto Rico joke  —  WASHINGTON ― Puerto Rican reggaetón star Nicky Jam withdrew his support on Wednesday for Donald Trump in next week's election, the latest fallout after a comedian insulted Puerto Rico as a … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/30/nicky-jam-withdraws-trump-endorsement/75945412007/"
  },
  {
    "text": "Trump campaign distances itself from House speaker's plan for ‘massive reform’ to the ACA  —  Mike Johnson said the GOP plans to “take a blowtorch to the regulatory state.”  —  Speaker of the House Mike Johnson, R-La., speaks to supporters of former President and Republican presidential … ",
    "url": "https://abcnews.go.com/Politics/trump-campaign-distances-house-speakers-plan-massive-reform/story?id=115313086"
  },
  {
    "text": "Judge Mutes Ranting Rudy Giuliani During Bonkers Hearing  —  Last week, Rudy Giuliani was ordered to hand over basically everything he owns — including his Upper East Side apartment, his 1980 Mercedes, and even his television — in order to pay $148 million in damages for defaming Georgia election workers Ruby Freeman and Shaye Moss.",
    "url": "https://nymag.com/intelligencer/article/judge-mutes-ranting-rudy-giuliani-lawsuit.html"
  },
  {
    "text": "Bernie Moreno Is Using Audio Jammers to Block People From Recording His Events  —  The Republican Senate candidate often invites crowds to tape his remarks.  But he's recently deployed technology that distorts recordings.  —  “I have two rules,” Bernie Moreno, Ohio's Republican candidate for US Senate … ",
    "url": "https://www.motherjones.com/politics/2024/10/bernie-moreno-is-using-audio-jammers-to-block-people-from-recording-his-events-ohio-senate/"
  },
  {
    "text": "These look like Harris ads.  Trump backers bought them.  —  The Washington Post's essential guide to tech policy news  —  Happy Wednesday!  Apple Intelligence is going just great.  Send news tips to: will.oremus@washpost.com.  —  They look like Harris ads.  Trump backers bought them.",
    "url": "https://www.washingtonpost.com/politics/2024/10/30/progress-2028-ads-facebook-harris-musk/"
  },
  {
    "text": "That “Little Secret” Between Trump and Johnson?  Here's What It Could Mean.  —  The “secret” almost certainly involves a plan to install Trump in the White House if he loses the election—but this plan could be even worse than you think.  —  Pocket  —  During the Nazi-throwback rally … ",
    "url": "https://www.thenation.com/article/politics/little-secret-trump-johnson-election/"
  },
  {
    "text": "George W. Bush is running out of time  —  He should take this chance to get right with history, because history will certainly be hard on him.  —  I'd love to hear from George W. Bush before Election Day.  Alone among the four living ex-presidents, plus his vice president and even his own daughter … ",
    "url": "https://www.washingtonpost.com/opinions/2024/10/30/george-w-bush-trump-legacy/"
  }
]