[
  {
    "text": "Trump and His Picks Threaten More Lawsuits Over Critical Coverage  —  The small flurry of threatened defamation suits is the latest sign that the incoming Trump administration appears poised to do what it can to crack down on unfavorable media coverage.  —  The legal threats have arrived in various forms.",
    "url": "https://www.nytimes.com/2024/12/15/business/media/trump-defamation-lawsuit-abc-hegseth-cnn.html?unlocked_article_code=1.h04.vIPb.Gw3Kqky129WQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "His Family Voted to Support Trump's Deportation Plan.  That Includes Him.  —  His friends and family members in Rome, Ga., voted to support mass deportation.  Now he's scrambling to stay in the country.  —  Jaime Cachua with his son Julian.  He fears he will be deported.",
    "url": "https://www.nytimes.com/2024/12/15/us/trump-immigrant-deportations-rome-georgia.html?unlocked_article_code=1.hk4.0wkS.eiVnFWvxDD6j"
  },
  {
    "text": "CEOs Want Trump to Change Course on Tariffs.  He Isn't Budging.  —  Companies mount a campaign to soften the president-elect's trade policies, but Trump's team tells consultants he is serious  —  Donald Trump's tariff threats have triggered a behind-the-scenes lobbying campaign to soften or alter the president-elect's plans.",
    "url": "https://www.wsj.com/economy/trade/trump-tariff-plan-business-lobbying-8f02ccea?st=42oDCu&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Romney stands by Trump criticism but says MAGA is now the Republican Party  —  Sen. Mitt Romney, a frequent Donald Trump critic who will soon retire from Congress, stood by his criticism of the president-elect's character but said Trump and his MAGA movement now define the Republican Party.",
    "url": "https://www.cnn.com/2024/12/15/politics/romney-trump-state-of-the-union"
  },
  {
    "text": "Bernie Sanders believes Hunter Biden pardon sets a ‘dangerous’ precedent  —  Sanders discusses Biden's legacy, one way he will work with President-elect Trump  —  Sen. Bernie Sanders, I-Vt., had two thoughts about President Biden pardoning his son Hunter Biden after previously saying he would not … ",
    "url": "https://www.foxnews.com/politics/bernie-sanders-believes-hunter-biden-pardon-sets-dangerous-precedent"
  },
  {
    "text": "Harris debates her future: A run for California governor that would take 2028 off the table  —  Top aides and people close to Kamala Harris have divided over whether she should head home to run for California governor in 2026 — and it all comes down to whether they believe she could win … ",
    "url": "https://www.cnn.com/2024/12/15/politics/kamala-harris-future-2028-california-governor/"
  },
  {
    "text": "Universities warn international students to return before Trump inauguration … They include the University of Southern California, Brown University, University of Pennsylvania, MIT and others.  — USC in an email to students on special visas said they are expected to be in class … ",
    "url": "https://www.axios.com/2024/12/15/trump-inauguration-international-students-warning"
  },
  {
    "text": "“Trump's Stooge” Gets His Reward  —  Former Congressman Devin Nunes, the head of Truth Social, is set to be chairman of The President's Intelligence Advisory Board.  —  Devin Nunes, the ex-California congressman and current head of Trump's struggling social media platform, Truth Social … ",
    "url": "https://www.motherjones.com/politics/2024/12/devin-nunes-trump-intelligence-advisory-board-truth-social-trump-stooge/"
  },
  {
    "text": "Thom Tillis warns pressure campaign to push Cabinet nominees could backfire  —  “If anything they could create a structural problem for future nominees if they overreach,” the GOP senator said.  —  GOP Sen. Thom Tillis warned Sunday that pressure campaigns to push President-elect Donald … ",
    "url": "https://www.politico.com/news/2024/12/15/thom-tillis-cabinet-nominees-confirmation-00194409"
  },
  {
    "text": "Graham Says Hegseth Plans to Release Accuser From Confidential Agreement  —  Senator Lindsey Graham said that Pete Hegseth, President-elect Donald Trump's defense secretary pick, promised to release his accuser from a settlement that his lawyer has said was already breached.",
    "url": "https://www.nytimes.com/2024/12/15/us/pete-hegseth-confidentiality-agreement-lindsey-graham.html"
  },
  {
    "text": "Patrick Soon-Shiong's controversial shakeup at the L.A. Times: ‘Bias meter,’ opinion upheaval and a call for growth  —  Patrick Soon-Shiong had become accustomed to making the news.  —  He was the doctor and medical technology innovator who built a fortune, the striving South African immigrant … ",
    "url": "https://www.latimes.com/california/story/2024-12-15/la-patrick-soon-shiong-interview"
  },
  {
    "text": "Industrial and business groups send Trump a deregulatory wish list  —  More than a hundred industrial trade groups and chambers of commerce are urging President-elect Donald Trump to weaken or eliminate numerous Biden administration regulations on energy, air pollution, recycling … ",
    "url": "https://www.latimes.com/environment/story/2024-12-15/industrial-polluters-send-trump-a-deregulatory-wish-list"
  },
  {
    "text": "McConnell has the chutzpah to complain about Trump's ‘America First’  —  Mitch McConnell bears great responsibility for the return of Trump and his foreign policy.  —  Without minimizing the many factors responsible for reelecting the most unfit presidential candidate in U.S. history … ",
    "url": "https://www.washingtonpost.com/opinions/2024/12/15/mitch-mcconnell-trump-america-first/"
  },
  {
    "text": "RFK Jr. seeks to win over Senate GOP skeptics as he begins HHS meetings  —  Robert F. Kennedy Jr. will be seeking to ease any skepticism over his confirmation this week as he begins meetings with Senate Republicans over his nomination to lead the Department of Health and Human Services (HHS).",
    "url": "https://thehill.com/policy/healthcare/5039835-robert-kennedy-health-department-nomination/"
  },
  {
    "text": "Over 120 House Democrats call on Biden to have Equal Rights Amendment ratified  —  The publication of the ERA would probably spark legal challenges, but Democrats say it is important to press for it before the second Trump administration.  —  More than 120 House Democrats have signed … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/15/equal-rights-amendment-biden/"
  },
  {
    "text": "Is $100K Bond Fair for Woman Accused of Insurer Threats?  Experts Weigh In  —  Briana Boston, the 42-year-old woman accused of threatening Blue Cross Blue Shield after the health insurance company allegedly denied some medical claims by her, is being held on a $100,000 bond, according to local media.",
    "url": "https://www.newsweek.com/briana-boston-100k-bond-blue-cross-blue-shield-alleged-threat-2000612"
  }
]