[
  {
    "text": "Musk promises better communication between Republican lawmakers, DOGE  —  “With all due respect to Mr. Musk, he doesn't have a vote up here,” one lawmaker said.  —  Billionaire Trump adviser Elon Musk stepped up his congressional outreach on Wednesday, taking questions from Republican lawmakers … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/05/musk-congress-anger-doge/"
  },
  {
    "text": "GOP must cut Medicaid or Medicare to achieve budget goals, CBO finds  —  The nonpartisan bookkeeper said there's no other way to cut $1.5 trillion from the budget over the next decade.  —  Just now  —  Republicans in Congress cannot reach their goal of cutting at least $1.5 trillion … ",
    "url": "https://www.washingtonpost.com/business/2025/03/05/gop-budget-medicaid-cuts/"
  },
  {
    "text": "Republicans Warn Musk DOGE Cuts at Risk Without Congress  —  The differences between Elon Musk's fast-acting efforts to reshape the federal government and congressional Republicans' desire for process and professional courtesies played out behind closed doors in the US Capitol … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-05/elon-musk-to-meet-with-congressional-republicans-on-doge-cuts"
  },
  {
    "text": "House Speaker Mike Johnson's chief of staff arrested on DUI charge after Trump speech  —  Hayden Haynes is a longtime top aide to Mike Johnson, both in the speaker's office and his personal office.  —  WASHINGTON — Hayden Haynes, the chief of staff to House Speaker Mike Johnson, R-La. … ",
    "url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-chief-staff-arrested-dui-charge-trump-speech-rcna194986"
  },
  {
    "text": "Pentagon deputy press secretary Kingsley Wilson is a prolific purveyor of antisemitic conspiracy theories  —    Kingsley Wilson, the Pentagon's new deputy press secretary, is facing backlash over a series of recent social media comments in which she has promoted antisemitic conspiracy theories … ",
    "url": "https://jewishinsider.com/2025/03/pentagon-deputy-press-secretary-kingsley-wilson-is-a-prolific-purveyor-of-antisemitic-conspiracy-theories-online/"
  },
  {
    "text": "This Pentagon Press Secretary Has a Long History of Bigoted and Xenophobic Posts  —  “Be unapologetically right-wing.  It will pay off.”  —  On Donald Trump's first day in office, the Department of Defense announced a spate of hires, including 26-year-old Kingsley Wilson, who will serve as the Pentagon's deputy press secretary.",
    "url": "https://www.motherjones.com/politics/2025/03/kingsley-cortes-wilson-defense-department/"
  },
  {
    "text": "Trump Decried Millions Spent ‘Making Mice Transgender.’ It Was Cancer and Asthma Research  —  The president's State of the Union address included a line designed to go viral in the right-wing misinformation machine … The chief executive of the United States told the country … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-transgender-mice-medical-research-1235289439/"
  },
  {
    "text": "Draft of Trump Executive Order Aims to Eliminate Education Department  —  Secretary Linda McMahon would be directed to ‘take all necessary steps to facilitate the closure’  —  President Trump is expected to issue an executive order as soon as Thursday aimed at abolishing the Education Department … ",
    "url": "https://www.wsj.com/politics/policy/draft-of-trump-executive-order-aims-to-eliminate-education-department-5315c3a4?st=i92oTT"
  },
  {
    "text": "Trump Administration Told to Reinstate Nearly 6,000 Agriculture Dept. Workers  —  The fired employees were on probationary status, swept up in the administration's push to rapidly reduce the size of the federal work force in part by targeting those types of workers.",
    "url": "https://www.nytimes.com/2025/03/05/us/politics/agriculture-dept-fired-workers-reinstated.html"
  },
  {
    "text": "Trump pauses Canada, Mexico auto tariffs  —  “We spoke with the big three auto dealers,” White House spokesperson Karoline Leavitt told reporters.  “We are going to give a one-month exemption on any autos coming through [the U.S.-Mexico-Canada Agreement.”  —  President Donald Trump has decided … ",
    "url": "https://www.politico.com/news/2025/03/05/trump-auto-tariffs-pause-canada-mexico-00213949"
  },
  {
    "text": "Jack Daniel's maker says Canada pulling U.S. alcohol off store shelves is ‘worse than a tariff’  —  /business/business/business// businessJack Daniel's maker Brown-Forman Corp.'s CEO Lawson Whiting said on Wednesday Canadian provinces taking American liquor off store shelves was “worse than a tariff” … ",
    "url": "https://www.theglobeandmail.com/business/international-business/article-jack-daniels-maker-says-canada-pulling-us-alcohol-off-store-shelves-is/"
  },
  {
    "text": "Exclusive: U.S. holding secret talks with Hamas … - While the Trump administration consulted with Israel about the possibility of engaging with Hamas, Israel learned about aspects of the talks through other channels, one source said.  — The sources spoke with Axios on the condition … ",
    "url": "https://www.axios.com/2025/03/05/us-hamas-talks-gaza-war-israel"
  },
  {
    "text": "Texas Rep. Al Green unrepentant as he faces censure vote in House for disrupting Trump speech  —  The House is expected to vote on censuring an unrepentant Rep. Al Green, D-Texas, on Thursday for his outburst during President Donald Trump's address to Congress.",
    "url": "https://apnews.com/article/house-censure-green-trump-joint-address-61d82026983c99a269209bbeb32b45a5"
  },
  {
    "text": "Why Trump Thanked John Roberts  —  The conservative justices are frequently accomplices to Trump's assault on democracy.  —  The exchange was so awkward, it should have been followed by the Curb Your Enthusiasm theme song.  While President Donald Trump was shaking hands down the aisle … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/03/congressional-address-supreme-court/681926/?gift=Je3D9AQS-C17lUTOnl2W8DvuvqMwTWi-iRV7fuziWg0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump administration plans to cut 80,000 employees from Veterans Affairs, according to internal memo  —  The Department of Veterans Affairs is planning an “aggressive” reorganization that includes cutting 80,000 jobs from the sprawling agency that provides health care for retired military members … ",
    "url": "https://apnews.com/article/veterans-affairs-cuts-doge-musk-trump-f587a6bc3db6a460e9c357592e165712"
  },
  {
    "text": "Most Voters Want Eric Adams to Resign as Approval Rating Hits Record Low  —  More than half of New York City voters surveyed in a Quinnipiac University poll said that Mayor Eric Adams should resign.  —  Just 20 percent of New York City voters approved of Mayor Eric Adams's job performance … ",
    "url": "https://www.nytimes.com/2025/03/05/nyregion/eric-adams-poll-nyc-mayor.html"
  },
  {
    "text": "ActBlue, the Democratic Fund-Raising Powerhouse, Faces Internal Chaos  —  At least seven senior officials have left the group, setting off deep concerns about its future as it confronts scrutiny from congressional Republicans.  —  ActBlue, the online fund-raising organization … ",
    "url": "https://www.nytimes.com/2025/03/05/us/politics/actblue-democrat-fundraising-resignations.html"
  },
  {
    "text": "Trading Volume In This Nasdaq-Listed Firm Soared Before Don Jr. And Eric Trump Were Announced As Board Members—'Suspicious,' Experts Say  —  Trading in Dominari Holdings Inc. soared ahead of the February announcement that Donald Trump Jr. and Eric Trump had taken stakes in the company … ",
    "url": "https://www.forbes.com/sites/zacheverson/2025/03/05/donald-trump-jr-eric-dominari-holdings-stock-nasdaq-trading-volume/"
  },
  {
    "text": "MSNBC host laments Democrats' ‘visuals’ at Trump speech: ‘Not taking back the House in 2026’  —  MSNBC host Symone Sanders-Townsend criticized Democrats who protested at President Donald Trump's joint address to Congress by suggesting their antics Tuesday night were not helping their reelection efforts in 2026.",
    "url": "https://www.washingtonexaminer.com/news/house/3338879/msnbc-host-laments-democrats-visuals-trump-speech/"
  },
  {
    "text": "Here's a Map of the For-Sale Government Properties the GSA Pulled From Its Website  —  The General Services Administration plans to sell hundreds of government buildings, including FBI headquarters.  Use our interactive tools to see where they are—and the congressional districts they're in.",
    "url": "https://www.wired.com/story/map-for-sale-government-properties-gsa/"
  },
  {
    "text": "Elon Musk suggests the U.S. should privatize the Postal Service and Amtrak  —  During a remote appearance at a technology conference in San Francisco, Musk told attendees the U.S. should privatize “as much as possible.”  —  Trump adviser and tech mogul Elon Musk suggested Wednesday … ",
    "url": "https://www.nbcnews.com/politics/doge/elon-musk-suggests-us-privatize-postal-service-amtrak-rcna194960"
  },
  {
    "text": "Canada goose fights off bald eagle in rare, symbolism-laden battle on ice  —  Photographer captures 20-minute clash between birds emblematic of Canada and US amid high trade tensions  —  For the second time in weeks, a Canadian icon has emerged as the unlikely victor in an existential battle on the ice.",
    "url": "https://www.theguardian.com/environment/2025/mar/05/canada-goose-bald-eagle-political-symbolism"
  },
  {
    "text": "‘Hamilton’ Cancels Kennedy Center Run Over Trump's Takeover  —  “We're not going to be a part of it while it is the Trump Kennedy Center,” said its creator, Lin-Manuel Miranda.  —  “Hamilton,” the musical theater juggernaut about the birth of American democracy, is canceling plans … ",
    "url": "https://www.nytimes.com/2025/03/05/theater/hamilton-kennedy-center-trump-miranda.html"
  }
]