[
  {
    "text": "Trump insults prosecutor at Jersey Shore rally filled with vulgar jabs  —  The presumptive Republican nominee spoke at a large rally where there were plenty of personal attacks and vulgar expressions from Trump and his supporters.  —  WILDWOOD, N.J. — Donald Trump on Saturday insulted … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/11/trump-bragg-trial-insults-rally-vulgar/"
  },
  {
    "text": "Trump, escalating attacks at rally, says Biden is ‘surrounded by fascists’  —  He's still under threat of jailtime if he violates a gag order.  —  After spending the week sitting in silence as a parade of witnesses — from porn star Stormy Daniels to a former White House aide … ",
    "url": "https://www.politico.com/news/2024/05/11/trump-rally-new-jersey-trial-fascists-00157482"
  },
  {
    "text": "Trump blasts Biden as ‘total moron’ before crowd of 100K at NJ rally: ‘Whole world is laughing at him’  —  WILDWOOD, NJ — Donald Trump recited all his greatest hits at a massive Saturday evening rally in Wildwood, NJ — but managed to avoid violating his court-imposed gag order by focusing … ",
    "url": "https://nypost.com/2024/05/11/us-news/trump-blasts-biden-as-total-moron-before-crowd-of-100k-at-nj-rally/"
  },
  {
    "text": "Trump supporters flock to massive New Jersey campaign rally to hear former president speak amid ongoing trials  —  The late-afternoon rally is expected to draw more than 40,000 supporters  —  Supporters of Donald Trump came out in droves Saturday to hear the former president speak … ",
    "url": "https://www.foxnews.com/politics/trump-supporters-flock-massive-new-jersey-campaign-rally-hear-former-president-speak-amid-ongoing-trials"
  },
  {
    "text": "Amid Scrutiny, Paul Manafort Leaves Republican Convention Role  —  Eight years after helping Donald J. Trump get elected — and four years after being released from prison — the longtime political operative was back as a volunteer to advise the G.O.P. convention.",
    "url": "https://www.nytimes.com/2024/05/11/us/politics/trump-manafort-republican-convention.html"
  },
  {
    "text": "Manafort will no longer take on Republican convention role  —  Manafort had offered to work free on the Republican convention, meeting with officials in recent weeks about his role.  —  Paul Manafort, the longtime political power broker who served as the 2016 chairman for Donald Trump's presidential campaign … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/11/paul-manafort-rnc-convention-trump/"
  },
  {
    "text": "Trump appointee blasts Fifth Circuit over “landmines” in its recent decisions  —  “Parties should not be allowed to manipulate the court system to order trial judges ‘how’, ‘what’, and ‘when’ to rule,” Judge Mark Pittman wrote.  —  In a case that has already ping-ponged around the federal court system … ",
    "url": "https://www.lawdork.com/p/trump-appointee-pittman-blasts-fifth-circuit"
  },
  {
    "text": "A wargame simulated a 2nd Trump presidency.  It concluded NATO would collapse.  — Trump has threatened to quit NATO.  A wargame examined the possible ramifications.  — The US player abandoned Ukraine and ceased NATO participation, triggering crisis in Europe.",
    "url": "https://www.businessinsider.com/a-wargame-simulated-a-2nd-trump-presidency-it-found-nato-would-collapse-2024-5"
  },
  {
    "text": "Trump May Owe $100 Million From Double-Dip Tax Breaks, Audit Shows … The I.R.S. believes that former President Donald J. Trump violated a law meant to prevent double-dipping on tax-reducing losses.Jamie Kelter Davis for The New York Times  —  Former President Donald J. Trump used … ",
    "url": "https://www.nytimes.com/2024/05/11/us/trump-taxes-audit-chicago.html"
  },
  {
    "text": "Biden taps Obama, George Clooney, Julia Roberts and the Clintons for mega fundraisers  —  One high-profile event will feature a contest with Clooney and Roberts on social media platforms to engage grassroots donors, according to details first shared with NBC News.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-taps-obama-george-clooney-julia-roberts-clintons-mega-fundraiser-rcna151183"
  },
  {
    "text": "He's Running for Senate With an Immigrant's Origin Story.  Here's the Rest.  —  Bernie Moreno, the Republican challenging Senator Sherrod Brown in Ohio, tells a riches-to-rags-to-riches tale.  But the reality isn't so tidy.  —  He is running for the Senate as an immigrant who made good … ",
    "url": "https://www.nytimes.com/2024/05/12/us/politics/bernie-moreno-ohio.html"
  },
  {
    "text": "New lawsuit accuses Trump campaign of illegally attempting to hide payments to women  —  Donald Trump's election campaign has been hit with a sex discrimination lawsuit involving fresh accusations that his lawyers violated federal law by attempting to hide settlement payments to women accusers.",
    "url": "https://www.rawstory.com/aj-delgado/"
  },
  {
    "text": "Georgia GOP vice chair booted for illegally voting 9 times as a convicted felon  —  Brian K. Pritchard is no longer the vice chairman of the Georgia Republican Party after a large majority of his fellow Republicans voted to remove him from his position this week.",
    "url": "https://www.rawstory.com/georgia-gop-vice-chair-booted-for-illegally-voting-9-times-as-a-convicted-felon-2668234016/"
  },
  {
    "text": "Pelosi rebuked to her face during Oxford debate after condemning Americans clouded by ‘guns, gays, God’  —  Pelosi suggested Americans refuse to listen to Democrats about certain issues due to their beliefs about ‘guns, gays, [and] God’  —  Former House Speaker Nancy Pelosi, D-Calif. … ",
    "url": "https://www.foxnews.com/politics/pelosi-rebuked-oxford-debate-condemning-americans-clouded-guns-gays-god"
  },
  {
    "text": "Switzerland's Nemo wins 68th Eurovision Song Contest after event roiled by protests over war in Gaza  —  Swiss singer Nemo won the 68th Eurovision Song Contest early Sunday with “The Code,” an operatic pop-rap ode to the singer's journey toward embracing a nongender identity.",
    "url": "https://apnews.com/article/eurovision-song-contest-final-israel-protests-09e31963ed7db607ea137c9333eabf87"
  },
  {
    "text": "Donald Trump says Nikki Haley not under consideration for vice president  —  Former President Donald Trump is dismissing a report that he is considering his GOP primary opponent Nikki Haley as a running mate.  —  Trump wrote on his social Media platform Truth Social Saturday that … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/11/donald-trump-nikki-haley-vice-presidet/73654328007/"
  }
]