[
  {
    "text": "Many Voters Say Kamala Harris's Race Is Not an Important Issue  —  Even as Trump plays up racial divisions, many Americans said they would rather not dwell on race or identity.  “We can all see that you're Black.”  —  “Obviously, we have eyes.”  —  That was the somewhat jaded response … ",
    "url": "https://www.nytimes.com/2024/08/03/us/kamala-harris-race-trump.html"
  },
  {
    "text": "With Vance's elevation, Pennsylvania voters reexamine Trump's views on women  —  “Now that you've got Kamala in there, you've got a whole different ballgame,” one independent Pennsylvania voter said.  —  BUCKS COUNTY, Pa. — More than a week after Kamala Harris's debut as the likely Democratic … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/03/with-vances-elevation-pennsylvania-voters-reexamine-trumps-views-women/"
  },
  {
    "text": "Trump team gambles on new ground game capitalizing on loosened rules  —  The campaign is joining forces with outside groups such as Turning Point Action after regulators cleared the way for more coordination.  But it comes with the risk of untested outfits duplicating efforts or working at cross purposes.",
    "url": "https://www.washingtonpost.com/politics/2024/08/03/trump-allies-ground-game/"
  },
  {
    "text": "Defense Secretary Revokes Plea Deal for Accused Sept. 11 Plotters  —  Defense Secretary Lloyd J. Austin III assumed direct oversight of the case and effectively put the death penalty back on the table.  —  Defense Secretary Lloyd J. Austin III on Friday relieved the overseer of the war court … ",
    "url": "https://www.nytimes.com/2024/08/02/us/politics/911-plotters-plea-deal.html?unlocked_article_code=1.AE4.HKWp.ZcD3F2UPP4xi&smid=url-share"
  },
  {
    "text": "Defense Secretary overrides plea agreement for accused 9/11 mastermind and two other defendants  —  WASHINGTON (AP) — Defense Secretary Lloyd Austin on Friday overrode a plea agreement reached earlier this week for the accused mastermind of the Sept. 11, 2001, attacks and two other defendants, reinstating them as death penalty cases.",
    "url": "https://apnews.com/article/guantanamo-sept-11-defendants-austin-defense-bf450589039b761c028492a348da4ea5"
  },
  {
    "text": "Jimmy Carter's next goal is voting for Kamala Harris for president  —  The former president is ‘more alert and interested in politics’ in recent days, his family says  —  As former President Jimmy Carter nears his 100th birthday, his milestone celebration isn't on his mind.  —  Defeating Donald Trump is.",
    "url": "https://www.ajc.com/politics/jimmy-carters-next-goal-is-voting-for-kamala-harris/UKCLDIUSSJC6JM4NP7HGOEDCNY/"
  },
  {
    "text": "Mussolini, Trump and What Assassination Attempts Really Do  —  A scholar of Mussolini and authoritarianism explains how failed attacks can be used to consolidate power.  —  On April 7, 1926, Fascist leader Benito Mussolini gave a speech to a conference of surgeons, and then began walking with his aides through the streets of Rome.",
    "url": "https://www.politico.com/news/magazine/2024/08/03/assassination-attempts-mussolini-trump-00171825"
  },
  {
    "text": "Trump says he's agreed to Fox News offer to debate Kamala Harris on Sept. 4  —  Donald Trump announced late Friday night that he has accepted an offer from Fox News to debate Kamala Harris in September.  —  The former president said in a Truth Social post that the debate would be held … ",
    "url": "https://nypost.com/2024/08/03/us-news/donald-trump-says-he-agreed-to-debate-kamala-harris-on-fox-news-in-september/"
  },
  {
    "text": "Why Kamala Harris Has A Chance To Make History As A Policymaker  —  Signs point to child care, paid leave and home care as priorities she takes seriously — and personally.  —  LOADING  —  One of the Biden administration's biggest legislative setbacks came when Democratic leaders had to give up on their “caregiving” agenda.",
    "url": "https://www.huffpost.com/entry/kamala-harris-paid-leave-child-care_n_66ad4d56e4b0bc1c990d6bcb"
  },
  {
    "text": "Trump and Harris go all-in to make Pennsylvania the new Florida … - The Trump and Harris 2024 presidential campaigns are set to spend more than double on advertising in Pennsylvania than in any of the other six swing states, according to an Axios analysis of AdImpact data.",
    "url": "https://www.axios.com/2024/08/03/trump-harris-pennsylvania-ad-spending-president"
  },
  {
    "text": "‘Firestorm’: Philly Mayor May Have Just Accidentally Leaked Kamala Harris' VP Pick  —  Philadelphia's Mayor Cherelle Parker may have just leaked Kamala Harris' Vice Presidential pick as Pennsylvania Governor Josh Shapiro with a mistimed Friday tweet, according to Philly Mag's Ernest Owens.",
    "url": "https://dailycaller.com/2024/08/02/firestorm-philly-mayor-cherelle-parker-accidentally-leaked-kamala-harris-vp-pick-josh-shapiro-2024-election/"
  },
  {
    "text": "Kamala Harris raised $310 million in July, dwarfing Trump haul for month … The presidential campaign of Vice President Kamala Harris said Friday that its political operation raised $310 million in July, dwarfing the tally raised for the Republican nominee Donald Trump in the same month.",
    "url": "https://www.cnbc.com/2024/08/02/harris-campaign-fundraise-trump-election.html"
  },
  {
    "text": "Job growth totals 114,000 in July, much less than expected, as unemployment rate rises to 4.3% … WATCH NOW  —  Job growth in the U.S. slowed much more than expected during July and the unemployment rate ticked higher, fueling fears of a broader economic slowdown, the Labor Department reported Friday.",
    "url": "https://www.cnbc.com/2024/08/02/job-growth-totals-114000-in-july-much-less-than-expected-as-unemployment-rate-rises-to-4point3percent.html"
  },
  {
    "text": "Plouffe among corps of new advisers to Harris campaign  —  The Barack Obama veteran had been the subject of internal rumors for weeks.  —  Kamala Harris' presidential campaign is bringing on a new echelon of senior advisers, most prominently David Plouffe, the former top political adviser to Barack Obama.",
    "url": "https://www.politico.com/news/2024/08/02/plouffe-joins-harris-campaign-as-senior-adviser-00172478"
  },
  {
    "text": "How Biden feels about some of Harris' top running mate candidates  —  President Joe Biden acknowledged to reporters Friday morning that he and Vice President Kamala Harris have spoken about her upcoming decision on a vice presidential running mate.  —  But he wouldn't say much else … ",
    "url": "https://www.cnn.com/2024/08/02/politics/joe-biden-kamala-harris-running-mate-candidates/"
  },
  {
    "text": "Josh Shapiro once wrote that peace ‘will never come’ to the Middle East.  He says his views have changed over 30 years.  —  Pennsylvania Gov. Josh Shapiro wrote in his college newspaper in 1993 that peace “will never come” to the Middle East and expressed skepticism about the viability … ",
    "url": "https://www.inquirer.com/politics/election/josh-shapiro-israel-gaza-peace-column-vice-president-20240802.html"
  },
  {
    "text": "Giuliani's bankruptcy formally dismissed, freeing Georgia election workers to seek $148M  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters",
    "url": "https://thehill.com/regulation/court-battles/4808529-rudy-giuliani-georgia-election-workers-bankruptcy-dismissed/"
  }
]