[
  {
    "text": "Auchincloss: Senate must reject ‘dangerous’ RFK Jr. as HHS head  —  Rep. Jake Auchincloss (D-Mass.) urged the Senate to reject Robert F. Kennedy Jr. as the Secretary of Health and Human Services in a Friday op-ed for the Boston Globe.  —  “Now Donald Trump is setting Kennedy up to “go wild” as secretary of health and human services.",
    "url": "https://thehill.com/homenews/campaign/5006585-auchincloss-senate-must-reject-dangerous-rfk-jr-as-hhs-head/"
  },
  {
    "text": "This Professor Has Taken on Robert F. Kennedy Jr. for Opposing Vaccines  —  A Q&A with Dr. Peter Hotez, who has clashed with the new health and human services secretary nominee.  Hotez himself helped develop low-cost vaccinations. … Dr. Peter Hotez knows vaccines.",
    "url": "https://www.insidehighered.com/news/government/science-research-policy/2024/11/22/professor-has-taken-rfk-jr-opposing-vaccines"
  },
  {
    "text": "I Watched Orbán Destroy Hungary's Democracy.  Here's My Advice for the Trump Era.  —  To dismantle the machinery of autocracy, you first need to understand how it works.  —  Many believed that after his first term as president, Donald Trump would end up in the dustbin of history.",
    "url": "https://www.politico.com/news/magazine/2024/11/23/trump-autocrat-elections-00191281"
  },
  {
    "text": "Trump taps loyalist Rollins for USDA chief in surprise pick  —  President-elect Donald Trump has picked Brooke Rollins as his Agriculture secretary, after weeks of intense internal fighting over the role, according to two people familiar with the transition conversations.",
    "url": "https://www.politico.com/news/2024/11/23/trump-loyalist-brooke-rollins-usda-secretary-surprise-nomination-00191391"
  },
  {
    "text": "Trump Picks Fox News Medical Contributor To Be Surgeon General  —  Dr. Janette Nesheiwat, once a Fox News talking head, could become the nation's top doctor.  —  LOADING  —  President-elect Donald Trump has picked Dr. Janette Nesheiwat, a Fox News medical contributor, to serve as the U.S.′ next surgeon general.",
    "url": "https://www.huffpost.com/entry/trump-picks-fox-news-medical-contributor-to-be-surgeon-general_n_67423949e4b06528a19757a8"
  },
  {
    "text": "John Bolton Slams Trump Cabinet Pick Seb Gorka as a ‘Con Man’  —  NO CONFIDENCE  —  The former national security adviser called for a “full field FBI background investigation” into Gorka's academic credentials.  —  Never one to mince words, President-elect Donald Trump's former national … ",
    "url": "https://www.thedailybeast.com/john-bolton-slams-trumps-choice-of-con-man-seb-gorka-as-counterterrorism-director/"
  },
  {
    "text": "Pete Hegseth's Army unit in Iraq was rocked by a war-crimes case  —  Donald Trump's pick for defense secretary was not involved in the murder of detainees, but the formative experience, which happened after he left the unit, appears to have influenced his advocacy for troops accused of war crimes.",
    "url": "https://www.washingtonpost.com/national-security/2024/11/23/pete-hegseth-army-iraq-war-crimes/"
  },
  {
    "text": "Trump's Republican Party is increasingly winning union voters.  It's a shift seen in his labor pick  —  Working-class voters helped Republicans make steady election gains this year and expanded a coalition that increasingly includes rank-and-file union members, a political shift spotlighting … ",
    "url": "https://apnews.com/article/trump-chavezderemer-labor-secretary-unions-republicans-1bff41e4caef610dbf38ead24d292e67"
  },
  {
    "text": "The Philippine vice president publicly threatens to have the president assassinated  —  Philippine Vice President Sara Duterte said Saturday she has contracted an assassin to kill the president, his wife and the House of Representatives speaker if she herself is killed, in a brazen public threat that she warned was not a joke.",
    "url": "https://apnews.com/article/philippines-president-marcos-duterte-assassination-0946ce72c2475b58a2daf54efa32fe45"
  },
  {
    "text": "Behind the Curtain: Trump's liberal cabinet … - As Axios' Zachary Basu told you, Trump's Cabinet increasingly resembles a European-style coalition government, staffed with a dizzying array of ideological rivals united — for now — by a grand MAGA vision.",
    "url": "https://www.axios.com/2024/11/23/trump-liberal-cabinet-rfk-tulsi-gabbard-bessent"
  },
  {
    "text": "Fred R. Harris, Oklahoma senator on Kerner Commission, dies at 94  —  A liberal populist, he was once considered a rising star in the Democratic Party.  He twice ran for president and chaired the Democratic National Committee.  —  Former senator Fred R. Harris, a liberal prairie populist … ",
    "url": "https://www.washingtonpost.com/obituaries/2024/11/23/fred-harris-senator-oklahoma-kerner-dead/"
  },
  {
    "text": "Taiwan's former president says Ukraine needs US weapons more urgently than Taipei  —  Tsai Ing-wen's comments come after a top U.S. military leader said supplying U.S. weapons to Kyiv was cutting into stockpiles that could be used in a war in Asia.  —  HALIFAX, Canada … ",
    "url": "https://www.politico.com/news/2024/11/23/taiwans-former-president-says-ukraine-needs-u-s-weapons-more-urgently-than-taipei-00191400"
  },
  {
    "text": "Washington Post editorial warns of potential Ukraine abandonment under Trump  —  The Washington Post's editorial board released an op-ed on Saturday detailing the potential threats to Ukraine and the U.S. if President-elect Trump moves to strike a deal with his Russian counterparts.",
    "url": "https://thehill.com/policy/international/5006517-washington-post-editorial-warns-of-potential-ukraine-abandonment-under-trump/"
  },
  {
    "text": "Trump's deportation vow alarms Texas construction industry  —  Clear signals President-elect Donald Trump plans to make good on his campaign pledge to deport millions of undocumented immigrants in his second term has sparked concerns among some in Texas' business and economic sectors … ",
    "url": "https://www.npr.org/2024/11/23/g-s1-35465/trump-deportation-migrants-immigrants-texas-construction-industry-border-security"
  }
]