[
  {
    "text": "House Republicans hit the brakes on town halls after blowback over Trump's cuts  —  A number of Republican lawmakers faced significant pushback in their home districts over Trump and Elon Musk's slashing of the federal government.  —  WASHINGTON — House Republicans are becoming weary … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-town-halls-blowback-trump-cuts-rcna193766"
  },
  {
    "text": "Trump and Musk's slash-and-burn tactics are a sticking point in talks to prevent a shutdown  —  Sen. Patty Murray, the top Democratic appropriator, urged Republicans to help stop Trump from usurping Congress' spending powers and not to “follow Elon towards a shutdown.”",
    "url": "https://www.nbcnews.com/politics/congress/trump-musk-tactics-sticking-point-government-shutdown-rcna193639"
  },
  {
    "text": "71 percent of Trump voters oppose Medicaid cuts: Poll  —  Most President Trump voters say they oppose any cuts to Medicaid as Republican lawmakers wrestle with how to reach up to $2 trillion in budget cuts through their reconciliation bill, a poll released Monday found.",
    "url": "https://thehill.com/policy/healthcare/5163193-trump-voters-oppose-medicaid-cuts-poll/"
  },
  {
    "text": "House GOP, after pulling budget resolution, brings it back for a vote  —  House GOP leaders brought their budget resolution to the floor for the vote, just minutes after pulling it at the last minute Tuesday evening as they struggled to win over a handful of conservative fiscal hawks … ",
    "url": "https://thehill.com/homenews/house/5164168-house-gop-leaders-pull-budget-resolution/"
  },
  {
    "text": "Trump targets Washington law firm that aided Jack Smith  —  The president suspended security clearances of lawyers at Covington & Burling over their pro bono work for special counsel Jack Smith.  —  President Donald Trump retaliated Tuesday against a Washington law firm that provided free legal services … ",
    "url": "https://www.politico.com/news/2025/02/25/donald-trump-jack-smith-covington-lawyers-022770"
  },
  {
    "text": "Trump Takes Aim at Law Firm Aiding Jack Smith  —  The move, signed by President Trump on Thursday, is a major escalation of his promise to pursue perceived foes.  —  President Trump plans to punish a prominent Washington law firm that has aided the former special counsel Jack Smith … ",
    "url": "https://www.nytimes.com/2025/02/25/us/trump-jack-smith-law-firm-security.html?unlocked_article_code=1.zk4.ZC2a.V7FT4i33g4-2"
  },
  {
    "text": "Trump to Offer ‘Gold Card’ Visas for $5 Million to the Rich  — Initiative would replace the existing EB-5 visa program  — Trump, Lutnick tout move as draw for wealthy investors  —  President Donald Trump said he is starting a program to offer residency and a path to citizenship … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-25/trump-to-launch-gold-card-visa-program-for-wealthy-investors"
  },
  {
    "text": "Trump says he will offer ‘gold cards’ for $5 million path to citizenship, replacing investor visas  —  President Donald Trump said Tuesday that he plans to offer a “gold card” visa with a path to citizenship for $5 million, replacing a 35-year-old visa for investors.",
    "url": "https://apnews.com/article/investor-visas-trump-immigration-eb5-gold-cards-cdb943dd1633bc234bb715fa20914e05"
  },
  {
    "text": "Who is Amy Gleason, the person named DOGE's acting administrator by the White House?  —  The acting administrator of the Department of Government Efficiency is a low-profile executive who has expertise in health care technology and worked in the first Trump administration.",
    "url": "https://apnews.com/article/doge-acting-administrator-amy-gleason-65af638e646fdd5dd6d5fcc5cc04a2e7"
  },
  {
    "text": "Behind the Curtain: Trump's media-control strategy … - Lawsuits. … - Blacklists. … - Stacking the deck. … - Shielding Cabinet officials.",
    "url": "https://www.axios.com/2025/02/26/behind-the-curtain-trumps-media-control-strategy"
  },
  {
    "text": "Elon Musk's business empire is built on $38 billion in government funding  —  Government infusions at key moments helped Tesla and SpaceX flourish, boosting Musk's wealth  —  Elon Musk and his cost-cutting U.S. DOGE Service team have been on a mission to trim government largesse.",
    "url": "https://www.washingtonpost.com/technology/interactive/2025/elon-musk-business-government-contracts-funding/"
  },
  {
    "text": "White House point man at Homeland Security shared ‘martial law option’ post to keep Trump in office  —  The Trump administration's new point man for dealings with the Department of Homeland Security is a former far-right podcast host and election denier who once shared an article calling for … ",
    "url": "https://www.cnn.com/2025/02/26/politics/paul-ingrassia-trump-administration-liaison-dhs-kfile/"
  },
  {
    "text": "Tim Walz Will Not Run for Minnesota's Senate Seat  —  The Democrat, who rose from relative obscurity to be chosen as Kamala Harris's running mate last year, says he will instead explore a third term as governor.  —  Gov. Tim Walz of Minnesota, who rose from relative obscurity to become … ",
    "url": "https://www.nytimes.com/2025/02/26/us/politics/tim-walz-minnesota-senate.html"
  },
  {
    "text": "French Resistance Steps in After AP Banned From Trump-Macron Presser  —  MERCI  —  The Paris Press Corps today ensured that an AP reporter could enter and ask a question.",
    "url": "https://www.thedailybeast.com/paris-press-corps-intervene-when-reporter-is-barred-from-trump-macron-press-conference/"
  },
  {
    "text": "Trump Proposes Fines, Prison Time for Migrants Who Don't Join Registry  —  Administration plans to establish registration website as soon as this week  —  WASHINGTON—The Trump administration plans to create a registry for immigrants in the U.S. illegally to submit their personal information … ",
    "url": "https://www.wsj.com/politics/policy/trump-immigration-migrant-registry-jail-time-95c405a7?st=REipHQ"
  },
  {
    "text": "Republican leaders seek ‘united’ GOP funding strategy as shutdown looms  —  Republican leaders from both sides of the Capitol will on Wednesday endeavor to settle on a unified GOP plan for approaching government funding negotiations with Democrats ahead of the March government shutdown deadline.",
    "url": "https://www.politico.com/live-updates/2025/02/25/congress/republican-leaders-seek-united-gop-funding-strategy-as-shutdown-looms-00206154"
  },
  {
    "text": "As Texas measles outbreak grows, parents are choosing to vaccinate kids  —  At least 124 people, mostly babies, children and teens, have been infected.  Eighteen people have been hospitalized.  —  As the measles outbreak in Texas keeps spreading, parents who previously chose not to vaccinate … ",
    "url": "https://www.nbcnews.com/health/health-news/texas-measles-outbreak-grows-parents-vaccinate-rcna193637"
  },
  {
    "text": "Gabbard Says More Than 100 Intelligence Officers Fired for Chat Messages  —  The chats had been set up to discuss sensitive security matters.  But a group of employees used it for discussions that contained sexual themes, intelligence officials said this week.",
    "url": "https://www.nytimes.com/2025/02/25/us/politics/gabbard-nsa-firing-explicit-chat.html?unlocked_article_code=1.z04.YCV3.5UjxWf4-TV4r&smid=url-share"
  },
  {
    "text": "DOGE Quietly Deletes the 5 Biggest Spending Cuts It Celebrated Last Week  —  The cuts, highlighted on an earlier version of the “wall of receipts” posted by Elon Musk's team, contained mistakes that vastly inflated the amount of money saved.  —  Last week, Elon Musk's government cost-slashing initiative … ",
    "url": "https://www.nytimes.com/2025/02/25/upshot/doge-spending-cuts-changed.html?unlocked_article_code=1.zk4.b82f.Kh1AnGbHOfOG&smid=url-share"
  },
  {
    "text": "DOGE to cancel government contracts that help veterans, records show  —  Records show the 875 contracts included support for medical and burial services, cancer programs and efforts to recruit doctors for critical vacancies  —  Veterans Affairs Secretary Douglas A. Collins took to social media … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/25/veterans-affairs-contracts-canceled/"
  },
  {
    "text": "Utah could become the first state to ban fluoride in its drinking water  —  The Republican-controlled statehouse sent the bill to Gov. Spencer Cox's (R) desk last week after it passed both chambers largely along party lines.  —  Utah could become the first state to ban fluoride in its drinking water … ",
    "url": "https://www.washingtonpost.com/nation/2025/02/25/utah-ban-fluoride-water/"
  },
  {
    "text": "Musk's Fraudulent Fraud Squad  —  Fraud, waste, and abuse has become the rallying cry for Elon Musk's dismantling of the federal government.  During a recent Oval Office briefing about DOGE, Trump and Musk used the terms “fraud” and “fraudsters” a dozen times, claiming that their elimination … ",
    "url": "https://donmoynihan.substack.com/p/musks-fraudulent-fraud-squad"
  },
  {
    "text": "Board agrees to pause firings for some feds, potentially upending Trump's widespread terminations  —  Some federal employees fired by the Trump administration while in their probationary periods have at least temporarily won back their jobs, a federal board that hears appeals from civil servants has ruled.",
    "url": "https://www.govexec.com/workforce/2025/02/board-agrees-pause-firings-some-feds-potentially-upending-trumps-widespread-terminations/403283/"
  },
  {
    "text": "EPA tells White House to strike down landmark climate finding  —  Trump officials are weighing whether to repeal the “endangerment finding,” which says that greenhouse gases pose a threat to public health and welfare.  —  Environmental Protection Agency Administrator Lee Zeldin has privately urged … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/02/26/epa-endangerment-finding-trump-climate/"
  },
  {
    "text": "Rachel Maddow staff to be let go as part of MSNBC overhaul  —  News comes as leading network star criticizes management for decision to cancel shows hosted by non-white anchors  —  MSNBC has told the majority of the employees who produce Rachel Maddow and Joy Reid's primetime evening news shows … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/25/msnbc-layoffs-rachel-maddow"
  },
  {
    "text": "“A woman is like a child”: MAGA quickly turns its sights on stripping Republican women of power  —  Conservative women believe complicity will save them.  But an emboldened far-right is gunning for their rights  —  For decades, the anti-abortion movement has aggressively promoted women into visible leadership roles.",
    "url": "https://www.salon.com/2025/02/26/a-woman-is-like-a-child-maga-quickly-turns-its-sights-on-stripping-women-of-power/"
  },
  {
    "text": "Under Trump, America's New Friends: Russia, North Korea and Belarus  —  When it comes to the war in Ukraine, President Trump finds common cause with the world's outlier states and stands against traditional U.S. allies like Britain, France, Germany, Canada, Japan and Italy.",
    "url": "https://www.nytimes.com/2025/02/25/us/politics/trump-diplomacy.html"
  },
  {
    "text": "Gavin Newsom is launching his own podcast — and inviting MAGA favorites  —  Newsom declined to name the half-dozen guests he said have privately agreed to come on with him.  But he gave a big hint: “Look at the lineup at CPAC.”  —  Gavin Newsom will soon host his own podcast … ",
    "url": "https://www.politico.com/news/2025/02/26/gavin-newsom-podcast-maga-00206153"
  },
  {
    "text": "Two Planes, in Washington and Chicago, Abort Landings to Avoid Collisions  —  The near misses on Tuesday came after a string of aviation disasters, including the midair collision between an Army helicopter and a passenger jet last month that killed 67 people.",
    "url": "https://www.nytimes.com/2025/02/25/us/politics/planes-near-miss-crash-washington-chicago.html"
  }
]