[
  {
    "text": "Trump White House reverses course, rescinds freeze on federal grants  —  The budget office came under immense pressure over the impacts on a sudden pause in key government spending  —  The White House budget office on Wednesday rescinded an order freezing federal grants … ",
    "url": "https://www.washingtonpost.com/business/2025/01/29/white-house-budget-office-spending-freeze/"
  },
  {
    "text": "White House rescinds Trump's funding freeze after massive backlash  —  The White House Office of Management and Budget (OMB) rescinded a memo Wednesday that had ordered a “temporary pause” on federal funding and unleashed major confusion across the country.",
    "url": "https://www.axios.com/2025/01/29/federal-funding-freeze-memo-rescinded"
  },
  {
    "text": "Trump administration rescinds order attempting to freeze federal aid spending  —  The move comes just one day after the order was issued and a federal district judge temporarily halted it.  —  President Donald Trump's administration on Wednesday rescinded an order that attempted to freeze … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-administration-rescinds-order-attempting-freeze-federal-aid-spen-rcna189852"
  },
  {
    "text": "New memo, White House response adds to confusion on federal funding freeze  —  The Office of Management and Budget has rescinded its call for a pause on federal assistance, according to the agency's memo shared by Democracy Forward, which led a legal challenge over the effort.",
    "url": "https://www.npr.org/2025/01/29/g-s1-45313/trump-federal-funding-freeze-reversed"
  },
  {
    "text": "White House rescinds memo on federal aid freeze that caused widespread confusion  —  The White House Office of Management and Budget on Wednesday rescinded a memo that froze federal grants and loans and created widespread confusion this week.  —  “OMB Memorandum M-25-13 is rescinded.",
    "url": "https://www.cnn.com/2025/01/29/politics/white-house-rescind-federal-funding-freeze/"
  },
  {
    "text": "White House says Trump funding freeze remains in effect despite rescinding OMB memo … The White House on Wednesday said a “federal funding freeze” remains in “full force and effect” despite it rescinding a controversial memo ordering that freeze on grants and loans to give agencies … ",
    "url": "https://www.cnbc.com/2025/01/29/white-house-rescinds-federal-funds-freeze-memo.html"
  },
  {
    "text": "USDA inspector general escorted out of her office after defying White House  —  Security agents escorted the inspector general of the U.S. Department of Agriculture out of her office on Monday after she refused to comply with her firing by the Trump administration, sources familiar with the matter told Reuters.",
    "url": "https://www.usatoday.com/story/news/politics/2025/01/29/usda-inspector-general-escorted-office-trump-white-house/78024513007/"
  },
  {
    "text": "Throw Biden under the bus  —  Sleepy Joe landed us in this mess with bad, selfish decisions  —  When Joe Biden stepped aside in favor of Kamala Harris, the overwhelming majority of Democrats praised him for the decision and painted an overall flattering portrait of Biden's presidency and his career.",
    "url": "https://www.slowboring.com/p/throw-biden-under-the-bus"
  },
  {
    "text": "Trump's First Big Fiasco Triggers Stephen Miller's Rage—Take Note Dems  —  Admitting failure is anathema to the authoritarian leader, who is perpetually in danger of being diminished by those who are resentful of his glory—which is why White House adviser Stephen Miller is frantically searching … ",
    "url": "https://newrepublic.com/article/190875/trump-stephen-miller-rage-democratss"
  },
  {
    "text": "Senate Democrats rip into RFK Jr.  —  Democrats on the Senate Finance Committee went on offense against Robert F. Kennedy Jr.'s past statements about vaccines, infectious disease and other health-related conspiracy theories.  In a heated exchange, Sen. Michael Bennet (D-Colo.) … ",
    "url": "https://www.politico.com/live-updates/2025/01/29/congress/senate-democrats-rfk-jr-hearing-00201229"
  },
  {
    "text": "Trump signs the Laken Riley Act into law  —  The Laken Riley Act, named for the slain nursing school student who was attacked and killed by a Venezuelan citizen who had entered into the U.S. illegally, is the first legislative win of Trump's second term.  —  President Donald Trump on Wednesday signed … ",
    "url": "https://www.nbcnews.com/politics/white-house/trump-signs-laken-riley-act-law-rcna188917"
  },
  {
    "text": "DOJ moves to drop charges against former GOP lawmaker in case criticized by Trump  —  The step likely ends a legal saga that drove ex-Rep. Jeff Fortenberry from Congress over foreign donations.  —  The Justice Department has moved to drop its criminal prosecution of former Rep. Jeff Fortenberry … ",
    "url": "https://www.politico.com/news/2025/01/29/jeff-fortenberry-dismiss-charges-00201274"
  },
  {
    "text": "DOJ moves to drop prosecution of former Trump co-defendants in classified documents case  —  The request offered no explanation for the Justice Department's decision to abandon the case against the two Trump allies.  —  The Justice Department on Wednesday moved to drop its effort … ",
    "url": "https://www.politico.com/news/2025/01/29/doj-moves-to-drop-prosecution-of-former-trump-classified-document-co-defendants-00201232"
  },
  {
    "text": "DHS Sec. Noem announces end to temporary protected status for Venezuelan migrants  —  Newly confirmed DHS Sec. Kristi Noem joins ‘Fox & Friends’ to discuss her efforts to crackdown on immigration, including the decision to remove the temporary status directive for Venezuelan migrants and the ICE raids in New York City.",
    "url": "https://www.foxnews.com/video/6367942790112"
  },
  {
    "text": "Compelling Mass Civil Servant Resignations Will Create Chaos  —  Elon Musk's role at Twitter represents a Rorschach test for how people think he will fare in restructuring government.  For fans, he was able to cut the majority of the employees, and the site continued to run more or less as before.",
    "url": "https://donmoynihan.substack.com/p/compelling-mass-civil-servant-resignations"
  },
  {
    "text": "White House aide says spending freeze isn't being rescinded despite memo  —  The White House is claiming the Wednesday move by the Office of Management and Budget (OMB) rescinding a controversial order that froze a wide swath of federal financial assistance is not actually an end to curbing government spending.",
    "url": "https://thehill.com/homenews/administration/5113776-white-house-press-secretary-spending-freeze/"
  },
  {
    "text": "Former Sen. Bob Menendez sentenced to 11 years corruption and bribery case  —  Menendez resigned from the Senate after his conviction last year  —  Former U.S. Sen. Bob Menendez was sentenced Wednesday to 11 years in prison for selling his once-considerable clout in Washington for gold bars … ",
    "url": "https://www.nbcnewyork.com/new-jersey/former-new-jersey-senator-bob-menendez-sentence/6126544/"
  },
  {
    "text": "Governor Leaves Indiana's Predominantly Black University Out of Budget  —  Martin University had a short-lived burst of state funding.  But those funds disappeared in Governor Mike Braun's budget proposal, unveiled on the heels of an anti-DEI executive order.  One lawmaker calls it racist.",
    "url": "https://www.insidehighered.com/news/government/state-policy/2025/01/29/no-funds-black-university-indiana-governors-budget"
  },
  {
    "text": "OpenAI Furious DeepSeek Might Have Stolen All the Data OpenAI Stole From Us  —  The narrative that OpenAI, Microsoft, and freshly minted White House “AI czar” David Sacks are now pushing to explain why DeepSeek was able to create a large language model that outpaces OpenAI's while spending orders … ",
    "url": "https://www.404media.co/openai-furious-deepseek-might-have-stolen-all-the-data-openai-stole-from-us/"
  },
  {
    "text": "Trump administration to cancel student visas of pro-Palestinian protesters  —  U.S. President Donald Trump will sign an executive order on Wednesday to combat antisemitism and pledge to deport non-citizen college students and others who took part in pro-Palestinian protests, a White House official said.",
    "url": "https://www.reuters.com/world/us/trump-administration-cancel-student-visas-all-hamas-sympathizers-white-house-2025-01-29/"
  },
  {
    "text": "‘Written by children’: Critics slam New York Times' glowing coverage of Trump official  —  White House Press Secretary Karoline Leavitt received glowing coverage from the New York Times for her press briefing debut despite delivering a performance that other observers have described as an “embarrassment.”",
    "url": "https://www.rawstory.com/karoline-leavitt-2671022553/"
  },
  {
    "text": "“Trump is trying to collapse our economy”: War on “woke” revealed as a war on all Americans  —  Christian nationalists behind the spending shutdown aim to punish everyone, not just imaginary Marxists  —  Initially, the most striking detail in the White House Office of Management and Budget memo … ",
    "url": "https://www.salon.com/2025/01/29/is-trying-to-collapse-our-economy/"
  },
  {
    "text": "Defense secretary revokes Mark Milley's security detail and orders IG review  —  Pete Hegseth told Milley, a critic of Trump, that he had ordered an investigation to determine whether his rank should be re-evaluated.  —  WASHINGTON — Defense Secretary Pete Hegseth has told former Joint Chiefs … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/defense-secretary-revokes-mark-milleys-security-detail-orders-ig-revie-rcna189767"
  },
  {
    "text": "RFK Jr. Completely Fumbles Basic Medicaid Facts at Hearing  —  That is not quite how Medicaid works, Mr. Kennedy.Robert F. Kennedy Jr. said Wednesday “most Americans are not happy” with Medicaid because “the premiums are too high,” suggesting he may be oblivious to the fact that Medicaid overwhelmingly does … ",
    "url": "https://www.thedailybeast.com/rfk-jr-completely-fumbles-basic-medicaid-facts-in-confirmation-hearing/"
  },
  {
    "text": "Fed holds interest rates steady despite Trump's calls for a cut  —  Policymakers left rates unchanged amid signs that the economy is humming along, defying the president's tradition-bucking pressure on the central bank.  —  Federal Reserve officials held interest rates steady after emerging … ",
    "url": "https://www.nbcnews.com/business/economy/federal-reserve-interest-rate-decision-january-2025-what-to-know-rcna189628"
  }
]