[
  {
    "text": "GOP tensions explode after McCarthy bows out of speaker race  —  House Republicans were distraught, furious and concerned for the future of their party after Rep. Kevin McCarthy (R-Calif.) announced he won't run for speaker again after being ousted on Tuesday.",
    "url": "https://www.axios.com/2023/10/04/house-republicans-kevin-mccarthy-removal-speaker"
  },
  {
    "text": "'He's about clicks': Florida Republicans furious at Gaetz  —  They called him divisive and an attention-seeker.  —  MIAMI — Florida's congressional Republicans are done with Matt Gaetz.  —  They left the House chamber last night furious after Gaetz led seven other GOP members … ",
    "url": "https://www.politico.com/news/2023/10/04/florida-republicans-matt-gaetz-furious-00119865"
  },
  {
    "text": "The House GOP Is a Failed State  —  Kevin McCarthy's ouster is dramatic evidence, if redundant, about the state of the modern GOP.  —  At the start, Kevin McCarthy's speakership was effectively an optical illusion.  At the end, it was an exercise in self-abasement.  Francis Chung/POLITICO",
    "url": "https://www.politico.com/news/magazine/2023/10/03/house-gop-failed-state-00119842"
  },
  {
    "text": "Trump is not ruling out being the new House speaker  —  Believe it or not, the House speaker doesn't actually have to be serving in the House.  —  Trump addresses calls for him to be the next House speaker  —  Does Donald Trump want to be speaker of the House?",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-not-ruling-new-house-speaker-rcna118794"
  },
  {
    "text": "Gaetz knocks Speaker pro tem for sending lawmakers home to ‘cry for a week’  —  Rep. Matt Gaetz (R-Fla.) is already taking aim at Speaker pro tempore Patrick McHenry (R-N.C), saying that he should not send lawmakers home for the next week.  —  “I do have to offer some pretty sharp criticism … ",
    "url": "https://thehill.com/homenews/house/4237607-gaetz-knocks-mchenry-for-sending-lawmakers-home/"
  },
  {
    "text": "House bipartisan caucus risks collapse after McCarthy ouster … The Republicans say he was punished for “doing the right thing” after advancing a stopgap funding bill on a bipartisan basis.  — Frustrated members said that Democrats in the group, which is aimed at finding bipartisan solutions … ",
    "url": "https://www.axios.com/2023/10/03/problem-solvers-caucus-mccarthy-removal-speaker"
  },
  {
    "text": "McHenry ordered Pelosi to leave her Capitol hideaway office by Wednesday  —  The former speaker blasted the move as a “sharp departure from tradition.”",
    "url": "https://www.politico.com/live-updates/2023/10/03/congress/mchenry-pelosi-hideaway-office-house-remove-00119803"
  },
  {
    "text": "Nancy Pelosi evicted from her private office in the Capitol by interim House speaker  —  McHenry assumed the temporary speakership after now-former House Speaker Kevin McCarthy was ousted on Tuesday  —  Former House Speaker Nancy Pelosi, D-Calif., was evicted from her private Capitol office by the new speaker pro-tempore.",
    "url": "https://www.foxnews.com/politics/nancy-pelosi-evicted-private-office-capitol-interim-house-speaker"
  },
  {
    "text": "Inside the Menendez Indictment: A Mercedes and a Secretive Fatal Crash  —  A 2018 fatal car crash in Bogota, N.J., drew no media attention and resulted in no charges.  The driver was the soon-to-be wife of Senator Robert Menendez.  —  It was a cold evening in December 2018, and Nadine Arslanian … ",
    "url": "https://www.nytimes.com/2023/10/04/nyregion/nadine-menendez-mercedes-death.html"
  },
  {
    "text": "Bob Menendez's wife hit and killed a man while driving on Bogota's Main Street in 2018  —  Nadine Arslanian Menendez, federally indicted in a bribery scheme with her husband, Sen. Bob Menendez, struck and killed a man while driving her Mercedes-Benz on Main Street in Bogota in December 2018.",
    "url": "https://www.northjersey.com/story/news/new-jersey/2023/10/04/bob-menendez-wife-car-accident-bogota-nj-police-indictment/71051427007/"
  },
  {
    "text": "Nikki Haley vaults to second place in New Hampshire in new GOP primary poll  —  Today's Suffolk University/Boston Globe/USA TODAY poll (yes, that's a mouthful) will be touted by Nikki Haley's campaign.  She's rocketed into second place with the support of 19% of likely New Hampshire Republican Primary voters … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/10/04/suffolk-boston-globe-usa-today-poll/71050447007/"
  },
  {
    "text": "Giuliani's Drinking, Long a Fraught Subject, Has Trump Prosecutors' Attention  —  The former mayor's drinking has become an investigative subplot in Donald Trump's federal case over 2020 election interference.  But long before that, friends had grown deeply concerned.",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/rudy-giuliani-drinking.html"
  },
  {
    "text": "President Biden Announces an Additional $9 Billion in Student Debt Relief for 125,000 Americans  —  President Biden has long believed that college should be a ticket to the middle class, not a burden that weighs on families.  That's why from day one, his Administration has taken unprecedented steps … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/10/04/president-biden-announces-an-additional-9-billion-in-student-debt-relief-for-125000-americans/"
  },
  {
    "text": "Exclusive: US will transfer weapons seized from Iran to Ukraine  —  The US will transfer thousands of seized Iranian weapons and rounds of ammunition to Ukraine, in a move that could help to alleviate some of the critical shortages facing the Ukrainian military as it awaits more money … ",
    "url": "https://www.cnn.com/2023/10/04/politics/us-iran-seized-weapons-ukraine/"
  },
  {
    "text": "Jordan becomes first to announce run for speaker  —  His candidacy will likely run right into Majority Leader Steve Scalise (R-La.), who is also considering a speakership bid and has worked to court conservatives.",
    "url": "https://www.politico.com/live-updates/2023/10/04/congress/jordain-officially-in-00119892"
  },
  {
    "text": "Giuliani sues Biden for defamation over ‘Russian pawn’ remark  —  Rudy Giuliani sued President Biden for defamation Wednesday over his comments calling the former New York City mayor a “Russian pawn” during a 2020 presidential debate.  —  The 16-page lawsuit, filed in New Hampshire state court … ",
    "url": "https://thehill.com/regulation/court-battles/4238493-giuliani-sues-biden-for-defamation-over-russian-pawn-remark/"
  },
  {
    "text": "Support for Third U.S. Political Party Up to 63%  —  WASHINGTON, D.C. — Sixty-three percent of U.S. adults currently agree with the statement that the Republican and Democratic parties do “such a poor job” of representing the American people that “a third major party is needed.”",
    "url": "https://news.gallup.com/poll/512135/support-third-political-party.aspx"
  }
]