[
  {
    "text": "Suspect charged with killing UnitedHealthcare's CEO as an act of terrorism  —  The man accused of killing UnitedHealthcare's CEO has been charged with murder as an act of terrorism, prosecutors said Tuesday as they worked to bring him to a New York court from a Pennsylvania jail.",
    "url": "https://apnews.com/article/unitedhealthcare-ceo-killing-luigi-mangione-fccc9e875e976b9901a122bc15669425"
  },
  {
    "text": "A Big Pile of Money and Lawyering to Defend Trump's Legal Targets?  —  In the wake of Donald Trump's election victory and promised revenge tour, a number of individuals have proposed the creation of an organization or fund which would take on the job of defending the various lawsuits … ",
    "url": "https://talkingpointsmemo.com/edblog/a-big-pile-of-money-and-lawyering-to-defend-trumps-legal-targets/sharetoken/06d4d1f4-cea2-4b8f-9256-0624d7a3e0c9"
  },
  {
    "text": "Trump files suit against Iowa pollster Ann Selzer and Des Moines Register newspaper  —  Selzer published a poll days before the election that said Kamala Harris was ahead by 3 percentage points.  Trump ultimately won the state by 13 percentage points.  —  WASHINGTON — Donald Trump is suing Ann Selzer … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-files-suit-iowa-pollster-anne-selzer-des-moines-register-newspap-rcna184494"
  },
  {
    "text": "AOC defeated by Connolly in battle for Oversight role … - Ocasio-Cortez, one of House Democrats' most high-profile members, also lost a vote of the House Democratic Steering and Policy Committee on Monday. … - He had the backing of several veteran lawmakers, including former Speaker Nancy Pelosi (D-Calif.).",
    "url": "https://www.axios.com/2024/12/17/aoc-loses-gerry-connolly-democrats-oversight"
  },
  {
    "text": "GOP report recommends Liz Cheney be criminally investigated over Jan. 6 work  —  Republicans released a report Tuesday reviewing the “failures and politicization” of the now-disbanded House Jan. 6 committee, capping their investigation by recommending a criminal investigation into former Rep. Liz Cheney (R-Wyo.).",
    "url": "https://thehill.com/homenews/house/5045125-republicans-report-jan-6-committee/"
  },
  {
    "text": "Chairman Loudermilk Releases Second January 6, 2021 Report  —  WASHINGTON - Today, Committee on House Administration's Subcommittee on Oversight Chairman Barry Loudermilk (GA-11) released an interim report on his findings on the events surrounding January 6, 2021, as well as his investigation … ",
    "url": "https://cha.house.gov/2024/12/chairman-loudermilk-releases-second-january-6-2021-report"
  },
  {
    "text": "Elon Musk and SpaceX Face Federal Reviews After Violations of Security Reporting Rules … Elon Musk and his rocket company, SpaceX, have repeatedly failed to comply with federal reporting protocols aimed at protecting state secrets, including by not providing some details of his meetings … ",
    "url": "https://www.nytimes.com/2024/12/17/technology/elon-musk-spacex-national-security-reporting.html?unlocked_article_code=1.iE4.b6Ca._cqHDp7htyYR&smid=url-share"
  },
  {
    "text": "Disney Pulls Transgender Storyline from Pixar's ‘Win or Lose’ Streaming Series (Exclusive)  —  The original animated show about a co-ed high school team debuts on Disney+ in February. … The series follows a co-ed middle school softball team named the Pickles in the week leading up to their championship game.",
    "url": "https://www.hollywoodreporter.com/tv/tv-news/disney-pulls-transgender-storyline-win-or-lose-1236088172/"
  },
  {
    "text": "Trump lawyers allege ‘grave juror misconduct’ in their latest attack on hush money conviction  —  Prosecutors called the misconduct allegations “vague” and said the source of the allegation had told Trump's team its summary of the allegations “contains inaccuracies.”",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-lawyers-allege-grave-juror-misconduct-latest-attempt-toss-hush-m-rcna184541"
  },
  {
    "text": "Trump eyes donor for Air Force chief  —  Trump donor Andrew McKenna is a leading contender for secretary of the Air Force, according to three people close to the transition.  McKenna, a private pilot who heads a small Washington advisory and investment firm, would be the latest of Trump's picks … ",
    "url": "https://www.politico.com/live-updates/2024/12/17/congress/trump-nears-air-force-pick-00194933"
  },
  {
    "text": "Hochul calls for abolition of Electoral College  —  New York Gov. Kathy Hochul (D) on Tuesday called for the Electoral College to be abolished, arguing the system is outdated.  —  “We, the people, forming a more perfect union, and I strongly believe that the people of New York state … ",
    "url": "https://thehill.com/homenews/state-watch/5045091-hochul-calls-electoral-college-abolition/"
  },
  {
    "text": "'It's Frightening': ABC News Staffers Incensed by ‘Capitulation’ to Trump  —  “My fear is this sets a tone for the next four years, and that the tone is: Do not upset the president” … A New York jury had ruled in May of that year that Trump was liable for sexual abuse and defamation against Carroll.",
    "url": "https://www.rollingstone.com/politics/politics-news/abc-news-staffers-incensed-settlement-trump-1235209603/"
  },
  {
    "text": "Biden's LNG-Export Study Presents ‘Speed Bump’ for Trump  — Study finds more US exports threatens higher global emissions  — Trump has vowed to end a moratorium on new LNG permits  —  The Biden administration released a key study Tuesday that is likely to complicate President-elect … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-17/biden-releases-study-of-lng-exports-that-could-hamstring-trump"
  },
  {
    "text": "Judge Broke Rules by Criticizing Justice Alito During Flag Flap  —  Investigation concludes it was an ethics violation to question the ethics of a Supreme Court justice  —  WASHINGTON—Amid collapsing public confidence in U.S. courts, a federal judge has been found culpable of misconduct.",
    "url": "https://www.wsj.com/us-news/law/judge-broke-rules-by-criticizing-justice-alito-during-flag-flap-784405fb?st=6hpifc"
  },
  {
    "text": "Congress strikes deal to avert government shutdown  —  Congressional leaders have struck a bipartisan deal to keep the government funded beyond a looming Dec. 20 shutdown deadline.  —  Legislation rolled out by leadership on Tuesday would kick the Friday funding deadline to March 14 to buy … ",
    "url": "https://thehill.com/business/budget/5040567-government-funding-deal-shutdown-deadline/"
  },
  {
    "text": "Trump's tariffs could be leading to buyer's remorse  —  New polls show Americans increasingly concerned about the negative impact of something they haven't seemed to truly understand.  —  Few policy proposals were as central to President-elect Donald Trump's 2024 campaign pitch as tariffs.",
    "url": "https://www.washingtonpost.com/politics/2024/12/17/trump-tariffs-polling-popuarity/"
  },
  {
    "text": "Republican House Majority in Peril  —  The Republican wafer-thin majority in the House of Representatives is facing growing uncertainty as GOP members of  —  's Cabinet.  —  Representative Victoria Spartz, an Indiana  —  , announced on Monday that she would no longer … ",
    "url": "https://www.newsweek.com/republican-house-majority-victoria-spartz-2002016"
  },
  {
    "text": "A couple hundred North Korean troops killed, wounded in battles with Ukrainian forces  —  A couple hundred North Korean troops fighting alongside Russian forces against Ukraine have been killed or wounded during battle in the Kursk border region, a senior military official said Tuesday.",
    "url": "https://apnews.com/article/north-korea-ukraine-casualties-kursk-russia-a1207ba61ded5061f721ffa0f0650851"
  },
  {
    "text": "Biden backs calls to ban congressional stock trading  —  “Nobody in the Congress should be able to make money in the stock market.”  —  President Joe Biden speaks during a Hanukkah reception in the East Room of the White House in Washington, Dec. 16, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-backs-calls-ban-congressional-stock-trading/story?id=116888132"
  },
  {
    "text": "GOP senator blocks proposal to protect federal workers from Trump  —  Republican Sen. Eric Schmitt (Mo.) on Tuesday blocked a request by Democratic senators to pass legislation to protect federal workers from civil service reforms that President-elect Trump has endorsed to fight what he calls the “deep state” in Washington, D.C.",
    "url": "https://thehill.com/homenews/5045553-sen-eric-schmitt-blocks-proposal-protecting-federal-workers-trump/"
  },
  {
    "text": "Archivist says Equal Rights Amendment can't be certified as Democrats push Biden to recognize it  —  In a rare joint statement, the archivist and deputy archivist of the United States said Tuesday that the 1970s-era Equal Rights Amendment cannot be certified without further action by Congress or the courts … ",
    "url": "https://apnews.com/article/biden-equal-rights-amendment-women-sex-discrimination-a6ee48bd6e8199839f5a44adb483d59d"
  },
  {
    "text": "Nancy Mace says mysterious drones could be from ‘outer space’  —  Rep. Nancy Mace (R-S.C.) said in a podcast interview that the public should not rule out “outer space” as a possible origin of some of the drones sighted recently in the Northeast.  —  In an interview on “OutKick” recorded Monday … ",
    "url": "https://thehill.com/homenews/house/5044394-nancy-mace-says-mysterious-drones-could-be-from-outer-space/"
  },
  {
    "text": "Electoral college elects Donald Trump as next president  —  The gatherings unfolded uneventfully, unlike four years ago when alternate electors for Trump convened in seven states that he lost.  —  The electoral college convened in all 50 states Tuesday to elect Donald Trump to be the 47th president … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/17/electoral-college-results-donald-trump/"
  },
  {
    "text": "Kremlin Insiders Spill Putin's Secret Plan to Manipulate Trump  —  Head of RT Margarita Simonyan, a decorated state TV propagandist and Kremlin insider, has spilled not only Russia's hopes and dreams for Donald Trump's second term in office but also Moscow's strategy for suckering him in.",
    "url": "https://www.thedailybeast.com/kremlin-insiders-spill-putins-secret-plan-to-manipulate-trump/"
  },
  {
    "text": "Possible Trump FEMA Pick Made Millions After Florida Disaster-Response Gig  —  Democratic Rep. Jared Moskowitz is seen as a contender to lead FEMA under Donald Trump.  He says he's staying in Congress  —  Over the past two years, Rep. Jared Moskowitz (D-Fla.) built a national profile … ",
    "url": "https://www.rollingstone.com/politics/politics-features/jared-moskowitz-trump-fema-desantis-disaster-consulting-1235209178/"
  },
  {
    "text": "Lawmakers seek to rein in PBMs as part of spending bill's sweeping health deal  —  Lawmakers have agreed to attach a sweeping health care package to a year-end stopgap government funding legislation, according to text obtained by The Hill ahead of the release of the full bill.",
    "url": "https://thehill.com/policy/healthcare/5045169-health-care-package-pbms-funding-bill/"
  },
  {
    "text": "How Many Illegal Aliens Reside in Sanctuary Jurisdictions?  —  A bit more than half  —  When President Trump begins his efforts to deport illegal immigrants in January, he will need to overcome “sanctuary jurisdictions” that do not fully cooperate with Immigration and Customs Enforcement (ICE).",
    "url": "https://cis.org/Richwine/How-Many-Illegal-Aliens-Reside-Sanctuary-Jurisdictions"
  },
  {
    "text": "Schumer's last sprint to beat McConnell and Trump's judges record … - Schumer has moved 20 judicial nominees through the Senate during the lame duck session.  — Schumer had a one-seat majority for the last two years of the Biden administration.  — Vice President Harris voted seven times … ",
    "url": "https://www.axios.com/2024/12/18/schumer-judges-mcconnell-trump"
  },
  {
    "text": "Attorney for RFK Jr. blasts ‘hysterical’ media report as distortion of HHS pick's views on vaccines  —  A petition signed by RFK was misconstrued by the New York Times in its reporting, Aaron Siri  —  An attorney advising Robert F. Kennedy Jr. is slamming a New York Times report last week … ",
    "url": "https://www.foxnews.com/politics/attorney-rfk-jr-blasts-hysterical-media-report-distortion-hhs-picks-views-vaccines"
  }
]