[
  {
    "text": "Harris on Ellipse: Time to turn the page on Trump  —  Vice President Harris delivered a speech Tuesday on the White House Ellipse in Washington, D.C. — the very site at which former President Trump gave remarks to a crowd that later incited a riot at the Capitol.",
    "url": "https://thehill.com/homenews/4960670-harris-ellipse-turn-page-trump/"
  },
  {
    "text": "‘I was the director of the Michigan Republican Party.  I will vote for Kamala Harris.’  —  I was the executive director of the Michigan Republican Party, back during a time when the GOP embraced values like fiscal discipline and a strong foreign policy.  —  I voted for Nikki Haley … ",
    "url": "https://www.lansingcitypulse.com/stories/i-was-the-director-of-the-michigan-republican-party-i-will-vote-for-kamala-harris,115386"
  },
  {
    "text": "Kamala Harris Draws Massive Crowd at Ellipse, Notches Larger Audience Than Trump's Jan. 6 Rally in Same Spot, Campaign Says  —  Vice President Kamala Harris delivered remarks in Washington, D.C. on Tuesday night in front of a massive crowd where she made her closing argument to voters at The Ellipse ahead of next week's election.",
    "url": "https://www.mediaite.com/politics/kamala-harris-draws-massive-crowd-at-ellipse-notches-larger-audience-than-trumps-jan-6-rally-in-same-spot-campaign-says/"
  },
  {
    "text": "Trump claims to ABC's Scott he didn't hear comedian's Puerto Rico comment, doesn't denounce it  —  The former president denied knowing the comedian who made a slew of racist, sexist and vulgar comments at his rally at Madison Square Garden, ABC News Senior Congressional Correspondent Rachel Scott reports.",
    "url": "https://abcnews.go.com/Politics/live-updates/2024-election-updates-harris-make-closing-argument-amid?id=115252538&entryId=115254897"
  },
  {
    "text": "What More Do You People Want from Kamala Harris?  (Part Deux)  —  She's done everything voters could reasonably have asked for.  —  ∙ Paid  —  Tonight we're going to livestream Kamala Harris's big closing argument rally for Bulwark+ members.  The show starts at 7pm.",
    "url": "https://www.thebulwark.com/p/what-more-do-you-people-want-from-293"
  },
  {
    "text": "Man who attacked Nancy Pelosi's husband gets life in prison  —  SAN FRANCISCO — The man who was sentenced to 30 years in federal prison for attacking the husband of former House Speaker Nancy Pelosi with a hammer in their California home was sentenced Tuesday to life in prison without … ",
    "url": "https://www.npr.org/2024/10/29/nx-s1-5171029/man-who-attacked-nancy-pelosis-husband-gets-life-in-prison"
  },
  {
    "text": "Speaker Mike Johnson criticizes Obamacare and promises ‘massive reform’ if Trump wins  —  The Republican speaker said at an event in Pennsylvania that overhauling health care will be a major focus and that “Trump's going to go big” if he takes the presidency.",
    "url": "https://www.nbcnews.com/politics/congress/speaker-johnson-criticizes-obamacare-promises-massive-reform-trump-win-rcna177853"
  },
  {
    "text": "Nikki Haley Says She Is ‘on Standby’ to Campaign for Donald Trump  —  Ms. Haley, a former rival of Mr. Trump, has repeatedly offered advice and criticism to Mr. Trump and other Republican candidates from the sidelines.  —  Nikki Haley, Donald J. Trump's last rival standing in the fight … ",
    "url": "https://www.nytimes.com/2024/10/29/us/politics/nikki-haley-trump.html"
  },
  {
    "text": "Supreme Court rules RFK Jr. will appear on battleground ballots despite suspending campaign  —  The Supreme Court declined Tuesday to let Robert F. Kennedy Jr. withdraw his name from ballots in Michigan and Wisconsin, battleground states where votes for his now suspended campaign could cut into support for former President Donald Trump.",
    "url": "https://www.cnn.com/2024/10/29/politics/rfk-jr-supreme-court-wisconsin-michigan"
  },
  {
    "text": "Teri Garr, the offbeat comic actor of ‘Young Frankenstein’ and ‘Tootsie,’ has died  —  Teri Garr, the quirky comedy actor who rose from background dancer in Elvis Presley movies to co-star of such favorites as “Young Frankenstein” and “Tootsie,” has died.  She was 79.",
    "url": "https://apnews.com/article/teri-garr-dies-be39482a60724c5bb81bbd8f34dfaf2d"
  },
  {
    "text": "'The suburbs — that's the whole deal': How the suburbs became Harris' clearest path to victory  —  Dems are betting they can improve on Joe Biden's numbers in the suburbs.  —  KNIGHTDALE, North Carolina — Kamala Harris is counting on suburban voters to do what they've done since Donald Trump won the presidency in 2016: reject him.",
    "url": "https://www.politico.com/news/2024/10/29/harris-suburbs-votes-00186166"
  },
  {
    "text": "Elon Musk-Funded PAC Supercharges ‘Progress 2028’ Democrat Impersonation Ad Campaign … An Elon Musk-funded super PAC has expanded an advertising campaign in which it is impersonating Democrats and targeting registered Republicans with policies unpopular with conservatives they say Kamala Harris will pass if she wins the election.",
    "url": "https://www.404media.co/elon-musk-funded-pac-supercharges-progress-2028-democrat-impersonation-ad-campaign/"
  },
  {
    "text": "On Elon Musk's X, Republicans go viral as Democrats disappear  —  A Washington Post analysis found that Republicans are posting more, getting followed more and going viral more now that the world's richest Trump supporter is running the show.  —  The top political accounts on X have seen … ",
    "url": "https://www.washingtonpost.com/technology/2024/10/29/elon-musk-x-republican-democrat-twitter-election/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwMTc0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxNTYwMzk5LCJpYXQiOjE3MzAxNzQ0MDAsImp0aSI6ImRjZjEzNDYxLTBlNjEtNGNhYy1hODE2LTMxNmIyZmRiNDcyMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMTAvMjkvZWxvbi1tdXNrLXgtcmVwdWJsaWNhbi1kZW1vY3JhdC10d2l0dGVyLWVsZWN0aW9uLyJ9._swxWtRAVNu7JUVWoRNfQo9uNEN8IbkWnVcw-C_22eg&itid=gfta"
  },
  {
    "text": "Elon Musk Makes Shocking Confession on His Plans After Trump Victory  —  Elon Musk admitted that he knows that Donald Trump's policies would crash the economy if he's elected president, but thinks that the price is worth it.  —  The tech CEO and social media mogul on Monday evening replied … ",
    "url": "https://newrepublic.com/post/187662/elon-musk-confession-economy-trump-victory"
  },
  {
    "text": "Vice President Harris Delivers Address on The Ellipse in Washington, D.C.  —  2024 Democratic presidential nominee and Vice President Kamala Harris delivered her “closing arguments” to voters in an address at The Ellipse in Washington, DC.",
    "url": "https://www.c-span.org/video/?539540-1/vice-president-harris-delivers-address-ellipse-washington-dc"
  },
  {
    "text": "George W. Bush's Daughter Barbara Breaks Silence on Election to Campaign for Kamala Harris (Exclusive)  —  Barbara Pierce Bush tells PEOPLE she's “hopeful” that voters will back Harris on Nov. 5 to “move our country forward and protect women's rights”  —  Barbara Pierce Bush … ",
    "url": "https://people.com/george-w-bush-s-daughter-barbara-breaks-silence-on-election-to-campaign-for-kamala-harris-exclusive-8735810"
  },
  {
    "text": "We led some of America's largest companies.  Here's why we are voting for Harris, not Trump  —  Doug Parker is a former CEO of American Airlines.  Ken Frazier is a former CEO of Merck.  Anne Mulcahy is a former CEO of Xerox.  Ursula Burns is a former CEO of Xerox.  Reid Hoffman is a former CEO of LinkedIn.",
    "url": "https://fortune.com/2024/10/29/ceos-america-largest-companies-voting-for-harris-not-trump-leadership-elections-politics/"
  },
  {
    "text": "Ukraine is now struggling to survive, not to win  —  Russia is slicing through Ukrainian defences in parts of the battlefield  —  “After 970 days of war,” said Lloyd Austin, America's defence secretary, visiting Kyiv on October 21st, “Putin has not achieved one single strategic objective.”",
    "url": "https://www.economist.com/europe/2024/10/29/ukraine-is-now-struggling-to-survive-not-to-win"
  },
  {
    "text": "Elon Musk Bought a Texas Compound for His 11 Kids and Their Mothers … On a quiet, leafy street of multimillion-dollar properties, one stands out: a 14,400-square-foot mansion that looks like a villa plucked from the hills of Tuscany and transplanted to Austin, Texas.",
    "url": "https://www.nytimes.com/2024/10/29/business/elon-musk-children-compound.html?unlocked_article_code=1.V04.UATk.-c9h3lGvBo8r&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "One Week from the Election: The Survey Findings Keeping Me Up at Night  —  On October 16, PRRI released our 15th annual American Values Survey, conducted in partnership with the Brookings Institution.  That survey is our final look at American public opinion ahead of the election.",
    "url": "https://www.whitetoolong.net/p/one-week-from-the-election-the-survey"
  },
  {
    "text": "Transcript: Trump Rages at Fox News as His Allies Panic Over NYC Rally … Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.  I'm your host, Greg Sargent.  —  MAGA suddenly seems very, very out of sorts.",
    "url": "https://newrepublic.com/article/187646/transcript-trump-rages-fox-news-allies-panic-nyc-rally"
  },
  {
    "text": "Scoop: Schumer pledges antisemitism vote in Senate's lame-duck session … - However, critics argue the definition of antisemitism the legislation offers is overly broad. … - Schumer has privately said he plans to attach the Antisemitism Awareness Act — making the federal government adopt … ",
    "url": "https://www.axios.com/2024/10/30/chuck-schumer-antisemitism-vote"
  },
  {
    "text": "Partial Breach of Election Machine Passwords in Colorado Poses No Risk, State Says  —  The secretary of state said that the machines are not online, require a second set of passwords and are under constant surveillance in locked rooms.  —  Partial passwords for election machines … ",
    "url": "https://www.nytimes.com/2024/10/29/us/politics/colorado-election-passwords-breach.html"
  }
]