[
  {
    "text": "‘Make them pay’: Canada puts Trump's ‘first friend’ Elon Musk's Tesla in the crosshairs of tariff war  —  Canada's EV adoption rate is outpacing that of the U.S., with nearly 17% of new cars sold in the third quarter of 2024 being fully electric, compared to just 8% in the US.  —  Business Today Desk",
    "url": "https://www.businesstoday.in/world/canada/story/make-them-pay-canada-puts-trumps-first-friend-elon-musks-tesla-in-the-crosshairs-of-tariff-war-463097-2025-02-01"
  },
  {
    "text": "B.C. premier announces countermeasures against U.S. tariffs, including ban on ‘red-state’ liquor  —  U.S. President Donald Trump will impose 25% tariff on most Canadian imports beginning Tuesday  —  B.C. Premier David Eby has announced immediate countermeasures in response to incoming U.S. tariffs … ",
    "url": "https://www.cbc.ca/news/canada/british-columbia/bc-premier-david-eby-us-tariffs-1.7448307"
  },
  {
    "text": "Mexican president orders retaliatory tariffs against U.S.  —  Mexican President Claudia Sheinbaum on Saturday ordered retaliatory tariffs in response to the U.S. decision to slap 25% tariffs on all goods coming from Mexico, marking the apparent start of a trade war between the two countries.",
    "url": "https://www.reuters.com/world/americas/mexican-president-orders-retaliatory-tariffs-against-us-2025-02-02/"
  },
  {
    "text": "Elon Musk's team has gotten access to the Treasury Department's payments system.  — Trump tariffs: The Canadian government has been notified by the United States government that goods exported to the United States will be subject to a 25 percent tariff, with a lower rate for Canadian oil … ",
    "url": "https://www.nytimes.com/live/2025/02/01/us/trump-tariffs-news/treasury-department-payments-system?unlocked_article_code=1.tk4.2ZbK.3uhE-0Ft611J&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Elon Musk's Team Now Has Access to Treasury's Payments System  —  Treasury Secretary Scott Bessent gave Mr. Musk's representatives at the so-called Department of Government Efficiency a powerful tool to monitor and potentially limit government spending.  — 1.4k",
    "url": "https://www.nytimes.com/2025/02/01/us/politics/elon-musk-doge-federal-payments-system.html?unlocked_article_code=1.tk4.2ZbK.3uhE-0Ft611J"
  },
  {
    "text": "Musk aides gain access to sensitive Treasury Department payment system  —  The access — granted by Scott Bessent, Trump's newly confirmed treasury secretary — comes after the ousting of the agency's top career official.  —  Billionaire Elon Musk's deputies have gained access … ",
    "url": "https://www.washingtonpost.com/business/2025/02/01/elon-musk-treasury-payments-system/"
  },
  {
    "text": "DOGE is ripping out the guts of government  —  DOGE is beginning to hit, and this piece, by Mike Masnick, provides the best overview I've seen of what's happening. … The gloss that I'd add to what Mike says is this.  Just as happened with Twitter, we are seeing a Silicon Valley power fantasy playing out in real life.",
    "url": "https://www.programmablemutter.com/p/doge-is-ripping-out-the-guts-of-government"
  },
  {
    "text": "Education Department employees placed on leave for attending diversity training  —  Several employees began receiving leave notices late Friday.  —  Federal employees at the Education Department could be placed on administrative leave for previously attending a diversity training.",
    "url": "https://www.politico.com/news/2025/02/01/education-department-diversity-training-00201957"
  },
  {
    "text": "F.A.A.'s Main Warning System for Pilots Is Down, U.S. Official Says  —  Transportation Secretary Sean Duffy said the Federal Aviation Administration was using a backup system while it worked to address the problem.  —  The Federal Aviation Administration was using a backup system to send real … ",
    "url": "https://www.nytimes.com/2025/02/02/us/notam-outage-faa-alerts.html"
  },
  {
    "text": "‘We Have No Coherent Message’: Democrats Struggle to Oppose Trump  —  More than 50 interviews with Democratic leaders revealed a party struggling to decide what it believes in, what issues to prioritize and how to confront an aggressive right-wing administration.",
    "url": "https://www.nytimes.com/2025/02/02/us/politics/democrats-trump.html"
  },
  {
    "text": "Senior FBI official forcefully resisted Trump administration firings  —  Brian Driscoll pushed back so aggressively that some feared he would be dismissed.  Driscoll has so far not handed over the names of thousands of FBI agents who worked on Jan. 6th cases.",
    "url": "https://www.nbcnews.com/politics/national-security/senior-fbi-official-forcefully-resisted-trump-administration-firings-rcna190301"
  },
  {
    "text": "BREAKING NEWS: CDC orders mass retraction and revision of submitted research across all science and medicine journals.  Banned terms must be scrubbed.  —  I believe we are breaking news some news here.  To help sustain independent journalism and analysis, please support Inside Medicine.",
    "url": "https://insidemedicine.substack.com/p/breaking-news-cdc-orders-mass-retraction"
  },
  {
    "text": "End Appears Near for U.S. Aid Agency, Democratic Lawmakers Say  —  A sense of crisis among aid groups was growing as U.S.A.I.D.'s website went dark.  —  The website for the U.S. Agency for International Development went dark Saturday afternoon as lawmakers and aid workers … ",
    "url": "https://www.nytimes.com/2025/02/01/us/us-aid-agency-trump.html?unlocked_article_code=1.t04.Z808.njdMGjTNRFbz&smid=url-share"
  },
  {
    "text": "The Logic of Destruction  —  What is a country?  The way its people govern themselves.  America exists because its people elect those who make and execute laws.  The assumption of a democracy is that individuals have dignity and rights that they realize and protect by acting together.",
    "url": "https://snyder.substack.com/p/the-logic-of-destruction"
  },
  {
    "text": "NTSB forces reporters to get plane crash updates on X  —  The agency says it will no longer notify reporters about plane crash press briefings via email.  —  The National Transportation Safety Board (NTSB) on Saturday said it will stop e-mailing news organizations and reporters with updates … ",
    "url": "https://thedesk.net/2025/02/ntsb-moves-plane-crash-press-updates-x-twitter/"
  },
  {
    "text": "Exclusive: SEC's Republican-led commission tightens oversight of probes, sources say  —  Lawyers at the U.S. Securities Exchange Commission (SEC) have been told they need to seek permission from the politically appointed leadership before formally launching probes, two sources briefed on the matter said … ",
    "url": "https://www.reuters.com/world/us/secs-republican-led-commission-tightens-oversight-probes-sources-say-2025-02-02/"
  },
  {
    "text": "The power of independent journalism: From her Brooklyn apartment, she ‘scooped’ the nation's media  —  First word of the Trump administration's since-rescinded order to freeze spending on federal loans and grants came not from a major news organization, but from a woman working alone in her Brooklyn apartment.",
    "url": "https://apnews.com/article/independent-journalists-trump-local-news-a60b49c97058d14f1b2e36cdc771d8f7"
  }
]