[
  {
    "text": "Clashing Over Jan. 6, Trump and Biden Show Reality Is at Stake in 2024  —  In dueling sets of speeches, Donald Trump and President Biden are framing the election as a battle for the future of democracy — with Mr. Trump brazenly casting Mr. Biden as the true menace.",
    "url": "https://www.nytimes.com/2024/01/06/us/politics/jan-6-trump-biden.html"
  },
  {
    "text": "Justices to Decide Whether Trump Is Eligible for Colorado Ballot  —  The Colorado Supreme Court ruled last month that the former president could not appear on the state's Republican primary ballot because he had engaged in insurrection.  —  The Supreme Court on Friday agreed … ",
    "url": "https://www.nytimes.com/2024/01/05/us/trump-supreme-court-colorado-ballot.html"
  },
  {
    "text": "‘We have to get over it’: Trump responds to Iowa school shooting during speech  —  Former President Donald Trump reacted to the shooting at the high school in Perry, Iowa, during a commit-to-caucus event in Sioux Center on Friday evening — and used an eye-catching turn of phrase.",
    "url": "https://www.rawstory.com/trump-responds-iowa-school-shooting/"
  },
  {
    "text": "Supreme Court agrees to weigh whether Trump can be kicked off ballot in Colorado  —  The case raises a novel legal question under a constitutional clause that prohibits those who have “engaged in insurrection” from serving in the federal government.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-agrees-weigh-whether-trump-can-kicked-ballot-colorado-rcna132058"
  },
  {
    "text": "Supreme Court allows Idaho to enforce its strict abortion ban, even in medical emergencies  —  WASHINGTON (AP) — The Supreme Court on Friday allowed Idaho to enforce its strict abortion ban, even in medical emergencies, while a legal fight continues.  —  The justices said they would hear arguments … ",
    "url": "https://apnews.com/article/supreme-court-abortion-medical-emergencies-idaho-8ca89d7de0c1fa9256dcd27d1847e144"
  },
  {
    "text": "Statement from President Joe Biden on Supreme Court Order on Idaho's Abortion Ban  —  Today's Supreme Court order allows Idaho's extreme abortion ban to go back into effect and denies women critical emergency abortion care required by federal law.  The overturning of Roe v. Wade … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/05/statement-from-president-joe-biden-on-supreme-court-order-on-idahos-abortion-ban/"
  },
  {
    "text": "Supreme Court to decide if U.S. law requires some emergency room abortions  —  The Justice Department challenged an Idaho abortion ban, saying federal law requires emergency room doctors to perform abortions in some circumstances  —  The Supreme Court said Friday it will review … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/05/abortion-idaho-supreme-court-hospitals-emtala/"
  },
  {
    "text": "Defense Secretary Lloyd Austin recovering after being admitted to hospital  —  Defense Secretary Lloyd Austin was admitted to Walter Reed National Military Medical Center on New Year's Day for complications from an elective medical procedure, the Pentagon said Friday.",
    "url": "https://www.cnn.com/2024/01/05/politics/defense-secretary-lloyd-austin-hospital/"
  },
  {
    "text": "Defense Secretary Hospitalized After Complications From Elective Procedure  —  Lloyd J. Austin III has been at Walter Reed National Military Medical Center since Monday, but is “recovering well and is expecting to resume his full duties,” the Pentagon said in a statement.",
    "url": "https://www.nytimes.com/2024/01/05/us/politics/defense-secretary-lloyd-austin-hospital.html"
  },
  {
    "text": "Raskin touts Biden's Jan. 6 speech as ‘remarkable’ ahead of riot anniversary  —  Rep. Jamie Raskin (D-Md.) called President Biden's recent speech that went after former President Trump “remarkable” in an interview on MSNBC Friday.  —  “Well, it was a remarkable speech which spoke directly … ",
    "url": "https://thehill.com/homenews/house/4392230-raskin-touts-bidens-jan-6-speech-as-remarkable-ahead-of-riot-anniversary/"
  },
  {
    "text": "Wayne LaPierre Resigns From N.R.A. With Trial Set to Open  —  The resignation of Mr. LaPierre, the National Rifle Association's longtime leader, came as he faced a corruption trial in Manhattan.  —  On the eve of a legal battle in New York, Wayne LaPierre told board members on Friday … ",
    "url": "https://www.nytimes.com/2024/01/05/nyregion/wayne-lapierre-resigns-nra.html"
  },
  {
    "text": "US Intelligence Shows Flawed China Missiles Led Xi to Purge Army  — China missiles filled with water, not fuel: US intelligence  — Xi seeking to root out corruption, prepare military for combat  —  US intelligence indicates that President Xi Jinping's sweeping military purge came … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-06/us-intelligence-shows-flawed-china-missiles-led-xi-jinping-to-purge-military"
  },
  {
    "text": "RFK Jr. Was Jeffrey Epstein's Guest, Butler Claims  —  The presidential candidate previously copped to taking two trips on Epstein's plane.  —  Robert F. Kennedy Jr. was one of Jeffrey Epstein's celebrity guests, the sex offender's former house manager claimed in newly unsealed documents.",
    "url": "https://www.thedailybeast.com/robert-f-kennedy-jr-was-jeffrey-epsteins-guest-butler-claims"
  },
  {
    "text": "Nikki Haley says she would ‘maybe’ consider Ron DeSantis as her running mate  —  Haley wouldn't rule out joining forces with the Florida governor, while saying she is “not running to be vice president.”  —  Former U.N. Ambassador Nikki Haley said she would “maybe” consider Florida … ",
    "url": "https://www.nbcnews.com/politics/2024-election/haley-desantis-vice-president-trump-rcna131923"
  },
  {
    "text": "House Republicans to Broaden Higher Education Inquiry Beyond Antisemitism  —  Emboldened by the resignations of two prominent university presidents, House Republicans are planning an aggressive inquiry into academia, long one of their favorite targets of attack.",
    "url": "https://www.nytimes.com/2024/01/05/us/politics/house-republicans-antisemitism-colleges-harvard.html"
  }
]