[
  {
    "text": "Who is Jim Jordan?  —  The Ohio Republican, who is vying to be speaker, has served in the House since 2007.  —  WASHINGTON — Rep. Jim Jordan, R-Ohio, is the only candidate in the race for House speaker, but he's still struggling to win over enough support from rank-and-file Republicans to get elected in a formal floor vote.",
    "url": "https://www.nbcnews.com/politics/congress/jim-jordan-rcna120790"
  },
  {
    "text": "Normie GOP, R.I.P.  —  “Moderates always cave.  A tale as old as time.”  —GOP member of Congress  —  Happy Tuesday.  —  Let's start today with three stories:  — Eight years ago, former Louisiana Governor Bobby Jindal called then-candidate Donald Trump an “egomaniacal madman”; an … ",
    "url": "https://plus.thebulwark.com/p/normie-gop-rip"
  },
  {
    "text": "Jim Jordan loses first House speaker vote, will try again Wednesday  — Rep. Jim Jordan failed to win the 217 votes he needed to be elected House Speaker on the first vote.  — A second ballot on Jordan's candidacy is expected at 11 a.m. ET Wednesday.  — The House has been leaderless … ",
    "url": "https://www.cnbc.com/2023/10/17/house-speaker-vote-jim-jordan-intends-to-wear-down-gop-opposition-with-multiple-votes.html"
  },
  {
    "text": "Jim Jordan Won't Make A Scandal Of Himself  —  Democrats can make him one, but brace yourself for the Jim Jordan beat sweeteners  —  After Steve Saclise turned out not to be the hero they wanted, House Republicans will decide whether Joker Jim Jordan is the hero they need … ",
    "url": "https://www.offmessage.net/p/jim-jordan-wont-make-a-scandal-of"
  },
  {
    "text": "Here's what we know about Jim Jordan and the Ohio State University wrestling scandal  — Rep. Jim Jordan of Ohio could be the next speaker of the House following McCarthy's ouster.  — Questions are resurfacing about his role in the sexual abuse scandal at Ohio State University.",
    "url": "https://www.businessinsider.com/what-happened-jim-jordan-ohio-state-wrestling-sex-abuse-scandal-2023-10?op=1"
  },
  {
    "text": "Israel-Hamas war: Israel bombs Gaza where civilians sought refuge  —  The Gaza Health Ministry said an Israeli airstrike Tuesday hit a Gaza City hospital packed with wounded and other Palestinians seeking shelter, killing hundreds.  If confirmed, the attack would be by far the deadliest Israeli airstrike in five wars fought since 2008.",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-biden-rafah-e062825a375d9eb62e95509cab95b80c"
  },
  {
    "text": "Man, Wrongfully Imprisoned for 16 Years, Is Fatally Shot During Traffic Stop  —  Leonard Allan Cure, who was exonerated in 2020 after being convicted of armed robbery, was shot and killed by a sheriff's deputy in Georgia after being pulled over for speeding.",
    "url": "https://www.nytimes.com/2023/10/17/us/leonard-allan-cure-georgia-deputy-shooting.html"
  },
  {
    "text": "IDF confirms Islamic Jihad failed rocket destroyed Gaza hospital  —  Rockets fired by factions in the Gaza Strip often fall short, with Palestinians killed in a number of past such incidents.  —  The IDF confirmed late Tuesday night that Islamic Jihad's failed rocket had destroyed a Gaza hospital … ",
    "url": "https://www.jpost.com/breaking-news/article-768879"
  },
  {
    "text": "This morning, the Justice Department announced that the United States has reached a settlement with the plaintiffs in the case of Ms. L. v. U.S. Immigration and Customs Enforcement, a class action lawsuit filed in 2018 over the Trump administration's policy of separating parents and children at the southwest border to deter migrants.",
    "url": "https://heathercoxrichardson.substack.com/p/october-16-2023"
  },
  {
    "text": "The Right's Latest Target: Unmarried Women  —  Archconservatives find single women threatening, and they're trying to browbeat them into submission.  —  Pocket  —  This article appears in the October 30/November 6, 2023 issue, with the headline “Scolds and the Single Girl.”",
    "url": "https://www.thenation.com/article/archive/taylor-swift-single-women-right-wing/"
  },
  {
    "text": "Ukraine uses secretly shipped U.S. missiles to launch surprise strike  —  The delivery and use on the battlefield marks a major ramp up of the administration's defense of Ukraine.  —  The Ukrainian military on Tuesday used U.S.-supplied longer-range missiles to strike nine Russian helicopters … ",
    "url": "https://www.politico.com/news/2023/10/17/ukraine-uses-secretly-shipped-u-s-missiles-to-launch-surprise-strike-00121932"
  },
  {
    "text": "Trump's statements pose ‘grave threats’ to court proceedings, Judge Chutkan says in written gag order  —  US District Judge Tanya Chutkan has put into writing her limited gag order that bars Donald Trump from making public statements about witnesses who might testify against him in the federal … ",
    "url": "https://www.cnn.com/2023/10/17/politics/trump-gag-order-written-tanya-chutkan/"
  },
  {
    "text": "Former GOP gubernatorial candidate Ryan Kelley sentenced to prison on Jan. 6 charges  —  The former candidate for Michigan governor was arrested during the Republican primary last year.  —  WASHINGTON — A former Republican candidate for Michigan governor was sentenced Tuesday to 60 days … ",
    "url": "https://www.nbcnews.com/politics/justice-department/republican-candidate-ryan-kelley-sentenced-prison-jan-6-rcna120679"
  },
  {
    "text": "Whatever unfolds in Gaza war, judgment day looms for Netanyahu  —  One Israeli cabinet minister was barred from a hospital visitors' entrance.  Another's bodyguards were drenched with coffee thrown by a bereaved man.  A third had “traitor” and “imbecile” shouted at her as she came to comfort families evacuated during the horror.",
    "url": "https://www.reuters.com/world/middle-east/whatever-unfolds-gaza-war-judgment-day-looms-netanyahu-2023-10-17/"
  },
  {
    "text": "Glenn Youngkin and the gap between fentanyl politics and reality  —  Virginia Gov. Glenn Youngkin (R) is not a candidate for the 2024 Republican presidential nomination, but he has been assiduous about remaining in the vicinity of the discussion.  Over the course of the past year or so … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/17/youngkin-fentanyl-border-immigration/"
  },
  {
    "text": "WATCH: Cornell Professor Says Hamas Atrocities Were ‘Exhilarating’  —  A Cornell University professor told a crowd of students that the Hamas terror attacks against Israeli citizens were “exhilarating” and “energizing.”  —  “It was exhilarating,” Russell Rickford, a history professor at Cornell … ",
    "url": "https://freebeacon.com/latest-news/watch-cornell-professor-says-hamas-atrocities-were-exhilarating/"
  }
]