[
  {
    "text": "Trump Leads in 5 Key States, as Young and Nonwhite Voters Express Discontent With Biden  —  A new set of Times/Siena polls, including one with The Philadelphia Inquirer, reveal an erosion of support for the president among young and nonwhite voters upset about the economy and Gaza.",
    "url": "https://www.nytimes.com/2024/05/13/us/politics/biden-trump-battleground-poll.html"
  },
  {
    "text": "Cross-Tabs: May 2024 Times/Siena Poll of the Presidential Battlegrounds  —  Donald Trump leads Joe Biden in five of six states polled by The New York Times, The Philadelphia Inquirer and Siena College from April 28 to May 9, 2024.  —  View toplines for the full set of polls and cross-tabs for: all registered voters |",
    "url": "https://www.nytimes.com/interactive/2024/05/13/us/elections/times-siena-poll-registered-voter-crosstabs.html"
  },
  {
    "text": "Democrats Hold Leads in 4 Crucial Races That Could Decide Senate Control  —  New battleground state polls by The New York Times, Siena College and The Philadelphia Inquirer show Democrats ahead in Arizona, Nevada, Pennsylvania and Wisconsin, and running well ahead of the president.",
    "url": "https://www.nytimes.com/2024/05/13/us/politics/democrats-senate-battleground-poll.html"
  },
  {
    "text": "Justice Thomas has used this “hideous place” to amass the power he now exploits  —  Thomas's attack on Washington comes as he will, yet again, issue rulings that set the national rules for the legal questions before the justices.  —  Anyone who lives in Washington, D.C. … ",
    "url": "https://www.lawdork.com/p/justice-thomas-attacks-dc-as-hideous"
  },
  {
    "text": "Live Updates: Michael Cohen Says at Trial He Would Do ‘Whatever’ Trump Wanted  —  Mr. Cohen, who made the payment at the center of the criminal case against Donald J. Trump, is the star witness against the former president at his hush-money trial.  —  Cohen's testimony will be at the crux of the case.",
    "url": "https://www.nytimes.com/live/2024/05/13/nyregion/trump-trial-michael-cohen"
  },
  {
    "text": "State Republican parties are going rogue  —  Good morning, Early Birds.  Staring at the sky to watch the eclipse is out.  Staring at the sky to watch the aurora borealis is in.  (At least it can't damage your eyes.)  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2024/05/13/state-republican-parties-are-going-rogue/"
  },
  {
    "text": "Tim O'Brien on 35 years of covering Trump  —  “His id and animal impulses weren't fully unleashed in the way they are now.”  —  ∙ Paid … Ten years before Donald Trump came down that golden escalator to change the course of American history, Tim O'Brien had already exposed him as a fraud.",
    "url": "https://www.publicnotice.co/p/tim-obrien-interview-trump-2024"
  },
  {
    "text": "The Most Endangered Democrat in America  —  Jamaal Bowman might lose his job over Israel.  —  Jamaal Bowman, the two-term congressman from Westchester County and the would-be future of the progressive left, is tired of the questions about George Latimer.  “Yeah, I mean, I think it says something … ",
    "url": "https://nymag.com/intelligencer/article/jamaal-bowman-george-latimer-primary-israel.html"
  },
  {
    "text": "Three people charged with offences under the National Security Act  —  Three people have been charged with offences under the National Security Act as part of an investigation led by officers from the Met's Counter Terrorism Command with support from colleagues in Counter Terrorism Policing in the North East and South East.",
    "url": "https://news.met.police.uk/news/three-people-charged-with-offences-under-the-national-security-act-483705"
  },
  {
    "text": "The real cancel culture  —  In 2020, Bari Weiss quit her job as an editor and writer at the New York Times editorial page in a huff.  In her public resignation letter, Weiss argued that she was forced out because the paper had become “illiberal” and her more conservative beliefs made her … ",
    "url": "https://popular.info/p/the-real-cancel-culture"
  },
  {
    "text": "How 20 Years of Same-Sex Marriage Changed America  —  After ‘dire predictions,’ the effects have been largely positive, a new study finds  —  Twenty years ago this week, David Wilson and Rob Compton entered into a marriage that some believed would bring on the apocalypse.",
    "url": "https://www.wsj.com/politics/policy/how-20-years-of-same-sex-marriage-changed-america-670758bd"
  },
  {
    "text": "Psaki's new book falsely recounts Biden's watch check in troop ceremony  —  Former White House press secretary Jen Psaki claims in her new book that President Biden never looked at his watch during the ceremony for soldiers killed during the U.S. withdrawal from Afghanistan in 2021 … ",
    "url": "https://www.axios.com/2024/05/13/psaki-book-biden-watch-check-afghanistan"
  },
  {
    "text": "Alvin Bragg's Office Deleted Phone Call Records of Michael Cohen and Stormy Daniels' Lawyer  —  Trump attorney asked about roughly three pages worth of records that the attorney claimed Mr. Bragg's office had deleted.  —  A paralegal from Manhattan Attorney General Alvin Bragg's office testified … ",
    "url": "https://www.theepochtimes.com/us/alvin-braggs-office-deleted-evidence-of-phone-calls-between-michael-cohen-and-stormy-daniels-lawyer-5648208"
  },
  {
    "text": "Nonprofits Are Making Billions off the Border Crisis  —  Federal funding has turned the business of resettling migrant children into a goldmine for a handful of NGOs—and their top executives.  —  While the border crisis has become a major liability for President Biden, threatening his reelection chances … ",
    "url": "https://www.thefp.com/p/nonprofits-make-billions-off-migrant-children"
  }
]