[
  {
    "text": "New book details Trump lawyers' secret meeting with Jack Smith ahead of DC indictment  —  ABC's Jonathan Karl offers an account of a fateful July 27 meeting in his forthcoming book.  —  Jack Smith's public image, shaped by his near invisibility since taking over the federal criminal cases … ",
    "url": "https://www.politico.com/news/2023/11/13/book-trump-lawyers-meeting-jack-smith-00126681"
  },
  {
    "text": "Scoop: Trump hung up on Kim Kardashian, new Jonathan Karl book says  —  Former President Trump hung up on Kim Kardashian when she called for help with a clemency case — because he assumed she voted for President Biden, ABC News' Jonathan Karl writes in “Tired of Winning,” out Tuesday.",
    "url": "https://www.axios.com/2023/11/13/trump-biden-white-house-kim-kardashian-book"
  },
  {
    "text": "Behind the Curtain: Trump allies pre-screen loyalists for unprecedented power grab … - His top obsession will be the Justice Department, the FBI and the intelligence community — all of which he thinks conspired to investigate him, thwart him, screw him.",
    "url": "https://www.axios.com/2023/11/13/trump-loyalists-2024-presidential-election"
  },
  {
    "text": "I Was Obama's 2012 Campaign Manager.  There's No Need to Panic Over Biden.  —  Don't sweat the doom and gloom polling.  We've been here before.  —  As you walk into my office, the first thing you see is a framed magazine cover.  It's not from the days of triumph — like in November 2012 … ",
    "url": "https://www.politico.com/news/magazine/2023/11/13/obama-2012-campaign-manager-advice-00126736"
  },
  {
    "text": "MAGA-dominated state Republican parties plagued by infighting, money woes  —  National Republicans fear the cash crunch could hamper field operations in key swing states come 2024  —  In Arizona, the state GOP chairman has been begging the Republican National Committee for a financial bailout.",
    "url": "https://www.washingtonpost.com/politics/2023/11/13/republican-state-parties-struggles-maga/"
  },
  {
    "text": "Maryanne Trump Barry, Donald Trump's Older Sister, Dies at 86  —  Ms. Barry, a former federal judge, served as her brother's protector and critic throughout their lives.  —  Maryanne Trump Barry, a former federal judge who was an older sister of Donald J. Trump and served as both his protector … ",
    "url": "https://www.nytimes.com/2023/11/13/us/politics/maryanne-trump-barry-dead.html"
  },
  {
    "text": "Secret Service agents protecting Biden's granddaughter open fire when 3 people try to break into SUV  —  Secret Service agents protecting President Joe Biden's granddaughter opened fire after three people tried to break into an unmarked Secret Service vehicle in the nation's capital, a law enforcement official told The Associated Press.",
    "url": "https://apnews.com/article/naomi-biden-secret-service-shooting-washington-georgetown-997126378e864c5acd0c9a1c6618c4e2"
  },
  {
    "text": "Secret Service opens fire on people attempting to break into car outside Naomi Biden's home: Sources  —  Naomi Biden, 29, is the president's granddaughter.  —  Naomi Biden, the granddaughter of President Joe Biden, and her husband Peter Neal arrive for a State Dinner in honor … ",
    "url": "https://abcnews.go.com/Politics/secret-service-opens-fire-people-attempting-break-car/story?id=104843412"
  },
  {
    "text": "Trump calls political enemies ‘vermin,’ echoing dictators Hitler, Mussolini  —  On Veterans Day, the former president vowed to “root out” his liberal opponents, drawing backlash from historians who say his rhetoric is reminiscent of authoritarians  —  Former president Donald Trump denigrated … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/12/trump-rally-vermin-political-opponents/"
  },
  {
    "text": "Liz Cheney says RNC chair ‘collaborating’ with Trump's ‘Nazi propaganda’  —  Former Rep. Liz Cheney (R-Wyo.) ripped Republican National Committee (RNC) Chair Ronna McDaniel for dodging questions Sunday about former President Trump's “vermin” comments, which Cheney described as “Nazi propaganda.”",
    "url": "https://thehill.com/blogs/blog-briefing-room/4307011-liz-cheney-rnc-chair-mcdaniel-collaborating-trump-nazi-propaganda/"
  },
  {
    "text": "South Carolina Sen. Tim Scott abruptly ends 2024 presidential bid, shocking even his campaign staff  —  Republican presidential candidate Tim Scott abruptly announced late Sunday that he was dropping out of the 2024 race, a development that surprised his donors and stunned his campaign staff … ",
    "url": "https://apnews.com/article/tim-scott-drops-out-2024-race-b9cc8fbeba57a123789d8d0484164e38"
  },
  {
    "text": "Stephen Miller's “America First Legal” is more dangerous than you think  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please consider signing up.  Just click the button below.  —  Click for Public Notice free trial",
    "url": "https://www.publicnotice.co/p/stephen-miller-america-first-legal-explained"
  },
  {
    "text": "Sinema left the Democratic Party.  Democratic donors left her too.  —  A POLITICO analysis of campaign finance data reveals a tough road ahead if the Arizona independent runs for reelection.  —  Democratic donors have fled Sen. Kyrsten Sinema since she left the party … ",
    "url": "https://www.politico.com/news/2023/11/13/kyrsten-sinema-donors-democrats-00126676"
  },
  {
    "text": "‘QAnon Shaman’ who stormed the Capitol on Jan. 6 files paperwork to run for Congress  —  Jacob Chansley, who served about 27 months in prison for his role in the Capitol attack, filed to run for the seat left vacant by Rep. Debbie Lesko, R-Ariz.  —  Jacob Chansley, the Arizona man known as the … ",
    "url": "https://www.nbcnews.com/politics/2024-election/qanon-shaman-stormed-capitol-jan-6-files-paperwork-run-congress-rcna124858"
  },
  {
    "text": "Israel-Hamas war live updates: Al Shifa hospital in Gaza no longer functioning, WHO says … Just now  —  Erin McLaughlin  —  TEL AVIV — The situation at Al-Shifa hospital in Gaza is “extremely difficult and dangerous,” the head of neurosurgery at the hospital told NBC News this morning.",
    "url": "https://www.nbcnews.com/news/world/live-blog/israel-hamas-war-live-updates-rcna124850"
  }
]