[
  {
    "text": "FL CFO Backs Bill to Use Tax Dollars to Pay for Trump's Legal Defense  —  This is just gross.  —  Florida's Chief Financial Officer Jimmy Patronis announced today that he is supporting State Senator Ileana Garcia's bill SB 1740 to create a “Florida Freedom Fighter's Fund” … ",
    "url": "https://www.meidastouch.com/news/fl-cfo-backs-bill-to-use-tax-dollars-to-pay-for-trumps-legal-defense"
  },
  {
    "text": "Trump's Campaign of Humiliation Against Ron DeSantis  —  The former president's brutal, yearlong campaign of humiliation helped torpedo the Florida governor's White House hopes and left his next moves in politics uncertain.  —  Donald J. Trump plumbed new depths of degradation in his savage takedown … ",
    "url": "https://www.nytimes.com/2024/01/22/us/politics/desantis-trump-humiliation.html"
  },
  {
    "text": "The gamble Republicans are about to take on Trump  —  In a little more than 24 hours, New Hampshire Republican primary voters could effectively bring the 2024 nominating contest to a close.  —  Nikki Haley now has Donald Trump in the one-on-one race she had hoped for, but she trails in every poll in the state.",
    "url": "https://www.washingtonpost.com/politics/2024/01/22/trump-gamble-republicans/"
  },
  {
    "text": "Donald Trump has a big problem ahead  —  A whole swath of GOP voters appears firmly committed to not voting for Trump in November.  —  Donald Trump has a problem no matter what happens in New Hampshire on Tuesday night: There's a whole swath of the Republican electorate and a good chunk … ",
    "url": "https://www.politico.com/news/2024/01/23/trump-moderate-republicans-problem-00137112"
  },
  {
    "text": "Trump Maintains Advantage  —  Haley picks up independent support but does not close gap  —  West Long Branch, NJ - A smaller field and an increase in the number of independents who plan to vote in New Hampshire's Republican primary have boosted Nikki Haley's standing there.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_nh_012224/"
  },
  {
    "text": "New Hampshire investigating fake Biden robocall meant to discourage voters ahead of primary  —  The New Hampshire attorney general's office on Monday said it was investigating reports of an apparent robocall that used artificial intelligence to mimic President Joe Biden's voice and discourage voters … ",
    "url": "https://apnews.com/article/new-hampshire-primary-biden-ai-deepfake-robocall-f3469ceb6dd613079092287994663db5"
  },
  {
    "text": "U.S. Supreme Court says Texas can't block federal agents from the border  —  The high court's order effectively maintains long-running precedent that the federal government — not individual states — has authority to enforce border security.  —  The U.S. Supreme Court on Monday ordered Texas … ",
    "url": "https://www.texastribune.org/2024/01/22/texas-border-supreme-court-immigration/"
  },
  {
    "text": "The Fall of the House of Dead Bounce Ron  —  I wrote a few days ago that Ron DeSantis's long campaign collapse was likely the most ignominious and vertiginous in the presidential primary era, which dates in stages from the 1960s and early 1970s.  Some skeptics pointed to Jeb! in 2016 or Rudy Giuliani in 2008.",
    "url": "https://talkingpointsmemo.com/edblog/the-fall-of-the-house-of-dead-bounce-ron"
  },
  {
    "text": "US, British militaries team up again to bomb sites in Yemen used by Iran-backed Houthis  —  WASHINGTON (AP) — The U.S. and British militaries bombed multiple sites used by the Iranian-backed Houthis in Yemen on Monday night, the second time the two allies have conducted coordinated retaliatory strikes … ",
    "url": "https://apnews.com/article/us-british-strikes-houthi-yemen-4ca86a7c0f484fcdf9c386cd752c1878"
  },
  {
    "text": "The tide turns on Florida book bans  —  For years, Florida has been at the vanguard of removing books from school libraries.  Florida Republicans, including Governor Ron DeSantis (R), insisted that school librarians were seeking to “groom” children with pornographic materials.",
    "url": "https://popular.info/p/the-tide-turns-on-florida-book-bans"
  },
  {
    "text": "The Inside Story Of Barack Obama's 2024 Campaign Calculations  —  ‘Existential’ fears, a focus on young people, and a history of helping Biden behind the scenes  —  Barack Obama is worried about America in 2024.  —  This is an “all hands on deck moment,” a source close to former President Obama told TPM, describing his thinking.",
    "url": "https://talkingpointsmemo.com/news/barack-obama-joe-biden-2024"
  },
  {
    "text": "Scoop: Israel proposes 2-month fighting pause in Gaza for release of all hostages  —  Israel has given Hamas a proposal through Qatari and Egyptian mediators that includes up to two months of a pause in the fighting as part of a multi-phase deal that would include the release … ",
    "url": "https://www.axios.com/2024/01/22/israel-hamas-gaza-ceasefire-hostages"
  },
  {
    "text": "Fetterman's break from the left excites Republicans  —  The Pennsylvania Democrat is straying from liberal orthodoxy on the border and Israel, giving GOP colleagues hope that he might keep surprising them.  —  Republicans once slammed John Fetterman as a “radical socialist” who was “too dangerous” to get elected.",
    "url": "https://www.politico.com/news/2024/01/23/republicans-john-fetterman-00136343"
  },
  {
    "text": "Norman Jewison, acclaimed director of ‘In the Heat of the Night’ and ‘Moonstruck,’ dead at 97  —  Norman Jewison, the acclaimed and versatile Canadian-born director whose Hollywood films ranged from Doris Day comedies and “Moonstruck” to such social dramas as the Oscar-winning “In the Heat of the Night,” has died at age 97.",
    "url": "https://apnews.com/article/norman-jewison-dead-abd93f2b671b416aabdd83829822e14a"
  },
  {
    "text": "Republicans Push To Legalize ‘Property Owners’ Killing Homeless People in Kentucky  —  In Kentucky, politicians are preparing to vote on a law that would authorize the use of force against unhoused people who are found to be camping on private property.  —  Republican politicians in Kentucky … ",
    "url": "https://www.vice.com/en/article/jg54mg/republicans-push-to-legalize-property-owners-killing-homeless-people-in-kentucky"
  },
  {
    "text": "Appeals Court Revives Mexico's Lawsuit Against Gunmakers  —  The decision, which is likely to be appealed, is one of the most significant setbacks for the gun industry since passage of a federal law that provided immunity from some lawsuits.  —  A federal appeals panel in Boston ruled … ",
    "url": "https://www.nytimes.com/2024/01/22/us/politics/appeals-court-mexico-lawsuit-gunmakers.html"
  },
  {
    "text": "Ethics Ratings of Nearly All Professions Down in U.S.  —  WASHINGTON, D.C. — Americans' ratings of nearly all 23 professions measured in Gallup's 2023 Honesty and Ethics poll are lower than they have been in recent years.  Only one profession — labor union leaders — has not declined since 2019 … ",
    "url": "https://news.gallup.com/poll/608903/ethics-ratings-nearly-professions-down.aspx"
  },
  {
    "text": "Ron DeSantis Spent More Than $53 Million To Win 23,420 Votes In Iowa  —  It's a conservative estimate that doesn't take into account what DeSantis spent in the final weeks of his campaign.  —  Ron DeSantis ran for president for less than nine months before ending his campaign following the Iowa caucuses … ",
    "url": "https://www.huffpost.com/entry/ron-desantis-iowa-spending_n_65ae97b1e4b0928ae79bfccd"
  },
  {
    "text": "Message from Chancellor King  —  On Sunday, Jan. 21, at around 5:40 p.m., UW-Whitewater police received reports of four people outside of Knilans residence hall chanting racist words, lighting what appeared to be road flares and displaying antisemitic symbols.  —  Police quickly responded to the scene.",
    "url": "https://announcements.uww.edu/Announcement/Details/18308"
  },
  {
    "text": "‘The Right Kind of Crazy’: Matt Gaetz Makes MAGA World Swoon  —  MANCHESTER, New Hamphire — Standing inside a makeshift office, a crowd of red hat-wearing MAGA acolytes in front of him and a massive mural of piercing-eyes Donald Trump on the wall behind, Matt Gaetz comfortably took questions … ",
    "url": "https://www.politico.com/news/magazine/2024/01/22/maga-movement-heir-matt-gaetz-00136968"
  }
]