[
  {
    "text": "Ex-Chief of Staff Mark Meadows granted immunity, tells special counsel he warned Trump about 2020 claims: Sources  —  Meadows said Trump was “dishonest” on election night, according to sources.  —  Former President Donald Trump's final chief of staff in the White House, Mark Meadows … ",
    "url": "https://abcnews.go.com/US/chief-staff-mark-meadows-granted-immunity-tells-special/story?id=104231281"
  },
  {
    "text": "Cautions on ABC's Huge Mark Meadows Scoop  —  For more than six months, access journalists in DC have been trying to confirm how much Mark Meadows cooperated with Jack Smith.  —  Today, ABC has a huge scoop reporting that Meadows testified at least three times, one time — before a grand jury — with immunity.",
    "url": "https://www.emptywheel.net/2023/10/24/cautions-on-abcs-huge-mark-meadows-scoop/"
  },
  {
    "text": "Cohen Denounces Trump During Courtroom Face-Off  —  Michael D. Cohen accused his onetime boss, Donald J. Trump, of manipulating his net worth as Mr. Trump stared blankly ahead.  It was their first interaction in five years.  —  For five years, Michael D. Cohen has waged battle with Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/10/24/nyregion/trump-michael-cohen-fraud-trial.html"
  },
  {
    "text": "‘I killed him’: How Trump torpedoed Tom Emmer's speaker bid  —  Just when the congressman thought he had neutralized Trump, the former president lowered the boom.  —  Just hours after Rep. Tom Emmer (R-Minn.) won the Republican Conference's nomination to be Speaker on Tuesday … ",
    "url": "https://www.politico.com/news/2023/10/24/i-killed-him-how-trump-torpedoed-tom-emmers-speaker-bid-00123329"
  },
  {
    "text": "Mark Meadows Flipped, And People Are Imagining How Trump Will React  —  Many social media psychics predict Trump won't be happy to learn his former chief of staff is working with the DOJ.  And he'll probably have amnesia.  —  LOADING  —  After the news broke that Mark Meadows … ",
    "url": "https://www.huffpost.com/entry/social-media-trump-mark-meadows_n_65384501e4b011a9cf7b8b84"
  },
  {
    "text": "Trump rages as former acolytes turn against him under legal heat  —  Donald Trump's wealth, power and fame acted like a magnet for new associates keen to enter his orbit.  But now, key figures who sought a share of his reflected glory are turning against him to save themselves.",
    "url": "https://www.cnn.com/2023/10/25/politics/trump-former-aides-turn-against-him/"
  },
  {
    "text": "Emmer bid collapses, extending extraordinary GOP Speaker losing streak  —  House Majority Whip Tom Emmer's (R-Minn.) Speakership nomination collapsed in extraordinary fashion Tuesday, surviving only four hours and showcasing the complete chaos enveloping the House GOP conference.",
    "url": "https://thehill.com/homenews/house/4273184-tom-emmer-drops-out-speakers-race/"
  },
  {
    "text": "Another Day of G.O.P. Chaos Winds Up With Speaker Nominee No. 4  —  House Republicans turned on themselves as they immolated yet another of their leaders in the bonfires of the speaker fight.  Then they chose their next nominee.  —  It was clear from the start that House Republicans … ",
    "url": "https://www.nytimes.com/2023/10/25/us/politics/house-republicans-speaker.html"
  },
  {
    "text": "House GOP gives Mike Johnson Speaker nod after whirlwind Emmer dropout  —  House Republicans nominated Rep. Mike Johnson (R-La.) for Speaker Tuesday evening, making him the fourth GOP lawmaker to win the conference's nod — and its second nominee within a day after House Majority Whip Tom Emmer … ",
    "url": "https://thehill.com/homenews/house/4273648-mike-johnson-wins-fourth-speaker-nomination/"
  },
  {
    "text": "Florida orders universities to ‘deactivate’ pro-Palestinian group  —  TALLAHASSEE, Fla. — Florida's university system chancellor, responding to a push by Gov. Ron DeSantis, directed state universities Tuesday to disband campus groups with ties to the national Students for Justice in Palestine organization … ",
    "url": "https://www.politico.com/news/2023/10/24/florida-orders-universities-to-deactivate-pro-palestinian-group-00123350"
  },
  {
    "text": "MAGA Diehards Are Furious Jenna Ellis Pleaded Guilty After Raising $200K  —  Jenna Ellis raised more than $216,000 to fight her Georgia RICO indictment ... then accepted a plea deal  —  Jenna Ellis smiled in her mugshot.  The former Trump attorney who was indicted alongside him and 17 others … ",
    "url": "https://www.rollingstone.com/politics/politics-news/jenna-ellis-draws-maga-ire-pleading-guilty-fundraising-1234861064/"
  },
  {
    "text": "McCarthy floats partnership with Jim Jordan as assistant speaker  —  Amid the impasse, McCarthy is floating a plan that would reinstall him as speaker and make Jordan, a conservative Trump ally, the assistant speaker, according to three sources familiar with McCarthy's pitch.",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/house-republicans-choose-new-speaker-nominee-live-updates-rcna121674/rcrd22879?canonicalCard=true"
  },
  {
    "text": "Drone attacks on American bases injured two dozen U.S. military personnel  —  The groups conducting the attacks are supported by Iran and its Islamic Revolutionary Guard Corps, a Pentagon spokesman said.  —  Two dozen American military personnel were wounded last week in a series of drone attacks … ",
    "url": "https://www.nbcnews.com/politics/national-security/drone-attacks-american-bases-injured-two-dozen-us-military-personnel-rcna121961"
  },
  {
    "text": "China's Xi Meets California Governor Newsom in Beijing  — Californian also has meeting with Foreign Minister Wang Yi  — Newsom wants state to drive green partnerships with China  —  Chinese President Xi Jinping sat down with California's Gavin Newsom, the first time the leader … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-25/china-s-xi-meets-california-governor-gavin-newsom-in-beijing"
  },
  {
    "text": "A Close Look at Some Key Evidence in the Gaza Hospital Blast  —  A widely cited missile video does not shed light on what happened, a Times analysis concludes.  —  The video shows a projectile streaking through the darkened skies over Gaza and exploding in the air.  Seconds later, another explosion is seen on the ground.",
    "url": "https://www.nytimes.com/2023/10/24/world/middleeast/gaza-hospital-israel-hamas-video.html"
  },
  {
    "text": "White House press secretary says she misheard question on antisemitism during briefing  —  “As I have footstomped many times from the podium and on the air, antisemitism is an abomination that this President has fought against his entire life; and I feel strongly about that work,” Jean-Pierre told POLITICO in a statement.",
    "url": "https://www.politico.com/news/2023/10/24/white-house-press-secretary-antisemitism-question-00123246"
  },
  {
    "text": "Biden Will Not Be on New Hampshire Primary Ballot  —  The president's campaign said he would follow rules set by the Democratic National Committee, which has sparred with New Hampshire Democrats over the state's primary date  —  President Joe Biden's re-election campaign informed the chair … ",
    "url": "https://themessenger.com/politics/biden-will-not-be-on-new-hampshire-primary-ballot"
  },
  {
    "text": "White House holds staff meetings on Israel-Hamas war  —  With help from Nahal Toosi and Joseph Gedeon  —  The Israel-Hamas war isn't just testing the limits of U.S. foreign policy.  It's taxing the personal capacities of U.S. officials struggling with the violent scenes coming out of the Middle East.",
    "url": "https://www.politico.com/newsletters/national-security-daily/2023/10/24/white-house-holds-staff-meetings-on-israel-hamas-war-00123148"
  }
]