[
  {
    "text": "Playbook: Slumping GOP field makes case for consolidation  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  THE LATEST IN ISRAEL — “Israel strikes Gaza, Syria and West Bank as war against Hamas threatens to ignite other fronts,” by AP's Najib Jobain, Samy Magdy and Ravi Nessman",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/22/slumping-gop-field-makes-case-for-consolidation-00122912"
  },
  {
    "text": "One GOP candidate can defeat Trump.  Clear the field for Haley.  —  Donald Trump won the GOP nomination in 2016 not because he was the choice of most Republican primary voters; he was not.  He won because, in a crowded field, he got more votes than any of his rivals in South Carolina, and then in later-voting states.",
    "url": "https://www.postandcourier.com/opinion/editorials/editorial-one-gop-candidate-can-defeat-trump-clear-the-field-for-haley/article_f805cfde-6d00-11ee-a8e9-f7d028b02e2a.html"
  },
  {
    "text": "'I'm disappointed': Even Tim Scott's friends and fans see a campaign on the ropes  —  Scott's polling is down, his super PAC is in retreat and his hometown newspaper is cheering on Nikki Haley instead.  —  Tim Scott's old friend and former colleague in the Senate, Cory Gardner, kept pleading with him to get on TV more.",
    "url": "https://www.politico.com/news/2023/10/22/tim-scott-disappointed-campaign-00122896"
  },
  {
    "text": "A President, a Billionaire and Questions About Access and National Security  —  Anthony Pratt, one of Australia's wealthiest men, made his way into Donald Trump's inner circle with money and flattery.  What he heard there has become of interest to federal prosecutors.",
    "url": "https://www.nytimes.com/2023/10/22/us/politics/anthony-pratt-donald-trump.html"
  },
  {
    "text": "More Bad News for Trump  —  It turns out it wasn't just a bad day for Trump, as I captioned my column Thursday night.  It was a bad week.  A really bad week.  —  After Sidney Powell's guilty plea, there was Kenneth Chesebro's plea.  His was to a felony charge of filing false information … ",
    "url": "https://joycevance.substack.com/p/more-bad-news-for-trump"
  },
  {
    "text": "Meet the Republicans Running for Speaker  —  The lawmakers vying for the job include veterans of the House, committee chairmen, a top member of Republican leadership and a sophomore.  —  At least 10 Republicans have announced that they will run for speaker or that they are considering doing so since Friday … ",
    "url": "https://www.nytimes.com/2023/10/22/us/politics/meet-the-republicans-running-for-speaker.html"
  },
  {
    "text": "Statement From Secretary of Defense Lloyd J. Austin III on Steps to Increase Force Posture  —  Following detailed discussions with President Biden on recent escalations by Iran and its proxy forces across the Middle East Region, today I directed a series of additional steps to further strengthen … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3564874/statement-from-secretary-of-defense-lloyd-j-austin-iii-on-steps-to-increase-for/"
  },
  {
    "text": "Detroit synagogue president Samantha Woll found dead outside her home  —  A politically connected Detroit synagogue president was found stabbed dead this morning outside her home in the city's Lafayette Park neighborhood, east of downtown.  —  Samantha Woll, 40, led the Isaac Agree Downtown Detroit Synagogue … ",
    "url": "https://www.freep.com/story/news/local/michigan/detroit/2023/10/21/samantha-woll-dead-isaac-agree-downtown-detroit-synagogue-president/71271616007/"
  },
  {
    "text": "US is ‘concerned about potential escalation’ in Middle East amid Israel-Hamas war: Austin  —  The Pentagon announced the deployment of more military resources to the region.  —  The U.S. is “concerned” that fighting between Israel and Hamas, in the wake of Hamas' Oct. 7 terror attack … ",
    "url": "https://abcnews.go.com/Politics/us-concerned-potential-escalation-middle-east-amid-israel/story?id=104197650"
  },
  {
    "text": "Israel strikes Gaza, Syria and West Bank as war against Hamas threatens to ignite other fronts  —  (Oct. 21) (AP Video by Hasan Slayeh and Imad Issied)  —  First aid trucks enter Gaza from Egypt  —  Crowds march worldwide over Gaza airstrikes  —  Israeli warplanes struck targets across Gaza overnight … ",
    "url": "https://apnews.com/article/israel-palestinian-gaza-war-syria-lebanon-916edd66e3af095d49e5ba1c59d90c2a"
  },
  {
    "text": "Full McCarthy: I don't need the speakership 'title.  I'm going to help in any way I can'  —  Former House Speaker Kevin McCarthy (R-Calif.) joins Meet the Press in an exclusive interview to discuss House Republicans' speaker fight and the war in Israel.",
    "url": "https://www.nbcnews.com/meet-the-press/video/full-mccarthy-i-don-t-need-the-speakership-title-i-m-going-to-help-in-any-way-i-can-196158021829"
  },
  {
    "text": "Documents found on fighters reveal Hamas capabilities, bloody plans  —  ASHKELON, Israel — A Hamas field manual obtained by The Washington Post and other documents found in the wake of the group's brutal attack on Israel two weeks ago illustrate some of its military capabilities and preparations for close-in, bloody killing.",
    "url": "https://www.washingtonpost.com/world/2023/10/21/hamas-documents-plans-israel-attack/"
  },
  {
    "text": "Transcript: Senate Minority Leader Mitch McConnell on “Face the Nation,” Oct. 22, 2023  —  The following is a transcript of an interview with Senate Majority Leader Mitch McConnell that aired on Oct. 22, 2023.  —  MARGARET BRENNAN: Senate Republican leader Mitch McConnell has not done … ",
    "url": "https://www.cbsnews.com/news/mitch-mcconnell-senate-minority-leader-face-the-nation-transcript-10-22-2023/"
  },
  {
    "text": "Split-screen: Biden speaks to the world, Republicans can't pick a speaker  —  The contrast between the two political parties was especially striking as Biden responded to the Israel-Gaza war and House Republicans failed to pick a leader  —  Rarely is the contrast between the leadership … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/21/biden-israel-republican-speaker-analysis/"
  }
]