[
  {
    "text": "Trump not trying to crash market with tariffs, says White House economic advisor … A crashing stock market is not part of an intentional strategy by President Donald Trump, White House National Economic Council director Kevin Hassett told ABC's “This Week” on Sunday.",
    "url": "https://www.cnbc.com/2025/04/06/kevin-hassett-stock-market-crash-not-part-of-trumps-strategy.html"
  },
  {
    "text": "Trump administration to markets: Don't expect a rescue  —  If there was one consistent message from Trump administration economic officials Sunday morning, it was this: We're not worried about the stock market plunging, and the cavalry isn't coming to save you from tariffs, either.",
    "url": "https://www.axios.com/2025/04/06/trump-tariffs-stock-market"
  },
  {
    "text": "Second measles death reported in Texas  —  Health Secretary Robert F. Kennedy Jr. is expected to attend the child's funeral, which is scheduled for Sunday.  —  Another child with measles in Texas has died, the Department of Health and Human Services confirmed late Saturday night, though the exact cause of death is under investigation.",
    "url": "https://www.nbcnews.com/health/health-news/second-measles-death-texas-child-kennedy-rcna199882"
  },
  {
    "text": "Second child dies of measles in Texas, media reports  —  A second child with measles has died in Texas as hundreds of cases of the infectious disease have been recorded in recent weeks, prompting U.S. Health Secretary Robert F. Kennedy Jr. to visit the state, media outlets reported on Sunday.",
    "url": "https://www.reuters.com/world/us/kennedy-travel-texas-after-second-measles-related-death-axios-reports-2025-04-06/"
  },
  {
    "text": "A Second Child Dies of Measles in Texas  —  It is the second confirmed measles death in the U.S. in a decade.  If the outbreak continues at the current pace, the nation may lose its “elimination” status.  —  3 MIN READ  —  How Measles Attacks an Unvaccinated Child  —  ADVERTISEMENT  —  Got a Tip?",
    "url": "https://www.nytimes.com/2025/04/06/health/measles-death-texas.html?unlocked_article_code=1.9k4.-axm.xQubqLRVFw0Z&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "DOJ suspends attorney who said Maryland man's deportation was a mistake  —  A federal judge on Sunday slammed the government over its “grievous error” in wrongly deporting a Salvadorian national and refused to lift her order demanding he be returned to the U.S.",
    "url": "https://www.axios.com/2025/04/06/deportation-mistake-doj-salvadorian-man"
  },
  {
    "text": "DOJ places attorney on leave after struggling in Maryland migrant case  —  Pam Bondi said DOJ lawyers must “zealously advocate” for the administration.  —  Attorney General Pam Bondi speaks at a news conference at the Justice Department, Feb. 12, 2025, in Washington.",
    "url": "https://abcnews.go.com/Politics/doj-places-attorney-leave-after-struggling-maryland-migrant/story?id=120526466"
  },
  {
    "text": "Amid anti-DEI push, National Park Service rewrites history of Underground Railroad  —  Since Trump took office, the park service — an agency charged with preserving American history — has changed how its website describes key moments from slavery to Jim Crow",
    "url": "https://www.washingtonpost.com/investigations/2025/04/06/national-park-service-underground-railroad-history-slavery/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzOTEyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1Mjk0Mzk5LCJpYXQiOjE3NDM5MTIwMDAsImp0aSI6IjRiMzYzMGM3LWY4YmQtNGM3NS05MjNjLTUwNzI4ZjNkMWQwYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI1LzA0LzA2L25hdGlvbmFsLXBhcmstc2VydmljZS11bmRlcmdyb3VuZC1yYWlscm9hZC1oaXN0b3J5LXNsYXZlcnkvIn0.NJeQgDttIclC-I8x1pFhlSfDIelzBtZ-mbICWqiPn68&itid=gfta"
  },
  {
    "text": "Exclusive: how the Atlantic's Jeffrey Goldberg got added to the White House Signal group chat  —  Internal investigation cleared the national security adviser Mike Waltz, but the mistake was months in the making  —  Donald Trump's national security adviser Mike Waltz included a journalist … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/06/signal-group-chat-leak-how-it-happened"
  },
  {
    "text": "Doge's attack on social security causing ‘complete, utter chaos’, staff says  —  Understaffed agency sent into ‘death spiral’ as employees warn Musk-led cuts will lead to structural collapse  —  Office closures, staffing and service cuts, and policy changes at the Social Security Administration … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/06/musk-doge-social-security"
  },
  {
    "text": "‘Hands Off!’ protesters across US rally against President Donald Trump and Elon Musk  —  Millions of people took part in protests against President Donald Trump and Elon Musk across all 50 states and globally on Saturday, organized by a pro-democracy movement in response to what they call a … ",
    "url": "https://cnn.com/2025/04/05/us/hands-off-protests-trump-musk"
  },
  {
    "text": "Elon Musk appears to break with Trump admin on tariffs — as he slams Peter Navarro and says he wants ‘zero tariff situation’ with Europe  —  Elon Musk appeared to split from the Trump administration on tariffs overnight — as he lashed out at trade adviser Peter Navarro and said he hoped for a … ",
    "url": "https://nypost.com/2025/04/06/us-news/elon-musk-appears-to-break-with-trump-admin-on-tariffs-slams-peter-navarro/"
  },
  {
    "text": "Defending America's Security through Visa and Travel Restrictions on South Sudan  —  It is time for the Transitional Government of South Sudan to stop taking advantage of the United States.  Enforcing our nation's immigration laws is critically important to the national security and public safety of the United States.",
    "url": "https://www.state.gov/defending-americas-security-through-visa-and-travel-restrictions-on-south-sudan/"
  },
  {
    "text": "Treasury Sec. Bessent says 'there doesn't have to be a recession': Full interview  —  Treasury Sec. Scott Bessent exclusively joins Meet the Press days after President Donald Trump unveiled expansive tariffs on the United States' largest trading partners.",
    "url": "https://www.nbcnews.com/meet-the-press/video/treasury-sec-bessent-says-there-doesn-t-have-to-be-a-recession-full-interview-236654149913"
  },
  {
    "text": "Younger Democrats want to force an uncomfortable conversation about age  —  Many complain the party is dominated by an older generation of leaders who have lost touch with Americans' day-to-day struggles.  —  Just now  —  LOS ANGELES — Democrat Saikat Chakrabarti decided to challenge … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/06/young-democrats-age-leadership/"
  },
  {
    "text": "GOP Rep: Adversaries are “laughing at us” over NSA firings  —  Rep. Don Bacon (R-Neb.) slammed the decision to fire Gen. Timothy Haugh, the National Security Agency director and head of U.S. Cyber Command, without any explanation as “heartbreaking” Sunday.  —  The big picture: Haugh … ",
    "url": "https://www.axios.com/2025/04/06/nsc-nsa-firings-loomer"
  },
  {
    "text": "Starmer vows to ‘shelter British business from the storm’ of US tariffs  —  British prime minister promises to “turbocharge” plans to improve the U.K.'s competitiveness this week.  —  U.K. Prime Minister Keir Starmer said his government is ready to use industrial policy to mitigate the impact … ",
    "url": "https://www.politico.eu/article/uks-starmer-vows-to-shelter-businesses-from-tariff-storm/"
  },
  {
    "text": "Trump tariffs based on massive error, conservative think tank says  —  The formula used by the Trump administration to levy reciprocal tariffs contains a serious math error that over-inflates the impact by about a factor of four, economists at the American Enterprise Institute said.",
    "url": "https://www.axios.com/2025/04/06/trump-tariffs-error-aei"
  },
  {
    "text": "The Cabinet Secretary Who Wants His Cookies Freshly Baked  —  Interior Secretary Doug Burgum likes chocolate-chip cookies—preferably freshly baked and still warm.  —  This peculiar fact became the talk of the Department of Interior in recent weeks after his chief of staff, JoDee Hanson … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/burgum-cookies/682319/"
  },
  {
    "text": "James Carville Reveals New Way to Shame Trump ‘Collaborators’  —  HALL OF SHAME  —  The Democratic strategist warned that history won't be kind to those complicit in the president's “anti-patriotic” power grab.  —  James Carville has had enough.  —  On the latest episode of his Poltiicon podcast … ",
    "url": "https://www.thedailybeast.com/james-carville-reveals-new-way-to-shame-trump-collaborators/"
  },
  {
    "text": "France suggests targeting Big Tech's data use in response to US tariffs  —  French Economy and Finance Minister Eric Lombard has suggested striking back against U.S. President Donald Trump's tariffs broadside by more strictly regulating U.S. Big Tech's use of data.",
    "url": "https://www.politico.eu/article/france-suggest-to-regulate-data-in-response-to-trump-tariffs/"
  }
]