[
  {
    "text": "Trump suing ex-MI6 officer who alleged he was ‘compromised’ by Russian security service  —  Christopher Steele's dossier also alleged Putin ‘supported and directed’ plan to ‘cultivate’ Trump as a presidential candidate  —  Donald Trump is suing a former MI6 officer and the intelligence consultancy … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/28/trump-suing-ex-mi6-officer-who-alleged-he-was-compromised-by-russian-security-service"
  },
  {
    "text": "BREAKING: Trump will not seek to move Fulton case to federal court  —  X  —  In a surprise move, former President Donald Trump has decided not to seek to move his criminal trial from Fulton County to federal court, his lawyer said Thursday.  —  In a two-page notice filed in Fulton County … ",
    "url": "https://www.ajc.com/news/breaking-trump-will-not-seek-to-move-fulton-case-to-federal-court/B64PLR4I5ZCK3JQRSPLJMOSAIE/"
  },
  {
    "text": "Trump is on the witness list for $250 million civil fraud trial starting next week  —  The former president's two adult sons — Don Jr. and Eric — were also named as witnesses by New York Attorney General Letitia James and Trump's attorneys.  —  Donald Trump and his sons Don Jr. and Eric … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-witness-list-250-million-civil-fraud-trial-starting-week-rcna117958"
  },
  {
    "text": "Appeals Court Rejects Trump's Effort to Delay Trial in Fraud Case  —  Former President Donald J. Trump had sued the judge presiding over his case, Arthur F. Engoron, aiming to pause a trial that will likely begin as soon as Monday.  —  Donald J. Trump's civil fraud trial over accusations … ",
    "url": "https://www.nytimes.com/2023/09/28/nyregion/trump-fraud-judge-appeal.html"
  },
  {
    "text": "Trump $250M fraud trial will go forward Monday, AG plans to call his adult sons as witnesses  —  A New York appellate court has denied Trump's motion to delay the trial.  —  The First Judicial Department Appellate Division of the New York State Supreme Court has denied Donald Trump's motion … ",
    "url": "https://abcnews.go.com/US/new-york-ag-plans-call-trump-adult-sons/story?id=103565222"
  },
  {
    "text": "Hard-liners plot to replace McCarthy with a deputy as shutdown looms  —  A contingent of far-right House Republicans are plotting an attempt to remove Kevin McCarthy as House speaker as early as next week, a move that would throw the chamber into further disarray in the middle … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/28/kevin-mccarthy-tom-emmer-government-shutdown-motion-vacate/"
  },
  {
    "text": "Why a shutdown is looking inevitable  —  Presented by With assists from POLITICO's Congress team  —  TICK TOCK: The government will shut down in three days if Congress can't pass a funding patch.  —  FURLOUGH, SWEET CHARIOT  —  If you're a federal worker who doesn't know what the future holds … ",
    "url": "https://www.politico.com/newsletters/huddle/2023/09/28/why-a-shutdown-is-looking-inevitable-00118939"
  },
  {
    "text": "Menendez plans Puerto Rico donor retreat amid Democratic fears over his reelection plans  —  He may be facing bribery charges and calls for his resignation from more than half of his Senate Democratic colleagues.  But donors can still hit the links and dine with Sen. Bob Menendez at a luxurious beachside hotel - for a price.",
    "url": "https://www.cnn.com/2023/09/28/politics/menendez-puerto-rico-donor-retreat/"
  },
  {
    "text": "Alarmed Republicans are preparing to draft Glenn Youngkin  —  Robert Costa is the chief election and campaign correspondent for CBS News.  —  Some of the biggest Republican donors in the country will converge next month at the historic Cavalier Hotel in Virginia Beach for a two-day meeting to rally behind Gov. Glenn Youngkin.",
    "url": "https://www.washingtonpost.com/opinions/2023/09/28/draft-glenn-youngkin-2024-gop-donors/"
  },
  {
    "text": "‘Botched this bad’: Insiders say GOPers furious at James Comer for his handling of impeachment inquiry  —  WASHINGTON — Republicans are growing more and more frustrated with the House Oversight Committee's impeachment hearing, with some beginning to admit it has been a failure.",
    "url": "https://www.rawstory.com/republicans-furious-biden-impeachment-flop/"
  },
  {
    "text": "First Impeachment Hearing Yields No New Information on Biden  —  In a chaotic session, Republicans accused the president of crime and corruption, but even their witnesses said the case for impeachment hadn't been made.  —  The first hearing in House Republicans' impeachment inquiry … ",
    "url": "https://www.nytimes.com/2023/09/28/us/politics/biden-impeachment-hearing.html"
  },
  {
    "text": "Second Republican primary debate had the lowest TV viewership since 2015  —  Wednesday's debate had the lowest TV viewership of any Republican presidential debate since 2015.  —  When it comes to debates, the question of ratings is usually little more than a curiosity.",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/second-republican-primary-debate-lowest-tv-viewership-2015-rcna117955"
  },
  {
    "text": "Viewership Fell Sharply for Second G.O.P. Debate  —  Fewer than 10 million people watched the Republican presidential candidates on Wednesday, according to preliminary data from Nielsen.  —  Fewer than 10 million people watched the Republican presidential debate on Wednesday night … ",
    "url": "https://www.nytimes.com/2023/09/28/business/media/republican-debate-ratings.html"
  },
  {
    "text": "Kari Lake and Pro-DeSantis ‘Reporter’ Get Into Screaming Match at GOP Debate  —  Before the candidates hit the debate stage Wednesday, there was another debate between Kari Lake and pro-Ron DeSantis reporter Chris Nelson.  —  When an ardently pro-Ron DeSantis “journalist” … ",
    "url": "https://www.thedailybeast.com/kari-lake-and-pro-desantis-reporter-chris-nelson-get-into-screaming-match-at-gop-debate"
  },
  {
    "text": "The biggest loser of last night's debate was ...  ... not any of the seven candidates on the stage.  It wasn't even one of the candidates who weren't on the stage — Donald Trump, Asa Hutchinson, and an assortment of also rans.  The biggest loser of the debate was Fox Business Channel, with the RNC that arranged it a close runner-up.",
    "url": "https://hotair.com/ed-morrissey/2023/09/28/the-biggest-loser-of-last-nights-debate-was-n581045"
  },
  {
    "text": "Ojai, CA Becomes First U.S. City To Recognize Legal Rights Of Elephants  —  Ordinance gives elephants the right to liberty in Ojai  —  The Ojai City Council voted 4-1 on Wednesday to recognize the legal rights of elephants, becoming the first city in the United States to give legal rights to a non-human animal.",
    "url": "https://californiaglobe.com/fr/ojai-ca-becomes-first-u-s-city-to-recognize-legal-rights-of-elephants/"
  },
  {
    "text": "Thousands of cantaloupes sold in 19 states recalled due to potential salmonella contamination  —  Thousands of whole cantaloupes sold in 19 states and Washington, D.C., have been recalled due to potential salmonella contamination, the Food and Drug Administration announced.",
    "url": "https://www.cbsnews.com/news/fda-recalls-cantaloupes-salmonella-contamination/"
  },
  {
    "text": "Peter Daou's Theory of Election Interference—by Democrats  —  The former Clinton aide, now running the third-party Presidential campaign of Cornel West, on his recent political awakening.  —  Peter Daou, a former aide to Hillary Clinton, recently announced that he had become the campaign manager … ",
    "url": "https://www.newyorker.com/news/q-and-a/peter-daous-theory-of-election-interference-by-democrats"
  },
  {
    "text": "Peruvian National Arrested In Peru For Sending Over 150 Hoax Bomb Threats To Schools And Other Institutions In The United States And Soliciting Child Pornography  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Eddie Manuel Nunez Santos Allegedly … ",
    "url": "https://www.justice.gov/usao-sdny/pr/peruvian-national-arrested-peru-sending-over-150-hoax-bomb-threats-schools-and-other"
  },
  {
    "text": "Exclusive: DHS investigating whether floor plans and other security information were exposed in ransomware attack on contractor  —  Senior Department of Homeland Security officials are working to determine if a ransomware attack on government contractor Johnson Controls International … ",
    "url": "https://www.cnn.com/2023/09/28/politics/dhs-investigating-ransomware-attack/"
  },
  {
    "text": "Teary-eyed influencer ‘Meatball’ who livestreamed Philadelphia looting mayhem is charged with 6 felonies  —  The Philadelphia social media influencer arrested while she livestreamed Tuesday night's looting mayhem fought back tears as she was charged with six felonies.",
    "url": "https://nypost.com/2023/09/28/philadelphia-influencer-meatball-livestreamed-lootings-charged-with-6-felonies/"
  }
]