[
  {
    "text": "Trump Floats the Idea of Executing Joint Chiefs Chairman Milley  —  The former president is inciting violence against the nation's top general.  America's response is distracted and numb.  —  Late Friday night, the former president of the United States—and a leading candidate to be the next president … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/09/trump-milley-execution-incitement-violence/675435/"
  },
  {
    "text": "Trump Tells Gun Store He'd Like to Buy a Glock, Raising Legal Questions  —  Officials have increasingly voiced concerns about threats of violence related to the former president's trials, as he faces charges that would make it illegal for a store to sell him a firearm.",
    "url": "https://www.nytimes.com/2023/09/25/us/politics/trump-glock-gun-south-carolina.html"
  },
  {
    "text": "Trump pledges to investigate MSNBC parent company for ‘threatening treason’  —  Former President Trump pledged to investigate Comcast, the parent company for NBC and MSNBC, if he is elected in 2024, saying it “will be thoroughly scrutinized for their knowingly dishonest and corrupt coverage of people, things, and events.”",
    "url": "https://thehill.com/homenews/4221310-trump-pledges-to-investigate-msnbc-parent-for-threatening-treason/"
  },
  {
    "text": "Trump Georgia election juror names to be kept secret until trial ends, judge rules  — The identities of the Georgia jurors who will hear the election interference trial against former President Donald Trump will be kept secret until the end of the trial, a judge ordered.",
    "url": "https://www.cnbc.com/2023/09/25/trump-georgia-election-jurors-names-to-be-kept-secret-at-trial.html"
  },
  {
    "text": "Inside the courtroom of Trump's D.C. judge  —  Judge Tanya Chutkan's first trial since the former president's indictment offers insight into how she'll handle the case.  —  U.S. District Court Judge Tanya Chutkan is poised to preside over a historic trial that will feature a defendant unlike … ",
    "url": "https://www.politico.com/news/2023/09/25/trump-judge-tanya-chutkan-courtroom-00118054"
  },
  {
    "text": "Georgia judge orders jurors' identities to stay secret during Trump election interference trial  —  Fulton County District Attorney Fani Willis had requested an order that would put limitations on revealing jurors' names and likenesses during any trial in the case.",
    "url": "https://www.nbcnews.com/politics/donald-trump/georgia-judge-orders-jurors-identities-stay-secret-trump-trial-rcna117283"
  },
  {
    "text": "History Offers Democrats a Way Out of the Menendez Problem  —  Oddly enough, it involves the very same seat the New Jersey senator refuses to resign.  —  Senator Robert Menendez had a bad week.  —  A New Jersey Democrat currently serving his third full term in the Senate … ",
    "url": "https://www.politico.com/news/magazine/2023/09/25/history-dept-bob-menendez-democrats-00117935"
  },
  {
    "text": "Fetterman Plans to Give Back Menendez Donation In Cash-Filled Envelopes (Exclusive)  —  Fetterman is the only Senate Democrat to call on Menendez to resign after a federal bribery indictment  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/fetterman-plans-to-give-back-menendez-donation-in-cash-filled-envelopes-exclusive"
  },
  {
    "text": "Second Senate Democrat calls for Menendez resignation  —  Sen. Sherrod Brown (D-Ohio) on Monday became the second Senate Democrat to call on Sen. Bob Menendez (D-N.J.) to resign after he was indicted on federal bribery charges late last week.  —  “Senator Menendez has broken the public trust … ",
    "url": "https://thehill.com/homenews/senate/4222340-second-senate-democrat-calls-for-menendez-resignation/"
  },
  {
    "text": "Asa Hutchinson misses out as seven candidates qualify for second GOP debate  —  Former President Donald Trump is skipping another debate, while Hutchinson is the only candidate who made the first debate to miss the second one.  —  Former Arkansas Gov. Asa Hutchinson fell short of qualifying … ",
    "url": "https://www.nbcnews.com/politics/2024-election/who-qualified-second-republican-debate-participants-rcna111370"
  },
  {
    "text": "Here's who made the second Republican presidential debate  —  Seven candidates made the cut, but former President Donald Trump is counterprogramming another of the Republican National Committee's marquee events.  —  The stage is set for the second GOP presidential primary debate … ",
    "url": "https://www.politico.com/news/2023/09/25/rnc-announces-candidates-for-another-trump-less-debate-00118087"
  },
  {
    "text": "Fox News Announces a Newsom and DeSantis Debate in November  —  It's highly unusual for governors who are not running for the same office to debate, but the two have clashed repeatedly as they seek national attention.  —  Fox News announced on Monday that it was hosting a debate … ",
    "url": "https://www.nytimes.com/2023/09/25/us/politics/newsom-desantis-debate.html"
  },
  {
    "text": "Biden suggests Americans should ‘stop electing’ House Republicans if they shut down government  —  President Biden on Monday bashed House Republicans for heading towards a government shutdown, saying that they shouldn't be elected if they can't do their job to fund the government.",
    "url": "https://thehill.com/homenews/administration/4222325-biden-suggests-americans-should-stop-electing-house-republicans-if-they-shut-down-government/"
  },
  {
    "text": "Majority of Americans continue to favor moving away from Electoral College  —  How we did this  —  The Electoral College has played an outsize role in some recent U.S. elections.  And a majority of Americans would welcome a change to the way presidents are elected, according to a new Pew Research Center survey.",
    "url": "https://www.pewresearch.org/short-reads/2023/09/25/majority-of-americans-continue-to-favor-moving-away-from-electoral-college/"
  },
  {
    "text": "Barreling toward shutdown, McCarthy scrambles to get even one spending win  —  The speaker's latest plan is to advance four spending bills on Tuesday.  But it's unclear that he has the votes.  And it still won't keep the government open.",
    "url": "https://www.politico.com/live-updates/2023/09/25/congress/mccarthys-career-deciding-week-00118006"
  },
  {
    "text": "‘Missing witness’ in Biden corruption probe offers dirt on Hunter FBI ‘mole’ who tipped him off  —  Gal Luft, the fugitive “missing witness” of the Biden corruption investigation, has offered new evidence to the House impeachment inquiry about an FBI mole who tipped off Hunter Biden … ",
    "url": "https://nypost.com/2023/09/25/offering-dirt-on-hunter-bidens-fbi-mole/"
  },
  {
    "text": "Speaker ignores pressure to resign after tribute to veteran who fought for Nazis  —  Trudeau calls incident during Zelenskyy visit ‘deeply embarrassing’ for Canada.  —  OTTAWA, Ont.  — Demands for a resignation over a stunning scandal.  Embarrassment for Canada and Ukraine.  A public relations win for Russia.",
    "url": "https://www.politico.com/news/2023/09/25/canada-veteran-nazi-ukraine-00118056"
  },
  {
    "text": "8 hospitalized after ‘sudden severe turbulence’ on Florida-bound flight  —  FORT LAUDERDALE, Fla. (WFLA) — Eight people were hospitalized Monday after being injured during rough skies on a flight to Florida.  —  Passengers and crew aboard the JetBlue flight experienced “sudden severe turbulence” … ",
    "url": "https://thehill.com/policy/transportation/4222399-8-hospitalized-after-sudden-severe-turbulence-on-florida-bound-flight/"
  }
]