[
  {
    "text": "Trump eying Fox News host Jeanine Pirro for top prosecutor in DC  —  Pirro, if chosen, would be interim U.S. attorney for the District of Columbia.  —  Judge Jeanine Pirro speaks following an exclusive interview with Daniel Penny for FOX Nation, Dec. 10, 2024, in New York.",
    "url": "https://abcnews.go.com/US/trump-eying-fox-news-host-jeanine-pirro-top/story?id=121604820"
  },
  {
    "text": "Trump names Jeanine Pirro interim US attorney for DC  —  President Donald Trump announced Thursday he's appointing Fox News host and former prosecutor Jeanine Pirro the interim US attorney for Washington, DC, after his first pick faced what appeared to be insurmountable pushback from Republicans on Capitol Hill.",
    "url": "https://cnn.com/2025/05/08/politics/jeanine-pirro-trump-acting-dc-prosecutor"
  },
  {
    "text": "Live updates: Robert Prevost of the United States is named Pope Leo XIV  —  EDITED BY  CURTIS YEE, KATARINA KRATOVAC AND MICHAEL WARREN  —  Cardinal Robert Prevost has taken the name Leo XIV.  The Chicago-born missionary who spent his career ministering in Peru and took over the Vatican's powerful office … ",
    "url": "https://apnews.com/live/conclave-pope-catholic-church-updates-5-8-2025"
  },
  {
    "text": "MAGA Melts Down Over New Pope's Anti-Trump, Pro-Immigrant Social Media  —  Robert Prevost, now known as Pope Leo XIV, has been critical of the president and his actions  —  Catholics have a new Pope, and for the first time in the church's history, it's an American.",
    "url": "https://www.rollingstone.com/politics/politics-news/new-pope-robert-prevost-social-media-maga-meltdown-1235334802/"
  },
  {
    "text": "President Trump fires Librarian of Congress Carla Hayden  —  President Donald Trump abruptly fired Librarian of Congress Carla Hayden on Thursday as the White House continues to purge the federal government of those perceived to oppose the president and his agenda.",
    "url": "https://apnews.com/article/donald-trump-library-of-congress-carla-hayden-20a1862ce6d2e0d51a84a37b264ce2ef"
  },
  {
    "text": "Trump Administration Fires Librarian of Congress  —  Dr. Carla D. Hayden was the first African American and the first woman to serve as the head of the Library of Congress.  Her firing drew a furious response from Democrats.  —  The Trump administration fired the librarian of Congress … ",
    "url": "https://www.nytimes.com/2025/05/08/us/politics/trump-librarian-congress-carla-hayden.html"
  },
  {
    "text": "Venerable New York Firm That Struck a Deal With Trump Is Losing Lawyers  —  Cadwalader avoided a punitive executive order but the accord has left the firm in turmoil  —  Cadwalader, Wickersham & Taft struck a deal with President Trump last month intended to secure the future of New York's oldest law firm.",
    "url": "https://www.wsj.com/us-news/law/venerable-new-york-firm-that-struck-a-deal-with-trump-is-losing-lawyers-10a87928"
  },
  {
    "text": "Fired FEMA chief threatened to quit weeks ago  —  Cameron Hamilton, the acting disaster chief, appeared to contradict Homeland Security Secretary Kristi Noem by defending the agency on Wednesday.  —  The head of the Federal Emergency Management Agency was fired Thursday morning and replaced … ",
    "url": "https://www.politico.com/news/2025/05/08/fema-chief-fired-cameron-hamilton-00335840"
  },
  {
    "text": "Trump's Justice Department launches criminal probe into Letitia James, multiple sources say  —  More than a year after New York Attorney General Letitia James won a half-billion dollar civil fraud case against President Trump, the Justice Department under Mr. Trump has launched … ",
    "url": "https://www.cbsnews.com/news/letitia-james-criminal-fraud-probe-sources-trump-justice-department/"
  },
  {
    "text": "Trump's New Surgeon General Pick Wants to “Raise the Vibration of Humanity”  —  “The future of medicine will be about light,” said Casey Means.  “I don't exactly know how.”  —  On Wednesday, following controversy about inconsistencies in her résumé, President Trump withdrew … ",
    "url": "https://www.motherjones.com/politics/2025/05/casey-means-surgeon-general/"
  },
  {
    "text": "A Subpoena for the White House?  —  On April 16, I wrote to you about a hearing in the Kilmar Abrego Garcia case, which is before U.S. District Judge Paula Xinis in Maryland.  At that time, she characterized the steps the government had taken to facilitate his return to the U.S. following … ",
    "url": "https://joycevance.substack.com/p/a-subpoena-for-the-white-house"
  },
  {
    "text": "SPJ views proposed VOA/OAN deal as affront to sidelined USAGM journalists  —  CONTACT:  —  Emily Bloch, SPJ National President, [email protected]  —  Dan Kubiske, SPJ International Community Co-Chair, [email protected]  —  Kim Tsuyuki, SPJ Communications Specialist, [email protected]",
    "url": "https://www.spj.org/spj-views-proposed-voa-oan-deal-as-affront-to-sidelined-usagm-journalists/"
  },
  {
    "text": "Jewish feud over Trump escalates with open letter in The New York Times  —  Dozens of former leaders say the organizations they once led are being ‘far too silent’  —  More than three dozen former leaders of major Jewish organizations published an open letter in The New York Times rebuking current leadership … ",
    "url": "https://forward.com/fast-forward/718834/american-jewish-leadership-donald-trump/"
  },
  {
    "text": "Wild: House bill would strip courts of contempt enforcement power  —  In the ongoing public discussion about whether the courts will try to rein in the Trump administration's lawlessness, or will prevail in a resulting showdown if they do, the story that follows has been simmering below the surface for a couple of weeks.",
    "url": "https://walterolson.substack.com/p/wild-house-bill-would-strip-courts"
  },
  {
    "text": "DHS Secretary Flouts SCOTUS Order, Says ‘No Scenario’ Where Abrego Garcia Comes Back  —  Kristi Noem said the deported Maryland man “will not be coming back” despite a court order, a claim that one Democratic senator called “incredibly chilling.”  —  WASHINGTON — Homeland Security Secretary Kristi Noem … ",
    "url": "https://www.huffpost.com/entry/kristi-noem-supreme-court-order-kilmar-abrego-garcia_n_681cd152e4b0a178bbffc98e"
  },
  {
    "text": "Robert Prevost was ‘the pride and joy of every priest and nun’ at St. Mary's on Chicago's South Side  —  Catholics across the region celebrated the historic announcement Thursday that the first American pope in the 2,000-year history of the church was born and raised in the Chicago area … ",
    "url": "https://www.chicagotribune.com/2025/05/08/robert-prevost-chicago-pope-xiv/?share=ecto0xit5c28pgouttpv"
  },
  {
    "text": "X restricts access to jailed Istanbul mayor's account under court order but challenges decision  —  The X social media platform has blocked access to jailed Istanbul mayor Ekrem Imamoglu's X social media account in Turkey, complying with a Turkish court order",
    "url": "https://www.ajc.com/news/nation-world/x-restricts-access-to-jailed-istanbul-mayors-account-under-court-order-but-challenges-decision/DAQUMZGCTJHF5AHBGMDJ7PAXQQ/"
  },
  {
    "text": "They don't need a warrant  —  (This piece will be sent out in the next edition of the newsletter tomorrow.)  —  Help pay for our independent reporting if you can.  —  Support independent media  —  I'm driving five miles across the city to check out a tip that there's an ICE rendition ongoing.",
    "url": "https://www.welcometohellworld.com/they-dont-need-a-warrant/"
  },
  {
    "text": "Lee Bill Establishes Obscenity Definition Across States  —  WASHINGTON - U.S. Senator Mike Lee (R-UT) introduced the Interstate Obscenity Definition Act today to clarify the legal definition of “obscenity” for all states, making the transmission of obscene content across state lines more easily prosecuted.",
    "url": "https://www.lee.senate.gov/2025/5/lee-bill-establishes-obscenity-definition-across-states"
  },
  {
    "text": "US Customs and Border Protection Quietly Revokes Protections for Pregnant Women and Infants  —  CBP's acting commissioner has rescinded four Biden-era policies that aimed to protect vulnerable people in the agency's custody, including mothers, infants, and the elderly.",
    "url": "https://www.wired.com/story/cbp-rescinds-policies-on-care-of-pregnant-women-infants/"
  },
  {
    "text": "A Day in the Live-Streamed Life of Donald Trump  —  America's TV-obsessed President has made his rambling Oval Office press gaggles the signature of his second term—chaotic, self-aggrandizing, random, and frequently nasty.  —  In Donald Trump's first term, he reinvented many things about how the job of President was done.",
    "url": "https://www.newyorker.com/news/letter-from-trumps-washington/a-day-in-the-live-streamed-life-of-donald-trump"
  },
  {
    "text": "Scoop: Kemp plans secret White House sortie for Georgia Senate pick  —  Georgia Gov. Brian Kemp is planning a White House sitdown with President Trump to get on the same page for supporting the best Republican candidate in the swing state's 2026 Senate race, sources tell Axios.",
    "url": "https://www.axios.com/2025/05/09/kemp-trump-white-house-georgia-senate"
  },
  {
    "text": "Harvard Leaders See Only Bad Outcomes Ahead as They Battle Trump  —  Harvard could choose to either keep fighting or seek a deal with the administration.  Its leaders are starting to realize that any path will very likely change the identity of the school.  —  Harvard University became … ",
    "url": "https://www.nytimes.com/2025/05/08/us/harvard-trump-court-case-negotiation.html"
  },
  {
    "text": "Workday gets contract from US agency behind DOGE staff cuts, no other bids  —  The federal human resources agency at the heart of billionaire Trump advisor Elon Musk's efforts to slash the federal workforce has awarded a contract for a new cloud-based HR platform to Workday (WDAY.O) … ",
    "url": "https://www.reuters.com/world/us/workday-gets-contract-us-agency-behind-doges-staff-cuts-without-competitive-2025-05-08/"
  },
  {
    "text": "Key New York Republicans reject ‘insulting’ offer on ‘SALT’ tax break  —  Their stance further complicates the task for House GOP leaders as they try to advance a massive bill for Trump's agenda through the tax-writing committee next week.  —  WASHINGTON — Four New York Republicans issued … ",
    "url": "https://www.nbcnews.com/politics/congress/new-york-republicans-reject-insulting-offer-salt-tax-break-rcna205729?taid=681d53a5b2ef730001b900ea"
  },
  {
    "text": "First Afrikaners granted refugee status due to arrive in U.S.  —  JOHANNESBURG, South Africa — The U.S. government has officially granted 54 Afrikaans South Africans, white descendants of mainly Dutch colonizers, refugee status and they are expected to land in the U.S. on Monday May 12 … ",
    "url": "https://www.npr.org/2025/05/09/nx-s1-5391815/first-afrikaners-granted-refugee-status-due-to-arrive-in-u-s"
  },
  {
    "text": "Alabama ‘purposely’ diluted Black votes with congressional plan, court finds  —  A federal court ruled Thursday that Alabama engaged in intentional discrimination when it refused to draw a congressional plan with a second Black majority district after courts, including the Supreme Court … ",
    "url": "https://cnn.com/2025/05/08/politics/alabama-congressional-plan-court-ruling"
  },
  {
    "text": "Our Reporters' Notes on the May 7 Hearing in the J.G.G. Case  —  The judge seemed receptive to a class action on behalf of aliens sent to CECOT under President Trump's Alien Enemies Act proclamation.  —  annabower.bsky.social  —  rparloff.bsky.social  —  Meet The Authors",
    "url": "https://www.lawfaremedia.org/article/our-reporters--notes-on-the-may-7-hearing-in-the-j.g.g.-case"
  },
  {
    "text": "Poland and France commit to helping each other in case of military threat  —  Poland and France will sign a treaty on Friday in which they will commit to helping each other in the event of a military threat, Polish Prime Minister Donald Tusk said.  —  The treaty will be signed amid security concerns … ",
    "url": "https://www.reuters.com/world/europe/poland-france-commit-helping-each-other-case-military-threat-2025-05-09/"
  },
  {
    "text": "RFK Jr. says autism database will use Medicare and Medicaid info  —  The National Institutes of Health will use information from federal health insurance programs Medicare and Medicaid to create a “real-world data platform” to determine the cause of autism, the agency announced this week.",
    "url": "https://www.npr.org/2025/05/08/nx-s1-5391310/kennedy-autism-registry-database-hhs-nih-medicare-medicaid"
  }
]