[
  {
    "text": "U.S. oil production hit a record under Biden.  He seldom mentions it.  —  The politics of oil are particularly tricky for Democrats, whose chances for victory in next year's elections can hinge on whether young, climate-focused voters come out in big numbers.",
    "url": "https://www.washingtonpost.com/politics/2023/12/31/us-oil-production-has-hit-record-under-biden-he-hardly-mentions-it/"
  },
  {
    "text": "Playbook: The 3 unpredictable factors shaping 2024  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  It's finally here: the last day of a long, wild year in politics.  And now, we can all look forward to a very quiet, calm year that could (1) … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/31/the-3-unpredictable-factors-shaping-2024-00133360"
  },
  {
    "text": "Led by Trump, GOP candidates take polarizing stances on race and history  —  The party's three leading candidates are speaking about history and race in polarizing and provocative ways that sometimes diverge from or distort the facts, some political strategists, experts and civil rights leaders said",
    "url": "https://www.washingtonpost.com/elections/2023/12/30/trump-desantis-haley-race-slavery/"
  },
  {
    "text": "Nikki Haley says pardoning Trump is in the country's ‘best interest’  —  Haley has often been accused of flip-flopping when it comes to Trump.  Her comments about pardoning him have opened her up to further criticism.  —  On the heels of a very bad week for Nikki Haley … ",
    "url": "https://www.msnbc.com/top-stories/latest/nikki-haley-trump-pardon-rcna131580"
  },
  {
    "text": "Former Trump White House insiders call possible 2nd term a threat to American democracy  —  “We don't need to speculate,” one told “This Week” co-anchor Jonathan Karl.  —  ABC's Jonathan Karl interviews Sarah Matthews, left, Cassidy Hutchinson, center, and Alyssa Farah Griffin, Dec. 15, 2023, in Washington.",
    "url": "https://abcnews.go.com/Politics/former-trump-white-house-insiders-call-2nd-term/story?id=105998679"
  },
  {
    "text": "Graham backtracks on earlier Jan. 6 criticism of Trump: ‘It depends on what the conduct is’  —  Sen. Lindsey Graham (R-S.C.) on Sunday appeared to backtrack on earlier criticism of former President Trump's actions on Jan. 6 and suggested, instead, that his presidential immunity defense was … ",
    "url": "https://thehill.com/homenews/senate/4383307-graham-backtracks-on-earlier-jan-6-criticism-of-trump-it-depends-on-what-the-conduct-is/"
  },
  {
    "text": "Jack Smith: Trump Immunity Bid a ‘License’ to Commit Crimes  —  He warns in a new filing that Trump's bid to shield himself from criminal liability “threatens the democratic and constitutional foundation of our Republic.”  —  Special counsel Jack Smith warned in a new filing Saturday … ",
    "url": "https://www.thedailybeast.com/jack-smith-warns-donald-trumps-immunity-claim-could-license-presidents-to-commit-crimes"
  },
  {
    "text": "Controversial Middle Tennessee Lewis Country Store set for January sale, official confirms  —  Nashville's notorious Lewis Country Store — known for its southern hospitality and controversial political ties — will soon change owners.  —  The North Nashville gas station and marketplace … ",
    "url": "https://www.tennessean.com/story/news/2023/12/29/nashville-notorious-lewis-country-store-set-for-january-sale/72061325007/"
  },
  {
    "text": "The 14th Amendment is the ‘most democratic’ disqualifier, Jamie Raskin says  —  The Maryland Democrat said it is the only disqualifier over which the person has control.  —  The constitutional amendment that election officials in Colorado and Maine are relying on to block former President Donald Trump … ",
    "url": "https://www.politico.com/news/2023/12/31/14th-amendment-jamie-raskin-democratic-disqualifier-00133366"
  },
  {
    "text": "The EU should support Ireland's bold move to regulate Big Tech  —  Dublin, Ireland, was stunned a month ago by riots that transformed its downtown into chaos, the worst rioting in decades, stemming from far-right online rumors about an attack on children. ",
    "url": "https://thehill.com/opinion/technology/4380369-the-eu-should-support-irelands-bold-move-to-regulate-big-tech/"
  },
  {
    "text": "Frustrated Dem Maverick Joe Lieberman Stumps for ‘No Labels’ Third Option to Political Parties  —  'I've never seen this much anger at the two major parties,' he said  —  Former Sen. Joe Lieberman continues to insist there's no time like the present to ditch both political parties' candidates and seriously consider another option.",
    "url": "https://themessenger.com/politics/frustrated-dem-maverick-joe-lieberman-stumps-for-no-labels-third-option-to-political-parties"
  },
  {
    "text": "Bankrupt ex-Mayor Rudy Giuliani regrets not having a NYC pension  —  Former Mayor Rudy Giuliani, who filed for bankruptcy in the wake of a $148 million civil court ruling and faces a mountain of unpaid legal bills, said he now regrets not having the safety net of a government pension.",
    "url": "https://nypost.com/2023/12/30/metro/bankrupt-rudy-giuliani-regrets-not-having-nyc-pension/"
  },
  {
    "text": "Maine secretary of state targeted with ‘swatting call’ after ruling Trump ineligible for ballot  —  The incident happened just a day after Bellows, a Democrat, ruled former President Donald Trump is constitutionally ineligible to appear on the state's primary ballot next year.",
    "url": "https://www.nbcnews.com/politics/2024-election/maine-secretary-state-targeted-swatting-call-ruling-trump-ineligible-b-rcna131711"
  },
  {
    "text": "DOJ declines to prosecute additional charges against Sam Bankman-Fried, instead focusing on sentencing in first trial  —  said Friday that they will not pursue a second trial against disgraced FTX founder Sam Bankman-Fried.  —  In November, a jury found Bankman-Fried guilty of seven criminal counts … ",
    "url": "https://www.washingtonexaminer.com/news/doj-declines-prosecute-sbf-additional-charges"
  }
]