[
  {
    "text": "A “Delicate Matter”: Clarence Thomas' Private Complaints About Money Sparked Fears He Would Resign  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship with real estate tycoon Harlan Crow … ",
    "url": "https://www.propublica.org/article/clarence-thomas-money-complaints-sparked-resignation-fears-scotus"
  },
  {
    "text": "Clarence Thomas was deep in debt when he hinted to a GOP lawmaker that he'd quit if he didn't get a pay raise: report  — Justice Clarence Thomas pushed a House Republican in 2000 to get justices a pay rise, a report says.  — ProPublica quoted Thomas telling the lawmaker that … ",
    "url": "https://www.businessinsider.com/clarence-thomas-pay-raise-justices-ethics-cliff-stearns-2023-12"
  },
  {
    "text": "Priests can bless same-sex unions, pope says  —  Pope Francis on Monday formally authorized priests to bless same-sex unions, marking a significant change from the Vatican's longstanding position on alternate blessings for gay couples.  —  The Vatican's announcement follows a letter released … ",
    "url": "https://thehill.com/homenews/4365531-catholic-priests-bless-same-sex-unions-pope/"
  },
  {
    "text": "Pope approves blessings for same-sex couples if they don't resemble marriage  —  Pope Francis has formally approved allowing priests to bless same-sex couples, with a new document explaining a radical change in Vatican policy by insisting that people seeking God's love and mercy shouldn't be subject to … ",
    "url": "https://apnews.com/article/vatican-lgbtq-pope-bfa5b71fa79055626e362936e739d1d8"
  },
  {
    "text": "Pope Francis Allows Priests to Bless Same-Sex Relationships  —  A church official said the blessings amounted to “a real development” that nevertheless did not amend “the traditional doctrine of the Church about marriage.”  —  Pope Francis has taken one of the most concrete steps in his efforts … ",
    "url": "https://www.nytimes.com/2023/12/18/world/europe/pope-gay-lesbian-same-sex-blessing.html"
  },
  {
    "text": "Trump's rhetoric in final campaign sprint goes to new dark extremes  —  Donald Trump's rhetoric dropped to a spine-tingling new low this weekend with less than a month before the Iowa caucuses.  —  The GOP primary front-runner said migrants are “poisoning the blood” of the US … ",
    "url": "https://www.cnn.com/2023/12/18/politics/trump-campaign-rhetoric-new-extremes/"
  },
  {
    "text": "Biden said to be increasingly frustrated by dismal poll numbers  —  In one recent meeting he said poll numbers were unacceptably low and he wanted to know what his team and his campaign were doing about it  —  The night before President Biden departed Washington to celebrate Thanksgiving on Nantucket … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/18/joe-biden-polls-campaign/"
  },
  {
    "text": "Biden unharmed after car strikes president's motorcade in Delaware  —  It was not immediately clear why the sedan smashed into an SUV that was part of the motorcade.  The driver was surrounded by agents who had their guns drawn.  —  A sedan smacked into a Secret Service vehicle that was part … ",
    "url": "https://www.nbcnews.com/politics/politics-news/biden-unharmed-car-strikes-presidents-motorcade-delaware-rcna130189"
  },
  {
    "text": "President's Rating Hits Record Low  —  Biden gets especially poor marks on inflation and immigration; few Americans say he is paying enough attention to their concerns  —  West Long Branch, NJ - President Joe Biden's job rating has hit an all-time low in the Monmouth (\"Mon-muth\") … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_US_121823/"
  },
  {
    "text": "Conservatives move to keep abortion off the 2024 ballot  —  “We don't believe those rights should be subjected to majority vote.”  —  Conservatives are testing new tactics to keep abortion off the ballot following a series of high-profile defeats.  —  In Arizona, Florida, Nevada and other states … ",
    "url": "https://www.politico.com/news/2023/12/18/first-rule-of-the-anti-abortion-playbook-dont-let-the-public-vote-on-abortion-00132049"
  },
  {
    "text": "Southwest's $140M penalty ‘should put all airlines on notice’ after travel debacle  —  Last year's travel mess left 16,900 flights canceled and more than two million passengers stranded.  —  The Transportation Department is slapping Southwest Airlines with the largest consumer protection penalty … ",
    "url": "https://www.politico.com/news/2023/12/18/southwest-airlines-fine-2022-transportation-00132222"
  },
  {
    "text": "No Labels Is Pushing a Lie That Will Elect Trump  —  There's no path to victory for a third-party candidate.  —  With a rematch between President Joe Biden and Donald Trump almost set in stone, it's time to put a farce to rest: The notion that a third-party candidate could actually win the presidency in 2024.",
    "url": "https://www.politico.com/news/magazine/2023/12/18/third-party-2024-no-labels-00132066"
  },
  {
    "text": "Biden's daughter owes thousands in income taxes, lien documents show  —  Read this article for free!  —  Plus get unlimited access to thousands of articles, videos and more with your free account!  —  FIRST ON FOX: Ashley Biden, President Biden's daughter, owes $5,000 in income taxes beginning in 2015 … ",
    "url": "https://www.foxnews.com/politics/ashley-biden-owes-thousands-taxes-lien-documents-show?intcmp=tw_fnc"
  },
  {
    "text": "Scoop: Crypto leaders build colossal $78 million war chest for 2024  —  Cryptocurrency industry leaders have poured $78 million into super PACs aimed at bolstering and growing the ranks of crypto-friendly lawmakers on Capitol Hill, Axios has learned. … - Crypto-focused super PAC Fairshake … ",
    "url": "https://www.axios.com/2023/12/18/crypto-super-pac-fairshake-2024-elections"
  },
  {
    "text": "Florida Republican Party suspends chairman and demands his resignation amid rape investigation  —  TALLAHASSEE, Fla. (AP) — The Republican Party of Florida suspended Chairman Christian Ziegler and demanded his resignation during an emergency meeting Sunday, adding to calls by Gov. Ron DeSantis … ",
    "url": "https://apnews.com/article/christian-ziegler-rape-accusation-florida-republican-party-8d1cb7c6f2f3e009a88e47a735eacc4c"
  }
]