[
  {
    "text": "Jordan and the GOP find a new low point in speaker mess  —  There are few things Congress loves more than a short-term solution to a long-term problem — something to help it forestall difficult decisions and paper over divisions in hopes that, at some later date, these problems will magically disappear.",
    "url": "https://www.washingtonpost.com/politics/2023/10/19/jim-jordan-speaker-mchenry-speaker/"
  },
  {
    "text": "House GOP drowning as crisis reaches breaking point  —  It seems that every day without a speaker brings a new release of pent-up anger from Republicans who see no way out of their self-inflicted pain.  —  When Matt Gaetz stepped to the microphones during Thursday's three-hour private House GOP meeting … ",
    "url": "https://www.politico.com/news/2023/10/19/house-gop-speaker-mccarthy-gaetz-00122617"
  },
  {
    "text": "Behind the Curtain: Rattled U.S. government fears wars could spread … Never before have we talked to so many top government officials who, in private, are so worried about so many overseas conflicts at once. … But to sound a siren of clinical, clear-eyed realism: U.S. officials … ",
    "url": "https://www.axios.com/2023/10/20/biden-government-war-fears-israel-hamas"
  },
  {
    "text": "Remarks by President Biden on the United States' Response to Hamas's Terrorist Attacks Against Israel and Russia's Ongoing Brutal War Against Ukraine  —  THE PRESIDENT:  Good evening, my fellow Americans.  We're facing an inflection point in history — one of those moments where the decisions … ",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2023/10/20/remarks-by-president-biden-on-the-unites-states-response-to-hamass-terrorist-attacks-against-israel-and-russias-ongoing-brutal-war-against-ukraine/"
  },
  {
    "text": "It Turns Out Joe Biden Is Actually In Charge of the Biden Administration … The central Republican attack line on Joe Biden has always been that he is not in charge of his own administration.  “They're surrounded by vicious, smart people, radical left people, but they're very smart, and they're very vicious,” said Donald Trump.",
    "url": "https://nymag.com/intelligencer/2023/10/bidens-israel-policy-proves-hes-running-his-administration.html"
  },
  {
    "text": "October 2023 National Poll: Trump Making Inroads with Young Voters Against Biden, Maintains Majority Support in Republican Primary  —  Home Polls October 2023 National Poll: Trump Making Inroads with Young Voters Against Biden, Maintains Majority Support in Republican Primary",
    "url": "https://emersoncollegepolling.com/october-2023-national-poll-trump-making-inroads-with-young-voters-against-biden-maintains-majority-support-in-republican-primary/"
  },
  {
    "text": "Team Trump Never Dreamed Sidney Powell Would Flip on Them  —  She was the ultimate MAGA conspiracy theorist.  Then she got charged with being part of a criminal conspiracy, and her tune started to change  —  Sidney Powell was the wildest of MAGA diehards — someone who swore long past … ",
    "url": "https://www.rollingstone.com/politics/politics-features/team-trump-sidney-powell-flip-rico-fulton-county-1234858576/"
  },
  {
    "text": "Trump co-defendant Kenneth Chesebro rejected plea offer from Georgia prosecutors  —  The Trump campaign adviser turned down the offer last month, a source said.  Sidney Powell, who had been scheduled to stand trial with Chesebro, pleaded guilty on Thursday.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-co-defendant-kenneth-chesebro-rejected-plea-offer-georgia-prosec-rcna121325"
  },
  {
    "text": "Maryland circuit court judge killed in driveway of home, police say  —  Washington County Circuit Court Judge Andrew Wilkinson, 52, was found with apparent gunshot wounds and died at a hospital, authorities said.  —  A Maryland judge was found apparently shot in the driveway of his home Thursday evening and later died, officials say.",
    "url": "https://www.nbcnews.com/news/us-news/maryland-circuit-court-judge-killed-driveway-home-police-say-rcna121366"
  },
  {
    "text": "Jon Stewart's Show on Apple Is Ending  —  Mr. Stewart and Apple are parting ways because of creative differences over “The Problem,” people with knowledge of the decision said.  —  Jon Stewart's show on Apple's streaming service is abruptly coming to an end, according to several people … ",
    "url": "https://www.nytimes.com/2023/10/19/business/media/jon-stewart-the-problem-ends.html"
  },
  {
    "text": "U.S. watchdog: Verified X accounts are main source of misinformation about Israel-Hamas war  —  NewsGuard takes issue with the platform's Blue-Checked account verification process  —  Verified accounts on the social media platform X are responsible for spreading the bulk of misinformation … ",
    "url": "https://www.upi.com/Top_News/US/2023/10/20/NewsGuard-report-X-verified-accounts-spread-misinformation-Israel-Hamas-war/2601697796230/"
  },
  {
    "text": "Gallant sets out 3 phases of war; says after Hamas vanquished, Israel will seek new ‘security regime’ in Gaza  —  Defense Minister Yoav Gallant lays out Israel's war plans and objectives in the Gaza Strip, speaking at a Knesset Foreign Affairs and Defense Committee meeting in Tel Aviv.",
    "url": "https://www.timesofisrael.com/liveblog_entry/gallant-says-after-hamas-vanquished-israel-will-seek-new-security-regime-in-gaza/"
  },
  {
    "text": "White House to Congress: We want $106 billion for the wars and the border  —  The request was directed to Speaker Pro Tempore Patrick McHenry who is currently leading a House that remains frozen without a speaker.  —  The Biden administration asked Congress on Friday to approve … ",
    "url": "https://www.politico.com/news/2023/10/20/white-house-to-congress-we-want-106-billion-for-the-wars-and-the-border-00122704"
  },
  {
    "text": "Judge Won't Let Alex Jones Use Bankruptcy to Avoid Sandy Hook Damages  —  A Texas court ruling means the Infowars broadcaster must pay most of the $1.4 billion he owes Sandy Hook families, regardless of whether his business survives.  —  The judge in Alex Jones's bankruptcy case ruled … ",
    "url": "https://www.nytimes.com/2023/10/19/us/politics/alex-jones-sandy-hook.html"
  },
  {
    "text": "Elon Musk's X removes the New York Times' verification badge  —  The unexplained decision removes the only symbol distinguishing the news organization from impostors and comes amid a flood of false information related to the Israel-Gaza war, some of which Musk has personally endorsed.",
    "url": "https://www.washingtonpost.com/technology/2023/10/19/x-twitter-nyt-dispute-musk/"
  },
  {
    "text": "Israel war: What ‘cancel culture’ really means  —  America's college students seem confused.  —  Look, I'm willing to say that perhaps college was never really about higher education so much as it was about being on your own for the first time, confronted with the realities … ",
    "url": "https://www.washingtonexaminer.com/restoring-america/equality-not-elitism/israel-war-what-cancel-culture-really-means"
  },
  {
    "text": "Christie Challenges Trump: 'You'll Have to Face Me One Way or Another.  Get Ready'  —  Christie says Trump's secret service detail makes it a little more ‘complicated’ for him to face Trump … GOP presidential hopeful and former New Jersey Gov. Chris Christie is telling former President Donald Trump to … ",
    "url": "https://themessenger.com/politics/christie-challenges-trump-youll-have-to-face-me-one-way-or-another-get-ready"
  },
  {
    "text": "Rep. Derrick Van Orden leaves D.C. for fact-finding mission in Israel as House remains paralyzed  —  WASHINGTON - With the House paralyzed and Republicans unable to find a path to electing a leader, Wisconsin freshman Rep. Derrick Van Orden left Capitol Hill for Israel Thursday evening … ",
    "url": "https://www.jsonline.com/story/news/politics/2023/10/20/rep-derrick-van-orden-leaves-d-c-for-fact-finding-mission-in-israel/71243868007/"
  },
  {
    "text": "Sam Bankman-Fried, FTX allies secretly poured $50 million into ‘dark money’ groups, evidence shows  — Former crypto king Sam Bankman-Fried and his associates donated $50 million during the 2022 election cycle toward politically active nonprofit groups that don't disclose their donors.",
    "url": "https://www.cnbc.com/2023/10/20/sam-bankman-fried-ftx-allies-donated-millions-in-dark-money.html"
  },
  {
    "text": "Exclusive: US Army charges Private Travis King with desertion over dash into North Korea  —  The U.S. Army has charged Private Travis King with crimes ranging from desertion for running into North Korea in July to assault against fellow soldiers and solicitation of child pornography, according to documents obtained by Reuters.",
    "url": "https://www.reuters.com/world/us/us-army-charges-private-travis-king-with-desertion-over-dash-into-north-korea-2023-10-20/"
  },
  {
    "text": "Special counsel urges judge to deny Trump's Jan. 6 claim of immunity  —  ‘The defendant is not above the law,’ prosecutors say in opposing former president's bid to toss out federal 2020 election subversion prosecution  —  U.S. prosecutors urged a federal judge Thursday … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/10/19/special-counsel-rejects-trump-immunity-jan-6/"
  }
]