[
  {
    "text": "How Trump and Musk set off the shutdown crisis — but got little in return  —  The past week provides a preview of what spending battles could be like in a closely divided Congress and with warring GOP factions  —  Some time after Donald Trump won the Nov. 5 election, he told House Speaker Mike Johnson … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/21/trump-musk-shutdown-demands-defeat/"
  },
  {
    "text": "Trump signals plans to use all levers of power against the media  —  Press freedom advocates say they fear that the second Trump administration will ramp up pressure on journalists, in keeping with the president-elect's combative rhetoric.  —  For many years, Donald Trump repeatedly threatened … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/22/trump-abc-news-settlement-george-stephanopoulos/"
  },
  {
    "text": "Republicans averted a shutdown, yet showed boundaries of Trump's power  —  This week's events were a preview of the perils of governing that face Trump and Republicans in Congress, despite their narrow majorities.  —  It could have been worse.  In the end, Congress averted a government shutdown.",
    "url": "https://www.washingtonpost.com/politics/2024/12/22/trump-shutdown-crisis-analysis/"
  },
  {
    "text": "The Woody Johnson Republicans  —  This week's budget fiasco carries bad omens for governing in 2025.  —  Mike Johnson is still Speaker of the House, but this week Republicans have behaved as if the Speaker is another Johnson—as in Woody of the New York Jets.",
    "url": "https://www.wsj.com/opinion/mike-johnson-republicans-budget-congress-elon-musk-donald-trump-woody-johnson-2dc5a626"
  },
  {
    "text": "U.S. Super Hornet Shot Down Over Red Sea in Friendly Fire Incident; Aviators Safe  —  This post has been updated with additional information on the timing of the incident.  —  Two U.S. Navy aviators are safe after their two-seat F/A-18F Super Hornet was shot down by an American ship by mistake … ",
    "url": "https://news.usni.org/2024/12/21/u-s-super-hornet-shot-down-over-red-sea-in-friendly-fire-incident-aviators-safe"
  },
  {
    "text": "Two US Navy pilots shot down over Red Sea in apparent ‘friendly fire’ incident, US military says  —  Two U.S. Navy pilots were shot down Sunday over the Red Sea in an apparent “friendly fire” incident, the U.S military said, marking the most serious incident to threaten troops in over a year of America targeting Yemen's Houthi rebels.",
    "url": "https://apnews.com/article/mideast-wars-yemen-us-navy-pilots-houthi-95a792daae3b0120186bfc6c66e1b6fe"
  },
  {
    "text": "‘Missing’ GOP Congresswoman Not Seen For Six Months Finally Found Living at Dementia Care Home  —  A Republican Congresswoman who has been “missing” for the past six months has finally been found.  —  Rep. Kay Granger has served as the representative for Texas's 12th Congressional District since 1997.",
    "url": "https://wcbm.com/national-headline/missing-gop-congresswoman-not-seen-for-six-months-finally-found-living-at-dementia-care-home/"
  },
  {
    "text": "‘Missing’ GOP Congresswoman Kay Granger found living in Texas assisted living facility for dementia patients  —  A still sitting Texas Congresswoman has been missing votes in Washington because she's been living in a $4,000-a-month nursing home for the past six months.",
    "url": "https://www.dailymail.co.uk/news/article-14218017/missing-GOP-congresswoman-Kay-Granger-Texas-dementia-care-home.html"
  },
  {
    "text": "Japan to order Google to stop violating antitrust law: sources  —  Japan's competition watchdog plans to order U.S. IT giant Google to halt violations of the country's antitrust law, sources familiar with the matter said Sunday.  The watchdog suspects that Google has unfairly pressured … ",
    "url": "https://english.kyodonews.net/news/2024/12/b55256676ce9-urgent-japan-to-order-google-to-stop-violating-antitrust-law-sources.html"
  },
  {
    "text": "MAGA's Orban-esque Plan to Control What Universities Teach  —  Trump and Vance are already indicating they'll follow the Project 2025 blueprint to wage a pressure campaign on colleges.  —  While Republicans have long complained about the academy, Donald Trump, JD Vance and their MAGA followers … ",
    "url": "https://www.bloomberg.com/opinion/articles/2024-12-22/maga-and-project-2025-have-a-plan-to-remake-us-universities?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczNDg3MzIzNywiZXhwIjoxNzM1NDc4MDM3LCJhcnRpY2xlSWQiOiJTT1dDNDhUMEFGQjQwMCIsImJjb25uZWN0SWQiOiI5RDJCMDVGODdDMUU0MUU3OUJFNkE3MTEyQzJDNUE5NiJ9.xOXm6wCoPZcQR6WgG0oAKp1Me3ZMECcDvRlDU-7tKtw&leadSource=uverify%20wall"
  },
  {
    "text": "Trump: Panama will lose control of Canal if it continues to ‘rip-off’ US  —  President-elect Trump took issue with fees charged to use the Panama Canal, a vital shipping route, on Saturday night, claiming that he will demand oversight of the waterway be given back to the U.S. when he returns to office if it's not changed.",
    "url": "https://thehill.com/policy/international/5052505-trump-panama-canal-fees/"
  },
  {
    "text": "Trump Appoints ‘The Apprentice’ Producer as Special Envoy to Britain  —  Mark Burnett and President-elect Donald J. Trump had a long and successful collaboration that made Mr. Trump a household name.  —  President-elect Donald J. Trump has tapped Mark Burnett, the producer who helped turn … ",
    "url": "https://www.nytimes.com/2024/12/21/us/politics/mark-burnett-special-envoy.html"
  },
  {
    "text": "NYPD's top cop Jeffrey Maddrey abruptly resigns after allegedly demanding underling perform sexual favors — including ‘kiss his penis’ — in exchange for overtime  —  The NYPD's highest-ranking uniformed officer abruptly resigned late Friday night after The Post uncovered explosive allegations … ",
    "url": "https://nypost.com/2024/12/21/us-news/nypds-top-cop-jeffrey-maddrey-abruptly-resigns-after-allegedly-demanding-underling-perform-sexual-favors-in-exchange-for-overtime/"
  },
  {
    "text": "Lara Trump removes herself from Florida Senate sweepstakes  —  Lara Trump, who recently stepped down from her post as co-chair of the Republican National Committee, announced her decision Saturday evening in a social media post.  —  TALLAHASSEE, Florida — Lara Trump says she is taking … ",
    "url": "https://www.politico.com/news/2024/12/21/lara-trump-florida-senate-sweepstakes-00195819"
  },
  {
    "text": "Girl unresponsive 3 months after crash caused by suspect in Trump assassination attempt  —  WPTV spoke to Norka Pardo about her daughter's condition  —  ST. LUCIE COUNTY, Fla. — For the first time, we're hearing from the mother of the 6-year-old girl who was seriously hurt in a Martin County car crash in September.",
    "url": "https://www.wptv.com/news/treasure-coast/region-st-lucie-county/girl-unresponsive-3-months-after-crash-caused-by-suspect-in-trump-assassination-attempt"
  }
]