[
  {
    "text": "Biden attorneys are in talks with special counsel Robert Hur over terms to interview the president  —  Attorney General Merrick Garland appointed Hur to investigate Biden's handling of classified documents after his term as vice president ended.  —  WASHINGTON — Attorneys for President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-attorneys-negotiating-special-counsel-interview-terms-rcna99360"
  },
  {
    "text": "Biden world sees the making of a wider path to victory in 2024  —  The president's team is focused on the states that got him the White House.  But the issue of abortion has them dreaming of something bigger.  —  Joe Biden's team thinks his path to victory in 2024 could look an awful lot like it did in 2020.",
    "url": "https://www.politico.com/news/2023/08/11/biden-world-2024-election-abortion-00110775"
  },
  {
    "text": "Trump's Truth Social tipped FBI to man killed during arrest attempt for Biden threats  — The social media company owned by former President Donald Trump in March tipped off the FBI about threats made by a Utah man who was fatally shot Wednesday by FBI agents as they attempted to arrest him for threatening to kill President Joe Biden.",
    "url": "https://www.cnbc.com/2023/08/10/trumps-truth-social-tipped-fbi-to-man-killed-during-arrest-attempt-for-biden-threats.html"
  },
  {
    "text": "Former Trump attorney Michael Cohen considering NY congressional bid  —  Michael Cohen, who served as former President Trump's personal attorney, said in a new interview that he is considering a run for Congress.  —  Cohen told Semafor he is “interested” in running as a Democrat.",
    "url": "https://thehill.com/homenews/campaign/4148668-former-trump-attorney-michael-cohen-considering-ny-congressional-bid/"
  },
  {
    "text": "On hip-hop's 50th birthday, a legendary DJ eyes office  —  Eric B. & Rakim is one of the most influential groups in hip-hop history.  —  Rolling Stone ranked them the fifth greatest musical duo of all time, ahead of Sonny & Cher and Outkast.  They broke out in 1986 with their first single: “Eric B. is President.”",
    "url": "https://www.politico.com/newsletters/new-york-playbook/2023/08/11/hip-hop-50th-anniversary-eric-b-eyes-office-00110768"
  },
  {
    "text": "'They're Going to Shoot Someone:' Michigan Republicans Warn of Civil War at Pool Party Fundraiser for Fake Electors  —  An audio recording obtained by The Messenger highlights just how dire the Republicans charged in the 2020 election scheme - and the people around them - see their fight",
    "url": "https://themessenger.com/politics/michigan-republicans-fake-electors-civil-war-dana-nessel-matt-maddock"
  },
  {
    "text": "Conservative Case Emerges to Disqualify Trump for Role on Jan. 6  —  Two law professors active in the Federalist Society wrote that the original meaning of the 14th Amendment makes Donald Trump ineligible to hold government office.  —  Reporting from Washington",
    "url": "https://www.nytimes.com/2023/08/10/us/trump-jan-6-insurrection-conservatives.html"
  },
  {
    "text": "The Sweep and Force of Section Three  —  University of Pennsylvania Law Review, Vol. 172, 2024  —  University of Chicago - Law School University of St. Thomas School of Law  —  Abstract  —  Section Three of the Fourteenth Amendment forbids holding office by former office holders who then participate in insurrection or rebellion.",
    "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4532751"
  },
  {
    "text": "Inside One ‘Egregious’ Mistake From Trump's Florida Judge Aileen Cannon  —  Judge Aileen Cannon barely has any courtroom experience, but in her limited time on the bench she appears to have flouted hundreds of years of legal tradition—just because. … U.S. District Judge Aileen Cannon … ",
    "url": "https://www.thedailybeast.com/inside-one-egregious-mistake-from-trumps-florida-judge-aileen-cannon"
  },
  {
    "text": "How Are Iowa Democrats?  'I Can't Even Describe to You How Bad It Is.'  —  As Republican presidential candidates flock to the state, Democrats there are despondent, exhausted by repeated defeats and the loss of their first-in-the-nation nominating contest.  —  Not long ago, Iowa was the center of the Democratic political universe.",
    "url": "https://www.nytimes.com/2023/08/11/us/politics/democrats-iowa-state-fair.html"
  },
  {
    "text": "Anatomy of Biden's Iran hostage deal: 5 Americans for $6 billion South Korea owes Iran for oil  —  ‘A POSITIVE STEP’: Five Americans who the U.S. says have been unjustly imprisoned in Iran for years may soon be freed under terms of a Biden administration deal worked out through Swiss intermediaries … ",
    "url": "https://www.washingtonexaminer.com/policy/defense-national-security/anatomy-of-bidens-iran-hostage-deal-5-americans-for-6-billion-south-korea-owes-iran-for-oil"
  },
  {
    "text": "Spiraling Legal Bills Threaten Trump With a Cash Crunch  —  The former president's political orbit, including the super PAC that backs him, is already spending more than it is taking in — an unusual trajectory this far out from an election.  —  Donald J. Trump's legal problems aren't just piling up — his legal bills are, too.",
    "url": "https://www.nytimes.com/2023/08/11/us/politics/donald-trump-legal-bills-campaign.html"
  },
  {
    "text": "Ohio's rejection of Issue 1 shows how toxic abortion has become for the GOP  —  Turns out even folks in red and purple states don't like to have their rights taken away.  —  ∙ Paid … By Noah Berlatsky  —  For decades, the right argued that Roe v. Wade was an assault on democracy … ",
    "url": "https://www.publicnotice.co/p/issue-1-rejected-ohio-abortion-restrictions-gop"
  },
  {
    "text": "The Totally Not Boring Story of the Most Normal Republican Presidential Candidate  —  Asa Hutchinson was a GOP star.  Then came Donald Trump.  —  Asa Hutchinson, former governor of Arkansas and current presidential candidate, held a meet and greet with the Crawford County Republican Women … ",
    "url": "https://www.politico.com/news/magazine/2023/08/11/asa-hutchinson-post-trump-republican-candidate-00110698"
  },
  {
    "text": "Exclusive: Federal grand jury reviewing Ken Paxton's ties to Austin developer Nate Paul  —  Ryan Autullo Tony PlohetskiAustin American-Statesman  —  Federal prosecutors have seated a grand jury in San Antonio and called witnesses close to suspended Texas Attorney General Ken Paxton to testify … ",
    "url": "https://www.statesman.com/story/news/politics/state/2023/08/10/federal-grand-jury-review-texas-attorney-general-ken-paxton-ties-austin-developer-nate-paul/70564234007/"
  },
  {
    "text": "Is Ben Wikler the Most Important Democrat in America?  —  The Wisconsin chair has turned around his party's fortunes.  But his winning formula faces a stern test in 2024.  —  The man who has been hailed as “the best state chair in the country” is not a national household name.",
    "url": "https://www.theatlantic.com/politics/archive/2023/08/ben-wikler-democrat-wisconsin-2024-election/674976/"
  },
  {
    "text": "Recordings show Va. swing district candidate favors ‘total ban’ on abortion  —  RICHMOND — John Stirrup has been playing up crime, taxes and other bread-and-butter issues while running for the House of Delegates in a purple Northern Virginia district, but the Republican didn't mince words … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/10/abortion-ban-virginia-elections-stirrup/"
  },
  {
    "text": "Inside the Biden-Newsom Relationship: How the California Governor Went From a Nuisance to a Top Ally  —  Newsom has kept Biden's team in the loop on media appearances and is set to be a lead Democratic surrogate for the second GOP debate in California  —  A Facebook icon representing … ",
    "url": "https://themessenger.com/politics/biden-newsom-relationship-debate-2024-presidential-election"
  },
  {
    "text": "The kingmaking Trump ally behind a cadre of rightwing judges  —  Aileen Cannon, the judge assigned to the documents case, is under increasing scrutiny - reflecting Leonard Leo's impact on the US judiciary  —  onald Trump must have thought all his Christmases had come at once.",
    "url": "https://www.theguardian.com/us-news/2023/aug/11/leonard-leo-aileen-cannon-trump-conservative-judges"
  },
  {
    "text": "Animated Frederick Douglass calls slavery a ‘compromise’ in conservative group's video  —  PragerU, a right-wing advocacy group, has made its way into the classroom with kids' videos deemed “misleading.”  —  Slavery was a compromise.  The Black Lives Matter movement led to more crime.",
    "url": "https://www.nbcnews.com/news/nbcblk/animated-frederick-douglass-calls-slavery-compromise-prageru-video-rcna99246"
  },
  {
    "text": "DeSantis suggests he would use drone strikes against drug cartels  —  Republican presidential candidate Gov. Ron DeSantis (Fla.) said he would use “whatever force we need to” to take down Mexican drug cartels if elected president, with or without help from the Mexican government.",
    "url": "https://thehill.com/homenews/campaign/4148271-desantis-suggests-use-drone-strikes-against-drug-cartels/"
  },
  {
    "text": "Research Firm Says Proud Boys Legal Team Stiffed Them $30,000  —  A lingering legal fight from the Jan. 6 attack gives new insight into the Proud Boys' seditious conspiracy case.  —  A seditious conspiracy trial for members of the Proud Boys is over.  But a legal loose end from the case … ",
    "url": "https://www.thedailybeast.com/research-firm-says-proud-boys-legal-team-stiffed-them-dollar30000"
  },
  {
    "text": "Miscommunication between pilots caused United plane to drop near ocean's surface, investigation finds  —  The crew failed to manage the plane's path, airspeed and nose direction after the mix-up, the NTSB said in its report.  No one was injured.  —  Federal investigators said Thursday … ",
    "url": "https://www.nbcnews.com/news/us-news/miscommunication-pilots-caused-united-plane-drop-oceans-surface-invest-rcna99374"
  },
  {
    "text": "White House asks Congress for $40B in additional funding  —  The White House on Thursday outlined a supplemental funding request for Congress for the start of the coming fiscal year, asking for billions more dollars for assistance to Ukraine amid its war with Russia as well as money … ",
    "url": "https://thehill.com/homenews/administration/4147785-white-house-asks-congress-for-40b-in-additional-funding/"
  }
]