[
  {
    "text": "Liz Cheney, outspoken Trump critic, weighs third-party presidential run  —  The former congresswoman says she is determined to stop Trump.  Other Trump critics think a third-party candidacy could help him.  —  Liz Cheney, one of the most vociferous critics of Donald Trump in the Republican Party … ",
    "url": "https://www.washingtonpost.com/elections/2023/12/05/liz-cheney-trump-president-2024/"
  },
  {
    "text": "Introduction  —  A national poll released today by the Institute of Politics at Harvard Kennedy School indicates that among 18-to-29-year-olds, President Biden's approval rating stands at 35%.  Still, the President maintains a solid lead in a head-to-head matchup against former President Trump.",
    "url": "https://iop.harvard.edu/youth-poll/46th-edition-fall-2023"
  },
  {
    "text": "Trump Rips Drudge Report For Covering Him ‘Unfairly’: ‘Site Fell Apart’  —  The former president praised the aggregation news site's downfall: ‘I love it!’  —  Former President Donald Trump over the weekend slammed conservative news aggregation site the Drudge Report in a Truth Social post for … ",
    "url": "https://themessenger.com/politics/trump-rips-drudge-report-for-covering-him-unfairly-site-fell-apart"
  },
  {
    "text": "Special counsel alleges Trump ‘sent’ supporters on path to Jan. 6 violence  —  Jack Smith accused the former president of a history of election lies and ‘encouragement of violence.’  —  Federal prosecutors on Tuesday accused former president Donald Trump of a long pattern of lying about elections … ",
    "url": "https://www.washingtonpost.com/national-security/2023/12/05/trump-jan-6-violence-election-obstruction/"
  },
  {
    "text": "The anti-Trump alarm goes off  —  THE ANTI-TRUMP ALARM GOES OFF.  Around this time in 2015, some in the political commentary class had a collective realization: Donald Trump could win the 2016 Republican presidential nomination.  A freakout of sorts ensued, although many remained confident … ",
    "url": "https://www.washingtonexaminer.com/opinion/the-anti-trump-alarm-goes-off"
  },
  {
    "text": "Mike Johnson Says Republicans Are Blurring Jan. 6 Footage To Protect Rioters From DOJ  —  The House speaker offered a remarkable statement in support of those who rioted at the Capitol in 2021.  —  WASHINGTON ― House Speaker Mike Johnson (R-La.) said Tuesday that Republicans … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-jan-6-footage_n_656f46cce4b09331c7f2219e"
  },
  {
    "text": "McHenry set to pass on reelection  —  The North Carolina Republican served as temporary speaker during this fall's chaotic search for a replacement for Kevin McCarthy.",
    "url": "https://www.politico.com/live-updates/2023/12/05/congress/mchenry-out-00130103"
  },
  {
    "text": "Statement from Congressman Patrick McHenry  —  WASHINGTON — Congressman Patrick McHenry (NC-10) released the following statement:",
    "url": "https://mchenry.house.gov/news/documentsingle.aspx?DocumentID=404652"
  },
  {
    "text": "Rep. Patrick McHenry, who served as temporary speaker, will retire  —  McHenry, 48, served as House speaker pro tempore for three weeks this year after conservatives ousted Rep. Kevin McCarthy from the top House job.  —  WASHINGTON — Rep. Patrick McHenry, R-N.C., announced Tuesday … ",
    "url": "https://www.nbcnews.com/politics/congress/rep-patrick-mchenry-served-temporary-speaker-will-retire-rcna128136"
  },
  {
    "text": "Fetterman mocks Speaker Johnson over Biden impeachment inquiry push: ‘Oh no!’  —  Sen. John Fetterman (D-Pa.) went after Speaker Mike Johnson (R-La.) on Monday, mocking his effort for an impeach inquiry of President Biden over unproven claims of illicit family business deals.  —  “Oh, no, please, please don't!”",
    "url": "https://thehill.com/homenews/senate/4342520-fetterman-speaker-johnson-biden-impeachment/"
  },
  {
    "text": "Tuberville releasing hold on hundreds of military promotions  —  Sen. Tommy Tuberville (R-Ala.) announced on Tuesday that he is ending his months-long blockade on hundreds of military promotions.  —  Tuberville said that he is jumping on board with an idea presented by Sens. Dan Sullivan … ",
    "url": "https://thehill.com/homenews/senate/4343067-tuberville-release-hold-military-promotions/"
  },
  {
    "text": "Nikki Haley wants to reform Social Security and Medicare.  Donors are paying attention  —  As she woos her party's wealthy donors, former South Carolina Gov. Nikki Haley is promoting a policy that sets her apart from her closest competitors for the 2024 Republican presidential nomination … ",
    "url": "https://www.cnn.com/2023/12/05/politics/nikki-haley-social-security-medicare-reform/"
  },
  {
    "text": "Top Democratic Donor, Reid Hoffman, Gives $250,000 to a Nikki Haley Super PAC  —  Mr. Hoffman, the co-founder of LinkedIn, has funded an array of anti-Trump candidates and causes.  —  When Jamie Dimon, the chief executive of JPMorgan Chase, urged Democratic donors last week to rally behind Nikki Haley … ",
    "url": "https://www.nytimes.com/2023/12/05/us/politics/nikki-haley-reid-hoffman-donation.html"
  },
  {
    "text": "Congress provided $7.5B for electric vehicle chargers.  Built so far: Zero.  —  The sluggish rollout could undermine President Joe Biden's reelection messaging promoting electric vehicles.  —  Congress at the urging of the Biden administration agreed in 2021 to spend $7.5 billion to build tens … ",
    "url": "https://www.politico.com/news/2023/12/05/congress-ev-chargers-billions-00129996"
  },
  {
    "text": "“Someone tell me what to do”  —  Across the country, states require more training to prepare students and teachers for mass shootings than for those expected to protect them.  The differences were clear in Uvalde, where children and officers waited on opposite sides of the door.",
    "url": "https://www.texastribune.org/2023/12/05/uvalde-officer-student-trainings-mass-shootings/"
  },
  {
    "text": "The Violent and Extreme History of Mike Johnson's Old Legal Clients  —  Speaker Mike Johnson's old clients include a man who spoke glowingly of killing gay people and another who said the government “should be a terror” to the LGBTQ community. … Speaker Mike Johnson has spoken modestly … ",
    "url": "https://www.thedailybeast.com/the-violent-and-extreme-history-of-mike-johnsons-old-legal-clients"
  },
  {
    "text": "Powerful members of Congress are dead-set on killing UFO transparency  —  Since 2020, no fewer than 10 former government officials, military officers and scientists, along with a former senate majority leader, have alleged (or suggested) publicly that the U.S. government has recovered advanced craft of unknown origin — that is, UFOs.",
    "url": "https://thehill.com/opinion/national-security/4341947-powerful-members-of-congress-are-dead-set-on-killing-ufo-transparency/"
  },
  {
    "text": "Special counsel hits back at Hunter Biden requesting Trump, Barr subpoenas  —  Special Counsel David Weiss says Biden's request is ‘meritless’  —  Special Counsel David Weiss blasted Hunter Biden's recent request to subpoena former President Trump and other former officials in a court filing on Tuesday.",
    "url": "https://www.foxnews.com/politics/special-counsel-hits-back-hunter-biden-requesting-trump-barr-subpoenas"
  }
]