[
  {
    "text": "Live Updates: Israel and Hamas Agree to Gaza Cease-Fire Deal, Officials Say  —  The cease-fire would take effect immediately, a White House official said.  The first phase of the deal, including the start of hostage releases, would last six weeks, although it was not clear what day that would begin, the official said.",
    "url": "https://www.nytimes.com/live/2025/01/15/world/israel-hamas-cease-fire-deal-gaza?unlocked_article_code=1.pU4.RX8a.tvGIXHe5ZsnS&smid=url-share"
  },
  {
    "text": "Israel and Hamas agree to ceasefire deal, including hostage release, Biden says  —  Qatar announces Gaza ceasefire  —  A hostage and ceasefire deal between Hamas and Israel has been reached Wednesday following more than 15 months of extraordinary bloodshed and violence in Gaza, President Joe Biden said Wednesday.",
    "url": "https://www.washingtonpost.com/world/2025/01/15/israel-war-gaza-ceasefire-hostages-news-hamas/"
  },
  {
    "text": "Statement from President Joe Biden  —  Today, after many months of intensive diplomacy by the United States, along with Egypt and Qatar, Israel and Hamas have reached a ceasefire and hostage deal.  This deal will halt the fighting in Gaza, surge much needed-humanitarian assistance to Palestinian civilians … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/15/statement-from-president-joe-biden-14/"
  },
  {
    "text": "The Israeli Right May Soon Be Disenchanted With Trump  —  The most interesting detail of the hostage-cease fire deal that Israeli and Hamas officials agreed to on Wednesday lies neither in its terms, which mainly resemble what's been on the table for months, nor in the fact that Benjamin Netanyahu … ",
    "url": "https://www.nytimes.com/2025/01/15/opinion/trump-ceasefire-israel-hamas.html"
  },
  {
    "text": "Biden on if Trump will get credit over him for ceasefire deal: ‘Is that a joke?’  —  President Biden brushed off a question about who would get the credit for the Israel-Hamas ceasefire deal struck on Wednesday.  —  “Is that a joke?”  Biden responded, when asked by a reporter whether … ",
    "url": "https://thehill.com/homenews/administration/5087527-biden-trump-credit-israel-hamas-ceasefire/"
  },
  {
    "text": "Israel, Hamas reach ceasefire deal designed to end 15-month Gaza war  —  Israel and Hamas agreed to a deal to halt fighting in Gaza and exchange Israeli hostages for Palestinian prisoners, an official briefed on the deal told Reuters on Wednesday, opening the way to a possible end to a 15-month war that has upended the Middle East.",
    "url": "https://www.reuters.com/world/middle-east/israel-hamas-reach-ceasefire-agreement-designed-end-15-month-gaza-war-official-2025-01-15/"
  },
  {
    "text": "AG nominee Pam Bondi won't say Trump lost 2020 election  —  Attorney general nominee Pam Bondi dodged a question from Sen. Dick Durbin (D-Ill.) on Wednesday about whether President-elect Trump lost the 2020 election.  —  Bondi echoed other Republicans in stating President Biden is now the president … ",
    "url": "https://thehill.com/regulation/court-battles/5086766-ag-nominee-pam-bondi-trump-2020-election/"
  },
  {
    "text": "Schiff and Bondi reignite old grudges at confirmation hearing: ‘You were censured’  —  Sen. Adam Schiff (D-CA) and Pam Bondi, President-elect Donald Trump's attorney general nominee, had an adversarial reunion Wednesday when they went toe-to-toe in what sounded more like a lecturing match than a confirmation hearing.",
    "url": "https://www.washingtonexaminer.com/news/senate/3288136/schiff-bondi-spar-senate-confirmation-hearing-trump-attorney-general/"
  },
  {
    "text": "Exclusive: Trump team asks three US senior career diplomats to resign, sources say  —  Aides to President-elect Donald Trump have asked three senior career diplomats who oversee the U.S. State Department's workforce and internal coordination to step down from their roles … ",
    "url": "https://www.reuters.com/world/us/trump-team-asks-three-us-senior-career-diplomats-resign-sources-say-2025-01-15/"
  },
  {
    "text": "Zuckerberg Will Host a Party for Trump's Inauguration  —  Mark Zuckerberg, the Meta chief executive, is one of several tech leaders expected to play a high-profile role in celebrating the new administration next week.  —  Mark Zuckerberg, the Meta chief executive who has tried to keep … ",
    "url": "https://www.nytimes.com/2025/01/15/us/politics/mark-zuckerberg-donald-trump-inauguration.html"
  },
  {
    "text": "How Right Wingers Rushed to DEI Hire Pete Hegseth  —  Pete Hegseth is wildly unqualified to run DOD.  He described yesterday the most people he had ever supervised was 100.  The non-profit budgets that went broke under his stewardship were in the $10 million range.",
    "url": "https://www.emptywheel.net/2025/01/15/how-right-wingers-rushed-to-dei-hire-pete-hegseth/"
  },
  {
    "text": "Nonprofit Founded by Stacey Abrams Admits Secretly Aiding Her 2018 Campaign  —  The New Georgia Project, whose leaders also included Raphael Warnock, now a senator, admitted violating campaign finance laws.  It agreed to a $300,000 penalty.  —  A nonprofit founded by Stacey Abrams … ",
    "url": "https://www.nytimes.com/2025/01/15/us/politics/nonprofit-stacey-abrams.html"
  },
  {
    "text": "Stacey Abrams group to pay largest fine for campaign violations in Georgia history  —  A voting rights group founded by Stacey Abrams will pay $300,000 for illegally supporting her 2018 gubernatorial campaign — the largest fine ever assessed for violating Georgia campaign finance laws.",
    "url": "https://www.ajc.com/politics/election/abrams-group-to-pay-largest-fine-for-campaign-violations-in-georgia-history/3Q3SFGNDNFEXLBIUYUB3ONDRM4/"
  },
  {
    "text": "FDA to Revoke Authorization for the Use of Red No. 3 in Food and Ingested Drugs  —  Constituent Update  —  The FDA is revoking the authorization for the use of FD&C Red No. 3 as a matter of law, based on the Delaney Clause of the Federal Food, Drug, and Cosmetic Act (FD&C Act).",
    "url": "https://www.fda.gov/food/hfp-constituent-updates/fda-revoke-authorization-use-red-no-3-food-and-ingested-drugs"
  },
  {
    "text": "No, Merrick Garland Did Not Let Donald Trump Skate  —  Some time in the next five days, Merrick Garland will step down as the nation's eighty-sixth attorney general, bringing to a close one of the most distinguished careers in public service in the last century.",
    "url": "https://newrepublic.com/article/190248/merrick-garland-trump-prosecution-delays"
  },
  {
    "text": "Trump encourages Vivek Ramaswamy to seek Ohio's open Senate seat  —  The co-leader of the “Department of Government Efficiency” may move to replace JD Vance, though other contenders remain.  —  President-elect Donald Trump has encouraged billionaire biotech entrepreneur Vivek Ramaswamy … ",
    "url": "https://www.washingtonpost.com/business/2025/01/15/vivek-ramaswamy-ohio-senate-trump/"
  },
  {
    "text": "Scoop: Trump's $500 million post-election windfall … - “The money is just pouring in at Mar-a-Lago. … - “We're looking at half a billion [dollars] by June, and we're on track,” this adviser said. … - They include the president-elect's inauguration account, the MAGA Inc. super PAC … ",
    "url": "https://www.axios.com/2025/01/15/trump-windfall-fundraising-500-million"
  },
  {
    "text": "The Supreme Court seems eager to curb First Amendment protections for porn  —  On Wednesday, the Supreme Court heard the first major First Amendment case involving pornography — or, for that matter, sexual speech of any kind — in more than two decades.  It's also the first such case since … ",
    "url": "https://www.vox.com/scotus/395057/supreme-court-porn-free-speech-paxton"
  },
  {
    "text": "Trump Said He'd Solve Ukraine on Day One.  Republicans Say He Didn't Mean ‘Day One.’  —  “I don't think the media pressing Day One is specifically ‘Day One,’” Rep. Marjorie Taylor Greene told NOTUS.  — Copy  —  Early on in his latest campaign for president, Donald Trump unveiled a headline-grabbing campaign promise on Ukraine.",
    "url": "https://www.notus.org/congress/trump-solve-ukraine-day-one-republicans"
  },
  {
    "text": "Jill Biden still hopes for a good ending  —  The first lady, after a half-century in public life, reflects on the past year — and looks to the future.  —  The first lady says she's at peace with this ending.  But.  —  “Let's just say I was disappointed with how it unfolded.”  —  Why?",
    "url": "https://www.washingtonpost.com/style/power/2025/01/15/jill-biden-interview-first-lady/"
  },
  {
    "text": "Trump will begin his presidency in delicate position, poll finds  —  As Donald Trump prepares to once again assume the office of the presidency, a new NPR/PBS News/Marist poll finds that, despite his claims of an “unprecedented and powerful mandate,” Trump may have to be careful about how far he decides to go with what he wants to do.",
    "url": "https://www.npr.org/2025/01/15/nx-s1-5259893/poll-trump-immigration-economy-favorability"
  },
  {
    "text": "Energy secretary nominee Chris Wright gets friendly confirmation hearing  —  President-elect Donald Trump's pick to lead the Department of Energy, Chris Wright, who will play a key role in the incoming administration boosting domestic oil and gas production, faced fairly straightforward questions … ",
    "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3287529/energy-secretary-nominee-chris-wright-friendly-confirmation-hearing/"
  },
  {
    "text": "Trump transition puts up guardrails around RFK Jr.  —  The transition team hired trusted conservatives to key HHS positions.  —  Just months after Donald Trump promised to let Robert F. Kennedy Jr. “go wild” on health care as a member of his Cabinet, some of the president-elect's advisers are quietly trying to box him in.",
    "url": "https://www.politico.com/news/2025/01/15/rfk-loyalists-hhs-trump-004032"
  },
  {
    "text": "RFK Jr. Admits He Didn't Come Clean on Anti-Vax Fortune  —  Robert F. Kennedy Jr. failed to disclose hundreds of thousands of dollars he made from his anti-vax crusade, Donald Trump's transition team has admitted to the Daily Beast.Trump's pick for health secretary previously said his career as the founder … ",
    "url": "https://www.thedailybeast.com/rfk-jr-admits-he-didnt-come-clean-on-anti-vax-fortune/"
  },
  {
    "text": "A Year of Empty Threats and a “Smokescreen” Policy: How the State Department Let Israel Get Away With Horrors in Gaza  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.",
    "url": "https://www.propublica.org/article/biden-blinken-state-department-israel-gaza-human-rights-horrors"
  },
  {
    "text": "TikTok prepares for US shutdown from Sunday, sources say  —  TikTok plans to shut its app for U.S. users from Sunday, when a federal ban on the social media app could come into effect, unless the Supreme Court moves to block it, people familiar with the matter said.",
    "url": "https://www.reuters.com/technology/tiktok-preparing-us-shut-off-sunday-information-reports-2025-01-15/"
  },
  {
    "text": "Johnson removes Mike Turner as Intel chair  —  The Ohio Republican has been an outspoken advocate for Ukraine funding and other hawkish national security stances.  —  Speaker Mike Johnson has removed Mike Turner as chair House Permanent Select Committee on Intelligence, three people familiar with the decision tell POLITICO.",
    "url": "https://www.politico.com/news/2025/01/15/johnson-removes-mike-turner-as-intel-chair-00198522"
  },
  {
    "text": "Yoon becomes South Korea's first sitting president to be detained after martial law chaos  —  South Korea's impeached president, Yoon Suk Yeol, was detained in a major law enforcement operation at the presidential compound Wednesday, defiantly insisting the anti-corruption agency … ",
    "url": "https://apnews.com/article/south-korea-yoon-martial-law-detain-8dd7f03661be39729741de9a3b5d1714"
  }
]