[
  {
    "text": "Ruling Against Trump Cuts to the Heart of His Identity  —  The finding by a judge in a New York civil case that Donald Trump committed fraud in valuing his real estate properties undermined the narrative of the business career that launched him in politics.  —  Nearly every aspect … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-fraud-ruling.html"
  },
  {
    "text": "The Republican debate is fake  —  With Trump dominating the GOP primary, the debate is a cosplay of a competitive election — and a distraction from an ugly truth.  —  Tonight's Republican primary debate is not a real event.  It is a performance, a show, a pantomime: a shiny object … ",
    "url": "https://www.vox.com/2024-elections/2023/9/27/23890683/second-republican-debate-gop-fake-rnc-trump"
  },
  {
    "text": "Let's Not Sleepwalk Into Another Trump Presidency  —  The GOP front-runner's “treason” talk makes clear, yet again, that he's a danger to democracy.  —  In late September 2016, Salena Zito wrote glowingly in The Atlantic about Donald Trump on the campaign trail in Pittsburgh and famously postulated that … ",
    "url": "https://www.vanityfair.com/news/2023/09/donald-trump-democracy-media-2024-election"
  },
  {
    "text": "Judge rules Donald Trump defrauded banks and insurers while building real estate empire  —  A judge ruled Tuesday that Donald Trump committed fraud for years while building the real estate empire that catapulted him to fame and the White House, and he ordered some of the former president's companies removed … ",
    "url": "https://apnews.com/article/donald-trump-letitia-james-fraud-lawsuit-1569245a9284427117b8d3ba5da74249"
  },
  {
    "text": "Trump's threats to Milley fuel fears he'll seek vengeance in second term  —  Former President Trump's violent rhetoric toward Gen. Mark Milley is raising fears he will use a second term in the Oval Office to seek retribution against his enemies.  —  Trump suggested Friday that Milley … ",
    "url": "https://thehill.com/policy/defense/4224405-trumps-threats-to-milley-fuel-fears-hell-seek-vengeance-in-second-term/"
  },
  {
    "text": "UAW Leader Has No Desire at All to Talk to Trump in Michigan  —  Trump's expected appearance Wednesday at a non-union auto plant is a “pathetic irony,” Shawn Fain said on CNN.  —  The United Auto Workers union's president derided GOP presidential candidate Donald Trump as being out of touch … ",
    "url": "https://www.thedailybeast.com/united-auto-workers-unions-president-doesnt-want-to-meet-trump-in-michigan"
  },
  {
    "text": "McCarthy's new shutdown strategy: Shifting the blame  —  Good morning, Early Birds.  The New York Times's Vanessa Friedman says it's “a cliché” to wear a Patagonia fleece vest in the office if you don't work in outdoor recreation — but it's so cold in The Post's newsroom.  What's a man to do?",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/mccarthys-new-shutdown-strategy-shifting-blame/"
  },
  {
    "text": "Dems eye their price to bail out the speaker  —  Presented by With assists from POLITICO's Congress team  —  TICK TOCK: The government will shut down in 5 days if Congress can't pass a funding patch.  —  DEMS STILL WEIGHING THE COST OF SAVING MCCARTHY  —  It's the question that Capitol Hill … ",
    "url": "https://www.politico.com/newsletters/huddle/2023/09/26/dems-eye-their-price-to-bail-out-the-speaker-00118255"
  },
  {
    "text": "North Korea says it will expel Travis King, the US soldier who crossed into the country in July  —  North Korea said Wednesday that it will expel a U.S. soldier who crossed into the country through the heavily armed border between the Koreas in July.  The North's official Korean Central News Agency … ",
    "url": "https://apnews.com/article/north-korea-us-soldier-travis-king-00c171778e378d95fe1115fe31612ec2"
  },
  {
    "text": "Target Closes Select Stores to Prioritize Team Member and Guest Safety  —  At Target, we take the decision to close stores very seriously, and only do so after taking meaningful steps to invest in the guest experience and improve business performance.  With that said, we have made the difficult decision … ",
    "url": "https://corporate.target.com/press/releases/2023/09/Target-Closes-Select-Stores-to-Prioritize-Team-Mem"
  },
  {
    "text": "“They've already succeeded”: Will Bunch on the GOP's impeachment clown show  —  They don't have evidence.  But they don't need any for their purposes.  —  ∙ Paid … As House Republicans turn the impeachment process into a joke with their evidence-free Joe Biden fishing expedition … ",
    "url": "https://www.publicnotice.co/p/biden-impeachment-inquiry-explained-will-bunch"
  },
  {
    "text": "Biden administration announces visa-free travel for Israelis  —  Israel will be joining the US Visa Waiver Program, allowing Israeli citizens to soon enter the United States without a visa and vice versa, the Biden administration has announced.  —  Israeli citizens will be expected to be able … ",
    "url": "https://www.cnn.com/2023/09/27/politics/biden-admin-israel-visa-waiver-program/"
  },
  {
    "text": "FCC chair proposes reinstating Obama-era net neutrality rules  —  Federal Communications Commission (FCC) Chairwoman Jessica Rosenworcel said on Tuesday that she plans to put forward a proposal to reinstate net neutrality rules that were repealed under former President Trump.",
    "url": "https://thehill.com/policy/technology/4224200-fcc-chair-proposes-reinstating-obama-era-net-neutrality-rules/"
  },
  {
    "text": "Unraveling what's really happening in Florida school libraries  —  On Tuesday, Popular Information reported that librarians in Charlotte County, Florida, were instructed by the school district superintendent to remove all books with LGBTQ characters.  This story was based on a document dated July 24 … ",
    "url": "https://popular.info/p/update-unraveling-whats-really-happening"
  },
  {
    "text": "How the Marxist Left captured higher education  —  The mission of a university is to discover truth and transmit that essential knowledge to future generations.  That has been achieved by what we call in the West the Socratic Dialogue — that is, ferreting out what is good, true, and beautiful by testing ideas in an academic setting.",
    "url": "https://www.washingtonexaminer.com/restoring-america/faith-freedom-self-reliance/how-the-marxist-left-captured-higher-education"
  },
  {
    "text": "US Senator Bob Menendez pleads not guilty to corruption charges  —  U.S. Senator Bob Menendez pleaded not guilty on Wednesday to charges of taking bribes from three New Jersey businessman, as calls for his resignation from his fellow Democrats escalated.  —  Federal prosecutors in Manhattan … ",
    "url": "https://www.reuters.com/world/us/us-senator-bob-menendez-appear-court-calls-resignation-mount-2023-09-27/"
  },
  {
    "text": "Comer Reveals Wires from China Have Joe Biden's Wilmington Home as the Beneficiary Address￼  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today announced the House Oversight Committee subpoenaed and obtained two bank wires revealing Hunter … ",
    "url": "https://oversight.house.gov/release/comer-reveals-wires-from-china-have-joe-bidens-wilmington-home-as-the-beneficiary-address%EF%BF%BC/"
  }
]