[
  {
    "text": "‘The elephant in the room’: NBC's McDaniel hiring sparks on-air criticism from one of its own  —  Chuck Todd, the former host of “Meet The Press,” launched an explosive attack on his own network during a live panel discussion.  —  Ronna McDaniel may have secured a gig as a political contributor … ",
    "url": "https://www.politico.com/news/2024/03/24/ronna-mcdaniel-roils-nbc-i-think-our-bosses-owe-you-an-apology-00148719"
  },
  {
    "text": "Tammy Murphy will drop out of U.S. Senate race  —  Kim will run on lines that had gone to Murphy  —  Tammy Murphy will announce today that she is dropping out of the race for United States Senate, abruptly ending her campaign after four months, the New Jersey Globe has confirmed.",
    "url": "https://newjerseyglobe.com/congress/tammy-murphy-will-drop-out-of-u-s-senate-race/"
  },
  {
    "text": "Geomagnetic storm from a solar flare could disrupt radio communications and create a striking aurora  —  Space weather forecasters have issued a geomagnetic storm watch through Monday, saying an ouburst of plasma from a solar flare could interfere with radio transmissions on Earth.",
    "url": "https://apnews.com/article/sun-solar-flare-geomagnetic-storm-magnetic-corona-73fc7ecffaff88fbfaea51aa82025217"
  },
  {
    "text": "How is abortion shaping 2024?  Look at Arizona.  —  The parties' scramble in the battleground state eight months ahead of the election is a model for how the issue is shaping competitive races nationwide.  —  PHOENIX, Arizona — Democrats are counting on abortion rights to carry them to victory this fall in races across the country.",
    "url": "https://www.politico.com/news/2024/03/25/abortion-2024-elections-arizona-00148683"
  },
  {
    "text": "Weakened House GOP majority reckons with Johnson's leadership  —  Spending bill passes with Democratic support, sparking familiar Republican complaints with still-new House speaker  —  Less than six months after a faction of House Republicans led a revolt that removed Kevin McCarthy from the speakership … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/24/house-speaker-johnson-spending-complaints/"
  },
  {
    "text": "Robert F. Kennedy Jr. flirts with the Libertarian nomination  —  The independent candidate has been in talks with the national party chair about pursuing the nomination.  —  Robert F. Kennedy Jr. is in talks to run on the Libertarian Party presidential ticket — a move that could translate … ",
    "url": "https://www.politico.com/news/2024/03/25/libertarian-candidate-president-robert-kennedy-jr-00148662"
  },
  {
    "text": "Abortion pill challenge gives Supreme Court chance to move toward national abortion ban  —  In the first major abortion case since overturning Roe v. Wade, the high court is considering restrictions on a drug used for medication abortions.  —  WASHINGTON − Two years after the Supreme Court erased … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/25/supreme-court-mifepristone-national-abortion-ban-comstock/72958484007/"
  },
  {
    "text": "Scoop: Black Dems endorse in Maryland Senate race after racial slur … - Trone used a racial slur in a House hearing last week. … - Trone is considered the front-runner in the Democratic primary. … - Reps. Barbara Lee (D-Calif.), Gregory Meeks (D-N.Y.), Joyce Beatty (D-Ohio) … ",
    "url": "https://www.axios.com/2024/03/24/maryland-senate-race-alsobrooks-endorsements-trone"
  },
  {
    "text": "'No one's ever seen a bond this size': Eric Trump criticises $454m judgment against his father  —  New York attorney general, Letitia James, could begin to seize Donald Trump's assets as soon as Tuesday morning  —  Eric Trump has come out railing against the $454m fraudulent property valuations judgment … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/24/eric-trump-donald-trump-new-york-bond"
  },
  {
    "text": "‘Don Poorleone’: Trump nickname trends on social media as ex-president faces bond deadline  —  From legal analysts to political strategists, social media erupted on Sunday with people eager to pin Donald Trump with a new nickname.  —  Trump, who has long been considered the king of political nicknames … ",
    "url": "https://www.rawstory.com/trump-don-poorleone-trending-name/"
  },
  {
    "text": "How the press enables Trump's second stab at dictatorship  —  If you follow Marcy Wheeler, you know Trump begging for Putin's help in 2016 and 2024's floundering impeachment are the same scandal.  But only if you follow Marcy.  —  L O L G O P  —  Audio playback is not supported on your browser.",
    "url": "https://thecause.substack.com/p/how-the-press-enables-trumps-second"
  },
  {
    "text": "Radar gaps threaten millions as severe weather season ramps up in U.S.  —  More than 3 years after a federal report downplayed holes in a network that enables advanced warning of dangerous storms, dozens of regions remain vulnerable  —  In March 2012, a tornado near Charlotte damaged … ",
    "url": "https://www.washingtonpost.com/weather/2024/03/24/weather-radar-gaps-safety-nws/"
  },
  {
    "text": "White House says it will fight ban on pride flags at U.S. embassies … - “The Administration fought against the inclusion of this policy and we will continue to work with members of Congress to find an opportunity to repeal it,” the spokesperson told NBC on Saturday.",
    "url": "https://www.axios.com/2024/03/24/pride-flag-ban-fight-white-house-embassies"
  },
  {
    "text": "Biden Is Building a ‘Superstructure’ to Stop Trump From Stealing the Election  —  Trump and his MAGA allies have been working for years to pre-rig the 2024 election.  Here's how Team Biden is planning to fight them … Long before Trump began leading in battleground-state polling … ",
    "url": "https://www.rollingstone.com/politics/politics-features/biden-trump-stop-steal-election-2024-1234993149/"
  }
]