[
  {
    "text": "Columbia University faces full-blown crisis as rabbi calls for Jewish students to ‘return home’  —  Columbia University is facing a full-blown crisis heading into Passover as a rabbi linked to the Ivy League school urged Jewish students to stay home and tense confrontations on campus sparked condemnation … ",
    "url": "https://www.cnn.com/2024/04/21/us/columbia-university-jewish-students-protests/"
  },
  {
    "text": "White House condemns ‘blatantly antisemitic’ protests as agitators engulf Columbia University  —  The White House condemned “in the strongest terms” the ongoing anti-Israel protests at colleges across the U.S., including at Columbia University in New York City, on Sunday, saying they have no place anywhere in the U.S.",
    "url": "https://www.foxnews.com/politics/white-house-condemns-blatantly-antisemitic-protests-agitators-engulf-columbia-university"
  },
  {
    "text": "Columbia rabbi warns Jewish students to go home, don't come back to campus because of ‘extreme antisemitism’  —  A prominent rabbi at Columbia University warned Jewish students to go home Sunday and not return to campus because of “extreme antisemitism,” while the Ivy League school said it would allow them to work online.",
    "url": "https://nypost.com/2024/04/21/us-news/columbia-rabbi-warns-jewish-students-to-go-home-dont-come-back-to-campus-because-of-extreme-antisemitism/"
  },
  {
    "text": "Will a Mountain of Evidence Be Enough to Convict Trump?  —  Monday will see opening statements in the People of the State of New York v. Donald J. Trump.  The state's case seems strong, but a conviction is far from assured.  —  In the official record, the case is known as the People … ",
    "url": "https://www.nytimes.com/2024/04/21/nyregion/trump-trial-hush-money-evidence.html"
  },
  {
    "text": "What happens if Trump gets convicted ahead of November?  —  The first-ever criminal trial of a current or former American president is underway in Manhattan, renewing questions over what a potential conviction would mean for former President Trump as he campaigns for the White House.",
    "url": "https://thehill.com/homenews/campaign/4606107-donald-trump-hush-money-trial-stormy-daniels-conviction-election/"
  },
  {
    "text": "Playbook: The Biden polling bump persists  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TOP-ED — Former VP MIKE PENCE in the NYT: “Donald Trump Has Betrayed the Pro-Life Movement”  —  NEW POLL — Encouraging signs for President JOE BIDEN in a new NBC News poll:",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/21/the-biden-polling-bump-persists-00153528"
  },
  {
    "text": "Hakeem Jeffries emerges as Congress' shadow speaker … - Former House Speaker Nancy Pelosi (D-Calif.), a master legislative tactician, heaped praise on her successor: “He is fabulous. … - One senior House Democrat told Axios: “It easily could have fallen apart ... He played the cards the way you'd want to play them.”",
    "url": "https://www.axios.com/2024/04/21/hakeem-jeffries-speaker-mike-johnson-israel-ukraine"
  },
  {
    "text": "House Republicans blame Greene and Freedom Caucus for lack of border wins … - GOP leadership brought up border security provisions alongside their foreign aid package — but the package was blocked by Republicans from reaching the House floor under normal rules.",
    "url": "https://www.axios.com/2024/04/22/house-republicans-greene-border-security-foreign-aid"
  },
  {
    "text": "Terry Anderson, AP reporter abducted in Lebanon and held captive for years, has died at 76  —  Terry Anderson, the globe-trotting Associated Press correspondent who became one of America's longest-held hostages after he was snatched from a street in war-torn Lebanon in 1985 and held for nearly seven years, has died at 76.",
    "url": "https://apnews.com/article/terry-anderson-dies-associated-press-c266353298c04dbf874ab4d94536f2b3"
  },
  {
    "text": "Chinese-Americans Are Pushing San Francisco Toward the Political Center  —  Many are turning against the left over issues like anti-Asian crime and education policy  —  SAN FRANCISCO—Phil Wong used to reliably back incumbents in this liberal city.  But in 2022, he voted … ",
    "url": "https://www.wsj.com/politics/elections/chinese-american-voters-san-francisco-hate-crimes-b70a065e"
  },
  {
    "text": "Legal fees pile up for embattled Squad member Cori Bush … - From January through March, Bush paid law firms approximately $86,000, according to recently released campaign finance records.  — In the final months before the August primary election, Bush's campaign has $528,000 with $91,000 … ",
    "url": "https://www.axios.com/2024/04/21/cori-bush-legal-fees-primary-congress"
  },
  {
    "text": "A crush of lawsuits over voting in multiple states is creating a shadow war for the 2024 election  —  As President Joe Biden and Donald Trump step up their campaigning in swing states, a quieter battle is taking place in the shadows of their White House rematch.",
    "url": "https://apnews.com/article/rnc-trump-lawsuits-2024-election-voter-rolls-c7d8943dcac776103d948532f62f2a5c"
  },
  {
    "text": "This is what that terrifies Republicans most  —  The UAW's historic win in Chattanooga shows the power of the sort of multi-racial coalition of workers that has terrified Southern aristocracy for centuries.  —  You probably know by now that workers at the Volkswagen plant in Chattanooga … ",
    "url": "https://www.patreon.com/posts/102758094"
  },
  {
    "text": "Trump wins Puerto Rico primary unopposed  —  Former President Trump secured 23 more delegates for the GOP convention on Sunday with a victory in the Puerto Rico primary, according to Decision Desk HQ.  —  Running unopposed, Trump — already the party's presumptive nominee — easily won the primary.",
    "url": "https://thehill.com/homenews/campaign/4610112-trump-wins-puerto-rico-primary-unopposed/"
  }
]