[
  {
    "text": "Here's the Plan to Fight Back  —  To everyone who feels like their heart has been ripped out of their chest, I feel the same.  To everyone who is afraid of what happens next, I share your fears.  But what we do next is important, and I need you in this fight with me.",
    "url": "https://time.com/collection/time100-voices/7173801/elizabeth-warren-democrats-plan-after-2024-election/"
  },
  {
    "text": "The 14 Places That Explain Trump's Victory  —  The architecture of Trump's victory is evident from the map.  —  In Pennsylvania, the handwringing and recriminations started almost as soon as the essential 2024 battleground state was called for Donald Trump.",
    "url": "https://www.politico.com/news/magazine/2024/11/08/donald-trump-win-electoral-map-00187135"
  },
  {
    "text": "Why Trump won — 9 takeaways from the 2024 election  —  What happened in the 2024 election was a political earthquake.  —  Former President Trump not only won in the Electoral College, but he won so big that he expanded his coalition with historic demographic shifts.",
    "url": "https://www.npr.org/2024/11/08/g-s1-33274/2024-election-how-trump-won-takeaways"
  },
  {
    "text": "Let's Not Lose Sight of Who Trump Is  —  In terms of historical perspective, the 2024 election has the potential to challenge the New Deal realignment of 1932 as the most consequential election of the past 100 years.  —  On Nov. 5, American voters re-empowered Donald Trump … ",
    "url": "https://www.nytimes.com/2024/11/08/opinion/trump-second-term-agenda.html"
  },
  {
    "text": "Playbook: Dems agonize over Sotomayor  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE LATEST RACE CALLS — Republican DAVE McCORMICK defeats Democratic Sen. BOB CASEY in Pennsylvania. ...  Reps. DON DAVIS (D-N.C.), YOUNG KIM (R-Calif.), JULIA BROWNLEY … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/08/dems-agonize-over-sotomayor-00188412"
  },
  {
    "text": "Judge strikes down Biden administration program shielding immigrant spouses from deportation  —  A federal judge on Thursday struck down a Biden administration policy that aimed to ease a path to citizenship for some undocumented immigrants who are married to U.S. citizens.",
    "url": "https://apnews.com/article/biden-immigration-program-blocked-judge-trump-2fcfa19a8d6911f6d8e972c9d105dfd4"
  },
  {
    "text": "Judge declares Biden immigration program for spouses of U.S. citizens illegal  —  A federal judge on Thursday struck down a Biden administration program that would allow unauthorized immigrants married to American citizens to get legal status and a streamlined path to U.S. citizenship, declaring the policy illegal.",
    "url": "https://www.cbsnews.com/news/judge-declares-biden-immigration-program-for-spouses-of-u-s-citizens-illegal/"
  },
  {
    "text": "Why Dean Phillips thinks Harris lost  —  The Washington Post's essential guide to power and influence in D.C.  —  Sign upfor Early Brief newsletter  —  Good morning, Early Birds.  We all made it to Friday.  Have a great weekend.  Send tips to earlytips@washpost.com.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2024/11/08/why-dean-phillips-thinks-harris-lost/"
  },
  {
    "text": "Democrats Need To Compete In The New Media Landscape — Or Keep Paying The Price  —  This is your TPM evening briefing.  —  As always happens after a bad election loss — and is compounded when that loss is sweeping, and to the man who launched a coup against the country — the losing side is in full panic mode.",
    "url": "https://talkingpointsmemo.com/where-things-stand/democrats-need-to-compete-in-the-new-media-landscape-or-keep-paying-the-price"
  },
  {
    "text": "Dems going after trans people this week should be ashamed of themselves  —  In the wake of Donald Trump's election to a second term as president, some Democrats have begun lobbing anti-transgender attacks — and other “let's panic” responses.  Such instant responses are shameful and must … ",
    "url": "https://www.lawdork.com/p/dems-post-election-protecting-trans-people"
  },
  {
    "text": "Dump Twitter  —  The oligarchs won.  When the markets closed November 6—the day Donald Trump was declared winner of the presidential election—the combined wealth of the world's 10 richest people, nine of whom live in the United States, had surged by a combined $63.5 billion.",
    "url": "https://newrepublic.com/article/188156/liberals-dump-musk-leave-twitter"
  },
  {
    "text": "Ted Cruz's daughter caught wincing and telling her mom 'don't clap' as senator praises Trump on stage  —  Caroline Cruz, 16, was left scowling at her mother on stage as the Texas senator prayed for a Trump win  —  Your support helps us to tell the story  —  From reproductive rights … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/ted-cruz-daughter-caroline-trump-election-b2643637.html"
  },
  {
    "text": "The wreckage Merrick Garland leaves behind  —  His failures left American democracy ripe for the picking. … ✍️  —  It has often been said that Donald Trump was running for president to keep himself out of prison.  Mission accomplished.  —  But the fact that Trump wasn't … ",
    "url": "https://www.publicnotice.co/p/merrick-garland-failures-explained"
  },
  {
    "text": "Axelrod: Democrats becoming ‘smarty-pants, suburban, college-educated party’  —  Political strategist David Axelrod argued Thursday that Democrats are becoming a “smarty-pants, suburban, college-educated party” that could keep losing electorally if it does not change course.",
    "url": "https://thehill.com/homenews/campaign/4980343-david-axelrod-democratic-party-2024-election-upset/"
  },
  {
    "text": "Racist text messages target young African Americans post-election  —  Black college and high school students report receiving racist texts about being “selected to pick cotton at the nearest plantation.”  —  Federal, state, and local authorities are investigating the offensive messages that have been sent over the last two days.",
    "url": "https://www.npr.org/2024/11/07/g-s1-33340/racist-text-messages-african-americans-splc-fbi"
  },
  {
    "text": "Canadian police brace for ‘worst-case scenario’ of asylum-seekers fleeing Trump  —  Canadian police and migrant aid groups are bracing for an influx of asylum-seekers fleeing President-elect Donald Trump's United States at the same time Canada deals with record numbers of refugee claimants and is trying to bring in fewer immigrants.",
    "url": "https://www.reuters.com/world/americas/canadian-police-brace-worst-case-scenario-asylum-seekers-fleeing-trump-2024-11-08/"
  },
  {
    "text": "Trump Won't Just Change Washington Politics — He'll Change Life in the City  —  The incoming administration won't just alter the federal workforce.  It will touch the lives of everyone who lives in the district.  —  Donald Trump's victory signals radical changes ahead for Washington … ",
    "url": "https://www.politico.com/news/magazine/2024/11/08/capital-trump-return-local-dc-column-00188325"
  },
  {
    "text": "Morning Digest: Democrats would have to run the table to win a House majority  —  We look at the 10 races still in doubt  —  Leading Off  —  House  —  About two dozen House races remain uncalled by the Associated Press, but while Democrats have a narrow path to a majority … ",
    "url": "https://www.the-downballot.com/p/morning-digest-democrats-would-have"
  },
  {
    "text": "Books like 'The Handmaid's Tale' and ‘1984’ are flying off the shelves after the presidential election  —  Margaret Atwood's “The Handmaid's Tale,” a novel set in a totalitarian society, has shot to the top of Amazon's bestselling books list following Donald Trump's reelection.",
    "url": "https://www.cnn.com/2024/11/07/business/1984-handmaids-tale-books-election/"
  },
  {
    "text": "Trump campaign quietly distances itself from RFK Jr after new vaccine safety comments  —  Republicans concerned former independent candidate would struggle to make it through security clearance for top government role  —  Donald Trump's team appeared to be quietly distancing itself … ",
    "url": "https://www.telegraph.co.uk/us/politics/2024/11/07/trump-campaign-quietly-distances-rfk-jr-vaccines/"
  },
  {
    "text": "MAGA Launches Increasingly Horrific Attacks on Women After Trump Win  —  The immediate aftermath of Donald Trump's presidential election win is already a bad omen for women and minorities across the nation, who within less than 48 hours have found themselves the subjects of hate campaigns designed to belittle and marginalize them.",
    "url": "https://newrepublic.com/post/188159/donald-trump-maga-attacks-women"
  },
  {
    "text": "Harris, Biden camps blame each other for loss … - In response to Trump's decisive victory, aides in both camps are blaming the other for being more responsible, according to interviews with more than a dozen people in the White House and Harris' campaign.",
    "url": "https://www.axios.com/2024/11/08/kamala-harris-biden-advisers-blame-election"
  }
]