[
  {
    "text": "The times demand serious economic ideas.  Harris supplies gimmicks.  —  ‘Price gouging’ is not causing inflation.  So why is the vice president promising to stamp it out?  —  Vice President Kamala Harris's speech Friday was an opportunity to get specific with voters about how a Harris presidency … ",
    "url": "https://www.washingtonpost.com/opinions/2024/08/16/harris-economy-plan-gimmicks/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MTYzMTk5LCJpYXQiOjE3MjM3ODA4MDAsImp0aSI6IjljYjYwZGIyLWQ0MjgtNDU1MC04MTBlLTM5YzM0Mzk0MzQ2ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzA4LzE2L2hhcnJpcy1lY29ub215LXBsYW4tZ2ltbWlja3MvIn0.bWh6D-1MNXD5zbyMIvYzINb8bsVgYj2fXfppjv0ictA&itid=gfta"
  },
  {
    "text": "Trump belittles Medal of Honor award in campaign speech  —  Former President Donald Trump on Thursday said the Presidential Medal of Freedom is a “better” award than the Defense Department's Medal of Honor because service members have to sacrifice their lives or health to receive the military's highest honor … ",
    "url": "https://www.militarytimes.com/news/pentagon-congress/2024/08/16/trump-belittles-medal-of-honor-award-in-campaign-speech/"
  },
  {
    "text": "VFW Admonishes Former President for Medal of Honor Remarks  —  The following is a message from VFW National Commander Al Lipphardt  —  WASHINGTON — “On Thursday, former President Donald Trump spoke at an event where he made some flippant remarks about the Medal of Honor and the heroes who have received it.",
    "url": "https://www.vfw.org/media-and-events/latest-releases/archives/2024/8/vfw-admonishes-former-president-for-medal-of-honor-remarks"
  },
  {
    "text": "Trump's Capitol Hill allies fume at his unfocused candidacy … - “Kamala Harris and Tim Walz are the most left-wing ticket in history,” National Republican Congressional Committee Chair Richard Hudson (R-N.C.) said on the call, according to a source familiar with his comments.",
    "url": "https://www.axios.com/2024/08/16/house-republicans-trump-message-focus-harris"
  },
  {
    "text": "Harris Puts Four Sun Belt States Back in Play, Times/Siena Polls Find  —  Kamala Harris and Donald Trump are in close races across Arizona, Georgia, Nevada and North Carolina, crucial swing states that Mr. Trump had seemed en route to run away with just a few weeks ago.",
    "url": "https://www.nytimes.com/2024/08/17/us/elections/kamala-harris-trump-az-nc-ga-nv.html?unlocked_article_code=1.Dk4.h1jB.r4PD8EvalJH3&smid=url-share"
  },
  {
    "text": "Harris surges with Black voters in key battleground states but gaps remain  —  Deborah Barfield Berry Terry Collins Lauren VillagranUSA TODAY  —  After two years without work, Darryl Gatewood got a job earlier this year driving a pharmaceutical delivery truck in suburban Pennsylvania - a good-paying job, with healthcare.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/17/black-voters-harris-trump-poll/74773493007/"
  },
  {
    "text": "Trump Pulls in Tulsi Gabbard for Debate Prep  —  Tulsi Gabbard, the former Democrat who has rebranded herself as a celebrity among Donald J. Trump's supporters, once eviscerated Kamala Harris on a debate stage.  —  Former President Donald J. Trump has begun preparing for his debate … ",
    "url": "https://www.nytimes.com/2024/08/16/us/politics/trump-debate-tulsi-gabbard.html?unlocked_article_code=1.DU4.zW-3.EUNARKJDeSbt&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Armed and Underground: Inside the Turbulent, Secret World of an American Militia  —  This story discusses threats of violence and contains a racial slur.  —  Reporting Highlights  — Militias After Jan. 6: Internal messages reveal how AP3, one of the largest U.S. militias … ",
    "url": "https://www.propublica.org/article/inside-secret-ap3-militia-american-patriots-three-percent"
  },
  {
    "text": "Bronze statue of John Lewis replaces more than 100-year-old Confederate monument  —  A large bronze statue of the late civil rights icon leader and Georgia congressman John Lewis was installed Friday, at the very spot where a contentious monument to the confederacy stood for more than 110 years … ",
    "url": "https://apnews.com/article/john-lewis-bronze-statue-replaced-confederate-georgia-b0c51086a4b83750ff38b1af2167abde"
  },
  {
    "text": "Gov. Tim Walz shares his ‘white guy’ taco recipe with VP Kamala Harris  —  (FOX 9) - Minnesota Gov. Tim Walz explains his “white guy tacos” to Vice President Kamala Harris in a new video on social media.  The first step of his recipe: unseasoned ground beef.  —  What's in the recipe?",
    "url": "https://www.fox9.com/news/tim-walz-white-guy-taco-recipe"
  },
  {
    "text": "Former congressman George Santos expected to plead guilty to charges related to campaign fraud Monday  —  Former New York Rep. George Santos is expected to plead guilty Monday to federal charges relating to fraudulent activity during his 2022 midterm campaign, according to multiple sources familiar with the deal.",
    "url": "https://www.cnn.com/2024/08/16/politics/santos-expected-plead-guilty-campaign-fraud"
  },
  {
    "text": "Menendez, Convicted of Taking Bribes, Ends Race for Re-election  —  Senator Robert Menendez of New Jersey instructed state officials on Friday to remove his name from the Nov. 5 ballot.  —  Senator Robert Menendez, a famously pugnacious Democrat whose five-decade political career came … ",
    "url": "https://www.nytimes.com/2024/08/16/nyregion/nj-menendez-suspends-senate-race.html"
  },
  {
    "text": "Supreme Court refuses DOJ request to partially reinstate new Title IX rule  —  The Supreme Court in a 5-4 decision denied the Biden administration's emergency request to partially reinstate its new Title IX rule.  —  The sweeping changes extend the sex-discrimination law's protections … ",
    "url": "https://thehill.com/regulation/court-battles/4832117-supreme-court-denies-title-ix-doj-request/"
  },
  {
    "text": "He found a Project 2025 duffel bag.  Then police showed up at his house.  —  Journalist and author Malcolm Harris says he found the bag left on a ledge in Capitol Hill.  It turned out to be more trouble than it was worth.  —  Author Malcolm Harris opened the door of his Capitol Hill home … ",
    "url": "https://www.washingtonpost.com/style/media/2024/08/16/project-2025-dc-duffel-bag/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MTYzMTk5LCJpYXQiOjE3MjM3ODA4MDAsImp0aSI6ImE2ZDRkMGFiLTljZDUtNGY5YS04YWM4LWU5NmZhY2NiZjZjOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zdHlsZS9tZWRpYS8yMDI0LzA4LzE2L3Byb2plY3QtMjAyNS1kYy1kdWZmZWwtYmFnLyJ9._K2-c4_rSO58WvJztzhRQW8_p_MRzVbJJyEiFP9ojx4&itid=gfta"
  },
  {
    "text": "Playbook: Could the Harris campaign become the Harris movement?  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BIDEN UNPLUGGED — Is it just us, or does non-candidate JOE BIDEN seem a little more liberated these days?",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/16/could-the-harris-campaign-become-the-harris-movement-00174341"
  }
]