[
  {
    "text": "‘Wildly underprepared’: National Guard troops seen sleeping on floors in exclusive photos  —  President Donald Trump's rush to deploy California National Guard troops to Los Angeles has left dozens of soldiers without adequate sleeping arrangements, forced to pack together in one or more federal buildings … ",
    "url": "https://www.sfchronicle.com/california/article/national-guard-california-photos-20368334.php"
  },
  {
    "text": "About 700 Marines being mobilized in response to LA protests, sources tell CNN  —  More than 700 Marines based out of the Marine Corps Air Ground Combat Center in California have been mobilized to respond to the protests in Los Angeles, according to three people familiar with the matter … ",
    "url": "https://cnn.com/2025/06/09/politics/marines-mobilized-los-angeles-protests"
  },
  {
    "text": "Attorney General Bonta, Governor Newsom Challenge Trump Order Seeking to Federalize California National Guard  — Attorney General Bonta, Governor Newsom Challenge Trump Orde...  Contact: (916) 210-6000, agpressoffice@doj.ca.gov  —  OAKLAND — California Attorney General Rob Bonta … ",
    "url": "https://oag.ca.gov/news/press-releases/attorney-general-bonta-governor-newsom-challenge-trump-order-seeking-federalize"
  },
  {
    "text": "Camp Pendleton Marines deployed to L.A.; after ICE protest, union leader faces a federal charge  —  Another 2,000 National Guard troops to be sent to L.A., Newsom says  —  Law enforcement makes 74 arrests at L.A. protests over the weekend  —  Protesters gather at Santa Ana federal building: ‘This is the healthiest thing to do’",
    "url": "https://www.latimes.com/california/live/los-angeles-protests-immigration-raid-updates"
  },
  {
    "text": "Marines Are Deploying to Los Angeles Area  —  Move comes in the wake of weekend protests over immigration  —  Roughly 500 Marines are deploying to the Los Angeles area to protect federal buildings and personnel in the wake of weekend protests over immigration that have already led President Trump … ",
    "url": "https://www.wsj.com/politics/national-security/marines-are-deploying-to-los-angeles-area-fe9a4ed6"
  },
  {
    "text": "RFK Jr.: HHS Moves to Restore Public Trust in Vaccines  —  We're reconstituting an advisory committee to avoid conflicts of interest.  —  Vaccines have become a divisive issue in American politics, but there is one thing all parties can agree on: The U.S. faces a crisis of public trust.",
    "url": "https://www.wsj.com/opinion/rfk-jr-hhs-moves-to-restore-public-trust-in-vaccines-45495112"
  },
  {
    "text": "Health Secretary RFK Jr. abruptly fires CDC vaccine advisory panel  —  Kennedy said the move is needed to ‘re-establish public confidence,’ but experts expressed shock  —  Health Secretary Robert F. Kennedy Jr. has taken the extraordinary step of firing the expert panel that advises the Centers … ",
    "url": "https://www.statnews.com/2025/06/09/rfk-jr-fires-every-member-of-cdc-vaccine-expert-panel-acip/"
  },
  {
    "text": "Kennedy Removes All C.D.C. Vaccine Panel Experts  —  The U.S. health secretary chose to “retire” members of a committee that makes significant decisions about who receives immunizations, including the vaccines for children.  —  Robert F. Kennedy Jr., the U.S. health secretary … ",
    "url": "https://www.nytimes.com/2025/06/09/health/rfk-jr-cdc-vaccine-panel.html?unlocked_article_code=1.Nk8.0_Do.42Z_luhZ9z7F&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "RFK Jr. ousts entire CDC vaccine advisory committee  —  Health Secretary Robert F. Kennedy Jr. on Monday removed every member of a scientific committee that advises the Centers for Disease Control and Prevention on how to use vaccines and pledged to replace them with his own picks.",
    "url": "https://apnews.com/article/kennedy-cdc-acip-vaccines-3790c89f45b6314c5c7b686db0e3a8f9"
  },
  {
    "text": "Dr. Phil was embedded with ICE during controversial Los Angeles immigration raids  —  As federal agents prepared to fan out in Los Angeles for a controversial immigration crackdown, the officers were greeted by a familiar face: Dr. Phil McGraw.  —  The television personality and his camera crew … ",
    "url": "https://cnn.com/2025/06/09/media/dr-phil-mcgraw-ice-immigration-raids-los-angeles"
  },
  {
    "text": "CA Democrat claims ICE agents were first to ‘escalate the situation’ amid LA riots  —  Rep. Nanette Barragán (D-CA) claimed that U.S. Immigration and Customs Enforcement was the first to escalate tensions amid the protests in Los Angeles that “started peacefully.”",
    "url": "https://www.washingtonexaminer.com/news/crime/3434884/ca-democrat-ice-agents-first-escalate-la-riots/"
  },
  {
    "text": "The Trump Administration Is Turning ICE Raids and Protests Into Reality TV  —  Whether creating its own memes or working with celebrities like “Dr. Phil” McGraw, the government is treating a volatile situation in Los Angeles like content.  —  Since the very beginning of the year … ",
    "url": "https://www.wired.com/story/reality-tv-dr-phil-ice-raids-protests-los-angeles/"
  },
  {
    "text": "Mark Green says he'll retire from House after megabill vote  —  Rep. Mark Green said Monday he plans to resign from Congress after four terms to accept a private-sector job offer.  The Tennessee Republican and Homeland Security Committee said his retirement would begin after the House votes again … ",
    "url": "https://www.politico.com/live-updates/2025/06/09/congress/mark-green-to-retire-after-megabill-vote-00395343"
  },
  {
    "text": "White House struggles to find qualified people willing to work for Pete Hegseth  —  At least three people have turned down potential roles working for the defense secretary and former Fox News host.  Supporters say his leadership has been effective.  —  WASHINGTON — The White House … ",
    "url": "https://www.nbcnews.com/politics/national-security/white-house-struggles-find-qualified-people-willing-work-pete-hegseth-rcna211602"
  },
  {
    "text": "Florida agency tells newspaper to halt reporting angle on foundation associated with governor's wife  —  Florida's child welfare agency sent a letter to a Florida newspaper telling it to “cease and desist” its reporting on foster families for a story about a nonprofit associated … ",
    "url": "https://apnews.com/article/orlando-sentinel-florida-desantis-welfare-9636452a8bf8eb230489513db64d86f7"
  },
  {
    "text": "Pam Bondi's brother loses his D.C. Bar election in a blowout  —  Bradley Bondi lost his bid to be president of the D.C. Bar to Diane Seltzer, who received 34,982 votes compared to Bondi's 3,490.  —  WASHINGTON — Bradley Bondi, the brother of Attorney General Pam Bondi … ",
    "url": "https://www.nbcnews.com/politics/politics-news/pam-bondi-brother-loses-dc-bar-election-blowout-rcna211869"
  },
  {
    "text": "Hegseth aide upended Pentagon leak inquiry with false wiretap claims  —  Exclusive: ex-Doge staffer Justin Fulcher suggested he had evidence of wiretap that would help investigation  —  Days before Pete Hegseth fired three top aides last month over a Pentagon leak investigation into the disclosure … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/09/hegseth-wiretap-inquiry-justin-fulcher"
  },
  {
    "text": "Justice Jackson warns the Supreme Court is manipulating the rules to benefit Trump  —  On Friday, the Supreme Court handed down a brief order permitting the Department of Government Efficiency, the enigmatic White House entity that billionaire Elon Musk previously ran, to access a wide range … ",
    "url": "https://www.vox.com/scotus/416073/supreme-court-justice-ketanji-brown-jackson-shadow-docket-trump"
  },
  {
    "text": "Latinas For Trump Co-Founder Rips Trump Immigration Policies As ‘Unacceptable And Inhumane’  —  “This is not what we voted for,” said Florida state Sen. Ileana Garcia (R), while accusing Trump of undermining “the sense of fairness and justice.”  —  A Republican Florida state senator … ",
    "url": "https://www.huffpost.com/entry/ileana-garcia-condemns-trump-immigration-policies_n_6846ea24e4b0ee4cf20cef74"
  },
  {
    "text": "IDF detains Gaza-bound vessel carrying Greta Thunberg: ‘The show is over’  —  Israeli forces detain climate activist and ‘Game of Thrones’ actor carrying less than a truckload of aid  —  Israeli forces early Monday detained an aid boat bound for Gaza while carrying Greta Thunberg and other activists.",
    "url": "https://www.foxnews.com/world/idf-detains-gaza-bound-vessel-carrying-greta-thunberg-the-show-over"
  },
  {
    "text": "Gender Gaps on Abortion Reach Historic Highs  —  Public support for abortion rights remains elevated since high court overturned Roe v. Wade  —  WASHINGTON, D.C. — Three years after the U.S. Supreme Court overturned Roe v. Wade, Gallup finds historically wide gender gaps in Americans' views on abortion … ",
    "url": "https://news.gallup.com/poll/691370/gender-gaps-abortion-reach-historic-highs.aspx"
  }
]