[
  {
    "text": "100 days in and the public feels Trump's presidency is proceeding mostly as expected  —  Most partisans agree they are getting what they expected from Trump's second term, but 84% of Democrats think Trump is doing a poor or terrible job as president so far and 68% of Republicans think he's doing a good or great job.",
    "url": "https://apnorc.org/projects/100-days-in-and-the-public-feels-trumps-presidency-is-proceeding-mostly-as-expected/"
  },
  {
    "text": "About 4-in-10 Americans say Trump is a ‘terrible’ president amid sinking approval: Survey  —  A new poll shows that about 4 in 10 Americans say President Trump has been a “terrible” leader in his second term.  —  The Associated Press-NORC Center for Public Affairs Research also found … ",
    "url": "https://thehill.com/homenews/administration/5269499-about-4-in-10-americans-say-trump-is-a-terrible-president-amid-sinking-approval-survey/"
  },
  {
    "text": "As Trump destroys the economy, GOP and Wall Street execs stay mum  —  They seem to think they can pressure Trump privately.  It's not working.  —  President Donald Trump is torching the U.S. economy.  He's attacking our trade alliances and our ability to control inflation.",
    "url": "https://www.washingtonpost.com/opinions/2025/04/26/trump-economy-tariffs-federal-reserve-wall-street/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NjQwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MDIyMzk5LCJpYXQiOjE3NDU2NDAwMDAsImp0aSI6ImQ2M2QzZmY3LTU5MmEtNDJiNC1iN2M2LTIxMjcxZGNmNmExYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA0LzI2L3RydW1wLWVjb25vbXktdGFyaWZmcy1mZWRlcmFsLXJlc2VydmUtd2FsbC1zdHJlZXQvIn0.NvU2f4aFoangMJQgk720euqVuBSOWz5S4_iIPsPKjLQ&itid=gfta"
  },
  {
    "text": "Three U.S. citizens, ages 2, 4 and 7, swiftly deported from Louisiana  —  The cases have renewed concerns that the Trump administration's expedited deportations are violating the rights of both citizens and noncitizens.  —  Three U.S. citizen children from two different families were deported … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/26/us-citizen-children-deported-ice/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NjQwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MDIyMzk5LCJpYXQiOjE3NDU2NDAwMDAsImp0aSI6IjM5MjZlNWYyLTg2NDYtNDM4Yi05YTViLTI5YjRlNzM4ZjExYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA0LzI2L3VzLWNpdGl6ZW4tY2hpbGRyZW4tZGVwb3J0ZWQtaWNlLyJ9.Rm7u0rjPmi8MkPr9rnhg_-oGfcj8fu1tJP7dscz3WEs&itid=gfta"
  },
  {
    "text": "ICE deports immigrant mother of an infant and 3 children who are US citizens, lawyers say  —  Immigration and Customs Enforcement officers have in recent days deported the Cuban-born mother of a 1-year-old girl — separating them indefinitely — and three children ages 2 … ",
    "url": "https://apnews.com/article/immigration-mothers-deported-d8c5c0353c18e9ee0c228ea15e02d759"
  },
  {
    "text": "Trump Refuses to Give Biden Air Force One Ride to Pope's Funeral  —  FLYING SOLO  —  The MAGA president broke yet another presidential tradition in attending the late Pontiff's funerary rites.  —  Not even the death of Pope Francis could bring President Donald Trump to make nice and ride with former President Joe Biden.",
    "url": "https://www.thedailybeast.com/trump-refuses-to-give-biden-air-force-one-ride-to-popes-funeral/"
  },
  {
    "text": "How Trump Plays Into Putin's Hands, From Ukraine to Slashing U.S. Institutions  —  Many of President Trump's actions have been seen as benefiting Russia either directly or indirectly, so much so that Russian officials have celebrated some of his moves.  —  If President Vladimir V. Putin … ",
    "url": "https://www.nytimes.com/2025/04/26/us/politics/trump-putin-russia-ukraine.html?unlocked_article_code=1.Ck8.hbvQ.uAelxKo7ozqh&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "From Book Bans to Canceled Lectures, the Naval Academy Is Bending to Trump  —  Even before the presidential election, the school began preparing for Donald Trump's potential return to power.  Now faculty members are resigning in protest.  —  For 65 years, the U.S. Naval Academy's annual … ",
    "url": "https://www.nytimes.com/2025/04/24/us/politics/naval-academy-trump.html?unlocked_article_code=1.Ck8.aenR.PoRRhvNtFCxV&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "I oversaw rigorous review of NSF-funded research on misinformation: Now the Trump administration is cancelling it  —  For the last three years, I was the director of the Science of Science: Discovery, Communication, and Impact program at the NSF.  This program funded research on the social science … ",
    "url": "https://donmoynihan.substack.com/p/i-oversaw-rigorous-review-of-nsf"
  },
  {
    "text": "Poll: Canadians despise Trump and distrust US  —  A new POLITICO/Focaldata poll finds Trump looms over the race, boosting Mark Carney and the Liberals as Canadians turn against the United States.  —  Three quarters of Canadians dislike President Donald Trump — and Conservatives appear likely … ",
    "url": "https://www.politico.com/news/2025/04/26/canada-election-poll-favorability-00311632"
  },
  {
    "text": "Trump Officials Weaken Rules Insulating Government Workers From Politics  —  A reinterpretation of the Hatch Act announced by the administration lets officials wear campaign paraphernalia like MAGA hats, and removes an independent board's role in policing violations.",
    "url": "https://www.nytimes.com/2025/04/25/us/politics/trump-hatch-act.html"
  },
  {
    "text": "Among the meek and the mighty, Catholics bury their 'people's pope'  —  The pope's unadorned tomb, marked by a single Latin word — Franciscus — was intended, a cleric said, to reflect a life of “simplicity and essential things.”  —  VATICAN CITY — The Roman Catholic Church bid farewell … ",
    "url": "https://www.washingtonpost.com/world/2025/04/26/pope-francis-funeral-vatican/"
  },
  {
    "text": "Trump accused of Pope Francis funeral faux pas after ‘breaking dress code’ then leaving early  —  On The Ground newsletter: Get a weekly dispatch from our international correspondents  —  President Donald Trump has been accused of breaking the dress code for Pope Francis's funeral by wearing blue … ",
    "url": "https://www.independent.co.uk/news/world/europe/trump-pope-francis-funeral-blue-suit-b2740006.html"
  },
  {
    "text": "Trump Pardons Executive Whose Family Sought to Publicize Ashley Biden's Diary  —  The pardon of Paul Walczak, who had been convicted of tax crimes, comes as the president uses clemency to reward allies and swipe at perceived enemies.  —  President Trump on Wednesday pardoned … ",
    "url": "https://www.nytimes.com/2025/04/25/us/politics/trump-pardon-walczak-ashley-biden-diary.html"
  },
  {
    "text": "Website For MAGA-Friendly Businesses Backfires As People Use It For Boycotts  —  Social media posts about PublicSquare have gone viral as Trump critics use it to find companies not to support - the opposite of what the site was set up for.  —  WASHINGTON - A few years ago … ",
    "url": "https://www.huffpost.com/entry/publicsquare-trump-critics-boycott-businesses_n_680900d2e4b00850c6839b0b"
  },
  {
    "text": "Can Trump Really Deport 10 Million People?  A Conversation with Dara Lind  —  Despite his draconian and lawless crackdown on immigrants and their defenders, the number of undocumented might not go down  —  Immigration policy has long been a battlefield for ideological disputes.",
    "url": "https://www.theunpopulist.net/p/can-trump-really-deport-10-million"
  },
  {
    "text": "Trump-aligned club for the ultra rich launches in Washington  —  The launch of “Executive Branch” comes as Trump world looks to remake Washington.  —  A new club is coming to Washington — and you probably can't get in.  —  Donald Trump Jr., megadonor Omeed Malik and several other investors … ",
    "url": "https://www.politico.com/news/2025/04/26/donald-trump-washington-club-00311720"
  }
]