[
  {
    "text": "Wife of Justice Alito called upside-down flag ‘signal of distress’  —  In January 2021, Martha-Ann Alito said the flag, a symbol embraced by election deniers, was raised outside her home in response to a neighborhood dispute.  —  The wife of Supreme Court Justice Samuel A. Alito Jr. told … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/25/alito-flag-martha-ann-washington-post/"
  },
  {
    "text": "Washington Post bombshell: Washington Post buried Alito flag story for three years  —  Last week, many of us learned from The New York Times on May 16 that an upside-down American flag had been temporarily raised over the Alito household in the days after January 6, 2021.",
    "url": "https://www.lawdork.com/p/washington-post-bombshell-washington"
  },
  {
    "text": "Hillary Clinton Has Some Tough Words for Democrats, and for Women  —  In an interview for a forthcoming book, Mrs. Clinton also suggested that if Donald Trump won in November “we may never have another actual election.”  —  Hillary Clinton criticized her fellow Democrats over what she described … ",
    "url": "https://www.nytimes.com/2024/05/25/us/politics/hillary-clinton-abortion.html"
  },
  {
    "text": "Jack Smith Invites Aileen Cannon to Protect the Country Rather than Just Donald Trump  —  Jack Smith has asked Judge Aileen Cannon to prevent Trump from lying about a plot to assassinate him, as he has done since propagandist Julie Kelly made a stink about a routine Use of Force form Trump himself released … ",
    "url": "https://www.emptywheel.net/2024/05/25/jack-smith-invites-aileen-cannon-to-protect-the-country-rather-than-just-donald-trump/"
  },
  {
    "text": "Trump is still pushing the limits of the gag order.  It could come back to haunt him at sentencing.  —  Dealing with the gag order is a distraction for both sides.  But if Trump is convicted, his violations could be used as aggravating factors.  —  NEW YORK — So far … ",
    "url": "https://www.politico.com/news/2024/05/25/trump-hush-money-gag-order-sentencing-00159995"
  },
  {
    "text": "Sotomayor admits some Supreme court decisions have driven her to tears  —  Justice Sonia Sotomayor reflected on her time on the Supreme Court Friday, admitting that some of the high court's decision have driven her to tears.  “There are days that I've come to my office after an announcement … ",
    "url": "https://thehill.com/regulation/court-battles/4685887-sonia-sotomayor-cried-over-surpeme-court-decisions-harvard/"
  },
  {
    "text": "Ric Grenell, Fierce Trump Loyalist, Seeks Cabinet Job as Reward  —  If Donald Trump wins the presidency, Richard Grenell hopes to be secretary of state.  But his work raises questions, even from his former boss.  —  Adriana Zehbrauskas for The New York Times",
    "url": "https://www.nytimes.com/2024/05/25/us/politics/grenell-trump-cabinet.html"
  },
  {
    "text": "We Must Face Down the Expanding Anti-Reality Industry  —  Exposing the antiscience playbook reveals the antiregulatory motives of its deep-pocketed bankrollers  —  The U.S. is bracing for another summer of powerful storms and wildfires, on the heels of an unusually warm winter and spring … ",
    "url": "https://www.scientificamerican.com/article/we-must-face-down-the-expanding-anti-reality-industry/"
  },
  {
    "text": "America's premier pronatalists on having ‘tons of kids’ to save the world: ‘There are going to be countries of old people starving to death’  —  Elon Musk (father of 11) supports their cause.  Thousands follow their ideology.  Malcolm and Simone Collins are on a mission to make it easier for everyone to have multiple children.",
    "url": "https://www.theguardian.com/lifeandstyle/article/2024/may/25/american-pronatalists-malcolm-and-simone-collins"
  },
  {
    "text": "‘It Was Pure Retaliation’: The Feud That Will Define the Senate GOP  —  Rick Scott hasn't given up his quest to vanquish Mitch McConnell and restore his own battered image inside the Republican conference.  —  In late November of 2022, Sen. Rick Scott received a text from an aide to Mitch McConnell.",
    "url": "https://www.politico.com/news/magazine/2024/05/25/it-was-pure-retaliation-the-feud-that-will-define-the-senate-gop-00160002"
  },
  {
    "text": "Uvalde families sue Meta and Call of Duty maker on second anniversary of school attack  —  Families in Uvalde took more legal action Friday on the second anniversary of the Robb Elementary School attack, suing Meta Platforms, which owns Instagram, and the maker of the video game Call of Duty … ",
    "url": "https://apnews.com/article/uvalde-shooting-elementary-anniversary-texas-a20e7fefa9d66058a8ff6611fa808df8"
  },
  {
    "text": "GOP Officials Are Outsourcing Their Lawsuits to a Far-Right Christian Group  —  Conservative public officials are hiring the Alliance Defending Freedom to lead their culture war lawsuits — and handle their public statements  —  TWO SEPARATE, CONTROVERSIAL Idaho laws have landed in front … ",
    "url": "https://www.rollingstone.com/politics/politics-features/adf-republicans-yavapai-arizona-idaho-iowa-kansas-1235024829/"
  },
  {
    "text": "Key Senate Democrats seek meeting with Chief Justice Roberts over 'Supreme Court's ethics crisis'  —  The senators are asking Chief Justice John Roberts to “ensure” that Justice Alito recuses himself from certain cases.  —  Two top Democrats on the Senate Judiciary Committee asked to meet … ",
    "url": "https://www.nbcnews.com/politics/congress/key-senate-democrats-meeting-chief-justice-roberts-alito-ethics-rcna154052"
  },
  {
    "text": "Ex-CIA officer accused of spying for China pleads guilty in a Honolulu courtroom  —  The secrets he was accused of providing included information about CIA sources and assets, international operations, secure communication practices and operational tradecraft, charging documents said.",
    "url": "https://www.politico.com/news/2024/05/25/ex-cia-officer-accused-of-spying-for-china-pleads-guilty-in-a-honolulu-courtroom-00160016"
  },
  {
    "text": "Libertarian convention crowd appears hostile to Trump ahead of Saturday speech  —  Vivek Ramaswamy was booed when he mentioned Trump, while a convention-goer who called for “Donald Trump to go f— himself” was met with widespread applause.  —  WASHINGTON — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/libertarian-convention-crowd-appears-hostile-trump-ahead-speech-rcna154029"
  }
]