[
  {
    "text": "Steve Bannon condemns Elon Musk as ‘racist’ and ‘truly evil’  —  Ex-Trump adviser denounces tech CEO's embrace of some forms of immigration and vows to ‘take this guy down’  —  In an escalation of discontent among the highest-profile far-right followers of Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/12/steve-bannon-calls-elon-musk-racist"
  },
  {
    "text": "Steve Bannon derides Elon Musk, vowing to limit influence over Trump  —  His comments reflect an intensifying battle over Musk's West Wing influence as Trump prepares to take office  —  President-elect Donald Trump's former chief strategist Stephen K. Bannon is ramping up public attacks … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/12/bannon-musk-trump-maga/"
  },
  {
    "text": "Vance says those who ‘committed violence’ on Jan. 6 ‘obviously’ shouldn't be pardoned  —  Vice President-elect JD Vance said people who “committed violence” on Jan. 6, 2021, “obviously” shouldn't be pardoned by President-elect Trump.  —  “I think it's very simple, look … ",
    "url": "https://thehill.com/homenews/administration/5081525-vance-says-those-who-committed-violence-on-jan-6-obviously-shouldnt-be-pardoned/"
  },
  {
    "text": "Europe's Largest Pension Fund Sold Tesla Stake Over Musk's Pay  —  Europe's largest pension fund sold its entire €571 million ($585 million) stake in Tesla Inc. in the third quarter partly due to disagreement with Elon Musk's remuneration package.  —  “We had a problem” with Musk's pay package … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-12/europe-s-largest-pension-fund-sold-tesla-stake-over-musk-s-pay"
  },
  {
    "text": "Newsom suspends landmark environmental laws to ease rebuilding in wildfire zones  — Requirements for building permits and reviews in the California Environmental Quality Act and the California Coastal Act will be eased for victims of the fires in Pacific Palisades, Altadena and other communities.",
    "url": "https://www.latimes.com/california/story/2025-01-12/newsom-suspends-landmark-environmental-regulations-palisades-altadena-fires"
  },
  {
    "text": "2025 Trans Girl Scouts To Order Cookies From!  —  PLEASE buy from people who have not filled their goals!  —  Did you know that for a long time, Girl Scouts has openly included transgender and nonbinary individuals in its membership?  I first learned of this four years ago while searching … ",
    "url": "https://www.erininthemorning.com/p/2025-trans-girl-scouts-to-order-cookies"
  },
  {
    "text": "Which of Trump's nominees should get confirmed?  We made a chart.  —  Confirmation hearings will begin Tuesday for President-elect Donald Trump's intended Cabinet nominees.  We would not have picked any of his choices for our hypothetical Cabinet.  But, as we have argued for decades … ",
    "url": "https://www.washingtonpost.com/opinions/interactive/2025/trump-nominees-confirmation-hearings-editorial-board/"
  },
  {
    "text": "Thailand's cabinet approves draft law to legalise casinos and gambling  —  Thailand's cabinet has approved a draft law that would legalise gambling and casinos, a move aimed at boosting tourism, jobs and investment, Prime Minister Paetongtarn Shinawatra said on Monday.",
    "url": "https://www.reuters.com/world/asia-pacific/thai-cabinet-approves-draft-law-legalise-casinos-gambling-pm-says-2025-01-13/"
  },
  {
    "text": "California Fire Facts  —  LIE - California Cut Firefighting Budgets  — FACT: The number of CalFIRE personnel has nearly doubled since 2019 (from 5,829 to 10,741)  — FACT: CalFIRE's budget has nearly doubled since 2019 ($2 Billion to $3.8 Billion)  —  LIE - These Wildfires are Caused … ",
    "url": "https://gavinnewsom.com/california-fire-facts/"
  },
  {
    "text": "He gave his cats raw milk because he thought it was healthier.  He says it tragically backfired  —  A California man whose two cats died after drinking raw milk recalled for bird flu risk says he meant to keep his beloved pets healthy, but his efforts tragically backfired.",
    "url": "https://apnews.com/article/raw-milk-california-cats-bird-flu-c3f6201216efb2a7e98ca143329a631a"
  },
  {
    "text": "Biden spoke with Netanyahu; Sullivan says hostage deal very close  —  Netanyahu updated Biden on progress and on the mandate he has given his top-level security delegation now in Doha in order to advance a hostage deal, Netanyahu said in a statement.  —  WASHINGTON — U.S. President Joe Biden spoke … ",
    "url": "https://www.nbcnews.com/politics/politics-news/biden-spoke-netanyahu-sullivan-says-hostage-deal-close-rcna187328"
  },
  {
    "text": "Inside Elon Musk's Plan for DOGE to Slash Government Costs  —  Mr. Musk has turned to Silicon Valley to help recruit executives who will take up unofficial positions across the federal government.  —  An unpaid group of billionaires, tech executives and some disciples of Peter Thiel … ",
    "url": "https://www.nytimes.com/2025/01/12/us/politics/elon-musk-doge-government-trump.html?unlocked_article_code=1.ok4.JXW-.m8CE_yWg6VxQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "GOP Senator Blames Americans for Most of Their Health Problems  —  “Look, about 70% of your health outcomes are determined by you,” said Sen. Roger Marshall as his party looks to roll back health care coverage and protections  —  Americans who are sick and dying should mostly blame themselves for their health condition.",
    "url": "https://www.rollingstone.com/politics/politics-news/roger-marshall-make-america-healthy-again-1235232716/"
  },
  {
    "text": "Barrasso vows no ‘blank check’ for wildfire aid  —  Senate Majority Whip John Barrasso (R-WY) came out against any idea of a “blank check” passing through Congress to provide aid to California as the wildfires continue to devastate the Los Angeles area.  —  Speaking on CBS News's Face … ",
    "url": "https://www.washingtonexaminer.com/news/senate/3284423/barrasso-vows-no-blank-check-for-wildfire-aid/"
  },
  {
    "text": "DOJ seeks interviews with former UnitedHealth Group doctors  —  Clinicians told STAT that UnitedHealth pressured them to apply lucrative diagnosis codes to patients  —  The Justice Department is interviewing former UnitedHealth Group physicians about their experiences working at practices owned … ",
    "url": "https://www.statnews.com/2025/01/12/doj-interview-unitedhealth-group-optum-doctors-health-cares-colossus/"
  },
  {
    "text": "Newsom says California wildfires will be one of the worst natural disasters in U.S. history  —  “I think it will be in terms of just the costs associated with it, in terms of the scale and scope,” the California governor said.  —  California Gov. Gavin Newsom told NBC News' “Meet the Press” … ",
    "url": "https://www.nbcnews.com/politics/politics-news/newsom-california-wildfires-worst-natural-disaster-us-history-rcna187313"
  }
]