[
  {
    "text": "JD Vance Says Trump's Comments About Kamala Harris' Racial Identity Were ‘Hysterical’  —  “I think he pointed out the fundamental chameleon-like nature of Kamala Harris,” Vance told reporters on his plane.  — Copy  —  PHOENIX — Sen. JD Vance told reporters it's “hysterical how much the media … ",
    "url": "https://www.notus.org/trump-2024/jd-vance-kamala-harris-race"
  },
  {
    "text": "Republicans reel at Trump's “embarrassing” remarks about Harris … - “It was awful,” one House Republican said of the interview, telling Axios it raised concerns about whether Trump can contain his impulses while running against the first woman, Black and Asian American vice president.",
    "url": "https://www.axios.com/2024/07/31/house-senate-republicans-trump-nabj-interview"
  },
  {
    "text": "Trump Aborts Interview after Smart Black Women Ask Tough Questions  —  I'm an outlier about the value of the disastrous interview Donald Trump just did with three Black women journalists: Rachel Scott, Kadia Goba, and Harris Faulkner.  I think the interview will help Trump reclaim the attention of the press.",
    "url": "https://www.emptywheel.net/2024/07/31/trump-aborts-interview-after-smart-black-women-ask-tough-questions/"
  },
  {
    "text": "Kelly says Trump's comments at NABJ are of a ‘desperate’ and ‘scared old man’  —  Sen. Mark Kelly (D-Ariz.) said former President Trump's attack on Vice President Harris's heritage at the National Association of Black Journalists (NABJ) convention on Wednesday revealed Trump to be a “desperate, scared old man.”",
    "url": "https://thehill.com/homenews/campaign/4804746-mark-kelly-kamala-harris-heritage-donald-trump-nabj/"
  },
  {
    "text": "Donald Trump falsely questions Kamala Harris' race as he appears at gathering of Black journalists  —  CHICAGO (AP) — Donald Trump falsely questioned Kamala Harris' race during an appearance before the National Association of Black Journalists in Chicago that quickly turned hostile on Wednesday.",
    "url": "https://apnews.com/article/trump-black-journalists-convention-nabj-1e96aa530e88013ed6f577feaf89ccb6"
  },
  {
    "text": "Harris VP Search Team Meets Shapiro While Labor Groups Oppose Kelly  — Democrat to choose running mate before swing-state tour  — Key groups on left look to influence Harris' decision  —  Pennsylvania Governor Josh Shapiro met with Kamala Harris' representatives … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-01/harris-vp-team-meets-josh-shapiro-as-labor-balks-at-mark-kelly"
  },
  {
    "text": "UAW Endorses Kamala Harris for President Ahead of Mass Rally in Detroit  —  On Wednesday, July 31, the UAW International Executive Board voted to endorse Kamala Harris for President of the United States.  Her historic candidacy builds on the Biden-Harris administration's proven track record … ",
    "url": "https://uaw.org/uaw-endorses-kamala-harris-for-president-ahead-of-mass-rally-in-detroit/"
  },
  {
    "text": "Trump Allies Believe Kellyanne Conway Is Badmouthing JD Vance  —  DONALD TRUMP'S 2024 PRESIDENTIAL CAMPAIGN is facing its biggest stress-test yet.  And already the pressure is widening subterranean cracks of mistrust and rivalry.  —  The fault lines emerged rapidly as Trump's VP pick … ",
    "url": "https://www.thebulwark.com/p/trump-allies-kellyanne-conway-badmouthing-vance"
  },
  {
    "text": "Accused Sept. 11 Plotters Agree to Plead Guilty at Guantánamo Bay  —  Word of the deal emerged in a letter from prosecutors to family members of victims of the attacks.  —  The man accused of plotting the attacks of Sept. 11 and two of his accomplices have agreed to plead guilty … ",
    "url": "https://www.nytimes.com/2024/07/31/us/politics/sept-11-guilty-plea.html"
  },
  {
    "text": "Iran's Leader Orders Attack on Israel for Haniyeh Killing, Officials Say  —  Iran's supreme leader, Ayatollah Ali Khamenei, ordered retaliation after a humiliating security failure, as Iran once again balances showing strength against the risk of escalation.",
    "url": "https://www.nytimes.com/2024/07/31/world/middleeast/iran-orders-attack-israel.html?unlocked_article_code=1._U0.WAar.cdqQVmQDYhAk&smid=em-share"
  },
  {
    "text": "Hamadeh defeats Masters in Arizona primary pitting Trump allies against each other  —  Former Arizona attorney general candidate Abe Hamadeh has won the Republican nomination for the House seat representing the state's 8th Congressional District, according to Decision Desk HQ.",
    "url": "https://thehill.com/homenews/campaign/4801722-arizona-election-results-blake-masters-abe-hamadeh/"
  },
  {
    "text": "First, Murdoch papers targeted me.  Now there is evidence they falsely implicated me in a cover-up  —  Asked why millions of News Group emails were deleted, Washington Post publisher Will Lewis pointed the finger at me  —  Blazoned across the top of every edition of the Washington Post is the statement “Democracy dies in darkness”.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/31/gordon-brown-tom-watson-news-international-william-lewis-rupert-murdoch"
  },
  {
    "text": "New Louisiana Law Serves as a Warning to Bystanders Who Film Police: Stay Away or Face Arrest  —  Louisiana is the fourth state to enact a so-called police buffer law, which allows officers to order people to keep their distance.  Journalists say the law will make it harder to document when police use excessive force.",
    "url": "https://www.propublica.org/article/louisiana-police-buffer-law"
  },
  {
    "text": "South Carolina Supreme Court rules death penalty by firing squad, other methods legal  —  The South Carolina Supreme Court ruled Wednesday that death by firing squad and other forms of execution commonly held to be cruel and unusual are legal in the state if the inmate requests the method of execution.",
    "url": "https://thehill.com/homenews/state-watch/4803976-south-carolina-supreme-court-death-penalty-firing-squad-legal/"
  },
  {
    "text": "Rudy Giuliani agrees to deal to end his bankruptcy case, pay creditors' financial adviser $400k  —  Rudy Giuliani has agreed to a last-minute deal to end his personal bankruptcy case and pay about $400,000 to a financial adviser hired by his creditors, avoiding a potential deep-dive into the former … ",
    "url": "https://apnews.com/article/giuliani-bankruptcy-freeman-moss-2020-election-f290be562d8ace055950a1d1768c9bfc"
  },
  {
    "text": "Army's $11 Million Deal With The Rock Backfires Spectacularly  —  ‘CATASTROPHIC’  —  The Army reportedly spent millions getting Dwayne ‘The Rock’ Johnson and his United Football League to drive up recruitment, only to end up losing enlistments.  —  The U.S. Army's $11 million advertising deal … ",
    "url": "https://www.thedailybeast.com/us-armys-dollar11-million-deal-with-the-rock-backfires-spectacularly"
  },
  {
    "text": "US Democrat Harris gets backing from more than 100 venture capitalists  —  More than 100 venture capitalists including entrepreneur Mark Cuban threw their support behind U.S. Democratic presidential candidate Kamala Harris on Wednesday, a counterweight to tech billionaires backing Republican rival Donald Trump.",
    "url": "https://www.reuters.com/world/us/more-than-100-venture-capitalists-throw-weight-behind-us-democrat-harris-2024-07-31/"
  }
]