[
  {
    "text": "Fani Willis Responds to GOP Backlash to Trump Case: ‘They Want to Come Up With This Foolishness’  —  ‘They worry the hero is treated the same as everybody else,’ the Fulton County, Georgia district attorney said  —  Fulton County, Ga., District Attorney Fani Willis is speaking up amid pushback … ",
    "url": "https://themessenger.com/politics/fani-willis-georgia-republican-senators-trump-case"
  },
  {
    "text": "Supreme Court will decide access to key abortion drug mifepristone  —  The Supreme Court announced Wednesday that it will decide this term whether to limit access to a key abortion drug, returning the polarizing issue of reproductive rights to the high court for the first time since … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/13/abortion-drug-supreme-court-mifepristone-fda/"
  },
  {
    "text": "Supreme Court agrees to hear showdown over abortion pill access  —  In a high-stakes legal battle, the Biden administration is defending federal approval of the abortion pill mifepristone, including a recent move to make it available by mail.  —  WASHINGTON — The Supreme Court on Wednesday took … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-agrees-hear-showdown-abortion-pill-access-rcna128185"
  },
  {
    "text": "House Set to Approve Biden Impeachment Inquiry as It Hunts for an Offense  —  Republicans are pushing forward with a formal investigation even though their yearlong scrutiny of the president and his family has turned up no proof of high crimes or misdemeanors.",
    "url": "https://www.nytimes.com/2023/12/13/us/politics/biden-impeachment-inquiry-house-vote.html"
  },
  {
    "text": "André Braugher Dies: Star Of ‘Homicide: Life On The Street’, ‘Brooklyn Nine-Nine’ & Other Series And Films Was 61  —  Co-Editor-in-Chief, Film  — VIBE Editor-In-Chief Datwon Thomas Takes Executive Producer, Talent Post At Dick Clark Productions  — Mort Engelberg Dies … ",
    "url": "https://deadline.com/2023/12/andre-braugher-dead-homicide-life-on-the-street-brooklyn-nine-nine-actor-1235665513/"
  },
  {
    "text": "We Were Told Biden Is Secretly Running the DOJ.  Why Is His Son Being Charged? … It has long been an article of faith on the right that Attorney General Merrick Garland is prosecuting Donald Trump because President Biden wants him to.  Even the Trump-skeptical corners … ",
    "url": "https://nymag.com/intelligencer/2023/12/bidens-justice-department-merrick-garland-independent-hunter-trump.html"
  },
  {
    "text": "Tesla to Recall More Than Two Million Vehicles Over Autopilot Safety Concerns  —  Move follows two-year investigation by the National Highway Traffic Safety Administration  —  Tesla will recall more than two million vehicles over concerns over its Autopilot system, following a two-year probe … ",
    "url": "https://www.wsj.com/business/autos/tesla-recalls-more-than-two-million-vehicles-over-autopilot-safety-concerns-274eb6e6?mod=followamazon"
  },
  {
    "text": "New York's high court just blew up the fight for control of the House  —  Here are five takeaways from the Tuesday's court ruling to redistrict New York — and what to know about the chaotic weeks ahead.  —  New York's high court gave Democrats a big leg up in the dogfight for control of the House of Representatives.",
    "url": "https://www.politico.com/news/2023/12/12/new-york-redistricting-house-00131434"
  },
  {
    "text": "Playbook: A protest that should worry Biden and Harris  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  IT'S A WRAP — “Climate summit makes ‘historic progress’ — but the world still can't quit oil,” by Karl Mathiesen, Zia Weise, Zack Colman … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/13/a-protest-that-should-worry-biden-and-harris-00131484"
  },
  {
    "text": "Santos: ‘I want to go back to Congress’  —  Former Rep. George Santos (R-N.Y.) said he'd be interested in returning to Congress, just two weeks after he was removed from office and wrote off Congress.  —  It's a stark reversal from previous comments about his future.  —  “Why would I want to stay here?",
    "url": "https://thehill.com/homenews/house/4357566-george-santos-wants-to-return-to-congress/"
  },
  {
    "text": "Contraception is a winning issue, conservative strategists tell GOP  —  Former Trump confidante Kellyanne Conway and other strategists are citing poll data showing strong demand among GOP voters for birth control after the fall of Roe.  —  Kellyanne Conway is going to Capitol Hill on Wednesday … ",
    "url": "https://www.politico.com/news/2023/12/13/kellyanne-conway-contraception-republicans-2024-00131410"
  },
  {
    "text": "Trump considers overhauling his approach to North Korea if he wins in 2024  —  The idea, which has been considered in other forms during years of U.S.-led negotiations with North Korea, would be a shift in Washington's overall approach to Pyongyang.  —  Donald Trump is considering a plan … ",
    "url": "https://www.politico.com/news/2023/12/13/trump-north-korea-nuclear-weapons-plan-00131469"
  },
  {
    "text": "Florida abortion rights activists win over Republicans in ballot measure push  —  An abortion rights group says more than 150,000 of the voters who have signed its petition to get protections into the state constitution are registered Republicans.  —  PINECREST, Fla.  — Jaymie Carter is a registered Republican.",
    "url": "https://www.nbcnews.com/politics/2024-election/florida-abortion-activists-win-republicans-ballot-measure-push-rcna129315"
  },
  {
    "text": "Michael D. Cohen's Lawyer Cited Cases That May Not Exist, Judge Says  —  Mr. Cohen, the onetime fixer for former President Donald J. Trump, went to prison after pleading guilty to campaign finance violations.  He wants the court to end his supervised release.",
    "url": "https://www.nytimes.com/2023/12/12/nyregion/cohen-trump-lawyer.html"
  },
  {
    "text": "The truth about Wreaths Across America  —  Wreaths Across America is a non-profit organization that places wreaths on the graves of military veterans.  It's a simple gesture that has proven popular.  Wreaths Across America placed 33,000 wreaths in 2007, its first year.",
    "url": "https://popular.info/p/the-truth-about-wreaths-across-america"
  },
  {
    "text": "‘Thank God they walked out’: Oregon's partisan divide highlights heightened animosity in statehouses  —  Republicans lawmakers in Oregon are banned from running for reelection after staging a six-week protest over guns, abortion and transgender issues.  —  Ten Oregon Republican senators … ",
    "url": "https://www.politico.com/news/2023/12/13/partisan-politics-oregon-walkout-00131348"
  },
  {
    "text": "Trump Legal Defense Fund's Biggest Expense Was Mar-a-Lago  —  New tax filings show that a legal defense fund for Trump isn't spending any money on legal services, but is dishing out for a party at Mar-a-Lago.  —  A legal defense fund for Donald Trump appears to have placed its spending priorities in a strange place: Mar-a-Lago.",
    "url": "https://www.thedailybeast.com/trump-legal-defense-funds-biggest-expense-was-mar-a-lago"
  },
  {
    "text": "Heartland/Rasmussen Poll: One-in-Five Mail-In Voters Admit to Committing at Least One Kind of Voter Fraud During 2020 Election  —  17% of mail-in voters admit that in 2020 they voted in a state where they are “no longer a permanent resident”  —  21% of mail-in voters admitted that they filled out a ballot for a friend or family member",
    "url": "https://heartland.org/opinion/heartland-rasmussen-poll-one-in-five-mail-in-voters-admit-to-committing-at-least-one-kind-of-voter-fraud-during-2020-election/"
  },
  {
    "text": "Trump Tries to Slow Down Appeals Court Review on ‘Presidential Immunity’  —  The former president's lawyers cited ‘How the Grinch Stole Christmas’ in a court filing on Wednesday arguing against a speedy briefing schedule … “The prosecution has one goal in this case: To unlawfully attempt to try … ",
    "url": "https://themessenger.com/politics/trump-appeals-court-review-presidential-immunity"
  },
  {
    "text": "Ten soldiers, including two senior officers, killed in Gaza fighting and deadly ambush  —  9 troops of Golani Brigade, Air Force's Unit 669, killed in one of the deadliest incidents of ground offensive so far, taking toll to 115; combat engineer killed in separate clash",
    "url": "https://www.timesofisrael.com/ten-soldiers-including-two-senior-officers-killed-in-gaza-fighting-and-deadly-ambush/"
  },
  {
    "text": "Israel Begins Pumping Seawater Into Hamas's Gaza Tunnels  —  Early effort to flood tunnels is one of several techniques aimed at destroying network that underpins Hamas's operations  —  Israel's military has begun pumping seawater into Hamas's vast complex of tunnels in Gaza … ",
    "url": "https://www.wsj.com/world/middle-east/israel-takes-fight-against-hamas-to-vast-tunnel-network-2ed3b3f2?mod=followamazon"
  },
  {
    "text": "Nude painting row at French school sparks teacher walkout  —  France's education minister has visited a school where some pupils refused to look at a painting of nude women in class, sparking a teacher walkout.  —  The pupils also accused their teacher of making racist and Islamophobic remarks, which the school denies.",
    "url": "https://www.bbc.com/news/world-europe-67691484"
  },
  {
    "text": "White House lays out offer on immigration changes in talks with Congress  —  Washington — The Biden administration on Tuesday indicated to congressional lawmakers that it would be willing to support a new border authority to expel migrants without asylum screenings, as well as a dramatic expansion … ",
    "url": "https://www.cbsnews.com/news/immigration-white-house-congress-border-security-detention-deportation/"
  }
]