[
  {
    "text": "A Plaintive Cry For Election Reforms Before It's Too Late  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  It Doesn't Have To Be This Way  —  As voting wraps up across the country today, let me take a quick step … ",
    "url": "https://talkingpointsmemo.com/morning-memo/election-reforms-campaign-finance-dark-money-oligarchy"
  },
  {
    "text": "How the Election Could Unfold: Four Scenarios  —  A look at plausible outcomes that might wind up seeming obvious in hindsight.  —  The 2024 election is close and deeply uncertain.  —  One reason?  On paper, neither side ought to win.  —  For Democrats, it's a textbook challenge.",
    "url": "https://www.nytimes.com/2024/11/05/upshot/election-scenarios-polls.html?unlocked_article_code=1.Xk4.9EQX.lzjBH_RZ4PO9&smid=url-share"
  },
  {
    "text": "Trump votes in his “last” election: “I don't even want to think about losing” … - He also cast doubt on the efficiency and reliability of voting machines, and called it an “absolute outrage” that key states take so long to count ballots.  — But Trump did say there will be “no violence” … ",
    "url": "https://www.axios.com/2024/11/05/trump-votes-election-fair-declare-victory"
  },
  {
    "text": "What to watch — and what to avoid — on election night  —  It's not about where to watch.  It's about how to watch.  —  Well, we made it.  It's Election Day.  —  Today could go down as one of the most important days in the history of our country as the nation decides between Vice President Kamala Harris … ",
    "url": "https://www.poynter.org/commentary/2024/what-to-watch-what-to-avoid-election-night/"
  },
  {
    "text": "Harris and Trump tie in Dixville Notch midnight vote to kick off Election Day  —  Vice President Kamala Harris and former President Donald Trump have tied with three votes each in the tiny New Hampshire township of Dixville Notch, kicking off Election Day in one of the first places in the country to report its presidential preference.",
    "url": "https://www.cnn.com/2024/11/05/politics/dixville-notch-new-hampshire-2024-results/"
  },
  {
    "text": "X's plan to interfere with the election  —  With polls essentially tied and hours to go until Election Day, no one knows for certain who will win the 2024 US presidential election.  But we can say with some certainty what will happen if the result is anything other than a landslide victory for Donald Trump … ",
    "url": "https://www.platformer.news/x-election-elon-musk-voter-fraud-misinformation/"
  },
  {
    "text": "The MAGA Propaganda Machine Has Successfully Censored Voices Calling Out its Lies  —  In 2020, the U.S. found itself in the midst of an unprecedented election—one defined not only by candidates or policies, but by a fight over what was real.  During that election, I was one of the leaders … ",
    "url": "https://www.theunpopulist.net/p/the-maga-propaganda-machine-has-successfully"
  },
  {
    "text": "Georgia secretary of state blames polling place bomb threat on Russians  —  (This story was updated with additional information.)  —  Georgia Secretary of State Brad Raffensperger confirmed Tuesday a bomb threat was made against a polling place, but he said it was of Russian origin and not credible.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/11/05/georgia-bomb-threat-russians/76068592007/"
  },
  {
    "text": "Non-credible bomb threats against Atlanta-area polling places were from Russia, secretary of state says  —  Several non-credible bomb threats that briefly disrupted voting at two Georgia polling places originated from Russia, Georgia Secretary of State Brad Raffensperger told reporters Tuesday.",
    "url": "https://www.cnn.com/2024/11/05/us/georgia-non-credible-bomb-threat-russia/"
  },
  {
    "text": "More Than 80 Million Americans Cast Early Ballots  —  Despite sporadic mishaps, the early voting season went relatively smoothly, both in person and by mail.  —  More than 80 million voters cast an early ballot either by mail or in person in a weekslong early voting season that was defined by a relatively seamless process.",
    "url": "https://www.nytimes.com/2024/11/05/us/politics/80-million-early-votes.html"
  },
  {
    "text": "Nicolle Wallace on Vance calling Harris ‘trash:’ ‘You just effed up’  —  MSNBC's Nicolle Wallace said Monday that Ohio Sen. JD Vance, the Republican vice presidential nominee, “effed up” by calling Vice President Harris “trash.”  —  “In my humble view, lights out,” Wallace said on “Deadline: White House.”",
    "url": "https://thehill.com/homenews/campaign/4972454-nicolle-wallace-on-vance-calling-harris-trash-you-just-effed-up/"
  },
  {
    "text": "Remembering Bernie Marcus  —  BERNIE'S STORY  —  The Home Depot is deeply saddened by the passing of our beloved founder, Bernard Marcus.  To us, he was simply “Bernie.”  —  Bernie was an inspiration in many ways.  He was a master merchant and a genius with customer service.",
    "url": "https://corporate.homedepot.com/news/company/remembering-bernie-marcus"
  },
  {
    "text": "MAGA outrage over wives voting for Kamala Harris is funny — but it's also dangerous  —  When it comes to political bait, it was the tastiest sort: a cheeky ad run by Vote Common Good, and voiced by Julia Roberts, reminding women that they don't have to tell their husbands if they vote for Vice President Kamala Harris.",
    "url": "https://www.salon.com/2024/11/05/bracing-for-magas-backlash-the-strategy-behind-secret-kamala-harris-is-safety/"
  },
  {
    "text": "A random number generator determined the “favorite” in our forecast  —  So fine: let's go to the tiebreaker round.  —  ∙ Paid  —  When I say the odds in this year's presidential race are about as close as you can possibly get to 50/50, I'm not exaggerating.",
    "url": "https://www.natesilver.net/p/a-random-number-generator-determined"
  },
  {
    "text": "Musk tells Rogan X won't be allowed to ‘exist’ if Harris wins  —  Elon Musk, the billionaire owner of X and prominent supporter of former President Trump, claimed Monday that his social media platform will not be allowed to “exist” if Vice President Harris wins the election.",
    "url": "https://thehill.com/policy/technology/4972746-elon-musk-x-advertiser-boycott/"
  },
  {
    "text": "Man convicted in 9/11-style plot to kill Americans  —  A man accused of being a Somalian terror group operative has been convicted of a 9/11-style plot to kill Americans, the Justice Department said Monday.  —  The Justice Department said in a press release that a 34-year-old Kenyan named … ",
    "url": "https://thehill.com/regulation/court-battles/4972836-somalian-terror-group-convicted/"
  },
  {
    "text": "He's an Arab mayor in Michigan.  Here's why he's unapologetically pro-Trump.  —  Dearborn Heights Mayor Bill Bazzi believes Trump is “a man of peace.” … DEARBORN HEIGHTS, Michigan — Bill Bazzi, the mayor of Dearborn Heights, was all smiles when we met in his office yesterday, on Election Day eve.",
    "url": "https://www.politico.com/news/2024/11/05/donald-trump-bill-bazzi-michigan-gaza-00187395"
  },
  {
    "text": "Judges deny requests to block DOJ from monitoring polls  —  Federal judges denied two states' requests to bar the Justice Department (DOJ) from dispatching lawyers to monitor adherence to federal voting rights laws on Election Day.  —  Both Missouri and Texas asked federal courts to keep DOJ lawyers away from their polls.",
    "url": "https://thehill.com/regulation/court-battles/4972091-judge-wont-block-doj-election-poll-monitors/"
  },
  {
    "text": "Trump Campaign Finishes the Election by Taking Revenge on the Media  —  With hours until the polls close, the Trump campaign is punishing reporters over critical stories either they or their outlets have written in recent days.  —  Politico had three reporters and a photographer credentialed … ",
    "url": "https://nymag.com/intelligencer/article/trump-campaign-election-media.html"
  },
  {
    "text": "Literal Neo-Nazi Leader Endorses Trump  —  NSC-131 founder Chris Hood says Trump vote will help “preserve and improve” plight of race separatists … In a long statement on Telegram, Hood described Trump as providing a small step forward to his goal of “ultimate victory,” … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-endorsement-neo-nazi-leader-nsc-131-1235154089/"
  },
  {
    "text": "Native American voters saved Tester before.  They may fall short this time.  —  Absentee ballot returns are lowest in Montana's three majority-Native American counties, where organizers battle misinformation and long distances in turning voters out to the polls.",
    "url": "https://www.politico.com/news/2024/11/05/jon-tester-native-american-vote-00187238"
  },
  {
    "text": "Republican mega-donors asked their employees who they will vote for in survey  —  Staunchly pro-Trump Uihleins gave anonymous survey to workers at Uline, headquartered in swing state of Wisconsin  —  The Republican mega-donors Dick and Liz Uihlein, who are the third largest donors … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/04/election-republican-uline-survey"
  }
]