[
  {
    "text": "Maryanne Trump Barry, Donald Trump's Older Sister, Dies at 86  —  A retired federal judge in New Jersey, she supported her brother but, as secret audio recordings revealed in 2019, she could also be scathingly critical of him.  —  Maryanne Trump Barry, a former federal judge who was an older sister … ",
    "url": "https://www.nytimes.com/2023/11/13/us/politics/maryanne-trump-barry-dead.html"
  },
  {
    "text": "Maryanne Trump Barry, older sister of Donald Trump, has died at 86: Sources  —  Barry was a senior judge on the U.S. Court of Appeals until 2019.  —  Donald Trump, Maryanne Trump, and Robert Trump during Opening of Donald Trump's Taj Mahal Casino in April 5, 1990 at Taj Mahal Hotel and Casino in Atlantic City, N.J.",
    "url": "https://abcnews.go.com/Politics/maryanne-trump-barry-older-sister-donald-trump-died/story?id=104846289"
  },
  {
    "text": "I Was Obama's 2012 Campaign Manager.  There's No Need to Panic Over Biden.  —  Don't sweat the doom and gloom polling.  We've been here before.  —  As you walk into my office, the first thing you see is a framed magazine cover.  It's not from the days of triumph — like in November 2012 … ",
    "url": "https://www.politico.com/news/magazine/2023/11/13/obama-2012-campaign-manager-advice-00126736"
  },
  {
    "text": "Here's How Biden Can Turn It Around  —  Top Democrats agree that the president needs more aggressiveness, more help from his friends and a few more friends.  Liz Cheney, Rahm Emanuel and Mitt Romney can help.  —  Just under one year before the presidential election, Democrats should be concerned … ",
    "url": "https://www.politico.com/news/magazine/2023/11/13/biden-2024-reelection-challenges-strategy-00126776"
  },
  {
    "text": "New book details Trump lawyers' secret meeting with Jack Smith ahead of DC indictment  —  ABC's Jonathan Karl offers an account of a fateful July 27 meeting in his forthcoming book.  —  Jack Smith's public image, shaped by his near invisibility since taking over the federal criminal cases … ",
    "url": "https://www.politico.com/news/2023/11/13/book-trump-lawyers-meeting-jack-smith-00126681"
  },
  {
    "text": "Scoop: Trump hung up on Kim Kardashian, new Jonathan Karl book says  —  Former President Trump hung up on Kim Kardashian when she called for help with a clemency case — because he assumed she voted for President Biden, ABC News' Jonathan Karl writes in “Tired of Winning,” out Tuesday.",
    "url": "https://www.axios.com/2023/11/13/trump-biden-white-house-kim-kardashian-book"
  },
  {
    "text": "Secret Service agents protecting Biden's granddaughter open fire when 3 people try to break into SUV  —  Secret Service agents protecting President Joe Biden's granddaughter opened fire after three people tried to break into an unmarked Secret Service vehicle in the nation's capital, a law enforcement official told The Associated Press.",
    "url": "https://apnews.com/article/naomi-biden-secret-service-shooting-washington-georgetown-997126378e864c5acd0c9a1c6618c4e2"
  },
  {
    "text": "Trump calls political enemies ‘vermin,’ echoing dictators Hitler, Mussolini  —  On Veterans Day, the former president vowed to “root out” his liberal opponents, drawing backlash from historians who say his rhetoric is reminiscent of authoritarians  —  Former president Donald Trump denigrated … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/12/trump-rally-vermin-political-opponents/"
  },
  {
    "text": "South Carolina Sen. Tim Scott abruptly ends 2024 presidential bid, shocking even his campaign staff  —  Republican presidential candidate Tim Scott abruptly announced late Sunday that he was dropping out of the 2024 race, a development that surprised his donors and stunned his campaign staff … ",
    "url": "https://apnews.com/article/tim-scott-drops-out-2024-race-b9cc8fbeba57a123789d8d0484164e38"
  },
  {
    "text": "Behind the Curtain: Trump allies pre-screen loyalists for unprecedented power grab … - His top obsession will be the Justice Department, the FBI and the intelligence community — all of which he thinks conspired to investigate him, thwart him, screw him.",
    "url": "https://www.axios.com/2023/11/13/trump-loyalists-2024-presidential-election"
  },
  {
    "text": "Stephen Miller's “America First Legal” is more dangerous than you think  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please consider signing up.  Just click the button below.  —  Click for Public Notice free trial",
    "url": "https://www.publicnotice.co/p/stephen-miller-america-first-legal-explained"
  },
  {
    "text": "Sinema left the Democratic Party.  Democratic donors left her too.  —  A POLITICO analysis of campaign finance data reveals a tough road ahead if the Arizona independent runs for reelection.  —  Democratic donors have fled Sen. Kyrsten Sinema since she left the party … ",
    "url": "https://www.politico.com/news/2023/11/13/kyrsten-sinema-donors-democrats-00126676"
  },
  {
    "text": "Democrat Dean Phillips says he'll vote for Speaker Johnson's CR proposal  —  Rep. Dean Phillips (D-Minn.), who is mounting a long-shot bid for the Democratic presidential nomination, will return to the Capitol this week to vote in favor of Speaker Mike Johnson's (R-La.) plan to avert a government shutdown … ",
    "url": "https://thehill.com/homenews/house/4307165-democrat-dean-phillips-says-hell-vote-for-speaker-johnsons-cr-proposal/"
  },
  {
    "text": "Pro-Hitler and Holocaust denier account: X has paid me $3,000 in ad revenue sharing  —  Musk and Yaccarino's X has been placing ads for BetMGM, DraftKings, and FanDuel on the pro-Hitler account  —  There's more bad news for brands that advertise on X (formerly Twitter): They're helping financially reward pro-Adolf Hitler propaganda.",
    "url": "https://www.mediamatters.org/twitter/pro-hitler-and-holocaust-denier-account-x-has-paid-me-3000-ad-revenue-sharing"
  },
  {
    "text": "‘QAnon Shaman’ who stormed the Capitol on Jan. 6 files paperwork to run for Congress  —  Jacob Chansley, who served about 27 months in prison for his role in the Capitol attack, filed to run for the seat left vacant by Rep. Debbie Lesko, R-Ariz.  —  Jacob Chansley, the Arizona man known as the … ",
    "url": "https://www.nbcnews.com/politics/2024-election/qanon-shaman-stormed-capitol-jan-6-files-paperwork-run-congress-rcna124858"
  },
  {
    "text": "Israel-Hamas war live updates: Al Shifa hospital in Gaza no longer functioning, WHO says … Just now  —  Erin McLaughlin  —  TEL AVIV — The situation at Al-Shifa hospital in Gaza is “extremely difficult and dangerous,” the head of neurosurgery at the hospital told NBC News this morning.",
    "url": "https://www.nbcnews.com/news/world/live-blog/israel-hamas-war-live-updates-rcna124850"
  }
]