[
  {
    "text": "Volkswagen workers in Tennessee pass historic vote to unionize  —  Victory marks the first win in the United Auto Workers campaign to organize the Southern factories of a dozen automakers  —  Volkswagen workers in Chattanooga, Tenn., passed a historic vote to join the United Auto Workers on Friday … ",
    "url": "https://www.washingtonpost.com/business/2024/04/19/vw-uaw-tennessee-vote/"
  },
  {
    "text": "Biden celebrates Tennessee Volkswagen plant's vote to join UAW  —  President Biden celebrated the “historic vote” Friday for workers at a Tennessee Volkswagen plant to join the United Auto Workers (UAW) union.  —  “Congratulations to the workers at Volkswagen in Chattanooga, Tennessee … ",
    "url": "https://thehill.com/homenews/state-watch/4608235-biden-celebrates-tennessee-volkswagen-plant-vote-join-uaw/"
  },
  {
    "text": "Playbook: How the push to unseat Johnson could unfold  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT UNION JOE IS READING — “Tennessee workers at VW plant vote to unionize with UAW,” by The Tennessean's Todd Price and Gary Estwick … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/20/how-the-push-to-unseat-johnson-could-unfold-00153483"
  },
  {
    "text": "Trump forced to listen silently to people insulting him as he trades a cocoon of adulation for court  —  He seems “selfish and self-serving,” said one woman.  The way he carries himself in public “leaves something to be desired,” said another.  —  His “negative rhetoric and bias,” said another man, is what is “most harmful.”",
    "url": "https://apnews.com/article/trump-trial-jurors-hush-money-criticism-b4fe05a61ed566a587523d1120b46a76"
  },
  {
    "text": "Where Jurors in Trump Hush-Money Trial Say They Get Their News  —  Prosecutors and defense lawyers tried to divine the political leanings of prospective jurors in the former president's Manhattan criminal trial from their answers to questions about what media they consume.",
    "url": "https://www.nytimes.com/2024/04/19/nyregion/trump-trial-jury-news.html"
  },
  {
    "text": "Rep. Don Bacon: ‘Ukraine will likely fall’ if US doesn't pass foreign aid bill  —  Rep. Don Bacon (R-Neb.) said Saturday that “Ukraine will likely fall” if the U.S. is unable to approve more aid to the embattled country amid its war with Russia.  —  “Now, if we don't get this aid passed … ",
    "url": "https://thehill.com/homenews/house/4608237-rep-don-bacon-ukraine-will-likely-fall-if-us-doesnt-pass-foreign-aid-bill/"
  },
  {
    "text": "‘We Just Finally Saw the Dam Break’: How House Republicans Embraced the Chaos  —  Veteran Rep. Tom Cole is fed up with his party's insurgents.  —  Speaker Mike Johnson is on the verge of his biggest legislative victory yet — and it might mean his undoing.",
    "url": "https://www.politico.com/news/magazine/2024/04/20/grow-up-a-veteran-republican-is-tired-of-his-partys-insurgents-00153454"
  },
  {
    "text": "Russia's War Against Evangelicals  —  After they beat Azat Azatyan so bad blood came out of his ears; after they sent electric shocks up his genitals; after they wacked him with pipes and truncheons, the Russians began to interrogate him about his faith.  “When did you become a Baptist?",
    "url": "https://time.com/6969273/russias-war-against-evangelicals/"
  },
  {
    "text": "How R.F.K. Jr. Got on the Michigan Ballot, With Only Two Votes  —  The independent candidate persuaded a tiny party to give him its line on the ballot in a key 2024 battleground state, sparing him a costly, arduous organizing effort.  —  In January, when Doug Dern, the state chairman … ",
    "url": "https://www.nytimes.com/2024/04/20/us/politics/rfk-jr-michigan-ballot.html"
  },
  {
    "text": "NY AG asks Trump civil fraud judge to declare $175M bond ‘without effect’  —  The New York attorney general's office has asked a judge to void the $175 million bond former President Trump secured to put off paying the larger monetary damage award in his civil fraud case.",
    "url": "https://thehill.com/regulation/court-battles/4606053-ny-ag-trump-civil-fraud-judge-declare-175m-bond-without-effect/"
  },
  {
    "text": "Buck takes swing at ‘Moscow Marjorie’: She is just ‘mouthing the Russian propaganda’  —  Former Rep. Ken Buck (R-Colo.) went after Rep. Marjorie Taylor Greene (R-Ga.) for her anti-Ukraine position in an interview on CNN Friday.  —  “Moscow Marjorie has reached a new low,” … ",
    "url": "https://thehill.com/homenews/house/4608004-buck-takes-swing-moscow-marjorie-mouthing-russian-propaganda/"
  },
  {
    "text": "Republicans Just Found a Loophole to Answer Their Abysmal Fundraising  —  AND THE LAW WON  —  Republicans finally had a good fundraising quarter.  But underneath the good headlines are some stark truths—and an FEC rule that could give Republicans a big boost.",
    "url": "https://www.thedailybeast.com/republicans-just-found-a-loophole-to-answer-their-abysmal-fundraising"
  },
  {
    "text": "The Greatest Book a Politician Ever Wrote  —  The late Bob Graham's book is everything politics should be.  —  The bellhop at the Orlando hotel delivered a large red bag to the Cypress Penthouse, where he was met at the door by a woman in a green-and-white dress with a green-and-white “Shevin for Governor” sash around her neck.",
    "url": "https://www.politico.com/news/magazine/2024/04/20/bob-graham-political-book-00153402"
  },
  {
    "text": "Four ‘Three Percenter’ militia members sentenced to prison over Jan. 6 charges  —  Four “Three Percenter” militia members were sentenced to prison Friday over charges related to the Jan. 6, 2021 Capitol riot, according to a press release from the U.S. Attorney's Office for the District of Columbia.",
    "url": "https://thehill.com/regulation/court-battles/4608101-three-percenter-militia-members-sentenced-prison-jan-6-charges/"
  },
  {
    "text": "Political Warfare and Congress  —  The essence of “political warfare,” in the sense defined by the Chinese communist party, is that Beijing uses media, psychology, and law to induce adversaries to do things counter to their own interests.  —  Political warfare works through you or it does not work.",
    "url": "https://snyder.substack.com/p/political-warfare-and-congress"
  }
]