[
  {
    "text": "The ‘Landslide’ That Wasn't: Trump and Allies Pump Up His Narrow Victory  —  The latest vote count shows that Donald J. Trump won the popular vote by one of the smallest margins since the 19th century.  But Mr. Trump claims a “powerful mandate.”  —  On the night he won a second term … ",
    "url": "https://www.nytimes.com/2024/11/22/us/politics/trump-election-landslide.html"
  },
  {
    "text": "Trump expected to offer Kelly Loeffler secretary of Agriculture  —  President-elect Donald Trump is expected to offer Kelly Loeffler the job of secretary of the Department of Agriculture, two people familiar with the matter told CNN.  —  He is set to meet with her at Mar-a-Lago Friday afternoon … ",
    "url": "https://www.cnn.com/2024/11/22/politics/kelly-loeffler-trump-agriculture-department"
  },
  {
    "text": "Matt Gaetz says he's not returning to Congress next year  —  Former Florida Rep. Matt Gaetz, who withdrew from consideration as President-elect Donald Trump's pick for attorney general on Thursday, said Friday he will not be returning to Congress next year.  —  “I'm still going to be in the fight … ",
    "url": "https://www.cnn.com/2024/11/22/politics/gaetz-not-rejoining-congress"
  },
  {
    "text": "Trump Is Pissed at True Reports His Victory Wasn't Exactly a Landslide  —  Donald Trump is upset with the media for accurately reporting that his election night victory wasn't exactly a “landslide.”  —  Trump transition team spokeswoman Karoline Leavitt on Friday took aim at Politico … ",
    "url": "https://newrepublic.com/post/188744/trump-pissed-reports-didnt-win-landslide-election-results"
  },
  {
    "text": "Trump Won Less Than 50 Percent.  Why Is Everyone Calling It a Landslide?  —  Right and left have bought the narrative of a crushing triumph.  They're wrong.  —  Is it newsworthy that Donald Trump's share of the 2024 presidential vote has fallen below 50 percent?",
    "url": "https://www.politico.com/news/magazine/2024/11/22/trump-win-popular-vote-below-50-percent-00190793"
  },
  {
    "text": "Trump expected to name Kelly Loeffler for Agriculture secretary  —  President-elect Trump is expected to name former Sen. Kelly Loeffler (R-Ga.) to serve as secretary of Agriculture, a source close to the transition told The Hill.  —  Loeffler is currently the co-chair of Trump's second inaugural committee … ",
    "url": "https://thehill.com/homenews/administration/5005064-trump-kelly-loeffler-agriculture-secretary/"
  },
  {
    "text": "Florida sets special election to fill Matt Gaetz vacancy on April Fools' Day  —  Gaetz resigned his seat and isn't returning to Congress, setting off jockeying among Republicans for the seats.  —  MIAMI — Florida will conduct a special election on April 1, 2025, to fill the House seat vacated … ",
    "url": "https://www.politico.com/news/2024/11/22/matt-gaetz-replacement-election-00191323"
  },
  {
    "text": "Gabbard nomination puts Senate GOP in a bind … That panel — which is responsible for processing Gabbard's nomination — is stacked with hawks on both sides of the dais. … But GOP senators are already indicating they'll be interested in probing Gabbard's controversial … ",
    "url": "https://punchbowl.news/article/senate/gabbard-nomination-senate-gop-in-bind/"
  },
  {
    "text": "Now GOP Senators Want Another Trump Nominee's Full FBI File  —  JUST A LITTLE PEEK  —  An alignment between Russia and Tulsi Gabbard is worrying some Senate Intelligence Committee members.  —  Some Republican senators are privately eager to see Tulsi Gabbard's FBI file … ",
    "url": "https://www.thedailybeast.com/republican-senators-would-like-to-see-tulsi-gabbards-fbi-file-report/"
  },
  {
    "text": "Trump's transition team turns to Project 2025 after disavowing it during the campaign  —  Transition officials have used Project 2025's extensive personnel database to identify potential hires for the incoming administration, a person familiar with the plans said.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-team-turns-project-2025-disavowing-effort-campaign-rcna180689?taid=6740aaf204c1de00019795bd"
  },
  {
    "text": "New York judge delays Trump hush money sentencing  —  President-elect Trump's sentencing in his New York criminal case will not go forward as planned next week as his attorneys push to dismiss the prosecution following his election victory.  —  Judge Juan Merchan, who oversees the trial proceedings … ",
    "url": "https://thehill.com/regulation/court-battles/5004552-trump-hush-money-sentencing-delayed/"
  },
  {
    "text": "Texas Board of Education votes to approve Bible curriculum in elementary schools  —  The curriculum adopted by the state education board, which is controlled by elected Republicans, is optional for schools, but they will receive additional funding if they implement it.",
    "url": "https://www.nbcnews.com/news/us-news/texas-board-education-votes-approve-bible-curriculum-elementary-school-rcna181415"
  },
  {
    "text": "Trump's Pentagon pick Hegseth wrote of US military taking sides in ‘civil war’  —  Defense secretary pick said in 2020 that should Democrats win election the military ‘will be forced to make a choice’  —  Pete Hegseth, Donald Trump's pick for defense secretary, has written in a book … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/22/trump-defense-secretary-pete-hegseth-book"
  },
  {
    "text": "Elon Musk Gets a Crash Course in How Trumpworld Works  —  The world's richest person, not known for his humility, is still learning the cutthroat courtier politics of Donald Trump's inner circle — and his ultimate influence remains an open question.  —  For the first 53 years of his life … ",
    "url": "https://www.nytimes.com/2024/11/22/us/politics/elon-musk-trump.html"
  },
  {
    "text": "Bird flu confirmed in child for first time in US: CDC  —  The Centers for Disease Control and Prevention (CDC) confirmed that bird flu was found in a child in California, according to a press release issued Friday.  —  The case is the first reported infection in a child in the U.S., according to the release.",
    "url": "https://thehill.com/policy/healthcare/5005185-bird-flu-confirmed-in-child-for-first-time-in-us-cdc/"
  },
  {
    "text": "More details about JFK assassination keep emerging, even 61 years later  —  Sixty-one years ago, on November 22, 1963, President John F. Kennedy was assassinated in Dallas, Texas, in a shocking tragedy that still echoes.  —  The JFK assassination sent the nation into mourning and shook it to its core … ",
    "url": "https://www.usatoday.com/story/news/nation/2024/11/22/president-john-f-kennedy-assassinated-61-years-ago/76497785007/"
  },
  {
    "text": "Kim Jong Un's Message to Trump: We're Not Interested  —  North Korean dictator has fewer reasons to seek sanctions relief from the U.S. and has played down the need for disarmament talks  —  SEOUL—North Korean leader Kim Jong Un appeared to rebuff the prospect of reviving his nuclear diplomacy … ",
    "url": "https://www.wsj.com/world/asia/kim-jong-uns-message-to-trump-were-not-interested-243210c1"
  },
  {
    "text": "The Trump-Trumpist Divide  —  Sign up for The Decision, a newsletter featuring coverage of the 2024 race and what comes next.  —  Members of Donald Trump's inner circle understandably wish to interpret the election results as a mandate for the most extreme right-wing policies … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/trump-promises-popularity/680730/?gift=47TjPNd1fvywdLyCkprj-L-pq0Ur2kV2qRY2QlN3zkk&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Kennedy's ‘MAHA transition team’ includes anti-vax activists  —  At least three informal advisers connected to the anti-vaccine movement are assisting Kennedy in filling out his staff as he prepares to lead HHS.  —  Robert F. Kennedy Jr. is enlisting associates with close ties … ",
    "url": "https://www.politico.com/news/2024/11/22/kennedy-anti-vax-activists-transition-team-00191306"
  },
  {
    "text": "DOJ halts random DEA passenger searches at transportation facilities  —  The Department of Justice has stopped random Drug Enforcement Administration passenger searches “mass transportation facilities,” such as airports, as of Thursday, after the department's inspector general found concerns with how such searches were being conducted.",
    "url": "https://thehill.com/policy/transportation/5004725-dea-passenger-searches-stopped/"
  }
]