[
  {
    "text": "Trump won't rule out seeking a third term in the White House, tells NBC News ‘there are methods’ for doing so  —  President Donald Trump said in a Sunday-morning phone call that he was “not joking” about a third term, adding that “it is far too early to think about it.”",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-third-term-white-house-methods-rcna198752"
  },
  {
    "text": "Trump says he's ‘very angry’ and ‘pissed off’ at Putin during an NBC News interview  —  Trump said in an early-morning phone call that if he believes Russia is at fault for a ceasefire not being reached with Ukraine, he may impose secondary tariffs on Russian oil.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-angry-putin-zelenskyy-iran-sanctions-rcna198729"
  },
  {
    "text": "Trump is ‘not joking’ about third term, though Constitution says he can't serve  —  President Trump said “there are methods” that would allow him to serve a third term in office — despite the two-term limit mandated by the Constitution.  —  His remarks came during a wide-ranging phone interview with NBC News on Sunday.",
    "url": "https://www.npr.org/2025/03/30/g-s1-57231/trump-third-term"
  },
  {
    "text": "Trump Says He's ‘Not Joking’ About Seeking a Third Term in Defiance of Constitution  —  President Trump, in an interview with NBC News, said there were “methods” that would allow a third term.  The 22nd Amendment prohibits a person from being elected to more than two terms as president.",
    "url": "https://www.nytimes.com/2025/03/30/us/politics/trump-third-term.html"
  },
  {
    "text": "Trump Says He 'Couldn't Care Less' if Car Prices Go Up  —  If 25% tariff on imported vehicles makes foreign cars more expensive, president says, that would boost sales of U.S.-made vehicles  —  WASHINGTON—President Trump said he “couldn't care less” if foreign automakers raise their prices … ",
    "url": "https://www.wsj.com/politics/policy/trump-says-he-couldnt-care-less-if-car-prices-go-up-b9b4a211"
  },
  {
    "text": "Elon Musk hands out $1 million payments after Wisconsin Supreme Court declines request to stop him  —  Elon Musk gave out $1 million checks on Sunday to two Wisconsin voters, declaring them spokespeople for his political group, ahead of a Wisconsin Supreme Court election that the tech billionaire cast … ",
    "url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-giveaway-cdea66e0dcbaa53dd183e1d10bee2b35"
  },
  {
    "text": "Mike Waltz Is Losing Support Inside the White House  —  Although Trump decided not to fire his national security adviser over the Signal group chat, Waltz's position is tenuous, officials say  —  WASHINGTON—President Trump has decided for now not to fire his national security adviser … ",
    "url": "https://www.wsj.com/politics/policy/mike-waltz-is-losing-support-inside-the-white-house-2b17459c?st=taX7tv&reflink=desktopwebshare_permalink"
  },
  {
    "text": "‘Climate of fear’: Montreal doctor says NYU cancelled her presentation  —  A Montreal doctor says her presentation at NYU was abruptly cancelled and believes the university did so out of fear of being pressured by the Donald Trump administration.  Dr. Joanne Liu, the former international president … ",
    "url": "https://www.ctvnews.ca/montreal/article/climate-of-fear-montreal-doctor-says-nyu-cancelled-her-presentation/"
  },
  {
    "text": "FBI raids home of prominent computer scientist who has gone incommunicado … A prominent computer scientist who has spent 20 years publishing academic papers on cryptography, privacy, and cybersecurity has gone incommunicado, had his professor profile, email account, and phone number removed … ",
    "url": "https://arstechnica.com/security/2025/03/computer-scientist-goes-silent-after-fbi-raid-and-purging-from-university-website/"
  },
  {
    "text": "Fire at New Mexico Republican Party Headquarters Being Investigated as Arson  —  Officials confirmed that the headquarters had been damaged in a fire, which the Republican Party called a “deliberate act of arson.”  —  The headquarters of the Republican Party of New Mexico in Albuquerque … ",
    "url": "https://www.nytimes.com/2025/03/30/us/politics/republican-party-new-mexico-fire-arson.html"
  },
  {
    "text": "Trump's Latest Bid to Rewrite Reality  —  WHEN I WAS A TEENAGER, I won an award that I didn't understand, named for someone I'd never heard of: the Peter Goldin Memorial Award for Outstanding Achievement in Literature.  —  I still don't know who Peter Goldin was, but I like to think the award must … ",
    "url": "https://www.thebulwark.com/p/trump-latest-bid-to-rewrite-reality-smithsonian-statues-executive-order-history-whitewash"
  },
  {
    "text": "Trump is using the power of government to punish opponents.  They're struggling to respond  —  President Donald Trump is using the power of the federal government to intimidate or neuter potential sources of opposition to him: The legal establishment, academia and prominent cultural institutions … ",
    "url": "https://cnn.com/2025/03/30/politics/trump-punish-opponents"
  },
  {
    "text": "Universities Should Challenge Trump's Speech-Based Deportations of Students in Court [Updated]  —  The Trump administration has been detaining and trying to deport immigrant and foreign students for their First-Amendment protected speech.  That includes even speech that does not actually support terrorism … ",
    "url": "https://reason.com/volokh/2025/03/30/universities-should-challenge-trumps-speech-based-deportations-of-students-in-court/"
  },
  {
    "text": "‘Mission South Africa’: How Trump Is Offering White Afrikaners Refugee Status  —  The United States has banned most refugees, including 20,000 people who were already approved for entry before President Trump took office.  But Mr. Trump is making one exception.",
    "url": "https://www.nytimes.com/2025/03/30/us/politics/trump-south-africa-white-afrikaners-refugee.html"
  },
  {
    "text": "Trump calls ‘never ending’ Signal leak story ‘old and boring,’ blasts media  —  President Trump slammed the media for its “never ending” coverage of the Signal group chat leak, calling it “old and boring.”  —  In a post Sunday on Truth Social, Trump praised Sen. Markwayne Mullin (R-Okla.) … ",
    "url": "https://thehill.com/homenews/administration/5222684-trump-calls-never-ending-signal-leak-story-old-and-boring-blasts-media/"
  },
  {
    "text": "Scoop: White House to take charge of briefing-room seating chart  —  The White House plans to impose its own seating chart for reporters in the briefing room in coming weeks, taking over a function long managed by the reporters themselves through the White House Correspondents' Association.",
    "url": "https://www.axios.com/2025/03/30/white-house-press-briefing-seating-chart"
  },
  {
    "text": "Deep fear in coal country: DOGE cuts put region's miners and families on edge  —  For federal safety inspectors, the urgent call to their sprawling mining office near Pittsburgh was bleak: Man crushed in the rubble of an aging mine in the heart of coal country.",
    "url": "https://www.post-gazette.com/business/powersource/2025/03/30/coal-mine-safety-doge-trump-spending-cuts-federal/stories/202503280062"
  },
  {
    "text": "Marine Le Pen Could Be Banned From France Election if She's Found Guilty of Embezzlement  —  A verdict Monday in an embezzlement trial is seen as a test of the country's democracy — and the rule of law.  —  Marine Le Pen, the French far-right leader, has tried and failed three times to become president.",
    "url": "https://www.nytimes.com/2025/03/30/world/europe/le-pen-embezzlement-trial-france-election.html"
  },
  {
    "text": "Scoop: Trump to visit Saudi Arabia in May for first foreign trip, sources say  —  President Trump is planning to travel to Saudi Arabia in mid-May on his first foreign trip since returning to the White House, two U.S. officials and a source with knowledge of the president's travel said.",
    "url": "https://www.axios.com/2025/03/30/trump-saudi-arabia-visit-may-first-foreign-trip"
  },
  {
    "text": "AFR, feds investigate ‘arson’ after part of GOP NM headquarters set on fire  —  The Republican Party of New Mexico's entryway was destroyed by what party chairwoman Amy Barela described as a “deliberate act of arson” in a news release Sunday morning.  —  It is unclear if there are any suspects.",
    "url": "https://www.abqjournal.com/news/article_b2ea1f1c-5933-403b-8035-2dafcabaa79e.html"
  },
  {
    "text": "Goldberg says it's ‘not true’ that he and Waltz never spoke prior to Signal leak: Full interview  —  In an exclusive interview with Meet the Press, Editor-in-Chief of The Atlantic, Jeffrey Goldberg, disputes the idea he had never met national security adviser Mike Waltz before being added to a Signal chat with top government officials.",
    "url": "https://www.nbcnews.com/meet-the-press/video/goldberg-says-it-s-not-true-that-he-and-waltz-never-spoke-prior-to-signal-leak-full-interview-235799109514"
  },
  {
    "text": "In Gaza, Almost Every IDF Platoon Keeps a Human Shield, a Sub-army of Palestinian Slaves  —  Innocent Palestinians are regularly forced by soldiers to enter houses in Gaza to make sure there are no terrorists or explosives.  So why is the IDF's Military Police Criminal Investigation Division opening … ",
    "url": "https://www.haaretz.com/opinion/2025-03-30/ty-article-opinion/.premium/in-gaza-almost-every-idf-platoon-keeps-a-human-shield-a-sub-army-of-palestinian-slaves/00000195-e627-deaf-a397-f6674e390000"
  }
]