[
  {
    "text": "Iowa Poll: Donald Trump holds overwhelming lead; Ron DeSantis edges ahead of Nikki Haley  —  A new nationally renowned Iowa Poll shows that a shrinking field has only made Donald Trump's lead grow as Nikki Haley and Ron DeSantis fail to capitalize on powerful endorsements",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2023/12/11/iowa-poll-ron-desantis-nikki-haley-unable-to-shrink-donald-trumps-overwhelming-lead-iowa-caucuses/71850893007/"
  },
  {
    "text": "Iowa poll: Trump surpasses 50% support ahead of first GOP contest  —  The former president leads Ron DeSantis among likely Iowa caucusgoers, 51% to 19%, with Nikki Haley at 16%.  —  Former President Donald Trump has expanded his lead over his GOP rivals with five weeks until … ",
    "url": "https://www.nbcnews.com/politics/2024-election/iowa-poll-trump-surpasses-50-support-ahead-first-gop-contest-rcna128217"
  },
  {
    "text": "Trump Has Found a Dangerous Workaround to Gag Orders  —  Donald Trump will have a number of opportunities to violate gag orders in the coming months.  He may have just found a dangerous loophole.  —  Donald Trump is, once again, outmaneuvering the American court system.",
    "url": "https://www.thedailybeast.com/trump-has-found-a-dangerous-workaround-to-gag-orders"
  },
  {
    "text": "Organized journalistic crime  —  On July 19, the Washington Post Editorial Board published an impassioned column calling for an aggressive national response to organized retail crime (ORC).  The Editorial Board described ORC as “the term security specialists use to distinguish planned … ",
    "url": "https://popular.info/p/organized-journalistic-crime"
  },
  {
    "text": "Majority of Americans Back Israel as Democrats Split Over War With Hamas, WSJ Poll Finds  —  Republicans and independents are more sympathetic to Israelis than Palestinians; Biden gets low marks for handling of conflict  —  WASHINGTON—U.S. public opinion remains favorable toward Israel … ",
    "url": "https://www.wsj.com/politics/majority-of-americans-back-israel-as-democrats-split-over-war-with-hamas-wsj-poll-finds-030f22c2?mod=followamazon"
  },
  {
    "text": "U.S. has failed the Palestinian people, officials say after vetoed UN vote for Gaza Strip cease-fire  — Palestinian figureheads expressed disappointment after the United States vetoed a United Nations resolution calling for an immediate cease-fire in Gaza.",
    "url": "https://www.cnbc.com/2023/12/11/israel-hamas-us-has-failed-the-palestinian-people-officials-say.html"
  },
  {
    "text": "NBC News demands Trump campaign take down fake clip of reporter  —  The Scoop  —  NBC News has demanded that Donald Trump's campaign remove a video that includes audio deceptively edited to seem like it comes from an NBC correspondent after the third presidential debate, two people familiar with the exchange told Semafor.",
    "url": "https://www.semafor.com/article/12/10/2023/nbc-news-demands-trump-campaign-take-down-fake-clip-of-reporter"
  },
  {
    "text": "House GOP chips away at centrist resistance on Biden impeachment inquiry  —  About a half-dozen members are still undecided, but there's only one public ‘no’ vote in POLITICO's whip count.  It's a rare sign of unity for the conference.  —  House Republicans are inches away … ",
    "url": "https://www.politico.com/news/2023/12/11/house-gop-chips-away-at-centrist-resistance-on-biden-impeachment-inquiry-00130909"
  },
  {
    "text": "Tucker Carlson Is Launching His Own Streaming Service  —  ‘Tucker Carlson Network’ is expected to go live on Monday and cost $9 a month  —  Tucker Carlson is launching his own subscription streaming service, people familiar with the matter said, the former Fox News host's official foray … ",
    "url": "https://www.wsj.com/business/media/tucker-carlson-is-launching-his-own-streaming-service-5fc2f9ba?mod=followamazon"
  },
  {
    "text": "Argentina Restricts Dollar Access Until Milei Unveils Policies  — First shock measures expected Tuesday, spokesman says  — Central bank chief meeting with other members of his team  —  Argentina's central bank is restricting access to dollars at the official exchange rate until … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-11/argentina-economic-chief-to-announce-first-measures-tuesday"
  },
  {
    "text": "‘It was chaos’: Witness recounts seeing vehicle drive through religious group in downtown Billings  —  BILLINGS — The Billings Police Department on Sunday released more information regarding the arrest of 55-year-old Genevienne Rancuret after she allegedly drove a vehicle through a religious group … ",
    "url": "https://www.ktvq.com/news/crime-watch/it-was-chaos-witness-recounts-seeing-group-driven-through-in-downtown-billings"
  },
  {
    "text": "Biden Admin Pays Anti-Israel Group That Spreads Lies About Gaza War To Fight ‘Disinformation’  —  The Biden administration, in its efforts to fight the spread of disinformation in the Middle East, awarded hundreds of thousands of dollars in taxpayer money to an anti-Israel nonprofit that has pushed fake news about the Israel-Hamas war.",
    "url": "https://freebeacon.com/biden-administration/biden-admin-pays-anti-israel-group-that-spreads-lies-about-gaza-war-to-fight-disinformation/"
  },
  {
    "text": "CNN Polls: Trump leads Biden in Michigan and Georgia as broad majorities hold negative views of the current president  —  Former President Donald Trump has the upper hand over President Joe Biden in two critical battleground states - Michigan and Georgia - with broad majorities … ",
    "url": "https://www.cnn.com/2023/12/11/politics/cnn-polls-trump-biden-michigan-georgia/"
  },
  {
    "text": "Former Rep. George Santos says no shortage of corruption in Congress after his expulsion on “The Point with Marcia Kramer”  —  The Point  —  George Santos has left the U.S. House of Representatives, but apparently not the public arena.  He's making personalized videos on Cameo … ",
    "url": "https://www.cbsnews.com/newyork/news/george-santos-interview-corruption-in-congress-the-point-with-marcia-kramer/"
  },
  {
    "text": "Kevin McCarthy on Trump: America doesn't want “retribution”  —  California Republican Kevin McCarthy holds a place in history as the first-ever Speaker of the House to be voted out of that position.  Historic, but looking at how his tenure began, hardly a shock.",
    "url": "https://www.cbsnews.com/news/kevin-mccarthy-on-trump-america-doesnt-want-retribution/"
  }
]