[
  {
    "text": "Elon Musk's team has gotten access to the Treasury Department's payments system.  — Trump tariffs: The Canadian government has been notified by the United States government that goods exported to the United States will be subject to a 25 percent tariff, with a lower rate for Canadian oil … ",
    "url": "https://www.nytimes.com/live/2025/02/01/us/trump-tariffs-news/treasury-department-payments-system?unlocked_article_code=1.tk4.2ZbK.3uhE-0Ft611J&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump launches trade war against Canada with with 25 per cent tariff on most goods  —  U.S. president slaps 25% tariff on most Canadian goods  —  Canada braces for threatened U.S. tariffs  —  President Donald Trump launched a trade war against Canada on Saturday by imposing a 25 per cent tariff … ",
    "url": "https://www.cbc.ca/news/politics/trump-tariffs-canada-february-1-1.7447829"
  },
  {
    "text": "Canada Poised to Retaliate Against Trump Tariffs, Rethink US Reliance  — Freeland, a candidate for PM, calls for tariffs on Tesla cars  — Levies will first hit goods easy to substitute, minister says  —  Canada is set to introduce escalating retaliatory counter-tariffs to try … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-01/canada-poised-to-retaliate-against-trump-tariffs-while-rethinking-us-reliance"
  },
  {
    "text": "The Dumbest Trade War in History  —  Trump will impose 25% tariffs on Canada and Mexico for no good reason.  —  President Trump will fire his first tariff salvo on Saturday against those notorious American adversaries . . . Mexico and Canada.  They'll get hit with a 25% border tax, while China, a real adversary, will endure 10%.",
    "url": "https://www.wsj.com/opinion/donald-trump-tariffs-25-percent-mexico-canada-trade-economy-84476fb2"
  },
  {
    "text": "The RFK Jr. Op-Ed the Los Angeles Times Didn't Want You to Read  —  Editors note: As The New Republic reported on Friday, the Los Angeles Times—currently in a race to the bottom with The Washington Post to determine which of the two venerable institutions can sell out to Donald Trump the hardest … ",
    "url": "https://newrepublic.com/article/191030/rfk-jr-op-ed-los-angeles-times"
  },
  {
    "text": "Ken Martin wins election as the next chair of the Democratic National Committee  —  The DNC's chair election marks a first step for a party looking to fill a void of leadership after the 2024 election.  —  Ken Martin, the longtime leader of the state Democratic Party organization in Minnesota … ",
    "url": "https://www.nbcnews.com/politics/elections/ken-martin-wins-election-chair-democratic-national-committee-rcna190018"
  },
  {
    "text": "Who Is Ken Martin, the New Leader of the D.N.C.?  —  Democrats elected a Midwesterner and behind-the-scenes operator to take charge of a party still reeling from defeat.  —  Ken Martin, the Minnesota Democratic chairman, was elevated on Saturday to lead the Democratic National Committee … ",
    "url": "https://www.nytimes.com/2025/02/01/us/politics/ken-martin-dnc.html"
  },
  {
    "text": "Pentagon to swap traditional media with pro-Trump outlets under new rotational program for Defense Department workspace  —  One America News Network would soon replace NBC News and Breitbart would swap with National Public Radio in coveted Pentagon press corps workspace under a plan shared with journalists Friday night.",
    "url": "https://www.cnn.com/2025/01/31/media/pentagon-press-rotation-defense-department/"
  },
  {
    "text": "The Truth About Democrats, According to Amy Klobuchar  —  Let's skip the happy talk: Democrats are in a dark place.  It's not merely that Donald Trump has rolled back into Washington with an everything-everywhere-all-at- once approach to grabbing power.  The new president is buoyed by eager … ",
    "url": "https://www.nytimes.com/2025/02/01/opinion/amy-klobuchar-interview-democrats-trump.html"
  },
  {
    "text": "Musk's Junta Establishes Him as Head of Government  —  Imagining how we'd cover overseas what's happening to the U.S. right now  —  I've long believed that the American media would be more clear-eyed about the rise and return of Donald Trump if it was happening overseas in a foreign country … ",
    "url": "https://www.doomsdayscenario.co/p/musk-s-junta-establishes-him-as-head-of-government"
  },
  {
    "text": "Senior FBI official forcefully resisted Trump administration firings  —  Brian Driscoll pushed back so aggressively that some feared he would be dismissed.  Driscoll has so far not handed over the names of thousands of FBI agents who worked on Jan. 6th cases.",
    "url": "https://www.nbcnews.com/politics/national-security/senior-fbi-official-forcefully-resisted-trump-administration-firings-rcna190301"
  },
  {
    "text": "Trump fires the director of the Consumer Financial Protection Bureau  —  President Donald Trump has fired the director of the Consumer Financial Protection Bureau, Rohit Chopra, in the latest purge of a Biden administration holdover.  Chopra was one of the more important regulators … ",
    "url": "https://apnews.com/article/trump-chopra-consumer-financial-protection-bureau-47b6b39d0eff05ea0c9bca4eacf55b79"
  },
  {
    "text": "Wyden Demands Answers Following Report of Musk Personnel Seeking Access to Highly Sensitive U.S. Treasury Payments System  —  In New Letter to Treasury Secretary Bessent, Wyden Warns That Political Meddling in Treasury Payments Risks Severe Economic Damage, Calls Out Dangerous Conflicts … ",
    "url": "https://www.finance.senate.gov/chairmans-news/wyden-demands-answers-following-report-of-musk-personnel-seeking-access-to-highly-sensitive-us-treasury-payments-system"
  },
  {
    "text": "Red states love Trump—and mooching off the federal funds he wants to cut  —  West Virginia is one the nation's most reliably Republican states, as is Louisiana.  Voters there overwhelmingly pulled the lever for Donald Trump in 2024, striking a decisive blow against former Vice President Kamala Harris … ",
    "url": "https://www.dailykos.com/story/2025/2/1/2300220/-Red-states-love-Trump-and-mooching-off-the-federal-funds-he-wants-to-cut"
  },
  {
    "text": "Trump's emergency water order responsible for water dump from Tulare County lakes  —  The sudden announcement Thursday by the U.S. Army Corps of Engineers that Kaweah and Success lakes would immediately begin dumping water was in response to President Trump's Jan. 24 executive order mandating … ",
    "url": "https://sjvwater.org/trumps-emergency-water-order-responsible-for-water-dump-from-tulare-county-lakes/"
  },
  {
    "text": "‘There will be many casualties’: Panama girds for war as Rubio opens talks  —  On the ground in Panama City ahead of Marco Rubio's first trip as secretary of State.  —  PANAMA CITY — Marco Rubio's weekend visit to Panama is set to offer clues to a pressing question: whether the next four years … ",
    "url": "https://www.politico.com/news/2025/02/01/panama-trump-confrontation-war-00201759"
  },
  {
    "text": "Pro-RFK Jr. letter to the Senate includes names of doctors whose licenses were revoked or suspended  —  A letter submitted to the U.S. Senate that states it was sent by physicians in support of Robert F. Kennedy Jr.'s nomination as secretary of Health and Human Services includes the names … ",
    "url": "https://apnews.com/article/trump-cabinet-kennedy-health-secretary-doctors-vaccines-a3dc5bdb0be5da29dccaef91c19c9ce4"
  },
  {
    "text": "N.Y. Hospital Stops Treating 2 Children After Trump's Trans Care Order  —  The hospital canceled their appointments the same week an executive order from President Trump threatened to punish doctors and hospitals for offering gender-affirming care.  —  A leading New York City hospital system … ",
    "url": "https://www.nytimes.com/2025/02/01/nyregion/nyu-langone-hospital-trans-care-youth.html"
  },
  {
    "text": "Health Programs Shutter Around the World After Trump Pauses Foreign Aid  —  Lifesaving treatment and prevention programs for tuberculosis, malaria, H.I.V. and other diseases cannot access funds to continue work.  —  Lifesaving health initiatives and medical research projects have shut … ",
    "url": "https://www.nytimes.com/2025/02/01/health/trump-aid-malaria-tuberculosis-hiv.html?unlocked_article_code=1.tk4.KySl.9gK0vyAP6_Wx&smid=url-share"
  },
  {
    "text": "Air traffic controllers were initially offered buyouts and told to consider leaving government  —  Just a day before a deadly midair collision at Reagan National Airport outside Washington, D.C., employees at the Federal Aviation Administration were sent an offer to resign with eight months' pay.",
    "url": "https://apnews.com/article/jet-helicopter-crash-air-traffic-controllers-caee8a1e14eb5d156725581d41e6a809"
  },
  {
    "text": "Elon Musk spent more than $290 million on the 2024 election, year-end FEC filings show  —  Elon Musk spent a total of more than $290 million on the 2024 election, new federal filings show, boosting President Donald Trump and Republicans in a staggering effort that has helped to secure unprecedented access … ",
    "url": "https://www.cnn.com/2025/02/01/politics/elon-musk-2024-election-spending-millions/"
  },
  {
    "text": "Trump says he ordered precision military air strikes on ISIS leaders in Somalia  —  The U.S. military conducted coordinated airstrikes against ISIS operatives in Somalia, the first attacks in the African nation during President Trump's second term.  —  Mr. Trump said Saturday in a post … ",
    "url": "https://www.cbsnews.com/news/trump-air-strikes-isis-leaders-in-somalia/"
  },
  {
    "text": "National Press Club Statement On Pentagon's Decision to Remove Media Organizations from Workspaces  —  WASHINGTON, Jan. 31, 2025 /PRNewswire/ — National Press Club President Mike Balsamo today issued the following statement in response to the Defense Department's decision to revoke dedicated workspace … ",
    "url": "https://www.prnewswire.com/news-releases/national-press-club-statement-on-pentagons-decision-to-remove-media-organizations-from-workspaces-302365766.html"
  },
  {
    "text": "Can the President Dissolve USAID by Executive Order?  —  President Donald Trump may be preparing to issue an Executive Order (E.O.) purporting to dissolve the U.S. Agency for International Development (USAID) and fold some or all of its functions into the State Department, according to reporting that emerged on Friday, Jan. 31.",
    "url": "https://www.justsecurity.org/107267/can-president-dissolve-usaid-by-executive-order/"
  }
]