[
  {
    "text": "Colorado GOP asks US Supreme Court to overturn ruling disqualifying Trump from 2024 ballot  —  The Colorado Republican Party says it has asked the US Supreme Court to overturn the unprecedented state Supreme Court ruling that removed Donald Trump from Colorado's 2024 ballot.",
    "url": "https://www.cnn.com/2023/12/27/politics/colorado-gop-appeal-trump-supreme-court"
  },
  {
    "text": "Colorado Republican Party Says It Asked Supreme Court to Keep Trump on Ballot  —  The party's petition urged the justices to review a ruling from the Colorado Supreme Court, which said the former president had engaged in insurrection and is ineligible to hold office.",
    "url": "https://www.nytimes.com/2023/12/27/us/colorado-supreme-court-trump.html"
  },
  {
    "text": "Trump ballot ban appealed to US Supreme Court by Colorado Republican Party  —  The Colorado Republican Party on Wednesday appealed that state's supreme court decision that found former President Donald Trump is ineligible for the presidency, the potential first step to a showdown … ",
    "url": "https://apnews.com/article/trump-ballot-insurrection-colorado-supreme-court-c51a09d231a5b29475505b0c402a2d89"
  },
  {
    "text": "Statement of the Chairman and Ranking Member of the Committee on Ethics Regarding Representative Sheila Cherfilus-McCormick  —  Pursuant to Committee Rule 7, the Chairman and Ranking Member of the Committee on Ethics (Committee) determined to release the following statement:",
    "url": "https://ethics.house.gov/press-releases/statement-chairman-and-ranking-member-committee-ethics-regarding-representative-77"
  },
  {
    "text": "House Ethics launches investigation into Florida Democrat  —  Rep. Sheila Cherfilus-McCormick (D-Fla.) is under investigation over complaints that she may have violated campaign finance laws.  —  MIAMI — The House Ethics Committee announced Wednesday that it's investigating Florida Democrat … ",
    "url": "https://www.politico.com/news/2023/12/27/sheila-cherfilus-mccormick-ethics-investigation-00133246"
  },
  {
    "text": "Tom Smothers, Comic Half of the Smothers Brothers, Dies at 86  —  Though he played a naïve buffoon onstage, he was the driving force behind the folk-singing duo's groundbreaking TV show.  —  Tom Smothers, the older half of the comic folk duo the Smothers Brothers, whose skits and songs on … ",
    "url": "https://www.nytimes.com/2023/12/27/arts/television/tom-smothers-dead.html"
  },
  {
    "text": "Herb Kohl, former U.S. senator and Milwaukee Bucks owner, dies at age 88  —  Amy Rabideau Silvers, Craig Gilbert and Bill GlauberUSA TODAY Network  —  Herb Kohl, the former U.S. senator, Milwaukee Bucks owner and retail shopping magnate, died Wednesday afternoon at the age of 88 after a brief illness.",
    "url": "https://www.usatoday.com/story/news/nation/2023/12/27/herb-kohl-former-senator-milwaukee-bucks-owner-dies/72043478007/"
  },
  {
    "text": "Tim Alberta on Why Evangelical Politics Was Ready for Trump  —  Roughly 24 percent of Americans consider themselves “born-again or evangelical,” but what that means — spiritually, culturally, politically — depends on whom you ask.  For some evangelicals, the role of politics … ",
    "url": "https://www.nytimes.com/2023/12/27/opinion/tim-alberta-trump-evangelicals.html"
  },
  {
    "text": "Lauren Boebert will switch congressional districts to improve her chances of winning in 2024  —  U.S. Rep. Lauren Boebert announced Wednesday night that she is ditching her reelection bid next year in Colorado's 3rd Congressional District to run instead in the state's 4th Congressional District … ",
    "url": "https://coloradosun.com/2023/12/27/lauren-boebert-congressional-district-switch-colorado/"
  },
  {
    "text": "Christie pushes back on calls for him to drop out in 7-figure New Hampshire ad buy  —  Chris Christie is directly pushing back on calls for him to drop out of the 2024 Republican presidential primary in a new seven-figure ad buy debuting in New Hampshire on Thursday, according to details shared exclusively with CNN.",
    "url": "https://www.cnn.com/2023/12/27/politics/chris-christie-new-hampshire-ad-buy/"
  },
  {
    "text": "These states have the most LGBTQ residents: Research  —  California has the largest number of LGBTQ Americans, according to new research, while Washington, D.C., has the greatest percentage of LGBTQ residents and the South claims a larger share of LGBTQ adults than any other region.",
    "url": "https://thehill.com/homenews/lgbtq/4379201-states-most-lgbtq/"
  },
  {
    "text": "Haley declines to say slavery was cause of Civil War  —  The former South Carolina governor instead said it was a dispute over how ‘government was going to run.’  —  Nikki Haley declined to say that slavery was a cause of the Civil War on Wednesday evening, placing the blame, instead, on the role of government.",
    "url": "https://www.politico.com/news/2023/12/27/haley-slavery-cause-of-civil-war-00133254"
  },
  {
    "text": "'You're asking me about risk of embarrassment?':  Why Asa Hutchinson is still running for president  —  He is testing the limits of just how long an accomplished conservative can withstand rejection and rebuke from his own party's base.  —  Asa Hutchinson, left, greets customers … ",
    "url": "https://www.politico.com/news/2023/12/27/asa-hutchinson-president-00133102"
  },
  {
    "text": "North Korea's Kim orders military to accelerate war preparations -state media  —  North Korean leader Kim Jong Un has ordered its military, the munitions industry and the nuclear weapons sector to accelerate war preparations to counter what he called unprecedented confrontational moves by the U.S., state media said on Thursday.",
    "url": "https://www.reuters.com/world/asia-pacific/north-koreas-kim-orders-military-accelerate-war-preparations-kcna-2023-12-27/"
  },
  {
    "text": "One in five young Americans has a POSITIVE view of Osama Bin Laden: Disturbing Daily Mail poll results also reveal three in 10 Gen-Zers think the views of the 9/11 mastermind were a ‘force for good’  — Alarming poll results show some voters under 30 are sympathetic to Bin Laden",
    "url": "https://www.dailymail.co.uk/news/article-12890583/americans-osama-bin-laden-poll-gen-zers.html"
  },
  {
    "text": "In Bid to Slow Migrant Surge, Adams Restricts Bus Arrivals Into New York  —  In an executive order, Mayor Eric Adams required bus companies to provide advance notice of trips or face criminal charges.  —  Mayor Eric Adams placed limits for the first time on Wednesday on how migrants arrive in New York … ",
    "url": "https://www.nytimes.com/2023/12/27/nyregion/mayor-adams-migrants-bus.html"
  },
  {
    "text": "Melania Trump spends Christmas with ailing mother, missing Mar-a-Lago celebration  —  It should be no surprise that she spent this Christmas with her ailing mother,' a source tells Fox News Digital  —  Read this article for free!  —  Plus get unlimited access to thousands of articles, videos and more with your free account!",
    "url": "https://www.foxnews.com/politics/melania-trump-spends-christmas-ailing-mother?intcmp=tw_pols"
  },
  {
    "text": "What the House investigation into COVID-19 origins has turned up after one year  —  have made inroads into unraveling some of the mysteries surrounding the origins of COVID-19 three years after the pandemic swept the world.  —  The Select Subcommittee on the Coronavirus Pandemic was tasked … ",
    "url": "https://www.washingtonexaminer.com/policy/healthcare/what-house-investigation-covid-19-origins-turned-up-after-year"
  },
  {
    "text": "House Republicans Demand to Know If President Biden Influenced Son's ‘Scheme’ to Defy Subpoena  —  Hunter Biden held a press conference blasting GOP lawmakers' efforts to impeach his father instead of giving his scheduled testimony  —  House Oversight Chair James Comer, R-Ky. … ",
    "url": "https://themessenger.com/politics/republicans-white-house-letter-hunter-biden-defy-subpoena"
  },
  {
    "text": "USCP Officers Arrest Man with Machete & Knife outside the U.S. Capitol  —  Yesterday afternoon, United States Capitol Police (USCP) officers arrested a man who was carrying a machete and a knife on the East Front of the U.S. Capitol.  —  “This is another example of the vigilance … ",
    "url": "https://www.uscp.gov/media-center/press-releases/uscp-officers-arrest-man-machete-knife-outside-us-capitol"
  }
]