[
  {
    "text": "White House removes Wall Street Journal from Scotland press pool over Epstein bombshell … The White House is removing the Wall Street Journal from the pool of reporters covering the president's weekend trip to Scotland, White House press secretary Karoline Leavitt told POLITICO.",
    "url": "https://www.politico.com/news/2025/07/21/journal-removed-white-house-pool-epstein-00465548"
  },
  {
    "text": "Trump's Wildly Fascistic Posting Spree Isn't Just a Distraction From Epstein  —  The president spent Sunday night posting content fantasizing about the arrest of Barack Obama and other Democrats  —  President Donald Trump shared an AI-generated video depicting FBI agents arresting former … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-fascist-posting-spree-distraction-epstein-1235389825/"
  },
  {
    "text": "How Trump Deflected MAGA's Wrath Over Epstein, at Least for Now  —  By tapping into other grievances, President Trump managed to turn one of the most fractious moments for his base into a unifying one.  —  In the week after the Justice Department walked back its promise to release … ",
    "url": "https://www.nytimes.com/2025/07/21/us/politics/trump-epstein-maga-base.html"
  },
  {
    "text": "Migrants at Ice jail in Miami made to kneel to eat ‘like dogs’, report alleges  —  Incident in which migrants were shackled with hands tied of one succession of alleged abuses at jails in Florida  —  Migrants at a Miami immigration jail were shackled with their hands tied behind their backs … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/21/migrants-miami-ice-jail-abuses"
  },
  {
    "text": "“You Feel Like Your Life is Over”  —  Abusive Practices at Three Florida Immigration Detention Centers Since January 2025  —  Summary  —  Among the flurry of immigration-related executive orders marking the second presidential administration of Donald Trump is Executive Order 14159 … ",
    "url": "https://www.hrw.org/report/2025/07/21/you-feel-like-your-life-is-over/abusive-practices-at-three-florida-immigration"
  },
  {
    "text": "Trump's ‘big beautiful bill’ is projected to add $3.4 trillion to the debt, budget office says  —  The law will also “increase by 10 million the number of people without health insurance” over the coming decade, the nonpartisan Congressional Budget Office estimated.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trumps-big-beautiful-bill-add-3-trillion-debt-cbo-says-rcna220004"
  },
  {
    "text": "Estimated Budgetary Effects of Public Law 119-21, to Provide for Reconciliation Pursuant to Title II of H. Con. Res. 14, Relative to CBO's January 2025 Baseline  —  Public Law 119-21 as enacted on July 4, 2025  —  CBO estimates that Public Law 119-21 will result in a net increase … ",
    "url": "https://www.cbo.gov/publication/61570"
  },
  {
    "text": "ICE will ‘flood the zone’ in NYC … The alleged shooter entered the country illegally in 2023 during then-President Joe Biden's tenure and had been arrested and released four times in the years since, Noem said.  She blamed the shooting on New York's sanctuary city policies that limit … ",
    "url": "https://www.politico.com/news/2025/07/21/ice-new-york-city-enforcement-00465313"
  },
  {
    "text": "Scott Bessent calls for probe into ‘the entire Federal Reserve institution’  —  Treasury secretary is latest top Trump administration official to criticise the central bank  —  US Treasury Secretary Scott Bessent has called for an inquiry into the “entire Federal Reserve institution” … ",
    "url": "https://www.ft.com/content/54ebd697-9725-4344-8109-204e02fa1c53?accessToken=zwAGOnPOgvV4kc9U69aXlyVDRNOBCSBOAvocUw.MEUCIQDoN6l9A57khmUh7O40H_pzwiRb-HVgRfQv-vJysB-qNgIgGSH5zcMqY52tAJPnP6eCJR0EjiOtYeALktShCJc8gqE&sharetype=gift&token=8b711433-39db-4974-a772-bdecf1deb139"
  },
  {
    "text": "How John Roberts Built the New American Presidency  —  The country is witnessing the creation of an all-powerful institution, and one man is responsible.  —  No one on the Supreme Court has gone further to enable Donald Trump's extreme exercise of presidential power than the chief justice of the United States, John Roberts.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/07/supreme-court-roberts-trump-dictator/683576/?gift=mRAZp9i2kzMFnMrqWHt67aRoyUR1CMNKg4fhka6Kboc"
  },
  {
    "text": "Trump officials accused of defying 1 in 3 judges who ruled against him  —  A comprehensive analysis of hundreds of lawsuits against Trump policies shows dozens of examples of defiance, delay and dishonesty, which experts say pose an unprecedented threat to the U.S. legal system.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/07/21/trump-court-orders-defy-noncompliance-marshals-judges/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzMDcwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0NDUyNzk5LCJpYXQiOjE3NTMwNzA0MDAsImp0aSI6IjUwNWM3ZDUwLTMxM2QtNDQzYS04ZmU5LTUzMDdlNGJkZWRkYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA3LzIxL3RydW1wLWNvdXJ0LW9yZGVycy1kZWZ5LW5vbmNvbXBsaWFuY2UtbWFyc2hhbHMtanVkZ2VzLyJ9.8tERJVOOy1THG3bMGL9I268xALakhv-XIVqCK2E3RqU&itid=gfta"
  },
  {
    "text": "My Fix for the Confused and Leaderless Democrats  —  Constipated.  Leaderless.  Confused.  A cracked-out clown car.  Divided.  These are the words I hear my fellow Democrats using to describe our party as of late.  The truth is they're not wrong: The Democratic Party is in shambles.",
    "url": "https://www.nytimes.com/2025/07/21/opinion/carville-democrats-midterms-mamdani.html"
  },
  {
    "text": "Fed Chair Jerome Powell hit with criminal referral by House GOP Trump ally  —  Trump allies have been going after the embattled Federal Reserve chief  —  FIRST ON FOX: Rep. Anna Paulina Luna, R-Fla., is referring Federal Reserve Chair Jerome Powell to the Department of Justice (DOJ) … ",
    "url": "https://www.foxnews.com/politics/fed-chair-jerome-powell-hit-criminal-referral-house-gop-trump-ally"
  },
  {
    "text": "House won't vote on Epstein matter this week  —  Speaker Mike Johnson doesn't have any plans to put a non-binding resolution on the floor this week before the August recess — or possibly ever — that would call for the administration to release Jeffrey Epstein-related documents.",
    "url": "https://www.politico.com/live-updates/2025/07/21/congress/house-gop-epstein-strategy-00465234"
  },
  {
    "text": "Why Colbert got canceled  —  Economics played a role.  Politics might have, too.  But mainstream liberal comedy has struggled between the death of mass culture and the rise of Trump.  —  There was a time not so long ago when going on TV with Jon Stewart or Stephen Colbert was pretty much the best thing I could imagine.",
    "url": "https://www.natesilver.net/p/why-colbert-got-canceled"
  },
  {
    "text": "Trump's lawsuit against Wall Street Journal now has a judge — and it's not Aileen Cannon … Trump's new lawsuit against The Wall Street Journal and owner Rupert Murdoch seeks an even more audacious sum: $20 billion.  Trump says the newspaper defamed him by reporting last week that Trump … ",
    "url": "https://www.politico.com/news/2025/07/21/wall-street-lawsuit-judge-donald-trump-00465363"
  },
  {
    "text": "Judge Challenges Trump Administration in Hearing on Harvard Funding  —  In a courtroom in Boston on Monday, a lawyer for Harvard called the Trump administration's case against the school “cooked up.”  —  A federal judge grilled a Trump administration lawyer on Monday during a crucial hearing … ",
    "url": "https://www.nytimes.com/2025/07/21/us/trump-administration-harvard-hearing.html?unlocked_article_code=1.YE8.1AdR.Ajdfg7DSpXw7&smid=url-share"
  },
  {
    "text": "Declassified Records Show Obama Lied To Americans, Sabotaged Transition Of Power  —  Director of National Intelligence Tulsi Gabbard released 114 pages of newly declassified Obama administration records Friday.  —  President Barack Obama was among the U.S. leaders directing intelligence agencies … ",
    "url": "https://thefederalist.com/2025/07/21/declassified-records-show-obama-lied-to-americans-sabotaged-transition-of-power/"
  },
  {
    "text": "JD Vance's Idyllic Vacation in Foreign A-List Hotspot to Be Hijacked by Protests  —  WE'LL BE WAITING  —  The Stop Trump Coalition said the vice president will “find the resistance waiting” on his English summer break, an ocean and almost 4,000 miles from DC.",
    "url": "https://www.thedailybeast.com/vances-vacation-plans-immediately-hit-with-protest-threats/"
  },
  {
    "text": "VIDEO: Criminal Illegal Alien with Lengthy Rap Sheet Ambushes and Shoots CBP Officer in New York City  —  The suspect is a criminal illegal alien from the Dominican Republic was apprehended at the southern border and released into the country under the Biden Administration",
    "url": "https://www.dhs.gov/news/2025/07/20/video-criminal-illegal-alien-lengthy-rap-sheet-ambushes-and-shoots-cbp-officer-new"
  },
  {
    "text": "Hunter Biden says dad Joe was on Ambien during disastrous 2024 debate with Trump  —  WASHINGTON — He really was Sleepy Joe!  —  Former first son Hunter Biden claimed in a new interview Monday that his father's disastrous performance in last year's debate with Donald Trump was due in part … ",
    "url": "https://nypost.com/2025/07/21/us-news/hunter-biden-says-dad-joe-was-on-ambien-during-disastrous-2024-debate-with-trump/"
  },
  {
    "text": "How Trump Killed Cancer Research  —  Attempting to eliminate funding for certain kinds of “woke” studies, the Trump administration erased hundreds of millions of dollars being used for cancer research.  —  When donald trump moved back into the White House, the United States was years … ",
    "url": "https://www.wired.com/story/how-trump-killed-cancer-research/"
  },
  {
    "text": "Hunter Biden goes off on George Clooney: ‘F‑‑‑ him and everybody around him’  —  Hunter Biden went off on actor George Clooney and other high-profile Democrats in an expletive-filled response to their calls for his father, former President Biden, to drop out of the 2024 election.",
    "url": "https://thehill.com/homenews/campaign/5412069-hunter-biden-criticizes-dems/"
  },
  {
    "text": "Omar Fateh wins mayoral endorsement at chaotic DFL convention … - It's also the Minneapolis DFL's first endorsement in any contested mayor's race since at least 1997, per the Star Tribune. … - “We know the status quo are going to do anything and everything to maintain power,” he told his supporters.",
    "url": "https://www.axios.com/local/twin-cities/2025/07/20/omar-fateh-minneapolis-dfl-endorsement-mayor"
  },
  {
    "text": "FAA says it will investigate incident between SkyWest jet and B-52  —  The incident is under investigation.  —  The pilot of a Delta Connection flight Embraer E175LR aircraft, like the one pictured here, was forced to make an “aggressive” maneuver, July 19, 2025, to avoid a mid-air collision with an Air Force B-22 bomber.",
    "url": "https://abcnews.go.com/US/delta-regional-pilot-takes-evasive-action-avoid-52/story?id=123908431"
  },
  {
    "text": "Divorce, adultery allegations against Paxton jolt Senate race in Texas  —  In one of the biggest GOP primaries of the midterms, Sen. John Cornyn and his allies are attacking Ken Paxton over his personal life, and some backers are rethinking their support.  —  Firebrand Texas Republican Ken … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/21/paxton-divorce-texas-cornyn-senate-trump/"
  },
  {
    "text": "Enshittification and the Bitterness of Billionaire Bros  —  Hell hath no fury like a tech god scorned  —  One of the many weird, ugly developments in these weird, ugly times has been the MAGAfication of a number of Silicon Valley billionaires.  In a fully functional democracy the views … ",
    "url": "https://paulkrugman.substack.com/p/enshittification-and-the-bitterness"
  },
  {
    "text": "AOC's Bronx HQ vandalized with red paint after Israel vote: ‘F-K AOC!’  —  Progressive New York Rep. Alexandria Ocasio-Cortez's Bronx headquarters was vandalized by anti-Israel activists after she voted against cutting US funding for the Jewish state.  —  The office in Westchester Square … ",
    "url": "https://nypost.com/2025/07/21/us-news/aocs-bronx-hq-vandalized-with-red-paint-after-israel-vote/"
  },
  {
    "text": "This ‘violently racist’ hacker claims to be the source of The New York Times' Mamdani scoop … It's an anime-loving neo-Nazi whose hobbies include furry drawings, posting fan art of a video game character, and hacking universities.  On X, the alleged hacker is followed by New York Times … ",
    "url": "https://www.theverge.com/cyber-security/710480/columbia-hacker-nazi-nyt-affirmative-action"
  }
]