[
  {
    "text": "NY-03 gives Republicans lots to worry about  —  Tom Suozzi's victory highlights GOP weakness and D strengths. … Much pre-election hype suggested the NY-03 special to replace lying grifting weirdo George Santos was going to be a nail biter.  In the event, though, it wasn't that close.",
    "url": "https://www.publicnotice.co/p/tom-suozzi-ny-03-pilip-loss-2024-takeaways"
  },
  {
    "text": "Suozzi wins New York special election, replacing George Santos  —  The Democrat prevailed in a race that centered heavily on immigration  —  Democrat Tom Suozzi won a hotly contested special election for Congress on Tuesday, the Associated Press projected, retaking a seat in suburban New York … ",
    "url": "https://www.washingtonpost.com/elections/2024/02/13/new-york-district-3-special-election-george-santos/"
  },
  {
    "text": "Sen. Chris Murphy urges Dems to follow Tom Suozzi's ‘aggressive’ offense on the border  —  Murphy said fellow Democrat Tom Suozzi, who won the special election in New York's 3rd Congressional District, “messaged aggressively” on the issue of immigration and “flipped the script on his Republican opponent.”",
    "url": "https://www.nbcnews.com/politics/congress/sen-chris-murphy-urges-democrats-follow-suozzis-aggressive-offense-bor-rcna138776"
  },
  {
    "text": "The Santos stench: 6 takeaways from the New York special election  —  Republicans ran an untested candidate against a seasoned Democratic veteran.  It turns out that was a mistake.  —  The stench of George Santos' many scandals mattered.  Democrats won a race fought mostly over immigration.",
    "url": "https://www.politico.com/news/2024/02/14/takeaways-new-york-special-election-00141359"
  },
  {
    "text": "New documents underscore why the Supreme Court must let Jack Smith's Trump case move forward  —  January 6 was just the tip of the iceberg — Trump's criminal conspiracy was sprawling  —  Despite taking their own sweet time to render what should have been a five-minute decision ruling … ",
    "url": "https://www.salon.com/2024/02/14/new-documents-underscore-why-the-must-let-jack-smiths-case-move-forward/"
  },
  {
    "text": "Nikki Haley: ‘Diminished,’ ‘unhinged’ Trump has changed since she backed him  —  In an interview with NBC News' Craig Melvin, Haley explained away her past support for Trump while knocking his recent conduct and his age.  —  Former U.N. Ambassador Nikki Haley defended her past support … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-diminished-unhinged-trump-changed-backed-rcna138667"
  },
  {
    "text": "Lara Trump says ‘every single penny’ of RNC funds will go to electing Donald Trump if she is made co-chair  —  Donald Trump is pushing for Lara Trump to be made the RNC's co-chair  —  Former President Donald Trump's daughter-in-law is promising that all the Republican National Committee's … ",
    "url": "https://www.foxnews.com/politics/lara-trump-every-single-penny-rnc-funds-electing-donald-trump-made-co-chair"
  },
  {
    "text": "Lara Trump says she'd spend ‘every single penny’ of RNC funds to elect father-in-law  —  Lara Trump on Tuesday doubled down on her support for her father-in-law, former President Trump, vowing to spend “every single penny” of Republican National Committee (RNC) funds to reelect him to the White House.",
    "url": "https://thehill.com/homenews/campaign/4467232-lara-trump-spend-rnc-funds-to-elect-donald-trump/"
  },
  {
    "text": "Lindsey Graham, a longtime foreign policy hawk, bows to Trump on Ukraine  —  The shift sends another warning sign to U.S. allies about the isolationist posture spreading within the Republican Party  —  Last May, Lindsey Graham (R-S.C.) visited Ukrainian President Volodymyr Zelensky in Kyiv … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/14/lindsey-graham-ukraine-trump/"
  },
  {
    "text": "Nearly 1 in 5 Believe Taylor Swift Election Conspiracy Theory  —  But 2 in 3 Americans approve of the singer encouraging voter turnout  —  West Long Branch, NJ - Just under 1 in 5 Americans believe the singer Taylor Swift is part of a covert effort to help President Joe Biden win the 2024 election.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_021424"
  },
  {
    "text": "After border bill failure, ICE considers mass releases to close budget gap  —  U.S. Immigration and Customs Enforcement has drafted plans to release thousands of immigrants and slash its capacity to hold detainees after the failure of a Senate border bill that would have erased … ",
    "url": "https://www.washingtonpost.com/immigration/2024/02/14/immigration-customs-enforcement-budget-deficit-republicans/"
  },
  {
    "text": "Pentagon Used Six-Bladed ‘Ginsu’ Weapon to Kill Iraqi Militia Leader  —  Eager to avoid escalating tensions with Baghdad, U.S. used missile designed to avoid civilian casualties  —  WASHINGTON—The Pentagon killed a Kataib Hezbollah leader in downtown Baghdad last week using a weapon … ",
    "url": "https://www.wsj.com/politics/national-security/pentagon-used-six-bladed-ginsu-weapon-to-kill-iraqi-militia-leader-7dfe0687?st=nnf2n2i164m830o"
  },
  {
    "text": "February 13, 2024  —  “History is watching,” President Joe Biden said this afternoon.  He warned “Republicans in Congress who think they can oppose funding for Ukraine and not be held accountable” that “[f]ailure to support Ukraine at this critical moment will never be forgotten.”",
    "url": "https://heathercoxrichardson.substack.com/p/february-13-2024"
  },
  {
    "text": "Ex-Detroit police chief James Craig drops Republican bid for open U.S. Senate seat in Michigan  —  Former Detroit Police Chief James Craig is ending his Republican bid for an open U.S. Senate seat representing Michigan just over four months after launching his campaign, he told The Associated Press on Tuesday.",
    "url": "https://apnews.com/article/michigan-senate-republican-detroit-police-chief-ec5c3f5516472b78599a77c4fc95ad81"
  },
  {
    "text": "Terrorists Are Paying for Check Marks on X, Report Says  —  The report shows that X has accepted payments for subscriptions from entities barred from doing business in the United States, a potential violation of sanctions.  —  X, the social media platform owned by Elon Musk … ",
    "url": "https://www.nytimes.com/2024/02/14/technology/terrorists-check-marks-x-report.html"
  },
  {
    "text": "Mozilla downsizes as it refocuses on Firefox and AI: Read the memo  —  After installing a new interim CEO earlier this month, Mozilla, the organization behind the Firefox browser, is making some major changes to its product strategy, TechCrunch has learned.  —  Specifically, Mozilla plans … ",
    "url": "https://techcrunch.com/2024/02/13/mozilla-downsizes-as-it-refocuses-on-firefox-and-ai-read-the-memo/"
  },
  {
    "text": "House Intel chair calls on Biden to declassify details on ‘serious national security threat’  —  House Intelligence Chair Mike Turner (R-Ohio) made a cryptic call for President Biden to declassify information about a “serious national security threat” to allow for public discussions about how the U.S. should respond.",
    "url": "https://thehill.com/policy/national-security/4467888-house-intel-chair-turner-national-security-threat/"
  },
  {
    "text": "Extending our Mastodon social media trial  —  In July 2023 we announced our plan to establish a BBC presence in the distributed collection of social networks known as the Fediverse, a collection of social media applications all linked together by common protocols, as part of our research into social technologies.",
    "url": "https://www.bbc.co.uk/rd/blog/2024-02-extending-our-mastodon-social-media-trial"
  },
  {
    "text": "High School Girls Basketball Team Quits After Crowd Allegedly Spews Racial Slurs  —  School officials in Scarsdale and East Ramapo have announced an investigation into the incident.  —  A high school girls' basketball game in Scarsdale, New York came to an early finish on Saturday … ",
    "url": "https://www.thedailybeast.com/high-school-girls-basketball-team-quits-after-crowd-spews-racial-slurs-report-says"
  }
]