[
  {
    "text": "Harris defeats Trump in Virginia  —  Vice President Harris has won Virginia, maintaining Democrats' control of the state at the presidential level despite some Republican inroads in recent years, according to a projection from Decision Desk HQ.  —  Polls in the run-up to Election … ",
    "url": "https://thehill.com/homenews/campaign/4964243-kamala-harris-wins-virginia/"
  },
  {
    "text": "Sitting in it  —  As I write this early Wednesday morning, the presidential election hasn't yet been officially called.  But it's not looking good.  —  It's hard to wrap your mind around how we got to this place.  Donald Trump lost in 2020, incited a coup attempt, was convicted of 34 felonies … ",
    "url": "https://www.publicnotice.co/p/trump-beats-harris-2024"
  },
  {
    "text": "NBC News Exit Poll: Voters express deep concern about America's democracy and economy  —  Women are twice as likely as men to rank abortion as their top issue, according to preliminary results from the national survey.  —  The state of democracy and the economy in the United States … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nbc-news-exit-poll-voters-express-concern-democracy-economy-rcna178602"
  },
  {
    "text": "NBC News Exit Poll: Harris loses ground with Latinos  —  NBC News Exit Poll Desk  —  Latino men are breaking for Trump by a 10-point margin, 54% to 44%, in a major reversal from four years ago, according to the NBC News Exit Poll.  In 2020, Latino men backed Biden over Trump by a 23-point margin, 59% to 36%.",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/presidential-election-2024-live-updates-rcna175556/rcrd62776?canonicalCard=true"
  },
  {
    "text": "Election 2024 live updates Donald Trump wins the 2024 presidential election  —  Trump claims victory as he pulls ahead in presidential race  —  Former president Donald Trump is projected to win the race for the White House, defeating Vice President Kamala Harris to recapture the office he lost four years ago.",
    "url": "https://www.washingtonpost.com/elections/2024/11/06/trump-harris-presidential-election-live-updates/"
  },
  {
    "text": "Trump White House victory called ‘the greatest political comeback in American history’  —  Trump will be the first president to serve two nonconsecutive terms in the White House since Grover Cleveland in 1892  —  From political pariah to the presidency.  —  Four years after Americans booted … ",
    "url": "https://www.foxnews.com/politics/trump-white-house-victory-called-the-greatest-political-comeback-american-history"
  },
  {
    "text": "With Harris' path to victory narrowing, Trump declares victory  —  ABC News has not projected a winner in the presidential race.  —  Republican presidential nominee, former U.S. President Donald Trump arrives to speak during an election night event, Nov. 6, 2024, in West Palm Beach, Florida.",
    "url": "https://abcnews.go.com/Politics/harris-path-victory-narrowing-trump-declares-victory/story?id=115543903"
  },
  {
    "text": "Playbook: A new Trump era begins  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  It seemed unthinkable on Jan. 7, 2021.  Now it's reality.  —  DONALD TRUMP will retake the presidency after making sweeping gains in state after state, with group after group … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/06/trump-on-the-cusp-00187733"
  },
  {
    "text": "Exit poll results 2024 |  CNN Politics  —  See all exit polls data for the 2024 US elections.  For more information on voting and election results, visit cnn.com/election.",
    "url": "https://www.cnn.com/election/2024/exit-polls/national-results/general/president/0"
  },
  {
    "text": "Live Presidential Forecast  —  Our election model estimates the outcome of the race in real time based on polling data, the votes reported so far and what we expect from remaining votes.  Read how it works ›  —  Chance of winning  —  No estimates yet",
    "url": "https://www.nytimes.com/interactive/2024/11/05/us/elections/results-president-forecast-needle.html"
  },
  {
    "text": "Trump Won.  Now What?  —  Donald Trump has won, and will become president for the second time.  Those who voted for him will now celebrate their victory.  The rest of us need to prepare to live in a different America: a country where millions of our fellow citizens voted for a president … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/trump-wins-second-term-presidency/680546/"
  },
  {
    "text": "Democrats feel 2016 all over again in Harris-Trump battle  —  Democrats started election night feeling genuinely optimistic about Vice President Harris's chance of becoming the nation's first female president.  —  But as the evening wore on and former President Trump began to surpass 200 electoral votes … ",
    "url": "https://thehill.com/homenews/campaign/4975404-democrats-optimistic-vice-president-harris/"
  },
  {
    "text": "Schiff wins California Senate race  —  Rep. Adam Schiff (D-Calif.) is projected to win his bid for the Senate in California, according to Decision Desk HQ.  —  Schiff, who emerged as one of former President Trump's chief critics in the House and led Trump's first impeachment … ",
    "url": "https://thehill.com/homenews/campaign/4971859-adam-schiff-california-senate/"
  },
  {
    "text": "Election Day bomb threats disrupt voting in multiple states  —  The U.S. saw a rash of discredited bomb threats called in at polling places in multiple states on Election Day, in some cases spurring the need for extended voting hours.  —  Faulty bomb threats were called into at least five states … ",
    "url": "https://thehill.com/homenews/campaign/4975024-russia-bomb-threats-polling-places/"
  },
  {
    "text": "Sarah McBride becomes the first out transgender person elected to Congress  —  McBride, a Democrat who served two terms as a state senator, wins Delaware's only House seat, NBC News projects.  —  WILMINGTON, Del. — Delaware state Sen. Sarah McBride won the state's only House seat Tuesday … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/sarah-mcbride-first-transgender-congress-delaware-rcna177878"
  },
  {
    "text": "Live House election results for 2024 races  —  House elections live balance of power for 2024  —  All 435 seats in the U.S. House of Representatives are on the ballot on Election Day, and whichever party wins control of the House will likely have a slim majority, making every seat crucial to a majority.",
    "url": "https://www.cbsnews.com/live-updates/house-election-results-2024/"
  },
  {
    "text": "Moreno ousts Brown in Ohio Senate race  —  Republican businessman Bernie Moreno has defeated incumbent Sen. Sherrod Brown (D-Ohio), the chair of the Senate Banking Committee, boosting Republican chances of taking back control of the Senate.  —  Moreno, 57, who built up a successful network … ",
    "url": "https://thehill.com/homenews/senate/4973460-moreno-defeats-brown-senate-race/"
  },
  {
    "text": "Florida's abortion amendment fails, leaving 6-week ban in place  —  Florida's abortion-rights ballot initiative fell short of passing on Tuesday, leaving in place a six-week abortion ban that has helped restrict access across almost all of the Southern U.S.  —  The measure's defeat … ",
    "url": "https://thehill.com/policy/healthcare/4969765-florida-abortion-rights-ballot/"
  },
  {
    "text": "Israel's Netanyahu dismisses his defense minister as wars rage.  Protests erupt across country  —  Israeli Prime Minister Benjamin Netanyahu on Tuesday dismissed his popular defense minister, Yoav Gallant, in a surprise announcement that came as the country is embroiled in wars on multiple fronts across the region.",
    "url": "https://apnews.com/article/israel-netanyahu-gallant-gaza-war-lebanon-3810d3adb1603e8485b4be46a5b79f8b"
  },
  {
    "text": "Election Live Updates: A Caustic and Turbulent Race Is in Voters' Hands  — Polls in parts of Indiana and Kentucky have closed, and voting ends in six more states including Georgia, a key battleground, at 7 p.m. Eastern time.  Turnout looked strong in an election that Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/live/2024/11/05/us/trump-harris-election"
  },
  {
    "text": "Andy Kim Wins in New Jersey to Become the First Korean American Senator  —  Mr. Kim, a Democrat, will take the seat previously held by Robert Menendez, who resigned after being convicted of taking bribes.  —  Representative Andy Kim was elected on Tuesday to the U.S. Senate … ",
    "url": "https://www.nytimes.com/2024/11/05/nyregion/nj-senate-kim-bradshaw.html"
  },
  {
    "text": "Five Surprising Things We Learned From the 2024 Results  —  Voters broke toward Republicans and away from Democrats all over the map  —  It may take some time to complete all the results, but based on initial returns and AP VoteCast data, here are five major developments from election night.",
    "url": "https://www.wsj.com/politics/elections/election-results-2024-takeaways-7fbd81f1"
  },
  {
    "text": "Fox News projects Mike Kehoe to win Missouri governor's race  —  The Republican defeated Democrat Crystal Quade and two third-party challengers  —  The Fox News Decision Desk projects Republican Lt. Gov. Mike Kehoe to win the open Missouri governor's race, defeating Democratic challenger Crystal Quade.",
    "url": "https://www.foxnews.com/politics/fox-news-projects-mike-kehoe-win-missouri-governors-race"
  },
  {
    "text": "Supreme Court: Cobb County absentee ballots must be returned by Election Day  —  The court sided with the Republican National Committee, removing the relief that a lower court ordered.  —  The Georgia Supreme Court on Monday ordered that Cobb County may only count absentee ballots received by 7 p.m. on Election Day.",
    "url": "https://www.ajc.com/politics/cobb-county-absentee-ballots-must-be-returned-by-election-day-georgia-supreme-court-rules/7DHUDZ4IARGOLDHYPR53AI7PYU/"
  },
  {
    "text": "Milwaukee rerunning more than 30,000 absentee ballots over error, delaying results  —  Vanessa Swales Alison DirrMilwaukee Journal Sentinel  —  The City of Milwaukee restarted the processing about 31,000 absentee ballots after an election observer brought to officials' attention that doors covering … ",
    "url": "https://www.jsonline.com/story/news/politics/elections/2024/11/05/milwaukee-rerunning-more-than-30000-ballots-over-machine-error/76078233007/"
  }
]