[
  {
    "text": "The mystery of the missing binder: How a collection of raw Russian intelligence disappeared under Trump  —  A binder containing highly classified information related to Russian election interference went missing at the end of Donald Trump's presidency, raising alarms among intelligence officials … ",
    "url": "https://www.cnn.com/interactive/2023/12/politics/missing-russia-intelligence-trump-dg/"
  },
  {
    "text": "Behind the Scenes at the Dismantling of Roe v. Wade  —  On Feb. 10 last year, Justice Samuel A. Alito Jr. showed his eight colleagues how he intended to uproot the constitutional right to abortion.  —  At 11:16 a.m., his clerk circulated a 98-page draft opinion in Dobbs v. Jackson Women's Health Organization.",
    "url": "https://www.nytimes.com/2023/12/15/us/supreme-court-dobbs-roe-abortion.html"
  },
  {
    "text": "Why Bob Vander Plaats thinks some evangelicals can't quit Trump  —  Good morning, Early Birds.  We're running out of shelves on which to hide our elves.  Please send suggestions (and, more importantly, newsworthy tips) to earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2023/12/15/why-bob-vander-plaats-thinks-some-evangelicals-cant-quit-trump/"
  },
  {
    "text": "Melania Trump Welcomes You to America, for Some Reason  —  Her husband is accused of swiping Archives property.  But she's set to star in a winning photo op.  —  For two years, the National Archives stalked Donald Trump over secret presidential records he's accused of purloining.",
    "url": "https://www.politico.com/news/magazine/2023/12/15/melania-trump-national-archives-naturalization-ceremony-00131762"
  },
  {
    "text": "Rep. Elise Stefanik files complaint against judge who has ruled in Jan. 6 and Trump cases  —  The New York Republican and staunch Trump ally is asking for an ethics investigation, arguing the judge has engaged in “highly inappropriate political speech.”  —  WASHINGTON — Rep. Elise Stefanik … ",
    "url": "https://www.nbcnews.com/politics/congress/elise-stefanik-files-complaint-judge-ruled-jan-6-trump-cases-rcna129878"
  },
  {
    "text": "Cornel West thinks Biden won't make it to the general election  —  The independent candidate rejected the idea he could be a “spoiler” for Biden in an exclusive meeting with POLITICO.  —  Cornel West doesn't think Joe Biden will make it to the general election.",
    "url": "https://www.politico.com/news/2023/12/15/cornel-west-biden-election-00131944"
  },
  {
    "text": "Hungary blocks €50bn of EU funding for Ukraine  —  Hungary has blocked €50bn ($55bn; £43bn) in EU aid for Ukraine - just hours after an agreement was reached on starting membership talks.  —  “Summary of the nightshift: veto for the extra money to Ukraine,” … ",
    "url": "https://www.bbc.com/news/world-europe-67724357"
  },
  {
    "text": "GOP Sen. Mullin Says Biden ‘May Not Be Impeachable’ Because He Wasn't in Office at the Time of Accused Indiscretion  —  Mullin's comment comes after the House voted to formalize the impeachment inquiry of the president  —  Oklahoma Republican Sen. Markwayne Mullin suggested that President Joe Biden … ",
    "url": "https://themessenger.com/politics/gop-sen-mullin-says-biden-may-not-be-impeachable-because-he-wasnt-in-office-at-the-time-of-accused-indiscretion"
  },
  {
    "text": "Ukraine councilor detonates grenades at meeting, wounding 26, in attack captured on video  —  A Ukrainian village councilor set off hand grenades at a meeting in an attack that was captured on video and left 26 people wounded, the country's national police said Friday.",
    "url": "https://www.cbsnews.com/news/ukraine-councilor-sets-off-grenades-meeting-captured-on-video/"
  },
  {
    "text": "Urgent Need to Increase Immunization Coverage for Influenza, COVID-19, and RSV and Use of Authorized/Approved Therapeutics in the Setting of Increased Respiratory Disease Activity During the 2023 - 2024 Winter Season  —  Distributed via the CDC Health Alert Network",
    "url": "https://emergency.cdc.gov/han/2023/han00503.asp"
  },
  {
    "text": "U.S. economy will pull off soft landing in 2024, CBO projects  —  The U.S. economy is on track to avoid a recession next year as inflation returns to normal, according to new economic projections released by the Congressional Budget Office. … But its projections suggest America will skirt an all-out contraction in growth.",
    "url": "https://www.axios.com/2023/12/15/us-economy-avoid-recession-inflation-cbo-projections"
  },
  {
    "text": "Asked about Trump, top Kremlin aide says Putin wants a president who is ‘more constructive’ toward Russia  —  In a one-on-one with NBC News, spokesman Dmitry Peskov accuses the U.S. and the West of unnecessarily prolonging the war in Ukraine.  —  MOSCOW — The Kremlin's spokesman on Friday weighed … ",
    "url": "https://www.nbcnews.com/news/world/kremlin-russia-putin-trump-peskov-ukraine-rcna129898"
  },
  {
    "text": "Republicans struggle as they keep getting forced to talk about abortion  —  The contrast between GOP candidates' maneuvering toward the middle and real-world events that remind the public of the party's most aggressively anti-abortion faction shows how vexing the issue remains for the party.",
    "url": "https://www.politico.com/news/2023/12/15/republicans-abortion-kate-cox-00131921"
  },
  {
    "text": "The Crazy Conservative Scheme to Make Trump Look Normal: Rehabilitate Nixon  —  Welcome to the Nixon Renaissance, where “Tricky Dick” is cool and Watergate was a set-up.  —  In late August, Republican presidential hopeful Vivek Ramaswamy took a break from his typical campaign events … ",
    "url": "https://www.politico.com/news/magazine/2023/12/15/nixon-trump-young-conservatives-00131637"
  },
  {
    "text": "Ex-FBI counterintelligence official gets over 4 years in prison for aiding Russian oligarch  —  A former top FBI counterintelligence official was ordered Thursday to spend over four years in prison for violating sanctions on Russia by going to work for a Russian oligarch seeking dirt … ",
    "url": "https://apnews.com/article/mcgonigal-russian-oligarch-plea-fbi-ab21d73d0f943f0c9e6b267e157778bf"
  }
]