[
  {
    "text": "In stunner, House GOP bid to impeach Mayorkas fails  —  A House GOP effort to impeach Homeland Security Secretary Alejandro Mayorkas failed in embarrassing fashion Tuesday as three Republicans joined Democrats in voting against what would have been the second-ever impeachment of a Cabinet official.",
    "url": "https://thehill.com/homenews/house/4452038-in-stunner-house-gop-bid-to-impeach-mayorkas-fails/"
  },
  {
    "text": "Mayorkas Impeachment Vote  —  House to Vote on Impeaching Mayorkas Over Border Crisis  —  Republicans in the slim majority say the homeland security secretary has willfully refused to enforce border laws and breached the public trust.  —  Here's the latest on the impeachment vote.",
    "url": "https://www.nytimes.com/live/2024/02/06/us/mayorkas-impeachment"
  },
  {
    "text": "GOP-led standalone Israel aid bill fails in the House  —  The House on Tuesday failed to pass a standalone package for $17.6 billion in Israel aid amid opposition from both Republicans and Democratic leaders.  —  Because of resistance among members of the conservative House Freedom Caucus … ",
    "url": "https://www.cnn.com/2024/02/06/politics/house-vote-israel-aid-package/"
  },
  {
    "text": "In chaotic scene, Republicans argue with GOP lawmaker after ‘no’ vote on impeachment  —  Moments before the vote to impeach Homeland Security Secretary Alejandro Mayorkas narrowly failed Tuesday evening, a chaotic scene unfolded on the House floor.  —  The vote had unexpectedly come to a tie … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/06/house-republicans-yell-gallagher-impeachment-vote/"
  },
  {
    "text": "Ronna McDaniel, R.N.C. Chairwoman, Plans to Step Down  —  Donald Trump is likely to back an election denier, Michael Whatley, the head of the North Carolina G.O.P., to replace her.  —  The chairwoman of the Republican National Committee, Ronna McDaniel, has told former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/02/06/us/politics/ronna-mcdaniel-rnc-trump.html"
  },
  {
    "text": "Biden pledges to campaign “every day” on Trump's border meddling  —  In a stark reversal of his campaign messaging, President Biden vowed to tell voters “every day between now and November” that former President Trump and his GOP allies in Congress are the “only reason the border is not secure.”",
    "url": "https://www.axios.com/2024/02/07/biden-border-security-blame-trump"
  },
  {
    "text": "‘They Are A Disaster’: Democrats ‘Disgusted’ By GOP Reversal On Securing Border  —  “They don't have the backbone, the guts, the spine to resist the blandishments of Trump even when they know he's wrong,” Sen. Chuck Schumer said.  —  LOADING  —  WASHINGTON ― Senate Democrats teed off … ",
    "url": "https://www.huffpost.com/entry/border-deal-republicans-ukraine_n_65c241abe4b069b665dce357"
  },
  {
    "text": "Gaetz, Stefanik offer resolution declaring Trump ‘did not engage in insurrection’  —  Reps. Matt Gaetz (R-Fla.) and Elise Stefanik (R-N.Y.) unveiled a resolution Tuesday that declares former President Trump “did not engage in insurrection or rebellion against the United States.”",
    "url": "https://thehill.com/homenews/house/4451345-gaetz-stefanik-offer-resolution-declaring-trump-did-not-engage-in-insurrection/"
  },
  {
    "text": "Trump is not immune from prosecution in his 2020 election interference case, US appeals court says  —  A federal appeals panel ruled Tuesday that Donald Trump can face trial on charges that he plotted to overturn the results of the 2020 election, sharply rejecting the former president's claims … ",
    "url": "https://apnews.com/article/trump-capitol-riot-presidential-immunity-appeal-46c2d7fc7807cd3262764d35e47f390e"
  },
  {
    "text": "Not wearing a mask during COVID-19 health emergency isn't a free speech right, appeals court says  —  A federal appeals court has shot down claims that there's a First Amendment right not to wear face masks during the COVID-19 outbreak  —  TRENTON, N.J. — A federal appeals court shot … ",
    "url": "https://abcnews.go.com/Health/wireStory/wearing-mask-covid-19-health-emergency-isnt-free-106996447"
  },
  {
    "text": "A 7,000-Pound Car Smashed Through a Guardrail.  That's Bad News for All of Us.  —  It's a nightmare situation on a highway: Your car hits a patch of ice and starts to skid.  Unable to regain control, you panic as you veer toward the roadway's edge.  —  In emergencies like this, guardrails provide a failsafe.",
    "url": "https://slate.com/business/2024/02/car-safety-guardrails-bloat-electric-vehicles.html"
  },
  {
    "text": "Former State Department security officer arrested on Jan. 6 charges  —  A former U.S. State Department security officer was arrested Tuesday after being identified as having been at the Capitol during the Jan. 6, 2021, insurrection. … - Investigators identified him using Google location data … ",
    "url": "https://www.axios.com/2024/02/07/state-department-security-officer-arrested-jan-6"
  },
  {
    "text": "JPL Workforce Update  —  Workforce statement and memo to employees. … - I am directing most employees to work from home tomorrow, Wednesday, February 7, so everyone can be in a safe, comfortable environment on a stressful day. … - Tomorrow, leadership (mostly at the Division and Directorate level) … ",
    "url": "https://www.jpl.nasa.gov/news/jpl-workforce-update"
  },
  {
    "text": "Texas Company Was Behind Voter Robocalls That Impersonated Biden, N.H. Says  —  The state attorney general said the calls, which used a voice that sounded like President Biden's to discourage voting, originated with a company called Life Corporation.  —  The New Hampshire attorney general … ",
    "url": "https://www.nytimes.com/2024/02/06/us/politics/biden-robocall-new-hampshire.html"
  },
  {
    "text": "Nikki Haley loses to ‘none of these candidates’ in the Nevada GOP primary  —  NBC News projects that more voters chose not to pick a candidate at all than back Haley.  Trump wasn't on the ballot, since he's participating in Thursday's caucus, instead.  —  Nikki Haley faced no major challenger Tuesday in Nevada's presidential primary.",
    "url": "https://www.nbcnews.com/politics/2024-election/haley-loses-nevada-republican-primary-without-trump-rcna137367"
  },
  {
    "text": "FDA says hands tied after suspect named in applesauce lead poisonings  —  Authorities in Ecuador have named a suspect in their investigation of now-recalled lead-tainted applesauce, which has been linked to poisonings of more than 400 Americans across 43 states, the Food and Drug Administration … ",
    "url": "https://www.cbsnews.com/news/tainted-lead-applesauce-wanabana-recall-cinnamon-carlos-aguilera-accused/"
  },
  {
    "text": "Donald Trump paid more than $2.3 million in donor money to law firms helping Ivanka Trump with her legal problems last year  — A PAC controlled by Donald Trump paid millions of dollars to a law firm representing Ivanka Trump.  — Firms representing Ivanka in the NY Attorney General's lawsuit … ",
    "url": "https://www.businessinsider.com/donald-trump-pac-gave-millions-donor-money-lawyer-ivanka-2024-2"
  }
]