[
  {
    "text": "Trump Goes Crazy on Trade  —  “Liberation Day” is even worse than expected  —  Just a quick update after Trump's Rose Garden speech.  —  I guess it's just possible that when we get details about the Trump tariffs they will be lower than what he just announced, but based on what he said, he's gone full-on crazy.",
    "url": "https://paulkrugman.substack.com/p/trump-goes-crazy-on-trade"
  },
  {
    "text": "Dow futures tumble 900 points, S&P 500 futures lose 3% on Trump's tariff rollout: Live updates  —  U.S. stock futures cratered as President Donald Trump unveiled sweeping tariffs of at least 10% and even higher for some countries, raising the risks of a global trade war that hits the already sputtering U.S. economy.",
    "url": "https://www.cnbc.com/2025/04/02/stock-market-today-live-updates-trump-tariffs.html"
  },
  {
    "text": "Investors flee U.S. stocks as markets react sharply to Trump's tariff plan  —  Initial market indications on early Wednesday evening were that many investors had expected Trump's tariffs to be far less expansive.  —  Global markets reacted sharply and swiftly after President Donald Trump revealed … ",
    "url": "https://www.nbcnews.com/business/markets/investors-flee-us-stocks-markets-react-sharply-trumps-tariff-plan-rcna199390"
  },
  {
    "text": "Here's How Markets Are Responding to Trump's Tariffs Announcement  —  Financial markets have been volatile as President Trump outlines his trade policies from the Rose Garden.",
    "url": "https://www.wsj.com/livecoverage/trump-tariffs-trade-war-stock-market-04-02-2025/card/here-s-how-markets-are-responding-to-trump-s-tariffs-announcement-o1rHNZUyVcCzKLMRmB11"
  },
  {
    "text": "Launching the Economic Version of the Iraq War.  —  Tariffs are like military actions.  They're ‘good’ or ‘bad’ based on specifics: Why, how, at what cost, toward what end.  Donald Trump has just committed US power in a profoundly stupid way.  —  ∙ Paid",
    "url": "https://fallows.substack.com/p/launching-the-economic-version-of"
  },
  {
    "text": "Trump Tariffs Hit Antarctic Islands Inhabited by Zero Humans and Many Penguins  —  The Heard and McDonald Islands are among the dozens of targets of President Donald Trump's latest round of tariffs.  But they have no exports, because no one lives there.  —  On Wednesday, President Donald … ",
    "url": "https://www.wired.com/story/trump-tariffs-antarctic-islands-heard-mcdonald/"
  },
  {
    "text": "Trump slaps at least 10% tariffs on almost all imports in ‘Declaration of Economic Independence’: ‘Half of what they are charging us’  —  WASHINGTON — President Trump declared a national emergency Wednesday to impose his sweeping “Liberation Day” tariffs on almost all imports … ",
    "url": "https://nypost.com/2025/04/02/us-news/trump-slaps-at-least-10-tariffs-on-all-imports-in-declaration-of-economic-independence-half-of-what-they-could-be/"
  },
  {
    "text": "House Democrats plan to force vote on killing Trump tariffs  —  The top Democrat on the House Foreign Affairs Committee said Wednesday he plans to force a vote on blocking the across-the-board tariffs announced by President Trump.  —  Why it matters: The vote would force Republicans … ",
    "url": "https://www.axios.com/2025/04/02/house-democrats-force-vote-trump-tariffs"
  },
  {
    "text": "McConnell breaks with party to reject Trump's Canada tariffs  —  Sen. Mitch McConnell privately indicated to Sen. Tim Kaine he would back the Virginia Democrat's resolution to undo President Donald Trump's Canada tariffs.  Kaine told reporters Wednesday that the former GOP leader told … ",
    "url": "https://www.politico.com/live-updates/2025/04/02/congress/mcconnell-breaks-with-party-to-reject-trumps-canada-tariffs-00266037"
  },
  {
    "text": "Here's The Full List Of Trump's Reciprocal Tariffs Announced Wednesday  —  President Donald Trump announced what he said were “kind” reciprocal tariffs against more than 180 countries Wednesday, along with a baseline tariff against other countries, delivering the most sweeping tariff package the U.S. has implemented in decades.",
    "url": "https://www.forbes.com/sites/mollybohannon/2025/04/02/heres-the-full-list-of-trumps-reciprocal-tariffs-announced-wednesday/"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Declares National Emergency to Increase our Competitive Edge, Protect our Sovereignty, and Strengthen our National and Economic Security  —  PURSUING RECIPROCITY TO REBUILD THE ECONOMY AND RESTORE NATIONAL AND ECONOMIC SECURITY: Today … ",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/04/fact-sheet-president-donald-j-trump-declares-national-emergency-to-increase-our-competitive-edge-protect-our-sovereignty-and-strengthen-our-national-and-economic-security/"
  },
  {
    "text": "Live Updates: Trump Unveils Sweeping Tariffs on All Imports  —  A 10 percent tariff will apply to all countries, but key trading partners like Europe and China will face rates two and three times as high.  —  Here's the latest.  —  President Trump unveiled his most expansive tariffs to date … ",
    "url": "https://www.nytimes.com/live/2025/04/02/business/trump-tariffs-liberation-day"
  },
  {
    "text": "Senate Republicans buck Trump, join Dems in rejecting Canada tariffs  —  GOP lawmakers rejected a pressure campaign from the Trump administration to adhere to party loyalty on “Liberation Day.”  —  The Republican-led Senate has delivered a rare rebuke of President Donald Trump and his signature trade agenda.",
    "url": "https://www.politico.com/news/2025/04/02/senate-republicans-buck-trump-join-dems-in-rejecting-canada-tariffs-00267480"
  },
  {
    "text": "Waltz's team set up at least 20 Signal group chats for crises across the world  —  It's a more extensive use of the app than previously reported and sheds new light on how commonly the Trump administration's national security team relies on Signal.  —  National security adviser Mike Waltz's … ",
    "url": "https://www.politico.com/news/2025/04/02/waltzs-team-set-up-at-least-20-signal-group-chats-for-crises-across-the-world-00266845"
  },
  {
    "text": "Trump Tells Inner Circle That Musk Will Leave Soon  —  The president is pleased with Musk but the decision comes as the tech mogul increasingly looks like a political liability.  —  President Donald Trump has told his inner circle, including members of his Cabinet, that Elon Musk will be stepping … ",
    "url": "https://www.politico.com/news/magazine/2025/04/02/trump-musk-leaving-political-liability-00265784"
  },
  {
    "text": "Musk to keep spending on politics despite Wisconsin loss, GOP doubts  —  The billionaire, whose network poured more than $20 million into the contest, will remain heavily involved, said people familiar with the plans.  —  Just now  —  A loss in a high-stakes Wisconsin judicial contest … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/02/musk-spending-politics-republicans-campaigns/"
  },
  {
    "text": "University Declaration for Rümeysa Öztürk  —  Please see below a declaration by Tufts University in support of a motion filed today by Rümeysa Öztürk's legal team in Öztürk v. Hyde in U.S. District Court in Massachusetts.  —  Best regards,  —  President",
    "url": "https://www.tufts.edu/president/speeches-and-messages/04022025-university-declaration-for-rumeysa-ozturk"
  },
  {
    "text": "Legal Organizations Across Ideologies File Amicus Brief Urging Court to Enjoin Executive Order Targeting Perkins Coie  —  The order targets Perkins Coie for its past voting rights litigation  —  WASHINGTON - On March 6, the Trump administration issued an executive order placing sanctions … ",
    "url": "https://www.aclu.org/press-releases/legal-organizations-across-ideologies-file-amicus-brief-urging-court-to-enjoin-executive-order-targeting-perkins-coie"
  },
  {
    "text": "Trump approval falls to 43%, lowest since returning to office, Reuters/Ipsos poll finds  —  President Donald Trump's approval rating fell to 43%, the lowest since his return to office, as Americans soured on his tariff moves and his administration's handling of information about a military strike in Yemen, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/default/trump-approval-falls-43-lowest-since-returning-office-reutersipsos-poll-finds-2025-04-02/"
  },
  {
    "text": "How to leak to a journalist  —  Planning to leak?  Read these tips first.  —  There's a lot out there to leak.  —  The second Trump administration, historically unfriendly to the press, has thrown Washington into chaos.  Tens of thousands of federal employees have been placed on leave … ",
    "url": "https://www.niemanlab.org/2025/04/how-to-leak-to-a-journalist/"
  },
  {
    "text": "The Mystery Buyer of That $23 Million DC Mansion?  Mark Zuckerberg.  —  The Meta chief is the latest mogul to have a personal embassy in Donald Trump's Washington.  —  Mark Zuckerberg is the latest billionaire to shell out tens of millions of dollars for a pricey outpost in Donald Trump's gilded capital.",
    "url": "https://www.politico.com/news/magazine/2025/04/02/mark-zuckerberg-washington-dc-home-trump-real-estate-00267270"
  },
  {
    "text": "Judge dismisses corruption case against New York City Mayor Eric Adams  —  A federal judge dismissed New York City Mayor Eric Adams' corruption case on Wednesday, acquiescing to the Justice Department's extraordinary request to set aside criminal charges so the Democrat could help with President Donald Trump's immigration crackdown.",
    "url": "https://apnews.com/article/new-york-mayor-eric-adams-charges-ff3730a2e870cd219e8fead8899118b1"
  },
  {
    "text": "The Stock Market Pain Is Just Getting Started.  'This is How You Sabotage the World's Economic Engine.'  —  The stock market was slumping after President Donald Trump made his tariff announcement.  To state the obvious, it was worse than investors feared and now they need to figure out what it means for stocks over the rest of 2025.",
    "url": "https://www.barrons.com/articles/stock-market-trump-tariff-economy-cc11dfab"
  },
  {
    "text": "Her Fetus Has No Heartbeat—They Still Won't Give Her An Abortion  —  It's been over a week since Elisabeth Weber found out she was miscarrying.  The South Carolina mother has been told by multiple doctors—across multiple emergency room visits—that her fetus has no heartbeat.  That the pregnancy is doomed.",
    "url": "https://jessica.substack.com/p/her-fetus-has-no-heartbeatthey-still"
  },
  {
    "text": "Supreme Court allows truck driver's lawsuit against CBD maker  —  Douglas Horn suffered chronic back and shoulder pain.  Medical Marijuana, Inc., sold him a CBD product known as “Dixie X” and said it contained no THC.  —  Just now  —  The Supreme Court cleared the way Wednesday … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/02/medical-marijuana-cbd-truck-driver-supreme-court-case/"
  },
  {
    "text": "Elon Musk Can't Take the Heat  —  The numbers say anti-Tesla protests are working.  So do Musk's increasingly unhinged actions.  —  Elon Musk has a simple diagnosis of what's ailing America: It's being destroyed by empathy.  In a long interview with Joe Rogan, in numerous tweets … ",
    "url": "https://www.motherjones.com/politics/2025/04/elon-musk-cant-take-the-heat-wisconsin-supreme-court-empathy-doge/?_thumbnail_id=1124572"
  },
  {
    "text": "Tesla sales plunge: Biggest decline in history  —  Tesla sales plunged 13% in the first three months of this year, as the company reported the largest drop in deliveries in its history by far, amid backlash against CEO Elon Musk ﻿and as growing competition from other automakers' electric vehicles took … ",
    "url": "https://cnn.com/2025/04/02/business/tesla-sales/"
  },
  {
    "text": "Emails Confirm Social Security Administration Canceled Maine Contracts As Political Payback  —  Acting commissioner Leland Dudek called Maine Gov. Janet Mills a “petulant child” for defying Donald Trump.  —  WASHINGTON ― Emails show that the Social Security Administration canceled contracts … ",
    "url": "https://www.huffpost.com/entry/janet-mills-social-security-maine-leland-dudek_n_67ed2d99e4b0b937ab8f135c"
  }
]