[
  {
    "text": "Texas House votes to issue arrest warrants for Democrats who left state to block congressional redistricting  —  The warrants apply only within state lines, making them largely symbolic as most of the legislators in question decamped to Illinois, New York and Massachusetts.",
    "url": "https://www.texastribune.org/2025/08/04/texas-democrats-house-warrants-arrest-quorum-break/"
  },
  {
    "text": "GOP effort forms to shut down Texas vs. California redistricting war … - The bill would “stop a damaging redistricting war from breaking out across the country,” Kiley said in a press release previewing the measure.  — Rep. Don Bacon (R-Neb.), who previously told Axios he is uneasy … ",
    "url": "https://www.axios.com/2025/08/04/california-texas-redistricting-newsom-abbott"
  },
  {
    "text": "Abbott orders arrest of Democrats who fled Texas  —  Texas Gov. Greg Abbott (R) on Monday ordered the arrest of the Democrats who fled the Lone Star State in an effort to halt the advancement of new congressional maps that could benefit Republicans in next year's midterms.",
    "url": "https://thehill.com/homenews/campaign/5435617-texas-democrats-flee-state/"
  },
  {
    "text": "Duffy to announce nuclear reactor on the moon … President Donald Trump named Duffy as interim administrator in July after abruptly withdrawing the nomination of billionaire Jared Isaacman amid a spat with the nominee's ally, Elon Musk.  —  Duffy also offered a directive to more quickly replace … ",
    "url": "https://www.politico.com/news/2025/08/04/nasa-china-space-station-duffy-directives-00492172"
  },
  {
    "text": "US links $1.9 billion in state disaster funds to Israel boycott stance  —  U.S. states and cities that boycott Israeli companies will be denied federal aid for natural disaster preparedness, the Trump administration has announced, tying routine federal funding to its political stance.",
    "url": "https://www.reuters.com/world/us/us-links-19-billion-state-disaster-funds-israel-boycott-stance-2025-08-04/"
  },
  {
    "text": "Purdue student detained by ICE released after stay in troubled Louisiana holding facility  —  Yeonsoo Go, 20, was detained after her immigration hearing in Manhattan and taken away by ICE agents. … WEST LAFAYETTE, Ind. — A 20-year-old Purdue University student who was detained by Immigration … ",
    "url": "https://www.wthr.com/article/news/politics/national-politics/purdue-student-detained-by-ice-and-taken-to-louisiana-holding-facility-yeonsoo-go-immigration-south-korea-pharmacy-episcopal-customs-enforecment-visa/531-87482652-6ea4-4ff9-9d7a-d60c34869820"
  },
  {
    "text": "Trump stokes conspiracies about jobs data, as White House defends firing BLS chief … President Donald Trump and one of his top economic advisors stoked baseless conspiracies about federal jobs data Monday, suggesting without evidence that Friday's weaker-than-expected jobs report had been … ",
    "url": "https://www.cnbc.com/2025/08/04/trump-bls-chief-firing-jobs-data-.html"
  },
  {
    "text": "DOJ launching grand jury investigation into Russiagate conspiracy allegations  —  Pam Bondi acts on Tulsi Gabbard's criminal referral claiming intelligence community suppression  —  EXCLUSIVE: Attorney General Pam Bondi directed her staff Monday to act on the criminal referral from Director … ",
    "url": "https://www.foxnews.com/politics/doj-launching-grand-jury-investigation-russiagate-conspiracy-allegations"
  },
  {
    "text": "Brazil Supreme Court orders house arrest of ex-president Bolsonaro  —  Brazil's Supreme Court ordered the house arrest of former President Jair Bolsonaro on Monday as he awaits trial over an alleged coup plot to overturn his 2022 election loss, which the Trump ally denies.",
    "url": "https://www.axios.com/2025/08/04/brazil-bolsonaro-house-arrest-supreme-court"
  },
  {
    "text": "State Department may require visa applicants to post bond of up to $15,000 to enter the US  —  The State Department is proposing requiring applicants for business and tourist visas to post a bond of up to $15,000 to enter the United States, a move that may make the process unaffordable for many.",
    "url": "https://apnews.com/article/state-department-visa-bond-d532b186abf6e39c621d1bd0995d7509"
  },
  {
    "text": "Top Hegseth aide tried to oust senior White House liaison from Pentagon  —  The unusual dispute received White House intervention and appears rooted in deeper frustrations over failed attempts to fill jobs on the defense secretary's staff.  —  Just now  —  Defense Secretary Pete Hegseth's acting chief … ",
    "url": "https://www.washingtonpost.com/national-security/2025/08/04/hegseth-buria-white-house-liaison-mcnitt/"
  },
  {
    "text": "Statue of Confederate General Albert Pike to be reinstalled in Washington  —  A statue of Confederate General Albert Pike, which was overturned in 2020 during the “Black Lives Matter” protests after George Floyd's murder, will be reinstalled in Washington, the National Park Service said on Monday.",
    "url": "https://www.reuters.com/world/us/statue-confederate-general-albert-pike-be-reinstalled-washington-2025-08-04/"
  },
  {
    "text": "White House Preps Order to Punish Banks That Discriminate Against Conservatives  —  The president is expected to sign an executive order as soon as this week that targets so-called debanking of businesses including crypto companies  —  The White House is preparing to step up pressure … ",
    "url": "https://www.wsj.com/finance/regulation/white-house-preps-order-to-punish-banks-that-discriminate-against-conservatives-8af18854"
  },
  {
    "text": "Incredibly Disturbing: Disgusting Hack Jim Acosta ‘Interviews’ AI Version of School Shooting Victim  —  This may be the craziest story I've ever covered on this site, and that's saying something.  Jim Acosta, who was recently booted from CNN, is promoting an “interview” he did with a deceased school shooting victim.",
    "url": "https://redstate.com/bonchie/2025/08/04/incredibly-disturbing-deranged-hack-jim-acosta-interviews-ai-version-of-school-shooting-victim-n2192443"
  },
  {
    "text": "Scoop: Brown interviewing campaign managers for Ohio Senate race  —  Former Sen. Sherrod Brown (D-Ohio) is interviewing campaign managers for a 2026 comeback bid, a clear indication that he's preparing to jump into the race to defeat Sen. Jon Husted (R-Ohio), according to three people familiar with the matter.",
    "url": "https://www.axios.com/2025/08/04/sherrod-brown-ohio-senate-race-husted"
  },
  {
    "text": "Schwarzenegger ready to fight Newsom on redistricting … Now, the fight has returned to his home state, as Newsom aims to redraw California's U.S. House maps before the midterm elections to offset a similar Republican-led effort unfolding in Texas.  Since such a move would undo … ",
    "url": "https://www.politico.com/news/2025/08/04/schwarzenegger-newsom-redistricting-00493418"
  },
  {
    "text": "Nunes defamation lawsuit over Rachel Maddow comment dismissed  —  A federal judge has dismissed a lawsuit brought by former Rep. Devin Nunes (R-Calif) against MSNBC personality Rachel Maddow nearly five years ago.  —  U.S. District Judge Kevin Castel ruled this week that Nunes failed … ",
    "url": "https://thehill.com/homenews/media/5435107-devin-nunes-lawsuit-rachel-maddow/"
  },
  {
    "text": "New non-profit law firm in DC aims to challenge Trump's executive power  —  A group of well-known Washington lawyers is opening a law firm focused on challenging President Donald Trump's executive orders and agency actions as he strives to dramatically reshape the federal government during his second term.",
    "url": "https://cnn.com/2025/08/04/politics/washington-litigation-group-trump-executive-power"
  },
  {
    "text": "How US adults are using ‘buy now, pay later’ services, according to a new AP-NORC poll  —  The vast majority of U.S. adults are at least somewhat stressed about the cost of groceries, a new poll finds, as prices continue to rise and concerns about the impact of President Donald Trump's tariffs remain widespread.",
    "url": "https://apnews.com/article/poll-cost-living-groceries-expense-stress-worry-cd183c59f034f6e87525675f3ca04864"
  },
  {
    "text": "Saquon Barkley says he declined spot on President Donald Trump's Council … Philadelphia Eagles superstar Saquon Barkley says he declined a spot on President Donald Trump's council focused on fitness and healthy living.  —  President Trump signed an executive order reviving … ",
    "url": "https://www.nbcphiladelphia.com/news/sports/nfl/philadelphia-eagles/saquon-barkley-says-he-declined-spot-on-president-donald-trumps-council/4248590/"
  },
  {
    "text": "Netanyahu government votes to dismiss attorney general  —  Israel's cabinet voted to dismiss Israel's attorney general, a key Netanyahu critic, as the U.S. grows increasingly impatient with the war in Gaza.  —  TEL AVIV — Israeli Prime Minister Benjamin Netanyahu's far-right government … ",
    "url": "https://www.washingtonpost.com/world/2025/08/04/gaza-war-netanyahu-pressure/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0MjgwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1NjYyMzk5LCJpYXQiOjE3NTQyODAwMDAsImp0aSI6ImYwMWU3OWI4LTNkMmItNDcyOS04MjMwLWZjYWYzY2U1NzM0ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzA4LzA0L2dhemEtd2FyLW5ldGFueWFodS1wcmVzc3VyZS8ifQ.ezEnwGj1AgJPLRF7oaU5pwR-KnzIKozOj1-MdyIoiJc&itid=gfta"
  },
  {
    "text": "Trump Praises ‘HOTTEST’ Sydney Sweeney Ad, Bashes Taylor Swift  —  The debacle over the Euphoria star's great “jeans” — and her politics — has made it all the way to the president … “Sydney Sweeney, a registered Republican, has the ‘HOTTEST’ ad out there.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-praises-sydney-sweeney-american-eagle-ad-1235399767/"
  },
  {
    "text": "I'm Not Panicking.  I'm Outraged.  —  I have been the subject of many spurious accusations and politically motivated attacks, but this one is in a class by itself.  According to Tulsi Gabbard — the nation's top intelligence official — my refusal to post on Twitter is being reviewed … ",
    "url": "https://www.democracydocket.com/opinion/im-not-panicking-im-outraged/"
  },
  {
    "text": "Cash Windfall From Trump's Tax Law Is Starting to Show Up at Big Companies  —  Investors are watching boosts to free cash flow as estimates of tax savings trickle out  —  The magnitude of the cash savings from this summer's federal tax legislation is starting to take shape at America's biggest companies.",
    "url": "https://www.wsj.com/finance/investing/cash-windfall-from-trumps-tax-law-is-starting-to-show-up-at-big-companies-6b519fc9"
  },
  {
    "text": "Wildfire smoke is like smoking ‘half a pack a day.’ Here's how to protect yourself  —  This story is updated to reflect the current wildfire smoke conditions in the U.S. The original story was published Jan. 8, 2025.  —  Smoke from Canadian wildfires continued to prompt air quality alerts Monday … ",
    "url": "https://www.npr.org/2025/08/04/nx-s1-5492448/health-michigan-canada-smoke-minnesota-air-quality-wildfire"
  },
  {
    "text": "Laura Loomer has the White House scrambling again — and she's far from finished  —  Laura Loomer, the controversial far-right activist with a direct line to President Donald Trump, has taken credit for a slew of recent high-profile administration firings.  But she sounds more exasperated than triumphant.",
    "url": "https://cnn.com/2025/08/04/politics/laura-loomer-trump-firings"
  },
  {
    "text": "Judges Openly Doubt Government as Justice Dept. Misleads and Dodges Orders  —  Legal experts say such concern from the bench could have a more systemic effect, eroding the healthy functioning of the courts.  —  Justice Department lawyers have long enjoyed a professional benefit when they appear in court.",
    "url": "https://www.nytimes.com/2025/08/04/us/politics/trump-justice-department-judges-courts.html?unlocked_article_code=1.bk8.hXGc.RsMmhf6YBSvy&smid=url-share"
  },
  {
    "text": "U.S. Factory Orders Declined in June  —  There has been a drop in orders for two of the past three months  —  Orders from U.S. factories fell in June, declining for two of the past three months, the Commerce Department said Monday.  —  New orders contracted 4.8% month over month to $611.7 billion in June.",
    "url": "https://www.wsj.com/economy/u-s-factory-orders-declined-in-june-50f4b81b?st=BnUTfQ"
  },
  {
    "text": "New Hegseth Leak Reveals Secret Plan for Years of Troops on U.S. Streets  —  OH BROTHER  —  Phil Hegseth wrote the document laying out how the Pentagon and DHS could help Donald Trump's immigration plans “for years.”  —  The Department of Homeland Security is looking to boost its deployment … ",
    "url": "https://www.thedailybeast.com/leaked-memo-from-pete-hegseths-brother-reveals-plot-to-ramp-up-military-use-in-the-us/"
  }
]