[
  {
    "text": "Trump is eyeing Paul Manafort for 2024 campaign role  —  The former campaign manager was pardoned by Trump for bank and tax fraud convictions and accusations he hid millions he made consulting for pro-Russian Ukrainian politicians  —  Former president Donald Trump is expected to enlist Paul Manafort … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/18/trump-manafort-2024-campaign/"
  },
  {
    "text": "How to Make Trump Pay for Embracing Jan 6th  —  At a rally in Ohio on Saturday night, Trump once again demonstrated the unequivocal danger of his candidacy for the White House.  At one point, Trump said: … The man who tried to violently overturn the election promising a “bloodbath” … ",
    "url": "https://www.messageboxnews.com/p/how-to-make-trump-pay-for-embracing"
  },
  {
    "text": "Trump doubles down on call for Liz Cheney to be prosecuted  —  Former President Trump on Sunday doubled down on his push for former Rep. Liz Cheney (R-Wyo.) to be prosecuted over allegations she and the other Jan. 6 committee members purposely withheld testimony and details from their investigation … ",
    "url": "https://thehill.com/homenews/campaign/4538333-trump-doubles-down-on-call-for-liz-cheney-to-be-prosecuted/"
  },
  {
    "text": "Putin bromance has US intelligence officials fearing second Trump term  —  Ex-president's support for the Russian strongman has experts fretting over American interests and security sources overseas  —  Donald Trump's continuing lavish praise and support for Russian president Vladimir Putin … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/18/us-intelligence-trump-putin-threat"
  },
  {
    "text": "Pelosi: Democrats ‘have to win this election’ following Trump's ‘bloodbath’ remarks  —  Former Speaker Nancy Pelosi (D-Calif.) on Sunday underscored the stakes of the November election after former President Trump warned of a “bloodbath” for the auto industry and the country if he doesn't win a second term in the White House.",
    "url": "https://thehill.com/homenews/house/4538009-pelosi-democrats-have-to-win-this-election-following-trumps-bloodbath-remarks/"
  },
  {
    "text": "Pro-Trump disruptions in Arizona county elevate fears for the 2024 vote  —  A meeting in the state's largest county, Maricopa, ended chaotically last month, raising concern that the former president's supporters could try to undercut the election  —  PHOENIX — As the board of supervisors … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/18/trump-maricopa-arizona-supervisors-election-denial/"
  },
  {
    "text": "Sonia Sotomayor Should Retire Now  —  On Election Day in 2006, Justice Antonin Scalia was 70 years old and had been serving on the Supreme Court for 20 years.  That year would have been an opportune time for him to retire—Republicans held the White House and the Senate … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/03/sonia-sotomayor-should-retire/677764/"
  },
  {
    "text": "Trump has been unable to get bond for $464 million judgment, his lawyers say  —  In a filing to an appeals court, Trump's attorneys said getting the bond needed to halt proceedings while they appeal is a “practical impossibility.”  —  Former President Donald Trump has not been able to get a bond … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-unable-get-bond-464-million-judgment-lawyers-say-rcna143860"
  },
  {
    "text": "Adult MAGA rage is making schools more dangerous for students  —  Despite the Ethan Crumbley and Nex Benedict cases, a GOP nominee to run schools wants a “firing squad” for liberals  —  Last week saw national headlines regarding two tragic stories that illustrate how MAGA radicalization of adults endangers kids in school.",
    "url": "https://www.salon.com/2024/03/18/adult-maga-rage-is-making-schools-more-for-students/"
  },
  {
    "text": "Children unintentionally shot and killed at least 157 people last year, Everytown says  —  In many cases, the children shot themselves, while others killed siblings or friends, according to the gun control advocacy group.  —  At least 157 people were killed and 270 were injured last year … ",
    "url": "https://www.nbcnews.com/news/us-news/unintentional-shootings-children-everytown-gun-safety-rcna143411"
  },
  {
    "text": "MAGA Reps Suddenly Face an Existential Threat: Themselves  —  The 2024 primaries are just getting started, but there's good reason to believe this year could be a lot more brutal for Republicans than recent ones.  —  It would be hard to argue that Rep. Mike Bost (R-IL) … ",
    "url": "https://www.thedailybeast.com/maga-reps-suddenly-face-an-existential-threat-themselves"
  },
  {
    "text": "Biden-Trump rematch dread verges on denial for some voters  —  Public opinion research finds some Americans don't think Trump and Biden will be the parties' nominees  —  President Biden and former president Donald Trump have been running for 11 and 16 months, respectively.",
    "url": "https://www.washingtonpost.com/politics/2024/03/18/biden-trump-election-rematch/"
  },
  {
    "text": "New Studies Find No Evidence of Brain Injury in Havana Syndrome Cases  —  The findings from the National Institutes of Health are at odds with previous research that looked into the mysterious health incidents experienced by U.S. diplomats and spies.  —  New studies by the National Institutes … ",
    "url": "https://www.nytimes.com/2024/03/18/us/politics/havana-syndrome-brain-studies-nih.html"
  },
  {
    "text": "Bernie Sanders unveils his latest insane idea  —  What if every weekend could be a long weekend?  That's the question some people are asking after Sen. Bernie Sanders (I-VT) introduced legislation this week to reduce the standard workweek to 32 hours — supposedly, with no loss in pay!",
    "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/2923145/bernie-sanders-unveils-latest-insane-idea/"
  }
]