[
  {
    "text": "Schumer sets up path for Senate to move first on funding stopgap  —  Faced with the House stalemate over a government stopgap funding bill, Senate Majority Leader Chuck Schumer (D-N.Y.) on Thursday set up a path for the Senate to move first on a bill to fund the government beyond Sept. 30.",
    "url": "https://thehill.com/homenews/senate/4217419-schumer-sets-up-path-for-senate-to-move-first-on-funding-stopgap/"
  },
  {
    "text": "Right-Wing Rebels Block Defense Bill Again, Rebuking McCarthy on Spending  —  It was the second time in a week that hard-right Republicans had defied Speaker Kevin McCarthy on a spending measure, signaling that there was still no G.O.P. agreement on a bill to fund the government.",
    "url": "https://www.nytimes.com/2023/09/21/us/politics/mccarthy-spending-house-republicans.html"
  },
  {
    "text": "House GOP erupts as conservatives block defense bill again  —  To many in the conference, it proved that Speaker Kevin McCarthy has no power to avert a fast-approaching shutdown.",
    "url": "https://www.politico.com/live-updates/2023/09/21/congress/house-gop-fails-move-defense-bill-again-00117356"
  },
  {
    "text": "The Ludicrous Agony of Rupert Murdoch  —  It's nice to know that Fox News, which has so deranged America while making Rupert Murdoch ungodly sums of money, has in the end made Murdoch miserable, at least if the journalist Michael Wolff is to be believed.  But the consolation is a small one.",
    "url": "https://www.nytimes.com/2023/09/21/opinion/rupert-murdoch-fox-news.html"
  },
  {
    "text": "Why I Can Never Forgive Rupert Murdoch  —  The Fox News honcho destroyed the real conservative movement I still hold dear, and he did it for the money. … Rupert Murdoch's decision to step down as chairman of the Fox Corporation and News Corp ends an era that has upended American politics … ",
    "url": "https://www.thedailybeast.com/why-i-can-never-forgive-rupert-murdoch"
  },
  {
    "text": "Rupert Murdoch, whose creation of Fox News made him a force in American politics, is stepping down  —  Magnate Rupert Murdoch's surprise announcement Thursday that he's stepping down as leader of his two companies leaves his son Lachlan firmly in line of succession at Fox and the rest of the media empire.",
    "url": "https://apnews.com/article/murdoch-fox-quit-emeritus-30286a4a3107b7bde612adbfc7891958"
  },
  {
    "text": "‘Weak in the knees’: Former Trump ally Nikki Haley blasts Trump in new speech  —  2024 GOP presidential candidate Nikki Haley responds to a question about how former President Donald Trump, her opponent for the Republican nomination, will be remembered in history.",
    "url": "https://www.cnn.com/videos/politics/2023/09/21/nikki-haley-donald-trump-rotary-club-history-response-vpx.cnn"
  },
  {
    "text": "U.S. Government Contractor Arrested on Espionage Charges  —  For Immediate Release  —  IT Help Desk Technician Charged with Transferring Classified Materials to a Foreign Government  —  A U.S. government contractor was arrested on Aug. 24 based on espionage charges in a complaint unsealed today.",
    "url": "https://www.justice.gov/opa/pr/us-government-contractor-arrested-espionage-charges"
  },
  {
    "text": "Manchin circulates proposal to reverse Schumer on dress code  —  Centrist Sen. Joe Manchin (D-W.Va.) is circulating a proposal to reestablish the Senate's dress code, which Senate Majority Leader Chuck Schumer (D-N.Y.) loosened over the weekend to allow senators to wear whatever they want on the Senate floor … ",
    "url": "https://thehill.com/homenews/senate/4216746-manchin-circulates-proposal-to-reverse-schumer-on-dress-code/"
  },
  {
    "text": "‘Sexy’ Biden and family get-togethers: Comer views new email details  —  Emails provided to House Oversight Chair Jim Comer included no smoking guns.  —  House Oversight Chair James Comer, who is investigating President Joe Biden for what Republicans call potentially impeachable offenses … ",
    "url": "https://www.politico.com/news/2023/09/21/biden-james-comer-emails-00117464"
  },
  {
    "text": "FACT SHEET: Biden-Harris Administration Announces New Actions to Reduce Greenhouse Gas Emissions and Combat the Climate Crisis  —  New steps will catalyze action across the federal government to account for climate change impacts in budgeting, procurement, and other agency decisions, and save hardworking families money",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/09/21/fact-sheet-biden-harris-administration-announces-new-actions-to-reduce-greenhouse-gas-emissions-and-combat-the-climate-crisis/"
  },
  {
    "text": "Senate confirms Army and Marine chiefs, bucking Tuberville logjam  —  But Democrats aren't declaring victory yet as more than 300 more officers are in limbo.  —  The Senate overwhelmingly approved two four-star generals to lead the Army and Marine Corps Thursday, as members made a small dent … ",
    "url": "https://www.politico.com/news/2023/09/21/senate-confirms-george-to-lead-army-bucking-tuberville-logjam-00117394"
  },
  {
    "text": "Bloomberg launches $500 million war to close all coal plants and block new gas plants  —  Former New York City Mayor Michael Bloomberg has said he will spend $500 million on a campaign to close all remaining U.S. coal plants and block the construction of any new natural gas plants.",
    "url": "https://www.washingtonexaminer.com/policy/economy/bloomberg-launches-war-close-coal-plants-block-new-gas-plants"
  },
  {
    "text": "Former justices see no legitimate reason to impeach Janet Protasiewicz  —  The Wisconsin Constitution is clear: Impeaching a justice for following the rules that govern her conduct is an attack on the very independence of the court and violates the separation of powers.",
    "url": "https://madison.com/opinion/column/analysis-former-justices-see-no-legitimate-reason-to-impeach-janet-protasiewicz/article_08755b88-5815-11ee-b0dd-676f46f930a0.html"
  },
  {
    "text": "Democratic Senator Accused of Cartoonish Corruption  —  New Jersey Democrat Bob Menendez possesses an ability to hang on through corruption scandals that would bury most politicians.  In 2018, less than one year after a federal bribery trial for accepting lavish gifts from a Florida eye doctor ended … ",
    "url": "https://nymag.com/intelligencer/2023/09/senator-robert-menendez-accused-of-cartoonish-corruption.html"
  },
  {
    "text": "The Patriot  —  How General Mark Milley protected the Constitution from Donald Trump  —  The missiles that comprise the land component of America's nuclear triad are scattered across thousands of square miles of prairie and farmland, mainly in North Dakota, Montana, and Wyoming.",
    "url": "https://www.theatlantic.com/magazine/archive/2023/11/general-mark-milley-trump-coup/675375/"
  },
  {
    "text": "UAW Files Labor Complaint Against Sen. Tim Scott for Saying “You Strike, You're Fired.”  —  “Telling workers they'll be fired for striking is violating federal labor law, and that's not something becoming of a senator.”  —  AFTER INVOKING THE legacy of Ronald Reagan to suggest … ",
    "url": "https://theintercept.com/2023/09/21/uaw-strike-tim-scott/"
  },
  {
    "text": "Evangelist, wife face multiple child rape, sexual abuse charges in Murfreesboro  —  The charges stem from actions that were alleged to have occurred in February 2021.  —  NASHVILLE, Tenn. (WSMV) - An evangelist is facing a slew of child rape and sexual abuse charges in Murfreesboro, according to court records.",
    "url": "https://www.wsmv.com/2023/09/20/evangelist-wife-face-multiple-child-rape-sexual-abuse-charges-murfreesboro/"
  },
  {
    "text": "How unusual is it for the House to fail to pass a rule?  A look at the recent history  —  Since 1995, the House has failed to pass a rule eight times, all during Republican-led House chambers - until this year.  —  Newt Gingrich had six rule votes fail during his four-year tenure as speaker … ",
    "url": "https://www.cnn.com/2023/09/21/politics/house-failure-to-pass-rule-explainer/"
  }
]