[
  {
    "text": "Biden Narrows Gap With Trump in Swing States Despite Debate Loss  —  The incumbent trails his GOP rival by just 2 points across key states, a Bloomberg News/Morning Consult shows, even as three in 10 Democrats say he should leave the race.  —  President Joe Biden registered his best showing yet … ",
    "url": "https://www.bloomberg.com/news/features/2024-07-06/biden-narrows-trump-s-election-lead-in-key-states-after-debate-poll"
  },
  {
    "text": "'It's Shakespearean': Long-simmering tensions between Biden's family and aides spill out  —  Biden has taken full responsibility for his debate performance, saying in an interview on Friday it was “nobody's fault but mine.”  —  President Joe Biden's family is attempting to become more involved … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/tensions-biden-family-aides-spill-rcna160468"
  },
  {
    "text": "President Biden's physician met with Parkinson's disease specialist in White House  —  A top Washington D.C. neurologist had a meeting with President Biden's personal doctor at the White House earlier this year, visitor logs reviewed by The Post show.  —  Dr. Kevin Cannard … ",
    "url": "https://nypost.com/2024/07/06/us-news/president-bidens-physician-met-with-parkinsons-disease-specialist-in-white-house/"
  },
  {
    "text": "Biden's team drafted the questions for his first post-debate interviews … - WURD is the only African-American owned and operated talk radio station in Pennsylvania, but the White House's director of Black media was not part of the process.  — It is the latest instance of the White House continuing … ",
    "url": "https://www.axios.com/2024/07/06/biden-interview-draft-questions-wurd"
  },
  {
    "text": "Biden Aides Provided Questions in Advance for His Radio Interviews  —  A radio host told CNN that she had received a list of eight questions to approve before one of the president's interviews on Wednesday.  —  The questions asked of President Biden by two radio interviewers this week … ",
    "url": "https://www.nytimes.com/2024/07/06/us/politics/biden-radio-interviews-questions.html"
  },
  {
    "text": "Former Trump Advisor Stephen Miller Denies Involvement With Project 2025, Ad Says Otherwise  —  WE GOT THE RECEIPTS  —  Former Trump advisor Stephen Miller claimed he has “never been involved with Project 2025” in a post on X on Saturday, however, a video on the Project 2025 YouTube channel says otherwise.",
    "url": "https://www.thedailybeast.com/former-trump-advisor-stephen-miller-squirms-to-deny-involvement-with-project-2025-ad-says-otherwise"
  },
  {
    "text": "We should all be terrified of Trump's Project 2025  —  The presumptive Republican nominee has promised to give rightwing evangelical Christians what they want - and more  —  “Project 2025” is nothing short of a 900-page blueprint for guiding Donald Trump's second term of office if he's re-elected.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/06/trump-project-2025-robert-reich"
  },
  {
    "text": "Why is the pundit class so desperate to push Biden out of the race?  —  Yes, Biden had a bad debate - but so did Trump.  The media is once again repeating the mistakes of 2016  —  I am not usually one to offer diagnoses of people I've never met, but it does seem like the pundit class … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/06/biden-trump-race-rebecca-solnit"
  },
  {
    "text": "Trump wins delay in classified documents case … - It's an opinion that Trump has used to throw a wrench in prosecutors' plans although the SCOTUS decision on July 1 failed to clarify whether his alleged conduct on Jan. 6 was protected. … - Trump's attorneys have also used presidential immunity … ",
    "url": "https://www.axios.com/2024/07/06/donald-trump-classified-documents-delay"
  },
  {
    "text": "The Supreme Court folds  —  The Supreme Court's ruling in Trump v. United States is its worst decision of my lifetime.  John Roberts's sloppy, arrogant, contradictory majority opinion provides license for any future president to lie, cheat, steal, suppress dissent, and — if they have the stomach for it — assassinate.",
    "url": "https://radleybalko.substack.com/p/the-supreme-court-folds"
  },
  {
    "text": "The French republic is under threat.  We are 1,000 historians and we cannot remain silent  —  Patrick Boucheron, Antoine Lilti and others  —  We implore voters not to turn their backs on our nation's history.  Go out and defeat the far right in Sunday's vote",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/06/french-republic-voters-election-far-right"
  },
  {
    "text": "FACT FOCUS: Online reports falsely claim Biden suffered a ‘medical emergency’ on Air Force One  —  False reports that President Joe Biden had a “medical emergency” while traveling back to Delaware on Friday after a campaign stop in Wisconsin, spread widely on social media on Friday.  They were without merit.",
    "url": "https://www.seattletimes.com/nation-world/fact-focus-online-reports-falsely-claim-biden-suffered-a-medical-emergency-on-air-force-one/"
  },
  {
    "text": "Hamas clears the way for a possible cease-fire in Gaza after dropping key demand, officials say  —  (AP video/Abdel Kareem Hana, Production: Wafaa Shurafa)  —  ‘Even if we had money, there are no goods’: Palestinians at Gaza refugee camp suffer food shortages",
    "url": "https://apnews.com/article/israel-hamas-war-palestinians-gaza-ceasefire-77910b6fae70ac1ff4eb3ac278852b44"
  },
  {
    "text": "American allies fear Biden is finished and can't beat Trump  —  “We're not sure that, even if he wins, he can survive four years more,” said one official from a European NATO country.  —  Diplomats and world leaders preparing for next week's NATO summit are privately expressing acute concern … ",
    "url": "https://www.politico.com/news/2024/07/06/american-allies-fear-biden-trump-00166700"
  },
  {
    "text": "Whoever the Democratic Candidate Is, Americans Have Already Lost  —  I watched the debate from a pub in Ireland.  A man sitting next to me pegged me for a Yank.  “Sorry about all that — screwed no matter what you do,” he said before the final minutes of the debate ended.",
    "url": "https://www.nytimes.com/2024/07/06/opinion/biden-debate-scotus-immunity.html"
  },
  {
    "text": "Robert F. Kennedy Jr. says he 'won't take sides' on what happened on 9/11  —  The independent presidential candidate made the remark in a social media post, later saying that he was referring to “possible Saudi involvement” in the 2001 terror attacks.  —  Independent presidential candidate … ",
    "url": "https://www.nbcnews.com/politics/2024-election/robert-f-kennedy-jr-wont-take-sides-911-conspiracy-theories-rcna160255?taid=66894e06bd50270001089b0e"
  }
]