[
  {
    "text": "Exclusive: John Kelly goes on the record to confirm several disturbing stories about Trump  —  John Kelly, the longest-serving White House chief of staff for Donald Trump, offered his harshest criticism yet of the former president in an exclusive statement to CNN.",
    "url": "https://www.cnn.com/2023/10/02/politics/john-kelly-donald-trump-us-service-members-veterans/"
  },
  {
    "text": "John Bolton: It's ‘entirely possible’ Trump wants his supporters to kill Mark Milley  —  Former National Security Adviser John Bolton warned CNN's Jake Tapper on Monday that former President Donald Trump may actually want one of his followers to take matters into their own hands and mete … ",
    "url": "https://www.rawstory.com/trump-supporters-mark-milley/"
  },
  {
    "text": "Is it too late for McCarthy to save his job as speaker? … But it might be too late.  —  With the House on the brink of voting on a motion to oust McCarthy, there's very strong sentiment inside the Democratic Caucus against helping the speaker, according to multiple aides and lawmakers.",
    "url": "https://punchbowl.news/article/kevin-mccarthy-running-out-of-time-to-save-job/"
  },
  {
    "text": "Rep. Matt Gaetz files resolution to oust Kevin McCarthy as speaker of the House  —  Republican Rep. Matt Gaetz filed a resolution late Monday to oust Kevin McCarthy as speaker, setting up a likely showdown vote in the House in the days ahead.  The far-right Republican from Florida … ",
    "url": "https://apnews.com/article/kevin-mccarthy-matt-gaetz-speaker-vacate-congress-e7e5ccc6cf79ccbf5b4a7b73b9d5a3ae"
  },
  {
    "text": "10/3/23 ☀️ Punchbowl News AM … But it might be too late.  —  With the House on the brink of voting on a motion to oust McCarthy, there's very strong sentiment inside the Democratic Caucus against helping the speaker, according to multiple aides and lawmakers.",
    "url": "https://punchbowl.news/archive/10323-punchbowl-news-am/"
  },
  {
    "text": "What was Elon Musk's strategy for Twitter?  —  A year after the world's richest man acquired the social media platform, a game plan published by a fired Trump White House staffer provides a clue.  —  On the day that public records revealed that Elon Musk had become Twitter's biggest shareholder … ",
    "url": "https://www.nbcnews.com/tech/was-elon-musks-strategy-twitter-rcna118490"
  },
  {
    "text": "Rep. Cuellar unharmed in armed carjacking in DC  —  Rep. Henry Cuellar (D-Texas) was carjacked in Washington, D.C. on Monday night, according to a staffer from his office.  —  Cuellar was parking his car outside of his apartment in Navy Yard, D.C. when three armed individuals approached … ",
    "url": "https://thehill.com/homenews/house/4235073-rep-cuellar-unharmed-in-armed-carjacking-in-dc/"
  },
  {
    "text": "Congressman Henry Cuellar carjacked at gunpoint in Washington  —  Congressman Cuellar was carjacked at gunpoint Monday.  —  LIVE  —  Democratic Texas Rep. Henry Cuellar was carjacked at gunpoint Monday night near his residence in the Navy Yard area of Washington, D.C. just blocks from the Capitol.",
    "url": "https://abcnews.go.com/Politics/congressman-henry-cuellar-carjacked-gunpoint-washington-sources/story?id=103676681"
  },
  {
    "text": "Nobel Prize Awarded to Covid Vaccine Pioneers  —  The physiology or medicine prize for Katalin Karikó and Drew Weissman recognized work that led to the development of vaccines that were administered to billions around the world.  —  Katalin Karikó and Drew Weissman … ",
    "url": "https://www.nytimes.com/2023/10/02/health/nobel-prize-medicine.html"
  },
  {
    "text": "Two Anne Arundel County Men, Including Department of Defense Deputy Chief, Charged with Facilitating Dog Fighting Ring  —  For Immediate Release  —  U.S. Attorney's Office, District of Maryland  —  A Related Federal Search Recovered Veterinary Steroids and a Device Consisting of an Electrical Plug … ",
    "url": "https://www.justice.gov/usao-md/pr/two-anne-arundel-county-men-including-department-defense-deputy-chief-charged"
  },
  {
    "text": "Playbook: Inside a new senator's big decision  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  CAREFUL OUT THERE — Rep. HENRY CUELLAR (D-Texas) was carjacked at gunpoint last night outside his apartment building south of the Capitol, Sarah Ferris and Nick Wu first reported.",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/03/inside-a-new-senators-big-decision-00119609"
  },
  {
    "text": "No Labels makes its choice  —  No Labels claims to be a non-partisan centrist organization.  It describes itself as a movement for the “politically homeless.”  But in practice, it has supported Republicans and very conservative Democrats.  This year, No Labels has spent millions … ",
    "url": "https://popular.info/p/no-labels-makes-its-choice"
  },
  {
    "text": "Drug companies agree to participate in Biden Medicare price negotiation program  —  All 10 manufacturers of the first drugs selected for Medicare price negotiations will be participating, the White House said Tuesaday, even as many of them are currently suing the administration in an effort to halt the process.",
    "url": "https://thehill.com/policy/healthcare/4235318-drug-companies-agree-to-participate-price-negotiation/"
  },
  {
    "text": "FBI interviewed individuals who accuse Amy Coney Barrett faith group of abuse  —  Revealed: individuals contacted by agency gave detailed accounts of abusive behavior they allegedly experienced or witnessed  —  The FBI has interviewed several individuals who have alleged they were abused … ",
    "url": "https://www.theguardian.com/us-news/2023/oct/03/fbi-people-of-praise-amy-coney-barrett-faith-group-abuse-allegations"
  },
  {
    "text": "Former Detroit police chief James Craig enters the GOP Senate race in Michigan  —  Craig joins a Republican primary that already includes former Rep. Mike Rogers, in a state where Trump has remained influential in intra-party politics.  —  James Craig, the former Detroit police chief … ",
    "url": "https://www.nbcnews.com/politics/2024-election/former-detroit-police-chief-james-craig-enters-gop-senate-race-michiga-rcna118440"
  },
  {
    "text": "'They're just meat': Russia deploys punishment battalions in echo of Stalin  —  Drunk recruits.  Insubordinate soldiers.  Convicts.  —  They're among hundreds of military and civilian offenders who've been pressed into Russian penal units known as “Storm-Z” squads and sent to the frontlines … ",
    "url": "https://www.reuters.com/world/europe/theyre-just-meat-russia-deploys-punishment-battalions-echo-stalin-2023-10-03/"
  }
]