[
  {
    "text": "Trump will stay on ballot in Washington state  —  A judge in Washington rejected an effort to boot former President Trump off the state's primary and general ballots in a ruling Thursday.  —  Thurston County, Wash., Superior Court Judge Mary Sue Wilson's ruling was in response to a challenge … ",
    "url": "https://thehill.com/regulation/court-battles/4416366-trump-washington-state-ballot-challenge/"
  },
  {
    "text": "Is It Over?  —  The opinions expressed by columnists are their own and do not necessarily represent the views of Townhall.com.  —  Top Columns  —  Trending on Townhall Media  —  Call For a Mop - There's Been an Evisceration During Congressional Testimony and the Floor Is Slippery",
    "url": "https://townhall.com/columnists/calthomas/2024/01/18/is-it-over-n2633759"
  },
  {
    "text": "McConnell, Republican lawmakers sign Supreme Court brief on keeping Trump on ballot  —  Nearly 180 congressional Republicans signed on to an amicus brief to the U.S. Supreme Court in support of Donald Trump's legal battle to remain on the primary election ballot in Colorado.",
    "url": "https://www.washingtonpost.com/politics/2024/01/18/mcconnell-trump-supreme-court-colorado-ballot/"
  },
  {
    "text": "Scoop: Mike Pence's former chief of staff endorses Trump  —  Mike Pence's former chief of staff Nick Ayers is endorsing former President Trump, Axios has learned. … - “How long are the candidates going to stay the race and continue to divert money to an intramural squabble?”",
    "url": "https://www.axios.com/2024/01/18/trump-endorsement-pence-nick-ayers"
  },
  {
    "text": "Trump urges Supreme Court to ‘put swift and decisive end’ to 14th Amendment challenges  —  Former President Trump told the Supreme Court on Thursday that the decision kicking him off Colorado's ballot was based on a “dubious interpretation” of the 14th Amendment, urging the justices to reverse … ",
    "url": "https://thehill.com/regulation/court-battles/4416828-trump-urges-supreme-court-to-put-swift-and-decisive-end-to-14th-amendment-challenges/"
  },
  {
    "text": "Judge hints at delay for Trump's March trial date in federal election case  —  Judge Tanya Chutkan suggested that Trump will get additional time to prepare for trial if appellate courts reject his claims of immunity.  —  The judge overseeing the federal criminal case against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/01/18/judge-hints-at-delay-for-trumps-march-trial-date-in-federal-election-case-00136403"
  },
  {
    "text": "Ga. judge in Trump case orders hearing on accusations of Willis misconduct  —  Superior Court Judge Scott McAfee also wrote in his order that Willis must respond to the accusations in writing by Feb. 2.  The accusations first came to light in a filing from one of Trump's co-defendants, former campaign aide Mike Roman.",
    "url": "https://www.washingtonpost.com/national-security/2024/01/18/judge-orders-hearing-fani-willis-misconduct-georgia-case/"
  },
  {
    "text": "Google News Is Boosting Garbage AI-Generated Articles  —  Google News is boosting sites that rip-off other outlets by using AI to rapidly churn out content, 404 Media has found.  Google told 404 Media that although it tries to address spam on Google News, the company ultimately does not focus … ",
    "url": "https://www.404media.co/google-news-is-boosting-garbage-ai-generated-articles/"
  },
  {
    "text": "Judge loses patience with Trump lawyer in E. Jean Carroll sex assault defamation trial  — E. Jean Carroll resumed testifying in her civil defamation trial stemming from sexual assault claims against Donald Trump.  — Trump clashed with Judge Lewis Kaplan and complained about Carroll's testimony during her first day on the stand.",
    "url": "https://www.cnbc.com/2024/01/18/trump-trial-e-jean-carroll-testimony-ex-president-judge-clash.html"
  },
  {
    "text": "California 2024 Poll: Schiff and Garvey Gain Support in Crowded Primary  —  An Emerson College Polling/Inside California Politics survey of the California Senate Election finds a quarter of voters (25%) support Democratic Representative Adam Schiff, while 18% support former Los Angeles Dodger … ",
    "url": "https://emersoncollegepolling.com/california-2024-poll-schiff-and-garvey-gain-support-in-crowded-primary/"
  },
  {
    "text": "House, Senate pass short-term bill averting government shutdown until March  —  Far-right House conservatives were furious over the move, which sends the bill to President Biden to sign into law and keep the government open.  —  Congress on Thursday passed legislation to keep … ",
    "url": "https://www.washingtonpost.com/business/2024/01/18/government-shutdown-bill-senate-house/"
  },
  {
    "text": "Trump leads Biden with independent voters by 11 points: Poll  —  Former President Trump is leading President Biden with independent voters, outpacing the incumbent by 11 points, according to a new poll.  —  In the new Messenger/Harris poll, the former president garnered 46 percent … ",
    "url": "https://thehill.com/homenews/campaign/4416654-trump-leads-biden-with-independent-voters-by-11-points-poll/"
  },
  {
    "text": "DeSantis regrets anti-media strategy: ‘I should have gone on everything’  —  The governor initially appeared only on conservative outlets before changing his strategy.  —  MIAMI — Ron DeSantis wishes he could have a do-over with the media.  —  In an interview Thursday with radio host Hugh Hewitt … ",
    "url": "https://www.politico.com/news/2024/01/18/desantis-regret-anti-media-campaign-strategy-00136330"
  },
  {
    "text": "Salad and spinach kits sold in 7 states recalled over listeria risk  —  BrightFarms spinach and salad kits sold in seven U.S. states are being recalled because they may be contaminated with listeria, according to a notice posted by the U.S. Food and Drug Administration.",
    "url": "https://www.cbsnews.com/news/spinach-salad-kit-recall-listeria-stop-shop-wegmans/"
  },
  {
    "text": "Hunter Biden Friend Tells Congress He Never Sought Favors for Loans to First Son  —  Kevin Morris told investigators he loaned Hunter Biden around $5 million, a source familiar with the interview told The Messenger  —  JWPlayer  —  House Republicans on Thursday argued that Kevin Morris … ",
    "url": "https://themessenger.com/politics/hunter-biden-friend-tells-congress-he-never-sought-favors-for-loans-to-first-son"
  },
  {
    "text": "Netanyahu says he told the US that he opposes a Palestinian state in any postwar scenario  —  Prime Minister Benjamin Netanyahu on Thursday rejected calls from the United States to scale back Israel's military offensive in the Gaza Strip or take steps toward the establishment of a Palestinian state … ",
    "url": "https://apnews.com/article/israel-hamas-war-news-01-18-2024-73d552c6e73e0dc3783a0a11b2b5f67d"
  },
  {
    "text": "State Health Department Issues Unprecedented $300K Penalty to Midwife for Falsifying Vaccine Records  —  Roughly 1,500 School-Aged Children Affected Across New York State  —  Children Are Required to Receive Vaccines Prior to Returning to School  —  The New York State Department of Health … ",
    "url": "https://www.health.ny.gov/press/releases/2024/2024-01-17_baldwin_midwifery.htm"
  },
  {
    "text": "Pakistan Launches Retaliatory Strikes Against ‘Terrorist Hideouts’ in Iran  —  Pakistan said Thursday its military carried out strikes against “terrorist hideouts” in neighboring Iran two days after Tehran bombed what it said were “Iranian terrorists” sheltering on Pakistani soil.",
    "url": "https://www.voanews.com/a/pakistan-launches-retaliatory-strikes-against-terrorist-hideouts-in-iran/7444994.html"
  },
  {
    "text": "USCP Threat Assessment Cases for 2023  —  The number of United States Capitol Police (USCP) threat assessment cases climbed last year, as we head into an election year when threats typically surge.  —  In 2023, the USCP's Threat Assessment Section (TAS) investigated 8,008 cases.",
    "url": "https://www.uscp.gov/media-center/press-releases/uscp-threat-assessment-cases-2023"
  },
  {
    "text": "ROGERS REQUESTS SECRETARY AUSTIN TESTIFY BEFORE HASC ON FAILURE TO DISCLOSE HOSPITALIZATION  —  Washington, D.C. - U.S. Representative Mike Rogers (R-AL), Chairman of the House Armed Services Committee, sent a letter to Secretary of Defense Lloyd J. Austin III, requesting that he testify … ",
    "url": "https://armedservices.house.gov/news/press-releases/rogers-requests-secretary-austin-testify-hasc-failure-disclose-hospitalization"
  },
  {
    "text": "Democratic Lawmakers Plan Push To Get Controversial Biden Adviser Out Of Office  —  House Democrats have drafted a letter seeking the resignation of White House aide Brett McGurk, whose Middle East policies are seen as worsening the Gaza crisis.  —  LOADING",
    "url": "https://www.huffpost.com/entry/congress-brett-mcgurk-biden-middle-east_n_65a98154e4b041f1ce65448b"
  },
  {
    "text": "No Labels alleges criminal conspiracy against 2024 presidential effort  —  No Labels, the nonpartisan group preparing to run a third-party presidential ticket, has asked the Department of Justice to investigate whether Democratic and Republican strategists are engaged in an … ",
    "url": "https://www.axios.com/2024/01/18/no-labels-criminal-conspiracy-2024-president"
  }
]