[
  {
    "text": "The Legal Coup  —  In late 2020, a group of conservative movement attorneys set out to build a legal pathway by which Donald Trump could stay in power, having lost the election.  —  We've known about the outcome of their work for three years now: how it led to the violence of Jan. 6 … ",
    "url": "https://talkingpointsmemo.com/feature/intro-chesebro-docs"
  },
  {
    "text": "Trump seeks Supreme Court intervention in election interference case  —  Former President Donald Trump is turning to the justices in a last-ditch effort to prevent his prosecution in the federal election interference case from moving closer to trial.  —  WASHINGTON — Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/trump-seeks-supreme-court-intervention-election-interference-case-rcna137694"
  },
  {
    "text": "Haley Blasts Trump's Insinuations About Her Husband's Service  —  After months of treading lightly about the former president's legal travails and increasing authoritarian rhetoric, Nikki Haley came out swinging in South Carolina over a personal attack.  —  Nikki Haley, in the final stretch … ",
    "url": "https://www.nytimes.com/2024/02/12/us/politics/trump-haley-husband-troops.html"
  },
  {
    "text": "G.O.P. Officials, Once Critical, Stand by Trump After NATO Comments  —  Defending Donald Trump or deflecting his statements, some top G.O.P. officials reflected the trajectory of a party that the former president has largely bent to his will.  —  After Donald J. Trump suggested he had threatened … ",
    "url": "https://www.nytimes.com/2024/02/12/us/politics/trump-nato-republicans.html"
  },
  {
    "text": "Herbert Hoover stans fight back  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  With help from producer Raymond Rapada.  —  President JOE BIDEN has a rotation of names for former President DONALD TRUMP (not all of which are appropriate in public).",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/02/12/herbert-hoover-stans-fight-back-00141060"
  },
  {
    "text": "Speaker Johnson fires warning shot as Senate prepares to vote on Ukraine aid  —  Speaker Mike Johnson (R-La.) fired a warning shot at the Senate's foreign aid package Monday night, criticizing the $95.3 billion supplemental as the upper chamber inches closer to a final vote on the legislation.",
    "url": "https://thehill.com/homenews/house/4464176-speaker-johnson-ukraine-aid-senate-vote/"
  },
  {
    "text": "Speaker Johnson Rejects Senate Foreign Aid Bill  —  The House continues to take direction from Donald Trump  —  Speaker Mike Johnson has announced that the House of Representatives will not consider the foreign aid bill currently pending in the United States Senate.",
    "url": "https://www.meidastouch.com/news/speaker-johnson-rejects-senate-foreign-aid-bill"
  },
  {
    "text": "Trump endorses new RNC chair and Lara Trump as co-chair  —  The ex-president is backing Michael Whatley, the chair of the North Carolina GOP, to take over for Ronna McDaniel.  —  Former President Donald Trump will support North Carolina GOP Chair Michael Whatley to succeed Ronna McDaniel … ",
    "url": "https://www.politico.com/news/2024/02/12/trump-republican-national-committee-chair-whatley-00141061"
  },
  {
    "text": "Donald J. Trump endorses his daughter-in-law, Lara Trump, for R.N.C. co-chair.  —  Elgin, S.C.  —  Orangeburg, S.C.  —  Conway, S.C.  —  Conway, S.C.  —  Sean Rayford for The New York Times",
    "url": "https://www.nytimes.com/live/2024/02/12/us/trump-biden-election-news"
  },
  {
    "text": "Trump endorses NC's Whatley for RNC chair, Lara Trump for co-chair  —  Former President Trump on Monday backed Michael Whatley, the head of the North Carolina GOP, to serve as the next chair of the Republican National Committee (RNC) and threw his support behind his daughter-in-law, Lara Trump, to serve as co-chair.",
    "url": "https://thehill.com/homenews/campaign/4464175-trump-endorses-ncs-whatley-for-rnc-chair-lara-trump-for-co-chair/"
  },
  {
    "text": "Police have identified the woman who opened fire in a Houston megachurch.  Here's what we know  —  A woman who walked into a popular Texas megachurch Sunday afternoon with a long gun and a young child opened fire before she was killed by law enforcement officers on scene.",
    "url": "https://www.cnn.com/2024/02/12/us/joel-osteen-lakewood-church-shooting-monday/"
  },
  {
    "text": "Call and Response: Putin Demanded Greater Russia and Trump Agreed  —  Over the weekend, Putin and Donald Trump seem to have come to public agreement that, if elected in November, Trump would help Putin pursue Greater Russia.  —  In his session with Tucker Carlson, after all … ",
    "url": "https://www.emptywheel.net/2024/02/12/call-and-response-putin-is-demanding-greater-russia/"
  },
  {
    "text": "Why I Am Now Deeply Worried for America  —  Until a few days ago, I was feeling fairly sanguine about America's prospects.  Economically, we've had a year of strong growth and plunging inflation — and aside from committed Republicans, who see no good, hear no good and speak no good when a Democrat … ",
    "url": "https://www.nytimes.com/2024/02/12/opinion/biden-trump-america.html"
  },
  {
    "text": "Republican Michigan lawmaker loses staff and committee assignment after online racist post  —  A Republican lawmaker in Michigan has lost his committee assignment and staff, days after posting an image of a racist ideology on social media  —  For free real time breaking news alerts sent straight … ",
    "url": "https://www.independent.co.uk/news/ap-republican-michigan-gretchen-whitmer-black-b2494937.html"
  },
  {
    "text": "Statement From Walter Reed Military Medical Center Officials on Secretary of Defense Lloyd J. Austin III's Health Status  —  Dr. John Maddox, Trauma Medical Director, and Dr. Gregory Chesnut, Center for Prostate Disease Research of the Murtha Cancer Center Director, at Walter Reed National … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3673065/statement-from-walter-reed-military-medical-center-officials-on-secretary-of-de/"
  },
  {
    "text": "Joint chiefs head says U.S. ‘credibility is at stake’ following Trump's NATO remarks  —  Former President Donald Trump said on Saturday he would encourage Russia to attack any NATO country that didn't pay enough to the alliance.  —  WASHINGTON — The chairman of the Joint Chiefs of Staff … ",
    "url": "https://www.nbcnews.com/politics/national-security/joint-chiefs-head-says-us-credibility-stake-trumps-nato-remarks-rcna138449"
  },
  {
    "text": "R-E-S-P-E-C-T?  Trump Dominates Biden  —  Among recent presidents and their chief rivals, former President Donald Trump is most respected by voters.  —  The latest Rasmussen Reports national telephone and online survey finds that 42% of Likely U.S. Voters say they respect Trump most as a leader … ",
    "url": "https://www.rasmussenreports.com/public_content/politics/biden_administration/r_e_s_p_e_c_t_trump_dominates_biden"
  },
  {
    "text": "Former Iranian-Owned Boeing Aircraft Successfully Returned to the United States  —  For Immediate Release  —  The Department of Justice today completed enforcement of a final order for forfeiture of a U.S.-manufactured Boeing 747 cargo plane, previously owned by Mahan Air … ",
    "url": "https://www.justice.gov/opa/pr/former-iranian-owned-boeing-aircraft-successfully-returned-united-states"
  }
]