[
  {
    "text": "Aide to Rep. Nadler Is Handcuffed Amid Confrontation With Federal Agents  —  Captured on video, the episode occurred in the congressman's Manhattan office, shortly after the aide observed agents detaining immigrants outside a courtroom.  —  Federal officers entered Representative Jerry Nadler's office … ",
    "url": "https://www.nytimes.com/2025/05/31/nyregion/nadler-aide-handcuffed-federal-agents.html?unlocked_article_code=1.Lk8.t6wu.u_ftg1KWc14K&smid=url-share"
  },
  {
    "text": "‘It can happen to anyone’: Nadler rebukes DHS after staffer detained in Manhattan office  —  The agency said the unidentified staff member was not charged.  —  Officers with the Department of Homeland Security briefly detained a staff member in Rep. Jerry Nadler's (D-N.Y.) … ",
    "url": "https://www.politico.com/news/2025/05/31/jerry-nadler-dhs-detained-00378785"
  },
  {
    "text": "Trump to Withdraw Musk's Ally as Nominee for Top NASA Job  —  Jared Isaacman was a close associate of Elon Musk, whose SpaceX company has multiple contracts with NASA.  —  President Trump plans to withdraw his nomination of Jared Isaacman, a billionaire entrepreneur and close associate of Elon Musk's … ",
    "url": "https://www.nytimes.com/2025/05/31/us/politics/trump-nasa-nominee-musk.html?unlocked_article_code=1.LU8.G-8p.0JCmE02dSBA0&smid=url-share"
  },
  {
    "text": "White House to pull NASA nominee Isaacman  —  The Scoop  —  The White House is pulling the nomination of Jared Isaacman to be the next NASA administrator, just days before he was set to receive a confirmation vote in the Senate, according to three people familiar with the matter and confirmed by the administration.",
    "url": "https://www.semafor.com/article/05/31/2025/white-house-expected-to-pull-nasa-nominee-isaacman"
  },
  {
    "text": "Wes Moore and Tim Walz Go to a Fish Fry and Spatter 2028 Gossip Everywhere  —  As the two governors made buzzy appearances in South Carolina, Democrats in the influential state were already looking to the next election and wondering: Who can win?  —  Gov. Wes Moore of Maryland played … ",
    "url": "https://www.nytimes.com/2025/05/31/us/politics/wes-moore-tim-walz-south-carolina-democrats.html"
  },
  {
    "text": "Tim Walz tells Harris' home-state Dems that 2024 was a ‘primal scream’  —  “Some of it is our own doing,” he said of Republican control of Washington.  —  ANAHEIM, California — Tim Walz on Saturday delivered blunt advice to fellow Democrats in an address to party activists and officials … ",
    "url": "https://www.politico.com/news/2025/05/31/tim-walz-california-dems-2024-primal-scream-00378838"
  },
  {
    "text": "Trump's Hated ‘TACO’ Nickname Is Catching On: CNN Data Guru  —  WHAT'S IN A NAME?  —  The president is not happy with his new Wall Street-inspired moniker.  —  CNN's resident data guru says President Donald Trump's hated “TACO” nickname is gaining popularity.",
    "url": "https://www.thedailybeast.com/trumps-hated-taco-nickname-is-catching-on-cnn-data-guru-harry-enten/"
  },
  {
    "text": "‘TACO’ Is the Secret to Trump's Resilience  —  Judging by his reaction to a reporter's question this week, Donald Trump doesn't like it when you ask him about “TACO” — the reported Wall Street acronym for “Trump Always Chickens Out,” an assumption that makes it safe to be in the market … ",
    "url": "https://www.nytimes.com/2025/05/31/opinion/trump-taco-resilient.html"
  },
  {
    "text": "It's called the Library of Congress.  But Trump claims it's his.  —  The case is the latest example of efforts by the Trump administration to erase the traditional lines that separate the branches of government.  —  The Trump White House has a new target in its campaign to expand executive power: the Library of Congress.",
    "url": "https://www.washingtonpost.com/politics/2025/05/31/library-of-congress-trump-executive-branch/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ4NjY0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwMDQ2Mzk5LCJpYXQiOjE3NDg2NjQwMDAsImp0aSI6IjU1ZTE0ZWRjLWI5NjItNDRiNy04NTY2LWI1NmZjNzc2MjA3OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzMxL2xpYnJhcnktb2YtY29uZ3Jlc3MtdHJ1bXAtZXhlY3V0aXZlLWJyYW5jaC8ifQ.1xxCRzWxK1NXz7G6wc_Lky79PBAew9D39HGzyAPzo58&itid=gfta"
  },
  {
    "text": "Trump's Birthday Military Parade Will Do $16M in Damages to D.C. Streets  —  BIRTHDAY BLOWOUT  —  Armored vehicles rolling down Constitution Avenue are expected to tear millions of dollars' worth of holes in the tarmac.  —  Pothole repair is about to be big business in Washington … ",
    "url": "https://www.thedailybeast.com/donald-trumps-birthday-military-parade-will-do-16-million-in-damages-to-dc-streets/"
  },
  {
    "text": "NYC's Mayoral Race Is Being Overshadowed by Donald Trump  —  The Justice Department has become a major player in the election campaign  —  New York City's mayoral race is operating under the shadow of a politician from Queens: Donald Trump.  —  With less than a month to go until … ",
    "url": "https://www.wsj.com/politics/policy/nycs-mayoral-race-is-being-overshadowed-by-donald-trump-1e85ab42"
  },
  {
    "text": "Biden decline was so bad he got lost in White House closet, whistleblower tells Senator  —  It comes as more reports emerge about the former president's alleged cognitive decline  —  As more reports emerge about former President Biden's alleged cognitive decline during his time in office … ",
    "url": "https://www.foxnews.com/politics/biden-decline-so-bad-he-got-lost-white-house-closet-whistleblower-tells-senator"
  },
  {
    "text": "Impersonator breached Chief of Staff Susie Wiles's phone, Trump says  —  President Donald Trump said someone hacked his chief of staff's phone, just weeks after the FBI warned of “malicious actors” impersonating senior officials.  —  An impersonator breached the phone of White House Chief … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/31/susie-wiles-phone-hacked-trump/"
  },
  {
    "text": "Donald Trump vs. His Own Judges  —  His message to Justices Thomas and Alito: Don't retire.  Your replacement could be a partisan hack.  —  President Trump is expert at downplaying his failures, but attacking his own success is something new.  That's what happened Thursday as he lashed … ",
    "url": "https://www.wsj.com/opinion/donald-trump-vs-his-own-judges-65426dbf"
  },
  {
    "text": "Judge blocks Trump administration from revoking protected status for thousands of Venezuelans  —  The decision comes after the Supreme Court allowed the administration to remove protected status for hundreds of thousands of Venezuelans.  —  A federal judge on Friday blocked the Trump administration … ",
    "url": "https://www.nbcnews.com/politics/immigration/judge-blocks-trump-revoking-protected-status-thousands-venezuelans-rcna210153"
  },
  {
    "text": "Trump Energy Department cancels $3.7B in Biden-era green energy grants  —  The projects failed to advance the energy needs of the American people and were not economically viable, the agency said  —  The Trump administration has canceled $3.7 billion worth of grants for multiple climate … ",
    "url": "https://www.foxbusiness.com/energy/trump-energy-department-cancels-3-7b-in-biden-era-green-energy-grants"
  },
  {
    "text": "Trump Tariffs Face Threat at Supreme Court — Over Rulings That Blocked Biden  —  A legal argument that the US Supreme Court used to foil Joe Biden on climate change and student debt now looms as a threat to President Donald Trump's sweeping tariffs.  —  During Biden's presidency … ",
    "url": "https://www.bloomberg.com/news/articles/2025-05-31/supreme-court-rulings-against-biden-now-threaten-trump-tariffs"
  },
  {
    "text": "Trump Says Steel and Aluminum Tariffs Will Double to 50%  —  The president at a rally says U.S. Steel, which is in a deal with Nippon Steel, will remain U.S.-controlled  —  WEST MIFFLIN, Pa.—President Trump said he would double tariffs on imported steel, a move he said would bolster the domestic industry and protect U.S. jobs.",
    "url": "https://www.wsj.com/economy/trade/trump-is-praising-his-u-s-steel-deal-no-one-is-sure-what-it-means-a6cb15b5?st=B6YvLc"
  },
  {
    "text": "Trump to meet with Germany's Merz in Washington next week  —  President Trump is set to meet with German Chancellor Friedrich Merz next week in Washington, marking the first in-person meeting between the two leaders.  —  Merz, the leader of the center-right Christian Democratic Union (CDU) … ",
    "url": "https://thehill.com/homenews/administration/5327248-donald-trump-friedrich-merz-german-chancellor-washington-meeting/"
  },
  {
    "text": "ICE raids South Park's Buona Forchetta, draws angry crowd outside popular restaurant  — Click to email a link to a friend (Opens in new window) Email  —  Immigration officers swarmed a restaurant late Friday afternoon in South Park, escorting two employees out in a raid that left the staff, the manager said, deeply shaken.",
    "url": "https://timesofsandiego.com/crime/2025/05/30/ice-raids-south-park-buona-forchetta-crowd-restaurant/"
  },
  {
    "text": "FDA approves a next-generation Covid vaccine from Moderna, with restrictions  —  As with Novavax product, use will be limited to certain populations  —  The Food and Drug Administration approved Moderna's new Covid-19 vaccine  —  , though it placed restrictions on its use … ",
    "url": "https://www.statnews.com/2025/05/31/moderna-covid-vaccine-mnexspike-fda-approval/"
  },
  {
    "text": "Trump pardons drive a big, burgeoning business for lobbyists  —  With Trump issuing pardons on a rolling basis, lobbyists say clients are willing to pay significant sums to get their cases in front of the president.  —  Seeking a pardon from President Donald Trump has become big business … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-pardons-drive-big-burgeoning-business-lobbyists-rcna209801"
  }
]