[
  {
    "text": "Biden's Lapses Are Said to Be Increasingly Common and Worrisome  —  People who have spent time with President Biden over the last few months or so said the lapses appear to have grown more frequent, more pronounced and, after Thursday's debate, more worrisome.",
    "url": "https://www.nytimes.com/2024/07/02/us/politics/biden-lapses.html"
  },
  {
    "text": "Donald Trump is going to win the election and democracy will be just fine  —  The BDN Opinion section operates independently and does not set news policies or contribute to reporting or editing articles elsewhere in the newspaper or on bangordailynews.com  —  Jared Golden represents Maine's … ",
    "url": "https://www.bangordailynews.com/2024/07/02/opinion/opinion-contributor/jared-golden-donald-trump-going-to-win-election-democracy-be-just-fine/"
  },
  {
    "text": "“Freaking the f*** out”: Turmoil in the White House over Biden … - “It's the first topic of every conversation,” one White House official said. … - Another official put it more bluntly: “Everyone is freaking the f*** out.”  — “The uncertainty after Thursday is palpable and anxiety … ",
    "url": "https://www.axios.com/2024/07/02/biden-white-house-campaign-staff-freaking-out-debate"
  },
  {
    "text": "Democratic senator criticizes Biden campaign's ‘dismissive attitude’ after debate  —  A Democratic senator chastised President Biden's re-election campaign for their aggressive attempt to quell intensified age concerns in the wake of a disastrous debate performance which sent tremors through the Democratic Party.",
    "url": "https://www.semafor.com/article/07/01/2024/democratic-senator-criticizes-biden-campaigns-dismissive-attitude-after-debate"
  },
  {
    "text": "'We've all enabled the situation': Dems turn on Biden's inner sanctum post debate  —  The senior team's management of Biden has grown more strictly controlled as his term has gone on.  —  Over the course of his presidency, Joe Biden's small clutch of advisers have built … ",
    "url": "https://www.politico.com/news/2024/07/02/biden-campaign-debate-inner-circle-00166160"
  },
  {
    "text": "Manchin threatened to break with Biden before senior Democrats intervened  —  “Nobody wants to be the first one to knife Julius Caesar,” one Democratic Party official said.  —  As panic and confusion over President Biden's faltering debate performance swept the ranks of Democratic lawmakers late last week … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/02/joe-manchin-biden-debate-democrats-drop-out/"
  },
  {
    "text": "The Absurdity of the Dump-Biden Uprising  —  Millions vote for a candidate, propelling him to victory.  Before the voters' decision is formally certified, people who don't like the outcome demand that the election results be thrown out and a different candidate selected in a closed process.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/antidemocratic-uprising-against-joe-biden/678865/"
  },
  {
    "text": "Biden Plunges in Swing States in Leaked Post-Debate Poll  —  The president is losing critical support in key battlegrounds, according to data from a premier Democratic firm, and putting previously noncompetitive states in play.  Also, for the first time, he's polling behind Kamala Harris.",
    "url": "https://puck.news/biden-plunges-in-swing-states-in-leaked-post-debate-poll/"
  },
  {
    "text": "A new national poll turns post-debate conventional wisdom on its head  —  As always, though, we should be cautious about reading too much into one poll.  —  It has been less than a week since President Biden walked out onto the stage of the first presidential debate in Atlanta and upended his political legacy.",
    "url": "https://www.washingtonpost.com/politics/2024/07/02/biden-replacement-debate-harris-cnn-poll/"
  },
  {
    "text": "CNN Poll: Most voters think Democrats have a better chance of keeping White House if Biden isn't the nominee  —  Three-quarters of US voters say the Democratic Party would have a better shot at holding the presidency in 2024 with someone other than President Joe Biden at the top of the ticket … ",
    "url": "https://www.cnn.com/2024/07/02/politics/cnn-poll-post-debate/"
  },
  {
    "text": "Judge Delays Trump's Sentencing Until Sept. 18 After Immunity Claim  —  Donald J. Trump's lawyers want to argue that a Supreme Court decision giving presidents immunity for official acts should void his felony conviction for covering up hush money paid to a porn star.",
    "url": "https://www.nytimes.com/2024/07/02/nyregion/trump-sentencing-hush-money-trial.html"
  },
  {
    "text": "Justice Dept. plans to pursue Trump cases past Election Day, even if he wins  —  If Donald Trump is elected president, the finish line for federal prosecutors is Inauguration Day, not Election Day, people familiar with the discussions said  —  Justice Department officials plan to pursue … ",
    "url": "https://www.washingtonpost.com/national-security/2024/07/02/justice-dept-trump-prosecute-after-election/"
  },
  {
    "text": "We're Releasing Our Full, Unedited Interview With Joe Biden From September  —  Following Biden's poor debate performance against Donald Trump, we're releasing the full and unedited 21-minute interview we conducted with President Joe Biden nine days before his interview with Special Counsel Robert K. Hur.",
    "url": "https://www.propublica.org/article/biden-interview-unedited-september-2023"
  },
  {
    "text": "President Joe Biden to sit down with ABC News on Friday for first TV interview since debate  —  The president has faced calls to drop out of the race following the debate.  —  President Joe Biden delivers remarks during the CNN Presidential Debate, June 27, 2024, in Atlanta.",
    "url": "https://abcnews.go.com/Politics/president-joe-biden-sit-abc-news-friday-interview/story?id=111618360"
  },
  {
    "text": "Trump immunity decision shows that conservative ‘originalism’ is a farce  —  In Trump v. United States, the Supreme Court's far-right majority showed Americans once again that “textualism” and “originalism” are a ruse.  —  Writing for a 6-3 majority, Chief Justice Roberts announced … ",
    "url": "https://thehill.com/opinion/judiciary/4751056-trump-immunity-decision-shows-that-conservative-originalism-is-a-farce/"
  },
  {
    "text": "RFK Jr.'s Family Doesn't Want Him to Run.  Even They May Not Know His Darkest Secrets.  —  A shocking photograph.  Blowback from a Trump meeting.  Alleged sexual assault.  The Kennedys have voiced support for Joe Biden, but certain aspects of Robert F. Kennedy Jr.'s character are only just now coming to light.",
    "url": "https://www.vanityfair.com/news/story/robert-kennedy-jr-shocking-history"
  },
  {
    "text": "Highlighting journalism on Mastodon  —  A new feature for media organizations, journalists and bloggers  —  To reinforce and encourage Mastodon as the go-to place for journalism, we're launching a new feature today.  You will notice that underneath some links shared on Mastodon … ",
    "url": "https://blog.joinmastodon.org/2024/07/highlighting-journalism-on-mastodon/"
  },
  {
    "text": "Giuliani is disbarred in New York as court finds he repeatedly lied about Trump's 2020 election loss  —  Rudy Giuliani was disbarred by a New York court for repeatedly lying about Donald Trump's 2020 election loss and undermining the integrity of the U.S. electoral process.",
    "url": "https://apnews.com/article/giuliani-new-york-disbarred-81b327f9ab1f98548cb888f8e652c9a8"
  },
  {
    "text": "Justice Roberts buried for smug ‘sit down, little ladies’ smear of liberal colleagues  —  Lost in the shuffle of the outrage over the conservative majority Supreme Court's 6-3 decision to hand Donald Trump a get-out-of-jail-free card with their expansive presidential immunity ruling on Monday … ",
    "url": "https://www.alternet.org/news-politics/supreme-court-chief-justice-john-roberts/"
  }
]