[
  {
    "text": "A look at the 28 chaotic days between Biden's disastrous debate and his dropout  —  A complete timeline of events, from President Joe Biden's debate performance to his Oval Office address.  —  When America witnessed a pale, hoarse and feeble Joe Biden take the debate stage on June 27 … ",
    "url": "https://www.politico.com/news/2024/07/26/biden-campaign-dropout-30-days-timeline-00170935"
  },
  {
    "text": "Barack and Michelle Obama endorse Kamala Harris for president  —  The Obamas are the final key leaders in the Democratic Party to unite behind Harris after President Biden ended his bid for a second term.  —  Former president Barack Obama and first lady Michelle Obama endorsed Vice President Harris … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/26/barack-michelle-obama-kamala-harris-endorse/"
  },
  {
    "text": "Trump Invites Reporters to Start Demanding His Medical Records  —  More media outlets are beginning to report on the FBI's uncertainty regarding whether a bullet or shrapnel wounded Donald Trump's ear.  —  NBC quotes the FBI describing that their Shooting Reconstruction Team continues to investigate … ",
    "url": "https://www.emptywheel.net/2024/07/26/trump-invites-reporters-to-start-demanding-his-medical-records/"
  },
  {
    "text": "Speculation Swirls About What Hit Trump.  An Analysis Suggests It was a Bullet  —  An absence of medical records or official accounts has stirred confusion, but a Times video and trajectory analysis indicates a bullet, not debris, wounded the former president.",
    "url": "https://www.nytimes.com/2024/07/26/us/politics/trump-shooter-bullet-trajectory-ear.html"
  },
  {
    "text": "Vance defends ‘sarcastic’ ‘childless cat ladies’ remarks amid blowback  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4794753-vance-childless-cat-ladies-blowback/"
  },
  {
    "text": "Vance argued for higher tax rate on childless Americans in 2021 interview  —  Trump's running mate has faced criticism over other similar previous comments.  —  Republican vice-presidential nominee, Sen. J.D. Vance speaks at a campaign rally at Radford University, July 22, 2024, in Radford, Virginia.",
    "url": "https://abcnews.go.com/US/vance-argued-higher-tax-rate-childless-americans-2021/story?id=112284318"
  },
  {
    "text": "Harris Erases Trump's Lead, WSJ Poll Finds  —  Two candidates are effectively tied after Biden's exit shakes up race  —  The presidential race between Kamala Harris and Donald Trump is essentially tied, according to a new Wall Street Journal poll that shows heightened support … ",
    "url": "https://www.wsj.com/politics/elections/harris-erases-trumps-lead-wsj-poll-finds-e286144d"
  },
  {
    "text": "Donald Trump Gets No Black Votes vs. Kamala Harris in New Michigan Poll  —  received the support of no Black voters in a new Michigan survey.  —  The WDIV/Detroit News poll found that the presidential race is a dead heat between Trump, the  —  nominee, and Vice President  —  , the",
    "url": "https://www.newsweek.com/donald-trump-no-black-voters-michigan-poll-kamala-harris-1930542"
  },
  {
    "text": "The media is already failing in its duty to fairly cover Kamala Harris  —  Sure, Harris deserves scrutiny.  But she doesn't deserve smears and stereotypes amplified by journalists and pundits addicted to clicks  —  It's going to be ugly, that much is already clear.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/26/kamala-harris-media"
  },
  {
    "text": "Spaceman, Senator, V.P. Pick?  Kamala Harris Sizes Up Mark Kelly. … In his short political career, Mark Kelly has won two elections to the Senate in Arizona.  Valerie Plesch for The New York Times  —  The rugged border lands around Douglas, Ariz., dip through precipitous canyons … ",
    "url": "https://www.nytimes.com/2024/07/26/us/politics/mark-kelly-kamala-harris-vp.html"
  },
  {
    "text": "Cindy and Meghan McCain: Mark Kelly Will Deliver Arizona for Kamala  —  COUNTRY FIRST  —  The McCain family is getting behind Sen. Mark Kelly (R-AZ) for vice president under Kamala Harris.  The late Sen. John McCain's widow, Cindy McCain, and daughter, former The View co-host Meghan McCain … ",
    "url": "https://www.thedailybeast.com/cindy-and-meghan-mccain-mark-kelly-will-deliver-arizona-for-kamala-harris"
  },
  {
    "text": "Kevin Roberts, architect of Project 2025, has close ties to radical Catholic group Opus Dei  —  Heritage Foundation leader has long received spiritual guidance from group and his policy goals align with its teachings  —  Kevin Roberts, the Heritage Foundation president and the architect of Project 2025 … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/26/kevin-roberts-project-2025-opus-dei"
  },
  {
    "text": "NY Times Makes Incredible Retraction Involving Kamala Harris Polling — And A Bowl Of Chili With A Severed Finger In It?  —  In a case of incredibly weird odds, The New York Times issued a retraction on Thursday of a quote it used in an article about new polling — because of all the people … ",
    "url": "https://www.mediaite.com/media/new-york-times-retracts-quote-from-woman-who-planted-a-severed-finger-in-her-serving-of-wendys-chili/"
  },
  {
    "text": "Harris calls Sonya Massey's family  —  Massey was a 36-year-old Black woman who was shot by a sheriff's deputy in her Illinois home on July 6.  —  On Friday, Vice President Kamala Harris called the family of Sonya Massey, a 36-year-old Black woman who was fatally shot by a sheriff's deputy … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kamala-harris-calls-sonya-massey-family-rcna163881"
  },
  {
    "text": "Federal courts spike piece of DeSantis ‘Stop Woke’ law  —  A separate challenge surrounding how the anti-woke policies apply to colleges and universities is still under appeal.  —  TALLAHASSEE, Florida — A federal judge permanently shut down a significant piece of Florida's so-called Stop Woke Act … ",
    "url": "https://www.politico.com/news/2024/07/26/federal-courts-florida-stop-woke-law-00171451"
  },
  {
    "text": "How Trump and Vance went from a ‘threat to democracy’ to ‘weird’  —  With Harris at the top of the ticket, Democrats shift to a simpler characterization of Trump.  —  In the days since Vice President Kamala Harris has taken over the campaign against former President Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/26/trump-vance-weird-00171470"
  },
  {
    "text": "Exclusive: CNN survey finds 48 states say Harris can get on ballot instead of Biden, rejecting claim switch breaks state laws  —  The election authorities of at least 48 states, both Republicans and Democrats, say there are no obstacles that would prevent Vice President Kamala Harris from getting … ",
    "url": "https://www.cnn.com/2024/07/26/politics/harris-ballot-legal-obstacles-48-states/"
  }
]