[
  {
    "text": "For Immediate Release  —  For Further Information Contact:  —  Retired Associate Justice of the Supreme Court of the United States, David H. Souter, died peacefully yesterday at home in New Hampshire.  He was 85 years old.  Justice Souter was appointed to the Court by President George H.W. Bush in 1990 … ",
    "url": "https://www.supremecourt.gov/publicinfo/press/pressreleases/pr_05-09-25"
  },
  {
    "text": "David H. Souter, Republican Justice Who Allied With Court's Liberal Wing, Dies at 85  —  He left conservatives bitterly disappointed with his migration from right to left, leading to the cry of “no more Souters.”  —  David H. Souter, a New Hampshire Republican who was named to the Supreme Court … ",
    "url": "https://www.nytimes.com/2025/05/09/us/david-souter-dead.html"
  },
  {
    "text": "By electing Pope Leo XIV, some see Vatican making very American political play  —  (RNS) — As Cardinal Robert Francis Prevost walked out on the central loggia of St. Peter's Basilica on Thursday (May 8) and took the name Pope Leo XIV, Steven P. Millies' initial reaction was a mixture of elation and disbelief.",
    "url": "https://religionnews.com/2025/05/08/by-electing-pope-leo-xiv-some-see-vatican-making-very-american-political-play/"
  },
  {
    "text": "President Trump fires Librarian of Congress Carla Hayden  —  President Donald Trump abruptly fired Librarian of Congress Carla Hayden on Thursday as the White House continues to purge the federal government of those perceived to oppose the president and his agenda.",
    "url": "https://apnews.com/article/donald-trump-library-of-congress-carla-hayden-20a1862ce6d2e0d51a84a37b264ce2ef"
  },
  {
    "text": "The U.S.-U.K. deal shows the trade war is here to stay  —  Markets cheered the new trade pact between the U.S. and U.K. yesterday.  — But the details show that trade war relief will only go so far, even as the de-escalation road map becomes clearer.  —  The big picture … ",
    "url": "https://www.axios.com/2025/05/09/uk-trade-deal-trump-tariffs"
  },
  {
    "text": "Justice Sotomayor Says Lawyers Must ‘Stand Up’ and ‘Fight This Fight’  —  In pointed remarks, the justice told an audience of hundreds of lawyers that she had joined them as “an act of solidarity.”  —  Justice Sonia Sotomayor, speaking to hundreds of lawyers at an American Bar Association event … ",
    "url": "https://www.nytimes.com/2025/05/09/us/justice-sotomayor-talk.html"
  },
  {
    "text": "Venerable New York Firm That Struck a Deal With Trump Is Losing Lawyers  —  Cadwalader avoided a punitive executive order but the accord has left the firm in turmoil  —  Cadwalader, Wickersham & Taft struck a deal with President Trump last month intended to secure the future of New York's oldest law firm.",
    "url": "https://www.wsj.com/us-news/law/venerable-new-york-firm-that-struck-a-deal-with-trump-is-losing-lawyers-10a87928"
  },
  {
    "text": "Trump Officials Seek to Bring First White Afrikaner Refugees to U.S. Next Week  —  The rapid relocation of the Afrikaners, who President Trump says have been racially persecuted in South Africa, stands in stark contrast to the virtual shutdown of all other refugee admissions.",
    "url": "https://www.nytimes.com/2025/05/09/world/africa/trump-afrikaner-refugees.html?unlocked_article_code=1.F08.t-lY.vzWqetLkTWYN&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Here's what we know about Trump's June 14 D.C. military parade  —  With June 14 fast approaching, President Trump's proposed military parade is yet to be finalized, but permit applications give us a glimpse into the spectacle that's expected to cost tens of millions of dollars.",
    "url": "https://www.axios.com/local/washington-dc/2025/05/09/trump-military-parade-route-concert-music"
  },
  {
    "text": "New Pope Has Creole Roots in New Orleans  —  His ancestry, traced to a historic enclave of Afro-Caribbean culture, links Leo XIV to the rich and sometimes overlooked Black Catholic experience in America.  —  Robert Francis Prevost, the Chicago-born cardinal selected on Thursday as the new pope … ",
    "url": "https://www.nytimes.com/2025/05/08/us/pope-leo-creole-new-orleans.html"
  },
  {
    "text": "China's exports surge as shipments to Southeast Asian countries offset plunge in U.S. trade … China's exports surged in April on the back of a jump in shipments to Southeast Asian countries, offsetting a sharp drop in outbound goods to the U.S. as prohibitive tariffs kicked in.",
    "url": "https://www.cnbc.com/2025/05/09/chinas-exports-jump-us-tariffs-imports-tumble.html"
  },
  {
    "text": "Trump eying Fox News host Jeanine Pirro for top prosecutor in DC  —  Pirro, if chosen, would be interim U.S. attorney for the District of Columbia.  —  Judge Jeanine Pirro speaks following an exclusive interview with Daniel Penny for FOX Nation, Dec. 10, 2024, in New York.",
    "url": "https://abcnews.go.com/US/trump-eying-fox-news-host-jeanine-pirro-top/story?id=121604820"
  },
  {
    "text": "Trump Names Jeanine Pirro as Interim U.S. Attorney in Washington  —  The Fox News personality has known the president for decades and would provide him with a reliable line into a crucial prosecutors office in the Justice Department.  —  President Trump said on Thursday that he would name … ",
    "url": "https://www.nytimes.com/2025/05/08/us/politics/jeanine-pirro-us-attorney-trump.html"
  },
  {
    "text": "Barnard suspends WKCR and Spectator reporters who covered Butler Library protest  —  Barnard and Columbia issued interim suspensions Thursday afternoon to four student journalists who covered a Wednesday pro-Palestinian protest in Butler Library, citing “information received” … ",
    "url": "https://www.columbiaspectator.com/news/2025/05/09/barnard-suspends-wkcr-and-spectator-reporters-who-covered-butler-library-protest/"
  },
  {
    "text": "Crypto Is Still for Criming  —  Democrats shouldn't give this scam cover, but probably will  —  Yesterday “the president” announced a trade “deal” with “Britain.”  IN CASE YOU'RE WONDERING, I'M TRYING TO EMULATE TRUMP'S STYLE, WITH RANDOM QUOTATION MARKS AND BLOCK CAPITALS, PLUS EXCLAMATION POINTS AT WEIRD PLACES!",
    "url": "https://paulkrugman.substack.com/p/crypto-is-still-for-criming"
  },
  {
    "text": "‘Harrowing’: Video shows Worcester police hold girl's face on ground during ICE operation  —  Telemundo Nueva Inglaterra captured video of a 16-year-old girl's face being held on the ground by Worcester police officers; she and her mother were detained in an apparent ICE operation",
    "url": "https://www.nbcboston.com/news/local/harrowing-video-shows-worcester-police-hold-girls-face-on-ground-during-ice-operation/3708641/"
  },
  {
    "text": "Here is a specific thing you can do to fight Trump's politicization of public services  —  Trump's maximalist strategy of firing off one executive action after another seeks to overwhelm us.  Finding some tangible way to respond sometimes feels impossible.  So, here is something that you can do:",
    "url": "https://donmoynihan.substack.com/p/here-is-a-specific-thing-you-can"
  },
  {
    "text": "D.C.-area economy starts to show deep impacts of federal spending cuts  —  Unemployment claims are rising and consumers are pulling back on spending, sparking worries of an economic slump in the region on par with the one that occurred during the pandemic.  —  The D.C. region's economy … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/05/09/dc-economy-slump-recession-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2NzYzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4MTQ1NTk5LCJpYXQiOjE3NDY3NjMyMDAsImp0aSI6IjE3MmYxM2NhLWUxNTEtNDI5Yy1hNDFiLTIyMmU5ZTNmZmI1YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzA1LzA5L2RjLWVjb25vbXktc2x1bXAtcmVjZXNzaW9uLXRydW1wLyJ9.EK6gjrDZuUhHl6SvK0J4kK30ebxE-_A8wOEmSPIQ0U4&itid=gfta&fbclid=IwZXh0bgNhZW0BMQABHhieozCzDHkdjTBzHCGTX3qTqqr6Tkczwv4WEVXmZ_4W1QWbsqfpTUV04-2__aem_atbavsjyTrPYLjt9N57tnw"
  },
  {
    "text": "Trump's tax cuts are set to shrink after GOP flinches at deep spending cuts  —  On the chopping block could be a litany of Trump demands, including a permanent extension of the tax cuts passed during his first term.  —  President Donald Trump wanted a “big, beautiful bill.”",
    "url": "https://www.politico.com/news/2025/05/09/trump-tax-cuts-shrink-gop-megabill-00337330"
  },
  {
    "text": "Why Asian and Mexican immigrants, moments away from being deported to Libya, never left the U.S.  —  The immigrants were woken up at 2:30 a.m. and boarded on a bus to wait for hours outside a military plane in Texas.  They were then sent back to solitary confinement.",
    "url": "https://www.nbcnews.com/news/us-news/asian-mexican-migrants-libya-sat-texas-military-plane-rcna205668"
  },
  {
    "text": "Pam Bondi Spilled Epstein Secrets to Bogus ‘Nanny’ at Brunch  —  NANNY CAM  —  The attorney general was reportedly caught on a hidden camera talking to a woman hired by James O'Keefe to pose as a nanny.  —  Days before she announced “thousands of videos” of evidence in the Jeffrey Epstein case … ",
    "url": "https://www.thedailybeast.com/pam-bondi-spilled-jeffrey-epstein-secrets-to-bogus-nanny-at-brunch/"
  },
  {
    "text": "Exclusive: NSF faces radical shake-up as officials abolish its 37 divisions  —  Changes seen as a response to presidential directives on what research to fund  —  The National Science Foundation (NSF), already battered by White House directives and staff reductions, is plunging into deeper turmoil.",
    "url": "https://www.science.org/content/article/exclusive-nsf-faces-radical-shake-officials-abolish-its-37-divisions"
  },
  {
    "text": "Republicans Just Made It Legal to Take Homes from Legal Immigrants in Texas  —  In 2012, a study linked low IQ, racism, and conservatism.  Another study from 2015 l inks cognitive ability with right-wing ideology and prejudice.  A third study, from 2019, found that cognitive inflexibility predicts extremism.",
    "url": "https://www.lonestarleft.com/p/republicans-just-made-it-legal-to"
  },
  {
    "text": "SPJ views proposed VOA/OAN deal as affront to sidelined USAGM journalists  —  CONTACT:  —  Emily Bloch, SPJ National President, [email protected]  —  Dan Kubiske, SPJ International Community Co-Chair, [email protected]  —  Kim Tsuyuki, SPJ Communications Specialist, [email protected]",
    "url": "https://www.spj.org/spj-views-proposed-voa-oan-deal-as-affront-to-sidelined-usagm-journalists/"
  },
  {
    "text": "Jewish feud over Trump escalates with open letter in The New York Times  —  Dozens of former leaders say the organizations they once led are being ‘far too silent’  —  More than three dozen former leaders of major Jewish organizations published an open letter in The New York Times rebuking current leadership … ",
    "url": "https://forward.com/fast-forward/718834/american-jewish-leadership-donald-trump/"
  },
  {
    "text": "David Steiner of FedEx is tapped to be the U.S. Postal Service's new leader  —  David Steiner will lead the U.S. Postal Service as the next postmaster general, as the federal mail agency faces an uncertain future under the Trump administration.  —  Amber McReynolds, chair of the USPS Board of Governors … ",
    "url": "https://www.npr.org/2025/05/09/nx-s1-5384252/usps-david-steiner-who-is-the-postmaster-general"
  }
]