[
  {
    "text": "Pentagon Set Up Briefing for Musk on Potential War With China  —  The access would be a major expansion of Elon Musk's government role and highlight his conflicts of interest.  —  The Pentagon was scheduled on Friday to brief Elon Musk on the U.S. military's plan for any war that might break out with China … ",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/musk-pentagon-briefing-china-war-plan.html?unlocked_article_code=1.5k4.kMNN.sJA8l_XR5dFL&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Elon Musk threatens Pentagon leakers after NYT report on secret China war briefing  —  “They will be found,” warns U.S. President Donald Trump's billionaire adviser as White House lashes out at the media.  —  Donald Trump's top adviser Elon Musk has openly threatened Pentagon employees … ",
    "url": "https://www.politico.eu/article/elon-musk-threatens-pentagon-leakers-new-york-times-briefing-china-war/"
  },
  {
    "text": "We Dug Into the Polls.  Democrats in Congress Should Be Very Afraid.  —  Democratic voters are even angrier than you think.  —  As Senate Minority Leader Chuck Schumer knows better than anyone, the Democratic base is pissed off.  And not just a little.  —  The intensity of the anger roiling … ",
    "url": "https://www.politico.com/news/magazine/2025/03/21/polling-data-democrats-primaries-grassroots-tea-party-00241769"
  },
  {
    "text": "Paul Weiss Chair Says Deal With Trump Adheres to Firm's Principles  —  In an email message on Thursday evening, Paul Weiss Chairman Brad Karp reassured employees that the deal with President Trump was in keeping with the firm's principles.  —  The chairman of Paul Weiss sought to reassure employees … ",
    "url": "https://www.nytimes.com/2025/03/21/business/paul-weiss-memo-trump-deal.html?unlocked_article_code=1.5k4.SQvY.cE0rq7LEJA1E&smid=url-share"
  },
  {
    "text": "Trump And A Powerhouse Law Firm Are Telling Different Stories About Their Shocking Agreement  —  Paul Weiss buckled under Trump's threats — but the firm's chair circulated a different version of the “agreement” Trump published online.  —  The chair of the powerhouse legal firm Paul, Weiss … ",
    "url": "https://www.huffpost.com/entry/paul-weiss-agreement-white-house-differences_n_67dda2cae4b00872325325f5"
  },
  {
    "text": "Improving Education Outcomes by Empowering Parents, States, and Communities  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, and to enable parents, teachers, and communities to best ensure student success, it is hereby ordered:",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/improving-education-outcomes-by-empowering-parents-states-and-communities/"
  },
  {
    "text": "Trump weighs in on report King Charles will offer U.S. membership to British Commonwealth: ‘Sounds good!’  —  Trump indicates willingness to have America become 57th Commonwealth member … Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-commonwealth-offer-us-member-b2719470.html"
  },
  {
    "text": "Trump says he would be happy for US to become ‘associate’ Commonwealth member  —  US president posted Sun news story that referred to a supposed ‘secret offer’ King Charles is due to extend  —  Donald Trump has suggested he would be happy for the US to become an “associate member” … ",
    "url": "https://www.ft.com/content/8b1f96f2-05f5-4c59-af53-d35d058902b4"
  },
  {
    "text": "Trump Admin Threatens to Stop Social Security If DOGE Can't Have Personal Data  —  Trump's interim Social Security chief says he wants to turn off the program if Musk and DOGE can't access Americans' most sensitive data … “My anti-fraud team would be DOGE affiliates.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-musk-stop-social-security-doge-data-1235300785/"
  },
  {
    "text": "Universities are caving to Trump with a stunning speed and scope  —  Some of the nation's oldest and wealthiest institutions are swiftly bending to President Donald Trump, who is acting on longstanding conservative criticisms of universities as elitist and progressive.",
    "url": "https://www.politico.com/news/2025/03/20/universities-cave-conservatives-trump-00241765"
  },
  {
    "text": "‘No Way’ to Please Everyone: Columbia's President Confronts Trump's Ultimatum  —  With Trump intent on making an example of Columbia, Katrina Armstrong is at the center of a fight over the future of higher education  —  Columbia University's interim president, Katrina Armstrong, faces no easy way forward.",
    "url": "https://www.wsj.com/us-news/education/columbia-katrina-armstrong-president-trump-a82eb7d7?st=YH2oHt"
  },
  {
    "text": "Exclusive: Tesla trade-ins on pace for record high amid Musk backlash  —  Motorists have traded in a record number of Tesla (TSLA.O) electric vehicles this month, Edmunds data showed, amid a wave of protests against CEO Elon Musk's work as an adviser to U.S. President Donald Trump.",
    "url": "https://www.reuters.com/business/autos-transportation/tesla-trade-ins-pace-record-high-amid-musk-backlash-2025-03-20/"
  },
  {
    "text": "Anti-Vaxx Mom Whose Daughter Died From Measles Says Disease 'Wasn't That Bad'  —  The child's parents doubled down on their decision not to vaccinate their child even after her death  —  The parents of an unvaccinated Texas child who died from measles appeared in a video formulated … ",
    "url": "https://www.latintimes.com/anti-vaxx-mom-whose-daughter-died-measles-says-disease-wasnt-that-bad-578871"
  },
  {
    "text": "Section 230 May Finally Get Changed as Lawmakers Prep New Bill  —  In June 1995, two young congressmen reached across the aisle to introduce legislation that would become the defining legal protection of the internet era: Section 230 of the Communications Decency Act, which shields internet companies … ",
    "url": "https://www.theinformation.com/articles/exclusive-section-230-may-finally-get-changed-lawmakers-prep-new-bill"
  },
  {
    "text": "“Ludicrous” Situation: Jeffrey Epstein Case Redaction Takes Over FBI's New York Office  —  The bureau's New York field office normally chases drug dealers and spies.  Right now, according to multiple sources, priority one is redacting the sex trafficker's case files.",
    "url": "https://www.vanityfair.com/news/story/epstein-case-review-fbis-new-york"
  },
  {
    "text": "J.D. Vance Is the Most Disliked New Vice President in History  —  Kamala Harris's likability, competence, and political acumen were publicly questioned throughout her vice presidency.  Viewed through the lens of poll numbers, that was understandable.  According to Real Clear Politics … ",
    "url": "https://washingtonmonthly.com/2025/03/21/j-d-vance-is-the-most-disliked-new-vice-president-in-history/"
  },
  {
    "text": "Trump wants adverse rulings overturned ASAP.  Appeals courts are taking their time.  —  The Trump administration is pleading with a federal appeals court to quickly reverse a judge's directive blocking President Donald Trump's ability to deport Venezuelan nationals under rarely used wartime powers.",
    "url": "https://politico.com/news/2025/03/21/trump-administration-court-rulings-appeals-00242764"
  },
  {
    "text": "It's not just impeachments.  Republicans are eyeing other ways to rein in federal judges.  —  GOP leaders are seeking a release valve for the fury building over recent court rulings.  —  House Republicans don't have the votes to impeach any federal judges.",
    "url": "https://www.politico.com/news/2025/03/21/congress-judges-gop-impeachments-injunctions-026855"
  },
  {
    "text": "Canadians to Maine: No, thanks!  —  Canadian tourists make up about 30-40% of the revenue for many businesses in Old Orchard Beach, Maine.  This year, many are choosing to skip their regular getaway, given President Trump's antagonistic rhetoric towards Canada.",
    "url": "https://www.cnn.com/2025/03/20/travel/video/canada-trump-maine-travel-cancellations-digvid"
  },
  {
    "text": "The Democracy Index  —  Are we witnessing the dismantling of America?  Each week, so far, in The Democracy Index, we have cataloged the various degradations our institutions and constitutional order have suffered under Donald Trump.  We view our role as soberly taking stock of the state of affairs … ",
    "url": "https://contrarian.substack.com/p/the-democracy-index-02a"
  },
  {
    "text": "The Bidens want back in  —  With the Democratic Party struggling to find a new direction, former President Joe Biden and former first lady Jill Biden have offered to jump in and help with fundraising and rebuilding.  —  WASHINGTON — Former President Joe Biden has told some Democratic leaders … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/bidens-want-back-in-rcna196956"
  },
  {
    "text": "Trump Attempts to Use 18th Century Law to Allow Feds to Enter Homes Without a Warrant  —  Federal agents will soon be allowed to enter homes without a warrant, the president's lawyers have argued, thanks to an 18th Century law recently used to deport Venezuelan gang members.",
    "url": "https://www.thedailybeast.com/trump-attempts-to-use-18th-century-law-to-allow-feds-to-enter-homes-without-a-warrant/"
  },
  {
    "text": "GOP push to ratify DOGE cuts runs into political reality  —  Despite widespread interest on Capitol Hill, it's not clear the White House is interested in rescissions.  —  Senate Republicans want to put their stamp on President Donald Trump's cost-cutting campaign and are urging … ",
    "url": "https://www.politico.com/news/2025/03/21/doge-cuts-congress-rescissions-elon-musk-00003620"
  },
  {
    "text": "Trump's TikTok-Oracle deal could break the law — but nobody can stop him  —  Congressional hawks are digging in that China can't retain any control of the app.  But for two months, Trump has kept it online anyway.  Now what?  —  President Donald Trump's developing deal to save TikTok … ",
    "url": "https://www.politico.com/news/2025/03/21/trumps-tiktok-oracle-deal-could-break-the-law-but-nobody-can-stop-him-00242107"
  },
  {
    "text": "US government blocks Canadian access to border-straddling library, Canadian town says  —  A Quebec town is calling out what it says is a unilateral decision by U.S. authorities to close Canadian access to a library that straddles the Canada-U.S. border.  —  The Haskell Free Library … ",
    "url": "https://www.reuters.com/world/americas/us-government-blocks-canadian-access-border-straddling-library-canadian-town-2025-03-21/"
  }
]