[
  {
    "text": "Nancy Pelosi Insists the Election Was Not a Rebuke of the Democrats  —  Devin Oktar Yalkin for The New York Times  —  Perhaps no Democratic politician has been a greater antagonist to Donald Trump than Nancy Pelosi.  As the House minority leader and then speaker of the House during Trump's first term … ",
    "url": "https://www.nytimes.com/2024/11/09/magazine/nancy-pelosi-election-interview.html?unlocked_article_code=1.Yk4._9vw.RdeZCVe4PD4f&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "None of the conventional explanations for Trump's victory stand up to scrutiny  —  This election has blown a hole in the worldviews of both leftists and centrists.  The pandemic may be a more important factor  —  Donald Trump has won, and most shockingly, he won the popular vote.",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/09/trump-victory-explanation-scrutiny"
  },
  {
    "text": "All Bets Are Off  —  In Joseph O'Neill's first essay in our pages, he warned readers that “the Republican Party enjoyed a mystifying presumption of legitimacy,” contrasted with “the curious timidity of Democrats.”  In that instance, he was describing the 2000 presidential election fiasco in Florida … ",
    "url": "https://www.nybooks.com/online/2024/11/09/all-bets-are-off-joseph-oneill/"
  },
  {
    "text": "Trump's win was real but not a landslide.  Here's where it ranks  —  A version of this story appeared in CNN's What Matters newsletter.  To get it in your inbox, sign up for free here.  —  ► It's a comeback for the ages for a president to go from a pariah after trying to overturn one election to president-elect after the next.",
    "url": "https://www.cnn.com/2024/11/09/politics/donald-trump-election-what-matters/"
  },
  {
    "text": "The aftermath of Donald Trump's presidential election victory: November 6 - 7, 2024 Economist/YouGov Poll  —  This week's Economist/YouGov poll covers reactions to the election, trust in the results, expectations for the election aftermath, changes in public opinion, and the economy.  —  Election reactions",
    "url": "https://today.yougov.com/politics/articles/50906-aftermath-donald-trump-2024-presidential-election-victory-november-6-7-2024-economist-yougov-poll"
  },
  {
    "text": "I spent hours trying to persuade US voters to choose Harris not Trump.  I know why she lost  —  As a phone bank volunteer, I hoped to counter the Republican attacks and half-truths, but people really believed them  —  It has been an extraordinary week for US politics … ",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/09/us-voters-kamala-harris-donald-trump-republican"
  },
  {
    "text": "Gallego defeats Lake in Arizona Senate race  —  Rep. Ruben Gallego (D-Ariz.) is projected to beat Republican Kari Lake in a consequential race for Arizona Senate, dealing the former local news anchor her second straight electoral loss, according to Decision Desk HQ.",
    "url": "https://thehill.com/homenews/campaign/4969256-ruben-gallego-defeats-kari-lake/"
  },
  {
    "text": "Trump Advisers Ramp Up Work on Mass Deportation Push  —  People close to the president-elect are starting to think of ways to pay for it  —  WASHINGTON—Advisers to President-elect Donald Trump are drawing up plans to carry out his mass deportation pledge, including discussing how to pay … ",
    "url": "https://www.wsj.com/politics/policy/trump-mass-deportation-immigrants-plan-348eaa91?st=56N5g1"
  },
  {
    "text": "Playbook: The ‘deep state’ prepares to get Trumped  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  CALLED OVERNIGHT — DONALD TRUMP wins Nevada.  Sen. JACKY ROSEN (D-Nev.) wins reelection, as do Reps. DON BACON (R-Neb.) and ANDREA SALINAS (D-Ore.).",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/09/the-deep-state-prepares-to-get-trumped-00188605"
  },
  {
    "text": "Conservatives weigh potential show of opposition against Johnson  —  House Republicans are holding their leadership elections next week, where Mike Johnson is largely expected to earn the speakership nomination.  —  Even as Republicans are increasingly optimistic that they'll keep control of the House … ",
    "url": "https://www.politico.com/news/2024/11/09/conservatives-opposition-johnson-00188615"
  },
  {
    "text": "Donald Trump Says He Won't Invite Nikki Haley, Mike Pompeo to Join Administration  — President-elect has warm words for former officials in post  — Haley challenged Trump for nomination; Pompeo is a loyalist  —  President-elect Donald Trump said he won't invite his former ambassador … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-10/donald-trump-won-t-invite-nikki-haley-mike-pompeo-to-join-administration"
  },
  {
    "text": "Authoritarians like Trump love fear, defeatism, surrender.  Do not give them what they want  —  We must lay up our supplies - of love, care, trust, community and resolve - so we may resist the storm  —  Here we are in a crisis in which almost everything we love is going to be under siege … ",
    "url": "https://www.theguardian.com/world/2024/nov/09/authoritarians-like-trump-love-fear-defeatism-surrender-do-not-give-them-what-they-want"
  },
  {
    "text": "Trump has shaped the Supreme Court, but it could still hinder his agenda  —  Although the court has three Trump appointees as part of its 6-3 conservative majority, it has not always ruled for him and could push back on expansive uses of executive power.  —  WASHINGTON — President-elect … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-shaped-supreme-court-still-hinder-agenda-rcna179288"
  },
  {
    "text": "Trump's second presidency sparks fear of ‘scary’ time ahead among some immigrants  —  Lauren Villagran Trevor HughesUSA TODAY  —  Giddel Contreras lives in the Bronx, works as a chef at a hotel-resort in Queens and is as much a New Yorker as the next guy.  —  But the Honduran native's decision … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/11/09/immigrants-fear-donald-trump-presidency/75964709007/"
  },
  {
    "text": "The Elites Had It Coming  —  Everyone has a moment when they first realized that Donald Trump might well return, and here is mine.  It was back in March, during a visit to the Smithsonian's National Portrait Gallery, when I happened to read the explanatory text beside an old painting.",
    "url": "https://www.nytimes.com/2024/11/09/opinion/democrats-trump-elites-centrism.html?unlocked_article_code=1.Yk4.67Ui.gbUiEnXsFGky&smid=url-share"
  },
  {
    "text": "Justice Dept. to focus on ‘most egregious’ Jan. 6 cases until Trump is inaugurated  —  President-elect Donald Trump has said he would “absolutely” consider pardoning every Capitol rioter and has called them political prisoners and “hostages.”  —  WASHINGTON — The Justice Department plans … ",
    "url": "https://www.nbcnews.com/politics/2024-election/jan-6-cases-what-happens-focus-felony-rioters-trump-election-rcna175386"
  },
  {
    "text": "Trump, Who Was Charged with Mishandling Secrets, Will Get Classified Briefings Again  —  Two years ago, the FBI raided Donald Trump's home to retrieve government records he had refused to return, including hundreds containing classified information.  The indictment that followed alleged … ",
    "url": "https://time.com/7174648/donald-trump-classified-documents/"
  },
  {
    "text": "Oakland mayor and progressive DA ousted amid crime complaints  —  The double defeat is the latest signal of voters' swing toward tough-on-crime policies.  —  OAKLAND, California — Oakland Mayor Sheng Thao and Alameda County District Attorney Pamela Price are both leaving office … ",
    "url": "https://www.politico.com/news/2024/11/09/oakland-mayor-progressive-da-ousted-00187549"
  }
]