[
  {
    "text": "Harris Agrees Trump Is a Fascist: 5 Charlamagne Interview Takeaways  —  During a free-flowing interview that was by turns friendly and pointed, the vice president went beyond her previous remarks in casting Donald Trump as an authoritarian.  —  Vice President Kamala Harris agreed on Tuesday … ",
    "url": "https://www.nytimes.com/2024/10/15/us/politics/kamala-harris-charlamagne-interview-trump.html"
  },
  {
    "text": "Trump's campaign is trying to hide his sad state from voters  —  His decline is undeniable.  They're hoping you don't notice in time. … MAGA-friendly CNBC host Joe Kernen dropped an interesting nugget right as Squawk Box went to commercial break on Tuesday.  —  “Well, Trump canceled, and he was going to come on,” Kernen said.",
    "url": "https://www.publicnotice.co/p/trump-cancels-cnbc-cnn-debate"
  },
  {
    "text": "Rachel Maddow calls the bluff of Trump supporters who claim to be making a ‘business decision’  —  Rachel Maddow looks at some of the reasons why a Trump supporter might claim to look past his many shortcomings because they consider their vote a business decision, and why those business … ",
    "url": "https://www.msnbc.com/rachel-maddow/watch/rachel-maddow-calls-the-bluff-of-trump-supporters-who-claim-to-be-making-a-business-decision-221739589885"
  },
  {
    "text": "Kamala Harris Sits Down For Audio Town Hall With Charlamagne Tha God  —  Charlamagne Tha God sat down with Vice President Kamala Harris on Tuesday (October 15) for a live interview, billed as “We The People: An Audio Town Hall with Kamala Harris.”  Charlamagne hosted the Democratic candidate … ",
    "url": "https://www.iheart.com/content/2024-10-15-kamala-harris-sits-down-for-audio-town-hall-with-charlamagne-tha-god/"
  },
  {
    "text": "Trump Crumbles When Pressed on Economic Policy in Tense Interview  —  The former president attempted to “weave” his way through an interview with Bloomberg News, but couldn't escape his own policy black hole  —  Donald Trump continued his pre-election economic event tour on Tuesday … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-crumbles-pressed-economic-policy-bloomberg-interview-1235134459/"
  },
  {
    "text": "Virginia County Officials Declare They Will Refuse to Certify November Election  —  Election officials in Waynesboro County, Virginia filed a lawsuit on Oct. 4 that says they will refuse to certify the upcoming general election unless the state's policy on counting ballots is changed.",
    "url": "https://www.democracydocket.com/news-alerts/virginia-county-officials-declare-they-will-refuse-to-certify-november-election/"
  },
  {
    "text": "Judge Blocks Hand-Counting of Election Ballots in Georgia  —  The ruling was confined to the current election, halting the measure from going into effect for 2024 while the judge further weighs its merits in the future.  —  A county judge in Georgia on Tuesday blocked a new rule mandating … ",
    "url": "https://www.nytimes.com/2024/10/15/us/elections/georgia-ballot-hand-count-ruling.html?unlocked_article_code=1.Sk4.22em.6WVg88W-IdP7&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Record number of early votes cast in Georgia as election gets underway in battleground state  —  A record number of early votes have been cast in Georgia on Tuesday as residents headed to the polls in a critical battleground state that is grappling with the fallout from Hurricane Helene … ",
    "url": "https://www.cnn.com/2024/10/15/politics/early-voting-record-georgia/"
  },
  {
    "text": "Suddenly, the Electoral College Is Posing a Problem for Trump  —  Americans of color are apparently moving to the right.  Donald Trump is poised to make historic gains with nonwhite voters in November, according to recent polling, accelerating the racial depolarization of the electorate.",
    "url": "https://slate.com/news-and-politics/2024/10/trump-electoral-college-edge-shrinks-pennsylvania-wisconsin-polls.html"
  },
  {
    "text": "Crowd Leaves Early as Trump Dances to Music on Stage For 39 Minutes  —  town hall event on Monday reportedly began leaving early after the  —  presidential nominee decided to stop taking questions from the audience and instead played music for 39 minutes.  —  The former president attended … ",
    "url": "https://www.newsweek.com/trump-crowd-leaves-early-audience-made-listen-music-long-time-1969034"
  },
  {
    "text": "Adelson Spends $95 Million to Boost Trump in Michigan, Wisconsin  — Billionaire is one of the top donors to Trump in 2024 race  — Super PAC has just $7.4 million to spend in final weeks  —  Billionaire Miriam Adelson, one of the most prolific donors backing Donald Trump since … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-16/adelson-spends-95-million-to-boost-trump-in-michigan-wisconsin"
  },
  {
    "text": "Ted Cruz Refuses to Say If He Supports Abortion Exceptions: ‘Why Do You Keep Asking?’  —  The Texas senator was given three chances to clarify his views on whether abortion bans should include any exceptions.  He did not answer  —  DURING A DEBATE against Rep. Colin Allred on Tuesday night … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ted-cruz-colin-allred-debate-abortion-exceptions-1235134866/"
  },
  {
    "text": "The Flood-Protection Rule That Trump Rolled Back  —  A Trump-era rollback of flood-protection rules has left critical infrastructure projects at higher risk, experts say.  —  In the summer of 2017, Donald Trump stood in the lobby of Trump Tower and declared he would heal a … ",
    "url": "https://www.nytimes.com/2024/10/15/climate/trump-flood-protection-rules-infrastructure.html"
  },
  {
    "text": "Trump Escalates Threats to Political Opponents He Deems the ‘Enemy’  —  Never before has a presidential nominee openly suggested turning the military on Americans simply because they oppose his candidacy.  With voting underway, Donald Trump has turned to dark vows of retribution.",
    "url": "https://www.nytimes.com/2024/10/15/us/politics/trump-opponents-enemy-within.html"
  },
  {
    "text": "Trump Media shares fall nearly 10% after DJT plunge triggers trading halt … Trump Media shares closed down nearly 10% Tuesday, after a wild trading session that was briefly halted due to volatility when the Truth Social owner's stock suddenly plunged in price.",
    "url": "https://www.cnbc.com/2024/10/15/trump-media-shares-halted-after-sudden-djt-stock-plunge.html"
  },
  {
    "text": "US Business Leaders Want Harris' Stability Not Trump's Chaos  —  Inflation is being tamed and unemployment is low, but the Republican candidate's policies could reverse those achievements. … Former President Donald Trump is the kind of salesman no successful businessperson can stand.",
    "url": "https://www.bloomberg.com/opinion/articles/2024-10-15/linkedin-cofounder-reid-hoffman-business-leaders-want-harris-over-trump"
  },
  {
    "text": "Israeli strike rocks Beirut after US says it opposes scope of air assault  —  At least one Israeli strike hit Beirut's southern suburbs early on Wednesday morning, Reuters witnesses said, hours after the U.S. said it opposed the scope of Israeli attacks in the city amid a rising death toll and fears of wider regional escalation.",
    "url": "https://www.reuters.com/world/middle-east/israeli-strike-rocks-beirut-suburbs-after-us-says-it-opposes-scope-air-assault-2024-10-16/"
  },
  {
    "text": "Of course we can tax billionaires (permalink)  —  Billionaires are pretty confident that they can't be taxed - not just that they shouldn't be taxed, but rather, that it is technically impossible to tax the ultra-rich.  They're not shy about explaining why, either - and neither is their army of lickspittles.",
    "url": "https://pluralistic.net/2024/10/15/piketty-pilled/#tax-justice"
  },
  {
    "text": "Biden Suggests He Wants Trump in Prison — After Kamala Warns Trump Will Prosecute Opponents  —  President Joe Biden suggested Tuesday that he is looking forward to seeing former President Donald Trump imprisoned — right after Vice President Kamala Harris warned that Trump would prosecute his opponents.",
    "url": "https://www.breitbart.com/politics/2024/10/15/biden-suggests-he-wants-trump-in-prison-after-kamala-warns-trump-will-prosecute-opponents/"
  }
]