[
  {
    "text": "Trump urges Christians to vote: 'You won't have to do it' in four years  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4795823-trump-encourages-christians-vote/"
  },
  {
    "text": "Trump Cryptically Declares, 'You Won't Have to Vote Anymore' If He Wins Second Term  —  Former President Donald Trump urged members of a crowd in Florida to vote and said that if he wins, they “won't have to vote anymore.”  —  Speaking at a Turning Point Action event in West Palm Beach on Friday … ",
    "url": "https://www.mediaite.com/trump/trump-cryptically-declares-you-wont-have-to-vote-anymore-if-he-wins-second-term/"
  },
  {
    "text": "How Trump and Vance went from a ‘threat to democracy’ to ‘weird’  —  With Harris at the top of the ticket, Democrats shift to a simpler characterization of Trump.  —  In the days since Vice President Kamala Harris has taken over the campaign against former President Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/26/trump-vance-weird-00171470"
  },
  {
    "text": "Republicans are already souring on JD Vance  —  “I'm a little surprised they didn't vet him as thoroughly as they should have,” said one GOP strategist.  —  JD Vance has had a difficult week, and some Republicans aren't hiding their frustration.  —  Despite momentum after former President … ",
    "url": "https://www.politico.com/news/2024/07/26/republicans-jd-vance-attacks-00171473"
  },
  {
    "text": "Republicans Keep Trying to Copy Trump's Humor — And Voters Keep Cringing  —  Far-right candidates just can't duplicate the flair Trump brings from his TV career.  —  On Monday, in the midst of a speech in his hometown of Middletown, Ohio, one of JD Vance's half-jokes landed with a thud.",
    "url": "https://www.politico.com/news/magazine/2024/07/27/jd-vance-trump-imitation-00171375"
  },
  {
    "text": "Usha Vance told friends Trump appalled her.  Now she's working to elect him.  —  The potential second lady found Trump's actions on Jan. 6 “deeply disturbing,” a friend said.  But ambition and devotion to her husband ultimately drove her to a place in the former president's campaign.",
    "url": "https://www.washingtonpost.com/politics/2024/07/27/usha-vance-trump-jan6/"
  },
  {
    "text": "Biden to announce plans to reform US supreme court - report  —  US president also to seek constitutional amendment to limit immunity for presidents and various officeholders  —  Joe Biden will announce plans to reform the US supreme court on Monday, Politico reported, citing two people familiar … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/26/biden-to-announce-plans-to-reform-us-supreme"
  },
  {
    "text": "Biden will announce Supreme Court reform plans next week  —  Biden is likely to endorse term limits for the justices, an ethics code and a constitutional amendment limiting presidential immunity.  —  President Joe Biden plans to unveil a proposal on Monday for dramatically reforming the Supreme Court … ",
    "url": "https://www.politico.com/news/2024/07/26/biden-supreme-court-reform-plans-00171493"
  },
  {
    "text": "Harris Erases Trump's Lead, WSJ Poll Finds  —  Two candidates are effectively tied after Biden's exit shakes up race  —  The presidential race between Kamala Harris and Donald Trump is essentially tied, according to a new Wall Street Journal poll that shows heightened support … ",
    "url": "https://www.wsj.com/politics/elections/harris-erases-trumps-lead-wsj-poll-finds-e286144d"
  },
  {
    "text": "Panicking Trump Loses It Over FBI Director's Bullet Injury Testimony … Donald Trump is seriously pissed that FBI Director Christopher Wray is asking questions about what really happened during the attempted assassination of the former president.  —  While appearing before the House Judiciary … ",
    "url": "https://newrepublic.com/post/184292/panicking-trump-fbi-director-bullet-injury-testimony"
  },
  {
    "text": "This is a misogyny emergency.  A huge outpouring is coming in the runup to the US election  —  This time Kamala Harris will be the target for the social media platforms that promote prejudice  —  In 2016, a historically unprecedented incident took place.  And yet, barely anyone even noticed.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/27/misogyny-emergency-huge-outpouring-kamala-harris-us-electionction"
  },
  {
    "text": "Justice Department reaches $2M in settlements with FBI officials whose texts infuriated Trump  —  Other portions of Peter Strzok's lawsuit over his firing will continue as former FBI attorney Lisa Page's case is resolved.  —  The Justice Department has agreed to pay a total of $2 million … ",
    "url": "https://www.politico.com/news/2024/07/26/peter-strzok-lawsuit-settlement-00171498"
  },
  {
    "text": "WATCH: Joe Biden's Senior Moment of the Week (Rest in Peace Edition)  —  Weep not for the memories  —  We regret to inform you that Joe Biden is no longer with us.  He was 81 years young.  God rest his soul.  —  OK, sure, he's technically still alive and president of the United States … ",
    "url": "https://freebeacon.com/biden-administration/watch-joe-bidens-senior-moment-of-the-week-rest-in-peace-edition/"
  },
  {
    "text": "Kamala Harris Ignores Hillary Clinton's Playbook  —  could become the U.S.'s first female president, which many had hoped  —  would have been, but Harris hasn't been playing that up.  —  Harris, who is  —  next month, is set to make history if elected in November.",
    "url": "https://www.newsweek.com/kamala-harris-ignores-hillary-clinton-playbook-1930639"
  },
  {
    "text": "Harris calls Sonya Massey's family  —  Massey was a 36-year-old Black woman who was shot by a sheriff's deputy in her Illinois home on July 6.  —  On Friday, Vice President Kamala Harris called the family of Sonya Massey, a 36-year-old Black woman who was fatally shot by a sheriff's deputy … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kamala-harris-calls-sonya-massey-family-rcna163881"
  },
  {
    "text": "Trump ally who denies 2020 election results threatens law enforcement  —  Patrick Byrne, former CEO of Overstock, said officials would face ‘a piano wire and a blowtorch’ if a case against a former Colorado elections official continues.  —  Patrick Byrne, who has funded efforts to undermine … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/26/patrick-byrne-tina-peters-threats/"
  },
  {
    "text": "Trump meets with Netanyahu for first time since departing White House  —  Former President Donald Trump met with Israeli Prime Minister Benjamin Netanyahu on Friday, the first such meeting between the two men since Trump left the White House more than three years ago.",
    "url": "https://www.cnn.com/2024/07/26/politics/trump-netanyahu-meeting-mar-a-lago/"
  },
  {
    "text": "Vance responds to ‘childless cat ladies’ backlash, claims Democrats are ‘anti-family’  —  Vance made the comments in 2021, but they have recently resurfaced.  —  Republican vice presidential candidate Sen. JD Vance speaks during a rally in his home town of Middletown, Ohio, July 22, 2024.",
    "url": "https://abcnews.go.com/Politics/vance-responds-childless-cat-ladies-backlash-claims-democrats/story?id=112310494"
  }
]