[
  {
    "text": "Liz Cheney Nukes the Supreme Court Over Trump Delay—and Hands Dems a Weapon  —  In the wake of the Supreme Court agreeing to hear Donald Trump's demand for absolute immunity from prosecution—potentially delaying his insurrection-related trial until after the election—Democrats … ",
    "url": "https://newrepublic.com/article/179438/liz-cheney-supreme-court-trump-trial-delay-dems-weapon"
  },
  {
    "text": "Donald Trump Says Local Police Will Play Key Role In His Mass Deportation Plan  —  The front-runner in the Republican presidential primary contest said he would give officers immunity to carry out his plan.  —  LOADING  —  Former President Donald Trump on Thursday suggested that local police … ",
    "url": "https://www.huffpost.com/entry/trump-mass-deportation-local-police_n_65e1df88e4b013678e14f39f"
  },
  {
    "text": "Biden tops Trump by 4 points in Virginia poll  —  President Biden leads former President Trump, his likely general election rival, by four points in a Virginia poll that also showcased low favorability ratings for both candidates.  —  The survey conducted by The Institute for Policy and Opinion Research … ",
    "url": "https://thehill.com/homenews/campaign/4501305-biden-tops-trump-by-4-points-in-virginia-poll/"
  },
  {
    "text": "We're Going To Need More Coffee  —  The legal landscape in three of the four criminal cases against Trump continues to shift in his favor this week, following the Supreme Court's decision to hear the presidential immunity appeal in the D.C. election interference case, creating at least a two-month delay for Trump.",
    "url": "https://joycevance.substack.com/p/were-going-to-need-more-coffee"
  },
  {
    "text": "The private chats and chance encounters that shape Joe Biden's thinking  —  After conversations with his grandchildren, fellow churchgoers and Delaware neighbors, the president brings their worries to the Oval Office  —  In the early months of his presidency, as the pandemic dragged … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/01/how-biden-leads-gets-information/"
  },
  {
    "text": "Biden announces U.S. will airdrop food aid into Gaza  —  The president reiterated that the U.S. is trying to push for an immediate cease-fire between Hamas and Israel in order to allow more aid into Gaza.  —  WASHINGTON — President Joe Biden announced Friday that the U.S. will drop food aid … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-announces-us-will-airdrop-food-aid-gaza-rcna141436"
  },
  {
    "text": "CDC officially drops five-day covid isolation guidelines  —  Americans who test positive for the coronavirus no longer need to routinely stay home from work and school for five days under new guidance released Friday by the Centers for Disease Control and Prevention.",
    "url": "https://www.washingtonpost.com/health/2024/03/01/new-cdc-covid-isolation-guidelines/"
  },
  {
    "text": "CVS and Walgreens Will Begin Selling Abortion Pills This Month  —  The pill mifepristone will be available with a prescription at pharmacy counters in a few states to start.  —  The two largest pharmacy chains in the United States will start dispensing the abortion pill mifepristone this month … ",
    "url": "https://www.nytimes.com/2024/03/01/health/abortion-pills-cvs-walgreens.html"
  },
  {
    "text": "New York man who killed a woman after a wrong turn in his driveway gets 25 years to life  —  A man who fatally shot a 20-year-old woman after the SUV she was riding in mistakenly drove into his rural driveway in upstate New York was sentenced Friday to more than 25 years to life in prison.",
    "url": "https://apnews.com/article/wrong-driveway-shooting-new-york-gillis-monahan-cdca1723c6ba7afb89102a1e1aaa3fe0"
  },
  {
    "text": "Appeals court ruling that vacates Capitol rioter's sentence could impact dozens of Jan. 6 cases  —  A federal appeals court in Washington has ordered a new sentence for a retired Air Force officer who stormed the U.S. Capitol dressed in combat gear, in a ruling issued Friday that could impact dozens … ",
    "url": "https://apnews.com/article/jan-6-capitol-riot-appeals-court-sentences-e08abd6d451d954ec3573c9ff515a30e"
  },
  {
    "text": "Menendez co-defendant pleads guilty to 7 counts  —  A New Jersey businessman charged with attempting to bribe Sen. Bob Menendez (D-N.J.) with a Mercedez-Benz for his political sway has pleaded guilty in the far-reaching corruption case.  —  Jose Uribe entered a guilty plea Friday in federal court … ",
    "url": "https://thehill.com/regulation/court-battles/4500928-menendez-co-defendant-pleads-guilty-to-7-counts/"
  },
  {
    "text": "Trump Has One Week To Pay $83.3 Million To E. Jean Carroll—And She's Expressing ‘Very Serious Concerns’  —  Former President Donald Trump's scramble to cover millions in legal fines could start to come to a head next week, as the ex-president has only until next weekend to pay the $83.3 million verdict … ",
    "url": "https://www.forbes.com/sites/alisondurkee/2024/03/01/trump-has-one-week-to-pay-833-million-to-e-jean-carroll-and-shes-expressing-very-strong-concerns/"
  },
  {
    "text": "Supreme Court Picks Up Where the Jan. 6 Mob Left Off  —  Just like the Capitol rioters, SCOTUS' right-wing is actively trying to help Trump illegitimately get back into the White House. … I don't think most Americans realize how close we are to losing everything we most value about our system of government.",
    "url": "https://www.thedailybeast.com/supreme-court-picks-up-where-jan-6-mob-left-off"
  },
  {
    "text": "Thousands of millionaires haven't filed tax returns for years, IRS says  —  About 125,000 notices will be sent to high-income earners, including 25,000 people with income more than $1 million, the tax agency said  —  Thousands of high-income earners have not filed tax returns for several years … ",
    "url": "https://www.washingtonpost.com/business/2024/02/29/tax-returns-irs-millionaires/"
  },
  {
    "text": "GOP's post-Roe peril spreads like wildfire  —  Republicans are trapped in a political minefield over reproductive rights, paralyzed in fear that their vulnerabilities on abortion and in-vitro fertilization (IVF) could hand Democrats the 2024 election.",
    "url": "https://www.axios.com/2024/03/01/republicans-reproductive-rights-2024-election"
  },
  {
    "text": "“I Don't Know If Most People Even Know What Party Is In The Senate Majority”  —  AOC explains the value of accountability, excoriates Senate Democratic leaders for shirking oversight obligations, and lays out a vision for a more fearless, effective party  —  If you've been following the news recently … ",
    "url": "https://www.offmessage.net/p/aoc-oversight-senate-democrats"
  },
  {
    "text": "What “Project 2025” Would Do to America  —  What would a second Trump presidency look like?  What happens if the Reactionary Right returns to power?  —  Over the past few months, different factions on the Right have presented detailed plans for what they want to do the next time they get back to the White House.",
    "url": "https://thomaszimmer.substack.com/p/what-project-2025-would-do-to-america"
  },
  {
    "text": "Haley rules out a No Labels bid for president … - Not so, Haley said Friday at a roundtable with journalists.  — “If I were to do No Labels, that would require a Democrat vice president,” Haley said.  — “I can't do what I want to do as president with a Democrat vice president.”",
    "url": "https://www.axios.com/2024/03/01/haley-rules-out-no-labels-president"
  }
]