[
  {
    "text": "Highways are the next antiabortion target.  One Texas town is resisting.  —  A new ordinance, passed in several jurisdictions and under consideration elsewhere, aims to stop people from using local roads to drive someone out of state for an abortion  —  LLANO, Tex. — No one could remember … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/01/texas-abortion-highways/"
  },
  {
    "text": "Ron DeSantis Is Afraid of Questions From a 15-Year-Old  —  The Florida governor's operation went to extraordinary lengths to intimidate a high school sophomore—all for a question about Donald Trump. … Quinn Mitchell has seen at least 35 presidential candidates in person since 2019 … ",
    "url": "https://www.thedailybeast.com/republican-president-candidate-ron-desantis-is-afraid-of-questions-from-15-year-old-quinn-mitchell"
  },
  {
    "text": "Pennsylvania is key for Biden.  Democrats there say the party is in shambles.  —  It's not just the presidential race at stake.  A major state Supreme Court race is this year.  —  PHILADELPHIA — In anticipation of a major gathering of rural activists a few weeks ago … ",
    "url": "https://www.politico.com/news/2023/09/01/pennsylvania-democratic-party-trouble-00113705"
  },
  {
    "text": "Mitch McConnell May Be Experiencing Small Seizures, Doctors Suggest  —  Two episodes, where the Republican senator froze and did not respond to some questions, may be symptoms of a serious illness, according to neurologists not involved in his medical care.  —  A four-line letter … ",
    "url": "https://www.nytimes.com/2023/09/01/health/mitch-mcconnell-health-seizures.html"
  },
  {
    "text": "Proud Boy who smashed Capitol window on January 6 sentenced to 10 years  —  The Proud Boy who smashed through a window to the US Capitol with a police riot shield on January 6, 2021, allowing the first wave of rioters to storm the building as members of Congress were being evacuated was sentenced Friday to 10 years in prison.",
    "url": "https://www.cnn.com/2023/09/01/politics/dominic-pezzola-proud-boys-sentencing/"
  },
  {
    "text": "'Trump isn't funding any of us': Co-defendants in Georgia case are struggling with mounting legal bills  —  Some of Donald Trump's co-defendants in the sprawling election subversion case in Georgia are trying all sorts of ways to fund their mounting legal bills - yet the costs … ",
    "url": "https://www.cnn.com/2023/09/01/politics/cash-crunch-trump-georgia-co-defendants-legal-bills/"
  },
  {
    "text": "Trump Phone Interview Was So Odd People Wrongly Thought It Was AI  —  But the ex-president is proudly promoting his appearance on Real America's Voice. … Donald Trump sounded so odd during a phone interview that aired on fringe-right channel Real America's Voice on Thursday night … ",
    "url": "https://www.thedailybeast.com/maga-network-shoots-down-chatter-that-trump-call-was-ai"
  },
  {
    "text": "A New Rudy Scandal: FBI Agent Says Giuliani Was Co-opted by Russian Intelligence  —  The whistleblower says his probe of Giuliani's ties to suspected Russian operatives was thwarted.  —  It was big news when Rudy Giuliani, once hailed as America's Mayor, was indicted last month … ",
    "url": "https://www.motherjones.com/politics/2023/09/a-new-rudy-scandal-fbi-agent-says-giuliani-was-co-opted-by-russian-intelligence/"
  },
  {
    "text": "Vivek Ramaswamy's “cold, cultural civil war”  —  His embrace of right-wing extremism is transparently phony.  But it's working. … Events are proceeding according to plan for Vivek Ramaswamy.  He's using a destined-to-fail run for the presidency as a vehicle for becoming … ",
    "url": "https://www.publicnotice.co/p/vivek-ramaswamy-rise-explained"
  },
  {
    "text": "Judge doubles down on Southwest “religious-liberty training” sanctions order  —  Judge Starr refused to put the sanctions on hold while the airline appeals, called questions about requiring the training from a far-right group a “gripe.”  —  U.S. District Judge Brantley Starr stood by his … ",
    "url": "https://www.lawdork.com/p/religious-liberty-training-judge-denies-stay"
  },
  {
    "text": "State election officials prepare for efforts to disqualify Trump under 14th Amendment  —  New Hampshire, Michigan and Arizona are bracing for lawsuits.  —  Efforts to keep former President Donald Trump off the 2024 ballot under the 14th Amendment are gaining momentum as election officials … ",
    "url": "https://abcnews.go.com/Politics/state-election-officials-prepare-efforts-disqualify-trump-14th/story?id=102833123"
  },
  {
    "text": "Clarence Thomas Acknowledges Undisclosed Real Estate Deal With Harlan Crow and Discloses Private Jet Flights  —  The new filing comes after ProPublica's reporting on the Supreme Court justice's beneficial relationship with the billionaire GOP megadonor.  Thomas also reported three private jet trips provided by Crow.",
    "url": "https://www.propublica.org/article/clarence-thomas-disclosure-filing-harlan-crow-real-estate-travel-scotus"
  },
  {
    "text": "White House blasts Marjorie Taylor Greene for threatening government shutdown over Biden impeachment inquiry  —  WASHINGTON − The White House slammed Rep. Marjorie Taylor Greene, R-Ga., for saying she's willing to stop funding the government if Congress doesn't hold a vote to open … ",
    "url": "https://www.usatoday.com/story/news/politics/2023/09/01/white-house-marjorie-taylor-greene-impeachment-shutdown/70737016007/"
  },
  {
    "text": "Finger-pointing and frustration over migrant crisis leads to a total breakdown between White House and NYC mayor  —  The relationship between President Joe Biden's White House and Eric Adams began breaking down in private months earlier than previously known - and long before the New York … ",
    "url": "https://www.cnn.com/2023/09/01/politics/white-house-eric-adams-migrant-crisis/"
  },
  {
    "text": "California's Democratic leaders escalate fights with conservative school boards  —  Top Democratic officials have intervened in school board politics more than in any other blue state.  Conservatives hope it'll drive more support to their side.  —  Democratic state officials in California … ",
    "url": "https://www.nbcnews.com/politics/politics-news/california-democratic-leaders-battle-conservative-school-boards-rcna102602"
  },
  {
    "text": "Election workers have gotten death threats and warnings they will be lynched, the US government says  —  More than a dozen people nationally have been charged with threatening election workers by a Justice Department unit trying to stem the tide of violent and graphic threats against people who count and secure the vote.",
    "url": "https://apnews.com/article/election-workers-threats-justice-department-trump-f17df44d63156a28eaa0862b0aa08f0b"
  }
]