[
  {
    "text": "Hegseth Said to Have Shared Attack Details in Second Signal Chat  —  The defense secretary sent sensitive information about strikes in Yemen to an encrypted group chat that included his wife and brother, people familiar with the matter said.  —  Defense Secretary Pete Hegseth shared detailed information … ",
    "url": "https://www.nytimes.com/2025/04/20/us/politics/hegseth-yemen-attack-second-signal-chat.html?unlocked_article_code=1.BE8.BauJ.3YOHxBJpnIXl&smid=url-share"
  },
  {
    "text": "Former Pentagon official warns department's dysfunction could topple Hegseth  —  “The last month has been a full-blown meltdown at the Pentagon,” John Ullyot, the former top Defense Department spokesperson, wrote in a POLITICO Magazine opinion piece.  —  The Pentagon is in “total chaos” … ",
    "url": "https://www.politico.com/news/2025/04/20/ullyot-pentagon-hegseth-chaos-00300695"
  },
  {
    "text": "Former Top Pentagon Spokesperson Details ‘Month from Hell’ Inside the Agency  —  The total chaos at the Department of Defense is becoming a major distraction for the Trump administration, writes John Ullyot.  —  It's been a month of total chaos at the Pentagon.",
    "url": "https://www.politico.com/news/magazine/2025/04/20/pentagon-chaos-ullyot-hegseth-00205594"
  },
  {
    "text": "Hegseth shared detailed military plans in second Signal chat that included his wife and brother  —  Secretary of Defense Pete Hegseth shared detailed plans about a military operation against the Houthis in Yemen on a second Signal group chat that included his wife, lawyer and brother, three people familiar with the chat told CNN.",
    "url": "https://cnn.com/2025/04/20/politics/hegseth-second-signal-chat-military-plans/"
  },
  {
    "text": "Hegseth posted Yemen strike details in second Signal chat: Report  —  Defense Secretary Pete Hegseth disclosed details on U.S. strikes on the Yemeni Houthis in a second Signal group chat that included members of his family, according to a report.  —  A New York Times report on Sunday revealed that the chat, titled “Defense |",
    "url": "https://www.washingtonexaminer.com/policy/defense/3385688/hegseth-posted-yemen-strike-details-second-signal-chat-report/"
  },
  {
    "text": "Van Hollen: ‘I am not defending the man, I am defending the rights of this man to due process’  —  Senator says the Abrego Garcia case is about upholding the rule of law.  —  Sen. Chris Van Hollen speaks with ABC News while appearing on ‘This Week’ April 20, 2025.",
    "url": "https://abcnews.go.com/Politics/van-hollen-defending-man-defending-rights-man-due/story?id=120978764"
  },
  {
    "text": "Trump Administration Draft Order Calls for Drastic Overhaul of State Department  —  The draft executive order to be signed by President Trump would eliminate Africa operations and shut down bureaus working on democracy, human rights and refugee issues.  —  A draft White House executive order proposes … ",
    "url": "https://www.nytimes.com/2025/04/20/us/politics/trump-state-department-overhaul.html?unlocked_article_code=1.BE8.QhVd.gY0YDBy3y33U"
  },
  {
    "text": "Immigrants forced to sleep on floors at overwhelmed ICE detention centers  —  Conditions are deteriorating as many detention centers approach capacity and the Trump administration closes two agencies overseeing health and safety at the facilities.  —  At a crowded Miami detention center … ",
    "url": "https://www.washingtonpost.com/business/2025/04/18/immigrant-detention-overcrowding-trump-crackdown/"
  },
  {
    "text": "As legal fight raged, ICE buses filled with Venezuelans heading toward airport turned around, video shows  —  At least 28 detainees were placed on buses Friday evening at ICE's Bluebonnet Detention Center in Anson, Texas, and then driven toward an airport about an hour away.",
    "url": "https://www.nbcnews.com/politics/immigration/legal-fight-raged-ice-buses-filled-venezuelans-heading-airport-turned-rcna202007"
  },
  {
    "text": "GOP senator says Trump shouldn't send Americans to foreign prisons: ‘We have our own laws’  —  Sen. John Kennedy (R-La.) said on Sunday he does not think the law would allow President Trump to send United States citizens convicted of violent crimes to Salvadoran prisons … ",
    "url": "https://thehill.com/homenews/senate/5257772-gop-senator-trump-shouldnt-send-americans-to-foreign-prisons/"
  },
  {
    "text": "Zeldin says he can ‘absolutely’ assure public EPA deregulation efforts won't harm environment  —  Environmental Protection Agency (EPA) Administrator Lee Zeldin said he can “absolutely” assure the public that the various deregulation efforts undergone by the agency will not harm the environment.",
    "url": "https://thehill.com/policy/energy-environment/5257850-zeldin-public-epa-deregulations-wont-harm-environment/"
  },
  {
    "text": "Pope Francis meets with US Vice President JD Vance at Santa Marta  —  The brief meeting of Pope Francis with US Vice President JD Vance offered the opportunity to exchange Easter greetings.  Yesterday Cardinal Parolin met with the US leader at the Secretariat of State.",
    "url": "https://www.vaticannews.va/en/pope/news/2025-04/pope-francis-meets-us-vice-president-jd-vance-at-santa-marta.html"
  },
  {
    "text": "‘F-ck You’: Nancy Mace Loses It in Public Argument With Constituent  —  The congresswoman posted a video of herself in a confrontation with a constituent who asked if she planned to hold any more town halls this year  —  Rep. Nancy Mace proudly posted a video of herself yelling, “Fuck you! … ",
    "url": "https://www.rollingstone.com/politics/politics-news/nancy-mace-argument-constituent-fuck-you-1235321568/"
  },
  {
    "text": "U.S. citizen in Arizona detained by immigration officials for 10 days  —  IMMIGRATION OFFICIALS IN TUCSON ARRESTED THE 19-YEAR-OLD MAN FROM ALBUQUERQUE ON APRIL 8, SAYING HE HAD ENTERED THE COUNTRY ILLEGALLY, BEFORE A JUDGE DISMISSED HIS CASE ON APRIL 17.  —  19-year-old Jose Hermosillo … ",
    "url": "https://news.azpm.org/p/news-articles/2025/4/18/224512-us-citizen-in-arizona-detained-by-immigration-officials-for-10-days/"
  },
  {
    "text": "DHL suspends high value US deliveries over tariffs  —  DHL Express is suspending deliveries to the US worth more than $800 (£603) because of a “significant increase” in red tape at customs following the introduction of Donald Trump's new tariff regime.",
    "url": "https://www.bbc.com/news/articles/c1jx9ep5l63o"
  },
  {
    "text": "Boeing begins flying back planes refused by Chinese airlines  —  Beijing orders carriers to stop taking deliveries of US jets as part of its trade war strategy  —  The US plane manufacturer Boeing has begun flying 737 Max jets that were refused by Chinese airline customers back to the United States … ",
    "url": "https://www.bangkokpost.com/business/general/3006447/boeing-begins-flying-back-planes-refused-by-chinese-airlines"
  },
  {
    "text": "Tomatoes Become One of the First Everyday Casualties of Trade War  —  New fees will hit fresh tomato imports from Mexico starting in July unless a new agreement is reached  —  WASHINGTON—President Trump dialed back his trade war—but not on tomatoes.  —  Starting in July … ",
    "url": "https://www.wsj.com/economy/tomato-prices-trump-tariffs-trade-war-5ef5ad47"
  },
  {
    "text": "Kash Patel Embraces the Limelight, Unlike Recent F.B.I. Directors  —  Kash Patel's embrace of the spotlight appears to be a break from the recent past, as his predecessors typically did the job with little fanfare.  —  Kash Patel flew to Miami on Air Force One last weekend to watch … ",
    "url": "https://www.nytimes.com/2025/04/20/us/politics/kash-patel-spotlight-fbi-director.html"
  },
  {
    "text": "The Self-Inflicted Slump: How Tariffs Are Pushing the U.S. Toward a VTRR—A Voluntary Trade Reset Recession  —  A sudden spike in tariffs has small businesses on the ropes, and the broader economy may be next.  Yes, individually big businesses can lobby and bribe Trump and Trumpists for loopholes.",
    "url": "https://braddelong.substack.com/p/the-self-inflicted-slump-how-tariffs"
  }
]