[
  {
    "text": "Playbook: Look who's pushing for a Trump reset  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  QUOTE OF THE DAY — A senior administration official to WSJ's Alex Ward and Nancy Youssef on the possibility of an Iranian attack on Israel … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/15/look-whos-pushing-for-a-trump-reset-00174134"
  },
  {
    "text": "Robert F. Kennedy Jr. tried to meet with Kamala Harris to discuss Cabinet job  —  Harris has rebuffed the offer of an endorsement, while Kennedy has also had conversations with Republican nominee Donald Trump about a role in his administration.  —  Independent presidential candidate Robert … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/14/rfk-jr-kamala-harris-cabinet-trump/"
  },
  {
    "text": "GOP Lawmakers Sound the Alarm That Trump Can't Help but Be Trump  —  “It's like the sixth or seventh season of a show that was once funny but now panders to his base,” one GOP congressman told NOTUS.  — Copy  —  Never one to run the most focused or disciplined campaign … ",
    "url": "https://www.notus.org/trump-2024/trump-focus-messaging-republican-congress"
  },
  {
    "text": "August 2024 National Poll: Harris 50%, Trump 46%  —  Home Polls August 2024 National Poll: Harris 50%, Trump 46%  —  Independents, Younger Voters Swing Toward Harris  —  The first Emerson College Polling national survey following President Biden's decision not to seek re-election finds … ",
    "url": "https://emersoncollegepolling.com/august-2024-national-poll-harris-50-trump-46/"
  },
  {
    "text": "Franklin & Marshall Poll Release: August 2024  —  I'm writing to share our summary report for the August 2024 Franklin & Marshall College Poll.  I've highlighted a few of the key findings below, but I encourage you to read the full report, which is also included.",
    "url": "https://www.fandmpoll.org/franklin-marshall-poll-release-august-2024/"
  },
  {
    "text": "Republicans Worry as Red State Polls Look ‘Worse Than They Should’ for Trump  —  With Harris leading the Democratic ticket, Republicans are increasingly concerned about “softening support” for Trump  —  THIS MONTH, GOP operatives and others close to Donald Trump have grown increasingly nervous … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-republicans-worry-red-state-polls-1235080588/"
  },
  {
    "text": "White House says deals struck to cut prices of popular Medicare drugs that cost $50 billion yearly  —  WASHINGTON (AP) — The Biden administration is taking a victory lap after federal officials inked deals with drug companies to lower the price for 10 of Medicare's most popular and costliest drugs … ",
    "url": "https://apnews.com/article/biden-drug-prices-medicare-prescriptions-34886d6f362c242be268c05d5efd5411"
  },
  {
    "text": "Medicare negotiations with drug companies saved $6 billion, Democrats say  —  Democrats are heralding the initiative as a crowning achievement after years of battling with the pharmaceutical industry.  —  A new initiative to use the power of Medicare to lower prescription drug prices … ",
    "url": "https://www.washingtonpost.com/health/2024/08/15/drug-prices-medicare-negotiations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNjk0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MDc2Nzk5LCJpYXQiOjE3MjM2OTQ0MDAsImp0aSI6ImFkYWEyMTVhLTAzMTgtNGZlMC05ZDNhLTQ4NDU5ZDQzNTNmYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNC8wOC8xNS9kcnVnLXByaWNlcy1tZWRpY2FyZS1uZWdvdGlhdGlvbnMvIn0.Pfi-GjM5liSo5zYIJv3B8yT-5h0r34873BHQm1Ya6-M&itid=gfta"
  },
  {
    "text": "JD Vance in 2020 agreed grandmothers raising children is ‘whole purpose of the postmenopausal female’  —  While appearing on “The Portal” podcast in April 2020, Sen. JD Vance (R-OH) agreed with host Eric Weinstein's claim that “postmenopausal females” exist just to help take care of children.",
    "url": "https://heartlandsignal.com/2024/08/14/jd-vance-in-2020-agreed-grandmothers-raising-children-is-whole-purpose-of-the-postmenopausal-female/"
  },
  {
    "text": "Vance agrees to Oct. 1 debate with Walz  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions  — descriptions off, selected  —  Captions",
    "url": "https://thehill.com/homenews/campaign/4829171-vance-walz-vice-presidential-debate-abc-news-trump-harris/"
  },
  {
    "text": "Why Facebook blocked Popular Information's reporting on Laura Loomer  —  Yesterday, Popular Information published a detailed report on the close relationship between former President Donald Trump and Laura Loomer, a far-right conspiracy theorist who says America should be a “white Judeo-Christian ethnostate.”",
    "url": "https://popular.info/p/update-why-facebook-blocked-popular"
  },
  {
    "text": "Campaign spending booms in race to define Harris … - Harris and Trump are rushing to lock in perceptions about her for a sliver of the electorate in the six or seven swing states likely to decide the winner on Nov. 5.  — Through Thursday, the Harris and Trump campaigns and their supporting groups … ",
    "url": "https://www.axios.com/2024/08/15/trump-harris-ad-spending-2024-august"
  },
  {
    "text": "The case for Harris embracing nationwide free school meals  —  It's good policy and good politics. … Last weekend at a rally in Las Vegas, Kamala Harris announced one of her first explicit new policy positions: a plan to “eliminate taxes on tips for service and hospitality workers.”",
    "url": "https://www.publicnotice.co/p/kamala-harris-walz-free-school-meals-nationwide"
  },
  {
    "text": "When Is “Recyclable” Not Really Recyclable?  When the Plastics Industry Gets to Define What the Word Means.  —  Companies whose futures depend on plastic production are trying to persuade the federal government to allow them to put the label “recyclable” on plastic shopping bags … ",
    "url": "https://www.propublica.org/article/plastics-industry-redefine-recyclable-ftc-grocery-bags"
  },
  {
    "text": "JD Vance: Amazon funded Black Lives Matter so riots would destroy rival retailers  —  Loading...  WASHINGTON  —  In 2021, J.D. Vance gave a speech to a conservative think tank on “woke capital” - and accused Amazon of funding Black Lives Matter in order to burn down the competition.",
    "url": "https://www.csmonitor.com/USA/Politics/2024/0815/jd-vance-speech-bezos-amazon-abortion"
  },
  {
    "text": "Nevada Senate Race Now Favors Democrat, Report Says  —  The nonpartisan Cook Political Report moved the race from “tossup” to “lean Democrat” after polling shows Senator Jacky Rosen with a large edge.  —  Senator Jacky Rosen of Nevada, a Democrat seeking re-election to her seat for the first time … ",
    "url": "https://www.nytimes.com/2024/08/15/us/politics/jacky-rosen-nevada-senate.html"
  },
  {
    "text": "The Saudi Payments to Trump Are More Important than the Suspected Egyptian One  —  As you know, I was calling on the press to focus on the suspected $10 million payment Egypt made to Trump since before it was cool — since even before the WaPo significantly advanced the story over a month later.",
    "url": "https://www.emptywheel.net/2024/08/15/the-saudi-payments-to-trump-are-more-important-than-the-suspected-egyptian-one/"
  },
  {
    "text": "New Jersey Gov. Murphy to appoint former chief of staff, George Helmy, to vacated Menendez Senate seat: report  —  Democrat Sen Bob Menendez to resign following a federal corruption and bribery conviction  —  New Jersey Gov. Phil Murphy is expected to appoint his former chief of staff … ",
    "url": "https://www.foxnews.com/politics/new-jersey-gov-murphy-appoint-former-chief-staff-george-helmy-vacated-menendez-senate-seat-report"
  },
  {
    "text": "Disorganized NY Dem rally to endorse Harris infiltrated by anti-Israel protesters who clashed with cops at afterparty  —  A hastily organized rally supporting Vice President Kamala Harris descended into chaos after anti-Israel protesters infiltrated the Big Apple event … ",
    "url": "https://nypost.com/2024/08/15/us-news/ny-dem-rally-afterparty-for-harris-walz-supporters-mobbed-by-anti-israel-protesters-who-clashed-with-nypd/"
  },
  {
    "text": "Russians fleeing Ukraine's incursion say Putin has abandoned them  —  ‘Lies are causing civilians to die’, says resident of town captured by Kyiv's forces  —  On the day Ukrainian forces started rolling into Russia's Kursk region, a group of about 40 people, mostly women, filmed a video about what was happening in their town.",
    "url": "https://www.ft.com/content/c7c40edb-9eba-41c3-916d-566b6b036c29"
  }
]