[
  {
    "text": "Milwaukee County Circuit Judge Hannah Dugan arrested by federal authorities at Courthouse  —  Milwaukee County Circuit Judge Hannah Dugan was arrested April 25 by federal authorities who are investigating whether she tried to help an undocumented immigrant avoid arrest after he appeared in her courtroom last week, officials confirmed.",
    "url": "https://eu.jsonline.com/story/news/breaking/2025/04/25/milwaukee-county-judge-hannah-dugan-arrested-by-feds-at-courthouse/83270885007/"
  },
  {
    "text": "A Milwaukee judge is accused of helping a man evade ICE.  What do legal experts have to say?  — A Milwaukee County judge is under FBI investigation for allegedly helping an undocumented immigrant evade ICE agents.  — Legal experts are dubious that the judge's actions constitute a crime, with intent being a key factor.",
    "url": "https://eu.jsonline.com/story/news/local/2025/04/25/fbi-investigating-allegations-that-milwaukee-judge-helped-an-immigrant-avoid-ice-arrest-dugan/83250128007/"
  },
  {
    "text": "Congress erupts over FBI arrest of Wisconsin judge  —  Democratic lawmakers reacted with ferocity — and some Republicans with cheers — to the Friday arrest of Wisconsin judge Hannah Dugan for allegedly helping an undocumented defendant avoid arrest by ICE agents.",
    "url": "https://www.axios.com/2025/04/25/fbi-arrest-judge-hannah-dugan-wisconsin-congress"
  },
  {
    "text": "Wisconsin Judge Arrested, Accused of Shielding Immigrant From Federal Agents  —  Judge Hannah Dugan was arrested on suspicion that she “intentionally misdirected federal agents away from” an immigrant being pursued by the authorities, the F.B.I. director said in a social media post that he later deleted.",
    "url": "https://www.nytimes.com/2025/04/25/us/politics/fbi-arrest-judge.html?unlocked_article_code=1.CU8.N092.AkmhFkAFmlNP&smid=url-share"
  },
  {
    "text": "Federal authorities arrest two judges, escalating Trump immigration crackdown … Federal authorities have arrested a former New Mexico judge and a Wisconsin judge in two separate cases, accusing them of interfering with Trump administration immigration enforcement efforts.",
    "url": "https://www.cnbc.com/2025/04/25/fbi-arrest-judge-hannah-dugan-milwaukee.html"
  },
  {
    "text": "Trump Is Suddenly Bleeding Independents.  A Brutal New Poll Shows Why.  —  Donald Trump campaigned for the presidency this time around on the most openly ethno-nationalist platform in memory, one he explicitly promised to implement with undisguised authoritarian measures.",
    "url": "https://newrepublic.com/article/194424/trump-approval-poll-immigration-independents"
  },
  {
    "text": "Trump's immigration ratings turn negative, Post-ABC-Ipsos poll finds  —  President Donald Trump's approval ratings on immigration, relatively strong in the early weeks of his second term, have dipped into negative territory, according to a Washington Post-ABC News-Ipsos poll … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/25/trump-immigration-approval-ratings-drop-poll/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NTUzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2OTM1OTk5LCJpYXQiOjE3NDU1NTM2MDAsImp0aSI6IjYzYjJmODVhLTYwZmMtNDE5MS1hZDEzLTQ0NmNiYzk0NTQzYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA0LzI1L3RydW1wLWltbWlncmF0aW9uLWFwcHJvdmFsLXJhdGluZ3MtZHJvcC1wb2xsLyJ9.tdsaL5mgT4eZqYZuU4KYGeoLTDEen3SxusF3veGKre4"
  },
  {
    "text": "Read the Full Transcript of Donald Trump's ‘100 Days’ Interview With TIME  —  President Donald Trump sat down for an interview with TIME at the White House on April 22.  —  Over the course of the interview, Trump discussed a wide range of issues, including his trade war and the economy … ",
    "url": "https://time.com/7280114/donald-trump-2025-interview-transcript/"
  },
  {
    "text": "Trump administration reverses abrupt terminations of foreign students' US visa registrations  —  DOJ announced the reversal in federal court after weeks of intense scrutiny by courts and dozens of restraining orders issued by judges.  —  The Trump administration has restored … ",
    "url": "https://www.politico.com/news/2025/04/25/trump-admin-reverses-termination-foreign-student-visa-registrations-00309407"
  },
  {
    "text": "George Santos sentenced to over 7 years in prison for fraud  —  Former Rep. George Santos (R-N.Y.) was sentenced Friday to 87 months in prison — more than 7 years — after pleading guilty to charges of wire fraud and aggravated identity theft.  —  Why it matters: It's the climax … ",
    "url": "https://www.axios.com/2025/04/25/george-santos-sentenced-87-months-prison-fraud"
  },
  {
    "text": "The Smithsonian PURGE: Trump Team Removes Artifacts of Black Resistance  —  BLACKPRESSUSA NEWSWIRE - Black Press USA has learned that Trump officials are sending back exhibit items to their rightful owners and dismantling them—starting with the 1960 Woolworth's lunch counter sit-in exhibit.",
    "url": "https://blackpressusa.com/the-smithsonian-purge-trump-team-removes-artifacts-of-black-resistance/"
  },
  {
    "text": "Consumer expectations crater to three-decade low amid Trump tariff chaos  —  The danger for Trump is if consumers' declining faith in the economy causes them to slow their spending in the coming months.  —  Just three months into President Donald Trump's second term, Americans' confidence in the economy's prospects is plunging.",
    "url": "https://www.politico.com/news/2025/04/25/consumers-confidence-tariffs-economy-inflation-00309521"
  },
  {
    "text": "ICE backs down, says it will restore status of thousands of foreign students  —  Hundreds of foreign students in the U.S. on F-1 visas said they were informed their SEVIS records were suddenly terminated by DHS.  —  Local News  —  Sports  —  Unity Reed High School graduate Tyleik Williams drafted by Detroit Lions",
    "url": "https://www.wusa9.com/article/news/politics/federal-fallout/ice-backs-down-says-it-will-restore-status-of-thousands-of-foreign-students-dhs-f-1-visa/65-82a2bd69-3cce-408f-91cd-f80f065b00dd"
  },
  {
    "text": "Elon Musk leaves legacy of self-destruction at DOGE  —  Elon Musk arrived in Washington as the most powerful political outsider ever, brimming with Silicon Valley swagger and bipartisan buy-in for his goal of streamlining the federal government.  — He's leaving with his reputation in tatters … ",
    "url": "https://www.axios.com/2025/04/25/elon-musk-doge-legacy"
  },
  {
    "text": "How the Trump Administration Flipped on Kilmar Abrego Garcia  —  At each stage in the political and legal fight over Kilmar Abrego Garcia's wrongful deportation, the Trump administration has pushed back harder and dug in deeper.  —  The administration first called Abrego Garcia's deportation an … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/kilmar-abrego-garcia-plan-reversal/682594/"
  },
  {
    "text": "Hegseth's Personal Phone Use Created Vulnerabilities  —  The phone number used in the Signal chat could also be found in a variety of places, including on social media and a fantasy sports site.  —  Defense Secretary Pete Hegseth's personal phone number, the one used in a recent Signal chat … ",
    "url": "https://www.nytimes.com/2025/04/25/us/politics/pete-hegseth-phone-signal.html?unlocked_article_code=1.CU8.xhLf.zsSwzSzs8lRj&smid=nytcore-android-share"
  },
  {
    "text": "Russian general killed in Moscow car blast on day of Trump envoy visit  —  Lt Gen Yaroslav Moskalik named as victim of explosion that appears similar to previous attacks claimed by Ukraine  —  A senior Russian military official has been killed in a car explosion near Moscow … ",
    "url": "https://www.theguardian.com/world/2025/apr/25/russian-general-killed-car-blast-hours-before-us-envoy-kremlin-meeting-yaroslav-moskalik"
  },
  {
    "text": "Trump Just Did the Most Corrupt Thing Any President Has Ever Done  —  Imagine that Joe Biden, just as he was assuming office, had started a new company with Hunter Biden and used his main social media account to recruit financial backers, then promised that the most generous among them would earn … ",
    "url": "https://newrepublic.com/post/194420/trump-memecoin-dinner-corrupt-president"
  },
  {
    "text": "Law students organize to give Trump-caving firms a recruitment problem  —  The day after Donald Trump's election last year, three Georgetown Law students started a political movement to brace for impact.  —  The students texted each other, started organizing, and eventually discovered … ",
    "url": "https://www.allrisenews.com/p/skadden-students-georgetown"
  },
  {
    "text": "Chart of the week: Young people are anti-Trump again  —  If it's Friday, it's time for the Chart of the Week!  I was going to write about Trump's sinking approval ratings on economics and immigration, and about the stock market, but I already wrote about that this week so I decided to do something new instead.",
    "url": "https://www.gelliottmorris.com/p/chart-of-the-week-trump-has-lost"
  },
  {
    "text": "Exclusive: DOJ memo offers blueprint to Tren de Aragua deportation plan  —  Trump administration officials directed law enforcement nationwide to pursue suspected gang members into their homes, in some cases without any sort of warrant, according to a copy of the directive exclusively obtained by USA TODAY.",
    "url": "https://www.usatoday.com/story/news/politics/2025/04/25/trump-venezuelan-gang-deportations-alien-enemies-act/83253074007/"
  }
]