[
  {
    "text": "Trump blinked, but the global economy will never be the same  —  There is now sand — a lot of it — in the gears of global commerce, and it won't be going away in the foreseeable future.  —  Why it matters: President Trump may have backed down on some of the most extreme — and hardest to justify … ",
    "url": "https://www.axios.com/2025/04/10/trump-pauses-tariffs-90-days-china"
  },
  {
    "text": "Trump Is Stupid, Erratic and Weak  —  Live shot of Donald Trump setting tariffs:  —  And here's what happened yesterday:  —  Anyone sounding the all-clear on tariffs, or Trump economic policy in general, should be kept away from sharp objects and banned from operating heavy machinery.",
    "url": "https://paulkrugman.substack.com/p/trump-is-stupid-erratic-and-weak"
  },
  {
    "text": "Pressuring Migrants to ‘Self-Deport,’ White House Moves to Cancel Social Security Numbers … Migrants who arrived in New York last year waited for shelter assignments at the Roosevelt Hotel.Todd Heisler/The New York Times  —  Since taking office, the Trump administration has moved aggressively … ",
    "url": "https://www.nytimes.com/2025/04/10/us/politics/migrants-deport-social-security-doge.html?unlocked_article_code=1.-k4.T5Nf.m-Dm8UB0A62d&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Social Security classifies thousands of immigrants as dead, as part of Trump crackdown  —  The tactic is aimed at putting pressure on undocumented immigrants to self-deport from the country.  —  just now  —  The Social Security Administration this week entered the names and Social Security numbers … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/10/self-deportation-immigrants-social-security-dead/"
  },
  {
    "text": "House passes bill that could make it harder for married women to vote  —  Voting rights groups warn that the SAVE Act, which requires documentation proving citizenship, adds a burden to people who have changed their last names.  —  The U.S. House has passed a bill that voting rights groups … ",
    "url": "https://19thnews.org/2025/04/save-act-house-voting/"
  },
  {
    "text": "Pressed for evidence against Mahmoud Khalil, government cites its power to deport people for beliefs  —  Facing a deadline from an immigration judge to turn over evidence for its attempted deportation of Columbia University activist Mahmoud Khalil, the federal government has instead submitted a brief memo … ",
    "url": "https://apnews.com/article/mahmoud-khalil-columbia-university-trump-c60738368171289ae43177660def8d34"
  },
  {
    "text": "Six people have died in a helicopter crash in the Hudson River in New York City, an AP source says  —  A helicopter broke apart in midair and crashed upside-down into the Hudson River between Manhattan and the New Jersey waterfront Thursday, killing all six people aboard in the latest high … ",
    "url": "https://apnews.com/article/new-york-helicopter-crash-e0368ea529659ee1513d92dcbf05a28d"
  },
  {
    "text": "Pilot, family of 5 from Spain killed after helicopter crashes into Hudson River  —  Stream New York's #1 news - Accuweather - original content 24/7  —  JERSEY CITY, New Jersey (WABC) — Six people were killed after a helicopter believed to be carrying a family of tourists from Spain crashed into the Hudson River on Thursday afternoon.",
    "url": "https://abc7ny.com/post/nypd-responding-helicopter-hudson-river/16153664/"
  },
  {
    "text": "Supreme Court says Trump admin must ‘facilitate’ release of man wrongly deported to El Salvador prison  —  The Trump administration conceded that Kilmar Abrego Garcia, who officials allege is a member of the MS-13 gang, was wrongly deported to El Salvador.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-trump-admin-must-facilitate-release-kilmar-abrego-garcia-rcna200284"
  },
  {
    "text": "Supreme Court Sides With Wrongly Deported Migrant  —  A trial judge had ordered the Trump administration to take steps to return the migrant, Kilmar Armando Abrego Garcia, from a notorious prison in El Salvador.  —  The Supreme Court on Thursday instructed the government to take steps … ",
    "url": "https://www.nytimes.com/2025/04/10/us/politics/supreme-court-trump-deported-migrant.html"
  },
  {
    "text": "Trump Administration Wants to Install Federal Oversight of Columbia University  —  Government is aiming to legally bind the school to changes as they negotiate over federal funding  —  The Trump administration is planning to pursue a legal arrangement that would put Columbia University … ",
    "url": "https://www.wsj.com/us-news/education/columbia-consent-decree-trump-federal-funding-2f4c4690?st=8cAJuH&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Democrats, a Cabinet secretary and a DOGE chatbot tee off over another airport close-call  —  A commercial plane carrying several lawmakers bumped wings with another plane at Ronald Reagan Washington National Airport on Thursday, sparking a social media war over funding cuts, runway repairs — and DOGE.",
    "url": "https://www.politico.com/news/2025/04/10/democrats-doge-chatbot-airport-00285391"
  },
  {
    "text": "Judge allows requirement that everyone in the US illegally must register to move forward  —  A federal judge is allowing the Trump administration to move forward with a requirement that everyone in the U.S. illegally must register with the federal government, in a move that could have far … ",
    "url": "https://apnews.com/article/illegal-immigration-immigrant-registry-trump-homeland-security-329d9b1523792aaf5940f72948d8b48b"
  },
  {
    "text": "Trump directs agencies to quietly repeal regulations — without public notice  —  The memo appears to rely on a misinterpretation of a recent Supreme Court ruling.  —  President Donald Trump has instructed federal agencies and their assigned DOGE teams to repeal any existing regulations … ",
    "url": "https://www.politico.com/news/2025/04/10/federal-agencies-public-notice-comment-trump-administration-00284499"
  },
  {
    "text": "Gay Venezuelan stylist sent to Salvadoran prison after a disgraced Milwaukee cop's report  —  A disgraced former Milwaukee cop with credibility issues helped seal the fate of a gay Venezuelan makeup artist sent to El Salvador's notorious prison, according to documents reviewed by USA TODAY.",
    "url": "https://eu.jsonline.com/story/news/investigations/2025/04/10/fired-milwaukee-cops-report-helped-send-gay-stylist-to-el-salvador/83023882007/"
  },
  {
    "text": "White House axes land bureau pick after past Jan. 6 criticism  —  The Trump administration has withdrawn the nomination of Kathleen Sgamma to be director of the Bureau of Land Management, Senate Energy and Natural Resources Chairman Mike Lee said Thursday.  —  Why it matters … ",
    "url": "https://www.axios.com/pro/energy-policy/2025/04/10/white-house-withdraws-blm-nominee-kathleen-sgammas-nomination"
  },
  {
    "text": "Scoop: Top Senate Dems propose emergency Social Security payment boost  —  Top Senate Democrats plan to unveil legislation that would provide an emergency $200 monthly increase in Social Security benefits through the end of the year, Axios has learned.  —  Why it matters: It's … ",
    "url": "https://www.axios.com/2025/04/10/chuck-schumer-elizabeth-warren-senate-democrats-social-security"
  },
  {
    "text": "Trump Close to Winning Concessions From More Law Firms  —  Four or five firms could soon agree to deals that would be unveiled as a package, in an escalation of the president's crackdown on an industry that has drawn his ire.  —  President Trump is planning to announce new deals with several … ",
    "url": "https://www.nytimes.com/2025/04/10/us/politics/trump-law-firms.html"
  },
  {
    "text": "Inside Elon Musk's Gleeful Destruction of the Government  —  The world's richest man has blazed a staggering trail of destruction as Trump's DOGE chief, firing tens of thousands of workers while cashing in  —  B  —  en Vizzachero had his dream job, working as a wildlife biologist with the Los Padres National Forest in California.",
    "url": "https://www.rollingstone.com/politics/politics-features/elon-musk-trump-doge-destruction-1235314218/"
  },
  {
    "text": "Dow falls 1,000 points as tariff sell-off resumes after historic rally: Live updates  —  Stocks fell Thursday, giving back some of the historic rally seen in the previous session after President Donald Trump announced a 90-day reprieve on some of his “reciprocal” tariffs.",
    "url": "https://www.cnbc.com/2025/04/09/stock-market-today-live-updates.html"
  },
  {
    "text": "Exclusive: US NIH scientists barred from attending conferences on their own time and dime  —  Researchers at the U.S. National Institutes of Health have been told they cannot attend scientific conferences and meetings without official permission, even if they pay their own way and go during time off … ",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-nih-scientists-barred-attending-conferences-their-own-time-dime-2025-04-10/"
  },
  {
    "text": "Trump must face Central Park 5 defamation suit, judge rules  —  A federal judge declined to toss a defamation lawsuit against President Trump over his remarks last year about five Black and Hispanic men wrongly convicted of a 1989 rape, dubbed the Central Park Five.",
    "url": "https://thehill.com/regulation/court-battles/5243055-defamation-lawsuit-trump-central-park/"
  },
  {
    "text": "CDC's cruise ship inspectors laid off amid bad year for outbreaks  —  All of the full-time employees in the Centers for Disease Control and Prevention's Vessel Sanitation Program are now off the job, multiple officials tell CBS News, gutting the agency's ability to investigate outbreaks and conduct health inspections on cruise ships.",
    "url": "https://www.cbsnews.com/news/cdc-cruise-ship-inspectors-layoffs-outbreaks-norovirus/"
  },
  {
    "text": "How Trump 2.0 is slashing NIH-backed research — in charts … - Max Kozlov  —  You can also search for this author in  —  PubMed Google Scholar  — Chris Ryan  —  You can also search for this author in  —  PubMed Google Scholar  —  The US National Institutes of Health (NIH) … ",
    "url": "https://www.nature.com/articles/d41586-025-01099-8"
  },
  {
    "text": "The Fiscal and Economic Effects of the Revised April 9 Tariffs  —  The Budget Lab estimated the effects all US tariffs and foreign retaliation implemented in 2025 through April 9, including the revised April 9 tariffs.  —  Current Tariff Rate: Consumers face an overall average effective tariff rate of 27%, the highest since 1903.",
    "url": "https://budgetlab.yale.edu/research/fiscal-and-economic-effects-revised-april-9-tariffs"
  },
  {
    "text": "DOD issues guidance to advance civilian workforce overhaul  —  The Defense Department issued guidance this week aimed at moving forward with its efforts to restructure its civilian workforce, according to a memo from Deputy Secretary of Defense Stephen Feinberg.",
    "url": "https://www.defensenews.com/news/pentagon-congress/2025/04/10/dod-issues-guidance-to-advance-civilian-workforce-overhaul/"
  },
  {
    "text": "Surgery?  Yes.  Chainsaw?  No. How not to reform the U.S. government  —  Ready, fire, aim is never a good approach - most especially with matters of national importance.  Yet that is exactly the method Elon Musk's Department of Government Efficiency has taken to cutting waste, duplication, and inefficiencies in the U.S. Government.",
    "url": "https://eu.lubbockonline.com/story/opinion/columns/2025/04/10/ambassador-tibor-nagy-talks-doge-usaid-takeaways-from-2nd-trump-term/83020864007/"
  },
  {
    "text": "The Free Press' Passage Into the Dark Side  —  When Bari Weiss resigned from The New York Times in 2020, she wrote an open letter to her boss, A.G. Sulzberger, explaining why she felt compelled to quit.  Citing bullying from liberal colleagues for her “wrongthink,” and depicting the culture … ",
    "url": "https://www.theunpopulist.net/p/the-free-press-passage-into-the-dark"
  }
]