[
  {
    "text": "Judge blocks Trump administration's mass firings of federal workers  —  A federal judge ruled that the terminations at several agencies, including the Department of Defense, were likely illegal.  —  SAN FRANCISCO — A federal judge on Thursday ordered the Office of Personnel Management … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/02/27/judge-probationary-federal-employee-firings-lawsuit/"
  },
  {
    "text": "Behind the scenes, GOP senators challenge legality of Trump's aid cuts  —  Sen. Lindsey Graham, a close Trump ally who lauded the USAID cuts, quietly joined Democrats in expressing alarm.  —  Just now  —  A handful of Republican senators have joined their Democratic colleagues in expressing alarm … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/27/usaid-senators-graham-rubio/"
  },
  {
    "text": "Trump's Screaming Call & G.O.P. Moderate Misery  —  The House has cleared a budget hurdle... barely.  But the chamber's Republican lawmakers may yet be thwarted by their own internal dynamics—not to mention the Senate.  —  Representative Victoria Spartz, among the more chaotic … ",
    "url": "https://puck.news/how-trump-strong-armed-the-gop-budget-win/"
  },
  {
    "text": "Oscar-winner Gene Hackman, wife Betsy Arakawa and their dog were dead for some time, warrant shows  —  Oscar-winner Gene Hackman, his wife and their dog were found dead in different rooms of their Santa Fe home, and they had apparently been dead for some time, according to investigators.",
    "url": "https://apnews.com/article/gene-hackman-found-dead-f6c106e92987aeaaab7b35c1b956a5c8"
  },
  {
    "text": "Gene Hackman, Hollywood's Consummate Everyman, Dies at 95  —  The winner of two Oscars, he was hailed for his nuanced performances in films like “The French Connection,” “Unforgiven” and “The Royal Tenenbaums.”  —  Gene Hackman, who never fit the mold of a Hollywood movie star … ",
    "url": "https://www.nytimes.com/2025/02/27/obituaries/gene-hackman-dead.html?unlocked_article_code=1.0E4.VtJz.KGPEUp0JTjKP&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Elon Musk says upgrade of FAA's air traffic control system is failing and SpaceX needs to take over Verizon's contract  —  New York CNN  —  Elon Musk said Thursday that Verizon's efforts to provide a critically needed upgrade to the FAA's air traffic control system is failing.",
    "url": "https://www.cnn.com/2025/02/27/business/elon-musk-faa-air-traffic-control-failing-spacex/"
  },
  {
    "text": "RFK Jr. Takes a Sledgehammer to Two Major Vaccine Developments  —  Multiple vaccine projects have been paused by the Department of Health and Human Services Secretary Robert F. Kennedy Jr.  —  Kennedy paused a multimillion-dollar project to create a new Covid-19 vaccine in pill form on Tuesday … ",
    "url": "https://newrepublic.com/post/192059/rfk-jr-vaccines-flu-covid-hhs"
  },
  {
    "text": "MAGA Loses It as DOGE Staffer Identities Revealed  —  The New York Times identified several dozen employees working for the Department of Government Efficiency, but conservatives were surprisingly unhappy about the transparency.  —  “The so-called New York Times outs 45 people working for DOGE … ",
    "url": "https://newrepublic.com/post/192086/maga-doge-staffers-identities-revealed"
  },
  {
    "text": "Who Is in DOGE?  Tracking Its Staffers and Allies in the Federal Government  —  The New York Times identified 45 people within the so-called Department of Government Efficiency, a group formed by Elon Musk that in a short few weeks has radically upended federal agencies.  Few members have formal Washington experience.",
    "url": "https://www.nytimes.com/interactive/2025/02/27/us/politics/doge-staff-list.html?unlocked_article_code=1.0E4.s0zm.U-5PePaBhK1I&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Here's what on the Jeffrey Epstein list that the Trump DOJ is set to release later today  —  WASHINGTON — The Justice Department is preparing to release notorious sex trafficker Jeffrey Epstein's personal address book Thursday, The Post has learned.  —  A source who has reviewed the files … ",
    "url": "https://nypost.com/2025/02/27/us-news/heres-what-on-the-jeffrey-epstein-list-that-the-trump-doj-is-set-to-release-later-today/"
  },
  {
    "text": "She hoped Trump's victory would change her life, but not like this  —  Ryleigh Cooper is normally more focused on motherhood than politics.  Then came DOGE.  —  BALDWIN, Mich. — Ryleigh Cooper exhaled as she slid onto the couch after nine hours of work for the U.S. Forest Service … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/27/fired-federal-worker-trump-voter/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNjMyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMDExMTk5LCJpYXQiOjE3NDA2MzI0MDAsImp0aSI6ImQ5Njg0YjRjLWY2YjQtNGYyZi1iNTJkLTVmYmIyMjQ1NWQ0YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAyLzI3L2ZpcmVkLWZlZGVyYWwtd29ya2VyLXRydW1wLXZvdGVyLyJ9.GNimSAzg0sKyVizF2U76D8Ltq_VP8FXvxp5YLrMsTq0"
  },
  {
    "text": "BREAKING: SEC halts fraud prosecution of Chinese national who sent Trump millions  —  In December, Popular Information reported that Chinese crypto entrepreneur Justin Sun purchased $30 million in crypto tokens from World Liberty Financial (WLF), a new venture backed by President Donald Trump and his family.",
    "url": "https://popular.info/p/breaking-sec-halts-fraud-prosecution"
  },
  {
    "text": "Iowa Lawmakers Pass Bill to Eliminate Transgender Civil Rights Protections  —  If signed by Gov. Kim Reynolds, the Republican-backed measure would eliminate state civil rights protections for transgender Iowans.  —  Iowa lawmakers overwhelmingly passed a bill on Thursday … ",
    "url": "https://www.nytimes.com/2025/02/27/us/iowa-transgender-civil-rights-bill.html"
  },
  {
    "text": "Judge orders Trump administration officials to give sworn testimony on DOGE  —  The Justice Department fought the effort to put staffers involved in the controversial cost-slashing effort under oath.  —  A federal judge has ordered Trump administration officials involved in Elon Musk's … ",
    "url": "https://www.politico.com/news/2025/02/27/doge-depositions-union-lawsuits-00206542"
  },
  {
    "text": "Inside Kash Patel's Whirlwind Start at the FBI  —  The new FBI director ordered officials to undertake a $100 million restructuring with no clear way to fund it—and took on a second job  —  WASHINGTON—FBI officials from regional field offices gathered on a video call this week to hear … ",
    "url": "https://www.wsj.com/politics/policy/kash-patel-fbi-director-start-actions-c3d5d57f?st=MURWfs&reflink=desktopwebshare_permalink"
  },
  {
    "text": "23 Dem AGs think they've cracked the code to fighting Trump  —  Democratic state attorneys general have been planning their lawsuits for a year.  —  The resistance meets daily on Microsoft Teams.  —  The country's 23 Democratic state attorneys general log on at 4pm ET … ",
    "url": "https://www.politico.com/news/2025/02/27/democrats-taking-trump-musk-winning-00206310"
  },
  {
    "text": "Andrew Tate and brother Tristan, who face human trafficking charges in Romania, arrive in the U.S.  —  London — Self-proclaimed misogynist social media influencer Andrew Tate and his brother Tristan arrived in the U.S. Thursday despite facing rape and human trafficking charges that are still pending in Romania.",
    "url": "https://www.cbsnews.com/news/andrew-tate-tristan-trump-us-romania-rape-human-trafficking-charges/"
  },
  {
    "text": "Trump Education Department Opens Snitch Line Against Diversity  —  The snitch portal was launched in association with the extremist group Moms for Liberty … Tiffany Justice, of Moms for Liberty, touted the launch of the portal, highlighting it as an opportunity for parents to push back against … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-education-department-snitch-portal-against-diversity-1235282457/"
  },
  {
    "text": "Former defense chiefs denounce Trump's ‘reckless’ Pentagon firings  —  The five former leaders urged Congress to hold the president accountable for what they called his unjustified removal of the Joint Chiefs chairman and other top military officers.  —  Five former defense secretaries … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/27/mattis-defense-secretaries-trump-pentagon-firings/"
  },
  {
    "text": "How the Bezos-Trump alliance began … - It wasn't until late October — three months later — that Bezos spiked the Post editorial page's planned endorsement of Kamala Harris for president, and his outreach to Trump came into focus. … - The move was praised by Trump allies such as Elon Musk … ",
    "url": "https://www.axios.com/2025/02/27/jeff-bezos-trump-tech-alliance"
  },
  {
    "text": "Elon Musk's Attacks On Judges Are Getting More Racist and More Dangerous  —  In recent weeks, federal judges across the country have blocked several of President Donald Trump's more ambitious attempts to treat following the law as optional.  Elon Musk, who is leading the administration's efforts … ",
    "url": "https://ballsandstrikes.org/law-politics/musk-judges-attacks-racist-dangerous/"
  },
  {
    "text": "CNN Fact-Checker Floored By Trump Cabinet Meeting: ‘There Was Just So Much’  —  Daniel Dale picked apart the president's statements during the first meeting of his new administration's department heads.  —  President Donald Trump's first Cabinet meeting Wednesday of his new administration … ",
    "url": "https://www.huffpost.com/entry/daniel-dale-donald-trump-cabinet-meeting-2025_n_67c04533e4b0c1f0afe3bc57"
  },
  {
    "text": "Trump administration struggles to rehire fired bird flu employees  —  USDA supervisors are being asked to justify rehires and some employees still haven't gotten their laptops back.  —  The Trump administration touted a nearly $1 billion plan Wednesday to combat the spread of avian flu … ",
    "url": "https://www.politico.com/news/2025/02/27/trump-fired-bird-flu-hires-00206334"
  },
  {
    "text": "Trump's biggest power grab just reached the Supreme Court  —  On Wednesday night, Chief Justice John Roberts temporarily halted a lower court order, which would have required the Trump administration to make approximately $2 billion in foreign aid payments that it had stopped as part … ",
    "url": "https://www.vox.com/scotus/401838/supreme-court-usaid-impoundment-trump-aids-vaccine"
  },
  {
    "text": "Inside the Collapse at the NIH  —  Administration officials pressured the NIH to avoid clear advice from the agency's own lawyers to restart grant funding now.  —  For decades, the National Institutes of Health has had one core function: support health research in the United States.",
    "url": "https://www.theatlantic.com/health/archive/2025/02/nih-grant-freeze-biomedical-research/681853/?gift=4OW_ksNtOXRAREHU203IjoAlHi07ZXTNu8mcd9VAsTg&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Pentagon directs removal of trans service members from military  —  The Pentagon has directed that service members and recruits with gender dysphoria be separated from the U.S. military in accordance with an executive order issued a month ago by President Trump.",
    "url": "https://www.npr.org/2025/02/27/g-s1-51057/transgender-soldiers-military-ban-trump"
  },
  {
    "text": "White House official threatens to redraw Canadian border  —  Peter Navarro is pushing negotiators to discuss reworking country's boundaries, The Telegraph can reveal  —  A top White House official has threatened to redraw the Canadian border amid Donald Trump's ambition to turn the country in America's “51st state”.",
    "url": "https://www.telegraph.co.uk/us/politics/2025/02/27/white-house-canadian-border-trump-trudeau/"
  }
]