[
  {
    "text": "‘Dangerous and un-American’: new recording of JD Vance's dark vision of women and immigration  —  Trump's running mate rants against feminism, immigrants and Ilhan Omar in a newly unearthed podcast from 2021  —  Donald Trump's running mate, JD Vance, said that professional women … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/31/jd-vance-podcast-feminism-immigration"
  },
  {
    "text": "‘Disrespected sacred ground’: Harris slams Trump over Arlington National Cemetery incident  —  Vice President Kamala Harris weighed in Saturday on the altercation between GOP rival Donald Trump's staff and an official at Arlington National Cemetery, saying Trump “disrespected sacred ground, all for the sake of a political stunt.”",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/31/kamala-harris-trump-arlington/75031802007/"
  },
  {
    "text": "Harris Says Trump ‘Disrespected Sacred Ground’ In Arlington Altercation  —  Trump campaign staffers reportedly took photos and recorded at Arlington National Cemetery, despite officials warning them not to.  —  LOADING  —  Vice President Kamala Harris on Saturday condemned the altercation … ",
    "url": "https://www.huffpost.com/entry/harris-condemns-arlington-altercation_n_66d34ea2e4b0139571620a46"
  },
  {
    "text": "Top Oversight Committee Dem seeks ‘full account’ from Army secretary on Arlington incident  —  Rep. Jamie Raskin, the top Democrat on the House Oversight and Accountability Committee, demanded Friday a “full account” of a reported incident between Donald Trump and his campaign … ",
    "url": "https://www.rawstory.com/trump-arlington/"
  },
  {
    "text": "Cleanup on Aisle MAGA: Trump Bends to Conservative Abortion Critics  —  IN THE END, DONALD TRUMP, a master of evasion, could only obfuscate for so long.  —  After hemming, hawing, avoiding, and rambling, the ex-president finally admitted Friday night that he opposes his home state's abortion-rights ballot initiative.",
    "url": "https://www.thebulwark.com/p/cleanup-on-aisle-maga-trump-bends"
  },
  {
    "text": "Trump Contorts Himself on Abortion in Search of Political Gain  —  The former president is willing to make as many rhetorical and policy shifts as he deems necessary to win in November, vexing some social conservatives.  —  At the age of 53, in a 1999 interview on NBC's “Meet the Press,” … ",
    "url": "https://www.nytimes.com/2024/08/31/us/politics/trump-abortion-stance.html?unlocked_article_code=1.HE4._71c.UFdaxYljXLYl&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Donald Trump at Moms for Liberty says Ivanka ‘hired millions of people’  —  Republican candidate tells conservative group his daughter should have been UN ambassador and the ‘most brilliant leaders’ come from Scotland like his mother  —  Donald Trump has claimed that when he was president … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/31/donald-trump-at-moms-for-liberty-says-ivanka-hired-millions-of-people"
  },
  {
    "text": "JD Vance's Combative Style Confounds Democrats but Pleases Trump  —  Over dozens of events and more than 70 interviews, Mr. Vance's performances as Donald Trump's attack dog have endeared him to his boss, even if America broadly is less enthusiastic.  —  Donald J. Trump knew that JD Vance could take a punch.",
    "url": "https://www.nytimes.com/2024/08/31/us/politics/jd-vance-trump-vp.html?unlocked_article_code=1.HE4.xaj5.nNP2Nj3rStrh&smid=url-share"
  },
  {
    "text": "Trump Wants to Hide His Attempt to Assassinate Mike Pence from Voters  —  In 2016, Donald Trump bragged, “I could stand in the middle of Fifth Avenue and shoot somebody, and I wouldn't lose any voters, OK?”  —  This election, Trump wants to hide from voters details of how he almost killed … ",
    "url": "https://www.emptywheel.net/2024/08/31/trump-wants-to-hide-his-attempt-to-assassinate-mike-pence-from-voters/"
  },
  {
    "text": "California's governor has the chance to make AI history  —  Gavin Newsom could decide the future of AI safety.  But will he cave to billionaire pressure? … Advocates say it is a modest law setting “clear, predictable, common-sense safety standards” for artificial intelligence.",
    "url": "https://www.vox.com/future-perfect/369628/ai-safety-bill-sb-1047-gavin-newsom-california"
  },
  {
    "text": "Musk's X banned in Brazil after disinformation row  —  X, formerly Twitter, has been banned in Brazil after failing to meet a deadline set by a Supreme Court judge to name a new legal representative in the country.  —  Alexandre de Moraes ordered the “immediate and complete suspension” … ",
    "url": "https://www.bbc.com/news/articles/c5y3rnl5qv3o"
  },
  {
    "text": "Why Pennsylvania and Georgia Are Must-Win States in November  —  Kamala Harris and Donald Trump are pouring time and money into a pair of battlegrounds that are crucial to their paths to victory.",
    "url": "https://www.wsj.com/politics/elections/harris-trump-georgia-pennsylvania-election-2024-1240cf72"
  },
  {
    "text": "Trump speaks at Heritage-sponsored event after disavowing Project 2025  —  Trump spoke at the Moms for Liberty summit, an event hosted by the parental rights group that counts the Heritage Foundation among its key sponsors.  —  Former president Donald Trump headlined an event sponsored … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/30/trump-moms-for-liberty-heritage-sponsored-project-2025/"
  },
  {
    "text": "Police use Taser to subdue man who stormed media area of Trump rally in Pennsylvania  —  JOHNSTOWN, Pa. (AP) — A man at Donald Trump's rally in Johnstown, Pennsylvania, stormed into the press area as the former president spoke Friday but was surrounded by police and sheriff's deputies and was eventually subdued with a Taser.",
    "url": "https://apnews.com/article/trump-rally-arrest-taser-media-68fe78b79ae65556c4efc850e142998c"
  },
  {
    "text": "Mass polio vaccination to begin in Gaza after the deadly disease reemerges  —  Polio's reemergence poses a threat to the war-torn territory and adjacent regions.  A baby, Gaza's first polio case in 25 years, can no longer move his limbs.  —  The World Health Organization and its partners plan … ",
    "url": "https://www.washingtonpost.com/world/2024/08/31/gaza-polio-case-vaccine-pause-israel-war/"
  }
]