[
  {
    "text": "‘No one involved in the effort thinks he has a path’: Biden insiders say the writing is on the wall  —  The set of Democrats who think he should reconsider his decision to stay in the race has grown to include aides, operatives and officials tasked with guiding his campaign to victory.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-reelection-insiders-no-path-debate-rcna161296"
  },
  {
    "text": "Playbook: What Obama and Pelosi are doing about Biden  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  This morning, we have a look at how, at a moment of unprecedented crisis for the Democratic Party, two of its most powerful and popular personalities … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/11/what-obama-and-pelosi-are-doing-about-biden-00167520"
  },
  {
    "text": "Amid Doubts About Biden's Mental Sharpness, Trump Leads Presidential Race  —  Roughly 6 in 10 voters describe both Biden and Trump as ‘embarrassing’  —  Table of Contents Table of Contents  — Broad dissatisfaction with the 2024 campaign  — Other findings: Voter engagement … ",
    "url": "https://www.pewresearch.org/politics/2024/07/11/amid-doubts-about-bidens-mental-sharpness-trump-leads-presidential-race/"
  },
  {
    "text": "Some Biden Advisers Are Discussing How to Convince Him to Step Aside  —  Close allies of the president are developing a case for why he should end his re-election campaign, though it is not clear that the discussions have reached him.  —  Some longtime aides and advisers to President Biden … ",
    "url": "https://www.nytimes.com/2024/07/11/us/politics/biden-aides-campaign.html"
  },
  {
    "text": "Republicans: No Fair Nominating Somebody Else! … The people most upset by efforts to replace Joe Biden as the Democratic nominee, after Biden and his immediate family, are in the Trump campaign.  Donald Trump's strategy is built around around portraying him as strong and virile … ",
    "url": "https://nymag.com/intelligencer/article/republicans-no-fair-nominating-somebody-else.html"
  },
  {
    "text": "The Embattled Biden Campaign Tests Kamala Harris's Strength vs. Trump  —  The campaign is quietly carrying out a head-to-head survey of voters between the vice president and Donald Trump, in a sign of the uncertainty even atop the Democratic Party.  —  Under siege from fellow Democrats … ",
    "url": "https://www.nytimes.com/2024/07/11/us/politics/biden-kamala-harris-poll-trump.html"
  },
  {
    "text": "Democrats Turn to Their Deputy Leader  —  Influential Democrats see an urgent need to bolster Vice President Kamala Harris's position with the public, whether or not President Joe Biden withdraws from the presidential contest.  If Biden leaves the race, which appears less likely as he digs … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/biden-campaign-kamala-harris/678963/"
  },
  {
    "text": "House Dems prepare to break with Biden if he tanks NATO press conference  —  Democratic lawmakers are making contingency plans in case Joe Biden tanks his highly anticipated solo press conference later Thursday, with at least a half-dozen lawmakers preparing to go public against the president … ",
    "url": "https://www.politico.com/live-updates/2024/07/11/congress/dems-brace-for-bidens-press-conference-00167587"
  },
  {
    "text": "Is Unfit to Lead Donald Trump Is Unfit to Lead  —  The editorial board is a group of opinion journalists  —  Next week, for the third time in eight years, Donald Trump will be nominated as the Republican Party's candidate for president of the United States.",
    "url": "https://www.nytimes.com/interactive/2024/07/11/opinion/editorials/donald-trump-2024-unfit.html"
  },
  {
    "text": "NYTimes Launders Its Own Agency  —  After having scolded the President that he “should leave the race” that Democratic primary voters elected him to run.  —  And having ordered the Democratic Party to “speak the [NYT's] plain truth to Biden,  —  And having ignored Trump's own actions in the meanwhile … ",
    "url": "https://www.emptywheel.net/2024/07/11/nytimes-launders-its-own-agency/"
  },
  {
    "text": "Biden Aides Believe Obama Is Plotting Joe's Ouster After Clooney Op-Ed  —  OH-BAMA  —  The former president reportedly got a heads up in a call from the actor about his tough New York Times op-ed calling on Biden to drop out of the 2024 race—and did not push back.",
    "url": "https://www.thedailybeast.com/obama-didnt-stop-george-clooneys-call-for-biden-to-quit"
  },
  {
    "text": "Exclusive: US and Germany foiled Russian plot to assassinate CEO of arms manufacturer sending weapons to Ukraine  —  US intelligence discovered earlier this year that the Russian government planned to assassinate the chief executive of a powerful German arms manufacturer that has been producing … ",
    "url": "https://www.cnn.com/2024/07/11/politics/us-germany-foiled-russian-assassination-plot/"
  },
  {
    "text": "The GOP Has Found A New Reason To Pawn Off America's Public Lands  —  Trump has endorsed a new party platform that tries to make a wildly unpopular idea more digestible to voters.  —  LOADING  —  Anti-federal land zealots across the country must be licking their chops.",
    "url": "https://www.huffpost.com/entry/gop-party-platform-public-lands_n_6690023fe4b0fb744167465b"
  },
  {
    "text": "Inflation continues to slow in the U.S., opening door to Fed rate cut  —  Consumer prices rose 3% in June, less than expected and down from May's rate, adding pressure on the Federal Reserve to lower interest rates.  —  Price increases slowed more sharply than expected in June … ",
    "url": "https://www.nbcnews.com/business/economy/inflation-rate-june-2024-interest-rate-cut-when-how-much-rcna160842"
  },
  {
    "text": "IRS collects milestone $1 billion in back taxes from high-wealth taxpayers  —  The IRS announced Thursday that it has collected $1 billion in back taxes from high-wealth tax cheats — a milestone meant to showcase how the agency is making use of the money it received as part … ",
    "url": "https://apnews.com/article/irs-audits-wealthy-taxes-biden-treasury-b12a48b200834a7c9a04dc293e3273c2"
  },
  {
    "text": "‘Someone has to birth all the babies’: How the far right is crafting their plan for women  —  A strong theme pervaded the fourth National Conservatism Conference this year, wrote Sarah Jones for New York Magazine's “Intelligencer” on Thursday — and that is the restrictive vision they have for women in society.",
    "url": "https://www.rawstory.com/republican-women-2668725633/"
  },
  {
    "text": "Republican push to hold Garland in inherent contempt over Biden interview audio fails  —  Florida Rep. Anna Paulina Luna's measure was rejected in a 204 to 210 vote.  —  US Attorney General Merrick Garland delivers remarks during the Commemoration of the 60th anniversary of the 1964 Civil Rights Act … ",
    "url": "https://abcnews.go.com/Politics/house-set-vote-inherent-contempt-resolution-garland/story?id=111512541"
  },
  {
    "text": "In a first, Republican majority on a Nevada county commission refuses to certify election  —  Three Republicans commissioners in a key Nevada swing county have refused to certify on an election recount, creating new turmoil in a community that since the 2020 election has been a hotbed for election skepticism … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/11/nevada-republicans-refuse-to-certify-reno-election/74352699007/"
  },
  {
    "text": "To Blur Or Not To Blur: Exposing Finland's Lakeside Neo-Nazi Meetup  —  A group of Finnish neo-Nazis and a few international friends have convened once again in Finland's picturesque lake district for a secretive summertime festival.  —  Last month, a campground about three-hours drive north … ",
    "url": "https://www.bellingcat.com/news/2024/07/11/to-blur-or-not-to-blur-exposing-finlands-lakeside-neo-nazi-meetup/"
  },
  {
    "text": "When and Why Marriage Became Partisan  —  WASHINGTON, D.C. — Analysis of nearly a century of Gallup measurement of Americans' marital status shows that after decades of little partisan difference, a gap in the marriage rates of Republicans and Democrats cracked open in the 1980s and has widened in the past quarter century.",
    "url": "https://news.gallup.com/poll/646793/why-marriage-became-partisan.aspx"
  }
]