[
  {
    "text": "With JD Vance, Things Just Get Weirder And Weirder  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  What On Earth?  —  JD Vance is coming into focus as a living breathing embodiment of the caricature … ",
    "url": "https://talkingpointsmemo.com/morning-memo/jd-vance-postmenopausal-women-grandchildren"
  },
  {
    "text": "August 2024 National Poll: Harris 50%, Trump 46%  —  Home Polls August 2024 National Poll: Harris 50%, Trump 46%  —  Independents, Younger Voters Swing Toward Harris  —  The first Emerson College Polling national survey following President Biden's decision not to seek re-election finds … ",
    "url": "https://emersoncollegepolling.com/august-2024-national-poll-harris-50-trump-46/"
  },
  {
    "text": "Playbook: Look who's pushing for a Trump reset  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  QUOTE OF THE DAY — A senior administration official to WSJ's Alex Ward and Nancy Youssef on the possibility of an Iranian attack on Israel … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/15/look-whos-pushing-for-a-trump-reset-00174134"
  },
  {
    "text": "Top Trump advisers in turmoil after campaign's worst month of 2024  —  Senior aides see challenges from enemies real and perceived as the ex-president struggles against Harris  —  Donald Trump has privately expressed faith in his campaign leadership and no personnel changes are currently expected … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/15/trump-campaign-leadership"
  },
  {
    "text": "Hidden-camera video shows Project 2025 co-author discussing his secret work preparing for a second Trump term  —  Last month, Russell Vought sat in a five-star Washington, DC, hotel suite, bowing his head in prayer with two men he thought were relatives of a wealthy conservative donor.",
    "url": "https://www.cnn.com/2024/08/15/politics/russ-vought-project-2025-trump-secret-recording-invs/"
  },
  {
    "text": "Zelensky says Ukraine has captured key Russian town  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/policy/defense/4829130-ukraine-captures-sudzha-russian-kursk/"
  },
  {
    "text": "White House says deals struck to cut prices of popular Medicare drugs that cost $50 billion yearly  —  WASHINGTON (AP) — The Biden administration is taking a victory lap after federal officials inked deals with drug companies to lower the price for 10 of Medicare's most popular and costliest drugs … ",
    "url": "https://apnews.com/article/biden-drug-prices-medicare-prescriptions-34886d6f362c242be268c05d5efd5411"
  },
  {
    "text": "Nevada Senate Race Now Favors Democrat, Report Says  —  The nonpartisan Cook Political Report moved the race from “tossup” to “lean Democrat” after polling shows Senator Jacky Rosen with a large edge.  —  Senator Jacky Rosen of Nevada, a Democrat seeking re-election to her seat for the first time … ",
    "url": "https://www.nytimes.com/2024/08/15/us/politics/jacky-rosen-nevada-senate.html"
  },
  {
    "text": "Democrats Maintain Edge in New Senate Polls, As Nevada Moves Back to Lean Democrat  —  The 2024 election has already been historic in a number of ways, but November could mark another recent electoral oddity — a rise in ticket-splitting between presidential and Senate races.",
    "url": "https://www.cookpolitical.com/analysis/survey-research/2024-swing-state-project/democrats-maintain-edge-new-senate-polls-nevada"
  },
  {
    "text": "Harris to call for federal ban on price-gouging in Friday speech  —  Vice President Harris on Friday will outline a series of economic policy proposals as part of her presidential campaign, including a call for a federal ban on corporate price-gouging.  —  Harris will deliver remarks in North Carolina … ",
    "url": "https://thehill.com/homenews/campaign/4828758-kamala-harris-federal-ban-price-gouging/"
  },
  {
    "text": "Why Facebook blocked Popular Information's reporting on Laura Loomer  —  Yesterday, Popular Information published a detailed report on the close relationship between former President Donald Trump and Laura Loomer, a far-right conspiracy theorist who says America should be a “white Judeo-Christian ethnostate.”",
    "url": "https://popular.info/p/update-why-facebook-blocked-popular"
  },
  {
    "text": "The Saudi Payments to Trump Are More Important than the Suspected Egyptian One  —  As you know, I was calling on the press to focus on the suspected $10 million payment Egypt made to Trump since before it was cool — since even before the WaPo significantly advanced the story over a month later.",
    "url": "https://www.emptywheel.net/2024/08/15/the-saudi-payments-to-trump-are-more-important-than-the-suspected-egyptian-one/"
  },
  {
    "text": "Trump seeks to delay his hush money sentencing until after the election  —  His lawyers are seeking to have the conviction overturned on immunity grounds.  —  NEW YORK — Attorneys for Donald Trump asked the judge overseeing the former president's Manhattan criminal case to postpone his sentencing … ",
    "url": "https://www.politico.com/news/2024/08/15/trump-seeks-delay-to-hush-money-sentencing-00174157"
  },
  {
    "text": "Musk's New AI Image Generator Immediately Used to Troll Him  —  OBVIOUSLY  —  Images flooded X showing Musk carrying out a school shooting with Mickey Mouse or being led on a leash by Donald Trump.  —  Elon Musk's AI chatbot launched a new image generation feature Wednesday … ",
    "url": "https://www.thedailybeast.com/musks-new-ai-image-generator-grok-2-immediately-used-to-troll-him"
  },
  {
    "text": "Trump campaign brings Corey Lewandowski back on board  —  The move is part of an expansion of the campaign's ranks  —  Donald Trump's campaign is expanding its ranks as he seeks to regain his footing in the presidential campaign, bringing on a handful of top allies — including former Trump 2016 campaign manager Corey Lewandowski.",
    "url": "https://www.politico.com/news/2024/08/15/trump-campaign-brings-corey-lewandowski-back-on-board-00174155"
  },
  {
    "text": "JD Vance: ‘Whole Purpose Of The Postmenopausal Female’ Is To Care For Grandkids  —  JD Vance once said one of the best things for the economy is the “postmenopausal female” because her purpose in life is to provide free childcare.  —  The comments were revealed Wednesday in newly resurfaced audio from 2020 … ",
    "url": "https://www.ibtimes.com/jd-vance-postmenopausal-female-economy-3739794"
  },
  {
    "text": "JD Vance: Amazon funded Black Lives Matter so riots would destroy rival retailers  —  Loading...  WASHINGTON  —  In 2021, J.D. Vance gave a speech to a conservative think tank on “woke capital” - and accused Amazon of funding Black Lives Matter in order to burn down the competition.",
    "url": "https://www.csmonitor.com/USA/Politics/2024/0815/jd-vance-speech-bezos-amazon-abortion"
  },
  {
    "text": "When Is “Recyclable” Not Really Recyclable?  When the Plastics Industry Gets to Define What the Word Means.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Is there anything more pathetic than a used plastic bag?",
    "url": "https://www.propublica.org/article/plastics-industry-redefine-recyclable-ftc-grocery-bags"
  }
]