[
  {
    "text": "‘Jan. 6 choir’ member sentenced to 7 years in Capitol attack  —  A man who joined a nightly performance of the national anthem inside the D.C. jail that has been promoted by former president Donald Trump and his allies was sentenced to seven years in prison for assaulting police and obstructing Congress on Jan. 6.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/10/06/jenkins-jan-6-choir-member-sentence-attack/"
  },
  {
    "text": "Jim Jordan, Who's Running For Speaker, Played A Key Role In Trump's 2020 Election Plot  —  “Jim Jordan knew more about what Donald Trump had planned for Jan. 6 than any other member of the House,” former Rep. Liz Cheney (R-Wyo.) said.  —  LOADING  —  WASHINGTON ― … ",
    "url": "https://www.huffpost.com/entry/jim-jordan-speaker-january-6_n_65202c86e4b091a3dc271695"
  },
  {
    "text": "Scalise makes House speaker pitch after Trump endorses Jordan: I know how to ‘unify’  —  Former President Trump has thrown his support behind Rep. Jim Jordan over the House majority leader  —  House speaker hopeful Rep. Steve Scalise, R-La., joined “FOX & Friends” Friday morning shortly … ",
    "url": "https://www.foxnews.com/media/scalise-makes-house-speaker-pitch-trump-endorses-jordan-know-unify"
  },
  {
    "text": "Team Trump readies attacks on RFK Jr. as spoiler anxiety grows  —  The News  —  Members of Donald Trump's team are quietly preparing to go on offense against Robert F. Kennedy Jr. as internal campaign polling suggests his expected third party bid could draw more votes from Trump than President Joe Biden in a general election.",
    "url": "https://www.semafor.com/article/10/06/2023/team-trump-readies-attacks-on-rfk-jr-as-spoiler-anxiety-grows"
  },
  {
    "text": "How Trump was talked into — and out of — a run for speaker  —  A behind-the-scenes campaign coaxed the former president out of a quixotic campaign.  —  Just hours after Kevin McCarthy was deposed as House speaker, the “draft Trump” movement began.  —  “I called him and I said, 'Sir … ",
    "url": "https://www.politico.com/news/2023/10/06/trump-jim-jordan-house-speaker-endorsements-00120320"
  },
  {
    "text": "Kevin McCarthy considers resigning from the House before the end of his term  —  The deposed former speaker has made clear he plans to stay at least through the speakership election before ending his House career, two people familiar with the matter tell POLITICO.",
    "url": "https://www.politico.com/news/2023/10/06/kevin-mccarthy-considers-resigning-congress-00120381"
  },
  {
    "text": "Trump trial Day 5 highlights: Ex-Trump executive says Allen Weisselberg asked for help in committing tax fraud  —  Trump's New York civil fraud trial wraps up its first week … 25m ago / 9:41 PM UTC  —  Appeals court stays cancellation of Trump biz certificates  —  By Dareh Gregorian, Adam Reiss and Lisa Rubin",
    "url": "https://www.nbcnews.com/politics/live-blog/trump-fraud-trial-live-updates-rcna119144"
  },
  {
    "text": "Trump loses bid to stay NY fraud trial, but gets delay of business certificate cancellations  — A New York appeals court declined to stay the civil business fraud trial against Donald Trump.  — But the court did halt a judge's order that cancelled the business certificates of Trump's companies.",
    "url": "https://www.cnbc.com/2023/10/06/trump-loses-bid-to-stay-ny-fraud-trial-but-gets-delay-of-business-certificate-cancellations.html"
  },
  {
    "text": "“Tip of the iceberg”: Experts sound the alarm after Trump blabbed nuclear secrets at Mar-a-Lago  —  Trump allegedly told an Australian billionaire potentially sensitive info — which he then shared with 45 others  —  Former President Donald Trump allegedly discussed potentially sensitive information … ",
    "url": "https://www.salon.com/2023/10/06/tip-of-the-iceberg-experts-sound-the-alarm-after-blabbed-nuclear-secrets-at-mar-a-lago/"
  },
  {
    "text": "The final 11 seconds of a fatal Tesla Autopilot crash  —  A reconstruction of the wreck shows how human error and emerging technology can collide with deadly results  —  The sun had yet to rise in Delray Beach, Fla., when Jeremy Banner flicked on Autopilot.",
    "url": "https://www.washingtonpost.com/technology/interactive/2023/tesla-autopilot-crash-analysis/"
  },
  {
    "text": "Michael Benz, a rising voice for conservative criticism of online censorship, appears to have a secret history as an alt-right persona  —  Frame Game, the pseudonym of an alt-right internet personality, hid his face while pushing racist conspiracy theories.  Inadvertent slips revealed details about his identity.",
    "url": "https://www.nbcnews.com/tech/internet/michael-benz-rising-voice-conservative-criticism-online-censorship-rcna119213"
  },
  {
    "text": "A bipartisan coalition is the way forward for the House  —  Hakeem Jeffries (N.Y.) is the Democratic leader of the House of Representatives.  —  In recent days, Democrats have tried to show our colleagues in the Republican majority a way out of the dysfunction and rancor they have allowed to engulf the House.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/06/hakeem-jeffries-bipartisan-coalition-house-gop/"
  },
  {
    "text": "Former Soldier Indicted for Attempting to Pass National Defense Information to People's Republic of China  —  For Immediate Release  —  Defendant Arrested Upon Arrival in San Francisco on Flight from Hong Kong  —  A former U.S. Army Sergeant whose last duty post was Joint Base Lewis-McChord … ",
    "url": "https://www.justice.gov/opa/pr/former-soldier-indicted-attempting-pass-national-defense-information-peoples-republic-china"
  },
  {
    "text": "Is the speaker pro tempore acting up?  —  Presented by With assists from POLITICO's Congress team  —  PARSING PATRICK'S POWERS  —  The word “unprecedented” often gets bandied about in politics for things that are actually just uncommon.  What's happening now in the House, however, is truly unprecedented.",
    "url": "https://www.politico.com/newsletters/huddle/2023/10/05/is-the-speaker-pro-tempore-acting-up-00120248"
  },
  {
    "text": "Republicans aim to change internal Speaker nomination rules to avoid floor fight  —  House Republicans are eyeing changing internal party rules to temporarily raise the threshold needed to nominate a Speaker, with the intention of avoiding the sort of days-long, multi-ballot election that took place on the House floor in January.",
    "url": "https://thehill.com/homenews/house/4242687-republicans-aim-to-change-internal-speaker-nomination-rules-to-avoid-floor-fight/"
  },
  {
    "text": "New York v. Trump on Day Five: Company Exec Testifies About Mar-a-Lago and Eric Trump's Golf Club Directive to ‘Leave Value as Is’  —  The former controller of the Trump Organization revealed over-valuations of key real estate properties including the so-called ‘winter White House’",
    "url": "https://themessenger.com/politics/eric-trump-trial-new-york-day-five-maralago-golf"
  },
  {
    "text": "There's Surprisingly Little Evidence That EVs Will Require Fewer Workers  —  The research instead suggests the opposite is true.  —  When former President Donald Trump was campaigning in Michigan last week, he warned autoworkers that President Biden's electric vehicle policies would “put an end” to their “way of life.”",
    "url": "https://heatmap.news/electric-vehicles/evs-trump-uaw-jobs-evidence"
  },
  {
    "text": "Pharmacies begin dispensing abortion pills  —  A handful of pharmacies are offering the pills 10 months after the Biden administration allowed them to do so.  —  A handful of independent pharmacies across the country have quietly begun dispensing the abortion pill mifepristone under … ",
    "url": "https://www.politico.com/news/2023/10/06/pharmacies-begin-dispensing-abortion-pills-00120397"
  },
  {
    "text": "Biden's two-headed policy nightmare  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  With help from producer Ben Johansen  —  If we could pinpoint two major sources of anxiety in the West Wing this week, they'd probably rank like this:",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2023/10/05/bidens-two-headed-policy-nightmare-00120131"
  },
  {
    "text": "Police found 115 bodies at Colorado ‘green’ funeral home while investigating putrid smells  —  The awful smell seeped from a neglected building in a small Colorado town for days, followed by a report that made police take a closer look at the “green” funeral operator's storage facility.",
    "url": "https://apnews.com/article/colorado-funeral-home-green-burials-investigation-4c77ec13d8dfb1394e61da8881426deb"
  },
  {
    "text": "Trump's Latest Gamble Is Outlandish—but It Just Might Work  —  And if it does, it would transform U.S. presidents from chief executives into kings. … Former President Donald Trump's legal team went big in their latest effort to derail the prosecution against him for conspiring to interfere … ",
    "url": "https://www.thedailybeast.com/trumps-latest-gamble-is-outlandishbut-it-just-might-work"
  }
]