[
  {
    "text": "Hegseth orders makeup studio installed at Pentagon  —  Defense Secretary Pete Hegseth recently ordered modifications to a room next to the Pentagon press briefing room to retrofit it with a makeup studio that can be used to prepare for television appearances, multiple sources told CBS News.",
    "url": "https://www.cbsnews.com/news/hegseth-orders-makeup-studio-installed-pentagon/"
  },
  {
    "text": "3 ways Trump's immigration crackdown could hit U.S. citizens  —  Trump administration officials are suggesting their immigration crackdown could expand to include deporting convicted U.S. citizens and charging anyone — not just immigrants — who criticizes Trump's policies.",
    "url": "https://www.axios.com/2025/04/23/trump-immigration-crackdown-us-citizens"
  },
  {
    "text": "U.S. citizen wrongly detained by Border Patrol says government account is false  —  On April 8, Jose Hermosillo, a 19-year-old U.S. citizen, was wrongfully incarcerated by immigration authorities in Arizona, who claimed he was an undocumented immigrant.  He was held for 10 days … ",
    "url": "https://popular.info/p/us-citizen-wrongly-detained-by-border"
  },
  {
    "text": "Laura Ingraham's Angry Rants at Dem on Fox Reveal MAGA's Dark Endgame  —  Democrats have long intensely debated whether to appear on Fox News.  Going on Fox risks providing a sheen of legitimacy to a propaganda outlet.  But not going on risks leaving Republican news consumers … ",
    "url": "https://newrepublic.com/article/194298/laura-ingraham-yassamin-ansari-deportation"
  },
  {
    "text": "Trump Wants You to Think Resistance Is Futile.  It Is Not.  —  The American constitutional system is built on the theory that the self-interest of lawmakers can be as much of a defense against tyranny as any given law or institution.  —  As James Madison wrote in Federalist 51 … ",
    "url": "https://www.nytimes.com/2025/04/23/opinion/trump-van-hollen-abrego-garcia.html?unlocked_article_code=1.B08.ceTM.p6y6JqnhH84v&smid=url-share"
  },
  {
    "text": "Trump Says Undocumented Immigrants Shouldn't Get Trials Before Deportation  —  The president claimed that countries were sending their prisoners to the United States and that he needed to bypass the constitutional demands of due process to expel them quickly.",
    "url": "https://www.nytimes.com/2025/04/22/us/politics/trump-undocumented-immigrants-trials-deportation.html"
  },
  {
    "text": "Americans sour on Trump's handling of the economy, Reuters/Ipsos poll finds  —  Americans elected President Donald Trump in hopes that he would fight inflation and boost the U.S. economy, but as he approaches his 100th day in office they are giving the Republican poor marks for his handling of both, a new Reuters/Ipsos poll shows.",
    "url": "https://www.reuters.com/world/us/americans-sour-trumps-handling-economy-reutersipsos-poll-finds-2025-04-23/"
  },
  {
    "text": "Trump softens tariff tone amid empty shelves warning, market slump  —  President Trump got a scare from CEOs and markets on Monday.  On Tuesday, he blunted some of his sharpest threats — signaling a softer stance on China and retreating from fiery rhetoric targeting the Fed.",
    "url": "https://www.axios.com/2025/04/23/trump-economy-tariffs-china-powell"
  },
  {
    "text": "Rubio and Witkoff bail on crucial Ukraine talks amid Crimea split  —  Donald Trump's peace proposal involves a potential lifting of sanctions and informal U.S. recognition of Russia's control over Crimea.  That's a nonstarter for Kyiv.  —  LONDON — British plans to host a summit Wednesday … ",
    "url": "https://www.politico.eu/article/marco-rubio-steve-witkoff-russia-donald-trump-pull-out-of-ukraine-talks-amid-crimea-split/"
  },
  {
    "text": "Longtime U.S. Sen. Dick Durbin decides 'it's time,' won't seek reelection  —  The 80-year-old Democrat told WBEZ in an Illinois exclusive that age was a factor in his not seeking a sixth term in Congress.  —  Democratic U.S. Sen. Dick Durbin will not seek a sixth term next year … ",
    "url": "https://chicago.suntimes.com/politics/senator-dick-durbin-reelection"
  },
  {
    "text": "Abrego Garcia's Wife Forced to Go Into Hiding Thanks to DHS Slip-Up  —  The wife of Kilmar Abrego Garcia, who was mistakenly deported to El Salvador by the Trump administration, was forced to move to a safe house with her children, after the government posted their home address to social media.",
    "url": "https://newrepublic.com/post/194289/abrego-garcia-wife-hiding-dhs-address"
  },
  {
    "text": "They Criticized Musk on X. Then Their Reach Collapsed.  —  Note: Five-day moving average.  Views are only shown up to 400,000.  Source: X  —  When Mr. Musk purchased X in 2022, he promised to create a free speech haven and named himself a “free speech absolutist.”",
    "url": "https://www.nytimes.com/interactive/2025/04/23/business/elon-musk-x-suppression-laura-loomer.html?unlocked_article_code=1.B08.-KRh.oD5OYidUGf7G&smid=url-share"
  },
  {
    "text": "The courage to be decent  —  One of the more pernicious effects of authoritarianism is to make the everyday participation in civic life we take for granted feel subversive.  The goal isn't to police all behavior at all times.  It's to make us fearful to the point that we police our own behavior.",
    "url": "https://radleybalko.substack.com/p/the-courage-to-be-decent"
  },
  {
    "text": "Jan Schakowsky planning May 5 retirement announcement  —  The veteran House Democrat is facing a longshot primary challenge.  —  Rep. Jan Schakowsky is planning to announce next month she won't seek reelection after 14 terms in the House and has started informing allies of her retirement decision … ",
    "url": "https://www.politico.com/news/2025/04/23/jan-schakowsky-retirement-announcement-00306181"
  },
  {
    "text": "Trump Administration Texted College Professors' Personal Phones to Ask If They're Jewish  —  Most professors at Barnard College received text messages on Monday notifying them that a federal agency was reviewing the college's employment practices, according to copies of the messages reviewed by The Intercept.",
    "url": "https://theintercept.com/2025/04/23/trump-eeoc-barnard-columbia-texts-jewish/"
  },
  {
    "text": "Tracking the Trump administration's nosedive  —  A lot of lines on a lot of charts are pointing down and to the right.  —  Perhaps the best analogy for the first three months of Donald Trump's second presidential term comes not from American history but from Looney Tunes.",
    "url": "https://www.washingtonpost.com/opinions/2025/04/23/data-trump-economy-immigration-approval/"
  },
  {
    "text": "Scoop: Musk vs. Bessent dispute erupted into West Wing shouting match  —  Elon Musk and Treasury Secretary Scott Bessent got into a heated shouting match in earshot of President Trump and other officials in the White House last week during a dispute about the IRS, two witnesses and three sources briefed on the matter tell Axios.",
    "url": "https://www.axios.com/2025/04/23/musk-bessent-trump-white-house-irs"
  },
  {
    "text": "Trump's Job Rating Drops, Key Policies Draw Majority Disapproval as He Nears 100 Days  —  Majorities in both parties say Trump administration must stop an action if a federal court rules it is illegal  —  Table of Contents Table of Contents  —  Majorities in both parties … ",
    "url": "https://www.pewresearch.org/politics/2025/04/23/trumps-job-rating-drops-key-policies-draw-majority-disapproval-as-he-nears-100-days/"
  },
  {
    "text": "Harvard Youth Poll  —  Introduction  —  A new national poll from the Institute of Politics at Harvard Kennedy School reveals a generation navigating financial hardship, frayed social bonds, and declining trust in institutions.  As the nation confronts generational turnover and a volatile political climate … ",
    "url": "https://iop.harvard.edu/youth-poll/50th-edition-spring-2025"
  },
  {
    "text": "Cronyism, Capitulation and Utter Chaos  —  Hitting the road today, but I have time for a note on the news that moved markets yesterday.  Bloomberg reports: … Investors liked this report, but it was, if you think about it, deeply disturbing on two levels.",
    "url": "https://paulkrugman.substack.com/p/cronyism-capitulation-and-chaos"
  },
  {
    "text": "Democratic Governor Moves To Boycott El Salvador For Aiding Trump  —  Illinois Gov. J.B. Prtizker is ordering the state's pension funds and procurement agencies to review any investments in the Latin American country.  —  Illinois Gov. J.B. Pritzker (D) is asking his state's pension funds … ",
    "url": "https://www.huffpost.com/entry/democratic-governor-moves-to-boycott-el-salvador-for-aiding-trump_n_68090080e4b096ecd6e83472"
  },
  {
    "text": "The Dispatch buying SCOTUSblog  —  The Dispatch is buying the digital media website SCOTUSblog, the outlets announced Wednesday.  —  SCOTUSblog covers all things Supreme Court and has been a go-to resource for journalists, lawyers and court watchers for more than two decades.",
    "url": "https://thehill.com/homenews/media/5263294-the-dispatch-scotusblog-purchase/"
  },
  {
    "text": "After a month of searching, man learns from NBC News that DHS sent his brother to El Salvador  —  A Venezuelan man says he and his family back home have been anguished about the “forced disappearance” from the U.S. of Neiyerver Adrián Leon Rengel.  —  It was March 13 when Nedizon … ",
    "url": "https://www.nbcnews.com/news/latino/venezuelan-brother-deported-el-salvador-family-looking-rcna202279"
  },
  {
    "text": "The Trump Administration Is Objectively Pro-Cancer  —  America used to have the best medical research system in the world.  Elon Musk and RFK Jr. are ripping it to shreds.  —  “United in Blue,” a flag installation organized by the organization Fight Colorectal Cancer, is seen on the National Mall in Washington, March 14, 2025.",
    "url": "https://prospect.org/health/2025-04-23-trump-administration-objectively-pro-cancer/"
  },
  {
    "text": "Shari Redstone kept tabs on ‘60 Minutes’ segments on Trump  —  The Scoop  —  Paramount owner Shari Redstone in recent days sought to know which upcoming stories were about President Donald Trump, according to two people familiar with the situation — triggering a series of events that ended … ",
    "url": "https://www.semafor.com/article/04/22/2025/shari-redstone-kept-tabs-on-60-minutes-segments-on-trump"
  },
  {
    "text": "Trump ‘Alarmists’ Were Right.  We Should Say So.  —  Throughout the Trump era I've been firmly in the camp unaffectionately dismissed as ‘alarmist’ by most commentators.  Put simply: It is that bad.  Liberal democracy is in danger.  Fascism is a reasonable term for what we're fighting.",
    "url": "https://www.liberalcurrents.com/trump-alarmists-were-right-we-should-say-so/"
  },
  {
    "text": "ICE detains 2 men in Charlottesville courthouse raid  —  Three men who identified themselves as Homeland Security officers raided a courthouse in downtown Charlottesville Tuesday, detaining two men without explanation.  —  ×  —  A man is detained by officers with the U.S. Department … ",
    "url": "https://dailyprogress.com/news/local/crime-courts/article_9ce921d6-5f61-4546-b0c9-ea2287d8bf16.html"
  },
  {
    "text": "NIH cancels its first and largest study centered on women  —  The Women's Health Initiative has produced numerous influential findings  —  Skip backwardsGo ten seconds backward Skip forwardsGo ten seconds forward  —  Audio is AI-generated.  Report an issue|  Give feedback",
    "url": "https://www.science.org/content/article/nih-cancels-its-first-and-largest-study-centered-women"
  },
  {
    "text": "What is America's pro-natalism movement really about?  —  Pro-natalists aren't actually interested in making motherhood easier by offering things like affordable childcare.  So what is their aim?  —  Malcolm and Simone Collins, the pro-natalist couple who are reportedly consulting … ",
    "url": "https://www.theguardian.com/commentisfree/2025/apr/23/america-pro-natalism-women"
  },
  {
    "text": "Reversing Humphrey's Executor and the Problem of the Federal Reserve  —  There is simply no principled way for the Supreme Court to retain the Fed's removal protections while overturning Humphrey's Executor.  —  Meet The Authors … President Donald Trump has made overtures … ",
    "url": "https://www.lawfaremedia.org/article/repealing-humphrey-s-executor-and-the-problem-of-the-federal-reserve"
  },
  {
    "text": "Trump to Sign Executive Order Targeting University Accreditors  —  Move is latest in effort to remake higher education after the president and other Republicans have long criticized the accreditation process  —  President Trump is expected to sign an executive order Wednesday to shake … ",
    "url": "https://www.wsj.com/us-news/education/trump-accreditors-executive-order-universities-4e4366cc?st=jR6Cq3&reflink=article_copyURL_share"
  }
]