[
  {
    "text": "Judge rules Donald Trump defrauded banks and insurers while building real estate empire  —  A judge ruled Tuesday that Donald Trump committed fraud for years while building the real estate empire that catapulted him to fame and the White House, and he ordered some of the former president's companies removed … ",
    "url": "https://apnews.com/article/donald-trump-letitia-james-fraud-lawsuit-1569245a9284427117b8d3ba5da74249"
  },
  {
    "text": "Judge Finds Trump Inflated Property Values, a Victory for New York A.G.  —  The decision will simplify the path for Attorney General Letitia James, who has accused former President Donald J. Trump of overvaluing his holdings by as much as $2.2 billion.  —  The New York attorney general won … ",
    "url": "https://www.nytimes.com/2023/09/26/nyregion/trump-james-fraud-trial.html"
  },
  {
    "text": "Ruling Against Trump Cuts to the Heart of His Identity  —  The finding by a judge in a New York civil case that Donald Trump committed fraud in valuing his real estate properties undermined the narrative of the business career that launched him in politics.  —  Nearly every aspect … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-fraud-ruling.html"
  },
  {
    "text": "Judge rules Trump engaged in repeated fraud, effectively deciding central question in $250M civil trial  —  The civil case is scheduled to go to trial on Oct. 2.  —  Former President Donald Trump submitted “fraudulent valuations” for assets that were then used by himself … ",
    "url": "https://abcnews.go.com/Politics/donald-trump-submitted-fraudulent-valuations-assets-secure-loans/story?id=103508205"
  },
  {
    "text": "UAW Leader Has No Desire at All to Talk to Trump in Michigan  —  Trump's expected appearance Wednesday at a non-union auto plant is a “pathetic irony,” Shawn Fain said on CNN.  —  The United Auto Workers union's president derided GOP presidential candidate Donald Trump as being out of touch … ",
    "url": "https://www.thedailybeast.com/united-auto-workers-unions-president-doesnt-want-to-meet-trump-in-michigan"
  },
  {
    "text": "Trump Adds Two Attorneys to Criminal Defense Team  —  The former president has been stacking his defense team as he prepares for the trove of legal cases against him and their upcoming trials  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/trump-adds-two-attorneys-to-criminal-defense-team"
  },
  {
    "text": "Dems eye their price to bail out the speaker  —  Presented by With assists from POLITICO's Congress team  —  TICK TOCK: The government will shut down in 5 days if Congress can't pass a funding patch.  —  DEMS STILL WEIGHING THE COST OF SAVING MCCARTHY  —  It's the question that Capitol Hill … ",
    "url": "https://www.politico.com/newsletters/huddle/2023/09/26/dems-eye-their-price-to-bail-out-the-speaker-00118255"
  },
  {
    "text": "North Korea says it will expel Travis King, the US soldier who crossed into the country in July  —  North Korea said Wednesday that it will expel a U.S. soldier who crossed into the country through the heavily armed border between the Koreas in July.  The North's official Korean Central News Agency … ",
    "url": "https://apnews.com/article/north-korea-us-soldier-travis-king-00c171778e378d95fe1115fe31612ec2"
  },
  {
    "text": "What Republican voters think of GOP candidates before the second debate  —  Seven Republican presidential candidates will debate Wednesday night at the Ronald Reagan Presidential Library in California.  So 538, The Washington Post and Ipsos are teaming up once again to survey Republicans … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/republican-primary-debate-voters/"
  },
  {
    "text": "“They've already succeeded”: Will Bunch on the GOP's impeachment clown show  —  They don't have evidence.  But they don't need any for their purposes.  —  ∙ Paid … As House Republicans turn the impeachment process into a joke with their evidence-free Joe Biden fishing expedition … ",
    "url": "https://www.publicnotice.co/p/biden-impeachment-inquiry-explained-will-bunch"
  },
  {
    "text": "Hunter Biden received $250K wires originating in Beijing with beneficiary address listed as Joe Biden's home  —  EXCLUSIVE: Hunter Biden received wires that originated in Beijing for more than $250,000 from Chinese business partners during the summer of 2019 — wires that listed the Delaware home … ",
    "url": "https://www.foxnews.com/politics/hunter-biden-received-250k-wire-from-beijing-with-beneficiary-address-listed-as-joe-biden-delaware-home"
  },
  {
    "text": "Commander Biden bites another Secret Service agent, the 11th known incident  —  President Joe Biden's younger dog, Commander, bit another US Secret Service agent at the White House Monday evening, CNN has learned, the 11th known biting incident involving the 2-year-old German Shepherd.",
    "url": "https://www.cnn.com/2023/09/26/politics/commander-biden-biting-incident/"
  },
  {
    "text": "Target Closes Select Stores to Prioritize Team Member and Guest Safety  —  At Target, we take the decision to close stores very seriously, and only do so after taking meaningful steps to invest in the guest experience and improve business performance.  With that said, we have made the difficult decision … ",
    "url": "https://corporate.target.com/press/releases/2023/09/Target-Closes-Select-Stores-to-Prioritize-Team-Mem"
  },
  {
    "text": "Under India's pressure, Facebook let propaganda and hate speech thrive  —  SAN FRANCISCO — Nearly three years ago, Facebook's propaganda hunters uncovered a vast social media influence operation that used hundreds of fake accounts to praise the Indian army's crackdown in the restive border region … ",
    "url": "https://www.washingtonpost.com/world/2023/09/26/india-facebook-propaganda-hate-speech/"
  },
  {
    "text": "FCC chair proposes reinstating Obama-era net neutrality rules  —  Federal Communications Commission (FCC) Chairwoman Jessica Rosenworcel said on Tuesday that she plans to put forward a proposal to reinstate net neutrality rules that were repealed under former President Trump.",
    "url": "https://thehill.com/policy/technology/4224200-fcc-chair-proposes-reinstating-obama-era-net-neutrality-rules/"
  },
  {
    "text": "Unraveling what's really happening in Florida school libraries  —  On Tuesday, Popular Information reported that librarians in Charlotte County, Florida, were instructed by the school district superintendent to remove all books with LGBTQ characters.  This story was based on a document dated July 24 … ",
    "url": "https://popular.info/p/update-unraveling-whats-really-happening"
  },
  {
    "text": "From secretaries to secretary of state, Biden documents probe casts wide net: Sources  —  Investigators have interviewed scores of witnesses — some more than once.  —  The federal investigation into President Joe Biden's handling of classified documents prior to becoming president has grown … ",
    "url": "https://abcnews.go.com/US/secretaries-secretary-state-biden-documents-probe-casts-wide/story?id=103504213"
  },
  {
    "text": "How the Marxist Left captured higher education  —  The mission of a university is to discover truth and transmit that essential knowledge to future generations.  That has been achieved by what we call in the West the Socratic Dialogue — that is, ferreting out what is good, true, and beautiful by testing ideas in an academic setting.",
    "url": "https://www.washingtonexaminer.com/restoring-america/faith-freedom-self-reliance/how-the-marxist-left-captured-higher-education"
  },
  {
    "text": "The Sick, Racist Message Behind Why Trump Chose That Particular Gun Store  —  During a campaign trip to South Carolina, Donald Trump took some time to visit the gun store that sold weapons to the racist Jacksonville, Florida, mass shooter.  —  Trump visited Palmetto State Armory on Monday … ",
    "url": "https://newrepublic.com/post/175764/trump-gun-store-south-carolina-palmetto-state-armory-racist-message"
  }
]