[
  {
    "text": "Trump's weaknesses with GOP voters go beyond the suburbs  —  Primary results from more than 1,000 counties show clear warning signs for Trump with Republican voters in exurbs and small towns.  —  The battle for Trump-skeptical Republican voters isn't just about the suburbs.",
    "url": "https://www.politico.com/news/2024/03/30/trump-gop-primary-voters-exurbs-00149822"
  },
  {
    "text": "Trump's Former Defense Secretary Tells Bill Maher He Is ‘Definitely Not’ Voting for Ex Boss  —  ‘DEFINITELY NOT’  —  “There's no way I'll vote for Trump, but every day that Trump does something crazy, the door to voting for Biden opens a little bit more, and that's where I'm at,” Esper said.",
    "url": "https://www.thedailybeast.com/former-trump-defense-secretary-mark-esper-tells-bill-maher-he-wont-vote-for-ex-boss"
  },
  {
    "text": "We Need to Talk About This  —  Today's widely discussed Trump post on Truth Social isn't just another instance of bad behavior.  It's not just a shrug of the shoulders and a resigned sigh of, “What are you going to do?”  Far too often, people resignedly accept Trump's behavior because they believe there's no alternative.",
    "url": "https://joycevance.substack.com/p/we-need-to-talk-about-this"
  },
  {
    "text": "Donald Trump faces backlash after sharing video featuring a hogtied Joe Biden  —  Former President Donald Trump is facing intense criticism for what Democrats say is a new low this weekend after sharing a video on his social media website that has an image of President Joe Biden hogtied.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/30/trump-video-biden-hogtied/73154098007/"
  },
  {
    "text": "MAGA's Ugly, Hateful Response to Bridge Horror Is About to Get Worse  —  One of the ugliest features of MAGA politics is the eagerness to seize on large scale accidents, disasters, and pandemics to spread conspiracy theories, invent new culture-war obsessions, and pit one region of the country against another.",
    "url": "https://newrepublic.com/article/180286/magas-ugly-hateful-response-bridge-horror-get-worse"
  },
  {
    "text": "Our Trump reporting upsets some readers, but there aren't two sides to facts: Letter from the Editor  —  A more-than-occasional arrival in the email these days is a question expressed two ways, one with dripping condescension and the other with courtesy:  —  Why don't our opinion platforms … ",
    "url": "https://www.cleveland.com/news/2024/03/our-trump-reporting-upsets-some-readers-but-there-arent-two-sides-to-facts-letter-from-the-editor.html"
  },
  {
    "text": "Biden proclaims Easter Sunday as Transgender Day of Visibility, sparking outrage online  —  President Joe Biden sparked outrage online when he proclaimed March 31 as Transgender Day of Visibility on Friday.  This year, Easter Sunday falls on that day.  —  A number of prominent political figures … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/2946205/biden-proclaims-easter-sunday-as-transgender-day-of-visibility-sparking-outrage-online/"
  },
  {
    "text": "Publisher's slip-up reveals James Comer is hawking book about Biden impeachment inquiry  —  A publisher's slip-up revealed that House Oversight Committee chair James Comer (R-KY) is hawking a book about his effort to impeach President Joe Biden, according to a new report.",
    "url": "https://www.rawstory.com/comer-impeachment/"
  },
  {
    "text": "Trump Rekindles Relationships With Key 2016 Donors  —  The former president met with the Mercers and others as he sought to keep pace financially with President Biden.  —  Donald J. Trump, facing a cash crunch that puts him at a severe disadvantage to President Biden, dined on Thursday night … ",
    "url": "https://www.nytimes.com/2024/03/30/us/politics/trumper-mercer-dinner.html"
  },
  {
    "text": "Bolton claims Trump 'doesn't have the brains' to be a dictator  —  Former National Security Advisor John Bolton said in an interview that his former boss, former President Trump “doesn't have the brains” to be a dictator, as questions arise about what a second Trump term would look like.",
    "url": "https://thehill.com/blogs/blog-briefing-room/4565077-bolton-claims-trump-doesnt-have-brains-be-dictator/"
  },
  {
    "text": "Scoop: National Archives gives new tranche of Biden emails to House GOP … - Republicans have increasingly acknowledged that the investigation has still failed to uncover evidence that could propel a vote to impeach Biden. … - “As we have explained to your staff, we are conducting … ",
    "url": "https://www.axios.com/2024/03/30/national-archives-biden-impeachment-republicans"
  },
  {
    "text": "From the playground to politics, it's the bullies who rule.  But it doesn't have to be this way  —  At every stage of our lives we are forced into destructive competition.  It's not natural, and it holds the best people back  —  A large and impressive study of children's progress … ",
    "url": "https://www.theguardian.com/commentisfree/2024/mar/30/playground-politics-bullies-competition"
  },
  {
    "text": "Will the media learn the right lesson from the Ronna McDaniel debacle?  —  You're reading Jennifer Rubin's subscriber-only newsletter.  Sign up to get it in your inbox.  —  This week, I look at the Ronna McDaniel debacle, pick the distinguished person of the week and share a magnificent theatrical experience.",
    "url": "https://www.washingtonpost.com/opinions/2024/03/29/newsletter-ronna-mcdaniel-media-alsobrooks/"
  },
  {
    "text": "Mnuchin's plan to buy TikTok has some insiders bewildered  —  His proposal to buy the app without its algorithm from its Chinese owner has drawn skeptical reactions, including from those he's pitched  —  Former treasury secretary Steven Mnuchin is telling rich investors he has a plan to take over TikTok … ",
    "url": "https://www.washingtonpost.com/technology/2024/03/30/tiktok-mnuchin-sale-algorithm/"
  }
]