[
  {
    "text": "Electric cars have a road trip problem, even for the secretary of energy  —  When Secretary of Energy Jennifer Granholm set out on a four-day electric-vehicle road trip this summer, she knew charging might be a challenge.  But she probably didn't expect anyone to call the cops.",
    "url": "https://www.npr.org/2023/09/10/1187224861/electric-vehicles-evs-cars-chargers-charging-energy-secretary-jennifer-granholm"
  },
  {
    "text": "White House press secretary ends news conference as Biden is still responding to questions from reporters  —  White House press secretary Karine Jean-Pierre on Sunday abruptly ended a news conference with President Joe Biden in Hanoi, Vietnam, at one point taking a microphone and announcing … ",
    "url": "https://www.cnn.com/2023/09/10/politics/karine-jean-pierre-joe-biden-press-conference/"
  },
  {
    "text": "Over 75% of voters want maximum age limit for elected officials, poll shows  —  Over three-fourths of Americans think there should be a maximum age limit for elected officials, according to a CBS News/YouGov survey. … - The concern proved to be bipartisan, with 76% of Democrats and 79% … ",
    "url": "https://www.axios.com/2023/09/10/politicians-age-limits-joe-biden-mitch-mcconnell"
  },
  {
    "text": "Age and elected office: Concerns about performance outweigh benefits of experience  —  In the eyes of Americans, age brings experience and seniority in elected office, but that's outweighed by concerns that elected officials might be “out of touch” or unable to do the job past the age of 75.",
    "url": "https://www.cbsnews.com/news/age-president-senator-performance-concerns-outweigh-benefits-of-experience/"
  },
  {
    "text": "Trump's post-presidential office is hiding in plain sight  —  For a man who likes his name in lights, his government-funded post-presidential office is as nondescript as they come.  —  WEST PALM BEACH, Fla. — Donald Trump likes to put his name on everything — except his taxpayer-funded … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-post-presidential-office-hiding-plain-sight-rcna104235"
  },
  {
    "text": "I don't write about polls.  You shouldn't bother with them, either.  —  You might have noticed that I studiously have avoided dissecting the avalanche of 2024 polls.  I don't plan on deviating from this approach — at least not until mid-2024.  And you should consider ignoring the nonstop flood … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/10/pollings-unrealistic-coverage/"
  },
  {
    "text": "Harris calls critics ‘scared,’ Tim Scott says he'll introduce girlfriend and more campaign trail tidbits  —  Nikki Haley said a new poll shows voters want “a new generational leader.”  —  Vice President Kamala Harris is responding to attacks from Republicans, casting barbs against her as evidence … ",
    "url": "https://abcnews.go.com/Politics/harris-calls-critics-scared-tim-scott-introduce-girlfriend/story?id=103070885"
  },
  {
    "text": "Donald Trump Challenges Rupert Murdoch to a Mental Acuity Test  —  TROUBLE IN PARADISE  —  Former President Donald Trump threw down the gauntlet in a Sunday evening Truth Social rant, challenging a host of his perceived enemies—including Rupert Murdoch and the “heads” of his Wall Street Journal newspaper … ",
    "url": "https://www.thedailybeast.com/trump-challenges-rupert-murdoch-to-a-mental-acuity-test"
  },
  {
    "text": "Congress Embarks on Spending Battle as Shutdown Looms at End of September  —  The House returns this week with conservatives threatening both spending levels and Speaker Kevin McCarthy.  —  Congress is poised this week to dive into an epic fight over spending, as the Senate … ",
    "url": "https://www.nytimes.com/2023/09/10/us/politics/congress-spending-battle.html"
  },
  {
    "text": "Bush institute exec pushing ‘civility’ pledge leaked Steele dossier to media outlet in 2016  —  David Kramer, who revealed in 2017 he had been behind Steele Dossier media leak, organized unity pledge by 13 presidential libraries  —  The George W. Bush Institute executive who organized … ",
    "url": "https://www.foxnews.com/politics/bush-institute-exec-pushing-civility-pledge-leaked-steele-dossier-buzzfeed-2016?intcmp=tw_fnc"
  },
  {
    "text": "PM Rishi Sunak confronts China's premier after arrest of parliament ‘spy’  —  Rishi Sunak met China's premier Li Qiang at the G20 summit after two men were arrested amid reports a parliamentary researcher spied for China.  Mr Sunak said interference in UK parliamentary democracy was “obviously unacceptable”.",
    "url": "https://news.sky.com/story/pm-conveys-to-china-significant-concerns-about-interference-in-uk-parliamentary-democracy-no-10-12958311"
  },
  {
    "text": "What Ginni Thomas and Leonard Leo wrought: How a justice's wife and a key activist started a movement  —  Thanks to the Supreme Court's Citizens United ruling, a trove of so-called “dark money” was about to be unleashed.  Two activists prepared to seize the moment.",
    "url": "https://www.politico.com/news/2023/09/10/ginni-thomas-leonard-leo-citizens-united-00108082"
  },
  {
    "text": "Maine Open Lighthouse Day  —  Maine Open Lighthouse Day Information...  This popular annual event, which is sponsored by the United States Coast Guard, the Maine Office of Tourism and the American Lighthouse Foundation, attracts between 15,000 to 18,000 visitors each year and offers … ",
    "url": "https://lighthousefoundation.org/maine-open-lighthouse-day/"
  },
  {
    "text": "Citing NYC migrant crisis, Adams calls for steep budget cuts, hiring freeze  —  New York City Mayor Eric Adams tasked agency heads with trimming spending by 15 percent through next spring — but said Albany or Washington could spare the city.  —  NEW YORK — Days after declaring the migrant crisis … ",
    "url": "https://www.politico.com/news/2023/09/09/nyc-eric-adams-migrant-crisis-00114879"
  },
  {
    "text": "Virginia Gov. Glenn Youngkin Pardons Father Who Protested School Board After Daughter's Sexual Assault  —  Scott Smith was convicted of disorderly conduct over the 2021 incident  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/virginia-gov-glenn-youngkin-pardons-father-who-protested-school-board-after-daughters-sexual-assault"
  }
]