[
  {
    "text": "Playbook: A not so happy birthday for Biden  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  If you haven't heard, the Democratic Party is full of anxious people right now.  They're worried about swing-state polls showing JOE BIDEN losing to DONALD TRUMP.",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/19/a-not-so-happy-birthday-for-biden-00127956"
  },
  {
    "text": "Biden turns 81 as questions about age continue to dominate 2024 race  —  Polls show voters continue to be concerned by Biden's age.  —  President Joe Biden smiles as he walks from Marine One upon arrival on the South Lawn of the White House, June 1, 2023, in Washington.",
    "url": "https://abcnews.go.com/Politics/biden-turns-81-questions-age-continue-dominate-2024/story?id=104984287"
  },
  {
    "text": "With a new speaker, the old MTG is back  —  Good morning, Early Birds.  This morning, we're thinking of former president Jimmy Carter, who lost his wife, former first lady Rosalynn Carter, on Sunday.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/11/20/with-new-speaker-old-mtg-is-back/"
  },
  {
    "text": "Many former Trump aides say he shouldn't be president.  Will it matter?  —  Critics are grappling with how they can puncture Trump's candidacy in 2024 and whether their voices will have any impact  —  John F. Kelly, the longest-serving chief of staff in President Donald Trump's White House … ",
    "url": "https://www.washingtonpost.com/nation/2023/11/20/trump-aides-cabinet-critics-election/"
  },
  {
    "text": "Judge Aileen Cannon's Games in Florida May Delay Other Trump Trials  —  The federal judge overseeing Donald Trump's classified documents case is setting up some serious roadblocks in the case, and injecting confusion in his other upcoming trials too.  —  When Donald Trump's beloved federal … ",
    "url": "https://www.thedailybeast.com/judge-aileen-cannons-games-in-florida-may-delay-other-trump-trials"
  },
  {
    "text": "The ‘faith-based’ leader for Philly's Moms for Liberty chapter is a registered sex offender  —  Phillip Fisher Jr. is a pastor and Republican ward leader who coordinates faith-based outreach for Philadelphia's Moms for Liberty chapter.He's also a registered sex offender … ",
    "url": "https://www.inquirer.com/politics/philadelphia/moms-for-liberty-philadelphia-pastor-sex-offender-20231120.html"
  },
  {
    "text": "Wages are rising.  Jobs are plentiful.  Nobody's happy.  —  It's a good time to be a worker and a bad time to be a consumer — the problem is most people are both.  —  Explaining the state of the American economy at the moment is a conundrum.  The labor market is good … ",
    "url": "https://www.vox.com/2023/11/20/23964535/labor-market-employment-inflation-sentiment-economy-bad-polls"
  },
  {
    "text": "How SCOTUS's “ethics code” provides cover for corruption  —  It's weak sauce — which was the goal all along. … After unrelenting pressure from everyone but Republicans, who by and large are thrilled that Supreme Court justices can be bought, the Court has issued a voluntary, non-binding code of conduct.",
    "url": "https://www.publicnotice.co/p/supreme-court-ethics-code-corruption-explained"
  },
  {
    "text": "The Era of Total U.S. Submarine Dominance Over China Is Ending  —  New Chinese submarines and sensors to catch U.S. subs will alter the balance of power  —  For decades, the U.S. hasn't had to worry much about China's submarines.  They were noisy and easy to track.",
    "url": "https://www.wsj.com/world/china/us-submarine-dominance-shift-china-8db10a0d?mod=followamazon"
  },
  {
    "text": "Trump-like libertarian Javier Milei wins Argentina's presidency  —  BUENOS AIRES — A radical libertarian and admirer of Donald Trump rode a wave of voter rage to win Argentina's presidency on Sunday, crushing the political establishment and bringing the sharpest turn to the right in four decades of democracy in the country.",
    "url": "https://www.washingtonpost.com/world/2023/11/19/argentina-presidential-election-results-javier-milei/"
  },
  {
    "text": "Former first lady Rosalynn Carter remembered by Bidens, Obamas, Bush family  —  Tributes are continuing to pour in after former first lady Rosalynn Carter died peacefully Sunday with her family by her side.  CBS News national correspondent Manuel Bojorquez has more.",
    "url": "https://www.cbsnews.com/video/rosalynn-carter-remembered-biden-obama-bush/"
  },
  {
    "text": "This Republican Wants Voters to Have a Say on Abortion  —  Republicans have struggled politically with the issue of abortion since the overturning of Roe v. Wade — a point proven several times over with anti-abortion measures failing in relatively conservative states.",
    "url": "https://www.nytimes.com/2023/11/20/opinion/sandy-senn-south-carolina-abortion-bans.html"
  },
  {
    "text": "Former First Lady Rosalynn Carter Passes Away at Age 96  —  Former First Lady Rosalynn Carter, a passionate champion of mental health, caregiving, and women's rights, passed away Sunday, Nov. 19, at 2:10 p.m. at her home in Plains, Georgia, at the age of 96.  She died peacefully, with family by her side.",
    "url": "https://www.cartercenter.org/news/pr/2023/statement-rosalynn-carter-111923.html"
  },
  {
    "text": "The Super Rich No Longer Try To Support Their Societies  —  Throughout much of the Western world's history, the wealthiest have been viewed in their communities as a potentially unfavorable presence, and they have attempted to allay this sentiment by using their riches to support their societies … ",
    "url": "https://www.nytimes.com/2023/11/19/opinion/rich-billionaires-philanthropy-covid.html"
  },
  {
    "text": "GOP moves to split Arizona Democrats in 3-way Senate race  —  A new NRSC ad boosts independent Kyrsten Sinema while slamming likely Democratic nominee Ruben Gallego.  —  Senate Republicans are rolling out a provocative new strategy as they try to boost the GOP's chances in Arizona next year: propping up incumbent Sen. Kyrsten Sinema.",
    "url": "https://www.politico.com/news/2023/11/20/arizona-democrats-3-way-senate-race-nrsc-00128018"
  },
  {
    "text": "Yaccarino On Hot Seat As Ad Execs Urge Twitter CEO To Resign  —  In the aftermath of IBM, Disney, Apple and others pausing spending on X, formerly known as Twitter, top advertising executives made a personal appeal to CEO Linda Yaccarino.  —  X CEO Linda Yaccarino, the longtime NBC advertising … ",
    "url": "https://www.forbes.com/sites/johnpaczkowski/2023/11/19/linda-yaccarino-x-twitter-elon-musk-antisemitism-urged-to-resign/"
  }
]