[
  {
    "text": "Dr. Phil was embedded with ICE during controversial Los Angeles immigration raids  —  As federal agents prepared to fan out in Los Angeles for a controversial immigration crackdown, the officers were greeted by a familiar face: Dr. Phil McGraw.  —  The television personality and his camera crew … ",
    "url": "https://cnn.com/2025/06/09/media/dr-phil-mcgraw-ice-immigration-raids-los-angeles"
  },
  {
    "text": "CA Democrat claims ICE agents were first to ‘escalate the situation’ amid LA riots  —  Rep. Nanette Barragán (D-CA) claimed that U.S. Immigration and Customs Enforcement was the first to escalate tensions amid the protests in Los Angeles that “started peacefully.”",
    "url": "https://www.washingtonexaminer.com/news/crime/3434884/ca-democrat-ice-agents-first-escalate-la-riots/"
  },
  {
    "text": "Protests intensify in Los Angeles after Trump deploys hundreds of National Guard troops  —  Tensions in Los Angeles have escalated again as thousands of protesters took to the streets in response to President Donald Trump's extraordinary deployment of the National Guard … ",
    "url": "https://www.9news.com.au/world/los-angeles-protests-national-guard-troops-arrive-in-la-on-donald-trumps-orders-to-quell-immigration-protests/0e451581-493c-46fc-b426-ee220f6a29fc"
  },
  {
    "text": "California to sue Trump over National Guard deployment; L.A. braces for more protests  —  Mexican president criticizes violence in L.A., says 42 nationals detained  —  Police departments from across L.A. County converge in downtown L.A.  —  Trump meant for National Guard deployment to act as a deterrent, White House says",
    "url": "https://www.latimes.com/california/live/los-angeles-protests-immigration-raid-updates"
  },
  {
    "text": "We are witnessing the first stages of a Trump police state  —  The national guard's deployment in Los Angeles sets the US on a familiar authoritarian pathway.  History shows the results  —  Now that Donald Trump's tariffs have been halted, his big, beautiful bill has been stymied … ",
    "url": "https://www.theguardian.com/commentisfree/2025/jun/09/trump-police-state-robert-reich"
  },
  {
    "text": "Trump lied about LA protests to deploy the National Guard.  He wants violence.  —  If the ICE raids targeting Los Angeles are necessary, why aren't they also necessary in the red states one would assume Trump is more inclined to protect?  —  Donald Trump, the president who glibly pardoned … ",
    "url": "https://www.usatoday.com/story/opinion/columnist/2025/06/09/la-protests-ice-trump-violence-national-guard/84106671007/"
  },
  {
    "text": "‘Wildly underprepared’: National Guard troops seen sleeping on floors in exclusive photos  —  President Donald Trump's rush to deploy California National Guard troops to Los Angeles has left dozens of soldiers without adequate sleeping arrangements, forced to pack together in one or more federal buildings … ",
    "url": "https://www.sfchronicle.com/california/article/national-guard-california-photos-20368334.php"
  },
  {
    "text": "Attorney General Bonta, Governor Newsom Challenge Trump Order Seeking to Federalize California National Guard  — Attorney General Bonta, Governor Newsom Challenge Trump Orde...  Contact: (916) 210-6000, agpressoffice@doj.ca.gov  —  OAKLAND — California Attorney General Rob Bonta … ",
    "url": "https://oag.ca.gov/news/press-releases/attorney-general-bonta-governor-newsom-challenge-trump-order-seeking-federalize"
  },
  {
    "text": "It's Always Darkest Before It Goes Pitch Black  —  U.S. and Chinese officials will meet today in London to give deescalation from the current trade war the old college try.  This might have been more difficult before, when Trump's saber-rattling was focused primarily on China.",
    "url": "https://www.thebulwark.com/p/its-always-darkest-before-it-goes-pitch-black-los-angeles-national-guard-troops-deportation-protests"
  },
  {
    "text": "Trump's troop deployment is a warning sign for what comes next, legal scholars fear  —  Trump has cited a provision of U.S. law that allows the president to use the National Guard to suppress the “danger of a rebellion.”  —  President Donald Trump's deployment of 2,000 National Guard troops … ",
    "url": "https://www.politico.com/news/2025/06/09/trump-national-guard-deployment-legal-00394387"
  },
  {
    "text": "White House struggles to find qualified people willing to work for Pete Hegseth  —  At least three people have turned down potential roles working for the defense secretary and former Fox News host.  Supporters say his leadership has been effective.  —  WASHINGTON — The White House … ",
    "url": "https://www.nbcnews.com/politics/national-security/white-house-struggles-find-qualified-people-willing-work-pete-hegseth-rcna211602"
  },
  {
    "text": "Pam Bondi's brother loses his D.C. Bar election in a blowout  —  Bradley Bondi lost his bid to be president of the D.C. Bar to Diane Seltzer, who received 34,982 votes compared to Bondi's 3,490.  —  WASHINGTON — Bradley Bondi, the brother of Attorney General Pam Bondi … ",
    "url": "https://www.nbcnews.com/politics/politics-news/pam-bondi-brother-loses-dc-bar-election-blowout-rcna211869"
  },
  {
    "text": "The Medicare tweak Republicans are eyeing for their megabill is actually bipartisan  —  A Medicare proposal some Republicans want to include in their sweeping megabill has the backing of a key Democratic senator — though he doesn't want it included in the party-line package.",
    "url": "https://www.politico.com/live-updates/2025/06/09/congress/medicare-tweak-megabill-no-upcode-act-00394281"
  },
  {
    "text": "Israeli forces prevent aid boat carrying Greta Thunberg and other activists from reaching Gaza  —  Israeli forces stopped a Gaza-bound aid boat carrying Greta Thunberg and other activists early Monday and diverted it to Israel, enforcing a longstanding blockade of the Palestinian territory … ",
    "url": "https://apnews.com/article/mideast-wars-gaza-flotilla-greta-thunberg-b64e897fb37ee374e4494381304ff9be"
  },
  {
    "text": "Hegseth aide upended Pentagon leak inquiry with false wiretap claims  —  Exclusive: ex-Doge staffer Justin Fulcher suggested he had evidence of wiretap that would help investigation  —  Days before Pete Hegseth fired three top aides last month over a Pentagon leak investigation into the disclosure … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/09/hegseth-wiretap-inquiry-justin-fulcher"
  },
  {
    "text": "NIH scientists publish declaration criticizing Trump's deep cuts in public health research  —  In his confirmation hearings to lead the National Institutes of Health, Jay Bhattacharya pledged his openness to views that might conflict with his own.  “Dissent,” he said, “is the very essence of science.”",
    "url": "https://apnews.com/article/nih-letter-bethesda-declaration-bhattacharya-89724aee201f3e99fc1159adcbf9ac94"
  },
  {
    "text": "Musk's Own AI Claims He Took Miller's Wife and Mocked Him for It  —  Elon Musk has been forced to rebuke Grok, his own AI chatbot integrated into X, after it falsely suggested the tech billionaire wrote a post saying he “took” the wife of Stephen Miller.On Sunday, Grok replied to a question … ",
    "url": "https://www.thedailybeast.com/musk-trashes-his-own-ai-over-embarrassing-post-about-him-taking-stephen-millers-wife/"
  },
  {
    "text": "My Journey Deep in the Heart of Trump Country My Journey Deep in the Heart of Trump Country  —  “We're losing our best and brightest,” Roger Ford, the 58-year-old president of an energy startup, told me sadly one day as we ambled through a hillside cemetery brightened by graveside flowers.",
    "url": "https://www.nytimes.com/2025/06/09/opinion/trump-supporters-kentucky.html"
  },
  {
    "text": "Silicon Valley's not crying for Musk  —  Few tears will be shed in Silicon Valley or at Big Tech firms over Elon Musk's precipitous fall from White House grace.  —  Why it matters: Musk's brief alliance with President Trump warped the usual dynamics of the relationship between America's … ",
    "url": "https://www.axios.com/2025/06/09/musk-trump-fallout-big-tech"
  },
  {
    "text": "Why Is Tom Homan Going Full Fidel? … ‘Border Czar’ Tom Homan has been, along with Stephen Miller, has been the public face of Trump border enforcement and anti-immigration politics going back to President Trump's first administration when he was briefly acting director of Immigration and Customs Enforcement (ICE).",
    "url": "https://talkingpointsmemo.com/edblog/why-is-tom-homan-going-full-fidel"
  },
  {
    "text": "Gun Deaths of Children Rose in States That Loosened Gun Laws, Study Finds  —  Researchers looked at firearm fatalities in the 13 years immediately after the Supreme Court limited local governments' ability to restrict gun ownership.  —  Firearm deaths of children and teenagers rose significantly … ",
    "url": "https://www.nytimes.com/2025/06/09/health/gun-deaths-children.html?unlocked_article_code=1.Nk8.leTO.CTyJTl_fTL5i&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "The big, beautiful bill is bad news for student loans  —  If the “big, beautiful bill,” President Donald Trump's signature legislative priority, eventually becomes law, it would gut some social programs that many people rely on.  As my colleague Dylan Scott wrote in a thorough explainer … ",
    "url": "https://www.vox.com/policy/415793/big-beautiful-bill-student-loans-pell-grants"
  },
  {
    "text": "As ivermectin goes over the counter, some pharmacists worry about a lack of guidance  —  The drug, used to treat parasitic worms, has not been formulated or labeled specifically for over-the-counter use, like aspirin or an antacid.  —  Boise, Idaho, pharmacist Matt Murray has no choice … ",
    "url": "https://www.nbcnews.com/health/health-news/ivermectin-over-counter-pharmacy-states-rfk-jr-rcna205616"
  }
]