[
  {
    "text": "Democratic senator forcibly removed from DHS press conference  —  Sen. Alex Padilla (D-Calif.) was physically removed on Thursday from a Los Angeles press conference held by Homeland Security Secretary Kristi Noem.  —  Why it matters: In a video posted to X by a Fox News reporter … ",
    "url": "https://www.axios.com/2025/06/12/alex-padilla-homeland-security-kristi-noem"
  },
  {
    "text": "Sen. Alex Padilla is forcibly removed from DHS Secretary Kristi Noem's news conference  —  The Democrat said he had questions for Trump's Cabinet secretary during her press conference in Los Angeles.  —  Sen. Alex Padilla, D-Calif., was forcibly removed from a news conference in Los Angeles … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-alex-padilla-forcibly-removed-dhs-sec-kristi-noems-press-conferenc-rcna212688"
  },
  {
    "text": "California Sen. Alex Padilla handcuffed at Noem news conference in LA  —  The senator was stopped and shoved back by multiple men.  —  LOS ANGELES — California Sen. Alex Padilla was temporarily detained and handcuffed during an altercation at Homeland Security Secretary Kristi Noem's press conference in Los Angeles on Thursday.",
    "url": "https://www.politico.com/news/2025/06/12/california-sen-alex-padilla-handcuffed-at-noem-presser-00403253"
  },
  {
    "text": "California Sen. Alex Padilla forcefully removed from Noem's press conference by security  —  Democratic California U.S. Sen. Alex Padilla was forcefully removed Thursday by security officers from a press conference being held on immigration by Homeland Security Secretary Kristi Noem.",
    "url": "https://apnews.com/article/alex-padilla-noem-immigration-protest-california-f67d220a0254473c53c16aa96f554239"
  },
  {
    "text": "'It's a winner for him': Dems work to turn LA debate from immigration to Trump's executive powers  —  Democrats are scrambling to shift the fight away from immigration, instead highlighting Trump's use of executive powers.  —  SAN FRANCISCO — Gavin Newsom has rallied Democrats in his war with Donald Trump … ",
    "url": "https://www.politico.com/news/2025/06/12/democrats-la-immigration-executive-power-00402172"
  },
  {
    "text": "Here's where anti-Trump protests are expected on Thursday  —  Senator Alex Padilla, a Democrat, was handcuffed after he interrupted a news conference by the homeland security secretary.  A judge will hear California's request to limit the role of the military in immigration raids.  —  Los Angeles",
    "url": "https://www.nytimes.com/live/2025/06/12/us/la-protests-trump-marines-ice?unlocked_article_code=1.OU8.waJi._RELGImExhIX"
  },
  {
    "text": "Democrats' fears of Trump administration violence erupt after Padilla incident  —  Democratic lawmakers' fears of violence and arrest at the hands of the Trump administration spiked Thursday after Sen. Alex Padilla (D-Calif.) was aggressively detained by Department of Homeland Security Personnel.",
    "url": "https://www.axios.com/2025/06/12/alex-padilla-dhs-democrats-kristi-noem-congress"
  },
  {
    "text": "Trump is ‘not all there,’ Newsom says amid Los Angeles fight  —  The California Democrat is dinging the president on his mental acuity.  —  California Gov. Gavin Newsom is hitting Donald Trump with an attack the president and his base know all too well: the president's mental acuity.",
    "url": "https://www.politico.com/news/2025/06/12/newsom-trump-mental-fitness-00402459"
  },
  {
    "text": "Trump Voter Gets Choked Up After ICE Detains a Third of His Staff  —  BUYER'S REMORSE  —  A Florida roofing boss backed the president's tough immigration policies.  Then six of his workers were taken away...  Vincent Scardina supported Donald Trump's tough stance on immigration at the ballot box.",
    "url": "https://www.thedailybeast.com/trump-voter-gets-choked-up-after-ice-detains-a-third-of-his-staff/"
  },
  {
    "text": "Troops and marines deeply troubled by LA deployment: ‘Morale is not great’  —  Several service members told advocacy groups they felt like pawns in a political game and assignment was unnecessary  —  California national guards troops and marines deployed to Los Angeles to help restore order … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/12/los-angeles-national-guard-troops-marines-morale"
  },
  {
    "text": "Hegseth won't commit to obeying courts on Marines in Los Angeles  —  The Defense secretary declined to say whether the Pentagon would comply with any judicial order blocking Trump's domestic troop deployment.  —  Defense Secretary Pete Hegseth refused to say whether he would follow the courts … ",
    "url": "https://www.politico.com/news/2025/06/12/hegseth-marines-los-angeles-00402794"
  },
  {
    "text": "“Delay, Interfere, Undermine”  —  Leer en español.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  In mid-April, President Donald Trump sat down in the Oval Office with President Nayib Bukele … ",
    "url": "https://www.propublica.org/article/bukele-trump-el-salvador-ms13-gang-vulcan-corruption-investigation"
  },
  {
    "text": "Israel Appears Ready to Attack Iran, Officials in U.S. and Europe Say  —  Concern about a strike and the prospect of retaliation led the United States to withdraw diplomats from Iraq and authorize the voluntary departure of U.S. military family members from the Middle East.",
    "url": "https://www.nytimes.com/2025/06/11/us/politics/iran-us-iraq-diplomats-middle-east.html?unlocked_article_code=1.OE8.3TSo.jx18Vnc-5S60&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "House Republicans vote to claw back $9.4 billion in funding for foreign aid, NPR and PBS  —  Trump's White House wants Congress to codify some of the cuts proposed by the Department of Government Efficiency, which was helmed by billionaire Elon Musk.  —  The Republican-led House voted 214-212 … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-vote-claw-back-94-billion-funding-foreign-aid-npr-pb-rcna211740"
  },
  {
    "text": "Exclusive: Trump administration will tell migrants from Cuba, Haiti, Nicaragua and Venezuela their legal status is terminated  —  The Department of Homeland Security on Thursday will tell hundreds of thousands of migrants that their permission to live and work in the United States had been revoked … ",
    "url": "https://cnn.com/2025/06/12/politics/migrants-cuba-venezuela-haiti-nicaragua"
  },
  {
    "text": "Most say the upcoming military parade is not a good use of government funds  —  Forty percent approve of the military parade honoring the 250th anniversary of the U.S. Army, and 60% say it is not a good use of government funds.  Similar shares, about 3 in 10, feel the U.S. government spends … ",
    "url": "https://apnorc.org/projects/most-say-the-upcoming-military-parade-is-not-a-good-use-of-government-funds/"
  },
  {
    "text": "Combined Distributional Effects of the One Big Beautiful Bill Act and of Tariffs  —  The combination of 2025 tariff increases implemented as of June 1 and the One Big Beautiful Bill Act passed by the House of Representatives would reduce after-tax-and-transfer incomes on average among the bottom 80 percent of U.S. households.",
    "url": "https://budgetlab.yale.edu/research/combined-distributional-effects-one-big-beautiful-bill-act-and-tariffs"
  },
  {
    "text": "Russian scientist at Harvard released on bail while awaiting US smuggling trial  —  A Russian-born scientist at Harvard University who was detained by U.S. immigration authorities in February after returning from a trip to France was granted bail on Thursday and released from custody … ",
    "url": "https://www.reuters.com/world/russian-scientist-harvard-released-bail-while-awaiting-us-smuggling-trial-2025-06-12/"
  },
  {
    "text": "Texas governor says over 5,000 Texas National Guard members deployed ahead of No Kings protests  —  Texas Gov. Greg Abbott said Thursday he has ordered the deployment of more than 5,000 Texas National Guard troops across the state, along with more than 2,000 state police … ",
    "url": "https://apnews.com/article/immigration-protests-texas-national-guard-4f8ffc07788515c0d0e7ae40c7980565"
  },
  {
    "text": "Trump on ‘No Kings’ protests during military parade: 'I don't feel like a king'  —  President Trump was asked Thursday to respond to planned counterprotests that will coincide with a military parade in the nation's capital to mark the U.S. Army's 250th birthday.",
    "url": "https://thehill.com/homenews/administration/5346940-trump-no-kings-protest/"
  },
  {
    "text": "This Is Not a Drill  —  American democracy is on the line right now  —  There are two disastrously wrong ways to read the news from Los Angeles right now, and the rest of America over the next few days.  The first is to believe that there is actually anything resembling an insurrection underway.",
    "url": "https://paulkrugman.substack.com/p/this-is-not-a-drill"
  },
  {
    "text": "Trump's civil war  —  And our new birth of freedom  —  Earlier this week Donald Trump called for a second civil war at a US military base.  This scenario can be resisted and prevented, if we have the courage to listen, interpret, and act.  And this Saturday we will have the occasion to act.",
    "url": "https://snyder.substack.com/p/trumps-civil-war"
  },
  {
    "text": "Ex-congressman Billy Long confirmed as commissioner of the IRS, an agency he once sought to abolish  —  Former U.S. Rep. Billy Long of Missouri was confirmed on Thursday to lead the Internal Revenue Service, giving the beleaguered agency he once sought to abolish a permanent commissioner … ",
    "url": "https://apnews.com/article/billy-long-confirmed-irs-commissioner-67cd8daaa53a53c4ebf1262de1ede5e6"
  },
  {
    "text": "Republican South Carolina House member charged with distributing child sexual abuse material  —  A Republican South Carolina House member who prosecutors say used the screen name “joebidennnn69” has been arrested and charged with 10 counts of distributing sexual abuse material involving children.",
    "url": "https://apnews.com/article/sex-crimes-south-carolina-lawmaker-rj-may-81901be6f700f24a99ba3346086f8b61"
  },
  {
    "text": "BREAKING: FBI Arrests Riot Supplier, Charges Conspiracy  —  The first rule in unraveling conspiracies: Follow the money.  Earlier this week, FBI Director Kash Patel declared that the riots in Los Angele are not organic spillovers from extemporaneous protests against ICE … ",
    "url": "https://hotair.com/ed-morrissey/2025/06/12/breaking-fbi-arrests-riot-supplier-charges-conspiracy-n3803719"
  },
  {
    "text": "Police officers file civil lawsuit seeking court order to hang Jan. 6 plaque at U.S. Capitol  —  Two police officers who defended the Capitol during the Jan. 6, 2021 attack filed a federal civil lawsuit, asking a judge to order the hanging of a plaque to honor police heroes who protected the Capitol, lawmakers and staff from rioters.",
    "url": "https://www.cbsnews.com/news/police-officers-lawsuit-installing-jan-6-plaque-at-u-s-capitol/"
  },
  {
    "text": "DHS Said to Brief Cleta Mitchell's Group on Citizenship Checks for Voting  —  A senior official in the Department of Homeland Security (DHS) held a briefing for a far-right anti-voting group on Thursday, according to an email sent by the group.  The virtual meeting was to discuss how a database run … ",
    "url": "https://www.democracydocket.com/news-alerts/dhs-said-to-brief-cleta-mitchells-anti-voting-group-on-checking-citizenship-for-voters/"
  }
]