[
  {
    "text": "The Atlantic Dedicates Entire Issue to Warning ‘Fascist’ Trump Poses Dire Threat to America: Second Term ‘Will Be Much Worse’  —  The Atlantic announced that their first issue of 2024 will focus on what they believe to be the potentially disastrous consequences of Donald Trump returning to the White House.",
    "url": "https://www.mediaite.com/print/the-atlantic-dedicates-entire-issue-to-warning-fascist-trump-poses-dire-threat-to-america-second-term-will-be-much-worse/"
  },
  {
    "text": "No, Trump Did Not Say 'We've Been Waging an All-Out War on American Democracy'  —  Trump supposedly spoke of a war against American democracy during a Dec. 2, 2023, campaign stop in Cedar Rapids, Iowa. … Not long after former U.S. President and current Republican presidential candidate … ",
    "url": "https://www.snopes.com/fact-check/trump-waging-all-out-war-american-democracy/"
  },
  {
    "text": "Comer Releases Direct Monthly Payments to Joe Biden from Hunter Biden's Business Entity  —  WASHINGTON—Today, House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) released subpoenaed bank records revealing Hunter Biden's business entity, Owasco PC, made direct monthly payments to Joe Biden.",
    "url": "https://oversight.house.gov/release/comer-releases-direct-monthly-payments-to-joe-biden-from-hunter-bidens-business-entity%EF%BF%BC/"
  },
  {
    "text": "Comer mischaracterizes Hunter Biden car payment reimbursement to his dad  —  The payments Hunter Biden made to his father came two years after the elder Biden had left the vice presidency  —  As House Republicans move toward a floor vote to authorize an impeachment inquiry against President Biden … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/04/comer-mischaracterizes-hunter-biden-car-payment-reimbursement-his-dad/"
  },
  {
    "text": "Gold bars featured in Bob Menendez bribery case linked to 2013 robbery, records show  —  The New Jersey businessman told police he was the victim of an armed robbery in 2013, and asked police recover the 22 gold bars stolen from him.  Four of those gold bars were found a decade later … ",
    "url": "https://www.nbcnewyork.com/investigations/gold-bars-featured-in-bob-menendez-bribe-case-linked-to-2013-robbery-records-show/4919801/"
  },
  {
    "text": "Four GOP presidential candidates qualify for fourth primary debate  —  Four Republican candidates will take the stage in Tuscaloosa on Wednesday night, and former president Donald Trump will once again skip the event.  —  Four Republican candidates will take the stage in Tuscaloosa … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/04/fourth-republican-presidential-debate-participants/"
  },
  {
    "text": "Republicans Weigh New Debate Rules That Could Lead to More Onstage Clashes  —  The party is considering whether to open the door to debates not sponsored by the Republican National Committee, which could lead to more onstage clashes but also diminish their fanfare.",
    "url": "https://www.nytimes.com/2023/12/04/us/politics/republican-debates-trump.html"
  },
  {
    "text": "23andMe confirms hackers stole ancestry data on 6.9 million users  —  On Friday, genetic testing company 23andMe announced that hackers accessed the personal data of 0.1% of customers, or about 14,000 individuals.  The company also said that by accessing those accounts, hackers were also able to access … ",
    "url": "https://techcrunch.com/2023/12/04/23andme-confirms-hackers-stole-ancestry-data-on-6-9-million-users/"
  },
  {
    "text": "Steve Bannon Blasts Fox News as ‘TV for Stupid People’  —  “It's a disgrace,” Bannon raged over the right-wing network fact-checking Trump's election lies.  —  Former Trump strategist Steve Bannon tore into Fox News for cutting away from a Donald Trump speech over the weekend and fact-checking … ",
    "url": "https://www.thedailybeast.com/steve-bannon-blasts-fox-news-as-tv-for-stupid-people"
  },
  {
    "text": "John Fetterman paid George Santos $343 for a Cameo to troll Bob Mendendez  — George Santos was expelled from Congress last week.  — Now he's on Cameo.  — John Fetterman bought a video from Santos to troll Bob Menendez, who is under investigation for bribery.",
    "url": "https://www.businessinsider.com/john-fetterman-paid-george-santos-for-cameo-bob-mendendez-2023-12"
  },
  {
    "text": "Opponents of No Labels and other third-party presidential bids launch ads  —  One ad casts Robert F. Kennedy Jr., Cornel West and Jill Stein as campaigns that are likely to help Donald Trump win a second term in the White House.  —  A bipartisan group founded to oppose the presidential effort … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/04/2024-third-party-candidates-trump-reelection/"
  },
  {
    "text": "'That's authoritarianism': Florida argues school libraries are for government messaging  —  Public school libraries are “a forum for government speech,” not a “forum for free expression,” according to a legal brief.  —  Florida's government is arguing that school districts have a First Amendment right to remove LGBTQ books.",
    "url": "https://www.tallahassee.com/story/news/politics/2023/12/04/florida-says-school-libraries-have-right-to-remove-lgbtq-books/71742277007/"
  },
  {
    "text": "Top Tucker Carlson producer accused of sexually assaulting Fox staffer  —  A former Fox News staffer is suing the producer — who was fired last spring along with the host — over the alleged assault and the network over alleged sexual harassment and negligence",
    "url": "https://www.washingtonpost.com/style/media/2023/12/04/fox-news-sexual-harassment-tucker-carlson-producer-justin-wells/"
  },
  {
    "text": "Elon Musk's X platform fueled far-right riots in Ireland, experts say  —  Elon Musk's social media platform X has fuelled far-right disinformation in Ireland and played a key role in riots last month in the country's capital Dublin, experts tell CBS News.  The violent clashes erupted … ",
    "url": "https://www.cbsnews.com/news/elon-musk-ireland-x-twitter-far-right-dublin-immigration/"
  },
  {
    "text": "U.S. Treasury Launches Counter-Fentanyl Strike Force  —  WASHINGTON — Today, the U.S. Department of the Treasury announced the launch of a Counter-Fentanyl Strike Force to marshal Treasury's resources and expertise in a coordinated and streamlined operation to combat the trafficking of illicit fentanyl.",
    "url": "https://home.treasury.gov/news/press-releases/jy1946"
  },
  {
    "text": "Full Survey: Views on GOP candidates, foreign conflicts and more  —  NewsNation will host the f ourth Republican primary debate on Dec. 6 at 8 p.m. E.T. The debate will be aired and streamed live on all NewsNation platforms.  Not sure how to find us on your TV?  Use our ChannelFinder app.",
    "url": "https://www.newsnationnow.com/polls/full-survey-views-on-gop-candidates-foreign-conflicts-and-more/"
  },
  {
    "text": "House GOP throws a party for former Speaker McCarthy  —  “Is this a going-away party?” one House Republican asked upon receiving the invitation, hinting at the rampant speculation about his future.",
    "url": "https://www.politico.com/live-updates/2023/12/04/congress/the-mccarthy-party-00129954"
  },
  {
    "text": "Trading on Terror?  —  Abstract  —  Recent scholarship shows that informed traders increasingly disguise trades in economically linked securities such as exchange-traded funds (ETFs).  Linking that work to longstanding literature on financial markets' reactions to military conflict … ",
    "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4652027"
  }
]