[
  {
    "text": "Jack Smith's Big New Jan. 6 Brief Is a Major Indictment of the Supreme Court  —  It's rare to simultaneously feel red-hot anger and wistfulness, especially when merely reading a document.  But those are exactly the emotions that washed over me when I read the redacted version … ",
    "url": "https://slate.com/news-and-politics/2024/10/trump-election-interference-trial-jack-smith-brief-supreme-court-failure.html"
  },
  {
    "text": "John Roberts' Sordid Legacy: 14 Pages of Mean Tweets  —  “One of the ways Trump” disseminated false claims of election fraud, Jack Smith's immunity briefing describes, “was by Tweet, day in and day out.”  —  I'm still wading through Jack Smith's immunity briefing.",
    "url": "https://www.emptywheel.net/2024/10/03/john-roberts-sordid-legacy-14-pages-of-mean-tweets/"
  },
  {
    "text": "October 2, 2024  —  When moderator Margaret Brennan noted during last night's vice presidential debate that Republican nominee J.D. Vance had, once again, lied about the legal status of migrants in Springfield, Ohio, Vance retorted: “The rules were that you guys weren't going to fact-check!”",
    "url": "https://heathercoxrichardson.substack.com/p/october-2-2024"
  },
  {
    "text": "Trump casts ‘election interference’ label on everything while facing federal charges  —  Trump is already laying the groundwork to dispute the results of another election, leveling baseless charges of interference as his own federal election interference case progresses.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-casts-election-interference-label-everything-facing-federal-char-rcna173754"
  },
  {
    "text": "11 damning details in Jack Smith's new brief in the Trump election case  —  From Trump's fictitious stats about voter fraud to the FBI's forensic analysis of Trump's phone, prosecutors previewed how they would make their case at trial.  —  Special counsel Jack Smith won't get a chance … ",
    "url": "https://www.politico.com/news/2024/10/02/jack-smith-trump-election-brief-details-00182287"
  },
  {
    "text": "Trump fear factor hits Senate GOP … - “I said, 'Sir, if I was you, I would stay out of the race, because there's no win for you in this,'” Sen. Markwayne Mullin (R-Okla.) told us about a recent call with Trump.  — “I hope not,” said Sen. Thom Tillis, when asked if he thinks Trump will weigh in.",
    "url": "https://www.axios.com/2024/10/03/trump-senate-republicans-mcconnell-thune-cornyn"
  },
  {
    "text": "Jack Smith Lays Out New Evidence in Trump's Jan. 6 Case  —  Judge Tanya Chutkan made public portions of a filing by prosecutors setting out their argument for why the case should go forward despite the Supreme Court's ruling on presidential immunity.  —  When told by an aide … ",
    "url": "https://www.nytimes.com/2024/10/02/us/politics/trump-jan-6-case-jack-smith-evidence.html?unlocked_article_code=1.PE4.CPV7.DVbtr_zR8EME&smid=url-share"
  },
  {
    "text": "Trump Fumes Over Release of New Evidence in Election Interference Case  —  The Justice Department has provided new details regarding Trump's actions on Jan. 6 through an evidentiary brief unsealed on Wednesday  —  DURING HIS VICE presidential debate against Minnesota Governor Tim Walz … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-doj-evidence-brief-election-interference-case-1235123732/"
  },
  {
    "text": "Trump Is Absolutely Fuming Over the Release of Bombshell Election Case Doc  —  OUTRAGED  —  The former president took to Truth Social to vent his anger over the release of documents filed by special counsel Jack Smith, then went straight to the press.  —  Donald Trump is clearly not happy … ",
    "url": "https://www.thedailybeast.com/trump-is-absolutely-fuming-over-the-release-of-bombshell-election-case-doc"
  },
  {
    "text": "Liz Cheney to join Harris on campaign trail at birthplace of GOP  —  Former Rep. Liz Cheney (R-Wyo.) will join Vice President Harris at a campaign event on Thursday in Ripon, Wisc., known as the birthplace of the Republican Party, according to a senior campaign official.",
    "url": "https://thehill.com/homenews/campaign/4912623-liz-cheney-kamala-harris-wisconsin/"
  },
  {
    "text": "Behind the Curtain: Vance's “Minnesota nice” ploy … Walz was girded for war against Vance, who has spent the past 10 weeks defending past controversial remarks.  — Instead, Vance greeted Walz with a big smile, and the two shook hands warmly right off the bat.",
    "url": "https://www.axios.com/2024/10/03/jd-vance-vp-debate-nice"
  },
  {
    "text": "Melania Trump passionately defends abortion rights in upcoming memoir  —  Exclusive: ‘I have carried this belief with me throughout my entire adult life’, former first lady writes in memoir  —  Melania Trump made an extraordinary declaration in an eagerly awaited memoir to be published … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/02/melania-trump-memoir-defends-abortion-rights"
  },
  {
    "text": "Harris holds a 66-electoral-vote lead over Trump, calculates prominent data scientist  —  Kamala Harris turned the tables on Trump, according to betting markets, and hasn't looked back.  —  Data scientist Thomas Miller has crafted a model for forecasting the 2024 presidential election that … ",
    "url": "https://fortune.com/2024/10/03/kamala-harris-trump-latest-polls-swing-states/"
  },
  {
    "text": "UK will give sovereignty of Chagos Islands to Mauritius  —  The UK has announced it is giving up sovereignty of a remote but strategically important cluster of islands in the Indian Ocean after more than half a century.  —  The deal - reached after years of negotiations … ",
    "url": "https://www.bbc.com/news/articles/c98ynejg4l5o"
  },
  {
    "text": "Giuliani's daughter: ‘The biggest threat to our country is Trump’  —  Former New York City Mayor Rudy Giuliani's (R) daughter said she thinks the biggest threat to America is former President Trump.  —  Caroline Giuliani has spoken out in recent days about her father's entanglements with Trump and the upcoming election.",
    "url": "https://thehill.com/blogs/in-the-know/4913595-giuliani-daughter-trump-threat/"
  },
  {
    "text": "Mayorkas warns FEMA doesn't have enough funding to last through hurricane season … The Federal Emergency Management Agency can meet immediate needs but does not have enough funding to make it through the hurricane season, Homeland Security Secretary Alejandro Mayorkas told reporters Wednesday.",
    "url": "https://apnews.com/article/hurricane-helene-congress-fema-funding-5be4f18e00ce2b509d6830410cf2c1cb"
  },
  {
    "text": "How the North Carolina Legislature Left Homes Vulnerable to Helene  —  Under pressure to control housing costs, Republican lawmakers rejected standards meant to protect against disasters, experts say.  —  The amount of rain that Tropical Storm Helene unleashed over North Carolina was so intense … ",
    "url": "https://www.nytimes.com/2024/10/03/climate/north-carolina-homes-helene-building-codes.html"
  },
  {
    "text": "Why conservatives get suspended more than liberals on social media  —  Happy Thursday!  I'm filling in for Cristiano today.  Send news tips to: will.oremus@washpost.com.  —  Below: Vice President Harris is ‘coming around’ to 'Little Tech's' agenda.  But first:",
    "url": "https://www.washingtonpost.com/politics/2024/10/03/nature-study-social-media-liberal-bias-censorship/"
  },
  {
    "text": "How We Report on Maternal Health — and How to Get in Touch With Our Team  —  More than a dozen ProPublica journalists are working across the country to cover reproductive health in the wake of abortion bans.  We hope to hear from medical providers, families and policymakers.",
    "url": "https://www.propublica.org/article/help-propublica-report-on-maternal-health-abortion-bans"
  },
  {
    "text": "Biden administration can move forward with student loan forgiveness, federal judge rules … A federal judge will let expire a temporary restraining order against the Biden administration's sweeping new student loan forgiveness plan, which could deliver relief to tens of millions of Americans.",
    "url": "https://www.cnbc.com/2024/10/03/student-loan-forgiveness-plan-goes-ahead-biden.html"
  }
]