[
  {
    "text": "Joe Biden Calls Kamala Harris ‘Vice President Trump’ at Crucial Press Conference  —  OH JOE  —  The president's make-or-break press conference started with a mix-up after he called Ukrainian President Zelensky “Putin.”  —  Deputy Washington Bureau Chief  —  Joe Biden started … ",
    "url": "https://www.thedailybeast.com/joe-biden-calls-kamala-harris-vice-president-trump-in-disastrous-start-to-press-conference"
  },
  {
    "text": "Angry and stunned Democrats blame Biden's closest advisers for shielding public from full extent of president's decline  —  At a star-studded fundraiser for President Joe Biden in Los Angeles last month, George Clooney wasn't the only one who came away concerned about the president.",
    "url": "https://www.cnn.com/2024/07/11/politics/joe-biden-age-decline-democrats-angry/"
  },
  {
    "text": "‘No one involved in the effort thinks he has a path’: Biden insiders say the writing is on the wall  —  The set of Democrats who think he should reconsider his decision to stay in the race has grown to include aides, operatives and officials tasked with guiding his campaign to victory.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-reelection-insiders-no-path-debate-rcna161296"
  },
  {
    "text": "Biden does some damage control with House Dems — but not enough  —  President Joe Biden delivered a steady performance at a high-stakes press conference Thursday but still fell short of assuring jittery Democrats concerned about his future, prolonging painful questions across the party.",
    "url": "https://www.politico.com/live-updates/2024/07/11/congress/how-dem-lawmakers-viewed-bidens-performance-00167743"
  },
  {
    "text": "Playbook: Biden's presser leaves Dems in ‘purgatory’  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  GOOD MORNING, MR. PRESIDENT — “The race for the presidency remains statistically tied despite [President JOE] BIDEN's dismal debate performance two weeks ago … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/12/bidens-presser-leaves-dems-in-purgatory-00167772"
  },
  {
    "text": "Potentially dozens of Democrats expected to call on Biden to step aside after NATO conference  —  Four Democratic sources with knowledge tell CBS News that they expect dozens of Democratic lawmakers over the next 48 hours to issue statements calling for President Biden to step out of the race.",
    "url": "https://www.cbsnews.com/news/potentially-dozens-of-democrats-expected-to-call-on-biden-to-step-aside-after-nato-conference/"
  },
  {
    "text": "Obama, Pelosi privately expressed concerns over Biden  —  Barack Obama and Nancy Pelosi have spoken privately about Joe Biden and the future of his 2024 campaign.  Both the former president and ex-speaker expressed concerns about how much harder they think it's become for the president to beat Donald Trump.",
    "url": "https://www.cnn.com/2024/07/11/politics/obama-pelosi-biden-democrats-2024/"
  },
  {
    "text": "Behind the Curtain: Committee to Unelect the President … - Former Obama aides: The strained relationship between Obama and Biden extends to their former aides, including David Axelrod (Obama's ruthlessly pragmatic chief strategist) and the influential “Pod Save America” guys.",
    "url": "https://www.axios.com/2024/07/12/biden-news-old-democrats-president"
  },
  {
    "text": "White House guests recount concerns after seeing Biden weeks before debate: ‘What we witnessed was troubling’  —  Some guests at a White House concert in June say they had concerns about Biden.  —  President Joe Biden, center, during a Juneteenth concert on the South Lawn of the White House, June 10, 2024.",
    "url": "https://abcnews.go.com/US/white-house-guests-recount-concerns-after-biden-weeks/story?id=111849442"
  },
  {
    "text": "After Biden's debate performance, the presidential race is unchanged  —  The race for the presidency remains statistically tied despite President Biden's dismal debate performance two weeks ago, a new national NPR/PBS NewsHour/Marist poll finds.  —  Biden actually gained a point since last month's survey … ",
    "url": "https://www.npr.org/2024/07/12/nx-s1-5036518/biden-trump-poll"
  },
  {
    "text": "Is Kamala Harris a Stronger Candidate Than Biden?  —  Possibility that the president will end his campaign highlights his vice president's political pros and cons  —  GREENSBORO, N.C.—In the background of President Biden's decision on whether to continue his campaign against Donald Trump … ",
    "url": "https://www.wsj.com/politics/elections/is-kamala-harris-a-stronger-candidate-than-biden-831b7dbb"
  },
  {
    "text": "GOP Push To Fine Merrick Garland $10,000 A Day Over Biden Audio Fails  —  Rep. Anna Paulina Luna (R-Fla.), who pushed for the penalty, said she would try again when Congress returns.  —  LOADING  —  Some Republicans' effort to punish Attorney General Merrick Garland for withholding audio … ",
    "url": "https://www.huffpost.com/entry/gop-attempt-to-fine-garland-flops-in-house_n_669039ebe4b0c4c9f3a754d7"
  },
  {
    "text": "Civic Media  —  Statement regarding edits to the July 4th interview with President Biden  —  The Earl Ingram Show was one of two radio programs contacted by the Biden campaign following the June 27th debate to speak with President Biden.  The interview was recorded on July 3rd and aired … ",
    "url": "https://civicmedia.us/2024/07/11/statement-regarding-edits-to-the-july-4th-interview-with-president-biden"
  },
  {
    "text": "Milwaukee radio station says it agreed to edit interview with Joe Biden  —  Jessie Opoien Molly BeckMilwaukee Journal Sentinel  —  MADISON — Civic Media, a Wisconsin-based progressive talk-radio network, said Thursday it had agreed to make two edits to an interview with President Joe Biden … ",
    "url": "https://www.jsonline.com/story/news/politics/elections/2024/07/11/milwaukee-radio-station-says-it-agreed-to-edit-interview-with-biden/74369012007/"
  },
  {
    "text": "Project 2025's plan to upend Medicare should set off alarm bells  —  Project 2025 is a comprehensive transition plan organized by right-wing think tank The Heritage Foundation to guide the next GOP presidential administration.  Its lengthy guidebook, Mandate For Leadership … ",
    "url": "https://www.mediamatters.org/project-2025/project-2025s-plan-upend-medicare-should-set-alarm-bells"
  },
  {
    "text": "Trump widely unpopular among Black and Latino voters, poll analysis shows … - About four in 10 Hispanic voters see Trump positively, per the June polls. … - Similarly, about seven in 10 Black voters view Trump unfavorably, which is down about 20 percentage points from 2021.",
    "url": "https://www.axios.com/2024/07/11/trump-black-latino-voters-poll"
  },
  {
    "text": "IRS Collects $1 Billion In Back Taxes From Millionaires  —  In a press release, the IRS announced the collection of $1 billion in past-due taxes from millionaires since 2023.  That year, the agency launched an initiative to pursue high-income, high-wealth individuals who have failed to pay their recognized tax debt.",
    "url": "https://www.forbes.com/sites/andrewleahey/2024/07/11/irs-collects-1-billion-in-back-taxes-from-millionaires/"
  },
  {
    "text": "Donald Trump is dangerous.  The media is finally talking about it  —  On Thursday, The New York Times published an editorial accurately noting that Donald Trump is “dangerous” and “unqualified” to be president.  —  “[Trump] has demonstrated an utter lack of respect for the Constitution … ",
    "url": "https://www.dailykos.com/story/2024/7/11/2253300/-Donald-Trump-is-dangerous-The-media-is-finally-talking-about-it"
  }
]