[
  {
    "text": "‘Start the Steal’: Trump Once Again Planning to Overturn an Election  —  THERE IS A PLAN AFOOT to overturn the results of the November election, and for both parties it is fast becoming a major concern.  The scheme is being hatched by Republicans on behalf of Donald Trump, who seeks to steal the election if Joe Biden defeats him again.",
    "url": "https://plus.thebulwark.com/p/start-the-steal-trump-november-2024"
  },
  {
    "text": "Ex-Trump Election Lawyer John Eastman Has Lost His Law License  —  John Eastman, the former Donald Trump election lawyer behind the so-called “fake electors” scheme, officially lost his ability to practice law in the state of California on Tuesday.  —  The California State Bar recommended … ",
    "url": "https://www.mediaite.com/politics/just-in-ex-trump-election-lawyer-john-eastman-has-been-disbarred/"
  },
  {
    "text": "Why the strike killing World Central Kitchen workers is different  —  With help from Alex Ward, Paul McLeary, Lara Seligman and Phelim Kine  —  The Israeli airstrike that killed aid workers in Gaza is resonating especially in Washington national security circles for two reasons … ",
    "url": "https://www.politico.com/newsletters/national-security-daily/2024/04/02/why-the-strike-killing-world-central-kitchen-workers-is-different-00150205"
  },
  {
    "text": "Family of woman found dead on highway angered by Trump's speech  —  GRAND RAPIDS, Mich. (WOOD) — The sister of murder victim Ruby Garcia said she and her family were home watching live, in disbelief, as former President Donald Trump told an audience in Grand Rapids that he had spoken with “some of her family.”",
    "url": "https://www.woodtv.com/news/target-8/family-of-woman-found-dead-on-highway-angered-by-trumps-speech/"
  },
  {
    "text": "Trump said he spoke to murder victim's family.  The victim's sister said it never happened.  —  GRAND RAPIDS, Mich. — Donald Trump used his campaign event in Michigan on Tuesday to denounce what he called “Biden's border bloodbath,” zeroing in on the case of a young woman killed … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/02/trump-ruby-garcia-michigan-murder/"
  },
  {
    "text": "Amazon Ditches ‘Just Walk Out’ Checkouts at Its Grocery Stores  —  Amazon Fresh is moving away from a feature of its grocery stores where customers could skip checkout altogether.  —  Amazon is phasing out its checkout-less grocery stores with “Just Walk Out” technology, first reported by The Information Tuesday.",
    "url": "https://gizmodo.com/amazon-reportedly-ditches-just-walk-out-grocery-stores-1851381116"
  },
  {
    "text": "House Republicans want to rename Virginia's Dulles Airport after Donald Trump  —  The bill seeks to rename the airport to “Donald J. Trump International Airport.”  —  Washington Dulles International Airport in Dulles, Va., on March 15, 2023.  —  House Republicans have introduced a bill … ",
    "url": "https://abcnews.go.com/Politics/house-republicans-rename-virginias-dulles-airport-after-donald/story?id=108759614"
  },
  {
    "text": "Sources: UT lays off at least 60 employees previously in DEI-related position, closes DCCE  —  A week after state Sen. Brandon Creighton warned Texas university system administrators about the state's expectations for higher education institutions to comply with Senate Bill 17 … ",
    "url": "https://www.statesman.com/story/news/politics/state/2024/04/02/texas-senate-bill-17-anti-dei-ut-fires-four-staff-related-positions-two-sources-confirm/73179902007/"
  },
  {
    "text": "UT-Austin announces round of firings in latest step to comply with Texas' DEI ban  —  The firings come after state leaders criticized universities for not doing enough to enforce the ban.  Students say UT-Austin has already overcorrected.  —  The University of Texas at Austin … ",
    "url": "https://www.texastribune.org/2024/04/02/university-texas-austin-firings-dei-ban/"
  },
  {
    "text": "Taylor Swift among 141 new billionaires in ‘amazing year for rich people’  —  Combined assets of $14.2tn are more than the GDP of every country except China and the US  —  There are more billionaires than ever before.  The world has 2,781 people with fortunes exceeding $1bn (£800m) … ",
    "url": "https://www.theguardian.com/business/2024/apr/02/world-gains-141-new-billionaires-in-amazing-year-for-rich-people"
  },
  {
    "text": "Biden's aggressive campaign strategy involves swing-state stops and jabs at Trump  —  The president is recently outpacing his rival in battleground visits and cash.  —  President Joe Biden participates in a discussion moderated by Stephen Colbert during a campaign fundraising event at Radio City Music Hall in New York, March 28, 2024.",
    "url": "https://abcnews.go.com/Politics/bidens-aggressive-campaign-strategy-involves-swing-state-stops/story?id=108605788"
  },
  {
    "text": "REI Fired A Popular Manager For Not Immediately Reporting Union Chatter  —  The incident shows how aggressively the liberal-branded retailer is responding to union organizing — and how low-level managers are caught in the middle.  —  When William Littig showed up for work at his REI store on Feb. 21 … ",
    "url": "https://www.huffpost.com/entry/rei-fired-manager-union-campaign_n_660b0c31e4b007c08f9e7a99"
  },
  {
    "text": "The Supreme Court May Give Us Another 2008 Financial Crisis  —  A new case could decimate state-level consumer protections against predatory banking practices.  —  The United States Supreme Court will soon decide a case that could decimate consumer protections against abusive banking practices … ",
    "url": "https://www.levernews.com/the-supreme-court-may-give-us-another-2008-financial-crisis/"
  },
  {
    "text": "Trump vows he'll have a ‘statement’ on abortion ‘next week’  —  The former president addressed a question from NBC News about whether he supports Florida's six-week abortion ban.  —  GRAND RAPIDS, Mich. — Former President Donald Trump on Tuesday announced that his campaign would address … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-statement-abortion-week-rcna146107"
  },
  {
    "text": "Mandatory DEI Statements Are Ideological Pledges of Allegiance.  Time to Abandon Them.  —  Council on Academic Freedom at Harvard  —  On a posting for a position as an assistant professor in international and comparative education at the Harvard Graduate School of Education … ",
    "url": "https://www.thecrimson.com/column/council-on-academic-freedom-at-harvard/article/2024/4/2/kennedy-abandon-dei-statements/"
  },
  {
    "text": "President Biden is now posting into the fediverse  —  POTUS puts the ‘fed’ in ‘fediverse.’  —  The official US president Threads account, currently helmed by President Joe Biden, has begun using Meta's ActivityPub integration, making Biden the first sitting US president to post on the decentralized networking protocol.",
    "url": "https://www.theverge.com/2024/4/2/24119353/joe-biden-threads-mastodon-activitypub-fediverse"
  },
  {
    "text": "Tommy Tuberville accuses Dems of being part of ‘a Satanic cult’  —  Republican Sen. Tommy Tuberville of Alabama has now declared, more than once, his belief that Democrats are “a Satanic cult.”  This isn't normal.  —  Sen. Tommy Tuberville recently campaigned for an ally in Utah … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/tommy-tuberville-accuses-dems-part-satanic-cult-rcna146033"
  },
  {
    "text": "Democratic senator eyeing bill to repeal Comstock Act  —  Congressional Democrats are strategizing over legislation to repeal the Comstock Act, the 19th century anti-vice law that's being eyed by conservative activists to potentially enact a national abortion ban.",
    "url": "https://thehill.com/homenews/senate/4570689-democratic-bill-repeal-comstock-act-abortion/"
  },
  {
    "text": "Thai Court Accepts Petition to Disband Largest Opposition Party  — Court previously ruled Move Forward guilty of charter breach  — Campaign to amend law protecting monarchy riles establishment  —  Thailand's Constitutional Court has accepted a petition to disband … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-03/thai-court-accepts-petition-to-disband-largest-opposition-party"
  },
  {
    "text": "Oklahoma official with white nationalist ties is ousted in recall vote  —  Judd Blevins, who marched alongside neo-Nazis in Charlottesville, Virginia, in 2017, lost his fight to remain on Enid's City Council.  —  ENID, Okla. — Voters in Enid decided by a nearly 20-point margin Tuesday … ",
    "url": "https://www.nbcnews.com/news/us-news/oklahoma-judd-blevins-enid-city-council-recall-election-rcna146029"
  },
  {
    "text": "Microsoft faulted for ‘cascade’ of failures in Chinese hack  —  The independent Cyber Safety Review Board's report knocks the tech giant for shoddy cybersecurity practices, lax corporate culture and a deliberate lack of transparency  —  A review board, mandated by President Biden … ",
    "url": "https://www.washingtonpost.com/national-security/2024/04/02/microsoft-cyber-china-hack-report/"
  },
  {
    "text": "Trump wants “Christian visibility day” … - “You know what it's going to be called? … - His supporters — who queued in a half mile long line in hail and freezing temperatures — shouted their approval. … - “We must make America pray again,” said Trump, who encouraged supporters … ",
    "url": "https://www.axios.com/2024/04/03/trump-wants-christian-visibility-day"
  },
  {
    "text": "With enthusiasm, Raffensperger advises Larry David to curb attacks on voter law  —  Top elections official responds to HBO show's brush with Georgia ban on distribution of food or drink to voters with pretty, pretty, pretty cutting letter  —  Larry David, heading into his final episode of HBO's … ",
    "url": "https://www.ajc.com/politics/with-enthusiasm-raffensperger-advises-larry-david-to-curb-attacks-on-voter-law/GW5XLU53EFE6BIOYRTLSZW2S7Y/"
  }
]