[
  {
    "text": "Republicans Block Aid to Ukraine, Jeopardizing Its Fight Against Russia  —  The vote spotlighted waning support in Congress for backing Ukraine in the war, and left the fate of the effort uncertain.  —  Republicans on Wednesday blocked an emergency spending bill to fund the war in Ukraine … ",
    "url": "https://www.nytimes.com/2023/12/06/us/politics/senate-ukraine-aid-bill.html"
  },
  {
    "text": "Senate Republicans block procedural vote for Ukraine aid package  —  Senate Republicans on Wednesday blocked a procedural vote to advance a national security bill that includes billions of dollars in Ukraine aid because it includes no changes to border security policy.",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/ukraine-israel-aid-biden-senate/"
  },
  {
    "text": "Do Trump's rivals know what time it is?  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  LIFE COMES AT YOU FAST — “Candidate for Santos' old seat is convicted on Jan. 6 charges after testifying he had ‘no idea’ Congress met in the Capitol,” by NBC's Megan Lebowitz",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/07/do-trumps-rivals-know-what-time-it-is-00130566"
  },
  {
    "text": "Debate Performances Fuel Haley's Rise in GOP Nomination Race  —  New WSJ poll shows the former U.N. ambassador, the focus of attention on Wednesday night's stage, has edged into second place behind Trump  —  Deft yet serious, quick-witted yet substantive, Nikki Haley's debate performances … ",
    "url": "https://www.wsj.com/politics/elections/gop-debate-2024-presidential-primary-outlook-a6060f4d?mod=followamazon"
  },
  {
    "text": "Five Takeaways From the Republican Debate  —  An ascendant Nikki Haley endured a barrage from Ron DeSantis and Vivek Ramaswamy.  Chris Christie delivered a strong showing.  And with time ticking down, there were few direct attacks on Donald Trump.  —  Nikki Haley clashed repeatedly … ",
    "url": "https://www.nytimes.com/2023/12/07/us/politics/republican-debate-takeaways.html"
  },
  {
    "text": "Nevada GOP ‘fake electors’ indicted for falsely claiming Trump won state's 2020 election  —  A Nevada grand jury has indicted the six Republicans — including the chair of the Nevada Republican Party — who falsely pledged Nevada's electoral votes to Donald Trump following … ",
    "url": "https://thenevadaindependent.com/article/nevada-gop-fake-electors-indicted-for-falsely-claiming-trump-won-states-2020-election"
  },
  {
    "text": "Trump says he wouldn't be a dictator ‘except for Day One’  —  When asked during a Fox News town hall if he would seek retribution upon returning to office, the former president largely sidestepped the question  —  Former president Donald Trump said Tuesday that he would not be a dictator upon returning … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/trump-dictator-day-one-hannity/"
  },
  {
    "text": "Person of the Year  —  Taylor Swift  —  Taylor Swift is telling me a story, and when Taylor Swift tells you a story, you listen, because you know it's going to be good—not only because she's had an extraordinary life, but because she's an extraordinary storyteller.",
    "url": "https://time.com/6342806/person-of-the-year-2023-taylor-swift/"
  },
  {
    "text": "Harvard's president answers backlash over response to calls for ‘genocide of Jews’  —  Threats to the Jewish community “have no place at Harvard,” Claudine Gay said.  —  Harvard University President Claudine Gay watches a video being played during a House Education and The Workforce Committee hearing titled … ",
    "url": "https://abcnews.go.com/Politics/harvards-president-answers-backlash-response-calls-genocide-jews/story?id=105433835"
  },
  {
    "text": "GOP Wife in Sex Scandal Erased From Conservative Site  —  Bridget Ziegler had a top position at the Leadership Institute.  She's reportedly out after her husband was accused of raping their threesome partner.  —  Moms for Liberty co-founder Bridget Ziegler appears to have departed her role … ",
    "url": "https://www.thedailybeast.com/bridget-ziegler-wife-of-florida-gop-boss-christian-ziegler-erased-from-leadership-instit"
  },
  {
    "text": "Michigan high court declines to immediately hear appeal of ruling allowing Trump on primary ballot  —  The Michigan Supreme Court refused Wednesday to immediately hear an appeal of a lower court's ruling that would allow former President Donald Trump's name to be on the state's presidential primary ballot.",
    "url": "https://apnews.com/article/trump-insurrection-14th-amendment-ballot-michigan-a183d62e622935422e1d8141adade0ae"
  },
  {
    "text": "Behind the Curtain — Exclusive: How Trump would build his loyalty-first Cabinet  —  Former President Trump, if elected, would build a Cabinet and White House staff based mainly on two imperatives: pre-vetted loyalty to him and a commitment to stretch legal and governance boundaries … ",
    "url": "https://www.axios.com/2023/12/07/trump-loyalty-cabinet-2025-carlson-miller-bannon"
  },
  {
    "text": "A Biden donor calls it quits  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  With help from producer Raymond Rapada.  —  Democratic donor and humanitarian AMED KHAN is done with President JOE BIDEN.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2023/12/06/a-biden-donor-calls-it-quits-00130478"
  },
  {
    "text": "Wind and solar pose climate threat too, oil giant Saudi Arabia argues  —  The kingdom is elevating the use of fans and filters to pull carbon dioxide out of the sky.  But its motives are under scrutiny at global climate talks.  —  Oil-rich Saudi Arabia is urging nations to take action … ",
    "url": "https://www.politico.com/news/2023/12/07/saudi-arabia-focuses-on-emissions-from-wind-and-solar-over-oil-00130506"
  },
  {
    "text": "A Black Texas student has been suspended once again for his natural hairstyle  —  A Black high school student in Texas who was suspended for more than a month for wearing a natural hairstyle returned to regular classes this week after spending more than a month at an alternative school.",
    "url": "https://www.npr.org/2023/12/06/1217580867/black-texas-student-returns-to-class-suspended-again-natural-hair"
  },
  {
    "text": "UK Says Russia Targeted Officials in Email-Hacking Campaign  — FSB attempted to hack personal email addresses, minister says  — Russia is one of the most prolific state actors in cybercrime  —  The UK accused Russia's main intelligence agency of seeking to hack the emails … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-07/uk-says-russia-targeted-politicians-in-email-hacking-campaign"
  },
  {
    "text": "EXCLUSIVE: Fulton prosecutors list top Trump aides, Ga. officials as witnesses  —  Ex-Justice Department leaders, VP Pence and Gov. Brian Kemp could be called  —  Fulton County prosecutors could call several senior officials who served in the Trump administration and Georgia's top elected leaders … ",
    "url": "https://www.ajc.com/politics/exclusive-fulton-prosecutors-list-top-trump-aides-ga-officials-as-witnesses/FC4RPKGUIVCVRDGS3VP37L6UXY/"
  },
  {
    "text": "New York Man Found Guilty of Felony Obstruction and Other Charges for Actions During Jan. 6 Capitol Breach  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  WASHINGTON - A New York man was found guilty in the District of Columbia on Tuesday, Dec. 5, 2023 … ",
    "url": "https://www.justice.gov/usao-dc/pr/new-york-man-found-guilty-felony-obstruction-and-other-charges-actions-during-jan-6"
  }
]