[
  {
    "text": "Trump tells rally-goers not to die in searing Vegas heat: 'I don't care about you, I just want your vote'  —  Remark get laughs at rally - but also draws raised eyebrows on social media as critics argue Trump was being truthful  —  Donald Trump is no stranger to accusations that he has little regard … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-voters-heat-las-vegas-b2559547.html"
  },
  {
    "text": "Playbook: Kamala Harris sizes up her competition  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  EURO EARTHQUAKE — Voters in the European Parliament elections veered sharply to the right in results announced yesterday, with many of the continent's ruling centrist parties making major retreats.",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/10/kamala-harris-sizes-up-her-competition-00162458"
  },
  {
    "text": "A crucial demographic for Biden: White voters without college degrees  —  Good morning, Early Birds.  The Senate voted 60 years ago today to cut off debate of the Civil Rights Act of 1964, ending a filibuster that lasted more than two months.  “Stronger than all the armies is an idea whose time has come … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/10/crucial-demographic-biden-white-voters-without-college-degrees/"
  },
  {
    "text": "Scholz Heading for Another Election Rout in Eastern Germany  — Ruling parties were trounced in the former communist regions  — Three states where AfD is strongest force vote in September  —  Scholz's SPD Sees Worst-Ever Result in Germany's EU Vote  —  Chancellor Olaf Scholz's … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-10/scholz-heading-for-another-election-debacle-in-eastern-germany"
  },
  {
    "text": "Trump's sentencing: everything you need to know  —  Defendants normally plead for leniency.  Trump is too busy slandering the judge. … With Donald Trump's sentencing for his 34 felony convictions just a month away, speculation about the criminal consequences for the former president is reaching a fever pitch.",
    "url": "https://www.publicnotice.co/p/trump-new-york-sentencing-explained-july-11-2024"
  },
  {
    "text": "The brazen GOP plan to launder cash to the nation's most radical gubernatorial candidate  —  One of the country's most hotly contested gubernatorial contests is taking place in North Carolina, where Lt. Governor Mark Robinson (R) — known for his extremist views on LGBTQ rights, abortion … ",
    "url": "https://popular.info/p/the-brazen-gop-plan-to-launder-cash"
  },
  {
    "text": "Donald Trump's Last (We Hope) Grift … Have you been to the Trump Ocean Resort Baja Mexico?  It's absolutely lovely; you must visit one of these days.  I did, a little while back.  Let me tell you all about it.  The resort is in Mexico, just over the border with the United States and southwest of … ",
    "url": "https://newrepublic.com/article/182345/donald-trump-last-grift"
  },
  {
    "text": "Eric Swalwell Savages Trump Rally With ‘You Might Be In A Cult If... ’ Video  —  The California congressman hilariously captured the ridiculous messianic vibe of Trump's Las Vegas campaign stop.  —  LOADING  —  Rep. Eric Swalwell (D-Calif.) mocked Donald Trump's Las Vegas rally Sunday … ",
    "url": "https://www.huffpost.com/entry/eric-swalwell-trump-you-know-youre-in-a-cult-if_n_6666c4f4e4b02fc48bf3e03f"
  },
  {
    "text": "Trump Demands Biden Remove Ad of Him Calling Dead Soldiers ‘Suckers’ and ‘Losers’  —  WAGING WAR  —  The former president said only a “psycho” or a “very stupid person” would've made such statements.  —  Donald Trump on Sunday called for President Joe Biden to take down an attack ad featuring … ",
    "url": "https://www.thedailybeast.com/trump-demands-biden-remove-ad-of-him-calling-dead-soldiers-suckers-and-losers"
  },
  {
    "text": "Hunter Biden's Lawyers Are Expected to Rest Their Case in Gun Trial  —  The defense team seems more likely to avoid taking the risky step of putting Mr. Biden on the stand, setting the stage for the jury to begin deliberations by day's end.  —  Hunter Biden's defense team is expected to wrap … ",
    "url": "https://www.nytimes.com/2024/06/10/us/politics/hunter-biden-gun-trial-defense.html"
  },
  {
    "text": "The Success Narratives of Liberal Life Leave Little Room for Having Children  —  For young, secular, politically progressive men and women, having children has become something of an afterthought.  Liberal conventional wisdom encourages people to spend their 20s on journeys of personal … ",
    "url": "https://www.nytimes.com/2024/06/10/opinion/natalism-liberalism-parenthood.html"
  },
  {
    "text": "Never mind: Wall Street titans shake off qualms and embrace Trump  —  Many high-dollar donors had turned their backs on Trump after the stolen election lie and Jan. 6, but now have returned.  —  NEW YORK — Wall Street executives spent three years doing everything they could to distance themselves from former President Donald Trump.",
    "url": "https://www.politico.com/news/2024/06/10/billionaires-learned-to-stop-worrying-and-love-trump-00162219"
  },
  {
    "text": "Trump Endorses Sam Brown in Nevada's Key Senate Race  —  Mr. Brown, a former Army captain, is the leading candidate in a crowded field of Republicans vying to take on Senator Jacky Rosen, a vulnerable Democratic incumbent in a presidential battleground.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/06/09/us/politics/trump-endorsement-sam-brown.html"
  },
  {
    "text": "Kamala Harris mourns death of Palestinians in raid that rescued 4 Israeli hostages  —  An unknown number of Palestinian innocents were killed in Israel's rescue op  —  Vice President Harris mourned the Palestinians who were killed in a successful Israeli hostage rescue operation this weekend during an address delivered Saturday.",
    "url": "https://www.foxnews.com/politics/kamala-harris-mourns-death-palestinians-raid-rescued-4-israeli-hostages"
  }
]