[
  {
    "text": "It's ‘insulting’ to have ‘nonsense Republicans’ on Biden impeachment inquiry panel, Democrat says  —  Rep. Jasmine Crockett (D-Texas) dubbed some of her Republican colleagues “idiots” and “a-holes” alongside criticism of the House Oversight Committee's attempts to launch a formal impeachment inquiry into President Biden.",
    "url": "https://thehill.com/homenews/house/4355290-jasmine-crockett-nonsense-republicans-biden-impeachment-inquiry-panel/"
  },
  {
    "text": "House speaker: Evidence against Biden can't be ignored.  We're pursuing impeachment inquiry.  —  House Republicans understand that to begin to rebuild Americans' trust in the Congress, we owe it to the people to undertake this process methodically and transparently.",
    "url": "https://www.usatoday.com/story/opinion/2023/12/12/biden-impeachment-inquiry-vote-house-republicans-speaker-mike-johnson/71877294007/"
  },
  {
    "text": "Russia Has Suffered Staggeringly High Losses, U.S. Report Says  —  The declassified intelligence assessment also found that Russia's objective has been eroding Western support for Ukraine, the country it invaded.  —  The Russian push in eastern Ukraine this fall and winter was designed … ",
    "url": "https://www.nytimes.com/2023/12/12/us/politics/russia-intelligence-assessment.html"
  },
  {
    "text": "Israel Begins Pumping Seawater Into Hamas's Gaza Tunnels  —  Early effort to flood tunnels is one of several techniques aimed at destroying network that underpins Hamas's operations  —  Israel's military has begun pumping seawater into Hamas's vast complex of tunnels in Gaza … ",
    "url": "https://www.wsj.com/world/middle-east/israel-takes-fight-against-hamas-to-vast-tunnel-network-2ed3b3f2?mod=followamazon"
  },
  {
    "text": "Israel's Netanyahu Rejects U.S. Plan for Postwar Gaza  —  The prime minister says he won't allow the Palestinian Authority to take over Gaza  —  TEL AVIV—Israeli Prime Minister Benjamin Netanyahu on Monday said he would block the Biden administration's postwar plan to have the Palestinian Authority … ",
    "url": "https://www.wsj.com/world/middle-east/israels-netanyahu-rejects-u-s-plan-for-post-war-gaza-d60fc0c3?mod=followamazon"
  },
  {
    "text": "Biden extends White House invitation to families of Americans held hostage by Hamas  —  Biden has held Zoom meetings with the family members and they have met in person with other administration officials.  —  WASHINGTON — President Joe Biden has invited family members of Americans taken hostage … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-invites-families-americans-hostage-hamas-rcna129293"
  },
  {
    "text": "Pharmacies share medical data with police without a warrant, inquiry finds  —  The revelation could shape the debate over Americans' health privacy as states move to criminalize abortion and drugs related to reproductive health  —  The nation's largest pharmacy chains have handed … ",
    "url": "https://www.washingtonpost.com/technology/2023/12/12/pharmacy-records-police-privacy-abortion/"
  },
  {
    "text": "Tech CEO Accused of Raping, Torturing Employee in ‘Slave Contract’  —  Tradeshift fired Christian Lanng in October over “serious allegations of sexual assault and harassment.”  —  The former chief executive of Tradeshift, a billion-dollar San Francisco business software startup … ",
    "url": "https://www.thedailybeast.com/tradeshift-ceo-christian-lanng-accused-of-trafficking-former-employee"
  },
  {
    "text": "Far-right Polish MP uses fire extinguisher to put out Hanukah candles after Donald Tusk speaks out against xenophobia - Europe live  —  Speaker of house tells reporters that a complaint will be filed with the prosecutor's office against Grzegorz Braun after incident  —  Key events",
    "url": "https://www.theguardian.com/world/live/2023/dec/12/donald-tusk-prime-minister-poland-parliament-coalition-europe-latest-news"
  },
  {
    "text": "Gov. Chris Sununu to announce endorsement in Republican presidential race at Tuesday event, sources tell WMUR  —  Governor to endorse Nikki Haley, sources say  —  MANCHESTER, N.H. —  Republican presidential candidates have been competing for Gov. Chris Sununu's endorsement for months.",
    "url": "https://www.wmur.com/article/chris-sununu-new-hampshire-primary-endorsement/46101497"
  },
  {
    "text": "Top Court Clears Path for Democrats to Redraw House Map in New York  —  The ruling could allow Democrats to tilt anywhere from two to six G.O.P.-held seats leftward.  Republicans vowed to challenge any gerrymandered map.  —  New York's highest court ordered the state to redraw its congressional map … ",
    "url": "https://www.nytimes.com/2023/12/12/nyregion/new-york-redistricting-democrats.html"
  },
  {
    "text": "Lawmakers introduce bipartisan resolution condemning college presidents' response to antisemitism  —  The resolution, first obtained by NBC News, calls on the presidents of Harvard and MIT to resign.  —  WASHINGTON — A bipartisan group of four high-profile House lawmakers will introduce … ",
    "url": "https://www.nbcnews.com/politics/congress/bipartisan-resolution-condemn-college-presidents-antisemitism-campus-rcna129350"
  },
  {
    "text": "Statement from the Harvard Corporation: Our President  —  As members of the Harvard Corporation, we today reaffirm our support for President Gay's continued leadership of Harvard University.  Our extensive deliberations affirm our confidence that President Gay is the right leader to help … ",
    "url": "https://www.harvard.edu/blog/2023/12/12/statement-from-the-harvard-corporation-our-president/"
  },
  {
    "text": "Judge: Giuliani may have defamed Georgia election workers again outside DC courthouse  —  Just minutes after leaving the first day of his civil trial, Rudy Giuliani repeated a false allegation about the pollworkers.  —  Rudy Giuliani's defiant public statements outside a Washington, D.C. … ",
    "url": "https://www.politico.com/news/2023/12/12/judge-giuliani-defamed-georgia-election-workers-00131288"
  },
  {
    "text": "Kate Cox begged Texas to let her end a dangerous pregnancy.  She won't be the last  —  Two years ago, a woman like Cox was able to control her body on her own terms.  Now, she has to go before a court and beg  —  In most cases, we would never have learned her name.",
    "url": "https://www.theguardian.com/commentisfree/2023/dec/12/kate-cox-emergency-abortion-texas"
  },
  {
    "text": "White House lays out offer on immigration changes in talks with Congress  —  Washington — The Biden administration on Tuesday indicated to congressional lawmakers that it would be willing to support a new border authority to expel migrants without asylum screenings, as well as a dramatic expansion … ",
    "url": "https://www.cbsnews.com/news/immigration-white-house-congress-border-security-detention-deportation/"
  },
  {
    "text": "Missouri AG launches investigation of Media Matters  —  Missouri Attorney General Andrew Bailey (R) says he has launched an investigation into Media Matters for America, the progressive watchdog, following its report about harmful antisemitic content on X, the platform formerly known as Twitter.",
    "url": "https://thehill.com/homenews/4355644-missouri-ag-launches-investigation-of-media-matters/"
  },
  {
    "text": "Turkish MP Suffers Heart Attack During Tirade Against Israel  —  Turkish parliamentarian Hasan Bitmez suffered a heart attack and collapsed next to the podium at the Turkish National Assembly on Tuesday after delivering a tirade against Israel.  —  The Grand Assembly of the Turkish parliament … ",
    "url": "https://www.breitbart.com/middle-east/2023/12/12/turkish-mp-suffers-heart-attack-during-tirade-against-israel/"
  },
  {
    "text": "Trump sells snippets of mugshot suit, Mar-a-Lago dinner in latest NFT promotion  — Former President Donald Trump is selling snippets of the clothes he wore the day of his arrest in a Georgia state election case, part of a promotional pitch for a new set of NFT “digital trading cards.”",
    "url": "https://www.cnbc.com/2023/12/12/trump-sells-mugshot-suit-mar-a-lago-dinner-in-latest-nft-promotion.html"
  },
  {
    "text": "FBI arrests an ‘internet pornography personality’ on Jan. 6 charges  —  Paul Caloia, who went by the name “GodHypnotic,” was “bragging” in a Skype chat about taking part in the Jan. 6 attack on the Capitol, an FBI affidavit stated.  —  WASHINGTON — The FBI has arrested an … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-arrests-internet-pornography-personality-jan-6-charges-rcna129325"
  },
  {
    "text": "U.S. intelligence assesses Ukraine war has cost Russia 315,000 casualties - source  —  A declassified U.S. intelligence report assessed that the Ukraine war has cost Russia 315,000 dead and injured troops, or nearly 90% of the personnel it had when the conflict began, a source familiar with the intelligence said on Tuesday.",
    "url": "https://www.reuters.com/world/us-intelligence-assesses-ukraine-war-has-cost-russia-315000-casualties-source-2023-12-12/"
  },
  {
    "text": "‘This is Definitely Plagiarism’: Harvard University President Claudine Gay Copied Entire Paragraphs From Others' Academic Work and Claimed Them as Her Own  —  Harvard University president Claudine Gay plagiarized numerous academics over the course of her academic career … ",
    "url": "https://freebeacon.com/campus/this-is-definitely-plagiarism-harvard-university-president-claudine-gay-copied-entire-paragraphs-from-others-academic-work-and-claimed-them-as-her-own/"
  },
  {
    "text": "Antisemitic sign hung outside Michigan Republican congressman's district office  —  The sign depicted Uncle Sam removing his American stovepipe hat to reveal a kippah with a Star of David underneath reading ‘Jew u$ury buy$ USA pols’  —  An antisemitic sign was hung outside the office … ",
    "url": "https://www.foxnews.com/politics/antisemitic-sign-hung-outside-michigan-republican-congressmans-district-office"
  }
]