[
  {
    "text": "Rep. George Santos won't seek reelection after scathing ethics report cites evidence of lawbreaking  —  The House Ethics committee in a scathing report Thursday said it has amassed “overwhelming evidence” of lawbreaking by Republican Rep. George Santos of New York.  Santos later said he would not see re-election.",
    "url": "https://apnews.com/article/ethics-congress-santos-5ebffe514d8779fbc16a77fa1ab5e0df"
  },
  {
    "text": "Santos ethics report finds ‘substantial evidence’ of criminal wrongdoing  —  The report doesn't recommend expulsion, but a vote to oust the New York Republican is likely regardless.  —  A bipartisan ethics report concludes there is “substantial evidence” that George Santos violated federal criminal laws … ",
    "url": "https://www.politico.com/news/2023/11/16/santos-ethics-reports-finds-substantial-evidence-of-criminal-wrongdoing-00127527"
  },
  {
    "text": "Statement of the Chairman and Ranking Member of the Committee on Ethics Regarding Representative George Santos  —  Pursuant to House Rule XI Clause 3(q)(1), today the Chairman of the Committee on Ethics, Representative Michael Guest, and the Ranking Member, Representative Susan Wild … ",
    "url": "https://ethics.house.gov/press-releases/statement-chairman-and-ranking-member-committee-ethics-regarding-representative-76"
  },
  {
    "text": "Trump Secures Change in Key Hearing Dates From Judge Cannon Amid Conflict With New York Hush-Money Case  —  The scheduling issue that got resolved Thursday is the latest example of the former president's defense team juggling myriad competing cases requiring their split attention",
    "url": "https://themessenger.com/news/trump-cannon-court-schedule-florida-new-york-scheduling-conflict"
  },
  {
    "text": "Elon Musk's Disturbing ‘Truth’  —  The billionaire affirmed the deadliest anti-Semitic conspiracy theory in recent American history.  —  The Hebrew Immigrant Aid Society “likes to bring invaders in that kill our people ... Screw your optics, I'm going in.”",
    "url": "https://www.theatlantic.com/ideas/archive/2023/11/elon-musks-disturbing-truth/676019/"
  },
  {
    "text": "Elon Musk faces scrutiny after calling antisemitic X post the ‘absolute truth’  —  Tech billionaire Elon Musk is facing a wave of backlash after engaging with an antisemitic social media post on Wednesday, calling it the “absolute truth.”  —  The antisemitic post that Musk seemed to endorse came … ",
    "url": "https://thehill.com/homenews/media/4312813-elon-musk-facing-scrutiny-antisemitic-post/"
  },
  {
    "text": "Special counsel investigating Joe Biden's handling of classified material is not expected to bring charges  —  Special counsel Robert Hur is not expected to charge anyone in connection with the mishandling of classified documents at two locations connected to President Joe Biden, two sources close to the investigation told CNN.",
    "url": "https://www.cnn.com/2023/11/16/politics/special-counsel-hur-biden/"
  },
  {
    "text": "Capitol Police confront fallout from violent protest at Democratic headquarters  —  The Hill's police force has been on edge after recent assaults on lawmakers and the Jan. 6 insurrection.  —  The Capitol Police announced that a protest that turned violent outside of Democratic Party … ",
    "url": "https://www.politico.com/news/2023/11/16/capitol-police-fallout-protest-democratic-headquarters-00127579"
  },
  {
    "text": "CNN Poll: Trump holds significant lead in New Hampshire GOP primary, while Haley moves into second place  —  Former President Donald Trump maintains a significant lead among likely voters in New Hampshire's Republican presidential primary, but former South Carolina Gov. Nikki Haley has moved ahead … ",
    "url": "https://www.cnn.com/2023/11/16/politics/cnn-poll-new-hampshire-republican-primary/"
  },
  {
    "text": "Verdict reached in Paul Pelosi hammer attack case  —  A federal jury reached a verdict in the trial of David DePape, accused of breaking into the San Francisco home of former House Speaker Nancy Pelosi and attacking her husband with a hammer.  —  SAN FRANCISCO — A federal jury on Thursday reached … ",
    "url": "https://www.nbcnews.com/news/us-news/verdict-reached-paul-pelosi-hammer-attack-case-rcna125350"
  },
  {
    "text": "David DePape convicted of assaulting Nancy Pelosi's husband  —  SAN FRANCISCO — The man who broke into the home of Nancy Pelosi last year and bludgeoned her husband was convicted Thursday on federal charges of trying to kidnap the then-House speaker and assaulting one of her family members because of her work in Congress.",
    "url": "https://www.washingtonpost.com/nation/2023/11/16/paul-pelosi-nancy-david-depape-trial/"
  },
  {
    "text": "USCP Statement on the Unlawful Demonstration outside the DNC  —  Last night approximately 200 people gathered in front of the Democratic National Committee (DNC) headquarters to protest the conflict in the Middle East.  —  We have handled hundreds of peaceful protests, but last night's group was not peaceful.",
    "url": "https://www.uscp.gov/media-center/press-releases/uscp-statement-unlawful-demonstration-outside-dnc"
  },
  {
    "text": "Sean Combs Is Accused by Cassie of Rape and Years of Abuse in Lawsuit  —  In the suit, the singer says Mr. Combs, known as Puff Daddy or Diddy, subjected her to a pattern of control and abuse over about a decade.  Mr. Combs “vehemently” denied the allegations.",
    "url": "https://www.nytimes.com/2023/11/16/arts/music/sean-combs-diddy-cassie-rape-lawsuit.html"
  },
  {
    "text": "More pandas will be coming to the U.S., China's president signals  —  SAN FRANCISCO — Chinese President Xi Jinping signaled that China will send new pandas to the United States, calling them “envoys of friendship between the Chinese and American peoples.”  —  “We are ready to continue … ",
    "url": "https://www.npr.org/2023/11/16/1213443655/pandas-us-china-xi"
  },
  {
    "text": "Supreme Court declines Florida's request to enforce anti-drag show law  —  The law makes it a crime to admit minors to shows that the state deems too sexually explicit.  —  The Supreme Court on Thursday rejected Florida's bid to enforce statewide a contentious law that targets drag show performances that … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-declines-floridas-request-enforce-anti-drag-show-law-rcna123531"
  },
  {
    "text": "A rare look at the devastation caused by AR-15 shootings  —  Editor's note: The photos, videos and personal accounts below are extremely disturbing and may be too upsetting for some people.  Read why The Post is publishing this story.  —  When a gunman fires an AR-15 ...",
    "url": "https://www.washingtonpost.com/nation/interactive/2023/ar-15-force-mass-shootings/"
  },
  {
    "text": "Israeli troops scour Gaza's al-Shifa Hospital for evidence of Hamas presence  —  JERUSALEM — The search by Israeli forces of Gaza's largest hospital stretched into its second day Thursday amid the wait for more concrete evidence of extensive Hamas infrastructure at the facility that precipitated the raid.",
    "url": "https://www.washingtonpost.com/world/2023/11/16/israel-gaza-shifa-hamas-evidence/"
  },
  {
    "text": "Mike Gallagher argues it's time to ban TikTok as app ignites sympathy for Osama bin Laden  —  Rep. Mike Gallagher (R-WI) argued it's time to ban TikTok after 9/11 mastermind Osama bin Laden's “Letter to the American People” went viral and stoked sympathy with younger users.",
    "url": "https://www.washingtonexaminer.com/news/house/mike-gallagher-argues-time-ban-tiktok-app-ignites-sympathy-osama-bin-laden"
  },
  {
    "text": "Dexter Wade, buried without his family's knowledge, had ID on him with his home address, lawyer says  —  Dexter Wade, 37, was run over by a police cruiser in March, and buried in a pauper's grave.  His mother searched for him for months before learning what happened.",
    "url": "https://www.nbcnews.com/news/us-news/dexter-wade-buried-mississippi-id-home-address-lawyer-says-rcna125511"
  },
  {
    "text": "CNN Exclusive: Special counsel using California grand jury in Hunter Biden probe, subpoenas his uncle James Biden  —  Special counsel prosecutors are using a Los Angeles grand jury to seek documents and possible testimony from multiple witnesses as part of the ongoing federal investigation … ",
    "url": "https://www.cnn.com/2023/11/16/politics/special-counsel-california-grand-jury-hunter-james-biden"
  }
]