[
  {
    "text": "Trump serves McDonald's fries to supporters in stage-managed campaign stop  —  Trump didn't answer a question on the minimum wage, instead promoting his unsubstantiated claim that Kamala Harris never worked at the burger chain.  —  Trump works fry station at McDonald's in Pennsylvania",
    "url": "https://www.washingtonpost.com/politics/2024/10/20/trump-mcdonalds-minimum-wage/"
  },
  {
    "text": "Trump Makes Fries at McDonald's in Bizarre Attempt to Troll Harris  —  The former president contends — without any evidence — that his opponent never worked at the fast food restaurant as she has said  —  Donald Trump is spending part of his Sunday afternoon behind the counter at a Pennsylvania McDonald's.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-mcdonalds-troll-harris-1235138509/"
  },
  {
    "text": "Trump serves disturbing message through McDonald's drive-thru window about whether he'll accept election result  —  Ex-president once again raises notion that election could be tainted by fraud his campaign failed to prove existed in 2020  —  Your support helps us to tell the story",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-mcdonalds-drive-thru-election-2024-b2632476.html"
  },
  {
    "text": "Trump makes fries at Pennsylvania McDonald's: 'I've now worked for 15 minutes more than Kamala'  —  Former President Donald Trump took on a new role as he cooked and served french fries to customers at McDonald's on Sunday afternoon in Pennsylvania, while dishing out plenty of jabs at Vice President Kamala Harris.",
    "url": "https://www.foxnews.com/politics/trump-makes-fries-pennsylvania-mcdonalds-ive-now-worked-15-minutes-more-than-kamala"
  },
  {
    "text": "Sunday Snapshot: Trump's NSFW joke NBD for GOP … 1. Johnson: Trump's crude comment just rally “fun” … But now, they're brushing aside questions about his rhetoric, saying political dialogue should be about policy — even when the former president is speaking publicly about a golf pro's genitalia.",
    "url": "https://www.axios.com/2024/10/20/trump-arnold-palmer-snapshot"
  },
  {
    "text": "A statement from 60 Minutes  —  Former President Donald Trump is accusing 60 Minutes of deceitful editing of our Oct. 7 interview with Vice President Kamala Harris.  That is false.  —  60 Minutes gave an excerpt of our interview to Face the Nation that used a longer section of her answer than that on 60 Minutes.",
    "url": "https://www.cbsnews.com/news/60-minutes-statement/"
  },
  {
    "text": "‘60 Minutes’ responds to Trump's ‘false’ claims about Harris interview  —  The CBS News show “60 Minutes” responded on Sunday to former President Trump's claims that the network selectively edited an interview with his Democratic opponent, Vice President Harris, to make her look good.",
    "url": "https://thehill.com/media/4944127-cbs-news-60-minutes-trump/"
  },
  {
    "text": "McConnell backed Jack Smith, wanted Trump to “pay” for Jan. 6 … - “If he hasn't committed indictable offenses, I don't know what one is,” the longest-serving Republican leader told journalist Michael Tackett in an interview for “The Price of Power,” weeks after Smith brought the charges against Trump in August 2023.",
    "url": "https://www.axios.com/2024/10/20/mcconnell-trump-jack-smith-jan-6th-indictment"
  },
  {
    "text": "Harris Rallies Georgia's Black Churchgoers With Help Of Stevie Wonder  —  Harris celebrated her 60th birthday while visiting two Atlanta-area churches during campaign stops on Sunday.  —  LOADING  —  Kamala Harris on Sunday summoned Black churchgoers to turn out at the polls and got … ",
    "url": "https://www.huffpost.com/entry/kamala-harris-campaigns-black-churches-georgia-stevie-wonder_n_6715816ee4b0ae82147ff26c"
  },
  {
    "text": "Shapiro Wants Musk Investigated for Giving Cash to Registered Voters  —  The Pennsylvania governor suggested that law enforcement “take a look at” the billionaire's million dollar giveaway to registered voters who sign his PAC's petition … Musk has vowed to give away one million dollars each … ",
    "url": "https://www.rollingstone.com/politics/politics-news/shapiro-elon-musk-million-cash-giveaway-1235138501/"
  },
  {
    "text": "One of the last Navajo Code Talkers from World War II dies at 107  —  John Kinsel Sr., one of the last remaining Navajo Code Talkers who transmitted messages during World War II based on the tribe's native language, has died.  He was 107.  —  Navajo Nation officials in Window Rock announced Kinsel's death on Saturday.",
    "url": "https://apnews.com/article/navajo-code-talkers-word-war-ii-5f527f43eebaede11eb86f7bdad27a39"
  },
  {
    "text": "Scoop: Mike Johnson's tense text messages with Liz Cheney … - Johnson said the two “agreed to disagree” over whether Trump is a threat to democracy.  — Cheney disputed Johnson's characterization of the exchange, telling Axios that she and the speaker “used to be friends, but we did not ‘agree to disagree.’”",
    "url": "https://www.axios.com/2024/10/20/mike-johnson-liz-cheney-text-messages-trump"
  },
  {
    "text": "If Trump wins, blame the New York Times  —  America's paper of record refuses to sound the alarm about the threat Trump poses to democracy  —  If Donald Trump wins the Nov. 5 election, the New York Times will be partly responsible.  —  As the dominant voice in American journalism … ",
    "url": "https://www.salon.com/2024/10/20/if-wins-the-new-york-times/"
  },
  {
    "text": "Harris outraised Trump more than 3-to-1 in September  —  Kamala Harris' campaign outraised Donald Trump by more than 3-to-1 in September, with the vice president's massive $222 million haul further extending her financial advantage in the final stretch of a tight presidential election.",
    "url": "https://www.politico.com/live-updates/2024/10/20/2024-elections-live-coverage-updates-analysis/harris-trump-september-fec-fundraising-00184583"
  },
  {
    "text": "Scoop: Israel gave the White House its demands for ending the war in Lebanon … - Israeli officials said the paper came out of discussions Dermer had with the Israeli Ministry of Defense and the Israel Defense Forces about the principles Israel demands be part of any diplomatic solution to end the war with Hezbollah.",
    "url": "https://www.axios.com/2024/10/21/israel-us-lebanon-end-war-conditions"
  },
  {
    "text": "Trump had little regard for the Constitution while in office.  He's an even bigger threat to the rule of law now.  —  Trump had little regard for the Constitution while in office.  He's an even bigger threat to the rule of law now.  Because of the Supreme Court's ill-conceived presidential immunity ruling … ",
    "url": "https://www.inquirer.com/opinion/editorials/inq2/trump-threat-putin-manchurian-candidate-rule-law-20241020.html#loaded"
  }
]