[
  {
    "text": "BREAKING: Trump, allies will be booked at Fulton County Jail, sheriff says  —  X  —  Former President Donald Trump and his 18 co-defendants will be booked at the Fulton County Jail, the sheriff's office said Tuesday.  —  “At this point, based on guidance received from the District Attorney's office … ",
    "url": "https://www.ajc.com/news/crime/breaking-trump-allies-will-be-booked-at-fulton-county-jail-sheriff-says/TVA75MWN3ZG4DBSS4TLO7EB4WE/"
  },
  {
    "text": "Trump Plans to Release 100-Page Report on Georgia Election Fraud Claims  —  Liz Harrington, a communications aide described as a true believer in the former president's lies about a stolen election, helped prepare the report.  Mr. Trump said he would release it on Monday.",
    "url": "https://www.nytimes.com/2023/08/15/us/politics/trump-election-report-georgia-indictment.html"
  },
  {
    "text": "Trump stiffed his alleged co-conspirators, whose false claims brought in $250 million  — Several of former President Donald Trump's allies who are now facing criminal charges for helping him try to overturn the results of the 2020 election were never paid by the Trump political operation for work they did in late 2020.",
    "url": "https://www.cnbc.com/2023/08/15/trump-co-conspirators-never-got-paid-by-trump-team.html"
  },
  {
    "text": "Following Trump indictment, agency moves on investigation of Lt. Gov. Jones  —  A state agency is moving ahead with plans that will determine whether Lt. Gov. Burt Jones faces criminal charges as part of a scheme to overturn the 2020 presidential election in Georgia.Jones is one of 30 people … ",
    "url": "https://www.ajc.com/politics/following-trump-indictment-agency-moves-on-investigation-of-lt-gov-jones/GCK6Q7HZABB5PEHAMSQGWGTNEQ/"
  },
  {
    "text": "This Indictment Hits Different  —  LATE MONDAY NIGHT, a grand jury in Fulton County, Georgia handed down a sweeping 98-page indictment against Donald Trump and 18 others—including former White House Chief of Staff Mark Meadows and lawyers Jeffrey Clark, Kenneth Chesebro, John Eastman, Jenna Ellis, and Rudy Giuliani.",
    "url": "https://plus.thebulwark.com/p/this-indictment-hits-different"
  },
  {
    "text": "Kimberly Guilfoyle Cites John Gotti To Defend Trump, Makes The Opposite Point She Intended  —  The conservative media personality seemed to inadvertently suggest that Gotti, an infamous mobster, was less of a criminal than Trump.  —  LOADING  —  Donald Trump Jr.'s girlfriend, Kimberly Guilfoyle … ",
    "url": "https://www.huffpost.com/entry/kimberly-guilfoyle-defend-trump-john-gotti_n_64dbe594e4b01778ea6f9e82"
  },
  {
    "text": "Georgia Case Lays the Ground for Parallel Prosecutions of Trump  —  The district attorney in Georgia and the special counsel converged on the same conclusion: that Mr. Trump and his allies “knowingly and willfully joined a conspiracy to unlawfully change the outcome of the election.”",
    "url": "https://www.nytimes.com/2023/08/15/us/elections/trump-indictments-willis-smith.html"
  },
  {
    "text": "We Will Finally Get a Trump Mugshot With Georgia Indictment … Donald Trump has been indicted for a fourth time in Georgia—this time for helping to lead a “criminal racketeering enterprise” in his efforts to overturn the 2020 election.  —  This case is the first indictment where we may get a mugshot of the former president.",
    "url": "https://newrepublic.com/post/174993/will-finally-get-trump-mugshot-georgia-indictment"
  },
  {
    "text": "Why the Fani Willis Prosecution of Donald Trump Is Indispensable  —  Mr. Eisen is a co-author of “Fulton County, Georgia's Trump Investigation,” a Brookings report on the Fulton County district attorney's investigation.  Ms. Copeland is a criminal defense and appellate attorney in Savannah, Ga.",
    "url": "https://www.nytimes.com/2023/08/15/opinion/trump-indictment-georgia-fani-willis.html"
  },
  {
    "text": "Mark Meadows seeks to move Fulton County election case to federal court  —  The former chief of staff was indicted with Trump and 17 others on Monday.  —  Former White House Chief of Staff Mark Meadows officially filed Tuesday to move the case brought against him by Fulton County District … ",
    "url": "https://abcnews.go.com/US/meadows-seeks-move-fulton-county-election-case-federal/story?id=102295084"
  },
  {
    "text": "Mark Meadows is ‘playing all sides’ trying to get out of trouble: Legal expert  —  Former White House Chief of Staff Mark Meadows has “played all sides” as he tried to avoid prosecution for his involvement in the plot to overturn the 2020 presidential election, argued former federal prosecutor Harry Litman … ",
    "url": "https://www.rawstory.com/mark-meadows-playing-all-sides/"
  },
  {
    "text": "Elon Musk's X is throttling traffic to websites he dislikes  —  The site formerly known as Twitter has added a five-second delay when a user clicks on a shortened link to the New York Times, Facebook and other sites Musk commonly attacks, a Washington Post analysis found",
    "url": "https://www.washingtonpost.com/technology/2023/08/15/twitter-x-links-delayed/"
  },
  {
    "text": "Special counsel says Hunter Biden's gun deal is ‘withdrawn’ and invalid  —  Special counsel David Weiss said the deal his team previously reached with Hunter Biden to resolve a felony gun possession charge was never approved by a probation officer and is not binding.",
    "url": "https://www.cnn.com/2023/08/15/politics/special-counsel-hunter-biden-gun-deal/"
  },
  {
    "text": "Entire police department resigns in Minnesota city, leaves mayor ‘blindsided’: ‘Zero applicants’  —  Goodhue's police chief said in July that he had ‘zero applicants’ to join force  —  Goodhue, Minnesota, a small city in the southeastern part of the state, lost its entire police force … ",
    "url": "https://www.foxnews.com/media/entire-police-department-resigns-minnesota-town-leaves-mayor-blindsided-zero-applicants"
  },
  {
    "text": "Entire police force in Minnesota city resigns over pay concerns  —  A small city in southeast Minnesota is without a police force after its chief and officers resigned over low pay.  —  Goodhue — population 1,250, according to the 2020 census — accepted the resignation of its police chief … ",
    "url": "https://thehill.com/homenews/state-watch/4153994-entire-minnesota-police-force-resigns-over-pay-concerns/"
  },
  {
    "text": "Singer Put Target on Blast for Racism but No One's Buying It  —  Baby Storme is copping backlash online after claiming a Target employee was “racist” for refusing to let her film a “flash mob” dance video in one of its stores without permission.  —  Singer Baby Storme has blasted Target … ",
    "url": "https://www.thedailybeast.com/singer-baby-storme-calls-target-employee-racist-gets-slammed-for-being-entitled"
  },
  {
    "text": "Former high-level FBI official pleads guilty in connection to scheme working for sanctioned Russian oligarch  —  The former head of counterintelligence for the FBI's New York field office pleaded guilty Tuesday to one count of conspiracy in connection to a scheme working for a sanctioned Russian oligarch in 2021.",
    "url": "https://www.cnn.com/2023/08/15/politics/charles-mcgonigal-fbi/"
  },
  {
    "text": "Treasury Secretary Janet Yellen Says She Ate Magic Mushrooms During China Visit  —  “There was this delicious mushroom dish,” said Yellen.  —  LOADING  —  Janet Yellen said she thoroughly enjoyed her July trip to China — and a local meal that included magic mushrooms.",
    "url": "https://www.huffpost.com/entry/treasury-secretary-janet-yellen-says-she-ate-magic-mushrooms-during-recent-china-visit_n_64db4d9ce4b06b5d9bad6341"
  }
]