[
  {
    "text": "An ugly case of ‘false balance’ in the New York Times  —  I once asked Jill Abramson, the former top editor of the New York Times, to name the best reporters she had ever encountered.  —  I recall she mentioned her friend and co-author Jane Mayer — definitely on my list, too — and a few others.",
    "url": "https://margaretsullivan.substack.com/p/an-ugly-case-of-false-balance-in"
  },
  {
    "text": "Israel recovers the bodies of 6 hostages in Gaza, including Israeli-American Hersh Goldberg-Polin  —  Israel on Sunday said it had recovered the bodies of six hostages in Gaza, including a young Israeli-American man who became one of the most well-known captives held by Hamas as his parents met … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-hostages-hersh-netanyahu-29496f50a9b1740bd3905035ffd23052"
  },
  {
    "text": "There Are No Backsies on Dobbs  —  Since the day after the debate in June, I have conceived of the shift from a Joe Biden to a Kamala Harris campaign in three ways: The Vice President would more vigorously explain the wildly successful policies of the Biden-Harris Administration.",
    "url": "https://www.emptywheel.net/2024/09/01/there-are-no-backsies-on-dobbs/"
  },
  {
    "text": "Americans love big cars, but new analysis suggests that the heaviest vehicles kill more people than they save  —  Witnesses said the driver showed no signs of slowing down.  On June 3rd Nicole Louthain and her six-year-old daughter were stopped at a red light in Grand Forks … ",
    "url": "https://www.economist.com/interactive/united-states/2024/08/31/americans-love-affair-with-big-cars-is-killing-them"
  },
  {
    "text": "Dems are “the clear underdogs,” Harris campaign chair says … - “However, make no mistake: we head into the final stretch of this race as the clear underdogs. … - In nine days, “Vice President Harris will face Trump on the debate stage, where we expect him to be a formidable opponent.",
    "url": "https://www.axios.com/2024/09/01/harris-campaign-2024-election-underdogs"
  },
  {
    "text": "Others Have Politicized Arlington, but Trump's Approach Has No Precedent  —  Donald J. Trump isn't the first candidate to run afoul of the ban on partisan activity in Arlington National Cemetery.  But no one else has responded as hostilely as his campaign has.",
    "url": "https://www.nytimes.com/2024/09/01/us/politics/trump-arlington-cemetery-army.html"
  },
  {
    "text": "Arlington cemetery controversy shines spotlight on Utah Gov. Spencer Cox's sudden embrace of Trump  —  SALT LAKE CITY (AP) — A few months ago, Utah Gov. Spencer Cox was one of the few prominent Republicans consistently keeping his distance from Donald Trump, whose brash style seemed … ",
    "url": "https://apnews.com/article/spencer-cox-trump-utah-governor-arlington-emetery-ee20ad030e170498664f6f8544ddf46a"
  },
  {
    "text": "Justice Ketanji Brown Jackson says she's open to an ‘enforceable’ Supreme Court ethics code  —  “A binding code of ethics is pretty standard for judges, and so I guess the question is, ‘Is the Supreme Court any different?’”  Justice Ketanji Brown Jackson said during a CBS interview.",
    "url": "https://www.nbcnews.com/politics/supreme-court/ketanji-brown-jackson-open-enforceable-ethics-code-rcna169149"
  },
  {
    "text": "Harris doesn't get convention bounce, but widens gap with women: POLL  —  Other key takeaways from ABC's poll include white men shifting to Trump.  —  Democratic presidential nominee and U.S. Vice President Kamala Harris takes the stage on Day 4 of the Democratic National Convention in Chicago, Illinois, Aug. 22, 2024.",
    "url": "https://abcnews.go.com/Politics/harris-trump-abc-news-ipsos-poll-convention-bounce-widens-gap-women/story?id=113246534"
  },
  {
    "text": "The kleptocrats aren't just stealing money.  They're stealing democracy … Donald Trump opened Trump Tower on Fifth Avenue in 1983 and occupied the penthouse himself.  The building was intended to advertise its owner's wealth, and also to attract other rich tenants — including, ironically, the very secretive rich.",
    "url": "https://www.ft.com/content/0876ef7a-bf88-463e-b8ca-bd9b4a11665c?accessToken=zwAGIQ6jzGSgkc8Idu96v4hGPtO4yr2bShFmXA.MEUCIAjwvv97o-GbDWICTJI-1kTLgIEmpcxXnmKwyCJyAEX8AiEAlIQ0PFuVHD2nCcw9QF_fmrHm03OPnWdNSPjMpn70j5k&sharetype=gift&token=cbe21496-8086-4af8-a07c-7c2201d2995e"
  },
  {
    "text": "Tulsi Gabbard's journey to Donald Trump is an ominous sign of Putin's power  —  From Democrat to pro-Putin isolationist: How did Tulsi Gabbard get here?  —  On Monday, former Democratic House member Tulsi Gabbard, D-HI, endorsed Donald Trump for the presidency and became one of his surrogates on the campaign trail.",
    "url": "https://www.salon.com/2024/09/01/tulsi-gabbards-journey-to-donald-is-an-ominous-sign-of-putins-power/"
  },
  {
    "text": "GOP network props up liberal third-party candidates in key states, hoping to siphon off Harris votes  —  WASHINGTON (AP) — Italo Medelius was leading a volunteer drive to put Cornel West on North Carolina's presidential ballot last spring when he received an unexpected call from a man named Paul who said he wanted to help.",
    "url": "https://apnews.com/article/cornel-west-jill-stein-republican-network-harris-4089fb0c9ebb16002e56a1c254a21b0e"
  },
  {
    "text": "Trump Is Making New, Sketchy Foreign Business Deals  —  From Saudi Arabia to Serbia, despots are cozying up, likely in preparation for a second term.  —  When Donald Trump launched his first presidential campaign nearly a decade ago, there was a deluge of concerns about his foreign financial entanglements.",
    "url": "https://nymag.com/intelligencer/article/trump-is-making-new-sketchy-foreign-business-deals.html"
  },
  {
    "text": "White House official says Biden and Harris weren't invited to Arlington cemetery by families of service members killed during Afghanistan withdrawal  —  Biden and Harris' teams pushed back on claims from GOP Sen. Tom Cotton and former Rep. Tulsi Gabbard that the president and vice president had been invited alongside Trump.",
    "url": "https://www.nbcnews.com/politics/white-house/biden-harris-werent-invited-arlington-abbey-gate-trump-rcna169154"
  },
  {
    "text": "Trump's ‘Beautiful’ World  —  The former president boasts he has “the best words.”  But his favorite by far?  “Beautiful.”  —  “I know words.  I have the best words,” Donald Trump told a South Carolina crowd as he campaigned for the Republican primary in December 2015.",
    "url": "https://www.politico.com/news/magazine/2024/09/01/mag-trump-beautiful-test-00174449"
  },
  {
    "text": "Denying rights to migrants ends up eroding the civil liberties of Americans  —  As Donald Trump fights to become America's next “Deporter-in-Chief,” he wants to keep all eyes on the border, particularly on migrants.  A day after telling the National Association of Black Journalists that migrants will … ",
    "url": "https://thehill.com/opinion/immigration/4856201-denying-rights-to-migrants-ends-up-eroding-the-civil-liberties-of-americans/"
  },
  {
    "text": "How Authoritarians Target Universities  —  Welcome back to Lucid, and hello to all new subscribers.  Our next Q&A is tonight, Sunday, Sept. 1, 8-9pmET.  Our guest will be Jason Stanley, Jacob Urowski Professor of Philosophy at Yale University and author of the forthcoming book Erasing History … ",
    "url": "https://lucid.substack.com/p/how-authoritarians-target-universities"
  },
  {
    "text": "Former Commerce secretary warns Trump against being too ‘strong’ in debating Harris  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4857429-former-commerce-secretary-warns-trump-against-being-too-strong-in-debating-harris/"
  }
]