[
  {
    "text": "Fani Willis admits relationship with prosecutor on Trump Georgia case  —  ATLANTA — Fulton County District Attorney Fani T. Willis (D) admitted she had a personal relationship with an outside prosecutor she appointed to manage the election interference case against former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/02/fani-willis-response-accusations/"
  },
  {
    "text": "Fani Willis just killed any chance Trump had to kick her off his case: legal expert  —  Fulton County District Attorney Fani Willis finally admitted on Friday that she was romantically involved with one of her special prosecutors, Nathan Wade — but the details she and Wade have now revealed destroy … ",
    "url": "https://www.rawstory.com/trump-fani-willis-affair/"
  },
  {
    "text": "Trump's Lackeys Have Found Fani Willis' Weakness  —  They are making a cynical move to derail or delay the case.  Here's what she should do to stop it. … The racketeering case that Fulton County District Attorney Fani Willis brought against Donald Trump and 18 MAGA minions is so strong … ",
    "url": "https://www.thedailybeast.com/trumps-lackey-jim-jordan-has-found-fani-willis-weakness"
  },
  {
    "text": "Fani Filing: A Fling Is Fine, So F Off  —  Sometimes, the best defense is a good offense.  And sometimes, offense is just a desperate ploy.  —  Fani Willis and Nathan Wade faced a deadline today to respond to the disqualification motion filed by RICO defendant Michael Roman that alleges a personal conflict of interest.",
    "url": "https://hotair.com/ed-morrissey/2024/02/02/fani-filing-a-fling-is-fine-so-f-off-n609212"
  },
  {
    "text": "Most Republicans aren't aware of Trump's various legal issues  —  There is an assumption, probably particularly among those who cover the news and those who read it, that Donald Trump's legal travails are common knowledge.  We talk about things like the potential effects of a Trump conviction … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/02/most-republicans-arent-aware-trumps-various-legal-issues/"
  },
  {
    "text": "Trump Campaign Paid $20K to Fake a Union Rally  —  When Joe Biden became the first president to join a picket line this past September for the UAW, the Trump campaign scrambled to do something to counter the move.  Michigan is a critical state for both campaigns, and when auto workers went … ",
    "url": "https://www.meidastouch.com/news/trump-campaign-paid-20k-to-fake-a-union-rally"
  },
  {
    "text": "U.S. retaliatory strikes start in Iraq and Syria in first response to Jordan drone attack  —  The military action is a significant escalation in Washington's bid to deter the growing threat from Iran-backed groups across the Middle East.  —  The United States launched attacks in the Iraq … ",
    "url": "https://www.nbcnews.com/news/world/us-retaliatory-strikes-start-iraq-syria-first-response-jordan-drone-at-rcna136928"
  },
  {
    "text": "It's The Impunity, Stupid  —  The very first time I decided to actually look into whether Tesla was doing what it said it was doing, I spent a long weekend discovering that its revolutionary battery swap station was a sham designed to rip off California's Zero Emission Vehicle program.",
    "url": "https://niedermeyer.io/2024/02/02/its-the-impunity-stupid/"
  },
  {
    "text": "It's Crazy That the Booming Economy Is Hurting Biden … The closer we get to the election, the harder it becomes to explain the polls by any material basis.  The primary explanation for President Joe Biden's disastrous polling has been that voters believe the economy has been poor.",
    "url": "https://nymag.com/intelligencer/2024/02/jobs-report-biden-bideonomics-campaign-economy-trump.html"
  },
  {
    "text": "Judge will delay Trump's federal trial as court considers his presidential immunity claim  —  Judge Tanya Chutkan called off the March 4 trial date in an order on Friday, saying she will set a new date after Trump's immunity appeal is resolved.  —  WASHINGTON — Former President Donald … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-will-delay-trumps-federal-trial-court-considers-presidential-imm-rcna137045"
  },
  {
    "text": "Supreme Court won't block West Point from considering race in admissions  —  The Supreme Court ruled the U.S. Military Academy at West Point may continue using race as a factor in admissions, leaving intact the slim remains of affirmative action in higher education.",
    "url": "https://thehill.com/regulation/court-battles/4440145-supreme-court-wont-block-west-point-race-admissions/"
  },
  {
    "text": "Tommy Tuberville May Yet Pay for His Antics, if House Dems Have Their Way  —  Democrats on the House Oversight Committee on Friday called for an investigation into Senator Tommy Tuberville's blockade on military promotions.  —  Tuberville single-handedly blocked hundreds of military promotions … ",
    "url": "https://newrepublic.com/post/178713/tommy-tuberville-pay-military-blockade-house-democrats"
  },
  {
    "text": "Ryan Samsel, Jan. 6 defendant who instigated breach, convicted of multiple felonies  —  Samsel and four others were convicted of participating in the “civil disorder” wrought by the mob and of assaulting police officers.  —  The Jan. 6 defendant widely seen as the instigator of the violent breach … ",
    "url": "https://www.politico.com/news/2024/02/02/ryan-samsel-jan-6-defendant-00139344"
  },
  {
    "text": "Texas border showdown is far-right magnet, hate trackers warn  —  As a convoy gathers in Eagle Pass, extremism monitors see vestiges of the Jan. 6, 2021, attack on the U.S. Capitol in Texas Gov. Greg Abbott's defiance of federal orders  —  EAGLE PASS, Tex. — A motley crew is gathering here this weekend … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/02/eagle-pass-texas-border-convoy/"
  },
  {
    "text": "CNN Anchor Stunned Into Silence After Panelist Explains Why Illegals Don't Stay in Florida  —  CNN anchor Erica Hill was stunned into silence on Friday morning after a panelist explained to her why illegal immigrants don't stay in Florida.  —  The exchange came after four illegal immigrants … ",
    "url": "https://redstate.com/bonchie/2024/02/02/cnn-anchor-stunned-into-silence-after-panelist-explains-why-illegals-dont-stay-in-florida-n2169541"
  },
  {
    "text": "Roberta Kaplan says Trump threw papers across table at Mar-a-Lago deposition because his legal team agreed to feed her lunch  —  Attorney Roberta Kaplan said former President Donald Trump threw papers across a table and stormed off during a deposition at Mar-a-Lago after learning that his legal team had agreed to provide her lunch.",
    "url": "https://www.cnn.com/2024/02/01/politics/roberta-kaplan-donald-trump-deposition-maralago/"
  },
  {
    "text": "As Kids, They Thought They Were Trans.  They No Longer Do.  —  Grace Powell was 12 or 13 when she discovered she could be a boy.  —  Growing up in a relatively conservative community in Grand Rapids, Mich., Powell, like many teenagers, didn't feel comfortable in her own skin.",
    "url": "https://www.nytimes.com/2024/02/02/opinion/transgender-children-gender-dysphoria.html"
  },
  {
    "text": "CENTCOM Statement on U.S. Strikes in Iraq and Syria  —  TAMPA, Fla. - At 4:00 p.m. (EST) Feb. 02, U.S. Central Command (CENTCOM) forces conducted airstrikes in Iraq and Syria against Iran's Islamic Revolutionary Guards Corps (IRGC) Quds Force and affiliated militia groups.",
    "url": "https://www.centcom.mil/MEDIA/PRESS-RELEASES/Press-Release-View/Article/3665602/centcom-statement-on-us-strikes-in-iraq-and-syria/"
  }
]