[
  {
    "text": "Trump administration poised to accept ‘palace in the sky’ as a gift for Trump from Qatar: Sources  —  The luxury jumbo jet is to be used as Air Force One, sources told ABC News.  —  In what may be the most valuable gift ever extended to the United States from a foreign government … ",
    "url": "https://abcnews.go.com/Politics/trump-administration-poised-accept-palace-sky-gift-trump/story?id=121680511"
  },
  {
    "text": "Trump Is to Accept a Luxury 747 From Qatar for Use as Air Force One  —  The plan raises substantial ethical issues, given the immense value of the lavishly-appointed plane and the fact that Mr. Trump plans to use it after he leaves office.  —  The Trump administration plans to accept … ",
    "url": "https://www.nytimes.com/2025/05/11/us/politics/trump-qatar-jet-gift-air-force-one.html"
  },
  {
    "text": "Qatar says no final decision made on gifting Trump a jet to use as Air Force One  —  President Donald Trump reportedly is ready to accept a luxury Boeing 747-8 jumbo jet as a gift from the ruling family of Qatar during his trip to the Middle East this coming week, and U.S. officials … ",
    "url": "https://apnews.com/article/trump-qatar-gift-jet-air-force-one-7f9afb461c6b3ac16fca3bb0973715ff"
  },
  {
    "text": "Trump Administration Live Updates: Trump Is Said to Be Getting Qatari 747 for Air Force One, and Post-Presidency Travel  —  Where Things Stand  — Air Force One: The Trump administration plans to accept a luxury Boeing 747-80 plane from the Qatari royal family that will be upgraded to serve … ",
    "url": "https://www.nytimes.com/live/2025/05/11/us/trump-news?unlocked_article_code=1.GU8.y_Ln.HmcGQM3_ooo0&smid=url-share"
  },
  {
    "text": "U.S. officials say ‘substantial progress’ made in China trade talks  —  The White House said it was announcing a trade deal without providing any details.  Representatives from the U.S. and China had been meeting in Switzerland.  —  Bessent: ‘Substantial progress’ in US-China trade talks",
    "url": "https://www.washingtonpost.com/business/2025/05/11/us-china-trade-talks-switzerland/"
  },
  {
    "text": "Flights Could Be Disrupted Across U.S., Transportation Secretary Warns  —  After a series of problems at Newark Liberty International Airport, the secretary, Sean Duffy, said he would meet with airline leaders on Wednesday to plan to scale back Newark flights.",
    "url": "https://www.nytimes.com/2025/05/11/nyregion/newark-airport-flight-disruptions-duffy.html?unlocked_article_code=1.GU8.jg6x.m8ofFo8O4sXJ&smid=url-share"
  },
  {
    "text": "How Tariffs Are Crushing Small Businesses: ‘Nobody in Power Seems to Care’  —  Owners are laying off staff and tapping personal savings, hoping to hold out until a trade deal with China; an $8,752 fee on a $5,649 order  —  The owner of a San Francisco card-game company cashed in his money-market funds.",
    "url": "https://www.wsj.com/business/entrepreneurship/small-business-tariffs-e6dfaccb?st=YG4MXP&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Dem Crypto Ally Defends Fundraiser With Trump Crypto Donor  —  Democrats have gotten too “pure,” Arizona Sen. Ruben Gallego argued at a Pennsylvania town hall to explain his ties to crypto investor Marc Andreessen  —  Sen. Ruben Gallego (D-Ariz.) traveled to Pennsylvania for a town hall … ",
    "url": "https://www.rollingstone.com/politics/politics-news/gallego-democrat-crypto-fundraiser-andreessen-trump-1235336588/"
  },
  {
    "text": "Barrasso: 'I don't believe' suggested habeas corpus suspension will ‘come to Congress’  —  Senate Majority Whip John Barrasso (R-Wyo.) said he doesn't believe that the White House's suggested habeas corpus suspension will reach Congress.  —  During an appearance on NBC's “Meet The Press” … ",
    "url": "https://thehill.com/homenews/sunday-talk-shows/5294430-barrasso-habeas-corpus-suspension-congress/"
  },
  {
    "text": "Proposal Cutting Medicaid Aims for GOP Middle Ground  —  House bill is set to include work requirements but not deeper reductions some fiscal hawks demanded  —  WASHINGTON—House Republicans are releasing their plan to cut Medicaid spending, with the program's defenders in the GOP appearing … ",
    "url": "https://www.wsj.com/politics/policy/house-republicans-medicaid-cuts-8164a810"
  },
  {
    "text": "Trump to sign executive order he says will slash drug prices by up to 80%  —  Trump calls out Democrats and announces plans to drop prices of prescription drugs ‘almost immediately’  —  President Donald Trump announced he plans to sign an executive order on Monday that will reduce the cost … ",
    "url": "https://www.foxnews.com/politics/trump-sign-executive-order-he-says-slash-drug-prices-up-80"
  },
  {
    "text": "White South Africans Granted Refugee Status by Trump Leave for U.S.  —  Dozens of Afrikaners who claim discrimination in their home country left Johannesburg on Sunday.  Their departure for the U.S. came as the Trump administration was halting virtually all refugee admissions.",
    "url": "https://www.nytimes.com/2025/05/11/world/africa/white-south-africans-granted-refugee-status-by-trump-leave-for-us.html"
  },
  {
    "text": "Pope Leo XIV calls for peace in Ukraine and Gaza in symbolically rich blessing on Mother's Day  —  Pope Leo XIV called for a genuine and just peace in Ukraine and an immediate ceasefire in Gaza, in his first Sunday noon blessing as pontiff that featured some symbolic gestures suggesting a message of unity in a polarized Catholic Church.",
    "url": "https://apnews.com/article/vatican-pope-leo-xiv-a16ff59f75260ca8baf5d90890523766"
  },
  {
    "text": "Fake pizza orders sent to judges seen as threat to judicial safety  —  Amid legal challenges to the Trump administration, judges in at least seven states say they have received anonymous pizza deliveries seen as threats.  —  Federal judges say unsolicited pizza deliveries to jurists' homes … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/11/justice-judges-threats-intimidation-pizza-deliveries/"
  },
  {
    "text": "In Mideast, Trump plans to focus on business deals, not geopolitics  —  The trip is expected to focus primarily on cementing trade ties.  On the heels of Trump Organization business deals in the region, it also showcases the blurring of Trump's private business ventures with foreign policy.",
    "url": "https://www.washingtonpost.com/politics/2025/05/11/trump-mideast-trip/"
  },
  {
    "text": "Elon Musk's regulatory troubles have begun to melt away in Trump's second term  —  The Trump administration has halted some regulatory matters involving Musk's companies and fired people from agencies investigating Tesla, SpaceX and Neuralink.  —  Tech billionaire Elon Musk's regulatory problems have started to fade into the past.",
    "url": "https://www.nbcnews.com/tech/elon-musk/elon-musks-regulatory-issues-begun-melt-away-trumps-second-term-rcna202848"
  },
  {
    "text": "The hidden ways Trump, DOGE are shutting down parts of the U.S. government  —  Limits on spending have incapacitated parts of agencies as varied as the National Park Service and the Pentagon.  —  At the Environmental Protection Agency, research at 11 laboratories has ground to a halt … ",
    "url": "https://www.washingtonpost.com/nation/2025/05/11/trump-government-operations-halt-funding-cuts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2OTM2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4MzE4Mzk5LCJpYXQiOjE3NDY5MzYwMDAsImp0aSI6IjY0NzcxZDliLTc5ZGUtNGQxMy1hZDk0LTg1MjExZDZiNDI1MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vMjAyNS8wNS8xMS90cnVtcC1nb3Zlcm5tZW50LW9wZXJhdGlvbnMtaGFsdC1mdW5kaW5nLWN1dHMvIn0.UmcilYpN3kgfVtnfXSXiHlWr5JfXu6XkuCb0cgaxKGs&itid=gfta"
  },
  {
    "text": "AOC Isn't Ruling Anything Out, Including the White House  —  Alexandria Ocasio-Cortez's rise to prominence worries some Democrats who say the base is taking the wrong lessons from the 2024 election  —  Rep. Alexandria Ocasio-Cortez (D., N.Y.) was standing in front of thousands of angry Democrats … ",
    "url": "https://www.wsj.com/politics/alexandria-ocasio-cortez-political-future-1b1ad7cc"
  },
  {
    "text": "A Republican push to sell public lands in the West is reigniting a political fight  —  Congressional Republicans say their plan to sell potentially hundreds of thousands of acres of federal land will generate revenue and ease growth pressures in booming Western cities.",
    "url": "https://apnews.com/article/west-public-lands-sale-republicans-e153dcb4d4391dd849e4409123bfecfe"
  }
]