[
  {
    "text": "Arizona attorney general asks for Jack Smith's full case file  —  Arizona Attorney General Kris Mayes (D) has requested access to special counsel Jack Smith's case file for his 2020 election subversion prosecution of President-elect Trump, citing her case against several of his allies.",
    "url": "https://thehill.com/regulation/court-battles/5082349-arizona-attorney-general-kris-mayes/"
  },
  {
    "text": "Jen Rubin exits Washington Post, joins Norm Eisen to launch new outlet countering ‘authoritarian threat’  —  New York CNN  —  Veteran opinion columnist Jennifer Rubin is becoming the latest in a long list of Washington Post figures to leave the troubled institution.",
    "url": "https://www.cnn.com/2025/01/13/media/jennifer-rubin-norm-eisen-contrarian-washington-post/"
  },
  {
    "text": "I Have Resigned from The Washington Post, effective today  —  Corporate and billionaire owners of major media outlets have betrayed their audiences' loyalty and sabotaged journalism's sacred mission — defending, protecting and advancing democracy.  The Washington Post's billionaire owner … ",
    "url": "https://contrarian.substack.com/p/i-have-resigned-from-the-washington"
  },
  {
    "text": "Begun, the MAGA Wars Have  —  1. #TeamBannon  —  Over the weekend Steve Bannon unleashed on Elon Musk: … That was Bannon's marker.  His actual critique of Musk?  Buckle up, Francis. … Bannon went on to describe Musk's preferred objective as “techno-feudalism.”  —  Some observations:",
    "url": "https://www.thebulwark.com/p/begun-the-maga-wars-have-133"
  },
  {
    "text": "Johnson confirms ‘discussions’ on tying wildfire aid to debt limit  —  House Speaker Mike Johnson confirmed to reporters Monday there's “been some discussion” of tying California wildfire aid to a debt limit increase, after GOP members raised the issue with Donald Trump in several meetings … ",
    "url": "https://www.politico.com/live-updates/2025/01/13/congress/johnson-wildfire-california-debt-limit-00197900"
  },
  {
    "text": "Statement from President Biden Announcing the Names of CVN 82 and CVN 83  —  I am proud to announce that the next two Gerald R. Ford-class nuclear-powered aircraft carriers will be named for two former presidents: Bill Clinton and George W. Bush.  —  When I personally delivered the news to Bill and George, they were deeply humbled.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/13/statement-from-president-biden-announcing-the-names-of-cvn-82-and-cvn-83/"
  },
  {
    "text": "Maybe It Was Never About the Factory Jobs  —  The theory that populist economic policies can win back the working class for Democrats has been tried, and it has failed.  —  if there was any place in America where President Joe Biden's economic agenda ought to have won him votes, it would have been Lordstown, Ohio.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/01/biden-economic-populism-failure/681289/?gift=MEpCTQExoFIUxpSYhsgq4h9ejtl-jZIYXEk2wEKbqBo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "The people should own the town square  —  For any enquiry regarding this announcement, please contact press@joinmastodon.org  —  Mastodon was founded on the principles that people should be able to control their social circle online, curate their own timeline, and convene freely with any community of their choosing.",
    "url": "https://blog.joinmastodon.org/2025/01/the-people-should-own-the-town-square/"
  },
  {
    "text": "Trump team is questioning civil servants at National Security Council about commitment to his agenda  —  Incoming senior Trump administration officials have begun questioning career civil servants who work on the White House National Security Council about who they voted for in the 2024 election … ",
    "url": "https://apnews.com/article/trump-biden-nsc-loyalty-waltz-21913da0464f472cb9fef314fed488e5"
  },
  {
    "text": "House GOP crafts bill to let Trump purchase Greenland … - Rep. Marjorie Taylor Greene (R-Ga.) last week introduced a bill that would have the Gulf of Mexico renamed the “Gulf of America” on official documents and maps.  — Rep. Dusty Johnson (R-S.D.) also introduced a bill last week along … ",
    "url": "https://www.axios.com/2025/01/13/trump-buy-greenland-house-republican-bill"
  },
  {
    "text": "The Pitched Battles for Partisan Control in State Legislatures  —  As state legislatures convene, they face the same political polarization seen in Congress.  Some are in near-deadlock.  —  In Minnesota, Democratic legislators are threatening to stay away from the state capitol this week … ",
    "url": "https://www.nytimes.com/2025/01/13/us/state-legislatures-polarized-republican-democrat.html"
  },
  {
    "text": "Suspect arrested with ‘flamethrower’ near LA Fire is an illegal immigrant: sources  —  The homeless man tackled and zip-tied by onlookers who say he was trying to start fires with a blowtorch near a Los Angeles wildfire is an illegal immigrant who will likely be protected by California's sanctuary city status, according to sources.",
    "url": "https://nypost.com/2025/01/13/us-news/suspect-arrested-with-flamethrower-near-kenneth-fire-is-an-illegal-immigrant-report/"
  },
  {
    "text": "In Praise of California  —  It has its flaws — what place doesn't? — but it plays a big role in America's greatness  —  One of the unwritten rules of American politics is that it's OK to sneer at and smear our big cities and the people who live in them, while it's an outrageous act … ",
    "url": "https://paulkrugman.substack.com/p/in-praise-of-california"
  },
  {
    "text": "North Carolina Judge Denies Republicans' Request To Toss 60,000 Ballots  —  Today, a North Carolina judge rejected a request from the Republican National Committee (RNC), North Carolina GOP, Wake County GOP and two voters to toss out nearly 60,000 ballots cast in all November 2024 statewide races.",
    "url": "https://www.democracydocket.com/news-alerts/north-carolina-judge-denies-republicans-request-to-toss-60000-ballots/"
  },
  {
    "text": "Childhood Vaccination Rates Were Falling Even Before the Rise of R.F.K. Jr.  —  The declines began with the pandemic, well before routine vaccines became part of the national political conversation.  —  After years of holding steady, American vaccination rates against once-common childhood diseases have been dropping.",
    "url": "https://www.nytimes.com/interactive/2025/01/13/upshot/vaccination-rates.html?unlocked_article_code=1.o04.-54J.L7I8YUkVd6ks&smid=url-share"
  },
  {
    "text": "Gavin Newsom and California Democrats reach $50M deal to Trump-proof the state  —  The first-of-its-kind agreement would fund litigation against the incoming White House and protect against a potential mass deportation of immigrants.  —  SACRAMENTO, California — California Democrats … ",
    "url": "https://www.politico.com/news/2025/01/13/newsom-california-democrats-trump-legal-fights-00197784"
  },
  {
    "text": "Team Trump Suddenly Backtracks on Key Campaign Promise  —  Donald Trump is backtracking on his big campaign promise to end the Ukraine war in 24 hours, according to his special envoy to Ukraine.  —  On Sunday, Keith Kellogg told Fox News that the Russia-Ukraine war would come to a “solvable solution in the near term.”",
    "url": "https://newrepublic.com/post/190143/trump-promise-ukraine-war-end-backtrack"
  },
  {
    "text": "Public health experts, scientists warn senators on confirming RFK Jr  —  A new coalition of more than 700 public health professionals, scientists and activists signed an open letter to oppose Senate confirmation of Robert F. Kennedy Jr. as health secretary, saying his “fringe” … ",
    "url": "https://thehill.com/policy/healthcare/5083253-public-health-experts-scientists-warn-senators-on-confirming-rfk-jr/"
  },
  {
    "text": "Meta Is Blocking Links to Decentralized Instagram Competitor Pixelfed  —  Meta is deleting links to Pixelfed, a decentralized Instagram competitor.  On Facebook, the company is labeling links to Pixelfed.social as “spam” and deleting them immediately.  —  Pixelfed is an open-source … ",
    "url": "https://www.404media.co/meta-is-blocking-links-to-decentralized-instagram-competitor-pixelfed/"
  },
  {
    "text": "Village People to perform at Trump rally in DC, inaugural ball  —  The Village People, performers of Trump rally staples like “Macho Man” and “YMCA,” are set to bring those songs to the nation's capital as part of President-elect Trump's inauguration festivities.",
    "url": "https://thehill.com/blogs/in-the-know/5083042-village-people-performing-trump-inauguration/"
  },
  {
    "text": "Biden's parting gift: Student loan debt relief  —  More than 5 million borrowers have had loans forgiven since the president took office.  —  In the waning days of Joe Biden's presidency, his administration announced on Monday that it will provide student debt relief to 150,000 borrowers.",
    "url": "https://www.politico.com/news/2025/01/13/biden-student-loan-relief-150000-borrowers-00197855"
  },
  {
    "text": "Biden Aides Warned Putin as Russia's Shadow War Threatened Air Disaster  —  The White House scrambled to get a message to President Vladimir V. Putin of Russia last year after U.S. intelligence agencies said a Russian military unit was preparing to send explosive packages on cargo planes.",
    "url": "https://www.nytimes.com/2025/01/13/us/politics/russia-putin-airplane-shadow-war.html"
  },
  {
    "text": "Trump Team Studies Gradual Tariff Hikes Under Emergency Powers  — Plan would boost import duties 2%-5% a month on trade partners  — Supporters include Trump advisers Bessent, Hassett and Miran  —  Members of President-elect Donald Trump's incoming economic team are discussing slowly ramping … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-13/trump-team-studies-gradual-tariff-hikes-under-emergency-powers"
  },
  {
    "text": "More than 400 civil rights groups call on Congress to reject transgender athlete ban  —  More than 400 LGBTQ and civil rights groups on Monday urged lawmakers to reject legislation that would bar transgender athletes from competing in women's sports, claiming the measure … ",
    "url": "https://thehill.com/homenews/lgbtq/5083235-lgbtq-civil-rights-groups-oppose-transgender-athlete-ban/"
  },
  {
    "text": "Biden says his foreign policy gives Trump ‘a strong hand’  —  The president defended his alliance-based foreign policy as the world prepares for another round of America First.  —  President Joe Biden on Monday defended his foreign policy record amid two major foreign wars that broke out under his watch … ",
    "url": "https://www.politico.com/news/2025/01/13/biden-foreign-policy-trump-003659"
  }
]