[
  {
    "text": "21 federal technology staffers resign rather than help Musk and DOGE slash size of government  —  More than 20 civil service employees resigned Tuesday from billionaire Trump adviser Elon Musk's Department of Government Efficiency, saying they were refusing to use their technical expertise to “dismantle critical public services.”",
    "url": "https://apnews.com/article/doge-elon-musk-federal-government-resignations-usds-6b7e9b7022e6d89d69305e9510f2a43c"
  },
  {
    "text": "DOGE Quietly Deletes the 5 Biggest Spending Cuts It Celebrated Last Week  —  The cuts, highlighted on an earlier version of the “wall of receipts” posted by Elon Musk's team, contained mistakes that vastly inflated the amount of money saved.  —  Last week, Elon Musk's government cost-slashing initiative … ",
    "url": "https://www.nytimes.com/2025/02/25/upshot/doge-spending-cuts-changed.html?unlocked_article_code=1.zk4.b82f.Kh1AnGbHOfOG&smid=url-share"
  },
  {
    "text": "Nearly 40% of contracts canceled by Musk's DOGE are expected to produce no savings  —  Nearly 40% of the federal contracts that President Donald Trump's administration claims to have canceled as part of its signature cost-cutting program aren't expected to save the government any money, the administration's own data shows.",
    "url": "https://apnews.com/article/doge-federal-contracts-canceled-musk-trump-cuts-a65976a725412934ad686389889db0df"
  },
  {
    "text": "Slashing Medicaid to Pay for Trump's Tax Cuts Could Lead to Vast State Shortfalls  —  Republicans have proposed lowering the federal share of costs for Medicaid expansions, which could reshape the program by gutting one of the Affordable Care Act's major provisions.",
    "url": "https://www.nytimes.com/2025/02/25/us/politics/medicaid-cuts-republican-budget.html"
  },
  {
    "text": "It's crunch time for Mike Johnson and the GOP's ‘big, beautiful bill’  —  The House speaker is set to put a budget resolution up for a floor vote on Tuesday but is facing a potential revolt from swing-district Republicans.  —  Republicans' push to enact President Donald Trump's tax … ",
    "url": "https://www.washingtonpost.com/business/2025/02/25/johnson-reconciliation-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNDU5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxODM4Mzk5LCJpYXQiOjE3NDA0NTk2MDAsImp0aSI6ImM5Mjg5NDQ5LWQ2ZTgtNDM0OC1iNGU2LTg5M2NlYWJkMjI3OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzI1L2pvaG5zb24tcmVjb25jaWxpYXRpb24tdHJ1bXAvIn0.fVFb6i0nEjBd_vwjBk6Q6Ltv4l5uuIotXccAgF_TNLw"
  },
  {
    "text": "Trump allies circulate mass deportation plan calling for ‘processing camps’ and a private citizen ‘army’  —  The group, led by Blackwater veteran Erik Prince, has close Trump ties.  —  A group of prominent military contractors, including former Blackwater CEO Erik Prince … ",
    "url": "https://www.politico.com/news/2025/02/25/documents-military-contractors-mass-deportations-022648"
  },
  {
    "text": "This Shocking Moment at a GOP Town Hall in Idaho Is a Foreboding Sign  —  Teresa Borrenpohl later told the Coeur d'Alene/Post Falls Press that, as it happened, she didn't know if it was an arrest or a kidnapping.  She was seated in a nearly full town hall hosted by the Kootenai County Republican Central Committee on Saturday.",
    "url": "https://newrepublic.com/article/191908/gop-town-hall-idaho-lear"
  },
  {
    "text": "Big, Big Scandal Brewing at DC US Attys Office … There's a big, big scandal brewing beneath the already big scandal of the alleged assault by Florida congressman Corey Mills (R).  But as yet no one seems inclined to pull on the dangling thread.  As you've probably already seen … ",
    "url": "https://talkingpointsmemo.com/edblog/big-big-scandal-brewing-at-dc-us-attys-office"
  },
  {
    "text": "RED ALERT: Now Is the Moment, Folks … Over recent weeks I've told you several times that while Democrats are shut out of power in Washington and few means of arresting the Trump-Musk spree of criminal conduct across the executive branch they do have two points of leverage: the need for a new … ",
    "url": "https://talkingpointsmemo.com/edblog/red-alert-now-is-the-moment-folks"
  },
  {
    "text": "White House official pushes to axe Canada from Five Eyes intelligence group  —  Peter Navarro wants to increase pressure on country that Donald Trump has threatened to annex  —  A top White House official has proposed expelling Canada from the Five Eyes intelligence-sharing network … ",
    "url": "https://www.ft.com/content/2dfa3c11-64a7-49f6-83df-939b8d1cfb8e"
  },
  {
    "text": "White House seizes control of press pool, will decide which outlets cover events with president  —  The move reverses the long established precedent of journalists determining who participates in the press pool.  —  The White House announced on Tuesday that the administration … ",
    "url": "https://www.politico.com/news/2025/02/25/trump-white-house-press-pool-access-00206001"
  },
  {
    "text": "Judge blocks Trump's executive order suspending refugee admissions to the U.S.  —  The Seattle-based judge's injunction blocks key components of one of Trump's Day One executive orders.  —  A federal judge has blocked President Donald Trump's executive order implementing an indefinite … ",
    "url": "https://www.politico.com/news/2025/02/25/trump-refugee-executive-order-injunction-federal-judge-00206016"
  },
  {
    "text": "Ukraine agrees minerals deal with US  —  Kyiv hopes agreement on jointly exploring resources will improve relations with Trump administration  —  Kyiv has agreed terms with Washington on a minerals deal that Ukrainian officials hope will improve relations with the Trump administration … ",
    "url": "https://www.ft.com/content/1890d104-1395-4393-a71d-d299aed448e6?accessToken=zwAAAZU-aRdLkc8YkNEEE5VDk9OnHdKZrtRI5g.MEUCIH6zPwj2DIjUCuIiJRKw87FNWYqsd-Y24NSOfyUBhXCEAiEAq9xHBCnBuaCRJTwFmc3nHO8Fp7lRT6vGHZRnQWltusA&segmentId=e95a9ae7-622c-6235-5f87-51e412b47e97&shareId=fb705b02-cb2e-4bdd-b6e4-5e1b66c87949&shareType=enterprise"
  },
  {
    "text": "DOGE Is Working on Software That Automates the Firing of Government Workers  —  Operatives working for Elon Musk's DOGE appear to be editing the code of AutoRIF—software designed by the Defense Department that could assist in mass firings of federal workers, sources tell WIRED.",
    "url": "https://www.wired.com/story/doge-autorif-mass-firing-government-workers/"
  },
  {
    "text": "The Best Thing Democrats Can Do in This Moment  —  The Republican Party is all too often effective at campaigning and winning elections, but there's another fact about it that a lot of Americans forget: The Republican Party flat out sucks at governing.  Even Tucker Carlson agrees with this.",
    "url": "https://www.nytimes.com/2025/02/25/opinion/democrats-trump-congress.html"
  },
  {
    "text": "Supreme Court orders new trial for death row inmate Glossip  —  The Oklahoma case has attracted broad support after the state's top law enforcement official revealed prosecutorial misconduct.  —  A divided Supreme Court on Tuesday took the extraordinary step of ordering a new trial … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/25/richard-glossip-death-penalty-supreme-court-new-trial/"
  },
  {
    "text": "‘Unknown disease’ that can kill within days leaves 53 dead in Congo  —  World Health Organization officials said the outbreak appeared to originate from a village where three children died after reportedly eating a bat carcass.  —  An unknown illness has killed 53 people in a northwest region … ",
    "url": "https://www.washingtonpost.com/world/2025/02/25/unknown-illness-hemorrhagic-fever-congo-africa/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNDU5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxODM4Mzk5LCJpYXQiOjE3NDA0NTk2MDAsImp0aSI6ImJhYWIxZGM4LTA5OTUtNDk3YS05YmNhLTVhN2EwZmQwMTY5MiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzAyLzI1L3Vua25vd24taWxsbmVzcy1oZW1vcnJoYWdpYy1mZXZlci1jb25nby1hZnJpY2EvIn0.LZoXmv8Vb_8BfzLDtvm9SupjbNZSDIyWm8pgJ0vr4ig"
  },
  {
    "text": "US threatens permanent visa bans on trans athletes based on sex markers  —  Exclusive: State department memo directs officers to bar those deemed to misrepresent birth sex on applications  —  The US state department has ordered officials worldwide to deny visas to transgender athletes attempting … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/25/visa-ban-transgender-athletes"
  },
  {
    "text": "Canadians to Elon Musk: You're not one of us  —  “People are really angry,” Ottawa lawmaker says of petition to revoke the citizenship of Trump's unofficial right-hand man.  —  OTTAWA — More than 242,000 Canadians have signed a petition calling for Elon Musk's passport and citizenship … ",
    "url": "https://www.politico.com/news/2025/02/25/canada-musk-petition-revoke-citizenship-00205964"
  },
  {
    "text": "Musk's Starlink gets FAA contract, raising new conflict of interest concerns  —  New York CNN  —  The Federal Aviation Administration has agreed to use SpaceX's Starlink internet system to upgrade the information technology networks it uses to manage US airspace, raising new concerns … ",
    "url": "https://www.cnn.com/2025/02/25/business/musk-faa-starlink-contract/"
  },
  {
    "text": "Southwest jet attempting to land at Chicago Midway Airport nearly collides with a private plane on the runway  —  A Southwest Airlines plane and a private jet that entered the runway without authorization experienced a close call at Chicago Midway International Airport on Tuesday morning, the Federal Aviation Administration said.",
    "url": "https://www.cnn.com/2025/02/25/us/chicago-midway-airport-near-miss-planes"
  },
  {
    "text": "He Left CNN to Start a Newsletter.  It's Now a Must-Read.  —  Oliver Darcy's media newsletter, launched in August, is poaching a CNN editor and on track to top $1 million in annual recurring revenue  —  Oliver Darcy left CNN, one of the most recognized news outlets in the world, to start a newsletter.",
    "url": "https://www.wsj.com/business/media/he-left-cnn-to-start-a-newsletter-its-now-a-must-read-92971fcf?st=7L9D18&reflink=article_copyURL_share"
  },
  {
    "text": "Trump Administration Highlights: Personnel Officials Say Musk's Directive Is ‘Voluntary’  —  Where Things Stand  — Musk's ultimatum: Federal personnel officials walked back Elon Musk's demand that government workers justify their jobs in an email or face termination, saying that his request had been “voluntary.”",
    "url": "https://www.nytimes.com/live/2025/02/24/us/trump-musk-news"
  },
  {
    "text": "America's Food Safety Is Now in the Hands of Don Jr.'s Hunting Buddy  —  As federal health agencies are gutted with abandon, a Florida attorney with a history of hunting with the president's son has been put in charge of food safety at the FDA, overseeing the nation's food supply, infant formula, and more.",
    "url": "https://www.vanityfair.com/news/story/food-safety-donald-trump-jr-kyle-diamantas-hunting-buddy"
  },
  {
    "text": "DOGE's Latest Cut: Glenn Youngkin's Balls  —  However bad you think DOGE's decapitation of USAID was, this report from the Washington Post's Matt Bai suggests it was even worse: … Happy Tuesday.  —  Glenn Youngkin to Fired Federal Workers: Time to Be Productive For a Change  —  by Andrew Egger",
    "url": "https://www.thebulwark.com/p/doge-latest-cut-youngkin-balls-jobs-winsome-sears"
  },
  {
    "text": "DOJ says Trump's Jan. 6 pardon covers man convicted of possessing grenades, classified info  —  It's the latest effort by federal prosecutors to deploy Trump's clemency order broadly.  —  When FBI agents searched Jan. 6 defendant Jeremy Brown's home in 2021, they found a trove of illegal weapons … ",
    "url": "https://www.politico.com/news/2025/02/25/doj-trump-pardons-january-6-00206010"
  },
  {
    "text": "There is No Puzzle About Birthright Citizenship  —  Barnett and Wurman invoke a nonexistent “puzzle” about the law of nations to justify their theory about birthright citizenship.  —  Meet The Authors … It has been a month since President Donald Trump issued an executive order purporting … ",
    "url": "https://www.lawfaremedia.org/article/there-is-no-puzzle-about-birthright-citizenship"
  },
  {
    "text": "Musk Scandal at USAID Takes Ugly Turn, Putting Starving Kids at Risk  —  Ever since Donald Trump and Elon Musk began downsizing the U.S. Agency for International Development, the administration has claimed that aid for lifesaving humanitarian assistance would continue.",
    "url": "https://newrepublic.com/article/191935/usaid-musk-scandal-starving-kids"
  }
]