[
  {
    "text": "As President, Trump Demanded Investigations of Foes.  He Often Got Them. … Former President Donald J. Trump has threatened to carry out a campaign of retribution if he returns to the White House.Roger Kisby for The New York Times  —  It was the spring of 2018 and President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/09/21/us/politics/trump-investigations-enemies.html?unlocked_article_code=1.MU4.aemx.o4cu_iUb-wxt&smid=url-share"
  },
  {
    "text": "Harris accepts CNN debate invitation for October 23, again challenging Trump to another showdown  —  Vice President Kamala Harris on Saturday accepted an invitation from CNN to debate former President Donald Trump on October 23, challenging her rival to another engagement on a public stage in the final weeks of the campaign.",
    "url": "https://www.cnn.com/2024/09/21/politics/presidential-debate-harris-trump-cnn/"
  },
  {
    "text": "Harris fundraising far outpacing Trump's … - Coordinated efforts in August totaled $361 million for Harris and her committees and $130 million for Trump's campaign and associated committees, per Federal Election Commission reports. … That's more than the $130 million that the Trump campaign … ",
    "url": "https://www.axios.com/2024/09/21/harris-fundraising-beats-trump"
  },
  {
    "text": "Trump and his campaign enter turbulent phase in final weeks  —  Whatever control and self-restraint that helped launch Trump's third presidential campaign has largely disappeared.  —  Donald Trump's top advisers have insisted for months that his 2024 bid for the presidency is the most disciplined campaign he has ever run.",
    "url": "https://www.washingtonpost.com/politics/2024/09/21/trump-turbulence-campaign-election/"
  },
  {
    "text": "A dramatic rise in pregnant women dying in Texas after abortion ban  —  Exclusive analysis finds the rate of maternal deaths in Texas increased 56% from 2019 to 2022, compared with just 11% nationwide during the same time period.  —  The number of women in Texas who died while pregnant … ",
    "url": "https://www.nbcnews.com/health/womens-health/texas-abortion-ban-deaths-pregnant-women-sb8-analysis-rcna171631"
  },
  {
    "text": "What Trump has promised to do on ‘day one’ as president  —  Trump has made 41 distinct promises for his first day in office, including mass deportations and banning transgender women from sports.  —  Donald Trump has a long list of executive actions he says he wants to carry out on his potential first day back in the White House.",
    "url": "https://www.washingtonpost.com/politics/2024/09/21/trump-day-one-promises-president-election/"
  },
  {
    "text": "Voter registration is spiking, particularly among young adults  —  Voter registration is breaking records as Election Day approaches, particularly among young people, including many first-time voters.  —  On Tuesday's National Voter Registration Day more than 150,000 people registered through Vote.org … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/21/young-voter-registration-breaking-records-swift/75306021007/"
  },
  {
    "text": "Elon Musk's X Backs Down in Brazil  —  In an abrupt reversal, the social network's lawyers said it was complying with court orders that it had previously defied.  Brazil's Supreme Court could allow the site to return next week.  —  Elon Musk suddenly gave up.",
    "url": "https://www.nytimes.com/2024/09/21/world/americas/elon-musk-x-brazil.html?unlocked_article_code=1.MU4.vF-1.G8FMn_vW3QBK&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb&ngrp=mnp"
  },
  {
    "text": "How influencers flocked to Springfield chasing debunked rumors and attention  —  SPRINGFIELD, Ohio — In a viral video that first appeared on Sept. 10, YouTube content creator Tyler Oliveira interviewed a Springfield, Ohio, resident who claimed he saw Haitian immigrants carrying away “over a hundred cats” in a white van.",
    "url": "https://www.npr.org/2024/09/20/nx-s1-5112682/springfield-influencers-haitian-immigrants-social-media-trump"
  },
  {
    "text": "Activist with far right ties fronts Marco Rubio-linked anti-immigration effort  —  Nate Hochman recorded several videos for America 2100, a thinktank linked to the Republican Florida senator  —  The rightwing activist Nate Hochman, who was fired last year by the Florida governor, Ron DeSantis … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/21/nate-hochman-marco-rubio-anti-immigrant-thinktank-america-2100"
  },
  {
    "text": "America sort of likes Kamala Harris - and that might just be enough  — Kamala Harris and Donald Trump remain enmeshed in an extraordinarily close presidential race.  — Beyond the horse race, Harris is showing clear momentum in metrics like her favorability.",
    "url": "https://www.businessinsider.com/kamala-harris-favorability-polls-reverse-trump-election-2024-9"
  },
  {
    "text": "The deadly consequences of Donald Trump's anti-immigrant hate  —  Scapegoating is the tool of the opportunist — a tactic Donald Trump is utilizing in his presidential campaign to propagate hatred toward immigrants.  —  This time, he has targeted legal Haitian immigrants in Springfield … ",
    "url": "https://thehill.com/opinion/campaign/4890612-trump-attacks-immigrants-violence/"
  },
  {
    "text": "Nebraska switch to winner-take-all electoral votes unlikely before election, despite pressure  —  How a bill becomes a law in the Nebraska Legislature  —  LINCOLN — Nebraska appears unlikely to adopt a winner-take-all model of awarding Electoral College votes, despite renewed pressure … ",
    "url": "https://omaha.com/news/state-regional/government-politics/elections/nebraska-switch-to-winner-take-all-electoral-votes-unlikely-before-election-despite-pressure/article_f5019672-76b6-11ef-bc6b-07ad1d5a3030.html"
  },
  {
    "text": "Doctors ‘fight like hell’ against a second Trump admin: ‘Elections do matter for your health’  —  Some see the politicking as a moral obligation, but others see a threat to the doctor-patient relationship.  —  Doctors are giving nearly twice as much to Democrats as Republicans this cycle … ",
    "url": "https://www.politico.com/news/2024/09/21/doctors-harris-support-public-health-00179165"
  },
  {
    "text": "Kamala Harris posts huge cash advantage over Donald Trump  —  Though Harris outraised Trump more than 4 to 1 in August, her advisers are urging donors to keep giving as wealthy backers power Trump-aligned super PACs.  —  Kamala Harris's campaign raised more than four times … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/20/kamala-harris-fundraising-advantage-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2ODkxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4MjczNTk5LCJpYXQiOjE3MjY4OTEyMDAsImp0aSI6Ijk5NDQzNmNkLWM3MWUtNDQ0OC1iZjAyLTg0NjI4ZDliZmQ3NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzIwL2thbWFsYS1oYXJyaXMtZnVuZHJhaXNpbmctYWR2YW50YWdlLXRydW1wLyJ9.AhtH2QEk0-ZSTjSsUxI46DoBwxKNQnWb0RKwpzK-yzE&itid=gfta"
  },
  {
    "text": "Why Trump's vow to lower grocery costs will backfire, economists warn … - American farmers, Trump said, are being “absolutely decimated” and that one of the reasons is that the U.S. allows “a lot of farm product into our country.” … - The Trump campaign did not respond to Axios' request for comment for details about the plan.",
    "url": "https://www.axios.com/2024/09/21/trump-grocery-prices-food-imports"
  },
  {
    "text": "Trump's Opponents See New Ways to Cast the G.O.P. as ‘Team Misogyny’  —  The issue of gender dominated the campaign over a week that included a scandal in North Carolina and reporting on the fatal fallout of abortion bans.  —  In a race between a Democrat who could be America's … ",
    "url": "https://www.nytimes.com/2024/09/21/us/politics/democrats-republicans-gender-women.html"
  },
  {
    "text": "The Supreme Court expanded gun rights.  That could complicate the Trump assassination attempt case.  —  Ryan Routh is charged with violating the federal ban on former felons possessing guns.  But does that ban violate the Second Amendment?  —  The Supreme Court's recent decisions … ",
    "url": "https://www.politico.com/news/2024/09/21/supreme-court-gun-rights-trump-assassination-attempt-00180350"
  },
  {
    "text": "US soldier who fled to North Korea is free after sentencing  —  U.S. Army Private Travis King, who last year ran into North Korea and was taken into custody there, was sentenced on Friday to one year of confinement then freed based on time already served, his lawyer said in a statement.",
    "url": "https://www.reuters.com/world/us-soldier-who-fled-north-korea-is-free-after-sentencing-2024-09-21/"
  },
  {
    "text": "Arizona's top court says voters missing citizenship proof can receive full ballots  —  Nearly 100,000 voters will receive regular ballots this fall even though there is no record that they submitted citizenship documentation, as is required to vote in state and local elections.",
    "url": "https://www.washingtonpost.com/politics/2024/09/20/arizona-citizenship-voters/"
  },
  {
    "text": "Governor Newsom signs landmark bill to protect kids from social media addiction, takes action on other measures … “Every parent knows the harm social media addiction can inflict on their children - isolation from human contact, stress and anxiety, and endless hours wasted late into the night.",
    "url": "https://www.gov.ca.gov/2024/09/20/governor-newsom-signs-landmark-bill-to-protect-kids-from-social-media-addiction-takes-action-on-other-measures/"
  },
  {
    "text": "Porn site user linked to Mark Robinson also praised Hitler's Mein Kampf  —  The Republican nominee for governor in North Carolina has denied writing the posts, which have upended his campaign in the battleground state.  —  A porn site user linked to North Carolina gubernatorial nominee Mark … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/20/mark-robinson-mein-kampf-porn-posts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2ODA0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4MTg3MTk5LCJpYXQiOjE3MjY4MDQ4MDAsImp0aSI6IjgyMGEyMTdiLTZjZDctNDM1Ni1hY2E4LWU5MzEyM2VhOTEwMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzIwL21hcmstcm9iaW5zb24tbWVpbi1rYW1wZi1wb3JuLXBvc3RzLyJ9.mybCpuzjHEbb8bTH0xZn3gKbKzRwVbKGE1hFwhYdhD4"
  }
]