[
  {
    "text": "Trump allies adopt new strategy for nominees: Make the doubters pay  —  Skeptical Republican senators were singing a different tune about Pete Hegseth on Monday.  —  Donald Trump's transition team entered a critical week of nomination meetings on Capitol Hill with a new head of steam … ",
    "url": "https://www.politico.com/news/2024/12/10/trump-hegseth-controversial-nominee-playbook-00193349"
  },
  {
    "text": "12/10/24 ☀️ AM:  —  Missing: House Republican women chairing committees … Buoyed by continued support from President-elect Donald Trump, the crisis atmosphere enveloping Hegseth's nomination has cooled somewhat, although the former Army National Guard officer and Fox News host … ",
    "url": "https://punchbowl.news/archive/121024-am/"
  },
  {
    "text": "FBI Director Christopher Wray preparing to resign  —  FBI Director Christopher A. Wray plans to resign on or before Inauguration Day, The Washington Times has learned.  —  Mr. Wray is calling it quits because he doesn't want to get fired by President-elect Donald Trump … ",
    "url": "https://www.washingtontimes.com/news/2024/dec/9/christopher-wray-fbi-director-preparing-resign/"
  },
  {
    "text": "Matt Gaetz to join One America News as an anchor, source says  —  Former Florida congressman Matt Gaetz is expected to announce he is joining One America News Network (OAN) as an anchor, a source familiar told CNN.  —  Last month, Gaetz withdrew his name from consideration to serve … ",
    "url": "https://www.cnn.com/2024/12/09/media/matt-gaetz-one-america-news-anchor/"
  },
  {
    "text": "Matt Gaetz gets his own TV show on OAN  —  Former Rep. Matt Gaetz (R-Fla.) has a found an outlet for his sharp tongue and yearning for the limelight: far-right broadcaster One America News Network.  The former lawmaker from Florida's Panhandle and MAGA provocateur will soon host … ",
    "url": "https://www.politico.com/live-updates/2024/12/10/congress/the-matt-gaetz-show-oan-00193429"
  },
  {
    "text": "Nobel Laureates Urge Senate to Turn Down Kennedy's Nomination  —  Elevating Mr. Kennedy to secretary of H.H.S. “would put the public's health in jeopardy,” more than 75 laureates wrote.  —  More than 75 Nobel Prize winners have signed a letter urging senators not to confirm Robert F. Kennedy Jr. … ",
    "url": "https://www.nytimes.com/2024/12/09/health/kennedy-hhs-nobel-laureates.html?unlocked_article_code=1.gE4.oGBh.LR5JFpV5S1fn&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Democrats demand answers from Trump pick Mehmet Oz on ‘Medicare privatization’  —  In a new letter, seven Democratic lawmakers probed “Dr. Oz” on his past support for putting all seniors in Medicare Advantage and questioned whether he has conflicts of interest.",
    "url": "https://www.nbcnews.com/politics/congress/democrats-demand-answers-trump-pick-mehmet-oz-medicare-privatization-rcna183514"
  },
  {
    "text": "Rupert Murdoch Fails in Bid to Change Family Trust  —  A Nevada commissioner ruled resoundingly against Mr. Murdoch, who was trying to give full control of his empire to his son Lachlan and lock in Fox News's right-wing editorial slant.  —  A Nevada commissioner ruled resoundingly … ",
    "url": "https://www.nytimes.com/2024/12/09/business/media/rupert-lachlan-murdoch-family-trust.html?unlocked_article_code=1.gE4.iOYP.Rq-9tE_M2nfz&smid=url-share"
  },
  {
    "text": "Top ‘Washington Post’ editor kills article on deputy's departure  —  As the Washington Post newsroom awaits the appointment of a new top editor, its acting news chief intervened to block an article about the departure of its second-highest-ranking editor, a contender for the position … ",
    "url": "https://www.npr.org/2024/12/09/nx-s1-5222807/washington-post-editor-kills-article-times-bezos"
  },
  {
    "text": "Pennsylvania governor: UnitedHealthcare CEO's killer ‘no hero’  —  Pennsylvania Gov. Josh Shapiro (D) condemned “deeply disturbing” reactions to the fatal shooting of UnitedHealthcare CEO Brian Thompson last week.  —  “Some attention in this case, especially online, has been deeply disturbing … ",
    "url": "https://thehill.com/policy/healthcare/5031852-josh-shapiro-united-healthcare-ceo-shooter-arrest/"
  },
  {
    "text": "Israel's Netanyahu vows to challenge ‘absurd’ corruption charges as he takes the stand in his trial  —  Israeli Prime Minister Benjamin Netanyahu promised defiantly on Tuesday to knock down corruption allegations against him as he began testifying in his long-running trial … ",
    "url": "https://apnews.com/article/israel-netanyahu-corruption-trial-gaza-478c957c7749986d5b8b2d039f670d54"
  },
  {
    "text": "On Issue After Issue, Trump Promises the Moon.  No Word on the Rocket.  —  The president-elect has made some of the most expansive campaign pledges in history.  Some supporters fear that his bravado could undermine his ambitions.  —  In his own telling, President-elect Donald J. Trump wields magical powers … ",
    "url": "https://www.nytimes.com/2024/12/10/us/politics/trump-promises.html"
  },
  {
    "text": "Biden pardoned his son for good reason  —  Even if he's being coy about it. … ☃️  —  President Biden has taken a lot of heat from both Republicans and Democrats over the pardon of his sole surviving son, Hunter.  On the surface, the criticism is valid.",
    "url": "https://www.publicnotice.co/p/joe-biden-hunter-biden-pardon-kash-patel"
  },
  {
    "text": "Three former Democratic Natural Resources Committee leaders endorse Huffman for top spot  —  Three former chairs and ranking members of the House Natural Resources Committee endorsed Rep. Jared Huffman (D-Calif.) to serve as the panel's next Democratic leader, days after outgoing ranking … ",
    "url": "https://thehill.com/policy/energy-environment/5031919-former-democratic-leaders-endorse-jared-huffman-natural-resources-committee/"
  },
  {
    "text": "Some Other America, One I Do Not Know  —  Some people are very upset about the public reaction to the assassination of UnitedHealthcare CEO Brian Thompson.  The killing has generated horror, but also mocking memes, a wave of hostility towards the healthcare industry, and rhetoric that stops barely short of calling the murder justified.",
    "url": "https://www.popehat.com/p/some-other-america-one-i-do-not-know"
  },
  {
    "text": "Kennedy's War on Corn Syrup Brings a Health Crusade to Trump Country  —  When Donald J. Trump said Robert F. Kennedy Jr. could “go wild” on health, he might not have expected his pick for health secretary doing battle against the president-elect's own voters.",
    "url": "https://www.nytimes.com/2024/12/10/us/politics/rfk-jr-corn-trump.html"
  },
  {
    "text": "My Last Column: Finding Hope in an Age of Resentment  —  This is my final column for The New York Times, where I began publishing my opinions in January 2000.  I'm retiring from The Times, not the world, so I'll still be expressing my views in other places.",
    "url": "https://www.nytimes.com/2024/12/09/opinion/elites-euro-social-media.html?unlocked_article_code=1.gU4.PXWQ.F91_ibCOFI4D&smid=url-share"
  },
  {
    "text": "Elon Musk's phishing attack on America  —  Or is it a denial of service (DoS) attack?  Either way, Elon isn't a political actor.  He's a threat actor.  —  One of the most complicating factors in the shock America is about to experience is that the voters who elected Donald Trump have almost no idea what they voted for.",
    "url": "https://iknowhowmuchyoucare.com/elon-musks-phishing-attack-on-america/"
  },
  {
    "text": "Trump Spoke to DeSantis About Choosing Lara Trump for Florida Senate Seat  —  Florida governor will decide who succeeds Sen. Marco Rubio and is considering a range of candidates  —  Lara Trump wants to be the next U.S. senator from Florida, and she has a powerful advocate in her corner: her father-in-law.",
    "url": "https://www.wsj.com/politics/policy/trump-spoke-to-desantis-about-choosing-lara-trump-for-florida-senate-seat-42b37fe6"
  },
  {
    "text": "Trump mocks Prime Minister Justin Trudeau as the ‘governor’ of the ‘Great State of Canada’  —  The president-elect has proposed imposing tariffs on Canada and Mexico that he said would make the U.S. “rich.”  —  President-elect Donald Trump mocked Prime Minister Justin Trudeau overnight as the … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-mocks-prime-minister-justin-trudeau-governor-great-state-canada-rcna183570"
  },
  {
    "text": "Criminal Charges Unsealed Against Two Former High-Ranking Syrian Government Intelligence Officials for War Crimes against Americans and Other Civilians  —  For Immediate Release  —  A copy of the indictment can be found here.  —  An indictment was unsealed today in the Northern District … ",
    "url": "https://www.justice.gov/opa/pr/criminal-charges-unsealed-against-two-former-high-ranking-syrian-government-intelligence"
  },
  {
    "text": "‘The end of seniority’: Younger Democrats are challenging elders for powerful positions  —  Younger House Democrats, like Alexandria Ocasio-Cortez, and newer members, like Angie Craig, are taking on senior members for key committee jobs in the next Congress.",
    "url": "https://www.nbcnews.com/politics/congress/younger-democrats-are-challenging-senior-members-committee-jobs-rcna183515"
  },
  {
    "text": "Republican-led states are rolling out plans that could aid Trump's mass deportation effort  —  As President-elect Donald Trump assembles his administration, Republican governors and lawmakers in some states are already rolling out proposals that could help him carry out his pledge to deport millions … ",
    "url": "https://apnews.com/article/trump-immigration-deportation-republican-states-da5c2465b9d4476176c09d87d6c00aed"
  },
  {
    "text": "Acrimonious Texas House Speaker race divides state's Republicans  —  An acrimonious race for Speaker of the Texas House is splitting the state GOP — and forcing a confrontation between the body's warring Republican camps.  —  Competing Republican state Reps. David Cook and Dustin Burrows … ",
    "url": "https://thehill.com/homenews/state-watch/5030621-texas-house-speaker-race-republican-divisions/"
  },
  {
    "text": "What to look for in Supreme Court arguments over environmental regulation of Utah oil railway plan  —  A proposed western railroad expansion aimed at boosting crude oil production in Utah is coming before the Supreme Court Tuesday in a case that could have wider impact on federal environmental regulation.",
    "url": "https://apnews.com/article/supreme-court-environment-regulation-recuse-gorsuch-utah-16cff708f7549ff430823213eeaa22f6"
  }
]