[
  {
    "text": "Trump booed and heckled by raucous crowd at Libertarian convention  —  Presidential candidate Donald Trump was booed and heckled by many in a raucous audience at the Libertarian National Convention on Saturday night, a marked change from the adulation he receives at rallies from his fervently loyal supporters.",
    "url": "https://www.reuters.com/world/us/trump-booed-heckled-by-raucous-crowd-libertarian-convention-2024-05-26/"
  },
  {
    "text": "‘No wannabe dictators!’:  Donald Trump booed at Libertarian convention  —  Jeers suggest Republican presidential candidate faces a challenge in broadening his appeal  —  Donald Trump, the former US president, has suffered the rare humiliation of getting booed and heckled during a raucous speech to the Libertarian National Convention.",
    "url": "https://www.theguardian.com/us-news/article/2024/may/26/no-wannabe-dictators-donald-trump-booed-at-libertarian-convention"
  },
  {
    "text": "Trump to announce plans to commute ‘Silk Road’ website operator Ross Ulbricht's prison sentence  —  The former president has previously called for the death penalty for some drug traffickers, depending on the severity of the crime.  —  WASHINGTON — Former President Donald Trump plans … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-commute-silk-road-website-operator-ross-ulbrichts-life-prison-se-rcna154082"
  },
  {
    "text": "Washington Post bombshell: Washington Post buried Alito flag story for three years  —  Last week, many of us learned from The New York Times that an upside-down American flag had been temporarily raised over the Alito household in the days after January 6, 2021.",
    "url": "https://www.lawdork.com/p/washington-post-bombshell-washington"
  },
  {
    "text": "Russia Steps Up a Covert Sabotage Campaign Aimed at Europe  —  Russian military intelligence, the G.R.U., is behind arson attacks aimed at undermining support for Ukraine's war effort, security officials say.  —  U.S. and allied intelligence officials are tracking an increase … ",
    "url": "https://www.nytimes.com/2024/05/26/us/politics/russia-sabotage-campaign-ukraine.html"
  },
  {
    "text": "Trump's new policy wonks are proteges of Stephen Miller and Newt Gingrich … - Haley and Worthington write the first drafts of scripts Trump uses to record policy videos as well as the text on how a second Trump administration would handle issues from education to energy and immigration.",
    "url": "https://www.axios.com/2024/05/26/trump-campaign-policy-stephen-miller-newt-gingrich"
  },
  {
    "text": "The Hard Problem of Bringing Trump Into Focus  —  For all the news that the former president makes, the Biden team is struggling to make the campaign about him.  —  The video shows Donald Trump standing at a gilded lectern in Mar-a-Lago.  It's December, a week or so before Christmas … ",
    "url": "https://www.nytimes.com/2024/05/26/magazine/trump-reaction-videos-biden-campaign.html"
  },
  {
    "text": "Putin Shakes Up Things at Home as His Optimism About Ukraine War Rises  —  Despite years of criticism, President Vladimir V. Putin has only now changed his defense minister and allowed high-level corruption arrests.  —  Periodic outcries over incompetence and corruption at the top … ",
    "url": "https://www.nytimes.com/2024/05/26/world/europe/russia-corruption-putin.html"
  },
  {
    "text": "Netanyahu's split with Biden and the Democrats was years in the making  —  The Israeli leader's longtime strategy of aligning with the GOP has helped shatter the American consensus behind Israel.  —  When President Barack Obama hosted Prime Minister Benjamin Netanyahu in the Oval Office in 2014 … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/26/netanyahu-embrace-republicans-strategy-israel-divisions/"
  },
  {
    "text": "Proposed Texas GOP platform calls for the Bible in schools, electoral changes that would lock Democrats out of statewide office  —  The platform was voted on Saturday, with tallies expected next week.  Other planks call abortion homicide and gender-transition care “child abuse.”",
    "url": "https://www.texastribune.org/2024/05/25/texas-republican-party-convention-platform/"
  },
  {
    "text": "Criminal justice backlash heads to the California ballot  —  Those who pushed past reforms, including Gov. Gavin Newsom, have to decide which parts of that legacy are worth defending.  —  This fall, California voters will have multiple chances to decide whether their state has gone too far … ",
    "url": "https://www.politico.com/news/2024/05/26/criminal-justice-backlash-heads-to-the-california-ballot-00159988"
  },
  {
    "text": "Pronouns and tribal affiliations are now forbidden in South Dakota public university employee emails  —  A new South Dakota policy to stop the use of gender pronouns by public university faculty and staff in official correspondence is also keeping Native American employees from listing … ",
    "url": "https://apnews.com/article/pronouns-tribal-affiliation-south-dakota-66efb8c6a3c57a6a02da0bf4ed575a5f"
  },
  {
    "text": "Even as Violent Crime Drops, Lawlessness Rises as an Election Issue  —  In most cities, rates of homicide and violent assault are down significantly from pandemic-era highs.  But property crimes have risen, fueling voter anxiety.  —  In mid-2020, the country was reeling from a surge … ",
    "url": "https://www.nytimes.com/2024/05/26/us/politics/crime-biden-trump.html"
  },
  {
    "text": "Scoop: Trump ally urges Senate GOP to punt funding fight to 2025 … - The moves telegraph Republican confidence going into what's expected to be a fierce fight for the White House and Congressional majorities in November's election.  — Funding the government into 2025 also would avoid … ",
    "url": "https://www.axios.com/2024/05/25/trump-ally-russell-vought-meets-senate-gop-2025-plans"
  }
]