[
  {
    "text": "Haley turns fire on Trump as GOP primary shifts to New Hampshire  —  The former South Carolina governor is walking a ‘crazy fine line,’ one GOP strategist said.  —  MANCHESTER, N.H. — Nikki Haley is trying a risky new tactic in the Republican presidential race: She's mounting an attack on Donald Trump.",
    "url": "https://www.politico.com/news/2024/01/16/haley-new-hampshire-campaign-00135915"
  },
  {
    "text": "Ron DeSantis is in survival mode as Nikki Haley battles Trump in New Hampshire  —  Campaign insiders are pinning their hopes on next month's South Carolina primary.  —  MANCHESTER, N.H. — Ron DeSantis doesn't have to win next week's New Hampshire primary.  But he needs Nikki Haley to lose.",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-survival-mode-nikki-haley-battles-trump-new-hampshire-rcna134130?taid=65a718892b733700019dbd34"
  },
  {
    "text": "Trump signals intent to block testimony in Jeff Clark disciplinary proceedings  —  It's a move to shield a key Trump ally from losing his law license over his efforts to subvert the 2020 election.  —  Donald Trump has injected himself into disbarment proceedings against former Justice … ",
    "url": "https://www.politico.com/news/2024/01/16/trump-block-testimony-jeff-clark-00135931"
  },
  {
    "text": "Federal appeals court rejects petition over Special Counsel Jack Smith access to Trump's Twitter feed  —  Trump can now ask Supreme Court to review matter  —  Read this article for free!  —  Plus get unlimited access to thousands of articles, videos and more with your free account!",
    "url": "https://www.foxnews.com/politics/federal-appeals-court-rejects-trump-petition-special-counsel-jack-smith-access-twitter-feed"
  },
  {
    "text": "Grassley hospitalized to treat infection  —  Sen. Chuck Grassley (R-Iowa) has been admitted to a local Washington hospital to treat an infection, his office announced on Tuesday.  —  “Senator Chuck Grassley (R-Iowa) is receiving antibiotic infusions at an area hospital to treat an infection,” Grassley's office  said in a statement.",
    "url": "https://thehill.com/homenews/senate/4412288-grassley-hospitalized-to-treat-infection/"
  },
  {
    "text": "NEW: Capitol Police Investigating Roger Stone Remarks About Assassinating Members of Congress  —  The Capitol Police are investigating remarks made by pro-Trump political operative Roger Stone discussing the assassination of two prominent House Democrats.  A source told Mediaite the FBI is aiding with the investigation.",
    "url": "https://www.mediaite.com/trump/new-capitol-police-investigating-roger-stone-remarks-about-assassinating-members-of-congress/"
  },
  {
    "text": "Lloyd Austin's Secret Ambulance Request Revealed in 911 Call  —  Audio of the 911 call obtained by The Daily Beast reveals a request for emergency dispatchers to be “subtle” ahead of the defense secretary's secret hospitalization. … The aide to U.S. Defense Secretary Lloyd Austin … ",
    "url": "https://www.thedailybeast.com/secretary-of-defense-lloyd-austins-secretive-ambulance-request-revealed-in-911-call-audio"
  },
  {
    "text": "Haley's politically useful denial of America's racist past  —  Speaking on Fox News's “Fox & Friends” on Tuesday, hours after her third-place finish in the Iowa caucuses was finalized, former ambassador to the United Nations Nikki Haley was asked to respond to comments made by MSNBC host Joy Reid … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/16/nikki-haley-racism-republicans/"
  },
  {
    "text": "Shooter who killed 5 people at Colorado LGBTQ club is with hate crimes in federal court  —  The November 2022 attack shattered the sense of safety at Club Q, which served as a refuge for Colorado Springs' LGBTQ community.  —  DENVER — The shooter who killed five people and endangered … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/shooter-killed-5-people-colorado-lgbtq-club-charged-hate-crimes-federa-rcna134214"
  },
  {
    "text": "The Supreme Court's Relentless Corruption  —  Tomorrow, the Supreme Court will hear oral arguments in two related cases, Loper Bright v Raimondo and Relentless v Department of Commerce, in which conservatives are trying to do away with 40 years of Supreme Court precedent and basic common sense … ",
    "url": "https://takebackthecourt.substack.com/p/the-supreme-courts-relentless-corruption"
  },
  {
    "text": "Elon Musk on the Border Crisis: 'It's going viral basically'  —  Yesterday, Elon Musk joined a Spaces forum on X with Bill Ackman and Democratic candidate for president Dean Phillips.  Ackman, as you probably know, is a billionaire who was recently involved in pushing for the ouster of Claudine Gay at Harvard.",
    "url": "https://hotair.com/john-s-2/2024/01/16/auto-draft-223-n605387"
  },
  {
    "text": "FBI investigate after ex-Abercrombie boss sex claims  —  The FBI has begun an investigation after the BBC revealed claims that the former CEO of Abercrombie & Fitch (A&F) sexually exploited and abused men at events he hosted around the world.  —  Mike Jeffries and his British partner also face … ",
    "url": "https://www.bbc.com/news/world-67991750"
  },
  {
    "text": "Cuomo's campaign gets $565,000 from taxpayers.  And more is on the way.  —  A New York law requires the state to reimburse legal fees for elected officials who have been accused of crimes that don't result in convictions.  —  ALBANY, New York — Former Gov. Andrew Cuomo's campaign account balance … ",
    "url": "https://www.politico.com/news/2024/01/16/andrew-cuomo-campaign-00135912"
  },
  {
    "text": "Judge Aileen Cannon Is Quietly Sabotaging the Trump Classified Documents Case  —  On Friday, District Judge Aileen Cannon issued a new order in the Donald Trump classified documents case adding to the mountain of evidence that she is firmly in the former president's pocket.",
    "url": "https://slate.com/news-and-politics/2024/01/judge-aileen-cannon-trump-classifed-sabotage.html"
  },
  {
    "text": "Post-Affirmative Action, Views on Admissions Differ by Race  —  WASHINGTON, D.C. — A Gallup Center on Black Voices survey finds that about two in three Americans (68%) say the Supreme Court's June 2023 ruling to end the use of race and ethnicity in university admission decisions is “mostly a good thing.”",
    "url": "https://news.gallup.com/poll/548528/post-affirmative-action-views-admissions-differ-race.aspx"
  },
  {
    "text": "Federal Government To Spend $700k On Trans-Inclusive Sex Ed For 14-Year-Olds  —  The Department of Health and Human Services (HHS) is awarding nearly $700,000 taxpayer dollars to back pregnancy prevention programs for young girls who identify as boys, warning that “heteronormative” sexual education is inadequate.",
    "url": "https://www.dailywire.com/news/federal-government-to-spend-700k-on-trans-inclusive-sex-ed-for-14-year-olds"
  },
  {
    "text": "Tom Keen flips HD 35 from red to blue in critical Special Election  —  Democrats invested heavily in the race, hoping to prove Florida remains a battleground.  —  Aerospace entrepreneur Tom Keen is headed to the House after flipping a red seat blue.  —  The Orlando Democrat came out on top … ",
    "url": "https://floridapolitics.com/archives/653319-tom-keen-flips-hd-35-from-red-to-blue-in-critical-special-election/"
  }
]