[
  {
    "text": "Live updates Jordan failing to secure votes needed for speaker on second ballot  —  With a roll-call vote underway, Rep. Jim Jordan (R-Ohio) is failing to secure the votes he would need to be elected speaker on a second ballot.  On Tuesday, 20 members of his own party refused to back him.",
    "url": "https://www.washingtonpost.com/politics/2023/10/18/house-speaker-vote/"
  },
  {
    "text": "A resounding ‘no’ for Jim Jordan  —  The sharply divided House Republican Caucus sent a clear message on Tuesday afternoon: not even Republicans want to be governed by Ohio Rep. Jim Jordan.  —  Jordan's missed-it-by-that-much candidacy for the third most powerful position in America … ",
    "url": "https://thehill.com/opinion/campaign/4262314-a-resounding-no-for-jim-jordan/"
  },
  {
    "text": "Republicans Fear Jordan Speaker Bid Could Cost Them House Majority  —  Nearly 200 G.O.P. lawmakers have supported Representative Jim Jordan, the hard-right Ohio lawmaker, in the speaker fight.  Some Republicans say that may doom the party in coming elections.",
    "url": "https://www.nytimes.com/2023/10/18/us/politics/republicans-speaker-jim-jordan-democrats-elections.html"
  },
  {
    "text": "Jim Jordan's allies tried strong-arming his GOP critics.  It backfired.  —  “The one thing that will never work with me — if you try to pressure me, if you try to threaten me, then I shut off,” GOP Rep. Mario Díaz-Balart said.  —  Jim Jordan's allies attempted to badger House Republicans into making him speaker.",
    "url": "https://www.politico.com/news/2023/10/17/conservative-pressure-jordan-speaker-bid-00122089"
  },
  {
    "text": "The Threat to Democracy Is Coming From Inside the U.S. House  —  Jim Jordan's advance to the brink of the speakership extends the pattern that has played out within the GOP since Donald Trump became a national candidate.  —  Representative Jim Jordan may or may not break … ",
    "url": "https://www.theatlantic.com/politics/archive/2023/10/us-house-democracy-threat-republican-speaker-race/675679/"
  },
  {
    "text": "Jordan says House must choose between Republican speaker or coalition with Democrats  —  Jordan told reporters that there will be a vote for speaker today with his name on the ballot, followed by a resolution for McHenry to be empowered as speaker pro tempore.  He said empowering McHenry would be done with Democrats.",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/live-updates-house-speaker-vote-jordan-jeffries-rcna120991/rcrd21978?canonicalCard=true"
  },
  {
    "text": "Donald Trump told to keep volume down after getting animated at New York civil fraud trial  —  A judge warned Donald Trump and others at his New York civil fraud trial to keep their voices down Wednesday after the former president threw up his hands in frustration and spoke aloud to his lawyers … ",
    "url": "https://apnews.com/article/donald-trump-letitia-james-fraud-lawsuit-new-york-dd10ecf8bdc4cbf8c17990cc4f40ce9b"
  },
  {
    "text": "Trump Lawyer Acknowledged Political Agenda in Election Suit, Emails Show  —  Kenneth Chesebro said that even long-shot litigation would hold political advantages, undercutting assertions that Donald J. Trump's lawyers were simply providing legal advice in challenging the 2020 results.",
    "url": "https://www.nytimes.com/2023/10/18/us/politics/kenneth-chesebro-trump-2020-election.html"
  },
  {
    "text": "Gaza hospital blast: what we know about the explosion  —  WHO BOMBED THE HOSPITAL IN GAZA?  —  Israelis and Palestinians have blamed each other for the hospital bombing.  —  Biden, who has stood squarely behind Israel from the start of the conflict, said that based on what he had seen … ",
    "url": "https://www.reuters.com/world/middle-east/gaza-hospital-blast-what-we-know-about-explosion-2023-10-18/"
  },
  {
    "text": "Hundreds dead in Gaza hospital bombing, local authorities say  —  Gaza's health ministry spokesman said an Israeli air strike on Tuesday killed hundreds of people at a hospital in the Palestinian enclave, but Israel said a Palestinian barrage had caused the blast.",
    "url": "https://www.reuters.com/world/middle-east/least-500-victims-israeli-air-strike-hospital-gaza-health-ministry-2023-10-17/"
  },
  {
    "text": "Biden's pick for ambassador to Israel spars with Republican opponents  —  Jack Lew, a veteran of the Obama and Clinton administrations, has attracted criticism from some in the GOP for his defense of the Iran nuclear deal and related policies  —  Jack Lew, President Biden's nominee to become … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/18/jack-lew-israel-ambassador-hearing/"
  },
  {
    "text": "Cornel West draws max donation from GOP megadonor Harlan Crow  —  The professor is challenging President Joe Biden from the left in the 2024 presidential election, running as an independent after dropping a Green Party bid.  —  Progressive activist and independent presidential candidate Cornel West received … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/cornel-west-draws-max-donation-gop-megadonor-harlan-crow-rcna121060"
  },
  {
    "text": "Biden would lose in matchup vs. Trump, according to CNBC survey; Israel funding has strong support  — President Joe Biden's approval rating fell to just 37%, according to CNBC's All-America Economic Survey.  It's the second lowest approval rating of Biden's presidency.",
    "url": "https://www.cnbc.com/2023/10/18/biden-would-lose-in-match-up-vs-trump-according-to-cnbc-survey-israel-funding-has-strong-support.html"
  },
  {
    "text": "Center for Politics Study: Partisan Desires Override Support for Constitutional Freedoms and American Values  —  A new national study by the Center for Politics at the University of Virginia reveals a stunning number of Americans endorsing policies that could challenge the U.S. Constitution … ",
    "url": "https://centerforpolitics.org/crystalball/articles/center-for-politics-study-indicates-many-americans-favor-actions-that-challenge-constitutional-bounds-to-serve-partisan-aims/"
  },
  {
    "text": "Early Intelligence Suggests Hospital Blast Caused by Palestinian Fighters, U.S. Says  —  Officials cautioned that analysis is preliminary and that the United States was continuing to collect and analyze evidence.  —  American officials say they have multiple strands of intelligence … ",
    "url": "https://www.nytimes.com/2023/10/18/us/politics/hospital-gaza-us-intelligence.html"
  },
  {
    "text": "EXCLUSIVE: X, formerly known as Twitter, will begin charging new users $1 a year to access key features including the ability to tweet and retweet  —  The owner of X, Elon Musk, has long floated the idea of charging users $1 to use the platform.  —  X, the platform formerly known as Twitter … ",
    "url": "https://fortune.com/2023/10/17/twitter-x-charging-new-users-1-dollar-year-to-tweet/"
  },
  {
    "text": "Illinois Gov. J.B. Pritzker launches organization focused on protecting abortion rights  —  Democratic Gov. J.B. Pritzker of Illinois is launching a new organization, Think Big America, focused on passing abortion rights ballot measures around the country.  Pritzker, a rising figure … ",
    "url": "https://19thnews.org/2023/10/jb-pritzker-illinois-organization-abortion-ballot-measures/"
  },
  {
    "text": "School vouchers are even worse than you think  —  Republicans in states like Texas complain that public schools are failing, then starve them under the guise of “choice.” … Texas Gov. Greg Abbott really, really wants school vouchers.  So much so that he called a special session to pass a bill … ",
    "url": "https://www.publicnotice.co/p/school-vouchers-texas-explained"
  }
]