[
  {
    "text": "MAGA Bros Are Freaking Out Because So Many Women Are Voting  —  'IT'S OVER'  —  “Unless this changes, Kamala Harris takes PA and it's over,” tweeted right wing gadfly Mike Cernovich.  —  Two of former president Donald Trump's most prominent backers in the right wing influencer sphere fretted Wednesday … ",
    "url": "https://www.thedailybeast.com/maga-bros-are-freaking-out-because-so-many-women-are-voting/"
  },
  {
    "text": "Conservatives in furor over Julia Roberts ad  —  A new Harris-Walz campaign ad voiced by actor Julia Roberts encourages women to vote for Vice President Harris in the presidential election, even if their husbands are backing former President Trump.  —  The Roberts ad also alludes to abortion rights … ",
    "url": "https://thehill.com/homenews/campaign/4964265-kamala-harris-ad-julia-roberts/"
  },
  {
    "text": "Why are so many women hiding their voting plans from their husbands?  —  A lot of households are not democracies; they're dictatorships.  This may mean voter intimidation and suppression  —  Lots of memes and tweets and posts and videos are popping up, assuring women that they can keep … ",
    "url": "https://www.theguardian.com/commentisfree/2024/oct/31/why-are-so-many-women-hiding-their-voting-plans-from-their-husbands"
  },
  {
    "text": "‘Not healthy and weird’: Fox News host roasted for threatening wife with ‘D-Day’ over vote  —  A Fox News host who threatened his wife with marital “D-Day” if she did not vote for former President Donald Trump faced swift backlash from viewers who swiftly roasted the controversial conservative pundit.",
    "url": "https://www.rawstory.com/jesse-watters-comment-about-harris/"
  },
  {
    "text": "‘Like it or not’: In one quote, Trump distills the 2024 gender gap  —  The former president's comment at a Wisconsin rally was a pithy encapsulation of the concerns that are spurring a lots of women's votes.  —  Wearing a fluorescent orange vest, former president Donald Trump offered attendees … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/31/trump-distills-gender-gap/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwMzQ3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxNzMzMTk5LCJpYXQiOjE3MzAzNDcyMDAsImp0aSI6ImIxMGJjODdlLTJiZWMtNDgzMi05YzZhLTA1ZDhiMWM1YzgyYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzMxL3RydW1wLWRpc3RpbGxzLWdlbmRlci1nYXAvIn0.90iyH370SIGTvMlEIcMfSMshSBayPz3L7JIvjMaexZ8&itid=gfta"
  },
  {
    "text": "The stock market's surprising bet on who will win the presidency  —  Voters are clamoring for any hints of clarity about the neck-and-neck presidential race, so some are looking beyond public opinion polls.  —  Wall Street executives, political gamblers and cryptocurrency traders are piling … ",
    "url": "https://www.politico.com/news/2024/10/31/stock-market-betting-kamala-harris-win-00185818"
  },
  {
    "text": "Scoop: What Trump is being told … The memo, addressed to “TEAM TRUMP,” has the subject line: “PRESIDENT TRUMP IS ON THE VERGE.”  — Fabrizio draws on Real Clear Politics polling averages to argue that Trump's “position nationally and in every single Battleground State is SIGNIFICANTLY better today than it was 4 years ago.”",
    "url": "https://www.axios.com/2024/10/31/trump-2024-election-polls-memo"
  },
  {
    "text": "A second Trump term comes with unacceptable risks  —  If The Economist had a vote, we would cast it for Kamala Harris  —  Next week tens of millions of Americans will vote for Donald Trump.  Some will do so out of grievance, because they think Kamala Harris is a radical Marxist who will destroy their country.",
    "url": "https://www.economist.com/leaders/2024/10/31/a-second-trump-term-comes-with-unacceptable-risks"
  },
  {
    "text": "Why the Right Thinks Trump Is Running Away With the Race  —  Skewed polls and anonymous betting markets are building up Republicans' expectations.  Donald Trump could use that to challenge the result.  —  The torrent of polls began arriving just a few weeks ago, one after the other, most showing a victory for Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/10/31/us/politics/trump-harris-partisan-polls.html?unlocked_article_code=1.WU4.JV4D.IONSYpcRGvXp&smid=url-share"
  },
  {
    "text": "Trump sues CBS for $10B over Harris's ‘60 Minutes’ interview  —  Former President Trump is suing CBS News over a “60 Minutes” interview it broadcast with Vice President Harris earlier this month that he and his allies have claimed was edited to cast her in a positive light.",
    "url": "https://thehill.com/homenews/media/4964816-trump-sues-cbs-news-60-minutes/"
  },
  {
    "text": "Trump sues CBS News for $10 billion alleging ‘deceptive doctoring’ of Harris' ‘60 Minutes’ interview  —  EXCLUSIVE: Former President Trump is suing CBS News for $10 billion in damages, stating the network practiced “deceptive conduct” for the purpose of election interference in its interview with Vice President Kamala Harris.",
    "url": "https://www.foxnews.com/politics/trump-sues-cbs-news-10-billion-alleging-deceptive-doctoring-harris-60-minutes-interview"
  },
  {
    "text": "‘January 6th is going to be pretty fun’: How MAGA activists are preparing to undermine the election if Trump loses  —  Before Election Day has even arrived, the “Stop the Steal” movement has reemerged in force, with some of the same activists who tried to overturn former President Donald … ",
    "url": "https://www.cnn.com/2024/10/31/politics/maga-activists-preparing-undermine-election-if-trump-loses/"
  },
  {
    "text": "Video of Donald Trump ‘Struggling’ to Enter Garbage Truck Goes Viral  —  Social media commentators have raised concerns over  —  's health after footage emerged of the  —  presidential candidate climbing into a campaign-branded garbage truck.  —  In Wisconsin on Wednesday, Trump was",
    "url": "https://www.newsweek.com/video-donald-trump-struggling-enter-garbage-truck-goes-viral-1977750"
  },
  {
    "text": "Trump transition official says RFK Jr. wants to force vaccines off the market  —  Howard Lutnick, co-chair of the Trump-Vance transition team, said in a Wednesday interview that former presidential candidate Robert F. Kennedy Jr., who is backing former President Trump, is seeking the federal data … ",
    "url": "https://thehill.com/homenews/campaign/4963677-trump-transition-rfk-jr-vaccines-hhs/"
  },
  {
    "text": "How John Roberts—Yes, John Roberts—Might Decide Who Won the Election … Last summer, after the Supreme Court appeared to brush aside a fringe theory that would have given gerrymandered GOP legislatures unfettered power over election procedures, progressive activists at Common Cause hailed a “historic pro-democracy decision.”",
    "url": "https://newrepublic.com/article/187699/john-roberts-supreme-court-decide-2024-election"
  },
  {
    "text": "Elon Musk Could Have US Citizenship Revoked If He Lied on Immigration Forms  —  The richest man in the world appears to have worked in the US without authorization.  According to experts, if he did so and lied about it as part of the immigration process, he could be denaturalized.",
    "url": "https://www.wired.com/story/elon-musk-citizenship-revoked-denaturalized/"
  },
  {
    "text": "5 Days Out I Would Much Rather Be Us Than Them - New 2024 Election Analysis and Video With Tom Bonier  —  Welcome New Subscribers!  /When We Vote, We Win!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  —  Transcript  —  Happy Thursday all. 5 days of hard work left until victory.  I ask two things of you today:",
    "url": "https://www.hopiumchronicles.com/p/i-would-much-rather-be-us-than-them-aec"
  },
  {
    "text": "Judge declines to block Elon Musk $1 million voter giveaway  —  A Pennsylvania state judge said on Thursday he would not immediately move forward with a lawsuit that seeks to stop Elon Musk's $1 million voter giveaway ahead of the Nov. 5 U.S. presidential election.",
    "url": "https://www.reuters.com/legal/musk-due-court-1-million-voter-giveaway-faces-courtroom-test-2024-10-31/"
  },
  {
    "text": "The Next President Inherits a Remarkable Economy  —  The high quality of recent economic growth should put a wind at the back of the White House's next occupant  —  Whoever wins the White House next week will take office with no shortage of challenges, but at least one huge asset: an economy that is putting its peers to shame.",
    "url": "https://www.wsj.com/economy/the-next-president-inherits-a-remarkable-economy-7be2d059"
  }
]