[
  {
    "text": "Trump Finally Takes Sides in The Civil War Tearing MAGA Apart  —  President-elect Donald Trump finally spoke out on the civil war driving a wedge between growing factions in the MAGA movement—and he's thrown his weight behind his new pal Elon Musk.With Trump's inauguration still more than 20 days away … ",
    "url": "https://www.thedailybeast.com/trump-knifes-maga-loyalists-to-back-sidekick-musk-on-h-1b-visas/"
  },
  {
    "text": "MAGA Is Already Eating Its Own.  Pass the Popcorn  —  Dear Laura Loomer: You weren't in on the con. You were one of the marks.  —  Like many observers, I expected severe buyers' regret fairly early in the second Trump administration.  After all, many Americans who voted for Trump … ",
    "url": "https://paulkrugman.substack.com/p/maga-is-already-eating-its-own-pass"
  },
  {
    "text": "Trump Weighs In on H-1B Visas Supported by Elon Musk  —  He said in an interview that he had used the visas for skilled workers “many times.”  But he has mainly used visas for unskilled workers like housekeepers.  —  President-elect Donald J. Trump appeared to weigh in on Saturday … ",
    "url": "https://www.nytimes.com/2024/12/28/business/trump-immigration-h1b-visa.html"
  },
  {
    "text": "Trump hasn't permanently changed GOP, Sununu says … There's no Trump-lite.  There's no Trump 2.0 coming up.  I always say that Trump is who he is, and because he's built up himself in the American psyche for 40 years,\" Sununu said on CNN's “State of the Union.”",
    "url": "https://www.axios.com/2024/12/29/trump-gop-chris-sununu"
  },
  {
    "text": "German politicians attack Elon Musk article praising far-right AfD  —  Lawmakers from Social Democrats and Greens criticise media group Axel Springer over publication of opinion piece  —  German politicians have criticised media conglomerate Axel Springer for publishing an opinion article … ",
    "url": "https://www.ft.com/content/f682ef52-613c-479f-9f24-d7bb091a14d1"
  },
  {
    "text": "Musk Doubles Down on Support for German Far-Right Party  —  The world's richest man, a key adviser to President-elect Donald J. Trump, ridicules critics over his backing of the German extremist party AfD, as Germany prepares for elections.  —  Elon Musk, the world's richest man and a close adviser … ",
    "url": "https://www.nytimes.com/2024/12/28/world/europe/musk-support-for-german-far-right-afd.html"
  },
  {
    "text": "Kansas once required voters to prove citizenship.  That didn't work out so well  —  Republicans made claims about illegal voting by noncitizens a centerpiece of their 2024 campaign messaging and plan to push legislation in the new Congress requiring voters to provide proof of U.S. citizenship.",
    "url": "https://apnews.com/article/kansas-noncitizen-voting-proof-of-citizenship-50d56a0b8d1f0fde15480aab3db67f4f"
  },
  {
    "text": "Elon Musk Is a National Security Risk  —  It is now fair to ask the question: Is Elon Musk a national security risk?  —  According to numerous interviews and remarks, Mr. Musk's Department of Government Efficiency co-leader, Vivek Ramaswamy, once appeared to believe he was.",
    "url": "https://www.nytimes.com/2024/12/29/opinion/elon-musk-china-classified-secrets-national-security-russia-doge.html?unlocked_article_code=1.lE4.XzKs.DOmVI6bFotpM&smid=bs-share"
  },
  {
    "text": "Trump team says Canada, Greenland, Panama comments are part of a broader plan  —  Not everyone is convinced.",
    "url": "https://www.washingtonpost.com/politics/2024/12/28/trump-canada-greenland-panama-canal/"
  },
  {
    "text": "Gov. Sununu Claims Elon Musk is Too Rich to Have Conflict of Interest Between Business and Vast Influence Over Trump Administration  —  Republican New Hampshire Governor Chris Sununu argued Sunday that Elon Musk is too wealthy to have a conflict of interest regarding his businesses and his influence … ",
    "url": "https://www.mediaite.com/tv/gov-sununu-claims-elon-musk-is-too-rich-to-have-conflict-of-interest-between-business-and-vast-influence-over-trump-administration/"
  },
  {
    "text": "‘I could never do his job’: Former Speaker Newt Gingrich shows support for Mike Johnson  —  The House will gather Friday to pick a speaker.  And with Republicans expected to have a slim majority, Johnson can only afford one defection.  —  Newt Gingrich, who led House Republicans through … ",
    "url": "https://www.politico.com/news/2024/12/29/newt-gingrich-support-mike-johnson-speakership-00196103"
  },
  {
    "text": "Some Justice Department Lawyers Look for Protection—and the Exits  —  Officials who worked on politically sensitive cases weigh moves ahead of Donald Trump's second term  —  WASHINGTON—Justice Department lawyers who have angered President-elect Donald Trump and his allies are facing tough decisions … ",
    "url": "https://www.wsj.com/us-news/law/some-justice-department-lawyers-look-for-protectionand-the-exits-41d30d12"
  },
  {
    "text": "Democrats taunt Trump with ‘President Musk’ moniker  —  Democrats are taunting President-elect Trump with claims that billionaire entrepreneur Elon Musk is calling the shots instead of the incoming president.  —  And with Musk set to play a major role in Trump's second term … ",
    "url": "https://thehill.com/homenews/administration/5056934-president-musk-democrats-taunt-trump/"
  },
  {
    "text": "Lawler says Johnson should be House Speaker: He ‘inherited a disaster’  —  Rep. Mike Lawler (R-N.Y.) said Speaker Mike Johnson (R-La.) should be re-elected as House Speaker, noting the Louisiana Republican “inherited a disaster.”  —  During an appearance on ABC's “This Week,” … ",
    "url": "https://thehill.com/homenews/sunday-talk-shows/5058943-lawler-says-johnson-should-be-house-speaker-he-inherited-a-disaster/"
  },
  {
    "text": "The Blaming of Joe Biden  —  We are now in the final weeks of Joe Biden's presidency, and I've been thinking about the year he had — how different it was from what he hoped last winter as he sought re-election.  All presidents think about what they wanted to achieve, in the end, and how Americans will regard them.",
    "url": "https://www.nytimes.com/2024/12/28/opinion/joe-biden-presidency.html"
  }
]