[
  {
    "text": "Trump's Fury at Gavin Newsom Backfires—and Reveals His Own Weakness  —  With President Donald Trump sending more troops into Los Angeles amid protests there, a remarkable image has gone viral on social media.  It shows members of the National Guard crowded into a sterile-looking office … ",
    "url": "https://newrepublic.com/article/196674/trump-gavin-newsom-fury-backfires-reveals-weakness"
  },
  {
    "text": "Bragg Soldiers Who Cheered Trump's Political Attacks While in Uniform Were Checked for Allegiance, Appearance  —  It was supposed to be a routine appearance, a visit from the commander in chief to rally the troops, boost morale and celebrate the Army's 250th-birthday week … ",
    "url": "https://www.military.com/daily-news/2025/06/11/bragg-soldiers-who-cheered-trumps-political-attacks-while-uniform-were-checked-allegiance-appearance.html"
  },
  {
    "text": "‘No Kings’: Millions to Protest Trump's ‘Dictator-Style Birthday Parade’  —  A national day of protest is set for June 14.  Can non-violent resistance counter Trump's authoritarian show of force?  —  Even before Donald Trump militarized his crackdown on pro-immigrant protesters in Los Angeles … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-no-kings-protests-june-14-los-angeles-1235359409/"
  },
  {
    "text": "Trump Wants to Be a Strongman, but He's Actually a Weak Man  —  President Trump thinks it is a sign of strength to send in troops to deal with protesters in Los Angeles.  To that end, he has federalized a portion of the California National Guard and mobilized nearby Marines to support Immigration … ",
    "url": "https://www.nytimes.com/2025/06/11/opinion/trump-los-angeles-ice-strongman.html?unlocked_article_code=1.OE8.E5I6.RwfRanUrJCEw&smid=url-share"
  },
  {
    "text": "Texas Gov. Greg Abbott to deploy National Guard across the state in response to protests  —  The move comes ahead of a planned protest in San Antonio and follows days of protest in L.A. and across the nation.  —  Texas Governor Greg Abbott said he'll deploy the National Guard to locations across the state … ",
    "url": "https://www.nbcnews.com/news/us-news/texas-gov-deploy-national-guard-state-due-protests-rcna212275"
  },
  {
    "text": "The Silence of the Generals  —  As President Donald Trump crossed a dangerous line at Fort Bragg, the brass failed to speak out in the Army's defense.  —  President Donald Trump continued his war against America's most cherished military traditions today when he delivered a speech at Fort Bragg.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/silence-generals/683106/?gift=otEsSHbRYKNfFYMngVFweC9SKhWuL8c7oypTub1ifvo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "‘He does love being commander in chief’: Trump leans in on the military  —  On one coast, military forces are arriving by the thousands to defend federal buildings and agents.  On the other, they're readying a celebration of American military might.  —  President Donald Trump loves displays of military force.",
    "url": "https://www.politico.com/news/2025/06/11/trump-military-parade-protests-00398716"
  },
  {
    "text": "Fulbright Board Resigns After Accusing Trump Aides of Political Interference  —  The board of the prestigious program told the State Department it had no right to cancel scholarships for nearly 200 American professors and researchers.  —  The dozen board members of the prestigious Fulbright program … ",
    "url": "https://www.nytimes.com/2025/06/11/us/politics/fulbright-board-resign-trump.html?unlocked_article_code=1.OE8.f7MK.2K1LptU6rpPw&smid=url-share"
  },
  {
    "text": "Some Trump Officials Now Fear Elon's ‘Burn Book’  —  “What does he have on us?”  —  It's been less than a week since the explosive, extremely public breakdown in relations between Donald Trump, the most powerful person on the planet, and Elon Musk, the world's richest man.",
    "url": "https://www.rollingstone.com/politics/politics-features/elon-musk-burn-book-anxiety-trump-officials-1235361614/"
  },
  {
    "text": "Donald Trump responds to Elon Musk's late-night apology after ugly public feud  —  WASHINGTON — President Trump is feeling good about Elon Musk's apology after the former “first buddy” admitted late Tuesday he had gone “too far” in his personal attacks on the commander-in-chief.",
    "url": "https://nypost.com/2025/06/11/us-news/donald-trump-responds-to-elon-musks-apology-after-public-feud/"
  },
  {
    "text": "Musk Retreats on Trump Attacks After Call from JD Vance, Susie Wiles  —  Tesla CEO says some of his posts about president ‘went too far,’ after linking Trump to Epstein files  —  JD Vance and Susie Wiles pushed Elon Musk to repair his relationship with President Trump after the tech billionaire blew … ",
    "url": "https://www.wsj.com/politics/musk-trump-feud-vance-wiles-d9d6c894?st=9UFDE2&reflink=article_copyURL_share"
  },
  {
    "text": "Majority Of Voters Oppose GOP Budget Bill, With Just 67% Of Republicans In Support, Quinnipiac University National Poll Finds; Trump Job Approval: 38%, His Handling Of Russia - Ukraine War Lowest Among List Of Issues  — mail_outline  —  As the Senate debates the GOP tax … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3924"
  },
  {
    "text": "Capitol agenda: The GOP's latest megabill casualties  —  House Republicans will vote to make difficult changes to the GOP megabill Wednesday in an attempt to keep the bill on track in the Senate.  The House Rules Committee teed up a provision Tuesday night that would scrub the House-passed bill … ",
    "url": "https://www.politico.com/live-updates/2025/06/11/congress/republican-megabill-house-rules-committee-proposals-00398951"
  },
  {
    "text": "X's Sales Pitch: Give Us Your Ad Business or We'll Sue  —  Elon Musk and CEO Linda Yaccarino launched a campaign to strong-arm advertisers back onto the platform  —  Late last year, Verizon Communications got an unusual message from a media company that wanted its business: Spend your ad dollars with us or we'll see you in court.",
    "url": "https://www.wsj.com/business/media/x-twitter-ad-revenue-campaign-lawsuit-a882b5c6?st=AAxSTY&reflink=article_copyURL_share"
  },
  {
    "text": "US prepares to order departure of all nonessential staff from Baghdad embassy, officials say  —  The State Department is preparing to order the departure of all nonessential personnel from the U.S. Embassy in Baghdad due to the potential for regional unrest, two U.S. officials said Wednesday.",
    "url": "https://apnews.com/article/state-department-embassy-baghdad-f892ebd6a50850ef5650f31819541bff"
  },
  {
    "text": "Rubio Is Pressing to Open Sanctions Investigation Into Harvard  —  Experts and former officials said it was unusual for a cabinet secretary to try to influence the Treasury Department's sanctions process to target a domestic entity.  —  Secretary of State Marco Rubio is pushing … ",
    "url": "https://www.nytimes.com/2025/06/11/us/politics/rubio-is-pressing-to-open-sanctions-investigation-into-harvard.html"
  },
  {
    "text": "This Is What Trump Does When His Revolution Sputters  —  His military deployment in Los Angeles follows a long, disturbing tradition.  —  Revolutions have a logic.  The revolutionaries start with a big, transformative, impossible goal.  They want to remake society, smash existing institutions, replace them with something different.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/california-protests-ice-trump/683102/?gift=hVZeG3M9DnxL4CekrWGK302yYSiIkEmbIoKwOecqwLo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Harvey Weinstein convicted of sex crime at NYC retrial — but squabbling jurors fail to come to agreement on rape charge  —  Harvey Weinstein's Manhattan sex-crimes retrial was thrown into chaos Wednesday as jurors agreed to convict him on one charge — but failed to reach a verdict on a rape allegation.",
    "url": "https://nypost.com/2025/06/11/us-news/harvey-weinstein-convicted-of-sex-crime-at-nyc-retrial-but-squabbling-jurors-fail-to-come-to-agreement-on-rape-charge/"
  },
  {
    "text": "ICE agents chase after farmworkers as they flee fields during latest raid in Ventura County  —  Immigration and Customs Enforcement (ICE) targeted workers on produce farms in Ventura County Tuesday morning in one of the latest raids in Southern California.  —  OXNARD, Calif. (KABC) … ",
    "url": "https://abc7.com/post/ice-agents-chase-farm-workers-flee-fields-during-latest-raid-ventura-county/16719564/"
  },
  {
    "text": "The secret police descending on Small Town, U.S.A.  —  Masked immigration officials are storming towns and arresting people.  —  GREAT BARRINGTON, Mass. — Maybe they really were immigration officers, just as they claimed.  Or maybe they were a ragtag vigilante group, arbitrarily snatching brown-looking people off the street.",
    "url": "https://www.washingtonpost.com/opinions/2025/06/11/immigration-arrests-ice-raid-masks/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5NjE0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwOTk2Nzk5LCJpYXQiOjE3NDk2MTQ0MDAsImp0aSI6ImIzYzNkZmY2LTM3OGUtNDE2OS05MzdjLTVlNWQwOTUyNGU5NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA2LzExL2ltbWlncmF0aW9uLWFycmVzdHMtaWNlLXJhaWQtbWFza3MvIn0.Y_FWR99bU09JQCwbWczWWN_YEnrAegE-dLLpuSmilqM&itid=gfta"
  },
  {
    "text": "U.S. Image Declines in Many Nations Amid Low Confidence in Trump  —  Table of Contents Table of Contents  —  This Pew Research Center analysis focuses on public opinion of the United States and President Donald Trump in 24 countries across North America, Europe, the Middle East … ",
    "url": "https://www.pewresearch.org/global/2025/06/11/us-image-declines-in-many-nations-amid-low-confidence-in-trump/"
  },
  {
    "text": "Troops in Los Angeles can detain but not arrest individuals, military official says  —  U.S. military troops deployed to Los Angeles are allowed to temporarily detain individuals until law enforcement agents arrive to arrest them, a senior U.S. military official said on Wednesday.",
    "url": "https://www.reuters.com/world/us/troops-los-angeles-can-temporarily-detain-individuals-no-arrest-authorities-2025-06-11/"
  },
  {
    "text": "Trump Is Pushing Allies Away and Closer Into Each Other's Arms  —  Important U.S. allies are trying to bolster their ties as the Trump administration shifts priorities and reshapes the world order.  —  New trade deals.  Joint sanctions against Israel.  Military agreements.",
    "url": "https://www.nytimes.com/2025/06/11/world/canada/g7-trump-us-allies-world-order.html?unlocked_article_code=1.OE8.MAFw.gbMnKS8knhj6&smid=url-share"
  },
  {
    "text": "ICE detains local teen despite legal authorization to be in U.S.  —  DAVID MAMARIL HOROWITZ  —  david.horowitz@bgdailynews.com  —  U.S. Immigration and Customs Enforcement seized and detained a local teenager in Bowling Green who has legal authorization to be in the country, according to a Teranga Academy-partnered nonprofit.",
    "url": "https://bgdailynews.com/2025/06/10/ice-detains-local-teen-despite-legal-authorization-to-be-in-u-s/"
  },
  {
    "text": "The days around Trump's trade war announcements saw spikes in lawmaker stock market transactions  —  In the days before President Donald Trump suddenly paused most of the punishing tariffs on foreign countries he had revealed in early April, more than a dozen congressional lawmakers were tied … ",
    "url": "https://cnn.com/2025/06/11/politics/congress-stock-market-trading-trump"
  },
  {
    "text": "Former Rep. Joe Walsh is considering a bid against GOP Sen. Lindsey Graham  —  The former Tea Party congressman has become a registered Democrat.  —  Joe Walsh, the former Tea Party congressman, right-wing radio host and current Never Trumper, is eyeing a possible move to South Carolina.",
    "url": "https://www.politico.com/news/2025/06/11/joe-walsh-lindsey-graham-senate-2026-00399156"
  },
  {
    "text": "Lawmakers urge Trump administration to clamp down on illicit GLP-1 sales  —  A bipartisan group of congressional lawmakers is calling on the Trump administration to address the continued sale of illicit, compounded GLP-1 products, warning that consumers may be accessing these drugs without knowing the product could be fraudulent.",
    "url": "https://thehill.com/policy/healthcare/5344644-lawmakers-counterfeit-compounded-glp-1/"
  },
  {
    "text": "Trump to attend ‘Les Misérables’ premiere as protests continue across the country  —  The musical, a Trump favorite, has also provided anthems for protesters around the world.  —  President Donald Trump is set to attend the opening night of “Les Misérables,” … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-attend-les-miserables-premiere-protests-continue-country-rcna212323"
  },
  {
    "text": "In final stretch of New York mayoral race, Cuomo targets Mamdani's inexperience  —  The 67-year-old former governor has taken to criticizing his top opponent, a 33-year-old state legislator.  —  NEW YORK — Mayoral contender Andrew Cuomo argued Wednesday that his leading opponent, Zohran Mamdani, lacks the experience to lead the city.",
    "url": "https://www.politico.com/news/2025/06/11/cuomo-argues-mamdani-lacks-experience-to-be-nyc-mayor-00400432"
  },
  {
    "text": "CDC backtracks on layoffs, rehires more than 400 people  —  Around half of those employees are in the National Center for HIV, Viral Hepatitis, STD, and Tuberculosis Prevention.  —  The Centers for Disease Control and Prevention is reinstating more than 400 people who had received layoff notices … ",
    "url": "https://www.politico.com/news/2025/06/11/cdc-backtracks-on-layoffs-rehires-more-than-400-people-00400404"
  },
  {
    "text": "EPA proposes rollback on rules limiting carbon and air pollution from fossil fuel power plants  —  The Environmental Protection Agency announced Wednesday that it will seek to revoke a key rule put in place by the Biden administration that set limits on the amount of carbon dioxide … ",
    "url": "https://www.cbsnews.com/news/epa-proposes-rollback-rules-carbon-air-pollution-fossil-fuel-plants/"
  },
  {
    "text": "Inside the Justice Dept. “rubber room,” where veteran lawyers do jigsaw puzzles and stream shows to pass time  —  When the Trump administration swept into the Department of Justice on Jan. 20, it moved swiftly to purge, demote, transfer and otherwise sideline career lawyers not perceived … ",
    "url": "https://www.cbsnews.com/news/justice-dept-rubber-room-lawyers-do-jigsaw-puzzles-stream-shows/"
  },
  {
    "text": "'America's reputation is on the line': Republican senators chide Hegseth over Ukraine  —  The former Senate majority leader and a top Trump ally laid into the Pentagon chief over the administration's actions toward the embattled country.  —  Republican senators lashed into Defense Secretary Pete Hegseth … ",
    "url": "https://www.politico.com/news/2025/06/11/mcconnell-hegseth-ukraine-fight-00399719"
  },
  {
    "text": "Major US climate website likely to be shut down after almost all staff fired  —  Exclusive: Climate.gov, which supports public education on climate science, will soon no longer publish new content  —  A major US government website supporting public education on climate science looks likely … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/11/climate-website-shut-down-noaa"
  }
]