[
  {
    "text": "How Some Voters Moved From Bernie Sanders to Donald Trump  —  For some young men in particular, the populist pitches from Mr. Sanders and Mr. Trump aligned with their attitudes about the ruling class.  —  They feel frustrated by the status quo, and they're fed up with the system.",
    "url": "https://www.nytimes.com/2024/12/09/upshot/voters-trump-bernie-sanders.html"
  },
  {
    "text": "Trump vows to end birthright citizenship and pardon US Capitol rioters  —  President-elect Donald Trump has said he will look at pardons for those involved in the 2021 US Capitol riot on his first day back in office next month.  —  “These people are living in hell,” he told NBC's Meet … ",
    "url": "https://www.bbc.com/news/articles/cj30er1d6mxo"
  },
  {
    "text": "With Assad Gone, a Brutal Dictatorship Ends.  But the New Risks Are Huge.  —  The overthrow of the Assad government could mean Russia's bases in Syria are closed and Iran's pathway to Hezbollah is cut off.  Now Iran, newly vulnerable, will have to decide between negotiation and the bomb.",
    "url": "https://www.nytimes.com/2024/12/08/us/politics/syria-assad-iran-risks.html"
  },
  {
    "text": "The Syrian Regime Collapsed Gradually—And Then Suddenly  —  Assad's fall offers the possibility of change.  —  As Hemingway once wrote of bankruptcy, the collapse of autocratic regimes tends to happen gradually and then suddenly—slowly, and then all at once.  This is not just a literary metaphor.",
    "url": "https://www.theatlantic.com/international/archive/2024/12/sudden-collapse-bashar-assad/680917/?gift=hVZeG3M9DnxL4CekrWGK39JslY0QVDPx4BZRvytxmgI&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Biden officials race to help stabilize Syria after regime collapse  —  President Joe Biden announced that U.S. forces have hit Islamic State militant camps and operatives in Syria.  —  Biden cites risks and opportunities after Assad's fall  —  The Biden administration raced Sunday to try … ",
    "url": "https://www.washingtonpost.com/national-security/2024/12/08/syria-united-states-biden-stabilize/"
  },
  {
    "text": "Playbook: How Tulsi Gabbard is planning to fight  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE NEXT TRUMP IN OFFICE?  — LARA TRUMP announced last night she is stepping down as RNC co-chair.  And in an AP interview, the 42-year-old soon … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/12/09/how-tulsi-gabbard-is-planning-to-fight-00193238"
  },
  {
    "text": "Trump Suggests Kennedy Will Examine Debunked Link Between Vaccines and Autism  —  The president-elect has promoted the theory for more than a decade and said on Sunday that he was “open to anything” to address a nationwide rise in autism.  —  President-elect Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/12/08/us/politics/trump-rfk-jr-vaccines-autism.html"
  },
  {
    "text": "Trump says RFK Jr. will investigate the discredited link between vaccines and autism: ‘Somebody has to find out’  —  Researchers attribute a rise in autism diagnoses to increased screening and changing definitions of the condition.  Hundreds of studies have found childhood vaccines to be safe.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-rfk-jr-will-investigate-discredited-link-vaccines-autism-so-rcna183273"
  },
  {
    "text": "More in U.S. See Health Coverage as Government Responsibility  —  Approval of Affordable Care Act also near high point  —  WASHINGTON, D.C. — Sixty-two percent of U.S. adults, the highest percentage in more than a decade, say it is the federal government's responsibility to ensure all Americans have healthcare coverage.",
    "url": "https://news.gallup.com/poll/654101/health-coverage-government-responsibility.aspx"
  },
  {
    "text": "Weakened US public broadcasters will fight for their lives in 2025  —  The Scoop  —  Last week, Republican Sen. John Kennedy introduced the subtly named “No Propaganda Act.”  If enacted, it would end federal funding for America's public media.  —  He joined an effort by billionaires Elon Musk … ",
    "url": "https://www.semafor.com/article/12/08/2024/weakened-us-public-broadcasters-will-fight-for-their-lives-in-2025"
  },
  {
    "text": "Jay-Z accused in a civil lawsuit of raping a 13-year-old girl in 2000 along with Sean ‘Diddy’ Combs  —  Jay-Z responded with a lengthy statement calling the allegations “idiotic.”  The accuser is anonymous.  —  Jay-Z, the star rapper and entrepreneur whose real name is Shawn Carter … ",
    "url": "https://www.nbcnews.com/news/us-news/jay-z-accused-civil-lawsuit-raping-13-year-old-girl-2000-sean-diddy-co-rcna183376"
  },
  {
    "text": "Biden shrinks from view ahead of Trump's return to Washington  —  With 42 days left in office, Biden avoids unscripted moments or press questions.  —  Joe Biden is president of the United States for 42 more days.  But within the Democratic Party, on Capitol Hill — and even within his own administration … ",
    "url": "https://www.politico.com/news/2024/12/09/biden-absent-washington-00192575"
  },
  {
    "text": "Rep. Ro Khanna: US should be moving toward Medicare for all to cure inequities  —  Khanna tells “This Week” that “I believe we can make Medicare for all happen.”  —  Rep. Ro Khanna appears on “This Week,” Dec. 8.  2024.  —  After an onslaught of criticism toward the insurance industry following … ",
    "url": "https://abcnews.go.com/Politics/rep-ro-khanna-us-moving-medicare-cure-inequities/story?id=116564621"
  },
  {
    "text": "Boeing failing to keep track of non-conforming parts, whistleblower says: “It's like Russian roulette”  —  When a panel known as a door plug blew off an Alaska Airlines flight minutes after takeoff earlier this year,  a quality investigator at the factory where the Boeing plane was manufactured … ",
    "url": "https://www.cbsnews.com/news/boeing-whistleblowers-speak-out-60-minutes/"
  },
  {
    "text": "Trump Wants Jan. 6 Committee Members Imprisoned  —  “Everybody on that committee ... for what they did, yeah, honestly, they should go to jail,” Trump said … “Everybody on that committee ... for what they did, yeah, honestly, they should go to jail,” Trump said on Sunday's Meet the Press.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-jan-6-committee-members-jail-1235196917/"
  }
]