[
  {
    "text": "Trump wrote to-do lists for assistant on White House documents marked classified: Sources  —  Molly Michael told investigators about the documents, according to sources.  —  One of former President Donald Trump's long-time assistants told federal investigators that Trump repeatedly wrote … ",
    "url": "https://abcnews.go.com/US/trump-wrote-lists-assistant-white-house-documents-marked/story?id=103226113"
  },
  {
    "text": "Trump to Woo Striking Union Members in Detroit, Skipping 2nd G.O.P. Debate  —  Looking past the Republican primary, Donald Trump and his campaign are already gearing up for a possible rematch with President Biden.  —  Former President Donald J. Trump is planning to travel to Detroit … ",
    "url": "https://www.nytimes.com/2023/09/18/us/politics/trump-detroit-debate.html"
  },
  {
    "text": "California Dems consider unique approach to getting Trump off ballot  —  California lawmakers urge AG Bonta to expedite court action against former president.  —  Democrats in the California Legislature are trying a novel approach to remove former President Donald Trump from the state's March 5 primary ballot.",
    "url": "https://www.politico.com/news/2023/09/18/democrats-effort-kick-trump-off-california-ballot-00116476"
  },
  {
    "text": "Trump Throws Anti-Abortion Activists Under the Bus … Donald Trump has been signaling for months that he considers the Republican Party's anti-abortion stance to be his party's greatest liability.  On Sunday, he explicitly severed himself from his party's position on the issue.",
    "url": "https://nymag.com/intelligencer/2023/09/trump-abortion-compromise-dobbs-roe.html"
  },
  {
    "text": "How not to interview Trump  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please sign up to support our work.  We're currently offering free trials for all new signups.  Just click the button below.  —  Subscribe now",
    "url": "https://www.publicnotice.co/p/kristen-welker-trump-interview-meet-the-press"
  },
  {
    "text": "Biden trails Trump, Haley, Scott in 2024 race: poll  —  President Biden is trailing former President Trump, former U.N. Ambassador Nikki Haley and Sen. Tim Scott (R-S.C.) in several hypothetical 2024 match-ups in a new survey from Harvard CAPS-Harris Poll shared with The Hill.",
    "url": "https://thehill.com/homenews/campaign/4210432-biden-trails-trump-haley-scott-in-2024-race-poll/"
  },
  {
    "text": "Former DOJ attorney acted under Trump's direction, his lawyer says  —  Jeffrey Clark did not appear at the hearing, where he is seeking to move his Fulton County eIection interference case on the grounds that he was acting in his federal capacity.  —  ATLANTA — As a Justice Department lawyer … ",
    "url": "https://www.washingtonpost.com/national-security/2023/09/18/jeffrey-clark-fulton-county-georgia-trump-case/"
  },
  {
    "text": "We Have Two Medias in This Country, and They're Going to Elect Donald Trump  —  It's often asked in my circles: Why isn't Joe Biden getting more credit for his accomplishments?  As with anything, there's no single reason.  Inflation is a factor.  His age is as well.",
    "url": "https://newrepublic.com/article/175612/two-medias-trump-2024-spectacle"
  },
  {
    "text": "Rep. Jennifer Wexton will not seek reelection as diagnosis changes  —  Wexton was diagnosed this summer with progressive supranuclear palsy, a rare neurological condition for which there is no cure  —  Rep. Jennifer Wexton (D-Va.) promised this spring to persevere as she revealed … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/09/18/jennifer-wexton-parkinsons-diagnosis-progressive-supranuclear-palsy/"
  },
  {
    "text": "'He's 100% in': Matt Gaetz widely expected to run for Florida governor  —  The Florida congressman, however, told NBC News that his only political goal at the moment is getting Donald Trump elected president in 2024.  —  TALLAHASSEE, Fla.— The idea that Rep. Matt Gaetz will run … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/-100-matt-gaetz-widely-expected-run-florida-governor-rcna105629"
  },
  {
    "text": "Vivek Ramaswamy regrets taking the Covid vaccine.  His wife, a surgeon, does not.  —  The presidential candidate has previously spoken about how he and his wife don't agree on everything.  That includes their feelings about getting vaccinated against Covid.",
    "url": "https://www.nbcnews.com/politics/2024-election/vivek-ramaswamy-regrets-taking-covid-vaccine-wife-surgeon-not-rcna105527"
  },
  {
    "text": "Texas Lawman Linked to Oath Keepers Convicted After Violating Inmate Rights  —  Sheriff Jeff Lyde kept a pair of inmates jailed for days after a judge had ordered them freed  —  A TEXAS SHERIFF with links to the Oath Keepers has been convicted of “official oppression” for the mistreatment … ",
    "url": "https://www.rollingstone.com/politics/politics-news/oath-keeper-sheriff-convicted-violating-inmate-rights-1234827432/"
  },
  {
    "text": "Trump Lashes Out at ‘Liberal Jews Who Voted to Destroy America’ by Not Supporting Him  —  Donald Trump marked the Jewish New Year by posting a meme that trashed “liberal Jews” and claimed he deserves more political support from Jewish people.  —  As observers took the weekend to celebrate Rosh Hashanah … ",
    "url": "https://www.mediaite.com/trump/trump-lashes-out-at-liberal-jews-who-voted-to-destroy-america-by-not-supporting-him/"
  },
  {
    "text": "9/18/23 ☀️ Punchbowl News AM  —  This is an enormous week for Speaker Kevin McCarthy and House Republicans.  —  The federal government will shut down in 13 days unless Congress greenlights more funding.  And House Republicans are pushing a partisan stopgap spending bill … ",
    "url": "https://punchbowl.news/archive/91823-punchbowl-news-am/"
  },
  {
    "text": "Her students reported her for a lesson on race.  Can she trust them again?  —  Mary Wood's school reprimanded her for teaching a book by Ta-Nehisi Coates.  Now she hopes her bond with students can survive South Carolina's politics.  —  CHAPIN, S.C. — As gold sunlight filtered into her kitchen … ",
    "url": "https://www.washingtonpost.com/education/2023/09/18/south-carolina-teacher-ta-nehisi-coates-racism-lesson/"
  },
  {
    "text": "I Was Attacked by Trump and Musk.  It Was a Strategy to Change What You See Online.  —  When I worked at Twitter, I led the team that placed a fact-checking label on one of Donald Trump's tweets for the first time.  Following the violence of Jan. 6, I helped make the call to ban his account from Twitter altogether.",
    "url": "https://www.nytimes.com/2023/09/18/opinion/trump-elon-musk-twitter.html"
  },
  {
    "text": "Deep-pocketed group backing Joe Biden launches Latino outreach campaign  —  The costly, early advertising spending by Future Forward USA Action echoes a similar early Biden campaign ad strategy to sell the president's accomplishments  —  The ordained big-money outside group supporting … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/18/biden-latino-future-forward/"
  },
  {
    "text": "Lauren Boebert won her last election by fewer than 600 votes.  Her vaping incident at Beetlejuice could doom her reelection bid and cost Republicans control of the House  — In 2022, Rep. Lauren Boebert won her bid for reelection by less than 600 votes.  — In mid-September … ",
    "url": "https://www.businessinsider.com/lauren-boebert-may-have-doomed-reelection-gop-majority-2023-9?op=1"
  },
  {
    "text": "Hunter Biden sues IRS over disclosures  —  The lawsuit over the agency's interviews with Congress and the press comes as a special counsel weighs charging him with tax crimes.  —  President Biden's son Hunter filed a lawsuit Monday against the Internal Revenue Service … ",
    "url": "https://www.washingtonpost.com/national-security/2023/09/18/hunter-biden-lawsuit-irs/"
  },
  {
    "text": "Five Americans released from Iranian detention are en route to the US  —  Doha and Washington CNN  —  Five Americans freed from Iranian detention on Monday are on their way back to the United States after initially stopping in Doha, Qatar, according to a US official and a source familiar with the matter.",
    "url": "https://www.cnn.com/2023/09/18/politics/iran-us-prisoner-release-intl/"
  }
]