[
  {
    "text": "Donald Trump is going to win the election and democracy will be just fine  —  The BDN Opinion section operates independently and does not set news policies or contribute to reporting or editing articles elsewhere in the newspaper or on bangordailynews.com  —  Jared Golden represents Maine's … ",
    "url": "https://www.bangordailynews.com/2024/07/02/opinion/opinion-contributor/jared-golden-donald-trump-going-to-win-election-democracy-be-just-fine/"
  },
  {
    "text": "Biden's Lapses Are Said to Be Increasingly Common and Worrisome  —  People who have spent time with President Biden over the last few months or so said the lapses appear to have grown more frequent, more pronounced and, after Thursday's debate, more worrisome.",
    "url": "https://www.nytimes.com/2024/07/02/us/politics/biden-lapses.html"
  },
  {
    "text": "Biden Plunges in Swing States in Leaked Post-Debate Poll  —  The president is losing critical support in key battlegrounds, according to data from a premier Democratic firm, and putting previously noncompetitive states in play.  Also, for the first time, he's polling behind Kamala Harris.",
    "url": "https://puck.news/biden-plunges-in-swing-states-in-leaked-post-debate-poll/"
  },
  {
    "text": "“Freaking the f*** out”: Turmoil in the White House over Biden … - “It's the first topic of every conversation,” one White House official said. … - Another official put it more bluntly: “Everyone is freaking the f*** out.”  — “The uncertainty after Thursday is palpable and anxiety … ",
    "url": "https://www.axios.com/2024/07/02/biden-white-house-campaign-staff-freaking-out-debate"
  },
  {
    "text": "Scoop: Inside House Democrats' anti-Biden vent session … - Much of the meeting was taken up by members expressing their irritation and misgivings toward Biden and his team, according to a member in the meeting and another source briefed on the matter.  — Biden was repeatedly referred … ",
    "url": "https://www.axios.com/2024/07/02/house-democrats-biden-vent-session"
  },
  {
    "text": "A new national poll turns post-debate conventional wisdom on its head  —  As always, though, we should be cautious about reading too much into one poll.  —  It has been less than a week since President Biden walked out onto the stage of the first presidential debate in Atlanta and upended his political legacy.",
    "url": "https://www.washingtonpost.com/politics/2024/07/02/biden-replacement-debate-harris-cnn-poll/"
  },
  {
    "text": "White House's Day from Hell as Dems Open Fire on Biden  —  COMING UNDONE  —  Tuesday was Joe Biden's day from hell.  But Wednesday could turn out to be much worse.  —  Joe Biden's presidency went from teetering on the brink to being in full freefall on Tuesday.",
    "url": "https://www.thedailybeast.com/joe-bidens-presidency-is-in-freefall-as-democrats-round-on-him-and-talk-kamala-harris-as-replacement"
  },
  {
    "text": "KATU Exclusive: Congresswoman Gluesenkamp Perez says “Biden is going to lose to Trump”  —  PORTLAND, Ore. (KATU) — A Washington Democratic Congresswoman says she believes President Biden will lose to former President Donald Trump in November.  —  Democrat Marie Gluesenkamp Perez (WA-3) … ",
    "url": "https://katu.com/news/your-voice-your-vote/katu-exclusive-congresswoman-gluesenkamp-perez-says-biden-is-going-to-lose-to-trump-marie-washington-third-congressional-district-president-joe-donald"
  },
  {
    "text": "Moderate Dem Leader Takes A ‘This Is Fine’ Stance On A Second Trump Presidency  —  In an op-ed, Blue Dog co-chair Rep. Jared Golden (D-Maine) downplayed Jan. 6 and the danger to democracy in the event of Donald Trump victory.  —  LOADING  —  One of the leaders of a group of moderate … ",
    "url": "https://www.huffpost.com/entry/jared-golden-second-trump-term_n_6684644fe4b0e3bf97719ac5"
  },
  {
    "text": "Scoop: Donors eye Senate, House to hedge against a Biden loss … - It's the beginning of a potential massive political hedge, as skittish donors weigh where their dollars can have the most impact.  — It's also an acknowledgment that they view Biden's chances of besting Trump on Nov. 5 as diminishing.",
    "url": "https://www.axios.com/2024/07/02/biden-democratic-donors-senate-house-trump"
  },
  {
    "text": "Poll Suggests Michelle Obama Would Beat Trump by 11 Points  —  IS MICHELLE THE SAVIOR?  —  As the desperate search for a Biden replacement continues amongst Dem insiders and anxious liberals, one possible replacement shines through the dark.  In a recent Reuters/Ispos poll … ",
    "url": "https://www.thedailybeast.com/as-dems-cast-the-search-light-looking-for-biden-alternatives-michelle-obama-trounces-trump-in-reuters-poll"
  },
  {
    "text": "Judge Delays Trump's Sentencing Until Sept. 18 After Immunity Claim  —  Donald J. Trump's lawyers want to argue that a Supreme Court decision giving presidents immunity for official acts should void his felony conviction for covering up hush money paid to a porn star.",
    "url": "https://www.nytimes.com/2024/07/02/nyregion/trump-sentencing-hush-money-trial.html"
  },
  {
    "text": "Justice Dept. plans to pursue Trump cases past Election Day, even if he wins  —  If Donald Trump is elected president, the finish line for federal prosecutors is Inauguration Day, not Election Day, people familiar with the discussions said  —  Justice Department officials plan to pursue … ",
    "url": "https://www.washingtonpost.com/national-security/2024/07/02/justice-dept-trump-prosecute-after-election/"
  },
  {
    "text": "We're Releasing Our Full, Unedited Interview With Joe Biden From September  —  Following Biden's poor debate performance against Donald Trump, we're releasing the full and unedited 21-minute interview we conducted with President Joe Biden nine days before his interview with Special Counsel Robert K. Hur.",
    "url": "https://www.propublica.org/article/biden-interview-unedited-september-2023"
  },
  {
    "text": "President Joe Biden to sit down with ABC News on Friday for first TV interview since debate  —  The president has faced calls to drop out of the race following the debate.  —  President Joe Biden delivers remarks during the CNN Presidential Debate, June 27, 2024, in Atlanta.",
    "url": "https://abcnews.go.com/Politics/president-joe-biden-sit-abc-news-friday-interview/story?id=111618360"
  },
  {
    "text": "Highlighting journalism on Mastodon  —  A new feature for media organizations, journalists and bloggers  —  To reinforce and encourage Mastodon as the go-to place for journalism, we're launching a new feature today.  You will notice that underneath some links shared on Mastodon … ",
    "url": "https://blog.joinmastodon.org/2024/07/highlighting-journalism-on-mastodon/"
  },
  {
    "text": "RFK Jr.'s Family Doesn't Want Him to Run.  Even They May Not Know His Darkest Secrets.  —  A shocking photograph.  Blowback from a Trump meeting.  Alleged sexual assault.  The Kennedys have voiced support for Joe Biden, but certain aspects of Robert F. Kennedy Jr.'s character are only just now coming to light.",
    "url": "https://www.vanityfair.com/news/story/robert-kennedy-jr-shocking-history"
  },
  {
    "text": "Trump immunity decision shows that conservative ‘originalism’ is a farce  —  In Trump v. United States, the Supreme Court's far-right majority showed Americans once again that “textualism” and “originalism” are a ruse.  —  Writing for a 6-3 majority, Chief Justice Roberts announced … ",
    "url": "https://thehill.com/opinion/judiciary/4751056-trump-immunity-decision-shows-that-conservative-originalism-is-a-farce/"
  }
]