[
  {
    "text": "The GOP's True Priority  —  The Republicans who won't take yes for an answer  —  Sometimes, a negotiation produces a deal.  —  Sometimes, a negotiation reveals the truth.  —  Negotiators in the Senate have produced a draft agreement on immigration and asylum.  The deal delivers on Republican priorities.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/republicans-congress-immigration-deal/677357/"
  },
  {
    "text": "A Border Security Bill Worth Passing  —  The Senate bill has reforms Trump never came close to getting.  —  Do Republicans want to better secure the U.S. border, or do they want to keep what has become an open sore festering for another year as an election issue?",
    "url": "https://www.wsj.com/articles/senate-border-security-bill-james-lankford-republicans-immigration-biden-border-patrol-asylum-bc2f9543?mod=followamazon"
  },
  {
    "text": "As a compromise border plan collapses, the GOP is in disarray  —  There can be little doubt that one of the major American political parties is in disarray, but it's not the Democratic Party.  —  For those familiar with online political commentary, the phrase “Dems in disarray” … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/compromise-border-plan-collapses-gop-disarray-rcna137424"
  },
  {
    "text": "Chip Roy: Border package authors 'don't know what they're talking about'  —  Rep. Chip Roy (R-Texas) took aim at bipartisan Senate negotiators for the border security deal revealed over the weekend that he says he will oppose.  —  Roy criticized the proposed deal on CNN's … ",
    "url": "https://thehill.com/homenews/house/4450622-chip-roy-border-package-authors-dont-know-what-theyre-talking-about/"
  },
  {
    "text": "February 5, 2024  —  It's been an exceedingly weird 24 hours.  —  Last night the Senate released the text of the national security supplemental bill on which a bipartisan team of negotiators has been working for four months.  Negotiators were working on adding a border component … ",
    "url": "https://heathercoxrichardson.substack.com/p/february-5-2024"
  },
  {
    "text": "Trump has no immunity from Jan. 6 prosecution, appeals court rules  —  A federal appeals court has unanimously ruled that Donald Trump can be put on trial for trying to stay in power after losing the 2020 election, rejecting Trump's sweeping claim of presidential immunity and moving the case one step closer to a jury.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/02/06/trump-jan-6-immunity-appeal-denied/"
  },
  {
    "text": "Appeals court rules against Trump presidential immunity in 2020 election interference case  —  Trump is likely to ask the Supreme Court to intervene after the ruling, which would allow the trial to go ahead in the criminal case in Washington, D.C.  —  WASHINGTON — A federal appeals court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/appeals-court-rules-trump-presidential-immunity-2020-election-interfer-rcna133234"
  },
  {
    "text": "Chris Christie predicts ‘huge personnel problem’ if Trump is reelected to ‘vendetta presidency’  —  In an exclusive interview, the former governor warned of “absolute mayhem.”  —  Former New Jersey Governor and Republican presidential candidate Chris Christie speaks with George Stephanopoulos from ABC News, Feb. 5, 2024.",
    "url": "https://abcnews.go.com/Politics/chris-christie-predicts-huge-personnel-problem-trump-reelected/story?id=106971895"
  },
  {
    "text": "Christie calls hot mic moment ‘a complete mistake’ in 1st interview since leaving race  —  The former governor sat down exclusively with George Stephanopoulos.  —  Former New Jersey Governor and Republican presidential candidate Chris Christie speaks with George Stephanopoulos from ABC News, Feb. 5, 2024.",
    "url": "https://abcnews.go.com/Politics/christie-calls-hot-mic-moment-complete-mistake-1st/story?id=106974944"
  },
  {
    "text": "Trump Denied Immunity in DC Election Case by Appeals Court  — Three judge panel issues unanimous decision on Trump immunity  — Trump has until Feb. 12 to appeal ruling to Supreme Court  —  Donald Trump can be prosecuted for trying to overturn the 2020 US election, a federal appeals court ruled … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-06/trump-denied-immunity-in-dc-election-case-by-appeals-court"
  },
  {
    "text": "Second GOP rep says he'll vote against Mayorkas impeachment  —  Rep. Tom McClintock (R-Calif.) announced Tuesday that he would vote against a resolution to impeach Homeland Security Secretary Alejandro Mayorkas, becoming the second Republican to buck the party and putting GOP plans in jeopardy.",
    "url": "https://thehill.com/homenews/house/4450627-gop-loses-second-vote-in-effort-to-impeach-mayorkas/"
  },
  {
    "text": "Kari Lake's leaked recording is causing trust issues in the Arizona GOP  —  The Senate candidate was booed by the party faithful after a secret tape forced out the party chair.  Republican officials say they assume they are being recorded when speaking with her.",
    "url": "https://www.washingtonpost.com/politics/2024/02/06/kari-lake-recording/"
  },
  {
    "text": "Biden tells crowd he recently met with Mitterrand, former French president who died in 1996  —  François Mitterrand was France's president between 1981 and 1995  —  President Biden told a crowd in Las Vegas on Sunday that he recently met with Francois Mitterrand, the French president who has been dead for nearly 30 years.",
    "url": "https://www.foxnews.com/politics/biden-tells-crowd-he-recently-met-mitterand-former-french-president-who-died-1996"
  },
  {
    "text": "Bluesky, a trendy rival to X, finally opens to the public  —  The upstart social network has been by invitation only since its launch last year  —  When Jack Dorsey, then Twitter's CEO, tweeted in 2019 that he planned to create a new, “decentralized” form of social media, most people scratched their heads.",
    "url": "https://www.washingtonpost.com/technology/2024/02/06/bluesky-launch-public-jay-graber/"
  },
  {
    "text": "House Dem Brutally Hits Back at Marjorie Taylor Greene's Gross Bathroom Claim  —  The MAGA lawmaker was seemingly upset about Rep. Jim McGovern likening her to a clown.  —  A House Democrat got into a wild war of words with Rep. Marjorie Taylor Greene on Monday involving mutual accusations … ",
    "url": "https://www.thedailybeast.com/house-dem-brutally-hits-back-at-marjorie-taylor-greenes-gross-bathroom-claim"
  },
  {
    "text": "Senate Investigation “Casts Fresh Doubt” About the Validity of Harlan Crow's Yacht Tax Deductions  —  In their extensive probe, Senate investigators found evidence to suggest Crow has made repeated misrepresentations to the U.S. government.  ProPublica revealed the tax maneuvers in a previous story.",
    "url": "https://www.propublica.org/article/senate-probe-casts-doubt-harlan-crow-yacht-tax-deductions"
  },
  {
    "text": "Trump meets with Ronna McDaniel — then says he'll be recommending RNC changes  —  The former president has his eye on revamping the committee.  —  Donald Trump met with Republican National Committee Chairwoman Ronna McDaniel Monday, one day after the former president said he expected there to be “changes” at the RNC.",
    "url": "https://www.politico.com/news/2024/02/05/trump-ronna-mcdaniel-rnc-changes-00139780"
  },
  {
    "text": "Nikki Haley Asks for Secret Service Protection After Increase in Threats  —  Former South Carolina governor is final hurdle between Trump and the Republican presidential nomination  —  AIKEN, S. C.—Republican presidential candidate Nikki Haley has applied for Secret Service protection … ",
    "url": "https://www.wsj.com/politics/elections/nikki-haley-asks-for-secret-service-protection-after-increase-in-threats-05b67a22?mod=followamazon"
  }
]