[
  {
    "text": "Israel steps up Gaza strikes and battles Hamas fighters as deaths near 1,200  —  Protests erupt after Israel strikes Gaza  —  Five Gazan children from same family found dead after Israeli airstrike  —  Israel increased airstrikes on the Gaza Strip and sealed it off from food, fuel … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-airstrikes-hostages-4377e096f62bf535bebcdff38cf16049"
  },
  {
    "text": "How Hamas duped Israel as it planned devastating attack  —  A careful campaign of deception ensured Israel was caught off guard when the Palestinian Islamist group Hamas launched its devastating attack, enabling a force using bulldozers, hang gliders and motorbikes to take on the Middle East's most powerful army.",
    "url": "https://www.reuters.com/world/middle-east/how-israel-was-duped-hamas-planned-devastating-assault-2023-10-08/"
  },
  {
    "text": "Hamas received weapons and training from Iran, officials say  —  Militant group that slaughtered hundreds of Israelis received crucial help from Tehran  —  The Palestinian militants behind the surprise weekend attack on Israel began planning the assault at least a year ago … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/09/iran-support-hamas-training-weapons-israel/"
  },
  {
    "text": "Robert F. Kennedy Jr. to Run for President as Independent, Leaving Democratic Primary  —  The political scion told supporters he would end his campaign as a Democratic candidate and run as an independent, potentially upsetting the dynamics of the 2024 election.",
    "url": "https://www.nytimes.com/2023/10/09/us/politics/robert-f-kennedy-jr-independent.html"
  },
  {
    "text": "Robert F. Kennedy Jr. Promises to Spoil the Election  —  Three words told the story.  Robert F. Kennedy Jr.'s campaign had billed this afternoon's event in Philadelphia as a “much-anticipated announcement.”  Of course, that specific phrase may have been more true than intended.",
    "url": "https://www.theatlantic.com/politics/archive/2023/10/robert-f-kennedy-president-independent/675595/"
  },
  {
    "text": "Four Steps for the U.S. to Help Israel  —  Make munitions transfers, offer intelligence support, and impose costs on state sponsors of terrorism.  —  As hundreds of Iranian-backed terrorists stormed into Israel on Saturday to butcher children and elders, kidnap Israeli civilians … ",
    "url": "https://www.wsj.com/articles/mitch-mcconnell-four-steps-for-america-to-help-israel-war-hamas-iran-cf531f1?mod=followamazon"
  },
  {
    "text": "Statement from President Joe Biden on American Citizens Impacted in Israel  —  As we continue to account for the horrors of the appalling terrorist assault against Israel this weekend and the hundreds of innocent civilians who were murdered, we are seeing the immense scale and reach of this tragedy.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/10/09/statement-from-president-joe-biden-on-american-citizens-impacted-in-israel/"
  },
  {
    "text": "Kevin McCarthy says he's willing to return as House speaker  —  Rep. Kevin McCarthy (R-Calif.) said Monday that he is willing to resume serving as House speaker if enough of the Republicans who voted in favor of his ouster last week are open to his reinstatement.",
    "url": "https://www.washingtonpost.com/politics/2023/10/09/house-republican-speaker/"
  },
  {
    "text": "The Israel-Hamas War Is Drowning X in Disinformation  —  People who have turned to X for breaking news about the Israel-Hamas conflict are being hit with old videos, fake photos, and video game footage at a level researchers have never seen.  —  In the wake of Hamas' deadly attacks on Israel this weekend … ",
    "url": "https://www.wired.com/story/x-israel-hamas-war-disinformation/"
  },
  {
    "text": "One of Trump's Georgia Co-Defendants Suggests She'll Be His Next White House Press Secretary  —  Trevian Kutti, a former publicist for Ye, posted: “I look forward to redeeming Black women in politics by becoming Press Secretary to the 47th President of the United States @realDonaldTrump”",
    "url": "https://themessenger.com/politics/trump-georgia-codefendant-trevian-kutti-ye-white-house-press-secretary"
  },
  {
    "text": "There Are No Rules  —  States and quasi-states are using extreme, uninhibited violence against civilian populations.  —  The “rules-based world order” is a system of norms and values that describe how the world ought to work, not how it actually works.  This aspirational order is rooted … ",
    "url": "https://www.theatlantic.com/international/archive/2023/10/israel-war-hamas-terrorism-ukraine-russia/675590/"
  },
  {
    "text": "Biden interviewed about classified documents found at his office, home  —  Special counsel Robert Hur, who has been investigating for months, conducted the interview of the president, a person familiar with the situation said  —  President Biden was interviewed over the last two days as part … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/09/biden-classified-documents-interview/"
  },
  {
    "text": "Nine Americans Killed by Hamas in Israel, US Confirms  —  The United States on Monday said nine Americans were killed in Israel and other U.S. citizens were missing, following Saturday's unprecedented Hamas attack that killed 700 Israelis.  —  “At this time, we can confirm the deaths of nine U.S. citizens … ",
    "url": "https://freebeacon.com/latest-news/nine-americans-killed-in-massive-hamas-terror-attack-on-israel-us-confirms/"
  },
  {
    "text": "Top Senate Republicans seek to reprimand Willis over Trump charges  —  Georgia Senate leaders ask new state panel to launch investigation into Fulton's top prosecutor  —  Georgia Senate Republicans filed a formal complaint to punish Fulton County District Attorney Fani Willis after she sought charges … ",
    "url": "https://www.ajc.com/politics/top-senate-republicans-seek-to-reprimand-willis-over-trump-charges/2HB45YLJUNCFLODJXRHQ4USPN4/"
  },
  {
    "text": "Benjamin Netanyahu failed Israel  —  We can now be sure: His policy of repressing Palestinians doesn't make Israelis safe.  —  In the past 24 hours, two reports out of Israel have pointed to a striking conclusion: that the failure to prevent Hamas's murderous assault on southern Israel rests … ",
    "url": "https://www.vox.com/23910085/netanyahu-israel-right-hamas-gaza-war-history"
  },
  {
    "text": "Joint Statement on Israel  —  Today, we — President Macron of France, Chancellor Scholz of Germany, Prime Minister Meloni of Italy, Prime Minister Sunak of the United Kingdom, and President Biden of the United States — express our steadfast and united support to the State of Israel … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/10/09/joint-statement-on-israel/"
  },
  {
    "text": "Survivors of the music festival massacre tell their stories (Update)  —  On the day of the Hamas attack, there was a music festival happening in the desert not far from the Gaza security fence.  Hundreds of young people had been up dancing all night and were just settling down around 6am when they heard rockets passing overhead.",
    "url": "https://hotair.com/john-s-2/2023/10/09/survivors-of-the-music-festival-massacre-tell-their-stories-n583461"
  },
  {
    "text": "Ken Paxton to file criminal complaints against Texas House impeachment managers  —  Texas Attorney General Ken Paxton said Monday he plans to file criminal complaints against the group of state representatives who led the impeachment against him for releasing his personal information.",
    "url": "https://www.rawstory.com/ken-paxton-to-file-criminal-complaints-against-texas-house-impeachment-managers/"
  },
  {
    "text": "Blinken slammed for tweet pushing Israel-Hamas cease-fire: ‘Any actual adults in charge?’  —  Secretary of State Antony Blinken caused an uproar over the weekend with a since-deleted social media post in which he encouraged a cease-fire between Israel and Hamas.",
    "url": "https://nypost.com/2023/10/09/blinken-gets-blowback-for-now-deleted-sunday-post-promoting-cease-fire-in-israel/"
  },
  {
    "text": "Army to Congress: Do your job so we can help Israel and Ukraine  —  Urgent requests for weapons will run up against the House speaker drama and the looming shutdown.  —  The U.S. Army wants to help supply both its Ukrainian and Israeli allies with as many bombs and other equipment as they need in their separate wars.",
    "url": "https://www.politico.com/news/2023/10/09/army-congress-israel-ukraine-military-aid-00120618"
  }
]