[
  {
    "text": "Harlan Crow Provided Clarence Thomas at Least 3 Previously Undisclosed Private Jet Trips, Senate Probe Finds  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Billionaire political donor Harlan … ",
    "url": "https://www.propublica.org/article/clarence-thomas-harlan-crow-private-jet-flights-senate-investigation-scotus"
  },
  {
    "text": "Clarence Thomas took 3 undisclosed trips on private jet provided by GOP megadonor, committee says  —  Washington — Supreme Court Justice Clarence Thomas took three undisclosed trips aboard a private jet provided by Republican megadonor Harlan Crow between 2017 and 2021 … ",
    "url": "https://www.cbsnews.com/news/clarence-thomas-private-jet-flights-harlan-crow-supreme-court/"
  },
  {
    "text": "‘Like Talking to Your Drunk Uncle’: Trump's Closed-Door Rant to House Republicans … Donald Trump came to the Capitol Hill Club Thursday morning supposedly to discuss his agenda for a second term with House Republicans.  Instead, Trump treated his meeting as an opportunity to deliver a behind-closed-doors … ",
    "url": "https://www.notus.org/trump-2024/like-talking-to-your-drunk-uncle-trump-closed-door-rant-house-republicans"
  },
  {
    "text": "What Trump told CEOs in their private meeting … Donald Trump huddled with at least 80 CEOs on Thursday in Washington with a clear pitch to them: If he is elected president again in November, the CEOs are going to see tax cuts and a curtailment of business regulations.",
    "url": "https://www.cnbc.com/2024/06/13/what-trump-told-ceos-in-their-private-meeting.html"
  },
  {
    "text": "Donald Trump calls Milwaukee ‘a horrible city’ weeks before RNC comes to town  —  Molly Beck Lawrence AndreaMilwaukee Journal Sentinel  —  WASHINGTON - Donald Trump on Thursday called Milwaukee — where in a little over a month he will be declared the Republican nominee for president — a “horrible city.”",
    "url": "https://www.jsonline.com/story/news/politics/2024/06/13/trump-calls-milwaukee-host-for-the-2024-rnc-a-horrible-city/74083831007/"
  },
  {
    "text": "The case centered on mifepristone, a drug long approved by the F.D.A. Here's the latest.  —  The justices unanimously rejected a bid to sharply curtail access to a widely available abortion pill, finding that the plaintiffs did not have standing to sue.  —  The case centered on mifepristone … ",
    "url": "https://www.nytimes.com/live/2024/06/13/us/abortion-pill-supreme-court"
  },
  {
    "text": "World losers gather at G7 summit … - Biden's 37% approval rating positively sparkles next to Canadian PM Justin Trudeau (30%), German Chancellor Olaf Scholz (25%), U.K. Prime Minister Rishi Sunak (25%), French President Emmanuel Macron (21%) and Japanese PM Fumio Kishida (13%), per Morning Consult's tracker.",
    "url": "https://www.axios.com/2024/06/13/g7-summit-2024-unpopular-leaders-biden-trudeau"
  },
  {
    "text": "The Stanford Internet Observatory is being dismantled  —  After five years of pioneering research into the abuse of social platforms, the Stanford Internet Observatory is winding down.  Its founding director, Alex Stamos, left his position in November.  Renee DiResta, its research director … ",
    "url": "https://www.platformer.news/stanford-internet-observatory-shutdown-stamos-diresta-sio/"
  },
  {
    "text": "Campaigns Can Now See What You Watch on TV.  It's Changing Everything. … Political aide turned data guru Jesse Contario works in the shadows.  His employer, MiQ, will never be mentioned at the end of a campaign ad, and it won't show up on the disclosures campaigns must post to keep the public abreast of their work.",
    "url": "https://www.notus.org/2024-election/streaming-tv-campaign-ads"
  },
  {
    "text": "Senate Republicans Say They Have an Alternative to Protecting IVF … As Senate Democrats prepare a largely symbolic vote on a bill that would create federal protections for in vitro fertilization and other fertility treatments, Republicans are introducing a bill to promote a new medical technology … ",
    "url": "https://www.notus.org/policy/senate-bill-ivf"
  },
  {
    "text": "OpenAI adds Trump-appointed former NSA director to its board  —  Paul M. Nakasone joins OpenAI's board following a dramatic shakeup, as a tough regulatory environment pushes tech companies to board members with military expertise.  —  OpenAI has tapped former U.S. Army general … ",
    "url": "https://www.washingtonpost.com/technology/2024/06/13/openai-board-paul-nakasone-nsa/"
  },
  {
    "text": "Potential VP pick Sen. J.D. Vance once liked tweets harshly critical of Trump  —  Republican Ohio Sen. J.D. Vance, a leading candidate to be Donald Trump's vice president, liked tweets in 2016 and 2017 that harshly criticized Trump and his policies — including one speculating that Vance … ",
    "url": "https://www.cnn.com/2024/06/13/politics/kfile-jd-vance-harsh-twitter-likes-trump-vice-president/"
  },
  {
    "text": "‘Really Uncomfortable’: 16-Year-Old Girl Speaks Out About Having to Share School Restrooms, Locker Rooms With Males  —  A 16-year-old Minnesota girl forced to share private spaces with males under a public school transgender policy says that girls deserve privacy in their restrooms and locker rooms.",
    "url": "https://www.dailysignal.com/2024/06/13/really-uncomfortable-16-year-old-girl-speaks-sharing-school-bathrooms-locker-rooms-males/"
  },
  {
    "text": "Major veterans organization weighs in on upside-down American flags  —  The American Legion said flags should be flown upside down only if there is “extreme danger to life or property.”  —  WASHINGTON — The veteran organization the American Legion weighed in on the upside-down American flag controversy … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/american-legion-weighs-upside-american-flags-rcna157086"
  },
  {
    "text": "Schiff repeats ‘guilty’ 34 times at hearing on Trump prosecution  —  Rep. Adam Schiff (D-Calif.) sought to make a statement about former President Trump's criminal conviction Thursday, repeating the word “guilty” 34 times in a row, once for each of the former president's guilty counts in the Manhattan hush money case.",
    "url": "https://thehill.com/homenews/house/4720436-adam-schiff-donald-trump-hearing-investigation-conviction-hush-money-34-charges/"
  },
  {
    "text": "Supreme Court rejects effort to trademark “Trump too small” phrase … - The phrase stemmed from taunts between Trump and Sen. Marco Rubio (R-Fla.) during the 2016 Republican presidential primary. … - “Such restrictions have historically been grounded in the notion that a person has ownership … ",
    "url": "https://www.axios.com/2024/06/13/supreme-court-rejects-trump-too-small-trademark"
  },
  {
    "text": "Trump Angrily Demanded Mike Johnson Help Overturn Conviction: Report  —  The former president is working directly with congressional Republicans to undermine his hush-money conviction  —  Donald Trump may be the first American president convicted of a felony, but he has no plans … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-demanded-mike-johnson-overturn-conviction-1235039437/"
  },
  {
    "text": "Microsoft exec vows to fix security gaps that let China-linked hackers get federal emails, but defends presence in China  —  Brad Smith told Congress that after a spate of major security lapses Microsoft is carrying out “the single largest cybersecurity engineering project in the history of digital technology.”",
    "url": "https://www.nbcnews.com/politics/national-security/microsoft-vows-fix-security-gaps-china-hackers-government-emails-rcna156995"
  },
  {
    "text": "Fort Worth Man Charged With Threatening Federal Agent: ‘Guns Will Come Out’  —  For Immediate Release  —  U.S. Attorney's Office, Northern District of Texas  —  A Fort Worth man has been charged with threatening an FBI agent involved in a high-profile investigation, announced U.S. Attorney … ",
    "url": "https://www.justice.gov/usao-ndtx/pr/fort-worth-man-charged-threatening-federal-agent-guns-will-come-out"
  },
  {
    "text": "US Returns $156 Million Misappropriated 1MDB Funds to Malaysia  —  The US Justice Department said it returned an additional $156 million in misappropriated 1MDB funds to Malaysia, a month after the Southeast Asian nation sought extra compensation from US authorities.",
    "url": "https://www.bloomberg.com/news/articles/2024-06-14/us-returns-156-million-misappropriated-1mdb-funds-to-malaysia"
  },
  {
    "text": "Gen Z influencers who supported Biden in 2020 turn against him  —  The Gaza war, lack of progress on climate change and a potential TikTok ban are spawning anti-Biden content — even among former supporters.  —  In 2020, hundreds of top TikTok content creators banded together in service of a single goal: get Joe Biden elected.",
    "url": "https://www.washingtonpost.com/technology/2024/06/13/influencers-biden-tiktok-ban/"
  },
  {
    "text": "‘Scared to put on my mask’: Cancer patient says she was intentionally coughed on in spat over mask  —  The Republican-led state House passed a bill Tuesday that would adjust exceptions to the state law governing masks.  The bill is awaiting a decision by Gov. Roy Cooper.",
    "url": "https://www.wral.com/story/scared-to-put-on-my-mask-cancer-patient-says-she-was-intentionally-coughed-on-in-spat-over-mask/21478890/"
  },
  {
    "text": "The Disturbing Truth About Hair Relaxers … A woman at a salon having relaxer applied to her hair.  —  The phone rang incessantly in Dr. Tamarra James-Todd's office at Harvard's T.H. Chan School of Public Health.  “I'm sorry,” she said, excusing herself for the third time.",
    "url": "https://www.nytimes.com/2024/06/13/magazine/hair-relaxers-cancer-risk.html"
  },
  {
    "text": "171,000 Traveled for Abortions Last Year.  See Where They Went.  —  N.D.  —  Hawaii  —  Minn.  —  Ore.  —  N.Y.  —  Idaho  —  Wis.  —  Mass.  —  S.D.  —  Mich.  —  Nev.  —  N.J.  —  Ohio  —  D.C.  —  Ill.  —  Ind.  —  Utah  —  Colo.  —  W.Va  —  Md.  —  Calif.",
    "url": "https://www.nytimes.com/interactive/2024/06/13/us/abortion-state-laws-ban-travel.html"
  },
  {
    "text": "Biden campaign calls on GOP to drop lawsuits over mail ballots, citing Trump's new fondness for it  —  President Joe Biden's reelection campaign on Thursday called on top Republicans to drop litigation seeking to curtail aspects of mail balloting now that Donald Trump has begun to embrace the method.",
    "url": "https://apnews.com/article/trump-rnc-mail-voting-lawsuits-biden-2024-2fc014f81be782ee59e8d53ee824d8aa"
  }
]