[
  {
    "text": "U.S. Spy Agencies Assess Iran Remains Undecided on Building a Bomb  —  U.S. intelligence officials said Iran was likely to pivot toward producing a nuclear weapon if the U.S. attacked a main uranium enrichment site, or if Israel killed its supreme leader.  —  U.S. intelligence agencies continue … ",
    "url": "https://www.nytimes.com/2025/06/19/us/politics/iran-nuclear-weapons-assessment.html"
  },
  {
    "text": "Mahmoud Khalil Must Be Released on Bail, Federal Judge Orders  —  Mr. Khalil, a Columbia graduate and legal permanent resident, has been held in Louisiana for over three months.  The judge found reason to believe it was retaliation for his pro-Palestinian speech.",
    "url": "https://www.nytimes.com/2025/06/20/nyregion/mahmoud-khalil-release-order.html?unlocked_article_code=1.QU8.jeEe._uZk1wmi4w62&smid=url-share"
  },
  {
    "text": "Judge says he will order Columbia University protester Mahmoud Khalil freed from detention  —  A federal judge says he'll order Palestinian activist Mahmoud Khalil released from immigration detention.  Judge Michael Farbiarz made the ruling from the bench in federal court in New Jersey on Friday.",
    "url": "https://apnews.com/article/mahmoud-khalil-release-columbia-protest-trump-immigration-69162d21ab22377b1c1c08cf2c83d6cd"
  },
  {
    "text": "Clyburn Endorses Cuomo, Helping Him Broaden His Appeal to Black Voters  —  Representative James E. Clyburn of South Carolina is endorsing former Gov. Andrew M. Cuomo in the New York City mayor's race as the June 24 primary nears.  —  Representative James E. Clyburn of South Carolina … ",
    "url": "https://www.nytimes.com/2025/06/20/nyregion/clyburn-endorses-cuomo-mayor.html"
  },
  {
    "text": "Appeals Court Lets Trump Keep Control of California National Guard in L.A.  —  A panel rejected a lower court's finding that it was likely illegal for President Trump to use state troops to protect immigration agents from protests.  —  A federal appeals court on Thursday cleared … ",
    "url": "https://www.nytimes.com/2025/06/19/us/california-national-guard-trump.html"
  },
  {
    "text": "Senate parliamentarian knocks pieces out of Trump's megabill  —  Senate Parliamentarian Elizabeth MacDonough has ruled that several key pieces of the massive bill to implement President Trump's agenda run afoul of the Byrd Rule and must be taken out of the package to allow it to pass … ",
    "url": "https://thehill.com/homenews/senate/5360488-parliamentarian-rules-bill-trump-agenda/"
  },
  {
    "text": "ICE believes it will never face accountability again  —  The Trump administration is letting an unaccountable secret police form at the heart of our democracy. … Day by passing day, we are watching what amounts to a national police riot by ICE. … In recent days, ICE … ",
    "url": "https://www.doomsdayscenario.co/p/ice-believes-it-will-never-face-accountability-again"
  },
  {
    "text": "Layoff notices delivered to hundreds of Voice of America employees  —  Layoff notices were sent Friday to 639 employees of Voice of America and the U.S. agency that oversees it, effectively shutting down the outlet that has provided news to countries around the world since World War II.",
    "url": "https://apnews.com/article/voice-of-america-layoffs-trump-global-media-7a862bdc530dd3d48657c00d2df54539"
  },
  {
    "text": "Treasured Public Lands on the Auction Block in Trump's ‘Big Beautiful Bill’  —  250 million acres of federal land are at risk for sale to the highest bidder under Senate provision  —  Every Summer, my wife and I pack up our three kids and the family dog and drive an hour-and-a-half from our home … ",
    "url": "https://www.rollingstone.com/politics/politics-features/public-land-highest-bidder-trump-big-beautiful-bill-1235369151/"
  },
  {
    "text": "French Lawmaker Says He Was Denied Entry Into the United States  —  Pouria Amirshahi, a leftist member of Parliament, hopes that the decision will be reversed so that he can travel to meet lawmakers to understand life under President Trump.  —  A French member of Parliament … ",
    "url": "https://www.nytimes.com/2025/06/19/world/europe/france-lawmaker-denied-visa-us-trump-amirshahi.html"
  },
  {
    "text": "‘We are heartbroken’: Hoffmans release public statement after shooting  —  Yvette Hoffman has been released from the hospital as John remains in critical but stable condition. … CHAMPLIN, Minn. — State Senator John Hoffman and his wife Yvette have released a statement to the public five days … ",
    "url": "https://www.kare11.com/article/news/local/hoffman-hortman-statement-minnesota-shooting/89-5fb5baf5-8293-4397-b57d-69a265571bd4"
  },
  {
    "text": "Ohio man arrested in investigation into GOP Rep. Max Miller being ‘run off the road’  —  Police arrested an Ohio man in their investigation into a Thursday road rage incident in which Rep. Max Miller (R-Ohio) said he was “run off the road” by a person with a Palestinian flag.",
    "url": "https://www.politico.com/live-updates/2025/06/20/congress/max-miller-investigation-arrest-00415398"
  },
  {
    "text": "Josh Hawley warns Senate leaders: Medicaid crackdown won't fly in the House  —  Sen. Josh Hawley is urging GOP leaders to strike Senate Finance Committee language altering a key Medicaid financing provision, warning he's already hearing from House Republicans that it can't clear their chamber.",
    "url": "https://www.politico.com/live-updates/2025/06/20/congress/provider-tax-crackdown-is-a-no-go-in-the-house-hawley-warns-00414844"
  },
  {
    "text": "The top priority of progressive politics may be slipping out of reach forever  —  Four years ago, America was on the cusp of the largest expansion of its welfare state since the 1960s.  —  Under Joe Biden in 2021, House Democrats passed legislation that would have established a monthly child allowance … ",
    "url": "https://www.vox.com/politics/417108/trumps-tax-cuts-medicaid-food-stamps-democrats-welfare-state"
  },
  {
    "text": "Trump calls for special prosecutor to investigate 2020 election, reviving longstanding grievance  —  President Donald Trump on Friday called for the appointment of a special prosecutor to investigate the 2020 election won by Democrat Joe Biden, repeating his baseless claim that the contest was marred by widespread fraud.",
    "url": "https://apnews.com/article/trump-special-prosecutor-2020-biden-election-194b3d49f49b0345f77873fc34b4dcc5"
  },
  {
    "text": "So, has anything actually gotten more expensive because of Trump's tariffs?  —  Predictions from mainstream economists were dire after President Donald Trump launched his tariff campaign just a couple weeks after he began his second term in office: Prices would rise — sharply — they said … ",
    "url": "https://cnn.com/2025/06/20/business/tariff-price-increases-inflation-explained"
  },
  {
    "text": "Rand Paul broke with his own party on border security funding.  Then his party broke with him.  —  The Kentucky senator has found himself cut out of negotiations over his own committee's portion of the GOP megabill.  —  As chair of the Senate Homeland Security and Governmental Affairs Committee … ",
    "url": "https://www.politico.com/news/2025/06/20/rand-paul-trump-republican-border-00414101"
  },
  {
    "text": "Six former CDC vaccine advisory committee chairs warn: U.S. risks losing access to life-saving immunizations  —  Vaccine development, licensure, recommendations, and monitoring are all under attack  —  As former chairs of the CDC's Advisory Committee on Immunization Practices (",
    "url": "https://www.statnews.com/2025/06/20/acip-cdc-vaccine-advisory-committee-chairs-warn-threats-immunization-science-licensure/"
  },
  {
    "text": "Federal judge blocks Trump effort to keep Harvard from hosting foreign students  —  A federal judge on Friday blocked the Trump administration's efforts to keep Harvard University from hosting international students.  An order from U.S. District Judge Allison Burroughs preserves the ability … ",
    "url": "https://apnews.com/article/harvard-trump-foreign-students-9498074cfe5f1054a712b9c21d36c6c5"
  },
  {
    "text": "Man charged with attempted kidnapping of Democratic Memphis mayor  —  A man was arrested and charged on Wednesday for stalking and attempted kidnapping of the mayor of Memphis, Tennessee.  —  The big picture: Recent political violence and threats against Democrats has unnerved lawmakers in a heightened partisan environment.",
    "url": "https://www.axios.com/2025/06/20/memphis-tennessee-mayor-kidnap-arrest"
  }
]