[
  {
    "text": "Trump Is No Gerald Ford  —  No other president has used an assassination attempt to inflame American politics the way Donald Trump does.  —  Every American has the right to participate in public life without violence, and that includes Donald Trump.  Personally, I think he probably belongs in jail … ",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/09/trump-is-no-gerald-ford/679900/"
  },
  {
    "text": "Trump's golf outings have long concerned Secret Service  —  Sunday's episode in West Palm Beach made gravely apparent the security challenges at the former president's private golf courses.  —  Soon after Donald Trump became president, authorities tried to warn him about the risks posed … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/16/trump-golf-courses-secret-service-protection/"
  },
  {
    "text": "Harris leads Trump in Pennsylvania — and two bellwether PA counties — exclusive poll finds  —  Joey Garrison Michael CollinsUSA TODAY  —  WASHINGTON - Democratic presidential nominee Kamala Harris narrowly leads former President Donald Trump in the critical battleground state of Pennsylvania … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/16/harris-trump-pennsylvania-poll/75236006007/"
  },
  {
    "text": "Morning Report — Will two assassination attempts alter the election?  —  Editor's note: The Hill's Morning Report is our daily newsletter that dives deep into Washington's agenda.  To subscribe, click here or fill out the box below.  —  Close  —  Thank you for signing up!",
    "url": "https://thehill.com/newsletters/morning-report/4883482-two-assassination-attempts-donald-trump-2024-election/"
  },
  {
    "text": "Elon Musk Is a National Security Risk  —  Musk's now-deleted post questioning why no one has attempted to assassinate Joe Biden and Kamala Harris renews concerns over his work for the US government—and potential to inspire extremist violence.  —  Shortly following reports … ",
    "url": "https://www.wired.com/story/elon-musk-biden-harris-assassination-post-x/"
  },
  {
    "text": "US Secret Service says it is aware of Musk post about Biden, Harris  —  The U.S. Secret Service said on Monday it was aware of a post by billionaire Elon Musk on the X social media platform musing about an absence of assassination attempts on President Joe Biden and Vice President Kamala Harris.",
    "url": "https://www.reuters.com/world/us/us-secret-service-says-it-is-aware-musk-post-about-biden-harris-2024-09-16/"
  },
  {
    "text": "Omnipresent AI cameras will ensure good behavior, says Larry Ellison  —  “We're going to have supervision,” says billionaire Oracle co-founder Ellison.  —  On Thursday, Oracle co-founder Larry Ellison shared his vision for an AI-powered surveillance future during a company financial meeting, reports Business Insider.",
    "url": "https://arstechnica.com/information-technology/2024/09/omnipresent-ai-cameras-will-ensure-good-behavior-says-larry-ellison/"
  },
  {
    "text": "Man accused of trying to kill Trump wrote a book urging Iran to assassinate the ex-president  —  Ryan Wesley Routh portrayed himself online as a man who built housing for homeless people in Hawaii, tried to recruit fighters for Ukraine to defend itself against Russia, and described his support … ",
    "url": "https://apnews.com/article/trump-assassination-attempt-suspect-ukraine-f76ed09f256f6bd21727a10901d92af7"
  },
  {
    "text": "Mark Meadows's Arizona charges to stay in state court, federal judge rules  —  The ruling is a setback for the former Trump White House chief of staff, who unsuccessfully tried the same legal maneuver in a separate case in Georgia.  —  A judge has denied a request from Mark Meadows … ",
    "url": "https://www.washingtonpost.com/national-security/2024/09/16/mark-meadows-arizona-federal-court/"
  },
  {
    "text": "Vote for Kamala Harris to Support Science, Health and the Environment  —  Kamala Harris has plans to improve health, boost the economy and mitigate climate change.  Donald Trump has threats and a dangerous record  —  In the November election, the U.S. faces two futures.",
    "url": "https://www.scientificamerican.com/article/vote-for-kamala-harris-to-support-science-health-and-the-environment/"
  },
  {
    "text": "Reggaeton Star Nicky Jam Deletes Endorsement After Donald Trump Misgendering  —  HOT TO COLD  —  Jam, who was introduced by Trump as a “hot” woman, disabled the comment section of a recent Instagram post after being mocked by commentators.  —  Reggaeton star Nicky Jam seems to be rolling … ",
    "url": "https://www.thedailybeast.com/reggaeton-star-nicky-jam-deletes-trump-post-amid-misgendering-backlash"
  },
  {
    "text": "Giuliani Takes Another L in Court as Judge Tosses His Suit Against Biden  —  CAN'T CATCH A BREAK  —  Last October, Giuliani sued Biden for saying during a 2020 presidential debate that Giuliani was a “Russian pawn.”  —  Cash-strapped former Donald Trump adviser Rudy Giuliani's defamation lawsuit … ",
    "url": "https://www.thedailybeast.com/giuliani-takes-another-l-in-court-as-judge-tosses-his-suit-against-biden"
  },
  {
    "text": "In an Unprecedented Move, Ohio Is Funding the Construction of Private Religious Schools  —  The state is giving millions in taxpayer dollars directly to private schools to help them renovate and expand their campuses.  It may be the next frontier in the push to increase the use of school vouchers, proponents say.",
    "url": "https://www.propublica.org/article/ohio-taxpayer-money-funding-private-religious-schools"
  },
  {
    "text": "Meta bans RT, days after U.S. accuses Russian outlet of disinformation  —  U.S. officials on Friday accused RT of carrying out covert information warfare operations around the world as an arm of Russia's spy agencies.  —  Social media giant Meta on Monday announced that it is banning Russian … ",
    "url": "https://www.nbcnews.com/news/us-news/meta-bans-rt-russian-disinformation-rcna171402"
  },
  {
    "text": "House Dems' ‘sleeper’ seats suddenly in sight  —  With assists from POLITICO's Congress team  —  MIDWEST MOMENTUM ... OR MIRAGE?  —  The Kamala Harris effect has House Democrats thinking they can gain seats in a place they've been losing for years: the Midwest.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/09/16/house-dems-sleeper-seats-suddenly-in-sight-00179407"
  },
  {
    "text": "Senate Republicans losing patience with Johnson as shutdown nears  —  Republican senators are fast losing patience with Speaker Mike Johnson's (R-La.) inability to muster the votes to avoid a government shutdown at the end of September, and are warning they will take matters into their own hands if the House fails to act by Thursday.",
    "url": "https://thehill.com/homenews/senate/4883059-senate-republicans-losing-patience-with-johnson-as-shutdown-nears/"
  },
  {
    "text": "U.S. Authorities Were Warned About Suspected Trump Gunman  —  Ryan Routh criticized Trump and threatened to kill Vladimir Putin, setting off alarm bells among those involved in Ukraine assistance efforts  —  in West Palm Beach, Fla., and Vera Bergengruen in Washington",
    "url": "https://www.wsj.com/us-news/u-s-authorities-were-warned-about-suspected-trump-gunman-153dab6f?st=dHi5Ft&reflink=article_copyURL_share"
  },
  {
    "text": "Ex-Trump aide says old boss is one of the ‘biggest offenders of escalatory rhetoric’  —  A former White House director of strategic communications for Donald Trump called for toning down “political rhetoric” following the second assassination plot against Trump — and called her old boss “one of the biggest offenders.”",
    "url": "https://www.rawstory.com/alyssa-farah-griffin-2669216328/"
  },
  {
    "text": "Tense Teamsters Meeting With Harris Ends With an Endorsement Still Dangling  —  The Teamsters president, Sean O'Brien, indicated he could announce as soon as Wednesday which presidential candidate — if any — the union would back.  —  Vice President Kamala Harris held a sometimes tense meeting … ",
    "url": "https://www.nytimes.com/2024/09/16/us/politics/teamsters-harris.html?unlocked_article_code=1.LU4.JbRE.EcJ0aOgJrw9J&smid=url-share"
  },
  {
    "text": "New details of Trump family crypto project released, including who can buy in … More than two hours into Republican former President Donald Trump's World Liberty Financial launch event on X Monday night, the team behind the Trump family's new crypto project finally unveiled a key detail … ",
    "url": "https://www.cnbc.com/2024/09/16/trump-crypto-world-liberty-financial.html"
  },
  {
    "text": "It Sure Looks Like This GOP Senate Hopeful Doctored One Of His Campaign Ads  —  In a recent TV spot, the logo of a controversial think tank is mysteriously missing from Tim Sheehy's shirt.  —  The campaign of Montana GOP Senate candidate Tim Sheehy appears to have doctored a recent TV advertisement … ",
    "url": "https://www.huffpost.com/entry/tim-sheehy-perc-tv-ad_n_66e87bbfe4b0b7fef832280f"
  }
]