[
  {
    "text": "Live Updates: Trump Guilty on All Counts in Hush-Money Case  —  Donald J. Trump, the former president and presumptive 2024 Republican nominee, was convicted on 34 felony counts of falsifying business records in a case stemming from a payment that silenced a porn star.",
    "url": "https://www.nytimes.com/live/2024/05/30/nyregion/trump-trial-verdict"
  },
  {
    "text": "Is Trump going to prison?  What to know about the possible sentence after his conviction  —  Washington — Former President Donald Trump has now been convicted in the New York “hush money” criminal trial, immediately raising a lot of questions and launching the case into uncharted territory … ",
    "url": "https://www.cbsnews.com/news/donald-trump-convicted-prison-sentence-new-york-criminal-trial/"
  },
  {
    "text": "How Trump's Team Blew It  —  The criminal trial of Donald Trump didn't have to end this way.  —  The prosecution's case had flaws that couldn't be wallpapered over even with weeks of testimony, over 200 exhibits and a polished and persuasive presentation by Alvin Bragg, the Manhattan district attorney, and his team.",
    "url": "https://www.nytimes.com/2024/05/30/opinion/trump-trial-defense.html"
  },
  {
    "text": "Donald Trump Should Drop Out  —  Convicted felon Donald Trump's first words after the historic jury verdict were predictably defiant: “The real verdict is going to be November 5 by the people.”  —  The Biden-Harris campaign's communication director issued a statement (perhaps written … ",
    "url": "https://washingtonmonthly.com/2024/05/30/donald-trump-should-drop-out/"
  },
  {
    "text": "Trump aide declares Larry Hogan's campaign dead … - Hogan's call to respect the rule of law seems to have incensed at least one top Trump advisor.  — “You just ended your campaign,” said Chris LaCivita, a senior Trump advisor, on X in response to Hogan's comments.",
    "url": "https://www.axios.com/2024/05/30/trump-aide-larry-hogan-senate-campaign"
  },
  {
    "text": "Wrong Case, Right Verdict  —  The wrong case for the wrong offense just reached the right verdict.  —  Donald Trump will not be held accountable before the 2024 presidential election for his violent attempt to overturn the previous election.  He will not be held accountable before the election … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/05/wrong-case-right-verdict-trump-guilty/678551/"
  },
  {
    "text": "Donald Trump guilty on all 34 felony charges  —  What you need to know  —  Trump to be sentenced just days before officially becoming the GOP presidential nominee  —  Donald Trump is scheduled to be sentenced just days before the Republican National Convention where it is expected … ",
    "url": "https://www.cnn.com/politics/live-news/trump-hush-money-trial-05-30-24/"
  },
  {
    "text": "How Robert De Niro's advocacy for Biden backfired  —  Editor's Note: David Axelrod, a CNN senior political commentator and host of “The Axe Files,” was a senior adviser to former President Barack Obama and chief strategist for the 2008 and 2012 Obama presidential campaigns.",
    "url": "https://www.cnn.com/2024/05/29/opinions/robert-de-niro-biden-trump-axelrod/"
  },
  {
    "text": "Trump Loses a Big Battle in His Lifelong War Against Accountability  —  His 34 guilty convictions turn this escape artist into a felon.  —  Donald Trump has been in a war with accountability his entire adult life, and accountability has usually lost.  In a New York City courtroom on Thursday … ",
    "url": "https://www.motherjones.com/politics/2024/05/trump-guilty-hush-money-election-interference/"
  },
  {
    "text": "TRUMP FOUND GUILTY ON ALL CHARGES … - Trump's guilty verdict is also likely to fuel his repeated efforts to paint himself as the victim of politically motivated prosecutors.  — Minutes after the verdict, Trump campaign senior adviser Chris LaCivita wrote on the social media platform X: “The FIX was always in ...”",
    "url": "https://www.axios.com/2024/05/30/trump-guilty-new-york-criminal-trial"
  },
  {
    "text": "Trump guilty on all counts in New York criminal trial  —  Trump says he will ‘fight till the end,’ and says ‘this is long from over’  —  Former President Trump was found guilty on all counts in his historic and unprecedented criminal trial, making him the first former president of the United States to be convicted of a crime.",
    "url": "https://www.foxnews.com/politics/ny-v-trump-jury-verdict-former-presidents-historic-criminal-trial"
  },
  {
    "text": "For 20 Years, I Couldn't Say What Donald Trump Did on the Set of The Apprentice.  Now I Can.  —  For 20 years, I couldn't say what I watched the former president do on the set of the show that changed everything.  Now I can.  —  On Jan. 8, 2004, just more than 20 years ago, the first episode of The Apprentice aired.",
    "url": "https://slate.com/culture/2024/05/donald-trump-news-2024-trial-verdict-apprentice.html"
  },
  {
    "text": "Biden secretly gave Ukraine permission to strike inside Russia with US weapons  —  It's a major reversal that will help Ukraine to better defend its second-largest city.  —  The Biden administration has quietly given Ukraine permission to strike inside Russia — solely near the area of Kharkiv … ",
    "url": "https://www.politico.com/news/2024/05/30/biden-ukraine-weapons-strike-russia-00160731"
  },
  {
    "text": "The Federalist CEO Calls For Republicans to Draw Up Lists of Democrats to ‘Put in Prison’ After Trump Verdict  —  Sean Davis, the CEO and co-founder of the the right-wing website The Federalist, called on Republicans to draw up lists of Democrats to “put in prison” in a social media post reacting … ",
    "url": "https://www.mediaite.com/news/the-federalist-ceo-calls-for-republicans-to-draw-up-lists-of-democrats-to-put-in-prison-after-trump-verdict/"
  },
  {
    "text": "False right-wing reports about Trump trial jury instructions fuel threats against judge  —  False reporting and social media commentary about the jury instructions in Trump's hush money trial has spurred calls for the assassination of the judge overseeing the case.",
    "url": "https://www.nbcnews.com/politics/donald-trump/false-right-wing-reports-trump-trial-jury-instructions-fuel-threats-ju-rcna154678"
  },
  {
    "text": "Biden's problems with younger voters are glaring, poll finds  —  Younger voters have been a crucial voting bloc for Democrats for decades.  —  Voters 18-29 years old made up roughly 1 in 6 voters in 2020, and President Biden won them by more than 20 points, according to exit polls.",
    "url": "https://www.npr.org/2024/05/30/nx-s1-4984972/poll-biden-younger-voters-trump"
  },
  {
    "text": "Bystander Shouts ‘You F*cking Suck!’ at Fox News Host Outside Trump Trial  —  DRIVE BY  —  Also calling Gowdy a “c*cksucker,” the unidentified New Yorker sped by on a bicycle during a live TV segment about the Trump trial.  —  A New York bicyclist verbally assailed Fox News host Trey Gowdy … ",
    "url": "https://www.thedailybeast.com/bystander-shouts-you-fcking-suck-at-fox-news-host-outside-trump-trial"
  },
  {
    "text": "John Cuneo's “A Man of Conviction”  —  The former President is found guilty on all thirty-four counts.  —  It's not the first time that news of a verdict against Donald J. Trump has been eagerly awaited by cartoonists, commentators, and the general public.",
    "url": "https://www.newyorker.com/culture/cover-story/cover-story-2024-06-10"
  },
  {
    "text": "Off Leash: Inside the Secret, Global, Far-Right Group Chat  —  In his book In the Garden of Beasts: Love, Terror, and an American Family in Hitler's Berlin, Erik Larson cites a cable sent to the State Department in June 1933 by a U.S. diplomat posted in Germany that provided a far … ",
    "url": "https://newrepublic.com/article/182008/erik-prince-secret-global-group-chat-off-leash"
  },
  {
    "text": "Free IRS online tax filing program coming soon to all states … - Treasury announced earlier this month that more than 140,000 people participated in the Direct File pilot program in a dozen states claiming more than $90 million in refunds.  — The pilot exceeded its 100,000-person target during this past tax season.",
    "url": "https://www.axios.com/2024/05/30/irs-taxes-direct-file-free-program"
  },
  {
    "text": "GOP mega-donor Miriam Adelson to fund colossal super PAC for Trump  —  The casino billionaire is planning to back the newly reconstituted Preserve America effort to help the former president.  —  Republican mega-donor and casino billionaire Miriam Adelson plans to help bankroll a massive super PAC … ",
    "url": "https://www.politico.com/news/2024/05/30/miriam-adelson-republican-trump-super-pac-preserve-america-00160660"
  },
  {
    "text": "NRA can sue ex-NY official it says tried to blacklist it after Parkland shooting, Supreme Court says  —  A unanimous Supreme Court on Thursday cleared the way for a National Rifle Association lawsuit against a former New York state official over claims she pressured companies to blacklist … ",
    "url": "https://apnews.com/article/nra-aclu-parkland-shooting-lawsuit-supreme-court-953424f3fd33f279b0cc2ce050069d48"
  }
]