[
  {
    "text": "Iowa Poll shows Nikki Haley leads Ron DeSantis in Iowa Caucuses.  Donald Trump far ahead  —  Although Nikki Haley has pulled ahead of Ron DeSantis, the Iowa Poll shows clear dangers lurk for her going into a caucus night that could be decided by Iowans' willingness to brave the bitter cold",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2024/01/13/iowa-poll-nikki-haley-leads-ron-desantis-ahead-of-republican-caucus-night-big-lead-for-donald-trump/72216523007/"
  },
  {
    "text": "Iowa's deep freeze scrambles caucus turnout tactics for GOP campaigns  —  The Trump campaign is aiming to prove its organizational competence, while Haley and DeSantis rely on outside groups  —  JOHNSTON, Iowa — The Iowans who answered their doorbells, held back their barking dogs … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/13/iowa-caucus-weather/"
  },
  {
    "text": "Dems could give Haley a boost in Iowa caucuses … - Iowa allows day-of party registration for voters, and Democrats aren't holding in-person presidential caucuses this year.  — That's given mischievous anti-Trump voters “a chance to diminish Trump's inevitability,” as Don McLeese of West Des Moines put it.",
    "url": "https://www.axios.com/2024/01/14/democrats-boost-haley-iowa-trump-desantis"
  },
  {
    "text": "How College-Educated Republicans Learned to Love Trump Again  —  Blue-collar white voters make up Donald Trump's base.  But his political resurgence has been fueled largely by Republicans from the other end of the socioeconomic scale.  —  Working-class voters delivered the Republican Party to Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/01/14/us/politics/trump-college-educated-voters.html"
  },
  {
    "text": "How Iowa Turned the Caucuses Into a Gold Mine  —  Presidential-campaign capitalism brings windfall as state taps candidates and the media  —  DES MOINES, Iowa—When Jimmy Carter crisscrossed this state ahead of the 1976 presidential caucuses, his campaign's Iowa budget was roughly $100,000 in today's dollars.",
    "url": "https://www.wsj.com/politics/policy/iowa-caucus-economy-money-8803f2c0?mod=followamazon"
  },
  {
    "text": "Trump maintains wide lead in Iowa poll, while Haley climbs to second  —  Former president Donald Trump is polling at 48 percent in Iowa, maintaining his wide lead over his two main rivals for the Republican presidential nomination, according to the Des Moines Register/NBC News/Mediacom poll released Saturday night.",
    "url": "https://www.washingtonpost.com/politics/2024/01/13/iowa-poll-trump-haley-desantis/"
  },
  {
    "text": "Where Donald Trump, Nikki Haley, Ron DeSantis stand in final Iowa Poll before caucus night  —  Donald Trump is the first choice of 48% of likely Republican caucusgoers, while former United Nations Ambassador Haley is at 20% and Florida Gov. DeSantis drops to 16%",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2024/01/13/iowa-poll-final-caucus-rankings-for-trump-haley-desantis-ramaswamy/72215669007/"
  },
  {
    "text": "Trump aims to break caucus records, but Iowa sometimes surprises  —  The former president is the heavy favorite, zapping some suspense ahead of Monday's Iowa caucuses, but Nikki Haley and Ron DeSantis are angling for a surprise showing.  —  DES MOINES — Donald Trump's expected march … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/13/trump-iowa-caucuses-republican-records/"
  },
  {
    "text": "John Kerry to step down as top U.S. climate change negotiator  —  The U.S. special climate envoy, who turned 80 last year, is expected to depart from the Biden administration by the spring  —  John F. Kerry, who has served as the U.S. special climate envoy for nearly three years … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/13/john-kerry-resigns-climate-change-envoy/"
  },
  {
    "text": "Trump Uses Mobster-Turned-Rat as Character Witness  —  The former president suggested two presiding justices could learn ethics from ex-mobster Sammy the Bull.  —  Donald Trump would like to thank former mob boss Salvatore Gravano aka “Sammy the Bull” for his support.",
    "url": "https://www.thedailybeast.com/trump-uses-mob-boss-sammy-the-bull-gravano-as-character-witness-on-truth-social"
  },
  {
    "text": "Ban on guns in post offices is unconstitutional, US judge rules  —  A federal judge in Florida on Friday ruled that a U.S. law that bars people from possessing firearms in post offices is unconstitutional, citing a landmark U.S. Supreme Court ruling from 2022 that expanded gun rights.",
    "url": "https://www.reuters.com/world/us/ban-guns-post-offices-is-unconstitutional-us-judge-rules-2024-01-13/"
  },
  {
    "text": "Multiple earthquakes hit Oklahoma City metro area, including 2 of 4.4 magnitude  —  No damage or injuries have been reported so far.  —  This map from the USGS shows the epicenter of an earthquake near Oklahoma City on Jan 13, 2024.  —  A series of earthquakes struck Oklahoma Friday evening … ",
    "url": "https://abcnews.go.com/US/multiple-earthquakes-hit-oklahoma-city-metro-area-including/story?id=106349469"
  },
  {
    "text": "White House staff ‘relocated’ after pro-Palestinian rioters damage anti-scale fencing, hurl objects at cops  —  Anti-Israel protesters and rioters gathered outside the White House on Saturday night, with some demonstrators damaging security fencing and hurling objects at police.",
    "url": "https://www.foxnews.com/politics/white-house-staff-relocated-pro-palestinian-rioters-damage-exterior-fencing-hurl-objects-cops"
  },
  {
    "text": "Congress readies ‘laddered’ March funding patch as shutdown looms  —  House and Senate leadership are both backing the plan, despite Speaker Mike Johnson's earlier dismissal of the idea of clearing another short-term extension.  —  Congressional leaders will move next week to pass … ",
    "url": "https://www.politico.com/news/2024/01/13/congress-readies-laddered-march-funding-patch-as-shutdown-looms-00135476"
  }
]