[
  {
    "text": "Trump has no immunity from Jan. 6 prosecution, appeals court rules  —  A federal appeals court has unanimously ruled that Donald Trump can be put on trial for trying to stay in power after losing the 2020 election, rejecting Trump's sweeping claim of presidential immunity and moving the case one step closer to a jury.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/02/06/trump-jan-6-immunity-appeal-denied/"
  },
  {
    "text": "Accountant's Apparent Lies Further Dooms Trump's Bank Fraud Defense  —  Trump accountant Allen Weisselberg is apparently working out a deal addressing lies he told on the stand in the New York bank fraud trial.  Now Trump is in even more trouble.  —  Donald Trump's expected massive loss … ",
    "url": "https://www.thedailybeast.com/judge-demands-trump-explain-his-accountant-allen-weisselbergs-apparent-lies"
  },
  {
    "text": "Ronna McDaniel, R.N.C. Chairwoman, Plans to Step Down  —  Donald Trump is likely to back an election denier, Michael Whatley, the head of the North Carolina G.O.P., to replace her.  —  The chairwoman of the Republican National Committee, Ronna McDaniel, has told former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/02/06/us/politics/ronna-mcdaniel-rnc-trump.html"
  },
  {
    "text": "The RNC's chief of staff is stepping down  —  The departure comes amid growing speculation that Donald Trump will push for changes at the committee.  —  Republican National Committee chief of staff Mike Reed is set to step down from his role later this month.  —  Reed had served as chief of staff at the committee since Jan. 2022.",
    "url": "https://www.politico.com/news/2024/02/06/rnc-chief-of-staff-stepping-down-trump-00139867"
  },
  {
    "text": "D.C. Circuit panel unanimously rejects Trump's criminal immunity claim  —  On Tuesday morning, a three-judge panel of the U.S. Court of Appeals for the D.C. Circuit unanimously rejected Donald Trump's claims that he is immune from criminal prosecution for life for acts he took while president.",
    "url": "https://www.lawdork.com/p/dc-circuit-immunity-ruling-trump"
  },
  {
    "text": "Trump is not immune from prosecution in his 2020 election interference case, US appeals court says  —  A federal appeals panel ruled Tuesday that Donald Trump can face trial on charges that he plotted to overturn the results of the 2020 election, sharply rejecting the former president's claims … ",
    "url": "https://apnews.com/article/trump-capitol-riot-presidential-immunity-appeal-46c2d7fc7807cd3262764d35e47f390e"
  },
  {
    "text": "4 takeaways from Trump's loss in his immunity case  —  Donald Trump suffered a significant setback Tuesday in his quest to escape criminal conviction, with a three-judge panel of the U.S. Court of Appeals for the D.C. Circuit ruling that he is not immune from charges for his acts as president.",
    "url": "https://www.washingtonpost.com/politics/2024/02/06/trump-immunity-takeaways/"
  },
  {
    "text": "In stunner, House GOP bid to impeach Mayorkas fails  —  A House GOP effort to impeach Homeland Security Secretary Alejandro Mayorkas failed in embarrassing fashion Tuesday as three Republicans joined Democrats in voting against what would have been the second-ever impeachment of a Cabinet official.",
    "url": "https://thehill.com/homenews/house/4452038-in-stunner-house-gop-bid-to-impeach-mayorkas-fails/"
  },
  {
    "text": "Mayorkas Impeachment Vote  —  House to Vote on Impeaching Mayorkas Over Border Crisis  —  Republicans in the slim majority say the homeland security secretary has willfully refused to enforce border laws and breached the public trust.  —  Here's the latest on the impeachment vote.",
    "url": "https://www.nytimes.com/live/2024/02/06/us/mayorkas-impeachment"
  },
  {
    "text": "N.H. attorney general says he found source of fake Biden robocalls  —  New Hampshire's top law enforcement official said, “We have never seen...such a blatant attempt to mislead voters.”  —  New Hampshire's Attorney General on Tuesday named a Texas telecom company as the source … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nh-attorney-general-says-found-source-fake-biden-robocalls-rcna137499"
  },
  {
    "text": "As a compromise border plan collapses, the GOP is in disarray  —  There can be little doubt that one of the major American political parties is in disarray, but it's not the Democratic Party.  —  For those familiar with online political commentary, the phrase “Dems in disarray” … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/compromise-border-plan-collapses-gop-disarray-rcna137424"
  },
  {
    "text": "No criminal charges expected in Biden classified documents probe: NBC  — Neither President Joe Biden nor anyone else is expected to be criminally charged in an investigation into how classified documents ended up in locations associated with Biden, NBC News reported",
    "url": "https://www.cnbc.com/2024/02/06/no-criminal-charges-expected-in-biden-classified-documents-probe-nbc.html"
  },
  {
    "text": "Project Veritas, James O'Keefe settle suit over false claims of 2020 voter fraud in Pennsylvania  —  Project Veritas and conservative activist James O'Keefe have settled a lawsuit in Pennsylvania over false claims about voter fraud in the 2020 presidential election that were initially … ",
    "url": "https://thehill.com/regulation/court-battles/4451745-project-veritas-james-okeefe-settle-suit-over-false-claims-of-2020-voter-fraud-in-pennsylvania/"
  },
  {
    "text": "Jury finds Jennifer Crumbley guilty of manslaughter in son's school shooting  —  Ethan Crumbley killed four students at his high school in November 2021.  —  LIVE  —  Jennifer Crumbley, the mother of accused Oxford High School gunman Ethan Crumbley, listens on the stand in the courtroom … ",
    "url": "https://abcnews.go.com/US/jury-reaches-verdict-jennifer-crumbley-manslaughter-trial/story?id=106924349"
  },
  {
    "text": "Taylor Swift threatens legal action against student who tracks her jet  —  The superstar's effort to keep the tracker accounts from posting her plane's takeoffs and landings recalls Elon Musk's banning of a similar account.  —  Taylor Swift's attorneys have threatened legal action … ",
    "url": "https://www.washingtonpost.com/technology/2024/02/06/taylor-swift-jet-tracking-legal-threat/"
  },
  {
    "text": "Rigger falls to death during production of Marvel's ‘Wonder Man’  —  The incident occurred Tuesday at the Radford Studio Center in Studio City, California.  —  LOS ANGELES — A rigger died after falling from rafters Tuesday during the production of Marvel Studios' “Wonder Man” in California, an official confirmed.",
    "url": "https://www.nbcnews.com/news/us-news/rigger-falls-death-production-marvels-wonder-man-rcna137598"
  },
  {
    "text": "Tucker Carlson confirms he's interviewing Vladimir Putin  —  Controversial ex-Fox News host is in Moscow to talk to the Russian leader.  —  American pundit Tucker Carlson, who is currently on a visit to Moscow, has announced he is interviewing Russian President Vladimir Putin.",
    "url": "https://www.politico.eu/article/tucker-carlson-vladimir-putin-interview-confirm/"
  },
  {
    "text": "70 Current And Former NYCHA Employees Charged With Bribery And Extortion Offenses  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  In the Largest Number of Federal Bribery Charges on a Single Day in DOJ History, 70 Current and Former Employees … ",
    "url": "https://www.justice.gov/usao-sdny/pr/70-current-and-former-nycha-employees-charged-bribery-and-extortion-offenses"
  },
  {
    "text": "South Florida School Demands Parent Consent for Black History Month Events  —  Parents of students at the IPrep Academy in South Florida were shocked after being asked to sign permission slips to allow their children to participate in Black History Month.  —  Black History Month has now become an educational target in Florida schools.",
    "url": "https://www.thedailybeast.com/iprep-academy-school-in-miami-dade-county-demands-permissions-slips-for-black-history-month"
  },
  {
    "text": "Exclusive: FBI Arrests Would-Be Border Militia Member  —  As elected officials hotly debate new border security legislation, the FBI has arrested a Tennessee man they say was planning to join a militia border group, set off explosives, and act as a sniper at the Mexico/U.S. border.",
    "url": "https://www.courtwatch.news/p/exclusive-fbi-arrests-would-be-border"
  },
  {
    "text": "State Department diplomatic security officer arrested on Jan. 6 charges  —  Kevin Alstrup, the FBI said, was “familiar with providing security and protection for high-ranking government officials or sensitive locations, like embassies.”  —  WASHINGTON — A man who worked for the State Department … ",
    "url": "https://www.nbcnews.com/politics/justice-department/state-department-diplomatic-security-officer-arrested-jan-6-charges-rcna137509"
  },
  {
    "text": "JPL Workforce Update  —  Workforce statement and memo to employees. … - I am directing most employees to work from home tomorrow, Wednesday, February 7, so everyone can be in a safe, comfortable environment on a stressful day. … - Tomorrow, leadership (mostly at the Division and Directorate level) … ",
    "url": "https://www.jpl.nasa.gov/news/jpl-workforce-update"
  },
  {
    "text": "Gina Carano Sues Disney Over ‘Mandalorian’ Firing—With Elon Musk's Help  —  Carano is seeking a court order that would force Lucasfilm to recast her on the Star Wars series.  —  Gina Carano, the actress who was fired from The Mandalorian for offensive and antisemitic posts … ",
    "url": "https://www.thedailybeast.com/gina-carano-sues-disney-over-mandalorian-firingwith-elon-musks-help"
  }
]