[
  {
    "text": "Chief Financial Officer Of Multinational Media Company Charged With Participating In Scheme To Launder At Least $67 Million In Fraud Proceeds  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Damian Williams, the United States Attorney for the Southern District … ",
    "url": "https://www.justice.gov/usao-sdny/pr/chief-financial-officer-multinational-media-company-charged-participating-scheme"
  },
  {
    "text": "Feds Indict Far-Right Media Exec in Massive Money Laundering Scheme  —  Bill Guan, the chief financial officer of the far-right Epoch Times, was indicted Monday on charges of allegedly participating in a massive money laundering scheme.  —  The Southern District of New York released a statement saying … ",
    "url": "https://www.mediaite.com/news/just-in-feds-indict-far-right-media-exec-in-massive-money-laundering-scheme/"
  },
  {
    "text": "Feds Accuse Far-Right Newspaper of Being a Money Laundering Operation  —  $67 MILLION!  —  The indictment alleges the conspiracy-fueled paper's massive revenue growth in recent years was tied to the chief financial officer's fraudulent “Make Money Online” team.",
    "url": "https://www.thedailybeast.com/feds-accuse-far-right-newspaper-epoch-times-of-being-a-money-laundering-operation"
  },
  {
    "text": "Multiple Trump Witnesses Have Received Significant Financial Benefits From His Businesses, Campaign  —  Nine witnesses in the criminal cases against former President Donald Trump have received significant financial benefits, including large raises from his campaign, severance packages … ",
    "url": "https://www.propublica.org/article/donald-trump-criminal-cases-witnesses-financial-benefits"
  },
  {
    "text": "Biden Is Expected to Sign Order Letting Him Seal Border With Mexico  —  The move, expected on Tuesday, would allow the president to temporarily seal the border and suspend longtime protections for asylum seekers in the United States.  —  President Biden is expected to sign an executive order … ",
    "url": "https://www.nytimes.com/2024/06/03/us/politics/biden-immigration-asylum-order.html"
  },
  {
    "text": "Congress braces for “large” boycott, disruptions of Netanyahu speech … - Netanyahu's 2015 speech to Congress, which was a major snub of the Obama administration, was skipped by 58 Democratic lawmakers.  — Many Democrats this year argued against inviting Netanyahu in the first place … ",
    "url": "https://www.axios.com/2024/06/04/democrats-boycott-benjamin-netanyahu-speech-congress"
  },
  {
    "text": "Big Media Ignoring the Who What When Why of GOP Apology for Trump's Crimes  —  Even before and especially in the wake of Trump's guilty verdict, members of the MAGAt Party has stumbled over themselves to declare fealty to Donald Trump, and in the process to demean rule of law.  —  Video",
    "url": "https://www.emptywheel.net/2024/06/03/big-media-ignoring-the-who-what-when-why-of-gop-apology-for-trumps-crimes/"
  },
  {
    "text": "The ‘big mistake’ Republican senators want to avoid after Trump's conviction  —  On both sides of the Capitol, most Republicans say former President Donald Trump's criminal conviction in New York is politically motivated rather than a substantive case.  And the GOP racked in fundraising after Trump was found guilty.",
    "url": "https://www.politico.com/live-updates/2024/06/03/congress/post-verdict-mistake-gop-hopes-to-avoid-trump-senate-2024-00161353"
  },
  {
    "text": "New York Tosses Rep. Stefanik's Trump Court Complaint in Bank Fraud Civil Suit  —  NY CONFIDENTIAL  —  Stefanik supported the former president by complaining about a judge and his clerk in Trump's bank fraud civil suit.  The Daily Beast can reveal it was rejected as groundless.",
    "url": "https://www.thedailybeast.com/new-york-tosses-rep-stefaniks-trump-court-complaint-in-bank-fraud-civil-suit"
  },
  {
    "text": "Fraud trial juror reports getting bag of $120,000 and promise of more if she'll acquit  —  A juror was dismissed Monday after reporting that a woman dropped a bag of $120,000 in cash at her home and offered her more money if she would vote to acquit seven people charged with stealing … ",
    "url": "https://apnews.com/article/minnesota-feeding-our-future-pandemic-fraud-73610b59bb60bf33f2aa06063bb592d2"
  },
  {
    "text": "Russia Gave Millions to Far-Right Politicians Via Fake News Site: Report  —  ‘VOICE OF EUROPE’  —  Russia gave European far-right politicians large amounts of cash through a propaganda operation intended to sow division on the continent, according to a report.",
    "url": "https://www.thedailybeast.com/russia-gave-millions-to-politicians-via-fake-news-site-voice-of-europe"
  },
  {
    "text": "Trump's appeal hearing on Fani Willis set for October, likely pushing trial past election  —  Trump is appealing the ruling that led DA Fani Willis stay on his election case.  —  Former President Donald Trump attends UFC 302 at Prudential Center on June 1, 2024, in Newark, N.J.",
    "url": "https://abcnews.go.com/Politics/georgia-court-tentatively-sets-donald-trumps-appeal-hearing/story?id=110788890"
  },
  {
    "text": "Transcript: Mayor Adams Visits Officers Shot In 115th Precinct And Briefs Media With NYPD Commissioner Caban  —  Deputy Commissioner Tarik Sheppard, Public Information, Police Department: All right, good morning, everybody.  As you know we're here to talk about another senseless shooting of two of our officers this morning.",
    "url": "https://www.nyc.gov/office-of-the-mayor/news/440-24/transcript-mayor-adams-visits-officers-shot-115th-precinct-briefs-media-nypd"
  },
  {
    "text": "The Most Ridiculous, Right-Wing Supreme Court That Dark Money Could Buy  —  The high court's conservative supermajority is in your body, helping elect Trump, and in-your-face corrupt.  No one is going to stop them  —  OVER THE PAST two decades, the Supreme Court has been captured by dark money interests … ",
    "url": "https://www.rollingstone.com/politics/political-commentary/supreme-court-ridiculous-right-wing-dark-money-1235030841/"
  },
  {
    "text": "Sen. Bob Menendez of New Jersey to seek independent reelection bid amid federal corruption trial  —  U.S. Sen. Bob Menendez, a New Jersey Democrat who is on trial on federal bribery charges in New York, has filed to run as an independent candidate for reelection.",
    "url": "https://apnews.com/article/menendez-new-jersey-independent-bribery-trial-e216825389acdb2c55b634e196f0f083"
  },
  {
    "text": "Trump's Most Audacious Lie Yet  —  When someone lies as prodigiously as Donald Trump—The Washington Post stopped counting at more than 30,000, around the time he left office—handing out superlatives is challenging.  Even so, the former president might have told his most audacious lie yet this weekend.",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/trump-most-audacious-lie/678583/"
  },
  {
    "text": "Michael Cohen's family doxed after Trump guilty verdict in porn star hush money case  —  The latest doxing attempt fits into a pattern of threats against individuals who speak out against former President Donald Trump.  —  WASHINGTON — The addresses and phone numbers of former Trump lawyer … ",
    "url": "https://www.nbcnews.com/politics/2024-election/michael-cohens-family-doxed-trump-guilty-verdict-porn-star-hush-money-rcna155268"
  },
  {
    "text": "RFK Jr.'s VP Pick Nicole Shanahan Admits She and Tucker Are ‘on Same Page’  —  BFFS  —  Shanahan's comment is another instance of the supposed “anti-establishment” campaign showing its right-wing ties.  —  Nicole Shanahan, independent presidential candidate Robert F. Kennedy Jr's running mate … ",
    "url": "https://www.thedailybeast.com/rfk-jrs-vp-pick-nicole-shanahan-admits-she-and-tucker-carlson-are-on-same-page"
  },
  {
    "text": "The Texas Republican Party has gone off the deep end  —  Even before the release of an outrageous new platform, the party had become an embarrassment to itself.  —  Looking for something really hair-raising to read?  Check out the 50-page platform that was just adopted by the Texas Republican Party.",
    "url": "https://www.washingtonpost.com/opinions/2024/06/03/texas-republican-party-new-platform/"
  },
  {
    "text": "Trump's Second Term Would Be Even More Corrupt and Vindictive Than His First  —  A truism of the Trump era is that every accusation is a confession.  When Donald Trump hurls wild charges at his opponents, he is telegraphing what he plans to do to them, preemptively justifying the breaking … ",
    "url": "https://www.nytimes.com/2024/06/03/opinion/trumps-weaponized-justice-system.html"
  },
  {
    "text": "Epstein Accuser Files Lawsuit Alleging Famed Psychiatrist Henry Jarecki Facilitated Sexual Abuse  —  Woman's lawsuit alleges Jeffrey Epstein sent her for psychological treatment to wealthy psychiatrist, who sexually abused her over several years  —  Henry Jarecki has won awards practicing psychiatry … ",
    "url": "https://www.wsj.com/us-news/henry-jarecki-accused-jeffrey-epstein-sex-traffic-ring-f56dfadd"
  },
  {
    "text": "G7 Leaders' Statement on Gaza  —  We, the Leaders of the Group of Seven (G7), fully endorse and will stand behind the comprehensive deal outlined by President Biden that would lead to an immediate ceasefire in Gaza, the release of all hostages, a significant and sustained increase … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/06/03/g7-leaders-statement-on-gaza/"
  },
  {
    "text": "Animal Breeder Pleads Guilty to Animal Welfare and Pollution Crimes and Will Pay More than $35M, Including Record Fine in an Animal Welfare Case  —  For Immediate Release  —  In 2022, Justice Department Secured Surrender of Over 4,000 Beagles from Envigo's Cumberland, Virginia, Facility",
    "url": "https://www.justice.gov/opa/pr/animal-breeder-pleads-guilty-animal-welfare-and-pollution-crimes-and-will-pay-more-35m"
  },
  {
    "text": "Why is a group of billionaires working to re-elect Trump?  —  Oligarchs like Elon Musk and Peter Thiel aren't just hostile to progressivism.  They're hostile to American democracy itself  —  Elon Musk and the entrepreneur and investor David Sacks reportedly held a secret dinner party … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jun/03/billionaires-for-trump-presidential-election"
  },
  {
    "text": "Trump's many dog whistles about unrest and violence  —  The former president's post-conviction comment about a “breaking point” follows a long line of suggestive comments.  The thrust is unmistakable.  —  Before the 2016 election, Marco Rubio warned about it.  Ted Cruz warned about it.",
    "url": "https://www.washingtonpost.com/politics/2024/06/03/trumps-many-dog-whistles-about-unrest-violence/"
  }
]