[
  {
    "text": "How Trump's Team Twisted His Bank Fraud Trial Into a Farce  —  The former president's lawyers may not be trying to win his New York trial—instead, they're dragging it out in hopes of solving his other political and legal problems.  —  Two weeks into Donald Trump's bank fraud trial in New York … ",
    "url": "https://www.thedailybeast.com/how-donald-trumps-team-twisted-his-new-york-bank-fraud-trial-into-a-farce"
  },
  {
    "text": "Trump faces reckoning as D.C. judge mulls gag order  —  At a court hearing Monday, a judge will consider special counsel Jack Smith's demand that Trump be formally ordered to stop attacking potential witnesses against him.  —  Can Donald Trump be gagged?  —  That's the question at the heart … ",
    "url": "https://www.politico.com/news/2023/10/16/trump-gag-order-hearing-00121626"
  },
  {
    "text": "Live updates Judge to hear argument over Trump gag order in Jan. 6 case  —  Special counsel Jack Smith's office is in federal court in D.C. today asking for a gag order that would bar former president Donald Trump from maligning the judge, prosecutors, witnesses and potential jurors in his election obstruction case.",
    "url": "https://www.washingtonpost.com/national-security/2023/10/16/trump-court-hearing-judge-gag-order-jan-6/"
  },
  {
    "text": "President Joe Biden: The 2023 60 Minutes interview transcript  —  Rarely does a president confront so much peril; the catastrophe in Israel—the war in Ukraine—and no help from a paralyzed Congress.  Late Thursday, we met President Biden at the White House.  It had been a rough week and we could see it on him.",
    "url": "https://www.cbsnews.com/news/president-joe-biden-2023-60-minutes-transcript/"
  },
  {
    "text": "Playbook: How the attack on Israel has scrambled U.S. politics  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  Q3 CASH-ON-HAND LEADERBOARD — JOE BIDEN $24,785,201 ... DONALD TRUMP $24,535,602 ... RON DeSANTIS $11,160,604 ... ROBERT KENNEDY JR. $8,713,134 … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/16/how-the-attack-on-israel-has-scrambled-u-s-politics-00121694"
  },
  {
    "text": "More on Disastrous Biden Interview: Scott Pelley Has to Help Him Finish Sentence, Says President ‘Tired’  —  I wrote earlier about a couple of the teaser clips from the “60 Minutes” interview with Joe Biden.  —  Those were bad, but the complete interview was even worse.",
    "url": "https://redstate.com/nick-arama/2023/10/15/more-on-disastrous-biden-interview-throws-israel-under-the-bus-and-shows-he-has-no-idea-whats-going-on-n2165104"
  },
  {
    "text": "Moderate Democrats get behind temporary speaker fix  —  The News  —  With the House still paralyzed in the absence of a speaker, the idea of giving Speaker Pro Tempore Patrick McHenry more power to conduct normal business is picking up growing bipartisan support.",
    "url": "https://www.semafor.com/article/10/16/2023/moderate-democrats-get-behind-temporary-speaker-fix"
  },
  {
    "text": "Scholastic's “bigot button”  —  Scholastic, the popular publisher of children's books, is a big business.  It is a publicly-traded company with a market capitalization of $1.15 billion.  Its CEO, Peter Warwick, collected a total compensation of $3,300,361 in 2023, and at least four other executives were paid over $1.3 million.",
    "url": "https://popular.info/p/scholastics-bigot-button"
  },
  {
    "text": "The GOP refusal to condemn Menendez speaks volumes  —  Public Notice just celebrated its second birthday.  Click the button to take advantage of our special anniversary offer.  —  Click to redeem 2nd anniversary special  —  As a general rule of politics, it should be easy to condemn … ",
    "url": "https://www.publicnotice.co/p/bob-menendez-indictment-republicans-condemn"
  },
  {
    "text": "Statement from President Joe Biden  —  Jill and I were shocked and sickened to learn of the brutal murder of a six-year-old child and the attempted murder of the child's mother in their home yesterday in Illinois.  —  The child's Palestinian Muslim family came to America seeking what we all seek … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/10/15/statement-from-president-joe-biden-4/"
  },
  {
    "text": "Scoop: Oprah pitched a White House run with Mitt Romney, book reveals … - Romney tells Coppins he dismissed the idea, believing that such a campaign would inadvertently help Trump.",
    "url": "https://www.axios.com/2023/10/16/oprah-mitt-romney-trump-2020"
  },
  {
    "text": "Senators flummoxed, ‘horrified’ by House leadership vacuum  —  Senators return to Washington this week feeling completely flummoxed by the turmoil in the House and with no clear idea of whether House Republicans will elect a Speaker anytime soon.  —  Republican senators have called … ",
    "url": "https://thehill.com/homenews/senate/4255368-senators-flummoxed-horrified-by-house-leadership-vacuum/"
  },
  {
    "text": "Man targeted 6-year-old boy, mom in deadly Plainfield stabbing because they are Muslim: detectives  —  ‘You Muslims must die’: 71-year-old Joseph M. Czuba facing hate crime charges in death of Palestinian boy Wadea Al-Fayoume  —  PLAINFIELD, Ill. (WLS) — A man stabbed a child to death … ",
    "url": "https://abc7chicago.com/plainfield-murder-joseph-m-czuba-stabbing-16200-s-lincoln-hwy-il/13918623/"
  },
  {
    "text": "Blinken meets resistance in courtship of Egypt and Saudi Arabia on Gaza war  —  The secretary of state appealed to the leaders of the two key countries to tamp down anger over Israel's retaliation and to assist in humanitarian aid  —  CAIRO — U.S. Secretary of State Antony Blinken faced stiff resistance … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/15/blinken-saudi-egypt-israel-gaza/"
  },
  {
    "text": "Jordan to face a challenger in floor vote Tuesday  —  ‘There will be an alternative for the rational part of the Republican conference,’ an opponent of the hard-right congressman says.",
    "url": "https://www.politico.com/live-updates/2023/10/15/congress/jordan-gets-a-challenger-00121640"
  }
]