[
  {
    "text": "Trump, Biden and CNN Prepare for a Hostile Debate (With Muted Mics)  —  With Donald Trump's rampage at the first 2020 debate still fresh in the memories of both campaigns and the moderators, the candidates are preparing in sharply different ways.  —  President Biden and former President … ",
    "url": "https://www.nytimes.com/2024/06/15/us/politics/trump-biden-debate-rules.html"
  },
  {
    "text": "Biden and Trump campaigns agreed to mic muting, podiums among rules for upcoming CNN debate  —  With less than two weeks until the first presidential debate of the 2024 election cycle, CNN has released additional details on the parameters agreed upon by the Trump and Biden campaigns.",
    "url": "https://www.cnn.com/2024/06/15/politics/trump-biden-cnn-debate-rules/"
  },
  {
    "text": "What Have We Liberals Done to the West Coast?  —  As Democrats make their case to voters around the country this fall, one challenge is that some of the bluest parts of the country — cities on the West Coast — are a mess.  —  Centrist voters can reasonably ask: Why put liberals … ",
    "url": "https://www.nytimes.com/2024/06/15/opinion/progressives-california-portland.html"
  },
  {
    "text": "UK polls point to ‘electoral extinction’ for Prime Minister Sunak's Conservatives  —  Three British opinion polls released late on Saturday presented a grim picture for Prime Minister Rishi Sunak's Conservative Party, and one pollster warned that the party faced “electoral extinction” in July 4's election.",
    "url": "https://www.reuters.com/world/uk/uk-polls-point-electoral-extinction-prime-minister-sunaks-conservatives-2024-06-15/"
  },
  {
    "text": "Utah Gov. accuses Denver mayor of sending immigrants without ‘notification or approval’  —  Gov. Spencer Cox (R-UT) blasted Colorado's Mayor of Denver, Mike Johnston (D), for sending immigrants to the state without notice.  —  “We recently learned that the Democrat mayor of Denver … ",
    "url": "https://www.washingtonexaminer.com/policy/immigration/3046608/utah-gov-accuses-denver-mayor-of-sending-immigrants-without-notification-or-approval/"
  },
  {
    "text": "Here's how — and why — Florida Democrats found candidates in every legislative district this cycle  —  It was a risky endeavor for Florida Democratic Party Chair Nikki Fried to proclaim she will run a candidate in every congressional and legislative district.",
    "url": "https://floridapolitics.com/archives/680062-heres-how-and-why-florida-democrats-found-candidates-in-every-legislative-district-in-2022/"
  },
  {
    "text": "Johnson faces bipartisan uproar over House Intel picks … - Some are also concerned about the highly sensitive information to which committee members are often exposed. … - Both picks were bound to be inflammatory: Perry's phone was seized by the FBI as part of its Jan. 6 probe … ",
    "url": "https://www.axios.com/2024/06/15/house-intelligence-committee-johnson-perry-jackson"
  },
  {
    "text": "How 2024 pollsters are trying to avoid their 2020 mistakes … - It's “pretty apparent” that polling has some “entrenched problems,” Benjamin Toff, a University of Minnesota professor who researches public trust in polls and news coverage. … Many polls also sampled too many college graduates … ",
    "url": "https://www.axios.com/2024/06/15/2024-election-polls-trump-biden"
  },
  {
    "text": "Stanford's top disinformation research group collapses under pressure  —  The Stanford Internet Observatory provided real-time analysis on viral election falsehoods but has struggled amid attacks from conservative politicians and activists.  —  The Stanford Internet Observatory … ",
    "url": "https://www.washingtonpost.com/technology/2024/06/14/stanford-internet-observatory-disinformation-research-lawsuits-politics/"
  },
  {
    "text": "Supreme Court strikes down Trump-era ban on bump stocks for guns  —  In a concurring opinion, Samuel Alito said the ‘simple remedy’ to the gun issue is Congress amending the law that bans machine guns.  —  WASHINGTON - The Supreme Court ruled Friday that devices that turn a semi-automatic rifle … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/06/14/supreme-court-trump-bump-stocks-guns-decision/72957521007/"
  },
  {
    "text": "Jan. 6, America's Rupture and the Strange, Forgotten Power of Oblivion  —  On March 4, Judge Tanya Chutkan presided over jury selection for a criminal trial in a Jan. 6, 2021, case.  That date had long been scheduled, though there was a different defendant seated before her than had been planned … ",
    "url": "https://www.nytimes.com/2024/06/15/opinion/jan-6-memory-memorial-forgetting.html"
  },
  {
    "text": "If Everyone Voted, Would Biden Benefit?  Not Anymore.  —  Inside the unusual dynamic shaping the 2024 campaign.  —  In a reversal of one of the most familiar patterns in American politics, it appears that Donald J. Trump, not President Biden, would stand to gain if everyone in the country turned out and voted.",
    "url": "https://www.nytimes.com/2024/06/15/upshot/election-democrats-republicans-turnout-trump.html"
  },
  {
    "text": "Democrats divided over Supreme Court controversies as decisions loom  —  Liberals say a string of revelations about Supreme Court Justice Samuel A. Alito Jr. raise questions about his ability to rule impartially on Jan. 6-related cases.  —  Liberals have been united in their anger … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/15/supreme-court-alito-thomas-democrats/"
  },
  {
    "text": "Do members of Congress need a pay raise?  After 15 years, some say yes.  —  Lawmakers have doled out significant raises to staffers and other public employees but they haven't dared to give themselves raises, even to adjust for inflation.  —  Year in and year out, Congress finds … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/15/congress-pay-raises/"
  }
]