[
  {
    "text": "Is That—Is That—Optimism We Feel?  —  What a week, huh?  Thanks for staying with us through it.  Happy Friday.  —  She Nailed It  —William Kristol  —  Success.  —  Kamala Harris's acceptance speech last night was a success.  It capped a Democratic convention that was a success.",
    "url": "https://www.thebulwark.com/p/is-thatis-thatoptimism-we-feel"
  },
  {
    "text": "White House lawyers who advised Reagan, Bush endorse Harris over Trump in 2024 showdown  —  FIRST ON FOX: A dozen Republican White House lawyers who served in the administrations of then-Presidents Ronald Reagan, George H.W. Bush and George W. Bush are endorsing Vice President Kamala Harris … ",
    "url": "https://www.foxnews.com/politics/white-house-lawyers-who-advised-reagan-bush-endorse-harris-over-trump-2024-showdown"
  },
  {
    "text": "Trump Is Going to Lose.  (Probably.)  —  No Secret pod today.  Sorry.  People are in transit.  Next week the world goes back to normal.  —  1. Strategery  —  This convention attempted to establish the following strategic positions:  — The Democratic party as a broad and diverse, but wholly unified, front.",
    "url": "https://www.thebulwark.com/p/trump-is-going-to-lose-probably"
  },
  {
    "text": "Ahead of speech, Robert F. Kennedy Jr. says in a Pennsylvania court filing that he's endorsing Trump  —  Ahead of a planned speech, Robert F. Kennedy Jr.'s campaign said in a Pennsylvania court filing Friday that he is endorsing Donald Trump for president.  Kennedy's independent campaign … ",
    "url": "https://apnews.com/article/rfk-jr-trump-speech-arizona-a2638f89ddcb5de03edbe4574ca17d45"
  },
  {
    "text": "Democrats Find Confidence Without Complacency  —  It's a balance they didn't strike well in 2016, with tragic consequences  —  The lead Kamala Harris built over Donald Trump through the first month of her campaign was palpable in the thematic content of the Democratic national convention.",
    "url": "https://www.offmessage.net/p/democrats-show-confidence-without-complacency"
  },
  {
    "text": "Trump's spectacle is no match for Harris's substance  —  This election isn't just another political match — it's a reckoning.  —  For years, Donald Trump has masqueraded as the champion of the working class, a man of the people with a golden touch for business and so-called “common-sense” solutions.",
    "url": "https://thehill.com/opinion/campaign/4843934-kamala-harris-trump-populism/"
  },
  {
    "text": "RFK Jr. may drop out, but he could still alter a tight presidential race.  Trump is banking on it  —  For the better part of the past year, as Robert F. Kennedy Jr. built and maintained a small but significant base of support for his quixotic White House bid, the two major parties wrestled … ",
    "url": "https://www.cnn.com/2024/08/23/politics/robert-kennedy-president-trump/"
  },
  {
    "text": "Kamala Harris has put Trump in a box, and he's struggling to break out  —  As Democrats emerge from their electrifying convention in Chicago, Trump finds himself on the defense, and it's not clear he knows what to do.  —  CHICAGO — In his history as a candidate for president … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/23/trump-harris-campaign-analysis/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0Mzg1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1NzY3OTk5LCJpYXQiOjE3MjQzODU2MDAsImp0aSI6ImE4OTVlYjAwLTU3MWYtNDQwYi04OGQ5LThhOTVkYzE4M2IxNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzIzL3RydW1wLWhhcnJpcy1jYW1wYWlnbi1hbmFseXNpcy8ifQ.X6atUK0YVE7OE7ONYv4nk7JhmIrAtyRFrkTSaktVPec&itid=gfta"
  },
  {
    "text": "Disaffected Republicans and former Trump officials spoke at the DNC.  Fox News didn't air a second of any of their speeches.  —  Fox News did not air a second of the speeches from alienated GOP leaders and former Trump officials who endorsed Vice President Kamala Harris at this week's Democratic National Convention.",
    "url": "https://www.mediamatters.org/fox-news/disaffected-republicans-and-former-trump-officials-spoke-dnc-fox-news-didnt-air-second-any"
  },
  {
    "text": "RFK Jr. says in court filing that he's endorsing Trump as he ends presidential campaign  —  Kennedy had dropped in the polls in recent weeks.  He did not announce an endorsement but is expected to back Trump, according to two people with knowledge of his intentions.",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-says-court-filing-endorsing-trump-ending-presidential-hopes-rcna165936?taid=66c8d85fa497bd0001e9e5d3"
  },
  {
    "text": "Texas, other GOP-led states sue over program to give immigrant spouses of US citizens legal status  —  Sixteen Republican-led states are suing to end a federal program that could potentially give nearly half a million immigrants without legal status who are married to U.S. citizens a path to citizenship.",
    "url": "https://apnews.com/article/immigration-citizen-spouse-biden-d02243b21b8490c912008b896a83bcd2"
  },
  {
    "text": "DOJ sues software firm, alleging pricing algorithm enables landlords to raise rents  —  The Department of Justice (DOJ) sued the property management software company RealPage on Friday, alleging that its pricing algorithm enables landlords to share sensitive pricing information and raise rental prices.",
    "url": "https://thehill.com/policy/technology/4844069-realpage-sued-for-rental-price-manipulation/"
  },
  {
    "text": "Judge Blocks E.P.A. From Using Civil Rights Law in Pollution Case  —  The decision is a setback for a Biden administration strategy for protecting minority communities with numerous polluting industries nearby.  —  A federal court in Louisiana has dealt a serious blow to the Biden administration's effort … ",
    "url": "https://www.nytimes.com/2024/08/23/climate/epa-civil-rights-climate-justice.html?unlocked_article_code=1.FE4.FfWh.5yvlv9uXRZKc&smid=url-share"
  },
  {
    "text": "Elon Musk's Lawyers Quietly Subpoena Public Interest Groups  —  The billionaire's legal war over lost X advertisers takes a “really cynical” turn.  —  Lawyers representing Elon Musk and X, previously known as Twitter, have quietly begun sending subpoenas to a host of public interest groups, Mother Jones has learned.",
    "url": "https://www.motherjones.com/politics/2024/08/twitter-x-subpoenas-elon-musk/"
  },
  {
    "text": "Trump Special Counsel Opts Against Mini-Trial Before Election  — Jack Smith focused on revising indictment in Jan. 6 case  — Judge Chutkan has set Sept. 5 hearing to review next steps",
    "url": "https://www.bloomberg.com/news/articles/2024-08-23/trump-special-counsel-opts-against-mini-trial-before-election"
  },
  {
    "text": "Ann Coulter Roast Goes Viral as Internet Gets Revenge for Gus Walz  —  BLOWING UP  —  The conservative firebrand told the Daily Beast that Democrats were actually to blame for her mocking Tim Walz's son.  —  Conservative political commentator Ann Coulter was hit by a blizzard of criticism … ",
    "url": "https://www.thedailybeast.com/ann-coulter-roast-goes-viral-as-internet-gets-revenge-for-gus-walz"
  },
  {
    "text": "Secret Service places at least 5 agents on leave in Trump assassination attempt probe  —  The U.S. Secret Service has placed at least five agents on leave, including the head of the Pittsburgh field office, as a result of its investigation into last month's assassination attempt … ",
    "url": "https://www.cbsnews.com/news/secret-service-agents-on-leave-trump-shooting/"
  },
  {
    "text": "World Bank halts paid advertising on X after CBS News finds its promoted ads under racist content  —  The World Bank has ceased all paid advertising on Elon Musk's social media platform X, which was formerly Twitter, after a CBS News investigation found promoted advertisements … ",
    "url": "https://www.cbsnews.com/news/world-bank-advertising-elon-musk-x-racism-pro-nazi-accounts/"
  },
  {
    "text": "Full Transcript of Kamala Harris's Democratic Convention Speech  —  The vice president's remarks lasted roughly 35 minutes on the final night of the convention in Chicago.  —  OK, let's get to business.  Let's get to business.  All right.  —  So, let me start by thanking my most incredible husband, Doug.",
    "url": "https://www.nytimes.com/2024/08/23/us/politics/kamala-harris-speech-transcript.html"
  }
]