[
  {
    "text": "Man intentionally slams truck into crowd in New Orleans, killing 10 and injuring dozens  —  Ten people were killed and dozens injured early Wednesday when a man intentionally drove a pickup truck into a crowd on Bourbon Street in New Orleans' French Quarter as revelers were celebrating the new year, officials said.",
    "url": "https://www.cbsnews.com/news/new-orleans-vehicle-crash-bourbon-street-crowd-casualties-shooting/"
  },
  {
    "text": "New Orleans updates: 10 dead in ‘terrorist attack’ with pickup in New Orleans, local officials say  —  The driver remained at large after the Bourbon Street incident, police said.  —  Emergency vehicles are seen near Bourbon Street in New Orleans on Wednesday, Jan. 1, 2025.",
    "url": "https://abcnews.go.com/US/1-dead-vehicle-strikes-crowd-new-orleans-police/story?id=117246329"
  },
  {
    "text": "NOPD: At least 10 dead after vehicle plows into crowd on Bourbon Street  —  The City of New Orleans says NOEMS has transported 30 injured patients.  —  NEW ORLEANS — The New Orleans Police Department is on the scene of a major incident on Bourbon Street on New Year's Day.",
    "url": "https://www.wwltv.com/article/news/crime/nopd-responds-to-multiple-casualties-on-bourbon-street/289-62237b48-bdb7-4144-a939-355e7a497528"
  },
  {
    "text": "Chief Justice Roberts Condemns Threats to Judicial Independence  —  In his year-end report on the federal judiciary, the chief justice decried violence, intimidation and disinformation and warned against defiance of court rulings.  —  Judicial independence is under grave threat on several fronts … ",
    "url": "https://www.nytimes.com/2024/12/31/us/politics/chief-justice-roberts-report.html"
  },
  {
    "text": "Chief Justice John Roberts defends judiciary from ‘illegitimate’ attacks  —  In his annual end-of-year report, Roberts says the independence of the judiciary is threatened by threats of violence, harassment, disinformation and defiance of court rulings.  —  WASHINGTON — Chief Justice John Roberts … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/chief-justice-john-roberts-defends-judiciary-illegitimate-attacks-rcna185884"
  },
  {
    "text": "F.B.I. Says It Found Largest Cache of Homemade Explosives in Its History at Va. Farm  —  Investigators discovered more than 150 devices, mostly pipe bombs, on a property outside Norfolk, court papers say.  —  A Virginia man was arrested this month with what federal prosecutors described … ",
    "url": "https://www.nytimes.com/2024/12/31/us/fbi-explosives-virginia-farm.html"
  },
  {
    "text": "C-SPAN cameras to return to House chamber in January … - The high level of public engagement with that behind-the-scenes access led to a push to allow the independent news organization to be granted permanent permission to freely film the inside of the chamber.",
    "url": "https://www.axios.com/2025/01/01/cspan-cameras-house-chamber-mike-johnson"
  },
  {
    "text": "Stars Flee Jeff Bezos' Paper for Steve Jobs' Widow's Mag  —  OUT WITH THE OLD...  The Washington Post is taking more blows after losing 200,000 subscribers when its owner stopped it endorsing Kamala Harris.  —  SHOP WITH SCOUTED  —  J.Crew's Semi-Secret Factory Sale Is Not to Be Missed",
    "url": "https://www.thedailybeast.com/stars-flee-jeff-bezos-washington-post-for-steve-jobs-widows-the-atlantic/"
  },
  {
    "text": "US imposes sanctions on Russian and Iranian groups over disinformation targeting American voters  —  The United States has imposed sanctions on two groups linked to Iranian and Russian efforts to target American voters with disinformation ahead of this year's election.",
    "url": "https://apnews.com/article/russia-iran-trump-disinformation-election-959d3f36ffc81f3e5d07386122076e7e"
  },
  {
    "text": "‘Trump is a little guy, Musk is a big guy’: historian predicts trouble for president-elect  —  Timothy Snyder says world's richest man is likely to exert uncomfortable influence over White House  —  Allies and aides to Donald Trump should be increasingly concerned by Elon Musk's proximity … ",
    "url": "https://www.theguardian.com/books/2025/jan/01/elon-musk-donald-trump"
  },
  {
    "text": "‘Raw Water’ Devotees Swear by Natural Springs, Despite the Risks … The highway that winds along the coast of Marin County offers some of California's most magnificent vistas, with the deep blue Pacific Ocean glittering through veils of fog.  But for a handful of travelers, the views aren't the prize.",
    "url": "https://www.nytimes.com/2024/12/31/us/raw-water-natural-springs.html"
  },
  {
    "text": "For Jimmy Carter, faith was inseparable from politics and life  —  Carter talked openly and often in the 1976 campaign about his evangelical “born again” faith, ignoring those who advised him to downplay his beliefs.  —  In his inaugural address in January 1977, President Jimmy Carter spoke … ",
    "url": "https://www.washingtonpost.com/history/2025/01/01/jimmy-carter-evangelical-baptist-faith/"
  },
  {
    "text": "Ukraine Says It Downed Russian Helicopter With Sea Drone For First Time  —  Ukraine claims that for the first time one of its sea drones has downed a Russian military target in the air during a day of intense attacks by both sides as the war edges closer to its three-year anniversary.",
    "url": "https://www.rferl.org/a/air-raid-sirens-blare-across-ukraine-explosions-heard-in-kyiv/33258909.html"
  },
  {
    "text": "The Biden mistake that blew up America  —  Happy New Year's Eve from the Will Bunch Newsletter, which is marking the end of a momentous and possibly calamitous 2024 by not reviewing the last grim 12 months but simply plowing ahead with new topics.  I do have big plans for 2025 … ",
    "url": "https://www.inquirer.com/columnists/attytood/merrick-garland-jimmy-carter-trump-20241231.html"
  },
  {
    "text": "Puerto Rico plunges into darkness as power outage hits more than 1.3 million customers on New Year's Eve  —  Power outages are a frustratingly frequent occurrence for many Puerto Ricans.  A string of blackouts during the summer prompted protests and a state of emergency.",
    "url": "https://www.nbcnews.com/news/us-news/puerto-rico-power-outage-rcna185849"
  },
  {
    "text": "Pentagon chief loses bid to reject 9/11 plea deals  —  A military appeals court has ruled against Defense Secretary Lloyd Austin's effort to throw out the plea deals reached for Khalid Sheikh Mohammed and two other defendants in the 9/11 attacks, a U.S. official said.",
    "url": "https://apnews.com/article/sept-11-plea-deals-guantanamo-austin-279abd0342a84dc2694941c07f51c6bb"
  }
]