[
  {
    "text": "Echoes of Jan. 6 committee as Jack Smith foreshadows plan to tie Trump to Capitol riot  —  Donald Trump doesn't want prosecutors to talk about Jan. 6.  They want to make it central to their case.  —  When Donald Trump faces a jury on charges stemming from his bid to subvert the 2020 election … ",
    "url": "https://www.politico.com/news/2023/11/09/donald-trump-jan-6-riot-defendant-00126258"
  },
  {
    "text": "The public doesn't understand the risks of a Trump victory.  That's the media's fault  —  With democracy in the balance, the press must relay the crucial importance of this election and the dangers of a Trump win  —  Whatever doubts you may have about public-opinion polls, one recent example should not be dismissed.",
    "url": "https://www.theguardian.com/commentisfree/2023/nov/09/trump-president-democracy-threat-media-journalism"
  },
  {
    "text": "Trump was defeated twice in one week  —  Trumpism lost big in the courtroom and at the polls, proving the rule of law and democracy still matter.  —  Donald Trump got two rude awakenings this week.  One happened Monday in a New York courtroom, and the other came the next day courtesy of voters across the nation.",
    "url": "https://www.bostonglobe.com/2023/11/08/opinion/trump-defeated-new-york-case-elections/"
  },
  {
    "text": "Republican debate: Haley calls Ramaswamy ‘scum’ in dustup over TikTok  —  Former U.N. Ambassador Nikki Haley and entrepreneur Vivek Ramaswamy swung at each other during the third Republican primary presidential debate over their use of TikTok, with Haley calling her opponent scum.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/republican-debate-haley-calls-ramaswamy-scum-dustup-tiktok"
  },
  {
    "text": "Democrats' new abortion battle plan: Rush to get it on ballots in 2024 … - Voters now have explicitly endorsed abortion rights via ballot initiatives in seven states since the Supreme Court overturned Roe v. Wade last year — in California, Kansas, Kentucky, Michigan, Montana, Vermont and now Ohio.",
    "url": "https://www.axios.com/2023/11/09/democrats-abortion-election-plan-2023"
  },
  {
    "text": "Ramaswamy Seemed to Call Zelensky a Nazi.  His Campaign Says That's Not What He Meant.  —  A spokeswoman for Mr. Ramaswamy acknowledged that, without context, his remark could be easily misunderstood.  —  Vivek Ramaswamy drew shock and criticism online on Wednesday when he appeared to accuse … ",
    "url": "https://www.nytimes.com/2023/11/08/us/politics/ramaswamy-zelensky-nazi-comment.html"
  },
  {
    "text": "Death toll in Gaza likely ‘higher than is being reported’: US official  —  A senior Biden administration official said the death toll of Palestinians in the Gaza Strip is likely far higher than the 10,000 number being reported by the health ministry amid Israel's war against Hamas.",
    "url": "https://thehill.com/policy/international/4301551-gaza-deaths-likely-higher-than-cited-us-official/"
  },
  {
    "text": "Broken Borders: AP & Reuters Pictures of Hamas Atrocities Raise Ethical Questions  —  On October 7, Hamas terrorists were not the only ones who documented the war crimes they had committed during their deadly rampage across southern Israel.  Some of their atrocities were captured … ",
    "url": "https://honestreporting.com/photographers-without-borders-ap-reuters-pictures-of-hamas-atrocities-raise-ethical-questions/"
  },
  {
    "text": "James Comer, Like Joe Biden, Also Paid His Brother $200K  —  James Comer is going after Joe Biden because he loaned his brother, James Biden, $200,000.  If that's the standard, James Comer may want to investigate himself. … Pay Dirt is a weekly foray into the pigpen of political funding.",
    "url": "https://www.thedailybeast.com/james-comer-like-joe-biden-also-paid-his-brother-dollar200k"
  },
  {
    "text": "DOJ announces arrests in ‘high-end brothel network’ used by elected officials, military officers and others  —  Three individuals have been arrested on charges of operating a “high-end brothel network” in Massachusetts and Virginia with a clientele that included elected officials … ",
    "url": "https://www.cnn.com/2023/11/08/politics/high-end-brothel-network-arrests/"
  },
  {
    "text": "Tim Scott's girlfriend is, in fact, real.  —  The senator debuted his significant other at the most charming of spots: the stage of the GOP primary debate.  —  Who says that politics isn't romantic?  —  Sen. Tim Scott on Wednesday finally debuted his girlfriend, bringing her onstage … ",
    "url": "https://www.politico.com/news/2023/11/08/tim-scott-girlfriend-is-real-00126293"
  },
  {
    "text": "Gruesome Footage of Oct. 7 Hamas Atrocities Screens in Hollywood Under Heavy Guard  —  On Wednesday night, with a sizable security presence and protesters audible through the walls, some 200 members of the industry screened ‘Bearing Witness,’ comprising 43 minutes of uncensored footage, at the Museum of Tolerance in West L.A.",
    "url": "https://www.hollywoodreporter.com/news/general-news/hollywood-screening-bearing-witness-hamas-israel-attack-1235642773/"
  },
  {
    "text": "Former Sen. Martha McSally describes sexual assault near Omaha, Neb.  —  Former U.S. Sen. Martha McSally said she was sexually assaulted Wednesday while running near Omaha, Neb., in an incident in which she said she pursued her fleeing attacker, contacted police and described the ordeal shortly afterward on social media.",
    "url": "https://www.azcentral.com/story/news/politics/arizona/2023/11/08/martha-mcsally-reports-she-was-sexually-assaulted-in-nebraska/71508057007/"
  },
  {
    "text": "SAG-AFTRA Reaches Tentative Agreement With Studios, Ending Actors Strike  —  The work stoppage will end 12:01 a.m. on Thursday. … The SAG-AFTRA TV/Theatrical Committee approved the agreement in a unanimous vote on Wednesday, SAG-AFTRA announced.  The strike will end at 12:01 am Thursday.",
    "url": "https://www.hollywoodreporter.com/business/business-news/sag-aftra-deal-reached-studios-union-contract-terms-1235607563/"
  },
  {
    "text": "Swing State 2024 Polling: Biden Trails Trump in Arizona, Georgia, and Pennsylvania, and Wisconsin, Leads Trump in Michigan  —  Home Polls Swing State 2024 Polling: Biden Trails Trump in Arizona, Georgia, and Pennsylvania, and Wisconsin, Leads Trump in Michigan",
    "url": "https://emersoncollegepolling.com/swing-state-2024-polling-biden-trails-trump-in-arizona-georgia-and-pennsylvania-and-wisconsin-leads-trump-in-michigan/"
  },
  {
    "text": "Former Arkansas Gov. Mike Huckabee Says Women Who Have Abortions ‘Probably Got Talked Into’ it  —  During a Wednesday appearance on Hannity, Huckabee discussed the impact Republican messaging has had on abortion  —  Former GOP Arkansas Gov. Mike Huckabee says that women who have received abortions probably … ",
    "url": "https://themessenger.com/politics/former-arkansas-gov-mike-huckabee-says-women-who-have-abortions-probably-got-talked-into-it"
  },
  {
    "text": "School board voters fight back  —  Earlier this year, Popular Information reported that the Pennridge School Board in Pennsylvania hired Jordan Adams, a right-wing educational consultant, to assist in the development of curriculum and other issues.  Adams launched his company, Vermilion Education, in March 2023.",
    "url": "https://popular.info/p/update-school-board-voters-fight"
  },
  {
    "text": "NewsNation to host next GOP debate; Megyn Kelly to moderate  —  NewsNation, the cable news channel launched in 2021 by Nexstar Media Group, will host the fourth Republican presidential primary debate next month in Alabama, the network announced on Thursday.  —  The Dec. 6 debate will air … ",
    "url": "https://thehill.com/homenews/campaign/4301300-newsnation-to-host-next-gop-debate-megyn-kelly-to-moderate/"
  }
]