[
  {
    "text": "Trump urges Christians to vote: 'You won't have to do it' in four years  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4795823-trump-encourages-christians-vote/"
  },
  {
    "text": "Trump Tells Christians 'You Won't Have to Vote Anymore' If He's Elected  —  Donald Trump, after lamenting that conservative Christians are not “big voters,” urged the religious right to turn out for him “just this time.”  —  In the closing minutes of his speech to a gathering … ",
    "url": "https://www.nytimes.com/2024/07/27/us/politics/trump-votes-christians.html?unlocked_article_code=1.-U0.99ad.Z58CgfqpBLXD&smid=url-share"
  },
  {
    "text": "Trump Cryptically Declares, 'You Won't Have to Vote Anymore' If He Wins Second Term  —  Former President Donald Trump urged members of a crowd in Florida to vote and said that if he wins, they “won't have to vote anymore.”  —  Speaking at a Turning Point Action event in West Palm Beach on Friday … ",
    "url": "https://www.mediaite.com/trump/trump-cryptically-declares-you-wont-have-to-vote-anymore-if-he-wins-second-term/"
  },
  {
    "text": "Usha Vance told friends Trump appalled her.  Now she's working to elect him.  —  The potential second lady found Trump's actions on Jan. 6 “deeply disturbing,” a friend said.  But ambition and devotion to her husband ultimately drove her to a place in the former president's campaign.",
    "url": "https://www.washingtonpost.com/politics/2024/07/27/usha-vance-trump-jan6/"
  },
  {
    "text": "This is a misogyny emergency.  A huge outpouring is coming in the runup to the US election  —  This time Kamala Harris will be the target for the social media platforms that promote prejudice  —  In 2016, a historically unprecedented incident took place.  And yet, barely anyone even noticed.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/27/misogyny-emergency-huge-outpouring-kamala-harris-us-electionction"
  },
  {
    "text": "Harris' Zoom-fueled campaign triggers a dormant Democratic base  —  They logged on.  They raised millions.  —  When a group of Black women political organizers assembled for a regular Zoom call on Sunday, they suddenly had a new mission.  A mere hours earlier, President Joe Biden had ended … ",
    "url": "https://www.politico.com/news/2024/07/27/kamala-harris-identity-zoom-00171489"
  },
  {
    "text": "The night White women raised millions for Harris.  And broke Zoom.  —  Over 164,000 women joined a Zoom call to discuss support, privilege and allyship as they raised millions for the vice president's campaign.  —  *Correction appended.  —  “Girl, we broke Zoom,” Erin Gallagher said over text … ",
    "url": "https://19thnews.org/2024/07/white-women-harris-broke-zoom/"
  },
  {
    "text": "House Republicans continue to flail, further endangering their majority  —  GOP members struggled with basic tasks this summer, heading for a long break with few accomplishments.  —  In his bid to claim the House speaker's gavel and end three weeks of chaos last fall, Rep. Mike Johnson mapped out an ambitious agenda.",
    "url": "https://www.washingtonpost.com/politics/2024/07/27/house-republicans-mike-johnson-recess-appropriations-bills/"
  },
  {
    "text": "Major Democratic donors want Kamala Harris to fire the FTC chair if she becomes president  —  FTC Chair Lina Khan has taken an aggressive approach to antitrust enforcement  —  Not even a week after Kamala Harris took over as the Democratic presidential nominee, major donors are already making demands of her potential administration.",
    "url": "https://qz.com/kamala-harris-democrat-donor-ftc-lina-khan-linkedin-iac-1851606256"
  },
  {
    "text": "Biden to announce plans to reform US supreme court - report  —  US president also to seek constitutional amendment to limit immunity for presidents and various officeholders  —  Joe Biden will announce plans to reform the US supreme court on Monday, Politico reported, citing two people familiar … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/26/biden-to-announce-plans-to-reform-us-supreme"
  },
  {
    "text": "JD Vance, an Unlikely Friendship and Why It Ended  —  His political views differed from a transgender classmate's, but they forged a bond that lasted a decade — until Mr. Vance seemed to pivot, politically and personally.  —  When his book, “Hillbilly Elegy,” was published in 2016 … ",
    "url": "https://www.nytimes.com/2024/07/27/us/politics/jd-vance-friend-transgender.html?unlocked_article_code=1.-U0.Leu-.RgRLUedl-zbL&smid=url-share"
  },
  {
    "text": "Republicans Keep Trying to Copy Trump's Humor — And Voters Keep Cringing  —  Far-right candidates just can't duplicate the flair Trump brings from his TV career.  —  On Monday, in the midst of a speech in his hometown of Middletown, Ohio, one of JD Vance's half-jokes landed with a thud.",
    "url": "https://www.politico.com/news/magazine/2024/07/27/jd-vance-trump-imitation-00171375"
  },
  {
    "text": "Donald Trump Seen in Public Without Ear Bandage  —  LOOKS GOOD  —  The former president has ditched the gauze over his right ear which became a viral meme after the Republican National Convention.  —  Journalist  —  Donald Trump ditched his ear bandage for his meeting with Israeli Prime Minister Benjamin Netanyahu on Friday.",
    "url": "https://www.thedailybeast.com/donald-trump-seen-in-public-without-ear-bandage-after-assassination-attempt"
  },
  {
    "text": "How Trump and Vance went from a ‘threat to democracy’ to ‘weird’  —  With Harris at the top of the ticket, Democrats shift to a simpler characterization of Trump.  —  In the days since Vice President Kamala Harris has taken over the campaign against former President Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/26/trump-vance-weird-00171470"
  },
  {
    "text": "Harris campaign reports record-breaking volunteer surge in key swing states … - The campaign has seen record-breaking fundraising and early polling bumps — a “honeymoon” phase that former President Trump's campaign is hoping will soon end.  — The enthusiasm has also stretched down ballot … ",
    "url": "https://www.axios.com/2024/07/26/harris-campaign-volunteers-swing-states"
  },
  {
    "text": "WATCH: Joe Biden's Senior Moment of the Week (Rest in Peace Edition)  —  Weep not for the memories  —  We regret to inform you that Joe Biden is no longer with us.  He was 81 years young.  God rest his soul.  —  OK, sure, he's technically still alive and president of the United States … ",
    "url": "https://freebeacon.com/biden-administration/watch-joe-bidens-senior-moment-of-the-week-rest-in-peace-edition/"
  },
  {
    "text": "Justice Department reaches $2M in settlements with FBI officials whose texts infuriated Trump  —  Other portions of Peter Strzok's lawsuit over his firing will continue as former FBI attorney Lisa Page's case is resolved.  —  The Justice Department has agreed to pay a total of $2 million … ",
    "url": "https://www.politico.com/news/2024/07/26/peter-strzok-lawsuit-settlement-00171498"
  }
]