[
  {
    "text": "Trump and the EU Dodge a Trade War  —  The U.S. President gets his beloved 15% tariff but little else from Europe.  —  The U.S. and Europe stepped back from the brink of a trade war Sunday, as the two sides announced a deal that avoids tit-for-tat escalation that could do larger damage to both economies.",
    "url": "https://www.wsj.com/opinion/trump-and-the-eu-dodge-a-trade-war-tariffs-policy-economy-0064e989?st=PTVtwa&reflink=article_copyURL_share"
  },
  {
    "text": "Von der Leyen and Trump strike EU-US trade deal with 15% tariff for the bloc  —  The trade deal will introduce a 15% tariff for the vast majority of EU products.  But some will benefit from a “zero-for-zero” scheme.  —  The European Union and the United States have struck a tentative trade deal … ",
    "url": "https://www.euronews.com/my-europe/2025/07/27/von-der-leyen-and-trump-strike-eu-us-trade-deal-to-avert-all-out-tariff-war"
  },
  {
    "text": "How the EU succumbed to Trump's tariff steamroller  —  Relief at avoiding trade war is tinged with regret at not taking firmer stand from the start  —  Andy Bounds in Brussels, Henry Foy in Turnberry and Ben Hall in London  —  The path to the EU's capitulation to Donald Trump's trade blitz was set on April 10.",
    "url": "https://www.ft.com/content/85d57e0e-0c6f-4392-a68c-81866e1519c3"
  },
  {
    "text": "Trump's Tariffs Are Already Stunting World Growth While Markets Shrug  —  With the president's new trade deals, US protectionism is slowing investment and rewiring supply chains at the expense of the global economy  —  As Donald Trump barrels toward his latest tariff deadline … ",
    "url": "https://www.bloomberg.com/news/features/2025-07-27/how-trump-s-tariffs-are-already-stunting-world-economic-growth"
  },
  {
    "text": "How the EU dashed to Trump's Scottish hideaway — and got the deal it craved  —  TURNBERRY, Scotland — There was something deeply ironic in the EU's top brass having to fly to Britain to seal the bloc's biggest deal since Brexit — but that's what Donald Trump wanted and that's what Donald Trump got.",
    "url": "https://www.politico.eu/article/us-and-eu-strike-trade-deal/"
  },
  {
    "text": "Trump fumes as Epstein scandal dominates headlines, overshadows agenda  —  The White House and Justice Department's response to the crisis has been driven by no clear strategy other than asking the country to forget it and move on, multiple people close to the situation told The Post.",
    "url": "https://www.washingtonpost.com/national-security/2025/07/27/justice-epstein-memo-bondi-blanche-patel-trump/"
  },
  {
    "text": "Tom Lehrer, Musical Satirist With a Dark Streak, Dies at 97  —  A mathematician by training, he acquired a devoted following with songs that set sardonic lyrics to music that was often maddeningly cheerful.  —  Tom Lehrer, the Harvard-trained mathematician whose wickedly iconoclastic songs … ",
    "url": "https://www.nytimes.com/2025/07/27/arts/music/tom-lehrer-dead.html?unlocked_article_code=1.Zk8.j4kp.ADZ8OeduFlbp&smid=url-share"
  },
  {
    "text": "Leno Calls for Late Night to Drop Partisan Politics: ‘Why Shoot for Just Half an Audience?’  —  PLAY NICE  —  Jay Leno thinks his former fellow late-night show hosts are alienating audiences with their barbs and jabs against the Trump administration.  “I love political humor, don't get me wrong … ",
    "url": "https://www.thedailybeast.com/jay-leno-calls-for-late-night-shows-to-drop-partisan-politics-why-shoot-for-just-half-an-audience/"
  },
  {
    "text": "Colorado lawmaker says Gabbard has become ‘weapon’ for Trump … “There have been four investigations including a bipartisan Senate investigation led under the first Trump administration in part by Marco Rubio that is very clear on these findings,” he said, referencing Trump's secretary of state.",
    "url": "https://www.politico.com/news/2025/07/27/crow-gabbard-weapon-of-mass-destruction-00479152"
  },
  {
    "text": "Senate Democrats urge U.S. to stop funding GHF, resume support for U.N. food distribution in Gaza as more starve  —  A group of Democratic senators led by Democratic Sen. Chris Van Hollen of Maryland is urging the Trump administration to suspend American financial support … ",
    "url": "https://www.cbsnews.com/news/gaza-starvation-senate-democrats-urge-u-s-to-stop-funding-ghf-resume-support-for-un/"
  },
  {
    "text": "Johnson says Ghislaine Maxwell deserves life sentence over Epstein crimes, rejects potential pardon  —  House Speaker calls for ‘maximum disclosure’ of Epstein files while protecting innocent victims  —  House Speaker Mike Johnson, R-La., said Sunday that Jeffrey Epstein's former girlfriend … ",
    "url": "https://www.foxnews.com/politics/johnson-says-ghislaine-maxwell-deserves-life-sentence-over-epstein-crimes-rejects-potential-pardon"
  },
  {
    "text": "Another whistleblower claims that top DOJ official suggested department could ignore court orders  —  Another whistleblower has made claims to the Justice Department's watchdog that Emil Bove — a top agency official who is now nominated for a judgeship — suggested others in the department … ",
    "url": "https://cnn.com/2025/07/27/politics/justice-department-official-second-whistleblower"
  },
  {
    "text": "Exclusive: Private Probe of Alleged Epstein—Mossad Links  —  Hedge funds connected to Epstein enlist a former federal agent to probe the late sex trafficker's mysterious wealth, who suspects Israel may have provided secret funds for spying ops.  —  ∙ Paid",
    "url": "https://www.spytalk.co/p/exclusive-private-probe-of-alleged"
  },
  {
    "text": "Rough deal: Social media roasts Trump's golf game after clip appears to show alleged cheating in Scotland  —  Trump has long been accused of cheating at golf and mixing politics and business on the course  —  Social media users pounced on a clip that appears to show Donald Trump cheating … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-video-golf-cheating-scotland-b2796977.html"
  },
  {
    "text": "Sen. Graham says there will be a ‘change in strategy’ in Gaza ‘to destroy Hamas’  —  In an exclusive interview with Meet the Press, Sen. Lindsey Graham (R-S.C.) shares what he's hearing from the White House and Israeli officials about the next stage of the war, saying “there will be a full military effort … ",
    "url": "https://www.nbcnews.com/meet-the-press/video/sen-graham-says-there-will-be-a-change-in-strategy-in-gaza-to-destroy-hamas-243905605826"
  },
  {
    "text": "NYC's 'We're With Colbert' rally for late-night host is a bust with just 20 protesters  —  What a joke.  —  A Big Apple rally in support of on-his-way-out “Late Show” host Stephen Colbert drew fewer than two dozen people Sunday — with even the NYPD cops on scene quickly calling it a day since … ",
    "url": "https://nypost.com/2025/07/27/us-news/nycs-were-with-colbert-rally-for-late-night-host-is-bust/"
  },
  {
    "text": "Software group Auterion to ship 33,000 AI drone ‘strike kits’ to Ukraine  —  Pentagon-backed deal aims to help combat mass attacks by Russia  —  Sylvia Pfeifer in London, Laura Pitel in Berlin and Christopher Miller in Kyiv  —  US-German software company Auterion will send tens of thousands … ",
    "url": "https://www.ft.com/content/fe708758-619e-47a8-ae7a-18adcede267a"
  },
  {
    "text": "Full transcript of “Face the Nation with Margaret Brennan,” July 27, 2025  —  On this “Face the Nation with Margaret Brennan” broadcast, moderated by Margaret Brennan:  — Office of Managment and Budget Director Russell Vought  — Sen. Chris Van Hollen, Democrat of Maryland",
    "url": "https://www.cbsnews.com/news/face-the-nation-full-episode-transcript-07-27-2025/"
  },
  {
    "text": "Preparations underway for Qatari jet that will be used as Air Force One  —  Preparations to refit the Qatari jet that will be used as Air Force One are underway, and floor plans or schematics have been seen by senior U.S. officials, CBS News has learned.  —  Earlier this year … ",
    "url": "https://www.cbsnews.com/news/qatar-jet-trump-air-force-one-preparations/"
  }
]