[
  {
    "text": "Hillary Clinton: I've Debated Trump and Biden.  Here's What I'm Watching For.  —  Last week, I had the time of my life at the Tony Awards introducing a song from “Suffs,” the Broadway musical I co-produced about the suffragists who won women the right to vote.",
    "url": "https://www.nytimes.com/2024/06/25/opinion/hillary-clinton-trump-biden-debate.html"
  },
  {
    "text": "Speaker Johnson wants to lower the debate bar for Trump  —  The GOP leader suggested this weekend that host network CNN will “rig” the debate for President Joe Biden.  —  Speaker Mike Johnson, the highest-ranking Republican in government, has been leaning hard into former President Donald Trump's embrace lately.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/mike-johnson-cnn-debate-trump-biden-rcna158626"
  },
  {
    "text": "The Nuclear Weapons Document Trump Stashed under Bubble Wrap and a Christmas Pillow  —  As noted, Jack Smith has filed his response to Trump's bid to throw out his stolen document indictment because the order of certain boxes was not retained.  —  A key part of Smith's response argues … ",
    "url": "https://www.emptywheel.net/2024/06/25/the-nuclear-weapons-document-trump-stashed-under-bubble-wrap-and-a-christmas-pillow/"
  },
  {
    "text": "Trump expressed concern that returning classified docs after subpoena could result in criminal charges, according to sealed notes  —  Judge Aileen Cannon is considering tossing out the notes as evidence.  —  This image contained in a court filing by the Department of Justice on Aug. 30 … ",
    "url": "https://abcnews.go.com/US/trump-expressed-concern-returning-classified-docs-after-subpoena/story?id=111383032"
  },
  {
    "text": "Newly released photos from FBI's Mar-a-Lago search show Trump keepsakes alongside sensitive records  —  Washington — Newly revealed photographs taken by the FBI during its August 2022 search of former President Donald Trump's South Florida resort shed further light on how the former president kept keepsakes … ",
    "url": "https://www.cbsnews.com/news/newly-released-photos-fbi-mar-a-lago-search-show-trump-boxes-keepsakes-alongside-sensitive-records/"
  },
  {
    "text": "“Nobody ever slept on that side of the bed usually so he would have it all full of boxes”  —  The government has filed their response to Trump's argument that, because some of the contents of Trump's boxes have shifted during the investigation, the entire indictment must be dismissed.",
    "url": "https://www.emptywheel.net/2024/06/25/nobody-ever-slept-on-that-side-of-the-bed-usually-so-he-would-have-it-all-full-of-boxes/"
  },
  {
    "text": "Scoop: 16 Nobel economists see a Trump inflation bomb … - “While each of us has different views on the particulars of various economic policies, we all agree that Joe Biden's economic agenda is vastly superior to Donald Trump,” the 16 economists write in a letter, first obtained by Axios.",
    "url": "https://www.axios.com/2024/06/25/nobel-prize-winners-biden-economy-trump-inflation"
  },
  {
    "text": "Donald Trump May ‘Reignite’ Inflation, Nobel Prize-Winning Economists Warn  —  A coalition of Nobel Prize-winning economists has warned about inflation if former President  —  wins the presidential election.  —  President  —  and Trump are set to face off in the November election, and inflation remains a key issue in the race.",
    "url": "https://www.newsweek.com/donald-trump-inflation-nobel-economists-warning-1917046"
  },
  {
    "text": "Why Jamaal Bowman's New York primary is huge for pro-Israel groups  —  An AIPAC-aligned super PAC and others have spent increasingly huge sums of money in high-profile Democratic primaries.  Their record is mixed, but a Bowman defeat would be their biggest win yet.",
    "url": "https://www.washingtonpost.com/politics/2024/06/25/why-jamaal-bowmans-new-york-primary-is-huge-pro-israel-groups/"
  },
  {
    "text": "Conservatives win longtime Liberal stronghold Toronto-St. Paul's in shock byelection result  —  Stunning result raises questions about Prime Minister Justin Trudeau's future  —  Conservative candidate Don Stewart has won the longtime federal Liberal stronghold of Toronto-St. Paul's … ",
    "url": "https://www.cbc.ca/news/politics/byelection-polls-liberal-conservative-ballot-vote-1.7243748"
  },
  {
    "text": "Infant mortality rate rose 8% in wake of Texas abortion ban, study shows  —  In the wake of Texas' abortion ban, the state's infant death rate increased and more died of birth defects, a study published Monday shows.  —  The analysis out of Johns Hopkins University is the latest research … ",
    "url": "https://apnews.com/article/abortion-texas-infant-mortality-birth-defects-b055ac35cdbc9ec13f400b4c3e1056e7"
  },
  {
    "text": "AJC Poll: Trump leads Biden in Georgia ahead of first debate  —  Sharp warning signs emerge in the state for both candidates.  —  Former President Donald Trump holds a slight lead over President Joe Biden in Georgia in an Atlanta Journal-Constitution poll released Tuesday ahead of an Atlanta debate … ",
    "url": "https://www.ajc.com/politics/ajc-poll-trump-leads-biden-in-georgia-ahead-of-first-debate/2INZ7K3PNFCGNHF7N5SFP2HF4A/"
  },
  {
    "text": "Ethics investigation adds to troubles for GOP's Ronny Jackson  —  Rep. Ronny Jackson didn't need another controversy.  The Texas Republican is nevertheless facing an advancing investigation from the House Ethics Committee.  —  During his relatively brief tenure as a political figure … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/ethics-investigation-adds-troubles-gops-ronny-jackson-rcna158760"
  },
  {
    "text": "Florida not a battleground, Biden campaign chair says  —  Biden campaign chair Jen O'Malley Dillon sees other states as the way to win the Electoral College.  —  President Joe Biden and Democrats have been insisting that Florida's gettable for them in November.  —  But not everyone seems to have gotten the memo.",
    "url": "https://www.politico.com/news/2024/06/25/florida-battleground-biden-trump-00164808"
  },
  {
    "text": "Oklahoma Supreme Court Says No to State Funding for a Religious Charter School  —  In a closely watched case, Oklahoma's highest court blocked what was set to become the nation's first religious charter school.  An appeal is likely.  —  The Oklahoma Supreme Court blocked on Tuesday … ",
    "url": "https://www.nytimes.com/2024/06/25/us/oklahoma-supreme-court-religious-charter-school.html"
  },
  {
    "text": "Conservative US lawmakers are pushing for an end to no-fault divorce  —  Republicans in Louisiana, Oklahoma, Nebraska and Texas have discussed eliminating or restricting such cases  —  Some prominent conservative lawmakers and commentators are advocating for ending no-fault divorce … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/25/republicans-no-fault-divorce"
  },
  {
    "text": "Wikileaks founder Julian Assange to plead guilty, return to Australia  —  WASHINGTON (AP) — WikiLeaks founder Julian Assange will plead guilty to a felony charge in a deal with the U.S. Justice Department that will free him from prison and resolve a long-running legal saga that spanned multiple continents … ",
    "url": "https://apnews.com/article/assange-plea-deal-wikileaks-justice-department-d329ba4614dbfa77b5eb968d07fd9bd0"
  },
  {
    "text": "Charlie Kirk once unified conservative youth for Trump.  Why are Republicans now turning on him?  —  Kirk's non-profit, Turning Point Action, is planning a $100m ‘chase the vote’ operation to help propel the ex-president to the White House, but his outsized influence is being subjected to scrutiny",
    "url": "https://www.theguardian.com/us-news/ng-interactive/2024/jun/25/charlie-kirk-turning-point-usa-chase-the-vote-trump"
  },
  {
    "text": "Exclusive: Trump reviews plan to halt US military aid to Ukraine unless it negotiates peace with Moscow  —  Two key advisers to Donald Trump have presented him with a plan to end Russia's war in Ukraine — if he wins the presidential election — that involves telling Ukraine … ",
    "url": "https://www.reuters.com/world/us/trump-reviews-plan-halt-us-military-aid-ukraine-unless-it-negotiates-peace-with-2024-06-25/"
  },
  {
    "text": "House GOP passes on using funding bills to target Trump prosecutors — for now  —  House Republicans are bypassing a major tool they said they could use to target former President Donald Trump's prosecutors — at least for now.  Republicans on the House Appropriations Committee … ",
    "url": "https://www.politico.com/live-updates/2024/06/25/congress/gop-punts-on-trump-prosecutors-00164828"
  },
  {
    "text": "Israel supreme court rules religious seminary students must be drafted to military  —  Israel's Supreme Court ruled on Tuesday that the state must begin drafting ultra-Orthodox Jewish seminary students into the military, a decree which creates new political strains for embattled Prime Minister Benjamin Netanyahu.",
    "url": "https://www.reuters.com/world/middle-east/israel-supreme-court-rules-religious-seminary-students-must-be-drafted-military-2024-06-25/"
  }
]