[
  {
    "text": "Mike Johnson's Wife Runs Counseling Service That Compares Being Gay To Bestiality, Incest  —  The newly elected Republican House speaker and his wife, Kelly, have long intertwined their political and business lives.  —  LOADING  —  The wife of newly elected House Speaker Mike Johnson … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-wife-homosexuality-bestiality-incest_n_653abfb6e4b00110fef0462e"
  },
  {
    "text": "Nine Takeaways From Mike Johnson's First Interview as Speaker  —  The Louisiana Republican spoke about how his worldview is dictated by the Bible, and discussed issues including abortion, gay marriage and aid for Ukraine.  —  Speaker Mike Johnson said on Thursday evening that his personal worldview … ",
    "url": "https://www.nytimes.com/2023/10/27/us/politics/mike-johnson-interview-hannity-takeaways.html"
  },
  {
    "text": "Mike Johnson points to a Biden impeachment, even if the facts do not  —  On Thursday, House Speaker Mike Johnson (R-La.) granted his first cable-news network interview since securing his new role.  He was not playing on “hard” mode, certainly; his interlocutor was Fox News's generally pliable Sean Hannity.",
    "url": "https://www.washingtonpost.com/politics/2023/10/27/mike-johnson-points-biden-impeachment-even-if-facts-dont/"
  },
  {
    "text": "After Shooting, Maine Senators in the Spotlight on Guns  —  The shooting in Lewiston that left 18 dead prompted the town's conservative Democratic representative to embrace an assault weapons ban, but Senators Susan Collins and Angus King are still resisting.",
    "url": "https://www.nytimes.com/2023/10/27/us/politics/maine-assault-weapons-collins-king.html"
  },
  {
    "text": "Stephen King on Mass Shootings: We're Out of Things to Say  —  There is no solution to the gun problem, and little more to write, because Americans are addicted to firearms.  —  Representative Jared Golden, from Maine's Second Congressional District, has reversed course … ",
    "url": "https://www.nytimes.com/2023/10/27/opinion/stephen-king-maine-shootings.html"
  },
  {
    "text": "The Aftermath of a Massacre Is Always the Time to Push for Gun Legislation  —  Axios: … Since no other civilized country on the planet has massacres like this, Johnson is implicitly arguing that the problem isn't the human heart, but the American heart.  —  Or, maybe the problem is the fact … ",
    "url": "https://daringfireball.net/linked/2023/10/27/aftermath"
  },
  {
    "text": "Playbook PM: Will Dean Phillips stop Trump or help him?  —  THE TALENTED MR. SANTOS — Rep. GEORGE SANTOS (R-N.Y.) today pleaded not guilty to 10 new federal counts against him, maintaining his innocence in the face of prosecutors' superseding indictment.  His trial on charges of fraud … ",
    "url": "https://www.politico.com/newsletters/playbook-pm/2023/10/27/will-dean-phillips-stop-trump-or-help-him-00123999"
  },
  {
    "text": "U.S. urges Israel against Gaza ground invasion, pushes surgical campaign  —  U.S. officials say a full-scale ground invasion risks a wider Middle East war and jeopardizes the lives of hundreds of hostages  —  The Biden administration is urging Israel to rethink its plans for a major ground offensive … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/27/us-urging-israel-rethinkg-gaza-ground-invasion/"
  },
  {
    "text": "A year later, Musk's X is tilting right.  And sinking.  —  The billionaire bought Twitter to revive its business and make it less “woke.”  He has succeeded at only one of those goals.  —  One year after billionaire Elon Musk bought Twitter for $44 billion, aiming to rid it of a … ",
    "url": "https://www.washingtonpost.com/technology/2023/10/27/elon-musk-twitter-x-anniversary/"
  },
  {
    "text": "Judge orders Ivanka Trump to testify in $250 million fraud case  —  Judge Arthur Engoron agreed with the AG's office that her testimony is necessary, even though she's no longer a defendant in the case.  —  The judge overseeing the $250 million civil trial against Donald Trump and his company ordered … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-orders-ivanka-trump-testify-250-million-fraud-case-rcna122482"
  },
  {
    "text": "CPJ statement on news blackout in Gaza  —  The Israel-Gaza war has entered a new stage with intensified bombing and ground operations by Israeli forces.  The Committee to Protect Journalists (CPJ) is highly alarmed by widespread reports of a communications blackout in Gaza.",
    "url": "https://cpj.org/2023/10/cpj-statement-on-news-blackout-in-gaza/"
  },
  {
    "text": "Mike Johnson's conspiracy theories about ‘illegals’ mark a new GOP low  —  Rep. Mike Johnson, the newly elected House speaker, has repeatedly flirted with what's known as the “great replacement theory,” the idea that Democrats are scheming to supplant American voters with immigrants.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/27/mike-johnson-great-replacement-theory-house-speaker/"
  },
  {
    "text": "Gun Maine suspect used to kill 18 people was bought legally just days before psychiatric evaluation, sources say  —  The gun investigators believe Robert Card used to kill 18 people and wound more than a dozen others was purchased legally just days before he was hospitalized and ordered … ",
    "url": "https://www.cnn.com/2023/10/27/us/maine-shootings-suspect-search-friday/"
  },
  {
    "text": "Kanye and Adidas: Money, Misconduct and the Price of Appeasement  —  The Adidas team was huddled with Kanye West, pitching ideas for the first shoe they would create together.  It was 2013, and the rapper and the sportswear brand had just agreed to become partners.",
    "url": "https://www.nytimes.com/2023/10/27/business/kanye-west-adidas-yeezy.html"
  },
  {
    "text": "Trump appointee faces 10-year prison recommendation for joining mob at Capitol  —  In a new filing released on Friday, federal prosecutors are seeking a 10-year prison sentence for Federico “Freddie” Guillermo Klein, a former State Department official in the Trump administration who joined the mob at the Capitol on January 6.",
    "url": "https://www.rawstory.com/trump-appointee-10-years/"
  },
  {
    "text": "Arizona prosecutors ask about 2020 pressure campaign by Trump allies  —  PHOENIX — The Arizona attorney general's investigation into the coordinated attempt to overturn the 2020 election results by creating and sending documents to the federal government falsely declaring Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/27/arizona-investigation-2020-election-trump/"
  },
  {
    "text": "Biden has succeeded all along.  The media can't ignore it.  —  This week, I'll look at evolving coverage of President Biden, pick the pol of the week and share something off the (political) beaten path.  —  What caught my eye  —  Until recently, the gulf between President Biden's performance … ",
    "url": "https://www.washingtonpost.com/opinions/2023/10/27/biden-performance-media-israel-gaza-war/"
  },
  {
    "text": "Team Trump Revives Attack Ads Against DeSantis in Iowa  —  A super PAC supporting Trump is shifting its strategy again, with less than three months before the state's first-in-the-nation caucuses.  —  The super PAC supporting Donald J. Trump will begin airing an attack against Ron DeSantis in Iowa … ",
    "url": "https://www.nytimes.com/2023/10/27/us/politics/trump-desantis-iowa-ads.html"
  },
  {
    "text": "The Christian Nationalism of Speaker Mike Johnson … In his first day as the new Speaker of the United States House of Representatives, Mike Johnson (R-LA) wasted no time in using sweeping religious rhetoric to magnify this political moment.  While addressing his colleagues he shared how, “I don't believe there are any coincidences.",
    "url": "https://time.com/6329207/speaker-mike-johnson-christian-nationalism/"
  },
  {
    "text": "Bill Barr knocks Trump for having verbal skills that ‘are limited’  —  Former U.S. Attorney General Bill Barr knocked former President Trump's verbal skills in Friday comments.  —  “His verbal skills are limited,” Barr said at an event at The University of Chicago's Institute of Politics.",
    "url": "https://thehill.com/homenews/4280503-bill-barr-knocks-trump-for-having-verbal-skills-that-are-limited/"
  }
]