[
  {
    "text": "Previously Secret Memo Laid Out Strategy for Trump to Overturn Biden's Win  —  The House Jan. 6 committee's investigation did not uncover the memo, whose existence first came to light in last week's indictment.  —  A lawyer allied with President Donald J. Trump first laid out a plot … ",
    "url": "https://www.nytimes.com/2023/08/08/us/politics/trump-indictment-fake-electors-memo.html"
  },
  {
    "text": "Trump says a protective order would violate his First Amendment rights: ‘I will talk’  —  The order would prevent Trump from disclosing certain government evidence in the case examining efforts to overturn the 2020 election.  —  Trump on protective order: ‘I will talk about it’",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-protective-order-violates-first-amendment-rights-will-talk-rcna98881"
  },
  {
    "text": "Ohio Voters Reject Constitutional Change Intended to Thwart Abortion Amendment  —  The contest was seen as a test of efforts by Republicans nationwide to curb voters' use of ballot initiatives.  —  Ohio voters rejected a bid to make it harder to amend the State Constitution on Tuesday … ",
    "url": "https://www.nytimes.com/2023/08/08/us/ohio-election-issue-1-results.html"
  },
  {
    "text": "Win for reproductive rights as Ohio voters reject effort to make it harder to amend state constitution  —  Proposal would have made it considerably harder to amend state constitution as voters give verdict on Issue 1  —  Ohio voters on Tuesday rejected a proposal that would have made it considerably harder … ",
    "url": "https://www.theguardian.com/us-news/2023/aug/08/ohio-issue-1-rejected-state-constitution"
  },
  {
    "text": "Ohio Vote Shows Abortion's Potency to Reshape Elections  —  The Dobbs ruling has turned a coalition of liberal, swing and moderate Republican voters into a political force.  Even in August in Ohio.  —  Gov. Mike DeWine of Ohio, a Republican, argued that Tuesday's vote over how to amend … ",
    "url": "https://www.nytimes.com/2023/08/09/us/politics/ohio-election-abortion-voters.html"
  },
  {
    "text": "DeSantis Suspends Second Elected Prosecutor in Florida  —  The Republican governor accused Monique H. Worrell, the state attorney in Orlando and a Democrat, of leniency against violent criminals, a charge her office has denied.  —  Reporting from Florida  —  Gov. Ron DeSantis of Florida suspended … ",
    "url": "https://www.nytimes.com/2023/08/09/us/desantis-orlando-prosecutor.html"
  },
  {
    "text": "DeSantis suspends Orlando state attorney over ‘dereliction of duty’ on crime  —  DeSantis' office says State Attorney Monique Worrell allowed criminals to ‘escape the full consequences’ of their actions  —  Florida Gov. Ron DeSantis suspended Ninth Judicial Circuit State Attorney Monique Worrell for … ",
    "url": "https://www.foxnews.com/politics/desantis-suspends-orlando-state-attorney-over-dereliction-duty-crime"
  },
  {
    "text": "Governor Ron DeSantis Suspends State Attorney Monique Worrell for Neglect of Duty and Incompetence  —  TALLAHASSEE, Fla. — Today, Governor Ron DeSantis announced the suspension of State Attorney Monique Worrell of the 9th Judicial Circuit for neglecting her duty to faithfully prosecute crime in her jurisdiction.",
    "url": "https://www.flgov.com/2023/08/09/governor-ron-desantis-suspends-state-attorney-monique-worrell-for-neglect-of-duty-and-incompetence/"
  },
  {
    "text": "Comer Releases Third Bank Memo Detailing Payments to the Bidens from Russia, Kazakhstan, and Ukraine  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today released a third bank records memorandum detailing new information obtained … ",
    "url": "https://oversight.house.gov/release/comer-releases-third-bank-memo-detailing-payments-to-the-bidens-from-russia-kazakhstan-and-ukraine%EF%BF%BC/"
  },
  {
    "text": "Senator Dianne Feinstein Taken to Hospital After Tripping, Falling in San Francisco  —  EXCLUSIVE  —  266 … 7:30 AM PT — Senator Dianne Feinstein's office released this statement ... “Senator Feinstein briefly went to the hospital yesterday afternoon as a precaution after a minor fall in her home.",
    "url": "https://www.tmz.com/2023/08/09/senator-dianne-feinstein-hospitalized-trip-fall-shingles-health-san-francisco/"
  },
  {
    "text": "Much of historic Lahaina town believed destroyed as huge wildfire sends people fleeing into water  —  LAHAINA (HawaiiNewsNow) - Eyewitnesses described an apocalyptic scene Tuesday in Lahaina town, where residents were forced to jump into the harbor waters to avoid fast-moving flames … ",
    "url": "https://www.hawaiinewsnow.com/2023/08/09/coast-guard-joins-brush-fire-response-lahaina-where-crews-continue-battle-wind-whipped-flames/"
  },
  {
    "text": "Arizona Republicans Don't Want to Hear About the Deadly Heat Wave  —  GOP lawmakers are brushing off the extreme heat — and any suggestion of climate change.  —  PHOENIX —  When Arizona lawmakers returned to the state Capitol here earlier this month, they started their day with a prayer to ease the scorching heat.",
    "url": "https://www.politico.com/news/magazine/2023/08/09/phoenix-heat-wave-republicans-00110325"
  },
  {
    "text": "This family is moving to Italy because they've had enough of the US  —  As dozens of Italian towns sell off old houses on the cheap, foreigners who rush to grab one are often in search of a year-round sunshine spot, a vacation retreat, or just to live their Italian dream.",
    "url": "https://www.cnn.com/travel/latronico-italy-cheap-house-escape-us/"
  },
  {
    "text": "Vulnerable Republicans aren't sold on impeaching Biden  —  They have mixed feelings about whether to launch a formal inquiry, but they broadly agree the GOP doesn't have enough evidence to impeach him.  Their votes will be decisive.  —  WASHINGTON — House Speaker Kevin McCarthy faces unease within … ",
    "url": "https://www.nbcnews.com/politics/congress/vulnerable-republicans-arent-sold-impeaching-biden-rcna98638"
  },
  {
    "text": "Trump's criminal trials prompt GOP political doomsday alarms  —  GOP strategists and pollsters expect former President Trump's criminal trials to divide their party, creating a challenge for the Senate and House Republican candidates who will have to walk a fine line on the issue.",
    "url": "https://thehill.com/homenews/senate/4144517-trumps-criminal-trials-prompt-gop-political-doomsday-alarms/"
  },
  {
    "text": "U.S.-Saudi Deal Sets Path to Normalize Ties With Israel  —  Officials are now hammering out the details of a deal they hope to cement in the next nine-to-12 months, though many obstacles remain  —  WASHINGTON—U.S. and Saudi Arabia have agreed on the broad contours of a deal for Saudi Arabia … ",
    "url": "https://www.wsj.com/articles/u-s-saudi-arabia-agree-to-broad-terms-for-israel-normalization-ac6d549c?mod=djemalertNEWS"
  },
  {
    "text": "Is it cheaper to refuel your EV battery or gas tank?  We did the math in all 50 states.  —  Gasoline cars are cheaper to refuel than electric vehicles.  —  I've heard this claim pop up everywhere from Massachusetts to Fox News over the past two years.  My neighbor even refuses to plug … ",
    "url": "https://www.washingtonpost.com/climate-environment/interactive/2023/electric-vehicle-charging-price-vs-gasoline/"
  },
  {
    "text": "GOP Lawmaker's Wife Makes Little Free Libraries a Culture War Battleground  —  Arkansas State Rep. Stephen Meeks' spouse boasted she's been “swapping out” books for Bibles. … The wife of an Arkansas Republican state lawmaker has expanded the culture wars to miniature free libraries … ",
    "url": "https://www.thedailybeast.com/arkansas-rep-stephen-meeks-wife-jennifer-swaps-books-for-bibles-in-little-free-libraries"
  },
  {
    "text": "Smartmatic accuses Rudy Giuliani of ‘dog ate my homework’-style excuses to avoid turning over documents in defamation suit  —  The voting technology company Smartmatic blasted Rudy Giuliani in court filings Monday night, accusing him of fabricating “excuse after excuse” to avoid turning … ",
    "url": "https://www.cnn.com/2023/08/08/media/smartmatic-rudy-giuliani/"
  },
  {
    "text": "Biden to Restrict Investments in China, Citing National Security Threats  —  The measure to clamp down on investments in certain industries deemed to pose security risks, set to be issued Wednesday, appears likely to open a new front in the U.S.-China economic conflict.",
    "url": "https://www.nytimes.com/2023/08/08/business/economy/biden-china-companies-restrictions.html"
  }
]