[
  {
    "text": "Trump's revenge?  GOP braces for daily blasts from ‘orange Jesus’  —  His reascension, as nominee or the eventual winner, threatens to spark the same clashes with the Hill GOP that took a heavy toll on the party.  —  Congressional Republicans are steeling themselves for a return to daily life … ",
    "url": "https://www.politico.com/news/2023/12/04/trump-revenge-gop-00129418"
  },
  {
    "text": "Playbook: Time's up on Ukraine funding  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  SPEAK, MEMORY — Today marks the 250th day in Russian detention for EVAN GERSHKOVICH.  “That is 250 days too many,” WSJ Editor-in-Chief EMMA TUCKER writes this morning.",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/04/times-up-on-ukraine-funding-white-house-warns-00129855"
  },
  {
    "text": "How Roger Stone convinced Trump not to attack Ron DeSantis in his home state  —  An excerpt from the upcoming book “Swamp Monsters” by NBC News reporter Matt Dixon tells the tale of how Trump's team lobbied the political troublemaker to help them out.",
    "url": "https://www.nbcnews.com/politics/donald-trump/roger-stone-trump-attack-ron-desantis-swamp-monsters-matt-dixon-book-rcna127434"
  },
  {
    "text": "Why a Second Trump Presidency May Be More Radical Than His First  —  Donald Trump has long exhibited authoritarian impulses, but his policy operation is now more sophisticated, and the buffers to check him are weaker.  —  Donald Trump has long exhibited authoritarian impulses … ",
    "url": "https://www.nytimes.com/2023/12/04/us/politics/trump-2025-overview.html"
  },
  {
    "text": "GOP Chair Comer ‘Confident’ House GOP Has Votes to Move Forward With Biden Impeachment Inquiry  —  The Kentucky representative called House Republicans ‘united’ on the inquiry  —  House Oversight Committee Chair Rep. James Comer, R-Ky., on Monday said he is “confident” … ",
    "url": "https://themessenger.com/politics/gop-chair-comer-confident-house-gop-has-votes-to-move-forward-with-biden-impeachment-inquiry"
  },
  {
    "text": "12/4/23 ☀️ Punchbowl News AM … This is a big development that casts further doubt on the Senate's ability to pass a huge $105 billion foreign aid package for Ukraine, Israel and Taiwan.  Ukraine stands to be the biggest potential loser here as future funding for the embattled U.S. ally is in serious jeopardy.",
    "url": "https://punchbowl.news/archive/12423-punchbowl-news-am-2/"
  },
  {
    "text": "Former US ambassador arrested in Florida, accused of serving as an agent of Cuba, AP source says  —  A former American diplomat who served as U.S. ambassador to Bolivia has been arrested in a long-running FBI counterintelligence investigation, accused of secretly serving as an agent of Cuba's government … ",
    "url": "https://apnews.com/article/fbi-cuba-bolivia-former-ambassador-arrested-af9d80a4f268099364dff249dd74b3ec"
  },
  {
    "text": "'Everybody's daughter': The rape victim behind Kentucky's viral abortion ad  —  Hadley Duvall helped Democratic Gov. Andy Beshear win reelection — and she's ready to campaign again in 2024  —  MIDWAY, Ky. — One month before the governor thanked her for his victory, Hadley Duvall had already won.",
    "url": "https://www.washingtonpost.com/politics/2023/12/04/kentucky-abortion-ad/"
  },
  {
    "text": "Texas Republican Party rejects ban on associating with Nazi sympathizers  —  On Saturday, the Executive Committee of the Texas Republican Party considered the following resolution: … The Executive Committee voted down the proposal by a vote of 32-29.  According to the Texas Tribune … ",
    "url": "https://popular.info/p/texas-republican-party-rejects-ban"
  },
  {
    "text": "Ousted propaganda scholar Joan Donovan accuses Harvard of bowing to Meta  —  In a whistleblower complaint, she breaks her silence over events that unsettled other misinformation researchers  —  A prominent disinformation scholar has accused Harvard University of dismissing her to curry favor … ",
    "url": "https://www.washingtonpost.com/technology/2023/12/04/joan-donovan-harvard-dismissal-complaint/"
  },
  {
    "text": "ABC and CNN eying future GOP primary debates  —  The moves come as the RNC is considering a rule to allow candidates to participate in unsanctioned debates.  —  While the future of Republican presidential primary debates remains uncertain, two major TV networks have begun taking steps to potentially host future forums.",
    "url": "https://www.politico.com/news/2023/12/04/abc-and-cnn-eying-future-gop-primary-debates-00129863"
  },
  {
    "text": "Houthi Attacks on Commercial Shipping in International Water Continue  —  SOUTHERN RED SEA — Today, there were four attacks against three separate commercial vessels operating in international waters in the southern Red Sea.  These three vessels are connected to 14 separate nations.",
    "url": "https://www.centcom.mil/MEDIA/PRESS-RELEASES/Press-Release-View/Article/3605010/houthi-attacks-on-commercial-shipping-in-international-water-continue/"
  },
  {
    "text": "Swalwell Predicts Kevin McCarthy Will Be Next Expelled From Congress  —  The California congressman predicted the former speaker of the House won't last long following a physical scuffle with Tim Burchett  —  JWPlayer  —  Rep. Eric Swalwell, D-Calif., is predicting Republicans will move … ",
    "url": "https://themessenger.com/politics/eric-swalwell-kevin-mccarthy-congress-expulsion-george-santos"
  },
  {
    "text": "John Kerry says no coal plants should be ‘permitted anywhere in the world’  —  U.S. climate envoy John Kerry said he thinks coal plants should not be “permitted anywhere in the world.”  —  During a speech at the 2023 United Nations Climate Change Conference, Kerry said he is becoming … ",
    "url": "https://thehill.com/policy/energy-environment/4340428-john-kerry-says-no-coal-plants-should-be-permitted-anywhere-in-the-world/"
  },
  {
    "text": "To Win on Abortion, Republicans Must Reckon With What ‘Pro-Life’ Means Today  —  Electoral results since the Dobbs v. Jackson Women's Health Organization decision should tell a lot of people in the Republican Party something they absolutely do not want to hear: Even rank-and-file G.O.P. voters … ",
    "url": "https://www.nytimes.com/2023/12/04/opinion/republicans-abortion-pro-life.html"
  }
]