[
  {
    "text": "Miller-Meeks Statement on Speaker Vote and Death Threats  —  WASHINGTON, D.C. - Yesterday, I voted to support Jim Jordan's candidacy for Speaker of the House.  I voted for Jim Jordan for the greater good of the House Republican party, based on our Conference meeting and the test Speaker ballot that was cast earlier this week.",
    "url": "https://millermeeks.house.gov/media/press-releases/miller-meeks-statement-speaker-vote-and-death-threats"
  },
  {
    "text": "Why the GOP Can't Unite  —  It's two parties under the same roof, and the only solution is a coalition — between themselves or with Democrats.  —  “No one in our conference wants to see any type of coalition government with Democrats,” Jim Jordan (center) told reporters after the first vote Tuesday.",
    "url": "https://www.politico.com/news/magazine/2023/10/18/gop-party-house-speaker-00122371"
  },
  {
    "text": "Why the McHenry bubble might pop  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  OVERNIGHT — “Russia Detains a U.S. Journalist,” by NYT's Ivan Nechepurenko: “ALSU KURMASHEVA, who holds dual U.S.-Russian citizenship and works in Prague … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/19/why-the-mchenry-bubble-might-pop-00122410"
  },
  {
    "text": "Jim Jordan won't be the next speaker  —  Good morning, Early Birds.  We'd like to applaud Rep. Chip Roy (R-Tex.) for incorporating a reference to the Whigs — the extinct 19th-century political party — into his tweets about the speakership fight.  Rep. Mike Collins (R-Ga.) is still funnier, though.",
    "url": "https://www.washingtonpost.com/politics/2023/10/19/jim-jordan-wont-be-next-speaker/"
  },
  {
    "text": "Why House Republicans Can't Function, According to a House Republican  —  The House of Representatives has been enmeshed in chaos since the former Republican speaker Kevin McCarthy was voted out on Oct. 3 by members of his own conference.  Steve Scalise then ran for the speakership but withdrew … ",
    "url": "https://www.nytimes.com/2023/10/19/opinion/don-bacon-republicans-gaetz.html"
  },
  {
    "text": "Republicans Fear Jordan Speaker Bid Could Cost Them House Majority  —  Nearly 200 G.O.P. lawmakers have supported Representative Jim Jordan, the hard-right Ohio lawmaker, in the speaker fight.  Some Republicans say that may doom the party in coming elections.",
    "url": "https://www.nytimes.com/2023/10/18/us/politics/republicans-speaker-jim-jordan-democrats-elections.html"
  },
  {
    "text": "American journalist detained and charged in Russia  —  Alsu Kurmasheva's detention follows the arrest of Wall Street Journal reporter Evan Gershkovich, who is still awaiting trial on espionage charges.  —  A U.S. journalist has been detained in Russia, her employer said, the second such case since the w ar in Ukraine started.",
    "url": "https://www.nbcnews.com/news/world/american-journalist-detained-russia-alsu-kurmasheva-foreign-agent-rcna121173"
  },
  {
    "text": "Russia detains Radio Free Europe journalist with dual U.S. and Russian citizenship  —  Russia has detained an editor at U.S.-funded Radio Free Europe/Radio Liberty (RFE/RL) for failing to register as a foreign agent while visiting Russia for a family emergency, the broadcaster said.",
    "url": "https://www.reuters.com/world/radio-free-europe-says-russia-detains-us-journalist-with-dual-citizenship-2023-10-19/"
  },
  {
    "text": "Man Who Spread Misinformation on Trump's Behalf Sentenced to 7 Months  —  The man, Douglass Mackey, spread internet memes meant to fool people into not voting for Hillary Clinton in 2016.  —  A digital-age dirty-trickster who used Twitter posts that looked like Hillary Clinton ads … ",
    "url": "https://www.nytimes.com/2023/10/18/nyregion/douglass-mackey-trump-sentencing.html"
  },
  {
    "text": "'I Couldn't Shift Anything': Senior State Department Official Resigns Over Biden's Gaza Policy  —  Josh Paul, who spent a decade in State's bureau overseeing arms sales, exclusively spoke with HuffPost after quitting over the U.S. approach to the Israel-Palestine conflict.",
    "url": "https://www.huffpost.com/entry/state-department-resignation-gaza_n_65306079e4b00565b622b1fb"
  },
  {
    "text": "Trump Told Mitt Romney's Son He Would ‘Drop’ Melania: Book  —  An excerpt from Romney: A Reckoning details some of the Utah senator's first encounters with the former president  —  IN A NEW biography of Sen. Mitt Romney, Romney: A Reckoning by McKay Coppins, the Atlantic staff writer claims … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-bragged-drop-melania-romney-1234856364/"
  },
  {
    "text": "Inside Black Lives Matter's Long History With Hamas-Friendly Activists  —  Black Lives Matter chapters across the country made waves last week when they excused and explained away Hamas's attack on Israel.  —  A coalition of 26 local chapters called the attacks a “desperate act of self-defense.”",
    "url": "https://freebeacon.com/democrats/inside-black-lives-matters-long-sordid-history-with-pro-hamas-activists/"
  },
  {
    "text": "Hundreds arrested after Pro-Palestinian demonstrators flood Cannon Rotunda, Capitol complex  —  WASHINGTON - A pro-Palestinian protest is underway on Capitol Hill as demonstrators are occupying the Cannon Rotunda and large crowds are growing around the Capitol complex.",
    "url": "https://www.fox5dc.com/news/pro-palestinian-protest-underway-at-capitol-rotunda-uscp-detains-some-demonstrators-israel-hamas-war-capitol-hill-jewish-voices-for-peace"
  },
  {
    "text": "Trump Is Winning Over Swing-State Voters Wary of Biden's Economic Plan  — Voters in seven states trust Trump more on economy, poll shows  — Suburban women swing-state voters are a bright spot for Biden  —  Donald Trump is leading President Joe Biden in several key swing states … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-19/trump-leads-biden-in-key-us-states-as-voters-worry-about-economy-poll"
  },
  {
    "text": "Forget dating apps.  Sen. Grassley's office has produced 20 marriages.  —  Alex and Molly Severn held hands near the front of an Iowa church a few years ago, excited for the pastor to pronounce them husband and wife.  But for a moment, Molly thought the pastor was going to ruin her wedding.",
    "url": "https://www.washingtonpost.com/nation/2023/10/19/senator-chuck-grassley-married-couples-weddings/"
  },
  {
    "text": "Survivors of kibbutz attack turn their ire on Netanyahu  —  A massive security failure and antagonism toward Arabs means many Israelis think Netanyahu has to answer for Hamas' attack.  —  Tomer Eliaz, a 17-year-old boy in the kibbutz of Nahal Oz, was forced to go door-to-door by Hamas … ",
    "url": "https://www.politico.eu/article/benjamin-netanyahu-israel-survivors-of-kibbutz-attack-turn-their-ire/"
  },
  {
    "text": "Woman arrested after trying to get close to Trump at New York trial; she says she's a supporter  —  Former President Donald Trump will be back in court Tuesday for his New York civil fraud trial.  A lawsuit alleges that Trump and top executives at the Trump Organization, conspired to pad his net worth by billions of dollars.",
    "url": "https://apnews.com/article/donald-trump-letitia-james-fraud-lawsuit-new-york-dd10ecf8bdc4cbf8c17990cc4f40ce9b"
  },
  {
    "text": "Arizona Democratic Party donates $10K to Gallego Senate campaign  —  The Arizona Democratic Party donated $10,000 to Rep. Ruben Gallego's Senate campaign in the last quarter, as he prepares for a potential three-way race for Independent Sen. Kristen Sinema's seat in the swing state.",
    "url": "https://thehill.com/homenews/campaign/4264054-arizona-democratic-party-donates-10k-gallego-campaign-senate/"
  },
  {
    "text": "As Jordan wobbles, House GOP eyes potential next speaker candidates  —  Plenty of alternatives are in the mix.  But no one will make public moves until the Ohio Republican ends his flagging candidacy.",
    "url": "https://www.politico.com/live-updates/2023/10/18/congress/who-else-could-be-next-00122327"
  },
  {
    "text": "'It's not been enough to carry the day': Why the Victoria's Secret rebrand is over  —  Editor's Note: This article was originally published by Business of Fashion, an editorial partner of CNN  —  The radical transformation of Victoria's Secret is over.  —  The American lingerie chain … ",
    "url": "https://www.cnn.com/style/why-victorias-secret-is-bringing-sexy-back-bof/"
  },
  {
    "text": "Biden's pick for ambassador to Israel spars with Republican opponents  —  Jack Lew, a veteran of the Obama and Clinton administrations, has attracted criticism from some in the GOP for his defense of the Iran nuclear deal and related policies  —  Jack Lew, President Biden's nominee to become … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/18/jack-lew-israel-ambassador-hearing/"
  }
]