[
  {
    "text": "Pence Bows Out of '24 Race His Former Boss Is Dominating  —  He increasingly attacked Donald Trump over Jan. 6, but gained little traction and struggled to raise money.  —  Former Vice President Mike Pence, who spent four years dutifully serving President Donald J. Trump but refused to carry … ",
    "url": "https://www.nytimes.com/2023/10/28/us/politics/pence-drops-out-2024.html"
  },
  {
    "text": "Mike Pence suspends his struggling 2024 campaign  —  The former vice president was unable to gain traction in the face of Donald Trump's dominance in the race  —  Mike Pence announced on Saturday at the Republican Jewish Coalition gathering in Las Vegas that he was suspending his campaign and exiting the race for the GOP nomination.",
    "url": "https://www.washingtonpost.com/politics/2023/10/28/mike-pence-suspends-his-struggling-2024-campaign/"
  },
  {
    "text": "Mike Pence drops out of 2024 presidential race: ‘No regrets’  —  Former Vice President Mike Pence on Saturday dropped his bid for the Republican presidential nomination, ending his campaign for the White House after struggling to raise money and gain traction in the polls.",
    "url": "https://apnews.com/article/mike-pence-2024-president-campaign-republican-trump-0ec44fc2a5b8683f34883e0ea72b2ab2"
  },
  {
    "text": "For Mike Johnson, Religion Is at the Forefront of Politics and Policy  —  The new House speaker has put his faith at the center of his political career, and aligned himself with a newer cohort of conservative Christianity that some describe as Christian nationalism.",
    "url": "https://www.nytimes.com/2023/10/27/us/politics/mike-johnson-speaker-religion.html"
  },
  {
    "text": "Mike Johnson is well within the mainstream of today's GOP  —  Republicans' long public nightmare came to an end this past week when Louisiana's Mike Johnson became the 56th speaker of the House.  If you're like most people who claim to be smart about politics, you immediately pretended to know who he was and then went to Google him.",
    "url": "https://www.cnn.com/2023/10/28/politics/mike-johnson-speaker-republican-mainstream/"
  },
  {
    "text": "The deep inequity of the anti-college movement  —  I immigrated from Mexicali, Mexico, when I was 10 years old, the child of farm laborers.  I was still learning English when my high school teachers advised me to forgo any college dreams.  —  But there in the Imperial Valley of southeast California … ",
    "url": "https://thehill.com/opinion/congress-blog/4281108-the-deep-inequity-of-the-anti-college-movement/"
  },
  {
    "text": "Biden takes swipe at Trump, GOP at fundraiser: ‘Democracy is at stake in 2024’  —  President Biden made the stakes of the 2024 election clear for his supporters at a campaign fundraiser in Washington on Friday, taking a shot at his likely opponent, former President Trump.",
    "url": "https://thehill.com/homenews/campaign/4281141-biden-trump-democracy-at-stake-in-2024/"
  },
  {
    "text": "Ramaswamy addresses Israel policy criticism at Jewish forum in Las Vegas  —  Since the Oct. 7 Hamas attack in Israel, Ramaswamy has increasingly generated controversy over his remarks about the U.S.'s role in the conflict.  —  Vivek Ramaswamy on Saturday addressed criticism of his Israel stance … ",
    "url": "https://www.politico.com/news/2023/10/28/vivek-ramaswamy-israel-policy-00124095"
  },
  {
    "text": "Biden asks ‘who the hell’ needs a high-capacity assault weapon after Maine shooting  —  President Biden questioned the need for high-capacity magazines for assault weapons on Friday, amid calls for new gun control legislation after a mass shooting in Maine.  —  “Who the hell needs … ",
    "url": "https://thehill.com/homenews/administration/4280952-biden-high-capacity-assault-weapons-maine-shooting/"
  },
  {
    "text": "Ivanka Trump to testify Friday in the NY civil fraud trial - here's how she can hurt her father and brothers  — On Friday, Trump's NY fraud-trial judge ruled Ivanka Trump must testify next week.  — She had tried to quash her subpoena, saying it was overly broad and improperly served.",
    "url": "https://www.businessinsider.com/ivanka-trumps-ny-fraud-trial-testimony-can-hurt-donald-trump-2023-10?op=1"
  },
  {
    "text": "Misinformation is flowing ahead of Ohio abortion vote.  Some is coming from a legislative website  —  The inflammatory language targeting a reproductive rights measure on Ohio's fall ballot is the type of messaging that is common in the closing weeks of a highly contested initiative campaign … ",
    "url": "https://apnews.com/article/election-2023-ohio-abortion-amendment-misinformation-6b870f06abe5d70e8aa0a535b2e9dd1a"
  },
  {
    "text": "Cheryl Hines slams Biden for not providing RFK Jr. security detail  —  Actress Cheryl Hines slammed President Biden for not providing a security detail to her husband, presidential candidate Robert F. Kennedy Jr., in comments Friday.  —  Hines joined TMZ to speak about the intruder … ",
    "url": "https://thehill.com/homenews/campaign/4281313-cheryl-hines-slams-biden-for-not-providing-rfk-jr-security-detail/"
  },
  {
    "text": "Gaza's Tunnels Loom Large for Israel's Ground Forces  —  Hamas is believed to hide weapons, fighters and even command centers in miles of subterranean pathways and chambers.  —  Just after midnight on Tuesday, the Israel Defense Forces announced that they had struck a tunnel that allowed Hamas to “infiltrate Israel through the sea.”",
    "url": "https://www.nytimes.com/2023/10/28/us/politics/gazas-tunnels-israel-ground-war.html"
  },
  {
    "text": "Johnson's speakership win fails to end House GOP infighting  —  The centrist vs. conservative spending fight is rearing its head again.  New York Republicans are pushing to expel George Santos.  Matt Gaetz is still openly taking aim at Kevin McCarthy and others.",
    "url": "https://www.politico.com/news/2023/10/27/spending-gaetz-santos-house-gop-infighting-00124049"
  },
  {
    "text": "Speaker Johnson: Biden engaging in ‘cover-up’ of role in Hunter business dealings, impeachment probe continues  —  But he says inquiry must play out, and it's too soon to conclude an impeachable offense occurred  —  EXCLUSIVE: House Speaker Mike Johnson said President Biden is engaged in an … ",
    "url": "https://www.foxnews.com/politics/speaker-johnson-biden-engaging-in-cover-up-of-role-in-hunter-business-dealings-impeachment-probe-continues?intcmp=tw_fnc"
  },
  {
    "text": "Faced with abortion bans, doctors beg hospitals for help with key decisions  —  Vague state laws, and a lack of guidance on how to interpret them, have led to some patients being denied care until they are critically ill  —  Amelia Huntsberger pulled up a list of the top administrators … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/28/abortion-bans-medical-exceptions/"
  }
]