[
  {
    "text": "Harris campaign turns Trump's favorite weapon against him … - The campaign now uses those same tools to mock Trump and paint him in the opposite light. … - Another video, also posted Sunday, features one of Trump's rambling answers at an event, and the campaign labeled the former president “delulu” — Gen Z speak for “delusional.”",
    "url": "https://www.axios.com/2024/10/14/trump-harris-memes-social-media"
  },
  {
    "text": "More than 230 doctors and health care providers call on Trump to release medical records  —  More than 230 doctors, nurses and health care professionals are calling on former President Donald Trump to release his medical records, arguing that he should be transparent about his health “given his advancing age.”",
    "url": "https://www.cbsnews.com/news/trump-health-records-doctors-for-harris/"
  },
  {
    "text": "Geraldo Rivera Endorses Kamala Harris Over ‘Sore Loser’ Trump  —  “However you justify voting for Trump, adopting his big lie about the stolen election makes you a liar,” the veteran newsman said in a social media post Monday.  —  LOADING  —  Veteran newsman Gerald Rivera has finally broken away … ",
    "url": "https://www.huffpost.com/entry/geraldo-rivera-endorses-kamala-harris_n_670d501fe4b0c5b8c0aed74f"
  },
  {
    "text": "Trump's former Joint Chiefs chair: Trump is ‘fascist to the core’  —  “No one has ever been as dangerous to this country as Donald Trump,” retired Gen. Mark Milley said.  “Now I realize he's a total fascist.”  —  When Gen. Mark Milley retired last year, following more than four decades … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-former-joint-chiefs-chair-trump-fascist-core-rcna175248"
  },
  {
    "text": "Suspect arrested after reports of threats toward FEMA operations in North Carolina  —  A North Carolina man was arrested over the weekend for allegedly threatening harm against FEMA employees responding to Hurricane Helene, according to the Rutherford County Sheriff's Office.",
    "url": "https://www.cnn.com/2024/10/14/us/fema-helene-north-carolina-reported-threats/"
  },
  {
    "text": "Kamala Harris's Plagiarism Problem  —  The vice president appears to have airlifted sections of her book, Smart on Crime.  —  Kamala Harris has become famous, in part, for her unique rhetorical style.  She switches freely between various accents and peppers her speeches with catchphrases … ",
    "url": "https://christopherrufo.com/p/kamala-harriss-plagiarism-problem"
  },
  {
    "text": "NRA chief involved in gruesome cat killing as college fraternity member  —  Doug Hamlin pleaded no contest to animal cruelty over 1979 incident in which fraternity cat was tortured and killed  —  Douglas Hamlin, who was appointed to lead the NRA this summer in the wake of a long-running corruption scandal … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/14/nra-doug-hamlin-cat-killing"
  },
  {
    "text": "Cruz calls out McConnell-aligned group for not spending ‘a penny’ in Texas  —  Texas Sen. Ted Cruz (R) vented his frustration with the Senate Leadership Fund, a super PAC aligned with Senate Republican Leader Mitch McConnell (Ky.), for not spending any money in his competitive reelection race … ",
    "url": "https://thehill.com/homenews/senate/4932873-cruz-slf-mcconnell-senate-texas/"
  },
  {
    "text": "Kamala Harris Sets an Interview With a Not-So-Friendly Outlet: Fox News.  —  The interview, to be conducted by the anchor Bret Baier in Pennsylvania, will air Wednesday at 6 p.m. Eastern.  —  Vice President Kamala Harris has agreed to an interview with Fox News, the network said on Monday.",
    "url": "https://www.nytimes.com/2024/10/14/business/media/fox-news-kamala-harris-interview.html"
  },
  {
    "text": "'That's You': Tim Walz Sounds the Alarm on Trump Threatening to Sic the Military on ‘The Enemy From Within’  —  Vice presidential candidate Tim Walz warned a crowd of supporters that former President Donald Trump was talking about them when denouncing “the enemy from within.”",
    "url": "https://www.mediaite.com/politics/thats-you-tim-walz-sounds-the-alarm-on-trump-threatening-to-sic-the-military-on-the-enemy-from-within/"
  },
  {
    "text": "University town becomes latest stiffed by Trump over campaign rally fees: report  —  Former President Donald Trump has yet again skipped the bill for a campaign rally, leaving the town that hosted it to foot the cost — this time the college town of St. Cloud, Minnesota.",
    "url": "https://www.rawstory.com/msn-uk/trump-st-cloud-fees/"
  },
  {
    "text": "Swastika Flags Flown During Donald Trump Boat Parade in Florida  —  A boat bearing swastika symbols and Donald Trump  —  flags was hosed down after trying to join a Trump boat parade in Jupiter, Florida.  —  The boat was photographed attempting to take part in the parade on Sunday in the",
    "url": "https://www.newsweek.com/swastika-flags-flown-donald-trump-boat-parade-florida-us-presidential-2042-election-1968426"
  },
  {
    "text": "Video captures worker's reaction when former president arrives at McDonald's in Georgia  —  An employee was in for quite the surprise when a president dropped by a McDonald's in Georgia over the weekend, only it wasn't the president she was thinking of.  —  “You Joe?",
    "url": "https://www.usatoday.com/story/news/nation/2024/10/14/bill-clinton-georgia-mcdonalds/75671642007/"
  },
  {
    "text": "Right-Wing Group Dismisses Voter Challenge Lawsuits in Nevada Counties  —  The right-wing organization Citizen Outreach Foundation voluntarily dismissed three lawsuits it filed in Nevada that asked county election officials to process around 30,000 voter challenges weeks before the election.",
    "url": "https://www.democracydocket.com/news-alerts/right-wing-group-files-multiple-voter-challenge-lawsuits-in-nevada-counties/"
  },
  {
    "text": "Breaking: Business efforts to break the NLRB reach the Supreme Court  —  On Monday, a car supplier went to the U.S. Supreme Court, asking the court to block a National Labor Relations Board proceeding against the company from beginning on Tuesday — the highest-profile action yet in a growing effort … ",
    "url": "https://www.lawdork.com/p/nlrb-challenge-scotus-shadow-docket-yapp-usa"
  },
  {
    "text": "Massachusetts town issues cease and desist to resident projecting political signs on town water tower  —  The impending Cease and Desist order will impose a $100 per day fine until the activity stops  —  Join Fox News for access to this content  —  A resident of Hanson … ",
    "url": "https://www.foxnews.com/politics/massachusetts-town-issues-cease-desist-resident-projecting-political-signs-town-water-tower"
  },
  {
    "text": "Trump town hall derailed after medical emergencies in the crowd  —  What was supposed to be a Q&A with supporters was marred by fainting spells.  —  Republican presidential nominee former President Donald Trump gestures at a campaign town hall on Oct. 14, 2024, in Oaks, Pa., as South Dakota Gov. Kristi Noem watches.",
    "url": "https://abcnews.go.com/Politics/trump-town-hall-derailed-after-medical-emergencies-crowd/story?id=114796716"
  },
  {
    "text": "Netanyahu tells U.S. that Israel will strike Iranian military, not nuclear or oil, targets, officials say  —  The signal is being seen in Washington as a sign of restraint after concerns that an Israeli strike on oil or nuclear facilities could trigger a wider war.",
    "url": "https://www.washingtonpost.com/world/2024/10/14/israel-iran-strike-nuclear-oil-military/"
  },
  {
    "text": "Trees and land absorbed almost no CO2 last year.  Is nature's carbon sink failing?  —  The sudden collapse of carbon sinks was not factored into climate models - and could rapidly accelerate global heating  —  The age of extinction is supported by  —  It begins each day at nightfall.",
    "url": "https://www.theguardian.com/environment/2024/oct/14/nature-carbon-sink-collapse-global-heating-models-emissions-targets-evidence-aoe"
  },
  {
    "text": "30% of the cameras in Border Patrol's main surveillance system are broken, memo says  —  “The nationwide issue is having significant impacts on operations,” reads an internal Border Patrol memo obtained by NBC News.  —  Nearly one-third of the cameras in the Border Patrol's primary surveillance system along … ",
    "url": "https://www.nbcnews.com/investigations/30-cameras-border-patrols-main-surveillance-system-are-broken-memo-say-rcna175281"
  }
]