[
  {
    "text": "Disappointment and ‘depression’: Biden's biggest fundraisers watch their advantage vanish  —  Joe Biden's allies are bracing after Donald Trump erased the president's financial edge.  —  Joe Biden's campaign planned to bury Donald Trump in an avalanche of cash.",
    "url": "https://www.politico.com/news/2024/06/23/biden-trump-finances-00164566"
  },
  {
    "text": "Trump tries some debate prep on the campaign trail  —  Over the course of nearly 90 minutes, Trump kept coming back to talking about Thursday's debate in Atlanta.  —  Donald Trump might be eschewing formal preparations for Thursday's debate — but that doesn't mean he isn't thinking about it.",
    "url": "https://www.politico.com/news/2024/06/22/trump-philly-rally-debate-00164578"
  },
  {
    "text": "Republicans urge Trump to avoid 2020 debate pitfalls: 'Don't take the bait'  —  Senate Republicans are urging former President Trump to avoid a repeat of his much-maligned debate performance against President Biden four years ago when the two meet onstage Thursday for a pivotal moment in their rematch.",
    "url": "https://thehill.com/homenews/senate/4733881-republicans-trump-debate/"
  },
  {
    "text": "For Biden and Trump, a Debate Rematch With Even Greater Risks and Rewards  —  The matchup on Thursday will be the earliest presidential debate in American history, and any potential missteps could linger for weeks or months.  —  The debate between President Biden and former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/06/23/us/politics/biden-trump-debate-stakes.html"
  },
  {
    "text": "Donald Trump Proposes Migrant ‘Fight League’ During Bonkers Rally Speech  —  The presumptive GOP presidential nominee touted the dehumanizing idea at a Faith & Freedom Coalition event and at a Pennsylvania rally … Trump hit his usual marks, from attacking migrants and border complaints … ",
    "url": "https://www.rollingstone.com/politics/politics-news/donald-trump-proposes-migrant-fight-league-rally-speech-1235045165/"
  },
  {
    "text": "Trump goes to Tony & Nick's for a cheesesteak, completing a Philly trilogy  —  Official records are wanting, but on a grill-hot Saturday, Donald J. Trump may have become the first presumptive presidential nominee in American history to have purchased cheesesteaks from three different South … ",
    "url": "https://www.inquirer.com/news/donald-trump-tony-and-nicks-cheesesteak-philadelphia-rally-20240622.html"
  },
  {
    "text": "Biden campaign lays out debate week strategy in new memo  —  The Biden campaign is gearing up for more than 1,000 events in the lead-up to Thursday's debate, according to a memo shared first with NBC News.  —  WASHINGTON — The Biden campaign and its allies plan to hold 1,600 events and run … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-campaign-lays-debate-week-strategy-new-memo-rcna158444"
  },
  {
    "text": "Trump floats UFC-style migrant league amid border crisis  —  At the Faith & Freedom Coalition gathering in Washington, D.C., Trump called migrants “tough people” who could beat the country's best fighters.  —  Former President Donald Trump suggested in two speeches Saturday that migrants coming … ",
    "url": "https://www.politico.com/news/2024/06/22/trump-ufc-migrant-league-00164570"
  },
  {
    "text": "Michael Flynn Has Turned His Trump-World Celebrity Into a Family Business … Many of Donald J. Trump's allies have tried to turn political fame into private income.  Few have done it on the scale that Michael T. Flynn has.Sam Hodgson for The New York Times",
    "url": "https://www.nytimes.com/2024/06/23/us/politics/donald-trump-michael-flynn-qanon.html"
  },
  {
    "text": "Netanyahu repeats US arms delay claim, says he complained after months of efforts  —  At weekly cabinet meeting, PM alleges ‘dramatic drop’ in weapons shipments four months ago, expresses hope issue will be solved soon  —  At the start of the weekly cabinet meeting on Sunday … ",
    "url": "https://www.timesofisrael.com/netanyahu-says-he-only-complained-about-us-arms-delay-after-months-of-quiet-efforts/"
  },
  {
    "text": "Conservatives rock race to replace McConnell with hardline push  —  Democrats once nicknamed Mitch McConnell the “Grim Reaper” for killing their bills.  Conservatives say the next Senate GOP leader needs to go further.  —  Senate conservatives have a list of early demands for anyone who wants … ",
    "url": "https://www.politico.com/news/2024/06/23/senate-conservatives-mcconnell-00163944"
  },
  {
    "text": "America's new generation gap: Young voters say they'll inherit a more challenging world.  But will they vote in it?  —  It's actually not all ok, Boomers — at least not in the eyes of America's youngest voters.  —  Many under 30 believe their elders are leaving them a more dangerous world … ",
    "url": "https://www.cbsnews.com/news/poll-2024-election-new-generation-gap-young-voters-06-23-2024/"
  },
  {
    "text": "In Trump we trust: religious right on crusade to make their man president  —  America's evangelicals sense a chance to impose a radical agenda and resist what they see as a tide of liberal secularism  —  God's army is on the march.  And many of its foot soldiers are wearing … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/22/trump-christians-president-religion"
  },
  {
    "text": "Biden DHS docs suggested Trump supporters, military and religious people are likely violent terror threats  —  Internal documents show that the board suggested ‘most of the Domestic Terrorism threat’ in the U.S. comes from Trump supporters  —  Join Fox News for access to this content",
    "url": "https://www.foxnews.com/politics/biden-dhs-docs-suggested-trump-supporters-military-religious-people-likely-violent-terror-threats?intcmp=tw_fnc"
  }
]