[
  {
    "text": "Judge dismisses some charges against Trump in the Georgia 2020 election interference case  —  The judge overseeing the Georgia 2020 election interference case has dismissed some of the charges against ex-President Donald Trump, but others remain  —  The judge overseeing the Georgia 2020 … ",
    "url": "https://apnews.com/article/georgia-election-interference-2020-trump-46e0b68c25719c404130f7e6eab69dcd"
  },
  {
    "text": "Cheney fuels speculation about her next move  —  Speculation is growing about the role former Rep. Liz Cheney (R-Wyo.) will play in the 2024 election as President Biden and former President Trump barrel toward a rematch.  —  Cheney has vowed that she'll do whatever it takes to keep Trump from returning to the White House.",
    "url": "https://thehill.com/homenews/campaign/4526744-cheney-fuels-speculation-about-her-next-move/"
  },
  {
    "text": "Trump demonstrates why ‘Artificial Intelligence’ will be so useful to him  —  It is perfectly fitting that Donald Trump used his social media platform Truth Social to allege that he'd been the target of artificial-intelligence nefariousness.  —  “The Hur Report was revealed today!",
    "url": "https://www.washingtonpost.com/politics/2024/03/13/trump-video-ai-truth-social/"
  },
  {
    "text": "Trump's GOP is already dying  —  For Donald Trump, last week must have seemed like a final, crowning victory over his lingering Republican critics.  On Friday the Republican National Committee made official what Trump had already decreed weeks ago, electing Trump's daughter-in-law, Lara Trump, as party co-chair.",
    "url": "https://thehill.com/opinion/campaign/4528680-trumps-gop-is-already-dying/"
  },
  {
    "text": "Putin Recalls Trump Acting Like Jealous GF in Private  —  According to him, Trump made no attempt to hide his own insecurities about Joe Biden.  —  Russia's Vladimir Putin has revealed an apparently previously unreported conversation with Donald Trump in which he claims the then-American president … ",
    "url": "https://www.thedailybeast.com/putin-recalls-trump-being-jealous-of-sleepy-joe-biden-in-private"
  },
  {
    "text": "Donald Trump Flips Out At Democrats' Mocking Montages With Massive Self-Own … Video",
    "url": "https://www.huffpost.com/entry/donald-trump-supercut-response_n_65f1850fe4b09953f2f84035"
  },
  {
    "text": "Haley Shaved 77K Votes Off Trump's Georgia Win Despite Dropping Out  —  The haul is substantially more than the number of votes by which Trump lost the state in 2020.  —  Donald Trump's overwhelming victory in the Georgia Republican primary Tuesday locked up the 2024 GOP nomination for him … ",
    "url": "https://www.thedailybeast.com/haley-shaved-77k-votes-off-trumps-georgia-primary-win-despite-dropping-out"
  },
  {
    "text": "‘Make the RNC White Again’: GOP Ends Minority Outreach Program  —  With Trump allies taking over the RNC and cleaning house, one of the casualties was a minority outreach program that seemed to be working for Republicans. … After years of accusations of financial mismanagement … ",
    "url": "https://www.thedailybeast.com/make-the-rnc-white-again-gop-ends-minority-outreach-program"
  },
  {
    "text": "Tesla paid no federal income taxes while paying executives $2.5 billion over five years  —  Spoiler: The company actually received $1 million in refunds.  —  In case you need another reason to shout “tax the rich” from the rooftops, it's here, and it's going to make you angry.",
    "url": "https://www.engadget.com/tesla-paid-no-federal-income-taxes-while-paying-executives-25-billion-over-five-years-154529907.html"
  },
  {
    "text": "Man pleads guilty to scheme to create giant sheep hybrids for captive hunting  —  A Montana man pleaded guilty Tuesday to two felony charges connected to an effort to create a giant sheep hybrids for captive hunting, the Justice Department announced.  —  Arthur “Jack” Schubarth, 80 … ",
    "url": "https://thehill.com/homenews/state-watch/4529016-man-pleads-guilty-giant-sheep-hybrids-captive-hunting/"
  },
  {
    "text": "Russians Warned to Flee Border Cities While They Still Can  —  Anti-Putin militants urged citizens to evacuate on Wednesday after launching a military offensive aimed at ending the war in Ukraine.  —  Anti-Kremlin Russian fighters have begun urging their fellow citizens to abandon their homes … ",
    "url": "https://www.thedailybeast.com/pro-kyiv-militants-warn-russians-in-border-cities-to-evacuate"
  },
  {
    "text": "Hunter Biden rebuffs Republicans' invitation to appear for a public hearing  —  Hunter Biden on Wednesday rejected an invitation from House Republicans to appear for a public hearing next week alongside former business associates, an inquiry his attorney dismissed as a “carnival side show.”",
    "url": "https://apnews.com/article/hunter-biden-hearing-congress-house-republicans-impeachment-7110f5808edf570a63d880e2cad8feb7"
  },
  {
    "text": "Say gay, Florida  —  This week, the State of Florida agreed to settle a lawsuit challenging the constitutionality of the Parental Rights in Education Act, better known as the “Don't Say Gay” law.  The bill's text prohibited “classroom instruction by school personnel or third parties … ",
    "url": "https://popular.info/p/update-say-gay-florida"
  },
  {
    "text": "Family Dollar and Dollar Tree will close 1,000 stores  —  New York CNN  —  Family Dollar, the struggling discount chain that caters to low-income customers predominantly in cities, said Wednesday it will close nearly 1,000 stores.  —  Years of mismanagement and poor conditions in stores have hurt Family Dollar's brand.",
    "url": "https://www.cnn.com/2024/03/13/investing/family-dollar-dollar-tree-closing-stores/"
  },
  {
    "text": "A small city in Oklahoma elected a white nationalist.  Will it be able to vote him out?  —  Judd Blevins, a city commissioner in Enid, Oklahoma, marched in the 2017 white nationalist Unite the Right rally.  Now he faces a recall vote.  —  ENID, Okla. — The photo of Judd Blevins was unmistakable.",
    "url": "https://www.nbcnews.com/news/us-news/oklahoma-recall-vote-judd-blevins-enid-city-council-rcna143041"
  },
  {
    "text": "Chubb CEO defends backing Trump appeal bond in E. Jean Carroll case  — The CEO of the Chubb insurance company defended a subsidiary providing former President Donald Trump with a $91.6 million appeals bond in the case where he was found liable for defaming E. Jean Carroll after she accused him of rape.",
    "url": "https://www.cnbc.com/2024/03/13/chubb-ceo-defends-backing-trump-appeal-bond-in-e-jean-carroll-case.html"
  },
  {
    "text": "On popular online platforms, predatory groups coerce children into self-harm  —  Vulnerable teens are blackmailed into degrading and violent acts by abusers who then boast about it  —  Editor's note: This story describes extremely disturbing events that may be upsetting for some people.",
    "url": "https://www.washingtonpost.com/investigations/interactive/2024/764-predator-discord-telegram/"
  },
  {
    "text": "LGBTQ+ Identification in U.S. Now at 7.6%  —  More than one in five Gen Z adults identify as LGBTQ+  —  WASHINGTON, D.C. — LGBTQ+ identification in the U.S. continues to grow, with 7.6% of U.S. adults now identifying as lesbian, gay, bisexual, transgender, queer or some other sexual orientation besides heterosexual.",
    "url": "https://news.gallup.com/poll/611864/lgbtq-identification.aspx"
  },
  {
    "text": "Democrats plead with Johnson to put Ukraine bill on floor: ‘Lead, follow or get out of the way’  —  A bicameral group of Democrats pleaded to House Speaker Mike Johnson (R-La.) to put the Senate's foreign aid bill, which includes Ukraine aid, to a floor vote, emphasizing that the war-torn … ",
    "url": "https://thehill.com/homenews/house/4529438-democrats-pressure-johnson-ukraine-floor-vote/"
  },
  {
    "text": "TikTok Will Use Every Legal Tool to Fight a Forced Sale … A sale of the viral video app is considered to be the last resort for ByteDance, said the people, who asked not to be identified discussing private matters.  A divestiture would also require approval by the Chinese government … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-12/tiktok-plans-full-legal-fight-if-us-divestment-bill-becomes-law"
  }
]