[
  {
    "text": "The White House Announces White House Ballroom Construction to Begin  —  Washington, D.C. — For 150 years, Presidents, Administrations, and White House Staff have longed for a large event space on the White House complex that can hold substantially more guests than currently allowed.",
    "url": "https://www.whitehouse.gov/briefings-statements/2025/07/the-white-house-announces-white-house-ballroom-construction-to-begin/"
  },
  {
    "text": "White House Unveils Plan for $200 Million Ballroom, Trump's Long-Sought Imprint  —  Officials said a 90,000-square-foot addition to the East Wing would be paid for by President Trump and other donors.  —  First came the gold décor in the Oval Office.",
    "url": "https://www.nytimes.com/2025/07/31/us/politics/white-house-ballroom-trump.html"
  },
  {
    "text": "Smithsonian removes Trump from impeachment exhibit in American History Museum  —  The Smithsonian said it restored the display to an earlier version, which notes that “only three presidents have seriously faced removal.”  —  The Smithsonian's National Museum of American History … ",
    "url": "https://www.washingtonpost.com/entertainment/2025/07/31/trump-impeachment-smithsonian/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzOTM0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MzE2Nzk5LCJpYXQiOjE3NTM5MzQ0MDAsImp0aSI6ImJkMDI5M2FmLTMzZDUtNDNiMC04YmVmLTk2Yzg5MzI0NzRhOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbnRlcnRhaW5tZW50LzIwMjUvMDcvMzEvdHJ1bXAtaW1wZWFjaG1lbnQtc21pdGhzb25pYW4vIn0.1O5MNBId47-CbznOfSi8hUNcZQNH2D6qeoyIhEyBlLU&itid=gfta"
  },
  {
    "text": "Alan Dershowitz Takes on His Greatest Challenge Yet: A Farmers' Market  —  It was an unusually warm day on Martha's Vineyard on Wednesday, and Alan Dershowitz just wanted to enjoy some hot dumplings.  —  As he tells it, Dershowitz, the 86-year-old attorney for some of America's … ",
    "url": "https://nymag.com/intelligencer/article/alan-dershowitz-lawsuit-farmers-market-over-pierogi-denial.html"
  },
  {
    "text": "Trump's tariffs get frosty reception at federal appeals court … Judge Timothy Dyk, a Clinton appointee, said “it was hard for me to see” that Congress intended to give the president the authority to essentially rewrite the entire U.S. code when it passed the legislation.",
    "url": "https://www.politico.com/news/2025/07/31/trump-tariff-arguments-appeals-court-00486972"
  },
  {
    "text": "Axelrod: Harris ‘setting herself up’ for 2028 presidential run  —  Democratic strategist David Axelrod on Wednesday said former Vice President Kamala Harris appears to be preparing for another White House bid after last year's November loss, following her announcement that she will not run for California governor.",
    "url": "https://thehill.com/homenews/campaign/5430397-axelrod-says-harris-setting-up-run/"
  },
  {
    "text": "‘Welcome to hell’: Inside the megaprison where the U.S. deported migrants  —  Interviews with 16 former detainees of El Salvador's Terrorism Confinement Center offer the most complete view yet of conditions at the notorious prison.  —  One detainee was beaten unconscious.",
    "url": "https://www.washingtonpost.com/world/2025/07/31/venezuelans-deported-us-el-salvador-prison-cecot/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzOTM0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MzE2Nzk5LCJpYXQiOjE3NTM5MzQ0MDAsImp0aSI6IjQ0N2MyMTkyLWJjMWQtNDYxNy1iMjIwLTRlMGFkZjNhZmFiMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzA3LzMxL3ZlbmV6dWVsYW5zLWRlcG9ydGVkLXVzLWVsLXNhbHZhZG9yLXByaXNvbi1jZWNvdC8ifQ.Ka8mxc83STdLVgtmR8PWu1docguJWA2Aqq78hBgn_VQ&itid=gfta"
  },
  {
    "text": "Read the documents that prove Hillary Clinton OK'd plan to ‘smear’ Trump with Russia collusion  —  WASHINGTON — Hillary Clinton signed off on a plan hatched by a top campaign adviser to “smear” then-candidate Donald Trump with false claims of Russian collusion and distract … ",
    "url": "https://nypost.com/2025/07/31/us-news/hillary-clinton-approved-plan-hatched-by-campaign-aides-to-smear-trump-with-russia-collusion-declassified-docs/"
  },
  {
    "text": "Gavin Newsom floats November special election for his anti-Trump redistricting push … It would be an enormously expensive and politically perilous campaign.  Newsom would be counting on Democrats' anti-Trump message overcoming voters' reluctance to return power to politicians for an explicitly partisan exercise.",
    "url": "https://www.politico.com/news/2025/07/31/gavin-newsom-november-special-election-redistricting-00487541"
  },
  {
    "text": "Trump raises tariffs on Canada to 35 percent  —  President Trump announced Thursday that the U.S. would raise tariffs on certain Canadian goods from 25 percent to 35 percent beginning Friday.  —  Goods that are covered under the 2020 United States-Mexico-Canada Agreement will be exempt from the tariff rate, the White House said.",
    "url": "https://thehill.com/homenews/administration/5431181-trump-raises-tariffs-on-canada-to-35-percent/"
  },
  {
    "text": "Further Modifying the Reciprocal Tariff Rates  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including the International Emergency Economic Powers Act (50 U.S.C. 1701 et seq.)  (IEEPA), the National Emergencies Act … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/07/further-modifying-the-reciprocal-tariff-rates/"
  },
  {
    "text": "Virginia Giuffre's Family Was Shocked That Trump Described Her as ‘Stolen’  —  The siblings of one of Jeffrey Epstein's most prominent accusers wonder what the president knows.  —  When Donald Trump told reporters yesterday that Jeffrey Epstein “stole” a young woman named Virginia Roberts Giuffre … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/07/jeffrey-epstein-accuser-trump/683717/?gift=49wmX9XxesaxFXKJmFp0Ph0W1IIyJ9aKDZC0HeQhIYI&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump plans to revive the Presidential Fitness Test for American schoolchildren  —  President Donald Trump on Thursday plans to reestablish the Presidential Fitness Test for American schoolchildren, a program created in 1966 to help interest young people in following healthy, active lifestyles.",
    "url": "https://apnews.com/article/trump-presidential-fitness-test-schoolchildren-1e0b667df467f767df1cd1388ea29f1c"
  },
  {
    "text": "Justice Brett Kavanaugh is probably reading this … Kavanaugh also made clear he closely follows press coverage, podcasts and social media posts about the Supreme Court, what he described as “an ocean of criticism and critiques out there.”  —  “I'm aware of it.  I definitely pay attention to it.",
    "url": "https://www.politico.com/news/2025/07/31/brett-kavanaugh-supreme-court-00487536"
  },
  {
    "text": "Unnoticed Whistle-Blower Document Alarms Justice Department Veterans  —  A complaint concerning a top Justice Department official, Emil Bove III, went unnoticed for more than two months, raising worries that an internal watchdog has gone dormant.  —  The Justice Department's internal watchdog lost … ",
    "url": "https://www.nytimes.com/2025/07/31/us/politics/emil-bove-whistle-blower.html?unlocked_article_code=1.ak8.O-yj.dNlaN1BhnnNm&smid=url-share"
  },
  {
    "text": "Trump's war on Big Law leads firms to retreat from ‘pro bono’ work for underdogs  —  Interviews with over 60 lawyers and 30 nonprofits show legal aid groups now have fewer resources to defend the vulnerable.  —  When the Texas Civil Rights Project needed lawyers to help dozens … ",
    "url": "https://www.reuters.com/investigations/trumps-war-big-law-leads-firms-retreat-pro-bono-work-underdogs-2025-07-31/"
  },
  {
    "text": "Senators Could Vote Imminently to Remove Their Homes, Travel Info From Internet  —  Watchdogs argue the legislation would block reporters from doing their jobs and limit efforts to hold lawmakers accountable  —  Senators could vote on a bill as soon as Thursday to allow members of Congress … ",
    "url": "https://www.rollingstone.com/politics/politics-features/senators-homes-travel-info-remove-internet-1235397818/"
  },
  {
    "text": "Blue-state Democrats want immigration agents to show their faces … “People wearing ski masks are grabbing people, throwing them into unmarked cars and sending them to Alligator Alcatraz or El Salvador or Libya,” said California state Sen. Scott Wiener, who authored a bill to ban certain kinds of face coverings for law enforcement.",
    "url": "https://www.politico.com/news/2025/07/31/blue-state-democrats-want-immigration-agents-to-show-their-faces-00487490"
  },
  {
    "text": "“We'll Smash the Fucking Window Out and Drag Him Out”  —  This story contains videos and descriptions of violent arrests.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.",
    "url": "https://projects.propublica.org/trump-ice-smashed-windows-deportation-arrests/"
  },
  {
    "text": "Elon Musk gives millions to Republican super PACs ahead of the midterms  —  He's still directing big money to the GOP despite an acrimonious departure from the White House.  He also poured tens of millions into his own super PAC.  —  Billionaire Elon Musk may be gone from President Donald … ",
    "url": "https://www.nbcnews.com/politics/2026-election/elon-musk-gives-millions-republican-super-pacs-ahead-midterms-rcna222114"
  },
  {
    "text": "Scoop: Top Biden aide was promised $8 million for 2024 win  —  Former President Biden's top political aide Mike Donilon told congressional investigators Thursday that he was paid $4 million for his work on Biden's 2024 re-election campaign and would have made an additional $4 million if Biden had won … ",
    "url": "https://www.axios.com/2025/07/31/donilon-biden-2024-reelection-testimony-congress"
  },
  {
    "text": "Fox News since Monday: 85 minutes talking about Sydney Sweeney, 3 minutes talking about Epstein  —  RESEARCH CONTRIBUTIONS FROM TYLER MONROE & SAGE HODIL … Fox's focus on Sweeney over Epstein is a notable departure from the stories that other cable news networks have found to be newsworthy this week … ",
    "url": "https://www.mediamatters.org/fox-news/fox-news-monday-85-minutes-talking-about-sydney-sweeney-3-minutes-talking-about-epstein"
  },
  {
    "text": "How Epstein and Maxwell Used Trump's Fame to Groom 13-Year-Old Girl  —  USERS AND ABUSERS  —  “Jane” revealed how the pair used Trump's name and a meeting with him as part of their twisted plan.  —  The first victim to testify in Ghislaine Maxwell's 2021 sex trafficking trial told the jury … ",
    "url": "https://www.thedailybeast.com/how-epstein-and-maxwell-used-trumps-fame-to-groom-13-year-old-girl/"
  },
  {
    "text": "The Columbia deal with Trump is a blueprint.  All of higher ed should fear what comes next.  —  One by one, elite universities are signing away some of their autonomy to the Trump administration after it has accused them of civil rights violations and withheld federal funding.",
    "url": "https://www.vox.com/politics/421954/columbia-brown-harvard-trump-settlement-antisemitism"
  },
  {
    "text": "Republicans Put Conspiracy Theorist With Far-Right Ties In Top Counterterrorism Job  —  Joe Kent has pushed white nationalist views and fanned conspiracies about the 2020 election being “stolen” and the FBI planning the Jan. 6 insurrection.  —  WASHINGTON ― You can't make it up, folks.",
    "url": "https://www.huffpost.com/entry/joe-kent-conspiracy-theorist-white-nationalist-counterterrorism-job_n_688b744ce4b0f5c3b7c98b53"
  },
  {
    "text": "Trump regulatory czar Jeffrey Clark should be disbarred for role in 2020 election plot, disciplinary board rules … “The fight continues,” Clark said in a series of posts on X, shortly after the decision.  —  The D.C. Bar's Board of Professional Responsibility said its ruling was based … ",
    "url": "https://www.politico.com/news/2025/07/31/jeffrey-clark-disbarred-recommendation-00487257"
  },
  {
    "text": "The Fact Checker rose in an era of false claims.  Falsehoods are now winning.  —  Longtime Fact Checker Glenn Kessler takes stock as he departs The Washington Post.  —  Just now  —  When 400 fact-checkers from around the world gathered in Rio de Janeiro in June for an annual conference, the mood was tense.",
    "url": "https://www.washingtonpost.com/politics/2025/07/31/fact-checker-falsehoods-glenn-kessler/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzOTM0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MzE2Nzk5LCJpYXQiOjE3NTM5MzQ0MDAsImp0aSI6IjBhZGRhNDg2LTM1YjYtNDlkYi1iNGU0LWQzOTMyYjRkMzU0OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA3LzMxL2ZhY3QtY2hlY2tlci1mYWxzZWhvb2RzLWdsZW5uLWtlc3NsZXIvIn0.vDQgrEHBLBN4_MBFZdTgJdnzCZnpdPMSTsuo8QGVQfg&itid=gfta"
  },
  {
    "text": "Ms. Rachel grew up on Mister Rogers.  Now she's carrying on his legacy. … NEW YORK  —  Many years ago, in a gray wooden house in Maine, there was a little girl who loved to curl up on the living room couch and watch “Mister Rogers' Neighborhood.”  When each episode wound down … ",
    "url": "https://www.washingtonpost.com/parenting/interactive/2025/ms-rachel-childrens-media/"
  },
  {
    "text": "Washington Post talent exodus fuels speculation about its future  —  Dozens of journalists are taking buyouts and calling it quits at the Washington Post, fueling speculation about how the storied paper can survive while bleeding so much talent. … - CEO Will Lewis earlier this month encouraged staffers … ",
    "url": "https://www.axios.com/2025/07/31/washington-post-talent-exodus"
  },
  {
    "text": "Sanctioning Officials of the Palestinian Authority and Members of the Palestine Liberation Organization  —  The State Department has reported to Congress that the Palestine Liberation Organization (PLO) and Palestinian Authority (PA) are not in compliance with their commitments under … ",
    "url": "https://www.state.gov/releases/office-of-the-spokesperson/2025/07/sanctioning-officials-of-the-palestinian-authority-and-members-of-the-palestine-liberation-organization/"
  },
  {
    "text": "Jess Glynne calls White House deportation video with Jet2 song ‘sick’  — Jess Glynne criticises White House for using a meme featuring her song in a post about deportation  — Parodies of Jet2 adverts including Glynne's 2015 hit Hold My Hand have gone viral on TikTok",
    "url": "https://www.bbc.com/news/articles/clyjggjplyqo"
  }
]