[
  {
    "text": "Inside One ‘Egregious’ Mistake From Trump's Florida Judge Aileen Cannon  —  Judge Aileen Cannon barely has any courtroom experience, but in her limited time on the bench she appears to have flouted hundreds of years of legal tradition—just because. … U.S. District Judge Aileen Cannon … ",
    "url": "https://www.thedailybeast.com/inside-one-egregious-mistake-from-trumps-florida-judge-aileen-cannon"
  },
  {
    "text": "Judge in Trump Jan. 6 case agrees to limit release of “sensitive” material  —  Washington — The federal judge overseeing the case against former President Donald Trump related to the 2020 presidential election said she would accept a proposed protective order put forth by the former president's lawyers … ",
    "url": "https://www.cbsnews.com/news/trump-protective-order-january-6-case-judge-hearing/"
  },
  {
    "text": "Biden attorneys are in talks with special counsel Robert Hur over terms to interview the president  —  Attorney General Merrick Garland appointed Hur to investigate Biden's handling of classified documents after his term as vice president ended.  —  WASHINGTON — Attorneys for President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-attorneys-negotiating-special-counsel-interview-terms-rcna99360"
  },
  {
    "text": "Sen. Joe Manchin to skip a big White House event as he considers running against Biden  —  Manchin recently had dinner with one of Biden's top aides in an attempt by the White House to ensure the president is not caught off guard when the senator breaks with him.",
    "url": "https://www.nbcnews.com/politics/joe-biden/joe-manchin-skip-white-house-event-considers-2024-bid-biden-rcna99200"
  },
  {
    "text": "'They're Going to Shoot Someone:' Michigan Republicans Warn of Civil War at Pool Party Fundraiser for Fake Electors  —  An audio recording obtained by The Messenger highlights just how dire the Republicans charged in the 2020 election scheme - and the people around them - see their fight",
    "url": "https://themessenger.com/politics/michigan-republicans-fake-electors-civil-war-dana-nessel-matt-maddock"
  },
  {
    "text": "How Are Iowa Democrats?  'I Can't Even Describe to You How Bad It Is.'  —  As Republican presidential candidates flock to the state, Democrats there are despondent, exhausted by repeated defeats and the loss of their first-in-the-nation nominating contest.  —  Not long ago, Iowa was the center of the Democratic political universe.",
    "url": "https://www.nytimes.com/2023/08/11/us/politics/democrats-iowa-state-fair.html"
  },
  {
    "text": "Ohio's rejection of Issue 1 shows how toxic abortion has become for the GOP  —  Turns out even folks in red and purple states don't like to have their rights taken away.  —  ∙ Paid … By Noah Berlatsky  —  For decades, the right argued that Roe v. Wade was an assault on democracy … ",
    "url": "https://www.publicnotice.co/p/issue-1-rejected-ohio-abortion-restrictions-gop"
  },
  {
    "text": "Former Trump fixer and lawyer Michael Cohen considering run for New York House seat  —  Cohen is eyeing a run for Jerry Nadler's affluent Manhattan district.  —  Michael Cohen, one of Donald Trump's most prominent former lawyers and now critic who spent more than a year in jail … ",
    "url": "https://www.politico.com/news/2023/08/11/michael-cohen-trump-lawyer-new-york-house-seat-00110832"
  },
  {
    "text": "DeSantis greeted by ‘pudding fingers’ chant in Iowa  —  The protest effectively cut short the Florida governor's first campaign stop of the day.  —  MENLO, Iowa — It was an inauspicious start for Ron DeSantis in Iowa on Friday.  —  Chanting “Ron DeFascist” and “pudding fingers” … ",
    "url": "https://www.politico.com/news/2023/08/11/desantis-iowa-pudding-fingers-chant-00110860"
  },
  {
    "text": "Trump could face “big picture” RICO case in Georgia, expert says  —  If former President Donald Trump is indicted in Georgia, some believe he may face felony counts unlike any of the 78 charges already filed against him.  Fulton County District Attorney Fani Willis could pursue Trump under … ",
    "url": "https://www.cbsnews.com/news/trump-rico-case-georgia-expert-says/"
  },
  {
    "text": "Veteran Sam Brown slams Biden admin's request for additional Ukraine funding: ‘No more blank checks’  —  Brown, a Republican Senate candidate in Nevada, vowed to hold the Biden administration's ‘feet to the fire’ on the issue if elected  —  FIRST ON FOX: Former U.S. Army Capt. Sam Brown … ",
    "url": "https://www.foxnews.com/politics/veteran-sam-brown-slams-biden-admins-request-additional-ukraine-funding-no-blank-checks"
  },
  {
    "text": "Spiraling Legal Bills Threaten Trump With a Cash Crunch  —  The former president's political orbit, including the super PAC that backs him, is already spending more than it is taking in — an unusual trajectory this far out from an election.  —  Donald J. Trump's legal problems aren't just piling up — his legal bills are, too.",
    "url": "https://www.nytimes.com/2023/08/11/us/politics/donald-trump-legal-bills-campaign.html"
  },
  {
    "text": "Illinois Supreme Court finds assault weapons ban constitutional  —  The ban was passed after the Highland Park mass shooting.  —  The Illinois State Supreme Court found a strict assault weapons ban passed after the Highland Park shooting to be constitutional in a ruling issued Friday.",
    "url": "https://abcnews.go.com/US/illinois-supreme-court-finds-assault-weapons-ban-constitutional/story?id=102198069"
  },
  {
    "text": "The Sweep and Force of Section Three  —  University of Pennsylvania Law Review, Vol. 172, 2024  —  University of Chicago - Law School University of St. Thomas School of Law  —  Abstract  —  Section Three of the Fourteenth Amendment forbids holding office by former office holders who then participate in insurrection or rebellion.",
    "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4532751"
  },
  {
    "text": "‘Unprecedented, stunning, disgusting’: Clarence Thomas condemned over billionaire gifts  —  Calls for the supreme court justice to resign grow as new details of 38 more undeclared gifts and vacations from rich donors emerge  —  Conservative US supreme court justice Clarence Thomas … ",
    "url": "https://www.theguardian.com/us-news/2023/aug/11/clarence-thomas-undeclared-vacations-gifts-rightwing-donors"
  },
  {
    "text": "Suarez expresses concern he's being left off GOP primary surveys  —  Miami Mayor Francis Suarez, a 2024 Republican presidential contender, said on Friday he was concerned that pollsters are leaving him out of surveys — making it harder for him to participate in the first GOP debate.",
    "url": "https://thehill.com/homenews/campaign/4149002-suarez-expresses-concern-hes-being-left-off-gop-primary-surveys/"
  },
  {
    "text": "Liberals rage over photo of Woody Harrelson sporting RFK Jr hat: ‘Dead to me’  —  Liberals on X, formerly known as Twitter, expressed anger and disdain after a photo of actor Woody Harrelson wearing a hat displaying support for Democratic presidential candidate Robert F. Kennedy, Jr. appeared online.",
    "url": "https://www.foxnews.com/media/liberals-rage-photo-woody-harrelson-sporting-rfk-jr-hat-dead-me"
  },
  {
    "text": "Attorney General Garland appoints a special counsel in Hunter Biden probe  —  U.S. Attorney David Weiss will be appointed special counsel in the ongoing probe of the president's son Hunter Biden.  —  WASHINGTON — U.S. Attorney David Weiss will be appointed special counsel in the ongoing probe … ",
    "url": "https://www.nbcnews.com/politics/justice-department/attorney-general-garland-appoints-special-counsel-hunter-biden-probe-rcna99447"
  },
  {
    "text": "Recordings show Va. swing district candidate favors ‘total ban’ on abortion  —  RICHMOND — John Stirrup has been playing up crime, taxes and other bread-and-butter issues while running for the House of Delegates in a purple Northern Virginia district, but the Republican didn't mince words … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/10/abortion-ban-virginia-elections-stirrup/"
  }
]