[
  {
    "text": "‘The elephant in the room’: NBC's McDaniel hiring sparks on-air criticism from one of its own  —  Chuck Todd, the former host of “Meet The Press,” launched an explosive attack on his own network during a live panel discussion.  —  Ronna McDaniel may have secured a gig as a political contributor … ",
    "url": "https://www.politico.com/news/2024/03/24/ronna-mcdaniel-roils-nbc-i-think-our-bosses-owe-you-an-apology-00148719"
  },
  {
    "text": "Chuck Todd calls out NBC News for hiring former RNC Chair Ronna McDaniel  —  Veteran NBC anchor Chuck Todd criticized his network's leadership Sunday for hiring former Republican National Committee (RNC) Chair Ronna McDaniel as a contributor just days after she stepped down from the organization.",
    "url": "https://thehill.com/homenews/media/4552592-chuck-todd-calls-out-nbc-news-hiring-of-former-rnc-chair-ronna-mcdaniel/"
  },
  {
    "text": "Former RNC chair Ronna McDaniel faces sharp criticism after NBC hiring  —  The NBC show where McDaniel was interviewed featured other journalists saying her hiring raised credibility issues for NBC.  Chuck Todd said, “I have no idea whether any answer she gave ... was because she didn't want to mess up her contract.”",
    "url": "https://www.washingtonpost.com/politics/2024/03/24/ronna-mcdaniel-nbc-meet-the-press/"
  },
  {
    "text": "Tammy Murphy will drop out of U.S. Senate race  —  Kim will run on lines that had gone to Murphy  —  Tammy Murphy will announce today that she is dropping out of the race for United States Senate, abruptly ending her campaign after four months, the New Jersey Globe has confirmed.",
    "url": "https://newjerseyglobe.com/congress/tammy-murphy-will-drop-out-of-u-s-senate-race/"
  },
  {
    "text": "NJ first lady Tammy Murphy to end Senate campaign to replace Bob Menendez  —  Murphy is expected to release a video Sunday announcing her decision.  —  New Jersey first lady Tammy Murphy plans to end her Senate campaign to replace Bob Menendez, according to a source with knowledge of her decision.",
    "url": "https://www.politico.com/news/2024/03/24/nj-first-lady-tammy-murphy-to-end-senate-campaign-to-replace-bob-menendez-00148728"
  },
  {
    "text": "Tammy Murphy drops out of New Jersey Senate primary  —  Tammy Murphy, the wife of Gov. Phil Murphy (D-N.J.), ended her primary campaign for Senate on Sunday.  —  The announcement abruptly ends a highly anticipated Senate bid which launched with high expectations, and leaves Rep. Andy Kim … ",
    "url": "https://thehill.com/homenews/campaign/4552863-tammy-murphy-drops-out-of-new-jersey-senate-primary/"
  },
  {
    "text": "Lisa Murkowski, done with Donald Trump, won't rule out leaving GOP  —  Hear more on Sen. Lisa Murkowski's plans on “Inside Politics Sunday with Manu Raju” at 8 a.m. ET and 11 a.m. ET.﻿  —  Sen. Lisa Murkowski, aghast at Donald Trump's candidacy and the direction of her party, won't rule out bolting from the GOP.",
    "url": "https://www.cnn.com/2024/03/24/politics/lisa-murkowski-done-with-trump/"
  },
  {
    "text": "Biden Is Building a ‘Superstructure’ to Stop Trump From Stealing the Election  —  Trump and his MAGA allies have been working for years to pre-rig the 2024 election.  Here's how Team Biden is planning to fight them … Long before Trump began leading in battleground-state polling … ",
    "url": "https://www.rollingstone.com/politics/politics-features/biden-trump-stop-steal-election-2024-1234993149/"
  },
  {
    "text": "The ghost of Russia's past wars comes back to haunt Moscow  —  Gunmen in an entertainment venue.  Bodies lying on the cold concrete.  Horror that such murder could strike the safety of the Moscow bubble.  —  These were all present in the horrific aftermath of Friday night's savage attack … ",
    "url": "https://www.cnn.com/2024/03/23/europe/moscow-concert-hall-attack-analysis-intl-cmd/"
  },
  {
    "text": "Trump asked if U.S. was better off in his last year.  In many ways, the answer is no.  —  A look at the third week of March 2020 reveals a nation that was plunging into a pandemic, and a leader exhibiting the erratic characteristics that his supporters love and his detractors revile",
    "url": "https://www.washingtonpost.com/politics/2024/03/24/trump-2020-better-off-covid/"
  },
  {
    "text": "Oath Keepers' son emerges from traumatic childhood to tell his own story in a long shot election bid  —  The eldest son of one of America's most infamous seditionists is building a new life since breaking free from his father's control — juggling work, college classes and volunteer firefighting.",
    "url": "https://apnews.com/article/oath-keepers-stewart-rhodes-dakota-adams-montana-e0b46f25dfe319afe29617fd7325eb10"
  },
  {
    "text": "Kamala Harris claps to Puerto Rico protest song, stops once aide translates what they're actually singing  —  A San Juan band called out Vice President Kamala Harris on Palestine, Haiti  —  Vice President Kamala Harris was captured on camera clapping to a Puerto Rican protest song during … ",
    "url": "https://www.foxnews.com/politics/kamala-harris-claps-puerto-rico-protest-song-stops-once-aide-translates-actually-singing"
  },
  {
    "text": "Harris says US has not ruled out ‘consequences’ if Israel invades Rafah  —  “There's nowhere for those folks to go,” the vice president tells ABC.  —  In a wide-ranging new interview with ABC News, Vice President Kamala Harris suggested there could be “consequences” for Israel if it moves ahead … ",
    "url": "https://abcnews.go.com/Politics/harris-us-ruled-consequences-israel-invades-rafah/story?id=108431225"
  },
  {
    "text": "GOP senator: Lack of power on spending ‘exasperating’  —  Republican Sen. Shelley Moore Capito (R-W.Va.) on Sunday expressed frustrations with the way the latest funding package was handled by Congressional leaders, claiming it is “exasperating” to lack GOP leverage in the Senate and White House.",
    "url": "https://thehill.com/homenews/senate/4552681-gop-senator-lack-of-power-on-spending-exasperating/"
  }
]