[
  {
    "text": "Judge in Trump Documents Case Rejected Suggestions to Step Aside  —  Two federal judges in South Florida privately urged Aileen M. Cannon to decline the case when it was assigned to her last year, according to two people briefed on the matter.  She chose to keep it.",
    "url": "https://www.nytimes.com/2024/06/20/us/politics/aileen-cannon-trump-classified-documents.html"
  },
  {
    "text": "June 2024 State Polls: Trump Maintains Edge over Biden  —  Democratic US Senate Candidates Outperforming Biden  —  New Emerson College Polling/The Hill state polls find former President Donald Trump with a slight edge on President Joe Biden in Arizona (47% to 43%), Georgia (45% to 41%) … ",
    "url": "https://emersoncollegepolling.com/june-2024-state-polls-trump-maintains-edge-over-biden/"
  },
  {
    "text": "Fox News Poll: Three-point shift in Biden-Trump matchup since May  —  32% give the economy positive marks, a record-high during Biden's presidency  —  Join Fox News for access to this content  —  President Biden is the frontrunner in a hypothetical matchup against former President Trump … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-three-point-shift-biden-trump-matchup-since-may"
  },
  {
    "text": "Donald Trump Hit by Devastating Poll From Fox News  —  2024 presidential poll for the first time since late last year.  —  A survey of 1,095 registered voters from the conservative news network showed that Biden is leading his presumptive  —  rival by two points (50 percent to 48 percent).",
    "url": "https://www.newsweek.com/donald-trump-devastating-poll-fox-news-joe-biden-election-economy-1915063"
  },
  {
    "text": "Trump gets the final word at CNN debate after coin flip  —  Former President Donald Trump will get the final word when he debates President Joe Biden on CNN next week, after a coin flip to determine podium placement and the order of closing statements.  —  The coin landed on the Biden campaign's pick … ",
    "url": "https://www.cnn.com/2024/06/20/politics/cnn-debate-closing-statements-podiums/"
  },
  {
    "text": "CNN debate stage set with Trump and Biden going head-to-head  —  President Joe Biden and former President Donald Trump are set for a historic showdown, with the stage now set for CNN's June 27 presidential debate.  —  The showdown will make history as the first debate between a sitting president and a former president.",
    "url": "https://www.cnn.com/2024/06/20/politics/cnn-debate-trump-biden/"
  },
  {
    "text": "FBI raids Oakland Mayor Sheng Thao's home, several other locations: source  —  Oakland Mayor Sheng Thao's home was among four locations raided by the FBI Thursday morning, a source told ABC7 News.  —  OAKLAND, Calif. (KGO) — A home associated with Oakland Mayor Sheng Thao … ",
    "url": "https://abc7news.com/post/fbi-raided-oakland-mayor-sheng-thaos-home-sources/14980538/"
  },
  {
    "text": "FBI raids home of Oakland Mayor Sheng Thao  —  Federal agents raided the home of Oakland Mayor Sheng Thao early Thursday morning in a probe that included searches of three properties connected to a politically influential family that runs the city's curbside recycling program.",
    "url": "https://www.sfchronicle.com/crime/article/fbi-raids-home-of-oakland-mayor-sheng-thao-19523532.php"
  },
  {
    "text": "Top Florida law enforcement official sues DeSantis, alleging he was fired for blowing the whistle  —  The official says he warned of issues over migrants and public records.  —  Florida Gov. Ron DeSantis speaks at press conference at the Hollywood Fire Rescue Station 5, on June 14, 2024.",
    "url": "https://abcnews.go.com/US/top-florida-law-enforcement-official-sues-desantis-alleging/story?id=111258138"
  },
  {
    "text": "The Supreme Court upholds a tax on foreign income over a challenge backed by business interests  —  The Supreme Court on Thursday upheld a tax on foreign income over a challenge backed by business and anti-regulatory interests, declining their invitation to weigh in on a broader, never-enacted tax on wealth.",
    "url": "https://apnews.com/article/supreme-court-wealth-tax-5a13417bd5ae41f7d150ac596f7c51d0"
  },
  {
    "text": "Fox News is helping Trump plan another Jan. 6-style assault on democracy  —  Five months before the election, claims that only fraud could explain a future Trump defeat are already common in the right-wing media ecosystem.  —  The cycle of lies that drove the Jan. 6, 2021, insurrection is again underway.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/fox-news-trump-election-2024-disinformation-rcna157770"
  },
  {
    "text": "Senate Democrats launch investigation into Jared Kushner's business … - This included a $2 billion commitment from Saudi Arabia's Public Investment Fund, even though PIF staff reportedly raised red flags. … - So far Affinity has invested in at least eight companies … ",
    "url": "https://www.axios.com/2024/06/20/jared-kushner-senate-democrats-investigation"
  },
  {
    "text": "Mark Kelly and Gabby Giffords on Their IVF Journey: ‘Freedom to Start a Family Is Under Threat’ (Exclusive)  —  In an exclusive essay for PEOPLE, the married Arizona lawmakers share how a gunman stole their dreams of having a child together — and why they fear politicians will do the same to other families",
    "url": "https://people.com/mark-kelly-gabby-giffords-ivf-reproductive-freedom-exclusive-essay-8664641"
  },
  {
    "text": "Illinois Republican Chair Resigns, Slams Colleagues Weeks Before Convention  —  Party Chair Don Tracy is resigning from his political post, and has condemned colleagues for choosing to fight each other rather than the  —  , in a letter explaining his decision.",
    "url": "https://www.newsweek.com/illinois-republican-chair-resigns-slams-colleagues-weeks-before-convention-1915090"
  },
  {
    "text": "Is Wikipedia Politically Biased?  —  Executive Summary  — This work aims to determine whether there is evidence of political bias in English-language Wikipedia articles.  — Wikipedia is one of the most popular domains on the World Wide Web, with hundreds of millions of unique users per month.",
    "url": "https://manhattan.institute/article/is-wikipedia-politically-biased"
  },
  {
    "text": "Will Donald Trump choose Doug Burgum as his running mate?  Website fuels VP speculation  —  The intrigue surrounding who former President Donald Trump will pick as his running mate grew Thursday after political observers noticed that a website combining North Dakota Gov. Doug Burgum's name … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/20/donald-trump-doug-burgum-website-2024/74155916007/"
  },
  {
    "text": "Supreme Court rules against convicted drug mule who claimed no knowledge of drugs in car  —  Delilah Guadalupe Diaz argued that testimony suggesting she likely knew of the presence of drugs in her vehicle when she was stopped unlawfully undermined her defense.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-drug-mule-methamphetamine-ruling-rcna150271"
  },
  {
    "text": "Supreme Court rules for ex-council member in Texas arrested after criticizing city official  —  Sylvia Gonzalez alleged she was arrested for criticizing the city manager of Castle Hills, Texas, and organizing a petition to remove him from office.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-texas-councilmember-arrest-sylvia-gonzalez-lawsuit-rcna151050"
  },
  {
    "text": "Jamaal Bowman's got the youth vote at least  —  NEW YORK MINUTE: With ten days to go before the city budget is due, Council Speaker Adrienne Adams hasn't reached a deal with the mayor on preschool funding.  —  Members of her Budget Negotiating Team are rallying before the council meeting today with UFT … ",
    "url": "https://www.politico.com/newsletters/new-york-playbook/2024/06/20/jamaal-bowmans-got-the-youth-vote-at-least-00164157"
  },
  {
    "text": "Climate change made US and Mexico heatwave 35 times more likely  —  Human-induced climate change made recent extreme heat in the US south-west, Mexico and Central America around 35 times more likely, scientists say.  —  The World Weather Attribution (WWA) group studied excess heat between … ",
    "url": "https://www.bbc.com/news/articles/czvvqdg8zxno"
  },
  {
    "text": "US says Ukraine can hit inside Russia ‘anywhere’ its forces attack across the border  —  The policy is not limited to the Kharkiv region, U.S. officials said.  —  The U.S. has told Ukraine it can use American-supplied weapons to hit any Russian forces attacking from across the border … ",
    "url": "https://www.politico.com/news/2024/06/20/us-says-ukraine-can-hit-inside-russia-anywhere-00164261"
  },
  {
    "text": "Glorifying Self Harm: Alphabet Activist Group Celebrates Teens ‘Cutting’ Themselves  —  Mermaids is a very prominent and very evil alphabet ideology promotion group that has had, up until very recently, outsized power in determining UK healthcare policies regarding transgender “healthcare.”",
    "url": "https://hotair.com/david-strom/2024/06/20/glorifying-self-harm-alphabet-activist-group-celebrates-teens-cutting-themselves-n3790599"
  },
  {
    "text": "Exclusive: Biden to ban US sales of Kaspersky software over Russia ties, source says  —  The Biden administration on Thursday will announce plans to bar the sale of antivirus software made by Russia's Kaspersky Labs in the United States, a person familiar with the matter said … ",
    "url": "https://www.reuters.com/technology/biden-ban-us-sales-kaspersky-software-over-ties-russia-source-says-2024-06-20/"
  },
  {
    "text": "Hochul Favorability (38-49%) & Job Approval (44-50%) Ratings Lowest Ever; Voters: Hochul Doesn't Care About People Like Them or Provide Decisive Leadership; Small Pluralities Think She Works Hard and Is Honest  — Bipartisan Support for Hochul Decision to Put Congestion Pricing on Hold … ",
    "url": "https://scri.siena.edu/2024/06/20/hochul-favorability-38-49-job-approval-44-50-ratings-lowest-ever-voters-hochul-doesnt-care-about-people-like-them-or-provide-decisive-leadership-small-pluralities-think-she-works-hard-a/"
  }
]