[
  {
    "text": "Trump team pauses new student visa interviews as it weighs expanding social media vetting  —  It's the latest salvo against universities, many of whom rely heavily on foreign students for funds.  —  The Trump administration is weighing requiring all foreign students applying to study … ",
    "url": "https://www.politico.com/news/2025/05/27/trump-team-orders-stop-to-new-student-visa-interviews-as-it-weighs-expanding-social-media-vetting-00370501"
  },
  {
    "text": "After struggling in the Senate, Alabama's Tommy Tuberville launches campaign for governor  —  If the senator makes it to the governor's office next year, it'll be a classic example of a politician failing up.  —  Republican Sen. Tommy Tuberville's interest in Alabama's gubernatorial campaign has been anything but subtle.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/tommy-tuberville-governor-alabama-run-senate-republican-rcna209294"
  },
  {
    "text": "GOP chatters about Auburn coach Bruce Pearl for Senate  —  The Scoop  —  Another Alabama senator named ‘coach’?  There's some talk about it.  —  With Sen. Tommy Tuberville announcing a run for governor on Tuesday, there's already discussion about who will replace him.",
    "url": "https://www.semafor.com/article/05/27/2025/gop-chatters-about-auburn-coach-bruce-pearl-for-senate"
  },
  {
    "text": "SpaceX Starship Loses Control on Test Flight 9 as Rocket Re-enters Earth  —  Much was riding on Flight 9 for Elon Musk's giant moon and Mars rocket after debris from January and March flights fell into the Atlantic Ocean, disrupting air travel.  —  The latest flight of SpaceX's Starship … ",
    "url": "https://www.nytimes.com/2025/05/27/science/spacex-starship-launch-elon-musk-mars.html"
  },
  {
    "text": "FEMA at ‘high risk’ of disrupting ‘life-saving’ disaster relief, per internal memo  —  If you want to support The Handbasket's 100% independent journalism, become a paid subscriber!  —  Video  —  Hurricane season in the United States kicks off this Sunday, June 1st, and the Federal Emergency Management Agency (FEMA) is not prepared.",
    "url": "https://www.thehandbasket.co/p/fema-high-risk-disaster-relief-internal-memo"
  },
  {
    "text": "Trump's Tirades Aren't Swaying Putin  —  The president stamping his feet on social media will do nothing to quell Russia's aims.  —  Who could forget the riveting moment, during the high Cold War tensions of the early 1980s, when President Ronald Reagan strode to the White House podium … ",
    "url": "https://www.theatlantic.com/newsletters/archive/2025/05/trump-called-putin-crazy/682948/?gift=otEsSHbRYKNfFYMngVFweH8GprMeY5ZHWOKWyFaQLGw"
  },
  {
    "text": "Trump Pardoned Tax Cheat After Mother Attended $1 Million Dinner  —  Paul Walczak's pardon application cited his mother's support for the president, including raising millions of dollars and a connection to a plot to publicize a Biden family diary.  —  As Paul Walczak awaited sentencing early this year … ",
    "url": "https://www.nytimes.com/2025/05/27/us/politics/trump-pardon-paul-walczak-tax-crimes.html?unlocked_article_code=1.KU8.Nnrz.1sC3-uRV5d-J&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "U.S. Will No Longer Recommend Covid Shots for Children and Pregnant Women  —  Health Secretary Robert F. Kennedy Jr. upended decades of standard protocol in announcing that the vaccine would be dropped from the immunization schedule for healthy children.  —  The Covid vaccine will no longer … ",
    "url": "https://www.nytimes.com/2025/05/27/health/covid-vaccines-children-pregnant-women-rfk-jr.html"
  },
  {
    "text": "Trade Crime Is Soaring, U.S. Firms Say, as Trump's Tariffs Incentivize Fraud  —  President Trump's steep global tariffs have supercharged efforts to evade them.  Some U.S. companies say the government is ill-equipped to keep up.  —  President Trump's steep global tariffs have supercharged efforts to evade them.",
    "url": "https://www.nytimes.com/2025/05/27/business/economy/trump-tariffs-trade-crime.html"
  },
  {
    "text": "Marshals' Data Shows Spike in Threats Against Federal Judges  —  Data gathered by the law enforcement agency responsible for judicial security showed 162 judges faced threats between March 1 and April 14.  —  Threats against federal judges have risen drastically since President Trump took office … ",
    "url": "https://www.nytimes.com/2025/05/27/us/politics/federal-judges-threats.html?unlocked_article_code=1.KU8.iCRG.V0qUyVgrRHDK&smid=url-share"
  },
  {
    "text": "Trump to pardon reality stars Todd and Julie Chrisley  —  The former stars of USA Network's “Chrisley Knows Best” were sentenced to 12 and seven years, respectively, in 2022 for fraud and tax evasion.  —  President Donald Trump will soon pardon a reality television couple found guilty … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/27/trump-pardon-chrisley/"
  },
  {
    "text": "Judge Strikes Down Trump Order Targeting WilmerHale Law Firm  —  A judge struck down an executive order targeting WilmerHale, in the latest victory for the handful of firms that have fought back against a Trump administration crackdown.  —  President Trump's campaign of retribution … ",
    "url": "https://www.nytimes.com/2025/05/27/us/politics/trump-law-firms-wilmerhale.html?unlocked_article_code=1.KU8.0h50.5FYfVqooRxVg&smid=url-share"
  },
  {
    "text": "RFK Jr. threatens to bar government scientists from publishing in leading medical journals  —  The health secretary said the New England Journal of Medicine, the Journal of the American Medical Association, and The Lancet are in bed with pharma.  —  HHS Secretary Robert F. Kennedy Jr. threatened … ",
    "url": "https://www.politico.com/news/2025/05/27/rfk-jr-nih-scientists-medical-journals-jama-lancet-nejm-00371349"
  },
  {
    "text": "Wall Street Investors Mock Trump With A Brutal 4-Letter Code Word  —  Some investors are betting against Trump — and they've developed a tasty term for the move.  —  Wall Street investors have cooked up a new term for betting against President Donald Trump ― and some have used … ",
    "url": "https://www.huffpost.com/entry/trump-taco-trade_n_6836bca3e4b0362038798a1a"
  },
  {
    "text": "Trump asks Supreme Court to make it easier to deport migrants to South Sudan and other third-party countries  —  President Donald Trump asked the Supreme Court on Tuesday to make it easier for his administration to deport people to South Sudan and other countries that are not their homeland … ",
    "url": "https://cnn.com/2025/05/27/politics/south-sudan-deportations-trump-supreme-court"
  },
  {
    "text": "ACOG Statement on HHS Recommendations Regarding the COVID Vaccine During Pregnancy  —  The following is a statement from Steven J. Fleischman, MD, FACOG, president of the American College of Obstetricians and Gynecologists (ACOG):  —  “ACOG is concerned about and extremely disappointed … ",
    "url": "https://www.acog.org/news/news-releases/2025/05/acog-statement-on-hhs-recommendations-regarding-the-covid-vaccine-during-pregnancy"
  },
  {
    "text": "Trump Court Pick Once Called For Bringing Back Literacy Tests For Voters  —  Literacy tests were banned in the 1960s for being racially discriminatory, but such tests “are not a bad thing,” Josh Divine argued in a 2010 college opinion piece.  —  WASHINGTON — One of President Donald Trump's nominees … ",
    "url": "https://www.huffpost.com/entry/trump-court-pick-josh-divine-literacy-tests_n_6835e04ae4b0620c4725eae3"
  },
  {
    "text": "Secret Service suspends officers caught brawling on camera outside Obama's home: 'Whoop this girl's ass'  —  WASHINGTON — The Secret Service has suspended two uniformed officers who were reportedly caught on camera fighting each other outside former President Barack Obama's home last week.",
    "url": "https://nypost.com/2025/05/27/us-news/secret-service-suspends-officers-caught-brawling-on-camera-outside-obamas-home/"
  },
  {
    "text": "Elon Musk says he's “disappointed” by Trump's “big, beautiful bill” and what it means for DOGE  —  Elon Musk says he is “disappointed” by the price tag on the domestic policy bill passed by Republicans in the House last week and heavily backed by President Trump, the billionaire who recently stepped … ",
    "url": "https://www.cbsnews.com/news/elon-musk-disappointed-by-trump-big-beautiful-bill-doge/"
  },
  {
    "text": "Trump Media to raise $2.5 billion to invest in bitcoin  —  Trump Media and Technology Group (DJT.O) will raise about $2.5 billion to invest in bitcoin, U.S. President Donald Trump's social media company said on Tuesday, as it looks to diversify its revenue.  —  The company is raising the funds … ",
    "url": "https://www.reuters.com/business/trump-media-raise-25-billion-fund-bitcoin-treasury-2025-05-27/"
  },
  {
    "text": "Trump Border Czar's Cash-In With Key ICE Contractor Unmasked  —  DETENTION DOLLARS  —  Tom Homan's ethics filing has fueled concerns that his private sector ties are influencing the administration's immigration crackdown.  —  President Donald Trump's border czar Tom Homan was cashing checks … ",
    "url": "https://www.thedailybeast.com/trumps-border-czar-tom-homan-profited-from-top-ice-contractor-before-white-house-gig/"
  },
  {
    "text": "Newsom backs rule change after Trump threatens to pull funding over transgender athlete  —  The decision to allow more athletes to compete in the state track and field championships came amid controversy over a transgender student's participation.  —  SACRAMENTO, California … ",
    "url": "https://www.politico.com/news/2025/05/27/newsom-transgender-athlete-00371572"
  },
  {
    "text": "Read Elias Rodriguez's Leaked Chats  —  Accused killer of two Israeli Embassy aides ranted against many things — but not Jews  —  We do stories others won't touch; please make that work possible by becoming a paid subscriber (or gifting one)  —  Within minutes of the brutal gunning … ",
    "url": "https://www.kenklippenstein.com/p/read-elias-rodriguezs-leaked-chats"
  },
  {
    "text": "US government to have control in Nippon Steel-U.S. Steel deal, Trump and Sen. McCormick say  —  U.S. Sen. David McCormick said Tuesday that an arrangement that will allow Japan-based Nippon Steel to invest in U.S. Steel will guarantee an American CEO, a majority of board members from the United States … ",
    "url": "https://apnews.com/article/trump-us-steel-nippon-pittsburgh-34ce70dfee9f32cbebe4e13ea9af7ab7"
  },
  {
    "text": "There's a Very Simple Pattern to Elon Musk's Broken Promises  —  The entrepreneur's habit of overpromising on deadlines may be frustrating for investors—but for those looking to see whether a Musk pledge will come good, there's a key phrase to watch out for.",
    "url": "https://www.wired.com/story/theres-a-very-simple-pattern-to-elon-musks-broken-promises/"
  }
]