[
  {
    "text": "Playbook: Dropping the H-bomb on 2024  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  NEW NYT/SIENA POLL — Among registered voters: Trump beats Biden, 46% to 44%.  Among likely voters: Biden beats Trump, 47% to 45%.  Toplines ... Crosstabs",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/19/dropping-the-h-bomb-on-2024-00132405"
  },
  {
    "text": "Poll Finds Wide Disapproval of Biden on Gaza, and Little Room to Shift Gears  —  Opinion is split between those wanting the war to end and those pressing for a definitive Israeli victory, and the divide is starkest among older and younger generations.  —  Opinion is split between those wanting … ",
    "url": "https://www.nytimes.com/2023/12/19/us/politics/biden-israel-gaza-poll.html"
  },
  {
    "text": "Why Biden's campaign keeps linking Trump to Hitler  —  The Biden campaign warns that Trump's rhetoric — from “vermin” to “poisoned” blood — could reflect history repeating.  —  Comparing your political opponent's words to Adolf Hitler's used to be controversial.",
    "url": "https://www.politico.com/news/2023/12/19/biden-trump-hitler-00132367"
  },
  {
    "text": "Fox anchor Bret Baier compares Biden's vaccine mandates and student loan relief to Trump's attempted coup  —  Fox News' purported “straight news anchor” Bret Baier pushed an unbelievable false equivalency on Monday, during an interview with former Rep. Liz Cheney (R-WY).",
    "url": "https://www.mediamatters.org/bret-baier/fox-anchor-bret-baier-compares-bidens-vaccine-mandates-and-student-loan-relief-trumps"
  },
  {
    "text": "Federal judge orders documents naming Jeffrey Epstein's associates to be unsealed  —  More than 150 people are expected to be identified in early January.  —  Jeffrey Epstein attends Launch of RADAR MAGAZINE at Hotel QT on May 18, 2005.  —  A federal judge in New York has ordered … ",
    "url": "https://abcnews.go.com/US/federal-judge-orders-documents-naming-jeffrey-epsteins-associates/story?id=105779882"
  },
  {
    "text": "Nearly 200 People Tied to Pedophile Jeffrey Epstein Will Be Publicly Named in New Year: Judge  —  The names of at least two journalists are among those that will be revealed, according to the documents  —  The names of nearly 200 people connected to pedophile sex trafficker Jeffrey Epstein … ",
    "url": "https://themessenger.com/news/nearly-200-people-tied-to-pedophile-jeffrey-epstein-will-be-publicly-named-in-new-year-judge"
  },
  {
    "text": "Over 170 of Jeffrey Epstein's high-profile associates will be NAMED in court documents set to be unsealed in the first days of 2024  — A judge has ruled to unseal documents that would name 177 Does who are Epstein's friends, recruiters and victims within the coming weeks",
    "url": "https://www.dailymail.co.uk/news/article-12881277/Pedophile-Jeffrey-Epstein-associates-named-unsealed-court-document.html"
  },
  {
    "text": "BOOM: Judge Orders Over 100 of Child Predator Jeffrey Epstein's High Profile Associates to Be Revealed in Next 14 Days - Several Names Linked to Epstein are Emerging - Will Bill Clinton and Bill Gates Be Mentioned?  —  UPDATE: The Gateway Pundit's legal counsel provided us with this statement on Monday's development in the Epstein case.",
    "url": "https://www.thegatewaypundit.com/2023/12/boom-judge-orders-100-child-predator-jeffrey-epsteins/"
  },
  {
    "text": "Biden resists his age limitations, causing tension  —  President Biden's reluctance to acknowledge his physical limitations at age 81 is causing some tension on his team, as senior aides and First Lady Jill Biden push him to rest more and be vigilant about his health going into 2024.",
    "url": "https://www.axios.com/2023/12/19/biden-resistance-age-trump-election-2024"
  },
  {
    "text": "Trump Georgia Co-Defendant's Lawyers File Notice to Withdraw from RICO Case  —  Defense lawyers for Trevian Kutti, the former publicist for the rapper known as Kanye West, on Monday night filed notice they want to drop their client in the Fulton County case  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-georgia-trevian-kutti-codefendant-lawyers-notice-withdraw"
  },
  {
    "text": "$750 a month, no questions asked, improved the lives of homeless people  —  For L.A. Times Subscribers  —  If 100 homeless people were given $750 per month for a year, no questions asked, what would they spend it on?  —  That question was at the core of a controlled study conducted … ",
    "url": "https://www.latimes.com/california/story/2023-12-19/750-a-month-no-questions-asked-improved-the-lives-of-homeless-people"
  },
  {
    "text": "Prosecutors eyed obstruction charges months before Jack Smith took over Trump case  —  A newly unsealed court document underscores the Justice Department's long pursuit of evidence to support the obstruction allegations now lodged against Trump.  —  Months before special counsel Jack Smith took … ",
    "url": "https://www.politico.com/news/2023/12/19/obstruction-charges-jack-smith-trump-case-00132500"
  },
  {
    "text": "Trump Is Scrambling to Block One Particular Expert Witness in His New E. Jean Carroll Case  —  Donald Trump's lawyers want to bar the same expert witness who came up with a hefty calculation in Rudy Giuliani's defamation case from testifying in a new E. Jean Carroll lawsuit.",
    "url": "https://www.thedailybeast.com/donald-trump-scrambles-to-block-expert-witness-ashlee-humphreys-in-his-new-e-jean-carroll-case"
  },
  {
    "text": "GOP Lawmaker: Congressional Colleagues ‘Compromised’ on Jeffrey Epstein Flight Logs  —  The Tennessee congressman said Marsha Blackburn was ‘snubbed’ when trying to subpoena the flight records for the infamous ‘Lolita Express’  —  Rep. Tim Burchett, R-Tenn., is accusing colleagues of being … ",
    "url": "https://themessenger.com/politics/tim-burchett-epstein-flight-logs-senate-blocked"
  },
  {
    "text": "Florida was supposed to be the future of the GOP — now the state party is in shambles  —  Gov. Ron DeSantis grasps desperately for attention, as the state party chair is pushed out after a rape allegation  —  It may seem hard to believe right now, but this time last year … ",
    "url": "https://www.salon.com/2023/12/19/florida-was-supposed-to-be-the-future-of-the--now-the-state-party-is-in-shambles/"
  },
  {
    "text": "Mexico to challenge Texas' new ‘inhumane’ migration law, president says  —  Mexican President Andres Manuel Lopez Obrador on Tuesday said his government was preparing to challenge a new Texas law allowing state law enforcement to arrest suspected migrants, which he called “inhumane.”",
    "url": "https://www.reuters.com/world/americas/mexico-challenge-texas-new-inhumane-migration-law-president-says-2023-12-19/"
  },
  {
    "text": "Tuberville may drop remaining holds on military nominations, citing end of the year  —  Chuck Schumer has said he plans to bring up the four-star military promotions this week.",
    "url": "https://www.politico.com/live-updates/2023/12/19/congress/tuberville-holds-senate-military-00132486"
  },
  {
    "text": "Body found in Kentucky lake by fishermen in 1999 identified as fugitive wanted by FBI  —  Nearly a quarter century after fishermen discovered a body chained to the bottom of a lake in western Kentucky, authorities say advanced forensic testing helped identify the remains as a fugitive wanted by the FBI in the late 1990s.",
    "url": "https://www.cbsnews.com/news/roger-parham-body-found-kentucky-lake-fishermen-1999-identified-fugitive-wanted-fbi/"
  }
]