[
  {
    "text": "Team Trump Is Furious Hegseth Hid Sex Assault Claim: ‘This Is the F-king Pentagon!’  —  The president-elect is putting Republican senators to the test with a string of controversial administration picks … Hegseth was already facing an uphill confirmation battle to become the Secretary … ",
    "url": "https://www.rollingstone.com/politics/politics-features/pete-hegseth-hiding-sex-assault-claim-trump-team-1235178188/"
  },
  {
    "text": "Now GOP Senators Want Another Trump Nominee's Full FBI File  —  JUST A LITTLE PEEK  —  An alignment between Russia and Tulsi Gabbard is worrying some Senate Intelligence Committee members.  —  Some Republican senators are privately eager to see Tulsi Gabbard's FBI file … ",
    "url": "https://www.thedailybeast.com/republican-senators-would-like-to-see-tulsi-gabbards-fbi-file-report/"
  },
  {
    "text": "Gabbard nomination puts Senate GOP in a bind … That panel — which is responsible for processing Gabbard's nomination — is stacked with hawks on both sides of the dais. … But GOP senators are already indicating they'll be interested in probing Gabbard's controversial … ",
    "url": "https://punchbowl.news/article/senate/gabbard-nomination-senate-gop-in-bind/"
  },
  {
    "text": "Musk Unleashes Online Army on Federal Workers.  'A Tough Way to Find Out She's Losing Her Job.'  —  As Trump efficiency czar, the billionaire is targeting employees by name on X—sparking pushback  —  As co-director of President-elect Donald Trump's nascent Department of Government Efficiency … ",
    "url": "https://www.wsj.com/tech/musk-unleashes-online-army-on-federal-workers-a-tough-way-to-find-out-shes-losing-her-job-f57a2e94?st=v5Qcvf&reflink=article_copyURL_share"
  },
  {
    "text": "Elon Musk Is Now Cyberbullying Government Employees  —  Elon Musk is so excited to start his new gig ruining the federal government that he's getting an early start by goading his millions of followers to cyberbully government employees.  —  This week, Musk took aim at Ashley Thomas … ",
    "url": "https://newrepublic.com/post/188773/elon-musk-x-government-employees-call-out"
  },
  {
    "text": "Trump expected to offer Kelly Loeffler secretary of Agriculture  —  President-elect Donald Trump is expected to offer Kelly Loeffler the job of secretary of the Department of Agriculture, two people familiar with the matter told CNN.  —  He is set to meet with her at Mar-a-Lago Friday afternoon … ",
    "url": "https://www.cnn.com/2024/11/22/politics/kelly-loeffler-trump-agriculture-department"
  },
  {
    "text": "Trump Picks Scott Bessent as Treasury Secretary  —  Hedge-fund manager has been a key economic adviser to president-elect  —  WASHINGTON—Donald Trump has selected hedge-fund manager Scott Bessent to lead the Treasury Department, according to people familiar with the matter … ",
    "url": "https://www.wsj.com/politics/trump-treasury-secretary-scott-bessent-cabinet-2470c09a"
  },
  {
    "text": "Trump plans to fire Jack Smith's team, use DOJ to probe 2020 election  —  The plans show how president-elect Donald Trump wants to use the Justice Department to address his own personal grievances  —  President-elect Donald Trump plans to fire the entire team that worked with special counsel Jack Smith … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/22/trump-jack-smith-prosecutors-firing-justice-department-investigation/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMyMjUxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMzNjMzOTk5LCJpYXQiOjE3MzIyNTE2MDAsImp0aSI6IjlkODk1M2ZlLTg0NDktNDM2YS04MzBhLWQ2ZmM0NGMzYWM0NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI0LzExLzIyL3RydW1wLWphY2stc21pdGgtcHJvc2VjdXRvcnMtZmlyaW5nLWp1c3RpY2UtZGVwYXJ0bWVudC1pbnZlc3RpZ2F0aW9uLyJ9.b8dMUTb1qtKGkPZuYYRAZlREbKhtcgCk2xIsjt9eKVU&itid=gfta"
  },
  {
    "text": "House Democrats prepare to make Mike Johnson's life hell … - On any GOP-only legislation, there is “going to be enormous pressure” on Republican centrists to break away, said Rep. Joe Morelle (D-N.Y.).  — Morelle pointed to Rep. Mike Lawler (R-N.Y.), predicting some GOP bills will be … ",
    "url": "https://www.axios.com/2024/11/22/mike-johnson-votes-majority-house-democrats"
  },
  {
    "text": "Trump's intel pick was placed on government watch list for overseas travel and foreign connections  —  Tulsi Gabbard, Donald Trump's pick to lead the intelligence community, was briefly placed on a Transportation Security Administration list that prompts additional security screening … ",
    "url": "https://www.cnn.com/2024/11/22/politics/tulsi-gabbard-government-watch-list-travel-connections"
  },
  {
    "text": "Texas approves new Bible-based curriculum for elementary schools  —  Teachers can opt in, but state is offering financial incentive of $60 a student for participating school districts  —  The Texas board of education voted 8-7 on Friday to approve a new Bible-based curriculum in elementary schools.",
    "url": "https://www.theguardian.com/us-news/2024/nov/22/texas-approves-bible-based-curriculum-elementary-schools"
  },
  {
    "text": "Matt Gaetz says he's not returning to Congress next year  —  Former Florida Rep. Matt Gaetz, who withdrew from consideration as President-elect Donald Trump's pick for attorney general on Thursday, said Friday he will not be returning to Congress next year.  —  “I'm still going to be in the fight … ",
    "url": "https://www.cnn.com/2024/11/22/politics/gaetz-not-rejoining-congress"
  },
  {
    "text": "US Supreme Court to decide Federal Communications Commission fund's legality  —  The U.S. Supreme Court agreed on Friday to decide the legality of a congressionally authorized fund operated by the Federal Communications Commission to expand access to telecommunications services … ",
    "url": "https://www.reuters.com/world/us/us-supreme-court-decide-federal-communications-commission-funds-legality-2024-11-22/"
  },
  {
    "text": "Trump Is Pissed at True Reports His Victory Wasn't Exactly a Landslide  —  Donald Trump is upset with the media for accurately reporting that his election night victory wasn't exactly a “landslide.”  —  Trump transition team spokeswoman Karoline Leavitt on Friday took aim at Politico … ",
    "url": "https://newrepublic.com/post/188744/trump-pissed-reports-didnt-win-landslide-election-results"
  },
  {
    "text": "Walmart just leveled with Americans: China won't be paying for Trump's tariffs, in all likelihood you will  —  Donald Trump told voters tariffs are a tax on a foreign country.  But it's Americans that will pay the price, Walmart's finance chief warned.  —  Voters who returned Donald … ",
    "url": "https://fortune.com/2024/11/22/donald-trump-economy-trade-tariffs-china-imports-walmart/"
  },
  {
    "text": "Top senator calls Salt Typhoon 'worst telecom hack in our nation's history'  —  The severity of the Chinese breach highlights the need for more telecommunications regulation, lawmakers say.  —  The Chinese government espionage campaign that has deeply penetrated more than a dozen U.S … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/21/salt-typhoon-china-hack-telecom/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMyMjUxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMzNjMzOTk5LCJpYXQiOjE3MzIyNTE2MDAsImp0aSI6IjNlMGVhYmJhLWQxYjktNDI3Mi04ODNlLTE5MGEyYTA2NzdlZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI0LzExLzIxL3NhbHQtdHlwaG9vbi1jaGluYS1oYWNrLXRlbGVjb20vIn0.vPOaCuW_d5OSHibr0UCf4KnozhhCW0A490yN7mQOgOw&itid=gfta"
  },
  {
    "text": "Nancy Mace's Federal Trans Bathroom Ban Would Apply To Major Airports, Hindering Travel  —  Congresswoman Nancy Mace, who has targeted Congresswoman Sarah McBride with a bathroom ban in the capitol, is now pushing a sweeping federal bathroom ban for trans people.",
    "url": "https://www.erininthemorning.com/p/nancy-maces-federal-trans-bathroom"
  },
  {
    "text": "Trump selects former NFL player Scott Turner to lead housing agency  —  The one-time Texas lawmaker works at a Trump-allied think tank.  —  President-elect Donald Trump selected motivational speaker Scott Turner of the America First Policy Institute to lead the Department of Housing and Urban Development … ",
    "url": "https://www.politico.com/news/2024/11/22/scott-turner-hud-secretary-trump-00191344"
  },
  {
    "text": "Trump's transition team turns to Project 2025 after disavowing it during the campaign  —  Transition officials have used Project 2025's extensive personnel database to identify potential hires for the incoming administration, a person familiar with the plans said.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-team-turns-project-2025-disavowing-effort-campaign-rcna180689?taid=6740aaf204c1de00019795bd"
  },
  {
    "text": "Trump nominates Marty Makary, who opposed COVID vaccine mandates, to head FDA  —  President-elect Donald Trump nominated Dr. Marty Makary Friday to lead the Food and Drug Administration, selecting a surgeon and author who opposed vaccine mandates and some other public health measures during the coronavirus pandemic.",
    "url": "https://www.cbsnews.com/news/trump-marty-makary-fda-administrator/"
  },
  {
    "text": "‘Is she on our side?’:  Jan. 6 defendants and allies puzzle over Bondi nomination  —  Trump's new nominee for attorney general has been largely silent about the Jan. 6 riot.  —  Everyone knew where Matt Gaetz stood on the Jan. 6 attack on the Capitol.  He promoted conspiracy theories … ",
    "url": "https://www.politico.com/news/2024/11/22/pam-bondi-trump-nomination-january-6-00191362"
  },
  {
    "text": "Elon Musk Gets a Crash Course in How Trumpworld Works  —  The world's richest person, not known for his humility, is still learning the cutthroat courtier politics of Donald Trump's inner circle — and his ultimate influence remains an open question.  —  For the first 53 years of his life … ",
    "url": "https://www.nytimes.com/2024/11/22/us/politics/elon-musk-trump.html"
  },
  {
    "text": "More details about JFK assassination keep emerging, even 61 years later  —  Sixty-one years ago, on November 22, 1963, President John F. Kennedy was assassinated in Dallas, Texas, in a shocking tragedy that still echoes.  —  The JFK assassination sent the nation into mourning and shook it to its core … ",
    "url": "https://www.usatoday.com/story/news/nation/2024/11/22/president-john-f-kennedy-assassinated-61-years-ago/76497785007/"
  }
]