[
  {
    "text": "Special Counsel Report Says Trump Would Have Been Convicted in Election Case  —  “But for Mr. Trump's election and imminent return to the presidency, the office assessed that the admissible evidence was sufficient to obtain and sustain a conviction at trial,” the report said.",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/trump-special-counsel-report-election-jan-6.html?unlocked_article_code=1.pE4.qEsJ.JEVOGbzuKumK&smid=url-share"
  },
  {
    "text": "The Most Damning Lines in Jack Smith's Brutal Trump January 6 Report  —  Special counsel Jack Smith did not hold back in his final report on the investigation into Donald Trump's attempt to overturn the 2020 election.  —  While much of it contains information already made public … ",
    "url": "https://newrepublic.com/post/190190/jack-smith-trump-january-6-report"
  },
  {
    "text": "Trump would have been convicted over 2020 election, says special counsel  —  Report by Jack Smith says evidence ‘was sufficient to obtain and sustain a conviction’ had Trump not won re-election in 2024  —  Donald Trump would have been convicted of crimes over his failed attempt to cling … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/14/donald-trump-2020-election-conviction-special-counsel-report-jack-smith"
  },
  {
    "text": "A Contrarian Take on Volume One of Jack Smith's Report  —  The fact that we are already familiar with almost all of the facts in the first volume of Jack Smith's final report on January 6th and Donald Trump's attempted self-coup, makes them no less horrifying.",
    "url": "https://contrarian.substack.com/p/a-contrarian-take-on-volume-one-of"
  },
  {
    "text": "The Pressure Campaign to Get Pete Hegseth Confirmed as Defense Secretary  —  Supporters of Donald Trump's nominee have intimidated potential witnesses and suppressed the F.B.I. background check of the former Fox News host in the run-up to his Senate hearing.",
    "url": "https://www.newyorker.com/news/the-lede/the-pressure-campaign-to-get-pete-hegseth-confirmed-as-defense-secretary"
  },
  {
    "text": "Vice Is a Moat  —  1. Secretary Pete  —  Here is the thing about Pete Hegseth:  —  Imagine that his character was sterling.  That he was a fine, upstanding man, admired by all who know him.  That he had dedicated his life to service and been judged to be as good a human being as Mister Rogers or Dolly Parton.",
    "url": "https://www.thebulwark.com/p/vice-is-a-moat"
  },
  {
    "text": "Elon Musk, Jeff Bezos and Mark Zuckerberg to attend Trump's inauguration  —  The three will be seated together on the inauguration platform with other prominent guests.  —  Elon Musk, Jeff Bezos and Mark Zuckerberg will attend President-elect Donald Trump's inauguration on Monday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/elon-musk-jeff-bezos-mark-zuckberg-trump-inauguration-rcna187629"
  },
  {
    "text": "Bannon: Zuckerberg 'can't be trusted'  —  Steve Bannon, a former adviser to President-elect Trump, went after Meta CEO Mark Zuckerberg in a Monday episode of his “Bannon's War Room” podcast.  —  “Zuckerberg can't be trusted, at all,” Bannon said on his show, in a clip highlighted by Mediaite.",
    "url": "https://thehill.com/policy/technology/5084210-steve-bannon-meta-mark-zuckerberg/"
  },
  {
    "text": "GOP Senator Flames Dems for ‘Cheating’ and Voting ‘Drunk’  —  “And don't tell me you haven't seen it, because I know you have,” the Republican senator said.",
    "url": "https://www.thedailybeast.com/gop-senator-markwayne-mullin-flames-dems-for-cheating-and-voting-drunk-during-pete-hegseth-hearing/"
  },
  {
    "text": "House passes ban on transgender students in girls sports  —  Washington — The House on Tuesday passed a Republican measure banning transgender girls and women from competing on school sports teams that match their gender identity after the party leaned into the issue during the 2024 campaign.",
    "url": "https://www.cbsnews.com/news/house-ban-transgender-girls-womens-sports/"
  },
  {
    "text": "House Passes Bill to Bar Trans Athletes From Female School Sports Teams  —  Republicans' decision to push through the measure early in the new Congress indicated their belief that the issue is politically potent for them.  Its future in the Senate is uncertain.",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/house-trans-athletes.html"
  },
  {
    "text": "Certification of Rescission of Cuba's Designation as a State Sponsor of Terrorism  —  Certification of Rescission of Cuba's Designation  —  Pursuant to the Constitution and the laws of the United States, and consistent with sections 1754(c) and 1768(c) of the National Defense Authorization Act … ",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2025/01/14/certification-of-rescission-of-cubas-designation-as-a-state-sponsor-of-terrorism/"
  },
  {
    "text": "Michelle Obama will skip Trump inauguration, but ex-Presidents Obama, Clinton and Bush will be there  —  Former first lady Michelle Obama will skip the inauguration of President-elect Donald Trump, the second time in two weeks that she is not attending a gathering of former U.S. leaders and their spouses … ",
    "url": "https://apnews.com/article/trump-inauguration-obama-bush-clinton-f7212766dc0f69444d8a4537a736c2d2"
  },
  {
    "text": "I was fully indoctrinated into the Democrat ‘cult.’ Here's why I left my liberal influencer life behind to raise money for Trump  —  A former high energy Democratic fundraiser, failed congressional candidate and social media influencer is now raising money for President-elect Donald Trump's inaugural committee.",
    "url": "https://www.dailymail.co.uk/news/article-14278643/lindy-li-liberal-defected-democrat-cult-raising-money-trump.html"
  },
  {
    "text": "Israel and Hamas agree in principle to ceasefire and hostage deal, sources say  —  A draft deal for a ceasefire in Gaza and hostage release has been agreed to in principle and, if all goes well, will be finalized by Israel and Hamas this week, Arab, U.S. and Israeli officials told CBS News.",
    "url": "https://www.cbsnews.com/news/israel-hamas-ceasefire-hostage-deal-agreement-in-principle/"
  },
  {
    "text": "Johnson backs away from go-it-alone debt ceiling plan  —  The speaker acknowledged the borrowing limit could be included in government funding talks — where he'll need Democratic votes.  —  Speaker Mike Johnson on Tuesday backed away from a plan to address the approaching federal debt cliff … ",
    "url": "https://www.politico.com/news/2025/01/14/mike-johnson-debt-limit-ceiling-reconciliation-00198156"
  },
  {
    "text": "The Washington Post just endorsed 19 Trump nominees.  Here are the 5 worst.  —  Remember when Washington Post owner Jeff Bezos spiked the paper's planned editorial board endorsement of Kamala Harris and then Bezos piously insisted that endorsements demonstrate bias and his publisher William Lewis claimed … ",
    "url": "https://www.findinggravity.net/p/the-washington-post-just-endorsed"
  },
  {
    "text": "Democratic Senators Say a Campaign Treasurer Stole Their Money  —  Tim Kaine and Mark Warner suspect their former treasurer misappropriated funds from their political committees  —  WASHINGTON — At least four Democratic political committees suspect their former campaign treasurer is behind the … ",
    "url": "https://www.rollingstone.com/politics/politics-features/tim-kaine-mark-warner-democrats-campaign-treasurer-1235235232/"
  },
  {
    "text": "A Life Sentence of Disgrace  —  It goes without saying that the big historic event of last week—maybe of the year—is the catastrophic L.A. Fire, which I will write about in the weeks ahead.  But before we say farewell to Jimmy Carter's Long Goodbye, I wanted to tell you a bit about my experience … ",
    "url": "https://washingtonmonthly.com/2025/01/14/a-life-sentence-of-disgrace/"
  },
  {
    "text": "Scoop: Blackburn eyeing run for Tennessee governor … - State and federal elected officials have been making calls in support of her possible candidacy in recent days, a source tells Axios.  — With Tennessee voters leaning solidly Republican, the GOP primary will likely determine the state's next governor.",
    "url": "https://www.axios.com/2025/01/14/marsha-blackburn-tennessee-governor-2026-election"
  },
  {
    "text": "Harris declines to invite Vance for courtesy visit to vice president's residence before inauguration  —  When JD Vance, his wife Usha and their three young children move into the Naval Observatory residence on Jan. 20, it will be their first time inside the white Queen Anne-style mansion … ",
    "url": "https://www.cbsnews.com/news/harris-jd-vance-vice-presidents-residence/"
  },
  {
    "text": "How to Fix America's Two-Party Problem  —  Mr. Wegman is a member of the Times editorial board, where he writes about democracy, law and politics.  Mr. Drutman is a senior fellow at New America and the author of “Breaking the Two-Party Doom Loop: The Case for Multiparty Democracy in America.”",
    "url": "https://www.nytimes.com/interactive/2025/01/14/opinion/fix-congress-proportional-representation.html"
  },
  {
    "text": "No One Wants A Biden Presidential Library  —  There is absolutely nothing commendable about Biden and his career, especially about his four years in the White House.  —  During the California leg of a year-long journey across America, I devoted a day to visiting two presidential libraries within a short distance of each other.",
    "url": "https://thefederalist.com/2025/01/14/no-one-wants-a-biden-presidential-library/"
  },
  {
    "text": "Kaine clashes with Hegseth over infidelity, drinking, scandals  —  Sen. Tim Kaine (D-Va.) clashed sharply with secretary of Defense nominee Pete Hegseth over his infidelity and reports of public drunkenness and drunkenness on the job, repeatedly pressing Hegseth on his character and judgment.",
    "url": "https://thehill.com/homenews/5084889-tim-kaine-pete-hegseth-hearing-infidelity/"
  }
]