[
  {
    "text": "Playbook: The Jan. 6 election  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TALKER — “The Unpredictable But Entirely Possible Events That Could Throw 2024 Into Turmoil,” in which POLITICO Magazine brings together a collection of “futurists … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/05/the-jan-6-election-00133992"
  },
  {
    "text": "James Comer searched for China link to Biden — but Oversight found Trump instead: reporter  —  The House Oversight and Reform Committee, under Rep. James Comer's (R-KY) leadership, has searched through the finances of President Joe Biden and the rest of his family looking for incriminating links to foreign entities.",
    "url": "https://www.rawstory.com/trump-foreign-money-2666871402/"
  },
  {
    "text": "'These people know what they're doing': Why Trump is attacking Haley in NH  —  What if it is closer than expected in the Granite state?  —  Donald Trump may be up by 20 percentage points in New Hampshire, but he and his team have moved swiftly to cut down any opponent they see rising.",
    "url": "https://www.politico.com/news/2024/01/05/trump-is-attacking-haley-in-nh-his-real-problem-is-the-expectations-game-00133929"
  },
  {
    "text": "Illinois and Massachusetts voters seek to take Trump off 2024 ballot  —  Groups of voters from Illinois and Massachusetts on Thursday filed motions to remove Donald Trump from the 2024 ballot, adding to the list of states where the former president faces a challenge to his candidacy under … ",
    "url": "https://www.cnn.com/2024/01/04/politics/illinois-voters-ask-elections-board-to-take-trump-off-2024-ballot/"
  },
  {
    "text": "How Trump Has Used Fear and Favor to Win Republican Endorsements  —  The former president keeps careful watch over his endorsements from elected Republicans, aided by a disciplined and methodical behind-the-scenes operation.  —  On his last day as president on Jan. 20, 2021 … ",
    "url": "https://www.nytimes.com/2024/01/04/us/politics/trump-endorsements.html"
  },
  {
    "text": "17-year-old kills sixth grader, wounds five others in Iowa school shooting, police say  —  Police say multiple people have been shot at a high school in Iowa  —  17-year-old killed a sixth grader in Iowa school shooting, friends of suspect say he was bullied",
    "url": "https://apnews.com/article/perry-high-school-shooting-iowa-1defc6260e074362240a31a7f30cf1b9"
  },
  {
    "text": "Multiple people shot at Iowa high school on the first day after winter break, officials say  —  The shooter at Perry High School is dead from an apparent self-inflicted gunshot wound, multiple senior law enforcement officials said.  Three others were injured, including two students and an administrator, the officials added.",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/live-updates-active-shooting-perry-high-school-rcna132235"
  },
  {
    "text": "The war in Gaza may widen.  The Biden admin is getting ready for it.  —  That could put President Joe Biden in the center of a messy Middle East conflict in the midst of a bruising re-election campaign.  —  Biden administration officials are drawing up plans for the U.S. to respond … ",
    "url": "https://www.politico.com/news/2024/01/04/war-gaza-widen-biden-getting-ready-00133949"
  },
  {
    "text": "Florida venue cancels Marjorie Taylor Greene event after learning of its Jan. 6 focus  —  The event was originally touted as book-signing hosted by a local Republican Party.  —  A central Florida venue has canceled an event that was to feature Rep. Marjorie Taylor Greene, R-Ga. … ",
    "url": "https://www.nbcnews.com/politics/politics-news/florida-venue-cancels-marjorie-taylor-greene-jan-6-event-rcna132365"
  },
  {
    "text": "Florida Proud Boy Sentenced on Felony Charges for Assaulting Police Officers During Jan. 6 Capitol Breach  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  Defendant Became a Fugitive to Avoid Sentencing, Triggering a 6-Week Manhunt",
    "url": "https://www.justice.gov/usao-dc/pr/florida-proud-boy-sentenced-felony-charges-assaulting-police-officers-during-jan-6"
  },
  {
    "text": "Former Capitol Police officer outspoken about Jan. 6 launches run for Congress  —  Harry Dunn, who has testified extensively about the Jan. 6 riot, recently retired from the force and is running in Maryland's 3rd Congressional District.  —  WASHINGTON — Nearly three years ago to the day … ",
    "url": "https://www.nbcnews.com/politics/2024-election/former-capitol-police-officer-harry-dunn-jan-6-run-congress-rcna132110"
  },
  {
    "text": "The White House's tense podium battle  —  They share a podium — and a mutual frustration.  White House press secretary Karine Jean-Pierre and the National Security Council's John Kirby frequently split the podium at media briefings, but behind the scenes their relationship is fraught with tension, White House sources tell Axios.",
    "url": "https://www.axios.com/2024/01/05/white-house-press-secretary-jean-pierre-kirby-tension"
  },
  {
    "text": "Bill Ackman's celebrity academic wife Neri Oxman's dissertation is marred by plagiarism  — Harvard president Claudine Gay resigned after conservative activists revealed she had plagiarized.  — Hedge fund manager and prominent Harvard donor Bill Ackman helped lead the charge against Gay.",
    "url": "https://www.businessinsider.com/bill-ackman-wife-neri-oxman-mit-dissertation-plagiarism-2024-1"
  },
  {
    "text": "Advocates nearing the impossible: Securing abortion rights in Florida  —  A measure has almost reached the threshold to qualify for this year's ballot.  —  TALLAHASSEE, Florida — Florida abortion rights advocates, who have seen access to the procedure erode in the state and nationally in recent years … ",
    "url": "https://www.politico.com/news/2024/01/05/florida-abortion-rights-amendment-00133938"
  },
  {
    "text": "Arrest footage of Trump co-defendant provides glimpse into Jack Smith probe  —  “They were f—king relentless,” former Black Voices for Trump director Harrison Floyd said of his confrontation with FBI agents dispatched by the special counsel.  —  Special counsel Jack Smith's probe … ",
    "url": "https://www.politico.com/news/2024/01/04/harrison-floyd-trump-bodycam-footage-jack-smith-00133933"
  },
  {
    "text": "Ex-Rep. Eddie Bernice Johnson's family plans lawsuit alleging negligent care led to death  —  The family of the late Rep. Eddie Bernice Johnson (D-Texas) is planning a lawsuit over what they describe as negligent care that led to her death earlier this week.",
    "url": "https://thehill.com/homenews/house/4390211-ex-rep-eddie-bernice-johnsons-family-plans-lawsuit-alleging-negligent-care-led-to-death/"
  },
  {
    "text": "Trump files ‘powerhouse’ motion calling for Special Counsel Jack Smith to be held in contempt of court  —  Trump attorney says Smith is converting the court's docket into ‘an arm of the Biden campaign’  —  Former President Donald Trump's attorneys filed what his campaign called a “powerhouse” … ",
    "url": "https://www.foxnews.com/politics/trump-files-powerhouse-motion-calling-special-counsel-jack-smith-held-contempt-court"
  }
]