[
  {
    "text": "Musk's Junta Establishes Him as Head of Government  —  Imagining how we'd cover overseas what's happening to the U.S. right now  —  I've long believed that the American media would be more clear-eyed about the rise and return of Donald Trump if it was happening overseas in a foreign country … ",
    "url": "https://www.doomsdayscenario.co/p/musk-s-junta-establishes-him-as-head-of-government"
  },
  {
    "text": "Acting on Trump's order, federal officials opened up two California dams  — The U.S. Army Corps of Engineers abruptly increased the amount of water flowing from two California dams.  — The federal agency made the decision after President Trump signed an order calling for increased water deliveries.",
    "url": "https://www.latimes.com/environment/story/2025-01-31/trump-california-dams-opened-up"
  },
  {
    "text": "Trump's emergency water order responsible for water dump from Tulare County lakes  —  The sudden announcement Thursday by the U.S. Army Corps of Engineers that Kaweah and Success lakes would immediately begin dumping water was in response to President Trump's Jan. 24 executive order mandating … ",
    "url": "https://sjvwater.org/trumps-emergency-water-order-responsible-for-water-dump-from-tulare-county-lakes/"
  },
  {
    "text": "The RFK Jr. Op-Ed the Los Angeles Times Didn't Want You to Read  —  Editors note: As The New Republic reported on Friday, the Los Angeles Times—currently in a race to the bottom with The Washington Post to determine which of the two venerable institutions can sell out to Donald Trump the hardest … ",
    "url": "https://newrepublic.com/article/191030/rfk-jr-op-ed-los-angeles-times"
  },
  {
    "text": "Pentagon to swap traditional media with pro-Trump outlets under new rotational program for Defense Department workspace  —  One America News Network would soon replace NBC News and Breitbart would swap with National Public Radio in coveted Pentagon press corps workspace under a plan shared with journalists Friday night.",
    "url": "https://www.cnn.com/2025/01/31/media/pentagon-press-rotation-defense-department/"
  },
  {
    "text": "Defense Dept. evicts NBC, NPR, NYT from Pentagon offices to make way for Breitbart, OANN  —  The major news outlets were ordered to vacate their offices as part of a newly instated “media rotation program”  —  The Department of Defense has ordered several major news outlets to vacate … ",
    "url": "https://www.salon.com/2025/02/01/defense-dept-evicts-nbc-npr-nyt-from-pentagon-offices-to-make-way-for-breitbart-oann/"
  },
  {
    "text": "The Truth About Democrats, According to Amy Klobuchar  —  Let's skip the happy talk: Democrats are in a dark place.  It's not merely that Donald Trump has rolled back into Washington with an everything-everywhere-all-at- once approach to grabbing power.  The new president is buoyed by eager … ",
    "url": "https://www.nytimes.com/2025/02/01/opinion/amy-klobuchar-interview-democrats-trump.html"
  },
  {
    "text": "Ken Martin wins election as the next chair of the Democratic National Committee  —  The DNC's chair election marks a first step for a party looking to fill a void of leadership after the 2024 election.  —  Ken Martin, the longtime leader of the state Democratic Party organization in Minnesota … ",
    "url": "https://www.nbcnews.com/politics/elections/ken-martin-wins-election-chair-democratic-national-committee-rcna190018"
  },
  {
    "text": "The Dumbest Trade War in History  —  Trump will impose 25% tariffs on Canada and Mexico for no good reason.  —  President Trump will fire his first tariff salvo on Saturday against those notorious American adversaries . . . Mexico and Canada.  They'll get hit with a 25% border tax, while China, a real adversary, will endure 10%.",
    "url": "https://www.wsj.com/opinion/donald-trump-tariffs-25-percent-mexico-canada-trade-economy-84476fb2"
  },
  {
    "text": "Trump fires the director of the Consumer Financial Protection Bureau  —  President Donald Trump has fired the director of the Consumer Financial Protection Bureau, Rohit Chopra, in the latest purge of a Biden administration holdover.  Chopra was one of the more important regulators … ",
    "url": "https://apnews.com/article/trump-chopra-consumer-financial-protection-bureau-47b6b39d0eff05ea0c9bca4eacf55b79"
  },
  {
    "text": "Pro-RFK Jr. letter to the Senate includes names of doctors whose licenses were revoked or suspended  —  A letter submitted to the U.S. Senate that states it was sent by physicians in support of Robert F. Kennedy Jr.'s nomination as secretary of Health and Human Services includes the names … ",
    "url": "https://apnews.com/article/trump-cabinet-kennedy-health-secretary-doctors-vaccines-a3dc5bdb0be5da29dccaef91c19c9ce4"
  },
  {
    "text": "Trump says he ordered precision military air strikes on ISIS leaders in Somalia  —  The U.S. military conducted coordinated airstrikes against ISIS operatives in Somalia, the first attacks in the African nation during President Trump's second term.  —  Mr. Trump said Saturday in a post … ",
    "url": "https://www.cbsnews.com/news/trump-air-strikes-isis-leaders-in-somalia/"
  },
  {
    "text": "Red states love Trump—and mooching off the federal funds he wants to cut  —  West Virginia is one the nation's most reliably Republican states, as is Louisiana.  Voters there overwhelmingly pulled the lever for Donald Trump in 2024, striking a decisive blow against former Vice President Kamala Harris … ",
    "url": "https://www.dailykos.com/story/2025/2/1/2300220/-Red-states-love-Trump-and-mooching-off-the-federal-funds-he-wants-to-cut"
  },
  {
    "text": "Elon Musk's Friends Have Infiltrated Another Government Agency  —  Elon Musk's former employees are trying to use White House credentials to access General Services Administration tech, giving them the potential to remote into laptops, read emails, and more, sources say.",
    "url": "https://www.wired.com/story/elon-musk-lackeys-general-services-administration/"
  },
  {
    "text": "Air Traffic Control Offices Are in Chaos in Trump's New Administration  —  Sources say air traffic control offices have been in a state of Trumpian despair since he took over — and that was before the plane crash near D.C.  —  Almost as soon as Donald Trump was sworn in late last month … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-musk-air-traffic-control-offices-chaos-plane-crash-1235253403/"
  },
  {
    "text": "National Press Club Statement On Pentagon's Decision to Remove Media Organizations from Workspaces  —  WASHINGTON, Jan. 31, 2025 /PRNewswire/ — National Press Club President Mike Balsamo today issued the following statement in response to the Defense Department's decision to revoke dedicated workspace … ",
    "url": "https://www.prnewswire.com/news-releases/national-press-club-statement-on-pentagons-decision-to-remove-media-organizations-from-workspaces-302365766.html"
  },
  {
    "text": "Greene suggests throwing out foreign outlets: ‘American media first’  —  Rep. Marjorie Taylor Greene (R-Ga.) suggested throwing out foreign news outlets of the White House briefing room as she appears to have taken an issue with a reporter's accent during a press briefing on Friday.",
    "url": "https://thehill.com/homenews/media/5120851-marjorie-taylor-greene-foreign-media/"
  },
  {
    "text": "Who Can Stop Elon's ‘Team’ Wilding Its Way Through the Federal Government?  —  Over the course of the last two weeks, I've tried to drive home the point that the Democrats in Congress mostly can't do anything to stop what the Trump administration is doing.  That's not a matter of weakness or bad strategy.",
    "url": "https://talkingpointsmemo.com/edblog/who-can-stop-elons-team-wilding-its-way-throuhg-the-federal-government"
  },
  {
    "text": "Musk's DOGE Brings in HR Consultant Focused on ‘Non-Woke’ DEI ‘Aligned With Our Faith’  —  Elon Musk's DOGE, the newly formed government agency aiming for drastic cuts across the U.S. government, has brought in an HR employment attorney and consultant who has spent the last few years teaching companies her … ",
    "url": "https://www.404media.co/musks-doge-brings-in-hr-consultant-focused-on-non-woke-dei-aligned-with-our-faith/"
  },
  {
    "text": "Watch live coverage: Plane crash in Philadelphia leaves multiple houses on fire, causes explosion  —  Emergency crews are responding to an explosion in Northeast Philadelphia after a small medical jet crashed in the area of Roosevelt Boulevard and Cottman Avenue, Philadephia police confirmed to CBS News Philadelphia.",
    "url": "https://www.cbsnews.com/philadelphia/news/plane-crash-cottman-roosevelet/"
  },
  {
    "text": "The tragic air collision revealed Trump's rancid, irredeemable character once again  —  Trump's pretense as king has quickly devolved into his strutting insult routine.  He will always exploit tragedy to display his self-regard  —  Outrages of Donald Trump's rancid character topple over each … ",
    "url": "https://www.theguardian.com/commentisfree/2025/feb/01/trump-plane-crash-character-sidney-blumenthal"
  },
  {
    "text": "N.Y. Hospital Stops Treating 2 Children After Trump's Trans Care Order  —  The hospital canceled their appointments the same week an executive order from President Trump threatened to punish doctors and hospitals for offering gender-affirming care.  —  A leading New York City hospital system … ",
    "url": "https://www.nytimes.com/2025/02/01/nyregion/nyu-langone-hospital-trans-care-youth.html"
  },
  {
    "text": "‘There will be many casualties’: Panama girds for war as Rubio opens talks  —  On the ground in Panama City ahead of Marco Rubio's first trip as secretary of State.  —  PANAMA CITY — Marco Rubio's weekend visit to Panama is set to offer clues to a pressing question: whether the next four years … ",
    "url": "https://www.politico.com/news/2025/02/01/panama-trump-confrontation-war-00201759"
  },
  {
    "text": "Trump's disregard for US constitution ‘a blitzkrieg on the law’, legal experts say  —  Scholars warn of president's lawlessness in actions such as federal funding freeze and birthright citizenship order  —  Donald Trump's rapid-fire and controversial moves that have ranged … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/01/trump-executive-orders-constitution-law"
  },
  {
    "text": "Wyden Demands Answers Following Report of Musk Personnel Seeking Access to Highly Sensitive U.S. Treasury Payments System  —  In New Letter to Treasury Secretary Bessent, Wyden Warns That Political Meddling in Treasury Payments Risks Severe Economic Damage, Calls Out Dangerous Conflicts … ",
    "url": "https://www.finance.senate.gov/chairmans-news/wyden-demands-answers-following-report-of-musk-personnel-seeking-access-to-highly-sensitive-us-treasury-payments-system"
  },
  {
    "text": "Public health information pulled offline in response to Trump orders  —  Massive amounts of information about HIV, LGBTQ+ health were pulled from cdc.gov Friday night.  —  Large amounts of public information about HIV and the health of teens, transgender and LGBTQ+ people abruptly disappeared late Friday … ",
    "url": "https://www.politico.com/news/2025/01/31/public-health-information-offline-trump-orders-00201914"
  },
  {
    "text": "Federal Judge Orders White House to Keep Money Flowing to 22 States  —  A court in Rhode Island issued a temporary restraining order to block Trump's directive to defund programs he considers to be “woke.”  —  A federal judge on Friday ordered the Trump administration to keep taxpayer dollars flowing … ",
    "url": "https://www.nytimes.com/2025/01/31/us/trump-freeze-blocked.html"
  }
]