[
  {
    "text": "CBS News poll finds Trump starts on positive note as most approve of transition handling  —  President-elect Donald Trump's incoming administration starts off with mostly good will from the public: a majority of Americans overall are either happy or at least satisfied that he won … ",
    "url": "https://www.cbsnews.com/news/cbs-news-poll-trump-transition-cabinet-picks-2024-11-24/"
  },
  {
    "text": "Trump Is Running His Transition Team on Secret Money  —  Breaking with past practice, President-elect Donald J. Trump has not agreed to disclose the donors paying for his planning effort or to limit their contributions.  —  President-elect Donald J. Trump is keeping secret the names … ",
    "url": "https://www.nytimes.com/2024/11/24/us/politics/donald-trump-2024-campaign-transition.html?unlocked_article_code=1.cU4.9Lik.0btlhOTcy7j9&smid=url-share"
  },
  {
    "text": "Trump Refuses to Disclose Who Is Funding His Transition  —  He is the first president-elect not to sign an ethics agreement that sets fundraising limits and transparency  —  True to character, Donald Trump is already flouting ethics laws and norms even before he takes office as president in 2025.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-refuses-disclose-funding-transition-1235179059/"
  },
  {
    "text": "Trump's national security pick: I'm on same page as Jake Sullivan about ‘our adversaries’  —  “We are hand in glove.  We are one team with the United States in this transition,” Rep. Mike Waltz said.  —  Rep. Michael Waltz (R-Fla.) said Sunday that he has met with President Joe Biden's … ",
    "url": "https://www.politico.com/news/2024/11/24/trump-national-security-adviser-waltz-sullivan-00191412"
  },
  {
    "text": "Romania election stunner: Unexpected hard-right candidate surges in presidential vote  —  Romanian ultranationalist Călin Georgescu is currently on track to make it to the final round of presidential elections, according to Sunday's provisional results with more than 90 percent of precincts reporting.",
    "url": "https://www.politico.eu/article/romania-election-stunner-who-is-calin-georgescu-marcel-ciolacu/"
  },
  {
    "text": "Feeling betrayed by increased minority support for Trump, Black women say they're stepping back  —  As she checked into a recent flight to Mexico for vacation, Teja Smith chuckled at the idea of joining another Women's March on Washington.  As a Black woman, she just couldn't see herself helping … ",
    "url": "https://apnews.com/article/trump-black-women-democrats-harris-base-votecast-0c646e888c999b03d1798e1aa1331937"
  },
  {
    "text": "U.S. Sen. Roger Marshall of Kansas introduces bill to deny transgender identity  —  U.S. Sen. Roger Marshall, a Kansas Republican, has introduced a bill to deny transgender identity. … Marshall Wednesday introduced the Defining Male and Female Act of 2024, which a press release from his office calls … ",
    "url": "https://www.advocate.com/politics/roger-marshall-anti-transgender-bill"
  },
  {
    "text": "Pam Bondi's road from Four Seasons Total Landscaping to AG pick should alarm America  —  The long, strange trip of the United States of America has taken a wild and dangerous right turn, and you can see the exact moment that Pam Bondi — Donald Trump's newest pick to become … ",
    "url": "https://www.inquirer.com/opinion/pam-bondi-ag-nomination-election-denial-20241124.html"
  },
  {
    "text": "Resignation shouldn't prevent the release of Gaetz report — it didn't stop us last time  —  Former Rep. Matt Gaetz (R-Fla.) has withdrawn his name from consideration for attorney general and said he would not be returning to the House.  But Gaetz, who announced his resignation … ",
    "url": "https://thehill.com/opinion/congress-blog/5005311-gaetz-resignation-ethics-report/"
  },
  {
    "text": "McBride says House Republicans' bathroom ban is ‘attempt to distract from what they are actually doing’  —  Rep.-elect Sarah McBride (D-Del.), the first transgender person elected to Congress, said Sunday that House Republicans' bathroom ban is an “attempt to distract from what they are actually doing.”",
    "url": "https://thehill.com/homenews/house/5007210-sarah-mcbride-house-republicans-bathroom-ban/"
  },
  {
    "text": "Donald Trump to kick transgender troops out of US military  —  An executive order could be signed as early as his first day back in the White House, which would force 15,000 people out of their posts  —  Donald Trump is planning an executive order that would lead to the removal … ",
    "url": "https://www.thetimes.com/world/us-world/article/donald-trump-transgender-troops-us-military-52xf5cdlc"
  },
  {
    "text": "Trump's plan to dismantle DEI on day one is a “colorblind” path to Jim Crow 2.0  —  Stephen Miller makes clear the subtext behind Trump's call to ban DEI  —  Donald Trump's vow to ban diversity, equity, and inclusion (DEI) initiatives in workplaces and educational institutions … ",
    "url": "https://www.salon.com/2024/11/24/plan-to-dismantle-dei-on-day-one-is-a-colorblind-path-to-jim-crow-20/"
  },
  {
    "text": "Chuck Woolery, smooth-talking game show host of ‘Love Connection’ and ‘Scrabble,’ dies at 83  —  Chuck Woolery, the affable, smooth-talking game show host of “Wheel of Fortune,” “Love Connection” and “Scrabble” who later became a right-wing podcaster, skewering liberals and accusing the government of lying about COVID-19, has died.",
    "url": "https://apnews.com/article/obituary-chuck-woolery-508f37c136ccbc4c8ad48a4fd582674b"
  },
  {
    "text": "Business donors overwhelmingly bet on the GOP.  Here's where it paid off.  —  The 2024 general election saw a flood of contributions from the crypto industry, banking and labor.  And then there was Elon Musk.  —  Thousands of industry donors poured over $425 million into the general election this year … ",
    "url": "https://www.politico.com/news/2024/11/24/business-election-donations-republicans-00191072"
  }
]