[
  {
    "text": "My Next Chapter  —  I'm leaving the House but not the fight.  —  I'm an optimist.  How could I not be?  I'm the son of a firefighter.  For 17 years I've served in the same congressional seat—the same office in which I was once denied an internship.  Only in America.",
    "url": "https://www.wsj.com/articles/kevin-mccarthy-my-next-chapter-house-gop-retirement-california-e4e593d7?mod=followamazon"
  },
  {
    "text": "Former speaker Kevin McCarthy will retire from Congress at end of year  —  Rep. Kevin McCarthy (R-Calif.), the former House speaker who was ousted from his position in October in a revolt by hard-right members, will not seek reelection to his congressional seat and will retire from Congress … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/kevin-mccarthy-retire/"
  },
  {
    "text": "Wisconsin Trump electors settle lawsuit, agree Biden won in 2020  —  MADISON, Wis. — In a legal settlement Wednesday, the 10 Republicans who signed official-looking paperwork falsely purporting Donald Trump won Wisconsin in 2020 have agreed to withdraw their inaccurate filings … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/wisconsin-trump-fake-electors-lawsuit/"
  },
  {
    "text": "Nevada GOP ‘fake electors’ indicted for falsely claiming Trump won state's 2020 election  —  A Nevada grand jury has indicted the six Republicans — including the chair of the Nevada Republican Party — who falsely pledged Nevada's electoral votes to Donald Trump following … ",
    "url": "https://thenevadaindependent.com/article/nevada-gop-fake-electors-indicted-for-falsely-claiming-trump-won-states-2020-election"
  },
  {
    "text": "Nevada grand jury indicts six pro-Trump fake electors  —  A Nevada grand jury has indicted six individuals who acted as fake electors in a scheme intended to overturn Joe Biden's 2020 election win, according to the state's attorney general.  —  The indictments make Nevada the third state … ",
    "url": "https://www.cnn.com/2023/12/06/politics/nevada-fake-electors-indicted/"
  },
  {
    "text": "Pro-Trump electors indicted in Nevada, the third state to issue charges  —  A Nevada grand jury on Wednesday charged six Republicans who claimed to be presidential electors in 2020 and submitted certificates to Congress falsely asserting that former president Donald Trump had won the election in their state.",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/nevada-fake-electors-indictment-trump/"
  },
  {
    "text": "Trump says he wouldn't be a dictator ‘except for Day One’  —  When asked during a Fox News town hall if he would seek retribution upon returning to office, the former president largely sidestepped the question  —  Former president Donald Trump said Tuesday that he would not be a dictator upon returning … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/06/trump-dictator-day-one-hannity/"
  },
  {
    "text": "Here are the top moments from Trump's ‘Hannity’ town hall  —  Trump touched on topics ranging from President Biden to dictatorships  —  Former President Trump joined Fox News' “Hannity” on Tuesday night for a town hall discussion on the GOP presidential primary, President Biden, dictatorships, and more.",
    "url": "https://www.foxnews.com/politics/top-moments-trumps-hannity-town-hall"
  },
  {
    "text": "Person of the Year  —  Taylor Swift  —  Taylor Swift is telling me a story, and when Taylor Swift tells you a story, you listen, because you know it's going to be good—not only because she's had an extraordinary life, but because she's an extraordinary storyteller.",
    "url": "https://time.com/6342806/person-of-the-year-2023-taylor-swift/"
  },
  {
    "text": "Senators look for Biden, McConnell to step up after Republicans block Ukraine funding bill  —  Senators in both parties are calling for President Biden and Senate Republican Leader Mitch McConnell (Ky.) to take a more active role in negotiations over a package to fund Ukraine and Israel … ",
    "url": "https://thehill.com/homenews/senate/4346248-biden-mcconnell-republicans-ukraine-funding/"
  },
  {
    "text": "EXCLUSIVE: Fulton prosecutors list top Trump aides, Ga. officials as witnesses  —  Ex-Justice Department leaders, VP Pence and Gov. Brian Kemp could be called  —  Fulton County prosecutors could call several senior officials who served in the Trump administration and Georgia's top elected leaders … ",
    "url": "https://www.ajc.com/politics/exclusive-fulton-prosecutors-list-top-trump-aides-ga-officials-as-witnesses/FC4RPKGUIVCVRDGS3VP37L6UXY/"
  },
  {
    "text": "‘This Is Grim,’ One Democratic Pollster Says  —  The predictive power of horse-race polling a year from the presidential election is weak at best.  The Biden campaign can take some comfort in that.  —  But what recent surveys do reveal is that the coalition that put Biden in the White House … ",
    "url": "https://www.nytimes.com/2023/12/06/opinion/biden-campaign-polls.html"
  },
  {
    "text": "17-year-old arrested, charged with carjacking FBI agent in DC  —  WASHINGTON - Police have arrested the suspect accused of carjacking an FBI agent in Northeast D.C. last week.  —  Court documents say 17-year-old Devonta Lynch is facing several charges in connection to the Nov. 29 incident … ",
    "url": "https://www.fox5dc.com/news/fbi-agent-carjacked-in-dc-17-year-old-arrested-less-than-a-week-after-stealing-car-police-say"
  },
  {
    "text": "America's White Evangelical Problem  —  When the journalist Tim Alberta's father unexpectedly died, another ordeal awaited Tim.  His father had pastored the Cornerstone Evangelical Presbyterian church in Michigan, where the Alberta family now gathered to honor his life alongside the congregation the father had nurtured.",
    "url": "https://nymag.com/intelligencer/2023/12/tim-alberta-book-review-americas-white-evangelical-problem.html"
  },
  {
    "text": "George Santos is earning six figures from Cameo videos  —  The Scene  —  Just before 6 p.m. on Tuesday, George Santos was at Best Buy on Northern Boulevard in Queens.  —  Santos, whose biography on the celebrity video platform Cameo identifies him as a “Former congressional ‘Icon’!",
    "url": "https://www.semafor.com/article/12/06/2023/george-santos-is-earning-six-figures-from-cameo-videos"
  },
  {
    "text": "Kyiv assassinates pro-Russian Ukrainian politician outside Moscow: reports  —  Kyiv claimed credit on Wednesday for orchestrating the assassination of former Ukrainian lawmaker Illya Kyva, who was convicted of high treason and was living in hiding in Russia.",
    "url": "https://thehill.com/policy/international/4346012-kyiv-assassinate-russia-ukraine-moscow/"
  },
  {
    "text": "Targeting costly meds, Biden admin asserts authority to seize certain drug patents  —  The decision could give the president another tool to use in his effort to lower drug prices.  —  The Biden administration has determined that it has the authority to seize the patents of certain high-priced medicines … ",
    "url": "https://www.politico.com/news/2023/12/06/biden-admin-authority-seize-certain-drug-patents-00130452"
  },
  {
    "text": "Statement from President Joe Biden on Another Nearly $5 Billion in Debt Relief for Over 80,000 Student Loan Borrowers  —  This brings total approved debt cancellation by the Biden-Harris Administration to $132 billion for over 3.6 million Americans  —  Today my Administration … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/06/statement-from-president-joe-biden-on-another-nearly-5-billion-in-debt-relief-for-over-80000-student-loan-borrowers/"
  },
  {
    "text": "Norman Lear, TV Legend, Dies at 101  —  Writer-producer-developer Norman Lear, who revolutionized American comedy with such daring, immensely popular early-'70s sitcoms as “All in the Family” and “Sanford and Son,” died on Tuesday.  He was 101.  —  Lear's publicist confirmed to Variety … ",
    "url": "https://variety.com/2023/tv/news/norman-lear-dead-dies-tv-legend-all-in-the-family-1235823995/"
  },
  {
    "text": "NYC Mayor Adams' Approval Sinks To Record Low, Under Fire On Several Fronts, Quinnipiac University New York City Poll Finds; Most Voters Worry Budget Cuts Will Affect Their Daily Lives  —  mail_outline  —  As New York City Mayor Eric Adams nears the end of his second year in office … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3886"
  },
  {
    "text": "House votes to block Biden EV rule  —  The House on Wednesday voted in favor of blocking a Biden administration rule that's expected to shift car sales in the U.S. significantly toward electric vehicles.  —  The vote was 221-197.  —  The rule in question could move car sales as far as to reach two-thirds electric by 2032.",
    "url": "https://thehill.com/policy/energy-environment/4346021-house-votes-to-block-biden-ev-rule/"
  },
  {
    "text": "Sean Combs Accused of ‘Gang Rape’ of 17-Year-Old in New Lawsuit  —  Jane Doe alleges Combs, former Bad Boy president Harve Pierre, and a third man trafficked and raped her at Combs' New York recording studio in 2003  —  SEAN COMBS, HIS longtime lieutenant Harve Pierre … ",
    "url": "https://www.rollingstone.com/music/music-news/diddy-sued-by-fourth-accuser-1234917410/"
  },
  {
    "text": "Are We Shocked a Dem Rep Said This About Florida and Texas?  —  It's one of those moments where you hear Winston Churchill's remarks about democracy: the most significant argument against it is five minutes with the average voter.  Yes, we're a constitutional republic, but you get the point.",
    "url": "https://townhall.com/tipsheet/mattvespa/2023/12/06/dem-rep-florida-and-texas-are-deplorable-states-n2632046"
  },
  {
    "text": "Suspect ID'd in Texas shooting spree that left 6 dead, 3 injured  —  A suspect was arrested after the shootings in Austin and near San Antonio.  —  Police investigate a crime scene in Austin, Texas, after a series of shootings in Austin and near San Antonio on Dec. 5, 2023.",
    "url": "https://abcnews.go.com/US/suspect-arrested-after-shootings-austin-san-antonio-leave/story?id=105412955"
  }
]