[
  {
    "text": "US to Israel: Don't do something you'll regret  —  In private calls and public moves, President Joe Biden and his aides are pointing to reasons to look for an off-ramp.  —  The Biden administration's main message for Israel following Iran's aerial assault comes down to this: Stop and think.",
    "url": "https://www.politico.com/news/2024/04/14/us-israel-responding-iran-00152150"
  },
  {
    "text": "Israel Repelled Iran's Huge Attack.  But Only With Help From U.S. and Arab Partners.  —  Working with partners, it fended off worst of Iranian strikes; what comes next will test powers in the Middle East and beyond  —  Saturday's Iranian strike on Israel was huge by any standard.",
    "url": "https://www.wsj.com/world/middle-east/analysis-israel-repelled-irans-huge-attack-but-only-with-help-from-u-s-and-arab-partners-a7844065"
  },
  {
    "text": "American Anti-War Activists Cheer for Iran's War  —  At a left-wing conference in Chicago, activists believe Iran is ‘part of the arc of resistance because the enemies are Israel and the USA.’  —  CHICAGO — About 300 anti-war activists crowded into the basement of the Teamsters Union's headquarters … ",
    "url": "https://www.thefp.com/p/american-anti-war-activists-cheer"
  },
  {
    "text": "How to pick a jury that can judge Donald Trump  —  Tailoring questions to probe prospective jurors' political biases and opinions of the former president is more art than science.  —  Former President Donald Trump's criminal trial in New York begins Monday with an immediate and fundamental challenge … ",
    "url": "https://www.politico.com/news/2024/04/14/jury-selection-donald-trump-00151962"
  },
  {
    "text": "Trump attorney calls hush money case a ‘6-week-long media extravaganza’  —  An attorney for former President Trump brushed off the significance of his first criminal trial, which is scheduled to begin Monday, saying the case is merely a “six-week-long media extravaganza.”",
    "url": "https://thehill.com/regulation/court-battles/4593635-trump-attorney-call-hush-money-case-a-six-week-long-media-extravaganza/"
  },
  {
    "text": "COULD YOU JUDGE TRUMP IMPARTIALLY?  —  Here is what 12 New Yorkers said.  —  When Donald Trump walks into a Manhattan courtroom on Monday, it will kick off a process unprecedented in American history: jury selection for a former president's criminal trial.",
    "url": "https://www.washingtonpost.com/politics/interactive/2024/jury-trump-new-york-hush-money-trial/"
  },
  {
    "text": "Democrats descend on Chicago as specter of '68 convention looms  —  Protests over Israel-Gaza war expected as party nominates President Joe Biden.  —  Democrats from across the country are converging in Chicago this week to lay the groundwork for their upcoming convention … ",
    "url": "https://www.politico.com/news/2024/04/15/democrats-chicago-convention-unrest-00152164"
  },
  {
    "text": "Pentagon Reviews Events Before Attack That Killed 13 U.S. Troops in Kabul  —  A team conducted new interviews to address lingering questions about the bombing in the final days of U.S. military involvement in Afghanistan.  —  A new Pentagon review of the events leading up to the bombing … ",
    "url": "https://www.nytimes.com/2024/04/15/us/politics/us-troops-kabul-airport-bombing.html"
  },
  {
    "text": "Mark Cuban says he's proud to pay $288 million in taxes this year, unlike a certain former president  — Mark Cuban says he'll be paying $288 million in taxes to the IRS.  — “I pay what I owe,” Cuban wrote on X.  — The billionaire says he's “proud to pay my taxes every single year,” unlike one ex-president.",
    "url": "https://www.businessinsider.com/mark-cuban-proud-to-pay-taxes-unlike-certain-ex-president-2024-4"
  },
  {
    "text": "Scoop: Teamsters make another move toward GOP … - In the past, the PAC has given overwhelmingly to Democrats, but Hawley has made a point to align himself with the labor movement, joining picket lines with the Teamsters and the United Auto Workers.  — In total, Hawley's … ",
    "url": "https://www.axios.com/2024/04/14/teamsters-donation-josh-hawley-senate-republicans"
  },
  {
    "text": "‘The damage is done’: Ruben Gallego says repealing Arizona's near-total abortion ban now would be too little, too late  —  Gallego argued a repeal through the state is just the first step in rectifying what he sees as injustice.  —  PHOENIX — Democratic Rep. Ruben Gallego argued this week … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ruben-gallego-says-repealing-arizonas-total-abortion-ban-now-little-la-rcna147734"
  },
  {
    "text": "Donald Trump's Rambling Rally Speech Raises Questions  —  Donald Trump's mention of the “beautiful” Battle of Gettysburg during a campaign rally in Schnecksville, Pennsylvania, on Saturday got the former president some attention on social media, with users wondering what his rambling “rant” was about.",
    "url": "https://www.newsweek.com/donald-trump-rambling-rally-speech-raises-questions-1890121"
  },
  {
    "text": "Migration's human toll overwhelms a border county in Texas  —  EAGLE PASS, Tex. — The undertaker lighted a cigarette and held it between his latex-gloved fingers as he stood over the bloated body bag lying in the bed of his battered pickup truck.  —  The woman had been fished out of the Rio Grande minutes earlier.",
    "url": "https://www.washingtonpost.com/nation/interactive/2024/texas-border-eagle-pass-migrant-deaths/"
  },
  {
    "text": "If convicted this year, Trump could lose the right to vote for himself  —  Pundits and analysts have spent much of the past year debating the political impact should Donald Trump be convicted before November's election of any of the 88 felony charges he faces.",
    "url": "https://npr.org/2024/04/14/1240672009/trump-conviction-voting-rights"
  }
]