[
  {
    "text": "Arizona Republicans condemn their own abortion policy  —  On Tuesday, the Arizona Supreme Court issued a bombshell decision banning virtually all abortions in the state.  The majority found that since the Supreme Court overturned Roe v. Wade, a near-total ban from 1864 — before Arizona was a state — was back in effect.",
    "url": "https://popular.info/p/arizona-republicans-condemn-their"
  },
  {
    "text": "The Self-Immolation of the AZ GOP  —  Inflation is still running a little hot, according to the Department of Labor.  Overall inflation was at 3.5 percent year-over-year, with more stable “core” inflation at 3.8 percent.  While it's moving in the right direction, it's not returning … ",
    "url": "https://www.thebulwark.com/p/the-self-immolation-of-the-az-gop"
  },
  {
    "text": "Trump's Big Lie About Biden Implodes After MAGA Ally Admits Truth  —  Steve Bannon no doubt thought he was being deviously clever.  Speaking with The New York Times this week, he elaborated on a sophisticated plan that Donald Trump's allies have developed for boosting third-party candidates, so they siphon votes from President Biden.",
    "url": "https://newrepublic.com/article/180617/steve-bannon-trump-lies-biden-jill-stein"
  },
  {
    "text": "Jeffries: Democrats won't help Johnson break FISA impasse  —  House Minority Leader Hakeem Jeffries (D-N.Y.) said Thursday that Democrats will not help GOP leaders with a procedural vote to advance legislation extending the government's surveillance powers.  —  Nineteen conservative Republicans … ",
    "url": "https://thehill.com/homenews/house/4588868-jeffries-johnson-fisa-impasse/"
  },
  {
    "text": "Biden Administration Is Closing the ‘Gun Show Loophole’  —  HOLSTERED  —  People selling firearms at gun shows and elsewhere will now be required to carry out background checks on their customers.  —  The Biden administration on Thursday announced that it is moving to close … ",
    "url": "https://www.thedailybeast.com/biden-administration-is-closing-the-gun-show-loophole"
  },
  {
    "text": "An Honest Assessment of Rural White Resentment Is Long Overdue … Something remarkable happened among rural whites between the 2016 and 2020 elections: According to the Pew Research Center's validated voter study, as the rest of the country moved away from Donald Trump … ",
    "url": "https://newrepublic.com/article/180570/trump-rural-white-resentment-honest-assessment"
  },
  {
    "text": "Florida 2024 Poll: Plurality Plan to Vote “Yes” on Abortion Protection Ballot Measure  —  A new Emerson College Polling survey in Florida finds 42% of voters plan to vote yes on the November ballot measure that will provide a constitutional right to abortion before fetal viability, 32% are unsure, and 25% will vote no.",
    "url": "https://emersoncollegepolling.com/florida-2024-poll-plurality-plan-to-vote-yes-on-abortion-protection-ballot-measure/"
  },
  {
    "text": "Mike Johnson and Donald Trump will propose bill to prevent non-citizens from voting  —  WASHINGTON - House Speaker Mike Johnson will introduce a bill with former President Donald Trump at his Mar-a-Lago residence aimed at preventing non-citizens from voting.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/11/mike-johnson-donald-trump-election-integrity-bill/73289385007/"
  },
  {
    "text": "A Trump raising money off election lies?  Now we've seen everything.  —  A phone call on behalf of the overhauled Republican National Committee again turns false claims about 2020 into a sales pitch  —  Donald Trump managed to vacuum up hundreds of millions of dollars of donations as a lame-duck president.",
    "url": "https://www.washingtonpost.com/politics/2024/04/11/trump-election-fraud-fundraising/"
  },
  {
    "text": "Bill to make marrying your first cousin illegal in Tennessee passes but not without a fight  —  Two Republican lawmakers voted against making marriage between first cousins illegal in Tennessee.  —  NASHVILLE, Tenn. (WSMV) - The Tennessee House passed a bill on Thursday that would make it illegal … ",
    "url": "https://www.wsmv.com/2024/04/11/bill-make-marrying-your-first-cousin-illegal-tennessee-passes-not-without-fight/"
  },
  {
    "text": "RFK Jr. Campaign Fires Staffer Who Said the Quiet Part Out Loud  —  RFK Jr.'s campaign has dismissed a staffer who said a Trump reelection was all right because her “number one priority” was defeating Biden … On Wednesday, the Kennedy camp quietly announced that Rita Palma had been removed from their roster.",
    "url": "https://www.rollingstone.com/politics/politics-news/rfk-fires-staffer-endorsed-trump-reelection-1235002839/"
  },
  {
    "text": "Trump's Brain Is Not Okay  —  An expert's view of Trump's mental slide into dementia.  —  The Big Picture and Jay Kuo … When Duty to Warn began in 2017, our mission as mental health professionals was to warn the world that Trump was dangerously unfit and a malignant narcissist.",
    "url": "https://thinkbigpicture.substack.com/p/john-gartner-trump-cognitive-decline"
  },
  {
    "text": "Georgia's Lieutenant Governor to Face Inquiry for Role as Fake Trump Elector  —  Fani T. Willis, the district attorney of Fulton County, Ga., had been disqualified from pursuing the case against Lt. Gov. Burt Jones, but another prosecutor said he would now take it over.",
    "url": "https://www.nytimes.com/2024/04/11/us/burt-jones-trump-georgia.html"
  },
  {
    "text": "Former Star Wars actress criticizes double standard for her ‘absurd’ cancellation  —  .  —  Former Star Wars actress Gina Carano criticized the Walt Disney Company for firing her in a new interview, arguing the company had a double standard when she shared her political views.",
    "url": "https://www.washingtonexaminer.com/news/business/2962835/former-star-wars-actress-criticizes-double-standard-for-her-absurd-cancellation/"
  },
  {
    "text": "O.J. Simpson, Football Star Whose Trial Riveted the Nation, Dies at 76  —  He ran to football fame and made fortunes in movies.  His trial for the murder of his former wife and her friend became an inflection point on race in America.  —  O.J. Simpson, who ran to fame on the football field … ",
    "url": "https://www.nytimes.com/2024/04/11/sports/oj-simpson-dead.html"
  },
  {
    "text": "Truong My Lan: Vietnamese billionaire sentenced to death for $44bn fraud  —  Truong My Lan is accused of looting one of Vietnam's largest banks over a period of 11 years  —  It was the most spectacular trial ever held in Vietnam, befitting one of the greatest bank frauds the world has ever seen.",
    "url": "https://www.bbc.com/news/world-asia-68778636"
  },
  {
    "text": "Trump campaign demands Biden debate him ‘much earlier’ and more often  —  The Trump campaign is asking for additional debates and for the showdowns to begin much earlier than initially scheduled  —  EXCLUSIVE: The Trump campaign is calling for additional 2024 presidential debates and for them to take place … ",
    "url": "https://www.foxnews.com/politics/trump-campaign-debates-biden-much-earlier-more-often"
  },
  {
    "text": "Florida can't ban teacher from asking students to use her preferred pronouns, judge rules  —  Katie Wood, a transgender algebra teacher, has long gone by ‘Ms Wood’ but the law required students to say ‘Teacher Wood’  —  Florida cannot prohibit a 10th-grade math teacher from asking her students … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/11/florida-pronouns-teacher"
  },
  {
    "text": "Biden Plans Sweeping Effort to Block Arctic Oil Drilling  — Half of National Petroleum Reserve-Alaska could be off-limits  — Companies say plan would violate leases, kill investment  —  The US set aside 23 million acres of Alaska's North Slope to serve as an emergency oil supply a century ago.",
    "url": "https://www.bloomberg.com/news/articles/2024-04-11/biden-plans-sweeping-effort-to-block-arctic-oil-drilling"
  },
  {
    "text": "Bankruptcy documents detail how GOP NC governor nominee Mark Robinson failed to file federal income taxes for 5 years  —  Mark Robinson claims Democrats have caused the “death” of “responsibility.”  —  North Carolina Lieutenant Governor Mark Robinson, whom Republican presidential candidate … ",
    "url": "https://abcnews.go.com/US/bankruptcy-documents-detail-gop-nc-governor-nominee-mark/story?id=108763847"
  },
  {
    "text": "Men Rescued From Desert Island Thanks to Giant ‘HELP’ Sign  —  SOS  —  The trio had been stranded for over a week and surviving on coconut meat.  —  Three mariners were rescued from a remote atoll in the Pacific on Tuesday after a U.S. Navy plane spotted a sign reading “HELP” … ",
    "url": "https://www.thedailybeast.com/men-rescued-from-desert-island-thanks-to-giant-help-sign"
  },
  {
    "text": "Biden plans to expand two national monuments in California  —  The president is expected to enlarge the San Gabriel Mountains National Monument and the Berryessa Snow Mountain National Monument  —  President Biden plans to expand the boundaries of two national monuments in California in the coming weeks … ",
    "url": "https://www.washingtonpost.com/climate-solutions/2024/04/11/biden-monuments-berryessa-san-gabriel/"
  },
  {
    "text": "Big donation to Rudy Giuliani defense fund is target of lawsuit alleging fraud by donor … Former New York Mayor Rudy Giuliani departs the U.S. District Courthouse after he was ordered to pay $148 million in his defamation case in Washington, U.S., December 15, 2023.",
    "url": "https://www.cnbc.com/2024/04/11/lawsuit-targets-donation-to-rudy-giuliani-defense-fund-.html"
  },
  {
    "text": "Republican leaders go to the mat to protect judge shopping  —  When you've lost John Roberts ...  Besides the fact that Trump was able to stuff the federal courts with Federalist Society hard-line judges, conservatives have another tool at their disposal: rampant judge shopping.",
    "url": "https://www.publicnotice.co/p/judge-shopping-new-judicial-conference-policy"
  },
  {
    "text": "Many Patients Don't Survive End-Stage Poverty  —  He has an easy smile, blue eyes and a life-threatening bone infection in one arm.  Grateful for treatment, he jokes with the medical intern each morning.  A friend, a fellow doctor, is supervising the man's care.",
    "url": "https://www.nytimes.com/2024/04/11/opinion/doctor-safety-net-hospital.html"
  }
]