[
  {
    "text": "Scoop: Elon Musk joined Trump's call with Zelensky … - The Biden administration is now looking for ways to get as much military assistance as possible to Ukraine ahead of Jan. 20, when Trump could turn off the spigot.  — But the private conversations Trump and his team have had with Zelensky … ",
    "url": "https://www.axios.com/2024/11/08/musk-trump-zelensky-ukraine-call"
  },
  {
    "text": "Trump Put Musk on Phone With Zelensky During Call  —  Elon Musk was with Donald Trump at Mar-a-Lago when the president-elect spoke with Ukraine's leader.  It is not clear if they discussed any change in U.S. policy toward Ukraine.  —  President-elect Donald J. Trump spoke on Wednesday … ",
    "url": "https://www.nytimes.com/2024/11/08/us/politics/trump-musk-zelensky.html?unlocked_article_code=1.YU4.IeTL.0A1I6CIR9Fhj&smid=url-share"
  },
  {
    "text": "Why Does No One Understand the Real Reason Trump Won? … I've had a lot of conversations since Tuesday revolving around the question of why Donald Trump won.  The economy and inflation.  Kamala Harris didn't do this or that.  Sexism and racism.  The border.  That trans-inmate ad that ran a jillion times.",
    "url": "https://newrepublic.com/post/188197/trump-media-information-landscape-fox"
  },
  {
    "text": "America's political discordance: The Trump voters who want progressivism  —  Trump voters backed abortion, minimum wage and family leave — but don't get that Project 2025 would take it away  —  Perhaps out of fear of insulting their audiences, the pundits, journalists … ",
    "url": "https://www.salon.com/2024/11/08/americas-political-discordance-the-want-progressivism/"
  },
  {
    "text": "Kamala Harris' campaign didn't ignore working class voters  —  The Biden administration was staunchly pro-labor, subsidized Obamacare and managed to avoid a recession.  But Trump and Republicans sold resentment, and it worked.  —  Since Tuesday night's election results were tallied … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/biden-harris-working-class-vote-trump-election-rcna179186"
  },
  {
    "text": "Pentagon officials discussing how to respond if Trump issues controversial orders  —  Pentagon officials are holding informal discussions about how the Department of Defense would respond if Donald Trump issues orders to deploy active-duty troops domestically and fire large swaths of apolitical staffers, defense officials told CNN.",
    "url": "https://www.cnn.com/2024/11/08/politics/pentagon-officials-discussing-trump/"
  },
  {
    "text": "Biden administration to allow American military contractors to deploy to Ukraine for first time since Russia's invasion  —  The Biden administration has lifted a de facto ban on American military contractors deploying to Ukraine to help the country's military maintain and repair US-provided weapons systems … ",
    "url": "https://www.cnn.com/2024/11/08/politics/biden-administration-american-military-contractors-deploy-ukraine/"
  },
  {
    "text": "Pentagon officials anxious Trump may fire the military's top general  —  The president-elect has railed against “woke” generals and others who have pushed for diversity initiatives in the ranks.  —  Defense officials are getting anxious about the possibility of the incoming Trump administration firing … ",
    "url": "https://www.politico.com/news/2024/11/08/pentagon-trump-fire-cq-brown-00188536"
  },
  {
    "text": "Dem Insiders Begged Team Harris Not to Campaign With Liz Cheney  —  “People don't want to be in a coalition with the devil,” says a Democratic source who was appalled by Harris' embrace of Dick Cheney … It opened with the politics of joy, and a hearty dose of mockery aimed at Donald Trump and his running mate, J.D. Vance.",
    "url": "https://www.rollingstone.com/politics/politics-features/harris-cheney-democrats-campaign-trump-election-2024-1235158805/"
  },
  {
    "text": "Three charged in alleged Iranian plot that included plans to kill Trump  —  A person briefed on the investigation, speaking on the condition of anonymity to discuss it, said two of the individuals are in custody.  —  NEW YORK — Three men have been charged in connection with an alleged Iranian plot … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/08/trump-iran-arrested-assassination-attempt/"
  },
  {
    "text": "Pelosi Laments Biden's Late Exit and the Lack of an ‘Open Primary’  —  “Had the president gotten out sooner, there may have been other candidates in the race,” the former House speaker said in an interview with The New York Times, suggesting she had anticipated an “open primary.”",
    "url": "https://www.nytimes.com/2024/11/08/us/politics/pelosi-harris-biden-open-primary.html"
  },
  {
    "text": "A Red-District Conqueror Wants Fellow Democrats to Look in the Mirror  —  Representative Marie Gluesenkamp Perez, who is on track to win re-election in a rural Washington district, says her party needs to stop demonizing others and change the candidates it supports.  —  It's not always fun to say I told you so.",
    "url": "https://www.nytimes.com/2024/11/08/us/politics/marie-gluesenkamp-perez-interview.html"
  },
  {
    "text": "What is the 4B movement?  —  In the aftermath of Donald Trump's historic US election win, some women on social media have been advocating for a movement which originated in South Korea to stand against authority.  —  A feminist movement which originated in South Korea has been taking off … ",
    "url": "https://news.sky.com/story/what-is-the-4b-movement-13250004"
  },
  {
    "text": "Progressives Urge Senate Dems To Confirm All Of Biden's Court Picks In Lame Duck  —  Biden's judges will “serve as one of the last guardrails in upholding our nation's laws and the Constitution,” said Maggie Jo Buchanan of Demand Justice.  —  LOADING  —  WASHINGTON — Welp.",
    "url": "https://www.huffpost.com/entry/senate-democrats-lame-duck-biden-judges_n_672e58e2e4b0933e82c9ed15"
  },
  {
    "text": "This Democratic defeat — and the rise of Trump 2.0 — was a decade in the making  —  Analysis: Biden's age and inability to sell his record or convince that he was fighting inflation were problems.  Longer-term Democratic weaknesses also came due.  —  There's something about an election … ",
    "url": "https://www.nbcnews.com/politics/elections/chuck-todd-democratic-defeat-rise-trump-20-was-decade-making-rcna179175"
  },
  {
    "text": "US judge tosses Illinois' ban on semiautomatic weapons, governor pledges swift appeal  —  A federal judge on Friday overturned Illinois' ban on semiautomatic weapons, leaning on recent U.S. Supreme Court rulings that strictly interpret the Second Amendment right to keep and bear firearms.",
    "url": "https://apnews.com/article/illinois-semiautomatic-weapons-ban-tossed-appeal-b115223e9e49d36c16ac5a1206892919"
  },
  {
    "text": "Racist texts about slaves and ‘picking cotton’ sent to Black people as state AGs, colleges and police probe their origins  —  Authorities across the United States are investigating after racist text messages - some with references to “slave catchers” and “picking cotton” … ",
    "url": "https://www.cnn.com/2024/11/07/us/racist-text-messages-post-election"
  },
  {
    "text": "Trump just made $500 million with a single Truth Social post  —  President-elect Donald Trump's social media stock had been sinking fast after a short-lived, post-election-victory surge this week.  Then, with a single post on Truth Social, he helped boost the stock again - and added a half billion dollars to his net worth as a result.",
    "url": "https://www.cnn.com/2024/11/08/investing/truth-social-stock-trump/"
  },
  {
    "text": "Wind the clock  —  A message to those asking “what do I do now?”  —  1×  —  I had allowed myself to hope that American voters would choose the better of the presidential options available to us, and I was wrong.  I am disappointed.  I am sad.  I am afraid.",
    "url": "https://www.citationneeded.news/wind-the-clock/"
  },
  {
    "text": "Israeli soccer fans were attacked in Amsterdam.  The violence was condemned as antisemitic  —  Israeli fans were assaulted after a soccer game in Amsterdam by hordes of young people apparently riled up by calls on social media to target Jewish people, Dutch authorities said Friday.",
    "url": "https://apnews.com/article/maccabi-tel-aviv-amsterdam-violence-protests-palestinian-bcea212281f682098c4c77ef552af5f1"
  },
  {
    "text": "‘Was it even a winnable cycle?’  John Fetterman reckons with red Pennsylvania  —  The News  —  John Fetterman worried all year about Democrats' ability to win his state.  On Thursday, he wasn't happy — but he was vindicated.  The Pennsylvania senator, who won his 2022 race after a stroke … ",
    "url": "https://www.semafor.com/article/11/08/2024/was-it-even-a-winnable-cycle-john-fetterman-reckons-with-red-pennsylvania"
  },
  {
    "text": "Rep. Jared Moskowitz says he was target of potential assassination plot  —  A suspect was arrested near his Florida residence, the congressman says, citing police  —  Rep. Jared Moskowitz (D-Florida) said in a statement on Friday that he was recently notified by police that he was the target … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/08/jared-moskowitz-assassination-attempt-florida/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxMDQyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyNDI0Mzk5LCJpYXQiOjE3MzEwNDIwMDAsImp0aSI6ImUzYWY5OGNlLTc2OGItNGIzMS1iNDkwLTgwMmZhZTViMzQ0NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzA4L2phcmVkLW1vc2tvd2l0ei1hc3Nhc3NpbmF0aW9uLWF0dGVtcHQtZmxvcmlkYS8ifQ.naf9-oLSo8TcCTTiXHOqMQI78rMLJz6MqYzrihy8zOc&itid=gfta"
  },
  {
    "text": "Thousands expected for People's March on Washington ahead of Trump's inauguration  —  Organizers estimate 50,000 will attend as part of an expected surge of protests — and celebrations — from across the political spectrum as the nation's seat of power transitions to Trump",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/11/07/peoples-march-washington-trump-inauguration-dc/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwOTU1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyMzM3OTk5LCJpYXQiOjE3MzA5NTU2MDAsImp0aSI6IjBiYWQyNGQ1LTliMTItNDI1Ni1hMjFhLTMyMDg2MDAxMmM2NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI0LzExLzA3L3Blb3BsZXMtbWFyY2gtd2FzaGluZ3Rvbi10cnVtcC1pbmF1Z3VyYXRpb24tZGMvIn0.ausDEkibktP-OJ57sZeyQmggqTngR64_OJjASFT9CoM"
  },
  {
    "text": "Exclusive: RFK Jr. Is Crowdsourcing Cabinet Picks for Trump  —  “Bobby cannot do this alone, so he is now turning to the wisdom and expertise of his supporters.”  —  Just days after former President Donald Trump won the presidential election, his onetime-opponent turned supporter … ",
    "url": "https://www.motherjones.com/politics/2024/11/exclusive-rfk-jr-is-crowdsourcing-cabinet-picks-for-trump/"
  },
  {
    "text": "Ted Cruz's daughter caught wincing and telling her mom 'don't clap' as senator praises Trump on stage  —  Caroline Cruz, 16, was left scowling at her mother on stage as the Texas senator prayed for a Trump win  —  Your support helps us to tell the story  —  From reproductive rights … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/ted-cruz-daughter-caroline-trump-election-b2643637.html"
  },
  {
    "text": "Chinese national jailed on charges that he tried to enter Trump's Mar-a-Lago estate  —  A Chinese national was ordered held Friday on trespassing charges after police say he tried to enter President-elect Donald Trump's Mar-a-Lago estate in violation of a court order that he stay away following previous attempts.",
    "url": "https://apnews.com/article/trump-maralago-intruder-24c163f8d952f98ac6a974cfef320947"
  },
  {
    "text": "Hochul moves to revive Manhattan toll plan after Trump win  —  The New York governor is looking to enact the delayed policy before Trump takes office.  —  SAN JUAN — New York Gov. Kathy Hochul has taken a step to revive congestion pricing before President-elect Donald Trump, who opposes the extra toll, takes office.",
    "url": "https://www.politico.com/news/2024/11/08/congestion-pricing-kathy-hochul-tolling-new-york-00188477"
  },
  {
    "text": "Voters Dismiss Two of California's Leading Progressive Prosecutors  —  Los Angeles' George Gascón and Oakland's Pamela Price sought to use their offices to redress the harms and disparities of the criminal legal system.  Both suffered large defeats this week.",
    "url": "https://boltsmag.org/california-progressive-prosecutors-gascon-price-lose-elections/"
  }
]