[
  {
    "text": "Harris holds slight national lead over Trump, Post-ABC-Ipsos poll finds  —  The result is a notable improvement for Democrats in a contest that a little more than a month ago showed Biden and Trump in a dead heat.  —  Vice President Kamala Harris holds a narrow lead over former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/18/harris-trump-post-abc-ipsos-poll/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzOTUzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MzM1OTk5LCJpYXQiOjE3MjM5NTM2MDAsImp0aSI6IjA3MGRlYWZlLTBkY2QtNGMxOS04NDQ3LTNmYTU5ZWY5MmExNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzE4L2hhcnJpcy10cnVtcC1wb3N0LWFiYy1pcHNvcy1wb2xsLyJ9.R1Q9c_XYrIEXHkuCsHs8SUUVMarHbrzvNFB95MbmSyk&itid=gfta"
  },
  {
    "text": "Behind the Curtain: Trump's devil-in-Georgia problem … Yet Trump himself has made this make-or-break state dramatically more breakable by torching its popular Republican governor, Brian Kemp, bluntly and repeatedly.  — “He's a bad guy. … - “Little Brian, little Brian Kemp,” Trump continued.",
    "url": "https://www.axios.com/2024/08/18/trump-2024-election-georgia-brian-kemp"
  },
  {
    "text": "CBS News poll: Gender gap, enthusiasm, economy make for tight Harris-Trump race on Democratic convention eve  —  When Kamala Harris became the Democratic presidential nominee, the party saw a major surge in enthusiasm from its voters.  It pulled the party into an effectively even race … ",
    "url": "https://www.cbsnews.com/news/new-poll-kamala-harris-policies-trump-democratic-convention-2024/"
  },
  {
    "text": "Trump Has Turned Over an Old Leaf  —  By the time Donald Trump announced his 2024 campaign for president, the idea of a “new Trump” had become a running gag, taken seriously only by the most credulous reporters and most desperately optimistic Republican officeholders.",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/trump-has-turned-over-old-leaf/679494/"
  },
  {
    "text": "Sen. Lindsey Graham: ‘Trump the provocateur, the showman may not win this election’  —  The South Carolina senator urged his fellow Republicans to campaign for former President Donald Trump, but added that Trump needs to focus more on policy.  —  South Carolina GOP Sen. Lindsey Graham … ",
    "url": "https://www.nbcnews.com/politics/2024-election/lindsey-graham-trump-provocateur-showman-may-not-win-election-rcna167060"
  },
  {
    "text": "Trump escalates gendered personal insults against Harris, defying GOP pressure  —  The Republican nominee also stoked Democrats' rift over Israel by baselessly claiming Harris passed over Gov. Josh Shapiro to be her running mate because he is Jewish.  —  WILKES-BARRE, Pa. … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/17/trump-harris-presidential/"
  },
  {
    "text": "Trump continues personal attacks against Harris: 'I'm a better looking person'  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/4833044-trump-digs-in-on-personal-attacks-against-harris-im-a-better-looking-person/"
  },
  {
    "text": "Inciting rioters in Britain was a test run for Elon Musk.  Just see what he plans for America  —  The presidential election is three months away.  What if the billionaire contests the result?  What if he decides democracy is over-rated?  —  Just over four years ago … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/aug/18/inciting-rioters-in-britain-was-a-test-run-for-elon-musk-just-see-what-he-plans-for-america"
  },
  {
    "text": "Protesters paused to consider opposing Harris at the DNC.  They decided on full steam ahead.  —  There are at least six major protests planned during the DNC in Chicago.  —  CHICAGO — There was a moment after Vice President Kamala Harris was tapped to run for president … ",
    "url": "https://www.politico.com/news/2024/08/18/dnc-protests-gaza-kamala-harris-00174497"
  },
  {
    "text": "Illinois Gov. JB Pritzker Promises to Arrest ‘Troublemaker’ DNC Protesters  —  STAY PEACEFUL  —  Illinois Gov. JB Pritzker had a forceful message on Sunday for protestors arriving in Chicago for the Democratic National Convention: if you get violent, you're getting locked up.",
    "url": "https://www.thedailybeast.com/illinois-gov-jb-pritzker-promises-to-arrest-troublemaker-dnc-protesters"
  },
  {
    "text": "Far-right influencers turn against Trump campaign  —  Hard-right provocateurs take aim at how the former president's aides are positioning him for the November vote — though not at the Republican candidate himself.  —  Some of the internet's most influential far-right figures are turning … ",
    "url": "https://www.washingtonpost.com/technology/2024/08/18/trump-campaign-nick-fuentes-groypers-hard-right-criticism/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzOTUzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MzM1OTk5LCJpYXQiOjE3MjM5NTM2MDAsImp0aSI6IjBkMDFlZjEwLTA3N2EtNGNiNC05NDc3LTg5N2U1NmM3NzJhYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDgvMTgvdHJ1bXAtY2FtcGFpZ24tbmljay1mdWVudGVzLWdyb3lwZXJzLWhhcmQtcmlnaHQtY3JpdGljaXNtLyJ9.pIOGmhr5u28NfLiHRA8SU1hyMTb4pOkB1u6nxEe0uZ4&itid=gfta"
  },
  {
    "text": "Michelle Obama to address Democratic Convention on Tuesday … - NBC News was first to report the Tuesday speaking slot. … - The DNC will kickoff on Monday, with President Biden headlining opening night and former Secretary of State Hillary Clinton also speaking.",
    "url": "https://www.axios.com/2024/08/18/michelle-obama-dnc-speech-night"
  },
  {
    "text": "Six Takeaways From the Magazine's Profile of Joe Biden  —  His decision to quit the race ended a remarkable chapter in American political history — and started one that may yet define his legacy.  —  Joe Biden dreamed of one day becoming president nearly all his life.",
    "url": "https://www.nytimes.com/2024/08/18/magazine/biden-presidency-legacy-takeaways.html"
  },
  {
    "text": "Willie Brown to Donald Trump: Mention My Name Again and Get Sued  —  The former president has falsely claimed that he nearly died in a helicopter ride with Mr. Brown, and that Mr. Brown said “terrible things” about Kamala Harris.  —  Willie Brown, the former mayor of San Francisco … ",
    "url": "https://www.nytimes.com/2024/08/17/us/politics/willie-brown-donald-trump-sue-lawsuit.html"
  },
  {
    "text": "You Should Know  —  I flagged this on social media.  But I wanted to make sure you knew.  Trump just announced a “crime and safety” rally for next Tuesday in Howell, Michigan, a town that has been heavily associated with the KKK for decades.  Indeed, just late last month White Supremacists marched … ",
    "url": "https://talkingpointsmemo.com/edblog/you-should-know"
  },
  {
    "text": "‘Keyboard warrior’ from Lincoln jailed for three years for stirring up racial hatred after Southport deaths  —  By Lincs Online Reporter - news@lincsonline.co.uk  —  A ‘keyboard warrior’ who admitted publishing written material online to stir up racial hatred during the recent protests was today (Friday) jailed for three years.",
    "url": "https://www.lincsonline.co.uk/lincoln/keyboard-warrior-jailed-for-three-years-for-stirring-up-ra-9379396/"
  }
]