[
  {
    "text": "Congress has already disqualified Trump from the ballot  —  Editor's Note: Tristan Snell is author of the new book “Taking Down Trump: 12 Rules for Prosecuting Donald Trump by Someone Who Did it Successfully.”  He is a lawyer and legal commentator who has appeared on MSNBC and CNN … ",
    "url": "https://www.cnn.com/2024/02/08/opinions/trump-supreme-court-oral-arguments-election-snell/"
  },
  {
    "text": "Live updates Supreme Court skeptical of challenge to Trump's eligibility  —  The Supreme Court on Thursday seemed prepared to keep Donald Trump on the Colorado ballot, expressing deep concerns about the ability of a single state to disqualify a candidate from seeking national office.",
    "url": "https://www.washingtonpost.com/politics/2024/02/08/trump-supreme-court-colorado-ballot/"
  },
  {
    "text": "Special counsel says there is evidence Biden ‘willfully retained and disclosed classified materials’ but will not be charged  —  The decision caps off a year-long saga and means Donald Trump remains the only president in history to face criminal charges.  —  WASHINGTON — Special counsel Robert Hur … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/special-counsel-says-evidence-biden-willfully-retained-disclosed-class-rcna96666"
  },
  {
    "text": "Special Counsel Seeks No Criminal Charges in Biden's Classified Records Case  —  The inquiry found that the president had willfully retained material after finishing his term as vice president and had shared sensitive information with a ghostwriter.  —  The special counsel investigating President Biden … ",
    "url": "https://www.nytimes.com/2024/02/08/us/biden-documents-special-counsel.html"
  },
  {
    "text": "Statement from President Joe Biden  —  The Special Counsel released today its findings about its look into my handling of classified documents.  I was pleased to see they reached the conclusion I believed all along they would reach - that there would be no charges brought in this case and the matter is now closed.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/08/statement-from-president-joe-biden-5/"
  },
  {
    "text": "Senate advances Ukraine funding without border security reforms  —  The Senate voted Thursday to advance a $95 billion emergency security spending bill with $60 billion to support the war in Ukraine — but without a bipartisan border security bill that ran into stiff opposition from Republicans.",
    "url": "https://thehill.com/homenews/senate/4454065-senate-advances-ukraine-funding-without-border-security-reforms/"
  },
  {
    "text": "“Awful and unethical”: Legal experts say Judge Cannon could face removal for “disturbing” order  —  “Compromising national security is a bridge too far,” says longtime Harvard legal scholar Laurence Tribe  —  Legal experts sounded the alarm after the judge overseeing Donald Trump's classified … ",
    "url": "https://www.salon.com/2024/02/08/awful-and-unethical-legal-experts-say-cannon-could-face-removal-for-disturbing-order/"
  },
  {
    "text": "Authorities investigating online threats made to potential witness related to Trump classified docs case  —  The threats are cited in a court filing from the special prosecutor.  —  Former President Donald Trump arrives at the New York State Supreme Court in New York, on Oct. 2, 2023.",
    "url": "https://abcnews.go.com/US/authorities-investigating-online-threats-made-potential-witness-trump/story?id=107057357"
  },
  {
    "text": "Fox News praises vigilante group for a takedown of migrant “shoplifter.”  Law enforcement say the man was neither a shoplifter nor a recent migrant.  —  Update: Fox guest Curtis Sliwa told the AP that he had believed the man was a migrant because he was “speaking Spanish”",
    "url": "https://www.mediamatters.org/sean-hannity/fox-news-praises-vigilante-group-takedown-migrant-shoplifter-law-enforcement-say-man"
  },
  {
    "text": "Joe Biden is currently losing the election  —  I try not to spend my days being a doomer or a catastrophist, but in both casual and formal conversations I've come to think that there is one very basic point about politics in 2024 that is being broadly underrated — Joe Biden is currently … ",
    "url": "https://www.slowboring.com/p/joe-biden-is-currently-losing-the"
  },
  {
    "text": "Powerful committee chair joins growing list of House GOP retirements  —  Rep. Cathy McMorris Rodgers (R-Wash.), the chair of the powerful House Energy and Commerce Committee, said Thursday she won't seek reelection in November. … - “I will not be running for re-election to the People's House.”",
    "url": "https://www.axios.com/2024/02/08/mcmorris-rodgers-house-gop-retirements"
  },
  {
    "text": "Missouri senators vote against allowing abortions in rape, incest cases  —  Missouri senators voted Wednesday against amendments that would have allowed abortions in the cases of rape and incest in the state.  —  Missouri senators debated a bill that would make it illegal for public funds … ",
    "url": "https://thehill.com/homenews/state-watch/4456756-missouri-senators-vote-against-allowing-abortions-in-rape-incest-cases/"
  },
  {
    "text": "FCC outlaws AI voices in robocall fraud  —  The Federal Communications Commission has declared the use of AI-generated voices in scam robocalls illegal, with immediate effect. … - While using AI to perpetrate a scam or fraud was already illegal, now using AI to generate voices in such calls is itself illegal.",
    "url": "https://www.axios.com/2024/02/08/fcc-ai-robocalls-illegal"
  },
  {
    "text": "Bounced cheques and Trump's ‘unpaid fees’: Rudy Giuliani lays bare his finances in bankruptcy hearing  —  Over three hours in the fifth-floor room of a court building, Donald Trump's one-time attorney reeled off a list of assets that revealed the strained state of his finances, from a Bronx storage unit to a $1m tax bill.",
    "url": "https://www.the-independent.com/news/world/americas/us-politics/rudy-giuliani-bankruptcy-hearing-donald-trump-b2492575.html"
  },
  {
    "text": "Shocker: Republicans Admit in Private That They Killed a Good Deal … In an extraordinary spectacle, virtually all Senate Republicans joined together Wednesday to block a bipartisan bill that would have given Republicans much of what they wanted on border security.  Why?  Because Donald Trump told them to.",
    "url": "https://newrepublic.com/article/178860/republicans-border-deal-michael-bennet"
  },
  {
    "text": "Tucker Carlson's Fatal Attraction  —  The right-wing conspiracy monger shares Putin's worldview.  —  THE TITLE OF MY 2003 BOOK, Useful Idiots, was a reference to a perhaps apocryphal quote sometimes attributed to Lenin to the effect that gullible liberals in the West would prove useful idiots for the Soviet Union.",
    "url": "https://plus.thebulwark.com/p/tucker-carlsons-fatal-attraction"
  },
  {
    "text": "Alabama station in disbelief after 200-foot radio tower stolen  —  WJLX radio station can no longer broadcast their AM programming since the incident.  —  A radio station in Alabama was forced to go silent after thieves stole their 200-foot radio tower and other equipment from a building.",
    "url": "https://www.nbcnews.com/news/us-news/alabama-station-disbelief-200-foot-radio-tower-stolen-rcna137877"
  },
  {
    "text": "Trump's ‘Knock on the Door’  —  Confrontations over immigration and border security are moving to the center of the struggle between the two parties, both in Washington, D.C., and beyond.  And yet the most explosive immigration clash of all may still lie ahead.",
    "url": "https://www.theatlantic.com/politics/archive/2024/02/trumps-immigration-plan-is-even-more-aggressive-now/677385/"
  },
  {
    "text": "CIA terminates whistleblower who prompted flood of sexual misconduct complaints  —  The CIA this week terminated a woman whose whistleblower account of being assaulted in a stairwell at the spy agency's headquarters prompted a flood of colleagues to come forward with their own complaints of sexual misconduct.",
    "url": "https://apnews.com/article/cia-sexual-misconduct-harassment-spying-whistleblower-49b949a293f51416f51dca9daa9b6180"
  },
  {
    "text": "Statement from Congresswoman Cathy McMorris Rodgers  —  Washington, D.C. - Today, Eastern Washington Congresswoman Cathy McMorris Rodgers (WA-05) released the following statement.",
    "url": "https://mcmorris.house.gov/posts/statement-from-congresswoman-cathy-mcmorris-rodgers"
  },
  {
    "text": "Scientists just set a nuclear fusion record in a step toward unleashing the limitless, clean energy source  —  Scientists and engineers near the English city of Oxford have set a nuclear fusion energy record, they announced Thursday, bringing the clean, futuristic power source another step closer to reality.",
    "url": "https://www.cnn.com/2024/02/08/climate/nuclear-fusion-energy-milestone-climate"
  },
  {
    "text": "Nevada GOP caucuses: Live results  —  Former President Trump is expected to win all delegates in Thursday's GOP caucuses in Nevada.  —  The Silver State has sown confusion by holding both a state-run presidential preference primary, in which former U.N. Ambassador Nikki Haley ran and came … ",
    "url": "https://thehill.com/homenews/campaign/4456577-nevada-gop-caucus-live-results/"
  },
  {
    "text": "Right-Wing Bloggers Busted During Militia Border Tour  —  The Texas Department of Public Safety (DPS) recently arrested two right-wing bloggers riding in a caravan near Eagle Pass after finding what law enforcement described as a plastic bag containing a “white powdery substance,” marijuana … ",
    "url": "https://www.texasobserver.org/celeste-sparks-pena-ahuyon-bloggers-eagle-pass/"
  },
  {
    "text": "AOC declares victory in fight for Green New Deal 5 years later: ‘Social and ecological transformation’  —  ‘We have made major strides in tackling the climate crisis,’ says Rep Alexandria Ocasio-Cortez  —  Rep. Alexandria Ocasio-Cortez, D-N.Y., declared victory this week in the fight to push … ",
    "url": "https://www.foxnews.com/politics/aoc-declares-victory-fight-green-new-deal-5-years-later-social-ecological-transformation?intcmp=tw_fnc"
  },
  {
    "text": "Republicans tell Biden not to take control of Texas National Guard amid standoff over border  —  A group of 24 House Republicans urged President Biden not to federalize the Texas National Guard in the midst of Texas wanting to crack down on the spike of illegal immigration on the U.S.-Mexico border in a letter Thursday.",
    "url": "https://thehill.com/homenews/house/4456459-republicans-biden-not-take-control-texas-national-guard-border/"
  },
  {
    "text": "Utah teen athlete faces threats after state official posted photos questioning her gender  —  Utah state school board member Natalie Cline is under fire after posting photos of a high school basketball player, questioning her gender and prompting threats against the girl.",
    "url": "https://www.axios.com/local/salt-lake-city/2024/02/08/utah-school-board-natalie-cline-gender-basketball-threats"
  },
  {
    "text": "Former Trump adviser Peter Navarro ordered to report to prison  —  Peter Navarro, a former trade adviser to President Donald Trump who was convicted of contempt of Congress, has been ordered to report to prison after a judge denied Navarro's effort to stay out of prison while he appeals the conviction.",
    "url": "https://www.cnn.com/2024/02/08/politics/peter-navarro-prison/"
  }
]