[
  {
    "text": "BREAKING: Filing alleges ‘improper’ relationship between Fulton DA, top Trump prosecutor  —  Fani Willis hired alleged romantic partner as special prosecutor, court motion says  —  District Attorney Fani Willis improperly hired an alleged romantic partner to prosecute Donald Trump … ",
    "url": "https://www.ajc.com/politics/breaking-filing-alleges-improper-relationship-between-fulton-da-top-trump-prosecutor/A2N2OWCM7FFWJBQH2ORAK2BKMQ/"
  },
  {
    "text": "Trump Loses Federal Appeal on Immunity in E. Jean Carroll Case  —  No judge from the Second Circuit called for a vote to rehear Trump's appeal, leaving the Supreme Court as the last possible stop for the former president  —  Donald Trump on Monday lost again in the former president's bid … ",
    "url": "https://themessenger.com/politics/trump-loses-federal-appeal-immunity-e-jean-carroll-defamation-case"
  },
  {
    "text": "Kilmeade says Biden went ‘full Hitler’ attacking Trump during Valley Forge speech  —  Fox News hots Brian Kilmeade said President Biden went “full Hitler” in a recent speech attacking former President Trump ahead of a potential rematch between the two candidates in the 2024 presidential election.",
    "url": "https://thehill.com/media/4395082-kilmeade-biden-full-hitler-trump-speech/"
  },
  {
    "text": "Exclusive: Roger Stone Spoke With Cop Pal About Assassinating Eric Swalwell and Jerry Nadler  —  Weeks before the 2020 presidential election, infamous political operative Roger Stone sat across from his associate Sal Greco at a restaurant in Florida.  —  At the time, Greco was an NYPD cop working security for Stone on the side.",
    "url": "https://www.mediaite.com/politics/exclusive-roger-stone-spoke-with-cop-pal-about-assassinating-eric-swalwell-and-jerry-nadler/"
  },
  {
    "text": "Roger Stone Discussed Assassinating Dems Before 2020 Election: Report  —  ‘TIME TO DO IT’  —  Roger Stone discussed assassinating members of Congress in the lead-up to the 2020 election with a then-NYPD police officer, according to audio of the longtime Republican operative's comments obtained by Mediaite.",
    "url": "https://www.thedailybeast.com/roger-stone-discussed-assassinating-eric-swalwell-and-jerry-nadler-before-2020-election-report"
  },
  {
    "text": "CNN Poll: Haley trims Trump's lead to single digits in New Hampshire  —  Former South Carolina Gov. Nikki Haley has trimmed former President Donald Trump's lead in the Republican primary race in New Hampshire to single digits, according to a new CNN Poll conducted by the University of New Hampshire.",
    "url": "https://www.cnn.com/2024/01/09/politics/cnn-new-hampshire-poll/"
  },
  {
    "text": "The Nikki Haley surge in New Hampshire may have peaked, Globe poll finds  —  Former South Carolina governor Nikki Haley's rise in New Hampshire in the past two months has been real and has injected new energy into what has been largely a sleepy race for the Republican presidential nomination dominated by former president Donald Trump.",
    "url": "https://www.bostonglobe.com/2024/01/09/nation/nikki-haley-new-hampshire/"
  },
  {
    "text": "Playbook: New NH polls, Trump in court, border talks falter  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  NEW THIS MORNING — “The Nikki Haley surge in New Hampshire may have peaked, Globe poll finds,” by the Boston Globe's James Pindell: “[T] … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/09/new-nh-polls-trump-in-court-border-talks-falter-00134472"
  },
  {
    "text": "Special counsel Jack Smith was targeted by attempted swatting on Christmas Day  —  Police were dispatched toward Smith's residence but were called off when they learned it was a false alarm and that everyone inside the home was safe.  —  Special counsel Jack Smith, who is overseeing … ",
    "url": "https://www.nbcnews.com/politics/politics-news/special-counsel-jack-smith-was-targeted-attempted-swatting-christmas-d-rcna132964"
  },
  {
    "text": "The fleecing of America's hourly workers  —  More than 200,000 workers across the country are owed $163.3 million in back pay, according to a website maintained by the Department of Labor (DOL).  This is money companies have paid after they were found liable for wage theft violations … ",
    "url": "https://popular.info/p/the-fleecing-of-americas-hourly-workers"
  },
  {
    "text": "Rep. Steny Hoyer To Seek 23rd Term In Congress, Ending Retirement Speculation  —  The powerful lawmaker stepped down from his role as House Majority Leader after the party lost its majority in the last election cycle.  —  LOADING  —  Rep. Steny Hoyer (D-Md.) plans to file for reelection … ",
    "url": "https://www.huffpost.com/entry/steny-hoyer-reelection_n_659cdc7be4b0f9f6621e075a"
  },
  {
    "text": "Substack says it will remove Nazi publications from the platform  —  Nazi content violates rules against incitement to violence, the company says  —  Substack is removing some publications that express support for Nazis, the company said today.  The company said this did not represent … ",
    "url": "https://www.platformer.news/p/substack-says-it-will-remove-nazi"
  },
  {
    "text": "Florida Republican Party ousts Christian Ziegler as chairman after rape allegation  —  The move was widely expected after news broke last month that Ziegler was under investigation by the Sarasota County Police Department.  —  The Republican Party of Florida on Monday formally voted … ",
    "url": "https://www.nbcnews.com/politics/politics-news/florida-republican-party-ousts-christian-ziegler-chairman-rape-allegat-rcna131936"
  },
  {
    "text": "Driver in custody after crashing into White House gates  —  The crash occurred just before 6 p.m. ET, a spokesman for the Secret Service wrote on X.  —  WASHINGTON — A driver was in custody Monday after crashing a vehicle into an exterior gate of the White House complex, a spokesman for the Secret Service wrote on X.",
    "url": "https://www.nbcnews.com/politics/white-house/driver-custody-crashing-white-house-gates-rcna132962"
  },
  {
    "text": "It's official: Global temperatures soared to a new record in 2023  —  And 2024 may bring more of the same.  —  The Earth notched up its warmest year on record last year — but even that new peak is in danger of being surpassed in 2024.  —  The European Union's Copernicus Climate Change Service confirmed … ",
    "url": "https://www.politico.com/news/2024/01/09/global-temperatures-2023-record-00134213"
  },
  {
    "text": "France's Macron to name new PM as he launches political reset  —  French President Emmanuel Macron appointed 34-year-old Education Minister Gabriel Attal as his new prime minister on Tuesday, seeking to breathe new life into his second mandate ahead of European parliament elections.",
    "url": "https://www.reuters.com/world/europe/frances-macron-name-new-pm-he-launches-political-reset-2024-01-09/"
  },
  {
    "text": "Democrats to spend $35M targeting voters of color in House races  —  The “historic investment” for the 2024 election surpasses previous cycles for winning Latino, Black, Asian American, Pacific Islander and Native Hawaiian voters, according to Democrats.  —  Democrats announced Tuesday … ",
    "url": "https://www.nbcnews.com/news/latino/democrats-historic-spend-35m-house-races-november-dccc-rcna132900"
  },
  {
    "text": "5 ways the Supreme Court may try to defuse its newest Trump bomb  —  As the justices confront a historic case with enormous political stakes, they might seek a narrow way out.  —  After years of dodging Donald Trump-related questions, the Supreme Court is now facing the most consequential one of all … ",
    "url": "https://www.politico.com/news/2024/01/08/trump-supreme-court-ballot-insurrection-offramps-00134364"
  },
  {
    "text": "Russia detains U.S. citizen on drugs charges  —  A Russian court said on Tuesday that a U.S. citizen had been detained on drugs charges which can carry up to 20 years in prison.  —  Moscow's Ostankino District Court said that on Jan. 6 Robert Romanov Woodland had been remanded … ",
    "url": "https://www.reuters.com/world/europe/russia-orders-us-citizen-detained-drugs-charges-2024-01-09/"
  },
  {
    "text": "This Might Be the High-Water Mark of Trumpism  —  1. How Biden Wins  —  Mark Halperin watched both Trump and Biden's January 5 speeches and came away with a shrewd piece of analysis. … Halperin then says that Biden's three big problems are:  — That he's playing from behind as an incumbent … ",
    "url": "https://plus.thebulwark.com/p/this-might-be-the-high-water-mark"
  }
]