[
  {
    "text": "The Senate eyes new plan on Ukraine, Israel aid after collapse of border package  —  WASHINGTON (AP) — Mounting a last-ditch effort, Senate Majority Leader Chuck Schumer tried Wednesday to salvage wartime funding for Ukraine from a collapsed deal that had included border enforcement … ",
    "url": "https://apnews.com/article/congress-ukraine-aid-border-security-386dcc54b29a5491f8bd87b727a284f8"
  },
  {
    "text": "Senate GOP blocks border deal; future of Ukraine, Israel aid unclear  —  National security spending for key U.S. allies will receive its own vote after the failure to pass border package.  —  The Senate voted down a sweeping national security and border reform package on Wednesday … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/07/senate-border-security-vote/"
  },
  {
    "text": "The Biden administration is considering executive action to deter illegal migration at the southern border  —  With border security legislation unlikely in Congress, the White House wants to take action.  Migrant crossings are expected to soar back to last year's record levels.",
    "url": "https://www.nbcnews.com/politics/immigration/biden-administration-weighs-executive-action-border-migrants-rcna137804?taid=65c43b6c8b17820001a58e0e"
  },
  {
    "text": "Speaker Johnson: We Were Counting on Democrat to Be In Emergency Surgery During Impeachment Vote  —  A ghoulish way to run the government.  —  Speaker Mike Johnson and House Republicans were shocked as their impeachment resolution against Homeland Security Secretary Alejandro Mayorkas went … ",
    "url": "https://www.meidastouch.com/news/speaker-johnson-we-were-counting-on-democrat-to-be-in-emergency-surgery-during-impeachment-vote"
  },
  {
    "text": "Inside the “very tough” vote for House Democrats on Israel aid  —  The White House was calling Democrats to flip them against House Republicans' Israel aid bill, Axios has learned.  But 46 voted for it anyway. … - “It was a very tough vote for most,” said Rep. Lois Frankel (D-Fla.), who voted for the bill.",
    "url": "https://www.axios.com/2024/02/07/house-democrats-vote-israel-aid-white-house-calls"
  },
  {
    "text": "Judge denies Trump's motion for mistrial  —  Judge Lewis Kaplan on Wednesday denied former President Trump's motion for a mistrial following Trump's conviction for defaming E. Jean Carroll.  —  Trump's attorney Alina Habba moved for a mistrial after Carroll testified she had deleted … ",
    "url": "https://abcnews.go.com/US/live-updates/trump-defamation-trial/judge-denies-trumps-motion-for-mistrial-107040181?id=106403966"
  },
  {
    "text": "Judge denies Trump's motion for mistrial in E. Jean Carroll defamation case  —  A federal judge denied Donald Trump's motions for a mistrial in the defamation case brought by columnist E. Jean Carroll saying the former president's arguments had no “merit” and are “entirely pointless.”",
    "url": "https://www.cnn.com/2024/02/07/politics/judge-denies-trumps-motion-for-mistrial-in-e-jean-carroll-defamation-case/"
  },
  {
    "text": "Exclusive: Tucker Carlson Could Face Sanctions Over Putin Interview  —  Tucker Carlson's interview with Russian President Vladimir Putin could see the conservative pundit targeted by European Union lawmakers, current and former members of the European Parliament have told Newsweek.",
    "url": "https://www.newsweek.com/tucker-carlson-sanctions-eu-putin-interview-1867655"
  },
  {
    "text": "Putin interview with Tucker Carlson shows Kremlin outreach to Trump's GOP  —  MOSCOW — As Russian state television propagandists salivated over Tucker Carlson's interview with President Vladimir Putin, the first of Carlson's falsehoods about his visit to Moscow was punctured, fittingly enough … ",
    "url": "https://www.washingtonpost.com/world/2024/02/07/tucker-carlson-putin-russia-ukraine/"
  },
  {
    "text": "Marianne Williamson suspends her presidential campaign, ending long-shot primary challenge to Biden  —  Self-help author and spiritual guru Marianne Williamson on Wednesday announced the end of her long-shot Democratic challenge to President Joe Biden.  The 71-year-old onetime spiritual adviser … ",
    "url": "https://apnews.com/article/marianne-williamson-campaign-election-2024-76505d653c2f06f703bd5755c6cb9908"
  },
  {
    "text": "Marianne Williamson ends her 2024 presidential run  —  The guru made famous by some viral moments on the 2020 debate stage will turn to promoting her new book this spring.  —  Marianne Williamson has suspended her campaign for the Democratic Party's presidential nomination after coming … ",
    "url": "https://www.politico.com/news/2024/02/07/marianne-williamson-drops-out-2024-00140297"
  },
  {
    "text": "Caitlyn Jenner Faces Right-Wing Rage for Backing Trump on Bud Light  —  Some rightwing personalities are still not willing to accept the brand after its partnership with trans influencer Dylan Mulvaney.  —  Olympic champion Caitlyn Jenner is facing a slew of vicious anti-trans attacks … ",
    "url": "https://www.thedailybeast.com/caitlyn-jenner-faces-anti-trans-right-wing-rage-for-backing-trump-on-bud-light"
  },
  {
    "text": "Gaetz ousted McCarthy.  Now he's moving on to another House GOP target.  —  “I never considered Matt a threat,” Rep. Mike Bost (R-Ill.) said of the Floridian's visit to his backyard.  “I considered him an ass, but never a threat.”",
    "url": "https://www.politico.com/live-updates/2024/02/07/congress/gaetzs-mission-00140205"
  },
  {
    "text": "The right-wing misreading of ‘Blazing Saddles’ is so telling  —  Editor's Note: Noah Berlatsky (@nberlat) is a freelance writer in Chicago.  The views expressed here are his own.  View more opinion on CNN.  —  CNN  —  On social media at least, Mel Brooks' classic “Blazing Saddles” … ",
    "url": "https://www.cnn.com/2024/02/07/opinions/blazing-saddles-50th-anniversary-politics-berlatsky/"
  },
  {
    "text": "Senate Republicans officially block foreign aid bill with border changes  —  It marks the end of immigration negotiations that dragged on for four months.",
    "url": "https://www.politico.com/live-updates/2024/02/07/congress/senate-supplemental-ukraine-border-aid-00140187"
  },
  {
    "text": "Domination or Dissolution, Rule or Ruin  —  Whenever you are weighing in on politics, society, and culture, ask yourself: Would you feel comfortable making this argument directly to the face of the people whose lives, rights, and dignity are most immediately affected by the issue in question?",
    "url": "https://thomaszimmer.substack.com/p/domination-or-dissolution-rule-or"
  },
  {
    "text": "After Libs of TikTok posted, at least 21 bomb threats followed  —  The FBI and local law enforcement said bomb threats across the country have tied up government resources even when they turn out to be hoaxes.  —  Last March, police in Coralville, Iowa, investigated a bomb threat targeting a junior high school.",
    "url": "https://www.nbcnews.com/tech/internet/libs-tiktok-x-chaya-raichik-bomb-threat-twitter-of-libsoftiktok-rcna102784"
  },
  {
    "text": "Bill that could ban Trump from Hawaii ballot passes first test  —  HONOLULU (HawaiiNewsNow) - A proposal that would allow Donald Trump to be disqualified from the Hawaii ballot for causing an insurrection survived a close vote in a state Senate committee Tuesday.",
    "url": "https://www.hawaiinewsnow.com/2024/02/07/bill-that-could-ban-trump-hawaii-ballot-insurrection-passes-first-test/"
  },
  {
    "text": "After Humiliating Result in Nevada, Haley Goes After Her Own Party  —  The former South Carolina governor, who was outvoted by “None of These Candidates” after Donald Trump declined to participate in the primary, criticized the state of the Republican Party.",
    "url": "https://www.nytimes.com/2024/02/07/us/politics/haley-trump-republicans.html"
  },
  {
    "text": "The Road to the General Election  —  NPR/PBS NewsHour/Marist National Poll  —  Biden Competitive with Trump, Haley... Biden Opens Up Lead if Trump is Convicted  —  President Joe Biden and former President Donald Trump remain in a statistical tie among registered voters nationally.",
    "url": "https://maristpoll.marist.edu/polls/the-road-to-the-general-election/"
  },
  {
    "text": "Director's Statement on the Budget and Economic Outlook for 2024 to 2034  —  This afternoon, I will brief the press about the Congressional Budget Office's new report, The Budget and Economic Outlook: 2024 to 2034.  I will deliver the following remarks with accompanying slides.",
    "url": "https://www.cbo.gov/publication/59933"
  },
  {
    "text": "Russia Is Boosting Calls for ‘Civil War’ Over Texas Border Crisis  —  An all-encompassing Russian disinformation campaign is using everything from bots to lifestyle influencers to powerful state-run media to sow division in the United States.  —  A Russian disinformation campaign … ",
    "url": "https://www.wired.com/story/russia-disinformation-campaign-civil-war-texas-border/"
  },
  {
    "text": "Meet the lawyers arguing Trump's Supreme Court Colorado ballot case  —  One is a familiar face at the Supreme Court and a former Texas solicitor general.  The other is appearing before the high court for the first time.  Both have experience as law clerks to Supreme Court justices.",
    "url": "https://www.washingtonpost.com/politics/2024/02/07/lawyers-supreme-court-trump-ballot-case/"
  },
  {
    "text": "Special counsel Robert Hur has completed report on Biden's handling of classified documents, Garland says  —  Special counsel Robert Hur has completed his report on President Joe Biden's handling of classified documents after his vice presidency, Attorney General Merrick Garland wrote to congressional leaders Wednesday.",
    "url": "https://www.cbsnews.com/news/special-counsel-bidens-handling-classified-documents/"
  }
]