[
  {
    "text": "Where Are All the Anti-Trump Republicans?  —  A vast array of GOP power brokers detest and disdain the former president.  So why are they keeping so quiet?  —  Here's a portrait of how Donald Trump reclaims power.  —  At a Hoover Institution conference here last week … ",
    "url": "https://www.politico.com/news/magazine/2023/12/08/the-stop-trump-effort-has-been-abysmal-00130751"
  },
  {
    "text": "Trump Tells NY Civil Fraud Trial Sketch Artist He's ‘Gotta Lose Some Weight’  —  Earlier in the trial, the former president's son, Don Trump Jr., told courtroom sketch artist Jane Rosenberg, who was on assignment for Reuters to ‘make me look sexy’  —  After viewing his courtroom sketch … ",
    "url": "https://themessenger.com/politics/trump-tells-ny-civil-fraud-trial-sketch-artist-hes-gotta-lose-some-weight"
  },
  {
    "text": "GOP's Brutal Math: Trump Could Secure Nomination Before Conviction  —  Looking at the primary schedule, Republicans see the party handcuffing itself to a candidate on the verge of politically toxic criminal convictions. … ‘People need to wake up’  —  There's a scenario many Republicans are dreading … ",
    "url": "https://www.thedailybeast.com/gops-brutal-math-donald-trump-could-secure-2024-nomination-before-criminal-conviction"
  },
  {
    "text": "Woman arrested for pouring gasoline, trying to burn down Martin Luther King Jr.'s birth home  —  ATLANTA — Atlanta police are investigating after a woman attempted to burn down Dr. Martin Luther King Jr.'s birth home.  —  Police told Channel 2 Action News they were called to King's birth home … ",
    "url": "https://www.wsbtv.com/news/local/police-investigating-after-person-tries-vandalize-martin-luther-king-jrs-home-near-king-center/NEBC6LEK4RABJNRYEKTFV6X7AU/"
  },
  {
    "text": "Woman tried to burn down Martin Luther King Jr.'s birth home, police say  —  A woman was arrested Thursday afternoon after attempting to burn down Martin Luther King Jr.'s childhood home in Atlanta, police said.  —  The Atlanta Police Department said the woman poured gasoline … ",
    "url": "https://thehill.com/regulation/court-battles/4349371-woman-tried-to-burn-down-martin-luther-king-jr-s-birth-home-police-say/"
  },
  {
    "text": "‘I Am Sorry’: Harvard President Gay Addresses Backlash Over Congressional Testimony on Antisemitism  —  Harvard President Claudine Gay apologized for her remarks at the end of her congressional testimony, which sparked fierce national criticism and led the leadership of Harvard Hillel … ",
    "url": "https://www.thecrimson.com/article/2023/12/8/gay-apology-congressional-remarks/"
  },
  {
    "text": "Inside Trump's Plot To Corrupt the 2024 Election With ‘Garbage’ Data  —  For more than a decade, election officials have relied on a system to reduce fraud and boost voter registration.  Trump's cronies are sabotaging it, state by state — and trying to replace it with something more MAGA",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-election-plans-corrupt-voter-registration-eric-eagleai-1234920083/"
  },
  {
    "text": "2024 vote could bring electoral college distortions to the forefront  —  The system empowers a sliver of the U.S. population in a diminishing number of battleground states.  And the majority may not even prevail.  —  Arlando Monk is an increasingly rare find in presidential politics: a voter whose choices matter.",
    "url": "https://www.washingtonpost.com/nation/2023/12/08/electoral-college-votes-swing-states-decline/"
  },
  {
    "text": "Hunter Biden is indicted on 9 tax charges, adding to gun charges in a special counsel investigation  —  Hunter Biden has been indicted on tax charges in California as a special counsel investigation into the business dealings of President Joe Biden's son intensifies against the backdrop of the 2024 election",
    "url": "https://abcnews.go.com/Politics/wireStory/hunter-biden-indicted-tax-charges-adding-gun-charges-105483360"
  },
  {
    "text": "GOP lawmaker: Ousted aides targeted my daughter for OnlyFans account  —  Rep. Brandon Williams, who represents a battleground seat, says his altercation stemmed from a threat to expose his daughter's OnlyFans account.  —  A Republican member of Congress is alleging that a former top aide spearheaded a … ",
    "url": "https://www.politico.com/news/2023/12/08/brandon-williams-interview-video-former-aides-00130713"
  },
  {
    "text": "FACT SHEET: President Biden Announces Billions to Deliver World-Class High-Speed Rail and Launch New Passenger Rail Corridors Across the Country  —  $8.2 Billion from the President's Investing in America Agenda to Deliver Transformative Passenger Rail in America",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/08/fact-sheet-president-biden-announces-billions-to-deliver-world-class-high-speed-rail-and-launch-new-passenger-rail-corridors-across-the-country/"
  },
  {
    "text": "Sheriff's Deputy Killed in Car Chase Involving U.S. Senator's Son  —  Ian Cramer, the son of Senator Kevin Cramer of North Dakota, led police on a car chase in North Dakota on Wednesday.  —  The son of a United States senator was arrested on felony charges after he led police in North Dakota … ",
    "url": "https://www.nytimes.com/2023/12/07/us/kevin-kramer-son-manslaughter.html"
  },
  {
    "text": "White House Disavows U.S. Islamic Group After Leader's Oct. 7 Remarks  —  The director of the Council on American-Islamic Relations said in a speech that he was “was happy to see” Palestinians break out of Gaza on the day Hamas attacked Israel.  —  The White House disavowed … ",
    "url": "https://www.nytimes.com/2023/12/08/us/politics/white-house-cair-nihad-awad.html"
  },
  {
    "text": "A 68 billion dollar bummer  —  THE BUZZ — California Democrats are in a lose-lose situation.  —  State budget analysts are predicting a $68 billion deficit next year, putting legislative leaders and Gov. Gavin Newsom in the unenviable position of having to slash costs and reject most proposals for new funding in 2024.",
    "url": "https://www.politico.com/newsletters/california-playbook/2023/12/08/a-68-billion-dollar-bummer-00130764"
  },
  {
    "text": "Police have recovered video of Florida GOP chair and alleged victim in rape investigation  —  Disclaimer: This story contains explicit sexual content and details involving an alleged sexual assault.  —  Sarasota police have recovered a cell phone video taken by Florida GOP chairman Christian Ziegler … ",
    "url": "https://flcga.org/police-have-recovered-video-of-florida-gop-chair-and-alleged-victim-in-rape-investigation/"
  },
  {
    "text": "Wharton board calls on Penn president Liz Magill to resign  —  University of Pennsylvania President Liz Magill is being asked to resign by the board of Penn's Wharton business school, according to a letter obtained by Axios. … - Earlier today, Axios reported that a wealthy donor pulled … ",
    "url": "https://www.axios.com/2023/12/08/penn-antisemitism-wharton-magill-resign"
  },
  {
    "text": "Musk's Scandinavian woes deepen as Tesla loses Swedish court case, Finnish union joins port blockade  — Tesla is facing mounting pressure across Scandinavian countries to sign a collective bargaining agreement with employees in Sweden.  — Finnish transport workers' union AKT … ",
    "url": "https://www.cnbc.com/2023/12/08/musks-scandinavian-woes-deepen-as-tesla-loses-swedish-court-case.html"
  },
  {
    "text": "Exclusive: Pro-Trump lawyer Kenneth Chesebro cooperating in multiple state probes into 2020 fake electors plot  —  The pro-Trump lawyer who helped devise the 2020 fake electors plot and already pleaded guilty to the conspiracy in Georgia is now cooperating with Michigan and Wisconsin state investigators … ",
    "url": "https://www.cnn.com/2023/12/08/politics/kenneth-chesebro-cooperating-multiple-investigations"
  }
]