[
  {
    "text": "My Statement on President Biden's Announcement  —  Joe Biden has been one of America's most consequential presidents, as well as a dear friend and partner to me.  Today, we've also been reminded — again — that he's a patriot of the highest order.  —  Sixteen years ago … ",
    "url": "https://t.co/Bs2ZumFXxe"
  },
  {
    "text": "Exclusive: All 50 Democratic party US state chairs back Harris -sources  —  All 50 Democratic party state chairs have thrown their weight behind Vice President Kamala Harris to be the party's new presidential nominee, according to sources familiar with the matter.",
    "url": "https://www.reuters.com/world/us/all-50-democratic-party-us-state-chairs-back-harris-sources-2024-07-21/"
  },
  {
    "text": "Biden's exit leads to the biggest day for Democratic donations online in years — $30 million and counting.  —  Democrats greeted President Biden's departure from the presidential race with an avalanche of cash, donating more than $30 million online on Sunday and making it the single biggest … ",
    "url": "https://www.nytimes.com/2024/07/21/us/politics/bidens-exit-leads-to-the-biggest-day-for-democratic-donations-online-in-years.html"
  },
  {
    "text": "Live updates: President Joe Biden ends his 2024 bid  —  President Joe Biden says he's ready to return to the campaign trail, even as a growing chorus of Democratic lawmakers called for him to step aside.  —  Meanwhile, Donald Trump on Saturday held his first public campaign rally since … ",
    "url": "https://apnews.com/live/biden-trump-election-campaign-updates"
  },
  {
    "text": "How Biden landed at the decision to drop out  —  Holed up in his Delaware shore home and still recovering from Covid, President Joe Biden on Saturday night began to come to terms with the end of his reelection bid.  Biden had spent the last few days consulting with his senior aides as they tried … ",
    "url": "https://www.politico.com/live-updates/2024/07/21/joe-biden-drops-out-election/biden-drop-out-decision-00170115"
  },
  {
    "text": "Nikki Haley Voters PAC Announces Support for Kamala Harris  —  voters pledged their support for Democratic Vice President  —  ' presidential bid on Sunday, hours after President  —  announced that he was dropping out of the race.  —  Biden announced on Sunday afternoon in a letter … ",
    "url": "https://www.newsweek.com/nikki-haley-voters-pac-announces-support-kamala-harris-1928198"
  },
  {
    "text": "Kamala Harris Must Be the Candidate.  This Is How She Beats Trump  —  WINNING TICKET  —  Beginning right now, the Democratic Party must unite behind Harris.  The debates of the past few weeks following the presidential debate, and all recriminations, must be set aside.",
    "url": "https://www.thedailybeast.com/kamala-harris-must-be-the-candidate-this-is-how-she-beats-trump"
  },
  {
    "text": "Manchin weighs options after Biden exits presidential race  —  Sen. Joe Manchin (W.Va.) is considering re-registering as a Democrat in order to compete for Democratic presidential nomination.  —  Sen. Joe Manchin III (I-W. Va.) is considering re-registering as a Democrat to compete … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/21/manchin-weighs-options-after-biden-exits-presidential-race/"
  },
  {
    "text": "The Week Ahead  —  President Biden: “I believe it is in the interest of my party and the country to stand down and to focus solely on fulfilling my duties as president.”  He followed up minutes later endorsing Kamala Harris.  He is a splendid man, a splendid human being … ",
    "url": "https://joycevance.substack.com/p/the-week-ahead-fc5"
  },
  {
    "text": "Trump favorability rises following shooting, majority of Americans want Biden to end campaign: POLL  —  More Americans also blame Trump for rise in political violence.  —  Republican presidential nominee and former President Donald Trump gives his acceptance speech at the Republican National Convention … ",
    "url": "https://abcnews.go.com/Politics/trump-favorability-rises-shooting-majority-americans-biden-end/story?id=112112043"
  },
  {
    "text": "With Biden stepping aside, Democrats must now embrace an open process  —  Vice President Harris may be the most likely replacement, but a contested convention is good for everyone.  —  By the Editorial Board  —  President Biden took one of the most consequential steps imaginable: He ended his bid for a second term.",
    "url": "https://www.washingtonpost.com/opinions/2024/07/21/biden-drop-out-dnc-convention-harris/"
  },
  {
    "text": "Biden's exit makes Trump the oldest nominee in U.S. history … - Biden and Trump were the only presidents older than 70 at the start of their terms. … - The 118th Congress, one of the oldest in U.S. history, drove debates last year about term limits and fitness for office.",
    "url": "https://www.axios.com/2024/07/21/kamala-harris-age-presidential-nominee"
  },
  {
    "text": "Biden's Greatest Strengths Proved His Undoing  —  The personal qualities that enabled Biden's successes in office helped doom his candidacy for reelection.  —  For the past few weeks, Joe Biden has cut a deeply unattractive figure.  Unable to escape a lifetime of resentments and mired in self-pity … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/bidens-greatest-strengths-proved-his-undoing/679179/"
  },
  {
    "text": "Republicans could file challenges if Biden replaced, Speaker Johnson says  —  “Every state has its own system,” he said of election laws.  —  House Speaker Mike Johnson reiterated Sunday that any attempt by Democrats to sub in a new candidate in place of President Joe Biden is likely to be met by legal challenges.",
    "url": "https://www.politico.com/news/2024/07/21/biden-johnson-2024-elections-laws-00169973"
  },
  {
    "text": "‘The Squad’ Is Coming Around to Kamala Harris for President  —  FALLING IN LINE  —  Cori Bush, Ayanna Pressley and Ilhan Omar have all endorsed Kamala Harris' presidential bid—just hours after Joe Biden himself endorsed the vice president.  —  Members of “The Squad” … ",
    "url": "https://www.thedailybeast.com/cori-bush-ayanna-pressley-ilhan-omar-endorse-vp-kamala-harris-for-president"
  },
  {
    "text": "Raging Trump Reacts to Biden Bow-Out: ‘Crooked Biden Was Not Fit to Run’  —  TRUMP TAKE  —  Biden is “the Worst President, by far, in the History of our Nation,” Trump wrote on Truth Social.  —  Journalist  —  Former President and current Republican presidential nominee Donald Trump … ",
    "url": "https://www.thedailybeast.com/raging-trump-reacts-to-biden-bow-out-crooked-biden-was-not-fit-to-run"
  }
]