[
  {
    "text": "Witness tells House Ethics Committee that Matt Gaetz paid her for sex: Sources  —  The committee has interviewed at least half a dozen women who were witnesses.  —  Rep. Matt Gaetz looks on during a news conference about unidentified aerial phenomena (UAP) transparency on Capitol Hill in Washington, D.C., Nov. 30, 2023.",
    "url": "https://abcnews.go.com/US/witness-tells-house-ethics-committee-matt-gaetz-paid/story?id=111217102"
  },
  {
    "text": "Trump Wasn't Going to Stay in Milwaukee.  Then Reporters Asked.  —  The Republican convention will be held in swing-state Wisconsin's largest city.  The nominee, however, had planned to stay in his own hotel in Chicago, before members of the media began inquiring.",
    "url": "https://www.nytimes.com/2024/06/18/us/politics/trump-milwaukee-rnc.html"
  },
  {
    "text": "Campaign denies Donald Trump planning to stay in Chicago during 2024 Milwaukee RNC  —  There is a rally Tuesday for former President Donald Trump in Racine, Wisconsin.  —  CHICAGO (WLS) — Former President Donald Trump's campaign denied he is planning to stay in Chicago and commute to Milwaukee … ",
    "url": "https://abc7chicago.com/post/donald-trump-stay-chicago-during-2024-rnc-milwaukee/14971275/"
  },
  {
    "text": "Scoop: White House cancels meeting, scolds Netanyahu in protest over video … - “This decision makes it clear that there are consequences for pulling such stunts,” a U.S. official said.  — “The Americans are fuming. … - Some Israeli officials were already en route to Washington when the meeting was cancelled.",
    "url": "https://www.axios.com/2024/06/19/netanyahu-video-biden-cancels-iran-meeting"
  },
  {
    "text": "‘Totally normal for a dictator’: Trump stuns with latest demand for punishment  —  Former President Donald Trump left onlookers shocked Tuesday when he declared private citizens should lose their jobs should they refuse to follow his party line.  —  Trump's Truth Social message … ",
    "url": "https://www.rawstory.com/trump-2668542213/"
  },
  {
    "text": "Roger Stone Caught on Tape Discussing Trump's Plan to Challenge 2024 Election  —  CANDID CAMERA  —  Self-proclaimed “dirty trickster” Roger Stone was secretly videotaped at Mar-a-Lago during a remarkably candid conversation.  —  Roger Stone, a longtime Republican operative who served … ",
    "url": "https://www.thedailybeast.com/roger-stone-caught-on-tape-discussing-trumps-plan-to-challenge-2024-election"
  },
  {
    "text": "Bump stock ban blocked by Senate Republicans … - The bipartisan bill had little chance of passing the chamber and was instead introduced to force Republicans to reject it.  — The measure picked up 20 additional cosponsors since last week's Supreme Court ruling.",
    "url": "https://www.axios.com/2024/06/18/bump-stock-ban-blocked-senate-republicans"
  },
  {
    "text": "“The Supreme Court is thinking about the Constitution all wrong”  —  Madiba Dennie on “The Originalism Trap.” … I recently had the pleasure of (virtually) sitting down with Madiba K. Dennie to talk about her new book, “The Originalism Trap: How Extremists Stole the Constitution and How We the People Can Take It Back.”",
    "url": "https://www.publicnotice.co/p/madiba-dennie-the-originalism-trap-interview"
  },
  {
    "text": "Vermont Republican secretly poured water into colleague's bag over months  —  Mary Morrissey apologizes after being filmed dumping liquid into backpack of Democratic legislator Jim Carroll  —  A Vermont lawmaker was compelled to apologize publicly after being caught on video pouring water … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/18/vermont-republican-water-bag"
  },
  {
    "text": "Trump and McCarthy wanted revenge.  It didn't quite go as planned.  —  The biggest primary on Tuesday night remains unresolved, but battleground House races that could decide control of the chamber were set for November.  —  The biggest race of Tuesday night still doesn't have a winner.",
    "url": "https://www.politico.com/news/2024/06/19/virginia-oklahoma-primaries-00164072"
  },
  {
    "text": "No more bridges left to burn in Jewish Westchester  —  As Rep. Jamaal Bowman fights for his political life, Jewish leaders in the district say he's left a long trail of betrayal in his wake  —  In late spring of 2022, Rep. Jamaal Bowman (D-NY) reached out to a local Jewish leader … ",
    "url": "https://jewishinsider.com/2024/06/rep-jamaal-bowman-westchester-county-jewish-community/"
  },
  {
    "text": "DJT shares tumble 13% as Trump Media stock sell-off accelerates … Shares of Trump Media & Technology Group dropped more than 13% on Tuesday, continuing the stock's tumble following the conviction of former President Donald Trump, the company's majority shareholder.",
    "url": "https://www.cnbc.com/2024/06/18/djt-shares-tumble-13percent-as-trump-media-stock-sell-off-accelerates.html"
  },
  {
    "text": "Xi Calls for Greater Loyalty and Discipline in China's Military  — Chinese president holds meeting in symbolic Party stronghold  — At least a dozen senior military officials ousted last year  —  Chinese President Xi Jinping called for “deep reflection” from the country's armed forces … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-19/xi-calls-for-greater-loyalty-and-discipline-in-china-s-military"
  },
  {
    "text": "Trump's Ground Game Is No Longer In Our Hearts  —  How the Trump campaign plans to use Democratic canvassing arrangements to get out the vote.  —  DONALD TRUMP'S PRESIDENTIAL CAMPAIGN may have a ground game after all.  And if all goes as planned, Trump will have a George Soros-backed political committee … ",
    "url": "https://www.thebulwark.com/p/trump-campaigns-get-out-the-vote-plans"
  },
  {
    "text": "French far-right leader Bardella backs Ukraine, but would not send long-range missiles  —  French far-right leader Jordan Bardella said on Wednesday that he backed Ukraine's right to defend itself against Russia, but if elected prime minister he would not provide Kyiv with missiles that would allow it to strike Russia's territory.",
    "url": "https://www.reuters.com/world/europe/french-far-right-leader-bardella-backs-ukraine-would-not-send-long-range-2024-06-19/"
  },
  {
    "text": "Jan. 6 defendant who walked out during a debate loses House GOP primary runoff in Georgia  —  Republican Chuck Hand served 20 days behind bars for his participation in the Jan. 6, 2021, attack on the U.S. Capitol.  —  WASHINGTON — A convicted Jan. 6 defendant from Georgia who served 20 days … ",
    "url": "https://www.nbcnews.com/politics/2024-election/georgia-2nd-district-gop-runoff-jan-6-rioter-chuck-hand-rcna157221"
  },
  {
    "text": "The shooter who killed 5 at a Colorado LGBTQ+ club pleads guilty to 50 federal hate crimes  —  The shooter who killed five people and injured 19 others at an LGBTQ+ club that was a refuge in the conservative city of Colorado Springs pleaded guilty to federal hate crimes and was sentenced … ",
    "url": "https://apnews.com/article/colorado-springs-lgbtq-bar-shooting-028344ddb7666033311dc67a064fef9f"
  },
  {
    "text": "The Murky Business of Transgender Medicine  —  Did Texas Children's Hospital commit fraud to pay for child sex-change procedures?  —  / Eye on the News / Health Care, The Social Order  —  The “gender-affirming care” business has always had an aura of madness around it.",
    "url": "https://www.city-journal.org/article/the-murky-business-of-transgender-medicine"
  },
  {
    "text": "Is MTG's Book Such a Flop She Hasn't Made a Dime From It?  —  SHOW ME THE MONEY  —  The rules about what lawmakers have to share about their contracts—like the one MTG has with Don Jr.'s publishing company—are murky.  —  MAGA firebrand Marjorie Taylor Greene appears to have recently skipped reporting … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-hasnt-disclosed-her-trumpworld-book-money"
  },
  {
    "text": "Ship attacked by Yemen's Houthi rebels in fatal assault sinks in Red Sea in their second sinking  —  Yemen's Houthi rebels sink another carrier in the Red Sea killing at least one sailor on board.  AP news director Jon Gambrell explains the ongoing attacks by Houthis in the Red Sea as a second ship targeted sinks.",
    "url": "https://apnews.com/article/houthi-rebels-ship-attack-red-sea-yemen-bfa7d321e55c5bb59b268b82ef3c56ba"
  },
  {
    "text": "Privately, she fundraises.  Publicly, she's silent.  Kathy Hochul's non-endorsement policy.  —  NON-ENDORSEMENT DEAL: Gov. Kathy Hochul has been making her way around the fundraising circuit this year, but don't ask her who she's backing.  —  The Democratic governor has adopted … ",
    "url": "https://www.politico.com/newsletters/new-york-playbook-pm/2024/06/18/privately-she-fundraises-publicly-shes-silent-kathy-hochuls-non-endorsement-policy-00163984"
  },
  {
    "text": "Another evangelical abuse scandal: It's a big reason why they worship Trump  —  Another week, and another prominent Christian right pastor gets outed for alleged or apparent sexual abuse.  Robert Morris, the founder of Gateway Church in the Dallas suburbs, was accused last week by a woman … ",
    "url": "https://www.salon.com/2024/06/18/another-evangelical-abuse-scandal-its-a-big-reason-why-they-worship/"
  }
]