[
  {
    "text": "George Stephanopoulos Says Biden Can't Serve Another 4 Years  —  GEORGE STEPHANOPOULOS BIDEN CAN'T SERVE 4 MORE YEARS … 6:28 PM PT — George Stephanopoulos tells TMZ, “Earlier today, I responded to a question from a passerby.  I shouldn't have.”  An ABC spokesperson tells TMZ … ",
    "url": "https://www.tmz.com/2024/07/09/george-stephanopoulos-president-joe-biden-cant-serve-4-more-years-sidewalk-election/"
  },
  {
    "text": "Six States Move Toward Trump in Electoral College Ratings  —  As of July 9, the Democratic Party is living in a state of suspended animation.  Despite growing calls from many in his party to leave the contest, President Joe Biden has made clear he has no intention of dropping out.",
    "url": "https://www.cookpolitical.com/analysis/national/national-politics/six-states-move-toward-trump-electoral-college-ratings"
  },
  {
    "text": "Trump airs list of false grievances at Florida rally: 'We don't eat bacon any more'  —  Ex-president returns to campaign trail in Doral and makes baseless accusations but doesn't name running mate  —  Donald Trump returned to the campaign trail in Florida on Tuesday night … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/09/trump-doral-florida-campaign-rally"
  },
  {
    "text": "A Late Play by the Biden Campaign: Running Out the Clock  —  Time is on President Biden's side.  Every day that he defies pressure to end his re-election campaign, replacing him becomes harder for Democrats.  —  President Biden's resistance to pressure to end his re-election bid appears … ",
    "url": "https://www.nytimes.com/2024/07/10/us/politics/biden-campaign-strategy.html"
  },
  {
    "text": "Playbook: Why Capitol Hill is stuck on Biden  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  FLASHING RED LIGHTS, PT. 1 — The Cook Political Report yesterday moved six states away from JOE BIDEN and toward DONALD TRUMP: Arizona, Georgia and Nevada … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/10/inertia-prevails-00167246"
  },
  {
    "text": "Biden support slips in deep blue New York: 'We're a battleground state now'  —  Democrats are worried the president is taking New York for granted as the state becomes surprisingly competitive.  —  NEW YORK — President Joe Biden has a new problem: a competitive race in deep blue New York.",
    "url": "https://www.politico.com/news/2024/07/10/biden-new-york-trouble-00167198"
  },
  {
    "text": "Democrats lose ground in 6 states with election forecaster's postdebate shift  —  Former President Trump is gaining ground in key swing states and could threaten to take states once considered to be safe for Democrats, as President Biden struggles to regain ground after a shaky debate performance … ",
    "url": "https://thehill.com/homenews/campaign/4762860-democrats-lose-ground-post-debate-election-forecaster/"
  },
  {
    "text": "House Democrats Increasingly Think Biden Is Going to Survive as the Nominee  —  It's not that Biden has convinced Democrats he's the best choice; it's that lawmakers feel too uneasy about coming out against the president publicly.  — Copy  —  After a chaotic 12 days where Joe Biden's hold … ",
    "url": "https://www.notus.org/congress/house-democrats-biden-survive"
  },
  {
    "text": "Trump Donors on the Brink of Civil War Over J.D. Vance for VP  —  KILLBILLY ELEGY  —  Part of what brought Vance to the dance may be his undoing.  Donors are scared of him. … In his rise from Donald Trump critic to viable contender to be the presumptive Republican nominee's running mate, Sen. J.D. Vance of Ohio has come so far.",
    "url": "https://www.thedailybeast.com/trump-donors-on-the-brink-of-civil-war-over-jd-vance-for-vp"
  },
  {
    "text": "Biden's dual NATO mission: Reassure America and the world … - More than 30 leaders have descended on D.C. to discuss critical issues like Ukraine's roadmap to NATO membership, air defenses against Russian missile and drone attacks, and the joint challenges posed by China.",
    "url": "https://www.axios.com/2024/07/10/biden-nato-summit-reassure-ukraine"
  },
  {
    "text": "After challenging Trump, Haley and DeSantis denied speaking slots at RNC 2024  —  After a bitter primary, former President Donald Trump's main GOP rivals Nikki Haley and Ron DeSantis have worked to make amends.  —  Haley recently released her delegates and encouraged them to support Trump.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/10/desantis-haley-denied-speaking-republican-national-convention/74347187007/"
  },
  {
    "text": "Nevada's Washoe County votes against certifying recount results of 2 local primaries  —  Commissioners in Washoe County, Nevada's second most populous county, refused Tuesday to certify the results of local recounts from two June primaries, an unusual move that may have implications … ",
    "url": "https://www.cbsnews.com/news/nevada-county-refuses-to-certify-recount-election-results/"
  },
  {
    "text": "Russia aims to undermine Biden in November election, intel officials say  —  Previous U.S. intelligence assessments dating to 2016 concluded that Russia sought to weaken support for the Democratic Party and boost Donald Trump's candidacy.  —  Russia's efforts to influence … ",
    "url": "https://www.nbcnews.com/investigations/russia-aims-undermine-biden-november-election-intel-officials-say-rcna161011"
  },
  {
    "text": "Trump's tip trick  —  As president, Donald Trump's tax policy heavily favored corporations and the wealthy.  Trump's signature tax legislation, the Tax Cuts and Jobs Act, overwhelmingly benefited those groups.  —  But, as a presidential candidate, Trump campaigns as a populist.",
    "url": "https://popular.info/p/trumps-tip-trick"
  },
  {
    "text": "Margaret Sullivan on how the media normalizes Trump  —  “When you have such a disparity between candidates, it's not fulfilling our duty to treat them as equals.”  —  ∙ Paid … When we spoke with Margaret Sullivan about a month ago to get her view on coverage of the 2024 election … ",
    "url": "https://www.publicnotice.co/p/margaret-sullivan-interview-media-trump-biden-24"
  },
  {
    "text": "There's a Reason Trump Is Suddenly Lying About Project 2025  —  With all the focus in recent weeks on President Joe Biden's age-related limitations, it's worth remembering that Donald Trump's incessant falsehoods and self-proclaimed desire to be a dictator on Day 1 make him far more unfit for the presidency.",
    "url": "https://slate.com/news-and-politics/2024/07/why-donald-trump-lying-project-2025.html"
  },
  {
    "text": "House passes measures targeting Biden appliance regulations  —  The House passed measures preventing the Energy Secretary from enforcing energy efficiency standards for various kitchen appliances, an effort by Republicans to portray the Biden administration's regulations as a war on consumers.",
    "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3075161/house-passes-measures-targeting-biden-appliance-regulations/"
  },
  {
    "text": "George Norcross pleads not guilty to corruption charges brought by NJ Attorney General  —  South Jersey political kingmaker George E. Norcross III and five co-defendants pleaded not guilty Tuesday to racketeering charges accusing them of using illegal threats, extortion and political muscle … ",
    "url": "https://www.northjersey.com/story/news/new-jersey/2024/07/09/george-norcross-iii-not-guilty-pleas-in-nj-corruption-case/74336805007/"
  },
  {
    "text": "Project 2025 ... and 1921, and 1973, and 1981  —  Terrifying blueprints for the next Republican presidency are a quadrennial tradition.  —  Donald Trump waves to the crowd at a campaign rally in Chesapeake, Virginia, June 28, 2024.  —  It's Hot Project 2025 Summer here at the Infernal Triangle!",
    "url": "https://prospect.org/politics/2024-07-10-project-2025-republican-presidencies-tradition/"
  },
  {
    "text": "“Worry less”: Biden camp tries to rally demoralized staff … - “I think there is an old African proverb that says, 'You wanna go fast, go alone. … - He added: “There's never been a president in our lifetimes — I don't know if there ever will be again — that's delivered more than President Biden.",
    "url": "https://www.axios.com/2024/07/10/biden-campaign-staff-morale-election-2024"
  },
  {
    "text": "Sailor attempted to access President Biden's restricted medical record: Navy  —  The sailor was administratively punished following an investigation.  —  President Joe Biden walks out of the White House before boarding the Marine One presidential helicopter on Feb. 28, 2024 in Washington, DC.",
    "url": "https://abcnews.go.com/US/sailor-attempted-access-president-bidens-restricted-medical-record/story?id=111780284"
  }
]