[
  {
    "text": "White House Weighs Helping Farmers as Trump Escalates Trade War  —  The Trump administration has discussed providing financial aid for farmers who may be subject to retaliation by America's trading partners.  —  Ahead of President Trump's plan to impose sweeping tariffs across the globe this week … ",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/farmers-bailouts-trump-tariffs.html"
  },
  {
    "text": "France's far-right leader Le Pen sentenced to prison and banned from office in embezzlement trial  —  Le Pen may still appeal the four-year sentence, two years of it suspended, and five-year political ban, which came after she was found guilty of misusing $3 million to pay party staff.",
    "url": "https://www.nbcnews.com/news/world/france-le-pen-marine-guilty-right-national-rally-paris-embezzlement-rcna198816"
  },
  {
    "text": "Le Pen Barred From French Presidential Run After Embezzlement Ruling  —  The court decision barred the far-right leader Marine Le Pen from seeking office for five years, jeopardizing her plans for the 2027 election.  She can appeal.  —  Marine Le Pen, the French far-right leader … ",
    "url": "https://www.nytimes.com/2025/03/31/world/europe/france-marine-le-pen-embezzlement-trial.html"
  },
  {
    "text": "Marine Le Pen barred from running for French presidency in 2027  —  Far-right leader found guilty of embezzlement of European funds and immediately barred from running for office  —  The French far-right leader Marine Le Pen has been barred from running for president in 2027 after a court found … ",
    "url": "https://www.theguardian.com/world/2025/mar/31/marine-le-pen-barred-from-running-for-french-presidency-in-2027"
  },
  {
    "text": "John Roberts created a monster.  It's about to eat him.  —  ✍️ ⚖️ ✍️ With corporate outlets obeying in advance, supporting independent political media is more important right now than ever.  Public Notice is possible thanks to paid subscribers.",
    "url": "https://www.publicnotice.co/p/john-roberts-trump-supreme-court-2025"
  },
  {
    "text": "Where Do You Draw the Line?  —  While I concede the legality of the administration's move against Rumeysa Öztürk, I reject its morality and prudence.  —  Last year, a Turkish graduate student at Tufts University named Rumeysa Öztürk co-wrote an op-ed … ",
    "url": "https://www.nationalreview.com/2025/03/where-do-you-draw-the-line/"
  },
  {
    "text": "Elon Musk hands out $1 million payments after Wisconsin Supreme Court declines request to stop him  —  Elon Musk gave out $1 million checks on Sunday to two Wisconsin voters, declaring them spokespeople for his political group, ahead of a Wisconsin Supreme Court election that the tech billionaire cast … ",
    "url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-giveaway-cdea66e0dcbaa53dd183e1d10bee2b35"
  },
  {
    "text": "MAGA is Bad for Business  —  And business owners were deluded to believe otherwise  —  One odd feature of U.S. politics is that businesspeople, especially small business owners, always seems to believe that they will do better under Republicans, even though history shows that business does better under Democrats.",
    "url": "https://paulkrugman.substack.com/p/autocracy-is-bad-for-business"
  },
  {
    "text": "Mike Waltz Is Losing Support Inside the White House  —  Although Trump decided not to fire his national security adviser over the Signal group chat, Waltz's position is tenuous, officials say  —  WASHINGTON—President Trump has decided for now not to fire his national security adviser … ",
    "url": "https://www.wsj.com/politics/policy/mike-waltz-is-losing-support-inside-the-white-house-2b17459c?st=taX7tv&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump's Threats to the Constitution Are Happening in Real Time, Not (Just) in a Third Term  —  There is no doubt in my mind that the intent of the Trump team is to retain power indefinitely, via whatever means.  —  To fight that effectively, you should focus your action and words … ",
    "url": "https://www.emptywheel.net/2025/03/31/trumps-threats-to-the-constitution-are-happening-in-real-time-not-just-in-a-third-term/"
  },
  {
    "text": "136. Setting the Record Straight on the Anti-Trump Injunctions  —  Welcome back to “One First,” a weekly newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  —  Every Monday morning, I'll be offering an update on goings-on at the Court (\"On the Docket\"); … ",
    "url": "https://www.stevevladeck.com/p/136-setting-the-record-straight-on"
  },
  {
    "text": "American progress in peril  —  The U.S. is freezing research funding, canceling projects, firing thousands of federal scientists and creating an atmosphere of uncertainty that scientists warn could slam the brakes on progress.  —  Why it matters: America has enjoyed decades of dominance … ",
    "url": "https://www.axios.com/2025/03/31/us-science-china-trump"
  },
  {
    "text": "America's Future Is Hungary  —  MAGA conservatives love Viktor Orbán.  But he's left his country corrupt, stagnant, and impoverished.  —  flashy hotels and upmarket restaurants now dominate the center of Budapest, a city once better known for its shabby facades.",
    "url": "https://www.theatlantic.com/magazine/archive/2025/05/viktor-orban-hungary-maga-corruption/682111/?gift=hVZeG3M9DnxL4CekrWGK3x9sHVa0LDGR9gcTv0mlsRo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Chuck Schumer Is Pushing Young People Away From the Democratic Party With His Toothless Leadership  —  In this op-ed, a former Schumer staffer explains why they blame their former boss for the party's failures.  —  I walked away from my job as a writer for Senator Chuck Schumer after realizing … ",
    "url": "https://www.teenvogue.com/story/chuck-schumer-young-people-democratic-party"
  },
  {
    "text": "How the Social Security Administration and DOGE are gaslighting Americans  —  The Social Security Administration (SSA) sent an email on March 27 to beneficiaries saying that reports that field offices were closing was an invention of fake news media.  “Recent reports in the media that the … ",
    "url": "https://popular.info/p/how-the-social-security-administration-fff"
  },
  {
    "text": "The Great Grovel: How Trump forced elite institutions to bend to his will  —  The lessons we can take from how easily institutions have folded to Trump's remarkable revenge campaign.  —  One after another, a parade of the wealthiest and most elite institutions in American life since … ",
    "url": "https://www.politico.com/news/2025/03/31/trump-institutions-grovel-law-media-business-028840"
  },
  {
    "text": "Is this the Democrats' Tea Party moment?  —  Minnesota Gov. Tim Walz summed up the state of his party well recently, “The Democratic Party is unified — they're unified in being pissed off at the Democrats.”  —  Just 44 percent of Democrats are satisfied with the job Senate Minority Leader Chuck Schumer is doing.",
    "url": "https://www.vox.com/politics/406357/democrat-tea-party-anger-rage-base-bernie-aoc-schumer-primary"
  },
  {
    "text": "FBI raids home of prominent computer scientist who has gone incommunicado … A prominent computer scientist who has spent 20 years publishing academic papers on cryptography, privacy, and cybersecurity has gone incommunicado, had his professor profile, email account, and phone number removed … ",
    "url": "https://arstechnica.com/security/2025/03/computer-scientist-goes-silent-after-fbi-raid-and-purging-from-university-website/"
  },
  {
    "text": "Scores of child-care centers at risk after Trump officials gut federal office  —  Child-care centers in federal buildings are at risk of lower quality and higher costs after the closure of the GSA office overseeing them.  —  Families with children enrolled in scores of child-care centers … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/03/30/gsa-child-care-centers-federal-buildings/"
  },
  {
    "text": "Trump's insane pardons are killing any faint flicker of justice in America  —  The Oglala Sioux, and the historic Pine Ridge Reservation in South Dakota where many tribal members still live, have often witnessed the American government on its worst behavior.",
    "url": "https://www.inquirer.com/opinion/commentary/trump-pardons-archer-watson-milton-20250330.html"
  },
  {
    "text": "‘Mission South Africa’: How Trump Is Offering White Afrikaners Refugee Status  —  The United States has banned most refugees, including 20,000 people who were already approved for entry before President Trump took office.  But Mr. Trump is making one exception.",
    "url": "https://www.nytimes.com/2025/03/30/us/politics/trump-south-africa-white-afrikaners-refugee.html"
  },
  {
    "text": "Trump's U.S.A.I.D. Cuts Hobble Earthquake Response in Myanmar  —  While China, Russia and other nations have rushed emergency response teams to the devastated country, the U.S., once a leader in foreign aid, has been slow to act.  —  China, Russia and India have dispatched emergency teams and supplies to earthquake-ravaged Myanmar.",
    "url": "https://www.nytimes.com/2025/03/30/world/asia/myanmar-earthquake-usaid-cuts.html"
  },
  {
    "text": "Bodies of missing aid workers found in Gaza ‘mass grave’ following Israeli attacks  —  The bodies of more than a dozen aid workers have been recovered in southern Gaza from what a United Nations agency described as a “mass grave,” a week after they went missing following attacks by Israeli forces.",
    "url": "https://cnn.com/2025/03/31/middleeast/aid-workers-found-gaza-mass-grave-intl-hnk/"
  }
]