[
  {
    "text": "Pro-DeSantis super PAC debate memo stirs anger and confusion from fundraisers and donors  —  The apparent attempt by a super PAC supporting Florida Gov. Ron DeSantis to float potential debate talking points to the Republican's presidential campaign has stirred confusion and anger from fundraisers and donors, multiple sources told CNN.",
    "url": "https://www.cnn.com/2023/08/17/politics/desantis-super-pac-debate-memo/"
  },
  {
    "text": "Miami Mayor Francis Suarez, a fierce DeSantis critic, claims he's qualified for presidential debate  —  Miami Mayor Francis Suarez claimed on Friday that he has qualified for next week's Republican presidential debate and would become the ninth White House hopeful to meet the fundraising … ",
    "url": "https://apnews.com/article/francis-suarez-miami-mayor-republican-debate-president-5898b380b1d239a94d9de358e72253b7"
  },
  {
    "text": "Trump Plans to Skip G.O.P. Debate for Interview With Tucker Carlson  —  The former president's apparent decision to skip the first debate is a major affront both to the Republican National Committee and to Fox News, which is hosting the event.  —  Former President Donald J. Trump plans … ",
    "url": "https://www.nytimes.com/2023/08/18/us/politics/trump-debate-tucker-carlson.html"
  },
  {
    "text": "A GOP challenger's frank talk about ‘sexual sin’  —  FITZPATRICK'S FOE DETAILS PORN ADDICTION  —  Pennsylvania Republican Mark Houck, who is challenging Rep. Brian Fitzpatrick from the right in a battleground district, revealed during a 2020 interview that he “struggled” … ",
    "url": "https://www.politico.com/newsletters/huddle/2023/08/18/a-gop-challengers-frank-talk-about-sexual-sin-00111808"
  },
  {
    "text": "‘Pathetic’: Voters of color slam Biden's performance on the economy  —  “Our economy is the lowest it's been.”  —  In a focus group last week, eight men of color who voted for President Joe Biden in 2020 were asked to describe their feelings about the economy.  —  The answers were bleak.",
    "url": "https://www.politico.com/news/2023/08/18/bidens-reelection-economy-voters-of-color-00111730"
  },
  {
    "text": "Gen. Milley on Ukraine, Tuberville and ‘wokeness’  —  Good morning, Early Birds.  Sadly, a missed opportunity with this one-time real-life Barbie Dreamhouse.  But has anyone built the Mojo Dojo Casa House?  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2023/08/18/gen-milley-ukraine-tuberville-wokeness/"
  },
  {
    "text": "Rudy Giuliani Was Never 'America's Mayor'  —  On Monday, Rudy Giuliani was indicted in Georgia for his role in what prosecutors called a conspiracy to overturn the results of the 2020 presidential election in that state.  —  The district attorney for Fulton County, Fani Willis … ",
    "url": "https://www.nytimes.com/2023/08/18/opinion/rudy-giuliani-trump-authoritarianism.html"
  },
  {
    "text": "Kenneth Chesebro, alleged architect of fake electors' plot, followed Alex Jones around Capitol grounds on January 6th  —  When conspiracy theorist Alex Jones marched his way to the US Capitol on January 6, 2021, riling up his legion of supporters, an unassuming middle-aged man in a red “Trump 2020” hat conspicuously tagged along.",
    "url": "https://www.cnn.com/2023/08/18/politics/kfile-kenneth-chesebro-followed-alex-jones-capitol-riot-jan-6/"
  },
  {
    "text": "Gavin Newsom's future hinges on San Francisco  —  Newsom has increasingly been moonlighting as a quasi-city executive of his hometown and approaching its woes as a litmus test for his success in Sacramento.  —  SAN FRANCISCO — Gavin Newsom hasn't been mayor of San Francisco for more than a decade … ",
    "url": "https://www.politico.com/news/2023/08/18/san-francisco-gavin-newsom-homeless-00111777"
  },
  {
    "text": "‘Lock Them Up’ is Now the Republican Party's Highest Goal … Donald Trump's supporters, as you might expect, have not taken his latest indictment in stride.  Charlie Kirk, writing in the Federalist, proposes a list of Democrats or liberal groups to charge in retaliation, proposing Hunter Biden … ",
    "url": "https://nymag.com/intelligencer/2023/08/lock-them-up-is-now-the-republican-partys-highest-goal.html"
  },
  {
    "text": "California officer accused in probe of racist texts kept ‘gory’ police dog injury photos for himself, authorities say  —  Three officers “touted” their use of excessive force and collected “trophies,” according to an indictment unsealed Thursday.  —  Three Northern California police officers … ",
    "url": "https://www.nbcnews.com/news/us-news/california-officer-accused-probe-racist-texts-kept-gory-police-dog-inj-rcna100516"
  },
  {
    "text": "Prosecutors seek 27 to 33 years in prison for Proud Boys guilty of seditious conspiracy  —  Enrique Tarrio, Joseph Biggs, Ethan Nordean and Zachary Rehl were all convicted of seditious conspiracy in May following a months-long trial that began in January.  —  WASHINGTON — Federal prosecutors … ",
    "url": "https://www.nbcnews.com/politics/justice-department/prosecutors-seek-30-years-prison-proud-boys-seditious-conspiracy-case-rcna100277"
  },
  {
    "text": "Science loses in Montana court  —  Would the weather in Montana change tomorrow if the state suddenly shut down all of its coal mines, natural gas power plants, and oil refineries?  Any honest scientist would tell you no.  —  But according to a far-left state judge, the wealthiest children … ",
    "url": "https://www.washingtonexaminer.com/opinion/editorials/science-loses-in-montana-court"
  },
  {
    "text": "EXCLUSIVE: Senate Democrats' campaign arm launches billboard campaign targeting Justice amid lawsuit over his schedule  —  The Senate Democrats' campaign arm on Friday launched a billboard campaign in West Virginia targeting Gov. Jim Justice (R) after the Democratic group sued the governor for the release of his official schedule.",
    "url": "https://thehill.com/homenews/campaign/4158044-exclusive-senate-democrats-campaign-arm-launches-billboard-campaign-targeting-justice/"
  },
  {
    "text": "American democracy is cracking.  These forces help explain why.  —  Behind the sense that the political system is broken lies a collision between forces both old and new  —  In a country where the search for common ground is increasingly elusive, many Americans can agree on this … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/18/american-democracy-political-system-failures/"
  },
  {
    "text": "Trump PAC foots bill for private investigator in Manhattan criminal case, E. Jean Carroll trial  —  As Donald Trump's New York legal troubles began to mount this spring, his lawyers and political action committee sought the help of Sean Crowley, a local private eye.",
    "url": "https://www.cbsnews.com/news/trump-pac-private-investigator-manhattan-criminal-case-e-jean-carroll-trial/"
  },
  {
    "text": "GOP Presidential Hopeful Ramaswamy Sued Over Strive's Practices  —  In separate lawsuits, two former employees at the candidate's Strive Asset Management claim that the anti-ESG investment firm pressured them to violate securities laws.  —  Vivek Ramaswamy has been rising in presidential polls partly … ",
    "url": "https://www.bloomberg.com/news/articles/2023-08-18/republican-candidate-vivek-ramaswamy-sued-over-strive-s-practices"
  },
  {
    "text": "The Benefits and Drawbacks to Charging Trump Like a Mobster  —  Racketeering statutes allow prosecutors to arrange many characters and a broad set of allegations into a single narrative.  Making the story cohere can be a challenge.  —  On Monday night, Donald Trump and eighteen other people … ",
    "url": "https://www.newyorker.com/news/q-and-a/the-benefits-and-drawbacks-to-charging-trump-like-a-mobster"
  },
  {
    "text": "Income-based U.S. household carbon footprints (1990-2019) offer new insights on emissions inequality and climate finance  — https://doi.org/10.1371/journal.pclm.00 00190  —  Current policies to reduce greenhouse gas (GHG) emissions and increase adaptation and mitigation funding are insufficient … ",
    "url": "https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000190#sec015"
  }
]