[
  {
    "text": "House Republican moves to rein in tariff powers  —  Nebraska Rep. Don Bacon said he plans to introduce a companion bill to the bipartisan Senate legislation aimed at reclaiming Congress' authority over tariffs, becoming the first House Republican to openly challenge the powers President Donald Trump … ",
    "url": "https://www.politico.com/live-updates/2025/04/04/congress/don-bacon-tariff-powers-bill-00273307"
  },
  {
    "text": "Trump Tax Cut, Debt Limit Plan Advances Amid Tariff Turmoil  —  Senate Republicans took a major step toward enacting President Donald Trump's tax cut agenda and increasing the debt ceiling that could inject a small degree of certainty into financial markets roiled by the president's tariff policies.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-05/trump-tax-cut-debt-limit-plan-advances-as-tariffs-roil-markets"
  },
  {
    "text": "‘Everyone is terrified’: Business and government officials are afraid to cross Trump on tariffs  —  While lobbyists, business leaders, and lawmakers are worried about Donald Trump's tariffs, there's a culture of fear in Washington preventing many from speaking out.",
    "url": "https://www.politico.com/news/2025/04/04/trump-tariffs-fear-lobby-business-congress-00006608"
  },
  {
    "text": "Senate GOP approves framework for Trump's tax breaks and spending cuts after late-night session  —  Senate Republicans plugged away overnight and into early Saturday morning to approve their multitrillion-dollar tax breaks and spending cuts framework, hurtling past hardened Democratic opposition toward … ",
    "url": "https://apnews.com/article/senate-budget-tax-cuts-trump-485845a9c0b7dfc5d2194d4c1e4723ae"
  },
  {
    "text": "Buffett denies social media rumors after Trump shares wild claim that investor backs president crashing market  —  WATCH NOW  —  Warren Buffett went on the record Friday to deny social media posts after President Donald Trump shared on Truth Social a fan video that claimed the president … ",
    "url": "https://www.cnbc.com/2025/04/04/buffett-denies-social-media-rumors-after-trump-shares-wild-claim-that-investor-backs-president-crashing-market.html"
  },
  {
    "text": "A stunning number of electric vehicle, battery factories are being canceled  —  Billions of dollars in clean energy projects have been canceled since Donald Trump took office again.  —  Just now  —  Over the past few years, electric vehicle manufacturing facilities producing lithium batteries … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/04/03/ev-factories-canceled/"
  },
  {
    "text": "Obama Calls for Universities to Stand Up for Core Values  —  As the Trump administration threatens universities, the former president suggested schools shouldn't be intimidated.  But he also offered a critique of campus culture, saying it had too often shut out opposing voices.",
    "url": "https://www.nytimes.com/2025/04/04/us/politics/obama-trump-college-speech.html"
  },
  {
    "text": "Obama calls on citizens, colleges and law firms to resist Trump agenda  —  In a campus speech, the former president said universities should be prepared to lose federal funds to defend academic freedom, rather than be “intimidated.”  —  Just now  —  Former president Barack Obama called … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/05/obama-trump-universities-intimidation/"
  },
  {
    "text": "President Trump's Tariff Formula Makes No Economic Sense.  It's Also Based on an Error.  —  President Trump on Wednesday announced tariffs on practically every foreign country (and some non-countries), ranging from a 10 percent minimum all the way up to 50 percent.",
    "url": "https://www.aei.org/economics/president-trumps-tariff-formula-makes-no-economic-sense-its-also-based-on-an-error/"
  },
  {
    "text": "Inside President Trump's whirlwind decision to upend global trade  —  Ultimately, Trump resolved to follow his own instincts — and was surrounded by senior officials who enabled him.  —  Not long after President Donald Trump's inauguration, the administration's economic staff went to work … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/04/trump-tariffs-reason-advisers/"
  },
  {
    "text": "Judge orders Trump administration to bring back Md. man mistakenly deported  —  U.S. officials have argued in court records that the United States is powerless to effectuate his return because he is now in Salvadoran custody, and that Kilmar Abrego García's lawyers have “not clearly shown” that he would face harm in the prison.",
    "url": "https://www.washingtonpost.com/immigration/2025/04/04/judge-orders-trump-administration-bring-back-md-man-mistakenly-deported/"
  },
  {
    "text": "IRS will cut 25% of its employees, eliminating its civil rights office  —  The tax agency began telling employees about the coming reduction in emails sent Friday.  —  Just now  —  The Internal Revenue Service plans to eliminate nearly a quarter of its workforce in layoffs starting Friday … ",
    "url": "https://www.washingtonpost.com/business/2025/04/04/irs-will-cut-25-its-employees-eliminating-its-civil-rights-office/"
  },
  {
    "text": "U.S. Peace Corps says Musk's DOGE has arrived at its HQ  —  Members of Elon Musk's cost-cutting team arrived at Peace Corps headquarters in Washington, the agency told Reuters, a signal it could become the latest U.S. government agency to face job cuts.  —  “Staff from the Department … ",
    "url": "https://www.reuters.com/world/us/us-peace-corps-says-musks-cost-cutting-team-has-arrived-its-hq-2025-04-04/"
  },
  {
    "text": "Supreme Court Lets Trump Suspend Grants to Teachers  —  The justices allowed the Trump administration to temporarily suspend $65 million in teacher-training grants, which helped place teachers in poor and rural areas.  —  The Supreme Court on Friday let the Trump administration temporarily … ",
    "url": "https://www.nytimes.com/2025/04/04/us/supreme-court-trump-teacher-grants.html"
  },
  {
    "text": "Appeals Court Orders Thousands of Voters to Verify Information in Contested N.C. Election  —  The ruling was a win for the Republican who narrowly lost a State Supreme Court race in November.  The case has tested the boundaries of post-election litigation.  —  In the prolonged legal battle … ",
    "url": "https://www.nytimes.com/2025/04/04/us/north-carolina-supreme-court-race-ruling.html"
  },
  {
    "text": "Hundreds of law firms, former judges sign onto briefs in support of Perkins Coie  —  Hundreds of law firms and former judges have signed onto friend-of-the-court briefs in support of Perkins Coie as the law firm challenges President Trump's executive order targeting it.",
    "url": "https://thehill.com/regulation/court-battles/5233200-law-firms-judges-trump-executive-order-perkins-coie/amp/"
  },
  {
    "text": "Ousted Vaccine Chief Says RFK Jr.'s Team Sought Data to Justify Anti-Science Stance  —  Peter Marks says the new health secretary's team wants to show vaccines aren't safe while promoting dangerous and unproven treatments  —  The top vaccine regulator ousted by Robert F. Kennedy Jr … ",
    "url": "https://www.wsj.com/health/healthcare/peter-marks-fda-vaccine-regulator-rfk-jr-interview-9194e3b4?st=1PG4LK"
  },
  {
    "text": "RFK Jr. Says He's Rehiring Thousands Of People He Mistakenly Fired  —  The cuts were a mistake he'd always planned to make, Kennedy said in head-scratching remarks.  —  Robert F. Kennedy Jr., secretary of the Health and Human Services Department, told reporters Thursday that he plans … ",
    "url": "https://www.huffpost.com/entry/rfk-jr-hhs-employees-mistakenly-fired_n_67f00a4be4b06ba13d223fde"
  },
  {
    "text": "George Santos Should Get Seven Years for Campaign Fraud, US Says  —  Trump's $1.6 Trillion Corporate Pledge Parade: What's Real, What's Not … Year of Elections",
    "url": "https://www.bloomberg.com/news/articles/2025-04-04/george-santos-should-get-7-years-for-campaign-fraud-us-says"
  },
  {
    "text": "New York Warns Trump It Will Not Comply With Public School D.E.I. Order  —  New York's stance differed from the muted and deferential responses from other major institutions to the administration's threats.  —  The New York State Education Department on Friday issued a defiant response … ",
    "url": "https://www.nytimes.com/2025/04/04/us/politics/new-york-trump-dei-order.html"
  },
  {
    "text": "Trump Rejects Biden Plan to Expand Medicare Coverage for Obesity Drugs  —  Administration officials reversed a decision made during the Biden presidency that would have given millions of people access to weight-loss drugs paid for Medicare and Medicaid.  —  The Trump administration … ",
    "url": "https://www.nytimes.com/2025/04/04/health/trump-wegovy-obesity-drugs-medicare.html"
  },
  {
    "text": "China hit brakes on TikTok deal after Trump announced wide-ranging tariffs, AP source says  —  President Donald Trump on Friday said he is signing an executive order to keep TikTok running in the U.S. for another 75 days to give his administration more time to broker a deal to bring the social media platform under American ownership.",
    "url": "https://apnews.com/article/trump-tiktok-china-bytedance-social-media-tariffs-665e46fd5bb555e97c4d7301e07230df"
  }
]