[
  {
    "text": "A megabill mystery: New solar and wind tax comes as a surprise to Republican senators  —  “I don't know where it came from,” Sen. Lindsey Graham, R-S.C., the chairman of the Senate Budget Committee, told NBC News after he released the 940-page legislation.  —  WASHINGTON — Tucked inside … ",
    "url": "https://www.nbcnews.com/politics/congress/megabill-mystery-new-solar-wind-tax-surprise-republican-senators-rcna216120"
  },
  {
    "text": "Senate GOP scrambles to save Alaska SNAP carveout  —  Senate Republicans are racing to salvage a food aid carveout for Alaska and Hawaii in their policy megabill after the parliamentarian privately signaled the plan wouldn't meet strict Senate rules as written.",
    "url": "https://www.politico.com/live-updates/2025/06/30/congress/senate-gop-scrambles-to-save-alaska-snap-carveout-00434310"
  },
  {
    "text": "ICE will require lawmakers to give a week's notice before detention visits. … Where Things Stand  — Domestic policy bill: The White House reiterated President Trump's Friday deadline for passage of a sweeping economic and domestic policy bill being hammered out in the Senate … ",
    "url": "https://www.nytimes.com/live/2025/06/30/us/trump-news"
  },
  {
    "text": "Murkowski slams brakes on megabill  —  IN TODAY'S EDITION:  — Inside Senate GOP leaders' overnight whip effort  — The next funding battle begins  — WH defends pocket rescissions in court  —  Senate Majority Leader John Thune's ability to pass the “big, beautiful bill” is hinging on Sen. Lisa Murkowski.",
    "url": "https://www.politico.com/newsletters/inside-congress/2025/07/01/murkowski-slams-brakes-on-megabill-00434737"
  },
  {
    "text": "Bush, Obama — and singer Bono — fault Trump's gutting of USAID on agency's last day  —  Former Presidents Barack Obama and George W. Bush delivered rare open criticism of the Trump administration — and singer Bono recited a poem — in an emotional video farewell Monday with staffers of the U.S. Agency for International Development.",
    "url": "https://apnews.com/article/obama-bono-bush-usaid-trump-950f7708c01502c759f1c10524752b8e"
  },
  {
    "text": "USAID cuts may cause over 14 million additional deaths by 2030, study says  —  Deep funding cuts to the U.S. Agency for International Development and its potential dismantling could result in more than 14 million additional deaths by 2030, according to research published in The Lancet medical journal on Monday.",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/usaid-cuts-may-cause-over-14-million-additional-deaths-by-2030-study-says-2025-07-01/"
  },
  {
    "text": "Bush, Obama and Bono Commend USAID Staff Members on Their Last Day  —  Two ex-presidents and a rock star thanked the outgoing workers of a doomed agency.  —  As most staff members at the U.S. Agency for International Development marked their final day with the agency, they got thanks from two presidents and a rock star.",
    "url": "https://www.nytimes.com/2025/06/30/us/politics/usaid-staff-obama-bush-bono.html"
  },
  {
    "text": "Suspected Idaho shooter showed ‘Nazi tendencies’ in school, ex-classmates say: Updates  —  The man accused of fatally shooting two firefighters in an ambush in rural Idaho on Sunday had “Nazi tendencies” in school, sketched pictures of guns and swastikas in a notebook and was “obsessed with guns,” three former classmates told USA TODAY.",
    "url": "https://www.usatoday.com/story/news/nation/2025/06/30/idaho-firefighters-shot-sniper-gunman/84413135007/"
  },
  {
    "text": "Judge again delays Abrego Garcia's release from Tennessee jail over deportation concerns  —  Kilmar Abrego Garcia will stay in jail for now over concerns from his lawyers that he could be deported if he's released to await his trial on human smuggling charges, a federal judge in Tennessee ruled Monday.",
    "url": "https://apnews.com/article/abrego-garcia-deportation-immigration-trump-a94b2d9101bb0da10e6998bead07b9c2"
  },
  {
    "text": "California Rolls Back Its Landmark Environmental Law  —  Gov. Gavin Newsom had demanded changes to address the state's housing crisis, a philosophical shift for Democratic leaders.  —  California leaders on Monday rolled back a landmark law that was a national symbol of environmental protection … ",
    "url": "https://www.nytimes.com/2025/06/30/us/california-environment-newsom-ceqa.html?unlocked_article_code=1.TE8.B0UZ.zKi4gTibOf4R&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump signs executive order lifting sanctions on Syria  —  He had previously announced he would do so in hopes of stabilizing the country.  —  President Donald Trump speaks during a meeting with Democratic Republic of the Congo's Foreign Minister Therese Kayikwamba Wagner … ",
    "url": "https://abcnews.go.com/Politics/trump-signs-executive-order-lifting-sanctions-syria/story?id=123349843"
  },
  {
    "text": "Alligator Alcatraz immigrant prison camp is Florida's sadistic ‘one-stop shop’ for mass deportation  —  Trump will attend the opening on Tuesday with Gov. DeSantis and DHS Sec. Noem. … The Florida GOP announced via X on Friday: “Feds approve Alligator Alcatraz: Florida's gator-guarded prison for illegal aliens.",
    "url": "https://www.thehandbasket.co/p/alligator-alcatraz-florida-opening-trump-desantis"
  },
  {
    "text": "Team Trump Is Serious About Unleashing the Espionage Act on the Media  —  It is more likely a matter of when, not if, the administration tries to prosecute journalists using the arcane law  —  Donald Trump hates leakers.  He isn't a fan of journalists, either.",
    "url": "https://www.rollingstone.com/politics/politics-features/espionage-act-team-trump-plan-media-1235376198/"
  },
  {
    "text": "Indiana public colleges cut almost 20% of degrees  —  Public Indiana colleges and universities will eliminate 19 percent of their degree programs to meet requirements added to the state's budget, according to the Commission for Higher Education.  —  The institutions volunteered to cut … ",
    "url": "https://www.ipm.org/news-section/2025-06-30/indiana-public-colleges-cut-almost-20-of-degrees"
  },
  {
    "text": "A Court Without the Range  —  “O for a Supreme Court which shall be as true, as vigilant, as active, and exacting in maintaining laws enacted for the protection of human rights as in other days was that Court for the destruction of human rights!”  -Frederick Douglass",
    "url": "https://sherrilyn.substack.com/p/a-court-without-the-range"
  },
  {
    "text": "Paramount, Trump in ‘advanced’ discussions to settle $20 billion lawsuit  —  The parties asked a Texas judge on Monday to pause case deadlines until Thursday as negotiations over the suit play out.  —  Summary162  —  A settlement appears close in President Donald Trump's lawsuit … ",
    "url": "https://www.washingtonpost.com/style/media/2025/06/30/paramount-trump-lawsuit-settlement-talks/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxMjU2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyNjM4Mzk5LCJpYXQiOjE3NTEyNTYwMDAsImp0aSI6IjU3MWYwY2M3LWQxYjgtNDkyOC04YWVkLWRjOWE3NTExZDQ3NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zdHlsZS9tZWRpYS8yMDI1LzA2LzMwL3BhcmFtb3VudC10cnVtcC1sYXdzdWl0LXNldHRsZW1lbnQtdGFsa3MvIn0.XYfPy0OmE4gElFbhOGwkggS4aNrxmwfjH5BSC0Nx7Mk&itid=gfta"
  },
  {
    "text": "Supreme Court Rules Some Americans Have a Constitutional Right to Insist on Theocracy  —  There have been any number of awful decisions from the current Supreme Court, but last week marked a clear breaking point for the American rule of law.  You need only look to the second-worst decision of Friday … ",
    "url": "https://slate.com/news-and-politics/2025/06/supreme-court-rules-constitutional-right-theocracy.html"
  },
  {
    "text": "Elon Musk Promises a New Political Party if Republicans Pass Trump's Policy Bill  —  Elon Musk Promises a New Political Party if the G.O.P. Bill Passes  —  There's a Race to Power the Future.  China Is Pulling Away.  —  Beijing is selling clean energy to the world; Washington is pushing oil and gas.",
    "url": "https://www.nytimes.com/2025/06/30/us/politics/elon-musk-trump-bill-republicans.html"
  },
  {
    "text": "Scoop: Roy Cooper leans toward N.C. Senate bid, potential Trump showdown  —  North Carolina Democrats are getting closer to the gift they've have been asking for all year, with former Gov. Roy Cooper (D) leaning toward a Senate run in the state President Trump has won three times.",
    "url": "https://www.axios.com/2025/07/01/north-carolina-senate-roy-cooper-lara-trump"
  },
  {
    "text": "There's a Race to Power the Future.  China Is Pulling Away.  —  Beijing is selling clean energy to the world, Washington is pushing oil and gas.  Both are driven by national security.  —  By David Gelles in New York; Somini Sengupta in Brasília and in Tirunelveli, India … ",
    "url": "https://www.nytimes.com/interactive/2025/06/30/climate/china-clean-energy-power.html?unlocked_article_code=1.S08.RCe_.yuinSTAhPiWG&smid=url-share"
  },
  {
    "text": "‘I wanted to do something to fight back’: This iPhone app alerts users to nearby ICE sightings  —  New York CNN  —  Joshua Aaron has worked in and around the tech industry for around two decades.  He built his first app — a blackjack game — at computer camp when he was 13.",
    "url": "https://cnn.com/2025/06/30/tech/iceblock-app-trump-immigration-crackdown"
  },
  {
    "text": "Erika Donalds talks education policy and gov race  —  Good morning and welcome to Monday.  —  Gubernatorial candidate Rep. BYRON DONALDS shot to fame in conservative politics largely thanks to his role as a key surrogate for President DONALD TRUMP.  —  But his wife, ERIKA DONALDS … ",
    "url": "https://www.politico.com/newsletters/florida-playbook/2025/06/30/erika-donalds-education-powerhouse-00432208"
  },
  {
    "text": "Trump Insults America—Again  —  The president of the United States seems to have no interest in appealing to a national sense of pride or honor.  —  Oops, he did it again.  —  On Sunday, President Donald Trump had a rambling conversation with the Fox Business host Maria Bartiromo.",
    "url": "https://www.theatlantic.com/newsletters/archive/2025/06/trump-insults-americaagain/683384/?gift=PUGLa-mGupQ6uJoaPKPPd6O9_CLZsOW7sIMp7fwAp0s&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump imposes tougher US policy toward Cuba  —  President Donald Trump on Monday signed a memorandum imposing a hard-line U.S. policy toward communist-run Cuba and reversing measures put in place by former President Joe Biden, the White House said.  —  The directive will enforce a statutory ban … ",
    "url": "https://www.reuters.com/world/americas/trump-signs-memo-toughening-us-policy-toward-cuba-white-house-official-says-2025-06-30/"
  },
  {
    "text": "‘60 Minutes’ Draws the Line … While Paramount Global and Donald Trump negotiate behind the scenes with a mediator over a potential settlement that could decide the fate of the historic Hollywood studio, a very different kind of showdown has been unfolding inside the company—one that pits the … ",
    "url": "https://www.status.news/p/60-minutes-paramount-settlement"
  },
  {
    "text": "An 82-year-old woman who was injured in a firebomb attack in Boulder, Colorado, has died  —  An 82-year-old Colorado woman who was injured in a Molotov cocktail attack on demonstrators in support of Israeli hostages in Gaza has died, prosecutors said Monday.",
    "url": "https://apnews.com/article/boulder-attack-death-e6e45ad5a6e6becab9026994c758e09b"
  },
  {
    "text": "Americans Have Never Hated Being American More, New Poll Finds  —  As fireworks will rocket into the sky this weekend, national pride has, under Trump, sunk to its lowest point in recent memory, per a new Gallup poll.  —  Since January 2001, the polling firm has asked Americans whether … ",
    "url": "https://newrepublic.com/post/197441/american-pride-drops-gallup-poll"
  },
  {
    "text": "Justice Department Announces Coordinated, Nationwide Actions to Combat North Korean Remote Information Technology Workers' Illicit Revenue Generation Schemes  —  For Immediate Release  —  Law Enforcement Actions Across 16 States Result in Charges, Arrest, and Seizures of 29 Financial Accounts … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-announces-coordinated-nationwide-actions-combat-north-korean-remote"
  },
  {
    "text": "Sound Familiar?  Democrats Lay Groundwork for a ‘Project 2029’  —  The plan to write a policy agenda for the next Democratic president is at the center of a raging debate within the party: whether its biggest problem is its ideas or its difficulty in selling them.",
    "url": "https://www.nytimes.com/2025/06/30/us/politics/democrats-project-2029.html?unlocked_article_code=1.S08.AukU.tz_FClK0MgbY&smid=url-share"
  }
]