[
  {
    "text": "10/12/23 ☀️ Punchbowl News AM … But worse.  Maybe way worse. … Only the stakes this time are higher, the time frame is shorter, the opposition is larger and the House Republican Conference is angrier. … After winning the GOP speaker nomination on Wednesday — barely … ",
    "url": "https://punchbowl.news/archive/101223-punchbowl-news-am/"
  },
  {
    "text": "The New Republican Establishment  —  An alternative Trumpist governing elite gets closer to ruling the party.  —  In the final account, the rise and fall of Kevin McCarthy might read like the familiar tale of a Republican congressional leader toppled by a small but uncompromising right-wing faction.",
    "url": "https://www.nytimes.com/2023/10/12/upshot/new-republican-establishment-speaker.html"
  },
  {
    "text": "A new indictment charges Sen. Menendez with being an unregistered agent of the Egyptian government  —  Federal prosecutors have rewritten their indictment against U.S. Sen. Bob Menendez of New Jersey and his wife to charge them with conspiring to have him act as an agent of Egypt and Egyptian officials.",
    "url": "https://apnews.com/article/bob-menendez-indictment-c1850764b8ce7c613fc50f0e4f495e87"
  },
  {
    "text": "Menendez accused of acting as foreign agent for Egypt while helming Senate Foreign Relations Committee  —  The new indictment comes three weeks after a federal grand jury charged the senator with conspiracy to commit bribery, conspiracy to commit honest services fraud and conspiracy to commit extortion.",
    "url": "https://www.politico.com/news/2023/10/12/menendez-accused-of-acting-as-foreign-agent-for-egypt-while-helming-senate-foreign-relations-committee-00121225"
  },
  {
    "text": "Biden aides slam Trump for calling Hezbollah ‘very smart’  —  Aides to President Biden and his campaign blasted former President Trump on Thursday for remarks a night earlier in which Trump described Hezbollah as “very smart” amid unfolding violence in Israel.",
    "url": "https://thehill.com/homenews/campaign/4251829-biden-aides-slam-trump-for-calling-hezbollah-very-smart/"
  },
  {
    "text": "Donald Trump Criticizes Israel PM Benjamin Netanyahu, Calls Hezbollah ‘Very Smart’  —  The former president admitted he could have been dishing classified information at a campaign event with a claim about the Israeli leader.  —  LOADING  —  Former President Donald Trump … ",
    "url": "https://www.huffpost.com/entry/donald-trump-israel-hezbollah_n_6527b1aae4b0102e6964bb29"
  },
  {
    "text": "Six Months Ago NPR Left Twitter.  The Effects Have Been Negligible  —  A lot of people threaten to leave Twitter.  Not many of them have actually done it.  —  This was true even before Elon Musk's purchase of the platform a year ago.  But the parade of calamities since … ",
    "url": "https://niemanreports.org/articles/npr-twitter-musk/"
  },
  {
    "text": "U.S., Qatar agree to stop Iran from tapping $6 billion fund after Hamas attack  —  U.S. officials and the Qatari government have agreed to stop Iran from accessing a $6 billion account for humanitarian assistance in light of Hamas's attack on Israel, Deputy Treasury Secretary Wally Adeyemo told House Democrats … ",
    "url": "https://www.washingtonpost.com/business/2023/10/12/iran-oil-fund-us-israel/"
  },
  {
    "text": "Israel-Hamas War  —  U.N. Warns of ‘Disaster’ in Gaza as Israel Strikes Back at Hamas  —  More than 300,000 people are homeless as Israeli airstrikes pound Gaza in retaliation for the Hamas attack.  Secretary of State Antony Blinken pledged steadfast support for Israel while calling for … ",
    "url": "https://www.nytimes.com/live/2023/10/12/world/israel-gaza-war-hamas"
  },
  {
    "text": "Rep. Rashida Tlaib, facing censure motion, calls Hamas actions ‘war crimes’  —  U.S. Rep. Rashida Tlaib, D-Detroit, said Wednesday evening her critics are purposefully distorting her position to make it seem she is sympathetic to Hamas and its attacks on Israel, which she called “war crimes.”",
    "url": "https://www.freep.com/story/news/politics/2023/10/11/rashida-tlaib-israel-hamas-war-crimes/71148560007/"
  },
  {
    "text": "Wisconsin Republicans Retreat From Threats to Impeach Liberal Justice  —  Republicans had floated the idea of impeaching Janet Protasiewicz, newly seated on the Wisconsin Supreme Court, before she could undo the party's legislative gerrymander.  But on Thursday, they backed off.",
    "url": "https://www.nytimes.com/2023/10/12/us/politics/wisconsin-republicans-impeach-janet-protasiewicz.html"
  },
  {
    "text": "Republican Sen. Tuberville Warns Against ‘Picking Sides in the Middle East’ in Jaw-Dropping Interview  —  Senator Tommy Tuberville (R-AL) is under fire for telling an interviewer that “when you start picking sides in the Middle East, it can get really messy very quick” amid the violence in Israel spurred by Hamas.",
    "url": "https://www.mediaite.com/news/republican-sen-tuberville-warns-against-picking-sides-in-the-middle-east-in-jaw-dropping-interview/"
  },
  {
    "text": "Trump tells court he had no duty to ‘support’ the Constitution as president  —  Former President Donald Trump is arguing to a judge in Colorado that he was not required to “support” the Constitution as president, reported Brandi Buchman from Law & Crime.  —  The argument came as he seeks … ",
    "url": "https://www.rawstory.com/trump-wont-support-constitution/"
  },
  {
    "text": "North Carolina's cautionary tale for purple states  —  Republicans have made themselves so powerful, it doesn't matter if Dems win elections. … North Carolina Republicans are having a very good year, and now that they've locked down both the legislature and the judiciary … ",
    "url": "https://www.publicnotice.co/p/north-carolina-gop-power-grab-roy-cooper"
  },
  {
    "text": "Trump to Return to NYC Court for Civil Fraud Trial (Exclusive)  —  The 2024 GOP frontrunner plans to fly from Iowa after a Monday rally and head to New York State Supreme Court on Tuesday, Wednesday and Thursday … Donald Trump will again head from the presidential campaign trail … ",
    "url": "https://themessenger.com/politics/trump-trial-new-york-court-civil-fraud"
  },
  {
    "text": "Trump Doral event with Eric Trump will feature a Hitler-promoting antisemite who killed someone  —  This is at least the fourth Hitler-promoting antisemite who's toured with Eric Trump  —  Trump National Doral Miami is scheduled to host a ReAwaken America tour event featuring Eric Trump … ",
    "url": "https://www.mediamatters.org/eric-trump/trump-doral-event-eric-trump-will-feature-ian-smith-hitler-promoting-antisemite-who"
  },
  {
    "text": "Texas Republicans are fighting about whether it's OK to associate with white supremacists  —  Last week, Jonathan Stickland — president of the far-right Defend Texas Liberty PAC and a former state representative — met with notorious white supremacist Nick Fuentes and other right-wing extremists.",
    "url": "https://popular.info/p/texas-republicans-are-fighting-about"
  },
  {
    "text": "The Massacre in Israel and the Need for a Decent Left  —  On Tuesday evening, I was drinking on the porch of my friend and neighbor Misha Shulman, the Israel-born rabbi of a progressive New York synagogue called the New Shul.  All day, he'd been on the phone with congregants deeply distraught … ",
    "url": "https://www.nytimes.com/2023/10/12/opinion/columnists/israel-gaza-massacre-left.html"
  },
  {
    "text": "Kushner Says Schumer Told Mother's Friends He Was ‘Going to Jail’  —  Trump's son-in-law and former adviser said he spent millions in legal fees while facing accusations of campaign ties to Russia … Jared Kushner, the son-in-law of former President Donald Trump, says he had to calm … ",
    "url": "https://themessenger.com/politics/kushner-says-schumer-told-mothers-friends-he-was-going-to-jail"
  },
  {
    "text": "It's Not Me, It's You: Cornel West's Messy Breakup  —  The presidential candidate's last-minute decision to ghost the Green Party is just the latest rift within the perennially squabbling American left.  —  Cornel West thinks the Greens can't take him where he wants to go.",
    "url": "https://www.politico.com/news/magazine/2023/10/12/cornel-west-campaign-breakup-green-party-00121048"
  }
]