[
  {
    "text": "Troops and marines deeply troubled by LA deployment: ‘Morale is not great’  —  Several service members told advocacy groups they felt like pawns in a political game and assignment was unnecessary  —  California national guards troops and marines deployed to Los Angeles to help restore order … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/12/los-angeles-national-guard-troops-marines-morale"
  },
  {
    "text": "Trump is ‘not all there,’ Newsom says amid Los Angeles fight  —  The California Democrat is dinging the president on his mental acuity.  —  California Gov. Gavin Newsom is hitting Donald Trump with an attack the president and his base know all too well: the president's mental acuity.",
    "url": "https://www.politico.com/news/2025/06/12/newsom-trump-mental-fitness-00402459"
  },
  {
    "text": "LAPD Chief Calls BS on Trump's Claim That Cops Asked Him for Troops  —  DIDN'T HAPPEN  —  Jim McDonnell says police were “nowhere near” the stage where they needed federal assistance to control immigration protests.  —  The chief of the Los Angeles Police Department has shot … ",
    "url": "https://www.thedailybeast.com/lapd-chief-jim-mcdonnell-calls-bs-on-donald-trumps-claim-that-cops-asked-for-troops/"
  },
  {
    "text": "Most say the upcoming military parade is not a good use of government funds  —  Forty percent approve of the military parade honoring the 250th anniversary of the U.S. Army, and 60% say it is not a good use of government funds.  Similar shares, about 3 in 10, feel the U.S. government spends … ",
    "url": "https://apnorc.org/projects/most-say-the-upcoming-military-parade-is-not-a-good-use-of-government-funds/"
  },
  {
    "text": "This Is Not a Drill  —  American democracy is on the line right now  —  There are two disastrously wrong ways to read the news from Los Angeles right now, and the rest of America over the next few days.  The first is to believe that there is actually anything resembling an insurrection underway.",
    "url": "https://paulkrugman.substack.com/p/this-is-not-a-drill"
  },
  {
    "text": "Bragg Soldiers Who Cheered Trump's Political Attacks While in Uniform Were Checked for Allegiance, Appearance  —  It was supposed to be a routine appearance, a visit from the commander in chief to rally the troops, boost morale and celebrate the Army's 250th-birthday week … ",
    "url": "https://www.military.com/daily-news/2025/06/11/bragg-soldiers-who-cheered-trumps-political-attacks-while-uniform-were-checked-allegiance-appearance.html"
  },
  {
    "text": "Guard Soldiers Deployed in Trump's LA Crackdown Aren't Getting Paid Yet  —  The 4,000 California National Guard soldiers who President Donald Trump surged into Los Angeles remain unpaid due to delays in issuing official activation orders, leaving compensation and benefits in limbo.",
    "url": "https://www.military.com/daily-news/2025/06/11/guard-soldiers-deployed-trumps-la-crackdown-arent-getting-paid-yet.html"
  },
  {
    "text": "“Delay, Interfere, Undermine”  — Investigation Impeded: Despite Salvadoran President Nayib Bukele's crime fighter reputation, his top aides blocked extraditions of MS-13 leaders to the U.S., officials say.  — Money Laundering Inquiry: U.S. agents drew up a request to examine whether Bukele … ",
    "url": "https://www.propublica.org/article/bukele-trump-el-salvador-ms13-gang-vulcan-corruption-investigation"
  },
  {
    "text": "Israel is poised to launch operation on Iran, sources say  —  U.S. officials have been told Israel is fully ready to launch an operation into Iran, multiple sources told CBS News.  —  The U.S. anticipates Iran could retaliate on certain American sites in neighboring Iraq.",
    "url": "https://www.cbsnews.com/news/israel-is-poised-to-launch-operation-on-iran-sources-say/"
  },
  {
    "text": "Israel Appears Ready to Attack Iran, Officials in U.S. and Europe Say  —  Concern about a strike and the prospect of retaliation led the United States to withdraw diplomats from Iraq and authorize the voluntary departure of U.S. military family members from the Middle East.",
    "url": "https://www.nytimes.com/2025/06/11/us/politics/iran-us-iraq-diplomats-middle-east.html?unlocked_article_code=1.OE8.3TSo.jx18Vnc-5S60&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Inside a Courthouse, Chaos and Tears as Trump Accelerates Deportations  —  Immigration courtrooms in New York City have emerged as a flashpoint, with masked agents making surprise arrests of immigrants who have appeared for routine hearings and check-ins.  —  Inside an immigration courthouse … ",
    "url": "https://www.nytimes.com/2025/06/12/nyregion/immigration-courthouse-arrests-trump-deportation.html"
  },
  {
    "text": "David Hogg to Exit D.N.C. After Backlash to His Primary Plan  —  Mr. Hogg said he would not run again for vice chair after the party voted for a new election.  Democrats have been furious at his plan to challenge the party's sitting lawmakers in primary races.",
    "url": "https://www.nytimes.com/2025/06/11/us/politics/david-hogg-dnc-democrats.html"
  },
  {
    "text": "Shattered Science: The Research Lost as Trump Targets NIH Funding  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  The National Institutes of Health is responsible for more than 80% … ",
    "url": "https://projects.propublica.org/nih-cuts-research-lost-trump/"
  },
  {
    "text": "Trump Voter Gets Choked Up After ICE Detains a Third of His Staff  —  BUYER'S REMORSE  —  A Florida roofing boss backed the president's tough immigration policies.  Then six of his workers were taken away...  Vincent Scardina supported Donald Trump's tough stance on immigration at the ballot box.",
    "url": "https://www.thedailybeast.com/trump-voter-gets-choked-up-after-ice-detains-a-third-of-his-staff/"
  },
  {
    "text": "Police officers file civil lawsuit seeking court order to hang Jan. 6 plaque at U.S. Capitol  —  Two police officers who defended the Capitol during the Jan. 6, 2021 attack filed a federal civil lawsuit, asking a judge to order the hanging of a plaque to honor police heroes who protected the Capitol, lawmakers and staff from rioters.",
    "url": "https://www.cbsnews.com/news/police-officers-lawsuit-installing-jan-6-plaque-at-u-s-capitol/"
  },
  {
    "text": "Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82  —  Brian Wilson, the Beach Boys' visionary and fragile leader whose genius for melody, arrangements and wide-eyed self-expression inspired “Good Vibrations,” “California Girls” and other summertime anthems … ",
    "url": "https://apnews.com/article/brian-wilson-dies-beach-boys-2272762e46c46820a7af09ffc73cb9a6"
  },
  {
    "text": "Russia National Day  —  On behalf of the American people, I want to congratulate the Russian people on Russia Day.  —  The United States remains committed to supporting the Russian people as they continue to build on their aspirations for a brighter future.",
    "url": "https://www.state.gov/releases/2025/06/russia-national-day/"
  },
  {
    "text": "Fulbright board resigns over alleged Trump administration interference  —  The 12-person board that oversees the Fulbright Program accused the White House of denying a “substantial” number of scholarship recipients.  —  The entire 12-person board tasked with overseeing the State Department's … ",
    "url": "https://www.washingtonpost.com/nation/2025/06/11/fulbright-board-scholarships-trump-administration/"
  },
  {
    "text": "Arrested in L.A.  —  Earlier this week, a friend of mine - a fellow social scientist who is a local college professor - was arrested by the Los Angeles Police Department at a demonstration near downtown LA. They were not jailed or harmed, and they were able to get home early the next morning.",
    "url": "https://smotus.substack.com/p/arrested-in-la"
  },
  {
    "text": "Kennedy's new CDC panel includes members who have criticized vaccines and spread misinformation  —  U.S. Health Secretary Robert F. Kennedy Jr. on Wednesday named eight new vaccine policy advisers to replace the panel that he abruptly dismissed earlier this week.",
    "url": "https://apnews.com/article/cdc-acip-vaccine-committee-9f58e1f004075b081718ff078de88d76"
  },
  {
    "text": "First Thing: Families arrested in LA Ice raids held with little food or water, lawyers say  —  Facilities appear to be unprepared for rush of detained people, including young children.  Plus, UK-bound Air India flights crashes with more than 200 onboard  —  Good morning.",
    "url": "https://www.theguardian.com/us-news/2025/jun/12/first-thing-families-arrested-in-la-ice-raids-held-in-basements-with-little-food-or-water-lawyers-say"
  },
  {
    "text": "Crypto Now Accounts For Most Of Donald Trump's Net Worth  —  By, Dan Alexander, Forbes Staff.  Dan Alexander is a senior editor at Forbes covering Trump's business.  —  SaveComment  —  Over nearly 50 years, Donald Trump expanded his father's real-estate empire into a $2.5 billion fortune.",
    "url": "https://www.forbes.com/sites/danalexander/2025/06/12/crypto-now-accounts-for-most-of-donald-trumps-net-worth/"
  },
  {
    "text": "Mamdani surges in new poll, leading Cuomo for first time in New York mayor's race  —  The former governor has topped every voter survey since entering the race, but the democratic socialist is gaining on him.  —  NEW YORK — Zohran Mamdani, the young democratic socialist who has been rising … ",
    "url": "https://www.politico.com/news/2025/06/11/zohran-mamdani-climbs-to-top-of-poll-leading-andrew-cuomo-00401594"
  },
  {
    "text": "Where are the people the Trump administration has deported?  —  In its first 150 days, the second Trump administration has used immigration authorities to aggressively deport people — including by sending them to foreign prisons and to countries where they had no prior connection.",
    "url": "https://www.lawdork.com/p/where-are-the-people-the-trump-administration"
  },
  {
    "text": "Big Tech stumbles into a big brawl over C-SPAN's streaming future  —  A bipartisan Senate coalition is asking YouTube TV and Hulu to add Congress's favorite station to their lineups.  —  Sen. Todd Young doesn't like to acknowledge how many years have passed since he started watching C-SPAN at odd hours.",
    "url": "https://www.washingtonpost.com/politics/2025/06/12/big-tech-stumbles-into-big-brawl-over-c-spans-streaming-future/"
  },
  {
    "text": "She served the American people for 35 years.  Now her retirement income is on the line  —  Michele Santa Maria was 18 and a year out of high school when she landed a job at the Social Security Administration's field office in Chula Vista, Calif., in May 1990.  —  She started out answering phones and sorting mail.",
    "url": "https://www.npr.org/2025/06/12/nx-s1-5430869/trump-congress-budget-bill-retirement-fers"
  },
  {
    "text": "House set to vote on DOGE-inspired cuts to foreign aid, PBS, NPR  —  The House is set to vote Thursday on a package of funding cuts inspired by the U.S. DOGE Service that until recently was overseen by Elon Musk.  The clawbacks, totaling $9.4 billion, take aim at foreign aid and funding for PBS and NPR, among other things.",
    "url": "https://www.washingtonpost.com/politics/2025/06/12/trump-presidency-news/"
  },
  {
    "text": "Florida's literary inquisition  —  In a chilling meeting of the Florida State Board of Education last week, a school district superintendent was publicly browbeaten and repeatedly threatened with criminal prosecution.  The members of the State Board were incensed that Van Ayres … ",
    "url": "https://popular.info/p/florida-officials-threaten-librarians"
  },
  {
    "text": "‘Catastrophic’: Rural public media stations brace for GOP cuts  —  NPR and PBS member stations with smaller budgets will struggle to stay on the air if Congress nixes current funding, public media executives warn.  —  Public media stations around the country are anxiously awaiting the results … ",
    "url": "https://www.politico.com/news/2025/06/12/pbs-npr-trump-cuts-00400433"
  },
  {
    "text": "Trump's top general just undercut his ‘invasion’ claims  —  One of the problems with making a series of brazen and hyperbolic claims is that it can be hard to keep everyone on your team on the same page.  —  And few Trump administration claims have been as brazen as the idea … ",
    "url": "https://cnn.com/2025/06/11/politics/dan-caine-trump-invasion-claim-analysis"
  },
  {
    "text": "FBI Boss Kash Patel Is Suing to Prove He's Not Nightclub Hopping  —  NO RAVE ZONE  —  The FBI director is suing Frank Figliuzzi over a claim he made on MSNBC last month.  —  Kash Patel has sued MSNBC columnist Frank Figliuzzi over his unverified claim last month that the FBI director had been at … ",
    "url": "https://www.thedailybeast.com/fbi-director-kash-patel-sues-msnbc-analyst-frank-figliuzzi-over-nightclub-lie/"
  },
  {
    "text": "Presidential Criminal Immunity: A Rule-of-Law Threat Beyond the Oval Office  —  The Roberts Court's immunity doctrine encourages corruption and malfeasance throughout the executive branch.  —  Meet The Authors … In Trump v. United States, a six-justice majority of the Supreme Court created … ",
    "url": "https://www.lawfaremedia.org/article/presidential-criminal-immunity--a-rule-of-law-threat-beyond-the-oval-office"
  },
  {
    "text": "Republican South Carolina House member charged with distributing child sexual abuse material  —  A Republican South Carolina House member who prosecutors say used the screen name “joebidennnn69” has been arrested and charged with 10 counts of distributing sexual abuse material involving children.",
    "url": "https://apnews.com/article/sex-crimes-south-carolina-lawmaker-rj-may-81901be6f700f24a99ba3346086f8b61"
  },
  {
    "text": "'Isn't this embarrassing?'  Team Trump gets a brutal reminder about the weak economy  —  Treasury Secretary Scott Bessent tried to pick a fight over current U.S. economic conditions.  It didn't go well.  —  Partway through Treasury Secretary Scott Bessent's testimony before the House Ways … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-economy-scott-bessent-weak-data-rcna212574"
  },
  {
    "text": "Naval Academy history chair resigns over ordered removal of symposium paper  —  The chair of the Naval Academy History Department resigned after reportedly being ordered by the academy's superintendent to remove a previously approved paper from the list of those to be presented at an upcoming symposium.",
    "url": "https://www.baltimoresun.com/2025/06/11/naval-academy-history-chair-resigns-over-ordered-removal-of-symposium-paper/?lctg=052714A1241CB574C4A51502A1"
  }
]