[
  {
    "text": "Norway fuel giant ‘refuses to fill US submarines’ after Trump-Zelensky clash  —  Norwegian petroleum giant Haltbakk Bunkers has declared it will no longer help the US Navy.  —  A petrol giant in Norway has announced a ban on fuel sales to all US forces following Donald Trump's treatment … ",
    "url": "https://www.express.co.uk/news/world/2021304/norway-fuel-giant-refuses-fill"
  },
  {
    "text": "The Trump-Zelensky blowup, broken down by body-language analysts  —  The decision not to use an interpreter, the power imbalance, Trump's misstatements and Zelensky's “warrior energy” helped fuel the unusual public flap.  —  just now  —  President Donald Trump and Vice President JD Vance … ",
    "url": "https://www.washingtonpost.com/world/2025/03/01/zelensky-trump-video-body-language/"
  },
  {
    "text": "Shocked by Trump, Zelensky and Ukraine Try to Forge a Path Forward  —  After President Trump's rebukes, President Volodymyr Zelensky tried to repair the relationship with his counterpart while also reaching out to European allies.  —  For months leading into the American elections last fall … ",
    "url": "https://www.nytimes.com/2025/03/01/world/europe/trump-zelensky-us-ukraine-russia-meeting.html"
  },
  {
    "text": "Good Trouble: JD Vance Chastised by Vermont Snow Reporter  —  JD Vance, fresh off of helping his boss ambush & insult a foreign leader in the White House yesterday afternoon, is on vacation in Vermont with his family this weekend and will be skiing at Sugarbush Resort in Warren, VT, a 15-minute drive from where I live.",
    "url": "https://kottke.org/25/03/jd-vance-chastised-by-vermont-snow-reporter"
  },
  {
    "text": "A letter to the American People:  —  For over 11 years, 18F has been proudly serving you to make government technology work better.  We are non-partisan civil servants.  18F has worked on hundreds of projects, all designed to make government technology not just efficient but effective, and to save money for American taxpayers.",
    "url": "https://18f.org/"
  },
  {
    "text": "GSA eliminates 18F  —  USA.  —  The latest workforce action at the General Services Administration includes the elimination of an entire tech team of around 90 employees.  —  The General Services Administration deleted 18F, a government tech consultancy that helps other agencies with their technology, early Saturday morning.",
    "url": "https://www.nextgov.com/people/2025/03/gsa-eliminates-18f/403400/"
  },
  {
    "text": "The Trump Administration Said These Aid Programs Saved Lives.  It Canceled Them Anyway.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  After the Trump administration moved to freeze nearly $60 billion … ",
    "url": "https://www.propublica.org/article/trump-usaid-rubio-marocco-canceled-programs-gaza-syria-congo-hiv-ebola"
  },
  {
    "text": "Judge says Trump cannot fire head of independent watchdog agency  —  The federal judge's decision blocks Trump from removing Hampton Dellinger as head of the Office of Special Counsel and sets up a likely Supreme Court battle over the president's powers.  —  A federal judge on Saturday … ",
    "url": "https://www.washingtonpost.com/national-security/2025/03/01/hampton-dellinger-trump-office-special-counsel/"
  },
  {
    "text": "Andrew Cuomo for Mayor?  His “First Accuser” Says New York City Deserves Better  —  Taxpayers have paid millions defending the former governor and top aides against accusers' allegations.  —  New York City deserves better than Andrew Cuomo.  As frustrated as city residents rightfully … ",
    "url": "https://www.vanityfair.com/news/story/new-york-city-deserves-better-than-andrew-cuomo"
  },
  {
    "text": "Pentagon orders up to 3,000 troops and Stryker combat vehicles to border  —  Defense Secretary Pete Hegseth approved orders on Friday to further militarize the U.S. southern border with Mexico, officials said.  —  Just now  —  Defense Secretary Pete Hegseth has ordered an additional 2,500 … ",
    "url": "https://www.washingtonpost.com/national-security/2025/03/01/hegseth-border-troops-mexico-stryker/"
  },
  {
    "text": "Anti-DOGE protests at Tesla stores target Elon Musk's bottom line  —  Demonstrators gathered outside Tesla stores across the U.S. Saturday to protest the automaker's billionaire CEO, Elon Musk, and his push to slash government spending on behalf of President Donald Trump.",
    "url": "https://apnews.com/article/elon-musk-tesla-protests-doge-3b3eba9313074ccf8e959a92486d900f"
  },
  {
    "text": "Ex-Chicago mayor rips current city leaders for focus on bathroom and locker room instead of crime, education  —  'I don't want to hear another word about the bathroom.  You better start focusing on the classroom,' Rahm Emanuel told Bill Maher on Friday  —  Former Democratic Chicago Mayor … ",
    "url": "https://www.foxnews.com/media/ex-chicago-mayor-rips-current-city-leaders-focus-bathroom-locker-room-instead-crime-education"
  },
  {
    "text": "DOGE presses to check federal benefits payments against IRS tax records  —  Officials with Elon Musk's group say they want to search for fraud.  Privacy law bars the IRS from disclosing tax information to other parts of the government.  —  Just now  —  Officials from Elon Musk's U.S. DOGE Service … ",
    "url": "https://www.washingtonpost.com/business/2025/03/01/doge-irs-tax-records-benefits/"
  },
  {
    "text": "Francis Collins Retires From N.I.H., Saying Colleagues ‘Deserve the Utmost Respect’  —  Dr. Collins, a renowned geneticist, ran the National Institutes of Health for 12 years.  His parting statement offered a pointed, if veiled, message to the Trump administration.",
    "url": "https://www.nytimes.com/2025/03/01/us/politics/francis-collins-nih-retires.html"
  },
  {
    "text": "Trump takes seized boxes back to Florida on Air Force One  —  President Donald Trump on Friday transported back to Florida with him boxes of documents that the FBI had seized from Mar-a-Lago after executing a court-ordered search warrant in August 2022.  —  “The Department of Justice … ",
    "url": "https://www.cnn.com/2025/02/28/politics/trump-seized-boxes-returned-air-force-one/"
  },
  {
    "text": "$75 million was awarded to plant trees in places that badly need them.  In anti-DEI push, that's over  —  Arthur Johnson has lived in New Orleans' Lower 9th Ward for nearly three decades, long enough to appreciate the trees that filter pollution from the big ships traveling the nearby Mississippi River … ",
    "url": "https://apnews.com/article/trees-arbor-day-grants-cut-trump-heat-shade-environmental-justice-5909d4f102ac0de9cc5be313b4fbd399"
  },
  {
    "text": "Norwegian fuel supplier refuses U.S. warships over Ukraine  —  Norwegian fuel company Haltbakk Bunkers has announced it will cease supplying fuel to U.S. military forces in Norway and American ships docking in Norwegian ports, citing dissatisfaction with recent U.S. policy towards Ukraine.",
    "url": "https://ukdefencejournal.org.uk/norwegian-fuel-supplier-refuses-u-s-warships-over-ukraine/"
  },
  {
    "text": "Kansas senator's rural town hall meeting swamped by people mad at Trump administration  —  Republican Kansas Sen. Roger Marshall ended a rural town hall meeting early after people angry about budget cuts, funding freezes and other actions by President Trump shouted the senator down.",
    "url": "https://www.kcur.org/2025-03-01/kansas-senators-rural-town-hall-meeting-swamped-by-people-mad-at-trump-administration"
  },
  {
    "text": "We tried to quantify the impact of abrupt PEPFAR cuts.  The results startled even us  —  These policy decisions put lives at risk  —  In May 2023, about a year before the President's Emergency Plan for AIDS Relief was up for congressional renewal, a  —  alleged that PEPFAR funding … ",
    "url": "https://www.statnews.com/2025/03/01/pepfar-usaid-funding-cuts-trump-hiv-aids/"
  }
]