[
  {
    "text": "Arizona Supreme Court rules that a near-total abortion ban from 1864 is enforceable  —  The bombshell decision adds the state to the growing lists of places where abortion care is effectively banned.  —  PHOENIX — The Arizona Supreme Court ruled Tuesday that a 160-year-old near-total abortion ban still … ",
    "url": "https://www.nbcnews.com/politics/arizona-supreme-court-ruling-abortion-ban-rcna146915"
  },
  {
    "text": "Abortion in Arizona set to be illegal in nearly all circumstances, state high court rules  —  The Arizona Supreme Court upheld a 160-year-old abortion ban that could shutter abortion clinics in the state.  —  The ruling indicated the ban can only be “prospectively enforced” and enforcement of the law is stayed for 14 days.",
    "url": "https://www.azcentral.com/story/news/politics/arizona/2024/04/09/arizona-abortion-law-state-supreme-court-upholds-near-total-ban/73251148007/"
  },
  {
    "text": "Republicans rush to distance from “disaster” Arizona abortion ruling … - Just on Monday, former President Trump put vulnerable House Republicans at ease by stopping short of endorsing a nationwide abortion ban. … - The 19th century law provides exceptions only to save the life of the mother.",
    "url": "https://www.axios.com/2024/04/09/arizona-abortion-ban-republicans-supreme-court"
  },
  {
    "text": "Kari Lake disavows Arizona abortion ban ruling … - “I oppose today's ruling, and I am calling on [Democratic Gov.] Katie Hobbs and the State Legislature to come up with an immediate common sense solution that Arizonans can support,” Lake said in a statement.",
    "url": "https://www.axios.com/2024/04/09/kari-lake-arizona-abortion-ban"
  },
  {
    "text": "Arizona Supreme Court rules to ban nearly all abortions, reverting back to penal code  —  The court filed its opinion in Planned Parenthood of Arizona vs. Mayes/Hazelrigg Tuesday morning  —  PHOENIX — In a historic decision Tuesday, the Arizona Supreme Court ruled the state must adhere … ",
    "url": "https://www.abc15.com/news/state/arizona-supreme-court-rules-to-ban-nearly-all-abortions-reverting-back-to-penal-code"
  },
  {
    "text": "Biden allies tie Arizona abortion ruling to Trump: ‘This is what leaving it to the states looks like’  —  Biden campaign aides and allies on Tuesday wasted little time tying an Arizona court ruling effectively outlawing abortion in the state directly to former President Donald Trump and his call … ",
    "url": "https://thehill.com/homenews/campaign/4583281-biden-allies-tie-arizona-abortion-ruling-to-trump/"
  },
  {
    "text": "Trump loses bid to delay hush money trial pending gag order appeal  —  Donald Trump on Tuesday lost his second last-ditch bid in as many days to delay his April 15 trial on criminal charges stemming from hush money paid to a porn star.  —  The former U.S. president's lawyers argued at a hearing … ",
    "url": "https://www.reuters.com/world/us/trump-appeals-gag-order-stormy-daniels-hush-money-case-2024-04-09/"
  },
  {
    "text": "The Inside Story of Alvin Bragg's Case Against Trump … Reporters vied for seats in the briefing room, some even crouching on the floor.  They all knew, on this Tuesday in early April 2023, that Alvin L. Bragg, the Manhattan district attorney, was about to announce something momentous … ",
    "url": "https://www.nytimes.com/2024/04/09/magazine/alvin-bragg-donald-trump-trial.html"
  },
  {
    "text": "I've Been at NPR for 25 Years.  Here's How We Lost America's Trust.  —  Uri Berliner, a veteran at the public radio institution, says the network lost its way when it started telling listeners how to think.  —  You know the stereotype of the NPR listener: an EV-driving, Wordle-playing, tote bag-carrying coastal elite.",
    "url": "https://www.thefp.com/p/npr-editor-how-npr-lost-americas-trust"
  },
  {
    "text": "Parents of Michigan school shooter sentenced to 10-15 years in prison  —  The parents of convicted Michigan school shooter Ethan Crumbley were each sentenced Tuesday to 10-15 years in prison for their role in the deaths of four high school students in 2021.  —  James and Jennifer Crumbley … ",
    "url": "https://thehill.com/homenews/state-watch/4582895-parents-michigan-school-shooter-sentenced-prison/"
  },
  {
    "text": "Michigan school shooter's parents sentenced to at least 10 years in prison  —  The parents of a Michigan school shooter have been sentenced to at least 10 years for failing to prevent the killing of four students in 2021.  Jennifer and James Crumbley are the first parents convicted in a U.S. mass school shooting.",
    "url": "https://apnews.com/article/james-crumbley-jennifer-crumbley-oxford-school-shooting-e5888f615c76c3b26153c34dc36d5436"
  },
  {
    "text": "Attorney General James Secures Up to $1.25 Million from Conspiracy Theorists Who Intimidated Black Voters with Threatening Robocalls  —  Jacob Wohl and Jack Burkman Targeted Black Voters with Robocall Campaign to Suppress the Vote Ahead of the 2020 Election  —  NEW YORK - New York Attorney … ",
    "url": "https://ag.ny.gov/press-release/2024/attorney-general-james-secures-125-million-conspiracy-theorists-who-intimidated"
  },
  {
    "text": "RFK Jr. campaign official attended Jan. 6 ‘Stop the Steal’ rally and wanted ‘favorite President’ Trump to run for third term  —  A New York-based campaign official for Robert F. Kennedy Jr. who raised the possibility that voting for the independent presidential candidate would help Donald … ",
    "url": "https://www.cnn.com/2024/04/09/politics/rfk-jr-campaign-official-january-6-trump"
  },
  {
    "text": "Ken Buck knocks ‘Moscow Marjorie’ Taylor Greene  —  Former Rep. Ken Buck (R-Colo.) took shots at Rep. Marjorie Taylor Greene (R-Ga.) Monday, attacking his former GOP colleague as “Moscow Marjorie.”  —  The jab comes after former Speaker Kevin McCarthy (R-Calif.) called Greene a … ",
    "url": "https://thehill.com/homenews/house/4582430-ken-buck-knocks-moscow-marjorie-taylor-greene/"
  },
  {
    "text": "Sheila Jackson Lee Claims Moon Is Made Of ‘Gases’  —  Democratic Texas Rep. Sheila Jackson Lee claimed Monday the moon is made out of gases during a solar eclipse viewing event at Booker T. Washington High School in Houston, Texas.  —  Lee, the former Ranking Member on the House Space … ",
    "url": "https://dailycaller.com/2024/04/09/sheila-jackson-lee-moon-gases/"
  },
  {
    "text": "Zelensky says he doesn't need ‘primitive’ ideas from Trump on Ukraine  —  Ukrainian President Volodymyr Zelensky said in a Tuesday interview that he does not need “primitive” ideas from former President Trump on ways to resolve the war with Russia.  —  In an interview with Axel Springer media outlets … ",
    "url": "https://thehill.com/policy/international/4583975-zelensky-trump-primitive-ideas-ukraine/"
  },
  {
    "text": "Behind the Curtain: America's reality distortion machine … But on almost every topic of monthly outrage, it's a fringe view — or example — amplified by the loudest voices on social media and politicians driving it.  — No, most Christians aren't white Christian nationalists who see Donald Trump as a God-like figure.",
    "url": "https://www.axios.com/2024/04/09/america-politics-divided-polarization-data"
  },
  {
    "text": "The deeply silly, extremely serious rise of ‘Alpha Male’ Nick Adams  —  Meet the Trump-backed raconteur who is teaching America's young men the art of being hard to deal with  —  Nick Adams was speaking to the men in the room.  —  “Never apologize,” he said.  “Never mask up.",
    "url": "https://www.washingtonpost.com/style/power/2024/04/09/nick-adams-alpha-male-trump-campaign-surrogate/"
  },
  {
    "text": "Biden is building a behemoth of a campaign.  Trump at this point seems to be playing catch-up.  —  Biden is flush with cash and opening campaign offices across the country but has struggled to overcome Trump and his more meager campaign in the polls.  —  PHILADELPHIA — President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-building-behemoth-campaign-trump-point-seems-playing-catch-rcna145903"
  },
  {
    "text": "Fox News twists data on economy and crime to attack Biden  —  There is an enduring chicken-egg question in American politics and media: Do Republicans who watch Fox News hold more extreme views because they watch Fox News, or do they watch Fox News because they hold more extreme positions?",
    "url": "https://www.washingtonpost.com/politics/2024/04/09/fox-biden-economy/"
  },
  {
    "text": "European court rules human rights violated by climate inaction  —  A group of older Swiss women have won the first ever climate case victory in the European Court of Human Rights.  —  The women, mostly in their 70s, said that their age and gender made them particularly vulnerable to the effects of heatwaves linked to climate change.",
    "url": "https://www.bbc.com/news/science-environment-68768598"
  },
  {
    "text": "As Kushner's Investment Firm Steps Out, the Potential Conflicts Are Growing  —  Jared Kushner's Affinity Partners has invested more than $1.2 billion, much of it in firms abroad, drawing new scrutiny as his father-in-law, Donald Trump, again seeks the presidency.",
    "url": "https://www.nytimes.com/2024/04/09/us/politics/jared-kushner-affinity-partners.html"
  },
  {
    "text": "Letitia James Nears Green Light to Start Taking Donald Trump's Assets  —  The New York Attorney General may start collecting Trump assets if he fails to post a bond by next Monday, a leading real estate lawyer has said.  —  Paul Golden, author of Litigating Constructive Trusts and a partner … ",
    "url": "https://www.newsweek.com/donald-trump-judge-arthur-engoron-fraud-case-bond-manhattan-new-york-letitia-james-1888535"
  },
  {
    "text": "TV Networks to Urge Biden and Trump to Debate, Wading Into a Fraught Topic  —  Speculation has swirled in the political world about whether the presumptive candidates will agree to the traditional face-to-face events, a campaign staple since 1976.  —  In an unusual move … ",
    "url": "https://www.nytimes.com/2024/04/09/business/media/networks-biden-trump-debate-letter.html"
  },
  {
    "text": "Playbook: Why Trump's abortion statement changes nothing  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT JARED BERNSTEIN IS READING — “Despite all the good news in the stock market over the last year or so, once you factor in inflation … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/09/why-trumps-abortion-statement-changes-nothing-00151206"
  },
  {
    "text": "Speaker Johnson to delay sending Mayorkas impeachment to Senate  —  Speaker Mike Johnson (R-La.) has agreed to Senate conservatives' request that he delay sending two articles of impeachment against Homeland Security Secretary Alejandro Mayorkas until next week.",
    "url": "https://thehill.com/homenews/senate/4583599-mayorkas-impeachment-senate-speaker-johnson/"
  },
  {
    "text": "Transmittal No  —  The State Department has made a determination approving a possible Foreign Military Sale to the Government of Ukraine of HAWK Phase III Missile System Sustainment and related elements of logistics and program support for an estimated cost of $138 million.",
    "url": "https://www.dsca.mil/press-media/major-arms-sales/ukraine-hawk-phase-iii-missile-system-sustainment"
  },
  {
    "text": "Texas Attorney General sues to stop guaranteed income program for Houston-area residents  —  HOUSTON (AP) — Texas' attorney general filed a lawsuit on Tuesday seeking to stop a guaranteed income program set to start this month for Houston-area residents.  —  The program by Harris County … ",
    "url": "https://apnews.com/article/lawsuit-guaranteed-income-program-texas-harris-county-d875494123a749a90b74e1f06c218468"
  },
  {
    "text": "F.A.A. Investigates Claims by Boeing Whistle-Blower About Flaws in 787 Dreamliner  —  The whistle-blower, an engineer, says that sections of the plane's body are being assembled in a way that could weaken the aircraft over time.  Boeing says there is no safety issue.",
    "url": "https://www.nytimes.com/2024/04/09/us/politics/boeing-787-dreamliner-whistle-blower.html"
  },
  {
    "text": "Republican megadonor Jeff Yass, inner circle give millions to shape schools, courts … A portrait of Jeff Yass.  —  Inside one of the largest options trading firms in the world sits a little known charitable foundation, that has quietly donated tens of millions of dollars to influence federal policy, education and law.",
    "url": "https://www.cnbc.com/2024/04/09/jeff-yass-millions-to-influence-schools-courts-and-markets.html"
  },
  {
    "text": "Many Americans who recently bought guns open to political violence, survey finds  —  Study of 13,000 Americans finds particular risk among certain types of gun owners, including those who carry weapons in public  —  Large numbers of Americans who have bought guns over the past four years … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/09/guns-political-violence-study"
  }
]