[
  {
    "text": "Statement of ICC Prosecutor Karim A.A. Khan KC: Applications for arrest warrants in the situation in the State of Palestine  —  Today I am filing applications for warrants of arrest before Pre-Trial Chamber I of the International Criminal Court in the Situation in the State of Palestine.",
    "url": "https://www.icc-cpi.int/news/statement-icc-prosecutor-karim-aa-khan-kc-applications-arrest-warrants-situation-state"
  },
  {
    "text": "EXCLUSIVE: ICC seeks arrest warrants against Sinwar and Netanyahu for war crimes over October 7 attack and Gaza war  —  The International Criminal Court is seeking arrest warrants for Hamas leader Yahya Sinwar and Israeli Prime Minister Benjamin Netanyahu on charges of war crimes and crimes … ",
    "url": "https://www.cnn.com/2024/05/20/middleeast/icc-israel-hamas-arrest-warrant-war-crimes-intl/"
  },
  {
    "text": "Iran's president, foreign minister and others found dead at helicopter crash site, state media says  —  Iranian President Ebrahim Raisi, the country's foreign minister and others have been found dead at the site of a helicopter crash Monday after an hourslong search through a foggy … ",
    "url": "https://apnews.com/article/iran-president-ebrahim-raisi-426c6f4ae2dd1f0801c73875bb696f48"
  },
  {
    "text": "Why isn't Donald Trump in jail already?  —  Donald Smith would be in a cell by now! … “Why isn't Donald Trump in jail already?”  —  It's a fair question, particularly in light of the flagrant gag order violations in Trump's Manhattan criminal trial, both by the man himself and his surrogates.",
    "url": "https://www.publicnotice.co/p/trump-merchan-gag-order-violations-jail-why-not"
  },
  {
    "text": "Exclusive: Justice Alito sold Bud Light stock amidst anti-trans boycott effort  —  At 4:37 p.m. on Sunday, August 13, 2023, far-right, anti-LGBTQ influencer Chaya Raichik of Libs of TikTok posted a pre-transition photograph of transgender influencer Dylan Mulvaney, calling her “a dude,” on Twitter, now known as X.1",
    "url": "https://www.lawdork.com/p/alito-bud-light-stock-sale-anti-trans-boycott"
  },
  {
    "text": "The truth about crime in DC  —  On May 15, Congressman Andy Biggs (R-AZ) went to the floor of the House of Representatives and said he supported a federal takeover of Washington, D.C.'s criminal justice laws “to improve public safety in our nation's capital... as violent crime skyrockets.”",
    "url": "https://popular.info/p/the-truth-about-crime-in-dc"
  },
  {
    "text": "Scared about America losing democracy?  Texas is already gone  —  “I might go to Dallas to murder looters,” a then-active duty U.S. Army sergeant named Daniel Perry texted a friend in the spring of 2020, as protest marches over the police murder of George Floyd swept across Texas and the nation.",
    "url": "https://www.inquirer.com/opinion/commentary/texas-abbott-pardon-murderer-blm-protester-20240519.html"
  },
  {
    "text": "Toxic Gaslighting: How 3M Executives Convinced a Scientist the Forever Chemicals She Found in Human Blood Were Safe  —  Decades ago, Kris Hansen showed 3M that its PFAS chemicals were in people's bodies.  Her bosses halted her work.  As the EPA now forces the removal of the chemicals from drinking water … ",
    "url": "https://www.propublica.org/article/3m-forever-chemicals-pfas-pfos-inside-story"
  },
  {
    "text": "Trump claims he wants to testify at his trial.  No one else thinks he should.  —  “Anybody testifying for their own sake, it doesn't play out well,” said one Trump ally.  —  On the eve of his criminal trial, Donald Trump told reporters in Florida that he would take the stand and testify if necessary.",
    "url": "https://www.politico.com/news/2024/05/20/trump-testify-hush-money-trial-00158756"
  },
  {
    "text": "Trump's EPA chief thinks Biden's climate rules are doomed.  But will Biden's dollars survive?  —  Andrew Wheeler also doesn't rule out returning for Trump 2.0: ‘Whenever a president or a governor asks you to do something for your country, you step up and you do it.’",
    "url": "https://www.politico.com/news/2024/05/20/trump-epa-chief-andrew-wheeler-biden-climate-rules-00158738"
  },
  {
    "text": "Biden: what would Trump have done if the Capitol riots had been led by Black Americans?  —  The US president Joe Biden asks at civil rights event: ‘what do you think he would have done ... if Black Americans had stormed the Capitol?’  —  Joe Biden has launched one of his most scathing attacks yet … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/20/joe-biden-donald-trump-january-6-capitol-riots-black-americans-naacp-dinner-speech-detroit"
  },
  {
    "text": "Biden team braces for upcoming trials of Hunter Biden  —  President's son faces two federal cases in June that could draw attention from Trump's legal problems  —  At 8:30 a.m. on June 3, Hunter Biden is scheduled to report to Courtroom 4A in Wilmington, Del., facing his most dire legal peril … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/20/hunter-biden-trials-white-house-guns-taxes/"
  },
  {
    "text": "Is This Suburban New York Charity a Terrorist Front Group?  —  The Westchester Peace Action Committee Foundation is named in a lawsuit alleging anti-Israel groups coordinate with Hamas  —  At first glance, the Westchester Peace Action Committee Foundation (WESPAC) seems unremarkable … ",
    "url": "https://freebeacon.com/national-security/is-this-suburban-new-york-charity-a-terrorist-front-group/"
  },
  {
    "text": "Republicans want Menendez's Senate seat.  Trump devotion is getting in the way.  —  New Jersey has not elected a Republican to the Senate in over half a century.  —  New Jersey Republicans should have their best chance in decades to win a Senate seat with Democratic Sen. Bob Menendez on trial … ",
    "url": "https://www.politico.com/news/2024/05/20/new-jersey-republicans-senate-trump-00158636"
  }
]