[
  {
    "text": "Judge warns Trump: ‘Inflammatory’ statements about election case could speed trial  —  ‘The more a party makes inflammatory statements about this case ... the greater the urgency will be that we proceed to trial quickly.’  —  U.S. District Judge Tanya Chutkan warned Donald Trump … ",
    "url": "https://www.politico.com/news/2023/08/11/judge-warns-trump-speed-trial-00110870"
  },
  {
    "text": "Judge Limits Trump's Ability to Share Jan. 6 Evidence  —  During a 90-minute hearing in Washington, Judge Tanya S. Chutkan also warned the former president against any attempt to intimidate witnesses or prejudice potential jurors.  —  The federal judge overseeing former President Donald J … ",
    "url": "https://www.nytimes.com/2023/08/11/us/politics/trump-judge-protective-order.html"
  },
  {
    "text": "Trump could face “big picture” RICO case in Georgia, expert says  —  If former President Donald Trump is indicted in Georgia, some believe he may face felony counts unlike any of the 78 charges already filed against him.  Fulton County District Attorney Fani Willis could pursue Trump under … ",
    "url": "https://www.cbsnews.com/news/trump-rico-case-georgia-expert-says/"
  },
  {
    "text": "Trump Allies Deliver ‘Incriminating’ Info on Conspiracy-Peddling Sidney Powell  —  People who've been grilled by Special Counsel Jack Smith's team agree: Powell should be prepared for criminal charges over her actions surrounding the 2020 election … Four sources with knowledge of the matter … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-jack-smith-sidney-powell-indictment-1234804906/"
  },
  {
    "text": "Attorney General Garland appoints a special counsel in Hunter Biden probe  —  U.S. Attorney David Weiss will be appointed special counsel in the ongoing probe of the president's son Hunter Biden.  —  WASHINGTON — U.S. Attorney David Weiss will be appointed special counsel in the ongoing probe … ",
    "url": "https://www.nbcnews.com/politics/justice-department/attorney-general-garland-appoints-special-counsel-hunter-biden-probe-rcna99447"
  },
  {
    "text": "Biden world resigned to a campaign shadowed by Hunter drama  —  The White House was privately frustrated by the appointment of a special counsel.  But Republicans were, too.  —  The appointment on Friday of a special counsel to investigate Hunter Biden likely ensured that the probe of the president's son … ",
    "url": "https://www.politico.com/news/2023/08/11/biden-2024-campaign-hunter-probe-00110923"
  },
  {
    "text": "'They're Going to Shoot Someone:' Michigan Republicans Warn of Civil War at Pool Party Fundraiser for Fake Electors  —  An audio recording obtained by The Messenger highlights just how dire the Republicans charged in the 2020 election scheme - and the people around them - see their fight",
    "url": "https://themessenger.com/politics/michigan-republicans-fake-electors-civil-war-dana-nessel-matt-maddock"
  },
  {
    "text": "GOP lawmaker warns of ‘civil war’ at fundraiser for indicted Trump electors  —  Michigan state Rep. Matt Maddock (R) warned supporters at a recent fundraiser at his home that a “civil war” would break out or that people would get shot if the government continued to target conservatives … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/11/michigan-civil-war-gop-fundraiser/"
  },
  {
    "text": "DeSantis greeted by ‘pudding fingers’ chant in Iowa  —  The protest effectively cut short the Florida governor's first campaign stop of the day.  —  MENLO, Iowa — It was an inauspicious start for Ron DeSantis in Iowa on Friday.  —  Chanting “Ron DeFascist” and “pudding fingers” … ",
    "url": "https://www.politico.com/news/2023/08/11/desantis-iowa-pudding-fingers-chant-00110860"
  },
  {
    "text": "FTX's Bankman-Fried headed for jail after judge revokes bail  —  A U.S judge on Friday revoked Sam Bankman-Fried's bail, after finding probable cause that the indicted founder of the bankrupt FTX cryptocurrency exchange tampered with witnesses at least twice.",
    "url": "https://www.reuters.com/legal/ftxs-bankman-fried-seeking-avoid-jail-due-back-court-2023-08-11/"
  },
  {
    "text": "Biden attorneys are in talks with special counsel Robert Hur over terms to interview the president  —  Attorney General Merrick Garland appointed Hur to investigate Biden's handling of classified documents after his term as vice president ended.  —  WASHINGTON — Attorneys for President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-attorneys-negotiating-special-counsel-interview-terms-rcna99360"
  },
  {
    "text": "Illinois Supreme Court finds assault weapons ban constitutional  —  The ban was passed after the Highland Park mass shooting.  —  The Illinois State Supreme Court found a strict assault weapons ban passed after the Highland Park shooting to be constitutional in a ruling issued Friday.",
    "url": "https://abcnews.go.com/US/illinois-supreme-court-finds-assault-weapons-ban-constitutional/story?id=102198069"
  },
  {
    "text": "Inside One ‘Egregious’ Mistake From Trump's Florida Judge Aileen Cannon  —  Judge Aileen Cannon barely has any courtroom experience, but in her limited time on the bench she appears to have flouted hundreds of years of legal tradition—just because. … U.S. District Judge Aileen Cannon … ",
    "url": "https://www.thedailybeast.com/inside-one-egregious-mistake-from-trumps-florida-judge-aileen-cannon"
  },
  {
    "text": "How Are Iowa Democrats?  'I Can't Even Describe to You How Bad It Is.'  —  As Republican presidential candidates flock to the state, Democrats there are despondent, exhausted by repeated defeats and the loss of their first-in-the-nation nominating contest.  —  Not long ago, Iowa was the center of the Democratic political universe.",
    "url": "https://www.nytimes.com/2023/08/11/us/politics/democrats-iowa-state-fair.html"
  },
  {
    "text": "Fox's Top Lawyer, Viet Dinh, Will Depart  —  Viet Dinh advised the company through its landmark $787.5 million settlement with Dominion Voting Systems.  —  Fox Corporation's chief legal officer, Viet Dinh, will depart at the end of the year, in a major shake-up at the company … ",
    "url": "https://www.nytimes.com/2023/08/11/business/media/viet-dinh-fox-departing.html"
  },
  {
    "text": "Francis Suarez: If you don't make the debate, drop out  —  Suarez, who is at risk of missing the debate himself, said polling requirements are unfair for largely unknown candidates.  —  DES MOINES — Miami Mayor Francis Suarez has a message to fellow presidential candidates: If you don't make the debate stage, drop out.",
    "url": "https://www.politico.com/news/2023/08/11/francis-suarez-if-you-dont-make-the-debate-drop-out-00110897"
  },
  {
    "text": "An insidious form of climate denial is festering in the Republican Party  —  The GOP's only “climate policy” is actually bad for the environment.  —  When Rep. Scott Perry (R-PA) questioned US climate envoy John Kerry at an oversight hearing in July — a month that became the hottest ever recorded … ",
    "url": "https://www.vox.com/climate/23815966/republicans-climate-change-denial-trees"
  }
]