[
  {
    "text": "FBI informant charged with lying about Joe and Hunter Biden's ties to Ukrainian energy company  —  An FBI informant has been charged with fabricating a multimillion-dollar bribery scheme involving President Joe Biden, his son Hunter and a Ukrainian energy company, a claim that is central … ",
    "url": "https://apnews.com/article/hunter-biden-burisma-fbi-informant-lying-6969656f6012780a23a4b8841ce2689b"
  },
  {
    "text": "Special counsel charges FBI informant with lying to the bureau about Hunter and Joe Biden  —  Alexander Smirnov, 43, disliked President Joe Biden, according to the Justice Department.  He was arrested in Las Vegas after returning from a trip overseas.  —  WASHINGTON — An FBI confidential human source … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/special-counsel-charges-fbi-informant-lying-bureau-hunter-joe-biden-rcna139091"
  },
  {
    "text": "FBI informant at heart of GOP's Biden bribery allegations indicted over false statements  —  The confidential source at the center of allegations being promoted by House Republicans that President Biden accepted a bribe has been arrested and charged with making false statements to the FBI.",
    "url": "https://thehill.com/regulation/court-battles/4471124-fbi-informant-at-heart-of-gops-biden-bribery-allegations-indicted-for-false-statements/"
  },
  {
    "text": "Former FBI informant charged with lying about the Bidens' role in Ukraine business, undercutting GOP impeachment inquiry  —  Special counsel David Weiss charged a former FBI informant with lying about President Joe Biden and his son Hunter Biden's involvement in business dealings … ",
    "url": "https://www.cnn.com/2024/02/15/politics/former-fbi-informant-charged-biden-burisma/"
  },
  {
    "text": "Special counsel charges FBI confidential source for allegedly providing false derogatory info on President Biden, Hunter Biden  —  Alexander Smirnov was arrested in Las Vegas on Wednesday.  —  The FBI seal is seen outside the headquarters building in Washington, DC on July 5, 2016.",
    "url": "https://abcnews.go.com/Politics/special-counsel-charges-fbi-confidential-source-alexander-smirnov/story?id=107275129"
  },
  {
    "text": "Trump permits Jan. 6-related lawsuits against him to advance — for now  —  The former president decided against asking the Supreme Court to intervene and declare him immune but signaled he may challenge the suits later.  —  Donald Trump is passing up the chance to add a fourth case to a trio … ",
    "url": "https://www.politico.com/news/2024/02/15/trump-jan-6-civil-immunity-00141851"
  },
  {
    "text": "Will Georgia prosecutor be removed from election case against Donald Trump?  Judge to hear arguments  —  ATLANTA (AP) — Should District Attorney Fani Willis be removed from the Georgia election interference case against former President Donald Trump because of her personal relationship with a special prosecutor?",
    "url": "https://apnews.com/article/fani-willis-hearing-trump-case-potential-conflict-c37fcf993ac33c150f3cb3e4a7a888db"
  },
  {
    "text": "Rosendale drops Montana Senate bid — after less than a week  —  Rosendale had just launched his long-anticipated Senate bid last Friday.  —  GOP Rep. Matt Rosendale is dropping his Montana Senate bid less than a week after he officially launched it, he confirmed to POLITICO.",
    "url": "https://www.politico.com/news/2024/02/15/rosendale-drops-montana-senate-bid-00141812"
  },
  {
    "text": "Reporter asks Ron DeSantis why he can affirm his height with lifts, but stands against gender-affirming care  —  In a Thursday morning press conference in Florida, Republican Gov. Ron DeSantis, a failed 2024 presidential candidate, flanked by representatives from the Southern Poverty Law … ",
    "url": "https://www.advocate.com/politics/ron-desantis-shoe-lifts-presser"
  },
  {
    "text": "Puck: White House Reporters Knew About Biden All Along  —  According to a recent ABC News/Ipsos poll, 86% of Americans now believe Joe Biden's too old to serve as president.  The mainstream media's fluffing of Biden and deflection to the fitness of Donald Trump hasn't fooled most voters, and that includes 73% of Democrats.",
    "url": "https://hotair.com/ed-morrissey/2024/02/15/puck-white-house-reporters-all-know-bidens-unfit-but-wont-report-it-n3782999"
  },
  {
    "text": "Donald Trump Will Be the First Former President to Face a Criminal Trial, Judge Rules  —  Trump's New York case will begin in March.  —  A New York judge ruled Thursday that Donald Trump will stand trial in March on charges related to the Stormy Daniels coverup.",
    "url": "https://www.motherjones.com/politics/2024/02/donald-trump-stormy-daniels-new-york-trial/"
  },
  {
    "text": "Joe Rogan and Bret Weinstein Promote AIDS Denialism to an Audience of Millions  —  Weinstein repeated discredited theories to Rogan about HIV not being the cause of AIDS, alarming and infuriating public health experts.  —  Bret Weinstein, the evolutionary biology professor turned podcaster … ",
    "url": "https://www.vice.com/en/article/jg543y/joe-rogan-and-bret-weinstein-promote-aids-denialism-to-an-audience-of-millions"
  },
  {
    "text": "House GOP sets rule-vote failure record  —  Presented by With assists from POLITICO's Congress team  —  WHY RULE VOTE FAILURES COULD ONLY GET WORSE FOR JOHNSON  —  Failing to pass a rule.  It's typically a process that leadership gives little thought, a minor bump on the path to passage.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/02/15/house-gop-sets-rule-vote-failure-record-00141801"
  },
  {
    "text": "Senator Blumenthal Pretends To Fix KOSA; It's A Lie  —  from the blumenthal's-lies-will-kill dept  —  As lots of folks are reporting, Senator Richard Blumenthal, this morning, released an updated version of the Kids Online Safety Act (KOSA).  He and co-author Senator Marsha Blackburn … ",
    "url": "https://www.techdirt.com/2024/02/15/senator-blumenthal-pretends-to-fix-kosa-its-a-lie/"
  },
  {
    "text": "Has Wired Given Up On Fact Checking?  Publishes Facts-Optional Screed Against Section 230 That Gets Almost Everything Wrong  —  from the that's-not-how-any-of-this-works dept  —  What is going on at Wired Magazine?  A few years ago, the magazine went on a bit of a binge with some articles that completely misrepresented Section 230.",
    "url": "https://www.techdirt.com/2024/02/15/has-wired-given-up-on-fact-checking-publishes-facts-optional-screed-against-section-230-that-gets-almost-everything-wrong/"
  },
  {
    "text": "The Day I Put $50,000 in a Shoe Box and Handed It to a Stranger … On a Tuesday evening this past October, I put $50,000 in cash in a shoe box, taped it shut as instructed, and carried it to the sidewalk in front of my apartment, my phone clasped to my ear.  “Don't let anyone hurt me,” I told the man on the line, feeling pathetic.",
    "url": "https://www.thecut.com/article/amazon-scam-call-ftc-arrest-warrants.html"
  },
  {
    "text": "The Real Dangers Behind the Russian ‘Space Nuke’ Frenzy  —  The “national security threat” that sent American officials scrambling this week can't attack humans, but it can still wreak havoc on the U.S.  —  A “troubling” U.S. national security warning has stirred chaos on both ends … ",
    "url": "https://www.thedailybeast.com/the-real-dangers-behind-the-russian-space-nukes-frenzy-in-washington"
  },
  {
    "text": "Elon Musk's X Gave Check Marks to Terrorist Group Leaders, Report Says  —  A new report cited 28 “verified” accounts on X that appear to be tied to sanctioned groups or individuals.  —  A watchdog group's investigation found that terrorist group Hezbollah and other US-sanctioned entities … ",
    "url": "https://www.wired.com/story/elon-musk-x-checkmarks-terrorist-groups/"
  },
  {
    "text": "New bill would let defendants inspect algorithms used against them in court … A pair of Democratic lawmakers are seeking to give defendants more information about algorithms used against them in a criminal trial.  —  Reps. Mark Takano (D-CA) and Dwight Evans (D-PA) reintroduced the Justice … ",
    "url": "https://www.theverge.com/2024/2/15/24074214/justice-in-forensic-algorithms-act-democrats-mark-takano-dwight-evans"
  },
  {
    "text": "U.S. conducted cyberattack on suspected Iranian spy ship  —  The covert operation was intended to inhibit the ship's ability to share intelligence with Houthi rebels who have been attacking cargo ships in the Red Sea.  —  WASHINGTON — The United States recently conducted a cyberattack … ",
    "url": "https://www.nbcnews.com/news/investigations/us-conducted-cyberattack-suspected-iranian-spy-ship-rcna138638"
  }
]