[
  {
    "text": "Senate staffer alleged by conservative outlets to have had sex in a hearing room is no longer employed  —  Conservative news outlets alleged that the aide to Sen. Ben Cardin, D-Md., appeared in a leaked video showing men having sex in a Senate hearing room.  —  Sen. Ben Cardin's office … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-staffer-alleged-conservative-outlets-sex-hearing-room-rcna130095"
  },
  {
    "text": "EXCLUSIVE: Senate Staffer Caught Filming Gay Sex Tape In Senate Hearing Room (GRAPHIC)  —  Leaked amateur pornography shows a congressional staffer having anal sex with an unknown man in the Senate hearing room, video obtained by the Daily Caller shows.  —  The alleged staffer can also be seen … ",
    "url": "https://dailycaller.com/2023/12/15/staffer-caught-filming-sex-tape-senate-hearing-room/"
  },
  {
    "text": "Florida Sex Scandal Shakes Moms for Liberty, as Group's Influence Wanes  —  The conservative group led the charge on the Covid-era education battles.  But scandals and losses are threatening its power.  —  Moms for Liberty, a national right-wing advocacy group, was born in Florida as a response … ",
    "url": "https://www.nytimes.com/2023/12/16/us/politics/moms-for-liberty-sex-scandal.html"
  },
  {
    "text": "McCarthy mentee Vince Fong determined ineligible for congressional candidacy  —  California Assemblyman Vince Fong (R) isn't eligible to run for Congress in 2024, the state Secretary of State determined Friday, throwing Rep. Kevin McCarthy's (R-Calif.) succession into question.",
    "url": "https://thehill.com/homenews/house/4363558-mccarthy-mentee-vince-fong-ineligible-for-congress/"
  },
  {
    "text": "Lawsuit claims CPAC knew of past allegations of sexual misconduct by Matt Schlapp  —  Officials overseeing the Conservative Political Action Conference knew about past accusations of sexual misconduct by chairman Matt Schlapp but failed to investigate or remove him from his powerful post … ",
    "url": "https://www.washingtonpost.com/nation/2023/12/16/cpac-matt-schlapp-lawsuit-sexual-misconduct/"
  },
  {
    "text": "Why a Trump conviction might not save Biden's reelection  —  Pollsters have already started to explore what effect, if any, a criminal conviction before the election would have on Trump's support.  —  It's the go-to refrain for Democrats watching Joe Biden fall behind Donald Trump in polls: Just wait until Trump is convicted.",
    "url": "https://www.politico.com/news/2023/12/16/why-a-trump-conviction-might-not-save-bidens-reelection-00132125"
  },
  {
    "text": "Biden prides himself on being pro-labor.  But one union that backed him early in 2020 remains on the sidelines this time.  —  The firefighters union was the first to support Biden last time he ran, but so far hasn't waded into this contest.  Some leaders say that is because Trump is more popular among members.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-firefighters-union-rcna129571?taid=657d83327bf49b0001e638a0"
  },
  {
    "text": "What is Rudy Giuliani's net worth in 2023?  Here's a look into his assets amid defamation trial.  —  Rudy Giuliani followed his time in public service with a lucrative career in the private sector that turned him into a multimillionaire.  But the former New York mayor now faces legal damages … ",
    "url": "https://www.cbsnews.com/news/rudy-giuliani-net-worth/"
  },
  {
    "text": "Sunday shows preview: Foreign aid, border bill in limbo; GOP candidates fight for Iowa  —  Aid for Ukraine and Israel in their respective wars will likely be the focus of this week's Sunday news shows, as the assistance has been in limbo as Senate Republicans demand more attention be given to the border.",
    "url": "https://thehill.com/homenews/sunday-talk-shows/4363988-sunday-shows-preview-foreign-aid-border-bill-gop-iowa/"
  },
  {
    "text": "Statement from President Joe Biden on the Passing of Amir Sheikh Nawaf Al-Ahmed Al-Jaber Al-Sabah  —  Jill and I were saddened to learn of the passing of His Highness Amir Sheikh Nawaf Al-Ahmed Al-Jaber Al-Sabah, the Amir of Kuwait.  Sheikh Nawaf was a valued partner and true friend … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/16/statement-from-president-joe-biden-on-the-passing-of-amir-sheikh-nawaf-al-ahmed-al-jaber-al-sabah/"
  },
  {
    "text": "‘The venom of our age’: James Carville on the danger of Mike Johnson's Christian nationalism  —  The veteran Democratic strategist discusses the ‘hypocrisy’ of his fellow Louisianan and the solace found in his own Catholic faith  —  As hard-right movements rattle or control European governments … ",
    "url": "https://www.theguardian.com/us-news/2023/dec/16/james-carville-mike-johnson-christian-nationalism"
  },
  {
    "text": "Joint Press Statement on Nuclear Consultative Group Meeting  —  The second U.S.-Republic of Korea (ROK) Nuclear Consultative Group (NCG) convened in Washington D.C. on December 15, 2023.  Established to implement President Joseph R. Biden, Jr. and President Yoon Suk Yeol's Washington Declaration … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/16/joint-press-statement-on-nuclear-consultative-group-meeting/"
  },
  {
    "text": "Watchdog groups push for disbarment of ex-Trump attorney Jenna Ellis over Georgia charges  —  Watchdog groups called for former Trump attorney Jenna Ellis's disbarment in a letter Friday.  —  “We, together with the additional signatories below, write to urge the Office of Attorney Regulation Counsel … ",
    "url": "https://thehill.com/regulation/court-battles/4363534-watchdog-groups-push-disbarment-ellis-over-georgia-charges/"
  },
  {
    "text": "Senators Hold Up 43 Biden Diplomatic Nominees as Crises Roil World  —  The State Department says the monthslong blockade has damaged U.S. national security.  Several Republican senators have objected to advancing the slate of nominees.  —  The Biden administration has 43 presidential … ",
    "url": "https://www.nytimes.com/2023/12/15/us/politics/senate-state-nominees-diplomats-republicans.html"
  }
]