[
  {
    "text": "Axios interview: Susie Wiles vows to block West Wing troublemakers … Wiles, who was co-campaign manager, gets much of the credit.  Two weeks from today, she'll bring her formula to Washington. … - The veteran Florida political operative — a former lobbyist who worked for Trump's GOP primary rival … ",
    "url": "https://www.axios.com/2025/01/06/axios-interview-susie-wiles-trump"
  },
  {
    "text": "The Internet Is Worse Than a Brainwashing Machine  —  A rationale is always just a scroll or a click away.  —  Try to remember for a moment how you felt on January 6, 2021.  Recall the makeshift gallows erected on the Capitol grounds, the tear gas, and the sound of the riot shields colliding with hurled flagpoles.",
    "url": "https://www.theatlantic.com/technology/archive/2025/01/january-6-justification-machine/681215/?gift=bQgJMMVzeo8RHHcE1_KM0a4qV9a0Rv2_NNVQ656zT6A&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "What Americans should remember about Jan. 6  —  Four years ago, our democracy was put to the test — and prevailed.  —  Joe Biden is president of the United States.  —  On this Jan. 6, order will be called.  Clerks, staff and members of Congress will gather to certify the results of a free … ",
    "url": "https://www.washingtonpost.com/opinions/2025/01/05/president-biden-jan-6-democracy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2MDUzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3NDM1NTk5LCJpYXQiOjE3MzYwNTMyMDAsImp0aSI6ImFlMjc4YmZjLTRlOGUtNGZjOS1hZDQ5LWNlOWY5Zjg0ODE5YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzAxLzA1L3ByZXNpZGVudC1iaWRlbi1qYW4tNi1kZW1vY3JhY3kvIn0.D7SX-A_K83IvLq493kb52ukRKWvbmxjl25eZLxCGvyo&itid=gfta"
  },
  {
    "text": "With an intent stare, a wide smile and a simple declaration, Harris certifies her loss to Trump  —  Vice President Kamala Harris presided over a joint session of Congress on Monday, certifying the results of the 2024 election in which she lost to Donald Trump.",
    "url": "https://www.nbcnews.com/politics/kamala-harris/kamala-harris-certifies-loss-donald-trump-rcna186013"
  },
  {
    "text": "Sunny Hostin Makes Disgusting, Offensive Comparison to January 6th, Then Gets Launched Into Orbit  —  With another January 6th upon us, it was just a matter of time before someone delivered the worst take of the day, and no one will be shocked to learn that it came out of Sunny Hostin's mouth.",
    "url": "https://redstate.com/bonchie/2025/01/06/sunny-hostin-makes-disgustingly-offensive-comparison-to-january-6th-then-gets-launched-into-orbit-n2184014"
  },
  {
    "text": "Don't Let Trump Whitewash the Truth About Jan. 6  —  The nation needs to remember the facts of the violent insurrection four years ago despite the president-elect's attempts to rewrite history.  —  History, the saying goes, is written by the victors.  —  That particular flex is in motion today … ",
    "url": "https://www.bloomberg.com/opinion/articles/2025-01-06/don-t-let-trump-whitewash-the-truth-about-jan-6?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczNjE3MDUyMywiZXhwIjoxNzM2Nzc1MzIzLCJhcnRpY2xlSWQiOiJTUE8xQzlUMEcxS1cwMCIsImJjb25uZWN0SWQiOiJGMUM1Mzc1OEY5Qjg0MDZCOUJCNzMyODRDN0RBMEY3QyJ9.xW1Rl15QI2Kq_MFfB7IX8glM71bJGZ6eDNxNYFTpG5E"
  },
  {
    "text": "Four years later  —  The unapologetic nature of Trump's political renaissance is an ongoing menace  —  The scariest thing about contemporary American politics is that on January 7, 2021, it was widely acknowledged among American conservatives that Donald Trump's behavior on January 6th was completely unacceptable.",
    "url": "https://www.slowboring.com/p/four-years-later"
  },
  {
    "text": "Our National Day of Shame  —  The Bulwark grows!  The Bulwark will swallow the world!  —  Semafor let the cat out of the bag this morning on our first expansion of the new year.  We're bringing on reporter Adrian Carrasquillo for a new twice-weekly newsletter, Huddled Masses … ",
    "url": "https://www.thebulwark.com/p/our-national-day-of-shame"
  },
  {
    "text": "Attorney General Merrick B. Garland Statement on the Fourth Anniversary of the January 6 Attack on the Capitol  —  For Immediate Release  —  The Justice Department issued the following statement from Attorney General Merrick B. Garland on the fourth anniversary of the attack on the U.S. Capitol … ",
    "url": "https://www.justice.gov/opa/pr/attorney-general-merrick-b-garland-statement-fourth-anniversary-january-6-attack-capitol"
  },
  {
    "text": "Biden bans new offshore oil and gas drilling in most federal waters  —  WASHINGTON — President Joe Biden is moving to ban new offshore oil and gas drilling in most U.S. coastal waters, a last-minute effort to block possible action by the incoming Trump administration to expand offshore drilling.",
    "url": "https://www.npr.org/2025/01/06/g-s1-41154/biden-ban-new-offshore-oil-gas-drilling"
  },
  {
    "text": "Biden permanently bans offshore drilling in 625 million acres of ocean, making a Trump reversal difficult  —  President Joe Biden on Monday announced an executive action that will permanently ban future offshore oil and gas development in parts of the Atlantic and Pacific oceans … ",
    "url": "https://www.cnn.com/2025/01/06/business/biden-offshore-drilling-ban-trump"
  },
  {
    "text": "Judge finds Rudy Giuliani in contempt for failed responses in $148 million defamation judgment case  —  A federal judge in New York City on Monday said that Rudy Giuliani was in contempt of court for failing to properly respond to requests for information as he turned over assets to satisfy … ",
    "url": "https://apnews.com/article/rudy-giuliani-defamation-georgia-election-workers-5fe7787f42b4b89ef9d6df50bcde2efb"
  },
  {
    "text": "Trump aides ready ‘universal’ tariff plans — with one key change  —  President-elect's aides look at universal import duties, but only on certain sectors, among first big moves of presidency.  —  President-elect Donald Trump's aides are exploring tariff plans that would be applied … ",
    "url": "https://www.washingtonpost.com/business/2025/01/06/trump-tariff-economy-trade/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2MTM5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3NTIxOTk5LCJpYXQiOjE3MzYxMzk2MDAsImp0aSI6ImIyY2QzNzBkLTgxNDctNGNjMy1iZjBlLWJlZTE0OTgzNzZkZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzA2L3RydW1wLXRhcmlmZi1lY29ub215LXRyYWRlLyJ9.el2pftfrzzyx3P1kg79fnhzpBgd4Vi9xEtvIDwrVE98"
  },
  {
    "text": "First step on reconciliation in limbo amid GOP infighting  —  Republicans are looking to take the first step to jumpstart the budget reconciliation bill: writing the instructions that will govern the terms of the package.  But they're stuck in limbo amid an ongoing debate about whether to go with a one- or two-bill strategy.",
    "url": "https://www.politico.com/live-updates/2025/01/06/congress/awaiting-reconciliation-instructions-00196719"
  },
  {
    "text": "Trudeau resigns as Canadian prime minister after collapse of support  —  Canadian Prime Minister Justin Trudeau is stepping down from his role as head of the nation's government.  —  Trudeau announced his decision on Monday at a press conference outside his residence at Rideau Cottage in Ottawa, Ontario.",
    "url": "https://www.washingtonexaminer.com/news/world/3277172/trudeau-resigns-canadian-prime-minister-collapse-support/"
  },
  {
    "text": "Biden Uses 72-Year-Old Law to Give Trump a Slap in the Face Before MAGA 2.0  —  The White House move could create a roadblock to one of President-elect Trump's major plans.",
    "url": "https://www.thedailybeast.com/biden-uses-72-year-old-law-to-give-trump-a-slap-in-the-face-before-maga-20/"
  },
  {
    "text": "Washington Post expected to lay off dozens of staffers in coming week - report  —  ‘Cuts will be deep’, media reporter writes, after paper faced scrutiny for halting endorsement of Harris in October  —  Dozens of employees are expected to be laid off at the Washington Post in the coming week … ",
    "url": "https://www.theguardian.com/media/2025/jan/06/washington-post-layoffs"
  },
  {
    "text": "No, Trump wasn't “confused” about the New Orleans attack  —  On New Year's Day, a driver intentionally steered a truck into a crowd in New Orleans, killing 14 people.  Trump and other MAGA leaders, echoing a false Fox News report, quickly rushed to blame President Biden's supposedly lax security at the border.",
    "url": "https://www.publicnotice.co/p/trump-new-orleans-attack-fox-misinformation"
  },
  {
    "text": "Trump Seeks to Halt His Criminal Sentencing in New York  —  A Manhattan judge has already indicated that he will spare Donald J. Trump from jail time, but the president-elect is seeking to avoid the symbolic blow of the criminal proceeding.  —  President-elect Donald J. Trump has signaled … ",
    "url": "https://www.nytimes.com/2025/01/06/nyregion/trump-trial-sentencing-new-york.html"
  },
  {
    "text": "Chuck Schumer Denies Misleading Public About Biden's Decline Despite Watching Proof On-Air  —  Schumer was confronted Sunday on MSNBC with footage in which he decried the idea of President Biden's cognitive decline as “right-wing propaganda.”  —  LOADING  —  Senate Majority Leader Chuck Schumer … ",
    "url": "https://www.huffpost.com/entry/chuck-schumer-denies-misleading-public-joe-biden_n_677ac3bde4b06caca8e49c71"
  }
]