[
  {
    "text": "Syria rebels celebrate in captured Homs, set sights on Damascus  —  Syrian President Bashar al-Assad flew out of Damascus for an unknown destination on Sunday, two senior army officers told Reuters, as rebels said they had entered the capital with no sign of army deployments.",
    "url": "https://www.reuters.com/world/middle-east/syria-rebels-celebrate-captured-homs-set-sights-damascus-2024-12-07/"
  },
  {
    "text": "Syria Live Updates: Government Forces Withdraw From Damascus Suburbs, Monitors Say  —  Two war monitoring groups said Syria's military had pulled out of a number of Damascus suburbs where anti-government protests erupted.  The movements could not immediately be confirmed.  —  Here are the latest developments.",
    "url": "https://www.nytimes.com/live/2024/12/07/world/syria-war-damascus"
  },
  {
    "text": "In the Syrian Regime's Hour of Need, Its Patron Iran Makes an Exit  —  The collapse of a partnership built over four decades would reshape the balance of power in the Middle East.  —  For decades, Iran has expended much blood and money in support of Syria's president, Bashar al-Assad … ",
    "url": "https://www.nytimes.com/2024/12/07/world/middleeast/iran-syria-rebels.html"
  },
  {
    "text": "BREAKING: Syrian rebels announce fall of Russia-backed Assad regime  —  Editor's Note: This is a developing story and is being updated.  —  Syrian rebels announced on Dec. 8 that they had ousted President Bashar al-Assad from the capital city of Damascus.  —  “The tyrant Bashar al-Assad has fled.",
    "url": "https://kyivindependent.com/breaking-syrian-rebels-announce-fall-of-assad-regime/"
  },
  {
    "text": "Assad regime in Syria may fall in days, US increasingly believes  —  Biden administration officials, watching the remarkable speed of the Syrian rebel advance, increasingly see the possibility of the regime of Bashar al-Assad falling within days, five US officials told CNN.",
    "url": "https://www.cnn.com/2024/12/07/politics/assad-regime-syrian-civil-war/"
  },
  {
    "text": "US announces nearly $1 billion more in longer-term weapons support for Ukraine  —  The United States will provide nearly $1 billion more in longer-term weapons support to Ukraine, Defense Secretary Lloyd Austin said Saturday as the Biden administration rushes to spend all the congressionally approved money … ",
    "url": "https://apnews.com/article/ukraine-weapons-russia-trump-biden-himars-zelenskyy-7b2560ad6bd54a6275da0ceb5241c0e8"
  },
  {
    "text": "Biden administration announces nearly $1 billion aid package for Ukraine as Trump meets with Zelenskyy  —  The package brings the total the U.S. has committed to Ukraine to over $62B.  —  In this Oct. 21, 2024, file photo, US Secretary of Defense Lloyd Austin speaks at a press briefing following … ",
    "url": "https://abcnews.go.com/Politics/biden-administration-announces-1-billion-aid-package-ukraine/story?id=116562732"
  },
  {
    "text": "Biden Administration Announces New Security Assistance Package for Ukraine  —  Today, the Department of Defense (DoD) announced a significant new security assistance package to ensure Ukraine has the tools it needs to prevail in its fight against Russian aggression.",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3989537/biden-administration-announces-new-security-assistance-package-for-ukraine/"
  },
  {
    "text": "Youngkin: Jordanians ‘crashed’ Quantico.  Feds: It was an Amazon delivery.  —  Virginia's governor has used the arrest of two undocumented men who misunderstood directions to stop at a check-in station to inflame fears over illegal immigration.  —  RICHMOND — There are two versions … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/12/07/youngkin-jordanians-crashed-quantico-feds-it-was-an-amazon-delivery/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzNTQ3NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0OTI5OTk5LCJpYXQiOjE3MzM1NDc2MDAsImp0aSI6IjgzYWY1MTMyLTUzMWEtNGU2My04YzgzLWI4MTI5Y2YyZDg2ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI0LzEyLzA3L3lvdW5na2luLWpvcmRhbmlhbnMtY3Jhc2hlZC1xdWFudGljby1mZWRzLWl0LXdhcy1hbi1hbWF6b24tZGVsaXZlcnkvIn0.1jJjTWfYv90NubfLGoqKzGOt_YV22RwoDeDyoEMQSMs&itid=gfta"
  },
  {
    "text": "Want a Job in the Trump Administration?  Be Prepared for the Loyalty Test.  —  Applicants for government posts, including inside the Pentagon and the intelligence agencies, say they have been asked about their thoughts on Jan. 6 and who they believe won the 2020 election.",
    "url": "https://www.nytimes.com/2024/12/07/us/politics/trump-administration-loyalty-test.html?unlocked_article_code=1.f04.VnV0.LFCzCFmEwLaBio"
  },
  {
    "text": "What the Murder of the UnitedHealthcare C.E.O. Means to America  —  What the death of a health-insurance C.E.O. means to America.  —  As you know, the C.E.O. of UnitedHealthcare, fifty-year-old Brian Thompson, was murdered on the street in midtown Manhattan, on Wednesday morning, twenty minutes before sunrise.",
    "url": "https://www.newyorker.com/news/the-lede/what-the-murder-of-the-unitedhealthcare-ceo-brian-thompson-means-to-america"
  },
  {
    "text": "Congrats to CNN for Lowest-Rated Week in Decades  —  It's well deserved  —  The exodus from corporate media continues, as CNN just had their worst week in ratings since 2001.  For ages 25-54, it was the lowest number of viewers they've had in almost 30 years.",
    "url": "https://www.dworkinsubstack.com/p/congrats-to-cnn-for-lowest-rated"
  },
  {
    "text": "FDA may outlaw food dyes ‘within weeks’: Bombshell move would affect candy, soda and cakes, revolutionize American diets  —  The Food and Drug Administration will decide on a ban of certain food dyes in the coming weeks after receiving a petition to review the safety of Red 3, NBC News reports.",
    "url": "https://nypost.com/2024/12/07/lifestyle/fda-may-outlaw-food-dyes-within-weeks-bombshell-move-would-affect-candy-soda-and-cakes-revolutionize-american-diets/"
  },
  {
    "text": "UnitedHealthcare CEO shooting latest: Suspect's backpack had Monopoly money: Sources  —  The manhunt for CEO Brian Thompson's killer is now on its fourth day.  —  Members of the NYPD search the pond near Bethesda Fountain in Central Park for possible evidence tied to the shooting death … ",
    "url": "https://abcnews.go.com/US/unitedhealthcare-ceo-shooting-latest-manhunt-nationwide-police-learn/story?id=116551771"
  },
  {
    "text": "Trump isn't back in office but he's already pushing his agenda and negotiating with world leaders  —  He's making threats, traveling abroad and negotiating with world leaders.  Donald Trump has more than a month and a half to go before he's sworn in for a second term.",
    "url": "https://apnews.com/article/trump-transition-trade-foreign-leader-meetings-biden-c795cbb38b6b943c19a70fe046cad7d5"
  },
  {
    "text": "Democrats inch toward the anger phase of their election loss  —  The winter meeting of state Democratic chairs in Arizona marked one of the first major gatherings of top party officials since last month's disastrous election.  —  SCOTTSDALE, Arizona — Exactly one month after losing … ",
    "url": "https://www.politico.com/news/2024/12/07/democrat-chairs-post-election-anger-exhaustion-00193120"
  },
  {
    "text": "Revealed: the tech bosses who poured $394.1m into US election - and how they compared to Elon Musk  —  FEC filings offer only a glimpse of the money tech is pouring into Washington as it seeks to influence government  —  Silicon Valley poured more than $394.1m into the US presidential election this year … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/07/campaign-spending-crypto-tech-influence"
  },
  {
    "text": "Trump hesitates to personally lobby for endangered Cabinet picks  —  The president-elect is not yet personally pushing hard for his selections, limiting his exposure if they withdraw or fail to win confirmation.  —  President-elect Donald Trump, a lifelong teetotaler whose brother struggled … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/07/trump-hegseth-cabinet-picks/"
  },
  {
    "text": "How Trump's transition could end up hamstringing his agenda  —  The president-elect's advisers haven't yet begun meeting with federal agencies, despite signing an agreement late last month allowing them to do so.  —  President-elect Donald Trump's transition team still has not sent policy advisers … ",
    "url": "https://www.politico.com/news/2024/12/07/trump-transition-team-delays-00193119"
  }
]