[
  {
    "text": "A tantalizing detail in a new Trump legal filing  —  The government signals it plans to prove Donald Trump's much-debated intent for taking and keeping classified documents  —  Donald Trump's many legal problems have led to a veritable fire hose of often-mundane, procedural court filings.",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/trump-classified-documents-motive/"
  },
  {
    "text": "After years of exaggerating his business assets, Trump confronts them in court  —  A civil case entering its second week threatens to put on display unprecedented details about how Trump's business operated  —  When Donald Trump needed to value his Trump Tower apartment for homeowner's insurance in 2010 … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/trump-fraud-trial-property-value-wealth/"
  },
  {
    "text": "Prosecutors Ask if Trump Will Blame His Lawyers as Defense in Election Case  —  The special counsel asked a judge to require the former president to disclose whether he would blame poor legal advice for his attempts to overturn his 2020 election loss.  —  Federal prosecutors asked a judge … ",
    "url": "https://www.nytimes.com/2023/10/10/us/politics/prosecutors-trump-blame-lawyers.html"
  },
  {
    "text": "Trump's Overrated Peace Plan Helped Enable the Horrors in Israel and Gaza  —  The Abraham Accords didn't bring “the dawn of a new Middle East,” they completely ignored the Palestinians and let the Netanyahu government do almost anything it wanted. … No American president caused Hamas … ",
    "url": "https://www.thedailybeast.com/trumps-overrated-peace-plan-helped-enable-horrors-in-israel-gaza"
  },
  {
    "text": "Palestinians scramble for safety as Israel pounds sealed-off Gaza Strip to punish Hamas  —  Drone footage captures extent of destruction caused by Israeli airstrikes in Gaza City  —  Concerns mount over Israel's next move as government vows to siege Gaza  —  Israel continues retaliation on fourth day of war",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-airstrikes-hostages-bf6c42f84526c4d9416978c8effd932a"
  },
  {
    "text": "Embattled Rep. George Santos hit with additional charges, including identity theft  —  Prosecutors said Santos claimed he made non-existent loans to his campaign while making unauthorized charges on donors' credit cards.  —  Federal prosecutors hit Rep. George Santos, R-N.Y. … ",
    "url": "https://www.nbcnews.com/politics/congress/santos-charged-identity-theft-rcna119819"
  },
  {
    "text": "Congressman George Santos Charged With Conspiracy, Wire Fraud, False Statements, Falsification of Records, Aggravated Identity Theft, and Credit Card Fraud  —  For Immediate Release  —  U.S. Attorney's Office, Eastern District of New York  —  Santos Allegedly Filed Fraudulent Fundraising Reports … ",
    "url": "https://www.justice.gov/usao-edny/pr/congressman-george-santos-charged-conspiracy-wire-fraud-false-statements-0"
  },
  {
    "text": "Heat for NYC-DSA after pro-Palestine rally  —  HAPPENING TODAY: Former Rep. Tom Suozzi is expected to launch his comeback bid for the seat now held by Rep. George Santos, three people familiar with the plan told Playbook.  The Democrat — and many other challengers — are thinking … ",
    "url": "https://www.politico.com/newsletters/new-york-playbook/2023/10/10/heat-for-nyc-dsa-after-pro-palestine-rally-00120675"
  },
  {
    "text": "Speaker Candidates Jordan, Scalise Commit to Continuing Impeachment Investigation (Exclusive)  —  Sources close to the two lawmakers told The Messenger that they both plan to keep the investigation going if they are speaker … The two Republicans running to be the next speaker of the House … ",
    "url": "https://themessenger.com/politics/speaker-candidates-jordan-scalise-commit-to-continuing-impeachment-investigation"
  },
  {
    "text": "North Carolina Republicans override governor's veto on key election law  —  Gov. Roy Cooper (D) has cast the bill as a threat to democracy in the state.  Republicans say it takes politics out of the process of administering the vote.  —  North Carolina Republican lawmakers on Tuesday overrode … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/north-carolina-republican-override-veto/"
  },
  {
    "text": "Survey shows Lake leading Gallego, Sinema in Arizona Senate race  —  Failed GOP Arizona gubernatorial candidate Kari Lake appears to have a slight lead over Rep. Ruben Gallego (D-Ariz.) and Sen. Krysten Sinema (I-Ariz.) in a hypothetical three-way contest for Sinema's seat next year, according to a new poll.",
    "url": "https://thehill.com/homenews/campaign/4247574-survey-shows-lake-leading-gallego-sinema-in-arizona-senate-race/"
  },
  {
    "text": "Tuberville reports former CIA director Hayden to Capitol Police over tweet  —  Sen. Tommy Tuberville (R-Al.) reported the former CIA Director Michael Hayden to the Capitol Police on Tuesday over the former general's tweet suggesting the lawmaker should be removed from the human race.",
    "url": "https://thehill.com/policy/defense/4248524-tuberville-reports-former-cia-director-hayden-to-capitol-police-over-tweet/"
  },
  {
    "text": "In Search of Kamala Harris  —  After nearly three years, the vice president is still struggling to make the case for herself — and feels she shouldn't have to.  —  All the conditions seemed right for a chance to reset the narrative.  —  At the Munich Security Conference in February … ",
    "url": "https://www.nytimes.com/2023/10/10/magazine/kamala-harris.html"
  },
  {
    "text": "War in the Middle East  —  A Statement from President Claudine Gay  —  As the events of recent days continue to reverberate, let there be no doubt that I condemn the terrorist atrocities perpetrated by Hamas.  Such inhumanity is abhorrent, whatever one's individual views of the origins of longstanding conflicts in the region.",
    "url": "https://www.harvard.edu/president/news/2023/war-in-the-middle-east/"
  },
  {
    "text": "Moms for Liberty meets its match: Parents in this swing suburban district are fighting back  —  Republicans hope to use education wars to turn purple suburbia red.  In one Pennsylvania district, that backfired  —  “Monster Liberty”: That's how the otherwise excellent closed-captioning service … ",
    "url": "https://www.salon.com/2023/10/10/moms-for-liberty-meets-its-match-parents-in-this-swing-suburban-district-are-fighting-back/"
  },
  {
    "text": "McCarthy loyalists vow to draw out painful speakership battle  —  House Republicans' state of emotional limbo is particularly problematic, since they'd otherwise welcome the chance to move quickly on aiding Israel.",
    "url": "https://www.politico.com/live-updates/2023/10/10/congress/mccarthy-speaker-vote-israel-math-00120720"
  },
  {
    "text": "Jim Jordan's new shutdown threat highlights an unnerving right-wing trend  —  Republicans spend more time talking about the practical problems posed by the U.S.-Mexico border than any other issue — even as much of what they propose to address them is utter fantasy.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/10/jim-jordan-house-gop-government-shutdown/"
  },
  {
    "text": "Clarence Thomas Wants to Go After Freedom of the Press  —  Amid coverage of his relationships with high-profile conservatives, the Supreme Court justice wants to reconsider a landmark First Amendment cases … Justice Clarence Thomas has some thoughts.  —  The 1964 ruling established limits … ",
    "url": "https://www.rollingstone.com/politics/politics-news/clarence-thomas-challenge-landmark-defamation-ruling-1234850483/"
  },
  {
    "text": "RFK Jr. super PAC raises $11 million within hours and courts Elon Musk's support  —  The environmental lawyer-turned-politician is mounting a formidable independent bid.  —  Just hours after Robert F. Kennedy Jr. announced he would run for president as an independent, more than $11 million gushed … ",
    "url": "https://www.politico.com/news/2023/10/10/rfk-jr-raises-11-million-elon-musk-00120731"
  },
  {
    "text": "Former Dodgers star and Republican Steve Garvey enters U.S. Senate race  —  After nearly two decades of statewide Republican candidates being rejected by California's left-leaning electorate, former Dodger All-Star Steve Garvey hopes to drag the GOP back toward political relevance.",
    "url": "https://www.latimes.com/politics/story/2023-10-10/dodgers-star-steve-garvey-senate-race-feinstein-schiff-porter-lee"
  },
  {
    "text": "Alex Jones to fight Georgia prosecutors' bid to call him as witness in trial of Trump co-defendants  —  Fulton County DA Fani Willis indicated Tuesday that she intends to compel the testimony of the far-right broadcaster.  —  Alex Jones intends to resist efforts by Fulton County District Attorney Fani Willis … ",
    "url": "https://www.politico.com/news/2023/10/10/alex-jones-trump-georgia-testimony-00120807"
  },
  {
    "text": "Tim Scott, please drop out, urge others to follow and unite behind Haley  —  Disclosure: The columnist's wife, Mari Will, an adviser to Republican presidential candidate Sen. Tim Scott (S.C.), disagrees with this column.  —  There is national incredulity, exhaustion, embarrassment … ",
    "url": "https://www.washingtonpost.com/opinions/2023/10/10/tim-scott-drop-out-endorse-nikki-haley/"
  },
  {
    "text": "Hamas Militants Behind Israel Attack Raised Millions in Crypto  —  Digital currency transactions highlight how U.S. and Israel have struggled to sever the access of Hamas, Palestinian Islamic Jihad and Hezbollah to foreign funding  —  Hamas's lightning strike on Israel last weekend has raised … ",
    "url": "https://www.wsj.com/world/middle-east/militants-behind-israel-attack-raised-millions-in-crypto-b9134b7a?mod=followamazon"
  }
]