[
  {
    "text": "Michael Cohen suggests Trump's mounting legal fees make him ‘thoroughly compromised’: ‘He is for sale’  —  Michael Cohen - who long served as former President Trump's personal lawyer and fixer - warned on Sunday of the potential risk of sending Trump back to the White House with mounting legal fees and financial liabilities.",
    "url": "https://thehill.com/regulation/court-battles/4475770-michael-cohen-suggests-trumps-mounting-legal-fees-make-him-thoroughly-compromised-he-is-for-sale/"
  },
  {
    "text": "Why Trump's Sleaziest Criminal Case Is So Important  —  Editor's note: The below article first appeared in David Corn's newsletter, Our Land.  The newsletter comes out twice a week (most of the time) and provides behind-the-scenes stories and articles about politics, media, and culture.",
    "url": "https://www.motherjones.com/politics/2024/02/donald-trump-stormy-daniels-hush-money-porn-star-criminal-case/"
  },
  {
    "text": "Suspect dead amid shooting that claimed the lives of 2 officers, 1 first responder, group says  —  A desperate call for help from a home in suburban Minneapolis early Sunday turned deadly for two police officers and a first responder who were shot and killed, according to officials.",
    "url": "https://apnews.com/article/officers-medic-shot-killed-burnsville-minnesota-e742b13f0d2ddca009e38337f46435b5"
  },
  {
    "text": "Heavy police presence at ‘active scene’ in Minnesota neighborhood  —  Minnesota Gov. Tim Walz said police were responding to a call of a family in danger.  The Bureau of Alcohol, Tobacco, Firearms and Explosives described it as a domestic violence call.  —  Two police officers and a first responder … ",
    "url": "https://www.nbcnews.com/news/us-news/heavy-police-presence-active-scene-minnesota-neighborhood-rcna139385"
  },
  {
    "text": "Cheney warns of Republican Party ‘Putin-wing’ after Navalny death  —  GOP former Rep. Liz Cheney on Sunday warned of a Republican Party “Putin-wing” after former President Donald Trump responded to the death of outspoken Kremlin critic Alexey Navalny without actually mentioning him or Russian President Vladimir Putin.",
    "url": "https://www.cnn.com/2024/02/18/politics/liz-cheney-navalny-putin-gop-cnntv/"
  },
  {
    "text": "Wisconsin fake elector on why he signed phony electoral document for Trump  —  The month after the presidential election in 2020, Democratic and Republican electors representing the candidate who won the popular vote in their states gathered across the country to formally cast electoral votes for president.",
    "url": "https://www.cbsnews.com/news/wisconsin-fake-elector-says-he-was-tricked-into-signing-phony-document-claiming-trump-won-60-minutes-transcript/"
  },
  {
    "text": "New presidential rankings place Obama in top 10, Reagan and Trump below Biden  —  Some recent presidents were more likely to have a partisan divide in rankings  —  A new ranking of presidents by a group of self-styled experts determined that Abraham Lincoln is America's greatest president, while Donald Trump ranks last.",
    "url": "https://www.foxnews.com/us/new-presidential-rankings-place-obama-top-10-reagan-trump-below-biden"
  },
  {
    "text": "A harsh truth: The world economy never recovered from the COVID-19 pandemic  —  /business/business/business/business/ business///businessJohn Rapley is an author and academic who divides his time among London, Johannesburg and Ottawa.  His books include Why Empires Fall (Yale University Press … ",
    "url": "https://www.theglobeandmail.com/business/commentary/article-global-economy-covid-19-pandemic/"
  },
  {
    "text": "No Labels ‘talking with several exceptional leaders,’ national co-chair says  —  Dr. Benjamin F. Chavis said the organization was unfazed by Joe Manchin's decision not to run for president.  —  A national co-chair for No Labels said Sunday the organization continues to pursue … ",
    "url": "https://www.politico.com/news/2024/02/18/no-labels-joe-manchin-campaign-00142069"
  },
  {
    "text": "Conservative activist Charlie Kirk helped oust Ronna McDaniel at the RNC.  Now the knives are out for him.  —  The right-wing provocateur's antics — including attacks on Martin Luther King Jr., Black pilots and Taylor Swift — have caused a rift in Trump world.",
    "url": "https://www.nbcnews.com/politics/donald-trump/charlie-kirk-ronna-mcdaniel-rnc-trump-rcna139288"
  },
  {
    "text": "Ukrainian forces don't have enough artillery to battle Russia.  A key withdrawal Saturday shows that  —  Dwindling ammunition threatens Ukraine's hold on the 1,000-kilometer (620-mile) front line under withering assault by Russian artillery.  Defensive lines are in jeopardy.",
    "url": "https://apnews.com/article/russia-ukraine-avdiivka-war-063ab1bd47a500ad4a815b12f3d1386d"
  },
  {
    "text": "Tlaib endorses protest vote against Biden in Michigan  —  Detroit U.S. Rep. Rashida Tlaib is endorsing the campaign urging Michigan Democrats to vote “uncommitted” in the Feb. 27 presidential primary in protest of President Joe Biden's policy in Gaza.  —  In a video posted to social media Saturday … ",
    "url": "https://www.detroitnews.com/story/news/politics/2024/02/17/tlaib-endorses-protest-vote-against-biden-in-michigan/72644878007/"
  },
  {
    "text": "Inside Kamala Harris' quiet effort to break through the Biden campaign's information bubble  —  For some, it's been a conversation off to the side at the White House congressional holiday party.  Others have gathered at actress Eva Longoria's house in Los Angeles.",
    "url": "https://www.cnn.com/2024/02/18/politics/kamala-harris-biden-reelection-effort/"
  },
  {
    "text": "How War in Europe Boosts the U.S. Economy  —  European rearmament and American aid to Ukraine flow back to defense industrial base  —  Proponents of support for Ukraine usually invoke U.S. strategic interests or moral obligations.  Lately, they are making a more calculating case: It is good for the economy.",
    "url": "https://www.wsj.com/politics/national-security/ukraine-war-europe-american-economy-654ca41b?mod=hp_lead_pos5"
  }
]