[
  {
    "text": "Live Updates: Eric Adams Is Indicted in New York  —  The indictment makes Mr. Adams the first sitting New York City mayor to face criminal charges.  —  Here's the latest on the mayor's indictment.  —  Mayor Eric L. Adams has been indicted on federal criminal charges … ",
    "url": "https://www.nytimes.com/live/2024/09/25/nyregion/eric-adams-indicted-corruption?unlocked_article_code=1.Nk4.RfxD.LvCd4VYdPWrg&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Andrew Cuomo eyes NYC mayor job … The charges have not yet been revealed.  — While Adams is adamant he will not be stepping down, he is already facing a tough Democratic primary next year on top of mounting calls to resign.  — Cuomo's formal entrance into the fray would be a wildcard.",
    "url": "https://www.axios.com/2024/09/26/andrew-cuomo-nyc-mayor-eric-adams-indictment"
  },
  {
    "text": "Eric Adams Live Updates: Adams Is Charged With Bribery and Fraud  —  Mayor Eric Adams, indicted in a lengthy corruption investigation, insisted he was innocent.  Prosecutors are expected to detail the charges on Thursday.  —  Here's the latest on the mayor's indictment.",
    "url": "https://www.nytimes.com/live/2024/09/26/nyregion/eric-adams-indicted-news"
  },
  {
    "text": "The Undecided Voters Are Not Who You Think They Are  —  For the great majority of Americans who have firmly settled on Kamala Harris or Donald Trump, the idea that anyone could still be undecided in that choice is almost incomprehensible.  But the incredulity may be rooted in confusion about who most undecided voters really are.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/undecided-voters-2024-election/680026/"
  },
  {
    "text": "Kamala Harris Will Win the Popular Vote  —  Here's how we know.  —  Absent an extraordinary upending event, Kamala Harris will win the national popular vote on November 5th.  I'm confident of that not because she is ahead in the polling averages, or because of a “forecast,” conventionally conceived.",
    "url": "https://www.weekendreading.net/p/kamala-harris-will-win-the-popular"
  },
  {
    "text": "Reid Epstein's Economic Polling Anxiety  —  NYT's Reid Epstein, who fairly routinely says things that make it clear he misunderstands what he's watching, recently substantiated a whine that Kamala Harris doesn't do enough interviews by claiming that Trump faces challenging questions at those things he labels press conferences.",
    "url": "https://www.emptywheel.net/2024/09/26/reid-epsteins-economic-polling-anxiety/"
  },
  {
    "text": "The fruits of Jack Smith's 2-year investigation into Trump will land on Tanya Chutkan's desk today  —  It may be the final inflection point in the case before Nov. 5.  —  Special counsel Jack Smith, stymied at every turn by federal courts from putting Donald Trump on trial … ",
    "url": "https://www.politico.com/news/2024/09/26/jack-smith-trump-investigation-dossier-00181108"
  },
  {
    "text": "Trump May Have Just Handed Jack Smith a Massive Win  —  Did Donald Trump just make Jack Smith's job that much easier by admitting that he knows he lost the 2020 election?  —  During a speech Wednesday in Mint Hill, North Carolina, Trump appeared to give up the game when speaking about his performance four years ago.",
    "url": "https://newrepublic.com/post/186384/donald-trump-jack-smith-2020-election-lost"
  },
  {
    "text": "'There's empirical evidence:' Harris shuts down interviewer who tries to defend Trump  —  Vice President Kamala Harris pushed back at her MSNBC interviewer Wednesday evening over a controversial claim about former President Donald Trump.  —  “The 11th Hour host” Stephanie Ruhle grilled Harris … ",
    "url": "https://www.rawstory.com/kamala-harris-donald-trump/"
  },
  {
    "text": "Clay Higgins sets a new benchmark on the racism Republicans will excuse  —  Former Iowa representative Steve King was punished by House leaders for less.  —  In early 2019, at the beginning of the 116th Congress, House Minority Leader Kevin McCarthy (R-Calif.) announced to the media … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/26/clay-higgins-sets-new-benchmark-racism-republicans-will-excuse/"
  },
  {
    "text": "Rudy Giuliani disbarred in D.C. over 2020 election scheme  —  Just when it seemed things couldn't get much worse for Rudy Giuliani, the former Republican mayor was officially disbarred in Washington, D.C.  —  Last summer, a Washington, D.C.-based bar discipline committee concluded … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/rudy-giuliani-disbarred-dc-2020-election-scheme-rcna172822"
  },
  {
    "text": "Vance keeps gaffing by actually detailing Trump's policies  —  “Concepts of a plan” is an easier sell than what they really want to do. … Donald Trump is a scam artist.  He promises voters everything and delivers almost nothing.  That's worked for him in the past, but Trump's current running mate … ",
    "url": "https://www.publicnotice.co/p/jd-vance-gaffes"
  },
  {
    "text": "Israel-Hezbollah ceasefire report is false, Netanyahu's office says  —  Netanyahu's office denied accepting a US-French proposal for a 21-day ceasefire, stating the IDF will continue operations against Hezbollah.  —  Prime Minister Benjamin Netanyahu's Office dismissed reports that it had accepted … ",
    "url": "https://www.jpost.com/breaking-news/article-821850"
  },
  {
    "text": "Trump lawyers to ask appeals court to toss $489 million civil fraud ruling  —  Lawyers for former President Donald Trump and his company will argue to an appeals panel Thursday that it should throw out a judge's February ruling that Trump must fork over hundreds of millions of dollars … ",
    "url": "https://www.cbsnews.com/news/trump-fraud-appeals-court-489-million/"
  },
  {
    "text": "Pro-Harris sticky notes pop up in women's restrooms and gyms and on tampon boxes  —  Word about the grassroots campaign has spread on social media, primarily on Facebook, with women putting “Woman to woman” notes in places where other women will see them.  —  In the weeks before Election Day … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-sticky-notes-women-restrooms-gyms-tampon-boxes-rcna172570"
  },
  {
    "text": "Trump's promises would spike inflation and wipe out jobs, study finds  —  Former President Donald Trump has promised to attack the United States affordability crisis by imposing immense tariffs, carrying out unprecedented deportations and even influencing interest rate decisions.",
    "url": "https://www.cnn.com/2024/09/26/business/trump-inflation-jobs-tariffs-economy/"
  },
  {
    "text": "Trump voter turnout program now largely run by Elon Musk-backed group  —  Exclusive: America Pac has up to 400 employees in each of the seven key states, with the campaign dependent on it  —  Donald Trump's mass voter turnout program in crucial battleground states is now principally being run … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/26/trump-voter-turnout-elon-musk-pac"
  },
  {
    "text": "‘Be a man and vote for a woman’: Kamala Harris's unlikely edge in America's masculinity election  —  Republicans are making anxiety around masculinity a key voting issue - but the Democratic nominee is hoping to turn it to her advantage  —  A man in a baseball cap strides through a field of corn.",
    "url": "https://www.theguardian.com/us-news/2024/sep/26/masculinity-trump-kamala-harris-us-election"
  },
  {
    "text": "How Musk threatens America's national security, and what must be done  —  His incitement to assassinate America's commander-in-chief is only the most recent illustration  —  Shortly after the apparent second assassination attempt against Trump, Elon Musk responded in a now deleted post … ",
    "url": "https://robertreich.substack.com/p/how-elon-musk-threatens-national"
  },
  {
    "text": "You can order free at-home COVID tests from the federal government again: Here's how  —  (NEXSTAR) — Free COVID tests are available once again through a federally-funded program, giving Americans a chance to get four at-home testing kits sent straight to their mailboxes.",
    "url": "https://thehill.com/homenews/nexstar_media_wire/4900850-you-can-order-free-at-home-covid-tests-from-the-federal-government-again-heres-how/"
  }
]