[
  {
    "text": "How the Special Counsel's Portrayal of Biden's Memory Compares With the Transcript  —  The special counsel, Robert K. Hur, accused the president last month of “significant” memory problems.  The interview transcript offers context to his report.  —  A transcript of a special counsel's hourslong interview … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/hur-biden-memory-transcript.html"
  },
  {
    "text": "News outlets that trumpeted Hur's story now discover “context” and “nuance” in transcript  —  Major news outlets that ran dozens of stories hyping then-special counsel Robert Hur's claim that President Joe Biden evinced a “poor memory” during their interview are now acknowledging that Hur's depiction … ",
    "url": "https://www.mediamatters.org/new-york-times/news-outlets-trumpeted-hurs-story-now-discover-context-and-nuance-transcript"
  },
  {
    "text": "Full transcript of Biden's special counsel interview paints nuanced portrait  —  The president doesn't seem as absent-minded as Hur has made him out to be — and Hur doesn't appear as crass as Biden has portrayed him  —  President Biden was in the early stages of his interview … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/12/biden-hur-transcript-classified-documents/"
  },
  {
    "text": "Special counsel Robert Hur stands by report on Biden's memory  —  The special counsel who impugned the president's age and competence in his report on how Joe Biden handled classified documents will himself be up for questioning this week.  —  Photos",
    "url": "https://apnews.com/article/classified-documents-biden-hur-special-counsel-122526da6d89d7bf4d6ccfc54590312b"
  },
  {
    "text": "Robert Hur will testify as private citizen with help from Trumpworld figures  —  EXCLUSIVE: Ex-Special Counsel arranged to leave Justice Department the day before his appearance with the House Judiciary Committee  —  Special Counsel Robert Hur to testify on Biden's handling of classified documents",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/robert-hur-trump-special-counsel-b2510944.html"
  },
  {
    "text": "Republican group planning $50M campaign to block Trump from reelection  —  An anti-Trump Republican group is planning to spend $50 million in a campaign to stop the former president from winning a second term to the White House.  —  Republican Voters Against Trump plans to share testimonial videos … ",
    "url": "https://thehill.com/homenews/state-watch/4526513-republican-group-planning-50m-campaign-to-block-trump-from-reelection/"
  },
  {
    "text": "Aileen Cannon Continues To Make A Mess Of The MAL Case  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  What Cannon Hath Wrought  —  Two developments yesterday that show what an absolute mess U.S. District Judge Aileen Cannon is making of the Mar-a-Lago case.",
    "url": "https://morningmemo.talkingpointsmemo.com/p/aileen-cannon-continues-to-make-a"
  },
  {
    "text": "There's new reason to think Trump still has classified documents  —  The central reason that Donald Trump was indicted for retaining documents marked as classified but President Biden was not is that Trump tried to retain the documents once the government sought their return.",
    "url": "https://www.washingtonpost.com/politics/2024/03/12/theres-new-reason-think-trump-still-has-classified-documents/"
  },
  {
    "text": "It Sure Seems Like the Courts Have Placed Christianity Above Other Faiths  —  “Religious freedom” is having a moment in federal courts.  One of the big successful goals of the conservative legal movement was that religious freedom would be advanced in a way that it supposedly had not been before.",
    "url": "https://slate.com/news-and-politics/2024/03/supreme-court-and-religion-judges-christianity.html"
  },
  {
    "text": "‘Absolute bloodbath’ at RNC as new leadership loyal to Trump purges staff  —  Chair Michael Whatley and co-chair Lara Trump move to reorganize the party, with an expected cull of 60 members  —  Donald Trump's new leadership team at the Republican National Committee started the process … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/11/new-rnc-leadership-trump-loyals-purge-staff"
  },
  {
    "text": "Boeing whistleblower found dead in US  —  Prior to his death, whistleblower John Barnett was testifying against Boeing over concerns about standards.",
    "url": "https://www.bbc.com/news/business-68534703"
  },
  {
    "text": "Trump asked Elon Musk if he wanted to buy Truth Social  —  The idea went nowhere, but the former president and the billionaire X owner have continued to communicate more than was previously known  —  Former president Donald Trump asked Elon Musk last summer whether the billionaire industrialist … ",
    "url": "https://www.washingtonpost.com/technology/2024/03/12/trump-musk-truth-social-sale/"
  },
  {
    "text": "Trump's newfound opposition to a TikTok ban isn't swaying Republicans  —  The House is moving forward with a Wednesday vote on legislation that would ban TikTok in the U.S. unless its China-based owner divests the popular app.  —  WASHINGTON — Former President Trump reversed course and now opposes a ban on social media giant TikTok.",
    "url": "https://www.nbcnews.com/politics/congress/trumps-newfound-opposition-tiktok-ban-isnt-swaying-republicans-rcna142796"
  },
  {
    "text": "Donald Trump Stung as New Poll Shows How Unpopular He Is  —  Donald Trump continues to have a low favorability score among Americans, new polling shows, despite being the likely Republican nominee after winning the lion's share of primaries and seeing off his only remaining rival.",
    "url": "https://www.newsweek.com/donald-trump-unpopular-polls-2024-election-1877870"
  },
  {
    "text": "Diplomatic source to ‘Post’: Gaza maritime route was Netanyahu's idea - exclusive  —  According to the source, on October 22, two weeks following the war's outbreak, Netanyahu discussed with President Biden the concept of “delivering humanitarian aid to Gaza via the sea”",
    "url": "https://www.jpost.com/international/article-791239"
  },
  {
    "text": "New data explodes myth of crime wave fueled by migrants  —  Republican politicians and sympathetic media outlets are claiming that America is in the midst of a violent “crime wave,” driven in part by undocumented immigrants.  New data, however, demonstrates that there was not a spike in violent crime in 2023.",
    "url": "https://popular.info/p/new-data-explodes-myth-of-crime-wave"
  },
  {
    "text": "‘The rats are ... all high,’ NOPD chief says of vermin-infested HQ, evidence room  —  Heavy mold and deteriorating elevators, HVAC units and plumbing are some of the issues that have been plaguing New Orleans Police Department headquarters.  —  But those aren't the only problems … ",
    "url": "https://www.nola.com/news/crime_police/the-rats-are--all-high-nopd-chief-says-of-vermin-infested-hq-evidence-warehouse-new-orleans/article_88bbef7c-dfc0-11ee-a110-dfcbe69db780.html"
  },
  {
    "text": "Republican women don't care about rape victims  —  Forget the theatrics of Katie Britt, Nancy Mace and Marjorie Taylor Greene — supporting Trump means backing abusers  —  It can be confusing, tracking the multiple lawsuits journalist E. Jean Carroll filed against Donald Trump … ",
    "url": "https://www.salon.com/2024/03/12/women-dont-care-about-rape-victims/"
  }
]