[
  {
    "text": "GOP Gov. DeWine defends Haitian immigrants: ‘They came to Springfield to work’  —  Ohio city has been subject of rumors and threats in the presidential race.  —  In this July 14, 2024, file photo, Ohio Governor Mike DeWine takes part in a sound check at the Fiserv Forum ahead … ",
    "url": "https://abcnews.go.com/Politics/gop-gov-dewine-defends-haitian-immigrants-springfield-work/story?id=113690058"
  },
  {
    "text": "Vance defends spreading claims that Haitian migrants are eating pets  —  Sen. JD Vance stood by his false claim that Haitian migrants were eating pets in Springfield, Ohio — an unsupported story that former President Donald Trump has also echoed on the debate stage and on social media.",
    "url": "https://www.npr.org/2024/09/15/nx-s1-5113140/vance-false-claims-haitian-migrants-pets"
  },
  {
    "text": "How Roberts Shaped Trump's Supreme Court Winning Streak  —  Behind the scenes, the chief justice molded three momentous Jan. 6 and election cases that helped determine the former president's fate.  —  Last February, Chief Justice John G. Roberts Jr. sent his eight Supreme Court colleagues … ",
    "url": "https://www.nytimes.com/2024/09/15/us/justice-roberts-trump-supreme-court.html?unlocked_article_code=1.K04.Hw-C.FVxaHPVlsDTE&smid=url-share"
  },
  {
    "text": "John Roberts' Secret Trump Memo Revealed in Huge SCOTUS Leak  —  BOMBSHELL  —  A memo obtained by The New York Times indicated the chief justice wanted to act quick—and decisively—on Donald Trump's presidential immunity.  —  The Supreme Court was hit by a flurry of damaging new leaks Sunday … ",
    "url": "https://www.thedailybeast.com/john-roberts-secret-trump-memo-revealed-in-huge-scotus-leak"
  },
  {
    "text": "Trump rushed to safety as Secret Service opens fire on man with AK-47 near golf course  —  Donald Trump was rushed to safety by the Secret Service after agents spotted a man with an AK-47 near his golf course and agents opened fire, law enforcement sources said.",
    "url": "https://nypost.com/2024/09/15/us-news/shooting-reported-at-donald-trumps-golf-club-while-ex-president-was-on-grounds/"
  },
  {
    "text": "Trump campaign says former president is safe following possible gunshots in his vicinity  —  The former president was on the golf course and was immediately rushed to safety on Sunday, his campaign said in a statement.  It is still unconfirmed if shots were fired.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-campaign-says-former-president-safe-possible-gunshots-vicinity-rcna171206"
  },
  {
    "text": "Trump Safe After Shooting Reported at His Golf Course  —  The Palm Beach County Sheriff's Office said there had been a shooting “on the grounds” of Mr. Trump's course there while the former president was at the club.  —  A shooting took place on the grounds of the Trump International Golf … ",
    "url": "https://www.nytimes.com/2024/09/15/us/politics/trump-shooting-golf-course.html"
  },
  {
    "text": "Trump's Iowa lead shrinks significantly as Kamala Harris replaces Biden, Iowa Poll shows  —  The nationally recognized Iowa Poll's first test of Kamala Harris' strength against Donald Trump indicates she's a more formidable opponent than President Biden in solid-red Iowa",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/2024/09/15/iowa-poll-donald-trump-iowa-lead-shrinks-as-kamala-harris-replaces-joe-biden/75180245007/"
  },
  {
    "text": "Harris seen as debate winner while maintaining slight lead over Trump: POLL  —  Taylor Swift's endorsement of Harris shows little impact, the poll found.  —  Vice President Kamala Harris and former President Donald Trump attend a presidential debate in Philadelphia, Sept. 10, 2024.",
    "url": "https://abcnews.go.com/Politics/harris-debate-winner-maintaining-slight-lead-trump-poll/story?id=113673862"
  },
  {
    "text": "Ronald Reagan's former staff back Harris-Walz ticket: “Today is a choice between integrity and demagoguery.”  —  Seventeen former staff members of the late Republican President Ronald Reagan are endorsing the Democratic nominee, Vice President Kamala Harris.",
    "url": "https://www.cbsnews.com/news/ronald-reagan-former-staff-back-harris-walz-ticket/"
  },
  {
    "text": "Vance backtracks on whether Trump would veto national abortion ban  —  “I've learned my lesson on speaking for the president before he and I have actually talked about an issue,” Vance said.  —  Republican vice presidential nominee JD Vance on Sunday dodged answering whether former President Donald Trump … ",
    "url": "https://www.politico.com/news/2024/09/15/vance-trump-abortion-ban-veto-00179224"
  },
  {
    "text": "Trump loses Electric Avenue song legal fight  —  Former US President Donald Trump has been found liable to pay damages to London singer and songwriter Eddy Grant for using his song Electric Avenue without permission.  —  It has taken Mr Grant, 76, more than four years to sue the Republican candidate … ",
    "url": "https://www.bbc.com/news/articles/c1488zz8jnzo"
  },
  {
    "text": "The first graders who survived Sandy Hook will vote in their first presidential election  —  It's a monumental moment that has given some survivors hope for change, nearly 12 years after 26 first graders and educators were killed in the shooting.  —  Grace Fischer survived the massacre … ",
    "url": "https://www.nbcnews.com/news/us-news/first-graders-survived-sandy-hook-will-vote-first-presidential-electio-rcna170471"
  },
  {
    "text": "Senate Republican candidates are trailing Donald Trump  —  The GOP appears on track to flip the Senate red, but many candidates struggling in battleground states  —  The Republican Party has largely refashioned itself in former president Donald Trump's image in the past five years … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/15/senate-election-trump-republicans/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2MzcyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI3NzU1MTk5LCJpYXQiOjE3MjYzNzI4MDAsImp0aSI6IjhlZWY4YTYzLWRmMjAtNGU4NS1hYTc3LTgxZWU5NWQ0ZDc2NSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzE1L3NlbmF0ZS1lbGVjdGlvbi10cnVtcC1yZXB1YmxpY2Fucy8ifQ.5RYhrWf-vvnihWa1m5caPcGzWgIrJ6aRNTotLp8QYLQ&itid=gfta"
  },
  {
    "text": "JD Vance Just Told Another Big Lie About Donald Trump's Record  —  He said Trump, who spent years to repeal the Affordable Care Act, was actually trying to “protect” it.  —  LOADING  —  Republicans have told many lies about health care over the years.  —  JD Vance on Sunday doubled down on their newest one.",
    "url": "https://www.huffpost.com/entry/donald-trump-jd-vance-repeal-affordable-care-act_n_66e70e6ae4b0d38f2df51317"
  }
]