[
  {
    "text": "Mike Pence does not rule out being witness for Trump's prosecution  —  Former Republican Vice President Mike Pence on Sunday did not rule out being a prosecution witness if his ex-boss Donald Trump goes to trial on charges of orchestrating a criminal conspiracy to try to reverse his defeat in the 2020 presidential election.",
    "url": "https://www.reuters.com/world/us/ex-vice-president-pence-does-not-rule-out-being-witness-trumps-prosecution-2023-08-06/"
  },
  {
    "text": "Judge denies Trump legal team's motion to extend deadline over protective order dispute in election subversion case  —  A federal judge on Saturday denied a request from former President Donald Trump's legal team for a deadline extension over the handling of evidence in the 2020 election subversion case.",
    "url": "https://www.cnn.com/2023/08/04/politics/trump-truth-social-smith-evidence-2020/"
  },
  {
    "text": "Country lacks a unifying voice in aftermath of Trump charges  —  No trusted figure has emerged to reassure the country in a shattering moment  —  In the hours after former president Donald Trump was indicted Tuesday, President Biden dined at a seafood restaurant, stopped by a movie theater … ",
    "url": "https://www.washingtonpost.com/nation/2023/08/05/us-lacks-unifying-figure/"
  },
  {
    "text": "Awkwardness in Trump's circle: Top aides could be trial witnesses  —  Some of Trump's closest advisers are referenced in charges against him, potentially putting them in a bind as cases advance  —  At least seven currently serving advisers to former president Donald Trump took actions … ",
    "url": "https://www.washingtonpost.com/national-security/2023/08/05/trump-trial-witnesses-2020-election-charges/"
  },
  {
    "text": "DeSantis Camp Hit by Gloom as Aides Worry Race Is Slipping Away  — Aides frustrated and disappointed by campaign's inner workings  — DeSantis continues resetting bid as Trump holds primary lead  —  Ron DeSantis promised a reset of his presidential campaign.  Many of his campaign staffers are still waiting.",
    "url": "https://www.bloomberg.com/news/articles/2023-08-06/desantis-camp-hit-by-gloom-as-aides-worry-race-is-slipping-away"
  },
  {
    "text": "Clarence Thomas's $267,230 R.V. and the Friend Who Financed It  —  The vehicle is a key part of the justice's just-folks persona.  It's also a luxury motor coach that was funded by someone else's money.  —  Justice Clarence Thomas met the recreational vehicle of his dreams in Phoenix, on a November Friday in 1999.",
    "url": "https://www.nytimes.com/2023/08/05/us/clarence-thomas-rv-anthony-welters.html"
  },
  {
    "text": "Republican Attacks on ‘Woke’ Ideology Falling Flat With G.O.P. Voters  —  New polling shows national Republicans and Iowa Republican caucusgoers were more interested in “law and order” than battling “woke” schools, media and corporations.  —  When it comes to the Republican primaries, attacks on “wokeness” may be losing their punch.",
    "url": "https://www.nytimes.com/2023/08/06/us/politics/woke-republicans-poll.html"
  },
  {
    "text": "John Eastman Comes Clean: Hell Yes We Were Trying to Overthrow the Government  —  THE BACKCHANNEL  —  I want to return to this revelatory interview with coconspirator John Eastman, the last portion of which was published Thursday by Tom Klingenstein, the Chairman of the Trumpite Claremont Institute … ",
    "url": "https://talkingpointsmemo.com/edblog/john-eastman-comes-clean-hell-yes-we-were-trying-to-overthrow-the-government"
  },
  {
    "text": "Robert F. Kennedy Jr.'s Campaign Anguishes His Storied Family  —  The presidential bid by Robert F. Kennedy Jr. has tested the bonds of an iconic Democratic clan that does not want him to run and does not know what to do about it.  —  Peter Baker is the chief White House correspondent and has covered the past five presidents.",
    "url": "https://www.nytimes.com/2023/08/06/us/politics/rfk-campaign-kennedy-family.html"
  },
  {
    "text": "Office of the Attorney General Files Appeal to Texas Supreme Court, Blocking District Judge's Ruling and Leaving Abortion Law in Place  —  The Office of the Attorney General (\"OAG\") filed a Notice of Accelerated Interlocutory Appeal directly to the Texas Supreme Court in Zurawski … ",
    "url": "https://www.texasattorneygeneral.gov/news/releases/office-attorney-general-files-appeal-texas-supreme-court-blocking-district-judges-ruling-and-leaving"
  },
  {
    "text": "Russia and China Sent Large Naval Patrol Near Alaska  —  Four U.S. destroyers were dispatched to monitor Russian and Chinese ships  —  A combined Russian and Chinese naval force patrolled near the coast of Alaska earlier this week in what U.S. experts said appeared to be the largest such flotilla to approach American shores.",
    "url": "https://www.wsj.com/articles/russia-and-china-sent-large-naval-patrol-near-alaska-127de28b?mod=djemalertNEWS"
  },
  {
    "text": "A dramatically close election in Kentucky gives clues for both parties  —  This year's bellwether election could tell us a lot.  —  A Democratic incumbent is running even with his Republican challenger.  He's trying to sell an optimistic economic message in the face of a slew of culture war attacks … ",
    "url": "https://www.politico.com/news/2023/08/05/what-kentucky-election-will-teach-for-2024-00109645"
  },
  {
    "text": "NASCAR suspends driver Noah Gragson for liking insensitive meme depicting face of George Floyd  —  NASCAR said Gragson violated the member conduct of its rule book, without providing details.  —  BROOKLYN, Mich. — Driver Noah Gragson has been suspended indefinitely by NASCAR and Legacy Motor Club due … ",
    "url": "https://www.nbcnews.com/news/sports/nascar-suspends-driver-noah-gragson-liking-insensitive-meme-depicting-rcna98355"
  },
  {
    "text": "What the Best Places in America Have in Common  —  What the data show about the country's poorest places  —  When president lyndon B. Johnson declared an “unconditional war on poverty” in 1964, the nation didn't have any method of counting the poor, or even a firm notion of how poverty should be defined.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/08/poverty-income-index-deep-disadvantage/674878/"
  }
]