[
  {
    "text": "CNN Poll: Trump leads in New Hampshire while Ramaswamy, Haley, Christie and DeSantis battle for second  —  Former President Donald Trump holds a sizable lead in the race for the 2024 Republican presidential nomination in New Hampshire, but a close contest for second place … ",
    "url": "https://www.cnn.com/2023/09/20/politics/cnn-poll-new-hampshire/"
  },
  {
    "text": "Ron DeSantis' descent continues, unabated by the debate and time on the trail  —  At the same time, the Florida governor is racing to raise money in Texas and California.  —  Ron DeSantis' long slide continues.  —  The Florida governor, once seen as the top rival to former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-descent-continues-unabated-debate-time-trail-rcna108101"
  },
  {
    "text": "Trump Leads, DeSantis Crashes in NH GOP Primary 9/20/2023  —  Former President Donald Trump continues to lead among likely 2024 Republican primary voters in New Hampshire, followed by entrepreneur Vivek Ramaswamy, former UN Ambassador Nikki Haley, former New Jersey Governor Chris Christie, and Florida Governor Ron DeSantis.",
    "url": "https://scholars.unh.edu/survey_center_polls/762/"
  },
  {
    "text": "It's Not a Race, Yet, in the Republican Primary  —  Donald Trump is polling about as well as any candidate in the modern history of contested presidential primaries.  —  Donald J. Trump's lead in the Republican primary just keeps growing.  —  He breached 60 percent of the vote in Fox News … ",
    "url": "https://www.nytimes.com/2023/09/21/upshot/polls-trump-republicans-primary.html"
  },
  {
    "text": "Centrist Dems and McCarthy's allies are in secret talks to strike a deal  —  Any Democratic participation in a plan to stop a shutdown — let alone save the speaker's gavel — would have huge conditions attached.  —  The long-shot idea that Democrats could bail out the beleaguered Speaker Kevin McCarthy is suddenly getting real.",
    "url": "https://www.politico.com/news/2023/09/20/bipartisan-mccarthy-bailout-talks-gaining-steam-thanks-to-house-chaos-00117179"
  },
  {
    "text": "Republicans can't pass bills for the same reason they support insurrection  —  The defense bill disaster shows that they can't even make deals with themselves. … Republican House Speaker Kevin McCarthy and the foaming clown car that is his caucus once again performed their expected rituals … ",
    "url": "https://www.publicnotice.co/p/house-republicans-mccarthy-defense-bill-disaster"
  },
  {
    "text": "Playbook: A breakthrough or a mirage?  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  WELCOME TO WASHINGTON, MR. ZELENSKYY — This morning, more than two dozen Hill Republicans — including six senators, led by Ohio's J.D. VANCE — are sending a letter … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/21/a-breakthrough-or-a-mirage-00117301"
  },
  {
    "text": "Texas Attorney General Ken Paxton suggests he might run against Sen. John Cornyn  —  Paxton last week was acquitted on 16 impeachment articles alleging corruption, abuse of public trust, misuse of public funds and other charges.  —  In the wake of his impeachment acquittal … ",
    "url": "https://www.nbcnews.com/politics/congress/texas-attorney-general-ken-paxton-suggests-might-run-sen-john-cornyn-rcna111302"
  },
  {
    "text": "Senate Poised to Confirm Military Chiefs, Sidestepping Tuberville Blockade  —  Three generals were on track for confirmation, but Senator Tommy Tuberville, the Alabama Republican who has been blocking them, said he would continue to hold up others over a Pentagon abortion policy.",
    "url": "https://www.nytimes.com/2023/09/20/us/politics/senate-military-nominations-tuberville.html"
  },
  {
    "text": "Massie suggests Garland is in contempt of Congress  —  Rep. Thomas Massie, R-Ky., suggested during his questioning of Garland that the attorney general is in contempt of Congress because Republicans aren't satisfied with his answers regarding the Hunter Biden investigation.",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/merrick-garland-testimony-trump-hunter-biden-live-updates-rcna105680/rcrd18834?canonicalCard=true"
  },
  {
    "text": "Book banners target public libraries  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  The campaign to censor America's libraries is expanding.  —  A new report from the American Library Association (ALA) finds that this year, between January 1 and August 31, there have been … ",
    "url": "https://popular.info/p/book-banners-target-public-libraries"
  },
  {
    "text": "Trump in Iowa Rally Warns GOP They Will Lose Elections Without Exceptions to Abortion Bans  —  Trump added that Republicans should learn how to ‘properly talk about abortion’  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/trump-in-iowa-rally-warns-gop-they-will-lose-elections-without-exceptions-to-abortion-bans"
  },
  {
    "text": "Free COVID test kits are coming back.  Here's how to get them.  —  The Biden administration is preparing to resume taking orders for free at-home COVID-19 tests starting September 25, officials announced Wednesday.  The administration is also planning a new infusion of money to boost domestic manufacturing of the test kits.",
    "url": "https://www.cbsnews.com/news/free-covid-tests-how-to-order-online/"
  },
  {
    "text": "‘We knew the numbers were bad’: Law enforcement staff raised concerns about Ron DeSantis' top crime talking point  —  Three former staffers in Florida's top law enforcement agency told NBC News they could not get behind the statement that state crime was at “a 50-year low.”",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-florida-law-enforcement-crime-50-percent-low-rcna105091"
  },
  {
    "text": "The US is allowing hundreds of thousands of Venezuelans in the country to work legally  —  The Biden administration says it's granting temporary legal status to hundreds of thousands of Venezuelans who are already in the country — quickly making them eligible to work … ",
    "url": "https://apnews.com/article/biden-immigration-border-migrant-venezuela-b914be14aaeef14eb01bd10ee23067f4"
  },
  {
    "text": "Former prosecutor who quit Trump-Russia probe says she left over concerns with Barr  —  Nora Dannehy had been part of the investigation led by John Durham.  —  HARTFORD, Conn. — A former federal prosecutor who helped investigate the origins of the Trump-Russia probe said Wednesday she left … ",
    "url": "https://www.politico.com/news/2023/09/20/former-prosecutor-resigned-trump-russia-probe-barr-00117255"
  },
  {
    "text": "Secretary Mayorkas Announces Extension and Redesignation of Venezuela for Temporary Protected Status  —  Redesignation Allows Additional Eligible Venezuelan Nationals in the U.S. to Apply for TPS and Employment Authorization Documents  —  WASHINGTON — Secretary of Homeland Security Alejandro … ",
    "url": "https://www.dhs.gov/news/2023/09/20/secretary-mayorkas-announces-extension-and-redesignation-venezuela-temporary"
  },
  {
    "text": "The Untold Story of One Indicted Fake Trump Elector in Georgia  —  Before she was indicted for taking part in Trump's scheme to stay in power, Cathy Latham professed to hating politics for being a dirty business.  Now she's knee-deep in the mud. … In the weeks before she became … ",
    "url": "https://www.thedailybeast.com/the-untold-story-of-one-indicted-fake-trump-elector-in-georgia"
  },
  {
    "text": "Kari Lake to launch Arizona Senate bid next month  —  The close ally of Trump is looking to run in the swing state again.  —  Arizona Republican Kari Lake will launch a Senate run as soon as early next month, according to three people familiar with her plans.",
    "url": "https://www.politico.com/news/2023/09/20/kari-lake-arizona-senate-bid-00117148"
  },
  {
    "text": "Poland Seeks to Mend Ukraine Rift With Arms Supplies U-Turn  — Warsaw will continue to send weapons under existing contracts  — Escalating spat between Poland and Ukraine has alarmed allies  —  The Polish government sought to walk back remarks by its premier that the country … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-21/poland-says-it-s-still-supplying-ukraine-with-weapons"
  }
]