[
  {
    "text": "The GOP Is Already Clashing Over Trump's VP Pick  —  While Trump tries to sew up the nomination, his camp is already feuding about his future running mate — and hoping it isn't Nikki Haley.  —  As the vice-presidential field continues to develop, many consider what a Nikki Haley vice presidency could mean for the GOP.",
    "url": "https://www.politico.com/news/magazine/2024/01/18/maga-nightmare-trump-loyalists-move-to-head-off-haley-vp-pick-00136282"
  },
  {
    "text": "Days before New Hampshire primary, most Republicans would be satisfied with Trump as 2024 nominee: POLL  —  He also has a wide lead over DeSantis and Haley on a range of attributes.  —  Republican presidential candidate former President Donald Trump speaks at a campaign event in Atkinson, N.H., on Jan. 16, 2024.",
    "url": "https://abcnews.go.com/Politics/days-new-hampshire-primary-republicans-satisfied-trump-2024/story?id=106448570"
  },
  {
    "text": "'She's a killer': Trump eyes Rep. Elise Stefanik as a potential VP pick  —  The former president has spoken highly of the New York Republican congresswoman, and his allies say she's high on the list of vice presidential prospects.  —  WASHINGTON — During a candlelit dinner with Mar … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-elise-stefanik-vp-pick-prospect-rcna133599"
  },
  {
    "text": "Texas refuses to comply with Biden administration's cease-and-desist letter on border access  —  The Department of Homeland Security had directed the state to stop blocking the U.S. Border Patrol's access to roughly 2½ miles of the U.S.-Mexico border.",
    "url": "https://www.nbcnews.com/politics/immigration/texas-refuses-comply-biden-administrations-cease-desist-letter-border-rcna134423"
  },
  {
    "text": "Texas defies federal threat to abandon border area, setting up legal showdown  —  The attorney general of Texas on Wednesday defied federal officials who demanded state authorities abandon a public park along the U.S.-Mexico border that state National Guard soldiers seized last week … ",
    "url": "https://www.cbsnews.com/news/texas-border-us-mexico-ken-paxton-attorney-general/"
  },
  {
    "text": "Texas' floating barrier between US and Mexico can stay for now, court rules in reversal  —  A federal appeals court on Wednesday reversed an order requiring Texas to move a floating barrier on the Rio Grande that drew backlash from Mexico — the latest development in legal battles between … ",
    "url": "https://www.kgns.tv/2024/01/17/texas-floating-barrier-between-us-mexico-can-stay-now-court-rules-reversal/"
  },
  {
    "text": "Senate Republicans warn House they won't get a better immigration deal under Trump  —  “To those who think that if President Trump wins, which I hope he does, that we can get a better deal — you won't,” Sen. Lindsey Graham, R-S.C., told reporters on Wednesday.",
    "url": "https://www.nbcnews.com/politics/congress/senate-republicans-warn-house-wont-get-better-immigration-deal-trump-rcna134348"
  },
  {
    "text": "The Supreme Court Is About to Seize Way More Power From Democratic Presidents  —  This is part of Opening Arguments, Slate's coverage of the start of the latest Supreme Court term.  We're working to change the way the media covers the Supreme Court.  Support our work when you join Slate Plus.",
    "url": "https://slate.com/news-and-politics/2024/01/supreme-court-democrats-president-chevron-precedent.html"
  },
  {
    "text": "State Board of Education Passes Rule to Permanently Prohibit DEI in the Florida College System  —  ~ State Board also replaced “Principles of Sociology” with an American History course as an option on the list of social studies general education core courses ~",
    "url": "https://www.fldoe.org/newsroom/latest-news/state-board-of-education-passes-rule-to-permanently-prohibit-dei-in-the-florida-college-system.stml"
  },
  {
    "text": "Trump warns campaigns: Do not hire ex-DeSantis operative Jeff Roe  —  The admonition is another example of the former president's penchant for punishing people perceived as disloyal.  —  Former President Donald Trump and people in his inner circle have told down-ballot Republican candidates … ",
    "url": "https://www.politico.com/news/2024/01/18/trump-jeff-roe-republican-strategist-00136240"
  },
  {
    "text": "Ecuadorian prosecutor probing TV studio attack is killed  —  The Ecuadorian prosecutor who was investigating an attack at a television station in Guayaquil, the country's largest and one of its most dangerous cities, was shot to death Wednesday.  Prosecutor César Suárez … ",
    "url": "https://www.nbcnews.com/news/latino/ecuadorian-prosecutor-probing-tv-studio-attack-killed-rcna134411"
  },
  {
    "text": "Loose bolts open door to racism  —  On January 9th, a Boeing 737 Max 9 aircraft operated by Alaska Airlines was forced to make an emergency landing after a door panel flew off mid-air.  No deaths were reported, but multiple passengers required medical attention, officials said.",
    "url": "https://popular.info/p/loose-bolts-open-door-to-racism"
  },
  {
    "text": "Biden-Harris campaign to unveil new effort to push abortion rights advocacy ahead of Roe anniversary  —  President Biden's reelection campaign is preparing to highlight abortion rights in the lead-up to the anniversary of the Supreme Court's landmark Roe v. Wade decision, CBS News has learned … ",
    "url": "https://www.cbsnews.com/news/biden-harris-campaign-abortion-rights-advocacy-roe-anniversary/"
  },
  {
    "text": "John Fetterman Endorses Andy Kim in High-Stakes New Jersey Senate Primary  —  The Pennsylvania senator, the first among his colleagues to weigh in on the primary battle to oust the indicted Senator Robert Menendez, said he had concerns about Tammy Murphy's G.O.P. history.",
    "url": "https://www.nytimes.com/2024/01/18/us/politics/john-fetterman-andy-kim-new-jersey-senate.html"
  },
  {
    "text": "Florida “Proud Boy” Sentenced to Prison for Assaulting Law Enforcement and Other Charges During Jan. 6 Capitol Breach  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  Defendant Assaulted Multiple Police Officers  —  WASHINGTON - A Florida man and member … ",
    "url": "https://www.justice.gov/usao-dc/pr/florida-proud-boy-sentenced-prison-assaulting-law-enforcement-and-other-charges-during"
  },
  {
    "text": "Harris says ‘no denying’ America's history of racism  —  Vice President Harris said clearly that the U.S. has racism in its history, bucking remarks to the contrary from GOP presidential candidates Nikki Haley and Florida Gov. Ron DeSantis.  —  “There is no denying that we have … ",
    "url": "https://thehill.com/homenews/campaign/4414630-harris-no-denying-americas-history-racism/"
  },
  {
    "text": "‘Survivor’ Champ Kentucky Pol Whose Incest Bill Would Let Cousins Have Sex: ‘I Made a Mistake’ (Exclusive)  —  ‘I was thinking like a lawyer, not like a legislator,’ state Rep. Nick Wilson tells The Messenger  —  A Kentucky Republican introduced a bill on Tuesday that was intended to broaden … ",
    "url": "https://themessenger.com/news/incest-kentucky-cousins-lawmaker-bill-decriminalize-sex-nick-wilson-mistake-republican"
  }
]