[
  {
    "text": "Democrats laugh off Greene's plan to force Johnson ouster vote … - “She is about to realize her inevitable irrelevance,” one senior House Democrat told Axios just minutes after Greene made her announcement.  — Another senior House Democrat cast Greene's motion as “drama that hurts Republicans.”",
    "url": "https://www.axios.com/2024/05/01/democrats-greene-vote-mike-johnson-ouster"
  },
  {
    "text": "McConnell says he's ready for ‘chaos’ in House to end  —  Senate Republican Leader Mitch McConnell (Ky.) on Wednesday said he's ready for the “chaos” that has plagued the House for much of 2023 and 2024 to end next week, when a bipartisan group of lawmakers is expected to vote to quash a motion … ",
    "url": "https://thehill.com/homenews/4636847-mcconnell-house-chaos-johnson/"
  },
  {
    "text": "Arizona's Democratic leaders get enough votes to repeal 19th century abortion ban  —  Democrats secured enough votes in the Arizona Senate on Wednesday to repeal a Civil War-era ban on abortions that the state's highest court recently allowed to take effect.",
    "url": "https://apnews.com/article/arizona-abortion-1864-ban-repeal-24578e546b69ca087e01034bcaf4aa01"
  },
  {
    "text": "Dueling protesters clash at UCLA hours after police clear pro-Palestinian demonstration at Columbia  —  Officers have taken protesters into custody after Columbia University called in police to end the pro-Palestinian occupation on the New York campus.  The scene unfolded shortly … ",
    "url": "https://apnews.com/article/israel-palestinian-campus-student-protests-war-c6e5549532c85f13493daa22d0d143ac"
  },
  {
    "text": "Trump tries to paint college campus anti-Israel protests as a Biden political liability  —  Biden aides have said they think the protests will blow over.  —  WASHINGTON — Joe Biden's advisers believe that tensions over U.S. support for Israel in the war in Gaza spreading through college campuses … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-tries-paint-college-campus-anti-israel-protests-biden-political-rcna150253"
  },
  {
    "text": "Trump backs surveillance and prosecution of women to enforce abortion bans  —  As part of an extensive interview with Time Magazine, former President Donald Trump expanded on what abortion access would look like in the United States in a potential second term.",
    "url": "https://popular.info/p/trump-backs-surveillance-and-prosecution"
  },
  {
    "text": "PRESIDENT TRUMP JOINS CONVENTION LINEUP  —  Join us for a historic moment at the 2024 Libertarian National Convention as we welcome former President Donald J. Trump to the podium.  This momentous occasion will mark the first time a former President directly addresses our members, candidates, and executive committee.",
    "url": "https://lnc2024.com/president-donald-trump-at-the-libertarian-national-convention/"
  },
  {
    "text": "Trump Is Now Raging at His Own Lawyer—and Wrecking a Big MAGA Fantasy  —  Because Donald Trump must always be seen as wielding absolute mastery over his hapless, flailing opponents, he and his propagandists want you to believe his hush-money trial in Manhattan has proven nothing but a smashing political success for him.",
    "url": "https://newrepublic.com/article/181138/trump-raging-lawyer-todd-blanche-maga-fantasy"
  },
  {
    "text": "A Huge Gender Gap Is Emerging Among Young Voters  —  It has become clear that one constituency — young voters, 18 to 29 years old — will play a key, if not pivotal, role in determining who will win the Biden-Trump rematch.  —  Four years ago, according to exit polls, voters in this age group kept Trump from winning re-election.",
    "url": "https://www.nytimes.com/2024/05/01/opinion/biden-younger-voters-gender.html"
  },
  {
    "text": "Trump confirms he wanted to go to Capitol on Jan. 6  —  Former President Trump on Wednesday confirmed he told Secret Service agents he wanted to go to the Capitol on Jan. 6, 2021, while he mocked the claim that he lunged at officers in his vehicle when they refused.",
    "url": "https://thehill.com/homenews/campaign/4636879-trump-confirms-he-wanted-to-go-to-capitol-on-jan-6/"
  },
  {
    "text": "Democrat Crushes GOP Rival in New York Congressional Special Election  —  BLOWOUT  —  The slim Republican majority in the House just got slimmer.  —  Democratic state Sen. Timothy Kennedy on Tuesday won the special election for the New York congressional seat vacated by a retiring Democrat … ",
    "url": "https://www.thedailybeast.com/democrat-timothy-kennedy-crushes-gop-rival-in-new-york-congressional-special-election"
  },
  {
    "text": "Exclusive: DOJ civil rights leader says she was a victim of abuse in extraordinary statement  —  The leader of the Justice Department's civil rights division, Kristen Clarke, said in an extraordinary personal statement shared with CNN that she was a victim of years-long domestic abuse and chose … ",
    "url": "https://www.cnn.com/2024/05/01/politics/kristen-clarke-justice-department-domestic-violence/"
  },
  {
    "text": "The Ozempic Effect: How a Weight Loss Wonder Drug Gobbled Up an Entire Economy  —  The blockbuster drug producer is Europe's most valuable company — and its home country is feeling the effects  —  There is no escaping Ozempic and Wegovy.  The diabetes and obesity drugs are a global phenomenon.",
    "url": "https://www.bloomberg.com/news/features/2024-04-30/denmark-and-novo-nordisk-ozempic-maker-s-success-makes-huge-impact"
  },
  {
    "text": "Giuliani's Bankruptcy Creditors Demand to Know His Spending  —  The former New York mayor and Trump lawyer actually spent nearly $120,000 in January, and his creditors say he is still not turning over required financial information.  —  Besieged by creditors and with his income drying up … ",
    "url": "https://www.nytimes.com/2024/05/01/us/politics/bankruptcy-giuliani-spending.html"
  },
  {
    "text": "House GOP Passes Bills That Attack Environmental Protections, Benefit Oil And Mining Companies  —  The bills will give GOP industry allies something to tout heading into the 2024 elections.  —  LOADING  —  Never missing an opportunity to make life easier for extractive industries … ",
    "url": "https://www.huffpost.com/entry/house-republicans-pass-bills-attack-environmental-protections_n_66329b33e4b0fc2b95281927"
  },
  {
    "text": "RFK Jr. is all over conservative media.  Trump's camp is concerned.  —  The independent presidential candidate is quickly becoming a thorn in Donald Trump's side.  —  Robert F. Kennedy Jr.'s increasingly frequent appearances on conservative media platforms are beginning to raise alarms at Mar-a-Lago.",
    "url": "https://www.politico.com/news/2024/05/01/rfk-jr-trump-2024-elections-00155425"
  },
  {
    "text": "Trump's sit-downs with foreign officials are ‘annoying’ some in Biden's camp  —  It's not unusual for a presidential nominee to meet with foreign officials, but Trump's meetings have, at times, had the trappings of a state visit.  —  WASHINGTON — As Donald Trump rolled out the red carpet … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-foreign-officials-annoying-biden-rcna148904"
  },
  {
    "text": "‘A step back in time’: America's Catholic Church sees an immense shift toward the old ways  —  It was the music that changed first.  Or maybe that's just when many people at the pale brick Catholic church in the quiet Wisconsin neighborhood finally began to realize what was happening.",
    "url": "https://apnews.com/article/catholic-church-shift-orthodoxy-tradition-7638fa2013a593f8cb07483ffc8ed487"
  },
  {
    "text": "Biden must remember the reason Jordan, Egypt, and the rest of the Middle East don't accept Palestinian refugees  —  .  —  In the first half of this fiscal year alone, the United States has admitted 42,000 Chinese nationals, 14,000 Russian nationals, 8,000 Turkish nationals, and 43,000 Indian nationals who crossed our southern border.",
    "url": "https://www.washingtonexaminer.com/opinion/2986510/biden-jordan-egypt-middle-east-palestinian-refugees/"
  },
  {
    "text": "Trump campaign lawyers' bid to withdraw from discrimination case gets closed-door hearing … Presidential candidate Donald Trump gestures in a press conference unveiling his comprehensive tax reform plan at Trump Tower.  —  A federal judge in New York scheduled a closed-door meeting Wednesday afternoon … ",
    "url": "https://www.cnbc.com/2024/05/01/trump-campaign-lawyers-seek-to-quit-discrimination-case.html"
  },
  {
    "text": "United Methodists repeal longstanding ban on LGBTQ clergy  —  United Methodist delegates repealed their church's longstanding ban on LGBTQ clergy with no debate on Wednesday, removing a rule forbidding “self-avowed practicing homosexuals” from being ordained or appointed as ministers.",
    "url": "https://apnews.com/article/united-methodist-lgbtq-clergy-general-conference-acabe18fe22b6838e3005ad8895534fa"
  },
  {
    "text": "Israel tells U.S. it will punish Palestinian Authority if ICC issues warrants … - That investigation has been extended to the Oct. 7 attacks and the war that has been raging in Gaza since then, according to the prosecutor's office. … - U.S. and Israeli officials said Israel told … ",
    "url": "https://www.axios.com/2024/05/01/us-israel-palestinian-authority-icc-arrest-warrant"
  }
]