[
  {
    "text": "Playbook: Jim Jordan's day of reckoning  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  STILL TAKING APPLICATIONS — “How House Speaker Became Washington's Most Miserable Job,” by Ian Ward: “'You basically have a tied House with no operational majority,' said [political scientist MATTHEW] GREEN.",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/17/jim-jordans-day-of-reckoning-00121910"
  },
  {
    "text": "Jim Jordan's day of reckoning  —  Good morning, Early Birds.  We appreciate that Rep. Derek Kilmer (D-Wash.) has apologized for making puns on Twitter (sorry, X) but fear he might not be entirely sincere.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/10/17/jim-jordans-day-reckoning/"
  },
  {
    "text": "10/17/23 ☀️ Punchbowl News AM  —  Jim Jordan has problems.  —  The Ohio Republican plans to head to the floor today for a speaker election with more than a dozen GOP lawmakers saying they'll vote against him or are undecided about his candidacy.",
    "url": "https://punchbowl.news/archive/101723-punchbowl-news-am/"
  },
  {
    "text": "The Apotheosis of Jim Jordan Is a Sight to Behold  —  No problem in the American system at this moment is as acute and disruptive as the one posed by the Republican Party.  —  Yes, of course, there are any number of structural problems facing American politics.",
    "url": "https://www.nytimes.com/2023/10/17/opinion/jim-jordan-house-speaker.html"
  },
  {
    "text": "‘Everything Is Just Stuck.’ No Matter What Happens to Jim Jordan, the Next Speaker Is In For a World of Trouble.  —  An expert on House speakers explains how changes in campaign finance, media, and the type of people who get elected created the current debacle.",
    "url": "https://www.politico.com/news/magazine/2023/10/17/matthew-green-interview-jim-jordan-00121803"
  },
  {
    "text": "House Democratic Lawmaker Floats George W. Bush For Speaker Of The House  —  On Forbes Newsroom, California Democratic Congressman Brad Sherman floated the idea of former President George W. Bush becoming the next Speaker of the House.  —  “He could come back,” Sherman said.",
    "url": "https://www.forbes.com/sites/brittanylewis/2023/10/16/house-democratic-lawmaker-floats-george-w-bush-for-speaker-of-the-house/"
  },
  {
    "text": "Democrats craft strategy to make GOP pay at the ballot box if Jim Jordan is elected speaker  —  A memo first shared with NBC News advises Democrats about how to cast Republicans as beholden to Donald Trump and “extremism” should Jordan become speaker.  —  WASHINGTON — Democrats … ",
    "url": "https://www.nbcnews.com/politics/congress/democrats-craft-strategy-make-gop-pay-jim-jordan-speaker-rcna120720"
  },
  {
    "text": "Jordan builds Speakership momentum as opposition falls  —  Opposition to House GOP Speaker nominee Rep. Jim Jordan (Ohio) is crumbling as Republicans return to Washington for a House vote to try to officially elect him.  —  Four key lawmakers who signaled opposition to Jordan last week fell … ",
    "url": "https://thehill.com/homenews/house/4258693-jordan-speakership-momentum-opposition-falls/"
  },
  {
    "text": "Jordan works to assuage fundraising fears in his quest for speakership  —  As Ohio Rep. Jim Jordan inches closer to securing the speaker's gavel, he has been working to allay concerns from the more establishment wing of the GOP about how his speakership could hinder their ability … ",
    "url": "https://www.cnn.com/2023/10/16/politics/jim-jordan-fundraising-concerns/"
  },
  {
    "text": "Judge imposes gag order on Donald Trump in D.C. trial  —  Judge Tanya Chutkan said Trump's “presidential candidacy does not give him carte blanche to vilify ... public servants who are simply doing their job.”  —  A federal judge has barred Donald Trump from attacking witnesses … ",
    "url": "https://www.politico.com/news/2023/10/16/judge-imposes-gag-order-on-donald-trump-in-d-c-trial-00121743"
  },
  {
    "text": "President Joe Biden will visit Israel in high-stakes trip  —  US President Joe Biden will visit Israel on Wednesday, US Secretary of State Antony Blinken announced in the early hours of Tuesday from Tel Aviv.  —  Biden had been deliberating whether to make a wartime visit to Israel … ",
    "url": "https://www.cnn.com/2023/10/16/politics/joe-biden-israel-visit/"
  },
  {
    "text": "21 species removed from endangered list due to extinction, U.S. wildlife officials say  —  Nearly two dozen species are being taken off the endangered species list because they are extinct, the U.S. Fish and Wildlife Service said Monday.  —  Most of the species were listed under … ",
    "url": "https://www.cbsnews.com/news/21-species-removed-from-endangered-list-due-to-extinction-us-wildlife-officials-say/"
  },
  {
    "text": "America's zombie “crime wave”  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  The outset of the pandemic in 2020 coincided with a surge in violent crime in the United States, with murder rates rising particularly dramatically.  According to a lot of people with large megaphones, this crime wave continues today.",
    "url": "https://popular.info/p/americas-zombie-crime-wave"
  },
  {
    "text": "Race isn't real, science says.  Advocates want the census to reflect that.  —  A small but vocal group of professionals and academics imagine a future where categories don't matter  —  The notice from the federal government arrived in Carlos Hoyt's inbox last August.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/10/16/census-race-eliminate-race-box/"
  },
  {
    "text": "Exclusive: Senior US general flies into Israel as its war with Hamas deepens  —  The top U.S. general overseeing American forces in the Middle East made an unannounced trip to Israel on Tuesday, saying he hoped to ensure its military has what it needs as it fights a deepening war against Palestinian militant group Hamas.",
    "url": "https://www.reuters.com/world/senior-us-general-flies-into-israel-its-war-with-hamas-deepens-2023-10-17/"
  },
  {
    "text": "Biden gives fewer press interviews.  But he woos more influencers.  —  The White House says its media strategy reflects American habits.  Critics say the president is minimizing tough questions.  —  TikToker Daniel Mac has attracted more than 14 million followers in two years by asking drivers … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/17/biden-media-strategy-online-influencers/"
  },
  {
    "text": "Families Separated at Border by Trump Reach Settlement  —  Thousands of migrants subjected to the policy will be allowed to live and work in the U.S., at least temporarily.  If they win asylum, they could become citizens.  —  Lawyers representing thousands of families separated … ",
    "url": "https://www.nytimes.com/2023/10/16/us/migrants-border-families-trump-settlement.html"
  },
  {
    "text": "Biden campaign to launch account on Trump's Truth Social  —  'There's very little ‘truth’ happening on Truth Social, but at least now it'll be a little fun,' Biden campaign tells Fox News Digital  —  EXCLUSIVE: The Biden campaign is launching an account on former President Trump's Truth Social, Fox News Digital has learned.",
    "url": "https://www.foxnews.com/politics/biden-campaign-launch-account-trumps-truth-social"
  }
]