[
  {
    "text": "After a Blowout Week, Wall Street Decision Makers Brace for More Chaos  —  The financial titans who backed Trump are now dealing with the fallout from his tariffs.  They spent the weekend surveying the damage of last week's major sell-off.  —  There was little rest on Wall Street this weekend.",
    "url": "https://www.nytimes.com/2025/04/06/business/stock-market-plunge-investment-bank-impact.html?unlocked_article_code=1.9k4.thee.Qx6AABTI3Kyw"
  },
  {
    "text": "Dow futures fall 1,500 points Sunday as Trump tariff market rout escalates: Live updates  —  U.S. stock futures dropped on Sunday evening as the White House remained defiant even after a two-day historic stock market rout that followed President Donald Trump's rollout of shockingly high tariff rates on most key U.S. trading partners.",
    "url": "https://www.cnbc.com/2025/04/06/stock-market-today-live-updates.html"
  },
  {
    "text": "Trump to America as Markets Crash: ‘Sometimes You Have to Take Medicine’  —  The president said Sunday he is not deliberately tanking the markets, as U.S. market futures dropped again following his tariff announcement  —  Donald Trump said Sunday he is not deliberately tanking the stock market … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-tariffs-market-crash-take-medicine-america-1235311613/"
  },
  {
    "text": "Bill Ackman warns Trump to call a timeout on trade war: ‘This is not what we voted for’  —  Billionaire hedge fund investor Bill Ackman, who endorsed President Trump last year, is offering a stark warning about the risks of the White House's tariff plans, arguing they could cause the economy … ",
    "url": "https://thehill.com/homenews/administration/5235232-ackman-warning-trump-tariffs/"
  },
  {
    "text": "U.S. Stock Futures, Nikkei Plunge as Tariff Turmoil Deepens  —  Oil prices and Treasury yields also fell as President Trump stood firm on imposing tariffs that investors fear will clobber the global economy  —  More pain appears to be in store for markets after their worst week to start a quarter since 2008.",
    "url": "https://www.wsj.com/livecoverage/stock-market-trump-tariffs-trade-war-04-07-25"
  },
  {
    "text": "Trump says he's not backing down on tariffs, calls them ‘medicine’ as markets reel  —  President Donald Trump said Sunday that he won't back down on his sweeping tariffs on imports from most of the world unless countries even out their trade with the U.S., digging in on his plans to implement … ",
    "url": "https://apnews.com/article/trump-tariffs-recession-financial-markets-negotiations-retaliation-860760cdc1aa2cc58853c9aab987e36d"
  },
  {
    "text": "Stocks in Asia Fall Sharply, Extending a Rout Caused by Trump's Tariffs  —  Futures on the S&P 500, which allow investors to trade the index before regular trading begins on Monday, added to last week's sell-off.  —  Financial markets were hit hard by another wave of selling at the start … ",
    "url": "https://www.nytimes.com/2025/04/06/business/stocks-trump-tariffs.html"
  },
  {
    "text": "Trump, Unbowed, Is Enacting Change on Scale Rarely Seen Before  —  Financial markets, universities, law firms and world leaders are reeling from the president's agenda, but White House officials say this was always the plan  —  WASHINGTON—And it's only been 77 days.",
    "url": "https://www.wsj.com/politics/policy/trump-unbowed-is-enacting-change-on-scale-rarely-seen-before-a582db3a"
  },
  {
    "text": "World markets plunge, with Japan's Nikkei diving nearly 8%, after the big meltdown on Wall St  —  Shares nosedived around the world Monday as higher U.S. tariffs and a backlash from Beijing triggered massive sell-offs.  European shares followed Asian markets lower, with Germany's DAX falling 6.5% to 19,311.29.",
    "url": "https://apnews.com/article/stocks-markets-nikkei-tariffs-trump-76d0de278a6cad291ace624a74a6a1b6"
  },
  {
    "text": "Trump administration deports gay makeup artist to prison in El Salvador  —  Andry Hernandez Romero, a gay makeup artist who came to the United States last year in search of asylum, is one of 238 Venezuelan migrants who were flown from the U.S. to a maximum security prison in El Salvador three weeks ago.",
    "url": "https://www.cbsnews.com/news/venezuelan-migrants-deportations-el-salvador-prison-60-minutes/"
  },
  {
    "text": "U.S. sent 238 migrants to Salvadoran mega-prison; documents indicate most have no apparent criminal records  —  Three weeks ago, 238 Venezuelan migrants were flown from Texas to a maximum security prison in El Salvador.  —  That country's president offered to take them and the Trump administration used … ",
    "url": "https://www.cbsnews.com/news/what-records-show-about-migrants-sent-to-salvadoran-prison-60-minutes-transcript/"
  },
  {
    "text": "NIH scientists have a cancer breakthrough.  Layoffs are delaying it.  —  A big step forward in cancer therapy has been slowed by layoffs and new restrictions at the National Institutes of Health, where it was developed.",
    "url": "https://www.washingtonpost.com/science/2025/04/06/nih-firings-cancer-immunotherapy-treatment/"
  },
  {
    "text": "Kennedy announces support for measles vaccine amid outbreak  —  The statement is a surprising turn for the health secretary and comes amid reports of a second child's death.  —  Health Secretary Robert F. Kennedy Jr., who spent years promoting debunked theories and sowing doubts about the safety … ",
    "url": "https://www.politico.com/news/2025/04/06/kennedy-support-measles-vaccine-outbreak-00276021"
  },
  {
    "text": "Sen. Mullin suggests ‘fake news’ would decline if violence could ‘still’ settle disputes  —  Journalists would write fewer “fake news” stories if disputes over coverage could be handled through violence, U.S. Sen. Markwayne Mullin suggested on social media.  —  In a video posted over the weekend … ",
    "url": "https://eu.oklahoman.com/story/news/2025/04/06/markwayne-mullin-fake-news-remarks-us-senator-capitol/82963694007/"
  },
  {
    "text": "Treasury Sec. Bessent says 'there doesn't have to be a recession': Full interview  —  Treasury Sec. Scott Bessent exclusively joins Meet the Press days after President Donald Trump unveiled expansive tariffs on the United States' largest trading partners.",
    "url": "https://www.nbcnews.com/meet-the-press/video/treasury-sec-bessent-says-there-doesn-t-have-to-be-a-recession-full-interview-236654149913"
  },
  {
    "text": "Trump Will Get His Showy (And Likely Expensive) Military Parade in D.C.  —  President Donald Trump for years has lusted after a big military parade over which he could preside—just like he sees leaders do in other mostly authoritative countries.  —  During his first term in 2018 … ",
    "url": "https://washingtoncitypaper.com/article/761814/trump-parade-military-dc/"
  },
  {
    "text": "Johnson and Trump scramble to show agenda progress amid tariff tumult  —  The president helped the speaker solve one snag over the weekend.  Muscling a budget through the House will be a much taller order.  —  Speaker Mike Johnson and President Donald Trump were already facing pressure … ",
    "url": "https://www.politico.com/news/2025/04/06/johnson-trump-agenda-progress-tariffs-00276029"
  }
]