[
  {
    "text": "Trump's allies fear he'll blow the debate — his best chance to regain ground against Harris  —  The challenge is getting the former president to stick to the script.  —  Tuesday's debate may be former President Donald Trump's best chance to regain his footing in the presidential race.",
    "url": "https://www.politico.com/news/2024/09/07/trump-allies-debate-fears-00177809"
  },
  {
    "text": "Why Kamala Isn't Preparing to Knock Out Trump at the Debate  —  To her campaign, something else is more important.  —  It's the stuff of #Resistance dreams: Kamala Harris, the prosecutor, gets onstage in Philadelphia next Tuesday across from Donald Trump, the felon, and proceeds to brutally expose … ",
    "url": "https://nymag.com/intelligencer/article/abc-debate-kamala-harris-strategy-donald-trump.html"
  },
  {
    "text": "Hillary Clinton Debated Trump.  Here's Her Advice for Kamala Harris.  —  The 2016 Democratic nominee fell short to Donald Trump, but she had strong debate moments against him.  In an interview, she offered some thoughts for Kamala Harris.  —  Hillary Clinton has as much experience as any Democrat in debating Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/09/07/us/politics/hillary-clinton-debate-trump-harris.html"
  },
  {
    "text": "Never-Before-Seen Details About Matt Gaetz's Alleged Sex Scandal May Soon Be Public — Thanks to a Friend  —  One of Matt Gaetz's friends sued a number of people in the alleged sex scandal, generating a number of juicy depositions.  Now those depositions could become public.  — Copy",
    "url": "https://www.notus.org/congress/never-before-seen-details-about-matt-gaetzs-alleged-sex-scandal-may-soon-be-public-thanks-to-a-friend"
  },
  {
    "text": "Trump's incomprehensible child care comments appear to have broken a dam  —  In a “30 Rock” episode called “Governor Dunston,” the writing staff of the fictional sketch comedy show is confronted with a conundrum: The newly tapped Republican vice presidential candidate looks exactly … ",
    "url": "https://www.sfchronicle.com/politics/article/donald-trump-childcare-comments-19747778.php"
  },
  {
    "text": "Trump's rambling answer to a child care question, deconstructed  —  A version of this story appeared in CNN's What Matters newsletter.  To get it in your inbox, sign up for free here.  —  CNN  —  Former President Donald Trump and his running mate JD Vance were both asked essentially … ",
    "url": "https://www.cnn.com/2024/09/06/politics/child-care-trump-what-matters"
  },
  {
    "text": "One of the things that came to light on Wednesday, in the paperwork the Justice Department unveiled to explain its seizure of 32 internet domains being used by Russian agents in foreign malign influence campaigns, was that the six right-wing U.S. influencers mentioned in the indictments … ",
    "url": "https://heathercoxrichardson.substack.com/p/september-6-2024"
  },
  {
    "text": "DNC flies banners about Trump-Vance ticket, “Project 2025” over battleground state football games  —  Spectators at the University of Michigan football game against Texas on Saturday were reminded of a different rival before the game: Ohio State.  —  At the Big House in Ann Arbor, Michigan … ",
    "url": "https://www.cbsnews.com/news/dnc-banners-trump-vance-ticket-project-2025-over-battleground-state-football-games/"
  },
  {
    "text": "Elon Musk is intrigued by the idea women can't think freely because of ‘low T’  —  Every time it seems he can't possibly sink any lower, the billionaire CEO grabs a shovel and starts digging  —  Maybe he's born with it, maybe it's ketamine  —  Every time I think Elon Musk can't possibly sink any lower … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/sep/07/elon-musk-women-testosterone"
  },
  {
    "text": "Trump, Trailing Among Women, Lashes Out at His Female Accusers  —  Mr. Trump's news conference had little to do with the issues in the 2024 presidential race, and seemed like more of a venting exercise over his frustrations about his legal travails.  —  If any voters had forgotten … ",
    "url": "https://www.nytimes.com/2024/09/06/us/politics/trump-news-conference-allegations.html?unlocked_article_code=1.I04.2KQ0.65nH_0itRDFi&smid=url-share"
  },
  {
    "text": "Stunning News of Trump Sentencing Delay Sends Message: MAGA Rage Works  —  MAGA bullying pays off.  —  That's what we may have just learned, now that the judge in Donald Trump's hush-money case in Manhattan announced Friday that he will delay Trump's sentencing until well after the presidential election.",
    "url": "https://newrepublic.com/article/185707/trump-sentencing-delay-maga-rage-works"
  },
  {
    "text": "Trump Claims Harris's Rallies Are Smaller.  We Counted.  —  Kalina Borkiewicz, Malika Khurana, Karthik Patanjali and Bedel Saget  —  The sizable support Vice President Kamala Harris has generated at her rallies has rattled former President Donald J. Trump, who has emphasized, and frequently exaggerated, his crowd sizes for years.",
    "url": "https://www.nytimes.com/interactive/2024/09/07/us/politics/harris-trump-rally-crowds-size.html"
  },
  {
    "text": "Heritage Foundation Spreads Deceptive Videos About Noncitizen Voters  —  The right-wing think tank has been pushing misinformation about voting into social media feeds.  The Georgia secretary of state's office called one video “a stunt.”  —  In July, two men went door to door … ",
    "url": "https://www.nytimes.com/2024/09/07/us/politics/heritage-foundation-2024-campaign-immigration.html?unlocked_article_code=1.I04.2-fB.WZKCR06mN41E&smid=url-share"
  },
  {
    "text": "Former President George W. Bush has no plans to endorse in the election  —  “President Bush retired from presidential politics years ago,” his office said in a statement to NBC News.  —  Former President George W. Bush does not plan to endorse a candidate for president, his office told NBC News on Saturday.",
    "url": "https://www.nbcnews.com/politics/2024-election/former-president-george-w-bush-no-plans-endorse-2024-election-rcna170055"
  },
  {
    "text": "The unprecedented grand coalition  —  As Nicolle Wallace exclaimed on her show Friday, Liz Cheney and Dick Cheney, Alexandria Ocasio-Cortez and Bernie Sanders have all gathered together around a cause.  That cause is democracy and its standard bearer is Kamala Harris.",
    "url": "https://buzzmachine.com/2024/09/06/the-unprecedented-grand-coalition/"
  }
]