[
  {
    "text": "The Elon Musk / Donald Trump interview on X started with an immediate tech disaster … Elon Musk's “conversation” with former President Donald Trump got off to a rocky start.  The interview, which was hosted on X Spaces and scheduled to begin at 8PM ET on Monday night, crashed immediately and didn't begin until 42 minutes later.",
    "url": "https://www.theverge.com/2024/8/12/24219121/donald-trump-elon-musk-interview-x-twitter-crashes"
  },
  {
    "text": "Trump's interview with Musk devolves into yet another X catastrophe  —  It started after about 45 minutes.  —  Elon Musk guaranteed entertainment.  He delivered technical difficulties instead.  —  Musk planned to host GOP nominee Donald Trump for an interview “Live on X,” formerly Twitter Spaces … ",
    "url": "https://www.politico.com/news/2024/08/12/trump-musk-x-interview-problems-00173739"
  },
  {
    "text": "The Trump Campaign's ‘Please Shut Up’ Phase  —  That was a crazy public service provided by Elon Musk and X.  —  The X Spaces interview delivered Donald Trump without makeup or dress-up, talking unselfconsciously: manic, boastful, untruthful, aggrieved, abusive, obsessive, random, ignorant … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/trump-campaign-musk-interview/679451/"
  },
  {
    "text": "Suspected Iranian hackers breached Roger Stone's personal email as part of effort to target Trump campaign, sources say  —  The FBI and other investigators probing the apparent hack-and-leak of Trump campaign documents, which Donald Trump has blamed on Iran, suspect that the hackers were able … ",
    "url": "https://www.cnn.com/2024/08/12/politics/trump-campaign-hack-personal-email-account-fbi/"
  },
  {
    "text": "News outlets were leaked insider material from the Trump campaign.  They chose not to print it  —  At least three news outlets were leaked confidential material from inside the Donald Trump campaign, including its report vetting JD Vance as a vice presidential candidate.",
    "url": "https://apnews.com/article/trump-vance-leak-media-wikileaks-e30bdccbdd4abc9506735408cdc9bf7b"
  },
  {
    "text": "Trump Email Hack Is A Moment Of Reckoning For Him—Or The News Media  —  Outlets like the New York Times owe their readers frenzied coverage of his campaign's emails, or a mea culpa for their history-altering emails fixation in 2016  —  You might say Politico won the weekend with a metascoop.",
    "url": "https://www.offmessage.net/p/trump-email-hack-is-a-moment-of-reckoning"
  },
  {
    "text": "Judge rules against RFK Jr. in fight to be on New York's ballot, says he is not a state resident  —  A judge ruled Monday that independent presidential candidate Robert F. Kennedy Jr.'s name should not appear on New York's ballot, saying that he falsely claimed a New York residence on nominating petitions despite living in California.",
    "url": "https://apnews.com/article/kennedy-rfk-jr-ballot-new-york-residency-faaf0c8d7638cdfcdbe3c4eb7b542eef"
  },
  {
    "text": "Latest Harris-Trump poll highlights danger for former president in Florida  —  The red wave that washed over Florida in recent years might not be as large as it once seemed, if a new presidential survey is any indication.  —  Vice President Kamala Harris is within “striking distance” … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/13/kamala-harris-trump-florida-polls/74770114007/"
  },
  {
    "text": "Progressives jostle for nat sec jobs under Harris  —  The liberal activists plan to offer Harris lists of names to consider, but their last such effort with Biden yielded little success.  —  Progressive national security professionals already are angling for positions in a possible Kamala … ",
    "url": "https://www.politico.com/news/2024/08/13/progressives-harris-foreign-policy-jobs-00173697"
  },
  {
    "text": "Workers allege ‘nightmare’ conditions at Kentucky startup JD Vance helped fund  —  As a venture capitalist, JD Vance repeatedly touted his guiding principles for investing in a company: A business should not only turn a profit, it should also help American communities.",
    "url": "https://www.cnn.com/2024/08/13/politics/kentucky-startup-appharvest-jd-vance/"
  },
  {
    "text": "The New York Times Will Stop Endorsing Candidates in New York Races  —  The paper's editorial board will continue to endorse presidential candidates, as it has for more than 160 years.  —  The New York Times editorial board will no longer make endorsements in New York elections … ",
    "url": "https://www.nytimes.com/2024/08/12/business/media/the-new-york-times-editorial-board-political-endorsements.html"
  },
  {
    "text": "Sasse's spending spree: Former UF president channeled millions to GOP allies, secretive contracts  —  The former UF president tripled his office's spending compared to predecessor  —  In his 17-month stint as UF president, Ben Sasse more than tripled his office's spending … ",
    "url": "https://www.alligator.org/article/2024/08/sasse-s-spending-spree-former-uf-president-channeled-millions-to-gop-allies-secretive-contracts"
  },
  {
    "text": "Tina Peters guilty: Former Mesa County clerk convicted on 7 charges  —  Twelve Mesa County jurors found Tina Peters guilty of four felonies on Monday after a lengthy criminal trial, marking yet another conviction tied to post-2020 election conspiracy theories.",
    "url": "https://www.cpr.org/2024/08/12/tina-peters-trial-verdict/"
  },
  {
    "text": "How hotels are colluding to jack up room rates, according to two lawsuits  —  If you traveled this summer, the rate you paid at hotels may have been artificially inflated.  According to two lawsuits, numerous hotel operators are participating in an illegal scheme to increase their prices.",
    "url": "https://popular.info/p/how-hotels-are-colluding-to-jack"
  },
  {
    "text": "Progressives face an existential threat from AIPAC.  And there's nothing to stop it.  —  AIPAC and other pro-Israel groups spent a combined $25 million on ads to defeat Reps. Jamaal Bowman and Cori Bush this summer.  Liberals worry they're just getting started.",
    "url": "https://www.politico.com/news/2024/08/13/progressives-aipac-elections-threat-00173709"
  },
  {
    "text": "Big Oil is lobbying aggressively against climate action  —  Fossil fuel companies and their industry associations lobbied the federal government an average of five times per working day in 2023, according to a new analysis from Environmental Defence.  —  The environmental watchdog tracked 31 companies … ",
    "url": "https://www.nationalobserver.com/2024/08/12/news/big-oil-lobbying-feds-2023"
  },
  {
    "text": "Broadcast news and major papers failed to cover report of possible Egyptian bribery involving Trump  —  NBC, ABC, CBS, as well as the LA Times, USA Today, and Wall Street Journal, all ignored the reporting … According to an August 2 report in The Washington Post, the U.S. Department … ",
    "url": "https://www.mediamatters.org/donald-trump/broadcast-news-and-major-papers-failed-cover-report-possible-egyptian-bribery"
  },
  {
    "text": "Democrats flip social media ‘censorship’ complaints on Musk, GOP  —  The Washington Post's essential guide to tech policy news  —  Happy Tuesday!  The Olympics may be over, but jokes about its breakdancing competition may be with us for good.  Send breaking news tips to cristiano.lima@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2024/08/13/democrats-flip-social-media-censorship-complaints-musk-gop/"
  },
  {
    "text": "Arizona certifies abortion-rights initiative for the November ballot  —  Arizona's secretary of state's office announced that the 24-week limit will go up for a vote in the battleground state later this year.  —  PHOENIX — Arizona's ballot will include a major reproductive rights measure … ",
    "url": "https://www.nbcnews.com/politics/2024-election/arizona-certifies-abortion-rights-initiative-november-ballot-rcna166321"
  },
  {
    "text": "Trump Is Looking Like a Loser Again  —  About one third of his remarks at last week's press conference were false, obtuse or lunatic.  —  We need to talk about Donald.  —  We can complain all we like, as I have, that the coronation of Kamala Harris by deceitful Democrats and a complaisant media … ",
    "url": "https://www.wsj.com/opinion/trump-is-looking-like-a-loser-again-mar-a-lago-news-conference-2024-election-02ec5c8f"
  }
]