[
  {
    "text": "The Republican Plot Against Donald Trump  —  The Republican Plot Against Donald Trump  —  The inside story of how Congress is pursuing endless war in Ukraine—and trying to stop a Trump election.  —  This weekend, Senate Democrats (joined by a few Republicans, including most Republican leadership) … ",
    "url": "https://www.theamericanconservative.com/how-congress-is-pursuing-endless-war-in-ukraine-and-trying-to-stop-a-trump-election/"
  },
  {
    "text": "‘Wow!’  Morning Joe Crew Stunned By Montage of Trump Repeated Gaffes from Weekend Rallies  —  Joe Scarborough and Mika Brzezinski were equally stunned by a montage of confusing gaffes by former President Donald Trump over a weekend of political rallies, each exclaiming “wow!” coming out of the montage aired on Monday's Morning Joe.",
    "url": "https://www.mediaite.com/tv/wow-morning-joe-crew-stunned-by-montage-of-trump-repeated-gaffes-from-weekend-rallies/"
  },
  {
    "text": "Trump Faces Supreme Court Deadline on Claim of Absolute Immunity  —  A federal appeals court gave the former president until Monday to ask the justices to pause its ruling while he pursues an appeal.  —  Former President Donald J. Trump is expected to file a last-ditch effort on Monday … ",
    "url": "https://www.nytimes.com/2024/02/12/us/politics/supreme-court-trump-immunity.html"
  },
  {
    "text": "Rubio dismisses concerns about Trump's NATO remarks as backlash mounts  —  GOP Sen. Marco Rubio defended former President Donald Trump's controversial comment that he would encourage Russia to do “whatever the hell they want” to a NATO member country that didn't meet defense spending guidelines.",
    "url": "https://www.cnn.com/2024/02/11/politics/rubio-trump-nato-haley-husband-national-guard-cnntv/"
  },
  {
    "text": "Media creates Biden “fitness” crisis  —  Robert Hur, the Republican special prosecutor assigned to investigate President Biden, is a lawyer, not a doctor.  On Thursday, Hur issued a lengthy report that came to the legal conclusion that charges against Biden for mishandling classified materials were not warranted.",
    "url": "https://popular.info/p/manufacturing-a-political-crisis"
  },
  {
    "text": "Jack Smith's Subtle Shot at Trump Mar-a-Lago Judge Aileen Cannon  —  Federal prosecutors working on the Donald Trump Mar-a-Lago documents case are trying to convince Judge Aileen Cannon by pointing to cases she worked on at the DOJ.  —  Faced with a federal judge in the Donald Trump Mar … ",
    "url": "https://www.thedailybeast.com/jack-smiths-subtle-shot-at-trump-mar-a-lago-judge-aileen-cannon"
  },
  {
    "text": "Unprecedented assignment: Defending Donald Trump in criminal court  —  With four criminal indictments and multiple civil cases, the former president has built the equivalent of a boutique law firm  —  In the past six weeks alone, Donald Trump's lawyers argued in the Supreme Court over whether … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/12/trump-lawyers-indictments-trials/"
  },
  {
    "text": "Donald Trump and Tucker Carlson gave Putin exactly want he wants  —  It is no coincidence that Trump made his biggest threat against NATO right after Tucker Carlson sat with Putin  —  As we all know, the biggest story in the world is the breaking news that President Joe Biden is old.",
    "url": "https://www.salon.com/2024/02/12/donald-and-tucker-carlson-gave-putin-exactly-want-he-wants/"
  },
  {
    "text": "Call and Response: Putin Demanded Greater Russia and Trump Agreed  —  Over the weekend, Putin and Donald Trump seem to have come to public agreement that, if elected in November, Trump would help Putin pursue Greater Russia.  —  In his session with Tucker Carlson, after all … ",
    "url": "https://www.emptywheel.net/2024/02/12/call-and-response-putin-is-demanding-greater-russia/"
  },
  {
    "text": "‘The voice we woke up to’: Bob Edwards, longtime ‘Morning Edition’ host, dies at 76  —  Bob Edwards, the veteran broadcaster and longtime host of Morning Edition who left an indelible mark on NPR's sound, has died.  He was 76 years old.  —  NPR's Susan Stamberg says Edwards' voice became part … ",
    "url": "https://www.npr.org/2024/02/12/165681524/bob-edwards-dead-npr-host"
  },
  {
    "text": "Former RNC Chair Comes Up With Damning New Way To Describe Trump Supporters  —  Michael Steele asked why some voters don't just get what the former president is about.  —  LOADING  —  Michael Steele, a former chair of the Republican National Committee, on Sunday, ripped Donald Trump supporters as … ",
    "url": "https://www.huffpost.com/entry/michael-steele-donald-trump-supporters_n_65ca0c52e4b067c6b73da848"
  },
  {
    "text": "“lol hey guys”: Biden campaign joins TikTok to reach young voters  —  President Biden's re-election campaign officially launched its TikTok account on Sunday with a Super Bowl-themed video. … - By Monday morning, the video had 3.9 million views.  — “In a media ecosystem that is more fragmented … ",
    "url": "https://www.axios.com/2024/02/12/biden-campaign-tiktok-account-first-video"
  },
  {
    "text": "Exclusive: How Biden botched the border  —  Aboard Air Force One en route to tour the southern border in January 2023, President Biden sat at the head of his conference table and exploded with fury.  — The president lit into his team, which included then-Deputy Chief of Staff Jen O'Malley Dillon … ",
    "url": "https://www.axios.com/2024/02/12/how-biden-botched-border"
  },
  {
    "text": "Statement From Walter Reed Military Medical Center Officials on Secretary of Defense Lloyd J. Austin III's Health Status  —  Dr. John Maddox, Trauma Medical Director, and Dr. Gregory Chesnut, Center for Prostate Disease Research of the Murtha Cancer Center Director, at Walter Reed National … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3673065/statement-from-walter-reed-military-medical-center-officials-on-secretary-of-de/"
  },
  {
    "text": "The Tech Plutocrats Dreaming of a Right-Wing San Francisco  —  On a Friday night in late January, the leader of a famed San Francisco venture capital firm got drunk and launched into a profanity-laced tirade on social media.  Garry Tan, the Y Combinator CEO currently spearheading … ",
    "url": "https://newrepublic.com/article/178675/garry-tan-tech-san-francisco"
  }
]