[
  {
    "text": "Transition Live Updates: House Approves Stopgap Funding Bill Hours Ahead of Shutdown Deadline  —  The new legislation would keep the government open but did not include the debt ceiling increase that President-elect Donald J. Trump had demanded.  It now goes to the Senate.  —  Here are the latest developments.",
    "url": "https://www.nytimes.com/live/2024/12/20/us/government-shutdown-trump-news"
  },
  {
    "text": "House Republicans just exposed the limits of Trump's power  —  Support independent journalism that matters — become a Vox Member today.  —  This week's installment of the long-running saga, “House Republicans cannot govern,” will soon be forgotten.  Elon Musk's decision to blow … ",
    "url": "https://www.vox.com/politics/392278/government-shutdown-fight-spending-bill-trump-musk-house-republicans"
  },
  {
    "text": "House passes bill to avert government shutdown after whirlwind funding fight  —  The House approved legislation to avert a government shutdown hours before the deadline Friday, sending the bill to the Senate for consideration after a whirlwind week on Capitol Hill.",
    "url": "https://thehill.com/homenews/house/5051634-government-funding-shutdown-house-bill/"
  },
  {
    "text": "House GOP picks new funding plan that will need wide Democratic support  —  House Republicans have landed on their fourth plan to fund the government: Relying on Democrats to pass a bill that doesn't include a debt limit measure pushed by Donald Trump.  House Republicans voted … ",
    "url": "https://www.politico.com/live-updates/2024/12/20/congress/house-gop-moves-forward-on-new-funding-plan-00195660"
  },
  {
    "text": "House passes 11th-hour bill to avert government shutdown … - The vote was 366-34.  — The measure also includes a one-year Farm Bill extension and over $100 billion in disaster relief for hurricane-ravaged areas. … - The House failed to pass a bill Thursday that would have also included … ",
    "url": "https://www.axios.com/2024/12/20/house-passes-government-shutdown"
  },
  {
    "text": "Musk Shows Trump That He's the New Chaos in Town  —  If you haven't seen the details, the meltdown on Capitol Hill went from bad to worse this evening.  Or awesome to awesomer, depending on your perspective.  Let's review.  Donald Trump wanted a smooth ride to January 20th.",
    "url": "https://talkingpointsmemo.com/edblog/musk-shows-trump-that-hes-the-new-chaos-in-town"
  },
  {
    "text": "Mike Johnson's magic debt ceiling promise … - Don't ask about Plan C: It lived a short, unhappy life, mostly confined to X.  — Johnson's Plan D survived because Republicans pretended the debt ceiling was in the agreement and Democrats know that it's not.",
    "url": "https://www.axios.com/2024/12/20/mike-johnson-debt-ceiling-promise-trump"
  },
  {
    "text": "House sets up vote to prevent government shutdown, dropping Trump's demand for debt limit  —  Hours to go before a midnight government shutdown, the House approved a new plan late Friday from Speaker Mike Johnson that would temporarily fund federal operations and disaster aid … ",
    "url": "https://apnews.com/article/trump-government-shutdown-deadline-speaker-johnson-budget-da117337aa0c0adab34a5626bb5816af"
  },
  {
    "text": "8 policies stripped from GOP bill after Trump, Musk rebellion  —  Research for children's health, a crackdown on junk fees, pay hikes for lawmakers and more were jettisoned from the legislation.  —  The House of Representatives approved legislation Friday to keep the government funded … ",
    "url": "https://www.washingtonpost.com/business/2024/12/20/musk-trump-children-health-debt/"
  },
  {
    "text": "Backlash builds as Elon Musk endorses Germany's far right  —  Elon Musk is backing the far-right Alternative for Germany (AfD), triggering an outcry in Berlin in the run-up to a critical snap election.  —  “Only the AfD can save Germany,” the billionaire X owner wrote on the platform on Friday … ",
    "url": "https://www.politico.eu/article/elon-musk-endorses-germanys-far-right/"
  },
  {
    "text": "Senate confirms Biden's 235th judge, beating Trump's record  —  It's an important milestone for Joe Biden as he tops his predecessor Donald Trump's total number of judicial nominees confirmed before handing the White House back over to him.  —  WASHINGTON — The Democratic-led Senate confirmed … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/senate-confirms-bidens-235th-judge-beating-trumps-record-rcna182832"
  },
  {
    "text": "Senate approves 235th judge of Biden's term, beating Trump's tally  —  President Joe Biden secured the 235th judicial confirmation of his presidency Friday, an accomplishment that exceeds his predecessor's total by one after Democrats put extra emphasis on the federal courts following Donald … ",
    "url": "https://apnews.com/article/biden-235-judges-trump-courts-db2ac97d2852f0be212c05b8e674b1c0"
  },
  {
    "text": "White House starts scrapping pending regulations on transgender athletes and student debt  —  President Joe Biden is abandoning his efforts to provide some protections for transgender student athletes and cancel student loans for more than 38 million Americans, the first steps … ",
    "url": "https://apnews.com/article/student-loan-forgiveness-debt-cancellation-619a94aa46c4e356f6d6cf7c6fa13e32"
  },
  {
    "text": "Party City is going out of business  —  New York CNN  —  Party City is closing down all of its stores, ending nearly 40 years in business, CNN has learned.  —  CEO Barry Litwin told corporate employees Friday in a meeting viewed by CNN that Party City is “winding down” … ",
    "url": "https://www.cnn.com/2024/12/20/business/party-city-shut-down"
  },
  {
    "text": "2 dead, many injured after man drives into German Christmas market in suspected terror attack: report  —  A festive Christmas market in Eastern Germany erupted into chaos after a car was driven into a group of people in the city of Magdeburg on Friday in a suspected terrorist attack.",
    "url": "https://www.foxnews.com/world/car-drives-idyllic-germany-christmas-market-suspected-terrorist-attack-report"
  },
  {
    "text": "Trump Moves to Replace Officials Whom New Presidents Traditionally Leave Alone  —  Congress devised some positions to stay on during changes in administrations.  But Donald Trump has declared his intent to replace at least three.  —  President-elect Donald J. Trump has moved to install loyalists … ",
    "url": "https://www.nytimes.com/2024/12/20/us/politics/trump-replace-officials.html?unlocked_article_code=1.i04.Xqz6.wQmpGmGOt-qI"
  },
  {
    "text": "‘It Will Be a More Robust Check on Trump Than the G.O.P. Congress’: Three Legal Experts on Trump 2.0  —  Kate Shaw, a contributing Opinion writer, hosted a written online conversation with Times Opinion columnist David French and Jack Goldsmith, a law professor at Harvard and a co-author of … ",
    "url": "https://www.nytimes.com/2024/12/20/opinion/trump-supreme-court-second-term.html"
  },
  {
    "text": "Trumpism's healthcare fracture-lines (permalink)  —  There was never any question as to whether Trump would implement Project 2025, the 900-page brick of terrifying and unhinged policy prescriptions edited by the Heritage Foundation.  He would not implement it, because he could not implement it.",
    "url": "https://pluralistic.net/2024/12/20/clinical-trial-by-ordeal/#spoiled-his-brand-new-rattle"
  },
  {
    "text": "Biden Weighs Commuting Sentences of Death Row Inmates  —  Amid pleas from religious and civil-rights groups, president is considering whether to convert death sentences to life without parole  —  WASHINGTON—President Biden is considering commuting the sentences of most, if not all … ",
    "url": "https://www.wsj.com/us-news/law/biden-weighs-commuting-sentences-of-death-row-inmates-d24fcc15?st=8q8Jmn"
  },
  {
    "text": "Louisiana forbids public health workers from promoting COVID, flu and mpox shots  —  A group of high-level managers at the Louisiana Department of Health walked into a Nov. 14 meeting in Baton Rouge expecting to talk about outreach and community events.  —  Instead, they were told … ",
    "url": "https://www.npr.org/sections/shots-health-news/2024/12/20/nx-s1-5223440/louisiana-ban-public-health-promoting-covid-flu-mpox-vaccines-landry-rfk-jr-anti-vaccine"
  },
  {
    "text": "Newest GOP funding bill includes health extenders, but not PMB reform: Guthrie  —  The latest government funding proposal being assembled by GOP leaders likely will include some must-pass short-term extensions of health policies, even as the legislation drops much of the bipartisan health package negotiated earlier this week.",
    "url": "https://thehill.com/policy/healthcare/5051463-gop-health-funding-proposal/"
  },
  {
    "text": "Major Trump donors who complained of immigrant ‘invasion’ used Mexican workers illegally, sources allege  —  Exclusive: Experts believe the alleged ‘shuttle support’ program used by Uline - a company owned by billionaires Liz and Dick Uihlein - is likely illegal and exploitative of workers",
    "url": "https://www.theguardian.com/us-news/2024/dec/20/uline-mexican-workers-trump"
  }
]