[
  {
    "text": "Iowa Poll: Kamala Harris leapfrogs Donald Trump to take lead near Election Day.  Here's how  —  The nationally recognized Iowa Poll shows Kamala Harris picking up support from women to surpass Donald Trump in a ruby-red state he has won twice … Kamala Harris now leads Donald Trump in Iowa … ",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/2024/11/02/iowa-poll-kamala-harris-leads-donald-trump-2024-presidential-race/75354033007/"
  },
  {
    "text": "British ‘mega poll’ leans toward Harris victory  —  Election pollsters may be ‘herding’ and giving the impression Trump is stronger than he really is, Focaldata research suggests.  —  The British are a-coming.  This time, they're wielding a new polling technique with a huge survey sample … ",
    "url": "https://www.politico.com/news/2024/11/03/swing-state-mrp-mega-poll-00186941"
  },
  {
    "text": "Final NBC News poll: Harris-Trump race is neck and neck, with significant gender gap  —  Abortion and rising Democratic enthusiasm boost Harris, while the economy and the cost of living lift Trump ahead of an uncertain election.  —  The final national NBC News poll of the 2024 presidential campaign finds … ",
    "url": "https://www.nbcnews.com/politics/2024-election/final-nbc-news-poll-harris-trump-race-neck-neck-significant-gender-gap-rcna178361"
  },
  {
    "text": "Some Surprises in Last Battleground Polls, but Still a Deadlock  —  A rise for Kamala Harris in the Sun Belt, and a dip in the Northern swing states.  —  Kamala Harris and Donald J. Trump stayed deadlocked to the finish in the final New York Times/Siena College polls of the 2024 presidential election … ",
    "url": "https://www.nytimes.com/2024/11/03/upshot/polls-harris-trump-battlegrounds.html?unlocked_article_code=1.XE4.1qmh.hNVT64YEm95p&smid=url-share"
  },
  {
    "text": "Harris and Trump Battle to the Wire in Swing States, Times/Siena Polls Find  —  Donald J. Trump has improved his standing in Pennsylvania even as late-deciding voters appear to be breaking for Kamala Harris.  —  The presidential race appears to be hurtling toward a photo finish … ",
    "url": "https://www.nytimes.com/2024/11/03/us/politics/harris-trump-times-siena-poll.html?unlocked_article_code=1.XE4.a3Fq.Aa23IX7kAZtp&smid=url-share"
  },
  {
    "text": "In a bathroom stall, a simple message: Vote Harris.  No one will know.  —  In the final days of the presidential race, what started as a whisper campaign has become the subject of a controversial 30-second ad, been amplified by Michelle Obama and drawn furious backlash from the right.",
    "url": "https://www.washingtonpost.com/politics/2024/11/03/harris-wife-trump-husband-ad/"
  },
  {
    "text": "Trump Tells Supporters He 'Shouldn't Have Left' the White House  —  Donald J. Trump, who sought to overturn his loss of the 2020 election, also joked that he didn't mind if reporters were shot.  —  Former President Donald J. Trump told supporters on Sunday that he “shouldn't have left” … ",
    "url": "https://www.nytimes.com/2024/11/03/us/politics/trump-pa-rally-election.html"
  },
  {
    "text": "Trump Thinks America Wants His Perversions  —  MEASLES, MISINFORMATION, a “vigorous spanking” of misogyny—whether women like it or not—a violent nine-gun fantasy for political enemies, crudeness, petty insults, and cronyism.  —  Pick your perversion, America.",
    "url": "https://www.thebulwark.com/p/donald-trump-thinks-america-wants-his-perversions-election-2024"
  },
  {
    "text": "Stefanik on gender voting gap: 'Trump's campaign has strong, intelligent women'  —  House Republican Conference Chair Elise Stefanik (N.Y.) touted former President Trump's support among women despite the apparent gender gap in polls against his Democratic rival, Vice President Harris.",
    "url": "https://thehill.com/homenews/house/4968367-stefanik-gender-voting-gap-trump-campaign/"
  },
  {
    "text": "Trump and Harris crisscross campaign trail days out from Election Day  —  Americans have two days left to pick their new leader in a neck-and-neck presidential election likely decided by tens of thousands of votes in a handful of swing states.  —  Former President Donald Trump started Sunday campaigning … ",
    "url": "https://www.npr.org/2024/11/03/g-s1-31905/trump-harris-campaign"
  },
  {
    "text": "FCC commissioner claims Harris on ‘SNL’ violates ‘equal time’ rule  —  A Federal Communications Commission (FCC) commissioner has claimed that Vice President Harris's recent appearance on “Saturday Night Live” violates the “equal time” rule.  —  “This is a clear and blatant effort to evade … ",
    "url": "https://thehill.com/homenews/4968217-fcc-commissioner-claims-harris-on-snl-violates-equal-time-rule/"
  },
  {
    "text": "Canvassers for Elon Musk's America PAC Were Fired and Stranded in Michigan After Speaking Out  —  A dozen Black canvassers were tricked, threatened, and driven in seatless U-Haul vans.  They were fired after WIRED reported on their plight—some without full pay or a way back home.",
    "url": "https://www.wired.com/story/canvassers-elon-musk-america-pac-fired-stranded-michigan-mistreatment/"
  },
  {
    "text": "Megyn Kelly presses Sheehy on bullet wound story: “So confusing” … - Sheehy, a former Navy SEAL, claims he was shot while deployed in Afghanistan. … Sheehy said: “There isn't.”  — “There's not an extensive medical record for any of this stuff,” Sheehy said.",
    "url": "https://www.axios.com/2024/11/02/megyn-kelly-sheehy-bullet-wound-story-confusing"
  },
  {
    "text": "Epstein Claimed: Trump Liked to F**k His Friends' Wives  —  In recordings taken by author Michael Wolff, Epstein claimed Trump first slept with Melania on his Lolita Express and enjoyed cuckholding.  —  'Don't Do This Again': Harrison Ford Endorses Kamala Harris  —  'WE'LL MOVE FORWARD'",
    "url": "https://www.thedailybeast.com/epstein-claimed-trump-liked-to-fk-his-friends-wives/"
  },
  {
    "text": "Apology Not Accepted  —  I woke up yesterday morning to learn that Don Trump—the famed rapist, convicted felon, and white christian presidential candidate—had mimed performing a blowjob on his microphone stand to the clear delight of his crowd.  —  There's a famous Christian thinker named Jesus H. Christ … ",
    "url": "https://www.the-reframe.com/apology-not-accepted/"
  },
  {
    "text": "RFK Jr. says a Trump White House would immediately push to remove fluoride from water  —  Major health groups support water fluoridation as a public health benefit and emphasize that the practice is safe.  —  WASHINGTON — Robert F. Kennedy Jr. said Saturday that a Trump administration would … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-trump-white-house-remove-fluoride-water-rcna178543"
  },
  {
    "text": "Final Senate rankings: 5 seats most likely to flip  —  Two days remain until Election Day, and Republicans are aiming to take control of the Senate and expand their majority.  —  Democrats hold a 51-49 advantage, which Republicans have already sliced into with their pending victory in West Virginia.",
    "url": "https://thehill.com/homenews/state-watch/4966663-2024-senate-races-top-flip-targets/"
  },
  {
    "text": "Listen To The Jeffrey Epstein Tapes: 'I Was Donald Trump's Closest Friend'  —  THE PREDATOR AND THE PRESIDENT  —  Explosive tapes recorded by author Michael Wolff show Epstein claiming Trump liked to “f—” his friends' wives and first slept with Melania on the Lolita Express.  —  EXCLUSIVE",
    "url": "https://www.thedailybeast.com/listen-to-the-jeffrey-epstein-tapes-i-was-donald-trumps-closest-friend/"
  },
  {
    "text": "Four big things the winners of Congress will have to tackle in 2025  —  Voters are about to elect a new Congress.  It will have a full plate next year, from expiring tax cuts and health care funding to averting a debt default and government shutdown.  —  WASHINGTON — As voters head … ",
    "url": "https://www.nbcnews.com/politics/congress/four-big-things-winners-congress-will-tackle-2025-rcna178320"
  },
  {
    "text": "Who will replace Mitch McConnell as Senate GOP leader?  It remains deeply uncertain  —  Senate Republicans vying to replace longtime leader Mitch McConnell have been crossing the country to campaign and fundraise for colleagues, making their final arguments before a consequential ballot the week after the presidential election.",
    "url": "https://apnews.com/article/senate-republicans-leadership-mcconnell-thune-cornyn-scott-d17b341874cb6627f1d75d7051feebe4"
  }
]