[
  {
    "text": "Trump's latest tariff twist: A break for Mexico and Canada  —  Two days after putting 25% tariffs on goods from Mexico and Canada, President Trump said on Thursday that he will largely lift them — the latest twist in his on-again, off-again approach to an issue that has sent markets into a tailspin.",
    "url": "https://www.npr.org/2025/03/06/nx-s1-5320044/trump-tariffs-mexico-canada"
  },
  {
    "text": "Treasury Secretary Bessent says the American dream is not about ‘access to cheap goods’ … Treasury Secretary Scott Bessent on Thursday offered a full-throated defense of the White House's position on tariffs, insisting that trade policy has to be about more than just getting low-priced items from other countries.",
    "url": "https://www.cnbc.com/2025/03/06/treasury-secretary-bessent-says-the-american-dream-is-not-about-access-to-cheap-goods.html"
  },
  {
    "text": "Stocks Tumble as Trump Pauses Mexico and Canada Tariffs Again  —  The S&P 500 is on course for its worst week since a banking crisis two years ago.  The Nasdaq fell into a correction on Thursday.  —  Stocks tumbled on Thursday, adding to a string of recent losses, even after the Trump administration offered … ",
    "url": "https://www.nytimes.com/2025/03/06/business/stock-market-today.html"
  },
  {
    "text": "Trump puts new limits on Elon Musk  —  The president convened his secretaries, with Musk, to clarify power.  —  President Donald Trump convened his Cabinet in person on Thursday to deliver a message: You're in charge of your departments, not Elon Musk.  —  According to two administration officials … ",
    "url": "https://www.politico.com/news/2025/03/06/trump-cabinet-musk-025093"
  },
  {
    "text": "Addressing Risks from Perkins Coie LLP  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  The dishonest and dangerous activity of the law firm Perkins Coie LLP (\"Perkins Coie\") has affected this country for decades.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-perkins-coie-llp/"
  },
  {
    "text": "War heroes and military firsts are among 26,000 images flagged for removal in Pentagon's DEI purge  —  References to a World War II Medal of Honor recipient, the Enola Gay aircraft that dropped an atomic bomb on Japan and the first women to pass Marine infantry training are among the tens … ",
    "url": "https://apnews.com/article/dei-purge-images-pentagon-diversity-women-black-8efcfaec909954f4a24bad0d49c78074"
  },
  {
    "text": "Social Security Workers Aren't Allowed to Read This Story  —  New internet restrictions at the embattled SSA have cut off access to WIRED, along with other “general news” websites like The Washington Post and The New York Times.  —  Employees at the Social Security Administration (SSA) … ",
    "url": "https://www.wired.com/story/social-security-workers-arent-allowed-to-read-this-story/"
  },
  {
    "text": "Trump Administration Forces Maine Parents To Visit Social Security Offices To Register Newborns  —  The Social Security Administration canceled contracts that allowed Maine parents to sign up newborns for Social Security numbers at the hospital.  —  For decades, new parents across … ",
    "url": "https://www.huffpost.com/entry/maine-social-security-numbers_n_67ca4f3fe4b0f0ee26f56963"
  },
  {
    "text": "Marshals Escort DOGE Team Into African Aid Agency  —  A day earlier, U.S. African Development Foundation workers had refused entry to Department of Government Efficiency workers and the State Department official in charge of foreign aid.  —  Federal marshals on Thursday escorted officials … ",
    "url": "https://www.nytimes.com/2025/03/06/us/politics/doge-african-aid-agency.html?unlocked_article_code=1.2E4.Z0zQ.rAy-u90FaieT&smid=url-share"
  },
  {
    "text": "‘People Are Going Silent’: Fearing Retribution, Trump Critics Muzzle Themselves … More than six weeks into the second Trump administration, there is a chill spreading over political debate in Washington and beyond.By Kenny Holston/The New York Times  —  The silence grows louder every day.",
    "url": "https://www.nytimes.com/2025/03/06/us/politics/trump-democracy.html?unlocked_article_code=1.104.bA78.onhUDRzXTMl3"
  },
  {
    "text": "MAGA world turns against Supreme Court Justice Amy Coney Barrett  —  The Trump-appointed justice has shifted the court to the right, but she has angered some in MAGA world by voting against some Trump priorities.  —  WASHINGTON — MAGA activists have turned against one of President Donald … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/maga-world-turns-supreme-court-justice-amy-coney-barrett-rcna194283"
  },
  {
    "text": "Justice Amy Coney Barrett ignites anger on the right after ruling against Trump  —  Conservative allies of President Donald Trump called Supreme Court Justice Amy Coney Barrett “evil,” a “closet Democrat” and a “DEI hire.”  —  Just now  —  The Supreme Court's closely divided decision … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/06/amy-coney-barrett-trump-criticism-supreme-court/"
  },
  {
    "text": "Second death reported in growing measles outbreak  —  The death of a New Mexico adult comes eight days after a 6-year-old child succumbed to the disease in Texas last week.  —  just now  —  An unvaccinated New Mexico adult who tested positive for measles has died, the second death … ",
    "url": "https://www.washingtonpost.com/health/2025/03/06/measles-death-outbreak-new-mexico/"
  },
  {
    "text": "Scoop: Dems privately confront Trump speech disruptors  —  House Democratic leadership is privately confronting members who disrupted President Trump's speech to Congress, Axios has learned.  —  Why it matters: Many progressives defied House Minority Leader Hakeem Jeffries' (D-N.Y.) request to avoid making themselves the story.",
    "url": "https://www.axios.com/2025/03/06/trump-speech-congress-democrats-disrupt"
  },
  {
    "text": "Court rules Trump's firing of labor board official illegal, saying president is not a king  —  Judge orders reinstatement of Gwynne Wilcox to National Labor Relations Board after her removal by US president  —  A federal court ruled that Donald Trump's abrupt firing of a former senior official … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/06/trump-labor-board-firing-gwynne-wilcox"
  },
  {
    "text": "Breakup of SpaceX's Starship Rocket Disrupts Florida Airports  —  Video showed the upper stage of the most powerful rocket ever built spinning out of control in space, a repeat of an unsuccessful test flight in January that led to debris falling over the Caribbean.",
    "url": "https://www.nytimes.com/2025/03/06/science/spacex-starship-launch.html"
  },
  {
    "text": "DOGE targets child support database full of income data  —  Associates of Elon Musk's group provoked yet another clash with career civil servants over sensitive government records  —  Just now  —  Representatives of the U.S. DOGE Service have sought access to a powerful database of nearly … ",
    "url": "https://www.washingtonpost.com/business/2025/03/06/doge-hhs-ssa-data/"
  },
  {
    "text": "Scoop: State Dept. to use AI to revoke visas of foreign students who appear “pro-Hamas”  —  Secretary of State Marco Rubio is launching an AI-fueled “Catch and Revoke” effort to cancel the visas of foreign nationals who appear to support Hamas or other designated terror groups, senior State Department officials tell Axios.",
    "url": "https://www.axios.com/2025/03/06/state-department-ai-revoke-foreign-student-visas-hamas"
  },
  {
    "text": "Exclusive: Trump plans to revoke legal status of Ukrainians who fled to US, sources say  —  U.S. President Donald Trump's administration is planning to revoke temporary legal status for some 240,000 Ukrainians who fled the conflict with Russia, a senior Trump official and three sources familiar … ",
    "url": "https://www.reuters.com/world/us/trump-plans-revoke-legal-status-ukrainians-who-fled-us-sources-say-2025-03-06/"
  },
  {
    "text": "‘She Needs to Shut Her Mouth’: Dad of Teen Cancer Survivor Whom Trump Honored Blasts Rachel Maddow  —  The father of DJ Daniel, the teenage cancer survivor whom President Trump honored on Tuesday, had harsh words for MSNBC host Rachel Maddow after she deemed the president “disgusting” for spotlighting the boy's fight with cancer.",
    "url": "https://www.breitbart.com/politics/2025/03/06/she-needs-to-shut-her-mouth-dad-of-teen-cancer-survivor-whom-trump-honored-blasts-rachel-maddow/"
  },
  {
    "text": "A Sensitive Complex Housing a CIA Facility Was on GSA's List of US Properties for Sale  —  Plans to redevelop a Northern Virginia warehouse site have long been complicated by the area's worst-kept secret—the presence of a CIA facility.  The GSA put the site up for sale anyway.",
    "url": "https://www.wired.com/story/gsa-sale-cia-facility/"
  },
  {
    "text": "Trump considering major NATO policy shift  —  The president has discussed possibly favoring members of the alliance that spend a set percentage of their GDP on defense, sources told NBC News.  —  WASHINGTON — President Donald Trump is considering a major change to the U.S.' participation … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-considering-major-nato-policy-shift-rcna195089"
  },
  {
    "text": "IKEA beds?  Dressers?  Inside the ‘exceedingly odd’ DOGE office setup  —  Details of the arrangements at GSA offer a window into the lifestyle of DOGE workers.  —  As DOGE staffers dismantle the federal workforce, they're following Elon Musk's ethos of moving fast and breaking things.",
    "url": "https://www.politico.com/news/2025/03/06/doge-federal-office-bedrooms-00216863"
  },
  {
    "text": "He Gave a Name to What Many Christians Feel … Aaron Renn's “negative world” framework has inspired conferences, sermons, and essays.  —  In the two years since Aaron Renn moved to Carmel, Ind., he has become a kind of unofficial booster for the unusual suburb of Indianapolis.",
    "url": "https://www.nytimes.com/2025/03/06/us/aaron-renn-christianity-conservative-negative-world.html"
  },
  {
    "text": "Gavin Newsom breaks with Democrats on trans athletes in sports  —  The Democratic California governor made the stunning remarks in his debut podcast with conservative guest Charlie Kirk.  —  California Gov. Gavin Newsom, a pioneer for LGBTQ+ rights who decades ago upset leaders in his own party … ",
    "url": "https://www.politico.com/news/2025/03/06/gavin-newsom-breaks-with-democrats-on-trans-athletes-in-sports-00215436"
  },
  {
    "text": "As Ebola Spreads in Uganda, Trump Aid Freeze Hinders Effort to Contain It, U.S. Officials Fear  —  Two more people are reported dead from the disease, and dozens are in isolation, as the outbreak grows.  —  The Ebola outbreak in Uganda has worsened significantly, and the country's ability … ",
    "url": "https://www.nytimes.com/2025/03/06/health/ebola-uganda-usaid.html"
  },
  {
    "text": "Trump wants to dismantle the Education Department.  Here's what it does  —  President Donald Trump has said he wants his new education chief, Linda McMahon, to “put herself out of a job” and close the Education Department.  McMahon was confirmed by the Senate on Monday … ",
    "url": "https://apnews.com/article/education-department-trump-ab509ad5778497dfbd6d53b9eef692b5"
  },
  {
    "text": "Pentagon Cuts Threaten Programs That Secure Loose Nukes and Weapons of Mass Destruction  —  Documents obtained by WIRED show the US Department of Defense is considering cutting up to 75 percent of workers who stop the spread of chemical, biological, and nuclear weapons.",
    "url": "https://www.wired.com/story/pentagon-cuts-nukes-chemical-weapons-wmd/"
  },
  {
    "text": "National Parks Had a Record Year.  Trump Officials Appear to Want It Kept Quiet.  —  As the administration fires rangers and other workers, an internal memo is directing the National Park Service not to publicize visitors numbers.  —  America's national parks saw more than 331 million visits last year, a record.",
    "url": "https://www.nytimes.com/2025/03/06/climate/national-parks-record-visitors-trump.html"
  },
  {
    "text": "Elon Musk and Texas governor celebrate firing of worker over pronouns in email signature  —  Billionaire Trump ally and Greg Abbot tweet about Frank Zamora, who was let go after refusing to remove pronouns  —  The Texas governor, Greg Abbott, and, later, Elon Musk showed support on Wednesday … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/06/musk-greg-abbott-fired-worker-pronouns"
  }
]