[
  {
    "text": "This Is Who Melania Trump Is Reportedly Pushing for Her Husband's VP, and It's Not Surprising  —  In less than six weeks, voting is set to start in the 2024 Republican primary, and the only top contender is former President Trump.  —  So the only question remains: who will be his vice president pick?",
    "url": "https://townhall.com/tipsheet/saraharnold/2023/12/07/this-is-the-person-melania-trump-is-reportedly-pushing-for-her-husbands-vp-and-its-not-surprising-n2632145"
  },
  {
    "text": "Where Are All the Anti-Trump Republicans?  —  A vast array of GOP power brokers detest and disdain the former president.  So why are they keeping so quiet?  —  Here's a portrait of how Donald Trump reclaims power.  —  At a Hoover Institution conference here last week … ",
    "url": "https://www.politico.com/news/magazine/2023/12/08/the-stop-trump-effort-has-been-abysmal-00130751"
  },
  {
    "text": "GOP's Brutal Math: Trump Could Secure Nomination Before Conviction  —  Looking at the primary schedule, Republicans see the party handcuffing itself to a candidate on the verge of politically toxic criminal convictions. … ‘People need to wake up’  —  There's a scenario many Republicans are dreading … ",
    "url": "https://www.thedailybeast.com/gops-brutal-math-donald-trump-could-secure-2024-nomination-before-criminal-conviction"
  },
  {
    "text": "‘I Am Sorry’: Harvard President Gay Addresses Backlash Over Congressional Testimony on Antisemitism  —  Harvard President Claudine Gay apologized for her remarks at the end of her congressional testimony, which sparked fierce national criticism and led the leadership of Harvard Hillel … ",
    "url": "https://www.thecrimson.com/article/2023/12/8/gay-apology-congressional-remarks/"
  },
  {
    "text": "Woman arrested for pouring gasoline, trying to burn down Martin Luther King Jr.'s birth home  —  ATLANTA — Atlanta police are investigating after a woman attempted to burn down Dr. Martin Luther King Jr.'s birth home.  —  Police told Channel 2 Action News they were called to King's birth home … ",
    "url": "https://www.wsbtv.com/news/local/police-investigating-after-person-tries-vandalize-martin-luther-king-jrs-home-near-king-center/NEBC6LEK4RABJNRYEKTFV6X7AU/"
  },
  {
    "text": "RNC officially bows out of hosting primary debates  —  The organization steps aside as television networks plan more early state debates.  —  The Republican National Committee is pausing its participation in 2024 GOP primary debates, the organization decided Friday.",
    "url": "https://www.politico.com/news/2023/12/08/rnc-officially-bows-out-of-hosting-primary-debates-for-now-00130857"
  },
  {
    "text": "What to know about Trump-appointed judge in Hunter Biden tax case  —  Mark Scarsi, a U.S. district court judge, has been assigned to the case involving a federal indictment against President Biden's son, Hunter Biden.  —  Scarsi is based in the Central District of California and oversees Los Angeles.",
    "url": "https://thehill.com/regulation/court-battles/4350050-what-to-know-trump-appointed-judge-hunter-biden-tax-case/"
  },
  {
    "text": "Inside Trump's Plot To Corrupt the 2024 Election With ‘Garbage’ Data  —  For more than a decade, election officials have relied on a system to reduce fraud and boost voter registration.  Trump's cronies are sabotaging it, state by state — and trying to replace it with something more MAGA",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-election-plans-corrupt-voter-registration-eric-eagleai-1234920083/"
  },
  {
    "text": "FACT SHEET: President Biden Announces Billions to Deliver World-Class High-Speed Rail and Launch New Passenger Rail Corridors Across the Country  —  $8.2 Billion from the President's Investing in America Agenda to Deliver Transformative Passenger Rail in America",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/08/fact-sheet-president-biden-announces-billions-to-deliver-world-class-high-speed-rail-and-launch-new-passenger-rail-corridors-across-the-country/"
  },
  {
    "text": "Nancy Mace and her entrepreneur fiancé Patrick Byrant split after 18 months - as staff quit her office and she's accused of discussing her sex life with aides  — The South Carolina lawmaker - who was one of the eight to vote out former Speaker Kevin McCarthy - split with her fiancé last month",
    "url": "https://www.dailymail.co.uk/news/article-12833527/nancy-mace-fiance-break-charleston-south-carolina.html"
  },
  {
    "text": "Dominion wins access to Newsmax journalists' texts in its defamation case  —  The ruling is a blow to the conservative news organization, which said in filings that it had avoided such a mandate in a similar case.  —  Dominion Voting Systems is entitled to review personal communications … ",
    "url": "https://www.nbcnews.com/media/dominion-wins-access-newsmax-journalists-texts-defamation-case-rcna128179"
  },
  {
    "text": "Retail Group Retracts Startling Claim About ‘Organized’ Shoplifting  —  The National Retail Federation had said that nearly half of the industry's $94.5 billion in missing merchandise in 2021 was the result of organized theft.  It was likely closer to 5 percent.",
    "url": "https://www.nytimes.com/2023/12/08/business/organized-shoplifting-retail-crime-theft-retraction.html"
  },
  {
    "text": "White House Disavows U.S. Islamic Group After Leader's Oct. 7 Remarks  —  The director of the Council on American-Islamic Relations said in a speech that he was “was happy to see” Palestinians break out of Gaza on the day Hamas attacked Israel.  —  The White House disavowed … ",
    "url": "https://www.nytimes.com/2023/12/08/us/politics/white-house-cair-nihad-awad.html"
  },
  {
    "text": "GOP lawmaker: Ousted aides targeted my daughter for OnlyFans account  —  Rep. Brandon Williams, who represents a battleground seat, says his altercation stemmed from a threat to expose his daughter's OnlyFans account.  —  A Republican member of Congress is alleging that a former top aide spearheaded a … ",
    "url": "https://www.politico.com/news/2023/12/08/brandon-williams-interview-video-former-aides-00130713"
  },
  {
    "text": "Massachusetts Finally Cracks Down on Notorious New England Neo-Nazis  —  After years of intimidating the public with impunity, NSC-131 will be brought to court for alleged “violent and unlawful conduct.” … The 26-page, five-charge complaint is the most aggressive effort yet to blunt … ",
    "url": "https://www.rollingstone.com/politics/politics-news/nsc-131-neo-nazi-charged-civil-rights-violations-1234921860/"
  },
  {
    "text": "Musk's Scandinavian woes deepen as Tesla loses Swedish court case, Finnish union joins port blockade  — Tesla is facing mounting pressure across Scandinavian countries to sign a collective bargaining agreement with employees in Sweden.  — Finnish transport workers' union AKT … ",
    "url": "https://www.cnbc.com/2023/12/08/musks-scandinavian-woes-deepen-as-tesla-loses-swedish-court-case.html"
  },
  {
    "text": "GOP Kansas Sen. Marshall Wants to Impeach Biden, But Also Wants Him on 2024 Ticket  —  Republican lawmaker called the president the head of a ‘crime operation,’ but wants a Biden vs. Trump rematch  —  Sen. Roger Marshall, R-Kan., prefers having President Joe Biden on the 2024 ticket to impeaching him before then.",
    "url": "https://themessenger.com/politics/roger-marshall-biden-impeachment-2024-ticket"
  },
  {
    "text": "Federal appeals court upholds but narrows the gag order in Trump's D.C. election interference case  —  The U.S. Court of Appeals of the District of Columbia found some of U.S. District Judge Tanya Chutkan's order were too broad.  —  A federal appeals court in Washington … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/federal-appeals-court-upholds-narrows-gag-order-trumps-dc-election-int-rcna128778"
  },
  {
    "text": "FDA Approves First Gene Therapies to Treat Patients with Sickle Cell Disease  —  For Immediate Release:  —  Today, the U.S. Food and Drug Administration approved two milestone treatments, Casgevy and Lyfgenia, representing the first cell-based gene therapies for the treatment of sickle cell disease … ",
    "url": "https://www.fda.gov/news-events/press-announcements/fda-approves-first-gene-therapies-treat-patients-sickle-cell-disease"
  },
  {
    "text": "1 in 5 young Americans think Holocaust was a myth  —  A fifth of Americans ages 18-29 believe the Holocaust was a myth, according to a new poll from The Economist/YouGov.  —  While the question only surveyed a small sample of about 200 people, it lends credence to concerns about rising antisemitism … ",
    "url": "https://thehill.com/homenews/education/4349815-poll-americans-holocaust-myth/"
  },
  {
    "text": "Americans' Views of the Israel-Hamas War  —  Bipartisan concern about violence against Jews in U.S.; wide partisan gap in concerns over violence against U.S. Muslims  —  Bipartisan concern about violence against Jews in U.S.; wide partisan gap in concerns over violence against U.S. Muslims",
    "url": "https://www.pewresearch.org/politics/2023/12/08/americans-views-of-the-israel-hamas-war/"
  }
]