[
  {
    "text": "Top Producer of ‘60 Minutes’ Quits, Citing a Loss of Independence  —  The news program has faced mounting pressure from both President Trump and its corporate ownership at Paramount, the parent company of CBS News.  —  CBS News entered a new period of turmoil on Tuesday after the executive producer of … ",
    "url": "https://www.nytimes.com/2025/04/22/business/media/cbs-60-minutes-trump-bill-owens.html?unlocked_article_code=1.Bk8.1wV3.zcXqaT2IC3Hx&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Info Hegseth shared with wife and brother came from top general's secure messages  —  Hegseth has denied the information he shared was classified, but it was given to him on a system for sensitive and classified information, sources told NBC News.  —  WASHINGTON — Minutes … ",
    "url": "https://www.nbcnews.com/politics/national-security/info-pete-hegseth-shared-wife-brother-came-top-generals-secure-message-rcna198838?link_source=ta_bluesky_link&taid=68078c1766e4b3000122ed90"
  },
  {
    "text": "Tesla Profit Sinks, Hurt by Political Backlash  —  Net income drops 71% in first quarter  —  Tesla's net income slid 71% in the first quarter, as the company struggled to overcome competitive pressure overseas and a reputational hit from Chief Executive Elon Musk's polarizing role in the Trump administration.",
    "url": "https://www.wsj.com/business/autos/tesla-tsla-q1-earnings-report-2025-f7120a39https://www.wsj.com/business/autos/tesla-tsla-q1-earnings-report-2025-f7120a39"
  },
  {
    "text": "Even on the gravest of issues, GOP can't summon the will to question Trump  —  Just weeks after Republicans stood by as Trump's tariffs threw the economy into chaos, they're doing the same with Pete Hegseth and national security.  —  It took Pete Hegseth just three weeks as defense secretary … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/22/hegseth-national-security-concerns/"
  },
  {
    "text": "Jury finds NY Times not liable in Sarah Palin defamation case  —  A federal jury in Manhattan on Tuesday found the New York Times (NYT.N) not liable for allegedly defaming Sarah Palin in a 2017 editorial about gun control, dealing the former Republican U.S. vice presidential candidate a second loss at trial.",
    "url": "https://www.reuters.com/world/us/jury-finds-ny-times-not-liable-sarah-palin-defamation-case-2025-04-22/"
  },
  {
    "text": "Revealed: Trump Admin Launches the Biggest Shake-Up ‘In Decades’ at the State Department  —  Internal documents obtained by The Free Press detail plans to close 132 offices, including those launched to further human rights, counter extremism, and prevent war crimes.",
    "url": "https://www.thefp.com/p/trump-state-shake-up-rubio"
  },
  {
    "text": "3 Adams Case Prosecutors Resign Rather Than Express Regret to Justice Dept.  —  They had been placed on administrative leave after refusing to abandon the corruption case against Mayor Eric Adams.  “We will not confess wrongdoing when there was none,” they wrote.",
    "url": "https://www.nytimes.com/2025/04/22/nyregion/eric-adams-prosecutors-resign.html?unlocked_article_code=1.Bk8.1GRe.r406j5r3Evmp"
  },
  {
    "text": "The Biden Official Who Doesn't Oppose Trump's Student Deportations  —  Why the Holocaust historian Deborah Lipstadt blames universities for “opening the door” to the Trump Administration's professed campaign to tackle antisemitism.  —  After Hamas's attack on Israel on October 7th, 2023 … ",
    "url": "https://www.newyorker.com/news/q-and-a/the-biden-official-who-doesnt-oppose-trumps-student-deportations"
  },
  {
    "text": "Federal judge orders Trump administration to rehire all Voice of America and Radio Free Asia staff  —  A federal judge ordered the Trump administration to rehire all Voice of America, Radio Free Asia and Middle East Broadcasting Network staff for now, and he said all congressional funding must resume … ",
    "url": "https://www.cbsnews.com/news/federal-judge-trump-order-voice-of-america/"
  },
  {
    "text": "RFK Jr. Set to Launch Disease Registry Tracking Autistic People  —  Robert F. Kennedy Jr. is using private medical records to create a registry of people with autism in the United States.  —  The National Institutes of Health is helping to collect private medical records from government … ",
    "url": "https://newrepublic.com/post/194245/rfk-jr-disease-registry-track-autistic-people"
  },
  {
    "text": "Trump Says He Has ‘No Intention’ of Firing Fed Chair Powell  —  The president has increasingly criticized Powell in recent days  —  President Trump said he has “no intention” of firing Federal Reserve Chairman Jerome Powell.  —  “We think that it's a perfect time to lower the rate … ",
    "url": "https://www.wsj.com/politics/elections/trump-says-he-has-no-intention-of-firing-fed-chair-powell-eda4c6a7"
  },
  {
    "text": "HHS Plans to Cut the National Suicide Hotline's Program for LGBTQ Youth  —  In February, the program received an average of 2,100 contacts per day.  —  The federal government plans to eliminate services for LGBTQ youth who call 988, the national suicide and crisis hotline … ",
    "url": "https://www.motherjones.com/politics/2025/04/national-suicide-hotline-lgbtq-youth-cuts-rfk-jr-hhs/"
  },
  {
    "text": "The Supreme Court's “Don't Say Gay” argument went disastrously for public schools  —  Three years ago, Montgomery County, Maryland, approved several books with LGBTQ characters for use in public school classrooms.  Not much else is known about these books, how they have been used … ",
    "url": "https://www.vox.com/scotus/409921/supreme-court-dont-say-gay-mahmoud-taylor"
  },
  {
    "text": "US “relocates” Iraqi refugee to Rwanda via new diplomatic arrangement  —  A State Department cable indicates at least 10 more people will be subjected to the same. … A US State Department cable was sent from the American Embassy in Kigali, Rwanda, on March 13th with some major news … ",
    "url": "https://www.thehandbasket.co/p/us-rwanda-relocates-iraqi-refugee-omar-ameen"
  },
  {
    "text": "The vicious rivalries tearing apart Pete Hegseth's Pentagon  —  A feud between the secretary's advisers and his chief of staff created backbiting and distrust that has erupted into the open.  —  When President Donald Trump chose Pete Hegseth for Defense secretary, incoming officials knew … ",
    "url": "https://www.politico.com/news/2025/04/22/pentagon-infighting-hegseth-fired-officials-00302709"
  },
  {
    "text": "Gorsuch, Roberts side with left-leaning Supreme Court justices in immigration ruling  —  Justice Neil Gorsuch wrote the majority opinion in the 5-4 court case - a possible sign of the court's thinking as it gears up to hear high-profile immigration cases next month",
    "url": "https://www.foxnews.com/politics/gorsuch-roberts-side-left-leaning-supreme-court-justices-immigration-ruling"
  },
  {
    "text": "4-year-old migrant girl, other kids go to court in NYC with no lawyer: ‘The cruelty is apparent’ … We rely on your support to make local news available to all  —  Make your contribution now and help Gothamist thrive in 2025.  Donate today  —  Gothamist is funded by sponsors and member donations",
    "url": "https://gothamist.com/news/4-year-old-migrant-girl-other-kids-go-to-court-in-nyc-with-no-lawyer-the-cruelty-is-apparent"
  },
  {
    "text": "Chinese freight ship traffic to busiest U.S. ports, Los Angeles, Long Beach, sees steep drop … The pullback in trade between the U.S. and China as a result of President Trump's steep tariffs on Chinese goods and fears of a recession are starting to show up in major ports data … ",
    "url": "https://www.cnbc.com/2025/04/22/busiest-us-ports-see-big-drop-in-chinese-freight-vessel-traffic.html"
  },
  {
    "text": "US FDA suspends milk quality tests amid workforce cuts  —  The Food and Drug Administration is suspending a quality control program for testing of fluid milk and other dairy products due to reduced capacity in its food safety and nutrition division, according to an internal email seen by Reuters.",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-suspends-milk-quality-tests-amid-workforce-cuts-2025-04-21/"
  },
  {
    "text": "Tesla warns that trade policy and politics are taking a toll as it announces sizable revenue decline  —  The electric automaker — which is increasingly trying to diversify into high-tech products like robots — said profits fell 71% to $409 million compared to $1.39 billion during the same quarter one year ago.",
    "url": "https://www.nbcnews.com/business/business-news/tesla-earnings-q1-musk-trump-administation-what-next-rcna202409"
  },
  {
    "text": "Authorities won't charge man caught on video vandalizing Teslas in Minneapolis  —  Police chief responds with frustration that the state white collar employee is being spared prosecution after causing more than $21,000 in damages. … A man was caught on video vandalizing a Tesla in Minneapolis last month.",
    "url": "https://www.startribune.com/suspect-in-tesla-vandalizing-spree-in-minneapolis-to-be-entered-into-diversion-and-not-charged/601334027"
  },
  {
    "text": "George Mason University calls cops on student for article criticizing Trump  —  GMU student Nicholas Decker's Substack essay “When Must We Kill Them?” earned him a visit from the Secret Service  —  In 1787, Thomas Jefferson declared that “The tree of liberty must be refreshed from time to time with the blood of patriots and tyrants.”",
    "url": "https://www.thefire.org/news/george-mason-university-calls-cops-student-article-criticizing-trump"
  },
  {
    "text": "The $10M steered to Hope Florida by the state was Medicaid money, document shows  —  The $10 million that Gov. Ron DeSantis' administration diverted to a state-created charity last year consisted of Medicaid dollars owed to state and federal taxpayers, contrary to what the governor and other officials have publicly asserted.",
    "url": "https://www.miamiherald.com/news/politics-government/state-politics/article304665166.html"
  },
  {
    "text": "Venezuelan Immigrant Deported by Trump Administration Has Disappeared  —  The immigrant does not appear on a list of people sent to a prison in El Salvador, and his family and friends have no idea of his whereabouts.  He has essentially disappeared.  —  In late January, Ricardo Prada Vásquez … ",
    "url": "https://www.nytimes.com/2025/04/22/us/venezuela-immigrant-disappear-deport-ice.html?unlocked_article_code=1.Bk8.1Xxc.PSd78C9iLzi0&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Federal Appeals Court Halts Ballot Curing in North Carolina Supreme Court Election  —  A federal appeals court blocked North Carolina from beginning ballot curing as part of Republican candidate Jefferson Griffin's effort to overturn the results of the state's 2024 Supreme Court race.",
    "url": "https://www.democracydocket.com/news-alerts/appeals-court-north-carolina-supreme-court-ballot-curing-halt-riggs-griffin/"
  },
  {
    "text": "RFK Jr. eyes reversing CDC's Covid-19 vaccine recommendation for children  —  RFK Jr. has raised doubts about the need for kids to get vaccinated against the disease.  —  HHS Secretary Robert F. Kennedy Jr. is weighing pulling the Covid-19 vaccine from the government's list of recommended immunizations … ",
    "url": "https://www.politico.com/news/2025/04/22/trump-pull-covid-vaccine-recommendation-children-00304091"
  },
  {
    "text": "EPA starts layoffs of environmental justice employees  —  The agency previously announced a rollback of environmental regulation, eliminated some probationary workers and put other workers on administrative leave.  —  The Environmental Protection Agency continued its staffing shake-up Monday … ",
    "url": "https://www.nbcnews.com/science/science-news/epa-starts-layoffs-environmental-justice-employees-rcna202287"
  },
  {
    "text": "National Science Foundation Terminates Hundreds of Active Research Awards  —  The agency targeted grants focused on diversity, equity and inclusion, as well as research on misinformation.  —  Casey Fiesler, an information science professor at the University of Colorado Boulder … ",
    "url": "https://www.nytimes.com/2025/04/22/science/trump-national-science-foundation-grants.html?unlocked_article_code=1.Bk8.6xHW.gB5Wmi6EtSRy"
  }
]