[
  {
    "text": "Trump held in contempt for violating hush money trial gag order — gets $9,000 fine and jail warning … Republican presidential candidate and former U.S. President Donald Trump sits in the courtroom, as his criminal trial over charges that he falsified business records to conceal money paid … ",
    "url": "https://www.cnbc.com/2024/04/30/trump-trial-hush-money-case-resumes-with-testimony-from-michael-cohen-banker.html"
  },
  {
    "text": "Judge holds Trump in contempt for violating gag order in hush money trial  —  Prosecutors from the Manhattan District Attorney's Office accused Trump of violating the gag order numerous times since it went into effect.  —  The judge presiding over Donald Trump's hush money case on Tuesday held … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-holds-trump-contempt-violating-gag-order-hush-money-trial-rcna149101"
  },
  {
    "text": "Trump, Venting About Lawyer in His Criminal Trial, Seeks More Aggression  —  Todd Blanche upended his career to represent Donald J. Trump and has been the former president's favorite.  But Mr. Trump has made him a focus of his episodic wrath.  —  Donald J. Trump's Manhattan criminal trial … ",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/trump-trial-todd-blanche.html"
  },
  {
    "text": "How Far Trump Would Go  —  The former President, at Mar-a-Lago on April 12, is rallying the right at home and seeking common cause with autocratic leaders abroad.Photograph by Philip Montgomery for TIME  —  Donald Trump thinks he's identified a crucial mistake of his first term: He was too nice.",
    "url": "https://time.com/6972021/donald-trump-2024-election-interview/"
  },
  {
    "text": "Read the Full Transcripts of Donald Trump's Interviews With TIME … Over the course of the interviews, Trump discussed his agenda for a second term, which includes deporting millions of people, cutting the U.S. civil service, and intervening more directly in Justice Department prosecutions than his predecessors.",
    "url": "https://time.com/6972022/donald-trump-transcript-2024-election/"
  },
  {
    "text": "GOP lawmakers say Marjorie Taylor Greene's motion to vacate has fizzled … - “Even trolls online have said they don't want it,” one member told Axios.  — “I dont think she's going to do it - I think that window for her has passed,” another argued.",
    "url": "https://www.axios.com/2024/04/30/marjorie-taylor-greene-johnson-motion-vacate-gop"
  },
  {
    "text": "Greene vows to move ahead on Johnson ouster vote after Democrats promise to save him  —  Rep. Marjorie Taylor Greene (R-Ga.) is vowing to move ahead with a vote to oust Speaker Mike Johnson (R-La.), even after Democratic leaders said they would shield the Louisiana Republican from a conservative coup.",
    "url": "https://thehill.com/homenews/house/4632914-greene-johnson-ouster-vote-democrats/"
  },
  {
    "text": "FBI data shows America is seeing a ‘considerable’ drop in crime.  Trump says the opposite.  —  Jeff Asher is a New Orleans-based crime data analyst who has worked at the CIA and Department of Defense.  He leans towards caution when describing trends in his line of work.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/30/trump-crime-fbi-data-murder-statistics/73443631007/"
  },
  {
    "text": "The biggest political deception of 2024  —  In the 2024 presidential election, one of the central attacks that Trump and his political allies are levying against Biden is that Biden is responsible for a “migrant crime” wave.  The argument was summarized by Trump in a March 22 video:",
    "url": "https://popular.info/p/the-biggest-political-deception-of"
  },
  {
    "text": "Kristi Noem doubled down on dog-killing to win over MAGA — now her story is backfiring in her face  —  South Dakota's governor gets the sadism of Trump supporters, but screws up by saying the quiet parts out loud  —  Squint hard enough and perhaps one can see how Gov. Kristi Noem, R-S.D. … ",
    "url": "https://www.salon.com/2024/04/30/kristi-noem-doubled-down-on-dog-to-win-over-maga--now-her-story-is-backfiring-in-her-face/"
  },
  {
    "text": "Sex is biological fact, NHS declares in landmark shift against gender ideology  —  Campaigners welcome change to constitution, which will ban trans women from female-only wards, as ‘return to common sense’  —  The NHS is to declare that sex is a matter of biology in a landmark shift against gender ideology.",
    "url": "https://www.telegraph.co.uk/news/2024/04/30/nhs-sex-biological-landmark-shift-against-gender-ideology/"
  },
  {
    "text": "‘Frustrated’ ex-Trump aide says she won't vote for former president  —  Sarah Matthews, an ex-staffer of former President Trump, said Monday she would not cast her vote in November for Trump, signaling she could instead vote for President Biden.  —  “When we have a candidate on the ballot … ",
    "url": "https://thehill.com/homenews/campaign/4632165-sarah-matthews-former-donald-trump-aide-vote-joe-biden-2024/"
  },
  {
    "text": "Trump Holds Edge Over Biden in Seven Key Swing State Polls  —  Home Polls Trump Holds Edge Over Biden in Seven Key Swing State Polls  —  Democrats Maintain Lead over Republicans in Five Senate Races  —  New Emerson College Polling/The Hill swing state polls find President Biden trailing … ",
    "url": "https://emersoncollegepolling.com/trump-holds-edge-over-biden-in-seven-key-swing-state-polls/"
  },
  {
    "text": "Dozens occupy Hamilton Hall as pro-Palestinian protests spread across campus  —  This is a developing story.  Check back for updates.",
    "url": "https://www.columbiaspectator.com/news/2024/04/30/dozens-occupy-hamilton-hall-as-pro-palestinian-protests-spread-across-campus/"
  },
  {
    "text": "Ted Cruz Wants Airlines to Keep Your Cash When They Cancel Your Flight  —  Cruz and three other congressional lawmakers offered legislation that could undermine the Biden administration's new airline refund rule  —  AFTER THE BIDEN administration issued a final rule last week … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ted-cruz-airlines-automatic-refunds-faa-reauthorization-1235012248/"
  },
  {
    "text": "Former NSA Employee Sentenced to Over 21 Years in Prison for Attempted Espionage  —  For Immediate Release  —  Jareh Sebastian Dalke, 32, of Colorado Springs, was sentenced today to 262 months in prison for attempted espionage in connections with his efforts to transmit classified National … ",
    "url": "https://www.justice.gov/opa/pr/former-nsa-employee-sentenced-over-21-years-prison-attempted-espionage"
  },
  {
    "text": "Revealed: Tyson Foods dumps millions of pounds of toxic pollutants into US rivers and lakes  —  Nitrogen, phosphorus, chloride, oil and cyanide among the 371m lb of pollutants released by just 41 plants in five years  —  Nina Lakhani in Dakota City and Lexington, Nebraska, with graphics by Alvin Chang",
    "url": "https://www.theguardian.com/environment/2024/apr/30/tyson-foods-toxic-pollutants-lakes-rivers"
  },
  {
    "text": "Immigration Named Top U.S. Problem for Third Straight Month  —  Immigration has been the most politically polarizing issue mentioned in past 24 years  —  WASHINGTON, D.C. — A steady 27% of Americans say the most important problem facing the U.S. is immigration, topping Gallup's open-ended trend … ",
    "url": "https://news.gallup.com/poll/644570/immigration-named-top-problem-third-straight-month.aspx"
  },
  {
    "text": "Yet another dubious election deadline maneuver, in Florida  —  The retirement-announcement two-step strikes again  —  Rep. Bill Posey (R-Fla.) staunchly supported challenging the 2020 election results in the run-up to Jan. 6, 2021.  “Running fair and transparent elections is something America must live up to,” he said that day.",
    "url": "https://www.washingtonpost.com/politics/2024/04/29/yet-another-dubious-election-deadline-maneuver-florida/"
  },
  {
    "text": "The Maryland Senate race testing Democrats' commitment to diversity  —  David Trone says his money would free up national Democrats to focus on other states — but Angela Alsobrooks would make history.  —  Nearly every major Democrat in Maryland is lining up behind Angela Alsobrooks' attempt … ",
    "url": "https://www.politico.com/news/2024/04/30/maryland-senate-democrat-primary-00155060"
  },
  {
    "text": "Senate Democrats unveil Big Oil report after 3-year investigation … - The joint 66-page report from the Senate Budget and House Oversight Committees claims some of the largest oil companies have internally acknowledged since the 1960s that fossil fuels cause climate change.",
    "url": "https://www.axios.com/2024/04/30/senate-democrats-big-oil-report-climate-change"
  }
]