[
  {
    "text": "Allentown grandfather's family was told he died in ICE custody.  Then they learned he's alive — in a hospital in Guatemala, they say  —  Relatives of 82-year-old Allentown resident Luis Leon are headed to a Guatemalan hospital Saturday in hopes of reuniting with the man they say disappeared without … ",
    "url": "https://www.mcall.com/2025/07/18/luis-leon-allentown-grandfather-ice-guatemala/"
  },
  {
    "text": "Man whose car struck crowd outside Los Angeles club, injuring 30, was shot, attacked by crowd  —  A vehicle rammed into a crowd of people waiting to enter a nightclub along a busy boulevard in Los Angeles early Saturday, injuring 30 people and leading bystanders to attack the driver, authorities said.",
    "url": "https://apnews.com/article/los-angeles-car-into-crowd-east-hollywood-74109553b3f12ded236dc4e2d72c919b"
  },
  {
    "text": "Colbert and Capitulation … Just how far is David Ellison willing to go to shift the political tone at CBS?  On Thursday, we got our clearest sign yet, as the network sacrificed its biggest star as Skydance seeks Donald Trump's approval for its Paramount merger.",
    "url": "https://www.status.news/p/colbert-cancellation-paramount-skydance-deal"
  },
  {
    "text": "Skydance CEO met with FCC chair ahead of CBS canceling “The Late Show”  —  Skydance CEO David Ellison and his lawyer met with Federal Communications Commission chair Brendan Carr and an FCC lawyer on Tuesday, a new regulatory filing shows. … - They urged the FCC's Media Bureau to … ",
    "url": "https://www.axios.com/2025/07/18/stephen-colbert-late-show-skydance"
  },
  {
    "text": "FBI personnel were told to flag Epstein files mentioning Trump, Senate Democrat says  —  Sen. Dick Durbin questioned DOJ leadership over their handling of the Epstein files, including reports that FBI personnel were told to “flag” any mentions of Trump.  —  Senate Democratic Whip Dick Durbin … ",
    "url": "https://www.nbcnews.com/politics/congress/fbi-personnel-jeffrey-epstein-files-mentioning-trump-dick-durbin-says-rcna219699"
  },
  {
    "text": "Inside the Long Friendship Between Trump and Epstein  —  For nearly 15 years, the two men socialized together in Manhattan and Palm Beach, Fla., before a falling out that preceded Mr. Epstein's first arrest.  —  Mar-a-Lago in March 1996.Art Seitz/Gamma-Rapho, via Getty Images",
    "url": "https://www.nytimes.com/2025/07/19/us/politics/inside-trump-epstein-friendship.html?unlocked_article_code=1.Xk8.1DzP.cFpEkTMqhR2w&smid=url-share"
  },
  {
    "text": "Brazilian president: Trump is not ‘the emperor of the world’  —  Brazilian President Luiz Inácio Lula da Silva urged President Trump to negotiate a trade agreement this week as the U.S. has pursued increasingly aggressive action over the criminal prosecution of Jair Bolsonaro, Brazil's former president.",
    "url": "https://thehill.com/policy/international/5410100-lula-trump-brazil-trade-tariffs-deal/"
  },
  {
    "text": "Rubio revokes visas of Brazilian judge, allies over Bolsonaro prosecution  —  Secretary of State Marco Rubio announced late Friday that the visas of Brazilian Supreme Court Judge Alexandre de Moraes, his “allies on the court” and immediate family members have been revoked over the ongoing … ",
    "url": "https://thehill.com/policy/international/5409784-us-vias-revoked-brazilian-supreme-court-bolsonaro-prosecution/"
  },
  {
    "text": "Trump says ‘left lunatics’ won't be satisfied with Epstein grand jury testimony  —  President Trump on Saturday said even if his administration releases all of the grand jury testimony in the case related to disgraced financier and convicted sex offender Jeffrey Epstein, it will not be enough to satisfy the … ",
    "url": "https://thehill.com/homenews/administration/5409962-donald-trump-jeffrey-epstein-testimony-democrats/"
  },
  {
    "text": "A Pro-Trump Community Reckons With Losing a Beloved Immigrant Neighbor  —  A photograph of Moises Sotelo held by his daughter, Alondra Sotelo Garcia.Christopher Valentine for The New York Times  —  Voters here in Oregon's rural Yamhill County have backed Donald Trump for three presidential elections … ",
    "url": "https://www.nytimes.com/2025/07/19/opinion/immigrants-ice-deportation.html?unlocked_article_code=1.Xk8.p5Xo.VPd6VtfURlaC&smid=url-share"
  },
  {
    "text": "Exclusive: Trump's funding cut stalls water projects, increasing risks for millions  —  The Trump administration's decision to slash nearly all U.S. foreign aid has left dozens of water and sanitation projects half-finished across the globe, creating new hazards for some of the people they were designed to benefit, Reuters has found.",
    "url": "https://www.reuters.com/world/us/trumps-funding-cut-stalls-water-projects-increasing-risks-millions-2025-07-19/"
  },
  {
    "text": "Sen. Murkowski, feeling ‘cheated’ by Trump actions against wind and solar, says she'll go to bat for Alaska projects  —  Sen. Lisa Murkowski said she feels “cheated” after she won a concession in the recently passed tax and spending law to protect wind and solar projects … ",
    "url": "https://www.adn.com/business-economy/energy/2025/07/18/sen-murkowski-feeling-cheated-by-trump-actions-against-wind-and-solar-says-shell-go-to-bat-for-alaska-projects/"
  },
  {
    "text": "The biggest political fights over Trump's megabill are converging in Nevada  —  Nevada, set to play a key role in the 2026 and 2028 elections, could be uniquely impacted by some of the new law's tax and Medicaid provisions.  —  When it comes to President Donald Trump's “big, beautiful bill … ",
    "url": "https://www.nbcnews.com/politics/politics-news/biggest-political-fights-trumps-megabill-are-converging-nevada-rcna219368"
  },
  {
    "text": "Founder of Right-Wing Group Behind Project 2025 Dies at 83  —  BEYOND THE VEIL  —  The conservative “visionary” served on the transition for President Trump's first term.  —  AYE OF A TIGER  —  Perry was in the middle of singing “Roar” when things went awry.  —  SHOP WITH SCOUTED  —  CHEERS",
    "url": "https://www.thedailybeast.com/founder-of-heritage-foundation-edwin-j-feulner-dies-at-83/"
  },
  {
    "text": "Republicans' food aid cuts will hit grocers in many towns that backed Trump … Even though some provisions in the new law won't go into effect for another three years, others, like expanded work requirements for SNAP participants, could kick some families out of the program and hit … ",
    "url": "https://www.politico.com/news/2025/07/19/trump-snap-food-cuts-rural-grocers-megabill-00463048"
  },
  {
    "text": "Without weather forecasters, our canaries in the storm, expect disaster  —  Before modern forecasting, hurricanes were mass casualty events.  The 1900 Galveston Hurricane killed over 8,000 people, wiping out an entire city with a 15-foot storm surge.  Less than a century ago … ",
    "url": "https://thehill.com/opinion/energy-environment/5408624-hurricane-warning-system-at-risk/"
  },
  {
    "text": "Democrats' 2024 Autopsy Is Described as Avoiding the Likeliest Cause of Death  —  An audit being conducted by the D.N.C. is not looking at Joe Biden's decision to run or key decisions by Kamala Harris's team, according to six people briefed on the report.  —  The Democratic National Committee's … ",
    "url": "https://www.nytimes.com/2025/07/19/us/politics/democrats-2024-autopsy-harris-biden.html?unlocked_article_code=1.Xk8.5bA7.DMIFme0Pd3Jb&smid=url-share"
  },
  {
    "text": "State Dept. layoffs led by team of outsiders willing to ‘break stuff’  —  Interviews with more than 60 people detail a frenetic, arbitrary process underpinning the Trump administration's far-reaching overhaul.  —  Summary1445  —  The Trump administration's dramatic reorganization of the State Department … ",
    "url": "https://www.washingtonpost.com/national-security/2025/07/19/state-department-layoffs-jeremy-lewin/"
  },
  {
    "text": "Our Pathetic Senate  —  CBS cancels satire; Trump sues Rupert, toys with firing the Fed chair, begins to realize that V. Putin is not his BFF, but gives him 50 more days to keep killing Ukrainians.  And try as he might, he still can't shake the ghost of his Epstein past.  —  Happy Saturday.",
    "url": "https://charliesykes.substack.com/p/our-pathetic-senate"
  },
  {
    "text": "Trump, Epstein and a Stinging SCOTUS Dissent  —  “The Opinions” round table discusses Trump and MAGA's very bad week.  —  This week on “The Opinions” round table, the national politics correspondent Michelle Cottle and the columnists David French and Jamelle Bouie discuss the right's implosion … ",
    "url": "https://www.nytimes.com/2025/07/19/opinion/epstein-investigation-trump-supreme-court.html"
  },
  {
    "text": "Trump's DOJ has fired dozens of prosecutors, upending decades-old norm  —  Firings by Trump administration spark worries about weakening the rule of law  —  The Department of Justice under the Trump administration has fired dozens of career prosecutors during the past six months … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/19/justice-career-prosecutors-staff-firings-trump/"
  },
  {
    "text": "Why Are More Than 100 People Still Missing in Texas, 2 Weeks After the Floods?  —  The number of people unaccounted for dropped this week but remains stubbornly high as some searchers lose hope of finding them.  —  In the days after the deadly July 4 floods in Central Texas … ",
    "url": "https://www.nytimes.com/2025/07/19/us/politics/texas-floods-missing.html"
  },
  {
    "text": "MAGA's New Target: Trump  —  People often become what they scorn.  Donald Trump has become the deep state.  —  He is the keeper of the secrets.  He is the one stealing away people's liberties.  He is the one weaponizing government and protecting the ruling class.",
    "url": "https://www.nytimes.com/2025/07/19/opinion/trump-maga-epstein-deep-state.html?unlocked_article_code=1.Xk8.yDBy.kbXqusWa5BD9&smid=url-share"
  },
  {
    "text": "Heritage Foundation founder Edwin J. Feulner dies at 83  —  Conservative powerhouse transformed policy landscape and helped craft Trump's agenda through Project 2025  —  Edwin J. Feulner, a prominent figure in the American conservative movement and co-founder and former president of the Heritage Foundation … ",
    "url": "https://www.foxnews.com/politics/heritage-foundation-founder-edwin-j-feulner-dies-83"
  }
]