[
  {
    "text": "Scoop: House Democrat “absolutely not” committed to voting for Harris … - “That's a positive step in the right direction, I think, from the perspective of the American people. … - But Golden said he is “absolutely not” committing to voting for Harris and is “going to wait … ",
    "url": "https://www.axios.com/2024/07/25/jared-golden-kamala-harris-trump-election"
  },
  {
    "text": "Republicans see Gov. Josh Shapiro as Harris' ‘super strong’ VP contender  —  But a few of the reasons Republicans consider the Pennsylvania governor a potential boost to Vice President Kamala Harris' campaign may cause heartburn among some Democrats.  —  PITTSBURGH — Republicans increasingly … ",
    "url": "https://www.nbcnews.com/politics/2024-election/republicans-see-gov-josh-shapiro-harris-super-strong-vp-contender-rcna163322"
  },
  {
    "text": "The GOP's legal challenges to Harris's candidacy are bunk  —  They're also amazingly hypocritical. … While Democrats wasted no time this week rallying around Kamala Harris, Republicans were just as quick to start trying to sabotage her campaign with lawfare.  —  It isn't surprising that the GOP is taking this approach.",
    "url": "https://www.publicnotice.co/p/trump-legal-challenges-harris-candidacy-bunk"
  },
  {
    "text": "July 2024 Swing State Polls: Harris Trails Trump in Arizona, Georgia, Michigan, Pennsylvania, Tied in Wisconsin  —  Home Polls July 2024 Swing State Polls: Harris Trails Trump in Arizona, Georgia, Michigan, Pennsylvania, Tied in Wisconsin  —  Majority of Democrats in Swing States Say Harris Should be Nominated at DNC",
    "url": "https://emersoncollegepolling.com/july-2024-swing-state-polls-harris-trails-trump-in-arizona-georgia-michigan-pennsylvania-tied-in-wisconsin/"
  },
  {
    "text": "Half-dozen Dems join GOP in condemning Harris' work on the border  —  House Republicans used their slim majority on Thursday to target Vice President Kamala Harris — and some Democrats backed the effort.  The House passed a resolution criticizing Harris for her work on the border in a 220-196 vote … ",
    "url": "https://www.politico.com/live-updates/2024/07/25/congress/house-condemns-harris-on-border-00171124"
  },
  {
    "text": "Harris Narrows Gap Against Trump, Times/Siena Poll Finds  —  In a survey taken after President Biden stepped aside, Donald Trump and Kamala Harris are locked in a tight race separated by a single percentage point among likely voters.  —  Vice President Kamala Harris begins a 103-day sprint … ",
    "url": "https://www.nytimes.com/2024/07/25/us/politics/poll-kamala-harris-donald-trump.html?unlocked_article_code=1.900.06G-.kJcgU8BhCMl6&smid=url-share"
  },
  {
    "text": "‘Trump Is Old And Quite Weird’: Kamala Harris Camp Hits Back At ‘78-Year-Old Criminal’ Trump's Fox News Interview  —  Harris for President tore into former President Donald Trump over a Fox News interview in which he referred to Vice President Kamala Harris as “garbage” among other things.",
    "url": "https://www.mediaite.com/news/kamala-harris-campaign-takes-aim-at-trumps-age-in-response-to-fox-news-interview-78-year-old-criminal/"
  },
  {
    "text": "Harris says she's ready to debate Trump and accuses him of ‘backpedaling’ from Sept. 10 faceoff  —  Vice President Kamala Harris says she's “ready to debate Donald Trump.”  She accused Trump of “backpedaling” away from a previous agreement for a debate hosted by ABC News on Sept. 10.",
    "url": "https://apnews.com/article/donald-trump-kamala-harris-83872f2a0339044795d2884cfab899c4"
  },
  {
    "text": "Melania Trump to tell her story in memoir, ‘Melania,’ scheduled for this fall  —  Former first lady Melania Trump has a memoir coming out this fall, “Melania,” billed by her office as “a powerful and inspiring story of a woman who has carved her own path, overcome adversity and defined personal excellence.”",
    "url": "https://apnews.com/article/melania-trump-memoir-first-lady-0461dbb098a2218d41fbe7960c05a1a5"
  },
  {
    "text": "Blake Masters: ‘Political leaders should have children’  —  Masters is locked in a contentious GOP House primary in Arizona.  —  Most Republicans want nothing to do with Sen. JD Vance's resurfaced attack on Vice President Kamala Harris and other Democrats as “childless cat ladies.”",
    "url": "https://www.politico.com/news/2024/07/25/blake-masters-political-leaders-children-00171216"
  },
  {
    "text": "Future Forward launches a $50 million pre-convention ad blitz for Harris  —  The new ad backup counters a short-term advantage Republicans have had in swing states since Sunday.  —  The Kamala Harris ad blitz has launched.  —  Future Forward, the largest Democratic-leaning super PAC … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/25/harris-future-forward-ads/"
  },
  {
    "text": "J.D. Vance Endorsed Book That Calls Progressives “Unhumans” and Praises Jan. 6 Rioters  —  The GOP veep candidate embraced the extreme view that today's left is part of a centuries-long effort to “destroy” civilization.  —  During his acceptance speech at the Republican convention last week … ",
    "url": "https://www.motherjones.com/politics/2024/07/jd-vance-unhumans-book-jack-posobiec-alt-right-january-6/"
  },
  {
    "text": "Newsom Orders California Officials to Remove Homeless Encampments  —  The directive from Gov. Gavin Newsom is the nation's most sweeping response to a Supreme Court decision last month that gave local leaders greater authority to remove homeless campers.  —  Gov. Gavin Newsom ordered … ",
    "url": "https://www.nytimes.com/2024/07/25/us/newsom-homeless-california.html?unlocked_article_code=1.900.Nmzh.O0WaaYpN9Npy&smid=url-share"
  },
  {
    "text": "Fearing a Trump takeover, Justice Department alumni endorse Kamala Harris  —  Former DOJ officials warned in a new letter that the “fabric of the nation, the rule of law and the future of the Democracy are at stake in this election.”  —  For Justice Department employees who had spent weeks contemplating … ",
    "url": "https://www.nbcnews.com/politics/2024-election/justice-department-endorse-kamala-harris-fear-trump-rcna163069"
  },
  {
    "text": "Justice Kagan calls for a way to enforce Supreme Court ethics code  —  Justice Elena Kagan suggested Chief Justice John G. Roberts Jr. could appoint an outside panel of highly respected judges to review allegations of wrongdoing.  —  SACRAMENTO, Calif. — Justice Elena Kagan said Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/25/supreme-court-kagan-ethics-code-reform/"
  },
  {
    "text": "Elon Musk's trans daughter Vivian Wilson slams his anti-LGBTQ+ comments as ‘ketamine-fueled haze’  —  Vivian Wilson is fact-checking own father after billionaire Elon Musk made bigoted comments about her gender.  —  The billionaire recently attacked gender-affirming care in an interview … ",
    "url": "https://www.advocate.com/elon-musk-trans-daughter-vivian-wilson"
  },
  {
    "text": "Tim Walz Would Make a Great Running Mate  —  Kamala Harris apparently needs a white dude.  They don't come better—or whiter—than this.  —  Minnesota Gov. Tim Walz, center, standing with New York Gov. Kathy Hochul, left, and Maryland Gov. Wes Moore, talks with reporters following their meeting … ",
    "url": "https://prospect.org/politics/2024-07-25-tim-walz-would-make-great-running-mate/"
  },
  {
    "text": "Polls show some good early signs for Kamala Harris  —  There are signs she has gained among some key groups.  But the race remains close — and stubbornly so.  —  Welcome to The Campaign Moment, your guide to the biggest developments in a stubborn 2024 race that's showing some signs of being shaken up.",
    "url": "https://www.washingtonpost.com/politics/2024/07/25/harris-polls-trump-young-black-hispanic-voters/"
  },
  {
    "text": "Crime Trends in U.S. Cities: Mid-Year 2024 Update  —  Senior Research Specialist, Council on Criminal Justice  —  Graduate Research Assistant, University of Missouri-St. Louis  —  The authors thank John Roman, director of the Center on Public Safety and Justice at NORC at the University of Chicago … ",
    "url": "https://counciloncj.org/crime-trends-in-u-s-cities-mid-year-2024-update/"
  },
  {
    "text": "Kamala Harris Appears on 'RuPaul's Drag Race All Stars' to Advocate for Voting: ‘Make Sure Your Voice Is Heard’  —  Kamala Harris will appear on the season nine finale of “RuPaul's Drag Race All Stars” advocating for voting.  —  Set to air this Friday on Paramount+, the episode will begin … ",
    "url": "https://variety.com/2024/tv/news/kamala-harris-appears-on-rupauls-drag-race-all-stars-voting-1236083985/"
  },
  {
    "text": "July 24, 2024  —  Tonight, President Joe Biden explained to the American people why he decided to refuse the 2024 Democratic presidential nomination and hand the torch to Vice President Kamala Harris.  —  Speaking from the Oval Office from his seat behind the Resolute Desk … ",
    "url": "https://heathercoxrichardson.substack.com/p/july-24-2024"
  },
  {
    "text": "Pentagon panel to review Medals of Honor given to soldiers at the Wounded Knee massacre  —  The Defense Department will review the Medals of Honor that were given to 20 U.S. soldiers for their actions in the 1890 battle at Wounded Knee to make sure their conduct merits such an honorable award.",
    "url": "https://apnews.com/article/pentagon-medals-soldiers-wounded-knee-7c6a7cfd2b2d9ce6b4ce0d9731439cb4"
  }
]