[
  {
    "text": "GOP leaders face unrest amid chaotic, bungled votes  —  Former president Donald Trump has used his perch as the GOP frontrunner to bend Congress to his political whims  —  Moments before pandemonium broke out on the House floor on Tuesday evening, House Majority Whip Tom Emmer approached Rep. Ken Buck … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/07/republicans-disarray-house-senate-border/"
  },
  {
    "text": "The Biden administration is considering executive action to deter illegal migration at the southern border  —  With border security legislation unlikely in Congress, the White House wants to take action.  Migrant crossings are expected to soar back to last year's record levels.",
    "url": "https://www.nbcnews.com/politics/immigration/biden-administration-weighs-executive-action-border-migrants-rcna137804?taid=65c43b6c8b17820001a58e0e"
  },
  {
    "text": "House GOP had lowest win rate on ‘party unity’ votes since 1982  —  Vote Studies annual tally finds minority Democrats won nearly one-third of divided votes  —  House Republicans last year were the least unified party bloc on legislation in more than four decades, CQ Roll Call's annual Vote Studies analysis … ",
    "url": "https://rollcall.com/2024/02/08/house-gop-had-lowest-win-rate-on-party-unity-votes-since-1982/"
  },
  {
    "text": "Joe Biden is currently losing the election  —  I try not to spend my days being a doomer or a catastrophist, but in both casual and formal conversations I've come to think that there is one very basic point about politics in 2024 that is being broadly underrated — Joe Biden is currently … ",
    "url": "https://www.slowboring.com/p/joe-biden-is-currently-losing-the"
  },
  {
    "text": "Marianne Williamson suspends her presidential campaign, ending long-shot primary challenge to Biden  —  Self-help author and spiritual guru Marianne Williamson on Wednesday announced the end of her long-shot Democratic challenge to President Joe Biden.  The 71-year-old onetime spiritual adviser … ",
    "url": "https://apnews.com/article/marianne-williamson-campaign-election-2024-76505d653c2f06f703bd5755c6cb9908"
  },
  {
    "text": "Biden and Trump jockey for an edge amid the rubble of the border deal  —  Democrats say Trump is now responsible for border chaos.  Republicans say Biden's three-year record on immigration will hurt him with voters.  —  President Biden and his aides say the swift collapse … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/08/border-deal-implosion-could-reset-immigration-debate/"
  },
  {
    "text": "Meet the lawyers arguing Trump's Supreme Court Colorado ballot case  —  One is a familiar face at the Supreme Court and a former Texas solicitor general.  The other is appearing before the high court for the first time.  Both have experience as law clerks to Supreme Court justices.",
    "url": "https://www.washingtonpost.com/politics/2024/02/07/lawyers-supreme-court-trump-ballot-case/"
  },
  {
    "text": "How Mark Meadows Became the Least Trusted Man in Washington  —  The untold story of the rise and fall of Trump's former chief of staff — and his role in the prosecutions that may determine the 2024 election.  —  On most Monday mornings, Mark Meadows commutes from his home in South Carolina to his workplace in Washington.",
    "url": "https://www.nytimes.com/2024/02/08/magazine/mark-meadows-trump-prosecution.html"
  },
  {
    "text": "Playbook: SCOTUS has entered the 2024 chat  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  JUST POSTED — “How Mark Meadows Became the Least Trusted Man in Washington,” by Robert Draper in NYT Magazine: “Court documents that remain under seal … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/08/scotus-has-entered-the-2024-chat-00140321"
  },
  {
    "text": "Bounced cheques and Trump's ‘unpaid fees’: Rudy Giuliani lays bare his finances in bankruptcy hearing  —  Over three hours in the fifth-floor room of a court building, Donald Trump's one-time attorney reeled off a list of assets that revealed the strained state of his finances, from a Bronx storage unit to a $1m tax bill.",
    "url": "https://www.the-independent.com/news/world/americas/us-politics/rudy-giuliani-bankruptcy-hearing-donald-trump-b2492575.html"
  },
  {
    "text": "Judge denies Trump's motion for mistrial  —  Judge Lewis Kaplan on Wednesday denied former President Trump's motion for a mistrial following Trump's conviction for defaming E. Jean Carroll.  —  Trump's attorney Alina Habba moved for a mistrial after Carroll testified she had deleted … ",
    "url": "https://abcnews.go.com/US/live-updates/trump-defamation-trial/judge-denies-trumps-motion-for-mistrial-107040181?id=106403966"
  },
  {
    "text": "Biden classified document case ends without charges  —  Attorney General Merrick Garland notified Congress that the special counsel had concluded his investigation.  —  An independent investigation into classified documents found at the home of President Joe Biden and a think tank office … ",
    "url": "https://www.politico.com/news/2024/02/07/biden-classified-document-case-ends-without-charges-00140271"
  },
  {
    "text": "Exclusive: Tucker Carlson Could Face Sanctions Over Putin Interview  —  Tucker Carlson's interview with Russian President Vladimir Putin could see the conservative pundit targeted by European Union lawmakers, current and former members of the European Parliament have told Newsweek.",
    "url": "https://www.newsweek.com/tucker-carlson-sanctions-eu-putin-interview-1867655"
  },
  {
    "text": "Domination or Dissolution, Rule or Ruin  —  Whenever you are weighing in on politics, society, and culture, ask yourself: Would you feel comfortable making this argument directly to the face of the people whose lives, rights, and dignity are most immediately affected by the issue in question?",
    "url": "https://thomaszimmer.substack.com/p/domination-or-dissolution-rule-or"
  },
  {
    "text": "Caitlyn Jenner Faces Right-Wing Rage for Backing Trump on Bud Light  —  Some rightwing personalities are still not willing to accept the brand after its partnership with trans influencer Dylan Mulvaney.  —  Olympic champion Caitlyn Jenner is facing a slew of vicious anti-trans attacks … ",
    "url": "https://www.thedailybeast.com/caitlyn-jenner-faces-anti-trans-right-wing-rage-for-backing-trump-on-bud-light"
  },
  {
    "text": "Gaetz ousted McCarthy.  Now he's moving on to another House GOP target.  —  “I never considered Matt a threat,” Rep. Mike Bost (R-Ill.) said of the Floridian's visit to his backyard.  “I considered him an ass, but never a threat.”",
    "url": "https://www.politico.com/live-updates/2024/02/07/congress/gaetzs-mission-00140205"
  },
  {
    "text": "Top Republican, flush with corporate cash, embraces racist conspiracy theory  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  Proponents of the great replacement theory in the United States claim that Democrats are attempting to “replace” white Americans with non-white immigrants.",
    "url": "https://popular.info/p/top-republican-flush-with-corporate"
  },
  {
    "text": "Loyalty is a one-way street in Donald Trump's GOP.  Just ask Ronna McDaniel  —  The Republican National Committee chair is expected to step down this spring.  —  For seven tumultuous years, Ronna McDaniel accomplished a feat that eluded almost everyone else in Donald Trump's orbit: She held on.",
    "url": "https://www.politico.com/news/2024/02/08/ronna-mcdaniel-trump-step-down-00140291"
  }
]