[
  {
    "text": "McCarthy behind move to kick Pelosi out of her office, sources say — so he can move into it  —  Kevin McCarthy was behind interim Speaker Patrick McHenry's move to kick former House Speaker Nancy Pelosi and former Majority Leader Steny Hoyer out of their office spaces, two Republican sources told CNN.",
    "url": "https://www.cnn.com/2023/10/03/politics/pelosi-vacate-office-capitol-mchenry-interim-speaker/"
  },
  {
    "text": "'He's about clicks': Florida Republicans furious at Gaetz  —  They called him divisive and an attention-seeker.  —  MIAMI — Florida's congressional Republicans are done with Matt Gaetz.  —  They left the House chamber last night furious after Gaetz led seven other GOP members … ",
    "url": "https://www.politico.com/news/2023/10/04/florida-republicans-matt-gaetz-furious-00119865"
  },
  {
    "text": "GOP tensions explode after McCarthy bows out of speaker race  —  House Republicans were distraught, furious and concerned for the future of their party after Rep. Kevin McCarthy (R-Calif.) announced he won't run for speaker again after being ousted on Tuesday.",
    "url": "https://www.axios.com/2023/10/04/house-republicans-kevin-mccarthy-removal-speaker"
  },
  {
    "text": "Gaetz knocks Speaker pro tem for sending lawmakers home to ‘cry for a week’  —  Rep. Matt Gaetz (R-Fla.) is already taking aim at Speaker pro tempore Patrick McHenry (R-N.C), saying that he should not send lawmakers home for the next week.  —  “I do have to offer some pretty sharp criticism … ",
    "url": "https://thehill.com/homenews/house/4237607-gaetz-knocks-mchenry-for-sending-lawmakers-home/"
  },
  {
    "text": "Nancy Pelosi evicted from her private office in the Capitol by interim House speaker  —  McHenry assumed the temporary speakership after now-former House Speaker Kevin McCarthy was ousted on Tuesday  —  Former House Speaker Nancy Pelosi, D-Calif., was evicted from her private Capitol office by the new speaker pro-tempore.",
    "url": "https://www.foxnews.com/politics/nancy-pelosi-evicted-private-office-capitol-interim-house-speaker"
  },
  {
    "text": "PA 2024 Elections: Casey Leads McCormick In U.S. Senate Race, Quinnipiac University Pennsylvania Poll Finds; Race For The White House: Biden vs. Trump Matchup Barely Budges  —  mail_outline  —  Roughly two weeks after Republican David McCormick announced he would challenge incumbent Democratic … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3879"
  },
  {
    "text": "Giuliani's Drinking, Long a Fraught Subject, Has Trump Prosecutors' Attention  —  The former mayor's drinking has become an investigative subplot in Donald Trump's federal case over 2020 election interference.  But long before that, friends had grown deeply concerned.",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/rudy-giuliani-drinking.html"
  },
  {
    "text": "Giuliani: ‘I have never had an alcohol problem’  —  Former Trump lawyer Rudy Giuliani vehemently denied having a drinking problem Wednesday, following the Times report.  —  Former Trump lawyer and adviser Rudy Giuliani vehemently denied having a drinking problem Wednesday … ",
    "url": "https://www.politico.com/news/2023/10/04/rudy-giuliani-drinking-00119923"
  },
  {
    "text": "Inside the Menendez Indictment: A Mercedes and a Secretive Fatal Crash  —  A 2018 fatal car crash in Bogota, N.J., drew no media attention and resulted in no charges.  The driver was the soon-to-be wife of Senator Robert Menendez.  —  It was a cold evening in December 2018, and Nadine Arslanian … ",
    "url": "https://www.nytimes.com/2023/10/04/nyregion/nadine-menendez-mercedes-death.html"
  },
  {
    "text": "Bob Menendez's wife hit and killed a man while driving on Bogota's Main Street in 2018  —  Nadine Arslanian Menendez, federally indicted in a bribery scheme with her husband, Sen. Bob Menendez, struck and killed a man while driving her Mercedes-Benz on Main Street in Bogota in December 2018.",
    "url": "https://www.northjersey.com/story/news/new-jersey/2023/10/04/bob-menendez-wife-car-accident-bogota-nj-police-indictment/71051427007/"
  },
  {
    "text": "Trump is not ruling out being the new House speaker  —  Believe it or not, the House speaker doesn't actually have to be serving in the House.  —  Trump addresses calls for him to be the next House speaker  —  Does Donald Trump want to be speaker of the House?",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-not-ruling-new-house-speaker-rcna118794"
  },
  {
    "text": "Biden Cancels an Additional $9 Billion in Student Loan Debt  —  The move comes just three days after student loan repayments resumed following a three-year pause.  —  President Biden canceled an additional $9 billion in student debt on Wednesday as repayments started up again this month after a three-year pause.",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/biden-student-loans.html"
  },
  {
    "text": "‘Sabrina’ Star Julia Ormond Sues Harvey Weinstein for Sexual Assault  —  The lawsuit filed on Wednesday also names Disney and CAA for allegedly telling her to stay quiet about her 1995 assault.  —  An English actress has filed a lawsuit against Harvey Weinstein, claiming the disgraced movie mogul sexually assaulted her in 1995.",
    "url": "https://www.thedailybeast.com/english-actress-julia-ormond-sues-harvey-weinstein-for-sexual-assault"
  },
  {
    "text": "Elon Musk's Machine for Fascism: A Tale of Three Elections  —  Since the spring (when I first started writing this post), I've been trying to express what I think Elon Musk intended to do with his $44 billion purchase of Twitter, to turn it into a Machine for Fascism.",
    "url": "https://www.emptywheel.net/2023/10/04/elon-musks-machine-for-fascism-a-tale-of-three-elections/"
  },
  {
    "text": "Exclusive: US will transfer weapons seized from Iran to Ukraine  —  The US will transfer thousands of seized Iranian weapons and rounds of ammunition to Ukraine, in a move that could help to alleviate some of the critical shortages facing the Ukrainian military as it awaits more money … ",
    "url": "https://www.cnn.com/2023/10/04/politics/us-iran-seized-weapons-ukraine/"
  },
  {
    "text": "Support for Third U.S. Political Party Up to 63%  —  WASHINGTON, D.C. — Sixty-three percent of U.S. adults currently agree with the statement that the Republican and Democratic parties do “such a poor job” of representing the American people that “a third major party is needed.”",
    "url": "https://news.gallup.com/poll/512135/support-third-political-party.aspx"
  },
  {
    "text": "Capitol rioter who attacked Reuters cameraman and police officer gets more than 4 years in prison  —  A man who attacked a police officer and a Reuters cameraman during the U.S. Capitol riot was sentenced on Wednesday to more than four years in prison.  —  Shane Jason Woods, 45 … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/04/capitol-riot-reuters-cameraman-shane-woods/d440d4dc-62dc-11ee-b406-3ea724995806_story.html"
  },
  {
    "text": "Officiant fires gun to welcome bride, shoots grandson — and wedding goes on  —  Michael Gardner wanted to start his nephew's wedding with a bang.  —  His plan involved shooting a blank from a revolver into the air to signal to the roughly 200 people gathered on Saturday that the outdoor ceremony … ",
    "url": "https://www.washingtonpost.com/nation/2023/10/04/wedding-officiant-shoots-grandson-michael-gardner-nebraska/"
  }
]