[
  {
    "text": "Fox News Poll: Harris is ahead of Trump by 3 points in Georgia  —  Georgians trust Harris over Trump on helping the middle class by 7 points  —  In a head-to-head matchup, Vice President Kamala Harris tops former President Trump by 3 percentage points in a Fox News survey of Georgia voters.",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-harris-ahead-trump-3-points-georgia"
  },
  {
    "text": "Harris multiplied Biden's lead among young voters  —  Good morning, Early Birds.  We're thinking of our readers in Florida today as Hurricane Helene bears down.  Stay safe out there!  Send tips to earlytips@washpost.com.  Thanks for waking up with us.  —  In today's edition … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/27/harris-multiplied-bidens-lead-among-young-voters/"
  },
  {
    "text": "Donald Trump holds lead over Kamala Harris in Arizona, exclusive poll finds  —  With less than six weeks until the general election, former President Donald Trump holds an edge over Vice President Kamala Harris in the key battleground state of Arizona, according to an exclusive new USA TODAY/Suffolk University poll.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/27/exclusive-poll-arizona-trump-leads-harris/75385504007/"
  },
  {
    "text": "Why Romney is resisting pressure to endorse Harris  —  “People know where I stand on Donald Trump and that's enough,” Romney told The Post.  But Harris would still welcome his endorsement.  —  As Election Day nears and a parade of anti-Trump Republicans announce their support … ",
    "url": "https://www.washingtonpost.com/elections/2024/09/27/romney-resists-harris-endorsement/"
  },
  {
    "text": "Maybe It's Not the Economy, Stupid? … Americans should not be miserable about the economy.  But they are.  President Joe Biden should not be considered a poorer steward of the economy than former President Donald Trump.  But he is.  And if Americans really think Biden did a bad job on the economy … ",
    "url": "https://newrepublic.com/article/186298/harris-trump-not-economy-stupid"
  },
  {
    "text": "Read the JD Vance Dossier  —  We publish what others won't.  Subscribe to support our work and for updates on this breaking story.  —  Behold the dossier.  —  It reportedly comes from an alleged Iranian government hack of the Trump campaign, and since June, the news media has been sitting on it … ",
    "url": "https://www.kenklippenstein.com/p/read-the-jd-vance-dossier"
  },
  {
    "text": "What Vance's Vetters Missed  —  The most notable thing about the leaked dossier is what was left out of it.  —  Devastating scenes out of Florida last night after Hurricane Helene slammed into the state's Big Bend, leaving at least six people dead and knocking out power for millions of others across the Southeast.",
    "url": "https://www.thebulwark.com/p/what-vances-vetters-missed"
  },
  {
    "text": "DNC will send funding to all state parties to support down-ballot races  —  The nearly $2.5 million investment is the first time the national party has sent funding to every one of its state counterparts.  —  The Democratic National Committee is sending money to every state Democratic party … ",
    "url": "https://www.politico.com/news/2024/09/27/dnc-state-party-legislative-races-00181312"
  },
  {
    "text": "The DNC Has So Much Money That It's Now Spending in Idaho  —  Democrats are investing in races far down-ballot in states they're not competing in nationally.  — Copy  —  Democrats have raised so much money since Kamala Harris became their presidential nominee that even Republican strongholds … ",
    "url": "https://www.notus.org/democrats/dnc-spending-red-states"
  },
  {
    "text": "Jack Smith files evidence in Trump 2020 election subversion case  —  The special counsel's submission is being kept under wraps, for now.  —  Special counsel Jack Smith has filed a detailed compilation of evidence he's assembled to support charges that former President Donald Trump broke federal law … ",
    "url": "https://www.politico.com/news/2024/09/26/jack-smith-election-subversion-brief-00181331"
  },
  {
    "text": "Trump to meet Zelensky, opening new chapter in a fraught relationship  —  The meeting will be their first since 2019 and will happen in the final stage of a U.S. presidential race that has put a spotlight on partisan divisions over the war in Ukraine.  —  NEW YORK — Donald Trump will meet … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/27/trump-zelensky-ukraine-war-harris/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NDA5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4NzkxOTk5LCJpYXQiOjE3Mjc0MDk2MDAsImp0aSI6IjA5M2UyYzk1LTQ2NjctNDc0MC1hYzUyLWU4MTM3ZDhkODNhMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzI3L3RydW1wLXplbGVuc2t5LXVrcmFpbmUtd2FyLWhhcnJpcy8ifQ.Awrm8co4y6wxsaQaMoZ-49J8yQIIXLCAc1K4pbk370w&itid=gfta"
  },
  {
    "text": "58 percent favor electing presidents based on popular vote: Gallup  —  A near majority of Americans favor amending the Constitution in order to elect presidents based on the popular vote, according to a poll released Friday.  —  The Gallup survey found that 58 percent of Americans are in favor … ",
    "url": "https://thehill.com/homenews/campaign/4902991-many-favor-electing-presidents-based-on-popular-vote-gallup/"
  },
  {
    "text": "JD Vance, in 2020 messages, said Trump ‘thoroughly failed to deliver’  —  In previously undisclosed messages, the future vice-presidential nominee said Trump had not fulfilled his economic agenda and predicted he would lose to Biden.  —  Vice-presidential nominee JD Vance has a go-to explanation … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/27/jd-vance-messages-trump-criticism-2020/"
  },
  {
    "text": "Newsmax and Smartmatic settle 2020 election defamation case on eve of trial  —  The pro-Trump cable outlet Newsmax and voting technology company Smartmatic settled a major defamation lawsuit Thursday in a last-minute agreement, averting a high-stakes trial over the airing of false 2020 election claims.",
    "url": "https://www.cnn.com/2024/09/26/media/newsmax-smartmatic-settle-defamation-case"
  },
  {
    "text": "John Roberts Doesn't Want You to Vote  —  Donald Trump is certainly going to lose the popular vote, like he did in 2020 and 2016.  —  Donald Trump is probably going to lose the Electoral vote, like he did in 2020.  —  But if the latter is close—and thanks to the antidemocratic architecture … ",
    "url": "https://gregolear.substack.com/p/john-roberts-doesnt-want-you-to-vote"
  },
  {
    "text": "Election 2024 Video of the Week: Trump's Bonkers Economic Plan  —  This week's Election 2024 Video of the Week focuses on Trump's bizarre economic plan.  —  To remind you, the goal of this series is not to preach to the converted but to give you facts, analysis, and arguments to share with those who aren't.",
    "url": "https://robertreich.substack.com/p/election-2024-video-of-the-week-trumps"
  },
  {
    "text": "RFK Jr's chaos campaign to support Trump  —  He says he doesn't want to be a spoiler, but he's spoiling pretty hard. … On August 23, Robert F. Kennedy, Jr. suspended his presidential campaign.  Citing the war in Ukraine and the “war on our children,” as well as “relentless … ",
    "url": "https://www.publicnotice.co/p/rfk-jr-chaos-campaign-to-support-trump"
  },
  {
    "text": "A dual win for consumers: Inflation cooled last month, paving way for borrowing costs to come down more  —  New York CNN  —  Americans and Federal Reserve officials have news to celebrate: Inflation cooled significantly last month, likely giving central bankers more confidence to continue cutting interest rates.",
    "url": "https://www.cnn.com/2024/09/27/economy/us-pce-inflation-august"
  },
  {
    "text": "The Kleptocracy Club  —  Autocrats dump their democratic allies and keep the company of kleptocrats.  —  Since the earliest days of the republic, America's international friendships have shaped domestic politics.  And some of those friendships helped America strengthen its democratic principles.",
    "url": "https://www.theatlantic.com/podcasts/archive/2024/09/kleptocracy-club/680022/"
  },
  {
    "text": "Trump Media shareholder UAV dumped nearly 11 million shares … United Atlantic Ventures LLC, a major shareholder in Trump Media, has sold or otherwise gotten rid of nearly 11 million shares in the company, according to a regulatory filing Thursday.  —  The move left UAV, a partnership of former … ",
    "url": "https://www.cnbc.com/2024/09/26/trump-media-shareholder-dumped-more-than-7point5-million-shares.html"
  },
  {
    "text": "Millions of Vehicles Could Be Hacked and Tracked Thanks to a Simple Website Bug  —  Researchers found a flaw in a Kia web portal that let them track millions of cars, unlock doors, and start engines at will—the latest in a plague of web bugs that's affected a dozen carmakers.",
    "url": "https://www.wired.com/story/kia-web-vulnerability-vehicle-hack-track/"
  }
]