[
  {
    "text": "Republicans rush to distance from “disaster” Arizona abortion ruling … - Just on Monday, former President Trump put vulnerable House Republicans at ease by stopping short of endorsing a nationwide abortion ban. … - The 19th century law provides exceptions only to save the life of the mother.",
    "url": "https://www.axios.com/2024/04/09/arizona-abortion-ban-republicans-supreme-court"
  },
  {
    "text": "Abortion in Arizona set to be illegal in nearly all circumstances, state high court rules  —  The Arizona Supreme Court upheld a 160-year-old abortion ban that could shutter abortion clinics in the state.  —  The ruling indicated the ban can only be “prospectively enforced” and enforcement of the law is stayed for 14 days.",
    "url": "https://www.azcentral.com/story/news/politics/arizona/2024/04/09/arizona-abortion-law-state-supreme-court-upholds-near-total-ban/73251148007/"
  },
  {
    "text": "Arizona Supreme Court rules that a near-total abortion ban from 1864 is enforceable  —  The bombshell decision adds the state to the growing lists of places where abortion care is effectively banned.  —  PHOENIX — The Arizona Supreme Court ruled Tuesday that a 160-year-old near-total abortion ban still … ",
    "url": "https://www.nbcnews.com/politics/arizona-supreme-court-ruling-abortion-ban-rcna146915"
  },
  {
    "text": "Kari Lake disavows Arizona abortion ban ruling … - “I oppose today's ruling, and I am calling on [Democratic Gov.] Katie Hobbs and the State Legislature to come up with an immediate common sense solution that Arizonans can support,” Lake said in a statement.",
    "url": "https://www.axios.com/2024/04/09/kari-lake-arizona-abortion-ban"
  },
  {
    "text": "Operatives must pay up to $1.25 million for robocall scheme to suppress Black votes  —  Two right-wing political operatives must pay up to $1.25 million in fines after they were found liable for launching a robocall campaign designed to keep Black New Yorkers from voting in the 2020 election … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/09/settlement-new-york-robocalls-black-voters/"
  },
  {
    "text": "Attorney General James Secures Up to $1.25 Million from Conspiracy Theorists Who Intimidated Black Voters with Threatening Robocalls  —  Jacob Wohl and Jack Burkman Targeted Black Voters with Robocall Campaign to Suppress the Vote Ahead of the 2020 Election  —  NEW YORK - New York Attorney … ",
    "url": "https://ag.ny.gov/press-release/2024/attorney-general-james-secures-125-million-conspiracy-theorists-who-intimidated"
  },
  {
    "text": "Biden is building a behemoth of a campaign.  Trump at this point seems to be playing catch-up.  —  Biden is flush with cash and opening campaign offices across the country but has struggled to overcome Trump and his more meager campaign in the polls.  —  PHILADELPHIA — President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-building-behemoth-campaign-trump-point-seems-playing-catch-rcna145903"
  },
  {
    "text": "Becerra weighs exit from Biden administration for California gubernatorial bid  —  Health Secretary Xavier Becerra, the former California attorney general, would jump into an already crowded field of Democratic contenders.  —  SACRAMENTO, California — Health and Human Services Secretary Xavier Becerra … ",
    "url": "https://www.politico.com/news/2024/04/09/biden-cabinet-secretary-california-governors-race-00151407"
  },
  {
    "text": "RFK Jr. campaign official attended Jan. 6 ‘Stop the Steal’ rally and wanted ‘favorite President’ Trump to run for third term  —  A New York-based campaign official for Robert F. Kennedy Jr. who raised the possibility that voting for the independent presidential candidate would help Donald … ",
    "url": "https://www.cnn.com/2024/04/09/politics/rfk-jr-campaign-official-january-6-trump"
  },
  {
    "text": "Letitia James Nears Green Light to Start Taking Donald Trump's Assets  —  The New York Attorney General may start collecting Trump assets if he fails to post a bond by next Monday, a leading real estate lawyer has said.  —  Paul Golden, author of Litigating Constructive Trusts and a partner … ",
    "url": "https://www.newsweek.com/donald-trump-judge-arthur-engoron-fraud-case-bond-manhattan-new-york-letitia-james-1888535"
  },
  {
    "text": "I've Been at NPR for 25 Years.  Here's How We Lost America's Trust.  —  Uri Berliner, a veteran at the public radio institution, says the network lost its way when it started telling listeners how to think.  —  You know the stereotype of the NPR listener: an EV-driving, Wordle-playing, tote bag-carrying coastal elite.",
    "url": "https://www.thefp.com/p/npr-editor-how-npr-lost-americas-trust"
  },
  {
    "text": "Transmittal No  —  The State Department has made a determination approving a possible Foreign Military Sale to the Government of Ukraine of HAWK Phase III Missile System Sustainment and related elements of logistics and program support for an estimated cost of $138 million.",
    "url": "https://www.dsca.mil/press-media/major-arms-sales/ukraine-hawk-phase-iii-missile-system-sustainment"
  },
  {
    "text": "Florida woman who stole, sold Biden's daughter's diary sentenced to 1 month in prison  —  Aimee Harris took diary belonging to Ashley Biden, sold it to Project Veritas, a conservative group known for conducting hidden-camera stings  —  A Florida woman who stole the diary of President Biden's daughter … ",
    "url": "https://www.foxnews.com/politics/florida-woman-stole-sold-bidens-daughters-diary-sentenced-one-month-prison"
  },
  {
    "text": "Texas Attorney General sues to stop guaranteed income program for Houston-area residents  —  HOUSTON (AP) — Texas' attorney general filed a lawsuit on Tuesday seeking to stop a guaranteed income program set to start this month for Houston-area residents.  —  The program by Harris County … ",
    "url": "https://apnews.com/article/lawsuit-guaranteed-income-program-texas-harris-county-d875494123a749a90b74e1f06c218468"
  },
  {
    "text": "Alabama secretary of state says Democratic convention too late to get Biden on ballot this fall  —  Alabama Secretary of State Wes Allen has notified the state and national Democratic parties that the scheduled date of the Democratic National Convention is a few days after the deadline … ",
    "url": "https://www.al.com/news/2024/04/alabama-secretary-of-state-says-democratic-convention-too-late-to-get-biden-on-ballot-this-fall.html"
  },
  {
    "text": "Gen Z Is Ruining Scrabble Now!  —  Some things are sacred.  —  Christmas.  Easter.  The Final Four.  And, of course, Scrabble.  —  Gen Z—or, more correctly, the adults who taught them that everybody deserves a medal for participation—has turned their back on all of them.",
    "url": "https://hotair.com/david-strom/2024/04/09/gen-z-is-ruining-scrabble-now-n3786197"
  },
  {
    "text": "Michigan Republican Candidate Caught Living in Florida  —  A Republican hoping to represent Michigan in the U.S. Senate suffered a setback to his campaign this week after facing allegations that he lives in Florida.  —  Former Congressman Mike Rogers, who has made much of his local roots … ",
    "url": "https://www.newsweek.com/michigan-republican-candidate-living-florida-mike-rogers-1888388"
  },
  {
    "text": "Is Team Trump meddling in the Middle East?  —  Earth Week came early this April!  Experiencing Friday's earthquake at the dog park with Daisy — which I thought was another Biden-in-Delaware F-15 scramble until I looked up and there was no plane — was an unexpected jolt.",
    "url": "https://www.inquirer.com/columnists/attytood/trump-liv-golf-saudi-mbs-netanyahu-20240409.html"
  },
  {
    "text": "Chechnya is banning music that's too fast or slow.  These songs wouldn't make the cut  —  Authorities in the Russian republic of Chechnya are banning music they consider either too fast or too slow, effectively criminalizing many genres.  —  The Chechen Ministry of Culture announced the ban … ",
    "url": "https://npr.org/2024/04/09/1243632570/chechnya-music-ban-bpm"
  },
  {
    "text": "Sheila Jackson Lee Claims Moon Is Made Of ‘Gases’  —  Democratic Texas Rep. Sheila Jackson Lee claimed Monday the moon is made out of gases during a solar eclipse viewing event at Booker T. Washington High School in Houston, Texas.  —  Lee, the former Ranking Member on the House Space … ",
    "url": "https://dailycaller.com/2024/04/09/sheila-jackson-lee-moon-gases/"
  },
  {
    "text": "Zelensky says he doesn't need ‘primitive’ ideas from Trump on Ukraine  —  Ukrainian President Volodymyr Zelensky said in a Tuesday interview that he does not need “primitive” ideas from former President Trump on ways to resolve the war with Russia.  —  In an interview with Axel Springer media outlets … ",
    "url": "https://thehill.com/policy/international/4583975-zelensky-trump-primitive-ideas-ukraine/"
  },
  {
    "text": "F.A.A. Investigates Claims by Boeing Whistle-Blower About Flaws in 787 Dreamliner  —  The whistle-blower, an engineer, says that sections of the plane's body are being assembled in a way that could weaken the aircraft over time.  Boeing says there is no safety issue.",
    "url": "https://www.nytimes.com/2024/04/09/us/politics/boeing-787-dreamliner-whistle-blower.html"
  },
  {
    "text": "Menendez's wife seeks trial delay for medical condition  —  Sen. Bob Menendez's (D-N.J.) wife, Nadine Menendez, is seeking to delay her criminal trial set to begin next month due to a new “serious medical condition.”  —  Nadine Menendez's lawyers wrote to U.S. District Judge Sidney Stein asking … ",
    "url": "https://thehill.com/regulation/court-battles/4584145-sen-bob-menendezs-wife-seeks-trial-delay-over-medical-condition/"
  },
  {
    "text": "UN claims no actual increase in aid entering Strip  —  The UN agency for Palestinian refugees is disputing claims by Israel and the US that aid into Gaza has been significantly increased.  —  “There has been no significant change in the volume of humanitarian supplies entering Gaza … ",
    "url": "https://www.timesofisrael.com/liveblog_entry/un-claims-no-actual-increase-in-aid-entering-strip/"
  },
  {
    "text": "Another Red-Blue Divide: Money to Feed Kids in the Summer  —  Congress passed bipartisan legislation to provide families that rely on subsidized school meals with help buying food over the summer.  Nearly half of Republican-led states have yet to sign on.  —  The rejection of federal aid … ",
    "url": "https://www.nytimes.com/2024/04/09/us/politics/school-meals-summer-ebt.html"
  },
  {
    "text": "Michigan school shooter's parents sentenced to at least 10 years in prison  —  The parents of a Michigan school shooter have been sentenced to at least 10 years for failing to prevent the killing of four students in 2021.  Jennifer and James Crumbley are the first parents convicted in a U.S. mass school shooting.",
    "url": "https://apnews.com/article/james-crumbley-jennifer-crumbley-oxford-school-shooting-e5888f615c76c3b26153c34dc36d5436"
  }
]