[
  {
    "text": "Pence told Jan. 6 special counsel harrowing details about 2020 aftermath, warnings to Trump: Sources  —  The former VP is the top official known to have spoken with investigators.  —  In this Nov. 24, 2020 file photo President Donald Trump and Vice President Mike Pence prepare to speak … ",
    "url": "https://abcnews.go.com/US/pence-told-jan-6-special-counsel-harrowing-details/story?id=105183391"
  },
  {
    "text": "Koch network endorses Nikki Haley for president as it looks to stop Trump  —  The powerful political network led by conservative billionaire Charles Koch endorsed Nikki Haley for president on Tuesday, as it looks to stop Donald Trump from being the Republican nominee.",
    "url": "https://www.washingtonpost.com/elections/2023/11/28/koch-network-haley-president/"
  },
  {
    "text": "Nikki Haley Is Coming for Your Retirement  —  It feels like years ago, but actually only a few months have passed since many big Republican donors seemed to believe that Ron DeSantis could effectively challenge Donald Trump for the Republican nomination.  It has been an edifying spectacle … ",
    "url": "https://www.nytimes.com/2023/11/27/opinion/nikki-haley-social-security.html"
  },
  {
    "text": "Trump's Backdoor Attempts to Delay His Trials Are Backfiring  —  The New York judge overseeing Donald Trump's hush money trial won't even consider pushing it back, especially after prosecutors accused defense lawyers of delay games. … Donald Trump's calendar is filling up—and not with campaign events.",
    "url": "https://www.thedailybeast.com/trumps-new-gambit-to-delay-his-trials-isnt-quite-working"
  },
  {
    "text": "Georgia prosecutors oppose plea deals for Trump, Meadows and Giuliani  —  Exclusive: sources say Fulton county prosecutors unwilling to offer deals to key trio, preferring instead to force them to trial  —  Fulton county prosecutors do not intend to offer plea deals to Donald Trump and at least … ",
    "url": "https://www.theguardian.com/us-news/2023/nov/28/trump-trial-georgia-no-plea-deal"
  },
  {
    "text": "The Hunter Biden counter-offensive: A strategy long overdue, or a political minefield  —  The president's son has a new legal plan, and it will play out in parallel with his father's reelection campaign.  —  For years, as Hunter Biden faced a protracted criminal probe … ",
    "url": "https://www.politico.com/news/2023/11/28/hunter-biden-legal-strategy-00127787"
  },
  {
    "text": "Hunter Biden says he is willing to testify in public hearing before House panel  —  Hunter Biden's lawyer said Tuesday that the president's son is willing to testify in a public hearing before the House Oversight Committee.  —  The letter from Abbe Lowell, a lawyer for Hunter Biden … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/28/hunter-biden-willing-public-testimony/"
  },
  {
    "text": "Rupert Murdoch to be deposed in Smartmatic defamation case against Fox  —  Rupert Murdoch is set to be questioned under oath on Tuesday and Wednesday as part of voting technology company Smartmatic's $2.7 billion defamation lawsuit against Fox Corp (FOXA.O) over coverage of debunked vote … ",
    "url": "https://www.reuters.com/legal/rupert-murdoch-be-deposed-smartmatic-defamation-case-against-fox-2023-11-28/"
  },
  {
    "text": "Fox News founder Rupert Murdoch deposed in Smartmatic election lawsuit  — Rupert Murdoch is being deposed in the $2.7 billion Smartmatic defamation lawsuit against Fox Corp. over allegedly damaging election lies, a source familiar with the matter told CNBC.",
    "url": "https://www.cnbc.com/2023/11/28/fox-news-founder-rupert-murdoch-deposed-in-smartmatic-election-lawsuit.html"
  },
  {
    "text": "CIA director pushes big hostage deal in secret meeting with Mossad chief  —  The meeting in Qatar comes as William Burns takes on a central role navigating the crisis for President Biden  —  CIA Director William J. Burns arrived in Qatar on Tuesday for secret meetings with Israel's spy chief … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/28/cia-william-burns-israel-hamas-hostages/"
  },
  {
    "text": "Ukrainian spy chief's wife poisoned, media reports say  —  The wife of Ukraine's military spy chief has been poisoned with heavy metals and is undergoing treatment in a hospital, a spokesperson for the agency said on Tuesday.  —  Marianna Budanova is the wife of Kyrylo Budanov … ",
    "url": "https://www.reuters.com/world/europe/ukrainian-spy-chiefs-wife-poisoned-media-reports-say-2023-11-28/"
  },
  {
    "text": "Major news outlets gave much less coverage to Trump's “vermin” attack then they did Clinton's “deplorables” remark  —  Huge disparities mark coverage in national broadcast, cable, and print outlets  —  RESEARCH CONTRIBUTIONS FROM ROB SAVILLO, HARRISON RAY, PETE TSIPIS & TORRI LONERGAN",
    "url": "https://www.mediamatters.org/donald-trump/major-news-outlets-gave-much-less-coverage-trumps-vermin-attack-then-they-did-clintons"
  },
  {
    "text": "Why the Fifth Circuit Keeps Making Such Outlandish Decisions  —  Where to even start in cataloging the most ridiculous—and alarming—recent rulings to come out of the U.S. Court of Appeals for the Fifth Circuit?  —  There's a case about whether a class action could go forward that boiled … ",
    "url": "https://www.theatlantic.com/politics/archive/2023/11/fifth-circuit-conservative-supreme-court/676116/"
  },
  {
    "text": "Leonard Leo firm received $21M from Leo-linked group  —  The expenditure, revealed in a tax filing, comes as the conservative activist is under enhanced scrutiny from the D.C. attorney general.  —  Conservative judicial activist Leonard Leo's consulting firm received $21 million in 2022 … ",
    "url": "https://www.politico.com/news/2023/11/28/leonard-leo-firm-received-21-million-from-leo-linked-group-00128884"
  },
  {
    "text": "House GOP lawmakers who flouted chamber's mask rule take legal fight to Supreme Court  —  Three House Republicans who had their pay docked for not complying with a pandemic-era mask requirement on the chamber floor have taken their legal fight to the Supreme Court, urging the justices to hear their case after losing in a lower court.",
    "url": "https://thehill.com/homenews/house/4330862-house-gop-lawmakers-who-flouted-chambers-mask-rule-take-legal-fight-to-supreme-court/"
  },
  {
    "text": "The new Trump judge revolt against the Voting Rights Act, explained  —  At the very moment the Supreme Court appears to be moderating on voting rights, GOP judges are going after America's most important voting rights law.  —  The Supreme Court, after a long period of hostility toward … ",
    "url": "https://www.vox.com/scotus/2023/11/28/23978226/supreme-court-trump-judges-voting-rights-act-arkansas-rose-secretary"
  },
  {
    "text": "The Left's fear of fascism under Trump is the ultimate example of projection  —  The liberal crazies, from actor Rob Reiner to the once conservative but now ideologue-for-sale Joe Scarborough, have their knickers in a knot over the potential that America may drift into “fascism” … ",
    "url": "https://www.washingtonexaminer.com/restoring-america/fairness-justice/lefts-fear-fascism-under-trump-ultimate-example-projection"
  },
  {
    "text": "Sean ‘Diddy’ Combs temporarily steps aside as the chairman of Revolt  —  Combs made the decision to step aside from the media network last week, a spokesperson said.  —  Sean “Diddy” Combs has temporarily stepped aside as the chairman of Revolt, a spokesperson for the music mogul said.",
    "url": "https://www.nbcnews.com/news/us-news/sean-diddy-combs-temporarily-steps-chairman-revolt-rcna127013"
  },
  {
    "text": "Russian court extends detention of WSJ reporter Evan Gershkovich until end of January  —  The hearing took place behind closed doors because authorities say details of the criminal case against the American journalist are classified.  —  MOSCOW — A court in Moscow on Tuesday extended … ",
    "url": "https://www.nbcnews.com/news/world/russian-court-extends-detention-wsj-reporter-evan-gershkovich-end-janu-rcna126941"
  }
]