[
  {
    "text": "Virginia Giuffre's Family Was Shocked That Trump Described Her as ‘Stolen’  —  The siblings of one of Jeffrey Epstein's most prominent accusers wonder what the president knows.  —  When Donald Trump told reporters yesterday that Jeffrey Epstein “stole” a young woman named Virginia Roberts Giuffre … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/07/jeffrey-epstein-accuser-trump/683717/?gift=49wmX9XxesaxFXKJmFp0Ph0W1IIyJ9aKDZC0HeQhIYI&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Alan Dershowitz Takes on His Greatest Challenge Yet: A Farmers' Market  —  It was an unusually warm day on Martha's Vineyard on Wednesday, and Alan Dershowitz just wanted to enjoy some hot dumplings.  —  As he tells it, Dershowitz, the 86-year-old attorney for some of America's … ",
    "url": "https://nymag.com/intelligencer/article/alan-dershowitz-lawsuit-farmers-market-over-pierogi-denial.html"
  },
  {
    "text": "The White House Announces White House Ballroom Construction to Begin  —  Washington, D.C. — For 150 years, Presidents, Administrations, and White House Staff have longed for a large event space on the White House complex that can hold substantially more guests than currently allowed.",
    "url": "https://www.whitehouse.gov/briefings-statements/2025/07/the-white-house-announces-white-house-ballroom-construction-to-begin/"
  },
  {
    "text": "Trump to bring back presidential physical fitness test canceled by Obama  —  Trump plans to sign an executive order resurrecting the test, which for decades pushed children across the country to do 40 push-ups, 10 pull-ups and a 6.5-minute mile.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/07/31/trump-physical-fitness-test-returns/"
  },
  {
    "text": "Trump's war on Big Law leads firms to retreat from ‘pro bono’ work for underdogs  —  Interviews with over 60 lawyers and 30 nonprofits show legal aid groups now have fewer resources to defend the vulnerable.  —  When the Texas Civil Rights Project needed lawyers to help dozens … ",
    "url": "https://www.reuters.com/investigations/trumps-war-big-law-leads-firms-retreat-pro-bono-work-underdogs-2025-07-31/"
  },
  {
    "text": "“We'll Smash the Fucking Window Out and Drag Him Out”  —  This story contains videos and descriptions of violent arrests.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.",
    "url": "https://projects.propublica.org/trump-ice-smashed-windows-deportation-arrests/"
  },
  {
    "text": "Trump extends Mexico's 25% tariffs for 90 days as talks continue … President Donald Trump on Thursday said he would not raise U.S. tariffs on Mexican goods beyond their current levels for 90 days, in order to give the neighboring countries time to strike a trade deal.",
    "url": "https://www.cnbc.com/2025/07/31/trump-tariffs-mexico-extension.html"
  },
  {
    "text": "Trump escalates trade war with Canada following Palestine stance  —  U.S. President Donald Trump intensified his trade war with Canada a day ahead of his August 1 deadline for a tariff agreement, saying it would be “very hard” to make a deal with Canada after it gave its support to Palestinian statehood.",
    "url": "https://www.reuters.com/world/americas/trump-escalates-trade-war-with-canada-following-palestine-stance-2025-07-31/"
  },
  {
    "text": "Legal Watchdog Files Bar Complaints Against Justice Dept. Lawyers  —  The move represented a rare attempt to seek accountability for rank-and-file lawyers who have represented the Trump administration in court.  —  A legal watchdog group accused three career Justice Department lawyers … ",
    "url": "https://www.nytimes.com/2025/07/31/us/politics/justice-department-lawyers-complaint.html"
  },
  {
    "text": "Trump's tariffs get frosty reception at federal appeals court … Judge Timothy Dyk, a Clinton appointee, said “it was hard for me to see” that Congress intended to give the president the authority to essentially rewrite the entire U.S. code when it passed the legislation.",
    "url": "https://www.politico.com/news/2025/07/31/trump-tariff-arguments-appeals-court-00486972"
  },
  {
    "text": "The Fact Checker rose in an era of false claims.  Falsehoods are now winning.  —  Longtime Fact Checker Glenn Kessler takes stock as he departs The Washington Post.  —  Just now  —  When 400 fact-checkers from around the world gathered in Rio de Janeiro in June for an annual conference, the mood was tense.",
    "url": "https://www.washingtonpost.com/politics/2025/07/31/fact-checker-falsehoods-glenn-kessler/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzOTM0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MzE2Nzk5LCJpYXQiOjE3NTM5MzQ0MDAsImp0aSI6IjBhZGRhNDg2LTM1YjYtNDlkYi1iNGU0LWQzOTMyYjRkMzU0OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA3LzMxL2ZhY3QtY2hlY2tlci1mYWxzZWhvb2RzLWdsZW5uLWtlc3NsZXIvIn0.vDQgrEHBLBN4_MBFZdTgJdnzCZnpdPMSTsuo8QGVQfg&itid=gfta"
  },
  {
    "text": "Kavanaugh Defends Supreme Court's Terse Emergency Orders  —  Speaking at a judicial conference, the justice said that saying too much risked premature judgments, adding that the court had been trying various approaches.  —  Justice Brett M. Kavanaugh said on Thursday that the Supreme Court … ",
    "url": "https://www.nytimes.com/2025/07/31/us/politics/kavanaugh-supreme-court-emergency.html?unlocked_article_code=1.ak8.kGi4.5aoDv_OPxRXh&smid=url-share"
  },
  {
    "text": "Federal judges decry political attacks from the White House … Since returning to the Oval Office in January, President Donald Trump has trained his ire on judges seen as stymieing his political agenda. … Threats against federal judges skyrocketed in the weeks after Trump reentered office.",
    "url": "https://www.politico.com/news/2025/07/31/judges-violence-threats-intimidation-00487251"
  },
  {
    "text": "Newly Declassified Appendix To Durham Report Sheds Additional Light On Clinton Campaign Plan To Falsely Tie Trump To Russia And FBI's Failure To Investigate  —  WASHINGTON - Senate Judiciary Committee Chairman Chuck Grassley (R-Iowa) today is making public the formerly Classified Appendix … ",
    "url": "https://www.grassley.senate.gov/news/news-releases/newly-declassified-appendix-to-durham-report-sheds-additional-light-on-clinton-campaign-plan-to-falsely-tie-trump-to-russia-and-fbis-failure-to-investigate"
  },
  {
    "text": "A New Cycle of Texas Gerrymandering: Your Questions Answered  —  A redistricting expert answers questions from Bolts readers about the effort to redraw Texas' congressional map, and its effects on communities of color and political representation.  —  The Texas legislature began meeting … ",
    "url": "https://boltsmag.org/a-new-cycle-of-texas-gerrymandering-your-questions-answered/"
  },
  {
    "text": "Donald Trump's unprecedented attack on Brazil's judiciary  —  He has placed sanctions on the judge leading the prosecution of Jair Bolsonaro, his ideological ally  —  “Let this be a warning to those who would trample on the fundamental rights of their countrymen,” Marco Rubio … ",
    "url": "https://www.economist.com/the-americas/2025/07/31/donald-trumps-unprecedented-attack-on-brazils-judiciary?link_source=ta_bluesky_link&taid=688b37c6fd96b40001e2ba74"
  },
  {
    "text": "The federal government is paying more than 154,000 people not to work  —  Early resignation offers and other programs have reduced the workforce, but critics say the moves are also wasting money.  —  Just now  —  The government is paying more than 154,000 federal employees not to work … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/31/federal-workers-doge-buyout-paid/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzOTM0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MzE2Nzk5LCJpYXQiOjE3NTM5MzQ0MDAsImp0aSI6IjVmZmU2ZjdhLWRhZjQtNDVkNy1iODM1LTFiODUzMjVlNWU3ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA3LzMxL2ZlZGVyYWwtd29ya2Vycy1kb2dlLWJ1eW91dC1wYWlkLyJ9.XSfp-aAHFgncW0qMAoMYIYp5XT-jQVou9Ax_pKaGFh4&itid=gfta"
  },
  {
    "text": "Senators Could Vote Imminently to Remove Their Homes, Travel Info From Internet  —  Watchdogs argue the legislation would block reporters from doing their jobs and limit efforts to hold lawmakers accountable  —  Senators could vote on a bill as soon as Thursday to allow members of Congress … ",
    "url": "https://www.rollingstone.com/politics/politics-features/senators-homes-travel-info-remove-internet-1235397818/"
  },
  {
    "text": "The shockingly shrunken footprint of a former president … Now, he's on the other side of the mountain.  And his life has entered a new phase that is quieter and smaller.  —  He's staffed by only one or two aides and a small Secret Service detail.  He holes up for hours at a time in Delaware working … ",
    "url": "https://www.politico.com/news/2025/07/31/joe-biden-post-presidency-oversight-book-life-00486384"
  },
  {
    "text": "Criminal defendant challenging Alina Habba's appointment takes a page from Aileen Cannon's playbook … “As Judge Cannon explained in Trump, when executive officials deliberately engineer an appointment in violation of statutory and constitutional mandates, the only effective remedy is dismissal or … ",
    "url": "https://www.politico.com/news/2025/07/31/alina-habba-aileen-cannon-us-attorney-00486598"
  },
  {
    "text": "Republicans Put Conspiracy Theorist With Far-Right Ties In Top Counterterrorism Job  —  Joe Kent has pushed white nationalist views and fanned conspiracies about the 2020 election being “stolen” and the FBI planning the Jan. 6 insurrection.  —  WASHINGTON ― You can't make it up, folks.",
    "url": "https://www.huffpost.com/entry/joe-kent-conspiracy-theorist-white-nationalist-counterterrorism-job_n_688b744ce4b0f5c3b7c98b53"
  },
  {
    "text": "How Scientific Empires End  —  And what it means for America  —  Roald sagdeev has already watched one scientific empire rot from the inside.  When Sagdeev began his career, in 1955, science in the Soviet Union was nearing its apex.  At the Kurchatov Institute in Moscow … ",
    "url": "https://www.theatlantic.com/science/archive/2025/07/science-empire-america-decline/683711/?gift=NOCMQ5ngQ0TP3ARV7MGFu8e03NwJI7Noj_2-JqbsMpY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "The Media Can't Handle the Absence of Truth  —  And their diffidence empowers pathological liars  —  We have guests for the next couple of days, and it would be rude to spend the whole time chained to the computer.  So this post and maybe the next will be short and somewhat meta.",
    "url": "https://paulkrugman.substack.com/p/the-media-cant-handle-the-absence"
  },
  {
    "text": "Traffic Apocalypse  —  Google's AI Overviews are killing click-throughs to news sites.  —  Worldwide search traffic has fallen by 15 percent in the past year, estimates Similarweb, a digital intelligence platform.  The culprit: AI search.  Now that AI-generated summaries are being integrated … ",
    "url": "https://www.cjr.org/analysis/traffic-apocalypse-google-ai-overviews-killing-click-throughs-news-sites.php"
  },
  {
    "text": "Jess Glynne calls White House deportation video with Jet2 song ‘sick’  — Jess Glynne criticises White House for using a meme featuring her song in a post about deportation  — Parodies of Jet2 adverts including Glynne's 2015 hit Hold My Hand have gone viral on TikTok",
    "url": "https://www.bbc.com/news/articles/clyjggjplyqo"
  },
  {
    "text": "The antiwoke academics supporting Trump's assaults on higher education  —  A right-wing thing tank called for presidential control of colleges — and received enthusiastic support from leaders and faculty at the University of Austin.  —  On July 15, the conservative-leaning Manhattan Institute published a … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-university-lawsuits-manhattan-institute-target-woke-education-rcna220624"
  },
  {
    "text": "Harris opens up about her historic presidential run after Biden's exit in new memoir, ‘107 Days’  —  Former Vice President Kamala Harris will have a memoir out in the fall on her historic presidential run.  The book is called “107 Days,” the length of her abbreviated campaign, and will be published by Simon & Schuster on Sept. 23.",
    "url": "https://apnews.com/article/kamala-harris-memoir-107-days-presidential-campaign-88b2b68dc8b9f191d79fc6b582a7828a"
  },
  {
    "text": "Trump Explodes at Putin Ally Who Likened Him to ‘Sleepy Joe’  —  FIGHTING TALK  —  “Tell [Dmitry] Medvedev, the failed former President of Russia, who thinks he's still President, to watch his words,” Trump blasted.  —  President Donald Trump exploded at former Russian president Dmitry Medvedev … ",
    "url": "https://www.thedailybeast.com/donald-trump-explodes-at-sleepy-joe-dig-from-putin-ally/"
  },
  {
    "text": "Trump regulatory czar Jeffrey Clark should be disbarred for role in 2020 election plot, panel rules … The D.C. Bar's Board of Professional Responsibility said its ruling was based on Clark's effort to pressure Justice Department leaders to issue a false statement that there was evidence … ",
    "url": "https://www.politico.com/news/2025/07/31/jeffrey-clark-disbarred-recommendation-00487257"
  },
  {
    "text": "What Happens To The Women ICE Detains?  —  The Trump administration's deportation machine is detaining immigrant women at record numbers — and they've become invisible targets.  —  Andrea stood outside her Florida apartment with her 8-year-old son waiting for police to arrive one Sunday night in February.",
    "url": "https://www.huffpost.com/entry/ice-detention-for-women-is-uniquely-cruel_n_688a681ee4b07dfa117f0372"
  },
  {
    "text": "Clock Ticks Down Toward Higher Tariffs With Little Clarity  —  The Trump administration is still debating the significantly higher tariff rates that American companies and foreign firms are expected to be subject to within a matter of hours.  —  President Trump on Thursday granted Mexico … ",
    "url": "https://www.nytimes.com/2025/07/31/us/politics/deadline-trump-tariffs.html"
  }
]