[
  {
    "text": "Biden Allows Ukraine to Strike Russia With Long-Range U.S. Missiles  —  With two months left in office, the president for the first time authorized the Ukrainian military to use the system known as ATACMS to help defend its forces in the Kursk region of Russia.",
    "url": "https://www.nytimes.com/2024/11/17/us/politics/biden-ukraine-russia-atacms-missiles.html?unlocked_article_code=1.ak4.aBOC.aSmYrVBqcXMF&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Biden allows Ukraine to use US arms to strike inside Russia  —  President Joe Biden's administration will allow Ukraine to use U.S.-provided weapons to strike deep into Russian territory, three sources familiar with the matter said, in a significant change to Washington's policy in the Ukraine-Russia conflict.",
    "url": "https://www.reuters.com/world/biden-lifts-ban-ukraine-using-us-arms-strike-inside-russia-2024-11-17/"
  },
  {
    "text": "Biden approves Ukraine's use of long-range U.S. weapons inside Russia, reversing policy  —  The Biden administration will allow Kyiv limited use of ATACMS to strike enemy positions in Russia, according to senior U.S. officials.  —  President Joe Biden has authorized Ukraine to use … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/17/ukraine-russia-north-korea-atacms/"
  },
  {
    "text": "Pollster Ann Selzer ending election polling, moving ‘to other ventures and opportunities’  —  Public opinion polling has been my life's work.  I collected my first research data as a freshman in college, if you don't count a neighborhood poll I did at age 5.",
    "url": "https://www.desmoinesregister.com/story/opinion/columnists/2024/11/17/ann-selzer-conducts-iowa-poll-ending-election-polling-moving-to-other-opportunities/76334909007/"
  },
  {
    "text": "Donald Trump Is Already Starting to Fail  —  That was quick.  —  Donald Trump is planting the seeds of his own political demise.  The corrupt, incompetent and extremist men and women he's appointing to many of the most critical posts in his cabinet are direct threats to the well-being of the country … ",
    "url": "https://www.nytimes.com/2024/11/17/opinion/trump-kennedy-gaetz-hegseth.html?unlocked_article_code=1.ak4.pugY.oU5QB5PdczoZ&smid=url-share"
  },
  {
    "text": "Enough  —  For the past decade, as Donald Trump has risen in political stature, I have waited for that precarious but inevitable moment when his well-documented liabilities would end his political ascendancy, when it would all finally be too much.  I waited through scandalous allegations … ",
    "url": "https://www.nytimes.com/2024/11/17/opinion/america-trump-tolerance.html"
  },
  {
    "text": "Haitian immigrants flee Springfield, Ohio, in droves after Trump election win  —  City subjected to false rumors from Trump loses residents integral to community over mass deportation fears  —  From a tiny office behind a Haitian grocery store on Springfield's South Limestone Street … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/17/haitian-immigrants-springfield-ohio-trump-election"
  },
  {
    "text": "How to survive the broligarchy: 20 lessons for the post-truth world  —  In the wake of Trump's unnerving appointees, the investigative journalist and veteran of the libel court offers pointers on coping in an age of surveillance  —  1 When someone tells you who they are, believe them.",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/17/how-to-survive-the-broligarchy-20-lessons-for-the-post-truth-world-donald-trump"
  },
  {
    "text": "Trump defense secretary pick Pete Hegseth denies sexual assault allegation, acknowledges payment to accuser  —  In a statement, Hegseth's attorney said the former Fox News host paid a woman in 2023 who had previously accused him of sexual assault but maintained that the woman lied.",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-defense-pick-pete-hegseth-denies-sexual-assault-allegation-rcna180535"
  },
  {
    "text": "Trump's shock-and-awe approach to transition is both shocking and awful  —  This week a flurry of controversial and extremist picks for Trump's cabinet came at a hectic pace with a level of provocation that made heads spin  —  “Welcome back,” Joe Biden told Donald Trump, his predecessor and successor … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/17/trump-transition-biden"
  },
  {
    "text": "Trump transition team compiling list of current and former U.S. military officers for possible courts-martial  —  All of the officers were involved in the chaotic U.S. withdrawal from Afghanistan, which independent reviews have blamed on both the Trump and Biden administrations.",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-transition-team-compiling-list-current-former-us-military-office-rcna180489"
  },
  {
    "text": "Messy Fight for Trump's Treasury Chief Spills Into Public  —  Howard Lutnick's chances were falling, but Elon Musk took to social media Saturday in an attempt to bring him back—and discredit rival Scott Bessent  —  A messy fight over who should be President-elect Donald Trump's Treasury secretary … ",
    "url": "https://www.wsj.com/politics/messy-fight-for-trumps-treasury-chief-spills-into-public-36d00ecb"
  },
  {
    "text": "Secret Trump voters have post-election coming out party  —  They're donning MAGA hats in cafes, celebrating on social media and flying Trump flags: Supporters of President-elect Trump in deep blue cities and states are no longer keeping it to themselves.",
    "url": "https://www.axios.com/2024/11/17/secret-trump-voters-blue-states"
  },
  {
    "text": "In Donald Trump, the morality of civil society has been abandoned  —  Limiting access to civic education in US schools leads people to be less well educated in basic principles  —  The reason Donald Trump won is because he exemplifies men who think only of themselves.",
    "url": "https://www.theguardian.com/theobserver/2024/nov/17/in-donald-trump-the-morality-of-civil-society-has-been-abandoned"
  },
  {
    "text": "DOJ and FBI officials reach out to lawyers as potential Trump revenge prosecutions loom  —  Legal experts say that Trump's choice for attorney general, Matt Gaetz, signals the president-elect's determination to tightly control the DOJ and prosecute adversaries.",
    "url": "https://www.nbcnews.com/politics/justice-department/doj-fbi-officials-reach-lawyers-potential-trump-revenge-prosecutions-l-rcna179737"
  }
]