[
  {
    "text": "Trump Confuses Haley and Pelosi, Accusing Rival of Jan. 6 Lapse  —  Donald Trump has often accused former House Speaker Nancy Pelosi of failing to provide adequate security for the Capitol.  On Friday, he inexplicably substituted Nikki Haley's name for Ms. Pelosi's.",
    "url": "https://www.nytimes.com/2024/01/19/us/politics/trump-confuses-haley-and-pelosi-accusing-rival-of-jan-6-lapse.html"
  },
  {
    "text": "Nikki Haley questions whether Trump is ‘mentally fit’ after he confuses her with Nancy Pelosi  —  Haley told supporters in New Hampshire that “we can't have someone else that we question whether they're mentally fit to do this.”  —  MANCHESTER, N.H. — Nikki Haley questioned whether Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-trump-mentally-fit-nancy-pelosi-rcna134887"
  },
  {
    "text": "Biden advisers brainstorm best policy pitch to halt Trump's rise  —  Prescription drug caps, taxing the wealthy and reining in corporate price-gouging eyed as potent advantages in president's reelection bid  —  In private conversations over the past several weeks, aides to President Biden … ",
    "url": "https://www.washingtonpost.com/business/2024/01/20/trump-biden-2024-policy/"
  },
  {
    "text": "Playbook: N.H.'s frigid finish, Louisiana's big payback  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  NEW HAMPSHIRE SNOOZER?  — If Tuesday's New Hampshire primary is the final stand for the anti-DONALD TRUMP wing of the Republican Party … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/20/n-h-s-frigid-finish-louisianas-big-payback-00136735"
  },
  {
    "text": "Haley Plans $4 Million Ad Buy to Boost South Carolina Bid  — Advertising campaign to follow New Hampshire's GOP primary  — Polls show Haley competitive against Trump in New Hampshire  —  Nikki Haley will launch a $4 million advertising campaign in her home state of South Carolina … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-20/haley-will-launch-4-million-ad-buy-to-boost-south-carolina-bid"
  },
  {
    "text": "Trio of South Carolina Republicans to attend Trump rally tonight  —  South Carolina Gov. Henry McMaster and two Republican members of the state's congressional delegation, Reps. Russell Fry and William Timmons, will attend Trump's rally tonight in Manchester, according to three sources familiar with their travel plans.",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/election-2024-live-updates-rcna134579/rcrd31482?canonicalCard=true"
  },
  {
    "text": "The Absurdity of No Labels  —  A dangerous date for politics in the United States is approaching: March 5.  Not only is that when Super Tuesday will occur, with a slew of Republican primaries likely to anoint Donald Trump as the presumptive GOP presidential nominee.",
    "url": "https://link.motherjones.com/public/34061597"
  },
  {
    "text": "Iranian and Hezbollah commanders help direct Houthi attacks in Yemen  —  Commanders from Iran's Islamic Revolutionary Guards Corps (IRGC) and Lebanon's Hezbollah group are on the ground in Yemen helping to direct and oversee Houthi attacks on Red Sea shipping, four regional and two Iranian sources told Reuters.",
    "url": "https://www.reuters.com/world/middle-east/iranian-hezbollah-commanders-help-direct-houthi-attacks-yemen-sources-say-2024-01-20/"
  },
  {
    "text": "Zelensky invites Trump to Ukraine  —  President Volodymyr Zelensky has extended an invitation to Donald Trump to visit Kyiv, with a specific condition attached.  —  Speaking with U.K. broadcaster Channel 4 News, Zelensky said that Trump would be warmly received in the capital under one stipulation … ",
    "url": "https://kyivindependent.com/zelensky-invites-trump-to-ukraine/"
  },
  {
    "text": "Ohio Poised To Become 2nd State To Restrict Gender-Affirming Care For Adults  —  The changes would add bureaucratic hurdles to receiving care, trans advocates say.  —  LOADING  —  Ohio Gov. Mike DeWine announced proposals this month that transgender advocates say could block access … ",
    "url": "https://www.huffpost.com/entry/ohio-poised-to-become-2nd-state-to-restrict-gender-affirming-care-for-adults_n_65abf646e4b076abd7abc40b"
  },
  {
    "text": "Revealed: far-right figures try to create Christian nationalist ‘haven’ in Kentucky  —  Venture fund and real estate startup linked to far-right groups promote residential development as community for rightwingers  —  A venture fund and a real estate startup - both with links to far-right organizations … ",
    "url": "https://www.theguardian.com/us-news/2024/jan/20/kentucky-far-right-community-real-estate-development"
  },
  {
    "text": "Congress keeps punting on the hard work, then leaving town for recess  —  The latest stopgap funding bill gave lawmakers an early-March deadline, but now their schedules call for a light workload in February  —  Congressional bureau chief  —  Once the House on Thursday finished kicking … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/20/congress-stopgap-funding-government-recess/"
  },
  {
    "text": "After House Speaker Mike Johnson Pushed Through Israel Aid Package, AIPAC Cash Came Flowing In  —  The American Israel Public Affairs Committee, or AIPAC, donated around $95,000 to Rep. Mike Johnson, R-La., in November, according to The Intercept's analysis of Federal Election Commission records.",
    "url": "https://theintercept.com/2024/01/20/israel-aipac-house-mike-johnson/"
  },
  {
    "text": "DC Bar Association files disciplinary charges against lawyers over 2020 election fraud claims  —  The Bar association in Washington, D.C., filed disciplinary charges against three lawyers associated with former President Trump's alleged attempt to overturn the 2020 presidential election results.",
    "url": "https://thehill.com/regulation/court-battles/4419415-dc-bar-files-disciplinary-charges-lawyers-2020-election-fraud-claims/"
  }
]