[
  {
    "text": "The key to understanding Donald Trump's enduring appeal is Vince McMahon  —  Some people don't want to believe it, but it's true: Donald Trump has a reasonable chance of being elected the next president of the United States.  —  According to conventional political analysis … ",
    "url": "https://popular.info/p/the-key-to-understanding-donald-trumps"
  },
  {
    "text": "Trump is explaining exactly how wild and extreme his second term would be  —  Donald Trump is conjuring his most foreboding vision yet of a possible second term, telling supporters in language resonant of the run-up to the January 6 mob attack on the US Capitol that they need to “fight like hell” or they will lose their country.",
    "url": "https://www.cnn.com/2023/09/11/politics/trump-wild-rhetoric-2024/"
  },
  {
    "text": "Dems inch toward House majority with recent court wins  —  Court rulings on redistricting are raising Democratic hopes.  —  The fundamentals of the 2024 campaign are still taking shape, but one thing is already clear: A flurry of court actions might cost Republicans the House majority.",
    "url": "https://www.politico.com/news/2023/09/11/redistricting-could-help-democrats-win-back-the-house-00114780"
  },
  {
    "text": "‘Virginia Is the Test Case’: Youngkin Pushes for G.O.P. Takeover This Fall  —  Glenn Youngkin, a popular Republican governor with national ambitions, is trying to help his party take full control of state government in crucial legislative races this year.  —  Virginia, whose off-year elections … ",
    "url": "https://www.nytimes.com/2023/09/11/us/politics/virginia-youngkin-elections.html"
  },
  {
    "text": "McCarthy pressure hits a boiling point  —  House Republicans are barreling toward an existential clash over this month's government funding talks.  —  Kevin McCarthy is facing the greatest peril to his speakership since he clawed his way into the job eight months ago, with multiple factions … ",
    "url": "https://www.politico.com/news/2023/09/11/kevin-mccarthy-government-shutdown-profile-00114028"
  },
  {
    "text": "Voters Feel Better About the Economy, but Few Credit Biden, Polls Find  —  Most Americans disapprove of president's economic policy, posing a challenge to his re-election  —  Voters have a slightly rosier view of the economy now that inflation is easing.  Few are giving President Biden credit for the improvement.",
    "url": "https://www.wsj.com/politics/policy/voters-feel-better-about-the-economy-but-few-credit-biden-polls-find-3c7d98c9?mod=followamazon"
  },
  {
    "text": "Ex-GOP Lawmaker Recalls Wild Moment Colleagues Made His Head Explode  —  “It was incredible to me to listen to that,” former Virginia Republican Denver Riggleman said of his very week in the hardline House Freedom Caucus.  —  LOADING  —  Former Rep. Denver Riggleman (Va.) … ",
    "url": "https://www.huffpost.com/entry/denver-riggleman-house-freedom-caucus_n_64fee85be4b07eb12a0fb052"
  },
  {
    "text": "FDA Takes Action on Updated mRNA COVID-19 Vaccines to Better Protect Against Currently Circulating Variants  —  For Immediate Release:  —  Today, the U.S. Food and Drug Administration took action approving and authorizing for emergency use updated COVID-19 vaccines formulated … ",
    "url": "https://www.fda.gov/news-events/press-announcements/fda-takes-action-updated-mrna-covid-19-vaccines-better-protect-against-currently-circulating"
  },
  {
    "text": "Prosecutors drop foreign-agent case against Trump transition adviser  —  Bijan Rafiekian is a California businessman and former business partner of Trump ally Michael Flynn.  —  The Justice Department has quietly abandoned one of the last prosecutions stemming from investigations … ",
    "url": "https://www.politico.com/news/2023/09/11/prosecutors-drop-bijan-rafiekian-case-00115003"
  },
  {
    "text": "Majority of California voters don't support cash for slavery reparations: Poll  —  A California task force made a recommendation to pay cash reparations to descendants of slaves earlier this year, but a majority of voters in the state oppose the council's request.",
    "url": "https://www.washingtonexaminer.com/policy/budgets-deficits/majority-california-voters-dont-support-cash-slavery-reparations-poll"
  },
  {
    "text": "Newsom's Senate caretaker plan is ‘insulting’ to Black women, Rep. Lee says  —  Rep. Barbara Lee (D-Calif.) spoke out after the California governor ruled out appointing her if Sen. Dianne Feinstein (D-Calif.) leaves office before her term ends  —  Amid questions about the health of Sen. Dianne Feinstein … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/11/gavin-newsom-barbara-lee/"
  },
  {
    "text": "Yellen ‘feeling very good’ about chances for economic soft landing  —  Treasury Secretary Janet Yellen said she is “feeling very good” about the U.S. making a soft economic landing without a recession.  —  “I am feeling very good about that prediction,” Yellen told Bloomberg when asked whether … ",
    "url": "https://thehill.com/business/4197622-yellen-feeling-good-chances-economic-soft-landing/"
  },
  {
    "text": "Twitter appears to throttle New York Times  —  X, Elon Musk's social media platform formerly known as Twitter, appears to be attempting to limit its users' access to The New York Times.  —  Since late July, engagement on X posts linking to the New York Times has dropped dramatically.",
    "url": "https://www.semafor.com/article/09/10/2023/twitter-appears-to-throttle-new-york-times"
  },
  {
    "text": "Meet the Press - September 10, 2023  —  Sen. Bill Cassidy (R-La.), Gov. Gavin Newsom (D-Calif.), Cornell Belcher, Mark Murray, Danielle Pletka, Amy Walter and Kristen Welker  —  CHUCK TODD:  —  This Sunday, future of the party.  —  FMR. PRES. DONALD TRUMP:",
    "url": "https://www.nbcnews.com/meet-the-press/meet-press-september-10-2023-n1307144"
  },
  {
    "text": "Kim Jong Un's Train Headed Toward Russia for Putin Talks  — Trip will be Kim's first outside Korean Peninsula since 2019  — US expects he will talk about weapons deal with Putin  —  North Korean leader Kim Jong Un is heading to Russia via his luxury armored train, South Korean media reported … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-11/kim-jong-un-s-train-appears-headed-to-russia-for-putin-summit"
  },
  {
    "text": "Communists Burn Flags Outside Jason Aldean Concert, but the Response Shuts Them Down  —  We remember the attack on September 11 and all the people lost on that day.  The people who were alive remember where they were when they heard about it.  The first reports suggested the first plane might have been a small plane.",
    "url": "https://redstate.com/nick-arama/2023/09/11/communists-burn-flags-and-attack-america-outside-jason-aldean-concert-n2163661"
  }
]