[
  {
    "text": "Ex-WaPo Editor: This Is a Straight Bezos-Trump ‘Quid Pro Quo’  —  DIRTY DEAL  —  Robert Kagan tells the Daily Beast that Donald Trump's meeting with Blue Origin executives the day its founder Jeff Bezos killed his paper's Kamala Harris endorsement is proof of a backroom deal.  —  EXCLUSIVE",
    "url": "https://www.thedailybeast.com/ex-washington-post-editor-robert-kagan-this-is-a-straight-jeff-bezos-donald-trump-quid-pro-quo/"
  },
  {
    "text": "Inside The Washington Post's Decision to Stop Presidential Endorsements  —  Post owner Jeff Bezos ended the decades-long practice, weeks after a discussion at a meeting in Miami.  The move has drawn criticism in and outside the newsroom.  —  A tropical storm was heading toward Florida's Gulf Coast … ",
    "url": "https://www.nytimes.com/2024/10/27/business/media/washington-post-president-endorsement.html?unlocked_article_code=1.VU4._eil.Ia3yo9ttoSlc&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Bezos faces criticism after executives met with Trump on day of Post's non-endorsement  —  Executives of Blue Origin briefly met with Trump within hours after paper spiked endorsement of Harris  —  The multi-billionaire owner of the Washington Post, Jeff Bezos, continued facing criticism throughout … ",
    "url": "https://www.theguardian.com/media/2024/oct/27/bezos-washington-post-non-endorsement-election"
  },
  {
    "text": "Republican battleground-state legal blitz falters ahead of election  —  Donald Trump's Republican allies have suffered a string of courtroom setbacks in battleground U.S. presidential election states as Election Day draws closer, losses which could boost voter turnout and speed certification of the eventual winner.",
    "url": "https://www.reuters.com/world/us/republican-battleground-state-legal-blitz-falters-ahead-us-presidential-election-2024-10-27/"
  },
  {
    "text": "Harris regains slight lead nationally yet Electoral College holds the cards: POLL  —  Harris has regained a slight lead with likely voters nationally, the poll finds.  —  Democratic presidential nominee Vice President Kamala Harris speaks at a campaign rally at James R. Hallford Stadium, Oct. 24, 2024, in Clarkston, Ga.",
    "url": "https://abcnews.go.com/Politics/harris-regains-slight-lead-nationally-electoral-college-holds/story?id=115083875"
  },
  {
    "text": "Billionaire cowards at Washington Post, L.A. Times show what life under a dictator is really like  —  Do not obey in advance.  Most of the power of authoritarianism is freely given.  In times like these, individuals think ahead about what a repressive government will want, and then offer themselves without being asked.",
    "url": "https://www.inquirer.com/opinion/commentary/washington-post-la-times-endorsements-trump-harris-20241027.html?id=iRjwkouvkYlDw"
  },
  {
    "text": "Harris and Walz will visit all the battleground states in the campaign's closing stretch  —  Kamala Harris told a church congregation Sunday that the United States is “determined to turn the page on hatred and division.”  The vice president's visit to Philadelphia's Church of Christian Compassion … ",
    "url": "https://apnews.com/article/kamala-harris-tim-walz-campaign-640ea532f6de541a5e03509bfe1471ef"
  },
  {
    "text": "I am my own legal department: the promise and peril of “just go independent”  —  Listen to a voiceover of this post, subscribe to the feed in your podcast app, or download the recording for later.  —  When a major legacy news publication does something controversial, I sometimes hear my name.",
    "url": "https://www.citationneeded.news/i-am-my-own-legal-department/"
  },
  {
    "text": "October 26, 2024  —  Beginning in 1943, the War Department published a series of pamphlets for U.S. Army personnel in the European theater of World War II.  Titled Army Talks, the series was designed “to help [the personnel] become better-informed men and women and therefore better soldiers.”",
    "url": "https://heathercoxrichardson.substack.com/p/october-26-2024"
  },
  {
    "text": "Donald Trump Will Never Be Done With New York  —  Sunday's rally at Madison Square Garden, the self-styled “world's most famous arena,” is a remarkable gambit, even by the former president's standards — and a show of force.  —  The seven-decade marriage between Donald J. Trump and New York City … ",
    "url": "https://www.nytimes.com/2024/10/27/us/politics/trump-new-york-msg.html"
  },
  {
    "text": "Appeals court rejects Virginia's request to continue its late voter-purge program  —  On Sunday, the U.S. Court of Appeals for the Fourth Circuit rejected Virginia's request to restart its late voter-purge program, with a three-judge panel unanimously concluding, “[Virginia] argue[s] … ",
    "url": "https://www.lawdork.com/p/virginia-doesnt-care-if-its-late"
  },
  {
    "text": "Nebraska school voucher fight could have big political consequences  —  Voters will decide whether to scrap a state-funded program that provides scholarships for students to attend private schools.  —  A fight to overturn Nebraska's $10 million school voucher law has scrambled … ",
    "url": "https://www.politico.com/news/2024/10/27/nebraska-school-voucher-referendum-00185680"
  },
  {
    "text": "More than 1,000 faith leaders endorse Harris as vice president leans on her faith to turn out Black voters  —  More than a thousand religious leaders endorsed Kamala Harris on Sunday, bolstering the Democratic presidential nominee's push to emphasize how faith is informing her campaign ahead of next week's election.",
    "url": "https://www.cnn.com/2024/10/27/politics/faith-leaders-harris-endorsement/"
  },
  {
    "text": "Trust, Bewilderment and Billionairedom: Understanding the Backlash Against Bezos  —  It's part of the stock in trade of liberal American discourse: threatening or claiming to cancel a subscription to this or that once-revered journalistic institution in response to bad behavior, bad reporting … ",
    "url": "https://talkingpointsmemo.com/edblog/trust-bewilderment-and-billionairedom-understanding-the-backlash-against-bezos"
  },
  {
    "text": "Florida Democrat Blasts Republican Sen. Rick Scott Over State's Home Insurance Crisis  —  Debbie Mucarsel-Powell is hoping voters make the connection between Scott's eight years as governor and the escalating cost of home insurance.  —  LOADING  —  Wetter, more destructive hurricanes … ",
    "url": "https://www.huffpost.com/entry/florida-home-insurance-rick-scott-debbie-murcarsel-powell-climate-change_n_671bfc03e4b0fdf4fef462e7"
  },
  {
    "text": "A growing number of Americans are concerned with Trump's age, but still not as many who worried about Biden  —  Voters did not have the same concerns about age for Kamala Harris  —  Your support helps us to tell the story  —  This election is still a dead heat, according to most polls.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-age-voters-mental-health-b2636214.html"
  },
  {
    "text": "Democracy |  As Fascism Looms, the Free Press Must Stand and Report in the Breach  — Click to email a link to a friend (Opens in new window)  —  It was a cool, dark night in Berlin on May 10, 1933, as a mob of white Nazi college students pulled thousands of “subversive” … ",
    "url": "https://www.mississippifreepress.org/democracy-as-fascism-looms-the-free-press-must-stand-and-report-in-the-breach/"
  },
  {
    "text": "To understand the U.S. economic success is to love Harris's plan  —  Kamala Harris's economic proposals would build on the remarkable U.S. comeback since the pandemic.  —  Despite the compulsion of Republican MAGA voices to run down the country's economic strength, the U.S. recovery … ",
    "url": "https://www.washingtonpost.com/opinions/2024/10/27/kamala-harris-economic-proposals/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwMDAxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMzg3NTk5LCJpYXQiOjE3MzAwMDE2MDAsImp0aSI6IjJmZGUyZTk1LWJmYTQtNDE1ZC05N2IyLTFhY2FhZDEwZThmZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEwLzI3L2thbWFsYS1oYXJyaXMtZWNvbm9taWMtcHJvcG9zYWxzLyJ9.S__yO5wSdOakAMnwqy0WuWJsUHn9gzOUaFS3hFXyHWI&itid=gfta"
  }
]