[
  {
    "text": "Harris and Democrats keep calling Trump and Vance ‘weird.’ Here's why  —  Vice President Kamala Harris and her Democratic allies are emphasizing a new line of criticism against Republicans — branding Donald Trump and his running mate, Ohio Sen. JD Vance, as “weird.”",
    "url": "https://apnews.com/article/kamala-harris-trump-vance-weird-c54d506d1f533ee7aa455f7b500322c5"
  },
  {
    "text": "Republicans Are About To Become Desperate  —  Prior to this most improbable of months, a hallmark of the Biden era had been a great forgetting of the Trump years that preceded it.  —  Joe Biden's belief that he could unilaterally turn down the temperature in American politics … ",
    "url": "https://www.offmessage.net/p/republicans-are-about-to-become-desperate"
  },
  {
    "text": "Where J.D. Vance's weirdest idea actually came from  —  How Vance's proposal to give parents extra votes illustrates the fundamental flaw in his politics. … Since his selection as former President Donald Trump's running mate, Sen. J.D. Vance has developed a reputation for being a bit strange.",
    "url": "https://www.vox.com/politics/363473/jd-vance-weird-voting-parents-demeny-postliberalism"
  },
  {
    "text": "Yes They Can?  —  Democrats haven't been this fired up about a presidential candidate since Obama, and the Harris campaign is racing to capitalize on the momentum: hiring veteran ad-maker Jim Margolis, doubling down on TikTok (where Kamala is approaching Trump-level virality), and leaning into the J.D. Vance creep factor.",
    "url": "https://puck.news/can-the-harris-campaign-sustain-the-kamala-mentum/"
  },
  {
    "text": "Exclusive: The inside story of John Roberts and Trump's immunity win at the Supreme Court  —  The Supreme Court's toughest cases during Chief Justice John Roberts' tenure have often generated internal suspense, with shifting votes, last-minute switches and the chief's own push toward compromises … ",
    "url": "https://www.cnn.com/2024/07/30/politics/supreme-court-john-roberts-trump-immunity-6-3-biskupic/"
  },
  {
    "text": "Roy Cooper Withdraws From Kamala Harris VP Sweepstakes  —  Mr. Cooper, the governor of North Carolina, had been seen as one of the half-dozen top candidates to join the Democratic presidential ticket.  It was not immediately clear why he withdrew.  —  Gov. Roy Cooper of North Carolina … ",
    "url": "https://www.nytimes.com/2024/07/29/us/politics/roy-cooper-kamala-harris-vp.html?unlocked_article_code=1.-00.tfSj.7gMcOUeOQAUJ&smid=url-share"
  },
  {
    "text": "Exclusive: Harris and her VP pick will tour battleground states next week - sources  —  Vice President Kamala Harris will tour battleground states next week with her vice presidential candidate, two sources familiar with the planning said on Tuesday, a signal the selection process for her running mate is coming to a close.",
    "url": "https://www.reuters.com/world/us/harris-her-vp-pick-will-tour-battleground-states-next-week-sources-2024-07-30/"
  },
  {
    "text": "It's not just ‘cat ladies’: JD Vance has a history of disparaging people without kids  —  Republican vice presidential nominee Sen. JD Vance has a history of making disparaging remarks toward people without children, a CNN KFile review of his comments shows, including fundraising off his now-infamous … ",
    "url": "https://www.cnn.com/2024/07/30/politics/kfile-jd-vance-history-disparaging-people-without-kids/"
  },
  {
    "text": "‘White Dudes for Harris’ X Suspension Sparks Fury: ‘Election Interference’  —  A social-media account for white male supporters of  —  was briefly suspended from X, formerly  —  , sparking anger online.  —  Newsweek observed that the White Dudes for Harris X account had been temporarily suspended … ",
    "url": "https://www.newsweek.com/white-dudes-harris-x-suspension-1931827"
  },
  {
    "text": "Behind the Curtain: The battle for Trump power … - Trump constantly tells friends he felt burned by disloyal Cabinet officials and staff last time around. … - JD Vance would be very involved with planning Trump's transition — the high-stakes period between Election Day and the inauguration.",
    "url": "https://www.axios.com/2024/07/30/trump-cabinet-shortlist-vance"
  },
  {
    "text": "‘White Dudes for Harris’ is the latest in a series of Zoom gatherings backing the vice president  —  On a “White Dudes for Harris” virtual call, it was probably fitting that “The Dude” dropped in.  Actor Jeff Bridges addressed a fundraising event geared toward white men supporting Vice President Kamala Harris … ",
    "url": "https://apnews.com/article/harris-supporters-by-ethnic-background-white-dudes-b474af62f6b225c71cde16be7e9eb077"
  },
  {
    "text": "Harris's best response to the ‘too liberal’ attack  —  She is the one aligned with the bulk of Americans.  —  Minnesota Gov. Tim Walz (D), a possible pick for vice president, gave a pitch-perfect answer on CNN to the charge that he is too “liberal”:",
    "url": "https://www.washingtonpost.com/opinions/2024/07/30/harris-liberal-attacks/"
  },
  {
    "text": "Better late than never  —  Biden proposes reforms to a Court in desperate need of them. … Though a lot of people will probably scorn it as too little too late, President Joe Biden just called for substantial court reform.  However, much like the adage “the best time to plant a tree was 20 years ago.",
    "url": "https://www.publicnotice.co/p/biden-proposed-supreme-court-reforms-explained"
  },
  {
    "text": "Maddow points out frightening truth about Trump's lack of concern about votes  —  Rachel Maddow rounds up instances in which Donald Trump not only assures his supporters that if he is elected they won't have to vote in the future, but also that even for this 2024 election he does not need votes.",
    "url": "https://www.msnbc.com/rachel-maddow/watch/maddow-points-out-frightening-truth-about-trump-s-lack-of-concern-about-votes-215958085917"
  },
  {
    "text": "Historian Timothy Ryback: “Hitler could only have dreamed” of Trump's fanatical support  —  Parallels between America in 2024 and Weimar Germany “astonish me,” says eminent historian of the Nazi era  —  The world has seen a version of this story before: A charismatic leader and demagogue … ",
    "url": "https://www.salon.com/2024/07/30/historian-timothy-ryback-hitler-could-only-have-dreamed-of-fanatical-support/"
  },
  {
    "text": "“Old and quite weird”: Democrats finally discover new effective attack — and Republicans hate it  —  After nearly a decade of being forced to take Trump seriously, Democrats increasingly call BS on the whole charade  —  Sure, Donald Trump is a threat to democracy — a would-be dictator … ",
    "url": "https://www.salon.com/2024/07/29/old-and-quite-weird-democrats-finally-discover-new-effective--and-hate-it/"
  },
  {
    "text": "William L. Calley Jr., Convicted in My Lai Massacre, Is Dead at 80  —  Hundreds of Vietnamese civilians died at the hands of American soldiers, but Lieutenant Calley was the only one found guilty.  —  William L. Calley Jr., who as a young Army lieutenant during the Vietnam War … ",
    "url": "https://www.nytimes.com/2024/07/29/us/william-calley-dead.html"
  },
  {
    "text": "Venezuela ruling party, opposition rally supporters in election dispute  —  Opponents and supporters of Venezuela's President Nicolas Maduro planned to rally on Tuesday as protests and clashes spread after a weekend election was awarded to the long-ruling socialist despite opposition claims of a landslide victory.",
    "url": "https://www.reuters.com/world/americas/venezuela-ruling-party-opposition-rally-supporters-election-dispute-2024-07-30/"
  },
  {
    "text": "NABJ to Host Former President Trump for a Conversation in Chicago During Annual Convention  —  CHICAGO - Former U.S. President Donald J. Trump will participate in a conversation with journalists at the National Association of Black Journalists (NABJ) Annual Convention & Career Fair during … ",
    "url": "https://nabjonline.org/blog/nabj-to-host-former-president-trump-for-a-conversation-in-chicago-during-its-annual-convention/"
  },
  {
    "text": "Watch Live: FBI, Secret Service officials testify about Trump shooting at Senate hearing  —  Washington — Top officials with the U.S. Secret Service and FBI are testifying before two Senate committees Tuesday about the security lapses that led to the attempted assassination … ",
    "url": "https://www.cbsnews.com/live-updates/trump-shooting-hearing-fbi-secret-service-assassination-attempt-senate/"
  }
]