[
  {
    "text": "What the First Debate Question for Trump Must Be  —  The moderators ought to start with the fact that he rejects the foundations of the American system of government.  —  I find it exhausting to have to point out that Donald Trump has—yet again—threatened to engage in violent and dictatorial behavior … ",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/09/what-the-first-debate-question-for-trump-must-be/679763/"
  },
  {
    "text": "What If Trump Wins?  —  The chaos and lawlessness of the first term could pale in comparison to what comes next  —  Mark Peterson/Redux  —  Donald Trump was slamming his fist on the Resolute Desk and, once again, calling for blood.  —  It was the second year of his presidency … ",
    "url": "https://www.rollingstone.com/politics/politics-features/if-trump-wins-2024-election-1235096091/"
  },
  {
    "text": "Ohio police have ‘no credible reports’ of Haitian immigrants harming pets, contradicting JD Vance's claim  —  Vance wrote on X that “people have had their pets abducted and eaten by people who shouldn't be in this country.”  Police say they haven't seen evidence.",
    "url": "https://www.nbcnews.com/tech/misinformation/jd-vance-ohio-police-no-reports-haitian-immigrants-harming-pets-rcna170271"
  },
  {
    "text": "Trump Campaign Amplifies False Claim About Haitian Migrants in Ohio  —  A local official said there was “absolutely no evidence” that Haitian migrants have stolen and eaten pets, an outlandish claim amplified by the Trump campaign on Monday.  —  The Trump campaign promoted an outlandish false claim … ",
    "url": "https://www.nytimes.com/2024/09/09/us/politics/trump-vance-haitians-ohio.html"
  },
  {
    "text": "The right-wing bubble says Trump will save your cat from immigrants  —  False claims and baseless ones are politically useful, so they rocket to the social media accounts of prominent right-wing people.  —  Seemingly out of the blue Monday morning, supporters of former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/09/rumors-about-an-ohio-town-show-scale-right-wing-bubble/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI1ODU0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI3MjM2Nzk5LCJpYXQiOjE3MjU4NTQ0MDAsImp0aSI6IjIxODE3M2M1LTg4MzktNDVjMi04OWYwLTQzYjE1NjNlNTM1OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzA5L3J1bW9ycy1hYm91dC1hbi1vaGlvLXRvd24tc2hvdy1zY2FsZS1yaWdodC13aW5nLWJ1YmJsZS8ifQ.XOey5m8tUaWw0RE0QfFVUpUCH-lKB3gLOhzyckkGIBE&itid=gfta"
  },
  {
    "text": "As Debate Looms, Trump Is Now the One Facing Questions About Age and Capacity  —  With President Biden no longer in the race, former President Donald J. Trump would be the oldest person ever to serve in the Oval Office.  But his rambling, sometimes incoherent public statements have stirred concern among voters.",
    "url": "https://www.nytimes.com/2024/09/09/us/politics/debate-trump-age-capacity.html?unlocked_article_code=1.JU4.aC9a.ymukJJk9m3W1&smid=url-share"
  },
  {
    "text": "Swing State Poll 2024: North Carolina: Harris vs. Trump Too Close To Call, Georgia: Trump Has Slight Edge In Tight Race, Quinnipiac University Poll Finds; NC Governor's Race: Stein Leads Robinson 51% - 41%  —  mail_outline  —  NORTH CAROLINA: Harris 49%, Trump 46%, Stein 1%",
    "url": "https://poll.qu.edu/poll-release?releaseid=3904"
  },
  {
    "text": "Leaders of Transnational Terrorist Group Charged with Soliciting Hate Crimes, Soliciting the Murder of Federal Officials, and Conspiring to Provide Material Support to Terrorists  —  For Immediate Release  —  The Justice Department announced today that Dallas Humber, 34, of Elk Grove … ",
    "url": "https://www.justice.gov/opa/pr/leaders-transnational-terrorist-group-charged-soliciting-hate-crimes-soliciting-murder"
  },
  {
    "text": "Tracking the 2024 Election: State by State  —  Ahead of the 2024 presidential election, Morning Consult is conducting thousands of surveys every day, asking U.S. voters if they plan to vote for Vice President Kamala Harris or former President Donald Trump in November.",
    "url": "https://pro.morningconsult.com/trackers/2024-election-state-polls"
  },
  {
    "text": "Telegram changes its tune  —  I.  —  Last week, Platformer reported that Telegram practically bragged about how little it cooperates with law enforcement.  Its FAQ page stated that the company would not examine the contents of any private messages exchanged on the service, we reported.",
    "url": "https://www.platformer.news/telegram-durov-terrorgram-indictment/"
  },
  {
    "text": "Jack White sues Trump over the use of The White Stripes' ‘Seven Nation Army’: ‘This machine sues fascists’  — Jack White and The White Stripes have sued Donald Trump.  — White claims that Trump's campaign improperly used the duo's smash-hit “Seven Nation Army.”",
    "url": "https://www.businessinsider.com/jack-white-sues-trump-seven-nation-army-2024-9"
  },
  {
    "text": "James Earl Jones Dies: Revered ‘Field Of Dreams’ Star, Darth Vader Voice & Broadway Regular Was 93  —  James Earl Jones, the revered actor who voiced Star Wars villain Darth Vader, starred in Field of Dreams and many other films and Broadway shows and is an EGOT winner, died this morning at his home in Dutchess County, NY.",
    "url": "https://deadline.com/2024/09/james-earl-jones-dead-1236082801/"
  },
  {
    "text": "Justice Clarence Thomas faces new recusal demand after wife's alleged message to conservative group  —  Democratic Sen. Dick Durbin calls Ginni Thomas' email “deeply problematic.”  —  Associate Supreme Court Justice Clarence Thomas and his wife Virginia Thomas arrive at the Heritage Foundation, Oct. 21, 2021, in Washington, D.C.",
    "url": "https://abcnews.go.com/Politics/justice-clarence-thomas-faces-new-recusal-demand-after/story?id=113528871"
  },
  {
    "text": "A new poll finding voters think Donald Trump is a centrist should be a wake-up call for the news media  —  The news media isn't doing its job  —  There's a new New York Times/Siena College poll out and I'm not going to write about it because I generally don't write about polls … ",
    "url": "https://www.findinggravity.net/p/a-new-poll-finding-voters-think-donald"
  },
  {
    "text": "Sen. Tuberville blocks promotion of Lloyd Austin's top military aide  —  Lt. Gen. Ronald Clark was among the defense secretary's senior staff who, upon learning of his hospitalization, did not immediately notify the White House or Congress.  —  Sen. Tommy Tuberville has blocked the promotion … ",
    "url": "https://www.washingtonpost.com/national-security/2024/09/09/tommy-tuberville-ronald-clark-lloyd-austin/"
  },
  {
    "text": "Let's Be Clear: Putin Is Again Trying to Put Trump in the White House  —  More evidence emerges of Russia's covert assault on American democracy. … “I hate saying, ‘I told you so.’” That is one of the biggest lies.  I, for one, enjoying saying it.  That is, on the right occasions.",
    "url": "https://www.motherjones.com/politics/2024/09/trump-russia-putin-tenet-media-i-told-you-so/"
  },
  {
    "text": "When Your Little Ohio Town Becomes Port Au Prince and No One Cares UPDATE  —  The third world used to be something Americans used as a measuring stick to hold against other cities or countries we visited or dealt with.  When I would pull the newspapers back over a child sleeping in a doorway … ",
    "url": "https://hotair.com/tree-hugging-sister/2024/09/09/when-your-little-ohio-town-becomes-port-au-prince-and-no-one-cares-n3794246"
  },
  {
    "text": "GOP opposition appears to doom Speaker Johnson's initial plan to avert shutdown  —  Speaker Mike Johnson's (R-La.) opening bid to avert a government shutdown appears doomed to fail in the House this week amid widespread — and growing — Republican opposition, thwarting the top lawmaker's hopes … ",
    "url": "https://thehill.com/homenews/house/4870806-government-funding-cr-republican-opposition/"
  },
  {
    "text": "DeSantis' Government Is Doing Everything It Can to Defeat an Abortion Rights Measure  —  Critics say the latest attacks break the law.  —  The Florida government seems to be doing everything it can—including potentially breaking the law—to prevent voters from approving an abortion rights ballot measure in November.",
    "url": "https://www.motherjones.com/politics/2024/09/florida-amendment-4-abortion-desantis/"
  },
  {
    "text": "Trump Media shares close over 5% higher after poll seen as good news for ex-president … Shares of Trump Media closed up 5.5% on Monday, a respite from the stock's two-months-long losing streak ahead of the date when its majority shareholder, former President Donald Trump, can begin selling his shares.",
    "url": "https://www.cnbc.com/2024/09/09/djt-trump-media-shares-climb-more-than-7-percent.html"
  },
  {
    "text": "Harvey Weinstein rushed from Rikers Island to hospital for emergency heart surgery: Reports  —  Two months following his hospitalization for various health issues, Harvey Weinstein has been hospitalized for emergency cardiac treatment.  —  The 72-year-old movie mogul, who is currently awaiting … ",
    "url": "https://www.usatoday.com/story/entertainment/celebrities/2024/09/09/harvey-weinstein-hospitalized-heart-surgery/75148160007/"
  },
  {
    "text": "100%!  ABC Debate Moderator David Muir Hosts Most Pro-Harris, Left-Wing Newscast  —  Text to Speech  —  Vice President Kamala Harris will meet former President Donald Trump tomorrow night for a debate hosted by ABC News, and she could not have chosen a friendlier forum for their first encounter.",
    "url": "https://www.newsbusters.org/blogs/nb/rich-noyes/2024/09/09/100-abc-debate-moderator-david-muir-hosts-most-pro-harris-left-wing"
  }
]