[
  {
    "text": "Trump won't rule out a recession in 2025  —  “I hate to predict things like that,” Trump said when pressed about the possibility of a recession during a recorded interview that aired on “Sunday Morning Futures with Maria Bartiromo.”  —  President Donald Trump is confident that the country's economy … ",
    "url": "https://www.politico.com/news/2025/03/09/trump-recession-tariffs-2025-economy-00220016"
  },
  {
    "text": "BREAKING: DHS Detains Palestinian Student from Columbia Encampment, Advocates Say  —  On Saturday, Department of Homeland Security (DHS) officers detained Mahmoud Khalil - a recent Columbia University graduate who helped lead the Gaza solidarity encampment - at his New York City home … ",
    "url": "https://zeteo.com/p/breaking-dhs-detains-palestinian"
  },
  {
    "text": "Ice arrests Palestinian activist who helped lead Columbia protests, lawyer says  —  Mahmoud Khalil's arrest comes as Trump vows to deport foreign students involved in protests against Israel's war  —  A prominent Palestinian activist who helped lead Columbia University's student encampment movement … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/09/ice-arrests-palestinian-activist-columbia-protests"
  },
  {
    "text": "BREAKING: DHS Detains Lead Negotiator of Columbia Gaza Solidarity Encampment After Online Campaign by Pro-Israel Groups  —  NEW YORK CITY—On Saturday night, Department of Homeland Security (DHS) agents entered a student residential building at Columbia University in uptown New York … ",
    "url": "https://www.dropsitenews.com/p/dhs-detains-columbia-university-student-gaza"
  },
  {
    "text": "Chinese investors privately take stakes in Elon Musk's companies  —  Asset managers have been promoting tech mogul's ties to Donald Trump to lure capital to xAI, Neuralink and SpaceX  —  Wealthy Chinese investors are quietly funnelling tens of millions of dollars into private companies controlled … ",
    "url": "https://www.ft.com/content/66857e1e-a217-4ddd-8332-d9f0f75aa459"
  },
  {
    "text": "Musk's Tweet-Fueled Bubble May Be About to Burst  —  Elon Musk's business empire may be starting to wobble.  —  Over the past six weeks, the value of Tesla's shares has plunged about 40 percent, wiping out virtually all they had gained after the 2024 election.",
    "url": "https://www.nytimes.com/2025/03/09/opinion/musk-tesla-sales-stock-price.html"
  },
  {
    "text": "Playbook: Frustrated Dems unleash the F-bombs  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Happy Sunday.  Spring is just 11 days away.  You're an hour short on the day already.  We're here to catch you up.  Drop me a line: [email protected].  —  DRIVING THE DAY",
    "url": "https://www.politico.com/newsletters/playbook/2025/03/09/frustrated-dems-unleash-the-f-bombs-00219977"
  },
  {
    "text": "Secret Service shoots armed man near White House  —  The U.S. Secret Service shot an armed man near the White House around midnight on Sunday, the agency said in a statement.  —  The big picture: While there has been no reported threat to President Trump, the Secret Service has been under … ",
    "url": "https://www.axios.com/2025/03/09/secret-service-shoots-man-white-house"
  },
  {
    "text": "Top US health agency makes $25,000 buyout offer to most of its employees  —  Most of the 80,000 federal workers responsible for researching diseases, inspecting food and administering Medicare and Medicaid under the auspices of the Health and Human Services Department were emailed an offer … ",
    "url": "https://apnews.com/article/hhs-employee-buyouts-kennedy-cdc-nih-medicaid-bf5a746518b2b3fe967ab95a8e2a1a65"
  },
  {
    "text": "Fear of Trump Has Elite Law Firms in Retreat  —  Executive orders against Perkins Coie and Covington & Burling have chilled industry  —  Elite law firms formed a proud part of the opposition to the first Trump administration.  This time around, the industry is fearful of taking on a president … ",
    "url": "https://www.wsj.com/us-news/law/fear-of-trump-has-elite-law-firms-in-retreat-6f251dec?st=y1T1Ya&reflink=article_copyURL_share"
  },
  {
    "text": "Trump wants to see more than just a minerals deal to restart aid and intel to Ukraine  —  U.S. and Ukrainian officials are set to meet in Saudi Arabia this week, with Trump focused on Zelenskyy's willingness to make concessions in negotiations.  —  WASHINGTON — As U.S. and Ukrainian officials prepare … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-wants-see-just-minerals-deal-restart-aid-intel-ukraine-rcna195508"
  },
  {
    "text": "Musk Calls on US to Quit NATO, Stop Paying for Defense of Europe  —  Billionaire Elon Musk threw his weight behind a US exit from NATO, saying on his social media platform that it “doesn't make sense for America to pay for the defense of Europe.”  —  The senior adviser to US President Donald … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-09/musk-calls-on-us-to-quit-nato-stop-paying-for-defense-of-europe"
  },
  {
    "text": "German lawmakers float ‘Euro Eyes’ spy network amid uncertainty on US intel  —  Senior German lawmakers sound alarm bells that a sudden cutoff could leave Europe dangerously exposed.  —  BERLIN — The Bundestag's top intelligence experts are calling for a European spy network … ",
    "url": "https://www.politico.eu/article/germany-russia-bundestag-lawmakers-float-euro-spy-network-us-intel/"
  },
  {
    "text": "DOGE's $1 spending card limit touches everything from military research to trash pickup  —  The crackdown on routine expenses is part of a campaign by the president and billionaire Elon Musk to reset the scope and mission of America's sprawling bureaucracy.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/03/09/doge-government-credit-card-limits/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNDk2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyODc1MTk5LCJpYXQiOjE3NDE0OTY0MDAsImp0aSI6IjQ5NzkzODhlLWExMTUtNGIwZi05ODQ5LWQ1NDQyYzY1ZTVlYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzA5L2RvZ2UtZ292ZXJubWVudC1jcmVkaXQtY2FyZC1saW1pdHMvIn0.JUtu6tiMXb2rPlqTuzc4aV6E9_yJvlJI0hzWch6jeOc&itid=gfta"
  },
  {
    "text": "Romania Bars Far-Right Frontrunner From Presidential Race  —  Romania banned far-right front-runner Calin Georgescu from taking part in May presidential election in a move that deepens the country's political turmoil and risks provoking the wrath of Trump administration.",
    "url": "https://www.bloomberg.com/news/articles/2025-03-09/romanian-far-right-frontrunner-barred-from-may-presidential-vote"
  },
  {
    "text": "Trump's economic shock therapy  —  President Trump believes it's worth risking pain to achieve his medium-term goal of rewiring the U.S. economy.  He is attempting a form of economic shock therapy, while accepting there could be collateral damage.  —  Why it matters: That willingness … ",
    "url": "https://www.axios.com/2025/03/09/trump-economic-shock-inflation-recession-markets"
  },
  {
    "text": "Real chilling effects  —  Normally I record the classes I teach.  It gives students who miss class a chance to catch up.  I also make space in my classes to talk about what is happening in government right now.  A couple of weeks ago, students asked we keep the discussions, but stop recording the class.",
    "url": "https://donmoynihan.substack.com/p/real-chilling-effects"
  },
  {
    "text": "Tariffs, Even If Delayed, Could Get Big Reactions from the Auto Companies  —  Ford, GM, and Stellantis have all publicly thanked the feds for delaying tariffs, but it seems clear that they and other automakers will mount strong responses once they're implemented.",
    "url": "https://www.caranddriver.com/news/a64089939/tariff-production-moves-explainer/"
  },
  {
    "text": "The Populist vs. the Billionaire: Bannon, Musk and the Battle Within MAGA  —  President Trump has made clear he wants to keep both men and their allies within his movement, but the tensions are growing.  —  After word leaked out about a clash at the White House where members … ",
    "url": "https://www.nytimes.com/2025/03/09/us/politics/stephen-bannon-elon-musk-maga.html"
  }
]