[
  {
    "text": "Statement from President Joe Biden on the Equal Rights Amendment  —  I have supported the Equal Rights Amendment for more than 50 years, and I have long been clear that no one should be discriminated against based on their sex.  We, as a nation, must affirm and protect women's full equality once and for all.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/17/statement-from-president-joe-biden-on-the-equal-rights-amendment/"
  },
  {
    "text": "Biden says the Equal Rights Amendment is law.  What happens next is unclear  —  President Biden on Friday declared that he considers the Equal Rights Amendment to the Constitution is “the law of the land,” a surprising declaration that does not have any formal force of effect … ",
    "url": "https://www.npr.org/2025/01/17/nx-s1-5264378/biden-era-national-archivist-constitution"
  },
  {
    "text": "Biden says the Equal Rights Amendment should be considered ratified  —  President Joe Biden announced Friday that the Equal Rights Amendment should be considered a ratified addition to the U.S. Constitution, making a symbolic statement that's unlikely to alter a decades-long push for gender equality.",
    "url": "https://apnews.com/article/joe-biden-equal-rights-amendment-era-16b554dfe913797a52f894b72684bc45"
  },
  {
    "text": "Biden just announced there's a new constitutional amendment.  Huh?  —  A victory for women's rights — or an empty political stunt? … Three days before leaving office, President Joe Biden has made a surprising announcement: He declared that a decades-old proposed Constitutional amendment … ",
    "url": "https://www.vox.com/politics/395506/equal-rights-amendment-biden-law-land"
  },
  {
    "text": "Trump's inauguration expected to be moved indoors  —  President-elect Donald Trump's inauguration is expected to be moved indoors Monday due to dangerously cold temperatures projected in the nation's capital, multiple sources with direct knowledge of the plans told CNN.",
    "url": "https://www.cnn.com/2025/01/17/politics/inauguration-moving-indoors-cold-weather"
  },
  {
    "text": "Trump Moves Inauguration Indoors Amid Forecast of Extreme Cold  —  The change, a rare break with tradition, will deny Mr. Trump the pomp and large audience he hoped for at his second swearing-in.  —  President-elect Donald J. Trump said Friday that his inauguration would be moved inside the Capitol Rotunda because of weather concerns.",
    "url": "https://www.nytimes.com/2025/01/17/us/politics/trump-indoor-inauguration-cold.html?unlocked_article_code=1.p04.8POf.v9zmY1tZjtzE&smid=url-share"
  },
  {
    "text": "Vivek Ramaswamy plans to announce Ohio gubernatorial run  —  The co-leader of Trump's Department of Government Efficiency initiative plans to announce a run for Ohio governor, two people familiar with his plans said.  —  Biotech entrepreneur and former presidential candidate Vivek Ramaswamy plans … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/17/vivek-ramaswamy-ohio-governor-run/"
  },
  {
    "text": "Kennedy Sought to Stop Covid Vaccinations 6 Months After Rollout  —  Robert F. Kennedy Jr. petitioned the F.D.A. to revoke authorization of the shots at a time when they were in high demand and considered life-saving.  —  Robert F. Kennedy Jr., President-elect Donald J. Trump's choice to lead … ",
    "url": "https://www.nytimes.com/2025/01/17/health/rfk-jr-covid-vaccines.html?unlocked_article_code=1.p04.VtD-.Gp_05XPFwAE6&smid=url-share"
  },
  {
    "text": "'I'm Urging You Not to Run': How Schumer Pushed Biden to Drop Out  —  The New York senator, who swallowed concerns for months and then dragged his feet on sharing them with President Biden, ultimately told him he risked going down as one of the “darkest figures.”",
    "url": "https://www.nytimes.com/2025/01/17/us/politics/schumer-biden-2024-election.html?unlocked_article_code=1.p04.D3Rb.sg4LPljl-qnD&smid=url-share"
  },
  {
    "text": "CNN wants to exile Jim Acosta's show to the ‘Siberia of television news’ to stop him annoying Trump  —  CNN is apparently plotting to exile star anchor Jim Acosta — a longtime antagonist of President-elect Donald Trump — to the “Siberia of television news” in a bid to “throw a bone” … ",
    "url": "https://nypost.com/2025/01/17/media/cnn-exiling-jim-acosta-to-siberia-of-tv-news-to-throw-a-bone-to-trump/"
  },
  {
    "text": "Acosta at a Midnight Crossroads  —  CNN chief Mark Thompson wants Jim Acosta to take up the network's graveyard shift, delivering the anchor the proposal days before Donald Trump takes office. … Thompson, I'm told, delivered the veteran journalist a sudden and strange proposal: Move your show to midnight and anchor it until 2am ET.",
    "url": "https://www.status.news/p/jim-acosta-cnn-mark-thompson-midnight-offer"
  },
  {
    "text": "Exclusive |  CBS Owner Discusses Settling Trump Suit, With Merger Review on Tap  —  Paramount, owner of CBS, its namesake studio and several cable channels, has a major piece of business in front of the new administration: its planned merger with Skydance Media.",
    "url": "https://www.wsj.com/business/media/cbs-owner-discusses-settling-trump-suit-with-merger-review-on-tap-a5916925?st=J6cdvU&reflink=article_copyURL_share"
  },
  {
    "text": "Supreme Court upholds law that would ban TikTok in the U.S.  —  Washington — The Supreme Court on Friday upheld a new law that would lead to a ban of the social media platform TikTok, clearing the way for the widely popular app to shutter in the U.S. as soon as Sunday.",
    "url": "https://www.cbsnews.com/news/supreme-court-tiktok-ban-ruling/"
  },
  {
    "text": "HHS Announces 15 Additional Drugs Selected for Medicare Drug Price Negotiations in Continued Effort to Lower Prescription Drug Costs for Seniors  —  Medicare has selected 15 more drugs to negotiate directly with participating drug companies.  Building on the success of the first round of negotiations … ",
    "url": "https://www.cms.gov/newsroom/press-releases/hhs-announces-15-additional-drugs-selected-medicare-drug-price-negotiations-continued-effort-lower"
  },
  {
    "text": "Statement from President Joe Biden on Additional Clemency Actions  —  Today, I am commuting the sentences of nearly 2,500 people convicted of non-violent drug offenses who are serving disproportionately long sentences compared to the sentences they would receive today under current law, policy, and practice.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/17/statement-from-president-joe-biden-on-additional-clemency-actions/"
  },
  {
    "text": "This Storm-Battered Town Voted for Trump.  He Has Vowed to Overturn the Law That Could Fix Its Homes.  —  Cynthia Robertson could be forgiven for feeling that the banner was aimed at her.  Its white-on-black lettering — “FUCK BIDEN AND FUCK YOU FOR VOTING FOR HIM” — hung from the wooden house right across the street from her own.",
    "url": "https://www.propublica.org/article/trump-biden-ira-climate-red-states"
  },
  {
    "text": "Washington DC residents flee ahead of Trump inauguration: 'I can't be here'  —  Republicans and conservatives meanwhile are pouring in for celebrations with hotels being nearly 70% booked  —  Alejandra Whitney-Smith has plans for president-elect Donald Trump's inauguration next week: spend a week in a cabin without technology.",
    "url": "https://www.theguardian.com/us-news/2025/jan/17/trump-inauguration-washington-dc-residents-leave"
  },
  {
    "text": "Florida jury says CNN defamed Navy veteran in story about endangered Afghans  —  A Florida jury on Friday found that CNN defamed a U.S. Navy veteran in a 2021 story about people paid to rescue endangered Afghans following the Taliban takeover of that country.  —  It was an unusual ruling against a media outlet in a defamation case.",
    "url": "https://apnews.com/article/cnn-guilty-defamation-afghans-137bf5dbc2d72762d29c9f7596f63ec2"
  },
  {
    "text": "Senate greenlights GOP's first immigration bill, clearing the way for passage  —  Senators advanced Republicans' first swing at cracking down on illegal immigration on Friday, clearing the way for passage as soon as next week.  Ten Democratic senators joined all Republicans in voting … ",
    "url": "https://www.politico.com/live-updates/2025/01/17/congress/laken-riley-act-set-to-pass-00198969"
  },
  {
    "text": "Antiabortion advocates look for men to report their partners' abortions  —  Boyfriends and husbands can have uniquely personal and specific information necessary to help surface new lawsuits in states with abortion bans.  —  As anti abortion advocates launch legal efforts to stop abortion pills … ",
    "url": "https://www.washingtonpost.com/investigations/2025/01/17/texas-abortion-pills-lawsuit/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3MDkwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4NDcyMzk5LCJpYXQiOjE3MzcwOTAwMDAsImp0aSI6ImYxZTlkNTE0LTlhMzktNDkzYi04YWRkLTRkYjZlMjA2YzQ1YyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI1LzAxLzE3L3RleGFzLWFib3J0aW9uLXBpbGxzLWxhd3N1aXQvIn0.-_kt4NsOkKcVPEZDocEnXtcgjXRJEE7X7fN4B7fYY1M&itid=gfta"
  },
  {
    "text": "Supreme Court to hear case on opting out of lessons with LGBTQ+ books  —  Parents in Montgomery Count, Maryland, want to be able to opt out of instruction on gender and sexuality that they say goes against their religious convictions.  —  January 17, 2025  —  Live updates: Trump's inauguration … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/17/lgbtq-books-supreme-court-montgomery-maryland-schools-religion/"
  }
]