[
  {
    "text": "Trump booed and heckled by raucous crowd at Libertarian convention  —  Presidential candidate Donald Trump was booed and heckled by many in a raucous audience at the Libertarian National Convention on Saturday night, a marked change from the adulation he receives at rallies from his fervently loyal supporters.",
    "url": "https://www.reuters.com/world/us/trump-booed-heckled-by-raucous-crowd-libertarian-convention-2024-05-26/"
  },
  {
    "text": "Tim Scott on Trump Getting Booed by Libertarians: He's So Popular!  —  THEY WERE SAYING ‘BOO-URNS’  —  Trump was met with a wall of boos on Saturday night.  For one of his veepstakes frontrunners, that shows the ex-president is only getting more popular.  —  Donald Trump was met … ",
    "url": "https://www.thedailybeast.com/tim-scott-on-trump-getting-booed-by-libertarians-hes-so-popular"
  },
  {
    "text": "‘No wannabe dictators!’:  Donald Trump booed at Libertarian convention  —  Jeers suggest Republican presidential candidate faces a challenge in broadening his appeal  —  Donald Trump, the former US president, has suffered the rare humiliation of getting booed and heckled during a raucous speech to the Libertarian National Convention.",
    "url": "https://www.theguardian.com/us-news/article/2024/may/26/no-wannabe-dictators-donald-trump-booed-at-libertarian-convention"
  },
  {
    "text": "Denial about Donald Trump has reached a new low  —  Authoritarians have often told us what they are going to do, but people have rarely believed them.  —  Republican presidential candidate Donald Trump, who incited a violent insurrection in January 2021 to try and remain in office illegally … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-authoritarianism-american-denial-2024-rcna153962"
  },
  {
    "text": "Proposed Texas GOP platform calls for the Bible in schools, electoral changes that would lock Democrats out of statewide office  —  The platform was voted on Saturday, with tallies expected next week.  Other planks call abortion homicide and gender-transition care “child abuse.”",
    "url": "https://www.texastribune.org/2024/05/25/texas-republican-party-convention-platform/"
  },
  {
    "text": "Russia Steps Up a Covert Sabotage Campaign Aimed at Europe  —  Russian military intelligence, the G.R.U., is behind arson attacks aimed at undermining support for Ukraine's war effort, security officials say.  —  U.S. and allied intelligence officials are tracking an increase … ",
    "url": "https://www.nytimes.com/2024/05/26/us/politics/russia-sabotage-campaign-ukraine.html"
  },
  {
    "text": "Who is Ross Ulbricht, the prison inmate who could be key to Trump's libertarian support  —  Former President Donald Trump received a frosty reception at this weekend's Libertarian Party's national convention, but one of his few applause lines was for promising to commute a sentence for a man named Ross Ulbricht.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3017931/ross-ulbricht-prison-inmate-key-trump-libertarian-support/"
  },
  {
    "text": "Trump's new policy wonks are proteges of Stephen Miller and Newt Gingrich … - Haley and Worthington write the first drafts of scripts Trump uses to record policy videos as well as the text on how a second Trump administration would handle issues from education to energy and immigration.",
    "url": "https://www.axios.com/2024/05/26/trump-campaign-policy-stephen-miller-newt-gingrich"
  },
  {
    "text": "Criminal justice backlash heads to the California ballot  —  Those who pushed past reforms, including Gov. Gavin Newsom, have to decide which parts of that legacy are worth defending.  —  This fall, California voters will have multiple chances to decide whether their state has gone too far … ",
    "url": "https://www.politico.com/news/2024/05/26/criminal-justice-backlash-heads-to-the-california-ballot-00159988"
  },
  {
    "text": "Putin Shakes Up Things at Home as His Optimism About Ukraine War Rises  —  Despite years of criticism, President Vladimir V. Putin has only now changed his defense minister and allowed high-level corruption arrests.  —  Periodic outcries over incompetence and corruption at the top … ",
    "url": "https://www.nytimes.com/2024/05/26/world/europe/russia-corruption-putin.html"
  },
  {
    "text": "Hill GOP urges Trump to consider a running mate with center-right appeal — maybe even Haley  —  Rep. Ryan Zinke (R-Mont.) advised Trump to look at a VP pick who “really reflects areas where he needs to be more competitive to win.”  —  Donald Trump is getting clear advice from a sizable number … ",
    "url": "https://www.politico.com/news/2024/05/26/trump-running-mate-haley-gop-00159747"
  },
  {
    "text": "Washington Post bombshell: Washington Post buried Alito flag story for three years  —  Last week, many of us learned from The New York Times that an upside-down American flag had been temporarily raised over the Alito household in the days after January 6, 2021.",
    "url": "https://www.lawdork.com/p/washington-post-bombshell-washington"
  },
  {
    "text": "Netanyahu's split with Biden and the Democrats was years in the making  —  The Israeli leader's longtime strategy of aligning with the GOP has helped shatter the American consensus behind Israel.  —  When President Barack Obama hosted Prime Minister Benjamin Netanyahu in the Oval Office in 2014 … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/26/netanyahu-embrace-republicans-strategy-israel-divisions/"
  },
  {
    "text": "The Hard Problem of Bringing Trump Into Focus  —  For all the news that the former president makes, the Biden team is struggling to make the campaign about him.  —  The video shows Donald Trump standing at a gilded lectern in Mar-a-Lago.  It's December, a week or so before Christmas … ",
    "url": "https://www.nytimes.com/2024/05/26/magazine/trump-reaction-videos-biden-campaign.html"
  },
  {
    "text": "Rafah rocket volley targets Tel Aviv area, in first such attack in 4 months  —  One person lightly hurt when shrapnel hits a house in Herzliya; Hamas takes responsibility for attack, which IDF predicted would be likely as troops push into southern Gaza city  —  The Hamas terror group fired … ",
    "url": "https://www.timesofisrael.com/rocket-volley-fired-from-rafah-targets-tel-aviv-area-in-first-such-attack-in-months/"
  }
]