[
  {
    "text": "Live updates: President Joe Biden ends his 2024 bid  —  President Joe Biden says he's ready to return to the campaign trail, even as a growing chorus of Democratic lawmakers called for him to step aside.  —  Meanwhile, Donald Trump on Saturday held his first public campaign rally since … ",
    "url": "https://apnews.com/live/biden-trump-election-campaign-updates"
  },
  {
    "text": "My Statement on President Biden's Announcement  —  Joe Biden has been one of America's most consequential presidents, as well as a dear friend and partner to me.  Today, we've also been reminded — again — that he's a patriot of the highest order.  —  Sixteen years ago … ",
    "url": "https://t.co/Bs2ZumFXxe"
  },
  {
    "text": "Republicans could file challenges if Biden replaced, Speaker Johnson says  —  “Every state has its own system,” he said of election laws.  —  House Speaker Mike Johnson reiterated Sunday that any attempt by Democrats to sub in a new candidate in place of President Joe Biden is likely to be met by legal challenges.",
    "url": "https://www.politico.com/news/2024/07/21/biden-johnson-2024-elections-laws-00169973"
  },
  {
    "text": "Election 2024 live updates: Biden says he will end his re-election bid  —  President Joe Biden said he is stepping aside from the presidential race in a letter posted to X.  “It has been the greatest honor of my lift to serve as your president,” he wrote.  “And while it has been my intention … ",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/trump-biden-president-election-live-updates-rcna162646"
  },
  {
    "text": "Biden drops out: World leaders pay wary tribute  —  Following are some reactions from abroad to President Joe Biden's decision on Sunday to pull out of his campaign to seek reelection in November.  —  British Prime Minister Keir Starmer  —  “I respect President Biden's decision … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/07/21/biden-drops-out-world-reaction/74491718007/"
  },
  {
    "text": "Biden's exit makes Trump the oldest nominee in U.S. history … - Biden and Trump were the only presidents older than 70 at the start of their terms. … - The 118th Congress, one of the oldest in U.S. history, drove debates last year about term limits and fitness for office.",
    "url": "https://www.axios.com/2024/07/21/kamala-harris-age-presidential-nominee"
  },
  {
    "text": "Pelosi spoke to Biden before he dropped out of 2024 presidential race … Former House Speaker Nancy Pelosi, D-Calif., spoke with President Joe Biden on Saturday about the fallout from his disastrous debate performance against former President Donald Trump and how it's hurting his legacy … ",
    "url": "https://www.cnbc.com/2024/07/21/pelosi-spoke-to-biden-the-day-before-he-dropped-out-of-2024-election.html"
  },
  {
    "text": "Biden drops out of 2024 presidential race  —  He struggled to recover from a disastrous debate and Democrats' doubts.  —  LIVE  —  President Joe Biden speaks alongside Prime Minister of the Czech Republic Petr Fiala before a bilateral meeting in the Oval Office of the White House, April 15, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-drops-2024-presidential-race/story?id=111648603"
  },
  {
    "text": "Election 2024 live updates: Biden says he is exiting the race, endorses Harris  —  Rep. James Clyburn, D-S.C., whose endorsement in 2020 was widely viewed as helping save Biden's flailing candidacy, is also backing Vice President Kamala Harris. … Trump had a nickname for the vice president at the ready",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/trump-biden-president-election-live-updates-rcna162646#rcrd47454"
  },
  {
    "text": "Raging Trump Reacts to Biden Bow-Out: ‘Crooked Biden Was Not Fit to Run’  —  TRUMP TAKE  —  Biden is “the Worst President, by far, in the History of our Nation,” Trump wrote on Truth Social.  —  Journalist  —  Former President and current Republican presidential nominee Donald Trump … ",
    "url": "https://www.thedailybeast.com/raging-trump-reacts-to-biden-bow-out-crooked-biden-was-not-fit-to-run"
  },
  {
    "text": "Election 2024 live updates  —  Biden steps aside as Democratic nominee, endorses Harris  —  President Biden is ending his presidential campaign, a momentous decision that upends the 2024 presidential race, and is endorsing Vice President Harris for the top of the ticket.",
    "url": "https://www.washingtonpost.com/elections/2024/07/21/election-2024-biden-trump-campaign-updates/"
  },
  {
    "text": "Bill, Hillary Clinton endorse Kamala Harris for Democratic nomination  —  President Joe Biden announced his withdrawal from the 2024 presidential race on Sunday afternoon.  In response, former President Bill Clinton and former Secretary of State Hillary Clinton promptly endorsed Vice President Kamala Harris … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/21/bill-hillary-clinton-endorse-kamala-harris/74491761007/"
  },
  {
    "text": "Scoop: Harris works the phones, trying to lock down nomination … - She's doing so while acknowledging that despite endorsements from Biden, former President Clinton and former Secretary of State Hillary Clinton, Democratic delegates are the ones who'll pick the nominee.",
    "url": "https://www.axios.com/2024/07/21/kamala-harris-democrats-president-nomination"
  },
  {
    "text": "Since Leaving Butler, Trump Has Foregone the Best Medical Care and Is Withholding CT Scan Results  —  Fresh off his stunt calls for Joe Biden to be drug tested during the debate, Ronny Jackson — the lapsed doctor who turned the White House into a pill mill and covered up Trump's near-lethal COVID … ",
    "url": "https://www.emptywheel.net/2024/07/21/since-butler-trump-has-foregone-competent-medical-care-and-is-withholding-ct-scan-results/"
  },
  {
    "text": "Trump favorability rises following shooting, majority of Americans want Biden to end campaign: POLL  —  More Americans also blame Trump for rise in political violence.  —  Republican presidential nominee and former President Donald Trump gives his acceptance speech at the Republican National Convention … ",
    "url": "https://abcnews.go.com/Politics/trump-favorability-rises-shooting-majority-americans-biden-end/story?id=112112043"
  },
  {
    "text": "Expect some GOP legal challenges to taking Biden off the ballot.  But they're longshots.  —  Don't believe the hype: Republicans are unlikely to gain traction in legal efforts to prevent Democrats from taking President Joe Biden off the ballot.  No state will have printed ballots prior … ",
    "url": "https://www.politico.com/live-updates/2024/07/21/joe-biden-drops-out-election/gop-legal-challenges-00170014"
  }
]