[
  {
    "text": "Taiwan voters dismiss China warnings and hand ruling party a historic third consecutive presidential win  —  Taiwan's ruling Democratic Progressive Party pulled off a historic third consecutive presidential victory on Saturday as voters shrugged off warnings by China that their re-election would increase the risk of conflict.",
    "url": "https://www.cnn.com/2024/01/13/asia/taiwan-presidential-election-results-intl-hnk"
  },
  {
    "text": "Taiwan Elects US-Friendly President Defying China's Warnings  — The ruling party's Lai Ching-te secured comfortable victory  — Result is setback for Beijing's aim to forge closer ties  —  Taiwan elected Lai Ching-te as president of the global chip hub at the center of US-China tensions … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-13/taiwan-set-to-elect-president-reviled-by-china-in-setback-for-xi"
  },
  {
    "text": "Donald Trump ordered to pay The New York Times and its reporters nearly $400,000 in legal fees  —  Former President Donald Trump was ordered Friday to pay nearly $400,000 in legal fees to The New York Times and three investigative reporters after he sued them unsuccessfully … ",
    "url": "https://apnews.com/article/trump-new-york-times-taxes-lawsuit-slapp-f39342501d9a2a5cfd36181f9f336215"
  },
  {
    "text": "Record winter storm upends plans in final Iowa caucus stretch  —  Freezing temperatures and record-level snowfall has battered the early-state ahead of its nominating contest, sparking concerns of turnout  —  DES MOINES — Republican presidential front-runner Donald Trump's campaign had planned … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/12/record-winter-storm-iowa-caucus/"
  },
  {
    "text": "DeSantis plans to go from Iowa to South Carolina, instead of New Hampshire, as he targets Haley  —  Ron DeSantis is taking his battle with Nikki Haley directly to her home state, planning to head straight to South Carolina — which holds the first GOP votes in the South — after Monday's Iowa caucuses.",
    "url": "https://apnews.com/article/ron-desantis-nikki-haley-donald-trump-south-carolina-ea62d9ad2674747f3dbb01a323f92cfd"
  },
  {
    "text": "US warns ships to stay out of parts of Red Sea as Houthi rebels vow retaliation for US, UK strikes  —  US, UK strikes target Yemen's Houthis: AP explains  —  The U.S. Navy on Friday warned American-flagged vessels to steer clear of areas around Yemen in the Red Sea and the Gulf of Aden … ",
    "url": "https://apnews.com/article/yemen-houthis-us-ship-attacks-bombing-red-sea-iran-cc06d9186a00d1f22bea6b9c14dda12a"
  },
  {
    "text": "Biden campaign turns to a Jon Stewart vet for research help  —  The president's reelection effort is starting to fill out.  —  President Joe Biden's campaign is tapping a veteran of Jon Stewart's old show and a top aide from a progressive stalwart in the latest move to build out its national staff.",
    "url": "https://www.politico.com/news/2024/01/13/biden-campaign-2024-jon-stewart-00135448"
  },
  {
    "text": "Lloyd Austin Confronts the Perils of Being a Private Man in a Public Job  —  President Biden said his defense secretary made an error in judgment in not keeping the White House informed of his hospitalization.  But keeping a low profile has long defined the Pentagon chief.",
    "url": "https://www.nytimes.com/2024/01/13/us/politics/lloyd-austin-private-public.html"
  },
  {
    "text": "Ahead of Iowa Caucuses, Voters Fear the Prospect of Civil Unrest  —  As Monday's caucuses approach, voters casually throw around the prospect of World War III and civil unrest, anxious of divisions they fear are tearing the country apart.  —  Presidential elections traditionally speak to future aspirations … ",
    "url": "https://www.nytimes.com/2024/01/13/us/politics/iowa-caucuses-anxiety-fear.html"
  },
  {
    "text": "Vivek Ramaswamy campaign still facing voter questions on race and religion days before Iowa  —  Apoorva Ramaswamy fielded several questions about her and her husband's race, ethnicity and beliefs during campaign stops across Iowa.  —  FORT MADISON, Iowa — Apoorva Ramaswamy had a simple ask … ",
    "url": "https://www.nbcnews.com/politics/2024-election/vivek-ramaswamy-campaign-still-facing-voter-questions-race-religion-da-rcna133721"
  },
  {
    "text": "Two US Navy sailors reported missing while conducting operations off coast of Somalia  —  Two U.S. Navy sailors were reported missing at sea while conducting operations off the coast of Somalia on Thursday evening, the U.S. military said in a statement on Friday, adding that search and rescue operations were ongoing to locate them.",
    "url": "https://www.reuters.com/world/two-us-navy-sailors-reported-missing-while-conducting-operations-off-coast-2024-01-13/"
  },
  {
    "text": "IRS says it collected $360 million more from rich tax cheats as its funding is threatened yet again  —  The IRS says it has collected an additional $360 million in overdue taxes from delinquent millionaires as the agency's leadership tries to promote the latest work it has done to modernize … ",
    "url": "https://apnews.com/article/irs-tax-biden-inflation-reduction-act-ceacc306233f1a41e0e41e81e89a60a5"
  },
  {
    "text": "OpenAI Quietly Deletes Ban on Using ChatGPT for “Military and Warfare”  —  OpenAI this week quietly deleted language expressly prohibiting the use of its technology for military purposes from its usage policy, which seeks to dictate how powerful and immensely popular tools like ChatGPT can be used.",
    "url": "https://theintercept.com/2024/01/12/open-ai-military-ban-chatgpt/"
  },
  {
    "text": "Fox News Kicks Mike Lindell and His MyPillow Ads to the Curb  —  The pillow magnate claims Fox News “canceled” him for hiring Lou Dobbs, but a Fox News source with knowledge told The Daily Beast that Lindell simply hasn't paid his bills.  —  MAGA pillow magnate Mike Lindell alleges that Fox News … ",
    "url": "https://www.thedailybeast.com/fox-news-kicks-mike-lindell-and-his-mypillow-ads-to-the-curb"
  },
  {
    "text": "Hunter Biden's Offer to Testify Won't Protect Him From Contempt, GOP Says  —  If Republicans 'want to play chicken with this, fine, that's their choice,' a source close to Hunter Biden told The Messenger  —  House Republicans said Friday they will continue to pursue contempt of Congress charges … ",
    "url": "https://themessenger.com/politics/hunter-bidens-offer-to-testify-wont-protect-him-from-contempt-gop-says"
  }
]