[
  {
    "text": "Judge denies one of Trump's motions to dismiss classified documents case  —  U.S. District Judge Aileen Cannon issued the ruling after hearing daylong arguments from lawyers for the former president and special counsel Jack Smith's office.  —  FORT PIERCE, Fla. — The judge presiding … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-florida-classified-documents-dismiss-rcna143135"
  },
  {
    "text": "Voters don't have a clue about how much worse Trump's second term would be  —  Gameli Fenuku, a 22-year-old Black college student in Richmond, Va. is exactly the demographic you'd think would never vote for Donald Trump in November — and indeed he may not.  But Fenuku told the New York Times … ",
    "url": "https://www.inquirer.com/columnists/trump-47-second-term-dangers-authoritarianism-20240314.html#loaded"
  },
  {
    "text": "Manhattan D.A. Offers to Delay Trump Hush-Money Trial for Review of Records  —  The proposal by the Manhattan district attorney's office came in response to Donald J. Trump's request for a 90-day delay to allow his lawyers time to review a new batch of records.",
    "url": "https://www.nytimes.com/2024/03/14/nyregion/alvin-bragg-trump-trial-delay.html"
  },
  {
    "text": "Judge rejects bid by Donald Trump to throw out classified documents case on constitutional grounds  —  Former President Donald Trump arrives at Florida court for classified documents case  —  A federal judge on Thursday rejected one bid by Donald Trump to throw out out his classified documents criminal case … ",
    "url": "https://apnews.com/article/trump-classified-documents-maralago-presidential-records-200d4c73d7c7dd75d9c9d878b77d05ce"
  },
  {
    "text": "I Listened to Trump's Rambling, Unhinged, Vituperative Georgia Rally—and So Should You  —  The ex-President is building a whole new edifice of lies for 2024.  —  I'm sure you had better things to do on Saturday evening than watch Donald Trump rant for nearly two hours to an audience of cheering fans in Rome, Georgia.",
    "url": "https://www.newyorker.com/news/letter-from-bidens-washington/i-listened-to-trumps-rambling-unhinged-vituperative-georgia-rally-and-so-should-you"
  },
  {
    "text": "Rep. Matt Gaetz subpoenaed in defamation suit by woman he allegedly had sex with as minor: Sources  —  Gaetz could be asked under oath about the allegations involving a minor.  —  Rep. Matt Gaetz asks questions during a House Judiciary Committee hearing on Capitol Hill in Washington, D.C., on July 13, 2023.",
    "url": "https://abcnews.go.com/US/rep-matt-gaetz-subpoenaed-defamation-suit-woman-allegedly/story?id=108098265"
  },
  {
    "text": "Matt Gaetz subpoenaed in friend's lawsuit accusing others of defamation in sex trafficking probe  —  The Justice Department has told the Florida Republican that he will not face any charges as a result of its probe.  Gaetz is not a direct party to the defamation lawsuit.",
    "url": "https://www.nbcnews.com/politics/congress/matt-gaetz-subpoenaed-friends-lawsuit-accusing-others-defamation-sex-t-rcna143489"
  },
  {
    "text": "GOP nominee to run North Carolina public schools called for violence against Democrats, including executing Obama and Biden  —  The Republican nominee for superintendent overseeing North Carolina's public schools and its $11 billion budget has a history marked by extreme and controversial comments … ",
    "url": "https://www.cnn.com/2024/03/14/politics/kfile-gop-nominee-north-carolina-public-schools-michele-morrow-executing-democrats/"
  },
  {
    "text": "Indicted FBI Rat Was Paid by Texas Firm Tied to Trump World: Report  —  MONEY HONEY  —  An American company that forked over a huge payday to onetime FBI informant Alexander Smirnov has ties to a British firm owned by business associates of Donald Trump, according to The Guardian.",
    "url": "https://www.thedailybeast.com/indicted-fbi-informant-alexander-smirnov-was-paid-by-texas-firm-tied-to-trump-world-report"
  },
  {
    "text": "Bernie Sanders pushes bill to establish a four-day workweek  —  The Sanders-led bill would reduce the standard workweek from 40 to 32 hours over four years and protect workers' pay and benefits.  —  Sen. Bernie Sanders, I-Vt., held a hearing Thursday on a bill he introduced to reduce … ",
    "url": "https://www.nbcnews.com/politics/congress/bernie-sanders-pushes-bill-establish-four-day-workweek-rcna143354"
  },
  {
    "text": "No Labels announces committee to select presidential candidate  —  A leader of the centrist group says it will halt the effort after several months if it appears the ticket would help former president Donald Trump win  —  The centrist group No Labels announced a committee of 12 people Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/14/no-labels-presidential-candidate/"
  },
  {
    "text": "Jury reaches verdict in James Crumbley's involuntary manslaughter trial  —  Crumbley was charged in connection with son Ethan's 2021 school shooting at Oxford High School in Michigan.  His wife, Jennifer, was convicted on the same charge.  —  PONTIAC, Mich. — The 12 jurors weighing the fate … ",
    "url": "https://www.nbcnews.com/news/us-news/verdict-james-crumbley-involuntary-manslaughter-trial-rcna143174"
  },
  {
    "text": "Biden is coming out in opposition to plans to sell US Steel to a Japanese company  —  WASHINGTON (AP) — President Joe Biden is coming out in opposition to the planned sale of U.S. Steel to Nippon Steel of Japan, saying in a statement to be released Thursday that the U.S. needs to … ",
    "url": "https://apnews.com/article/biden-steel-nippon-kishida-merger-purchase-201b3d5719bcf77067cb81d181442afb"
  },
  {
    "text": "Trump-backed Senate candidate faces GOP worries that he could be linked to adult website profile  —  For Republicans eager to regain the Senate majority this year, Ohio offers a prime opportunity to pick up a critical seat.  But ahead of Tuesday's primary election, there's mounting anxiety inside … ",
    "url": "https://apnews.com/article/ohio-senate-election-2024-bernie-moreno-09e34f6331708c192c89d7c1727c2458"
  },
  {
    "text": "CEO of Data Privacy Company Onerep.com Founded Dozens of People-Search Firms  —  The data privacy company Onerep.com bills itself as a Virginia-based service for helping people remove their personal information from almost 200 people-search websites.  However, an investigation into the history … ",
    "url": "https://krebsonsecurity.com/2024/03/ceo-of-data-privacy-company-onerep-com-founded-dozens-of-people-search-firms/"
  },
  {
    "text": "More Counties Saw Population Gains in 2023  —  Note: Data will be available before 8 a.m. ET on public release day.  —  MARCH 14, 2024 - More U.S. counties experienced population gains than losses in 2023, as counties in the South saw faster growth and more Northeast and Midwest counties … ",
    "url": "https://www.census.gov/newsroom/press-releases/2024/population-estimates-more-counties-population-gains-2023.html"
  },
  {
    "text": "Fulton County judge says Fani Willis disqualification ruling ‘should be out tomorrow’  —  “These kind of orders take time to write,” the judge said.  —  Fulton County District Attorney Fani Willis looks on during a hearing on the Georgia election interference case, March, 1, 2024, in Atlanta.",
    "url": "https://abcnews.go.com/Politics/fulton-county-judge-fani-willis-disqualification-ruling-tomorrow/story?id=108137448"
  },
  {
    "text": "Tornadoes Leave Chaos and Destruction After Pounding 3 States  —  Police walked back confirmation that at least 3 people died in Indiana after a tornado swept through a trailer park.  —  Police have walked back earlier claims that at least three people were killed in Indiana … ",
    "url": "https://www.thedailybeast.com/tornadoes-leave-wake-of-death-and-destruction-after-pounding-3-states"
  },
  {
    "text": "At Abortion Clinic Visit, Harris Says U.S. Is Confronting ‘Health Care Crisis’  —  The trip made history and offered a vivid look at how the politics of abortion rights have transformed since the Supreme Court overturned Roe v. Wade.  —  Vice President Kamala Harris described the flood … ",
    "url": "https://www.nytimes.com/2024/03/14/us/politics/kamala-harris-abortion.html"
  }
]