[
  {
    "text": "Hunter Biden verdict throws ‘sand in the gears’ of GOP's attacks on legal system  —  Other Republicans were all over the map, including Rep. Matt Gaetz (R-Fla.), who called it “kinda dumb tbh.”  —  Former President Donald Trump's campaign cast Hunter Biden's guilty verdict on felony gun charges Tuesday as a … ",
    "url": "https://www.politico.com/news/2024/06/11/trump-campaign-hunter-biden-reaction-00162726"
  },
  {
    "text": "Jurors detail to CNN how they reached guilty verdict in Hunter Biden gun trial  —  The jury in the Hunter Biden gun case was deadlocked in an initial vote Monday night over whether to convict the president's son, one of the jurors told CNN in an interview, adding that “no politics came into play” … ",
    "url": "https://www.cnn.com/2024/06/11/politics/hunter-biden-jury/"
  },
  {
    "text": "Hunter Biden Conviction Blows Up Republican Conspiracy Theories  —  Hunter Biden's conviction in Delaware over a minor charge is significant mainly because it blows to smithereens the arguments Republicans have made on behalf of Donald Trump.  There's the small claim that Trump didn't receive a fair trial … ",
    "url": "https://nymag.com/intelligencer/article/hunter-biden-conviction-blows-up-gop-conspiracy-theories.html"
  },
  {
    "text": "Hunter Biden found guilty in federal gun case … - “We respect the jury process, and as we have done throughout this case, we will continue to vigorously pursue all the legal challenges available to Hunter,” Lowell said.  — Hunter said that he is “more grateful today for the love and support” … ",
    "url": "https://www.axios.com/2024/06/11/hunter-biden-gun-trial-verdict"
  },
  {
    "text": "A group of House Democrats steps up to try to stop Project 2025 and a Trump White House  —  Warning about the far-right Project 2025 agenda for a Donald Trump White House, a group of House Democrats has launched a task force to start fighting the proposal and stop it from taking hold if the Republican former president returns to power.",
    "url": "https://apnews.com/article/project-2025-trump-biden-election-congress-6899a1167a4522b1c8be371f7abe7ee9"
  },
  {
    "text": "Gaza Chief's Brutal Calculation: Civilian Bloodshed Will Help Hamas  —  Yahya Sinwar's correspondence with compatriots and mediators shows he is confident that Hamas can outlast Israel",
    "url": "https://www.wsj.com/world/middle-east/gaza-chiefs-brutal-calculation-civilian-bloodshed-will-help-hamas-626720e7"
  },
  {
    "text": "Unfounded attacks on the Justice Department must end  —  Conspiracy theories, falsehoods and threats of violence against DOJ personnel are not normal.  —  Merrick Garland is attorney general of the United States.  —  Last week, a California man was convicted of threatening to bomb … ",
    "url": "https://www.washingtonpost.com/opinions/2024/06/11/merrick-garland-justice-department-threats-fbi-2024/"
  },
  {
    "text": "Sinclair injects deceptive attacks on Biden's age into dozens of local broadcasts  —  This is a special joint edition of Public Notice and Judd Legum's Popular Information.  You can subscribe to Popular Information here.  —  Two outlets controlled by right-wing media tycoons are working … ",
    "url": "https://www.publicnotice.co/p/sinclair-biden-slipping-wall-street-journal-hit"
  },
  {
    "text": "“False gospel”: The new GOP attack on Dolly Parton is a tactic borrowed from the Christian right  —  Fundamentalists disparage mainstream culture as “demonic” — Republicans just substitute the word “woke”  —  It was inevitable that Republicans would go after Dolly Parton.",
    "url": "https://www.salon.com/2024/06/11/false-gospel-the-new-on-dolly-parton-is-a-tactic-borrowed-from-the-christian-right/"
  },
  {
    "text": "Marjorie Taylor Greene creates headaches for House GOP as leaders weigh how much attention to give the Trump loyalist  —  GOP Rep. Marjorie Taylor Greene was a team player and a reliable Republican leadership ally for nine months under former House Speaker Kevin McCarthy … ",
    "url": "https://www.cnn.com/2024/06/11/politics/marjorie-taylor-greene-republicans/"
  },
  {
    "text": "Six suspected terrorists with ISIS ties arrested in sting operation in New York, Los Angeles and Philadelphia: sources  —  Six Russian nationals suspected to have terror ties to ISIS have been arrested in a coordinated sting operation spanning Los Angeles, New York and Philadelphia, The Post can exclusively reveal.",
    "url": "https://nypost.com/2024/06/11/us-news/six-suspected-terrorists-with-isis-ties-arrested-in-sting-operation/"
  },
  {
    "text": "Alito's Wife Caught on Tape Spewing Venom at Everyone  —  A secret tape has exposed what Supreme Court Justice Samuel Alito's wife, Martha-Ann, really thinks behind closed doors—and the truth isn't pretty.  In the span of just a few minutes, Alito promised revenge on the media … ",
    "url": "https://newrepublic.com/post/182554/alito-wife-caught-tape-pride-media-left-flag"
  },
  {
    "text": "Is Donald Trump okay?  —  His story about hypothetically being electrocuted is another glimpse into a mind that is unwell.  —  It is irresponsible to obsess over President Biden's tendency to mangle a couple of words in a speech while Donald Trump is out there sounding detached from reality.",
    "url": "https://www.washingtonpost.com/opinions/2024/06/10/trump-sharks-electrocuted-boat-story/"
  },
  {
    "text": "Dark money news outlets outpacing local daily newspapers … - As of last year, there were only 1,213 daily local newspapers in the U.S. That number may have gone down significantly in the time since, but the researchers who track that data have yet to release an updated figure for 2024.",
    "url": "https://www.axios.com/2024/06/11/partisan-news-websites-dark-money"
  },
  {
    "text": "9th Circuit says California ban on gun sales on state property is constitutional  —  California laws barring the sale of firearms and ammunition at fairgrounds and other state property are constitutional, the U.S. 9th Circuit Court of Appeals ruled Tuesday.  —  Judge Richard R. Clifton … ",
    "url": "https://www.latimes.com/california/story/2024-06-11/9th-circuit-says-california-ban-on-gun-sales-on-state-property-is-constitutional"
  },
  {
    "text": "Stop Saying Florida Isn't Safe for Gay People.  It's Fine.  —  My local haunt in Pensacola lets you smoke inside.  Gay bars in New York will charge you 18 bucks for a gin and tonic.  That's real oppression.  —  Last weekend I got drunk at my local gay bar in Pensacola, Florida.",
    "url": "https://www.thefp.com/p/florida-safe-gay-lgbt-desantis"
  },
  {
    "text": "The Biggest Lie Trump-Biden 2024 Rematch Voters Are Telling Themselves  —  Most would-be dictators run for office downplaying or sugarcoating their intentions, trying to lure voters with a vanilla appeal.  But once elected, the autocratic elements take over, either immediately or gradually … ",
    "url": "https://slate.com/news-and-politics/2024/06/biggest-lie-trump-biden-2024-voters.html"
  },
  {
    "text": "In Trump's orbit, some muse about mandatory military service  —  Only 1 percent of the U.S. population serves in the armed forces.  Some in the former president's camp say it's time more young adults put “some skin in the game.”  —  TEXARKANA, Tex. — Kyra Rousseau remembers feeling trapped … ",
    "url": "https://www.washingtonpost.com/national-security/2024/06/10/trump-military-draft-mandatory-service/"
  },
  {
    "text": "Chiquita Held Liable for Deaths During Colombian Civil War  —  A South Florida jury found the company liable for killings committed by a paramilitary group that was on the banana producer's payroll.  —  A jury in South Florida has ruled that Chiquita Brands is liable for eight killings carried … ",
    "url": "https://www.nytimes.com/2024/06/11/world/americas/chiquita-banana-lawsuit-colombia.html"
  },
  {
    "text": "Accusation of insider trading sparks tense moment in Utah's GOP U.S. Senate primary debate  —  Rep. John Curtis rebutted the accusation by Trent Staggs during the Republican primary debate.  —  Utah's 2024 U.S. Senate Republican primary election debate was mostly a ho-hum affair.",
    "url": "https://www.sltrib.com/news/politics/2024/06/10/accusations-insider-trading-spark/"
  },
  {
    "text": "Biden proposes to ban medical debt from credit reports, loan decisions  —  The draft rules, arriving less than five months before Election Day, are part of President Biden's argument that he is addressing pocketbook problems.  —  The Biden administration Tuesday will announce rules … ",
    "url": "https://www.washingtonpost.com/health/2024/06/11/biden-cfpb-medical-debt/"
  },
  {
    "text": "Hamas says it accepts UN-backed Gaza truce plan, US cites ‘hopeful sign’  —  Hamas accepts a U.N. resolution backing a plan to end the war with Israel in Gaza and is ready to negotiate details, a senior official of the Palestinian militant group said on Tuesday in what the U.S. Secretary of State called “a hopeful sign”.",
    "url": "https://www.reuters.com/world/middle-east/blinken-says-hamas-signal-support-un-backed-gaza-truce-deal-is-hopeful-sign-2024-06-11/"
  }
]