[
  {
    "text": "Supreme Court Justice Alito's Beach House Displayed ‘Appeal to Heaven’ Flag … The “Appeal to Heaven” flag flew outside the Alitos' New Jersey vacation home last summer, along with a “2022” Phillies flag and a Long Beach Island flag.  —  Last summer, two years after an upside-down American flag … ",
    "url": "https://www.nytimes.com/2024/05/22/us/justice-alito-flag-appeal-to-heaven.html"
  },
  {
    "text": "Second flag carried by Jan. 6 rioters displayed outside house owned by Justice Alito, report says  —  A second flag of a type carried by rioters during the attack on the U.S. Capitol on Jan. 6, 2021, was displayed outside a house owned by Supreme Court Justice Samuel Alito, The New York Times reported Wednesday.",
    "url": "https://apnews.com/article/supreme-court-flag-stop-steal-alito-trump-1842c40b833637c981c59c3f39bc4669"
  },
  {
    "text": "Florida hearing in Trump classified documents case devolves into shouting match  —  A hearing in the Mar-a-Lago classified documents case devolved into shouting Wednesday as attorneys battled over an alleged threat made last year to a defense attorney.  —  The morning proceeding in Fort Pierce … ",
    "url": "https://www.cnn.com/2024/05/22/politics/trump-documents-case-judge-cannon-hearing/"
  },
  {
    "text": "Judge Outlines ‘Shell Game’ Played with Classified Docs at Mar-a-Lago  —  THIS WEEK'S MOST IMPORTANT NEWS is barely making headlines: On Tuesday, it was revealed that a federal judge found over a year ago that there is sufficient evidence, if believed by a jury, to find that Donald J. Trump … ",
    "url": "https://www.thebulwark.com/p/judge-outlines-mar-a-lago-shell-game-classified"
  },
  {
    "text": "Two hundred judges, more nominees moving, and a shadow docket bill  —  A little past noon Wednesday, the U.S. Senate confirmed Angela Martinez to be a judge on the U.S. District Court for the District of Arizona on a 66-28 vote.  —  Martinez is the 200th of President Biden's judicial nominees … ",
    "url": "https://www.lawdork.com/p/two-hundred-judges-shadow-docket-bill"
  },
  {
    "text": "Sickening new video shows Hamas line up female Israeli soldiers on Oct. 7: ‘Here are the girls who can get pregnant’  —  Harrowing video released Wednesday shows the moment five female Israeli soldiers — covered in blood and surrounded by the bodies of their massacred comrades … ",
    "url": "https://nypost.com/2024/05/22/world-news/sickening-new-video-shows-hamas-line-up-female-israeli-soldiers-on-oct-7-here-are-the-girls-who-can-get-pregnant/"
  },
  {
    "text": "Nikki Haley says she's voting for Trump in November  —  Former South Carolina Gov. Nikki Haley is supporting former President Donald Trump's 2024 White House bid, she said Wednesday in her first public remarks since exiting the Republican presidential primary more than two months ago.",
    "url": "https://www.cnn.com/2024/05/22/politics/nikki-haley-donald-trump"
  },
  {
    "text": "Netanyahu speech plans spark internal furor for Democrats … - House Intelligence Committee Ranking Member Jim Himes (D-Conn.) said Netanyahu “should be focused on freeing hostages, not on charming legislators.”  — Rep. Dan Kildee (D-Mich.), a member of Democratic leadership, told Axios … ",
    "url": "https://www.axios.com/2024/05/23/netanyahu-johnson-schumer-address-congress-israel"
  },
  {
    "text": "Another Conspiracy Theory Win; It's Getting Depressing  —  OK, it's time to put on your tin foil hats because every damn conspiracy theory is proving to be true.  —  Sure, I still believe men landed on the moon and that the Earth is round, but I am beginning to doubt almost everything else.",
    "url": "https://hotair.com/david-strom/2024/05/22/another-conspiracy-theory-win-its-getting-depressing-n3788799"
  },
  {
    "text": "Democrat Punished On House Floor For Accurately Saying Trump Is On Trial  —  “What they're trying to do now is cancel people,” said Rep. Jim McGovern (Mass.), the congressman who started the contretemps.  —  LOADING  —  House Republicans invoked Wednesday a rule meant … ",
    "url": "https://www.huffpost.com/entry/house-democrat-punished-for-speaking-about-trump-trials_n_664e4b2ce4b0347b28fbf9a4"
  },
  {
    "text": "Republican National Committee's headquarters evacuated after vials of blood are addressed to Trump  —  The Republican National Committee's Washington headquarters was briefly evacuated on Wednesday as police investigated two vials of blood that had been addressed to former President Donald Trump following … ",
    "url": "https://apnews.com/article/rnc-evacuated-trump-blood-7ce48904814c9adfaf8b01d682b5d858"
  },
  {
    "text": "Inside the White House, a Debate Over Letting Ukraine Shoot U.S. Weapons Into Russia  —  After a sobering trip to Kyiv, Secretary of State Antony J. Blinken is urging the president to lift restrictions on how Ukraine can use American arms.  —  Since the first American shipments … ",
    "url": "https://www.nytimes.com/2024/05/22/us/politics/white-house-ukraine-weapons-russia.html"
  },
  {
    "text": "Trump gears up for unique South Bronx rally … - It will be his first large-scale campaign rally in New York since 2016. … - It has been working with the predominantly Hispanic members of the Bodega Association and the National Supermarket Association, made up of independent supermarket owners.",
    "url": "https://www.axios.com/2024/05/23/trump-south-bronx-rally-new-york"
  },
  {
    "text": "Millionaires tax revenue reaches $1.8 billion, on pace to double estimates  —  Beacon Hill spent most of the past year in hand-wringing mode over the state's finances as tax revenues sagged month after month and new costs exploded, but lawmakers might soon have hundreds of millions of dollars … ",
    "url": "https://www.wgbh.org/news/politics/2024-05-21/millionaires-tax-revenue-reaches-1-8-billion-on-pace-to-double-estimates"
  },
  {
    "text": "“Everyone is absolutely terrified”: Inside a US ally's secret war on its American critics  —  I met Raqib Naik, a journalist who had fled his native India, at a coffee shop in suburban Maryland.  We sat at the same metal table where he once discussed the prospect of his assassination with FBI agents.",
    "url": "https://www.vox.com/world-politics/24160779/inside-indias-secret-campaign-to-threaten-and-harass-americans"
  },
  {
    "text": "Centrist challenger ousts progressive DA in Oregon  —  Nathan Vasquez, a career prosecutor, vowed to be tough on crime in Portland.  —  Centrist district attorney candidate Nathan Vasquez has ousted the incumbent progressive prosecutor in Oregon's Multnomah County, home to Portland … ",
    "url": "https://www.politico.com/news/2024/05/22/centrist-challenger-ousts-progressive-da-in-oregon-00159589"
  },
  {
    "text": "Keir Starmer seems set to become UK prime minister on July 5.  Will that affect US relations?  —  .  —  British Prime Minister Rishi Sunak has called a snap general election to be held on July 4.  In the United Kingdom, the governing political party is able to call an election at any point … ",
    "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/3013254/keir-starmer-seems-set-to-become-uk-prime-minister-on-july-5-will-that-affect-us-relations/"
  },
  {
    "text": "What's breaking up the Texas Republican party?  School vouchers  —  Out-of-state donors are funneling millions of dollars into state legislative races to defeat Republicans who opposed the governor's top education priority.  —  When nearly two dozen Republican state lawmakers defied Texas … ",
    "url": "https://www.politico.com/news/2024/05/22/texas-republican-primary-school-vouchers-choice-00159219"
  },
  {
    "text": "Hunter Biden trial on tax charges delayed until September  —  Hunter Biden's trial on tax charges has been moved to September 5, after the judge presiding over the case made Biden's attorney promise he would not seek further delays.  —  In asking for a delay in the case, Abbe Lowell … ",
    "url": "https://www.cnn.com/2024/05/22/politics/hunter-biden-trial-on-tax-charges-delayed-until-september/"
  },
  {
    "text": "EXCLUSIVE: Paul Manafort has been back channeling campaign tips through top Trump aides since last year, Republicans tell 24sight News  —  Paul Manafort, the former campaign manager for Donald Trump, has been secretly advising the 2024 re-election effort through his top campaign aides since last summer … ",
    "url": "https://www.24sight.news/p/24sight-exclusive-manafort-trump-back-channel"
  },
  {
    "text": "2024 Race: Biden-Trump Matchup Margin Razor Thin With Nearly 1 In 5 Voters Likely To Change Their Minds, Quinnipiac University National Poll Finds; More Than 7 In 10 Voters Plan To Watch June Debate  —  mail_outline  —  As the presidential candidates prepare to debate next month … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3898"
  },
  {
    "text": "‘Silicon Valley Princess’: Inside the Life of Nicole Shanahan, R.F.K. Jr.'s Running Mate  —  Ms. Shanahan, a lawyer who was married to Sergey Brin, a Google founder, led a rarefied and sometimes turbulent life in Silicon Valley, according to a Times examination.",
    "url": "https://www.nytimes.com/2024/05/22/technology/nicole-shanahan-rfk-jr-vp.html"
  },
  {
    "text": "The Algebra Problem: How Middle School Math Became a National Flashpoint  —  Top students can benefit greatly by being offered the subject early.  But many districts offer few Black and Latino eighth graders a chance to study it.  —  From suburbs in the Northeast to major cities on the West Coast … ",
    "url": "https://www.nytimes.com/2024/05/22/nyregion/middle-school-math-algebra.html"
  }
]