[
  {
    "text": "‘Justice Will Prevail,’ Mahmoud Khalil Says as He Goes Free on Bail  —  Mr. Khalil, a Columbia graduate, had been held in Louisiana for over three months as the Trump administration sought to deport him.  A judge found reason to believe it was retaliation for his pro-Palestinian speech.",
    "url": "https://www.nytimes.com/2025/06/20/nyregion/mahmoud-khalil-release-order.html?unlocked_article_code=1.QU8.jeEe._uZk1wmi4w62&smid=url-share"
  },
  {
    "text": "Judge says he will order Columbia University protester Mahmoud Khalil freed from detention  —  A federal judge says he'll order Palestinian activist Mahmoud Khalil released from immigration detention.  Judge Michael Farbiarz made the ruling from the bench in federal court in New Jersey on Friday.",
    "url": "https://apnews.com/article/mahmoud-khalil-release-columbia-protest-trump-immigration-69162d21ab22377b1c1c08cf2c83d6cd"
  },
  {
    "text": "Kari Lake follows through on Trump order, axes most of Voice of America's staff  —  After three months of legal battles and lobbying, the Voice of America network is officially being reduced to a fraction of its pre-Trump form.  —  Widespread layoffs took place Friday at VOA and its parent agency … ",
    "url": "https://cnn.com/2025/06/20/media/kari-lake-voa-trump-voice-of-america-staff"
  },
  {
    "text": "Trump throws Gabbard under the bus — again  —  For the second time this week, the president dismissed his intelligence director's view on Iran's nuclear program.  —  For the second time this week, President Donald Trump publicly undermined Director of National Intelligence Tulsi Gabbard … ",
    "url": "https://www.politico.com/news/2025/06/20/trump-gabbard-dismiss-iran-assessment-00415805"
  },
  {
    "text": "A judge sided with Trump.  Behind the scenes, he was lobbying for a nomination.  —  Ed Artau was already meeting with Senate staff about securing a nomination to the federal bench when he sided with Trump in a case, according to a new Senate disclosure obtained by POLITICO.",
    "url": "https://www.politico.com/news/2025/06/20/ed-artau-trump-judge-nomination-florida-00415408"
  },
  {
    "text": "‘A good day’: Detained U.S. citizen said agents bragged after arresting dozens at Home Depot  —  A 37-year-old U.S. citizen who was tackled to the ground and arrested after filming federal agents at Home Depot on Thursday said he was held for more than an hour at Dodger Stadium … ",
    "url": "https://www.latimes.com/california/story/2025-06-20/border-patrol-agents-brag-in-front-of-detained"
  },
  {
    "text": "Top Pentagon spy pick rejected by White House  —  Army Lt. Gen. Richard Angle's name was put forward to lead the National Security Agency and U.S. Cyber Command.  —  The White House recently nixed the Pentagon's pick to head the country's top spy agency and command its elite hacking force … ",
    "url": "https://www.politico.com/news/2025/06/20/richard-angle-nsa-cyber-command-00415619"
  },
  {
    "text": "ICE agents scatter as SD Bishop Pham, other clergy visit immigration court  —  Eight immigration courts line the fourth-floor hallway of the downtown Edward J. Schwartz Federal Building.  On the walls: boot prints of ICE agents.  —  But on World Refugee Day, masked immigration agents … ",
    "url": "https://timesofsandiego.com/life/2025/06/20/ice-agents-scatter-as-sd-bishop-pham-other-clergy-visit-immigration-court/"
  },
  {
    "text": "Louisiana's Ten Commandments law in public schools blocked by federal appeals court  —  The law went into effect this year, but it's unclear how many, if any, school districts have begun to comply as litigation could ultimately land before the U.S. Supreme Court.",
    "url": "https://www.nbcnews.com/news/us-news/louisianas-ten-commandments-law-public-schools-blocked-federal-appeals-rcna189408"
  },
  {
    "text": "EXCLUSIVE: Vance Boelter blamed Gov. Walz for shooting rampage in confession letter, sources say  —  Multiple sources with direct knowledge of the investigation confirmed to Alpha News that Boelter's so-called confession letter was intended for Kash Patel, the director of the FBI.",
    "url": "https://alphanews.org/exclusive-vance-boelter-blamed-gov-walz-for-shooting-rampage-in-confession-letter-sources-say/"
  },
  {
    "text": "Stephen Miller's Fingerprints Are on Everything in Trump's Second Term  —  The deputy chief of staff has played an outsize role in immigration—and amassed more power than almost anyone else at the White House  —  Stephen Miller wanted to keep the planes in the air—and that is where they stayed.",
    "url": "https://www.wsj.com/politics/policy/stephen-miller-trump-immigration-c1e0e924"
  },
  {
    "text": "Social Security stops reporting call wait times and other metrics  —  The changes are the latest sign of the agency's struggle with website crashes, overloaded servers and long lines at field offices amid Trump cutbacks.  —  Social Security has stopped publicly reporting its processing times for benefits … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/20/social-security-wait-times-cuts/"
  },
  {
    "text": "Ireland shuts last coal plant, becomes 15th coal-free country in Europe  —  Moneypoint in County Clare, Ireland, joins the ranks of other European nations exiting coal by shutting off power generation at its sole remaining coal plant.  Industry observers say Ireland's increased renewable energy generation … ",
    "url": "https://www.pv-magazine.com/2025/06/20/ireland-coal-free-ends-coal-power-generation-moneypoint/"
  },
  {
    "text": "Japan scraps US meeting after Washington demands more defence spending  —  Allies' top defence and foreign policy officials were due to hold talks on July 1  —  Japan has cancelled a top-level meeting with the US after the Trump administration abruptly told Tokyo to spend more on defence … ",
    "url": "https://www.ft.com/content/53f646e7-b4e7-4bf4-8d5d-7142b4460080"
  },
  {
    "text": "‘All of Ukraine is ours’ — Putin on Russia's territorial ambitions in Ukraine  —  Editor's Note: This story was updated with comments from Foreign Minister Andrii Sybiha.  —  Russian President Vladimir Putin said “all of Ukraine” belonged to Russia in a speech on June 20 … ",
    "url": "https://kyivindependent.com/all-of-ukraine-is-ours/"
  },
  {
    "text": "Rich People, Pundits Really Do Not Want Zohran Mamdani to Be Mayor  —  Allies of former NY Governor Andrew Cuomo are breaking New York City spending limits trying to make him mayor.  Mamdani is still closing the gap  —  The Democratic primary to unseat disgraced New York City Mayor Eric Adams is in full swing.",
    "url": "https://www.rollingstone.com/politics/politics-news/zohran-mamdani-andrew-cuomo-new-york-mayor-spending-1235369220/"
  },
  {
    "text": "Treasured Public Lands on the Auction Block in Trump's ‘Big Beautiful Bill’  —  250 million acres of federal land are at risk for sale to the highest bidder under Senate provision  —  Every Summer, my wife and I pack up our three kids and the family dog and drive an hour-and-a-half from our home … ",
    "url": "https://www.rollingstone.com/politics/politics-features/public-land-highest-bidder-trump-big-beautiful-bill-1235369151/"
  },
  {
    "text": "Trump ‘looking at’ immigration relief for farm workers after resuming ICE raids on them  —  “We can't put the farms out of business,” Trump said June 20 in discussing his immigration enforcement efforts.  —  President Donald Trump again is saying he wants to shield farmers from the effects … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/06/20/trump-farmers-migrant-labor/84291870007/"
  },
  {
    "text": "The many ugly polls on Trump's ‘One Big Beautiful Bill’  —  President Donald Trump isn't asking Congress to do much these days.  In fact, it often seems like he'd rather he didn't have to bother with the legislative branch at all.  —  But despite all of his power grabs … ",
    "url": "https://cnn.com/2025/06/20/politics/big-beautiful-bill-polling-analysis"
  },
  {
    "text": "ICE believes it will never face accountability again  —  The Trump administration is letting an unaccountable secret police form at the heart of our democracy. … Day by passing day, we are watching what amounts to a national police riot by ICE. … In recent days, ICE … ",
    "url": "https://www.doomsdayscenario.co/p/ice-believes-it-will-never-face-accountability-again"
  },
  {
    "text": "‘RFK Jr is a disaster’: Staff describe chaos in ‘anti-science’ regime  —  Officials in US health agencies fear ‘people will get sick’ as programmes are slashed and scientists are fired under the constant surveillance of Doge  —  For the workers of Building 21, keeping a low profile is considered the best way to survive.",
    "url": "https://www.thetimes.com/us/american-politics/article/cdc-rfk-robert-f-kennedy-q5tv0300z"
  },
  {
    "text": "Judge Blocks Trump's Tying of Transportation Funds to Immigration Enforcement  —  Attorneys general in 20 states, most led by Democrats, had sued the administration.  Similar suits have been filed over funding for other programs.  —  A federal judge has temporarily blocked the U.S. Department … ",
    "url": "https://www.nytimes.com/2025/06/20/us/politics/trump-transportation-funds-immigration-states.html"
  },
  {
    "text": "Community And Choice Are Not Bubbles  —  from the communities-aren't-bubbles dept  —  Disclosure: I am on the board of Bluesky and am inherently biased.  Adjust your skepticism of what I write on this topic accordingly.  —  It seems a bit odd: when something is supposedly dying or irrelevant … ",
    "url": "https://www.techdirt.com/2025/06/20/community-and-choice-are-not-bubbles/"
  }
]