[
  {
    "text": "Ex-officer Derek Chauvin, convicted in George Floyd's killing, stabbed in prison, AP source says  —  Derek Chauvin, the former Minneapolis police officer convicted of murdering George Floyd, was stabbed by another inmate and seriously injured Friday at a federal prison in Arizona … ",
    "url": "https://apnews.com/article/derek-chauvin-george-floyd-prison-stabbing-f24cde6aa28877d034530c2dc40ef7ea"
  },
  {
    "text": "Derek Chauvin stabbed, seriously injured in prison  —  The former Minneapolis police officer has been serving time in a medium-security prison in Arizona.  —  Former Minneapolis police officer Derek Chauvin was stabbed and seriously injured Friday by a fellow inmate at an Arizona federal prison … ",
    "url": "https://www.startribune.com/report-derek-chauvin-stabbed-seriously-injured-in-prison/600322234/"
  },
  {
    "text": "Pro-Israel teacher hides in Queens high school as ‘radicalized’ students riot: ‘They want her fired’  —  Hundreds of “radicalized” kids rampaged through the halls of a Queens high school this week for nearly two hours after they discovered a teacher had attended a pro-Israel rally … ",
    "url": "https://nypost.com/2023/11/25/metro/jewish-teacher-hides-in-queens-high-school-as-students-riot/"
  },
  {
    "text": "Santos lashes out at colleagues as he stares down expulsion  —  Rep. George Santos (R-N.Y.) said Friday he won't resign from Congress but acknowledged he will likely be expelled as he lobbed salacious accusations at colleagues and called the chair of the Ethics Committee a “p***y”.",
    "url": "https://www.axios.com/2023/11/25/santos-lashes-out-expulsion-vote"
  },
  {
    "text": "Gaza Civilians, Under Israeli Barrage, Are Being Killed at Historic Pace  —  In less than two months, more than twice as many women and children have been reported killed in Gaza than in Ukraine after two years of war.  —  Israel has cast the deaths of civilians in the Gaza Strip as a regrettable … ",
    "url": "https://www.nytimes.com/2023/11/25/world/middleeast/israel-gaza-death-toll.html"
  },
  {
    "text": "The polls keep getting worse for Biden  —  Trump's vote share in national polls is higher than at any time in the past year.  —  President Joe Biden's poll numbers keep getting worse.  —  November started with New York Times/Siena College polls showing Trump ahead in four of the six swing states … ",
    "url": "https://www.politico.com/news/2023/11/25/biden-polls-worse-trump-00128536"
  },
  {
    "text": "Who Would Donald Trump  —  CHOOSE AS HIS RUNNING MATE?  —  Donald J. Trump hasn't won a single primary or caucus vote yet, let alone the Republican nomination, but his lead in the polls has left much of the political world viewing his nomination as all but inevitable.",
    "url": "https://www.nytimes.com/interactive/2023/us/politics/donald-trump-vp.html"
  },
  {
    "text": "X May Lose Up to $75 Million in Revenue as More Advertisers Pull Out  —  Internal documents show companies like Airbnb, Coca-Cola and Microsoft have halted ads, or are at risk of doing so, after Elon Musk's endorsement of an antisemitic conspiracy theory.  —  X, the social media company formerly known … ",
    "url": "https://www.nytimes.com/2023/11/24/business/x-elon-musk-advertisers.html"
  },
  {
    "text": "Ted Cruz Skewers Kamala Harris Gas Stove That He Claims ‘Dems Want to Ban’  —  Never mind the White House has said President Biden would not support such a ban  —  Sen. Ted Cruz (R-Texas) was tilting at windmills — or, rather tilting at gas stoves — on Friday when he slammed Vice President Kamala Harris … ",
    "url": "https://themessenger.com/news/ted-cruz-skewers-kamala-harris-gas-stove-that-he-claims-dems-want-to-ban"
  },
  {
    "text": "House Speaker Mike Johnson Spent Years Defending Christian Speech In Public Schools  —  “The ultimate goal of the enemy is silencing the Gospel,” the Republican said in 2004 after Jewish parents sued a school for pushing Christianity on their kids.  —  LOADING",
    "url": "https://www.huffpost.com/entry/mike-johnson-christianity-public-schools_n_65565dfce4b0998d699f5f0d"
  },
  {
    "text": "Anonymous businessman donates $800,000 to struggling Auburn Food Bank  —  The food bank's director said they can now afford to move into a bigger space just blocks down the road.  —  AUBURN, Wash. — The population in the city of Auburn has grown by more than 30,000 people since the millennium … ",
    "url": "https://www.king5.com/article/news/local/anonymous-businessman-donates-to-struggling-auburn-food-bank/281-27a4b58a-0716-42ee-bf2c-fe05f83c8ae1"
  },
  {
    "text": "Heroic Immigrant Actually Stopped the Dublin Stabbing That Led to Far-Right Riot  —  Far right ‘hooligans’ whipped up outrage after reports the attacker in the shocking Dublin school stabbing was an immigrant.  It turns out, the man who stopped him was Brazilian.",
    "url": "https://www.thedailybeast.com/caio-benicio-heroic-brazilian-stopped-the-dublin-stabbing-that-led-to-far-right-riot"
  },
  {
    "text": "Andrew Cuomo accused of sexual harassment in new lawsuit filed by former executive assistant Brittany Commisso  —  A former executive assistant to former New York Gov. Andrew Cuomo who had accused him of groping her has filed a lawsuit alleging sexual harassment.",
    "url": "https://www.cbsnews.com/news/andrew-cuomo-sued-sexual-assault-brittany-commisso-former-executive-assistant/"
  },
  {
    "text": "Trump Lawyers Say New York Filing Is ‘Irrelevant’ to DC Gag Order Hearing  —  The back-and-forth concerns a filing submitted by prosecutors on Thanksgiving  —  JWPlayer  —  Donald Trump's lawyers on Friday filed a response to prosecutors' Thursday filing, arguing that any threats … ",
    "url": "https://themessenger.com/politics/trump-lawyers-say-new-york-filing-is-irrelevant-to-d-c-gag-order-hearing"
  }
]