[
  {
    "text": "Key Bridge collapses into Patapsco River in Baltimore after vessel hits support column; state of emergency declared  —  Baltimore's Francis Scott Key Bridge collapsed early Tuesday after a container ship struck a support column, sending at least seven cars into the Patapsco River … ",
    "url": "https://www.baltimoresun.com/2024/03/26/key-bridge-collapses-into-patapsco/"
  },
  {
    "text": "Cargo ship hits Baltimore's Key Bridge, bringing it down.  Rescuers are looking for people in water  —  Watch live views from Baltimore where a major bridge snapped and collapsed after a container ship rammed into it early Tuesday, and several vehicles fell into the river below.",
    "url": "https://apnews.com/article/baltimore-bridge-collapse-53169b379820032f832de4016c655d1b"
  },
  {
    "text": "Alina Habba mocks New York AG after appeals court reduces Trump bond  —  Alina Habba, attorney to former President Donald Trump, mocked New York Attorney General Letitia James, after an appeals court significantly reduced the cost of a bond he must pay while he appeals his multimillion-dollar civil fraud penalty.",
    "url": "https://thehill.com/regulation/court-battles/4556222-habba-mocks-new-york-ag-appeals-court-reduces-trump-bond/"
  },
  {
    "text": "No One Is Above the Law, Except, Apparently, Donald Trump  —  As the week began, it looked as though Donald Trump would finally face consequences — or at least, a consequence — for his actions.  —  Last month, a New York state trial court found the former president liable for inflating … ",
    "url": "https://www.nytimes.com/2024/03/26/opinion/trump-trials-bond-invincibility.html"
  },
  {
    "text": "Mick Mulvaney defends Ronna McDaniel amid NBC turmoil  —  Former White House chief of staff Mick Mulvaney is dismissing criticism NBC News is facing from some of the network's biggest stars over its decision to hire former Republican National Committee Chair Ronna McDaniel as a paid contributor.",
    "url": "https://thehill.com/homenews/media/4556337-mick-mulvaney-ronna-mcdaniel-nbc-news-msnbc/"
  },
  {
    "text": "Lawrence O'Donnell Invites Ronna McDaniel On His Show To Answer A Few Blunt Questions  —  The MSNBC host said his network will not use the former RNC chief as a political analyst, “but I do have a few questions for her.”  —  LOADING  —  MSNBC's Lawrence O'Donnell said he gave up on interviewing … ",
    "url": "https://www.huffpost.com/entry/lawrence-odonnell-ronna-mcdaniel_n_6602b365e4b07e1285780691"
  },
  {
    "text": "‘Feeble, Confused And Tired’: Donald Trump Torched After Bizarre Gaffe-Filled Appearance  —  The former president delivered a rambling performance as his legal battles heat up.  —  LOADING  —  President Joe Biden's campaign on Monday released an unusually blunt statement tearing into Donald Trump as … ",
    "url": "https://www.huffpost.com/entry/trump-feeble-gaffes_n_660263bde4b0269c5d2d12ac"
  },
  {
    "text": "Biden Gains Ground Against Trump in Six Key States, Poll Shows  —  The move in the president's direction comes after five months of mostly consistent Trump leads.  —  President Joe Biden has gained ground against Republican Donald Trump in six of seven key swing states, and significantly so in at least two of them.",
    "url": "https://www.bloomberg.com/news/articles/2024-03-26/election-2024-poll-biden-gains-on-trump-in-six-swing-states"
  },
  {
    "text": "Ohio man gets 2.5 years in prison for death threats made in 2022 to Arizona's top election official  —  An Ohio man who acknowledged making death threats in voicemails left for then-Arizona Secretary of State Katie Hobbs during the 2022 election season was sentenced Monday to 2 1/2 years in prison.",
    "url": "https://apnews.com/article/arizona-election-threats-voicemails-hobbs-sentence-87e7b8e99cb5961ff2ed38eab550a44b"
  },
  {
    "text": "RFK Jr. intends to name attorney Nicole Shanahan as his VP pick  —  The attorney and entrepreneur, like Kennedy himself, has never run for elected office, but she has contributed to his campaign and allied super PAC.  —  Independent presidential candidate Robert F. Kennedy Jr. intends … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-intends-name-attorney-nicole-shanahan-vp-pick-rcna144983"
  },
  {
    "text": "Texas AG Ken Paxton reaches deal to end securities fraud charges after 9 years  —  Prosecutors on Tuesday announced an agreement with Texas Attorney General Ken Paxton that would ultimately dismiss securities fraud charges he has been facing for nearly a decade.",
    "url": "https://apnews.com/article/ken-paxton-texas-securities-fraud-9ed5eecc30c1f967ec51f7e58ad9d0af"
  },
  {
    "text": "What we know about Arizona's 2020 fake elector investigation … The big picture: Indictments could send shockwaves through the state as the false elector slate includes elected officials and other high-profile Republicans.  They would also reverberate nationally.",
    "url": "https://www.axios.com/2024/03/26/arizona-fake-elector-investigation"
  },
  {
    "text": "Trump's Net Worth Hits $6.5 Billion, Making Him One of World's 500 Richest People  — Former president joins Bloomberg's list of 500 richest people  — Trump Media merger adds billions of dollars to paper fortune  —  Trump Bond Cut to $175 Million Amid Appeal of NY Fine",
    "url": "https://www.bloomberg.com/news/articles/2024-03-25/donald-trump-6-4-billion-net-worth-makes-him-one-of-world-s-richest-people"
  },
  {
    "text": "Inside the squatting hysteria  —  On March 17, a provocateur named Leonel Moreno posted a video on TikTok where he purports to give instructions on how people can successfully “squat” in other people's houses.  It was one of many videos he made about how to exploit American law.",
    "url": "https://popular.info/p/inside-the-squatting-hysteria"
  },
  {
    "text": "Exclusive: US lawmaker seeks answers on FDA inspection of Musk's Neuralink  —  A U.S. lawmaker involved in health policy has asked the Food and Drug Administration why it did not inspect Elon Musk's Neuralink before allowing the brain implant company to test its device in humans.",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-lawmaker-seeks-answers-fda-inspection-musks-neuralink-2024-03-26/"
  },
  {
    "text": "Miriam Adelson recently met with Trump.  Her company is also wooing New York Democrats for a casino.  —  The Republican megadonor's contributions could be used against her in New York's fierce competition for casino licenses.  —  NEW YORK — GOP megadonor Miriam Adelson recently dined … ",
    "url": "https://www.politico.com/news/2024/03/26/miriam-adelson-met-with-trump-her-company-is-also-wooing-ny-dems-00149002"
  },
  {
    "text": "Senate GOP cautions Trump on 15-week national abortion ban  —  Senate Republicans are warning former President Trump that restrictions on abortion should be left to the states and that proposing a 15-week national abortion ban ahead of this year's election would be a major political blunder.",
    "url": "https://thehill.com/homenews/senate/4555080-senate-gop-trump-abortion/"
  },
  {
    "text": "Jeff Yass just bought Trump.  Here's what he stands to gain.  —  The right-wing billionaire and TikTok investor is about to help the former president add billions of dollars to his net worth.  This is what oligarchy looks like.  —  Billionaire investor Jeff Yass is playing his Trump card.",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/trump-truth-social-tik-tok-jeff-yass-rcna144951"
  },
  {
    "text": "Trump loves to play the victim — NY appeals court bailout shows he's the most coddled person alive  —  There appears to be no end of breaks for a spoiled rich boy who has never done a decent thing in his 77 years  —  As anyone who listens to him can attest, Donald Trump may be the most self-pitying person on planet Earth.",
    "url": "https://www.salon.com/2024/03/26/loves-to-play-the-victim--ny-appeals-bailout-shows-hes-the-most-coddled-person-alive/"
  },
  {
    "text": "Erin Hawley: The Woman Arguing Against the Abortion Pill  —  Erin Hawley is best known as the wife of Senator Josh Hawley, but now the spotlight is on her in a Supreme Court case.  —  It was 2014, and Erin Morrow Hawley was fighting against the egg-laying hens of Missouri.",
    "url": "https://www.nytimes.com/2024/03/26/us/erin-hawley-abortion-pill-supreme-court.html"
  },
  {
    "text": "Alabama special election to test political potency of abortion, IVF  —  A special election in an unusual purple Alabama state House district is testing the political potency of reproductive rights in a red state after a major ruling there last month led to a temporary pause on in vitro fertilization (IVF) treatment.",
    "url": "https://thehill.com/homenews/state-watch/4554570-alabama-special-election-ivf-abortion-teddy-powell-marilyn-lands/"
  },
  {
    "text": "Protesters arrested outside Supreme Court as justices weigh future of abortion pill  —  Several protesters have been arrested outside the Supreme Court, as justices are scheduled to hear arguments in a case over the Food and Drug Administration's approval of the abortion pill mifepristone.",
    "url": "https://www.washingtonexaminer.com/news/justice/2938582/protesters-arrested-outside-supreme-court-justices-weigh-future-of-abortion-pill/"
  }
]