[
  {
    "text": "Senate GOP eyes recess appointments as stalemate drags on  —  Fed-up Senate Republicans are starting to whisper about recess appointments again as Democrats stonewall them on nominees, cutting into the start of August recess. … But skipping town and letting President Trump speed-run … ",
    "url": "https://www.axios.com/2025/08/02/senate-republicans-recess-appointments-trump"
  },
  {
    "text": "Trump tells Schumer to ‘GO TO HELL’ over Senate nominee deal funding demands after negotiations collapse  —  Senate Democrats wanted White House to unfreeze billions in NIH and foreign aid funding in exchange for confirmations  —  Hours of tense negotiations to strike a deal … ",
    "url": "https://www.foxnews.com/politics/trump-tells-schumer-go-hell-over-senate-nominee-deal-funding-demands-after-negotiations-collapse"
  },
  {
    "text": "Senators leave Washington without Trump nominees deal … Thune and Minority Leader Chuck Schumer discussed the path forward on the floor before it was formalized, a person granted anonymity to disclose the private conversation said.  —  In a Truth Social message Saturday evening … ",
    "url": "https://www.politico.com/news/2025/08/02/senate-trump-deal-00490401"
  },
  {
    "text": "Senate confirms Jeanine Pirro as U.S. Attorney for the District of Columbia  —  Washington - The Senate on Saturday approved the nomination of Jeanine Pirro, an ardent loyalist of President Trump and a FOX News fixture, confirming the cable news personality to a top prosecutor post in Washington, D.C.",
    "url": "https://www.cbsnews.com/news/senate-confirms-jeanine-pirro-dc-us-attorney/"
  },
  {
    "text": "Senate confirms former Fox News host Pirro as top federal prosecutor for the nation's capital  —  The Senate has confirmed former Fox News host Jeanine Pirro as the top federal prosecutor for the nation's capital, filling the post after President Donald Trump withdrew his controversial first pick, conservative activist Ed Martin Jr.",
    "url": "https://apnews.com/article/jeanine-pirro-attorney-trump-senate-confirmation-5a2c7c087e67fde1f8ac8ae4aa25d4e1"
  },
  {
    "text": "Senate Confirms Election Denying Fox Host as DC US Attorney  —  Senate Republicans were undeterred by former Fox News host Jeanine Pirro's election denialism.  They confirmed her nomination to be U.S. Attorney for the District of Columbia on Saturday night by a 50-45 vote.",
    "url": "https://www.democracydocket.com/news-alerts/senate-confirms-election-denying-fox-host-as-dc-us-attorney/"
  },
  {
    "text": "Pirro confirmed as D.C. U.S. Attorney amid partisan clash as Dem nominee blockade continues  —  Former Fox News Jeanine Pirro host has served in the role on interim basis since May  —  The Senate on Saturday confirmed Jeanine Pirro, President Donald Trump's pick to serve as Washington D.C.'s top prosecutor … ",
    "url": "https://www.foxnews.com/politics/pirro-confirmed-d-c-u-s-attorney-amid-partisan-clash-dem-nominee-blockade-continues"
  },
  {
    "text": "Until Trump Fired Her, She Was an Economist With Bipartisan Support  —  Erika McEntarfer led the agency that produced key data on jobs and inflation.  Then July's report showed a weakening economy, and President Trump accused her of “rigging” the numbers.  —  Nearly the entire Senate … ",
    "url": "https://www.nytimes.com/2025/08/02/us/politics/until-trump-fired-her-she-was-an-economist-with-bipartisan-support.html"
  },
  {
    "text": "Economic fears of investors are here — and fed by Trump's reaction  —  Ambitious policies, erratic approach dominate outlook.  —  For months, the U.S. economy appeared to be weathering the disruptive effects of President Donald Trump's trade and immigration policies.",
    "url": "https://www.washingtonpost.com/business/2025/08/02/trump-economic-uncertainty/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0MTA3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1NDg5NTk5LCJpYXQiOjE3NTQxMDcyMDAsImp0aSI6ImI4NDkyNDA3LTFjYTItNDM1NC05NGIyLTM5ZTAxMmRhNDdiNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA4LzAyL3RydW1wLWVjb25vbWljLXVuY2VydGFpbnR5LyJ9.LCrLmyztwnLwcwyWMf7cSoL6e4MxvWWBwbRY5KuIlfY"
  },
  {
    "text": "Republicans slam Trump's firing of Bureau of Labor Statistics chief  —  President claimed that recently released figures showing jobs slowdown were ‘rigged’ to make him look bad  —  Senior Republican lawmakers are condemning the decision of their party leader, Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2025/aug/02/republicans-trump-bureau-of-labor-statistics-commissioner"
  },
  {
    "text": "Smithsonian will again include Trump in impeachment exhibit in ‘coming weeks’  —  The museum's decision to remove a placard referencing President Donald Trump from an impeachments exhibit sparked concerns over Trump's influence on the cultural institution.  —  The Smithsonian's National Museum … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/smithsonian-will-include-trump-impeachment-exhibit-coming-weeks-rcna222690"
  },
  {
    "text": "Smithsonian to restore Trump to impeachment exhibit ‘in the coming weeks’  —  A placard referring to Trump's two impeachments was removed from the National Museum of American History in July, after the Smithsonian agreed to perform a “content review”  —  Just now",
    "url": "https://www.washingtonpost.com/entertainment/art/2025/08/02/trump-impeachment-smithsonian-restore/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0MTA3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1NDg5NTk5LCJpYXQiOjE3NTQxMDcyMDAsImp0aSI6ImFjYjhkZGMzLTI0N2EtNDRmZS05NmQzLTk0NDczMjkyNzQwMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbnRlcnRhaW5tZW50L2FydC8yMDI1LzA4LzAyL3RydW1wLWltcGVhY2htZW50LXNtaXRoc29uaWFuLXJlc3RvcmUvIn0.Bq-rJULAgAnGsbw8b5ItUMhCRLP4IBra0E4VxSbZr_4&itid=gfta"
  },
  {
    "text": "Ex-Trump prosecutor Jack Smith faces investigation by independent political watchdog  —  An independent watchdog agency responsible for enforcing a law against partisan political activity by federal employees has opened an investigation into Jack Smith, the Justice Department special counsel … ",
    "url": "https://apnews.com/article/trump-jack-smith-investigate-cotton-special-counsel-f32b39962d7aee1cb87f71ea9fde13f5"
  },
  {
    "text": "Supreme Court signals it may rule on law protecting power of minority voters  —  The justices asked opposing parties in a battle over a Louisiana voting map to submit briefs addressing the matter.  —  Just now  —  The Supreme Court has signaled that it may rule on the constitutionality … ",
    "url": "https://www.washingtonpost.com/politics/2025/08/02/supreme-court-louisiana-voting-rights-act/"
  },
  {
    "text": "India Will Buy Russian Oil Despite Trump's Threats, Officials Say  —  There is a growing sense in India that its leaders should not allow American policymaking to shape its choices on vital energy supplies.  —  Indian officials said on Saturday that they would keep purchasing cheap oil … ",
    "url": "https://www.nytimes.com/2025/08/02/world/asia/india-russia-oil-trump-threats.html?unlocked_article_code=1.bE8.ZW0z.r4HdNGIfryLm&smid=url-share"
  },
  {
    "text": "Trump Rages About Claim He Killed Epstein: Author  —  PRESSURE COOKER  —  The president has denied any involvement in the sex trafficker's death, biographer Michael Wolff says.  —  President Donald Trump was taken aback by speculation that he was personally involved in Jeffrey Epstein's … ",
    "url": "https://www.thedailybeast.com/donald-trump-rages-about-claim-he-killed-jeffrey-epstein-michael-wolff/"
  }
]