[
  {
    "text": "Henry Kissinger, who shaped world affairs under two presidents, dies at 100  —  The diplomat exercised an unparalleled control over U.S. international affairs and policymaking.  He was also the target of relentless critics, who deemed him unprincipled and amoral.",
    "url": "https://www.washingtonpost.com/obituaries/2023/11/29/henry-kissinger-dead-obituary/"
  },
  {
    "text": "Henry Kissinger Is Dead at 100; Shaped Nation's Cold War History  —  The most powerful secretary of state of the postwar era, he was both celebrated and reviled.  His complicated legacy still resonates in relations with China, Russia and the Middle East.  —  Henry A. Kissinger … ",
    "url": "https://www.nytimes.com/2023/11/29/us/henry-kissinger-dead.html"
  },
  {
    "text": "Henry Kissinger, America's Most Notorious War Criminal, Dies At 100  —  The titan of American foreign policy was complicit in millions of deaths — and never showed remorse for his decisions.  —  Henry Kissinger — who as a top American foreign policy official oversaw … ",
    "url": "https://www.huffpost.com/entry/henry-kissinger-dies_n_6376933ae4b0afce046cb44f"
  },
  {
    "text": "Henry Kissinger's bombing campaign likely killed hundreds of thousands of Cambodians − and set path for the ravages of the Khmer Rouge  —  Henry Kissinger, who died on Nov. 29, 2023 at the age of 100, stood as a colossus of U.S. foreign policy.  His influence on American politics lasted long beyond … ",
    "url": "https://theconversation.com/henry-kissingers-bombing-campaign-likely-killed-hundreds-of-thousands-of-cambodians-and-set-path-for-the-ravages-of-the-khmer-rouge-209353"
  },
  {
    "text": "'I Didn't Say He'd Be a Great President': McCarthy Jabs at Trump, Predicts He'll Lose 2024 If Campaign is About ‘Revenge’  —  Former House Speaker Kevin McCarthy (R-CA) jabbed former President Donald Trump while being interviewed at the New York Times's Dealbook Summit on Wednesday.",
    "url": "https://www.mediaite.com/politics/i-didnt-say-hed-be-a-great-president-mccarthy-jabs-at-trump-predicts-hell-lose-2024-if-campaign-is-about-revenge/"
  },
  {
    "text": "Speaker Johnson has ‘real reservations’ as House mulls George Santos expulsion  —  Johnson said he trusts people to decide on the expulsion “in good faith.”  —  Speaker of the House Mike Johnson meets with reporters to discuss GOP efforts to investigate President Joe Biden and his son Hunter Biden, at the Capitol, Nov. 29, 2023.",
    "url": "https://abcnews.go.com/Politics/speaker-johnson-real-reservations-house-mulls-george-santos/story?id=105241359"
  },
  {
    "text": "Attorney warned Trump 'it's going to be a crime' if he didn't comply with subpoena for classified docs: Sources  —  Trump attorney Jennifer Little spoke with federal investigators, sources said.  —  This image contained in a court filing by the Department of Justice on Aug. 30, 2022 … ",
    "url": "https://abcnews.go.com/US/attorney-warned-trump-crime-comply-subpoena-classified-docs/story?id=105228569"
  },
  {
    "text": "Ramaswamy Political Director Joining Trump Campaign (Exclusive)  —  The move marks a major blow to Ramaswamy, who soared to prominence over the summer but has struggled to maintain his momentum  —  A former top aide to GOP presidential candidate Vivek Ramaswamy is leaving his campaign … ",
    "url": "https://themessenger.com/politics/ramaswamy-political-director-joining-trump-campaign-exclusive"
  },
  {
    "text": "Trump Caught Moving Money Around to Pay Massive Tax Bill  —  Trump wasn't supposed to be moving significant amounts of money around without notifying a court-appointed auditor.  He just got caught paying himself so he could pay his taxes. … A court-ordered financial auditor … ",
    "url": "https://www.thedailybeast.com/trump-caught-moving-money-around-to-pay-massive-tax-bill"
  },
  {
    "text": "Here's how much more you need to spend to maintain your living standard  —  The typical American household must spend an additional $11,434 annually just to maintain the same standard of living they enjoyed in January of 2021, right before inflation soared to 40-year highs, according to a recent analysis of government data.",
    "url": "https://www.cbsnews.com/news/inflation-households-need-extra-11400-these-states-its-even-higher/"
  },
  {
    "text": "Scoop: Biden warned Bibi Israel can't operate in southern Gaza the way it did in north  —  President Biden told Israeli Prime Minister Benjamin Netanyahu last Sunday that he is concerned about a possible Israeli military operation in southern Gaza after the current pause in fighting ends, two U.S. officials told Axios.",
    "url": "https://www.axios.com/2023/11/29/biden-netanyahu-gaza-israel-military-palestinian-civilians"
  },
  {
    "text": "Court filing reveals Rep. Scott Perry's vast web of contacts in bid to reverse 2020 election  —  A federal appeals court on Wednesday released previously secret text messages from Perry — only to remove them from the public docket later in the day.  —  At 11:08 p.m. on Dec. 30, 2020 … ",
    "url": "https://www.politico.com/news/2023/11/29/scott-perry-texts-unsealed-00129195"
  },
  {
    "text": "Trump unleashes grievances, warnings in wild 24 hours on Truth Social  —  Former President Trump has spent the last 24 hours on Truth Social unleashing a torrent of grievances, vengeful promises and links to online conspiracy theories about his political rivals.",
    "url": "https://www.axios.com/2023/11/29/trump-truth-social-posts"
  },
  {
    "text": "Arizona officials charged with allegedly conspiring to delay midterm election outcome  —  PHOENIX — Two Republican members of a county election board in southern Arizona were indicted by a state grand jury this week for allegedly flouting last year's deadline to formally accept the results of the November 2022 midterm election.",
    "url": "https://www.washingtonpost.com/politics/2023/11/29/cochise-county-arizona-midterm-election-criminal-charges/"
  },
  {
    "text": "Mark Cuban says ‘no plans’ to run for president in 2024 on heels of Dallas Mavericks deal  — The billionaire Mark Cuban reiterated that he has no plans to run for president in 2024.  — Cuban plans to sell a majority stake in the NBA team Dallas Mavericks to Miriam Adelson and her family … ",
    "url": "https://www.cnbc.com/2023/11/29/mark-cuban-says-no-plans-to-run-for-president-after-mavericks-deal.html"
  },
  {
    "text": "Trump doubles down, saying ‘Obamacare Sucks’ and must be replaced  —  Despite the GOP 2024 frontrunner's call, congressional Republicans are divided on whether to pick that battle again after they tried and failed to eliminate the law in 2017.  —  WASHINGTON — Even as his party has backed away … ",
    "url": "https://www.nbcnews.com/politics/congress/trump-doubles-saying-obamacare-sucks-must-replaced-rcna126978"
  },
  {
    "text": "Trump will hold a closed-door fundraiser during the next Republican debate  —  It will be the first time he won't hold a public-facing counterprogramming event during one of the debates.  —  Former President Trump will host a closed-door fundraiser in Florida during the next week's Republican … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-will-hold-fundraiser-republican-debate-rcna127322"
  },
  {
    "text": "U.S. Attorney Announces Charges In Connection With Foiled Plot To Assassinate U.S. Citizen In New York City  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Indian Government Employee Directed a Plot From India to Murder U.S.-Based Leader of Sikh Separatist Movement",
    "url": "https://www.justice.gov/usao-sdny/pr/us-attorney-announces-charges-connection-foiled-plot-assassinate-us-citizen-new-york"
  },
  {
    "text": "Bank official flagged Hunter Biden Chinese payments as ‘unusual,’ Comer says  —  A bank investigator raised concerns internally in 2018 about payments Hunter Biden received, saying the activity on his accounts appeared “unusual,” according to House Oversight Committee Chairman James Comer (R-KY).",
    "url": "https://www.washingtonexaminer.com/news/house/bank-official-hunter-biden-chinese-payments-comer"
  },
  {
    "text": "Mike Johnson to Keynote Far-Right Christian Nationalist Gala  —  The new Speaker will speak to the National Association of Christian Lawmakers — a group dedicated to giving a right-wing “biblical worldview” the force of law  —  IF ANYONE WAS trusting that Mike Johnson would cool … ",
    "url": "https://www.rollingstone.com/politics/politics-news/mike-johnson-keynote-far-right-christian-nationalist-gala-1234905433/"
  },
  {
    "text": "Mysterious woman tells school board that Scholastic book sparked porn addiction  —  On November 14, a 20-year-old woman named Lanah Burkhardt appeared before the school board of the Conroe Independent School District in Texas.  Burkhardt told the board that, when she was 11 … ",
    "url": "https://popular.info/p/mysterious-woman-tells-school-board"
  },
  {
    "text": "James Comer Seems to Forget He Said Hunter Biden Could ‘Choose’ Public Hearing  —  While Comer rejected Hunter Biden's offer to publicly testify, last month he declared it Biden's choice to testify in public or private.  —  House Oversight Committee Chairman James Comer (R-KY) … ",
    "url": "https://www.thedailybeast.com/james-comer-seems-to-forget-he-said-hunter-biden-could-choose-public-hearing"
  }
]