[
  {
    "text": "Trump administration fires DOJ officials who worked on criminal investigations of the president  —  The DOJ employees had been involved in special counsel Jack Smith's investigation that led to Trump's classified documents and Jan. 6 cases.  —  WASHINGTON — The Department of Justice … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-administration-fires-doj-officials-worked-criminal-investigation-rcna189512"
  },
  {
    "text": "Trump Justice Department fires officials who investigated Trump and launches ‘special project’ into January 6 cases  —  More than a dozen officials who worked on the criminal investigations into Donald Trump have been fired, according to sources familiar with the matter.",
    "url": "https://www.cnn.com/2025/01/27/politics/trump-special-project-january-6-prosecutors"
  },
  {
    "text": "Trump-Appointed Prosecutor Opens Review of Justice Department's Jan. 6 Cases  —  Lawyers who worked on the matters are asked to turn over files, notes and other records  —  WASHINGTON—A top Trump-appointed prosecutor has opened an internal review of the Justice Department's decision … ",
    "url": "https://www.wsj.com/us-news/law/trump-appointed-prosecutor-opens-review-of-justice-departments-jan-6-cases-72cd371c?st=7w92vg&reflink=article_copyURL_share"
  },
  {
    "text": "Justice Department fires more than a dozen key officials on former Special Counsel Jack Smith's team  —  Acting Attorney General James McHenry 'does not trust these officials to assist in faithfully implementing the President's agenda'  —  EXCLUSIVE: The Justice Department is firing … ",
    "url": "https://www.foxnews.com/politics/justice-department-fires-more-than-dozen-key-officials-former-special-counsel-jack-smiths-team?intcmp=tw_fnc"
  },
  {
    "text": "Top USAID career staff placed on immediate leave  —  “This is like taking out all the generals,” said a former Trump administration official informed of the decision.  —  The Trump administration has ordered dozens of top career employees of the U.S. Agency for International Development … ",
    "url": "https://www.politico.com/news/2025/01/27/top-usaid-career-staff-ordered-leave-00200854"
  },
  {
    "text": "Trump Just Broke the Law.  Blatantly.  And He Might Get Away With It.  —  Imagine that there were a particularly dirty NFL player—call him Thompson—who developed a habit of doing something new and possibly dangerous to opposing players.  Penalty flags didn't deter him.  On and on he went.",
    "url": "https://newrepublic.com/article/190704/trump-fires-inspectors-general-broke-law-blatantly"
  },
  {
    "text": "Indiana man fatally shot by sheriff's deputy identified as Jan. 6 defendant  — A Jasper County sheriff's deputy fatally shot 42-year-old Matthew W. Huttle during a traffic stop in northwest Indiana on Sunday after an altercation in which Huttle reportedly resisted arrest and was armed.",
    "url": "https://www.fox32chicago.com/news/indiana-man-fatally-shot-deputy-identified-jan-6"
  },
  {
    "text": "Man Pardoned in Jan. 6 Riot Is Fatally Shot by Sheriff's Deputy During Traffic Stop  —  The police said that Matthew W. Huttle, 42, of Hobart, Ind., who was sentenced to six months for his role in the riot at the U.S. Capitol in 2021, resisted arrest after he was stopped in Indiana on Sunday.",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/jan-6-rioter-shot-indiana-traffic-stop.html"
  },
  {
    "text": "Trump's Victory Over Colombia Now Looks Less Clear Cut  — Colombia sends own planes to bring people home after showdown  — Trump runs the risk of overuse of tariff, sanctions threats  —  A deportation arrangement with Colombia that the White House on Sunday night presented … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-27/trump-s-victory-over-colombia-less-clear-as-more-details-emerge"
  },
  {
    "text": "Colombia yields on US deportation flights to avert trade war  —  A looming trade war between the US and Colombia appears to have been averted after the Colombian government agreed to allow US military flights carrying deported migrants to land in the Andean country.",
    "url": "https://www.bbc.com/news/articles/c20p36e62gyo"
  },
  {
    "text": "Google says it will change Gulf of Mexico to ‘Gulf of America’ in Maps after government updates … Google said Monday it will change the name of Gulf of Mexico to “Gulf of America” after the government updates its “official government sources.”  —  The company also said it will start using Mount McKinley … ",
    "url": "https://www.cnbc.com/2025/01/27/google-maps-to-show-gulf-of-america-after-government-updates.html"
  },
  {
    "text": "Trump Administration Halts H.I.V. Drug Distribution in Poor Countries  —  PEPFAR's computer systems also are being taken offline, a sign that the program may not return, as Republican critics had hoped.  —  The Trump administration has instructed organizations in other countries … ",
    "url": "https://www.nytimes.com/2025/01/27/health/pepfar-trump-freeze.html?unlocked_article_code=1.sU4.nnB5.iT69u4FuwlEZ&smid=url-share"
  },
  {
    "text": "Chief Corruption Prosecutor Resigns From Justice Dept.  —  Corey Amundson chose to leave the department after being told he was being reassigned by the Trump administration to a position related to immigration enforcement.  —  The head of the Justice Department's public integrity section … ",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/chief-corruption-prosecutor.html"
  },
  {
    "text": "Scott Bessent easily wins Senate confirmation to lead Treasury … - Bessent, 62, founded hedge fund Key Square Capital Management. … - During his confirmation hearing, Bessent warned of economic disaster if Trump's 2017 tax cuts aren't extended, calling the effort\"the single most important economic issue of the day.\"",
    "url": "https://www.axios.com/2025/01/27/scott-bessent-senate-confirmation-treasury-secretary"
  },
  {
    "text": "CDC ordered to stop working with WHO immediately, upending expectations of an extended withdrawal  —  U.S. public health officials have been told to stop working with the World Health Organization, effective immediately.  A U.S. Centers for Disease Control and Prevention official … ",
    "url": "https://apnews.com/article/cdc-who-trump-548cf18b1c409c7d22e17311ccdfe1f6"
  },
  {
    "text": "Trump Paralyzes Independent Rights Watchdog, Firing Members Selected by Democrats  —  The move removed three of the four sitting members of the Privacy and Civil Liberties Oversight Board, leaving it unable to act as the Trump administration begins reshaping intelligence agencies.",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/trump-fires-independent-watchdog-officials.html"
  },
  {
    "text": "Quaker groups file suit over end of policy restricting ICE arrests in houses of worship  —  The suit appears to be the first from a faith-based organization challenging the change in court.  —  A group of Quaker congregations are suing the Department of Homeland Security for changing a policy … ",
    "url": "https://www.nbcnews.com/politics/national-security/quaker-groups-file-suit-end-policy-restricting-ice-arrests-houses-wors-rcna189471"
  },
  {
    "text": "Gabbard's path through Intelligence Committee narrows ahead of key hearing  —  Republicans are cautioning that Tulsi Gabbard's path to confirmation to lead the U.S. intelligence apparatus is narrowing as she seemingly has trouble winning over key GOP senators.",
    "url": "https://thehill.com/homenews/5106082-tulsi-gabbard-intelligence-committee-hearing/"
  },
  {
    "text": "They Followed North Carolina Election Rules When They Cast Their Ballots.  Now Their Votes Could Be Tossed Anyway.  —  A Republican judge is trying to overturn his election loss by challenging more than 60,000 ballots.  These are some of those voters' stories.",
    "url": "https://www.propublica.org/article/north-carolina-voters-jefferson-griffin-supreme-court-challenge"
  },
  {
    "text": "Inside a network of AI-generated newsletters targeting “small town America”  —  Good Daily, which operates in 47 states and 355 towns and cities across the U.S., is run by one person.  —  On first glance, Good Day Fort Collins appears to be a standard local news round-up.",
    "url": "https://www.niemanlab.org/2025/01/inside-a-network-of-ai-generated-newsletters-targeting-small-town-america/"
  },
  {
    "text": "Anchor Dimitri Sotis, whose distinctive warm voice led WTOP's evening news, dies at 55  — WTOP will honor Dimitri Sotis' legacy with a live hourlong radio special at 7 p.m. Monday, Jan. 27, on 103.5 FM and on the WTOP News app.  Listen live here.  —  WTOP evening anchor Dimitri Sotis … ",
    "url": "https://wtop.com/inside-wtop/2025/01/wtop-anchor-dimitri-sotis-dies-at-55-warm-conversational-voice-informed-listeners-since-1999/"
  },
  {
    "text": "‘A Dangerous Virus’: Bird Flu Enters a New Phase  —  A pandemic is not inevitable, scientists say.  But the outbreak has passed worrisome milestones in recent weeks, including cattle that may have been reinfected.  —  When bird flu first struck dairy cattle a year ago … ",
    "url": "https://www.nytimes.com/2025/01/27/health/bird-flu-h5n1.html"
  },
  {
    "text": "US reports first outbreak of H5N9 bird flu in poultry  —  The United States has reported its first outbreak of H5N9 bird flu in poultry on a duck farm in California, the World Organisation for Animal Health (WOAH) said on Monday.  —  U.S. authorities also detected the more common H5N1 strain … ",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-reported-first-outbreak-h5n9-bird-flu-poultry-woah-says-2025-01-27/"
  },
  {
    "text": "DeepSeek FAQ  —  It's Monday, January 27.  Why haven't you written about DeepSeek yet?  —  I did!  I wrote about R1 last Tuesday.  —  I totally forgot about that.  —  I take responsibility.  I stand by the post, including the two biggest takeaways that I highlighted … ",
    "url": "https://stratechery.com/2025/deepseek-faq/"
  },
  {
    "text": "Murkowski and Chemnitz: Greenland “Ally, not an Asset”  —  Washington, DC - Today, United States Senator Lisa Murkowski (R-Alaska and Co-Chair of the Standing Committee of Parliamentarians of the Arctic Region) and Aaja Chemnitz (Member of Danish Parliament representing Greenland for Inuit Ataqatigiit … ",
    "url": "https://www.murkowski.senate.gov/press/release/murkowski-and-chemnitz-greenland-ally-not-an-asset"
  },
  {
    "text": "FBI insider raises concerns about Kash Patel's role in hostage rescue  —  Days before this week's high-stakes confirmation hearing of Kash Patel to be FBI director, a bureau insider has come forward with new information questioning Patel's judgment during sensitive hostage rescue missions, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/fbi-insider-kash-patel-hostage-rescue/"
  },
  {
    "text": "Memos to Federal Employees Were Written By People With Ties to Project 2025, Metadata Shows  —  Some of the Office of Personnel Management (OPM) memos sent to federal workers about firing, hiring freezes, and mandatory return to office demands were seemingly written by people who were previously employed … ",
    "url": "https://www.404media.co/opm-memos-to-federal-employees-metadata/"
  },
  {
    "text": "Navajo Nation leaders raise alarm over reports of Indigenous people being questioned and detained during immigration sweeps  —  At least 15 Indigenous people in Arizona and New Mexico have reported being stopped at their homes and workplaces, questioned or detained by federal law enforcement … ",
    "url": "https://www.cnn.com/2025/01/27/us/navajo-detained-ice-indigenous-immigration-trump/"
  },
  {
    "text": "Tucker Carlson's son Buckley is joining JD Vance's staff  —  Vance has brought over several of his Senate staff to serve in his VP office.  —  Vice President JD Vance walks from Air Force Two as he arrives at Tri-Cities Airport, Jan. 27, 2025, in Blountville, Tenn.",
    "url": "https://abcnews.go.com/US/tucker-carlsons-son-buckley-joining-jd-vances-staff/story?id=118150708"
  }
]