[
  {
    "text": "Is Trump OK?  Unhinged reaction to rise of Harris worries supporters  —  Rambling speeches peppered with insults, narcissism and an obsession with crowd size have raised questions about the former president's fitness for office  —  Even some of Donald Trump's supporters are now asking … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/24/donald-trump-mental-fitness-campaign"
  },
  {
    "text": "Trump's Carefully Scripted Week Kept Veering Off Script  —  Despite calls by his advisers to focus on the issues, former President Donald J. Trump has made it clear that he intends to keep running his campaign his way.  —  Donald J. Trump's political endurance this year has been attributed … ",
    "url": "https://www.nytimes.com/2024/08/24/us/politics/trump-campaign-2024.html?unlocked_article_code=1.FU4.F6Z6.d5lNA8CP3hx6&smid=url-share"
  },
  {
    "text": "GOP strategist cautions Trump on joining forces with RFK Jr: 'He's kind of a looney tune'  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters",
    "url": "https://thehill.com/homenews/campaign/4845776-gop-strategist-scott-jennings-on-donald-trump-robert-f-kennedy-jr-joining-forces/"
  },
  {
    "text": "Democratic convention energy, Harris hot streak making Republicans nervous  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4844833-republicans-nervous-harris-dnc-surge/"
  },
  {
    "text": "RFK Jr. Was My Drug Dealer  —  he leading third-party candidate for president—an environmental lawyer and activist, a son and nephew of legendary liberal Democratic politicians—just quit the race and announced that he is joining the campaign of the most anti-environment president … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/rfk-jr-endorse-trump-execute-drug-dealers/679597/?gift=_YJWRO9sT6lILBJDbj6IXBARrGSL_SiqmR7eWDgV4og"
  },
  {
    "text": "RFK Jr.'s out.  Does it change the race?  —  EXIT STAGE RIGHT — Some third-party presidential campaigns are noble endeavors driven by the loftiest of principles.  Others are vanity projects, exercises in cynicism that leave our politics slightly more soiled for the experience.",
    "url": "https://www.politico.com/newsletters/politico-nightly/2024/08/23/rfk-jr-s-out-does-it-change-the-race-00176256"
  },
  {
    "text": "A Manufactured Fight over Incumbency Hides Trump's Fascism  —  Thinking of Trump in terms of presidential administrations — reading this race as a fight over incumbency — is a category error that serves to hide the threat Trump poses to democracy.  —  Yet a slew of reviews of the DNC … ",
    "url": "https://www.emptywheel.net/2024/08/24/a-manufactured-fight-over-incumbency-hides-trumps-fascism/"
  },
  {
    "text": "Fauci recovering after hospitalization for West Nile virus  —  Dr. Anthony Fauci, former director of the National Institute of Allergy and Infectious Diseases, is recovering at home after being hospitalized with West Nile virus, a spokesperson said.  —  Fauci, a longtime public health official … ",
    "url": "https://www.cnn.com/2024/08/24/health/fauci-west-nile-virus"
  },
  {
    "text": "Are Republicans losing the culture wars?  —  School board candidates who ran on parental rights in classrooms are suffering defeats in states like Florida, once a leader in the “anti-woke” movement.  —  Republicans are confronting a decisive moment in the battle over public education: proving they can still win a culture war.",
    "url": "https://www.politico.com/news/2024/08/24/republicans-culture-war-races-00176166"
  },
  {
    "text": "Voters deserve answers on Kamala Harris's true energy policy  —  “There's no question I'm in favor of banning fracking.”  —  Those were the words of Kamala Harris when she ran for president in 2019, and there was every reason to believe her.  Throughout her career, from California to Washington … ",
    "url": "https://thehill.com/opinion/energy-environment/4844038-harris-fracking-energy-policies/"
  },
  {
    "text": "Kristi Noem rejects more than $70 million in federal funds  —  Governor Kristi Noem's administration recently turned down more than $70 million of federal funds from energy efficiency and environmental programs, according to her top budget official.  —  The Home Energy Rebates program … ",
    "url": "https://www.rawstory.com/kristi-noem-rejects-more-than-70-million-in-federal-funds/"
  },
  {
    "text": "Joy Is Not a Strategy  —  If the Republican convention's message for America last month had to fit on a bumper sticker, it would read, “Trump is God.”  Delegates deified him relentlessly as the risen Trump after the assassination attempt.  They told me over and over that he was spared to save the country with his re-election.",
    "url": "https://www.nytimes.com/2024/08/20/opinion/kamala-harris-democratic-convention.html?unlocked_article_code=1.FU4.1qYT.V8H_W6nIU1CI&smid=url-share"
  },
  {
    "text": "Raphael Warnock Told the DNC to “Keep the Faith.”  He Restored Mine in the Process.  —  The senator from Georgia made space for hope—and righteous cynicism.  —  This week, at the Democratic National Convention, the speeches of Michelle Obama and the Second Gentleman Doug Emhoff … ",
    "url": "https://www.motherjones.com/politics/2024/08/raphael-warnock-dnc-speech/"
  },
  {
    "text": "Two versions of masculinity are on the 2024 ballot … - But now rather than an aging President Biden, he's running against the potential first woman president.  — Vice President Kamala Harris rarely mentions her gender, but the men at her side have embraced their second-fiddle roles in supporting a woman's rise to power.",
    "url": "https://www.axios.com/2024/08/24/walz-trump-emhoff-masculinity-fatherhood"
  },
  {
    "text": "These Young Women Didn't Want to Vote for Biden.  They're All In on Harris.  —  In new polls, a large majority of young women plan to vote for the vice president.  We talked with eight of them.  —  Constance Lancelle, 22, of Milwaukee, was “definitely not interested in voting for Biden,” she said.",
    "url": "https://www.nytimes.com/2024/08/24/upshot/harris-polling-young-women.html"
  },
  {
    "text": "RFK Jr., environmental warrior, backs the ‘drill, baby, drill’ ticket  —  As an activist and lawyer, Robert F. Kennedy Jr. spent decades battling for environmental protections that Trump has worked to undo.  —  Kennedy had promised to be “the best environmental president in American history.”",
    "url": "https://www.washingtonpost.com/politics/2024/08/24/kennedy-trump-endorsement-environmental-issues/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0NDcyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1ODU0Mzk5LCJpYXQiOjE3MjQ0NzIwMDAsImp0aSI6Ijc3OGNlMzY5LTFmZTEtNDQ1YS1hZGI3LWEzYmMzYWRhYzQxNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzI0L2tlbm5lZHktdHJ1bXAtZW5kb3JzZW1lbnQtZW52aXJvbm1lbnRhbC1pc3N1ZXMvIn0.Cr-rC-5ygDPY4sNeVFDCXNUL1vQcuHZZEASVa5a22s8&itid=gfta"
  }
]