[
  {
    "text": "First on CNN: Federal prosecutors file new criminal case against Hunter Biden  —  Federal prosecutors have filed a new criminal case against Hunter Biden, people briefed on the matter said.  —  The exact nature of the charges couldn't immediately be learned because court documents have not been made public.",
    "url": "https://www.cnn.com/2023/12/07/politics/hunter-biden-criminal-case/"
  },
  {
    "text": "Hunter Biden faces new indictment in California  —  President Biden's son Hunter Biden was indicted in California Thursday on a litany of tax charges, according to documents made public.  —  The indictment Hunter Biden's failure to pay nearly $200,000 of income tax in the year 2019.",
    "url": "https://www.foxnews.com/politics/hunter-biden-faces-new-indictment-california"
  },
  {
    "text": "Hunter Biden Says Republicans Are Trying To ‘Kill’ Him To Destroy His Father's Presidency  —  Joe Biden's son sat down for a rare podcast interview with Moby.  —  LOADING  —  WASHINGTON ― Hunter Biden said in a podcast interview published Friday that Republicans and the right-wing media … ",
    "url": "https://www.huffpost.com/entry/hunter-biden-moby-interview_n_65723b4ee4b001ec86a76319"
  },
  {
    "text": "UPenn board chair expected to speak with president Liz Magill about stepping down  —  New York CNN  —  The University of Pennsylvania's board of trustees held an emergency meeting Thursday as school president Liz Magill faces scathing criticism over her performance at a House hearing earlier this week.",
    "url": "https://www.cnn.com/2023/12/07/business/penn-emergency-meeting-liz-magill/"
  },
  {
    "text": "Penn loses $100 million donation over antisemitism hearing  —  A wealthy donor to the University of Pennsylvania is withdrawing a gift worth around $100 million in protest of the school's response to antisemitism on campus.  —  The big picture: The final straw for Ross Stevens … ",
    "url": "https://www.axios.com/2023/12/07/upenn-antisemitism-magill-100-million-donation"
  },
  {
    "text": "North Dakota senator's son charged with manslaughter after officer killed in police chase  —  Sen. Kevin Cramer's son, Ian Cramer, was charged in connection with a police chase on Wednesday that led to the death of a sheriff's deputy in Mercer County, North Dakota.",
    "url": "https://www.nbcnews.com/politics/politics-news/north-dakota-senators-son-charged-manslaughter-police-chase-killed-off-rcna128653"
  },
  {
    "text": "Alan Hostetter, ex-police chief who brought hatchet to Capitol on Jan. 6, sentenced to 11 years in prison  —  A former California police chief who brought a hatchet to the Capitol on Jan. 6, 2021, has been sentenced to more than 11 years in prison for his role in the siege.",
    "url": "https://www.cbsnews.com/news/alan-hostetter-sentenced-january-6-capitol-attack-11-years/"
  },
  {
    "text": "Exclusive: Pro-Trump lawyer Kenneth Chesebro cooperating in multiple state probes into 2020 fake electors plot  —  The pro-Trump lawyer who helped devise the 2020 fake electors plot and already pleaded guilty to the conspiracy in Georgia is now cooperating with Michigan and Wisconsin state investigators … ",
    "url": "https://www.cnn.com/2023/12/08/politics/kenneth-chesebro-cooperating-multiple-investigations"
  },
  {
    "text": "Trump appeals Jan. 6 immunity ruling, launching process that may delay trial  —  Both appeals court and Supreme Court would have to rule on appeals quickly for trial to begin before 2024 election, experts say  —  Donald Trump filed notice on Thursday saying he will appeal a D.C. judge's ruling … ",
    "url": "https://www.washingtonpost.com/national-security/2023/12/07/trump-appeal-trial-immunity/"
  },
  {
    "text": "N.Y. appeals court upholds Judge Engoron's ruling that Trump committed ‘widespread fraud’  —  Former President Donald Trump was dealt a major blow by the New York Court of Appeals on Thursday in the midst of his ongoing civil fraud trial in the Empire State.",
    "url": "https://www.rawstory.com/trump-organization-fraud-2666475449/"
  },
  {
    "text": "Texas progressive group previously bailed out suspect charged in deadly Austin, San Antonio shooting rampage  —  Shane James, 34, previously served as a U.S. Army infantry officer before he was discharged in August 2015, the Army said  —  A suspect accused of six murders across Texas during … ",
    "url": "https://www.foxnews.com/politics/texas-progressive-group-previously-bailed-suspect-charged-deadly-austin-san-antonio-shooting-rampage?intcmp=tw_fnc"
  },
  {
    "text": "Albany Police: Man fired gun outside Temple Israel, told officers ‘Free Palestine’  —  One person investigated for shooting at Temple Israel  —  One person investigated for shooting at Temple Israel  —  A 28-year-old man is accused of firing shots on the grounds of Temple Israel and yelling “Free Palestine” before he was arrested.",
    "url": "https://wnyt.com/top-stories/albany-police-man-fired-shotgun-outside-temple-israel/"
  },
  {
    "text": "Putin tells soldiers: I will run for president again in 2024  —  Russian President Vladimir Putin on Friday told soldiers who had fought in the Ukraine war that he would run for president again in the 2024 election, a move that will allow the former KGB spy to stay in power until at least 2030.",
    "url": "https://www.reuters.com/world/europe/putin-says-he-will-run-president-2024-tass-2023-12-08/"
  },
  {
    "text": "Bystanders Stop Woman Torching Martin Luther King Jr.'s Atlanta Birth Home  —  She had already poured gasoline on the property when people intervened, police said.  —  Off-duty police officers and tourists on Thursday helped to stop a woman setting fire to the house where Martin Luther King Jr … ",
    "url": "https://www.thedailybeast.com/bystanders-stop-woman-torching-martin-luther-king-jrs-birth-home"
  },
  {
    "text": "GOP's Brutal Math: Trump Could Secure Nomination Before Conviction  —  Looking at the primary schedule, Republicans see the party handcuffing itself to a candidate on the verge of politically toxic criminal convictions. … ‘People need to wake up’  —  There's a scenario many Republicans are dreading … ",
    "url": "https://www.thedailybeast.com/gops-brutal-math-donald-trump-could-secure-2024-nomination-before-criminal-conviction"
  },
  {
    "text": "GOP lawmaker: Ousted aides targeted my daughter for OnlyFans account  —  Rep. Brandon Williams, who represents a battleground seat, says his altercation stemmed from a threat to expose his daughter's OnlyFans account.  —  A Republican member of Congress is alleging that a former top aide spearheaded a … ",
    "url": "https://www.politico.com/news/2023/12/08/brandon-williams-interview-video-former-aides-00130713"
  },
  {
    "text": "Why Fundamentalists Love Trump  —  I just finished reading Tim Alberta's masterly new book, “The Kingdom, the Power, and the Glory: American Evangelicals in an Age of Extremism.”  It's a powerful and emotionally resonant account of the transformation in evangelical politics that has brought us … ",
    "url": "https://www.nytimes.com/2023/12/07/opinion/donald-trump-fundamentalists-evangelical.html"
  },
  {
    "text": "White Supremacists Are Celebrating Vivek Ramaswamy's ‘Great Replacement’ Rant  —  Presidential candidate Vivek Ramaswamy boosted multiple far-right conspiracy theories during the GOP debate on Wednesday night, in a dangerous mainstreaming of once-fringe claims.",
    "url": "https://www.wired.com/story/vivek-ramaswamy-debate-great-replacement-theory-conspiracy/"
  },
  {
    "text": "Democrats eye Montana abortion ballot measure to boost Tester  —  Democrat-aligned groups are working to put a state constitutional amendment protecting abortion rights on Montana's ballot next year, a move that would boost embattled Democratic Sen. Jon Tester's re-election bid.",
    "url": "https://www.axios.com/2023/12/08/montana-abortion-law-rights-state-constitution-amendment"
  },
  {
    "text": "MAGA rioter punched woman ‘in the throat’ after his sexual advances were denied: Feds  —  Federal prosecutors are arguing that a North Carolina man charged in connection with the January 6 Capitol attack should await trial in jail because he allegedly instigated a bar fight after a woman rejected him … ",
    "url": "https://www.rawstory.com/maga-rioter-punched-woman-in-the-throat-after-his-advances-were-denied-feds/"
  },
  {
    "text": "Killing of Reuters Journalist Was ‘Apparently Deliberate’ Israeli Strike, Group Says  —  Human Rights Watch found that the slain journalist and six colleagues were not near active fighting in southern Lebanon and would have been clearly visible to Israeli forces.",
    "url": "https://www.nytimes.com/2023/12/07/world/middleeast/reuters-journalist-killed-lebanon-israel-hrw.html"
  },
  {
    "text": "RNC Fourth Presidential Primary Debate 12/06/23 Transcript  —  RNC Fourth Presidential Primary Debate 12/06/23.  Read the transcript here.  —  Transcribe Your Own Content  —  Welcome to the fourth and final Republican Presidential Primary Debate of the Year live from the University of Alabama.",
    "url": "https://www.rev.com/blog/transcripts/rnc-fourth-presidential-primary-debate-12-06-23-transcript"
  }
]