[
  {
    "text": "A tantalizing detail in a new Trump legal filing  —  The government signals it plans to prove Donald Trump's much-debated intent for taking and keeping classified documents  —  Donald Trump's many legal problems have led to a veritable fire hose of often-mundane, procedural court filings.",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/trump-classified-documents-motive/"
  },
  {
    "text": "After years of exaggerating his business assets, Trump confronts them in court  —  A civil case entering its second week threatens to put on display unprecedented details about how Trump's business operated  —  When Donald Trump needed to value his Trump Tower apartment for homeowner's insurance in 2010 … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/trump-fraud-trial-property-value-wealth/"
  },
  {
    "text": "Prosecutors Ask if Trump Will Blame His Lawyers as Defense in Election Case  —  The special counsel asked a judge to require the former president to disclose whether he would blame poor legal advice for his attempts to overturn his 2020 election loss.  —  Federal prosecutors asked a judge … ",
    "url": "https://www.nytimes.com/2023/10/10/us/politics/prosecutors-trump-blame-lawyers.html"
  },
  {
    "text": "Palestinians scramble for safety as Israel pounds sealed-off Gaza Strip to punish Hamas  —  Drone footage captures extent of destruction caused by Israeli airstrikes in Gaza City  —  Concerns mount over Israel's next move as government vows to siege Gaza  —  Israel continues retaliation on fourth day of war",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-airstrikes-hostages-bf6c42f84526c4d9416978c8effd932a"
  },
  {
    "text": "Heat for NYC-DSA after pro-Palestine rally  —  HAPPENING TODAY: Former Rep. Tom Suozzi is expected to launch his comeback bid for the seat now held by Rep. George Santos, three people familiar with the plan told Playbook.  The Democrat — and many other challengers — are thinking … ",
    "url": "https://www.politico.com/newsletters/new-york-playbook/2023/10/10/heat-for-nyc-dsa-after-pro-palestine-rally-00120675"
  },
  {
    "text": "AOC knocks ‘bigotry and callousness’ of Times Square rally for Palestinians  —  “It should not be hard to shut down hatred and antisemitism where we see it.  That is a core tenet of solidarity,” Ocasio-Cortez said.  —  NEW YORK — The New York City chapter of the Democratic Socialists … ",
    "url": "https://www.politico.com/news/2023/10/10/aoc-pro-palestine-nyc-rally-00120684"
  },
  {
    "text": "North Carolina Republicans override governor's veto on key election law  —  Gov. Roy Cooper (D) has cast the bill as a threat to democracy in the state.  Republicans say it takes politics out of the process of administering the vote.  —  North Carolina Republican lawmakers on Tuesday overrode … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/10/north-carolina-republican-override-veto/"
  },
  {
    "text": "Survey shows Lake leading Gallego, Sinema in Arizona Senate race  —  Failed GOP Arizona gubernatorial candidate Kari Lake appears to have a slight lead over Rep. Ruben Gallego (D-Ariz.) and Sen. Krysten Sinema (I-Ariz.) in a hypothetical three-way contest for Sinema's seat next year, according to a new poll.",
    "url": "https://thehill.com/homenews/campaign/4247574-survey-shows-lake-leading-gallego-sinema-in-arizona-senate-race/"
  },
  {
    "text": "Gallego leads Lake, Sinema in Arizona Senate race: poll  —  Rep. Ruben Gallego (D-Ariz.) is leading both former Arizona gubernatorial candidate Kari Lake (R) and Sen. Krysten Sinema (I-Ariz.) in a hypothetical three-way race for Sinema's Arizona Senate seat, according to a new poll.",
    "url": "https://thehill.com/homenews/campaign/4246848-gallego-leads-lake-sinema-in-arizona-senate-race-poll/"
  },
  {
    "text": "Former Dodgers star and Republican Steve Garvey enters U.S. Senate race  —  After nearly two decades of statewide Republican candidates being rejected by California's left-leaning electorate, former Dodger All-Star Steve Garvey hopes to drag the GOP back toward political relevance.",
    "url": "https://www.latimes.com/politics/story/2023-10-10/dodgers-star-steve-garvey-senate-race-feinstein-schiff-porter-lee"
  },
  {
    "text": "Jim Jordan's new shutdown threat highlights an unnerving right-wing trend  —  Republicans spend more time talking about the practical problems posed by the U.S.-Mexico border than any other issue — even as much of what they propose to address them is utter fantasy.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/10/jim-jordan-house-gop-government-shutdown/"
  },
  {
    "text": "Speaker Candidates Jordan, Scalise Commit to Continuing Impeachment Investigation (Exclusive)  —  Sources close to the two lawmakers told The Messenger that they both plan to keep the investigation going if they are speaker … The two Republicans running to be the next speaker of the House … ",
    "url": "https://themessenger.com/politics/speaker-candidates-jordan-scalise-commit-to-continuing-impeachment-investigation"
  },
  {
    "text": "McCarthy loyalists vow to draw out painful speakership battle  —  House Republicans' state of emotional limbo is particularly problematic, since they'd otherwise welcome the chance to move quickly on aiding Israel.",
    "url": "https://www.politico.com/live-updates/2023/10/10/congress/mccarthy-speaker-vote-israel-math-00120720"
  },
  {
    "text": "In Search of Kamala Harris  —  After nearly three years, the vice president is still struggling to make the case for herself — and feels she shouldn't have to.  —  All the conditions seemed right for a chance to reset the narrative.  —  At the Munich Security Conference in February … ",
    "url": "https://www.nytimes.com/2023/10/10/magazine/kamala-harris.html"
  },
  {
    "text": "IDF says Gaza border finally sealed, bodies of 1,500 terrorists found inside Israel  —  Breaches in barrier being mined; military continues to notify relatives of those taken to Gaza; airstrikes target hundreds of sites in Strip, including Gaza City power base Rimal",
    "url": "https://www.timesofisrael.com/idf-says-gaza-border-finally-sealed-bodies-of-1500-terrorists-found-inside-israel/"
  },
  {
    "text": "Putin Offers Muted Response to Attack on Israel.  That Speaks Volumes.  —  Vladimir Putin has long projected friendly ties to Israel.  But his silence since Saturday's assault illustrates how the war in Ukraine has strained the relationship between the two countries.",
    "url": "https://www.nytimes.com/2023/10/10/world/europe/israel-hamas-russia-putin.html"
  },
  {
    "text": "War in the Middle East  —  A Statement from President Claudine Gay  —  As the events of recent days continue to reverberate, let there be no doubt that I condemn the terrorist atrocities perpetrated by Hamas.  Such inhumanity is abhorrent, whatever one's individual views of the origins of longstanding conflicts in the region.",
    "url": "https://www.harvard.edu/president/news/2023/war-in-the-middle-east/"
  },
  {
    "text": "Alex Jones to fight Georgia prosecutors' bid to call him as witness in trial of Trump co-defendants  —  Fulton County DA Fani Willis indicated Tuesday that she intends to compel the testimony of the far-right broadcaster.  —  Alex Jones intends to resist efforts by Fulton County District Attorney Fani Willis … ",
    "url": "https://www.politico.com/news/2023/10/10/alex-jones-trump-georgia-testimony-00120807"
  },
  {
    "text": "Tim Scott, please drop out, urge others to follow and unite behind Haley  —  Disclosure: The columnist's wife, Mari Will, an adviser to Republican presidential candidate Sen. Tim Scott (S.C.), disagrees with this column.  —  There is national incredulity, exhaustion, embarrassment … ",
    "url": "https://www.washingtonpost.com/opinions/2023/10/10/tim-scott-drop-out-endorse-nikki-haley/"
  },
  {
    "text": "RFK Jr. super PAC raises $11 million within hours and courts Elon Musk's support  —  The environmental lawyer-turned-politician is mounting a formidable independent bid.  —  Just hours after Robert F. Kennedy Jr. announced he would run for president as an independent, more than $11 million gushed … ",
    "url": "https://www.politico.com/news/2023/10/10/rfk-jr-raises-11-million-elon-musk-00120731"
  },
  {
    "text": "EU says disinformation spreading on X after Hamas attack, urges Musk to tackle it  —  The EU's industry chief told Elon Musk that disinformation was spreading on his X messaging platform since Palestinian Islamist group Hamas' surprise attack on Israel, urging him to take counter-measures in line with new EU online content rules.",
    "url": "https://www.reuters.com/world/eus-breton-warns-musk-about-disinformation-x-after-hamas-attack-israel-2023-10-10/"
  }
]