[
  {
    "text": "Behind the Curtain: Kamala Harris' epic edge … - Rep. Bennie Thompson (D-Miss.), who chaired the House Jan. 6 committee, told Axios' Hans Nichols that Harris is “incredibly strong ... You can't say Biden has done a good job without saying she's done a good job.” … Of course, all this may take a while.",
    "url": "https://www.axios.com/2024/07/04/kamala-harris-replace-biden-2024-election"
  },
  {
    "text": "Biden Tells Governors He Needs to Sleep More and Work Less at Night  —  The president's opening remark to a group of key Democratic leaders — that he was in the race to stay — chilled any talk of his withdrawal, participants said.  —  President Biden told a gathering of Democratic governors … ",
    "url": "https://www.nytimes.com/2024/07/04/us/politics/biden-governors.html"
  },
  {
    "text": "Criminal Trump is clearly unfit for office  —  It's been a brutal week for American democracy.  President Joe Biden's surprisingly poor performance in the presidential debate has thrown many in the Democratic Party into full panic mode.  —  In the aftermath of the debate … ",
    "url": "https://www.theframelab.org/unfit-for-office-trump-biden/"
  },
  {
    "text": "Governors Undermine Efforts by Congressional Democrats to Nudge Biden Aside  —  While members of Congress worry about the drag on their own races, many governors are looking ahead to '28.  —  Democratic governors to Democratic members of Congress: Drop dead.",
    "url": "https://www.politico.com/news/magazine/2024/07/04/governors-undermine-efforts-by-congressional-democrats-to-nudge-biden-aside-00166589"
  },
  {
    "text": "Strongman, Weak State  —  The dispiriting vision of American governance offered by the Roberts Court  —  The hinges of history, the moments that determine the shape of our world, are usually only obvious in retrospect.  Sometimes, dramatic political events, like assassinations, announce their own importance.",
    "url": "https://donmoynihan.substack.com/p/strongman-weak-state"
  },
  {
    "text": "State of Tennessee tells U.S. Navy veteran he's not an American citizen and cancels his driver's license  —  NASHVILLE, Tenn. (WTVF) — As we celebrate the nation's birthday and what it means to be an American, a U.S. Navy veteran who has lived in the U.S. for more than seven decades … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/state-of-tennessee-tells-u-s-navy-veteran-hes-not-an-american-citizen-and-cancels-his-drivers-license"
  },
  {
    "text": "‘Bitter old man’: Trump shredded for egocentric and rambling July 4th rant  —  Former President Donald Trump kicked off the Fourth of July with a lengthy screed on Truth Social praising himself and lobbing insults at President Joe Biden and Vice President Kamala Harris … ",
    "url": "https://www.rawstory.com/trump-july-4-2668688196/"
  },
  {
    "text": "The Supreme Court Has Murdered the Constitution  —  America's founding document is now an all-but-meaningless scrap of paper.  Happy Fourth!  —  Chief Justice John Roberts is seen before the State of the Union address to a joint session of Congress at the Capitol on March 7, 2024.",
    "url": "https://prospect.org/justice/2024-07-04-supreme-court-roberts-murdered-constitution/"
  },
  {
    "text": "COVID-19 can surge throughout the year  —  AT A GLANCE … Summary  —  What CDC knows  —  In the United States, respiratory virus illnesses typically peak during the fall and winter.  These peaks are due to several factors, including human behaviors and environmental conditions … ",
    "url": "https://www.cdc.gov/ncird/whats-new/covid-19-can-surge-throughout-the-year.html"
  },
  {
    "text": "Why a New Conservative Brain Trust Is Resettling Across America  —  Pro-Trump professionals aren't just talking about remaking Western civilization.  Some are uprooting their lives to show that they mean it.  —  Fed up by what they see as an increasingly hostile and disordered secular culture … ",
    "url": "https://www.nytimes.com/2024/07/04/us/claremont-institute-trump-conservatives.html"
  },
  {
    "text": "Why Biden must withdraw  —  The president and his party portray themselves as the saviours of democracy.  Their actions say otherwise  —  The presidential debate was awful for Joe Biden, but the cover-up has been worse.  It was agony to watch a befuddled old man struggling to recall words and facts.",
    "url": "https://www.economist.com/leaders/2024/07/04/why-biden-must-withdraw"
  },
  {
    "text": "There Is Apparently No Accountability — Ever — for Donald Trump  —  We tell children — or at least we used to — that actions have consequences.  What goes around comes around.  Watch your behavior.  You'll answer for it someday.  —  Donald Trump is the living, lying contradiction of that.",
    "url": "https://www.nytimes.com/2024/07/04/opinion/donald-trump-immunity.html"
  },
  {
    "text": "The untold story of the most chaotic Nato summit ever  —  Told by the people who witnessed the 2018 Trump show first hand  —  Donald Trump was going to pull out of Nato.  As the president's motorcade powered through the early morning light of July 12 2018, bound for a summit … ",
    "url": "https://www.ft.com/content/8985b970-0015-479f-9585-7a9b234715a4"
  },
  {
    "text": "Trump's New Racist Insult  —  The former president's recent attack on Senator Chuck Schumer is like an Everlasting Gobstopper of offense, with new layers emerging one after another.  —  Weird things happen on the debate stage—just ask Joe Biden.  So when Donald Trump used Palestinian … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-racist-insult-palestinian-schumer/678902/"
  },
  {
    "text": "Le Pen Rivals Set to Block Far-Right French Majority, Polls Show  — Far right and allies seen winning between 190 and 250 seats  — Voters head to polling stations for second round on Sunday  —  Marine Le Pen's National Rally is set to fall well short of an absolute majority … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-04/le-pen-set-to-fall-short-of-majority-in-france-polling-shows"
  },
  {
    "text": "The partisan gap in views of American greatness  —  Democrats are more proud of the U.S. Republicans are more likely to view it as the greatest country on Earth.  —  America, we are often told, is less a country than an idea.  That idea can be nebulous in its formulation, but it generally centers on opportunity and around freedom.",
    "url": "https://www.washingtonpost.com/politics/2024/07/04/republicans-democrats-america-polling/"
  }
]