[
  {
    "text": "Special counsel probed Trump Mar-a-Lago trip that aides ‘kept quiet’ weeks before FBI search: Sources  —  One witness was told Trump was “checking on the boxes,” sources said.  —  In this June 9, 2017, file photo, President Donald Trump is shown at the White House in Washington, D.C.",
    "url": "https://abcnews.go.com/US/special-counsel-probed-trump-mar-lago-trip-aides/story?id=111334156"
  },
  {
    "text": "Days before debate, Trump spokesperson clashes with CNN anchor on air  —  “We're going to stop this interview if you're going to keep attacking my colleagues,” Kasie Hunt said.  —  A Donald Trump spokesperson got into a tense exchange with CNN's Kasie Hunt over debate hosts Dana Bash … ",
    "url": "https://www.politico.com/news/2024/06/24/trump-debate-cnn-00164658"
  },
  {
    "text": "What two years without Roe looks like, in 8 charts  —  For 49 years after Roe v. Wade, Americans had the right to obtain an abortion if they became pregnant.  Then, two years ago, with Dobbs v. Jackson Women's Health Organization, the Supreme Court put an end to it.",
    "url": "https://www.vox.com/explainers/356314/abortion-laws-roe-wade-dobbs-decision-mifepristone-supreme-court"
  },
  {
    "text": "Conservative-backed group is creating a list of federal workers it suspects could resist Trump plans  —  From his home office in small-town Kentucky, a seasoned political operative is quietly investigating scores of federal employees suspected of being hostile to the policies of Republican Donald Trump … ",
    "url": "https://apnews.com/article/trump-biden-president-project-2025-33d3fc2999a74f4aa424f1128dca2d16"
  },
  {
    "text": "Supreme Court Will Hear Challenge to Tennessee Law Banning Transition Care for Minors  —  The move comes as states around the country have pushed to curtail transgender rights.  —  The Supreme Court agreed on Monday to consider a Tennessee law that bans certain medical treatments for transgender minors … ",
    "url": "https://www.nytimes.com/2024/06/24/us/politics/supreme-court-transgender-care-tennessee.html"
  },
  {
    "text": "Texas abortion ban linked to 13% increase in infant and newborn deaths  —  “This might foreshadow what is happening in other states,” said Johns Hopkins public health researcher Alison Gemmill.  “Texas is basically a year ahead.”  —  A Texas law that banned abortions in early pregnancy … ",
    "url": "https://www.nbcnews.com/health/health-news/texas-abortion-ban-linked-rise-infant-newborn-deaths-rcna158375"
  },
  {
    "text": "How Trump and Biden compare on running up debt … - Both candidates bear a share of the responsibility, as each added trillions to that tally while in office.  — But Trump's contribution was significantly higher, according to the fiscal watchdogs at the Committee for a Responsible Federal Budget … ",
    "url": "https://www.axios.com/2024/06/24/trump-biden-debt-deficits-election"
  },
  {
    "text": "Same-Sex Relations, Marriage Still Supported by Most in U.S.  —  Republican backing for legalizing same-sex unions dips back below 50%  —  WASHINGTON, D.C. — More than two in three Americans continue to believe that marriage between same-sex couples should be legal (69%) … ",
    "url": "https://news.gallup.com/poll/646202/sex-relations-marriage-supported.aspx"
  },
  {
    "text": "Young voters backing Biden over Trump by 23-point margin: Poll  —  President Biden has a comfortable lead over former President Trump among voters under the age of 30, according to a new poll.  The CBS News/YouGov poll found 61 percent of likely voters under the age of 30 surveyed support Biden while 38 percent support Trump.",
    "url": "https://thehill.com/homenews/campaign/4736410-biden-trump-young-voters/"
  },
  {
    "text": "Journalist shot by Minneapolis police at George Floyd protest in hospice care  —  Linda Tirado 'is at life's end' due to eye injury sustained while covering a protest in 2020  —  A journalist who was shot in the eye by Minneapolis police while covering the 2020 protests following the murder … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/24/linda-tirado-journalist-shot-police-protests-hospice"
  },
  {
    "text": "UNRWA is sued by Israeli victims of Oct. 7 Hamas attack  —  The United Nations Palestinian refugee agency was sued on Monday by dozens of Israelis who accused it of aiding and abetting the Oct. 7 Hamas attack on Israel.  —  In a complaint filed with the U.S. District Court in Manhattan … ",
    "url": "https://www.reuters.com/world/middle-east/unrwa-is-sued-by-israeli-victims-oct-7-hamas-attack-2024-06-24/"
  },
  {
    "text": "Liz Cheney Taunts Trump With Clip Of Taylor Swift's Crowd Size  —  The former congresswoman is definitely not a Trumper, but she might be a Swiftie.  —  LOADING  —  Former Rep. Liz Cheney (R-Wyo.) trolled former President Donald Trump over the size of the crowd at Taylor Swift's latest concert tour stop.",
    "url": "https://www.huffpost.com/entry/liz-cheney-trump-crowd-size_n_66797540e4b03378e8dcfc9f"
  },
  {
    "text": "Trump is on a fundraising blitz.  But there are other warning signs for Republicans.  —  For the first time this year, the Fox News poll had Joe Biden leading Donald Trump by two points, within the poll's margin of error.  —  For Republicans who spent much of the year crowing about Joe Biden's weaknesses … ",
    "url": "https://www.politico.com/news/2024/06/24/trump-fundraising-republicans-nervous-00164588"
  },
  {
    "text": "Louisiana Republicans write a guide for Alito and Thomas  —  Their Ten Commandments law has a small but powerful audience. … On its own, Louisiana's new law requiring the Ten Commandments to be displayed in every public school classroom is bad enough, a victory for evangelicals who want to push … ",
    "url": "https://www.publicnotice.co/p/louisiana-ten-commandments-law-alito-thomas"
  },
  {
    "text": "Nineteen dead in attacks on churches and synagogue in southern Russia  —  Attacks on police posts, churches and a synagogue in Russia's North Caucasus republic of Dagestan have left 19 people and five gunmen dead.  —  At least 16 people were taken to hospital with injuries after the Sunday evening attack.",
    "url": "https://www.bbc.com/news/articles/crgggwg158do"
  }
]