[
  {
    "text": "Biden's Family Tells Him to Keep Fighting as They Huddle at Camp David  —  President Biden is trying to figure out how to tamp down Democratic anxiety after last week's disastrous debate performance.  —  President Biden's family is urging him to stay in the race and keep fighting despite … ",
    "url": "https://www.nytimes.com/2024/06/30/us/politics/biden-debate-anxious-democrats.html"
  },
  {
    "text": "Biden campaign raises more than $33M since debate with Trump  —  President Biden's campaign has raked in more than $33 million since his debate with former President Trump last week despite some backlash about his performance.  —  In an email on Sunday, a Biden campaign official … ",
    "url": "https://thehill.com/homenews/campaign/4748477-biden-campaign-33-million-debate-donald-trump/"
  },
  {
    "text": "Democrats escalate pre-debate Biden avoidance strategy … - “I don't ever want to see him here,” the lawmaker said of Biden, adding that “every single donor — and I'm only calling major donors — is furious and wants him to step aside.”  — A senior House Democrat … ",
    "url": "https://www.axios.com/2024/06/30/biden-debate-house-democrats-campaign"
  },
  {
    "text": "Increasing numbers of voters don't think Biden should be running after debate with Trump — CBS News poll  —  For months before the first debate, the nation's voters repeatedly expressed doubts over whether President Biden had the cognitive health enough to serve.",
    "url": "https://www.cbsnews.com/news/poll-debate-should-biden-be-running-mental-abilities/"
  },
  {
    "text": "Majority of voters think Biden is cognitively unfit to serve as president: poll  —  Poll finds 72% of registered voters doubt Biden's cognitive abilities  —  A poll released by CBS News on Sunday found that more voters have doubts about President Biden's cognitive abilities after Thursday's presidential debate.",
    "url": "https://www.foxnews.com/politics/majority-voters-think-biden-cognitively-unfit-serve-president-poll"
  },
  {
    "text": "Historian who predicted 9 of the last 10 election results says Democrats shouldn't drop Joe Biden  —  WASHINGTON - Allan Lichtman, the historian who has correctly forecast the results of nine out of the 10 most recent presidential elections argued on Saturday that replacing President Joe Biden could cost Democrats the 2024 election.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/30/lichtman-dems-replace-biden/74260967007/"
  },
  {
    "text": "Biden and Harris's Absurd Case for Complacency … After absorbing the initial waves of shock from Thursday night's debate debacle, allies of Joe Biden and Kamala Harris have begun whispering to the media their reasons why the Democratic ticket must consist of Joe Biden and Kamala Harris.",
    "url": "https://nymag.com/intelligencer/article/biden-and-harris-absurd-case-for-post-debate-complacency.html"
  },
  {
    "text": "France's far right makes big gains in first round of parliamentary election  —  Summary  — France's far right National Rally (RN) has made big gains in the first round of the parliamentary election, exit polls suggest  — Celebrating her party's early success, Marine Le Pen says … ",
    "url": "https://www.bbc.com/news/live/cn087x77g1dt"
  },
  {
    "text": "Le Pen's far right set for big win in first round of French election  —  Early projections show National Rally on course for victory in the vote for a new parliament as Emmanuel Macron's election gamble backfires.  —  PARIS  —  France is facing what until recently was an unthinkable nightmare for Europe … ",
    "url": "https://www.politico.eu/article/france-legislative-election-results-first-round-marine-le-pen-pollsters-national-rally/"
  },
  {
    "text": "Top aides shielded Biden from staff, but couldn't hide the debate … - “It's time for Joe to go.” … - “I know many of these people and how the White House operates. … - Reached by phone, West said he wrote the post because “the debate was not the first bad day, and it's not gonna be the last.”",
    "url": "https://www.axios.com/2024/06/30/top-aides-shielded-biden-white-house-debate"
  },
  {
    "text": "Ron DeSantis strips more than $32m in Florida arts funding  —  Political allies are also surprised at move, which cancels nearly entirety of state's funding and will affect economy  —  Ron DeSantis stripped more than $32m in arts and culture funding from Florida's state budget over his hatred … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/30/ron-desantis-florida-art-funding-cut"
  },
  {
    "text": "US to criminally charge Boeing, seek guilty plea, sources say  —  The U.S. Justice Department will criminally charge Boeing (BA.N) with fraud over two fatal crashes and ask the planemaker to plead guilty or face a trial, two people familiar with the matter said on Sunday.",
    "url": "https://www.reuters.com/legal/us-pushes-boeing-plead-guilty-connection-with-fatal-crashes-sources-say-2024-06-30/"
  },
  {
    "text": "US military bases in Europe raise security threat levels  —  STUTTGART, Germany — U.S. military bases in Europe were put on a heightened state of alert over the weekend as installations urged vigilance among their members.  —  At U.S. European Command headquarters in Stuttgart … ",
    "url": "https://www.stripes.com/theaters/europe/2024-06-30/us-military-bases-germany-terrorism-threat-14342506.html"
  },
  {
    "text": "Trump loyalists plan to name and shame ‘blacklist’ of federal workers  —  AAF to publish dossiers of employees they consider hostile to ex-president, with goal of ultimately replacing them  —  Armed with rhetoric about the “deep state”, a conservative-backed group is planning to publicly name … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/30/trump-loyalists-deep-state-blacklist-american-accountability-foundation"
  }
]