[
  {
    "text": "Behind the Curtain: Unbendable Biden vs. breaking-point Dems … Both plan fierce public and private campaigns to see who buckles.  — It won't be him, Biden says publicly and privately. … These Democrats, further deflated by Biden's high-stakes ABC interview, believe there's nothing … ",
    "url": "https://www.axios.com/2024/07/07/biden-democrats-drop-election-campaign"
  },
  {
    "text": "Election 2024 latest news Bidens hit campaign trail; Trump nears VP pick  —  President Biden's campaign is planning two events in Pennsylvania on Sunday as he and his staff remain defiant against calls to drop his reelection bid after a damaging debate performance.",
    "url": "https://www.washingtonpost.com/politics/2024/07/07/election-2024-biden-campaign-updates-trump/"
  },
  {
    "text": "Biden thought he had it under control.  Then it got worse.  —  The inside story of the Biden team's failure over nine days to contain the crisis from his debate with Trump.  —  President Biden's top aides awoke after debate night with a plan to contain the damage: A raucous North Carolina crowd … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/06/biden-debate-white-house-campaign/"
  },
  {
    "text": "Biden's team drafted the questions for his first post-debate interviews … - WURD is the only African-American owned and operated talk radio station in Pennsylvania, but the White House's director of Black media was not part of the process.  — It is the latest instance of the White House continuing … ",
    "url": "https://www.axios.com/2024/07/06/biden-interview-draft-questions-wurd"
  },
  {
    "text": "Hawaii governor says Biden could decide within days whether to remain in the presidential race  —  U.S. President Joe Biden could make a decision within days whether to remain a candidate for reelection, said Hawaii's governor who participated in a recent meeting with Biden and other Democratic governors … ",
    "url": "https://apnews.com/article/biden-hawaii-governor-election-decision-6da41f7987622fd838858a6535e9ad34"
  },
  {
    "text": "At Essence, Black Democrats rally behind Biden and talk up Kamala Harris, but she avoids the drama  —  NEW ORLEANS (AP) — As President Joe Biden tries to revive his embattled reelection bid, Vice President Kamala Harris led a parade of Black Democrats who warned Saturday that the threat … ",
    "url": "https://apnews.com/article/joe-biden-drop-out-kamala-harris-replacement-2ab8780866fb2c8a0fe6e1e28a7e6de2"
  },
  {
    "text": "The lingering focus on Biden's shaky debate obscures Trump's major verbal miscues  —  President Joe Biden dug himself a hole and now he is trying to climb out.  But many fellow Democrats and some in the media keep shoveling dirt on him.One 20-minute TV interview was never going to swing … ",
    "url": "https://www.inquirer.com/opinion/editorials/trump-verbal-miscues-presidential-debate-20240706.html"
  },
  {
    "text": "Secret Meetings, Private Threats and a Massive Arms Race: How the World is Preparing for Trump  —  In 2016, no one in the world was ready for President Trump.  America's NATO allies aren't making the same mistake this time.  —  In Brussels, NATO officials have devised a plan to lock … ",
    "url": "https://www.politico.com/news/2024/07/07/nato-prepare-trump-2024-00165522"
  },
  {
    "text": "McCarthy's Revenge Tour Rolls On, With Mixed Results … Kevin McCarthy, the former House speaker, held his leadership role for 269 days.T.J. Kirkpatrick for The New York Times  —  During the awkward interlude after he was ousted from the speakership but before he resigned from Congress … ",
    "url": "https://www.nytimes.com/2024/07/07/us/politics/kevin-mccarthy-revenge-tour.html"
  },
  {
    "text": "Mike Lee spreads fake claim of Biden medical emergency on Air Force One  —  Utah Senator then attacked media for being untrustworthy, during frenzied posting on social media  —  On Friday evening, Utah Sen. Mike Lee used his personal X/Twitter account to amplify a baseless claim … ",
    "url": "https://www.sltrib.com/news/politics/2024/07/06/mike-lee-spreads-fake-claim-biden/"
  },
  {
    "text": "Trump's hush-money sentencing will still happen in September despite his new immunity superpowers, New York legal experts predict  — Trump wants his hush-money verdict nixed in the wake of the Supreme Court immunity opinion.  — But Trump's new immunity superpowers won't derail his September sentencing, experts predict.",
    "url": "https://www.businessinsider.com/trump-cant-outrun-his-ny-sentencing-despite-new-immunity-superpowers-2024-7"
  },
  {
    "text": "Rep. Adam Schiff says Biden needs to ‘win overwhelmingly’ or ‘pass the torch’: Full interview  —  Democratic Rep. Adam Schiff (Calif.) exclusively joins Meet the Press to talk about the state of President Joe Biden's re-election campaign.",
    "url": "https://www.nbcnews.com/meet-the-press/video/biden-needs-to-win-overwhelmingly-or-pass-the-torch-rep-adam-schiff-says-full-interview-214352965535"
  },
  {
    "text": "Wildlife Protections Take a Back Seat to SpaceX's Ambitions … Starship, the upper stage of SpaceX's new rocket, at its launchpad in Boca Chica, Texas.  Conservationists are concerned with the environmental impact space operations have on the area.  —  As Elon Musk's Starship … ",
    "url": "https://www.nytimes.com/2024/07/07/us/politics/spacex-wildlife-texas.html"
  },
  {
    "text": "Former Trump Advisor Stephen Miller Denies Involvement With Project 2025, Ad Says Otherwise  —  WE GOT THE RECEIPTS  —  Former Trump advisor Stephen Miller claimed he has “never been involved with Project 2025” in a post on X on Saturday, however, a video on the Project 2025 YouTube channel says otherwise.",
    "url": "https://www.thedailybeast.com/former-trump-advisor-stephen-miller-squirms-to-deny-involvement-with-project-2025-ad-says-otherwise"
  },
  {
    "text": "Trump wins delay in classified documents case … - It's an opinion that Trump has used to throw a wrench in prosecutors' plans although the SCOTUS decision on July 1 failed to clarify whether his alleged conduct on Jan. 6 was protected. … - Trump's attorneys have also used presidential immunity … ",
    "url": "https://www.axios.com/2024/07/06/donald-trump-classified-documents-delay"
  }
]