[
  {
    "text": "Live Updates: Trump Trial Poised to Begin, a Criminal Case Without Precedent  —  Jury selection is set to start as Donald J. Trump faces charges he faked business records to cover up a sex scandal before winning the presidency.  The judge declined Mr. Trump's request to recuse himself.",
    "url": "https://www.nytimes.com/live/2024/04/15/nyregion/trump-hush-money-trial"
  },
  {
    "text": "A Weary Trump Appears to Doze Off in Courtroom Ahead of Criminal Trial  —  The former president flashed signs of irritation at times, but also seemed to fall asleep, before jolting back awake.  —  Former President Donald J. Trump seemed alternately irritated and exhausted Monday morning … ",
    "url": "https://www.nytimes.com/2024/04/15/nyregion/trump-asleep-criminal-trial.html"
  },
  {
    "text": "I Was a Skeptic of the Stormy Daniels Prosecution.  I Was Wrong.  —  The prosecution of Donald Trump starting in New York this week is on firm legal ground.  —  When Manhattan District Attorney Alvin Bragg brought criminal charges against Donald Trump in 2023, I was highly skeptical of his decision.",
    "url": "https://slate.com/news-and-politics/2024/04/stormy-daniels-prosecution-stronger-than-i-thought.html"
  },
  {
    "text": "How to pick a jury that can judge Donald Trump  —  Tailoring questions to probe prospective jurors' political biases and opinions of the former president is more art than science.  —  Former President Donald Trump's criminal trial in New York begins Monday with an immediate and fundamental challenge … ",
    "url": "https://www.politico.com/news/2024/04/14/jury-selection-donald-trump-00151962"
  },
  {
    "text": "Trump rages at judge hours before hush money case begins  —  Former President Trump railed against the judge in his criminal hush money case early Monday, just hours before the first criminal trial against a former president is set to begin.  —  Recalling complaints he has made for months … ",
    "url": "https://thehill.com/regulation/court-battles/4594517-trump-posts-hush-money-trial-judge/"
  },
  {
    "text": "It's Time to Play to Win  —  BUCKLE UP—Donald Trump's first criminal trial starts today.  The jury—when they manage to seat one—will consider whether Trump falsified business records to cover up hush-money payments to porn star Stormy Daniels, with whom he allegedly had an affair shortly … ",
    "url": "https://www.thebulwark.com/p/its-time-to-play-to-win"
  },
  {
    "text": "Justice Clarence Thomas misses Supreme Court arguments  —  The conservative justice was not present for oral arguments on Monday, but the court did not provide a reason why.  —  WASHINGTON — Conservative Supreme Court Justice Clarence Thomas was not present at the court for oral arguments on Monday … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/justice-clarence-thomas-misses-supreme-court-arguments-rcna147826"
  },
  {
    "text": "Justice Thomas misses Supreme Court session Monday with no explanation  —  Supreme Court Justice Clarence Thomas was absent from the court Monday with no explanation.  Thomas, 75, also was not participating remotely in arguments, as justices sometimes do when they are ill or otherwise can't be there in person.",
    "url": "https://thehill.com/homenews/ap/ap-politics/ap-justice-thomas-misses-supreme-court-session-monday-with-no-explanation/"
  },
  {
    "text": "The Supreme Court effectively abolishes the right to mass protest in three US states  —  It is no longer safe to organize a protest in Louisiana, Mississippi, or Texas.  —  The Supreme Court announced on Monday that it will not hear Mckesson v. Doe.  The decision not to hear Mckesson leaves … ",
    "url": "https://www.vox.com/scotus/24080080/supreme-court-mckesson-doe-first-amendment-protest-black-lives-matter"
  },
  {
    "text": "Trump Media shares plunge more than 15% after company files to issue additional DJT stock … This photo illustration shows an image of former President Donald Trump reflected in a phone screen that is displaying the Truth Social app, in Washington, DC, on February 21, 2022.",
    "url": "https://www.cnbc.com/2024/04/15/trump-media-shares-plunge-after-company-files-to-issue-additional-djt-stock.html"
  },
  {
    "text": "Biden counsels Netanyahu to ‘slow things down’ after Iranian attack  —  Administration officials said the U.S. would not join any response to Tehran's assault, and suggested Israel ‘take the win’ and avoid escalation  —  The Biden administration on Sunday congratulated Israel … ",
    "url": "https://www.washingtonpost.com/national-security/2024/04/14/biden-netanyahu-israel-iran/"
  },
  {
    "text": "Federal criminal investigation opened into Key Bridge crash  —  The FBI has opened a criminal investigation focusing on the massive container ship that brought down the Francis Scott Key Bridge in Baltimore last month — a probe that will look at least in part at whether the crew left … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/04/15/balitmore-key-bridge-criminal-investigation/"
  },
  {
    "text": "Tesla lays off more than 10% of staff globally as sales fall  —  Tesla (TSLA.O) told staff it is laying off more than 10% of its global workforce, an internal memo seen by Reuters on Monday shows, as it grapples with falling sales and an intensifying price war for electric vehicles (EVs).",
    "url": "https://www.reuters.com/business/autos-transportation/tesla-lay-off-more-than-10-its-staff-electrek-reports-2024-04-15/"
  },
  {
    "text": "Nikki Haley Joins Hudson  —  WASHINGTON—Hudson Institute today announced that Nikki Haley, the former governor of South Carolina and US ambassador to the United Nations, will be the next Walter P. Stern Chair.  —  “When our policymakers fail to call out our enemies or acknowledge the importance … ",
    "url": "https://www.hudson.org/nikki-haley-joins-hudson"
  },
  {
    "text": "Supreme Court snubs House Republicans who dodged metal detectors in Congress after Jan. 6  —  What happens in Congress stays in Congress, the Supreme Court signaled on Monday, as it turned away an appeal by three Republican congressmen who were fined $5,000 each by the House … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/04/15/supreme-court-republicans-house-security-jan-6/73281636007/"
  },
  {
    "text": "Trump's right to fear Stormy Daniels — she could be a devastating witness  —  Women have consistently offered the most compelling testimony against Trump — now it's Stormy's turn  —  As a lifelong lover of the English language, I'm being slowly driven mad by one word that haunts the news coverage these days: “affair.”",
    "url": "https://www.salon.com/2024/04/15/right-to-fear-stormy-daniels--she-could-be-a-devastating-witness/"
  },
  {
    "text": "Transgender Veterans Sue V.A. Over Gender-Affirming Surgeries  —  An advocacy group for transgender veterans has filed a lawsuit over the failure of the Department of Veterans Affairs to provide or pay for gender-affirming surgeries.  —  The federal lawsuit, filed on Monday … ",
    "url": "https://www.nytimes.com/2024/04/15/us/politics/veterans-transgender-lawsuit.html"
  },
  {
    "text": "Trump trade advisers plot dollar devaluation  —  Advisers close to the former president — particularly his former trade chief Robert Lighthizer — are considering policies that would weaken the dollar relative to other currencies, which could juice U.S. exports but also fuel inflation.",
    "url": "https://www.politico.com/news/2024/04/15/devaluing-dollar-trump-trade-war-00152009"
  }
]