[
  {
    "text": "A Fiery Biden, Ignoring Critics, Attacks Trump to Chants of ‘Lock Him Up’  —  Facing rising frustration in his party, the president brushed it off in an energetic speech in Michigan.  Inside the room, at least, the Democratic mood was defiant, with cheers of “Don't go, Joe.”",
    "url": "https://www.nytimes.com/2024/07/12/us/politics/biden-speech-detroit.html"
  },
  {
    "text": "Inside Biden's sputtering campaign to restore Dems' confidence  —  Senate Democrats are sitting on their hands as the Biden campaign sputters.  —  Three of Joe Biden's senior aides entered a Senate Democratic lunch on Thursday armed with internal and external polls showing … ",
    "url": "https://www.politico.com/news/2024/07/13/democrats-biden-concerns-00167915"
  },
  {
    "text": "Live Election Updates: Trump Returns to Pennsylvania as Biden Looks to Steady His Campaign  —  Vice President Kamala Harris and Jill Biden will also hold events in the key battleground state following the president's fiery speech in Detroit on Friday.  —  Trump will rally in Pennsylvania, as Biden allies hit the trail, too.",
    "url": "https://www.nytimes.com/live/2024/07/13/us/biden-trump-election"
  },
  {
    "text": "Musk Donates to Trump, Tapping Fortune to Swing 2024 Race  — Tech mogul contributed to group backing Trump in swing states  — Move demonstrates Musk's growing influence in Washington  —  Billionaire Elon Musk has donated to a super political action committee working to elect Donald Trump … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-12/elon-musk-donates-to-trump-tapping-vast-fortune-to-swing-2024-race"
  },
  {
    "text": "Election 2024 live updates Harris, Trump to hold rallies as GOP awaits VP pick  —  Vice President Harris is scheduled to hold a campaign in Philadelphia this afternoon, as several Democrats and donors have been encouraging President Biden to step aside in his reelection bid.",
    "url": "https://www.washingtonpost.com/politics/2024/07/13/2024-election-campaign-updates-biden-trump-rally/"
  },
  {
    "text": "Biden blasts Project 2025 in Michigan and ties it to Trump in effort to regain footing  —  A more energetic Biden leaned into a line of attack that unifies Democrats and could appeal beyond his base as he seeks to move past the party infighting over his candidacy.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-blasts-project-2025-michigan-ties-trump-effort-regain-footing-rcna161640"
  },
  {
    "text": "What Is Project 2025?  Inside the Far-Right Plan Threatening Everything from the Word ‘Gender’ to Public Education  —  Trump's allies started Project 2025 as a blueprint for marrying church and state at the highest levels of government if he's elected  —  A sweeping proposal for how Donald Trump … ",
    "url": "https://people.com/what-is-project-2025-inside-far-right-plan-trump-presidency-8622964"
  },
  {
    "text": "A Second Term for Trump Could Go 4 Different Ways  —  Donald Trump will arrive at the 2024 Republican convention — his Republican convention, finally and completely, without the dissent of 2016 or the pandemic that overshadowed 2020 — closer than ever to a second term.",
    "url": "https://www.nytimes.com/2024/07/13/opinion/trump-2024-second-term.html"
  },
  {
    "text": "Inside Ziklag, the Secret Organization of Wealthy Christians Trying to Sway the Election and Change the Country  —  Co-published with Documented  —  A network of ultrawealthy Christian donors is spending nearly $12 million to mobilize Republican-leaning voters and purge more than a million people … ",
    "url": "https://www.propublica.org/article/inside-ziklag-secret-christian-charity-2024-election"
  },
  {
    "text": "Trump heads to Pennsylvania for pre-convention rally as VP announcement looms  —  Donald Trump will have one last chance Saturday to unveil his vice presidential pick on a rally stage before the Republican National Convention kicks off in Milwaukee next week.",
    "url": "https://apnews.com/article/trump-vp-vance-rubio-7c7ba6b99b5f38d2d840ed95b2fdc3e5"
  },
  {
    "text": "Dr. Ruth Westheimer, America's diminutive and pioneering sex therapist, dies at 96  —  Dr. Ruth Westheimer, the diminutive sex therapist who became a pop icon, media star and best-selling author through her frank talk about once-taboo bedroom topics, has died.  She was 96.",
    "url": "https://apnews.com/article/ruth-westheimer-dies-6d4af57b5f034bf9a90977de41b88735"
  },
  {
    "text": "Israeli strike on Gaza targets, likely kills, Hamas leader Mohammad Deif  —  The IDF said that dozens of those killed in the strike on Deif were active Hamas terrorists.  —  Mohammad Deif, the leader of the Izzadin al-Qassam Brigades, Hamas's military wing, was targeted in an airstrike … ",
    "url": "https://www.jpost.com/breaking-news/article-810137"
  },
  {
    "text": "Trump skeptics planning to skip the GOP convention … - Sens. Lisa Murkowski (Alaska), Susan Collins (Maine), Todd Young (Indiana), Mitt Romney (Utah) and Rand Paul (Kentucky) are all skipping the party's convention, according to the senators or their offices. … - “I always go to my state convention.",
    "url": "https://www.axios.com/2024/07/13/trump-skeptics-senate-republican-skip-republican-national-convention"
  },
  {
    "text": "The unusual legal risk Trump will have to navigate at the RNC  —  There's a high likelihood that others involved in Trump's alleged crimes could be in Milwaukee.  —  Donald Trump will be rubbing elbows in Milwaukee with a crowd that may include dozens of witnesses and alleged co-conspirators … ",
    "url": "https://www.politico.com/news/2024/07/13/trump-rnc-legal-risks-00167950"
  },
  {
    "text": "Peter Navarro, Trump ex-aide jailed for contempt of Congress, will address RNC, AP sources say  —  Former White House trade advisor Peter Navarro, who is currently in jail on contempt of Congress charges, is expected to speak at next week's Republican National Convention just hours after his release.",
    "url": "https://apnews.com/article/peter-navarro-trump-rnc-3d7bc64a3a578f09d36ea6b6d4ce04c5"
  },
  {
    "text": "Judge throws out Rudy Giuliani's bankruptcy case, says he flouted process with lack of transparency  —  NEW YORK (AP) — A judge threw out Rudy Giuliani 's bankruptcy case on Friday, finding that the former New York City mayor had flouted process with a lack of transparency.",
    "url": "https://apnews.com/article/giuliani-bankruptcy-freeman-moss-2020-election-3cf8d70d1dc2608705c9f938bbb8941d"
  },
  {
    "text": "Exclusive: Meta removes Trump account restrictions ahead of 2024 election … - While those penalties were designed to limit any public figure's accounts during civil unrest, Donald Trump's accounts were the only ones that have so far been subject to those restrictions, a spokesperson confirmed.",
    "url": "https://www.axios.com/2024/07/12/trump-meta-facebook-instagram-account-restrictions-election"
  }
]