[
  {
    "text": "3 takeaways from the South Carolina GOP primary  —  Donald Trump has swept the traditional early states in the Republican presidential nominating contest after defeating Nikki Haley on Saturday in South Carolina.  —  News organizations called the race shortly after polls closed … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/24/south-carolina-gop-primary-trump-haley/"
  },
  {
    "text": "Prominent Republican Seeks to Shield the Party From Paying Trump's Legal Bills  —  Henry Barbour, a veteran R.N.C. member, is mounting a long-shot bid to keep the former president from taking control of the committee in order to block it from paying for his lawsuits.",
    "url": "https://www.nytimes.com/2024/02/24/us/politics/trump-barbour-rnc.html"
  },
  {
    "text": "‘SNL’ Shames Terrified Republicans for Surrendering to Trump  —  The latest “SNL” cold open featured Jim Risch, Marco Rubio, Lindsey Graham, and Tim Scott saying out loud what everyone is already thinking.  —  Saturday Night Live put up its best cold open in quite a while this week … ",
    "url": "https://www.thedailybeast.com/snl-shames-terrified-republicans-for-surrendering-to-trump"
  },
  {
    "text": "Trump and his allies scramble to close fundraising gap with Biden  —  Concerns have also grown among top Republicans and other allies that Trump is spending too much political money on his legal bills  —  Donald Trump and the Republican Party find themselves facing an early cash gap heading … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/23/trump-cash-campaign-biden/"
  },
  {
    "text": "Draft RNC resolution would block payment of candidate's legal bills  —  Two draft resolutions circulated by a member of the Republican National Committee call on the party to adopt proposals that would keep it from having to pay for any presidential candidate's legal fees and would also make it party policy … ",
    "url": "https://www.cbsnews.com/news/draft-rnc-resolution-would-block-paying-candidates-legal-bills/"
  },
  {
    "text": "Trump says South Carolina is a ‘bigger win than we anticipated,’ looks forward to saying 'Joe, you're fired'  —  Trump won the South Carolina GOP Primary Saturday night shortly after polls closed  —  Former President Trump touted a “bigger win than we anticipated” in the South Carolina … ",
    "url": "https://www.foxnews.com/politics/trump-says-south-carolina-bigger-win-than-we-anticipated-looks-forward-saying-joe-youre-fired"
  },
  {
    "text": "Fewer grievances, more policy: Trump aides and allies push for a post-South Carolina ‘pivot’  —  In his victory speech Saturday night, Trump notably did not mention Nikki Haley, instead talking about GOP unity and focusing on the general election.  —  COLUMBIA, S.C. — A growing chorus … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-push-south-carolina-pivot-fewer-grievances-rcna140239"
  },
  {
    "text": "Nazis mingle openly at CPAC, spreading antisemitic conspiracy theories and finding allies  —  The presence of the individuals has been a persistent issue at CPAC, and in previous years, conference organizers have ejected well known nazis and white supremacists, such as Nick Fuentes.",
    "url": "https://www.nbcnews.com/news/us-news/nazis-mingle-openly-cpac-spreading-antisemitic-conspiracy-theories-fin-rcna140335"
  },
  {
    "text": "Warren Buffett's son Howard has given $500M to Ukraine — he warns the US is making a historic mistake by pulling its support  — Business Insider interviewed Warren Buffett's son about his  support for Ukraine.  — Howard Buffett's foundation has given $520 million to Ukraine in humanitarian aid.",
    "url": "https://www.businessinsider.com/howard-buffett-gives-500-million-to-ukraine"
  },
  {
    "text": "Joe Biden gives the media a desperately needed lesson about Donald Trump  —  The president has to break the news to journalists that Trump plans to jail us  —  The most disturbing thing I've ever heard a president say did not come from Donald Trump.  —  It came from Joe Biden.",
    "url": "https://www.salon.com/2024/02/24/joe-biden-gives-the-media-a-desperately-needed-lesson-about-donald/"
  },
  {
    "text": "Gov. Gavin Newsom's super PAC launches TV ad targeting GOP on abortion  —  Campaign for Democracy will run TV ads in Tennessee targeting two state bills that would restrict minors traveling out of state for abortion care.  —  California Democratic Gov. Gavin Newsom's super PAC is launching … ",
    "url": "https://www.nbcnews.com/politics/gov-gavin-newsoms-super-pac-launches-tv-ad-targeting-gop-abortion-rcna140342"
  },
  {
    "text": "How ‘Libs of TikTok’ became a powerful presence in Oklahoma schools  —  The owner of the far-right social media account, who sits on a state advisory panel, has drawn attention since the death of a nonbinary student near Tulsa  —  LOS ANGELES — Far-right activist Chaya Raichik splits … ",
    "url": "https://www.washingtonpost.com/technology/2024/02/24/libs-tiktok-oklahoma-nonbinary-teen-death/"
  },
  {
    "text": "Climate change is throwing the water cycle into chaos across the U.S.  —  As the planet continues to warm, this cycle is expected to be increasingly stretched, warped and broken.  —  The water cycle that shuttles Earth's most vital resource around in an unending, life-giving loop is in trouble.",
    "url": "https://www.nbcnews.com/science/science-news/climate-change-throwing-water-cycle-chaos-us-rcna137892"
  },
  {
    "text": "‘Trump appears to be showing gross signs of dementia’: Expert points to new evidence  —  According to psychologist Dr. John Gartner, formerly of Johns Hopkins University Medical School, Donald Trump's slurring and inability to sometimes formulate complete sentences appears to be a sign … ",
    "url": "https://www.rawstory.com/donald-trump-dementia/"
  },
  {
    "text": "Black leaders, DNC blast Trump for ‘racist’ comments  —  Black leaders are condemning former President Trump's recent comments about Black voters as “racist.”  —  Speaking at the Black Conservative Federation (BCF) annual gala in South Carolina on Friday, Trump said his legal woes have earned … ",
    "url": "https://thehill.com/homenews/race-politics/4486998-black-leaders-dnc-blast-trump-for-racist-comments/"
  }
]