[
  {
    "text": "Trump announces 100% tariffs on movies ‘produced in foreign lands’  —  President calls films ‘national security threat’ and claims he called on commerce department to immediately enact tariff  —  Donald Trump on Sunday announced on his Truth Social platform a 100% tariff on all movies … ",
    "url": "https://www.theguardian.com/us-news/2025/may/04/trump-tariffs-foreign-movies"
  },
  {
    "text": "Trump Calls for 100% Tariff on Movies Made Overseas  —  The president called the use of incentives by foreign countries to draw filmmakers and studios away from the U.S. a national-security threat  —  President Trump has found the next industry he wants to bring back to the U.S. with tariffs: Hollywood.",
    "url": "https://www.wsj.com/business/media/trump-authorizes-100-tariff-on-movies-made-overseas-757e3a10?st=Nbuhaa&reflink=article_copyURL_share"
  },
  {
    "text": "Trump says Hollywood ‘dying’; orders 100% tariff on non-US movies to save it  —  U.S. President Donald Trump on Sunday announced a 100% tariff on movies produced outside the country, saying the U.S. movie industry was dying a “very fast death” due to the incentives that other countries were offering to draw American filmmakers.",
    "url": "https://www.reuters.com/business/media-telecom/trump-announces-100-tariff-movies-produced-outside-us-2025-05-04/"
  },
  {
    "text": "Trump announces 100% tariff on all foreign-produced movies: ‘WE WANT MOVIES MADE IN AMERICA, AGAIN!’  —  Trump said that Hollywood ‘is DYING a very fast death’  —  President Donald Trump decried the state of the motion picture industry in a social media post on Sunday while announcing plans to implement a Hollywood-related tariff.",
    "url": "https://www.foxnews.com/politics/trump-announces-100-tariff-all-foreign-produced-movies-we-want-movies-made-america-again"
  },
  {
    "text": "The Signal Clone the Trump Admin Uses Was Hacked  —  A hacker has breached and stolen customer data from TeleMessage, an obscure Israeli company that sells modified versions of Signal and other messaging apps to the U.S. government to archive messages, 404 Media has learned.",
    "url": "https://www.404media.co/the-signal-clone-the-trump-admin-uses-was-hacked/"
  },
  {
    "text": "Trump says he will reopen Alcatraz prison  —  President Donald Trump says he is directing his government to reopen and expand Alcatraz, the notorious former prison on a California island.  In a message on his Truth Social site Sunday evening, Trump wrote that, “For too long … ",
    "url": "https://apnews.com/article/trump-alcatraz-prison-fabe3385415ae03829d44e50efb3c1fb"
  },
  {
    "text": "Trump on using military force says “I don't see it with Canada,” but “something could happen with Greenland.”  —  President Trump said he would talk to Canadian Prime Minister Mark Carney about making Canada the 51st state.  But the president said he didn't expect it to get to the point … ",
    "url": "https://www.cbsnews.com/news/trump-greenland-military-force-canada/"
  },
  {
    "text": "A New Trend in Global Elections: The Anti-Trump Bump  —  In voting in Canada and Australia, right-wing parties that borrowed from the MAGA playbook were punished.  Elsewhere, President Trump is having a more complex impact.  —  The Trump factor is shaping global politics, one election at a time … ",
    "url": "https://www.nytimes.com/2025/05/04/world/canada/global-elections-trump.html"
  },
  {
    "text": "Scoop: Trump plans to announce D.C. will host 2027 NFL Draft  —  President Trump plans to announce Monday that Washington, D.C., will host the 2027 NFL Draft, with the aim of holding it on the National Mall, Axios has learned.  — The announcement is expected to be made with NFL Commissioner Roger Goodell … ",
    "url": "https://www.axios.com/2025/05/05/nfl-draft-2027-washington-dc-trump"
  },
  {
    "text": "Pence says January 6 attack's failure ‘became a triumph of freedom’ as he receives JFK Profile in Courage Award  —  Former Vice President Mike Pence said Sunday while receiving the John F. Kennedy Profile in Courage Award that January 6, 2021, “became a triumph of freedom” … ",
    "url": "https://cnn.com/2025/05/04/politics/mike-pence-jfk-award-january-6"
  },
  {
    "text": "Democrats Denounce Rubio Holding Four Roles in Trump Administration  —  “There's no way he can carry all that entire load on his own,” Sen. Tammy Duckworth said of Rubio occupying multiple jobs in the executive branch  —  Secretary of state, acting administrator for USAID, acting lead archivist, acting national security adviser.",
    "url": "https://www.rollingstone.com/politics/politics-news/democrats-rubio-four-roles-trump-administration-1235331112/"
  },
  {
    "text": "Trump Says He Asked Mexico to Let U.S. Military In to Fight Cartels  —  President Trump confirmed on Sunday that he had raised the idea with his Mexican counterpart, Claudia Sheinbaum, who rejected it.  —  President Trump confirmed on Sunday that he had pressed Mexico's president … ",
    "url": "https://www.nytimes.com/2025/05/04/us/politics/trump-mexico-sheinbaum-cartels.html"
  },
  {
    "text": "Rosie O'Donnell suggests Trump is in ‘cognitive decline’  —  Comedian Rosie O'Donnell continued her yearslong feud with President Donald Trump over the weekend, suggesting that Trump is in “cognitive decline.”  —  The former co-host of The View recently left the United States for Ireland … ",
    "url": "https://www.washingtonexaminer.com/news/entertainment/3400540/rosie-odonnell-trump-cognitive-decline/"
  },
  {
    "text": "European Parliament cracks down on lobbyists in effort to stop corruption  —  BRUSSELS ― The European Parliament has toughened its rules on lobbying more than two years after a cash-for-influence scandal that triggered one of the largest corruption investigations to hit the EU.",
    "url": "https://www.politico.eu/article/european-parliament-crack-down-lobbyist-stop-corruption/"
  },
  {
    "text": "Adani Camp Meets Trump Officials in Push to End US Bribery Cases  —  Representatives for Indian billionaire Gautam Adani and his companies met Trump administration officials about dismissing the criminal charges levied against him in an overseas bribery probe, according to people familiar with the matter.",
    "url": "https://www.bloomberg.com/news/articles/2025-05-05/adani-camp-meets-trump-officials-in-push-to-end-us-bribery-cases"
  },
  {
    "text": "These Thinkers Set the Stage for Trump the All-Powerful  —  With a blitz of moves in his 100 days in office, President Trump has sought to greatly enlarge executive power.  The typical explanation is that he's following and expanding a legal idea devised by conservatives during the Reagan administration, the unitary executive theory.",
    "url": "https://www.nytimes.com/2025/05/04/opinion/trump-schmitt-strauss-intellectuals.html?unlocked_article_code=1.Ek8.hhQi.Za3SoEmn5ezY&smid=url-share"
  },
  {
    "text": "Air Traffic Controller Warns Major Airport Unsafe for Travel: ‘Avoid Newark at All Costs’  —  TURBULENCE AHEAD  —  Transportation Secretary Sean Duffy pleaded this week for more people to become air traffic controllers.  —  An air traffic controller warned Friday that Newark Liberty International Airport … ",
    "url": "https://www.thedailybeast.com/air-traffic-controller-warns-major-airport-unsafe-for-travel-avoid-newark-at-all-costs/"
  },
  {
    "text": "Elon Musk: It Is ‘Outrageous’ to 'Claim That I'm a Nazi'  —  The head of Trump's so-called DOGE told Fox News people would kill him if they could … He also said that if his detractors could “press a button” and kill him, they would, but he is “difficult to kill.”",
    "url": "https://www.rollingstone.com/politics/politics-news/elon-musk-nazi-claims-fox-news-1235330984/"
  }
]