[
  {
    "text": "Playbook: What Trump wants from Capitol Hill  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE $46 BILLION MAN — “Elon Musk Says Vote on His Pay Winning by ‘Wide Margins,’” by WSJ's Christina Rogers and David Benoit",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/13/what-trump-wants-from-capitol-hill-00163125"
  },
  {
    "text": "'He's earned the nomination': McConnell stands by Trump endorsement as Hill visit looms  —  Mitch McConnell stood by his endorsement of former President Donald Trump on Wednesday, shrugging off any bad blood that still lingers over their icy relationship as Trump gets ready to meet with GOP lawmakers.",
    "url": "https://www.politico.com/live-updates/2024/06/12/congress/mcconnells-trump-endorsement-stands-00162995"
  },
  {
    "text": "“It appears to be a payoff”: Expert says Kushner's Saudi cash an “egregious” national security worry  —  Senate Finance Committee Chairman Ron Wyden is investigating Saudi support for Jared Kushner's private equity firm  —  Based on his prior experience and demonstrated abilities … ",
    "url": "https://www.salon.com/2024/06/12/it-appears-to-be-a-payoff-expert-says-kushners-saudi-cash-an-egregious-national-security-worry/"
  },
  {
    "text": "Public Notice's Sinclair report makes national headlines  —  From Morning Joe to the HuffPost, it's been a big week for the newsletter.  —  As part of a collaboration with Judd Legum of Popular Information, earlier this week I published a report on Sinclair's right-wing media empire … ",
    "url": "https://www.publicnotice.co/p/aaron-rupar-public-notice-sinclair-judd-legum"
  },
  {
    "text": "Here's what the Christian right wants from a second Trump term  —  Religious conservatives see opportunities for fresh gains after a series of victories during Trump's first term.  Rights advocates see a dangerous blurring of church and state.  —  Donald Trump's presidency delivered … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/13/trump-christian-right-abortion-prayer/"
  },
  {
    "text": "Trump Rants About Sharks, and Everyone Just Pretends It's Normal  —  Hours before meeting with his probation officer about his recent felony convictions, a leading candidate for U.S. president went on a bizarre rant about sharks.  —  Sharks, Donald Trump claimed, were attacking more frequently than usual … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/trump-shark-rant/678666/"
  },
  {
    "text": "Mike Johnson Weaponizes Government in Fight Against Biden  —  House Speaker Mike Johnson has a tendency to think that when things go bad for his party, it's the product of gross legislative mismanagement, judicial weaponization, and a vast executive conspiracy.",
    "url": "https://newrepublic.com/post/182638/mike-johnson-hypocritical-quest-merrick-garland-contempt"
  },
  {
    "text": "Republican National Committee prepares for a convention Trump may not attend  —  Republican officials are working to ensure that Trump will be able to address convention attendees from afar if he chooses to do so — or if he is forced to because of his legal troubles.",
    "url": "https://www.nbcnews.com/politics/2024-election/republican-national-committee-convention-trump-may-not-attend-rcna156838?taid=666ad0faf5f56e0001ae0cda"
  },
  {
    "text": "Why the Southern Baptists' vote opposing IVF could change national politics  —  The move may signal the beginning of a broad turn on the right against IVF, an issue that many social conservatives see as the “pro-life” movement's next frontier.  —  INDIANAPOLIS — The Southern Baptist Convention … ",
    "url": "https://www.politico.com/news/2024/06/12/ivf-southern-baptist-convention-evangelical-00162994"
  },
  {
    "text": "Wisconsin Supreme Court Lifts New Restrictions on Early Voting Sites Ahead of 2024 Elections  —  WASHINGTON, D.C. — The Wisconsin Supreme Court's liberal majority yesterday froze part of a lower court's decision that stood to significantly limit the number of early voting locations municipalities … ",
    "url": "https://www.democracydocket.com/news-alerts/wisconsin-supreme-court-lifts-new-restrictions-on-early-voting-sites-ahead-of-2024-elections/"
  },
  {
    "text": "Congressional Baseball Game descends into chaos after protesters storm field  —  Eight people were arrested after storming the field at Nationals Park during the annual Congressional Baseball Game  —  Several arrests were made at the Congressional Baseball Game for Charity Wednesday night … ",
    "url": "https://www.foxnews.com/politics/congressional-baseball-game-descends-chaos-after-protesters-storm-field"
  },
  {
    "text": "Senate Republicans block Democrats' Supreme Court ethics bill  —  The legislation would establish a code of conduct for the justices, as well as recusal rules and new requirements for disclosing gifts and travel.  Republicans blocked it from advancing.  —  WASHINGTON — Senate Republicans … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-gop-blocks-democrats-supreme-court-ethics-bill-rcna156738"
  },
  {
    "text": "Oklahoma Supreme Court dismisses lawsuit of last Tulsa Race Massacre survivors seeking reparations  —  The Oklahoma Supreme Court on Wednesday dismissed a lawsuit by survivors of the 1921 Tulsa Race Massacre, dampening the hope of advocates for racial justice that the city would make financial amends … ",
    "url": "https://apnews.com/article/1921-race-massacre-tulsa-black-survivors-b7a4c83514ce79640a8490d49efb9006"
  },
  {
    "text": "Ohio Election Shock as Republican District Shifts 20 Points to Democrats  —  district in Ohio has shifted 20 points to the  —  .  —  Republican state Senator Michael Rulli defeated Democrat Michael Kripchak to win the election held in eastern Ohio's 6th District on Tuesday to fill … ",
    "url": "https://www.newsweek.com/ohio-special-election-congress-results-1911576"
  },
  {
    "text": "Trump's bid to steal the youth … - The latest New York Times/Siena polling of likely voters has President Biden with just a 2-point lead over Trump. … - By contrast, CNN exit polling showed that Biden won the 18-29-year-old vote by 24 percentage points in 2020, and that Hillary Clinton won it by 19 points in 2016.",
    "url": "https://www.axios.com/2024/06/13/trump-election-young-voters-polling"
  },
  {
    "text": "Eugene Young withdraws from US House race  —  Nearly one year after beginning his campaign, Eugene Young is stepping out of the race for Delaware's seat in the U.S. House.  —  The former Delaware State Housing Authority Director has suspended his campaign for the Democratic nomination.",
    "url": "https://www.wdel.com/news/eugene-young-withdraws-from-us-house-race/article_0aff1eac-28df-11ef-a66a-136e551ceb89.html"
  },
  {
    "text": "Transgender swimmer Lia Thomas loses legal challenge in CAS ruling  —  The Court of Arbitration for Sport (CAS) has dismissed a challenge from transgender swimmer Lia Thomas, who had asked the Swiss-based court to reject a policy that would prevent her from competing in women's races at elite competitions.",
    "url": "https://ca.sports.yahoo.com/news/transgender-swimmer-lia-thomas-loses-163220668.html"
  },
  {
    "text": "Appeals court rejects DeSantis push for executive privilege  —  The state court refused to engage with the governor's arguments, which could have amounted to a significant expansion of his power.  —  TALLAHASSEE, Florida — A Florida appeals court on Wednesday refused to go along … ",
    "url": "https://www.politico.com/news/2024/06/12/court-rejects-desantis-executive-privilege-00163015"
  },
  {
    "text": "‘The big story of the 21st century’: is this the most shocking documentary of the year?  —  Six years in the making, jaw-dropping new film The Grab shows a secret scramble by governments and private firms to buy up global resources  —  In 2013, the US food conglomerate Smithfield Foods … ",
    "url": "https://www.theguardian.com/film/article/2024/jun/12/the-grab-documentary-review"
  },
  {
    "text": "Elon Musk sued by SpaceX engineers claiming they were illegally fired  —  Musk ordered firings after engineers raised concerns about alleged sexual harassment and discrimination, lawsuit says  —  SpaceX and its chief executive, Elon Musk, have been sued on Wednesday by eight engineers … ",
    "url": "https://www.theguardian.com/science/article/2024/jun/12/elon-musk-spacex-lawsuit"
  },
  {
    "text": "Hillary Clinton endorses George Latimer in challenge to unseat Jamaal Bowman  —  Nod from Democratic heavyweight comes as Bowman's reelection prospects look increasingly grim.  —  NEW YORK — Hillary Clinton helped deal another blow to vulnerable Rep. Jamaal Bowman on Wednesday … ",
    "url": "https://www.politico.com/news/2024/06/12/hillary-clinton-endorses-george-latimer-challenger-jamaal-bowman-00163037"
  },
  {
    "text": "Protesters expected to be moved away from park near GOP convention  —  The likely shift comes after months of debate among the Republican Party, the Secret Service and the city of Milwaukee on where to allow protests.  —  Protesters are no longer expected to be allowed in a large Milwaukee park near … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/12/republican-convention-protests-milwaukee/"
  },
  {
    "text": "Sen. John Fetterman ‘at fault’ for recent car accident, police report reveals  —  Riley Beggin Nick PenzenstadlerUSA TODAY  —  WASHINGTON - Sen. John Fetterman, D-Pa., was speeding and “at fault” for the car accident that landed him, his wife and another driver in the hospital on Sunday … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/06/12/john-fetterman-car-accident-police-report/74073994007/"
  }
]