[
  {
    "text": "Trump recorded pressuring Wayne County canvassers not to certify 2020 vote  —  Then-President Donald Trump personally pressured two Republican members of the Wayne County Board of Canvassers not to sign the certification of the 2020 presidential election, according to recordings reviewed … ",
    "url": "https://www.detroitnews.com/story/news/politics/2023/12/21/donald-trump-recorded-pressuring-wayne-canvassers-not-to-certify-2020-vote-michigan/72004514007/"
  },
  {
    "text": "Biden economic adviser sees ‘a glimmer of evidence’ Americans feel better about the economy  —  with research by Marisa Iati and Tobi Raji  —  Good morning, Early Birds.  This is our final edition of 2023.  We're taking next week off to spend the holidays with our families.",
    "url": "https://www.washingtonpost.com/politics/2023/12/22/biden-economic-adviser-sees-glimmer-evidence-americans-feel-better-about-economy/"
  },
  {
    "text": "New Hampshire Man Indicted for Threatening to Kill Three Presidential Candidates  —  For Immediate Release  —  A New Hampshire man has been indicted in connection with sending threatening text messages to three presidential candidates.  —  Tyler Anderson, 30, of Dover … ",
    "url": "https://www.justice.gov/opa/pr/new-hampshire-man-indicted-threatening-kill-three-presidential-candidates"
  },
  {
    "text": "Disqualifying Trump may be legally sound but fraught for democracy, scholars say  —  Experts say there's a strong basis for the Colorado Supreme Court's decision to bar Trump from the ballot, but the larger political context makes the question one of the thorniest in recent memory",
    "url": "https://www.washingtonpost.com/politics/2023/12/21/trump-disqualified-14th-amendment-democracy/"
  },
  {
    "text": "Washington Post Editorial Board: The Supreme Court Should Toss the Colorado Decision  —  People (including our own Ed Morrissey) have been saying this since the decision appeared Tuesday but I'm still a bit surprised to see the Washington Post's editorial board making the same case.",
    "url": "https://hotair.com/john-s-2/2023/12/21/washington-post-editorial-board-the-supreme-court-should-toss-the-colorado-decision-n600478"
  },
  {
    "text": "Biden Ends 2023 With 39% Job Approval  —  WASHINGTON, D.C. — President Joe Biden's job approval rating is 39%, marking a slight improvement from the 37% low points in October and November but the fifth time his rating is below 40% in 2023.  —  ###Embeddable###",
    "url": "https://news.gallup.com/poll/547763/biden-ends-2023-job-approval.aspx"
  },
  {
    "text": "Raunchy celebrity party in Russia draws outrage over ‘nude illusion’ theme  —  RIGA, Latvia — A raunchy celebrity-filled party in Moscow has drawn the ire of Russian politicians and fervent Christian Orthodox activists who are urging law enforcement to punish the event's guests and organizers … ",
    "url": "https://www.washingtonpost.com/world/2023/12/21/russia-celebrity-party-nude-putin/"
  },
  {
    "text": "Scoop: Biden campaign plots late push ahead of South Carolina primary  —  President Biden's re-election campaign is planning a January push in South Carolina to drive turnout and boost the overall campaign ahead of the Democratic primary on Feb. 3, three people familiar with the plans tell Axios.",
    "url": "https://www.axios.com/2023/12/22/biden-south-carolina-primary-campaign-2024"
  },
  {
    "text": "Biden to issue pardons for certain marijuana offenses  —  The president will also commute the sentences of 11 people convicted of nonviolent drug offenses, the White House said.  —  WASHINGTON — President Joe Biden will sign a proclamation to pardon certain marijuana offenses Friday … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-issue-pardons-certain-marijuana-offenses-rcna130876"
  },
  {
    "text": "Giuliani seeks bankruptcy after $148 million judgment in defamation case  —  Rudy Giuliani filed for bankruptcy on Thursday, just days after he was ordered to pay $148 million to two former Georgia election workers he falsely accused of fraud as he worked to overturn Donald Trump's 2020 presidential election loss.",
    "url": "https://www.reuters.com/legal/giuliani-seeks-bankruptcy-after-148-mln-judgment-defamation-case-filing-2023-12-21/"
  },
  {
    "text": "Jan. 6 rioters the far right claimed were antifa keep getting unmasked as Trump supporters  —  Misinformation about the Capitol attack continues to go viral on the right, but the claims are slowly getting debunked, federal case by federal case.  —  WASHINGTON — In nearly three years since … ",
    "url": "https://www.nbcnews.com/politics/justice-department/antifa-january-6-capitol-riot-conspiracy-theory-social-media-rcna125369"
  },
  {
    "text": "Substack says it will not remove or demonetize Nazi content … More than 200 Substack authors asked the platform to explain why it's “platforming and monetizing Nazis,” and now they have an answer straight from co-founder Hamish McKenzie: … While McKenzie offers no evidence to back these ideas … ",
    "url": "https://www.theverge.com/2023/12/21/24011232/substack-nazi-moderation-demonetization-hamish-mckenzie"
  },
  {
    "text": "Khashoggi's widow wins political asylum in the United States  —  The decision may be the last act in a tragic chain of events that began in 2018, when Post columnist Jamal Khashoggi was strangled and dismembered in Turkey  —  Jamal Khashoggi's widow, who went into hiding after The Washington Post columnist … ",
    "url": "https://www.washingtonpost.com/nation/2023/12/21/khashoggi-hanan-political-asylum/"
  },
  {
    "text": "John Schneider Probe Opened By Secret Service After ‘Dukes Of Hazzard’ Star Urges Public Hanging Of Joe Biden  — Vin Diesel's Ex-Assistant Sues ‘Fast & Furious’ Star For Sexual Battery & Retaliation; Read Full Complaint  — ‘Warnamount’ Merger Talk Confounds Investors And Industry … ",
    "url": "https://deadline.com/2023/12/john-schneider-secret-service-joe-biden-hanging-comment-1235680080/"
  },
  {
    "text": "A Forgotten Chapter of Abortion History Repeats Itself  —  Much of the country no doubt watched in amazement last week as a woman with a doomed pregnancy was forced to flee her home state, Texas, to get the abortion her doctors deemed necessary to protect her future ability to bear children.",
    "url": "https://www.nytimes.com/2023/12/22/opinion/history-texas-abortion.html"
  },
  {
    "text": "Crisis communicators face blowback after disastrous college hearing  —  Who got paid to give advice on one of the most disastrous public relations moments in modern memory?  —  The appearance of three elite university presidents on Capitol Hill this month to testify about campus antisemitism … ",
    "url": "https://www.politico.com/news/2023/12/22/college-presidents-debacle-over-antisemitism-hearing-meets-pr-blame-game-00132994"
  },
  {
    "text": "How DeSantis's Ambitious, Costly Ground Game Has Sputtered  —  The Florida governor's field operation, one of the most expensive in modern political history, has met challenges from the outset, interviews with a range of voters and political officials revealed.",
    "url": "https://www.nytimes.com/2023/12/22/us/politics/desantis-iowa-pac-ground-game.html"
  },
  {
    "text": "Hunter Biden Text Cited in Impeachment Inquiry Is Not What G.O.P. Suggests  —  A 2019 message from the president's son alluded to giving his father half his salary.  The back story offers unflattering insights into the Biden family but does not support assertions of corruption.",
    "url": "https://www.nytimes.com/2023/12/22/us/politics/hunter-biden-texts-impeachment-republicans.html"
  },
  {
    "text": "U.S.-Mexico border closures could cost billions … - Republicans say the Biden administration needs to do more to address the issue, and former President Trump says he is “closing the border” as one of his first acts if he returns to office. … - After railway operations in Eagle Pass and El Paso … ",
    "url": "https://www.axios.com/2023/12/22/us-mexico-border-closures-could-cost-billions"
  },
  {
    "text": "Palestinian support for ‘armed struggle’ is rising as Gaza death estimate tops 20,000  —  “You cannot kill people into liking you,” a policy analyst said in response to a recent poll.  —  As the death toll in Gaza reached an estimated 20,000 on Thursday, the majority of them women and children … ",
    "url": "https://www.nbcnews.com/investigations/palestinian-support-armed-struggle-rising-gaza-death-estimate-tops-200-rcna130516"
  },
  {
    "text": "Judge keeps Chris Christie off Maine's Republican primary ballot  —  Former New Jersey Gov. Chris Christie's latest attempt to get on the Maine Republican presidential primary ballot failed Thursday after his campaign tried to recover from a surprising setback in the Super Tuesday state.",
    "url": "https://www.cbsnews.com/news/judge-rules-chris-christie-must-remain-off-maine-republican-presidential-primary-ballot/"
  }
]