[
  {
    "text": "Robert Hur's Box-Checking  —  In the middle of his explanation for why he believed that Joe Biden had willfully retained classified records pertaining to Afghanistan but that he couldn't prove that beyond a reasonable doubt, Special Counsel Robert Hur admitted that jurors … ",
    "url": "https://www.emptywheel.net/2024/02/09/robert-hurs-box-checking/"
  },
  {
    "text": "White House Calls Special Counsel Report on Biden Politically Motivated  —  The White House and some Democrats tried to discredit a document that characterized the president as elderly and forgetful.  —  White House officials on Friday called the special counsel's report into President Biden's handling … ",
    "url": "https://www.nytimes.com/2024/02/09/us/politics/kamala-harris-biden-special-counsel.html"
  },
  {
    "text": "White House frustration with Garland grows  —  The president believes the special counsel investigating his handling of classified documents went beyond his remit.  And part of the blame is being placed on the AG.  —  Joe Biden has told aides and outside advisers that Attorney General Merrick Garland … ",
    "url": "https://www.politico.com/news/2024/02/09/white-house-frustration-with-garland-grows-00140813"
  },
  {
    "text": "‘Hair on fire’: Democratic worries grow over claims about Biden's memory lapses  —  The broad conclusion among Democrats is that a dangerous and misleading caricature of the president's performance is at risk of setting in  —  President Biden arrived in the Diplomatic Reception Room … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/09/biden-memory-age-hur-documents/"
  },
  {
    "text": "McCarthy confident in McDaniel and bristles at Gaetz suggestion of leading RNC  —  LAS VEGAS — Former House Speaker and California GOP Rep. Kevin McCarthy said Republican National Committee Chairwoman Ronna McDaniel is equipped to continue leading the party.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/2847495/kevin-mccarthy-confident-rnc-chairwoman-mcdaniel-leadership/"
  },
  {
    "text": "Chief Witness Against Gaetz Is Cooperating With House Ethics Investigation  —  A year after the Justice Department decided not to bring charges against Representative Matt Gaetz in a sex-trafficking investigation, the House Ethics Committee is moving forward with an inquiry into him.",
    "url": "https://www.nytimes.com/2024/02/09/us/politics/gaetz-sex-trafficking.html"
  },
  {
    "text": "Leading GOP hardliner spurned by Trump in tough Senate fight  —  Former President Trump is kneecapping the Senate hopes of right-wing Rep. Matt Rosendale (R-Mont.) before they can even get off the ground. … - “I also respect Matt Rosendale, and was very happy to Endorse him in the past … ",
    "url": "https://www.axios.com/2024/02/09/rosendale-endorsement-trump-montana-senate"
  },
  {
    "text": "‘Yikes’: Internet erupts after ‘Dementia Trump’ makes several verbal slip-ups at NRA rally  —  Donald Trump Friday was hit with a stream of criticism for several verbal slip-ups at an event for the NRA in Pennsylvania.  —  The former president slurred when saying the word “subsidies,” said … ",
    "url": "https://www.rawstory.com/yikes-dementia-trump-slip-ups/"
  },
  {
    "text": "Critical Atlantic Ocean current system is showing early signs of collapse, prompting warning from scientists  —  A crucial system of ocean currents may already be on course to collapse, according to a new report, with alarming implications for sea level rise and global weather … ",
    "url": "https://www.cnn.com/2024/02/09/climate/atlantic-circulation-collapse-weather-climate"
  },
  {
    "text": "DNC accuses RFK Jr. campaign and super PAC of illegal coordination  —  The Democratic National Committee (DNC) accused independent candidate Robert F. Kennedy Jr.'s presidential campaign and his aligned super PAC of illegal coordination, alleging he is receiving improper benefits … ",
    "url": "https://thehill.com/homenews/campaign/4459038-dnc-accuses-rfk-jr-campaign-super-pac-of-illegal-coordination/"
  },
  {
    "text": "S&P 500 closes above 5,000 for first time ever, notches fifth straight winning week  —  A solid earnings season, easing inflation and resilient economy have charged 2024′s market rally, pushing the S&P 500 to a fifth consecutive week of gains.  —  Stocks rose on Friday … ",
    "url": "https://www.nbcnews.com/business/markets/sp-500-closes-5000-first-time-ever-notches-fifth-straight-winning-week-rcna138179"
  },
  {
    "text": "‘Relentless and misleading’: Jack Smith shreds new Trump motion as proof he will ‘stop at nothing’ to delay Mar-a-Lago documents case  —  In a new motion, special counsel Jack Smith shredded Donald Trump's latest attempt to indefinitely delay the classified documents case in Florida … ",
    "url": "https://lawandcrime.com/trump/relentless-and-misleading-jack-smith-shreds-new-trump-motion-as-proof-he-will-stop-at-nothing-to-delay-mar-a-lago-documents-case/"
  },
  {
    "text": "Big Pharma spends billions more on executives and stockholders than on R&D  —  Senate report points to greed and “patent thickets” as key reasons for high prices.  —  When big pharmaceutical companies are confronted over their exorbitant pricing of prescription drugs in the US … ",
    "url": "https://arstechnica.com/science/2024/02/big-pharma-spends-billions-more-on-executives-and-stockholders-than-on-rd/"
  },
  {
    "text": "Treasury confirms terms like ‘MAGA,’ ‘Trump,’ Kamala,' ‘Biden’ used in private bank transaction searches  —  A letter sent from the Treasury to Sen. Tim Scott, R-S.C., also confirms the searches push began under the Trump administration  —  EXCLUSIVE: The Biden administration has confirmed that terms like … ",
    "url": "https://www.foxnews.com/politics/biden-admin-confirms-terms-maga-trump-kamala-private-bank-transaction-searches?intcmp=tw_pols"
  },
  {
    "text": "Ukraine funding package moves closer to Senate passage  —  The Senate voted Friday evening to push a $95.3 billion package funding Ukraine, Israel and other national security priorities closer to passing the upper chamber, even though many Republican senators are upset the legislation … ",
    "url": "https://thehill.com/homenews/senate/4459618-ukraine-funding-package-moves-closer-to-senate-passage/"
  },
  {
    "text": "Elite lawyer brain is killing us  —  It's difficult to overstate what an absolutely astonishing own goal Merrick Garland scored by appointing Robert Hur to lead the Biden documents case.  —  Hur was nominated by Donald Trump to be the US Attorney for the District of Maryland.",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/02/elite-lawyer-brain-is-killing-us"
  },
  {
    "text": "Larry Hogan launches surprise Maryland Senate bid  —  Former Gov. Larry Hogan (R) announced on Friday that he's launching a surprise bid for the open Maryland Senate seat, despite speculation that he was considering a third-party presidential bid.  —  “We desperately need leaders willing … ",
    "url": "https://thehill.com/homenews/campaign/4458366-larry-hogan-maryland-senate/"
  },
  {
    "text": "Palestinians fear time is running out in ‘last stop’ Rafah as Israel orders evacuation ahead of ground assault  —  Israeli Prime Minister Benjamin Netanyahu suggested that civilians would be able to flee the city in southern Gaza before an expected ground operation that has raised U.S. fears of a “disaster.”",
    "url": "https://www.nbcnews.com/news/world/israel-orders-rafah-evacuation-ground-invasion-netanyahu-gaza-war-rcna137863"
  }
]