[
  {
    "text": "Trump will stay on ballot in Washington state  —  A judge in Washington rejected an effort to boot former President Trump off the state's primary and general ballots in a ruling Thursday.  —  Thurston County, Wash., Superior Court Judge Mary Sue Wilson's ruling was in response to a challenge … ",
    "url": "https://thehill.com/regulation/court-battles/4416366-trump-washington-state-ballot-challenge/"
  },
  {
    "text": "Is It Over?  —  The opinions expressed by columnists are their own and do not necessarily represent the views of Townhall.com.  —  Top Columns  —  Trending on Townhall Media  —  Call For a Mop - There's Been an Evisceration During Congressional Testimony and the Floor Is Slippery",
    "url": "https://townhall.com/columnists/calthomas/2024/01/18/is-it-over-n2633759"
  },
  {
    "text": "DeSantis regrets anti-media strategy: ‘I should have gone on everything’  —  The governor initially appeared only on conservative outlets before changing his strategy.  —  MIAMI — Ron DeSantis wishes he could have a do-over with the media.  —  In an interview Thursday with radio host Hugh Hewitt … ",
    "url": "https://www.politico.com/news/2024/01/18/desantis-regret-anti-media-campaign-strategy-00136330"
  },
  {
    "text": "The GOP Is Already Clashing Over Trump's VP Pick  —  While Trump tries to sew up the nomination, his camp is already feuding about his future running mate — and hoping it isn't Nikki Haley.  —  As the vice-presidential field continues to develop, many consider what a Nikki Haley vice presidency could mean for the GOP.",
    "url": "https://www.politico.com/news/magazine/2024/01/18/maga-nightmare-trump-loyalists-move-to-head-off-haley-vp-pick-00136282"
  },
  {
    "text": "Florida Governor Ron DeSantis On The Border Wall v. The Supplemental As Proposed; His Path To Super Tuesday  —  Florida Governor Ron DeSantis joined me this AM:  —  Audio:  —  01-18hhs-desantis  —  Transcript:  —  HH: Governor Ron DeSantis of Florida joins me.  Good morning, Governor.",
    "url": "https://hughhewitt.com/florida-governor-ron-desantis-on-the-border-wall-v-the-supplemental-as-proposed-his-path-to-super-tuesday"
  },
  {
    "text": "Eyeing Super Tuesday, Trump Is Eager to Dispatch Rivals Sooner Than Later  —  The former president is looking to lock up the nomination by Super Tuesday on March 5, but Nikki Haley and Ron DeSantis insist they plan to compete deep into March.  —  With five days left until the New Hampshire primary … ",
    "url": "https://www.nytimes.com/2024/01/18/us/politics/trump-haley-super-tuesday.html"
  },
  {
    "text": "Judge hints at delay for Trump's March trial date in federal election case  —  Judge Tanya Chutkan suggested that Trump will get additional time to prepare for trial if appellate courts reject his claims of immunity.  —  The judge overseeing the federal criminal case against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/01/18/judge-hints-at-delay-for-trumps-march-trial-date-in-federal-election-case-00136403"
  },
  {
    "text": "Donald Trump Has Chosen to Pay Millions to Trash Rule of Law  —  I have a standing complaint that reporters serially fall into Donald Trump's trap of reporting on his courtroom tantrums rather than the evidence of his fraud and crime presented therein.  But I'm going to do just that … ",
    "url": "https://www.emptywheel.net/2024/01/18/donald-trump-has-chosen-to-pay-millions-to-trash-rule-of-law/"
  },
  {
    "text": "Judge loses patience with Trump lawyer in E. Jean Carroll sex assault defamation trial  — E. Jean Carroll resumed testifying in her civil defamation trial stemming from sexual assault claims against Donald Trump.  — Trump clashed with Judge Lewis Kaplan and complained about Carroll's testimony during her first day on the stand.",
    "url": "https://www.cnbc.com/2024/01/18/trump-trial-e-jean-carroll-testimony-ex-president-judge-clash.html"
  },
  {
    "text": "E. Jean Carroll used to be somebody  —  Once you enter Trump's world, your own world evaporates  —  E. Jean Carroll used to have a career, now she has Donald Trump.  She used to have prestige, now she has Donald Trump.  She used to have an identity, and then in 2019 she accused … ",
    "url": "https://www.washingtonpost.com/style/power/2024/01/18/e-jean-carroll-and-the-donald-trump-trials/"
  },
  {
    "text": "Ga. judge in Trump case orders hearing on accusations of Willis misconduct  —  Superior Court Judge Scott McAfee also wrote in his order that Willis must respond to the accusations in writing by Feb. 2.  The accusations first came to light in a filing from one of Trump's co-defendants, former campaign aide Mike Roman.",
    "url": "https://www.washingtonpost.com/national-security/2024/01/18/judge-orders-hearing-fani-willis-misconduct-georgia-case/"
  },
  {
    "text": "Justice Department report finds ‘cascading failures’ in response to Uvalde attack  —  A U.S. Justice Department report released Thursday on the 2022 school shooting in Uvalde, Texas, found “cascading failures” by law enforcement before, during, and after the attack that killed 19 children and two teachers.",
    "url": "https://www.npr.org/2024/01/18/1225340219/uvalde-report"
  },
  {
    "text": "Netanyahu says he has told US that he opposes Palestinian state in any postwar scenario  —  Israeli Prime Minister Benjamin Netanyahu says he has informed the United States that he opposes the establishment of a Palestinian state as part of any postwar scenario.",
    "url": "https://apnews.com/article/israel-hamas-war-news-01-18-2024-73d552c6e73e0dc3783a0a11b2b5f67d"
  },
  {
    "text": "No Labels: We'd consider Haley on our ticket.  Haley: No thanks.  —  The group wants the the former U.N. Ambassador to succeed, whether in the primary or outside of it.  —  No Labels national co-chair Joe Lieberman said on Thursday that the nonpartisan group would consider Nikki Haley … ",
    "url": "https://www.politico.com/news/2024/01/18/no-labels-nikki-haley-00136369"
  },
  {
    "text": "Introducing the New England DEI Patriots  —  If racism is America's original sin, then Democrats and others on the Left are the biblical Babylonians of the 21st century.  For a group of people who claim to want racism gone, they wickedly do everything possible to make sure it remains alive — or at least the insinuation of it.",
    "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/2803337/introducing-the-new-england-dei-patriots/"
  },
  {
    "text": "Democratic Lawmakers Plan Push To Get Controversial Biden Adviser Out Of Office  —  House Democrats have drafted a letter seeking the resignation of White House aide Brett McGurk, whose Middle East policies are seen as worsening the Gaza crisis.  —  LOADING",
    "url": "https://www.huffpost.com/entry/congress-brett-mcgurk-biden-middle-east_n_65a98154e4b041f1ce65448b"
  },
  {
    "text": "Salad and spinach kits sold in 7 states recalled over listeria risk  —  BrightFarms spinach and salad kits sold in seven U.S. states are being recalled because they may be contaminated with listeria, according to a notice posted by the U.S. Food and Drug Administration.",
    "url": "https://www.cbsnews.com/news/spinach-salad-kit-recall-listeria-stop-shop-wegmans/"
  },
  {
    "text": "‘Please guys, wake up’: European leaders push Biden, Congress on Ukraine  —  A group of NATO parliamentarians visited Washington this week to press for more aid.  —  A group of European parliamentarians who are in Washington to drum up more support for Ukraine have a message for lawmakers and the White House: Get your act together.",
    "url": "https://www.politico.com/news/2024/01/18/biden-congress-ukraine-europe-00136404"
  },
  {
    "text": "Democrat Frost challenges GOP to introduce bill to remove Statue of Liberty  —  Rep. Maxwell Frost (D-Fla.) challenged his Republican colleagues to introduce a bill that removes the Statue of Liberty because of their stances on immigration at the southern border.",
    "url": "https://thehill.com/homenews/house/4414275-democrat-frost-gop-statue-of-liberty/"
  },
  {
    "text": "United States of Ozempic: Where anti-obesity drugs are taking off  —  For every 1,000 people in Kentucky, roughly 21 were prescribed a drug that belongs to a buzzy class of diabetes and anti-obesity medications last year — the highest rate of any state, according to insurance claims data provided … ",
    "url": "https://www.axios.com/2024/01/18/ozempic-wegovy-weight-loss-drugs-states-map"
  },
  {
    "text": "Metaphors Journalists Live By (Part II)  —  The conclusion of our story of the bad things that can happen when journalists refuse to criticize themselves  —  Demonstrators hold up signs during a protest against the election of Donald Trump, on Fifth Avenue near Trump Tower, November 12, 2016, in New York.",
    "url": "https://prospect.org/politics/2024-01-18-metaphors-journalists-live-by-part-ii/"
  },
  {
    "text": "How the right aims to scuttle border talks  —  Good morning, Early Birds.  Congratulations to Rep. Patrick McHenry (R-N.C.), who we now hear is the acting king and acting princess of Wales.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2024/01/18/how-right-aims-scuttle-border-talks/"
  },
  {
    "text": "“Here's why that's bad news for Biden”: A chat with NYT Pitchbot  —  The legend himself speaks to Public Notice.  —  ∙ Paid … If you're active on twitter — or were before Elon Musk started making everyone more progressive than Steve Bannon think about deleting their account … ",
    "url": "https://www.publicnotice.co/p/doug-balloon-new-york-times-pitchbot-interview"
  }
]