[
  {
    "text": "Trump's social media account shares a campaign video with a headline about a ‘unified Reich’  —  A video posted to Donald Trump's account on his social media network Monday included references to a “unified Reich” among hypothetical news headlines if he wins the election in November.",
    "url": "https://apnews.com/article/trump-election-2024-rhetoric-germany-antisemitism-31002afb91b642c0314223d19e51f427"
  },
  {
    "text": "Trump posts social media video seemingly suggesting his victory will bring ‘unified Reich’  —  “This was not a campaign video,” a Trump campaign rep said.  —  Former President Donald Trump on Monday posted a video on his social media platform that uses a language that appears to mirror that of Nazi Germany … ",
    "url": "https://abcnews.go.com/Politics/trump-posts-social-media-video-seemingly-suggesting-victory/story?id=110422766"
  },
  {
    "text": "Trump's Truth Social posted a video with apparent Nazi messaging — his team says it wasn't him  — Donald Trump's Truth Social account shared a video referencing a “unified Reich.”  — The Biden campaign accused Trump of echoing Nazi Germany.  — The Trump campaign said the wording of the video hadn't been checked.",
    "url": "https://www.businessinsider.com/trump-video-claims-victory-will-bring-unified-reich-presidential-election-2024-5"
  },
  {
    "text": "The one thing US fears after Iranian president's death  —  Biden administration officials still fear Iran could blame the U.S. or Israel for the helicopter crash that killed Ebrahim Raisi.  —  The Biden administration is closely watching how Iran reacts to the sudden death of its president … ",
    "url": "https://www.politico.com/news/2024/05/20/ebrahim-raisi-iran-death-blame-biden-00158940"
  },
  {
    "text": "On the Death of Iranian President Raisi and Others in a Helicopter Crash  —  The United States expresses its official condolences for the death of Iranian President Ebrahim Raisi, Foreign Minister Amir-Abdollahian, and other members of their delegation in a helicopter crash in northwest Iran.",
    "url": "https://www.state.gov/on-the-death-of-iranian-president-raisi-and-others-in-a-helicopter-crash/"
  },
  {
    "text": "How sanctions played havoc with Iran's ageing helicopters  —  US-made Bell 212 carrying country's president was almost 30 years old when it crashed into a mountainside  —  The circumstances could hardly have been more difficult as the decades-old helicopter, which had clocked up thousands … ",
    "url": "https://www.ft.com/content/f5a9be7a-b446-426f-8b04-ee6a340bb781"
  },
  {
    "text": "Scarlett Johansson says she is ‘shocked, angered’ over new ChatGPT voice  —  Lawyers for Scarlett Johansson are demanding that OpenAI disclose how it developed an AI personal assistant voice that the actress says sounds uncannily similar to her own.  —  Johansson's legal team has sent OpenAI … ",
    "url": "https://www.npr.org/2024/05/20/1252495087/openai-pulls-ai-voice-that-was-compared-to-scarlett-johansson-in-the-movie-her"
  },
  {
    "text": "Trump's Social Media Company Posts Q1 Revenue of $770,500 and Net Loss of $327.6 Million  —  Trump Media and Technology Group, the company affiliated with former U.S. president Donald Trump that operates Truth Social, reported $770,500 in revenue for the first quarter of 2024 and a net loss of $327.6 million.",
    "url": "https://variety.com/2024/digital/news/trump-truth-social-media-q1-2024-revenue-net-loss-1236010937/"
  },
  {
    "text": "Controversial Donald Trump movie ‘The Apprentice’ depicts him as rapist  —  A dark new biopic starring Sebastian Stan as a young Trump is the talk of Cannes.  —  CANNES, France — Had a movie called “The Apprentice” about a young Donald Trump's rise to power premiered in America … ",
    "url": "https://www.washingtonpost.com/entertainment/movies/2024/05/20/donald-trump-the-apprentice-cannes/"
  },
  {
    "text": "Cohen's bombshell admission could lead to hung jury, if not acquittal: expert  —  Former Trump attorney MIchael Cohen admitted Monday that he stole thousands from the Trump Organization  —  Former Trump attorney Michael Cohen's admission in court Monday that he stole from the Trump Organization … ",
    "url": "https://www.foxnews.com/politics/cohens-bombshell-admission-could-lead-hung-jury-if-not-acquittal-expert"
  },
  {
    "text": "‘Millionaires tax’ has already generated $1.8 billion this year for Massachusetts, blowing past projections  —  Massachusetts' so-called “millionaires tax” appears primed to actually deliver billions.  —  State officials said Monday that the voter-approved surtax on high earners has generated … ",
    "url": "https://www.bostonglobe.com/2024/05/20/metro/millionaires-tax-massachusetts-generated-18-billion/"
  },
  {
    "text": "FDIC Chairman Martin Gruenberg to Resign Following Report Detailing Sexual Harassment at Agency  —  Gruenberg plans to stay until successor is confirmed, avoiding scenario that would leave a Republican as acting chairman  —  Federal Deposit Insurance Corp. Chairman Martin Gruenberg bowed … ",
    "url": "https://www.wsj.com/politics/policy/fdic-chairman-martin-gruenberg-resignation-ab7fed5f"
  },
  {
    "text": "Spoiler Alert: Billionaire Trump Mega-Donor Gave Another $5M to RFK Jr.  —  PLAYING THE FIELD  —  The gift is sure to intensify speculation that Timothy Mellon believes Kennedy's candidacy will hurt Joe Biden.  —  Billionaire mega-donor Timothy Mellon, who has poured millions … ",
    "url": "https://www.thedailybeast.com/billionaire-tim-mellon-a-trump-megadonor-gave-another-dollar5m-to-rfk-jr"
  },
  {
    "text": "A House swing seat is at stake in Oregon's Democratic primary  —  Good morning, Early Birds.  The first “Star Wars” prequel, “The Phantom Menace,” was originally scheduled to be released 25 years ago today.  But George Lucas moved up the release date to May 19, allowing the world … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/21/house-swing-seat-is-stake-oregons-democratic-primary/"
  },
  {
    "text": "Biden quietly advances a range of progressive policies  —  He did so just before a deadline on his rule-making authority.  —  ∙ Paid … Congress, in case you're just back from Mars, has been so mired in gridlock that its main function — passing laws — has become about as common as hens teeth.",
    "url": "https://www.publicnotice.co/p/biden-congressional-review-act-2024-deadline"
  },
  {
    "text": "Doctors rail against proposed ban against public masking  —  Cameron Wolfe, an infectious disease specialist at Duke University with a knack for making medicine and science easily understood, is just as straightforward when offering his thoughts on a legislative proposal to ban masking in public.",
    "url": "https://www.northcarolinahealthnews.org/2024/05/20/doctors-call-public-mask-ban-unconscionable-political-point-making/"
  },
  {
    "text": "Biden says maimed American Hersh Goldberg-Polin is ‘here with us today’ at Rose Garden party — despite still being held by Hamas  —  WASHINGTON — President Biden was forced to correct himself after yet another brutal gaffe Monday evening, when he told attendees at a White House Jewish heritage celebration … ",
    "url": "https://nypost.com/2024/05/20/us-news/biden-says-maimed-american-held-by-hamas-is-here-with-us-today-at-rose-garden-party/"
  },
  {
    "text": "Hunter Biden Prosecutor Derek Hines Confesses He Failed To Do Basic Due Diligence, Again  —  I've written about how David Weiss' prosecutors indicted Hunter Biden before they had taken basic investigative steps — like obtaining a warrant to search the President's son's digital data for evidence … ",
    "url": "https://www.emptywheel.net/2024/05/20/hunter-biden-prosecutor-derek-hines-confesses-he-failed-to-do-basic-due-diligence-again/"
  },
  {
    "text": "New 9/11 Evidence Points to Deep Saudi Complicity  —  Two decades of U.S. policy appear to be rooted in a mistaken understanding of what happened that day.  —  For more than two decades, through two wars and domestic upheaval, the idea that al-Qaeda acted alone on 9/11 has been the basis of U.S. policy.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/05/september-11-attacks-saudi-arabia-lawsuit/678430/"
  },
  {
    "text": "Jon Stewart Sounds Off on the ‘Real Cancel Culture’  —  ‘CONSTANT VICTIMIZATION’  —  “Jerry Seinfeld took more shit over the past two weeks promoting a Pop-Tart movie than Harrison Butker did for his entire speech,” Stewart said on Monday's “Daily Show.”  —  Chiefs kicker Harrison Butker … ",
    "url": "https://www.thedailybeast.com/jon-stewart-blasts-trump-cancel-culture-and-gop-hypocrisy-after-harrison-butker-outrage"
  }
]