[
  {
    "text": "Trump supporters post names and addresses of Georgia grand jurors online  —  A fringe website featured the purported names and addresses of the Fulton County grand jury that indicted Trump and 18 others for their efforts to overturn the 2020 election.  —  ATLANTA — The purported names … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/names-addresses-grand-jurors-georgia-trump-indictment-posted-online-rcna100239"
  },
  {
    "text": "What debate?  Trump could time his Georgia arrest to blot out first matchup  —  Allies say lining up his surrender with the first debate would be a wise political decision.  But those aligned with his rivals say Trump won't be able to overshadow the contest.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-arrest-debate-rcna100090"
  },
  {
    "text": "Majority Of Americans Say Trump Should Be Prosecuted On Federal Criminal Charges Linked To 2020 Election, Quinnipiac University National Poll Finds; DeSantis Slips, Trump Widens Lead In GOP Primary  —  mail_outline  —  In the wake of a federal indictment accusing former President Donald Trump … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3877"
  },
  {
    "text": "DeSantis slips to lowest level of support in Quinnipiac 2024 polling  —  Florida Gov. Ron DeSantis's support in the Republican presidential primary slipped to its lowest level this year, according to a new Quinnipiac University national poll released Wednesday.",
    "url": "https://thehill.com/homenews/campaign/4155446-desantis-slips-to-lowest-level-of-support-in-quinnipiac-2024-polling/"
  },
  {
    "text": "Santos Aide Who Impersonated McCarthy Staff Member Faces Federal Charges  —  The aide, Samuel Miele, was accused of impersonating the staff member in fund-raising appeals and was charged with wire fraud and identity theft.  —  A campaign associate of Representative George Santos … ",
    "url": "https://www.nytimes.com/2023/08/16/nyregion/sam-miele-charged-george-santos.html"
  },
  {
    "text": "Unmasking the Co-Conspirators in Trump's Georgia Indictment  —  Trump's latest indictment includes 18 co-defendants and 30 unindicted co-conspirators.  Here's our attempt at figuring out as many as possible. … Donald Trump's fourth indictment is, on almost every level … ",
    "url": "https://www.thedailybeast.com/who-are-trumps-unindicted-co-conspirators-in-georgia-we-unmask-them"
  },
  {
    "text": "Trump Allies Likely to Be Booked at Notorious Atlanta Jail  —  The local sheriff has said the defendants would be treated like everyone else should they surrender at the jail; the process for Donald J. Trump could be different.  —  To locals, the jail is known simply as “Rice Street.”",
    "url": "https://www.nytimes.com/2023/08/16/us/trump-georgia-indictment-atlanta-jail.html"
  },
  {
    "text": "US appeals court rules to restrict abortion pill use  —  A U.S. appeals court ruled on Wednesday to restrict access to the abortion pill mifepristone, partially upholding a lower court ruling that alarmed abortion advocates and pharmaceutical companies.  —  The New Orleans-based 5th U.S. Circuit Court … ",
    "url": "https://www.reuters.com/world/us/us-appeals-court-rules-restrict-abortion-pill-use-2023-08-16/"
  },
  {
    "text": "Appeals court embraces abortion-pill limits, sets up Supreme Court review  —  The Supreme Court has ruled that mifepristone, a key abortion drug, will remain available for now under existing rules while litigation continues  —  A federal appeals court on Wednesday said it would restrict access … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/16/abortion-pill-mifepristone-court-ruling-appeal/"
  },
  {
    "text": "Texas woman accused of threatening to kill judge overseeing Trump election case and a congresswoman  —  A Texas woman was arrested and has been charged with threatening to kill the federal judge overseeing the criminal case against former President Donald Trump in Washington and a member of Congress.",
    "url": "https://apnews.com/article/donald-trump-tanya-chutkan-judge-threats-texas-7d90ad3c8b552b49e269a3f842a6700c"
  },
  {
    "text": "The Jolt: Marjorie Taylor Greene blasts Kemp and floats VP, Senate bids  —  Since Fulton County District Attorney Fani Willis indicted former President Donald Trump for interfering in Georgia's 2020 election, U.S. Rep. Marjorie Taylor Greene has been on the attack.The conservative firebrand … ",
    "url": "https://www.ajc.com/politics/politics-blog/the-jolt-marjorie-taylor-greene-blasts-kemp-and-floats-vp-senate-bids/YKTNGG7QRJDBTH4RSVTV37PZPI/"
  },
  {
    "text": "Medical school professor says children can be ‘gender hybrids’ like a ‘gender minotaur’  —  A professor at the University of California, San Francisco School of Medicine reportedly said children can identify as “gender hybrid” and compared them to the minotaur, a mythological creature.",
    "url": "https://www.washingtonexaminer.com/policy/healthcare/medical-school-professor-says-children-can-be-gender-hybrids-like-a-gender-minotaur"
  },
  {
    "text": "Rudy Giuliani made desperate appeal to Trump to pay his legal bills in Mar-a-Lago meeting  —  With his attorney in tow, Rudy Giuliani traveled to Mar-a-Lago in recent months on a mission to make a personal and desperate appeal to former President Donald Trump to pay his legal bills.",
    "url": "https://www.cnn.com/2023/08/16/politics/giuliani-trump-legal-bills/"
  },
  {
    "text": "Two brands suspend advertising on X after their ads appeared next to pro-Nazi content  —  New York CNN  —  At least two brands have said they will suspend advertising on X, the platform formerly known as Twitter, after their ads and those of other companies were run on an account promoting fascism.",
    "url": "https://www.cnn.com/2023/08/16/tech/x-ads-pro-nazi-account-brand-safety/"
  },
  {
    "text": "New Footage of Roger Stone Working to Overturn 2020 Election Emerges  —  THE BEST LAID PLANS...  The longtime Republican operative was brainstorming ways to thwart the voters' will even before the election had been called for Joe Biden.  —  MSNBC's The Beat aired exclusive footage Wednesday … ",
    "url": "https://www.thedailybeast.com/msnbc-airs-new-footage-of-roger-stone-working-to-overturn-2020-election"
  },
  {
    "text": "Liberal Dark Money Behemoth Faces IRS Complaint Over Alleged Bait-And-Switch Scheme  —  A watchdog group is asking the IRS to investigate the liberal dark money behemoth Arabella Advisors following a Washington Free Beacon report on the shadowy organization.",
    "url": "https://freebeacon.com/democrats/liberal-dark-money-behemoth-faces-irs-complaint-over-alleged-bait-and-switch-scheme/"
  },
  {
    "text": "Mike Lindell's Big ‘Election Crime’ Summit Flops at the Start  —  Naturally, Lindell almost immediately ran into technical issues during his latest attempt to prove the 2020 election was “stolen.”  —  MAGA pillow magnate Mike Lindell kicked off his latest “election crime” … ",
    "url": "https://www.thedailybeast.com/mike-lindells-big-election-crime-summit-is-a-gigantic-flop"
  }
]