[
  {
    "text": "Former U.S. President Jimmy Carter, 100, dies  —  Former President Jimmy Carter, a man who redefined what a post-presidency could be, died Sunday.  He was 100.  —  His son, Chip Carter confirmed that the former president died at his home in Plains about 3:45 p.m.",
    "url": "https://www.ajc.com/news/former-us-president-jimmy-carter-100-dies/3ODQTR5NHVDTDF2SXOU34MKNZM/"
  },
  {
    "text": "Jimmy Carter, 39th president and Nobel Peace Prize winner, dies at 100, his son says  —  The tenacious Southerner was turned out of office by disillusioned voters after a single term.  But he had a brilliant post-presidential career as a champion of health, peace and democracy.",
    "url": "https://www.washingtonpost.com/obituaries/2024/12/29/jimmy-carter-president-dead/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM1NDQ4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM2ODMwNzk5LCJpYXQiOjE3MzU0NDg0MDAsImp0aSI6ImIyOGMzM2Y2LWRjMTEtNGU1Yi04MTdhLTM5NmJhMzZiZjlhZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vYml0dWFyaWVzLzIwMjQvMTIvMjkvamltbXktY2FydGVyLXByZXNpZGVudC1kZWFkLyJ9.5hacu3sUlxvwEvfhnZiok-C7ncbr5tSzNkNltovrmyg&itid=gfta"
  },
  {
    "text": "Statement by President Joe Biden and First Lady Jill Biden on the Passing of Former President Jimmy Carter  —  Today, America and the world lost an extraordinary leader, statesman, and humanitarian.  —  Over six decades, we had the honor of calling Jimmy Carter a dear friend.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/29/statement-by-president-joe-biden-and-first-lady-jill-biden-on-the-passing-of-former-president-jimmy-carter/"
  },
  {
    "text": "Updates: Jimmy Carter Dies at 100  —  The former president, a peanut farmer and Democrat from Georgia, was known as much for his charity and diplomatic work later in life as he was for his single presidential term, which ended in 1981.  —  He lived longer than any other U.S. president.",
    "url": "https://www.nytimes.com/live/2024/12/29/us/jimmy-carter"
  },
  {
    "text": "11 facts about Jimmy Carter that may surprise you  —  The peanut farmer-turned-president, who died Sunday at 100, put solar panels on the White House and once spent 89 seconds inside a melting nuclear reactor.  —  Jimmy Carter, the Georgia peanut farmer who became the 39th president of the United States … ",
    "url": "https://www.washingtonpost.com/nation/2024/12/29/jimmy-carter-facts-surprising/"
  },
  {
    "text": "Statement by Vice President Kamala Harris on the Passing of Former President Jimmy Carter  —  President Jimmy Carter was guided by a deep and abiding faith — in God, in America, and in humanity.  —  Jimmy Carter's life is a testament to the power of service — as a Lieutenant in the United States Navy … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/29/statement-by-vice-president-kamala-harris-on-the-passing-of-former-president-jimmy-carter/"
  },
  {
    "text": "Biden Says Carter to Receive a State Funeral in Washington  — Obama, Trump join tributes for ex-president who died at 100  — President-elect calls Carter ‘good man’ despite disagreements  —  President Joe Biden said he'll order a state funeral in Washington for Jimmy Carter … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-29/jimmy-carter-s-death-biden-says-ex-president-to-receive-state-funeral"
  },
  {
    "text": "Jimmy Carter, who rose from humble peanut farmer to president and Nobel Peace Prize winner, dies aged 100  —  Carter was a towering figure in Democratic politics, both during and after his time in the White House  —  Your support helps us to tell the story",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/jimmy-carter-death-age-cause-b2671280.html"
  },
  {
    "text": "Trump Finally Takes Sides in The Civil War Tearing MAGA Apart  —  President-elect Donald Trump finally spoke out on the civil war driving a wedge between growing factions in the MAGA movement—and he's thrown his weight behind his new pal Elon Musk.With Trump's inauguration still more than 20 days away … ",
    "url": "https://www.thedailybeast.com/trump-knifes-maga-loyalists-to-back-sidekick-musk-on-h-1b-visas/"
  },
  {
    "text": "MAGA Is Already Eating Its Own.  Pass the Popcorn  —  Dear Laura Loomer: You weren't in on the con. You were one of the marks.  —  Like many observers, I expected severe buyers' regret fairly early in the second Trump administration.  After all, many Americans who voted for Trump … ",
    "url": "https://paulkrugman.substack.com/p/maga-is-already-eating-its-own-pass"
  },
  {
    "text": "Elon Musk Is a National Security Risk  —  It is now fair to ask the question: Is Elon Musk a national security risk?  —  According to numerous interviews and remarks, Mr. Musk's Department of Government Efficiency co-leader, Vivek Ramaswamy, once appeared to believe he was.",
    "url": "https://www.nytimes.com/2024/12/29/opinion/elon-musk-china-classified-secrets-national-security-russia-doge.html?unlocked_article_code=1.lE4.XzKs.DOmVI6bFotpM&smid=bs-share"
  },
  {
    "text": "GOP Gov. Claims Musk Is Too Rich to Be Corrupted by Conflicts of Interest  —  “He's so rich he's removed from the potential financial influence,” Gov. Chris Sununu alleged  —  Republican Gov. Chris Sununu said that Elon Musk is “so rich” that he is “removed from the potential financial influence” … ",
    "url": "https://www.rollingstone.com/politics/politics-news/sununu-musk-too-rich-conflicts-of-interest-1235220668/"
  },
  {
    "text": "Biden ‘deeply saddened’ by Jeju Air accident in South Korea  —  President Biden said he was “deeply saddened” by the Jeju Air accident in South Korea that left nearly 180 people dead.  —  “Jill and I are deeply saddened to learn of the loss of life that occurred as a result of the Jeju Airlines accident … ",
    "url": "https://thehill.com/policy/international/5059117-biden-deeply-saddened-by-jeju-airlines-accident-south-korea/"
  },
  {
    "text": "Former Trump adviser: If Denmark can't defend Greenland, let US buy it to ‘become part of Alaska’  —  Former national security adviser Robert O'Brien said in a Sunday interview that Denmark should let the U.S. “buy” Greenland if it cannot defend the self-governing country … ",
    "url": "https://thehill.com/policy/international/5059147-former-trump-adviser-robert-obrien-denmark-greenland-alaska/"
  },
  {
    "text": "‘The first to sue’: Opposing Trump's desire to end birthright citizenship is personal for this attorney general  —  The son of immigrants is among 23 Democratic attorneys general likely to be regularly suing the incoming Trump administration over contentious policies.",
    "url": "https://www.nbcnews.com/politics/donald-trump/-first-sue-opposing-trumps-desire-end-birthright-citizenship-personal-rcna184891"
  },
  {
    "text": "Kansas once required voters to prove citizenship.  That didn't work out so well  —  Republicans made claims about illegal voting by noncitizens a centerpiece of their 2024 campaign messaging and plan to push legislation in the new Congress requiring voters to provide proof of U.S. citizenship.",
    "url": "https://apnews.com/article/kansas-noncitizen-voting-proof-of-citizenship-50d56a0b8d1f0fde15480aab3db67f4f"
  },
  {
    "text": "German politicians attack Elon Musk article praising far-right AfD  —  Lawmakers from Social Democrats and Greens criticise media group Axel Springer over publication of opinion piece  —  German politicians have criticised media conglomerate Axel Springer for publishing an opinion article … ",
    "url": "https://www.ft.com/content/f682ef52-613c-479f-9f24-d7bb091a14d1"
  }
]