[
  {
    "text": "Trump, asked if he has to ‘uphold the Constitution,’ says, 'I don't know'  —  Trump said on NBC News' “Meet the Press” that he's following lawyers' advice as he tries to execute rapid deportations, arguing that giving immigrants due process is time-consuming.",
    "url": "https://www.nbcnews.com/politics/trump-administration/trump-asked-uphold-constitution-says-dont-know-rcna204580"
  },
  {
    "text": "Trump says 'I don't know' when asked if he's required to uphold Constitution  —  The president also downplayed fears of a recession and spoke of potential successors when his four-year term ends in an NBC interview.  —  WEST PALM BEACH, Fla. — President Donald Trump, asked during an interview on NBC News's … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/04/trump-nbc-interview-constitution-economy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MzMxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NzEzNTk5LCJpYXQiOjE3NDYzMzEyMDAsImp0aSI6IjQ0NzE5NGM5LWMzOWMtNGIzMC05ZWRkLWJjMjBiMWM3NTM5MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzA0L3RydW1wLW5iYy1pbnRlcnZpZXctY29uc3RpdHV0aW9uLWVjb25vbXkvIn0.ts5YWWrQEfp-OXw7r84u2vY5gmzwSiqLWI-3Joier-Q&itid=gfta"
  },
  {
    "text": "Trump Administration Live Updates: President Casts Doubt on Due Process Rights  —  Where Things Stand  — Trump on due process: President Trump said in an interview aired on Sunday that he did not know whether every person on American soil was entitled to due process … ",
    "url": "https://www.nytimes.com/live/2025/05/04/us/trump-news"
  },
  {
    "text": "Trump's 48-hour scramble to fly migrants to a Salvadoran prison  —  The administration rounded up some of the Venezuelans two days before the flights took off, pressing forward even as Venezuela agreed to accept deportees.  —  The message from Secretary of State Marco Rubio … ",
    "url": "https://www.washingtonpost.com/immigration/2025/05/04/trump-el-salvador-alien-enemies-act-venezuelans/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MzMxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NzEzNTk5LCJpYXQiOjE3NDYzMzEyMDAsImp0aSI6IjhhOTQ4MDU5LTU2YjQtNGQyZC1hZDQ0LTVmNWJlNDkzNDMzNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA1LzA0L3RydW1wLWVsLXNhbHZhZG9yLWFsaWVuLWVuZW1pZXMtYWN0LXZlbmV6dWVsYW5zLyJ9.NX0-UlQELrhci3ft5ktVwQ1VpmPffOelKB_JoptGd_0&itid=gfta"
  },
  {
    "text": "Ron Johnson on a potential recession: ‘You have to act boldly’  —  Sen. Ron Johnson (R-Wis.) weighed in on the potential recession due to the Trump administration's economic policies, noting that “you have to act boldly” to clean up a mess.  —  Johnson joined CNN's “State of the Union” … ",
    "url": "https://thehill.com/homenews/senate/5281683-trump-economic-policies-recession-ron-johnson/"
  },
  {
    "text": "Justice Department lawyers face skeptical judges upset by ‘shoddy work’  —  As they defend against more than 200 lawsuits challenging President Donald Trump's initiatives, some government lawyers are getting scolded from the bench.  —  Justice Department lawyers defending … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/04/trump-policies-lawyers-court-judges-unimpressed/"
  },
  {
    "text": "Putin says he ‘hopes’ nuclear weapons ‘will not be required’ in Ukraine  —  Russian President Vladimir Putin on Sunday said he hopes there will be no need for nuclear weapons in Ukraine.  —  During a preview of an interview with Russian state media, which was shared with the Associated Press … ",
    "url": "https://thehill.com/policy/international/5281699-putin-ukraine-nuclear-weapons/"
  },
  {
    "text": "Trump Administration Slashes Research Into L.G.B.T.Q. Health  —  More than $800 million in N.I.H. grants canceled as of early May — nearly half of those terminated to date — covered the health of sexual and gender minority groups, The Times found.  —  The Trump administration has scrapped … ",
    "url": "https://www.nytimes.com/2025/05/04/health/trump-administration-slashes-research-into-lgbtq-health.html?unlocked_article_code=1.Ek8.knZN.jTTK7yMhzd_d&smid=url-share"
  },
  {
    "text": "Biden Aides Decided Against a Cognitive Test in Early 2024, Book Says  —  His White House advisers considered giving him such a test to prove his fitness for a second term, but they worried it would draw new attention to his age, according to a forthcoming book.",
    "url": "https://www.nytimes.com/2025/05/04/us/politics/joe-biden-cognitive-test-age.html"
  },
  {
    "text": "‘Everyone knew it but him’: Tiffany Trump's father-in-law has seen role diminished since the transition  —  Massad Boulos' struggle to gain influence is a case study in Trump power politics.  —  Massad Boulos arrived at Joint Base Andrews in early April as the Trump administration's newest official … ",
    "url": "https://www.politico.com/news/2025/05/04/massad-boulos-trump-africa-envoy-limited-influence-00324284"
  },
  {
    "text": "Sweeping cuts hit NEA after Trump administration calls to eliminate the agency  —  Editor's note: NPR receives two grants totaling $65,000 from the National Endowment for the Arts.  —  The Trump Administration has started canceling National Endowment for the Arts (NEA) grants.",
    "url": "https://www.npr.org/2025/05/03/nx-s1-5385888/sweeping-cuts-hit-nea-after-trump-administration-calls-to-eliminate-the-agency"
  },
  {
    "text": "Eight arrested in two separate anti-terror operations  —  Eight men, including seven Iranian nationals, have been arrested in two separate counter-terrorism police investigations.  —  Five were arrested at various locations around England on Saturday as part of a “pre-planned” … ",
    "url": "https://www.bbc.com/news/articles/cx2wqy5ejdjo"
  },
  {
    "text": "Catholic leaders criticize Trump for posting apparent AI photo of himself as the pope  —  Some Catholic leaders and at least one U.S. Catholic group are criticizing President Trump after he posted on social media what appears to be an artificial intelligence-generated image of himself dressed as the pope.",
    "url": "https://www.npr.org/2025/05/04/nx-s1-5386516/catholic-leaders-criticize-trump-ai-pope-photo"
  },
  {
    "text": "The World Is Finally Seeing How Dangerous Bukele Really Is  —  In May 2020, during the height of Covid, El Salvador was under a military-enforced lockdown.  At a news conference, I asked President Nayib Bukele a straightforward question about meeting with the business community about reopening the economy.",
    "url": "https://www.nytimes.com/2025/05/04/opinion/el-salvador-bukele-prisons.html"
  },
  {
    "text": "Rebuke.  —  They thought they could export the chaos.  They thought nationalism was a currency that could be traded across borders, that autocratic rhetoric could be franchised like a fast-food chain, and that the world would follow their script.  But instead of ushering in a new global rightwing order … ",
    "url": "https://www.theindex.media/rebuke/"
  },
  {
    "text": "DOJ opens probe after left-wing DA requires prosecutors to consider race in plea deals  —  Soros-backed prosecutor in Minneapolis hit with DOJ civil rights probe  —  The Justice Department has opened a civil rights investigation into the Minneapolis-area Hennepin County Attorney's Office's … ",
    "url": "https://www.foxnews.com/politics/doj-opens-probe-after-left-wing-da-requires-prosecutors-consider-race-plea-deals"
  },
  {
    "text": "What It Takes to Win—or Lose—in a Meeting With Trump  —  Companies and institutions are honing a playbook for approaching an unpredictable president  —  When Ohio State University President Ted Carter visited the White House last month, he brought President Trump and Vice President JD Vance … ",
    "url": "https://www.wsj.com/politics/policy/what-it-takes-to-winor-losein-a-meeting-with-trump-63e545e1"
  }
]