[
  {
    "text": "Inside President Trump's whirlwind decision to upend global trade  —  Ultimately, Trump resolved to follow his own instincts — and was surrounded by senior officials who enabled him.  —  Not long after President Donald Trump's inauguration, the administration's economic staff went to work … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/04/trump-tariffs-reason-advisers/"
  },
  {
    "text": "“Horrifying”: Trump's Weird, Confused Rant to Media as Markets Tanked  —  After President Trump imposed sweeping tariffs on imports from all over the globe, prompting the markets to implode, he took a question about it on Thursday.  He ranted and rambled delusionally about how everything is just great.",
    "url": "https://newrepublic.com/article/193604/horrifying-trump-weird-confused-rant-media-markets-tanked"
  },
  {
    "text": "Trump's Trade War Escalates as China Retaliates With 34% Tariffs  —  The Chinese government said it would match President Trump's tariff, and also barred a group of American companies from doing business in China.  —  China has struck back at President Trump on Friday.",
    "url": "https://www.nytimes.com/2025/04/04/business/china-trump-tariffs-retaliation.html"
  },
  {
    "text": "Gavin Newsom angles for California exemptions to Trump trade war  —  California Gov. Gavin Newsom said Friday he is pursuing agreements with other countries to ensure California is exempted from retaliatory tariffs aimed at the U.S.  —  Why it matters: President Trump's “Liberation Day” tariffs spurred global blowback.",
    "url": "https://www.axios.com/2025/04/04/newsom-california-tariffs-trump-trade-war"
  },
  {
    "text": "America's astonishing act of self-harm  —  Trump's tariffs will upend the global economic order and tarnish US prosperity  —  If it endures, Donald Trump's decision on April 2 2025 to enact sweeping “reciprocal” tariffs on US trade partners will go down as one of the greatest acts of self-harm in American economic history.",
    "url": "https://www.ft.com/content/21454c08-8e1c-4335-84f9-ef2d0e1aeb14?accessToken=zwAGMfCHA-tIkc8hRUwIjhxDNdOE-e8tDhrrFA.MEQCIGhK1gB2002a3MjTH8ZGlP57OOpCPySxTvb08L0yFkJGAiA_21H7smKf6t649nYXuNNgzKsk9oeiQLO16XZvy8guiw&sharetype=gift&token=fe91e897-3c4b-40a8-86d2-14854ac1023f"
  },
  {
    "text": "Ted Cruz warns Trump tariffs could be ‘terrible for America’  —  Senate Commerce Chair Ted Cruz is warning about major risks for the American economy and its automotive industry thanks to President Donald Trump's trade war, saying it could result in the biggest tax hike in a “long, long time.”",
    "url": "https://www.politico.com/live-updates/2025/04/04/congress/ted-cruz-warns-trump-tariffs-could-be-terrible-for-america-00272219"
  },
  {
    "text": "Appeals Court orders new vote calculations in NC Supreme Court election dispute  — The North Carolina Court of Appeals split, 2-1, in ordering the state elections board to recalculate vote totals in the disputed 2024 state Supreme Court election.  — Voters with incomplete registration records … ",
    "url": "https://www.carolinajournal.com/appeals-court-orders-new-vote-calculations-in-nc-supreme-court-election-dispute/"
  },
  {
    "text": "North Carolina judges side with Republican colleague in close Supreme Court election  —  A North Carolina appeals court sided Friday with the trailing Republican candidate in an extremely close state Supreme Court election, a ruling that could flip the result of the nation's only 2024 race that is still undecided.",
    "url": "https://apnews.com/article/north-carolina-election-2024-griffin-riggs-judges-fe51ca7bb095b9dcb305030220e69606"
  },
  {
    "text": "Ousted Vaccine Chief Says RFK Jr.'s Team Sought Data to Justify Anti-Science Stance  —  Peter Marks says the new health secretary's team wants to show vaccines aren't safe while promoting dangerous and unproven treatments  —  The top vaccine regulator ousted by Robert F. Kennedy Jr … ",
    "url": "https://www.wsj.com/health/healthcare/peter-marks-fda-vaccine-regulator-rfk-jr-interview-9194e3b4?st=1PG4LK"
  },
  {
    "text": "National Security Agency and Cyber Command chief Gen. Timothy Haugh ousted  —  The director of the NSA, the powerful wiretapping and cyber espionage service, was fired and reassigned Thursday, according to U.S. officials.  —  just now  —  The director of the powerful wiretapping … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/03/nsa-director-fired-tim-haugh/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzNjUyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1MDM1MTk5LCJpYXQiOjE3NDM2NTI4MDAsImp0aSI6ImU5MGYyZTIyLTZlMWUtNDI5Ny1iODVmLTRkMmNhNTM5ZDJhMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzAzL25zYS1kaXJlY3Rvci1maXJlZC10aW0taGF1Z2gvIn0.7AVXq6PGEYYtSiu9nV1l4fhRg0-IrJpb6HtYrKyQ0Yo&itid=gfta"
  },
  {
    "text": "More Republicans back bill giving Congress a say on tariffs  —  A bipartisan bill to give Congress a vote on new tariffs is gaining notable GOP backing.  Sens. Mitch McConnell of Kentucky, Lisa Murkowski of Alaska and Jerry Moran of Kansas signed on as cosponsors of the bill … ",
    "url": "https://www.politico.com/live-updates/2025/04/04/congress/more-republicans-back-bill-giving-congress-a-say-on-tariffs-00272454"
  },
  {
    "text": "Russell Brand charged with rape and sexual assault  —  Actor and comedian charged with rape, indecent assault, oral rape and two counts of sexual assault, say police  —  The comedian and actor Russell Brand has been charged with one count each of rape, indecent assault and oral rape as well as two counts of sexual assault.",
    "url": "https://www.theguardian.com/uk-news/2025/apr/04/russell-brand-charged"
  },
  {
    "text": "Poll: AOC leads Schumer in head-to-head New York primary matchup by double digits  —  The liberal group Data For Progress conducted the survey of likely Democratic voters.  —  Alexandria Ocasio-Cortez is leading Chuck Schumer by double digits in a new head-to-head poll of the 2028 New York primary.",
    "url": "https://www.politico.com/news/2025/04/04/schumer-aoc-poll-primary-new-york-030621"
  },
  {
    "text": "Nintendo Halts Switch 2 Pre-Orders Over Trump's Tariffs  —  New tariffs threaten massive price hikes on gaming hardware and other consumer goods  —  Switch 2 pre-orders were supposed to begin on April 9.  No longer.  In an unprecedented move, Nintendo announced on Friday that it's halting pre-orders … ",
    "url": "https://kotaku.com/switch-2-preorder-price-tariff-trump-nintendo-1851774764"
  },
  {
    "text": "Obama says he is ‘deeply concerned’ with the Trump administration's targeting of students, journalists and law firms  —  His comments came on the same day that former Vice President Kamala Harris also spoke out against the administration.  —  Former President Barack Obama said he is … ",
    "url": "https://www.nbcnews.com/politics/politics-news/obama-says-deeply-concerned-trump-administrations-targeting-students-j-rcna199740"
  },
  {
    "text": "Judge finds FEMA withholding grants in violation of court order  —  A federal judge Friday ordered the Federal Emergency Management Agency (FEMA) to disburse millions of dollars of grants to Democratic-led states, finding the administration's withholding of the funds breached his previous ruling.",
    "url": "https://thehill.com/regulation/court-battles/5232494-judge-fema-grants-trump-blue-states/"
  },
  {
    "text": "Canceled contract means NOAA research websites slated to go dark  —  The early cancellation of an Amazon Web Services contract means that a slew of NOAA websites are slated to go dark beginning at midnight, sources told Axios.  —  Why it matters: This mainly would affect NOAA's research division … ",
    "url": "https://www.axios.com/2025/04/04/noaa-research-websites-go-dark-saturday-night"
  },
  {
    "text": "Trump's Jewish Cover Story … The Trump administration wants you to know that it's just looking out for Jews.  In recent weeks, the White House has cited anti-Semitism as the motivation for many of its controversial moves, whether deporting foreign students who allegedly engaged … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/04/trump-anti-semitism-agenda/682285/?gift=Y5UOGK3oJJO3esRHvDP7ocVTDaajVIFYFG96PPCQ1HE&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump's VA is ending a rescue program that's saved 17,000 military veterans' homes  —  The U.S. Department of Veterans Affairs said Thursday that it will end a mortgage-rescue program designed to help veterans who have fallen behind on their mortgages keep their homes.",
    "url": "https://www.npr.org/2025/04/03/nx-s1-5351768/trumps-va-is-ending-a-rescue-program-thats-saved-17-000-military-veterans-homes"
  },
  {
    "text": "The Failed Ideas That Drive Elon Musk  —  President Trump has reportedly told cabinet members that Elon Musk may soon leave the administration.  If and when he goes, what will he leave behind?  —  Mr. Musk has long presented himself to the world as a futurist.",
    "url": "https://www.nytimes.com/2025/04/04/opinion/elon-musk-doge-technocracy.html?unlocked_article_code=1.9E4.XHGI.A1g2JArBn_Sv&smid=url-share"
  },
  {
    "text": "Massive, Unarchivable Datasets of Cancer, Covid, and Alzheimer's Research Could Be Lost Forever  —  Almost two dozen repositories of research and public health data supported by the National Institutes of Health are marked for “review” under the Trump administration's direction … ",
    "url": "https://www.404media.co/nih-archives-repositories-marked-for-review-for-potential-modification/"
  },
  {
    "text": "Thai arrest warrant issued for American academic on royal insult charges  —  A Thai court issued an arrest warrant for an American academic on charges of insulting the monarchy, a rare use of the country's “lese majeste” law against a foreigner, according to a document reviewed by Reuters on Friday.",
    "url": "https://www.reuters.com/world/thai-arrest-warrant-issued-american-academic-royal-insult-charges-2025-04-04/"
  },
  {
    "text": "Global brokerages raise recession odds; J.P.Morgan sees 60% chance  —  J.P.Morgan ratcheted up its odds for a U.S. and global recession to 60%, as brokerages scrambled to revise their forecast models with tariff distress threatening to sap business confidence and slow down global growth.",
    "url": "https://www.reuters.com/markets/jpmorgan-lifts-global-recession-odds-60-us-tariffs-stoke-fears-2025-04-04/"
  },
  {
    "text": "The job market remains incredibly healthy — but the tariff storm could upend things  —  The American labor market just provided a bit of reassuring economic news at the end of a rocky week.  —  U.S. employers added 228,000 jobs in March.  That's about twice the number added the previous month … ",
    "url": "https://www.npr.org/2025/04/04/nx-s1-5349661/jobs-economy-trump-tariffs"
  },
  {
    "text": "Trump Skips Return Of Dead U.S. Soldiers To Play Golf And Boost His Business Instead  —  The four Army soldiers died in a training exercise in Lithuania.  Trump chose to attend his personal business partners' dinner Thursday and play golf Friday.  —  WASHINGTON - President Donald Trump skipped … ",
    "url": "https://www.huffpost.com/entry/trump-skips-dover-soldiers-golf_n_67effa46e4b0bb67eb7acc1a"
  }
]