[
  {
    "text": "The Trump dictatorship  —  Editor at large  —  Robert Kagan, a Post Opinions contributing editor, is the author of “Rebellion: How Antiliberalism Is Tearing America Apart — Again,” which will be published by Knopf in May.  —  Let's stop the wishful thinking and face the stark reality … ",
    "url": "https://www.washingtonpost.com/opinions/2023/11/30/trump-dictator-2024-election-robert-kagan/"
  },
  {
    "text": "McCarthy privately recounts terse phone call with Trump after ouster  —  During the call, former president detailed the reasons he hadn't intervened during the effort to remove McCarthy as speaker  —  In the weeks after the Jan. 6, 2021, attack on the U.S. Capitol, then-House Minority Leader Kevin McCarthy … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/30/donald-trump-kevin-mccarthy-phone-call/"
  },
  {
    "text": "Florida GOP Chair Christian Ziegler, husband of Moms For Liberty cofounder, accused of sexual assault by alleged menage a trois lover  —  Christian Ziegler, Florida's GOP chairman and husband of Sarasota County School Board member and Moms of Liberty co-founder Bridget Ziegler … ",
    "url": "https://flcga.org/florida-gop-chair-christian-ziegler-husband-of-a-moms-for-liberty-cofounder-accused-of-battery-by-alleged-menage-a-trois-lover/"
  },
  {
    "text": "Henry Kissinger, War Criminal Beloved by America's Ruling Class, Finally Dies  —  The infamy of Nixon's foreign-policy architect sits, eternally, beside that of history's worst mass murderers.  A deeper shame attaches to the country that celebrates him  —  Henry Kissinger died on Wednesday … ",
    "url": "https://www.rollingstone.com/politics/politics-news/henry-kissinger-war-criminal-dead-1234804748/"
  },
  {
    "text": "Henry Kissinger, the Hypocrite  —  Henry Kissinger, who died on Wednesday, exemplified the gap between the story that America, the superpower, tells and the way that we can act in the world.  At turns opportunistic and reactive, his was a foreign policy enamored with the exercise of power … ",
    "url": "https://www.nytimes.com/2023/11/30/opinion/henry-kissinger-the-hypocrite.html"
  },
  {
    "text": "Majority of Florida Voters Support Abortion Amendment to State Constitution: Poll  —  If enough signatures are obtained, the Florida Supreme Court would then review the amendment and determine if it can be put on the ballot  —  A majority of Florida voters say they would vote yes … ",
    "url": "https://themessenger.com/politics/majority-of-florida-voters-support-abortion-amendment-to-state-constitution-poll"
  },
  {
    "text": "MSNBC cancels Mehdi Hasan's show  —  The News  —  MSNBC is canceling outspoken opinion host Mehdi Hasan's weekend program and show on the streaming service Peacock.  —  Two people familiar with the move, which MSNBC privately announced to staff Thursday morning, told Semafor that Hasan … ",
    "url": "https://www.semafor.com/article/11/30/2023/msnbc-cancels-mehdi-hasans-show"
  },
  {
    "text": "Three US cities make list of most expensive in world  —  Story at a glance  — New York, Los Angeles and San Francisco are three of the most expensive cities on the planet to live in, according to a new report.  — New York tied with Geneva as the third most expensive city on earth … ",
    "url": "https://thehill.com/changing-america/respect/poverty/4335962-three-us-cities-make-list-of-most-expensive-in-world/"
  },
  {
    "text": "Former N.J. Trump golf club worker says she was sexually harassed, tricked into signing NDA  —  The allegations date back to 2021.  —  A former server at Trump National Golf Club in Bedminster alleges she was sexually harassed and coerced into sex by a supervisor, then tricked into signing … ",
    "url": "https://www.politico.com/news/2023/11/30/trump-golf-club-worker-sexually-harassment-lawsuit-00129307"
  },
  {
    "text": "‘She got so mad at me’: book on the ‘Squad’ details AOC-Pelosi clashes  —  Alexandria Ocasio-Cortez tells Ryan Grim life in Congress ‘completely transformed’ after Democratic leader stepped down  —  In a call to congratulate Alexandria Ocasio-Cortez on her momentous 2018 primary win over Joe Crowley … ",
    "url": "https://www.theguardian.com/books/2023/nov/30/squad-book-aoc-nancy-pelosi"
  },
  {
    "text": "Senate GOP stages hearing walkout to protest Supreme Court-related subpoenas  —  Tempers exploded at a Senate Judiciary Committee meeting Thursday before Democrats voted to subpoena a major conservative donor and a prominent conservative activist linked to the Supreme Court's ethics scandals.",
    "url": "https://thehill.com/homenews/senate/4335581-senate-gop-stages-hearing-walkout-to-protest-supreme-court-related-subpoenas/"
  },
  {
    "text": "The Rock's appearance on Rogan is proof that ‘cancel culture’ lost  —  Elon Musk was asked on Wednesday what his message was to companies that paused their ads on his X platform, after a campaign from the progressive activist group Media Matters pressuring companies to leave.  “I hope they stop.",
    "url": "https://thehill.com/opinion/campaign/4335881-the-rocks-appearance-on-rogan-is-proof-that-cancel-culture-lost/"
  },
  {
    "text": "Trump's Gag Order Is Back After Appeals Court Sides With Judge  —  An appeals court decided that Trump's gag order, which was lifted on appeal, should actually be reinstated.  —  Donald Trump is once again prohibited from attacking the law clerk at his ongoing bank fraud trial in New York … ",
    "url": "https://www.thedailybeast.com/trumps-gag-order-is-reinstated-for-bank-fraud-trial"
  },
  {
    "text": "Trump co-defendant in Georgia who pleaded guilty could testify in other cases  —  Prosecutors in Arizona and Nevada have made overtures to Kenneth Chesebro, who helped organize pro-Trump state electors in 2020  —  PHOENIX — Kenneth Chesebro, one of former president Donald Trump's co-defendants … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/30/kenneth-chesebro-georgia-arizona-nevada/"
  },
  {
    "text": "Sen. Rand Paul performs Heimlich maneuver on choking Joni Ernst  —  Paul performed the Heimlich maneuver on Ernst during a Thursday Senate lunch  —  Sen. Rand Paul, R-Ky., performed the Heimlich maneuver on Sen. Joni Ernst, R-Iowa who was choking on food.  —  The incident happened … ",
    "url": "https://www.foxnews.com/politics/sen-rand-paul-performs-heimlich-maneuver-choking-joni-ernst"
  },
  {
    "text": "Three killed, 6 injured in Hamas-claimed terror shooting at Jerusalem bus stop  —  Slain victims identified as Livia Dickman, 24, rabbinical judge Elimelech Wasserman, 73, and Hannah Ifergan, in her 60s; two Hamas-affiliated gunmen shot dead at scene  —  Three people were killed and six were wounded … ",
    "url": "https://www.timesofisrael.com/three-killed-6-injured-in-terror-shooting-at-jerusalem-entrance-bus-stop/"
  },
  {
    "text": "U.S. stops helping Big Tech spot foreign meddling amid GOP legal threats  —  The federal government is no longer warning Meta about foreign influence campaigns, a shift that comes amid a legal campaign against the Biden administration's communication with tech platforms",
    "url": "https://www.washingtonpost.com/technology/2023/11/30/biden-foreign-disinformation-social-media-election-interference/"
  },
  {
    "text": "The surprising dating life of Henry Kissinger, a West Wing ‘playboy’  —  Henry Kissinger was about to get lucky with Zsa Zsa Gabor.  And it was due, in part, to Richard M. Nixon's setting them up.  Seriously.  —  The diplomat and the Hungarian American socialite were an unlikely couple … ",
    "url": "https://www.washingtonpost.com/history/2023/11/29/henry-kissinger-dies-dating-life-playboy/"
  },
  {
    "text": "He doesn't report having checking or savings.  So where did Andy Ogles get $320,000 for his campaign?  —  Watchdog: ' It's not clear from his financial disclosure reports where he got the money' that he claims to have loaned campaign  —  NASHVILLE, Tenn. (WTVF) — Where did Congressman Andy Ogles … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/revealed/he-doesnt-report-having-checking-or-savings-so-where-did-andy-ogles-get-320-000-for-campaign"
  },
  {
    "text": "Meta says it broke up Chinese influence operation looking to exploit U.S. political divisions  —  The company said it has taken down five different networks with ties to China, a sign that the country could be ramping up its propaganda efforts ahead of the U.S. election.",
    "url": "https://www.nbcnews.com/tech/security/meta-says-broke-chinese-influence-operation-looking-exploit-us-politic-rcna127181"
  },
  {
    "text": "Defiant Santos announces effort to oust colleague ahead of his own likely expulsion  —  Rep. George Santos (R-N.Y.) may be getting pushed out of Congress, but he's making it clear that he won't be leaving quietly.  —  The embattled lawmaker announced Thursday morning that he will move … ",
    "url": "https://thehill.com/homenews/house/4334916-santos-bowman-house-expulsion/"
  },
  {
    "text": "MoveOn Carries Out Layoffs as Liberal Groups Struggle to Raise Money  —  The layoffs are the latest sign of a slowdown in small-dollar donations to Democratic candidates and liberal organizations.  —  The liberal activist organization MoveOn laid off at least 18 employees this week … ",
    "url": "https://www.nytimes.com/2023/11/30/us/politics/moveon-layoffs.html"
  },
  {
    "text": "London Town Cancels Hanukkah Menorah Lighting for Fear of ‘Inflaming Tensions’ During Gaza War  —  The local member of Parliament called the move a ‘grave insult to the Jewish community,’ saying the event was a ‘matter of religious freedom’  —  Officials in a London suburb have canceled plans … ",
    "url": "https://themessenger.com/news/london-hanukkah-menorah-lighting-canceled-war-israel-hamas-inflaming-tensions"
  },
  {
    "text": "The RNC's rules for the 2024 convention don't address what would happen if Donald Trump is convicted  —  The Republican National Committee's rules for next year's nominating contest and convention were released this week without addressing a question the GOP could well face next summer … ",
    "url": "https://apnews.com/article/trump-republican-delegates-2024-nomination-0bc16f9bf75ae9f42d85a8a5276aa03b"
  }
]