[
  {
    "text": "Trump suffers big loss in E. Jean Carroll defamation case, judge says he's liable  — A judge ruled that Donald Trump is liable for defamatory statements he made about the writer E. Jean Carroll in 2019 when she went public with claims he had raped her decades earlier.",
    "url": "https://www.cnbc.com/2023/09/06/trump-suffers-big-loss-in-e-jean-carroll-defamation-case-judge-says-hes-liable.html"
  },
  {
    "text": "Judge Shoots Down Trump's Attempt at Trial Delay in 9 Words  —  HOW 'BOUT NO?  —  A New York judge—unmoved by the incessant pleas from Donald Trump's legal team to delay trial—made quick work of the former president's last-minute request Tuesday night to push back his first big upcoming trial for bank and tax fraud.",
    "url": "https://www.thedailybeast.com/judge-shoots-down-trumps-attempt-at-a-new-york-trial-delay-in-9-words"
  },
  {
    "text": "Georgia Prosecutors Land a Significant Win in Trump Case  —  Kenneth Chesebro and Sidney Powell wanted to go to trial much faster than the other 17 co-defendants.  —  A judge in Georgia on Wednesday denied motions from two co-defendants to sever their cases from one another … ",
    "url": "https://www.thedailybeast.com/judge-tosses-kenneth-chesebro-sidney-powells-attempts-sever-in-trumps-georgia-case"
  },
  {
    "text": "Witness in Trump documents case reached deal with prosecutors, ex-attorney says  —  A key witness in the case accusing former U.S. President Donald Trump of mishandling classified documents after leaving office has entered into a deal with prosecutors to provide testimony, his former attorney said in a Wednesday court filing.",
    "url": "https://www.reuters.com/legal/witness-trump-documents-case-reached-deal-with-prosecutors-ex-attorney-says-2023-09-06/"
  },
  {
    "text": "Trump was warned FBI could raid Mar-a-Lago as team feared he'd ‘go ballistic’ complying with subpoena, lawyer's notes show  —  Trump attorney Evan Corcoran saved his recollections in a series of voice memos.  —  In May of last year, shortly after the Justice Department issued a subpoena … ",
    "url": "https://abcnews.go.com/US/trump-warned-fbi-raid-mar-lago-team-feared/story?id=102932105"
  },
  {
    "text": "I Can't Keep Trump Off the Ballot  —  Voters should decide elections: That's the simple lesson of Georgia in 2018 and 2020.  —  Atlanta  —  Some legal scholars are arguing that secretaries of state should remove Donald Trump from the 2024 presidential ballot under Section 3 of the 14th Amendment … ",
    "url": "https://www.wsj.com/articles/i-cant-keep-trump-off-the-ballot-georgia-sec-state-14th-amendment-c1017ede?mod=followamazon"
  },
  {
    "text": "‘A Big Circle Jerk’: John Fetterman Dares Republicans To Impeach Joe Biden  —  “Go ahead.  Do it, I dare you,” said the Democratic senator.  “It's a loser.”  —  LOADING  —  Sen. John Fetterman (D-Pa.) had some blunt words for Republicans who are pushing to impeach President Joe Biden: It'll bite you in next year's elections.",
    "url": "https://www.huffpost.com/entry/joe-biden-impeachment-john-fetterman_n_64f8df8de4b0d44852edd611"
  },
  {
    "text": "Wisconsin Republicans Threaten to Impeach Liberal State Supreme Court Justice  —  Republicans have floated impeaching a newly seated liberal State Supreme Court justice who is threatening conservatives' grip on state politics.  —  Republicans in Wisconsin are coalescing around the prospect … ",
    "url": "https://www.nytimes.com/2023/09/06/us/politics/justice-protasiewicz-impeachment-wisconsin.html"
  },
  {
    "text": "Playbook: An Obama vet's message on Biden bedwetting  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  JUST POSTED — Vice President KAMALA HARRIS tells AP's Chris Megerian those who attempted to overturn the 2020 election should be held accountable, including DONALD TRUMP.",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/06/an-obama-vets-message-on-biden-bedwetting-00114179"
  },
  {
    "text": "Former President Donald Trump On His Trials and His Campaign  —  Former President Trump joined me this morning:  —  Audio:  —  09-06hhs-trump  —  Transcript:  —  HH: Pleased to welcome back to the program former President Donald Trump.  Mr. President, welcome.  Good to have you back.",
    "url": "https://hughhewitt.com/former-president-donald-trump-on-his-trials-and-his-campaign"
  },
  {
    "text": "Judge Orders Texas to Move Barrier From Middle of the Rio Grande  —  A federal judge ordered the state to move the barrier, placed to discourage illegal crossings from Mexico, to the banks of the river.  —  A federal judge ordered Gov. Greg Abbott on Wednesday to move a barrier of floating buoys … ",
    "url": "https://www.nytimes.com/2023/09/06/us/texas-border-rio-grande-lawsuit.html"
  },
  {
    "text": "Newly obtained George Santos “vulnerability report” spotted red flags long before embattled Rep. was elected  —  When an outside firm hired by then-congressional hopeful George Santos in 2021 delivered a secret internal report detailing aspects of the candidate's checkered background, several of his aides found it too much to stomach.",
    "url": "https://www.cbsnews.com/news/george-santos-vulnerability-report-red-flags-long-before-embattled-rep-was-elected/"
  },
  {
    "text": "Special counsel to indict Hunter Biden in gun case this month, DOJ says  —  Special counsel David Weiss intends to seek an indictment against President Joe Biden's son, Hunter Biden, relating to gun charges by the end of the month, the Justice Department said Wednesday.",
    "url": "https://www.cnn.com/2023/09/06/politics/hunter-biden-gun-charges-indictment/"
  },
  {
    "text": "Project Veritas audit accuses ‘untouchable’ founder of improper spending  —  A law firm's report alleges James O'Keefe spent nonprofit funds on helicopter travel and DJ equipment and that his ‘volatile’ behavior disrupted the workplace  —  In August 2022, James O'Keefe needed to get to Maine for a sailing trip.",
    "url": "https://www.washingtonpost.com/style/the-media/2023/09/06/project-veritas-james-okeefe-audit-spending-volatile/"
  },
  {
    "text": "COVID-exposed Biden goes maskless in front of hero  —  A long overdue ceremony was held yesterday for retired Army Captain Larry Taylor, a Vietnam war veteran who earned the Medal of Honor.  He received his award yesterday from President Joe Biden, but as with most normal functions … ",
    "url": "https://hotair.com/jazz-shaw/2023/09/06/covid-exposed-biden-goes-maskless-in-front-of-hero-n576066"
  },
  {
    "text": "QAnon-embraced film pulled from screening on-base at SOUTHCOM  —  U.S. Southern Command planned, and then canceled, two showings of the Christian-faith-based thriller “Sound of Freedom” at its headquarters this summer.  The movie's been a runaway hit, grossing more than $200 million … ",
    "url": "https://www.militarytimes.com/flashpoints/extremism-disinformation/2023/09/05/qanon-embraced-film-pulled-from-screening-on-base-at-southcom/"
  },
  {
    "text": "FDA could green light new Covid boosters as early as Friday  —  The shots could become available next week, after the Centers for Disease Control and Prevention also signs off.  —  The Food and Drug Administration plans to green light updated versions of the Covid booster as early as Friday … ",
    "url": "https://www.nbcnews.com/health/health-news/fda-green-light-new-covid-boosters-early-friday-rcna103379"
  },
  {
    "text": "Mexico's Supreme Court decriminalizes abortion nationwide  —  Mexico's Supreme Court decriminalized abortion nationwide Wednesday, two years after ruling that abortion was not a crime in one northern state.  That earlier ruling had set off a grinding process of decriminalizing abortion state by state.",
    "url": "https://apnews.com/article/mexico-abortion-decriminalize-d87f6edbdf68c2e6c8f5700b3afd15de"
  },
  {
    "text": "To settle suit, NYPD agrees to scale back enforcement of protests  —  The New York City Police Department on Tuesday agreed to scale back its enforcement of street protests like those that erupted after the death of George Floyd in 2020, enacting a series of reforms including banning the tactic known as “kettling.”",
    "url": "https://www.reuters.com/world/us/settle-suit-nypd-agrees-scale-back-enforcement-protests-2023-09-06/"
  },
  {
    "text": "Exclusive: Dianne Feinstein speaks on family's financial feud and her daughter's role in estate  —  WASHINGTON — Sen. Dianne Feinstein gave her daughter power of attorney over her legal affairs so that she can focus on her work in Congress, she told the Chronicle Wednesday in her first public comments … ",
    "url": "https://www.sfchronicle.com/politics/article/feinstein-lawsuit-18350373.php"
  }
]