[
  {
    "text": "Special counsel obtained search warrant for Donald Trump's Twitter account  —  Twitter's initial resistance to complying with the warrant resulted in a federal judge holding the company in contempt and levying a $350,000 fine.  —  Special Counsel Jack Smith sought and obtained a search warrant … ",
    "url": "https://www.politico.com/news/2023/08/09/special-counsel-obtained-search-warrant-for-donald-trumps-twitter-account-00110484"
  },
  {
    "text": "Twitter was fined $350,000 for failing to turn over Trump's data  —  The social media company Twitter was forced to hand over records from former president Donald Trump's account to the special counsel investigating the events leading up to the Jan. 6, 2021, attack and pay sanctions for failing … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/09/twitter-fine-jan-6-trump/"
  },
  {
    "text": "Special Counsel Obtained Search Warrant for Trump's Twitter Account  —  The warrant, obtained in January, adds a new dimension to the scope of the federal inquiry into the events of Jan. 6, 2021.  —  Prosecutors working for Jack Smith, the special counsel who has twice brought indictments … ",
    "url": "https://www.nytimes.com/2023/08/09/us/politics/trump-twitter-account-search-warrant.html"
  },
  {
    "text": "Ohio Vote Shows Abortion's Potency to Reshape Elections  —  The Dobbs ruling has turned a coalition of liberal, swing and moderate Republican voters into a political force.  Even in August in Ohio.  —  Gov. Mike DeWine of Ohio, a Republican, argued that Tuesday's vote over how to amend … ",
    "url": "https://www.nytimes.com/2023/08/09/us/politics/ohio-election-abortion-voters.html"
  },
  {
    "text": "Not just Trump: The Ohio abortion vote exposes the bitterness fueling the GOP war on democracy  —  Republicans want to impose their policies on unwilling voters, just like they'll force childbirth on women  —  For decades, Republicans had bamboozled the press into believing that the country was “bitterly divided” over abortion.",
    "url": "https://www.salon.com/2023/08/09/not-just-trump-the-ohio-abortion-vote-exposes-the-bitterness-fueling-the-on-democracy/"
  },
  {
    "text": "Ohio Voters Reject Constitutional Change Intended to Thwart Abortion Amendment  —  The contest was seen as a test of efforts by Republicans nationwide to curb voters' use of ballot initiatives.  —  Ohio voters rejected a bid to make it harder to amend the State Constitution on Tuesday … ",
    "url": "https://www.nytimes.com/2023/08/08/us/ohio-election-issue-1-results.html"
  },
  {
    "text": "DeSantis Suspends Second Elected Prosecutor in Florida  —  The Republican governor accused Monique H. Worrell, the state attorney in Orlando and a Democrat, of leniency toward violent criminals, a charge her office has denied.  —  Reporting from Florida  —  Gov. Ron DeSantis of Florida suspended … ",
    "url": "https://www.nytimes.com/2023/08/09/us/desantis-orlando-prosecutor.html"
  },
  {
    "text": "DeSantis suspends Orlando state attorney over ‘dereliction of duty’ on crime  —  DeSantis' office says State Attorney Monique Worrell allowed criminals to ‘escape the full consequences’ of their actions  —  Florida Gov. Ron DeSantis suspended Ninth Judicial Circuit State Attorney Monique Worrell for … ",
    "url": "https://www.foxnews.com/politics/desantis-suspends-orlando-state-attorney-over-dereliction-duty-crime"
  },
  {
    "text": "Previously Secret Memo Laid Out Strategy for Trump to Overturn Biden's Win  —  The House Jan. 6 committee's investigation did not uncover the memo, whose existence first came to light in last week's indictment.  —  A lawyer allied with President Donald J. Trump first laid out a plot … ",
    "url": "https://www.nytimes.com/2023/08/08/us/politics/trump-indictment-fake-electors-memo.html"
  },
  {
    "text": "Senator Dianne Feinstein Taken to Hospital After Tripping, Falling in San Francisco  —  EXCLUSIVE  —  700 … 7:30 AM PT — Senator Dianne Feinstein's office released this statement ... “Senator Feinstein briefly went to the hospital yesterday afternoon as a precaution after a minor fall in her home.",
    "url": "https://www.tmz.com/2023/08/09/senator-dianne-feinstein-hospitalized-trip-fall-shingles-health-san-francisco/"
  },
  {
    "text": "Ex-federal judge and prominent conservative: ‘There is no Republican Party’  —  J. Michael Luttig, a conservative retired federal judge and key adviser to former Vice President Mike Pence, declared on Wednesday that “there is no Republican Party” and said former President Donald Trump … ",
    "url": "https://www.cnn.com/2023/08/09/politics/michael-luttig-conservative-judge-republicans-cnntv/"
  },
  {
    "text": "Much of historic Lahaina town believed destroyed as huge wildfire sends people fleeing into water  —  LAHAINA (HawaiiNewsNow) - Eyewitnesses described an apocalyptic scene Tuesday in Lahaina town, where residents were forced to jump into the harbor waters to avoid fast-moving flames … ",
    "url": "https://www.hawaiinewsnow.com/2023/08/09/coast-guard-joins-brush-fire-response-lahaina-where-crews-continue-battle-wind-whipped-flames/"
  },
  {
    "text": "Comer Releases Third Bank Memo Detailing Payments to the Bidens from Russia, Kazakhstan, and Ukraine  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today released a third bank records memorandum detailing new information obtained … ",
    "url": "https://oversight.house.gov/release/comer-releases-third-bank-memo-detailing-payments-to-the-bidens-from-russia-kazakhstan-and-ukraine%EF%BF%BC/"
  },
  {
    "text": "GOP Operative Who Sexually Abused Teen Girls Gets 21 Years  —  Lazzaro, a wannabe playboy who landed himself a spot as an alternate elector for former President Donald Trump in 2020, was convicted of teen sex trafficking in March.  —  Anton Lazzaro, a Republican strategist who targeted … ",
    "url": "https://www.thedailybeast.com/anton-lazzaro-gop-operative-who-sexually-abused-teen-girls-gets-21-years"
  },
  {
    "text": "The Churchillian Case Against a Trump Pardon  —  TL;DR: JVL in yesterday's Triad: Trump Pardon, Maybe.  CJS in today's Morning Shots: No f'ing way.  —  Happy Wednesday.  —  JVL makes what he describes as “The Keynesian Case for Pardoning Trump,” based on his reading of an intellectual biography of the legendary John Maynard Keynes.",
    "url": "https://morningshots.thebulwark.com/p/the-churchillian-case-against-a-trump"
  },
  {
    "text": "Arizona Republicans Don't Want to Hear About the Deadly Heat Wave  —  GOP lawmakers are brushing off the extreme heat — and any suggestion of climate change.  —  PHOENIX —  When Arizona lawmakers returned to the state Capitol here earlier this month, they started their day with a prayer to ease the scorching heat.",
    "url": "https://www.politico.com/news/magazine/2023/08/09/phoenix-heat-wave-republicans-00110325"
  },
  {
    "text": "Biden says he has ‘practically’ declared a climate emergency  —  President Biden in a new interview says he has ‘in practice’ declared a national climate emergency, though he has not actually announced such a declaration.  —  A national emergency declaration on climate change is a specific tool … ",
    "url": "https://thehill.com/policy/energy-environment/4145095-biden-says-he-has-practically-declared-a-climate-emergency/"
  },
  {
    "text": "Gaetz introduces bill seeking to codify right to pray in schools  —  Rep. Matt Gaetz (R-FL) is set to introduce a bill that would codify the right for students to pray in schools, building on a recent decision by the Supreme Court to allow people to pray in public on school grounds.",
    "url": "https://www.washingtonexaminer.com/news/house/gaetz-introduces-bill-codify-right-pray-schools"
  },
  {
    "text": "U.S. to Ban Some Investments in China  —  Biden's planned order will also require U.S. private-equity and venture-capital firms to disclose certain investments  —  The U.S. will ban private-equity and venture-capital investments in some Chinese technology companies starting next year under … ",
    "url": "https://www.wsj.com/articles/u-s-to-ban-some-investments-in-china-71f519d6?mod=djemalertNEWS"
  }
]