[
  {
    "text": "Poll: 49% of Independents think Trump should drop out post-guilty verdict … - 49% of Independents and 15% of Republicans said Trump should end his campaign because of the conviction.  — The polls found the race effectively tied nationally in a 1-on-1 with Biden at 45% and Trump at 44%.",
    "url": "https://www.axios.com/2024/06/01/poll-trump-conviction-election-independent-voters"
  },
  {
    "text": "Trump Has Few Ways to Overturn His Conviction as a New York Felon  —  New York appellate courts rarely overturn a jury decision without evidence of serious errors.  The judge in Donald J. Trump's case closed off many avenues.  —  “This is long from over,” Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/06/01/nyregion/trump-appeal-conviction.html"
  },
  {
    "text": "Republicans join Trump's attacks on justice system and campaign of vengeance after guilty verdict  —  Following his conviction in hush money case, Trump again slams ‘rigged trial’  —  Biden calls Trump's claims of a rigged trial ‘reckless... dangerous’ and ‘irresponsible’",
    "url": "https://apnews.com/article/trump-guilty-republicans-vengeance-a05db7fa2512a62afe035992f2baaf16"
  },
  {
    "text": "More than half of voters approve of Donald Trump's New York conviction  —  But a vast majority of Republicans want Trump to stay in the race against President Joe Biden, according to a new survey conducted after the jury's verdict … Many Americans support the New York jury's decision … ",
    "url": "https://pro.morningconsult.com/analysis/donald-trump-polling-guilty-verdict-jury-trial"
  },
  {
    "text": "Donald Trump's attorney was ‘shocked’ the former president took the verdict with ‘solemnness’  —  Donald Trump's lawyer told The Associated Press he was surprised at Trump's stoic demeanor as he listened to the verdict that made him the first former U.S. president convicted of a crime.",
    "url": "https://apnews.com/article/trump-todd-blanche-4361e2bd70c287f38ba68b920e13ff81"
  },
  {
    "text": "Plot twist: WA has a law against felons running for office  —  If local Republicans knew what was good for them, they would now move to drop Donald Trump from Washington's fall ballot.  —  I know, they won't.  They're in too deep.  Trump won 76% of our state's GOP presidential primary vote.",
    "url": "https://www.seattletimes.com/seattle-news/politics/plot-twist-for-trump-wa-has-a-law-against-felons-running-for-office/"
  },
  {
    "text": "Exclusive: Inside Hunter Biden's secret legal battle … - The trials — the gun case that starts Monday in Delaware and the tax case set for Sept. 5 in California — are likely to include embarrassing revelations about the Biden family that almost certainly will be touted by Republicans in light of Donald Trump's felony conviction.",
    "url": "https://www.axios.com/2024/06/01/hunter-biden-court-trial-2024-election"
  },
  {
    "text": "Michael Cohen Worries Trump Will Spill Secrets in Prison ‘for a Bag of Tuna’  —  EXIT INTERVIEWS  —  “If America turns against him, he would rather see America burned to the ground,” Cohen said.  —  Michael Cohen says he's “afraid” for national security if Donald Trump goes to prison.",
    "url": "https://www.thedailybeast.com/michael-cohen-worries-trump-will-spill-secrets-in-prison-for-a-bag-of-tuna"
  },
  {
    "text": "China makes historic landing on far side of the moon  —  China landed an uncrewed spacecraft on the far side of the moon on Sunday, a landmark mission which aims to retrieve rocks and soil from the lunar surface, China's space agency said.  —  The landing elevates China's space power status … ",
    "url": "https://www.reuters.com/technology/space/china-lands-uncrewed-spacecraft-far-side-moon-2024-06-01/"
  },
  {
    "text": "A Felon in the Oval Office Would Test the American System  —  The system of checks and balances established in the Constitution was meant to hold wayward presidents accountable, but some wonder how it will work if the next president is already a felon.  —  The revolutionary hero Patrick Henry knew this day would come.",
    "url": "https://www.nytimes.com/2024/06/02/us/politics/trump-presidency-checks-balances.html"
  },
  {
    "text": "As Hunter Biden's Trial Nears, President Biden Pulls Him Close  —  President Biden has weathered years of scandals surrounding his son.  But people close to both men say the president has refused to treat him as a political liability.  —  President Biden wakes up every day to a list of concerns he must address as commander in chief.",
    "url": "https://www.nytimes.com/2024/06/02/us/politics/as-hunter-bidens-trial-nears-president-biden-pulls-him-close.html"
  },
  {
    "text": "Trump's Conviction Renews Push to Strip His Name From a New York Park  —  Legislative efforts to rename Donald J. Trump State Park in northern Westchester County have failed so far, but some lawmakers want to try again.  —  Long before Donald J. Trump was president, New Yorkers were accustomed … ",
    "url": "https://www.nytimes.com/2024/05/31/nyregion/trump-park-taconic-ny.html"
  },
  {
    "text": "'He's Had Great Challenges': Giuliani Holds 80th Birthday Amid Many Woes  —  The indicted and increasingly isolated former New York mayor celebrated his birthday over pasta and meatballs.  Donald J. Trump sent a video.  —  Consider this Midtown split screen.",
    "url": "https://www.nytimes.com/2024/06/01/us/politics/rudy-giuliani-birthday-donald-trump-new-york.html"
  },
  {
    "text": "Donald Trump had lots of negative opinions about felons.  Now he is one.  —  From roughing up suspects to revoking bail, the 34-count felon has suggested harsh treatment for his fellow criminals  —  Donald Trump has spent years complaining that American police and the criminal legal system should be … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/01/donald-trump-crime-punishment"
  }
]