[
  {
    "text": "The Real “Robert Hur Report” (Versus What You Read in the News)  —  How the Special Counsel report has been misinterpreted  —  The Special Counsel Robert Hur report has been grossly mischaracterized by the press.  The report finds that the evidence of a knowing, willful violation of the criminal laws is wanting.",
    "url": "https://www.justsecurity.org/92090/the-real-robert-hur-report-versus-what-you-read-in-the-news/"
  },
  {
    "text": "Former FBI official: Similarities between Biden and Hillary Clinton reports ‘nauseating’  —  Former FBI Deputy Director Andrew McCabe argued Friday that the special counsel's report on President Biden's retention of classified documents while vice president has “nauseating similarities” … ",
    "url": "https://thehill.com/homenews/administration/4460524-former-fbi-official-similarities-between-biden-clinton-reports-nauseating/"
  },
  {
    "text": "Surviving Biden's Brain Freezes  —  As regular readers know, I've spent the last two years arguing here and in The New York Times that President Biden should not run for reelection.  Doing so is selfish, short-sighted in terms of securing his legacy, and wrong-headed, as he has admitted … ",
    "url": "https://oldgoats.substack.com/p/surviving-bidens-brain-freezes"
  },
  {
    "text": "Why the Age Issue Is Hurting Biden So Much More Than Trump  —  Both Donald J. Trump and President Biden are elderly men.  But voters are much less likely to worry that Mr. Trump is too old to serve.  —  Donald J. Trump has praised Hungary's prime minister, Viktor Orban, for his leadership of Turkey … ",
    "url": "https://www.nytimes.com/2024/02/10/us/politics/biden-trump-aging.html"
  },
  {
    "text": "February 9, 2024  —  Yesterday, Special Counsel Robert Hur, appointed by Attorney General Merrick Garland in January 2023 to investigate President Joe Biden's handling of classified documents before he was president, released his report.  It begins: “We conclude that no criminal charges are warranted in this matter.",
    "url": "https://heathercoxrichardson.substack.com/p/february-9-2024"
  },
  {
    "text": "The Question Is Not If Biden Should Step Aside.  It's How.  —  Joe Biden should not be running for re-election.  That much was obvious well before the special prosecutor's comments on the president's memory lapses inspired a burst of age-related angst.  And Democrats who are furious … ",
    "url": "https://www.nytimes.com/2024/02/10/opinion/joe-biden-convention-2024.html"
  },
  {
    "text": "Wisconsin Rep. Gallagher will not seek reelection  —  Rep. Mike Gallagher (R-Wisc.) announced Saturday that he will not seek reelection this fall after four terms in office.  —  Gallagher, the chair of the Select Committee on the Chinese Communist Party, released a statement via social media … ",
    "url": "https://thehill.com/homenews/house/4460632-wisconsin-rep-gallagher-will-not-seek-reelection/"
  },
  {
    "text": "Mike Gallagher Won't Seek Reelection After Refusal To Impeach Homeland Security Chief  —  U.S. Rep. Mike Gallagher says he won't run for a fifth term in Congress.  —  LOADING  —  U.S. Rep. Mike Gallagher, a key Republican Congressman who has spearheaded House pushback against the Chinese government … ",
    "url": "https://www.huffpost.com/entry/bc-us-gallagher-retirement_n_65c7db59e4b0fb721d614f76"
  },
  {
    "text": "Andy Kim sinks first lady Tammy Murphy in NJ Senate race's first Democratic convention  —  His victory shows he can get support of the rank-and-file Democrats he'll need to overcome Tammy Murphy's advantages.  —  LONG BRANCH, New Jersey — Rep. Andy Kim on Saturday won by a wide margin … ",
    "url": "https://www.politico.com/news/2024/02/10/andy-kim-tammy-murphy-nj-convention-00140832"
  },
  {
    "text": "Trump Says He Will Refuse to Honor NATO Treaty  —  Said enemies can “do whatever the hell they want”  —  At every rally, Trump loves to tell the story that references the only thing he knows about global security - the transactional relationship we have with our NATO allies.",
    "url": "https://www.meidastouch.com/news/trump-says-he-will-refuse-to-honor-nato-treaty"
  },
  {
    "text": "As Biden's memory issues draw attention, neurologists weigh in  —  Forgetting the names of acquaintances or having difficulty remembering dates from the past doesn't affect decision-making or judgment, brain experts say.  —  Since a report released on Thursday by special counsel Robert Hur … ",
    "url": "https://www.nbcnews.com/health/bidens-memory-issues-draw-attention-neurologists-weigh-rcna138135"
  },
  {
    "text": "Rosendale says he still loves Trump, despite endorsement of opponent  —  Matt Rosendale said he still loves former President Trump despite Trump's recent endorsement of Tim Sheehy, an opponent of the Montana Republican Senate candidate.  —  “I love President Trump,” Rosendale said in an interview … ",
    "url": "https://thehill.com/homenews/campaign/4460734-rosendale-says-he-still-loves-trump-despite-endorsement-of-opponent/"
  },
  {
    "text": "Trump bizarrely claims ‘they’ will change the name of the state of Pennsylvania if he loses it  — Donald Trump claimed Pennsylvania's name will change if he loses the state.  — Donald Trump seemed to allude to sites honoring historical figures that had been renamed.",
    "url": "https://www.businessinsider.com/trump-claimed-pennsylvanias-name-will-change-he-loses-the-state-2024-2"
  },
  {
    "text": "The hard truth is that Britain's entrepreneurs simply don't innovate  —  Billions in tax relief is showered on UK small businesses in the belief that they are transforming the economy.  They aren't  —  Entrepreneurs are a false god.  We offer them billions of pounds' worth of tax breaks and subsidies … ",
    "url": "https://www.theguardian.com/business/2024/feb/10/the-hard-truth-is-that-britains-entrepreneurs-simply-dont-innovate"
  },
  {
    "text": "History confirms Republicans rejected a once-in-a-lifetime immigration opportunity  —  Immigration politics may be the most important to winning and losing elections in America.  Add the substance around immigration reform and border security and it is one of the most complicated policy issues facing America as well.",
    "url": "https://thehill.com/opinion/immigration/4458612-history-confirms-republicans-rejected-a-once-in-a-lifetime-immigration-opportunity/"
  }
]