[
  {
    "text": "Elon Musk Backed Trump With Over $250 Million, Fueling the Unusual ‘RBG PAC’  —  The enormous spending from the world's richest man quietly fueled allied groups and was revealed only now, as Mr. Musk plays a key role in the presidential transition.  —  Elon Musk, the world's richest man … ",
    "url": "https://www.nytimes.com/2024/12/05/us/politics/elon-musk-trump-rbg-election.html?unlocked_article_code=1.fU4.tdM1.sEjWdyrognld&smid=url-share"
  },
  {
    "text": "Elon Musk spent a quarter-billion dollars electing Trump, including financing mysterious ‘RBG PAC’  —  The super PAC, which defended Trump on abortion, got its more than $20 million in funds came from the “Elon Musk Revocable Trust.”  —  Billionaire Elon Musk poured more than $20 million … ",
    "url": "https://www.nbcnews.com/politics/2024-election/elon-musk-spent-quarter-billion-dollars-electing-trump-financing-myste-rcna182922"
  },
  {
    "text": "Biden Team Considers Blanket Pardons Before Trump's Promised ‘Retribution’  —  White House officials believe President-elect Donald J. Trump's selection of partisan warriors for top law enforcement jobs indicates that he will pursue revenge against his perceived enemies.",
    "url": "https://www.nytimes.com/2024/12/05/us/politics/biden-trump-pardons.html"
  },
  {
    "text": "House Republicans vote to block release of Gaetz ethics report  —  House Republicans voted on Thursday to block a Democrat-led effort to release a long-awaited Ethics Committee report on allegations against former GOP Rep. Matt Gaetz of Florida.  —  The House took a step to effectively shut … ",
    "url": "https://www.cnn.com/2024/12/05/politics/house-vote-matt-gaetz-ethics-report"
  },
  {
    "text": "Playbook: Inside the generational fight roiling Democrats  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  END OF AN ERA, PART I — “Goodbye to the American Century?” by Joshua Zeitz: “The post-WWII world order of American dominance is over.  DONALD TRUMP proves it.”",
    "url": "https://www.politico.com/newsletters/playbook/2024/12/06/inside-the-generational-fight-roiling-democrats-00192977"
  },
  {
    "text": "Hegseth says he won't withdraw as he struggles as Trump's Defense pick  —  “As long as Donald Trump wants me in this fight, I'm going to be standing right here in this fight,” he said.  —  Pete Hegseth spent this week attempting to woo senators — and others — as he fought to remain Donald Trump's pick for secretary of Defense.",
    "url": "https://www.politico.com/news/2024/12/05/hegseth-senate-nomination-00192919"
  },
  {
    "text": "Why I Just Resigned From The Los Angeles Times  —  I have been a contributor to the Los Angeles Times op-ed page in some fashion for more than 15 years.  For the last three years, I have been the Senior Legal Columnist, writing regular weekly columns about Trump's legal troubles, the Supreme Court, and a wide range of other topics.",
    "url": "https://harrylitman.substack.com/p/why-i-just-resigned-from-the-los"
  },
  {
    "text": "Trump names ICE chief and makes another round of immigration announcements  —  President-elect Donald Trump on Thursday night announced a new round of nominees and appointments to tackle his aggressive immigration and homeland security agenda.  Trump said he was nominating Rodney Scott as commissioner of Customs and Border Protection.",
    "url": "https://www.politico.com/live-updates/2024/12/05/congress/trump-ice-chief-rodney-scott-00192974"
  },
  {
    "text": "Trump picks David Perdue to be ambassador to China  —  Donald Trump has selected former Georgia Sen. David Perdue to serve as ambassador to China.  Perdue has significant business experience in Asia, including China, something he ran on during his Senate election in 2014.",
    "url": "https://www.politico.com/live-updates/2024/12/05/congress/perdue-to-china-00192969"
  },
  {
    "text": "Anthem Blue Cross Blue Shield calls off surgery anesthesia cap … - The decision covered plans in Connecticut, New York and Missouri.  — The insurer had based the decision on surgery time metrics from the Centers for Medicare and Medicaid Services, NPR reported.",
    "url": "https://www.axios.com/2024/12/05/blue-cross-blue-shield-anesthesia-anthem-connecticut"
  },
  {
    "text": "Trump names his own pick for IRS commissioner, breaking from tradition  —  With the choice of former congressman Billy Long, Trump apparently plans to oust Danny Werfel, who is partway through his five-year appointment.  —  With his announcement late Wednesday that he'll appoint former … ",
    "url": "https://www.washingtonpost.com/business/2024/12/05/billy-long-irs-commissioner-trump/"
  },
  {
    "text": "What if everyone had masked up?  Analysis of app data has an answer … What would have happened if everyone in the United Kingdom had worn high-grade masks during the COVID-19 pandemic?  A modelling study 1 has estimated just how sharply transmission might have dropped.  —  Access options",
    "url": "https://www.nature.com/articles/d41586-024-03976-0"
  },
  {
    "text": "12/6/24 ☀️ AM:  —  The Senate Dems holding their fire on Trump's noms  —  The Vault: Johnson says he hasn't committed on reconciliation strategy  —  House Republicans are heading to New York City  —  The Senate Dems holding their fire on Trump's noms",
    "url": "https://punchbowl.news/archive/12624-am/"
  },
  {
    "text": "Trump's Fans Are Suffering From Tony Soprano Syndrome  —  Some conservatives are embracing the villains in what are supposed to be cautionary tales.  —  In every Judge Joe Dredd story I've ever read, there is at least one almost comically obvious moment when the author makes clear … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/12/elon-musk-judge-dredd-autocrat/680881/?gift=Je3D9AQS-C17lUTOnl2W8CBSmuV2OiRdoa9ckmQzxaU&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Torrent of Hate for Health Insurance Industry Follows C.E.O.'s Killing  —  The shooting death of a UnitedHealthcare executive in Manhattan has unleashed Americans' frustrations with an industry that often denies coverage and reimbursement for medical claims.",
    "url": "https://www.nytimes.com/2024/12/05/nyregion/social-media-insurance-industry-brian-thompson.html?unlocked_article_code=1.fE4.fm3v.Yzd8hJFtI4Xu&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Hungarian CIA reportedly spied on EU officials  —  Hungary's intelligence agency spied on EU officials visiting the country, searching their hotel rooms and recording their phone conversations, according to a bombshell report.  —  A joint investigation by Direkt36 and De Tijd found Hungary's … ",
    "url": "https://www.politico.eu/article/hungary-viktor-orban-cia-spy-wiretap-hack-laptop-eu-officials-information-office-budapest-olaf/"
  },
  {
    "text": "Trump Claims a ‘Historic’ Mandate.  Polls Show Americans Have Mixed Feelings.  —  The public may have more nuanced views on issues like tariffs and mass deportations than it might seem at first blush.  —  President-elect Donald J. Trump and his allies have declared that his incoming administration has an … ",
    "url": "https://www.nytimes.com/2024/12/06/us/elections/trump-tariffs-deportations-polls.html"
  },
  {
    "text": "Raw milk CEO whose products have been recalled may lead US raw milk policy  —  Mark McAfee, whose products have been repeatedly contaminated with bird flu, asked by RJK Jr to apply for job  —  Mark McAfee, a California raw milk producer whose products have been recalled several times recently due … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/05/mark-mcafee-raw-milk-bird-flu-rfk"
  },
  {
    "text": "A Bipartisan Slippage in Standards  —  Biden's pardon of Hunter is as disconcerting as Trump's more exotic administration nominees.  —  We're seeing bipartisan slippage of standards.  —  It is embarrassing as a citizen to see the president of the United States pardon his son … ",
    "url": "https://www.wsj.com/opinion/bipartisan-slippage-of-standards-biden-pardon-hunter-trump-unusual-administration-nominees-289e0952?st=mvEjpV&reflink=article_copyURL_share"
  },
  {
    "text": "Tulsi Gabbard's Own Ex-Staffers Expose Her as a Russian Stooge  —  Tulsi Gabbard's ex-aides say that the former congresswoman, whom Donald Trump has nominated as the next director of national intelligence, used to regularly consume Russian state media.  —  ABC News, citing interviews … ",
    "url": "https://newrepublic.com/post/189066/tulsi-gabbard-russian-media-stooge"
  }
]