[
  {
    "text": "Judge rescinds permission for Trump to give his own closing argument at his civil fraud trial  —  NEW YORK (AP) — Donald Trump won't make his own closing argument in his New York civil business fraud trial after his lawyers objected to the judge's insistence that the former president would stick to “relevant” matters.",
    "url": "https://apnews.com/article/trump-fraud-trial-closing-arguments-420997f889922423dbce8a0945f0c348"
  },
  {
    "text": "Chris Christie to Exit 2024 Race Days Before Iowa Republican Caucus  — Christie was most stridently anti-Trump candidate in GOP race  — Exit could boost Haley in bid to be Trump's top challenger  —  Former New Jersey Governor Chris Christie is ending his long-shot 2024 campaign … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-10/christie-to-exit-2024-race-days-before-iowa-republican-caucus"
  },
  {
    "text": "Trump vowed he'd ‘never’ help Europe if it's attacked, top EU official says  —  ‘By the way NATO is dead,’ the former (and potential future) US president added in private meeting.  —  BRUSSELS — One of Europe's most senior politicians recounted how former U.S. President Donald Trump privately warned … ",
    "url": "https://www.politico.eu/article/donald-trump-vow-never-help-europe-attack-thierry-breton/"
  },
  {
    "text": "Chris Christie ends 2024 presidential campaign  —  Former New Jersey Gov. Chris Christie announced Wednesday that he is ending his campaign for the 2024 Republican presidential nomination, marking the exit of the most outspoken critic of former President Donald Trump in the GOP primary.",
    "url": "https://www.cnn.com/2024/01/10/politics/chris-christie-ends-presidential-campaign-2024/"
  },
  {
    "text": "Trump promotes ‘totally baseless’ birther conspiracy theory against Nikki Haley  —  The former U.N. ambassador was born in South Carolina and is a U.S. citizen.  —  DES MOINES, Iowa — Donald Trump, the chief propagator of false birther claims first against then-President Barack Obama … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-promotes-baseless-birther-conspiracy-theory-nikki-haley-rcna133166"
  },
  {
    "text": "Hunter Biden makes surprise appearance at House contempt hearing  —  President's son also made an unexpected appearance last December to blast House Republicans who have subpoenaed him  —  Hunter Biden made an unexpected appearance on Capitol Hill on Wednesday morning … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/10/biden-surprise-appearance-contempt-hearing/"
  },
  {
    "text": "Mike Johnson urges fellow Republicans to leave him alone on social media … - Facing a Jan. 19 deadline, some hardliners have said they are not opposed to shutting down the government in an attempt to get more concessions.  — Democrats have noted that Republicans have very little leverage due … ",
    "url": "https://www.axios.com/2024/01/10/mike-johnson-budget-republicans-social-media"
  },
  {
    "text": "PA 2024 Elections: Biden On Upside Of Too-Close-To-Call Race, Quinnipiac University Pennsylvania Poll Finds; Casey Opens Up Double-Digit Lead In Senate Race  —  mail_outline  —  In the key swing state of Pennsylvania, President Joe Biden and former President Donald Trump remain in a too-close … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3888"
  },
  {
    "text": "Biden holding private meetings at White House to reassure supporters  —  The sessions are designed in part to quell concerns about Biden's age and energy level  —  President Biden has been holding private lunches at the White House with top donors and other supporters as part of an effort … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/10/biden-holding-private-meetings-white-house-reassure-supporters/"
  },
  {
    "text": "Conservatives take revenge for Johnson's spending deal by halting action on House floor  —  They're looking for ways to punish GOP leadership, even if they're not yet willing to boot the speaker.",
    "url": "https://www.politico.com/live-updates/2024/01/10/congress/house-floors-shut-down-00134812"
  },
  {
    "text": "Republican governors in 15 states reject summer food money for kids  —  Moving beyond efforts to block expansion of health care for the poor and disabled, Republican governors in 15 states are now rejecting a new, federally funded summer program to give food assistance to hungry children.",
    "url": "https://www.washingtonpost.com/nation/2024/01/10/republican-governors-summer-lunch-program/"
  },
  {
    "text": "Rep. Marjorie Taylor Greene files complaint about Georgia prosecutor who charged Trump  —  A co-defendant in Trump's case has alleged the prosecutor improperly benefited from the hiring of an outside attorney on the case.  —  WASHINGTON — Rep. Marjorie Taylor Greene, R-Ga. … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/rep-marjorie-taylor-greene-files-complaint-georgia-prosecutor-charging-rcna133312"
  },
  {
    "text": "Record 20M sign up for ACA coverage  —  ObamaCare breaks records  —  More than 20 million people have signed up for insurance plans on the Affordable Care Act's (ACA) health exchanges, blowing past last year's previous record of 16 million.  —  © Getty",
    "url": "https://thehill.com/newsletters/health-care/4401518-record-20m-sign-up-for-aca-coverage/"
  },
  {
    "text": "US verges on vaccination tipping point, faces thousands of needless deaths: FDA  —  Top regulatory officials call for clinicians to speak up and drown out misinformation.  —  The US may be heading to a “dangerous vaccination tipping point,” with immunization rates falling so low … ",
    "url": "https://arstechnica.com/science/2024/01/anti-vaccine-nonsense-will-likely-kill-thousands-this-season-fda-officials-say/"
  },
  {
    "text": "Florida school district removes dictionaries from libraries, citing law championed by DeSantis  —  The Escambia County School District, located in the Florida panhandle, has removed several dictionaries from its library shelves over concerns that making the dictionaries available to students would violate Florida law.",
    "url": "https://popular.info/p/florida-school-district-removes-dictionaries"
  },
  {
    "text": "SEC approves rule changes that pave the way for bitcoin ETFs  — The approval could prove to be a landmark event in the adoption of cryptocurrency by mainstream finance.  — The decision will likely lead to the conversion of the Grayscale Bitcoin Trust, which holds about $29 billion of the cryptocurrency, into an ETF.",
    "url": "https://www.cnbc.com/2024/01/10/sec-approves-rule-changes-that-pave-the-way-for-bitcoin-etfs.html"
  },
  {
    "text": "GOP AGs Urging Impeachment Of Secretary Mayorkas Squirm When Asked About Trump  —  “I'm just a simple attorney general from Oklahoma,” said Genter Drummond when Rep. Eric Swalwell (D-Calif.) asked if Trump's conduct warranted impeachment.  —  LOADING  —  WASHINGTON ― Rep. Eric Swalwell … ",
    "url": "https://www.huffpost.com/entry/republican-attorneys-general-mayorkas-impeach-trump_n_659ef3cce4b0712b12c36a32"
  }
]