[
  {
    "text": "Verdict reached in E. Jean Carroll's defamation damages trial against Trump  —  The verdict comes after a dramatic day in court that included the former president storming out of the courtroom during Carroll's closing argument.  —  The jury in E. Jean Carroll's defamation damages trial … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/verdict-reached-e-jean-carrolls-defamation-damages-trial-trump-rcna135919"
  },
  {
    "text": "Judge Threatens to Send Trump Lawyer Alina Habba ‘in the Lockup’ at E. Jean Carroll Trial  —  The blockbuster remark came moments before closing arguments in Trump's second trial in a case brought by E. Jean Carroll  —  A federal judge threatened Donald Trump's attorney Alina Habba with jail time on Friday … ",
    "url": "https://themessenger.com/politics/trump-alina-habba-jail-e-jean-carroll-federal-judge-threat"
  },
  {
    "text": "Donald Trump storms out of closing arguments in E Jean Carroll trial  —  The former president continued to attack the woman suing him for defamation after his testimony on Thursday  —  Why is Donald Trump back in court against E. Jean Carroll?  —  Roughly 20 minutes after walking into the courtroom … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-storms-out-court-carroll-trial-b2485495.html"
  },
  {
    "text": "Judge threatens to send Trump attorney Alina Habba to jail over interruptions  —  U.S. District Judge Lewis Kaplan, the federal judge overseeing former President Trump's defamation trial brought by columnist E. Jean Carroll, threatened to send Trump attorney Alina Habba to jail after she interrupted him during Friday's proceedings.",
    "url": "https://thehill.com/regulation/court-battles/4431893-judge-threatens-to-send-trump-attorney-alina-habba-to-jail-over-interruptions/"
  },
  {
    "text": "E. Jean Carroll defamation case live updates: ‘He is not the victim,’ Carroll's attorney says of Trump  —  The trial will determine if Trump owes any more for defaming E. Jean Carroll.  —  Former President Donald Trump is on trial this week in New York City to determine whether … ",
    "url": "https://abcnews.go.com/US/live-updates/trump-defamation-trial/?id=106403966"
  },
  {
    "text": "Trump's border power play is a push for civil war  —  Donald Trump wants Congress to refuse to do any deal until he can win and create the “PERFECT” border  —  Donald Trump is having a rolling hissy fit that's escalating by the day.  From courtrooms to rallies to incoherent interviews … ",
    "url": "https://www.salon.com/2024/01/26/donald-border-powerplay-is-a-push-for-civil/"
  },
  {
    "text": "Biden needles Trump in hopes of pushing him off message  —  Three words from Joe Biden's somber speech about Donald Trump had one man in the back of Charleston's Mother Emanuel AME Church the most excited: “He's a loser.”  —  The man, cracking up, poked the woman next to him with a “Can you believe it?” expression on his face.",
    "url": "https://www.cnn.com/2024/01/26/politics/biden-taunts-trump-2024/"
  },
  {
    "text": "Protest Convoy Headed to Southern Border Is Calling Itself an ‘Army of God’  —  Experts say that the Christian nationalist rhetoric adds a dangerous dimension to the standoff between Texas and the Federal Government.  —  A trucker convoy of “patriots” is heading to the U.S. border with Mexico next week … ",
    "url": "https://www.vice.com/en/article/5d9adk/trucker-convoy-eagle-pass-texas-border-dispute-christian-nationalism"
  },
  {
    "text": "Border standoff between Texas, feds intensifies as governor defies Supreme Court ruling  —  This week, the Supreme Court sided with federal agents to remove razor wire put in place by Texas along the Rio Grande.  The state is using wire and state agents to block Border Patrol from accessing a section of the border in Eagle Pass.",
    "url": "https://www.pbs.org/newshour/show/border-standoff-between-texas-feds-intensifies-as-governor-defies-supreme-court-ruling"
  },
  {
    "text": "Trump Calls on ‘All Willing States’ to Send National Guard Soldiers to Texas  —  Sorry, were you expecting the former president to tell everyone to chill out?  —  Like pouring water on a grease fire, former President Donald Trump has weighed in on the escalating standoff between the federal government and Texas.",
    "url": "https://www.vice.com/en/article/epv7p7/trump-national-guard-texas-border-dispute-federal-government-standoff"
  },
  {
    "text": "DOJ accuses Andrew Cuomo of sexually harassing 13 women  —  The former governor's lawyer says he was never interviewed.  —  ALBANY, New York — Former New York Gov. Andrew Cuomo sexually harassed 13 women who worked for the state over the course of an eight-year period … ",
    "url": "https://www.politico.com/news/2024/01/26/cuomo-sexual-harassment-doj-00138140"
  },
  {
    "text": "U.S. pauses funding to UNRWA after 12 staffers accused of involvement in Oct. 7 attack … - State Department spokesperson Matthew Miller said the U.S. is “extremely troubled by the allegations” and the administration has “temporarily paused additional funding for UNRWA while we review … ",
    "url": "https://www.axios.com/2024/01/26/unrwa-gaza-hamas-israel-attack"
  },
  {
    "text": "API on LNG Permit Pause: A ‘Win for Russia’ and ‘Broken Promise to U.S. Allies’  —  The American Petroleum Institute (API) today released the following statement from President and CEO Mike Sommers on the Biden administration's announcement to pause approvals of new LNG export facilities … ",
    "url": "https://www.api.org/news-policy-and-issues/news/2024/01/24/api-statement-on-reported-plans-to-restrict-us-lng"
  },
  {
    "text": "Trump's Court-Appointed Monitor Tells Judge Company Gave ‘Incomplete’ and ‘Inconsistent’ Disclosures with ‘Errors’  —  Court monitor Barbara Jones sent her letter to Justice Engoron, who will determine whether to ban Trump from New York real estate for life  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-barbara-jones-incomplete-inconsistent-disclosures-errors"
  },
  {
    "text": "Mainstream media bloodbath: News outlets slash jobs as business suffers  —  Nearly a dozen mainstream media companies are gutting staff and scrambling to rescue their struggling businesses. … But an ongoing bloodbath is decimating news outlets nationwide.",
    "url": "https://www.axios.com/2024/01/26/media-layoffs-strikes-journalism-dying"
  },
  {
    "text": "Ex-coal CEO who called himself ‘Trumpier than Trump’ launches Democratic Senate bid in West Virginia  —  A former CEO of a coal company who once said he is “Trumpier than Trump” has launched a bid for Senate as a Democrat in West Virginia.  —  Don Blankenship, who previously ran … ",
    "url": "https://thehill.com/homenews/campaign/4431661-coal-blankenship-trumpier-than-trump-democratic-senate-west-virginia/"
  },
  {
    "text": "Scott hammers Democratic opponent as ‘liar’ over abortion attack  —  Sen. Rick Scott (R-Fla.), who is up for reelection this fall, says his Democratic challenger is a “liar” after she accused the first-term senator of supporting a national abortion ban, a charge that Democratic candidates … ",
    "url": "https://thehill.com/homenews/campaign/4431558-scott-hammers-democratic-opponent-as-liar-over-abortion-attack/"
  },
  {
    "text": "Speaker Johnson: Senate border deal ‘dead on arrival’ in House  —  Speaker Mike Johnson (R-La.) said in a Friday letter to his colleagues that Senate legislation addressing the border and aid to Ukraine and other countries would have been “dead on arrival” in the House, if reports about its terms are true.",
    "url": "https://thehill.com/homenews/house/4431375-speaker-johnson-senate-border-deal-dead-on-arrival-in-house/"
  }
]