[
  {
    "text": "Exclusive: Georgia prosecutors have messages showing Trump's team is behind voting system breach  —  Atlanta-area prosecutors investigating efforts to overturn the 2020 election results in Georgia are in possession of text messages and emails directly connecting members of Donald Trump's legal team … ",
    "url": "https://www.cnn.com/2023/08/13/politics/coffee-county-georgia-voting-system-breach-trump/"
  },
  {
    "text": "Trump's ‘Co-Conspirators’ Are Already Starting to Turn on Each Other  —  “It is the 'please don't put me in jail, put that other guy in jail' strategy,” says one attorney working in Trump's legal orbit … A number of the ex-president's chief lieutenants and alleged co-conspirators in the plot … ",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-jack-smith-coconspirators-rudy-giuliani-1234806292/"
  },
  {
    "text": "‘Fully expected the downfall’: Inside DeSantis's brawls with Fla. Republicans  —  Some who knew the Florida governor in Tallahassee say they expected him to have trouble translating his governance of the state into a coalition that could win him the presidency",
    "url": "https://www.washingtonpost.com/politics/2023/08/14/desantis-florida-republicans-2024-election/"
  },
  {
    "text": "Newsom vs. DeSantis debate stalling over Fox News audience  —  The California Democrat and Florida Republican agreed to the debate, but hit a stalemate over the network hosting a live studio audience.  —  Gavin Newsom and Ron DeSantis have reached an impasse in their Fox News debate planned for November … ",
    "url": "https://www.politico.com/news/2023/08/14/ron-desantis-gavin-newsom-debate-fox-news-00111001"
  },
  {
    "text": "In a small Kansas town, a brazen attack on press freedom  —  “These are Hitler tactics, and something has to be done.”  —  Those were the words of 98-year-old Joan Meyer, the co-owner of the Marion County Record, after her home and office were raided by the City of Marion's entire five-person police department on Friday.",
    "url": "https://popular.info/p/in-a-small-kansas-town-a-brazen-attack"
  },
  {
    "text": "GOP sees turnout disaster without Trump  —  Republican strategists are worried that if former President Trump doesn't secure the GOP's presidential nomination next year, or if he is kept off the ballot because of his mounting legal problems, it could spell a voter turnout disaster for their party in 2024.",
    "url": "https://thehill.com/homenews/senate/4149548-gop-sees-turnout-disaster-without-trump/"
  },
  {
    "text": "RFK Jr. says he'd sign a federal ban on abortions after three months of pregnancy  —  The stance puts Kennedy — who's mounting long shot bid to unseat President Joe Biden as the Democratic standard bearer in 2024 — out of step with most of his party.  —  DES MOINES, IOWA … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-says-sign-federal-ban-abortions-three-months-pregnancy-rcna99689"
  },
  {
    "text": "Playbook: Another week, another indictment?  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  NEW JMART — Jonathan Martin goes long — 5,000 words! — on MITCH McCONNELL's (perhaps) final mission: thwarting DONALD TRUMP and aiding Ukraine.",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/14/another-week-another-indictment-00111034"
  },
  {
    "text": "PEPFAR and the death knell of bipartisan cooperation  —  Fighting HIV is now a front in the culture war, showing how the GOP has degraded since the Bush era.  —  ∙ Paid … By Lisa Needham  —  George W. Bush didn't do a lot right in his presidency.",
    "url": "https://www.publicnotice.co/p/pepfar-hiv-aids-george-w-bush-explained"
  },
  {
    "text": "Trump's Bid to Sink the Manhattan DA's Case Has Already Made It Stronger  —  Trump tried to drag the Manhattan DA into federal court and failed.  Now a judge's order in that case can be used to persuade a state court that Trump's charges should stick.  —  Donald Trump's attempts this summer … ",
    "url": "https://www.thedailybeast.com/trumps-bid-to-sink-the-manhattan-da-alvin-braggs-case-has-already-made-it-stronger"
  },
  {
    "text": "GOP candidates prepare for the possibility Trump shows up at the debate after all  —  The former president — often known for his unpredictability — has said he's leaning toward not going, but his GOP rivals are still holding debate prep sessions as if he will be there.",
    "url": "https://www.nbcnews.com/politics/2024-election/gop-candidates-prepare-possibility-trump-first-debate-rcna99351"
  },
  {
    "text": "Rep. Greg Steube introduces impeachment articles against President Joe Biden  —  A Florida Congressman has introduced impeachment articles against President Joe Biden, coming as the first member of his Republican party colleagues to jump-start the process.  —  Rep. Greg Steube (R-FL) … ",
    "url": "https://www.washingtonexaminer.com/news/house/republican-congressman-introduces-impeachment-articles-biden"
  },
  {
    "text": "Massachusetts passed a 4% millionaire's tax last year.  Now every public-school student is going to get free lunch.  — Massachusetts passed a 4% tax on people who make more than $1 million a year.  — Revenue from the new income tax is being used to give kids lunch and breakfast at school.",
    "url": "https://www.businessinsider.com/massachusetts-millionaire-tax-gets-kids-free-school-lunches-2023-8?op=1"
  },
  {
    "text": "White House steps up judicial confirmation efforts after slowdown  —  Good morning, Early Birds.  Our thoughts continue to be with the people of Maui.  Sen. Mazie Hirono (D-Hawaii) offered one small sign of hope over the weekend.  Tips: earlytips@washpost.com.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/08/14/white-house-steps-up-judicial-confirmation-efforts-after-slowdown/"
  },
  {
    "text": "Why Are So Many of Trump's Alleged Co-Conspirators Lawyers?  —  Deborah Pearlstein is a professor of constitutional law.  —  The second federal indictment of Donald Trump describes conduct that posed a profound threat to our constitutional democracy — conduct that deserves serious punishment if proven.",
    "url": "https://www.nytimes.com/2023/08/14/opinion/trump-indictment-lawyers.html"
  }
]