[
  {
    "text": "Scoop: Trump personally squeezes senators on Matt Gaetz … - “He clearly wants Matt Gaetz,” said Sen. Kevin Cramer (R-N.D.), who received a call from Trump. … - “One thing about Donald Trump, people should never confuse his support for one of his nominees as a tactical or strategic tool for somebody else,” Cramer said.",
    "url": "https://www.axios.com/2024/11/18/trump-gaetz-confirmation-senate"
  },
  {
    "text": "Negative signs for Gaetz as senators brush off questions amid Trump pressure  —  A negative sign looms for Matt Gaetz: Nearly a dozen GOP senators won't commit to confirming him for attorney general, saying they want to let the process play out.  And many, even if they aren't insisting … ",
    "url": "https://www.politico.com/live-updates/2024/11/18/congress/gop-senators-on-gaetz-ethics-report-00190295"
  },
  {
    "text": "Gaetz May Not Be Confirmed, Trump Admits.  He's Pushing Him and Others Anyway.  —  The president-elect is taking a flood-the-zone approach to his cabinet nominations, betting that the Senate won't dare to turn them all down.  —  In his private conversations over the past few days … ",
    "url": "https://www.nytimes.com/2024/11/18/us/politics/trump-cabinet.html"
  },
  {
    "text": "Mace introduces bill to bar trans women from Capitol restrooms  —  Rep. Nancy Mace (R-S.C.) on Monday introduced a bill to bar transgender women from facilities on Capitol Hill that match their gender identity.  —  The resolution, which would prohibit members, officers and employees … ",
    "url": "https://thehill.com/homenews/house/4997024-mace-introduces-bill-transgender/"
  },
  {
    "text": "Republican Bill Targets Sarah McBride From Using Women's Restrooms in the Capitol  —  Rep. Nancy Mace authored the bill and said McBride, who is trans, should “use the men's restroom.”  — Copy  —  Some Republicans are officially moving to give Rep.-elect Sarah McBride an unwelcome arrival to the House.",
    "url": "https://www.notus.org/congress/sarah-mcbride-nancy-mace-republicans"
  },
  {
    "text": "WATCH: Megyn Kelly Unleashes the Hounds of Hell on Mika Brzezinski and Joe Scarborough  —  Megyn Kelly offered up a simple three-word response to MSNBC's “Morning Joe” co-hosts Joe Scarborough and Mika Brzezinski visiting Donald Trump at Mar-a-Lago over the weekend.  —  “Go f**k yourselves,” she fired back.",
    "url": "https://redstate.com/rusty-weiss/2024/11/18/megyn-kelly-unleashes-the-hounds-of-hell-on-mika-brzezinski-and-joe-scarborough-n2182168"
  },
  {
    "text": "Lawyer tells ABC News his 2 clients told House Ethics Committee that Gaetz paid them for sex  —  Trump has tapped Gaetz, a former congressman, to be the new attorney general.  —  Rep. Matt Gaetz departs after speaking during the Conservative Political Action Conference, CPAC 2024 … ",
    "url": "https://abcnews.go.com/US/lawyer-tells-abc-news-2-clients-told-house/story?id=115863675"
  },
  {
    "text": "Two women testified that Matt Gaetz paid them for sex, lawyer says  —  An attorney representing two witnesses in the House Ethics Committee investigation goes public  —  A woman testified to the House Ethics Committee that former Rep. Matt Gaetz paid her for sex and that she witnessed … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/18/matt-gaetz-ethics-report-allegations/"
  },
  {
    "text": "Trump nominates former Rep. Sean Duffy as transportation secretary  —  President-elect Donald Trump nominated former Rep. Sean Duffy as transportation secretary.  —  After appearing on several reality TV shows, on which he met his wife, Duffy served as a district attorney in Wisconsin from 2002 to 2010.",
    "url": "https://www.washingtonexaminer.com/news/white-house/3234060/trump-nominates-sean-duffy-transportation-secretary/"
  },
  {
    "text": "Trump Reminds Everyone: He Wants US Soldiers in US Streets  —  At 4:03 a.m. ET, the President-elect was online.  He was thinking about “military assets” and mass deportations.  —  Tom Fitton, the right-wing activist and Judicial Watch leader, had written a post on the incoming President's … ",
    "url": "https://talkingpointsmemo.com/news/trump-reminds-everyone-he-wants-us-soldiers-in-us-streets"
  },
  {
    "text": "Dan Osborn Wants to Help the Working Class Run for Office  —  Mr. Osborn, the industrial mechanic who turned a long-shot Senate bid in red Nebraska into an unexpectedly tight race, is starting a PAC aimed at recruiting more blue-collar candidates like himself.",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/dan-osborn-working-class-pac.html"
  },
  {
    "text": "For Minority Working-Class Voters, Dismay in Democrats Led to Distrust  —  In scores of interviews throughout 2024, Latino, Black and Asian American voters, many of whom voted for Donald Trump, said they no longer trusted Democrats to improve the economy.  —  The working-class voters Vice … ",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/trump-working-class-voters.html"
  },
  {
    "text": "Leak it like Sam Alito  —  What is obviously a very damning report about Matt Gaetz is now available for everyone on the Ethics Committee to view: … Guest's claims to be free of influence from leadership are the antithesis of credible.  But it shouldn't matter.",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/11/leak-it-like-sam-alito"
  },
  {
    "text": "The first task for Musk's Department of Government Efficiency  —  President-elect Donald Trump has appointed Elon Musk and former presidential candidate Vivek Ramaswamy to head the Department of Government Efficency.  Despite the name, it is not a government department.  In fact, it is not part of the government at all.",
    "url": "https://popular.info/p/the-first-task-for-musks-department"
  },
  {
    "text": "RFK Jr. is a massive public health threat  —  Dems like Jared Polis shouldn't pretend pretend otherwise.  —  ∙ Paid … Donald Trump, in his vacuous orange wisdom, has nominated vaccine denier, crank, and champion of disease Robert F. Kennedy Jr. to be the Secretary of Health and Human Services (HHS).",
    "url": "https://www.publicnotice.co/p/rfk-jr-public-health-threat-vaccines"
  },
  {
    "text": "How UnitedHealth's Playbook for Limiting Mental Health Coverage Puts Countless Americans' Treatment at Risk  —  America's Mental Barrier: How Insurers Interfere With Mental Health Care  — An Insurer Sanctioned: Three states found United's algorithmic system to limit mental health coverage illegal … ",
    "url": "https://www.propublica.org/article/unitedhealth-mental-health-care-denied-illegal-algorithm"
  },
  {
    "text": "Judge strikes down Wyoming abortion laws, including an explicit ban on pills to end pregnancy  —  Cheyenne, Wyoming AP  —  A state judge on Monday struck down Wyoming's overall ban on abortion and its first-in-the-nation explicit prohibition on the use of medication to end pregnancy.",
    "url": "https://www.cnn.com/2024/11/18/politics/wyoming-abortion-laws-struck-down"
  },
  {
    "text": "Throwback: Trump 2.0 is boosting some old economic ideas  —  The new world of policy debate reflects Trump's towering influence over a GOP that he has transformed, boosting ideas once considered quixotic or ill-advised in Washington.  —  Donald Trump has been president before … ",
    "url": "https://www.politico.com/news/2024/11/19/trump-unusual-economic-ideas-00189559"
  },
  {
    "text": "Trump receives intelligence briefings, continues to roll out Cabinet picks  —  As he prepares for a return to the White House, President-elect Donald Trump has begun receiving intelligence briefings, U.S. officials said.  The briefings provided by the Office of the Director … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/19/trump-administration-transition/"
  },
  {
    "text": "O'Malley resigns from Social Security Administration to run for DNC chair  —  O'Malley's candidacy to lead the committee comes at a time of soul-searching and finger-pointing in the wake of Donald Trump's presidential victory  —  Former Maryland Gov. Martin O'Malley is resigning … ",
    "url": "https://www.thebaltimorebanner.com/politics-power/national-politics/martin-omalley-dnc-trump-maryland-biden-7RNR5TV6PFDQ5CKUYG5WMR546A/"
  }
]