[
  {
    "text": "Obama tells allies Biden needs to seriously consider his viability  —  The former president, hugely influential in the party, has told associates that Biden's path to victory has significantly shrunk.  —  Former president Barack Obama has told allies in recent days that President Biden's path … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/18/obama-says-biden-must-consider-viability/"
  },
  {
    "text": "Behind the Curtain: Top Dems now believe Biden will exit … - The president is being told that if he stays in, former President Trump could win in a landslide and wipe away Biden's legacy and Democrats' hopes in November. … - Democrats fully expect polls after the Republican National Convention … ",
    "url": "https://www.axios.com/2024/07/18/president-biden-drop-out-election-democrats"
  },
  {
    "text": "Pelosi privately told Biden polls show he cannot win and will take down the House; Biden responded with defensiveness  —  Former House Speaker Nancy Pelosi privately told President Joe Biden in a recent conversation that polling shows that the president cannot defeat Donald Trump and that Biden … ",
    "url": "https://www.cnn.com/2024/07/17/politics/nancy-pelosi-biden-conversation/"
  },
  {
    "text": "'We're close to the end': Biden world braces for the possibility that the president steps aside  —  As Trump is about to give a major speech accepting the GOP nomination for president, Biden is off the campaign trail with COVID.  —  WASHINGTON — President Joe Biden's political world is collapsing.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-world-braces-possibility-president-steps-rcna162494"
  },
  {
    "text": "Democratic delegates erupt over Biden's nomination in private chats  —  Messages shared between Democratic delegates and activists in California, the biggest and one of the bluest states, lay bare the infighting over their nominee's fitness for a presidential run.",
    "url": "https://www.politico.com/news/2024/07/17/california-democratic-delegates-private-chats-biden-00169210"
  },
  {
    "text": "The End of Biden's Candidacy Approaches  —  At the start of the day yesterday, it was conceivable that Joe Biden might manage to hold on to the Democratic nomination for president.  But this morning, things seem to be slipping out of his grasp.  —  The blows to Biden were both procedural and political … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/democrats-push-biden-out/679079/"
  },
  {
    "text": "Playbook: The walls close in around Biden  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  For weeks, the Democratic Party has been paralyzed by uncertainty about whether President JOE BIDEN should stay atop the ticket or step aside.",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/18/the-walls-close-in-around-biden-00169335"
  },
  {
    "text": "July 2024 Swing State Polls  —  Trump Leads Biden in Swing States and National Poll as Biden's Support Declines  —  New polling conducted July 15-16 by Emerson College Polling and sponsored by Democrats for Next Generation finds former President Trump leading Biden in seven swing states and in a national poll.",
    "url": "https://emersoncollegepolling.com/july-2024-swing-state-polls/"
  },
  {
    "text": "America will never be the same after Milwaukee's tent revival for the cult of Donald Trump  —  MILWAUKEE — I came to the American Heartland to cover a political convention, but all I found was a tent revival, Brother Trump's Traveling Salvation Show.The Republican National Convention took … ",
    "url": "https://www.inquirer.com/opinion/milwaukee-rnc-cult-donald-trump-20240718.html"
  },
  {
    "text": "Biden administration cancels another $1.2B in student debt … - PSLF allows public employees, such as teachers, firefighters, members of law enforcement, and people who work for nonprofit organizations, to apply for forgiveness after making 10 years' worth of payments on their federal student loan balance.",
    "url": "https://www.axios.com/2024/07/18/biden-cancels-student-debt-pslf-program"
  },
  {
    "text": "Five Just Stop Oil activists receive record sentences for planning to block M25  —  Campaigners receive longest ever sentences for non-violent protest after being convicted of conspiracy to cause public nuisance  —  Five supporters of the Just Stop Oil climate campaign who conspired … ",
    "url": "https://www.theguardian.com/environment/article/2024/jul/18/five-just-stop-oil-supporters-jailed-over-protest-that-blocked-m25"
  },
  {
    "text": "The VP is clearly the stronger candidate  —  The case for Kamala Harris, from a former hater  —  I did not support selecting Kamala Harris as Joe Biden's running mate in 2020.  —  My reasons for this were pretty boring.  It's genuinely difficult to make it to the top of the political pyramid … ",
    "url": "https://www.slowboring.com/p/the-vp-is-clearly-the-stronger-candidate"
  },
  {
    "text": "Statement from Press Secretary Karine Jean-Pierre  —  Earlier today following his first event in Las Vegas, President Biden tested positive for COVID-19.  He is vaccinated and boosted and he is experiencing mild symptoms.  He will be returning to Delaware where he will self-isolate … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/07/17/statement-from-press-secretary-karine-jean-pierre-3/"
  },
  {
    "text": "J.D. Vance Left His Venmo Public.  Here's What It Shows  —  The Republican VP nominee's Venmo network reveals connections ranging from the architects of Project 2025 to enemies of Donald Trump—and the populist's close ties to the very elites he rails against.",
    "url": "https://www.wired.com/story/jd-vance-venmo/"
  },
  {
    "text": "Trump brags about ending Roe.  No one's talking about it in Milwaukee.  —  Heading into the final day of the Republican Party's first national gathering since the Supreme Court's landmark decision, the issue has barely received a passing mention.  —  MILWAUKEE — Overturning Roe … ",
    "url": "https://www.politico.com/news/2024/07/18/trump-abortion-rnc-00169304"
  },
  {
    "text": "Project 2025 *is* the GOP platform  —  Don't let them fool you. … Project 2025 — the right-wing template for a second Trump term — is so exhaustively evil, so vast in scope, that it feels impossible to fully comprehend it.  —  However, as the GOP faithful gather in Milwaukee … ",
    "url": "https://www.publicnotice.co/p/project-2025-explained-2024-gop-platform"
  },
  {
    "text": "If the Trump classified documents case is reinstated, Judge Aileen Cannon would be difficult to remove  —  Even after a year of exasperating proceedings that featured several breaks from normal judicial procedure and that culminated in a shock ruling dismissing the classified documents indictment … ",
    "url": "https://www.cnn.com/2024/07/18/politics/aileen-cannon-removal-trump-classified-documents/"
  }
]