[
  {
    "text": "Trump email falsely says Biden was ‘locked & loaded’ to ‘take me out’ in Mar-a-Lago search  —  A former president falsely accusing his successor and rival of posing a threat to his life is without precedent in modern U.S. history.  —  Donald Trump on Tuesday falsely claimed … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/21/trump-mar-a-lago-raid-fbi-deadly-force/"
  },
  {
    "text": "Lawyers found classified docs in Trump's bedroom 4 months after Mar-a-Lago search  —  The revelation was contained in a newly unsealed opinion that a federal judge issued in 2023.  —  Four months after the FBI raided his Mar-a-Lago estate, Donald Trump's attorneys discovered four documents marked “classified” in his personal bedroom.",
    "url": "https://www.politico.com/news/2024/05/21/trump-classified-documents-bedroom-00159182"
  },
  {
    "text": "Biden administration canceling student loans for another 160,000 borrowers  —  The Biden administration is canceling student loans for another 160,000 borrowers through a combination of existing programs.  The Education Department announced the latest round of cancellation on Wednesday … ",
    "url": "https://apnews.com/article/biden-student-loan-cancellation-debt-forgiveness-60ffeaec17737d6317b4aee188893cc4"
  },
  {
    "text": "Schumer Plans Vote on Contraception Access, Teeing Up a Campaign Issue  —  Democrats are planning to spotlight Republicans' opposition to legislation protecting birth control access nationwide, as part of an election-year push.  —  Senator Chuck Schumer, Democrat of New York and the majority leader … ",
    "url": "https://www.nytimes.com/2024/05/22/us/politics/schumer-contraception-ivf-democrats.html"
  },
  {
    "text": "Scoop: Senate Democrats plot reproductive-rights blitz … - “We are certainly going to be talking a lot about [abortion],” she said.  — Sen. Patty Murray (D-Wash.), a leading advocate of protecting access to the procedure, said leaders plan to talk about potential floor actions … ",
    "url": "https://www.axios.com/2024/05/22/senate-democrats-plot-reproductive-rights-blitz"
  },
  {
    "text": "Republican National Committee headquarters under lockdown after being sent vials of blood  —  A hazardous materials team from the Capitol Police responded to the situation.  —  The Republican National Committee headquarters in Washington, D.C., was under lockdown Wednesday morning … ",
    "url": "https://www.nbcnews.com/politics/politics-news/republican-national-committee-headquarters-lockdown-sent-vials-blood-rcna153462"
  },
  {
    "text": "Half of Swing-State Voters Fear Violence Around US Election  —  President Joe Biden trails Republican Donald Trump by 4 percentage points across seven battleground states in a monthly tracking poll. … LEARN MORE  —  Half of swing-state voters say they're worried about violence surrounding … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-22/violence-around-2024-election-feared-by-half-of-swing-state-voters-poll"
  },
  {
    "text": "An Expert's Guide to Surviving Extreme Plane Turbulence  —  HOLD ON TIGHT  —  News that a 73-year-old man died when wild turbulence hit a Singapore Airlines flight on Tuesday is the stuff of most fliers' nightmares.  —  News that a 73-year-old man died and seven others were critically injured … ",
    "url": "https://www.thedailybeast.com/an-experts-guide-to-surviving-extreme-plane-turbulence-on-flights"
  },
  {
    "text": "Scenes From a MAGA Meltdown: Inside the “America First” Movement's War Over Democracy  —  Across the country, the Republican Party's rank-and-file have turned on the GOP establishment.  In Michigan, this schism broke the party — and maybe democracy itself.",
    "url": "https://www.propublica.org/article/michigan-republicans-maga-meltdown-democracy-elections"
  },
  {
    "text": "Alito's “defense” of flying the J6 flag is transparent BS  —  Going full insurrectionist is not normal. … Everyone is waiting to see what the United States Supreme Court will do with Donald Trump's outlandish claim he should be given absolute immunity from prosecution for his attempts to overturn the 2020 election.",
    "url": "https://www.publicnotice.co/p/alito-upside-down-flag-january-6-explained"
  },
  {
    "text": "Trump-Backed California Lawmaker Vince Fong Wins Special Election To Finish McCarthy's Term  —  A Trump-backed Republican California legislator won a special election to complete the remainder of the term of deposed former U.S. House Speaker Kevin McCarthy.  —  LOADING",
    "url": "https://www.huffpost.com/entry/election-2024-house-california_n_664dbf26e4b048d73b54b174"
  },
  {
    "text": "Meet Trump's ‘Human Printer’  —  WHENEVER DONALD TRUMP BRANDISHES a stack of papers or reads a printout of a social media post, he's relying on the work of Natalie Harp.  —  Harp, 32, occupies a unique role in the history of presidential campaigns: aide who travels with a portable printer … ",
    "url": "https://www.thebulwark.com/p/meet-trumps-human-printer-natalie-harp"
  },
  {
    "text": "Colorado GOP calls for all children to be pulled from public schools  —  The party's latest move to the hard right is a directive to parents to remove kids from the public education system.  —  COLORADO, USA — The Colorado Republican Party is issuing a call to its members to pull their children … ",
    "url": "https://www.9news.com/article/news/local/next/next-with-kyle-clark/colorado-gop-kids-pulled-from-public-schools/73-e121fe9e-9a2b-498d-8a80-1efe2a179758"
  },
  {
    "text": "What Does It Take to Flip the 2024 Battleground States?  —  Adjust the WSJ Swing-States Dial to see how subtle shifts in turnout and candidate choice could sway the outcome of the 2024 election  —  The American electorate is always shifting, altering the scenarios that determine who the next president will be.",
    "url": "https://www.wsj.com/politics/elections/election-dial-battleground-states-trump-biden-224ad0e6"
  },
  {
    "text": "Fani Willis and judge presiding over Georgia Trump election case defeat challengers  —  Fulton County District Attorney Fani Willis, the Georgia prosecutor who brought a sprawling racketeering case against former President Donald Trump and others, has won the Democratic primary in her bid for reelection.",
    "url": "https://apnews.com/article/fani-willis-scott-mcafee-trump-georgia-indictment-6e55b3a7eafd66c6ae3dae3a50d3187a"
  },
  {
    "text": "Senate set to confirm 200th Biden judge as Democrats tout “major milestone”  —  Washington — The Senate on Wednesday is set to confirm President Biden's 200th judicial nominee, surpassing the number of appointments to the federal judiciary made by his two most recent predecessors at this point in their presidencies.",
    "url": "https://www.cbsnews.com/news/judicial-nominations-200-senate-confirmation-biden/"
  },
  {
    "text": "Majority of Americans wrongly believe US is in recession - and most blame Biden  —  Exclusive Harris poll for the Guardian shows 55% believe economy is shrinking, in troubling sign for president's re-election bid  —  Nearly three in five Americans wrongly believe the US is in an economic recession … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/22/poll-economy-recession-biden"
  },
  {
    "text": "Scoop: Inside the DNC strategy for Trump VPs … - It also plans to run paid ads and dedicate staff across the communications, digital and research departments to the effort.  — The vice presidential debate in July or August, the official says, will be another key opportunity for the DNC to define Trump's vice presidential pick.",
    "url": "https://www.axios.com/2024/05/22/democratic-national-committee-trump-vp-maga"
  },
  {
    "text": "British lawmaker who lost hands and feet to sepsis returns to parliament  —  A British lawmaker returned to parliament on Wednesday, five months after losing his hands and feet to sepsis, receiving loud applause from colleagues and praise from the prime minister.",
    "url": "https://www.reuters.com/world/uk/british-lawmaker-who-lost-hands-feet-sepsis-returns-parliament-2024-05-22/"
  },
  {
    "text": "The campaign to gut Washington's power over corporate America  —  A yearslong legal crusade to hobble Wall Street's top cop could have repercussions across the government.  —  A decade-long conservative crusade against financial regulators will come to a head soon with a crucial Supreme Court ruling … ",
    "url": "https://www.politico.com/news/2024/05/21/supreme-court-jarkesy-administrative-state-00158948"
  },
  {
    "text": "The right's fascism problem  —  UNFORCED ERROR — Since Donald Trump emerged on the national political scene in 2015, journalists and pundits have been debating whether it's appropriate to compare him and the MAGA movement to the fascist movements of 20th-century Europe — and, more specifically … ",
    "url": "https://www.politico.com/newsletters/politico-nightly/2024/05/21/the-rights-fascism-problem-00159265"
  }
]