[
  {
    "text": "Chuck Schumer says Senate Democrats won't provide votes to pass GOP funding bill as shutdown draws near  —  After meeting with his conference, the Senate minority leader said “Republicans do not have the votes” to advance the House-approved measure, which requires 60 to pass.",
    "url": "https://www.nbcnews.com/politics/congress/schumer-senate-democrats-votes-gop-funding-bill-shutdown-rcna196029"
  },
  {
    "text": "Senate Democrats embrace hardball on government shutdown  —  Senate Democrats left a private meeting Wednesday saying there aren't enough votes to advance the short-term funding bill that passed the House on Tuesday.  —  Why it matters: This raises the chances of a government shutdown this weekend.",
    "url": "https://www.axios.com/2025/03/12/senate-democrats-government-shutdown"
  },
  {
    "text": "Senate Dems form plan to avoid a shutdown  —  Senate Democrats want a vote on an alternative stopgap funding bill as they look for leverage against Republicans with two days to go until a government shutdown.  The lawmakers emerged from a closed-door lunch on Wednesday and said that they … ",
    "url": "https://www.politico.com/live-updates/2025/03/12/congress/senate-dems-form-plan-to-avoid-a-shutdown-00227195"
  },
  {
    "text": "Trump's FBI Moves to Criminally Charge Major Climate Groups  —  The FBI is moving to criminalize groups like Habitat for Humanity for receiving grants from the Environmental Protection Agency under the Biden administration.  —  Citibank revealed in a court filing Wednesday that it was told … ",
    "url": "https://newrepublic.com/post/192660/trump-fbi-charge-climate-organizations"
  },
  {
    "text": "At Columbia, Tension Over Gaza Protests Hits Breaking Point Under Trump  —  There were protests, arrests, the departure of the school's president.  Then, a new administration arrived in Washington.  —  Days after immigration officers arrested a prominent pro-Palestinian campus activist … ",
    "url": "https://www.nytimes.com/2025/03/12/nyregion/columbia-university-trump-protests.html"
  },
  {
    "text": "Social Security scraps far-reaching cuts to phone services after Post report  —  The agency will move ahead with a much narrower change eliminating direct deposit changes by phone amid DOGE fraud concerns.  —  just now  —  The Social Security Administration late Wednesday abandoned plans … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/12/social-security-phone-doge-elderly-disabled/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNzUyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzMTM0Mzk5LCJpYXQiOjE3NDE3NTIwMDAsImp0aSI6IjA3ZDVlZjYwLTEyOTItNDA1OC1iM2YzLTFmNmQwZGI3ZWY2OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzEyL3NvY2lhbC1zZWN1cml0eS1waG9uZS1kb2dlLWVsZGVybHktZGlzYWJsZWQvIn0.rOfjerFFvU4_miX4-ZsNO0XBdafiau09D1lKek1PSQw&itid=gfta"
  },
  {
    "text": "Vandalize Tesla property and the White House will prosecute you as a domestic terrorist, Trump pledges  — The White House could bring the full force of the U.S. government to bear on anti-Elon Musk protestors found to have destroyed his carmaker's assets, following a spate of attacks large and small targeting Tesla.",
    "url": "https://fortune.com/2025/03/12/president-trump-vandalize-tesla-property-domestic-terrorist-elon-musk/"
  },
  {
    "text": "Robert Morris, Texas megachurch pastor and former Trump adviser, indicted for child sex crimes  —  Morris is a former spiritual adviser to President Donald Trump, and Gateway — one of the nation's largest megachurches — has been particularly active in Dallas-area GOP politics.",
    "url": "https://www.texastribune.org/2025/03/12/robert-morris-texas-megachurch-indicted-sexual-abuse/"
  },
  {
    "text": "U.S. citizen child recovering from brain cancer deported to Mexico with undocumented parents  —  The Texas family was on their way to an emergency medical checkup, they said, when they were detained at an immigration checkpoint.  —  A family that was deported to Mexico hopes they can find … ",
    "url": "https://www.nbcnews.com/news/latino/us-citizen-child-recovering-brain-cancer-deported-mexico-undocumented-rcna196049"
  },
  {
    "text": "Tim Walz to launch national tour of town halls in Republican House districts  —  Tim Walz is headed back out on the road - this time, for a tour of House districts represented by Republicans who have stopped holding in-person town halls amid the raucous receptions some of their colleagues have gotten across the country.",
    "url": "https://www.cnn.com/2025/03/12/politics/tim-walz-national-tour-town-halls/"
  },
  {
    "text": "Judge says Trump penalties on law firm send ‘chills down my spine’  —  The Trump administration was ordered to halt, at least temporarily, parts of its executive order punishing the law firm Perkins Coie.  —  A D.C. federal judge on Wednesday ordered the Trump administration … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/12/perkins-coie-trump-judge-restraining-order-tro/"
  },
  {
    "text": "In reversal, NPR permits anchor to attend Pride event  —  The Scoop  —  National Public Radio dissuaded one of its most visible gay employees from attending a corporate LGBTQ Pride event, as the Trump administration and congressional Republicans put pressure on the public broadcaster.",
    "url": "https://www.semafor.com/article/03/12/2025/npr-urged-anchor-to-avoid-upcoming-pride-event"
  },
  {
    "text": "Judge orders DOGE and Elon Musk to turn over documents, answer written questions  —  The demands for information are designed to clarify the “parameters of DOGE's and Musk's authority.”  —  A federal judge has ordered that Elon Musk and his Department of Government Efficiency turn … ",
    "url": "https://www.politico.com/news/2025/03/12/elon-musk-judge-orders-discovery-00227924"
  },
  {
    "text": "EPA Launches Biggest Deregulatory Action in U.S. History  —  Administrator Zeldin Announces 31 Historic Actions to Power the Great American Comeback  —  WASHINGTON - U.S. Environmental Protection Agency (EPA) Administrator Lee Zeldin announced the agency will undertake 31 historic actions … ",
    "url": "https://www.epa.gov/newsreleases/epa-launches-biggest-deregulatory-action-us-history"
  },
  {
    "text": "Federal student loan site down Wednesday, a day after layoffs gutted Education Department  —  An hours-long outage Wednesday on StudentAid.gov, the federal website for student loans and financial aid, underscored the risks in rapidly gutting the Department of Education, as President Donald Trump aims to dismantle the agency.",
    "url": "https://apnews.com/article/student-loans-education-department-outage-layoffs-5afb5a0a1b51bbe50e5961a63b419041"
  },
  {
    "text": "ICE Returns All Migrants From Guantánamo to Stateside Facilities  —  A court filing described strip searches and the use of restraint chairs on some of the 290 migrants the Trump administration has cycled through the base.  —  The Trump administration has abruptly cleared out a second group … ",
    "url": "https://www.nytimes.com/2025/03/12/us/politics/ice-migrants-guantanamo.html"
  },
  {
    "text": "Who's in Elon's ear — and DMs  —  Musk's most trusted advisers remain a tight-knit group of executives who have followed him from his companies but lack political experience.  —  Unlike traditional Washington power players, Elon Musk doesn't have a deep bench of policy wonks … ",
    "url": "https://www.politico.com/news/2025/03/12/musk-influence-inner-circle-00227332"
  },
  {
    "text": "Yale Suspends Scholar After A.I.-Powered News Site Accuses Her of Terrorist Link  —  The deputy director of a liberal project at Yale Law School was put on leave over allegations that she is linked to Samidoun, a group the U.S. government has said funds terrorists.",
    "url": "https://www.nytimes.com/2025/03/12/us/yale-suspends-scholar-terrorism.html"
  },
  {
    "text": "Biggest Federal Employee Unions Says Shutdown is Preferable to Elon/Trump CR … Federal workers obviously don't like government shutdowns.  Most of them are furloughed.  Others are forced to continue working without pay.  But in a letter addressed to members of the Senate, which I obtained … ",
    "url": "https://talkingpointsmemo.com/edblog/biggest-federal-employee-unions-says-shutdown-is-preferable-to-elon-trump-cr"
  },
  {
    "text": "Testimony Reveals Doors Would Not Open on Cybertruck That Caught Fire in Piedmont, Killing Three  —  The Highway Patrol's investigation into a November Cybertruck crash in Piedmont where three college kids died is finding two very Tesla problems: the vehicle immediately caught fire, and its doors would not open.",
    "url": "https://sfist.com/2025/03/11/testimony-reveals-doors-would-not-open-on-cybertruck-that-caught-fire-in-piedmont-killing-three/"
  },
  {
    "text": "S.F. Tesla showroom has been operating without proper permits for nearly a decade  —  The San Francisco Tesla showroom on Van Ness Avenue has been operating without a proper permit for nearly a decade after city building inspectors failed to sign off on a $2.3 million renovation back in 2016.",
    "url": "https://www.sfchronicle.com/sf/article/tesla-showroom-permits-building-inspection-20213130.php"
  },
  {
    "text": "Putin orders swift expulsion of Ukrainian forces before peace talks  —  The Russian leader promised to treat captured forces as “terrorists.”  —  Russian President Vladimir Putin has ordered his troops to defeat Ukrainian forces occupying its Kursk border region as soon as possible … ",
    "url": "https://www.politico.eu/article/vladimir-putin-russian-troops-kursk-war-in-ukraine-peace-talks/"
  },
  {
    "text": "Antisemitic and racist shock jock is back on the radio, 11 years after being fired for tirade  —  A conservative radio host who was fired a decade ago for calling a Black woman an “animal” and has since shared a host of racist and antisemitic content on social media has a new show on New York's WABC … ",
    "url": "https://forward.com/news/703747/anthony-cumia-wabc-antisemitic/"
  },
  {
    "text": "CEOs Don't Plan to Openly Question Trump.  Ask Again If the Market Crashes 20%.  —  Behind closed doors, business leaders air plenty of concerns about the administration and its policies  —  WASHINGTON—How business leaders talk about the Trump administration in private has been markedly different … ",
    "url": "https://www.wsj.com/business/ceos-dont-plan-to-openly-question-trump-ask-again-if-the-market-crashes-20-e8448820"
  },
  {
    "text": "Document prepared for Kremlin outlines hard-line negotiating stance  —  The document, written in February by a Moscow-based think tank close to Russia's Federal Security Service or FSB, lays out Russia's maximalist demands  —  Russia should work to weaken the U.S. negotiating position … ",
    "url": "https://www.washingtonpost.com/world/2025/03/12/trump-russia-ukraine-negotiations-fsb-document/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQxNzUyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzMTM0Mzk5LCJpYXQiOjE3NDE3NTIwMDAsImp0aSI6ImUxOGU4ZTk5LTgxNzItNDJmNy1iNzA2LTdmNTFlYzg4MWFmMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzAzLzEyL3RydW1wLXJ1c3NpYS11a3JhaW5lLW5lZ290aWF0aW9ucy1mc2ItZG9jdW1lbnQvIn0.Gr0Sf3ra6QTrQ3kjrHofpgwoKPspoPNXWEtV6iY8El4&itid=gfta"
  },
  {
    "text": "Venezuelan couple arrested and charged with illegal entry — two years after crossing into the U.S.  — The timing of the arrests and charges is unusual and reflects the Trump administration's increasingly aggressive tactics on immigration.  — The couple had been granted protected status … ",
    "url": "https://www.latimes.com/politics/story/2025-03-12/venezuelan-couple-charged-with-illegal-entry-two-years-after-crossing-the-border"
  },
  {
    "text": "In Memoriam: Mark Klein, AT&T Whistleblower Who Revealed NSA Mass Spying  —  EFF is deeply saddened to learn of the passing of Mark Klein, a bona fide hero who risked civil liability and criminal prosecution to help expose a massive spying program that violated the rights of millions of Americans.",
    "url": "https://www.eff.org/deeplinks/2025/03/memoriam-mark-klein-att-whistleblower-about-nsa-mass-spying"
  },
  {
    "text": "District Court Rules Trump Violated Constitution by Usurping Congress's Spending Power  —  On Monday, US District Judge Amir Ali ruled against the Trump Administration in an important case involving control over the spending power.  The court held the administration could not withhold payments … ",
    "url": "https://reason.com/volokh/2025/03/12/district-court-rules-trump-violated-constitution-by-usurping-congresss-spending-power/"
  },
  {
    "text": "Trump Officials Are ‘Pretending’ a Judge Didn't Bar His Anti-Diversity Orders  —  A judge blocked the administration from forcing organizations to accept anti-diversity contract terms.  Trump officials haven't let them know … Trump's Justice Department decided the fairly broad injunction only covered certain agencies.",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-officials-diversity-orders-dei-pretending-1235294937/"
  },
  {
    "text": "Why I Left the Washington Post  —  Owner Jeff Bezos wants to transform the Opinions section of the paper, where I worked for forty years.  After the publisher killed my column disagreeing with that move—it appears here in full—I decided to quit.  —  I walked into the Washington Post building … ",
    "url": "https://www.newyorker.com/news/essay/why-ruth-marcus-left-the-washington-post?_sp=6343f50d-f4b1-4c97-9350-3a58edad8d75.1741781372468"
  },
  {
    "text": "Trump vowed to fix the economy.  His voters are still waiting.  —  While many of his supporters continue to put their faith in the president, Trump's political capital could be tested if the economy suffers in the coming months.  —  Surrounded by boxes of Wheaties and Froot Loops … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/12/trump-voters-lower-prices-promise/"
  }
]