[
  {
    "text": "Trump appeals Illinois judge's ruling removing him from primary ballot  —  Judge Tracie Porter had ordered Trump's removal from presidential ballot for his role in the US Capitol attack  —  Donald Trump has appealed a decision from an Illinois state judge who decided he should be removed … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/29/trump-illinois-presidential-primary-ballot-appeal"
  },
  {
    "text": "The courts aren't coming to save us—and that's okay.  —  Audio playback is not supported on your browser.  Please upgrade.  —  On Wednesday, the Supreme Court granted review of Trump's presidential immunity defense.  The surprise grant of review felt like a gut punch.",
    "url": "https://roberthubbell.substack.com/p/the-courts-arent-coming-to-save-usand"
  },
  {
    "text": "Why Is Trump Trying to Make Ukraine Lose?  —  The former president isn't in office—but is still dictating U.S. policy.  —  Nearly half a year has passed since the White House asked Congress for another round of American aid for Ukraine.  Since that time, at least three different legislative efforts … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/one-global-issue-trump-cares-about/677592/"
  },
  {
    "text": "House passes short-term funding bill to avert shutdown  —  The House on Thursday approved a short-term funding bill to avert a partial government shutdown this weekend, sending the legislation to the Senate one day before Friday's funding deadline.  —  The legislation … ",
    "url": "https://thehill.com/homenews/house/4497940-house-passes-short-term-funding-bill-to-avert-shutdown/"
  },
  {
    "text": "Cornyn launches bid to succeed McConnell as GOP leader  —  Sen. John Cornyn (R-Texas) on Thursday officially announced a run to replace Senate Minority Leader Mitch McConnell (R-Ky.) as Republican leader, setting up what is expected to be a hotly contested race for the top spot in the conference.",
    "url": "https://thehill.com/homenews/senate/4497417-cornyn-launches-bid-to-replace-mcconnell-as-gop-leader/"
  },
  {
    "text": "Here's who could replace Mitch McConnell as Senate's top Republican  —  Immediately after Senate Minority Leader Mitch McConnell (R-Ky.) announced that he will step down from his leadership position in November, all eyes turned to a handful of Republican senators who could seek to succeed McConnell … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/28/replace-mitch-mcconnell/"
  },
  {
    "text": "Biden Is Too Old But Trump Is Dangerous, Swing-State Poll Shows  —  Trump leads Biden in seven key states, with perceptions of an improving national economy failing to translate into a significant increase in support for the incumbent.  —  Swing-state voters across every major demographic … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-29/biden-age-worries-swing-state-voters-trump-seen-as-dangerous-poll-shows"
  },
  {
    "text": "Washington State's largest labor union endorses ‘uncommitted’ over Biden  —  The biggest state chapter of the United Food and Commercial Workers suggested it is concerned about Joe Biden's ability to defeat Donald Trump.  —  The biggest labor union in Washington State endorsed voting … ",
    "url": "https://www.nbcnews.com/politics/2024-election/washington-states-largest-labor-union-endorses-uncommitted-biden-rcna141139"
  },
  {
    "text": "Romney on voting for Trump over Biden: ‘No, no, no, absolutely not’  —  Sen. Mitt Romney (R-Utah) he would “absolutely not” vote for former President Trump over President Biden in November, pointing to Trump's foreign policy views and his character.  —  “No. No, no, absolutely not,” … ",
    "url": "https://thehill.com/homenews/senate/4497046-romney-voting-trump-over-biden-absolutely-not/"
  },
  {
    "text": "Fox News' attempt to manufacture a Biden crime crisis runs into a problem: Violent crime is down  —  A case study in how Fox uses anecdote-based fearmongering to undermine actual crime data  —  After President Joe Biden accurately declared that murders and other violent crimes fell last year … ",
    "url": "https://www.mediamatters.org/fox-news/fox-news-attempt-manufacture-biden-crime-crisis-runs-problem-violent-crime-down"
  },
  {
    "text": "Judge blocks Texas law that gives police broad powers to arrest migrants who illegally enter US  —  A federal judge on Thursday blocked a new Texas law that gives police broad powers to arrest migrants suspected of illegally entering the U.S., dealing a victory to the Biden administration … ",
    "url": "https://apnews.com/article/texas-migrant-arrests-court-ruling-3bcded91620cbd9686575caa6bcac203"
  },
  {
    "text": "Israel-Hamas war: Gaza Health Ministry says over 30,000 Palestinians killed  —  Israeli strikes over central Gaza late Wednesday killed at least 20 people, including five women and two children.  Dozens of men held prayers for the deceased, wrapped traditionally in white shrouds, outside al-Aqsa Martyrs Hospital in Deir al-Balah.",
    "url": "https://apnews.com/article/israel-hamas-war-news-02-29-2024-f9b5a62a80d8b83eac4946d3c85af58b"
  },
  {
    "text": "Revealed: ‘extremist’ Trump economist plots rightwing overhaul of US treasury  —  Stephen Moore, who withdrew from Fed consideration after sexist remarks were uncovered, is co-author of radical Project 2025 effort  —  Stephen Moore, a conservative economist whose controversial remarks … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/29/trump-economist-stephen-moore-us-treasury-project-2025"
  },
  {
    "text": "How we got here  —  Democrats are still suffering from their misinterpretation of the 2016 election  —  In the immediate aftermath of Barack Obama's 2012 re-election, Donald Trump criticized Mitt Romney for being too right-wing on immigration.  —  By doing so, he was echoing … ",
    "url": "https://www.slowboring.com/p/how-we-got-here-ce8"
  },
  {
    "text": "The Story Behind the New York Times October 7 Exposé  —  Anat Schwartz had a problem.  The Israeli filmmaker and former air force intelligence official had been assigned by the New York Times to work with her nephew Adam Sella and veteran Times reporter Jeffrey Gettleman on an investigation … ",
    "url": "https://theintercept.com/2024/02/28/new-york-times-anat-schwartz-october-7/"
  },
  {
    "text": "Raging wildfire now largest in Texas history with deteriorating conditions expected  —  A raging wildfire that tore across the Texas Panhandle this week has now become the largest in state history, and deteriorating conditions are expected to continue in the state.",
    "url": "https://thehill.com/homenews/state-watch/4497444-raging-wildfire-now-largest-in-texas-history/"
  },
  {
    "text": "Trump Media co-founders sue company, alleging a scheme to dilute shares  —  The case could complicate a long-delayed bid by the owner of Truth Social to go public — and deliver former president Donald Trump a financial lifeline  —  The co-founders of former president Donald Trump's media company filed … ",
    "url": "https://www.washingtonpost.com/technology/2024/02/29/truth-social-lawsuit-trump-media-founders/"
  },
  {
    "text": "Missouri GOP Candidate for Governor Was Only ‘Honorary’ KKK Member  —  The name of “Pro-White man” Darrell Leon McClanahan III sits atop Missouri's gubernatorial ballot  —  These photos tweeted yesterday by former Missouri Representative Shamed Dogan first appeared on the website … ",
    "url": "https://www.riverfronttimes.com/news/missouri-gop-candidate-for-governor-is-only-honorary-kkk-member-42007057"
  },
  {
    "text": "Columbia University Hospital DEI Chief Is Serial Plagiarist, Complaint Alleges  —  The chief diversity, equity, and inclusion officer of Columbia University's medical school, Alade McKen, plagiarized extensively in his doctoral dissertation, lifting entire pages of material, without attribution … ",
    "url": "https://freebeacon.com/campus/columbia-university-hospital-dei-chief-is-serial-plagiarist-complaint-alleges/"
  },
  {
    "text": "Let's Thank the Alabama Supreme Court  —  I never thought I'd be grateful to the Alabama Supreme Court for anything, but now I am.  With its decision deeming frozen embryos to be children under state law, that all-Republican court has done the impossible.  It has awakened the American public … ",
    "url": "https://www.nytimes.com/2024/02/29/opinion/alabama-abortion-ivf.html"
  },
  {
    "text": "US spends billions on roads rather than public transport in ‘climate time bomb’  —  New analysis finds money from Biden's $1.2tn infrastructure bill has overwhelmingly been spent on widening highways for cars  —  Roads, roads and more roads.  The US is continuing to spend billions of dollars … ",
    "url": "https://www.theguardian.com/business/2024/feb/29/biden-spending-highways-public-transport-climate-crisis"
  }
]