[
  {
    "text": "This Professor Has Taken on Robert F. Kennedy Jr. for Opposing Vaccines  —  A Q&A with Dr. Peter Hotez, who has clashed with the new health and human services secretary nominee.  Hotez himself helped develop low-cost vaccinations. … Dr. Peter Hotez knows vaccines.",
    "url": "https://www.insidehighered.com/news/government/science-research-policy/2024/11/22/professor-has-taken-rfk-jr-opposing-vaccines"
  },
  {
    "text": "Auchincloss: Senate must reject ‘dangerous’ RFK Jr. as HHS head  —  Rep. Jake Auchincloss (D-Mass.) urged the Senate to reject Robert F. Kennedy Jr. as the Secretary of Health and Human Services in a Friday op-ed for the Boston Globe.  —  “Now Donald Trump is setting Kennedy up to “go wild” as secretary of health and human services.",
    "url": "https://thehill.com/homenews/campaign/5006585-auchincloss-senate-must-reject-dangerous-rfk-jr-as-hhs-head/"
  },
  {
    "text": "The Resistance goes quiet … - That could change as Trump moves to implement his agenda. … This time Democratic voters, particularly women, were just as disappointed but less shocked, says Lisa Mueller, a political science professor at Macalester College.",
    "url": "https://www.axios.com/2024/11/24/resistance-trump-protests-womens-march"
  },
  {
    "text": "Trump Picks Fox News Medical Contributor To Be Surgeon General  —  Dr. Janette Nesheiwat, once a Fox News talking head, could become the nation's top doctor.  —  LOADING  —  President-elect Donald Trump has picked Dr. Janette Nesheiwat, a Fox News medical contributor, to serve as the U.S.′ next surgeon general.",
    "url": "https://www.huffpost.com/entry/trump-picks-fox-news-medical-contributor-to-be-surgeon-general_n_67423949e4b06528a19757a8"
  },
  {
    "text": "I Watched Orbán Destroy Hungary's Democracy.  Here's My Advice for the Trump Era.  —  To dismantle the machinery of autocracy, you first need to understand how it works.  —  Many believed that after his first term as president, Donald Trump would end up in the dustbin of history.",
    "url": "https://www.politico.com/news/magazine/2024/11/23/trump-autocrat-elections-00191281"
  },
  {
    "text": "As MSNBC Continues to Swirl Down the Toilet, Its Latest Excuse for Trump's Win Is Crazy-Train Absurd  —  In the slim chance that you need an example to understand why MSNBC's ratings have continued to swirl down the toilet in the aftermath of President-elect Donald Trump's decisive win … ",
    "url": "https://redstate.com/mike_miller/2024/11/23/as-mnsbc-continues-to-swirl-down-the-toilet-its-latest-excuse-for-trumps-win-is-crazy-train-lunacy-n2182402"
  },
  {
    "text": "Trump taps loyalist Rollins for USDA chief in surprise pick  —  President-elect Donald Trump has picked Brooke Rollins as his Agriculture secretary, after weeks of intense internal fighting over the role, according to two people familiar with the transition conversations.",
    "url": "https://www.politico.com/news/2024/11/23/trump-loyalist-brooke-rollins-usda-secretary-surprise-nomination-00191391"
  },
  {
    "text": "You'll Need to Hit the Showers for a ‘Sanewash’ After This Ridiculous RFK Hit Piece  —  America's left just lost an election in which voters overwhelmingly rejected their current fad: that it is perfectly normal for men to be surgically converted into women, use women's bathrooms and locker rooms … ",
    "url": "https://pjmedia.com/victoria-taft/2024/11/23/hhs-n4934342"
  },
  {
    "text": "Pam Bondi, Trump's AG pick, said ‘prosecutors will be prosecuted’  —  Trump's choice for U.S. attorney general has served as a reliable ally and a fierce critic of attempts to investigate or prosecute him  —  Again and again, when Donald Trump has faced scandal and scrutiny, Pam Bondi was there to defend him.",
    "url": "https://www.washingtonpost.com/national-security/2024/11/23/pam-bondi-doj-attorney-general-trump-pick/"
  },
  {
    "text": "Israel Says Body of Missing Israeli Rabbi in UAE is Found  — Kogan had been emissary of Jewish group Chabad-Lubavitch  — Government reinforces travel warnings to UAE, elsewhere  —  Security authorities in the United Arab Emirates have located the body of Zvi Kogan … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-24/israel-says-body-of-missing-israeli-man-has-been-found-in-uae"
  },
  {
    "text": "John Bolton Slams Trump Cabinet Pick Seb Gorka as a ‘Con Man’  —  NO CONFIDENCE  —  The former national security adviser called for a “full field FBI background investigation” into Gorka's academic credentials.  —  Never one to mince words, President-elect Donald Trump's former national … ",
    "url": "https://www.thedailybeast.com/john-bolton-slams-trumps-choice-of-con-man-seb-gorka-as-counterterrorism-director/"
  },
  {
    "text": "Biden's Chief Economist Processes the Election With ‘Confusion, Guilt’  —  Jared Bernstein, the chair of the White House Council of Economic Advisers, was a leading architect of “Bidenomics.”  —  Since the election, Jared Bernstein, the chair of the White House Council of Economic Advisers … ",
    "url": "https://www.nytimes.com/2024/11/23/business/dealbook/jared-bernstein-bidenomics-economy.html?unlocked_article_code=1.cE4.IsVD.BT0sZFG7D4yo&smid=url-share"
  },
  {
    "text": "Taiwan's former president says Ukraine needs US weapons more urgently than Taipei  —  Tsai Ing-wen's comments come after a top U.S. military leader said supplying U.S. weapons to Kyiv was cutting into stockpiles that could be used in a war in Asia.  —  HALIFAX, Canada … ",
    "url": "https://www.politico.com/news/2024/11/23/taiwans-former-president-says-ukraine-needs-u-s-weapons-more-urgently-than-taipei-00191400"
  },
  {
    "text": "Fred R. Harris, Oklahoma senator on Kerner Commission, dies at 94  —  A liberal populist, he was once considered a rising star in the Democratic Party.  He twice ran for president and chaired the Democratic National Committee.  —  Former senator Fred R. Harris, a liberal prairie populist … ",
    "url": "https://www.washingtonpost.com/obituaries/2024/11/23/fred-harris-senator-oklahoma-kerner-dead/"
  },
  {
    "text": "Trump's Republican Party is increasingly winning union voters.  It's a shift seen in his labor pick  —  Working-class voters helped Republicans make steady election gains this year and expanded a coalition that increasingly includes rank-and-file union members, a political shift spotlighting … ",
    "url": "https://apnews.com/article/trump-chavezderemer-labor-secretary-unions-republicans-1bff41e4caef610dbf38ead24d292e67"
  }
]