[
  {
    "text": "Trump Leads in 5 Key States, as Young and Nonwhite Voters Express Discontent With Biden  —  A new set of Times/Siena polls, including one with The Philadelphia Inquirer, reveal an erosion of support for the president among young and nonwhite voters upset about the economy and Gaza.",
    "url": "https://www.nytimes.com/2024/05/13/us/politics/biden-trump-battleground-poll.html"
  },
  {
    "text": "Cross-Tabs: May 2024 Times/Siena Poll of the Presidential Battlegrounds  —  Donald Trump leads Joe Biden in five of six states polled by The New York Times, The Philadelphia Inquirer and Siena College from April 28 to May 9, 2024.  —  View toplines for the full set of polls and cross-tabs for: all registered voters |",
    "url": "https://www.nytimes.com/interactive/2024/05/13/us/elections/times-siena-poll-registered-voter-crosstabs.html"
  },
  {
    "text": "No, Your Pet Issue Is Not Making Biden Lose … The American political landscape in 2024 seems like a very simple story that people continue to overcomplicate.  There was a large, global surge in prices in 2021 and 2022 as the economy restarted following the COVID-19 pandemic.",
    "url": "https://nymag.com/intelligencer/article/why-joe-biden-is-trailing-the-election-polls-to-donald-trump.html"
  },
  {
    "text": "How on Earth Is Donald Trump Getting Credit for Joe Biden's Economy?  —  Joe Biden's trip to Wisconsin last week would, in normal political times, have been a grand slam.  He went to the very spot in Racine County where, in 2018, Donald Trump showed up literally holding a golden shovel … ",
    "url": "https://newrepublic.com/article/181499/earth-donald-trump-getting-credit-joe-bidens-economy"
  },
  {
    "text": "Live Updates: In His First Day of Testimony, Cohen Testifies Trump Authorized Hush-Money Payment  —  During nearly six hours on the stand Monday, Michael D. Cohen testified that Donald J. Trump urged him to buy the silence of Stormy Daniels late in the 2016 campaign and approved the plan to repay him.",
    "url": "https://www.nytimes.com/live/2024/05/13/nyregion/trump-trial-michael-cohen"
  },
  {
    "text": "Melania Came Up With Trump's ‘Locker Room Talk’ Excuse, Michael Cohen Says  —  BY HIS SIDE  —  The former Trump fixer dropped the surprising revelation as an aside while testifying Monday in his former boss' hush-money trial.  —  Among the weirdest revelations at Donald Trump's ongoing criminal trial … ",
    "url": "https://www.thedailybeast.com/melania-came-up-with-trumps-locker-room-talk-excuse-michael-cohen-says"
  },
  {
    "text": "Republicans ready for a Trump loss  —  This time, Trump has the GOP bought in earlier on his Big Lie  —  What happens if he loses?  —  The mainstream press has finally turned its focus to what a second Donald Trump administration will look like should he win the White House in 2024.",
    "url": "https://www.salon.com/2024/05/13/ready-for-a-loss/"
  },
  {
    "text": "Attack a Democrat Charged With Corruption?  Republicans Wouldn't Dare.  —  Earlier this month, federal prosecutors bestowed on Republicans what seemed like an election-year gift: charging a senior House Democrat in a competitive district with accepting $600,000 in bribes and acting as a foreign agent.",
    "url": "https://www.theatlantic.com/politics/archive/2024/05/henry-cuellar-charges-house-republicans/678368/"
  },
  {
    "text": "The biggest flaw in Justice Clarence Thomas' newest complaints  —  Justice Clarence Thomas wants the public to believe the serious accusations he's faced are “lies.”  He's going to have to be far more specific.  —  As a matter of jurisprudence, Supreme Court Justice Clarence Thomas has reason to be pleased.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/biggest-flaw-justice-clarence-thomas-newest-complaints-rcna151935"
  },
  {
    "text": "They're called perennials: You plant them once and they come back after each winter if they're given the right environment to survive.  Think things like trees, shrubs and woody plants.  —  And for predicting winter plant survival, knowing an area's hardiness zone is a big help to gardeners … ",
    "url": "https://apps.npr.org/plant-hardiness-garden-map/"
  },
  {
    "text": "UNC-Chapel Hill trustees move to divert DEI funds to police and public safety  —  The UNC-Chapel Hill Board of Trustees voted to divert millions of dollars spent on diversity, equity and inclusion programs into public safety instead, ahead of an expected policy change statewide to restrict DEI.",
    "url": "https://www.newsobserver.com/news/local/education/article288473709.html"
  },
  {
    "text": "New Rules to Overhaul Electric Grids Could Boost Wind and Solar Power  —  The Federal Energy Regulatory Commission approved the biggest changes in more than a decade to the way U.S. power lines are planned and funded.  —  Federal regulators on Monday approved sweeping changes … ",
    "url": "https://www.nytimes.com/2024/05/13/climate/electric-grid-overhaul-ferc.html"
  },
  {
    "text": "United Nations halves estimate of women and children killed in Gaza  —  Without any announcement, the United Nations (UN) significantly lowers its previously stated casualty list in the Gaza Strip  —  The United Nations has significantly adjusted Palestinian casualty figures for the ongoing war … ",
    "url": "https://nationalpost.com/news/world/israel-middle-east/united-nations-halves-estimate-of-women-and-children-killed-in-gaza"
  },
  {
    "text": "Psaki's new book falsely recounts Biden's watch check in troop ceremony  —  Former White House press secretary Jen Psaki claims in her new book that President Biden never looked at his watch during the ceremony for soldiers killed during the U.S. withdrawal from Afghanistan in 2021 … ",
    "url": "https://www.axios.com/2024/05/13/psaki-book-biden-watch-check-afghanistan"
  },
  {
    "text": "Trump Wants to Deport Pro-Palestine Protesters—and GOP Lawmakers Are Filing Bills to Make It Happen  —  Republicans continue their push to punish dissent.  —  At a rally in Wildwood, New Jersey on Saturday, former President Donald Trump made many questionable comments.",
    "url": "https://www.motherjones.com/politics/2024/05/trump-protesters-gop-marco-rubio-palestine-college-deport/"
  },
  {
    "text": "Sen. Menendez bribery trial starts with judge scolding lawyers on ‘gamesmanship’ … A judge on Monday admonished attorneys for playing legal games shortly after they convened for the start of the federal bribery trial of Sen. Robert Menendez, D-N.J.  —  “There's been too much gamesmanship here … ",
    "url": "https://www.cnbc.com/2024/05/13/judge-scolds-lawyers-menendez-bribery-trial-gamesmanship.html"
  },
  {
    "text": "Canadian wildfires trigger air quality alerts across 4 U.S. states  —  Winds have carried plumes of smoke over Montana, North Dakota, South Dakota and Minnesota.  —  Hazy conditions blanketed parts of four U.S. states Monday, as smoke from wildfires in western Canada triggered air quality alerts and warnings.",
    "url": "https://www.nbcnews.com/science/science-news/canada-wildfires-air-quality-alerts-us-states-rcna151956"
  },
  {
    "text": "Israel's ‘total victory’ in Gaza is unlikely, top US official says  —  It's the bluntest articulation yet from a Biden administration official that Israel can't succeed at its goal of wiping out Hamas.  —  The Biden administration doesn't believe Israel's current strategy against the Hamas militant group … ",
    "url": "https://www.politico.com/news/2024/05/13/israel-total-victory-gaza-unlikely-00157678"
  },
  {
    "text": "My life as a Chinese spy: Secret police agent tells all  —  Loading...  abc.net.au/news/china-spy-secret- police-agent-tells-all-four-corners/ 103826708  —  For the first time ever, an undercover agent for China's secret police steps out of the shadows to tell all about where he's been and who he's been targeting.",
    "url": "https://www.abc.net.au/news/2024-05-13/china-spy-secret-police-agent-tells-all-four-corners/103826708"
  },
  {
    "text": "Harris drops “F-bomb” while encouraging Asian Americans to break down barriers  —  Vice President Kamala Harris let a profanity slip Monday as she emphasized the importance of Asian Americans, Native Hawaiians and Pacific Islanders breaking through the barriers they face.",
    "url": "https://www.cbsnews.com/news/kamala-harris-f-bomb-asian-americans-jimmy-o-yang/"
  }
]