[
  {
    "text": "White House eased China tariffs after warnings of harm to 'Trump's people'  —  The president has backtracked repeatedly on his tariff policies, creating a whiplash with downsides and few clear benefits so far.  —  Some of the president's top aides saw an opening.",
    "url": "https://www.washingtonpost.com/business/2025/05/14/trump-tariffs-china-trade/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6ImRmMzQxMjk1LTU3NzctNDM1NC05ZTA5LWY5OTZjNjFhNzc4MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA1LzE0L3RydW1wLXRhcmlmZnMtY2hpbmEtdHJhZGUvIn0.6SZXjyiHWbKuHY1WxFV7waUmh0lPBsYKNulE6VyklOk&itid=gfta"
  },
  {
    "text": "Trump Tariff Fiasco Worsens as Brutal New Reports Expose a Fresh Scam  —  The White House has been boasting that President Trump's partial pause in the trade war with China is a historic breakthrough.  But two new reports, one from The New York Times and the other from the nonliberal Wall … ",
    "url": "https://newrepublic.com/article/195221/trump-tariff-fiasco-worsens-brutal-new-reports-expose-fresh-scam"
  },
  {
    "text": "Mike Johnson Just Wrecked Trump's Ugly “Working-Class GOP” Scam  —  We keep hearing that the GOP is deeply, existentially conflicted over whether to evolve into a “working-class party.”  Senator Josh Hawley declared as much in The New York Times, urging his party not to slash the safety net to fund … ",
    "url": "https://newrepublic.com/article/195232/mike-johnson-trump-working-class-gop-scam"
  },
  {
    "text": "‘The Titanic’: Johnson predicts House's ‘big, beautiful’ bill will sink in the Senate  —  Sen. Ron Johnson said Wednesday he thinks House Republicans' reconciliation bill is “going down.”  And he's working to ensure its demise.  “The ‘big, beautiful bill,’ I think that's the Titanic,” … ",
    "url": "https://www.politico.com/live-updates/2025/05/14/congress/the-titanic-johnson-predicts-houses-big-beautiful-reconciliation-bill-will-sink-in-the-senate-00348310"
  },
  {
    "text": "Among the problems with Trump's ‘free’ luxury jet from Qatar: It's not actually free  —  Even if the jet from Qatar were free, this arrangement would still be a legal and ethical mess.  But the free plane also wouldn't be free.  —  On Sunday night, as the public first learned … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/problems-trumps-free-luxury-jet-qatar-s-not-actually-free-rcna206706"
  },
  {
    "text": "Conduct oversight on Trump's graft — or censure James Comer  —  House Democrats must pressure Republicans to fulfill their constitutional duties.  —  President Donald Trump arrived in the Middle East on Tuesday as the representative of two different entities.",
    "url": "https://www.washingtonpost.com/opinions/2025/05/14/trump-republicans-ethics-oversight-pressure/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6IjZhNWM5YzY3LTlmZGUtNDUwYi1iZTRkLTVlMzNkM2RkYjE3ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA1LzE0L3RydW1wLXJlcHVibGljYW5zLWV0aGljcy1vdmVyc2lnaHQtcHJlc3N1cmUvIn0.d1eyeb6ix8xfULyq2OqoBcxnCv6oOAsv9FF44S_pXrE&itid=gfta"
  },
  {
    "text": "Gabbard fires leaders of intelligence group that wrote Venezuela assessment  —  The director of national intelligence fired top officials weeks after their group authored an assessment contradicting President Donald Trump's legal rationale for deporting alleged Venezuelan gang members.",
    "url": "https://www.washingtonpost.com/national-security/2025/05/14/gabbard-intelligence-venezuela-tren-de-aragua/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6IjRlZjM3ZGUxLWVlZTktNDljZS04Y2I4LWRkYjY1ODhmNzgxZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA1LzE0L2dhYmJhcmQtaW50ZWxsaWdlbmNlLXZlbmV6dWVsYS10cmVuLWRlLWFyYWd1YS8ifQ.dhXbaQl0xEEhpOQNANxiWBUjscBSDUlXCxRWgGB6xHc&itid=gfta"
  },
  {
    "text": "Multiple Trump White House officials have ties to antisemitic extremists  —  President Trump campaigned on a pledge to fight antisemitism.  —  “Antisemitic bigotry has no place in a civilized society,” Trump said at an event in 2024.  —  However, the president's critics question whether antisemitism … ",
    "url": "https://www.npr.org/2025/05/14/nx-s1-5387299/trump-white-house-antisemitism"
  },
  {
    "text": "Mexican security chief confirms cartel family members entered US in a deal with Trump administration  —  Mexico's security chief confirmed Tuesday that 17 family members of cartel leaders crossed into the U.S. last week as part of a deal between a son of the former head of the Sinaloa Cartel and the Trump administration.",
    "url": "https://apnews.com/article/el-chapo-sinaloa-cartel-trump-border-harfuch-86572a31c88a216da7cd5f33006a0011"
  },
  {
    "text": "New poll: Americans oppose cuts to Medicaid, want Democrats to control the U.S. House  —  ...and Kamala Harris leads Donald Trump in a hypothetical 2024 rematch.  Results from the inaugural Strength In Numbers/Verasight poll … Americans broadly disapprove of the job Donald Trump is doing … ",
    "url": "https://www.gelliottmorris.com/p/new-poll-americans-oppose-trumps"
  },
  {
    "text": "CFBP Quietly Kills Rule to Shield Americans From Data Brokers  —  Russell Vought, acting director of the Consumer Financial Protection Bureau, has canceled plans to more tightly regulate the sale of Americans' sensitive personal data.",
    "url": "https://www.wired.com/story/cfbp-quietly-kills-rule-to-shield-americans-from-data-brokers/"
  },
  {
    "text": "CFPB Quietly Kills Rule to Shield Americans From Data Brokers  —  Russell Vought, acting director of the Consumer Financial Protection Bureau, has canceled plans to more tightly regulate the sale of Americans' sensitive personal data.  —  The Consumer Financial Protection Bureau (CFPB) … ",
    "url": "https://www.wired.com/story/cfpb-quietly-kills-rule-to-shield-americans-from-data-brokers/"
  },
  {
    "text": "An Afrikaner Refugee Has Thoughts About the Jews  —  It's a Very Special Triad today, cowritten with my buddy Will Sommer, author of our False Flag newsletter.  —JVL  —  1. White Genocide?  —  Quick catchup: This week the State Department sent an official to Dulles International Airport … ",
    "url": "https://www.thebulwark.com/p/an-afrikaner-refugee-south-africa-has-thoughts-about-jews-antisemitism-trump"
  },
  {
    "text": "BREAKING: Georgetown Scholar Badar Khan Suri to be Released From ICE Detention  —  The release strikes another blow to the Trump administration following the release of Mohsen Mahdawi and Rumeysa Ozturk.  —  ALEXANDRIA, Virginia - Indian Georgetown scholar Badar Khan Suri is set to be released … ",
    "url": "https://zeteo.com/p/breaking-georgetown-scholar-badar"
  },
  {
    "text": "Democrats just flipped Nebraska's biggest city  —  Democrat John Ewing unseated Republican Mayor Jean Stothert in Tuesday's officially nonpartisan election to lead Omaha, a victory that ends the GOP's 12-year hold on Nebraska's largest city.  —  Stothert conceded the race after 9 PM local … ",
    "url": "https://www.the-downballot.com/p/democrats-just-flipped-nebraskas"
  },
  {
    "text": "The Professors Are Using ChatGPT, and Some Students Aren't Happy About It  —  Students call it hypocritical.  A senior at Northeastern University demanded her tuition back.  But instructors say generative A.I. tools make them better at their jobs.  —  In February, Ella Stapleton … ",
    "url": "https://www.nytimes.com/2025/05/14/technology/chatgpt-college-professors.html?unlocked_article_code=1.HE8.sJHw.KHcPd33Y7gfX"
  },
  {
    "text": "Fabian Schmidt speaks out for the first time since his detention  —  Fabian Schmidt, who is originally from Germany, made it clear that he's proud to be in America, but said he's still reeling from his unexpected two-month detention that he described as “dehumanizing.”",
    "url": "https://www.wgbh.org/news/local/2025-05-13/fabian-schmidt-speaks-out-for-the-first-time-since-his-detention"
  },
  {
    "text": "Ocasio-Cortez Warns: Trump Admin Will Have a ‘Problem’ if More Democrats Arrested  —  Rep. Alexandria Ocasio-Cortez (D-NY) has warned the Trump administration that they will be in for a “problem” if they arrest any more Democrats.  —  The congresswoman issued her warning in an Instagram video posted … ",
    "url": "https://www.breitbart.com/immigration/2025/05/13/ocasio-cortez-warns-trump-administration-problem-more-democrats-arrested/"
  },
  {
    "text": "Trump's egg price fiction has suddenly become reality  —  For months, President Donald Trump has falsely claimed that egg prices are tumbling.  It wasn't true then, but it's true now.  —  Egg prices fell 12.7% last month, the biggest monthly decline since 1984, the Bureau of Labor Statistics reported Tuesday.",
    "url": "https://cnn.com/2025/05/13/business/egg-prices-trump-inflation"
  },
  {
    "text": "The End of Rule of Law in America … The president of the united states appears to have long ago forgotten that Americans fought the Revolutionary War not merely to secure their independence from the British monarchy but to establish a government of laws, not of men, so that they and future generations … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/05/law-america-trump-constitution/682793/?gift=Ut5zkH9vG00uzi0vmoT5f0GQIc9HseVdfn86igFuw90&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Musk Adviser May Make as Much as $1 Million a Year While Helping to Dismantle Agency that Regulates Tesla and X  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  One of Elon Musk's employees … ",
    "url": "https://www.propublica.org/article/doge-elon-musk-chris-young-cfpb-tesla-x"
  },
  {
    "text": "Washington Post editorial board says Pirro not ‘qualified’ to be DC attorney  —  The editorial board of The Washington Post is coming out against President Trump's decision to tap former Fox News host Jeanine Pirro to serve as the top prosecutor in the District of Columbia.",
    "url": "https://thehill.com/homenews/media/5299832-washington-post-trump-jeanine-pirro/"
  },
  {
    "text": "Scoop: Trump impeachment called “idiotic” in House Dem meeting  —  A rogue Trump impeachment push was criticized as “idiotic” and “horrible” in a closed-door House Democratic meeting Wednesday, Axios has learned.  —  Why it matters: The comments from Rep. Jerry Nadler (D-N.Y.) … ",
    "url": "https://www.axios.com/2025/05/14/trump-impeachment-pelosi-thanedar-nadler"
  },
  {
    "text": "U.S. Tells Court It Plans to Deport Scientist to Russia  —  Kseniia Petrova, a Harvard researcher, was detained Feb. 16 at Logan Airport after failing to declare scientific samples she carried into the U.S.  —  Government lawyers told a federal judge on Wednesday that the Trump administration intends … ",
    "url": "https://www.nytimes.com/2025/05/14/health/detained-russian-scientist-harvard.html"
  },
  {
    "text": "DHS Claims Tourism To Afghanistan Reason To End Immigration Protection  —  Stuart Anderson writes about immigration, business and globalization.  —  SaveComment  —  To justify ending immigration protections for Afghans, Trump officials have cited increased tourism to the violent and impoverished country.",
    "url": "https://www.forbes.com/sites/stuartanderson/2025/05/14/dhs-claims-tourism-to-afghanistan-reason-to-end-immigration-protection/"
  },
  {
    "text": "Democrats are deeply pessimistic about the future of their party, an AP-NORC poll finds  —  Six months after Donald Trump's presidential victory, Democrats remain deeply pessimistic about the future of their party, although neither the Democratic Party nor the Republican Party is viewed favorably by a majority of U.S. adults.",
    "url": "https://apnews.com/article/poll-democrats-pessimism-sanders-ocasio-cortez-schumer-8dcde90d9666721fb376db90140f8e23"
  },
  {
    "text": "US transportation secretary changed wife's flight from Newark after ongoing issues at airport  —  Airport has seen multiple serious failures in past weeks while Sean Duffy has assured the public it's safe to fly from there  —  Sean Duffy, the Trump administration's transportation secretary … ",
    "url": "https://www.theguardian.com/us-news/2025/may/14/newark-airport-safety-transportation-secretary-flight"
  },
  {
    "text": "The Republican squirm is in full swing  —  Amid a series of extraordinary Trump gambits in recent days, Republicans are straining — hard — to avoid passing judgment.  —  In some ways, it seems President Donald Trump's goal in life is to make his fellow Republicans squirm.",
    "url": "https://www.washingtonpost.com/politics/2025/05/14/trump-republicans-squirm-congress/"
  },
  {
    "text": "Trump surgeon general pick praised unproven psychedelic therapy, said mushrooms helped her find love  —  President Donald Trump's new pick for surgeon general wrote in a recent book that people should consider using unproven psychedelic drugs as therapy and in a newsletter suggested her use … ",
    "url": "https://apnews.com/article/means-trump-surgeon-general-mushrooms-psychedelic-drugs-72c22ed077409b4bb865214e7ef304a8"
  },
  {
    "text": "Murphy says ‘no doubt’ Biden suffered cognitive decline while in office  —  Few elected Democrats have so far been as direct in their criticism of the former president.  —  Democratic Sen. Chris Murphy said there's “no doubt” that former President Joe Biden suffered cognitive decline in office … ",
    "url": "https://www.politico.com/news/2025/05/14/murphy-biden-cognitive-decline-2028-00349025"
  },
  {
    "text": "Marco Rubio working on major changes to National Security Council  —  Under the plan, the NSC would shrink and shift from making recommendations to the president to carrying out his orders.  —  Secretary of State Marco Rubio, in his new add-on role of national security adviser … ",
    "url": "https://www.nbcnews.com/politics/national-security/rubio-working-major-changes-national-security-council-rcna206658"
  },
  {
    "text": "Lord Buffalo Forced to Cancel European Tour After U.S. Border Police Detained Their Drummer  —  What a wonderful time we're all living in.  Nazis are emboldened and on the rise, tariffs are going to send our economy into a tailspin, and our fascist president has a not-so-secret police force … ",
    "url": "https://www.metalsucks.net/2025/05/14/lord-buffalo-forced-to-cancel-european-tour-after-u-s-border-police-detained-their-drummer/"
  },
  {
    "text": "Trump Gushes with Envy Toward the House of Saud  —  Good morning to everyone except whoever did the president's makeup today:  —  Happy Wednesday.  —  Autocrats, Kleptocrats, Plutocrats... Oh My!  —  by William Kristol  —  What a spectacle!  There they were yesterday, assembled in Riyadh … ",
    "url": "https://www.thebulwark.com/p/trump-gushes-with-envy-toward-the-house-of-saud-saudi-arabia-mbs-salman"
  },
  {
    "text": "White House bans U.S. agencies from all work on G-20 in South Africa  —  President Donald Trump previously suggested a boycott of the G-20 convention over South Africa's “land confiscation” law.  —  The White House National Security Council has ordered U.S. agencies and departments … ",
    "url": "https://www.washingtonpost.com/business/2025/05/14/white-house-g20-boycott-talks/"
  }
]