[
  {
    "text": "Here's the latest.  —  The Israeli government has been making preparations for weeks for an attack on Iran's nuclear facilities.  —  Here's the latest.  —  Explosions rocked Tehran early Friday morning, and Israel's defense minister said his country's warplanes had carried out an attack on Iran … ",
    "url": "https://www.nytimes.com/live/2025/06/12/world/israel-iran-us-nuclear?unlocked_article_code=1.Ok8.U3b4.WA988zCDEwXA&smid=url-share"
  },
  {
    "text": "Israel launches ‘preemptive’ air strikes on Iran  —  Israel launched air strikes inside Iran late Thursday, the latest effort by the Jewish state to destroy Tehran's nuclear program.  —  The targets of the operation, the extent of the damage, and any casualties were not immediately clear.",
    "url": "https://nypost.com/2025/06/12/world-news/israel-launches-preemptive-air-strikes-on-iran/"
  },
  {
    "text": "Israel strikes nuclear and missile sites across Iran  —  The Israeli Air Force conducted dozens of strikes in Iran on Thursday targeting nuclear and missile sites.  —  Why it matters: Israel is directly attacking its biggest and best-armed adversary, without clear backing from the U.S.",
    "url": "https://www.axios.com/2025/06/13/israel-strike-iran-trump-nuclear-talks"
  },
  {
    "text": "Trump warns a strike on Iran ‘could very well happen’ if no nuclear deal is signed  —  President Trump warned Thursday that a “massive conflict” could break out in the Middle East over the issue of Iran's nuclear program but said he wants a diplomatic resolution, after the United Nations … ",
    "url": "https://www.npr.org/2025/06/12/nx-s1-5431758/trump-iran-strike-nuclear"
  },
  {
    "text": "Israel launches strike against Iran  —  It was unclear how extensive the Israeli strike against Iran was or whether nuclear facilities were targeted.  —  Israel said Thursday that it launched a “preemptive strike” against Iran, raising the specter of a broader regional conflict between the long-time Middle East adversaries.",
    "url": "https://www.politico.com/news/2025/06/12/israel-launches-strike-against-iran-00404354"
  },
  {
    "text": "Israel attacks Iran's capital with explosions booming across Tehran  —  Israel attacked Iran's capital early Friday, with explosions booming across Tehran as Israel said it targeted nuclear and military sites.  The attack comes as tensions have reached new heights over Tehran's rapidly advancing nuclear program.",
    "url": "https://apnews.com/article/iran-explosions-israel-tehran-00234a06e5128a8aceb406b140297299"
  },
  {
    "text": "Tensions explode on House floor over Padilla incident  —  Rep. John Mannion (D-N.Y.) shocked colleagues in both parties Thursday by tearing into Rep. Mike Lawler (R-N.Y.) in what sources described as a tense and profane confrontation over the forcible removal of Sen. Alex Padilla (D-Calif.).",
    "url": "https://www.axios.com/2025/06/12/alex-padilla-john-mannion-mike-lawler-house-floor"
  },
  {
    "text": "Sen. Alex Padilla is forcibly removed from DHS Secretary Kristi Noem's news conference  —  The Democrat said he had questions for Trump's Cabinet secretary during her press conference in Los Angeles.  —  Sen. Alex Padilla, D-Calif., was forcibly removed from a news conference in Los Angeles … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-alex-padilla-forcibly-removed-dhs-sec-kristi-noems-press-conferenc-rcna212688"
  },
  {
    "text": "Noem Says National Guard Occupation Is Meant To ‘Liberate’ LA From Its Mayor And Governor  —  This is your TPM evening briefing.  —  Just before Sen. Alex Padilla (D-CA) was forcibly removed from a Department of Homeland Security press briefing, forced to the ground and then handcuffed … ",
    "url": "https://talkingpointsmemo.com/where-things-stand/noem-says-national-guard-occupation-is-meant-to-liberate-la-from-its-mayor-and-governor"
  },
  {
    "text": "CNN Security Analyst Defends Kristi Noem and Agents Who Shoved Senator Out of Presser  —  A CNN analyst who once served as an FBI special agent defended some of the tactics used by Secret Service and FBI personnel in their clash with Sen. Alex Padilla (D-CA) Thursday.",
    "url": "https://www.mediaite.com/media/news/cnn-security-analyst-defends-kristi-noem-and-agents-who-shoved-senator-out-of-presser/"
  },
  {
    "text": "Judge sharply questions Trump's Guard deployment to Los Angeles  —  U.S. District Judge Charles Breyer says he's poised to rule as soon as Thursday evening.  —  SAN FRANCISCO — A federal judge cast doubts Thursday on the legality of President Donald Trump's deployment of the National Guard in Los Angeles … ",
    "url": "https://www.politico.com/news/2025/06/12/national-guard-california-lawsuit-court-hearing-00403910"
  },
  {
    "text": "Judge orders Trump to return National Guard to California's control  —  A federal judge on Thursday granted California Gov. Gavin Newsom's request to block the Trump administration from federalizing the National Guard for deployment to Los Angeles amid protests over federal immigration raids.",
    "url": "https://www.axios.com/2025/06/13/trumps-la-california-national-guard-deployment"
  },
  {
    "text": "Judge rules Trump's Guard deployment in Los Angeles is illegal  —  U.S. District Judge Charles Breyer ordered the president to return control of the Guard to Gov. Gavin Newsom.  —  A federal judge has ordered President Donald Trump to relinquish control of California's National Guard troops … ",
    "url": "https://www.politico.com/news/2025/06/12/donald-trump-national-guard-deployment-illegal-00404451"
  },
  {
    "text": "Trump plans broader use of National Guard in immigration enforcement  —  The White House wants the national guard to play a bigger role in immigration enforcement, Trump's border czar, Tom Homan, said in an interview Thursday.  —  Summary267  —  The Trump administration wants to use … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/12/trump-miller-national-guard-ice/"
  },
  {
    "text": "Trump exceeded powers by sending National Guard, Marines to L.A., judge rules  —  President Donald Trump acted illegally when he ordered thousands of National Guard troops and Marines onto the streets of Los Angeles to combat protests of immigration raids, a federal judge ruled Thursday.",
    "url": "https://www.sfchronicle.com/politics/article/u-s-district-judge-charles-breyer-says-20374348.php"
  },
  {
    "text": "Trump's Big Bill Would Be More Regressive Than Any Major Law in Decades  —  The authors reviewed distributional analyses from bills over the last 35 years.  —  The Republican megabill now before the Senate cuts taxes for high earners and reduces benefits for the poor.",
    "url": "https://www.nytimes.com/interactive/2025/06/12/upshot/gop-megabill-distribution-poor-rich.html"
  },
  {
    "text": "Trump's birthday parade may be cancelled over thunderstorms  —  Army spokesman tells The Times of safety fears as president hopes to mark 250 years of the US military with event in Washington on Saturday  —  President Trump's plans to hold a military parade in Washington on his 79th birthday … ",
    "url": "https://www.thetimes.com/us/american-politics/article/is-trump-birthday-parade-cancelled-weather-pbrg02h2z"
  },
  {
    "text": "Protesters in Chicago return to the streets.  —  “Sir, sir.”  “Hands up.  Hands up. ”  I'm Senator Alex Padilla.  I have questions for the secretary because the fact of the matter is, a half a dozen violent criminals that should —\" “On the ground.  Hands behind your back.  Hands behind your back.",
    "url": "https://www.nytimes.com/live/2025/06/12/us/la-protests-trump-marines-ice?unlocked_article_code=1.OU8.waJi._RELGImExhIX"
  },
  {
    "text": "ICE activity reported at 2 Downey churches  —  DOWNEY, Calif. — The city of Los Angeles is on high alert on the sixth day of protests over ICE activity, and President Trump sending in 4,000 National Guard members and 700 Marines.  —  Civil rights leaders on Wednesday said ICE agents showed up at two churches in Downey.",
    "url": "https://spectrumnews1.com/ca/southern-california/politics/2025/06/11/downey-churches-raided-by-ice-agents"
  }
]