[
  {
    "text": "Live Updates: Judge Says Fani Willis Can Stay on Trump Case If Ex-Boyfriend Withdraws  —  The Atlanta district attorney's romantic relationship with the lead prosecutor she hired to oversee the case created an “appearance of impropriety,” the judge said, ruling that the prosecution can't proceed unless he leaves or she steps aside.",
    "url": "https://www.nytimes.com/live/2024/03/15/us/fani-willis-trump-georgia"
  },
  {
    "text": "Fani Willis can stay on Trump Georgia case, but only if Wade steps aside, judge says  —  ATLANTA — The judge overseeing the Georgia election interference case against former president Donald Trump and his allies ruled that Fulton County District Attorney Fani T. Willis (D) … ",
    "url": "https://www.washingtonpost.com/national-security/2024/03/15/fani-willis-trump-georgia-case/"
  },
  {
    "text": "I Listened to Trump's Rambling, Unhinged, Vituperative Georgia Rally—and So Should You  —  The ex-President is building a whole new edifice of lies for 2024.  —  I'm sure you had better things to do on Saturday evening than watch Donald Trump rant for nearly two hours to an audience of cheering fans in Rome, Georgia.",
    "url": "https://www.newyorker.com/news/letter-from-bidens-washington/i-listened-to-trumps-rambling-unhinged-vituperative-georgia-rally-and-so-should-you"
  },
  {
    "text": "Fulton County DA Fani Willis case against Trump can continue if she or special prosecutor Wade remove themselves, judge rules  —  Trump co-defendant Michael Roman accused Willis of misconduct for her “clandestine” relationship with Nathan Wade, whom she appointed as special counsel.",
    "url": "https://www.nbcnews.com/politics/donald-trump/fani-willis-trump-georgia-rcna139810"
  },
  {
    "text": "Judge rules Fulton DA Willis can stay — if Wade steps aside  —  Fulton County District Attorney Fani Willis must either step aside or cut ties with her special prosecutor before the election interference case against Donald Trump can move forward, a judge ruled Friday.",
    "url": "https://www.ajc.com/politics/judge-rules-fulton-da-willis-can-stay-if-wade-steps-aside/3BDOOBKOEBHJBM3X2UOU7QKMXY/"
  },
  {
    "text": "Judge denies one of Trump's motions to dismiss classified documents case  —  U.S. District Judge Aileen Cannon issued the ruling after hearing daylong arguments from lawyers for the former president and special counsel Jack Smith's office.  —  FORT PIERCE, Fla. — The judge presiding … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-florida-classified-documents-dismiss-rcna143135"
  },
  {
    "text": "Fulton County judge says district attorney Fani Willis can continue to prosecute the 2020 election interference case  —  Fulton County District Attorney Fani Willis can stay on and prosecute the Georgia 2020 election interference racketeering case against former President Donald Trump and 14 … ",
    "url": "https://www.cnn.com/2024/03/15/politics/fani-willis-fulton-county-donald-trump-election-subversion-scott-mcafee/"
  },
  {
    "text": "A majority of House Republicans retreat from their retreat  —  Good morning, Early Birds.  Congrats to NC State for knocking off Duke in the ACC men's basketball tournament.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2024/03/15/majority-house-republicans-retreat-their-retreat/"
  },
  {
    "text": "Joe Biden's obsessive search for the right words … One day when Jen Psaki was serving as White House press secretary, she was asked to introduce President Biden at a virtual event commemorating Greek Independence Day.  It was no big deal, Psaki thought — she would join the Zoom session from her office … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/15/joe-bidens-private-speech-prep-can-be-scary-his-aides/"
  },
  {
    "text": "Red flags raised about FBI's Biden informant as far back as 2016  —  Federal prosecutors were put on notice as far back as 2016 that Alexander Smirnov, the confidential FBI informant whose alleged lies about President Biden's business dealings fueled — and then damaged — a Republican impeachment effort … ",
    "url": "https://www.cbsnews.com/news/alexander-smirnov-fbi-informant-bidens-fraudster-in-prior-case/"
  },
  {
    "text": "GOP nominee to run North Carolina public schools called for violence against Democrats, including executing Obama and Biden  —  The Republican nominee for superintendent overseeing North Carolina's public schools and its $11 billion budget has a history marked by extreme and controversial comments … ",
    "url": "https://www.cnn.com/2024/03/14/politics/kfile-gop-nominee-north-carolina-public-schools-michele-morrow-executing-democrats/"
  },
  {
    "text": "Matt Gaetz subpoenaed in friend's lawsuit accusing others of defamation in sex trafficking probe  —  The Justice Department has told the Florida Republican that he will not face any charges as a result of its probe.  Gaetz is not a direct party to the defamation lawsuit.",
    "url": "https://www.nbcnews.com/politics/congress/matt-gaetz-subpoenaed-friends-lawsuit-accusing-others-defamation-sex-t-rcna143489"
  },
  {
    "text": "Schumer discusses ‘long-shot scenario’ with Manchin: Last-ditch Senate run in West Virginia  —  Hear more from Sen. Joe Manchin and the fight for control of the US Senate on “Inside Politics Sunday with Manu Raju” at 8 a.m. ET and 11 a.m. ET.  —  Senate Majority Leader Chuck Schumer recently discussed … ",
    "url": "https://www.cnn.com/2024/03/14/politics/joe-manchin-independent-senate-run/"
  },
  {
    "text": "The first ship to use a new sea route approaches Gaza with 200 tons of aid  —  A ship carrying 200 tons of aid for Palestinians was seen nearing Gaza on Friday.  The ship set sail for Gaza from Cyprus on Tuesday in a pilot program for the opening of a sea corridor to the territory … ",
    "url": "https://apnews.com/article/israel-hamas-war-news-03-15-2024-d4e2f9ed525914233e4cf16c217f5248"
  },
  {
    "text": "Bernie Sanders pushes bill to establish a four-day workweek  —  The Sanders-led bill would reduce the standard workweek from 40 to 32 hours over four years and protect workers' pay and benefits.  —  Sen. Bernie Sanders, I-Vt., held a hearing Thursday on a bill he introduced to reduce … ",
    "url": "https://www.nbcnews.com/politics/congress/bernie-sanders-pushes-bill-establish-four-day-workweek-rcna143354"
  },
  {
    "text": "TikTok needs a conservative US buyer  —  The prospect of TikTok needing a U.S. buyer increased this week after the House of Representatives passed a bill that would require the social media app's parent company, ByteDance, to divest from the app or face a ban.",
    "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/2921601/tiktok-needs-conservative-us-buyer/"
  },
  {
    "text": "Biden is coming out in opposition to plans to sell US Steel to a Japanese company  —  WASHINGTON (AP) — President Joe Biden is coming out in opposition to the planned sale of U.S. Steel to Nippon Steel of Japan, saying in a statement to be released Thursday that the U.S. needs to … ",
    "url": "https://apnews.com/article/biden-steel-nippon-kishida-merger-purchase-201b3d5719bcf77067cb81d181442afb"
  },
  {
    "text": "Jury reaches verdict in James Crumbley's involuntary manslaughter trial  —  Crumbley was charged in connection with son Ethan's 2021 school shooting at Oxford High School in Michigan.  His wife, Jennifer, was convicted on the same charge.  —  PONTIAC, Mich. — The 12 jurors weighing the fate … ",
    "url": "https://www.nbcnews.com/news/us-news/verdict-james-crumbley-involuntary-manslaughter-trial-rcna143174"
  },
  {
    "text": "Republicans don't actually want you to remember 4 years ago  —  Reagan's question does not reflect poorly on Biden.  On the contrary. … “Are you better off today than you were four years ago?”  Rep. Elise Stefanik asked during a news conference last week.",
    "url": "https://www.publicnotice.co/p/are-you-better-off-2024-election-gop-trump"
  },
  {
    "text": "And the RBG Award goes to ... Elon Musk and Rupert Murdoch?  —  Four men — plus Martha Stewart — will receive the award named after the late Supreme Court justice, who championed liberal causes and women's rights  —  Since 2020, a foundation has honored prominent women … ",
    "url": "https://www.washingtonpost.com/style/power/2024/03/14/ruth-bader-ginsburg-award-elon-musk-martha-stewart/"
  },
  {
    "text": "More Counties Saw Population Gains in 2023  —  Note: Data will be available before 8 a.m. ET on public release day.  —  MARCH 14, 2024 - More U.S. counties experienced population gains than losses in 2023, as counties in the South saw faster growth and more Northeast and Midwest counties … ",
    "url": "https://www.census.gov/newsroom/press-releases/2024/population-estimates-more-counties-population-gains-2023.html"
  },
  {
    "text": "Tornadoes Leave Chaos and Destruction After Pounding 3 States  —  Police walked back confirmation that at least 3 people died in Indiana after a tornado swept through a trailer park.  —  Police have walked back earlier claims that at least three people were killed in Indiana … ",
    "url": "https://www.thedailybeast.com/tornadoes-leave-wake-of-death-and-destruction-after-pounding-3-states"
  }
]