[
  {
    "text": "Trump Is Stupid, Erratic and Weak  —  Live shot of Donald Trump setting tariffs:  —  And here's what happened yesterday:  —  Anyone sounding the all-clear on tariffs, or Trump economic policy in general, should be kept away from sharp objects and banned from operating heavy machinery.",
    "url": "https://paulkrugman.substack.com/p/trump-is-stupid-erratic-and-weak"
  },
  {
    "text": "We Just Saw the Cracks in Trump's Wall of Power  —  The past week undermined the narrative that has surrounded the president — that he is a political juggernaut able to run roughshod over his party and beyond.  —  The opening months of President Donald Trump's second term have been studded … ",
    "url": "https://www.politico.com/news/magazine/2025/04/10/donald-trump-vulnerabilities-tariffs-budget-00283251"
  },
  {
    "text": "Trump blinked, but the global economy will never be the same  —  There is now sand — a lot of it — in the gears of global commerce, and it won't be going away in the foreseeable future.  —  Why it matters: President Trump may have backed down on some of the most extreme — and hardest to justify … ",
    "url": "https://www.axios.com/2025/04/10/trump-pauses-tariffs-90-days-china"
  },
  {
    "text": "Where do tariffs stand?  A look at what's in place and what's on pause  —  The past week has been a wild ride for businesses and markets, starting with President Trump's announcement of sweeping tariffs and ending with an abrupt pause on most of them.  —  About 12 hours after country … ",
    "url": "https://www.npr.org/2025/04/10/nx-s1-5358929/trump-tariff-pause-china"
  },
  {
    "text": "House Republicans Just Passed a Voter Suppression Bill That Would Disenfranchise Millions  —  Two weeks after Donald Trump issued a sweeping anti-voting executive order, the House of Representatives on Thursday passed a measure, the SAVE Act, that is described by voting rights advocates … ",
    "url": "https://www.motherjones.com/politics/2025/04/save-act-voter-suppression-trump/"
  },
  {
    "text": "SAVE Act: House Passes GOP Voting Bill That Could Disenfranchise Millions  —  The U.S. House of Representatives voted Thursday to pass the Safeguard American Voter Eligibility (SAVE) Act, a major voter suppression measure that, if it became law, could disenfranchise millions of eligible voters and badly undermine U.S. democracy.",
    "url": "https://www.democracydocket.com/news-alerts/house-passes-save-act-voter-suppression-law/"
  },
  {
    "text": "Trump Administration Wants to Install Federal Oversight of Columbia University  —  Government is aiming to legally bind the school to changes as they negotiate over federal funding  —  The Trump administration is planning to pursue a legal arrangement that would put Columbia University … ",
    "url": "https://www.wsj.com/us-news/education/columbia-consent-decree-trump-federal-funding-2f4c4690?st=8cAJuH&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Pressed for evidence against Mahmoud Khalil, government cites its power to deport people for beliefs  —  Facing a deadline from an immigration judge to turn over evidence for its attempted deportation of Columbia University activist Mahmoud Khalil, the federal government has instead submitted a brief memo … ",
    "url": "https://apnews.com/article/mahmoud-khalil-columbia-university-trump-c60738368171289ae43177660def8d34"
  },
  {
    "text": "Plane at Reagan Airport carrying lawmakers bumps wings with another plane  —  Washington — Several members of Congress were on a plane that was sitting on the tarmac waiting to leave Washington on Thursday when it was clipped by another aircraft.  —  American Airlines said no injuries were reported … ",
    "url": "https://www.cbsnews.com/news/plane-carrying-lawmakers-bumps-wings-with-another-plane/"
  },
  {
    "text": "Trump Signs Orders Punishing Those Who Opposed His 2020 Election Lies  —  The president targeted two officials from his first administration and an elite law firm as part of his campaign for retribution.  —  President Trump on Wednesday signed executive orders punishing two officials … ",
    "url": "https://www.nytimes.com/2025/04/09/us/politics/trump-executive-orders-law-firm-krebs.html"
  },
  {
    "text": "Top Pro Bono Leader Resigns from Paul Weiss, a Firm Hit in Trump's Crackdown on Big Law  —  Steven Banks, who once ran New York's social services department, said he wanted to return to helping the homeless.  He leaves within weeks of the elite firm striking a deal with President Trump.",
    "url": "https://www.nytimes.com/2025/04/09/business/paul-weiss-steven-banks-trump.html"
  },
  {
    "text": "White House axes land bureau pick after past Jan. 6 criticism  —  The Trump administration has withdrawn the nomination of Kathleen Sgamma to be director of the Bureau of Land Management, Senate Energy and Natural Resources Chairman Mike Lee said Thursday.  —  Why it matters … ",
    "url": "https://www.axios.com/pro/energy-policy/2025/04/10/white-house-withdraws-blm-nominee-kathleen-sgammas-nomination"
  },
  {
    "text": "The House: Democrats Favored on What Starts as a Small Battlefield … KEY POINTS FROM THIS ARTICLE  — History suggested Democrats would be favored to flip the House in 2026 as soon as Donald Trump clinched the presidency in 2024.  — Little that's happened over the last several months calls … ",
    "url": "https://centerforpolitics.org/crystalball/the-house-democrats-favored-on-what-starts-as-a-small-battlefield/"
  },
  {
    "text": "Dow falls 1,000 points as tariff sell-off resumes after historic rally: Live updates  —  Stocks fell Thursday, giving back some of the historic rally seen in the previous session after President Donald Trump announced a 90-day reprieve on some of his “reciprocal” tariffs.",
    "url": "https://www.cnbc.com/2025/04/09/stock-market-today-live-updates.html"
  },
  {
    "text": "Inside Elon Musk's Gleeful Destruction of the Government  —  The world's richest man has blazed a staggering trail of destruction as Trump's DOGE chief, firing tens of thousands of workers while cashing in  —  B  —  en Vizzachero had his dream job, working as a wildlife biologist with the Los Padres National Forest in California.",
    "url": "https://www.rollingstone.com/politics/politics-features/elon-musk-trump-doge-destruction-1235314218/"
  },
  {
    "text": "The Free Press' Passage Into the Dark Side  —  When Bari Weiss resigned from The New York Times in 2020, she wrote an open letter to her boss, A.G. Sulzberger, explaining why she felt compelled to quit.  Citing bullying from liberal colleagues for her “wrongthink,” and depicting the culture … ",
    "url": "https://www.theunpopulist.net/p/the-free-press-passage-into-the-dark"
  },
  {
    "text": "Feds move to drop criminal case against man they previously called a major gang leader  —  Pam Bondi, Kash Patel and President Donald Trump celebrated his arrest.  —  Federal prosecutors have abruptly abandoned the criminal case against a Virginia man portrayed by the Justice Department … ",
    "url": "https://www.politico.com/news/2025/04/09/drop-criminal-case-man-called-gang-leader-00283355"
  },
  {
    "text": "Judge finds Newsmax aired false and defamatory claims about voting-tech company  —  A Delaware judge, once again, has found that a conservative news outlet broadcast false and defamatory claims about the role a voting technology company played in the 2020 presidential election.",
    "url": "https://www.npr.org/2025/04/09/nx-s1-5357885/newsmax-dominion-defamation-2020-election"
  },
  {
    "text": "Social Security backtracks on in-person identification policy after outcry.  Here's what it means.  —  The Social Security Administration said it's backtracking from a requirement that would have forced some elderly and disabled people to visit agency offices in person to verify … ",
    "url": "https://www.cbsnews.com/news/social-security-phone-identity-verification-reversal-backtrack-doge-cuts/"
  },
  {
    "text": "Scoop: Top Senate Dems propose emergency Social Security payment boost  —  Top Senate Democrats plan to unveil legislation that would provide an emergency $200 monthly increase in Social Security benefits through the end of the year, Axios has learned.  —  Why it matters: It's … ",
    "url": "https://www.axios.com/2025/04/10/chuck-schumer-elizabeth-warren-senate-democrats-social-security"
  },
  {
    "text": "Trump directs agencies to quietly repeal regulations — without public notice  —  The memo appears to rely on a misinterpretation of a recent Supreme Court ruling.  —  President Donald Trump has instructed federal agencies and their assigned DOGE teams to repeal any existing regulations … ",
    "url": "https://www.politico.com/news/2025/04/10/federal-agencies-public-notice-comment-trump-administration-00284499"
  },
  {
    "text": "Facebook Pushes Its Llama 4 AI Model to the Right, Wants to Present “Both Sides”  —  Bias in artificial intelligence systems, or the fact that large language models, facial recognition, and AI image generators can only remix and regurgitate the information in data those technologies are trained on … ",
    "url": "https://www.404media.co/facebook-pushes-its-llama-4-ai-model-to-the-right-wants-to-present-both-sides/"
  },
  {
    "text": "U.S. ambassador to Ukraine to resign her post early  —  U.S. ambassador to Ukraine Bridget Brink intends to resign from her post early, three sources told CBS News.  —  The State Department confirmed her intent to step down Thursday afternoon.  —  “Ambassador Brink is stepping down.",
    "url": "https://www.cbsnews.com/news/bridget-brink-ambassador-to-ukraine-to-resign-sources/"
  },
  {
    "text": "This Is Why Dictatorships Fail  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  He blinked.  But we don't really know why.  —  Whether it was the stock market cascading downward, investors fleeing from U.S. Treasury bonds … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/dictatorships-trump-republicans/682387/?gift=hVZeG3M9DnxL4CekrWGK3w91_tJ51CyOQSpdjYyFh9Q&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "John Roberts will save the judiciary if he has to burn it down  —  ✍️ ⚖️ ✍️ With corporate outlets obeying in advance, supporting independent political media is more important right now than ever.  Public Notice is possible thanks to paid subscribers.",
    "url": "https://www.publicnotice.co/p/john-roberts-alien-enemies-act-ruling-trump"
  }
]