[
  {
    "text": "Israel-Gaza war live updates  —  Israeli military preparing ‘wide range’ attacks as Gaza residents flee  —  The Israeli military said it is preparing a “wide range of offensive operative plans” for Gaza, including attacks by land, sea and air, after warning the entire population … ",
    "url": "https://www.washingtonpost.com/world/2023/10/14/israel-gaza-war-updates-hamas-palestine/"
  },
  {
    "text": "A flood of misinformation shapes views of Israel-Gaza conflict  —  The barrage of false images, memes, videos and posts — mostly generated from within the region itself — is making it difficult to assess what is real.  —  A WhatsApp voice memo purporting to have insider information … ",
    "url": "https://www.washingtonpost.com/technology/2023/10/14/propaganda-misinformation-israel-hamas-war-social-media/"
  },
  {
    "text": "Inside Trump's Backroom Effort to Lock Up the Nomination  —  As the former president dodges debates, it can seem as if he's bypassing the primary.  But he and his team have been working quietly to twist the delegate rules in their favor.  —  Not long after the new chairman of the Republican Party … ",
    "url": "https://www.nytimes.com/2023/10/14/us/politics/trump-delegate-strategy.html"
  },
  {
    "text": "‘Get in the Game’: G.O.P. Candidates Plead Their Case to Major Donors  —  Rivals to Donald J. Trump and their strategists told financiers that time is running out to build up a viable alternative to the former president.  —  With less than 100 days until the Iowa caucuses … ",
    "url": "https://www.nytimes.com/2023/10/14/us/politics/desantis-haley-donor-gatherings.html"
  },
  {
    "text": "Judge punishes Rudy Giuliani for ‘continued and flagrant disregard’ of court orders  —  U.S. District Judge Beryl Howell said jurors at an upcoming trial will be told that the former Trump lawyer intentionally tried to hide financial documents.  —  The judge presiding over the upcoming damages trial … ",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-punishes-rudy-giuliani-flagrant-disregard-court-orders-rcna120412?taid=652a9eedd10457000169719c"
  },
  {
    "text": "The Real Danger in Robert F. Kennedy Jr.'s Independent Run  —  Most of the concern over the independent presidential campaigns of Robert F. Kennedy Jr., Cornel West and the No Labels party has focused on the risk that they could draw votes away from President Biden and throw the 2024 election to Donald Trump.",
    "url": "https://www.nytimes.com/2023/10/14/opinion/the-real-danger-in-robert-f-kennedy-jrs-independent-run.html"
  },
  {
    "text": "Joe Biden, defender of democracy  —  In just under 13 months, we will face our next existential question: Will we choose to continue the American experiment, or will the forces of darkness, revenge and power take control, probably for the foreseeable future?",
    "url": "https://thehill.com/opinion/campaign/4253280-joe-biden-defender-of-democracy/"
  },
  {
    "text": "'I Don't Have Any Regrets': Former CIA Director Defends Letter Calling Hunter Biden Laptop Russian Disinformation  —  Former CIA Director Leon Panetta defended the letter on the Hunter Biden laptop on Friday's episode of “Special Report with Bret Baier.”  —  Panetta told Fox News host Bret Baier … ",
    "url": "https://dailycaller.com/2023/10/13/former-cia-director-leon-panetta-defends-hunter-biden-laptop-letter-russian-disinformation/"
  },
  {
    "text": "Republicans ramp up search for an escape hatch from speaker chaos  —  A bipartisan solution to the GOP's leadership problems still sounds farfetched to most.  But then, so does Jim Jordan's prospects of winning next week.  —  Centrists are signaling they're open to a deal.  Democrats are outlining terms.",
    "url": "https://www.politico.com/news/2023/10/13/stopgap-speaker-00121409"
  },
  {
    "text": "The House Speaker Race Is a Mess—and So Is the GOP  —  Even if Jordan wins, the GOP caucus is like a Rubik's cube.  If you do what you have to do to fix one side, you are likely to mess up your previous work on the opposite side. … It's dumpster fire time as the House GOP's dysfunction … ",
    "url": "https://www.thedailybeast.com/the-house-speaker-race-is-a-messand-so-is-the-gop"
  },
  {
    "text": "GOP reps introduce bill to stem flow of Palestinians into US amid Israel-Hamas conflict  —  Reps. Tom Tiffany (R-Wis.) and Andy Ogles (R-Tenn.) are set to introduce legislation that would curb the flow of Palestinians looking to resettle in the United States.",
    "url": "https://thehill.com/homenews/house/4256094-ogles-tiffany-bill-palestinians-us-war-israel-hamas/"
  },
  {
    "text": "Most say Biden has acted either illegally or unethically in his son's business dealings  —  A third of the public approves of the House's impeachment inquiry and 38% say neither party is equipped to manage government corruption. … Most adults say President Biden has at the very least acted unethically … ",
    "url": "https://apnorc.org/projects/most-say-biden-has-acted-either-illegally-or-unethically-in-his-sons-business-dealings/"
  },
  {
    "text": "France Deploys 7,000 Troops After a Fatal School Stabbing  —  France will mobilize up to 7,000 soldiers to increase security around the country after a teacher was fatally stabbed and three other people wounded in a school attack by a former student suspected of Islamic radicalization, the president's office said Saturday.",
    "url": "https://www.bloomberg.com/en/news/thp/2023-10-14/france-is-deploying-7-000-troops-after-a-deadly-school-stabbing-by-a-suspected-islamic-radical"
  },
  {
    "text": "How Kari Lake's Tactical Retreat on Abortion Could Point the Way for the G.O.P.  —  Kari Lake, along with other Republicans in battleground states, has come out against a national ban as candidates try to attract general election voters.  Anti-abortion activists aren't pleased.",
    "url": "https://www.nytimes.com/2023/10/14/us/politics/kari-lake-senate-republicans-abortion.html"
  },
  {
    "text": "Michael Cohen health issue delays court showdown with Trump  —  Cohen had been expected to testify next week in a civil fraud case against Trump, who was planning to attend to hear testimony from his former attorney.  —  Former Trump lawyer Michael Cohen will not testify next week … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/michael-cohen-health-issue-delays-court-showdown-trump-rcna120405?taid=652abb16ddbbd60001a4e1a3"
  }
]