[
  {
    "text": "Trump says he will surrender Thursday on Georgia charges tied to efforts to overturn 2020 election  —  Former President Donald Trump says he will surrender to authorities in Georgia on Thursday to face charges in the case accusing him of illegally scheming to overturn his 2020 election loss in the state.",
    "url": "https://apnews.com/article/trump-bond-georgia-election-indictment-79dbb26a14b5a4ccfc1472d6d3eacd2b"
  },
  {
    "text": "Trump plans to turn himself in Thursday at Fulton County jail  —  Former President Donald Trump plans to turn himself in and be processed at the Fulton County jail on Thursday, following his agreement earlier Monday to a $200,000 bond and other release conditions.",
    "url": "https://www.cnn.com/2023/08/21/politics/fulton-county-da-office-negotiations-trump/"
  },
  {
    "text": "Justice Dept. pushes back against Trump's bid for a 2026 trial in D.C.  —  The Justice Department pushed back Monday on former president Donald Trump's claims that he cannot be ready to go to trial in January on charges that he illegally sought to subvert the results of the 2020 election.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/21/special-counsel-trial-dc-date-trump/"
  },
  {
    "text": "Iowa poll shows GOP divide over Trump remaining party leader  —  Among likely caucusgoers, 41% said they want Trump to continue as the Republican Party's leader, but more than half are open to moving in another direction.  —  Likely Republican Iowa caucusgoers are divided … ",
    "url": "https://www.nbcnews.com/politics/2024-election/iowa-poll-shows-gop-divide-trump-remaining-party-leader-rcna101027"
  },
  {
    "text": "How every GOP presidential candidate performed with likely caucusgoers in new Iowa Poll  —  From Donald Trump and Ron DeSantis to Ryan Binkley and Francis Suarez, how 14 Republican candidates performed in the new Des Moines Register/NBC News/Mediacom Iowa Poll",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2023/08/21/iowa-poll-shows-how-much-gop-support-donald-trump-ron-desantis-tim-scott-have-in-state-2024-election/70638832007/"
  },
  {
    "text": "Virginia Democrats raise alarms that Gov. Glenn Youngkin could be building toward a national bid  —  Youngkin has built a robust statewide political operation.  Virginia Democrats worry the national party isn't doing enough.  —  Virginia Democrats are worried the national party isn't doing enough … ",
    "url": "https://www.nbcnews.com/politics/2024-election/virginia-democrats-raise-alarms-gov-glenn-youngkin-building-national-b-rcna100435"
  },
  {
    "text": "A right-wing sheriffs group that challenges federal law is gaining acceptance around the country  —  A national group of sheriffs that claims the top law enforcers in American counties are not bound by federal law has successfully spread its doctrine to dozens of states in recent years",
    "url": "https://abcnews.go.com/Politics/wireStory/wing-sheriffs-group-challenges-federal-law-gaining-acceptance-102427098"
  },
  {
    "text": "DeSantis defends ‘listless vessels’ remark: These lawmakers putting ‘entertainment,’ ‘personality’ first  —  GOP presidential candidate and Florida Gov. Ron DeSantis (R) on Monday defended his remarks calling for Republicans to not be “listless vessels” automatically supporting former President Trump … ",
    "url": "https://thehill.com/homenews/campaign/4163165-desantis-defends-listless-vessels-remark-these-lawmakers-putting-entertainment-personality-first/"
  },
  {
    "text": "Elon Musk's Shadow Rule  —  How the U.S. government came to rely on the tech billionaire—and is now struggling to rein him in.  —  Last October, Colin Kahl, then the Under-Secretary of Defense for Policy at the Pentagon, sat in a hotel in Paris and prepared to make a call to avert disaster in Ukraine.",
    "url": "https://www.newyorker.com/magazine/2023/08/28/elon-musks-shadow-rule?currentPage=all"
  },
  {
    "text": "Vivek Ramaswamy wants to know how many ‘federal agents’ were on the planes that hit the Twin Towers: ‘I want the truth about 9/11’  — Vivek Ramaswamy is again raising questions about what happened on September 11, 2001.  — The GOP contender says it's “legitimate” to ask “how many federal agents” were on the planes.",
    "url": "https://www.businessinsider.com/vivek-ramaswamy-truth-federal-agents-planes-twin-towers-2023-8?op=1"
  },
  {
    "text": "Suspect named in fatal shooting of California store owner over a Pride flag  —  Travis Ikeguchi, 27, was named in connection with the slaying Friday of clothing store owner Laura Ann Carleton, 66, in Lake Arrowhead, California.  —  California shop owner allegedly killed over Pride flag",
    "url": "https://www.nbcnews.com/nbc-out/out-news/suspect-named-fatal-shooting-california-store-owner-pride-flag-rcna101085"
  },
  {
    "text": "Media organizations seek release of more court filings linked to special counsel Jack Smith's search warrant for Trump's Twitter account  —  A coalition of media organizations, including CNN, is asking the federal court in Washington, DC, to give more transparency into the legal fight … ",
    "url": "https://www.cnn.com/2023/08/21/politics/trump-twitter-special-counsel-unsealing/"
  },
  {
    "text": "Cambodia's Hun Sen Seals Political Dynasty as Son Becomes PM  — Hun Sen steps aside after more than 38 years in power  — Son becomes premier in long-planned political succession  —  Cambodia's parliament voted on Tuesday to approve a new government led by the son of outgoing leader Hun … ",
    "url": "https://www.bloomberg.com/news/articles/2023-08-22/hun-sen-seals-political-dynasty-as-son-becomes-cambodia-pm"
  },
  {
    "text": "Transmittal No  —  The State Department has made a determination approving a possible Foreign Military Sale to the Government of Poland of AH-64E Apache Helicopters and related equipment for an estimated cost of $12.0 billion.  The Defense Security Cooperation Agency delivered … ",
    "url": "https://www.dsca.mil/press-media/major-arms-sales/poland-ah-64e-apache-helicopters"
  },
  {
    "text": "Freedom Caucus rebels against a short-term funding bill with new demands  —  The new list of policy changes sought by the ultraconservative House lawmakers drew immediate pushback from Democratic leaders, who warned it would cause a shutdown.  —  WASHINGTON — The ultraconservative House Freedom Caucus … ",
    "url": "https://www.nbcnews.com/politics/congress/freedom-caucus-rebels-short-term-funding-bill-new-demands-rcna100993"
  }
]