[
  {
    "text": "Chuck Schumer rejects calls to step down as Senate Democratic leader  —  The Senate minority leader responded to criticism from within his party about his handling of a GOP government funding bill and accused Trump of triggering a constitutional crisis.  —  WASHINGTON — A defiant Senate … ",
    "url": "https://www.nbcnews.com/politics/congress/chuck-schumer-rejects-calls-step-down-senate-democratic-leader-rcna197374"
  },
  {
    "text": "SpaceX Positioned to Secure Billions in New Federal Contracts Under Trump  —  Elon Musk's role in the White House allows him to cancel contracts and influence policy, potentially benefiting his companies.  Supporters say he has the best technology.  —  A SpaceX Falcon 9 rocket preparing … ",
    "url": "https://www.nytimes.com/2025/03/23/us/politics/spacex-contracts-musk-doge-trump.html?unlocked_article_code=1.6E4.Js11.uNYKUZdBQkCf"
  },
  {
    "text": "'This is not your grandmother's Easter Egg Roll': White House seeks corporate sponsorships for Easter event  —  The White House, through an outside event production company called Harbinger, is soliciting corporate sponsors for this year's Easter Egg Roll, which is prompting major concerns … ",
    "url": "https://www.cnn.com/2025/03/23/politics/white-house-easter-egg-roll-corporate-sponsorships/"
  },
  {
    "text": "Trump Won't Win a War Against the Courts  —  President Trump has wasted no time in his second term in declaring war on the nation's federal judiciary, the country's legal profession and the rule of law.  He has provoked a constitutional crisis with his stunning frontal assault on the third branch … ",
    "url": "https://www.nytimes.com/2025/03/23/opinion/trump-judge-venezuela-deportation.html"
  },
  {
    "text": "U.S. Officials to Visit Greenland Amid Trump's Talk of a Takeover  —  Usha Vance, the second lady, will attend cultural events while Michael Waltz, the national security adviser, visits troops stationed on the island that President Trump has said the United States will get “one way or the other.”",
    "url": "https://www.nytimes.com/2025/03/23/us/politics/usha-vance-trump-us-greenland.html"
  },
  {
    "text": "Playbook: Trump's legal hit list grows  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Good Sunday morning.  This is Ankush Khardori, wishing Pope Francis well after being discharged from a hospital in Rome today.  Get in touch.  —  DRIVING THE DAY",
    "url": "https://www.politico.com/newsletters/playbook/2025/03/23/trumps-legal-hit-list-grows-00244191"
  },
  {
    "text": "Max Frankel, Top Times Editor Who Led a Newspaper in Transition, Dies at 94  —  Max Frankel, who fled Nazi Germany as a boy and rose to pinnacles of American journalism as a Pulitzer Prize-winning correspondent for The New York Times and later as its executive editor during eight years … ",
    "url": "https://www.nytimes.com/2025/03/23/obituaries/max-frankel-dead.html?unlocked_article_code=1.6E4.S7Vc.JgjJ2obwBO9l&smid=url-share"
  },
  {
    "text": "Tax Cheats Could Prosper Under Trump, IRS Experts Say  —  The Internal Revenue Service could lose 10 percent of its revenue — $500 billion — because taxpayers and businesses think the Trump administration won't go after them for not paying taxes … According to internal projections … ",
    "url": "https://www.rollingstone.com/politics/politics-news/tax-cheats-trump-irs-1235301645/"
  },
  {
    "text": "Immigration crackdown now hitting green card holders  —  HONOLULU (HawaiiNewsNow) - Green card holders are officially Lawful Permanent Residents of the United States, according to the U.S. Citizenship and Immigration Services.  But being a resident of the United States is very different from being a citizen.",
    "url": "https://www.hawaiinewsnow.com/2025/03/22/immigration-crackdown-now-hitting-green-card-holders/"
  },
  {
    "text": "John Roberts has created a monster — and he knows it  —  Five or six years ago, I was in federal court on an evidence motion.  I don't remember the issue, the claim, or whether I was for or against the motion.  What I do remember like it happened today is the exchange I had with the judge.",
    "url": "https://www.rawstory.com/raw-investigates/john-roberts-has-created-a-monster-and-he-knows-it/"
  },
  {
    "text": "Columbia University's Concessions to Trump Seen as a Watershed  —  Threatened with losing $400 million in federal funding, the university agreed to overhaul its protest policies and security practices.  —  Many professors saw it as surrender, a reward to the Trump administration's heavy hand.",
    "url": "https://www.nytimes.com/2025/03/22/nyregion/columbia-trump-concessions-watershed.html?unlocked_article_code=1.6E4.T_rt.gldvtHfvxYOA&smid=url-share"
  },
  {
    "text": "Jeremy Clarkson taunts ‘idiot’ Elon Musk over Tesla vandalism  —  British broadcaster Jeremy Clarkson has reignited a feud with carmaker-turned-political figure Elon Musk that started in 2008 with a bad review of a Tesla car on motoring show Top Gear.  —  People in the United States and around … ",
    "url": "https://www.politico.eu/article/jeremy-clarkson-idiot-elon-musk-tesla-vandalism/"
  },
  {
    "text": "Former US attorney for Eastern District of Virginia Jessica Aber found dead at 43  —  The cause of her death is still under investigation  —  Jessica Aber, former U.S. attorney for the Eastern District of Virginia (EDVA), was found dead Saturday morning, the Alexandria Police Department said.",
    "url": "https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/"
  },
  {
    "text": "March 22, 2025  —  Perhaps in response to the growing outcry over last weekend's rendition of Venezuelan migrants to El Salvador under a legal justification a federal judge has found questionable, President Donald Trump last night told reporters that he didn't sign the proclamation that set that legal process in motion.",
    "url": "https://heathercoxrichardson.substack.com/p/march-22-2025"
  },
  {
    "text": "More US states report measles cases amid vaccine misinformation  —  Ohio, Maryland and Alabama among states to report new cases, with 378 confirmed in first few months of 2025  —  More US states are reporting measles cases as the Texas outbreak expands, surpassing last year's total, amid vaccine misinformation and hesitancy.",
    "url": "https://www.theguardian.com/us-news/2025/mar/23/measles-spread-vaccine-misinformation"
  },
  {
    "text": "Protesters denounce Musk, DOGE outside Tesla showroom  —  Jasmine Fernández Antonio FinsPalm Beach Post  —  (This story has been updated to add new information and to change or add a photo or video..)  —  WEST PALM BEACH — Protesters lined up outside the Tesla showroom … ",
    "url": "https://www.palmbeachpost.com/story/news/trump/2025/03/22/demonstrators-denounce-musk-outside-telsa-showroom-in-wpb/82610986007/"
  },
  {
    "text": "Homan says Trump administration won't defy judge's order on deportation flights  —  But Trump's “border czar” says he doesn't care what judges think.  —  Tom Homan, President Donald Trump's border czar, appears in ABC News' “This Week” on Mar. 23, 2025.  —  Tom Homan, President Donald Trump's … ",
    "url": "https://abcnews.go.com/Politics/homan-trump-administration-defy-judges-order-deportation-flights/story?id=120058328"
  },
  {
    "text": "Trump moves closer to court crisis  —  Many top legal experts believe a full-blown constitutional showdown between President Trump and the courts is already here.  Others are confident there's still room to avoid one.  — But most agree that the administration's battle with U.S. District Judge James … ",
    "url": "https://www.axios.com/2025/03/23/trump-boasberg-courts-constitutional-crisis"
  },
  {
    "text": "Trump Wants to Force Immigrants to Share Their Social Media Handles When Applying for Citizenship  —  Experts say this is an assault on the First Amendment  —  Soon, if a new proposal from the Trump administration goes into effect, immigrants applying for green cards or citizenship … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-immigrants-share-social-media-handles-1235301736/"
  }
]