[
  {
    "text": "Lashing Out Over Russia and Jobs Data, Trump Displays His Volatile Side  —  The president had been on something of a winning streak.  But when faced with facts and foes that wouldn't bend to his will, he responded with impatience and disproportionate intensity.",
    "url": "https://www.nytimes.com/2025/08/02/us/politics/trump-russia-jobs.html"
  },
  {
    "text": "Trump, Claiming Weak Jobs Numbers Were ‘Rigged,’ Fires Labor Official  —  Economists said ousting the head of the Bureau of Labor Statistics could undermine confidence in government economic data.  — 1.2k  —  President Trump unleashed his fury about weakness in the labor market on Friday … ",
    "url": "https://www.nytimes.com/2025/08/01/business/economy/trump-bls-firing-jobs-report.html?unlocked_article_code=1.bE8.TTv7.w858vtQgywbr&smid=url-share"
  },
  {
    "text": "Trump's authoritarian streak  —  A five-alarm fire tore through the economic establishment Friday after President Trump ousted the government's top labor statistician, accusing her — without evidence — of “rigging” a weak jobs report. … - But apply any of these five storylines … ",
    "url": "https://www.axios.com/2025/08/02/trump-authoritarian-jobs-report-bls-economy"
  },
  {
    "text": "The Trump Economy Stumbles  —  The President has his new world tariff order in place, but jobs and growth don't look so good.  —  Click for Sound  —  President Trump has now imposed his new tariff regime on the world, and the triumphalism is palpable in MAGA land.",
    "url": "https://www.wsj.com/opinion/donald-trump-economy-tariffs-trade-jobs-growth-federal-reserve-a51eccaf?st=pTjusm&reflink=article_copyURL_share"
  },
  {
    "text": "Office of Special Counsel launches investigation into ex-Trump prosecutor Jack Smith  —  The investigation comes after GOP Sen. Tom Cotton requested that Smith be investigated for “unprecedented interference in the 2024 election.”  —  The U.S. Office of Special Counsel, an independent federal agency … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/office-special-counsel-launches-investigation-ex-trump-prosecutor-jack-rcna222625"
  },
  {
    "text": "Trump's Domestic Use of Military Set to Get Worse, Leaked Memo Shows  —  President Donald Trump has already enmeshed the United States military in domestic law enforcement operations involving immigration to an unprecedented degree.  He has authorized a major military buildup at the border.",
    "url": "https://newrepublic.com/article/198708/trump-military-anti-immigration-dhs-leaked-memo"
  },
  {
    "text": "India Will Buy Russian Oil Despite Trump's Threats, Officials Say  —  There is a growing sense in India that its leaders should not allow American policymaking to shape its choices on vital energy supplies.  —  Indian officials said on Saturday that they would keep purchasing cheap oil … ",
    "url": "https://www.nytimes.com/2025/08/02/world/asia/india-russia-oil-trump-threats.html?unlocked_article_code=1.bE8.ZW0z.r4HdNGIfryLm&smid=url-share"
  },
  {
    "text": "Senate leaving Russia sanctions power fully in Trump's hands  —  Republican senators are getting ready to leave Washington without advancing a major sanctions bill against Russia, giving President Trump sole discretion over whether to follow through on his threats against Russian President Vladimir Putin … ",
    "url": "https://thehill.com/homenews/senate/5432717-senate-russia-bill-adjournment/"
  },
  {
    "text": "Texas State House Panel Advances Gerrymandered Congressional Map  —  The full Texas House will now vote next week on a map drawn to flip five House districts to the G.O.P., but Democrats might walk out to deny Republicans a quorum.  —  A Republican-led committee of the Texas House voted … ",
    "url": "https://www.nytimes.com/2025/08/02/us/politics/texas-redistricting.html"
  },
  {
    "text": "After a Lag, Consumers Begin to Feel the Pinch of Tariffs  —  There are growing signs that President Trump's levies are filtering through to consumer prices, as companies exhaust options for keeping them stable.  —  Companies are starting to shift more tariff-related costs onto consumers.",
    "url": "https://www.nytimes.com/2025/08/02/business/trump-tariffs-consumer-prices.html"
  },
  {
    "text": "Judges Keep Restrictions on L.A. Immigration Arrests, in Setback for Trump Agenda  —  An appellate panel upheld a finding that federal agents appeared to rely exclusively on race and other factors, such as speaking Spanish, in making arrests.  —  The Trump administration's agenda suffered … ",
    "url": "https://www.nytimes.com/2025/08/02/us/los-angeles-immigration-raids-ruling.html"
  },
  {
    "text": "Federal judges side with Trump on ending union bargaining for federal workers  —  A federal appeals court on Friday sided with the Trump administration, lifting a temporary block on a March executive order that prevented government workers from union bargaining.",
    "url": "https://thehill.com/homenews/administration/5433509-federal-employees-trump-order-union-ruling/"
  },
  {
    "text": "Unmasked: the man behind one of the fastest growing far-right YouTube channels  —  Chris Booth's channel - rife with neo-Nazi ideology, antisemitism and racism - garnered 2.3m views and likely thousands of dollars from YouTube in about two months  —  The Guardian has identified the self-described … ",
    "url": "https://www.theguardian.com/us-news/2025/aug/02/christopher-booth-far-right-youtube-channel"
  },
  {
    "text": "Donor List Suggests Scale of Trump's Pay-for-Access Operation  —  A new disclosure shows how corporations and individuals, including many in the crypto business, wrote big checks while seeking favor from the president.  —  When the cryptocurrency entrepreneur Eric Schiermeyer heard … ",
    "url": "https://www.nytimes.com/2025/08/02/us/politics/donor-list-suggests-scale-of-trumps-pay-for-access-operation.html?unlocked_article_code=1.bE8.Wn42.PdtHlbwcmiI0&smid=url-share"
  },
  {
    "text": "I Am Suing the Department of Justice for the Epstein Files Training Videos  —  On July 20th, I was the first to report the existence of training videos instructing FBI personnel how to flag mentions of Trump and others in the Epstein files.  Today, I'm suing for those videos.",
    "url": "https://www.muellershewrote.com/p/i-am-suing-the-department-of-justice"
  },
  {
    "text": "Trump Administration Suspends UCLA Grants After Rights Probe  —  The federal government is suspending certain research funding to the University of California at Los Angeles over concerns about antisemitism and bias on campus, hitting one of the most prestigious public higher-education systems in the US.",
    "url": "https://www.bloomberg.com/news/articles/2025-08-01/trump-administration-suspends-ucla-grants-after-rights-probe"
  },
  {
    "text": "Supreme Court signals it may rule on law protecting power of minority voters  —  The justices asked opposing parties in a battle over a Louisiana voting map to submit briefs addressing the matter.  —  Just now  —  The Supreme Court has signaled that it may rule on the constitutionality … ",
    "url": "https://www.washingtonpost.com/politics/2025/08/02/supreme-court-louisiana-voting-rights-act/"
  }
]