[
  {
    "text": "Trump portrays rampant crime in speech at Black church in Detroit  —  The presumptive Republican nominee, who hopes to dent Biden's advantage among Black voters, has often disparaged communities where many African Americans live  —  DETROIT — Presumptive Republican nominee Donald Trump repeated … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/15/trump-black-church-detroit-crime/"
  },
  {
    "text": "The Overlooked (But Real) Possibility of a Big Democratic Win  —  Both moderates and progressives are pushing the Biden campaign to get more ambitious.  —  Democrats have spent the past year talking much more about the prospect of a Donald Trump victory than about their own.",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/biden-campaign-2024-election-senate/678691/"
  },
  {
    "text": "Democratic senator calls Supreme Court “brazenly corrupt” … - Justice Clarence Thomas has been scrutinized for failing to report luxury trips gifted to him by GOP megadonor Harlan Crow and his wife's involvement in efforts to overturn the 2020 presidential election.",
    "url": "https://www.axios.com/2024/06/16/supreme-court-corrupt-chris-murphy"
  },
  {
    "text": "The Resistance to a New Trump Administration Has Already Started  —  An emerging coalition that views Donald J. Trump's agenda as a threat to democracy is laying the groundwork to push back if he wins in November, taking extraordinary pre-emptive actions.  —  Kica Matos with the National … ",
    "url": "https://www.nytimes.com/2024/06/16/us/politics/trump-2025-democratic-resistance.html"
  },
  {
    "text": "Trump's Spiritual Adviser Quasi-Confesses to Molesting 12-Year-Old Girl  —  HOLY MOLY  —  The senior pastor of megachurch Gateway Church said he engaged in “inappropriate sexual behavior” with a “young lady”—without noting the alleged victim was 12.  —  The pastor of one of the country's … ",
    "url": "https://www.thedailybeast.com/trumps-spiritual-adviser-robert-morris-half-confesses-to-molesting-12-year-old-girl"
  },
  {
    "text": "President Biden and Barack Obama Rip Donald Trump During Starry L.A. Fundraiser  —  Los Angeles Democrats and Hollywood stars like George Clooney, Julia Roberts and Barbra Streisand came out in full force on Saturday night for a record-setting fundraiser for Biden's reelection campaign.",
    "url": "https://www.hollywoodreporter.com/news/politics-news/biden-los-angeles-fundraiser-obama-kimmel-1235923818/"
  },
  {
    "text": "Man Plotted Mass Shooting in Atlanta to Incite ‘Race War,’ Officials Say  —  Prosecutors said Mark Adams Prieto of Arizona planned to target Black concertgoers at an Atlanta venue.  He was indicted on hate crime and firearm charges.  —  An Arizona man who planned to commit a mass shooting … ",
    "url": "https://www.nytimes.com/2024/06/16/us/atlanta-concert-shooting-plot.html"
  },
  {
    "text": "Trump Lets Loose With Unhinged Father's Day Message for His Enemies  —  BACK ON THE BANDWAGON  —  Trump did not mention any of his five children during his Father's Day rant, nor did he write about his feelings for his own family.  —  Donald Trump issued an angry and confrontational Father's … ",
    "url": "https://www.thedailybeast.com/trump-lets-loose-with-unhinged-fathers-day-message-for-his-enemies"
  },
  {
    "text": "Breaking news: Paul Pressler died and the SBC said nothing  —  Herman Paul Pressler III of Houston died June 7, four days before the Southern Baptist Convention annual meeting, where nothing was said about his passing.  —  Pressler, who had just turned 94, was the co-architect of the so-called “conservative resurgence” in the SBC.",
    "url": "https://baptistnews.com/article/breaking-news-paul-pressler-died-and-the-sbc-said-nothing/"
  },
  {
    "text": "Scoop: GOP smokes Johnson over loss of Capitol cigar space … - Given stark divisions and constant infighting in the House GOP conference, there's an argument for any arrangement that could help this crop of lawmakers build relationships. … - But after he became Appropriations chair … ",
    "url": "https://www.axios.com/2024/06/16/speaker-johnson-tom-cole-capitol-cigars"
  },
  {
    "text": "Conservative grassroots activists want JD Vance as Trump's VP pick: Straw poll shows Ohio senator as the runaway leader ahead of Rubio, Burgum and Scott among Turning Point Action attendees  — J.D. Vance is one of four ‘finalists’ in the race to be Donald Trump's running mate",
    "url": "https://www.dailymail.co.uk/news/article-13535551/jd-vance-vp-donald-trump-poll-burgum-scott.html"
  },
  {
    "text": "Nikki Haley mourns father's death on Father's Day: ‘I had to say goodbye’  —  Former South Carolina Gov. Nikki Haley announced Sunday that her father, Ajit Singh Randhawa, died, saying she said goodbye to him on Father's Day morning.  —  “This morning I had to say goodbye to the smartest … ",
    "url": "https://www.washingtonexaminer.com/news/3046943/nikki-haley-mourns-fathers-death-fathers-day/"
  },
  {
    "text": "White House Fumes at Trumpworld's Latest ‘Cheap Fake’ Video  —  NOT AGAIN!  —  Another deceptively cut video of President Joe Biden is being circulated by right-wing pundits and media outlets-and the White House is not happy.  —  Less than a week after being derided for using … ",
    "url": "https://www.thedailybeast.com/no-president-biden-didnt-freeze-at-star-studded-hollywood-fundraiser"
  },
  {
    "text": "The Hunter Biden and Trump trials were a litmus test.  Only the Bidens passed.  —  The president's family rallied in support of one of their own.  Trump family members were conspicuously absent.  —  No person with a loved one who has suffered through addiction could feel anything but empathy for Hunter Biden and his family.",
    "url": "https://www.washingtonpost.com/opinions/2024/06/16/hunter-biden-donald-trump-convictions/"
  }
]