[
  {
    "text": "Supreme Court Justice Alito's Beach House Displayed ‘Appeal to Heaven’ Flag … The “Appeal to Heaven” flag flew outside the Alitos' New Jersey vacation home last summer, along with a “2022” Phillies flag and a Long Beach Island flag.  —  Last summer, two years after an upside-down American flag … ",
    "url": "https://www.nytimes.com/2024/05/22/us/justice-alito-flag-appeal-to-heaven.html"
  },
  {
    "text": "Florida hearing in Trump classified documents case devolves into shouting match  —  A hearing in the Mar-a-Lago classified documents case devolved into shouting Wednesday as attorneys battled over an alleged threat made last year to a defense attorney.  —  The morning proceeding in Fort Pierce … ",
    "url": "https://www.cnn.com/2024/05/22/politics/trump-documents-case-judge-cannon-hearing/"
  },
  {
    "text": "Israel Rages as Ireland, Spain, and Norway Move to Recognize Palestinian State  —  ‘REWARD HAMAS’  —  The historic move will be punished with “severe consequences,” Israel's foreign minister said.  —  Ireland, Spain, and Norway on Wednesday said they will officially recognize a Palestinian state … ",
    "url": "https://www.thedailybeast.com/israel-rages-as-ireland-spain-and-norway-move-to-recognize-palestinian-state"
  },
  {
    "text": "“Everyone is absolutely terrified”: Inside a US ally's secret war on its American critics  —  I met Raqib Naik, a journalist who had fled his native India, at a coffee shop in suburban Maryland.  We sat at the same metal table where he once discussed the prospect of his assassination with FBI agents.",
    "url": "https://www.vox.com/world-politics/24160779/inside-indias-secret-campaign-to-threaten-and-harass-americans"
  },
  {
    "text": "Rishi Sunak will call general election for July in surprise move - sources  —  PM says he wants to hold summer poll after claiming inflation is back under control and economy is improving  —  Rishi Sunak will on Wednesday afternoon call a surprise early election for July … ",
    "url": "https://www.theguardian.com/politics/article/2024/may/22/rishi-sunak-will-call-general-election-for-july-in-surprise-move-sources"
  },
  {
    "text": "Nikki Haley says she's voting for Trump in November  —  Former South Carolina Gov. Nikki Haley is supporting former President Donald Trump's 2024 White House bid, she said Wednesday in her first public remarks since exiting the Republican presidential primary more than two months ago.",
    "url": "https://www.cnn.com/2024/05/22/politics/nikki-haley-donald-trump"
  },
  {
    "text": "Biden administration canceling student loans for another 160,000 borrowers  —  The Biden administration is canceling student loans for another 160,000 borrowers through a combination of existing programs.  The Education Department announced the latest round of cancellation on Wednesday … ",
    "url": "https://apnews.com/article/biden-student-loan-cancellation-debt-forgiveness-60ffeaec17737d6317b4aee188893cc4"
  },
  {
    "text": "Trump maintains leads in most critical swing states  —  Robert F. Kennedy Jr.'s standing has slipped since October, hurting him most notably in Wisconsin … President Joe Biden and former President Donald Trump continue to face tight contests in the potentially pivotal “Blue Wall” … ",
    "url": "https://pro.morningconsult.com/analysis/swing-state-polling-may-2024"
  },
  {
    "text": "The Algebra Problem: How Middle School Math Became a National Flashpoint  —  Top students can benefit greatly by being offered the subject early.  But many districts offer few Black and Latino eighth graders a chance to study it.  —  From suburbs in the Northeast to major cities on the West Coast … ",
    "url": "https://www.nytimes.com/2024/05/22/nyregion/middle-school-math-algebra.html"
  },
  {
    "text": "Hunter Biden trial on tax charges delayed until September  —  Hunter Biden's trial on tax charges has been moved to September 5, after the judge presiding over the case made Biden's attorney promise he would not seek further delays.  —  In asking for a delay in the case, Abbe Lowell … ",
    "url": "https://www.cnn.com/2024/05/22/politics/hunter-biden-trial-on-tax-charges-delayed-until-september/"
  },
  {
    "text": "James Comer teams up with Katie Porter on bipartisan presidential ethics bill  —  House Oversight Committee Chairman James Comer (R-KY) and Rep. Katie Porter (D-CA) are pairing up in a rare moment of bipartisanship to introduce legislation that seeks to prevent presidential candidates from “profiting from their proximity to power.”",
    "url": "https://www.washingtonexaminer.com/news/house/3012937/comer-porter-oversight-bill-presidential-ethics/"
  },
  {
    "text": "Colorado GOP calls for all children to be pulled from public schools  —  The party's latest move to the hard right is a directive to parents to remove kids from the public education system.  —  COLORADO, USA — The Colorado Republican Party is issuing a call to its members to pull their children … ",
    "url": "https://www.9news.com/article/news/local/next/next-with-kyle-clark/colorado-gop-kids-pulled-from-public-schools/73-e121fe9e-9a2b-498d-8a80-1efe2a179758"
  },
  {
    "text": "Is Oreo About to Be the Next Bud Light?  —  Oreo could be the latest big brand to get the Bud Light treatment.  —  The cookie company's Chicago-headquartered parent organization, Mondelēz International, will be confronted at its annual shareholder meeting on Wednesday over how its LGBTQ marketing … ",
    "url": "https://townhall.com/tipsheet/miacathell/2024/05/22/oreo-shareholder-meeting-n2639163"
  },
  {
    "text": "Hacked data reveals which US gun sellers are behind Mexican cartel violence  —  USA TODAY exclusive: Massive data leak ties names of American shops and buyers to thousands of guns recovered at Mexican crime scenes.  —  A massive leak of Mexican military intelligence has exposed … ",
    "url": "https://www.usatoday.com/story/news/investigations/2024/05/22/mexican-cartels-supplied-trafficked-guns-from-us/73700258007/"
  },
  {
    "text": "What's breaking up the Texas Republican party?  School vouchers  —  Out-of-state donors are funneling millions of dollars into state legislative races to defeat Republicans who opposed the governor's top education priority.  —  When nearly two dozen Republican state lawmakers defied Texas … ",
    "url": "https://www.politico.com/news/2024/05/22/texas-republican-primary-school-vouchers-choice-00159219"
  },
  {
    "text": "Majority of Americans wrongly believe US is in recession - and most blame Biden  —  Exclusive Harris poll for the Guardian shows 55% believe economy is shrinking, in troubling sign for president's re-election bid  —  Nearly three in five Americans wrongly believe the US is in an economic recession … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/22/poll-economy-recession-biden"
  },
  {
    "text": "Democrat Punished On House Floor For Accurately Saying Trump Is On Trial  —  “What they're trying to do now is cancel people,” said Rep. Jim McGovern (Mass.), the congressman who started the contretemps.  —  LOADING  —  House Republicans invoked Wednesday a rule meant … ",
    "url": "https://www.huffpost.com/entry/house-democrat-punished-for-speaking-about-trump-trials_n_664e4b2ce4b0347b28fbf9a4"
  },
  {
    "text": "Rick Scott jumps into race for Senate GOP leader … - Scott mounted a failed bid against McConnell during the last leadership election in 2022. … - Scott is likely to an attractive choice for more conservatives, as both Thune and Cornyn are viewed as McConnell allies.",
    "url": "https://www.axios.com/2024/05/22/rick-scott-jumps-into-race-for-senate-gop-leader"
  },
  {
    "text": "Meet Trump's ‘Human Printer’  —  WHENEVER DONALD TRUMP BRANDISHES a stack of papers or reads a printout of a social media post, he's relying on the work of Natalie Harp.  —  Harp, 32, occupies a unique role in the history of presidential campaigns: aide who travels with a portable printer … ",
    "url": "https://www.thebulwark.com/p/meet-trumps-human-printer-natalie-harp"
  },
  {
    "text": "Another Conspiracy Theory Win; It's Getting Depressing  —  OK, it's time to put on your tin foil hats because every damn conspiracy theory is proving to be true.  —  Sure, I still believe men landed on the moon and that the Earth is round, but I am beginning to doubt almost everything else.",
    "url": "https://hotair.com/david-strom/2024/05/22/another-conspiracy-theory-win-its-getting-depressing-n3788799"
  },
  {
    "text": "Ways and Means Committee Releases Evidence Showing Hunter Biden Lied Under Oath During Recent Congressional Testimony  —  WASHINGTON, D.C. - Today, the Ways and Means Committee voted to release over 100 pages of newly obtained evidence, provided to the Committee by Internal Revenue Service … ",
    "url": "https://waysandmeans.house.gov/ways-and-means-committee-releases-evidence-showing-hunter-biden-lied-under-oath-during-recent-congressional-testimony/"
  },
  {
    "text": "An Expert's Guide to Surviving Extreme Plane Turbulence  —  HOLD ON TIGHT  —  News that a 73-year-old man died when wild turbulence hit a Singapore Airlines flight on Tuesday is the stuff of most fliers' nightmares.  —  News that a 73-year-old man died and seven others were critically injured … ",
    "url": "https://www.thedailybeast.com/an-experts-guide-to-surviving-extreme-plane-turbulence-on-flights"
  },
  {
    "text": "Republican National Committee headquarters under lockdown after being sent vials of blood  —  A hazardous materials team from the Capitol Police responded to the situation.  —  The Republican National Committee headquarters in Washington, D.C., was under lockdown Wednesday morning … ",
    "url": "https://www.nbcnews.com/politics/politics-news/republican-national-committee-headquarters-lockdown-sent-vials-blood-rcna153462"
  }
]