[
  {
    "text": "Trump Pulls in Tulsi Gabbard for Debate Prep  —  Tulsi Gabbard, the former Democrat who has rebranded herself as a celebrity among Donald J. Trump's supporters, once eviscerated Kamala Harris on a debate stage.  —  Former President Donald J. Trump has begun preparing for his debate … ",
    "url": "https://www.nytimes.com/2024/08/16/us/politics/trump-debate-tulsi-gabbard.html?unlocked_article_code=1.DU4.zW-3.EUNARKJDeSbt&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Scaramucci: Trump Is ‘Coming to Grips’ With Losing the Election  —  ‘GROWING DARKER’  —  Trump's former White House communications director says it's going to be “rough” until Election Day.  —  Anthony Scaramucci, Donald Trump's one-time White House communications director … ",
    "url": "https://www.thedailybeast.com/anthony-scaramucci-trump-is-coming-to-grips-with-losing-the-election"
  },
  {
    "text": "Trump's decline: His interviews and lies get worse  —  As the 2024 race draws tighter, the former president's actions suggest he is spiraling. … This week, I look at felon and former president Donald Trump's downward spiral, pick the distinguished persons of the week and share some Chicago sites.",
    "url": "https://www.washingtonpost.com/opinions/2024/08/16/newsletter-harris-election/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MTYzMTk5LCJpYXQiOjE3MjM3ODA4MDAsImp0aSI6ImQ4ZDFkZTJlLTExMjktNGM4OS1iMjFjLTJhN2JkZDliMjNlMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzA4LzE2L25ld3NsZXR0ZXItaGFycmlzLWVsZWN0aW9uLyJ9.SZ5sQBBvtATwbwbybHO20IXGqDN2K_ti5U2tQFAk1R8&itid=gfta"
  },
  {
    "text": "Trump's fury over Harris' switch with Biden is increasingly driving his campaign  —  Deep into his ranting news conference on Thursday, former President Donald Trump told a truth that explained everything : “I'm very angry at her.”  —  He was referring to Vice President Kamala Harris … ",
    "url": "https://www.cnn.com/2024/08/16/politics/trump-fury-harris-switch-campaign-analysis"
  },
  {
    "text": "Trump draws a parallel between a campaign donor and war heroes  —  Trump told an audience on Thursday that the Presidential Medal of Freedom was “better” than the Medal of Honor, since honored soldiers were often wounded.  —  The day before Halloween 2019, President Donald Trump welcomed Master … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/16/trump-draws-parallel-between-campaign-donor-war-heroes/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MTYzMTk5LCJpYXQiOjE3MjM3ODA4MDAsImp0aSI6ImQyZTE3ZTNhLWNiOTctNDEyMC05OTk0LTc3MTk1NWQ3ZDg5OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzE2L3RydW1wLWRyYXdzLXBhcmFsbGVsLWJldHdlZW4tY2FtcGFpZ24tZG9ub3Itd2FyLWhlcm9lcy8ifQ.eqNEhq5ZqTS-EFuJKXDwMGd6rdnfBoEVcy9kIF-aYYw&itid=gfta"
  },
  {
    "text": "Trump veteran comments spark controversy — again  —  The former president has a history of making controversial comments about veterans, receiving backlash during both his 2016 and 2020 campaigns.  —  Former President Donald Trump is facing backlash over his comments about veterans.  Again.",
    "url": "https://www.politico.com/news/2024/08/16/trump-medal-of-honor-00174404"
  },
  {
    "text": "Kamala Harris unveils populist policy agenda, with $6,000 credit for newborns  —  The vice president endorses government action on housing, groceries, medical debt, drugs and other issues.  —  Vice President Kamala Harris on Friday unveiled an aggressively populist economic agenda … ",
    "url": "https://www.washingtonpost.com/business/2024/08/16/kamala-harris-2024-policy-child-tax-credit/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MTYzMTk5LCJpYXQiOjE3MjM3ODA4MDAsImp0aSI6ImIwOGVkYmUxLWI1M2EtNGQ2Yi04MGNlLWQ3ZDVkMjc0YmQ4MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzA4LzE2L2thbWFsYS1oYXJyaXMtMjAyNC1wb2xpY3ktY2hpbGQtdGF4LWNyZWRpdC8ifQ.bc3_5kWepKED7-eQhF5M7miIJDXGbng1J-AQqoVNtM8&itid=gfta"
  },
  {
    "text": "He found a Project 2025 duffel bag.  Then police showed up at his house.  —  Journalist and author Malcolm Harris says he found the bag left on a ledge in Capitol Hill.  It turned out to be more trouble than it was worth.  —  Author Malcolm Harris opened the door of his Capitol Hill home … ",
    "url": "https://www.washingtonpost.com/style/media/2024/08/16/project-2025-dc-duffel-bag/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNzgwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MTYzMTk5LCJpYXQiOjE3MjM3ODA4MDAsImp0aSI6ImE2ZDRkMGFiLTljZDUtNGY5YS04YWM4LWU5NmZhY2NiZjZjOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zdHlsZS9tZWRpYS8yMDI0LzA4LzE2L3Byb2plY3QtMjAyNS1kYy1kdWZmZWwtYmFnLyJ9._K2-c4_rSO58WvJztzhRQW8_p_MRzVbJJyEiFP9ojx4&itid=gfta"
  },
  {
    "text": "Presidential race swings 6 points in two weeks, catapulting Trump to lead and ending Harris surge  —  Scott Rasmussen says Harris bump has ended after poll that had Trump down 5 on Aug. 2 now has him leading by one.  — Article  — Dig Deeper  —  Support in the presidential race … ",
    "url": "https://justthenews.com/politics-policy/elections/presidential-race-swings-6-points-two-weeks-catapulting-trump-lead-and"
  },
  {
    "text": "Pennsylvania 2024 Poll: Trump 49%, Harris 48%  —  Home Polls Pennsylvania 2024 Poll: Trump 49%, Harris 48%  —  A new Emerson College Polling/RealClearPennsylvania survey finds 49% of voters support former President Donald Trump, and 48% support Vice President Kamala Harris for president in the Keystone state.",
    "url": "https://emersoncollegepolling.com/pennsylvania-2024-poll-trump-49-harris-48/"
  },
  {
    "text": "This Georgia Republican Defied Trump.  Now He's Fighting a Defamation Suit.  —  The secretary of state, Brad Raffensperger, has spent $500,000 defending himself in court.  He says the plaintiff will only settle if he effectively endorses a debunked conspiracy theory about the 2020 election.",
    "url": "https://www.nytimes.com/2024/08/16/us/politics/brad-raffensperger-2020-georgia-election.html?unlocked_article_code=1.DU4.NCd6.Ue0uwKEjw-nJ&smid=url-share"
  },
  {
    "text": "Tim Walz's Quip on “White Guy Tacos” Sends MAGA Into Meltdown  —  Right-wingers are spreading another conspiracy about Minnesota Governor Tim Walz: he's lying about liking “white guy tacos.”  —  Kamala Harris and her running mate on Thursday posted a promotional video of them discussing food … ",
    "url": "https://newrepublic.com/post/184948/tim-walz-white-guy-tacos-far-right-maga-meltdown-reaction"
  },
  {
    "text": "When your opponent calls you ‘communist,’ maybe don't propose price controls?  —  It's hard to exaggerate how bad Kamala Harris's price-gouging proposal is.  —  “Price gouging” is the focus of Vice President Kamala Harris's economic agenda, her presidential campaign says.",
    "url": "https://www.washingtonpost.com/opinions/2024/08/15/kamala-harris-price-gouging-groceries/"
  },
  {
    "text": "Watch Undercover Video: Project 2025 Co-Author Lays Out “Radical Agenda” for Next Trump Term  —  As Donald Trump tries to distance his campaign from Project 2025, those behind the right-wing policy blueprint to remake the U.S. government continue to brag in private about their close ties … ",
    "url": "https://www.democracynow.org/2024/8/16/project_2025_undercover_video"
  },
  {
    "text": "House GOP sets its sights on Walz  —  The House Oversight Committee is opening an investigation into Democrats' vice presidential pick.  —  House Republicans are setting their sights on Minnesota Gov. Tim Walz, Democrats' vice presidential candidate — the latest indication that they are using … ",
    "url": "https://www.politico.com/news/2024/08/16/tim-walz-james-comer-china-00174403"
  },
  {
    "text": "The Onion Adds a Monthly Print Edition … This week, The Onion began distributing a print edition for the first time in more than a decade.  —  The funniest writers at The Onion shuffled through dozens of news stories at a meeting last week, trying to discern which headline would make readers laugh harder.",
    "url": "https://www.nytimes.com/2024/08/16/business/media/the-onion-print-paper.html?unlocked_article_code=1.DU4.1xea.taxbYyRSbooa&smid=url-share"
  },
  {
    "text": "JD Vance's plane makes emergency landing after door malfunction  —  The plane carrying Vance, a Boeing 737, declared an emergency shortly after it had left the airport in Milwaukee and returned for repairs.  —  The charter plane carrying former president Donald Trump's running mate Sen. JD Vance … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/16/jd-vance-airplane-boeing/"
  },
  {
    "text": "Nine Years of Trump Is a Warning We Must Heed  —  Apart from Donald Trump, the basic problem of the Republican Party's so-called fever — the extent to which it has been captured by nihilists and ideological extremists — is that the party is untethered from any electoral dynamic that might force it to moderate its behavior.",
    "url": "https://www.nytimes.com/2024/08/16/opinion/trump-republican-party-electoral-college.html?unlocked_article_code=1.DU4.Eo2Q.Gm1b0DUek-9A&smid=url-share"
  },
  {
    "text": "5 questions for Audrey Tang  —  With help from Steven Overly and Mohar Chatterjee.  —  Hello, and welcome to this week's installment of The Future In Five Questions.  Brendan recently spoke with Audrey Tang, a software programmer who served as Taiwan's first Minister of Digital Affairs from August 2022 to May 2024.",
    "url": "https://www.politico.com/newsletters/digital-future-daily/2024/08/16/5-questions-for-audrey-tang-00174439"
  },
  {
    "text": "Trump's Magical History Tour  —  Under siege and self-sabotaging at his New Jersey golf club, Donald Trump is reaching for old familiar faces and enablers to imbue his flailing 2024 campaign with some 2016 magic: Corey Lewandowski, Tim Murtaugh, maybe Kellyanne.  Who's next, Roger Stone?  Oh wait...",
    "url": "https://puck.news/trumps-magical-history-tour/"
  },
  {
    "text": "JD Vance isn't just out to get cat ladies — his weird plans target dog people and grandmas, too  —  The self-styled expert on the ladies now claims “normal” women don't care about reproductive rights  —  Ohio Sen. JD Vance is a man with an obsession.  The video of Donald Trump's running mate raving … ",
    "url": "https://www.salon.com/2024/08/16/jd-vance-isnt-just-out-to-get-cat-ladies--his-weird-plans-target-dog-people-and-grandmas-too/"
  },
  {
    "text": "‘Washington Post’ reviews star columnist Taylor Lorenz's ‘war criminal’ jab at Biden  —  Senior editors at the Washington Post are reviewing a prominent tech columnist's private story on social media, which appears to label President Biden a “war criminal” in a photo.",
    "url": "https://www.npr.org/2024/08/15/g-s1-17201/washington-post-taylor-lorenz-tech-columnist-biden"
  },
  {
    "text": "Sen. Bob Menendez ends independent run days before he's set to resign  —  The move formally ends a half century in politics that began on a New Jersey school board and culminated with extraordinary power on the global stage.  —  Convicted Sen. Bob Menendez on Friday took his independent candidacy off … ",
    "url": "https://www.politico.com/news/2024/08/16/bob-menendez-ends-independent-senate-campaign-00174425"
  }
]