[
  {
    "text": "Supreme Court Justice Alito's Beach House Displayed ‘Appeal to Heaven’ Flag … The “Appeal to Heaven” flag flew outside the Alitos' New Jersey vacation home last summer, along with a “2022” Phillies flag and a Long Beach Island flag.  —  Last summer, two years after an upside-down American flag … ",
    "url": "https://www.nytimes.com/2024/05/22/us/justice-alito-flag-appeal-to-heaven.html"
  },
  {
    "text": "Second flag carried by Jan. 6 rioters displayed outside house owned by Justice Alito, report says  —  A second flag of a type carried by rioters during the attack on the U.S. Capitol on Jan. 6, 2021, was displayed outside a house owned by Supreme Court Justice Samuel Alito, The New York Times reported Wednesday.",
    "url": "https://apnews.com/article/supreme-court-flag-stop-steal-alito-trump-1842c40b833637c981c59c3f39bc4669"
  },
  {
    "text": "Sam Alito is a problem  —  Chief Justice John Roberts must take responsibility for his court.  If he does not, what follows will be his legacy — and we'll have to deal with the fallout.  —  It's been clear for some time that Justice Sam Alito was the Fox News (or an even further right-wing channel) … ",
    "url": "https://www.lawdork.com/p/sam-alito-is-a-problem"
  },
  {
    "text": "They're all election deniers now  —  Trump's veep hopefuls are saying it over and over. … Lately, Republicans have been getting one simple question: “Will you accept the results of the 2024 election, regardless of its outcome?”  Their responses keep exposing that election denialism has taken over the party.",
    "url": "https://www.publicnotice.co/p/election-denial-marco-rubio-lara-trump-burgum"
  },
  {
    "text": "Florida hearing in Trump classified documents case devolves into shouting match  —  A hearing in the Mar-a-Lago classified documents case devolved into shouting Wednesday as attorneys battled over an alleged threat made last year to a defense attorney.  —  The morning proceeding in Fort Pierce … ",
    "url": "https://www.cnn.com/2024/05/22/politics/trump-documents-case-judge-cannon-hearing/"
  },
  {
    "text": "The Minnesota GOP endorsed an anti-semite for U.S. Senate.  Republicans are silent.  —  Earlier this month, Congressman Tom Emmer (R-MN) blasted college students protesting Israel's military operations in Gaza.  “By these students' own admission, they're not just standing in solidarity with this pro-Hamas … ",
    "url": "https://popular.info/p/the-minnesota-gop-endorsed-an-anti"
  },
  {
    "text": "Two hundred judges, more nominees moving, and a shadow docket bill  —  A little past noon Wednesday, the U.S. Senate confirmed Angela Martinez to be a judge on the U.S. District Court for the District of Arizona on a 66-28 vote.  —  Martinez is the 200th of President Biden's judicial nominees … ",
    "url": "https://www.lawdork.com/p/two-hundred-judges-shadow-docket-bill"
  },
  {
    "text": "Sickening new video shows Hamas line up female Israeli soldiers on Oct. 7: ‘Here are the girls who can get pregnant’  —  Harrowing video released Wednesday shows the moment five female Israeli soldiers — covered in blood and surrounded by the bodies of their massacred comrades … ",
    "url": "https://nypost.com/2024/05/22/world-news/sickening-new-video-shows-hamas-line-up-female-israeli-soldiers-on-oct-7-here-are-the-girls-who-can-get-pregnant/"
  },
  {
    "text": "TikTok Is Seeing an Increasing Amount of Pro-Trump Posts  —  An internal analysis found nearly twice as many pro-Trump posts as pro-Biden ones on TikTok since November, a sign of the right's use of a liberal-friendly platform.  —  Donald Trump isn't on TikTok.",
    "url": "https://www.nytimes.com/2024/05/23/us/politics/trump-biden-tiktok.html"
  },
  {
    "text": "GOP officials frustrated by the Secret Service's refusal to move protesters away from the RNC convention hall  —  One proposal from the RNC would place the protest zone in a park across the Milwaukee River.  Milwaukee officials have so far shown no interest in helping out, either.",
    "url": "https://www.nbcnews.com/politics/2024-election/gop-secret-services-refusal-protesters-rnc-convention-rcna153109"
  },
  {
    "text": "Netanyahu speech plans spark internal furor for Democrats … - House Intelligence Committee Ranking Member Jim Himes (D-Conn.) said Netanyahu “should be focused on freeing hostages, not on charming legislators.”  — Rep. Dan Kildee (D-Mich.), a member of Democratic leadership, told Axios … ",
    "url": "https://www.axios.com/2024/05/23/netanyahu-johnson-schumer-address-congress-israel"
  },
  {
    "text": "Trump gears up for unique South Bronx rally … - It will be his first large-scale campaign rally in New York since 2016. … - It has been working with the predominantly Hispanic members of the Bodega Association and the National Supermarket Association, made up of independent supermarket owners.",
    "url": "https://www.axios.com/2024/05/23/trump-south-bronx-rally-new-york"
  },
  {
    "text": "Another Conspiracy Theory Win; It's Getting Depressing  —  OK, it's time to put on your tin foil hats because every damn conspiracy theory is proving to be true.  —  Sure, I still believe men landed on the moon and that the Earth is round, but I am beginning to doubt almost everything else.",
    "url": "https://hotair.com/david-strom/2024/05/22/another-conspiracy-theory-win-its-getting-depressing-n3788799"
  },
  {
    "text": "Republican National Committee's headquarters evacuated after vials of blood are addressed to Trump  —  The Republican National Committee's Washington headquarters was briefly evacuated on Wednesday as police investigated two vials of blood that had been addressed to former President Donald Trump following … ",
    "url": "https://apnews.com/article/rnc-evacuated-trump-blood-7ce48904814c9adfaf8b01d682b5d858"
  },
  {
    "text": "Democrat Punished On House Floor For Accurately Saying Trump Is On Trial  —  “What they're trying to do now is cancel people,” said Rep. Jim McGovern (Mass.), the congressman who started the contretemps.  —  LOADING  —  House Republicans invoked Wednesday a rule meant … ",
    "url": "https://www.huffpost.com/entry/house-democrat-punished-for-speaking-about-trump-trials_n_664e4b2ce4b0347b28fbf9a4"
  },
  {
    "text": "Biden Plans to Give Kenya Key Ally Designation During Its Leader's Visit  —  A “major non-NATO ally” is a country whose military has a strategic working relationship with the United States.  —  President Biden will designate Kenya on Thursday as a “major non-NATO ally,” according to a U.S. official … ",
    "url": "https://www.nytimes.com/2024/05/23/us/politics/biden-kenya-key-ally-designation.html"
  },
  {
    "text": "Centrist challenger ousts progressive DA in Oregon  —  Nathan Vasquez, a career prosecutor, vowed to be tough on crime in Portland.  —  Centrist district attorney candidate Nathan Vasquez has ousted the incumbent progressive prosecutor in Oregon's Multnomah County, home to Portland … ",
    "url": "https://www.politico.com/news/2024/05/22/centrist-challenger-ousts-progressive-da-in-oregon-00159589"
  },
  {
    "text": "Inside the White House, a Debate Over Letting Ukraine Shoot U.S. Weapons Into Russia  —  After a sobering trip to Kyiv, Secretary of State Antony J. Blinken is urging the president to lift restrictions on how Ukraine can use American arms.  —  Since the first American shipments … ",
    "url": "https://www.nytimes.com/2024/05/22/us/politics/white-house-ukraine-weapons-russia.html"
  },
  {
    "text": "Millionaires tax revenue reaches $1.8 billion, on pace to double estimates  —  Beacon Hill spent most of the past year in hand-wringing mode over the state's finances as tax revenues sagged month after month and new costs exploded, but lawmakers might soon have hundreds of millions of dollars … ",
    "url": "https://www.wgbh.org/news/politics/2024-05-21/millionaires-tax-revenue-reaches-1-8-billion-on-pace-to-double-estimates"
  },
  {
    "text": "Republican Abe Hamadeh called election deniers ‘crazies’ in text messages to now-rival Blake Masters  —  Republican congressional candidate Abe Hamadeh privately called those who believe stolen election claims “crazies” in text messages obtained by The Arizona Republic.",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/05/22/abe-hamadeh-called-election-deniers-crazies-in-text-messages/73803422007/"
  },
  {
    "text": "What's breaking up the Texas Republican party?  School vouchers  —  Out-of-state donors are funneling millions of dollars into state legislative races to defeat Republicans who opposed the governor's top education priority.  —  When nearly two dozen Republican state lawmakers defied Texas … ",
    "url": "https://www.politico.com/news/2024/05/22/texas-republican-primary-school-vouchers-choice-00159219"
  },
  {
    "text": "Israel Rages as Ireland, Spain, and Norway Move to Recognize Palestinian State  —  ‘REWARD HAMAS’  —  The historic move will be punished with “severe consequences,” Israel's foreign minister said.  —  Ireland, Spain, and Norway on Wednesday said they will officially recognize a Palestinian state … ",
    "url": "https://www.thedailybeast.com/israel-rages-as-ireland-spain-and-norway-move-to-recognize-palestinian-state"
  },
  {
    "text": "“Everyone is absolutely terrified”: Inside a US ally's secret war on its American critics  —  I met Raqib Naik, a journalist who had fled his native India, at a coffee shop in suburban Maryland.  We sat at the same metal table where he once discussed the prospect of his assassination with FBI agents.",
    "url": "https://www.vox.com/world-politics/24160779/inside-indias-secret-campaign-to-threaten-and-harass-americans"
  },
  {
    "text": "EXCLUSIVE: Paul Manafort has been back channeling campaign tips through top Trump aides since last year, Republicans tell 24sight News  —  Paul Manafort, the former campaign manager for Donald Trump, has been secretly advising the 2024 re-election effort through his top campaign aides since last summer … ",
    "url": "https://www.24sight.news/p/24sight-exclusive-manafort-trump-back-channel"
  }
]