[
  {
    "text": "Trump White House reverses course, rescinds freeze on federal grants  —  The budget office came under immense pressure over the impacts on a sudden pause in key government spending  —  The White House budget office on Wednesday rescinded an order freezing federal grants … ",
    "url": "https://www.washingtonpost.com/business/2025/01/29/white-house-budget-office-spending-freeze/"
  },
  {
    "text": "White House rescinds Trump's funding freeze after massive backlash  —  The White House Office of Management and Budget (OMB) rescinded a memo Wednesday that had ordered a “temporary pause” on federal funding and unleashed major confusion across the country.",
    "url": "https://www.axios.com/2025/01/29/federal-funding-freeze-memo-rescinded"
  },
  {
    "text": "White House says Trump funding freeze remains in effect despite rescinding OMB memo … The White House on Wednesday said a “federal funding freeze” remains in “full force and effect” despite it rescinding a controversial memo ordering that freeze on grants and loans to give agencies … ",
    "url": "https://www.cnbc.com/2025/01/29/white-house-rescinds-federal-funds-freeze-memo.html"
  },
  {
    "text": "Trump administration rescinds order attempting to freeze federal aid spending  —  The move comes just one day after the order was issued and a federal district judge temporarily halted it.  —  President Donald Trump's administration on Wednesday rescinded an order that attempted to freeze … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-administration-rescinds-order-attempting-freeze-federal-aid-spen-rcna189852"
  },
  {
    "text": "New memo, White House response adds to confusion on federal funding freeze  —  The Office of Management and Budget has rescinded its call for a pause on federal assistance, according to the agency's memo shared by Democracy Forward, which led a legal challenge over the effort.",
    "url": "https://www.npr.org/2025/01/29/g-s1-45313/trump-federal-funding-freeze-reversed"
  },
  {
    "text": "Tracker: Legal Challenges to Trump Administration Actions  —  This public resource tracks legal challenges to Trump administration actions.  If you think we are missing anything, you can email us at lte@justsecurity.org.  Special thanks to Just Security Student Staff Editors Rick Da and Jeremy Venook.",
    "url": "https://www.justsecurity.org/107087/tracker-legal-challenges-trump-administration-actions/"
  },
  {
    "text": "USDA inspector general escorted out of her office after defying White House  —  Security agents escorted the inspector general of the U.S. Department of Agriculture out of her office on Monday after she refused to comply with her firing by the Trump administration, sources familiar with the matter told Reuters.",
    "url": "https://www.usatoday.com/story/news/politics/2025/01/29/usda-inspector-general-escorted-office-trump-white-house/78024513007/"
  },
  {
    "text": "Trump to build mass detention camp for deportees at Guantánamo Bay  —  The president said he will issue an executive order to construct a detention camp with room for 30,000 migrants on the U.S. naval base in Cuba.  —  President Donald Trump said he will order the construction … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/29/guantanamo-cuba-el-salvador-deportations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MTI2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NTA5MTk5LCJpYXQiOjE3MzgxMjY4MDAsImp0aSI6Ijc5NTk4MzkyLTdkMzctNGM3YS1hZWI3LThmYWM3YTZiYmExNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAxLzI5L2d1YW50YW5hbW8tY3ViYS1lbC1zYWx2YWRvci1kZXBvcnRhdGlvbnMvIn0.p6vAFrI-7mf90ewNMEqKF2Ey47OMu5V1dELEze-eXwM&itid=gfta"
  },
  {
    "text": "Trump plans to sign the Laken Riley Act into law as his administration's first piece of legislation  —  President Donald Trump said Wednesday that he is directing the opening of a detention center at Guantanamo Bay to hold up to 30,000 migrants who are living illegally in the United States.",
    "url": "https://apnews.com/article/trump-signs-laken-riley-act-immigration-crackdown-30a34248fa984d8d46b809c3e6d8731a"
  },
  {
    "text": "RFK Jr. Completely Fumbles Basic Medicaid Facts at Hearing  —  That is not quite how Medicaid works, Mr. Kennedy.Robert F. Kennedy Jr. said Wednesday “most Americans are not happy” with Medicaid because “the premiums are too high,” suggesting he may be oblivious to the fact that Medicaid overwhelmingly does … ",
    "url": "https://www.thedailybeast.com/rfk-jr-completely-fumbles-basic-medicaid-facts-in-confirmation-hearing/"
  },
  {
    "text": "Trump Signs Agreement Calling for Meta to Pay $25 Million to Settle Suit  —  The president had sued the social-media company after his accounts were suspended  —  President Trump has signed settlement papers that are expected to require Meta Platforms to pay roughly $25 million to resolve … ",
    "url": "https://www.wsj.com/us-news/law/trump-signs-agreement-calling-for-meta-to-pay-25-million-to-settle-suit-6f734c8c?st=7ms8uR&reflink=article_imessage_share"
  },
  {
    "text": "Justice Dept. Is Said to Discuss Dropping Case Against Eric Adams  —  Senior officials under President Trump have talked with prosecutors in Manhattan about the possibility of abandoning the corruption case against Mr. Adams, the mayor of New York City.  —  Senior Justice Department officials … ",
    "url": "https://www.nytimes.com/2025/01/29/us/politics/justice-department-trump-charges-eric-adams.html?unlocked_article_code=1.s04.B-oP.OpKu5OrpcZNe&smid=url-share"
  },
  {
    "text": "Throw Biden under the bus  —  Sleepy Joe landed us in this mess with bad, selfish decisions  —  When Joe Biden stepped aside in favor of Kamala Harris, the overwhelming majority of Democrats praised him for the decision and painted an overall flattering portrait of Biden's presidency and his career.",
    "url": "https://www.slowboring.com/p/throw-biden-under-the-bus"
  },
  {
    "text": "Trump's First Big Fiasco Triggers Stephen Miller's Rage—Take Note Dems  —  Admitting failure is anathema to the authoritarian leader, who is perpetually in danger of being diminished by those who are resentful of his glory—which is why White House adviser Stephen Miller is frantically searching … ",
    "url": "https://newrepublic.com/article/190875/trump-stephen-miller-rage-democratss"
  },
  {
    "text": "Federal-Worker Buyouts May Make Government As Broken As X  —  In the latest episode of what MAGA nihilist Steve Bannon joyfully predicted would be “Days of Thunder” from the new Trump administration, on Tuesday the United States Office of Personnel Management offered all federal employees a buyout offer wrapped in menacing threats.",
    "url": "https://nymag.com/intelligencer/article/federal-worker-buyouts-may-make-government-as-broken-as-x.html"
  },
  {
    "text": "Former Sen. Bob Menendez Sentenced to 11 Years in Prison  —  New Jersey lawmaker was convicted of corruption offenses last year  —  Former Sen. Bob Menendez was sentenced to 11 years in prison Wednesday for promising to swap the power of his office for gold bars and other bribes … ",
    "url": "https://www.wsj.com/us-news/law/nj-senator-bob-menendez-sentenced-prison-d4d08339"
  },
  {
    "text": "White House aide says spending freeze isn't being rescinded despite memo  —  The White House is claiming the Wednesday move by the Office of Management and Budget (OMB) rescinding a controversial order that froze a wide swath of federal financial assistance is not actually an end to curbing government spending.",
    "url": "https://thehill.com/homenews/administration/5113776-white-house-press-secretary-spending-freeze/"
  },
  {
    "text": "DOJ moves to drop charges against former GOP lawmaker in case criticized by Trump  —  The step likely ends a legal saga that drove ex-Rep. Jeff Fortenberry from Congress over foreign donations.  —  The Justice Department has moved to drop its criminal prosecution of former Rep. Jeff Fortenberry … ",
    "url": "https://www.politico.com/news/2025/01/29/jeff-fortenberry-dismiss-charges-00201274"
  },
  {
    "text": "Trump administration to cancel student visas of pro-Palestinian protesters  —  U.S. President Donald Trump will sign an executive order on Wednesday to combat antisemitism and pledge to deport non-citizen college students and others who took part in pro-Palestinian protests, a White House official said.",
    "url": "https://www.reuters.com/world/us/trump-administration-cancel-student-visas-all-hamas-sympathizers-white-house-2025-01-29/"
  },
  {
    "text": "Governor Leaves Indiana's Predominantly Black University Out of Budget  —  Martin University had a short-lived burst of state funding.  But those funds disappeared in Governor Mike Braun's budget proposal, unveiled on the heels of an anti-DEI executive order.  One lawmaker calls it racist.",
    "url": "https://www.insidehighered.com/news/government/state-policy/2025/01/29/no-funds-black-university-indiana-governors-budget"
  },
  {
    "text": "‘Written by children’: Critics slam New York Times' glowing coverage of Trump official  —  White House Press Secretary Karoline Leavitt received glowing coverage from the New York Times for her press briefing debut despite delivering a performance that other observers have described as an “embarrassment.”",
    "url": "https://www.rawstory.com/karoline-leavitt-2671022553/"
  },
  {
    "text": "Trump Begins Second Term Stronger Than The First, 6 In 10 Voters Approve Of Sending U.S. Troops To Southern Border, Quinnipiac University National Poll Finds; Majority Disapprove Of Elon Musk's Role In Trump Administration  —  mail_outline  —  President Donald Trump is starting his second term … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3918"
  },
  {
    "text": "DHS Sec. Noem announces end to temporary protected status for Venezuelan migrants  —  Newly confirmed DHS Sec. Kristi Noem joins ‘Fox & Friends’ to discuss her efforts to crackdown on immigration, including the decision to remove the temporary status directive for Venezuelan migrants and the ICE raids in New York City.",
    "url": "https://www.foxnews.com/video/6367942790112"
  },
  {
    "text": "Defense secretary revokes Mark Milley's security detail and orders IG review  —  Pete Hegseth told Milley, a critic of Trump, that he had ordered an investigation to determine whether his rank should be re-evaluated.  —  WASHINGTON — Defense Secretary Pete Hegseth has told former Joint Chiefs … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/defense-secretary-revokes-mark-milleys-security-detail-orders-ig-revie-rcna189767"
  }
]