[
  {
    "text": "Jordan won't seek third speaker vote, allowing House to empower interim speaker  —  Rep. Jim Jordan (R-Ohio) will not seek an additional speaker vote Thursday, and he will back a plan to give Rep. Patrick T. McHenry (R-N.C.), the temporary speaker, additional powers, according to multiple people … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/19/house-speaker-vote-live/"
  },
  {
    "text": "House GOP abandons plan to empower temp speaker  —  Jim Jordan, who earlier on Thursday indicated that he would pause speaker balloting and back the idea, now could reverse course and go to the floor again.",
    "url": "https://www.politico.com/live-updates/2023/10/19/congress/empower-mchenry-dead-00122543"
  },
  {
    "text": "In the latest sign of House chaos, the temporary speaker is threatening to quit  —  Rep. Patrick McHenry, R-N.C., is resisting a push to get him to move legislation without an explicit vote to expand his powers.  —  WASHINGTON — In a closed-door meeting Thursday, Rep. Patrick McHenry … ",
    "url": "https://www.nbcnews.com/politics/congress/patrick-mchenry-house-speaker-pro-tempore-threaten-quit-rcna121314?taid=6531a4f91b640e000108b4c6"
  },
  {
    "text": "The Inside Story of How Jim Jordan Broke the Model, Didn't Become Speaker and Decided That was Fine  —  There's an aspect of the Jim Jordan Speaker Drama that hasn't gotten enough attention.  It's really the central element of the story.  Over the years I've argued that the post-2010 GOP caucus operates … ",
    "url": "https://talkingpointsmemo.com/edblog/the-inside-story-of-how-jim-jordan-broke-the-model-didnt-become-speaker-and-decided-that-was-fine"
  },
  {
    "text": "House GOP drowning as crisis reaches breaking point  —  It seems that every day without a speaker brings a new release of pent-up anger from Republicans who see no way out of their self-inflicted pain.  —  When Matt Gaetz stepped to the microphones during Thursday's three-hour private House GOP meeting … ",
    "url": "https://www.politico.com/news/2023/10/19/house-gop-speaker-mccarthy-gaetz-00122617"
  },
  {
    "text": "Jack Smith Slams Trump's Bid to Dismiss Jan. 6 Charges: ‘The Defendant Is Not Above The Law’  —  Donald Trump should not be exempt from prosecution on ‘presidential immunity’ grounds, prosecutors in the special counsel's office argued in a court filing Thursday night",
    "url": "https://themessenger.com/politics/trump-jack-smith-not-above-the-law"
  },
  {
    "text": "Texas City Settles Lawsuit With Biden Bus Passenger Who Says Police Ignored Calls About Trump Supporters  —  The lawsuit was filed by former Democratic Texas state Sen. Wendy Davis, who was on the Biden campaign bus … A Texas city on Wednesday agreed to pay a $175,000 settlement … ",
    "url": "https://themessenger.com/politics/texas-city-settles-lawsuit-with-biden-bus-passenger-who-says-police-ignored-calls-about-trump-supporters"
  },
  {
    "text": "Special counsel urges judge to deny Trump's Jan. 6 claim of immunity  —  ‘The defendant is not above the law,’ prosecutors say in opposing former president's bid to toss out federal 2020 election subversion prosecution  —  U.S. prosecutors urged a federal judge Thursday … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/10/19/special-counsel-rejects-trump-immunity-jan-6/"
  },
  {
    "text": "Bidens speak with family of Palestinian-American boy killed in hate crime  —  President Biden and First Lady Jill Biden have spoken with the family of a Palestinian-American boy killed in a hate crime outside of Chicago this week, the White House said, amid rising anti-Muslim tensions due … ",
    "url": "https://thehill.com/homenews/administration/4266196-bidens-speak-with-family-of-palestinian-american-boy-killed-in-hate-crime/"
  },
  {
    "text": "Trump attorney Sidney Powell pleads guilty in Georgia election subversion case  —  Former Donald Trump attorney Sidney Powell has pleaded guilty in the Georgia election subversion case, one day before her trial was set to start.  —  As part of her guilty plea, Powell is admitting her role … ",
    "url": "https://www.cnn.com/2023/10/19/politics/sidney-powell-fulton-county-georgia-2020-election-subversion/"
  },
  {
    "text": "Laphonza Butler Will Not Run for Senate in 2024  —  Ms. Butler, who was appointed by Gov. Gavin Newsom just weeks ago to fill Dianne Feinstein's seat, said she had realized that “this is not the greatest use of my voice.”  —  Laphonza Butler, who was appointed 18 days ago to fill … ",
    "url": "https://www.nytimes.com/2023/10/19/us/laphonza-butler-senate-california.html"
  },
  {
    "text": "Worldwide Caution  —  Due to increased tensions in various locations around the world, the potential for terrorist attacks, demonstrations or violent actions against U.S. citizens and interests, the Department of State advises U.S. citizens overseas to exercise increased caution.  U.S. citizens should:",
    "url": "https://travel.state.gov/content/travel/en/traveladvisories/traveladvisories/worldwide-caution.html"
  },
  {
    "text": "Dean Phillips has told lawmakers he's running against Joe Biden  —  But one person who talked to the representative said he was still being coy.  —  Rep. Dean Phillips has begun signaling to fellow House members that he plans to launch a challenge to President Joe Biden.",
    "url": "https://www.politico.com/news/2023/10/19/dean-phillips-biden-minnesota-democrat-00122642"
  },
  {
    "text": "Exclusive: US Army charges Private Travis King with desertion over dash into North Korea  —  The U.S. Army has charged Private Travis King with crimes ranging from desertion for running into North Korea in July to assault against fellow soldiers and solicitation of child pornography, according to documents obtained by Reuters.",
    "url": "https://www.reuters.com/world/us/us-army-charges-private-travis-king-with-desertion-over-dash-into-north-korea-2023-10-20/"
  },
  {
    "text": "More Than 400 Capitol Hill Staffers Call For Cease-Fire In Gaza  —  The staffers signed a letter as bloodshed escalates ― and as elected members of Congress are largely in lockstep behind the Biden administration's approach to the conflict.  —  Muslim and Jewish congressional staffers signed … ",
    "url": "https://www.huffpost.com/entry/capitol-hill-staffers-call-for-cease-fire-in-gaza_n_653198b9e4b03b213b094fe8"
  },
  {
    "text": "First on CNN: US Navy warship near Yemen intercepts multiple missiles, US officials say  —  A US Navy warship operating in the Middle East intercepted multiple projectiles near the coast of Yemen on Thursday, two US officials told CNN.  —  One of the officials said the missiles were fired … ",
    "url": "https://www.cnn.com/2023/10/19/politics/us-navy-intercept-missiles-yemen/"
  },
  {
    "text": "Judge Won't Let Alex Jones Use Bankruptcy to Avoid Sandy Hook Damages  —  A Texas court ruling means the Infowars broadcaster must pay most of the $1.4 billion he owes Sandy Hook families, regardless of whether his business survives.  —  The judge in Alex Jones's bankruptcy case ruled … ",
    "url": "https://www.nytimes.com/2023/10/19/us/politics/alex-jones-sandy-hook.html"
  },
  {
    "text": "Eric Trump hounded appraiser to inflate valuation of property on golf course: report  —  Former President Donald Trump's son Eric pressured a real estate executive to inflate the value of an as-yet-unbuilt 71-unit residential development at the Trump National Golf Club in Westchester County, New York, ABC News reported on Thursday.",
    "url": "https://www.rawstory.com/eric-trump-fraud/"
  },
  {
    "text": "Who is Patrick McHenry?  A crash course on the temporary speaker  —  The 18-year House veteran is seen as the “adult in the room” compared to other GOP hard-liners.  But it wasn't always that way.  —  He has “the greatest name in politics,” according to former President Donald Trump.",
    "url": "https://www.politico.com/news/2023/10/19/who-is-patrick-mchenry-acting-speaker-00122472"
  }
]