[
  {
    "text": "With Vance's elevation, Pennsylvania voters reexamine Trump's views on women  —  “Now that you've got Kamala in there, you've got a whole different ballgame,” one independent Pennsylvania voter said.  —  BUCKS COUNTY, Pa. — More than a week after Kamala Harris's debut as the likely Democratic … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/03/with-vances-elevation-pennsylvania-voters-reexamine-trumps-views-women/"
  },
  {
    "text": "Many Voters Say Kamala Harris's Race Is Not an Important Issue  —  Even as Trump plays up racial divisions, many Americans said they would rather not dwell on race or identity.  “We can all see that you're Black.”  —  “Obviously, we have eyes.”  —  That was the somewhat jaded response … ",
    "url": "https://www.nytimes.com/2024/08/03/us/kamala-harris-race-trump.html"
  },
  {
    "text": "Trump team gambles on new ground game capitalizing on loosened rules  —  The campaign is joining forces with outside groups such as Turning Point Action after regulators cleared the way for more coordination.  But it comes with the risk of untested outfits duplicating efforts or working at cross purposes.",
    "url": "https://www.washingtonpost.com/politics/2024/08/03/trump-allies-ground-game/"
  },
  {
    "text": "Election Live Updates: Trump and Vance Rally in Battleground Georgia, as Harris Mulls V.P. Choice  —  Donald J. Trump and his running mate will campaign in the same Atlanta arena where Kamala Harris held an event this week.  She is expected to announce her running mate by Tuesday.",
    "url": "https://www.nytimes.com/live/2024/08/03/us/harris-trump-election"
  },
  {
    "text": "Trump calls off ABC debate, suggests Fox News face-off instead  —  In a Truth Social post late Friday night, Trump wrote that the Sept. 10 debate on ABC was “terminated.”  —  Former President Donald Trump pulled out of the only scheduled debate with Democratic frontrunner Kamala Harris, proposing a new debate on Fox News on his terms.",
    "url": "https://www.politico.com/news/2024/08/03/trump-calls-off-abc-debate-suggests-fox-news-face-off-instead-00172554"
  },
  {
    "text": "Trump claims new debate deal as Harris urges sticking to existing date  —  The Harris campaign was baffled by Trump's claims that he had struck a deal for a new debate on Fox.  —  Republican presidential nominee Donald Trump claimed late Friday night to have struck a deal for a new debate … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/03/trump-harris-debate-abc-fox/"
  },
  {
    "text": "Trump says he's agreed to Fox News offer to debate Kamala Harris on Sept. 4  —  Donald Trump announced late Friday night that he has accepted an offer from Fox News to debate Kamala Harris in September.  —  The former president said in a Truth Social post that the debate would be held … ",
    "url": "https://nypost.com/2024/08/03/us-news/donald-trump-says-he-agreed-to-debate-kamala-harris-on-fox-news-in-september/"
  },
  {
    "text": "Jimmy Carter's next goal is voting for Kamala Harris for president  —  The former president is ‘more alert and interested in politics’ in recent days, his family says  —  As former President Jimmy Carter nears his 100th birthday, his milestone celebration isn't on his mind.  —  Defeating Donald Trump is.",
    "url": "https://www.ajc.com/politics/jimmy-carters-next-goal-is-voting-for-kamala-harris/UKCLDIUSSJC6JM4NP7HGOEDCNY/"
  },
  {
    "text": "Defense Secretary Revokes Plea Deal for Accused Sept. 11 Plotters  —  Defense Secretary Lloyd J. Austin III assumed direct oversight of the case and effectively put the death penalty back on the table.  —  Defense Secretary Lloyd J. Austin III on Friday relieved the overseer of the war court … ",
    "url": "https://www.nytimes.com/2024/08/02/us/politics/911-plotters-plea-deal.html?unlocked_article_code=1.AE4.HKWp.ZcD3F2UPP4xi&smid=url-share"
  },
  {
    "text": "Defense Secretary overrides plea agreement for accused 9/11 mastermind and two other defendants  —  WASHINGTON (AP) — Defense Secretary Lloyd Austin on Friday overrode a plea agreement reached earlier this week for the accused mastermind of the Sept. 11, 2001, attacks and two other defendants, reinstating them as death penalty cases.",
    "url": "https://apnews.com/article/guantanamo-sept-11-defendants-austin-defense-bf450589039b761c028492a348da4ea5"
  },
  {
    "text": "Trump and Harris go all-in to make Pennsylvania the new Florida … - The Trump and Harris 2024 presidential campaigns are set to spend more than double on advertising in Pennsylvania than in any of the other six swing states, according to an Axios analysis of AdImpact data.",
    "url": "https://www.axios.com/2024/08/03/trump-harris-pennsylvania-ad-spending-president"
  },
  {
    "text": "Mussolini, Trump and What Assassination Attempts Really Do  —  A scholar of Mussolini and authoritarianism explains how failed attacks can be used to consolidate power.  —  On April 7, 1926, Fascist leader Benito Mussolini gave a speech to a conference of surgeons, and then began walking with his aides through the streets of Rome.",
    "url": "https://www.politico.com/news/magazine/2024/08/03/assassination-attempts-mussolini-trump-00171825"
  },
  {
    "text": "Why Kamala Harris Has A Chance To Make History As A Policymaker  —  Signs point to child care, paid leave and home care as priorities she takes seriously — and personally.  —  LOADING  —  One of the Biden administration's biggest legislative setbacks came when Democratic leaders had to give up on their “caregiving” agenda.",
    "url": "https://www.huffpost.com/entry/kamala-harris-paid-leave-child-care_n_66ad4d56e4b0bc1c990d6bcb"
  },
  {
    "text": "Office of the Governor - News Release - Gov. Green Announces $4 Billion Global Settlement in Principle to Resolve Maui Wildfire Lawsuits  —  JOSH GREEN, M.D.  —  GOVERNOR  —  KE KIAʻĀINA  —  GOVERNOR GREEN ANNOUNCES $4 BILLION GLOBAL SETTLEMENT IN PRINCIPLE TO RESOLVE MAUI WILDFIRE LAWSUITS",
    "url": "https://governor.hawaii.gov/newsroom/office-of-the-governor-news-release-gov-green-announces-4-billion-global-settlement-in-principle-to-resolve-maui-wildfire-lawsuits/"
  },
  {
    "text": "Harris has secured enough Democratic delegate votes to become their party's nominee, chair says  —  Harris has secured enough Democratic delegate votes to be the party's nominee, DNC chair says  —  Vice President Kamala Harris has secured enough votes from delegates to become her party's nominee … ",
    "url": "https://apnews.com/article/kamala-harris-nomination-dnc-463d0b8095f2ca3526b3af3a2f44c3ca"
  }
]