[
  {
    "text": "Tens of millions of early votes have been cast.  What could it mean for Election Day?  —  One expert warns limited data fail to show a major advantage for either party.  —  Residents wait in a line around city hall to cast their ballots on the last day of early voting in Philadelphia, Pa., Oct. 29, 2024.",
    "url": "https://abcnews.go.com/Politics/tens-millions-early-votes-cast-election-day/story?id=115272249"
  },
  {
    "text": "Supreme Court allows Pennsylvania to count contested provisional ballots, rejecting Republican plea  —  The Supreme Court on Friday rejected an emergency appeal from Republicans that could have led to thousands of provisional ballots not being counted in Pennsylvania as the presidential campaigns vie … ",
    "url": "https://apnews.com/article/bucks-county-pennsylvania-early-mail-voting-deadline-05296504a3237956d96126570137a9f1"
  },
  {
    "text": "The Supreme Court decides not to toss out thousands of Pennsylvania ballots  —  One of the worst ideas in US constitutional law will remain dead. … On Friday evening, the Supreme Court ruled it would leave in place a Pennsylvania Supreme Court decision that made it marginally easier for certain voters in the state to cast a ballot.",
    "url": "https://www.vox.com/scotus/381997/supreme-court-republican-genser-pennsylvania-ballots"
  },
  {
    "text": "Liz Cheney Tells George W. Bush to Endorse Kamala Harris: 'It's Time'  —  TICK TOCK  —  The Republican publicly urged Bush to speak out in the wake of his daughter's shock endorsement.  —  Liz Cheney is calling on George W. Bush to make his voice heard on the “danger that Donald Trump poses.”",
    "url": "https://www.thedailybeast.com/liz-cheney-tells-george-w-bush-to-endorse-kamala-harris-its-time/"
  },
  {
    "text": "Nicolle Wallace Calls on Her Former Boss, George W. Bush, to Denounce Trump  —  Ms. Wallace, who served as the communications director in the Bush White House, made the appeal on her MSNBC program.  —  Nicolle Wallace, who was a White House communications director in George W. Bush's administration … ",
    "url": "https://www.nytimes.com/2024/11/01/us/politics/george-w-bush-nicole-wallace-2024-election.html"
  },
  {
    "text": "Trump Still Can't Stop Talking About Women  —  The countdown to the election feels like an Advent calendar with a dubious remark behind each door.  —  Vice President Kamala Harris almost never talks about what it would mean to elect a female president, nor does she speculate about why women disproportionately support her candidacy.",
    "url": "https://www.nytimes.com/2024/11/01/us/politics/harris-trump-womens-health-election.html"
  },
  {
    "text": "Arizona's top prosecutor investigating Trump's comments about Cheney as possible death threat  —  During his Glendale appearance, Trump suggested his Republican critic should face ‘nine barrels shooting at her.’  —  PHOENIX — Arizona's top prosecutor tells 12News she is investigating whether … ",
    "url": "https://www.12news.com/article/news/politics/elections/arizona-top-prosecutor-kris-investigating-trumps-comments-about-cheney-possible-death-threat/75-91f8b734-06eb-4aeb-a633-89be0df7c4c4"
  },
  {
    "text": "Kamala Harris ahead in enough swing states to win, Times poll says  —  Final survey before the 2024 US election shows the Democrat leading Donald Trump in Michigan, Nevada, Pennsylvania and Wisconsin  —  Kamala Harris is on track to become America's first female president by a narrow margin thanks … ",
    "url": "https://www.thetimes.com/world/us-world/article/us-election-2024-swing-state-polls-c8r398mnf"
  },
  {
    "text": "Kamala Harris Is Not Our Savior.  But a Donald Trump Win Would Be Catastrophic.  —  In this op-ed, Teen Vogue's editor in chief argues that voting Harris is our best chance of stopping the irreversible damage of another Trump presidency.  —  Donald Trump cannot win this election.  Full stop.",
    "url": "https://www.teenvogue.com/story/kamala-harris-but-a-donald-trump-win-would-be-catastrophic"
  },
  {
    "text": "A Tight Senate Battle Comes Down to a Few Key Races … After two years and a multibillion-dollar barrage of political attack ads, the fight for Senate control is down to a handful of races, with Republicans holding a clear edge but Democrats maintaining a narrow path to retaining their majority if events break their way.",
    "url": "https://www.nytimes.com/2024/11/02/us/elections/senate-battlegrounds.html?unlocked_article_code=1.W04.U9LD.c_n848PFQ7oc&smid=url-share"
  },
  {
    "text": "Jeffrey Epstein details close relationship with Trump in newly released tapes  —  Recordings from 2017 reveal Epstein talking for some ‘100 hours’ about the ex-president, journalist Michael Wolff says  —  A New York author and journalist has released audio tapes that appear to detail … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/01/trump-jeffrey-epstein-tapes"
  },
  {
    "text": "Pa. officials apologize for shackled Harris display in Halloween parade  —  Community officials in Pennsylvania apologized after someone dressed as Vice President Kamala Harris pretended to be shackled behind a vehicle during a parade.  —  Officials in a small Pennsylvania community apologized Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/01/kamala-harris-halloween-parade-mount-pleasant-pennsylvania/"
  },
  {
    "text": "So, Can We Trust the Polls?  —  Recent changes add up to a case for cautious optimism on better accuracy, but that's far from a guarantee.  —  The polls underestimated Donald J. Trump in 2016.  —  They underestimated him again in 2020.  —  So can we trust the polls this time?",
    "url": "https://www.nytimes.com/2024/11/01/upshot/so-can-we-trust-the-polls.html"
  },
  {
    "text": "Trump, Preparing to Challenge the Results, Puts His 2020 Playbook Into Action  —  Step by step, Donald J. Trump and his allies are following the strategies that caused chaos four years ago.  Election officials say they are ready this time.  —  Former President Donald J. Trump and his allies … ",
    "url": "https://www.nytimes.com/2024/11/02/us/politics/donald-trump-kalama-harris-campaign.html?unlocked_article_code=1.W04.kxnp.Cn2-MFrzbVaa&smid=url-share"
  },
  {
    "text": "How the Democrats Bungled the Politics of Immigration  —  A massive new surge of migrants turned the Biden administration's efforts to make border policy more humane into a liability  —  At a rally this week in Madison Square Garden, Donald Trump asked for what he calls his “favorite chart” to be beamed onto the giant screens.",
    "url": "https://www.wsj.com/politics/elections/how-the-democrats-bungled-the-politics-of-immigration-0569acfc"
  },
  {
    "text": "An Idaho health department isn't allowed to give COVID-19 vaccines anymore.  Experts say it's a first  —  A regional public health department in Idaho is no longer providing COVID-19 vaccines to residents in six counties after a narrow decision by its board.",
    "url": "https://apnews.com/article/covid19-vaccine-public-health-idaho-76f1c29bf3f07a2c029175bf6c2180c4"
  },
  {
    "text": "Americans, your calls and texts can be monitored by Chinese spies  —  The U.S. government and the telecom companies need to share more information.  —  Last week, the Chinese hacking and spying operation known as “Salt Typhoon” was revealed to have targeted former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/opinions/2024/11/02/china-spying-telecom-trump-harris-fbi-cell-phone/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwNTIwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxOTA1OTk5LCJpYXQiOjE3MzA1MjAwMDAsImp0aSI6ImEyMmEyZjc1LWExYTctNGRjYi1iM2MxLTk4NzcyNDIzMDQ0MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzExLzAyL2NoaW5hLXNweWluZy10ZWxlY29tLXRydW1wLWhhcnJpcy1mYmktY2VsbC1waG9uZS8ifQ.27BwX-yhSOfFCZRURkegh9J60gQG2i24qVlwMroKwLM&itid=gfta"
  },
  {
    "text": "European Greens ask Jill Stein to stand down and endorse Kamala Harris  —  US Green party leader urged to withdraw from presidential race to prevent Donald Trump victory  —  A coalition of European Greens have urged the US Green party's nominee, Jill Stein, to pull out of next week's election … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/01/european-greens-ask-jill-stein-to-stand-down-and-endorse-kamala-harris"
  }
]