[
  {
    "text": "Deposition video shows Trump claiming he prevented “nuclear holocaust” as president  —  Combative, angry and prone to grandiose claims — newly unveiled footage of an April 2023 deposition gives a glimpse into how former President Donald Trump behaves when testifying under oath.",
    "url": "https://www.cbsnews.com/news/trump-deposition-video-testimony-new-york-fraud-case-nuclear-holocaust/"
  },
  {
    "text": "A ‘whale’ of a tale: Trump continues to distort cognitive test he took  —  The Montreal Cognitive Assessment, a test aimed at detecting dementia or cognitive decline, never included the combination of animals Trump identified this week  —  Donald Trump this week bragged about purportedly acing … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/19/trump-cognitive-test/"
  },
  {
    "text": "Trump's Angry Rant About His Legal Mess Reveals an Ugly MAGA Truth … Donald Trump's lawyers have been arguing in court that he should have immunity from prosecution for crimes related to his insurrection because they constituted official acts committed while he was president.",
    "url": "https://newrepublic.com/article/178252/trump-truth-social-rant-ugly-maga-truth"
  },
  {
    "text": "The Presidential Contest in New Hampshire  —  Marist New Hampshire Poll  —  Biden Would Best Trump, DeSantis in New Hampshire... Haley Would Edge Biden in the Granite State  —  In this Marist Poll of New Hampshire, President Joe Biden performs best against Ron DeSantis and former President Donald Trump … ",
    "url": "https://maristpoll.marist.edu/polls/the-presidential-contest-in-new-hampshire/"
  },
  {
    "text": "Bank records: DA Willis and special prosecutor traveled together during Trump probe  —  Bank records show that special prosecutor Nathan Wade purchased airline tickets in his and Fulton County District Attorney Fani Willis' name for trips to San Francisco and Miami, according to a court motion filed Friday.",
    "url": "https://www.ajc.com/live-updates/politics/bank-records-da-wills-and-special-prosecutor-traveled-together-during-trump-probe/ZNDCH5RHDFGC5CKRWNS7HI2R5M/"
  },
  {
    "text": "Comer's habit of cherry-picking depositions comes back to haunt him  —  One of the arguments offered by attorneys for President Biden's son Hunter when responding to a subpoena from the House Oversight Committee for a closed-door deposition was that the committee had shown a pattern … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/19/comers-habit-cherry-picking-depositions-comes-back-haunt-him/"
  },
  {
    "text": "Entire Town's Newspapers Stolen On Day It Runs Story About Rape At Police Chief's Home  —  “It's pretty clear that someone didn't want the community to read the news this week,” said Ouray County Plaindealer co-publisher Erin McIntyre.  —  LOADING  —  It's an old-fashioned paper caper ― but maybe don't call the cops.",
    "url": "https://www.huffpost.com/entry/ouray-stolen-newspapers-police-chief-rape_n_65aa9f5fe4b076abd7ab6a90"
  },
  {
    "text": "Sports Illustrated lays off most of its staff, threatening iconic brand's future  —  Much of the staff of Sports Illustrated, and possibly all remaining writers and editors, received layoff notices Friday, which essentially could spell the end of a publication that for decades was the gold standard of sports journalism.",
    "url": "https://www.washingtonpost.com/sports/2024/01/19/sports-illustrated-layoffs/"
  },
  {
    "text": "DC bar authorities file disciplinary charges against pro-Trump 2020 election lawyers  —  The charges are the latest in a slew of disciplinary proceedings against attorneys who aided Donald Trump's bid to subvert the election.  —  Washington, D.C. bar investigators have filed disciplinary charges … ",
    "url": "https://www.politico.com/news/2024/01/19/dc-trump-2020-election-lawyers-00136667"
  },
  {
    "text": "Nikki Haley DID cheat on husband Michael - had affairs with her comms consultant and a MARRIED South Carolina lobbyist before she became governor, sworn affidavits and new witnesses claim  — Nikki Haley, 51, denied claims she cheated on her husband Michael before she became South Carolina governor … ",
    "url": "https://www.dailymail.co.uk/news/article-12970377/Nikki-Haley-cheated-affair-husband-affidavits-witnesses.html"
  },
  {
    "text": "January 18, 2024  —  This afternoon, Congress passed a new continuing resolution necessary to fund the government past the upcoming deadlines in the previous continuing resolution.  Those deadlines were tomorrow (January 19) and February 2.  The deadlines in the new measure are March 1 and March 8.",
    "url": "https://heathercoxrichardson.substack.com/p/january-18-2024"
  },
  {
    "text": "Robb grand jury forms to examine investigation  —  Editor's note: This story was updated at 5:20 p.m. on Jan. 19 to clarify how the jury will operate.  —  A jury has been convened in Uvalde to determine if law enforcement officers will face criminal charges related to the attack at Robb Elementary School.",
    "url": "https://www.uvaldeleadernews.com/articles/grand-jury-begins-examining-robb-school-investigation/"
  },
  {
    "text": "My proposed additions to the New York Times style guide to improve its political coverage  —  The New York Times repeatedly abuses the English language in its political reporting.  —  I decided it needs some additions to its style guide.  —  Here are my initial suggestions.",
    "url": "https://presswatchers.org/2024/01/my-proposed-additions-to-the-new-york-times-style-guide-to-improve-its-political-coverage/"
  },
  {
    "text": "Louisiana Legislature spurns Johnson, enacts new House map he opposed  —  The new map means an all-but-certain pickup for House Democrats.",
    "url": "https://www.politico.com/live-updates/2024/01/19/congress/louisiana-gives-dems-a-leg-up-00136673"
  },
  {
    "text": "Half of recent US inflation due to high corporate profits, report finds  —  Thinktank report says ‘resounding evidence’ shows companies continue to keep prices high even as their inflationary costs drop  —  A new report claims “resounding evidence” shows that high corporate profits … ",
    "url": "https://www.theguardian.com/business/2024/jan/19/us-inflation-caused-by-corporate-profits"
  },
  {
    "text": "Trump-backed Ohio Senate candidate shredded documents as he faced a lawsuit accusing him of wage theft  — Bernie Moreno, backed by Trump, is well-positioned to be the GOP nominee for Senate in Ohio.  — He settled over a dozen wage theft lawsuits before launching his campaign.",
    "url": "https://www.businessinsider.com/bernie-moreno-ohio-shredded-documents-employee-massachusetts-lawsuit-2024-1"
  },
  {
    "text": "Global Millionaires Say Yes to Taxing Extreme Wealth, Poll Finds  —  But by US standards, they may not be rich enough to matter.  —  Millionaires from around the world support wealth taxes as a way to curb extreme inequality, according to a new poll that was released to coincide with the meeting … ",
    "url": "https://www.motherjones.com/politics/2024/01/poll-patriotic-millionaires-support-extreme-wealth-tax/"
  },
  {
    "text": "Scoop: W.H. demands proof from Cabinet officials on return-to-office  —  White House Chief of Staff Jeff Zients is ratcheting up pressure on Cabinet secretaries and agencies heads to bring their workforce back into the office, telling them to “personally track” their progress and develop “concrete plans” to achieve their goals.",
    "url": "https://www.axios.com/2024/01/19/zients-biden-cabinet-return-to-office"
  },
  {
    "text": "Dems float a trade: Ukraine-border deal for protecting Johnson  —  The longshot notion underscores the increasingly desperate thinking around getting a Senate compromise through the House.  —  With Senate negotiators expected to unveil their elusive bipartisan border deal any day now … ",
    "url": "https://www.politico.com/news/2024/01/19/democrats-johnson-ukraine-border-deal-00136568"
  },
  {
    "text": "Media outlets making their own coverage decisions isn't “authoritarian”  —  Trump's call to take them off the air is  —  Sen. Marco Rubio (R-FL) is worried about creeping authoritarianism in the United States.  Not from Donald Trump, whose presidential bid Rubio endorsed Sunday despite … ",
    "url": "https://www.mediamatters.org/donald-trump/media-outlets-making-their-own-coverage-decisions-isnt-authoritarian"
  }
]