[
  {
    "text": "This Crew Is Totally Beatable  —  At the climax of the Republican National Convention last night, former President Donald Trump's nomination-acceptance speech was a disheveled mess, endless and boring.  He spoke for 93 minutes, the longest such speech on record.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/donald-trump-republican-party-nomineee/679109/"
  },
  {
    "text": "Was That the Worst Convention Speech of All Time?  —  I hope that you were not, like me, required to watch Donald Trump's speech at the Republican National Convention on Thursday night (and into Friday morning), and were instead doing something more enjoyable: Going out with friends … ",
    "url": "https://jill.substack.com/p/was-that-the-worst-convention-speech"
  },
  {
    "text": "The totalitarian tell in Trump's “unity” speech  —  Kim Jung Un and Victor Orban are role models for a type of unity, but not the type you would enjoy  —  By now you have no doubt heard that Donald Trump (a man who, I should note, has spent years urging his supporters to commit violent acts … ",
    "url": "https://www.findinggravity.net/p/the-totalitarian-tell-in-trumps-unity"
  },
  {
    "text": "Why Did Trump Give a Bad Speech?  —  Why Did Trump Give a Bad Speech?  —  There may be more to the former president's turn at the RNC than meets the eye.  —  Donald Trump filibustered his own nomination Thursday night—and Friday morning, too: His 90-minute acceptance remarks didn't finish until well after midnight Eastern time.",
    "url": "https://www.theamericanconservative.com/why-did-trump-give-a-bad-speech/"
  },
  {
    "text": "Trump did something he's never done before with RNC speech.  Now, the election may already be over  —  I may be a Democrat, but I'm also a clear-eyed political analyst.  Donald Trump clearly rose to the occasion with his RNC speech  —  Donald Trump may well have sealed the outcome … ",
    "url": "https://www.foxnews.com/opinion/trump-did-something-hes-never-done-before-rnc-speech-now-election-may-already-over"
  },
  {
    "text": "Ohio Sen. Sherrod Brown calls for Biden to drop out of the 2024 race  —  Brown has a competitive race in November, and his defection — the fourth by a Democratic senator — is a significant one.  —  Sen. Sherrod Brown of Ohio called on President Joe Biden to end his re-election campaign Friday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ohio-sen-sherrod-brown-calls-biden-drop-2024-race-rcna162804"
  },
  {
    "text": "Biden's family starts discussing his exit plan from the 2024 race  —  The president's family members have discussed how he would want to end his re-election bid on his own timing and with a carefully calculated plan in place.  —  WASHINGTON — Members of President Joe Biden's family … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/bidens-family-starts-discussing-exit-plan-2024-race-rcna162658"
  },
  {
    "text": "Secluded in Rehoboth, Biden Stews at Allies' Pressure to Drop Out of the Race  —  As he recovers from Covid, the president has grown resentful toward Democratic congressional leaders and former President Barack Obama.  —  Sick with Covid and abandoned by allies, President Biden has been fuming … ",
    "url": "https://www.nytimes.com/2024/07/19/us/politics/biden-drop-out-2024-election.html"
  },
  {
    "text": "AOC Issues Dire Warning on Threats to Come if Biden Drops Out  —  On Instagram Live early Friday morning, Representative Alexandria Ocasio-Cortez discussed the ongoing debate over whether President Biden is fit to run for reelection.  —  Speaking for close to an hour, the New York progressive explained … ",
    "url": "https://newrepublic.com/post/184042/aoc-alexandria-ocasio-cortez-warning-biden-drop-out-instagram-live"
  },
  {
    "text": "Alexandria Ocasio-Cortez warns anti-Biden Democrats about what comes next if they succeed  —  The progressive New Yorker spoke on Instagram about the potential risks of pressuring President Joe Biden to end his campaign.  —  Rep. Alexandria Ocasio-Cortez, D-N.Y., has issued a dire warning … ",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/aoc-biden-nomination-alexandria-ocasio-cortez-rcna162761"
  },
  {
    "text": "Harris Struggles to Reassure Major Democratic Donors  —  On a call, Vice President Kamala Harris told about 300 donors that there was little to worry about.  Several listeners said they found the call to have little value.  —  Vice President Kamala Harris tried to buck … ",
    "url": "https://www.nytimes.com/2024/07/19/us/politics/kamala-harris-donors.html"
  },
  {
    "text": "Michael Moritz, Democratic Megadonor, Urges Biden Exit: ‘Clock Has Run Out’  —  Mr. Moritz became one of the party's top contributors to go public with his fears about the president's candidacy, saying that Mr. Biden had a choice: “vanity or virtue.”  —  Michael Moritz, the billionaire … ",
    "url": "https://www.nytimes.com/2024/07/19/us/politics/michael-moritz-biden.html"
  },
  {
    "text": "Pelosi voiced support for an open nomination process if Biden drops out  —  Some California House Democrats don't want the process to replace the president on the ticket to seem like a Kamala Harris coronation.  —  In a meeting with fellow California Democrats last week … ",
    "url": "https://www.politico.com/news/2024/07/19/pelosi-support-open-nomination-biden-drop-out-00169893"
  },
  {
    "text": "Florida OKs Misleading Statement To Print Next To Pro-Choice Ballot Measure  —  The supposedly nonpartisan committee that drafted it included an economist from the ultra-conservative Heritage Foundation, the group behind Project 2025.  —  LOADING  —  The advocates behind Florida's pro … ",
    "url": "https://www.huffpost.com/entry/florida-republicans-ok-misleading-statement-to-print-next-to-pro-choice-ballot-measure_n_669ad3d2e4b07f2755f4799a"
  },
  {
    "text": "Confronting the hate, Phil Williams tells neo-Nazis: ‘When I look at you guys, I do not think master race.’  —  NASHVILLE, Tenn. (WTVF) — This is my town.  —  Nashville belongs to us — not the out-of-state neo-Nazis who have created havoc this week on our streets with their symbols of hate and vile words.",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/franklin-politics/confronting-the-hate-phil-williams-tells-neo-nazis-when-i-look-at-you-guys-i-do-not-think-master-race"
  },
  {
    "text": "Meghan McCain Doesn't ‘Believe’ Biden Has COVID  —  TRUTHER  —  The late senator John McCain's daughter expressed her view that Biden's administration is using COVID as an “excuse for him to step down gracefully.”  —  Meghan McCain doesn't believe the president really has COVID … ",
    "url": "https://www.thedailybeast.com/meghan-mccain-doesnt-believe-biden-has-covid"
  },
  {
    "text": "Project 2025 Plan for Trump Presidency Has Far-Reaching Threats to Science  —  If you're enjoying this article, consider supporting our award-winning journalism by subscribing.  By purchasing a subscription you are helping to ensure the future of impactful stories about the discoveries and ideas shaping our world today.",
    "url": "https://www.scientificamerican.com/article/project-2025-plan-for-trump-presidency-has-far-reaching-threats-to-science/"
  },
  {
    "text": "Horny for fascism  —  You ever have one of those days where nothing surprises you but the sheer volume of things not surprising you is kind of overwhelming?  —  Here's Politico reporter Natalie Allison with an extremely unsurprising yet deeply stupid bit of not-journalism:",
    "url": "https://www.findinggravity.net/p/horny-for-fascism"
  }
]