[
  {
    "text": "Syria Live Updates: Government Forces Withdraw From Damascus Suburbs, Monitors Say  —  Two war monitoring groups said Syria's military had pulled out of a number of Damascus suburbs where anti-government protests erupted.  The movements could not immediately be confirmed.  —  Here are the latest developments.",
    "url": "https://www.nytimes.com/live/2024/12/07/world/syria-war-damascus"
  },
  {
    "text": "In the Syrian Regime's Hour of Need, Its Patron Iran Makes an Exit  —  The collapse of a partnership built over four decades would reshape the balance of power in the Middle East.  —  For decades, Iran has expended much blood and money in support of Syria's president, Bashar al-Assad … ",
    "url": "https://www.nytimes.com/2024/12/07/world/middleeast/iran-syria-rebels.html"
  },
  {
    "text": "US announces nearly $1 billion more in longer-term weapons support for Ukraine  —  The United States will provide nearly $1 billion more in longer-term weapons support to Ukraine, Defense Secretary Lloyd Austin said Saturday as the Biden administration rushes to spend all the congressionally approved money … ",
    "url": "https://apnews.com/article/ukraine-weapons-russia-trump-biden-himars-zelenskyy-7b2560ad6bd54a6275da0ceb5241c0e8"
  },
  {
    "text": "Biden administration announces nearly $1 billion aid package for Ukraine as Trump meets with Zelenskyy  —  The package brings the total the U.S. has committed to Ukraine to over $62B.  —  In this Oct. 21, 2024, file photo, US Secretary of Defense Lloyd Austin speaks at a press briefing following … ",
    "url": "https://abcnews.go.com/Politics/biden-administration-announces-1-billion-aid-package-ukraine/story?id=116562732"
  },
  {
    "text": "What the Murder of the UnitedHealthcare C.E.O. Means to America  —  What the death of a health-insurance C.E.O. means to America.  —  As you know, the C.E.O. of UnitedHealthcare, fifty-year-old Brian Thompson, was murdered on the street in midtown Manhattan, on Wednesday morning, twenty minutes before sunrise.",
    "url": "https://www.newyorker.com/news/the-lede/what-the-murder-of-the-unitedhealthcare-ceo-brian-thompson-means-to-america"
  },
  {
    "text": "South Korean President Yoon's impeachment vote fails after ruling party boycotts it  —  A South Korean legislative push to impeach President Yoon Suk Yeol over his short-lived imposition of martial law fell through on Saturday after most lawmakers from his conservative governing party boycotted the vote.",
    "url": "https://apnews.com/article/south-korea-politics-yoon-martial-law-impeachment-3f2a9190bf5cec83b49e2c6ad5cf5379"
  },
  {
    "text": "Trump isn't back in office but he's already pushing his agenda and negotiating with world leaders  —  He's making threats, traveling abroad and negotiating with world leaders.  Donald Trump has more than a month and a half to go before he's sworn in for a second term.",
    "url": "https://apnews.com/article/trump-transition-trade-foreign-leader-meetings-biden-c795cbb38b6b943c19a70fe046cad7d5"
  },
  {
    "text": "How Trump's transition could end up hamstringing his agenda  —  The president-elect's advisers haven't yet begun meeting with federal agencies, despite signing an agreement late last month allowing them to do so.  —  President-elect Donald Trump's transition team still has not sent policy advisers … ",
    "url": "https://www.politico.com/news/2024/12/07/trump-transition-team-delays-00193119"
  },
  {
    "text": "Trump hesitates to personally lobby for endangered Cabinet picks  —  The president-elect is not yet personally pushing hard for his selections, limiting his exposure if they withdraw or fail to win confirmation.  —  President-elect Donald Trump, a lifelong teetotaler whose brother struggled … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/07/trump-hegseth-cabinet-picks/"
  },
  {
    "text": "What Republicans and Democrats Get Wrong About Crime  —  Americans are understandably concerned about crime.  Before the 2024 election, voters consistently ranked it among their top priorities.  At least two states rolled back reforms this year, and prison populations in many states … ",
    "url": "https://www.nytimes.com/2024/12/07/opinion/crime-prison-police-republicans-democrats.html?unlocked_article_code=1.fk4.dVnK.zcWrlFPy5XFo&smid=url-share"
  },
  {
    "text": "Now Is the Time for Courage  —  One month after the election of Donald Trump I feel more certain about who he is and what he aims to achieve but less certain about who stands in opposition to him.  Trump is an aspiring dictator who aims to aggregate his power to reward his friends and punish his enemies.",
    "url": "https://www.democracydocket.com/opinion/now-is-the-time-for-courage/"
  },
  {
    "text": "Supreme Court term-limits amendment proposed by Sens. Manchin, Welch  —  The long-shot proposal by Sen. Peter Welch (D-Vermont) and outgoing Sen. Joe Manchin III (I-West Virginia) would impose 18-year term limits on new justices.  —  Two senators have introduced a constitutional amendment … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/07/supreme-court-term-limits-amendment-manchin-welch/"
  },
  {
    "text": "Far-right activists from Germany spent US election day at Trump's Mar-a-Lago  —  AfD parliamentary candidate and influencers posed for photos with now president-elect at his Florida home  —  As Donald Trump gathered his supporters, family and friends at Mar-a-Lago on US election day last month … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/07/far-right-activists-from-germany-spent-us-election-day-at-trumps-mar-a-lago"
  },
  {
    "text": "Democrats inch toward the anger phase of their election loss  —  The winter meeting of state Democratic chairs in Arizona marked one of the first major gatherings of top party officials since last month's disastrous election.  —  SCOTTSDALE, Arizona — Exactly one month after losing … ",
    "url": "https://www.politico.com/news/2024/12/07/democrat-chairs-post-election-anger-exhaustion-00193120"
  }
]