[
  {
    "text": "Biden hits Trump during campaign HQ speech: He's ‘not for anything’ and ‘against everything’  —  President Biden hit former President Trump Saturday, claiming the GOP front-runner doesn't “stand for anything,” during a stop at his campaign headquarters in Wilmington, Del., near his family home.",
    "url": "https://thehill.com/homenews/campaign/4446546-biden-hits-trump-during-campaign-hq-speech/"
  },
  {
    "text": "Biden Says This Is the ‘Weirdest Campaign Ever’ as Trump Suggests He's an Elvis Lookalike  —  He's also compared himself to the Mona Lisa for his ability to draw large, fawning crowds.  —  President Joe Biden on Saturday said the 2024 presidential race was “the weirdest campaign I've ever been engaged in” … ",
    "url": "https://www.thedailybeast.com/biden-says-this-is-the-weirdest-campaign-ever-as-trump-claims-hes-an-elvis-lookalike"
  },
  {
    "text": "Biden wins South Carolina primary  —  The president cruises to victory in the Dems' first sanctioned contest.  —  COLUMBIA, South Carolina — President Joe Biden cruised to victory in the first sanctioned presidential primary Saturday night.  —  Biden easily beat out nominal challenges … ",
    "url": "https://www.politico.com/news/2024/02/03/biden-wins-south-carolina-primary-00139479"
  },
  {
    "text": "The Polling ‘Disaster’ That's Starting To Terrify Team Trump  —  Polls show a criminal conviction could torpedo Donald Trump's chances in 2024 — and some of his close advisers are telling him to take it seriously  —  IN THE MIDDLE of last year, several of Donald Trump's closest advisers … ",
    "url": "https://www.rollingstone.com/politics/politics-features/polling-disaster-terrify-team-trump-criminal-1234959962/"
  },
  {
    "text": "Biden brings home first official win in South Carolina primary  —  President Biden won the Democratic primary in South Carolina on Saturday, notching a decisive victory in his party's first official nominating contest.  —  The Associated Press called the race shortly after polls closed Saturday night.",
    "url": "https://www.washingtonpost.com/politics/2024/02/03/biden-south-carolina-primary/"
  },
  {
    "text": "Biden easily wins first official Democratic primary in South Carolina  —  President Biden was projected to handily win the South Carolina Democratic primary on Saturday after betting big on the state, according to Decision Desk HQ.  —  His win comes after Biden backed the unprecedented move … ",
    "url": "https://thehill.com/homenews/campaign/4442861-joe-biden-south-carolina-democratic-primary-donald-trump/"
  },
  {
    "text": "Biden will win South Carolina Democratic primary, earning his first delegates of 2024, CNN projects  —  South Carolina, the state that launched Joe Biden to the Democratic nomination four years ago, will deliver the president his first official primary victory of the 2024 campaign on Saturday, CNN projects.",
    "url": "https://www.cnn.com/2024/02/03/politics/south-carolina-democratic-primary-biden/"
  },
  {
    "text": "US, Britain strike Yemen's Houthis in a new wave, retaliating for attacks by Iran-backed militants  —  The United States and Britain struck 36 Houthi targets in Yemen on Saturday in a second wave of assaults meant to further disable Iran-backed groups that have relentlessly attacked American … ",
    "url": "https://apnews.com/article/iraq-iran-syria-jordan-strikes-us-2f235ac0d00edc266576ef0d76fa33e4"
  },
  {
    "text": "Kinzinger blasts Republican efforts to link border security with Ukraine funding: ‘The whole party has become a joke’  — Former GOP Rep. Adam Kinzinger blasted the GOP for its attempt to tie Ukraine aid to border security.  — “It's not a serious party,” the former congressman told CNN's Christiane Amanpour.",
    "url": "https://www.businessinsider.com/kinzinger-gop-border-security-immigration-ukraine-funding-joke-2024-2"
  },
  {
    "text": "House GOP plans new Israel package in blow to Senate talks  —  The House will vote next week on a new $17.6 billion Israel aid package that excludes the IRS cuts in their original bill, Speaker Mike Johnson (R-La.) said Saturday. … - The new House bill, which includes $3.3 billion … ",
    "url": "https://www.axios.com/2024/02/03/house-republicans-israel-aid-mike-johnson-senate"
  },
  {
    "text": "Trump's team worries about a hollow victory in Nevada  —  Donald Trump is virtually assured of winning all 26 of the delegates available in Nevada's GOP caucuses Thursday, but his team is worried that the state's plan to hold a primary two days before the caucuses could wind up embarrassing the former president.",
    "url": "https://www.axios.com/2024/02/04/trump-team-worries-hollow-victory-nevada"
  },
  {
    "text": "Nikki Haley Tries to Keep South Carolina From Ending Her Campaign  —  Former governor faces high expectations in her home state and the need to cut into deep-rooted support for Donald Trump  —  COLUMBIA, S.C.—When Nikki Haley announced her presidential bid almost a year ago … ",
    "url": "https://www.wsj.com/politics/elections/nikki-haley-tries-to-keep-south-carolina-from-ending-her-campaign-422b572e?mod=followamazon"
  },
  {
    "text": "Moms for Liberty faces new challenges and growing pushback over its conservative education agenda  —  In Florida, where the right-wing Moms for Liberty group was born in response to Covid-19 school closures and mask mandates, the first Brevard County School Board meeting of the new year considered whether … ",
    "url": "https://www.cnn.com/2024/02/03/us/moms-for-liberty-scandal-opposition/"
  },
  {
    "text": "Mike Gill, former Trump official, dies days after being shot in DMV carjacking spree  —  WASHINGTON - Mike Gill, a married father of three who was also a member of former President Donald Trump's administration, has died.  He was shot during a deadly carjacking rampage in Washington, D.C. last Monday night.",
    "url": "https://www.fox5dc.com/news/mike-gill-former-trump-official-dies-days-after-being-shot-in-dmv-carjacking-spree"
  },
  {
    "text": "Can Trump be on the ballot?  It's the Supreme Court's biggest election test since Bush v. Gore  —  WASHINGTON (AP) — A case with the potential to disrupt Donald Trump's drive to return to the White House is putting the Supreme Court uncomfortably at the center of the 2024 presidential campaign.",
    "url": "https://apnews.com/article/supreme-court-trump-insurrection-2024-election-45728c8a2f1e863ed94e14891aea5d47"
  }
]