[
  {
    "text": "The Only Sin That Republicans Can't Forgive  —  The fall of House Speaker Kevin McCarthy today demonstrated again that the one sin that cannot be forgiven in the modern Republican Party is being seen as failing to fight the Democratic agenda by any means necessary.",
    "url": "https://www.theatlantic.com/politics/archive/2023/10/the-only-sin-that-republicans-cant-forgive/675534/"
  },
  {
    "text": "Republicans must expel Matt Gaetz  —  Newt Gingrich, a Republican from Georgia, was speaker of the House of Representatives from 1995 to 1999.  —  Rep. Matt Gaetz (R-Fla.) is an anti-Republican who has become actively destructive to the conservative movement.  —  Drama has filled the halls of Congress for 234 years.",
    "url": "https://www.washingtonpost.com/opinions/2023/10/03/newt-gingrich-matt-gaetz-remove/"
  },
  {
    "text": "Playbook: The House GOP's fight may have just begun  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  JUST POSTED — “Giuliani's Drinking, Long a Fraught Subject, Has Trump Prosecutors' Attention,” by NYT's Matt Flegenheimer and Maggie Haberman: “[RUDY] … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/04/the-house-gops-fight-may-have-just-begun-00119856"
  },
  {
    "text": "The House GOP Is a Failed State  —  Kevin McCarthy's ouster is dramatic evidence, if redundant, about the state of the modern GOP.  —  At the start, Kevin McCarthy's speakership was effectively an optical illusion.  At the end, it was an exercise in self-abasement.  Francis Chung/POLITICO",
    "url": "https://www.politico.com/news/magazine/2023/10/03/house-gop-failed-state-00119842"
  },
  {
    "text": "GOP tensions explode after McCarthy bows out of speaker race  —  House Republicans were distraught, furious and concerned for the future of their party after Rep. Kevin McCarthy (R-Calif.) announced he won't run for speaker again after being ousted on Tuesday.",
    "url": "https://www.axios.com/2023/10/04/house-republicans-kevin-mccarthy-removal-speaker"
  },
  {
    "text": "House Is Paralyzed, With No Speaker After McCarthy Ouster  —  After a historic vote to remove the speaker, lawmakers departed Washington on Tuesday night with the House of Representatives in chaos and no clear sense of who might lead it.  —  The House of Representatives was in a state … ",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/house-speaker-mccarthy.html"
  },
  {
    "text": "Senate Republicans watch McCarthy ouster with alarm, disbelief  —  Senate Republicans are watching the rebellion against Speaker Kevin McCarthy (R-Calif.) in the House with serious alarm and are concerned over what the chaos will mean for the GOP's brand in the 2024 election.",
    "url": "https://thehill.com/homenews/senate/4236826-senate-republicans-watch-mccarthy-ouster-with-alarm-disbelief/"
  },
  {
    "text": "Texas Republican will nominate Trump for Speaker of the House  —  Rep. Troy Nehls (R-Texas) announced late Tuesday he will file paperwork to nominate former President Trump to be the next Speaker of the House.  —  “This week, when the U.S. House of Representatives reconvenes … ",
    "url": "https://thehill.com/homenews/house/4237172-texas-republican-will-nominate-trump-for-speaker-of-the-house/"
  },
  {
    "text": "The rudderless GOP careens toward 2024  —  Kevin McCarthy's undoing underscores a bigger problem — the inability to govern itself — that risks imperiling the party's chances in 2024.  —  There's no House speaker, Republicans are tearing each other to shreds over Kevin McCarthy's ouster … ",
    "url": "https://www.politico.com/news/2023/10/04/republican-party-mccarthy-2024-00119802"
  },
  {
    "text": "Judge Kicks Reporters Out of Courtroom to Talk to Trump and AG  —  Justice Arthur F. Engoron also issued a gag order against Trump earlier in the day after the former president attacked one of his law clerks on social media.  —  A turbulent second day at Donald Trump's bank fraud trial … ",
    "url": "https://www.thedailybeast.com/judge-kicks-reporters-out-of-courtroom-to-talk-to-trump-and-ag"
  },
  {
    "text": "Trump Ordered Not to Comment on Judge's Staff in Fraud Case  —  The former president attacked Justice Arthur F. Engoron's clerk in a social media post that soon disappeared.  He was called to account behind closed doors.  —  A New York judge placed a limited gag order on Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/10/03/nyregion/trump-gag-order-fraud-trial.html"
  },
  {
    "text": "Trump Posts (Then Deletes) Attack Against Judge's Clerk During Trial  —  The former president is attending his New York civil fraud trial in person, ranting at cameras and on social media in between courtroom sessions … Trump last week was found guilty of committing fraud in the case … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-attacks-judge-engoron-clerk-new-york-fraud-trial-1234838462/"
  },
  {
    "text": "McHenry ordered Pelosi to leave her Capitol hideaway office by Wednesday  —  The former speaker blasted the move as a “sharp departure from tradition.”",
    "url": "https://www.politico.com/live-updates/2023/10/03/congress/mchenry-pelosi-hideaway-office-house-remove-00119803"
  },
  {
    "text": "Fulton prosecutors float plea deals to Trump defendants  —  First guilty plea in RICO case came Friday  —  Fulton County prosecutors are floating plea deals to a number of defendants in the election interference case involving former President Donald Trump, according to people with knowledge of the proposals.",
    "url": "https://www.ajc.com/politics/fulton-prosecutors-float-plea-deals-to-trump-defendants/76Q5JTJHXVHHFPVYEW6YWORZO4/"
  },
  {
    "text": "Leonard Leo says he will not cooperate with D.C. Attorney General tax probe  —  A liberal group targeted by a similar tax probe said it would comply.  —  Judicial activist Leonard Leo is not cooperating with an investigation by Washington D.C. Attorney General Brian Schwalb … ",
    "url": "https://www.politico.com/news/2023/10/03/brian-schwalb-arabella-investors-00119751"
  },
  {
    "text": "Payday Lenders Get Their Asses Handed To Them During Anti-CFPB Supreme Court Arguments  —  The case to dismantle the CFPB ran into a hammer from the three liberal justices and marked skepticism from at least two of the conservatives.  —  LOADING  —  The case seeking to eviscerate … ",
    "url": "https://www.huffpost.com/entry/cfpb-supreme-court_n_651c6a8fe4b0521d323733ee"
  },
  {
    "text": "Giuliani's Drinking, Long a Fraught Subject, Has Trump Prosecutors' Attention  —  The former mayor's drinking has become an investigative subplot in Donald Trump's federal case over 2020 election interference.  But long before that, friends had grown deeply concerned.",
    "url": "https://www.nytimes.com/2023/10/04/us/politics/rudy-giuliani-drinking.html"
  },
  {
    "text": "Drugmakers agree to negotiate drug prices with government, White House says  —  The manufacturers of 10 prescription drugs — including Eliquis, Xarelto and Januvia — will take part in the negotiations.  —  Major drug companies including Johnson & Johnson, Merck and Bristol Myers Squibb … ",
    "url": "https://www.nbcnews.com/health/health-news/medicare-drug-costs-drugmakers-agree-price-negotiations-biden-administ-rcna118510"
  }
]