[
  {
    "text": "McConnell will step down as the Senate Republican leader in November after a record run in the job  —  Mitch McConnell, the longest-serving Senate leader in history who maintained his power in the face of dramatic convulsions in the Republican Party for almost two decades, will step down from that position in November.",
    "url": "https://apnews.com/article/mitch-mcconnell-senate-republican-leader-stepping-down-ba478d570a4561aa7baf91a204d7e366"
  },
  {
    "text": "McConnell to step down from Senate leadership in November  —  ‘I have many faults.  Misunderstanding politics is not one of them,’ McConnell said in a speech on the Senate floor Wednesday  —  Senate Minority Leader Mitch McConnell (R-Ky.) plans to step down from his leadership position in November … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/28/mcconnell-senate-november/"
  },
  {
    "text": "Trump tried to ignore Haley.  He barely lasted a day.  —  The former president was back to his old ways in no time.  —  For a full 24 hours on Saturday, Donald Trump did not mention Nikki Haley by name, ignoring her both in a freewheeling address to the Conservative Political Action Conference … ",
    "url": "https://www.politico.com/news/2024/02/28/trump-nikki-haley-attacks-00143710"
  },
  {
    "text": "Michigan Primary Takeaways: ‘Uncommitted’ Makes Itself Heard  —  President Biden endured a protest vote, Donald Trump fended off Nikki Haley again, and both may face challenges with their party coalitions as they start to look toward November.  —  Joseph R. Biden Jr. and Donald J. Trump won … ",
    "url": "https://www.nytimes.com/2024/02/28/us/politics/michigan-primary-biden-trump.html"
  },
  {
    "text": "Lauren Boebert's son was arrested over a spate of thefts as his mom tries to convince voters to look past her chaotic family life  — Lauren Boebert's son Tyler Boebert was arrested on Tuesday afternoon.  — He's facing 22 charges in connection with a series of crimes in Rifle, Colorado.",
    "url": "https://www.businessinsider.com/lauren-boebert-son-tyler-arrested-family-drama-2024-republican-campaign-2024-2"
  },
  {
    "text": "Lauren Boebert's son arrested, faces 22 charges  —  GRAND JUNCTION, Colo. (KJCT) - Lauren Boebert's 18-year-old son was arrested in Garfield County February 27, 2024, and faces 22 charges.  —  According to the Rifle Police Department's Facebook page Tyler Boebert was arrested at around 2:30 in the afternoon.",
    "url": "https://www.kjct8.com/2024/02/28/lauren-boeberts-son-arrested-faces-22-charges/"
  },
  {
    "text": "Judge in Trump civil fraud case sent envelope with white powder, source says  —  The envelope never made it to Judge Arthur Engoron, but caused an emergency response at the courthouse.  —  A letter with white powder was sent Wednesday to the judge who handed down a $350 million verdict … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-trump-civil-fraud-case-sent-envelope-white-powder-officials-say-rcna140938"
  },
  {
    "text": "‘Star witness’ testifies his claims about Fani Willis were only ‘speculation’  —  ATLANTA — A lawyer billed as the “star witness” in the case to disqualify Fulton County District Attorney Fani T. Willis (D) testified Tuesday that it was mere “speculation” when he told a defense attorney … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/27/fani-willis-nathan-wade-trump-georgia-hearing/"
  },
  {
    "text": "They're coming for birth control next  —  Banning IVF is a natural result of anti-choice zealots running the GOP, and they won't stop there. … Earlier this month, the Alabama Supreme Court issued an opinion, complete with a wildly theocratic concurrence from Chief Justice Thomas Parker … ",
    "url": "https://www.publicnotice.co/p/alabama-ivf-ban-explained"
  },
  {
    "text": "Hunter Biden testifies that he never involved his father in business  —  President's son opens with a defiant statement accusing Republicans of “partisan house of cards” built on “lies”  —  Hunter Biden testified on Wednesday that he never involved his father, President Biden … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/28/hunter-biden-accuses-house-republicans-innuendo-lies/"
  },
  {
    "text": "How Panera Bread ducked California's new $20 minimum wage law  —  Billionaire Greg Flynn, who made his fortune running one of the world's largest restaurant franchise operations, is getting a new boost from sourdough loaves and brioche buns.  —  That's because a California law that's … ",
    "url": "https://www.mercurynews.com/2024/02/28/how-panera-bread-ducked-californias-new-20-minimum-wage-law/"
  },
  {
    "text": "Frozen embryos shouldn't be considered people, two-thirds of Americans say  —  Two-thirds of Americans oppose considering frozen embryos as people, with the issue rapidly resonating with Democrats already charged up by election-year messaging on reproductive rights, a new Axios-Ipsos poll finds.",
    "url": "https://www.axios.com/2024/02/28/alabama-ivf-ruling-poll-ipsos"
  },
  {
    "text": "Exxon CEO blames public for failure to fix climate change  —  The world isn't on track to meet its climate goals — and it's the public's fault, a leading oil company CEO told journalists.  —  Exxon CEO Darren Woods told editors from Fortune that the world has “waited too long” … ",
    "url": "https://thehill.com/policy/energy-environment/4494543-exxon-ceo-blames-public-for-failure-to-fix-climate-change/"
  },
  {
    "text": "Biden to issue executive order aimed at protecting Americans' sensitive data from China and other ‘hostile countries’  —  The measure targets the business of selling people's personal information, which the White House said could be used “to track Americans (including military service members) … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-issue-executive-order-aimed-protecting-americans-sensitive-data-rcna140869"
  },
  {
    "text": "Google CEO calls AI tool's controversial responses ‘completely unacceptable’  —  The Scoop  —  Google CEO Sundar Pichai addressed the company's Gemini controversy Tuesday evening, calling the AI app's problematic responses around race unacceptable and vowing to make structural changes to fix the problem.",
    "url": "https://www.semafor.com/article/02/27/2024/google-ceo-sundar-pichai-calls-ai-tools-responses-completely-unacceptable"
  },
  {
    "text": "Poll: Most Americans cool to Christian nationalism as its influence grows … - This once-fringe ideology has become prevalent in some deeply red states at a time when the nation overall is increasingly diverse and less religious. … - In California, New York and Virginia … ",
    "url": "https://www.axios.com/2024/02/28/poll-christian-nationalism-americans-reject"
  },
  {
    "text": "Leaked Russian military files reveal criteria for nuclear strike  —  Doctrine for tactical nuclear weapons outlined in training scenarios for an invasion by China  —  Vladimir Putin's forces have rehearsed using tactical nuclear weapons at an early stage of conflict with a major world power … ",
    "url": "https://www.ft.com/content/f18e6e1f-5c3d-4554-aee5-50a730b306b7"
  },
  {
    "text": "How the Senate G.O.P. Scored a Top Recruit and Widened Its Path to a Majority  —  The recruitment of Larry Hogan in Maryland served as a capstone to months of quiet success for Senate Republicans, after years of recruiting disappointments.  —  Larry Hogan might not be running for Senate … ",
    "url": "https://www.nytimes.com/2024/02/28/us/politics/gop-senate-recruitment-hogan.html"
  },
  {
    "text": "Williamson ‘unsuspending’ presidential campaign  —  Author Marianne Williamson announced Wednesday that she is “unsuspending” her presidential campaign, claiming American voters are “watching a car crash in slow motion” with the current candidates.  —  “Hey, I have an important announcement to make.",
    "url": "https://thehill.com/homenews/campaign/4493677-williamson-unsuspending-presidential-campaign/"
  }
]