[
  {
    "text": "Republican National Committee plans to soon consider declaring Trump the ‘presumptive 2024 nominee’  —  COLUMBIA, S.C. (AP) — The Republican National Committee is expected to consider a resolution next week to declare Donald Trump the party's “presumptive 2024 nominee,” … ",
    "url": "https://apnews.com/article/rnc-trump-presumptive-nominee-haley-2024-campaign-74c529ab8d3804622276f8e197cd3a5c"
  },
  {
    "text": "GOP senators seethe as Trump blows up delicate immigration compromise  —  Senior Senate Republicans are furious that Donald Trump may have killed an emerging bipartisan deal over the southern border, depriving them of a key legislative achievement on a pressing national priority and offering … ",
    "url": "https://www.cnn.com/2024/01/25/politics/gop-senators-angry-trump-immigration-deal/"
  },
  {
    "text": "Biden is green-lighting border chaos  —  The border has been increasingly lawless since President Joe Biden took office.  Texas isn't getting any help from the Supreme Court either.  —  Monday, the Supreme Court released an opinion that temporarily backed the Biden administration … ",
    "url": "https://www.washingtonexaminer.com/opinion/2819952/biden-is-green-lighting-border-chaos/"
  },
  {
    "text": "Border standoff between Texas, feds intensifies as governor defies Supreme Court ruling  —  This week, the Supreme Court sided with federal agents to remove razor wire put in place by Texas along the Rio Grande.  The state is using wire and state agents to block Border Patrol from accessing a section of the border in Eagle Pass.",
    "url": "https://www.pbs.org/newshour/show/border-standoff-between-texas-feds-intensifies-as-governor-defies-supreme-court-ruling"
  },
  {
    "text": "Feds to Dispatch More Resources to Fight Washington's Violent-Crime Surge  —  Justice Department says FBI-led effort aims to curb homicides and carjackings, which are rising in D.C. as they drop in other U.S. cities  —  WASHINGTON—The Justice Department will commit more federal prosecutors … ",
    "url": "https://www.wsj.com/us-news/feds-to-dispatch-more-resources-to-fight-washingtons-violent-crime-surge-772ee754?mod=followamazon"
  },
  {
    "text": "Missouri GOP Lawmaker Floats Rule Change to Bring Back Duels  —  A senator could challenge another to mortal combat if the first's “honor is impugned.”  —  Bitter divisions between Republicans in the Missouri Senate culminated in a proposed rule change that would allow senators to settle … ",
    "url": "https://www.thedailybeast.com/missouri-gop-lawmaker-floats-rule-change-to-bring-back-duels"
  },
  {
    "text": "The Story of the Decade  —  New documents strengthen—perhaps conclusively—the lab-leak hypothesis of Covid-19's origins.  —  / Health Care  —  / Eye on the News / Health Care  —  The day is growing ever closer when Washington may have to add to its agenda with Beijing a nettlesome item … ",
    "url": "https://www.city-journal.org/article/new-documents-bolster-lab-leak-hypothesis"
  },
  {
    "text": "Statement from President Joe Biden on Decision to Pause Pending Approvals of Liquefied Natural Gas Exports  —  In every corner of the country and the world, people are suffering the devastating toll of climate change.  Historic hurricanes and floods wiping out homes, businesses, and houses of worship.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/26/statement-from-president-joe-biden-on-decision-to-pause-pending-approvals-of-liquefied-natural-gas-exports/"
  },
  {
    "text": "Texas senator who voted to acquit Paxton calls to reopen impeachment trial  —  In a court filing last week, Texas Attorney General Ken Paxton's office said they would not contest accusations he violated the Whistleblower Act  —  Texas Sen. Drew Springer (R-Muenster) wrote a letter … ",
    "url": "https://www.nbcdfw.com/news/politics/lone-star-politics/texas-senator-who-voted-to-acquit-paxton-calls-to-reopen-impeachment-trial/3444726/"
  },
  {
    "text": "Meet the Texas Billionaire Quietly Becoming the New George Soros  —  John Arnold has spent nearly $50 million on progressive criminal justice reforms  —  A Texas billionaire is on track to replace George Soros as the largest donor in the fight to remake America's criminal justice system.",
    "url": "https://freebeacon.com/democrats/meet-the-texas-billionaire-quietly-becoming-the-new-george-soros/"
  },
  {
    "text": "Fed's Preferred Core Price Gauge Cools Amid Robust Spending  — Core PCE index eased to 2.9% last month, lowest since 2021  — Spending posted biggest back-to-back increase in nearly a year  —  The Federal Reserve's preferred gauge of underlying inflation cooled to an almost three-year low … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-26/fed-s-preferred-core-inflation-gauge-slows-to-below-3-rate"
  },
  {
    "text": "Matt Gaetz Privately Told Colleagues His Real Motivation for Kevin McCarthy Ouster Was Ethics Probe  —  In private communications reviewed by The Daily Beast, Matt Gaetz indicated his vendetta against Kevin McCarthy was rooted in the Ethics Committee investigation against Gaetz.",
    "url": "https://www.thedailybeast.com/matt-gaetz-privately-told-colleagues-his-real-motivation-for-mccarthy-ouster-was-ethics-probe"
  },
  {
    "text": "Widening Mideast Crisis: U.N. Court Orders Israel to Prevent Genocide, but Does Not Demand Stop to War  —  U.N. Court Orders Israel to Prevent Genocide, but Does Not Demand Stop to War  —  The International Court of Justice ruled that Israel must prevent any genocidal acts by its forces, and must let more aid in to Gaza.",
    "url": "https://www.nytimes.com/live/2024/01/26/world/israel-hamas-gaza-news"
  },
  {
    "text": "Exclusive: Musk brain implant company violated US hazardous material transport rules -documents  —  Elon Musk's brain-implant company Neuralink was fined for violating U.S. Department of Transportation (DOT) rules regarding the movement of hazardous materials, according to records from the federal agency reviewed by Reuters.",
    "url": "https://www.reuters.com/technology/musk-brain-implant-company-violated-us-hazardous-material-transport-rules-2024-01-26/"
  },
  {
    "text": "Scoop: Biden tells Bibi he's not in it for a year of war in Gaza  —  President Biden last week pressed Israeli Prime Minister Benjamin Netanyahu to scale down the Israeli military operation in Gaza, stressing he is not in it for a year of war, two U.S. officials told Axios.",
    "url": "https://www.axios.com/2024/01/26/biden-netanyahu-israel-hamas-war-gaza-timetable"
  },
  {
    "text": "House members tell Biden he must seek authorization for Yemen strikes  —  Bipartisan group argues that the administration is violating the Constitution by hitting the Houthis without congressional approval  —  A bipartisan group of more than two dozen House lawmakers plans to send a letter … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/26/congress-biden-houthis-war-powers/"
  },
  {
    "text": "Leading Museums Remove Native Displays Amid New Federal Rules  —  The American Museum of Natural History is closing two major halls as museums around the nation respond to updated policies from the Biden administration.  —  The American Museum of Natural History will close … ",
    "url": "https://www.nytimes.com/2024/01/26/arts/design/american-museum-of-natural-history-nagpra.html"
  },
  {
    "text": "EU threatens to silence Hungary if it blocks Ukrainian funds  —  BRUSSELS — There's a Hungarian saying for when things are not going well: “It is under the frog's ass.”  —  And things sure won't go well for Hungary if it attempts to thwart European leaders when they meet next week to approve … ",
    "url": "https://www.politico.eu/article/eu-threatens-silence-hungary-orban-if-blocks-ukrainian-aid-funds-article-7/"
  },
  {
    "text": "‘Preposterous’: Federal judge decries efforts to downplay Jan. 6 violence, label perpetrators ‘hostages’  —  Judge Royce Lamberth, who has handled dozens of Jan. 6 cases, lamented the false rhetoric spread by Donald Trump and his allies.  —  The longest-serving district judge on the federal bench … ",
    "url": "https://www.politico.com/news/2024/01/25/judge-lamberth-jan-6-trump-00137960"
  }
]