[
  {
    "text": "Illinois shut out of Medicaid after Trump administration halts federal grants and loans  —  The Trump administration's federal freeze has shut Illinois out of Medicaid, according to Gov. JB Pritzker's office.  The government-funded health insurance program covered about 3.9 million people … ",
    "url": "https://chicago.suntimes.com/politics/donald-trump/2025/01/28/illinois-medicaid-federal-funding-freeze-trump-administration"
  },
  {
    "text": "White House says Medicaid portal ‘will be back online shortly’ after Trump funding freeze blamed … Medicaid reimbursement portals were down Tuesday in every U.S. state on the heels of a funding freeze ordered by the Trump administration of federal grants and loans, Sen. Ron Wyden said.",
    "url": "https://www.cnbc.com/2025/01/28/trump-funding-freeze-medicaid-state-portals-omb.html"
  },
  {
    "text": "As some Medicaid sites freeze up, White House acts to clarify pause on grants and programs  —  Payments system appears to be an issue after budget office issued broadly worded memo  —  WASHINGTON — A memo from the White House budget office indicates that Medicaid payments should not be affected … ",
    "url": "https://www.statnews.com/2025/01/28/federal-grant-pause-disrupts-medicaid-trump-freeze-executive-order/"
  },
  {
    "text": "120. The Impoundment Crisis of 2025  —  The Trump administration's Monday spending freeze is likely to provoke a crisis over the constitutionality of “impoundment”—one that the justices could well have to resolve *very* soon.  —  Welcome back to “One First,” a weekly newsletter that aims … ",
    "url": "https://www.stevevladeck.com/p/120-the-impoundment-crisis-of-2025"
  },
  {
    "text": "White House pauses all federal grants, sparking confusion  —  Trillions of dollars could be on hold, according to an Office of Management and Budget memo.  —  The White House budget office is ordering a pause to all grants and loans disbursed by the federal government … ",
    "url": "https://www.washingtonpost.com/business/2025/01/27/white-house-pauses-federal-grants/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3OTU0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MzM2Mzk5LCJpYXQiOjE3Mzc5NTQwMDAsImp0aSI6ImZlYzlhZTI3LTQ5ODUtNGNiYi04ZWEyLWNjNWE3YWE5NDE4MiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzI3L3doaXRlLWhvdXNlLXBhdXNlcy1mZWRlcmFsLWdyYW50cy8ifQ.OH6OKaNolVYueeEJz2SzVWQBrgB372ZHhXvCMTAU0zU"
  },
  {
    "text": "All federal grants and loan disbursement paused by White House  —  The White House budget office has ordered a pause on all federal grants and loans, according to an internal memorandum sent Monday, potentially impacting trillions in government spending and halting public programs that affect millions of Americans.",
    "url": "https://www.cnn.com/2025/01/27/politics/white-house-pauses-federal-grants-loan-disbursement/"
  },
  {
    "text": "Non-profits, health groups sue over Trump's freeze on grants, loans  —  Four groups representing non-profits, public health professionals and small businesses filed a lawsuit on Tuesday challenging U.S. President Donald Trump administration's sweeping directive to temporarily freeze federal loans, grants and other financial assistance.",
    "url": "https://www.reuters.com/legal/non-profits-health-groups-sue-over-trumps-freeze-grants-loans-2025-01-28/"
  },
  {
    "text": "Caroline Kennedy warns senators of ‘predator’ RFK Jr. in searing letter  —  In a letter to lawmakers, the former U.S. ambassador to Australia and cousin of Trump's HHS nominee, questions Robert F. Kennedy's ethics and views on vaccines.  —  Caroline Kennedy on Tuesday warned senators … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/28/kennedy-lettor-rfk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4MDQwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5NDIyNzk5LCJpYXQiOjE3MzgwNDA0MDAsImp0aSI6ImZhNmJjNWE5LTg3OTEtNDQyZC1hMGU3LTUxZmJhMDIyY2UzZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzI4L2tlbm5lZHktbGV0dG9yLXJmay8ifQ.fW4r9jt8DqylCfb5j_rzlwhNhNQfMJ2GaIAA7wUH7mU"
  },
  {
    "text": "Democrats' playbook for Trump 2.0: Tune out the noise and focus on economic issues  —  As Trump floods the zone in his first week in office, Democrats are departing from their “resistance” strategy in his first term and zeroing in on issues that cost them the last election.",
    "url": "https://www.nbcnews.com/politics/congress/democrats-playbook-trump-tune-noise-focus-economic-issues-rcna189180"
  },
  {
    "text": "Senate Democrats block GOP's ICC sanctions bill  —  Senate Democrats on Tuesday blocked Republicans from advancing legislation to sanction the International Criminal Court, arguing the bill had sweeping consequences on allies and American businesses.  —  Republicans failed to get the 60 votes needed … ",
    "url": "https://thehill.com/homenews/senate/5111458-senate-democrats-block-icc-sanctions-bill/"
  },
  {
    "text": "Democrats declare ‘constitutional crisis’ on funding freeze  —  Senate Democrats vowed to fight a White House freeze on federal financial assistance, calling for a delay in the confirmation of President Donald Trump's nominee for White House budget chief, threatening potential court actions … ",
    "url": "https://www.politico.com/live-updates/2025/01/28/congress/schumer-murray-funding-freeze-00200955"
  },
  {
    "text": "Michigan's Gary Peters won't seek reelection to U.S. Senate.  Here's why  —  Washington ― Gary Peters, Michigan's senior senator and a former congressman, said he won't seek reelection next year and will retire from the U.S. Senate when his second term ends in January 2027.",
    "url": "https://www.detroitnews.com/story/news/politics/2025/01/28/michigan-democratic-senator-gary-peters-will-not-run-for-reelection-to-us-senate-seat-2026/77985876007/"
  },
  {
    "text": "Scoop: Pete Buttigieg taking “serious look” at Michigan Senate race in 2026 … - “Pete is exploring all of his options on how he can be helpful and continue to serve,” said a person close to Buttigieg.  — “He's honored to be mentioned for this and he's taking a serious look.”",
    "url": "https://www.axios.com/2025/01/28/pete-buttigieg-michigan-senate"
  },
  {
    "text": "Trump Ousts Top Labor Board Leaders Who Backed Broader Worker Rights  —  Jennifer Abruzzo says she was fired by email late on Monday  —  Donald Trump is forcing out top leaders of the US labor board, ushering in a swift reboot of workplace law enforcement while testing the limits of presidential authority.",
    "url": "https://www.bloomberg.com/news/articles/2025-01-28/trump-fires-nlrb-general-counsel-jennifer-abruzzo?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczODA0NDU3MywiZXhwIjoxNzM4NjQ5MzczLCJhcnRpY2xlSWQiOiJTUVNCTTlUMEcxS1cwMCIsImJjb25uZWN0SWQiOiJDQThGQ0Y4NkY1QjY0ODlCODA4ODkwNTFBNjMxRERBRCJ9.X3-2wWPj_m7Ef39_-TnjwoHOki3vNE5WcSUjtT-97gs&leadSource=uverify%20wall"
  },
  {
    "text": "Live Updates: White House Defends Trump's Funding Freeze as Opponents Rush to Block It  —  Where Things Stand  — Federal aid pause: The White House budget office ordered a pause in grants, loans and other federal financial assistance, a sweeping move it said was necessary to bring … ",
    "url": "https://www.nytimes.com/live/2025/01/28/us/trump-news-executive-orders"
  },
  {
    "text": "France floated sending troops to Greenland, foreign minister says  —  The comments came as Denmark's prime minister travels to Berlin, Paris and Brussels to shore up support from allies.  —  PARIS — France has discussed with Denmark sending troops to Greenland in response … ",
    "url": "https://www.politico.eu/article/france-fm-jean-noel-barrot-floats-sending-troops-to-greenland-denmark/"
  },
  {
    "text": "Republican congressman suggests some children receiving free school lunches should work at McDonald's instead  —  Rep. Rich McCormick said that the freeze on federal aid would allow the government to review all programs including ones that provide free school lunches to low-income children.",
    "url": "https://www.nbcnews.com/politics/congress/republican-congressman-suggests-children-receiving-free-school-lunches-rcna189614"
  },
  {
    "text": "Departing the New York Times  —  As many people reading this know, last month I retired from my position as an opinion writer at the New York Times—a job I had done for 25 years.  Despite the encomiums issued by the Times, it was not a happy departure.  If you check out my Substack … ",
    "url": "https://contrarian.substack.com/p/departing-the-new-york-times"
  },
  {
    "text": "Social media dumbfounded as Jim Acosta quits on air — yet ‘CNN rewards Scott Jennings’  —  Social media erupted Tuesday with users shocked and upset with CNN's decision to let anchor Jim Acosta go — while keeping conservative commentator Scott Jennings.  —  The ruckus started … ",
    "url": "https://www.rawstory.com/acosta-leaves-cnn/"
  },
  {
    "text": "The Largest Tuberculosis Outbreak in U.S. History Is Happening Right Now in Kansas  —  And the news comes as the Trump administration has “paused” all public messaging by the CDC.  —  I always thought I'd missed a lot not having been born in the 19th century.  From The Topeka Capital-Journal:",
    "url": "https://www.esquire.com/news-politics/politics/a63577552/kansas-tuberculosis-outbreak-america/"
  },
  {
    "text": "Trump Hit With New Lawsuit for Funneling Sensitive Info to Elon Musk  —  Donald Trump's administration has been hit with a lawsuit over allegedly collecting federal employee information and directing it to an employee of Elon Musk.  —  The lawsuit, filed in the U.S. District Court … ",
    "url": "https://newrepublic.com/post/190784/trump-lawsuit-funneling-info-federal-workers-elon-musk"
  },
  {
    "text": "Man charged with carrying Molotov cocktails into the Capitol was targeting Johnson, Hegseth, Bessent  —  A man who was arrested Monday after allegedly bringing Molotov cocktails to the Capitol told police that he intended to kill Speaker Mike Johnson, Pete Hegseth and Scott Bessent, federal prosecutors said in court filings.",
    "url": "https://www.politico.com/live-updates/2025/01/28/congress/johnson-hegseth-bessent-targeted-00200992"
  },
  {
    "text": "The Strategy Behind Trump's Policy Blitz  —  The staff was still setting up dinner on Mar-a-Lago's outdoor patio on a balmy early-January evening when Donald Trump sat down.  He was surrounded by several top advisers who would soon join him in the West Wing and who wanted to get his input … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/01/trump-executive-actions-week-one/681486/"
  }
]