[
  {
    "text": "Steve Scalise is the GOP's next pick for speaker  —  The Louisiana Republican defeated Judiciary Chair Jim Jordan in a secret-ballot vote on Wednesday.",
    "url": "https://www.politico.com/live-updates/2023/10/11/congress/scalise-gop-speaker-majority-house-00120940"
  },
  {
    "text": "Scalise secures GOP Speaker nomination  —  House Republicans on Wednesday nominated Majority Leader Steve Scalise (R-La.) to be the next Speaker, sending his candidacy to the House floor following Rep. Kevin McCarthy's (R-Calif.) stunning ouster last week, multiple lawmakers told The Hill.",
    "url": "https://thehill.com/homenews/house/4250062-steve-scalise-wins-gop-speaker-nomination/"
  },
  {
    "text": "‘We have 8 people who are insane’: Republican inside speaker vote bashes colleagues  —  WASHINGTON — Republicans are behind closed doors Wednesday trying to figure out how to get to electing a new Speaker of the House so they can navigate the impending demands of the war in Israel and a possible government shutdown.",
    "url": "https://www.rawstory.com/raw-investigates/inane-people-house-speaker/"
  },
  {
    "text": "House Speaker Election  —  The choice is a vote of confidence for the party's No. 2 House leader, but the rifts in his conference could still make for a chaotic election in the full chamber.  —  Here's the latest on the speaker nomination.  —  Republicans narrowly nominated Representative Steve Scalise … ",
    "url": "https://www.nytimes.com/live/2023/10/11/us/house-speaker-vote-news"
  },
  {
    "text": "10/11/23 ☀️ Punchbowl News AM  —  Today is a huge day for House Republicans.  They'll meet at 10 a.m. to try to nominate their candidate for speaker.  As you know by now, the choices are House Majority Leader Steve Scalise and Judiciary Committee Chair Jim Jordan of Ohio.",
    "url": "https://punchbowl.news/archive/101123-punchbowl-news-am/"
  },
  {
    "text": "House speaker live updates: Republicans to vote behind closed-doors to pick leader  — Republicans Reps. Steve Scalise, of Louisiana, and Jim Jordan, of Ohio, are the two declared candidates for House speaker to replace Rep. Kevin McCarthy, R-Calif.  — House Republicans met Tuesday night … ",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/house-speaker-live-updates-rcna119455"
  },
  {
    "text": "Democrats furious over Van Orden outburst during White House briefing on Israel terrorist attack  —  Multiple attendees described Van Orden as acting belligerent towards the Biden administration briefers when he asked questions.",
    "url": "https://www.politico.com/live-updates/2023/10/11/congress/van-orden-outburst-house-israel-00120961"
  },
  {
    "text": "White House plans to put Ukraine, Taiwan and border funding in its Israel request  —  The White House and some key lawmakers had been discussing linking Ukraine and Israel aid.  —  WASHINGTON — Officials in President Joe Biden's administration have privately told lawmakers that the White House … ",
    "url": "https://www.nbcnews.com/politics/white-house/white-house-israel-ukraine-taiwan-border-funding-supplemental-request-rcna119930"
  },
  {
    "text": "Republican lawmakers to introduce resolution to expel Rep. George Santos from Congress  —  The movement came a day after Santos, also a Republican, was charged with fraud and identity theft.  —  A group of House Republicans from New York are introducing a resolution to expel Rep. George Santos, R-N.Y., from Congress.",
    "url": "https://www.nbcnews.com/politics/congress/new-york-house-republicans-introduce-resolution-expel-rep-george-santo-rcna119917"
  },
  {
    "text": "At least 40 babies, some beheaded, found by Israel soldiers in Hamas-attacked village  —  IDF Maj Gen Itai Veruv described scene in Kfar Aza as ‘a massacre’  —  Israel's military has discovered unspeakable horrors in an Israeli community that was attacked by Hamas on Saturday … ",
    "url": "https://www.foxnews.com/world/40-babies-some-beheaded-found-israel-soldiers-hamas-attacked-village"
  },
  {
    "text": "Initial US intelligence suggests Iran was surprised by the Hamas attack on Israel  —  The United States has collected specific intelligence that suggests senior Iranian government officials were caught by surprise by Saturday's bloody attack on Israel by Hamas, according to multiple sources familiar with the intelligence.",
    "url": "https://www.cnn.com/2023/10/11/politics/us-intelligence-iran-hamas-doubt/"
  },
  {
    "text": "Crackpot fight!  Trump is worried about RFK Jr. running for president — and he should be scared  —  Trump depends on the crank vote that the anti-vaccine conspiracy theorist could siphon off  —  He may not have bolts sticking out of his neck, but Robert F. Kennedy Jr. is morphing into the MAGA version of Frankenstein's monster.",
    "url": "https://www.salon.com/2023/10/11/crackpot-fight-is-worried-about-rfk-jr-running-for-and-he-should-be-scared/"
  },
  {
    "text": "Netanyahu, Gantz agree to form emergency unity government  —  An agreement is reached to bring Benny Gantz's opposition National Unity party into an emergency government amid the war with Hamas in Gaza following days of negotiations, Prime Minister Benjamin Netanyahu and Gantz announced in a joint statement.",
    "url": "https://www.timesofisrael.com/liveblog_entry/netanyahu-gantz-agree-to-form-emergency-unity-government/"
  },
  {
    "text": "Charles Koch's audacious new $5 billion political scheme  —  Billionaire Charles Koch, who will turn 88 on November 1, is funneling his wealth into two secretive organizations that can continue his right-wing political advocacy for years.  Koch structured more than $5 billion in donations … ",
    "url": "https://popular.info/p/charles-kochs-5-billion-tax-loophole"
  },
  {
    "text": "NYU Student Bar Association President Loses Job Offer for Calling Israel Massacre ‘Necessary’ as School Distances Itself  —  ‘Israel bears full responsibility for this tremendous loss of life,’ wrote Ryna Workman of the terror attack that left at least 1,200 people dead",
    "url": "https://themessenger.com/news/nyu-student-bar-association-president-loses-job-offer-for-calling-israel-massacre-necessary-as-school-distances-itself"
  },
  {
    "text": "Hamas Seeds Violent Videos on Sites With Little Moderation  —  The strategy mirrors efforts by extremist groups like the Islamic State and Al Qaeda in years past.  —  A video of a Hamas gunman firing his assault rifle at a car full of Israeli civilians was viewed more than one million times on X … ",
    "url": "https://www.nytimes.com/2023/10/10/technology/hamas-violent-videos-online.html"
  },
  {
    "text": "Pennsylvania 2024 Poll: Young Voters Hesitant to Support Biden but Stick With Sen. Casey  —  Home Polls Pennsylvania 2024 Poll: Young Voters Hesitant to Support Biden but Stick With Sen. Casey  —  Casey Holds Eight-Point Lead Over McCormick in 2024 Matchup",
    "url": "https://emersoncollegepolling.com/pennsylvania-2024-poll-young-voters-hesitant-to-support-biden-but-stick-with-sen-casey/"
  },
  {
    "text": "Alarms sound in all of Israel's north, warnings of terrorist infiltrators in communities on Israeli-Lebanese border  —  Suspected infiltration of hostile aircrafts from Lebanon spike alarms across all northern Israel  —  Sirens were heard throughout the Golan Heights and the Galilee due … ",
    "url": "https://www.haaretz.com/israel-news/2023-10-11/ty-article-live/1-200-israelis-killed-2-400-wounded-as-israel-targets-hamas-leaders-in-airstrikes/0000018b-1d16-d08b-adef-1ff68d470000"
  },
  {
    "text": "The NRA Argues Domestic Abusers Should Keep Their Guns  —  After remaining mum on a high-profile case that the Supreme Court will consider next month, the country's top pro-gun group finally weighed in this week.  —  The Supreme Court should guarantee gun rights for an accused domestic abuser … ",
    "url": "https://www.huffpost.com/entry/nra-argues-domestic-abusers-should-keep-their-guns_n_6526c740e4b0a32c15c12351"
  },
  {
    "text": "The Supreme Court appears determined to make it easy to draw gerrymanders  —  The Supreme Court's Republican-appointed majority spent Wednesday morning seemingly hunting for a reason to uphold a South Carolina congressional map that everyone agrees was gerrymandered to benefit the Republican Party.",
    "url": "https://www.vox.com/scotus/2023/10/11/23912904/supreme-court-voting-rights-gerrymander-south-carolina-alexander-naacp"
  },
  {
    "text": "I apologize, Kentucky  —  Bluegrass Freedom Action, a political action committee supporting Republican Daniel Cameron, is airing this ad touting former President Donald Trump's endorsement in the race for Kentucky governor.  (Screenshot)  —  I owe Kentucky an apology and should have made it before now.",
    "url": "https://kentuckylantern.com/2023/10/11/i-apologize-kentucky/"
  },
  {
    "text": "Trump demands trial delay to wade through classified docs he stole  —  And Judge Cannon might just let him get away with it. … Donald Trump has just one goal in his two federal criminal cases: push them off until after November 2024, so that he can either pardon himself or instruct … ",
    "url": "https://www.publicnotice.co/p/trump-judge-cannon-classified-docs-trial-delay"
  },
  {
    "text": "The Senate is a problem in the Israel crisis.  Democrats are fed up.  —  The war in the Middle East means top military and diplomatic posts must be filled now, senators say.  —  As war breaks out in the Middle East, key ambassadorships in the region and top military promotions are languishing in the Senate.",
    "url": "https://www.politico.com/news/2023/10/11/hamas-israel-nominees-military-ambassadors-00120871"
  }
]