[
  {
    "text": "John Dean Reveals Biden Move That Could Doom Trump's ‘Revenge’ Plot  —  The Watergate figure said the president could “take the wind” out of Trump's plans for revenge and retribution with a stroke of his pen.  —  LOADING  —  John Dean, the former White House counsel who helped bring … ",
    "url": "https://www.huffpost.com/entry/john-dean-trump-revenge_n_674d27dde4b0e9a096d07d23"
  },
  {
    "text": "We haven't seen a pardon as sweeping as Hunter Biden's in generations  —  The “full and unconditional” pardon is aimed at protecting the president's son from future prosecution by the Trump Justice Department.  —  Hunter Biden's pardon looks a lot like Richard Nixon's.",
    "url": "https://www.politico.com/news/2024/12/02/hunter-biden-pardon-nixon-00192101"
  },
  {
    "text": "The extraordinary breadth of Hunter Biden's pardon  —  President Joe Biden's pardon of his son, Hunter, for any offenses over a nearly 11-year period doesn't have many, if any, direct historical parallels.  —  It's one thing for a president to pardon his son.  It's another to do it like this.",
    "url": "https://www.washingtonpost.com/politics/2024/12/02/hunter-biden-presidential-pardon-comparisons/"
  },
  {
    "text": "What to know about presidents pardoning family members and allies … - His decision infuriated Republicans and raised questions regarding the precedent that it could set for future presidents. … Donald Trump … He issued one for Charles Kushner, the father of his son-in-law Jared Kushner, at the end of his first term.",
    "url": "https://www.axios.com/2024/12/02/hunter-biden-pardon-family-members-allies-history"
  },
  {
    "text": "Geraldo Rivera Slaps Trump Supporters With A Reality Check After Biden's Pardon  —  The former Fox News host and one-time Trump pal pointed out a double standard.  —  LOADING  —  Former Fox News host Geraldo Rivera pointed to the double standards of Donald Trump backers on Sunday … ",
    "url": "https://www.huffpost.com/entry/geraldo-rivera-biden-pardons_n_674d8ed5e4b0e79de41cb84d"
  },
  {
    "text": "White House press secretary defends Hunter Biden pardon: ‘Enough is enough’  —  Both Karine Jean-Pierre and President Joe Biden had told the press multiple times that he had no plans to pardon his son.  —  White House press secretary Karine Jean-Pierre on Monday defended President Joe Biden's decision … ",
    "url": "https://www.nbcnews.com/politics/white-house/karine-jean-pierre-hunter-biden-pardon-rcna182459"
  },
  {
    "text": "Pete Hegseth's Secret History  —  A whistle-blower report and other documents suggest that Trump's nominee to run the Pentagon was forced out of previous leadership positions for financial mismanagement, sexist behavior, and being repeatedly intoxicated on the job.",
    "url": "https://www.newyorker.com/news/news-desk/pete-hegseths-secret-history"
  },
  {
    "text": "‘Trumpworld deeply worried’: Sources tell MSNBC hosts of ‘controversy inside Trump orbit’  —  MSNBC's Joe Scarborough and Jonathan Lemire claimed Monday that some in Donald Trump's orbit aren't thrilled by his nomination of MAGA loyalist Kash Patel as FBI director.",
    "url": "https://www.rawstory.com/kash-patel-fbi/"
  },
  {
    "text": "MAGA Filmmaker Trump Praised Admits 2020 Election Fraud Doc Was B.S.  —  The conspiracy theorist was sued for defamation after falsely accusing a Georgia man of stuffing ballot boxes  —  MAGA filmmaker Dinesh D'Souza issued a statement on Sunday admitting that his most notorious project … ",
    "url": "https://www.rollingstone.com/politics/politics-news/dinesh-dsouza-admits-2000-mules-documentary-false-data-1235188932/"
  },
  {
    "text": "Trump privatization plan will add thousands a year to typical mortgage: expert  —  A proposed deregulation of the home loan market that Donald Trump is widely expected to pursue could have massive consequences for new homebuyers — particularly those with low incomes, reported CNN on Monday.",
    "url": "https://www.rawstory.com/trump-s-expected-mortgage-deregulation-could-cost-new-homebuyers-up-to-2800-more-a-year/"
  },
  {
    "text": "Trump press secretary pick removed post praising Pence on January 6, then ran for Congress as an election denier  —  Karoline Leavitt, President-elect Donald Trump's incoming White House press secretary, deleted two social media posts she shared after the January 6, 2021, riot at the US Capitol … ",
    "url": "https://www.cnn.com/2024/12/02/politics/karoline-leavitt-pence-january-6-2020-election/"
  },
  {
    "text": "Republicans don't care if women die from abortion bans — but they don't want you to know about it  —  Women will keep dying, but the GOP is working hard to destroy the evidence  —  After the Supreme Court ended federal abortion rights in 2022, there was a robust debate between pro … ",
    "url": "https://www.salon.com/2024/12/02/dont-care-if-women-from-abortion-bans--but-they-dont-want-you-to-know-about-it/"
  },
  {
    "text": "America Just Failed the Test of Responding to Trump's Politicized Prosecutions  —  Let's imagine that, two years from now, Pam Bondi rolls out charges against some onetime adversary of Donald Trump.  To the extent that journalists will still be employed and reading court filings … ",
    "url": "https://www.emptywheel.net/2024/12/02/america-just-failed-the-test-of-responding-to-trumps-politicized-prosecutions/"
  },
  {
    "text": "The End of Democratic Delusions  —  The Trump Reaction and what comes next  —  the roosevelt republic—the progressive age that extended social welfare and equal rights to a widening circle of Americans—endured from the 1930s to the 1970s.  At the end of that decade … ",
    "url": "https://www.theatlantic.com/magazine/archive/2025/01/trump-reelection-voter-demographic-change/680752/"
  },
  {
    "text": "The expert class is failing, and so is Biden's presidency  —  As Sean Trende pointed out on X, it hasn't exactly been the best century for the expert class.  Begin with the response to September 11 — the Afghanistan and Iraq Wars, which were supported by bipartisan majorities.",
    "url": "https://www.natesilver.net/p/the-expert-class-is-failing-and-so"
  },
  {
    "text": "House staffer arrested Monday for entering Capitol complex with ammunition  —  A House staffer was arrested Monday morning for entering the Cannon House Office Building with ammunition, according to a statement from the US Capitol Police.  Capitol Police said the staffer is Michael Hopkins … ",
    "url": "https://www.politico.com/live-updates/2024/12/02/congress/house-staffer-arrested-00192151"
  },
  {
    "text": "Study: U.S.-made weapons might be driving migrants to the southern border  —  Rifles on a wall rack.  (Getty Images)  —  As undocumented immigrants show up at the southern border, many may be fleeing gun violence perpetrated with weapons that originally came from the United States.",
    "url": "https://ohiocapitaljournal.com/2024/12/02/study-u-s-made-weapons-might-be-driving-migrants-to-the-southern-border/"
  },
  {
    "text": "Trump Wants to Shake Up Health Care.  Many Americans Don't Mind.  —  Some voters galvanized by Robert F. Kennedy Jr.'s pledge to “Make America Healthy Again” said they believed the health establishment was dismissive and even corrupt.  —  As a nature-loving physical therapist in Boulder … ",
    "url": "https://www.nytimes.com/2024/12/02/us/trump-public-health-dr-oz-rfk-jr.html?unlocked_article_code=1.eU4.pwxr.m7MekGyQFaH5&smid=nytcore-ios-share&referringSource=articleShare"
  }
]