[
  {
    "text": "Democratic donors funding an effort to vet potential VP candidates  —  The effort to vet potential running mates, should Biden exit and Harris become the nominee, is independent of the Biden campaign  —  Major Democratic donors are funding a preliminary vetting process for potential vice … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/20/democrat-donors-fund-vp-vetting-push/"
  },
  {
    "text": "Republicans' June fundraising is party's strongest month in years  —  The GOP surge comes as a growing number of Democrats are calling on Biden to drop out in the wake of a politically devastating debate performance  —  The GOP posted another strong fundraising month in June … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/20/fundraising-july-election-trump-biden/"
  },
  {
    "text": "GOP builds new case for Biden resignation … - “Everyone calling on Joe Biden to *stop running* without also calling on him to resign the presidency is engaged in an absurd level of cynicism,” Trump's running mate Sen. J.D. Vance (R-Ohio) posted on Saturday.  — “If you can't run, you can't serve.",
    "url": "https://www.axios.com/2024/07/20/republicans-biden-resign-white-house-election-2024"
  },
  {
    "text": "JD Vance Demands Joe Biden Resign from Office: 'If You Can't Run, You Can't Serve'  —  Republican vice presidential nominee Sen. JD Vance (OH) demanded President Joe Biden “resign” from office in a Saturday X post.  —  “Everyone calling on Joe Biden to *stop running* without also calling … ",
    "url": "https://www.breitbart.com/2024-election/2024/07/20/jd-vance-demands-joe-biden-resign-from-office-if-you-cant-run-you-cant-serve/"
  },
  {
    "text": "Secret Service said to have denied requests for more security at Trump events  —  Top officials repeatedly rejected requests from Trump's security detail for more manpower and gear at events before attempted assassination, at times citing lack of resources, people familiar with the asks said.",
    "url": "https://www.washingtonpost.com/nation/2024/07/20/trump-secret-service-security-attempted-assassination/"
  },
  {
    "text": "Will Peter Baker Exhibit the Same Tenacity about Medical Records on the Trump Shooting as He Did a Parkinson's Conspiracy Theory?  —  Something funny happened on Xitter.  —  In an attempt to demonstrate the double standard and cowardice of the captive media, I tweeted at Peter Baker asking … ",
    "url": "https://www.emptywheel.net/2024/07/20/will-peter-baker-exhibit-the-same-tenacity-about-medical-records-on-the-trump-shooting-as-he-did-a-parkinsons-conspiracy-theory/"
  },
  {
    "text": "Data centers draining resources in water-stressed communities  —  This opinion column was written by Eric Olson, Anne Grau, and Taylor Tipton and was first published in the Dallas Morning News.  Olson is an associate professor of finance and director of the Center for Energy Studies at The University of Tulsa.",
    "url": "https://utulsa.edu/news/data-centers-draining-resources-in-water-stressed-communities/"
  },
  {
    "text": "“It's not that complicated”: Pete Buttigieg on why a gay billionaire is backing JD Vance  —  When asked to weigh in on Peter Thiel's reasons for supporting Vance, Buttigieg broke it down plainly: Money  —  In a segment of “Real Time with Bill Maher” at the start of the weekend … ",
    "url": "https://www.salon.com/2024/07/20/its-not-that-complicated-pete-buttigieg-on-why-a-gay-billionaire-is-backing-jd-vance/"
  },
  {
    "text": "Rep. Sheila Jackson Lee Dies at 74 After Pancreatic Cancer Diagnosis  —  ‘INCREDIBLE GRIEF’  —  The long-serving Democratic congresswoman went public with her health battle in June.  —  Rep. Sheila Jackson Lee (D-TX), a longtime congresswoman who served three decades in Congress … ",
    "url": "https://www.thedailybeast.com/rep-sheila-jackson-lee-dies-at-74-after-pancreatic-cancer-diagnosis"
  },
  {
    "text": "Tech broligarchs are lining up to court Trump.  And Vance is one more link in the chain  —  Elon Musk and Peter Thiel, a longtime backer of the new vice-president pick, are among those pledging support  —  Less than a month after Donald Trump was elected president in November 2016 … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/20/tech-broligarchs-court-trump-vance-elon-musk-peter-thiel"
  },
  {
    "text": "How Project 2025 would change American life … - At least 140 former Trump administration officials contributed to Project 2025, CNN reports.  — Trump has publicly disavowed the project; his campaign has pointed to his own policy plan, Agenda47, and the official Republican Party platform as his agenda if he wins in November.",
    "url": "https://www.axios.com/2024/07/20/project-2025-trump-what-to-know"
  },
  {
    "text": "Some Democratic cities have quietly begun cooperating with ICE, director says  —  Some sanctuary cities that wouldn't tell ICE when they released undocumented immigrants from jail are now doing so because of public concern about crime, said P.J. Lechleitner.",
    "url": "https://www.nbcnews.com/investigations/democratic-cities-quietly-cooperating-ice-director-says-rcna162710"
  },
  {
    "text": "CNN's Dr. Sanjay Gupta Calls For ‘Public Assessment’ Of Trump's Injuries After Shooting … LOADING",
    "url": "https://www.huffpost.com/entry/cnn-sanjay-gupta-public-assessment-trump-injuries-shooting_n_669bd5efe4b034b71ab5e374"
  },
  {
    "text": "Statement from Secretary Mayorkas, Senior Official Performing the Duties of the Deputy Secretary Canegallo, and Senior Department of Homeland Security Leadership  —  Secretary of Homeland Security Alejandro N. Mayorkas, Senior Official Performing the Duties of the Deputy Secretary … ",
    "url": "https://www.dhs.gov/news/2024/07/20/statement-secretary-mayorkas-senior-official-performing-duties-deputy-secretary"
  }
]