[
  {
    "text": "Judge finds Eastman culpable for ethics breaches in 2020 bid to keep Trump in power  —  California authorities will now present “aggravation” evidence in their effort to strip Eastman of his law license.  —  A California judge made a “preliminary finding” Thursday that attorney John Eastman … ",
    "url": "https://www.politico.com/news/2023/11/03/john-eastman-trump-disbarment-culpable-00125219"
  },
  {
    "text": "Trump appointee who assaulted Capitol officers on Jan. 6 sentenced to nearly 6 years  —  “Hell yea I'm going.  I'm a Trump appointee,” Federico Klein wrote in a message ahead of the Capitol attack.  —  WASHINGTON — A former Donald Trump political appointee at the State Department who tried … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-appointee-assaulted-capitol-officers-jan-6-sentenced-nearly-6-ye-rcna123188"
  },
  {
    "text": "Trump State Department appointee sentenced to nearly 6 years for role in Jan. 6 attack  —  The State Department appointee was involved in the Jan. 6 attack on the Capitol.  —  LIVE  —  In this image from U.S. Capitol Police security video, released and annotated by the Justice Department … ",
    "url": "https://abcnews.go.com/Politics/trump-state-department-appointee-sentenced-6-years-role/story?id=104604054"
  },
  {
    "text": "BREAKING: Netanyahu Rebukes US, Declares No Pause and No Fuel Before Hostages are Released  —  Benjamin Netanyahu has learned to take Hamas at its word.  The United States, and specifically Antony Blinken and Joe Biden, still have not.  As Blinken met with the unity government in Jerusalem … ",
    "url": "https://hotair.com/ed-morrissey/2023/11/03/breaking-netanyahu-rebukes-us-declares-no-pause-and-no-fuel-before-hostages-are-released-n589754"
  },
  {
    "text": "Netanyahu: No temporary ceasefire without our hostages released; no fuel into Gaza  —  In a brief televised statement before the start of Shabbat, Prime Minister Benjamin Netanyahu says he has told visiting US Secretary of State Antony Blinken that he rejects any temporary halt to the fight … ",
    "url": "https://www.timesofisrael.com/liveblog_entry/netanyahu-no-temporary-ceasefire-without-our-hostages-released-no-fuel-into-gaza/"
  },
  {
    "text": "Trump's Truth Social page is a riot of witness intimidation  —  Even his lawyers can't really defend it. … On August 6, Alabama man Arthur Ray Hanson, II, left a voicemail threatening Fulton County District Attorney Fani Willis with violence if she charged Donald Trump with interference in the 2020 election.",
    "url": "https://www.publicnotice.co/p/trump-witness-intimidation-gag-order-explained"
  },
  {
    "text": "‘A civilian for a civilian’: Nasrallah threatens attacks against Israelis, US troops in region  —  Hassan Nasrallah says Hezbollah is not intimidated by American threats and by US forces deployed to the region.  —  “Since the outbreak of the war, the US has threatened to bomb us in Lebanon from its military ships in the Mediterranean.",
    "url": "https://www.timesofisrael.com/liveblog_entry/a-civilian-for-a-civilian-nasrallah-threatens-attacks-against-israelis-us-troops-in-region/"
  },
  {
    "text": "Kentucky 2023 Poll: Cameron Catches Up to Beshear in Governor's Race  —  Home Polls Kentucky 2023 Poll: Cameron Catches Up to Beshear in Governor's Race  —  Trump Supporters Rally to Cameron as Election Approaches  —  The final Emerson College Polling survey of Kentucky voters … ",
    "url": "https://emersoncollegepolling.com/kentucky-2023-poll-cameron-catches-up-to-beshear-in-governors-race/"
  },
  {
    "text": "Trump's New Appellate Argument about His 100 Million Imaginary Friends  —  Judge Tanya Chutkan issued her order denying Trump a stay of her gag order on October 29.  —  That was admittedly a Saturday.  Nevertheless, it took Trump four days before he ran to the DC Circuit to cry … ",
    "url": "https://www.emptywheel.net/2023/11/03/trumps-new-appellate-argument-about-his-100-million-imaginary-friends/"
  },
  {
    "text": "Complaint Calls for Trump New York Trial Judge's Clerk to Be Disbarred for Excessive Political Donations  —  The top clerk for New York Justice Arthur Engoron, Allison Greenfield, appears to have violated judicial rules preventing officers of the court from making excessive political donations, Breitbart News has learned.",
    "url": "https://www.breitbart.com/politics/2023/11/02/complaint-calls-for-trump-new-york-trial-judges-clerk-to-be-disbarred-for-excessive-political-donations/"
  },
  {
    "text": "Supreme Court to review Trump-era ban on gun ‘bump stocks’  —  The Biden administration is defending the ban, which Trump imposed after the mass shooting in Las Vegas in 2017.  —  WASHINGTON — The Supreme Court on Friday stepped into a new gun rights battle by agreeing to weigh whether … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-review-trump-era-ban-gun-bump-stocks-rcna121466"
  },
  {
    "text": "Operation Dark Horse: Surprise entry in 2024 GOP race  —  has faced long odds before and won.  —  As an Air Force major and combat pilot, he helped end the military's reluctance to face up to the threat of electromagnetic pulse warfare and start building defenses of strategic bases.",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/operation-dark-horse-surprise-entry-in-2024-gop-race"
  },
  {
    "text": "Supreme Court takes up NRA coercion claim against former New York official  —  The National Rifle Association alleges the then-official's warning that companies faced ‘reputational risks’ by partnering with the group violates its constitutional rights.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-takes-nra-coercion-claim-former-new-york-official-rcna111344"
  },
  {
    "text": "Does Mike Johnson Even Want to Avoid a Government Shutdown?  —  On November 17, barring action by Congress and President Joe Biden, nonessential functions of the federal government will shut down.  The bullet Washington narrowly avoided in October at the price of Kevin McCarthy's Speakership will be fired again.",
    "url": "https://nymag.com/intelligencer/2023/11/does-mike-johnson-even-want-to-avoid-a-government-shutdown.html"
  },
  {
    "text": "Nikki Haley isn't divulging what she said in paid private speeches  —  The GOP presidential candidate earned between $100,000 and $1 million for each of a dozen appearances.  Her team says she didn't keep records of her words.  —  Nikki Haley doesn't have transcripts … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-isnt-divulging-paid-private-speeches-corporations-rcna123281"
  },
  {
    "text": "Former pilot who allegedly threatened to shoot flight captain once sued DOD against Covid-19 mandate  —  Jonathan J. Dunn joined the Air Force Reserves in November 2000 and in February 2022 sued the Department of Defense after his request for a religious exemption for the Covid-19 vaccine was rejected.",
    "url": "https://www.nbcnews.com/news/us-news/former-pilot-allegedly-threatened-shoot-flight-captain-sued-dod-covid-rcna123400"
  },
  {
    "text": "John Fetterman predicts Joe Manchin is ‘not going to be around much longer’ in the Senate: 'I'm going to get his parking space'  — Sen. John Fetterman predicted that fellow Democratic Sen. Joe Manchin won't be “around much longer.”  — Manchin hasn't announced 2024 plans.",
    "url": "https://www.businessinsider.com/fetterman-manchin-dress-code-not-senator-much-longer-2023-11?op=1"
  },
  {
    "text": "Biden weighs border deal — altering asylum law for Ukraine aid  —  Republicans placed a political lighting rod of an issue squarely into the biggest legislative matter before Congress.  —  Top Biden officials are preparing Democratic lawmakers and immigration policy advocates for the likelihood … ",
    "url": "https://www.politico.com/news/2023/11/02/biden-ukraine-aid-deal-00125125"
  },
  {
    "text": "Chase Strangio on asking SCOTUS to review Tennessee's trans care ban, a Law Dork Q&A  —  “We are going to the Supreme Court because the Sixth Circuit opinion was catastrophically wrong as a doctrinal matter and as moral matter.”  —  On Nov. 1, lawyers for Tennessee families and medical providers asked … ",
    "url": "https://www.lawdork.com/p/chase-strangio-scotus-trans-care-ban-qa"
  },
  {
    "text": "Biden expected to skip COP climate summit, trip to Africa  —  The White House had prepared for a trip to Dubai, and a promised stop in Africa, but the president will likely stay stateside for the remainder of 2023.  —  President Joe Biden plans to skip an upcoming global climate conference … ",
    "url": "https://www.politico.com/news/2023/11/03/biden-climate-summit-africa-trip-00125247"
  },
  {
    "text": "Biden quietly tapped Obama to help shape his AI strategy  —  Former President Barack Obama advised the White House over the past five months on its plan to address artificial intelligence.  —  WASHINGTON — Former President Barack Obama quietly advised the White House over the past five months … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-quietly-tapped-obama-help-shape-ai-strategy-rcna123238"
  },
  {
    "text": "Nikki Haley to miss Florida GOP gathering for 2024 candidates  —  Her absence will make it more expensive for her to get on Florida's primary ballot next year.  —  Nikki Haley will not be in attendance at this weekend's Republican Party of Florida's “Freedom Summit” — an absence that will cost her campaign $75,000.",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-skip-florida-gop-gathering-2024-candidates-rcna123526?taid=654527239f9ae30001402a23"
  },
  {
    "text": "Where does Speaker Mike Johnson sleep when he's in DC?  Most likely in his Capitol Hill office  — Speaker Mike Johnson is less wealthy than most lawmakers and doesn't appear to have a DC residence.  — Several people told Insider that he likely sleeps in his office, like many other lawmakers.",
    "url": "https://www.businessinsider.com/speaker-mike-johnson-sleep-in-his-capitol-hill-office-2023-11?op=1"
  }
]