[
  {
    "text": "Chris Christie plays down risk to Republicans if Trump loses primary but won't leave the race  —  He argued “the public en masse will begin to ignore” the former president  —  Republican presidential candidate and former Governor of New Jersey Chris Christie speaks at the Hudson Institute, on Nov. 15, 2023, in Washington, D.C.",
    "url": "https://abcnews.go.com/Politics/chris-christie-plays-risk-republicans-trump-loses-primary/story?id=105156248"
  },
  {
    "text": "To Beat Trump, Nikki Haley Is Trying to Speak to All Sides of a Fractured G.O.P.  —  Her campaign will test what political strategists and observers of her rise in politics have said is among her greatest political skills: an ability to massage her message to the moment.",
    "url": "https://www.nytimes.com/2023/11/26/us/politics/haley-trump-issues-2024.html"
  },
  {
    "text": "Romney says any Democrat would be ‘an upgrade’ over Trump in 2024  —  Sen. Mitt Romney (R-Utah) signaled that nearly any candidate in the 2024 field, of either party, would be an “upgrade” over another term for former President Trump.  —  “I'd be happy to support virtually any one of the Republicans … ",
    "url": "https://thehill.com/homenews/senate/4327061-romney-democrat-upgrade-over-trump-in-2024/"
  },
  {
    "text": "THE DANGER OF NOT CONFRONTING TRUMP  —  I believe we must question and confront Trump for democracy, for the rights of immigrants and, simply, for good journalism.  —  Due to the strong criticisms after Univision aired an interview with Donald Trump on Nov. 9 -that put in doubt the independence … ",
    "url": "https://jorgeramos.com/en/the-danger-of-not-confronting-trump-2/"
  },
  {
    "text": "Trump Shows Off at Palmetto Bowl Football Faceoff on Nikki Haley's Home Turf to Mixed Reception  —  'You lost.  You're guilty.  Welcome to Columbia, Donald,' flashed two billboards that greeted him, sponsored by ‘vermin’  —  Former President Donald Trump came out to watch … ",
    "url": "https://themessenger.com/politics/trump-shows-off-at-palmetto-bowl-football-faceoff-on-nikki-haleys-home-turf-to-mixed-reception"
  },
  {
    "text": "A doctor tried to renew his passport.  Now he's no longer a citizen.  —  The Northern Virginia doctor was born in D.C. and given a U.S. birth certificate.  At 61, he learned his citizenship was granted by mistake.  —  Siavash Sobhani is stateless.  —  The Northern Virginia doctor knows at least that much about his situation.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/11/25/virginia-doctor-passport-citizenship-nightmare/"
  },
  {
    "text": "A Troubling Trump Pardon and a Link to the Kushners  —  A commutation for a drug smuggler named Jonathan Braun had broader implications than previously known.  It puts new focus on how Donald Trump would use his clemency powers in a second term.  —  Even amid the uproar … ",
    "url": "https://www.nytimes.com/2023/11/26/us/politics/trump-pardon-braun.html"
  },
  {
    "text": "What we actually know about aliens, according to science  —  GREEN BANK, W.Va. — It came from space, hurtling at tremendous speed: a mystery object, reddish, rocky, shaped like a cigar.  Its velocity was so extreme it had to have come from somewhere far away, in the interstellar realm.",
    "url": "https://www.washingtonpost.com/science/2023/11/25/aliens-uaps-scientific-evidence/"
  },
  {
    "text": "Santos lashes out at colleagues as he stares down expulsion  —  Rep. George Santos (R-N.Y.) said Friday he won't resign from Congress but acknowledged he will likely be expelled as he lobbed salacious accusations at colleagues and called the chair of the Ethics Committee a “p***y”.",
    "url": "https://www.axios.com/2023/11/25/santos-lashes-out-expulsion-vote"
  },
  {
    "text": "At Meta, Millions of Underage Users Were an ‘Open Secret,’ States Say  —  Meta “routinely documented” children under 13 on Instagram and “unlawfully” collected their data, according to a newly unsealed complaint.  —  Meta has received more than 1.1 million reports of users under the age … ",
    "url": "https://www.nytimes.com/2023/11/25/technology/instagram-meta-children-privacy.html"
  },
  {
    "text": "Members of Congress Head for the Exits, Many Citing Dysfunction  —  More than three dozen incumbents have announced they will not seek re-election next year.  Some are running for other offices, while others intend to leave Congress altogether.  —  Eleven are running for the Senate.",
    "url": "https://www.nytimes.com/2023/11/26/us/politics/congress-retirement-republicans-democrats.html"
  },
  {
    "text": "Gaza Civilians, Under Israeli Barrage, Are Being Killed at Historic Pace  —  In less than two months, more than twice as many women and children have been reported killed in Gaza than in Ukraine after two years of war.  —  Israel has cast the deaths of civilians in the Gaza Strip as a regrettable … ",
    "url": "https://www.nytimes.com/2023/11/25/world/middleeast/israel-gaza-death-toll.html"
  },
  {
    "text": "Pro-Israel teacher hides in Queens high school as ‘radicalized’ students riot: ‘They want her fired’  —  Hundreds of “radicalized” kids rampaged through the halls of a Queens high school this week for nearly two hours after they discovered a teacher had attended a pro-Israel rally … ",
    "url": "https://nypost.com/2023/11/25/metro/jewish-teacher-hides-in-queens-high-school-as-students-riot/"
  },
  {
    "text": "Irish PM panned for saying freed hostage child Emily Hand ‘found’ after she was ‘lost’  —  FM Eli Cohen summons ambassador and accuses Leo Varadkar of ‘losing his moral compass’; Minister Gantz: ‘Emily was never “lost” - she was brutally kidnapped and held hostage’",
    "url": "https://www.timesofisrael.com/irish-pm-panned-for-saying-freed-hostage-child-emily-hand-found-after-she-was-lost/"
  },
  {
    "text": "Ex-officer Derek Chauvin, convicted in George Floyd's killing, stabbed in prison, AP source says  —  Derek Chauvin, the former Minneapolis police officer convicted of murdering George Floyd, was stabbed by another inmate and seriously injured Friday at a federal prison in Arizona … ",
    "url": "https://apnews.com/article/derek-chauvin-george-floyd-prison-stabbing-f24cde6aa28877d034530c2dc40ef7ea"
  }
]