[
  {
    "text": "Police union that endorsed Trump blasts Jan. 6 pardons … - “Allowing those convicted of these crimes to be released early diminishes accountability and devalues the sacrifices made by courageous law enforcement officers and their families,” per the statement.",
    "url": "https://www.axios.com/2025/01/22/police-union-trump-jan-6-pardons"
  },
  {
    "text": "Trump gave pardons to hundreds of violent Jan. 6 rioters.  Here's what they did  —  Loading...  Throughout his 2024 campaign for president, Donald Trump repeatedly promised to give pardons to his supporters who had been criminally charged in the Jan. 6, 2021, attack on the U.S. Capitol.",
    "url": "https://www.npr.org/2025/01/21/nx-s1-5268919/trump-issues-jan-6-pardons-attack-capitol-clemency"
  },
  {
    "text": "Live updates: Trump makes AI announcement and defends Jan. 6 pardons  —  Democrats and some Republicans have rebuked Trump's decision to pardon or commute the sentences of more than 1,500 Jan. 6 rioters. … These people are some of the violent Jan. 6 rioters Trump pardoned  —  Janelle Griffith and Ryan J. Reilly",
    "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-agenda-executive-orders-live-updates-rcna188511#rcrd70098"
  },
  {
    "text": "Senators receive affidavit containing new allegations against Pete Hegseth, who denies the claims  —  The former sister-in-law of Trump's defense secretary pick said that Hegseth made his second wife fear for her safety.  Hegseth's second wife said, “There was no physical abuse in my marriage.”",
    "url": "https://www.nbcnews.com/politics/national-security/senators-received-affidavit-containing-new-allegations-pete-hegseth-de-rcna188342"
  },
  {
    "text": "Hegseth Ex-Sister-in-Law Tells Senators He Was ‘Abusive’ to Second Wife  —  A woman once married to the brother of Pete Hegseth, the defense secretary nominee, submitted a sworn statement to the Senate in a late-hour complication to his confirmation.  His attorney denied her account.",
    "url": "https://www.nytimes.com/2025/01/21/us/politics/hegseth-senators-affidavit.html?unlocked_article_code=1.q04.WqU2.FjpnG4Psf5Uq&smid=url-share"
  },
  {
    "text": "GOP member wants bishop ‘added to deportation list’ after Trump prayer service  —  Rep. Mike Collins (R-Ga.) heavily criticized statements made by the Right Rev. Mariann Budde on Tuesday at the inaugural prayer service held for President Trump.  —  “The person giving this sermon should be added … ",
    "url": "https://thehill.com/homenews/house/5098959-gop-member-wants-bishop-added-to-deportation-list-after-trump-prayer-service/"
  },
  {
    "text": "Trump Pardons Creator of Silk Road Drug Marketplace  —  Ross Ulbricht was serving a life sentence for creating a site in a shady corner of the internet to sell heroin, cocaine and other illicit substances.  —  President Trump on Tuesday granted a pardon to Ross Ulbricht … ",
    "url": "https://www.nytimes.com/2025/01/21/technology/trump-ross-ulbricht-silk-road.html"
  },
  {
    "text": "Trump pardons Silk Road creator Ross Ulbricht … - He added, “The scum that worked to convict him were some of the same lunatics who were involved in the modern day weaponization of government against me.”",
    "url": "https://www.axios.com/2025/01/22/trump-ross-ulbricht-silk-road"
  },
  {
    "text": "Trump administration directs all federal diversity, equity and inclusion staff be put on leave  —  President Donald Trump 's administration moved Tuesday to end affirmative action in federal contracting and directed that all federal diversity, equity and inclusion staff be put on paid leave and eventually be laid off.",
    "url": "https://apnews.com/article/dei-trump-executive-order-diversity-834a241a60ee92722ef2443b62572540"
  },
  {
    "text": "Constitution page on White House website shows 404 error  —  The Constitution page on President Trump's White House website is showing a 404 error.  —  “Page not found,” the site reads.  —  Under former President Biden's term, the website highlighted the history behind the creation … ",
    "url": "https://thehill.com/homenews/administration/5098790-constitution-white-house-website-donald-trump/"
  },
  {
    "text": "Trump officials pause health agencies' communications, citing review  —  The agencies are charged with making decisions that touch the lives of every American and are the source of crucial information to health-care providers.  —  The Trump administration has instructed federal health agencies … ",
    "url": "https://www.washingtonpost.com/health/2025/01/21/trump-hhs-cdc-fda-communication-pause/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NDM1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4ODE3OTk5LCJpYXQiOjE3Mzc0MzU2MDAsImp0aSI6ImEzODFhN2UxLTRhOGUtNGFjOS1hNGRmLTEyNDk5ZWIzNGFiOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMS8yMS90cnVtcC1oaHMtY2RjLWZkYS1jb21tdW5pY2F0aW9uLXBhdXNlLyJ9.cY26hIDkmu_AWumnD7uJ1Ge-rGGy5hoacMYbVpbSyJM&itid=gfta"
  },
  {
    "text": "Great-grandson of the man who established birthright citizenship slams Trump's new executive order  —  “He's feeding off the American mindset, and it's not a healthy one,” said the great-grandson of Wong Kim Ark, whose 1898 Supreme Court case helped guarantee birthright citizenship.",
    "url": "https://www.nbcnews.com/news/asian-america/wong-kim-ark-birthright-citizenship-trump-executive-order-rcna188481"
  },
  {
    "text": "‘The gesture speaks for itself’: Germans respond to Musk's apparent Nazi salute  —  Some say it was an unambiguous Nazi salute but others are unsure and say focus should be on Musk's stated support for far-right  —  There were angry reactions across Europe to Elon Musk's apparent use … ",
    "url": "https://www.theguardian.com/technology/2025/jan/21/the-gesture-speaks-for-itself-germans-divided-over-musks-apparent-nazi-salute"
  },
  {
    "text": "‘All Americans legally female’: Trump invites mockery with sloppy executive order  —  President Donald Trump published two executive orders late Monday that targeted transgender people, but critics couldn't help but note that the clunky language declared all Americans legally female.",
    "url": "https://www.rawstory.com/trump-transgender-2670902521/"
  },
  {
    "text": "Donald Trump's Medicare Executive Order Explained  —  's executive order 14087, which was put in place to lower the cost of prescription drugs for Americans.  —  Newsweek has reached out to the Trump transition team outside of regular working hours via email for comment.  —  Why It Matters",
    "url": "https://www.newsweek.com/donald-trump-medicare-executive-order-explained-2018138"
  },
  {
    "text": "Scoop: Top DOGE Dem is ready for a fight … - “All you need to do is see that they put [Rep.] Marjorie Taylor Greene (R-Ga.) in charge of the committee to know that this is likely going to be very much a political committee,” she said. … - Stansbury said that there are “a lot of good government … ",
    "url": "https://www.axios.com/2025/01/22/trump-musk-doge-democrat-melanie-stansbury"
  },
  {
    "text": "Trump kicks off potentially messy fight over Biden's infrastructure money  —  One of Trump's executive orders could imperil billions in funding for projects that states have already begun working on, some experts said.  —  An executive order by President Donald Trump requiring agencies … ",
    "url": "https://www.politico.com/news/2025/01/21/trump-fight-biden-infrastructure-money-00199796"
  },
  {
    "text": "Trump's crypto grifts: billions in paper profits, millions from memecoin trading fees, and new funding from Chinese-born entrepreneur Justin Sun  —  Grifter-in-Chief Donald Trump will not let an opportunity to profit pass him by.  —  This past Saturday, two days before the inauguration … ",
    "url": "https://newstracs.com/trumps-crypto-grifts-memecoin-trading-fees-and-a-new-investment-from-justin-sun/2025/01/21/"
  },
  {
    "text": "Trump terminates John Bolton's security detail within hours of taking office  —  Within hours of taking office, President Donald Trump terminated the Secret Service detail that was assigned to his former national security adviser John Bolton, Bolton confirmed to CNN on Tuesday.",
    "url": "https://www.cnn.com/2025/01/21/politics/john-bolton-security-detail-trump"
  },
  {
    "text": "Trump pushes Hill GOP on recess appointments, debt limit  —  A White House meeting on the president's first full day back in office emphasized unity.  —  President Donald Trump prodded congressional leaders to consider recess appointments for his top nominees and expressed interest … ",
    "url": "https://www.politico.com/news/2025/01/21/trump-johnson-thune-white-house-005697"
  },
  {
    "text": "‘DOGE’ revamp empowers Musk as frictions spur Ramaswamy's exit  —  A deep philosophical rift between the two billionaire leaders of the “Department of Government Efficiency” left Musk to run the group.  —  President Donald Trump's order establishing the “Department of Government Efficiency” … ",
    "url": "https://www.washingtonpost.com/business/2025/01/21/elon-musk-vivek-ramaswamy-doge/"
  }
]