[
  {
    "text": "Statement Regarding the Matter of Representative Matt Gaetz  —  Pursuant to Committee Rule 7, the Committee on Ethics (Committee) determined to release the following statement:  —  On April 9, 2021, the Committee announced it had initiated a review into allegations that Representative Matt Gaetz … ",
    "url": "https://ethics.house.gov/press-releases/statement-regarding-matter-representative-matt-gaetz"
  },
  {
    "text": "House Ethics Committee expands probe into Matt Gaetz  —  The rare, detailed update from the bipartisan panel clarified the status of the investigation and detailed new lines of inquiry into the Florida lawmaker.  —  The House Ethics Committee is still investigating allegations against Rep. Matt Gaetz … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/18/matt-gaetz-house-ethics-committee/"
  },
  {
    "text": "Half a million immigrants could eventually get US citizenship under a new plan from Biden  —  President Joe Biden is taking an expansive election year step to offer relief to potentially hundreds of thousands of immigrants without legal status in the U.S., aiming to balance his own aggressive crackdown … ",
    "url": "https://apnews.com/article/president-joe-biden-immigration-border-citizenship-spouses-69b9212c382d9bb265369b29b62622d7"
  },
  {
    "text": "Trump Wasn't Going to Stay in Milwaukee.  Then Reporters Asked.  —  The Republican convention will be held in swing-state Wisconsin's largest city.  The nominee, however, had planned to stay at his own hotel in Chicago, until members of the media began inquiring.",
    "url": "https://www.nytimes.com/2024/06/18/us/politics/trump-milwaukee-rnc.html"
  },
  {
    "text": "Campaign denies Donald Trump planning to stay in Chicago during 2024 Milwaukee RNC  —  There is a rally Tuesday for former President Donald Trump in Racine, Wisconsin.  —  CHICAGO (WLS) — Former President Donald Trump's campaign denied he is planning to stay in Chicago and commute to Milwaukee … ",
    "url": "https://abc7chicago.com/post/donald-trump-stay-chicago-during-2024-rnc-milwaukee/14971275/"
  },
  {
    "text": "Vermont Republican secretly poured water into colleague's bag over months  —  Mary Morrissey apologizes after being filmed dumping liquid into backpack of Democratic legislator Jim Carroll  —  A Vermont lawmaker was compelled to apologize publicly after being caught on video pouring water … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/18/vermont-republican-water-bag"
  },
  {
    "text": "DJT shares tumble 13% as Trump Media stock sell-off accelerates … Shares of Trump Media & Technology Group dropped more than 13% on Tuesday, continuing the stock's tumble following the conviction of former President Donald Trump, the company's majority shareholder.",
    "url": "https://www.cnbc.com/2024/06/18/djt-shares-tumble-13percent-as-trump-media-stock-sell-off-accelerates.html"
  },
  {
    "text": "Bump stock ban blocked by Senate Republicans … - The bipartisan bill had little chance of passing the chamber and was instead introduced to force Republicans to reject it.  — The measure picked up 20 additional cosponsors since last week's Supreme Court ruling.",
    "url": "https://www.axios.com/2024/06/18/bump-stock-ban-blocked-senate-republicans"
  },
  {
    "text": "The shooter who killed 5 at a Colorado LGBTQ+ club pleads guilty to 50 federal hate crimes  —  The shooter who killed five people and injured 19 others at an LGBTQ+ club that was a refuge in the conservative city of Colorado Springs pleaded guilty to federal hate crimes and was sentenced … ",
    "url": "https://apnews.com/article/colorado-springs-lgbtq-bar-shooting-028344ddb7666033311dc67a064fef9f"
  },
  {
    "text": "New York's top court declines to hear Trump's appeal of gag order in hush money case  —  New York's top court on Tuesday declined to hear Donald Trump's gag order appeal in his hush money case, leaving the restrictions in place following his felony conviction last month.",
    "url": "https://apnews.com/article/donald-trump-hush-money-gag-order-juan-merchan-c6e8056bf7b82aaf0bbf094d703b5f31"
  },
  {
    "text": "Trump says business executives should be ‘fired for incompetence’ if they don't support him  —  The former president referred to an excerpt from an article in The Wall Street Journal indicating that corporations would benefit again if he is re-elected in November.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-business-executives-fired-incompetence-dont-support-rcna157800"
  },
  {
    "text": "Former CNBC analyst-turned-fugitive arrested by FBI after nearly 3 years on the run  —  A former CNBC analyst who ended up on the FBI's Most Wanted list for white-collar crimes was arrested over the weekend after being charged with defrauding investors, federal prosecutors announced Monday.",
    "url": "https://www.cbsnews.com/news/james-mcdonald-arrested-cnbc-analyst-turned-fugitive/"
  },
  {
    "text": "No more bridges left to burn in Jewish Westchester  —  As Rep. Jamaal Bowman fights for his political life, Jewish leaders in the district say he's left a long trail of betrayal in his wake  —  In late spring of 2022, Rep. Jamaal Bowman (D-NY) reached out to a local Jewish leader … ",
    "url": "https://jewishinsider.com/2024/06/rep-jamaal-bowman-westchester-county-jewish-community/"
  },
  {
    "text": "Dollar Tree Inc. - 674301 - 06/11/2024  —  Product: … WARNING LETTER  —  Dear Mr. Dreiling:  —  Beginning in October 2023, the U.S. Food and Drug Administration (FDA), along with the Centers for Disease Control and Prevention (CDC) and state and local partners, investigated elevated levels … ",
    "url": "https://www.fda.gov/inspections-compliance-enforcement-and-criminal-investigations/warning-letters/dollar-tree-inc-674301-06112024"
  },
  {
    "text": "Another evangelical abuse scandal: It's a big reason why they worship Trump  —  Another week, and another prominent Christian right pastor gets outed for alleged or apparent sexual abuse.  Robert Morris, the founder of Gateway Church in the Dallas suburbs, was accused last week by a woman … ",
    "url": "https://www.salon.com/2024/06/18/another-evangelical-abuse-scandal-its-a-big-reason-why-they-worship/"
  },
  {
    "text": "RFK Jr. won't meet CNN debate requirement for ballot access  —  The independent presidential candidate has said he has qualified for enough state ballots, but state election officials have said that's not true  —  Independent presidential candidate Robert F. Kennedy Jr. has repeatedly claimed … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/18/rfk-jr-presidential-debate/"
  },
  {
    "text": "The American Climate Corps officially kicks off … Within weeks, the nation will deploy 9,000 people to begin restoring landscapes, erecting solar panels, and taking other steps to help guide the country toward a cleaner, greener future.  —  The first of those workers were inducted … ",
    "url": "https://grist.org/solutions/american-climate-corps-swearing-in-ceremony/"
  },
  {
    "text": "‘Lawyers, Judges, Technology’: Roger Stone Touts Plan for Trump Win in Secret Recording  —  Liberal documentary filmmaker Lauren Windsor's team spoke to the “dirty trickster” of right-wing politics at an event at Mar-a-Lago … In an undercover recording obtained by liberal journalist Lauren Windsor … ",
    "url": "https://www.rollingstone.com/politics/politics-features/roger-stone-plan-trump-win-lawyers-judges-technology-1235041650/"
  },
  {
    "text": "Boeing CEO Calhoun addresses Congress amid new whistleblower claim … - Calhoun's appearance before the Senate Permanent Subcommittee on Investigations came hours after it published new allegations from a current employee. … - At the top of his opening statement, he addressed the families … ",
    "url": "https://www.axios.com/2024/06/18/boeing-senate-testimony-whistleblower"
  },
  {
    "text": "Trump's ‘Wartime Consigliere’ Now Faces Legal Peril of His Own  —  Boris Epshteyn routinely surfaces as a lesser character in Trump-related indictments.  In a case in Arizona on Tuesday, he will be a major figure.  —  Boris Epshteyn, who is scheduled to be arraigned Tuesday … ",
    "url": "https://www.nytimes.com/2024/06/18/us/boris-epshteyn-arizona-trump.html"
  },
  {
    "text": "Secret Service destroyed video of Biden's dog Commander biting agent in brutal attack that forced White House to stop tours so blood could be wiped off the floor  — Commander Biden was banished from the White House for biting agents  — Video of one attack no longer exists, DailyMail.com has learned",
    "url": "https://www.dailymail.co.uk/news/article-13531069/secret-service-destroyed-video-biden-dog-commander-attack.html"
  }
]