[
  {
    "text": "The Republicans Who Sold Their Souls to Vladimir Putin  —  In American politics, a presidential campaign cannot coordinate with its associated political action committee.  The campaign can wink and nod publicly in the press and on its official website, but a direct line of communication is, technically, illegal.",
    "url": "https://newrepublic.com/article/179393/republican-vladimir-putin-2024-shift"
  },
  {
    "text": "In Shinzo's shadow, Japan fears ‘if Trump’  —  Moshi Tora.  That's the compact phrase now spreading like wildfire in Japan.  It means “If Trump,” and is often said with a sense of foreboding.  —  This haiku-like, four-syllable phrase is short for the longer sentence: “What if Trump wins the presidency again?”",
    "url": "https://thehill.com/opinion/white-house/4513866-in-shinzos-shadow-japan-fears-if-trump/"
  },
  {
    "text": "Donald Trump told to pay six-figure costs of firm he sued  —  The former US president's case against a company founded by an ex-MI6 officer was thrown out.",
    "url": "https://www.bbc.com/news/uk-68499543"
  },
  {
    "text": "Navy demoted Ronny Jackson after probe into White House behavior  —  Ronny Jackson, the former White House physician turned GOP congressman, regularly touts his military bona fides.  —  “As a retired U.S. Navy Rear Admiral with nearly three decades of military service I understand the commitment … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/07/ronny-jackson-demotion-white-house-medical-unit-navy/"
  },
  {
    "text": "Exclusive: Biden plans feisty economic reset … - Biden needs a cure for what some advisers call “Trump amnesia” — the notion that the chaos and unpopularity of Trump's presidency has receded from some voters' memories nearly four years on. … - Voters largely understand the contrasts between Trump … ",
    "url": "https://www.axios.com/2024/03/07/state-of-the-union-biden-us-economy"
  },
  {
    "text": "Biden to announce US will build port on Gaza shore for large-scale aid delivery  —  President to make announcement in State of the Union speech while senior US official says ‘We are not waiting on the Israelis’  —  US forces will build a temporary port on the Gaza shoreline in the next few weeks … ",
    "url": "https://www.theguardian.com/world/2024/mar/07/biden-us-port-gaza-aid-delivery"
  },
  {
    "text": "Sweden officially joins NATO, ending decades of post-World War II neutrality  —  Sweden on Thursday formally joined NATO as the 32nd member of the transatlantic military alliance, ending decades of post-World War II neutrality and centuries of broader non-alignment with major powers … ",
    "url": "https://apnews.com/article/sweden-nato-us-russia-ukraine-8372bc866c8ddcf42d2b8209fa5cd2b1"
  },
  {
    "text": "Why is New York Times campaign coverage so bad?  Because that's what the publisher wants.  —  It's an increasingly common critique of the New York Times: The largest, most influential news organization in the nation is not warning sufficiently of the threat to democracy … ",
    "url": "https://presswatchers.org/2024/03/why-is-new-york-times-campaign-coverage-so-bad-because-thats-what-the-publisher-wants/"
  },
  {
    "text": "Charted: Trump world allies sentenced to prison … - He is expected to be sentenced to five months in prison in April. … - Former Trump campaign lawyer Sidney Powell — one of Trump's co-defendants in the sprawling Georgia election subversion case — took a plea deal to testify against co-defendants that helped her avoid prison.",
    "url": "https://www.axios.com/2024/03/07/trump-associates-prison-sentence-crimes-list"
  },
  {
    "text": "Arizona Is on Brink of Charging People Close to Trump Over 2020 Election  —  In the aftermath of the 2020 presidential election, Donald Trump's campaign officials were scrambling to find any means for the election results to work out in his favor, despite being unable to find actual evidence … ",
    "url": "https://newrepublic.com/post/179629/arizona-brink-charging-trump-aides-2020-election"
  },
  {
    "text": "Spate of Mock News Sites With Russian Ties Pop Up in U.S.  —  The fake news organizations, experts say, represent a technological leap in the Kremlin's efforts to spread false and misleading narratives.  —  Into the depleted field of journalism in America, a handful of websites have appeared … ",
    "url": "https://www.nytimes.com/2024/03/07/business/media/russia-us-news-sites.html"
  },
  {
    "text": "How millions in corporate cash could help a radical conspiracy theorist become governor  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  On Tuesday, Mark Robinson (R) won the Republican nomination for Governor of North Carolina.  Robinson, currently North Carolina's lieutenant governor … ",
    "url": "https://popular.info/p/how-millions-in-corporate-cash-could"
  },
  {
    "text": "Steve Bannon's Refusal to Pay His Bills Is Costing Him Big  —  Bannon has refused to pay his legal bills for two years.  Now he and his current lawyer are facing fines over Bannon's refusal to make good on his debts. … For two years, Steve Bannon has refused to pay the half-million dollars he owes his former lawyer.",
    "url": "https://www.thedailybeast.com/steve-bannons-refusal-to-pay-his-bills-is-costing-him-big"
  },
  {
    "text": "Larry Hogan declines to say whether he'd support a federal law to codify Roe v. Wade  —  The Maryland Senate candidate and ex-governor reiterated that he wouldn't vote for a federal abortion ban and said politicians shouldn't be in charge of IVF decisions.  —  Former Maryland Gov. Larry Hogan … ",
    "url": "https://www.nbcnews.com/politics/2024-election/larry-hogan-declines-say-whether-support-federal-law-codify-roe-v-wade-rcna142290"
  },
  {
    "text": "House panel passes measure blocking Biden administration from finalizing nursing home staffing rule  —  The GOP-controlled House Ways & Means Committee on Wednesday passed a bill that would block the Biden administration from implementing rules requiring minimum staffing levels for nursing homes.",
    "url": "https://thehill.com/homenews/house/4516104-house-panel-passes-measure-blocking-biden-administration-from-finalizing-nursing-home-staffing-rule/"
  },
  {
    "text": "Biden to propose new $5,000 tax credit for first-time home buyers  —  The president will also add to earlier pushes to tame rent costs and boost U.S. housing supply  —  President Biden will propose a set of new housing initiatives in Thursday's State of the Union address … ",
    "url": "https://www.washingtonpost.com/business/2024/03/07/biden-housing-sotu/"
  },
  {
    "text": "Missouri's total war on Planned Parenthood  —  Republicans aren't stopping at abortion bans.  —  ∙ Paid  —  Given the sinkhole of conspiracies that is Elon Musk's X, it shouldn't be surprising that Andrew Bailey, Missouri's hard-right attorney general, used the platform to announce … ",
    "url": "https://www.publicnotice.co/p/missouri-planned-parenthood-lawsuit"
  },
  {
    "text": "Barrasso says he's locked down enough votes to become Senate GOP whip  —  Senate Republican Conference Chair John Barrasso (Wyo.) says he has locked down enough votes to become the next Senate Republican whip in 2025.  —  Barrasso, who was often mentioned as a potential candidate … ",
    "url": "https://thehill.com/homenews/senate/4516626-barrasso-says-hes-locked-down-enough-votes-to-become-senate-gop-whip/"
  },
  {
    "text": "Profound Damage Found in Maine Gunman's Brain, Possibly From Blasts  —  A laboratory found a pattern of cell damage that has been seen in veterans exposed to weapons blasts, and said it probably played a role in symptoms the gunman displayed before the shooting.",
    "url": "https://www.nytimes.com/2024/03/06/us/maine-shooting-brain-injury.html"
  }
]