[
  {
    "text": "A chunk of Republican primary and caucus voters say they wouldn't vote for Trump as the GOP nominee  —  A small but substantial chunk of Republican primary and caucus voters say they would be so dissatisfied if Donald Trump became the party's presidential nominee that they would not vote … ",
    "url": "https://apnews.com/article/trump-primary-caucus-republican-voters-general-election-4a64d34b6d74e167cf6b256784c841c0"
  },
  {
    "text": "CBS News poll finds voters remember Trump's economy as good, boosting Trump to national lead over Biden today  —  As Super Tuesday makes an historic rematch all but official, voters are comparing not just two presidents, but two presidencies.  —  And right now former President Donald Trump emerges … ",
    "url": "https://www.cbsnews.com/news/poll-trump-leads-biden-economy/"
  },
  {
    "text": "Trump endorses Mark Robinson for North Carolina governor and compares him to Martin Luther King Jr.  —  Donald Trump has endorsed North Carolina Lt. Gov Mark Robinson for governor, fulfilling a pledge the former president made several months ago.  At a rally Saturday in Greensboro … ",
    "url": "https://apnews.com/article/north-carolina-donald-trump-endorsement-governor-cf9092cc8c10d0f2106aacedc63fd8af"
  },
  {
    "text": "Lisa Murkowski says she ‘could not’ vote for Trump or Biden in 2024  —  The Alaska senator admitted that she also didn't vote for former President Donald Trump in 2020.  —  WASHINGTON — Republican Sen. Lisa Murkowski said Saturday she “could not” vote for former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/lisa-murkowski-says-not-vote-trump-biden-2024-rcna141551"
  },
  {
    "text": "Majority of Biden's 2020 Voters Now Say He's Too Old to Be Effective  —  A New York Times/Siena College poll revealed how much even his supporters worry about his age, intensifying what has become a grave threat to his re-election bid.  —  Widespread concerns about President Biden's age pose … ",
    "url": "https://www.nytimes.com/2024/03/03/us/politics/biden-age-trump-poll.html"
  },
  {
    "text": "Trump warns of ‘languages coming into our country’ that ‘nobody’ has heard of  —  Trump's warnings about words add to a pattern of stoking fear around migrants coming into the United States.  —  Warning about the dangers of illegal immigration at the southern border has long … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-warns-languages-immigration-migrants-rcna141535"
  },
  {
    "text": "A Large Percentage of Republican Primary Voters Can't Stomach Trump  —  New polling analyses indicate what Trump is up against within his own party.  —  Former president Donald Trump easily swept to victory in a handful of additional Republican caucuses this weekend, looking ever more imperious in his bid for the GOP nomination.",
    "url": "https://www.motherjones.com/politics/2024/03/trump-republican-voters-polling-primary/"
  },
  {
    "text": "Florida is swamped by disease outbreaks as quackery replaces science  —  The state is in the grip of a measles outbreak, yet Joseph Ladapo, the surgeon general, continues to ignore medical science to stop it  —  Shortly before Joseph Ladapo was sworn in as Florida's surgeon general in 2022 … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/03/florida-measles-outbreak-preventable"
  },
  {
    "text": "Nikki Haley says she's no longer bound by RNC pledge to endorse Trump if he wins  —  In an interview with “Meet the Press,” Haley dodged, saying, “When you all ask Donald Trump if he would support me, then I will talk about that.”  —  Former U.N. Ambassador Nikki Haley no longer feels bound … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-says-s-no-longer-bound-rnc-pledge-endorse-trump-wins-rcna141518"
  },
  {
    "text": "Brand new report reveals widening voter participation gap due to gutting of Voting Rights Act  —  A new report from the Brennan Center for Justice details the growing racial voter gap as Black voter participation has gone down since the Supreme Court dealt a major blow to the Voting Rights Act in 2013.",
    "url": "https://www.msnbc.com/ali-velshi/watch/brand-new-report-reveals-widening-voter-participation-gap-due-to-gutting-of-voting-rights-act-205361733839"
  },
  {
    "text": "Lauren Boebert doesn't want to lose the House  —  A messy divorce and flagging popularity upended her personal life and threatened her political future.  Can the MAGA Mean Girl start over without changing?  —  WINDSOR, Colo. — On a recent February afternoon, Rep. Lauren Boebert's (R-Colo.) … ",
    "url": "https://www.washingtonpost.com/style/power/2024/03/03/lauren-boebert-reelection/"
  },
  {
    "text": "Moscow's history of unforced errors is the West's hidden advantage  —  In challenging the West, Russia often shoots itself in the foot.  It has done so again with the murder of Alexei Navalny on the cusp of a Ukraine vote in Congress.  —  Moscow's mistakes are so frequent or serious that they substantially weaken Russia's position.",
    "url": "https://thehill.com/opinion/national-security/4501326-moscows-history-of-unforced-errors-is-the-wests-hidden-advantage/"
  },
  {
    "text": "Republican attacks on tenure ramp up in latest battle with higher education  —  Tenure for college professors is the latest front in Republicans' battle with higher education.  —  Since tenure gives a professor job security for decades, undercutting it is one way conservatives … ",
    "url": "https://thehill.com/homenews/education/4498350-republican-attacks-college-tenure-higher-education/"
  },
  {
    "text": "Fani Willis and Nathan Wade Now Facing Trouble With the Georgia State Bar  —  After all the problems regarding Fulton County District Attorney Fani Willis and her former paramour, whom she appointed to be a special prosecutor in the Trump election case, you knew that they were going to be in trouble.",
    "url": "https://redstate.com/nick-arama/2024/03/02/fani-willis-nathan-wade-state-bar-n2170852"
  }
]