[
  {
    "text": "New Marquette Law School Poll national survey finds Harris leading Trump and outperforming Biden against Trump; enthusiasm to vote among Democrats having risen substantially  —  MILWAUKEE - A new Marquette Law School Poll national survey finds Vice President Kamala Harris is the choice … ",
    "url": "https://law.marquette.edu/poll/2024/08/07/mlspsc21-release/"
  },
  {
    "text": "Trump complains about campaign as advisers try to focus on attacking Harris  —  The GOP nominee has grown increasingly upset about Kamala Harris's surging poll numbers and media coverage since replacing Joe Biden on the ticket.  —  Donald Trump's candidacy appeared all but destined for victory only weeks ago.",
    "url": "https://www.washingtonpost.com/politics/2024/08/07/trump-election-campaign/"
  },
  {
    "text": "Why Harris isn't taking questions  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  —  There is a line in the movie “Bull Durham” where CRASH DAVIS, the sage journeyman catcher played by KEVIN COSTNER, tells “NUKE” LaLOOSH … ",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/08/07/why-harris-isnt-taking-questions-00173115"
  },
  {
    "text": "Vibes and Polls and Positioning of the Harris Candidacy  —  Trump campaign staffers may be able to define her if she doesn't beat them to the punch.  —  As I wrote Tuesday, Kamala Harris passed on an opportunity to define herself as a moderate when she selected the progressive favorite Tim Walz … ",
    "url": "https://www.nytimes.com/2024/08/08/upshot/kamala-harris-polls-vibes.html"
  },
  {
    "text": "Presidential Campaign Reset: Arizona, Georgia and Nevada Move From Lean Republican to Toss Up  —  Three weeks ago, Donald Trump was leading President Joe Biden in the Cook Political Report national vote tracker by about 2.5%.  Today, Kamala Harris leads Trump by less than one point … ",
    "url": "https://www.cookpolitical.com/analysis/national/national-politics/presidential-campaign-reset-arizona-georgia-and-nevada-move"
  },
  {
    "text": "J.D. Vance Awkwardly Retreats After Bizarre Attempt to Storm Harris' Empty Plane  —  NO, NOT WEIRD  —  The made-for-TV moment was so weird that it could have been a page taken right out of the script of political TV show “Veep”.  —  J.D. Vance briskly marched up to Air Force 2 … ",
    "url": "https://www.thedailybeast.com/jd-vance-awkwardly-retreats-from-confronting-kamala-harris-on-air-force-2-after-realizing-she-wasnt-around"
  },
  {
    "text": "Polling guru declares which candidate wins 2024 election if it was held today  — Longtime pollster Frank Luntz has winning advice for Trump and Harris  —  Polling guru Frank Luntz revealed on Wednesday which candidate would win if the election was held today and offered winning advice … ",
    "url": "https://www.dailymail.co.uk/news/article-13719861/Polling-harris-trump-win-election.html"
  },
  {
    "text": "‘If you want Donald Trump to win, then say that’: Harris fires back at Gaza protesters at rally  —  Vice President Kamala Harris, the Democratic nominee for president, fired back at pro-Palestinian protesters of Israel's war in Gaza as they interrupted her speech during a Wednesday night campaign rally in Detroit.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/07/harris-to-protesters-if-you-want-donald-trump-to-win-then-say-that/74714086007/"
  },
  {
    "text": "Tim Walz's normal dad energy is causing MAGA to come unglued  —  Walz is the opposite of weird: Kamala Harris' running mate shows masculinity can be about love and not hate  —  In their first go-round in attacking Gov. Tim Walz, the Donald Trump campaign bet that maximum hyperbole … ",
    "url": "https://www.salon.com/2024/08/08/tim-walzs-normal-energy-is-causing-maga-to-come-unglued/"
  },
  {
    "text": "BREAKING: The New York Times helps JD Vance Swiftboat Tim Walz  —  Tim Walz “enlisted Army National Guard in Nebraska in 1981 and retired honorably in 2005,” according to his military records.  Months after Tim Walz retired from the Army National Guard in 2005, his unit received orders to deploy to Iraq.",
    "url": "https://www.findinggravity.net/p/breaking-the-new-york-times-helps"
  },
  {
    "text": "Vance reopens line of attack into Walz's military record as two veterans now vie to be vice president  —  Donald Trump's running mate Ohio Sen. JD Vance stepped up his attacks on Minnesota Gov. Tim Walz's portrayal of his military career, accusing him of ducking service in Iraq when he left … ",
    "url": "https://www.cnn.com/2024/08/07/politics/tim-walz-military-record-vance-attack"
  },
  {
    "text": "Why Trump's Plan to Brand Walz as Too Liberal Will Fail  —  Good luck turning the gun-owning, football coach into a member of the Squad.  —  For the second time this month, Republicans were absolutely flummoxed by an entirely predictable outcome.  First, they had no plan or message … ",
    "url": "https://www.messageboxnews.com/p/why-trumps-plan-to-brand-walz-as"
  },
  {
    "text": "Biden “not confident” Trump will accept 2024 election results  —  President Biden said he is “not confident at all” that there will be a peaceful transfer of power in January 2025 if former President Donald Trump is defeated.  —  “He means what he says.  We don't take him seriously.  He means it.",
    "url": "https://www.cbsnews.com/news/biden-on-dropping-out-2024-race-donald-trump-cbs-sunday-morning-exclusive-interview/"
  },
  {
    "text": "Elon Musk shares fake news claiming UK rioters will be sent to ‘detainment camps’  —  LONDON — Elon Musk is at it again.  —  Amid an ongoing feud with the British government about unrest on the country's streets, the billionaire X owner boosted, and then deleted, an entirely-manufactured … ",
    "url": "https://www.politico.eu/article/elon-musk-share-fake-news-uk-rioters-detainment-camp/"
  },
  {
    "text": "Steve Martin turns down Walz role on ‘SNL’: 'I'm not an impressionist'  —  Comedian and actor Steve Martin has reportedly turned down the role of Minnesota Gov. Tim Walz (D) on “Saturday Night Live” (SNL).  —  Martin, according to the Los Angeles Times, was reached out to by the show's executive producer … ",
    "url": "https://thehill.com/blogs/in-the-know/4818107-steve-martin-tim-walz-saturday-night-live-role/"
  },
  {
    "text": "‘I think this settles it’: Vance busted over resurfaced post jabbing ‘undisputed war hero’  —  A two-year-old social media post written by Sen. J.D. Vance (R-OH) resurfaced on Wednesday, and it's not helping his campaign for vice president.  —  During his candidacy for the Senate in 2022 … ",
    "url": "https://www.rawstory.com/news/j-d-vance-2668920972/"
  },
  {
    "text": "Chutkan in charge: Judge ignites flurry of activity in Trump Jan. 6 case  —  The return of Donald Trump's Jan. 6 prosecution to District Court Judge Tanya Chutkan has ignited a flurry of activity in the once-dormant case, reviving a high stakes court battle after a series of legal wins for the former president.",
    "url": "https://thehill.com/policy/national-security/4816762-chutkan-judge-trump-jan-6-case/"
  },
  {
    "text": "Tim Walz's Sudden Rise in the Democratic Party Was No Accident  —  More than a year ago, Tim Walz and his aides decided to be ready in case an irresistible opportunity arose.  Their tightly held strategy helped them catch political lightning in a bottle.  —  Shortly after the 2022 midterms … ",
    "url": "https://www.nytimes.com/2024/08/07/us/politics/tim-walz-kamala-harris-2024.html"
  }
]