[
  {
    "text": "Disaster for Trump as Truth Social Crashes at Critical SOTU Moment  —  The former president heavily promoted his live reactions prior to President Joe Biden's SOTU speech.  But when it came time, Trump's promises crashed and burned.  —  Donald Trump may have rage-posted … ",
    "url": "https://www.thedailybeast.com/disaster-for-trump-as-truth-social-crashes-at-critical-sotu-moment"
  },
  {
    "text": "Truth Social Suffers Outage in Middle of Trump's Furious Live-Tweeting About Biden Speech  —  “THE DRUGS ARE WEARING OFF!”  Trump wrote without any further context, making it's unclear if he was talking about Biden or himself.  —  Truth Social, the social media platform launched by Donald Trump in 2022 … ",
    "url": "https://gizmodo.com/truth-social-down-outage-trump-biden-state-of-the-union-1851318732"
  },
  {
    "text": "Biden hits the campaign trail after State of the Union address  —  The president will travel to at least four states in a week, with stops in Pennsylvania, Georgia, New Hampshire and Michigan  —  President Biden will travel to at least four states in a week on the heels of his State of the Union address … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/08/biden-campaign-state-of-the-union/"
  },
  {
    "text": "The biggest moments from Biden's 2024 State of the Union address  —  President Biden delivered an aggressive State of the Union speech Thursday night in which he drew sharp contrasts with former president Donald Trump and Republicans in Congress.  —  Biden made reference to “my predecessor” … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/07/state-of-the-union-highlights-2024/"
  },
  {
    "text": "Trump loses bid to delay $83.3 million E. Jean Carroll defamation judgment  — Donald Trump lost a bid to delay paying an $83.3 million civil defamation judgment to writer E. Jean Carroll.  — Trump had asked Manhattan federal Judge Lewis Kaplan to delay the judgment from taking effect until … ",
    "url": "https://www.cnbc.com/2024/03/07/trump-loses-bid-to-delay-83point3-million-e-jean-carroll-judgment.html"
  },
  {
    "text": "Trump is ordered to pay legal fees after failed lawsuit over the Steele dossier  —  Former U.S. President Donald Trump has been ordered to pay legal fees to a company founded by a former British spy that he sued for making what he claimed were false claims that harmed his reputation",
    "url": "https://abcnews.go.com/International/wireStory/trump-ordered-pay-legal-fees-after-failed-lawsuit-107891658"
  },
  {
    "text": "Trump's Money Problems Are Very Real and Very Bad  —  His political fortunes may be looking up, but his business problems are dire.  —  The danger posed to Donald Trump's finances by two recent judgments against him has been, if anything, underappreciated.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/03/trump-financial-legal-troubles/677662/"
  },
  {
    "text": "The Case Trump Really Hates  —  Prosecutors want to present steamy details at the hush money trial.  —  For the past couple of weeks, the spotlight has been focused on the timing of Donald Trump's four criminal trials and the prospect that at least two of them might not go to a jury before this fall's election.",
    "url": "https://www.nytimes.com/2024/03/07/us/politics/trump-trial-hush-money-stormy-daniels.html"
  },
  {
    "text": "Official GOP Response to SOTU Has Republicans ‘Losing It’  —  Sen. Katie Britt of Alabama gave the GOP response to President Biden's annual address—which got panned by some in her own party.  —  As President Joe Biden mingled on the House floor following his State of the Union address Thursday night … ",
    "url": "https://www.thedailybeast.com/official-katie-britt-gop-response-to-state-of-the-union-has-republicans-losing-it"
  },
  {
    "text": "Biden electrifies Democrats, spars with Republicans in fiery State of the Union address  — President Joe Biden delivered a fiery, partisan State of the Union address fit for an election year.  — When Republicans booed a bipartisan immigration security bill, “Oh, you don't think so?",
    "url": "https://www.cnbc.com/2024/03/07/biden-state-of-the-union-address-to-lay-out-economic-vision-.html"
  },
  {
    "text": "Remarks of President Joe Biden — State of the Union Address As Prepared for Delivery  —  Good evening.  —  Mr. Speaker.  Madam Vice President.  Members of Congress.  My Fellow Americans.  —  In January 1941, President Franklin Roosevelt came to this chamber to speak to the nation.",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2024/03/07/remarks-of-president-joe-biden-state-of-the-union-address-as-prepared-for-delivery-2/"
  },
  {
    "text": "Indicted Serial Liar George Santos Announces New Run for Congress During State of the Union  —  In typically dramatic fashion, Santos announced his run while President Joe Biden delivered his State of the Union speech.  —  Three months after former Rep. George Santos' colleagues expelled … ",
    "url": "https://www.thedailybeast.com/indicted-serial-liar-george-santos-announces-new-run-for-congress-during-state-of-the-union"
  },
  {
    "text": "Navy demoted Ronny Jackson in 2022 after scathing watchdog report  —  The Navy demoted Rep. Ronny Jackson in 2022 after a scathing report from the Defense Department watchdog found the former White House physician drank on the job, routinely screamed at subordinates and acted inappropriately.",
    "url": "https://www.cnn.com/2024/03/07/politics/navy-demoted-ronny-jackson"
  },
  {
    "text": "GOP Rep. Michelle Steel rescinds her co-sponsorship of the Life at Conception Act after winning her primary  —  Steel says she supports IVF, which the bill could threaten.  She has put forward a nonbinding resolution backing IVF but has not signed on to a bill offering legal protection for it.",
    "url": "https://www.nbcnews.com/politics/congress/gop-rep-michelle-steel-rescinds-cosponsorship-life-conception-act-rcna142285"
  },
  {
    "text": "Mar-a-Lago V.P. Soul-Searching  —  While many think Trump will select his vice president based on their appeal to voters, the emerging consensus among campaign insiders is that his choice will come down to who can perform best with wealthy donors—his greatest vulnerability.",
    "url": "https://puck.news/mar-a-lago-v-p-soul-searching/"
  },
  {
    "text": "Donald Trump told to pay six-figure costs of firm he sued  —  The former US president's case against a company founded by an ex-MI6 officer was thrown out.",
    "url": "https://www.bbc.com/news/uk-68499543"
  },
  {
    "text": "Stop Murders, Fight Drugs, Raise Taxes: Why Ecuador Loves Daniel Noboa  —  Since taking office in November, the 36-year-old president has declared war on cocaine cartels while also battling to prevent a financial meltdown  —  It's the kind of opportunity most leaders can hardly fathom … ",
    "url": "https://www.bloomberg.com/news/features/2024-03-08/ecuador-president-daniel-noboa-raises-taxes-to-fight-drug-cartels"
  },
  {
    "text": "Why is New York Times campaign coverage so bad?  Because that's what the publisher wants.  —  It's an increasingly common critique of the New York Times: The largest, most influential news organization in the nation is not warning sufficiently of the threat to democracy … ",
    "url": "https://presswatchers.org/2024/03/why-is-new-york-times-campaign-coverage-so-bad-because-thats-what-the-publisher-wants/"
  },
  {
    "text": "Father of Marine Killed in Afghanistan Is Arrested During Biden's Address  —  Steve Nikoui yelled “Abbey Gate, Abbey Gate” during the speech, a reference to where his son, Lance Cpl. Kareem Nikoui, and 12 other troops were killed during the chaotic final days of the U.S. presence in Kabul.",
    "url": "https://www.nytimes.com/2024/03/08/us/politics/abbey-gate-yelling-state-of-union.html"
  },
  {
    "text": "Thune on Ukraine: ‘America cannot retreat from the world stage’  —  Sen. John Thune (R-S.D.) pressed the House on Thursday to pass a Ukraine aid bill, as he launches a campaign to replace outgoing Senate GOP Leader Mitch McConnell (Ky.).  —  “I think that the challenge, of course, right now … ",
    "url": "https://thehill.com/homenews/senate/4517922-thune-on-ukraine-america-cannot-retreat-from-the-world-stage/"
  },
  {
    "text": "Stormy Daniels alleges in new documentary that Donald Trump cornered her the night they met  —  Stormy Daniels goes into new detail in a documentary about her alleged 2006 sexual encounter with former President Trump, saying she was cornered by him in his hotel room the night they met and that she blames herself for not stopping him.",
    "url": "https://www.latimes.com/entertainment-arts/tv/story/2024-03-07/stormy-documentary-donald-trump-peacock"
  }
]