[
  {
    "text": "Nikki Haley Refuses to Say a Man Cannot Become a Woman During Campaign Event  —  The Iowa Caucus is just hours away and social issues seem to be top of mind for at least some voters in the Hawkeye State.  —  Extreme weather conditions in Iowa limited the 2024 GOP hopefuls to mostly virtual events … ",
    "url": "https://www.megynkelly.com/2024/01/15/nikki-haley-can-a-man-become-a-woman-iowa/"
  },
  {
    "text": "Iowa caucus 2024 live updates: Process kicks off as Haley, Trump and others seek GOP delegates  —  The latest news and updates on the Iowa caucuses:  — Iowa Republican caucuses began at 7 p.m. CT, officially kicking off the party's presidential nominating process.  Follow live results here.",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/iowa-election-2024-live-updates-rcna133678#rcrd30888"
  },
  {
    "text": "Election 2024: Iowa caucuses will test Trump's grip on Republican politics  —  Donald Trump's rally was briefly interrupted by protesters in Iowa Sunday— the first time it's happened in years.  “You've taken millions!” a woman shouted as Trump was mid-rally, prompting the crowd to respond with a “Trump!” chant to drown her out.",
    "url": "https://apnews.com/article/trump-iowa-caucus-haley-desantis-cold-voting-begins-0af10f1ba21d488af54776b2c8d4028c"
  },
  {
    "text": "Trump says he is ‘honored,’ ‘invigorated’ after winning Iowa caucuses: ‘We want to Make America Great Again’  —  EXCLUSIVE: Former President Trump said he feels “invigorated” and “greatly honored” after winning the 2024 Iowa caucuses, telling Fox News Digital that he feels “strong” for our country.",
    "url": "https://www.foxnews.com/politics/trump-says-he-is-honored-invigorated-after-winning-iowa-caucuses-make-america-great-again"
  },
  {
    "text": "Key Trump Lawyer Withdraws as Manhattan Criminal Trial Nears  —  Joseph Tacopina brought extensive experience with high-profile cases to former president Donald J. Trump's legal team.  —  Joseph Tacopina, the trial lawyer on Donald J. Trump's legal team with the most successes defending high-profile clients … ",
    "url": "https://www.nytimes.com/2024/01/15/us/politics/tacopina-trump-lawyer.html"
  },
  {
    "text": "Trump lawyer Joe Tacopina withdraws from ex-president's cases  —  Joe Tacopina, one of former President Trump's New York trial lawyers who is known for representing high-profile clients, is withdrawing from Trump's cases.  —  Tacopina had represented Trump in both his criminal hush money case … ",
    "url": "https://thehill.com/regulation/court-battles/4409344-trump-lawyer-joe-tacopina-withdraws-from-ex-presidents-cases/"
  },
  {
    "text": "Ann Coulter Breaks Down Why Trump Can't Beat Biden and ‘Trump Voters Are Morons’  —  Conservative pundit Ann Coulter expressed her frustration with Republican Trump voters over the weekend and made the case for why she doesn't believe the former president can beat President Joe Biden in a general election.",
    "url": "https://www.mediaite.com/politics/ann-coulter-breaks-down-why-trump-cant-beat-biden-and-trump-voters-are-morons/"
  },
  {
    "text": "Courting the Kook Vote in Iowa, Vivek Draws the Ire of Trump  —  Ramaswamy is fourth in the polls, but top-of-mind for the former president.  —  ANKENY, Iowa—Vivek Ramaswamy was just going through his implausible plan for firing 75 percent of the federal workforce—\"the first four agencies we're … ",
    "url": "https://thedispatch.com/article/courting-the-kook-vote-in-iowa-vivek-draws-the-ire-of-trump/"
  },
  {
    "text": "Vivek Ramaswamy Crosses Trump Just in Time for Iowa Caucus  —  Trump and his team finally recognized the grandest conspiracy of all: If you were trying to steal votes directly from Trump, you'd run a campaign like Ramaswamy.  —  URBANDALE, Iowa—Before talking to a crowd of Iowa retirees … ",
    "url": "https://www.thedailybeast.com/vivek-ramaswamy-crosses-trump-just-in-time-for-iowa-caucus"
  },
  {
    "text": "Nota Bene  —  Keep an eye on how the national press covers this.  The White House, as you know, has been under immense pressure to offer concessions to address the continuing large number of migrants coming to the US-Mexico border.  Now there's a bipartisan compromise bill in the Senate.",
    "url": "https://talkingpointsmemo.com/edblog/nota-bene-7"
  },
  {
    "text": "Explosions reported near US Consulate in Iraq; Iran claims responsibility  —  Iran's Revolutionary Guard claimed it was targeting “the headquarters of spies.”  —  This is a breaking news story please check back for updates.  —  Several explosions were reported near the U.S. Consulate in Erbil … ",
    "url": "https://abcnews.go.com/International/explosions-reported-us-consulate-iraq-iran-claims-responsibility/story?id=106390671"
  },
  {
    "text": "Iran's Guards attack ‘espionage centers’ in Iraq's Erbil - state media  —  Iran's Revolutionary Guards said they attacked espionage centers and “gatherings of anti-Iranian terrorist groups” near Iraq's northern city of Erbil with ballistic missiles, Iranian state media said late on Monday.",
    "url": "https://www.reuters.com/world/middle-east/irans-revolutionary-guards-say-they-have-attacked-espionage-centers-iraqs-erbil-2024-01-15/"
  },
  {
    "text": "FBI's MLK Jr. Tweet Gets Truly Epic Community Note … LOADING",
    "url": "https://www.huffpost.com/entry/fbi-mlk-tweet-community-note_n_65a5bc5ae4b01a497bab5d2d"
  },
  {
    "text": "The Baltimore Sun purchased by Sinclair's David D. Smith  —  The Baltimore Sun, the largest newspaper in Maryland, has been acquired in a private deal by David D. Smith, executive chairman of Hunt Valley-based television station owner Sinclair Inc.  —  Smith said Monday that he acquired Baltimore Sun Media … ",
    "url": "https://www.baltimoresun.com/2024/01/15/baltimore-sun-media-sold-david-d-smith/"
  },
  {
    "text": "A person called 911 falsely reporting a fire at the White House in apparent ‘swatting’ event  —  President Joe Biden was at Camp David when the call to 911 was made early Monday morning.  —  WASHINGTON — A person called 911 Monday morning falsely claiming that there was a fire at the White House and that someone was trapped inside.",
    "url": "https://www.nbcnews.com/politics/white-house/person-called-911-falsely-reporting-fire-white-house-apparent-swatting-rcna133964"
  },
  {
    "text": "DeSantis Has Enough Cash to Sustain 2024 Bid Into March, Adviser Says  — Roy Bailey predicts DeSantis will ‘shock’ the world in Iowa  — DeSantis team is seeking to quell worries about fundraising  —  Ron DeSantis has enough cash to sustain his 2024 US presidential bid past Monday's … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-15/desantis-has-cash-to-sustain-2024-bid-into-march-adviser-says"
  },
  {
    "text": "Dean Phillips floats a Cabinet post for Musk or Ackman  —  The representative spoke with the tech giant and his allies on a forum Monday night.  —  In a forum with Elon Musk on Monday afternoon, Democratic presidential primary challenger Dean Phillips floated a possible Cabinet post for the billionaire and his tech allies.",
    "url": "https://www.politico.com/news/2024/01/15/dean-phillips-floats-a-cabinet-post-for-musk-or-ackman-00135640"
  },
  {
    "text": "Secretary of Defense Lloyd J. Austin III Released From Hospital  —  Following consultation with medical staff, Secretary Austin was released from Walter Reed National Military Medical Center today.  —  The Secretary continues to recover well and, on the advice of doctors … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3645144/secretary-of-defense-lloyd-j-austin-iii-released-from-hospital/"
  }
]