[
  {
    "text": "‘Dead heat’: Trump pulls even with Harris in NBC News poll  —  A close election has never looked more tightly divided, with Harris' popularity declining from its previous high and abortion atop voters' issue list.  —  Former President Donald Trump and Vice President Kamala Harris are deadlocked … ",
    "url": "https://www.nbcnews.com/politics/2024-election/dead-heat-trump-pulls-even-harris-nbc-news-poll-rcna174201"
  },
  {
    "text": "Normie Republicans Are Having Their Revenge on Kari Lake  —  As Lake faces down a combative history with her own party, her Democratic opponent, Ruben Gallego, is betting that Arizonans don't trust Lake and want their abortion rights back.  —  Kari Lake took the stage before former President Donald Trump … ",
    "url": "https://www.politico.com/news/magazine/2024/10/13/kari-lake-abortion-trump-arizona-00183464"
  },
  {
    "text": "Economic discontent, issue divisions add up to tight presidential contest: POLL  —  Harris has 50% support to Trump's 48% among likely voters, the poll finds.  —  Republican presidential nominee former President Donald Trump, left, and Democratic presidential nominee Vice President Kamala Harris during … ",
    "url": "https://abcnews.go.com/Politics/economic-discontent-issue-divisions-add-tight-presidential-contest/story?id=114723390"
  },
  {
    "text": "CBS News Trump-Harris poll shows one election, two worlds: How information, beliefs shape tight campaign  —  The 2024 presidential contest between Kamala Harris and Donald Trump is more than just two ideologies competing over what should happen.  It's two groups of voters that look … ",
    "url": "https://www.cbsnews.com/news/trump-harris-poll-how-information-beliefs-shape-tight-2024-campaign/"
  },
  {
    "text": "Cheney does “not have faith” Mike Johnson will certify election … - Cheney pointed to Johnson spearheading an amicus brief in 2020 that argued for nullifying President Biden's victories in several key states.  — “The claims of fraud Donald Trump was making [in 2020] ... he knew those to be false,” she said.",
    "url": "https://www.axios.com/2024/10/13/liz-cheney-mike-johnson-kamala-harris"
  },
  {
    "text": "Liz Cheney issues dire warning about ‘fundamentally cruel’ Trump, agrees he's a ‘fascist’  —  The former GOP representative from Wyoming said Vice President Kamala Harris, if elected, “will lead with a sincere heart” as “someone who's dedicated her life to public service.”",
    "url": "https://www.nbcnews.com/politics/2024-election/liz-cheney-issues-dire-warning-fundamentally-cruel-trump-agrees-s-fasc-rcna175193"
  },
  {
    "text": "Trump Wants the Military to Target Americans Who Oppose Him  —  The former president said he thinks U.S. troops should be deployed “if necessary” against “radical left lunatics” on election day  —  Donald Trump proposed deploying military forces against U.S. citizens who oppose him on election day.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-military-target-americans-oppose-him-1235132806/"
  },
  {
    "text": "Trump Thinks the Military Should Handle Citizens Who Disagree With Him  —  UNPRECEDENTED  —  The former president claimed the biggest problem on Election Day was “the enemy from within,” or “radical left liberals.”  —  Donald Trump suggested the U.S. military should be used on citizens … ",
    "url": "https://www.thedailybeast.com/trump-thinks-the-military-should-handle-citizens-who-disagree-with-him"
  },
  {
    "text": "Trump Leaves Door Open to National Abortion Ban  —  'WE'LL SEE'  —  The Republican presidential candidate also praised his appointed justices who overturned Roe v Wade.  —  Donald Trump told Fox News' Maria Bartiromo that a national abortion ban would be “off the table” if he were elected president … ",
    "url": "https://www.thedailybeast.com/trump-leaves-door-open-to-national-abortion-ban"
  },
  {
    "text": "About those New York Times headlines  —  Twitter, which is what I prefer to call Elon Musk's disaster, is still interesting and useful at times, despite its decay.  —  And the other day, there was a dustup there over two New York Times headlines.  One was about Kamala Harris, the other about Donald Trump.",
    "url": "https://margaretsullivan.substack.com/p/about-those-new-york-times-headlines"
  },
  {
    "text": "‘Totally illegal’: Trump escalates rhetoric on outlawing political dissent and criticism  —  “This is out of the autocratic playbook.  As autocrats consolidate their power once they're in office, anything that threatens their power ... becomes illegal,” historian Ruth Ben-Ghiat said.",
    "url": "https://www.nbcnews.com/politics/2024-election/totally-illegal-trump-escalates-rhetoric-outlawing-political-dissent-c-rcna174280"
  },
  {
    "text": "Inside Jim Justice's alleged attendance problems — that could be a problem for a GOP Senate  —  The Senate GOP has a strong chance at winning a narrow majority next year, and a frequently absent Republican could be a liability.  —  Jim Justice will almost certainly be West Virginia's next senator.",
    "url": "https://www.politico.com/news/2024/10/13/jim-justices-attendance-problems-00183523"
  },
  {
    "text": "Moreno's abortion comment rattles debate in expensive Senate race in Republican-leaning Ohio  —  An off-the-cuff comment about reproductive rights by Republican Bernie Moreno in Ohio's tight Senate race has put abortion at the center of debate in the most expensive Senate campaign this year.",
    "url": "https://apnews.com/article/election-2024-senate-ohio-moreno-brown-abortion-2771a833403d1a29db295d50cc307a7e"
  },
  {
    "text": "‘Nitpicking Everything’: JD Vance Fumes as ABC News Host Calls Out Bogus Claims About Colorado City  —  NOT TODAY  —  JD Vance tried to latch onto specific words to mount his defense of Trump's attacks on a Colorado city.  Martha Raddatz wouldn't have it.",
    "url": "https://www.thedailybeast.com/jd-vance-fumes-as-abc-news-host-calls-out-bogus-claims-about-colorado-city"
  },
  {
    "text": "US to deploy about 100 troops to operate advanced anti-missile system in Israel amid heightened tensions  —  The US will send an advanced anti-missile system — and US troops to operate it — to Israel “to help bolster Israel's air defenses following Iran's unprecedented attacks against Israel … ",
    "url": "https://www.cnn.com/2024/10/13/politics/israel-iran-antimissile-system-us-troops/"
  },
  {
    "text": "Machine for Fascism: The Two Stephens  —  When I saw the news that Trump is planning a rally at Madison Square Garden — as the Nazis did in 1939 — I checked the date to see whether that was before or after Steve Bannon gets out of prison.  —  Bannon is due to get out on October 29; the rally is two days earlier, on October 27.",
    "url": "https://www.emptywheel.net/2024/10/13/machine-for-fascism-the-two-stephens/"
  },
  {
    "text": "Why conservative lawyers ‘cannot defensibly assist’ Trump in efforts to subvert election: legal expert  —  With less than 30 days until the presidential election, Donald Trump is expected to take legal action in the case he's defeated by Kamala Harris — as he did in 2020.",
    "url": "https://www.alternet.org/lawyers-trump-subvert-election/"
  },
  {
    "text": "Press Breaks Record For Worst Week of Coverage Ever  —  5 more corporate media fails  —  Welcome to our 10th edition of Corporate Media Fails.  Having done this for nine weeks now, I thought the Press couldn't surprise me anymore.  I was wrong.  —  After a long debate … ",
    "url": "https://www.dworkinsubstack.com/p/press-breaks-record-for-worst-week"
  },
  {
    "text": "Trump suggests heckler should ‘get the hell knocked out of her’ after rally  —  The remarks were part of a dark speech at a California rally where Trump called the U.S. an “occupied country.”  —  COACHELLA, Calif- Former president Donald Trump suggested that a heckler would later get … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/12/trump-heckler-violence/"
  },
  {
    "text": "Mystery Drones Swarmed a U.S. Military Base for 17 Days.  The Pentagon Is Stumped.  —  U.S. officials don't know who is behind the drones that have flown unhindered over sensitive national-security sites—or how to stop them",
    "url": "https://www.wsj.com/politics/national-security/drones-military-pentagon-defense-331871f4"
  },
  {
    "text": "White Evangelicals Must Lose in November  —  A desperate plea from a former pastor who knows what's coming  —  Audio playback is not supported on your browser.  Please upgrade.  —  I'm not sure Americans really understand what this nation will look like in a few short months if Donald Trump wins this election.",
    "url": "https://johnpavlovitz.substack.com/p/white-evangelicals-must-lose-in-november"
  },
  {
    "text": "Netanyahu mulls plan to empty northern Gaza of civilians and cut off aid to those left inside  —  Israeli Prime Minister Benjamin Netanyahu is examining a plan to seal off humanitarian aid to northern Gaza in an attempt to starve out Hamas militants, a plan that, if implemented … ",
    "url": "https://apnews.com/article/hamas-israel-generals-plan-eiland-gaza-219d7eb9a3050e281ccc032d5a56263c"
  },
  {
    "text": "Johnson says hurricane aid “can wait” until after House recess … - The Federal Emergency Management Agency has said it has enough funds to manage recovery operations for now, though it is expected to need additional funds in the long term.  — President Biden also warned congressional leaders earlier … ",
    "url": "https://www.axios.com/2024/10/13/mike-johnson-hurricane-aid-milton-helene"
  },
  {
    "text": "Colorado's Elections Chief Took on Trump.  She Needed Extra Security As She Gave Birth  —  Jena Griswold, Colorado's secretary of state, can say with certainty: “The MAGA threat environment follows us through every step of life” … They had gone through unsuccessful IVF treatments … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-jena-griswold-colorado-elections-security-birth-1235132716/"
  }
]