[
  {
    "text": "'It's a mess': Biden turns to family on his path forward after his disastrous debate  —  Democratic leaders have stood by the president as he faces questions about his ability to defeat Trump in November.  But privately, many are expressing concern.  —  WASHINGTON — President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-family-path-forward-disastrous-debate-mess-rcna159591"
  },
  {
    "text": "Increasing numbers of voters don't think Biden should be running after debate with Trump — CBS News poll  —  For months before the first debate, the nation's voters repeatedly expressed doubts over whether President Biden had the cognitive health enough to serve.",
    "url": "https://www.cbsnews.com/news/poll-debate-should-biden-be-running-mental-abilities/"
  },
  {
    "text": "Behind the Curtain: What scares Democrats most … A Democratic official talked us through the gentle approach to getting Biden to end his run on his terms.  This official, who demanded anonymity for self-evident reasons, said Biden's sister, Valerie Biden, and longtime friend, Ted Kaufman, should make this case to the president:",
    "url": "https://www.axios.com/2024/06/30/biden-age-debate-disaster-democrats"
  },
  {
    "text": "The Reckoning of Joe Biden  —  For the President to insist on remaining the Democratic candidate would be an act not only of self-delusion but of national endangerment.  —  There is an immense bounty of bunk about the wisdom of age available to all of us who require it from time to time … ",
    "url": "https://www.newyorker.com/news/daily-comment/the-reckoning-of-joe-biden"
  },
  {
    "text": "Biden campaign argues president dropping out would ‘lead to weeks of chaos’  —  The president has spent Friday and Saturday fundraising, vowing to fight harder.  —  President Joe Biden participates in the CNN Presidential Debate, June 27, 2024, in Atlanta.",
    "url": "https://abcnews.go.com/Politics/biden-campaign-argues-president-dropping-lead-weeks-chaos/story?id=111552401"
  },
  {
    "text": "48 Hours to Fix a 90-Minute Mess: Inside the Biden Camp's Post-Debate Frenzy  —  With countless calls and a rush of campaign events, the president's team began a damage-control effort to pressure and plead with anxious Democratic lawmakers, surrogates, activists and donors.",
    "url": "https://www.nytimes.com/2024/06/30/us/politics/biden-campaign-debate-scramble.html"
  },
  {
    "text": "Pelosi on Democrats calling for Biden to step down: 'I'm not doing it'  —  Former House Speaker Nancy Pelosi (D-Calif.) said she isn't calling for President Biden to step down when asked about calls from Democrats for the president to do so in the wake of his negatively-reviewed presidential debate performance.",
    "url": "https://thehill.com/homenews/house/4747966-nancy-pelosi-democrats-joe-biden-drop-out/"
  },
  {
    "text": "‘Mental Masturbation’: Trump Camp Dismisses Dem Talk of Shoving Biden Aside  —  JOE BIDEN HAS NO PLANS TO QUIT the presidential race.  Nor does Donald Trump's campaign expect him to.  —  Amid the fallout from the president's dire performance in Thursday night's debate … ",
    "url": "https://www.thebulwark.com/p/trump-camp-dismisses-dem-talk-biden-debate"
  },
  {
    "text": "To serve his country, Donald Trump should leave the raceBoard  —  President Joe Biden's debate performance was a disaster.  His disjointed responses and dazed look sparked calls for him to drop out of the presidential race.But lost in the hand wringing was Donald Trump's usual bombastic litany of lies … ",
    "url": "https://www.inquirer.com/opinion/editorials/first-presidential-debate-joe-biden-donald-trump-withdraw-20240629.html"
  },
  {
    "text": "Biden aides plotted debate strategy for months.  Then it all collapsed.  —  The Biden team gambled on an early debate and prepared intensively at Camp David, but they could not prevent their candidate's stumbles onstage.  —  CAMP DAVID, Md. — President Biden's debate prep went fine.",
    "url": "https://www.washingtonpost.com/politics/2024/06/30/how-biden-debate-prep-led-to-damaging-event/"
  },
  {
    "text": "The Pride March Doesn't Have a Place for Me  —  I've been marching in Pride parades since 1995, but I won't be marching this year in New York, where I live.  —  Pride Month has always been about a political and progressive embrace of our rainbow of choices.",
    "url": "https://www.nytimes.com/2024/06/30/opinion/pride-march-lgbtq-gaza.html"
  },
  {
    "text": "The “Wow, Pictures!”  Tabloid Coverage of Trump's Stolen Documents Is as Bad as Conspiracy Mongering  —  The other day, I mined the documents and photographs released in the government's response to Trump's bid to throw out his indictment based on a complaint that the FBI failed to preserve the order of documents in boxes.",
    "url": "https://www.emptywheel.net/2024/06/30/the-wow-pictures-tabloid-coverage-of-trumps-stolen-documents-is-as-bad-as-conspiracy-mongering/"
  },
  {
    "text": "How will Louisiana's new Ten Commandments classroom requirement be funded and enforced?  —  Even as a legal challenge is already underway over a new Louisiana law requiring the Ten Commandments to be displayed in classrooms, the details of how the mandate will be implemented and enforced remain murky.",
    "url": "https://apnews.com/article/louisiana-ten-commandments-class-school-25207ca74c0656563c171c1c8ed921b4"
  },
  {
    "text": "To Woo Trump, VP Contenders Show Off Their Rich Friends  —  Vice-presidential hopefuls are posturing as part of a bid to highlight their ties to wealthy donors.  —  During his 2016 campaign, Donald J. Trump orchestrated a takeover of the Republican Party in part by blasting wealthy political donors … ",
    "url": "https://www.nytimes.com/2024/06/30/us/politics/trump-vice-president-donors.html"
  }
]