[
  {
    "text": "Trump supporters try to doxx jurors and post violent threats after his conviction  —  On social media and web forums, users called for jurors, judges and prosecutors to be killed after the former president was found guilty on 34 felony counts.  —  WASHINGTON — The 34 felony guilty verdicts returned Thursday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-supporters-try-doxx-jurors-violent-threats-conviction-rcna154882"
  },
  {
    "text": "Debunking misinformation about Donald Trump's conviction in hush money trial |  Fact check  —  The first felony conviction of a former U.S. president has spawned a lot of discussion that strays from reality.  —  A jury found former President Donald Trump guilty of 34 charges … ",
    "url": "https://www.usatoday.com/story/news/factcheck/2024/05/31/donald-trump-guilty-verdict-fact-check/73923265007/"
  },
  {
    "text": "Prosecutors Got Trump — But They Contorted the Law  —  The first time I ever took a jury verdict, I almost passed out.  I was a brand-new prosecutor, 29 years old, and had just given my first closing argument a few days earlier.  Since then, the trial team and I had been whiling away our time … ",
    "url": "https://nymag.com/intelligencer/article/trump-was-convicted-but-prosecutors-contorted-the-law.html"
  },
  {
    "text": "Trump's Conviction Clarifies Things  —  IT IS NOW A LEGAL FACT that Donald Trump criminally falsified business records 34 times to cover up his attempt to hide an extramarital sexual affair.  He is a convicted felon.  —  On its own, this would be one of the biggest scandals in presidential history.",
    "url": "https://www.thebulwark.com/p/trumps-conviction-clarifies-things"
  },
  {
    "text": "Statement on the Passing of Mrs. Marian Robinson from Barack and Michelle Obama, Craig and Kelly Robinson, and their children  —  Marian Lois Shields Robinson — our mother, mother-in-law, and grandmother — had a way of summing up the truths about life in a word or two … ",
    "url": "https://t.co/F7T6q625PC"
  },
  {
    "text": "Marian Robinson, Michelle Obama's mother, dies at 86  —  Robinson became a fixture of the White House when she moved from her hometown of Chicago to help take care of her granddaughters during the Obama administration.  —  WASHINGTON — Former First Lady Michelle Obama's mother, Marian Robinson … ",
    "url": "https://www.nbcnews.com/politics/politics-news/marian-robinson-michelle-obamas-mother-dies-86-rcna154791"
  },
  {
    "text": "8 GOP Senators Say They'll Slow Senate Even Further Because Of Trump Verdict  —  The threat could have an impact on the fall spending showdown and White House nominations ahead.  —  LOADING  —  Donald Trump's “guilty” verdict on 34 counts of falsifying business records in his hush money trial … ",
    "url": "https://www.huffpost.com/entry/8-gop-senators-say-theyll-slow-senate-even-further-because-of-trump-verdict_n_665a324ee4b0b6cf3f482344"
  },
  {
    "text": "Scoop: Democrats ding GOP's “blind loyalty” to Trump in new attacks … - A Democratic strategist working on House races told Axios that their messaging plan is to cast defending Trump as indicative of a broader lack of independence. … - The releases accuse each lawmaker of rushing to … ",
    "url": "https://www.axios.com/2024/05/31/trump-biden-gop-democrats-campaign"
  },
  {
    "text": "Neighbors say Alitos used security detail car to intimidate them after sign dispute  —  Emily Baden says after a disagreement over political lawn signs with the US supreme court justice's wife, a black car began parking at her mother's home  —  Neighbors of Samuel Alito and his wife described … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/31/samuel-alito-flag-neighbor-interview"
  },
  {
    "text": "Visibly Distressed Putin Pals Shaken Up by Trump Verdict  —  ‘THEY WRONGED OUR DONALD’  —  Kremlin state TV propagandists couldn't hide dismay over Trump's conviction but they confirmed that Russia is still desperate for him to win back the White House.  —  Russian state-controlled media … ",
    "url": "https://www.thedailybeast.com/visibly-distressed-putin-pals-shaken-up-by-trump-verdict"
  },
  {
    "text": "Johnson urges Supreme Court to “step in” on Trump verdict … - Trump's legal team has said they plan to appeal, though they would first have to go through New York appellate courts before reaching the U.S. Supreme Court. … - “I think that the Justices on the court - I know many of them personally … ",
    "url": "https://www.axios.com/2024/05/31/mike-johnson-trump-supreme-court"
  },
  {
    "text": "Texas Supreme Court rejects challenge to abortion laws  —  The court ruled against 20 women who said they were denied medically necessary abortions, saying the medical exceptions in the law were broad enough.  —  The Texas Supreme Court has unanimously rejected the most significant challenge … ",
    "url": "https://www.texastribune.org/2024/05/31/texas-supreme-court-zurawski-abortion/"
  },
  {
    "text": "Biden details a 3-phase hostage deal aimed at winding down the Israel-Hamas war  —  President Joe Biden on Friday detailed a three-phase deal proposed by Israel to Hamas militants that he says would lead to the release of the remaining hostages in Gaza and could end the grinding, nearly 8-month-old Mideast war.",
    "url": "https://apnews.com/article/biden-israel-hamas-58169a607d4a7c4d7fc34f43160076b8"
  },
  {
    "text": "Trump classified documents judge is target of more than 1,000 complaints, appeals court reveals … The Florida federal judge overseeing the criminal classified documents case against former President Donald Trump has been the target of more than 1,000 complaints in just one week … ",
    "url": "https://www.cnbc.com/2024/05/31/trump-classified-documents-aileen-cannon-complaints.html"
  },
  {
    "text": "Donald Trump gets a SIX-POINT bump in approval after being found guilty on 34 counts according to snap Daily Mail poll: ‘I think it was a waste of taxpayer money’  — JL Partners used a panel of 403 likely voters to asses the impact of guilty verdict  — The results showed an improvement in Trump's favorability ratings",
    "url": "https://www.dailymail.co.uk/news/article-13480491/donald-trump-verdict-guilty-poll-positive.html"
  },
  {
    "text": "DC attorney discipline board recommends Rudy Giuliani be disbarred for bogus 2020 election fraud claim  —  Donald Trump's former lawyer Rudy Giuliani is one step closer to being disbarred.  —  The professional responsibility board in Washington, DC, recommended Friday that the ex-New York mayor … ",
    "url": "https://www.cnn.com/2024/05/31/politics/rudy-giuliani-election-fraud-disbarment/"
  }
]