[
  {
    "text": "Former First Lady Rosalynn Carter Passes Away at Age 96  —  Former First Lady Rosalynn Carter, a passionate champion of mental health, caregiving, and women's rights, passed away Sunday, Nov. 19, at 2:10 p.m. at her home in Plains, Georgia, at the age of 96.  She died peacefully, with family by her side.",
    "url": "https://www.cartercenter.org/news/pr/2023/statement-rosalynn-carter-111923.html"
  },
  {
    "text": "Rosalynn Carter, former first lady and tireless humanitarian who advocated for mental health issues, dies at 96  —  Carter devoted herself to several social causes in the course of her public life, including programs that supported health care resources, human rights, social justice and the needs of elderly people.",
    "url": "https://www.nbcnews.com/news/obituaries/rosalynn-carter-former-first-lady-dies-rcna62862"
  },
  {
    "text": "Poll: Biden's standing hits new lows amid Israel-Hamas war  —  Young voters are breaking from Biden, helping give Trump a narrow lead for the first time in NBC News polling, though the gap is within the margin of error.  —  President Joe Biden's approval rating has declined to the lowest level … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-bidens-standing-hits-new-lows-israel-hamas-war-rcna125251"
  },
  {
    "text": "Abbott endorses Trump for president  —  Texas Gov. Greg Abbott (R) officially endorsed former President Trump for the GOP primary nomination at a Sunday event honoring service members stationed on the Texas border.  —  “Joe Biden is causing a potential terror threat in the United States of America,” Abbott said at the event.",
    "url": "https://thehill.com/homenews/campaign/4317570-texas-gov-abbott-endorses-trump-2024-during-visit-to-southern-border/"
  },
  {
    "text": "Antisemitism was rising online.  Then Elon Musk's X supercharged it.  —  The Israel-Gaza war has raised tensions over what had already been a growing presence on the web.  —  In the weeks following the Oct. 7 Hamas attack on Israel, Twitter user @breakingbaht criticized leftists, academics and … ",
    "url": "https://www.washingtonpost.com/technology/2023/11/19/antisemiticism-interent-elon-musk-israwl-war/"
  },
  {
    "text": "Ron DeSantis refuses to condemn Elon Musk's endorsement of antisemitic conspiracy theory  —  WASHINGTON — 2024 Republican presidential hopeful and Florida Gov. Ron DeSantis refused on Sunday to condemn Elon Musk over his endorsement of an antisemitic conspiracy theory that falsely accused Jewish people … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/11/19/ron-desantis-elon-musk-antisemitism-2024-gop/71645125007/"
  },
  {
    "text": "Tucker Carlson spreads antisemitic message in interview with Candace Owens  —  A handful of influential right-wing talk show hosts have spread antisemitic tropes to their millions of followers.  CNN's Oliver Darcy has the story.  —  Top business news  16 videos",
    "url": "https://www.cnn.com/videos/media/2023/11/18/antisemitism-right-wing-media-darcy-dnt-lead-vpx.cnn"
  },
  {
    "text": "‘How Many Are Feds?’  Sen. Mike Lee Pushes Jan. 6 Disinformation  —  The senator alleged that a man carrying a vape was actually flashing a law enforcement badge  —  Sen. Mike Lee perpetuated an unfounded conspiracy theory that federal agents or informants were among the rioters on Jan. 6 … ",
    "url": "https://www.rollingstone.com/politics/politics-news/sen-mike-lee-pushes-jan-6-disinformation-1234886704/"
  },
  {
    "text": "Newsom ad targets DeSantis's 6-week abortion ban  —  California Gov. Gavin Newsom (D) on Sunday released a new ad digging into Florida Gov. Ron DeSantis's (R) six-week ban on abortion as the two governors prepare to debate one another later this month.  —  The ad, released by Newsom … ",
    "url": "https://thehill.com/homenews/campaign/4317453-newsom-ad-targets-desantis-six-week-abortion-ban/"
  },
  {
    "text": "In a swing Wisconsin county, everyone is tired of politics  —  DOOR COUNTY, Wis. — She didn't trust the government.  She didn't trust the news.  She didn't know whom to trust, so Kathy Nichols eased into the armchair facing her psychic.  —  “What comes up in my future?” she asked.",
    "url": "https://www.washingtonpost.com/nation/interactive/2023/wisconsin-door-county-voters-politics-fatigue/"
  },
  {
    "text": "I Read Mike Johnson's Legal Filings.  They Reveal a Distinctive Pattern.  —  The new speaker's view is “the First Amendment for me but not for thee.”  —  The newly elected speaker of the House of Representatives, J. Michael Johnson (R-La.), spent years as a practicing lawyer before his election … ",
    "url": "https://www.politico.com/news/magazine/2023/11/19/mike-johnson-legal-filings-00127832"
  },
  {
    "text": "From airlines to ticket sellers, companies fight U.S. to keep junk fees  —  An array of powerful moneyed lobbyists have warred with the Biden administration over its new regulatory crackdown as they scramble to protect their profits  —  Frustrated with airlines that charge passengers steep fees … ",
    "url": "https://www.washingtonpost.com/business/2023/11/19/companies-lobbyists-fight-junk-fees/"
  },
  {
    "text": "Channels of Rage  —  On the vile and corrosive replacement myth, those who push it and why they do, and what it really replaces. … OK phew!  —  It was a busy but mostly fun couple weeks.  I'll tell you about it sometime maybe.  —  I'm back, just as I warned.  —  Where did we leave off?",
    "url": "https://armoxon.substack.com/p/channels-of-rage"
  },
  {
    "text": "Israel and Hamas reach tentative U.S.-brokered deal to pause conflict, free dozens of hostages  —  A five-day pause in fighting, monitored by aerial surveillance, could see dozens of women and children freed from captivity in Gaza, according to people familiar with the terms of the agreement",
    "url": "https://www.washingtonpost.com/national-security/2023/11/18/us-israel-hamas-reach-tentative-deal-pause-conflict-free-dozens-hostages/"
  },
  {
    "text": "A Jan. 6 Defendant Pleads His Case to the Son Who Turned Him In  —  The Capitol attacks ruptured their mutual trust.  In the weeks before Brian Mock's sentencing, could he mend the divide with his son A.J.?  —  By Eli SaslowPhotographs by Erin Schaff  —  The trial was over and the verdict was in … ",
    "url": "https://www.nytimes.com/2023/11/19/us/politics/jan-6-trial-father-son.html"
  },
  {
    "text": "Militants believed to be Houthi rebels use helicopter to seize Japanese tanker in Red Sea  —  The attack off the coast of Yemen comes just days after the Houthis issued a graphic with captions in Hebrew, Arabic and English that said, “We will sink your ships.”",
    "url": "https://www.nbcnews.com/news/world/militants-believed-houthi-rebels-use-helicopter-seize-japanese-tanker-rcna125883"
  }
]