[
  {
    "text": "Mark Meadows Is a Warning About a Second Trump Term  —  On Monday, Mark Meadows, a former White House chief of staff, testified in an effort to move the Georgia racketeering case against his former boss Donald Trump and co-defendants to federal court.  On the stand, he said that he believed … ",
    "url": "https://www.nytimes.com/2023/08/31/opinion/mark-meadows-georgia-trump.html"
  },
  {
    "text": "Trump enters not guilty plea in Fulton County, won't appear for arraignment  —  Former President Donald Trump has entered a not guilty plea to 13 Georgia felony counts related to an alleged scheme to overturn the state's 2020 presidential election results.  —  An attorney for Trump filed … ",
    "url": "https://www.cbsnews.com/news/trump-not-guilty-plea-fulton-county-wont-appear-for-arraignment/"
  },
  {
    "text": "BREAKING: Trump pleads not guilty, waives arraignment in Fulton  —  X  —  Former President Donald Trump pleaded not guilty on Thursday to the 13 criminal charges recently handed up against him by a Fulton County grand jury.  In a brief court filing, the Republican also acknowledged that he is waiving his right to an arraignment.",
    "url": "https://www.ajc.com/politics/breaking-trump-pleads-not-guilty-waives-arraignment-in-fulton/CNYTZOJE6RGL7BTEOS2X2PNN2Y/"
  },
  {
    "text": "The Key Players in Trump's Plot to Upend the Election, Mapped  —  Ms. Cottle is a member of the editorial board.  Mr. Eisen is a senior fellow at the Brookings Institution.  Ms. Maggiacomo is a graphics editor in Opinion.  —  Upending the outcome of a free and fair presidential election is no minor endeavor.",
    "url": "https://www.nytimes.com/interactive/2023/08/31/opinion/politics/trump-indictment-election-key-players.html"
  },
  {
    "text": "Proud Boy leader Joseph Biggs sentenced to 17 years for Jan. 6 crimes  —  A former leader in the far-right Proud Boys group was sentenced Thursday to 17 years in prison, just shy of the longest punishment imposed on a participant in the Jan. 6, 2021, riot at the U.S. Capitol.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/31/proud-boys-joseph-biggs-sentencing-jan6-seditious-conspiracy/"
  },
  {
    "text": "Proud Boy Joe Biggs receives 17 years in Jan. 6 seditious conspiracy case  —  The former Infowars correspondent, who was convicted of seditious conspiracy, “served as an instigator and leader” during the Capitol attack, federal prosecutors said.  —  Proud Boy Joe Biggs sentenced to 17 years in prison in Jan. 6 case",
    "url": "https://www.nbcnews.com/politics/justice-department/proud-boy-joe-biggs-faces-decades-prison-jan-6-seditious-conspiracy-ca-rcna102597"
  },
  {
    "text": "GOP senators weigh ‘special’ meeting on their leadership after McConnell's freeze  —  It takes just five Republicans to force such a sitdown, the most direct way to specifically discuss their future amid revived questions about the leader's health.  —  A handful of GOP senators is weighing whether … ",
    "url": "https://www.politico.com/news/2023/08/31/gop-senators-mcconnell-freeze-up-00113610"
  },
  {
    "text": "McConnell appears to freeze while speaking with reporters in Kentucky  —  Senate Minority Leader Mitch McConnell appeared to freeze for about 30 seconds on Wednesday while speaking with reporters after a speech in Covington, Kentucky.  —  The incident is similar to an episode McConnell experienced … ",
    "url": "https://www.cnn.com/2023/08/30/politics/mitch-mcconnell/"
  },
  {
    "text": "Justice Thomas says he used private jet for security reasons after Dobbs leak  —  In required financial disclosure, Justice Clarence Thomas reports three 2022 trips on private jet of Harlan Crow  —  Supreme Court Justice Clarence Thomas reported three 2022 trips on the private jet … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/31/clarence-thomas-alito-financial-disclosures/"
  },
  {
    "text": "45 New Victims Allegedly ID'd in Leaked Chats From Andrew Tate's ‘War Room’  —  Paying members allegedly discussed chilling techniques to abuse and groom women into sex work.  —  Members of influencer Andrew Tate's “War Room” group discussed techniques for how to groom women … ",
    "url": "https://www.thedailybeast.com/45-new-victims-allegedly-idd-in-leaked-chats-from-andrew-tates-war-room"
  },
  {
    "text": "Trump Inflated Property Values by Up to $2.2 Billion, New York A.G. Says  —  Letitia James, the attorney general, asked a judge to find, without a trial, that the former president had fraudulently overvalued his assets.  —  Before Donald J. Trump was indicted four times over … ",
    "url": "https://www.nytimes.com/2023/08/30/nyregion/trump-james-civil-lawsuit-trial.html"
  },
  {
    "text": "For George Santos, a life in Brazil at odds with his GOP politics  —  NITERÓI, Brazil — The sight of the newcomer took Gino Fonseca by surprise.  As one of the city's most prominent drag queens, Fonseca thought he knew most everyone who worked the nightclubs and LGBTQ events.",
    "url": "https://www.washingtonpost.com/world/2023/08/31/george-santos-brazil/"
  },
  {
    "text": "Rudy Giuliani Literally Can't Afford to Be Defaming People  —  Rudy Giuliani can't even afford to lie about random people anymore.  —  A federal judge in Georgia ordered Giuliani on Wednesday to forfeit a defamation suit filed by two poll workers, whom he falsely claimed had tampered with ballots after the 2020 election.",
    "url": "https://nymag.com/intelligencer/2023/08/rudy-giuliani-forfeits-ruby-freeman-defamation-in-georgia.html"
  },
  {
    "text": "RNC Members Acknowledge Their Fundraising Is ‘in the Toilet’  —  The Republican National Committee is having some serious money problems. … Pay Dirt is a weekly foray into the pigpen of political funding.  Subscribe here to get it in your inbox every Thursday.",
    "url": "https://www.thedailybeast.com/rnc-members-acknowledge-their-fundraising-is-in-the-toilet"
  },
  {
    "text": "Democrats Push to Subpoena Jared Kushner's Saudi-Backed Investment Firm  —  Oversight committee members are asking the GOP chair to demand key documents days after he admitted Kushner “crossed the line of ethics” … Since Republicans gained control of the House in 2022 … ",
    "url": "https://www.rollingstone.com/politics/politics-news/jared-kushner-subpoena-oversight-democrats-1234816008/"
  },
  {
    "text": "Alabama attorney general says he has right to prosecute people who facilitate travel for out-of-state abortions  —  Alabama's Republican attorney general said in a court filing that he has the right to prosecute people who make travel arrangements for pregnant women to have out-of-state abortions.",
    "url": "https://www.cnn.com/2023/08/31/politics/alabama-attorney-general-abortion-prosecute/"
  },
  {
    "text": "Top North Carolina judge faces potential sanctions for talking about racial discrimination  —  North Carolina Supreme Court Justice Anita Earls is being threatened with sanctions for criticizing the court's approach to racial and gender discrimination.  Earls, the only Black woman on the court … ",
    "url": "https://popular.info/p/top-north-carolina-judge-faces-potential"
  },
  {
    "text": "Vivek Ramaswamy, Political Performance Artist  —  He has no government experience, but plenty of conspiratorial demagoguery to sell.  —  A particularly low point of last week's GOP presidential debate came at around the 39-minute mark, when an unusually glib, shallow, overbearing … ",
    "url": "https://www.wsj.com/articles/ramaswamy-the-gop-flimflam-man-vivek-debate-trump-conspiracy-election-candidate-voters-b54ebf13?mod=followamazon"
  },
  {
    "text": "Feinstein is a silent character in her sad and messy final chapter  —  Feinstein's daughter battles her stepsisters over the senator's share of a fortune that exceeds an estimated $1 billion.  Daughter's role scrutinized by trustees in new legal motion.  —  SAN FRANCISCO — A beach house in an exclusive neighborhood.",
    "url": "https://www.politico.com/news/2023/08/31/dianne-feinstein-trust-dispute-00112420"
  },
  {
    "text": "Pro-Ron DeSantis super PAC ends door-knocking in Nevada and Super Tuesday states  —  Never Back Down officials said they were reinvesting in the first three primary states and criticized what they see as a pro-Trump effort to tilt primary rules in his favor elsewhere.",
    "url": "https://www.nbcnews.com/politics/2024-election/-ron-desantis-super-pac-ends-door-knocking-nevada-super-tuesday-states-rcna102645"
  },
  {
    "text": "Former North Shore Pizzeria Owner Sentenced to Two Years in Prison for COVID Fraud  —  For Immediate Release  —  U.S. Attorney's Office, District of Massachusetts  —  Defendant purchased alpaca farm using fraudulently obtained pandemic relief funds  —  BOSTON - A former North Shore resident … ",
    "url": "https://www.justice.gov/usao-ma/pr/former-north-shore-pizzeria-owner-sentenced-two-years-prison-covid-fraud"
  },
  {
    "text": "Poll shows Matt Rosendale up big over NRSC-backed Tim Sheehy  —  The Scoop  —  National Republicans may have a problem on their hands in Montana.  While the NRSC is backing 37-year old veteran Tim Sheehy for Senate, Montana Rep. Matt Rosendale would start with a sizable lead if he entered the race … ",
    "url": "https://www.semafor.com/article/08/30/2023/poll-shows-matt-rosendale-up-big-over-nrsc-backed-tim-sheehy"
  }
]