[
  {
    "text": "How Trump Shifted on Iran Under Pressure From Israel  —  President Trump spent the first months of his term holding back Israel's push for an assault on Iran's nuclear program.  With the war underway, his posture has gyrated as he weighs sending in the U.S. military.",
    "url": "https://www.nytimes.com/2025/06/17/us/politics/trump-iran-israel-nuclear-talks.html?unlocked_article_code=1.Pk8.yX3k.QsVcm1X7gVTt&smid=url-share"
  },
  {
    "text": "Iran Is Preparing Missiles for Possible Retaliatory Strikes on U.S. Bases, Officials Say  —  American commanders have put troops on high alert throughout the region as fears of a wider war grow.  —  Iran has prepared missiles and other military equipment for strikes on U.S. bases … ",
    "url": "https://www.nytimes.com/2025/06/17/us/politics/iran-israel-us-bases.html?unlocked_article_code=1.Pk8.KsL_.N4D1U_alczh0&smid=url-share"
  },
  {
    "text": "US spies said Iran wasn't building a nuclear weapon.  Trump dismisses that assessment  —  Tulsi Gabbard left no doubt when she testified to Congress about Iran's nuclear program earlier this year.  The country was not building a nuclear weapon, the national intelligence director told lawmakers … ",
    "url": "https://apnews.com/article/gabbard-trump-intelligence-iran-nuclear-program-51c8d85d536f8628870c110ac05bb518"
  },
  {
    "text": "Thoughts on Israel's Iran Campaign and Donald Trump … I haven't had a lot to say about Israel and Iran because I haven't had a lot to add.  But I want to suggest something about the possible entry of the United States into the war.  These aren't conclusions, more questions I've had and questions … ",
    "url": "https://talkingpointsmemo.com/edblog/thoughts-on-israels-iran-campaign-and-donald-trump/sharetoken/242a4259-3434-4ba9-9820-5cc31b27d92b"
  },
  {
    "text": "Inside the clashes between Trump and Gabbard  —  The director of national intelligence has rankled Trump with her statements about nuclear war, and the president has suggested she's off message.  —  As President Donald Trump privately mulled joining Israel's campaign against Iran this month … ",
    "url": "https://www.politico.com/news/2025/06/17/gabbard-trump-00411685"
  },
  {
    "text": "Trump considers strike on Iran ahead of crucial Situation Room meeting  —  President Trump will meet with his national security team in the White House Situation Room at 1pm on Tuesday to make decisions about U.S. policy towards the war between Israel and Iran, three U.S. officials tell Axios.",
    "url": "https://www.axios.com/2025/06/17/trump-situation-room-meeting-iran-israel-war"
  },
  {
    "text": "Brad Lander Is Arrested by ICE Agents at Immigration Courthouse  —  Mr. Lander, the New York City comptroller and a candidate for mayor, was handcuffed as he tried to steer a man past Immigration and Customs Enforcement officers.  —  Brad Lander, the New York City comptroller who is running for mayor … ",
    "url": "https://www.nytimes.com/2025/06/17/nyregion/brad-lander-immigration-ice.html"
  },
  {
    "text": "Comptroller Brad Lander arrested at ICE court hearing  —  City Comptroller Brad Lander was arrested and accosted by masked federal agents at immigration court in Lower Manhattan.  —  The city's elected financial watchdog, and a Democratic candidate for mayor, appeared at 26 Federal Plaza … ",
    "url": "https://www.amny.com/news/brad-lander-arrested-ice-court-hearing-06172025/"
  },
  {
    "text": "NYC Mayoral Candidate Brad Lander Latest Victim of ICE Violence  —  The New York City comptroller was assisting a man in immigration court when masked agents arrested him.  —  APTOPIX New York Immigration Court Arrest  —  New York City Comptroller Brad Lander is placed under arrest … ",
    "url": "https://prospect.org/justice/2025-06-17-brad-lander-arrested-ice-immigration/"
  },
  {
    "text": "Homeland Security Secretary Kristi Noem transported by ambulance to DC-area hospital, sources say  —  Homeland Security Secretary Kristi Noem was transported by ambulance on Tuesday to a hospital in Washington, DC, two sources familiar with the matter told CNN.",
    "url": "https://cnn.com/2025/06/17/politics/kristi-noem-hostpital"
  },
  {
    "text": "Homeland Security Secretary Kristi Noem Hospitalized  —  Noem suffered an allergic reaction, her spokeswoman said  —  Homeland Security Secretary Kristi Noem, age 53, was taken to a Washington, D.C., hospital by ambulance on Tuesday after suffering an allergic reaction, according to a spokeswoman.",
    "url": "https://www.wsj.com/politics/elections/homeland-security-secretary-kristi-noem-hospitalized-b83128ec"
  },
  {
    "text": "Far-Right ‘Appeal to Heaven’ Flag Flown Above Government Agency in DC  —  The “Appeal To Heaven” flag, a popular symbol for Christian nationalists that was waved by January 6 rioters, was raised over the Small Business Administration headquarters last week.  —  A controversial “Appeal to Heaven” … ",
    "url": "https://www.wired.com/story/far-right-appeal-to-heaven-flag-sba-government-agency-dc/"
  },
  {
    "text": "Trump's Own Staffers Don't Think He's Fit to Be President  —  Dissent against Donald Trump is bubbling within his administration—but people are too scared to act on it.  —  Some White House staffers no longer believe that Trump is fit to be president, according to Miles Taylor … ",
    "url": "https://newrepublic.com/post/196917/donald-trump-think-unfit-president-damning-interview"
  },
  {
    "text": "Senate passes landmark crypto regulation bill on a bipartisan vote, sending it to the House  —  The 68-30 vote on the GENIUS Act marked the first time that the Senate has passed major legislation regulating digital assets.  —  WASHINGTON — After weeks of stops and starts … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-passes-landmark-crypto-regulation-bill-bipartisan-vote-sending-rcna213437"
  },
  {
    "text": "California court upholds John Eastman's disbarment for role in Trump 2020 plot  —  Eastman's “false narrative” about the 2020 results undermined American elections and the legal system, the court wrote.  —  A California court has upheld a recommendation that attorney John Eastman should lose … ",
    "url": "https://www.politico.com/news/2025/06/17/california-court-john-eastman-disbarment-00411266"
  },
  {
    "text": "Trump set to grant another extension to avoid TikTok disruption  —  The social media platform is technically prohibited under U.S. law unless it can find an American buyer.  —  President Donald Trump will extend a deadline for the owner of social media platform TikTok to find a U.S. buyer … ",
    "url": "https://www.nbcnews.com/news/us-news/trump-extension-tiktok-rcna213625"
  },
  {
    "text": "Truck carrying tank after Army's 250th birthday parade kills pedestrian in DC  —  The accident occurred on the evening of June 16.  —  A truck carrying one of the Army M1 Abrams tanks that participated in President Donald Trump's parade in honor of the service's 250th birthday struck and killed a woman in Washington.",
    "url": "https://www.usatoday.com/story/news/politics/2025/06/17/army-tank-kills-dc-pedestrian-birthday-parade/84246151007/"
  },
  {
    "text": "Family says baby delivered through C-section from Georgia mom who was declared brain dead  —  Family members said Adriana Smith will be taken off life support this week. … ATLANTA — The family of Adriana Smith, a metro Atlanta nurse who was declared brain dead in February while pregnant, said her baby boy has arrived.",
    "url": "https://www.11alive.com/article/news/health/adriana-smith-baby-born-life-support-update-brain-dead-nicu/85-1fb6595c-3966-4a50-993d-0e36e05cb256"
  },
  {
    "text": "Senate Democrats Are Letting Trump's Judicial Nominees Off the Hook  —  On Sunday, 11 days after the Senate Judiciary Committee held confirmation hearings for President Donald Trump's first batch of judicial nominees, the committee published the nominees' answers to follow-up questions posed by the committee's members.",
    "url": "https://ballsandstrikes.org/nominations/trump-judicial-nominees-senate-democrats-off-the-hook/"
  },
  {
    "text": "Senators Assail Antidoping Regulator for ‘Stonewalling and Intimidation’  —  Members of both parties criticized the World Anti-Doping Agency for its decision not to sanction Chinese swimmers who tested positive for a banned substance, including some who went on to win Olympic medals.",
    "url": "https://www.nytimes.com/2025/06/17/us/politics/senate-swimmers-antidoping-regulator.html"
  },
  {
    "text": "Hospitals stunned by Senate GOP's Medicaid plan  —  Republicans want to curtail taxes states have imposed to increase payments to hospitals.  —  One of the most powerful lobbies in Washington is redoubling its efforts to avoid a cut to Medicaid payments in the GOP's megabill.",
    "url": "https://www.politico.com/news/2025/06/17/hospitals-senate-medicaid-megabill-taxes-00410769"
  },
  {
    "text": "US judge blocks Trump passport policy targeting transgender people  —  A federal judge on Tuesday blocked the Trump administration from refusing to issue passports to transgender and nonbinary Americans nationwide that reflect their gender identities, after finding it was likely unconstitutional.",
    "url": "https://www.reuters.com/world/us/us-judge-blocks-trump-passport-policy-targeting-transgender-people-2025-06-17/"
  },
  {
    "text": "Trump's pardons cost victims and taxpayers $1.3 billion, House Judiciary Committee Democrats' review says  —  President Trump's flurry of recent presidential pardons has cost crime victims and taxpayers approximately $1.3 billion in restitution and payments, according to a review by House Judiciary Democrats.",
    "url": "https://www.cbsnews.com/news/trumps-pardons-cost-victims-and-taxpayers-1-3-billion-house-judiciary-committee-democrats-review/"
  },
  {
    "text": "Denmark's Frederiksen moves to keep Greenland out of Trump's clutches  —  The plan includes investment in the Arctic island's critical infrastructure.  —  Danish Prime Minister Mette Frederiksen said Copenhagen is willing to invest more in Greenland as Denmark tries to fend off U.S. President … ",
    "url": "https://www.politico.eu/article/denmark-pm-mette-frederiksen-copenhagen-donald-trump-military-greeland/"
  },
  {
    "text": "Fox News' Ben Domenech tells Ilhan Omar to buy a one-way ticket to Somalia  —  Greg Gutfeld calls NYC mayoral candidate Zohran Mamdani a social justice suicide bomber  —  Daily Wire's Matt Walsh on Trump's deportation policies: “The Trump administration is ... extremely tuned in to what the base is saying.",
    "url": "https://www.mediamatters.org/fox-news/fox-news-ben-domenech-tells-ilhan-omar-buy-one-way-ticket-somalia"
  },
  {
    "text": "‘Insensitive, to say the least’: Mike Lee deletes Minnesota posts amid GOP criticism  —  Utah Sen. Mike Lee, amid widespread outrage, has deleted a pair of social media posts associating the deadly Minnesota shootings last weekend with “Marxists” and the state's Democratic governor.",
    "url": "https://www.politico.com/live-updates/2025/06/17/congress/kevin-cramer-blasts-mike-lee-posts-00410547"
  },
  {
    "text": "ICE detained University of Utah student after gaining secret access to Colorado deputy's communications, sheriff's office says  —  Caroline Dias Goncalves, 19, has been detained in an immigration center for nearly two weeks since she was pulled over on June.  5.",
    "url": "https://www.sltrib.com/news/education/2025/06/17/ice-detains-utah-student-after/"
  },
  {
    "text": "We Better Pray That No Unexpected Crisis Hits While Trump Is President … If you live in the United States, you are in greater jeopardy today than you were six months ago.  So is your family.  So are your friends and neighbors.  —  Virtually all of the most important parts of the U.S. government … ",
    "url": "https://newrepublic.com/article/196860/trump-unexpected-crisis-national-security"
  },
  {
    "text": "Ohio lawmakers to introduce bill banning abortion, criminalizing the procedure  —  The bill would overturn a constitutional amendment protecting abortion rights.  —  In this Nov. 7, 2023, file photo, Issue 1 supporters cheer as they watch election results in Columbus Ohio.",
    "url": "https://abcnews.go.com/Health/ohio-lawmakers-introduce-bill-banning-abortion-criminalizing-procedure/story?id=122922580"
  },
  {
    "text": "Clintons, Harris attend Hamptons wedding of Huma Abedin, Alex Soros  —  Huma Abedin, political strategist and former Hillary Clinton aide, dished the details of her Saturday wedding to philanthropist Alex Soros, the son of progressive billionaire George Soros, to Vogue.",
    "url": "https://thehill.com/blogs/in-the-know/5355397-clintons-harris-wedding-huma-abedin-alex-soros/"
  },
  {
    "text": "H.R. 1, One Big Beautiful Bill Act (Dynamic Estimate)  —  As passed by the House of Representatives on May 22, 2025 … 383.21 KB  —  On This Page  —  H.R. 1, One Big Beautiful Bill Act  —  As passed by the House of Representatives on May 22, 2025  —  By Fiscal Year, Billions of Dollars",
    "url": "https://www.cbo.gov/publication/61486"
  },
  {
    "text": "Today in Politics, Bulletin 153. 6/17/25  —  ... Director of WH Personnel Sergio Gor refuses to say what country he's from and refuses to complete the paperwork for his background check.  NY Post: “Gor is in charge of picking about 4,000 executive-branch staff ... but has not turned in his Standard Form 86 … ",
    "url": "https://www.meidasplus.com/p/today-in-politics-bulletin-153-61725"
  }
]