[
  {
    "text": "Liz Cheney Tells George W. Bush to Endorse Kamala Harris: 'It's Time'  —  TICK TOCK  —  The Republican publicly urged Bush to speak out in the wake of his daughter's shock endorsement.  —  Liz Cheney is calling on George W. Bush to make his voice heard on the “danger that Donald Trump poses.”",
    "url": "https://www.thedailybeast.com/liz-cheney-tells-george-w-bush-to-endorse-kamala-harris-its-time/"
  },
  {
    "text": "Arizona's top prosecutor investigating Trump's comments about Cheney as possible death threat  —  During his Glendale appearance, Trump suggested his Republican critic should face ‘nine barrels shooting at her.’  —  PHOENIX — Arizona's top prosecutor tells 12News she is investigating whether … ",
    "url": "https://www.12news.com/article/news/politics/elections/arizona-top-prosecutor-kris-investigating-trumps-comments-about-cheney-possible-death-threat/75-91f8b734-06eb-4aeb-a633-89be0df7c4c4"
  },
  {
    "text": "How Risky Is a Trump Second Term?  —  He'd slow the left's coercive march, but his policies are likely to be a jump ball. … Unlimited access across all platforms and devices.",
    "url": "https://www.wsj.com/opinion/donald-trump-candidacy-2024-election-kamala-harris-f8f99a69"
  },
  {
    "text": "Nicolle Wallace Calls on Her Former Boss, George W. Bush, to Denounce Trump  —  Ms. Wallace, who served as the communications director in the Bush White House, made the appeal on her MSNBC program.  —  Nicolle Wallace, who was a White House communications director in George W. Bush's administration … ",
    "url": "https://www.nytimes.com/2024/11/01/us/politics/george-w-bush-nicole-wallace-2024-election.html"
  },
  {
    "text": "Trump Still Can't Stop Talking About Women  —  The countdown to the election feels like an Advent calendar with a dubious remark behind each door.  —  Vice President Kamala Harris almost never talks about what it would mean to elect a female president, nor does she speculate about why women disproportionately support her candidacy.",
    "url": "https://www.nytimes.com/2024/11/01/us/politics/harris-trump-womens-health-election.html"
  },
  {
    "text": "Supreme Court allows Pennsylvania to count contested provisional ballots, rejecting Republican plea  —  The Supreme Court on Friday rejected an emergency appeal from Republicans that could have led to thousands of provisional ballots not being counted in Pennsylvania.",
    "url": "https://apnews.com/article/bucks-county-pennsylvania-early-mail-voting-deadline-05296504a3237956d96126570137a9f1"
  },
  {
    "text": "Up to 17,000 Pennsylvanians Who Haven't Received Mail-in Ballots Permitted to Vote Early in Person  —  An Erie County, Pennsylvania judge ruled that up to 17,000 voters who still haven't received their requested mail-in ballots will be able to vote early in person at the county board … ",
    "url": "https://www.democracydocket.com/news-alerts/tens-of-thousands-of-voters-in-pennsylvania-county-never-received-their-mail-in-ballots/"
  },
  {
    "text": "Kamala Harris ahead in enough swing states to win, Times poll says  —  Final survey before the 2024 US election shows the Democrat leading Donald Trump in Michigan, Nevada, Pennsylvania and Wisconsin  —  Kamala Harris is on track to become America's first female president by a narrow margin thanks … ",
    "url": "https://www.thetimes.com/world/us-world/article/us-election-2024-swing-state-polls-c8r398mnf"
  },
  {
    "text": "As women outpace men in early turnout, Trump's challenge to win over female voters comes into focus  —  When Alex Cooper, the popular podcaster behind “Call Her Daddy,” released her widely discussed interview with Democrat Kamala Harris last month, she revealed she had invited … ",
    "url": "https://www.cnn.com/2024/11/01/politics/trump-women-voters-gender-gap-harris/"
  },
  {
    "text": "So, Can We Trust the Polls?  —  Recent changes add up to a case for cautious optimism on better accuracy, but that's far from a guarantee.  —  The polls underestimated Donald J. Trump in 2016.  —  They underestimated him again in 2020.  —  So can we trust the polls this time?",
    "url": "https://www.nytimes.com/2024/11/01/upshot/so-can-we-trust-the-polls.html"
  },
  {
    "text": "Election guru Nate Silver accuses pollsters of putting ‘finger on the scale,’ lying to keep presidential race close  —  Polling guru Nate Silver lashed out at other survey junkies in his field for “cheating” in the final stretch of the 2024 presidential election — accusing them of recycling … ",
    "url": "https://nypost.com/2024/11/01/us-news/election-guru-nate-silver-accuses-pollsters-of-putting-finger-on-the-scale-lying-to-keep-presidential-race-close/"
  },
  {
    "text": "Jeffrey Epstein details close relationship with Trump in newly released tapes  —  Recordings from 2017 reveal Epstein talking for some ‘100 hours’ about the ex-president, journalist Michael Wolff says  —  A New York author and journalist has released audio tapes that appear to detail … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/01/trump-jeffrey-epstein-tapes"
  },
  {
    "text": "Float in Pennsylvania parade had person in chains resembling Harris  —  A float at a Halloween parade in Pennsylvania is sparking sharp criticism, as many called its depictions of former President Trump and Vice President Harris “racist and offensive.”  —  Several photos and videos circulating … ",
    "url": "https://thehill.com/homenews/race-politics/4966078-racist-offensive-halloween-parade/"
  },
  {
    "text": "Pa. officials apologize for shackled Harris display in Halloween parade  —  Community officials in Pennsylvania apologized after someone dressed as Vice President Kamala Harris pretended to be shackled behind a vehicle during a parade.  —  Officials in a small Pennsylvania community apologized Thursday … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/01/kamala-harris-halloween-parade-mount-pleasant-pennsylvania/"
  },
  {
    "text": "Hugh Hewitt quits Washington Post after storming off livestream talk over dispute with liberal columnists: 'I won't come back'  —  Conservative radio host Hugh Hewitt resigned from the Washington Post after he stormed off a livestreamed discussion on Friday amid a dispute … ",
    "url": "https://nypost.com/2024/11/01/media/hugh-hewitt-quits-washington-post-after-storming-off-broadcast/"
  },
  {
    "text": "An Idaho health department isn't allowed to give COVID-19 vaccines anymore.  Experts say it's a first  —  A regional public health department in Idaho is no longer providing COVID-19 vaccines to residents in six counties after a narrow decision by its board.",
    "url": "https://apnews.com/article/covid19-vaccine-public-health-idaho-76f1c29bf3f07a2c029175bf6c2180c4"
  },
  {
    "text": "Pregnant Texas teen died after three ER visits due to impact of abortion ban  —  Neveah Crain died in October 2023 after doctor reportedly called for two ultrasounds to ‘confirm fetal demise’  —  A pregnant Texas teenager died after three separate visits to an emergency room in attempts … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/01/teen-dies-abortion-ban-texas-neveah-crain"
  },
  {
    "text": "European Greens ask Jill Stein to stand down and endorse Kamala Harris  —  US Green party leader urged to withdraw from presidential race to prevent Donald Trump victory  —  A coalition of European Greens have urged the US Green party's nominee, Jill Stein, to pull out of next week's election … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/01/european-greens-ask-jill-stein-to-stand-down-and-endorse-kamala-harris"
  },
  {
    "text": "Judge Allows Unusual G.O.P. Strategy to Pump Money Into Senate Races  —  Democrats had claimed that the advertising strategy may have violated federal election laws establishing strict limits on spending by national party committees to aid individual candidates.",
    "url": "https://www.nytimes.com/2024/11/01/us/politics/senate-republicans-ads-money.html"
  },
  {
    "text": "Robocall hits Larry Hogan for acknowledging Biden won 2020  —  A new robocall targeting Maryland voters attacks Larry Hogan for acknowledging Joe Biden won the 2020 election.  The recording knocks Hogan, the GOP nominee for Senate, for not being MAGA enough and urges support … ",
    "url": "https://www.politico.com/live-updates/2024/11/01/2024-elections-live-coverage-updates-analysis/larry-hogan-robocall-save-western-culture-00186895"
  },
  {
    "text": "See how Trump and Harris' stances on military support compare  —  There are similarities between former President Donald Trump and President Biden on long-term armed forces strategy, but in the run-up to the 2024 election, stark differences in Harris and Trump's view of the military's role have emerged.",
    "url": "https://www.cbsnews.com/news/trump-harris-military-support-2024/"
  },
  {
    "text": "Elon Musk's Machine for Fascism: A One-Stop Shop for Disinformation and Violence  —  Just over a year ago, I described how Twitter had been used as a way to sow false claims in support of Trump in 2016 and 2020.  —  I described how, in 2016, trolls professionalized their efforts … ",
    "url": "https://www.emptywheel.net/2024/11/01/elon-musks-machine-for-fascism-a-one-stop-shop-for-disinformation-and-violence/"
  },
  {
    "text": "Johnson leans on Trump in frantic push to save House majority  —  It's been two years of a chaotic GOP-led House.  But this time, Speaker Mike Johnson insists, things will be different.  —  As he barnstorms through blue districts central to the fight for the House, Johnson is seeking … ",
    "url": "https://www.cnn.com/2024/11/01/politics/johnson-trump-house-elections-agenda/"
  },
  {
    "text": "Biden Says ‘Not A Single, Solitary Republican’ Helped Him And Harris Save Workers' Pensions  —  The president visited the crucial swing state of Pennsylvania to talk about Democrats' pension rescue and how it's helping retirees.  —  LOADING  —  President Joe Biden reminded Pennsylvanians … ",
    "url": "https://www.huffpost.com/entry/biden-pensions-pennsylvania_n_6725494be4b01f6919da0ff8"
  }
]