[
  {
    "text": "Convicted US Capitol rioter turns down Trump pardon  —  One of the people who served jail time for taking part in the US Capitol riot four years ago has refused a pardon from President Donald Trump, saying: “We were wrong that day.”  —  Pamela Hemphill, who pleaded guilty and was sentenced … ",
    "url": "https://www.bbc.com/news/articles/cvged988377o"
  },
  {
    "text": "“F—k it: Release 'em all”: Why Trump embraced broad Jan. 6 pardons … - Trump vacillated during an internal debate over targeted clemency vs. a blanket decision according to two insiders.  — But as Trump's team wrestled with the issue, and planned a shock-and-awe batch of executive orders Day 1 … ",
    "url": "https://www.axios.com/2025/01/22/trump-pardons-jan6-clemency"
  },
  {
    "text": "Pardoned Jan. 6 Rioter Already Rearrested on Gun Charges  —  Trump granted clemency to hundreds of alleged or convicted violent criminals.  One is back behind bars … In May 2023, Daniel Ball of Homosassa, Florida, was indicted on 12 counts related to his participation in the attack on the Capitol.",
    "url": "https://www.rollingstone.com/politics/politics-news/jan-6-rioter-pardoned-trump-rearrested-gun-charges-1235243994/"
  },
  {
    "text": "Trump May Come to Regret His Jan. 6 Pardons.  Here's Why.  —  The potential for political backlash is real — now and in the future.  —  Even though President Donald Trump had vowed to deliver pardons to those who participated in the Jan. 6, 2021, siege of the Capitol, his sweeping clemency for roughly 1,500 people was stunning.",
    "url": "https://www.politico.com/news/magazine/2025/01/22/trump-jan-6-pardons-regrets-00199743"
  },
  {
    "text": "Federal judge says Trump's pardons can't erase ‘immutable’ truth of Jan. 6  —  The judge is the first to speak out after Trump's sweeping clemency and dismissals of more than 1,500 Jan. 6 cases.  —  A federal judge sounded off Wednesday about President Donald Trump's decision to pardon … ",
    "url": "https://www.politico.com/news/2025/01/22/trump-pardons-jan-6-federal-judge-00199948"
  },
  {
    "text": "Trump administration directs all federal diversity, equity and inclusion staff be put on leave  —  President Donald Trump 's administration moved Tuesday to end affirmative action in federal contracting and directed that all federal diversity, equity and inclusion staff be put on paid leave and eventually be laid off.",
    "url": "https://apnews.com/article/dei-trump-executive-order-diversity-834a241a60ee92722ef2443b62572540"
  },
  {
    "text": "Ending Illegal Discrimination And Restoring Merit-Based Opportunity  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  Longstanding Federal civil-rights laws protect individual Americans … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/ending-illegal-discrimination-and-restoring-merit-based-opportunity/"
  },
  {
    "text": "US military ordering thousands more troops to southern border  —  Thousands of additional active duty US troops are being ordered to the southern US border with Mexico, just two days after President Donald Trump mandated that the US military step up its presence there, according to officials familiar with the matter.",
    "url": "https://www.cnn.com/2025/01/22/politics/us-military-troops-southern-border/"
  },
  {
    "text": "U.S. border agents told to summarily deport migrants without asylum hearings under Trump edict  —  Washington — Citing President Trump's extraordinary move to close the American asylum system, U.S. border agents have been instructed to summarily deport migrants crossing into the country … ",
    "url": "https://www.cbsnews.com/news/trump-deportations-migrants-border-asylum-hearings/"
  },
  {
    "text": "US military preparing to send additional 1,500 troops to border, official says  —  The U.S. military is preparing to send roughly 1,500 additional active-duty troops to the border with Mexico, a U.S. official said, just two days after President Donald Trump signed an executive order on immigration.",
    "url": "https://www.reuters.com/world/us/us-military-preparing-send-additional-1000-troops-border-official-says-2025-01-22/"
  },
  {
    "text": "Trump launches savage attack on bishop who asked for ‘mercy’ for minorities  —  U.S. president calls the clergywoman a “Radical Left hard line Trump hater,” “ungracious,” “nasty” and “not compelling or smart.”  —  U.S. President Donald Trump hit out Wednesday at a bishop who directly called … ",
    "url": "https://www.politico.eu/article/donld-trump-launches-savage-attack-on-bishop-mariann-budde-who-asked-for-mercy-for-minorities-lgbtq-immigrants/"
  },
  {
    "text": "Donald Trump Demands Apology From Bishop Who Hurt His Feelings  —  Right Rev. Mariann Budde had appealed to Trump to have mercy and compassion during an interfaith service.",
    "url": "https://www.thedailybeast.com/donald-trump-demands-apology-from-bishop-mariann-budde-after-she-hurt-his-feelings/"
  },
  {
    "text": "Jamie Dimon says Trump's tariff policy is positive for national security so people should ‘get over it’ … WATCH NOW  —  JPMorgan Chase CEO Jamie Dimon said Wednesday that the looming tariffs that President Donald Trump is expected to slap on U.S. trading partners could be viewed positively.",
    "url": "https://www.cnbc.com/2025/01/22/jamie-dimon-on-trumps-tariffs-get-over-it.html"
  },
  {
    "text": "Trump administration cancels travel for refugees already cleared to resettle in the US  —  Refugees who had been approved to travel to the United States before a deadline next week suspending America's refugee resettlement program have had their travel plans canceled by the Trump administration.",
    "url": "https://apnews.com/article/refugees-flights-trump-immigration-border-resettlement-33ebaa34bc4d0c069a22ee7aa5f8ff6d"
  },
  {
    "text": "Justice Department directs prosecutors to probe local efforts to obstruct immigration enforcement  —  The Justice Department is directing its federal prosecutors to investigate any state or local officials who stand in the way of beefed-up enforcement of immigration laws under the Trump administration … ",
    "url": "https://apnews.com/article/justice-department-immigration-enforcement-f0e3fc616da9746796378d1cd6385b1b"
  },
  {
    "text": "Musk Casts Doubt on Trump's $100 Billion A.I. Announcement  —  Mr. Trump had claimed the A.I. announcement as an early trophy, taking credit for the companies' decision to spend up to $500 billion building data centers.  —  Elon Musk is casting doubt on the first major tech investment announcement … ",
    "url": "https://www.nytimes.com/2025/01/22/us/politics/elon-musk-trump-stargate-ai-announcement.html"
  },
  {
    "text": "Trump Actions to Undermine Drug Prices Will Cost Medicare Recipients Money  —  One of the nearly 200 executive orders that newly inaugurated President Donald Trump signed on Tuesday reversed several critical policies that President Biden had put in place.  Among those was lowering drug costs for Americans.",
    "url": "https://contrarian.substack.com/p/trump-actions-to-undermine-drug-prices"
  },
  {
    "text": "Elon Musk's salute falls flat: Why far-right trolling isn't working this time around  —  As Alexandria Ocasio-Cortez said to defenders of Musk's provocation, “People can officially stop listening to you”  —  One thing that's easy enough to see about Elon Musk's infamous hand gesture … ",
    "url": "https://www.salon.com/2025/01/22/elon-musks-salute-falls-flat-why-far-right-trolling-isnt-working-this-time/"
  },
  {
    "text": "Antioch High School on lockdown: Two people are dead, one stable  —  NASHVILLE, Tenn. (WTVF) — Two students are dead and another student was injured after a shooting inside Antioch High School on Wednesday.  —  According to police, two students were shot by another in the cafeteria.",
    "url": "https://www.newschannel5.com/news/police-two-students-shot-at-antioch-high-school-shooter-turned-gun-on-themself"
  },
  {
    "text": "Trump officials pause health agencies' communications, citing review  —  The agencies are charged with making decisions that touch the lives of every American and are the source of crucial information to health-care providers.  —  The Trump administration has instructed federal health agencies … ",
    "url": "https://www.washingtonpost.com/health/2025/01/21/trump-hhs-cdc-fda-communication-pause/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NDM1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4ODE3OTk5LCJpYXQiOjE3Mzc0MzU2MDAsImp0aSI6ImEzODFhN2UxLTRhOGUtNGFjOS1hNGRmLTEyNDk5ZWIzNGFiOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMS8yMS90cnVtcC1oaHMtY2RjLWZkYS1jb21tdW5pY2F0aW9uLXBhdXNlLyJ9.cY26hIDkmu_AWumnD7uJ1Ge-rGGy5hoacMYbVpbSyJM&itid=gfta"
  },
  {
    "text": "Hegseth's Former Sister-in-Law Says He Believed Women Shouldn't Vote  —  That tracks with the tenets of a religious movement he's involved in.  —  On Tuesday, NBC broke the story of a sworn testimony from the ex-sister-in-law of Pete Hegseth, President Trump's pick for the US Secretary of Defense.",
    "url": "https://www.motherjones.com/politics/2025/01/hegseths-former-sister-in-law-says-he-believed-women-shouldnt-vote/"
  },
  {
    "text": "Biden's letter to Trump revealed: ‘May God bless you and guide you’  —  Trump teased he may release ‘very nice’ letter from Biden  —  The letter that former President Joe Biden wrote to President Donald Trump upon leaving office on Monday has been exclusively obtained by Fox News.",
    "url": "https://www.foxnews.com/politics/bidens-letter-trump-revealed-may-god-bless-you-guide-you"
  }
]