[
  {
    "text": "‘Blitz primary’ could open up Democratic race if Biden drops out  —  The Scoop  —  As the Democratic Party convulses over questions about President Joe Biden's mental fitness, a pair of well-connected Democrats is offering an optimistic plan that would involve the president stepping … ",
    "url": "https://www.semafor.com/article/07/07/2024/blitz-primary-could-open-up-democratic-race-if-biden-drops-out"
  },
  {
    "text": "Fascism and Fear  —  The Moment, The Media, The Election  —  Mainstream media have treated President Biden with prejudice and arrogance.  Quite a few Democrats, reacting to this, treat any mention of President Biden's fitness as disloyalty.  This is mistaken, if understandable.",
    "url": "https://snyder.substack.com/p/fascist-froth"
  },
  {
    "text": "His reelection campaign in crisis, Joe Biden hosts high-stakes NATO Summit in Washington  —  Joey Garrison Francesca ChambersUSA TODAY  —  WASHINGTON — President Joe Biden faces a pivotal moment this week as he prepares to host the leaders of more than 31 nations in Washington with a sudden new mission … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/08/biden-nato-summit-washington-campaign-crisis/74280614007/"
  },
  {
    "text": "Democrats long focused on beating Trump.  Now they're divided on what to do.  —  Biden's age and health-related vulnerabilities have prompted a panicked debate over the best candidate to keep the former president out of the White House.  —  The Monday after President Biden's dismal debate … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/08/biden-trump-democrats-harris-election/"
  },
  {
    "text": "4 more senior Dems call on Biden to stand down from reelection bid  —  Other Democrats also expressed concerns with the president's prospects during a private Sunday call.  —  Several more senior House Democrats called on President Joe Biden to abandon his reelection bid during … ",
    "url": "https://www.politico.com/news/2024/07/07/jerry-nadler-adam-smith-congress-biden-00166733"
  },
  {
    "text": "Scoop: Dem senators' Biden huddle called off … - Details of the proposed meeting leaking out made it impossible for there to be a private conversation, the source said.  — Senate Democrats as a whole will meet Tuesday for a regularly scheduled caucus meeting.",
    "url": "https://www.axios.com/2024/07/07/scoop-dem-senators-biden-huddle-called-off"
  },
  {
    "text": "Radio Host Resigns After Asking Biden Questions His Campaign Had Provided  —  WURD said that the interview with President Biden was not up to its standards and that the host, Andrea Lawful-Sanders, had resigned in a mutual decision.  —  The Philadelphia radio station WURD has parted ways … ",
    "url": "https://www.nytimes.com/2024/07/07/us/politics/biden-interview-radio-host-resigns.html"
  },
  {
    "text": "Radio station parts ways with host who interviewed Biden with questions from his aides  —  Interview “violates our practice” said WURD president and CEO Sara M. Lomax.  The station “is not a mouthpiece for the Biden or any other Administration.”  —  The head of a Philadelphia radio station … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/07/biden-interview-wurd-campaign/"
  },
  {
    "text": "French left beats Le Pen's far right in election shock  —  PARIS  —  The left-wing alliance in France won the most seats in parliament in a dramatic election, dealing a surprise blow to the far-right party of Marine Le Pen.  —  In the first round of voting a week ago Le Pen's National Rally came top … ",
    "url": "https://www.politico.eu/article/france-legislative-election-2024-second-round-front-populaire-jean-luc-melenchon-raphael-glucksmann-shock-victory/"
  },
  {
    "text": "Scoop: How Biden's event staffers guide him behind the scenes … - “I staffed a simple fundraiser at a private residence, but they treated it like it was a NATO summit with his movements,” according to a person who staffed a Biden event in the past 18 months.",
    "url": "https://www.axios.com/2024/07/07/biden-staff-events-prepare"
  },
  {
    "text": "Biden Campaign Ad Targets Trump on Abortion  —  After President Biden's rocky answer on abortion at the debate, his campaign has ramped up its messaging on Donald Trump's role in overturning Roe v. Wade and his policy stances.  —  President Biden's campaign will release a new advertisement … ",
    "url": "https://www.nytimes.com/2024/07/08/us/politics/biden-trump-abortion-ad.html"
  },
  {
    "text": "An America that you won't recognize': Legal scholar Kermit Roosevelt III on SCOTUS and Project 2025  —  The Supreme Court's latest term revealed just how fundamentally the ultraconservative supermajority has changed the dynamics on the court, as well as how dire its ethics issues are.",
    "url": "https://www.msnbc.com/ali-velshi/watch/an-america-that-you-won-t-recognize-legal-scholar-kermit-roosevelt-iii-on-scotus-and-project-2025-214355013697"
  },
  {
    "text": "Behind the Curtain: Trump's dream regime … - A strong president indifferent to pressure. … - A compliant, Republican-controlled Congress. … - A conservative Supreme Court. … - A weakened administrative state. … - Purge hostile federal employees.",
    "url": "https://www.axios.com/2024/07/08/trump-election-2024-dream-government"
  },
  {
    "text": "'I'd Rather Have 10 Ken Starrs Than One Donald Trump'  —  A new book explores the history of presidents who abused their constitutional power and the citizen movements that stopped them.  There's a lesson for a second Trump administration.  —  “Citizens shouldn't give [former President Donald] … ",
    "url": "https://www.politico.com/news/magazine/2024/07/08/presidents-brettschneider-book-qa-00166620"
  },
  {
    "text": "Temperatures 1.5C above pre-industrial era average for 12 months, data shows  —  Copernicus Climate Change Service says results a ‘large and continuing shift’ in the climate  —  The world has baked for 12 consecutive months in temperatures 1.5C (2.7F) greater than their average before the fossil fuel era, new data shows.",
    "url": "https://www.theguardian.com/environment/article/2024/jul/08/temperatures-1-point-5c-above-pre-industrial-era-average-for-12-months-data-shows"
  }
]