[
  {
    "text": "FTC Announces Rule Banning Noncompetes  —  FTC's final rule will generate over 8,500 new businesses each year, raise worker wages, lower health care costs, and boost innovation  —  Today, the Federal Trade Commission issued a final rule to promote competition by banning noncompetes nationwide … ",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2024/04/ftc-announces-rule-banning-noncompetes"
  },
  {
    "text": "U.S. bans noncompete agreements for nearly all jobs  —  The Federal Trade Commission narrowly voted Tuesday to ban nearly all noncompetes, employment agreements that typically prevent workers from joining competing businesses or launching ones of their own.  —  The FTC received … ",
    "url": "https://www.npr.org/2024/04/23/1246655366/ftc-bans-noncompete-agreements-lina-khan"
  },
  {
    "text": "Federal Trade Commission Approves Ban Of Noncompete Agreements  —  Commissioners approved the historic regulation on the grounds that noncompetes stifle competition for workers.  A legal challenge is all but certain.  —  LOADING  —  The Federal Trade Commission on Tuesday voted 3-2 … ",
    "url": "https://www.huffpost.com/entry/federal-trade-commission-approves-ban-noncompete-agreements_n_6622b47ee4b0167f7bf4d211"
  },
  {
    "text": "10 senators helped advance Ukraine aid after voting against it  —  Nine Republicans and one Democrat in the Senate voted Tuesday to advance a package that includes aid for Ukraine and Israel, after opposing the legislation in a vote earlier this year.  —  The package advanced toward a final vote Tuesday in an 80-19 procedural vote.",
    "url": "https://thehill.com/homenews/senate/4616241-ten-senators-helped-advance-ukraine-aid-after-voting-against-it/"
  },
  {
    "text": "McConnell says Tucker Carlson and Trump's waffling delayed crucial Ukraine aid  —  The Senate Republican leader pointed to Carlson's “demonization of Ukraine,” along with Trump's “mixed views” and resistance to additional aid as reasons it's taken so long to pass.",
    "url": "https://www.nbcnews.com/politics/congress/mcconnell-says-tucker-carlson-trumps-waffling-delayed-crucial-ukraine-rcna149057"
  },
  {
    "text": "Secret Service prepares for if Trump is jailed for contempt in hush money case  —  Judge Merchan on Tuesday reserved decision after a contentious hearing.  —  Former President Donald Trump appears in court for his trial at Manhattan Criminal Court on April 23, 2024 in New York City.",
    "url": "https://abcnews.go.com/US/secret-services-prepares-potential-trump-contempt-order-hush/story?id=109542824"
  },
  {
    "text": "Live Updates: Prosecutors Say Trump's Attacks Are Threat to Trial  —  Prosecutors in Donald J. Trump's criminal trial want him held in contempt for attacking witnesses and others close to the case, which centers on a hush-money payment to a porn star.  Testimony is set to resume later Tuesday morning.",
    "url": "https://www.nytimes.com/live/2024/04/23/nyregion/trump-hush-money-trial-news"
  },
  {
    "text": "National Enquirer made up the story about Ted Cruz's father and Lee Harvey Oswald, former publisher says  —  The Texas senator told NBC News that he's “not interested in revisiting ancient history.”  —  David Pecker, the former publisher of the National Enquirer, testified at Donald Trump's trial Tuesday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/national-enquirer-ted-cruz-father-rafael-lee-harvey-oswald-rcna149027"
  },
  {
    "text": "Trump fumes while Biden hits the trail  —  No day demonstrated the extreme asymmetry of the unfolding campaign more than Tuesday.  —  In New York on Tuesday, Donald Trump suffered through a hearing on whether he should be held in contempt of court and testimony from a tabloid publisher on a … ",
    "url": "https://www.politico.com/news/2024/04/23/trump-biden-campaign-trial-00153963"
  },
  {
    "text": "FBI director rejects Trump's vow to investigate political rivals  —  In a wide-ranging interview with NBC News, Christopher Wray also broke with Trump over the former president's characterization of Jan. 6 defendants as “hostages.”  —  Reacting for the first time to former President Donald Trump's vow … ",
    "url": "https://www.nbcnews.com/politics/national-security/fbi-director-rejects-trumps-vow-investigate-political-rivals-rcna149056"
  },
  {
    "text": "Bird flu virus found in grocery milk as officials say supply still safe  —  Viral fragments of bird flu have been identified in samples of milk taken from grocery store shelves in the United States, a finding that does not necessarily suggest a threat to human health but indicates the avian flu virus … ",
    "url": "https://www.washingtonpost.com/health/2024/04/23/bird-flu-virus-milk/"
  },
  {
    "text": "Updates on Highly Pathogenic Avian Influenza (HPAI)  —  Highly Pathogenic Avian Influenza (HPAI) is a disease that is highly contagious and often deadly in poultry, caused by highly pathogenic avian influenza A (H5) and A (H7) viruses; it is also known as bird or avian flu.",
    "url": "https://www.fda.gov/food/alerts-advisories-safety-information/updates-highly-pathogenic-avian-influenza-hpai"
  },
  {
    "text": "The media should be celebrating college protesters instead of demonizing them  —  Mainstream-media reporters covering the growing wave of college protests against Israel's war in Gaza have adopted an overwhelmingly negative tone about something they should be celebrating … ",
    "url": "https://presswatchers.org/2024/04/the-media-should-be-celebrating-college-protesters-instead-of-demonizing-them/"
  },
  {
    "text": "Tennessee passes bill to let teachers carry guns, a year after mass shooting  —  One year after six were killed at Nashville's Covenant School, Tennessee remains the arena of one of the fiercest debates over gun policy nationwide  —  The Tennessee legislature passed a bill Tuesday … ",
    "url": "https://www.washingtonpost.com/nation/2024/04/23/tennessee-bill-arming-teachers-guns-passes/"
  },
  {
    "text": "Kari Lake says ‘unfortunately’ Arizona isn't enforcing 1864 abortion ban, flipping again  —  The Senate candidate supported the 19th-century ban in 2022, came out against it this month, and now appears to be backing it again in a new interview.  —  Arizona GOP Senate candidate Kari Lake … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kari-lake-says-unfortunately-arizona-isnt-enforcing-1864-abortion-ban-rcna148948"
  },
  {
    "text": "No one buys books  —  In 2022, Penguin Random House wanted to buy Simon & Schuster.  The two publishing houses made up 37 percent and 11 percent of the market share, according to the filing, and combined they would have condensed the Big Five publishing houses into the Big Four.",
    "url": "https://www.elysian.press/p/no-one-buys-books"
  },
  {
    "text": "Mass graves in Gaza show victims' hands were tied, says UN rights office  —  Disturbing reports continue to emerge about mass graves in Gaza in which Palestinian victims were reportedly found stripped naked with their hands tied, prompting renewed concerns about possible war crimes amid ongoing … ",
    "url": "https://news.un.org/en/story/2024/04/1148876"
  },
  {
    "text": "Progressives stare down primary challengers  —  Good morning, Early Birds.  The Ramones' debut album came out 48 years ago today.  Their music remains timeless.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2024/04/23/progressives-stare-down-primary-challengers/"
  },
  {
    "text": "Summer Lee, ‘Squad’ Member, Wins Democratic House Primary in Pennsylvania  —  A first-term representative, Ms. Lee defeated a centrist Democrat in a race that centered on her opposition to the war in Gaza.  —  Representative Summer Lee, a first-term progressive Democrat … ",
    "url": "https://www.nytimes.com/2024/04/23/us/politics/lee-pennsylvania-primary.html"
  },
  {
    "text": "Biden rule grants overtime pay to 4 million US workers  —  The administration of U.S. President Joe Biden on Tuesday unveiled a rule extending mandatory overtime pay to an estimated 4 million salaried workers, going even further than an Obama-era rule that was struck down in court.",
    "url": "https://www.reuters.com/world/us/biden-rule-grants-overtime-pay-4-million-us-workers-2024-04-23/"
  },
  {
    "text": "George Santos drops independent House bid  —  Former Rep. George Santos (R-N.Y.) announced Tuesday that he was suspending his independent House bid, just over a month after entering the race.  —  “I have [met] with leaders and with constituents and I have made the decision to hang it up here and stop [pursuing] this race, THIS YEAR!”",
    "url": "https://thehill.com/homenews/campaign/4616359-george-santos-drops-independent-house-bid/"
  }
]