[
  {
    "text": "Full transcript: Read Kristen Welker's interview with Trump  —  NBC's “Meet the Press” moderator Kristen Welker conducted a wide-ranging interview with former President Donald Trump.  —  Full Trump Interview: 'I don't consider us to have much of a democracy right now'",
    "url": "https://www.nbcnews.com/meet-the-press/transcripts/full-transcript-read-meet-the-press-kristen-welker-interview-trump-rcna104778"
  },
  {
    "text": "Trump says it was his decision to persist with 2020 election challenges  —  Former U.S. President Donald Trump said he dismissed the views of his own lawyers in continuing to challenge his 2020 defeat because he did not respect them, saying in an interview aired on Sunday that he had made up his own mind … ",
    "url": "https://www.reuters.com/world/us/trump-says-it-was-his-decision-persist-with-2020-election-challenges-2023-09-17/"
  },
  {
    "text": "Trump says he doesn't worry about going to jail: 'I don't even think about it'  —  Former President Donald Trump isn't losing sleep over the prospect that he could end up behind bars, he said in an exclusive interview with NBC's “Meet the Press” moderator Kristen Welker.",
    "url": "https://www.nbcnews.com/meet-the-press/meet-the-press/trump-doesnt-worry-going-jail-meet-the-press-rcna105312"
  },
  {
    "text": "Jann Wenner Removed From Rock Hall Board After Times Interview  —  The Rolling Stone co-founder's exit comes a day after The New York Times published an interview in which he made widely criticized comments.  —  Jann Wenner, the co-founder of Rolling Stone magazine, has been removed … ",
    "url": "https://www.nytimes.com/2023/09/16/arts/music/jann-wenner-removed-rock-hall.html"
  },
  {
    "text": "Letter shows Pope Pius XII probably knew about Holocaust early on  —  Wartime Pope Pius XII knew details about the Nazi attempt to exterminate Jews in the Holocaust as early as 1942, according to a letter found in the Vatican archives that conflicts with the Holy See's official position … ",
    "url": "https://www.reuters.com/world/letter-shows-pope-pius-xii-probably-knew-about-holocaust-early-2023-09-17/"
  },
  {
    "text": "Pope Pius XII Likely Knew of Holocaust, Newly Discovered Letter Suggests  —  The newly discovered letter, written by a German Jesuit to Pope Pius XII's personal secretary, suggests that the pope knew of Hitler's atrocities but chose to remain silent.  —  A letter found among the private papers … ",
    "url": "https://www.nytimes.com/2023/09/16/world/europe/pope-pius-holocaust.html"
  },
  {
    "text": "Man groped by Lauren Boebert during frisky ‘Beetlejuice’ date owns gay-friendly bar that hosts drag shows  —  A bar owned by Rep. Lauren Boebert's apparent new beau has staged at least one drag show, according to a review of social media posts.  —  In January, the Hooch Craft Cocktail Bar in Aspen … ",
    "url": "https://nypost.com/2023/09/16/lauren-boeberts-new-man-owns-gay-friendly-bar-which-hosts-drag-shows/"
  },
  {
    "text": "McCarthy says defense spending bill will get a vote this week ‘win or lose’  —  House Speaker Kevin McCarthy said Sunday that the Defense Department appropriations bill that was paused last week before it even made it to the floor for debate will come up for a vote this week “win or lose.”",
    "url": "https://www.cnn.com/2023/09/17/politics/mccarthy-defense-congress-appropriations-bill/"
  },
  {
    "text": "Democratic Leaders Are More Optimistic About Biden 2024 Than Voters  —  Party leaders have rallied behind the president's re-election bid, but as one top Democratic strategist put it, “The voters don't want this, and that's in poll after poll after poll.”  —  As President Biden shifts … ",
    "url": "https://www.nytimes.com/2023/09/17/us/politics/biden-democrats-voter-concerns.html"
  },
  {
    "text": "UAW president Shawn Fain says 21% pay hike offered by Chrysler parent Stellantis is a “no-go”  —  United Auto Workers president Shawn Fain said Sunday that the union is rejecting an offer from one of the Big Three automakers for a 21% wage increase as autoworkers for Ford … ",
    "url": "https://www.cbsnews.com/news/uaw-strike-2023-wages-president-shawn-fain-face-the-nation/"
  },
  {
    "text": "EU urges Poland, Hungary, Slovakia to be constructive on Ukraine grain  —  The European Commission called on Poland, Hungary and Slovakia on Sunday to be constructive after they unilaterally declared they would continue to ban grain imports from Ukraine despite the Commission's decision to end the ban.",
    "url": "https://www.reuters.com/world/europe/eu-urges-poland-hungary-slovakia-be-constructive-ukraine-grain-2023-09-17/"
  },
  {
    "text": "Mace on Gaetz's push to oust McCarthy: He should ‘put his money where his mouth is’  —  Rep. Nancy Mace (R-S.C.) called on Rep. Matt Gaetz (R-Fla.) on Sunday to follow through on his vow to introduce a motion to remove Speaker Kevin McCarthy (R-Calif.).  —  “It hasn't happened yet, and I am not going to comment on conjecture here.",
    "url": "https://thehill.com/homenews/house/4208757-mace-on-gaetzs-push-to-oust-mccarthy-he-should-put-his-money-where-his-mouth-is/"
  },
  {
    "text": "'We'll be fine': Top US military officer confident there won't be a Jan. 6 repeat  —  Gen. Milley said he was not concerned about more riot threats after he retires.  —  As former President Donald Trump continues to falsely claim he won the last election while he campaigns … ",
    "url": "https://abcnews.go.com/Politics/fine-top-us-military-officer-confident-jan-6/story?id=103253206"
  },
  {
    "text": "COVID levels are so high, they're hovering near 2020's initial peak, as the WHO urges those at high risk to take any booster they can get their hands on  —  IRFAN KHAN, LOS ANGELES TIMES VIA GETTY IMAGES  —  U.S. COVID infections are hovering near levels of the pandemic's first peak in 2020 … ",
    "url": "https://fortune.com/well/2023/09/16/united-states-covid-levels-approach-first-pandemic-peak-2020-who-urges-vaccination-boosters-high-risk/"
  },
  {
    "text": "Russell Brand accused of rape, sexual assaults and abuse  —  Four women, including one who was just 16, make allegations after an investigation by The Sunday Times, The Times and Channel 4 Dispatches  —  The comedian and actor Russell Brand has been accused of rape, sexual assaults … ",
    "url": "https://www.thetimes.co.uk/article/russell-brand-rape-sexual-assault-abuse-allegations-investigation-v5hxdlmb6"
  }
]