[
  {
    "text": "Newsom pans efforts to block Trump from California ballot  —  A number of California politicians rushed to fast-track efforts to deem Trump ineligible for the presidency after the Colorado Supreme Court's ruling.  —  LOS ANGELES — Gov. Gavin Newsom has a message for California politicians eager … ",
    "url": "https://www.politico.com/news/2023/12/22/newsom-pans-efforts-to-block-trump-from-california-ballot-00133152"
  },
  {
    "text": "Trump asks appeals court to block 2020 election prosecution  —  The argument has fared poorly in other federal courts that have considered it so far.  —  Donald Trump on Saturday night urged a federal appeals court to dismiss special counsel Jack Smith's criminal case against him for seeking … ",
    "url": "https://www.politico.com/news/2023/12/24/trump-asks-appeals-court-to-block-2020-election-prosecution-00133160"
  },
  {
    "text": "Canada's Trudeau says a second Trump presidency could harm climate goals  —  Canadian Prime Minister Justin Trudeau said in an interview that if former President Trump were reelected, it could cause harm for climate goals.  —  Trudeau expressed to the Canadian Broadcasting Corporation (CBC) … ",
    "url": "https://thehill.com/policy/energy-environment/4375031-trudeau-second-trump-presidency-could-harm-climate-goals/"
  },
  {
    "text": "Donald Trump faces many signs of potential political trouble; here are a few of them  —  WASHINGTON - Most presidential candidates look for signs of trouble during campaigns - but none before Donald Trump saw the threats of criminal convictions and getting thrown off the ballot.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/12/24/donald-trump-faces-signs-of-political-trouble-here-are-just-a-few/71983708007/"
  },
  {
    "text": "Trump Pushes Forward in 2024 Run Amid Indictments and Colorado Ruling  —  This week's debate over his very eligibility for office served as a stark reminder that anyone else facing such a wide array of legal problems would have left the political stage long ago.  —  In another era, a politician would have walked away.",
    "url": "https://www.nytimes.com/2023/12/23/us/politics/trump-legal-challenges.html"
  },
  {
    "text": "The Chicks co-founder dies at 65  —  A founding member of the country band The Chicks, formerly known as The Dixie Chicks, has died at the age of 65.  —  “We are shocked and saddened to learn of the passing of Laura Lynch, a founding member of The Chicks,” a Saturday post by the band on Instagram read.",
    "url": "https://thehill.com/blogs/in-the-know/4375485-the-chicks-co-founder-dies-at-65/"
  },
  {
    "text": "Putin Quietly Signals He Is Open to a Cease-Fire in Ukraine  —  Despite its bravado in public, the Kremlin has indicated its interest in striking a deal to halt the war — so long as it could still declare victory.  —  Despite its bravado in public, the Kremlin has indicated its interest … ",
    "url": "https://www.nytimes.com/2023/12/23/world/europe/putin-russia-ukraine-war-cease-fire.html"
  },
  {
    "text": "The elephant in the Giuliani defamation courtroom  —  A jury has ordered Rudy Giuliani to pay $148 million — covering compensatory and punitive damages, and emotional suffering — for defaming Ruby Freeman and Shaye Moss, two poll workers in Atlanta, Georgia, in 2020.  He quickly filed for bankruptcy.",
    "url": "https://thehill.com/opinion/judiciary/4374655-the-elephant-in-the-giuliani-defamation-courtroom/"
  },
  {
    "text": "Biden Convinced Netanyahu to Halt a Pre-Emptive Strike Against Hezbollah  —  Urgent call illustrates Washington's attempts to prevent a widening war in the Middle East  —  WASHINGTON—President Biden urged Israeli Prime Minister Benjamin Netanyahu to halt a pre-emptive strike against Hezbollah forces … ",
    "url": "https://www.wsj.com/world/middle-east/how-biden-averted-a-second-front-by-convincing-israel-not-to-attack-hezbollah-on-oct-11-e14a0a3b?mod=followamazon"
  },
  {
    "text": "Fact-Checking Trump's Recent Immigration Claims  —  As President Biden grapples with an unwieldy crisis at the southern border, his likely 2024 rival has leveled many criticisms — including some baseless and misleading claims.  —  Former President Donald J. Trump has drawn widespread censure … ",
    "url": "https://www.nytimes.com/2023/12/24/us/politics/trump-immigration-fact-check.html"
  },
  {
    "text": "Federal judge denies request to block Massachusetts assault weapons ban  —  A federal judge in Massachusetts shut down an attempt to block the state's assault weapons ban Friday, arguing that the law does not break with recent Supreme Court precedent that has severely shaken gun control legislation.",
    "url": "https://thehill.com/regulation/court-battles/4375035-federal-judge-denies-request-block-massachusetts-assault-weapons-ban/"
  },
  {
    "text": "Oil tanker hit near Indian coast amid maritime hostilities against Israel by Houthis  —  The ship, identified as the Liberian-flagged Chem Pluto, sustains damage but none of its mostly-Indian crew are hurt; Jerusalem believes Iran behind drone strike on high seas",
    "url": "https://www.timesofisrael.com/oil-tanker-hit-near-indian-coast-amid-maritime-hostilities-against-israel-by-houthis/"
  },
  {
    "text": "The Far-Right Pushes a New Conspiracy Theory to Discredit Jack Smith  —  A new conspiracy theory rising on the right is being deployed to help Donald Trump.  —  It claims that Jack Smith, the special counsel who is prosecuting Trump for his attempt to overturn the 2020 election … ",
    "url": "https://www.motherjones.com/politics/2023/12/the-far-right-pushes-a-new-conspiracy-theory-to-discredit-jack-smith/"
  },
  {
    "text": "Scaramucci on Trump's rhetoric compared to Hitler: 'It's a total dog whistle'  —  Former Trump communications director Anthony Scaramucci claimed former President Trump's remarks that drew comparisons to Adolf Hitler, “Mein Kampf” and Nazi Germany are “a total dog whistle.”",
    "url": "https://thehill.com/homenews/campaign/4375154-scaramucci-trumps-rhetoric-a-total-dog-whistle/"
  }
]