[
  {
    "text": "Live Updates: Eric Adams Is Indicted in New York  —  The indictment makes Mr. Adams the first sitting New York City mayor to face criminal charges.  —  Here's the latest on the mayor's indictment.  —  Mayor Eric L. Adams has been indicted on federal criminal charges … ",
    "url": "https://www.nytimes.com/live/2024/09/25/nyregion/eric-adams-indicted-corruption?unlocked_article_code=1.Nk4.RfxD.LvCd4VYdPWrg&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Fox News suddenly changes its tune after Eric Adams indictment unsealed  —  Fox claimed it was an act of retaliation from Biden's DOJ, but that conspiracy theory took a hit after the indictment was unsealed  —  After the indictment of New York Mayor Eric Adams was unsealed … ",
    "url": "https://www.mediamatters.org/fox-news/fox-news-suddenly-changes-its-tune-after-eric-adams-indictment-unsealed"
  },
  {
    "text": "Andrew Cuomo eyes NYC mayor job … The charges have not yet been revealed.  — While Adams is adamant he will not be stepping down, he is already facing a tough Democratic primary next year on top of mounting calls to resign.  — Cuomo's formal entrance into the fray would be a wildcard.",
    "url": "https://www.axios.com/2024/09/26/andrew-cuomo-nyc-mayor-eric-adams-indictment"
  },
  {
    "text": "Eric Adams Live Updates: Adams Is Charged With Bribery and Fraud  —  Mayor Eric Adams, indicted in a lengthy corruption investigation, insisted he was innocent.  Prosecutors are expected to detail the charges on Thursday.  —  Here's the latest on the mayor's indictment.",
    "url": "https://www.nytimes.com/live/2024/09/26/nyregion/eric-adams-indicted-news"
  },
  {
    "text": "Eric Adams indictment unsealed: New York mayor charged in campaign contribution scheme … WATCH NOW  —  A federal indictment charging New York City Mayor Eric Adams with a decade-long campaign contribution scheme, bribery and other crimes was unsealed Thursday morning … ",
    "url": "https://www.cnbc.com/2024/09/26/new-york-city-mayor-eric-adams-indicted-in-federal-court.html"
  },
  {
    "text": "The Undecided Voters Are Not Who You Think They Are  —  For the great majority of Americans who have firmly settled on Kamala Harris or Donald Trump, the idea that anyone could still be undecided in that choice is almost incomprehensible.  But the incredulity may be rooted in confusion about who most undecided voters really are.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/undecided-voters-2024-election/680026/"
  },
  {
    "text": "Kamala Harris Will Win the Popular Vote  —  Here's how we know.  —  Absent an extraordinary upending event, Kamala Harris will win the national popular vote on November 5th.  I'm confident of that not because she is ahead in the polling averages, or because of a “forecast,” conventionally conceived.",
    "url": "https://www.weekendreading.net/p/kamala-harris-will-win-the-popular"
  },
  {
    "text": "Why Donald Trump keeps talking about Kamala Harris's McDonald's job  —  It's a small biographical detail meant to bolster her middle-class bona fides.  But it's also hard to verify — which Trump is happy to exploit.  —  It's one of those little biographical details meant to flavor how voters view a candidate, not to define them.",
    "url": "https://www.washingtonpost.com/politics/2024/09/26/why-donald-trump-keeps-talking-about-kamala-harriss-mcdonalds-job/?wpisrc=nl_most&carta-url=https://s2.washingtonpost.com/car-ln-tr/3f1ca19/66f5840fdb7fbb6fb558da56/59739c93ae7e8a1cf4bc3bf1/22/55/66f5840fdb7fbb6fb558da56"
  },
  {
    "text": "The fruits of Jack Smith's 2-year investigation into Trump will land on Tanya Chutkan's desk today  —  It may be the final inflection point in the case before Nov. 5.  —  Special counsel Jack Smith, stymied at every turn by federal courts from putting Donald Trump on trial … ",
    "url": "https://www.politico.com/news/2024/09/26/jack-smith-trump-investigation-dossier-00181108"
  },
  {
    "text": "House Democrats likely to force action on measure formally reprimanding Clay Higgins  —  Rep. Clay Higgins (R-La.) infuriated many of his House colleagues with his since-deleted racist X post about Haitian migrants, prompting a top Black Democrat to introduce a measure to formally reprimand him that will likely see a floor vote.",
    "url": "https://www.politico.com/live-updates/2024/09/26/congress/dems-seek-censure-of-clay-higgins-00181204"
  },
  {
    "text": "Clay Higgins sets a new benchmark on the racism Republicans will excuse  —  Former Iowa representative Steve King was punished by House leaders for less.  —  In early 2019, at the beginning of the 116th Congress, House Minority Leader Kevin McCarthy (R-Calif.) announced to the media … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/26/clay-higgins-sets-new-benchmark-racism-republicans-will-excuse/"
  },
  {
    "text": "Rudy Giuliani formally disbarred in D.C. … - An ethics panel recommended Giuliani, once a top prosecutor in Manhattan, be disbarred last year, saying in a report, “He sought to disrupt a presidential election and persists in his refusal to acknowledge the wrong he has done.”",
    "url": "https://www.axios.com/2024/09/26/rudy-giuliani-disbarred-dc"
  },
  {
    "text": "You can order free at-home COVID tests from the federal government again: Here's how  —  (NEXSTAR) — Free COVID tests are available once again through a federally-funded program, giving Americans a chance to get four at-home testing kits sent straight to their mailboxes.",
    "url": "https://thehill.com/homenews/nexstar_media_wire/4900850-you-can-order-free-at-home-covid-tests-from-the-federal-government-again-heres-how/"
  },
  {
    "text": "Trump voter turnout program now largely run by Elon Musk-backed group  —  Exclusive: America Pac has up to 400 employees in each of the seven key states, with the campaign dependent on it  —  Donald Trump's mass voter turnout program in crucial battleground states is now principally being run … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/26/trump-voter-turnout-elon-musk-pac"
  },
  {
    "text": "Sweeping bill to overhaul Supreme Court would add six justices  —  The legislation by Sen. Ron Wyden (D-Ore.) is one of the most ambitious efforts to date to remake the Supreme Court following controversies over rulings and ethics.  —  A sweeping bill introduced by a Democratic senator Wednesday … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/26/supreme-court-reform-15-justices-wyden/"
  },
  {
    "text": "Netanyahu distances himself from U.S.-led proposal for ceasefire in Lebanon … - The prime minister's change of course, which comes after public threats by far-right ministers in his government and attacks by Israeli opposition leaders, could increase tensions with the Biden administration.",
    "url": "https://www.axios.com/2024/09/26/lebanon-israel-ceasefire-deal-netanyahu"
  },
  {
    "text": "Vance keeps gaffing by actually detailing Trump's policies  —  “Concepts of a plan” is an easier sell than what they really want to do. … Donald Trump is a scam artist.  He promises voters everything and delivers almost nothing.  That's worked for him in the past, but Trump's current running mate … ",
    "url": "https://www.publicnotice.co/p/jd-vance-gaffes"
  },
  {
    "text": "Why Kamala Harris Has Won Me Over  —  Some deeply consequential decisions are starkly simple.  That is how I view our upcoming presidential election.  And that is why I have already cast my ballot for character — and voted for Vice President Kamala Harris.",
    "url": "https://www.nytimes.com/2024/09/26/opinion/kamala-harris-president.html"
  },
  {
    "text": "Pro-Harris sticky notes pop up in women's restrooms and gyms and on tampon boxes  —  Word about the grassroots campaign has spread on social media, primarily on Facebook, with women putting “Woman to woman” notes in places where other women will see them.  —  In the weeks before Election Day … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-sticky-notes-women-restrooms-gyms-tampon-boxes-rcna172570"
  },
  {
    "text": "In 2004 a senior advisor to President George W. Bush famously told journalist Ron Suskind that people like Suskind lived in “the reality-based community.”  They believed people could find solutions to problems through careful study of discernible reality.  But, the aide continued, Suskind's worldview was obsolete.",
    "url": "https://heathercoxrichardson.substack.com/p/september-25-2024"
  },
  {
    "text": "60 years after the day college students won free speech, their rights are vanishing  —  Years later, somebody would dub them “the Silent Generation.”  But on Oct. 1, 1964 — 60 years ago this Tuesday — a cohort of young people born mostly during World War II, raised in consumer affluence … ",
    "url": "https://www.inquirer.com/opinion/berkeley-60th-anniversary-campus-free-speech-20240926.html?id=bUz6ALuskmlak"
  },
  {
    "text": "Biden, Harris to roll out new executive action on guns  —  The policies would address school shooting drills and machine gun devices.  —  Joe Biden and Kamala Harris announced new executive actions on Thursday to address gun violence, an election-year move that builds the president's legacy … ",
    "url": "https://www.politico.com/news/2024/09/26/biden-harris-to-roll-out-new-executive-action-on-guns-00181026"
  }
]