[
  {
    "text": "Pentagon Set Up Briefing for Musk on Potential War With China  —  The access would be a major expansion of Elon Musk's government role and highlight his conflicts of interest.  —  The Pentagon was scheduled on Friday to brief Elon Musk on the U.S. military's plan for any war that might break out with China … ",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/musk-pentagon-briefing-china-war-plan.html?unlocked_article_code=1.5k4.kMNN.sJA8l_XR5dFL&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Musk to Receive Top-Secret Briefing on U.S. War Plans for China  —  The Trump adviser is expected to get a look at the Pentagon blueprint despite his companies' financial stakes in China and defense contracts  —  WASHINGTON—Elon Musk will receive a briefing Friday on the U.S. military's top-secret war plans … ",
    "url": "https://www.wsj.com/politics/national-security/musk-to-receive-top-secret-briefing-on-u-s-war-plans-for-china-922eafdf?st=HeXKDQ&reflink=article_copyURL_share"
  },
  {
    "text": "Elon Musk threatens Pentagon leakers after NYT report on secret China war briefing  —  “They will be found,” warns U.S. President Donald Trump's billionaire adviser as White House lashes out at the media.  —  Donald Trump's top adviser Elon Musk has openly threatened Pentagon employees … ",
    "url": "https://www.politico.eu/article/elon-musk-threatens-pentagon-leakers-new-york-times-briefing-china-war/"
  },
  {
    "text": "Administration Officials Believe Order Lets Immigration Agents Enter Homes Without Warrants  —  It remains unclear whether the Trump administration will apply the law in this way.  But such an interpretation, experts say, would infringe on basic civil liberties.",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/trump-alien-enemies-immigration-agents.html?unlocked_article_code=1.5U4.I-az.c2sJMDGTtLCE&smid=url-share"
  },
  {
    "text": "Universities are caving to Trump with a stunning speed and scope  —  Some of the nation's oldest and wealthiest institutions are swiftly bending to President Donald Trump, who is acting on longstanding conservative criticisms of universities as elitist and progressive.",
    "url": "https://www.politico.com/news/2025/03/20/universities-cave-conservatives-trump-00241765"
  },
  {
    "text": "‘No Way’ to Please Everyone: Columbia's President Confronts Trump's Ultimatum  —  With Trump intent on making an example of Columbia, Katrina Armstrong is at the center of a fight over the future of higher education  —  Columbia University's interim president, Katrina Armstrong, faces no easy way forward.",
    "url": "https://www.wsj.com/us-news/education/columbia-katrina-armstrong-president-trump-a82eb7d7?st=YH2oHt"
  },
  {
    "text": "Social Security Acting Head Says DOGE Ruling Threatens Agency  —  The Trump administration is threatening to all but shut down the Social Security Administration in response to a judge's ruling blocking activities by Elon Musk's Department of Government Efficiency — an action that could delay payments … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-20/social-security-says-doge-ruling-could-force-agency-to-shut-down?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0MjU2MDcwNiwiZXhwIjoxNzQzMTY1NTA2LCJhcnRpY2xlSWQiOiJTVEcwOFNUMVVNMFcwMCIsImJjb25uZWN0SWQiOiI1NDgxMUFBRTI1Q0U0MkU1QUUyMzJERkEwOEM2QjBBQSJ9.KUJv98EsnF49P_bfTvyC9dTMauEw4wWKGUHcrEHrSQE"
  },
  {
    "text": "GOP push to ratify DOGE cuts runs into political reality  —  Despite widespread interest on Capitol Hill, it's not clear the White House is interested in rescissions.  —  Senate Republicans want to put their stamp on President Donald Trump's cost-cutting campaign and are urging … ",
    "url": "https://www.politico.com/news/2025/03/21/doge-cuts-congress-rescissions-elon-musk-00003620"
  },
  {
    "text": "Big Law Firm Reaches Deal With Trump Over Executive Order  —  Paul, Weiss — one of three law firms targeted by President Trump as part of his retribution campaign — said it resolved the conflict by agreeing to a range of commitments.  —  President Trump and the head of the law firm Paul … ",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/paul-weiss-deal-trump-executive-order-withdrawn.html?unlocked_article_code=1.5k4.pcXA.4YnmBISIg_JL&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "We Dug Into the Polls.  Democrats in Congress Should Be Very Afraid.  —  Democratic voters are even angrier than you think.  —  As Senate Minority Leader Chuck Schumer knows better than anyone, the Democratic base is pissed off.  And not just a little.  —  The intensity of the anger roiling … ",
    "url": "https://www.politico.com/news/magazine/2025/03/21/polling-data-democrats-primaries-grassroots-tea-party-00241769"
  },
  {
    "text": "Scoop: Musk's PAC offers $100 to Wisconsin voters in pitch against “activist judges”  —  Elon Musk's political action committee is offering Wisconsin voters $100 to sign a petition expressing their opposition to “activist judges,” a cause that President Trump is pressing as judges block or delay several parts of his agenda.",
    "url": "https://www.axios.com/2025/03/21/elon-musk-pac-wisconsin-judges"
  },
  {
    "text": "It's not just impeachments.  Republicans are eyeing other ways to rein in federal judges.  —  GOP leaders are seeking a release valve for the fury building over recent court rulings.  —  House Republicans don't have the votes to impeach any federal judges.",
    "url": "https://www.politico.com/news/2025/03/21/congress-judges-gop-impeachments-injunctions-026855"
  },
  {
    "text": "J.D. Vance Is the Most Disliked New Vice President in History  —  The public isn't taking to his obnoxious style, which bodes well for politics in the post-Trump era.  —  Kamala Harris's likability, competence, and political acumen were publicly questioned throughout her vice presidency.",
    "url": "https://washingtonmonthly.com/2025/03/21/j-d-vance-is-the-most-disliked-new-vice-president-in-history/"
  },
  {
    "text": "The Bidens want back in  —  With the Democratic Party struggling to find a new direction, former President Joe Biden and former first lady Jill Biden have offered to jump in and help with fundraising and rebuilding.  —  WASHINGTON — Former President Joe Biden has told some Democratic leaders … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/bidens-want-back-in-rcna196956"
  },
  {
    "text": "“Ludicrous” Situation: Jeffrey Epstein Case Redaction Takes Over FBI's New York Office  —  The bureau's New York field office normally chases drug dealers and spies.  Right now, according to multiple sources, priority one is redacting the sex trafficker's case files.",
    "url": "https://www.vanityfair.com/news/story/epstein-case-review-fbis-new-york"
  },
  {
    "text": "Exclusive: FBI scales back staffing, tracking of domestic terrorism probes, sources say  —  The FBI has cut staffing in an office focused on domestic terrorism and has scrapped a tool used to track such investigations, in a shift that could undermine law enforcement's ability to counter white supremacists … ",
    "url": "https://www.reuters.com/world/us/fbi-scales-back-staffing-tracking-domestic-terrorism-probes-sources-say-2025-03-21/"
  },
  {
    "text": "White House scrambles after JFK files expose Social Security numbers  —  The White House rushes to mitigate the errant release of more than 400 Social Security numbers and other private information in JFK files.  —  After the Social Security numbers of more than 400 former congressional staffers … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/20/trump-jfk-files-personal-data-social-security/"
  },
  {
    "text": "Exclusive: Tesla trade-ins on pace for record high amid Musk backlash  —  Motorists have traded in a record number of Tesla (TSLA.O) electric vehicles this month, Edmunds data showed, amid a wave of protests against CEO Elon Musk's work as an adviser to U.S. President Donald Trump.",
    "url": "https://www.reuters.com/business/autos-transportation/tesla-trade-ins-pace-record-high-amid-musk-backlash-2025-03-20/"
  },
  {
    "text": "In latest blow to Tesla, regulators recall nearly all Cybertrucks  —  U.S. safety regulators on Thursday recalled virtually all Cybertrucks on the road, the eighth recall of the Tesla-made vehicles since deliveries to customers began just over a year ago.  —  The National Highway Traffic … ",
    "url": "https://apnews.com/article/cybertruck-recall-tesla-elon-musk-nhtsa-8c517e21aa1119d74b9db39f6aca01b7"
  },
  {
    "text": "Trump suggests sending Tesla vandals to El Salvador prisons  —  President Trump on Friday suggested sending anti-Tesla protesters to a notorious prison in El Salvador if convicted.  —  Why it matters: Trump has put the full weight of the U.S. government behind defending and promoting … ",
    "url": "https://www.axios.com/2025/03/21/trump-musk-tesla-protests-el-salvador-prisons"
  },
  {
    "text": "State senator resigns after being charged with soliciting sex from a minor  —  Republican lawmaker Justin Eichorn was caught in a sting operation, allegedly soliciting sex from a 17-year-old girl, who turned out to be a law enforcement officer.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/03/21/minnesota-state-senator-justin-eichorn-resigns/"
  },
  {
    "text": "Improving Education Outcomes by Empowering Parents, States, and Communities  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, and to enable parents, teachers, and communities to best ensure student success, it is hereby ordered:",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/improving-education-outcomes-by-empowering-parents-states-and-communities/"
  },
  {
    "text": "Elon Musk received court summons in SEC suit over failure to properly disclose Twitter stake … Elon Musk received a court summons last week in connection with the SEC's lawsuit over his alleged failure to properly disclose purchases of Twitter stock in 2022 before bidding to buy the company, according to a filing on Thursday.",
    "url": "https://www.cnbc.com/2025/03/20/elon-musk-received-summons-in-sec-suit-over-twitter-disclosure.html"
  },
  {
    "text": "Food Banks Left in the Lurch as Some Shipments Are Suspended  —  A representative of a nationwide food pantry network, said U.S.D.A. officials had informed him that some food aid distributed by the federal government was under review.  —  Food banks across the country are scrambling … ",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/food-banks-usda.html"
  },
  {
    "text": "Penta-Gone in 60 Seconds  —  Pentagon spokesperson John Ullyot is being reassigned after his defense of a controversial anti-D.E.I. website purge sparked backlash, a rapid reversal, and a media firestorm.  —  On Thursday, just a day after the Department of Defense abruptly deleted … ",
    "url": "https://www.status.news/p/pentagone-dei-spokesperson-john-ullyot"
  },
  {
    "text": "We ran the wrong headline about Trump firing the FTC commissioners  —  The unlawful removals of Alvaro Bedoya and Rebecca Kelly Slaughter pushed journalistic writing to its limit. … On Tuesday, the president of the United States fired the Democratic commissioners of the Federal Trade Commission … ",
    "url": "https://www.theverge.com/policy/633397/ftc-bedoya-slaughter-democrat-media"
  },
  {
    "text": "Trump DOGE executive claims $1.5 billion savings from IRS technology budget  —  The tech startup executive charged by the Trump administration with reviewing the Internal Revenue Service's technology modernization program said on Thursday that he has canceled contracts worth about $1.5 billion from the tax agency's budget.",
    "url": "https://www.usatoday.com/story/news/politics/2025/03/21/trump-doge-budget-irs/82588542007/"
  },
  {
    "text": "Elon Musk and Donald Trump Have Chosen Chaos  —  Elon Musk secured his choke hold on the mechanics of the federal government weeks ago.  Along with Donald Trump, he has already standardized chaos across the US.  —  Two months into the second Trump administration, the United States is in pure chaos mode.",
    "url": "https://www.wired.com/story/elon-musk-donald-trump-chaos/"
  }
]