[
  {
    "text": "How Mark Meadows Pursued a High-Wire Legal Strategy in Trump Inquiries  —  The former White House chief of staff, a key witness to Donald J. Trump's efforts to remain in power after his 2020 election loss, maneuvered to provide federal prosecutors only what he had to.",
    "url": "https://www.nytimes.com/2023/08/22/us/politics/mark-meadows-trump-legal-strategy.html"
  },
  {
    "text": "Trump attorneys guided false electors in Georgia, GOP chair says  —  The false electors were later used by Trump allies to attempt to foment a conflict on Jan. 6, 2021 and derail the transfer of power to President Joe Biden.  —  Former Georgia Republican Party Chair David Shafer said attorneys … ",
    "url": "https://www.politico.com/news/2023/08/22/trump-indictment-false-electors-00112229"
  },
  {
    "text": "Trump ex-chief Mark Meadows asks judge to protect him from arrest as he seeks to move Georgia case to federal court  — Former Trump chief of staff Mark Meadows asked a federal judge to immediately move the Georgia election case out of state court in order to protect him from being arrested.",
    "url": "https://www.cnbc.com/2023/08/22/trump-ex-aide-meadows-asks-judge-to-protect-him-from-arrest-in-ga-case.html"
  },
  {
    "text": "D.C. Attorney General is probing Leonard Leo's network  —  The Federalist Society co-chair and ex-Trump judicial adviser has utilized nonprofit groups to collect more than $1 billion for conservative causes.  —  Washington D.C. Attorney General Brian Schwalb is investigating judicial activist Leonard Leo … ",
    "url": "https://www.politico.com/news/2023/08/22/d-c-attorney-general-is-probing-leonard-leos-network-00112331"
  },
  {
    "text": "Trump vows massive new tariffs if elected, risking global economic war  —  Former president floats 10 percent tax on all foreign imports and calls for ‘ring around the collar’ of U.S. economy  —  Even in the face of growing personal legal peril, Donald Trump summoned his top economic advisers … ",
    "url": "https://www.washingtonpost.com/business/2023/08/22/trump-trade-tariffs/"
  },
  {
    "text": "Why do Republicans disproportionately believe health misinformation?  —  Rep. Marjorie Taylor Greene (R-Ga.) had only one comment to add when sharing a wildly conspiratorial article alleging that the recent surge in covid cases could be a way to force compliance with vaccination efforts … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/22/republicans-vaccines-polls/"
  },
  {
    "text": "Scoop: Fox News restricts Trump team's access to debate “spin room”  —  Fox News hit back at former President Trump late Monday after he declined to appear at the GOP presidential debate the network will host Wednesday in Milwaukee. … - Trump senior aides who had indicated they'd be in the spin room … ",
    "url": "https://www.axios.com/2023/08/22/fox-news-restricts-trump-campaign-access-debate-spin-room"
  },
  {
    "text": "Audio: Vivek Ramaswamy Says He Wants ‘the Truth About 9/11’  —  The GOP presidential candidate claimed The Atlantic misquoted him.  Listen for yourself.  —  This summer, I set out to write about Vivek Ramaswamy because I thought that his public-speaking skills set him apart from his GOP presidential rivals.",
    "url": "https://www.theatlantic.com/politics/archive/2023/08/vivek-ramaswamy-audio-recording/675076/"
  },
  {
    "text": "‘Cherry-picking’: Candidates lash out at RNC after not making debate stage  —  Perry Johnson said he planned to take legal action.  So did Larry Elder.  And Will Hurd said he thought the RNC cherry-picked polls.  —  The Republican National Committee announced late Monday night … ",
    "url": "https://www.politico.com/news/2023/08/22/republican-debate-2024-participants-00112282"
  },
  {
    "text": "US businessman is wannabe ‘warlord’ of secretive far-right men's network  —  Revealed: Charles Haywood, creator of the Society for American Civic Renewal, has said he might serve as ‘warlord’ at the head of an ‘armed patronage network’  —  The founder and sponsor of a far-right network of secretive … ",
    "url": "https://www.theguardian.com/world/2023/aug/22/charles-haywood-claremont-institute-sacr-far-right"
  },
  {
    "text": "Indicted GOP Rep. Santos Goes on Offense to Reclaim his Narrative  —  The embattled congressman, who is facing felony charges in New York, is ‘sick and tired of the media’ telling his story  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/indicted-ny-rep-santos-goes-on-offense-to-reclaim-his-narrative"
  },
  {
    "text": "Rep. Van Orden says eldest daughter died after battle with cancer  —  Rep. Derrick Van Orden (R-Wis.) said Tuesday that his oldest daughter, Sydney Marie (Van Orden) Martenis, died after a yearlong battle with an aggressive form of cancer.  —  Van Orden said she died “peacefully surrounded by her family” … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/news/4165225-rep-van-orden-says-eldest-daughter-died-after-battle-with-cancer/"
  },
  {
    "text": "State of 2024 Utah GOP Presidential Primary  —  Trump has a Double-Digit Lead in a State that Once Rejected Him  —  Toplines and Crosstabs can be Found Here  —  The 2024 Republican presidential primary is in full swing, and Noble Predictive Insights (NPI) has new data on the state of the race.",
    "url": "https://www.noblepredictiveinsights.com/post/state-of-2024-utah-gop-presidential-primary"
  },
  {
    "text": "Elon Musk plans to remove headlines from news articles shared on X  —  X, the social media platform previously known as Twitter, is planning a major change in how news articles appear on the service, stripping out the headline and other text so that tweets with links display only an article's lead image … ",
    "url": "https://fortune.com/2023/08/21/elon-musk-plans-remove-headlines-news-articles-link-shared-on-x-twitter/"
  },
  {
    "text": "Russian Offensive Campaign Assessment, August 21, 2023  —  Click here to see ISW's interactive map of the Russian invasion of Ukraine.  This map is updated daily alongside the static maps present in this report.  —  Click here to access ISW's archive of interactive time-lapse maps of the Russian invasion of Ukraine.",
    "url": "https://understandingwar.org/backgrounder/russian-offensive-campaign-assessment-august-21-2023"
  },
  {
    "text": "Alaska Gov. Mike Dunleavy endorses Donald Trump  —  Most Republican governors have been hesitant to endorse in the presidential race.  —  Alaska Gov. Mike Dunleavy is endorsing Donald Trump, giving the former president the support of a governor whose state is expected to hold its nominating contest … ",
    "url": "https://www.politico.com/news/2023/08/22/alaska-gov-mike-dunleavy-endorses-donald-trump-00112332"
  },
  {
    "text": "Inside the text-for-pay campaign that got Asa Hutchinson on the debate stage  —  Students were paid $20 a pop for every $1 donation they found for the former Arkansas governor.  —  Live from a Des Moines television studio, Asa Hutchinson, the longshot presidential candidate … ",
    "url": "https://www.politico.com/news/2023/08/22/text-for-pay-campaign-asa-hutchinson-00112298"
  },
  {
    "text": "DeSantis, Ramaswamy to stand center stage at first GOP presidential debate  —  Fox News is hosting the first Republican presidential nomination debate on Wednesday at 9 pm ET in Milwaukee, Wisconsin  —  Florida Gov. Ron DeSantis and biotech entrepreneur Vivek Ramaswamy will stand center stage … ",
    "url": "https://www.foxnews.com/politics/desantis-ramaswamy-stand-center-stage-first-gop-presidential-debate"
  },
  {
    "text": "Shaker Heights attorney who supported Trump jailed for felony voter fraud  —  CLEVELAND, Ohio — A Shaker Heights attorney who donated to ex-President Donald Trump's campaign was convicted Tuesday of election fraud for voting twice in the last two general elections.",
    "url": "https://www.cleveland.com/court-justice/2023/08/shaker-heights-attorney-who-supported-trump-jailed-for-felony-voter-fraud.html"
  },
  {
    "text": "Supreme Court Asked To Hear Case Testing Scope of Affirmative Action Ban  —  A parents group backed by a conservative legal organization asked the U.S. Supreme Court on Monday to consider whether an admissions policy aimed at diversifying an elite Virginia high school is racially discriminatory.",
    "url": "https://freebeacon.com/latest-news/supreme-court-asked-to-hear-case-testing-scope-of-affirmative-action-ban/"
  },
  {
    "text": "Majority of likely Iowa GOP caucusgoers believe Trump won the 2020 election  —  The new NBC News/Des Moines Register/Mediacom poll shows Trump's unfounded claims he won the last election remain salient ahead of the Iowa GOP caucus.  —  More than half of likely Iowa Republican caucusgoers … ",
    "url": "https://www.nbcnews.com/politics/2024-election/majority-likely-iowa-gop-caucusgoers-say-trump-won-2020-election-rcna100955"
  },
  {
    "text": "Ukraine's Forces and Firepower Are Misallocated, U.S. Officials Say  —  American strategists say Ukraine's troops are too spread out and need to concentrate along the counteroffensive's main front in the south.  —  Ukraine's grinding counteroffensive is struggling to break through entrenched Russian defenses … ",
    "url": "https://www.nytimes.com/2023/08/22/us/politics/ukraine-counteroffensive-russia-war.html"
  },
  {
    "text": "Sen. Rick Scott picks up a Democratic challenger for 2024  —  Former Rep. Debbie Mucarsel-Powell announced Tuesday that she's taking on the incumbent Republican in what's considered an uphill climb for Democrats.  —  Former Democratic Rep. Debbie Mucarsel-Powell announced Tuesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rep-debbie-mucarsel-powell-challening-rick-scott-senate-2024-rcna101023"
  }
]