[
  {
    "text": "Read the Full Transcript of President Joe Biden's Interview With TIME  —  President Joe Biden sat down for an interview with TIME at the White House on May 28.  —  Over the course of the interview, Biden spoke at length about his foreign policy agenda, including his views on China, Taiwan … ",
    "url": "https://time.com/6984968/joe-biden-transcript-2024-interview/"
  },
  {
    "text": "‘We Are the World Power.’ How Joe Biden Leads … Joe Biden makes his way through the West Wing telling stories.  In the Cabinet Room, with sun pouring through French doors from the Rose Garden outside, he remembers the first time he sat around the long mahogany table, its high-backed leather chairs ordered by seniority.",
    "url": "https://time.com/6984970/joe-biden-2024-interview/"
  },
  {
    "text": "‘You Nazi piece of s—’: Hunter Biden's wife confronts Trump ally in hallway outside gun trial  —  Garrett Ziegler was involved with the efforts to make public Hunter Biden's laptop to embarrass his father in the final days of the 2020 election.  —  WILMINGTON, Del. … ",
    "url": "https://www.nbcnews.com/politics/politics-news/-nazi-piece-s-hunter-bidens-wife-confronts-trump-ally-hallway-gun-tria-rcna155450"
  },
  {
    "text": "Hunter Biden Didn't ‘Knowingly’ Lie to Buy Gun, Lawyer Says  — Opening arguments start in criminal trial of president's son  — ‘No one is above the law,’ prosecutor tells jury in Delaware  —  Hunter Biden didn't knowingly lie when he filled out a form to buy a gun in 2018 and checked … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-04/hunter-biden-didn-t-knowingly-lie-to-buy-gun-his-lawyer-says"
  },
  {
    "text": "FACT SHEET: President Biden Announces New Actions to Secure the Border  —  New actions will bar migrants who cross our Southern border unlawfully from receiving asylum  —  Biden taking action as Congressional Republicans put partisan politics ahead of national security, twice voting against toughest reforms in decades",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/06/04/fact-sheet-president-biden-announces-new-actions-to-secure-the-border/"
  },
  {
    "text": "Wisconsin attorney general files felony charges against attorneys, aide who worked for Trump in 2020  —  Wisconsin Attorney General Josh Kaul filed felony forgery charges Tuesday against two attorneys and an aide who helped submit paperwork falsely saying that former President Donald Trump had won the battleground state in 2020.",
    "url": "https://apnews.com/article/wisconsin-fake-electors-trump-2020-charges-77d00919fc8d8e07438076610090a9b1"
  },
  {
    "text": "Trump asks judge to terminate gag order in hush money case  —  Lawyers for Donald Trump asked the judge overseeing his criminal hush money case to terminate the gag order against the former president, saying it's no longer justified since the trial is over.  —  “Now that the trial is concluded … ",
    "url": "https://www.cnn.com/2024/06/04/politics/trump-gag-order-request-merchan"
  },
  {
    "text": "Colorado Republican Party issues call to burn all Pride flags  —  The party's shift toward extremism continued with a nod to an infamous anti-gay slur and an invitation to burn Pride flags.  —  COLORADO, USA — The Colorado Republican Party marked the start of Pride Month with a mass email attacking … ",
    "url": "https://www.9news.com/article/news/local/local-politics/colorado-gop-call-burn-gay-pride-flags/73-e5156582-2888-46d2-b535-d5981c149817"
  },
  {
    "text": "‘Horrible mistake’: GOP senators urge RNC to back off Hogan  —  Republicans are moving to head off a long-term war between Larry Hogan and former President Donald Trump's allies, including the RNC, as Hogan faces one of the toughest ticket-splitting efforts in modern politics.",
    "url": "https://www.politico.com/live-updates/2024/06/04/congress/republicans-rnc-hogan-senate-maryland-trump-00161514"
  },
  {
    "text": "Don't let MAGA theatrics fool you: Donald Trump's 34 felony convictions are not helping him  —  Many people mistake cynicism for savviness.  So, of course, it took no time at all for some political pundits to rush forward to declare that Donald Trump's historic 34 felony convictions would somehow “help” him.",
    "url": "https://www.salon.com/2024/06/04/dont-let-maga-theatrics-fool-you-donald-34-felony-convictions-are-not-helping-him/"
  },
  {
    "text": "Married to the Mob  —  To understand Trump, we need to understand how a mob boss operates.  A key point is this: He keeps people with direct knowledge of his criminality close, and he often buys their silence with all that illegally gotten money.  —  A mob boss like Trump is head … ",
    "url": "https://statuskuo.substack.com/p/married-to-the-mob"
  },
  {
    "text": "Rent monopoly crackdown continues as FBI raids corporate landlord for 18 Arizona properties  —  Federal agents raided a property management company operating in Arizona as part of an investigation into price-fixing rent, marking a distinct escalation in the renewed push to enforce consumer protection laws.",
    "url": "https://coppercourier.com/2024/06/03/federal-investigation-arizona-apartments-rent-monopoly/"
  },
  {
    "text": "Garland slams attacks on the Justice Department, telling lawmakers: ‘I will not be intimidated’  —  Attorney General Merrick Garland is forcefully rebuking what he describes as “unprecedented” attacks on the Justice Department, telling Republicans on the House Judiciary Committee who have sought … ",
    "url": "https://apnews.com/video/u-s-department-of-justice-u-s-republican-party-legal-proceedings-law-enforcement-democracy-aec65d9ee33b400db8ea94b7282bc229"
  },
  {
    "text": "House passes ICC sanctions resolution with 42 Democrats breaking from party  —  .  —  The House passed a resolution on Tuesday that would impose sanctions on the International Criminal Court if it attempts to prosecute the United States or its allies, a move championed by Republicans … ",
    "url": "https://www.washingtonexaminer.com/news/house/3027248/house-passes-icc-sanctions-resolution-with-42-democrats-breaking-from-party/"
  },
  {
    "text": "Trump Allies Sue to Allow Election Officials to Refuse to Certify Results  —  The America First Policy Institute is representing an election-denying election official who wants the discretion to refuse to certify results … A Republican election official in Georgia's largest county … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-think-tank-lawsuit-election-officials-refuse-certify-results-1235032235/"
  },
  {
    "text": "Nigel Farage Gets Milkshaked by OnlyFans Model on First Day of His Campaign  —  STRAW POLL  —  It's not the first time this has happened.  —  Nigel Farage's surprise campaign for the upcoming British general election got off to a sticky start Tuesday when someone chucked a milkshake in his face.",
    "url": "https://www.thedailybeast.com/nigel-farage-immediately-takes-a-milkshake-to-the-face-on-his-first-day-of-campaigning"
  },
  {
    "text": "The case for imprisoning Donald Trump  —  Trump's status renders his offense far more serious and his behavior during the case indefensible, thus making a prison sentence more plausible.  —  By Frank O. Bowman III, author of “High Crimes & Misdemeanors: A History of Impeachment for the Age of Trump”",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/donald-trump-jail-sentence-trial-verdict-rcna155323"
  }
]