[
  {
    "text": "Giuliani Is Liable for Defaming Georgia Election Workers, Judge Says  —  The ruling means that a defamation case against Rudolph W. Giuliani, stemming from his role in seeking to overturn the 2020 election, can proceed to a trial where damages will be set.  —  A federal judge ruled on Wednesday … ",
    "url": "https://www.nytimes.com/2023/08/30/us/politics/giuliani-defamation-georgia.html"
  },
  {
    "text": "Rudy Giuliani is liable for defaming Georgia election workers, judge rules  —  U.S. District Court Judge Beryl Howell ordered Giuliani to pay the two election workers punitive damages.  —  A federal judge ruled Wednesday that Rudy Giuliani is legally liable for defaming two Georgia election workers … ",
    "url": "https://www.politico.com/news/2023/08/30/judge-rules-giuliani-is-liable-for-defaming-georgia-election-workers-orders-sanctions-00113462"
  },
  {
    "text": "Rudy Giuliani liable for defaming Georgia election workers, hit with sanctions by judge  — A federal judge issued a default judgment against former Trump lawyer Rudy Giuliani in a civil conspiracy lawsuit filed by two Georgia election workers.  — Judge Beryl Howell also ordered … ",
    "url": "https://www.cnbc.com/2023/08/30/judge-orders-default-judgment-sanctions-against-rudy-giuliani-in-election-workers-lawsuit.html"
  },
  {
    "text": "How Mark Meadows' Testimony May Have Just Helped Prosecutors  —  Mark Meadows made his surprise appearance in court on Monday, and while what he said may have seemed innocuous, it could be much more damning than anyone thinks.  —  For years now, Mark Meadows has avoided answering questions … ",
    "url": "https://www.thedailybeast.com/how-mark-meadows-testimony-may-have-just-helped-prosecutors"
  },
  {
    "text": "Proud Boy Enrique Tarrio's January 6 sentencing abruptly postponed due to ‘emergency’  —  The sentencing for Enrique Tarrio, the former chair of the Proud Boys, was postponed unexpectedly on Wednesday morning “due to an emergency,” according to the U.S. attorney's office in Washington, D.C.",
    "url": "https://www.washingtonexaminer.com/policy/courts/proud-boy-enrique-tarrior-january-6-sentenced-abruptly-postponed-emergency"
  },
  {
    "text": "Proud Boys leader Enrique Tarrio's sentencing delayed in seditious conspiracy case  —  Washington — Former Proud Boys leader Enrique Tarrio's sentencing hearing has been delayed, due to an emergency, the U.S. attorney's office said in a press release Wednesday morning.",
    "url": "https://www.cbsnews.com/news/proud-boys-leader-enrique-tarrio-sentencing-seditious-conspiracy-case/"
  },
  {
    "text": "Is Judge Cannon preparing to kneecap Trump's Florida documents case?  —  Spoiler alert: Yes. … Last year, Judge Aileen Cannon tried valiantly to derail the Justice Department's investigation of Donald Trump's retention of classified documents at his Florida country club.",
    "url": "https://www.publicnotice.co/p/judge-aileen-cannon-trump-florida-documents-case"
  },
  {
    "text": "A 6-figure Donald Trump donor is now a No Labels adviser  —  A major Republican donor and one-time financial backer of former President Donald Trump is now a leader in the Florida chapter of No Labels' third-party presidential bid.  —  Allan Keen, a Florida-based real estate developer … ",
    "url": "https://www.politico.com/news/2023/08/30/trump-donor-no-labels-adviser-00113395"
  },
  {
    "text": "Biden Labor Department moves to expand overtime pay for millions  —  Workers making less than about $55,000 annually would be automatically entitled to time-and-a-half pay under DOL's proposal.  —  The Biden administration on Wednesday proposed giving raises to more than 3 million workers by making them eligible for overtime pay.",
    "url": "https://www.politico.com/news/2023/08/30/biden-labor-department-over-time-00113457"
  },
  {
    "text": "Tennessee House Speaker silences critic, avoids vote on alleged residency fraud  —  On Monday, Tennessee Representative Justin Jones (D) distributed a letter to his colleagues in the Tennessee House announcing his intention to call a vote of no confidence in House Speaker Cameron Sexton (R).",
    "url": "https://popular.info/p/update-tennessee-house-speaker-silences"
  },
  {
    "text": "Trump Could Clinch the Nomination Before the G.O.P. Knows if He's a Felon  —  The federal election interference case — one of four — is set to start just before Super Tuesday and a cascade of consequential primaries.  —  By the time Donald J. Trump is sitting at his federal trial on charges … ",
    "url": "https://www.nytimes.com/2023/08/30/us/politics/trump-gop-calendar.html"
  },
  {
    "text": "A.O.C. at 33: ‘Evolving,’ ‘Learning,’ But Not Ready to Call Herself an Insider  —  The congresswoman from New York says she's different from when she first took office.  But she's not ready to call herself an insider.  —  Representative Alexandria Ocasio-Cortez is used to being a lightning rod.",
    "url": "https://www.nytimes.com/2023/08/30/us/politics/aoc-third-term-congress.html"
  },
  {
    "text": "DeSantis tells Biden: Keep your IRA money  —  The governor is blocking Biden's IRA benefits from Floridians.  There's not much Dems can do about it.  —  President Joe Biden is offering one of his White House challengers hundreds of millions of dollars to spend in his state.",
    "url": "https://www.politico.com/news/2023/08/30/desantis-refuses-biden-climate-ira-money-00113397"
  },
  {
    "text": "Jeffries endorses Ilhan Omar amid AIPAC primary threat  —  Democratic leadership is sending a message to progressives who are worried about primary challenges from the pro-Israel group: Caucus leaders plan to support all incumbents.  —  When Pramila Jayapal faced fierce blowback in mid-July … ",
    "url": "https://www.politico.com/news/2023/08/30/hakeem-jeffries-endoreses-ilhan-omar-aipac-00113394"
  },
  {
    "text": "Joe Manchin and Daughter Pitch $100 Million Project to Boost Centrist Policies  —  West Virginia senator and former Mylan CEO Heather Manchin have held meetings with major donors  —  Sen. Joe Manchin and his daughter Heather Manchin are pitching major political donors on a nascent effort … ",
    "url": "https://www.wsj.com/politics/policy/joe-manchin-and-daughter-pitch-100-million-project-to-boost-centrist-policies-155d19da?mod=followamazon"
  },
  {
    "text": "North Korea and Russia meet over arms deal, U.S. intel reveals  —  The White House says Vladimir Putin and Kim Jong-Un exchanged letters about working together.  —  New U.S. intelligence shows North Korea and Russia are “actively advancing” high-level talks for additional weapons … ",
    "url": "https://www.politico.com/news/2023/08/30/north-korea-russia-meet-over-arms-deal-00113471"
  },
  {
    "text": "Judge says Peter Navarro can't use privilege as defense in contempt case  —  A judge ruled Wednesday that Peter Navarro, a Trump White House adviser charged with criminal contempt of Congress, cannot argue to a jury that he was barred by executive privilege from providing testimony and documents … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/30/peter-navarro-defense-executive-privilege-trump/"
  },
  {
    "text": "Dem Senate plots move amid spending clash with House GOP  —  Majority Leader Chuck Schumer is tentatively planning to bring up several spending bills for floor votes in mid-September.  —  The Senate is preparing its first big move in the fall spending fight.",
    "url": "https://www.politico.com/news/2023/08/30/schumer-spending-senate-house-gop-00113447"
  },
  {
    "text": "Playbook: The House GOP mulls some impeachment hypocrisy  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  FLORIDA LATEST — Via the National Hurricane Center: “IDALIA RAPIDLY INTENSIFIES INTO A CATEGORY 4 HURRICANE ... CATASTROPHIC STORM SURGE AND DESTRUCTIVE WINDS … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/30/the-house-gop-mulls-some-impeachment-hypocrisy-00113436"
  },
  {
    "text": "Over 100 former clerks of Justice Thomas sign open letter defending his integrity, independence  —  112 of Justice Thomas' former clerks say news stories attacking him are ‘part of larger attack on the Court’ and its ‘legitimacy’  —  EXCLUSIVE - Over 100 former clerks of Supreme Court Justice … ",
    "url": "https://www.foxnews.com/politics/over-100-former-clerks-justice-thomas-sign-open-letter-defending-his-integrity-independence"
  }
]