[
  {
    "text": "Special Counsel asks Supreme Court to immediately decide Trump immunity question  —  A federal judge had rejected former President Donald Trump's immunity claim over his prosecution in election interference case.  —  WASHINGTON — Special Counsel Jack Smith on Monday asked the Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/special-counsel-asks-supreme-court-immediately-decide-trump-immunity-q-rcna129088"
  },
  {
    "text": "Jack Smith asks Supreme Court to keep Trump trial on track  —  Without the Supreme Court's swift intervention, Trump's federal election-subversion trial could be indefinitely delayed, the special counsel warned.  —  Special counsel Jack Smith is urging the Supreme Court … ",
    "url": "https://www.politico.com/news/2023/12/11/trump-supreme-court-jack-smith-trial-00131112"
  },
  {
    "text": "Iowa Poll: Donald Trump holds overwhelming lead; Ron DeSantis edges ahead of Nikki Haley  —  A new nationally renowned Iowa Poll shows that a shrinking field has only made Donald Trump's lead grow as Nikki Haley and Ron DeSantis fail to capitalize on powerful endorsements",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2023/12/11/iowa-poll-ron-desantis-nikki-haley-unable-to-shrink-donald-trumps-overwhelming-lead-iowa-caucuses/71850893007/"
  },
  {
    "text": "Wall Street donors dreamed of a Trump alternative.  Now they're waking up.  —  Setting aside Trump's recent noodling on what he could accomplish in a one-day dictatorship, markets are increasingly wary of how U.S. political disruptions can ripple across the global financial system.",
    "url": "https://www.politico.com/news/2023/12/11/wall-street-never-trump-00131024"
  },
  {
    "text": "Trump Has Found a Dangerous Workaround to Gag Orders  —  Donald Trump will have a number of opportunities to violate gag orders in the coming months.  He may have just found a dangerous loophole.  —  Donald Trump is, once again, outmaneuvering the American court system.",
    "url": "https://www.thedailybeast.com/trump-has-found-a-dangerous-workaround-to-gag-orders"
  },
  {
    "text": "Trump Isn't Entitled to Appeal Gag Order to New York's Top Court, State AG Argues  —  The personal safety of judge's clerk far outweighs Trump's “minimal interest in levying personal attacks” at her, the attorney general says  —  JWPlayer  —  Former President Donald Trump should not be allowed … ",
    "url": "https://themessenger.com/politics/trump-gag-order-new-york-appeal-supreme-court"
  },
  {
    "text": "Civil rights lawyer Sherrilyn Ifill leaving X after Alex Jones account reinstated  —  Prominent civil rights attorney Sherrilyn Ifill announced she is leaving X, the social media platform formerly known as Twitter, due to the Elon Musk-owned platform reinstating far-right conspiracy theorist Alex Jones's account.",
    "url": "https://thehill.com/homenews/4354003-sherrilyn-ifill-leaving-x-alex-jones-musk/"
  },
  {
    "text": "Still Annoyed at Biden, New Hampshire Democrats Gear Up to Help Him  —  Despite being bumped down the presidential calendar, Democrats in the state are planning a write-in campaign for the president, who won't be on New Hampshire primary ballots.  —  New Hampshire Democrats were furious … ",
    "url": "https://www.nytimes.com/2023/12/11/us/politics/biden-new-hampshire-primary-2024.html"
  },
  {
    "text": "CNN Polls: Trump leads Biden in Michigan and Georgia as broad majorities hold negative views of the current president  —  Former President Donald Trump has the upper hand over President Joe Biden in two critical battleground states - Michigan and Georgia - with broad majorities … ",
    "url": "https://www.cnn.com/2023/12/11/politics/cnn-polls-trump-biden-michigan-georgia/"
  },
  {
    "text": "Organized journalistic crime  —  On July 19, the Washington Post Editorial Board published an impassioned column calling for an aggressive national response to organized retail crime (ORC).  The Editorial Board described ORC as “the term security specialists use to distinguish planned … ",
    "url": "https://popular.info/p/organized-journalistic-crime"
  },
  {
    "text": "The Texas abortion case blows up the abortion ban rationale  —  Abortion rights activists, medical professionals and ordinary women warned the Supreme Court in advance of the Dobbs v. Jackson Women's Health Organization decision: Legislatures cannot dictate medical decisions without creating horrendous injustices and medical travesties.",
    "url": "https://www.washingtonpost.com/opinions/2023/12/11/abortion-ban-texas/"
  },
  {
    "text": "Air Force disciplines 15 for ‘lack of supervision’ after massive leak of classified docs  —  The Air Force inspector general cited a ‘lack of supervision’ and ‘culture of complacency’ in the leak of classified documents.  —  WASHINGTON - The Air Force disciplined 15 members of the National Guard … ",
    "url": "https://www.usatoday.com/story/news/politics/2023/12/11/air-force-disciplines-15-discord-classified-documents-jack-teixeira/71879578007/"
  },
  {
    "text": "Supreme Court rejects challenge to Washington state ‘conversion therapy’ ban  —  Over the objection of three conservatives, the court left in place a state law that bars therapists from counseling minors to change sexual orientation or gender identity, a practice favored by some conservatives.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-challenge-washington-state-conversion-therapy-ba-rcna122364"
  },
  {
    "text": "Majority of Americans Back Israel as Democrats Split Over War With Hamas, WSJ Poll Finds  —  Republicans and independents are more sympathetic to Israelis than Palestinians; Biden gets low marks for handling of conflict  —  WASHINGTON—U.S. public opinion remains favorable toward Israel … ",
    "url": "https://www.wsj.com/politics/majority-of-americans-back-israel-as-democrats-split-over-war-with-hamas-wsj-poll-finds-030f22c2?mod=followamazon"
  },
  {
    "text": "Israel used U.S.-supplied white phosphorus in Lebanon attack  —  DHEIRA, Lebanon — Israel used U.S.-supplied white phosphorus munitions in an October attack in southern Lebanon that injured at least nine civilians in what a rights group says should be investigated as a war crime … ",
    "url": "https://www.washingtonpost.com/investigations/2023/12/11/israel-us-white-phosphorus-lebanon/"
  },
  {
    "text": "‘It was chaos’: Witness recounts seeing vehicle drive through religious group in downtown Billings  —  BILLINGS — The Billings Police Department on Sunday released more information regarding the arrest of 55-year-old Genevienne Rancuret after she allegedly drove a vehicle through a religious group … ",
    "url": "https://www.ktvq.com/news/crime-watch/it-was-chaos-witness-recounts-seeing-group-driven-through-in-downtown-billings"
  },
  {
    "text": "Macron Suffers Setback After Lawmakers Reject Immigration Bill  — Parties across lower house back motion to prevent debate  — French president has been struggling to build coalitions  —  French lawmakers rejected Emmanuel Macron's plan to overhaul immigration in a blow … ",
    "url": "https://www.bloomberg.com/news/articles/2023-12-11/macron-suffers-setback-as-lawmakers-reject-immigration-bill"
  },
  {
    "text": "New Hampshire man charged with death threat to Vivek Ramaswamy  — Federal prosecutors charged a New Hampshire man with threatening to kill a Republican presidential candidate and his supporters during a campaign stop in Portsmouth.  — The man, 30-year-old Tyler Anderson of Dover … ",
    "url": "https://www.cnbc.com/2023/12/11/man-threatened-to-kill-gop-presidential-candidate-vivek-ramaswamy-doj.html"
  },
  {
    "text": "Key McConnell ally makes endorsement in crucial swing state race that could flip Senate red  —  Arizona Senate race expected to be one of most closely watched of 2024 election cycle  —  EXCLUSIVE: A key ally of Senate Minority Leader Mitch McConnell, R-Ky., has decided which candidate … ",
    "url": "https://www.foxnews.com/politics/key-mcconnell-ally-makes-endorsement-crucial-swing-state-race-flip-senate-red"
  },
  {
    "text": "Tucker Carlson Is Launching His Own Streaming Service  —  ‘Tucker Carlson Network’ is expected to go live on Monday and cost $9 a month  —  Tucker Carlson is launching his own subscription streaming service, people familiar with the matter said, the former Fox News host's official foray … ",
    "url": "https://www.wsj.com/business/media/tucker-carlson-is-launching-his-own-streaming-service-5fc2f9ba?mod=followamazon"
  }
]