[
  {
    "text": "Hunter Biden verdict throws ‘sand in the gears’ of GOP's attacks on legal system  —  Other Republicans were all over the map, including Rep. Matt Gaetz (R-Fla.), who called it “kinda dumb tbh.”  —  Former President Donald Trump's campaign cast Hunter Biden's guilty verdict on felony gun charges Tuesday as a … ",
    "url": "https://www.politico.com/news/2024/06/11/trump-campaign-hunter-biden-reaction-00162726"
  },
  {
    "text": "A Guilty Verdict for Hunter Biden Weighs on a Worried President Biden  —  The president, who is in the middle of a re-election fight, has grown more resigned and afraid about what the future might hold for his son, according to people close to them.  —  Hunter Biden was waiting for his father on the tarmac.",
    "url": "https://www.nytimes.com/2024/06/11/us/politics/hunter-joe-biden-guilty-verdict.html"
  },
  {
    "text": "Jurors detail to CNN how they reached guilty verdict in Hunter Biden gun trial  —  The jury in the Hunter Biden gun case was deadlocked in an initial vote Monday night over whether to convict the president's son, one of the jurors told CNN in an interview, adding that “no politics came into play” … ",
    "url": "https://www.cnn.com/2024/06/11/politics/hunter-biden-jury/"
  },
  {
    "text": "Six suspected terrorists with ISIS ties arrested in sting operation in New York, Los Angeles and Philadelphia: sources  —  Six Russian nationals suspected to have terror ties to ISIS have been arrested in a coordinated sting operation spanning Los Angeles, New York and Philadelphia, The Post can exclusively reveal.",
    "url": "https://nypost.com/2024/06/11/us-news/six-suspected-terrorists-with-isis-ties-arrested-in-sting-operation/"
  },
  {
    "text": "‘Unfit For Office’: Paul Ryan Torches Trump In Scathing Fox News Interview  —  The former House speaker slammed the ex-president and current GOP candidate for putting himself above the Constitution.  —  LOADING  —  Former Republican House Speaker Paul Ryan tore into former President Donald Trump … ",
    "url": "https://www.huffpost.com/entry/paul-ryan-trump-unfit-for-office_n_6668f73ae4b01bc0ceedab6a"
  },
  {
    "text": "North Carolina House Passes Revised Mask Ban  —  In a crackdown on protesters, the state is hampering people from wearing masks.  —  On Tuesday, the North Carolina GOP Representatives passed a mask ban on private property in a crackdown on protesters, even as a new subvariant of coronavirus spreads across the United States.",
    "url": "https://www.motherjones.com/politics/2024/06/north-carolina-house-passes-revised-mask-ban/"
  },
  {
    "text": "NC House sends changes to masking and campaign finance laws to Gov. Cooper  —  Restrictions on masks, in a bill revised by legislative Republicans last week to include an unrelated, controversial campaign finance provision, are headed to the desk of Gov. Roy Cooper after a final vote Tuesday.",
    "url": "https://www.newsobserver.com/news/politics-government/article289178384.html"
  },
  {
    "text": "New Audio: Alito Bashes ProPublica for Reporting on Supreme Court Ethics  —  In a new, secret recording, the Supreme Court justice suggests partisan funding is to blame for coverage of justices' undisclosed luxury gifts  —  IN A NEW recording, Supreme Court Justice Samuel Alito lashes … ",
    "url": "https://www.rollingstone.com/politics/politics-features/samuel-alito-supreme-court-recording-propublica-windsor-1235037796/"
  },
  {
    "text": "Alito's ‘Godliness’ Comment Echoes a Broader Christian Movement  —  Justice Samuel Alito's secretly recorded remarks come as many conservatives have openly embraced the view that American democracy must be grounded in a Christian worldview.  —  It's a phrase not commonly associated with legal doctrine … ",
    "url": "https://www.nytimes.com/2024/06/11/us/samuel-alito-christianity-law-democracy.html"
  },
  {
    "text": "Gaza Chief's Brutal Calculation: Civilian Bloodshed Will Help Hamas  —  Yahya Sinwar's correspondence with compatriots and mediators shows he is confident that Hamas can outlast Israel",
    "url": "https://www.wsj.com/world/middle-east/gaza-chiefs-brutal-calculation-civilian-bloodshed-will-help-hamas-626720e7"
  },
  {
    "text": "Shawn Fain and UAW face new problems with president under investigation by federal watchdog  —  .  —  The United Auto Workers and the union's President Shawn Fain scored a major victory with strikes of the Big Three Detroit automakers, but the union has new problems, according to a federal watchdog investigation.",
    "url": "https://www.washingtonexaminer.com/news/justice/3037013/shawn-fain-uaw-face-new-problems-federal-watchdog/"
  },
  {
    "text": "Scoop: GOP's Garland contempt vote hanging by a thread … - Republicans want to hold Garland in contempt for refusing to give Congress the audiotapes of President Biden's interview with former Special Counsel Robert Hur.  — But the vote is in danger of being pulled off the schedule … ",
    "url": "https://www.axios.com/2024/06/11/gop-garland-contempt-vote-doubt"
  },
  {
    "text": "Dark money news outlets outpacing local daily newspapers … - As of last year, there were only 1,213 daily local newspapers in the U.S. That number may have gone down significantly in the time since, but the researchers who track that data have yet to release an updated figure for 2024.",
    "url": "https://www.axios.com/2024/06/11/partisan-news-websites-dark-money"
  },
  {
    "text": "“False gospel”: The new GOP attack on Dolly Parton is a tactic borrowed from the Christian right  —  Fundamentalists disparage mainstream culture as “demonic” — Republicans just substitute the word “woke”  —  It was inevitable that Republicans would go after Dolly Parton.",
    "url": "https://www.salon.com/2024/06/11/false-gospel-the-new-on-dolly-parton-is-a-tactic-borrowed-from-the-christian-right/"
  },
  {
    "text": "Resilience Part 2 (or Thoughts on Sam Alito's DGAF Justicehood)  —  I think a lot about resilience.  It's actually an underlying concern that forms a lot of my political opinions.  Not about policy, though perhaps that too in some way, but politics in the sense of elections and how coalitions … ",
    "url": "https://talkingpointsmemo.com/edblog/resilience-part-2-or-thoughts-on-sam-alitos-dgaf-justicehood/sharetoken/Y8snIS0q4CvM"
  },
  {
    "text": "Sam Alito Clearly Thinks He's Untouchable  —  In an interview with Vanity Fair, Congressman Hank Johnson attacked the “arrogance” of the Supreme Court justice and his wife, both of whom were caught in a secret recording expressing deeply partisan views: “They are extremists.”",
    "url": "https://www.vanityfair.com/news/story/supreme-court-justice-samuel-alito-thinks-he-is-untouchable"
  },
  {
    "text": "Judge strikes down Florida's anti-trans care ban, citing animus  —  Florida's ban on gender-affirming medical care for minors and several of the provisions restricting such care for adults are unconstitutional, a federal judge ruled on Tuesday, finding after trial that animus impermissibly motivated … ",
    "url": "https://www.lawdork.com/p/hinkle-florida-anti-trans-ban-ruling"
  },
  {
    "text": "9th Circuit says California ban on gun sales on state property is constitutional  —  California laws barring the sale of firearms and ammunition at fairgrounds and other state property are constitutional, the U.S. 9th Circuit Court of Appeals ruled Tuesday.  —  Judge Richard R. Clifton … ",
    "url": "https://www.latimes.com/california/story/2024-06-11/9th-circuit-says-california-ban-on-gun-sales-on-state-property-is-constitutional"
  },
  {
    "text": "Globally, Biden Receives Higher Ratings Than Trump  —  Still, most disapprove of how Biden has dealt with the Israel-Hamas war  —  Table of Contents Table of Contents  — Views of the U.S.  — Confidence in Biden, Trump and other world leaders  — Differences by ideology, age and gender 1. Views of the U.S.",
    "url": "https://www.pewresearch.org/global/2024/06/11/globally-biden-receives-higher-ratings-than-trump/"
  },
  {
    "text": "Nancy Mace Defeats G.O.P. Challenger, Dealing Blow to McCarthy's Revenge Tour  —  The South Carolina congresswoman turned back a primary challenger backed by former Speaker Kevin McCarthy, who has been trying to exact retribution against Republicans who voted to oust him.",
    "url": "https://www.nytimes.com/2024/06/11/us/politics/nancy-mace-primary.html"
  },
  {
    "text": "Sen. Lindsey Graham says he will block Democrats' effort to unanimously pass Supreme Court ethics bill  —  The South Carolina Republican's objection means the bill won't be able to move forward under a unanimous consent request, which any senator can block.  —  Sen. Lindsey Graham … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-lindsey-graham-says-will-block-democrats-effort-unanimously-pass-s-rcna156669"
  },
  {
    "text": "GOP primary to replace South Carolina Rep. Jeff Duncan heads to runoff  —  The race to replace Rep. Jeff Duncan (R-SC) as the Republican nominee in South Carolina's 3rd Congressional District will head to a runoff after none of the seven GOP candidates won a majority of the vote in Tuesday's election.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/congressional/3038330/gop-primary-replace-south-carolina-jeff-duncan-runoff/"
  }
]