[
  {
    "text": "RNC fires dozens of employees after Trump-backed leadership takes over  —  About 60 people were told they were no longer employed, according to a person with direct knowledge  —  The new leadership team at the Republican National Committee — handpicked by former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/11/rnc-trump-firings/"
  },
  {
    "text": "Adding to an ugly record, Trump mocks Biden's stutter (again)  —  Donald Trump's fractured relationship with human decency is especially evident when it comes to those with disabilities.  —  A couple of months ago, while on the campaign trail in Iowa, Donald Trump had plenty … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/adding-ugly-record-trump-mocks-bidens-stutter-rcna142802"
  },
  {
    "text": "Some journalists seem bored by the biggest story of our lifetimes  —  At the New York Times, the journalists count on politics for amusement.  It's a sporting event, a cage match.  Republicans vs. Democrats, Sharks vs. Jets, gladiators vs. lions.  —  The folks at the Times have settled … ",
    "url": "https://www.stopthepresses.news/p/some-journalists-seem-bored-by-the"
  },
  {
    "text": "Who posted the $91 million bond for Trump?  Follow the Russian connections.  —  Trump Posts $92 Million Bond to Support Jury Award to E. Jean Carroll in Defamation Suit - Time  —  Where did the money for the bond come from?  Read Seth Abaramson's article.",
    "url": "https://thedemlabs.org/2024/03/11/chubb-posts-91-million-bond-for-trump-defamation-case-follow-russian-connections/"
  },
  {
    "text": "Trump's renewed attacks against E. Jean Carroll open the door for new lawsuit, lawyer says  —  An attorney for a longtime advice columnist who won an $83.3 million defamation award against Donald Trump suggested Monday that a new defamation lawsuit was possible against the ex-president … ",
    "url": "https://apnews.com/article/e-jean-carroll-trump-defamation-columnist-9a9932b83d2f7dcae1b63701f6405352"
  },
  {
    "text": "Calling Out a Would-Be Bully In Chief  —  To ignore bad behavior is to normalize it.  Here at Steady we will continue to publicize Donald Trump's outrageous conduct as long as he exhibits it.  —  Insecurity Parading as Strength  —  At a Saturday campaign rally in Georgia, Trump mocked President Biden's stutter.",
    "url": "https://steady.substack.com/p/calling-out-a-would-be-bully-in-chief"
  },
  {
    "text": "For Trump, a Blizzard of Court Action Is Just Another Monday  —  A lawyer for E. Jean Carroll suggested she could sue the former president again, and his lawyers filed a last-ditch request to delay his upcoming Manhattan criminal trial.  —  For anyone but Donald J. Trump, Monday's legal docket would have induced dizziness.",
    "url": "https://www.nytimes.com/2024/03/11/nyregion/trump-carroll-bond.html"
  },
  {
    "text": "Boeing whistleblower found dead in US  —  Prior to his death, whistleblower John Barnett was testifying against Boeing over concerns about standards.",
    "url": "https://www.bbc.com/news/business-68534703"
  },
  {
    "text": "Robert Hur will testify as private citizen with help from Trumpworld figures  —  EXCLUSIVE: Ex-Special Counsel arranged to leave Justice Department the day before his appearance with the House Judiciary Committee  —  Special Counsel Robert Hur to testify on Biden's handling of classified documents",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/robert-hur-trump-special-counsel-b2510944.html"
  },
  {
    "text": "Exclusive: ‘Trump Employee 5,’ who unknowingly helped move classified documents, speaks out  —  Watch the full interview with Kaitlan Collins at 9 p.m. ET Monday on “The Source.”  —  CNN  —  A longtime Mar-a-Lago employee who is a central witness in the investigation … ",
    "url": "https://www.cnn.com/2024/03/11/politics/trump-employee-5-classified-documents-mar-a-lago/"
  },
  {
    "text": "Biden unveils a budget that would cut costs for families and hike taxes for the rich  —  The White House unveiled a new $7.3 trillion federal budget proposal on Monday, a plan that would hike taxes on billionaires and large corporations to pay for programs that would cut costs for families.",
    "url": "https://npr.org/2024/03/10/1237398034/biden-2025-budget-proposal"
  },
  {
    "text": "House GOP report aims to undermine Jan. 6 committee … - A senior Democratic congressional aide called the report “yet another attempt to rewrite the history of January 6th and whitewash the events of that horrible, bloody, and violent day.”  — Rep. Bennie Thompson (D-Miss.) … ",
    "url": "https://www.axios.com/2024/03/11/house-republican-report-jan-6-committee"
  },
  {
    "text": "Florida teachers can discuss sexual orientation and gender ID under 'Don't Say Gay' bill settlement  —  Students and teachers will be able to speak freely about sexual orientation and gender identity in Florida classrooms, provided it's not part of instruction, under a settlement reached … ",
    "url": "https://apnews.com/article/florida-dont-say-gay-bill-settlement-987904b3e19122d719cf468034746b6e"
  },
  {
    "text": "Britt backlash stokes GOP fears about losing women voters  —  Sen. Katie Britt's (R-Ala.) State of the Union response is shining a light on the GOP's struggle to appeal to women voters ahead of November's elections.  —  The rebuttal was met with an avalanche of backlash for being out of touch … ",
    "url": "https://thehill.com/homenews/campaign/4524790-britt-backlash-stokes-gop-fears-about-losing-women-voters/"
  },
  {
    "text": "Biden effigy beaten, kicked at Kansas county GOP event, drawing outrage  —  A Republican fundraiser in the Kansas City suburbs on Friday night at which attendees beat and kicked an effigy of President Biden has sparked bipartisan outrage and calls for the GOP leaders responsible for the event to resign.",
    "url": "https://www.washingtonpost.com/nation/2024/03/11/biden-effigy-kansas-republican-event/"
  },
  {
    "text": "Enthusiasm wanes among Black voters who powered Biden's 2020 Georgia win  —  Much has changed since Wanda Mosley helped galvanize thousands of Black voters across the battleground state of Georgia to help clinch the 2020 general election for U.S. President Joe Biden.",
    "url": "https://www.reuters.com/world/us/enthusiasm-wanes-among-black-voters-who-powered-bidens-2020-georgia-win-2024-03-11/"
  },
  {
    "text": "Trump Stumbles Through Word Salad On Banning Or Not Banning TikTok In CNBC Hit  —  Former President Donald Trump stumbled and rambled his way through a meandering answer when CNBC host Andrew Ross Sorkin asked him about banning TikTok.  —  Trump recently came out against banning TikTok … ",
    "url": "https://www.mediaite.com/news/trump-stumbles-through-word-salad-on-banning-or-not-banning-tiktok-in-cnbc-hit/"
  },
  {
    "text": "US intelligence report states Netanyahu's viability to lead Israel is in jeopardy  —  The US intelligence community assesses Israeli Prime Minister Benjamin Netanyahu's “viability as a leader” to be “in jeopardy,” according to its annual report on the national security threats facing … ",
    "url": "https://www.cnn.com/2024/03/11/politics/us-intelligence-report-netanyahu"
  },
  {
    "text": "‘Absolute bloodbath’ at RNC as new leadership loyal to Trump purges staff  —  Chair Michael Whatley and co-chair Lara Trump move to reorganize the party, with an expected cull of 60 members  —  Donald Trump's new leadership team at the Republican National Committee started the process … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/11/new-rnc-leadership-trump-loyals-purge-staff"
  },
  {
    "text": "John Kelly Shares His ‘Theory’ On Why Trump Likes Dictators So Much: New Book  —  The book by CNN's Jim Sciutto also contains quotes about the former president's reported “admiration” of Hitler.  —  LOADING  —  John Kelly, Donald Trump's former White House chief of staff … ",
    "url": "https://www.huffpost.com/entry/john-kelly-jim-sciutto-book_n_65eed279e4b0bd5228d4bd22"
  }
]