[
  {
    "text": "Hamas announces it has accepted an Egyptian-Qatari cease-fire proposal  —  Israel's army has told Palestinians to temporarily evacuate from parts of Rafah in southern Gaza, signaling that a ground invasion is imminent.  People were told to move to Muwasi, an Israeli-declared humanitarian area near the coast.",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-humanitarian-aid-8659eae6e0a7362504f0aa4aa4be53e0"
  },
  {
    "text": "After Cease-Fire Talks Stall, Hamas Proposes New Terms … Israel and the U.S. say they are reviewing Hamas's response.  —  A day after Gaza cease-fire talks reached an impasse, Hamas on Monday laid out new terms for a cease-fire that its leaders said they would accept.",
    "url": "https://www.nytimes.com/live/2024/05/06/world/israel-gaza-war-hamas"
  },
  {
    "text": "Why I'm voting for Biden and other Republicans should, too  —  Donald Trump has disqualified himself through his conduct and his character,  —  It's disappointing to watch an increasing number of Republicans fall in line behind former president Donald Trump.",
    "url": "https://www.ajc.com/opinion/geoff-duncan-why-im-voting-for-biden-and-other-republicans-should-too/LFLE5YWCBBA6VDGJAJKMNPCDKQ/"
  },
  {
    "text": "Georgia Republican backs Biden, blasts those in party who ‘fall in line’ with Trump  —  Former Georgia Lt. Governor Geoff Duncan (R) revealed Monday he would be backing President Biden in November's election and criticized other Republicans who “fall in line” with former President Trump.",
    "url": "https://thehill.com/homenews/campaign/4646773-georgia-republican-backs-biden-blasts-those-in-party-who-fall-in-line-with-trump/"
  },
  {
    "text": "GOP Rep. Collins responds to criticism of Ole Miss post  —  Rep. Mike Collins (R-Ga.) defended his decision to share a video of counterprotesters at the University of Mississippi harassing a Black woman at a pro-Palestine protest last week, responding to criticism that he was endorsing racist conduct.",
    "url": "https://thehill.com/homenews/house/4646786-gop-rep-collins-responds-to-criticism-of-ole-miss-post/"
  },
  {
    "text": "Congressman praises racist heckling.  Will his corporate backers stand by him?  —  On Thursday, Jaylin Smith, a graduate student at the University of Mississippi, participated in a small, non-violent protest calling for a ceasefire in Gaza.  Smith and the other protesters were greeted … ",
    "url": "https://popular.info/p/congressman-praises-racist-heckling"
  },
  {
    "text": "Ole Miss Student Kicked Out of Fraternity After Video Caught Racist Gestures Toward Protester  —  Video footage of a student making racist gestures, seemingly imitating a monkey, toward a Black woman who was part of a scheduled pro-Palestinian protest at the University of Mississippi … ",
    "url": "https://time.com/6974979/university-of-mississippi-protest-racist-monkey-gesture-fraternity/"
  },
  {
    "text": "U.S. soldier detained in Russia, officials say  —  The soldier, who was stationed in Korea and traveled to Russia on his own, is accused of stealing from a woman.  —  A U.S. soldier was detained in Russia over the weekend, according to four U.S. officials.",
    "url": "https://www.nbcnews.com/politics/politics-news/us-soldier-detained-russia-officials-say-rcna150928"
  },
  {
    "text": "Trump interferes with House GOP messaging on Cuellar indictment … - The National Republican Congressional Committee plans to accuse Democrats of a double standard if they stay mum on Cuellar following their pressure on ex-Rep. George Santos (R-N.Y.) to resign, Politico reports.",
    "url": "https://www.axios.com/2024/05/06/trump-house-gop-cuellar-resign"
  },
  {
    "text": "Kristi Noem's Team Told Her to Nix the Dog Story Two Years Ago  —  She violated the first rule of campaign memoirs: Do no harm.  —  Kristi Noem's story about killing her dog made headlines across America.  But it wasn't news to people who worked on her first book, where the tale … ",
    "url": "https://www.politico.com/news/magazine/2024/05/06/kristi-noem-dog-killing-story-00156290"
  },
  {
    "text": "House Republicans plan to move forward with contempt against Attorney General Merrick Garland  —  The move comes after the DOJ declined House Republicans' requests to hand over audio of then-special counsel Robert Hur's interview with President Joe Biden.  —  WASHINGTON — The House Judiciary … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-plan-move-forward-contempt-attorney-general-merrick-rcna150937"
  },
  {
    "text": "Hunter Biden's revenge  —  Smear campaigns have consequences.  —  ∙ Paid … Have you noticed that after years of saturation coverage, Fox News hosts have suddenly cooled it on the Hunter Biden stuff?  There's a reason for that.  —  Last week, Fox News pulled the six-part series … ",
    "url": "https://www.publicnotice.co/p/hunter-biden-sues-fox-news-explained"
  },
  {
    "text": "White House: Noem should ‘stop digging herself into a hole’ after suggestion to shoot Biden's dog  —  The White House on Monday said that South Dakota Gov. Kristi Noem (R) should “stop digging herself into a hole” after she suggested that President Biden's dog, Commander, should haven been shot after biting Secret Service agents.",
    "url": "https://thehill.com/homenews/administration/4646927-white-house-noem-biden-dog/"
  },
  {
    "text": "400 Rich People Pay $40K to Hear Trump Glorify Cop Assailants  —  On Saturday, a bunch of people paid a lot of money — at least $40,0000 apiece, and one or two people took Trump up on an offer to speak if they gave $1 million — to hear Trump glorify cop assailants.",
    "url": "https://www.emptywheel.net/2024/05/06/400-rich-people-pay-40k-to-hear-trump-glorify-cop-assailants/"
  },
  {
    "text": "Right-Wing Nonprofit Paid Millions to Companies With Ties to Insiders  —  The Conservative Partnership Institute's three highest-paid contractors had connections to the group's leaders or their relatives, raising concerns about self-dealing.  —  The Conservative Partnership Institute … ",
    "url": "https://www.nytimes.com/2024/05/06/us/politics/trump-conservative-partnership-institute-funds.html"
  },
  {
    "text": "‘We deserve more’: US workers' share of the pie dwindles  —  Bureau of Labor Statistics releases latest estimate of how much labor receives of national income, showing bleak decline  —  When Jesse Motte began working at a Starbucks inside a Target store in Columbia, South Carolina, more than two years ago, $15 an hour sounded great.",
    "url": "https://www.theguardian.com/us-news/article/2024/may/06/workers-income-labor-"
  },
  {
    "text": "Joe Kahn: ‘The newsroom is not a safe space’  —  The Scene  —  Q&A  —  Ben Smith: Dan Pfeiffer, who used to work for Barack Obama, recently wrote of the Times: “They do not see their job as saving democracy or stopping an authoritarian from taking power.”  Why don't you see your job as: “We've got to stop Trump?”",
    "url": "https://www.semafor.com/article/05/05/2024/joe-kahn-the-newsroom-is-not-a-safe-space"
  },
  {
    "text": "Sen. Bernie Sanders Will Run For Reelection  —  The 82-year-old Vermont independent is seeking a fourth term in the Senate.  —  LOADING  —  WASHINGTON ― Sen. Bernie Sanders (I-Vt.) announced on Monday his intention to seek reelection to a fourth term in the Senate, citing the threats to democracy at home and abroad.",
    "url": "https://www.huffpost.com/entry/bernie-sanders-reelection_n_6638f12ae4b00641c4961dff"
  },
  {
    "text": "Congress voted against funding a cure for cancer just to block a win for Biden  —  Some Republicans, refusing to give President Joe Biden a ‘win,’ voted against the renewal of funding for cancer research.  Vote for those who do not politicize Americans' health.  —  I'm afraid I have some bad news.",
    "url": "https://www.usatoday.com/story/opinion/voices/2024/05/05/biden-cancer-moonshot-initiative-congress-funding/73525016007/"
  },
  {
    "text": "Trump's lawyers are trying to use his trial to generate conspiracy theories — but it's not working  —  Even the most MAGA-deluded voters struggle to pretend Trump is the victim in the Stormy Daniels plot  —  Donald Trump's lawyers famously spend a lot of their time placating … ",
    "url": "https://www.salon.com/2024/05/06/lawyers-are-trying-to-use-his-trial-to-generate-conspiracy-theories--but-its-not-working/"
  }
]