[
  {
    "text": "Trump Is Losing The Post-Debate Debate, Too  —  Plus: A bomb threat in Springfield.  —  Donald Trump has an announcement: He won the first debate against Kamala Harris so handily, and was praised so universally for doing so, that he really doesn't see a need to take the stage with her again.",
    "url": "https://www.thebulwark.com/p/trump-is-losing-the-post-debate-debate"
  },
  {
    "text": "Biden Slams Trump Over False Story of Pet-Eating Immigrants: ‘This Has to Stop’  —  The president made the comments at an event where he boasted of his work for Black Americans, implicitly trying to rally a critical Democratic constituency on behalf of Vice President Kamala Harris.",
    "url": "https://www.nytimes.com/2024/09/13/us/politics/biden-trump-haitian-immigrants-cats-dogs.html"
  },
  {
    "text": "Trump allies alarmed by far-right activist's influence on him … - “Marjorie Taylor Greene is right. … - Greene, a GOP firebrand known for her politically provocative speeches in Congress, has had a series of disagreements with Loomer long before this week.",
    "url": "https://www.axios.com/2024/09/13/trump-allies-far-right-activist-loomer"
  },
  {
    "text": "MAGA Civil War: How Trump Campaign Chief Tried to Whack Laura Loomer  —  MAGA CIVIL WAR LATEST  —  The former president's co-campaign manager Susie Wiles is now part of the civil war going on around Trump.  —  Former president Donald Trump moved to hire his racist firebrand pal Laura Loomer … ",
    "url": "https://www.thedailybeast.com/donald-trump-campaign-chief-susie-wiles-killed-laura-loomer-bid-to-get-hired"
  },
  {
    "text": "Biden administration expected to unveil new evidence of RT's key role in Russian intelligence operations globally  —  The Biden administration is expected on Friday to announce a major effort to blunt the global influence of RT and expose what it says is the Russian state media network's key role … ",
    "url": "https://www.cnn.com/2024/09/13/politics/biden-administration-rt-russian-intelligence"
  },
  {
    "text": "RT running covert military supply operation for Russian forces, State Dept. says  —  The state-backed media outlet has been sending weapons to Russian units, including sniper rifles and suppressors, body armor, night vision equipment and drones, according to State.",
    "url": "https://www.politico.com/news/2024/09/13/rt-military-supply-russia-00179107"
  },
  {
    "text": "US hits Russian state media with sanctions for raising money for Moscow's troops in Ukraine  —  The U.S. State Department announced new sanctions on Russian state media Friday, accusing a Kremlin news outlet of working hand-in-hand with the Russian military and running fundraising campaigns … ",
    "url": "https://apnews.com/article/russia-putin-trump-sanctions-harris-rt-f7e3ff262fdf24695048cffe2529b937"
  },
  {
    "text": "Moooooods!!!!  —  Donald Trump's flailing performance at Tuesday night's debate triggered a multiday right-wing freakout at the ABC News moderators, punctuated by calls from the former president and his allies to target the network and its parent company with a regulatory crackdown, congressional investigation, and even prosecutions.",
    "url": "https://www.mediamatters.org/donald-trump/rights-post-debate-assault-abc-preview-trumps-authoritarian-agenda"
  },
  {
    "text": "If True, the ABC News Presidential Debate Could Be Rocked by Explosive Scandal  —  Anyone who watched the presidential debate hosted by ABC News on Tuesday knows that the moderators were biased and repeatedly fact-checked Trump while letting Kamala Harris's lies go unchallenged.",
    "url": "https://pjmedia.com/matt-margolis/2024/09/12/if-true-the-abc-news-presidential-debate-could-be-rocked-by-explosive-scandal-n4932479"
  },
  {
    "text": "Texas comes for the right to interstate travel  —  States' rights for me, not for thee. … During Tuesday's debate, as Donald Trump tried to take credit for the demise of Roe while pretending a second Trump administration wouldn't obliterate abortion protections at a national level … ",
    "url": "https://www.publicnotice.co/p/texas-medical-records-abortion"
  },
  {
    "text": "How Elon Musk Secretly Tried to Oust a Texas Prosecutor  —  In a bid to counter George Soros, the Tesla chief executive unsuccessfully backed the opponent of a progressive district attorney  —  Elon Musk secretly channeled hundreds of thousands of dollars into a local race in Travis County … ",
    "url": "https://www.wsj.com/us-news/elon-musk-texas-da-jose-garza-oust-atempt-206db043?st=0r4kfh0mlpe0euo"
  },
  {
    "text": "Triple Hearsay: Original Sources of the Claim that Haitians Eat Pets in Ohio Admit No First-Hand Knowledge  —  “I'm not sure I'm the most credible source because I don't actually know the person who lost the cat,” Kimberly Newton told NewsGuard.  She is the Springfield, Ohio, resident whose story started it all",
    "url": "https://www.newsguardrealitycheck.com/p/origins-haitians-eating-pets-claim"
  },
  {
    "text": "Nebraska ballot can include competing measures to expand or limit abortion rights, high court rules  —  The Nebraska Supreme Court ruled Friday that competing measures that would expand or limit abortion rights can appear on the November ballot.  —  The high court's ruling came days … ",
    "url": "https://apnews.com/article/abortion-ballot-measures-nebraska-a545d1cb44b18cf37084e4a62e27019a"
  },
  {
    "text": "Martha Stewart Just Quietly Made a Rare Presidential Endorsement  —  ‘KEEP IT QUIET’  —  After declining to endorse a candidate in 2020, Stewart has finally broken her silence on the 2024 election. … Martha Stewart has finally weighed in on the 2024 election and endorsed a candidate.",
    "url": "https://www.thedailybeast.com/martha-stewart-just-quietly-endorsed-kamala-harris-for-president"
  },
  {
    "text": "The ‘feral 25-year-olds’ making Kamala Harris go viral on TikTok  —  Harris's “digital rapid response” operation and all-Gen-Z TikTok team are tapping the trends and rhythms of internet culture to create an online presence that's unique in presidential politics.",
    "url": "https://www.washingtonpost.com/technology/2024/09/13/harris-tiktok-social-media-team/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2MjAwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI3NTgyMzk5LCJpYXQiOjE3MjYyMDAwMDAsImp0aSI6IjM2NmU0NzM2LWVkZTEtNGMwNS1iMGFjLTZjMjNjNTdiNmY3MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDkvMTMvaGFycmlzLXRpa3Rvay1zb2NpYWwtbWVkaWEtdGVhbS8ifQ.RWqlnFXoyxhpX8b0_e9bperwKF_uJDLS1-UQUsKnopc&itid=gfta"
  },
  {
    "text": "Bipartisan group of lawmakers signs pledge to certify 2024 election results  —  More than 30 House members, including a half-dozen Republicans, have signed a bipartisan pledge to uphold the results of the 2024 election amid an increased focus on Congress' role in certifying the tally next January.",
    "url": "https://www.politico.com/live-updates/2024/09/13/congress/house-centrists-vow-to-certify-2024-election-00178945"
  },
  {
    "text": "Why Gavin Newsom could ban legacy admissions  —  A bill on the governor's desk would ban legacy preferences at California's universities.  It's not just leftists who are on board.  —  SACRAMENTO, California — Gov. Gavin Newsom could soon be the second governor to ban legacy admissions … ",
    "url": "https://www.politico.com/news/2024/09/12/gavin-newsom-ban-legacy-admissions-00179002"
  },
  {
    "text": "Is There More to JD Vance's MAGA Alliance Than Meets the Eye?  —  The New Right has a blueprint for taking power.  JD Vance could be following it.  —  JD Vance's political career has been defined by an apparent paradox.  On the one hand, Vance is a member of the upper echelon of America's ruling elite … ",
    "url": "https://www.politico.com/news/magazine/2024/09/13/jd-vance-new-right-political-movement-00177203"
  },
  {
    "text": "America's stores are winning the war on shoplifting  —  New York CNN  —  A year ago, America's stores declared a shoplifting epidemic.  They closed stores in major cities, hired extra security, locked up key merchandise and declared big losses in their financial statements.",
    "url": "https://www.cnn.com/2024/09/13/business/theft-retail-shrink-stores/"
  }
]