[
  {
    "text": "Trump raised so much last month he erased Biden's cash advantage  —  Trump's fundraising while he was on trial in New York, punctuated in the final days when he was convicted, was enough to surpass the incumbent Democrat when it comes to campaign cash.  —  Former President Donald Trump's huge … ",
    "url": "https://www.politico.com/news/2024/06/21/trump-overtakes-biden-campaign-fundraising-00164384"
  },
  {
    "text": "Trump's shocking cash comeback  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BIDEN'S CASH EDGE DISAPPEARS — Yesterday, we hit the latest FEC filing deadline for presidential campaigns, super PACs and party committees.",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/21/trumps-shocking-cash-comeback-00164386"
  },
  {
    "text": "Supreme Court upholds domestic violence gun restriction  —  The case was a test for how far the court's conservative majority is willing to go in backing gun rights following a major ruling in 2022.  —  WASHINGTON — The Supreme Court on Friday upheld a federal law that prohibits people subjected … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-upholds-domestic-violence-gun-restriction-rcna137782"
  },
  {
    "text": "Clarence Thomas Says Domestic Abusers Should Own Guns  —  BOOM  —  He wrote the lone dissent as the Supreme Court overwhelmingly upheld the constitutionality of a federal ban on gun ownership on Friday.  —  The Supreme Court on Friday overwhelmingly upheld the constitutionality of a federal ban … ",
    "url": "https://www.thedailybeast.com/supreme-court-justice-clarence-thomas-says-domestic-abusers-should-own-guns"
  },
  {
    "text": "Newly named Washington Post editor decides not to take job after backlash, will stay in Britain  —  The Washington Post said Friday that newly named editor Robert Winnett has decided not to take the job and remain in Britain instead, another upheaval at a news outlet where a reorganization plan has gone disastrously wrong.",
    "url": "https://apnews.com/article/washington-post-editor-england-telegraph-quits-e650409305a2f1011926306791bc97b1"
  },
  {
    "text": "Robert Winnett will not join The Post as editor  —  Robert Winnett, hired by Washington Post publisher William Lewis, faced questions about his U.K. work, including stories based on stolen records.  —  Robert Winnett, the British journalist recently tapped to become editor of The Washington Post later … ",
    "url": "https://www.washingtonpost.com/style/media/2024/06/21/robert-winnett-steps-down-washington-post-lewis-buzbee/"
  },
  {
    "text": "Bragg Asks Judge to Extend Trump's Gag Order, Citing Deluge of Threats  —  Donald J. Trump claims the order has unfairly restricted his free speech rights ahead of his sentencing on 34 felony counts.  He has nonetheless attacked the judge, prosecutor and justice system.",
    "url": "https://www.nytimes.com/2024/06/21/nyregion/trump-gag-order-bragg.html"
  },
  {
    "text": "NY prosecutors urge judge to keep gag order blocking Trump from criticizing jurors who convicted him  —  Prosecutors on Friday urged the judge overseeing Donald Trump's criminal hush money case to uphold provisions of a gag order that bar him from criticizing jurors and court staff … ",
    "url": "https://apnews.com/article/trump-hush-money-new-york-gag-order-017ee70af7749c225975bb428113dfd1"
  },
  {
    "text": "Trump ally Bannon asks the Supreme Court to delay his 4-month prison sentence on contempt charges  —  Steve Bannon, a longtime ally of former President Donald Trump, asked the Supreme Court on Friday to delay his prison sentence while he fights his convictions for defying a subpoena … ",
    "url": "https://apnews.com/article/steven-bannon-supreme-court-contempt-donald-trump-f5c90cf82a1588e737e30903f69def1b"
  },
  {
    "text": "Appeals court denies Bannon bid to stave off July 1 jail sentence  —  A divided three-judge panel ruled Bannon's argument was unlikely to gain traction at the Supreme Court.  —  A federal appeals court has denied a last-minute bid by Steve Bannon, a longtime Donald Trump adviser … ",
    "url": "https://www.politico.com/news/2024/06/20/appeals-court-steve-bannon-jail-sentence-00164377"
  },
  {
    "text": "How Marco Rubio Could Cost Biden the Election  —  Pennsylvania has been political ground zero in presidential elections for nearly a quarter-century, and 2024 will be no different.  Joe Biden carried his birth state by almost 82,000 votes in 2020, and will need to win it again this year.",
    "url": "https://www.nytimes.com/2024/06/21/opinion/trump-vp-pick-marco-rubio.html"
  },
  {
    "text": "Is Jack Smith's appointment constitutional?  Trump's Florida judge is set to decide.  —  A hearing starting Friday will delve into Trump's claim that the special counsel lacks authority.  —  Special counsel Jack Smith's case against Donald Trump for allegedly stealing national security secrets … ",
    "url": "https://www.politico.com/news/2024/06/21/trump-classified-documents-jack-smith-constitutional-00164368"
  },
  {
    "text": "Club urges members to donate for Aubuchon winner's hospice care  —  The National Press Club is grieved to learn that freelance photojournalist Linda Tirado, the recipient of the Club's 2020 domestic John Aubuchon Press Freedom Award, is dying and has entered hospice care as a result … ",
    "url": "https://www.press.org/newsroom/club-urges-members-donate-aubuchon-winners-hospice-care"
  },
  {
    "text": "Don't be gaslit: Trump's corruption is unparalleled  —  PN is a reader-supported publication made possible by paid subscribers.  Appreciate our independent journalism?  Then please sign up to support us.  —  📈 Subscribe to Public Notice 📈",
    "url": "https://www.publicnotice.co/p/trump-corruption-explained-emoluments-hotel"
  },
  {
    "text": "GOP Michigan rep and gun-rights supporter Neil Friske accused of chasing a stripper while firing a gun  —  LANSING, Mich. — Neil Friske apparently lives up to his name: The Michigan state representative was arrested early Thursday after Lansing police responded to a report of gunshots … ",
    "url": "https://nypost.com/2024/06/20/us-news/gop-michigan-rep-and-gun-rights-supporter-neil-friske-accused-of-chasing-a-stripper-while-firing-a-gun/"
  },
  {
    "text": "Trump Media free fall continues as DJT stock slides 6% … Trump Media stock fell more than 6% on Friday, compounding a weekslong slide for former President Donald Trump's tech and media company that has only grown steeper since a federal regulator approved the registration of new tradable shares.",
    "url": "https://www.cnbc.com/2024/06/21/trump-media-freefall-continues-djt-stock-down-6percent.html"
  },
  {
    "text": "Change Healthcare confirms ransomware hackers stole medical records on a ‘substantial proportion’ of Americans  —  Change Healthcare has confirmed a February ransomware attack on its systems, which brought widespread disruption to the U.S. healthcare system for weeks, resulted in the theft … ",
    "url": "https://techcrunch.com/2024/06/21/change-healthcare-confirms-ransomware-hackers-stole-medical-records-on-a-substantial-proportion-of-americans/"
  },
  {
    "text": "Roger Stone Seems to Imply Trump Totally Controls Judge Cannon … A secretly recorded conversation with Roger Stone suggests that the Donald Trump adviser and confidant is implying that the judge in Trump's classified documents case, Aileen Cannon, could be in the convicted felon and former president's pocket.",
    "url": "https://newrepublic.com/post/182935/roger-stone-trump-judge-cannon-classified-documents"
  }
]