[
  {
    "text": "Woman testified to House Ethics Committee that Gaetz had sex with her when she was 17: Sources  —  Trump tapped Florida Rep. Matt Gaetz to be the new attorney general.  —  Rep. Matt Gaetz speaks during the Conservative Political Action Conference in Oxon Hill, Md., Feb. 23, 2024.",
    "url": "https://abcnews.go.com/US/woman-testified-house-ethics-committee-gaetz-sex-17/story?id=115867555"
  },
  {
    "text": "Republican Leaders Are More Afraid of Trump Than Ever  —  If you had predicted before the election that Donald Trump's second administration would seek to hand some of the most sensitive and powerful roles in government to a Fox News personality (Pete Hegseth, nominated for defense secretary) … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/trump-cabinet-appointments/680652/"
  },
  {
    "text": "Steve Bannon Threatens Ari Melber, Says Matt Gaetz's DOJ Is Coming For Him And ‘All The Producers of MSNBC’  —  Former Trump White House advisor Steve Bannon told MSNBC's Ari Melber and “all you hosts” and producers at the network that they had better “lawyer up” because Matt Gaetz's Justice Department would soon be coming for them.",
    "url": "https://www.mediaite.com/news/steve-bannon-threatens-ari-melber-says-matt-gaetzs-doj-is-coming-for-him-and-all-the-producers-of-msnbc/"
  },
  {
    "text": "Durbin demands House ethics panel share Gaetz report with Senate panel  —  Illinois Sen. Dick Durbin (D) urged the House Ethics Committee to “preserve and share” its report on former Rep. Matt Gaetz (R-Fla.) after President-elect Trump tapped the Florida congressman to serve as attorney general.",
    "url": "https://thehill.com/homenews/senate/4990433-durbin-gaetz-house-ethics-report/"
  },
  {
    "text": "Matt Gaetz is a Vile Sex Pest and Any Senator Who Votes For Him Owns That  —  Crush Some Viagra And Pour The Red Bull In Your Veins  —  I realize that we are occasionally given to hyperbole about the untoward nature of politicians, but let me be clear: Matt Gaetz is a sex trafficking drug addicted piece of shit.",
    "url": "https://thetransom.com/p/matt-gaetz-is-a-vile-sex-pest-and"
  },
  {
    "text": "How Trump Picked Gaetz  —  President-elect Donald J. Trump appeared to have gained some clarity on what he wanted in an attorney general while he was in Washington, the city he left in 2020 after weeks of his election lies.  —  President-elect Donald J. Trump still hadn't settled on his pick … ",
    "url": "https://www.nytimes.com/2024/11/14/us/politics/trump-gaetz-decision-plane.html"
  },
  {
    "text": "Trump to select Robert F. Kennedy Jr. to lead HHS  —  The choice will roil many public health experts after his years of touting debunked claims that vaccines cause autism.  —  President-elect Donald Trump will nominate former presidential candidate and anti-vaccine activist Robert F. Kennedy Jr … ",
    "url": "https://www.politico.com/news/2024/11/14/robert-f-kennedy-jr-trump-hhs-secretary-pick-00188617"
  },
  {
    "text": "Gov. Jared Polis cheers RFK Jr.'s nomination for health post despite anti-vaccine statements  —  Colorado Gov. Jared Polis on Thursday cheered anti-vaccine advocate Robert F. Kennedy Jr.'s nomination to lead the nation's top public health agency, highlighting the controversial nominee's stances on “big pharma” and “corporate ag.”",
    "url": "https://www.denverpost.com/2024/11/14/jared-polis-rfk-jr-trump-hhs-endorsement-tweet/"
  },
  {
    "text": "The Onion wins Alex Jones' Infowars in bankruptcy auction  —  The satirical news company plans to shutter Jones' InfoWars and rebuild the website featuring well-known internet humor writers and content creators, according to a person with knowledge of the sale.",
    "url": "https://www.nbcnews.com/news/us-news/onion-wins-alex-jones-infowars-bankruptcy-auction-rcna179936"
  },
  {
    "text": "The Onion Just Bought Infowars — and Alex Jones Is Pissed  —  The satirical newspaper acquired the conspiracy theorist's company after a judge ordered his assets be auctions off  —  The satirical newspaper The Onion has successfully acquired Infowars and its associated intellectual property … ",
    "url": "https://www.rollingstone.com/politics/politics-news/alex-jones-infowars-the-onion-1235165651/"
  },
  {
    "text": "Trump's intelligence chief pick Tulsi Gabbard is 'Russia's girlfriend'  —  Ukraine accused the president-elect's choice for cabinet of being on the Kremlin's payroll  —  Donald Trump's pick for US national intelligence chief was accused by Ukraine of being on the Kremlin's payroll after the start of Russia's invasion.",
    "url": "https://www.thetimes.com/world/russia-ukraine-war/article/tulsi-gabbard-trump-russia-connection-cabinet-national-intelligence-d3ttgsjfq"
  },
  {
    "text": "Elon Musk Met With Iran's U.N. Ambassador, Iranian Officials Say  —  The tech billionaire, a top adviser to President-elect Donald J. Trump, was reported to have discussed ways to defuse tensions between Iran and the United States.  —  Elon Musk, a close adviser to President-elect Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/11/14/world/middleeast/elon-musk-iran-trump.html?unlocked_article_code=1.Z04.HPHF.ruu6mJ2mPOQz&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Scoop: Manchin signals willingness to back Biden's final push on judges … - Manchin told Axios that “we're in different times right now” when asked about his previous pledge, adding that “my Republican friends are under the microscope.” … - Manchin's vote is critical … ",
    "url": "https://www.axios.com/2024/11/14/manchin-judges-biden-senate"
  },
  {
    "text": "Exclusive: Trump's transition team aims to kill Biden EV tax credit  —  President-elect Donald Trump's transition team is planning to kill the $7,500 consumer tax credit for electric-vehicle purchases as part of broader tax-reform legislation, two sources with direct knowledge of the matter told Reuters.",
    "url": "https://www.reuters.com/business/autos-transportation/trumps-transition-team-aims-kill-biden-ev-tax-credit-2024-11-14/"
  },
  {
    "text": "Go bags, passports, foreign assets: Preparing to be a target of Trump's revenge  —  Some prominent critics of Donald Trump, and those he has vilified as “deep state” saboteurs, are taking seriously his vow of retribution.  —  A retired U.S. Army officer who clashed with senior officials … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/14/trump-critics-enemies-presidency-preparations/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMxNTYwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMyOTQyNzk5LCJpYXQiOjE3MzE1NjA0MDAsImp0aSI6IjgzM2QwN2M2LThjMTUtNDQyYy1iMjA0LTlhYWUwY2QyODE1ZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzE0L3RydW1wLWNyaXRpY3MtZW5lbWllcy1wcmVzaWRlbmN5LXByZXBhcmF0aW9ucy8ifQ.0jWIHqXUIyjYo1-tjnFuyKzoYIs8SRps5G04jpX1-0Q&itid=gfta"
  },
  {
    "text": "The Curious Case of Tulsi Gabbard: Is She a Russian Asset or a Dupe?  —  On assets, espionage coups, and the future director of national intelligence.  —  ∙ Paid  —  1. Aloha, Comrade!  —  When you woke up yesterday the idea that Pete Hegseth—a philandering morning TV host … ",
    "url": "https://www.thebulwark.com/p/tulsi-gabbard-russian-asset-or-dupe"
  },
  {
    "text": "Should the Democratic Party be listening to John Fetterman?  —  The Pennsylvania senator on the ‘bros’ vote, where he thinks he can work with Trump and the problem with Democrats calling Trump a fascist.  —  John Fetterman often has an uncanny sense of which presidential candidate is going to win Pennsylvania.",
    "url": "https://www.politico.com/news/2024/11/14/john-fetterman-democratic-party-trump-00189595"
  },
  {
    "text": "Trump picks ex-congressman Doug Collins for veterans affairs secretary  —  U.S. President-elect Donald Trump said on Thursday he intends to nominate former Representative Doug Collins for secretary of veterans affairs.  —  “We must take care of our brave men and women in uniform … ",
    "url": "https://www.reuters.com/world/us/trump-picks-ex-congressman-doug-collins-veterans-affairs-secretary-2024-11-14/"
  },
  {
    "text": "Attorney General Moody Takes Swift Action Against FEMA Officials to Make Sure ALL Americans are Served as Tropical System Looms  —  Phone  —  (850) 245-0150  —  TALLAHASSEE, Fla.—Attorney General Ashley Moody is taking legal action against current and former Federal Emergency Management Agency officials … ",
    "url": "https://www.myfloridalegal.com/newsrelease/attorney-general-moody-takes-swift-action-against-fema-officials-make-sure-all"
  },
  {
    "text": "Senate confirms Director of Office of Government Ethics just in time to be a bulwark against corruption  —  Good afternoon from Washington, where I've been spending much of the past week reflecting on what has happened and what's yet to come.  Thanks to everyone who has subscribed and become a member.",
    "url": "https://civic-texts.ghost.io/senate-confirms-director-of-office-of-government-ethics-just-in-time-to-be-a-bulwark-against-corruption/"
  }
]