[
  {
    "text": "Democrats Plan to Protest Trump's Speech by Wearing Pink  —  Pink for the rights of women and families, black to meet the somberness of the political moment, yellow and blue in support of Ukraine: Democratic lawmakers are expected to communicate their opposition to Donald Trump during … ",
    "url": "https://www.thecut.com/article/democrats-wearing-pink-to-protest-trumps-speech-to-congress.html"
  },
  {
    "text": "No more town halls, NRCC chief tells House Republicans  —  The chair of the House GOP's campaign arm told Republican lawmakers Tuesday to stop holding in-person town halls amid a wave of angry backlash over the cuts undertaken by President Donald Trump's administration.",
    "url": "https://www.politico.com/live-updates/2025/03/04/congress/gop-town-halls-richard-hudson-00210024"
  },
  {
    "text": "D.C. Braces for Trump's Address to Congress: Live Updates  —  It's time for Donald Trump's (second) first address to Congress (which will be just like a State of the Union address, only not called the State of the Union).  Tonight in Washington, D.C., the trade-warring … ",
    "url": "https://nymag.com/intelligencer/article/trump-presidential-address-to-congress-2025-analysis-live-updates.html"
  },
  {
    "text": "Two hugely important questions about Trump's trade war  —  Donald Trump's long-threatened trade war has finally begun.  —  The Trump administration slapped big new tariffs on Canada, Mexico, and China on Tuesday, spurring retaliation from other countries, a market sell-off, and new fears about the future of the US economy.",
    "url": "https://www.vox.com/politics/402465/trump-tariffs-trade-war-retaliation-canada-mexico-china"
  },
  {
    "text": "Tariff War Risks Sinking World Into New Great Depression, International Chamber of Commerce Warns  —  The world economy could face a crash similar to the Great Depression of the 1930s  —  The world economy could face a crash similar to the Great Depression of the 1930s unless the U.S. rows … ",
    "url": "https://www.wsj.com/economy/trade/tariff-war-risks-sinking-world-into-new-great-depression-235fffeb"
  },
  {
    "text": "Trump doesn't seem to know why he launched a giant trade war  —  Donald Trump just imposed a 25 percent tariff on virtually all goods produced by America's two largest trading partners — Canada and Mexico.  He simultaneously established a 20 percent across-the-board tariff on Chinese goods.",
    "url": "https://www.vox.com/politics/402530/trump-tariffs-canada-mexico-explanation"
  },
  {
    "text": "Non-core property list  —  We are identifying buildings and facilities that are not core to government operations, or non-core properties for disposal.  Selling ensures that taxpayer dollars are no longer spent on vacant or underutilized federal spaces.  Disposing of these assets helps … ",
    "url": "https://www.gsa.gov/real-estate/real-estate-services/real-property-disposition/noncore-property-list"
  },
  {
    "text": "The IRS is drafting plans to cut as much as half of its 90,000-person workforce, AP sources say  —  The IRS is drafting plans to cut its workforce by as much as half through a mix of layoffs, attrition and incentivized buyouts, according to two people familiar with the situation.",
    "url": "https://apnews.com/article/irs-doge-layoffs-tax-season-0659e4b439400bf66023273f6a532fa0"
  },
  {
    "text": "People Are Paying Millions to Dine With Donald Trump at Mar-a-Lago  —  Business leaders are paying as much as $5,000,000 to meet one-on-one with the president at his Florida compound, sources tell WIRED, while others are paying $1,000,000 apiece to dine with him in a group setting.",
    "url": "https://www.wired.com/story/people-paying-millions-donald-trump-mar-a-lago/"
  },
  {
    "text": "MAGA Newspaper Owner's AI Bot Defends KKK  —  An AI-generated summary tried to offer “different views” on the hate group.",
    "url": "https://www.thedailybeast.com/maga-newspaper-owners-ai-bot-defends-kkk/"
  },
  {
    "text": "Some DOGE Staffers Are Drawing Six-Figure Government Salaries  —  Engineers and executives at the so-called Department of Government Efficiency are drawing healthy taxpayer-funded salaries—sometimes from the very agencies they are cutting.  —  Some staffers at Elon Musk's so-called Department … ",
    "url": "https://www.wired.com/story/doge-government-salaries-elon-musk/"
  },
  {
    "text": "Trump, Ukraine, and the Meme-ing of Marco Rubio  —  Why the Secretary of State's stone-like posture during the Zelenskyy meltdown might have been exactly as telling as observed.  —  Even as it was happening on Friday, the Oval Office blowup between President Donald Trump, Vice President JD Vance … ",
    "url": "https://www.vanityfair.com/news/story/trump-ukraine-and-the-meme-ing-of-marco-rubio"
  },
  {
    "text": "Trump admin moves to drop fight over emergency abortions, reversing Biden admin stance  —  An Idaho hospital is stepping in to argue that the state's near-total abortion ban violates patients' rights.  —  The Trump administration is dropping a yearslong legal battle with Idaho over the right … ",
    "url": "https://www.politico.com/news/2025/03/04/trump-emergency-abortions-00211399"
  },
  {
    "text": "As Measles Spreads, Kennedy Embraces Remedies Like Cod Liver Oil  —  In an interview, the H.H.S. secretary claimed that unconventional treatments were helping patients but did not mention vaccination.  —  As a measles outbreak expands in West Texas, Robert F. Kennedy Jr. … ",
    "url": "https://www.nytimes.com/2025/03/04/health/texas-measles-outbreak-kennedy.html"
  },
  {
    "text": "U.S. Embassies Halt Air Quality Monitoring Abroad  —  Since 2008, embassies and other diplomatic posts had been publishing data about local air quality.  In many countries, it was the only reliable source of such information.  —  What's the air quality in New Delhi, Jakarta or Buenos Aires?",
    "url": "https://www.nytimes.com/2025/03/04/climate/state-department-air-monitoring-embassies.html?unlocked_article_code=1.1k4.3CbU.jk4YyHJhgJq-&smid=url-share"
  },
  {
    "text": "Trump administration disbands two expert panels on economic data  —  U.S. President Donald Trump's administration has disbanded two expert committees that worked with the government to produce economic statistics, potentially affecting the quality of data.  —  The terminations … ",
    "url": "https://www.reuters.com/world/us/trump-administration-disbands-two-expert-panels-economic-data-2025-03-05/"
  },
  {
    "text": "Trump Abruptly Walks Back His Directive To Fire Thousands Of Federal Employees  —  His administration is suddenly reversing course after a federal judge ruled that the mass firings of probationary workers were probably illegal.  —  WASHINGTON — President Donald Trump on Tuesday abruptly walked … ",
    "url": "https://www.huffpost.com/entry/trump-reverses-directive-fire-federal-employees_n_67c65042e4b044c440ed75bd"
  },
  {
    "text": "The Post's Beacon of Inspiration  —  As Jeff Bezos pushes The Washington Post to the right, publisher Will Lewis quietly met with a conservative editor last month, Status has learned.  —  Last month, Will Lewis, the embattled publisher and chief executive of The Washington Post, sat down for a curious off-the-record meeting.",
    "url": "https://www.status.news/p/washington-post-will-lewis-free-beacon"
  },
  {
    "text": "If the unthinkable happens tonight, Doug Collins is the designated survivor  —  Secretary of Veterans Affairs Doug Collins will be the designated survivor during President Donald Trump's joint address to Congress, according to two White House officials, taking on a decades-old role as the official … ",
    "url": "https://www.politico.com/live-updates/2025/03/04/trump-joint-address-to-congress/collins-is-designated-survivor-00212699"
  },
  {
    "text": "Why Techdirt Is Now A Democracy Blog (Whether We Like It Or Not)  —  While political reporters are still doing their view-from-nowhere “Democrats say this, Republicans say that” dance, tech and legal journalists have been watching an unfortunately recognizable plan unfold — a playbook we're all too familiar with.",
    "url": "https://www.techdirt.com/2025/03/04/why-techdirt-is-now-a-democracy-blog-whether-we-like-it-or-not/"
  },
  {
    "text": "AG Bondi faces heat from White House, Trump allies over Epstein files release  —  The release, which was trumpeted by the AG, revealed almost no new information.  —  Attorney General Pam Bondi speaks at the Conservative Political Action Conference 2025 at National Harbor, Maryland, Feb. 20, 2025.",
    "url": "https://abcnews.go.com/US/ag-bondi-faces-heat-white-house-trump-allies/story?id=119435303"
  },
  {
    "text": "The L.A. Times adds AI-generated counterpoints to its opinion pieces and guess what, there are problems  —  The hope: The L.A. Times will appear more “objective” if it presents both sides of an issue, even if one side's written by a human and the other side is generated by AI.  The reality: Kind of a mess.",
    "url": "https://www.niemanlab.org/2025/03/the-l-a-times-adds-ai-generated-counterpoints-to-its-opinion-pieces-and-guess-what-there-are-problems/"
  },
  {
    "text": "Bowser signals D.C. will paint over BLM Plaza after GOP threatens funding  —  The mayor's announcement represents a remarkable retreat from her defiant posture toward President Donald Trump during his first term.  —  D.C. Mayor Muriel E. Bowser (D) signaled Tuesday that the city would paint … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/03/04/dc-black-lives-matter-plaza-repainted-bowser/"
  },
  {
    "text": "EXCLUSIVE: A Hitler-quoting ‘Aryan’ has the attention of JD Vance and Elon Musk—who is @captivedreamer7?  —  The account, followed by JD Vance, previously boasted of being a white supremacist.  —  Days after the 2024 election, Vice President JD Vance followed @capitivedreamer7 … ",
    "url": "https://www.dailydot.com/debug/captive-dreamer-elon-musk-jd-vance/"
  },
  {
    "text": "Watchdog seeks to halt more than 5,000 Trump administration firings at USDA  —  The watchdog — who is himself fighting to save his own job — says the mass terminations at the Department of Agriculture violated civil service protections.  —  A federal watchdog for government workers is trying … ",
    "url": "https://www.politico.com/news/2025/03/04/usda-firings-trump-watchdog-00211733"
  }
]