[
  {
    "text": "Trump Allies Pledge ‘Holy War’ Against Taylor Swift  —  Taylor Swift hasn't even endorsed Joe Biden's 2024 campaign, but Trump is already privately grousing he's “more popular” than her  —  Singer-songwriter Taylor Swift hasn't even endorsed President Joe Biden for reelection yet.",
    "url": "https://www.rollingstone.com/politics/politics-features/donald-trump-more-popular-taylor-swift-maga-biden-1234956829/"
  },
  {
    "text": "Trump Has Devoured the Republican Establishment  —  It was almost 15 months ago that The New York Post published a full-page cover photo of Ron DeSantis with the headline “DeFUTURE.”  His 19-point victory in the Florida governor's race was one of the few bright spots of the 2022 elections … ",
    "url": "https://www.nytimes.com/2024/01/30/opinion/trump-republican-establishment.html"
  },
  {
    "text": "Trump's PACs Spent Roughly $50 Million on Legal Expenses in 2023  —  The former president is facing four criminal indictments and potential trials that could drive his legal bills even higher as he seeks to lock up the Republican presidential nomination.  —  Donald J. Trump piled up legal expenses … ",
    "url": "https://www.nytimes.com/2024/01/30/us/politics/trump-legal-fees.html"
  },
  {
    "text": "Trump can stay on Illinois 2024 ballot after 14th Amendment challenge, officials say  —  A bipartisan state board voted 8-0 to affirm Trump's eligibility.  —  Former U.S. President Donald Trump waves as he departs for his second civil trial after E. Jean Carroll accused Trump of raping her decades ago … ",
    "url": "https://abcnews.go.com/Politics/trump-remain-illinois-2024-ballot-after-14th-amendment/story?id=106765313"
  },
  {
    "text": "E. Jean Carroll Lawyer Threatens to Seek Sanctions Against Trump Attorney for ‘Utterly Baseless’ Claims Judge Was Her ‘Mentor’  —  Trump's lawyer Alina Habba claimed the judge had a conflict of interest based on a tabloid rumor of an alleged 30-year-old professional tie",
    "url": "https://themessenger.com/politics/e-jean-carroll-roberta-kaplan-trump-alina-habba-judge-mentor"
  },
  {
    "text": "E. Jean Carroll Delivered the Sound Bite That Could Win Trump the Election  —  There's the liberal media's crusade against the former president, but then there's E. Jean Carroll's war against Trump, which is something otherworldly.  She's filed multiple lawsuits against Donald Trump.",
    "url": "https://townhall.com/tipsheet/mattvespa/2024/01/29/e-jean-carroll-delivered-a-huge-in-kind-contribution-to-trump-during-her-msnbc-interview-n2634353"
  },
  {
    "text": "First look: John Bolton's predictions for a second Trump term  —  John Bolton — Donald Trump's former national security adviser — is laying out his nightmare scenarios for a second Trump term in a foreword to the paperback edition of his memoir “The Room Where It Happened,” out Tuesday.",
    "url": "https://www.axios.com/2024/01/30/trump-john-bolton-second-term-2024-election"
  },
  {
    "text": "The ‘Take Our Border Back’ Convoy Is Already a Complete Mess  —  Instead of immigrants, the group of extremists mostly battled each other, paranoia, and their GPS systems.  —  On Monday morning, the organizers of the Take Our Border Back convoy kicked off their road trip to the Texas-Mexico border in Virginia Beach.",
    "url": "https://www.wired.com/story/day-one-take-our-border-back-convoy-texas/"
  },
  {
    "text": "House Republicans poised to torpedo GOP's best chance in years to pass border bill  —  House Republicans appear to be on the precipice of torpedoing their best opportunity in years of passing border legislation.  —  Republicans had long insisted on changes to border and migration policy … ",
    "url": "https://thehill.com/homenews/house/4436245-house-republicans-border-deal/"
  },
  {
    "text": "Disturbing Bill Would Let Arizona Legislators Ignore Election Results  —  The proposed bill would give the legislature absolute power to control the state's electoral college votes, disenfranchising millions of citizens.  —  An Arizona lawmaker who signed on to be a “fake elector” … ",
    "url": "https://www.thedailybeast.com/disturbing-bill-would-let-arizona-legislators-ignore-election-results"
  },
  {
    "text": "GOP moderates send warning shot to Johnson over tax deal  —  Moderate House Republicans sent a warning shot to Speaker Mike Johnson (R-La.) on Tuesday, coming close to blocking legislative action on the House floor in protest of the bipartisan, bicameral tax deal not including an increase in the state and local tax deduction (SALT).",
    "url": "https://thehill.com/homenews/house/4437928-gop-moderates-house-tax-deal-warning-shot/"
  },
  {
    "text": "Montana's Governor Defends Stealing a Teenager From Parents Over Not Conforming to Transgender Agenda  —  As RedState previously reported, Montana's state child protective services came and took away the 14-year-old girl of a family in Glasgow.  The parents, Krista and Todd Kolstad … ",
    "url": "https://redstate.com/brandon_morse/2024/01/30/montanas-governor-defends-stealing-a-teenager-from-parents-over-not-conforming-to-transgender-agenda-n2169425"
  },
  {
    "text": "Pluralistic: My McLuhan lecture on enshittification (30 Jan 2024)  — My McLuhan lecture on enshittification: Live from Berlin.  — Hey look at this: Delights to delectate.  — This day in history: 2014, 2019, 2023  — Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading",
    "url": "https://pluralistic.net/2024/01/30/go-nuts-meine-kerle/"
  },
  {
    "text": "IDF says it killed 3 terrorists planning Oct. 7-like attack hiding in Jenin hospital  —  CCTV footage shows undercover forces in fake beards or dressed as Muslim women before they killed 3 armed Hamas members in West Bank medical center, in dramatic 10-minute raid",
    "url": "https://www.timesofisrael.com/idf-says-it-killed-3-terrorists-planning-oct-7-like-attack-hiding-in-jenin-hospital/"
  },
  {
    "text": "Ron DeSantis Calls For Ilhan Omar To Be Expelled From Congress, Denaturalized And Deported  —  Florida Republican Gov. Ron DeSantis called Tuesday for Minnesota Democratic Rep. Ilhan Omar to be expelled from Congress, denaturalized as a U.S. citizen and deported back to Somalia in response … ",
    "url": "https://dailycaller.com/2024/01/30/ron-desantis-call-ilhan-omar-expel-congress-denaturalize-deport/"
  },
  {
    "text": "House Democrats close ranks against “bulls**t” Mayorkas impeachment  —  House Democrats are expecting their caucus to stay unified against a Republican vote to impeach Secretary of Homeland Security Alejandro Mayorkas that could come as soon as next week.",
    "url": "https://www.axios.com/2024/01/30/house-democrats-mayorkas-impeachment-vote"
  },
  {
    "text": "Iraq's Kataib Hezbollah suspends attacks on US forces  —  Iran-aligned Iraqi armed group Kataib Hezbollah announced on Tuesday the suspension of all its military operations against U.S. troops in the region, in a decision aimed at preventing “embarrassment” of the Iraqi government, the group said.",
    "url": "https://www.reuters.com/world/middle-east/iraqs-kataib-hezbollah-suspends-military-operations-us-forces-statement-2024-01-30/"
  },
  {
    "text": "Prosecutor in Trump Georgia case settles divorce ahead of testimony  —  The lead prosecutor in the Georgia election interference case against former president Donald Trump and his allies settled a contentious divorce dispute on Tuesday, canceling a hearing scheduled for Wednesday morning … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/30/nathan-wade-divorce-case-settled/"
  },
  {
    "text": "New US-made longer-range bomb expected to arrive as soon as Wednesday in Ukraine  —  The Ground-Launched Small Diameter Bomb doesn't even exist in the U.S. inventory.  —  The Pentagon has successfully tested a new long-range precision bomb for Ukraine that is expected to arrive on the battlefield … ",
    "url": "https://www.politico.com/news/2024/01/30/new-us-made-longer-range-bomb-expected-to-arrive-as-soon-wednesday-in-ukraine-00138566"
  },
  {
    "text": "We Found That Landlords Could Be Using Algorithms to Fix Rent Prices.  Now Lawmakers Want to Make the Practice Illegal.  —  After a ProPublica investigation, U.S. senators introduced a bill to curb “price fixing” linked to rent-setting software.  “Setting prices with an algorithm is no different … ",
    "url": "https://www.propublica.org/article/senators-introduce-legislation-stop-landlords-algorithm-price-fixing"
  },
  {
    "text": "Scoop: Democratic governors rake in record cash ahead of 2024  —  The Democratic Governors Association raised $71.5 million last year — a record for an off year that helped Democrats hold a seat in Kentucky and build momentum into 2024, Axios has learned.  —  Why it matters … ",
    "url": "https://www.axios.com/2024/01/30/democratic-governors-record-fundraising-2024-election"
  },
  {
    "text": "Jeffries raised more than $113M for House Democrats in 2023  —  Minority Leader Hakeem Jeffries (D-N.Y.) raised $113 million for Democratic candidates and Democrats' primary congressional campaign fund in 2023, he announced Tuesday.  —  Jeffries also raised $4.8 million for his own reelection … ",
    "url": "https://thehill.com/homenews/house/4437980-jeffries-fundraising-house-democrats-2023/"
  },
  {
    "text": "Is American Journalism Headed Toward an ‘Extinction-Level Event’?  —  The news industry has been in decline for decades, but the latest round of layoffs is especially ominous.  —  for a few hours last Tuesday, the entire news business seemed to be collapsing all at once.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/01/media-layoffs-la-times/677285/"
  },
  {
    "text": "Not Just Claudine Gay.  Harvard's Chief Diversity Officer Plagiarized and Claimed Credit for Husband's Work, Complaint Alleges  —  It's not just Claudine Gay.  Harvard University's chief diversity and inclusion officer, Sherri Ann Charleston, appears to have plagiarized extensively in her academic work … ",
    "url": "https://freebeacon.com/campus/not-just-claudine-gay-harvards-chief-diversity-officer-plagiarized-and-claimed-credit-for-husbands-work-complaint-alleges/"
  }
]