[
  {
    "text": "Alabama infertility clinic stops offering IVF, fearing prosecution  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  The fertility clinic at the University of Alabama at Birmingham announced Wednesday it has stopped offering in vitro fertilization (IVF) procedures.",
    "url": "https://popular.info/p/alabama-infertility-clinic-stops"
  },
  {
    "text": "Nikki Haley sides with Alabama Supreme Court on IVF ruling: ‘Embryos, to me, are babies’  —  The Alabama court's recent ruling raised concerns among doctors and patients worried that classifying embryos as children could restrict in-vitro fertilization.  —  NORTH AUGUSTA, S.C. … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-sides-alabama-supreme-court-ivf-ruling-embryos-are-babies-rcna139819"
  },
  {
    "text": "Playbook: What the GOP would prefer not to discuss  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WITH ENDORSERS LIKE THESE — Florida Gov. RON DeSANTIS privately criticized DONALD TRUMP and said he wouldn't be Trump's running mate on a call first obtained by the N.Y. Post's Diana Glebova.",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/22/what-the-gop-would-prefer-not-to-discuss-00142605"
  },
  {
    "text": "It's Even Worse Than We Imagined  —  Just when you thought it couldn't be worse, here we are.  —  As I reported last week, a star witness for the GOP-led impeachment inquiry, someone Rep. Jim Jordan (R-OH) had called a “highly credible human source,” was indicted for making false statements and reports.",
    "url": "https://statuskuo.substack.com/p/its-even-worse-than-we-imagined"
  },
  {
    "text": "Federal judge affirms MyPillow's Mike Lindell must pay $5M in election data dispute  —  A federal judge on Wednesday affirmed a $5 million arbitration award against MyPillow chief executive Mike Lindell in favor of a software engineer who challenged data that Lindell said proves China interfered … ",
    "url": "https://apnews.com/article/mike-lindell-election-denial-arbitration-award-a9b27dd8d37eab1d0f22111566feba93"
  },
  {
    "text": "Mike Lindell must pay man $5M in ‘Prove Mike Wrong’ challenge, judge says  —  In 2021, MyPillow founder Mike Lindell offered $5 million to anyone who could disprove his claim that he had data showing voter fraud in the 2020 presidential election.  —  Now, he must pay a 64-year-old from Nevada that award … ",
    "url": "https://www.washingtonpost.com/nation/2024/02/22/mike-lindell-election-dispute-decision/"
  },
  {
    "text": "Commander, Biden's banished German shepherd, had at least 25 biting incidents in a year  —  President Biden's now-banished German shepherd Commander inflicted more damage with bite incidents than previously known.  —  Newly released records from the United States Secret Service to USA TODAY reveal … ",
    "url": "https://www.usatoday.com/story/news/investigations/2024/02/21/commander-bidens-german-shepherd-involved-in-at-least-25-bites/72690614007/"
  },
  {
    "text": "Nikki Haley says Biden is ‘more dangerous’ than Trump but neither is fit for the job  —  Republican presidential candidate Nikki Haley told NPR that President Biden presents a bigger threat to the country if reelected than his predecessor, former President Donald Trump.",
    "url": "https://npr.org/2024/02/22/1232961899/nikki-haley-south-carolina-primary-super-tuesday-biden-trump"
  },
  {
    "text": "Republicans Furious as Speaker Johnson Turns GOP Leadership Meeting Into Religious Revival  —  They just wanted to hear plans for keeping their extremely slim House majority  —  Members of House Republican leadership expressed frustration at Speaker Mike Johnson after a GOP leadership retreat … ",
    "url": "https://www.meidastouch.com/news/republicans-furious-as-speaker-johnson-turns-gop-leadership-meeting-into-religious-revival"
  },
  {
    "text": "Arizona prosecutor refuses to extradite murder suspect to New York  —  An Arizona prosecutor said she will not extradite a New York murder suspect to the state on Wednesday, claiming Manhattan District Attorney Alvin Bragg could not be trusted to keep the man behind bars.",
    "url": "https://thehill.com/regulation/court-battles/4481318-arizona-prosecutor-refuses-extradite-murder-suspect-new-york/"
  },
  {
    "text": "Ron DeSantis shares his concerns about Trump in a private call with supporters  —  The Florida governor, who endorsed Trump after ending his own White House bid last month, said the former president should not use “identity politics” to pick a running mate.  —  Florida Gov. Ron DeSantis told backers … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-concerns-trump-private-call-supporters-rcna139859"
  },
  {
    "text": "From anti-anti-Putin to openly pro-Putin  —  Tucker Carlson finally takes the mask off. … Tucker Carlson's recent grand tour of Russia was easy to mock.  —  A far less pleasant version of Rick Steves, Carlson wandered around Moscow, gushing over the clean, efficient subways … ",
    "url": "https://www.publicnotice.co/p/tucker-carlson-moscow-trip-russia-putin"
  },
  {
    "text": "Elon Musk quietly visited the Biden White House in September  —  Musk and President Joe Biden, who didn't meet during the visit, have had a frosty relationship driven by differing views on labor unions and more.  —  Tech billionaire Elon Musk quietly visited the White House in September … ",
    "url": "https://www.nbcnews.com/tech/tech-news/elon-musk-quietly-visited-biden-white-house-september-rcna139836"
  },
  {
    "text": "'Who's going to do that?':  Trump faces hurdles in securing appeal bond for fraud case  —  Former President Donald Trump will need to secure a massive bond as he appeals the ruling ordering him to pay more than $450 million in penalties and interest.  —  Former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/s-going-trump-faces-hurdles-securing-appeal-bond-fraud-case-rcna139861"
  },
  {
    "text": "Teamsters give GOP first major donation in years with $45,000 to RNC  —  The Teamsters' political committee has given $45,000 to the Republican National Committee, according to federal records, a significant departure for a powerful organized labor group that has more recently supported Democrats … ",
    "url": "https://www.washingtonpost.com/business/2024/02/21/teamsters-trump-biden-union/"
  },
  {
    "text": "Exclusive: N.Y. Times reporters plan fall exposé on Trump's taxes … - “I remember watching Joe Biden's inauguration and seeing Donald Trump and his family leave Washington for Mar-a-Lago,” Craig says. … - “We have spent the last three years building upon our prior reporting.",
    "url": "https://www.axios.com/2024/02/22/ny-times-reporters-fall-expose-trump-taxes"
  },
  {
    "text": "Federal prosecutors charge Japanese Yakuza leader in nuclear material trafficking conspiracy  —  U.S. prosecutors have charged a man identified as a leader of the Japanese organized crime syndicate Yakuza with conspiring to traffic nuclear materials from Myanmar to other countries … ",
    "url": "https://thehill.com/policy/international/4481481-federal-prosecutors-charge-japanese-yakuza-leader-in-nuclear-material-trafficking-conspiracy/"
  },
  {
    "text": "New Matt Schlapp Subpoenas Target Document-Shredding at CPAC  —  New subpoenas in the sexual assault lawsuit against CPAC leader Matt Schlapp have gone out to key witnesses, including one official who allegedly oversaw shredding in the office. … As the once-storied Conservative Political … ",
    "url": "https://www.thedailybeast.com/new-matt-schlapp-subpoenas-target-doc-shredding-at-cpac"
  }
]