[
  {
    "text": "White House to brief lawmakers as House chairman warns of ‘serious national security threat’  —  Lawmakers said the issue is serious but shouldn't cause immediate alarm.  —  National Security Advisor Jake Sullivan speaks during a press briefing at the White House in Washington, Feb. 14, 2024.",
    "url": "https://abcnews.go.com/Politics/white-house-plans-brief-lawmakers-house-chairman-warns/story?id=107232293"
  },
  {
    "text": "What we know about the ‘disturbing’ Russia intel roiling the Hill  —  The intelligence is related to Moscow's weaponization of its orbital systems, one of those informed about its content said.  —  A vague warning by the chair of the House Intelligence Committee about a “serious national security threat” … ",
    "url": "https://www.politico.com/news/2024/02/14/house-intel-national-security-threat-russia-space-power-00141473"
  },
  {
    "text": "House Intel chair warns of ‘serious national security threat’ ahead of planned White House briefing  —  The administration will brief House leaders on Thursday.  Rep. Jim Himes, the top Democrat on the House Intelligence Committee said there's no reason for Americans to panic.",
    "url": "https://www.nbcnews.com/politics/national-security/house-intel-chair-warns-serious-national-security-threat-ahead-planned-rcna138848"
  },
  {
    "text": "U.S. Has New Intelligence About Russia's Nuclear Capabilities  —  A congressman's cryptic statement about the development set Washington abuzz about what the intelligence was and infuriated White House officials.  —  The United States has informed Congress and its allies in Europe … ",
    "url": "https://www.nytimes.com/2024/02/14/us/politics/intelligence-russia-nuclear.html"
  },
  {
    "text": "House Intel Chairman announces ‘serious national security threat,’ sources say it is related to Russia  —  House Intelligence Committee Chair Mike Turner has made information concerning a “serious national security threat” available to all members of Congress to review, the committee said on Wednesday.",
    "url": "https://www.cnn.com/2024/02/14/politics/house-intel-chairman-serious-national-security-threat/"
  },
  {
    "text": "George Santos Mercilessly Trolls GOP After Democrats Win His Old Seat  —  He even took the time to text his former colleagues to call them “f***ing idiots.”  —  Disgraced former congressman George Santos tore into the Republican Party on Tuesday night after a Democrat won his old House seat … ",
    "url": "https://www.thedailybeast.com/george-santos-mercilessly-trolls-gop-after-democrats-win-his-old-seat"
  },
  {
    "text": "Republicans admit it.  Kevin McCarthy has never looked so good.  —  House GOP insiders view the new speaker as a man perpetually without a plan.  —  For nine months in his speakership, Kevin McCarthy seemed like a man with a title but no power — desperately improvising to keep … ",
    "url": "https://www.politico.com/news/2024/02/14/johnson-faces-waves-of-buyers-remorse-00141407"
  },
  {
    "text": "Powerful House GOP chair retiring after Mayorkas impeachment … - Green's decision to retire comes on the same week as the House voted to impeach Homeland Security Secretary Alejandro Mayorkas.  — Green joins House Appropriations Committee Chair Kay Granger (R-Texas) … ",
    "url": "https://www.axios.com/2024/02/14/mark-green-retire-congress-mayorkas-impeachment"
  },
  {
    "text": "About Damn Time  —  The Republicans in the House finally did something right.  Alejandro Mayorkas was finally impeached.  —  Way back when the House Republicans dumped Kevin McCarthy and finally replaced him with Mike Johnson, I predicted nothing would change.  Republicans have too small a majority to get much of anything done.",
    "url": "https://hotair.com/david-strom/2024/02/14/about-damn-time-n3782921"
  },
  {
    "text": "Biden attacked Hur for asking him when Beau died.  That didn't happen, sources say.  —  The president raised his son's death after being asked about his workflow at a Virginia rental home, where he said he found classified materials, two sources said.  —  President Joe Biden lashed … ",
    "url": "https://www.nbcnews.com/politics/justice-department/biden-attacked-hur-asking-beau-died-didnt-happen-sources-say-rcna138709"
  },
  {
    "text": "ASSISTANT DEMOCRATIC LEADER CLYBURN STATEMENT ON HOUSE LEADERSHIP ROLE  —  WASHINGTON, D.C. — Today, U.S. House Assistant Democratic Leader James E. Clyburn released the following statement on his decision to step down from House Democratic leadership:  —  “I have informed Leader Hakeem Jeffries … ",
    "url": "https://assistantdemocraticleader.house.gov/media/press-releases/assistant-democratic-leader-clyburn-statement-house-leadership-role"
  },
  {
    "text": "Jim Clyburn steps down from House Democratic leadership role  —  Rep. James Clyburn (D-S.C.) announced Wednesday he is relinquishing his role as assistant House Democratic leader after just over a year in the job. … - The 83-year-old former majority whip said, like Pelosi and Hoyer … ",
    "url": "https://www.axios.com/2024/02/14/jim-clyburn-steps-down-from-house-democratic-leadership-role"
  },
  {
    "text": "Biden Shields Palestinians in the U.S. From Deportation  —  The president, who is facing mounting criticism over U.S. support for Israel, used an authority that exempts people from deportation if their homeland is in crisis.  —  President Biden on Wednesday shielded thousands of Palestinians … ",
    "url": "https://www.nytimes.com/2024/02/14/us/politics/biden-palestinians-deportation.html"
  },
  {
    "text": "Military says Russian landing ship sunk in Black Sea  —  Editor's Note: This is a developing story and will continue to be updated.  —  The Russian landing ship Caesar Kunikov was sunk in the Black Sea in the morning of Feb. 14, the General Staff of Ukraine's Armed Forces confirmed.",
    "url": "https://kyivindependent.com/media-russian-landing-ship-allegedly-sunk-by-drones-in-black-sea/"
  },
  {
    "text": "Trump Eyes NATO Makeover, Hurried Peace in Ukraine If Elected  — NATO guarantees would be for nations that hit spending targets  — Trump plans would upend decades of security policy in Europe  —  Donald Trump is considering scaled-back commitments to some NATO members and a push … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-14/trump-eyes-two-tier-nato-security-pledge-zelenskiy-putin-peace-talks-if-elected"
  },
  {
    "text": "Conservative group tells judge it has no evidence to back its claims of Georgia ballot stuffing  —  A conservative group has told a Georgia judge that it doesn't have evidence to support its claims of illegal ballot stuffing during the the 2020 general election and a runoff two months later.",
    "url": "https://apnews.com/article/georgia-elections-true-vote-ballot-stuffing-199113b47bc2df79c63fdf007cd23115"
  },
  {
    "text": "Nikki Haley: ‘Diminished,’ ‘unhinged’ Trump has changed since she backed him  —  In an interview with NBC News' Craig Melvin, Haley explained away her past support for Trump while knocking his recent conduct and his age.  —  Former U.N. Ambassador Nikki Haley defended her past support … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-diminished-unhinged-trump-changed-backed-rcna138667"
  },
  {
    "text": "Special counsel Jack Smith urges Supreme Court to reject Trump bid to delay election trial  —  The court filing is in response to Trump's effort to prevent a court ruling that rejected his broad immunity claim from going into effect.  —  WASHINGTON — Special counsel Jack Smith on Wednesday asked … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/special-counsel-jack-smith-urges-supreme-court-reject-trump-bid-delay-rcna138906"
  },
  {
    "text": "House panel obtains texts allegedly showing Gaetz setting up 2017 Florida Keys trip with woman his associate paid for sex: Sources  —  The House Ethics Committee is reviewing the messages, sources tell ABC News.  —  Rep. Matt Gaetz is shown at the U.S. Capitol in Washington, D.C., on Feb. 6, 2024.",
    "url": "https://abcnews.go.com/US/house-panel-obtains-texts-allegedly-showing-gaetz-setting/story?id=107126493"
  },
  {
    "text": "Nearly 1 in 5 Believe Taylor Swift Election Conspiracy Theory  —  But 2 in 3 Americans approve of the singer encouraging voter turnout  —  West Long Branch, NJ - Just under 1 in 5 Americans believe the singer Taylor Swift is part of a covert effort to help President Joe Biden win the 2024 election.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_021424"
  }
]