[
  {
    "text": "Trump Maintains Advantage  —  Haley picks up independent support but does not close gap  —  West Long Branch, NJ - A smaller field and an increase in the number of independents who plan to vote in New Hampshire's Republican primary have boosted Nikki Haley's standing there.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_nh_012224/"
  },
  {
    "text": "Wall Street opposition to Trump collapses, as ‘pipe dream’ of primary defeat ends  — Many Wall Street executives have made a calculated decision not to speak out against Donald Trump, and in some cases they will consider supporting the Republican former president.",
    "url": "https://www.cnbc.com/2024/01/22/wall-street-opposition-to-trump-collapses-as-pipe-dream-of-primary-defeat-ends.html"
  },
  {
    "text": "Supreme Court allows Border Patrol agents to remove razor wire installed by Texas at Mexico border  —  The court weighed in on a dispute between the Biden administration and Republican Gov. Greg Abbott, who installed the wire in an effort to prevent illegal border crossings.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-border-patrol-agents-remove-razor-wire-installed-rcna132890"
  },
  {
    "text": "Supreme Court clears way for border agents to remove Texas wire barrier  —  The Supreme Court sided with the Biden administration on Monday and cleared the way for border patrol agents to remove razor wire Texas officials installed along a busy stretch of the southern border until the legality of the barriers is resolved in court.",
    "url": "https://www.washingtonpost.com/politics/2024/01/22/supreme-court-texas-biden-border-razor-wire/"
  },
  {
    "text": "Fake Joe Biden robocall tells New Hampshire Democrats not to vote on Tuesday  —  The call, an apparent imitation or digital manipulation of the president's voice, says, “Voting this Tuesday only enables the Republicans in their quest to elect Donald Trump again.”",
    "url": "https://www.nbcnews.com/politics/2024-election/fake-joe-biden-robocall-tells-new-hampshire-democrats-not-vote-tuesday-rcna134984"
  },
  {
    "text": "FL CFO Backs Bill to Use Tax Dollars to Pay for Trump's Legal Defense  —  This is just gross.  —  Florida's Chief Financial Officer Jimmy Patronis announced today that he is supporting State Senator Ileana Garcia's bill SB 1740 to create a “Florida Freedom Fighter's Fund” … ",
    "url": "https://www.meidastouch.com/news/fl-cfo-backs-bill-to-use-tax-dollars-to-pay-for-trumps-legal-defense"
  },
  {
    "text": "Court pushes back E. Jean Carroll trial, allowing Trump to testify after New Hampshire  —  NEW YORK—Former President Trump's defamation trial brought by E. Jean Carroll won't resume until Wednesday morning, according to a court spokesperson, a timeline that enables Trump to wait until … ",
    "url": "https://thehill.com/regulation/court-battles/4422417-court-pushes-back-e-jean-carroll-trial-allowing-trump-to-testify-after-new-hampshire/"
  },
  {
    "text": "Republicans Push To Legalize ‘Property Owners’ Killing Homeless People in Kentucky  —  In Kentucky, politicians are preparing to vote on a law that would authorize the use of force against unhoused people who are found to be camping on private property.  —  Republican politicians in Kentucky … ",
    "url": "https://www.vice.com/en/article/jg54mg/republicans-push-to-legalize-property-owners-killing-homeless-people-in-kentucky"
  },
  {
    "text": "Ethics Ratings of Nearly All Professions Down in U.S.  —  WASHINGTON, D.C. — Americans' ratings of nearly all 23 professions measured in Gallup's 2023 Honesty and Ethics poll are lower than they have been in recent years.  Only one profession — labor union leaders — has not declined since 2019 … ",
    "url": "https://news.gallup.com/poll/608903/ethics-ratings-nearly-professions-down.aspx"
  },
  {
    "text": "Scoop: Israel proposes 2-month fighting pause in Gaza for release of all hostages  —  Israel has given Hamas a proposal through Qatari and Egyptian mediators that includes up to two months of a pause in the fighting as part of a multi-phase deal that would include the release … ",
    "url": "https://www.axios.com/2024/01/22/israel-hamas-gaza-ceasefire-hostages"
  },
  {
    "text": "Norman Jewison, acclaimed director of ‘In the Heat of the Night’ and ‘Moonstruck,’ dead at 97  —  Norman Jewison, the acclaimed and versatile Canadian-born director whose Hollywood films ranged from Doris Day comedies and “Moonstruck” to social dramas such as the Oscar-winning “In the Heat of the Night,” has died at age 97.",
    "url": "https://apnews.com/article/norman-jewison-dead-abd93f2b671b416aabdd83829822e14a"
  },
  {
    "text": "The Supreme Court Cooked Up Another Phony Case to Tear Down Major Precedent  —  This is part of Opening Arguments, Slate's coverage of the start of the latest Supreme Court term.  We're working to change the way the media covers the Supreme Court.  Support our work when you join Slate Plus.",
    "url": "https://slate.com/news-and-politics/2024/01/supreme-court-phony-fish-case-chevron.html"
  },
  {
    "text": "Far-right AfD leader vows to campaign for Brexit-style EU exit vote in Germany  —  Alice Weidel says UK departure is model for her country as party struggles with reaction to exposé about deportation ‘masterplan’  —  The leader of Germany's far-right Alternative für Deutschland … ",
    "url": "https://www.theguardian.com/world/2024/jan/22/germany-far-right-afd-leader-alice-weidel-eu-exit-campaign"
  },
  {
    "text": "Message from Chancellor King  —  On Sunday, Jan. 21, at around 5:40 p.m., UW-Whitewater police received reports of four people outside of Knilans residence hall chanting racist words, lighting what appeared to be road flares and displaying antisemitic symbols.  —  Police quickly responded to the scene.",
    "url": "https://announcements.uww.edu/Announcement/Details/18308"
  },
  {
    "text": "Biden campaign features OB-GYN who left Texas for abortion in new ad  —  President Biden's reelection campaign on Monday dropped an ad to mark the 51st anniversary of Roe v. Wade that features an OB-GYN who couldn't receive an abortion in Texas after the landmark law was overturned",
    "url": "https://thehill.com/homenews/campaign/4421276-biden-campaign-ob-gyn-ad-texas-abortion/"
  },
  {
    "text": "‘The Right Kind of Crazy’: Matt Gaetz Makes MAGA World Swoon  —  MANCHESTER, New Hamphire — Standing inside a makeshift office, a crowd of red hat-wearing MAGA acolytes in front of him and a massive mural of piercing-eyes Donald Trump on the wall behind, Matt Gaetz comfortably took questions … ",
    "url": "https://www.politico.com/news/magazine/2024/01/22/maga-movement-heir-matt-gaetz-00136968"
  },
  {
    "text": "Georgia Judge Unseals Trump Special Prosecutor Nathan Wade's Divorce Records  —  Nathan Wade was hired by Fulton County District Attorney Fani Willis as the special prosecutor in her sweeping election-racketeering case against former President Donald Trump and others",
    "url": "https://themessenger.com/politics/nathan-wade-divorce-proceeding-cobb-county-trump-georgia-fani-willis"
  },
  {
    "text": "Dexter Scott King, son of Martin Luther King Jr., dies at 62  —  The younger son of the late civil rights leader died in California after a bout with prostate cancer.  —  Dexter Scott King, the lookalike of his iconic father, the civil rights leader Dr. Martin Luther King, Jr., has died.  He was 62.",
    "url": "https://www.nbcnews.com/news/nbcblk/dexter-scott-king-son-martin-luther-king-jr-dies-62-rcna135109"
  },
  {
    "text": "Elon Musk: Diversity-based hiring is antisemitic  —  The tech billionaire visited the Auschwitz-Birkenau concentration camp and later doubled down on his comments on diversity, equity and inclusion.  —  KRAKÓW, Poland — Elon Musk has upped his war on woke by saying … ",
    "url": "https://www.politico.eu/article/elon-musk-diversity-based-hiring-is-antisemitic/"
  },
  {
    "text": "25,000 deaths in Gaza: Why the destruction of this war exceeds that of other major conflicts  —  Eight out of every 10 victims in the Palestinian enclave since last October 7 are women or children  —  By DANIELE GRASSO YOLANDA CLEMENTE ANTONIO PITA  —  The health authorities in Gaza … ",
    "url": "https://english.elpais.com/international/2024-01-22/25000-deaths-in-gaza-why-the-destruction-of-this-war-exceeds-that-of-other-major-conflicts.html"
  },
  {
    "text": "Phillips campaign rules out ‘No Labels’ run  —  Rep. Dean Phillips (D-Minn.), the long shot challenging President Biden for the White House, will not run as a candidate with No Labels.  —  Phillips's leading campaign adviser Jeff Weaver confirmed to The Hill that the congressman … ",
    "url": "https://thehill.com/homenews/campaign/4422290-phillips-campaign-rules-out-no-labels-run/"
  }
]