[
  {
    "text": "RNC Moving to Declare Trump Its Presumptive Nominee  —  An RNC committeeman has submitted the proposal despite Nikki Haley's vow to stay in the race.  —  The Republican National Committee (RNC) is reviewing a draft resolution that, if approved, would declare Donald Trump … ",
    "url": "https://thedispatch.com/newsletter/dispatch-politics/rnc-moving-to-declare-trump-its-presumptive-nominee/"
  },
  {
    "text": "GOP senators seethe as Trump blows up delicate immigration compromise  —  Senior Senate Republicans are furious that Donald Trump may have killed an emerging bipartisan deal over the southern border, depriving them of a key legislative achievement on a pressing national priority and offering … ",
    "url": "https://www.cnn.com/2024/01/25/politics/gop-senators-angry-trump-immigration-deal/"
  },
  {
    "text": "Republican National Committee pulls resolution declaring Trump as the ‘presumptive 2024 nominee’  —  The Republican National Committee has pulled a resolution to consider declaring Donald Trump the party's “presumptive 2024 nominee” before he formally clinches the requisite number of delegates … ",
    "url": "https://apnews.com/article/rnc-trump-presumptive-nominee-haley-2024-campaign-74c529ab8d3804622276f8e197cd3a5c"
  },
  {
    "text": "Republican National Committee considering move that would declare Trump the presumptive nominee  —  A draft resolution circulating among the Republican National Committee would formally declare Donald Trump the Republican Party's 2024 presumptive nominee.  —  While the former president … ",
    "url": "https://www.cnn.com/2024/01/25/politics/rnc-trump-presumptive-nominee-resolution"
  },
  {
    "text": "Playbook: Why Mark Penn thinks Trump needs Haley  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TALK OF THIS TOWN — Michael Schaffer's latest: “Trump Could Come Back.  #Resistance Might Not”  —  TOP-ED — WSJ editorial page to GOP: Pass the Ukraine-border deal.",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/26/why-mark-penn-thinks-trump-needs-haley-00138041"
  },
  {
    "text": "Trump's courtroom appearances force Arizona GOP to cancel ‘Freedom Fest’: report  —  The Arizona Republican Party has pulled the plug on their upcoming “Freedom Fest” event after former President Donald Trump, who was set to headline the gathering, ditched it to attend to legal matters in court.",
    "url": "https://www.rawstory.com/trump-freedom-fest-court/"
  },
  {
    "text": "‘Preposterous’: Federal judge decries efforts to downplay Jan. 6 violence, label perpetrators ‘hostages’  —  Judge Royce Lamberth, who has handled dozens of Jan. 6 cases, lamented the false rhetoric spread by Donald Trump and his allies.  —  The longest-serving district judge on the federal bench … ",
    "url": "https://www.politico.com/news/2024/01/25/judge-lamberth-jan-6-trump-00137960"
  },
  {
    "text": "Matt Gaetz Privately Told Colleagues His Real Motivation for Kevin McCarthy Ouster Was Ethics Probe  —  In private communications reviewed by The Daily Beast, Matt Gaetz indicated his vendetta against Kevin McCarthy was rooted in the Ethics Committee investigation against Gaetz.",
    "url": "https://www.thedailybeast.com/matt-gaetz-privately-told-colleagues-his-real-motivation-for-mccarthy-ouster-was-ethics-probe"
  },
  {
    "text": "Border standoff between Texas, feds intensifies as governor defies Supreme Court ruling  —  This week, the Supreme Court sided with federal agents to remove razor wire put in place by Texas along the Rio Grande.  The state is using wire and state agents to block Border Patrol from accessing a section of the border in Eagle Pass.",
    "url": "https://www.pbs.org/newshour/show/border-standoff-between-texas-feds-intensifies-as-governor-defies-supreme-court-ruling"
  },
  {
    "text": "Exclusive: China presses Iran to rein in Houthi attacks in Red Sea, sources say  —  Chinese officials have asked their Iranian counterparts to help rein in attacks on ships in the Red Sea by the Iran-backed Houthis, or risk harming business relations with Beijing, four Iranian sources and a diplomat familiar with the matter said.",
    "url": "https://www.reuters.com/world/middle-east/china-presses-iran-rein-houthi-attacks-red-sea-sources-say-2024-01-26/"
  },
  {
    "text": "Scoop: Biden tells Bibi he's not in it for a year of war in Gaza  —  President Biden last week pressed Israeli Prime Minister Benjamin Netanyahu to scale down the Israeli military operation in Gaza, stressing he is not in it for a year of war, two U.S. officials told Axios.",
    "url": "https://www.axios.com/2024/01/26/biden-netanyahu-israel-hamas-war-gaza-timetable"
  },
  {
    "text": "EXCLUSIVE: Willis, Wade and others expected to be subpoenaed for hearing on Fulton County DA affair allegations  —  A current and former law partner to Nathan Wade, the special prosecutor leading the 2020 election subversion case in Georgia, have been told to expect a subpoena to testify … ",
    "url": "https://www.cnn.com/2024/01/25/politics/fulton-county-subpoenas-willis-wade-election-subversion/"
  },
  {
    "text": "EU threatens to silence Hungary if it blocks Ukrainian funds  —  Leaders may consider invoking the “nuclear option” of kicking Hungarian PM Viktor Orbán out of the EU voting process.  —  BRUSSELS — There's a Hungarian saying for when things are not going well: “It is under the frog's ass.”",
    "url": "https://www.politico.eu/article/eu-threatens-silence-hungary-orban-if-blocks-ukrainian-aid-funds-article-7/"
  },
  {
    "text": "Larry Kudlow Agrees Biden Economy ‘Not as Bad’ as He's Been Saying  —  “So he gets his due.  If I were he, I would be out slinging that hash,” Kudlow declared on Thursday about the better-than-expected economic growth.  —  Former Trump economic adviser Larry Kudlow conceded on Thursday … ",
    "url": "https://www.thedailybeast.com/larry-kudlow-agrees-biden-economy-not-as-bad-as-hes-been-saying"
  },
  {
    "text": "MoveOn Will Spend $32 Million to Back Biden and Other Democrats  —  The liberal group plans to pour cash into an effort to generate enthusiasm for the president and support Democratic Senate and House candidates.  —  The liberal activist group MoveOn will spend more than $32 million this year … ",
    "url": "https://www.nytimes.com/2024/01/26/us/politics/moveon-biden-democrats.html"
  },
  {
    "text": "Steve Bannon Admits Bank Account May Have Evidence of Fraud  —  Steve Bannon is in a tight spot.  He didn't pay his lawyer, got sued, and now his finances might be subject to review.  The problem is, there might be evidence of fraud there. … Steve Bannon is in a maelstrom of his own making.",
    "url": "https://www.thedailybeast.com/steve-bannon-admits-bank-account-may-have-evidence-of-fraud"
  }
]