[
  {
    "text": "Elon Musk's X sues media watchdog Media Matters over report on pro-Nazi content on the social media site  —  After a devastating advertiser exodus last week involving some of the world's largest media companies, X owner Elon Musk is suing the progressive watchdog group Media Matters … ",
    "url": "https://www.cnn.com/2023/11/20/tech/x-sues-media-matters/"
  },
  {
    "text": "America's most unhinged, unelected official  —  Stephen Miller, the notorious advisor to former president Donald Trump, suggested on X yesterday that a “conservative state Attorney[] General” should pursue civil and criminal charges against Media Matters.  Miller claims that Media Matters committed … ",
    "url": "https://popular.info/p/americas-most-unhinged-unelected"
  },
  {
    "text": "Playbook: Why the Trump gag order fight matters  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  CAMPAIGN DEATHWATCH — “Vivek Ramaswamy struggles to gain traction with Iowa Republicans as critics question his path ahead,” by AP's Margery A. Beck … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/21/why-the-trump-gag-order-fight-matters-00128231"
  },
  {
    "text": "Trump's Dire Words Raise New Fears About His Authoritarian Bent  —  The former president is focusing his most vicious attacks on domestic political opponents, setting off fresh worries among autocracy experts.  —  Donald J. Trump rose to power with political campaigns that largely attacked external targets … ",
    "url": "https://www.nytimes.com/2023/11/20/us/politics/trump-rhetoric-fascism.html"
  },
  {
    "text": "Billionaires are lining up to fund Donald Trump's anti-democratic agenda  —  The more disturbing Trump's public proclamations become, the more US plutocrats seem to want him to win  —  As an ever-greater portion of the nation's total wealth goes to the top, it's hardly surprising that ever … ",
    "url": "https://www.theguardian.com/commentisfree/2023/nov/21/donald-trump-anti-democratic-agenda-billionaires-neofascism"
  },
  {
    "text": "Matt Gaetz at 21% approval rating in Florida, poll says  —  A new poll shows U.S. Rep. Matt Gaetz is a polarizing figure in Florida, both in and outside of the Republican Party.  —  A poll from the Florida Atlantic University Mainstreet PolCom Lab released last week showed that 57% … ",
    "url": "https://www.pnj.com/story/news/politics/2023/11/21/congressman-matt-gaetz-at-21-approval-following-house-speaker-drama/71653429007/"
  },
  {
    "text": "Cornel West sets his sights on a key battleground state  —  The independent candidate is well positioned to capitalize on Biden's weaknesses in a certain swing state.  —  Independent presidential hopeful Cornel West is taking aim at Michigan by courting voter groups that Joe Biden is struggling with … ",
    "url": "https://www.politico.com/news/2023/11/21/joe-biden-cornel-west-michigan-2024-00128244"
  },
  {
    "text": "Israel-Hamas deal on hostage release and ceasefire is imminent, sources say  —  A deal between Israel and Hamas to free dozens of hostages and declare a multi-day ceasefire is imminent and could be announced by the Qatari mediators as soon as Tuesday, two sources with direct knowledge of the issue told Axios.",
    "url": "https://www.axios.com/2023/11/21/israel-hamas-hostage-ceasefire-deal-imminent"
  },
  {
    "text": "House GOP's Biden impeachment effort heads into final stage  —  The conference plans to depose Hunter Biden in December and is working to tie up other threads before January — when advocates hope they can start moving toward a vote.  —  House Republicans are closing in on a make-or-break moment … ",
    "url": "https://www.politico.com/news/2023/11/21/house-republicans-biden-impeachment-00128154"
  },
  {
    "text": "Large military aircraft overshoots runway, ends up in Kaneohe Bay  —  HONOLULU (HawaiiNewsNow) - A large U.S. Navy aircraft ended up in shallow waters of Kaneohe Bay on Monday afternoon after overshooting the runway at Marine Corps Base Hawaii.  —  The incident happened about 1:57 p.m. when the P-8 Poseidon aircraft was landing.",
    "url": "https://www.hawaiinewsnow.com/2023/11/21/emergency-crews-responding-after-reported-downed-military-aircraft-kaneohe-bay/"
  },
  {
    "text": "Republican megadonor Mercer family weighs backing Trump as they maintain massive war chest  — The wealthy Mercer family is weighing whether to financially support Donald Trump's latest White House run, after years of distancing themselves from him.  — The family foundation … ",
    "url": "https://www.cnbc.com/2023/11/21/mercers-weigh-backing-trump-with-massive-war-chest.html"
  },
  {
    "text": "North Carolina sued over new House maps  —  The newly redrawn district boundaries for the North Carolina state Senate divide predominantly Black counties in a way that dilutes the power of Black residents, according to a lawsuit filed Monday.  —  The lawsuit — filed against the North Carolina State Board … ",
    "url": "https://thehill.com/homenews/state-watch/4320719-north-carolina-lawsuit-redrawn-house-maps/"
  },
  {
    "text": "Transgender woman footballer quits and threatens to sue for discrimination because rivals refuse to compete against her after she left opponents ‘terrified’ and broke knee of a player ‘blocking her shot’  — Francesca Needham played for Rossington Main Ladies, near Doncaster",
    "url": "https://www.dailymail.co.uk/news/article-12771191/Transgender-woman-footballer-left-opponents-terrified-broke-knee-player-blocking-shot-quits-team-threatens-sue-discrimination-rivals-refused-compete-against-her.html"
  },
  {
    "text": "Democratic machine looms large in race to unseat Menendez  —  Good morning, Early Birds.  So you can plan your week, The Early will be in your inboxes tomorrow.  But we're taking Thursday and Friday off.  Tips: earlytips@washpost.com.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/11/21/democratic-machine-looms-large-race-unseat-menendez/"
  },
  {
    "text": "The Way Nevada Will Pick the GOP Presidential Nominee Is a Mess  —  Dueling caucus and primary confuse voters  —  LAS VEGAS—In January, roughly half a million Republican voters in Nevada will receive presidential primary ballots in the mail.  Former President Donald Trump's name won't be on them.",
    "url": "https://www.wsj.com/politics/elections/the-way-nevada-will-pick-the-gop-presidential-nominee-is-a-mess-5d165f46?mod=followamazon"
  },
  {
    "text": "How the U.S. Violates Its Own Trade Laws to Buy Seafood from China  —  Uyghurs and North Koreans are forced to work in Chinese seafood processing plants.  But the federal government purchases millions of dollars of this seafood for the military and school lunches.",
    "url": "https://www.politico.com/news/magazine/2023/11/21/chinese-forced-labor-seafood-00126642"
  },
  {
    "text": "After the Civil War, Robert E. Lee Couldn't Run for President, but Trump Can?  —  In 1865, when the 39th Congress assembled in Washington, D.C., lawmakers faced an unusual problem: The former Confederate states, decisively defeated on the battlefield and having surrendered, were poised to return to the Union and take it over.",
    "url": "https://washingtonmonthly.com/2023/11/20/after-the-civil-war-robert-e-lee-couldnt-run-for-president-but-trump-can/"
  },
  {
    "text": "Diversity, Equity, Inclusion—and the Elimination of Jews  —  All of our institutions—government, education, media, professions, and industry—are formally and fully committed to “social justice,” the explicit specifics of which are diversity, equity, and inclusion, with the quiet part being the elimination of Jews.",
    "url": "https://pjmedia.com/philip-carl-salzman/2023/11/20/social-justice-stands-for-diversity-equity-inclusion-and-the-elimination-of-jews-n4924087"
  },
  {
    "text": "CBP officers seize 354 pounds of methamphetamine at El Paso port  —  EL PASO, Texas - U.S. Customs and Border Protection officers working at the Paso Del Norte international crossing seized 354 pounds of methamphetamine Nov. 18.  The drugs were concealed in the bed of a pick-up truck that entered the U.S. from Mexico.",
    "url": "https://www.cbp.gov/newsroom/local-media-release/cbp-officers-seize-354-pounds-methamphetamine-el-paso-port"
  }
]