[
  {
    "text": "Former New Mexico Governor Bill Richardson dead at 75  —  Richardson was nominated for a Nobel Peace Prize last month in recognition of his work saving Americans, most recently WNBA player Brittney Griner.  —  Bill Richardson, the former New Mexico governor, U.S. ambassador to the United Nations … ",
    "url": "https://www.nbcnews.com/news/obituaries/former-new-mexico-governor-bill-richardson-dead-75-rcna103126"
  },
  {
    "text": "Bill Richardson, a former governor and UN ambassador who worked to free detained Americans, dies  —  Bill Richardson, a two-term Democratic governor of New Mexico and an American ambassador to the United Nations who also worked for years to secure the release of Americans detained by foreign adversaries, has died.",
    "url": "https://apnews.com/article/bill-richardson-un-ambassador-new-mexico-governor-c1e6ed9705564452824d537293945662"
  },
  {
    "text": "Bill Richardson, Former U.N. Ambassador and New Mexico Gov, dead at 75  —  Former U.N. Ambassador and New Mexico Gov. Bill Richardson, who helped negotiate release of detained Americans, has died.  —  He was 75.  —  The Richardson Center for Global Engagement, which he founded … ",
    "url": "https://www.cbsnews.com/news/bill-richardson-former-u-n-ambassador-and-new-mexico-gov-dead-at-75/"
  },
  {
    "text": "‘Crooked Coffee’: The alleged election office breach in the Trump indictment was part of a years-long pattern, some locals say  —  The breach of the Coffee County elections office can seem almost out of place in the 97-page Georgia indictment of former President Donald Trump and associates.",
    "url": "https://www.cnn.com/2023/09/02/politics/georgia-coffee-county-breach-voters/"
  },
  {
    "text": "Trump's Truth Social facing a key funding deadline  —  The ‘blank check’ ally of former president Donald Trump's media start-up was once a stock-market star.  It's now days away from potential liquidation.  —  When former president Donald Trump's media start-up announced in October 2021 … ",
    "url": "https://www.washingtonpost.com/technology/2023/09/02/truth-social-trump-media-digital-world/"
  },
  {
    "text": "The Story of Our Universe May Be Starting to Unravel  —  Not long after the James Webb Space Telescope began beaming back from outer space its stunning images of planets and nebulae last year, astronomers, though dazzled, had to admit that something was amiss.",
    "url": "https://www.nytimes.com/2023/09/02/opinion/cosmology-crisis-webb-telescope.html"
  },
  {
    "text": "Trump Is Top Choice for Nearly 60% of GOP Voters, WSJ Poll Shows  —  Support for DeSantis collapses in postdebate survey  —  Donald Trump has expanded his dominating lead for the Republican presidential nomination, a new Wall Street Journal poll shows, as GOP primary voters overwhelmingly … ",
    "url": "https://www.wsj.com/politics/elections/trump-is-top-choice-for-nearly-60-of-gop-voters-wsj-poll-shows-877252b6?mod=followamazon"
  },
  {
    "text": "Nobel Foundation cancels Russia, Belarus, Iran invites to annual prize awards  —  The Nobel Foundation said on Saturday it would not after all invite the ambassadors of Russia, Belarus and Iran to attend the Nobel Prize awards ceremony in Stockholm this year, reversing an earlier decision after widespread criticism.",
    "url": "https://www.reuters.com/world/nobel-foundation-cancels-russia-belarus-iran-invites-annual-prize-awards-2023-09-02/"
  },
  {
    "text": "Statement from President Joe Biden on the Passing of Jimmy Buffett  —  A poet of paradise, Jimmy Buffett was an American music icon who inspired generations to step back and find the joy in life and in one another.  —  His witty, wistful songs celebrate a uniquely American cast of characters … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/09/02/statement-from-president-joe-biden-on-the-passing-of-jimmy-buffett/"
  },
  {
    "text": "Biden has DNC plow $1.2M into Virginia amid Youngkin fundraising blitz  —  RICHMOND — President Biden directed the Democratic National Committee this week to pour $1.2 million into Virginia legislative races to counter record-smashing fundraising by Gov. Glenn Youngkin (R) … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/09/02/biden-fundraising-virginia-democrats/"
  },
  {
    "text": "Atomic age is over in Germany, Chancellor Scholz insists  —  Germany will not leave the door open for a possible return to using nuclear power now or in the future, German Chancellor Olaf Scholz said on Saturday.  —  Responding to a suggestion from members of his own governing coalition … ",
    "url": "https://www.politico.eu/article/germany-nuclear-energy-climate-change-olaf-scholz-atomic-age-is-over/"
  },
  {
    "text": "“We've got disagreements on this issue within our own party.”  — Stephanie Soucek, Door County GOP chairwoman  —  The opposing displays captured how the Supreme Court's move to overturn Roe v. Wade 14 months ago has reshaped the landscape of American politics, right down to the familiar ritual of county fair politicking.",
    "url": "https://www.washingtonpost.com/nation/interactive/2023/wisconsin-abortion-rights/"
  },
  {
    "text": "Three Things for Your Labor Day Picnic  —  Pickles frowns on eating chicken, in any form, as part of your holiday celebration.  But she did want me to share three important things with you heading into the long weekend.  You never know when the opportunity for civil discourse will present itself—even at the family cookout.",
    "url": "https://joycevance.substack.com/p/three-things-for-your-labor-day-picnic"
  },
  {
    "text": "Ex-Christie aide charged with child sex crimes  —  A former aide to Gov. Chris Christie has been arrested on charges he paid to engage in a sexual act with a six-year-old girl.  —  Kevin Tomafsky, 41, has been under investigation since  October 2022 after Snapchat reported the uploading … ",
    "url": "https://newjerseyglobe.com/governor/ex-christie-aide-charged-with-child-sex-crimes/"
  },
  {
    "text": "DeSantis will not meet with Biden in Florida on Saturday  —  “The security preparations alone that would go into setting up such a meeting would shut down ongoing recovery efforts,” said a spokesperson for the governor.  —  Ron DeSantis will not meet Joe Biden on Saturday when the president comes … ",
    "url": "https://www.politico.com/news/2023/09/01/desantis-biden-hurricane-idalia-00113815"
  }
]