[
  {
    "text": "Donald Trump's first criminal trial is nearly here — and he's already starting to melt down  —  Trump is very worried about his election interference case for good reason  —  There's been some talk lately about Donald Trump's light campaign schedule compared to President Joe Biden … ",
    "url": "https://www.salon.com/2024/04/10/donald-first-criminal-trial-is-nearly-here--and-hes-already-starting-to-melt-down/"
  },
  {
    "text": "Trump lawyers set to return court with another challenge to his impending criminal trial in New York  —  The former president's filing at the state Appellate Division is his third challenge to the case in three days.  —  Lawyers for former President Donald Trump were heading … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-lawyers-return-court-another-challenge-criminal-trial-new-york-rcna147209"
  },
  {
    "text": "Former Trump executive Allen Weisselberg sentenced to 5 months in jail for lying in civil fraud case  —  Allen Weisselberg, a retired executive in Donald Trump's real estate empire, was sentenced on Wednesday to five months in jail for lying under oath during his testimony in the civil fraud lawsuit brought … ",
    "url": "https://apnews.com/article/weisselberg-trump-perjury-new-york-b76cde56c6cb983ab8789f95d5a0c6c0"
  },
  {
    "text": "Trump loses third bid this week to delay hush money trial  —  A New York appeals judge on Wednesday denied Donald Trump's third last-ditch attempt this week to delay his April 15 criminal trial on charges stemming from hush money paid to a porn star, paving the way for the first-ever trial of a former U.S. president.",
    "url": "https://www.reuters.com/legal/trump-tries-delay-hush-money-trial-third-time-this-week-2024-04-10/"
  },
  {
    "text": "Arizona Republicans Thwart Attempts to Repeal 1864 Abortion Ban  —  Democrats in both houses of the Legislature were blocked from advancing bills to roll back a reinstated 160-year-old ban on nearly all abortions in the state.  —  A decision by Arizona's highest court upholding an 1864 ban … ",
    "url": "https://www.nytimes.com/2024/04/10/us/abortion-ban-arizona-democrats-repeal.html"
  },
  {
    "text": "Fox News buries court decision implementing a near-total abortion ban in Arizona  —  None of the network's evening “opinion” shows mentioned it at all  —  RESEARCH CONTRIBUTIONS FROM HARRISON RAY & TYLER MONROE  —  Fox News' evening “opinion” hosts completely ignored Tuesday's ruling … ",
    "url": "https://www.mediamatters.org/fox-news/fox-news-buries-court-decision-implementing-near-total-abortion-ban-arizona"
  },
  {
    "text": "Trump says he wouldn't sign federal abortion ban  —  Former President Donald Trump on Wednesday said he would not sign a federal abortion ban if one reached his desk were he to be elected in November.  —  It's Trump's firmest response to date on a national abortion ban.",
    "url": "https://www.cnn.com/2024/04/10/politics/trump-says-he-wouldnt-sign-federal-abortion-ban"
  },
  {
    "text": "Crenshaw says Greene's expulsion threat for ‘attention,’ doesn't have much support  —  Rep. Dan Crenshaw (R-Texas) said Wednesday that Rep. Marjorie Taylor Greene (R-Ga.) is seeking “attention” with her expulsion threat against Speaker Mike Johnson (R-La.).  —  “Right now, I'm not sure … ",
    "url": "https://thehill.com/homenews/house/4586650-crenshaw-greene-johnson-expulsion-threat/"
  },
  {
    "text": "emptywheel Makes CIPA History  —  Yesterday, Judge Aileen Cannon issued a surly order, acceding to Jack Smith's request to protect witnesses.  In reversing herself, Cannon scolded Smith for not making a more fulsome case to seal information. … Ultimately, Cannon argued the 11th Circuit precedent … ",
    "url": "https://www.emptywheel.net/2024/04/10/emptywheel-makes-cipa-history/"
  },
  {
    "text": "North Carolina 2024: Trump On Upside Of Too-Close-To-Call Race, Quinnipiac University North Carolina Poll Finds; Governor's Race: Stein Leads Robinson 52% - 44%  —  mail_outline  —  In a state considered pivotal to the outcome of the 2024 presidential election, President Joe Biden … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3895"
  },
  {
    "text": "Scoop: Biden plans order to limit southern border crossings by end of month … But Biden, briefed on polls of rising voter anger, wants a dramatic step. … - Biden would use authority in Section 212(f) of the Immigration and Nationality Act, which gives the president broad leeway … ",
    "url": "https://www.axios.com/2024/04/10/biden-border-executive-order-immigrants-asylum-limit"
  },
  {
    "text": "Shooting at Ramadan event in West Philadelphia leaves 3 injured, 5 in custody, police say  —  PHILADELPHIA (CBS) - Three people were shot at the end of a Ramadan event with around 1,000 people in attendance in West Philadelphia's Parkside section Wednesday afternoon, according to police.",
    "url": "https://www.cbsnews.com/news/west-philly-shooting-police/"
  },
  {
    "text": "Inflation Continues to Climb (Paul Krugman Hardest Hit)  —  Inflation refuses to go away quietly.  The CPI numbers out today are raising concerns that we may not see the soft landing we were hoping for. … The DOW is down more than 500 points today in response to the news.",
    "url": "https://hotair.com/john-s-2/2024/04/10/inflation-continues-to-climb-paul-krugman-hardest-hit-n3786261"
  },
  {
    "text": "Klain on Biden: He is focused too much on bridges  —  The former chief of staff praised the president's accomplishments.  But he also wondered whether he had the right focus.  —  Former White House chief of staff Ron Klain openly questioned President Joe Biden's political strategy Tuesday night … ",
    "url": "https://www.politico.com/news/2024/04/09/ron-klain-joe-biden-infrastructure-00151438"
  },
  {
    "text": "Senate approves resolution targeting Biden highway climate rule, with Democratic support  —  The Senate on Wednesday passed a measure to nullify a Transportation Department rule targeting highway greenhouse gas emissions.  —  The Senate on Wednesday passed a measure to nullify … ",
    "url": "https://www.politico.com/news/2024/04/10/senate-approves-resolution-targeting-highway-emissions-rule-00151588"
  },
  {
    "text": "Elon Musk picks his speech battle  —  Happy Wednesday!  Hope your eyes are recovering.  Send news tips to: will.oremus@washpost.com.  —  Though Elon Musk often insists his goal with X is to promote free speech, his actions have rarely been those of the “free-speech absolutist” he once claimed to be.",
    "url": "https://www.washingtonpost.com/politics/2024/04/10/elon-musk-picks-his-speech-battle/"
  },
  {
    "text": "DOJ opens formal investigation of U.S. Steel takeover  —  President Joe Biden has said U.S. Steel must “remain an American steel company that is domestically owned and operated.”  —  The Justice Department has opened up an in-depth antitrust investigation of Nippon Steel's $14.1 billion takeover … ",
    "url": "https://www.politico.com/news/2024/04/10/doj-opens-formal-investigation-us-steel-takeover-00151615"
  },
  {
    "text": "Without More Aid, Ukraine Could Lose the War, U.S. General Says  —  The United States gives Ukraine's military most of two critical munitions that are in shortest supply: artillery shells and air-defense interceptors.  —  The top American military commander in Europe warned on Wednesday … ",
    "url": "https://www.nytimes.com/2024/04/10/us/politics/us-aid-ukraine-war.html"
  },
  {
    "text": "Trump Media director accused of ‘hacking’ files in attempted corporate ‘coup’: lawsuit … This photo illustration shows an image of former President Donald Trump next to a phone screen that is displaying the Truth Social app, in Washington, DC, on February 21, 2022.",
    "url": "https://www.cnbc.com/2024/04/10/trump-media-director-accused-of-hacking-files-lawsuit.html"
  },
  {
    "text": "Exxon Declares War On Its Dissenters  —  ExxonMobil has launched an extraordinary lawsuit against two investment firms for the alleged offense of filing climate-focused shareholder proposals.  The fossil fuel giant's underlying goal: killing a federal regulatory effort that would make it easier … ",
    "url": "https://www.levernews.com/exxon-declares-war-on-its-dissenters/"
  },
  {
    "text": "Nebraska Republicans float special session to revive Trump-backed election rule change  —  The state currently awards some of its electoral college votes by congressional districts, a key backstop for President Joe Biden.  —  Nebraska Gov. Jim Pillen is floating a special legislative session … ",
    "url": "https://www.politico.com/news/2024/04/10/nebraska-gop-trump-election-rules-00151499"
  },
  {
    "text": "US Sees Missile Strike on Israel By Iran, Proxies as Imminent  — Iran, proxies may strike Israeli military, government sites  — Attack would mark major widening of conflict in Middle East  —  The US and its allies believe major missile or drone strikes by Iran or its proxies … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-10/us-sees-missile-strike-on-israel-by-iran-proxies-as-imminent"
  }
]