[
  {
    "text": "Koch Network Endorses Nikki Haley in Bid to Push GOP Past Trump  —  The support will give Ms. Haley more organizational strength in the field as she battles Gov. Ron DeSantis of Florida for the No. 2 spot in the Republican presidential race.  —  The political network founded … ",
    "url": "https://www.nytimes.com/2023/11/28/us/politics/koch-network-nikki-haley-endorsement-trump.html"
  },
  {
    "text": "Koch network endorses Nikki Haley for president as it looks to stop Trump  —  The powerful political network led by conservative billionaire Charles Koch endorsed Nikki Haley for president on Tuesday, as it looks to stop Donald Trump from being the Republican nominee.",
    "url": "https://www.washingtonpost.com/elections/2023/11/28/koch-network-haley-president/"
  },
  {
    "text": "Pence told Jan. 6 special counsel harrowing details about 2020 aftermath, warnings to Trump: Sources  —  The former VP is the top official known to have spoken with investigators.  —  In this Nov. 24, 2020 file photo President Donald Trump and Vice President Mike Pence prepare to speak … ",
    "url": "https://abcnews.go.com/US/pence-told-jan-6-special-counsel-harrowing-details/story?id=105183391"
  },
  {
    "text": "Exclusive: Liz Cheney's new book blasts GOP as ‘enablers and collaborators’ of Trump, whom one member called ‘Orange Jesus’  —  In her new book, former Rep. Liz Cheney paints a scathing portrait of the Republican Party, condemning her former colleagues and party leaders as … ",
    "url": "https://www.cnn.com/2023/11/28/politics/liz-cheney-trump-mccarthy-book/"
  },
  {
    "text": "Elon Musk boosts Pizzagate conspiracy theory that led to D.C. gunfire  —  The far-right theory motivated a gunman to fire multiple rounds inside the Comet Ping Pong pizzeria in Northwest Washington in 2016.  Musk boosted the theory to his 164 million followers anyway.",
    "url": "https://www.washingtonpost.com/technology/2023/11/28/pizzagate-musk-twitter-x-controversy/"
  },
  {
    "text": "Elon Musk deletes ‘Pizzagate’ meme following widespread backlash  —  Billionaire Elon Musk on Tuesday took down a post from his account on X, the platform formerly known as Twitter, that embraced a years-old false conspiracy theory about child sex trafficking after the tech and media mogul received widespread backlash and mockery.",
    "url": "https://thehill.com/policy/technology/4331790-elon-musk-deletes-pizzagate-meme/"
  },
  {
    "text": "Republicans Reject Hunter Biden's Offer to Testify Publicly  —  ‘OPENING THE DOOR’  —  House Oversight Committee Chairman James Comer (R-KY) denied Hunter Biden's request to testify publicly, saying that he wants the president's son to sit down for a closed-door deposition on Dec. 13.",
    "url": "https://www.thedailybeast.com/hunter-biden-agrees-to-testify-before-housebut-only-in-public-hearing"
  },
  {
    "text": "Comer Rejects Hunter Biden's Efforts to ‘Play by His Own Rules’  —  On Tuesday morning Hunter Biden's attorney Abbe Lowell informed the House Oversight Committee that his client would comply with a subpoena issued earlier in the month by Chairman James Comer, but only for public testimony.",
    "url": "https://townhall.com/tipsheet/katiepavlich/2023/11/28/comer-rejects-hunter-bidens-efforts-to-play-by-his-own-rules-n2631726"
  },
  {
    "text": "Melania Trump and Other Living First Ladies Pay Tribute to Rosalynn Carter  —  Melania Trump and Michelle Obama were seated side by side.  —  In any other circumstance it would have been a shocking sight.  But it was only fitting that in her death Rosalynn Carter, the pioneering woman … ",
    "url": "https://www.nytimes.com/2023/11/28/style/melania-trump-rosalynn-carter-memorial.html"
  },
  {
    "text": "Republicans must meet the moment  —  It's been almost three years since Democrats retook the White House, and the nation is watching in disbelief as the country they once knew is no longer secure — economically, culturally, or militarily.  —  Reckless spending and leftist regulations … ",
    "url": "https://www.washingtonexaminer.com/opinion/republicans-must-meet-the-moment"
  },
  {
    "text": "Trump fundraises off Colorado 14th Amendment case to keep him off ballot  —  Former President Trump is fundraising off the 14th Amendment case unfolding in Colorado to keep him off the ballot based on claims that he is disqualified under the amendment.  —  A fundraising email sent … ",
    "url": "https://thehill.com/regulation/court-battles/4331390-trump-fundraises-colorado-14th-amendment-case/"
  },
  {
    "text": "Trump's Backdoor Attempts to Delay His Trials Are Backfiring  —  The New York judge overseeing Donald Trump's hush money trial won't even consider pushing it back, especially after prosecutors accused defense lawyers of delay games. … Donald Trump's calendar is filling up—and not with campaign events.",
    "url": "https://www.thedailybeast.com/trumps-new-gambit-to-delay-his-trials-isnt-quite-working"
  },
  {
    "text": "Robert De Niro Claims Trump Remarks Were Slashed at Awards Night  —  Whoops and cheers arose as the two-time Oscar winner read his full speech off his phone after he alleged parts of it had been cut from a teleprompter.  —  Robert De Niro appeared to call Apple out in front of an audience … ",
    "url": "https://www.thedailybeast.com/robert-de-niro-claims-trump-remarks-were-slashed-at-awards-night"
  },
  {
    "text": "Major news outlets gave much less coverage to Trump's “vermin” attack then they did Clinton's “deplorables” remark  —  Huge disparities mark coverage in national broadcast, cable, and print outlets  —  RESEARCH CONTRIBUTIONS FROM ROB SAVILLO, HARRISON RAY, PETE TSIPIS & TORRI LONERGAN",
    "url": "https://www.mediamatters.org/donald-trump/major-news-outlets-gave-much-less-coverage-trumps-vermin-attack-then-they-did-clintons"
  },
  {
    "text": "Fox News founder Rupert Murdoch deposed in Smartmatic election lawsuit  — Rupert Murdoch is being deposed in the $2.7 billion Smartmatic defamation lawsuit against Fox Corp. over allegedly damaging election lies, a source familiar with the matter told CNBC.",
    "url": "https://www.cnbc.com/2023/11/28/fox-news-founder-rupert-murdoch-deposed-in-smartmatic-election-lawsuit.html"
  },
  {
    "text": "Senior CIA official posted pro-Palestine image on her Facebook page  —  Rare public political statement comes amid dissent over White House's handling of Israel-Hamas war  —  A top CIA official posted a pro-Palestine image on Facebook two weeks after Hamas attacked Israel … ",
    "url": "https://www.ft.com/content/285e1f90-9f69-4f3b-b4a9-b77b6ca97e7a"
  },
  {
    "text": "Ukrainian spy chief's wife poisoned, media reports say  —  The wife of Ukraine's military spy chief has been poisoned with heavy metals and is undergoing treatment in a hospital, a spokesperson for the agency said on Tuesday.  —  Marianna Budanova is the wife of Kyrylo Budanov … ",
    "url": "https://www.reuters.com/world/europe/ukrainian-spy-chiefs-wife-poisoned-media-reports-say-2023-11-28/"
  },
  {
    "text": "Scoop: Jewish Democrats rebuke GOP bill to expel Palestinians … - The GOP bill, introduced earlier this month by Rep. Ryan Zinke (R-Mont.) with 10 Republican co-sponsors, would ban or revoke visas, refugee status and asylum for Palestinian Authority passport holders dating back to Oct 1, shortly before the Hamas attack on Israel.",
    "url": "https://www.axios.com/2023/11/28/jewish-democrats-zinke-bill-expel-palestinians"
  },
  {
    "text": "Exclusive: Biden emails 800k student loan borrowers about forgiven debt  —  More than 800,000 student loan borrowers are set to receive a message from President Biden Tuesday afternoon. … - “I've heard from countless people who have told me that relieving the burden of student loan debt … ",
    "url": "https://www.axios.com/2023/11/28/biden-student-loan-relief-email"
  }
]