[
  {
    "text": "What Mitt Romney Saw in the Senate  —  In an exclusive excerpt from my forthcoming biography of the senator, Romney: A Reckoning, he reveals what drove him to retire.  —  For most of his life, Mitt Romney has nursed a morbid fascination with his own death, suspecting that it might assert itself one day suddenly and violently.",
    "url": "https://www.theatlantic.com/magazine/archive/2023/11/mitt-romney-retiring-senate-trump-mcconnell/675306/"
  },
  {
    "text": "Mitt Romney says he will not seek a second term in the Senate  —  In a Post interview, Romney is critical of both Trump and Biden, and says most Republicans are drawn to a ‘populist demagogue message.’ His decision not to seek reelection is likely to be the end of the 2012 GOP presidential nominee's political career.",
    "url": "https://www.washingtonpost.com/politics/2023/09/13/mitt-romney-senate-reelection/"
  },
  {
    "text": "Fact-checking McCarthy's claims while launching Biden impeachment inquiry  —  House Speaker Kevin McCarthy made several unproven claims Tuesday while announcing the opening of a formal impeachment inquiry into President Joe Biden.  —  The Republican-led investigation will focus on … ",
    "url": "https://www.cnn.com/2023/09/13/politics/fact-check-mccarthy-biden-impeachment-claims/"
  },
  {
    "text": "A House GOP attempt to advance abortion measure backfires in funding fight  —  House GOP leaders wanted more leverage in the spending wars.  So far, they have less.  —  House GOP leaders have abandoned efforts to pass an agriculture funding bill amid an intraparty row over abortion policy.",
    "url": "https://www.politico.com/news/2023/09/13/abortion-policy-funding-agriculture-bill-00115529"
  },
  {
    "text": "Conservative mutiny forces delay in House Pentagon spending bill  —  “I don't know that this has anything to do with defense,” Rep. Steve Womack (R-Ark.) said of the GOP infighting.  —  House Republican infighting forced Speaker Kevin McCarthy to pump the brakes on the chamber's annual … ",
    "url": "https://www.politico.com/news/2023/09/13/defense-bill-house-republicans-00115530"
  },
  {
    "text": "Court blocks Jack Smith's access to many of Rep. Scott Perry's contacts about 2020 election  —  The appeals panel concluded that prosecutors' effort to access cellphone communications with colleagues officials violated the lawmaker's constitutional immunity.",
    "url": "https://www.politico.com/news/2023/09/13/court-smith-perry-2020-election-00115682"
  },
  {
    "text": "Wisconsin Republican leader asks former state Supreme Court justices to review impeachment  —  Wisconsin's Republican Assembly leader announced Wednesday that he's created a panel to investigate the criteria for impeachment as he mulls taking that unprecedented step against a liberal state Supreme Court justice.",
    "url": "https://apnews.com/article/wisconsin-supreme-court-justice-impeachment-03d6f56ef7d27c6c45913a4310df7953"
  },
  {
    "text": "Ramaswamy Says He Would Fire Most of the Federal Work Force if Elected  —  Vivek Ramaswamy, whose campaign for the Republican nomination has gained attention in recent months, has vowed to dismantle much of the federal government and shutter key agencies.  —  Vivek Ramaswamy … ",
    "url": "https://www.nytimes.com/2023/09/13/us/politics/vivek-ramaswamy-dismantle-government.html"
  },
  {
    "text": "The Right-Wing Conspiracy-Fest Is More Openly Bloodthirsty Than Before  —  The first thing I noticed at the latest stop on the ReAwaken America Tour in Las Vegas in mid-August was that the T-shirts are getting nastier.  “Size Matters” blared one man's shirt over enlarged images of bullets of various calibers.",
    "url": "https://newrepublic.com/article/175514/reawaken-america-political-violence-conference"
  },
  {
    "text": "Trump, Meadows offer quid pro quo on speedy trial to sever Georgia election case from co-defendants  — Donald Trump offered to “exchange” his right to a speedy trial in his Georgia election-conspiracy case for an Atlanta judge ruling that would have the former president tried separately from 18 other defendants.",
    "url": "https://www.cnbc.com/2023/09/13/trump-waives-georgia-election-speedy-trial-to-sever-from-co-defendants.html"
  },
  {
    "text": "Judge restricts Trump's access to classified info in docs case and limits what he can say  —  U.S. District Judge Aileen Cannon set specific parameters for how and when the former president can review the evidence in case against him in Florida.  —  The judge presiding over the federal … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-restricts-trumps-access-classified-info-docs-case-limits-can-say-rcna104742"
  },
  {
    "text": "Milley disputes claim he recommended Trump attack Iran  —  You can watch the full interview with Gen. Mark Milley on “Fareed Zakaria GPS” on Sunday at 10 a.m. ET.  —  CNN  —  Chairman of the Joint Chiefs of Staff Gen. Mark Milley told CNN's Fareed Zakaria in an interview Wednesday … ",
    "url": "https://www.cnn.com/2023/09/13/politics/milley-cnn-interview-trump-iran/"
  },
  {
    "text": "Federal judge again declares DACA immigration program unlawful, but allows it to continue  —  Washington — A federal judge on Wednesday again declared the Deferred Action for Childhood Arrivals immigration program unlawful, though he refrained from ordering officials to terminate deportation protections … ",
    "url": "https://www.cbsnews.com/news/daca-ruling-immigration-dreamers-federal-judge-texas/"
  },
  {
    "text": "Jury's fresh-air break could upend Navarro conviction  —  The former Donald Trump adviser was on trial for defying a subpoena from the Jan. 6 select committee.  —  An unusual outdoor excursion by the jury that convicted Peter Navarro — just 30 minutes before delivering its verdict last week … ",
    "url": "https://www.politico.com/news/2023/09/13/navarro-conviction-jury-fresh-air-break-00115556"
  },
  {
    "text": "Is AOC Married?  Her Office Says No. Her Legal Filings in Congress Say Otherwise.  —  Rep. Alexandria Ocasio-Cortez's (D., N.Y.) office says she isn't married.  But she has described her fiancé, Riley Roberts, as her “spouse” in forms filed with the House Ethics Committee in 2023 … ",
    "url": "https://freebeacon.com/democrats/aoc-cites-longtime-partner-as-spouse-but-keeps-his-finances-under-wraps-a-potential-breach-of-ethics-rules/"
  },
  {
    "text": "US judge freezes New Mexico governor's gun ban  —  A federal judge in New Mexico on Wednesday issued a temporary restraining order against state Governor Michelle Lujan Grisham's ban on carrying guns in Albuquerque and its surrounding county, on grounds it violated the U.S. constitution.",
    "url": "https://www.reuters.com/world/us/new-mexico-mayor-calls-legislative-debate-after-gun-ban-2023-09-13/"
  },
  {
    "text": "Florida surgeon general rejects FDA guidance, urges people under 65 not to get Covid booster  —  Previous guidance by Joe Ladapo has been widely rejected by the medical community.  —  TALLAHASSEE, Fla. — Gov. Ron DeSantis' hand-picked surgeon general on Wednesday warned healthy adults under … ",
    "url": "https://www.politico.com/news/2023/09/13/florida-surgeon-general-fda-covid-booster-00115781"
  },
  {
    "text": "Trump wants to close the Department of Education, joining calls by GOP rivals  —  Former President Donald Trump said Wednesday he wants to close the Department of Education and have state governments “run the education of our children,” pushing for a long-held Republican goal that has been endorsed by several other 2024 GOP candidates.",
    "url": "https://www.cnn.com/2023/09/13/politics/trump-department-of-education-states-2024/"
  },
  {
    "text": "Alaska Rep. Mary Peltola's husband dies in plane crash  —  Rep. Mary Peltola's (D-Alaska) husband has died in a plane accident in Alaska, her chief of staff announced Wednesday.  —  “We are devastated to share that Mary's husband, Eugene Peltola Jr.—'Buzzy' to all of us who knew and loved him … ",
    "url": "https://thehill.com/homenews/house/4201929-alaska-rep-mary-peltolas-husband-dies-in-plane-crash/"
  },
  {
    "text": "Sean Penn's Crusade: Why He's Risking It All for Ukraine, Furious at Will Smith and Ready to Call Bulls— on Studios' AI Proposals  —  Summer light fades to gold in Malibu.  Surfers carve tasty waves just down the road.  A beautiful woman wanders toward the pool house.",
    "url": "https://variety.com/2023/film/features/sean-penn-slams-will-smith-slap-ai-oscars-1235720417/"
  },
  {
    "text": "She's 25, idealistic, and believes she has the formula to win North Carolina for Joe Biden  —  The state's Democratic Party chair is organizing youth and rural voters, and people have noticed: “They know she's fighting for them.”  —  Anderson Clayton, the youngest statewide party leader in the country … ",
    "url": "https://www.politico.com/news/2023/09/13/shes-25-idealistic-and-believes-she-has-the-formula-to-win-north-carolina-for-joe-biden-00114640"
  },
  {
    "text": "Rising GOP Stars Sen. Vance, Rep. Luna Named to Time ‘100 Next’ List  —  The magazine describes them as up and coming ‘populist’ stars in the Republican Party  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link … ",
    "url": "https://themessenger.com/politics/rising-gop-stars-sen-vance-rep-luna-named-to-time-100-next-list"
  }
]