[
  {
    "text": "The Prosecution of Trump May Have Terrible Consequences  —  Mr. Goldsmith served in the George W. Bush administration as an assistant attorney general and as special counsel to the general counsel of the Department of Defense.  —  It may be satisfying now to see Special Counsel Jack Smith … ",
    "url": "https://www.nytimes.com/2023/08/08/opinion/trump-indictment-cost-danger.html"
  },
  {
    "text": "Trump on possible court-ordered limits: 'They're not taking away my First Amendment rights'  —  The former president campaigned in New Hampshire called the latest charges against him “bullshit,” saying, “I will talk about it.”  —  Former President Donald Trump could soon be strapped … ",
    "url": "https://www.politico.com/news/2023/08/08/trump-on-possible-gag-order-pound-sand-00110357"
  },
  {
    "text": "Trump: Clinton's No Longer ‘Crooked,’ She's Now ‘Beautiful, Beautiful Hillary’  —  ‘I RETIRED IT’  —  During a campaign stop in New Hampshire on Tuesday, former President Donald Trump waxed poetic about how he decided to strip Hillary Clinton of his favorite nickname for her and officially bestow it upon President Joe Biden.",
    "url": "https://www.thedailybeast.com/trump-says-clintons-no-longer-crooked-shes-now-beautiful-beautiful-hillary"
  },
  {
    "text": "Georgia Grand Jury Likely to Hear Trump Case Next Week  —  The district attorney in Atlanta is expected to take the findings from an election interference investigation to a grand jury, which could issue indictments.  —  Danny Hakim reported from New York, and Richard Fausset from Atlanta.",
    "url": "https://www.nytimes.com/2023/08/08/us/trump-georgia-election-grand-jury.html"
  },
  {
    "text": "Special counsel still scrutinizing finances of Trump's PAC  —  A week after the newest indictment of the former president, Jack Smith's investigation remains ongoing.  —  Special counsel Jack Smith's probe of efforts by Donald Trump and others to subvert the 2020 election remains ongoing … ",
    "url": "https://www.politico.com/news/2023/08/08/jack-smith-donald-trump-pac-00110279"
  },
  {
    "text": "Judge sets Friday hearing for Trump protective order in election case  — A federal judge scheduled a hearing for Friday morning on prosecutors' request for a protective order in the criminal election case against former President Donald Trump.  — Judge Tanya Chutkan set the hearing … ",
    "url": "https://www.cnbc.com/2023/08/08/trump-lawyers-want-hearing-on-criminal-case-protective-order-next-week.html"
  },
  {
    "text": "Attorneys for Trump, special counsel file list of available dates for arguments over protective order in Jan. 6 case  —  The two sides disagree on the terms of a proposed protective order.  —  A day after the special counsel's office and President Donald Trump's legal team filed dueling motions regarding … ",
    "url": "https://abcnews.go.com/US/attorneys-trump-special-counsel-file-list-dates-arguments/story?id=102111262"
  },
  {
    "text": "DeSantis Replaces Campaign Manager with Florida Chief of Staff As He ‘Reloads’ (Exclusive)  —  James Uthmeier has earned the governor's trust as an always-on-offense political fixer, but he has no campaign experience  —  A Facebook icon representing an external link to share the article … ",
    "url": "https://themessenger.com/politics/desantis-new-campaign-manager-exclusive"
  },
  {
    "text": "Roberts and Barrett join liberals as Supreme Court revives federal ghost gun restrictions  —  The Supreme Court on Tuesday agreed to freeze a lower court order that bars the government from regulating so-called ghost guns - untraceable homemade weapons - as firearms under federal law.",
    "url": "https://www.cnn.com/2023/08/08/politics/supreme-court-ghost-guns/"
  },
  {
    "text": "House GOP eyes fall push for Biden impeachment inquiry  —  Speaker Kevin McCarthy has been insistent: House Republicans are still gathering evidence and have yet to decide whether to open up a formal impeachment inquiry against President Joe Biden.  —  “I didn't say I was doing an impeachment inquiry … ",
    "url": "https://www.cnn.com/2023/08/08/politics/house-republicans-impeachment-inquiry-biden/"
  },
  {
    "text": "What's at Stake in Ohio's Referendum on Amending the State Constitution  —  The vote could play a big role in the future of abortion rights in Ohio.  But it also raises questions about the power of ordinary citizens over elected politicians.  —  Ohioans will finish voting on Tuesday … ",
    "url": "https://www.nytimes.com/2023/08/08/us/ohio-referendum-constitution-abortion.html"
  },
  {
    "text": "Judge orders airline lawyers to take extremist advocacy group's “religious-liberty training”  —  U.S. District Judge Brantley Starr ordered three Southwest Airlines lawyers to take 8 hours of “instruction” from Alliance Defending Freedom as part of a contempt finding in an employment case.",
    "url": "https://www.lawdork.com/p/judge-orders-adf-religious-liberty-training"
  },
  {
    "text": "Trump mocks ‘fat pig’ Chris Christie's weight  —  The former president made fun of the former New Jersey governor and 2024 Republican nomination rival during a speech in New Hampshire.  —  MANCHESTER, N.H. — Former President Donald Trump mocked Chris Christie, one of his rivals … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-mocks-fat-pig-chris-christies-weight-rcna98859"
  },
  {
    "text": "A Simple Law Is Doing the Impossible.  It's Making the Online Porn Industry Retreat.  —  Pornhub has pulled out of multiple states rather than comply with age-verification laws.  —  On June 15, 2022, a freshman legislator in Louisiana's House of Representatives accomplished something … ",
    "url": "https://www.politico.com/news/magazine/2023/08/08/age-law-online-porn-00110148"
  },
  {
    "text": "U.K. election regulator says hackers had access for over a year but elections still secure  —  Most of the voter information that was accessed was already public, the Electoral Commission said.  —  Hackers gained access to the U.K.'s election regulator, the Electoral Commission, for more than a year, the agency said Tuesday.",
    "url": "https://www.nbcnews.com/tech/security/uk-election-regulator-says-hackers-access-year-elections-still-secure-rcna98863"
  },
  {
    "text": "Cops ID and Charge White Antagonists in Wild Alabama Dock Brawl  —  Richard Roberts, Allen Todd and Zachery Shipman will face assault charges for sparking the viral melee.  —  Alabama cops have started cracking down on the agitators who sparked a viral melee on a Montgomery, Alabama … ",
    "url": "https://www.thedailybeast.com/cops-identify-and-charge-white-antagonists-in-montgomery-dock-brawl"
  },
  {
    "text": "Top Biden labor adviser steps down  —  Celeste Drake, a top labor adviser to President Biden, has stepped down from her post, according to the White House.  —  Drake, whose last day was on Sunday, is leaving to be deputy director-general of the International Labor Organization, starting on Aug. 14, the White House said.",
    "url": "https://thehill.com/homenews/administration/4144101-top-biden-labor-adviser-steps-down/"
  },
  {
    "text": "EXCLUSIVE POLL: Trump Holds Big Lead in NH, DeSantis Drops to Tie With Christie  —  When Donald Trump returns to New Hampshire on Tuesday, he will be greeted by a Republican base that is overwhelmingly loyal to the former president.  —  How loyal?  In an exclusive new NHJournal/co-efficient poll … ",
    "url": "https://nhjournal.com/exclusive-poll-trump-holds-big-lead-in-nh-desantis-drops-to-tie-with-christie/"
  },
  {
    "text": "The GOP's meticulously laid plans for beating Jon Tester could go up in smoke  —  Rep. Matt Rosendale is moving closer to a Senate run despite some opposition from GOP leaders.  —  Top Republicans went all out to avoid a contentious primary in Montana's Senate race by urging GOP Rep. Matt Rosendale to stay in the House.",
    "url": "https://www.politico.com/news/2023/08/08/conservative-roadblock-to-ousting-tester-00110258"
  },
  {
    "text": "Exclusive: Former Coast Guard head covered up secret investigation into sexual assaults at the Coast Guard Academy  —  Tune into AC360 tonight at 8 pm ET for Chief Investigative Correspondent Pamela Brown's report.  —  CNN  —  The then-leader of the US Coast Guard covered … ",
    "url": "https://www.cnn.com/2023/08/08/politics/coast-guard-sexual-assault-coverup-invs/"
  },
  {
    "text": "Body found in barrel identified as potential witness in case of Missouri man accused of holding woman in basement  —  Jaynie Crosdale was identified as a possible witness in Timothy Haslett Jr.'s case in January.  Months later she was found dead in a blue barrel in the Missouri River.",
    "url": "https://www.nbcnews.com/news/us-news/body-found-barrel-identified-potential-witness-case-missouri-man-accus-rcna98824"
  },
  {
    "text": "Arizona 2024: Senator Kyrsten Sinema's Independent Candidacy Could Help Democrats for U.S. Senate  —  Home Polls Arizona 2024: Senator Kyrsten Sinema's Independent Candidacy Could Help Democrats for U.S. Senate  —  Trump Pulling Away From GOP Field, Independents Shifting on President Biden",
    "url": "https://emersoncollegepolling.com/arizona-2024-senator-kyrsten-sinemas-independent-candidacy-could-help-democrats-for-u-s-senate/"
  },
  {
    "text": "South Africa pushing for US ambassador Reuben Brigety's expulsion  —  An aggressive push is underway for the expulsion of Reuben Brigety, the United States ambassador who unleashed a diplomatic storm when he alleged that South Africa loaded arms on the Russian cargo ship, Lady R … ",
    "url": "https://mg.co.za/news/2023-08-08-south-africa-pushing-for-us-ambassador-reuben-brigetys-expulsion/"
  },
  {
    "text": "CNN Poll: Abortion's role as an electoral litmus test hasn't faded a year after Supreme Court decision overturning Roe  —  Americans' discontent with the Supreme Court's decision overturning Roe v. Wade remains as potent as it was a year ago, according to a new CNN poll conducted by SSRS … ",
    "url": "https://www.cnn.com/2023/08/08/politics/cnn-poll-abortion-electoral-litmus-test-supreme-court/"
  }
]