[
  {
    "text": "‘I Am Sorry’: Harvard President Gay Addresses Backlash Over Congressional Testimony on Antisemitism  —  Harvard President Claudine Gay apologized for her remarks at the end of her congressional testimony, which sparked fierce national criticism and led the leadership of Harvard Hillel … ",
    "url": "https://www.thecrimson.com/article/2023/12/8/gay-apology-congressional-remarks/"
  },
  {
    "text": "UPenn President Liz Magill under fire over her testimony on antisemitism: ‘An utter disgrace’  —  New York CNN  —  The growing chorus of donors, politicians, business leaders and other prominent figures calling for the immediate ouster of University of Pennsylvania President Liz Magill … ",
    "url": "https://www.cnn.com/2023/12/08/business/upenn-president-liz-magill-resign/"
  },
  {
    "text": "Liz Cheney says Donald Trump's ‘dictator’ remark should be taken ‘literally and seriously’  —  Cheney spoke with ABC's Jonathan Karl for “This Week.”  —  ABC “This Week” co-anchor Jonathan Karl interviews former Wyoming Congresswoman Liz Cheney.  —  Former GOP Rep. Liz Cheney … ",
    "url": "https://abcnews.go.com/Politics/liz-cheney-donald-trumps-dictator-remark-literally/story?id=105497248"
  },
  {
    "text": "What to know about Trump-appointed judge in Hunter Biden tax case  —  Mark Scarsi, a U.S. district court judge, has been assigned to the case involving a federal indictment against President Biden's son, Hunter Biden.  —  Scarsi is based in the Central District of California and oversees Los Angeles.",
    "url": "https://thehill.com/regulation/court-battles/4350050-what-to-know-trump-appointed-judge-hunter-biden-tax-case/"
  },
  {
    "text": "Inside Trump's Plot To Corrupt the 2024 Election With ‘Garbage’ Data  —  For more than a decade, election officials have relied on a system to reduce fraud and boost voter registration.  Trump's cronies are sabotaging it, state by state — and trying to replace it with something more MAGA",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-election-plans-corrupt-voter-registration-eric-eagleai-1234920083/"
  },
  {
    "text": "Bystanders Stop Woman From Burning Home Where Martin Luther King Jr. Was Born  —  Two off-duty police officers from New York and two visitors intervened.  The woman was arrested and charged with attempted arson, Atlanta police said.  —  Bystanders stopped a 26-year-old woman from setting fire … ",
    "url": "https://www.nytimes.com/2023/12/08/us/martin-luther-king-mlk-home-arson.html"
  },
  {
    "text": "RNC officially bows out of hosting primary debates  —  The organization steps aside as television networks plan more early state debates.  —  The Republican National Committee is pausing its participation in 2024 GOP primary debates, the organization decided Friday.",
    "url": "https://www.politico.com/news/2023/12/08/rnc-officially-bows-out-of-hosting-primary-debates-for-now-00130857"
  },
  {
    "text": "This Is Who Melania Trump Is Reportedly Pushing for Her Husband's VP, and It's Not Surprising  —  In less than six weeks, voting is set to start in the 2024 Republican primary, and the only top contender is former President Trump.  —  So the only question remains: who will be his vice president pick?",
    "url": "https://townhall.com/tipsheet/saraharnold/2023/12/07/this-is-the-person-melania-trump-is-reportedly-pushing-for-her-husbands-vp-and-its-not-surprising-n2632145"
  },
  {
    "text": "Nancy Mace and her entrepreneur fiancé Patrick Byrant split after 18 months - as staff quit her office and she's accused of discussing her sex life with aides  — The South Carolina lawmaker - who was one of the eight to vote out former Speaker Kevin McCarthy - split with her fiancé last month",
    "url": "https://www.dailymail.co.uk/news/article-12833527/nancy-mace-fiance-break-charleston-south-carolina.html"
  },
  {
    "text": "Trump PAC paid for expert witness testimony in N.Y. civil fraud trial  —  Eli Bartov, an accounting professor at New York University, said that his $900K in expert witness fees were paid by the Trump Organization and Trump's Save America PAC.  —  An expert witness in the $250 million civil fraud trial … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-pac-paid-expert-witness-testimony-ny-civil-fraud-trial-rcna128804"
  },
  {
    "text": "GOP's Brutal Math: Trump Could Secure Nomination Before Conviction  —  Looking at the primary schedule, Republicans see the party handcuffing itself to a candidate on the verge of politically toxic criminal convictions. … ‘People need to wake up’  —  There's a scenario many Republicans are dreading … ",
    "url": "https://www.thedailybeast.com/gops-brutal-math-donald-trump-could-secure-2024-nomination-before-criminal-conviction"
  },
  {
    "text": "As More ‘Fake Electors’ Face Charges, a Key Witness Emerges  —  Kenneth Chesebro, an architect of the plan to deploy people claiming to be Trump electors in states won by President Biden, is cooperating with inquiries in Michigan, Arizona and Nevada.  —  Twenty-four of the so-called fake Trump electors … ",
    "url": "https://www.nytimes.com/2023/12/08/us/politics/chesebro-fake-electors-trump.html"
  },
  {
    "text": "Federal judge bars separating migrant families for 8 years  —  A federal judge on Friday blocked the federal government from separating families solely as part of border enforcement policy for the next eight years, stopping any potential return to the short-lived zero tolerance policy of 2018.",
    "url": "https://thehill.com/regulation/court-battles/4350827-judge-bars-separating-migrant-families-8-years/"
  },
  {
    "text": "Appeals court largely upholds Trump gag order in federal election interference case  —  Trump is prohibited from making public statements about potential witnesses.  —  Former President Donald Trump speaks during a Commit to Caucus rally, Dec. 2, 2023, in Ankeny, Iowa.",
    "url": "https://abcnews.go.com/US/appeals-court-largely-upholds-trump-gag-order-federal/story?id=105503790"
  },
  {
    "text": "Retail Group Retracts Startling Claim About ‘Organized’ Shoplifting  —  The National Retail Federation had said that nearly half of the industry's $94.5 billion in missing merchandise in 2021 was the result of organized theft.  It was likely closer to 5 percent.",
    "url": "https://www.nytimes.com/2023/12/08/business/organized-shoplifting-retail-crime-theft-retraction.html"
  },
  {
    "text": "Casey DeSantis causes Iowa caucus confusion with call to descend on state  —  Casey DeSantis, the wife of Gov. Ron DeSantis (R-FL), briefly caused confusion on Friday when she appeared to call for supporters of her husband across the country to descend on Iowa and seemingly take part in the Iowa caucuses in January.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/casey-desantis-causes-confusion-over-iowa-caucus"
  },
  {
    "text": "1 in 5 young Americans think Holocaust was a myth  —  A fifth of Americans ages 18-29 believe the Holocaust was a myth, according to a new poll from The Economist/YouGov.  —  While the question only surveyed a small sample of about 200 people, it lends credence to concerns about rising antisemitism … ",
    "url": "https://thehill.com/homenews/education/4349815-poll-americans-holocaust-myth/"
  },
  {
    "text": "Massachusetts Finally Cracks Down on Notorious New England Neo-Nazis  —  After years of intimidating the public with impunity, NSC-131 will be brought to court for alleged “violent and unlawful conduct.” … The 26-page, five-charge complaint is the most aggressive effort yet to blunt … ",
    "url": "https://www.rollingstone.com/politics/politics-news/nsc-131-neo-nazi-charged-civil-rights-violations-1234921860/"
  },
  {
    "text": "Dominion wins access to Newsmax journalists' texts in its defamation case  —  The ruling is a blow to the conservative news organization, which said in filings that it had avoided such a mandate in a similar case.  —  Dominion Voting Systems is entitled to review personal communications … ",
    "url": "https://www.nbcnews.com/media/dominion-wins-access-newsmax-journalists-texts-defamation-case-rcna128179"
  },
  {
    "text": "FDA approves 2 new gene therapies for sickle cell disease, a ‘functional cure’ for many patients  —  Sickle cell disease is a genetic condition affecting at least 100,000 Americans.  —  Research for sickle cell disease.  —  The U.S. Food and Drug Administration (FDA) … ",
    "url": "https://abcnews.go.com/Health/fda-approves-new-gene-therapies-sickle-cell-disease/story?id=105482870"
  }
]