[
  {
    "text": "Here's What SCOTUS Should Do With the Trump Ballot Cases  —  The real answer is nothing.  But if they decide to take them up, here is how they should decide them. … The U.S. Supreme Court needs to understand that the disqualification of former President Donald J. Trump under Section 3 … ",
    "url": "https://www.thedailybeast.com/heres-what-scotus-should-do-with-the-trump-ballot-cases"
  },
  {
    "text": "Trump's GOP Delegate Hunt Doubles as Legal Strategy in Jan. 6 Case.  And Beyond.  —  In the mind of Donald Trump's presidential campaign, the primary polls and history don't lie: he'll be the Republican nominee, and all his major primary rivals will likely drop out after he wins all four early states.",
    "url": "https://themessenger.com/news/what-jan-6-and-trumps-convention-delegate-strategy-have-in-common"
  },
  {
    "text": "Tom Wilkinson: The Full Monty actor dies at 75  —  British actor Tom Wilkinson, known for films like The Full Monty, Shakespeare In Love and The Best Exotic Marigold Hotel, has died aged 75.  —  Wilkinson won a Bafta for 1997's The Full Monty, and reprised the role of Gerald … ",
    "url": "https://www.bbc.com/news/entertainment-arts-65823240"
  },
  {
    "text": "Paula Abdul accuses ‘American Idol’ executive producer Nigel Lythgoe of sexual assault in new lawsuit  —  The Grammy-winning singer said the assaults happened in the early 2000s and around 2015 while she was a judge on the television competition shows.  —  Paula Abdul accused “American Idol” … ",
    "url": "https://www.nbcnews.com/news/us-news/paula-abdul-accuses-american-idol-executive-producer-nigel-lythgoe-sex-rcna131677"
  },
  {
    "text": "USA Boxing to allow transgender women to compete against female boxers under certain conditions from 2024 after introducing new policy  — USA Boxing has introduced a ‘Transgender Policy’ to its rule book for 2024  — Transgender boxers will be permitted to fight in the category of their choice",
    "url": "https://www.dailymail.co.uk/sport/boxing/article-12912389/USA-Boxing-transgender-women-compete-female-boxers-2024-policy.html"
  },
  {
    "text": "Marjorie Taylor Greene creates multiple headaches for new Speaker  —  Rep. Marjorie Taylor Greene (R-Ga.) is reviving her rabble-rousing ways, creating new headaches for Speaker Mike Johnson (R-La.) as he settles into his role leading the House GOP conference's razor-thin majority.",
    "url": "https://thehill.com/homenews/house/4380641-marjorie-taylor-greene-speaker-mike-johnson/"
  },
  {
    "text": "December 29, 2023  —  When asked at a town hall on Wednesday to identify the cause of the United States Civil War, presidential candidate and former governor of South Carolina Nikki Haley answered that the cause “was basically how government was going to run, the freedoms … ",
    "url": "https://heathercoxrichardson.substack.com/p/december-29-2023"
  },
  {
    "text": "6 states are rethinking how they run their primaries in 2024  —  Most of the states considering changing their primary election systems are looking at ways to open the process to more voters.  —  At least six states are considering changing their primary election systems in 2024 … ",
    "url": "https://www.nbcnews.com/politics/2024-election/states-considering-primary-election-changes-2024-rcna129736"
  },
  {
    "text": "Biden's Crime Problem: Violent Crime is Down, but Voters Don't Believe it  —  Americans perceive crime as a major problem, even as data shows crime falling in most cities nationwide  —  Violent crime is dropping in most major American cities, but voters nationwide still think crime is on the rise.",
    "url": "https://themessenger.com/politics/bidens-crime-problem-violent-crime-is-down-but-voters-dont-believe-it"
  },
  {
    "text": "Muslim leaders expand campaign to abandon Biden in 2024 over Israel-Hamas war  — A coalition of Muslim leaders in the U.S. is expanding its pressure campaign to dissuade voters from reelecting President Joe Biden due to his failure to call for a cease-fire in Gaza.",
    "url": "https://www.cnbc.com/2023/12/30/muslim-leaders-expand-campaign-to-abandon-biden-over-israel-hamas-war.html"
  },
  {
    "text": "Where Was the Israeli Military?  —  A Times investigation found that troops were disorganized, out of position and relied on social media to choose targets.  Behind the failure: Israel had no battle plan for a massive Hamas invasion.  —  Far beneath the Israeli military headquarters in Tel Aviv … ",
    "url": "https://www.nytimes.com/2023/12/30/world/middleeast/israeli-military-hamas-failures.html"
  },
  {
    "text": "Bankrupt ex-Mayor Rudy Giuliani regrets not having a NYC pension  —  Former Mayor Rudy Giuliani, who filed for bankruptcy in the wake of a $148 million civil court ruling and faces a mountain of unpaid legal bills, said he now regrets not having the safety net of a government pension.",
    "url": "https://nypost.com/2023/12/30/metro/bankrupt-rudy-giuliani-regrets-not-having-nyc-pension/"
  },
  {
    "text": "When Silicon Valley's AI warriors came to Washington  —  Effective altruism is increasingly described as a cult.  But as the movement's billionaire adherents pour money into D.C., its obsession with the AI apocalypse is remaking the capital's tech policy landscape.",
    "url": "https://www.politico.com/news/2023/12/30/ai-debate-culture-clash-dc-silicon-valley-00133323"
  },
  {
    "text": "Trump Claims Migrants Are Coming to US to ‘VOTE, VOTE, VOTE’ for Democrats  —  Trump's latest attack follows his inflammatory claims that immigrants are ‘poisoning the blood’ of the nation  —  Former President Donald Trump claimed in a Truth Social post that droves of migrants are crossing … ",
    "url": "https://themessenger.com/politics/trump-claims-migrants-are-coming-to-us-to-vote-vote-vote-for-democrats"
  }
]