[
  {
    "text": "In Huge Reversal, GOP Poised To Kill The Border-Ukraine Package It Demanded  —  Republican Sen. James Lankford, who spent months negotiating the border provisions the GOP demanded, said he may vote against his own bill this week.  —  LOADING  —  WASHINGTON ― Senate Republicans … ",
    "url": "https://www.huffpost.com/entry/border-deal-republicans-ukraine_n_65c18950e4b093b2e780ac30"
  },
  {
    "text": "Border-for-Ukraine deal on life support as GOP opposition mounts  —  House speaker calls it ‘DEAD’ while GOP senators start to defect en masse ahead of Wednesday vote  —  A bipartisan package of border reforms and funding for Ukraine and Israel appeared close to collapse on Monday … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/05/republican-opposition-mounts-border-for-ukraine-deal/"
  },
  {
    "text": "Democrats are trying to pass a right-wing border bill, but the GOP won't let them  —  Senate negotiations revealed what some Democrats are willing to give up on immigration in 2024.  —  A bipartisan group of Senate negotiators has reached a $118 billion deal that trades sweeping border security measures … ",
    "url": "https://www.vox.com/politics/2024/2/5/24062710/senate-immigration-bill-border-security-ukraine-2024"
  },
  {
    "text": "The immigration “compromise”  —  On Sunday, a group of Senators — James Lankford (R-OK), Chris Murphy (D-CT), and Kyrsten Sinema (I-AZ) — announced that they had reached a bipartisan “compromise” on a bill to overhaul the nation's immigration system and provide more funding for wars in Ukraine and Gaza.",
    "url": "https://popular.info/p/the-immigration-compromise"
  },
  {
    "text": "Playbook: ‘Everything is dead’  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  JUST POSTED — “Is Antony Blinken Too Nice to be Secretary of State?” by Nahal Toosi: “The secretary of State has shown ... quiet fury in private these last few months … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/06/everything-is-dead-00139805"
  },
  {
    "text": "Trump Now Falsely Claims He Didn't Endorse Immigration Bill Co-Author  —  Oklahoma Senator James Lankford, who helped draw up the immigration bill that Trump hates, received Trump's “Complete and Total Endorsement” in 2022.  —  Donald Trump said during an interview Monday that he did not endorse … ",
    "url": "https://www.thedailybeast.com/trump-now-falsely-claims-he-didnt-endorse-immigration-bill-co-author-james-lankford"
  },
  {
    "text": "Our border deal whip count: It's halfway to getting blocked  —  Presented by With assists from POLITICO's Congress team  —  MAKE OR BREAK TIME FOR BORDER DEAL  —  Senate negotiators have two days to get to 60 votes on their $118 billion-plus proposal to pair major immigration policy changes with aid to Ukraine and Israel.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/02/05/our-border-deal-whip-count-its-halfway-to-getting-blocked-00139736"
  },
  {
    "text": "Nikki Haley Asks for Secret Service Protection After Increase in Threats  —  Former South Carolina governor is final hurdle between Trump and the Republican presidential nomination  —  AIKEN, S. C.—Republican presidential candidate Nikki Haley has applied for Secret Service protection … ",
    "url": "https://www.wsj.com/politics/elections/nikki-haley-asks-for-secret-service-protection-after-increase-in-threats-05b67a22?mod=followamazon"
  },
  {
    "text": "King Charles III diagnosed with cancer, Buckingham Palace says  —  King Charles has been diagnosed with a form of cancer, says Buckingham Palace.  —  The type of cancer has not been revealed - it is not prostate cancer, but was discovered during his recent treatment for an enlarged prostate.",
    "url": "https://www.bbc.com/news/uk-68208157"
  },
  {
    "text": "Lauren Boebert abandoned her district and voters are rejoicing  —  By Sheila Flynn headed to Western Colorado to interview Boebert constituents about the congresswoman's post-Beetlejuice district swap — and the candidates running to claim her seat  —  The latest headlines from our reporters across … ",
    "url": "https://www.independent.co.uk/news/world/americas/lauren-boebert-colorado-republican-election-democrat-frisch-b2490943.html"
  },
  {
    "text": "Biden appears to mix up Macron with French president Mitterrand, who died in 1996  —  President Biden on Sunday appeared to mix up French President Emmanuel Macron with Francois Mitterrand, the former president of France who died in 1996.  —  The apparent mix-up took place during … ",
    "url": "https://thehill.com/homenews/administration/4449805-biden-appears-to-mix-up-macron-with-french-president-mitterrand-who-died-in-1996/"
  },
  {
    "text": "Why Jack Smith wants to ‘clear the air’ in the classified documents case  —  Donald Trump “paints an inaccurate and distorted picture of events,” the special counsel tells Judge Aileen Cannon.  Will she care?  —  Though the classified documents case is playing out partly behind closed doors … ",
    "url": "https://www.msnbc.com/deadline-white-house/deadline-legal-blog/trump-classified-documents-case-jack-smith-filing-rcna137310"
  },
  {
    "text": "Chutkan contemplates Trump trial extending deep into 2024, as case remains in limbo  —  It was the judge's first acknowledgment that Trump's federal trial could could extend into the general election.  —  The judge presiding over Donald Trump's Washington, D.C. criminal case acknowledged Monday … ",
    "url": "https://www.politico.com/news/2024/02/05/chutkan-trump-trial-date-2024-00139665"
  },
  {
    "text": "House Dem Brutally Hits Back at Marjorie Taylor Greene's Gross Bathroom Claim  —  The MAGA lawmaker was seemingly upset about Rep. Jim McGovern likening her to a clown.  —  A House Democrat got into a wild war of words with Rep. Marjorie Taylor Greene on Monday involving mutual accusations … ",
    "url": "https://www.thedailybeast.com/house-dem-brutally-hits-back-at-marjorie-taylor-greenes-gross-bathroom-claim"
  },
  {
    "text": "Look who moved in Nextdoor: another spying, suspicious, paranoid snoop  —  Are you bummed you weren't around when the Stasi ruled?  Do you wish you could've been one of Mao Zedong's millions of neighborhood snitches?  Maybe watch the Red Guards drag off your least favorite aunt?",
    "url": "https://www.washingtonpost.com/opinions/2024/02/05/nextdoor-suspicious-neighbors/"
  },
  {
    "text": "Scientists Use Sea Sponges to Study Global Warming Back to 1700  —  Research on a long-lived but rarely seen species in the Caribbean is helping scientists piece together a revised history of climate change.  —  Since the dawn of the industrial age, our species has warmed the planet … ",
    "url": "https://www.nytimes.com/2024/02/05/climate/global-warming-sponges.html"
  },
  {
    "text": "Larry David Breaks Georgia's Voting Law in ‘Curb Your Enthusiasm’  —  Comedy's crankiest star usually breaks social norms.  This time, he ran afoul of voting legislation passed in Georgia in 2021.  —  Television comedies like “Veep” and “Parks and Recreation” have long poked fun … ",
    "url": "https://www.nytimes.com/2024/02/05/us/politics/larry-david-curb-your-enthusiasm-georgia-voting.html"
  },
  {
    "text": "It's Not Just the Border: The Trump-Abbott-Republican Nullification Crisis Is Here  —  Not since the meek accountant in the back of the courtroom leapt up and screamed, “Stop, Perry Mason!  I did it!  I killed him, and I'm GLAD!” has a suspect been quite so eager to confess his crimes as Donald J. Trump.",
    "url": "https://washingtonmonthly.com/2024/02/05/its-not-just-the-border-the-trump-abbott-republican-nullification-crisis-is-here/"
  }
]