[
  {
    "text": "The Self-Immolation of the AZ GOP  —  Inflation is still running a little hot, according to the Department of Labor.  Overall inflation was at 3.5 percent year-over-year, with more stable “core” inflation at 3.8 percent.  While it's moving in the right direction, it's not returning … ",
    "url": "https://www.thebulwark.com/p/the-self-immolation-of-the-az-gop"
  },
  {
    "text": "Arizona Republicans condemn their own abortion policy  —  On Tuesday, the Arizona Supreme Court issued a bombshell decision banning virtually all abortions in the state.  The majority found that since the Supreme Court overturned Roe v. Wade, a near-total ban from 1864 — before Arizona was a state — was back in effect.",
    "url": "https://popular.info/p/arizona-republicans-condemn-their"
  },
  {
    "text": "Trump's telling comment on punishing doctors who provide abortions  —  The Republican Party needs leadership on abortion.  Trump is so frightened of it that he's liable to just create more problems.  —  Back in 2022, when it looked as if the Supreme Court would soon overturn Roe v. Wade … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/10/trumps-telling-comment-punishing-doctors-who-provide-abortions/"
  },
  {
    "text": "Abortion ruling is a full-on disaster for Arizona Republicans  —  Opinion: With the return of an 1864 abortion ban, Republicans now face a five-alarm fire that could consume their grip on Arizona.  If you are Trump or Kari Lake, you are freaking out right now.",
    "url": "https://www.azcentral.com/story/opinion/op-ed/laurieroberts/2024/04/09/abortion-ruling-disaster-arizona-republicans/73263944007/"
  },
  {
    "text": "O.J. Simpson, Athlete Whose Trial Riveted the Nation, Dies at 76  —  He ran to football fame on the field and made fortunes in movies.  Then a trial in which he was charged with killing his former wife and her friend changed everything.  —  O.J. Simpson, who ran to fame on the football field … ",
    "url": "https://www.nytimes.com/2024/04/11/sports/oj-simpson-dead.html"
  },
  {
    "text": "OJ Simpson dies at 76, family says  —  O.J. Simpson, the famed football player who was acquitted of murdering his ex-wife and her friend in a case that became a media sensation and was called the “trial of the century,” has reportedly died.  —  The 76-year-old former Buffalo Bills star … ",
    "url": "https://thehill.com/blogs/in-the-know/4588140-oj-simpson-dies-76-family/"
  },
  {
    "text": "Florida 2024 Poll: Plurality Plan to Vote “Yes” on Abortion Protection Ballot Measure  —  A new Emerson College Polling survey in Florida finds 42% of voters plan to vote yes on the November ballot measure that will provide a constitutional right to abortion before fetal viability, 32% are unsure, and 25% will vote no.",
    "url": "https://emersoncollegepolling.com/florida-2024-poll-plurality-plan-to-vote-yes-on-abortion-protection-ballot-measure/"
  },
  {
    "text": "How Voters Describe the 2024 Election in One Word … A voter casts a ballot in Southfield, Mich., during the state's presidential primary in February.Emily Elconin for The New York Times  —  It's no secret that many voters are not looking forward to the election in November.",
    "url": "https://www.nytimes.com/2024/04/11/us/elections/poll-voters-election-biden-trump.html"
  },
  {
    "text": "Matt Gaetz Is Winning  —  Usually, you need about 10 minutes to walk from the Rayburn House Office Building to the House Chamber.  But if you're running from a reporter, it'll only take you five.  —  When Matt Gaetz spotted me outside his office door one afternoon early last November … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/matt-gaetz-house-republican-congress-profile/677915/"
  },
  {
    "text": "Biden Administration Is Closing the ‘Gun Show Loophole’  —  HOLSTERED  —  People selling firearms at gun shows and elsewhere will now be required to carry out background checks on their customers.  —  The Biden administration on Thursday announced that it is moving to close … ",
    "url": "https://www.thedailybeast.com/biden-administration-is-closing-the-gun-show-loophole"
  },
  {
    "text": "Wisconsin Supreme Court liberal won't run again, shaking up race for control  —  The retirement of Justice Ann Walsh Bradley improves conservatives' chances of retaking the majority after losing it last year in the most expensive judicial contest in U.S. history.",
    "url": "https://www.washingtonpost.com/politics/2024/04/11/wisconsin-supreme-court-justice-reelection/"
  },
  {
    "text": "Truong My Lan: Vietnamese billionaire sentenced to death for $44bn fraud  —  Truong My Lan is accused of looting one of Vietnam's largest banks over a period of 11 years  —  It was the most spectacular trial ever held in Vietnam, befitting one of the greatest bank frauds the world has ever seen.",
    "url": "https://www.bbc.com/news/world-asia-68778636"
  },
  {
    "text": "Harvard, 12 other schools get failing grades on ADL campus antisemitism evaluation  —  Harvard University, Tufts University, the Massachusetts Institute of Technology (MIT) and 10 other schools received failing grades for their policies on antisemitism prevention, according to an assessment from the Anti-Defamation League (ADL).",
    "url": "https://thehill.com/homenews/education/4587901-harvard-tufts-mit-failing-grades-adl-campus-antisemitism/"
  },
  {
    "text": "Bankruptcy documents detail how GOP NC governor nominee Mark Robinson failed to file federal income taxes for 5 years  —  Mark Robinson claims Democrats have caused the “death” of “responsibility.”  —  North Carolina Lieutenant Governor Mark Robinson, whom Republican presidential candidate … ",
    "url": "https://abcnews.go.com/US/bankruptcy-documents-detail-gop-nc-governor-nominee-mark/story?id=108763847"
  },
  {
    "text": "The Trump donor whom Biden can't fire is running the U.S. Postal Service directly into the ground—just what everyone warned about when he was confirmed during the pandemic  —  Technology has afforded us the ability to connect with nearly anyone, anytime—and free of charge.",
    "url": "https://fortune.com/2024/04/10/usps-dejoy-price-hikes-customer-dissatisfaction/"
  },
  {
    "text": "Georgia's Lieutenant Governor to Face Inquiry for Role as Fake Trump Elector  —  Fani T. Willis, the district attorney of Fulton County, Ga., had been disqualified from pursuing the case against Lt. Gov. Burt Jones, but another prosecutor said he would now take it over.",
    "url": "https://www.nytimes.com/2024/04/11/us/burt-jones-trump-georgia.html"
  },
  {
    "text": "‘Please leave!’  A Jewish UC Berkeley dean confronts pro-Palestinian activist at his home  —  Altercation between pro-Palestinian protestor and law professor at UC Berkeley law school dean's home  —  What was supposed to be a celebratory dinner at a dean's home for graduating UC Berkeley law students … ",
    "url": "https://www.latimes.com/california/story/2024-04-10/uc-berkeley-law-school-dean-clashes-with-pro-palestinian-activists"
  },
  {
    "text": "FBI chief to share concerns of organized attack in US after Russia massacre  —  FBI Director Christopher Wray plans to warn Congress on Thursday that intelligence officials are increasingly concerned about the possibility of an ISIS-K attack on U.S. soil, similar to the massacre carried out last month at a Russia concert hall.",
    "url": "https://thehill.com/homenews/house/4588342-fbi-wray-isis-k-attack-us-russia-massacre/"
  },
  {
    "text": "Florida's Anti-Trans Bathroom Law Spurs Harrowing Vigilante Attacks  —  ‘THAT FEAR IS REAL’  —  A new law in Florida aimed at trans people accessing bathroom facilities owned by the state government is reportedly encouraging vigilantes to patrol private businesses too.",
    "url": "https://www.thedailybeast.com/floridas-anti-trans-bathroom-law-spurs-harrowing-vigilante-attacks"
  },
  {
    "text": "Biden Loses Support Among Black Men, WSJ Poll Finds  —  New survey of seven battleground states also shows some Black women are weighing other options",
    "url": "https://www.wsj.com/politics/elections/biden-trump-black-men-support-election-2024-poll-a7d9da22"
  },
  {
    "text": "Before He Died in Prison, Aleksei Navalny Wrote a Memoir.  It's Coming This Fall.  —  In the book, Navalny tells his story in his own words, chronicling his life, his rise as an opposition leader, and the attempts on his life.  —  During the years leading up to his death in a Russian prison … ",
    "url": "https://www.nytimes.com/2024/04/11/books/booksupdate/aleksei-navalny-memoir.html"
  }
]