[
  {
    "text": "A $1 Trillion Medicaid Cut Is THIS Close to Happening.  Here's What It'd Look Like.  —  ENID RODRIGUEZ KNOWS WHAT A DIFFERENCE Medicaid can make, because it's made a huge difference for her.  —  Rodriguez, 51, has been working for pretty much her entire life—first in organizations … ",
    "url": "https://www.thebulwark.com/p/medicaid-cuts-republicans-severing-lifeline-north-carolina"
  },
  {
    "text": "How the G.O.P. Bill Saves Money: Paperwork, Paperwork, Paperwork  —  Instead of directly reducing benefits for the poor, Republicans are making them harder to get and to keep.  —  Low-income Americans would lose health coverage and government food assistance on an unprecedented scale under … ",
    "url": "https://www.nytimes.com/2025/06/29/upshot/republicans-medicaid-cuts-paperwork.html?unlocked_article_code=1.Sk8.42Eb.FOClm95vHJAO&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Trump megabill narrowly advances in Senate despite two GOP defections  —  Senate Republicans on Saturday narrowly voted to advance a sprawling 1,000-page bill to enact President Trump's agenda, despite the opposition of two GOP lawmakers.  —  The vote was 51-49.",
    "url": "https://thehill.com/homenews/senate/5375328-trump-megabill-senate-vote/"
  },
  {
    "text": "Trump goes scorched earth on Thom Tillis over “big, beautiful bill”  —  President Trump says he'll meet with potential GOP primary challengers to Sen. Thom Tillis after the North Carolina Republican voted Saturday against advancing the “big, beautiful bill.”",
    "url": "https://www.axios.com/2025/06/29/trump-thom-tillis-primary-north-carolina"
  },
  {
    "text": "Iran could restart enriching uranium in months, says nuclear watchdog chief  —  Comments by IAEA's Rafael Grossi follow week of conflicting claims about damage done by US and Israeli strikes  —  Iran could be able to start producing enriched uranium again “in a matter of months” … ",
    "url": "https://www.ft.com/content/b639c6ab-49ac-438c-9a3c-dfda75b2f4dd"
  },
  {
    "text": "Star witness against Kilmar Abrego García was due to be deported.  Now he's being freed.  —  Jose Ramon Hernandez Reyes is a three-time felon who has been released early from federal prison to a halfway house in exchange for his cooperation in the case.",
    "url": "https://www.washingtonpost.com/immigration/2025/06/28/star-witness-against-kilmar-abrego-garca-was-due-be-deported-now-hes-being-freed/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxMDgzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyNDY1NTk5LCJpYXQiOjE3NTEwODMyMDAsImp0aSI6ImVkZTBmMDcyLWEyOTEtNGU5Zi04NGIwLWY5YzdiZGYwMmQxYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA2LzI4L3N0YXItd2l0bmVzcy1hZ2FpbnN0LWtpbG1hci1hYnJlZ28tZ2FyY2Etd2FzLWR1ZS1iZS1kZXBvcnRlZC1ub3ctaGVzLWJlaW5nLWZyZWVkLyJ9._Nch735ocr9BypFYB3Xw3tJUhhZe5g2iCY6LIT4QPPA&itid=gfta"
  },
  {
    "text": "Estimated Budgetary Effects of an Amendment in the Nature of a Substitute to H.R. 1, the One Big Beautiful Bill Act, Relative to the Budget Enforcement Baseline for Consideration in the Senate  —  As posted on the website of the Senate Committee on the Budget on June 27, 2025",
    "url": "https://www.cbo.gov/publication/61533"
  },
  {
    "text": "Last night just before midnight, Republicans released their new version of the omnibus budget reconciliation bill.  It is a sign of just how unpopular this bill is that they released the new version just before midnight on a Friday night, a time that is the graveyard of news stories.",
    "url": "https://heathercoxrichardson.substack.com/p/june-28-2025"
  },
  {
    "text": "Tim Walz eulogizes slain lawmaker as a historic Minnesotan — and friend  —  Minnesota Gov. Tim Walz sat in a front pew during Melissa and Mark Hortman's funeral alongside former president Joe Biden and former vice president Kamala Harris.  —  Scores of mourners tearfully bid farewell … ",
    "url": "https://www.washingtonpost.com/nation/2025/06/28/melissa-hortman-minnesota-funeral-boetler/"
  },
  {
    "text": "To fight Trump's funding freezes, states try a new gambit: Withholding federal payments  —  The novel and untested approach has been introduced by Democratic lawmakers in at least four states.  —  Democratic legislators mostly in blue states are attempting to fight back against President … ",
    "url": "https://www.nbcnews.com/politics/politics-news/trumps-funding-freezes-states-new-gambit-withholding-federal-money-rcna215212"
  },
  {
    "text": "Louisiana hospitals warn Mike Johnson of ‘devastation’ from megabill  —  Every major health system in Louisiana is warning Speaker Mike Johnson and the rest of the state's congressional delegation that the Senate GOP's planned Medicaid cuts “would be historic in their devastation.”",
    "url": "https://www.politico.com/live-updates/2025/06/28/congress/louisiana-hospitals-warn-mike-johnson-of-devastation-from-megabill-00431385"
  },
  {
    "text": "Inside the fallout at Paul, Weiss after the firm's deal with Trump  —  Firm chair Brad Karp said he struck a deal with the White House to save his business.  But in the weeks since, the firm has lost some high-profile talent.  —  Three months ago, Paul, Weiss, Rifkind, Wharton & Garrison was under attack.",
    "url": "https://www.politico.com/news/2025/06/29/paul-weiss-brad-karp-trump-fallout-00420354"
  },
  {
    "text": "Appeals Court to Consider Trump's Use of Alien Enemies Act  —  The case before one of the most conservative courts in the country is likely to be the first to reach the Supreme Court.  —  It is one of President Trump's most contentious assertions of executive authority: a proclamation … ",
    "url": "https://www.nytimes.com/2025/06/29/us/politics/appeal-trump-alien-enemies-act.html"
  },
  {
    "text": "US sees spate of arrests of civilians impersonating Ice officers  —  Experts say trend of agents detaining people while masking and wearing plainclothes increases risk  —  Police in southern California arrested a man suspected of posing as a federal immigration officer this week … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/28/civilians-impersonating-ice-officers"
  },
  {
    "text": "The Trump administration is building a national citizenship data system  —  The Trump administration has, for the first time ever, built a searchable national citizenship data system.  —  The tool, which is being rolled out in phases, is designed to be used by state and local election officials … ",
    "url": "https://www.npr.org/2025/06/29/nx-s1-5409608/citizenship-trump-privacy-voting-database"
  },
  {
    "text": "The Improbable Rise of Zohran Mamdani  —  The presumptive Democratic nominee for New York mayor emerged from a world of privilege with radical politics and charm to spare.  —  As a high school junior, Zohran Mamdani promised free juice for students in his campaign for class vice president.  He lost.",
    "url": "https://www.wsj.com/us-news/zohran-mamdani-democratic-nyc-mayor-primary-4b2ce2f1?st=N9Gvp7&reflink=article_copyURL_share"
  },
  {
    "text": "Trump's pro-Bibi pressure campaign … Trump's unprecedented intervention appeared to tie the security of 10 million Israelis to the criminal prosecution of one man.  — Trump's Truth Social post — in which he claimed the “political witch hunt” would interfere with negotiations with Iran and Hamas … ",
    "url": "https://www.axios.com/2025/06/29/trump-netanyahu-trial-israel-iran-hamas"
  }
]