[
  {
    "text": "Statement from President Joe Biden on Shooting at Abundant Life Christian School in Wisconsin  —  Today, families in Madison, Wisconsin, are grieving the loss of those who were killed and wounded at Abundant Life Christian School.  It's shocking and unconscionable.  —  We need Congress to act.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/16/statement-from-president-joe-biden-on-shooting-at-abundant-life-christian-school-in-wisconsin/"
  },
  {
    "text": "Here's the latest on the shooting.  —  A teenage student opened fire at a Christian school in Madison, Wis., on Monday, killing another student and a teacher, the authorities said.  At least six other people were injured in the shooting at the school, Abundant Life, where the youngest students fled … ",
    "url": "https://www.nytimes.com/live/2024/12/16/us/abundant-life-school-shooting-wi"
  },
  {
    "text": "Judge Denies Trump's Bid to Throw Out Conviction Over Immunity Ruling  —  Justice Juan M. Merchan thwarted one of several attempts by Donald J. Trump to clear his record of 34 felonies before returning to the White House.  —  A judge on Monday rejected Donald J. Trump's argument … ",
    "url": "https://www.nytimes.com/2024/12/16/nyregion/trump-immunity-criminal-case.html"
  },
  {
    "text": "Judge rejects Trump request to toss Bragg charges in New York on basis of presidential immunity  —  Judge Merchan has not yet ruled on Trump's motion to dismiss the charges altogether  —  Judge Juan Merchan on Monday rejected Trump attorneys' request to dismiss charges brought … ",
    "url": "https://www.foxnews.com/politics/judge-rejects-trump-request-toss-bragg-charges-new-york-basis-presidential-immunity"
  },
  {
    "text": "The toxic nature of “debate me, bro” culture  —  Dan Dezner has a good blog about how even if the resistance to things like RFK Jr.'s war on vaccines is able to mostly hold the line — far from a guarantee in itself — there is a huge opportunity cost to pretending there is any legitimate … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/12/the-toxic-nature-of-debate-me-bro-culture"
  },
  {
    "text": "Why ABC News settled with Donald Trump for $15 million  —  George Stephanopoulos ended Sunday's “This Week” program without any mention of him or ABC News settling Donald Trump's defamation lawsuit against them.  The suit was triggered by a segment on “This Week,” but ABC News has not reported … ",
    "url": "https://www.cnn.com/2024/12/16/media/george-stephanopoulos-trump-settlement-abc"
  },
  {
    "text": "Questions ABC News Should Answer Following the $16 Million Trump Settlement … As someone who practiced press law for more than twenty years, and served as a senior executive of news organizations for just as long, I was shocked by the decision of ABC News last week to pay $16 million … ",
    "url": "https://www.cjr.org/business_of_news/questions-abc-news-should-answer-16-million-trump-settlement.php"
  },
  {
    "text": "A low, low point for ABC News  —  ABC News not only settled a defamation suit with Trump.  It paid out $15 million.  What?",
    "url": "https://www.washingtonpost.com/opinions/2024/12/16/abc-news-trump-settlement-stephanopoulos/"
  },
  {
    "text": "AOC loses key vote in House Oversight race to Gerry Connolly … - The House Democratic caucus still has to vote on whether to accept the recommendation - though that ratification is rarely denied.",
    "url": "https://www.axios.com/2024/12/16/aoc-house-steering-committee-oversight-connolly"
  },
  {
    "text": "Trump sues Des Moines Register, top pollster for ‘brazen election interference,’ fraud over Harris poll  —  FIRST ON FOX: President-elect Donald Trump is suing the Des Moines Register and its top pollster J. Ann Selzer for “brazen election interference” and fraud over its final 2024 presidential … ",
    "url": "https://www.foxnews.com/politics/trump-sues-des-moines-register-top-pollster-brazen-election-interference-fraud-over-harris-poll"
  },
  {
    "text": "Trump's Retribution Tour Begins  —  On Monday evening, Trump sued Ann Selzer, the respected pollster who incorrectly predicted a Harris victory in Iowa.  Is he looking for compensation over damages or simply firing a warning shot to the industry ahead of his next term?",
    "url": "https://puck.news/trump-sues-iowa-pollster-ann-selzer-for-being-wrong/"
  },
  {
    "text": "Another Federal Judge Reverses Decision To Retire, Ruins Trump's Plans To Fill His Seat  —  U.S. appeals court judge James Wynn, an Obama appointee, is the third judge to change his mind about retiring since Trump won reelection.  —  LOADING  —  WASHINGTON — For the third time since Donald Trump won … ",
    "url": "https://www.huffpost.com/entry/federal-judges-reverse-decision-retire-trump_n_67604bbbe4b000ebe4d6501a"
  },
  {
    "text": "Meddling for MAGA  —  Patrick Soon-Shiong, the owner of the Los Angeles Times, has dismayed staffers as he curtails critical coverage of Donald Trump.  —  Patrick Soon-Shiong's meddling at the Los Angeles Times has grown more pervasive than previously realized.",
    "url": "https://www.status.news/p/patrick-soon-shiong-los-angeles-times-donald-trump-fcad"
  },
  {
    "text": "Trudeau considering his options as leader after Freeland quits cabinet, sources say  —  Prime Minister Justin Trudeau is considering his options as leader, sources tell CTV News, after Finance Minister Chrystia Freeland revealed she will quit cabinet.  —  In an explosive resignation letter … ",
    "url": "https://www.ctvnews.ca/politics/trudeau-considering-his-options-as-leader-after-freeland-quits-cabinet-sources-say-1.7146952"
  },
  {
    "text": "Trump transition launches DHS landing team full of first-term alums  —  President-elect Donald Trump's Homeland Security landing team is starting work today with meetings at the Transportation Security Administration's headquarters in Springfield, Virginia.  The sprawling Department … ",
    "url": "https://www.politico.com/live-updates/2024/12/16/congress/dhs-landing-team-starts-work-00194494"
  },
  {
    "text": "Hegseth's Guard Left the Army After the Beating of a Civilian During Training  —  John Hasenbein, who has escorted Donald J. Trump's pick for defense secretary to meetings on Capitol Hill, said he was unjustly prosecuted for the 2019 episode.  —  When Pete Hegseth visited senators on Capitol Hill … ",
    "url": "https://www.nytimes.com/2024/12/16/us/politics/hegseth-bodyguard-army.html"
  },
  {
    "text": "Oh, Never Mind  —  Do you remember when candidate Donald Trump said, “Grocery prices have skyrocketed.  How can a family afford that?  So, when I win, I will immediately bring prices down.”  That was at a rally in August.  —  Or how about this: “We will end inflation and make America affordable again … ",
    "url": "https://steady.substack.com/p/oh-never-mind"
  },
  {
    "text": "12/17/24 ☀️ AM:  —  Tick-tock: The CR is still under wraps, as a House vote slips to Thursday  —  The Vault: Brown's nomination gambit looks shaky  —  RFK Jr. wades slowly into confirmation fight  —  Trump allies start making impoundment moves",
    "url": "https://punchbowl.news/archive/121724-am/"
  },
  {
    "text": "Trump and SoftBank CEO Announce $100 Billion Investment in US Projects  —  The technology company plans to invest $100 billion in U.S. projects, echoing the multibillion-dollar pledge it made after Donald J. Trump's first election victory in 2016.  —  President-elect Donald J. Trump's … ",
    "url": "https://www.nytimes.com/2024/12/16/us/trump-softbank-investment.html?unlocked_article_code=1.iE4.-fpn.Uu6E3a2JXlsv&smid=nytcore-ios-share&referringSource=articleShare"
  }
]