[
  {
    "text": "F.B.I. Is Asked to Arrest Texas Democrats in Battle Over House Seats  —  It was unclear how the agency would respond.  Democratic lawmakers left the state to stop Republicans from redrawing district maps to their advantage.  —  Senator John Cornyn of Texas asked the F.B.I. on Tuesday … ",
    "url": "https://www.nytimes.com/2025/08/05/us/politics/fbi-texas-democrats.html"
  },
  {
    "text": "Trump started a redistricting war.  Only Congress can stop it.  —  As the Cold War taught us, détente is better than mutually assured destruction for all the parties.  —  A sudden war over redistricting has broken out in Texas and looks to spread across the country, with California … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-texas-redistricting-map-congress-voters-rcna223094"
  },
  {
    "text": "Texas Reopens the Gerrymander Wars  —  Congress could limit the mutual assured political destruction as partisans move to redistrict more than once a decade.  —  Dozens of Texas Democrats skedaddled on Sunday, fleeing the state to prevent Republicans from passing a new U.S. House map that's intended … ",
    "url": "https://www.wsj.com/opinion/texas-gerrymandering-house-seats-democrats-republicans-congress-f1514f89?st=TmFT9z&reflink=article_copyURL_share"
  },
  {
    "text": "Watch CNBC's full interview with President Donald Trump  —  President Donald Trump joins ‘Squawk Box’ via phone to discuss the latest news affecting markets and the country's economic goals.  —  WATCH NOW  —  WATCH NOW  —  WATCH NOW  —  WATCH NOW  —  President Trump … ",
    "url": "https://www.cnbc.com/video/2025/08/05/watch-cnbcs-full-interview-with-president-donald-trump.html"
  },
  {
    "text": "Trump “happy to hear” DOJ launched grand jury probe of Obama officials  —  President Trump on Tuesday said he was “happy to hear” that Attorney General Pam Bondi directed federal prosecutors to launch a grand jury probe into the Obama administration's handling of the investigation into Russia's involvement in the 2016 election.",
    "url": "https://www.axios.com/2025/08/05/trump-obama-russia-bondi-grand-jury"
  },
  {
    "text": "A Look Inside Jeffrey Epstein's Manhattan Lair … A sculpture of a bride clinging to a rope dangled in a central atrium of Jeffrey Epstein's mansion.  —  As a gift for Jeffrey Epstein's 63rd birthday, friends sent letters in tribute to the wealthy financier and convicted sex offender.",
    "url": "https://www.nytimes.com/2025/08/05/us/jeffrey-epstein-mansion-photos.html?unlocked_article_code=1.b08.dOob.ioSkJfE1u_Fc&smid=url-share"
  },
  {
    "text": "Trump administration debating releasing transcript of Ghislaine Maxwell interview with DOJ, sources say  —  The Justice Department has an audio recording of the interview it conducted with Jeffrey Epstein associate Ghislaine Maxwell last month, and the administration is considering releasing … ",
    "url": "https://cnn.com/2025/08/05/politics/trump-blanche-epstein-maxwell-interview-transcript"
  },
  {
    "text": "House committee issues subpoenas for Epstein files and depositions with the Clintons  —  The House Oversight Committee subpoenaed the Justice Department on Tuesday for files in the Jeffrey Epstein sex trafficking investigation and is seeking depositions with the Clintons and former law enforcement officials … ",
    "url": "https://apnews.com/article/epstein-trump-congress-subpoena-clintons-a02749e1fe6f0de0c385c7fac186d3ba"
  },
  {
    "text": "Comer subpoenas the Clintons, Trump's DOJ in House Oversight's Epstein probe  —  Others subpoenaed Tuesday include former FBI directors and attorneys general  —  FIRST ON FOX: The House Oversight Committee has subpoenaed former President Bill Clinton and former Secretary of State Hillary Clinton … ",
    "url": "https://www.foxnews.com/politics/comer-subpoenas-clintons-trumps-doj-house-oversights-epstein-probe"
  },
  {
    "text": "Exclusive: Trump administration to formally axe Elon Musk's ‘five things’ email  —  The Trump administration plans as soon as Tuesday to formally axe a program launched by billionaire former Trump adviser Elon Musk requiring federal employees to summarize their five workplace achievements from the prior week … ",
    "url": "https://www.reuters.com/legal/litigation/trump-administration-formally-axe-elon-musks-five-things-email-2025-08-05/"
  },
  {
    "text": "Weather Service is now hiring back hundreds of positions that got cut in the DOGE chaos  —  The National Weather Service has received permission to hire 450 meteorologists, hydrologists and radar technicians just months after being hit hard by Department of Government Efficiency-related cuts and early retirement incentives.",
    "url": "https://cnn.com/2025/08/05/weather/nws-rehiring-doge-layoffs-climate"
  },
  {
    "text": "Trump says JPMorgan Chase, Bank of America rejected him as a customer … President Donald Trump said Tuesday that the two largest American banks previously rejected him as a customer, reviving claims that conservative clients were being unfairly denied accounts.",
    "url": "https://www.cnbc.com/2025/08/05/trump-jpmorgan-chase-bank-of-america-rejected-bank-customer.html"
  },
  {
    "text": "Trump's Deal-Making With Other Elite Schools Scrambles Harvard Negotiations  —  The university was open to spending $500 million, but a $50 million settlement with Brown has prompted new debates in Cambridge.  —  By the start of last week, Harvard University had signaled its readiness … ",
    "url": "https://www.nytimes.com/2025/08/04/us/politics/harvard-trump-brown.html"
  },
  {
    "text": "E.P.A. Moves to Cancel $7 Billion in Grants for Solar Energy  —  If finalized, the move would escalate the Trump administration's efforts to claw back billions of dollars in climate grants awarded under President Biden.  —  The Trump administration is preparing to terminate $7 billion … ",
    "url": "https://www.nytimes.com/2025/08/05/climate/epa-cancels-solar-energy-grants.html"
  },
  {
    "text": "National Park Service to restore and reinstall Albert Pike statue  —  WASHINGTON - The National Park Service announced today that it will restore and reinstall the bronze statue of Albert Pike, which was toppled and vandalized during riots in June 2020.  The restoration aligns … ",
    "url": "https://www.nps.gov/nama/learn/news/pike.htm"
  },
  {
    "text": "Pope Leo Most Favorably Viewed of 14 Newsmakers  —  WASHINGTON, D.C. — Among 14 prominent U.S. and global figures, Pope Leo XIV has the most positive image by far, with many more Americans viewing him favorably than unfavorably.  His 57% favorable rating and 11% unfavorable rating result … ",
    "url": "https://news.gallup.com/poll/693155/pope-leo-favorably-viewed-newsmakers.aspx"
  },
  {
    "text": "High-ranking FBI job losses disproportionately hurt women, people of color  —  Leaders are undertaking an unprecedented campaign to force senior officials off the job.  —  An unprecedented campaign by FBI leaders to force senior bureau officials out of their jobs has disproportionately hit women … ",
    "url": "https://www.msnbc.com/opinion/analysis/fbi-women-minorities-job-losses-kash-patel-rcna222988"
  },
  {
    "text": "Pentagon keeps a lid on Golden Dome … The Space and Missile Defense Symposium in Huntsville this week typically showcases the Pentagon's missile defense priorities.  Organizers expect it will draw 7,300 attendees and 300 exhibitors this year, with Missile Defense Agency Director Lt. Gen. Heath Collins among the headliners.",
    "url": "https://www.politico.com/news/2025/08/05/pentagon-golden-dome-silence-00494365"
  },
  {
    "text": "Maddow: U.S. profoundly changed by authoritarian leader; 'We're beyond waiting and seeing now'  —  Rachel Maddow points out that the thing most Americans were dreading has come to pass, and the United States has changed profoundly in only six months of authoritarian rule.",
    "url": "https://www.msnbc.com/rachel-maddow/watch/maddow-u-s-profoundly-changed-by-authoritarian-leader-we-re-beyond-waiting-and-seeing-now-244353093883"
  },
  {
    "text": "First images of ICE migrant detention facility at Fort Bliss in El Paso, Texas  —  Here are the first aerial views of the Immigration and Customs Enforcement detention facilities currently under construction at Fort Bliss in El Paso.  —  The detention center on the U.S. Army Post is set … ",
    "url": "https://eu.elpasotimes.com/story/news/immigration/2025/08/05/first-aerial-images-of-ice-immigrant-detention-facility-at-fort-bliss/85526250007/"
  },
  {
    "text": "Why So Many Key Institutions Have Folded Rather Than Challenge Trump  —  Eight years ago, Don Lemon was hosting a 10 p.m. show on CNN that each night forthrightly described the antidemocratic tendencies of President Trump.  Guests such as onetime Watergate reporter Carl Bernstein … ",
    "url": "https://newrepublic.com/article/198787/media-universities-businesses-trump-pressure-institutions"
  },
  {
    "text": "Mike Flood Heckled at Town Hall Over Trump's Domestic Policy Bill … Representative Mike Flood, Republican of Nebraska, was booed almost as soon as he took the stage at the University of Nebraska-Lincoln on Monday night.Terry Ratzlaff for The New York Times",
    "url": "https://www.nytimes.com/2025/08/05/us/politics/mike-flood-town-hall.html"
  },
  {
    "text": "Inside Laura Loomer's rise: ‘Obsessive’ research, Oval Office visits  —  Laura Loomer has leveraged a personality that friends label “obsessive” and an extreme loyalty to Trump to emerge as a powerful figure in the president's orbit.  —  Just now  —  Laura Loomer's application … ",
    "url": "https://www.washingtonpost.com/politics/2025/08/05/loomer-trump-influence/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzU0MzY2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1NzQ4Nzk5LCJpYXQiOjE3NTQzNjY0MDAsImp0aSI6ImZiZGIwYjNlLWJhNzQtNDA5ZC05NzU4LTViOTMzMTFmZDYwNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA4LzA1L2xvb21lci10cnVtcC1pbmZsdWVuY2UvIn0.v7Ki1kZcL9qhaAP_lND-WJqU9AOkikQ9l3soeGUOrc8"
  },
  {
    "text": "Donald Trump Doubles Down on Mathematically Impossible Drug Price Cuts  —  President Donald Trump has doubled down on his claim of reducing drug prices by amounts that are mathematically impossible.  —  Trump told reporters on Sunday that his administration had cut the price of some prescription drugs by as much as 1,500 percent.",
    "url": "https://www.newsweek.com/donald-trump-doubles-down-impossible-drug-price-cuts-2108365"
  },
  {
    "text": "Trump spoke with Zelensky ahead of deadline for Putin  —  President Trump spoke on Tuesday with Ukrainian President Volodymyr Zelensky and discussed the ceasefire ultimatum Trump set for Russian President Vladimir Putin, according to Ukrainian officials.",
    "url": "https://www.axios.com/2025/08/05/trump-zelensky-call-putin-ceasefire-deadline"
  },
  {
    "text": "Inside Trump's New Tactic to Separate Immigrant Families … Evgeny and Evgeniia, who fled their native Russia to seek political asylum, have been separated from their 8-year-old son, Maksim, since May.The New York Times  —  Evgeny and Evgeniia faced an excruciating choice.",
    "url": "https://www.nytimes.com/2025/08/05/us/politics/trump-administration-family-separation.html?unlocked_article_code=1.b08.4TYJ.M61orqqKyzxZ&smid=url-share"
  },
  {
    "text": "After only 6 months, Project 2025 is already 47 percent complete  —  On July 5, 2024, then-presidential candidate Donald Trump wrote in a Truth Social post that he had “no idea who is behind Project 2025,” the nearly 900-page manifesto published in April 2023 by the conservative Heritage Foundation for use by … ",
    "url": "https://thehill.com/opinion/white-house/5435802-after-only-6-months-project-2025-is-halfway-complete/"
  },
  {
    "text": "After Trump's Firing of BLS Commissioner, Republicans Fall in Line With His Criticism  —  President Trump's decision to fire the head of the Bureau of Labor Statistics forced his allies into the awkward spot of criticizing an agency they had freely cited in the past.",
    "url": "https://www.nytimes.com/2025/08/04/us/politics/trump-republicans-bls-jobs-analysis.html"
  }
]