[
  {
    "text": "Among the problems with Trump's ‘free’ luxury jet from Qatar: It's not actually free  —  Even if the jet from Qatar were free, this arrangement would still be a legal and ethical mess.  But the free plane also wouldn't be free.  —  On Sunday night, as the public first learned … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/problems-trumps-free-luxury-jet-qatar-s-not-actually-free-rcna206706"
  },
  {
    "text": "Carville Lectures Dems on How to Go After Trump for $400m Grift  —  ENOUGH IS ENOUGH  —  The veteran political strategist demands action on unusual deals involving the president, including the jet from Qatar.  —  James Carville is calling on Democrats to go on the offensive over what he calls the … ",
    "url": "https://www.thedailybeast.com/carville-says-dems-need-to-hammer-donald-trump-corruption-and-never-get-off-it/"
  },
  {
    "text": "Conduct oversight on Trump's graft — or censure James Comer  —  House Democrats must pressure Republicans to fulfill their constitutional duties.  —  President Donald Trump arrived in the Middle East on Tuesday as the representative of two different entities.",
    "url": "https://www.washingtonpost.com/opinions/2025/05/14/trump-republicans-ethics-oversight-pressure/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6IjZhNWM5YzY3LTlmZGUtNDUwYi1iZTRkLTVlMzNkM2RkYjE3ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA1LzE0L3RydW1wLXJlcHVibGljYW5zLWV0aGljcy1vdmVyc2lnaHQtcHJlc3N1cmUvIn0.d1eyeb6ix8xfULyq2OqoBcxnCv6oOAsv9FF44S_pXrE&itid=gfta"
  },
  {
    "text": "Republicans Raise Concerns Over Trump's Plane Gift as He Heads to Qatar  —  Some lawmakers flag potential security issues as the president doubles down on defending the offer, saying only a ‘fool’ would turn it down  —  WASHINGTON—Republican lawmakers on Tuesday expressed national-security concerns … ",
    "url": "https://www.wsj.com/politics/policy/republicans-raise-concerns-over-trumps-plane-gift-as-he-heads-to-qatar-0060bdec"
  },
  {
    "text": "White House eased China tariffs after warnings of harm to 'Trump's people'  —  The president has backtracked repeatedly on his tariff policies, creating a whiplash with downsides and few clear benefits so far.  —  Some of the president's top aides saw an opening.",
    "url": "https://www.washingtonpost.com/business/2025/05/14/trump-tariffs-china-trade/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ3MTk1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4NTc3NTk5LCJpYXQiOjE3NDcxOTUyMDAsImp0aSI6ImRmMzQxMjk1LTU3NzctNDM1NC05ZTA5LWY5OTZjNjFhNzc4MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA1LzE0L3RydW1wLXRhcmlmZnMtY2hpbmEtdHJhZGUvIn0.6SZXjyiHWbKuHY1WxFV7waUmh0lPBsYKNulE6VyklOk&itid=gfta"
  },
  {
    "text": "Multiple Trump White House officials have ties to antisemitic extremists  —  President Trump campaigned on a pledge to fight antisemitism.  —  “Antisemitic bigotry has no place in a civilized society,” Trump said at an event in 2024.  —  However, the president's critics question whether antisemitism … ",
    "url": "https://www.npr.org/2025/05/14/nx-s1-5387299/trump-white-house-antisemitism"
  },
  {
    "text": "Scoop: Trump impeachment called “idiotic” in House Dem meeting  —  A rogue Trump impeachment push was criticized as “idiotic” and “horrible” in a closed-door House Democratic meeting Wednesday, Axios has learned.  —  Why it matters: The comments from Rep. Jerry Nadler (D-N.Y.) … ",
    "url": "https://www.axios.com/2025/05/14/trump-impeachment-pelosi-thanedar-nadler"
  },
  {
    "text": "Trump calls for new Iran nuclear deal  —  In his final open remarks during his time in Riyadh, President Donald Trump echoed his calls for a nuclear deal with Iran and again touted his closeness with Saudi Arabia's Crown Prince Mohammed bin Salman.  —  “The whole world is watching the Middle East … ",
    "url": "https://abcnews.go.com/Politics/live-updates/trump-admin-live-updates/?id=121703012&entryId=121785209"
  },
  {
    "text": "Wisconsin Judge Indicted on Charges That She Helped Immigrant Evade Agents  —  Judge Hannah C. Dugan was accused of helping an undocumented immigrant elude federal agents who were waiting to arrest him outside her courtroom.  —  The Wisconsin judge arrested last month and accused of helping … ",
    "url": "https://www.nytimes.com/2025/05/13/us/milwaukee-judge-hannah-dugan-immigration.html"
  },
  {
    "text": "Federal grand jury indicts Milwaukee County Judge Hannah Dugan in ICE case  —  A federal grand jury indicted Milwaukee County Judge Hannah Dugan on May 13 on charges that she tried to assist an undocumented immigrant escape arrest from her courtroom last month, putting her at the center … ",
    "url": "https://eu.jsonline.com/story/news/2025/05/13/milwaukee-judge-hannah-dugan-federal-grand-jury/83459305007/"
  },
  {
    "text": "House GOP hard-liners digging in on Medicaid work requirements  —  House GOP hard-liners are livid over a move by leadership to delay implementation of new work requirements for Medicaid for several years.  It's one of the thorniest and politically explosive pieces of the GOP mega-bill … ",
    "url": "https://www.politico.com/live-updates/2025/05/14/congress/house-gop-hard-liners-medicaid-work-requirements-00347921"
  },
  {
    "text": "What has Elon Musk's Doge actually achieved?  —  Six months after the so-called Department of Government Efficiency was unveiled, it has yet to find a fraction of the hoped for savings  —  Unlock the White House Watch newsletter for free  —  Your guide to what Trump's second term means for Washington, business and the world",
    "url": "https://www.ft.com/content/085430ab-27fe-46fc-a798-1059649d3b32"
  },
  {
    "text": "Mexican security chief confirms cartel family members entered US in a deal with Trump administration  —  Mexico's security chief confirmed Tuesday that 17 family members of cartel leaders crossed into the U.S. last week as part of a deal between a son of the former head of the Sinaloa Cartel and the Trump administration.",
    "url": "https://apnews.com/article/el-chapo-sinaloa-cartel-trump-border-harfuch-86572a31c88a216da7cd5f33006a0011"
  },
  {
    "text": "New poll: Americans oppose cuts to Medicaid, want Democrats to control the U.S. House  —  ...and Kamala Harris leads Donald Trump in a hypothetical 2024 rematch.  Results from the inaugural Strength In Numbers/Verasight poll … Americans broadly disapprove of the job Donald Trump is doing … ",
    "url": "https://www.gelliottmorris.com/p/new-poll-americans-oppose-trumps"
  },
  {
    "text": "Trump Gushes with Envy Toward the House of Saud  —  Good morning to everyone except whoever did the president's makeup today:  —  Happy Wednesday.  —  Autocrats, Kleptocrats, Plutocrats... Oh My!  —  by William Kristol  —  What a spectacle!  There they were yesterday, assembled in Riyadh … ",
    "url": "https://www.thebulwark.com/p/trump-gushes-with-envy-toward-the-house-of-saud-saudi-arabia-mbs-salman"
  },
  {
    "text": "Germany Foils Alleged Russian Plot to Mail Incendiary Devices  —  The conspiracy, if confirmed, shows Moscow continues to target the West with acts of sabotage despite Trump's arrival in the White House  —  BERLIN—German police detained three men suspected of planning to mail packages laden … ",
    "url": "https://www.wsj.com/world/europe/germany-foils-alleged-russian-plot-to-mail-incendiary-devices-f8ad87fa"
  },
  {
    "text": "Democrats just flipped Nebraska's biggest city  —  Democrat John Ewing unseated Republican Mayor Jean Stothert in Tuesday's officially nonpartisan election to lead Omaha, a victory that ends the GOP's 12-year hold on Nebraska's largest city.  —  Stothert conceded the race after 9 PM local … ",
    "url": "https://www.the-downballot.com/p/democrats-just-flipped-nebraskas"
  },
  {
    "text": "Newsom calls for walking back free healthcare for eligible undocumented immigrants  — Facing a budget deficit, Gov. Gavin Newsom is proposing changes to California's program to provide free healthcare coverage to low-income undocumented immigrants.  — The cost of coverage for immigrants … ",
    "url": "https://www.latimes.com/california/story/2025-05-14/newsom-walks-back-free-healthcare-for-undocumented-immigrants"
  },
  {
    "text": "Pete Rose, ‘Shoeless’ Joe Jackson among players reinstated by MLB  —  In a historic, sweeping decision, baseball commissioner Rob Manfred on Tuesday removed Pete Rose, “Shoeless” Joe Jackson and other deceased players from Major League Baseball's permanently ineligible list.",
    "url": "https://www.espn.com/mlb/story/_/id/45115659/pete-rose-shoeless-joe-jackson-players-reinstated-mlb"
  },
  {
    "text": "Tiny Company With China Ties Announces Big Purchase of Trump Cryptocurrency  —  The firm, which produces content for TikTok, recorded no revenue last year, but it announced this week that a mysterious stock sale would allow it to invest heavily in the $TRUMP memecoin.",
    "url": "https://www.nytimes.com/2025/05/13/us/politics/trump-crypto-purchase.html"
  },
  {
    "text": "The End of Rule of Law in America … The president of the united states appears to have long ago forgotten that Americans fought the Revolutionary War not merely to secure their independence from the British monarchy but to establish a government of laws, not of men, so that they and future generations … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/05/law-america-trump-constitution/682793/"
  },
  {
    "text": "The Professors Are Using ChatGPT, and Some Students Aren't Happy About It  —  Students call it hypocritical.  A senior at Northeastern University demanded her tuition back.  But instructors say generative A.I. tools make them better at their jobs.  —  In February, Ella Stapleton … ",
    "url": "https://www.nytimes.com/2025/05/14/technology/chatgpt-college-professors.html?unlocked_article_code=1.HE8.sJHw.KHcPd33Y7gfX"
  },
  {
    "text": "Musk Adviser May Make as Much as $1 Million a Year While Helping to Dismantle Agency that Regulates Tesla and X  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  One of Elon Musk's employees … ",
    "url": "https://www.propublica.org/article/doge-elon-musk-chris-young-cfpb-tesla-x"
  },
  {
    "text": "Transportation Secretary Sean Duffy Changed His Wife's Flight to Avoid Newark Airport  —  Would you let your family fly out of Newark? … Transportation Secretary Sean Duffy keeps going on TV and insisting it's safe to fly in and out of Newark Liberty Airport in New Jersey … ",
    "url": "https://gizmodo.com/transportation-secretary-sean-duffy-changed-his-wifes-flight-to-avoid-newark-airport-2000601796"
  },
  {
    "text": "A Free People Need a Free Press  —  This essay was originally delivered as a talk at the Notre Dame Kellogg Institute for International Studies on Tuesday.  —  The role of a free and independent press in a healthy democracy is under direct attack, with increasingly aggressive efforts to curtail and punish independent journalism.",
    "url": "https://www.nytimes.com/2025/05/13/opinion/ag-sulzberger-free-press.html?unlocked_article_code=1.G08.p46U.9_2oERVYRQuV&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Israeli bombing wave kills dozens in Gaza including at least 22 children, say reports  —  Bombardment signals new escalation after Netanyahu said Israel would ‘go in with full force to complete the operation’  —  An intense wave of Israeli bombing has reportedly killed dozens of people in Gaza … ",
    "url": "https://www.theguardian.com/world/2025/may/14/israel-hits-gaza-hospitals-in-deadly-strikes-after-pause-to-allow-release-of-edan-alexander"
  },
  {
    "text": "Trump Administration Cuts Additional $450 Million in Grants to Harvard  —  The latest broadside from the federal government comes as Harvard faces multiple investigations from across the Trump administration.  —  The Trump administration on Tuesday canceled an additional $450 million in grants … ",
    "url": "https://www.nytimes.com/2025/05/13/us/politics/trump-harvard-grants-450-million.html"
  },
  {
    "text": "How Qatar Bought America  —  The tiny Gulf nation has spent almost $100 billion to establish its influence in Congress, universities, newsrooms, think tanks, and corporations.  What does it want in return?  —  On Wednesday, Donald Trump will travel to Qatar.",
    "url": "https://www.thefp.com/p/how-qatar-bought-america"
  },
  {
    "text": "Not much more room left for SALT, says GOP tax chief  —  House Ways and Means Chair Jason Smith (R-Mo.) told reporters Wednesday there's only about $50 billion available to increase a key tax deduction sought by blue-state Republicans.  Under legislation advanced out of Ways … ",
    "url": "https://www.politico.com/live-updates/2025/05/14/congress/jason-smith-salt-deal-50-billion-00347925"
  }
]