[
  {
    "text": "Israel's strike on Iran was 8 months in the making  —  Israel's stunning and sprawling operation overnight targeting Iran's nuclear facilities, missile sites, scientists and generals followed eight months of intensive clandestine preparations.  —  Why it matters: The operation launched … ",
    "url": "https://www.axios.com/2025/06/13/how-israel-executed-strike-iran-nuclear"
  },
  {
    "text": "In Twist, U.S. Diplomacy Served as Cover for Israeli Surprise Attack  —  Talks seen as a way to keep the peace gave Israel the opportunity to land heavy military blows  —  U.S. negotiations with Iran aimed at curbing Tehran's nuclear program were widely seen as an important way to preserve regional peace.",
    "url": "https://www.wsj.com/world/middle-east/in-twist-u-s-diplomacy-served-as-cover-for-israeli-surprise-attack-c79b2206?st=bbwzoM&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Israel strikes Iran, killing 3 commanders; Trump urges Tehran to ‘make a deal’  —  Israel strikes Iran; explosions rock Tehran  —  President Donald Trump urged Iran to “make a deal” with Israel “before it is too late,” after Israel launched what it called a preemptive strike on Iran's nuclear program and military targets.",
    "url": "https://www.washingtonpost.com/world/2025/06/12/israel-attacks-iran-tehran-explosions/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5NzAwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxMDgzMTk5LCJpYXQiOjE3NDk3MDA4MDAsImp0aSI6ImY2NzJiYTk3LTFiODUtNDMwZC1iZTgwLTA2OGRjOTk0ODA5MiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzA2LzEyL2lzcmFlbC1hdHRhY2tzLWlyYW4tdGVocmFuLWV4cGxvc2lvbnMvIn0.cg3rfuJDLfOpkuqdfxc8z6W0ZgvkzELyN2LrdVCKMg0&itid=gfta"
  },
  {
    "text": "Live updates: Israel strikes Iranian nuclear facilities as fears of war mount  —  Iran's top military official, Mohammad Hossein Bagheri and Hossein Salami, the commander of the Revolutionary Guard Corps, were killed, according to state media. … Mehrabad International Airport closed until tomorrow afternoon, state media says",
    "url": "https://www.nbcnews.com/world/iran/live-blog/israel-strikes-iran-middle-east-conflict-live-updates-rcna212727"
  },
  {
    "text": "Here's the latest.  —  The Israeli government has been making preparations for weeks for an attack on Iran's nuclear facilities.  —  Here's the latest.  —  Explosions rocked Tehran early Friday morning, and Israel's defense minister said his country's warplanes had carried out an attack on Iran … ",
    "url": "https://www.nytimes.com/live/2025/06/12/world/israel-iran-us-nuclear?unlocked_article_code=1.Ok8.U3b4.WA988zCDEwXA&smid=url-share"
  },
  {
    "text": "As Israel launches a major attack on Iran, Trump's pre-election rhetoric runs into reality  —  The president spent four years saying “This would never have happened if I was president” in response to foreign violence.  Now he's haunted by the claims.  —  About a month before Election … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/israel-launches-major-attack-iran-trumps-pre-election-rhetoric-runs-re-rcna212811"
  },
  {
    "text": "Trump Accidentally Reveals a Dark MAGA Truth—and Hands Dems an Opening  —  This week, President Donald Trump admitted on Truth Social that his mass deportations are hurting farmers and the economy.  Those removals are “taking very good, longtime workers away” from farms and hotels … ",
    "url": "https://newrepublic.com/article/196817/trump-deportations-house-republicans-memo"
  },
  {
    "text": "Transcript: Trump Blurts Out a Dark MAGA Truth, Handing Dems a Weapon  —  The following is a lightly edited transcript of the June 13 episode of the Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/196789/transcript-trump-blurts-dark-maga-truth-handing-dems-weapon"
  },
  {
    "text": "Kristi Noem says the feds are coming to ‘liberate’ Los Angeles  —  We should take the Trump administration seriously when officials threaten a federal takeover of a Democratic-led city.  —  It's understandable that the headlines about the news conference Homeland Security Secretary Kristi Noem held … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/kristi-noem-alex-padilla-detained-los-angeles-ice-rcna212764"
  },
  {
    "text": "All the polls on the LA protests and Trump's response so far  —  I have struggled to come up with more to say on the Los Angeles protests that isn't repetitive of some of the great things other people are writing on the subject.  But then it struck me that it may be useful to readers … ",
    "url": "https://www.gelliottmorris.com/p/all-the-polls-on-the-la-protests"
  },
  {
    "text": "Sen. Alex Padilla Tells MSNBC FBI ‘Escorted’ Him To Trump DHS Presser They Claim He Crashed  —  Sen. Alex Padilla (D-CA) told MSNBC's Jacob Soboroff that he was “escorted” to Homeland Security Secretary Kristi Noem's press conference by FBI agents, where he was then manhandled by agents under the claim they didn't know who he was.",
    "url": "https://www.mediaite.com/media/news/sen-alex-padilla-tells-msnbc-fbi-escorted-him-to-trump-dhs-presser-they-claim-he-crashed/"
  },
  {
    "text": "ICE detainees tear down a wall in uprising at N.J. detention facility, lawyer says  —  About 50 inmates at Delaney Hall, the ICE detention facility in Newark, banded together and pushed down the wall of a dormitory room when meals were hours late, a lawyer told NJ Advance Media.",
    "url": "https://www.nj.com/essex/2025/06/ice-detainees-tear-down-a-wall-in-uprising-at-nj-detention-facility-lawyer-says.html"
  },
  {
    "text": "Judge blocks Trump's election executive order, siding with Democrats who called it overreach  —  A federal judge on Friday blocked President Donald Trump's attempt to overhaul elections in the U.S., siding with a group of Democratic state attorneys general who challenged the effort as unconstitutional.",
    "url": "https://apnews.com/article/trump-elections-executive-order-4f863aaa8e0c59640ebc727827ffc887"
  },
  {
    "text": "Playing Secretary  —  As war looms, Pete Hegseth's Pentagon is beset by infighting over leaks, drugs, and socks.  How long will Trump stand by his man?  —  On Dan Caldwell's 87th day as a senior official at the Department of Defense, he read some intelligence reports and prepped … ",
    "url": "https://nymag.com/intelligencer/article/defense-secretary-pete-hegseth-pentagon-leaks-signalgate-trump.html"
  },
  {
    "text": "They Asked an A.I. Chatbot Questions.  The Answers Sent Them Spiraling.  —  Generative A.I. chatbots are going down conspiratorial rabbit holes and endorsing wild, mystical belief systems.  For some people, conversations with the technology can deeply distort reality.",
    "url": "https://www.nytimes.com/2025/06/13/technology/chatgpt-ai-chatbots-conspiracies.html?unlocked_article_code=1.Ok8.VBY-.s76GQpFar8r4&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "‘We will kill you’: Florida sheriff issues stern warning to protesters  —  As protests over the Trump administration's immigration raids continue in Los Angeles and other cities, Florida Attorney General James Uthmeier and law enforcement officials warned that demonstrators could face … ",
    "url": "https://www.cnn.com/2025/06/13/us/video/florida-sheriff-warns-protesters-we-will-kill-you-digvid"
  },
  {
    "text": "How MAGA Took Over America's 250th Birthday  —  Tanks, armored personnel carriers, and howitzers will roll through the streets of Washington, DC, on Saturday—coming to a halt just steps from where President Donald Trump once exhorted his supporters to “fight like hell” and march on the US Capitol.",
    "url": "https://www.motherjones.com/politics/2025/06/military-parade-army-trump-american250-a250/"
  },
  {
    "text": "Trump's Big Bill Would Be More Regressive Than Any Major Law in Decades  —  The authors reviewed distributional analyses from bills over the last 35 years.  —  The Republican megabill now before the Senate cuts taxes for high earners and reduces benefits for the poor.",
    "url": "https://www.nytimes.com/interactive/2025/06/12/upshot/gop-megabill-distribution-poor-rich.html?unlocked_article_code=1.Ok8.VM_g.bnqdGeCi9DS1&smid=url-share"
  },
  {
    "text": "Senate GOP Strips Provision From Tax Bill That Would Let Trump Rule As A King  —  They removed jarring language from the House GOP's “big, beautiful bill” that would have limited the ability of courts to enforce contempt orders.  —  WASHINGTON - Senate Republicans have quietly removed … ",
    "url": "https://www.huffpost.com/entry/senate-republicans-big-beautiful-bill-contempt-courts-trump_n_684b9b3be4b0c4fd78ff7f2e"
  },
  {
    "text": "Trump Org Keeps Bringing In Foreign Workers To Staff Its Clubs And Winery  —  Topline  —  On Thursday, President Donald Trump acknowledged concerns from the agriculture and hospitality industries that his strict immigration policies are making it harder to retain long-time workers … ",
    "url": "https://www.forbes.com/sites/zacheverson/2025/06/12/trump-organization-foreign-workers-visa-hiring-mar-a-lago-golf-clubs-winery/"
  },
  {
    "text": "Trump administration gives personal data of immigrant Medicaid enrollees to deportation officials  —  President Donald Trump's administration this week provided deportation officials with personal data — including the immigration status — on millions of Medicaid enrollees … ",
    "url": "https://apnews.com/article/medicaid-deportation-immigrants-trump-4e0f979e4290a4d10a067da0acca8e22"
  },
  {
    "text": "Trump admin refuses to release Mahmoud Khalil, despite judge's order  —  The Trump administration is keeping Columbia University alumnus Mahmoud Khalil detained, despite a judge's Wednesday order for his release.  —  Why it matters: The administration's tug-of-war with courts over Khalil represents … ",
    "url": "https://www.axios.com/2025/06/13/trump-admin-refuses-to-release-mahmoud-khalil-despite-judges-order"
  },
  {
    "text": "Iran announces withdrawal from 6th round of talks with US  —  Iranian airspace shutdown: Air India reroutes numerous international flights  —  London-bound Air India flight returns to Mumbai after three hours in air  —  Air India flight makes emergency landing after receiving bomb threat",
    "url": "https://timesofoman.com/article/159200-iran-announces-withdrawal-from-6th-round-of-talks-with-us"
  },
  {
    "text": "Willkie Farr Partners, Unhappy With the Firm's Deal With Trump, Depart for Cooley  —  The departures are the latest fallout for firms that cut deals with President Trump to avoid executive orders.  —  Seven partners at Willkie Farr & Gallagher, a prominent law firm that cut a deal … ",
    "url": "https://www.nytimes.com/2025/06/13/business/willkie-farr-cooley-trump-deal.html"
  },
  {
    "text": "ICE Agent Fled From Angry Residents Outside New York School — and Got in a Car Crash  —  A dozen or more masked men, some with long guns, tried to enter a men's homeless shelter without identifying themselves in a rural town with a long-standing immigrant community on eastern Long Island in New York.",
    "url": "https://theintercept.com/2025/06/13/ice-school-raid-long-island-new-york/"
  }
]