[
  {
    "text": "Dismissed Nuclear Bomb Specialists Recalled by Energy Department  — About 300-400 workers tied to nuclear programs were dismissed  — Agency seeks to bring back workers after chaotic terminations  —  The Energy Department is seeking to bring back nuclear energy specialists … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-14/dismissed-nuclear-bomb-specialists-recalled-by-energy-department"
  },
  {
    "text": "Trump officials fired nuclear staff not realizing they oversee the country's weapons stockpile, sources say  —  Trump administration officials fired more than 300 staffers Thursday night at the National Nuclear Security Administration — the agency tasked with managing the nation's nuclear stockpile … ",
    "url": "https://www.cnn.com/2025/02/14/climate/nuclear-nnsa-firings-trump"
  },
  {
    "text": "Justice officials move to drop Adams case after 7 lawyers refuse, resign in protest  —  Acting deputy attorney general Emil Bove told prosecutors in Washington to find someone who would seek to have the case dismissed, or risk losing their jobs  —  The Justice Department on Friday filed … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/14/justice-prosecutors-resignation-trump-eric-adams-corruption/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NTA5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwODkxNTk5LCJpYXQiOjE3Mzk1MDkyMDAsImp0aSI6ImViZTI0YjBiLTJmMzMtNDZlYi05YTI1LTVjNjFhNzlhMWRkNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzE0L2p1c3RpY2UtcHJvc2VjdXRvcnMtcmVzaWduYXRpb24tdHJ1bXAtZXJpYy1hZGFtcy1jb3JydXB0aW9uLyJ9.Xqn0QerOwS_yqEQceaLRNmxa69s4wYZgiu7RxfozVU0&itid=gfta"
  },
  {
    "text": "Federal prosecutor will sign motion to dismiss Adams charges in bid to save colleagues' jobs, sources say  —  A federal prosecutor agreed on Friday to file a motion to dismiss the criminal corruption charges against New York City Mayor Eric Adams, in a bid to spare other career staff … ",
    "url": "https://www.reuters.com/world/us/federal-prosecutor-will-sign-motion-dismiss-adams-charges-bid-save-colleagues-2025-02-14/"
  },
  {
    "text": "Justice Department moves to dismiss Eric Adams case after extraordinary internal revolt  —  The filing does not spell the end of the high-profile case.  A federal court judge must approve the decision to drop the charges.  —  The Justice Department on Friday moved to dismiss corruption charges … ",
    "url": "https://www.nbcnews.com/politics/justice-department/justice-department-moves-dismiss-eric-adams-case-extraordinary-interna-rcna192294"
  },
  {
    "text": "Elon Musk's DOGE Posts Classified Data On Its New Website  —  “People are scrambling” to see if their sensitive information has been accessed by Musk's programmers, said one federal intelligence employee.  —  LOADING  —  WASHINGTON — Elon Musk's team at the so-called Department … ",
    "url": "https://www.huffpost.com/entry/elon-musk-doge-posts-classified-data_n_67ae646de4b0513a8d767112"
  },
  {
    "text": "The federal tech workers facing down DOGE  —  Over the last few weeks, as Elon Musk and DOGE have infiltrated government agency after government agency, proclaiming their intent to slash budgets, cut jobs, and embrace AI, we've watched a brazen, extralegal effort to hollow out the state unfold in real time.",
    "url": "https://www.bloodinthemachine.com/p/the-federal-tech-workers-facing-down"
  },
  {
    "text": "Trump's cuts hit red states, triggering GOP pushback  —  GOP lawmakers try to intervene with the Trump administration as local fallout grows.  —  Republican lawmakers are pushing back against sweeping cuts to the federal government launched by President Donald Trump and Elon Musk … ",
    "url": "https://www.politico.com/news/2025/02/14/doge-trump-omb-gop-00204435"
  },
  {
    "text": "Inside The ‘Bizarre’ Meeting Where DOGE Requested ‘Extensive System Access’ At IRS  —  The Internal Revenue Service has now joined the list of federal agencies and offices experiencing life on the “DOGE” side.  Two sources told TPM that a staffer affiliated with President Trump and Elon Musk's controversial … ",
    "url": "https://talkingpointsmemo.com/news/doge-irs-extensive-system-access"
  },
  {
    "text": "Layoffs to hit IRS as DOGE targets tax collections  —  The cuts are expected to at least partially reverse the Biden administration's efforts to beef up the agency.  —  The Trump administration is expected to begin laying off thousands of employees at the Internal Revenue Service … ",
    "url": "https://www.washingtonpost.com/business/2025/02/14/irs-tax-doge-musk/"
  },
  {
    "text": "Trump and Musk's Valentine's Day Massacre of Military Veterans  —  In a late-night purge, seven federal agencies carried out mass layoffs — 1,000 at the VA alone, the nation's largest employer of military veterans  —  Picture this.  You risk everything for your country.  Leave friends and family behind.",
    "url": "https://www.rollingstone.com/politics/political-commentary/trump-musk-lay-off-veterans-affaris-staffers-1235268532/"
  },
  {
    "text": "Seeking a Mar-a-Lago Vibe, Trump Considers Paving Over Grass in Rose Garden  —  The president has been discussing plans to rip up the grass in one of the White House's most iconic locations and put in a hard surface to serve as a patio like the one at his Florida home and club.",
    "url": "https://www.nytimes.com/2025/02/14/us/politics/mar-a-lago-trump-grass-rose-garden.html"
  },
  {
    "text": "Judge temporarily blocks mass terminations at Consumer Financial Protection Bureau  —  In a court order, the judge said CFPB employees for now cannot be fired without cause, and data housed by the independent agency cannot be deleted.  —  WASHINGTON — A judge said in a r u ling Friday … ",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-temporarily-blocks-mass-terminations-consumer-financial-protecti-rcna192311"
  },
  {
    "text": "JD Vance breaks taboo by meeting with leader of Germany's far-right party  —  US vice-president meets with AfD leader Alice Weidel as Trump administration courts European populist parties  —  JD Vance has met with the leader of Germany's far-right Alternative für Deutschland party … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/14/jd-vance-alice-weidel-meeting-germany-far-right"
  },
  {
    "text": "AP reporter and photographer barred from Air Force One over ‘Gulf of Mexico’ terminology dispute  —  The White House barred a credentialed Associated Press reporter and photographer from boarding the presidential airplane Friday for a weekend trip with Donald Trump, saying the news agency's stance … ",
    "url": "https://apnews.com/article/trump-ap-news-ban-air-force-one-b90b8b842d63aef9960ccffb4a657dc2"
  },
  {
    "text": "Special counsel Jack Smith discloses ‘gift’ of $140,000 in free legal services  —  It's not clear precisely why Smith sought outside legal advice.  —  Jack Smith, the special counsel who brought two criminal cases against President Donald Trump, received $140,000 in pro bono legal services … ",
    "url": "https://www.politico.com/news/2025/02/14/jack-smith-justice-department-019350"
  },
  {
    "text": "3 men claiming to be from DOGE show up at San Francisco City Hall, demand records  —  San Francisco city officials are investigating after three men who claimed to be from the Department of Government Efficiency (DOGE) showed up at City Hall on Friday demanding records from offices before fleeing.",
    "url": "https://www.cbsnews.com/sanfrancisco/news/doge-3-men-show-up-at-sf-city-hall-demand-records/"
  },
  {
    "text": "Trump administration's firing of federal employees hits multiple agencies  —  Lawyers for eight inspectors general suing the Trump administration over their firings were forced by an angry federal judge to withdraw their motion seeking a temporary restraining order.",
    "url": "https://www.washingtonpost.com/politics/2025/02/14/trump-presidency-news/"
  },
  {
    "text": "Naval Academy faculty told to avoid ‘divisive concepts’ like ‘systemic racism’  —  The guidance from the provost follows President Trump's recent DEI-focused executive order, which some say seeks to erase history and diversity.  —  Faculty at the Naval Academy are no longer permitted … ",
    "url": "https://www.thebaltimorebanner.com/education/higher-education/naval-academy-racism-sexism-faculty-NR7NUMXN3RBRVG7EXQHR35TCWQ/"
  },
  {
    "text": "National Archives Head Resigns as Trump Takes Control of Records  —  Sources name conservative radio host Hugh Hewitt and far-right journalist John Solomon as potential replacements.  —  The acting head of the National Archives announced his resignation on Friday, paving the way for Donald … ",
    "url": "https://www.motherjones.com/politics/2025/02/national-archives-head-resigns-as-trump-takes-control-of-records/"
  },
  {
    "text": "Adams to sue over Trump's clawback of $80 million in migrant grants  —  New York City mayor says legal action will begin next week as his ties to Trump are scrutinized.  —  NEW YORK — Mayor Eric Adams plans to take the Trump administration to court over its clawback of $80 million … ",
    "url": "https://www.politico.com/news/2025/02/14/adams-trump-migrant-grants-00204470"
  },
  {
    "text": "CDC cuts expected to devastate Epidemic Intelligence Service, a ‘crown jewel’ of public health  —  EIS officers investigate disease outbreaks and health threats in the U.S. and abroad  —  The Trump administration's campaign to slash the federal civil service will hit one of the crown jewels of global public health on Friday.",
    "url": "https://www.statnews.com/2025/02/14/trump-cdc-cuts-include-epidemic-intelligence-service-outbreak-investigators/"
  },
  {
    "text": "Intel Agency Confirms It Removed So-Called DEI Items From Its Secured Museum  —  A tipster flagged to HuffPost that the Defense Intelligence Agency removed several non-white history pieces from the agency's internal museum, which is in a secured location and only accessible to people with appropriate clearance.",
    "url": "https://www.huffpost.com/entry/donald-trump-white-house-live-updates_n_67aa443de4b0cced3687c9ec/liveblog_67afb49ae4b0513a8d773902"
  },
  {
    "text": "Top US Election Security Watchdog Forced to Stop Election Security Work  —  The US Cybersecurity and Infrastructure Security Agency has frozen efforts to aid states in securing elections, according to an internal memo viewed by WIRED.  —  The Cybersecurity and Infrastructure Security Agency … ",
    "url": "https://www.wired.com/story/cisa-election-security-freeze-memo/"
  }
]