[
  {
    "text": "Live Updates: After Stormy Daniels, Testimony Turns to Trump's White House  —  Hours of heated testimony from Ms. Daniels focused on her account of a liaison with Donald J. Trump.  Madeleine Westerhout, who was a key gatekeeper for Mr. Trump during his presidency, followed a Trump Organization employee … ",
    "url": "https://www.nytimes.com/live/2024/05/09/nyregion/trump-trial-stormy-daniels"
  },
  {
    "text": "California Students Get $1 Million After They Were Expelled for Wearing Supposedly Racist Acne Masks  —  During a sleepover in August 2017, three 14-year-old boys, two of whom were about to start attending St. Francis High School in Mountain View, California, took a picture of themselves wearing dark green acne masks.",
    "url": "https://reason.com/2024/05/09/california-students-get-1-million-after-they-were-expelled-for-wearing-supposedly-racist-acne-masks/"
  },
  {
    "text": "Jim Jordan's quiet power play for 2025 … - Jordan privately told colleagues what he would be doing differently than Johnson during the recent fight over foreign aid funding, multiple sources told Axios.  — The Ohio Republican has been noticed handing out more campaign checks to colleagues, multiple lawmakers told Axios.",
    "url": "https://www.axios.com/2024/05/09/mike-johnson-jim-jordan-trump-speaker"
  },
  {
    "text": "At a Dinner, Trump Assailed Climate Rules and Asked $1 Billion From Big Oil  —  At a private meeting at Mar-a-Lago, the former president said fossil fuel companies should donate to help him beat President Biden.  —  Former President Donald J. Trump told a group of oil executives … ",
    "url": "https://www.nytimes.com/2024/05/09/climate/trump-oil-gas-mar-a-lago.html"
  },
  {
    "text": "Exclusive: Jared Kushner pitching donors on father-in-law Trump, sources say  —  Donald Trump's son-in-law, Jared Kushner, has been making calls to encourage donors to attend a Trump fundraiser in New York, two sources told Reuters, in one of the first indications of Kushner working to help re-elect his father-in-law.",
    "url": "https://www.reuters.com/world/us/jared-kushner-pitching-donors-father-in-law-trump-sources-say-2024-05-09/"
  },
  {
    "text": "‘We would need to make choices’: Why Biden is threatening Israel now  —  Biden's announcement is an unintentional admission that his efforts to privately sway Netanyahu have had limited effects.  —  After watching Israel flatten much of Gaza, President Joe Biden decided to draw the line at the city of Rafah.",
    "url": "https://www.politico.com/news/2024/05/09/why-biden-is-threatening-israel-rafah-00157203"
  },
  {
    "text": "Medical residents are starting to avoid states with abortion bans, data shows  —  Isabella Rosario Blum was wrapping up medical school and considering residency programs to become a family practice physician when she got some frank advice: If she wanted to be trained to provide abortions, she shouldn't stay in Arizona.",
    "url": "https://www.npr.org/sections/health-shots/2024/05/09/1250057657/medical-residents-starting-avoid-states-abortion-bans"
  },
  {
    "text": "There's A GOP Plan For An Execution Spree If Trump Wins The White House  —  Buried on page 554 of the plan is a directive to execute every remaining person on federal death row — and dramatically expand the use of the death penalty.  —  LOADING  —  During the final six months … ",
    "url": "https://www.huffpost.com/entry/gop-plan-for-executions-if-trump-wins_n_663b97a7e4b0bcaefbf76812"
  },
  {
    "text": "Biden Set to Impose Tariffs on China EVs, Strategic Sectors  — US set to target electric vehicles, reject across-board hikes  — Action comes after multi-year review of Trump-era duties  —  President Joe Biden's administration is poised to unveil a sweeping decision on China tariffs … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-10/biden-poised-to-impose-tariffs-on-china-evs-strategic-sectors"
  },
  {
    "text": "Shell company steering $2.6 million to Republican PACs raises concerns of illicit funding scheme  —  A complaint with the Federal Election Commission alleges that a corporation with ties to the former chief financial officer of the Republican State Leadership Committee illegally steered nearly $2.6 million … ",
    "url": "https://www.opensecrets.org/news/2024/05/shell-company-steering-millions-to-republican-pacs-raises-concerns-of-illicit-funding-sch"
  },
  {
    "text": "House GOP drafting Biden impeachment articles over Israel aid cutoff threat  —  ‘The House has no choice but to impeach President ‘Quid pro Joe’ Biden,’ says Rep Cory Mills  —  FIRST ON FOX: Rep. Cory Mills, R-Fla., is preparing impeachment articles against President Biden over his threat … ",
    "url": "https://www.foxnews.com/politics/house-gop-drafting-biden-impeachment-articles-israel-aid-cutoff-threat"
  },
  {
    "text": "Back-to-back rulings against Hunter Biden pave way for June gun trial  —  Hunter Biden's latest attempts to throw out his federal gun case were rejected in back-to-back rulings Thursday, teeing up a high-stakes criminal trial next month in Delaware.  —  The president's son had asked … ",
    "url": "https://www.cnn.com/2024/05/09/politics/hunter-biden-gun-charge/"
  },
  {
    "text": "Are R.F.K. Jr. Signature Gatherers Misleading New Yorkers for Ballot Access?  —  More than half a dozen New York City residents described encounters with people seeking their signature who did not make clear that their aim was to place the independent 2024 candidate on the ballot.",
    "url": "https://www.nytimes.com/2024/05/09/us/politics/rfk-signatures-ny.html"
  },
  {
    "text": "Stormy's Courtroom Outfit Had Great Significance  —  ART IMITATES LIFE  —  The jumpsuit she wore on the stand is the same one she donned for a 2021 satirical film in which Donald Trump sells his soul for the presidency.  —  TRAGIC  —  Dr. Kimberly Nix started sharing her cancer journey three years ago … ",
    "url": "https://www.thedailybeast.com/stormy-daniels-wore-her-courtroom-jumpsuit-in-a-2021-trump-bashing-satire-bad-president"
  },
  {
    "text": "Greene's rebellion sparks new talk of consequences for House GOP rebels  —  Possible sanctions include arming the GOP conference with the ability to force a vote on booting hardliners from committees or even ejecting them altogether.",
    "url": "https://www.politico.com/live-updates/2024/05/09/congress/consequences-on-the-table-00157040"
  },
  {
    "text": "Two top Border Patrol officials who partied with Mexican tequila mogul are now under investigation  —  The grandson of the founder of Don Julio tequila wanted to launch a Border Patrol-branded tequila.  Those plans have been scrapped amid an internal CBP probe.",
    "url": "https://www.nbcnews.com/politics/immigration/investigation-border-patrol-officials-partied-mexican-tequila-mogul-rcna150598"
  },
  {
    "text": "Hakeem Jeffries Flexes Power as Mike Johnson Flounders  —  Some Democrats want their leader to take a harder line if they need to rescue the Republican House speaker again  —  WASHINGTON—House Democratic leader Hakeem Jeffries stepped in to save Speaker Mike Johnson this week after months … ",
    "url": "https://www.wsj.com/politics/policy/hakeem-jeffries-flexes-muscles-as-mike-johnson-flounders-57a6ea68"
  },
  {
    "text": "‘Therapy With Hillary’  —  If you want to understand the twisted minds of the Left, you could do worse than watching clips from Morning Joe and The View.  —  Before you say, “Why should I care what those harridans and crazies think?” you should step back for a minute.",
    "url": "https://hotair.com/david-strom/2024/05/09/therapy-with-hillary-n3788073"
  }
]