[
  {
    "text": "Senate Republicans Wound Filibuster To Pass Debt Bomb  —  Republicans used a new budget gimmick to obscure the cost of President Trump's $4 trillion tax and spending bill in a new attack on the Senate's filibuster rules.  —  WASHINGTON — Senate Republicans on Monday rammed through … ",
    "url": "https://www.huffpost.com/entry/big-beautiful-bill-parliamentarian_n_685ab68be4b0ede248bacb32"
  },
  {
    "text": "Here Are the Republican Senators Who May Revolt on Trump's Bill  —  Senate Republicans can afford to lose no more than three of their own votes on the bill, but two already are opposed and others remained undecided.  —  Even as the Senate pressed closer on Monday to a consequential vote … ",
    "url": "https://www.nytimes.com/2025/06/30/us/politics/republican-senators-against-trump-big-bill.html"
  },
  {
    "text": "Anxious House Republicans scramble to forestall Senate's Medicaid cuts  —  Dozens of House Republicans are scrambling behind the scenes to head off the deep Medicaid cuts in the Senate version of the party-line megabill that could pass as soon as tonight.  Group texts are blowing … ",
    "url": "https://www.politico.com/live-updates/2025/06/30/congress/megabill-house-medicaid-cuts-00433488"
  },
  {
    "text": "Trump's ‘big, beautiful bill’ hits another snag in House as conservative caucus raises red flag  —  Members of the conservative House Freedom Caucus are warning they have serious issues with the Senate's version of President Donald Trump's “big, beautiful bill” as it's currently written.",
    "url": "https://www.foxnews.com/politics/house-freedom-caucus-targets-trumps-big-beautiful-bill-concerns-about-budget-deficit"
  },
  {
    "text": "DOJ announces plans to prioritize cases to revoke citizenship  —  The Justice Department is aggressively prioritizing efforts to strip some Americans of their U.S. citizenship.  —  Department leadership is directing its attorneys to prioritize denaturalization in cases involving naturalized citizens … ",
    "url": "https://www.npr.org/2025/06/30/nx-s1-5445398/denaturalization-trump-immigration-enforcement"
  },
  {
    "text": "“Mind-Boggling”: Trump Voters Shocked at How Badly He's Screwing Them  —  It's becoming clearer that many of President Trump's supporters are realizing how badly they're getting shafted by his big budget bill and other leading initiatives.  Senator Mitch McConnell just privately admitted … ",
    "url": "https://newrepublic.com/article/197396/mind-boggling-trump-voters-shocked-badly-he-screwing"
  },
  {
    "text": "Boulder woman, 82, dies from injuries sustained in firebombing attack on Pearl Street Mall  —  An 82-year-old woman has died after a man hurled Molotov cocktails at her during a peaceful demonstration in support of Israeli hostages earlier this month in Boulder, authorities said Monday.",
    "url": "https://coloradosun.com/2025/06/30/boulder-attack-victim-dead-karen-diamond/"
  },
  {
    "text": "Kristi Noem Secretly Took a Cut of Political Donations  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  In 2023, while Kristi Noem was governor of South Dakota, she supplemented her income … ",
    "url": "https://www.propublica.org/article/kristi-noem-political-donations-income-dark-money-dhs-ethics"
  },
  {
    "text": "Judge again delays Abrego Garcia's release from Tennessee jail over deportation concerns  —  Kilmar Abrego Garcia will stay in jail for now over concerns from his lawyers that he could be deported if he's released to await his trial on human smuggling charges, a federal judge in Tennessee ruled Monday.",
    "url": "https://apnews.com/article/abrego-garcia-deportation-immigration-trump-a94b2d9101bb0da10e6998bead07b9c2"
  },
  {
    "text": "‘I wanted to do something to fight back’: This iPhone app alerts users to nearby ICE sightings  —  New York CNN  —  Joshua Aaron has worked in and around the tech industry for around two decades.  He built his first app — a blackjack game — at computer camp when he was 13.",
    "url": "https://cnn.com/2025/06/30/tech/iceblock-app-trump-immigration-crackdown"
  },
  {
    "text": "Sound Familiar?  Democrats Lay Groundwork for a ‘Project 2029’  —  The plan to write a policy agenda for the next Democratic president is at the center of a raging debate within the party: whether its biggest problem is its ideas or its difficulty in selling them.",
    "url": "https://www.nytimes.com/2025/06/30/us/politics/democrats-project-2029.html?unlocked_article_code=1.S08.AukU.tz_FClK0MgbY&smid=url-share"
  },
  {
    "text": "Why Did a 75-Year-Old Man in Poor Health Just Die in ICE Custody?  —  In a notification sent to Congress over the weekend, Immigrations and Customs Enforcement revealed that a 75-year-old Cuban national named Isidro Perez died while in ICE custody on June 26.",
    "url": "https://newrepublic.com/article/197409/cuban-man-dead-ice-custody"
  },
  {
    "text": "American Pride Slips to New Low  —  Pride among Democrats tumbles, while independents also hit new low, more than offsetting increase among Republicans  —  WASHINGTON, D.C. — A record-low 58% of U.S. adults say they are “extremely” (41%) or “very” (17%) proud to be an American … ",
    "url": "https://news.gallup.com/poll/692150/american-pride-slips-new-low.aspx"
  },
  {
    "text": "Alligator Alcatraz immigrant prison camp is Florida's sadistic ‘one-stop shop’ for mass deportation  —  Trump will attend the opening on Tuesday with Gov. DeSantis and DHS Sec. Noem. … The Florida GOP announced via X on Friday: “Feds approve Alligator Alcatraz: Florida's gator-guarded prison for illegal aliens.",
    "url": "https://www.thehandbasket.co/p/alligator-alcatraz-florida-opening-trump-desantis"
  },
  {
    "text": "Scoop: Roy Cooper leans toward N.C. Senate bid, potential Trump showdown  —  North Carolina Democrats are getting closer to the gift they've have been asking for all year, with former Gov. Roy Cooper (D) leaning toward a Senate run in the state President Trump has won three times.",
    "url": "https://www.axios.com/2025/07/01/north-carolina-senate-roy-cooper-lara-trump"
  },
  {
    "text": "Indiana public colleges cut almost 20% of degrees  —  Public Indiana colleges and universities will eliminate 19 percent of their degree programs to meet requirements added to the state's budget, according to the Commission for Higher Education.  —  The institutions volunteered to cut … ",
    "url": "https://www.ipm.org/news-section/2025-06-30/indiana-public-colleges-cut-almost-20-of-degrees"
  },
  {
    "text": "CNN Data Chief Hits Trump With Some ‘Terrible, Terrible, Terrible’ New Numbers  —  Harry Enten said the president's signature “big, beautiful bill” is not at all popular with the public.  —  CNN data chief Harry Enten said President Donald Trump's signature “big, beautiful bill” is historically unpopular with the American public.",
    "url": "https://www.huffpost.com/entry/harry-enten-terrible-trump-numbers_n_68624494e4b0a613dff5dc5b"
  },
  {
    "text": "Team Trump Is Serious About Unleashing the Espionage Act on the Media  —  It is more likely a matter of when, not if, the administration tries to prosecute journalists using the arcane law  —  Donald Trump hates leakers.  He isn't a fan of journalists, either.",
    "url": "https://www.rollingstone.com/politics/politics-features/espionage-act-team-trump-plan-media-1235376198/"
  },
  {
    "text": "US revokes visas for musicians after band leads chants against Israeli military  —  The London-based Bob Vylan duo called for the death of the Israeli military at Glastonbury music festival over the weekend.  —  The State Department has revoked visas for a London-based punk duo set to tour … ",
    "url": "https://www.politico.com/news/2025/06/30/bob-vylan-visas-us-00433131"
  },
  {
    "text": "Violent Settlers Turn on Israeli Military After Attacking Palestinians in West Bank  —  The incident highlights the lack of law and order in parts of the occupied territory  —  Israelis from West Bank settlements have attacked Israel's troops and vandalized military sites in the occupied territory … ",
    "url": "https://www.wsj.com/world/middle-east/west-bank-settlers-turn-on-israeli-military-after-attacking-palestinians-dfd1bd19?st=gbqsHE&reflink=article_copyURL_share"
  },
  {
    "text": "Dear Joe Rogan, Kash Patel Played You  —  I don't know you.  We've never met, and I am not a regular listener of your podcast.  But I have the impression you are a man who does not like to be played.  I regret to inform you that Kash Patel played you.  —  When the FBI director was on your show … ",
    "url": "https://www.motherjones.com/politics/2025/06/joe-rogan-kash-patel-played-you-russia-investigation-trump/"
  },
  {
    "text": "Evans Announces He Won't Seek Re-Election, Will Serve Full Term Ending Jan. 3, 2027  —  Offices will remain open to serve constituents  —  Congressman Dwight Evans (D-PA-3) today announced that he will not seek re-election to the U.S. House of Representatives in 2026, concluding … ",
    "url": "https://evans.house.gov/media/press-releases/evans-announces-he-wont-seek-re-election-will-serve-full-term-ending-jan-3"
  },
  {
    "text": "Gunman set blaze before fatal ambush on Idaho firefighters, police say  —  Two firefighters were killed and one wounded in a prolonged attack near Coeur D'Alene, authorities said.  The body of a suspected gunman was later recovered.  —  Suspected gunman in fatal Idaho ambush found dead",
    "url": "https://www.washingtonpost.com/nation/2025/06/29/firefighters-idaho-attacked/"
  },
  {
    "text": "Paramount, Trump in ‘advanced’ discussions to settle $20 billion lawsuit  —  The parties asked a Texas judge on Monday to pause case deadlines until Thursday as negotiations over the suit play out.  —  Summary162  —  A settlement appears close in President Donald Trump's lawsuit … ",
    "url": "https://www.washingtonpost.com/style/media/2025/06/30/paramount-trump-lawsuit-settlement-talks/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxMjU2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyNjM4Mzk5LCJpYXQiOjE3NTEyNTYwMDAsImp0aSI6IjU3MWYwY2M3LWQxYjgtNDkyOC04YWVkLWRjOWE3NTExZDQ3NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9zdHlsZS9tZWRpYS8yMDI1LzA2LzMwL3BhcmFtb3VudC10cnVtcC1sYXdzdWl0LXNldHRsZW1lbnQtdGFsa3MvIn0.XYfPy0OmE4gElFbhOGwkggS4aNrxmwfjH5BSC0Nx7Mk&itid=gfta"
  },
  {
    "text": "‘60 Minutes’ Draws the Line … While Paramount Global and Donald Trump negotiate behind the scenes with a mediator over a potential settlement that could decide the fate of the historic Hollywood studio, a very different kind of showdown has been unfolding inside the company—one that pits the … ",
    "url": "https://www.status.news/p/60-minutes-paramount-settlement"
  },
  {
    "text": "Trump drops lawsuit against Iowa pollster J. Ann Selzer  —  Lawyers for President Trump have dropped a lawsuit against Iowa pollster J. Ann Selzer and the Des Moines Register, according to a Monday court filing.  —  An attorney for Selzer told NPR that there has been no settlement.",
    "url": "https://thehill.com/regulation/court-battles/5377513-trump-drops-suit-iowa-pollster/"
  },
  {
    "text": "Immigration raids leave crops unharvested, California farms at risk  —  “In the fields, I would say 70% of the workers are gone...most Americans don't want to do this work,” one farmer told Reuters as ICE has frightened off the work mostly done by immigrants, impacting business.",
    "url": "https://www.reuters.com/business/immigration-raids-leave-crops-unharvested-california-farms-risk-2025-06-30/"
  },
  {
    "text": "There's a Race to Power the Future.  China Is Pulling Away.  —  Beijing is selling clean energy to the world, Washington is pushing oil and gas.  Both are driven by national security.  —  By David Gelles in New York; Somini Sengupta in Brasília and in Tirunelveli, India … ",
    "url": "https://www.nytimes.com/interactive/2025/06/30/climate/china-clean-energy-power.html?unlocked_article_code=1.S08.RCe_.yuinSTAhPiWG&smid=url-share"
  },
  {
    "text": "National Health Care Fraud Takedown Results in 324 Defendants Charged in Connection with Over $14.6 Billion in Alleged Fraud  —  For Immediate Release  —  Largest Justice Department Health Care Fraud Takedown in History  —  More than Doubles Prior Record of $6 Billion",
    "url": "https://www.justice.gov/opa/pr/national-health-care-fraud-takedown-results-324-defendants-charged-connection-over-146"
  },
  {
    "text": "Bush, Obama and Bono Commend USAID Staff Members on Their Last Day  —  Two ex-presidents and a rock star thanked the outgoing workers of a doomed agency.  —  As most staff members at the U.S. Agency for International Development marked their final day with the agency, they got thanks from two presidents and a rock star.",
    "url": "https://www.nytimes.com/2025/06/30/us/politics/usaid-staff-obama-bush-bono.html"
  },
  {
    "text": "We're All Rats Now  —  Time to take a stand, again, against racism  —  Zohran Mamdani's upset victory in New York's Democratic primary has created panic in MAGAland.  Stephen Miller, the architect of Donald Trump's deportation policies, waxed apocalyptic:",
    "url": "https://paulkrugman.substack.com/p/were-all-rats-now"
  },
  {
    "text": "Trump signs executive order lifting sanctions on Syria  —  He had previously announced he would do so in hopes of stabilizing the country.  —  President Donald Trump speaks during a meeting with Democratic Republic of the Congo's Foreign Minister Therese Kayikwamba Wagner … ",
    "url": "https://abcnews.go.com/Politics/trump-signs-executive-order-lifting-sanctions-syria/story?id=123349843"
  },
  {
    "text": "Is Zohran Mamdani a Lifelong Socialist?  —  The New York City mayoral candidate is trying to soft-sell his radicalism.  —  Zohran Mamdani claims that he didn't really identify as a democratic socialist until after Bernie Sanders's 2016 presidential campaign, when he was 25 years old.  I'm skeptical.",
    "url": "https://www.nationalreview.com/2025/06/is-zohran-mamdani-a-lifelong-socialist/"
  }
]