[
  {
    "text": "Republican Plan to Avoid Shutdown Fails in the House  —  Where Things Stand  — The House rejected a new Republican proposal to avert a shutdown, a day after President-elect Donald J. Trump torpedoed a spending deal that House Speaker Mike Johnson had struck with Democrats.",
    "url": "https://www.nytimes.com/live/2024/12/19/us/trump-spending-government-shutdown"
  },
  {
    "text": "Republicans Cut Child Cancer Research From Funding Bill After Musk's Meddling  —  The House GOP has been in a state of chaos after the billionaire led a campaign to kill a bipartisan funding bill  —  Less than 48 hours before defaulting and triggering a shutdown, Congress is still scrambling … ",
    "url": "https://www.rollingstone.com/politics/politics-news/gop-cuts-child-cancer-research-funding-bill-musk-1235212295/"
  },
  {
    "text": "The GOP Is Treating Musk Like He's in Charge  —  This week, the world's richest person solidified his influence over American politics.  —  Yesterday, a tantrum from the world's richest person swayed events in Congress.  First, Elon Musk launched a blizzard of X posts denouncing … ",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/12/the-gop-is-treating-musk-like-hes-in-charge/681117/"
  },
  {
    "text": "House GOP drops PBM reforms in scaled-down spending bill  —  House Republicans have abandoned language to rein in the pharmacy benefit manager (PBM) industry from a new government funding bill released late Thursday.  —  Leaders earlier this week agreed to PBM reforms as part of a sweeping health package … ",
    "url": "https://thehill.com/policy/healthcare/5049676-house-republicans-drop-pbm-reform/amp/"
  },
  {
    "text": "GOP strikes a new spending deal  —  Republicans have struck a deal on a short-term government spending patch and potential debt limit increase, according to two GOP lawmakers meeting in Speaker Mike Johnson's office Thursday afternoon.  “There is an agreement,” said Rep. Stephanie Bice (R-Okla.).",
    "url": "https://www.politico.com/live-updates/2024/12/19/congress/gop-strikes-a-new-spending-deal-00195410"
  },
  {
    "text": "Trump team affirms he's leader of GOP amid ‘President Musk’ barbs  —  President-elect Trump's transition team pushed back against Democratic lawmakers who suggested Elon Musk is the “real leader” of the Republican Party after his aggressive pressure campaign against a stopgap spending measure.",
    "url": "https://thehill.com/policy/technology/5049293-trump-musk-republican-party/"
  },
  {
    "text": "Shutdown threatens ‘chaos’ for Trump's transition and inauguration  —  Transition “landing teams” were already delayed and may now lose access to the staffers briefing them.  —  The collapse of Congress' spending negotiations is throwing the presidential transition and preparations … ",
    "url": "https://www.politico.com/news/2024/12/19/shutdown-trump-transition-chaos-00195393"
  },
  {
    "text": "Trump-backed funding bill fails as government shutdown looms  —  A bill to avert a government shutdown failed on the House floor Thursday night, after Democrats and conservatives rebelled against Speaker Mike Johnson's new Donald Trump-backed spending plan.  The measure went down decisively … ",
    "url": "https://www.politico.com/live-updates/2024/12/19/congress/government-shutdown-house-vote-00195479"
  },
  {
    "text": "Republicans scramble for a path forward after spending plan collapse  —  House Republican leaders planned to work through the night and into Friday on a Plan C for funding the government, after abandoning their deal with Democrats and failing to pass an alternative backed by President-elect Donald Trump.",
    "url": "https://www.politico.com/live-updates/2024/12/19/congress/republicans-scramble-for-plan-c-00195514"
  },
  {
    "text": "Biden keeps quiet as Washington spirals into shutdown chaos  —  Democratic lawmakers haven't heard from the president.  —  Joe Biden may still occupy the Oval Office, but it's clearer than ever that he's no longer in charge of Washington.  —  More than a half-dozen House Democratic lawmakers … ",
    "url": "https://www.politico.com/news/2024/12/19/biden-democrats-shutdown-trump-musk-00195448"
  },
  {
    "text": "Here's What Could Happen in a Government Shutdown  —  With a funding deadline approaching, workers are bracing for the possibility of a disruptive holiday season, which could include longer wait times for travelers.  —  There have been more than 20 gaps in federal government funding since 1976 … ",
    "url": "https://www.nytimes.com/2024/12/19/us/politics/government-shutdown-funding.html"
  },
  {
    "text": "How every House member voted on the failed attempt to avoid a shutdown  —  Opposes 235  —  Supports 174 Did not vote 20  —  Present 1  —  The House failed to fund the government in a vote Thursday evening, increasing the likelihood of a government shutdown beginning Saturday.",
    "url": "https://www.washingtonpost.com/politics/interactive/2024/12/19/house-vote-government-shutdown-funding/"
  },
  {
    "text": "GA appeals court disqualifies DA Fani Willis from Trump election case, lets indictment stand … A Georgia appeals court on Thursday disqualified Fulton County District Attorney Fani Willis from overseeing the criminal election interference prosecution of President-elect Donald Trump and other defendants.",
    "url": "https://www.cnbc.com/2024/12/19/trump-georgia-da-fani-willis-disqualified.html"
  },
  {
    "text": "How Liberal America Came to Its Senses … A decade ago, cultural norms in elite American institutions took a sharply illiberal turn.  Professors would get disciplined, journalists fired, ordinary people harassed by social-media mobs, over some decontextualized phrase or weaponized misunderstanding.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/12/cancel-culture-illiberalism-dead/681031/"
  },
  {
    "text": "U.S. Files Murder Charge Against Mangione That Could Bring Death Penalty  —  Federal authorities filed a total of four counts against Luigi Mangione, who is accused of killing Brian Thompson, the chief executive of UnitedHealthcare.  —  Federal prosecutors on Thursday unsealed a murder case … ",
    "url": "https://www.nytimes.com/2024/12/19/nyregion/luigi-mangione-federal-charges.html"
  },
  {
    "text": "Jeff Bezos and Donald Trump met for dinner at Mar-a-Lago, joined by Elon Musk  —  After feuds during Trump's first term, Trump and Bezos have both noted their recent evolving relationship.  —  President-elect Donald Trump had dinner Wednesday with Amazon founder Jeff Bezos … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/19/trump-bezos-musk-dinner/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM0NTg0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM1OTY2Nzk5LCJpYXQiOjE3MzQ1ODQ0MDAsImp0aSI6IjU1NTE1YjRiLTdiMGYtNDM2OS05NTZjLTBhNjQwMjU1MGNiMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEyLzE5L3RydW1wLWJlem9zLW11c2stZGlubmVyLyJ9.Zlti6VTMhsU7lsOF-ROnULsEFtdy5SXLnlyTrCr6syI&itid=gfta"
  },
  {
    "text": "GOP lawmakers prepare to carry out Gaetz's revenge, expose harassment settlements  —  Former Rep. Matt Gaetz, the focus of a House Ethics Committee report that may soon become public, is planning to inflict fresh pain on some of his old colleagues.  A number of Republican lawmakers are preparing to help.",
    "url": "https://www.politico.com/live-updates/2024/12/19/congress/gaetzs-revenge-00195398"
  },
  {
    "text": "Alaska governor asks Trump to roll back restrictions on oil and gas drilling  —  Alaska Gov. Mike Dunleavy's wish list for the incoming Trump administration includes oil and gas exploration in the pristine Arctic National Wildlife Refuge and reversing restrictions on logging and road-building … ",
    "url": "https://apnews.com/article/alaska-governor-dunleavy-trump-arctic-refuge-a9cc44a5f80489d89579ef68a0f5af01"
  },
  {
    "text": "Top aide to Eric Adams indicted on bribery and conspiracy charges  —  The aide's son and two developers were also charged.  —  NEW YORK — Prosecutors charged New York City Mayor Eric Adams' closest confidant in a conspiracy, bribery and money laundering case Thursday.",
    "url": "https://www.politico.com/news/2024/12/19/ingrid-lewis-martin-indicted-new-york-eric-adams-aide-00195366"
  },
  {
    "text": "The Supreme Court's new abortion case should be an easy win for Planned Parenthood  —  Although nothing is ever certain in this Supreme Court. … The question in Kerr is whether a federal law, which requires state Medicaid programs to guarantee that “any individual eligible for medical assistance” … ",
    "url": "https://www.vox.com/scotus/392073/supreme-court-planned-parenthood-kerr-medicaid-abortion"
  }
]