[
  {
    "text": "Rep. Jared Moskowitz calls for Palm Beach County to tax Mar-a-Lago at rate Trump claims it's worth  —  Trump has claimed his Florida resort is worth as much as $1.5 billion, but the Palm Beach County property appraiser valued it far lower.  —  A Democratic House member is asking Palm Beach County … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/rep-jared-moskowitz-calls-palm-beach-county-tax-mar-lago-rate-trump-cl-rcna119042"
  },
  {
    "text": "Trump would accept House speakership for a ‘short period’ while Republicans decide on a permanent replacement  —  Trump told Fox News Digital he would serve as a ‘unifier’ until Republicans can rally around a new speaker  —  EXCLUSIVE: Former President Trump told Fox News Digital … ",
    "url": "https://www.foxnews.com/politics/trump-accept-speakership-for-short-period-republicans-decide-permanent-replacement"
  },
  {
    "text": "GOP knives out for Nancy Mace  —  The South Carolinian's move to join seven hardliners in ousting Kevin McCarthy is confusing her colleagues about her political persona — and prompting active calls for revenge.  —  Seven of the eight Republicans who voted to sink Kevin McCarthy's speakership were longtime conservative critics.",
    "url": "https://www.politico.com/news/2023/10/05/the-gop-unsheathes-its-knives-for-nancy-mace-00120118"
  },
  {
    "text": "Trump allegedly discussed US nuclear subs with foreign national after leaving White House: Sources  —  Trump allegedly discussed the information with an Australian billionaire.  —  Months after leaving the White House, former President Donald Trump allegedly discussed potentially sensitive information … ",
    "url": "https://abcnews.go.com/US/after-white-house-trump-allegedly-discussed-potentially-sensitive/story?id=103760456"
  },
  {
    "text": "Man with handgun seeking governor arrested in Wisconsin Capitol, returns with assault rifle  —  A man illegally brought a loaded handgun into the Wisconsin Capitol, demanding to see Gov. Tony Evers, and returned at night with an assault rifle after posting bail, a spokesperson for the state said Thursday.",
    "url": "https://apnews.com/article/wisconsin-governor-handgun-threat-85f3a2f9fe73b505660b4f552a94cbb4"
  },
  {
    "text": "Twitter Is at Death's Door, One Year After Elon Musk's Takeover  —  Since the tech tycoon took over the platform last October, he's done everything he can to run it into the ground … Following a $44 billion acquisition he tried to scuttle but was legally forced into closing … ",
    "url": "https://www.rollingstone.com/culture/culture-commentary/elon-musk-killed-twitter-one-year-1234840622/"
  },
  {
    "text": "Biden administration reverses course, clears way for new border wall by waiving environmental laws  —  The Biden administration has paved the way for the construction of a new wall along the southern border in Texas by waiving more than a dozen federal laws in a stark reversal of its previous stance on the physical barrier.",
    "url": "https://nypost.com/2023/10/05/biden-administration-reverses-course-clears-way-for-new-border-wall/"
  },
  {
    "text": "GOP aims fire at Gaetz after McCarthy ouster  —  House Republicans are aiming their fire at Rep. Matt Gaetz (R-Fla.) after the congressman staged a successful effort to oust Rep. Kevin McCarthy (R-Calif.) as Speaker, sharply criticizing the Florida Republican for teaming up with Democrats … ",
    "url": "https://thehill.com/homenews/house/4239332-gop-aims-fire-at-gaetz-after-mccarthy-ouster/"
  },
  {
    "text": "The GOP's revenge plot against Pelosi is unhinged — but revealing  —  Because Republicans are such firm believers in benevolence toward political foes, they are furious with Democrats for failing to save Kevin McCarthy.  After Democrats voted en masse this week to remove the California Republican … ",
    "url": "https://www.washingtonpost.com/opinions/2023/10/05/house-gop-speaker-jim-jordan-maga-trump-ukraine-aid/"
  },
  {
    "text": "US public support declines for arming Ukraine, Reuters/Ipsos poll shows  —  Support is falling among Americans of both major political parties for supplying Ukraine with weapons, a warning sign for Kyiv, which relies heavily on U.S. arms to fight against a Russian invasion, according to a new Reuters/Ipsos poll.",
    "url": "https://www.reuters.com/world/us/us-public-support-declines-arming-ukraine-reutersipsos-2023-10-05/"
  },
  {
    "text": "Steve Scalise Launched House Speaker Bid Before Kevin McCarthy's ‘Body Was Cold’ (Exclusive)  —  ‘Sounds like he saw the writing on the wall and jumped into motion,’ one GOP aide told The Messenger  —  A Facebook icon representing an external link to share the article on Facebook … ",
    "url": "https://themessenger.com/politics/steve-scalise-launched-house-speaker-bid-before-kevin-mccarthys-body-was-cold-exclusive"
  },
  {
    "text": "Alabama gets new congressional map that could yield Democrats a second seat in the state  —  A federal court on Thursday approved a new congressional map in Alabama that significantly boosts the Black population of a second district and could represent a pickup opportunity for Democrats in next year's elections.",
    "url": "https://www.cnn.com/2023/10/05/politics/alabama-congressional-map-ruling/"
  },
  {
    "text": "Ramaswamy's car rammed by protesters in Iowa  —  The Republican presidential candidate was not in the vehicle at the time.  —  Protesters ran their vehicle into Republican presidential candidate Vivek Ramaswamy's car during a campaign stop in Grinnell, Iowa, on Thursday, his campaign confirmed to POLITICO.",
    "url": "https://www.politico.com/news/2023/10/05/ramaswamy-car-rammed-by-protesters-iowa-00120251"
  },
  {
    "text": "Why Trump and the Rest of the G.O.P. Won't Stop Bashing Electric Vehicles  —  The industry's transition to battery power is already underway.  Republican presidential candidates are pushing to reverse course.  —  Fresh off a walking tour of blighted Flint, Mich., on Wednesday … ",
    "url": "https://www.nytimes.com/2023/10/05/us/politics/republican-trump-electric-vehicles.html"
  },
  {
    "text": "How Kevin McCarthy Set Up His Big Fail 14 Years Ago  —  The deposed House speaker saw a quick path to power.  It cost him in the end.  —  On April 15, 2009, Rep. Kevin McCarthy, the California Republican, brought Rep. John Boehner of Ohio, the leader of the House GOP caucus, to a rally in his home town of Bakersfield.",
    "url": "https://www.motherjones.com/politics/2023/10/how-kevin-mccarthy-tea-party-trump/"
  },
  {
    "text": "Trump considering trip to Congress before speakership election  —  The former president is open to pitching himself as a speaker candidate, according to a Republican familiar with internal discussions.",
    "url": "https://www.politico.com/live-updates/2023/10/05/congress/trump-plans-trip-to-hill-00120160"
  },
  {
    "text": "George Santos' Ex-Campaign Treasurer Will Plead Guilty to Felony, Prosecutors Say  —  The ex-campaign treasurer for U.S. Rep. George Santos will plead guilty on Thursday to an unspecified felony in connection with the sprawling federal investigation of financial irregularities surrounding … ",
    "url": "https://www.bloomberg.com/en/news/thp/2023-10-05/urgent-prosecutors-say-former-george-santos-campaign-treasurer-will-plead-guilty-to-unspecified-charge"
  },
  {
    "text": "Adam Frisch reported a massive nearly $3.4 million third quarter haul in his second bid to defeat Lauren Boebert.  —  That's a bigger tally than many Senate candidates took in during the same period.",
    "url": "https://www.politico.com/live-updates/2023/10/05/congress/boebert-challengers-big-haul-00120158"
  },
  {
    "text": "Turkish official says ground operation into Syria an option after bombing  —  The United States on Thursday shot down an armed Turkish drone that was operating near its troops in Syria, the Pentagon said, the first time Washington has brought down an aircraft of NATO ally Turkey.",
    "url": "https://www.reuters.com/world/turkish-officials-says-ground-operation-into-syria-an-option-after-bombing-2023-10-05/"
  },
  {
    "text": "FBI arrests redheaded cosplayer dubbed 'Conan O'Riot' by Jan. 6 sleuths  —  Derek Nelson, a former U.S. Marine and Conan O'Brien lookalike, wore goggles and a respirator as rioters tried to breach the House floor during Capitol attack, the feds say.  —  WASHINGTON — An alleged Jan. 6 participant … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-arrests-redheaded-cosplayer-dubbed-conan-oriot-jan-6-sleuths-rcna118948"
  }
]