[
  {
    "text": "Pennsylvania conservatives panicked Trump is ‘not even trying’ to win key voting bloc  —  Conservatives in Pennsylvania are growing increasingly alarmed that Donald Trump is not making a concerted effort to win the state's 19 Electoral College votes which could mean the difference between … ",
    "url": "https://www.rawstory.com/trump-pennsylvania-2668983435/"
  },
  {
    "text": "Trump 'might win, but he's not a majority candidate': Brit Hume  —  Fox News chief political analyst Brit Hume on Sunday argued that while former President Trump could win the November election, voters' dislike of him makes him “not a majority candidate.”  —  When asked on “Fox News Sunday” … ",
    "url": "https://thehill.com/homenews/campaign/4833904-donald-trump-not-majority-candidate-brit-hume/"
  },
  {
    "text": "Harris' momentum is growing.  Our polling expert explains whether it'll last.  —  Candidates who end the conventions on the upswing typically see that momentum continue through to Election Day.  —  Kamala Harris stole Donald Trump's Republican convention bounce.",
    "url": "https://www.politico.com/news/2024/08/18/harris-trump-polls-dnc-00174532"
  },
  {
    "text": "Harris implies Trump a ‘coward’ during Pennsylvania campaign appearance  —  U.S. Vice President Kamala Harris indirectly criticized former President Donald Trump on Sunday, suggesting her opponent in the Nov. 5 election was a “coward” whose politics focused on putting down rivals.",
    "url": "https://www.reuters.com/world/us/harris-campaigns-swing-state-pennsylvania-en-route-chicago-convention-2024-08-18/"
  },
  {
    "text": "Sunday Meltdown: Trump Floods Truth Social With Photos of Swifties and Communists  —  ‘TEARS FLOWING’  —  On the eve of the Democratic National Convention, with his rival leading in the polls nationally and in most key battleground states, the former president is posting through it.",
    "url": "https://www.thedailybeast.com/sunday-meltdown-trump-floods-truth-social-with-ai-images-of-swifties-and-communists"
  },
  {
    "text": "DNC lineup: Who's speaking and what to expect … - Monday, “For the People”: Biden and Dr. Jill Biden speak, along with former Secretary of State Hillary Clinton and a welcome from Chicago Mayor Brandon Johnson.  — Tuesday, “A Bold Vision for America's Future”: Former President Obama … ",
    "url": "https://www.axios.com/2024/08/18/dnc-speaker-schedule-obama-biden"
  },
  {
    "text": "Former GOP Rep. Barbara Comstock says she's voting for Harris  —  Former Republican Rep. Barbara Comstock (Va.) said she will vote for Vice President Harris for president on Sunday, marking the latest former GOP member to break from the party's support of former President Trump.",
    "url": "https://thehill.com/homenews/campaign/4834130-former-gop-rep-barbara-comstock-says-shes-voting-for-harris/"
  },
  {
    "text": "Former GOP Rep. Barbara Comstock says she'll vote for Kamala Harris  —  She clashed with former president Donald Trump throughout her tenure in the U.S. House.  —  Former Republican congresswoman Barbara Comstock endorsed Kamala Harris's presidential bid on Sunday, joining another former … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/18/barbara-comstock-vote-kamala-harris/"
  },
  {
    "text": "FBI arrests D.C. Council member Trayon White  —  The nature of the allegations against White, a Democrat representing Ward 8, were not immediately clear.  The FBI declined to comment.  —  The FBI arrested D.C. Council member Trayon White Sr. on Sunday, according to the council's chairman … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/08/18/trayon-white-dc-arrested-fbi/"
  },
  {
    "text": "Secret Service finds protecting Trump is extraordinarily challenging  —  Trump's team has complained in the wake of an assassination attempt that earlier requests for additional resources had been denied, while agency officials say he receives a heavier level of security than any other former president.",
    "url": "https://www.washingtonpost.com/politics/2024/08/19/trump-secret-service-assassination-security/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzOTUzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MzM1OTk5LCJpYXQiOjE3MjM5NTM2MDAsImp0aSI6ImRiOTU4MmMyLWE1ZmItNDljMC04NzhlLTA5ZjExYTUwMDFlZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzE5L3RydW1wLXNlY3JldC1zZXJ2aWNlLWFzc2Fzc2luYXRpb24tc2VjdXJpdHkvIn0.t2pmoAQ10wV-EUNrzBV33tgOhlzSw3-VbVsV7peMPPM&itid=gfta"
  },
  {
    "text": "Election Deniers Secretly Pushed Rule That Would Make It Easier to Delay Certification of Georgia's Election Results  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.",
    "url": "https://www.propublica.org/article/georgia-election-board-vote-certification"
  },
  {
    "text": "Republicans flood TV with misleading ads about immigration, border  —  Turn on reduced motion Scroll to continue  —  Throughout the year, American airwaves were inundated by campaign advertising mentioning immigration, placing the issue at the center of this year's elections.",
    "url": "https://www.washingtonpost.com/elections/interactive/2024/republican-campaign-ads-immigration-border-security/"
  },
  {
    "text": "Democrats' Unity Convention Has One Giant Exception: The Gaza War  —  Harris campaign officials and Democratic leaders have stepped up outreach to Arab and Jewish voters before the event, but large protests are still expected.  —  Even as feel-good displays of joy and confidence are set … ",
    "url": "https://www.nytimes.com/2024/08/18/us/politics/dnc-democrats-israel-gaza.html"
  },
  {
    "text": "McCarthy's last flop … - Rep. Matt Gaetz (R-Fla.) is expected to win easily on Tuesday despite a McCarthy-linked PAC spending more than $3 million against him.  — “McCarthy thinks about me a lot more than I think about him,” Gaetz told us. … - “[W]hen you leave, you should go off to do the next thing you're going to do.",
    "url": "https://www.axios.com/2024/08/18/kevin-mccarthy-house-speaker-gaetz-elections"
  },
  {
    "text": "The 47 Seconds That Saved Kamala Harris's Political Career  —  Nearly 14 years ago, Kamala Harris's opponent in the California attorney general's race gave an answer at a little-watched debate that was frank — and fateful for the future Democratic presidential nominee.",
    "url": "https://www.nytimes.com/2024/08/18/us/politics/kamala-harris-2010-debate.html"
  },
  {
    "text": "Whitmer says people ‘reading too much’ into price-gouging plan specifics  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4833272-whitmer-says-people-reading-too-much-into-price-gouging-plan-specifics/"
  }
]