[
  {
    "text": "Donald Trump's thrill ride is nearly over — but the media refuses to let go  —  What if we told America the truth about Donald Trump?  He's a fraud, a cheat and a rapist, facing 91 felony counts … I take no joy in saying this, but we in the press are moral cowards.",
    "url": "https://www.salon.com/2023/09/28/donald-thrill-ride-is-nearly-over--but-the-media-wont-let-him-go/"
  },
  {
    "text": "Trump suing ex-MI6 officer who alleged he was ‘compromised’ by Russian security service  —  Christopher Steele's dossier also alleged Putin ‘supported and directed’ plan to ‘cultivate’ Trump as a presidential candidate  —  Donald Trump is suing a former MI6 officer and the intelligence consultancy … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/28/trump-suing-ex-mi6-officer-who-alleged-he-was-compromised-by-russian-security-service"
  },
  {
    "text": "Republican Group Running Anti-Trump Ads Finds Little Is Working  —  With over 40 ads and $6 million spent, a group tied to the Club for Growth is no closer to an answer, a memo to donors says.  Some ads even gave Donald Trump a boost.  —  A well-funded group of anti-Trump conservatives … ",
    "url": "https://www.nytimes.com/2023/09/28/us/politics/anti-trump-ads-memo.html"
  },
  {
    "text": "BREAKING: Trump will not seek to move Fulton case to federal court  —  X  —  In a surprise move, former President Donald Trump has decided not to seek to move his criminal trial from Fulton County to federal court, his lawyer said Thursday.  —  In a two-page notice filed in Fulton County … ",
    "url": "https://www.ajc.com/news/breaking-trump-will-not-seek-to-move-fulton-case-to-federal-court/B64PLR4I5ZCK3JQRSPLJMOSAIE/"
  },
  {
    "text": "Alarmed Republicans are preparing to draft Glenn Youngkin  —  Robert Costa is the chief election and campaign correspondent for CBS News.  —  Some of the biggest Republican donors in the country will converge next month at the historic Cavalier Hotel in Virginia Beach for a two-day meeting to rally behind Gov. Glenn Youngkin.",
    "url": "https://www.washingtonpost.com/opinions/2023/09/28/draft-glenn-youngkin-2024-gop-donors/"
  },
  {
    "text": "Appeals Court Rejects Trump's Effort to Delay Trial in Fraud Case  —  Former President Donald J. Trump had sued the judge presiding over his case, Arthur F. Engoron, aiming to pause a trial that will likely begin as soon as Monday.  —  Donald J. Trump's civil fraud trial over accusations … ",
    "url": "https://www.nytimes.com/2023/09/28/nyregion/trump-fraud-judge-appeal.html"
  },
  {
    "text": "House GOP passes Pentagon funding bill after failed tries  —  House Republicans late Thursday night approved legislation to fund the Department of Defense for fiscal year 2024, a success for GOP leaders after they decided to strip Ukraine funding from the legislation following two failed procedural votes.",
    "url": "https://thehill.com/policy/defense/4229374-house-gop-passes-pentagon-funding-bill-after-failed-tries/"
  },
  {
    "text": "Hard-liners plot to replace McCarthy with a deputy as shutdown looms  —  A contingent of far-right House Republicans are plotting an attempt to remove Kevin McCarthy as House speaker as early as next week, a move that would throw the chamber into further disarray in the middle … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/28/kevin-mccarthy-tom-emmer-government-shutdown-motion-vacate/"
  },
  {
    "text": "Second Republican primary debate had the lowest TV viewership since 2015  —  Wednesday's debate had the lowest TV viewership of any Republican presidential debate since 2015.  —  When it comes to debates, the question of ratings is usually little more than a curiosity.",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/second-republican-primary-debate-lowest-tv-viewership-2015-rcna117955"
  },
  {
    "text": "Viewership Fell Sharply for Second G.O.P. Debate  —  Fewer than 10 million people watched the Republican presidential candidates on Wednesday, according to preliminary data from Nielsen.  —  Fewer than 10 million people watched the Republican presidential debate on Wednesday night … ",
    "url": "https://www.nytimes.com/2023/09/28/business/media/republican-debate-ratings.html"
  },
  {
    "text": "‘Botched this bad’: Insiders say GOPers furious at James Comer for his handling of impeachment inquiry  —  WASHINGTON — Republicans are growing more and more frustrated with the House Oversight Committee's impeachment hearing, with some beginning to admit it has been a failure.",
    "url": "https://www.rawstory.com/republicans-furious-biden-impeachment-flop/"
  },
  {
    "text": "First Impeachment Hearing Yields No New Information on Biden  —  In a chaotic session, Republicans accused the president of crime and corruption, but even their witnesses said the case for impeachment hadn't been made.  —  The first hearing in House Republicans' impeachment inquiry … ",
    "url": "https://www.nytimes.com/2023/09/28/us/politics/biden-impeachment-hearing.html"
  },
  {
    "text": "Trump and his sons will plead the Fifth in civil fraud trial: Watergate prosecutor  —  Former President Donald Trump and his adult sons will be facing trial for civil fraud in a matter of days — and the clear facts of the case have already been decided, with Judge Arthur Engoron finding … ",
    "url": "https://www.rawstory.com/trump-plead-the-fifth/"
  },
  {
    "text": "Kari Lake and Pro-DeSantis ‘Reporter’ Get Into Screaming Match at GOP Debate  —  Before the candidates hit the debate stage Wednesday, there was another debate between Kari Lake and pro-Ron DeSantis reporter Chris Nelson.  —  When an ardently pro-Ron DeSantis “journalist” … ",
    "url": "https://www.thedailybeast.com/kari-lake-and-pro-desantis-reporter-chris-nelson-get-into-screaming-match-at-gop-debate"
  },
  {
    "text": "Ojai, CA Becomes First U.S. City To Recognize Legal Rights Of Elephants  —  Ordinance gives elephants the right to liberty in Ojai  —  The Ojai City Council voted 4-1 on Wednesday to recognize the legal rights of elephants, becoming the first city in the United States to give legal rights to a non-human animal.",
    "url": "https://californiaglobe.com/fr/ojai-ca-becomes-first-u-s-city-to-recognize-legal-rights-of-elephants/"
  },
  {
    "text": "The biggest loser of last night's debate was ...  ... not any of the seven candidates on the stage.  It wasn't even one of the candidates who weren't on the stage — Donald Trump, Asa Hutchinson, and an assortment of also rans.  The biggest loser of the debate was Fox Business Channel, with the RNC that arranged it a close runner-up.",
    "url": "https://hotair.com/ed-morrissey/2023/09/28/the-biggest-loser-of-last-nights-debate-was-n581045"
  },
  {
    "text": "‘GOP hates Gen Z’: Teens arrested after storming McCarthy's office to protest shutdown  —  Dozens of teens stormed House Speaker Kevin McCarthy's office Thursday morning, urging him to come to an agreement with congressional Republicans to stave off a partial shutdown of the federal government.",
    "url": "https://www.usatoday.com/story/news/politics/2023/09/28/kevin-mccarthy-office-stormed-by-teens-protesting-government-shutdown/70991919007/"
  },
  {
    "text": "Paxton, Yelp sue each other over crisis pregnancy center descriptions  —  Yelp and Texas Attorney General Ken Paxton (R) are suing each other over how the company described pregnancy centers in the months after the Supreme Court decision Dobbs v. Jackson Women's Health Organization.",
    "url": "https://thehill.com/homenews/state-watch/4229336-paxton-yelp-sue-each-other-over-crisis-pregnancy-center-descriptions/"
  }
]