[
  {
    "text": "Homeland Security cops handcuff one of Rep. Nadler's aides in chaotic day at NY fed building … We rely on your support to make local news available to all  —  Make your contribution now and help Gothamist thrive in 2025.  Donate today  —  Gothamist is funded by sponsors and member donations",
    "url": "https://gothamist.com/news/homeland-security-cops-handcuff-one-of-rep-nadlers-aides-in-chaotic-day-at-ny-fed-building"
  },
  {
    "text": "Gabbard considering ways to revamp Trump's intelligence briefing  —  One idea is to make the briefing, which according to his schedule Trump has been taking less often than his predecessors, a video that looks like Fox News.  —  WASHINGTON — President Donald Trump's intelligence chief … ",
    "url": "https://www.nbcnews.com/politics/national-security/gabbard-considering-ways-revamp-trumps-intelligence-briefing-rcna209805"
  },
  {
    "text": "Universities quietly negotiating with White House aide to try to avoid Harvard's fate, source says  —  College and university leaders have been privately negotiating with a deputy to top Trump aide Stephen Miller in hopes of avoiding the same aggressive targeting of Harvard University … ",
    "url": "https://cnn.com/2025/05/31/politics/universities-negotiate-trump-administration-harvard"
  },
  {
    "text": "Trump Administration Ends Program Critical to Search for an H.I.V. Vaccine  —  The termination is the latest in a series of cuts to H.I.V. research and programs to prevent the disease.  —  The Trump administration has dealt a sharp blow to work on H.I.V. vaccines, terminating … ",
    "url": "https://www.nytimes.com/2025/05/30/health/trump-hiv-cuts.html?unlocked_article_code=1.LU8.uQEc.MIVxYO7DC1Oz&smid=url-share"
  },
  {
    "text": "‘Devastating.’ NIH cancels future funding plans for HIV vaccine consortia  —  Researchers decry agency's decision just as new leads reinvigorate search for long-sought vaccine  —  Skip backwardsGo ten seconds backward Skip forwardsGo ten seconds forward  —  Audio is AI-generated.  Report an issue|",
    "url": "https://www.science.org/content/article/devasting-nih-cancels-future-funding-plans-hiv-vaccine-consortia"
  },
  {
    "text": "Business owners confront ICE agents during arrest at Great Barrington job site  —  ‘I felt like I was in North Korea’  —  GREAT BARRINGTON — Federal agents arrested one of two men at their landscaping job site on Friday morning, but their clients confronted the agents and prevented the second man from being taken into custody.",
    "url": "https://www.berkshireeagle.com/news/southern_berkshires/ice-arrests-berkshires-great-barrington/article_f90f2550-5409-46c9-93a2-5d8daab8c82f.html"
  },
  {
    "text": "Inside Trump and Musk's Complicated Relationship  —  The president and his aides have sometimes expressed frustration with Musk, but his advisers say the two remain close  —  WASHINGTON—President Trump recently posed an evocative question to his advisers about billionaire Elon Musk's promise … ",
    "url": "https://www.wsj.com/politics/policy/trump-elon-musk-relationship-64773ad1?st=2tUToc&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Wall Street warns Trump aides the GOP tax bill could jolt bond markets  —  White House officials maintain bankers' concerns are overstated and discount expected revenues from the president's tariffs.  —  Wall Street bankers and executives are privately warning the Trump administration … ",
    "url": "https://www.washingtonpost.com/business/2025/05/31/wall-street-warns-trump-tax-bill/"
  },
  {
    "text": "A court halted his deportation.  The Trump administration deported him 28 minutes later.  —  Officials blamed “administrative errors.”  It's the fourth known case of an improper deportation by the Trump administration.  —  The Trump administration has admitted that it improperly deported another immigrant … ",
    "url": "https://www.politico.com/news/2025/05/30/trump-administration-deports-fourth-immigrant-court-order-violation-00378173"
  },
  {
    "text": "Trump fires director of the Smithsonian's National Portrait Gallery  —  President Trump is terminating the head of the Smithsonian Institution's National Portrait Gallery, continuing his aggressive moves to reshape the federal government's cultural institutions.",
    "url": "https://www.cbsnews.com/news/trump-fires-director-smithsonian-national-portrait-gallery-kim-sajet/"
  },
  {
    "text": "World Scientists Look Elsewhere as U.S. Labs Stagger Under Trump Cuts  —  With the welcome mat withdrawn for promising researchers from around the world, America is at risk of losing its longstanding pre-eminence in the sciences.  —  For decades, Bangalore, India, has been an incubator … ",
    "url": "https://www.nytimes.com/2025/05/31/world/asia/us-science-cuts.html?unlocked_article_code=1.LU8.w6OF.wvhLqnzkLZx2&smid=nytcore-android-share6"
  },
  {
    "text": "The U.S. Plan to Hobble China Tech Isn't Working  —  Chinese solar panels, electric vehicles and drones are better than those made in the U.S. Is AI next?  —  The U.S. has tried almost everything to win the tech race against China—across areas as varied as AI, energy, autonomous vehicles, drones and EVs.",
    "url": "https://www.wsj.com/tech/the-u-s-plan-to-hobble-china-tech-isnt-working-56d1a512?st=MQpryL&reflink=article_copyURL_share"
  },
  {
    "text": "For Europe, America was the future.  Now what?  —  Mark Mazower on the long history and troubled present of the transatlantic relationship  —  Unlock the White House Watch newsletter for free  —  Your guide to what Trump's second term means for Washington, business and the world",
    "url": "https://www.ft.com/content/4f11cdfb-ff57-49e4-a2af-f9fcaf278940"
  },
  {
    "text": "Trump, Bashing the Federalist Society, Asserts Autonomy on Judge Picks  —  The president has grown increasingly angry at court rulings blocking parts of his agenda, including by judges he appointed.  —  President Trump appears to be declaring independence from outside constraints on how he nominates judges … ",
    "url": "https://www.nytimes.com/2025/05/30/us/politics/trump-judges-nominations.html?unlocked_article_code=1.LU8.67al.TV7M3LuXBybz&smid=url-share"
  },
  {
    "text": "Biden on 2024 reelection bid: 'I don't have any regrets'  —  Former President Biden said Friday that he does not have regrets in deciding to run for reelection in 2024 and argued that other Democrats did not challenge him in the party's primary because they knew they would have lost.",
    "url": "https://thehill.com/homenews/campaign/5327026-joe-biden-2024-reelection-bid-no-regrets/"
  },
  {
    "text": "Gov. Newsom proposes ‘asset test’ for low-income and disabled Medi-Cal applicants.  What does that mean?  — Facing higher healthcare costs, Gov. Gavin Newsom is proposing adding an “asset test” for applicants for Medi-Cal and In-Home Supportive Services.",
    "url": "https://www.latimes.com/california/story/2025-05-30/gov-newsom-proposes-asset-test-for-low-income-and-disabled-medi-cal-applicants-what-does-that-mean"
  },
  {
    "text": "Energy Dept. Cancels $3.7 Billion for New Technologies to Lower Emissions  —  The 24 awards would have gone to a range of companies trying in novel ways to reduce the pollution that is heating the planet.  —  The Energy Department announced on Friday that it was terminating $3.7 billion … ",
    "url": "https://www.nytimes.com/2025/05/30/climate/energy-dept-climate-tech-awards-cut.html"
  },
  {
    "text": "US judge prevents Trump from invalidating 5,000 Venezuelans' legal documents  —  A federal judge prevented the Trump administration from invalidating work permits and other documents granting lawful status to about 5,000 Venezuelans, a subset of the nearly 350,000 whose temporary legal protections … ",
    "url": "https://www.reuters.com/world/americas/us-judge-prevents-trump-invalidating-5000-venezuelans-legal-documents-2025-05-31/"
  },
  {
    "text": "Europe should counter new Trump tariffs ‘immediately,’ EU Parliament's Lange says  —  Europe has potential retaliatory measures to U.S. President Donald Trump's latest threat on steel and aluminum tariffs ready to go, the chair of the European Parliament's trade committee said on Saturday.",
    "url": "https://www.politico.eu/article/tariffs-trump-european-union-trade-steel-parliament-bernd-lange/"
  },
  {
    "text": "CDC Issues New Advice on Covid Vaccines for Children That Contradicted RFK Jr.  —  Health Secretary Robert F. Kennedy Jr. said on Tuesday that the vaccine would no longer appear on the childhood immunization schedule.  C.D.C.'s update counters his policy.  —  Days after Health Secretary … ",
    "url": "https://www.nytimes.com/2025/05/30/health/cdc-covid-vaccines-children-pregnant-women.html"
  },
  {
    "text": "After Rubio seeks to revoke their visas, Chinese students say U.S. resembles the country they left  —  “In China, the government can control education, high schools, colleges, universities.  We thought that the USA could be different,” one student said.  —  Chinese students say they're questioning … ",
    "url": "https://www.nbcnews.com/news/asian-america/rubio-revoke-student-visas-china-rcna209699"
  },
  {
    "text": "Trump Officials Unveil Budget Cuts to Aid for Health, Housing and Research  —  The new blueprint shows that a vast array of education, health, housing and labor programs would be hit, including aid for college and cancer research.  —  The Trump administration on Friday unveiled fuller details … ",
    "url": "https://www.nytimes.com/2025/05/30/us/politics/white-house-budget-trump.html?unlocked_article_code=1.LU8.iKtq.sQY9xDlSiSs8&smid=url-share"
  },
  {
    "text": "PBS sues Trump over executive order targeting federal funding, following NPR  —  The public broadcaster says a May 1 executive order violated its First Amendment rights.  —  PBS sued the Trump administration on Friday, nearly one month after the president issued an executive order targeting its federal funding.",
    "url": "https://www.washingtonpost.com/style/media/2025/05/30/pbs-sues-trump-cpb-npr/"
  },
  {
    "text": "STAT+: New HHS document details deep NIH cuts as part of Trump budget request  —  The Department of Health and Human Services on Friday released a summary of President Trump's budget request for the 2026 fiscal year that provides the most detailed look yet at how his administration hopes … ",
    "url": "https://www.statnews.com/2025/05/30/nih-cuts-new-details-18-billion-budget-reduction-outlined-in-congressional-budget-justification/"
  },
  {
    "text": "Trump Championed Rulings That Are Now Being Used to Check His Power  —  In tariff case and others, courts are finding the president's expansive view of executive authority clashes with decisions that limit its reach  —  WASHINGTON—During the Biden administration, conservative challengers … ",
    "url": "https://www.wsj.com/politics/policy/trump-courts-judges-conservative-law-b3fd979b"
  },
  {
    "text": "Trump administration to prioritize ‘patriotic Americans’ for federal jobs  —  Applicants for government jobs will be required to write essays explaining how they will advance President Donald Trump's policy priorities.  —  As President Donald Trump moves to slash the size of the federal workforce … ",
    "url": "https://www.politico.com/news/2025/05/30/trump-administration-patriotic-americans-federal-workforce-00376752"
  },
  {
    "text": "Wes Moore dives into 2028 race in South Carolina  —  The governor of Maryland said Democrats must adapt and change.  —  COLUMBIA, SOUTH CAROLINA — Wes Moore made an early and urgent appeal Friday to one of the nation's most important Democratic constituencies.",
    "url": "https://www.politico.com/news/2025/05/30/wes-moore-dives-into-2028-race-in-south-carolina-00378647"
  },
  {
    "text": "Loretta Swit a.k.a. Hot Lips of TV's ‘M*A*S*H,’ Dies at 87  —  She won two Emmy Awards for her sympathetic portrayal of an Army major on the hit TV show and had a long career in TV and theater.  —  Loretta Swit, the Emmy-winning actress who made the high-strung and relentlessly militaristic … ",
    "url": "https://www.nytimes.com/2025/05/30/obituaries/loretta-swit-dead.html"
  },
  {
    "text": "DOGE left United States Institute of Peace office with water damage, rats, and roaches  —  The chief executive of the United States Institute of Peace says Elon Musk's Department of Government Efficiency left the nonprofit's Washington, D.C. headquarters in disarray, full of water damage … ",
    "url": "https://techcrunch.com/2025/05/30/doge-left-united-states-institute-of-peace-office-with-water-damage-rats-and-roaches/"
  },
  {
    "text": "Trump picks right-wing lawyer and podcaster who promoted 2020 election lies as watchdog agency head  —  President Donald Trump's pick to lead a federal watchdog agency is a former right-wing podcast host who has praised criminally charged influencer Andrew Tate as a “extraordinary human being” … ",
    "url": "https://apnews.com/article/trump-office-of-special-counsel-paul-ingrassia-1812d6ac0e694402dc7c817dcc79291e"
  }
]