[
  {
    "text": "In Shinzo's shadow, Japan fears ‘if Trump’  —  Moshi Tora.  That's the compact phrase now spreading like wildfire in Japan.  It means “If Trump,” and is often said with a sense of foreboding.  —  This haiku-like, four-syllable phrase is short for the longer sentence: “What if Trump wins the presidency again?”",
    "url": "https://thehill.com/opinion/white-house/4513866-in-shinzos-shadow-japan-fears-if-trump/"
  },
  {
    "text": "Navy demoted Ronny Jackson after probe into White House behavior  —  Ronny Jackson, the former White House physician turned GOP congressman, regularly touts his military bona fides.  —  “As a retired U.S. Navy Rear Admiral with nearly three decades of military service I understand the commitment … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/07/ronny-jackson-demotion-white-house-medical-unit-navy/"
  },
  {
    "text": "Sweden Officially Enters NATO Alliance, a Strategic Blow to Moscow  —  Sweden applied to become a member two years ago after Russia invaded Ukraine.  —  Sweden formally joined NATO on Thursday, becoming its 32nd member, two years after Russia's invasion of Ukraine forced both Sweden and Finland … ",
    "url": "https://www.nytimes.com/2024/03/07/world/europe/sweden-nato-neutrality.html"
  },
  {
    "text": "Exclusive: Biden plans feisty economic reset … - Biden needs a cure for what some advisers call “Trump amnesia” — the notion that the chaos and unpopularity of Trump's presidency has receded from some voters' memories nearly four years on. … - Voters largely understand the contrasts between Trump … ",
    "url": "https://www.axios.com/2024/03/07/state-of-the-union-biden-us-economy"
  },
  {
    "text": "Biden to announce ‘emergency’ US military mission to build port on Gaza coast to deliver aid  —  It will receive “large ships carrying food, water, medicine,” an official said.  —  A military aircraft drops packages towards Gaza, amid the ongoing conflict between Israel and the Palestinian group Hamas … ",
    "url": "https://abcnews.go.com/Politics/sotu-biden-announce-emergency-us-military-mission-build/story?id=107889126"
  },
  {
    "text": "Charted: Trump world allies sentenced to prison … - He is expected to be sentenced to five months in prison in April. … - Former Trump campaign lawyer Sidney Powell — one of Trump's co-defendants in the sprawling Georgia election subversion case — took a plea deal to testify against co-defendants that helped her avoid prison.",
    "url": "https://www.axios.com/2024/03/07/trump-associates-prison-sentence-crimes-list"
  },
  {
    "text": "Spate of Mock News Sites With Russian Ties Pop Up in U.S.  —  The fake news organizations, experts say, represent a technological leap in the Kremlin's efforts to spread false and misleading narratives.  —  Into the depleted field of journalism in America, a handful of websites have appeared … ",
    "url": "https://www.nytimes.com/2024/03/07/business/media/russia-us-news-sites.html"
  },
  {
    "text": "Arizona Is on Brink of Charging People Close to Trump Over 2020 Election … In the aftermath of the 2020 presidential election, Donald Trump's campaign officials were scrambling to find any means for the election results to work out in his favor, despite being unable to find actual evidence … ",
    "url": "https://newrepublic.com/post/179629/arizona-brink-charging-trump-aides-2020-election"
  },
  {
    "text": "How millions in corporate cash could help a radical conspiracy theorist become governor  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  On Tuesday, Mark Robinson (R) won the Republican nomination for Governor of North Carolina.  Robinson, currently North Carolina's lieutenant governor … ",
    "url": "https://popular.info/p/how-millions-in-corporate-cash-could"
  },
  {
    "text": "Steve Bannon's Refusal to Pay His Bills Is Costing Him Big  —  Bannon has refused to pay his legal bills for two years.  Now he and his current lawyer are facing fines over Bannon's refusal to make good on his debts. … For two years, Steve Bannon has refused to pay the half-million dollars he owes his former lawyer.",
    "url": "https://www.thedailybeast.com/steve-bannons-refusal-to-pay-his-bills-is-costing-him-big"
  },
  {
    "text": "Biden to propose new $5,000 tax credit for first-time home buyers  —  The president will also add to earlier pushes to tame rent costs and boost U.S. housing supply  —  President Biden will propose a set of new housing initiatives in Thursday's State of the Union address … ",
    "url": "https://www.washingtonpost.com/business/2024/03/07/biden-housing-sotu/"
  },
  {
    "text": "House panel passes measure blocking Biden administration from finalizing nursing home staffing rule  —  The GOP-controlled House Ways & Means Committee on Wednesday passed a bill that would block the Biden administration from implementing rules requiring minimum staffing levels for nursing homes.",
    "url": "https://thehill.com/homenews/house/4516104-house-panel-passes-measure-blocking-biden-administration-from-finalizing-nursing-home-staffing-rule/"
  },
  {
    "text": "Why is New York Times campaign coverage so bad?  Because that's what the publisher wants.  —  It's an increasingly common critique of the New York Times: The largest, most influential news organization in the nation is not warning sufficiently of the threat to democracy … ",
    "url": "https://presswatchers.org/2024/03/why-is-new-york-times-campaign-coverage-so-bad-because-thats-what-the-publisher-wants/"
  },
  {
    "text": "Missouri's total war on Planned Parenthood  —  Republicans aren't stopping at abortion bans.  —  ∙ Paid  —  Given the sinkhole of conspiracies that is Elon Musk's X, it shouldn't be surprising that Andrew Bailey, Missouri's hard-right attorney general, used the platform to announce … ",
    "url": "https://www.publicnotice.co/p/missouri-planned-parenthood-lawsuit"
  },
  {
    "text": "McCaul postpones Blinken contempt markup after secretary agrees to produce documents  —  House Foreign Affairs Committee Chair Michael McCaul (R-Texas) said he is postponing a markup for a contempt resolution of State Secretary Antony Blinken after he agreed to produce the subpoenaed documents on the U.S's exit from Afghanistan in 2021.",
    "url": "https://thehill.com/homenews/house/4516464-mccaul-postpones-blinken-contempt-markup-after-secretary-agrees-to-produce-documents/"
  },
  {
    "text": "Barrasso says he's locked down enough votes to become Senate GOP whip  —  Senate Republican Conference Chair John Barrasso (Wyo.) says he has locked down enough votes to become the next Senate Republican whip in 2025.  —  Barrasso, who was often mentioned as a potential candidate … ",
    "url": "https://thehill.com/homenews/senate/4516626-barrasso-says-hes-locked-down-enough-votes-to-become-senate-gop-whip/"
  },
  {
    "text": "4 Children Among 6 People Slain in Mass Shooting in Canada's Capital  —  Cops said the suspected gunman was arrested, adding that the shooting likely was not “intimate partner violence.”  —  Four children were among the six people killed in a Ottawa townhouse late Wednesday night … ",
    "url": "https://www.thedailybeast.com/ottawa-mass-shooting-4-children-among-6-slain-inside-canadian-townhome"
  },
  {
    "text": "Profound Damage Found in Maine Gunman's Brain, Possibly From Blasts  —  A laboratory found a pattern of cell damage that has been seen in veterans exposed to weapons blasts, and said it probably played a role in symptoms the gunman displayed before the shooting.",
    "url": "https://www.nytimes.com/2024/03/06/us/maine-shooting-brain-injury.html"
  },
  {
    "text": "The White House Announces Guest List for the First Lady's Box for the 2024 State of the Union Address  —  WASHINGTON, D.C. - First Lady Jill Biden will welcome guests to join her in the viewing box for President Biden's State of the Union Address on Thursday, March 7, 2024.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/03/07/the-white-house-announces-guest-list-for-the-first-ladys-box-for-the-2024-state-of-the-union-address/"
  },
  {
    "text": "Amid explosive demand, America is running out of power  —  AI and the boom in clean-tech manufacturing are pushing America's power grid to the brink.  Utilities can't keep up.  —  Vast swaths of the United States are at risk of running short of power as electricity-hungry data centers … ",
    "url": "https://www.washingtonpost.com/business/2024/03/07/ai-data-centers-power/"
  }
]