[
  {
    "text": "PROTECTING THE MEANING AND VALUE OF AMERICAN CITIZENSHIP  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  The privilege of United States citizenship is a priceless and profound gift.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/protecting-the-meaning-and-value-of-american-citizenship/"
  },
  {
    "text": "The Trump executive orders that threaten democracy  —  Ever since Donald Trump declared he'd act like a dictator on Day 1 during his presidential campaign, there have been real concerns that he'd be true to his word — that he'd take a series of unilateral actions that threaten the integrity of American democracy.",
    "url": "https://www.vox.com/policy/395860/trump-executive-orders-democracy-january-6-pardon-birthright-schedule-f"
  },
  {
    "text": "GRANTING PARDONS AND COMMUTATION OF SENTENCES FOR CERTAIN OFFENSES RELATING TO THE EVENTS AT OR NEAR THE UNITED STATES CAPITOL ON JANUARY 6, 2021  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  This proclamation ends a grave national injustice that has been perpetrated upon … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/granting-pardons-and-commutation-of-sentences-for-certain-offenses-relating-to-the-events-at-or-near-the-united-states-capitol-on-january-6-2021/"
  },
  {
    "text": "Trump commutes sentences of Proud Boys and Oath Keepers leaders as he pardons over 1,000 January 6 US Capitol rioters  —  President Donald Trump on Monday pardoned more than 1,000 people charged in the January 6, 2021, attack on the US Capitol, and commuted the sentences of leaders of the Proud Boys and Oath Keepers.",
    "url": "https://www.cnn.com/2025/01/20/politics/january-6-2021-capitol-riot-pardons-trump/"
  },
  {
    "text": "Musk responds to backlash over gesture at Trump rally  —  Elon Musk has caused outrage over a one-armed gesture he gave during a speech celebrating the inauguration of Donald Trump.  —  Musk thanked the crowd for “making it happen”, before placing his right hand over his heart and then thrusting … ",
    "url": "https://www.bbc.com/news/articles/cy48v1x4dv4o"
  },
  {
    "text": "Trump signs order seeking to rename Alaska's Denali and the Gulf of Mexico  —  President Donald Trump said the Gulf of Mexico will be called Gulf of America, while the Denali mountain peak will revert to its old name, Mount McKinley.  —  President Donald Trump on Monday issued … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/21/trump-gulf-of-america-mexico-denali-mckinley/"
  },
  {
    "text": "WITHDRAWING THE UNITED STATES FROM THE WORLD HEALTH ORGANIZATION  —  WITHDRAWING THE UNITED STATES FROM THE WORLD  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/withdrawing-the-united-states-from-the-worldhealth-organization/"
  },
  {
    "text": "The gravity of Trump pardoning Jan. 6ers who assaulted police  —  Donald Trump's decision to do something so obviously unpopular and fraught should put to rest any GOP attempts to minimize his intentions.  —  One of the big questions surrounding a newly sworn-in President Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/21/president-trump-pardons-jan-6-violent-offenders/"
  },
  {
    "text": "Initial Rescissions Of Harmful Executive Orders And Actions  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:  —  Section 1.  Purpose and Policy.  The previous administration has embedded deeply unpopular … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/initial-rescissions-of-harmful-executive-orders-and-actions/"
  },
  {
    "text": "Why Ruben Gallego's Laken Riley vote is a warning for Democrats  —  In backing the Laken Riley Act, the Arizona senator said he's breaking with a party that's “largely out of touch with where your average Latino is.”  —  Ruben Gallego didn't run to be the next John McCain or Kyrsten Sinema … ",
    "url": "https://www.politico.com/news/2025/01/20/ruben-gallego-democrats-trump-00001925"
  },
  {
    "text": "DEFENDING WOMEN FROM GENDER IDEOLOGY EXTREMISM AND RESTORING BIOLOGICAL TRUTH TO THE FEDERAL GOVERNMENT  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including section 7301 of title 5, United States Code, it is hereby ordered:",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/defending-women-from-gender-ideology-extremism-and-restoring-biological-truth-to-the-federal-government/"
  },
  {
    "text": "Coast Guard Commandant terminated over border lapses, recruitment, DEI focus: official  —  Senior DHS official confirms to Fox News Digital Coast Guard Adm. Linda Fagan has been relieved of her post  —  EXCLUSIVE: The Commandant of the U.S. Coast Guard has been terminated over concerns about the border … ",
    "url": "https://www.foxnews.com/politics/coast-guard-commandant-terminated-over-border-lapses-recruitment-dei-focus-official"
  },
  {
    "text": "Distorting Trump's Language  —  In the flurry of boasts, exaggerations, and untruths that President Trump emitted during yesterday's Inaugural Address, he made evident his intention to turn reality on its head.  Taking his predecessor's successes in reducing crime, increasing oil and gas production … ",
    "url": "https://contrarian.substack.com/p/distorting-trumps-language"
  },
  {
    "text": "Judge blocks release of Jack Smith's report on Trump documents case to lawmakers  —  Washington — A federal judge in South Florida blocked the Justice Department from giving lawmakers the portion of former special counsel Jack Smith's report that deals with his investigation into President Trump's handling of classified documents.",
    "url": "https://www.cbsnews.com/news/trump-classified-documents-jack-smith-special-counsel-report/"
  },
  {
    "text": "Get out of DOGE: How Musk helped eject Ramaswamy  —  Ramaswamy is leaving the so-called Department of Government Efficiency and plans to run for Ohio governor.  —  Elon Musk has already achieved his first cut at the so-called Department of Government Efficiency: his co-leader Vivek Ramaswamy.",
    "url": "https://www.politico.com/news/2025/01/20/doge-musk-helped-eject-ramaswamy-00199487"
  },
  {
    "text": "Pritzker attacks Trump over birthright citizenship order: It's ‘chaos’  —  CHICAGO — Illinois Gov. JB Pritzker launched an attack on President Donald Trump's planned executive order attempting to revoke birthright citizenship.  “That's unconstitutional.  We will not follow an unconstitutional order … ",
    "url": "https://www.politico.com/live-updates/2025/01/20/donald-trump-inauguration-day-news-updates-analysis/pritzker-trump-birthright-citizenship-00199472"
  },
  {
    "text": "Time to Admit It: Trump Is a Great President.  He's Still Trying To Be a Good One.  —  The most consequential presidents divided the nation—before “reuniting it on a new level of understanding.”  —  Donald J. Trump in his second inaugural address was everything his supporters hoped he would be … ",
    "url": "https://www.politico.com/news/magazine/2025/01/21/harris-column-trump-great-president-00199564"
  },
  {
    "text": "The “find out” phase begins  —  Voters effed around.  And now ...  On November 5, voters handed Donald Trump a decisive win in the Electoral College.  They did this following a campaign during which he was convicted of felonies, smeared migrants as backward pet-eaters, demonized trans people … ",
    "url": "https://www.publicnotice.co/p/trump-inauguration-2025-fafo"
  },
  {
    "text": "Trump fires Milley and slams celebrity chef Jose Andres  —  President Donald Trump dismissed retired Gen. Mark Milley from a federal position and targeted celebrity chef Jose Andres as one of his first acts as president.  —  Hours after he was sworn into office as the country's 47th president … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/3295017/trump-fires-milley-slams-celebrity-chef-jose-andres/"
  },
  {
    "text": "APPLICATION OF PROTECTING AMERICANS FROM FOREIGN ADVERSARY CONTROLLED APPLICATIONS ACT TO TIKTOK  —  By the authority vested in me as President by the Constitution and the laws of the United States of America it is hereby ordered:  —  Section 1.  Policy.  The Protecting Americans … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/application-of-protecting-americans-from-foreign-adversary-controlled-applications-act-to-tiktok/"
  },
  {
    "text": "The inauguration of a multi-billion dollar grift  —  On Monday, Donald Trump took the oath of office — the first person to be sworn in as president while simultaneously hawking an eponymous meme coin.  —  Trump launched $TRUMP, a crypto token, on Friday night.  Meme coins are crypto tokens tied to a celebrity or joke.",
    "url": "https://popular.info/p/the-inauguration-of-a-multi-billion"
  },
  {
    "text": "Delivering Emergency Price Relief for American Families and Defeating the Cost-of-Living Crisis  —  Over the past 4 years, the Biden Administration's destructive policies inflicted an historic inflation crisis on the American people.  The Biden Administration not only exploded Government spending … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/delivering-emergency-price-relief-for-american-families-and-defeating-the-cost-of-living-crisis/"
  }
]