[
  {
    "text": "Administration Officials Believe Order Lets Immigration Agents Enter Homes Without Warrants  —  It remains unclear whether the Trump administration will apply the law in this way.  But such an interpretation, experts say, would infringe on basic civil liberties.",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/trump-alien-enemies-immigration-agents.html?unlocked_article_code=1.5U4.I-az.c2sJMDGTtLCE&smid=url-share"
  },
  {
    "text": "We're Finally Seeing the “Evidence” Against the Migrants Deported by Trump.  It's Unbelievable.  —  After the Trump administration rounded up hundreds of Venezuelan migrants around the country—without notice or court hearings—and sent them off to a prison in El Salvador, we're finally getting details on who was deported and why.",
    "url": "https://slate.com/news-and-politics/2025/03/immigration-trump-news-mass-deportations-tren-de-aragua.html"
  },
  {
    "text": "In Deportations, Trump Tied Gang to Venezuela's Government.  Intelligence Contradicts Him.  —  To invoke wartime deportation powers, President Trump asserted that Venezuela's government controls a gang.  U.S. intelligence analysts think that is not true.  —  President Trump's assertion … ",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/intelligence-trump-venezuelan-gang-alien-enemies.html?unlocked_article_code=1.5k4.r1Sm.B3bU70ng1p8Z&smid=tw-share"
  },
  {
    "text": "Here are the names of the Venezuelans deported by the U.S. to El Salvador  —  CBS News has obtained an internal government list of the names of the Venezuelan men the Trump administration deported to El Salvador as part of a secretive operation last week that has triggered a legal standoff in the U.S. and a debate around the world.",
    "url": "https://www.cbsnews.com/news/venezuelans-deported-el-salvador-names/"
  },
  {
    "text": "Pentagon Set Up Briefing for Musk on Potential War With China  —  The access would be a major expansion of Elon Musk's government role and highlight his conflicts of interest.  —  The Pentagon was scheduled on Friday to brief Elon Musk on the U.S. military's plan for any war that might break out with China … ",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/musk-pentagon-briefing-china-war-plan.html?unlocked_article_code=1.5k4.kMNN.sJA8l_XR5dFL&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Social Security Acting Head Says DOGE Ruling Threatens Agency  —  The Trump administration is threatening to all but shut down the Social Security Administration in response to a judge's ruling blocking activities by Elon Musk's Department of Government Efficiency — an action that could delay payments … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-20/social-security-says-doge-ruling-could-force-agency-to-shut-down"
  },
  {
    "text": "Judge bars Musk's DOGE team from Social Security records in scathing ruling … A federal judge Thursday issued a temporary restraining order barring Elon Musk's so-called Department of Government Efficiency team from having access to personally identifiable information from the Social Security Administration.",
    "url": "https://www.cnbc.com/2025/03/20/judge-bars-musks-doge-team-from-social-security-records.html"
  },
  {
    "text": "Big Law Firm Reaches Deal With Trump Over Executive Order  —  Paul, Weiss — one of three law firms targeted by President Trump as part of his retribution campaign — said it resolved the conflict by agreeing to a range of commitments.  —  President Trump and the head of the law firm Paul … ",
    "url": "https://www.nytimes.com/2025/03/20/us/politics/paul-weiss-deal-trump-executive-order-withdrawn.html?unlocked_article_code=1.5k4.pcXA.4YnmBISIg_JL&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump signs executive order to dismantle the Education Department  —  The complete elimination of the department would require the approval of Congress.  —  WASHINGTON — President Donald Trump signed an executive order Thursday directing Education Secretary Linda McMahon to start dismant l ing the Department of Education.",
    "url": "https://www.nbcnews.com/politics/white-house/trump-signs-executive-order-dismantle-education-department-white-house-rcna197251"
  },
  {
    "text": "Tesla confirms it can't sell the Cybertruck even with tax credit and discounts  —  Tesla has revealed Cybertruck deliveries in the US, confirming that it can't sell the electric truck even with federal tax credits and discounts.  —  As we previously reported, Tesla is highly opaque about its vehicle deliveries.",
    "url": "https://electrek.co/2025/03/20/tesla-confirms-it-cant-sell-the-cybertruck-even-with-tax-credit-and-discounts/"
  },
  {
    "text": "Judge rips DOJ's ‘woefully insufficient’ response to questions on Alien Enemies Act case  —  The government's response to U.S. District Judge James Boasberg was filed under seal after days of heated back-and-forth.  —  A federal judge Thursday blasted the Justice Department's latest response … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/judge-rips-dojs-woefully-insufficient-response-questions-alien-enemies-rcna197288"
  },
  {
    "text": "We ran the wrong headline about Trump firing the FTC commissioners  —  The unlawful removals of Alvaro Bedoya and Rebecca Kelly Slaughter pushed journalistic writing to its limit. … On Tuesday, the president of the United States fired the Democratic commissioners of the Federal Trade Commission … ",
    "url": "https://www.theverge.com/policy/633397/ftc-bedoya-slaughter-democrat-media"
  },
  {
    "text": "Britain Issues Travel Warning for US  —  The United Kingdom has updated its travel advice for British citizens planning to visit the United States, warning of potential arrest or detention if travelers fail to comply with entry requirements.  —  It comes amid President",
    "url": "https://www.newsweek.com/britain-issues-travel-warning-us-deportations-2047878"
  },
  {
    "text": "Scoop: Musk's PAC offers $100 to Wisconsin voters in pitch against “activist judges”  —  Elon Musk's political action committee is offering Wisconsin voters $100 to sign a petition expressing their opposition to “activist judges,” a cause that President Trump is pressing as judges block or delay several parts of his agenda.",
    "url": "https://www.axios.com/2025/03/21/elon-musk-pac-wisconsin-judges"
  },
  {
    "text": "White House scrambles after JFK files expose Social Security numbers  —  The White House rushes to mitigate the errant release of more than 400 Social Security numbers and other private information in JFK files.  —  After the Social Security numbers of more than 400 former congressional staffers … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/20/trump-jfk-files-personal-data-social-security/"
  },
  {
    "text": "Attorney General Pamela Bondi Announces Severe Charges Against Violent Tesla Arsonists  —  For Immediate Release  —  Today, Attorney General Pamela Bondi announced charges against three individuals responsible for the violent destruction of Tesla properties.",
    "url": "https://www.justice.gov/opa/pr/attorney-general-pamela-bondi-announces-severe-charges-against-violent-tesla-arsonists"
  },
  {
    "text": "Republican Representative's Defense of Elon Musk Drowned Out by Boos  —  Republicans are learning fast that the Department of Government Efficiency's federal cuts are not popular.  —  Representative Harriet Hagemen was booed and chanted down by a crowd of her constituents during … ",
    "url": "https://newrepublic.com/post/192980/republican-representative-boos-town-hall-elon-musk"
  },
  {
    "text": "MAGA Influencer And Fox News Guest Indicted On Child Sex Abuse Charges  —  The right-wing personality known as Raw Ricci built his following by filming homeless people in San Francisco.  —  A MAGA influencer known for posting sensationalized videos of homeless people in San Francisco … ",
    "url": "https://www.huffpost.com/entry/maga-raw-ricci-wynne-homeless_n_67dc47a6e4b038b4d0a69941"
  },
  {
    "text": "'We Don't Want an AI Demo, We Want Answers': Federal Workers Grill Trump Appointee During All-Hands  —  Leaked chats obtained by WIRED detail plans for the General Services Administration—and the staff's angry response.  —  On Thursday, Stephen Ehikian, the acting administrator … ",
    "url": "https://www.wired.com/story/gsa-staff-all-hands-meeting-ai/"
  },
  {
    "text": "Bluesky makes it easier for publishers to track referrals  —  Social network Bluesky, an open source X rival, has made a change that will allow publishers to better track the referral traffic originating from posts on its platform.  According to a comment from Bluesky employee Emily Liu … ",
    "url": "https://techcrunch.com/2025/03/20/bluesky-makes-it-easier-for-publishers-to-track-referrals/"
  },
  {
    "text": "Indictment Charges St. Louis Man with COVID Fraud  —  For Immediate Release  —  U.S. Attorney's Office, District of Columbia  —  Defendant Allegedly Filed Two Fraudulent Applications for Emergency Funds  —  WASHINGTON - Cortney Merritts, 46, of St. Louis, Missouri … ",
    "url": "https://www.justice.gov/usao-dc/pr/indictment-charges-st-louis-man-covid-fraud"
  },
  {
    "text": "DOJ pushes FBI to review, release more Epstein files amid mounting pressure from Trump supporters: Sources  —  Attorney General Pam Bondi is pushing for more to be released, sources say.  —  People walk out of the West Wing and show “The Epstein Files: Phase 1” binders, at the White House in Washington, D.C., February 27, 2025.",
    "url": "https://abcnews.go.com/US/doj-pushes-fbi-review-release-epstein-files-amid/story?id=119982513"
  }
]