[
  {
    "text": "‘Travesty in darkness’: Trump backs drive to televise his D.C. election subversion trial  —  Trump, who is facing four criminal prosecutions as well as several civil lawsuits, has been trying in recent weeks to leverage those proceedings to amplify his message to voters.",
    "url": "https://www.politico.com/news/2023/11/11/travesty-in-darkness-trump-backs-drive-to-televise-his-d-c-election-subversion-trial-00126704"
  },
  {
    "text": "Trump's D.C. Trial Strategy: Do Everything to Delay Until After 2024 Election  —  Appellate courts could take up pre-trial appeals by Donald Trump in his federal election-subversion case, leading to uncertainty about the former president's Washington, D.C., trial date",
    "url": "https://themessenger.com/politics/trump-washington-dc-appeal-jack-smith-trial-date"
  },
  {
    "text": "Why Aren't More People Getting Married?  Ask Women What Dating Is Like.  —  Sarah Camino had been in a relationship for two years when she found out she was pregnant.  The father, whom she met while they were both working at a restaurant in Times Square, was initially excited.",
    "url": "https://www.nytimes.com/2023/11/11/opinion/marriage-women-men-dating.html"
  },
  {
    "text": "Sweeping Raids, Giant Camps and Mass Deportations: Inside Trump's 2025 Immigration Plans  —  If he regains power, Donald Trump wants not only to revive some of the immigration policies criticized as draconian during his presidency, but expand and toughen them.",
    "url": "https://www.nytimes.com/2023/11/11/us/politics/trump-2025-immigration-agenda.html"
  },
  {
    "text": "RNC warns candidates that attending Iowa Christian group's forum will disqualify them from debates  —  The Republican National Committee has warned some of the 2024 GOP presidential candidates about attending an Iowa Christian organization's Thanksgiving forum, saying it would disqualify … ",
    "url": "https://www.cnn.com/2023/11/10/politics/rnc-warns-candidates-thanksgiving-forum/"
  },
  {
    "text": "Bill Maher and Ted Cruz Stage Unexpected Mutual Love Fest  —  The comedian has often lambasted the Texas senator but Cruz's appearance on Maher's program Friday night showed these new friends were anything but TV's “Odd Couple.”  —  Anyone who was expecting fireworks when Sen. Ted Cruz appeared … ",
    "url": "https://www.thedailybeast.com/bill-maher-and-ted-cruz-stage-unexpected-mutual-love-fest-in-fawning-real-time-appearance"
  },
  {
    "text": "Ramaswamy ditching Ohio headquarters, sending staff to Iowa and N.H.  —  The Republican presidential candidate has spent the fall mired in single digits.  —  In a move to jolt his presidential campaign back to life, Vivek Ramaswamy is abandoning his suburban Ohio headquarters and dispatching … ",
    "url": "https://www.politico.com/news/2023/11/11/ramaswamy-campaign-shakeup-00126661"
  },
  {
    "text": "Xi Jinping's ‘Old Friends’ from Iowa Get a Dinner Invitation  — Reunion will be on sidelines of the APEC summit in California  — Iowans met future Chinese leader when he visited state in 1985  —  A group of Chinese President Xi Jinping's “old friends” from Iowa have been invited … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-11/xi-jinping-s-old-friends-from-iowa-invited-to-dinner-with-him"
  },
  {
    "text": "Statement From Gerald Rosberg, Chair of the Special Committee on Campus Safety  —  Columbia University is suspending Students for Justice in Palestine (SJP) and Jewish Voice for Peace (JVP) as official student groups through the end of the fall term.  This decision was made after the two … ",
    "url": "https://news.columbia.edu/news/statement-gerald-rosberg-chair-special-committee-campus-safety"
  },
  {
    "text": "Macron calls on Israel to stop killing Gaza's women and babies  —  Israel must stop killing babies and women in Gaza, French President Emmanuel Macron has told the BBC.  —  In an exclusive interview at the Élysée Palace, he said there was “no justification” for the bombing, saying a ceasefire would benefit Israel.",
    "url": "https://www.bbc.com/news/world-europe-67356581"
  },
  {
    "text": "White House tried, and failed, to persuade Manchin to make another Senate run  —  And now, the question is, will he run against Biden?  —  As Sen. Joe Manchin struggled for several months over the next step he would take politically, President Joe Biden's top advisers privately tried … ",
    "url": "https://www.politico.com/news/2023/11/10/biden-manchin-senate-run-00126683"
  },
  {
    "text": "Ohio Republicans Say It's Their ‘God Given Right’ to Restrict Abortion Access  —  Republicans in Ohio want to undermine the will of voters who approved a measure enshrining reproductive freedom into the state's constitution  —  Ohio Republicans are claiming a constitutional amendment … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ohio-republicans-stop-issue-1-abortion-rights-1234875333/"
  },
  {
    "text": "Moody's lowers U.S. credit outlook, citing political dysfunction  —  Moody's on Friday offered a sharp rebuke of political dysfunction in the United States, with the credit-rating agency changing its outlook for U.S. sovereign debt to negative from stable and warning that “continued political polarization” … ",
    "url": "https://www.washingtonpost.com/business/2023/11/10/moodys-credit-rating-deficit/"
  },
  {
    "text": "Ramaswamy now selling merch after Haley's ‘scum’ comments  —  GOP presidential hopeful Vivek Ramaswamy has decided to capitalize on former United Nations ambassador Nikki Haley's “scum” comments by selling merchandise on his website.  —  Ramaswamy, 38, called out Haley's daughter during … ",
    "url": "https://thehill.com/homenews/campaign/4305022-ramaswamy-unveils-new-haley-scum-merch/"
  },
  {
    "text": "‘I Got A Visit’: Dwayne ‘The Rock’ Johnson Says He Was Asked To Run For President  —  The actor, who said in 2017 that he was “seriously considering” a presidential run, claims he was approached by “the parties” last year.  —  LOADING  —  Dwayne “The Rock” Johnson says he was approached not long ago about leading the United States.",
    "url": "https://www.huffpost.com/entry/i-got-a-visit-dwayne-the-rock-johnson-president_n_654e4602e4b0c9f2465fe376"
  }
]