[
  {
    "text": "Playbook: Trump to MTG: Give it a rest  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  SPOILER ALERT — “Republicans are starting to worry about RFK Jr.,” by Lisa Kashinsky, Brittany Gibson, Jessica Piper and Steven Shepard: “'Kennedy was introduced … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/23/trump-to-mtg-give-it-a-rest-00153784"
  },
  {
    "text": "Greene faces uphill battle to oust Johnson  —  Rep. Marjorie Taylor Greene (R-Ga.) is escalating her threat to remove Speaker Mike Johnson (R-La.) from power, but she faces a steep climb if she hopes to achieve that goal.  —  Not only has the Speaker recently received a glowing review … ",
    "url": "https://thehill.com/homenews/house/4612735-greene-vow-motion-vacate-johnson/"
  },
  {
    "text": "Live Updates: Prosecutors Say Trump's Attacks Are Threat to Trial  —  Prosecutors in Donald J. Trump's criminal trial want him held in contempt for attacking witnesses and others close to the case, which centers on a hush-money payment to a porn star.  Testimony is set to resume later Tuesday morning.",
    "url": "https://www.nytimes.com/live/2024/04/23/nyregion/trump-hush-money-trial-news"
  },
  {
    "text": "Pro-Palestinian protests sweep US college campuses following mass arrests at Columbia  —  Biden says he condemns ‘the anti-Semitic protests’ on college campuses  —  Columbia canceled in-person classes, dozens of protesters were arrested at New York University and Yale … ",
    "url": "https://apnews.com/article/columbia-yale-israel-palestinians-protests-56c3d9d0a278c15ed8e4132a75ea9599"
  },
  {
    "text": "House GOP conservatives galvanize against Tony Gonzales … Hardline House GOP conservatives tell us they're feeling a renewed sense of motivation to go after Gonzales after he called out Rep. Matt Gaetz (R-Fla.) and House Freedom Caucus Chair Bob Good (R-Va.) on CNN this weekend.",
    "url": "https://punchbowl.news/article/tony-gonzales-brandon-herrera-primary-runoff/"
  },
  {
    "text": "Inside the Off-the-Record Calls Held by Anti-Trump Legal Pundits  —  Some of the country's most prominent legal commentators are holding off-the-record sessions to hash out the latest twists and turns in Donald Trump's legal saga.  —  As the Jan. 6 committee was working on its bombshell investigation … ",
    "url": "https://www.politico.com/news/magazine/2024/04/23/anti-trump-legal-pundits-calls-00153300"
  },
  {
    "text": "Senate to hold key test vote on Ukraine aid, Israel funding and TikTok ban  —  The package of foreign aid and legislation that would provide a pathway to banning TikTok in the U.S. is expected to be signed into law by President Joe Biden in the coming days.  —  WASHINGTON — The Senate … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-hold-key-test-vote-ukraine-aid-israel-funding-tiktok-ban-rcna148685?taid=66279b0c8c42f20001faa778"
  },
  {
    "text": "Minnesota state senator arrested on burglary charge  —  A Minnesota state senator has been charged with first-degree burglary after being arrested in the city of Detroit Lakes early Monday morning.  —  Democratic state Sen. Nicole Mitchell, 49, was arrested at a residence after police responded … ",
    "url": "https://thehill.com/homenews/state-watch/4615108-minnesota-state-senator-arrested-burglary-charge/"
  },
  {
    "text": "How Republicans castrated themselves … - Letting any member call a vote on removing the speaker. … - Surrendering authority of the Rules Committee, which sets the terms for how legislation will be handled during votes.",
    "url": "https://www.axios.com/2024/04/23/republicans-speaker-motion-vacate-rules-committee"
  },
  {
    "text": "No Soft Power Shake-Ups for Now  —  Germany is No. 1 in leadership approval ratings; Russia is unpopular  —  This article is the first in a series detailing the results from the latest Rating World Leaders report, which analyzes trends in approval ratings of the leadership of the U.S., Germany, Russia and China in over 130 countries.",
    "url": "https://news.gallup.com/poll/643853/no-soft-power-shake-ups.aspx"
  },
  {
    "text": "Biden's New Chopper Is Demoted After Scorching White House Lawn  — New presidential helicopters delayed under $5 billion program  — Marine One helicopter is iconic symbol of American president … The VH-92 Patriot is landing only on paved runways for now, flying missions … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-23/lockheed-still-can-t-solve-marine-one-s-scorched-grass-problem"
  },
  {
    "text": "Republicans are starting to worry about RFK Jr.  —  Even Donald Trump acknowledged Monday that the independent candidate “probably hurts both” Biden and him.  —  Republicans are waking up to the reality that Robert F. Kennedy Jr. could sink their standard-bearer just as easily … ",
    "url": "https://www.politico.com/news/2024/04/22/republicans-are-starting-to-worry-about-rfk-jr-00153763"
  },
  {
    "text": "Why Trump Will Likely be Held in Contempt and What Then  —  Trial in The People of the State of New York vs. Donald J. Trump, the first-ever criminal prosecution of a former U.S. president, began on Monday, April 15.  Although the trial is still in its early stages, Trump has already run … ",
    "url": "https://www.justsecurity.org/94878/why-trump-will-likely-be-held-in-contempt-and-what-then/"
  },
  {
    "text": "You don't want immigrants?  Then tell grandma she can never retire.  —  Don't want more immigrants in this country?  Then tell grandma she can never retire.  —  As I've noted before, immigrants are driving the U.S. economic boom.  That is: The United States has escaped recession … ",
    "url": "https://www.washingtonpost.com/opinions/2024/04/23/immigration-jobs-economy/"
  },
  {
    "text": "Voyager 1 is sending data back to Earth for the first time in 5 months  —  For the first time in five months, NASA engineers have received decipherable data from Voyager 1 after crafting a creative solution to fix a communication problem aboard humanity's most distant spacecraft in the cosmos.",
    "url": "https://www.cnn.com/2024/04/22/world/voyager-1-communication-issue-cause-fix-scn/"
  },
  {
    "text": "Trump Calls for More Protests Outside Trial: ‘Rally Behind MAGA’  —  With support from demonstrators in Lower Manhattan spotty so far, Donald Trump issued a call to “rally behind MAGA,” and suggested the poor turnout was a result of a plot against his supporters.",
    "url": "https://www.nytimes.com/2024/04/22/us/politics/trump-trial-protests.html"
  },
  {
    "text": "US agency poised to ban worker ‘noncompete’ agreements  —  The U.S. Federal Trade Commission (FTC) is expected on Tuesday to approve a rule that would ban agreements commonly signed by workers not to join their employers' competitors, which it says limit worker mobility and suppress their pay.",
    "url": "https://www.reuters.com/world/us/us-agency-poised-ban-worker-noncompete-agreements-2024-04-23/"
  },
  {
    "text": "Melania Quietly Emerges From the Shadows—at a Sparse Event for Log Cabin Republicans  —  BACK IN BLACK  —  Melania Trump's return to the campaign trail is just beginning.  But it was notable that she chose a small gathering for Log Cabin Republicans for her first solo event.",
    "url": "https://www.thedailybeast.com/melania-trump-quietly-emerges-from-the-shadowsat-a-sparse-event-for-log-cabin-republicans"
  },
  {
    "text": "Few have heard about Biden's climate policies, even those who care most about issue — CBS News poll  —  President Joe Biden made addressing climate change a key issue in his 2020 campaign.  Three years into his presidency, what do those who care about the issue most think about what he's done?",
    "url": "https://www.cbsnews.com/news/climate-policies-biden-poll/"
  },
  {
    "text": "Gov. Gavin Newsom wants to help Arizonans get abortions in California.  Here's what to know  —  California Gov. Gavin Newsom is set to propose legislation to make it easier for Arizonans to seek abortions in his state, he announced Sunday.  —  Health care providers in Arizona … ",
    "url": "https://www.azcentral.com/story/news/politics/arizona/2024/04/23/california-bill-to-offer-arizona-abortion-providers-licenses-in-state/73416676007/"
  }
]