[
  {
    "text": "Trump Encourages Putin to Attack NATO Members  —  At a rally on Saturday, the former president announced he would tell the Russians “to do whatever the hell they want” to states delinquent in their bills.  —  Donald Trump, the 45th president of the United States and the presumptive Republican nominee … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/trump-rally-nato/677426/"
  },
  {
    "text": "Trump Says He Might ‘Encourage’ Russia To Attack NATO Allies  —  “You gotta pay your bills,” said the former president notorious for not paying his own bills.  —  LOADING  —  Former President Donald Trump delivered an alarming message to U.S. allies during a Saturday rally where he outlined … ",
    "url": "https://www.huffpost.com/entry/trump-russia-attack-nato-allies_n_65c7e443e4b069b665dfb762"
  },
  {
    "text": "Donald Trump says he would encourage Russia to attack Nato allies who pay too little  —  Remarks by former president and presumptive 2024 Republican nominee described as ‘unhinged’ by the White House  —  Seeking a second presidency as the Republicans' presumptive 2024 White House nominee … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/11/donald-trump-says-he-would-encourage-russia-to-attack-nato-countries-who-dont-pay-bills"
  },
  {
    "text": "Trump Says He Gave NATO Allies Warning: Pay In or He'd Urge Russian Aggression  —  Speaking in Conway, S.C., Donald J. Trump said as president he'd told NATO allies that he would urge Russian aggression against countries that owed the military alliance money.",
    "url": "https://www.nytimes.com/2024/02/10/us/politics/trump-nato-russia.html"
  },
  {
    "text": "Donald Trump threatens NATO, says he would ‘encourage’ Russia to ‘do whatever the hell they want’  —  Former President Donald Trump again stirred fears about the future of NATO by suggesting he might not come to the aid of European nations if they're attacked by Russia − and might even … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/11/donald-trump-threatens-nato-russia/72556515007/"
  },
  {
    "text": "Trump asks about whereabouts of Haley's husband, who's serving overseas  —  Michael Haley deployed with the South Carolina National Guard last year.  —  CONWAY, South Carolina — Former President Donald Trump made a fresh jab at his GOP opponent Nikki Haley's husband during a rally Saturday afternoon … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-asks-whereabouts-haleys-husband-serving-overseas-rcna138247"
  },
  {
    "text": "Trump suggests he'd disregard NATO treaty, urge Russian attacks on allies  —  GOP front-runner said he encouraged Russia to “do whatever the hell they want” to member countries he views as not spending enough on own defense.  —  CONWAY, S.C. — Former president Donald Trump ramped up his attacks … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/10/trump-nato-allies-russia/"
  },
  {
    "text": "NATO Joins White House in Rejecting Trump's Remarks on Alliance  — Republican suggests repercussions for delinquent countries  — Biden administration says GOP frontrunner endangers security  —  NATO's top official joined the White House in slamming comments by Donald Trump … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-11/us-calls-trump-s-russia-remark-on-nato-allies-appalling"
  },
  {
    "text": "Trump Is Strongest GOP Leader Standing as Johnson, McConnell Take Flak  —  House and Senate Republicans grumble and feud as nomination front-runner gains power  —  WASHINGTON—A flurry of drama over the past week on and off Capitol Hill has made it clear that Republicans currently have just one dominant leader: Donald Trump.",
    "url": "https://www.wsj.com/politics/policy/republican-party-leader-donald-trump-299af353"
  },
  {
    "text": "Trump Says He Will Refuse to Honor NATO Treaty  —  Said enemies can “do whatever the hell they want”  —  At every rally, Trump loves to tell the story that references the only thing he knows about global security - the transactional relationship we have with our NATO allies.",
    "url": "https://www.meidastouch.com/news/trump-says-he-will-refuse-to-honor-nato-treaty"
  },
  {
    "text": "The Real “Robert Hur Report” (Versus What You Read in the News)  —  How the Special Counsel report has been misinterpreted  —  The Special Counsel Robert Hur report has been grossly mischaracterized by the press.  The report finds that the evidence of a knowing, willful violation of the criminal laws is wanting.",
    "url": "https://www.justsecurity.org/92090/the-real-robert-hur-report-versus-what-you-read-in-the-news/"
  },
  {
    "text": "Overwhelming majority of Americans think Biden is too old for another term: POLL  —  A majority also think Trump is too old for a second term.  —  President Joe Biden delivers remarks in the State Dining Room of the White House in Washington, D.C., on Feb. 6, 2024.",
    "url": "https://abcnews.go.com/Politics/poll-americans-on-biden-age/story?id=107126589"
  },
  {
    "text": "A State Supreme Court Just Issued Another Devastating Rebuke of the U.S. Supreme Court  —  The Hawaii Supreme Court handed down a unanimous opinion on Wednesday declaring that its state constitution grants individuals absolutely no right to keep and bear arms outside the context of military service.",
    "url": "https://slate.com/news-and-politics/2024/02/hawaii-supreme-court-guns-case-rebuke-scalia.html"
  },
  {
    "text": "How anarchists in North Carolina rescued books banned in Florida  —  A bookshop in left-leaning Asheville is now sending children's books back to the Sunshine State  —  ASHEVILLE, N.C. — When the managers of a small bookstore in this Appalachian mountain town received a call … ",
    "url": "https://www.washingtonpost.com/nation/2024/02/10/florida-book-ban-duval-schools/"
  },
  {
    "text": "Mike Gallagher Won't Seek Reelection After Refusal To Impeach Homeland Security Chief  —  U.S. Rep. Mike Gallagher says he won't run for a fifth term in Congress.  —  LOADING  —  U.S. Rep. Mike Gallagher, a key Republican Congressman who has spearheaded House pushback against the Chinese government … ",
    "url": "https://www.huffpost.com/entry/bc-us-gallagher-retirement_n_65c7db59e4b0fb721d614f76"
  }
]