[
  {
    "text": "Exclusive |  DOGE Staffer Resigns Over Racist Posts  —  A staffer for Elon Musk's Department of Government Efficiency whose access to U.S. Treasury payment systems was approved by a federal judge on Thursday has links to a deleted social-media account that advocated for racism and eugenics.",
    "url": "https://www.wsj.com/tech/doge-staffer-resigns-over-racist-posts-d9f11a93?st=AawTSB&reflink=article_copyURL_share"
  },
  {
    "text": "The US Treasury Claimed DOGE Technologist Didn't Have ‘Write Access’ When He Actually Did  —  Sources tell WIRED that the ability of DOGE's Marko Elez to alter code controlling trillions in federal spending was rescinded days after US Treasury and White House officials said it didn't exist.",
    "url": "https://www.wired.com/story/treasury-department-doge-marko-elez-access/"
  },
  {
    "text": "Elon Musk's Demolition Crew  —  On President Donald Trump's authority alone, Elon Musk, the world's richest man, has been unleashed on federal agencies.  Employees from Musk's companies and those of his allies, as well as young staffers he's recruited, are wresting authority from career workers and commandeering computer systems.",
    "url": "https://projects.propublica.org/elon-musk-doge-tracker/"
  },
  {
    "text": "DOGE follows longtime Musk pattern — and turns attention to Social Security Administration  —  The News  —  Elon Musk's DOGE shuttered USAID.  It has searched Medicare payments and gained access to a sensitive Treasury Department payment system.  Its initial Labor Department presence prompted a lawsuit.",
    "url": "https://www.semafor.com/article/02/06/2025/inside-doges-march-with-the-social-security-administration-soon-to-come"
  },
  {
    "text": "Senate Confirms Russell Vought as Office of Management and Budget Director  —  Mr. Vought, an architect of Project 2025 who served in the first Trump administration, will be at the center of President Trump's plans to upend the federal bureaucracy.  —  The Senate voted along party lines … ",
    "url": "https://www.nytimes.com/2025/02/06/us/politics/russell-vought-omb-senate-vote.html"
  },
  {
    "text": "Senate confirms Project 2025 architect Russell Vought to lead powerful White House budget office  —  The Senate confirmed Russell Vought as White House budget director on Thursday night, putting an official who has planned the zealous expansion of President Donald Trump's power … ",
    "url": "https://apnews.com/article/trump-russell-vought-confirmation-budget-project-2025-7d1c476694176876256e95cecbd49231"
  },
  {
    "text": "Senate confirms Russell Vought to lead White House budget office  —  The fiscal conservative returns to the post he held in Trump's first administration.  —  The Senate on Thursday confirmed Russell Vought as the next director of the powerful White House budget office … ",
    "url": "https://www.washingtonpost.com/business/2025/02/06/russell-vought-confirmed-omb-director/"
  },
  {
    "text": "DOGE Emails Went Out to Federal Judges by Mistake  —  One of the people who received an email from allies of  —  was a federal judge overseeing a lawsuit aimed at blocking these messages.  —  “I, like probably every other judge in the country, also received the [Office of Personnel Management] … ",
    "url": "https://www.newsweek.com/doge-emails-went-out-federal-judges-mistake-2027514"
  },
  {
    "text": "Conservative film critic who called child trafficking movie a ‘call to action’ arrested for child molestation  —  In 2023, Aaron Craig Gleason wrote a review for the conservative publication the Federalist about The Sound of Freedom, an indie hit and a favorite among right-wing circles.",
    "url": "https://www.dailydot.com/debug/aaron-gleason-child-molestation-sound-of-freedom/"
  },
  {
    "text": "Scoop: Trump orders key government agency to cancel all media contracts … - The discovery, made through a U.S. government spending database that has long been publicly available, triggered erroneous theories on X about the Biden administration “funding” anti-Trump media.",
    "url": "https://www.axios.com/2025/02/06/trump-politico-subscriptions-doge-elon-musk"
  },
  {
    "text": "Note to Our Readers  —  POLITICO has been the subject of debate on X this week.  Some of it has been misinformed, and some of it has been flat-out false.  Let's set the record straight.  —  POLITICO has been the subject of debate on X this week.  Some of it has been misinformed, and some of it has been flat-out false.",
    "url": "https://www.politico.com/news/2025/02/06/politico-note-to-readers-00202917"
  },
  {
    "text": "Trump administration to keep only 294 USAID staff out of over 10,000 globally, sources say  —  President Donald Trump's administration plans to keep fewer than 300 staff at the U.S. Agency for International Development out of the agency's worldwide total of more than 10,000, four sources told Reuters on Thursday.",
    "url": "https://www.reuters.com/world/us/trump-administration-keeping-only-294-usaid-staff-out-over-10000-globally-2025-02-06/"
  },
  {
    "text": "Trump Fires Head of Federal Election Panel, But She Won't Leave  — Commissioner Ellen Weintraub says procedures weren't followed  — Weintraub, a frequent Trump antagonist, joined the FEC in 2002  —  The chairwoman of the Federal Election Commission posted a letter from President Donald … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-07/trump-fires-head-of-fec-but-ellen-weintraub-won-t-leave"
  },
  {
    "text": "Trump Tax Priorities Total $5 to $11 Trillion  —  In a closed-door meeting with House Leadership today President Trump reportedly outlined his tax priorities.  According to press reports, they included extending the expiring pieces of the 2017 Tax Cuts and Jobs Act (TCJA); … ",
    "url": "https://www.crfb.org/blogs/trump-tax-priorities-total-5-11-trillion"
  },
  {
    "text": "Yes, My Name has Changed...  ...but my focus on center-right economic policy will continue  —  Hi everyone, well, this is awkward.  I have always been comfortable presenting my economic research in meetings, speeches, national TV interviews, and Congressional testimony.",
    "url": "https://www.jessicariedl.blog/p/yes-my-name-has-changed"
  },
  {
    "text": "Houston man pardoned by Trump arrested on child sex charge  —  Andrew Taake received a six-year sentence for assaulting officers on Jan. 6.  He was arrested Thursday on an outstanding charge of soliciting a minor.  —  A Houston man who was recently pardoned by President Donald Trump for his role … ",
    "url": "https://www.texastribune.org/2025/02/06/arrest-trump-pardon-insurrection/"
  },
  {
    "text": "Sotomayor hits presidential immunity decision in first public comments since new Trump admin  —  Supreme Court Justice Sonia Sotomayor on Wednesday doubled down on her opposition to the presidential immunity decision last summer and expressed concern about public confidence in the high court.",
    "url": "https://thehill.com/regulation/court-battles/5131656-sotomayor-hits-presidential-immunity-decision-in-first-public-comments-since-new-trump-admin/"
  },
  {
    "text": "Do Democrats Have a Plan?  —  Senator Brian Schatz on how the Party should be responding to Donald Trump's breakneck assault on the government.  —  Three weeks into office, President Trump has issued a slew of controversial executive orders, fired officials across government agencies … ",
    "url": "https://www.newyorker.com/news/q-and-a/do-democrats-have-a-plan-brian-schatz"
  },
  {
    "text": "Trump Administration Live Updates: Judge Delays Program Offering Federal Workers Incentives to Quit  —  Where Things Stand  — Judge delays resignation plan: A federal judge in Massachusetts has stopped, at least temporarily, the Trump administration's effort to get federal employees … ",
    "url": "https://www.nytimes.com/live/2025/02/06/us/president-trump-news"
  },
  {
    "text": "Trump energy secretary allowed 23-year-old DOGE rep to access IT systems over objections from general counsel  —  A representative from Elon Musk's Department of Government Efficiency, or DOGE, was granted access to the Energy Department's IT system on Wednesday by Energy Secretary Chris Wright … ",
    "url": "https://www.cnn.com/2025/02/06/climate/doge-energy-department-trump/"
  },
  {
    "text": "Eradicating Anti-Christian Bias  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  It is the policy of the United States, and the purpose of this order … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/02/eradicating-anti-christian-bias/"
  },
  {
    "text": "Michigan legislator says she underwent sterilization to avoid pregnancy during Trump presidency  —  Hundreds gather at the Michigan Capitol to protest Trump's politics  —  Hundreds of people gather on the steps of the Michigan State Capitol in Lansing, Mich., on Feb. 5, 2025 … ",
    "url": "https://michiganadvance.com/2025/02/06/michigan-legislator-says-she-underwent-sterilization-to-avoid-pregnancy-during-trump-presidency/"
  },
  {
    "text": "Casey DeSantis considers running for Florida governor amid push from top donors  —  The wife of Florida Gov. Ron DeSantis has long been rumored as a potential 2026 candidate, but the prospect is inching closer to reality.  —  TALLAHASSEE, Fla. — Republican donors at a gathering last week … ",
    "url": "https://www.nbcnews.com/politics/elections/casey-desantis-considers-running-florida-governor-push-top-donors-rcna191075"
  },
  {
    "text": "Trump's Gaza Takeover Plan May Sound Death Knell for the Two-State Solution  —  Already unlikely, the prospects for creation of a Palestinian state alongside Israel could vanish altogether if the United States takes over Gaza and displaces the population, as President Trump proposes.",
    "url": "https://www.nytimes.com/2025/02/06/us/politics/trump-gaza-two-state.html"
  },
  {
    "text": "N.C.A.A., Following Trump's Order, Excludes Transgender Athletes From Women's Sports  —  The decision, effective immediately, came a day after President Trump signed an order barring transgender girls and women from playing in women's sports at federally funded educational institutions.",
    "url": "https://www.nytimes.com/2025/02/06/us/politics/ncaa-transgender-athletes-ban.html"
  },
  {
    "text": "FCC Investigates SF Radio Station for ICE Reporting, Sparking Press Freedom Fears  —  The Federal Communications Commission is investigating San Francisco-based KCBS for its coverage of immigration enforcement actions in San José last month, sparking concerns from press freedom advocates … ",
    "url": "https://www.kqed.org/news/12025977/fcc-investigates-sf-radio-station-for-ice-reporting-sparking-press-freedom-fears"
  },
  {
    "text": "Dozens of Clinical Trials Have Been Frozen in Response to Trump's USAID Order  —  The stop-work order on U.S.A.I.D.-funded research has left thousands of people with experimental drugs and devices in their bodies, with no access to monitoring or care.  —  Asanda Zondi received a startling phone call … ",
    "url": "https://www.nytimes.com/2025/02/06/health/usaid-clinical-trials-funding-trump.html?unlocked_article_code=1.u04.9RLE.FchWQG7dLw3N&smid=url-share"
  }
]