[
  {
    "text": "Democrats Enter Risky Political Terrain as Protests Grip California  —  Scenes of unrest in Southern California, stoked by President Trump as he tries to deport more immigrants, have left Democratic leaders worried the confrontation elevates a losing issue for the party.",
    "url": "https://www.nytimes.com/2025/06/10/us/politics/trump-immigration-ice-democrats.html"
  },
  {
    "text": "Newsom Says Trump Is Destroying U.S. Democracy in Speech on L.A. Protests  —  Gov. Gavin Newsom of California called on Americans to stand up to President Trump in a nationally televised address.  —  Gov. Gavin Newsom made the case in a televised address Tuesday evening that President Trump's decisions … ",
    "url": "https://www.nytimes.com/2025/06/10/us/newsom-speech-trump-la-protests.html?unlocked_article_code=1.OE8.29sT.vD5yj7eCwxFt&smid=re-share"
  },
  {
    "text": "Marines that deployed to Los Angeles have not yet responded to immigration protests  —  National Guard troops began protecting immigration agents as they made arrests in Los Angeles on Tuesday, an expansion of their duties that had been limited to protecting federal property.",
    "url": "https://apnews.com/article/los-angeles-protests-ice-national-guard-9dfd2d025070bb6060d908dd3cf9b1f0"
  },
  {
    "text": "Congresswoman Charged for Forcibly Impeding and Interfering With Federal Officers  —  For Immediate Release  —  U.S. Attorney's Office, District of New Jersey  —  NEWARK, N.J. - U.S. Representative LaMonica McIver was charged in a three-count indictment today for forcibly impeding … ",
    "url": "https://www.justice.gov/usao-nj/pr/congresswoman-charged-forcibly-impeding-and-interfering-federal-officers"
  },
  {
    "text": "Rep. LaMonica McIver indicted on federal charges over clash with law enforcement at ICE facility in New Jersey  —  Interim U.S. Attorney for New Jersey Alina Habba said the Democratic lawmaker, who plans to plead not guilty, was indicted on three counts of interfering with law enforcement.",
    "url": "https://www.nbcnews.com/politics/congress/lamonica-mciver-indicted-federal-charges-ice-new-jersey-rcna212221"
  },
  {
    "text": "Trump Says Army Bases Will Revert to Confederate Names  —  The move would reverse a yearslong effort to remove names and symbols honoring the Confederacy from the military.  —  President Trump, during a speech at Fort Bragg, N.C., said on Tuesday that he would restore the names of all Army bases … ",
    "url": "https://www.nytimes.com/2025/06/10/us/politics/trump-army-base-rename-confederate.html"
  },
  {
    "text": "U.S. and China Agree to Get Geneva Pact Back on Track  —  Move marks the latest twist in countries' winding trade war  —  LONDON—U.S. and Chinese negotiators wrapped up two days of intense talks here with what they said was a framework to get their trade truce back on track and ratchet down tensions between the two biggest economies.",
    "url": "https://www.wsj.com/economy/trade/u-s-and-china-agree-to-get-geneva-pact-back-on-track-695eb5f5?st=w5GiCS&reflink=article_copyURL_share"
  },
  {
    "text": "The Silence of the Generals  —  As President Donald Trump crossed a dangerous line at Fort Bragg, the brass failed to speak out in the Army's defense.  —  President Donald Trump continued his war against America's most cherished military traditions today when he delivered a speech at Fort Bragg.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/06/silence-generals/683106/?gift=otEsSHbRYKNfFYMngVFweC9SKhWuL8c7oypTub1ifvo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "ABC News drops Terry Moran over late-night post attacking Trump and Stephen Miller  —  ABC News is parting ways with veteran correspondent Terry Moran, two days after he posted a missive on X calling President Donald Trump and deputy chief of staff Stephen Miller “world-class haters.”",
    "url": "https://cnn.com/2025/06/10/media/abc-news-terry-moran-exits-trump"
  },
  {
    "text": "Immigration raid rocks Nebraska meatpacking plant; protesters and law enforcement clash  —  Editor's note: Earlier reports indicated that U.S. Immigration and Customs Enforcement conducted raids at multiple locations in Omaha.  ICE has since confirmed worksite enforcement operations at one location.",
    "url": "https://flatwaterfreepress.org/ice-raids-hit-omaha-meatpacking-plants/"
  },
  {
    "text": "Trump to ramp up transfers to Guantánamo, including citizens of allies  —  The administration is preparing to send thousands of foreigners to the infamous detention facility, including people from Britain, France and Italy, with no plans to notify their home governments, officials said.",
    "url": "https://www.washingtonpost.com/national-security/2025/06/10/trump-guantanamo-deportations/"
  },
  {
    "text": "Tulsi Gabbard Admits to Asking AI What to Classify in JFK Files  —  EASIER THAT WAY  —  Gabbard revealed that she fed tens of thousands of documents about the JFK assassination into an AI program for review.  —  Tulsi Gabbard relied on artificial intelligence to determine what to classify … ",
    "url": "https://www.thedailybeast.com/tulsi-gabbard-admits-to-asking-ai-what-to-classify-in-jfk-files/"
  },
  {
    "text": "Send In the Troops, for Real  —  When local police can't restore order, the federal government has a duty to do so with a show of force.  —  Violent insurrectionists turned areas of Los Angeles into lawless hellscapes over the weekend, with anarchists setting fire to vehicles … ",
    "url": "https://www.wsj.com/opinion/send-in-the-troops-for-real-los-angeles-riots-ice-949c8ace"
  },
  {
    "text": "Appeals Court Keeps Trump's Sweeping Tariffs in Place for Now  —  Court will hear fast-track oral arguments this summer  —  A federal appeals court on Tuesday granted the Trump administration's request to keep the president's far-reaching tariffs in effect for now but agreed to fast track its consideration of the case this summer.",
    "url": "https://www.wsj.com/economy/trade/appeals-court-keeps-trumps-sweeping-tariffs-in-place-for-now-5f5c7f35"
  },
  {
    "text": "Mikie Sherrill Wins the Democratic Primary for Governor of New Jersey  —  Ms. Sherrill, the only woman in a six-candidate race for the Democratic nomination, emphasized her service as a U.S. Navy helicopter pilot.  —  Representative Mikie Sherrill on Tuesday won the Democratic Party's nomination … ",
    "url": "https://www.nytimes.com/2025/06/10/nyregion/nj-democratic-governor.html"
  },
  {
    "text": "Republicans warn Trump that some deportations go too far  —  Some GOP lawmakers are starting to warn the Trump administration to reconsider its all-in deportation push.  —  Why it matters: Republicans are convinced they have a clear mandate to kick out hardened criminals and gang members.",
    "url": "https://www.axios.com/2025/06/10/republicans-trump-deportations-ice-immigration"
  },
  {
    "text": "Most GOP lawmakers plan to skip Trump's big parade  —  POLITICO surveyed 50 Hill Republicans.  Only six said they'd stick around Saturday for the big show.  —  President Donald Trump is celebrating the Army's 250th anniversary — and his own 79th birthday — with a massive, multimillion-dollar military parade Saturday in Washington.",
    "url": "https://www.politico.com/news/2025/06/10/trump-parade-congress-republicans-00398774"
  },
  {
    "text": "X's Sales Pitch: Give Us Your Ad Business or We'll Sue  —  Elon Musk and CEO Linda Yaccarino launched a campaign to strong-arm advertisers back onto the platform  —  Late last year, Verizon Communications got an unusual message from a media company that wanted its business: Spend your ad dollars with us or we'll see you in court.",
    "url": "https://www.wsj.com/business/media/x-twitter-ad-revenue-campaign-lawsuit-a882b5c6?st=AAxSTY&reflink=article_copyURL_share"
  },
  {
    "text": "“Localhost tracking” explained.  It could cost Meta 32 billion.  —  What happened?  —  Meta devised an ingenious system (\"localhost tracking\") that bypassed Android's sandbox protections to identify you while browsing on your mobile phone — even if you used a VPN, the browser's incognito mode … ",
    "url": "https://www.zeropartydata.es/p/localhost-tracking-explained-it-could"
  },
  {
    "text": "Bob Costas Condemns Mainstream Press for Doing ‘MAGA Media’: 'There Really Isn't Two Sides'  —  Legendary sportscaster Bob Costas criticized the media over its handling of President Donald Trump's second term during an awards ceremony on Monday night.  —  Costas took several major media organizations … ",
    "url": "https://www.mediaite.com/media/news/bob-costas-condemns-mainstream-press-for-doing-maga-media-there-really-isnt-two-sides/"
  },
  {
    "text": "Southern Baptists Endorse Effort to Overturn Same-Sex Marriage  —  The nation's largest Protestant denomination was motivated by conservative Christians' success in reversing Roe v. Wade.  —  Southern Baptists voted overwhelmingly on Tuesday to call for the overturning of the Supreme Court ruling … ",
    "url": "https://www.nytimes.com/2025/06/10/us/southern-baptist-obergefell-same-sex-marriage.html?unlocked_article_code=1.N08.H_A-.sZdzFMPfxrwc&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "New PRRI Poll: Three-Quarters of Americans Oppose Trump's Military Parade  —  As the 250th anniversary of the United States Army approaches, which also coincides with President Donald Trump's 79th birthday, Washington is preparing to mark the occasion with a large-scale military parade featuring thousands … ",
    "url": "https://prri.org/spotlight/military-parade-in-d-c-draws-public-opposition-ahead-of-army-and-trump-celebrations/"
  },
  {
    "text": "Former, current CDC employees call on RFK Jr. to resign  —  Current and former employees of Centers for Disease Control and Prevention are calling on Health Secretary Robert F. Kennedy Jr. to resign, warning that job cuts and proposed funding reductions will hurt the agency's ability to protect the public from future health outbreaks.",
    "url": "https://www.axios.com/local/atlanta/2025/06/10/cdc-workers-protest-walk-out-advisory-committee-rfk"
  }
]