[
  {
    "text": "‘I was the director of the Michigan Republican Party.  I will vote for Kamala Harris.’  —  I was the executive director of the Michigan Republican Party, back during a time when the GOP embraced values like fiscal discipline and a strong foreign policy.  —  I voted for Nikki Haley … ",
    "url": "https://www.lansingcitypulse.com/stories/i-was-the-director-of-the-michigan-republican-party-i-will-vote-for-kamala-harris,115386"
  },
  {
    "text": "What More Do You People Want from Kamala Harris?  (Part Deux)  —  She's done everything voters could reasonably have asked for.  —  ∙ Paid  —  Tonight we're going to livestream Kamala Harris's big closing argument rally for Bulwark+ members.  The show starts at 7pm.",
    "url": "https://www.thebulwark.com/p/what-more-do-you-people-want-from-293"
  },
  {
    "text": "Kamala Harris leads Donald Trump in Morning Consult's latest presidential election poll  —  As Vice President Kamala Harris and former President Donald Trump vie for voters in key swing states, another national poll shows Harris with a slight lead over her opponent.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/29/presidential-election-poll-2024-harris-trump-morning-consult/75917456007/"
  },
  {
    "text": "Trump claims to ABC's Scott he didn't hear comedian's Puerto Rico comment, doesn't denounce it  —  The former president denied knowing the comedian who made a slew of racist, sexist and vulgar comments at his rally at Madison Square Garden, ABC News Senior Congressional Correspondent Rachel Scott reports.",
    "url": "https://abcnews.go.com/Politics/live-updates/2024-election-updates-harris-make-closing-argument-amid?id=115252538&entryId=115254897"
  },
  {
    "text": "Trump denies knowing comedian who made Puerto Rico joke at his rally … - People Trump claims not to have known include rapper Lil Jon, who was a contestant on Celebrity Apprentice; Prince Andrew; Rudy Giuliani associate Lev Parnas, who was part an effort to pressure Ukraine to investigate President Biden … ",
    "url": "https://www.axios.com/2024/10/29/trump-comment-puerto-rico-rally-tony-hinchcliffe"
  },
  {
    "text": "Trump says his New York rally marked by crude and racist insults was ‘an absolute lovefest’  —  Urged by some allies to apologize for racist comments made by speakers at his weekend rally, Donald Trump took the opposite approach on Tuesday, saying it was an “honor to be involved” … ",
    "url": "https://apnews.com/article/trump-harris-lovefest-rally-puerto-rico-6e079e7894a7e1db5dd4be76cccb452a"
  },
  {
    "text": "Man who attacked Nancy Pelosi's husband gets life in prison  —  SAN FRANCISCO — The man who was sentenced to 30 years in federal prison for attacking the husband of former House Speaker Nancy Pelosi with a hammer in their California home was sentenced Tuesday to life in prison without … ",
    "url": "https://www.npr.org/2024/10/29/nx-s1-5171029/man-who-attacked-nancy-pelosis-husband-gets-life-in-prison"
  },
  {
    "text": "Paul Pelosi attacker David DePape sentenced to life term on state charges  —  The man who was convicted in the 2022 attack on the husband of House Speaker Emerita Nancy Pelosi was sentenced to life in prison without the possibility of parole Tuesday following his state trial.",
    "url": "https://www.cbsnews.com/sanfrancisco/news/paul-pelosi-attacker-david-depape-sentenced-to-life-term-on-state-charges/"
  },
  {
    "text": "Teri Garr, the offbeat comic actor of ‘Young Frankenstein’ and ‘Tootsie,’ has died  —  Teri Garr, the quirky comedy actor who rose from background dancer in Elvis Presley movies to co-star of such favorites as “Young Frankenstein” and “Tootsie,” has died.  She was 79.",
    "url": "https://apnews.com/article/teri-garr-dies-be39482a60724c5bb81bbd8f34dfaf2d"
  },
  {
    "text": "Speaker Mike Johnson criticizes Obamacare and promises ‘massive reform’ if Trump wins  —  The Republican speaker said at an event in Pennsylvania that overhauling health care will be a major focus and that “Trump's going to go big” if he takes the presidency.",
    "url": "https://www.nbcnews.com/politics/congress/speaker-johnson-criticizes-obamacare-promises-massive-reform-trump-win-rcna177853"
  },
  {
    "text": "George W. Bush's Daughter Barbara Breaks Silence on Election to Campaign for Kamala Harris (Exclusive)  —  Barbara Pierce Bush tells PEOPLE she's “hopeful” that voters will back Harris on Nov. 5 to “move our country forward and protect women's rights”  —  Barbara Pierce Bush … ",
    "url": "https://people.com/george-w-bush-s-daughter-barbara-breaks-silence-on-election-to-campaign-for-kamala-harris-exclusive-8735810"
  },
  {
    "text": "Supreme Court rules RFK Jr. will appear on battleground ballots despite suspending campaign  —  The Supreme Court declined Tuesday to let Robert F. Kennedy Jr. withdraw his name from ballots in Michigan and Wisconsin, battleground states where votes for his now suspended campaign could cut into support for former President Donald Trump.",
    "url": "https://www.cnn.com/2024/10/29/politics/rfk-jr-supreme-court-wisconsin-michigan"
  },
  {
    "text": "Ex-Trump adviser Steve Bannon leaves prison, says he's “empowered” … - He predicted in a text message that former President Trump “will win with [the] chance to win big — complete repudiation of elites.” … - He was released at 3:15am Tuesday from federal prison in Danbury, Connecticut … ",
    "url": "https://www.axios.com/2024/10/29/steve-bannon-released-prison-trump-election"
  },
  {
    "text": "Elon Musk Makes Shocking Confession on His Plans After Trump Victory  —  Elon Musk admitted that he knows that Donald Trump's policies if elected president would crash the economy, but thinks that the price is worth it.  —  The tech CEO and social media mogul on Monday evening replied … ",
    "url": "https://newrepublic.com/post/187662/elon-musk-confession-economy-trump-victory"
  },
  {
    "text": "Elon Musk Bought a Texas Compound for His 11 Kids and Their Mothers … On a quiet, leafy street of multimillion-dollar properties, one stands out: a 14,400-square-foot mansion that looks like a villa plucked from the hills of Tuscany and transplanted to Austin, Texas.",
    "url": "https://www.nytimes.com/2024/10/29/business/elon-musk-children-compound.html?unlocked_article_code=1.V04.UATk.-c9h3lGvBo8r&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Burning Ballots  —  It's not what we normally expect in American elections, but it was all too predictable in this election cycle.  —  This morning in Portland, Oregon, an incendiary device attached to the outside of a ballot drop box started a fire inside of it.",
    "url": "https://joycevance.substack.com/p/burning-ballots"
  },
  {
    "text": "Transcript: Trump Rages at Fox News as His Allies Panic Over NYC Rally … Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.  I'm your host, Greg Sargent.  —  MAGA suddenly seems very, very out of sorts.",
    "url": "https://newrepublic.com/article/187646/transcript-trump-rages-fox-news-allies-panic-nyc-rally"
  },
  {
    "text": "On Elon Musk's X, Republicans go viral as Democrats disappear  —  A Washington Post analysis found that Republicans are posting more, getting followed more and going viral more now that the world's richest Trump supporter is running the show.  —  The top political accounts on X have seen … ",
    "url": "https://www.washingtonpost.com/technology/2024/10/29/elon-musk-x-republican-democrat-twitter-election/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwMTc0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxNTYwMzk5LCJpYXQiOjE3MzAxNzQ0MDAsImp0aSI6ImRjZjEzNDYxLTBlNjEtNGNhYy1hODE2LTMxNmIyZmRiNDcyMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMTAvMjkvZWxvbi1tdXNrLXgtcmVwdWJsaWNhbi1kZW1vY3JhdC10d2l0dGVyLWVsZWN0aW9uLyJ9._swxWtRAVNu7JUVWoRNfQo9uNEN8IbkWnVcw-C_22eg&itid=gfta"
  },
  {
    "text": "A vote for Donald Trump is a vote for school shootings and measles  —  An endorsement of democracy, solving problems, and Kamala Harris. … Donald Trump is a dangerous maniac who can barely complete a sentence, and it is lunacy to believe he can even recognize the existentially threatening … ",
    "url": "https://www.theverge.com/24282022/kamala-harris-endorsement-presidential-election-2024"
  },
  {
    "text": "This Trump supporter was labeled a noncitizen and kicked off Texas' voter rolls  —  Mary Howard-Elley is the 10th U.S. citizen identified by ProPublica, The Texas Tribune and Votebeat whose registration was canceled after her citizenship was questioned.  Her saga shows how tough it can be for eligible voters to get reinstated.",
    "url": "https://www.texastribune.org/2024/10/29/texas-noncitizen-voter-roll-removal-mary-howard-elley/"
  },
  {
    "text": "Chaos as Russia tries to absorb North Korean troops, Ukraine spies say  —  WASHINGTON − Ukraine's spies say they intercepted phone calls show chaos as Russia works to integrate North Korean troops into its military operations.  —  Some of the calls were intercepted from troops involved … ",
    "url": "https://www.usatoday.com/story/news/world/2024/10/29/russian-soldiers-north-korean-troops-intercepted-calls/75910608007/"
  },
  {
    "text": "Facebook Is Auto-Generating Militia Group Pages as Extremists Continue to Organize in Plain Sight  —  Ahead of the election, anti-government militias are using Facebook to recruit, coordinate training, and promote ballot box stakeouts.  Meta isn't shutting their groups down and is even auto-generating pages.",
    "url": "https://www.wired.com/story/facebook-militia-organizing-election/"
  },
  {
    "text": "Why an Apprentice Exec Broke His Silence About Donald Trump: “He Would Like to Be a Dictator”  —  In an interview with VF, former NBC chief marketing officer John Miller regrets mythologizing Trump's business savvy and recalls the host's “racist tendencies,” creepy pageant behavior, and how he could be manipulated with compliments.",
    "url": "https://www.vanityfair.com/news/story/apprentice-exec-broke-silence-donald-trump-dictator"
  }
]