[
  {
    "text": "Inside the Worst Three Weeks of Donald Trump's 2024 Campaign  —  People around the former and would-be president see a candidate knocked off his bearings, disoriented by his new contest with Kamala Harris and unsure of how to take her on.  —  The Aug. 2 dinner at the Bridgehampton, N.Y. … ",
    "url": "https://www.nytimes.com/2024/08/10/us/politics/trump-campaign-election.html?unlocked_article_code=1.B04.8Ov0.QyvP9oMUtuV9&smid=url-share"
  },
  {
    "text": "Report: Trump calls Harris a “bitch” … Steven Cheung, Trump campaign communications director, told The Times: “That is not language President Trump has used to describe Kamala, and it's not how the campaign would characterize her.” … - At his Mar-a-Lago news conference on Thursday … ",
    "url": "https://www.axios.com/2024/08/10/trump-calls-harris-bitch-report"
  },
  {
    "text": "The other Black politician who says he was with Trump in that near-fatal chopper crash  —  Former Los Angeles city councilman and state senator Nate Holden said in an exclusive interview late Friday that he remembers the near-death experience well.  —  The man who almost crashed in a helicopter … ",
    "url": "https://www.politico.com/news/2024/08/09/trump-plane-crash-california-00173487"
  },
  {
    "text": "Yes, Trump Was in a Scary Helicopter Ride.  But Not With That Politician.  —  There was a helicopter.  It did make an emergency landing.  But a former California lawmaker says Donald Trump has mixed up one Black lawmaker for another.  —  Donald J. Trump was doubling down on Friday … ",
    "url": "https://www.nytimes.com/2024/08/10/us/politics/trump-helicopter-crash-willie-brown.html?unlocked_article_code=1.B04.wRAg.KC17vTGHmf8H&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "“We're not weird.”  —  Audio playback is not supported on your browser.  Please upgrade.  —  I am watching the Harris-Walz rally in Arizona as I write this newsletter on Friday evening.  The venue is packed, and the crowd is wildly enthusiastic.  Tim Walz delivered an even more enthusiastic speech … ",
    "url": "https://roberthubbell.substack.com/p/were-not-weird"
  },
  {
    "text": "Trump Claims He Has Helicopter Trip Records and Threatens to Sue  —  Former President Donald J. Trump insisted that he was in a dangerous helicopter landing, though the man he said he was with said it never happened.  —  Former President Donald J. Trump on Friday afternoon vehemently maintained … ",
    "url": "https://www.nytimes.com/2024/08/09/us/politics/trump-helicopter-landing.html?unlocked_article_code=1.Bk4.2Xdy.ZnpbPWUHWbI3&smid=url-share"
  },
  {
    "text": "Inside Project 2025's Secret Training Videos  —  Co-published with Documented  — DEEP STATE BATTLE: Project 2025's plan to train an army of political appointees who could fight the so-called deep state on behalf of a future Trump administration remains on track.",
    "url": "https://www.propublica.org/article/inside-project-2025-secret-training-videos-trump-election"
  },
  {
    "text": "Watch: 14 Hours of Never-Before-Published Videos From Project 2025's Presidential Administration Academy  —  Co-published with Documented  —  ProPublica and Documented obtained more than 14 hours of never-before-published videos from Project 2025's Presidential Administration Academy … ",
    "url": "https://www.propublica.org/article/video-project-2025-presidential-training-academy-trump-election"
  },
  {
    "text": "Harris Leads Trump in Three Key States, Times/Siena Polls Find  —  New surveys of Michigan, Wisconsin and Pennsylvania taken this week offer the latest indication of a dramatic reversal in standing for the Democratic Party since President Biden abandoned his re-election bid.",
    "url": "https://www.nytimes.com/2024/08/10/us/politics/harris-trump-battleground-polls.html?unlocked_article_code=1.B04.Q2KR.mNlzgt8msrxe&smid=url-share"
  },
  {
    "text": "Harris vs. Trump: America's mood-swing election … Former President Trump sees fear as the primary motivator — fear of illegal immigration, crime, inflation, a declining America.  He believes swing voters will embrace his darker view and demand protection, even if they don't love his style.",
    "url": "https://www.axios.com/2024/08/10/harris-walz-joy-trump-revenge"
  },
  {
    "text": "Cross-Tabs: August 2024 Times/Siena Poll of the Likely Electorate in Michigan, Pennsylvania and Wisconsin  —  Results of New York Times/Siena College polls of Michigan, Pennsylvania and Wisconsin conducted among 1,973 likely voters from Aug. 5 to 9, 2024.  —  Thinking ahead to the presidential … ",
    "url": "https://www.nytimes.com/interactive/2024/08/10/us/elections/times-siena-poll-likely-electorate-crosstabs.html"
  },
  {
    "text": "Cross-Tabs: August 2024 Times/Siena Poll of Registered Voters in Michigan, Pennsylvania and Wisconsin  —  Results of New York Times/Siena College polls of Michigan, Pennsylvania and Wisconsin conducted among 1,973 registered voters from Aug. 5 to 9, 2024.  —  Thinking ahead to the presidential … ",
    "url": "https://www.nytimes.com/interactive/2024/08/10/us/elections/times-siena-poll-registered-voter-crosstabs.html"
  },
  {
    "text": "Tim Walz ‘misspoke’ when he discussed using weapons ‘in war,’ campaign says  —  The statement from the Harris campaign follows criticism of Walz's military record by vice presidential candidate Sen. JD Vance and other Republicans.  —  Minnesota Gov. Tim Walz “misspoke” … ",
    "url": "https://www.nbcnews.com/politics/2024-election/tim-walz-misspoke-discussed-using-weapons-war-campaign-says-rcna166038"
  },
  {
    "text": "Kroger's new dynamic AI pricing scheme is ‘corporate greed is out of control’: critics  —  Expressing doubt that a new artificial intelligence-powered “dynamic pricing” model used by the Kroger grocery chain is truly meant to “better the customer experience,” Sens. Elizabeth Warren said Friday … ",
    "url": "https://www.rawstory.com/kroger-pricing-strategy/"
  },
  {
    "text": "Harris shutting down ‘lock him up’ chants shields Trump's federal Jan. 6 case from even more delays  —  Any comments Kamala Harris makes that could be seen as referencing the federal charges against Donald Trump could affect his election interference case.  —  WASHINGTON — Vice President … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-shutting-lock-chants-shields-trumps-federal-jan-6-case-even-del-rcna165837"
  },
  {
    "text": "More than 90 Palestinians killed in Israeli strike on school and mosque sheltering displaced people, Gaza officials say  —  At least 93 Palestinians have been killed in an Israeli strike on a school and mosque in Gaza sheltering displaced people, according to local officials.",
    "url": "https://www.cnn.com/2024/08/10/middleeast/israeli-school-strike-gaza-intl-hnk/"
  },
  {
    "text": "Kamala Harris could make history as the first president to work at McDonald's  —  Fast food workers fighting for union recognition, higher minimum wages and better working conditions could have a powerful advocate in a former fellow french fry cook, Alex Woodward reports  —  Support truly",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/kamala-harris-mcdonalds-minimum-wage-b2594233.html"
  },
  {
    "text": "Montana GOP Senate candidate touts his business.  It's losing millions  —  After last year's slow wildfire season, Tim Sheehy's aerial firefighting company has suffered steep losses.  —  As he campaigns in one of the nation's most competitive U.S. Senate races, Montana Republican Tim Sheehy recounts … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/10/tim-sheehy-firefighting-company-losses-wildfires/"
  },
  {
    "text": "UK police commissioner threatens to extradite, jail US citizens over online posts: 'We'll come after you'  —  London's Metropolitan Police chief warned that officials will not only be cracking down on British citizens for commentary on the riots in the UK, but on American citizens as well.",
    "url": "https://nypost.com/2024/08/10/media/uk-police-commissioner-threatens-to-extradite-jail-us-citizens-over-online-posts-well-come-after-you/"
  },
  {
    "text": "GOP nominee to run North Carolina schools advocated pro-Trump military coup in January 6 video  —  Michele Morrow, the Republican nominee to run K-12 public education in North Carolina, filmed a video after attending the January 6 riot at the US Capitol urging then-President Donald Trump to put … ",
    "url": "https://www.cnn.com/2024/08/09/politics/kfile-michele-morrow-january-6-comments/"
  },
  {
    "text": "Fox News hosts mocked for outrage over Kamala Harris' cooking videos  —  Fox News hosts expressed dismay Friday over the fact that Vice President Kamala Harris likes to cook — and their outrage sparked immediate mockery.  —  Host Julie Banderas complained about cooking videos Harris has starred in … ",
    "url": "https://www.rawstory.com/kamala-harris-cooking-fox-news/"
  }
]