[
  {
    "text": "Harris' campaign plans to ramp up its negative messaging against Trump  —  The new phase in the final weeks of the presidential campaign is aimed at trying to persuade undecided voters to support the vice president, Harris aides said.  —  WASHINGTON — Vice President Kamala Harris' campaign … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-campaign-plans-ramp-negative-messaging-trump-rcna174039"
  },
  {
    "text": "Scoop: VC titan Ben Horowitz plans “significant” donation to Kamala Harris … - At the time, President Biden was still running for re-election. … - He notes that he and Felicia have known Harris for more than a decade, and she's been “a great friend to both of us over that time.”",
    "url": "https://www.axios.com/2024/10/04/ben-horowitz-endorse-kamala-harris"
  },
  {
    "text": "Donald Trump's foul-mouthed migrant rant captured in private pitch to donors  —  Republican nominee claims Harris is threat to democracy in recording of top-dollar fundraiser in Colorado in August  —  Donald Trump unleashed a foul-mouthed tirade about undocumented immigrants and predicted that this … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/04/trump-fundraiser-recording"
  },
  {
    "text": "Trump Made Crass Jokes About Death of Rally Attendee in Leaked Recording  —  DUDE, NO  —  The 12-minute tape, reportedly from a dinner with donors in August, also features Trump launching into an expletive-laden rant against undocumented migrants.  —  Donald Trump was reportedly caught … ",
    "url": "https://www.thedailybeast.com/donald-trump-made-crass-jokes-about-death-of-corey-comparatore-in-leaked-recording"
  },
  {
    "text": "No, Biden didn't take FEMA relief money to use on migrants — but Trump did  —  Donald Trump falsely accuses President Biden of redirecting disaster funds, a budget maneuver Trump himself approved in 2019. … — Former president Donald Trump, remarks at a campaign rally in Saginaw, Mich., Oct. 3",
    "url": "https://www.washingtonpost.com/politics/2024/10/04/no-biden-didnt-take-fema-relief-money-use-migrants-trump-did/"
  },
  {
    "text": "Hurricane Helene: Rumor Response  —  Help keep yourself, your family and your community safe after Hurricane Helene by being aware of rumors and scams and sharing official information from trusted sources.  —  Do your part to the stop the spread of rumors by doing three easy things:",
    "url": "https://www.fema.gov/disaster/current/hurricane-helene/rumor-response"
  },
  {
    "text": "‘Trump Bible’ one of few that meet Walters' criteria for Oklahoma classrooms  —  Jennifer Palmer, Paul Monies, Heather WarlickOklahoma Watch  —  Superintendent Ryan Walters isn't just talking about buying Bibles for schools.  —  Bids opened Monday for a contract to supply the state Department of Education with 55,000 Bibles.",
    "url": "https://www.oklahoman.com/story/news/2024/10/04/donald-trump-supported-bible-one-of-few-that-meets-ryan-walters-criteria-for-ok-classrooms/75510021007/"
  },
  {
    "text": "Jamie Dimon denies Trump's claim that JPMorgan CEO has endorsed him … JPMorgan Chase on Friday flatly denied that its CEO, Jamie Dimon, has endorsed Donald Trump for president, minutes after the Republican nominee claimed on social media that Dimon had endorsed him.  —  “Jamie Dimon has not endorsed anyone.",
    "url": "https://www.cnbc.com/2024/10/04/trump-jamie-dimon-endorsement-jpmorgan.html"
  },
  {
    "text": "A Woman Among Cowardly Men  —  The outlook wasn't brilliant for the Citifield nine that day;  —  the score stood two to zero, with but one inning more to play.  —  But the Mets, as usual, managed to find a way.  —  Saving our own Bill Kristol from emotional decay.... Happy Friday.",
    "url": "https://www.thebulwark.com/p/a-woman-among-cowardly-men"
  },
  {
    "text": "Bruce Springsteen Backs Harris and Blasts Trump Out of This World  —  Yesterday, rock legend Bruce Springsteen endorsed Kamala Harris for President.  —  In an Instagram video that instantly went viral, Springsteen said, “Kamala Harris and Tim Walz are committed to a vision of this country … ",
    "url": "https://www.dworkinsubstack.com/p/bruce-springsteen-backs-harris-and"
  },
  {
    "text": "Minnesota GOP Senate candidate: ‘The bad guys won in WWII’  —  As the control of the Senate hangs in the balance, GOP candidates across the country are facing a similar problem: Troubling and bizarre past statements, both in-person and on social media, are coming back to haunt them.",
    "url": "https://heartlandsignal.com/2024/10/04/minnesota-gop-senate-candidate-the-bad-guys-won-in-wwii/"
  },
  {
    "text": "Blowout US employment report reinforces economy's resilience  —  U.S. job gains increased by the most in six months in September and the unemployment rate fell to 4.1%, pointing to a resilient economy that likely does not need the Federal Reserve to deliver large interest rate cuts for the rest of this year.",
    "url": "https://www.reuters.com/markets/us/us-job-growth-surges-september-unemployment-rate-falls-41-2024-10-04/"
  },
  {
    "text": "The reasons people say they leave Donald Trump's rallies early  —  The Republican nominee consistently draws large, enthusiastic and rowdy crowds to his rallies and other campaign events, and at nearly all of them, another trend is clear: Scores of people head out before the end.",
    "url": "https://www.washingtonpost.com/politics/2024/10/04/trump-rally-departures-early/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4MDE0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5Mzk2Nzk5LCJpYXQiOjE3MjgwMTQ0MDAsImp0aSI6ImY4M2U1NzE3LWI3MTItNDhiZS05YzA0LWUzYjJlNDcyMTgyNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzA0L3RydW1wLXJhbGx5LWRlcGFydHVyZXMtZWFybHkvIn0.EzCSs79smouMO8U6kb8xBp56nvpxe8uYfJUPi3zOQrw&itid=gfta"
  },
  {
    "text": "As fraud scandals erupt in Minnesota on Gov. Tim Walz's watch, accountability is in short supply  —  One state audit found that bonus checks intended for frontline workers during the pandemic were handed out to undeserving recipients.  Another criticized a Minnesota state agency for failing … ",
    "url": "https://www.cnn.com/2024/10/04/politics/walz-audits-fraud-accountability-invs/"
  },
  {
    "text": "Do the Math: Trump Is Toast  —  If everyone does their part in the next few weeks, Trump is going down in flames.  So say I.  —  Right now, if you know how to really read the polls, or if you have access to the various private and internal polling being conducted by and shared only amongst the elites … ",
    "url": "https://www.michaelmoore.com/p/do-the-math-trump-is-toast"
  },
  {
    "text": "How Biden helped end a port strike that threatened Democrats in November  —  With early morning Zoom calls and a surprising ultimatum, the White House brain trust averted a potential economic disaster weeks before the election.  —  It was a stark ultimatum, delivered by President Joe Biden's most senior aide.",
    "url": "https://www.washingtonpost.com/business/2024/10/04/biden-white-house-harris-port-strike/"
  },
  {
    "text": "Jack Smith's October Cheap Shot  —  Jack Smith has failed in his quest to try Donald Trump before the 2024 election.  So instead, the special counsel has bent ordinary procedure to get in one last shot, just weeks before voters go to the polls.  —  Smith has now dropped a 165-page doorstop … ",
    "url": "https://nymag.com/intelligencer/article/jack-smith-october-surprise-donald-trump.html"
  },
  {
    "text": "As America's Marijuana Use Grows, So Do the Harms  —  The drug, legal in much of the country, is widely seen as nonaddictive and safe.  For some users, these assumptions are dangerously wrong.  —  In midcoast Maine, a pediatrician sees teenagers so dependent on cannabis that they consume … ",
    "url": "https://www.nytimes.com/2024/10/04/us/cannabis-marijuana-risks-addiction.html"
  },
  {
    "text": "Woman who accused Lewandowski of assault says his lawyers tried to buy her silence  —  The political class barely shrugged in August when Corey Lewandowski announced he was back at former President Donald Trump's side.  But when Trashelle Odom learned that Lewandowski had joined Trump's 2024 … ",
    "url": "https://www.cbsnews.com/news/corey-lewandowski-accuser-trashelle-odom-stalking-assault/"
  },
  {
    "text": "NYC Deputy Mayor Sheena Wright, Adams' right hand, set to resign in latest City Hall turmoil  —  First Deputy Mayor Sheena Wright will be forced to resign as soon as Friday, The Post has learned — the latest high-level exit from Mayor Eric Adams' increasingly troubled administration.",
    "url": "https://nypost.com/2024/10/04/us-news/nyc-deputy-mayor-sheena-wright-adams-right-hand-set-to-resign-in-latest-city-hall-turmoil/"
  },
  {
    "text": "NPR's coverage of a questionable viral moment  —  Patrick Eidsmo wrote on Sept. 17: Hello - this is a really unfair headline and story. … This Sept. 17 NPR online story was intended to document a viral internet moment.  —  Here's the back story: National Review Editor-in-Chief Rich Lowry appeared … ",
    "url": "https://view.nl.npr.org/?vawpToken=PF2XCWK3JOHEZFKJJICU5G5I2Q.60239"
  },
  {
    "text": "Idaho State Senator Tells Native American Candidate to “Go Back Where You Came From”  —  The thing is, she was already there.  —  Thinking before you speak publicly is an important skill.  Idaho State Sen. Dan Foreman, a conservative Republican, apparently did not get the memo.",
    "url": "https://www.motherjones.com/politics/2024/10/idaho-state-senator-dan-foreman-native-american-candidate-go-back-where-you-came-from/"
  },
  {
    "text": "Michele Fiore convicted by jury in wire fraud case  —  LAS VEGAS (KLAS) — A jury convicted Pahrump Justice of the Peace Michele Fiore on all counts in a federal wire fraud case on Thursday.  —  Fiore, currently suspended from her Pahrump duties, was charged with one count of conspiracy … ",
    "url": "https://www.8newsnow.com/investigators/michele-fiore-convicted-by-jury-in-wire-fraud-case/"
  },
  {
    "text": "House Races Across the Midwest Move in Democrats' Favor  —  The 2022 midterm cycle was defined by divergent results across different regions of the country: Republicans ran strongest in blue states, picking up seats that Joe Biden won by double digits in 2020, while Democrats mostly held the line in districts in purple and red states.",
    "url": "https://www.cookpolitical.com/analysis/house/house-overview/house-races-across-midwest-move-democrats-favor"
  },
  {
    "text": "Buttigieg claps back at Elon Musk for false claims about Helene federal response … Transportation Secretary Pete Buttigieg spoke directly to Elon Musk Friday on the billionaire's X platform, part of an effort to counter false conspiracies about federal disaster aid for victims of Hurricane Helene … ",
    "url": "https://www.cnbc.com/2024/10/04/elon-musk-helene-aid-buttigieg.html"
  },
  {
    "text": "Two men have re-engineered the US electoral system in favor of Republicans  —  If the right strews constitutional chaos over the certification of this presidential election, two people will have cleared the path  —  Two men recognized and exploited the anti-democratic loopholes within … ",
    "url": "https://www.theguardian.com/commentisfree/2024/oct/04/electoral-college-map-gerrymandering"
  }
]