[
  {
    "text": "Republican infighting paralyzes the House as some call a shutdown inevitable  —  With 11 days to go until a government shutdown, a House GOP stalemate over messaging bills is deepening.  —  WASHINGTON — Republican divisions paralyzed the House again on Tuesday as a small band … ",
    "url": "https://www.nbcnews.com/politics/congress/republican-infighting-paralyzes-house-call-shutdown-inevitable-rcna105882"
  },
  {
    "text": "McCarthy Capitulates Again as House GOP Implodes Spectacularly Over Spending Bill  —  Members didn't hold back from trashing their colleagues in public over the doomed plan to avoid a government shutdown.  —  Republican House Speaker Kevin McCarthy (R-CA) appeared to capitulate for the second … ",
    "url": "https://www.thedailybeast.com/house-gop-implodes-over-its-doomed-government-shutdown-plan"
  },
  {
    "text": "House GOP in open warfare over doomed spending plan  —  One Republican summed up the situation neatly as leadership-empowered negotiators faceplanted with days to go before a shutdown: “It's a mess.”  —  As House Republicans began ripping apart their party's latest spending proposal … ",
    "url": "https://www.politico.com/news/2023/09/19/house-gop-spending-plan-00116631"
  },
  {
    "text": "McCarthy scrambles: House punts key vote as rebellion rages - Live Updates  —  Speaker Kevin McCarthy has vowed to press toward a vote as soon as Thursday, but conservatives are still chafing.",
    "url": "https://www.politico.com/live-updates/2023/09/19/congress/gop-punts-vote-00116763"
  },
  {
    "text": "Go ahead, silence Donald Trump  —  Special counsel Jack Smith recently filed for an extraordinary gag order against Donald Trump.  The prosecutor wants to limit Trump's ability to criticize the criminal case against him for trying to overturn his 2020 election loss.",
    "url": "https://www.washingtonpost.com/opinions/2023/09/19/donald-trump-gag-order/"
  },
  {
    "text": "Ex-GOP Congressman Gets 22 Months in Prison for Insider Trading  — Stephen Buyer traded ahead of M&A deals after he left office  — Buyer represented Indiana in Congress between 1993 to 2011  —  A former Republican congressman from Indiana was ordered to spend 22 months in prison … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-19/ex-gop-congressman-gets-22-months-in-prison-for-insider-trading"
  },
  {
    "text": "‘Sound of Freedom’ Producer Felt the Naked Breasts of Apparently Underage Trafficking Victim  —  Files from a joint local and federal criminal investigation released to VICE News describe video evidence of the incident, which took place in Mexico on an Operation Underground Railroad mission.",
    "url": "https://www.vice.com/en/article/z3mq5w/sound-of-freedom-producer-underage-trafficking-victim"
  },
  {
    "text": "Marjorie Taylor Greene pens tell-all, ‘setting the record straight’  —  EXCLUSIVE — Rep. Marjorie Taylor Greene, the Georgia Republican who overcame Democratic silencing efforts to become one of the most effective voices on the Right, is getting ready to settle some scores with an autobiography … ",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/marjorie-taylor-greene-tell-all-book-autobiography"
  },
  {
    "text": "Ray Epps, subject of Tucker Carlson's Jan. 6 conspiracy theories, charged by DOJ  —  Epps entered Capitol grounds on Jan. 6 as a supporter of former President Donald Trump.  He told the Jan. 6 committee that the conspiracy theories about him ruined his life.",
    "url": "https://www.nbcnews.com/politics/justice-department/ray-epps-subject-tucker-carlsons-jan-6-conspiracy-theories-charged-doj-rcna99836"
  },
  {
    "text": "This is what taking on election deniers really looks like  —  Democrats won a whole lot of elections in 2022, in no small part on their vow to strengthen and defend democracy.  But if they hope to turn the issue into a sustained political winner, they have to deliver on that promise … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/19/josh-shapiro-automatic-voter-registration-pennsylvania-trump-maga/"
  },
  {
    "text": "Sen. John Fetterman Mocks Right-Wing Conspiracy Theory That He Has A Body Double  —  He also joked about GOP outrage over the new Senate dress code: “Republicans think I'm going to burst in through the doors and start break dancing on the floor.”  —  LOADING",
    "url": "https://www.huffpost.com/entry/john-fetterman-body-double-conspiracy-theory_n_6509d9c9e4b0b49f330a08f4"
  },
  {
    "text": "Witness testimony disputes IRS whistleblower allegations in Hunter Biden probe as Republicans begin impeachment inquiry  —  New testimony from a number of FBI and Internal Revenue Service officials casts doubt on key claims from an IRS whistleblower who alleges there was political interference … ",
    "url": "https://www.cnn.com/2023/09/19/politics/witness-testimony-disputes-irs-whistleblower-hunter-biden/"
  },
  {
    "text": "Germany went from envy of the world to the worst-performing major developed economy.  What happened?  —  For most of this century, Germany racked up one economic success after another, dominating global markets for high-end products like luxury cars and industrial machinery … ",
    "url": "https://apnews.com/article/germany-economy-energy-crisis-russia-8a00eebbfab3f20c5c66b1cd85ae84ed"
  },
  {
    "text": "Dr. Anthony Fauci and wife had $11 million net worth before he left government  —  Dr. Anthony Fauci and his spouse had a net worth of over $11 million when the then-director of the National Institute of Allergy and Infectious Diseases stepped down from his top government role, documents show.",
    "url": "https://www.washingtonexaminer.com/policy/healthcare/anthony-fauci-wife-net-worth-11-million"
  },
  {
    "text": "West Point sued by group behind Supreme Court affirmative action lawsuit  —  The group behind the lawsuits that led the Supreme Court to gut affirmative action at higher education institutions sued the U.S. Military Academy at West Point on Tuesday, seeking to end the school's race-conscious admissions policies.",
    "url": "https://thehill.com/regulation/court-battles/4212337-west-point-sued-by-group-behind-supreme-court-affirmative-action-lawsuit/"
  },
  {
    "text": "Biden Impeachment Probe Supported by Almost Half of Voters  —  Voters are divided over whether the impeachment investigation is largely due to evidence of wrongdoing by Biden or motivation to damage his political career.  —  Share of voters who said they support or oppose … ",
    "url": "https://pro.morningconsult.com/instant-intel/biden-impeachment-polling"
  },
  {
    "text": "Lauren Boebert's sexy adventure: Blame conservatives' push for “traditional marriage”  —  Bari Weiss and Nicholas Kristof amplify GOP calls to marry young — that's just what the Colorado congresswoman did  —  It is a cycle as predictable as the sun rising and setting … ",
    "url": "https://www.salon.com/2023/09/19/lauren-boeberts-sexy-adventure-conservatives-push-for-traditional-marriage/"
  },
  {
    "text": "Tuberville to try going around his own blockade to confirm Marine commandant  —  Sen. Tommy Tuberville (R-Ala.) told senators that he will attempt to force a one-off vote on Wednesday to confirm Gen. Eric Smith to become the new commandant for the Marine Corps while he maintains his blockade on more than 300 military promotions.",
    "url": "https://thehill.com/homenews/senate/4212731-tuberville-to-try-going-around-his-own-blockade-to-confirm-marine-commandant/"
  },
  {
    "text": "Temple's acting president, JoAnne A. Epps, has died after falling ill on stage at university event  —  JoAnne A. Epps, acting president of Temple University and long-time employee, has died after falling ill on stage Tuesday afternoon during a university event, said Mitchell L. Morgan, chair of the board of trustees.",
    "url": "https://www.inquirer.com/education/joanne-epps-temple-university-president-dies-20230919.html"
  },
  {
    "text": "Hardeep Singh Nijjar: Canada accuses India of role in Sikh leader's murder  —  Canada has accused India of involvement in the killing of a Canadian Sikh leader, an allegation strongly denied by Delhi.  —  On Monday PM Justin Trudeau said Canada was looking at “credible allegations potentially linking” … ",
    "url": "https://www.bbc.com/news/uk-66848041"
  }
]