[
  {
    "text": "Why the Polls Might Be Wrong — in Kamala Harris' Favor  —  It's taken pollsters eight years to pin down Trump's voters.  Is 100 days really enough to accurately capture potential Harris voters?  —  For eight years, pollsters have been striving to accurately capture former President Donald Trump's level of support among voters.",
    "url": "https://www.politico.com/news/magazine/2024/11/01/shy-kamala-harris-voters-polling-00186653"
  },
  {
    "text": "Trump lagging in early vote with seniors in Pennsylvania, a red flag for GOP  —  Democrats account for about 58 percent of the votes cast by seniors so far in Pennsylvania.  —  Donald Trump is lagging Kamala Harris in Pennsylvania early voting with a critical and once-reliably Republican constituency: seniors.",
    "url": "https://www.politico.com/news/2024/10/31/trump-lagging-early-votes-seniors-pennsylvania-00186612"
  },
  {
    "text": "Liz Cheney Fires Back at Trump, Accuses Him of Threatening Her ‘With Death’ in Blistering Counter  —  Liz Cheney shot back at former President Donald Trump's comments from Thursday night, where he darkly floated a scenario where guns were firing at the former Republican Congressional leader and Kamala Harris supporter.",
    "url": "https://www.mediaite.com/politics/liz-cheney-fires-back-at-trumps-threatening-her-with-death-with-blistering-counter-attack/"
  },
  {
    "text": "When You Thought He Couldn't Sink Lower  —  Donald Trump's two strongest personality traits each had a moment on the campaign trail yesterday.  —  At a rally in Albuquerque, New Mexico, the buffoon: “I'm here for one very simple reason.  I like you very much, and it's good for my credentials with the Hispanic and Latino community.”",
    "url": "https://www.thebulwark.com/p/when-you-thought-he-couldnt-sink"
  },
  {
    "text": "AP sources: White House altered record of Biden's ‘garbage’ remarks despite stenographer concerns  —  White House press officials altered the official transcript of a call in which President Joe Biden appeared to take a swipe at supporters of Donald Trump, drawing objections from the federal workers … ",
    "url": "https://apnews.com/article/biden-garbage-transcript-puerto-rico-trump-326e2f516a94a470a423011a946b6252"
  },
  {
    "text": "Trump Assails Liz Cheney and Imagines Guns ‘Shooting at Her’  —  Former President Donald J. Trump used violent imagery as he slammed one of his leading Republican critics while criticizing U.S. involvement in foreign conflicts.  —  Former President Donald J. Trump assailed Liz Cheney … ",
    "url": "https://www.nytimes.com/2024/11/01/us/politics/trump-liz-cheney-tucker-carlson.html"
  },
  {
    "text": "Longtime Washington Post columnist Hugh Hewitt quits newspaper  —  Hewitt quit after walking off newspaper's ‘Washington Post Live’ show  —  Longtime Washington Post columnist Hugh Hewitt quit the newspaper on Friday, he told Fox News Digital.  —  Hewitt, a conservative who hosts … ",
    "url": "https://www.foxnews.com/media/longtime-washington-post-columnist-hugh-hewitt-quits-newspaper-after-seven-year-run"
  },
  {
    "text": "Hugh Hewitt quits Washington Post after storming off livestream talk over dispute with liberal columnists: 'I won't come back'  —  Conservative radio host Hugh Hewitt resigned from the Washington Post after he stormed off a livestreamed discussion on Friday amid a dispute … ",
    "url": "https://nypost.com/2024/11/01/media/hugh-hewitt-quits-washington-post-after-storming-off-broadcast/"
  },
  {
    "text": "A Pregnant Teenager Died After Trying to Get Care in Three Visits to Texas Emergency Rooms  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Candace Fails screamed for someone in the Texas hospital to help her pregnant daughter.",
    "url": "https://www.propublica.org/article/nevaeh-crain-death-texas-abortion-ban-emtala"
  },
  {
    "text": "Elon Musk's Machine for Fascism: A One-Stop Shop for Disinformation and Violence  —  Just over a year ago, I described how Twitter had been used as a way to sow false claims in support of Trump in 2016 and 2020.  —  I described how, in 2016, trolls professionalized their efforts … ",
    "url": "https://www.emptywheel.net/2024/11/01/elon-musks-machine-for-fascism-a-one-stop-shop-for-disinformation-and-violence/"
  },
  {
    "text": "J.Lo Claps Back at Trump Rally Puerto Rico Jab: ‘We Are Americans’  —  LET'S GET LOUD  —  “Our pain matters” the singer said at a Las Vegas event for Kamala Harris.  —  As promised, Jennifer Lopez took the stage at Kamala Harris's rally in Las Vegas on Thursday night … ",
    "url": "https://www.thedailybeast.com/jennifer-lopez-claps-back-at-trump-rally-puerto-rico-jab-we-are-americans/"
  },
  {
    "text": "What Happens When Trump Exploits Your Daughter's Murder  —  When Mollie Tibbetts was killed by an undocumented immigrant, Trump tried to hijack her story.  Her mom says his divisiveness “has got to stop”  —  BROOKLYN, Iowa — It's been more than six years since Mollie Tibbetts … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-exploits-daughter-mollie-tibbetts-murder-1235149834/"
  },
  {
    "text": "Texas hospitals must now ask patients whether they're in the US legally.  Here's how it works  —  Texas hospitals must ask patients starting Friday whether they are in the U.S. legally and track the cost of treating people without legal status following an order by Republican Gov. Greg Abbott … ",
    "url": "https://apnews.com/article/texas-immigration-hospital-health-care-abbott-florida-aeee92d7515a18b492c737b3657569ab"
  },
  {
    "text": "Some Maga men seem to think women don't have rights - starting with their wives  —  The 2024 election is in part about whether women can be free and equal citizens of this republic.  Right now too many cannot  —  This week, the fundamentalist Christian pastor Dale Partridge argued in a series … ",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/01/maga-trump-men-supporters-womens-rights"
  },
  {
    "text": "Listen to Jeffrey Epstein Spill Intel on Donald Trump's White House  —  OH LORDY  —  A new recording captures Epstein dishing on Trump.  —  Michael Wolff, the explosive chronicler of Donald Trump's four years in the White House, has released what he says is a recording of Jeffrey Epstein … ",
    "url": "https://www.thedailybeast.com/listen-to-jeffrey-epstein-spill-intel-on-donald-trumps-white-house-on-tape-released-by-author-michael-wolff/"
  },
  {
    "text": "‘All hell has broken loose’: Inside Elon Musk's high-stakes pro-Trump door-knocking effort  —  More than a half-dozen operatives and canvassers connected to America PAC described an inordinate number of suspect entries and having to canvass during Hurricane Helene.",
    "url": "https://www.nbcnews.com/politics/2024-election/elon-musks-high-stakes-trump-door-knocking-effort-america-pac-rcna176255?taid=6724d0249f2d880001f6fdb4"
  },
  {
    "text": "Donald Trump Is Done With Checks and Balances  —  What does it mean to say that “democracy is on the ballot” on Election Day?  —  In her speech on Tuesday in Washington, D.C., delivered from the same place near the White House where Donald Trump incited a crowd to attack the Capitol on Jan. 6 … ",
    "url": "https://www.nytimes.com/2024/11/01/opinion/donald-trump-kamala-harris-election-power.html?unlocked_article_code=1.Wk4.S1lK.O7tbymT0gllX&smid=url-share"
  },
  {
    "text": "“Voter Report Card” mailings described as “creepy” and “insulting,” defended as effective tool  —  Julia Ramsey is used to a deluge of election-related mail.  Campaign mailings have clogged her Pennsylvania mailbox day after day for months, but one she received this week stood out from the rest.",
    "url": "https://www.cbsnews.com/news/voter-report-card-mailings-described-as-creepy-and-insulting-defended-as-effective-tool/"
  },
  {
    "text": "Donald Trump's campaign of relentless lying  —  The United States that Donald Trump describes in his rally speeches would be pretty bad if it actually existed.  —  Schools secretly sending children for gender-affirming surgeries without parental consent.  Towns and even cities conquered by illegal immigrants.",
    "url": "https://www.cnn.com/2024/11/01/politics/analysis-donald-trumps-campaign-of-relentless-lying/"
  },
  {
    "text": "Mishaps in Michigan spur spread of misleading election claims  —  In the closely watched battleground state of Michigan, election officials are under the microscope, with isolated mistakes or missteps serving as fodder for election deniers to lay the groundwork for widespread doubt of election results.",
    "url": "https://www.cnn.com/2024/11/01/politics/viral-incidents-spur-misleading-election-claims-invs/"
  },
  {
    "text": "Schumer gives a Senate Democratic forecast — including a Nebraska independent  —  Senate Majority Leader Chuck Schumer told a group of supporters this week that he believed Democrats could pick up three seats next week — including Nebraska, where independent candidate Dan Osborn has distanced himself from the party.",
    "url": "https://www.politico.com/live-updates/2024/11/01/2024-elections-live-coverage-updates-analysis/schumer-osborn-nebraska-senate-00186766"
  },
  {
    "text": "How the House would pick the president in the event of an Electoral College tie  —  Explainer: If no one gets 270 electoral votes, the House of Representative decides who wins the presidency, with each state delegation getting one vote.  —  The election has already been filled with eye-popping and historically unusual events.",
    "url": "https://www.nbcnews.com/politics/2024-election/electoral-college-tie-2024-election-what-happens-rcna175477"
  }
]