[
  {
    "text": "Silt police investigating incident involving U.S. Rep. Lauren Boebert and her ex-husband  —  The Silt Police Department is investigating a Saturday night incident at a restaurant involving U.S. Rep. Lauren Boebert and her ex-husband Jayson Boebert.  —  Silt police Chief Mike Kite confirmed … ",
    "url": "https://www.denverpost.com/2024/01/07/lauren-boebert-ex-husband-jayson-police-silt-colorado-restaurant/"
  },
  {
    "text": "Lauren Boebert's Ex Called The Cops After Physical Fight in Public on Saturday Night  —  Police confirmed an “active investigation” into the incident, while a Boebert aide told The Daily Beast that the congresswoman was acting in self-defense. … On Saturday night, three years … ",
    "url": "https://www.thedailybeast.com/lauren-boeberts-ex-husband-jayson-called-the-cops-after-physical-fight-in-public"
  },
  {
    "text": "Boebert's ex-husband calls police after fight with congresswoman  —  The representative from Colorado denies allegations that she punched her former spouse  —  Police were called to a restaurant in Silt, Colo., on Saturday night after Rep. Lauren Boebert (R-Colo.) and her ex-husband Jayson … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/07/lauren-boebert-ex-husband/"
  },
  {
    "text": "Special counsel probe uncovers new details about Trump's inaction on Jan. 6: Sources  —  Aides allegedly said Trump was “not interested” in doing more to stop the riot.  —  In a video message posted to Twitter on the afternoon of Jan. 6, 2021, President Donald Trump addresses supporters participating in the attack on the U.S. Capitol.",
    "url": "https://abcnews.go.com/US/special-counsel-probe-uncovers-new-details-trumps-inaction/story?id=106131854"
  },
  {
    "text": "‘Piece Of S**t’: Meghan McCain Rips Trump For Mocking Her Late Father  —  McCain criticized the former president for dishing out another attack at the late senator.  —  LOADING  —  Meghan McCain slammed former President Donald Trump for mocking her late father, Sen. John McCain (R-Ariz.) … ",
    "url": "https://www.huffpost.com/entry/meghan-mccain-trump-john-mccain-injuries_n_659a24d0e4b0bfe5ff636f22"
  },
  {
    "text": "Trump engaged in insurrection three years ago today.  The Supreme Court must say so.  —  I told my family and out-of-town friends on Jan. 6, 2021, that the people invading Capitol were more than three miles away and I was safe in my apartment in Dupont Circle.  —  “People are still using the dog park!”",
    "url": "https://www.lawdork.com/p/trump-insurrection-scotus"
  },
  {
    "text": "Johnson strikes his first bipartisan deal — a $1.7T funding accord  —  Ahead of a government shutdown cliff on Jan. 19, angst among House Republicans could still derail efforts to avert a funding lapse.  —  Congressional leaders have clinched a deal on overall budget totals that could pave … ",
    "url": "https://www.politico.com/news/2024/01/07/congress-spending-deal-shutdown-00134200"
  },
  {
    "text": "Congressional leaders reach deal that would avert government shutdown  —  The negotiated totals would preserve funding for key domestic and social safety net programs despite GOP demands for cuts  —  Congressional leaders reached a $1.66 trillion agreement Sunday to finance the federal government in 2024 … ",
    "url": "https://www.washingtonpost.com/business/2024/01/07/congress-budget-deal/"
  },
  {
    "text": "Congressional leaders announce agreement on spending levels, a key step to averting shutdown  —  Congressional leaders have reached an agreement on overall spending levels for the current fiscal year that could help avoid a partial government shutdown later this month.",
    "url": "https://apnews.com/article/congress-spending-shutdown-5809f29447b250a3902c45098cbd6909"
  },
  {
    "text": "'He's a cipher': How Austin's need for privacy just backfired  —  Pressure is growing on Capitol Hill and within the administration for someone to lose their job.  —  Defense Secretary Lloyd Austin is one of the most reclusive Pentagon chiefs in recent memory.  That strategy may be backfiring on him.",
    "url": "https://www.politico.com/news/2024/01/07/austin-has-long-been-a-quiet-operator-that-just-backfired-on-him-00134199"
  },
  {
    "text": "Deputy defense secretary was not told Austin had been hospitalized when she assumed his duties  —  When the deputy secretary of defense began assuming some of Secretary of Defense Lloyd Austin's responsibilities on January 2, not even she knew that it was because Austin was hospitalized, two defense officials told CNN.",
    "url": "https://www.cnn.com/2024/01/07/politics/austin-hospitalization-leaders-not-informed/"
  },
  {
    "text": "Americans increasingly see border as crisis, call for tougher measures, CBS News poll finds  —  Americans are increasingly concerned about the situation at the U.S.-Mexico border, and the percentage who think the Biden administration should be tougher on immigrants trying to cross it is up to the highest percentage yet.",
    "url": "https://www.cbsnews.com/news/cbs-news-opinion-poll-americans-border-crisis/"
  },
  {
    "text": "Elon Musk Has Used Illegal Drugs, Worrying Leaders at Tesla and SpaceX  —  Some executives and board members fear the billionaire's use of drugs—including LSD, cocaine, ecstasy, mushrooms and ketamine—could harm his companies  —  Elon Musk and his supporters offer several explanations … ",
    "url": "https://www.wsj.com/business/elon-musk-illegal-drugs-e826a9e1?mod=followamazon"
  },
  {
    "text": "National Park Service to Remove William Penn Statue from Historic Site  —  The National Park Service (NPS) has announced it will be rehabilitating (via reduction) Pennsylvania founder William Penn's Welcome Park to “provide a more welcoming, accurate, and inclusive experience.”",
    "url": "https://www.nationalreview.com/corner/national-park-service-to-remove-william-penn-statue-from-historic-site/"
  },
  {
    "text": "Investigators seek fallen Alaska Airlines door plug, ask for public's help  —  NTSB experts arrived on Saturday to investigate Alaska Airlines Flight 1282.  —  Alaska Airlines N704AL, a 737 Max 9 which made an emergency landing at Portland International Airport after a part … ",
    "url": "https://abcnews.go.com/US/investigators-seek-fallen-alaska-airlines-door-plug-publics/story?id=106164683"
  },
  {
    "text": "Johnson calls description of him as an election denier ‘nonsense,’ but won't say Biden won  —  The Constitution was “clearly violated during the 2020 election,” the Louisiana Republican said.  —  House Speaker Mike Johnson called suggestions that he is an election denier “nonsense,” … ",
    "url": "https://www.politico.com/news/2024/01/07/johnson-election-denier-nonsense-biden-2020-election-00134184"
  }
]