[
  {
    "text": "Biden's team drafted the questions for his first post-debate interviews … - WURD is the only African-American owned and operated talk radio station in Pennsylvania, but the White House's director of Black media was not part of the process.  — It is the latest instance of the White House continuing … ",
    "url": "https://www.axios.com/2024/07/06/biden-interview-draft-questions-wurd"
  },
  {
    "text": "At Essence, Black Democrats rally behind Biden and talk up Kamala Harris, but she avoids the drama  —  NEW ORLEANS (AP) — As President Joe Biden tries to revive his embattled reelection bid, Vice President Kamala Harris led a parade of Black Democrats who warned Saturday that the threat … ",
    "url": "https://apnews.com/article/joe-biden-drop-out-kamala-harris-replacement-2ab8780866fb2c8a0fe6e1e28a7e6de2"
  },
  {
    "text": "Mike Lee spreads fake claim of Biden medical emergency on Air Force One  —  Utah Senator then attacked media for being untrustworthy, during frenzied posting on social media  —  On Friday evening, Utah Sen. Mike Lee used his personal X/Twitter account to amplify a baseless claim … ",
    "url": "https://www.sltrib.com/news/politics/2024/07/06/mike-lee-spreads-fake-claim-biden/"
  },
  {
    "text": "FACT FOCUS: Online reports falsely claim Biden suffered a ‘medical emergency’ on Air Force One  —  False reports that President Joe Biden had a “medical emergency” while traveling back to Delaware on Friday after a campaign stop in Wisconsin, spread widely on social media on Friday.  They were without merit.",
    "url": "https://www.seattletimes.com/nation-world/fact-focus-online-reports-falsely-claim-biden-suffered-a-medical-emergency-on-air-force-one/"
  },
  {
    "text": "Former Trump Advisor Stephen Miller Denies Involvement With Project 2025, Ad Says Otherwise  —  WE GOT THE RECEIPTS  —  Former Trump advisor Stephen Miller claimed he has “never been involved with Project 2025” in a post on X on Saturday, however, a video on the Project 2025 YouTube channel says otherwise.",
    "url": "https://www.thedailybeast.com/former-trump-advisor-stephen-miller-squirms-to-deny-involvement-with-project-2025-ad-says-otherwise"
  },
  {
    "text": "'It's Shakespearean': Long-simmering tensions between Biden's family and aides spill out  —  Biden has taken full responsibility for his debate performance, saying in an interview on Friday it was “nobody's fault but mine.”  —  President Joe Biden's family is attempting to become more involved … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/tensions-biden-family-aides-spill-rcna160468"
  },
  {
    "text": "The lingering focus on Biden's shaky debate obscures Trump's major verbal miscues  —  President Joe Biden dug himself a hole and now he is trying to climb out.  But many fellow Democrats and some in the media keep shoveling dirt on him.One 20-minute TV interview was never going to swing … ",
    "url": "https://www.inquirer.com/opinion/editorials/trump-verbal-miscues-presidential-debate-20240706.html"
  },
  {
    "text": "America may soon be subjected to the country's first DEI president: Kamala Harris  —  There is a raging debate in corporate America on the future of DEI, aka Diversity Equity and Inclusion, because it is literally destroying businesses that go there.  —  And yet the American public may soon … ",
    "url": "https://nypost.com/2024/07/06/business/america-may-soon-be-subjected-to-the-countrys-first-dei-president-kamala-harris/"
  },
  {
    "text": "Trump wins delay in classified documents case … - It's an opinion that Trump has used to throw a wrench in prosecutors' plans although the SCOTUS decision on July 1 failed to clarify whether his alleged conduct on Jan. 6 was protected. … - Trump's attorneys have also used presidential immunity … ",
    "url": "https://www.axios.com/2024/07/06/donald-trump-classified-documents-delay"
  },
  {
    "text": "Why is the pundit class so desperate to push Biden out of the race?  —  Yes, Biden had a bad debate - but so did Trump.  The media is once again repeating the mistakes of 2016  —  I am not usually one to offer diagnoses of people I've never met, but it does seem like the pundit class … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/06/biden-trump-race-rebecca-solnit"
  },
  {
    "text": "American allies fear Biden is finished and can't beat Trump  —  “We're not sure that, even if he wins, he can survive four years more,” said one official from a European NATO country.  —  Diplomats and world leaders preparing for next week's NATO summit are privately expressing acute concern … ",
    "url": "https://www.politico.com/news/2024/07/06/american-allies-fear-biden-trump-00166700"
  },
  {
    "text": "President Biden's physician met with Parkinson's disease specialist in White House  —  A top Washington D.C. neurologist had a meeting with President Biden's personal doctor at the White House earlier this year, visitor logs reviewed by The Post show.  —  Dr. Kevin Cannard … ",
    "url": "https://nypost.com/2024/07/06/us-news/president-bidens-physician-met-with-parkinsons-disease-specialist-in-white-house/"
  },
  {
    "text": "The Supreme Court folds  —  The Supreme Court's ruling in Trump v. United States is its worst decision of my lifetime.  John Roberts's sloppy, arrogant, contradictory majority opinion provides license for any future president to lie, cheat, steal, suppress dissent, and — if they have the stomach for it — assassinate.",
    "url": "https://radleybalko.substack.com/p/the-supreme-court-folds"
  },
  {
    "text": "Hamas clears the way for a possible cease-fire in Gaza after dropping key demand, officials say  —  (AP video/Abdel Kareem Hana, Production: Wafaa Shurafa)  —  ‘Even if we had money, there are no goods’: Palestinians at Gaza refugee camp suffer food shortages",
    "url": "https://apnews.com/article/israel-hamas-war-palestinians-gaza-ceasefire-77910b6fae70ac1ff4eb3ac278852b44"
  }
]