[
  {
    "text": "Pelosi calls Santos a ‘coward’ for leaving chamber before expulsion vote closed  —  Former Speaker Nancy Pelosi took aim at ousted Rep. George Santos (R-N.Y.) after he exited the House chamber Friday before his expulsion vote had come to an end, calling him a “coward” for doing so.",
    "url": "https://thehill.com/homenews/house/4338547-pelosi-calls-santos-coward-for-leaving-chamber-expulsion-vote/"
  },
  {
    "text": "Trump pardoned them.  Now they're helping him return to power.  —  FOUNTAIN HILLS, Ariz. — At a diner known for political chitchat and Coca-Cola memorabilia, former Maricopa County sheriff Joe Arpaio walked from table to table on a recent fall morning, asking voters to back him for mayor … ",
    "url": "https://www.washingtonpost.com/politics/interactive/2023/trump-pardon-power-2024-benefit/"
  },
  {
    "text": "Judge denies two of Trump's motions to dismiss his federal election interference case  —  The judge rejected arguments from Trump's lawyers, who cited the First Amendment and presidential immunity in pressing for dismissal of special counsel Jack Smith's case.",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-denies-two-trumps-motions-dismiss-federal-election-interference-rcna127720"
  },
  {
    "text": "Obamacare is even more popular than the last time Trump tried to kill it  —  The issue doesn't specifically motivate Republican voters, either.  —  Donald Trump couldn't repeal Obamacare in 2017, largely because it had become too popular.  It's even more popular now.",
    "url": "https://www.politico.com/news/2023/12/02/trump-obamacare-polling-support-00129721"
  },
  {
    "text": "911 Call and Affidavit Reveal Chilling Claims in Florida GOP Chair Rape Probe  —  The woman told investigators he showed up at her home after she had cancelled plans with him.  —  The woman who accused Florida GOP chairman Christian Ziegler—husband of Moms for Liberty co-founder Bridget Ziegler … ",
    "url": "https://www.thedailybeast.com/911-call-released-in-florida-gop-chair-christian-ziegler-rape-probe"
  },
  {
    "text": "Gay Board Member Attacked by Zieglers Slams Their Hypocrisy Amid Sex Scandal  —  Bridget Ziegler refused to act when her openly gay colleague was labeled a groomer despite the Moms for Liberty co-founder allegedly engaging in her own same-sex relationship.  —  A lesser person than Tom Edwards … ",
    "url": "https://www.thedailybeast.com/bridget-ziegler-attacked-tom-edwards-for-being-gay-despite-alleged-threesome-with-christian-ziegler"
  },
  {
    "text": "Rep. Smith Statement on Vandalism at His Home  —  WASHINGTON, D.C. -Representative Adam Smith (D-Wash.) today released the following statement on the vandalism against his home in Bellevue, Washington regarding the conflict in Israel and Gaza.  —  “Last night, my house was vandalized … ",
    "url": "https://adamsmith.house.gov/press-releases?ID=576CE593-C52E-4E14-A57E-F429245C2262"
  },
  {
    "text": "Appeals court orders Texas to remove buoy barrier on the Rio Grande border  —  The U.S. Court of Appeals for the Fifth Circuit rejected Texas Gov. Greg Abbott's request to reverse a lower court's finding that the floating barriers were illegal.  —  A federal appeals court on Friday ordered Texas … ",
    "url": "https://www.nbcnews.com/politics/immigration/appeals-court-orders-texas-remove-buoy-barrier-rio-grande-border-rcna127711"
  },
  {
    "text": "Florida appeals court reverses ruling on DeSantis's congressional maps  —  A state appeals court in Florida reaffirmed Gov. Ron DeSantis's (R) congressional maps Friday, reversing a lower court ruling that labeled them unconstitutional.  —  The appeals court said the lower court misapplied precedent … ",
    "url": "https://thehill.com/homenews/state-watch/4338182-appeals-court-reverses-ruling-desantis-congressional-maps/"
  },
  {
    "text": "Biden's EPA launches crackdown on planet-warming methane  —  The rule's 3 a.m. rollout was timed to coincide with the ongoing U.N. climate talks in Dubai.  —  The Environmental Protection Agency unveiled sweeping new regulations targeting methane emissions from the oil and gas sector on Saturday … ",
    "url": "https://www.politico.com/news/2023/12/02/bidens-epa-launches-crackdown-on-planet-warming-methane-00129433"
  },
  {
    "text": "Boebert Enlists Dave Chappelle for Transphobic Photo Op  —  SAY CHEESE  —  Dave Chappelle obliged a number of starstruck lawmakers' requests for photos while at Capitol Hill on Thursday, among them Reps. Lauren Boebert (R-CO) and Anna Paulina Luna (R-FL).  “May we get a selfie with you?”",
    "url": "https://www.thedailybeast.com/lauren-boebert-snaps-a-selfie-with-dave-chappelle-on-capitol-hill"
  },
  {
    "text": "Newsom camp: Hannity, DeSantis cheated.  They dispute the charges.  —  The messy prime-time event outside Atlanta between Gavin Newsom and Ron DeSantis didn't end when the Fox News cameras stopped.  Newsom's team says DeSantis and Fox broke several rules.  —  ALPHARETTA, Georgia — So much for that Newsom-Hannity bromance.",
    "url": "https://www.politico.com/news/2023/12/01/newsom-desanitis-debate-cheating-00129555"
  },
  {
    "text": "For Immediate Release  —  For Further Information Contact:  —  Retired Associate Justice of the Supreme Court of the United States Sandra Day O'Connor died this morning in Phoenix, Arizona, of complications related to advanced dementia, probably Alzheimer's, and a respiratory illness.",
    "url": "https://www.supremecourt.gov/publicinfo/press/pressreleases/pr_12-01-23"
  },
  {
    "text": "How religion plays into Ron DeSantis' public image — from ‘armor of God’ to a Bible ordered on Amazon  —  The Florida governor has never made his faith a major part of his public image, but he's having to talk about it more as he reaches out to conservative religious voters.",
    "url": "https://www.nbcnews.com/politics/2024-election/religion-ron-desantis-catholic-amazon-bible-rcna126855"
  },
  {
    "text": "DeSantis campaign blames its own super PAC for leaks, bad TV advertising  —  The criticism comes amid an intensifying feud between Ron DeSantis' presidential campaign and Never Back Down.  —  Tensions between Ron DeSantis' struggling presidential campaign and his allied super PAC are boiling over … ",
    "url": "https://www.politico.com/news/2023/12/01/desantis-campaign-blames-its-own-super-pac-for-leaks-bad-tv-advertising-00129637"
  }
]