[
  {
    "text": "Republicans win House, delivering Trump a trifecta  —  Republicans are projected to keep control of the House of Representatives, handing the party total control of Washington with former President Trump back in the White House in January.  —  Decision Desk HQ projected the GOP would hold … ",
    "url": "https://thehill.com/homenews/state-watch/4974235-house-republicans-control-majority/"
  },
  {
    "text": "Republicans win majority of US House seats in government sweep  —  President-elect Donald Trump's Republican Party will control both houses of Congress when he takes office in January, Decision Desk HQ projected on Monday, enabling him to push an agenda of slashing taxes and shrinking the federal government.",
    "url": "https://www.reuters.com/world/us/republicans-win-majority-us-house-seats-government-sweep-2024-11-12/"
  },
  {
    "text": "White House pushes back on Trump call to halt confirmations in lame duck period  —  A White House spokesperson on Monday pushed back on President-elect Trump's demand that the Democratic Senate stop confirming judges during the lame-duck period before he takes office and the upper chamber flips to GOP control.",
    "url": "https://thehill.com/homenews/administration/4984559-white-house-trump-lame-duck-judicial-confirmations-senate/"
  },
  {
    "text": "Inside House Dems' 11th-hour plot to sabotage Trump's agenda … - House Minority Leader Hakeem Jeffries (D-N.Y.) is already telling allies how he is preparing to lead the resistance to Trump, Axios' Hans Nichols reported.  — “We as Democrats have to roll up our sleeves and get into defense … ",
    "url": "https://www.axios.com/2024/11/11/house-democrats-trump-lame-duck"
  },
  {
    "text": "Senate Dems begin their final effort until at least 2029 to put judges on the courts  —  In the coming weeks, Democrats will have their last chance to put Democratic nominees on the federal courts until at least 2029.  —  With Republicans taking Senate control on January 3 when the new Congress begins … ",
    "url": "https://www.lawdork.com/p/senate-dems-biden-judges"
  },
  {
    "text": "Trump Expected to Name Marco Rubio as Secretary of State  —  The president-elect appears to have settled on the Florida senator to be the nation's top diplomat.  —  President-elect Donald J. Trump is expected to name Senator Marco Rubio of Florida as his secretary of state … ",
    "url": "https://www.nytimes.com/2024/11/11/us/politics/trump-rubio-secretary-of-state.html?unlocked_article_code=1.ZU4.El0L.6KFa6omup__S&smid=url-share"
  },
  {
    "text": "Trump taps US Senator Marco Rubio for secretary of state  —  Donald Trump selected U.S. Senator Marco Rubio to be his secretary of state, the New York Times reported on Monday, putting the Florida-born politician on track to be the first Latino to serve as America's top diplomat once … ",
    "url": "https://www.reuters.com/world/us/trump-taps-us-senator-marco-rubio-secretary-state-2024-11-12/"
  },
  {
    "text": "The big takeaway from Trump's whirlwind round of personnel announcements  —  The president-elect is sending a clear message to Washington as he begins to reveal who's in — and who's out — of his next administration.  —  Donald Trump is sending a message to anyone hoping to work with his second White House: Dissenters need not apply.",
    "url": "https://www.politico.com/news/2024/11/12/trump-transition-personnel-announcements-takeaway-00188936"
  },
  {
    "text": "Melania Trump expected to skip Wednesday White House meeting with Jill Biden  —  Melania Trump is not expected to attend the traditional White House meeting with first lady Jill Biden, sources familiar with her plans said.  —  It's a decision that underscores Melania Trump's long-held willingness … ",
    "url": "https://www.cnn.com/2024/11/11/politics/melania-trump-jill-biden/"
  },
  {
    "text": "Musk Turning Himself Into the 'Guest Who Wouldn't Leave' at Mar-a-Lago  —  WORN-OUT WELCOME  —  The Tesla CEO is not expected to have an official position in Trump's incoming administration, but he's apparently weighing in on staffing decisions already being made in Florida.",
    "url": "https://www.thedailybeast.com/elon-musk-turning-himself-into-the-guest-who-wouldnt-leave-at-mar-a-lago/"
  },
  {
    "text": "How the Senate map explains Trump  —  TURNAROUND — As Democrats continue to shift into recrimination mode about exactly what happened last Tuesday evening, they've found blame in lots of places — demographic shifts, inflation, concerns about immigration and even the wide world of podcasts.",
    "url": "https://www.politico.com/newsletters/politico-nightly/2024/11/11/how-the-senate-map-explains-trump-00188929"
  },
  {
    "text": "Trump Selects Florida Rep. Mike Waltz as National Security Adviser  —  The congressman is known as a China hawk and NATO critic.",
    "url": "https://www.wsj.com/politics/national-security/trump-selects-florida-rep-mike-waltz-as-national-security-adviser-104414fe?st=kWsXC4&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Chris Wallace Quits CNN to Build Future in Streaming  —  The veteran broadcaster, 77, will walk away from his seven-figure role in a watershed moment for cable TV.  —  EXCLUSIVE  —  Chris Wallace is quitting CNN after three years as one of its biggest stars, he exclusively told the Daily Beast Monday.",
    "url": "https://www.thedailybeast.com/broadcaster-chris-wallace-quits-cnn-to-build-future-in-streaming-or-podcasting/"
  },
  {
    "text": "Trump picks Kristi Noem to serve as his Homeland Security secretary  —  President-elect Donald Trump has selected South Dakota Gov. Kristi Noem as his next secretary of the Department of Homeland Security, according to two people familiar with the selection.",
    "url": "https://www.cnn.com/2024/11/12/politics/kristi-noem-homeland-security-secretary/"
  },
  {
    "text": "FBI Director Christopher Wray is preparing for a possible forced exit under Trump  —  One person under consideration for the job is Trump adviser Kash Patel, who is also being considered to lead the CIA, two sources familiar with the matter told NBC News.  —  FBI Director Christopher Wray … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/fbi-director-christopher-wray-preparing-possible-forced-exit-trump-rcna179684"
  },
  {
    "text": "Even Fox News Saw a Close 2024 Election.  Then the Voting Data Came In  —  At the start of Election Night, even executives at Fox News Channel didn't think Donald Trump had a decisive edge over Kamala Harris.  —  “At 5 p.m., the most likely outcome was a very close election,” says Arnon Mishkin … ",
    "url": "https://variety.com/2024/tv/news/fox-news-2024-election-donald-trump-1236206449/"
  },
  {
    "text": "Trump selects Lee Zeldin to lead EPA  —  President-elect Trump has selected former Rep.  Lee Zeldin (R-N.Y.) to lead the Environmental Protection Agency, putting a second New Yorker and loyalist into his forming Cabinet.  —  “I am pleased to announce that the Highly Respected former Congressman … ",
    "url": "https://thehill.com/homenews/administration/4984481-trump-lee-zeldin-epa/"
  },
  {
    "text": "Warren: Trump transition ‘already breaking the law’  —  Sen. Elizabeth Warren (D-Mass.) said on Monday that President elect-Trump “and his transition team are already breaking” a law on presidential transition.  —  “Donald Trump and his transition team are already breaking the law,” Warren said in a post on the social platform X.",
    "url": "https://thehill.com/homenews/campaign/4984590-trump-transition-law-violation-elizabeth-warren/"
  },
  {
    "text": "Trump's shadow falls on Chinese solar giant  —  The United States' clean energy landscape is already changing just days after Donald Trump's election — as signs build of even bigger shake-ups to come.  —  Case in point: One of China's largest solar manufacturers — which had been slated … ",
    "url": "https://www.politico.com/newsletters/power-switch/2024/11/11/trumps-shadow-falls-on-chinese-solar-giant-00188747"
  },
  {
    "text": "Starmer Pushes UK Climate Leadership as Trump Win Poses Threat  — British premier attends UN summit as other leaders stay away  — UK expected to unveil pledge on climate emissions in Baku  —  Prime Minister Keir Starmer said he wants the UK to assume a “global leadership” … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-11/starmer-pushes-uk-climate-leadership-as-trump-win-poses-threat"
  },
  {
    "text": "Women stockpile abortion pills before Trump term  —  Reproductive-health organizations and companies said demand for “morning after” pills, intrauterine devices and vasectomies has also increased.  —  Women are seeking out abortion medication in higher-than-usual numbers ahead of a Donald … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/11/abortion-pill-contraception-trump-term/"
  }
]