[
  {
    "text": "Statement from President Joe Biden on Attack on U.S. Service Members in Northeastern Jordan Near the Syria Border  —  Today, America's heart is heavy.  Last night, three U.S. service members were killed—and many wounded—during an unmanned aerial drone attack on our forces stationed in northeast Jordan near the Syria border.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/28/statement-from-president-joe-biden-on-attack-on-u-s-service-members-in-northeastern-jordan-near-the-syria-border/"
  },
  {
    "text": "GOP hawks press Biden to target Iran directly over soldiers' deaths  —  President Biden is facing calls from congressional hawks to escalate attacks on Iran-linked targets, including within Iran itself, in response to the deaths of three U.S. service members in a drone attack in Jordan.",
    "url": "https://www.axios.com/2024/01/28/gop-biden-iran-soldier-deaths"
  },
  {
    "text": "Three US troops killed in drone attack in Jordan, more than 30 injured  —  Three US Army soldiers were killed and more than 30 service members were injured in a drone attack overnight on a small US outpost in Jordan, US officials told CNN, marking the first time US troops have been killed … ",
    "url": "https://www.cnn.com/2024/01/28/politics/us-troops-drone-attack-jordan"
  },
  {
    "text": "Republican hawks call for retaliation after 3 killed in Iranian-backed strike  —  Sens. Roger Wicker, Lindsey Graham and others pushed for a military response.  —  Calls for retaliation began pouring in from Republican members of Congress moments after U.S. Central Command revealed Sunday … ",
    "url": "https://www.politico.com/news/2024/01/28/revenge-members-congress-killed-jordan-iran-backed-attack-00138245"
  },
  {
    "text": "State of the Union  —  DANA BASH, CNN HOST (voice-over): Gone South.  —  As his GOP rival gets under his skin...  NIKKI HALEY (R), PRESIDENTIAL CANDIDATE: Donald, keep them coming.  —  BASH: ... Donald Trump wants to pivot.  —  DONALD TRUMP, FORMER PRESIDENT OF THE UNITED STATES (R) … ",
    "url": "https://transcripts.cnn.com/show/sotu/date/2024-01-28/segment/01"
  },
  {
    "text": "Lankford defends bipartisan border security bill after attacks by Trump, GOP  —  'We all have an oath to the Constitution and we have a commitment to say we're going to do whatever we can to be able to secure the border,' the senator from Oklahoma says.  —  Sen. James Lankford (R-Okla.) … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/28/border-bill-trump-lankford/"
  },
  {
    "text": "Nikki Haley Explains Why ‘Insecure’ Trump Is His ‘Own Worst Enemy’  —  “When he feels insecure, he starts to rail, he starts to rant, he starts to flail his arms and he starts to get upset,” Haley said in a recent “Meet the Press” interview.  —  LOADING  —  Nikki Haley called Donald Trump his … ",
    "url": "https://www.huffpost.com/entry/nikki-haley-donald-trump-insecure_n_65b6a418e4b077c17ab5871f"
  },
  {
    "text": "Trump's candidacy on the Illinois ballot should be decided by the courts, an elections board hearing officer says  —  The hearing officer, a retired Republican judge, wrote a scathing assessment of Trump's involvement in the Jan. 6 insurrection, but said the courts ultimately should decide.",
    "url": "https://www.wbez.org/stories/trumps-candidacy-on-the-illinois-ballot-should-be-decided-by-the-courts-hearing-officer-says/e9af3a79-7e96-4429-8bf0-282833888bb2"
  },
  {
    "text": "Quiet rebellion threatens House GOP chair over surprise tax deal  —  The House GOP's top tax writer doesn't just face blowback over the surprise deal he unveiled this month: Now the background chatter suggests Rep. Jason Smith (R-Mo.) could lose his gavel.",
    "url": "https://www.axios.com/2024/01/28/ways-means-jason-smith-vern-buchanan-tax-deal"
  },
  {
    "text": "Climate activists hurl soup at the Mona Lisa at the Louvre Museum in Paris  —  Two protesters from a climate and agricultural NGO hurled soup onto the bulletproof glass protecting Leonardo da Vinci's “Mona Lisa” painting in Paris, demanding the right to “healthy and sustainable food”.  —  By: FRANCE 24",
    "url": "https://www.france24.com/en/france/20240128-activists-hurl-soup-on-glass-protected-mona-lisa-at-paris-s-louvre-museum"
  },
  {
    "text": "Pelosi Wants F.B.I. to Investigate Pro-Palestinian Protesters  —  The former House speaker suggested without offering evidence that some protesters calling for a cease-fire in Gaza had financial ties to Russia and Vladimir V. Putin.  —  Representative Nancy Pelosi, Democrat of California … ",
    "url": "https://www.nytimes.com/2024/01/28/us/politics/nancy-pelosi-fbi-russia-gaza-protesters.html"
  },
  {
    "text": "Snoop Dogg: ‘I have nothing but love and respect for Donald Trump’  —  He is the gangsta rapper who broke the mould — now 52, he's friends with Martha Stewart, makes educational cartoons and has changed his tune on the man running for President  —  Snoop Dogg is still not over the end of Game of Thrones.",
    "url": "https://www.thetimes.co.uk/article/snoop-dogg-i-have-nothing-but-love-and-respect-for-donald-trump-k60k99phr"
  },
  {
    "text": "North Korea fired several cruise missiles, South Korea says  —  The launches followed a round of North Korean cruise missile tests last week and a Jan. 14 test-firing of the country's first solid-fuel intermediate-range ballistic missile.  —  SEOUL, South Korea — South Korea's military … ",
    "url": "https://www.politico.com/news/2024/01/28/north-korea-fires-cruise-missiles-00138273"
  },
  {
    "text": "GOP legislatures in some states seek ways to undermine voters' ability to determine abortion rights  —  Legislative efforts in Missouri and Mississippi are attempting to prevent voters from having a say over abortion rights, building on anti-abortion strategies seen in other states, including last year in Ohio.",
    "url": "https://apnews.com/article/abortion-ballot-initiatives-voters-democracy-2024-602ebb8a74d7ae45163d79c065a23ef0"
  }
]