[
  {
    "text": "Feds must answer email on what they did last week — or lose jobs, Musk says  —  Emails began going out to the 2.3-million federal employees Saturday asking for five bullet points of their accomplishments.  —  Federal workers began receiving emails Saturday asking them to describe what they did last week … ",
    "url": "https://www.washingtonpost.com/nation/2025/02/22/musk-email-federal-workers/"
  },
  {
    "text": "What Just Happened: Musk-OPM Send Email to Federal Employees Asking for Five Accomplishments  —  On Saturday, the Office of Personnel Management (OPM) sent an email to federal employees instructing them to respond with five things they accomplished last week.",
    "url": "https://www.justsecurity.org/108229/what-just-happened-musk-email-federal-employees/"
  },
  {
    "text": "Federal employees told to justify jobs in email or Musk says they face dismissal  —  Federal workers began receiving emails Saturday asking them to explain what work they did last week, as Elon Musk announced that “failure to respond will be taken as a resignation.”",
    "url": "https://www.cnn.com/2025/02/22/politics/elon-musk-employees-emails"
  },
  {
    "text": "FBI Director Kash Patel to be named ATF chief  —  Patel is set to lead an agency that's been a frequent target of Republicans, including an effort to abolish it altogether.  —  President Donald Trump's newly-confirmed FBI director, Kash Patel, is expected to take on another top law enforcement role … ",
    "url": "https://www.nbcnews.com/politics/justice-department/fbi-director-kash-patel-named-atf-chief-rcna193332"
  },
  {
    "text": "Joy Reid's MSNBC Show Canceled in Major Shake-Up  —  Ms. Reid's 7 p.m. program will be replaced by a panel show co-hosted by Symone Sanders Townsend, Alicia Menendez and Michael Steele.  —  Joy Reid's evening news show on MSNBC is being canceled, part of a far-reaching programming overhaul orchestrated … ",
    "url": "https://www.nytimes.com/2025/02/23/business/msnbc-joy-reid.html?unlocked_article_code=1.zE4.FslK.eZ38_1_IrEe5&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "In Pursuit of a ‘Warrior Ethos,’ Hegseth Targets Military's Top Lawyers  —  The defense secretary has repeatedly derided the military lawyers for war crime prosecutions and battlefield rules of engagement.  —  Defense Secretary Pete Hegseth's decision to fire the top lawyers for the Army … ",
    "url": "https://www.nytimes.com/2025/02/22/us/politics/hegseth-firings-military-lawyers-jag.html"
  },
  {
    "text": "Photos: ‘Distress flag’ towers over Yosemite to protest cuts as crowds view firefall  —  A group of frustrated Yosemite National Park staffers hoping to draw attention to the federal government's sweeping workforce cuts hung an upside-down American flag Saturday thousands of feet off the ground on the side of El Capitan.",
    "url": "https://www.sfchronicle.com/outdoors/article/yosemite-protest-job-cuts-20180229.php"
  },
  {
    "text": "States threaten fines and jail time for local officials who resist Trump's immigration crackdown  —  Republican state lawmakers seeking to aid President Donald Trump's crackdown on illegal immigration are threatening local officials who resist with lawsuits, fines and even potential jail time.",
    "url": "https://apnews.com/article/immigration-sanctuary-cities-trump-states-ea9cb51f2b46189918e2a70b1c91c603"
  },
  {
    "text": "Condoms for Gaza?  Ukraine started the war with Russia?  The president's manipulations of the truth lay the groundwork for radical change.  —  The United States sent $50 million in condoms to Hamas.  Diversity programs caused a plane crash.  China controls the Panama Canal.  Ukraine started the war with Russia.",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/trump-alternative-reality.html"
  },
  {
    "text": "As sales drop, artists weigh canceling Kennedy Center shows in protest  —  Ticket sales dropped roughly 50 percent week-over-week after Trump announced his takeover, sources said.  Meanwhile, performers are mulling their options.  —  W. Kamau Bell was scheduled to perform at the Kennedy Center … ",
    "url": "https://www.washingtonpost.com/entertainment/2025/02/22/artists-cancel-kennedy-center-shows-ticket-sales/"
  },
  {
    "text": "U.S.A.I.D. Appointees Fire Hundreds Working on Urgent Humanitarian Aid  —  The firings added to doubts about whether Secretary of State Marco Rubio, the agency's acting head, supports lifesaving humanitarian assistance, as he has said he does.  —  Trump administration appointees running … ",
    "url": "https://www.nytimes.com/2025/02/22/us/politics/usaid-urgent-aid-firings.html"
  },
  {
    "text": "Melania Trump returns to Washington after four-week absence  —  After a four-week absence from Washington, first lady Melania Trump returned to the White House on Saturday for an annual dinner and reception with the nation's governors.  —  “She worked very hard on making sure that everything was beautiful.",
    "url": "https://www.cnn.com/2025/02/23/politics/melania-trump-white-house-return/"
  },
  {
    "text": "Chris Murphy Emerges as a Clear Voice for Democrats Countering Trump  —  The second-term senator from Connecticut is eschewing caution and throwing out the traditional political playbook as he seeks a broader audience for his critiques of the president and his agenda.",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/chris-murphy-democrats-trump.html"
  },
  {
    "text": "The Death of Competition in American Elections  —  A vast majority of 2024 races for Congress and state legislatures were decided by low-turnout or meaningless primaries.  The trend is making politics more polarized and eroding public trust.  —  President Trump's return to Washington … ",
    "url": "https://www.nytimes.com/2025/02/23/us/politics/us-elections-gerrymandering.html"
  },
  {
    "text": "Thousands in Midwestern GOP Districts Attend Sanders' First Stops on Tour to Fight Oligarchy  —  After addressing more than 3,400 Nebraska residents in Omaha Friday evening, U.S. Sen. Bernie Sanders on Saturday made his second stop on his National Tour to Fight Oligarchy—telling Iowa City … ",
    "url": "https://www.commondreams.org/news/bernie-sanders-donald-trump"
  },
  {
    "text": "Trump officials launch ICE effort to deport unaccompanied migrant children  —  The Trump administration is directing immigration agents to track down hundreds of thousands of migrant children who entered the United States without their parents, expanding the president's mass deportation effort … ",
    "url": "https://www.reuters.com/world/us/trump-administration-directs-ice-agents-find-deport-unaccompanied-migrant-2025-02-23/"
  },
  {
    "text": "With Pentagon purge, Trump thrusts military into uncharted territory  —  The abrupt removal of six top officers has deepened concern among the president's critics, who fear he intends to impose his political will on the nonpartisan institution.  —  President Donald Trump's Friday night purge … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/22/trump-pentagon-purge-charles-q-brown/"
  },
  {
    "text": "I'm a former U.S. intelligence officer.  Trump's Ukraine betrayal will have terrible consequences.  —  Trust is so hard to gain, and yet so easily lost.  —  The United States is doing it again: walking away from allies.  It is almost as if each U.S. presidency needs to practice betrayal as a form of statecraft.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-ukraine-russia-zelenskyy-betrayal-rcna193035"
  },
  {
    "text": "DOGE for Ohio?  Vivek Ramaswamy enters governor's race pushing cuts and merit pay  —  Ramaswamy, 39, ran for president in 2024 before becoming a Trump surrogate and briefly working with Elon Musk on Trump's Department of Government Efficiency team.  —  CLEVELAND — Biotech entrepreneur Vivek Ramaswamy … ",
    "url": "https://www.nbcnews.com/politics/elections/doge-ohio-vivek-ramaswamy-enters-governors-race-pushing-cuts-merit-pay-rcna188980"
  },
  {
    "text": "DOGE cuts at health agencies prompt ‘brain drain’ fears  —  The Trump administration's effort to reshape the federal government through Elon Musk and his Department of Government Efficiency (DOGE) is raising fears among public health experts, researchers and advocacy groups of a massive brain drain and dire impacts to public health.",
    "url": "https://thehill.com/policy/healthcare/5158519-trump-administration-federal-government-cuts/"
  },
  {
    "text": "‘Trump Recruited as Moscow Asset,’ Says Ex-KGB Spy Chief  —  Alnur Mussayev, former head of Kazakhstan's security service, who rose up the ranks of the Soviet KGB, claims Moscow groomed Trump under pseudonym “Krasnov” in 1987.  —  US President Donald Trump was groomed 37 years ago … ",
    "url": "https://www.kyivpost.com/post/47630"
  }
]