[
  {
    "text": "‘Dead heat’: Trump pulls even with Harris in NBC News poll  —  A close election has never looked more tightly divided, with Harris' popularity declining from its previous high and abortion atop voters' issue list.  —  Former President Donald Trump and Vice President Kamala Harris are deadlocked … ",
    "url": "https://www.nbcnews.com/politics/2024-election/dead-heat-trump-pulls-even-harris-nbc-news-poll-rcna174201"
  },
  {
    "text": "Economic discontent, issue divisions add up to tight presidential contest: POLL  —  Harris has 50% support to Trump's 48% among likely voters, the poll finds.  —  Republican presidential nominee former President Donald Trump, left, and Democratic presidential nominee Vice President Kamala Harris during … ",
    "url": "https://abcnews.go.com/Politics/economic-discontent-issue-divisions-add-tight-presidential-contest/story?id=114723390"
  },
  {
    "text": "CBS News Trump-Harris poll shows one election, two worlds: How information, beliefs shape tight campaign  —  The 2024 presidential contest between Kamala Harris and Donald Trump is more than just two ideologies competing over what should happen.  It's two groups of voters that look … ",
    "url": "https://www.cbsnews.com/news/trump-harris-poll-how-information-beliefs-shape-tight-2024-campaign/"
  },
  {
    "text": "Why Is Trump Gaining With Black and Hispanic Voters?  —  Five possible explanations for the increases in support, particularly among young men.  —  In 2016, Donald J. Trump became the Republican nominee and ultimately won the presidency after calling many Mexican immigrants rapists … ",
    "url": "https://www.nytimes.com/2024/10/13/upshot/trump-black-hispanic-voters-harris.html"
  },
  {
    "text": "Donald Trump's Niece Says He Is Now ‘Owned’ by Elon Musk  —  'DEVIL'S BARGAIN'  —  Mary Trump described the Tesla CEO, who also owns X, formerly Twitter, as “the world's richest fascist” and a “South African jumping bean.”  —  Donald Trump is now “owned” by MAGA super-fan Elon Musk … ",
    "url": "https://www.thedailybeast.com/donald-trumps-niece-says-he-is-now-owned-by-tesla-boss-elon-musk"
  },
  {
    "text": "Donald's New Owner  —  [Substack was down for a while and is still a little glitchy.  I hope this reaches you.]  —  Donald Trump has always been for sale.  It used to be shocking how many people were willing to prop him up in the hopes of profiting off his increasingly seamy ventures.",
    "url": "https://www.marytrump.org/p/donalds-new-owner"
  },
  {
    "text": "Trump suggests heckler should ‘get the hell knocked out of her’ after rally  —  The remarks were part of a dark speech at a California rally where Trump called the U.S. an “occupied country.”  —  COACHELLA, Calif- Former president Donald Trump suggested that a heckler would later get … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/12/trump-heckler-violence/"
  },
  {
    "text": "Tensions rise between Harris and Biden teams as election nears … - “They're too much in their feelings,” one close Harris ally said of the president's team — a sentiment shared even by some White House aides. … - Biden gave an impromptu press conference in the White House briefing room Friday … ",
    "url": "https://www.axios.com/2024/10/13/kamala-harris-biden-campaign-tension"
  },
  {
    "text": "Harris Campaign to Fly Ads Over N.F.L. Games in Swing States  —  Fans at games in four swing states will see skywriting or banners over their stadium on Sunday.  The vice president's campaign would like men in particular to look up.  —  As the Harris campaign continues to court male voters … ",
    "url": "https://www.nytimes.com/2024/10/13/us/politics/harris-walz-nfl-ads-swing-states.html"
  },
  {
    "text": "America First Policy Institute, a group advising Trump, says its systems were breached  —  A group helping to lay the groundwork for a future Donald Trump administration said its computer systems were breached, marking the second known instance that people supporting the former president have been the target of a cyberattack.",
    "url": "https://apnews.com/article/america-first-policy-institute-breach-2626d34b7426c4917f11052dafc7041c"
  },
  {
    "text": "California Denies Launching Rights to SpaceX Because Musk Supports Trump—Really  —  The Commissars of California are so concerned about enforcing political uniformity that they are denying the military's right to launch from Vandenburg Air Force Base using SpaceX rockets.  —  Why?",
    "url": "https://hotair.com/david-strom/2024/10/13/california-denies-launching-rights-to-spacex-because-musk-supports-trump-really-n3795732"
  },
  {
    "text": "Machine for Fascism: The Two Stephens  —  When I saw the news that Trump is planning a rally at Madison Square Garden — as the Nazis did in 1939 — I checked the date to see whether that was before or after Steve Bannon gets out of prison.  —  Bannon is due to get out on October 29; the rally is two days earlier, on October 27.",
    "url": "https://www.emptywheel.net/2024/10/13/machine-for-fascism-the-two-stephens/"
  },
  {
    "text": "Podcasts become politician magnets … - “We all have insane information overload, so if you try to spread yourself too thin and you're saying 10 different things to appeal to everyone, people are just going to forget about it,” Lulu Cheng Meservey, founder of strategic comms firm Rostra told Axios' Eleanor Hawkins last year.",
    "url": "https://www.axios.com/2024/10/13/trump-harris-podcasts-call-her-daddy"
  },
  {
    "text": "Voter registration deadlines hit, focus shifts to actually getting people to vote  —  The deadline to register to vote in 2024 has already passed in more than a dozen states, and time is running out in many more places through October.  —  Millions of Americans have enrolled to cast a ballot this year … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/13/get-out-the-vote-efforts-2024/75631243007/"
  },
  {
    "text": "Mystery Drones Swarmed a U.S. Military Base for 17 Days.  The Pentagon Is Stumped.  —  U.S. officials don't know who is behind the drones that have flown unhindered over sensitive national-security sites—or how to stop them",
    "url": "https://www.wsj.com/politics/national-security/drones-military-pentagon-defense-331871f4"
  },
  {
    "text": "Is Ron DeSantis secretly preparing an effort to block Florida's abortion measure?  —  Late Friday, the Florida Department of State's office released a report alleging fraud relating to petition circulation and collection for the abortion rights measure that will be Amendment 4 on this fall's ballot in the state.",
    "url": "https://www.lawdork.com/p/is-ron-desantis-secretly-preparing"
  },
  {
    "text": "Far-right website admits there was no fraud at 2020 vote count in Atlanta  —  Gateway Pundit settled defamation lawsuit brought by election workers it had falsely accused of wrongdoing  —  The far-right website the Gateway Pundit acknowledged for the first time on Saturday … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/12/gateway-pundit-admits-no-election-fraud-atlanta"
  }
]