[
  {
    "text": "Exclusive: Conservative Republican endorses Harris, calls Trump a threat to democracy  —  Retired federal appeals court Judge J. Michael Luttig, a prominent conservative legal scholar put on the bench by President George H.W. Bush, is endorsing Vice President Kamala Harris over former President Donald Trump … ",
    "url": "https://www.cnn.com/2024/08/19/politics/conservative-republican-endorses-harris-calls-trump-a-threat-to-democracy"
  },
  {
    "text": "Trump portrays Harris as foreign, echoing past attacks on Democrats of color  —  “I wonder if they knew where she comes from,” Trump said, echoing a 2019 call for Democratic congresswomen to “go back” to where they came from.  —  YORK, Pa. — Republican presidential nominee Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/19/trump-speech-pa-event-dnc/"
  },
  {
    "text": "Trump defends personal attacks on Harris, discusses election outcome, release of medical records  —  Former president and GOP nominee Donald Trump said in an exclusive TV interview that he would release his medical records, as he faces off against Vice President Kamala Harris in the race for the White House.",
    "url": "https://www.cbsnews.com/news/trump-insults-harris-intelligence-medical-records-tv-exclusive/"
  },
  {
    "text": "The Pro-Palestinian Protest Fizzles in Chicago  —  The Democratic National Convention begins today in Chicago; it promises a flurry of prime-time speeches, a formal nominating process (which has already been decided), and celebrity guest appearances.  All eyes Monday were on a pro-Palestinian protest … ",
    "url": "https://www.thebulwark.com/p/five-things-watch-democratic-national-convention-protest"
  },
  {
    "text": "DNC makes Teamsters president sweat … - The Teamsters boss became the first-ever union president to speak at an RNC last month, delivering fiery remarks before a party that has a track record of opposing labor movements.  — Rank-and-file Teamsters retirees have been invited to attend the DNC … ",
    "url": "https://www.axios.com/2024/08/20/dnc-teamsters-sean-obrien-democrats"
  },
  {
    "text": "Kamala Harris Walks Out to Beyoncé and a Standing Ovation During DNC Debut  —  SURPRISE!  —  The vice president took the stage in Chicago on Monday to the delight of a jubilant crowd, which roared back at her a “we will win” chant.  —  CHICAGO — Vice President Kamala Harris … ",
    "url": "https://www.thedailybeast.com/kamala-harris-walks-out-to-beyonce-and-a-standing-ovation-on-dnc-night-1"
  },
  {
    "text": "Trump Insists He's “Extremely Normal” During Incredibly Weird Speech  —  After stewing in Tim Walz's “weird” label for several weeks, Donald Trump has finally cooked up a comeback: No, you.  —  “You know, he said we're weird,” Trump told a small crowd in York, Pennsylvania … ",
    "url": "https://newrepublic.com/post/185026/donald-trump-insists-normal-incredibly-weird-speech"
  },
  {
    "text": "Trump Tries to Clarify That He and Vance ‘Are Extremely Normal People’  —  The former president can't seem to get over Democrats calling him and his running mate “weird”  —  Democrats attacking Donald Trump and his running mate J.D. Vance as “weird” is still getting under the former president's skin … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-vance-extremely-normal-people-1235083138/"
  },
  {
    "text": "Harris proposes raising the corporate tax rate to 28%, rolling back a Trump law  —  The vice president is rolling out her first revenue-raising policy proposal as the Democratic presidential nominee, and drawing a contrast with GOP opponent Donald Trump.  —  CHICAGO — Vice President Kamala Harris … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-proposes-raising-corporate-tax-rate-28-rolling-back-trump-law-rcna167208"
  },
  {
    "text": "Trump says he may end EV tax credit; is open to naming Elon Musk as an adviser  —  Republican presidential candidate Donald Trump said on Monday that if elected he would consider ending a $7,500 tax credit for electric-vehicle purchases and that he would be open to naming Tesla (TSLA.O) CEO Elon Musk to a cabinet or advisory role.",
    "url": "https://www.reuters.com/world/us/trump-says-he-would-consider-ending-7500-electric-vehicle-credit-2024-08-19/"
  },
  {
    "text": "Former Trump voter: Trump is ‘lying about pretty much everything’  —  Rich Logis, a former voter for former President Trump, appeared in a video message broadcast to the Democratic National Convention on Monday night to say that the COVID-19 pandemic showed him how Trump was “lying about pretty much everything.”",
    "url": "https://thehill.com/homenews/campaign/4835864-former-trump-voter-lying-dnc/"
  },
  {
    "text": "Former Trump supporter Rich Logis says he's ‘all in’ for Harris  —  In a video message, former Trump supporter Rich Logis of Florida urged Republicans and Independents against voting for the former president.  —  “Lying is Trump's toxic superpower.  He's ripped apart families, communities, our whole country,” Logis said.",
    "url": "https://abcnews.go.com/Politics/live-updates/democratic-convention-2024-day-1?id=112931239&entryId=112963982"
  },
  {
    "text": "Republicans ask the Supreme Court to disenfranchise thousands of swing state voters  —  The Republican Party wants the Supreme Court to weigh in on a nauseatingly complicated voting rights case, which could potentially disenfranchise thousands of presidential voters in the swing state of Arizona.",
    "url": "https://www.vox.com/scotus/367701/supreme-court-arizona-rnc-republicans-mi-familia-vota"
  },
  {
    "text": "Trump's unsettling new question: ‘Why are we having an election?’  —  Given Donald Trump's hostility toward democracy, it's worth pausing when he asks supporters, “Why are we having an election?”  —  By all appearances, Donald Trump really doesn't like it when Democrats describe him as a threat … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-unsettling-new-question-are-election-rcna167196"
  },
  {
    "text": "The Republican ‘impeachment probe’ ends the way it began: with nothing  —  What the probe reveals more than anything is the extent to which Republican House officials were willing to use their power to aid Donald Trump politically.  —  Congressional committees have sweeping power … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/19/republican-impeachment-probe-ends-way-it-began-with-nothing/"
  },
  {
    "text": "Taylor Swift can absolutely sue Trump over the fake endorsement images he reposted.  Winning a lawsuit might be harder.  — Donald Trump recently reposted images showing Taylor Swift and her fans appearing to support him.  — The images include an apparent AI-generated campaign poster of Swift urging “vote for Donald Trump.”",
    "url": "https://www.businessinsider.com/taylor-swift-could-sue-trump-fake-ai-endorsement-images-lawsuit-2024-8"
  },
  {
    "text": "Alex Jones Considers Leaving U.S., And Social Media Approves … LOADING",
    "url": "https://www.huffpost.com/entry/alex-jones-ponders-moving-russia_n_66c3af93e4b05da55528eb3d"
  },
  {
    "text": "JD Vance gets a cheesesteak at Pat's  —  U.S. Sen. JD Vance wanted to know why Pat's King of Steaks didn't have Swiss cheese.  “I don't like Swiss cheese either ... Why do you guys hate Swiss cheese so much, what's the story?” the Republican vice presidential nominee asked … ",
    "url": "https://www.inquirer.com/news/philadelphia/jd-vance-pats-cheesesteak-philadelphia-20240819.html"
  },
  {
    "text": "US intelligence officials say Iran is to blame for hacks targeting Trump, Biden-Harris campaigns  —  U.S. intelligence officials said Monday they were confident that Iran was responsible for the hack of Donald Trump's presidential campaign, casting the cyber intrusion as part of a brazen … ",
    "url": "https://apnews.com/article/iran-fbi-trump-intelligence-community-52641cd66412d7c01d73876acab3d989"
  },
  {
    "text": "Why Gov. Tim Walz Drives Them Crazy  —  And why it's good they're attacking him  —  There's a strange phenomenon occurring with the terminally online right.  Ever since Vice President Kamala Harris announced that Gov. Tim Walz would be her running mate, many of the right have acted with fury.",
    "url": "https://statuskuo.substack.com/p/why-gov-tim-walz-drives-them-crazy"
  },
  {
    "text": "Steve Kerr invokes Steph Curry: Time to tell Trump ‘night night’  —  NBA and U.S. Olympic basketball coach Steve Kerr, speaking on stage at the Democratic National Convention, put his head to his hands in a move made popular by his star player Steph Curry and said it was time to tell Donald Trump “night night.”",
    "url": "https://thehill.com/homenews/campaign/4835980-steve-kerr-democratic-convention/"
  },
  {
    "text": "‘Short-sighted and stupid’: Dem megadonor abandons crypto super PACs  —  The split underscores the growing tension within the industry as Republicans and Democrats fight for tens of millions of dollars in play for the election.  —  Top Democratic donor Ron Conway vowed to break away … ",
    "url": "https://www.politico.com/news/2024/08/19/dem-megadonor-crypto-super-pacs-00174663"
  },
  {
    "text": "D.C. Councilmember Trayon White Sr. arrested on federal bribery charges  —  The councilmember allegedly agreed to accept $156,000 in cash payments in exchange for a pressure campaign to extend contracts in the district.  —  D.C. Councilmember Trayon White Sr. was arrested on Sunday … ",
    "url": "https://www.nbcnews.com/politics/politics-news/dc-councilmember-trayon-white-sr-arrested-federal-bribery-charges-rcna167191"
  },
  {
    "text": "Rep. Alexandria Ocasio-Cortez's Prime-Time Speech Reflects Long March To Mainstream  —  The New York congresswoman shook the establishment when she ousted a senior Democrat but has since become a progressive inside player.  —  LOADING  —  By handing her a prime-time speaking slot … ",
    "url": "https://www.huffpost.com/entry/rep-alexandria-ocasio-cortez-primetime-speech_n_66c3ead6e4b0802831f038bf"
  }
]