[
  {
    "text": "Republicans are trying to find a new term for ‘pro-life’ to stave off more electoral losses  —  Sen. Todd Young, R-Ind., summarized the closed-door meeting on Capitol Hill as being focused on “pro-baby policies.”  —  WASHINGTON — Republican strategists are exploring a shift away from … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-try-find-new-term-life-stave-electoral-losses-rcna103924"
  },
  {
    "text": "'She's played her cards right'; Kristi Noem is positioning herself for the veepstakes  —  The South Dakota governor will appear with Donald Trump at an event in Rapid City on Friday.  —  Not long ago, it looked like Kristi Noem's star was flaming out.  Following a turbulent first term … ",
    "url": "https://www.politico.com/news/2023/09/08/kristi-noem-veepstakes-00114586"
  },
  {
    "text": "Playbook: New strains for the McCarthy-McConnell relationship  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  ENDORSING TRUMP TODAY — “'She's played her cards right'; Kristi Noem is positioning herself for the veepstakes,” by Adam Wren: “[I] … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/08/the-mccarthy-mcconnell-relationship-faces-a-key-test-00114675"
  },
  {
    "text": "Trump White House official Navarro convicted of contempt after defying House Jan. 6 subpoena  —  Trump White House official Peter Navarro was found guilty Thursday of contempt of Congress charges for refusing to cooperate with a congressional investigation into the Jan. 6, 2021, attack on the U.S. Capitol.",
    "url": "https://apnews.com/article/trump-white-house-navarro-contempt-congress-jan-6-a4ad58e1f590e5884fd347c86c121a8a"
  },
  {
    "text": "Willis blasts congressman's ‘interference’ in Fulton Trump probe  —  X  —  Fulton County District Attorney Fani Willis Thursday blasted a congressman who has pledged to investigate her handling of an indictment of former President Donald Trump and others.  —  U.S. Rep. Jim Jordan … ",
    "url": "https://www.ajc.com/politics/willis-blasts-congressmans-interference-in-fulton-trump-probe/IU5USCA3H5A3RJKTMT2WFCL3VU/"
  },
  {
    "text": "Climate protester glues feet to floor, interrupting US Open semifinal between Gauff and Muchova  —  The U.S. Open semifinal between Coco Gauff and Karolina Muchova was delayed by 50 minutes because of a disruption by environmental activists in the Arthur Ashe Stadium stands on Thursday night.",
    "url": "https://apnews.com/article/us-open-delay-women-semifinals-gauff-muchova-00a82f465076adea36b098aa6ca08a0d"
  },
  {
    "text": "Justice Kavanaugh says ethics changes may be coming to Supreme Court  —  CLEVELAND — Justice Brett M. Kavanaugh said Thursday that he is “hopeful” the Supreme Court soon will take specific steps to deal with ethics issues at the court and boost public confidence in the institution.",
    "url": "https://www.washingtonpost.com/politics/2023/09/07/justice-kavanaugh-ethics-supreme-court/"
  },
  {
    "text": "Disney drops all but free speech claim in political retaliation suit against DeSantis  —  Disney on Thursday amended its federal lawsuit against Florida Gov. Ron DeSantis to focus solely on its First Amendment claim that the governor politically retaliated against the company.",
    "url": "https://www.cnbc.com/2023/09/07/disney-drops-all-but-free-speech-claim-in-political-retaliation-suit-against-desantis.html"
  },
  {
    "text": "Press Forward Will Award More Than $500 Million to Revitalize Local News  —  A national coalition of donors catalyzes local news and information for stronger communities.  —  A coalition of 22 donors today announced Press Forward, a national initiative to strengthen communities and democracy … ",
    "url": "https://www.macfound.org/press/press-releases/press-forward-will-award-more-than-500-million-to-revitalize-local-news"
  },
  {
    "text": "The Supreme Court's Fake Praying Coach Case Just Got Faker  —  Last year, the Supreme Court ruled in favor of high school football coach's right to engage in “brief, quiet, personal” prayer—despite photographic evidence that his prayers were drawn-out, loud, and extremely public.",
    "url": "https://slate.com/news-and-politics/2023/09/supreme-court-praying-coach-joe-kennedy-fake.html"
  },
  {
    "text": "Biden's Cabinet members told the White House they plan to stay for his full term  —  White House chief of staff Jeff Zients told all Cabinet members he wanted to know by the end of the summer whether they'll stay through next year.  —  WASHINGTON — Earlier this summer … ",
    "url": "https://www.nbcnews.com/politics/white-house/bidens-cabinet-members-told-white-house-plan-stay-put-rcna103927"
  },
  {
    "text": "Tim Scott suggests opponents are planting stories about his unmarried status  —  The South Carolina senator has been slowly rising in early-state polls in the Republican presidential contest.  —  RYE, N.H. — Sen. Tim Scott suggested during a Thursday campaign stop in New Hampshire … ",
    "url": "https://www.nbcnews.com/politics/2024-election/tim-scott-suggests-opponents-are-planting-stories-unmarried-status-rcna103984"
  },
  {
    "text": "Republicans Are Freaking Out Over Imaginary COVID Mandates  —  South Carolina's Governor is the latest state Republican to vow never to bring back mask mandates.  —  A group of Republican presidential candidates and lawmakers have spent the week raising hell at the prospect of COVID mask mandates … ",
    "url": "https://www.thedailybeast.com/republicans-are-freaking-out-over-imaginary-covid-mandates-including-south-carolina-guv-henry-mcmaster"
  },
  {
    "text": "White House finishes $50 million renovation of Situation Room in first overhaul since 2007  —  A smaller room, where former President Barack Obama and top officials monitored the raid that killed Osama bin Laden, was preserved in its entirety and sent to the Obama library.",
    "url": "https://www.nbcnews.com/politics/white-house/white-house-finishes-50-million-renovation-situation-room-rcna104011"
  },
  {
    "text": "Trump notifies judge he may try to move Georgia case to federal court  —  Former President Trump on Thursday signaled he may attempt to move his Georgia charges to federal court.  —  “President Trump hereby notifies the Court that he may seek removal of his prosecution to federal court,” … ",
    "url": "https://thehill.com/regulation/court-battles/4192540-trump-notifies-judge-he-may-try-to-move-georgia-case-to-federal-court/"
  },
  {
    "text": "Chaos, Comedy, and ‘Crying Rooms’: Inside Jimmy Fallon's ‘Tonight Show’  —  Sixteen current and former staffers say Fallon's erratic behavior spoiled their “dream” of working on The Tonight Show  —  I … The host, known for his warm and congenial presence onscreen, was acting especially dismissive … ",
    "url": "https://www.rollingstone.com/tv-movies/tv-movie-features/jimmy-fallon-tonight-show-toxic-work-environment-crying-rooms-nbc-1234819421/"
  },
  {
    "text": "They Did This to Themselves  —  THE DREAD IS PALPABLE.  —  Donald Trump's dominance over the Republican party and his overwhelming lead in primary polling has some conservatives shaking their fists at the sky.  —  “What, in Heaven's name, is the case for keeping him around?” asks an exasperated Charles Cooke in National Review.",
    "url": "https://plus.thebulwark.com/p/they-did-this-to-themselves"
  },
  {
    "text": "Anti-police activist discovers the consequences of ‘dismantling’ the police  —  Shivanthi Sathanandan describes herself on Twitter as ‘2nd Vice Chair, Minnesota Democratic-Farmer-Labor Party’—which is what the Democratic Party calls itself in Minnesota.  And we learned today that she was pretty viciously attacked:",
    "url": "https://twitchy.com/aaronwalker/2023/09/07/shivanthi-sathanandan-discovers-consequences-of-dismantling-the-police-n2386950"
  },
  {
    "text": "DOJ Shouldn't Explore for Crimes to Indict Hunter Biden  —  The likely imminent indictment of the president's son is what happens when prosecutors cast about for something, anything, to charge. … The Justice Department's announcement that Special Counsel David Weiss intends … ",
    "url": "https://www.thedailybeast.com/doj-shouldnt-explore-for-crimes-to-indict-hunter-biden"
  },
  {
    "text": "Federal appeals court says Texas' floating barriers can remain in Rio Grande for now  —  The 5th US Circuit Court of Appeals issued a temporary stay Thursday night allowing the state of Texas to keep floating barriers in the Rio Grande.  —  A lower court judge had ordered Texas … ",
    "url": "https://www.cnn.com/2023/09/07/politics/texas-water-barriers-migrants-appeal/"
  },
  {
    "text": "Biden's semi-subtle reminder of the stakes for democracy in 2024  —  There was a period before the 2008 presidential election when it seemed as though the Republican nominee might be former Arkansas governor Mike Huckabee.  At two points in the cycle, he was polling at or near the front-runner … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/07/bidens-semi-subtle-reminder-stakes-democracy-2024/"
  }
]