[
  {
    "text": "Nikki Haley to Exit Republican Presidential Race  —  Former South Carolina governor expected to urge Trump to try to earn the support of those who backed her  —  Nikki Haley plans to suspend her Republican presidential primary bid in a speech Wednesday morning, people familiar with her plans told The Wall Street Journal.",
    "url": "https://www.wsj.com/politics/elections/nikki-haley-drops-out-2024-presidential-election-625277ca"
  },
  {
    "text": "5 Takeaways From Super Tuesday: Trump Wins and Haley Is Set to Exit  —  Donald Trump racked up delegates, but also revealed weaknesses.  Nikki Haley reckoned with cold, hard math.  And restive Democrats sent a message to President Biden. … Donald J. Trump rolled up victories across … ",
    "url": "https://www.nytimes.com/2024/03/06/us/politics/super-tuesday-trump-biden-takeaways.html"
  },
  {
    "text": "Nikki Haley to end presidential campaign, ceding GOP nomination to Trump  —  The former South Carolina governor is dropping out after losing every state but one — Vermont — in Super Tuesday's primary contests.  —  Former South Carolina Gov. Nikki Haley will drop out of the 2024 presidential race Wednesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-ends-presidential-campaign-trump-gop-primary-rcna134811"
  },
  {
    "text": "Super Tuesday: Utah Republicans favor Trump in chaotic presidential caucus overshadowed by voting system issues  —  Utah Democrats to nominate President Joe Biden in Super Tuesday presidential primary victory.  —  Utah is poised to join the growing list of states where President Joe Biden … ",
    "url": "https://www.sltrib.com/news/politics/2024/03/05/super-tuesday-utah-republican/"
  },
  {
    "text": "Biden loses American Samoa Democratic caucuses  —  President Biden was projected to lose the Democratic caucuses in American Samoa to an obscure candidate in a surprising result that comes amid a string of Super Tuesday wins.  —  The race was called Tuesday night by Decision Desk HQ (DDHQ) … ",
    "url": "https://thehill.com/homenews/campaign/4511397-biden-loses-american-samoa-democratic-caucus/"
  },
  {
    "text": "Nikki Haley suspending presidential campaign … - She's expected to announce the news in remarks on Wednesday morning, the Wall Street Journal first reported.  — The source confirmed Haley won't endorse Trump. … - Haley, the former governor of South Carolina, also saw a crushing double-digit loss to Trump in her home state.",
    "url": "https://www.axios.com/2024/03/06/nikki-haley-suspends-campaign-2024-presidential"
  },
  {
    "text": "There is something wrong at the New York Times  —  From presidential polls to refusing to report on Trump's stumbles, things aren't adding up at the Gray Lady  —  Two things — check that, three things — appear to have gone off the rails at the paper we used to call the Gray Lady.",
    "url": "https://www.salon.com/2024/03/05/there-is-something-at-the-new-york-times/"
  },
  {
    "text": "Donald Trump, Seeking Cash Infusion, Meets With Elon Musk  —  It's not clear whether Mr. Musk will spend any of his billions on the former president's behalf.  If he does, he could erase Mr. Trump's financial disadvantage in the 2024 race.  —  Donald Trump, who is urgently seeking … ",
    "url": "https://www.nytimes.com/2024/03/05/us/politics/trump-elon-musk.html"
  },
  {
    "text": "Independent Sen. Kyrsten Sinema of Arizona says she won't seek reelection, avoiding a 3-way race  —  Independent Sen. Kyrsten Sinema of Arizona announced on Tuesday that she won't run for a second term after her estrangement from the Democratic Party left her politically homeless and without a clear path to reelection.",
    "url": "https://apnews.com/article/kyrsten-sinema-arizona-8043c3333e6d87da2404f58339f1e1e6"
  },
  {
    "text": "Kyrsten Sinema Bows Out of Arizona Senate Race  —  The independent incumbent's decision cleared the field for a two-person race, most likely between Representative Ruben Gallego, a Democrat, and Kari Lake, a Republican.  —  Senator Kyrsten Sinema of Arizona, the Democrat turned independent … ",
    "url": "https://www.nytimes.com/2024/03/05/us/politics/kyrsten-sinema-arizona-senate.html"
  },
  {
    "text": "RFK Jr. says campaign has qualified for Nevada general election ballot  —  Independent presidential candidate Robert F. Kennedy Jr.'s campaign said Tuesday he has qualified for the general election ballot in Nevada.  —  “Today marks the end of the primary and the beginning of the general election … ",
    "url": "https://thehill.com/homenews/campaign/4512458-rfk-jr-says-campaign-has-qualified-for-nevada-general-election-ballot/"
  },
  {
    "text": "Kennedy Collects Needed Signatures to Gain Ballot Access in Swing State Nevada, Wins Lawsuit in Idaho  —  Independent Presidential Candidate Robert F. Kennedy, Jr. today announced the campaign has collected the necessary signatures to put “Bobby on the Ballot” in Nevada.",
    "url": "https://www.kennedy24.com/kennedy_signatures_nevada"
  },
  {
    "text": "Republican Mark Robinson and Democrat Josh Stein will face off in North Carolina's governor race  —  NBC News projects the two statewide officials will advance to the general election in the race to replace term-limited Democratic Gov. Roy Cooper.  —  Democrat Josh Stein and Republican Mark Robinson … ",
    "url": "https://www.nbcnews.com/politics/2024-election/north-carolina-primary-governor-win-election-rcna141270"
  },
  {
    "text": "The Supreme Court Just Delivered a Rare Self-Own for John Roberts  —  The Supreme Court's unsigned majority opinion in Trump v. Anderson, ending Colorado's attempt to disqualify Donald Trump from appearing on the ballot as an insurrectionist, is a remarkable self-own.",
    "url": "https://slate.com/news-and-politics/2024/03/supreme-court-john-roberts-trump-ballot-fail.html"
  },
  {
    "text": "Biden administration finalizes rule cutting credit card late fees  —  The move is expected to drop the typical credit card late fee to $8 from $32.  —  President Joe Biden meets Italian Prime Minister Giorgia Meloni in the Oval Office of the White House, Friday, March 1, 2024, in Washington.",
    "url": "https://abcnews.go.com/US/biden-administration-finalizes-rule-cutting-credit-card-late/story?id=107799462"
  },
  {
    "text": "Protesters shut down Schiff's victory speech and call for cease-fire in Gaza  —  Protesters calling for a cease-fire in Gaza interrupted a speech by Rep. Adam Schiff (D-Calif.) on Tuesday night — loudly shouting him down and forcing him to truncate his remarks, as he was attempting … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/06/california-adam-schiff-gaza-speech/"
  },
  {
    "text": "Colin Allred Wins Democratic Primary For U.S. Senate In Texas, Will Face Ted Cruz  —  The congressman from Dallas ran as a moderate, defeating a more progressive opponent.  —  LOADING  —  Rep. Colin Allred (D-Texas) will try to unseat Sen. Ted Cruz (R-Texas) in a pivotal Senate contest this November.",
    "url": "https://www.huffpost.com/entry/colin-allred-democratic-primary-texas_n_65e74111e4b0d2a2475ac6e4"
  },
  {
    "text": "Liberty University faces $14 million fine for Clery Act violations  —  Liberty University faces a $14 million fine from the U.S. Department of Education as part of a settlement agreement with the university for “material and ongoing violations” of the Clery Act relating to its published crime statistics … ",
    "url": "https://newsadvance.com/news/local/liberty-university-faces-14-million-fine-for-clery-act-violations/article_c23b8c9a-db23-11ee-b724-ff40bcc6eec4.html"
  },
  {
    "text": "Scoop: McConnell deputy John Thune endorsing MAGA darling Kari Lake … - Thune has a strained past with the Trump wing of the party, not endorsing the former president until late last month. … - Trump endorsed Thune's GOP primary challenger in 2022.  — Lake, who aggressively pushed theories … ",
    "url": "https://www.axios.com/2024/03/06/john-thune-kari-lake-arizona-senate-2024-election"
  },
  {
    "text": "Trump asks judge to cut the $83.3 million penalty in E. Jean Carroll case or grant him a new trial  —  New York CNN  —  In a longshot bid, former President Donald Trump is asking the judge overseeing E. Jean Carroll's defamation case against him to significantly reduce the $83.3 million jury award or grant a new trial.",
    "url": "https://www.cnn.com/2024/03/05/politics/e-jean-carroll-donald-trump/"
  }
]