[
  {
    "text": "Live Updates: Trump to Be Sentenced in N.Y. Criminal Case  —  The proceedings are set to begin at 9:30 a.m. in Manhattan.  Though the president-elect is expected to avoid jail time, his sentencing on 34 counts will formalize his status as a felon and make him the first to carry that distinction into the White House.",
    "url": "https://www.nytimes.com/live/2025/01/10/nyregion/trump-hush-money-sentencing?unlocked_article_code=1.oE4.Lfvj.59La0Pj1ELhH&smid=url-share"
  },
  {
    "text": "Trump sentencing live updates: Judge sentences Trump to 'unconditional discharge in hush money case  —  The sentence means the conviction stands without any further penalties, making the president-elect a convicted felon just days ahead of his inauguration. … Trump's former lawyer, Rudy Giuliani, is also in court today",
    "url": "https://www.nbcnews.com/politics/donald-trump/live-blog/trump-sentencing-judge-juan-merchan-live-updates-rcna186199"
  },
  {
    "text": "Meta Deletes Trans and Nonbinary Messenger Themes  —  Meta deleted nonbinary and trans themes for its Messenger app this week, around the same time that the company announced it would change its rules to allow users to declare that LGBTQ+ people are “mentally ill,” 404 Media has learned.",
    "url": "https://www.404media.co/meta-deletes-trans-and-nonbinary-messenger-themes/"
  },
  {
    "text": "Meta never cared about factchecking.  What it wants is friction-free oligarchy  —  The company's plan to end its factchecking program is about appeasing Trump.  That signals the making of a mafia state  —  This week Meta announced the elimination of its factchecking program in the US … ",
    "url": "https://www.theguardian.com/commentisfree/2025/jan/10/meta-factchecking-donald-trump"
  },
  {
    "text": "Gabbard reverses course on key intel-gathering tool as nomination teeters … In her first public comments since being nominated, Gabbard told us in an exclusive statement that she now supports Section 702, saying the program is “crucial” and “must be safeguarded to protect our nation while ensuring the civil liberties of Americans.”",
    "url": "https://punchbowl.news/article/senate/gabbard-changes-stance-on-section-702/"
  },
  {
    "text": "1/10/25 ☀️ AM:  —  Arrington ‘accidentally’ pitches raising taxes in presentation to House GOP  —  Gabbard reverses course on key intel-gathering tool as nomination teeters  —  The Vault: Warren's Senate Banking team is here  —  Longtime key House GOP aide departing for Peterson Foundation",
    "url": "https://punchbowl.news/archive/11025-am/"
  },
  {
    "text": "U.S. payrolls grew by 256,000 in December, much more than expected; unemployment rate falls to 4.1% … Job growth was much stronger than expected in December, likely providing the Federal Reserve less incentive to cut interest rates this year.  —  Nonfarm payrolls surged by 256,000 for the month … ",
    "url": "https://www.cnbc.com/2025/01/10/jobs-report-december-2024.html"
  },
  {
    "text": "How Outlets on the Left and Right Have Covered the Los Angeles Wildfires  —  Media outlets reported similarly on the destruction caused by the fires that raced through Southern California.  But partisan publications attributed them to very different causes.",
    "url": "https://www.nytimes.com/2025/01/09/business/media/los-angeles-wildfires-media-coverage.html?unlocked_article_code=1.oE4.2VtQ.XBN_sSFfrSvO&smid=url-share"
  },
  {
    "text": "DOGE is dispatching agents across U.S. government  —  Federal officials are already dealing with surrogates from Elon Musk and Vivek Ramaswamy's nongovernmental body before Donald Trump is sworn in again.  —  Elon Musk and Vivek Ramaswamy are sending representatives to agencies across … ",
    "url": "https://www.washingtonpost.com/business/2025/01/10/musk-ramaswamy-doge-federal-agencies/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2NDg1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3ODY3NTk5LCJpYXQiOjE3MzY0ODUyMDAsImp0aSI6ImRhY2Q0MmI5LWM5NjEtNGM1ZS05YWU4LWNiNTBlNjM3NTI0NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzEwL211c2stcmFtYXN3YW15LWRvZ2UtZmVkZXJhbC1hZ2VuY2llcy8ifQ.SPfFh8QQmh7CW5xnX93Txv0_sUOA_AFxK_KUkCFRgO4&itid=gfta"
  },
  {
    "text": "As a Climate Scientist, I Knew It Was Time to Leave Los Angeles  —  I am utterly devastated by the Los Angeles wildfires, shaking with rage and grief.  The Altadena community near Pasadena, where the Eaton fire has damaged or destroyed at least 5,000 structures, was my home for 14 years.",
    "url": "https://www.nytimes.com/2025/01/10/opinion/la-fires-los-angeles-wildfires.html?unlocked_article_code=1.oE4.wlwn.9-ljiFqRbGB9&smid=bs-share"
  },
  {
    "text": "Treasury Sanctions Venezuelan Officials Supporting Nicolas Maduro's Repression and Illegitimate Claim to Power  —  Multilateral Action Maintains Pressure on Maduro and his Representatives  —  WASHINGTON — Today, the Department of the Treasury's Office of Foreign Assets Control (OFAC) … ",
    "url": "https://home.treasury.gov/news/press-releases/jy2778"
  },
  {
    "text": "Barry Blitt's “Two's a Crowd”  —  Elon Musk takes center stage.  —  In cartoonist Barry Blitt's portrayal of the upcoming Inauguration Day, the new President is sidelined into a dash of yellow hair and a sliver of red tie.  “On January 20, 2025, the next leader of the United States—and of the free world—assumes power,” Blitt said.",
    "url": "https://www.newyorker.com/culture/cover-story/cover-story-2025-01-20"
  },
  {
    "text": "Exclusive: Meta kills DEI programs … - The moves come just three days after Meta ended many of its efforts to fact-check and police speech on Facebook, Instagram and Threads.  — The announcement also follows a host of public moves by tech companies and executives to align with the politics … ",
    "url": "https://www.axios.com/2025/01/10/meta-dei-programs-employees-trump"
  },
  {
    "text": "A time for truth and reconciliation  —  Trump's return to the White House augurs the ‘apokálypsis’ of the ancien regime's secrets  —  The writer is a technology entrepreneur and investor.  —  In 2016, President Barack Obama told his staff that Donald Trump's election victory was “not the apocalypse”.",
    "url": "https://www.ft.com/content/a46cb128-1f74-4621-ab0b-242a76583105"
  },
  {
    "text": "How a Phone Call Drew Alito Into a Trump Loyalty Squabble  —  The phone call centered on a former law clerk of Justice Alito's.  In the eyes of the Trump team, the clerk still needed to prove his loyalty to the president-elect.  —  Justice Samuel A. Alito Jr. received a call on his cellphone Tuesday.",
    "url": "https://www.nytimes.com/2025/01/09/us/politics/alito-trump-phone-call-ethics.html?unlocked_article_code=1.oE4.IMyd.vDGukd3d0M7O&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "‘Pizzagate’ gunman killed by police in North Carolina after traffic stop, authorities say  —  A man who fired a gun inside a restaurant in the nation's capital after a fake online conspiracy theory called “Pizzagate” motivated him to do so nearly a decade ago was shot and killed by North Carolina police during a weekend traffic stop.",
    "url": "https://apnews.com/article/pizzagate-gunman-dead-police-shooting-north-carolina-81f0383fb55587350576b8265b7b5dd5"
  },
  {
    "text": "Kash Patel's Emails Offer Insight Into How He Might Run the FBI  —  More than 800 pages of Patel's emails obtained by FOIA Files, from the Office of Director of National Intelligence, raise questions about whether he'll weaponize the FBI to settle scores if he's confirmed as the bureau's next director.",
    "url": "https://www.bloomberg.com/news/newsletters/2025-01-10/trump-nominee-kash-patel-s-odni-emails-show-how-he-might-politicize-fbi"
  },
  {
    "text": "University of West Florida braces for leadership changes  —  The University of West Florida is bracing for significant changes in leadership following a wave of new appointments to its Board of Trustees.  —  Over the past month, the Florida Board of Governors replaced three trustees … ",
    "url": "https://www.wuwf.org/local-news/2025-01-08/university-of-west-florida-braces-for-leadership-changes"
  },
  {
    "text": "Earth records hottest year ever in 2024 and the jump was so big it breached a key threshold  —  Earth recorded its hottest year ever in 2024, with such a big jump that the planet temporarily passed a major climate threshold, several weather monitoring agencies announced Friday.",
    "url": "https://apnews.com/article/climate-change-warming-hot-record-2024-disasters-12f899f071fcdbd051ad49a872611e92"
  },
  {
    "text": "Economists Are in the Wilderness.  Can They Find a Way Back to Influence?  —  Economists have long helped to shape policy on issues like taxes and health care.  But flawed forecasts and arcane language have cost them credibility.  —  Partway through a panel discussion at a recent economics conference … ",
    "url": "https://www.nytimes.com/2025/01/10/business/economy/economists-politics-trump.html?unlocked_article_code=1.oE4.6jlt.KRS65--CQgjV&smid=url-share"
  },
  {
    "text": "Appeals court muddles timing of release for Jack Smith's final report  —  The attorney general had indicated he planned to release some version of the report publicly.  —  A federal appeals court has rejected an effort by Donald Trump and his allies to block the Justice Department … ",
    "url": "https://www.politico.com/news/2025/01/09/appeals-court-muddles-timing-of-release-for-jack-smiths-final-report-00197461"
  },
  {
    "text": "Trump Organization Says Incoming President Will Separate Himself From Family Business  —  The company is set on Friday to release a series of ethics rules governing the incoming president's interactions with his business empire  —  WASHINGTON—President-elect Donald Trump won't be involved … ",
    "url": "https://www.wsj.com/politics/trump-organization-says-incoming-president-will-separate-himself-from-family-business-86f7a765"
  }
]