[
  {
    "text": "Trump allies face ruinous cash squeeze after Georgia indictment … - “Even if you do some back-of-the envelope accounting, I'd think each motion filed is going to cost a defendant in the five figures minimum,” Caren Morrison, a former Assistant U.S. Attorney in the Eastern District of New York … ",
    "url": "https://www.axios.com/2023/08/26/trump-defendants-georgia-indictment-legal-fees"
  },
  {
    "text": "Trump's mug shot will backfire in 2024  —  Trump thinks this is a political winner for him.  But as New Hampshire Gov. Chris Sununu told me this week, “independents hate it.”  —  Why the mug shot matters  —  This Georgia indictment is different for a whole host of reasons.",
    "url": "https://www.msnbc.com/inside-with-jen-psaki/trumps-mug-shot-will-backfire-2024-rcna101879"
  },
  {
    "text": "Trump Remains Russia's Favorite but This GOPer Is New No.2  —  “The last time, we had installed President Trump for Americans, but our bet didn't quite work out.  Why not try again?” one Russian host said about Vivek Ramaswamy.  —  In Russia, multiple indictments of former U.S. President … ",
    "url": "https://www.thedailybeast.com/trump-remains-russias-favorite-but-goper-vivek-ramaswami-is-new-no2"
  },
  {
    "text": "Trump Can't Go Home Again  —  It's not the site that it used to be.  And he's not the same man.  —  After surrendering on Thursday at an Atlanta jail to be booked on state felony charges alleging his involvement in a criminal conspiracy to void the 2020 presidential election … ",
    "url": "https://www.politico.com/news/magazine/2023/08/26/trump-twitter-return-00113080"
  },
  {
    "text": "Trump raised $7.1 million after Georgia booking, mugshot  —  The former president raised $4.18 million on Friday alone, the single-highest 24 hour period of his campaign to date.  —  Donald Trump has turned his Georgia mugshot into a record-breaking fundraising haul.",
    "url": "https://www.politico.com/news/2023/08/26/trump-mugshot-fundraising-00113118"
  },
  {
    "text": "Sununu says GOP hopefuls must ‘find separation’ from Trump: ‘They have to take it to him’  —  New Hampshire Gov. Chris Sununu (R) called on Republican presidential candidates to go on the offense against the GOP frontrunner, former President Trump.  —  “I think they have to take it to him … ",
    "url": "https://thehill.com/homenews/campaign/4172704-sununu-says-gop-hopefuls-must-find-separation-from-trump/"
  },
  {
    "text": "14th Amendment, Section 3: A new legal battle against Trump takes shape  —  Efforts to disqualify Trump from state ballots are starting to materialize.  —  Former President Donald Trump's legal battles are piling up: in Washington, Georgia, New York — the list goes on.",
    "url": "https://abcnews.go.com/Politics/14th-amendment-section-3-new-legal-battle-trump/story?id=102547316"
  },
  {
    "text": "Suspected shooter spotted at EWU before gunfire erupted at store on Kings Road, sources say  —  Shooter's parents contacted Clay County Sheriff's Office after finding manifesto: sources  —  Kendra Mazeke, Digital Content Producer  —  JACKSONVILLE, Fla. - The man suspected of killing numerous people … ",
    "url": "https://www.news4jax.com/news/local/2023/08/26/developing-heavy-police-presence-reported-on-kings-road/"
  },
  {
    "text": "A shooting in Jacksonville, Florida, has left multiple people and the shooter dead, officials say  —  Multiple people were fatally shot Saturday inside a Jacksonville, Florida, Dollar General store, the city's mayor has told a television station.  A city council member says the shooter is dead.",
    "url": "https://apnews.com/article/florida-store-shooting-fatalities-b65ecad5f81ac8aa35121507dd4f7dcc"
  },
  {
    "text": "3 people dead after gunman targeted Black people in Jacksonville, Florida, officials say  —  Three people were killed Saturday in a racially motivated attack after a gunman targeted Black people at a Dollar General store in Jacksonville, Florida, in one of several weekend shootings … ",
    "url": "https://www.cnn.com/2023/08/26/us/jacksonville-florida-shooting-multiple-fatalities/"
  },
  {
    "text": "Alabama wants to be the 1st state to execute a prisoner by making him breathe only nitrogen  —  Alabama is seeking to become the first state to execute a prisoner by making him breathe pure nitrogen.  The Alabama attorney general's office on Friday asked the state Supreme Court to set … ",
    "url": "https://apnews.com/article/alabama-death-penalty-nitrogen-hypoxia-a6f414ff6147cbd38de6a8cd01f96653"
  },
  {
    "text": "Pentagon protested false Fox News report about fallen Marine, emails show  —  The network quietly removed the story based on false claims from a congressman but did not apologize or run a correction  —  The U.S. Marine Corps went up to the highest levels of Fox News last month to challenge … ",
    "url": "https://www.washingtonpost.com/media/2023/08/26/fox-news-retracts-marine-story-nicole-gee/"
  },
  {
    "text": "Thousands converge on National Mall to mark the March on Washington's 60th anniversary  —  Thousands converged Saturday on the National Mall for the 60th anniversary of Rev. Martin Luther King Jr.'s March on Washington, saying a country that remains riven by racial inequality has yet to fulfill his dream.",
    "url": "https://apnews.com/article/march-on-washington-mlk-dream-speech-anniversary-washington-7639b60f26948fe614978dc6a763cc84"
  },
  {
    "text": "The Silicon Valley Elite Who Want to Build a City From Scratch  —  A mysterious company has spent $800 million in an effort to buy thousands of acres of San Francisco Bay Area land.  The people behind the deals are said to be a who's who of the tech industry.",
    "url": "https://www.nytimes.com/2023/08/25/business/land-purchases-solano-county.html"
  }
]