[
  {
    "text": "Fox News Poll: Harris is ahead of Trump by 3 points in Georgia  —  Georgians trust Harris over Trump on helping the middle class by 7 points  —  In a head-to-head matchup, Vice President Kamala Harris tops former President Trump by 3 percentage points in a Fox News survey of Georgia voters.",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-harris-ahead-trump-3-points-georgia"
  },
  {
    "text": "Harris multiplied Biden's lead among young voters  —  Good morning, Early Birds.  We're thinking of our readers in Florida today as Hurricane Helene bears down.  Stay safe out there!  Send tips to earlytips@washpost.com.  Thanks for waking up with us.  —  In today's edition … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/27/harris-multiplied-bidens-lead-among-young-voters/"
  },
  {
    "text": "Kamala Harris Holds Razor-Thin Lead Across Swing States in Tight 2024 Race  —  About a month before the election, the vice president is eroding Trump's advantage on the economy, the latest Bloomberg News/Morning Consult Poll finds. … Vice President Kamala Harris has all but neutralized … ",
    "url": "https://www.bloomberg.com/news/features/2024-09-26/harris-holds-thin-lead-over-trump-in-swing-state-poll-election-2024"
  },
  {
    "text": "Read the JD Vance Dossier  —  We publish what others won't.  Subscribe to support our work and for updates on this breaking story.  —  Behold the dossier.  —  It reportedly comes from an alleged Iranian government hack of the Trump campaign, and since June, the news media has been sitting on it … ",
    "url": "https://www.kenklippenstein.com/p/read-the-jd-vance-dossier"
  },
  {
    "text": "Harris is visiting Arizona.  But her campaign is prioritizing the Rust Belt.  —  Her travel schedule and advertising across the battlegrounds suggests her campaign is primarily banking on the Rust Belt.  —  When Vice President Kamala Harris suddenly seized the Democratic nomination in July … ",
    "url": "https://www.politico.com/news/2024/09/27/harris-arizona-blue-wall-pennsylvania-election-00181314"
  },
  {
    "text": "Donald Trump holds lead over Kamala Harris in Arizona, exclusive poll finds  —  With less than six weeks until the general election, former President Donald Trump holds an edge over Vice President Kamala Harris in the key battleground state of Arizona, according to an exclusive new USA TODAY/Suffolk University poll.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/27/exclusive-poll-arizona-trump-leads-harris/75385504007/"
  },
  {
    "text": "Harris to accuse Trump of ‘playing political games’ with immigration in border visit  —  The vice president is making her first trip to the southern border as the Democratic nominee.  —  When Vice President Kamala Harris makes her first trip to the southern border as the Democratic nominee … ",
    "url": "https://www.politico.com/news/2024/09/27/harris-trump-immigration-border-00181354"
  },
  {
    "text": "Jack Smith files evidence in Trump 2020 election subversion case  —  The special counsel's submission is being kept under wraps, for now.  —  Special counsel Jack Smith has filed a detailed compilation of evidence he's assembled to support charges that former President Donald Trump broke federal law … ",
    "url": "https://www.politico.com/news/2024/09/26/jack-smith-election-subversion-brief-00181331"
  },
  {
    "text": "Newsmax and Smartmatic settle 2020 election defamation case on eve of trial  —  CNN  —  The pro-Trump cable channel Newsmax has settled a major 2020 election defamation lawsuit with Smartmatic in a last-minute agreement to avoid a high-stakes trial that posed a significant risk to the small outlet, according to a court official.",
    "url": "https://www.cnn.com/2024/09/26/business/newsmax-smartmatic-settle-defamation-case"
  },
  {
    "text": "Newsmax and Smartmatic settle 2020 election defamation case on eve of trial  —  The pro-Trump cable outlet Newsmax and voting technology company Smartmatic settled a major defamation lawsuit Thursday in a last-minute agreement, averting a high-stakes trial over the airing of false 2020 election claims.",
    "url": "https://www.cnn.com/2024/09/26/media/newsmax-smartmatic-settle-defamation-case"
  },
  {
    "text": "Ex-Kansas GOP senator backs Harris  —  Former Kansas Republican Sen. Nancy Kassebaum (R-Kan.) is endorsing Vice President Harris in the 2024 presidential election, stating the White House contest “presents a stark choice that is not easy for any of us.”  —  Kassebaum, who served three terms … ",
    "url": "https://thehill.com/homenews/campaign/4902704-former-kansas-gop-senator-nancy-kassebaum-endorses-kamala-harris/"
  },
  {
    "text": "Zelenskyy visits Washington as election year divide grows over Ukraine war  —  With American support for Ukraine at a partisan crossroads, Vice President Kamala Harris on Thursday slammed suggestions that Kyiv should cede territory for the sake of peace with Moscow as “dangerous and unacceptable.”",
    "url": "https://apnews.com/article/zelenskyy-joe-biden-kamala-harris-trump-229804fd42332c584dfbe05224634e44"
  },
  {
    "text": "North Carolina removes 747,000 from voter rolls, citing ineligibility  —  North Carolina's State Board of Elections has removed 747,000 people from its list of registered voters within the last 20 months, officials announced Thursday in a press release.  —  The State Board of Elections … ",
    "url": "https://thehill.com/homenews/campaign/4901476-north-carolina-purges-747k-voters/"
  },
  {
    "text": "Millions of Vehicles Could Be Hacked and Tracked Thanks to a Simple Website Bug  —  Researchers found a flaw in a Kia web portal that let them track millions of cars, unlock doors, and start engines at will—the latest in a plague of web bugs that's affected a dozen carmakers.",
    "url": "https://www.wired.com/story/kia-web-vulnerability-vehicle-hack-track/"
  },
  {
    "text": "RFK Jr's chaos campaign to support Trump  —  He says he doesn't want to be a spoiler, but he's spoiling pretty hard. … On August 23, Robert F. Kennedy, Jr. suspended his presidential campaign.  Citing the war in Ukraine and the “war on our children,” as well as “relentless … ",
    "url": "https://www.publicnotice.co/p/rfk-jr-chaos-campaign-to-support-trump"
  },
  {
    "text": "Trump Would Totally Demolish Economy With His Plans, Says New Report  —  Donald Trump says he has a plan for the economy, but that doesn't mean it's any good.  —  According to independent nonprofit nonpartisan researchers, Trump's policies on tariffs, deportations, and the Federal Reserve would … ",
    "url": "https://newrepublic.com/post/186413/trump-demolish-economy-hike-inflation-report"
  },
  {
    "text": "McConnell: Democrats would end the filibuster if they sweep on Election Day  —  The News  —  Mitch McConnell is convinced of one thing: The Democratic Party would have the support it needs to kill the Senate filibuster if it takes full control of Washington this year.",
    "url": "https://www.semafor.com/article/09/26/2024/mcconnell-democrats-would-end-the-filibuster-if-they-win-big-this-year"
  },
  {
    "text": "Trump Media shareholder UAV dumped nearly 11 million shares … United Atlantic Ventures LLC, a major shareholder in Trump Media, has sold or otherwise gotten rid of nearly 11 million shares in the company, according to a regulatory filing Thursday.  —  The move left UAV, a partnership of former … ",
    "url": "https://www.cnbc.com/2024/09/26/trump-media-shareholder-dumped-more-than-7point5-million-shares.html"
  },
  {
    "text": "A New York Court Questioned If Trump Was Correctly Nailed For Bank Fraud  —  The state appeals court is evaluating whether Letitia James went too far in the case that has Trump facing a half-billion-dollar judgment.  — Copy  —  As Donald Trump's lawyers tried on Thursday to overturn … ",
    "url": "https://www.notus.org/courts/new-york-appeals-court-trump-bank-fraud"
  },
  {
    "text": "JD Vance, in 2020 messages, said Trump ‘thoroughly failed to deliver’  —  In previously undisclosed messages, the future vice-presidential nominee said Trump had not fulfilled his economic agenda and predicted he would lose to Biden.  —  Vice-presidential nominee JD Vance has a go-to explanation … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/27/jd-vance-messages-trump-criticism-2020/"
  },
  {
    "text": "The Eric Adams Indictment Is Laden With Irony  —  The tough-on-crime mayor was, according to prosecutors, pretty easy to buy.  —  The indictment of Eric Adams, unsealed Thursday, is a colorful document, alleging over $100,000 in graft, the defrauding of $10 million in public funds, and a whole lot of subsidized travel to Turkey.",
    "url": "https://slate.com/news-and-politics/2024/09/eric-adams-indictment-turkey-hotels-airplanes-crime.html"
  },
  {
    "text": "California to apologize for state's legacy of racism against Black Americans under new law  —  California will formally apologize for slavery and its lingering effects on Black Americans in the state under a new law Gov. Gavin Newsom signed Thursday.  The legislation was part of a package … ",
    "url": "https://apnews.com/article/california-reparations-newsom-apology-black-slavery-c03d38880f8d7d269bc31cd0021d3980"
  },
  {
    "text": "Hungarian PM Orban's aide sparks outrage with Soviet invasion comment  —  A top aide of Prime Minister Viktor Orban has triggered outrage by suggesting that Hungary would have fared better by not resisting the 1956 Soviet invasion, in comments that were also critical of Ukraine's efforts today to push back Russian forces.",
    "url": "https://www.reuters.com/world/europe/hungarian-pm-orbans-aide-sparks-outrage-with-soviet-invasion-comment-2024-09-27/"
  },
  {
    "text": "FACT SHEET: President Biden and Vice President Harris Announce Additional Actions to Reduce Gun Violence and Save Lives  —  New Executive Order Directs Federal Agencies to Combat Emerging Firearms Threats and  —  Improve School-Based Active Shooter Drills  —  Today, President Biden … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/09/26/fact-sheet-president-biden-and-vice-president-harris-announce-additional-actions-to-reduce-gun-violence-and-save-lives/"
  }
]