[
  {
    "text": "Trump and Musk's relationship flames out just as it started, intensely and publicly  —  President Donald Trump on Thursday threatened to cut Elon Musk's government contracts as their fractured alliance rapidly escalated into a public feud with Trump suggesting he would use the U.S. government to hurt his fellow billionaire financially.",
    "url": "https://apnews.com/article/trump-musk-tax-bill-6e7845081259c34db785182c51569c0c"
  },
  {
    "text": "Live Updates: Trump Threatens to Cut Elon Musk's Government Contracts as Feud Escalates  —  The open acrimony between the two men comes after the billionaire denounced President Trump's signature domestic policy bill as an “abomination.”  —  Haiyun Jiang for The New York Times  —  Here's the latest.",
    "url": "https://www.nytimes.com/live/2025/06/05/us/trump-elon-musk"
  },
  {
    "text": "Trump's Empire of Control Is Crumbling  —  Donald Trump is furious.  What's bugging him?  Simple: powerful people he thought he owned are rebelling.  —  The prime example is his fraying relationship with Elon Musk—the world's richest man and, until recently, Trump's “First Buddy.”",
    "url": "https://adamkinzinger.substack.com/p/trumps-empire-of-control-is-crumbling"
  },
  {
    "text": "Musk says Trump would have lost 2024 election without him as ‘Big Beautiful Bill’ feud continues  —  Elon Musk took a swipe at President Donald Trump Thursday on X  —  Elon Musk and President Donald Trump's feud about the “Big Beautiful Bill” continued on Thursday when the tech billionaire responded … ",
    "url": "https://www.foxnews.com/politics/musk-says-trump-would-have-lost-2024-election-without-him-big-beautiful-bill-feud-continues"
  },
  {
    "text": "Stephen Miller Erupts in Fury Over Low Arrests—and Hands Dems a Weapon  —  The potential deportation of people like Carol Hui, which has shocked locals in the Missouri town where she's lived for 20 years, has inspired a searching debate: What did people think they were voting for when they chose Donald Trump?",
    "url": "https://newrepublic.com/article/196154/stephen-miller-erupts-fury-low-arrests-and-hands-dems-weapon"
  },
  {
    "text": "Media coverage of Kilmar Abrego Garcia hurt Trump, not Democrats  —  A group of center-left Democratic strategists, politicians, and commentators met at “WelcomeFest” in Washington, D.C., on Wednesday to figure out what went wrong in 2024 and how to compete in the future.",
    "url": "https://www.gelliottmorris.com/p/kilmar-abrego-garcia-immigration-democrats-yglesias"
  },
  {
    "text": "At ‘CPAC of the Center,’ Democratic Moderates Beat Up on the Left  —  At a wonky gathering in Washington, centrist Democrats argued that they were the majority-makers the party needed to take control of Congress in 2026 and beyond.  —  The centrist wing of the Democratic Party gathered … ",
    "url": "https://www.nytimes.com/2025/06/04/us/politics/democrats-centrists-moderates-welcome-pac.html"
  },
  {
    "text": "Medicare is a target as Senate GOP faces megabill math issues  —  Republicans have so far kept hands off the politically sensitive program.  But senators are now desperate to find additional spending cuts.  —  Senate Republicans are eyeing possible Medicare provisions to help offset the cost … ",
    "url": "https://www.politico.com/news/2025/06/05/medicare-is-a-target-as-senate-gop-faces-megabill-math-issues-00389537"
  },
  {
    "text": "Dr. Oz on Medicaid cuts: People should ‘prove that they matter’  —  Centers for Medicare and Medicaid Services Administrator Mehmet Oz defended President Trump's “big, beautiful bill” over criticism that millions of people could lose health coverage, saying those who would face new work requirements should “prove that they matter.”",
    "url": "https://thehill.com/policy/healthcare/5334508-dr-oz-medicaid-cuts-work-requirements/"
  },
  {
    "text": "Bidenworld goes scorched earth on Karine Jean-Pierre  —  Former Biden press secretary Karine Jean-Pierre announced Tuesday that she's written a book about a “broken” Biden White House and what she sees as the betrayal of the former president by the Democratic Party.",
    "url": "https://www.axios.com/2025/06/05/karine-jean-pierre-book-reaction-biden-aides"
  },
  {
    "text": "The Trump administration justifies its new entry ban as punishing countries for “visa overstays.”  Barring most people from 19 countries, the Presidential Proclamation refers again and again to a Customs and Border Protection (CBP) report estimating how many people come to the U.S. on a valid visa and then stay longer than authorized.",
    "url": "https://www.linkedin.com/posts/doug-rand_the-trump-administration-justifies-its-new-activity-7336264928367927296-7BJ0"
  },
  {
    "text": "Scoop: Trump admired Ukraine's “badass” attack, but worries what's next  —  President Trump thought Ukraine's surprise drone attack over the weekend was “strong” and “badass,” sources who discussed it with him tell Axios, but he's also concerned it will make his ceasefire mission even harder.",
    "url": "https://www.axios.com/2025/06/05/trump-reaction-ukraine-drone-attack-spiderweb"
  },
  {
    "text": "Supreme Court makes it easier to claim ‘reverse discrimination’ in employment, in a case from Ohio  —  A unanimous Supreme Court made it easier Thursday to bring lawsuits over so-called reverse discrimination, siding with an Ohio woman who claims she didn't get a job and then was demoted because she is straight.",
    "url": "https://apnews.com/article/supreme-court-discrimination-lawsuit-ohio-205f07a2d47d7a46cfc96a5fefdf9269"
  },
  {
    "text": "Elon Musk is a Disgusting Abomination  —  On Tuesday, after Elon Musk blasted out the screed above, a friend texted me: “I guess the worm has turned.  Oh, wait, I guess that's RFK.”  Indeed.  We don't know exactly what set off this tweet and the series of whines that followed, but it may have been the ketamine talking.",
    "url": "https://paulkrugman.substack.com/p/elon-musk-is-a-disgusting-abomination"
  },
  {
    "text": "Texas Talks Tough on Immigration.  But Lawmakers Won't Force Most Private Companies to Check Employment Authorization.  —  Texas' conservative Legislature has again and again refused to mandate that most private businesses use E-Verify.  Experts say that Republican resistance is rooted … ",
    "url": "https://www.propublica.org/article/texas-e-verify-requirements-immigration"
  },
  {
    "text": "Trump critic David Jolly running for governor as Democrat  —  Former Florida Republican congressman and Trump critic David Jolly on Thursday officially launched his campaign for governor as a Democrat.  —  “Let's end the politics of division and return Florida to voters who simply want an economy … ",
    "url": "https://thehill.com/homenews/campaign/5334167-david-jolly-launches-governor-campaign/"
  },
  {
    "text": "How to become a right-wing star?  Harass people  —  Here is one version of the story: A Brown University student created a shoddy AI that labeled individual university administrative employees with terms like “DEI,” “antisemitism,” and “flunkie.”  He emailed all of the employees … ",
    "url": "https://donmoynihan.substack.com/p/how-to-become-a-right-wing-star-harass"
  },
  {
    "text": "Crypto's New Bailout Fund: Your Savings Account  —  After a flood of crypto industry campaign cash, the U.S. Senate is poised to pass a financial deregulation bill ensuring that when a bank goes out of business, the savings of cryptocurrency owners would be made whole before those of other bank customers.",
    "url": "https://www.levernews.com/cryptos-new-bailout-fund-your-savings-account/"
  },
  {
    "text": "Millions Would Lose Their Obamacare Coverage Under Trump's Bill  —  Though Republicans are not explicitly trying to repeal the Affordable Care Act, a series of small, technical changes would substantially reduce enrollment and increase the cost of coverage.  —  Millions of Obamacare enrollees … ",
    "url": "https://www.nytimes.com/2025/06/05/upshot/obamacare-cuts-republicans.html"
  },
  {
    "text": "Alexandria Ocasio-Cortez Endorses Zohran Mamdani as Top Choice for Mayor  —  The New York City congresswoman said she would list Adrienne Adams second on her Democratic primary ballot and urged the left to unite to defeat Andrew Cuomo.  —  Representative Alexandria Ocasio-Cortez … ",
    "url": "https://www.nytimes.com/2025/06/05/nyregion/aoc-endorse-mamdani-mayor.html?unlocked_article_code=1.Mk8.DgW8.Pkuw1m5Gcj5s"
  },
  {
    "text": "I.R.S. Upheld a Biden Pledge: More Audits, but Only on the Wealthy  —  At the same time, the audit rate for those making under $500,000 declined slightly in 2024, fulfilling a promise by the Biden administration.  —  It was a promise repeated many times by President Joseph R. Biden Jr.'s administration … ",
    "url": "https://www.nytimes.com/2025/06/05/upshot/tax-audits-wealthy-biden-trump.html"
  },
  {
    "text": "Trump Appoints 22-Year-Old Ex-Gardener and Grocery Store Assistant to Lead U.S. Terror Prevention  —  Counter-terror chief was pulling up weeds just five years ago.",
    "url": "https://www.thedailybeast.com/donald-trump-appoints-22-y-o-ex-gardener-grocery-store-assistant-as-us-homeland-department-terrorist-chief/"
  },
  {
    "text": "22-Year-Old Leading Terrorism Prevention Center at DHS  —  A division within the Department of Homeland Security tasked with preventing terrorism is being led by a 22-year-old recent college graduate.  —  Thomas Fugate, who graduated magna cum laude with a degree in politics and law … ",
    "url": "https://www.yahoo.com/news/22-old-leading-terrorism-prevention-021028606.html"
  },
  {
    "text": "Trump Org Applies For Sweeping Trademark Covering Items From Crypto Wallet To Virtual Cologne  —  Topline  —  The Trump Organization appears to be laying the groundwork to expand its digital empire even further, filing a wide-ranging trademark application that hints at possible plans … ",
    "url": "https://www.forbes.com/sites/zacheverson/2025/06/05/trump-trademark-crypto-wallet-nfts-virtual-cologne-reality/"
  },
  {
    "text": "Trump speaks with Xi, will resume talks between U.S. and China over tariffs … WATCH NOW  —  President Donald Trump and Chinese President Xi Jinping spoke Thursday and agreed that officials from the U.S. and China will meet soon for more talks to resolve an ongoing trade war.",
    "url": "https://www.cnbc.com/2025/06/05/trump-held-call-with-xi-chinese-media-says.html"
  },
  {
    "text": "OpenAI takes down covert operations tied to China and other countries  —  Chinese propagandists are using ChatGPT to write posts and comments on social media sites — and also to create performance reviews detailing that work for their bosses, according to OpenAI researchers.",
    "url": "https://www.npr.org/2025/06/05/nx-s1-5423607/openai-china-influence-operations"
  }
]