[
  {
    "text": "Tulsi Gabbard confirmed as director of national intelligence, overcoming skepticism  —  The U.S. Senate has confirmed former Hawaii Rep. Tulsi Gabbard to lead the intelligence community as director of national intelligence, despite initial skepticism.  —  Gabbard was confirmed 52-48 … ",
    "url": "https://www.npr.org/2025/02/12/nx-s1-5294635/tulsi-gabbard-confirmed-dni-intelligence-senate"
  },
  {
    "text": "Senate votes to confirm Tulsi Gabbard as top U.S. intelligence official  —  Gabbard overcame initial skepticism from some Republican senators about her nomination, underscoring Trump's grip on the party.  —  WASHINGTON — The GOP-controlled Senate early Wednesday morning voted … ",
    "url": "https://www.nbcnews.com/politics/national-security/senate-votes-confirm-tulsi-gabbard-top-us-intelligence-official-rcna191587"
  },
  {
    "text": "Live Updates: Trump Holds Call With Putin to Start Talks on Ending Ukraine War  —  Where Things Stand  — Trump-Putin call: President Trump said that he had “a lengthy and highly productive” call with President Vladimir V. Putin of Russia on Wednesday that he characterized as the start of the negotiation to end the war in Ukraine.",
    "url": "https://www.nytimes.com/live/2025/02/12/us/trump-news-gabbard-rfk"
  },
  {
    "text": "Senate votes to confirm Tulsi Gabbard as director of national intelligence  —  The Senate voted Wednesday to confirm former Democratic Rep. Tulsi Gabbard as director of national intelligence, a major win for President Donald Trump as Gabbard had been among the most controversial of his Cabinet picks.",
    "url": "https://www.cnn.com/2025/02/12/politics/tulsi-gabbard-confirmation-vote-senate/"
  },
  {
    "text": "Trump Softens Tone on Inflation After Pledging to Lower Prices  —  President Trump pledged to lower costs on “Day 1” as a candidate.  His administration now acknowledges it will take more time.  —  President Trump promised voters that, if elected, he would enact policies that would bring prices down on “Day 1” in office.",
    "url": "https://www.nytimes.com/2025/02/12/business/trump-inflation-prices.html"
  },
  {
    "text": "CPI Report: Inflation Rose Unexpectedly in January  —  The Consumer Price Index rose 3.0 percent from a year earlier as food and energy prices picked up.  —  U.S. inflation rose to 3 percent in January, strengthening the case for the Federal Reserve to extend a pause on interest rate cuts.",
    "url": "https://www.nytimes.com/2025/02/12/business/inflation-cpi-report-january.html"
  },
  {
    "text": "Trump Humiliated in the ‘Most Powerless Image Ever’ of a U.S. President: O'Donnell  —  Trump has always craved is the attention of the “truly rich,” and how he finally has it, MSNBC's Lawrence O'Donnell said.",
    "url": "https://www.thedailybeast.com/lawrence-odonnell-musk-humiliates-trump-in-most-powerless-image-ever/"
  },
  {
    "text": "Donald Trump Taunted Over ‘Most Powerless Image Of A President’ Ever  —  It's “a picture of presidential subservience the likes of which we have never seen,” said MSNBC's Lawrence O'Donnell.  —  LOADING  —  MSNBC's Lawrence O'Donnell pointed out the power plays that Elon Musk appeared … ",
    "url": "https://www.huffpost.com/entry/lawrence-odonnell-donald-trump-powerless-image_n_67ac760fe4b023227078229d"
  },
  {
    "text": "Republicans Love Trump's Spending Cuts.  Just Not in Their States.  —  Even as they praise the president's unilateral actions to slash federal spending, G.O.P. lawmakers have quietly moved to seek carve outs or exemptions for their own constituents.  —  Republicans in Congress have responded … ",
    "url": "https://www.nytimes.com/2025/02/12/us/politics/trump-spending-republicans-agriculture-research.html"
  },
  {
    "text": "Defying Johnson, Graham and Senate G.O.P. Push Their Own Budget Plan  —  Senator Lindsey Graham, the South Carolina Republican who relishes being in the middle of the action, is leapfrogging the House G.O.P., which is still tied in knots over how to pass its budget.",
    "url": "https://www.nytimes.com/2025/02/12/us/politics/lindsey-graham-budget-johnson-senate-house.html"
  },
  {
    "text": "Government watchdogs fired by Trump sue to get their jobs back  —  Eight inspectors general whom Donald Trump fired from their federal agency watchdog posts are suing for their jobs back, adding to the legal scrutiny over Trump's first weeks of decisions in the White House and raising questions about his political intentions.",
    "url": "https://www.cnn.com/2025/02/12/politics/inspector-general-lawsuit-fired-trump"
  },
  {
    "text": "Hegseth Says Return to Ukraine's Pre-2014 Borders Is ‘Unrealistic’  —  In his first trip abroad, the new U.S. defense secretary told Ukrainian and NATO officials that a durable peace could only come ‘with a realistic assessment of the battlefield.’  —  A return to Ukraine's pre-2014 borders is … ",
    "url": "https://www.nytimes.com/2025/02/12/world/europe/ukraine-war-hegseth-nato.html"
  },
  {
    "text": "Elon Musk's DOGE takes aim at agency that had plans of regulating X  —  Elon Musk made a big leap late last month toward his long-shot goal of turning X into an “everything app,” a service that could encompass a broad range of services, including the ability to transfer money, similar to Venmo or PayPal.",
    "url": "https://www.npr.org/2025/02/12/nx-s1-5293382/x-elon-musk-doge-cfpb"
  },
  {
    "text": "Americans Are Actually in a Position to Make Elon Musk Feel Our Rage  —  The company is in a precarious position.  This is a case where buying choices can effectively communicate rage.  —  There are myriad reasons to loathe Elon Musk, the CEO of Tesla, who has become a top ally of Donald Trump.",
    "url": "https://slate.com/business/2025/02/elon-musk-tesla-stock-valuation-consumer-boycott.html"
  },
  {
    "text": "Family of Venezuelan Migrant Sent to Guantánamo: ‘My Brother Is Not a Criminal.’ … Luis Alberto Castillo, a father of one from Venezuela, entered the United States on Jan. 19, one day before Donald Trump became president for a second term — swept into office on a promise to treat undocumented migrants with a heavy hand.",
    "url": "https://www.nytimes.com/2025/02/11/world/americas/luis-castillo-venezuela-migrant-guantanamo-bay-trump.html?unlocked_article_code=1.wU4.eCDH.fKOVfFbzEKCQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "This obscure law is one reason Trump's agenda keeps losing in court  —  Lawsuits challenging Trump policies raise big constitutional questions, but they also rely on a law that requires the government to follow the correct procedures when changing course.  —  WASHINGTON — Lawyers challenging … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-losing-court-boring-reason-adminitrative-procedure-act-rcna191113"
  },
  {
    "text": "Top Dem on DOGE subcommittee calls on Elon Musk to testify … - “While we're sitting here, Donald Trump and Elon Musk are recklessly and illegally dismantling the federal government,” Stansbury said.  — She went on to accuse Republicans of shielding Musk and Trump as they break the law … ",
    "url": "https://www.axios.com/2025/02/12/melanie-stansbury-doge-subcommittee-elon-musk"
  },
  {
    "text": "Pope Francis's Stunning Rebuke of JD Vance Exposes MAGA's Dark Soul  —  The other day, JD Vance sought to reconcile President Donald Trump's “America First” vision with the tenets of Christianity.  Vance argued for a “Christian concept” that orders our ethical obligations in a series of concentric circles … ",
    "url": "https://newrepublic.com/article/191427/pope-francis-jd-vance-maga-dark-soul"
  },
  {
    "text": "It's a Good Thing Democrats Didn't Pack the Courts  —  Without an independent judiciary, the Constitution would be no match for Donald Trump's authoritarian impulses.  —  As disturbing as the first three weeks of the second Donald Trump administration have been, we can take solace … ",
    "url": "https://washingtonmonthly.com/2025/02/12/its-a-good-thing-democrats-didnt-pack-the-courts/"
  },
  {
    "text": "BREAKING: NIH admits funding freeze is illegal, will resume issuing grants  —  On Monday afternoon, Popular Information broke the news that the National Institutes of Health (NIH) had frozen virtually all grant funding in violation of two federal court orders.",
    "url": "https://popular.info/p/breaking-nih-admits-funding-freeze"
  },
  {
    "text": "Wall Street Loves Trump Because LOL Nothing Matters  —  The S&P 500 will turn you into the Joker.  —  ∙ Paid  —  1. DGAF  —  One thesis is: If the economy sours, then voters will hold Trump/Republicans accountable for it.  —  Maybe this is correct, maybe it's not.  It's at least plausible.",
    "url": "https://www.thebulwark.com/p/wall-street-loves-trump-because-lol"
  },
  {
    "text": "Musk calls for ‘wave of judicial impeachments’  —  Tech billionaire Elon Musk on Wednesday called for judges to be impeached for checking the power of the Trump administration, as some of its efforts to overhaul the government get bogged down in legal fights.",
    "url": "https://thehill.com/homenews/administration/5140939-elon-musk-calls-judges-impeached/"
  },
  {
    "text": "Scoop: Dems “pissed” at liberal groups MoveOn, Indivisible … - “People are pissed,” a senior House Democrat who was at the meeting said of lawmakers' reaction to the calls.  — The Democrat said Jeffries himself is “very frustrated” at the groups, who are trying to stir up a more confrontational opposition to Trump.",
    "url": "https://www.axios.com/2025/02/12/democrats-jeffries-move-on-indivisible-trump"
  },
  {
    "text": "Cutting Cancer Research  —  Sometimes, it gets personal.  —  My daughter is finishing up a master's degree.  Her work is completely over my head, but it involves the intersection of nutrition, agriculture, and climate change. … In other words, she's doing important work, real work that could help make many lives better.",
    "url": "https://joycevance.substack.com/p/cutting-cancer-research"
  },
  {
    "text": "“The Fraudsters Complain the Loudest and the Fastest:” Legacy Media Ignores Import of Gaza Condom Fact Check  —  At a weird appearance in the Oval Office rife with awkward projections that Elon Musk believes he is more powerful than Trump (here's the full CSPAN video), a journalist asked Elon how … ",
    "url": "https://www.emptywheel.net/2025/02/12/the-fraudsters-complain-the-loudest-and-the-fastest-legacy-media-ignores-import-of-gaza-condom-fact-check/"
  },
  {
    "text": "Not Hyperbole Anymore: Musk Is In Charge of the US Government  —  These are wild times at TPM because they're wild times in the American government.  It's hard to keep up with everything happening from one moment to the next.  I had not had a chance to look at the new DOGE executive order President signed … ",
    "url": "https://talkingpointsmemo.com/edblog/not-hyperbole-anymore-musk-is-in-charge-of-the-us-government"
  },
  {
    "text": "Dozens of CFPB Workers Fired in After-Hours Blitz  —  Some affected employees of the Consumer Financial Protection Bureau were notified with an email that addressed them as [EmployeeFirstName][EmployeeLastName], [Job Title], [Division].  —  Dozens of Consumer Finance Protection Bureau employees … ",
    "url": "https://www.wired.com/story/dozens-of-cfpb-workers-terminated-in-after-hours-firing-blitz/"
  },
  {
    "text": "New Hampshire High School Trans Athletes Take Their Fight to Trump  —  A lawsuit appears to be the first challenge to the constitutionality of an executive order barring trans athletes from girls' and women's sports teams.  —  Two transgender public high school students in New Hampshire … ",
    "url": "https://www.nytimes.com/2025/02/12/us/trump-trans-girls-women-sports.html"
  },
  {
    "text": "Kremlin says unidentified Russian freed in US in exchange for Moscow's release of Marc Fogel  —  The Kremlin said Wednesday that a Russian citizen was freed in the United States in exchange for Moscow's release of American Marc Fogel, but refused to identify him until he arrives in Russia.",
    "url": "https://apnews.com/article/russia-us-marc-fogel-prisoner-swap-98418693957b1fa0189ee8ac4e8b4f2d"
  },
  {
    "text": "‘The case is over’: Adams' lawyer declares victory  —  Attorney Alex Spiro responded to critics who said the New York City mayor is beholden to Trump.  —  NEW YORK — Mayor Eric Adams' lawyer claimed Wednesday that the criminal case against the mayor “is over” and won't be picked up again … ",
    "url": "https://www.politico.com/news/2025/02/12/eric-adams-lawyer-victory-00203860"
  }
]