[
  {
    "text": "The Supreme Court Should Rule Swiftly on Trump's Immunity Claim  —  On Thursday, the U.S. Supreme Court will hear Donald Trump's arguments that he is immune from prosecution for his efforts to steal the 2020 presidential election.  It is likely that all — or nearly all … ",
    "url": "https://www.nytimes.com/2024/04/22/opinion/trump-immunity-supreme-court.html"
  },
  {
    "text": "What Donald Trump Fears Most  —  A potential reckoning that he has spent a lifetime eluding could be coming.  —  Donald Trump's biographers all seem to agree that he didn't get a lot of love from his father.  But what Fred Trump did impart to his son was an indelible lesson … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/donald-trump-manhattan-trial-fear/678144/"
  },
  {
    "text": "Opening statements to show the stark personal and political stakes of Trump's first criminal trial  —  Donald Trump was once, and may soon be again, the most powerful man in the world.  But on Monday, his diminished reality as a criminal defendant will become clear in humbling fashion during … ",
    "url": "https://www.cnn.com/2024/04/21/politics/trump-first-trial-opening-statements/"
  },
  {
    "text": "Columbia University faces full-blown crisis as rabbi calls for Jewish students to ‘return home’  —  Columbia University is facing a full-blown crisis heading into Passover as a rabbi linked to the Ivy League school urged Jewish students to stay home and tense confrontations on campus sparked condemnation … ",
    "url": "https://www.cnn.com/2024/04/21/us/columbia-university-jewish-students-protests/"
  },
  {
    "text": "Hakeem Jeffries emerges as Congress' shadow speaker … - Former House Speaker Nancy Pelosi (D-Calif.), a master legislative tactician, heaped praise on her successor: “He is fabulous. … - One senior House Democrat told Axios: “It easily could have fallen apart ... He played the cards the way you'd want to play them.”",
    "url": "https://www.axios.com/2024/04/21/hakeem-jeffries-speaker-mike-johnson-israel-ukraine"
  },
  {
    "text": "Republicans Are Suing for the Right To Harass Election Workers  —  You might think that even in today's highly polarized election environment there would be a bipartisan consensus to protect election workers from intimidation and harassment.  If you thought so, you would be wrong.",
    "url": "https://www.democracydocket.com/opinion/republicans-are-suing-for-the-right-to-harass-election-workers/"
  },
  {
    "text": "Biden Earth Day Event Will Try to Reach Young Voters, a Crucial Bloc  —  At a national park in Virginia on Monday, the president will point to investments in clean energy and appear with future members of his American Climate Corps.  —  President Biden will travel to a national park in Virginia on Monday … ",
    "url": "https://www.nytimes.com/2024/04/22/us/politics/biden-climate-young-voters.html"
  },
  {
    "text": "How Trump has become angrier and more isolated on Truth Social  —  For years, Donald Trump was among Twitter's loudest and most inescapable voices: a brash, bomb-throwing businessman turned president who could capture the global news cycle with a single tweet.",
    "url": "https://www.washingtonpost.com/politics/interactive/2024/trump-truth-social-posts/"
  },
  {
    "text": "House Republicans blame Greene and Freedom Caucus for lack of border wins … - GOP leadership brought up border security provisions alongside their foreign aid package — but the package was blocked by Republicans from reaching the House floor under normal rules.",
    "url": "https://www.axios.com/2024/04/22/house-republicans-greene-border-security-foreign-aid"
  },
  {
    "text": "Newsom proposes law to help Arizonans get abortions in California  —  California Gov. Gavin Newsom (D) said Sunday he would introduce legislation that would help Arizonans get abortions in his state, a move that comes after the Arizona Supreme Court this month ruled that a near-total abortion ban … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/21/gavin-newsom-abortion-arizona/"
  },
  {
    "text": "No Strange New Respect For Mike Johnson  —  At least not until he explains why he sacrificed thousands of lives, swaths of territory, and perhaps the future of Ukraine for nothing.  —  ∙ Paid  —  A weekend of important news has quickly overshadowed something striking that led up to it … ",
    "url": "https://www.offmessage.net/p/no-strange-new-respect-for-mike-johnson"
  },
  {
    "text": "Terry Anderson, AP reporter abducted in Lebanon and held captive for years, has died at 76  —  Terry Anderson, the globe-trotting Associated Press correspondent who became one of America's longest-held hostages after he was snatched from a street in war-torn Lebanon in 1985 and held for nearly seven years, has died at 76.",
    "url": "https://apnews.com/article/terry-anderson-dies-associated-press-c266353298c04dbf874ab4d94536f2b3"
  },
  {
    "text": "Trump's a Fraud When It Comes to Law and Order and ‘Backing the Blue’  —  FAKE JUSTICE  —  He pardoned crony crooks against DOJ's recommendations, and he's promised to let Jan. 6 insurrectionists—who brutally attacked cops—off the hook. … Donald Trump likes to project himself … ",
    "url": "https://www.thedailybeast.com/trumps-a-fraud-when-it-comes-to-law-and-order-and-backing-the-blue"
  },
  {
    "text": "Russian Who Bankrolled Trump's Truth Social Set Up Dodgy Sex Pill Sites  —  HARD TO SWALLOW  —  Russian banker—who reportedly has family links to the Kremlin—was key backer of Donald Trump's Truth Social.  But that wasn't his only controversial project.",
    "url": "https://www.thedailybeast.com/anton-postolnikov-russian-who-bankrolled-trumps-truth-social-set-up-dodgy-sex-pill-sites"
  },
  {
    "text": "RFK Jr. rarely mentions abortion — and sends mixed signals when he does  —  For many Americans, November's presidential election is about one issue: abortion.  President Biden hopes that a pro-abortion rights message will carry him to reelection, and Donald Trump regularly brags about his role … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/rfk-jr-abortion-mixed-signals/"
  },
  {
    "text": "Some Trump chats with foreign leaders annoy Biden's team … - Biden administration officials privately have questioned whether some of Trump's meetings were appropriate, even as President Biden has jumped at the chance to accuse Trump of aligning with far-righters, strongmen and dictators.",
    "url": "https://www.axios.com/2024/04/22/trump-meetings-foreign-leaders-biden"
  }
]