[
  {
    "text": "Trump praises fictional serial killer Hannibal Lecter during rally speech  —  Ex-president calls Hopkins' cannibalistic Lecter ‘late, great’ while condemning ‘people who are being released into our country’  —  Donald Trump on Saturday praised fictional serial killer Hannibal Lecter … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/12/trump-rally-speech-hannibal-lecter"
  },
  {
    "text": "Trump insults prosecutor at Jersey Shore rally filled with vulgar jabs  —  The presumptive Republican nominee spoke at a large rally where there were plenty of personal attacks and vulgar expressions from Trump and his supporters.  —  WILDWOOD, N.J. — Donald Trump on Saturday insulted … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/11/trump-bragg-trial-insults-rally-vulgar/"
  },
  {
    "text": "Trump, escalating attacks at rally, says Biden is ‘surrounded by fascists’  —  He's still under threat of jailtime if he violates a gag order.  —  After spending the week sitting in silence as a parade of witnesses — from porn star Stormy Daniels to a former White House aide … ",
    "url": "https://www.politico.com/news/2024/05/11/trump-rally-new-jersey-trial-fascists-00157482"
  },
  {
    "text": "A wargame simulated a 2nd Trump presidency.  It concluded NATO would collapse.  — Trump has threatened to quit NATO.  A wargame examined the possible ramifications.  — The US player abandoned Ukraine and ceased NATO participation, triggering crisis in Europe.",
    "url": "https://www.businessinsider.com/a-wargame-simulated-a-2nd-trump-presidency-it-found-nato-would-collapse-2024-5"
  },
  {
    "text": "Kristi Noem Banned From Tribal Lands By a SIXTH Sioux Tribe  —  SEE YA!  —  Days after the Sisseton-Wahpeton Oyate banned South Dakota Gov. Kristi Noem from setting foot on tribal land, a sixth Sioux tribe joined in the banishment of the Trump-loving, puppy-killing Republican.",
    "url": "https://www.thedailybeast.com/kristi-noem-banned-from-tribal-lands-by-a-sixth-sioux-tribe"
  },
  {
    "text": "Trump appointee blasts Fifth Circuit over “landmines” in its recent decisions  —  In a case that has already ping-ponged around the federal court system, U.S. District Judge Mark Pittman on Friday granted the U.S. Chamber of Commerce's request to block the Consumer Financial Protection Bureau's … ",
    "url": "https://www.lawdork.com/p/trump-appointee-pittman-blasts-fifth-circuit"
  },
  {
    "text": "Sen. Lindsey Graham Suggests Nuking Gaza, Calls Hiroshima ‘the Right Decision’  —  GOING ATOMIC  —  Graham argued Israel would be justified in obliterating Gaza because America did it to Japan 80 years ago.  —  Sen. Lindsey Graham (R-SC) offered a baffling comparison of Israel's war on Gaza … ",
    "url": "https://www.thedailybeast.com/sen-lindsey-graham-suggests-nuking-gaza-calls-hiroshima-the-right-decision/"
  },
  {
    "text": "Another Maggie Haberman NYT Story Covers Up Oleg Deripaska's Role  —  The reason it matters that Trump brought in Paul Manafort to work on his campaign again for “free” this year is that in 2016, Manafort shared the campaign's strategy with his long-time business associate Konstantin Kilimnik … ",
    "url": "https://www.emptywheel.net/2024/05/12/another-maggie-haberman-nyt-story-covers-up-oleg-deripaskas-role/"
  },
  {
    "text": "More US parents than ever have paid leave this Mother's Day - but most still don't  —  More working U.S. parents than ever are celebrating their first Mother's Day with hard-fought access to paid time off to care for newborns.  But the majority still must forego pay to care for new babies … ",
    "url": "https://apnews.com/article/paid-family-leave-maternity-22aaac545f83b95842316a3029f3bb40"
  },
  {
    "text": "Biden taps Obama, George Clooney, Julia Roberts and the Clintons for mega fundraisers  —  One high-profile event will feature a contest with Clooney and Roberts on social media platforms to engage grassroots donors, according to details first shared with NBC News.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-taps-obama-george-clooney-julia-roberts-clintons-mega-fundraiser-rcna151183"
  },
  {
    "text": "Biden calls Trump ‘unhinged’ and says ‘something snapped’ in former president after he lost 2020 election  —  President Joe Biden on Saturday called Donald Trump “clearly unhinged” and claimed that “something snapped” in the former president after he lost the 2020 election.",
    "url": "https://www.cnn.com/2024/05/11/politics/biden-trump-unhinged-seattle/"
  },
  {
    "text": "Stubbornly High Rents Prevent Fed From Finishing Inflation Fight  —  For more than a year, the central bank has expected slowing rent increases to show up in official housing measures  —  Stalled inflation this year hasn't derailed the Federal Reserve's plans to eventually cut interest rates.",
    "url": "https://www.wsj.com/economy/housing/fed-inflation-rate-housing-rentals-2f28c5ba"
  },
  {
    "text": "Michael Cohen: A challenging star witness in Donald Trump's hush money trial  —  NEW YORK (AP) — He once said he would take a bullet for Donald Trump.  Now Michael Cohen is prosecutors' biggest piece of legal ammunition in the former president's hush money trial.",
    "url": "https://apnews.com/article/trump-hush-money-trial-michael-cohen-witness-091b0e50af2738eb261f395e9d658505"
  },
  {
    "text": "He's Running for Senate With an Immigrant's Origin Story.  Here's the Rest.  —  Bernie Moreno, the Republican challenging Senator Sherrod Brown in Ohio, tells a riches-to-rags-to-riches tale.  But the reality isn't so tidy.  —  He is running for the Senate as an immigrant who made good … ",
    "url": "https://www.nytimes.com/2024/05/12/us/politics/bernie-moreno-ohio.html"
  }
]