[
  {
    "text": "Trump says Mexico's president has ‘agreed to stop’ migrants crossing into US through her country: ‘Very productive conversation!’  —  President-elect Donald Trump said Wednesday that he has received assurances from Mexico's new president that she will “stop migration” though her country and into the US … ",
    "url": "https://nypost.com/2024/11/27/us-news/trump-says-mexicos-president-has-agreed-to-stop-migrants-from-crossing-the-us-border-illegally/"
  },
  {
    "text": "Canada is already examining tariffs on certain US items following Trump's tariff threat  —  Canada is already examining possible retaliatory tariffs on certain items from the United States should President-elect Donald Trump follow through on his threat to impose sweeping tariffs on Canadian products, a senior official said Wednesday.",
    "url": "https://apnews.com/article/canada-trump-tariffs-trudeau-c741393c2f7c7545e9714839cfbbda45"
  },
  {
    "text": "Zuckerberg dines with Trump in Mar-a-Lago  —  Donald Trump dined on Wednesday with Meta CEO Mark Zuckerberg at the president-elect's Mar-a-Lago club in Florida, bringing together the Facebook founder and the former president who was once banned from that social network.",
    "url": "https://apnews.com/article/facebook-trump-zuckerberg-meta-03b409b31deb17ecf3c6d8913e999550"
  },
  {
    "text": "Mark Zuckerberg joined Trump for a Thanksgiving Eve dinner at Mar-a-Lago  — Mark Zuckerberg met with President-elect Donald Trump at Mar-a-Lago in Florida.  — Trump and Zuckerberg, who did not endorse a candidate for president, have had a rocky relationship.",
    "url": "https://www.businessinsider.com/mark-zuckerberg-met-with-trump-mar-a-lago-report-2024-11"
  },
  {
    "text": "Mark Zuckerberg Meets With Trump at Mar-a-Lago  —  The president-elect has long been critical of Mr. Zuckerberg's social media platforms, saying they censor conservative viewpoints.  —  Mark Zuckerberg met on Wednesday with President-elect Donald J. Trump in a rare face-to-face encounter … ",
    "url": "https://www.nytimes.com/2024/11/27/us/politics/mark-zuckerberg-trump-meeting.html?unlocked_article_code=1.dU4.6CxQ.XfeD1FE5x3uj"
  },
  {
    "text": "RFK Jr. attacked the CDC's ‘fascism’ and likened vaccinating children to abuse by the Catholic Church  —  Robert F. Kennedy Jr., Donald Trump's pick for Health and Human Services secretary, also argued for jailing vaccine scientists in previously unreported comments at autism conferences.",
    "url": "https://www.nbcnews.com/health/health-news/rfk-jr-vaccines-cdc-fascism-abuse-catholic-church-autism-conferences-rcna181605"
  },
  {
    "text": "Republicans Built an Ecosystem of Influencers.  Some Democrats Want One, Too.  —  Democrats were badly outflanked online in the election, and progressive influencers are now trying to create networks to be a left-wing answer to Turning Point USA.  —  Zackory Kirk, an influencer based … ",
    "url": "https://www.nytimes.com/2024/11/28/us/politics/democratic-influencers.html?unlocked_article_code=1.dU4.Mzxw.RGxGXv_8LVWR&smid=url-share"
  },
  {
    "text": "November 27, 2024  —  Thanksgiving is the quintessential American holiday...but not for the reasons we generally remember.  —  The Pilgrims and the Wampanoags did indeed share a harvest celebration together at Plymouth in fall 1621, but that moment got forgotten almost immediately … ",
    "url": "https://heathercoxrichardson.substack.com/p/november-27-2024"
  },
  {
    "text": "Musk accuses Trump whistleblower Vindman of ‘treason,’ says ‘he will pay’  —  Elon Musk on Wednesday suggested retired Army Lt. Col Alexander Vindman “committed treason” and “will pay” after the former Trump impeachment witness accused the tech billionaire and close Trump ally of being unwittingly used by Russia.",
    "url": "https://thehill.com/policy/technology/5012743-musk-accuses-trump-whistleblower-vindman-of-treason-says-he-will-pay/"
  },
  {
    "text": "The Perception Gap That Explains American Politics  —  In the aftermath of the 2024 presidential election, some commentators have argued that Americans don't believe that the Democratic Party shares their political priorities.  According to a large survey we conducted immediately after the election, these critics are onto something.",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/democrats-defined-progressive-issues/680810/?gift=I7tMEMRUhGy0dyKdoKBoOqkV0QvDIInIcfpXFsQqi_E&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Election Day was nearly one month ago.  Harris is still asking for cash  —  Vice President Kamala Harris's presidential campaign is still sending multiple emails per day pleading with supporters for funds, more than three weeks after Election Day.  —  The emails, the most recent being from Tuesday night … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3244107/kamala-harris-asking-for-money-weeks-after-election-day/"
  },
  {
    "text": "Trump turns to outsider to shake up Navy, but his lack of military experience raises concerns  —  President-elect Donald Trump's nominee to be secretary of the Navy, John Phelan, has not served in the military or had a civilian leadership role in the service.",
    "url": "https://apnews.com/article/trump-navy-secretary-nominee-phelan-3b36a03a837684370f494a116cea183c"
  },
  {
    "text": "Conservative US influencer Candace Owens is barred from New Zealand weeks after a ban from Australia  —  The U.S. conservative political commentor Candace Owens was refused a visa to enter New Zealand for a speaking engagement because she had been banned from another country, immigration officials said Thursday.",
    "url": "https://apnews.com/article/candace-owens-zealand-australia-visa-eedd9b2f77a289b44a517719008f9730"
  },
  {
    "text": "Crypto leaders press Trump to create federal bitcoin reserve  —  The president-elect has previously expressed support for the idea, which some economists say could be inflationary and costly.  —  Top cryptocurrency executives and investors are pushing President-elect Donald Trump to create … ",
    "url": "https://www.washingtonpost.com/business/2024/11/27/trump-strategic-bitcoin-reserve-plan/"
  },
  {
    "text": "Biden to Leave Trump With Billions for Ukraine Weapons  —  The U.S. won't be able to spend all of the money authorized to transfer arms to Kyiv by Jan. 20, U.S. officials acknowledge  —  The Biden administration doesn't have enough time left to use the billions of dollars lawmakers … ",
    "url": "https://www.wsj.com/politics/national-security/biden-to-leave-trump-with-billions-for-ukraine-weapons-0594bf32"
  },
  {
    "text": "‘Delete CFPB’: Musk calls for elimination of consumer bureau  —  Elon Musk said Wednesday that the Consumer Financial Protection Bureau should be abolished, calling for the elimination of an agency that would potentially regulate the future payments business of the Musk-owned X platform.",
    "url": "https://www.politico.com/live-updates/2024/11/27/congress/delete-cfpb-musk-calls-for-elimination-of-consumer-bureau-00191994"
  },
  {
    "text": "Gavin Newsom grants pardon to famed podcaster, former San Quentin inmate  —  Earlonne Woods of “Ear Hustle” received a full pardon from the California governor.  —  California Gov. Gavin Newsom granted 19 Thanksgiving eve pardons, including one to a Pulitzer Prize finalist who produced the popular … ",
    "url": "https://www.politico.com/news/2024/11/27/gavin-newsom-san-quentin-california-00192012"
  },
  {
    "text": "Homan taking death threats against him ‘more seriously’ after Trump officials targeted with violent threats  —  Incoming Trump border czar Tom Homan reacted to news of death threats against Trump nominees on Wednesday and said he now takes the death threats he has previously received seriously.",
    "url": "https://www.foxnews.com/politics/homan-taking-death-threats-against-him-more-seriously-after-trump-officials-targeted-with-violent-threats"
  }
]