[
  {
    "text": "Chief Financial Officer Of Multinational Media Company Charged With Participating In Scheme To Launder At Least $67 Million In Fraud Proceeds  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Damian Williams, the United States Attorney for the Southern District … ",
    "url": "https://www.justice.gov/usao-sdny/pr/chief-financial-officer-multinational-media-company-charged-participating-scheme"
  },
  {
    "text": "DOJ Says Epoch Times Newspaper Is an Epic Money-Laundering Operation  —  One of the strangest stories in media over the past decade is the Epoch Times, a formerly free newspaper distributed on the streets of New York that focuses on conspiracist, right-wing takes and reports that are extremely critical of the Chinese Communist Party.",
    "url": "https://nymag.com/intelligencer/article/doj-says-epoch-times-is-an-epic-money-laundering-operation.html"
  },
  {
    "text": "Feds Indict Far-Right Media Exec in Massive Money Laundering Scheme  —  Bill Guan, the chief financial officer of the far-right Epoch Times, was indicted Monday on charges of allegedly participating in a massive money laundering scheme.  —  The Southern District of New York released a statement saying … ",
    "url": "https://www.mediaite.com/news/just-in-feds-indict-far-right-media-exec-in-massive-money-laundering-scheme/"
  },
  {
    "text": "Feds Accuse Far-Right Newspaper of Being a Money Laundering Operation  —  $67 MILLION!  —  The indictment alleges the conspiracy-fueled paper's massive revenue growth in recent years was tied to the chief financial officer's fraudulent “Make Money Online” team.",
    "url": "https://www.thedailybeast.com/feds-accuse-far-right-newspaper-epoch-times-of-being-a-money-laundering-operation"
  },
  {
    "text": "Don't let MAGA theatrics fool you: Donald Trump's 34 felony convictions are not helping him  —  Many people mistake cynicism for savviness.  So, of course, it took no time at all for some political pundits to rush forward to declare that Donald Trump's historic 34 felony convictions would somehow “help” him.",
    "url": "https://www.salon.com/2024/06/04/dont-let-maga-theatrics-fool-you-donald-34-felony-convictions-are-not-helping-him/"
  },
  {
    "text": "Biden calls Trump a ‘convicted felon’ who ‘snapped’ after the 2020 election  —  The president also called Trump, who was found guilty last week in his New York criminal trial, “unhinged.”  —  President Joe Biden called former President Donald Trump a “convicted felon” who “snapped” … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-trump-convicted-felon-snapped-rcna155327"
  },
  {
    "text": "Congress braces for “large” boycott, disruptions of Netanyahu speech … - Netanyahu's 2015 speech to Congress, which was a major snub of the Obama administration, was skipped by 58 Democratic lawmakers.  — Many Democrats this year argued against inviting Netanyahu in the first place … ",
    "url": "https://www.axios.com/2024/06/04/democrats-boycott-benjamin-netanyahu-speech-congress"
  },
  {
    "text": "How politics, timing shaped Biden's border gambit … - He's also using the power of the presidency to stare down his critics in Congress, confident that voters want to see action — not just rhetoric — on the border.  — Biden's willing to risk a defeat in the courts and anger … ",
    "url": "https://www.axios.com/2024/06/04/biden-border-gambit-trump-2024-election"
  },
  {
    "text": "Read the Full Transcript of President Joe Biden's Interview With TIME  —  President Joe Biden sat down for an interview with TIME at the White House on May 28.  —  Over the course of the interview, Biden spoke at length about his foreign policy agenda, including his views on China, Taiwan … ",
    "url": "https://time.com/6984968/joe-biden-transcript-2024-interview/"
  },
  {
    "text": "Fraud trial juror reports getting bag of $120,000 and promise of more if she'll acquit  —  A juror was dismissed Monday after reporting that a woman dropped a bag of $120,000 in cash at her home and offered her more money if she would vote to acquit seven people charged with stealing … ",
    "url": "https://apnews.com/article/minnesota-feeding-our-future-pandemic-fraud-73610b59bb60bf33f2aa06063bb592d2"
  },
  {
    "text": "‘I will not be intimidated’: Garland to rebut contempt threats from House GOP  —  House Republicans are expected to grill the attorney general about the federal prosecutions of Donald Trump and Hunter Biden.  —  Attorney General Merrick Garland will use an appearance on Capitol Hill on Tuesday … ",
    "url": "https://www.washingtonpost.com/national-security/2024/06/04/merrick-garland-testimony-judiciary-fbi-trump/"
  },
  {
    "text": "Big Media Ignoring the Who What When Why of GOP Apology for Trump's Crimes  —  Even before and especially in the wake of Trump's guilty verdict, members of the MAGAt Party has stumbled over themselves to declare fealty to Donald Trump, and in the process to demean rule of law.  —  Video",
    "url": "https://www.emptywheel.net/2024/06/03/big-media-ignoring-the-who-what-when-why-of-gop-apology-for-trumps-crimes/"
  },
  {
    "text": "Trump's appeal hearing on Fani Willis set for October, likely pushing trial past election  —  Trump is appealing the ruling that led DA Fani Willis stay on his election case.  —  Former President Donald Trump attends UFC 302 at Prudential Center on June 1, 2024, in Newark, N.J.",
    "url": "https://abcnews.go.com/Politics/georgia-court-tentatively-sets-donald-trumps-appeal-hearing/story?id=110788890"
  },
  {
    "text": "Biden's fight against monopolies is a fight for democracy  —  Antitrust enforcement matters.  —  ∙ Paid … In 2022, Penny Harrison spent nine hours online with Live Nation/Ticketmaster trying to get tickets for the Taylor Swift Eras tour for her three children.",
    "url": "https://www.publicnotice.co/p/biden-antitrust-live-nation-google-explained"
  },
  {
    "text": "Feds raid corporate landlord, escalating nationwide criminal probe of rent increases  —  Over the last four years, rents have skyrocketed by an average of over 30% nationwide and are a major factor in the overall inflation rate.  There are a variety of factors behind the increases, including an overall housing shortage.",
    "url": "https://popular.info/p/feds-raid-corporate-landlord-escalating"
  },
  {
    "text": "How a Drop in Small-Dollar Donations Is Shaking Up Both Parties … For years, Anna Cypert responded to the daily texts, calls and letters that she received from Democrats asking for money, often marked URGENT or SOS.  The former nurse sent what she could: $5 to the Democratic Congressional Campaign Committee … ",
    "url": "https://www.notus.org/2024-election/small-dollar-donations"
  },
  {
    "text": "‘So totally sketchy’: New report on Trump criminal case witnesses stuns legal experts  —  It isn't unusual for an expert witness to be paid for testimony, but a new report that former President Donald Trump's media company and campaign have delivered major financial benefits to nine witnesses in his criminal trials is raising concerns.",
    "url": "https://www.rawstory.com/trump-payoffs-propublica-analysts/"
  },
  {
    "text": "New York Tosses Stefanik's Trump Court Complaint in Bank Fraud Civil Suit  —  N.Y. CONFIDENTIAL  —  Stefanik supported the former president by complaining about a judge and his clerk in Trump's bank fraud civil suit.  The Daily Beast can reveal it was rejected as groundless.",
    "url": "https://www.thedailybeast.com/new-york-tosses-rep-stefaniks-trump-court-complaint-in-bank-fraud-civil-suit"
  },
  {
    "text": "Russia Gave Millions to Far-Right Politicians Via Fake News Site: Report  —  ‘VOICE OF EUROPE’  —  Russia gave European far-right politicians large amounts of cash through a propaganda operation intended to sow division on the continent, according to a report.",
    "url": "https://www.thedailybeast.com/russia-gave-millions-to-politicians-via-fake-news-site-voice-of-europe"
  },
  {
    "text": "Menendez files independent bid for Senate seat  —  Sen. Bob Menendez (D-N.J.) filed to run for another term in the Senate as an independent on Monday, as his federal bribery trial continues.  Menendez had announced in March that he would not seek the Democratic nomination for his Senate seat … ",
    "url": "https://thehill.com/homenews/campaign/4701281-bob-menendez-senate-files-independent-bid/"
  }
]