[
  {
    "text": "Johnson: Second Trump term would be like first ‘on turbo’  —  In a recent interview with New Yorker Magazine, Speaker Mike Johnson (R-La.) argued that if former President Trump were reelected, his second term would be much like his first, except it'd be “on turbo.”",
    "url": "https://thehill.com/homenews/campaign/4536657-johnson-second-trump-term-would-be-like-first-on-turbo/"
  },
  {
    "text": "Trump and Biden's key campaign stances in sequel election … Abortion and reproductive rights  —  Trump has repeatedly boasted about appointing the conservative Supreme Court justices who overturned Roe v. Wade, making abortion a state-level policy.  — But since the Dobbs decision … ",
    "url": "https://www.axios.com/2024/03/16/trump-biden-2024-presidential-election"
  },
  {
    "text": "How Trump Is Scrambling to Raise Cash  —  The former president is facing converging financial crunches as he and the Republican Party confront a shortfall against President Biden and the Democrats.  —  As many as three nights a week, Donald J. Trump has been hosting private dinners at Mar-a-Lago … ",
    "url": "https://www.nytimes.com/2024/03/16/us/politics/trump-finances-money-fundraising.html"
  },
  {
    "text": "Police: Suspect is barricaded in New Jersey home after killing 3 people in Philadelphia suburb  —  A suspect has barricaded himself in a home in New Jersey after allegedly killing three people in a shooting in suburban Philadelphia on Saturday, authorities said.",
    "url": "https://apnews.com/article/pennsylvania-shootings-falls-township-fb5a52ecf043dc82556ae0d0286007b1"
  },
  {
    "text": "Residents in suburban Philadelphia township told to shelter in place after ‘confirmed shootings’  —  The suspected shooter, Andre Gordon, knew the three people killed, police said.  —  Three people were killed in multiple shootings Saturday morning outside of Philadelphia, police said, and a search for the suspect continues.",
    "url": "https://www.nbcnews.com/news/us-news/residents-suburban-philadelphia-township-told-shelter-place-confirmed-rcna143721"
  },
  {
    "text": "GOP Base Has Shriveled Compared to Last Presidential Election  —  The number of people who describe themselves as Republican has slightly declined since the last presidential election.  —  The polling firm Gallup, which tracks party affiliation monthly, says that those identifying as Republicans … ",
    "url": "https://www.newsweek.com/republican-party-affiliation-voters-presidential-election-1879653"
  },
  {
    "text": "Exclusive: Musk's SpaceX is building spy satellite network for US intelligence agency, sources say  —  SpaceX is building a network of hundreds of spy satellites under a classified contract with a U.S. intelligence agency, five sources familiar with the program said, demonstrating deepening … ",
    "url": "https://www.reuters.com/technology/space/musks-spacex-is-building-spy-satellite-network-us-intelligence-agency-sources-2024-03-16/"
  },
  {
    "text": "Creditors demand Rudy Giuliani sell his $3.5 million Florida condo to pay debts  — Creditors want to force Rudy Giuliani to sell his $3.5 million Florida condo to help pay off his nearly $152 million in debt.  — Giuliani has argued that he does not have the funds to pay his debts … ",
    "url": "https://www.cnbc.com/2024/03/16/rudy-giuliani-should-sell-3point5-million-florida-condo-creditors-claim.html"
  },
  {
    "text": "‘Democracy is teetering’: at ground zero for Trump's big lie in Arizona  —  The state Republican party is undaunted by electoral defeats for those claiming voting is rigged - and election officials are bearing the brunt of their fury  —  On a glorious spring day in Phoenix … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/16/arizona-election-denial-consequences"
  },
  {
    "text": "‘A Very Good Day for Donald Trump’: Toobin Says Fani Willis' Case ‘Is Going Nowhere’  —  Jeffrey Toobin offered a bleak assessment for those hoping to see former President Donald Trump face trial in Georgia sooner rather than later.  —  Fulton County District Attorney Fani Willis charged Trump … ",
    "url": "https://www.mediaite.com/crime/a-very-good-day-for-donald-trump-toobin-says-fani-willis-case-is-going-nowhere/"
  },
  {
    "text": "Niger revokes military accord with US, junta spokesperson says  —  Niger's ruling military junta has revoked with immediate effect a military accord that allows military personnel and civilian staff from the U.S. Department of Defense on its soil, junta spokesperson Colonel Amadou Abdramane said on Saturday.",
    "url": "https://www.reuters.com/world/africa/niger-revokes-military-accord-with-us-junta-spokesperson-says-2024-03-16/"
  },
  {
    "text": "Share of Democratic Registrations Is Declining, but What Does It Mean?  —  Virtually every group of voters under 70 has become less likely to register as Democrats compared with Republicans since 2019.  —  Newly registered voters, who are disproportionately young and nonwhite, have tended to lean Democratic.",
    "url": "https://www.nytimes.com/2024/03/16/upshot/democrats-voter-registration-decline.html"
  },
  {
    "text": "Biden's populist budget marks the overdue end of trickle-down economics  —  A president's budget proposal is seldom passed into law.  Instead, it's an expression of the priorities the president promises to fight for, often coming on the heels of an agenda laid out in the State of the Union address.",
    "url": "https://thehill.com/opinion/finance/4534670-bidens-populist-budget-marks-the-overdue-end-of-trickle-down-economics/"
  },
  {
    "text": "New Welsh leader ‘honored’ to be Europe's first Black national leader  —  Vaughan Gething, son of a Welsh father and Zambian mother, said he is honored to be “the first black leader in any European country.”  —  Vaughan Gething won the Welsh Labour Party leadership contest on Saturday … ",
    "url": "https://www.nbcnews.com/news/world/new-welsh-leader-honored-europes-first-black-national-leader-rcna143711"
  }
]