[
  {
    "text": "This company rates news sites' credibility.  The right wants it stopped.  —  NewsGuard, which prizes its nonpartisan criteria, has become a prime target of the GOP's battle against disinformation watchdogs.  —  When veteran newsmen L. Gordon Crovitz and Steven Brill started their news site rating company … ",
    "url": "https://www.washingtonpost.com/technology/2024/12/24/newsguard-disinformation-censorship-free-speech/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM1MDE2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM2Mzk4Nzk5LCJpYXQiOjE3MzUwMTY0MDAsImp0aSI6ImU5YWU0ZjliLTIxZTEtNDFhOC05MThiLTEyYzIyYTdmYmJiMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMTIvMjQvbmV3c2d1YXJkLWRpc2luZm9ybWF0aW9uLWNlbnNvcnNoaXAtZnJlZS1zcGVlY2gvIn0.Pwk1yuvH4hX7NomeWIZX_OvsbEXExJze-89p36vVGwI&itid=gfta"
  },
  {
    "text": "It's official: Biden signs new law, designates bald eagle as ‘national bird’  —  Bald eagle officially named U.S. national bird  —  The White House announced on Christmas Eve President Joe Biden signed a bill officially designating the bald eagle as the national bird.",
    "url": "https://www.foxnews.com/politics/its-official-biden-signs-new-law-designates-bald-eagle-national-bird"
  },
  {
    "text": "Republicans Fear Speaker Battle Means They 'Can't Certify the Election'  —  What's New  —  to publicly reaffirm support for him to avoid a lengthy battle to replace him that could delay the certification of Trump's election victory in January.  —  Newsweek has contacted spokespeople … ",
    "url": "https://www.newsweek.com/republicans-fear-speaker-battle-cant-certify-election-2005510"
  },
  {
    "text": "Sen. Kyrsten Sinema's recent lavish travel expenses broke the law, watchdog group alleges  —  A government watchdog group has filed a complaint against Sen. Kyrsten Sinema, alleging that her recent pricey travel expenditures broke campaign-finance laws.  —  The nonprofit Citizens … ",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/12/24/kyrsten-sinemas-illegal-travel-spending-allegations/77180639007/"
  },
  {
    "text": "Kyrsten Sinema may have broken the law on the way out the door: watchdog group  —  Outgoing Sen. Kyrsten Sinema (I-AZ) has just over a week left before she'll be replaced by Rep. Ruben Gallego (D-AZ), but a government watchdog group alleges that she broke a key law on her way out the door.",
    "url": "https://www.rawstory.com/kyrsten-sinema-2670671944/"
  },
  {
    "text": "Denmark boosts Greenland defence after Trump repeats desire for US control  —  The Danish government has announced a huge boost in defence spending for Greenland, hours after US President-elect Donald Trump repeated his desire to purchase the Arctic territory.",
    "url": "https://www.bbc.com/news/articles/ckgzl19n9eko"
  },
  {
    "text": "Elon Musk Takes Aim at Wikipedia  —  What's New  —  Elon Musk has urged his followers not to donate to Wikipedia, which he branded “Wokepedia,” until “they restore balance to their editing authority.”  —  The tech billionaire made the claim on X,  —  , in response to another user … ",
    "url": "https://www.newsweek.com/elon-musk-takes-aim-wikipedia-fund-raising-editing-political-woke-2005742"
  },
  {
    "text": "Texas Sovereignty Act would allow Texas to declare federal actions unconstitutional  —  TYLER, Texas (KLTV) - Senator Bob Hall of Canton has introduced Senate Bill 80, allowing Texas to declare federal actions unconstitutional.  —  Senator Hall has dubbed it the Texas Sovereignty Act.",
    "url": "https://www.kltv.com/2024/12/24/texas-sovereignty-act-would-allow-texas-declare-federal-actions-unconstitutional/"
  },
  {
    "text": "The Walmart Effect  —  New research suggests that the company makes the communities it operates in poorer—even taking into account its famous low prices.  —  No corporation looms as large over the American economy as Walmart.  It is both the country's biggest private employer … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/12/walmart-prices-poverty-economy/681122/"
  },
  {
    "text": "For some Latinos, ‘prosperity gospel’ led them to Trump  —  The set of beliefs has overtaken traditional theologies centered on the poor.  Some experts say that helps explain a shift among Latino Christians to Trump.  —  ALLENTOWN, Pa. — The Lehigh Valley Barbershop was bustling with the next generation of American strivers.",
    "url": "https://www.washingtonpost.com/nation/2024/12/24/trump-latino-voters-prosperity-gospel-pennsylvania/"
  },
  {
    "text": "Major international crisis ‘much more likely’ in Trump's second term, says his ex-national security adviser  —  John Bolton delivers scathing critique of Trump's lack of knowledge or coherent strategy: 'I'm very worried'  —  A major international crisis is “much more likely” … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/24/donald-trump-john-bolton-crisis-likely"
  },
  {
    "text": "Rep. Granger's Hill absence, revelation of ‘dementia issues’ reignite age debate  —  The 81-year-old congresswoman's situation reanimated a simmering discussion over the health and mental acuity of aging elected officials, with several of Granger's colleagues calling for changes and raising worries about the nation's oldest leaders.",
    "url": "https://www.washingtonpost.com/politics/2024/12/24/kay-granger-texas-congresswoman-age-facility/"
  },
  {
    "text": "Trump and Musk Want to Cut Billions From the Budget.  It Won't Be Easy.  —  Efforts to cut government spending and eliminate waste are dwarfed by the rising costs of the social safety net programs and interest expenses.  —  When Elon Musk and Vivek Ramaswamy, the businessmen … ",
    "url": "https://www.nytimes.com/2024/12/24/business/trump-musk-ramaswamy-doge-government-spending.html"
  },
  {
    "text": "Letter urging residents to report ‘brown folks’ condemned by Oregon officials  —  Oregon officials called the anonymous letter “racist.”  —  Oregon state flag waving in the wind.  —  Several officials in Lincoln County, Oregon have received an anonymous letter urging people to report … ",
    "url": "https://abcnews.go.com/US/letter-urging-residents-report-brown-folks-condemned-oregon/story?id=117082954"
  },
  {
    "text": "Second US Navy fighter jet narrowly avoided being shot down in ‘friendly fire’ incident: source  —  A second SM-2 missile was fired from USS Gettysburg, Navy official confirms  —  EXCLUSIVE: On the same night a U.S. Navy fighter jet was shot down over the Red Sea, a second jet nearly suffered the same fate.",
    "url": "https://www.foxnews.com/us/second-us-navy-fighter-jet-narrowly-avoided-being-shot-down-friendly-fire-incident-source"
  },
  {
    "text": "Elon Musk wants to ‘delete’ many Americans' financial lifeline  —  Nearly every exit poll conducted on Election Day found that, more than any other issues, voters' concerns about the economy helped to return Donald Trump to the White House and put Republicans back in charge of both houses of Congress.",
    "url": "https://thehill.com/opinion/white-house/5054026-cfpb-elon-musk-doge/"
  },
  {
    "text": "We were warned: First term aides told us about Trump's governing style  —  Nearly eight years ago, reports began circulating in Washington that the Trump administration was going to be chaotic.  One obvious sign was the rapid turnover of aides close to the president.",
    "url": "https://thehill.com/opinion/5054802-trump-administration-chaos/"
  }
]