[
  {
    "text": "Scoop: Former GOP Rep. Charlie Dent voted for Kamala Harris … - Some are going as far as to actively campaign for Harris, with former Reps. Adam Kinzinger (R-Ill.) and Barbara Comstock (R-Va.) appearing with the vice president at a rally in the key battleground of Pennsylvania on Wednesday.",
    "url": "https://www.axios.com/2024/10/17/charlie-dent-2024-republicans-trump-harris"
  },
  {
    "text": "Playbook: Trump's media backout  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  A ONE-TWO PUNCH — With 18 days left until Election Day, VP KAMALA HARRIS will be hitting the road with the two most popular members of her party: BARACK and MICHELLE OBAMA.",
    "url": "https://www.politico.com/newsletters/playbook/2024/10/18/trumps-media-backout-00184324"
  },
  {
    "text": "Trump World in Talks With Haley for Eleventh-Hour Joint Campaign Event  —  DONALD TRUMP'S ONETIME U.N. ambassador and former primary rival, Nikki Haley, is in talks to join him on the campaign trail in an attempt to win over disaffected Republicans, sources familiar with the discussions tell The Bulwark.",
    "url": "https://www.thebulwark.com/p/trump-world-in-talks-with-haley-for"
  },
  {
    "text": "Trump delivers profanity, below-the-belt digs at Catholic charity banquet  —  The only person off limits for Trump's roast was himself.  —  NEW YORK — Republican presidential nominee Donald Trump used his remarks at a Catholic charity banquet here on Thursday to skewer prominent Democrats, often in off-color terms.",
    "url": "https://www.washingtonpost.com/politics/2024/10/17/trump-harris-al-smith-dinner/"
  },
  {
    "text": "Critics Slam Al Smith Charity Dinner For Normalizing ‘Deranged Madman’ Donald Trump  —  Critics didn't find the former president's attendance at the white-tie event funny, with emcee Jim Gaffigan drawing ire too.  —  LOADING  —  Critics condemned the appearance of Donald Trump … ",
    "url": "https://www.huffpost.com/entry/donald-trump-al-smith-dinner-slammed_n_6711fdc4e4b069ea0f05fe71"
  },
  {
    "text": "Even Fox News's Bret Baier Admits Harris Outsmarted Him in Interview  —  Fox News's Brett Baier went on the offensive during an interview with Kamala Harris Wednesday night, but even he had to admit she got the best of him.  —  In a segment reacting to his own contentious interview … ",
    "url": "https://newrepublic.com/post/187245/kamala-harris-fox-news-bret-baier-roasted-interview"
  },
  {
    "text": "Fox News anchor Bret Baier admits Kamala Harris did damage to Trump: ‘She was on a mission’  —  Fox News anchor Bret Baier is taking criticism from all sides:  — Donald Trump supporters are screaming that that the anchor from the Trump-friendly cable giant wasn't tough enough … ",
    "url": "https://www.nj.com/politics/2024/10/fox-news-anchor-bret-baier-admits-kamala-harris-did-damage-to-trump-she-was-on-a-mission.html"
  },
  {
    "text": "Harris: Israeli killing of Sinwar an opportunity to end war in Gaza  —  Vice President Harris on Thursday praised Israel's killing of Hamas leader Yahya Sinwar, calling for it to be an opportunity for the Israel-Hamas war in Gaza to end after more than a year of fighting in the Middle East.",
    "url": "https://thehill.com/homenews/campaign/4939308-harris-israeli-killing-of-sinwar-an-opportunity-to-end-war-in-gaza/"
  },
  {
    "text": "Biden tells Obama 'she's not as strong as me' — and ex-prez agrees 'that's true' at Ethel Kennedy service  —  WASHINGTON — President Biden griped to former President Barack Obama that “she” is “not as strong as me” — with Obama agreeing “that's true” — in a stunning off-mic conversation deciphered … ",
    "url": "https://nypost.com/2024/10/17/us-news/biden-told-obama-shes-not-as-strong-as-me-and-ex-prez-agreed-thats-true-at-ethel-kennedy-funeral/"
  },
  {
    "text": "Harris Will Campaign With the Obamas Next Week  —  Barack and Michelle Obama will make their first campaign appearances alongside Kamala Harris at rallies in Georgia and Michigan.  —  Here come the Obamas.  —  Former President Barack Obama and Michelle Obama, the former first lady … ",
    "url": "https://www.nytimes.com/2024/10/18/us/politics/kamala-harris-michelle-obama-barack-obama.html"
  },
  {
    "text": "Harris Blankets Airwaves, Trump Bets on Pennsylvania in Final Stretch  —  The Democratic nominee is trying to defend the Blue Wall and remain competitive in the Sun Belt, while Trump battles for electoral vote-rich Pennsylvania. … Despite an election defined by surprises … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-18/harris-blankets-airwaves-trump-bets-on-pennsylvania-in-final-stretch"
  },
  {
    "text": "Julian Zelizer on Trump's increasingly dire rhetoric  —  “He doesn't even really use code words or anything.  He's just all in.”  —  ∙ Paid … In the closing days of the 2024 campaign, Donald Trump is talking a lot about “the enemy within.”  He's threatened to deploy the US military against his domestic political foes.",
    "url": "https://www.publicnotice.co/p/julian-zelizer-interview-trump"
  },
  {
    "text": "META/Facebook Engineer Admits That Company Is Rigging the Election  —  James O'Keefe strikes again.  —  At this rate, lefties are going to quit dating people since the technique he uses is the “honeypot” in which people open up on what they assume are legitimate dates.",
    "url": "https://hotair.com/david-strom/2024/10/17/metafacebook-engineer-admits-that-company-is-rigging-the-election-n3795933"
  },
  {
    "text": "When the Top General in the U.S. Says You're ‘Fascist to the Core’  —  Toward the end of his tenure, Gen. Mark Milley, who was the chairman of the Joint Chiefs of Staff from 2019 to 2023, told Bob Woodward of The Washington Post that Donald Trump was a fundamental threat to the safety and integrity of the United States.",
    "url": "https://www.nytimes.com/2024/10/18/opinion/trump-woodward-milley-mass-deportation.html?unlocked_article_code=1.TE4.aEQr.bu63SohLeWP4&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Meet Elon Musk's man in Washington  —  The SpaceX billionaire is forging new ties with a federal telecom official who could help funnel billions of dollars to his company if Trump is elected.  —  Elon Musk has forged a relationship with a Republican figure who could open up a geyser … ",
    "url": "https://www.politico.com/news/2024/10/18/elon-musk-brendan-carr-fcc-starlink-00184260"
  },
  {
    "text": "Jan. 6 rioter who attacked multiple officers sentenced to 17 months in prison  —  The widow of an MPD officer delivered an emotional victim impact statement.  —  Demonstrators swarm the U.S. Capitol building during a protest in Washington, D.C., Jan. 6, 2021.",
    "url": "https://abcnews.go.com/Politics/jan-6-rioter-attacked-multiple-officers-sentenced-17/story?id=114914567"
  },
  {
    "text": "Trump assassination suspect demands Judge Cannon recuse from case  —  Ryan Routh, the man charged with attempting to assassinate former President Trump at his Florida golf course last month, asked U.S. District Judge Aileen Cannon on Thursday to recuse herself from the case because Trump appointed … ",
    "url": "https://thehill.com/regulation/court-battles/4940160-ryan-routh-trump-assassination-cannon-recuse/"
  },
  {
    "text": "Scoop: Google will block election ads after polls close … - Google is implementing the policy “out of an abundance of caution and to limit the potential for confusion, given the likelihood that votes will continue to be counted after Election Day,” per a spokesperson.",
    "url": "https://www.axios.com/2024/10/17/google-block-election-ads-nov-5"
  }
]