[
  {
    "text": "Why a Second Trump Presidency May Be More Radical Than His First  —  Donald Trump has long exhibited authoritarian impulses, but his policy operation is now more sophisticated, and the buffers to check him are weaker.  —  Donald Trump has long exhibited authoritarian impulses … ",
    "url": "https://www.nytimes.com/2023/12/04/us/politics/trump-2025-overview.html"
  },
  {
    "text": "The Atlantic Dedicates Entire Issue to Warning ‘Fascist’ Trump Poses Dire Threat to America: Second Term ‘Will Be Much Worse’  —  The Atlantic announced that their first issue of 2024 will focus on what they believe to be the potentially disastrous consequences of Donald Trump returning to the White House.",
    "url": "https://www.mediaite.com/print/the-atlantic-dedicates-entire-issue-to-warning-fascist-trump-poses-dire-threat-to-america-second-term-will-be-much-worse/"
  },
  {
    "text": "If Trump Wins  —  The staff of The Atlantic on the threat a second term poses to American democracy.  —  For The Atlantic's January/February 2024 issue, 24 contributors consider what Donald Trump could do if he were to return to the White House.  Trump's second term, they conclude, would be much worse.",
    "url": "https://www.theatlantic.com/magazine/archive/2024/01/donald-trump-second-term-policies/676176/"
  },
  {
    "text": "No, Trump Did Not Say 'We've Been Waging an All-Out War on American Democracy'  —  Trump supposedly spoke of a war against American democracy during a Dec. 2, 2023, campaign stop in Cedar Rapids, Iowa. … Not long after former U.S. President and current Republican presidential candidate … ",
    "url": "https://www.snopes.com/fact-check/trump-waging-all-out-war-american-democracy/"
  },
  {
    "text": "Comer mischaracterizes Hunter Biden car payment reimbursement to his dad  —  The payments Hunter Biden made to his father came two years after the elder Biden had left the vice presidency  —  As House Republicans move toward a floor vote to authorize an impeachment inquiry against President Biden … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/04/comer-mischaracterizes-hunter-biden-car-payment-reimbursement-his-dad/"
  },
  {
    "text": "Comer Releases Direct Monthly Payments to Joe Biden from Hunter Biden's Business Entity  —  WASHINGTON—Today, House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) released subpoenaed bank records revealing Hunter Biden's business entity, Owasco PC, made direct monthly payments to Joe Biden.",
    "url": "https://oversight.house.gov/release/comer-releases-direct-monthly-payments-to-joe-biden-from-hunter-bidens-business-entity%EF%BF%BC/"
  },
  {
    "text": "23andMe confirms hackers stole ancestry data on 6.9 million users  —  On Friday, genetic testing company 23andMe announced that hackers accessed the personal data of 0.1% of customers, or about 14,000 individuals.  The company also said that by accessing those accounts, hackers were also able to access … ",
    "url": "https://techcrunch.com/2023/12/04/23andme-confirms-hackers-stole-ancestry-data-on-6-9-million-users/"
  },
  {
    "text": "Hundreds rally for Gaza in Philly, stop to protest outside Goldie falafel shop  —  Hundreds of protesters marched through Center City and University City to show their support for Gaza and demand a permanent cease-fire.  It's the latest in sustained local efforts aiming to call attention … ",
    "url": "https://www.inquirer.com/news/philadelphia/philly-palestine-protest-goldie-center-city-20231203.html"
  },
  {
    "text": "CNN's Bash has tense exchange over Hamas rapes with Jayapal  —  CNN anchor Dana Bash pressed Rep. Pramila Jayapal (D-Wash.) on the silence from some fellow progressive leaders on Hamas's use of rape as a weapon of war against Israeli women, in a tense exchange in a Sunday interview.",
    "url": "https://thehill.com/policy/international/4340811-cnn-bash-jayapal-hamas-violence-rape-women-israel/"
  },
  {
    "text": "Burgum suspends 2024 GOP presidential campaign  —  North Dakota Gov. Doug Burgum (R) is suspending his campaign in the Republican presidential primary after failing to gain traction in the crowded field.  —  Burgum's campaign was seen as a longshot from its conception.",
    "url": "https://thehill.com/homenews/campaign/4289981-burgum-suspends-2024-gop-presidential-campaign/"
  },
  {
    "text": "House GOP throws a party for former Speaker McCarthy  —  “Is this a going-away party?” one House Republican asked upon receiving the invitation, hinting at the rampant speculation about his future.",
    "url": "https://www.politico.com/live-updates/2023/12/04/congress/the-mccarthy-party-00129954"
  },
  {
    "text": "Koch network faces internal scrutiny after Nikki Haley endorsement  —  Americans for Prosperity's decision to endorse Nikki Haley for president roiled rank-and-file members of the group who aren't on board.  —  The political branch of the powerful Koch network is facing scrutiny as operatives chafe … ",
    "url": "https://www.nbcnews.com/politics/2024-election/koch-network-faces-internal-scrutiny-nikki-haley-endorsement-rcna127838"
  },
  {
    "text": "Israel investigates possible trading knowledge ahead of Oct 7 Hamas attack  —  Israeli authorities are investigating claims by U.S. researchers that some investors may have known in advance of a Hamas plan to attack Israel on Oct. 7 and used that information to profit from Israeli securities.",
    "url": "https://www.reuters.com/world/middle-east/israel-investigates-possible-trading-knowledge-ahead-oct-7-hamas-attack-2023-12-04/"
  },
  {
    "text": "Kari Lake struggles to court moderates, imperiling GOP Senate pickup  —  Lake's outreach has been met with skepticism after her 2022 gubernatorial campaign resulted in deep-seated resentments  —  PHOENIX — When she ran for governor of Arizona last year, Kari Lake unapologetically pilloried … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/04/kari-lake-struggles-court-moderates-imperiling-gop-senate-pickup/"
  },
  {
    "text": "Former U.S. Ambassador and National Security Council Official Charged with Secretly Acting as an Agent of the Cuban Government  —  For Immediate Release  —  Federal prosecutors have charged Victor Manuel Rocha, 73, of Miami, Florida, a former U.S. Department of State employee who served … ",
    "url": "https://www.justice.gov/opa/pr/former-us-ambassador-and-national-security-council-official-charged-secretly-acting-agent"
  },
  {
    "text": "Swiss bank Banque Pictet admits hiding $5.6 billion of Americans' money from IRS  — A major Swiss bank admits it conspired with U.S. taxpayers and others to hide over $5.6 billion from the Internal Revenue Service.  — Banque Pictet, the private banking division of Pictet Group … ",
    "url": "https://www.cnbc.com/2023/12/04/swiss-bank-banque-pictet-admits-hiding-americans-income-from-irs.html"
  },
  {
    "text": "Republican Senate frontrunner in Montana calls for returning ‘healthcare to pure privatization’  —  The Scoop  —  Tim Sheehy, a lead contender for the Republican Senate nomination in Montana, said earlier this year that he wants to privatize the U.S. healthcare system, according to audio obtained by Semafor.",
    "url": "https://www.semafor.com/article/12/03/2023/sheey-montana-senate-healthcare-privatization"
  },
  {
    "text": "R.F.K. Jr. Allies Say They'll Spend Over $10 Million on Ballot Access  —  A super PAC backing Robert F. Kennedy Jr.'s independent presidential candidacy is leading the costly and legally complex effort, which the Democratic establishment is trying to fight.  —  A super PAC backing … ",
    "url": "https://www.nytimes.com/2023/12/04/us/politics/rfk-jr-2024-election-pac.html"
  },
  {
    "text": "Senators race to save faltering border-Ukraine negotiations  —  Hanging in the balance is Biden's foreign policy agenda.  —  Senate negotiators are scrambling to revive bipartisan border talks after the lead Democrat involved warned that talks had reached a major impasse … ",
    "url": "https://www.politico.com/news/2023/12/04/senate-dems-border-talks-are-dead-senate-republicans-theres-still-a-pulse-00129900"
  },
  {
    "text": "Israel says ground forces operating across Gaza Strip as offensive builds  —  Intense Israeli air strikes hit the south of the Gaza Strip on Monday, killing and wounding dozens of Palestinians, including in areas where Israel had told people to seek shelter, residents and journalists on the ground said.",
    "url": "https://www.reuters.com/world/middle-east/israel-says-ground-forces-operating-across-gaza-strip-offensive-builds-2023-12-04/"
  },
  {
    "text": "Ousted propaganda scholar Joan Donovan accuses Harvard of bowing to Meta  —  In a whistleblower complaint, she breaks her silence over events that unsettled other misinformation researchers  —  A prominent disinformation scholar has accused Harvard University of dismissing her to curry favor … ",
    "url": "https://www.washingtonpost.com/technology/2023/12/04/joan-donovan-harvard-dismissal-complaint/"
  }
]