[
  {
    "text": "'I'm a black NAZI!':  NC GOP nominee for governor made dozens of disturbing comments on porn forum  —  Editor's Note: The below story contains offensive language.  —  Mark Robinson, the controversial and socially conservative Republican nominee for governor of North Carolina … ",
    "url": "https://www.cnn.com/2024/09/19/politics/kfile-mark-robinson-black-nazi-pro-slavery-porn-forum"
  },
  {
    "text": "New Court Filings Place Matt Gaetz at a Party at the Center of the Sex Trafficking Scandal  —  This is the first public filing that cites sworn testimony alleging that Gaetz attended one of the long-rumored parties with a teenage girl.  — Copy  —  Rep. Matt Gaetz attended a drug-fueled sex party … ",
    "url": "https://www.notus.org/florida/new-court-filings-matt-gaetz-dorworth-sex-party"
  },
  {
    "text": "Matt Gaetz Was at Sex and Drugs Party With High School Junior: Court Docs  —  BOMBSHELL  —  Filings cite sworn statements from three witnesses.  —  Rep. Matt Gaetz was at a 2017 party with a 17-year-old girl at the heart of an alleged sex trafficking scandal, according to legal documents filed Thursday.",
    "url": "https://www.thedailybeast.com/matt-gaetz-was-at-sex-and-drugs-party-with-high-school-junior-court-docs"
  },
  {
    "text": "Nuzzi's RFK Relationship  —  “Had the magazine been aware of this relationship, she would not have continued to cover the presidential campaign,” the spokesperson said. … “Recently our Washington Correspondent Olivia Nuzzi acknowledged to the magazine's editors that she had engaged … ",
    "url": "https://www.status.news/p/olivia-nuzzi-rfk-new-york-magazine"
  },
  {
    "text": "Kamala Harris Says Anyone Who Breaks Into Her House Is ‘Getting Shot’  —  The Democratic presidential nominee said she can support both the Second Amendment and commonsense gun reform.  —  LOADING  —  Vice President Kamala Harris defended her gun ownership and said she would use a firearm … ",
    "url": "https://www.huffpost.com/entry/kamala-harris-gun-ownership-oprah-winfrey_n_66ecd25be4b07a173e50d8c2"
  },
  {
    "text": "Kentucky sheriff charged in killing of judge at courthouse  —  A judge in a rural Kentucky county was shot and killed in his courthouse chambers Thursday, and the local sheriff was charged with murder, police said.  The preliminary investigation indicates Letcher County Sheriff Shawn M. Stines … ",
    "url": "https://apnews.com/article/courthouse-shooting-kentucky-f93419fff14202a88e28b5ea49b26810"
  },
  {
    "text": "I'm the Governor of Ohio.  I Don't Recognize the Springfield That Trump and Vance Describe.  —  I was born in Springfield, Ohio.  My wife, Fran, and I have lived our entire lives less than 10 miles from this city.  —  When we were dating in high school, we would go there to see movies … ",
    "url": "https://www.nytimes.com/2024/09/20/opinion/springfield-haitian-migrants-ohio.html?unlocked_article_code=1.ME4.GXDA.7LLopMRyJqap&smid=url-share"
  },
  {
    "text": "Mike Johnson bypassed a second time with rare maneuver … - In May, a discharge petition led by Rep. Greg Steube (R-Fla.) attained the necessary 218 signatures to force a House vote on legislation providing tax relief to victims of natural disasters.  — The last time a discharge petition succeeded … ",
    "url": "https://www.axios.com/2024/09/19/discharge-petition-social-security-mike-johnson"
  },
  {
    "text": "Trump tells Jewish audience Israel will be ‘eradicated’ if he doesn't win  —  Trump spoke at a campaign event on “Fighting Anti-Semitism in America.”  —  Former President and Republican presidential candidate Donald Trump speaks at the Israeli-American Council National Summit in Washington, D.C., on Sept. 19, 2024.",
    "url": "https://abcnews.go.com/Politics/trump-israel-eradicated-win/story?id=113853150"
  },
  {
    "text": "Trump Electoral-Vote Heist Underway in Nebraska  —  With the major-party presidential candidates in close battles in a sparse landscape of battleground states, every electoral vote matters.  There are scenarios where either Kamala Harris or Donald Trump wins 269 or 270 electoral votes.",
    "url": "https://nymag.com/intelligencer/article/trump-electoral-vote-heist-underway-in-nebraska.html"
  },
  {
    "text": "Former Longtime Teamsters President Blasts Successor For Not Backing Harris  —  Jim Hoffa accused the union's current president, Sean O'Brien, of “a failure of leadership,” saying he boosted Trump's campaign with a non-endorsement.  —  LOADING  —  Former longtime Teamsters President Jim Hoffa blasted … ",
    "url": "https://www.huffpost.com/entry/jim-hoffa-sean-obrien-teamsters_n_66ed5a0de4b051cb4d2d3b54"
  },
  {
    "text": "Apocalypse delayed: Trump keeps promising a doom that never comes  —  Trump predicted that if Biden won, the economy would crash, crime would soar and Christmas would be canceled.  None of that happened, but he's reusing those claims anyway.  —  If the election does not go his way … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/apocalypse-delayed-trump-promising-doom-never-comes-rcna170151?taid=66ed5541efde9c0001e11a65"
  },
  {
    "text": "Biden unleashes Cabinet sprint ahead of election … - From implementing clean tech tax credits to spending billions of dollars to build roads, bridges and semiconductor facilities, top officials know that there's more work to do.  — Senior White House officials and Senate Majority Leader Chuck Schumer … ",
    "url": "https://www.axios.com/2024/09/20/biden-cabinet-meeting-election"
  },
  {
    "text": "Trump Lawyers Cling To Supreme Court Immunity Ruling In Jan. 6 Case  —  They argued that Trump's alleged pressure campaign on Mike Pence would qualify as official conduct and is protected by “absolute” immunity.  —  LOADING  —  In a filing late Thursday night, lawyers … ",
    "url": "https://www.huffpost.com/entry/trump-lawyers-supreme-court-immunity-ruling-jan-6_n_66ec2155e4b083d40a2c52e0"
  },
  {
    "text": "Harris, With an Online Avalanche, Outspends Trump by Tens of Millions  —  The week of their debate, Kamala Harris outspent Donald Trump by 20 to 1 on Facebook and Instagram.  It was just one sign of how uneven their online advertising battle has become.  —  Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2024/09/20/us/politics/kamala-harris-trump-campaign-spending.html"
  },
  {
    "text": "Jason Stanley on how authoritarians rewrite the past  —  “Authoritarian regimes must erase any history of social movements for democracy.”  —  ∙ Paid … “Fascist politics invokes a pure mythic past tragically destroyed,” Jason Stanley wrote at the very beginning of his 2018 book … ",
    "url": "https://www.publicnotice.co/p/jason-stanley-interview-fascism-erasing-history"
  },
  {
    "text": "North Carolina Judge Denies Republicans' Request To Block UNC Mobile Voter ID  —  A North Carolina judge denied a request from the Republican National Committee (RNC) and North Carolina Republican Party to prohibit University of North Carolina-Chapel Hill students and employees from using … ",
    "url": "https://www.democracydocket.com/news-alerts/north-carolina-judge-denies-republicans-request-to-block-unc-mobile-voter-id/"
  },
  {
    "text": "Voters split on whether Harris or Trump would do a better job on the economy: AP-NORC poll  —  Going into November's election, neither Kamala Harris nor Donald Trump has a decisive edge with the public on the economy, turning an issue that was once a clear strength for Trump into the equivalent of a political jump ball.",
    "url": "https://apnews.com/article/harris-trump-economy-poll-inflation-dc80ac9e5d7da42900762910d5f0a283"
  }
]