[
  {
    "text": "Trump wrote to-do lists for assistant on White House documents marked classified: Sources  —  Molly Michael told investigators about the documents, according to sources.  —  One of former President Donald Trump's long-time assistants told federal investigators that Trump repeatedly wrote … ",
    "url": "https://abcnews.go.com/US/trump-wrote-lists-assistant-white-house-documents-marked/story?id=103226113"
  },
  {
    "text": "Trump to Woo Striking Union Members in Detroit, Skipping 2nd G.O.P. Debate  —  Looking past the Republican primary, Donald Trump and his campaign are already gearing up for a possible rematch with President Biden.  —  Former President Donald J. Trump is planning to travel to Detroit … ",
    "url": "https://www.nytimes.com/2023/09/18/us/politics/trump-detroit-debate.html"
  },
  {
    "text": "McCarthy foes eye higher office  —  The News  —  Several of the House Republicans currently blocking their party from passing a budget deal may have their eye on higher office — and that's causing some gripes among their colleagues.  —  On Monday, NBC reported on widespread speculation … ",
    "url": "https://www.semafor.com/article/09/19/2023/kevin-mccarthy-foes-eye-higher-office"
  },
  {
    "text": "House GOP in open warfare over doomed spending plan  —  One Republican summed up the situation neatly as leadership-empowered negotiators faceplanted with days to go before a shutdown: “It's a mess.”  —  As House Republicans began ripping apart their party's latest spending proposal … ",
    "url": "https://www.politico.com/news/2023/09/19/house-gop-spending-plan-00116631"
  },
  {
    "text": "Maybe Matt Gaetz Is Right  —  The dysfunctional dance taking place in the House between Speaker Kevin McCarthy and his right flank has driven me to consider something I never imagined possible: that Matt Gaetz is right.  —  A House speaker can be successful only with the confidence … ",
    "url": "https://www.nytimes.com/2023/09/19/opinion/kevin-mccarthy-gaetz.html"
  },
  {
    "text": "A real fact-check of Trump's appearance on Meet the Press  —  Kristen Welker's tenure as the new host of NBC's Meet the Press began on Sunday with an interview with former President Donald Trump.  NBC News promoted Trump's appearance as his “first broadcast network interview since leaving office.”",
    "url": "https://popular.info/p/a-real-fact-check-of-trumps-appearance"
  },
  {
    "text": "Indicted Trump claims solidarity with Black voters  —  Former President Trump is pushing his mug shot, arrests and criminal charges to try to claim new solidarity with Black voters — a group that has largely shunned him in elections. … - But his team believes he can make inroads … ",
    "url": "https://www.axios.com/2023/09/19/indicted-trump-claims-solidarity-black-voters"
  },
  {
    "text": "Rep. Lauren Boebert Says Hookup Theater Guy Won't Get Another Date  —  Rep. Lauren Boebert says it's dunzo between her and the theater groping guy — saying the one-time private moment came and went ... and it sounds like his politics might be at play.  —  The Colorado congresswoman touched … ",
    "url": "https://www.tmz.com/2023/09/18/rep-lauren-boebert-no-more-dates-after-theater-hookup/"
  },
  {
    "text": "Rudy Giuliani's ex-lawyers sue him for the $1.4 million they say he owes for defending him in election interference investigations  — Rudy Giuliani's ex-lawyer has filed a lawsuit seeking nearly $1.4 million in unpaid bills.  — It's the latest bad news for Giuliani, who has been indicted and put his apartment up for sale.",
    "url": "https://www.businessinsider.com/giuliani-lawyers-lawsuit-1-million-unpaid-legal-fees-2023-9?op=1"
  },
  {
    "text": "Pentagon chief urges allies to provide advanced air defense systems for Ukraine  —  Defense Secretary Lloyd Austin is encouraging U.S. allies to “dig deep” and provide more air defense systems for Ukraine, saying that the munitions could be critical to stop Russian missile barrages.",
    "url": "https://thehill.com/policy/defense/4211577-pentagon-chief-urges-allies-to-provide-advanced-air-defense-systems-for-ukraine/"
  },
  {
    "text": "Federal judge upholds convictions of Oath Keeper associate  —  A federal judge on Tuesday upheld two federal convictions against a Navy veteran and Oath Keeper associate accused of helping the far-right group stash weapons outside Washington, DC, on January 6, 2021.",
    "url": "https://www.cnn.com/2023/09/19/politics/oath-keeper-convictions/"
  },
  {
    "text": "China's Former Foreign Minister Ousted After Alleged Affair, Senior Officials Told  —  Qin Gang remains under investigation for possible national security violations, according to people familiar with the matter  —  NEW YORK—Senior Chinese officials were told that an internal Communist … ",
    "url": "https://www.wsj.com/world/china/chinas-ex-foreign-minister-ousted-after-alleged-affair-senior-officials-told-fdff4672?mod=followamazon"
  },
  {
    "text": "The Ultimate Sign of DeSantis' Irrelevance: Trumpworld Is Moving On  —  When Ron DeSantis first announced his candidacy, he was Donald Trump's clearest rival—and a favorite punching bag for his minions.  Now, Trumpworld sees little need to punch down.",
    "url": "https://www.thedailybeast.com/the-ultimate-sign-of-desantis-irrelevance-trumpworld-is-moving-on"
  },
  {
    "text": "Canada Ties Hardeep Singh Nijjar Killing to India  —  In a rare and explosive allegation, the Canadian leader said the Indian government was behind the death of a Canadian citizen who advocated turning part of India into an independent Sikh nation.  —  Prime Minister Justin Trudeau of Canada … ",
    "url": "https://www.nytimes.com/2023/09/18/world/canada/canada-india-sikh-killing.html"
  },
  {
    "text": "Dominion's $1.6 billion defamation suit against Newsmax over election lies set for September 2024 trial  —  Dominion Voting Systems' $1.6 billion defamation lawsuit against Newsmax over the right-wing network's airing of 2020 election lies is scheduled to go to trial in late September 2024, a Delaware judge decided.",
    "url": "https://www.cnn.com/2023/09/18/media/dominion-newsmax-defamation-lawsuit/"
  },
  {
    "text": "Biden administration announces $400 million to help states adopt climate-friendly building codes  —  The Biden administration announced on Tuesday that it will open up applications for the first tranche of funding — $400 million — to help states and territories take up energy efficient building codes.",
    "url": "https://thehill.com/policy/energy-environment/4210818-biden-administration-announces-400-million-to-help-states-adopt-climate-friendly-building-codes/"
  },
  {
    "text": "Democrat governor first in nation to ban her state government from buying this common item  —  Massachusetts will become the first state to ban the purchase of single-use plastic bottles for state agencies  —  Massachusetts is slated to become the first state in the nation to ban state agencies … ",
    "url": "https://www.foxnews.com/politics/democrat-governor-first-nation-ban-her-state-government-buying-common-item"
  },
  {
    "text": "Personnel from Joint Base Charleston and Marine Corps Air Station Beaufort, in close coordination with local authorities, have located a debris field in Williamsburg County.  —  The debris was discovered two hours northeast of Joint Base Charleston.  —  Teams from Joint Base Charleston … ",
    "url": "https://www.facebook.com/TeamCharleston/posts/696029312548562"
  },
  {
    "text": "Anxiety ripples through the Democratic Party over Biden  —  Persistent concerns over Biden's age come amid a series of polls showing he's neck-and-neck with Trump  —  A growing number of polls are showing voters concerned about President Biden's age and energy.",
    "url": "https://www.washingtonpost.com/nation/2023/09/18/biden-democrats-anxiety-age/"
  }
]