[
  {
    "text": "Zinke Introduces Bill to Expel Palestinians from the United States  —  (WASHINGTON, D.C.) - Today, Western Montana Congressman Ryan Zinke introduced the Safeguarding Americans from Extremism (SAFE) Act to prevent Palestinian terrorists from abusing the United States' legal immigration system … ",
    "url": "https://zinke.house.gov/media/press-releases/zinke-introduces-bill-expel-palestinians-united-states"
  },
  {
    "text": "Republicans Introduce Bill To Expel Palestinians From The United States  —  Rep. Ryan Zinke (R-Mont.) and a group of far-right House Republicans want to revoke visas issued to Palestinians.  —  LOADING  —  WASHINGTON — Rep. Ryan Zinke (R-Mont.) introduced legislation on Thursday … ",
    "url": "https://www.huffpost.com/entry/ryan-zinke-republicans-expel-palestinians_n_65454496e4b01b258583b5de"
  },
  {
    "text": "GOP Rep. Zinke proposes bill to ban Palestinians from entering US  —  Rep. Ryan Zinke (R-Mont.) introduced a bill Thursday that could ban Palestinians from entering the U.S. and possibly expel those who are already here.  —  Zinke, who served as secretary of the Interior Department under … ",
    "url": "https://thehill.com/homenews/house/4292692-gop-rep-zinke-proposes-bill-to-ban-palestinians-from-entering-us/"
  },
  {
    "text": "Mark Meadows sued by book publisher over false election claims  —  The publisher of Mark Meadow's book is suing the former White House chief of staff, arguing in court filings Friday morning that he violated an agreement with All Seasons Press by including false statements … ",
    "url": "https://thehill.com/regulation/court-battles/4292647-mark-meadows-sued-by-book-publisher-over-false-election-claims/"
  },
  {
    "text": "Appeals court pauses Trump gag order in federal election interference case  —  An appeals court Friday ordered an administrative stay of a gag order barring former President Trump from targeting witnesses and the prosecutors in his federal election interference case, temporarily pausing its implementation ahead of further legal battles.",
    "url": "https://thehill.com/regulation/court-battles/4292877-appeals-court-trump-gag-order-election-interference/"
  },
  {
    "text": "Jamie Raskin Marks Up George Santos' Thank-You Note With Corrections … LOADING",
    "url": "https://www.huffpost.com/entry/jamie-raskin-george-santos-thank-you-note_n_654571bce4b01b258583cc3e"
  },
  {
    "text": "Jan. 6 rioter accused of ripping officer's gas mask sentenced to 7 years in prison  —  A Texas man accused of forcefully removing a Capitol Police officer's gas mask during the Jan. 6, 2021, riot on the Capitol, was sentenced to 7 years in prison on Friday.  —  Steven Cappuccio … ",
    "url": "https://thehill.com/regulation/court-battles/4293127-jan-6-rioter-gas-mask-sentenced/"
  },
  {
    "text": "RFK Jr. comes ‘home’ to his anti-vaccine group, commits to ‘a break’ for U.S. infectious disease research  —  He has suggested without evidence that researchers and pharmaceutical companies are driven by profit to neglect chronic conditions.  —  At an anti-vaccine conference in Georgia on Friday … ",
    "url": "https://www.nbcnews.com/politics/politics-news/rfk-jr-comes-home-anti-vaccine-group-commits-break-us-infectious-disea-rcna123551"
  },
  {
    "text": "‘I refuse to put people over politics’: Speaker Johnson fundraises with apparent typo  —  Speaker Mike Johnson (R-La.) appeared to get his words mixed up in one of his first fundraising emails since taking the top House job last week.  —  Johnson capped a standard fundraising message Friday … ",
    "url": "https://thehill.com/homenews/house/4292489-people-over-politics-speaker-johnson-fundraises-typo/"
  },
  {
    "text": "Republicans, fed up with Tuberville, plot ways to bust his military blockade  —  “You're seeing the frustration build up because the consequences are building up,” one senator said.  —  Republicans have had it with Sen. Tommy Tuberville's nine-month blockade of military promotions.",
    "url": "https://www.politico.com/news/2023/11/03/republicans-fed-up-with-tuberville-plot-ways-to-bust-his-military-blockade-00125289"
  },
  {
    "text": "BREAKING: Netanyahu Rebukes US, Declares No Pause and No Fuel Before Hostages are Released  —  Benjamin Netanyahu has learned to take Hamas at its word.  The United States, and specifically Antony Blinken and Joe Biden, still have not.  As Blinken met with the unity government in Jerusalem … ",
    "url": "https://hotair.com/ed-morrissey/2023/11/03/breaking-netanyahu-rebukes-us-declares-no-pause-and-no-fuel-before-hostages-are-released-n589754"
  },
  {
    "text": "It Just Got Worse—Again—for Donald Trump  —  Whenever I look at the latest polls and start to freak out about Donald Trump winning the presidency again, I calm myself by remembering that the guy is very likely going to be an at-least-once convicted felon by next November.",
    "url": "https://newrepublic.com/post/176633/john-eastman-donald-trump-worse"
  },
  {
    "text": "Virginia white voters' mail-in ballots face fewer challenges, Democrats say  —  Ballots from voters of color are being flagged for rejection at much higher rates ahead of election day this month, party analysis says  —  The fight for democracy is supported by",
    "url": "https://www.theguardian.com/us-news/2023/nov/03/virginia-election-mail-in-ballots-democrats"
  },
  {
    "text": "‘They wanted to kill me’: Vicious otter attack left Northern California man with 40 bite wounds  —  'It is by far the most terrifying experience I've ever had in my life.  Nothing even comes close,' Matt Leffers, who was attacked by the otters, said.  —  COPY  —  PLACER COUNTY, Calif. —",
    "url": "https://www.kcra.com/article/placer-county-serene-lakes-otters-attack/45729327"
  },
  {
    "text": "RNC raises bar for candidates to qualify for fourth GOP presidential debate  —  At least four candidates will take the third debate stage next Wednesday in Miami.  —  Republican presidential primary contenders will have to meet higher polling and donor thresholds to qualify for the fourth debate in the race, the RNC said on Friday.",
    "url": "https://www.politico.com/news/2023/11/03/rnc-qualification-gop-debate-00125387"
  },
  {
    "text": "Supreme Court to review Trump-era ban on gun ‘bump stocks’  —  The Biden administration is defending the ban, which Trump imposed after the mass shooting in Las Vegas in 2017.  —  WASHINGTON — The Supreme Court on Friday stepped into a new gun rights battle by agreeing to weigh whether … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-review-trump-era-ban-gun-bump-stocks-rcna121466"
  }
]