[
  {
    "text": "Trump and Biden neck and neck nationally and in battlegrounds — CBS News poll  —  Among all the factors on voters' minds this election, former President Donald Trump's guilty verdict pales in comparison to issues like the economy, inflation, and the border — all items on which Trump maintains advantages.",
    "url": "https://www.cbsnews.com/news/poll-trump-biden-neck-and-neck-06-09-2024/"
  },
  {
    "text": "Endangered Republicans gamble backing Trump after guilty verdict as vulnerable Democrats remain cautious  —  For more on how vulnerable Republicans are grappling with former President Donald Trump's conviction, watch “Inside Politics Sunday with Manu Raju” at 8 a.m. and 11 a.m. ET.  —  CNN  —",
    "url": "https://www.cnn.com/2024/06/09/politics/republicans-trump-verdict/"
  },
  {
    "text": "‘Georgia Is Our Laboratory’: Inside Trump's Plan to Rig 2024  —  Team Trump sees Georgia as ‘a road map’ for putting Trump's heads-I-win-tails-you-lose philosophy of elections into practice  —  T  —  HE PRESIDENTIAL ELECTION this year will come down to seven states … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-georgia-laboratory-rig-2024-1235034510/"
  },
  {
    "text": "Far-right fossil fuel company allies pressure US supreme court to shield firms in unprecedented campaign  —  Groups linked to billionaire Leonard Leo, who seems to have ties to Chevron, are pressing the court to intervene in lawsuits that could cost billions",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/09/fossil-fuel-allies-pressuring-supreme-court"
  },
  {
    "text": "The Day My Old Church Canceled Me Was a Very Sad Day  —  This week, the leaders of the Presbyterian Church in America will gather in Richmond, Va., for their annual General Assembly.  The Presbyterian Church in America is a small, theologically conservative Christian denomination that was my family's church home for more than 15 years.",
    "url": "https://www.nytimes.com/2024/06/09/opinion/presbyterian-church-evangelical-canceled.html"
  },
  {
    "text": "Trump to hold rally in swing state Nevada during heatwave  —  Republican presidential candidate Donald Trump will hold an outdoor rally in sweltering Las Vegas, Nevada, on Sunday, seeking to shore up support in a swing state he lost twice but which polls suggest is leaning his way in the Nov. 5 election.",
    "url": "https://www.reuters.com/world/us/trump-hold-rally-swing-state-nevada-during-heatwave-2024-06-09/"
  },
  {
    "text": "Israel rescues 4 hostages taken in Hamas' Oct. 7 attack.  At least 94 Palestinians are killed  —  Rescued Israeli hostages Andrey Kozlov and Almog Meir Jan arrived by helicopter at Sheba Medical Centre in Ramat Gan on Saturday.  Israel said it had rescued four hostages who were kidnapped in the Hamas-led attack on October 7.",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-8-6-2024-a5d1ef04763a5ed17de2d050ebc5d490"
  },
  {
    "text": "For Trump, Doug Burgum Emerges as a Safe Option, and a Wild Card  —  Mr. Burgum, North Dakota's governor, is a prime contender in the former president's search for a running mate, but he remains untested on the national stage.  —  After taking his software company public in 1997 … ",
    "url": "https://www.nytimes.com/2024/06/09/us/politics/burgum-trump-vp-search.html"
  },
  {
    "text": "Hollywood vets and Biden alums launch super PAC to shore up his youth vote problem  —  The group, Won't PAC Down, is eyeing a budget of up to $25 million.  —  Allies of President Joe Biden are launching a new super PAC aimed at fixing one of his most problematic demographic trends: his erosion with young voters.",
    "url": "https://www.politico.com/news/2024/06/09/hollywood-vets-biden-super-pac-youth-vote-00162401"
  },
  {
    "text": "Trump's Bizarre Moments With Dr. Phil and Hannity Should Alarm Us All  —  During just this week, two of Donald Trump's friendliest interviewers handed him big prime-time opportunities to unequivocally renounce any intention to retaliate against Democrats for his criminal conviction by a jury of his peers in Manhattan.",
    "url": "https://newrepublic.com/article/182480/trump-dr-phil-hannity-bizarre-moments-alarm"
  },
  {
    "text": "Bipartisanship or Republican meddling?  AIPAC is biggest source of GOP donations in Dem primaries  —  AIPAC sees support for Israel as bipartisan, and its donors come from both parties.  But its practice of sending money from GOP donors into Democratic races has enraged progressives.",
    "url": "https://www.politico.com/news/2024/06/09/aipac-republican-donors-democratic-primaries-00162404"
  },
  {
    "text": "A male birth control gel is one step closer to reality, and that's worth celebrating  —  A male equivalent to the female birth control pill has not yet materialized, but a clinical trial shows encouraging results  —  Science may have a new way for men to ejaculate responsibly",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jun/08/male-birth-control-gel"
  },
  {
    "text": "Israel's war cabinet minister Gantz expected to quit Netanyahu government  —  Israel's centrist war cabinet minister Benny Gantz has delayed a statement he was due to give later on Saturday in which he was widely expected to announce his resignation from Prime Minister Benjamin Netanyahu's emergency government.",
    "url": "https://www.reuters.com/world/middle-east/israels-war-cabinet-minister-gantz-expected-quit-netanyahu-government-2024-06-08/"
  },
  {
    "text": "Trump loyalist pushes ‘post-constitutional’ vision for second term  —  Russ Vought, the former president's budget director, is laying the groundwork for a broad expansion of presidential powers.  —  A battle-tested D.C. bureaucrat and self-described Christian nationalist is drawing … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/08/russ-vought-trump-second-term-radical-constitutional/"
  }
]