[
  {
    "text": "Jim Jordan's pressure campaign the ‘dumbest thing you can do,’ one House Republican says  —  Nobody likes a bully, Rep. Dan Crenshaw said.  —  Rep. Dan Crenshaw (R-Texas) has some advice for Rep. Jim Jordan as he and his allies attempt to pressure his way to the speakership:  —  Chill.",
    "url": "https://www.politico.com/news/2023/10/15/jim-jordan-bullying-dan-crenshaw-00121609"
  },
  {
    "text": "Jordan Activates Right-Wing Pressure Campaign in Push to Win Speakership  —  Allies of the Ohio Republican, who must persuade scores of his colleagues to support his bid for speaker, are threatening right-wing retribution to any G.O.P. lawmakers who dare oppose him.",
    "url": "https://www.nytimes.com/2023/10/14/us/house-speaker-republicans-jordan.html"
  },
  {
    "text": "House Republicans' Chaos Is Making Biden's Split-Screen Strategy a Lot Easier  —  Biden wants to run on his ability to govern.  House Republicans' inability to do just that plays into the Democrat's 2024 strategy … Joe Biden's reelection strategy relies on painting Republicans as chaotic, disorganized, and unserious.",
    "url": "https://themessenger.com/politics/biden-house-republican-chaos-contrast-strategy"
  },
  {
    "text": "Time to be the arsenal of democracy  —  The quotes that got the most attention in President Joe Biden's remarks on Tuesday about the terrorist attacks in Israel referred to “evil.”  But the line with the most important policy foreshadowing was notable in that it did not name Israel per se … ",
    "url": "https://thehill.com/opinion/congress-blog/4256564-time-to-be-the-arsenal-of-democracy/"
  },
  {
    "text": "GOPer cut off by CNN host for anti-immigrant rant when asked about Gaza refugees  —  During an appearance on CNN on Sunday morning, host Victor Blackwell was forced to shut down a House Republican who took advantage of a question about what to do with Palestinian refugees to attack President Joe Biden over immigration in the U.S.",
    "url": "https://www.rawstory.com/gaza-palestinian-refugees/"
  },
  {
    "text": "Driving 100 miles in labor; giving birth in the ER: Fears rise as 3 maternity units prepare to close in Alabama  —  The state has one of the country's highest maternal mortality rates.  Now, three hospitals plan to stop delivering babies, putting some pregnant women at even higher risk.",
    "url": "https://www.nbcnews.com/health/womens-health/3-hospitals-closing-maternity-labor-delivery-units-alabama-rcna111374"
  },
  {
    "text": "Boebert spent campaign cash at Beetlejuice boyfriend's bar  —  The Colorado congresswoman dropped a few hundred bucks at Hooch, a place that hosts drag shows.  —  Well before Rep. Lauren Boebert and her date got thrown out of a local theater showing of Beetlejuice for being disruptive and frisky … ",
    "url": "https://www.politico.com/news/2023/10/15/boebert-campaign-cash-beetlejuice-bar-00121606"
  },
  {
    "text": "How hackers piled onto the Israeli-Hamas conflict  —  Lower-level cyberattacks are becoming a major feature of the war between Israel and Hamas, and the attacks could ramp up in intensity.  —  Hackers sympathetic to Hamas are working to make the Israel-Gaza conflict the next front of cyberwarfare.",
    "url": "https://www.politico.com/news/2023/10/15/hackers-israel-hamas-war-00121593"
  },
  {
    "text": "Republican Jeff Landry Wins The Louisiana Governor's Race, Reclaims Office For GOP  —  Attorney General Jeff Landry has won Louisiana governor's seat, fending off a crowded field of candidates.  —  LOADING  —  Attorney General Jeff Landry, a Republican backed by former President Donald Trump … ",
    "url": "https://www.huffpost.com/entry/election-2023-louisiana-governor_n_652b5af4e4b00565b6204b47"
  },
  {
    "text": "Blackburn Calls For Removal Of Jake Sullivan As National Security Advisor  —  NASHVILLE, TENN. - U.S. Senator Marsha Blackburn (R-Tenn.) today called on President Biden to remove Jake Sullivan from his post as National Security Advisor to the United States.  —  Right Before The Attack On Israel … ",
    "url": "https://www.blackburn.senate.gov/2023/10/blackburn-calls-for-removal-of-jake-sullivan-as-national-security-advisor"
  },
  {
    "text": "Scoop: Iran warns Israel through UN against ground offensive in Gaza … - Iran's message, sent to Israel through the UN, comes as the Biden administration has been trying to deter Iran and Lebanon-backed Hezbollah, supported by Iran, from joining the war.",
    "url": "https://www.axios.com/2023/10/14/iran-warning-israel-hezbollah-hamas-war-gaza"
  },
  {
    "text": "Israeli Invasion Plans Target Gaza City and Hamas Leadership  —  The goal, according to three senior officers, is to wipe out the top political and military hierarchy of Hamas, the Palestinian group that controls Gaza.  —  The Israeli military is preparing to invade the Gaza Strip … ",
    "url": "https://www.nytimes.com/2023/10/14/world/middleeast/israel-gaza-invasion.html"
  },
  {
    "text": "Biden, DNC raise $71 million in third quarter  —  It's a large, though not record-breaking, amount that has allowed Biden to launch an earlier TV and digital advertising campaign than past presidents' reelection efforts.  —  President Joe Biden, the Democratic National Committee … ",
    "url": "https://www.politico.com/news/2023/10/15/biden-dnc-fundraising-fec-00121591"
  },
  {
    "text": "Progressives call for US to take in some of the expected 1 million Gaza refugees  —  Experts predict a million refugees might flee the Gaza Strip amid the war between Israel and Hamas, and socialists and far-left lawmakers said America should welcome them.  —  “Fifty percent of the population in Gaza are children.",
    "url": "https://nypost.com/2023/10/14/progressives-call-for-us-to-take-refugees-from-gaza/"
  },
  {
    "text": "Mounting debt threatens Mike Pence's campaign  —  Pence's 2024 effort has $1.2 million on hand but has built up $620,000 in debt, a major warning sign for a presidential campaign.  —  Former Vice President Mike Pence's 2024 campaign faces a potentially existential cash squeeze, with debt already piling up.",
    "url": "https://www.nbcnews.com/politics/2024-election/mounting-debt-threatens-mike-pences-campaign-rcna120458"
  }
]