[
  {
    "text": "Read the Full Transcript of Donald Trump's 2024 Person of the Year Interview With TIME  —  President-elect Donald Trump, TIME's 2024 Person of the Year, sat down for a wide-ranging interview at his Mar-a-Lago Club in Palm Beach, Fla., on Nov. 25.  —  Over the course of the interview … ",
    "url": "https://time.com/7201565/person-of-the-year-2024-donald-trump-transcript/"
  },
  {
    "text": "Playbook PM: Trump's ‘fury’ road to redemption  —  BREAKING — DOJ IG MICHAEL HOROWITZ just released his long-awaited report on the Jan. 6 Capitol attack.  The topline, via Kyle Cheney: “NO evidence that there were any undercover FBI employees at the Capitol or nearby protests,” though some FBI informants were present.",
    "url": "https://www.politico.com/newsletters/playbook-pm/2024/12/12/trumps-fury-road-to-redemption-00132333"
  },
  {
    "text": "FACT SHEET: President Biden Announces Clemency for Nearly 1,500 Americans  —  Today's announcement will commute the sentences of close to 1,500 individuals who were placed on home confinement and will pardon 39 individuals convicted of non-violent crimes  —  Today, President Biden announced … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/12/fact-sheet-president-biden-announces-clemency-for-nearly-1500-americans/"
  },
  {
    "text": "Biden commutes roughly 1,500 sentences and pardons 39 people in biggest single-day act of clemency  —  President Joe Biden is commuting the sentences of roughly 1,500 people who were released from prison and placed on home confinement during the coronavirus pandemic and is pardoning 39 Americans convicted of nonviolent crimes.",
    "url": "https://apnews.com/article/biden-pardons-clemency-4432002d67334e6716c2776fd73f3cc8"
  },
  {
    "text": "FBI missed ‘basic step’ when gathering intel in the lead-up to Jan. 6, DOJ watchdog finds  —  Investigators found no evidence of undercover FBI employees at the Capitol, but the presence of FBI informants could further fuel right-wing “fedsurrection” conspiracy theories.",
    "url": "https://www.nbcnews.com/politics/national-security/fbi-missed-basic-step-gathering-intel-lead-jan-6-doj-watchdog-finds-rcna183449"
  },
  {
    "text": "FBI didn't deploy undercover agents on Jan. 6, watchdog report finds, undercutting conspiracy theories  —  The DOJ inspector general also said the FBI should have done more to canvass its sources in advance of Jan. 6 to try to understand the potential for violence.",
    "url": "https://www.politico.com/news/2024/12/12/fbi-jan-6-undercover-agents-inspector-general-report-00194036"
  },
  {
    "text": "Trump's Middle East Adviser Pick Is a Small-Time Truck Salesman  —  The lore around Massad Boulos, Tiffany Trump's father-in-law, is that he is a billionaire dealmaker.  Records show otherwise.  —  The lore around Massad Boulos, Tiffany Trump's father-in-law, is that he is a billionaire dealmaker.",
    "url": "https://www.nytimes.com/2024/12/12/world/africa/trump-massad-boulos-middle-east.html?unlocked_article_code=1.g04.kvZk.eE-d0JxFTQec&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Senate Democrats want communications between Boris Epshteyn and potential Trump appointees disclosed  —  Two top Senate Democrats are calling for President-elect Donald Trump's potential appointees to be required to disclose any communications they had with Boris Epshteyn, a longtime Trump adviser … ",
    "url": "https://www.cbsnews.com/news/senate-democrats-boris-epshteyn-communications-potential-trump-appointees/"
  },
  {
    "text": "Christopher Wray Is Preparing to Sabotage Trump and Patel  —  On Wednesday, Christopher Wray announced that he is resigning as director of the FBI.  —  “After weeks of careful thought, I've decided the right thing for the bureau is for me to serve until the end of the current administration … ",
    "url": "https://pjmedia.com/matt-margolis/2024/12/12/christopher-wray-is-preparing-to-sabotage-trump-and-patel-n4935055"
  },
  {
    "text": "No Iranian drone ‘mothership’ off the United States, Pentagon says  —  The Pentagon on Wednesday flatly dismissed claims by a U.S. lawmaker that Iran might be launching drones over New Jersey from a “mothership” off the East Coast.  —  “There is no truth to that,” said Pentagon spokesperson Sabrina Singh.",
    "url": "https://www.reuters.com/world/us/no-iranian-drone-mothership-off-united-states-launching-drones-pentagon-says-2024-12-11/"
  },
  {
    "text": "Ex-F.B.I. Informant Agrees to Plead Guilty to Lying About Bidens  —  Alexander Smirnov's deal with the special counsel overseeing the investigation into Hunter Biden could lead to 48 to 72 months in prison, though a federal judge would need to review the deal.",
    "url": "https://www.nytimes.com/2024/12/12/us/politics/smirnov-bidens-russia.html"
  },
  {
    "text": "China's Xi not expected at Trump's inauguration  —  Chinese President Xi Jinping is not expected to travel to Washington next month as an inauguration guest of President-elect Donald Trump, according to two sources familiar with the planning.  CBS News was first to report that Trump … ",
    "url": "https://www.cbsnews.com/news/chinas-xi-not-expected-trump-inauguration/"
  },
  {
    "text": "Pete Hegseth, Trump's Defense pick, says allowing gay troops to serve openly reflects a Marxist agenda  —  Pete Hegseth, President-elect Donald Trump's pick for secretary of defense, has repeatedly criticized policies allowing gay people to serve openly in the US military, calling them part of a … ",
    "url": "https://www.cnn.com/2024/12/12/politics/pete-hegseth-gay-trans-troops-marxist-agenda/"
  },
  {
    "text": "Trump's Kari Lake ‘pick’ sparks fears at Voice of America  —  Presidents don't ordinarily pick the director of Voice of America, an international news broadcaster funded by the US government.  But President-elect Donald Trump says he wants his ally Kari Lake to take over VOA.",
    "url": "https://www.cnn.com/2024/12/12/media/kari-lake-voa-trump/"
  },
  {
    "text": "House Republicans launch investigation into CVS Caremark for potential antitrust violations  —  House Republicans want to know whether pharmacy benefit manager (PBM) CVS Caremark violated federal antitrust laws by threatening independent pharmacies to keep them from using money-saving tools outside the PBM's network.",
    "url": "https://thehill.com/policy/healthcare/5037786-house-republicans-launch-investigation-into-cvs-caremark-for-potential-antitrust-violations/"
  },
  {
    "text": "Democrats Lost the Propaganda War  —  The party used up about $5 billion on political ads in 2024.  There's a better way.  —  A Fox News ad is displayed outside the Fiserv Forum on the eve of the Republican National Convention, July 14, 2024, in Milwaukee.",
    "url": "https://prospect.org/politics/2024-12-12-democrats-lost-propaganda-war/"
  },
  {
    "text": "Blue States are Unaffordable.  The Price Will be Political.  —  Every year, millions of Americans bounce around the country like electrons, moving from one state to another.  But there are patterns in this chaos, and one of the clearest in recent decades is that Americans are moving from blue states to red states.",
    "url": "https://www.nytimes.com/2024/12/12/opinion/democrats-republicans-electoral-college.html"
  },
  {
    "text": "U.S. charges 14 North Koreans in $88 million identity theft and extortion case … The Department of Justice accused 14 North Korean nationals of conspiring to use false identities to get IT jobs with U.S. companies and siphon money back to their home country in violation of U.S. sanctions.",
    "url": "https://www.cnbc.com/2024/12/12/north-koreans-charged-identity-theft-extortion-conspiracy-doj.html"
  },
  {
    "text": "‘My God there is light’: CNN witnesses moment Syrian prisoner is freed from Assad's forced detention  —  While searching a secretive prison in the belly of the Assad regime's legacy of torture for American journalist Austin Tice, CNN's Clarissa Ward made a startling discovery … ",
    "url": "https://www.cnn.com/2024/12/11/world/video/syrian-prisoner-freed-clarissa-ward-digvid"
  },
  {
    "text": "Why The Onion's Infowars bid has been blocked — for now  —  The satirical newspaper's plans to remake Alex Jones's conspiracy theories outlet have hit a roadblock. … In November, satirical newspaper The Onion won a bankruptcy auction to purchase Infowars, a website dedicated to hawking anti-government conspiracy theories.",
    "url": "https://www.vox.com/politics/390953/the-onion-infowars-alex-jones"
  },
  {
    "text": "Trump Backtracks On Campaign Pledge To Bring Down Grocery Prices  —  The president-elect walked back what was always a wildly unrealistic campaign promise.  —  LOADING  —  President-elect Donald Trump admitted in an interview with Time magazine that it will be difficult for him to reduce consumer prices … ",
    "url": "https://www.huffpost.com/entry/donald-trump-walks-back-prices-down_n_675af8f3e4b04606476ba6cd"
  },
  {
    "text": "Hundreds of student-loan borrowers who applied for debt cancellation are being denied relief by a major lender, over 20 Democratic lawmakers say  — Sen. Elizabeth Warren led over 20 colleagues in requesting the CFPB and FTC investigate student-loan company Navient.",
    "url": "https://www.businessinsider.com/student-loan-borrowers-denied-debt-cancellation-navient-fraud-elizabeth-warren-2024-12"
  },
  {
    "text": "Newly elected West Virginia lawmaker arrested and accused of making terroristic threats  —  A newly elected state lawmaker in West Virginia is facing at least one felony and is accused of making terroristic threats.  Joseph de Soto, 61, was arrested by state police Thursday in Martinsburg following … ",
    "url": "https://apnews.com/article/joesph-de-soto-west-virginia-lawmaker-arrest-terroristic-threats-2136a13f4cd42293f3274ab75aa5ba21"
  },
  {
    "text": "Los Angeles Times Owner Wades Deeper Into Opinion Section  —  Dr. Patrick Soon-Shiong's public comments and actions, including recently blocking an editorial weighing in on President-elect Trump's cabinet picks, have concerned many staff members.  —  After President-elect Donald J. Trump announced … ",
    "url": "https://www.nytimes.com/2024/12/12/business/media/la-times-patrick-soon-shiong.html"
  },
  {
    "text": "UK Tory leader: Sandwiches aren't real  —  Kemi Badenoch “will not touch bread if it's moist.”  —  Britain's Conservative Leader Kemi Badenoch kicked off a heated political debate about a lunchtime favorite Thursday after declaring that sandwiches are not “a real food.”",
    "url": "https://www.politico.eu/article/uk-tory-leader-sandwiches-not-real-kemi-badenoch/"
  },
  {
    "text": "'It'll Be Brutal': Inside Trump's Planned War on Leakers and the Press  —  Trump 2.0 will feature more media subpoenas, communications seizures, whistleblower prosecutions, and personal lawsuits against news outlets … As BuzzFeed reported at the time, “Immigration and Customs Enforcement … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-war-press-media-leaks-1235202909/"
  }
]