[
  {
    "text": "Voters Doubt Biden's Leadership and Favor Trump, Times/Siena Poll Finds  —  The share of voters who strongly disapprove of President Biden's handling of his job has reached 47 percent, higher than in Times/Siena polls at any point in his presidency.  —  President Biden is struggling … ",
    "url": "https://www.nytimes.com/2024/03/02/us/politics/biden-trump-times-siena-poll.html"
  },
  {
    "text": "For Democrats Pining for an Alternative, Biden Team Has a Message: Get Over It  —  A new poll shows that nearly two in five Democrats say that the president should not be their nominee.  But no one who matters to the president seems willing to suggest he step aside.",
    "url": "https://www.nytimes.com/2024/03/02/us/politics/biden-poll.html"
  },
  {
    "text": "Israel has agreed to the framework for a Gaza cease-fire, the US says.  Hamas now must decide  —  (March 1) (AP Video by Mohammad Hajjar, production by Wafaa Shurafa)  —  Biden approves military air drops of aid into Gaza after chaotic encounter left more than 100 dead",
    "url": "https://apnews.com/article/israel-hamas-war-news-03-02-2024-531593c27931a2764357b6f7b11ce394"
  },
  {
    "text": "US military aircraft airdrop thousands of meals into Gaza in emergency humanitarian aid operation  —  U.S. military C-13 cargo planes dropped food in pallets over Gaza on Saturday in the opening stage of an emergency humanitarian assistance authorized by President Joe Biden after more than 100 Palestinians … ",
    "url": "https://apnews.com/article/israel-hamas-gaza-airdrop-humanitarian-assistance-f8bc071193f89906abf21478bc70a084"
  },
  {
    "text": "Israel Helped Organize Convoy That Ended in Disaster  —  It was one of four convoys organized by local Palestinian businessmen this week at the behest of Israeli officials, who promised to provide security.  —  Here's what we're covering:  —  Gaza aid convoy that ended in death was part of a new Israeli operation.",
    "url": "https://www.nytimes.com/live/2024/03/02/world/israel-hamas-war-gaza-news"
  },
  {
    "text": "“Better than Jesus”: How far will the cult of Trump go?  —  MAGA has “been persuaded,” Katherine Stewart tells Salon, “that Trump is the savior who will face down the demons”  —  Donald Trump is a human chaos engine.  It is a function of both his personality and his politics.",
    "url": "https://www.salon.com/2024/03/02/better-than-jesus-how-far-will-the-of-go/"
  },
  {
    "text": "Offensive comments by N.C. Republican stand out even in Trump's party  —  Mark Robinson is favored to win the Republican nomination for governor in a battleground state, even as some see serious liabilities for November.  —  OCEAN ISLE BEACH, N.C. — Surrounded by fans at a beach town bar, Mark Robinson addressed his absent critics.",
    "url": "https://www.washingtonpost.com/elections/2024/03/02/mark-robinson-governor-candidate-north-carolina-offensive-comments/"
  },
  {
    "text": "The Fani Willis Evidentiary Hearing Was a Joke  —  The hearing to determine whether the Fulton County DA should be disqualified is literally is a product of one of the people under indictment.  —  (Permanent musical accompaniment to the last post of the week from the shebeen's favourite living Canadian.)",
    "url": "https://www.esquire.com/news-politics/politics/a60051168/fani-willis-hearing-fulton-county-da/"
  },
  {
    "text": "Chris Hayes Hits Fox For ‘Deluge’ Of Fearmongering Over Manufactured Crisis  —  Fox does this every time there's an election coming up.  Good for Chris Hayes for pointing out just how manipulative and cynical they are.  —  Can you help us out?  —  For nearly 20 years we have been exposing Washington lies … ",
    "url": "https://crooksandliars.com/2024/03/chris-hayes-hits-fox-deluge-fearmongering"
  },
  {
    "text": "“Department of Life”: Trump allies plot abortion crackdown for second term … - Heritage's detailed plans underscore conservatives' long-held grievances toward the Department of Health and Human Services — at a time when they are well-positioned to sway abortion policy if Trump wins again.",
    "url": "https://www.axios.com/2024/03/02/heritage-foundation-trump-allies-abortion"
  },
  {
    "text": "Price fixing by algorithm is still price fixing  —  Landlords and property managers can't collude on rental pricing.  Using new technology to do it doesn't change that antitrust fundamental.  Regardless of the industry you're in, if your business uses an algorithm to determine prices … ",
    "url": "https://www.ftc.gov/business-guidance/blog/2024/03/price-fixing-algorithm-still-price-fixing"
  },
  {
    "text": "House Republicans often vote no on spending, but love to add pet projects  —  Of the four congressional caucuses, House GOP has most money set aside for members' earmarks  —  Despite their public posture of advocating for lower government spending, House Republicans have billions more at stake … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/02/house-republicans-earmarks-government-funding/"
  },
  {
    "text": "Trump wins Michigan GOP convention  —  Former President Trump is projected to win the Michigan Republican convention after winning the state's GOP primary earlier this week, according to results from Decision Desk HQ (DDHQ).  —  The numbers deliver another, albeit expected, blow to rival Nikki Haley … ",
    "url": "https://thehill.com/homenews/campaign/4500512-trump-wins-michigan-gop-convention/"
  },
  {
    "text": "Vindman: Trump has ‘every intention’ to undo American democracy if reelected  —  Retired Army Lt. Col. Alexander Vindman suggested Friday that President Trump has “every intention” to undo American democracy if reelected, as concerns rise over whether the former president would launch revenge campaign in a second term.",
    "url": "https://thehill.com/homenews/campaign/4503490-vindman-trump-intention-undo-american-democracy-if-reelected/"
  },
  {
    "text": "As Trump's Criminal Trial Approaches, He May Be His Own Worst Enemy  —  In civil cases, Donald J. Trump has ordered attorneys around from the defense table and insisted on testifying.  The stakes will get higher March 25, when his first criminal case begins.",
    "url": "https://www.nytimes.com/2024/03/02/nyregion/donald-trump-lawyers.html"
  },
  {
    "text": "Nikki Haley's pitch to donors has everything but a plan to defeat Trump  —  Even behind closed doors, Haley isn't sharing details for how she gets to the general election.  —  WASHINGTON, D.C. — Nikki Haley has crisscrossed the country in the days leading up to Super Tuesday with a private pitch … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-pitch-donors-trump-rcna141384"
  }
]