[
  {
    "text": "Trump Plans to Skip G.O.P. Debate for Interview With Tucker Carlson  —  The former president's apparent decision to skip the first debate is a major affront both to the Republican National Committee and to Fox News, which is hosting the event.  —  Former President Donald J. Trump plans … ",
    "url": "https://www.nytimes.com/2023/08/18/us/politics/trump-debate-tucker-carlson.html"
  },
  {
    "text": "FACT SHEET: The Trilateral Leaders' Summit at Camp David  —  President Biden welcomed Japanese Prime Minister Kishida and Republic of Korea (ROK) President Yoon to a historic trilateral summit at Camp David, the first-ever stand-alone summit of Leaders from the United States, Japan, and the ROK … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/08/18/fact-sheet-the-trilateral-leaders-summit-at-camp-david/"
  },
  {
    "text": "A Jan. 6 defendant scheduled to be sentenced on Friday is now missing  —  WASHINGTON — Christopher Worrell, a Florida Proud Boy convicted on seven counts stemming from his actions during the Jan. 6 riot, was scheduled to be sentenced today in Washington, D.C, federal court but is now missing … ",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-defendant-scheduled-sentenced-friday-now-missing-rcna100677"
  },
  {
    "text": "Proud Boy on house arrest in Jan. 6 case disappears ahead of sentencing  —  Authorities are searching for a member of the Proud Boys extremist group who disappeared days before his sentencing in a U.S. Capitol riot case, where prosecutors are seeking more than a decade in prison, according to a warrant made public Friday.",
    "url": "https://apnews.com/article/jan-6-capitol-attack-proud-boy-1341d4596fb96ee2828b54d70ef7e126"
  },
  {
    "text": "Exclusive: James O'Keefe Is Now Under Investigation for Looting Project Veritas  —  Prosecutors in Westchester County, N.Y., are pursuing charges against the right's premiere “gotcha video” scammer, for scamming his own donors.  —  Pocket  —  James O'Keefe, the founder and until … ",
    "url": "https://www.thenation.com/article/society/james-okeefe-criminal-investigation-project-veritas/"
  },
  {
    "text": "DeSantis meets privately with Kemp in Georgia  —  The meeting follows Donald Trump's indictment in the state.  —  Ron DeSantis met privately with Georgia Gov. Brian Kemp on Friday, the latest in his effort to fortify relationships with three Republican governors alienated by Donald Trump.",
    "url": "https://www.politico.com/news/2023/08/18/desantis-campaign-georgia-governor-kemp-00111911"
  },
  {
    "text": "Our collective malady: Donald Trump's mental health crisis is America's problem  —  Experts: Trump's “denial of reality” and “primitive projections” are imploding.  He's even more dangerous  —  To properly respond to Donald Trump and the level of extreme danger he represents … ",
    "url": "https://www.salon.com/2023/08/18/our-collective-malady-donald-mental-health/"
  },
  {
    "text": "Von der Leyen condemns Turkish Cypriot attack on UN peacekeepers  —  The European Commission President Ursula von der Leyen joined the U.K., France and the U.S. in expressing shock and disapproval over an assault on U.N. peacekeepers on Cyprus by Turkish Cypriots.",
    "url": "https://www.politico.eu/article/von-der-leyen-condemns-turkish-cypriot-attack-on-un-peacekeepers/"
  },
  {
    "text": "Congressman Matt Gaetz Introduces Resolution to Censure Judge Tanya Chutkan for Exhibiting Open Bias and Partisanship in Her Official Duties  —  Washington, D.C. — Today, U.S. Congressman Matt Gaetz (FL-01) will introduce a resolution to censure and condemn United States District Court Judge Tanya Chutkan … ",
    "url": "https://gaetz.house.gov/media/press-releases/congressman-matt-gaetz-introduces-resolution-censure-judge-tanya-chutkan"
  },
  {
    "text": "James Buckley, conservative politician and U.S. senator, dies at 100  —  In political circles, Mr. Buckley was perhaps best remembered as the lead plaintiff in a landmark campaign finance lawsuit — Buckley v. Valeo — that in 1976 unraveled part of the post-Watergate regulation of political money",
    "url": "https://www.washingtonpost.com/obituaries/2023/08/18/james-buckley-valeo-obit/"
  },
  {
    "text": "Rupert Murdoch encouraged Virginia's Glenn Youngkin to seek presidency  —  CORRECTION  —  A previous version of this article incorrectly said that Fox News settled a lawsuit by Dominion Voting Systems for nearly $788 billion.  The settlement was for nearly $788 million.  The article has been corrected.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/18/rupert-murdoch-glenn-youngkin-fox-news-presidency/"
  },
  {
    "text": "Trump attorneys, Fulton County DA expected to meet next week: Sources  —  The attorneys and DA are expected to negotiate terms of Trump's bond package.  —  Attorneys for former President Donald Trump are expected to meet early next week with the Fulton County district attorney's office … ",
    "url": "https://abcnews.go.com/US/trump-attorneys-fulton-county-da-expected-meet-week/story?id=102369420"
  },
  {
    "text": "Arizona Investigators ‘Aggressively’ Looking at Top Trump Ally Kelli Ward  —  The fake elector, and one of the state's most prominent Republicans, is in the crosshairs of a criminal probe into the scheme to steal the election … The Arizona probe has been accelerating in the past several weeks … ",
    "url": "https://www.rollingstone.com/politics/politics-features/kelli-ward-crosshairs-arizona-fake-electors-investigation-1234808925/"
  },
  {
    "text": "Biden says special counsel probe of his son is ‘up to the Justice Department’  —  President Biden on Friday offered his first public comments on the appointment of a special counsel to oversee an investigation into his son, Hunter Biden.  —  “I have no comment on any investigation that's going on.",
    "url": "https://thehill.com/homenews/administration/4159153-biden-says-special-counsel-probe-of-his-son-is-up-to-the-justice-department/"
  },
  {
    "text": "Biden to sign strategic partnership deal with Vietnam in latest bid to counter China in the region  —  The new strategic partnership agreement opens the door to closer diplomatic, economic and technological cooperation with former foe — and China's neighbor — Hanoi.",
    "url": "https://www.politico.com/news/2023/08/18/biden-vietnam-partnership-00111939"
  },
  {
    "text": "Golden's ‘Blue Dogs’ get money from Sallie Mae after opposing student debt relief  —  The Blue Dog Coalition, a group of corporate House Democrats led by Rep. Jared Golden, received the maximum donation from student lending giant Sallie Mae after the Second District congressman voted earlier … ",
    "url": "https://mainebeacon.com/goldens-blue-dogs-get-money-from-sallie-mae-after-opposing-student-debt-relief/"
  }
]