[
  {
    "text": "Trump Asks Supreme Court for Absolute Immunity on Election Charges  —  The court will hear arguments on April 25 over whether former presidents can be prosecuted for things they did while in office.  —  Former President Donald J. Trump urged the Supreme Court on Tuesday to rule … ",
    "url": "https://www.nytimes.com/2024/03/19/us/trump-supreme-court-immunity.html"
  },
  {
    "text": "Why Won't Rich Republicans Loan Money to Upstanding Businessman Donald Trump? … The Republican Party is united in its belief that Donald Trump's court-ordered financial distress is the product of Democratic Party “lawfare.”  Liberal prosecutors and courts have set out to persecute … ",
    "url": "https://nymag.com/intelligencer/article/donald-trump-fines-broke-court-fraud-rich-republicans-loan.html"
  },
  {
    "text": "Doug Emhoff Decries ‘Antisemitic’ Trump Comments on Jewish Democrats  — Husband of Vice President Harris visited Omaha on Tuesday  — Trump's remarks widely condemned by Jewish groups, Democrats  —  Second gentleman Doug Emhoff condemned Republican Donald Trump for accusing Jews … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-19/emhoff-decries-antisemitic-trump-comments-on-jewish-democrats"
  },
  {
    "text": "Trump can't find anyone to spot him $464 million.  Would you?  —  Of course no one will lend Donald Trump the half-billion dollars he needs to put up while appealing his fraud case.  Would you?  —  In recent months, the former president has racked up a series of costly legal judgments for his many misdeeds.",
    "url": "https://www.washingtonpost.com/opinions/2024/03/18/trump-civil-fraud-case-appeal-bond/"
  },
  {
    "text": "Peter Navarro is 1st Trump White House official to serve prison time related to Jan. 6 attack  —  Former White House adviser Peter Navarro reported to prison Tuesday for a contempt of Congress conviction, becoming the first senior Trump administration official to be locked up for a crime related to the Jan. 6, 2021, Capitol attack.",
    "url": "https://apnews.com/article/peter-navarro-jan-6-prison-congress-contempt-ea6f0e60dda1a7bcaef31012cd2c7678"
  },
  {
    "text": "Mar-a-Lago Judge's Stark Ruling: Jury Sees Secret Files or Trump Wins  —  Trump-appointed Judge Aileen Cannon handed the jury in his Mar-a-Lago case a shocking ultimatum on Monday.  —  The MAGA-friendly federal judge who keeps siding with Donald Trump in his Mar-a-Lago classified records case … ",
    "url": "https://www.thedailybeast.com/mar-a-lago-judge-rules-jury-sees-top-secret-files-or-trump-wins"
  },
  {
    "text": "Judge in Trump classified documents case proposes ‘insane’ jury instructions, experts say  —  U.S. District Judge Aileen Cannon proposed to instruct jurors a president has sole authority to declare records personal, which legal experts say would amount to dismissing the case against Trump.",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/19/donald-trump-classified-documents-jury-instructions/73027873007/"
  },
  {
    "text": "Judge in Trump Documents Case Draws Attention for Slow Pace  —  Aileen Cannon has yet to set a trial date in the complex case accusing Donald J. Trump of mishandling classified materials, and has stirred confusion with some decisions.  —  Two and a half weeks after holding a hearing to pick … ",
    "url": "https://www.nytimes.com/2024/03/19/us/politics/aileen-cannon-trump-documents.html"
  },
  {
    "text": "Jared Kushner says Gaza's ‘waterfront property could be very valuable’  —  Donald Trump's son-in-law also says Israel should bulldoze an area of the Negev desert and move Palestinians there  —  Jared Kushner has praised the “very valuable” potential of Gaza's “waterfront property” … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/19/jared-kushner-gaza-waterfront-property-israel-negev"
  },
  {
    "text": "Supreme Court allows Texas to enforce immigration law  —  The Biden administration sued to block the law, saying it tramples on the federal government's exclusive authority to oversee immigration issues.  —  WASHINGTON — The Supreme Court on Tuesday allowed Texas to enforce a contentious … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-texas-enforce-immigration-law-rcna142971"
  },
  {
    "text": "Supreme Court allows Texas to begin enforcing controversial immigration law  —  The Supreme Court on Tuesday cleared the way for Texas to immediately begin enforcing a controversial immigration law that allows state officials to arrest and detain people they suspect of entering the country illegally.",
    "url": "https://www.cnn.com/2024/03/19/politics/supreme-court-allows-texas-to-begin-enforcing-controversial-immigration-law/"
  },
  {
    "text": "Inside the Biden effort to recruit Nikki Haley donors to help defeat Donald Trump  — President Joe Biden's team is successfully recruiting some former donors to Nikki Haley's campaign.  — With Haley formally out the of the primary race, this effort has gone into overdrive.",
    "url": "https://www.cnbc.com/2024/03/19/biden-campaign-recruits-nikki-haley-donors-to-help-defeat-donald-trump.html"
  },
  {
    "text": "Trump sues ABC and Stephanopoulos, alleging defamation over Mace interview  —  Former President Trump sued ABC News and George Stephanopoulos, alleging defamation over the anchor's questioning of Rep. Nancy Mace (R-S.C.) about her endorsement of Trump.  —  The March 10 interview on “This Week” … ",
    "url": "https://thehill.com/regulation/court-battles/4541257-trump-sues-abc-stephanopoulos-alleging-defamation-mace-interview/"
  },
  {
    "text": "Trump Golf Club Settlement Hangs Alina Habba Out to Dry  —  The former president's lawyer may still face fallout for her involvement in an ex-employee's hush money deal over harassment claims at Trump's Bedminster club. … Donald Trump's golf club in Bedminster, New Jersey … ",
    "url": "https://www.thedailybeast.com/trump-new-jersey-golf-club-settlement-hangs-lawyer-alina-habba-out-to-dry"
  },
  {
    "text": "Brazil's Bolsonaro is indicted for first time over alleged falsification of his own vaccination data  —  Former Brazilian President Jair Bolsonaro was formally accused Tuesday of falsifying his COVID-19 vaccination data, marking the first indictment for the embattled far-right leader, with more allegations potentially in store.",
    "url": "https://apnews.com/article/bolsonaro-brazil-federal-police-indicted-covid-a0c1f1dba71553096d0de0f4f39d4caa"
  },
  {
    "text": "Mississippi ex-deputy gets 20-year sentence in racist torture of two Black men  —  A former Mississippi sheriff's deputy was sentenced Tuesday to about 20 years in prison for his part in torturing two Black men last year.  Hunter Elward was sentenced by U.S. District Judge Tom Lee … ",
    "url": "https://apnews.com/article/mississippi-goon-squad-sentencing-d2eb6ba7e2f337ac1f17035cc97f2934"
  },
  {
    "text": "GOP state House speakers face tide of challenges from the right  —  Powerful Republican legislators in three states are facing challenges aimed at removing them from power, as ideological and personal divides rend the GOP.  —  COLUMBUS, Ohio — Republican state House speakers in at least three states … ",
    "url": "https://www.nbcnews.com/politics/2024-election/gop-state-house-speakers-face-tide-challenges-right-rcna143322"
  },
  {
    "text": "Nebraska lawmaker faces calls to resign after invoking colleague's name in book's rape scene passage  —  Republican Nebraska state Sen. Steve Halloran later defended reading the graphic text but apologized for adding his colleague's name to it.  —  Republican Nebraska state Sen. Steve Halloran … ",
    "url": "https://www.nbcnews.com/politics/politics-news/nebraska-lawmaker-faces-calls-resign-invoking-colleagues-name-books-ra-rcna144050"
  },
  {
    "text": "Arizona state rep resigns after report on sexual misconduct violation  —  An Arizona state representative has resigned from his role after a news report uncovered how he was sanctioned for sexual misconduct nine years ago while in college.  —  “Today and every day, I take responsibility for my actions … ",
    "url": "https://thehill.com/homenews/state-watch/4542778-arizona-state-rep-resigns-after-report-on-sexual-misconduct-violation/"
  },
  {
    "text": "Montana Supreme Court allows abortion ballot proposal to proceed  —  The ruling says Attorney General Austin Knudsen erred in finding the proposal for the 2024 ballot ‘legally insufficient.’  — Click to email a link to a friend (Opens in new window)  —  Thank you for being a member of Montana Free Press.",
    "url": "https://montanafreepress.org/2024/03/18/montana-supreme-court-allows-abortion-ballot-proposal-to-proceed/"
  },
  {
    "text": "Pro-Trump Michigan attorney arrested after hearing in DC over leaking Dominion documents  —  An attorney facing criminal charges for illegally accessing Michigan voting machines after the 2020 election was arrested Monday after a hearing in a separate case in federal court in Washington, D.C.",
    "url": "https://apnews.com/article/voting-machines-dominion-defamation-68d3f3a4e840ccb7a81d72837c4f6b3e"
  },
  {
    "text": "Trump II Architect Russ Vought Embraces A Christian Nationalist Vision For America  —  One of the key architects of Donald Trump's plans for a second administration has been quite public about the driving force animating that radical agenda: a “cold civil war” to be won by those willing to use … ",
    "url": "https://talkingpointsmemo.com/news/russ-vought"
  },
  {
    "text": "GOP House candidate says to ‘disregard’ mass email conceding defeat  —  A Republican running for Congress in Ohio mistakenly announced that he had conceded defeat before, less than 10 minutes later, the campaign said to “disregard the email.”  —  “Tonight did not go as we had hoped, but as we know, this race is decided in the primary.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/2928795/gop-house-candidate-disregard-mass-email-conceding-defeat/"
  },
  {
    "text": "Bad Journalism Is Giving Life to the “Fetal Personhood” Lie  —  For years, reproductive-justice activists have been warning that the GOP's “fetal personhood” bills would endanger access to birth control and fertility treatment—especially IVF.  Why hasn't the media taken them to task?",
    "url": "https://www.damemagazine.com/2024/03/19/bad-journalism-is-giving-life-to-the-fetal-personhood-lie/"
  },
  {
    "text": "The Bloodbath Candidate  —  In Context, Trump is Worse  —  At a rally in Vandalia, Ohio last Saturday, Trump promised a “bloodbath for the country” if he's not elected president.  —  Then followed a predictable bout of (self-)deception, the claim that Trump's bloodbath was out of context.",
    "url": "https://snyder.substack.com/p/the-bloodbath-candidate"
  },
  {
    "text": "‘Message must be sent’: Jail terms almost tripled for climate activists who shut down West Gate Bridge  —  Two climate activists who blocked peak-hour traffic on the West Gate Bridge, causing a woman to give birth on the side of the road, have had their jail terms almost tripled on appeal.",
    "url": "https://www.theage.com.au/national/victoria/message-must-be-sent-jail-terms-almost-tripled-for-climate-activists-who-shut-down-west-gate-bridge-20240319-p5fdh5.html"
  },
  {
    "text": "The U.S. crime rate is still dropping, FBI data shows  —  Why does the public think it's going up?  “There is definitely more disorder in cities than there was five years ago,” said one expert.  “People confuse disorder and crime.”  —  New FBI data confirms previous indications that crime … ",
    "url": "https://www.nbcnews.com/news/crime-courts/us-crime-rate-still-dropping-says-fbi-rcna144100"
  }
]