[
  {
    "text": "NBC News to drop ex-RNC chair Ronna McDaniel after Rachel Maddow, ‘Morning Joe’ revolt  —  NBC News plans to drop former Republican National Committee boss Ronna McDaniel as a paid contributor after network stars including MSNBC prime time headliner Rachel Maddow and the co-hosts of “Morning Joe” … ",
    "url": "https://nypost.com/2024/03/26/media/nbc-news-to-drop-ex-rnc-chair-ronna-mcdaniel-after-rachel-maddow-morning-joe-revolt/"
  },
  {
    "text": "Mick Mulvaney defends Ronna McDaniel amid NBC turmoil  —  Former White House chief of staff Mick Mulvaney is dismissing criticism NBC News is facing from some of the network's biggest stars over its decision to hire former Republican National Committee Chair Ronna McDaniel as a paid contributor.",
    "url": "https://thehill.com/homenews/media/4556337-mick-mulvaney-ronna-mcdaniel-nbc-news-msnbc/"
  },
  {
    "text": "‘Biden bump is real’: president gains on Trump in six battleground states  —  Biden now leads Trump in Wisconsin, Arizona, Georgia, Nevada and North Carolina, and is tied in Pennsylvania, new poll shows  —  Joe Biden had some good news on Tuesday as polling showed him gaining on Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/26/election-trump-biden-latest-polls"
  },
  {
    "text": "Biden Gains Ground Against Trump in Six Key States, Poll Shows  —  The move in the president's direction comes after five months of mostly consistent Trump leads.  —  President Joe Biden has gained ground against Republican Donald Trump in six of seven key swing states, and significantly so in at least two of them.",
    "url": "https://www.bloomberg.com/news/articles/2024-03-26/election-2024-poll-biden-gains-on-trump-in-six-swing-states"
  },
  {
    "text": "Key Bridge collapses into Patapsco River in Baltimore after vessel hits support column; state of emergency declared  —  Baltimore's Francis Scott Key Bridge collapsed early Tuesday after a container ship struck a support column, sending at least seven cars into the Patapsco River … ",
    "url": "https://www.baltimoresun.com/2024/03/26/key-bridge-collapses-into-patapsco/"
  },
  {
    "text": "Baltimore bridge collapses after powerless cargo ship rams into support column; 6 people are missing  —  A container ship lost power and rammed into a major bridge in Baltimore early Tuesday, causing it to snap and plunge into the river below.  Several vehicles fell into the chilly waters, and rescuers are searching for survivors.",
    "url": "https://apnews.com/article/baltimore-bridge-collapse-53169b379820032f832de4016c655d1b"
  },
  {
    "text": "Supreme Court skeptical of limiting access to abortion pill  —  The Supreme Court on Tuesday seemed skeptical of efforts to limit access to mifepristone, a key medication used in more than 60 percent of U.S. abortions and first approved more than two decades ago.",
    "url": "https://www.washingtonpost.com/politics/2024/03/26/abortion-pill-supreme-court-arguments-mifepristone/"
  },
  {
    "text": "Erin Hawley: The Woman Arguing Against the Abortion Pill  —  Erin Hawley is best known as the wife of Senator Josh Hawley, but now the spotlight is on her in a Supreme Court case.  —  It was 2014, and Erin Morrow Hawley was fighting against the egg-laying hens of Missouri.",
    "url": "https://www.nytimes.com/2024/03/26/us/erin-hawley-abortion-pill-supreme-court.html"
  },
  {
    "text": "Ken Paxton agrees to community service, paying restitution to avoid trial in securities fraud case  —  Paxton, who will not have to enter a plea under the terms of the agreement, faced the prospect of decades in prison if he had been convicted of fraud.  —  HOUSTON — Prosecutors on Tuesday agreed … ",
    "url": "https://www.texastribune.org/2024/03/25/ken-paxton-plea-deal-securities-fraud-felony/"
  },
  {
    "text": "Texas Attorney General Ken Paxton Reaches Deal to Avoid Criminal Trial  —  Nearly a decade after his indictment for securities fraud, Mr. Paxton will pay restitution, take legal ethics classes and do community service as part of an agreement with prosecutors.",
    "url": "https://www.nytimes.com/2024/03/26/us/politics/texas-attorney-general-ken-paxton-texas-plea-deal-securities-fraud.html"
  },
  {
    "text": "Judge Imposes Gag Order on Trump in Manhattan Criminal Trial  —  The order limiting the former president's speech came the day after Justice Juan M. Merchan set an April 15 trial date for the hush-money case.  —  The New York judge presiding over one of Donald J. Trump's criminal trials imposed … ",
    "url": "https://www.nytimes.com/2024/03/26/nyregion/trump-trial-gag-order.html"
  },
  {
    "text": "Alina Habba mocks New York AG after appeals court reduces Trump bond  —  Alina Habba, attorney to former President Donald Trump, mocked New York Attorney General Letitia James, after an appeals court significantly reduced the cost of a bond he must pay while he appeals his multimillion-dollar civil fraud penalty.",
    "url": "https://thehill.com/regulation/court-battles/4556222-habba-mocks-new-york-ag-appeals-court-reduces-trump-bond/"
  },
  {
    "text": "California Pizza Chains Plan Layoffs in Advance of New $20 Minimum Wage  —  Who could possibly have seen this coming?  California's minimum wage for fast food workers is going up next week and some chains are already planning layoffs in response.  Newsom signed the bill raising the minimum wage last September.",
    "url": "https://hotair.com/john-s-2/2024/03/25/california-pizza-chains-plan-layoffs-in-advance-of-new-20-minimum-wage-n3785346"
  },
  {
    "text": "Truth Social Stock Price Surges on First Day of Trading, Increasing Trump's Fortune  —  Board members including Donald Trump's son and former cabinet members will decide when he can cash in  —  Shares of Donald Trump's social-media company surged about 30% on their first day of trading, boosting the presidential candidate's fortune.",
    "url": "https://www.wsj.com/finance/truth-social-stock-trades-dwac-trump-18a6cd74"
  },
  {
    "text": "Trump co-defendant Michael Roman subpoenaed, Kenneth Chesebro interviewed in Arizona 2020 election probe: Sources  —  The subpoena is part of the Arizona AG's probe into the “fake elector” plot.  —  Michael Roman is seen in a mugshot provided by the Fulton County Sheriff's Office in Georgia, Aug. 25, 2023.",
    "url": "https://abcnews.go.com/US/trump-defendant-michael-roman-subpoenaed-kenneth-chesebro-interviewed/story?id=108389941"
  },
  {
    "text": "The RNC's Fundraising Hole Is Even Deeper Than It Looks  —  MONEY PIT  —  The Republican National Committee is already way behind in the money wars for the 2024 election.  But it's even worse than almost anyone knows.  —  It's no secret that the Republican National Committee is in dire financial straits.",
    "url": "https://www.thedailybeast.com/the-rncs-fundraising-hole-is-even-deeper-than-it-looks"
  },
  {
    "text": "‘Feeble, Confused And Tired’: Donald Trump Torched After Bizarre Gaffe-Filled Appearance  —  The former president delivered a rambling performance as his legal battles heat up.  —  LOADING  —  President Joe Biden's campaign on Monday released an unusually blunt statement tearing into Donald Trump as … ",
    "url": "https://www.huffpost.com/entry/trump-feeble-gaffes_n_660263bde4b0269c5d2d12ac"
  },
  {
    "text": "RFK Jr. intends to name attorney Nicole Shanahan as his VP pick  —  The attorney and entrepreneur, like Kennedy himself, has never run for elected office, but she has contributed to his campaign and allied super PAC.  —  Independent presidential candidate Robert F. Kennedy Jr. intends … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jr-intends-name-attorney-nicole-shanahan-vp-pick-rcna144983"
  },
  {
    "text": "Bowman reverses after calling reports of Oct. 7 sexual assaults in Israel ‘propaganda’  —  In a statement Thursday, the New York Democrat said: “The UN confirmed that Hamas committed rape and sexual violence, a reprehensible fact that I condemn entirely.”",
    "url": "https://www.politico.com/live-updates/2024/03/26/congress/bowman-house-israel-october-7-sexual-assault-hamas-00148426"
  },
  {
    "text": "Sexual assault lawsuit against Matt Schlapp is dropped  —  In a statement, the man who accused the ACU header said he regretted bringing the suit.  —  The Republican operative who accused the American Conservative Union head Matt Schlapp of sexual assault has dropped his lawsuits against him and his wife … ",
    "url": "https://www.politico.com/news/2024/03/26/sexual-assault-lawsuit-matt-schlapp-00149100"
  },
  {
    "text": "Trump is selling $60 Bibles with ‘God Bless the U.S.A.’ singer Lee Greenwood … Republican presidential candidate and former President Donald Trump at a campaign rally in Rochester, New Hampshire on January 21, 2024 .  —  Donald Trump on Tuesday started promoting a line of pricey Bibles … ",
    "url": "https://www.cnbc.com/2024/03/26/trump-selling-60-god-bless-the-usa-bibles-with-lee-greenwood.html"
  }
]