[
  {
    "text": "House GOP releases Biden impeachment inquiry resolution ahead of planned vote  —  The House GOP released a resolution Thursday to formalize its months-long impeachment inquiry into President Biden, with a full House vote planned for next week.  —  The resolution authorizing the inquiry … ",
    "url": "https://thehill.com/homenews/house/4347567-biden-impeachment-inquiry-resolution/"
  },
  {
    "text": "House censures Bowman for falsely pulling fire alarm  —  House Republicans censured Rep. Jamaal Bowman (D-N.Y.) on Thursday after he falsely pulled a fire alarm in a House office building in September, hitting the New York Democrat with a congressional reprimand that liberals derided as “extreme” and “profoundly stupid.”",
    "url": "https://thehill.com/homenews/house/4347631-bowman-censure-fire-alarm/"
  },
  {
    "text": "House votes to censure Rep. Jamaal Bowman for pulling fire alarm  —  Bowman admitted to activating the alarm in September as Republican lawmakers sought to vote on a government funding measure, but said it was a mistake he made while in a rush to open a door.",
    "url": "https://www.nbcnews.com/politics/congress/house-vote-censuring-rep-jamaal-bowman-pulling-fire-alarm-rcna128492"
  },
  {
    "text": "Five Takeaways From the Republican Debate  —  An ascendant Nikki Haley endured a barrage from Ron DeSantis and Vivek Ramaswamy.  Chris Christie delivered a strong showing.  And with time ticking down, there were few direct attacks on Donald Trump.  —  Nikki Haley clashed repeatedly … ",
    "url": "https://www.nytimes.com/2023/12/07/us/politics/republican-debate-takeaways.html"
  },
  {
    "text": "Senator's Son Involved in Police Chase That Killed Deputy  —  The lawmaker said his child “suffers from serious mental disorders.”  —  A son of North Dakota Sen. Kevin Cramer was involved in a police chase on Wednesday evening that ended with a crash that killed a deputy, the lawmaker and authorities said.",
    "url": "https://www.thedailybeast.com/north-dakota-sen-kevin-cramers-son-involved-in-police-chase-that-killed-deputy"
  },
  {
    "text": "McCarthy's Exit May Create Even More Headaches for the Tiny G.O.P. Majority  —  The former speaker's decision to leave his seat a year early could affect control of the House, the legislative agenda and his party's efforts to keep its majority in the 2024 election.",
    "url": "https://www.nytimes.com/2023/12/07/us/politics/mccarthy-republicans-house-majority.html"
  },
  {
    "text": "Kevin McCarthy uses PAC to lavish cash on high-end resorts, private jets and fine dining  —  Rambling above the rust-colored cliffs of the Palos Verdes Peninsula, the Terranea Resort is known for its ocean views, world-ranked spa and villas that can command $3,000 a night or more.",
    "url": "https://www.latimes.com/california/story/2023-12-07/spending-by-kevin-mccarthys-leadership-pac"
  },
  {
    "text": "Georgia prosecutors predict jail sentences in Trump 2020 election case  —  Exclusive: Fulton county prosecutors say in emails their legal careers will continue long after defendants go to jail  —  Fulton county prosecutors have signaled they want prison sentences in the Georgia criminal case … ",
    "url": "https://www.theguardian.com/us-news/2023/dec/07/georgia-fani-willis-donald-trump-election-trial-prison-sentence"
  },
  {
    "text": "Texas judge grants pregnant woman's request to get an abortion  —  A Dallas-area mother found out that her fetus has trisomy 18, a genetic condition that can cause stillbirth or death of a newborn.  The court order allows her to end the pregnancy.  —  A Texas judge on Thursday granted … ",
    "url": "https://www.nbcnews.com/news/us-news/pregnant-woman-texas-gets-court-order-abortion-rcna128537"
  },
  {
    "text": "Washington Post journalists walk off jobs in one-day strike  —  Journalists at The Washington Post walked off their jobs in a one-day strike Thursday.  —  More than 750 staff members at the Post walked out, refusing to work for 24 hours in what they say is the “biggest labor protest at the company” in 48 years.",
    "url": "https://thehill.com/homenews/media/4347548-washington-post-journalists-walk-off-jobs-in-one-day-strike/"
  },
  {
    "text": "New research undercuts Republican views of racism  —  Republicans are more likely to say White people experience racism than Black people.  That's not true.  —  The emergence of the Black Lives Matter movement almost a decade ago was predicated on the killing of Black people at the hands of law enforcement.",
    "url": "https://www.washingtonpost.com/politics/2023/12/07/kff-racial-descrimination-polling/"
  },
  {
    "text": "Behind the Curtain — Exclusive: How Trump would build his loyalty-first Cabinet  —  Former President Trump, if elected, would build a Cabinet and White House staff based mainly on two imperatives: pre-vetted loyalty to him and a commitment to stretch legal and governance boundaries … ",
    "url": "https://www.axios.com/2023/12/07/trump-loyalty-cabinet-2025-carlson-miller-bannon"
  },
  {
    "text": "FACT SHEET: Biden-Harris Administration Announces New Actions to Lower Health Care and Prescription Drug Costs by Promoting Competition  —  President Biden believes that health care should be a right, not a privilege.  For too long, corporate special interests and trickle-down economics … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/07/fact-sheet-biden-harris-administration-announces-new-actions-to-lower-health-care-and-prescription-drug-costs-by-promoting-competition/"
  },
  {
    "text": "Do Trump's rivals know what time it is?  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  LIFE COMES AT YOU FAST — “Candidate for Santos' old seat is convicted on Jan. 6 charges after testifying he had ‘no idea’ Congress met in the Capitol,” by NBC's Megan Lebowitz",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/07/do-trumps-rivals-know-what-time-it-is-00130566"
  },
  {
    "text": "CNN to host two GOP presidential primary debates in 2024  —  CNN will host two Republican presidential primary debates next month in Iowa and New Hampshire - states that hold the first contests in the race for the 2024 GOP nomination, the network announced Thursday.",
    "url": "https://www.cnn.com/2023/12/07/politics/cnn-gop-presidential-primary-debates-2024/"
  },
  {
    "text": "What Is Happening at the Columbia School of Social Work?  —  During orientation at the Columbia School of Social Work at Columbia University, the country's oldest graduate program for aspiring social workers, students are given a glossary with “100+ common terms you may see or hear used in class … ",
    "url": "https://www.nytimes.com/2023/12/07/opinion/social-work-columbia-ideology.html"
  },
  {
    "text": "Georgia just obliterated Lucy McBath's district.  She says she's not going anywhere.  —  Democratic-backed groups have vowed to challenge the new map in court again.  —  Georgia Republicans just shredded Democratic Rep. Lucy McBath's suburban Atlanta district — but she says she will fight to remain in Congress.",
    "url": "https://www.politico.com/news/2023/12/07/georgia-lucy-mcbath-district-00130621"
  },
  {
    "text": "Trump Returns to NY Court as Trial Comes to Close  —  The former president's anticipated return to a New York court in his civil fraud case falls on what may be the second-to-last day of the defense case  —  JWPlayer  —  For the better part of two months, former President Donald Trump … ",
    "url": "https://themessenger.com/politics/trump-returns-to-ny-court-as-trial-comes-to-close"
  },
  {
    "text": "Blinken on Viral Moment After Biden Called Xi Dictator: ‘My Neck Was a Little Bit Stiff’  —  Blinken went viral earlier this year for appearing to cringe when Biden referred to Chinese President Xi Jinping as a ‘dictator’  —  Secretary of State Antony Blinken on Wednesday addressed … ",
    "url": "https://themessenger.com/politics/blinken-on-viral-moment-after-biden-called-xi-dictator-my-neck-was-a-little-bit-stiff"
  },
  {
    "text": "Fink Says GOP Debate Was Filled With Misinformation About BlackRock … Fink pushed back on several claims made during this week's Republican debate, suggesting in a Thursday post on Linkedin that candidates were ignoring the main issues facing the US such as “ballooning national debt.”",
    "url": "https://www.bloomberg.com/news/articles/2023-12-07/fink-says-gop-debate-filled-with-misinformation-about-blackrock"
  },
  {
    "text": "How Were the Universities Lost?  —  The Ivy league and their kindred so-called elite campuses may soon go the way of Disney and Bud Light  —  After October 7, the public was shocked at what they saw and heard on America's campuses.  —  Americans knew previously they were intolerant, leftwing, and increasingly non-meritocratic.",
    "url": "https://amgreatness.com/2023/12/07/how-were-the-universities-lost/"
  },
  {
    "text": "College Presidents Under Fire After Dodging Questions About Antisemitism  —  The leaders of Harvard, M.I.T. and Penn appeared to evade questions about whether students should be disciplined if they call for the genocide of Jews.  —  Support for the presidents of Harvard … ",
    "url": "https://www.nytimes.com/2023/12/06/us/donors-and-alumni-demand-that-penns-president-resign-over-remarks-at-hearing.html"
  }
]