[
  {
    "text": "I Love Joe Biden.  But We Need a New Nominee.  —  I'm a lifelong Democrat; I make no apologies for that.  I'm proud of what my party represents and what it stands for.  As part of my participation in the democratic process and in support of my chosen candidate, I have led some of the biggest fund-raisers in my party's history.",
    "url": "https://www.nytimes.com/2024/07/10/opinion/joe-biden-democratic-nominee.html"
  },
  {
    "text": "George Stephanopoulos Says Biden Can't Serve Another 4 Years  —  GEORGE STEPHANOPOULOS BIDEN CAN'T SERVE 4 MORE YEARS … 6:28 PM PT — George Stephanopoulos tells TMZ, “Earlier today, I responded to a question from a passerby.  I shouldn't have.”  An ABC spokesperson tells TMZ … ",
    "url": "https://www.tmz.com/2024/07/09/george-stephanopoulos-president-joe-biden-cant-serve-4-more-years-sidewalk-election/"
  },
  {
    "text": "Biden support slips in deep blue New York: 'We're a battleground state now'  —  Democrats are worried the president is taking New York for granted as the state becomes surprisingly competitive.  —  NEW YORK — President Joe Biden has a new problem: a competitive race in deep blue New York.",
    "url": "https://www.politico.com/news/2024/07/10/biden-new-york-trouble-00167198"
  },
  {
    "text": "Trump airs list of false grievances at Florida rally: 'We don't eat bacon any more'  —  Ex-president returns to campaign trail in Doral and makes baseless accusations but doesn't name running mate  —  Donald Trump returned to the campaign trail in Florida on Tuesday night … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/09/trump-doral-florida-campaign-rally"
  },
  {
    "text": "Biden says it's Dem ‘elites’ who are alarmed about his debate.  Voters in Wisconsin beg to differ.  —  There's little consensus, however, that Biden dropping out of the presidential race would improve the party's odds in November.  —  MILWAUKEE, Wisconsin — Voters and local candidates … ",
    "url": "https://www.politico.com/news/2024/07/10/biden-age-wisconsin-voters-00167214"
  },
  {
    "text": "Trump Donors on the Brink of Civil War Over J.D. Vance for VP  —  KILLBILLY ELEGY  —  Part of what brought Vance to the dance may be his undoing.  Donors are scared of him. … In his rise from Donald Trump critic to viable contender to be the presumptive Republican nominee's running mate, Sen. J.D. Vance of Ohio has come so far.",
    "url": "https://www.thedailybeast.com/trump-donors-on-the-brink-of-civil-war-over-jd-vance-for-vp"
  },
  {
    "text": "The Lie David Sanger Told to Sustain NYT's Non-Stop Campaign against Joe Biden  —  Predictably, the NYT treated President Biden's speech to kick off NATO's 75th Anniversary as if Biden merely invented the date and the event and maybe even NATO itself to cover up a shoddy debate performance.",
    "url": "https://www.emptywheel.net/2024/07/10/the-lie-david-sanger-told-to-sustain-nyts-non-stop-campaign-against-joe-biden/"
  },
  {
    "text": "Pelosi: “Time is running short” for Biden to decide on re-election bid … - Biden has repeatedly said that he's not dropping out and dismissed calls to step aside following a poor debate performance that set off a panic among some members of his own party.  — He sent a letter … ",
    "url": "https://www.axios.com/2024/07/10/nancy-pelosi-biden-2024-run"
  },
  {
    "text": "Nevada's Washoe County votes against certifying recount results of 2 local primaries  —  Commissioners in Washoe County, Nevada's second most populous county, refused Tuesday to certify the results of local recounts from two June primaries, an unusual move that may have implications … ",
    "url": "https://www.cbsnews.com/news/nevada-county-refuses-to-certify-recount-election-results/"
  },
  {
    "text": "Margaret Sullivan on how the media normalizes Trump  —  “When you have such a disparity between candidates, it's not fulfilling our duty to treat them as equals.”  —  ∙ Paid … When we spoke with Margaret Sullivan about a month ago to get her view on coverage of the 2024 election … ",
    "url": "https://www.publicnotice.co/p/margaret-sullivan-interview-media-trump-biden-24"
  },
  {
    "text": "Democrats are justified in being freaked out about November  —  Biden's position is worse than any Democrat's in decades — and much worse than his own in 2020.  —  On CNN on Tuesday night, Sen. Michael Bennet (D-Colo.) said what a lot of Democrats seem to be thinking: His party is in deep trouble … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/10/biden-polling-drop-out-bennet/"
  },
  {
    "text": "After challenging Trump, Haley and DeSantis denied speaking slots at RNC 2024  —  After a bitter primary, former President Donald Trump's main GOP rivals Nikki Haley and Ron DeSantis have worked to make amends.  —  Haley recently released her delegates and encouraged them to support Trump.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/10/desantis-haley-denied-speaking-republican-national-convention/74347187007/"
  },
  {
    "text": "Think tank behind Project 2025 conservative blueprint signs on as RNC convention sponsor  —  WASHINGTON - As former President Donald Trump distances himself from a conservative group's blueprint for a future Republican governing agenda, he will have at least one unavoidable connection to it: the Republican National Convention.",
    "url": "https://www.jsonline.com/story/news/politics/elections/2024/07/09/project-2025-think-tank-heritage-foundation-signs-on-as-an-rnc-sponsor/74337029007/"
  },
  {
    "text": "Trump's tip trick  —  As president, Donald Trump's tax policy heavily favored corporations and the wealthy.  Trump's signature tax legislation, the Tax Cuts and Jobs Act, overwhelmingly benefited those groups.  —  But, as a presidential candidate, Trump campaigns as a populist.",
    "url": "https://popular.info/p/trumps-tip-trick"
  },
  {
    "text": "Bipartisan Senate group pushes ban on lawmaker stock trading  —  A bipartisan group of Senators unveiled a new proposal that would ban members of Congress, their spouses and dependent children from trading individual stocks.  —  Oregon Democratic Senator Jeff Merkley, Michigan Senator Gary Peters … ",
    "url": "https://www.npr.org/2024/07/10/g-s1-8989/bipartisan-stock-trading-ban"
  },
  {
    "text": "‘Deranged’: Critics React To Trump's ‘Fat Pig’ Rally Rant  —  The former president went off on a strange tangent about a “beautiful waitress” before pivoting to a backhanded attack on Chris Christie.  —  LOADING  —  In his first campaign rally since the presidential debate … ",
    "url": "https://www.huffpost.com/entry/trump-fat-pig-rant-reactions_n_668e4da5e4b0a62057b8ca78"
  },
  {
    "text": "Exclusive: President Biden says he had to push for Beryl aid request with Abbott overseas  —  President Joe Biden said Tuesday that the federal government could not distribute emergency relief supplies, including power generators, after Hurricane Beryl hit Texas until the White House was able to … ",
    "url": "https://www.houstonchronicle.com/news/houston-weather/hurricanes/article/biden-says-greg-abbott-dan-patrick-delayed-19563648.php"
  },
  {
    "text": "Type of Russian missile that struck Kyiv children's hospital uses western components  —  Kremlin has turned to microprocessors and other technology not intended for military use to skirt sanctions  —  The type of Russian missile that destroyed a Kyiv children's hospital relies … ",
    "url": "https://www.ft.com/content/ef463ac9-4804-4ad7-b9a2-c113590f2f96"
  }
]