[
  {
    "text": "President's Rating Hits Record Low  —  Biden gets especially poor marks on inflation and immigration; few Americans say he is paying enough attention to their concerns  —  West Long Branch, NJ - President Joe Biden's job rating has hit an all-time low in the Monmouth (\"Mon-muth\") … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_US_121823/"
  },
  {
    "text": "Texas to arrest migrants crossing border illegally under new state law  —  Texas Governor Greg Abbott on Monday signed a law allowing state law enforcement to arrest people suspected of crossing the U.S.-Mexico border illegally, giving local officers powers long delegated to the U.S. government … ",
    "url": "https://www.reuters.com/world/us/texas-arrest-migrants-crossing-border-illegally-under-new-state-law-2023-12-18/"
  },
  {
    "text": "Testo in lingua inglese  —  On the Pastoral Meaning of Blessings  —  This Declaration considers several questions that have come to this Dicastery in recent years.  In preparing the document, the Dicastery, as is its practice, consulted experts, undertook a careful drafting process … ",
    "url": "https://press.vatican.va/content/salastampa/it/bollettino/pubblico/2023/12/18/0901/01963.html#en"
  },
  {
    "text": "Pope approves blessings for same-sex couples if they don't resemble marriage  —  Pope Francis has formally approved allowing priests to bless same-sex couples, with a new document explaining a radical change in Vatican policy by insisting that people seeking God's love and mercy shouldn't be subject to … ",
    "url": "https://apnews.com/article/vatican-lgbtq-pope-bfa5b71fa79055626e362936e739d1d8"
  },
  {
    "text": "Miami GOP Strategist Barbara Balmaseda Arrested on Capitol Riot Charges  —  Barbara Balmaseda has been charged with a felony count of obstructing an official proceeding during the Capitol riot. … Authorities have unsealed an arrest warrant for Barbara Balmaseda, a former Florida International … ",
    "url": "https://www.miaminewtimes.com/news/miami-gop-strategist-barbara-balmaseda-accused-of-storming-us-capitol-18501993"
  },
  {
    "text": "Former Miami Young Republicans director arrested over Jan. 6 charges  —  Balmaseda was an active GOP member in South Florida.  —  TALLAHASSEE, Florida — A South Florida woman with connection to the state Republican Party and GOP officials was arrested by federal authorities last week … ",
    "url": "https://www.politico.com/news/2023/12/18/miami-republican-jan-6-00132320"
  },
  {
    "text": "Pentagon announces new international mission to counter attacks on commercial vessels in Red Sea  —  MANAMA, Bahrain (AP) — The U.S. and a host of other nations are creating a new force to protect ships transiting the Red Sea that have come under attack by drones and ballistic missiles fired … ",
    "url": "https://apnews.com/article/attacks-red-sea-navy-mission-missiles-286d51bfd65e741e839e185f0f4a455b"
  },
  {
    "text": "Inside The Russian Propaganda Mill Beaming Out Of A Florida Strip Mall  —  When Ben Swann delivers a news report, he looks and sounds like any other TV anchor:  conventionally attractive, slick hair, clad in an unremarkable but well-tailored suit.  —  But unlike thousands of TV reporters around … ",
    "url": "https://talkingpointsmemo.com/news/inside-the-russian-propaganda-mill-beaming-out-of-a-florida-strip-mall"
  },
  {
    "text": "Cardin ‘angry,’ ‘disappointed’ with ex-staffer after sex tape reveal  —  Sen. Ben Cardin (D-Md.) on Monday said he is “angry” after a video emerged of a now-former staffer performing lewd acts in a Senate committee hearing room.  —  Cardin declined to delve into particulars about the staffer … ",
    "url": "https://thehill.com/homenews/senate/4366737-cardin-angry-disappointed-with-ex-staffer-after-sex-tape-reveal/"
  },
  {
    "text": "NASA's Webb Rings in Holidays With Ringed Planet Uranus  —  NASA's James Webb Space Telescope recently trained its sights on unusual and enigmatic Uranus, an ice giant that spins on its side.  Webb captured this dynamic world with rings, moons, storms, and other atmospheric features - including a seasonal polar cap.",
    "url": "https://www.nasa.gov/missions/webb/nasas-webb-rings-in-holidays-with-ringed-planet-uranus/"
  },
  {
    "text": "Trump Asks Full D.C. Appeals Court to Review Gag Order in Election Case  —  The former president is seeking the full court's review after a three-judge panel upheld a gag order imposed by the trial court but narrowed its scope.  —  Lawyers for former President Donald J. Trump asked … ",
    "url": "https://www.nytimes.com/2023/12/18/us/politics/trump-gag-order-election.html"
  },
  {
    "text": "Right-wing tantrum over Jill Biden Christmas video accidentally reveals how much MAGA hates America  —  When the “war on woke” is over, the only entertainment left for Trump cultists will be Dear Leader's speeches  —  Last week, First Lady Jill Biden, rejecting her predecessor's loathing of Christmas cheer … ",
    "url": "https://www.salon.com/2023/12/18/right-wing-tantrum-over-jill-biden-christmas-video-accidentally-reveals-how-much-maga-hates-america/"
  },
  {
    "text": "The New York Times Is Part of the Effing Problem  —  1. Shade of a Gray Lady  —  James Bennet has written a long piece for the Economist about “When the New York Times Lost Its Way.”  —  Bennet was an editor at the Atlantic who went to the NYT to run the paper's op-ed page and was fired … ",
    "url": "https://plus.thebulwark.com/p/the-new-york-times-is-part-of-the"
  },
  {
    "text": "A “Delicate Matter”: Clarence Thomas' Private Complaints About Money Sparked Fears He Would Resign  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship with real estate tycoon Harlan Crow … ",
    "url": "https://www.propublica.org/article/clarence-thomas-money-complaints-sparked-resignation-fears-scotus"
  },
  {
    "text": "Judge issues order keeping Confederate memorial at Arlington Cemetery for now  —  A lawsuit by the group Defend Arlington accused the Army, which runs the cemetery, of violating regulations in seeking a hasty removal of the memorial  —  A federal judge on Monday issued a temporary restraining … ",
    "url": "https://www.nbcwashington.com/news/local/judge-issues-order-keeping-confederate-memorial-at-arlington-cemetery-for-now/3496987/"
  },
  {
    "text": "Complaint accuses DeSantis campaign of illegally coordinating with Never Back Down  —  Campaign Legal Center has now filed a total of five complaints against DeSantis or his donors this year.  —  TALLAHASSEE, Florida — A watchdog group that has already filed several complaints … ",
    "url": "https://www.politico.com/news/2023/12/18/complaint-desantis-campaign-never-back-down-00132325"
  },
  {
    "text": "Everyone expected a recession.  The Fed and White House found a way out.  —  The economy's strength and stability — defying many of the most optimistic predictions — represents a remarkable development after seemingly endless crises  —  After two years of relentless pressure over everything … ",
    "url": "https://www.washingtonpost.com/business/2023/12/18/recession-economy-inflation/"
  },
  {
    "text": "Senate confirms Biden nominee to run Social Security Administration  —  The Senate voted Monday to confirm former Maryland Gov. Martin O'Malley (D) as commissioner of the Social Security Administration (SSA).  —  The Senate greenlit his nomination with a vote of 50-11 Monday afternoon … ",
    "url": "https://thehill.com/homenews/senate/4366679-senate-confirms-biden-nominee-to-run-social-security-administration/"
  },
  {
    "text": "Anti-Israel protesters show up to Dem congressman's home in middle of night, blaring car horns and screaming  —  Rep. Shri Thanedar, D-Mich., has maintained strong support for Israel amid its war with Hamas terrorists  —  A group of anti-Israel protesters descended on the home of Rep. Shri Thanedar … ",
    "url": "https://www.foxnews.com/politics/anti-israel-protesters-show-up-dem-congressmans-home-middle-night-blaring-car-horns-screaming"
  },
  {
    "text": "A more aggressive China tried to influence the 2022 midterms, U.S. intelligence report says  —  There was no sign that foreign adversaries used cyberattacks to try to gain access to or tamper with U.S. election infrastructure or ballot counting, the report said.",
    "url": "https://www.nbcnews.com/politics/elections/aggressive-china-tried-influence-2022-midterms-us-intelligence-report-rcna130366"
  },
  {
    "text": "Democrats seek to restrain new immigration powers, fearing abuse by Trump  —  The former president and other immigration hardliners eying the White House are on the minds of senators as they negotiate new aslyum restrictions and border security measures.  —  WASHINGTON — Senators negotiating … ",
    "url": "https://www.nbcnews.com/politics/congress/democrats-seek-restrain-new-immigration-powers-fearing-abuse-trump-rcna130317"
  },
  {
    "text": "Biden administration pleads with states after millions of kids lose Medicaid coverage  —  According to HHS, nine states are responsible for 60 percent of children's coverage losses between March and September.  —  HHS wants states with the highest rates of children dropped from Medicaid … ",
    "url": "https://www.politico.com/news/2023/12/18/biden-administration-pleads-with-states-after-millions-of-kids-lose-medicaid-coverage-00132282"
  },
  {
    "text": "Trump super PAC prepares to go on attack against Nikki Haley in New Hampshire  —  MAGA Inc. hasn't been on TV in New Hampshire since June, but the group has placed new ad buys in New Hampshire over the next three weeks.  —  The super PAC backing former President Donald Trump is preparing … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-super-pac-prepares-attack-nikki-haley-new-hampshire-rcna130351"
  }
]