[
  {
    "text": "Matt Gaetz ethics report says his drug use and sex with a minor violated state laws  —  Former Rep. Matt Gaetz, a Florida Republican who briefly stood to become President-elect Donald Trump's nominee to be attorney general, was found by congressional ethics investigators to have paid numerous women … ",
    "url": "https://www.cbsnews.com/news/matt-gaetz-ethics-report-released/"
  },
  {
    "text": "House Ethics report finds evidence Matt Gaetz paid thousands for sex and drugs including paying a 17-year-old for sex in 2017  —  The House Ethics Committee found evidence that former Rep. Matt Gaetz paid tens of thousands of dollars to women for sex or drugs on at least 20 occasions … ",
    "url": "https://www.cnn.com/2024/12/23/politics/matt-gaetz-house-ethics-report"
  },
  {
    "text": "Gaetz sues Ethics Committee in last-minute bid to block release of report  —  Former Rep. Matt Gaetz (R-Fla.) on Monday filed a lawsuit against the House Ethics Committee in a last-minute attempt to block the panel from releasing its report on the Florida Republican.",
    "url": "https://thehill.com/homenews/house/5053397-gaetz-ethics-committee-lawsuit/"
  },
  {
    "text": "Ethics report alleges Gaetz paid 17-year-old for sex  —  Investigators also said the Florida Republican solicited prostitutes, used illegal drugs, took improper gifts and tried to obstruct their probe.  —  A yearslong House Ethics Committee investigation into former Rep. Matt Gaetz found … ",
    "url": "https://www.politico.com/news/2024/12/23/matt-gaetz-ethics-report-findings-00195875"
  },
  {
    "text": "Biden gives life in prison to 37 of 40 federal death row inmates so Trump can't have them executed  —  President Joe Biden announced on Monday that he is commuting the sentences of 37 of the 40 people on federal death row, converting their punishments to life imprisonment just weeks … ",
    "url": "https://apnews.com/article/biden-death-row-commutations-trump-executions-f67b5e04453cd1aa6383c516bc14f300"
  },
  {
    "text": "Statement from President Joe Biden on Federal Death Row Commutations  —  I've dedicated my career to reducing violent crime and ensuring a fair and effective justice system.  —  Today, I am commuting the sentences of 37 of the 40 individuals on federal death row to life sentences without the possibility of parole.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/23/statement-from-president-joe-biden-on-federal-death-row-commutations/"
  },
  {
    "text": "Biden commutes most federal death row sentences to life in prison before Trump takes office  —  President Joe Biden announced Monday that he is taking 37 people off federal death row to serve out life sentences behind bars — a decision that leaves only three federal prisoners awaiting execution … ",
    "url": "https://www.cnn.com/2024/12/23/politics/biden-federal-death-row-trump"
  },
  {
    "text": "ACLU Celebrates President Biden's Historic Federal Death Row Commutations  —  National leaders and organizations across the political and faith spectrums joined the ACLU in calling on Biden to commute federal death sentences  —  WASHINGTON - The American Civil Liberties Union celebrates … ",
    "url": "https://www.aclu.org/press-releases/aclu-celebrates-president-bidens-historic-federal-death-row-commutations"
  },
  {
    "text": "Biden Commutes 37 Death Sentences Ahead of Trump's Plan to Resume Federal Executions  —  Those affected by the president's action on Monday are still subject to life imprisonment without the possibility of parole.  Three men will remain on federal death row.",
    "url": "https://www.nytimes.com/2024/12/23/us/politics/biden-commutes-37-death-sentences.html"
  },
  {
    "text": "Biden commutes sentences of 37 federal death row inmates in final month of presidency  —  The move is aimed at preventing the Trump administration from carrying out executions that would not take place under the moratorium Biden issued in 2021  —  President Biden is commuting the sentences … ",
    "url": "https://www.foxnews.com/politics/biden-commutes-sentences-37-federal-death-row-inmates-final-month-presidency"
  },
  {
    "text": "Trump Picks Callista Gingrich for Ambassador to Switzerland  —  In announcing his choice of various envoys, including ambassador to Denmark, the president-elect again floated the idea of the United States acquiring Greenland.  —  President-elect Donald J. Trump said on Sunday that he intended … ",
    "url": "https://www.nytimes.com/2024/12/22/us/politics/trump-callista-gingrich-ambassador-switzerland.html"
  },
  {
    "text": "Trump's big Mike Johnson decision  —  A messy Capitol Hill endgame has the president-elect pondering a change in House leadership.  —  After the House passed a shutdown-averting spending bill Friday, a very relieved Speaker Mike Johnson proclaimed to reporters that President-elect Donald Trump was “certainly happy about this outcome.”",
    "url": "https://www.politico.com/news/2024/12/23/mike-johnson-speaker-trump-limbo-00195854"
  },
  {
    "text": "By stepping on rakes, Trump ruins his own ‘honeymoon’ phase  —  The president-elect had one demand for the bill to prevent a government shutdown.  He didn't get it.  The result made him look weak at an inopportune time.  —  It's not uncommon for a president-elect to enjoy a “honeymoon” … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/stepping-rakes-trump-ruins-honeymoon-phase-rcna185194"
  },
  {
    "text": "Congress' age debate reignites over member living in retirement home … - “Since early September, my health challenges have progressed making frequent travel to Washington both difficult and unpredictable.”  — Granger's son Brandon told the Dallas Morning News that she has been “having some dementia issues late in the year.”",
    "url": "https://www.axios.com/2024/12/22/kay-granger-retirement-home-congress-age-debate"
  },
  {
    "text": "Joe Manchin torches Democrats on the way out the door  —  For more on Sen. Joe Manchin of West Virginia, watch CNN's “Inside Politics with Manu Raju” at 8 a.m. ET and 11 a.m. ET.  —  Washington CNN  —  As Joe Manchin prepares to leave Congress after nearly 15 years, the West Virginia senator … ",
    "url": "https://www.cnn.com/2024/12/22/politics/joe-manchin-congress-democratic-party/"
  },
  {
    "text": "New research shows the massive hole Dems are in  —  Even voters who previously backed Democrats cast the party as weak and overly focused on diversity and elites.  —  Democrats conducting post-mortems on their sweeping losses in 2024 are finding more reason for alarm.",
    "url": "https://www.politico.com/news/2024/12/22/democrats-2024-election-problem-focus-group-00195806"
  },
  {
    "text": "Trump picks billionaire financier for deputy defense secretary  —  The choice of Stephen Feinberg of Cerberus Capital Management comes as Pete Hegseth continues to face questions in the confirmation process for the top Pentagon post.",
    "url": "https://www.washingtonpost.com/politics/2024/12/22/trump-defense-department-stephen-feinberg/"
  },
  {
    "text": "AOC Shuts Down Pregnancy Rumors After Being Approached by GOP Colleague  —  NO BABY ON BOARD  —  Rep. Alexandria Ocasio-Cortez is clearing up the pregnancy rumors after a Republican member asked her whether she was expecting on the House floor this week.  In an Instagram story video … ",
    "url": "https://www.thedailybeast.com/aoc-shuts-down-pregnancy-rumors-after-being-approached-by-gop-colleague/"
  }
]