[
  {
    "text": "The polls are suggesting a huge shift in the electorate.  Are they right?  —  It's a significant reversal from recent history: President Joe Biden is struggling with young voters but performing better than most Democrats with older ones.  —  Something weird is happening beneath … ",
    "url": "https://www.politico.com/news/2024/04/07/voter-age-biden-trump-2024-election-00150923"
  },
  {
    "text": "Inside Donald Trump's secret plan to end the Ukraine-Russia war  —  Foreign policy experts and some Republicans warned that pressuring Ukraine to cede land would reward Putin  —  Former president Donald Trump has privately said he could end Russia's war in Ukraine by pressuring Ukraine … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/05/trump-ukraine-secret-plan/"
  },
  {
    "text": "Montana GOP Senate candidate says he lied to ranger about gunshot wound in 2015  —  Tim Sheehy was cited for illegally discharging a weapon in a national park but says he made up the gunshot to cover up a bullet wound he received as a Navy SEAL in Afghanistan that he never reported to superiors",
    "url": "https://www.washingtonpost.com/politics/2024/04/06/tim-sheehy-montana-senate-gunshot-wound-national-park/"
  },
  {
    "text": "Trump promises a ‘deal’ on abortion that will please everyone.  It likely doesn't exist.  —  Should Trump appear vague or duck the issue, some of his supporters fear it will allow the Biden campaign to tie him to the more extreme wing of the anti-abortion movement.",
    "url": "https://www.politico.com/news/2024/04/07/trump-abortion-democrats-republicans-00150800"
  },
  {
    "text": "House, Senate elections are being fought on very different political terrain  —  The House and Senate majorities are both on the line in November and could easily flip in different directions  —  When it comes to this fall's battle for control of Congress, the House and Senate might as well be on different planets.",
    "url": "https://www.washingtonpost.com/politics/2024/04/06/congressional-elections-house-senate-majority/"
  },
  {
    "text": "6 months in, the Gaza war is in limbo — which may help Bibi stay in power … - Israel is conducting sporadic raids and airstrikes like the botched one that killed seven World Central Kitchen workers, but there are no major military operations going on in Gaza.",
    "url": "https://www.axios.com/2024/04/07/6-months-gaza-war-netanyahu"
  },
  {
    "text": "Russia Says Macron's Hawkish Statements Pose ‘Strategic Problem’  — Macron has refused to rule out sending troops to Ukraine  — Envoy says Russia shut out of Paris Olympic safety planning  —  Alexey Meshkov, Russia's ambassador to France, said Emmanuel Macron's recent hawkish commentary … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-07/russia-says-macron-s-hawkish-statements-pose-strategic-problem"
  },
  {
    "text": "Navy cancels ship briefings after damning internal report  —  As China's fleet grows, the U.S. is struggling with fresh delays in building new subs and warships.  —  As the Navy's largest U.S. trade show gets underway on Monday, officers in charge of the service's marquee shipbuilding programs … ",
    "url": "https://www.politico.com/news/2024/04/07/navy-cancels-ship-briefings-internal-report-00150879"
  },
  {
    "text": "Colorado Sun politics reporter kicked out of GOP state assembly  —  A Colorado Sun politics reporter was escorted out of the state GOP assembly by a sheriff's deputy Saturday after being told that party Chairman Dave Williams found her “current reporting to be very unfair.”",
    "url": "https://coloradosun.com/2024/04/06/colorado-republican-party-kicks-out-colorado-sun-reporter/"
  },
  {
    "text": "Biden may have trouble getting on Ohio's general election ballot, state's top elections official warns  —  In a letter to Ohio's Democratic Party chair, Secretary of State Frank LaRose warns that the Democratic National Convention will take place after a state deadline to declare a candidate.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-may-trouble-getting-ohios-general-election-ballot-rcna146706"
  },
  {
    "text": "Biden hauls in $90 million in March as campaign embarks on general election blitz  —  President Joe Biden raised more than $90 million for his reelection campaign and the Democratic Party in March, a whopping haul in a month that saw him pivot to a general election posture … ",
    "url": "https://www.cnn.com/2024/04/06/politics/biden-fundraising-march/"
  },
  {
    "text": "How Gaza Protesters Are Making Life Difficult for Democratic Leaders  —  From President Biden to the mayors of small cities, Democrats have been trailed by demonstrators who are complicating the party's ability to campaign in an election year.  —  In Detroit, a congressman's holiday party devolved … ",
    "url": "https://www.nytimes.com/2024/04/07/us/politics/democrats-israel-gaza-protesters.html"
  },
  {
    "text": "Sen. John Fetterman blasts squatters, violent crime: ‘I am not woke’  —  Pennsylvania Sen. John Fetterman ripped the idea of “squatter's rights” during an exclusive interview with The Post this week.  —  “Squatters have no rights,” Fetterman said, adding that the issue was one he often dealt … ",
    "url": "https://nypost.com/2024/04/06/us-news/fetterman-blasts-squatters-violent-crime-i-am-not-woke/"
  },
  {
    "text": "Cecil ‘Chip’ Murray, L.A. civil rights icon and spiritual leader, dead at 94  —  The Rev. Dr. Cecil L.  “Chip” Murray, who made the First African Methodist Episcopal Church the most prestigious Black pulpit in Los Angeles, attracting presidents, governors and mayors to hear his dynamic sermons, has died.",
    "url": "https://www.latimes.com/obituaries/story/2024-04-06/cecil-murray-dead"
  }
]