[
  {
    "text": "Dead even: POLITICO snap poll shows stark division on debate  —  The results reflect the country's hyper-polarized politics.  —  Talk about a divided nation: There was no decisive winner in the first-and-only vice presidential debate of the 2024 election.  —  Asked who won Tuesday's debate … ",
    "url": "https://www.politico.com/news/2024/10/02/politico-snap-poll-division-debate-00182131"
  },
  {
    "text": "Fact checking VP debate claims from Walz and Vance's 2024 showdown  —  The CBS News Confirmed team is fact checking the biggest claims made by Minnesota Gov. Tim Walz and Ohio Sen. JD Vance in tonight's 2024 vice presidential debate in New York City.  —  CBS News is hosting … ",
    "url": "https://www.cbsnews.com/news/fact-check-vp-debate-2024/"
  },
  {
    "text": "Trump's decomposition was the big debate day story  —  Disoriented and incoherent, he hit new lows of unfitness. … The vice presidential debate will be a main topic of political conversation today, but far more important (and disturbing) things happened before it took place.",
    "url": "https://www.publicnotice.co/p/trump-mocks-troops-injured-in-iran-attack"
  },
  {
    "text": "Walz's claim that he was in Hong Kong during Tiananmen Square protests undercut by unearthed newspaper reports  —  Newly unearthed reports contradict previous claims made by Minnesota Gov. Tim Walz about his travel to China, including a claim that the Democratic vice presidential nominee … ",
    "url": "https://www.cnn.com/2024/10/01/politics/tim-walz-china-tiananmen-square/"
  },
  {
    "text": "Trump backs out of ‘60 Minutes’ primetime interview, CBS says  —  New York CNN  —  Former President Donald Trump has backed out of a previously scheduled interview with “60 Minutes,” the most-watched newsmagazine in the United States, CBS News said Tuesday evening.",
    "url": "https://www.cnn.com/2024/10/01/media/trump-backs-out-60-minutes-interview-cbs/"
  },
  {
    "text": "Harris launches a new ad that hits Trump's age in criticizing Vance  —  The ad is timed to begin airing with the vice presidential debate on Tuesday.  —  WASHINGTON — Vice President Kamala Harris' campaign is launching a new digital ad Tuesday slamming Republican vice presidential nominee … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-launches-new-ad-hits-trumps-age-criticizing-vance-rcna173526"
  },
  {
    "text": "Trump rejects “60 Minutes” interview; Harris accepts … Steven Cheung, the Trump campaign communications director, told Axios:  — “There were discussions but nothing was ever scheduled or locked in. … - “For over half a century, 60 Minutes has invited the Democratic and Republican tickets … ",
    "url": "https://www.axios.com/2024/10/01/trump-harris-60-minutes-interview"
  },
  {
    "text": "The difference between Vance and Trump  —  At last night's vice presidential debate, we learned that Senator JD Vance (R-OH) is a much better debater than former President Donald Trump.  Vance showed he can stay on topic, properly pronounce most words, and express empathy for other people.",
    "url": "https://popular.info/p/the-difference-between-vance-and"
  },
  {
    "text": "Vance claims Trump ‘salvaged’ Obamacare.  Trump tried, and failed, to kill it.  —  When Trump was president, Republicans fought to repeal the health insurance program.  —  Republican vice presidential candidate JD Vance on Tuesday night claimed — in contradiction of history … ",
    "url": "https://www.nbcnews.com/politics/jd-vance/vance-falsely-says-trump-salvaged-obamacare-program-tried-repeal-rcna173568"
  },
  {
    "text": "Swing State Polling Finds Deadlocked Presidential Contest, ‘Blue Wall’ Senate Races Tighten  —  A new Cook Political Report Swing State Project Survey conducted by BSG and GS Strategy Group (September 19-25; 2,941 voters), shows Vice President Kamala Harris leading or tied with former President Donald Trump … ",
    "url": "https://www.cookpolitical.com/analysis/survey-research/2024-swing-state-project/swing-state-polling-finds-deadlocked-presidential"
  },
  {
    "text": "Cook Political Report shifts Texas Senate race toward Democrats  —  The Cook Political Report on Tuesday shifted Texas's Senate race from “likely Republican” to “lean Republican,” signaling momentum for Rep. Colin Allred's (D-Texas) challenge against incumbent Sen. Ted Cruz (R-Texas) in the red state.",
    "url": "https://thehill.com/homenews/campaign/4910340-texas-senate-cook-political-report/"
  },
  {
    "text": "Support Hurricane Helene Victims - Trump Authorized  —  Meredith ORourke is organizing this fundraiser. … President Donald J. Trump has launched this GoFundMe campaign as an official response for MAGA supporters to offer their financial assistance to their fellow Americans impacted by Hurricane Helene.",
    "url": "https://www.gofundme.com/f/support-hurricane-helene-victims-with-president-trump"
  },
  {
    "text": "Olivia Nuzzi accuses ex-fiance of orchestrating blackmail campaign amid RFK relationship  —  New York magazine writer Olivia Nuzzi is publicly accusing her ex-fiancé Ryan Lizza, a prominent political journalist with Politico, of orchestrating a harassment and blackmail campaign … ",
    "url": "https://www.cnn.com/2024/10/01/media/olivia-nuzzi-ryan-lizza-rfk-relationship/"
  },
  {
    "text": "Iran Launches About 180 Ballistic Missiles at Israel  —  Many of the missiles were intercepted with the help of the United States, but some fell in central and southern Israel, the Israeli military said.  Israel vowed to retaliate.  —  Raja Abdulrahim/The New York Times Diego Ibarra Sanchez for The New York Times",
    "url": "https://www.nytimes.com/live/2024/10/01/world/israel-lebanon-hezbollah?unlocked_article_code=1.O04.WhtG.h_OxzNa9i6I_&smid=url-share"
  },
  {
    "text": "A Pair of Billionaire Preachers Built the Most Powerful Political Machine in Texas.  That's Just the Start.  —  Tim Dunn and Farris Wilks are poised to take their Christian nationalist agenda nationwide.  —  Co-published with The New York Times Magazine … Reporting Highlights",
    "url": "https://www.propublica.org/article/tim-dunn-farris-wilks-texas-christian-nationalism-dominionism-elections-voting"
  },
  {
    "text": "If Helene affects voting, Trump may pay the price  —  Nearly a quarter of 2020 Trump voters in Florida, Georgia and the Carolinas live in counties declared federal disaster areas.  —  Hurricane Helene is gone, fragmented into large cloud formations over the Eastern United States that folded into the rest of the country's weather.",
    "url": "https://www.washingtonpost.com/politics/2024/10/01/if-helene-affects-voting-trump-may-pay-price/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NzU1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI5MTM3NTk5LCJpYXQiOjE3Mjc3NTUyMDAsImp0aSI6ImU2ZjlhZTRhLWI3NTUtNGJlMC04ZDk0LWNlYzM0NTEyMDEzNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzAxL2lmLWhlbGVuZS1hZmZlY3RzLXZvdGluZy10cnVtcC1tYXktcGF5LXByaWNlLyJ9.0-SaeJejNowNKy9wlUMVFSavIZFzaPgmazpMTxPu75A&itid=gfta"
  },
  {
    "text": "A deeper look at Walz's China ties ahead of Tuesday's debate  —  ListenA deeper look at Walz's China ties ahead of Tuesday's debate  —  Gov. Tim Walz and Sen. JD Vance descend on New York tomorrow for the first — and only — Vice Presidential debate.  Walz's campaign has introduced … ",
    "url": "https://www.mprnews.org/episode/2024/09/30/a-deeper-look-at-walzs-china-ties-ahead-of-tuesdays-debate"
  }
]