[
  {
    "text": "The public doesn't understand the risks of a Trump victory.  That's the media's fault  —  With democracy in the balance, the press must relay the crucial importance of this election and the dangers of a Trump win  —  Whatever doubts you may have about public-opinion polls, one recent example should not be dismissed.",
    "url": "https://www.theguardian.com/commentisfree/2023/nov/09/trump-president-democracy-threat-media-journalism"
  },
  {
    "text": "Judge Uses Eye-Opening Impeachment Analogy for Michael Cohen's Testimony That Trump Spoke in Code  —  Justice Engoron likened Michael Cohen's claim that Trump gave directives like a ‘mob boss’ to the former president's ‘perfect call’ with Ukraine's president  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-motion-verdict-new-york-civil-fraud-trial"
  },
  {
    "text": "Fulton County election office sent envelope possibly laced with fentanyl  —  An envelope possibly containing fentanyl has been sent to Georgia's Fulton County election office in an incident that Secretary of State Brad Raffensperger called “domestic terrorism” on Thursday.",
    "url": "https://www.axios.com/2023/11/09/fulton-county-georgia-election-office-threats"
  },
  {
    "text": "County elections offices receive suspicious envelopes  — County elections offices receive suspicious envelopes  —  OLYMPIA — Envelopes received by elections offices in King, Pierce, Skagit, and Spokane counties were found Wednesday to contain unknown powdery substances.",
    "url": "https://www.sos.wa.gov/about-office/news/2023/county-elections-offices-receive-suspicious-envelopes"
  },
  {
    "text": "Statement on Yousef Masoud  —  Below is a statement issued by The New York Times in response to allegations made by Honest Reporting and others against freelance photographer Yousef Masoud, who has contributed to coverage of the Israel-Hamas war for a number of outlets, including The New York Times.",
    "url": "https://www.nytco.com/press/statement-on-yousef-masoud/"
  },
  {
    "text": "Democratic Sen. Joe Manchin says he will not seek reelection  —  Sen. Joe Manchin III (D-W.Va.) announced Thursday he would not seek reelection in 2024, leaving the door open for Republicans to flip a seat in a solidly red state.  —  “After months of deliberation and long conversations with my family … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/09/manchin-senate-reelection/"
  },
  {
    "text": "Ramaswamy camp: The RNC sabotaged us in the debate spin room  —  There is bad blood brewing here.  —  Vivek Ramaswamy's campaign accused Republican National Committee Chair Ronna McDaniel of trying to limit his campaign's visibility in the post debate spin room, following critical remarks he made of her at the forum.",
    "url": "https://www.politico.com/news/2023/11/09/ramaswamy-camp-rnc-sabotage-debate-spin-room-00126446"
  },
  {
    "text": "'We're ungovernable': House Republicans nix votes on two funding bills as shutdown deadline nears  —  Funding to keep the government open is set to expire on Nov. 17, and there's no deal on how to avoid it.  —  WASHINGTON — House Republicans closed out the week by canceling votes … ",
    "url": "https://www.nbcnews.com/politics/congress/-ungovernable-house-republicans-nix-votes-two-funding-bills-shutdown-d-rcna124441"
  },
  {
    "text": "Exclusive: What the woodworker saw: Trump documents trial may put resort workers on witness stand, sources say  —  West Palm Beach, Florida CNN  —  A plumber, a maid, a chauffeur and a woodworker are among Mar-a-Lago staffers and contract workers who federal prosecutors may call to testify … ",
    "url": "https://www.cnn.com/2023/11/09/politics/mar-a-lago-documents-case-witnesses/"
  },
  {
    "text": "Peter Thiel Is Taking a Break From Democracy  —  This article was featured in One Story to Read Today, a newsletter in which our editors recommend a single must-read from The Atlantic, Monday through Friday.  Sign up for it here.  —  It wasn't clear at first why Peter Thiel agreed to talk to me.",
    "url": "https://www.theatlantic.com/politics/archive/2023/11/peter-thiel-2024-election-politics-investing-life-views/675946/"
  },
  {
    "text": "MTG Is Trashing Lauren Boebert as a ‘Whore’ to GOP Colleagues  —  Greene and Boebert have been going at it for nearly a year now.  But Greene's latest move is straight out of the high school cafeteria's playbook. … After Rep. Lauren Boebert helped get Rep. Marjorie Taylor Greene kicked … ",
    "url": "https://www.thedailybeast.com/marjorie-taylor-greene-is-trashing-lauren-boebert-as-a-whore-to-gop-colleagues"
  },
  {
    "text": "‘No, screw him’: Top Democrat balks at Tuberville push to move abortion debate to defense bill  —  Rep. Adam Smith warns that a defense policy bill won't pass if Republicans insist on tough abortion language.  —  The top Democrat on the House Armed Services Committee forcefully rejected … ",
    "url": "https://www.politico.com/news/2023/11/09/dems-tuberville-abortion-defense-00126384"
  },
  {
    "text": "The Supreme Court dismantled Roe.  States are restoring it one by one.  —  Support for abortion cuts across party lines, performing significantly better at the ballot box than Biden and other Democrats.  —  Issue 1 supporters cheer as they watch election results come in, Tuesday, Nov. 7, 2023, in Columbus Ohio.",
    "url": "https://www.politico.com/news/2023/11/09/abortion-rights-elections-red-states-00126225"
  },
  {
    "text": "Statement from GSA Administrator regarding FBI Director comments  —  WASHINGTON - The following is a statement from U.S. General Services Administrator Robin Carnahan regarding the FBI suburban headquarters site selection process.  The agency's site selection process and decision can be found … ",
    "url": "https://www.gsa.gov/about-us/newsroom/news-releases/statement-from-gsa-administrator-regarding-fbi-director-comments-11092023"
  },
  {
    "text": "McCarthy unloads on his GOP critics and says Mace deserves to lose reelection bid  —  Watch CNN Chief Congressional Correspondent Manu Raju's interview with former Speaker Kevin McCarthy this Sunday at 11 a.m. ET/8 a.m. PT on CNN's “Inside Politics.”  ﻿",
    "url": "https://www.cnn.com/2023/11/09/politics/mccarthy-comments-on-gop-critics/"
  },
  {
    "text": "Court debates free speech protections for election lies — including Trump's  —  Trump's false election claims arose during a Michigan Supreme Court argument over the prosecutions of two right-wing provocateurs.  —  Could Donald Trump be prosecuted for saying the election was rigged?",
    "url": "https://www.politico.com/news/2023/11/09/court-debates-free-speech-protections-for-election-lies-including-trumps-00126503"
  },
  {
    "text": "WaPo Took Down Hamas Cartoon Amid Staffers' ‘Deep Concerns,’ Internal Memo Indicates  —  Sally Buzbee, the executive editor of the Washington Post, sent an email to staff members on Wednesday night acknowledging their “many deep concerns and conversations” about a cartoon criticizing Hamas … ",
    "url": "https://freebeacon.com/media/wapos-buzbee-in-internal-memo-says-paper-took-down-hamas-cartoon-amid-staffers-deep-concerns/"
  },
  {
    "text": "FEC Commissioner Calls Out Her GOP Colleagues in Brutal 5-Sentence Takedown  —  SPECIAL TREATMENT  —  FEC Commissioner Ellen Weintraub on Thursday said her Republican colleagues have effectively put former President Donald Trump “in [a] category by himself” by refusing to investigate … ",
    "url": "https://www.thedailybeast.com/fec-commissioner-calls-out-her-gop-colleagues-in-brutal-5-sentence-takedown"
  },
  {
    "text": "Trump's Lawyers Argue Judges Don't Have a Role in Enforcing 14th Amendment Challenge on Day One of Michigan's Oral Arguments  —  Brewer and Columbo's arguments stem from a lawsuit filed by the nonprofit Free Speech for People alongside voters in the state against Secretary of State Jocelyn Benson … ",
    "url": "https://themessenger.com/politics/trumps-lawyers-argue-judges-dont-have-a-role-in-enforcing-14th-amendment-challenge-on-day-one-of-michigans-oral-arguments"
  },
  {
    "text": "Israel agrees to 4-hour daily pauses in Gaza fighting to allow civilians to flee, White House says  —  Israeli forces have severed northern Gaza from the rest of the besieged territory setting the stage for an expected push into the dense confines of Gaza City and an even bloodier phase of the month-old war.",
    "url": "https://apnews.com/article/israel-gaza-humanitarian-pauses-b8fc613ffd8b9351c0dc37b90b6e10dd"
  },
  {
    "text": "IRS provides tax inflation adjustments for tax year 2024  —  News Releases for Frequently Asked Questions  —  WASHINGTON — The Internal Revenue Service today announced the annual inflation adjustments for more than 60 tax provisions for tax year 2024, including the tax rate schedules and other tax changes.",
    "url": "https://www.irs.gov/newsroom/irs-provides-tax-inflation-adjustments-for-tax-year-2024"
  },
  {
    "text": "Feds Target GOP Super PAC That Took COVID Loans  —  The FEC is looking into why a GOP Super PAC got money from a COVID-19 loan program.  —  Since the beginning of the Small Business Administration's loan program during the COVID-19 pandemic, there have been stories about fraud, abuse … ",
    "url": "https://www.thedailybeast.com/feds-target-gop-super-pac-that-took-covid-loans"
  },
  {
    "text": "Gruesome Footage of Oct. 7 Hamas Atrocities Screens in Hollywood Under Heavy Guard  —  On Wednesday night, with a sizable security presence and protesters audible through the walls, some 200 members of the industry screened ‘Bearing Witness,’ comprising 43 minutes of uncensored footage, at the Museum of Tolerance in West L.A.",
    "url": "https://www.hollywoodreporter.com/news/general-news/hollywood-screening-bearing-witness-hamas-israel-attack-1235642773/"
  },
  {
    "text": "'The Phone Doesn't Stop': Overwhelming Demands For A Cease-Fire Catch Democrats Off Guard  —  Congressional staff say the mood inside the Capitol is tense, stifling and bewildering as members brush off their constituents' outrage.  —  An end to the bloodshed in the Israeli-Hamas conflict seemed … ",
    "url": "https://www.huffpost.com/entry/calls-for-congress-ceasefire-gaza-israel_n_654d4d0ce4b0373d70b16b0f"
  }
]