[
  {
    "text": "GOP Sen. Mitt Romney says Biden should have pardoned Trump  —  Romney, an outspoken Trump critic, told MSNBC's Stephanie Ruhle that Biden “made an enormous error” by not pardoning Trump in federal cases or pressuring New York prosecutors to drop the hush money charges.",
    "url": "https://www.nbcnews.com/politics/2024-election/gop-sen-mitt-romney-says-biden-pardoned-trump-rcna152420"
  },
  {
    "text": "Biden Offers to Debate Trump, With Terms, Shunning the Debate Commission  —  The president wants two debates before early voting begins, with no crowds.  Donald Trump's camp has said it would debate “anytime and anywhere.”  —  President Biden is willing to debate former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/05/15/us/politics/biden-trump-debates.html"
  },
  {
    "text": "Former far-right hard-liner says pro-voucher billionaires are using school board races to sow distrust in public education  —  The largesse from billionaires Tim Dunn and brothers Farris and Dan Wilks has made its way into local politics.  Courtney Gore, a Republican school board member in Granbury … ",
    "url": "https://www.texastribune.org/2024/05/15/texas-tim-dunn-wilks-brothers-vouchers-courtney-gore/"
  },
  {
    "text": "A GOP Texas school board member campaigned against schools indoctrinating kids.  Then she read the curriculum.  —  Courtney Gore, a Granbury ISD school board member, has disavowed the far-right platform she campaigned on.  Her defiance has brought her backlash.",
    "url": "https://www.texastribune.org/2024/05/15/texas-granbury-isd-school-board-courtney-gore/"
  },
  {
    "text": "Supreme Court allows Louisiana to use congressional map with second majority-Black district  —  The court's decision is the latest twist in a long-running battle over the state's congressional map.  —  WASHINGTON — The Supreme Court on Wednesday paved the way for Louisiana to use … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-allows-louisiana-use-congressional-map-second-majority-b-rcna151955"
  },
  {
    "text": "Trump said men would see his mistreatment of Stormy Daniels as “cool.”  His trial suggests otherwise  —  Stormy Daniels is just the latest woman to note Trump uses coercion because he's incapable of persuasion  —  Despite all the press hand-wringing about Michael Cohen's so-called credibility issues … ",
    "url": "https://www.salon.com/2024/05/15/said-men-would-see-his-mistreatment-of-stormy-daniels-as-cool-his-trial-suggests-otherwise/"
  },
  {
    "text": "USCP Drug Investigation  —  The United States Capitol Police (USCP) is investigating a roughly one-inch by one-inch zip lock bag with a small amount of a white powdery substance, which field tested positive for cocaine.  —  The small bag was found on the floor of a hallway inside USCP headquarters.",
    "url": "https://www.uscp.gov/media-center/press-releases/uscp-drug-investigation"
  },
  {
    "text": "House Democrats Fume Over Unprecedented Israeli Rebuke Of Lawmakers  —  Congressional aides told HuffPost a May 8 letter from Israel's ambassador was “stunning,” “embarrassing” and “verging on offensive.”  —  LOADING  —  One week after Israel's ambassador to the U.S. sent dozens of Democrats … ",
    "url": "https://www.huffpost.com/entry/israeli-ambassador-blasts-democrats-letter_n_6644fde3e4b00df0c6b6cba5"
  },
  {
    "text": "17% of Voters Blame Biden for the End of Roe  —  The mistaken belief, in a new poll, shows how even as abortion is mobilizing Democrats, confusion over the issue is also a challenge.  —  Nearly one in five voters in battleground states says that President Biden is responsible for ending … ",
    "url": "https://www.nytimes.com/2024/05/15/upshot/abortion-biden-trump-blame.html"
  },
  {
    "text": "Crew trapped on Baltimore ship, seven weeks after bridge collapse  —  As a controlled explosion rocked the Dali on Monday, nearly two dozen sailors remained on board, below deck in the massive ship's hull.  —  The simultaneous blasts sent pieces of Baltimore's once iconic Francis Scott Key Bridge … ",
    "url": "https://www.bbc.com/news/world-us-canada-69011124"
  },
  {
    "text": "'I'm really curious about the dog': Trump weighs in on Kristi Noem at a private fundraiser  —  Trump has largely avoided weighing in on the dog controversy publicly, as the South Dakota governor continues to face questions about shooting her pet dead 20 years ago.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-kristi-noem-really-curious-dog-fundraiser-rcna152444"
  },
  {
    "text": "Barge collides with Pelican Island Causeway in Texas, causing damage and oil spill  —  A barge has collided with the Pelican Island Causeway in Galveston, Texas, damaging the bridge, closing the roadway to all vehicular traffic and causing an oil spill.  —  The collision occurred at around 10 a.m. local time.",
    "url": "https://www.cbsnews.com/news/pelican-island-bridge-causeway-galveston-texas-barge-collision/"
  },
  {
    "text": "We're in a pivotal moment in American history.  We cannot retreat  —  Clearly, our job is not just to re-elect Biden.  It's much more than that  —  In 1776, Americans, living in a British colony, put their lives on the line and fought for independence from the king of England.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/may/15/bernie-sanders-election-biden"
  },
  {
    "text": "Biden aides worry about psychological torment as Hunter heads for trial  —  The president has expressed fear that his son may serve time in prison.  —  President Joe Biden will soon have to watch and wait as 12 jurors in his home state decide whether his son is guilty of felony gun charges … ",
    "url": "https://www.politico.com/news/2024/05/15/hunter-biden-trial-psychological-torment-00158028"
  },
  {
    "text": "U.S. seeing “increasing” number of threats to election, intelligence chief says … - Both Haines and Easterly said the federal government's ability to protect elections has increased in recent years and that it has never been more prepared.  — Easterly said election workers have resigned over threats they received.",
    "url": "https://www.axios.com/2024/05/15/us-seeing-increasing-number-of-threats-to-election-intelligence-chief-says"
  },
  {
    "text": "Russian Disinformation Videos Smear Biden Ahead of U.S. Election  —  Many of the videos are trying to appeal to right-wing voters with fake messages about President Biden, experts say.  —  Last month, a video began circulating on social media purporting to tell the story of an internet troll farm … ",
    "url": "https://www.nytimes.com/2024/05/15/us/politics/russia-disinformation-election.html"
  },
  {
    "text": "And then there were two: Seventh Native American tribe bans Gov. Noem  —  The Crow Creek Sioux Tribe in central South Dakota has joined six of the state's tribes in preventing Gov. Kristi Noem from coming onto their tribal land, leaving the governor just two reservations she can still travel to.",
    "url": "https://www.thedakotascout.com/p/and-then-there-were-two-seventh-native"
  }
]