[
  {
    "text": "FEMA's response to Texas flood slowed by Noem's cost controls  —  As monstrous floodwaters surged across central Texas late last week, officials at the Federal Emergency Management Agency leapt into action, preparing to deploy critical search and rescue teams and life-saving resources, like they have in countless past disasters.",
    "url": "https://cnn.com/2025/07/09/politics/fema-texas-flood-noem"
  },
  {
    "text": "Brazil will respond to Trump's 50% tariff with ‘reciprocity,’ says da Silva … Brazilian President Luiz Inacio Lula da Silva said Wednesday that his country will respond with reciprocity to U.S. President Donald Trump's newly announced 50% tariff rate on his country's exports … ",
    "url": "https://www.cnbc.com/2025/07/09/trump-brazil-tariffs-bolsonaro.html"
  },
  {
    "text": "Comey Tracked by Secret Service After Post Critical of Trump  —  After the former F.B.I. director put a picture on Instagram of seashells arranged to say “86 47,” law enforcement tailed his car and tracked his cellphone, steps usually reserved for serious threats.",
    "url": "https://www.nytimes.com/2025/07/09/us/politics/james-comey-secret-service.html?unlocked_article_code=1.VE8.TGun.w6VwPKhnTw6_&smid=url-share"
  },
  {
    "text": "GOP Senators Had No Idea They Voted For Controversial Gambling Tax  —  How the sausage is made in Washington: In the dark and behind closed doors.  —  WASHINGTON - The massive tax and spending bill that President Donald Trump signed into law last week contains a provision limiting tax deductions … ",
    "url": "https://www.huffpost.com/entry/gambling-tax-deduction-trump-bill_n_686dabede4b07e11dd9982a8"
  },
  {
    "text": "X Chief Says She Is Leaving the Social Media Platform  —  Linda Yaccarino, whom Elon Musk hired to run X in 2023, grappled with the challenges the company faced after Mr. Musk took over.  —  Linda Yaccarino, the chief executive of X and a top lieutenant to its owner, Elon Musk … ",
    "url": "https://www.nytimes.com/2025/07/09/technology/linda-yaccarino-x-steps-down.html"
  },
  {
    "text": "X CEO Linda Yaccarino to step down  —  X CEO Linda Yaccarino said Wednesday she is stepping down from her role. … - Under her leadership, X has managed to maintain its dominance as the top social discourse app in the U.S., but its ads business still faces challenges.",
    "url": "https://www.axios.com/2025/07/09/x-ceo-linda-yaccarino-resigns"
  },
  {
    "text": "Trump says the president of Liberia, where English is the official language, speaks ‘good English’  —  Trump's remarks came during a meeting in Washington with the leaders of several African nations.  Many people who live in Liberia are descendants of freed American slaves.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-president-liberia-english-official-language-speaks-good-eng-rcna217827"
  },
  {
    "text": "Over 2,000 senior staff set to leave NASA under agency push … Many of those leaving also serve in NASA's core mission sets, according to the documents.  Those leaving include 1,818 staff serving in mission areas like science or human space flight, with the rest performing mission support roles like IT … ",
    "url": "https://www.politico.com/news/2025/07/09/nasa-staff-departures-00444674"
  },
  {
    "text": "Measles Cases Hit Record High, 25 Years After U.S. Eliminated the Disease  —  Experts worry that if vaccination rates do not improve, deadly outbreaks will become the new normal.  —  There have now been more measles cases in 2025 than in any other year since the contagious virus … ",
    "url": "https://www.nytimes.com/2025/07/09/well/us-measles-record-outbreaks.html"
  },
  {
    "text": "Trump administration targets Comey, Brennan with new investigation  —  The Justice Department confirmed an investigation into two frequent Trump targets.  The news comes as DOJ faces scrutiny over its handling of Jeffrey Epstein investigation material.  —  The Trump administration has put … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-administration-targets-comey-brennan-new-investigation-rcna217713"
  },
  {
    "text": "Biden's physician declines to cooperate in GOP probe of former president's mental fitness  —  Kevin O'Connor, who served as Joe Biden's physician while the former president was in office, is refusing to testify in a closed-door interview as part of the House GOP probe into Biden's mental acuity.",
    "url": "https://www.politico.com/live-updates/2025/07/09/congress/biden-doctor-refuses-to-testify-00443736"
  },
  {
    "text": "With new power, Trump will move immediately to lay off federal workers  —  President Donald Trump has seized the authority to lay off federal workers and reorganize the federal government in a way that critics say no president has been able to do in more than 100 years.",
    "url": "https://www.usatoday.com/story/news/politics/2025/07/09/trump-wins-broad-authority-to-lay-off-federal-workers-without-congress/84520149007/"
  },
  {
    "text": "Trump Administration Renews Attacks On Harvard With Negotiations Uncertain  —  The Department of Homeland Security issued administrative subpoenas seeking data about the university's international students, while two federal agencies challenged Harvard's accreditation.",
    "url": "https://www.nytimes.com/2025/07/09/us/politics/trump-harvard-data-accreditation.html"
  },
  {
    "text": "California awaits disaster relief as GOP offers full support of Texas  —  California Gov. Gavin Newsom (D) on a trip to South Carolina this week highlighted the plight of Los Angeles communities still reeling from January's devastating wildfires.  —  For months, California Gov. Gavin Newsom … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/09/texas-flooding-trump-politics-disaster-relief/"
  },
  {
    "text": "Trump officials used shadowy website to target pro-Palestinian academics for deportation, court records show … The federal judge currently overseeing a trial in the case unsealed the deposition transcripts, which contain hundreds of pages of sworn testimony by administration officials about the campus deportation effort.",
    "url": "https://www.politico.com/news/2025/07/09/pro-palestinian-deportation-documents-trial-00445238"
  },
  {
    "text": "The GOP's New Lie After Cutting $1 Trillion From Medicaid: We Gave It More Money!  —  “We are increasing Medicaid expenditures by $200 billion,” Rep. Rob Bresnahan (R-Pa.) falsely said of Trump's tax law, which will strip health care from millions.  —  WASHINGTON ― … ",
    "url": "https://www.huffpost.com/entry/house-republicans-cut-medicaid-damage-control_n_686d96a0e4b041f69cfd6636"
  },
  {
    "text": "ICE Is Searching a Massive Insurance and Medical Bill Database to Find Deportation Targets  —  Agents from Immigration and Customs Enforcement (ICE) have gained access to a massive database of health and car insurance claims and are using it to track down people they want to deport … ",
    "url": "https://www.404media.co/ice-is-searching-a-massive-insurance-and-medical-bill-database-to-find-deportation-targets/"
  },
  {
    "text": "Slingshot Poll: The NYC Mayor's Race, July 2-July 6  —  Slingshot conducted a poll of registered voters in NYC from July 2nd to July 6th.  The poll provides an early look at the electorate after the Democratic primary and ahead of an intriguing general election on November 4th",
    "url": "https://www.slingshotstrat.com/media/slingshot-mayoral-poll-general-election-7-9"
  },
  {
    "text": "U.S. Pushes More African Countries to Accept Deported Migrants  —  Five countries whose leaders held talks with Trump at the White House were sent a U.S. proposal to accept deportees, document shows  —  WASHINGTON—As President Trump met Wednesday with the leaders of five West African countries … ",
    "url": "https://www.wsj.com/politics/policy/u-s-pushes-more-african-countries-to-accept-deported-migrants-b6f330c5"
  },
  {
    "text": "'They're killing us': Immigrants complain of inhumane conditions inside NYC holding site … We rely on your support to make local news available to all  —  Make your contribution now and help Gothamist thrive in 2025.  Donate today  —  Gothamist is funded by sponsors and member donations",
    "url": "https://gothamist.com/news/theyre-killing-us-immigrants-complain-of-inhumane-conditions-inside-nyc-holding-site"
  },
  {
    "text": "Governor Abbott Announces Special Session Agenda  —  Governor Greg Abbott today issued a proclamation identifying 18 agenda items for the upcoming Special Session that begins at 12:00 PM on Monday, July 21.  —  “We delivered on historic legislation in the 89th Regular Legislative Session … ",
    "url": "https://gov.texas.gov/news/post/governor-abbott-announces-special-session-agenda-"
  },
  {
    "text": "ICE accused of racial profiling in detentions of Latino U.S. citizens  —  A growing number of U.S. citizens — many of them Latinos — are reporting they were detained for various periods by immigration agents in what critics say were instances of racial profiling and overzealous policing.",
    "url": "https://www.axios.com/2025/07/09/ice-us-citizens-detention-racial-profiling"
  },
  {
    "text": "Exclusive: Evidence of cell phone surveillance detected at anti-ICE protest  —  Mobile network anomalies consistent with cell phone surveillance were detected at a July 4 protest at an Immigration and Customs Enforcement field office in Washington state.  Those anomalies, according … ",
    "url": "https://san.com/cc/exclusive-evidence-of-cell-phone-surveillance-detected-at-anti-ice-protest/"
  },
  {
    "text": "Meet the new national police force  —  A version of this story appeared in CNN's What Matters newsletter.  To get it in your inbox, sign up for free here.  —  CNN  —  The agency of mask-wearing officers who aren't afraid to smash windows, detain lawmakers and pluck nonviolent … ",
    "url": "https://cnn.com/2025/07/09/politics/ice-cbp-police-los-angeles-immigration"
  },
  {
    "text": "Noem claims 1 in 6 survivors of Lahaina wildfires had to ‘trade sexual favors’ for supplies … The study found that women had “survival sex” with “a landlord, an employer, family members, friends and acquaintances.”  —  Khara Jabola-Carolus, one of the authors of the Tagnawa report … ",
    "url": "https://www.politico.com/news/2025/07/09/kristi-noem-fema-attack-00445683"
  },
  {
    "text": "Scoop: Secret White House meeting on Gaza raises hopes for ceasefire deal  —  Senior U.S., Israeli and Qatari officials held secret talks at the White House on Tuesday that honed in on the key remaining sticking point for a long-sought ceasefire and hostage deal in Gaza, two sources with direct knowledge tell Axios.",
    "url": "https://www.axios.com/2025/07/09/gaza-ceasefire-meeting-witkoff-israel-qatar"
  },
  {
    "text": "Elon Musk Consulted Curtis Yarvin, Right-Wing Thinker, on Third Party  —  The two men spoke about Mr. Musk's push to create the America Party before the midterm elections.  Mr. Yarvin has expressed support for a monarchy, along with provocative ideas about race.",
    "url": "https://www.nytimes.com/2025/07/09/us/politics/elon-musk-curtis-yarvin-third-party.html?unlocked_article_code=1.VE8.znZV.GttZBzozPgQW&smid=url-share"
  },
  {
    "text": "Appeals court throws out right-wing influencer's conviction for 2016 election interference  —  A federal appeals court on Wednesday threw out a right-wing influencer's conviction for spreading misinformation online about ways to vote in the 2016 presidential election in an attempt to stifle Democratic turnout.",
    "url": "https://thehill.com/regulation/court-battles/5392329-appeals-court-reverses-douglass-mackey-conviction/"
  },
  {
    "text": "Scoop: RFK Jr. postpones Obamacare coverage panel meeting  —  Health Secretary Robert F. Kennedy Jr.'s office has postponed a meeting of the U.S. Preventive Services Task Force scheduled for Thursday that was due to take up healthy diet, physical activity and other steps to prevent cardiovascular disease, sources familiar told Axios.",
    "url": "https://www.axios.com/2025/07/09/rfk-jr-hhs-aca-uspstf-meeting"
  }
]