[
  {
    "text": "A Crisis of MAGA Faith  —  How's this for a vibe check: A Quinnipiac University poll yesterday found that a whopping 63 percent of voters disapprove of how the Trump administration is handling the Epstein-files controversy, with a scant 17 percent approving.  Happy Thursday.  —  What Would William of Ockham Say?",
    "url": "https://www.thebulwark.com/p/a-crisis-of-maga-faith-trump-epsitein-files-q-anon-conspiracy-theories"
  },
  {
    "text": "Trump faces backlash as 69% believe Epstein details concealed, Reuters/Ipsos poll finds  —  Most Americans think President Donald Trump's administration is hiding information about accused sex-trafficker Jeffrey Epstein and give it poor marks on the issue after pledging to make public documents in the case, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/trump-faces-backlash-69-believe-epstein-details-concealed-reutersipsos-poll-2025-07-17/"
  },
  {
    "text": "White House defends handling of Epstein files, chides press for coverage  —  White House press secretary Karoline Leavitt defended the Trump administration's handling of the case of deceased sex offender Jeffrey Epstein, saying “some of the most trusted voices in the Republican Party movement” … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/17/trump-presidency-news/"
  },
  {
    "text": "Looming Epstein vote has Republicans eager to leave Washington … Questions about the late convicted sex predator have exploded inside the GOP since the Justice Department announced earlier this month it had concluded there was no foul play involved in his 2019 death while in federal custody and there is no … ",
    "url": "https://www.politico.com/news/2025/07/17/jeffrey-epstein-house-discharge-vote-00459758"
  },
  {
    "text": "Democratic Senators Walk Out Of Trump Judicial Nominee Emil Bove's Hearing  —  Republicans say the controversial nominee is ready for a floor vote.  Democrats say they're moving too fast.  —  Democratic members of the Senate Judiciary Committee abruptly walked out of a Thursday hearing … ",
    "url": "https://www.huffpost.com/entry/democratic-senators-trump-judicial-nominee-emil-bove-hearing_n_68791c88e4b007ebff46f72e"
  },
  {
    "text": "Maurene Comey warns her former colleagues: ‘Fear is the tool of the tyrant’ … NEW YORK — One day after being fired by the Justice Department, Maurene Comey told her former colleagues that “fear is the tool of a tyrant,” appearing to take aim at the upper ranks of DOJ and perhaps the president … ",
    "url": "https://www.politico.com/news/2025/07/17/maurene-comey-letter-firing-00459560"
  },
  {
    "text": "Prosecutor Fired by Trump Calls Fear the ‘Tool of a Tyrant’  —  Maurene Comey, who helped prosecute Jeffrey Epstein and Sean Combs, was dismissed without a detailed explanation.  She is the daughter of James B. Comey, a longtime adversary of President Trump.",
    "url": "https://www.nytimes.com/2025/07/17/nyregion/maurene-comey-fired-trump.html"
  },
  {
    "text": "Senate Approves Trump's Bid to Cancel Foreign Aid and Public Broadcast Funds  —  The bill to claw back $9 billion in congressionally approved spending passed over the objections of Republicans who said it abdicated the legislative branch's power of the purse.",
    "url": "https://www.nytimes.com/2025/07/17/us/politics/senate-vote-trump-bill-pbs-npr-foreign-aid.html?unlocked_article_code=1.XE8.NS_g.iZ-SGQQOs1UM&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Senate Votes to Strip $1.1 Billion From Public Broadcasting in Blow to PBS and NPR  —  The Senate voted narrowly early Thursday morning to strip $1.1 billion in funding from the Corporation for Public Broadcasting, in a severe blow to 1,500 local public TV and radio stations as well as PBS and NPR.",
    "url": "https://variety.com/2025/politics/news/senate-strips-billion-public-broadcasting-1236462722/"
  },
  {
    "text": "Justice Dept. Asks for 1-Day Sentence for Ex-Officer Convicted in Breonna Taylor Raid  —  The move was a stunning reversal of Biden-era efforts to address racial disparities in local law enforcement.  —  The Justice Department's civil rights chief has asked a federal judge to sentence … ",
    "url": "https://www.nytimes.com/2025/07/17/us/politics/justice-department-brett-hankison-sentence-breonna-taylor.html?unlocked_article_code=1.XE8.DiU9.p_GjRd1NwVmq&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump administration hands over Medicaid recipients' personal data, including addresses, to ICE  —  Immigration and Customs Enforcement officials will be given access to the personal data of the nation's 79 million Medicaid enrollees, including home addresses and ethnicities … ",
    "url": "https://apnews.com/article/immigration-medicaid-trump-ice-ab9c2267ce596089410387bfcb40eeb7"
  },
  {
    "text": "This Democrat Won't Let Go of the Jeffrey Epstein Case, Either  —  Senator Ron Wyden has found that four banks waited until Mr. Epstein's arrest on federal charges to flag $1.5 billion in suspicious transactions.  Mr. Wyden wants the documents made public.  —  President Trump and his administration … ",
    "url": "https://www.nytimes.com/2025/07/17/business/epstein-banks-wyden-trump.html?unlocked_article_code=1.XE8.Htgu.HiwOJbDA06Zd&smid=url-share"
  },
  {
    "text": "When institutions crumble, strongmen step in  —  Trump wants to be the sole authority.  With trust in institutions cratering, he sees his opportunity.  —  What would it take to put the swirling conspiracy theories about Jeffrey Epstein to bed?  Nothing complicated; just an authoritative … ",
    "url": "https://www.washingtonpost.com/opinions/2025/07/17/trust-institutions-authoritarianism-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUyNzI0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0MTA3MTk5LCJpYXQiOjE3NTI3MjQ4MDAsImp0aSI6IjM5OWFlYjA1LTU2YjktNGE0OC1iZTIxLWJlNmEwN2IzMzcwNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA3LzE3L3RydXN0LWluc3RpdHV0aW9ucy1hdXRob3JpdGFyaWFuaXNtLXRydW1wLyJ9.79uEl7NS5fWfwl__Wt0hhGXBrSHQBfo65QNcGRkH3jc&itid=gfta"
  },
  {
    "text": "Russ Vought: Appropriations process ‘has to be less bipartisan’  —  Office of Management and Budget Director Russ Vought isn't interested in giving assurances to lawmakers on Capitol Hill that the White House will abide by any bipartisan spending agreements made this year.",
    "url": "https://www.politico.com/live-updates/2025/07/17/congress/russ-vought-appropriations-process-has-to-be-less-bipartisan-00459479"
  },
  {
    "text": "Trump's Budget Chief Gives The Middle Finger To Congress And The Constitution  —  Russ Vought said to expect more massive spending cuts because Trump is “not cowing to a legislative branch's understanding of its own authorities and powers.”  —  WASHINGTON — President Donald Trump's budget … ",
    "url": "https://www.huffpost.com/entry/russ-vought-scoffs-congress-spending-cuts_n_687907bce4b007ebff46dc4e"
  },
  {
    "text": "New U.S. assessment finds American strikes destroyed only one of three Iranian nuclear sites  —  President Donald Trump rejected a military plan for more comprehensive strikes on Iran's nuclear program that would have lasted weeks, NBC News has also learned.",
    "url": "https://www.nbcnews.com/politics/national-security/new-us-assessment-finds-american-strikes-destroyed-only-one-three-iran-rcna218761"
  },
  {
    "text": "Alligator Alcatraz isn't meant for minors.  A 15 year old ended up there anyway  —  In the rush to open a detention camp in the Florida Everglades for “some of the most vicious” migrants illegally in the country, state and federal officers detained a 15-year-old boy with no criminal record … ",
    "url": "https://www.miamiherald.com/news/politics-government/state-politics/article310785240.html"
  },
  {
    "text": "DOGE Put Free Tax Filing Tool on Chopping Block After One Meeting With Lobbyists  —  A key operative from DOGE initiated plans to potentially kill Direct File, the free tax filing tool developed by the IRS, after offering assurances it would be spared from cuts.",
    "url": "https://www.wired.com/story/doge-direct-file-chopping-block/"
  },
  {
    "text": "Trump's Coke push will cost thousands of farm jobs, corn group warns  —  President Trump's push to switch the sweetener in Coke to cane sugar could cost thousands of U.S. jobs, an influential corn industry group said. … - The company later issued a statement that did not confirm … ",
    "url": "https://www.axios.com/2025/07/17/trump-cane-sugar-coke-corn"
  },
  {
    "text": "White House releases Trump health update after speculation over swollen legs, bruised hands  —  Leavitt said President Trump wanted her to share his health update in an effort of transparency amid speculation  —  White House press secretary Karoline Leavitt revealed additional details … ",
    "url": "https://www.foxnews.com/politics/white-house-releases-trump-health-update-after-speculation-over-swollen-legs-bruised-hands"
  },
  {
    "text": "“Even God Cannot Hear Us Here”: What I Witnessed Inside an ICE Women's Prison  —  Tufts University doctoral student Rümeysa Öztürk opens up for the first time about her shocking arrest and 45 days in a South Louisiana processing facility.  She recalls the generous … ",
    "url": "https://www.vanityfair.com/news/story/rumeysa-ozturk-what-i-witnessed-inside-an-ice-womens-prison"
  },
  {
    "text": "Former NYPD Commissioner Accuses Mayor Adams of Running “Criminal Enterprise” and Cites ProPublica Investigation  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  What Happened … ",
    "url": "https://www.propublica.org/article/lawsuit-nyc-mayor-eric-adams-community-response-team-thomas-donlon"
  },
  {
    "text": "Flight Manifests Reveal Dozens of Previously Unknown People on Three Deportation Flights to El Salvador  —  The flight manifests for three legally contested deportation flights from Texas to El Salvador contain dozens of additional, unaccounted for passengers than a previously published Department … ",
    "url": "https://www.404media.co/flight-manifests-reveal-dozens-of-previously-unknown-people-on-three-deportation-flights-to-el-salvador/"
  },
  {
    "text": "Voting age to be lowered to 16 by next general election  —  Sixteen and 17-year-olds would be able to vote at the next general election, under government plans to lower the voting age.  —  The pledge is part of a raft of measures being introduced through a new Elections Bill.",
    "url": "https://www.bbc.com/news/articles/c628ep4j5kno"
  }
]