[
  {
    "text": "Republicans rush to distance from “disaster” Arizona abortion ruling … - Just on Monday, former President Trump put vulnerable House Republicans at ease by stopping short of endorsing a nationwide abortion ban. … - The 19th century law provides exceptions only to save the life of the mother.",
    "url": "https://www.axios.com/2024/04/09/arizona-abortion-ban-republicans-supreme-court"
  },
  {
    "text": "Trump's abortion stance could put Florida Republicans in a bind  —  The state GOP's strict abortion bans could be repealed if voters approve a ballot initiative in November.  —  MIAMI — There's no state that will need to navigate Donald Trump's abortion stance quite like Florida … ",
    "url": "https://www.politico.com/news/2024/04/10/trump-abortion-stance-florida-republicans-00151392"
  },
  {
    "text": "Arizona lawmaker leads prayer circle on state seal at Capitol building, sparking backlash  —  Arizona Sen. Anthony Kern invited a prayer group to the Senate floor on Monday.  —  Seen in a video filmed by an anonymous attendee, Kern led the group, who spoke in tongues, through a prayer as they knelt over the state seal.",
    "url": "https://www.azcentral.com/story/news/politics/arizona/2024/04/09/anthony-kern-prayer-circle-arizona-capitol-floor/73264047007/"
  },
  {
    "text": "Arizona Republicans denounce revived 1864 abortion ban in sudden reversal  —  As the party struggles to talk about abortion, response marks fastest and strongest rebuke of bans since the fall of Roe  —  Hours after Arizona's supreme court declared on Tuesday that a 160-year-old abortion ban … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/10/arizona-republicans-against-state-abortion-ban"
  },
  {
    "text": "Abortion in Arizona set to be illegal in nearly all circumstances, state high court rules  —  The Arizona Supreme Court upheld a 160-year-old abortion ban that could shutter abortion clinics in the state.  —  The ruling indicated the ban can only be “prospectively enforced” and enforcement of the law is stayed for 14 days.",
    "url": "https://www.azcentral.com/story/news/politics/arizona/2024/04/09/arizona-abortion-law-state-supreme-court-upholds-near-total-ban/73251148007/"
  },
  {
    "text": "Biden administration imposes first-ever national drinking water limits on toxic PFAS  —  The Biden administration on Wednesday finalized strict limits on certain so-called “forever chemicals” in drinking water that will require utilities to reduce them to the lowest level they can be reliably measured.",
    "url": "https://apnews.com/article/forever-chemicals-pfas-pollution-epa-drinking-water-1c8804288413a73bb7b99fc866c8fa51"
  },
  {
    "text": "Operatives must pay up to $1.25 million for robocall scheme to suppress Black votes  —  Two right-wing political operatives must pay up to $1.25 million in fines after they were found liable for launching a robocall campaign designed to keep Black New Yorkers from voting in the 2020 election … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/09/settlement-new-york-robocalls-black-voters/"
  },
  {
    "text": "Becerra weighs exit from Biden administration for California gubernatorial bid  —  Health Secretary Xavier Becerra, the former California attorney general, would jump into an already crowded field of Democratic contenders.  —  SACRAMENTO, California — Health and Human Services Secretary Xavier Becerra … ",
    "url": "https://www.politico.com/news/2024/04/09/biden-cabinet-secretary-california-governors-race-00151407"
  },
  {
    "text": "RFK Jr. campaign official attended Jan. 6 ‘Stop the Steal’ rally and wanted ‘favorite President’ Trump to run for third term  —  A New York-based campaign official for Robert F. Kennedy Jr. who raised the possibility that voting for the independent presidential candidate would help Donald … ",
    "url": "https://www.cnn.com/2024/04/09/politics/rfk-jr-campaign-official-january-6-trump"
  },
  {
    "text": "Florida woman who stole, sold Biden's daughter's diary sentenced to 1 month in prison  —  Aimee Harris took diary belonging to Ashley Biden, sold it to Project Veritas, a conservative group known for conducting hidden-camera stings  —  A Florida woman who stole the diary of President Biden's daughter … ",
    "url": "https://www.foxnews.com/politics/florida-woman-stole-sold-bidens-daughters-diary-sentenced-one-month-prison"
  },
  {
    "text": "I've Been at NPR for 25 Years.  Here's How We Lost America's Trust.  —  Uri Berliner, a veteran at the public radio institution, says the network lost its way when it started telling listeners how to think.  —  You know the stereotype of the NPR listener: an EV-driving, Wordle-playing, tote bag-carrying coastal elite.",
    "url": "https://www.thefp.com/p/npr-editor-how-npr-lost-americas-trust"
  },
  {
    "text": "Letitia James Nears Green Light to Start Taking Donald Trump's Assets  —  The New York Attorney General may start collecting Trump assets if he fails to post a bond by next Monday, a leading real estate lawyer has said.  —  Paul Golden, author of Litigating Constructive Trusts and a partner … ",
    "url": "https://www.newsweek.com/donald-trump-judge-arthur-engoron-fraud-case-bond-manhattan-new-york-letitia-james-1888535"
  },
  {
    "text": "Transmittal No  —  The State Department has made a determination approving a possible Foreign Military Sale to the Government of Ukraine of HAWK Phase III Missile System Sustainment and related elements of logistics and program support for an estimated cost of $138 million.",
    "url": "https://www.dsca.mil/press-media/major-arms-sales/ukraine-hawk-phase-iii-missile-system-sustainment"
  },
  {
    "text": "Siding with special counsel, Cannon agrees to keep witness identities secret  —  Despite sharp words for prosecutors, the Trump-appointed judge in the classified documents case said they presented evidence to justify the sealing.  —  The judge handling the classified documents case … ",
    "url": "https://www.politico.com/news/2024/04/09/cannon-agrees-to-keep-witness-identities-secret-00151402"
  },
  {
    "text": "Zelensky says he doesn't need ‘primitive’ ideas from Trump on Ukraine  —  Ukrainian President Volodymyr Zelensky said in a Tuesday interview that he does not need “primitive” ideas from former President Trump on ways to resolve the war with Russia.  —  In an interview with Axel Springer media outlets … ",
    "url": "https://thehill.com/policy/international/4583975-zelensky-trump-primitive-ideas-ukraine/"
  },
  {
    "text": "Trump's ‘Virtues’ and Other Fairy Tales  —  Sad, sorry, sickening sycophantism from the Claremont Institute board chairman.  —  FOLLOW THE MONEY.  That phrase—a legendary Hollywood screenwriter's addition to the Watergate lore—turns out in fact to be excellent advice for an investigation.",
    "url": "https://www.thebulwark.com/p/trumps-virtues-and-other-fairy-tales"
  },
  {
    "text": "Alabama secretary of state says Democratic convention too late to get Biden on ballot this fall  —  Alabama Secretary of State Wes Allen has notified the state and national Democratic parties that the scheduled date of the Democratic National Convention is a few days after the deadline … ",
    "url": "https://www.al.com/news/2024/04/alabama-secretary-of-state-says-democratic-convention-too-late-to-get-biden-on-ballot-this-fall.html"
  },
  {
    "text": "Texas Attorney General sues to stop guaranteed income program for Houston-area residents  —  HOUSTON (AP) — Texas' attorney general filed a lawsuit on Tuesday seeking to stop a guaranteed income program set to start this month for Houston-area residents.  —  The program by Harris County … ",
    "url": "https://apnews.com/article/lawsuit-guaranteed-income-program-texas-harris-county-d875494123a749a90b74e1f06c218468"
  },
  {
    "text": "US has no evidence of unfolding genocide in Gaza: Pentagon  —  The United States does not have evidence that Israel is committing genocide in Gaza as it carries out its war against Palestinian Islamist group Hamas, U.S. Defense Secretary Lloyd Austin told a Senate hearing on Tuesday.",
    "url": "https://www.reuters.com/world/middle-east/us-has-no-evidence-unfolding-genocide-gaza-pentagon-2024-04-09/"
  },
  {
    "text": "Gen Z Is Ruining Scrabble Now!  —  Some things are sacred.  —  Christmas.  Easter.  The Final Four.  And, of course, Scrabble.  —  Gen Z—or, more correctly, the adults who taught them that everybody deserves a medal for participation—has turned their back on all of them.",
    "url": "https://hotair.com/david-strom/2024/04/09/gen-z-is-ruining-scrabble-now-n3786197"
  },
  {
    "text": "Biden on Univision: the president talks about immigration, Mexico, Israel and the risks to democracy  —  President Joe Biden talked to Enrique Acevedo in the Oval Office, at the White House, to review multiple topics: from the situation at the border or student loans, to NATO expansion … ",
    "url": "https://www.univision.com/univision-news/politics/joe-biden-univison-exclusive-interview-enrique-acevedo"
  },
  {
    "text": "Is Team Trump meddling in the Middle East?  —  Earth Week came early this April!  Experiencing Friday's earthquake at the dog park with Daisy — which I thought was another Biden-in-Delaware F-15 scramble until I looked up and there was no plane — was an unexpected jolt.",
    "url": "https://www.inquirer.com/columnists/attytood/trump-liv-golf-saudi-mbs-netanyahu-20240409.html"
  },
  {
    "text": "Michigan Republican Candidate Caught Living in Florida  —  A Republican hoping to represent Michigan in the U.S. Senate suffered a setback to his campaign this week after facing allegations that he lives in Florida.  —  Former Congressman Mike Rogers, who has made much of his local roots … ",
    "url": "https://www.newsweek.com/michigan-republican-candidate-living-florida-mike-rogers-1888388"
  }
]