[
  {
    "text": "Exclusive: The White House is looking to replace Pete Hegseth as defense secretary  —  The White House has begun the process of looking for a new secretary of defense, according to a U.S. official who was not authorized to speak publicly.  —  This comes as Defense Secretary Pete Hegseth continues to find himself mired in controversy.",
    "url": "https://www.npr.org/2025/04/21/nx-s1-5371312/trump-white-house-pete-hegseth-defense-department"
  },
  {
    "text": "‘An amateur person’: GOP Rep. Bacon says Hegseth should go  —  The Nebraska lawmaker is the first House Republican to recommend the president fire the secretary of Defense.  —  Rep. Don Bacon, a prominent Republican on the House Armed Services Committee, became the first sitting GOP lawmaker Monday … ",
    "url": "https://www.politico.com/news/2025/04/21/don-bacon-recommends-firing-hegseth-00301057"
  },
  {
    "text": "Playbook PM: Trump backs Hegseth  —  FOR PETE'S SAKE: The Trump administration held steady in defense of Pete Hegseth today and instead went after his critics in the wake of this weekend's revelations.  —  Never back down: President Donald Trump said consternation about the Defense secretary was a … ",
    "url": "https://www.politico.com/newsletters/playbook-pm/2025/04/21/trump-backs-hegseth-00132333"
  },
  {
    "text": "Homeland Security Secretary Kristi Noem's bag, including $3,000 in cash, is stolen from DC restaurant  —  Department of Homeland Security Secretary Kristi Noem fell victim to a thief while eating dinner at a downtown Washington, DC, restaurant Sunday night, two sources familiar with the incident … ",
    "url": "https://cnn.com/2025/04/21/politics/homeland-security-kristi-noem-purse-stolen/"
  },
  {
    "text": "Kristi Noem's Bag, With Security Badge and $3,000, Is Stolen  —  The homeland security secretary was dining at a Washington, D.C., restaurant.  She also lost her passport and keys.  —  A handbag belonging to the homeland security secretary Kristi Noem containing her passport … ",
    "url": "https://www.nytimes.com/2025/04/21/us/politics/kristi-noem-purse-stolen.html"
  },
  {
    "text": "The Fire Jerome Powell Market Rout  —  Investors render a verdict on tariffs and politicizing the Fed.  —  Click for Sound  —  If the White House wanted a test of how firing Jerome Powell would go over in the markets, it succeeded on Monday.  U.S. stocks and the dollar plunged while yields … ",
    "url": "https://www.wsj.com/opinion/donald-trump-jerome-powell-federal-reserve-kevin-hassett-tariffs-interest-rates-markets-acd5c7b3"
  },
  {
    "text": "Harvard Sues Trump Administration Over $2.2 Billion Funding Freeze  —  Harvard sued the Trump administration in federal court on Monday over its multibillion dollar cuts to the University's research funding, accusing the White House of undertaking an arbitrary and unconstitutional campaign to … ",
    "url": "https://www.thecrimson.com/article/2025/4/22/harvard-sues-trump-admin/"
  },
  {
    "text": "Harvard Sues Trump Administration Over Threats to Cut Funding  —  Harvard's lawsuit comes after the administration sought to force the university to comply with a list of demands by cutting billions in federal funding the school receives.  —  Harvard, the world's wealthiest university … ",
    "url": "https://www.nytimes.com/2025/04/21/us/harvard-lawsuit-trump-administration.html"
  },
  {
    "text": "Student loans in default to be referred to debt collection, Education Department says  —  The Education Department will begin collection next month on student loans that are in default, including the garnishing of wages for potentially millions of borrowers,officials said Monday.",
    "url": "https://apnews.com/article/student-loan-debt-default-collection-fa6498bf519e0d50f2cd80166faef32a"
  },
  {
    "text": "Justice Dept. agrees to let DOGE access sensitive immigration case data  —  About a half-dozen DOGE “advisors” won approval from the the Justice Department to access the ECAS system, according to documents reviewed by The Washington Post.  —  Representatives for the U.S. DOGE Service … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/21/doge-ecas-justice-immigration-courts-trump/"
  },
  {
    "text": "The ACLU Is Suing the Government to Get Access to DOGE Records  —  The ACLU claims the Department of Veterans Affairs and the Social Security Administration have violated the Freedom of Information Act.  —  The American Civil Liberties Union filed a federal lawsuit on Monday … ",
    "url": "https://www.wired.com/story/aclu-lawsuit-government-doge-access-sensitive-data/"
  },
  {
    "text": "My Dinner With Adolf  —  Imagine my surprise when in the spring of 1939 a letter arrived at my house inviting me to dinner at the Old Chancellery with the world's most reviled man, Adolf Hitler.  I had been a vocal critic of his on the radio from the beginning, pretty much predicting everything … ",
    "url": "https://www.nytimes.com/2025/04/21/opinion/larry-david-hitler-dinner.html?unlocked_article_code=1.BU8.iA11.gp0VbsxPOiVa&smid=url-share"
  },
  {
    "text": "Statement Of Acting United States Attorney Matthew Podolsky On The Conviction Of Nadine Menendez  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Moments ago, a unanimous jury convicted Nadine Menendez for her critical role in a corruption … ",
    "url": "https://www.justice.gov/usao-sdny/pr/statement-acting-united-states-attorney-matthew-podolsky-conviction-nadine-menendez"
  },
  {
    "text": "Trump Aides Solicit Ideas to Raise Birthrate, From Baby Bonuses to Fertility Planning … “We need to channel the MAHA spirit and really dive deep into infertility,” said Emma Waters, a policy analyst at the Heritage Foundation, referring to Robert F. Kennedy Jr.'s Make America Healthy Again campaign.Rebecca Kiger for The New York Times",
    "url": "https://www.nytimes.com/2025/04/21/us/politics/trump-birthrate-proposals.html?unlocked_article_code=1.BU8.pB_x.XEjMZkwXrbWE&smid=url-share"
  },
  {
    "text": "Newly Minted DOJ Employee Michael Caputo Keeps Posting ‘Antifa’ Death Fantasies Online  —  The week before last, veteran GOP operative Michael Caputo was hired by one of President Trump's most controversial nominees to advise him ahead of what is expected to be a tough confirmation fight.",
    "url": "https://talkingpointsmemo.com/news/newly-minted-doj-employee-michael-caputo-keeps-posting-antifa-death-fantasies-online"
  },
  {
    "text": "‘Truly galling’: Law expert accuses Justice Alito of ‘inventing’ procedure to help Trump  —  In a column on Monday, Georgetown University Law School Professor Steve Vladeck told what he believed Justice Samuel Alito got wrong in his dissent over the weekend.",
    "url": "https://www.rawstory.com/justice-samuel-alito-2671815052/"
  },
  {
    "text": "Bukele Has Cruel Plan to Make Trump's Mass Deportations Even Worse  —  Salvadoran President Nayib Bukele wants to exchange Venezuelan deportees from the United States being unlawfully held in prison for political prisoners being held in Venezuela.  —  He made the terrifying proposition … ",
    "url": "https://newrepublic.com/post/194203/nayib-bukele-donald-trump-mass-deportations-venezuela"
  },
  {
    "text": "Tesla Slides as Analyst Warns of ‘Code Red’ Ahead of Earnings … Wedbush Securities analyst Dan Ives said Tesla's chief executive officer should step back from his controversial work at the Department of Government Efficiency and re-focus his attention on the carmaker.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-21/tesla-bull-calls-code-red-saying-musk-needs-to-leave-doge?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NTE5Nzg1OCwiZXhwIjoxNzQ1ODAyNjU4LCJhcnRpY2xlSWQiOiJTVjFIMkdUMEFGQjQwMCIsImJjb25uZWN0SWQiOiIxNTI1ODQyQjlGOEY0MDMzQUVGNjI4MTNFMkIxMEY0OSJ9.0SEG4_7ieov83Km6AwnbBGaF7ByqtOnsaRNTNGuFtuo"
  },
  {
    "text": "Trump May Soon Offer a Motherhood Medal, an Idea Popularized in Nazi Germany  —  “I'll be known as the fertilization president and that's okay,” the president has said.  —  On Monday, the New York Times reported that the Trump Administration is mulling a suite of initiatives aimed at encouraging Americans to have more babies.",
    "url": "https://www.motherjones.com/politics/2025/04/trump-motherhood-medal-pronatalist-nazi/"
  },
  {
    "text": "Delta plane engine catches fire at Orlando airport, passengers evacuate on slides  —  A Delta passenger jet caught fire on the tarmac at Orlando International Airport Monday and passengers had to evacuate via the emergency slides, the Federal Aviation Authority said Monday.",
    "url": "https://www.cbsnews.com/news/delta-plane-engine-fire-orlando-airport-passengers-evacuate/"
  },
  {
    "text": "Trump pretends he's a dictator — and the credulous media too often nods along  —  Immediately after retaking the presidency in January, Donald Trump began signing executive orders with lightning speed.  Wielding his fancy pen like a wrecking ball, he acted like he was autographing new copies of “The Art of the Deal” for his fans.",
    "url": "https://margaretsullivan.substack.com/p/trump-pretends-hes-a-dictator-and"
  },
  {
    "text": "The ‘5 things’ emails are going by the wayside as Musk readies his exit  —  After the DOGE leader demanded federal workers list accomplishments, agencies applied an inconsistent patchwork of policies.  —  When Elon Musk and President Donald Trump commanded all federal workers … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/21/doge-musk-trump-federal-employees-emails/"
  },
  {
    "text": "The Government's Chemical Disaster Tracking Tool Just Went Dark  —  The chemical lobby demanded Trump make the locations of high-risk chemical plants secret.  The EPA did just that.",
    "url": "https://www.levernews.com/the-governments-chemical-disaster-tracking-tool-just-went-dark/"
  },
  {
    "text": "Pope's death due to stroke and irreversible cardiocirculatory collapse  —  The Director of the Directorate of Health and Hygiene of the Vatican City State, Dr. Andrea Arcangeli, releases the official medical report on the death of Pope Francis, which was confirmed through electrocardiographic thanatography.",
    "url": "https://www.vaticannews.va/en/pope/news/2025-04/pope-francis-death-due-to-stroke-and-irreversible-cardiocircula.html"
  },
  {
    "text": "First House Republican calls for Pete Hegseth's ouster  —  Rep. Don Bacon (R-Neb.) on Monday became the first Republican member of Congress to openly indicate support for Secretary of Defense Pete Hegseth's removal from office.  —  Why it matters: Hegseth is under fire for a series … ",
    "url": "https://www.axios.com/2025/04/21/don-bacon-pete-hegseth-signal"
  },
  {
    "text": "Pope Francis, first Latin American pontiff who ministered with a charming, humble style, dies at 88  —  Pope Francis, history's first Latin American pontiff who charmed the world with his humble style and concern for the poor but alienated conservatives with critiques of capitalism and climate change, died Monday.",
    "url": "https://apnews.com/article/vatican-pope-francis-dead-01ca7d73c3c48d25fd1504ba076e2e2a"
  },
  {
    "text": "How Democrats Won Wisconsin In 2025: Turnout.  —  Democrats swelled with confidence after their victory in the State Supreme Court race in Trump-won Wisconsin.  It seemed that public opinion swung sharply against Donald Trump and the GOP despite Elon Musk's eight-figure investment in the state.",
    "url": "https://split-ticket.org/2025/04/21/how-did-democrats-win-wisconsin-in-2025/"
  },
  {
    "text": "Trump backs Long Island town's effort to keep Native American logo  —  President Trump has thrown his support behind a Long Island school district's fight to keep its mascot after New York's State Education Board banned the use of Native American-inspired names and logos.",
    "url": "https://thehill.com/homenews/5259441-trump-backs-massapequa-chiefs/"
  },
  {
    "text": "The FBI Can't Find ‘Missing’ Records of Its Hacking Tools  —  The FBI bought multiple hacking tools for $250,000.  Despite that, the FBI says it can't find any more records about the tools. … The FBI says it is unable to find records related to its purchase of a series of hacking tools … ",
    "url": "https://www.404media.co/the-fbi-cant-find-missing-records-of-its-hacking-tools/"
  },
  {
    "text": "Gunman who killed 23 in a racist attack at a Walmart in El Paso pleads guilty to capital murder  —  The gunman who killed 23 people when he targeted Hispanic shoppers at a Walmart in Texas in 2019 pleaded guilty Monday to capital murder and was scolded by a judge over the racist attack in El Paso near the U.S.-Mexico border.",
    "url": "https://apnews.com/article/el-paso-walmart-massacre-plea-deal-433bf2a50443a184c4f4e1ed003820dc"
  }
]