[
  {
    "text": "JD Vance's team had water level of Ohio river raised for family's boating trip  —  Exclusive: Incident raises questions of exploitation of public services, but Secret Service says it was requested for ‘safe navigation’  —  JD Vance's team had the army corps of engineers in Louisville, Ohio … ",
    "url": "https://www.theguardian.com/us-news/2025/aug/06/jd-vance-ohio-lake-water-levels"
  },
  {
    "text": "From Russian Interference to Revisionist Innuendo: What the Gabbard Files Actually Say  —  Tulsi Gabbard's latest “revelations” are being spun as proof of a deep state conspiracy.  The documents themselves tell a much duller story.  —  noupside.bsky.social  —  Meet The Authors",
    "url": "https://www.lawfaremedia.org/article/from-russian-interference-to-revisionist-innuendo--what-the-gabbard-files-actually-say"
  },
  {
    "text": "Attorney General Ken Paxton Launches Investigation into Beto O'Rourke's Radical Group for Unlawfully Funding Runaway Democrats  —  Attorney General Ken Paxton launched an investigation into Beto O'Rourke's radical organization, Powered by People, for unlawful activity, including potentially operating … ",
    "url": "https://www.texasattorneygeneral.gov/news/releases/attorney-general-ken-paxton-launches-investigation-beto-orourkes-radical-group-unlawfully-funding"
  },
  {
    "text": "Trump Tells European Leaders He Intends to Meet With Putin and Zelensky  —  If the meeting goes ahead as President Trump described, it will be the first in-person summit between an American and Russian president in more than four years.  —  President Trump intends to meet in person … ",
    "url": "https://www.nytimes.com/2025/08/06/us/politics/trump-meeting-putin-zelensky.html"
  },
  {
    "text": "Huge cuts to mRNA research spark fears about future pandemics  —  Health and Human Services (HHS) Secretary Robert F. Kennedy Jr.'s decision this week to cancel hundreds of millions of dollars in mRNA vaccine funding will leave the United States unprepared for the next pandemic … ",
    "url": "https://thehill.com/policy/healthcare/5439964-kennedy-cancels-mrna-funding/"
  },
  {
    "text": "Trump Weighs Getting Involved in New York City Mayor's Race  —  The possibility that the president will seek to intercede could inject an element of unpredictability into an already fractious contest.  —  President Trump may have moved out of New York City, but he has privately discussed whether … ",
    "url": "https://www.nytimes.com/2025/08/06/nyregion/trump-nyc-mayor-cuomo-adams-mamdani.html"
  },
  {
    "text": "U.S. plans to ease human rights criticism of El Salvador, Israel, Russia  —  Leaked draft reports show the Trump administration is planning to eliminate or downplay accounts of prisoner abuse, corruption, LGBTQ+ discrimination and other alleged abuses.  The administration says the reports are shorter for “readability.”",
    "url": "https://www.washingtonpost.com/national-security/2025/08/06/trump-human-rights-el-salvador-israel-russia/"
  },
  {
    "text": "Federal court filing system hit in sweeping hack … It is not immediately clear who is behind the hack, though nation-state-affiliated actors are widely suspected, the people said.  Criminal organizations may also have been involved, they added.  —  The Administrative Office of the U.S. Courts declined to comment.",
    "url": "https://www.politico.com/news/2025/08/06/federal-court-filing-system-pacer-hack-00496916"
  },
  {
    "text": "Army sergeant shot 5 soldiers before he was tackled and arrested at Fort Stewart, officials say  —  Five soldiers were shot today in an active shooter incident in the 2nd Armored Brigade Combat Team area.  All soldiers were treated on-site and moved to Winn Army Community Hospital for further treatment.",
    "url": "https://apnews.com/article/georgia-army-post-lockdown-shooter-0b3b2cda384d1f33d107d988e6088d92"
  },
  {
    "text": "VP Vance meeting to discuss Epstein fallout canceled, source says  —  A dinner for senior administration officials at Vice President JD Vance's residence to discuss topics including the Trump administration's handling of the Jeffrey Epstein case has been canceled after news of it leaked, a source familiar with the matter said.",
    "url": "https://www.reuters.com/world/us/vp-vance-meeting-discuss-epstein-fallout-canceled-source-says-2025-08-06/"
  },
  {
    "text": "UCLA says Trump administration has suspended $584 million in grants  —  “If these funds remain suspended, it will be devastating for UCLA and for Americans across the nation,” Chancellor Julio Frenk said.  —  The Trump administration has suspended $584 million in federal grants for the University … ",
    "url": "https://www.nbcnews.com/news/us-news/ucla-says-trump-administration-suspended-584-million-grants-rcna223531"
  },
  {
    "text": "ACA premiums set to spike  —  Health Care  —  The Big Story  —  People who buy health insurance through the Affordable Care Act (ACA) are set to see a median premium increase of 18 percent, more than double last year's 7 percent median proposed increase, according to an analysis of preliminary filings by KFF.",
    "url": "https://thehill.com/homenews/5440172-aca-premiums-set-to-spike/"
  },
  {
    "text": "Miss United States Lindsey Langston accuses Rep. Cory Mills of threatening to publish her nude pics, sex videos  —  WASHINGTON — The reigning Miss United States is accusing Rep. Cory Mills (R-Fla.) of threatening to make public sex videos and nude pictures of her — and “harm any men” … ",
    "url": "https://nypost.com/2025/08/06/us-news/miss-united-states-lindsey-langston-accuses-rep-cory-mills-of-threatening-to-publish-her-nude-pics-sex-videos/"
  },
  {
    "text": "Trump's Redistricting Campaign Tests His Power in the States  —  The effort by President Trump and his allies is the latest example of them trying to rewrite the rules to squeeze out every possible political advantage.  —  President Trump's pressure campaign on Republican-led states … ",
    "url": "https://www.nytimes.com/2025/08/06/us/politics/trump-republicans-states-redistricting.html?unlocked_article_code=1.cU8.xZcr.26qbZE6KIyPM&smid=url-share"
  },
  {
    "text": "‘This is sending a message’: DOJ moves to sanction lawyer who took pro bono deportation case … Legal experts described the sanctions motion against Schroeder, which hasn't been previously reported, as highly unusual.  DOJ brought the disciplinary action after Schroeder asked federal judges … ",
    "url": "https://www.politico.com/news/2025/08/06/justice-department-sanctions-immigration-lawyer-00496886"
  },
  {
    "text": "US brings hate crime charges against suspect in killing of Israeli embassy staffers  —  The U.S. on Wednesday brought federal hate crime charges against the suspect accused of gunning down two Israeli embassy staffers outside a museum in Washington in May, alleging he targeted them because they were Israelis, court papers showed.",
    "url": "https://www.reuters.com/world/middle-east/us-brings-hate-crime-charges-against-suspect-killing-israeli-embassy-staffers-2025-08-06/"
  },
  {
    "text": "Fort Bliss Soldier Arrested, Charged with Espionage and Export Violations  —  For Immediate Release  —  U.S. Attorney's Office, Western District of Texas  —  EL PASO, Texas - An active-duty soldier stationed at Fort Bliss was arrested today in El Paso on criminal charges of attempted transmission … ",
    "url": "https://www.justice.gov/usao-wdtx/pr/fort-bliss-soldier-arrested-charged-espionage-and-export-violations"
  },
  {
    "text": "Laura Loomer Reveals White House Clout Has Earned Her a New Nickname  —  EVER LOOMING  —  Laura Loomer is now touting her new title as “Trump's Rasputin” for her growing political influence, à la the Russian Svengali who advised the Romanov family.  In the past month … ",
    "url": "https://www.thedailybeast.com/laura-loomer-reveals-white-house-clout-has-earned-her-a-new-nickname/"
  },
  {
    "text": "Pete Buttigieg Doubles Down on Comments About the “Fairness” of Trans People in Sports  —  “I think in order to bring people together on this, we also have to take everyone seriously.”  —  Former Secretary of Transportation Pete Buttigieg reiterated his previous comments about transgender women athletes … ",
    "url": "https://www.them.us/story/pete-buttigieg-trans-athletes-parents-sports-fairness?client_service_name=them.&client_service_id=31178&service_user_id=1.78e+16&supported_service_name=instagram_publishing"
  },
  {
    "text": "Linda McMahon Interrupted by Circus Music at Conservative Conference  —  Secretary of Education Linda McMahon was in the middle of giving a talk to the conservative Young America's Foundation (YAF) when she was interrupted by audio of someone calling her a “corrupt billionaire” and another clip of circus music playing in the background.",
    "url": "https://www.newsweek.com/linda-mcmahon-interrupted-circus-music-video-watch-2109907"
  },
  {
    "text": "Actor Dean Cain, who played Superman in the '90s, reveals he joined ICE  —  Dean Cain was once the Man of Steel, but the TV superhero icon has a new title.  —  Cain, who played Superman in the 1990s series “Lois & Clark: The New Adventures of Superman,” revealed to fans that he enlisted … ",
    "url": "https://www.usatoday.com/story/entertainment/celebrities/2025/08/06/dean-cain-joins-ice-superman-lois-and-clark/85547002007/"
  },
  {
    "text": "Trump plans 100% tariff on computer chips, unless companies build in US  —  President Donald Trump said Wednesday that he will impose a 100% tariff on computer chips, raising the specter of higher prices for electronics, autos, household appliances and other essential products dependent on the processors powering the digital age.",
    "url": "https://apnews.com/article/apple-trump-computer-tariff-c01b5ce0265b0d294dd10b8966be4436"
  },
  {
    "text": "MAGA Antitrust Agenda Under Siege by Lobbyists Close to Trump  —  Administration's populist promise to be tough on companies is clashing with influence campaigns  —  The second Trump administration seemed poised to deliver on MAGA's embrace of aggressive antitrust enforcement.",
    "url": "https://www.wsj.com/us-news/law/maga-antitrust-agenda-under-siege-by-lobbyists-close-to-trump-18558898"
  },
  {
    "text": "80 years later, Hiroshima bombing survivors warn of new nuclear warfare  —  The Japanese city, on which America dropped the first atomic bomb near the end of World War II, is commemorating the anniversary as global conflicts fuel nuclear fears.  —  HIROSHIMA, Japan — For more than half a century … ",
    "url": "https://www.nbcnews.com/world/asia/80-years-later-hiroshima-bombing-survivors-warn-new-nuclear-warfare-rcna220177"
  },
  {
    "text": "Martha's Vineyard pierogi vendor speaks out on Alan Dershowitz feud  —  “Our handcrafted pierogi, made with love from locally sourced ingredients, are so undeniably delicious, he'll do anything to get his hands on them.”  —  2 minutes to read  — ...  Thrust into the national spotlight … ",
    "url": "https://www.boston.com/news/off-beat/2025/08/06/marthas-vineyard-pierogi-vendor-alan-dershowitz/"
  },
  {
    "text": "Dozens of FEMA staffers involuntarily reassigned to support deportations  —  DHS said the moves won't hinder disaster readiness, but current and former FEMA officials said losing that many people will hurt an already much reduced agency.  —  The Department of Homeland Security has reassigned dozens … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/08/06/fema-ice-mass-deportations-dhs/"
  }
]