[
  {
    "text": "Latest GOP split: Senate leaders hold out as House brass goes all-in for Trump  —  The former president's allies warn it's a risky move, depending on “how much Donald Trump wants to keep a grudge.”  —  Most Senate GOP leaders are confronting a dilemma they hoped to avoid … ",
    "url": "https://www.politico.com/news/2024/01/11/trump-endorsements-2024-election-00134814"
  },
  {
    "text": "Don't Be So Certain Trump Has the Nomination Locked Up  —  Here's the path for a Nikki Haley upset.  —  Contrary to conventional wisdom, Nikki Haley doesn't have to win New Hampshire, or even South Carolina — she just has to keep it close enough to keep donors and voters convinced there might … ",
    "url": "https://www.politico.com/news/magazine/2024/01/11/nikki-haley-donald-trump-gop-00134902"
  },
  {
    "text": "Trump Reacts To Woman Telling Him He ‘Personally Demeaned’ So Many Ex-Associates  —  The former president was confronted by a DeSantis supporter at the Fox News town hall and tried to spin his way out of it.  —  LOADING  —  Donald Trump on Wednesday wriggled out of a town hall question … ",
    "url": "https://www.huffpost.com/entry/donald-trump-personally-demeaned_n_659fbe78e4b0fbd2bc05d67d"
  },
  {
    "text": "Will You Vote for Trump Again?  —  It's the question weighing on Republicans across the country.  But Iowans get to decide first.  We listened as they grappled with their choices.  —  By Jennifer MedinaPhotographs by Jordan Gale  —  There is no way around it: The Iowa caucuses on Monday … ",
    "url": "https://www.nytimes.com/2024/01/11/us/politics/iowa-voters.html"
  },
  {
    "text": "Chris Christie caught on hot mic, says Nikki Haley will ‘get smoked’  —  Moments before ending his 2024 presidential campaign at a New Hampshire town hall, former New Jersey governor Chris Christie was caught on a hot mic saying GOP presidential candidate Nikki Haley will “get smoked” in the primary race.",
    "url": "https://www.washingtonpost.com/politics/2024/01/10/chris-christie-hot-mic-new-hampshire-town-hall/"
  },
  {
    "text": "Bomb Threat Made at Home of Judge in Trump's Bank Fraud Trial  —  A bomb squad rushed to Justice Arthur F. Engoron's house on Long Island, a source told The Daily Beast.  —  The danger surrounding Donald Trump's bank fraud trial in New York escalated just hours before its final hearing on Thursday … ",
    "url": "https://www.thedailybeast.com/arthur-engoron-bomb-threat-made-at-home-of-judge-in-trumps-bank-fraud-trial"
  },
  {
    "text": "Judge in Trump's civil fraud trial faces bomb threat ahead of closing arguments  —  The bomb squad was called to Engoron's home and was investigating Thursday morning.  It is unclear whether Engoron was home at the time.  —  Nassau County police on Thursday have responded to a bomb threat … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/bomb-threat-targeted-home-judge-trumps-civil-fraud-trial-rcna133416"
  },
  {
    "text": "Musk uses megaphone to promote misleading claims about voting, push for severe restrictions  —  This week, Elon Musk has repeatedly promoted false and misleading claims about voting to his 168 million followers on X, the social network formerly known as Twitter.",
    "url": "https://popular.info/p/musk-uses-megaphone-to-promote-misleading"
  },
  {
    "text": "Secret Recording Shows NRA Treasurer Plotting to Conceal Extravagant Expenses Involving Wayne LaPierre  —  Audio obtained by The Trace and ProPublica reveals, in real time, the gun lobbying group enacting a plan that would conceal payments for fancy hotels, limousines and other luxury expenses connected to its longtime CEO for a decade.",
    "url": "https://www.propublica.org/article/nra-wayne-lapierre-recording-private-jet-limousine-expenses"
  },
  {
    "text": "Jan. 6 committee helped guide early days of Georgia Trump probe  —  In the spring of 2022, the committee staff helped Fulton County prosecutors prepare for interviews with key witnesses.  —  Georgia prosecutors probing Donald Trump's effort to subvert the 2020 election got an early boost in the spring of 2022.",
    "url": "https://www.politico.com/news/2024/01/10/jan-6-georgia-trump-probe-00134941"
  },
  {
    "text": "US verges on vaccination tipping point, faces thousands of needless deaths: FDA  —  Top regulatory officials call for clinicians to speak up and drown out misinformation.  —  The US may be heading to a “dangerous vaccination tipping point,” with immunization rates falling so low … ",
    "url": "https://arstechnica.com/science/2024/01/anti-vaccine-nonsense-will-likely-kill-thousands-this-season-fda-officials-say/"
  },
  {
    "text": "American intel officials warn of risk of Hezbollah attacking U.S.  —  Hezbollah has more capability to strike inside the U.S. than other terrorist groups like ISIS, officials say.  —  U.S. officials assess that there's a rising risk Lebanese Hezbollah militants will strike Americans in the Middle East … ",
    "url": "https://www.politico.com/news/2024/01/10/american-intel-officials-hezbollah-u-s-attack-risk-00134874"
  },
  {
    "text": "Donald Trump must share in Anthony Fauci's ignominy  —  This week, former decadeslong director of the National Institute of Allergy and Infectious Diseases and professional human manifestation of “the science,” Anthony Fauci, was grilled on COVID-19.  —  A Republican-led House select subcommittee hearing … ",
    "url": "https://www.washingtonexaminer.com/opinion/2790605/donald-trump-must-share-in-anthony-faucis-ignominy/"
  },
  {
    "text": "Kim Reynolds Has Another Account, @Kimberl26890376, and Opinions About Donald Trump  —  In recent months, the Republican governor of Iowa has used a secondary account on X to share her unfiltered feelings on the Republican presidential primary race.  —  Not long after the calendar turned to 2024 … ",
    "url": "https://www.nytimes.com/2024/01/11/us/politics/kim-reynolds-twitter-account.html"
  },
  {
    "text": "Staffers Allege Jamie McLeod-Skinner's Driver Feared Physical Violence From Her  —  The new allegations, however, mark the first public claim that the congressional candidate laid a hand on an employee.  —  Expand  —  Three former campaign workers for U.S. congressional candidate Jamie McLeod-Skinner … ",
    "url": "https://www.wweek.com/news/2024/01/10/staffers-allege-jamie-mcleod-skinners-driver-feared-physical-violence-from-her/"
  },
  {
    "text": "Biden Grows Battleground State Operation As Campaign Continues to Ramp Up  —  The hires reflect how the Biden campaign's focus is squarely on the general election, and how he is pulling from past Democratic campaigns, not only his 2020 bid  —  Joe Biden's presidential campaign … ",
    "url": "https://themessenger.com/politics/biden-grows-battleground-state-operation-as-campaign-continues-to-ramp-up"
  },
  {
    "text": "John Fetterman Tells South Africa to Sit This One Out Regarding ICJ Suit Against Israel  —  The day will come when Pennsylvania Senator John Fetterman returns to the form we feared in 2022.  Thankfully, today is not that day.  —  Our friend Salena Zito interviewed the junior senator … ",
    "url": "https://hotair.com/generalissimo/2024/01/11/john-fetterman-tells-south-africa-to-sit-this-one-out-regarding-icj-suit-against-israel-n604300"
  },
  {
    "text": "Two Dead in Overturned Vessel Off Alaskan Island Where Netflix Show ‘Outlast’ Filmed  —  Three others were rescued, the Coast Guard said.  —  Two people died and three others were rescued Tuesday evening when a vessel overturned in frigid waters near an island in Alaska where Netflix's survivalist reality show Outlast was filmed.",
    "url": "https://www.thedailybeast.com/two-dead-in-overturned-vessel-off-alaskan-island-where-netflix-show-outlast-filmed"
  },
  {
    "text": "North Carolina Guv Frontrunner Had Secret Meeting With Ginni Thomas After Jan. 6  —  The leading GOP candidate for governor of North Carolina is very public on his thinking about overturning the 2020 election.  But his private meetings are telling, too.",
    "url": "https://www.thedailybeast.com/north-carolina-guv-frontrunner-mark-robinson-had-secret-meeting-with-ginni-thomas-after-jan-6"
  },
  {
    "text": "Israelis are increasingly questioning what war in Gaza can achieve  —  TEL AVIV, Israel — What will it take for Israel to declare mission accomplished in Gaza and end the war?  —  Prime Minister Benjamin Netanyahu has promised Israeli citizens that the military offensive in Gaza will press … ",
    "url": "https://www.npr.org/2024/01/11/1223636086/israel-hamas-war-gaza-victory"
  },
  {
    "text": "Brexit Cost the UK Economy £140 Billion, London Mayor Says  — Study suggests UK has 2 million fewer jobs due to EU divorce  — Sadiq Khan says ‘mature approach’ needed to forge closer ties  —  London Mayor Sadiq Khan on Thursday will blame Brexit for costing the UK economy £140 billion … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-11/brexit-erased-140-billion-from-uk-economy-london-mayor-to-say"
  }
]