[
  {
    "text": "Cheney fuels speculation about her next move  —  Speculation is growing about the role former Rep. Liz Cheney (R-Wyo.) will play in the 2024 election as President Biden and former President Trump barrel toward a rematch.  —  Cheney has vowed that she'll do whatever it takes to keep Trump from returning to the White House.",
    "url": "https://thehill.com/homenews/campaign/4526744-cheney-fuels-speculation-about-her-next-move/"
  },
  {
    "text": "Judge dismisses some charges against Trump in the Georgia 2020 election interference case  —  The judge overseeing the Georgia 2020 election interference case on Wednesday dismissed some of the charges against former President Donald Trump and others, but many counts in the sweeping racketeering indictment remain intact.",
    "url": "https://apnews.com/article/georgia-election-interference-2020-trump-46e0b68c25719c404130f7e6eab69dcd"
  },
  {
    "text": "Putin Recalls Trump Acting Like Jealous GF in Private  —  According to him, Trump made no attempt to hide his own insecurities about Joe Biden.  —  Russia's Vladimir Putin has revealed an apparently previously unreported conversation with Donald Trump in which he claims the then-American president … ",
    "url": "https://www.thedailybeast.com/putin-recalls-trump-being-jealous-of-sleepy-joe-biden-in-private"
  },
  {
    "text": "Trailing Trump in Polls, Biden Can Be More Bullish in One Battleground  —  The president faces lagging energy in many key states.  But in Wisconsin, which he will visit on Wednesday, rolling clashes over abortion rights and democracy have kept Democratic voters fired up.",
    "url": "https://www.nytimes.com/2024/03/13/us/politics/biden-wisconsin-trump.html"
  },
  {
    "text": "Judge in Georgia election interference case dismisses three counts against Trump  —  Judge Scott McAfee found some of the counts against the former president and some of his co-defendants were lacking details.  —  ATLANTA — The judge presiding over the election interference case in Georgia … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-georgia-election-interference-case-dismisses-three-counts-trump-rcna143182"
  },
  {
    "text": "‘Make the RNC White Again’: GOP Ends Minority Outreach Program  —  With Trump allies taking over the RNC and cleaning house, one of the casualties was a minority outreach program that seemed to be working for Republicans. … After years of accusations of financial mismanagement … ",
    "url": "https://www.thedailybeast.com/make-the-rnc-white-again-gop-ends-minority-outreach-program"
  },
  {
    "text": "RNC slashes budget for minority outreach after MAGA takeover  —  Following the Republican National Committee's takeover by Trump loyalists, the party will be shuttering a heavily-touted program designed to boost minority engagement.  —  In the wake of some modest gains with Hispanic voters in 2020 … ",
    "url": "https://www.rawstory.com/rnc-2667501622/"
  },
  {
    "text": "Racial reset shakes American politics … But they've been shifting Republican over the last two decades, and are no longer the slam-dunk Democrats they were in 1960 when JFK ran for president. … - A New York Times/Siena College poll out March 2 found that President Biden led former President Trump … ",
    "url": "https://www.axios.com/2024/03/13/why-democrats-black-hispanic-vote-republican"
  },
  {
    "text": "Criminal referrals emerge as possible ‘exit strategy’ of struggling Biden impeachment inquiry, sources say  —  Sources say James Comer met with Donald Trump last month.  —  House Oversight and Accountability Committee Chairman James Comer arrives to speak to reporters prior to a closed-door deposition … ",
    "url": "https://abcnews.go.com/US/criminal-referrals-emerge-exit-strategy-struggling-biden-impeachment/story?id=108023312"
  },
  {
    "text": "Hunter Biden declines request to appear at public hearing  —  President Biden's son, Hunter Biden, won't appear before Congress at a slated March 20 hearing, with his attorney telling House Republicans that he “declines your invitation to this carnival side show.”",
    "url": "https://thehill.com/homenews/4528859-hunter-biden-declines-request-to-appear-at-public-hearing/"
  },
  {
    "text": "Robert Hur Admits Telling Biden He Seemed To Have ‘Photographic Recall’  —  The special counsel admitted his comment wasn't in the final report, in which he described the president's memory as “faulty,” “hazy” and “poor.”  —  LOADING  —  Although special counsel Robert Hur impugned Joe Biden's memory … ",
    "url": "https://www.huffpost.com/entry/robert-hur-biden-photographic-recall-eric-swalwell_n_65f0920ae4b01707c6d1f807"
  },
  {
    "text": "Brett Kavanaugh knows truth of alleged sexual assault, Christine Blasey Ford says in book  —  In memoir, professor whose accusation rocked 2018 supreme court hearings says rightwing justice not ‘consummately honest person’  —  The US supreme court justice Brett Kavanaugh is not a … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/13/christine-blasey-ford-book-supreme-court-brett-kavanaugh-sexual-assault"
  },
  {
    "text": "$500K Sand Dune Designed to Protect Coastal Homes Washes Away in Just 3 Days  —  CRUMBLED  —  In a drastic attempt to protect their beachfront homes, residents in Salisbury, Massachusetts, invested $500,000 in a sand dune to defend against encroaching tides.",
    "url": "https://www.thedailybeast.com/dollar500k-dune-designed-to-protect-massachusetts-homes-last-just-3-days"
  },
  {
    "text": "“Trump Employee 5” details Trump's mob-like management style  —  Brian Butler dishes to CNN and reminds us why his former boss should be nowhere near the presidency. … CNN dropped an interview on Monday night that, in normal times, would spell a death knell for a presidential bid … ",
    "url": "https://www.publicnotice.co/p/trump-employee-5-brian-butler-cnn-interview"
  },
  {
    "text": "Aaron Rodgers and Jesse Ventura Top R.F.K. Jr.'s List for Running Mate  —  Mr. Kennedy said he had been speaking with the Jets quarterback “pretty continuously” for the past month.  —  Robert F. Kennedy Jr. has recently approached the N.F.L. quarterback Aaron Rodgers and the former Minnesota governor … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/rfk-jr-aaron-rodgers-jesse-ventura.html"
  },
  {
    "text": "LGBTQ+ Identification in U.S. Now at 7.6%  —  More than one in five Gen Z adults identify as LGBTQ+  —  WASHINGTON, D.C. — LGBTQ+ identification in the U.S. continues to grow, with 7.6% of U.S. adults now identifying as lesbian, gay, bisexual, transgender, queer or some other sexual orientation besides heterosexual.",
    "url": "https://news.gallup.com/poll/611864/lgbtq-identification.aspx"
  },
  {
    "text": "Wisconsin Republicans fire 8 more Evers appointees, including regents and judicial watchdogs  —  Republicans who control the state Senate fired eight more of Democratic Gov. Tony Evers' appointees Tuesday, including two Universities of Wisconsin regents who voted against a deal … ",
    "url": "https://apnews.com/article/senate-republicans-reject-governor-appointees-wisconsin-9041cc81dabcdd0851e8064e31ed7d54"
  }
]