[
  {
    "text": "Mark Meadows takes stand in bid to derail Georgia criminal charges  —  The former top Trump aide testified that he viewed nearly everything as part of his official duties — an argument he hopes will give him immunity.  —  ATLANTA — Former Trump White House Chief of Staff Mark Meadows took … ",
    "url": "https://www.politico.com/news/2023/08/28/meadows-testimony-georgia-hearing-00113215"
  },
  {
    "text": "Trump vows to appeal after judge sets March 2024 trial date - live  —  Experts say trial dates typically not subject to appeal as Mark Meadows attempts to move his case to federal court  —  Key events  —  Trump says he'll appeal 4 March trial start  —  DeSantis speaks to Biden … ",
    "url": "https://www.theguardian.com/us-news/live/2023/aug/28/trump-trial-jan-6-georgia-biden-politics-live-updates"
  },
  {
    "text": "Trump vows to appeal after judge set federal election trial for March 4, 2024  — A federal judge set a March 4, 2024, trial date in former President Donald Trump's criminal election interference case.  — Judge Tanya Chutkan delivered that ruling after rejecting two wildly different … ",
    "url": "https://www.cnbc.com/2023/08/28/trump-special-counsel-to-clash-over-trial-date-in-dc-election-case.html"
  },
  {
    "text": "Judge Sets Trial Date in March for Trump's Federal Election Case  —  Judge Tanya S. Chutkan rejected efforts by the former president's legal team to postpone the trial until 2026.  —  The federal judge overseeing former President Donald J. Trump's prosecution on charges of conspiring … ",
    "url": "https://www.nytimes.com/2023/08/28/us/politics/trump-trial-date-jan-6.html"
  },
  {
    "text": "Trump's federal trial for subverting election is scheduled for March  —  “Mr. Trump, like any defendant, will have to make the trial date work regardless of his schedule,” the judge said as she set the trial for March 4, one day before Super Tuesday.  —  Donald Trump will go to trial in Washington … ",
    "url": "https://www.politico.com/news/2023/08/28/trump-trial-date-election-subversion-2020-00113186"
  },
  {
    "text": "Samuel Wurzelbacher, Celebrated as ‘Joe the Plumber,’ Dies at 49  —  For Republicans in 2008, he briefly became a symbol of Middle America when he questioned the presidential candidate Barack Obama in an impromptu televised encounter.  —  Samuel Joseph Wurzelbacher, who briefly became … ",
    "url": "https://www.nytimes.com/2023/08/28/us/politics/samuel-wurzelbacher-joe-the-plumber-dead.html"
  },
  {
    "text": "‘Joe The Plumber,’ who rose to fame after confronting Barack Obama on the 2008 campaign trail, dead at 49  —  Joe Wurzelbacher, a plumber by trade, became a key part of Republican John McCain's presidential campaign  —  Samuel Joseph Wurzelbacher, who became known as “Joe the Plumber” … ",
    "url": "https://www.foxnews.com/politics/joe-plumber-rose-fame-confronting-obama-2008-campaign-trail-dead-49"
  },
  {
    "text": "‘Joe The Plumber,’ thrust into spotlight for confronting Obama, dies at 49  —  Joe Wurzelbacher became a political celebrity after posing a question in 2008 to then-candidate Barack Obama regarding his tax policies and small business.  —  Samuel Joseph Wurzelbacher, whose question to Barack Obama … ",
    "url": "https://www.nbcnews.com/politics/politics-news/joe-plumber-thrust-spotlight-confronting-obama-dies-49-rcna102182"
  },
  {
    "text": "DeSantis booed at vigil for victims of racist shooting in Florida  —  Florida Gov. Ron DeSantis, a GOP presidential candidate, was met with boos while speaking late Sunday at a vigil held for the three victims of a racially motivated shooting in Jacksonville.",
    "url": "https://thehill.com/homenews/state-watch/4174426-desantis-booed-at-vigil-for-victims-of-racist-shooting-in-florida/"
  },
  {
    "text": "Neo-Nazis Repeatedly Targeted Jacksonville Before Mass Shooting  —  White supremacists have waged an intimidation campaign against the city's minority communities.  —  Months before a gunman fired a swastika-covered rifle at Black shoppers in a Jacksonville, Florida Dollar General on Saturday … ",
    "url": "https://www.thedailybeast.com/neo-nazis-repeatedly-targeted-jacksonville-before-mass-shooting"
  },
  {
    "text": "GOP activist, lawyer stabbed to death in his Durham, NH, home  —  A suspicious death investigation that was underway this weekend in Durham, New Hampshire, has been ruled a homicide after an autopsy was completed on the victim.  —  The New Hampshire Attorney General's Office said in a statement Sunday … ",
    "url": "https://www.nbcboston.com/news/local/41-year-old-man-fatally-stabbed-in-durham-nh-identified/3122099/"
  },
  {
    "text": "Biden is widely seen as too old for office, an AP-NORC poll finds.  Trump has problems of his own  —  Americans actually agree on something in this time of raw discord: Joe Biden is too old to be an effective president in a second term.  Only a few years his junior, Donald Trump raises strikingly less concern about his age.",
    "url": "https://apnews.com/article/biden-age-poll-trump-2024-620e0a5cfa0039a6448f607c17c7f23e"
  },
  {
    "text": "Trump, co-defendants to be arraigned in Georgia on Sept. 6  —  Former President Trump will be arraigned next Wednesday in Georgia over charges he and 18 co-defendants sought to overturn the state's election results.  —  Trump's arraignment has been set for Sept. 6 at 9:30 a.m. … ",
    "url": "https://thehill.com/regulation/court-battles/4174548-trump-co-defendants-to-be-arraigned-in-georgia-on-sept-6/"
  },
  {
    "text": "Ramaswamy Fires At Nikki Haley On Campaign Website: ‘Keep Lying, Namrata Randhawa’  —  The 2024 hopeful's website referenced the former ambassador's birth name to dispel a ‘myth’ about his support of Israel  —  A Facebook icon representing an external link to share the article on Facebook … ",
    "url": "https://themessenger.com/politics/ramaswamy-fires-at-nikki-haley-on-campaign-website-keep-lying-namrata-randhawa"
  },
  {
    "text": "Riley Gaines Wrecks Nebraska Democrat for Tone-Deaf Statement About Women's Sports  —  For a party that claims to be the women looking out for women, the Democrats sure are doing a lot to erase them in favor of some transgender agenda.  —  While you can see a demonstration a day … ",
    "url": "https://redstate.com/brandon_morse/2023/08/28/riley-gaines-wrecks-nebraska-democrat-for-tone-deaf-statement-about-womens-sports-n2163132"
  },
  {
    "text": "Burning Man 2023: Nevada Rangers plow truck through Extinction Rebellion protest after the activists blocked road into festival causing ‘miles-long gridlock’  — Officers from the Pyramid Lake Paiute Tribal Police drove through the blockade  —  Rangers have smashed through a climate protest blocking … ",
    "url": "https://www.dailymail.co.uk/news/article-12453081/Nevada-Rangers-Extinction-Rebellion-protest-activists-blocked-road-Burning-Man.html"
  },
  {
    "text": "August 2023 National Poll: Trump Debate Snub May Open Door for Other Candidates  —  Home Polls August 2023 National Poll: Trump Debate Snub May Open Door for Other Candidates  —  Hunter Biden Legal Issues Offsetting Trump Indictments for Independents  —  A new Emerson College Polling survey … ",
    "url": "https://emersoncollegepolling.com/august-2023-national-poll-trump-debate-snub-may-open-door-for-other-candidates/"
  },
  {
    "text": "The Federalist Society's mugshots  —  This entirely free edition of Public Notice is made possible by paid subscribers.  If you appreciate our work and aren't already one, please support us by signing up.  Just click the button below for a free trial.  —  Sign up for Public Notice free trial",
    "url": "https://www.publicnotice.co/p/jeffrey-clark-eastman-charges-federalist-society"
  }
]