[
  {
    "text": "Biden loses American Samoa Democratic caucuses  —  President Biden was projected to lose the Democratic caucuses in American Samoa to an obscure candidate in a surprising result that comes amid a string of Super Tuesday wins.  —  The race was called Tuesday night by Decision Desk HQ (DDHQ) … ",
    "url": "https://thehill.com/homenews/campaign/4511397-biden-loses-american-samoa-democratic-caucus/"
  },
  {
    "text": "Super Tuesday: Utah Republicans favor Trump in chaotic presidential caucus overshadowed by voting system issues  —  Utah Democrats to nominate President Joe Biden in Super Tuesday presidential primary victory.  —  Utah is poised to join the growing list of states where President Joe Biden … ",
    "url": "https://www.sltrib.com/news/politics/2024/03/05/super-tuesday-utah-republican/"
  },
  {
    "text": "Who is Jason Palmer?  A previously unknown Democrat beats Biden in American Samoa's Democratic caucus  —  President Joe Biden was sweeping every Democratic contest on Super Tuesday — except for American Samoa.  He fell short there to a previously unknown candidate named Jason Palmer.",
    "url": "https://apnews.com/article/who-is-jason-palmer-american-samoa-primary-c4bc109a16c7ee7b083f6216b44ba0c4"
  },
  {
    "text": "How different groups voted on Super Tuesday primary, according to exit polls  —  See the strengths and weaknesses of Donald Trump and Nikki Haley, according to a preliminary statewide survey of Virginia and North Carolina voters, and later California.  —  Gender  —  Cut through the 2024 election noise.",
    "url": "https://www.washingtonpost.com/politics/2024/03/05/how-different-groups-voted-super-tuesday-primary-according-exit-polls/"
  },
  {
    "text": "Donald Trump, Seeking Cash Infusion, Meets With Elon Musk  —  It's not clear whether Mr. Musk will spend any of his billions on the former president's behalf.  If he does, he could erase Mr. Trump's financial disadvantage in the 2024 race.  —  Donald Trump, who is urgently seeking … ",
    "url": "https://www.nytimes.com/2024/03/05/us/politics/trump-elon-musk.html"
  },
  {
    "text": "The Supreme Court Just Delivered a Rare Self-Own for John Roberts  —  The Supreme Court's unsigned majority opinion in Trump v. Anderson, ending Colorado's attempt to disqualify Donald Trump from appearing on the ballot as an insurrectionist, is a remarkable self-own.",
    "url": "https://slate.com/news-and-politics/2024/03/supreme-court-john-roberts-trump-ballot-fail.html"
  },
  {
    "text": "Trump asks judge to cut the $83.3 million penalty in E. Jean Carroll case or grant him a new trial  —  New York CNN  —  In a longshot bid, former President Donald Trump is asking the judge overseeing E. Jean Carroll's defamation case against him to significantly reduce the $83.3 million jury award or grant a new trial.",
    "url": "https://www.cnn.com/2024/03/05/politics/e-jean-carroll-donald-trump/"
  },
  {
    "text": "Trump Backs Israel Bombarding Gaza: ‘Gotta Finish the Problem’  —  The former president claimed there would be no wars if he was president, and repeated accusations that immigrants are “poisoning” the country in a Fox News rant  —  Donald Trump is hoping to win big on Super Tuesday … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-israel-finish-problem-gaza-1234981038/"
  },
  {
    "text": "Independent Sen. Kyrsten Sinema of Arizona says she won't seek reelection, avoiding a 3-way race  —  Independent Sen. Kyrsten Sinema of Arizona announced on Tuesday that she won't run for a second term after her estrangement from the Democratic Party left her politically homeless and without a clear path to reelection.",
    "url": "https://apnews.com/article/kyrsten-sinema-arizona-8043c3333e6d87da2404f58339f1e1e6"
  },
  {
    "text": "Kyrsten Sinema Bows Out of Arizona Senate Race  —  The independent incumbent's decision cleared the field for a two-person race, most likely between Representative Ruben Gallego, a Democrat, and Kari Lake, a Republican.  —  Senator Kyrsten Sinema of Arizona, the Democrat turned independent … ",
    "url": "https://www.nytimes.com/2024/03/05/us/politics/kyrsten-sinema-arizona-senate.html"
  },
  {
    "text": "Colin Allred Wins Democratic Primary For U.S. Senate In Texas, Will Face Ted Cruz  —  The congressman from Dallas ran as a moderate, defeating a more progressive opponent.  —  LOADING  —  Rep. Colin Allred (D-Texas) will try to unseat Sen. Ted Cruz (R-Texas) in a pivotal Senate contest this November.",
    "url": "https://www.huffpost.com/entry/colin-allred-democratic-primary-texas_n_65e74111e4b0d2a2475ac6e4"
  },
  {
    "text": "Republican Mark Robinson and Democrat Josh Stein will face off in North Carolina's governor race  —  NBC News projects the two statewide officials will advance to the general election in the race to replace term-limited Democratic Gov. Roy Cooper.  —  Democrat Josh Stein and Republican Mark Robinson … ",
    "url": "https://www.nbcnews.com/politics/2024-election/north-carolina-primary-governor-win-election-rcna141270"
  },
  {
    "text": "Haley defeats Trump in Vermont GOP primary  —  Former U.N. Ambassador Nikki Haley is projected to win the Vermont Republican primary in a surprise upset against former President Trump, according to Decision Desk HQ.  —  The victory delivers Haley her biggest win since the start of the GOP primary season.",
    "url": "https://thehill.com/homenews/campaign/4511258-nikki-haley-donald-trump-vermont-primary/"
  },
  {
    "text": "Biden administration finalizes rule cutting credit card late fees  —  The move is expected to drop the typical credit card late fee to $8 from $32.  —  President Joe Biden meets Italian Prime Minister Giorgia Meloni in the Oval Office of the White House, Friday, March 1, 2024, in Washington.",
    "url": "https://abcnews.go.com/US/biden-administration-finalizes-rule-cutting-credit-card-late/story?id=107799462"
  },
  {
    "text": "There is something wrong at the New York Times  —  From presidential polls to refusing to report on Trump's stumbles, things aren't adding up at the Gray Lady  —  Two things — check that, three things — appear to have gone off the rails at the paper we used to call the Gray Lady.",
    "url": "https://www.salon.com/2024/03/05/there-is-something-at-the-new-york-times/"
  },
  {
    "text": "RNC resolution to ban paying Trump's legal bills is ‘dead’  —  The Republican National Committee (RNC) failed to earn enough support from states to bring a resolution to ban paying former President Trump's legal bills to a vote.  —  Henry Barbour, who serves as Mississippi's national committeeman … ",
    "url": "https://thehill.com/homenews/campaign/4511516-rnc-resolution-to-ban-paying-trumps-legal-bills-is-dead/"
  },
  {
    "text": "Liberty University faces $14 million fine for Clery Act violations  —  Liberty University faces a $14 million fine from the U.S. Department of Education as part of a settlement agreement with the university for “material and ongoing violations” of the Clery Act relating to its published crime statistics … ",
    "url": "https://newsadvance.com/news/local/liberty-university-faces-14-million-fine-for-clery-act-violations/article_c23b8c9a-db23-11ee-b724-ff40bcc6eec4.html"
  },
  {
    "text": "Sex ed changes in Oklahoma would leave kids at risk of sexual violence  —  Oklahoma legislators are considering a bill that would make it harder for students to protect themselves from sexual assault and abuse.  —  House Bill 3120 would flip state law on its head and require parents … ",
    "url": "https://www.oklahoman.com/story/opinion/columns/2024/03/05/oklahoma-hb-3120-sex-ed-bill-leaves-kids-risk-sexual-violence/72837260007/"
  },
  {
    "text": "The Moms for Liberty 60 Minutes interview was such a disaster that their allies are scrambling to do damage control  —  The newest episode of 60 Minutes should be used by mainstream media as a blueprint for how to responsibly cover far-right “parental rights” group Moms for Liberty.",
    "url": "https://www.mediamatters.org/moms-liberty/moms-liberty-60-minutes-interview-was-such-disaster-their-allies-are-scrambling-do"
  },
  {
    "text": "Sen. Bob Menendez hit with obstruction of justice charges in bribery case  —  The new charges allege that the New Jersey Democrat claimed payments made to him and his wife were loans when he “well knew” that they “were not loans, but bribe payments.”  —  Sen. Bob Menendez, D-N.J. … ",
    "url": "https://www.nbcnews.com/politics/congress/bob-menendez-hit-obstruction-justice-charges-bribery-case-rcna141933"
  }
]