[
  {
    "text": "Don't Be So Certain Trump Has the Nomination Locked Up  —  Here's the path for a Nikki Haley upset.  —  Contrary to conventional wisdom, Nikki Haley doesn't have to win New Hampshire, or even South Carolina — she just has to keep it close enough to keep donors and voters convinced there might … ",
    "url": "https://www.politico.com/news/magazine/2024/01/11/nikki-haley-donald-trump-gop-00134902"
  },
  {
    "text": "Trump Launches into Courtroom Tirade About ‘Witch Hunt’ Fraud Case, Claiming He Deserves Damages  —  The former president didn't wait for the judge's permission before reciting a roughly five-minute rant that he's being ‘persecuted’  —  Donald Trump launched into a tirade Thursday … ",
    "url": "https://themessenger.com/politics/trump-new-york-courtroom-rant-witch-hunt-fraud-case"
  },
  {
    "text": "Latest GOP split: Senate leaders hold out as House brass goes all-in for Trump  —  The former president's allies warn it's a risky move, depending on “how much Donald Trump wants to keep a grudge.”  —  Most Senate GOP leaders are confronting a dilemma they hoped to avoid … ",
    "url": "https://www.politico.com/news/2024/01/11/trump-endorsements-2024-election-00134814"
  },
  {
    "text": "Trump Reacts To Woman Telling Him He ‘Personally Demeaned’ So Many Ex-Associates  —  The former president was confronted by a DeSantis supporter at the Fox News town hall and tried to spin his way out of it.  —  LOADING  —  Donald Trump on Wednesday wriggled out of a town hall question … ",
    "url": "https://www.huffpost.com/entry/donald-trump-personally-demeaned_n_659fbe78e4b0fbd2bc05d67d"
  },
  {
    "text": "Democrats Propose Bill to Neuter Militias  —  The “Preventing Private Paramilitary Activity Act” would effectively limit most militia activity.  —  Militias who like to spend their weekends training to overthrow the government could find themselves running afoul of federal law … ",
    "url": "https://www.vice.com/en/article/n7e5xm/democrats-propose-bill-to-neuter-militias"
  },
  {
    "text": "Bomb Threat Made at Home of Judge in Trump's Bank Fraud Trial  —  A bomb squad rushed to Justice Arthur F. Engoron's house on Long Island, a source told The Daily Beast.  —  The danger surrounding Donald Trump's bank fraud trial in New York escalated just hours before its final hearing on Thursday … ",
    "url": "https://www.thedailybeast.com/arthur-engoron-bomb-threat-made-at-home-of-judge-in-trumps-bank-fraud-trial"
  },
  {
    "text": "Kim Reynolds Has Another Account, @Kimberl26890376, and Opinions About Donald Trump  —  In recent months, the Republican governor of Iowa has used a secondary account on X to share her unfiltered feelings on the Republican presidential primary race.  —  Not long after the calendar turned to 2024 … ",
    "url": "https://www.nytimes.com/2024/01/11/us/politics/kim-reynolds-twitter-account.html"
  },
  {
    "text": "Hogan steps down from No Labels board amid 2024 speculation  —  Former Maryland Gov. Larry Hogan (R) stepped down as co-chair of No Labels last month, raising speculation about a potential third party presidential campaign.  —  Hogan's resignation letter, dated Dec. 15 and first reported … ",
    "url": "https://thehill.com/homenews/campaign/4398706-hogan-steps-down-no-labels-board-2024-speculation/"
  },
  {
    "text": "Secret Recording Shows NRA Treasurer Plotting to Conceal Extravagant Expenses Involving Wayne LaPierre  —  Audio obtained by The Trace and ProPublica reveals, in real time, the gun lobbying group enacting a plan that would conceal payments for fancy hotels, limousines and other luxury expenses connected to its longtime CEO for a decade.",
    "url": "https://www.propublica.org/article/nra-wayne-lapierre-recording-private-jet-limousine-expenses"
  },
  {
    "text": "The Plot Thickens in the Fani Willis Corruption Allegations  —  These Fani Willis allegations are getting crazier by the day.  By now, I'm sure you've read Athena Thorne's intrepid report on the accusations that Willis hired an attorney with whom she is supposedly carrying on an extramarital affair … ",
    "url": "https://pjmedia.com/chris-queen/2024/01/10/the-plot-thickens-in-the-fani-willis-corruption-allegations-n4925369"
  },
  {
    "text": "Ramaswamy backs Trump before Supreme Court in 14th Amendment case  —  Republican presidential candidate Vivek Ramaswamy on Thursday filed a brief backing former President Trump as the Supreme Court decides whether he can be disqualified from the ballot under the 14th Amendment.",
    "url": "https://thehill.com/homenews/campaign/4403313-ramaswamy-backs-trump-supreme-court-14th-amendment-ballot-ban-case/"
  },
  {
    "text": "Musk uses megaphone to promote misleading claims about voting, push for severe restrictions  —  This week, Elon Musk has repeatedly promoted false and misleading claims about voting to his 168 million followers on X, the social network formerly known as Twitter.",
    "url": "https://popular.info/p/musk-uses-megaphone-to-promote-misleading"
  },
  {
    "text": "Maryland Elections Board member arrested on Jan. 6 riot charges resigns  —  Carlos Ayala, nominated to the state's top election board by Republicans last year, allegedly wore a ‘Stop the Steal’ button while breaching the U.S. Capitol  —  A top Maryland elections official was arrested this week … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/01/11/january-6-maryland-elections-official/"
  },
  {
    "text": "Renewable energy grows at fastest rate in decades: IEA  —  Renewable energy expanded more than 50 percent last year compared to 2022, potentially putting the international goal of tripling capacity by 2030 in sight, according to the International Energy Agency (IEA).",
    "url": "https://thehill.com/policy/energy-environment/4402895-renewable-energy-grows-fastest-rate-in-decades/"
  },
  {
    "text": "Feds charge eBay over employees who sent live spiders and cockroaches to couple; company to pay $3M  —  Online retailer eBay Inc. will pay a $3 million fine to resolve criminal charges over a harassment campaign waged by employees who sent live spiders, cockroaches and other disturbing items … ",
    "url": "https://apnews.com/article/ebay-spiders-cockroaches-steiner-newsletter-9ac2c35bcd4c87af181382c71d992343"
  },
  {
    "text": "Federal judge rules book ban lawsuit against Florida school can move forward  —  U.S. District Judge Kent Wetherell ruled on Wednesday a lawsuit against a Florida school over it pulling books off its shelves has standing to move forward, a win for those who have been raising the alarm about book bans in schools.",
    "url": "https://thehill.com/homenews/education/4403423-book-ban-lawsuit-florida-school/"
  },
  {
    "text": "Chris Christie caught on hot mic, says Nikki Haley will ‘get smoked’  —  Moments before ending his 2024 presidential campaign at a New Hampshire town hall, former New Jersey governor Chris Christie was caught on a hot mic saying GOP presidential candidate Nikki Haley will “get smoked” in the primary race.",
    "url": "https://www.washingtonpost.com/politics/2024/01/10/chris-christie-hot-mic-new-hampshire-town-hall/"
  },
  {
    "text": "American intel officials warn of risk of Hezbollah attacking U.S.  —  Hezbollah has more capability to strike inside the U.S. than other terrorist groups like ISIS, officials say.  —  U.S. officials assess that there's a rising risk Lebanese Hezbollah militants will strike Americans in the Middle East … ",
    "url": "https://www.politico.com/news/2024/01/10/american-intel-officials-hezbollah-u-s-attack-risk-00134874"
  }
]