[
  {
    "text": "Disney heiress, wealthy Democratic donors say they won't finance the party until Joe Biden drops out … President Joe Biden is facing an uprising from some his own party's wealthy donors, including an heiress to the Disney family fortune, who say they will no longer fund … ",
    "url": "https://www.cnbc.com/2024/07/04/democratic-donors-wont-finance-party-until-joe-biden-drops-out.html"
  },
  {
    "text": "The Conspiracy of Silence to Protect Joe Biden  —  The president's mental decline was like a dark family secret for many elite supporters.  —  President Joe Biden walked before a row of flags and took his place at a lectern stamped with the presidential seal.",
    "url": "https://nymag.com/intelligencer/article/conspiracy-of-silence-to-protect-joe-biden.html"
  },
  {
    "text": "Behind the Curtain: Trump's Kamala Harris plan … President Biden insisted again Thursday in an unscripted remark, after a supporter at a Fourth of July event on the White House South Lawn yelled that they needed him, and to keep up the fight: “You got me, man!  I'm not going anywhere.”",
    "url": "https://www.axios.com/2024/07/05/behind-the-curtain-trumps-kamala-harris-plan"
  },
  {
    "text": "Varying Treatment of Biden and Trump Puts Their Parties in Stark Relief  —  Republicans and Democrats live in radically different universes, interpreting the same set of facts through radically different lenses.  —  One of America's political parties has a presidential candidate who is really old and showing it.",
    "url": "https://www.nytimes.com/2024/07/05/us/politics/biden-trump-parties.html"
  },
  {
    "text": "Biden Tells Governors He Needs to Sleep More and Work Less at Night  —  The president's opening remark to a group of key Democratic leaders — that he was in the race to stay — chilled any talk of his withdrawal, participants said.  —  President Biden told a gathering of Democratic governors … ",
    "url": "https://www.nytimes.com/2024/07/04/us/politics/biden-governors.html"
  },
  {
    "text": "Playbook: The biggest interview of Joe Biden's life  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  DEMOCRACY IN THE U.K. — The Labour Party is back in power after 14 years in the political wilderness following a landslide election victory … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/05/the-biggest-interview-of-joe-bidens-life-00166605"
  },
  {
    "text": "Major Democratic Donors Devise Plans to Pressure Biden to Step Aside  —  The president appears intent on remaining on the ballot, while wealthy donors are discussing plans to put their money elsewhere.  —  After several days of quiet griping and hoping that President Biden would abandon … ",
    "url": "https://www.nytimes.com/2024/07/04/us/politics/biden-donors.html"
  },
  {
    "text": "Battleground Map Shows Signs of Expansion for Trump as Biden Struggles  —  Minnesota, New Hampshire and Virginia, which typically back Democrats in presidential elections, are being closely watched  —  The 2024 battleground map is showing signs of possible expansion into traditionally blue states … ",
    "url": "https://www.wsj.com/politics/elections/battleground-map-shows-signs-of-expansion-for-trump-as-biden-struggles-77d19e67"
  },
  {
    "text": "Brazilian police indict ex-President Bolsonaro in undeclared diamonds case, sources say  —  Brazil's Federal Police have indicted former President Jair Bolsonaro for money laundering and criminal association in connection with undeclared diamonds the far-right leader received from Saudi Arabia during … ",
    "url": "https://apnews.com/article/bolsonaro-indictment-brazil-money-laundering-e740dfd750f96f02c44b282aa667fea2"
  },
  {
    "text": "Brazil Charges Coup-Plotter Bolsonaro for Saudi Gifts as Trump Org Unveils New Saudi High Rise  —  Brazilian authorities will charge Jair Bolsonaro with money laundering for keeping $3.2 million in diamonds given to him and his spouse by the Saudi government.",
    "url": "https://www.emptywheel.net/2024/07/05/brazil-charges-coup-plotter-bolsonaro-for-saudi-gifts-as-trump-org-unveils-new-saudi-high-rise/"
  },
  {
    "text": "When the Supreme Court Gets Mixed Up With Trump Derangement Syndrome  —  At the end of another momentous term, the Supreme Court has issued major rulings that will reshape the law.  Like much that the court does today, these decisions, in areas like administrative law, have been widely criticized as corrupt or illegitimate.",
    "url": "https://www.nytimes.com/2024/07/05/opinion/supreme-court-trump.html"
  },
  {
    "text": "Charlie Sykes on the GOP's Trump cult  —  “In the minds of MAGA world, he has never lost.  There have been no defeats.”  —  ∙ Paid … President Biden is obviously in a quite precarious position right now, but that doesn't change the fact that a majority of voters are anti-Trump.",
    "url": "https://www.publicnotice.co/p/charlie-sykes-interview-24-trumpism-gop-bulwark"
  },
  {
    "text": "Tempers flare as Trump team revises abortion plank for Republican platform  —  The former president wants the platform to endorse leaving the issue to the states rather than a federal ban in the wake of Roe v. Wade's demise.  —  Top advisers to Donald Trump have begun to discuss draft language … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/05/trump-abortion-republican-platform/"
  },
  {
    "text": "‘Bitter old man’: Trump shredded for egocentric and rambling July 4th rant  —  Former President Donald Trump kicked off the Fourth of July with a lengthy screed on Truth Social praising himself and lobbing insults at President Joe Biden and Vice President Kamala Harris … ",
    "url": "https://www.rawstory.com/trump-july-4-2668688196/"
  },
  {
    "text": "‘We Must Not Fail’: Cheney Offers Stark 4th of July Warning About Trump And His Threats to ‘Unravel Our Republic’  —  Ex-Rep. Liz Cheney (R-WY) offered a stark message for July 4th as the country ponders President Joe Biden's mental fitness and the likelihood of Donald Trump returning to the White House.",
    "url": "https://www.mediaite.com/news/we-must-not-fail-cheney-offers-stark-4th-of-july-warning-about-trump-and-his-threats-to-unravel-our-republic/"
  }
]