[
  {
    "text": "Federal court blocks Trump from imposing sweeping tariffs under emergency powers law  —  A federal court on Wednesday blocked President Donald Trump from imposing sweeping tariffs on imports under an emergency-powers law, swiftly throwing into doubt Trump's signature set of economic policies … ",
    "url": "https://apnews.com/article/trump-tariffs-trade-court-0392dbd59f548e49ad4f64254ae3f94a"
  },
  {
    "text": "Court says Trump doesn't have the authority to set tariffs  —  A federal court on Wednesday ruled President Trump does not have the authority under economic emergency legislation to impose sweeping global tariffs.  —  Why it matters: The U.S. Court of International Trade's ruling could bring … ",
    "url": "https://www.axios.com/2025/05/28/trump-tariffs-trade-court-ruling"
  },
  {
    "text": "Trump Tariffs Blocked by U.S. Court of International Trade  —  The U.S. Court of International Trade said the president had overstepped his authority under the federal emergency powers law he invoked.  —  A panel of federal judges on Wednesday blocked President Trump from imposing … ",
    "url": "https://www.nytimes.com/2025/05/28/business/trump-tariffs-blocked-federal-court.html?unlocked_article_code=1.K08.YxH-.fNw5XDl1Hlfc&smid=nytcore-android-share"
  },
  {
    "text": "We Won Our Tariff Case!  —  The US Court of International Trade just issued a unanimous ruling in the case against Trump's “liberation day” tariffs filed by Liberty Justice Center and myself on behalf of five US businesses harmed by the tariffs.  The ruling also covers the case filed … ",
    "url": "https://reason.com/volokh/2025/05/28/we-won-our-tariff-case/"
  },
  {
    "text": "Federal court strikes down Trump's tariffs on countries around the world  —  The U.S. Court of International Trade ruled unanimously that the president overstepped his powers in imposing the tariffs on dozens of trading partners, most of which he's since paused.",
    "url": "https://www.politico.com/news/2025/05/28/federal-court-strikes-down-trumps-april-2-tariffs-00373843"
  },
  {
    "text": "STAT+: HHS cancels nearly $600 million Moderna contract on vaccines for flu pandemics  —  The Department of Health and Human Services has notified Moderna that it is canceling a nearly $600 million contract with the company to develop, test, and license vaccines for flu subtypes … ",
    "url": "https://www.statnews.com/2025/05/28/moderna-flu-vaccine-development-cancelled-by-hhs-mrna-platform-offers-speedy-pandemic-response/"
  },
  {
    "text": "A Disillusioned Musk, Distanced From Trump, Says He's Exiting Washington  —  The billionaire has made clear he is frustrated with the obstacles he encountered as he tried to upend the federal bureaucracy.  —  Elon Musk during a cabinet meeting at the White House last month.Eric Lee/The New York Times",
    "url": "https://www.nytimes.com/2025/05/28/us/politics/elon-musk-trump-doge.html?unlocked_article_code=1.K08.4XYc.ogBOdRQcbKSB&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Elon Musk is leaving the Trump administration after leading effort to slash federal government  —  Elon Musk is leaving his government role as a top adviser to President Donald Trump after spearheading efforts to reduce and overhaul the federal bureaucracy.  His departure, announced Wednesday evening … ",
    "url": "https://apnews.com/article/elon-musk-donald-trump-big-beautiful-bill-aa2bc70b0ebdb219b5dd3e9f8fae03af"
  },
  {
    "text": "Marco Rubio: US to ‘aggressively’ revoke visas of Chinese students  —  The announcement didn't specify how many would lose the ability to study in the country.  —  The U.S. will “aggressively revoke” visas for Chinese students, Secretary of State Marco Rubio said Wednesday in an escalation … ",
    "url": "https://www.politico.com/news/2025/05/28/rubio-revoke-chinese-students-visas-00373835"
  },
  {
    "text": "New Visa Policies Put America First, Not China  —  Under President Trump's leadership, the U.S. State Department will work with the Department of Homeland Security to aggressively revoke visas for Chinese students, including those with connections to the Chinese Communist Party or studying in critical fields.",
    "url": "https://www.state.gov/releases/office-of-the-spokesperson/2025/05/new-visa-policies-put-america-first-not-china/"
  },
  {
    "text": "Paramount Has Offered $15 Million to Settle CBS Lawsuit.  Trump Wants More.  —  President's team threatened another lawsuit amid settlement talks  —  A month into negotiations between Paramount Global and President Trump to settle his lawsuit against CBS News, the parties remain far apart on terms.",
    "url": "https://www.wsj.com/business/media/paramount-has-offered-15-million-to-settle-cbs-lawsuit-trump-wants-more-861d857e?st=bKShvL"
  },
  {
    "text": "A Missouri Town Was Solidly Behind Trump.  Then Carol Was Detained.  —  For 20 years, Carol Hui has served waffles, raised her children and embraced the small town of Kennett, Mo. Her detention and pending deportation to Hong Kong has hit the community hard.",
    "url": "https://www.nytimes.com/2025/05/28/us/missouri-immigrant-trump.html?unlocked_article_code=1.Kk8.6Vrx.t0p5DTeSQtbp&smid=url-share"
  },
  {
    "text": "Trump Nominates His Defense Lawyer-Turned-DOJ Yes Man For Federal Appeals Court  —  It's indoor work, and there's no heavy lifting: a top former personal attorney and bagman for the President — and current DOJ official — is now the nominee for a seat on a federal appeals court.",
    "url": "https://talkingpointsmemo.com/news/trump-nominates-his-defense-lawyer-turned-doj-yes-man-for-federal-appeals-court"
  },
  {
    "text": "Trump will ‘take a look’ at pardoning convicted Whitmer kidnap plotters, he says  — The government alleged in 2020 that men upset with Gov. Gretchen Whitmer's handling of the coronavirus pandemic had conspired to kidnap her.  — Prosecutors had mixed success in court but did land convictions in both federal and state courts.",
    "url": "https://eu.freep.com/story/news/politics/2025/05/28/whitmer-kidnap-plot-trump/83901717007/"
  },
  {
    "text": "Trump's Air Force One deal with Qatar not final, despite U.S. claims  —  The delay reflects lingering concerns about legal liabilities stemming from a White House maneuver to transform what was originally a sale between two countries into a “gift.”  —  Despite claims by the Defense Department … ",
    "url": "https://www.washingtonpost.com/national-security/2025/05/28/trump-qatar-air-force-one/"
  },
  {
    "text": "Andrew Tate and his brother Tristan charged with rape in the UK  —  Bedfordshire Police issued an international arrest warrant for the brothers over allegations, which they “unequivocally deny”, said to have occurred between 2012 and 2015.  —  Andrew Tate and his brother Tristan Tate … ",
    "url": "https://news.sky.com/story/andrew-tate-and-his-brother-tristan-charged-with-rape-in-the-uk-13376089"
  },
  {
    "text": "US judge blocks Trump from halting Biden-era migrant ‘parole’ programs  —  A federal judge on Wednesday temporarily blocked U.S. President Donald Trump's administration from halting legal entry “parole” programs that have allowed hundreds of thousands of migrants with U.S. sponsors to enter the country legally.",
    "url": "https://www.reuters.com/world/us/us-judge-blocks-trump-halting-biden-era-migrant-parole-programs-2025-05-28/"
  },
  {
    "text": "Immigration courts are dismissing cases of those sent to El Salvador, potentially cutting off their return  —  An immigration judge in San Diego dismissed the asylum claim of a gay makeup artist from Venezuela — one of at least 14 such dismissals to take place in recent weeks.",
    "url": "https://www.nbcnews.com/news/latino/immigration-courts-alien-enemies-deportation-andry-hernandez-romero-rcna209402"
  },
  {
    "text": "Harrison Ruffin Tyler, grandson of 10th U.S. president and longtime Richmonder, dies at 96  —  Since 2020, Harrison Ruffin Tyler was the last living link to a vanished America.  —  The Richmond resident, preservationist and chemical engineer, a man who founded water treatment company ChemTreat … ",
    "url": "https://www.richmonder.org/harrison-ruffin-tyler-grandson-of-10th-u-s-president-and-longtime-richmonder-dies-at-96/"
  },
  {
    "text": "Judge Says Government Should Release Russian Scientist  —  The judge ordered ICE to release Kseniia Petrova, a researcher at Harvard Medical School, who also faces criminal charges.  —  A federal judge on Wednesday said she would grant bail to Kseniia Petrova, a Russian scientist employed … ",
    "url": "https://www.nytimes.com/2025/05/28/science/russian-scientist-harvard-charges.html"
  },
  {
    "text": "Stock market today: Dow, S&P 500, Nasdaq futures jump as court blocks Trump tariffs, Nvidia earnings impress  —  US stock futures rose after a US trade court blocked some of President Trump's tariffs, and Nvidia (NVDA)'s mixed earnings report impressed Wall Street despite the company's warnings on chip curbs.",
    "url": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-jump-as-court-blocks-trump-tariffs-nvidia-earnings-impress-234801294.html"
  },
  {
    "text": "Why Musk is so important  —  WHY MUSK IS SO IMPORTANT.  Elon Musk's giant Starship spacecraft went out of control, tumbled, and broke apart several minutes into a test flight Tuesday night.  It was the latest in a series of unsuccessful-but-still-instructive tests of Musk's hugely ambitious rocket program … ",
    "url": "https://www.washingtonexaminer.com/daily-memo/3423900/why-elon-musk-starlink-is-so-important/"
  },
  {
    "text": "Grading for Equity coming to San Francisco high schools this fall  —  District materials highlight a decrease in A grades for ‘more privileged’ students.  —  Without seeking approval of the San Francisco Board of Education, Superintendent of Schools Maria Su plans to unveil a new Grading … ",
    "url": "https://thevoicesf.org/grading-for-equity-coming-to-san-francisco-high-schools-this-fall/"
  },
  {
    "text": "Trump Has Commuted Larry Hoover's Sentence  —  The president, on a pardon spree, shortened the infamous former gang leader's sentence after years of advocates pressing for his release.  — Copy  —  President Donald Trump has commuted the sentence of Larry Hoover, the infamous former gang leader … ",
    "url": "https://www.notus.org/trump-white-house/trump-larry-hoover-commutation"
  },
  {
    "text": "Part One: DNC Vice Chair David Hogg Reveals Jill Biden's Chief of Staff Ran the Biden White House  —  Key Quotes - David Hogg, Vice Chair, Democratic National Committee  — “Jill Biden's Chief of Staff [Anthony Bernal] had an enormous amount of power.”  — “The bigger issue was the inner circle that was around Biden.”",
    "url": "https://www.projectveritas.com/news/david-hogg-reveals-jill-bidens-chief-of-staff-ran-the-white-house"
  },
  {
    "text": "Secretary Noem Releases Statement After ICE Arrests Illegal Alien who Threatened to Assassinate President Donald J. Trump  —  WASHINGTON - Department of Homeland Security Secretary Kristi Noem released the following statement after U.S. Immigration and Customs Enforcement (ICE) … ",
    "url": "https://www.dhs.gov/news/2025/05/28/secretary-noem-releases-statement-after-ice-arrests-illegal-alien-who-threatened"
  },
  {
    "text": "Crime is Now Legal (At Least for Trump's Friends)  —  Corruption is spreading fast within the Justice Department … A lot of attention has come in recent days to the sheer size of the corruption racket surrounding the president and the White House.  The New York Times did a great piece … ",
    "url": "https://www.doomsdayscenario.co/p/crime-is-now-legal-at-least-for-trump-s-friends-6805a3545d58382f"
  },
  {
    "text": "The Punch That Launched Trump's War on American Universities  —  Threats to withhold billions in federal research funds to punish campuses grew heated after a 2019 altercation left a man with a black eye",
    "url": "https://www.wsj.com/us-news/education/trump-college-university-federal-funding-fight-91c2a274?st=UDKi7K&reflink=article_copyURL_share"
  },
  {
    "text": "Come At Me, Bro  —  Recently, the Harvard administration has engaged in an admirable strategy which might be summarized as: “We shall fight in the United States District Court for the District of Massachusetts.  We shall fight in mild-mannered Jewish doctor interviews with the Wall Street Journal.",
    "url": "https://www.thecrimson.com/article/2025/5/27/sperling-milner-linda-mcmahon-harvard-wwe/"
  }
]