[
  {
    "text": "Trump warns that arrest of Palestinian activist at Columbia will be ‘first of many’  —  President Donald Trump warned Monday that the arrest and possible deportation of a Palestinian activist who helped lead protests at Columbia University will be the first “of many to come” … ",
    "url": "https://apnews.com/article/columbia-university-mahmoud-khalil-ice-6964107d218dba43eb995d6dbbe528b1"
  },
  {
    "text": "Trump vows crackdown on pro-Palestinian protesters  —  U.S. President Donald Trump vowed a new crackdown Monday on pro-Palestinian protesters on American college campuses, saying the detention of Mahmoud Khalil, a demonstration leader at Columbia University in New York, is “the first arrest of many to come.”",
    "url": "https://www.voanews.com/a/trump-vows-crackdown-on-pro-palestinian-protesters/8005926.html"
  },
  {
    "text": "AOC Rips “Tyrannical and Un-American” Arrest of Mahmoud Khalil  —  Representative Alexandria Ocasio-Cortez condemned ICE's detainment of Mahmoud Khalil, calling it a “tyrannical” move.  —  “Violating rule of law, actually,” AOC wrote on Monday, responding to an assertion from Katie Miller … ",
    "url": "https://newrepublic.com/post/192558/aoc-ocasio-cortez-arrest-palestinian-activist-mahmoud-khalil"
  },
  {
    "text": "This Is the Greatest Threat to Free Speech Since the Red Scare  —  On Saturday, immigration agents showed at the apartment building of Mahmoud Khalil, a leader of last year's pro-Palestinian protests at Columbia University, and told him his student visa had been revoked and that he was being detained.",
    "url": "https://www.nytimes.com/2025/03/10/opinion/mahmoud-khalil-free-speech.html?unlocked_article_code=1.204.qmHQ.0t0JSq_Flry5&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Judge halts deportation of Palestinian activist whose arrest was celebrated by Trump  —  Mahmoud Khalil is a legal U.S. resident who had a prominent role in Columbia University protests.  —  A federal judge has halted the deportation of a Columbia University graduate student who was detained … ",
    "url": "https://www.politico.com/news/2025/03/10/trump-palestinian-activist-columbia-00221550"
  },
  {
    "text": "Stocks' sell-off worsens as Wall Street wonders how much pain Trump will accept for the economy  —  The U.S. stock market's sell-off cut deeper on Monday as Wall Street questioned how much pain President Donald Trump will let the economy endure through tariffs and other policies in order to get what he wants.",
    "url": "https://apnews.com/article/stocks-markets-economy-tariffs-trump-rates-174603e75feb9d5cca96c08817e0c7c2"
  },
  {
    "text": "Musk Melts Down as Tesla Stock Price Plunges  —  The electric vehicle company has become a toxic brand as its CEO wreaks havoc in Washington … But mixed in were a number of posts about Tesla, the electric vehicle manufacturer that still counts him as CEO despite his seemingly full … ",
    "url": "https://www.rollingstone.com/culture/culture-news/musk-tesla-stock-price-plunge-1235292855/"
  },
  {
    "text": "Justice Dept. Official Says She Was Fired After Opposing Restoring Mel Gibson's Gun Rights  —  Elizabeth G. Oyer, the former pardon attorney, said that she was not told why she was dismissed, but that as events unfolded she feared they might lead to her firing.",
    "url": "https://www.nytimes.com/2025/03/10/us/politics/justice-department-mel-gibson.html?unlocked_article_code=1.3E4.9xqZ.oziqQOWfRdAK"
  },
  {
    "text": "Health Update  —  With a heavy heart, I have to tell you that after a long battle with cancer my husband Kevin Drum passed away on Friday, March 7, 2025.  —  No public memorial services are planned.  —  In lieu of flowers, please donate to the charity or political cause of your choice.",
    "url": "https://jabberwocking.com/health-update-100/"
  },
  {
    "text": "Over texts and ‘eyeball to eyeball,’ Republicans succeed in persuading Musk.  But Democrats hit dead ends  —  When a multi-million federal grant program for dairy businesses was shut down earlier this month in line with Elon Musk's Department of Government Efficiency push to downsize the government … ",
    "url": "https://www.cnn.com/2025/03/10/politics/republican-lawmakers-doge-musk-success/"
  },
  {
    "text": "Kennedy Links Measles Outbreak to Poor Diet and Health, Citing Fringe Theories  —  In a recent interview, the health secretary also suggested that the measles vaccine had harmed children in West Texas, center of an outbreak.  —  In a sweeping interview, Robert F. Kennedy Jr. … ",
    "url": "https://www.nytimes.com/2025/03/10/health/measles-texas-kennedy-fox.html?unlocked_article_code=1.204.sAQR.wAUh7GrZlYMr&smid=url-share"
  },
  {
    "text": "At SXSW, Bluesky CEO Jay Graber pokes fun at Mark Zuckerberg with Latin phrase T-shirt  —  When Bluesky CEO Jay Graber walked on stage at SXSW 2025 for her keynote discussion, she wore a large black T-shirt with her hair pulled back into a bun.  At first glance, it might appear … ",
    "url": "https://techcrunch.com/2025/03/10/at-sxsw-bluesky-ceo-jay-graber-pokes-fun-at-mark-zuckerberg-with-latin-phrase-t-shirt/"
  },
  {
    "text": "USDA cancels $1B in local food purchasing for schools, food banks  —  States have been notified that they will not receive 2025 funding for schools to buy food from nearby farms.  —  The Agriculture Department has axed two programs that gave schools and food banks money to buy food … ",
    "url": "https://www.politico.com/news/2025/03/10/usda-cancels-local-food-purchasing-for-schools-food-banks-00222796"
  },
  {
    "text": "Firm Targeted by Trump Over Clinton Campaign Work Hires Top Litigators  —  President Trump stripped Perkins Coie of access to federal buildings and personnel, citing its work for Hillary Clinton's 2016 campaign.  The firm hired Williams & Connolly, which is skilled in fighting the government, to represent it.",
    "url": "https://www.nytimes.com/2025/03/10/us/politics/trump-perkins-coie.html"
  },
  {
    "text": "Top ‘Washington Post’ columnist resigns, accusing publisher of killing piece  —  A top political columnist for The Washington Post resigned today, accusing Post chief executive and publisher Will Lewis of killing her column that criticized owner Jeff Bezos's drive to overhaul the opinion pages to focus on his libertarian priorities.",
    "url": "https://www.npr.org/2025/03/10/nx-s1-5323136/washington-post-editor-ruth-marcus-resigns"
  },
  {
    "text": "Ex-Philippine Leader Duterte Arrested in Drug War Case  —  The Philippines said former President Rodrigo Duterte is under police custody after the International Criminal Court issued an arrest warrant following an investigation into his deadly drug war.  —  Duterte was arrested by police … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-11/philippines-says-ex-leader-duterte-arrested-after-icc-warrant"
  },
  {
    "text": "Musk eyes Social Security and benefit programs for cuts while claiming widespread fraud  —  Elon Musk pushed debunked theories about Social Security on Monday while describing federal benefit programs as rife with fraud, suggesting they will be a primary target in his crusade to reduce government spending.",
    "url": "https://apnews.com/article/elon-musk-donald-trump-doge-b21b74f56f30012a6450a629e7232a1a"
  },
  {
    "text": "Billionaires at Trump's Swearing-In Have Since Lost $210 Billion … As Donald Trump took the oath of office on Jan. 20, he was flanked by some of the world's wealthiest people.  The billionaires present that day — including Elon Musk, Jeff Bezos and Mark Zuckerberg — had never been richer … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-10/billionaires-at-trump-s-swearing-in-have-since-lost-200-billion"
  },
  {
    "text": "Texas bill would make identifying as transgender a felony punishable by jail  —  The bill, while unlikely to pass, highlights the increasing extremism of legislation targeting trans people, especially in Texas, in recent years.  —  A Texas state bill could charge transgender people with … ",
    "url": "https://www.nbcnews.com/nbc-out/rcna195642"
  },
  {
    "text": "X down: Twitter not working amid major outage  —  Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing.  Whether it's investigating the financials of Elon Musk's pro-Trump PAC … ",
    "url": "https://www.the-independent.com/tech/x-down-twitter-not-working-elon-musk-latest-b2712094.html"
  },
  {
    "text": "Ukraine Must Cede Territory in Any Peace Deal, Rubio Says  —  The secretary of state, heading to talks with Ukrainian officials in Saudi Arabia, said future talks with Moscow will be needed to determine what Russia is willing to give up to end the war.  —  Secretary of State Marco Rubio … ",
    "url": "https://www.nytimes.com/2025/03/10/us/politics/rubio-ukraine-russia.html"
  },
  {
    "text": "Judge orders urgent release of DOGE records, citing ‘unprecedented’ power and ‘unusual secrecy’  —  It's the first significant ruling in a growing legal push to pierce DOGE's secretive veil, a decision that undercuts Musk's repeated insistence about the operation's transparency.",
    "url": "https://www.politico.com/news/2025/03/10/judge-orders-doge-record-release-00223151"
  },
  {
    "text": "Pentagon abruptly ends all funding for social science research  —  More than 90 studies on threats such as climate change, extremism, and disinformation are halted  —  The U.S. Department of Defense (DOD) is ending all of its funding for social science research, stopping 91 ongoing studies related … ",
    "url": "https://www.science.org/content/article/pentagon-abruptly-ends-all-funding-social-science-research"
  },
  {
    "text": "Trump's next climate move: Show global warming benefits humanity … President Donald Trump has long rejected climate science.  —  Now, his administration is grappling with how to assemble a body of federal climate research to show a warming world is benefiting humanity.",
    "url": "https://www.eenews.net/articles/trumps-next-climate-move-show-global-warming-benefits-humanity/"
  },
  {
    "text": "Exclusive: Trump seeks minerals refining on Pentagon bases to boost US output, sources say  —  U.S. President Donald Trump aims to build metals refining facilities on Pentagon military bases as part of his plan to boost domestic production of critical minerals and offset China's control of the sector … ",
    "url": "https://www.reuters.com/world/us/trump-seeks-minerals-refining-pentagon-bases-boost-us-output-sources-say-2025-03-10/"
  },
  {
    "text": "Elon Musk calls Sen. Mark Kelly a ‘traitor’ over his social media posts in support of Ukraine  —  Kelly, a former Navy combat pilot, responded to the tech billionaire's remark by saying “he's not a serious guy” and should “go back to building rockets.”  —  Elon Musk and Sen. Mark Kelly sparred … ",
    "url": "https://www.nbcnews.com/politics/congress/elon-musk-calls-mark-kelly-traitor-support-ukraine-rcna195738"
  },
  {
    "text": "Remember “Great Power Competition?”  Lol.  —  The normie national-security advisors who dominated the first Trump administration needed a way to make Trump's semi-coherent ramblings legible to the global foreign-policy community.  Their answer was “Great Power Competition,” … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2025/03/remember-great-power-competition-lol"
  },
  {
    "text": "Trump vows to “lead the charge” to unseat GOP Rep. Massie  —  President Trump said Monday he will “lead the charge” to oust Rep. Thomas Massie (R-Ky.) for his refusal to support Republicans' government funding bill.  —  Why it matters: A doctrinaire libertarian, Massie has been a persistent thorn … ",
    "url": "https://www.axios.com/2025/03/11/trump-thomas-massie-primary-government-shutdown"
  }
]