[
  {
    "text": "Trump Leads in 5 Key States, as Young and Nonwhite Voters Express Discontent With Biden  —  A new set of Times/Siena polls, including one with The Philadelphia Inquirer, reveal an erosion of support for the president among young and nonwhite voters upset about the economy and Gaza.",
    "url": "https://www.nytimes.com/2024/05/13/us/politics/biden-trump-battleground-poll.html"
  },
  {
    "text": "Cross-Tabs: May 2024 Times/Siena Poll of the Presidential Battlegrounds  —  Donald Trump leads Joe Biden in five of six states polled by The New York Times, The Philadelphia Inquirer and Siena College from April 28 to May 9, 2024.  —  View toplines for the full set of polls and cross-tabs for: all registered voters |",
    "url": "https://www.nytimes.com/interactive/2024/05/13/us/elections/times-siena-poll-registered-voter-crosstabs.html"
  },
  {
    "text": "Democrats Hold Leads in 4 Crucial Races That Could Decide Senate Control  —  New battleground state polls by The New York Times, Siena College and The Philadelphia Inquirer show Democrats ahead in Arizona, Nevada, Pennsylvania and Wisconsin, and running well ahead of the president.",
    "url": "https://www.nytimes.com/2024/05/13/us/politics/democrats-senate-battleground-poll.html"
  },
  {
    "text": "Tim O'Brien on 35 years of covering Trump  —  “His id and animal impulses weren't fully unleashed in the way they are now.”  —  ∙ Paid … Ten years before Donald Trump came down that golden escalator to change the course of American history, Tim O'Brien had already exposed him as a fraud.",
    "url": "https://www.publicnotice.co/p/tim-obrien-interview-trump-2024"
  },
  {
    "text": "Justice Thomas has used this “hideous place” to amass the power he now exploits  —  Thomas's attack on Washington comes as he will, yet again, issue rulings that set the national rules for the legal questions before the justices.  —  Anyone who lives in Washington, D.C. … ",
    "url": "https://www.lawdork.com/p/justice-thomas-attacks-dc-as-hideous"
  },
  {
    "text": "State Republican parties are going rogue  —  Good morning, Early Birds.  Staring at the sky to watch the eclipse is out.  Staring at the sky to watch the aurora borealis is in.  (At least it can't damage your eyes.)  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2024/05/13/state-republican-parties-are-going-rogue/"
  },
  {
    "text": "Three people charged with offences under the National Security Act  —  Three people have been charged with offences under the National Security Act as part of an investigation led by officers from the Met's Counter Terrorism Command with support from colleagues in Counter Terrorism Policing in the North East and South East.",
    "url": "https://news.met.police.uk/news/three-people-charged-with-offences-under-the-national-security-act-483705"
  },
  {
    "text": "Kristi Noem Banned From Tribal Lands By a SIXTH Sioux Tribe  —  SEE YA!  —  Days after the Sisseton-Wahpeton Oyate banned South Dakota Gov. Kristi Noem from setting foot on tribal land, a sixth Sioux tribe joined in the banishment of the Trump-loving, puppy-killing Republican.",
    "url": "https://www.thedailybeast.com/kristi-noem-banned-from-tribal-lands-by-a-sixth-sioux-tribe"
  },
  {
    "text": "How 20 Years of Same-Sex Marriage Changed America  —  After ‘dire predictions,’ the effects have been largely positive, a new study finds  —  Twenty years ago this week, David Wilson and Rob Compton entered into a marriage that some believed would bring on the apocalypse.",
    "url": "https://www.wsj.com/politics/policy/how-20-years-of-same-sex-marriage-changed-america-670758bd"
  },
  {
    "text": "The Most Endangered Democrat in America  —  Jamaal Bowman might lose his job over Israel.  —  Jamaal Bowman, the two-term congressman from Westchester County and the would-be future of the progressive left, is tired of the questions about George Latimer.  “Yeah, I mean, I think it says something … ",
    "url": "https://nymag.com/intelligencer/article/jamaal-bowman-george-latimer-primary-israel.html"
  },
  {
    "text": "In top races, Republicans try to stay quiet on Trump's false 2020 claims  —  Unlike in 2022, many GOP candidates running in tight races are choosing to steer away from one of the former president's favorite talking points.  —  WAUKESHA, Wis. — In his run for the Republican nomination for senator in Ohio … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/12/republican-election-deniers-2024-candidates/"
  },
  {
    "text": "Alvin Bragg's Office Deleted Phone Call Records of Michael Cohen and Stormy Daniels' Lawyer  —  Trump attorney asked about roughly three pages worth of records that the attorney claimed Mr. Bragg's office had deleted.  —  A paralegal from Manhattan Attorney General Alvin Bragg's office testified … ",
    "url": "https://www.theepochtimes.com/us/alvin-braggs-office-deleted-evidence-of-phone-calls-between-michael-cohen-and-stormy-daniels-lawyer-5648208"
  },
  {
    "text": "Bernie Sanders seeks to boost Biden, ‘the Squad’ in 2024  —  “It's no great secret that there is not an enormous amount of enthusiasm for either candidate,” says Vermont senator.  —  Sen. Bernie Sanders (I-Vt.) says he vehemently disagrees with President Biden on his Israel policy … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/13/sanders-gaza-israel-biden-protests/"
  },
  {
    "text": "Democratic group starts attacking Trump with abortion rights testimonials  —  A $25 million campaign by American Bridge in Wisconsin, Michigan and Pennsylvania over the next three weeks is just the beginning of the super PAC's efforts.  —  A Democratic super PAC will launch a $25 million … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/13/abortion-ads-biden-american-bridge/"
  },
  {
    "text": "Michael Cohen's Testimony Will Shape Trump's Hush Money Trial  —  Mr. Cohen once called himself Donald J. Trump's “designated thug.”  Will he help bring about the ex-president's downfall?  —  Donald J. Trump has always surrounded himself with lawyers — all types of lawyers.",
    "url": "https://www.nytimes.com/2024/05/12/nyregion/michael-cohen-trump-trial.html"
  }
]