[
  {
    "text": "Scoop: Wall Street thinks Kamala Harris picking governor for VP … - If the campaign signals are being correctly interpreted, that would narrow the veepstakes down to Kentucky Gov. Andy Beshear, Pennsylvania Gov. Josh Shapiro, and Minnesota Gov. Tim Walz.  — Some donors in the financial services … ",
    "url": "https://www.axios.com/2024/07/31/kamala-harris-vp-pick-wall-street-donors"
  },
  {
    "text": "More Than 100 Silicon Valley Investors Pledge to Support Kamala Harris  —  The group, including Democratic donors such as Reid Hoffman and Vinod Khosla, has been organized under an effort called VCsForKamala.  —  More than 100 venture capitalists said on Wednesday that they had pledged … ",
    "url": "https://www.nytimes.com/2024/07/31/technology/silicon-valley-investors-support-kamala-harris.html"
  },
  {
    "text": "I Was at the Kamala Harris Rally in Atlanta.  What You're Seeing Is Very Real.  —  In the past two years, Vice President Kamala Harris has made so many visits to Georgia that Atlantans frustratedly joke that perhaps she doesn't know that there are 49 other states or that maybe she's looking for real estate in the Southern city.",
    "url": "https://slate.com/news-and-politics/2024/07/kamala-harris-say-it-to-my-face-atlanta-quavo-megan-thee-stallion-trump-debate.html"
  },
  {
    "text": "Senate Majority Leader Chuck Schumer blasts Trump for comments about Jewish Americans  —  Senate Majority Leader Chuck Schumer, D-N.Y., spoke on the Senate floor this morning and criticized Trump's comments about Harris and Jewish Americans.  —  “He knows precisely what he is doing.",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/trump-harris-presidential-election-live-updates-rcna164122/rcrd49689?canonicalCard=true"
  },
  {
    "text": "Hamas leader Haniyeh assassinated in Tehran  —  Haniyeh, along with one of his guards, was reportedly killed at his Tehran residence.  —  Hamas leader Ismail Haniyeh was killed in Iran, Hamas claimed on Wednesday morning, while claiming Israel was behind the attack.",
    "url": "https://www.jpost.com/breaking-news/article-812649"
  },
  {
    "text": "Hamas leader Ismail Haniyeh killed in Tehran - what we know so far  —  Hamas leader Ismail Haniyeh was assassinated early on Wednesday morning in Iran, the Palestinian militant group and Tehran said.  —  This is what we know about the killing of Haniyeh, one of Israel's numerous assassinations of its enemies over the years.",
    "url": "https://www.reuters.com/world/middle-east/what-we-know-so-far-about-assassination-hamas-leader-2024-07-31/"
  },
  {
    "text": "Trump Flipped Out That ‘Lunatic’ Project 2025 Could Tank His Campaign  —  The former president effectively “birthed” Project 2025.  Now that the project is a political liability, one of Trump's foot soldiers is out of a job  —  AS HE ENTERED the final stretch of the 2024 presidential race … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-project-2025-abortion-campaign-1235071152/"
  },
  {
    "text": "Massacre on Mass. Ave.  —  Rolling Stone: “In the world of two weeks ago, the graphic Democratic euphoria on display in Atlanta Tuesday would have been almost inconceivable: a Division I basketball arena packed so full of ecstatic supporters that the fire marshal was refusing to let anyone else in.”",
    "url": "https://www.thebulwark.com/p/massacre-on-mass-ave"
  },
  {
    "text": "J.D. Vance's Obsessions Are Way Creepier Than Being Childless  —  DON'T DISS DOLLY!  —  OK, J. D. Vance: When did we begin equating fertility with patriotism?  And, if Republicans are so keen on people having kids, why would the party cut family assistance programs? … Having children is good.",
    "url": "https://www.thedailybeast.com/michael-ian-black-jd-vances-obsessions-are-way-creepier-than-being-childless"
  },
  {
    "text": "RFK Jr.'s campaign struggles with Harris in race  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions  — descriptions off, selected",
    "url": "https://thehill.com/homenews/campaign/4800614-robert-kennedy-campaign-troubles/"
  },
  {
    "text": "X suspends ‘White Dudes for Harris’ account after massive fundraiser  —  The account was reinstated, but the issue sparked concerns about how Musk could use X to sway voters, even as Republicans welcome his influence.  —  SAN FRANCISCO — Elon Musk's social media platform X suspended … ",
    "url": "https://www.washingtonpost.com/technology/2024/07/30/white-dudes-harris-suspended-x-twitter/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyMzEyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzNjk0Mzk5LCJpYXQiOjE3MjIzMTIwMDAsImp0aSI6IjU5OTM0MmVhLTlkYzAtNGE1Ny05YjBiLWQ1ZjkyOTYzZjcwYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDcvMzAvd2hpdGUtZHVkZXMtaGFycmlzLXN1c3BlbmRlZC14LXR3aXR0ZXIvIn0.cWe0jwql8I6h06KSd2FGzP1C99fsKs9IAfOFqCBCpPA&itid=gfta"
  },
  {
    "text": "Hostile Trump takes the stage at Black journalists' conference  —  The former president claimed to be the best president for Black people since Abraham Lincoln and suggested his Democratic opponent, Kamala Harris, used her race to help her get elected.  —  Within moments of Donald Trump taking … ",
    "url": "https://www.politico.com/news/2024/07/31/donald-trump-nabj-interview-00172104"
  },
  {
    "text": "Autoworkers Union Endorses Kamala Harris for President  —  The United Automobile Workers had backed President Biden but did not immediately endorse the vice president.  Ms. Harris will rally with U.A.W. members in Detroit next week.  —  The United Automobile Workers endorsed Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2024/07/31/us/politics/uaw-kamala-harris.html"
  },
  {
    "text": "Maya Rudolph returning to play Harris on ‘SNL’  —  Maya Rudolph is reportedly making her return as Kamala Harris on “Saturday Night Live” as the vice president's White House campaign kicks into full gear.  —  The “SNL” alum, who famously first portrayed the then-California senator … ",
    "url": "https://thehill.com/blogs/in-the-know/4803190-maya-rudolph-kamala-harris-snl-saturday-night-live-nbc/"
  },
  {
    "text": "Willie Brown on Kamala Harris: 'She'll Deport My Ass'  —  At 90, Harris's mentor and former boyfriend is basking in her rise to power — along with those of his many other proteges.  —  SAN FRANCISCO —  Since Kamala Harris became vice president, her former boyfriend and political mentor … ",
    "url": "https://www.politico.com/news/magazine/2024/07/31/willie-brown-kamala-harris-campaign-column-00171885"
  },
  {
    "text": "Fed holds rates steady and notes progress on inflation … WATCH NOW  —  WASHINGTON - Federal Reserve officials on Wednesday held short-term interest rates steady but indicated that inflation is getting closer to its target, which could open the door for future interest rate cuts.",
    "url": "https://www.cnbc.com/2024/07/31/fed-rate-decision-july-2024.html"
  },
  {
    "text": "VP Harris In Talks With NABJ For Virtual or In-Person Q&A in September, Former President Trump Set to Appear In Person Wednesday  —  NABJ is currently in conversation with the Harris for President campaign team to schedule a Q&A session between Vice President Harris and NABJ … ",
    "url": "https://nabjonline.org/blog/vp-harris-offers-to-address-nabj-virtually-postconvention-former-president-trump-set-to-appear-inperson/"
  },
  {
    "text": "Exclusive: How Samuel Alito got canceled from the Supreme Court social media majority  —  The hardline approach Supreme Court Justice Samuel Alito takes usually gets him what he wants.  —  This year it backfired.  —  Behind the scenes, the conservative justice sought to put a thumb … ",
    "url": "https://www.cnn.com/2024/07/31/politics/samuel-alito-supreme-court-netchoice-social-media-biskupic/"
  },
  {
    "text": "Meet the conspiracy theorist and anti-LGBTQ extremist pulling the strings at major American corporations  —  In recent months, major companies have publicly announced that they are abandoning their diversity efforts.  In at least two cases, companies were pressured into taking action … ",
    "url": "https://popular.info/p/meet-the-conspiracy-theorist-and"
  }
]