[
  {
    "text": "“They're Scared Shitless”: The Threat of Political Violence Informing Trump's Grip on Congress  —  With the president smashing norm after norm, even lawmakers within his party have feared for their personal safety, and at least one has told confidants that it has swayed his decision-making.",
    "url": "https://www.vanityfair.com/news/story/trump-congress-political-violence"
  },
  {
    "text": "After ceding power of the purse, GOP lawmakers beg Trump team for funds  —  Republican senators are asking Cabinet secretaries and other Trump officials to let money flow back into their states.  —  Republican senators find themselves in an unusual position these days … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/19/trump-musk-senators-funding/"
  },
  {
    "text": "EXCLUSIVE: VP J.D. Vance Warns Zelensky Over ‘Disgraceful’ Public Attacks on Trump, Confirms Ukrainian Elections Are Now U.S. Policy.  —  EXCLUSIVE: VP J.D. Vance Warns Zelensky Over ‘Disgraceful’ Public Attacks on Trump, Confirms Ukrainian Elections Are Now U.S. Policy.",
    "url": "https://thenationalpulse.com/2025/02/19/exclusive-vp-j-d-vance-warns-zelensky-over-disgraceful-public-attacks-on-trump-confirms-ukrainian-elections-are-now-u-s-policy/"
  },
  {
    "text": "Zelensky and Trump Trade Blows as Feud Escalates Over Peace Talks  —  President Trump called Volodymyr Zelensky a “dictator” after the Ukrainian president took issue with his statements on the war with Russia.  — 2.3k  —  Constant Méheut and Anton Troianovski",
    "url": "https://www.nytimes.com/2025/02/19/world/europe/ukraine-zelensky-trump-russia-war.html?unlocked_article_code=1.yE4.LEYS.s7qNMoAirzdD&smid=url-share"
  },
  {
    "text": "Hegseth considering firing generals as early as this week  —  Courtney Kube and Julie Tsirkin  —  Defense Secretary Pete Hegseth is considering firing a slate of military generals and flag officers as early as this week, according to two defense officials and three congressional officials.",
    "url": "https://www.nbcnews.com/politics/politics-news/live-blog/live-updates-trump-lori-chavez-deremer-cpac-rcna192744/rcrd73369?canonicalCard=true"
  },
  {
    "text": "Trump's America is Putin's ally now  —  LONDON — The thing about a war is it forces people to pick a side.  And Donald Trump, it seems to many in Europe, is siding with Vladimir Putin.  —  Seven days of presidential interventions in the Russia-Ukraine conflict have made real the nightmares … ",
    "url": "https://www.politico.eu/article/donald-trump-america-vladimir-putin-ally-war/"
  },
  {
    "text": "ICE Prosecutor in Dallas Runs White Supremacist X Account  —  Fear of Immigration and Customs Enforcement (ICE) raids began to spread the day after President Donald Trump was inaugurated for the second time.  Posts on social media and Reddit claimed that ICE had already been spotted … ",
    "url": "https://www.texasobserver.org/ice-prosecutor-dallas-white-supremacist-x-account/"
  },
  {
    "text": "Majority Say System Of Checks & Balances Not Working Well, Quinnipiac University National Poll Finds; Congressional Job Approval: Democrats Hit All-Time Low, Republicans Hit Record High  —  mail_outline  —  Less than 4 in 10 voters think the system of checks and balances between the executive … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3919"
  },
  {
    "text": "One confirmed dead in Marana Regional Airport crash Wednesday morning  —  KGUN 9 has a crew on scene  —  MARANA, Ariz. (KGUN) — A crash has occurred at Marana Regional Airport, 11700 W. Avra Valley Road, Wednesday morning, KGUN 9 has confirmed with airport personnel.",
    "url": "https://www.kgun9.com/news/community-inspired-journalism/marana/marana-regional-airport-confirms-crash-wednesday-morning"
  },
  {
    "text": "NYC congestion pricing axed as Trump pulls approval of hated toll  —  Congestion pricing, we hardly knew ye.  —  New York City's spectacularly unpopular congestion pricing scheme is on death row as the Trump administration will announce Wednesday it is pulling its approval of the toll … ",
    "url": "https://nypost.com/2025/02/19/us-news/nyc-congestion-pricing-axed-as-trump-pulls-approval-of-hated-toll/"
  },
  {
    "text": "Trump's approval rating slips as Americans worry about the economy  —  U.S. President Donald Trump's approval rating has ticked slightly lower in recent days as more Americans worried about the direction of the U.S. economy as the new leader threatens a host of countries with tariffs, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/trumps-approval-rating-slips-americans-worry-about-economy-2025-02-19/"
  },
  {
    "text": "IRS expected to fire 6,700 employees beginning Thursday  —  The Internal Revenue Service is preparing to conduct mass firings of 6,700 employees beginning Thursday, according to multiple employees notified of the plans.  —  Staff in their probationary periods—mostly recent hires … ",
    "url": "https://www.govexec.com/workforce/2025/02/irs-expected-fire-6700-employees-beginning-thursday/403122/"
  },
  {
    "text": "Trump administration orders Pentagon to plan for sweeping budget cuts  —  The directive, detailed in a memo dated Tuesday, exempts a handful of programs, including the president's expanded military mission along the U.S.-Mexico border.",
    "url": "https://www.washingtonpost.com/national-security/2025/02/19/trump-pentagon-budget-cuts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5OTQxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMzIzNTk5LCJpYXQiOjE3Mzk5NDEyMDAsImp0aSI6ImE4YmYwMzA5LTU0OTUtNDcwNi05N2UyLTAwZjRlYzMzMjE5NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzE5L3RydW1wLXBlbnRhZ29uLWJ1ZGdldC1jdXRzLyJ9.9StAqisJCLd4To7GKOHeJcKsZRTOPxPMcznFhvFtT2k&itid=gfta"
  },
  {
    "text": "Judge appears on track to let DOJ dismiss Eric Adams case  —  Some legal experts and advocacy groups had urged the judge to forcefully push back against the Justice Department's decision to abandon the case.  —  NEW YORK — The Justice Department appears likely to get the green light … ",
    "url": "https://www.politico.com/news/2025/02/19/eric-adams-case-justice-department-021004"
  },
  {
    "text": "Oops: Trump-Musk Cuts Just Wrecked an NIH Org Championed by GOPers  —  With co-Presidents Donald Trump and Elon Musk now inflicting deep cuts on federal agencies that sponsor medical research, thousands of scientists, researchers, and medical professionals are getting fired.",
    "url": "https://newrepublic.com/article/191702/trump-musk-national-institutes-health-wrecked"
  },
  {
    "text": "Cal Fire captain found stabbed to death inside of her San Diego County home  —  A Cal Fire captain was found stabbed to death inside of her San Diego County home on Monday and authorities are still searching for the suspect.  —  Deputies were dispatched to a home in the 20200 block … ",
    "url": "https://www.cbsnews.com/losangeles/news/cal-fire-captain-stabbed-to-death-san-diego-county-home/"
  },
  {
    "text": "Trump says ‘inflation is back’: ‘I had nothing to do with it’  —  President Trump is seeking to distance himself from a rise in inflation, arguing that the uptick had “nothing to do” with his return to the Oval Office.  —  Trump instead placed the blame on former President Biden in an interview Tuesday … ",
    "url": "https://thehill.com/homenews/administration/5152657-donald-trump-rising-inflation-doge-tariffs-economy/"
  },
  {
    "text": "A Frustrated Trump Wants His New Air Force One Planes Pronto  —  Among the ways being discussed to force faster delivery of two presidential planes are relaxing security clearances for Boeing workers and even purchasing a temporary luxury plane and retrofitting it.",
    "url": "https://www.nytimes.com/2025/02/19/us/politics/trump-musk-air-force-one-boeing.html?unlocked_article_code=1.yE4.Vj4H.1niw_CkMPsdq"
  },
  {
    "text": "Two more staffers quit John Fetterman's office as the senator carves his own lane with Trump  —  The imminent exit of two of Fetterman's longest-serving staffers continues a string of departures from the senator's office over the past year.  —  Two of Sen. John Fetterman's longest-serving staff members … ",
    "url": "https://www.nbcnews.com/politics/congress/two-staffers-quit-john-fetterman-office-rcna192804"
  },
  {
    "text": "DOGE Has ‘God Mode’ Access to Government Data  —  The president's special commission now has an unprecedented ability to view and manipulate information at many federal agencies.  —  If you have tips about the remaking of the federal government, you can contact Charlie, Ian … ",
    "url": "https://www.theatlantic.com/technology/archive/2025/02/doge-god-mode-access/681719/?gift=bQgJMMVzeo8RHHcE1_KM0QpD_QLH9WHzx7gEywUfx3I&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Citing ‘Biological Truth,’ Kennedy Issues Guidance Recognizing Only Two Sexes  —  The new guidance follows President Trump's demand that the Health and Human Services Department align with his executive order barring transgender athletes from women's sports.",
    "url": "https://www.nytimes.com/2025/02/19/us/politics/rfk-jr-hhs-sex-genders.html"
  },
  {
    "text": "These Are the SpaceX Engineers Already Working Inside the FAA  —  SpaceX engineers were said to be simply touring the Federal Aviation Administration on Monday.  In fact, some were already being onboarded at the agency under a policy designed to increase “employment opportunities for people with disabilities.”",
    "url": "https://www.wired.com/story/faa-doge-elon-musk-space-x/"
  },
  {
    "text": "Diary  —  I decided to keep a record of my thoughts as events transpire, a diary.  I have read several reactions by Germans to the rise of Nazism and I was struck by their difficulty to understand where the daily events they lived through could or would lead.  In retrospect, we will know, analyze, and make sense.",
    "url": "https://adamprzeworski.substack.com/p/diary"
  },
  {
    "text": "Ex-NFL punter Chris Kluwe arrested over protest at Huntington Beach City Council meeting  —  Former NFL punter Chris Kluwe was arrested over a protest at a city council meeting in Huntington Beach, California on Tuesday.  —  Kluwe was protesting Huntington Beach's decision to display a plaque … ",
    "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/ex-nfl-punter-chris-kluwe-arrested-over-protest-at-huntington-beach-city-council-meeting"
  }
]