[
  {
    "text": "Biden's Age, Economic Worries Endanger Re-Election in 2024, WSJ Poll Finds  —  Nearly three-quarters of voters say the president is too old to run again  —  Voters overwhelmingly think President Biden is too old to run for re-election and give him low marks for handling the economy … ",
    "url": "https://www.wsj.com/politics/elections/bidens-age-economic-worries-endanger-re-election-in-2024-wsj-poll-finds-67a7bba8?mod=followamazon"
  },
  {
    "text": "Senate Republican: 'We don't know' if Trump could beat Biden in 2024  —  Sen. Mike Rounds (R-S.D.) said on Sunday he does not know if former President Trump could beat President Biden in a hypothetical 2024 general election rematch at this point in the campaign, saying that's one of his concerns.",
    "url": "https://thehill.com/blogs/blog-briefing-room/news/4185085-senate-republican-we-dont-know-if-trump-could-beat-biden-in-2024/"
  },
  {
    "text": "Ramaswamy doubles down on voting for Trump if former president is convicted  —  GOP presidential candidate Vivek Ramaswamy doubled down on his comments regarding voting for former President Trump if he is the Republican nominee in 2024, even if Trump is convicted in one of his four ongoing legal battles.",
    "url": "https://thehill.com/homenews/campaign/4185050-ramaswamy-doubles-down-on-voting-for-trump-if-former-president-is-convicted/"
  },
  {
    "text": "Tens of thousands at Burning Man told to conserve water and food after heavy rains leave attendees stranded in Nevada desert  —  Tens of thousands of people attending the Burning Man festival in the Nevada desert are being told to conserve food, water and fuel as they shelter in place … ",
    "url": "https://www.cnn.com/2023/09/02/us/burning-man-storms-shelter-black-rock-city/"
  },
  {
    "text": "Burning Man 2023: Feds shut down entry, tell burners waiting to get in to go home  —  Noon update: Burning Man entry shut down for remainder of event  —  The Bureau of Land Management released a statement Saturday, saying Burning Man entry is now closed for good:",
    "url": "https://www.rgj.com/story/life/arts/burning-man/2023/09/02/burning-man-2023-rain-keeps-burners-confined-to-camps/70749751007/"
  },
  {
    "text": "DeSantis' super PAC head honcho privately admits he's spreading dirt on Ramaswamy  —  The private remarks underscore a brewing anxiety about the upstart entrepreneur turned primary foe.  —  The top strategist for Ron DeSantis' super PAC privately told donors that Vivek Ramaswamy posed … ",
    "url": "https://www.politico.com/news/2023/09/03/desantis-super-pac-ramaswamy-00113836"
  },
  {
    "text": "DeSantis Florida redistricting map is unconstitutional and must be redrawn, judge says  —  A Florida redistricting plan pushed by Republican Gov. Ron DeSantis violates the state constitution and is prohibited from being used for any future U.S. congressional elections since it diminishes … ",
    "url": "https://www.npr.org/2023/09/02/1197452442/desantis-florida-redistricting-map-gerrymandering-unconstitutional"
  },
  {
    "text": "Twitter accused of helping Saudi Arabia commit human rights abuses  —  Lawsuit says network discloses user data at request of Saudi authorities at much higher rate than for US, UK and Canada  —  The social media company formerly known as Twitter has been accused in a revised civil US lawsuit … ",
    "url": "https://www.theguardian.com/world/2023/sep/04/twitter-saudi-arabia-human-rights-abuses"
  },
  {
    "text": "Home insurers cut natural disasters from policies as climate risks grow  —  Some of the largest U.S. insurance companies say extreme weather has led them to end certain coverages, exclude natural disaster protections and raise premiums  —  In the aftermath of extreme weather events … ",
    "url": "https://www.washingtonpost.com/business/2023/09/03/natural-disaster-climate-insurance/"
  },
  {
    "text": "As Clarence Thomas faces record unpopularity, Americans want an ethics code for the Supreme Court  —  Supreme Court Justice Clarence Thomas ended a monthslong saga last week by officially disclosing trips paid for by GOP megadonor Harlan Crow.  —  The incident brought to light a key fact … ",
    "url": "https://www.cnn.com/2023/09/03/politics/supreme-court-ethics-code-clarence-thomas/"
  },
  {
    "text": "President Biden: Bidenomics is working in Wisconsin.  We're investing in American workers.  —  Labor Day honors the dignity of the American worker and recognizes that Wall Street didn't build America  —  President Joe BidenMilwaukee Journal Sentinel  —  Three weeks ago … ",
    "url": "https://www.jsonline.com/story/opinion/2023/09/03/biden-economic-plan-touts-jobs-wage-increase-overtime-pay/70742157007/"
  },
  {
    "text": "The California Megachurch Pushing Public Schools to the Far Right  —  From fights over LGBT rights to prayer at school board meetings, Chino Valley public schools have become ground zero for the culture wars.  —  Outside the California State Capitol last month, a fitness trainer turned … ",
    "url": "https://www.thedailybeast.com/california-megachurch-pastor-jack-hibbs-and-his-acolytes-are-pushing-public-schools-to-the-far-right"
  },
  {
    "text": "What Really Happens When Americans Stop Going to Church  —  People hold on to their politics when they stop attending church.  —  Millions of Americans are leaving church, never to return, and it would be easy to think that this will make the country more secular and possibly more liberal.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/09/christianity-religion-america-church-polarization/675215/"
  },
  {
    "text": "Congress poised for messy September as McCarthy races to avoid government shutdown  —  GOP hardliners in the House are eager to play a game of chicken over the end-of-the-month deadline to fund federal agencies, seeking to force the White House and Senate to make a choice … ",
    "url": "https://www.cnn.com/2023/09/03/politics/congress-september-government-shutdown-kevin-mccarthy/"
  }
]