[
  {
    "text": "Trump Encourages Putin to Attack NATO Members  —  At a rally on Saturday, the former president announced he would tell the Russians “to do whatever the hell they want” to states delinquent in their bills.  —  Donald Trump, the 45th president of the United States and the presumptive Republican nominee … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/trump-rally-nato/677426/"
  },
  {
    "text": "Trump says he would encourage Russia to attack Nato allies who pay too little  —  Republican senator Marco Rubio seeks to downplay meaning of remarks as White House describes them as ‘unhinged’  —  A Republican senator has sought to calm rising European security anxieties created by Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/11/donald-trump-says-he-would-encourage-russia-to-attack-nato-countries-who-dont-pay-bills"
  },
  {
    "text": "Trump Says He Might ‘Encourage’ Russia To Attack NATO Allies  —  “You gotta pay your bills,” said the former president notorious for not paying his own bills.  —  LOADING  —  Former President Donald Trump delivered an alarming message to U.S. allies during a Saturday rally where he outlined … ",
    "url": "https://www.huffpost.com/entry/trump-russia-attack-nato-allies_n_65c7e443e4b069b665dfb762"
  },
  {
    "text": "Trump Says He Gave NATO Allies Warning: Pay In or He'd Urge Russian Aggression  —  Speaking in Conway, S.C., Donald J. Trump said as president he'd told NATO allies that he would urge Russian aggression against countries that owed the military alliance money.",
    "url": "https://www.nytimes.com/2024/02/10/us/politics/trump-nato-russia.html"
  },
  {
    "text": "Trump says he would encourage Russia to ‘do whatever the hell they want’ to any NATO country that doesn't pay enough  —  Former President Donald Trump on Saturday said he would encourage Russia to do “whatever the hell they want” to any NATO member country that doesn't meet spending guidelines … ",
    "url": "https://www.cnn.com/2024/02/10/politics/trump-russia-nato/"
  },
  {
    "text": "‘Enough to make Reagan ill’: Trump's NATO remarks under fire  —  “Honestly this seems kinda important,” said Sen. Brian Schatz.  —  Democrats and some Republicans were quick to condemn Donald Trump after the former president said Saturday night he would “encourage” Russia to attack … ",
    "url": "https://www.politico.com/news/2024/02/11/trump-nato-remarks-democrats-putin-00140848"
  },
  {
    "text": "Rubio declines to criticize Trump over comments on Haley's husband  —  “It's just part of these campaign cycles,” he said.  —  Sen. Marco Rubio on Sunday declined to condemn former President Donald Trump for his rhetoric Saturday about the husband of Republican rival Nikki Haley, a National Guard officer now deployed overseas.",
    "url": "https://www.politico.com/news/2024/02/11/rubio-trump-haley-husband-00140847"
  },
  {
    "text": "Trump suggests he'd disregard NATO treaty, urge Russian attacks on allies  —  GOP front-runner said he encouraged Russia to “do whatever the hell they want” to member countries he views as not spending enough on own defense.  —  CONWAY, S.C. — Former president Donald Trump ramped up his attacks … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/10/trump-nato-allies-russia/"
  },
  {
    "text": "Donald Trump threatens NATO, says he would ‘encourage’ Russia to ‘do whatever the hell they want’  —  Former President Donald Trump again stirred fears about the future of NATO by suggesting he might not come to the aid of European nations if they're attacked by Russia − and might even … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/02/11/donald-trump-threatens-nato-russia/72556515007/"
  },
  {
    "text": "NATO Joins White House in Rejecting Trump's Remarks on Alliance  — Republican suggests repercussions for delinquent countries  — Biden administration says GOP frontrunner endangers security  —  NATO's top official joined the White House in slamming comments by Donald Trump … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-11/us-calls-trump-s-russia-remark-on-nato-allies-appalling"
  },
  {
    "text": "Overwhelming majority of Americans think Biden is too old for another term: POLL  —  A majority also think Trump is too old for a second term.  —  President Joe Biden delivers remarks in the State Dining Room of the White House in Washington, D.C., on Feb. 6, 2024.",
    "url": "https://abcnews.go.com/Politics/poll-americans-on-biden-age/story?id=107126589"
  },
  {
    "text": "Playbook: ‘Wild’ and ‘dangerous’ Trump upstages ‘elderly’ Biden  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  Yesterday, we laid out the case many prominent Democrats and JOE BIDEN-supporting editorialists are making for the president to exit his … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/11/wild-and-dangerous-trump-upstages-elderly-biden-00140853"
  },
  {
    "text": "Biden moving closer to a breach with Netanyahu over war in Gaza  —  Some of Biden's aides are urging him to publicly criticize the Israeli prime minister as casualties mount  —  President Biden and his top aides are closer to a breach with Israeli Prime Minister Benjamin Netanyahu … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/11/biden-netanyahu-closer-to-a-breach/"
  },
  {
    "text": "McCarthy foes face blowback as primary threats grow and GOP donors shut their wallets  —  Watch CNN's coverage of the eight House Republicans who voted to oust former Speaker Kevin McCarthy on “Inside Politics Sunday with Manu Raju” at 11 a.m. ET.  —  CNN  —  Donors no longer want to contribute to their campaigns.",
    "url": "https://www.cnn.com/2024/02/11/politics/kevin-mccarthy-foes-blowback/"
  }
]