[
  {
    "text": "FBI calls bomb threats that led to brief lockdowns and evacuations of some state capitols a hoax  —  A bomb threat emailed to officials in several states early Wednesday briefly disrupted government affairs and prompted some state capitol evacuations, but no explosives were found … ",
    "url": "https://apnews.com/article/state-capitol-threat-evacuation-lockdown-dfef5fbb98ec6572474807c260533b05"
  },
  {
    "text": "Bomb threats force evacuations in a half-dozen state capitols  —  Bomb threats were reported in at least a half-dozen state capitols Wednesday morning, forcing evacuations from statehouse buildings and interrupting court proceedings, according to officials and local news outlets.",
    "url": "https://www.washingtonpost.com/politics/2024/01/03/bomb-threats-state-capitols/"
  },
  {
    "text": "Harvard president's resignation highlights new conservative weapon against colleges: plagiarism  —  (Jan 02) (AP video by Rodrique Ngowi) (AP production by Javier Arciga)  —  American higher education has long viewed plagiarism as among the most serious of offenses.",
    "url": "https://apnews.com/article/harvard-president-plagiarism-claudine-gay-3b048da1f2ee17b5edec3680b5828e8f"
  },
  {
    "text": "Former Harvard President Claudine Gay: This Is About More Than My Mistakes  —  On Tuesday, I made the wrenching but necessary decision to resign as Harvard's president.  For weeks, both I and the institution to which I've devoted my professional life have been under attack.",
    "url": "https://www.nytimes.com/2024/01/03/opinion/claudine-gay-harvard-president.html"
  },
  {
    "text": "This is how I will end Joe Biden's border disaster on day one  —  We do not have time for on-the-job training.  Unlike every other candidate, with me, there is no question.  I promise you that I will get this job done.  —  The most urgent task facing the next president … ",
    "url": "https://www.desmoinesregister.com/story/opinion/columnists/caucus/2024/01/03/donald-trump-joe-biden-border-disaster/72093156007/"
  },
  {
    "text": "House committee to formally begin impeachment proceedings against Biden Homeland Security chief over border policies  —  House Republicans will forge ahead with steps to impeach Secretary of Homeland Security Alejandro Mayorkas over his handling of the border crisis, a GOP source tells CNN.",
    "url": "https://www.cnn.com/2024/01/03/politics/house-homeland-security-committee-impeachment-mayorkas/"
  },
  {
    "text": "Former U.S. Rep. Mayra Flores accused of cribbing others' pictures of Mexican food as her own cooking  —  Flores, who is challenging U.S. Rep. Vicente Gonzalez for her old seat, is being accused of routinely stealing stylish photos of Mexican campfire cooking and passing them off as her own idyllic life on a ranch.",
    "url": "https://www.texastribune.org/2024/01/03/mayra-flores-mexican-food-photos/"
  },
  {
    "text": "Trump asks Supreme Court to keep his name on Colorado ballot  —  Former president, who is the 2024 GOP frontrunner, is also appealing a Maine official's decision to bar him from the ballot in that state  —  Donald Trump asked the U.S. Supreme Court on Wednesday to ensure he can appear … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/03/trump-colorado-ballot-appeal/"
  },
  {
    "text": "Epstein-linked John Does are about to be named publicly.  Here's what we know  —  New York CNN  —  Newly unsealed documents from a lawsuit connected to accused sex-trafficker Jeffrey Epstein will begin to be released Wednesday afternoon, by order of a federal judge in New York.",
    "url": "https://www.cnn.com/2024/01/03/business/jeffrey-epstein-john-does/"
  },
  {
    "text": "Jack Smith Keeps Telegraphing Some Seriously Scandalous Trump Crimes  —  Did Donald Trump accept a bribe?  Order his FBI director to fake evidence?  Tell the National Guard to kill critics?  Sell nuclear secrets?  Jack Smith is being awfully suggestive.  —  As Special Counsel Jack Smith makes … ",
    "url": "https://www.thedailybeast.com/jack-smith-keeps-telegraphing-some-seriously-scandalous-trump-crimes"
  },
  {
    "text": "The Polls Prove It: Many Republicans Love Fascism … It is no longer controversial to speak plainly about the authoritarian shift of the Republican Party, led by Donald Trump.  Hillary Clinton was dragged in 2016 for saying, “You could put half of Trump's supporters into what I call the basket … ",
    "url": "https://newrepublic.com/article/177796/polls-republicans-trump-maga-fascism"
  },
  {
    "text": "A Joint Statement from the Governments of the United States, Australia, Bahrain, Belgium, Canada, Denmark, Germany, Italy, Japan, Netherlands, New Zealand, Singapore, and the United Kingdom  —  Recognizing the broad consensus as expressed by 44 countries around the world on December 19, 2023 … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/03/a-joint-statement-from-the-governments-of-the-united-states-australia-bahrain-belgium-canada-denmark-germany-italy-japan-netherlands-new-zealand-and-the-united-kingdom/"
  },
  {
    "text": "GOP Rep Calls Jesse Watters a ‘Fucking Hack,’ Claims Fox News Canceled Interview in Retaliation  —  Crenshaw brought up Watters' past infidelity and blasted him as a “f*cking clown” after the Fox star suggested he may have been involved in unethical stock transactions.",
    "url": "https://www.thedailybeast.com/gop-rep-dan-crenshaw-calls-jesse-watters-a-fucking-hack-claims-fox-news-canceled-interview-in-retaliation"
  },
  {
    "text": "A Constitution-flouting ‘authoritarian’ is already in the White House  —  Overcaffeinated Cassandras continue to forecast an “authoritarian” and anti-constitutional Donald Trump dictatorship.  They are mistaken about the near future because, among other reasons, they misread the recent past.",
    "url": "https://www.washingtonpost.com/opinions/2024/01/03/biden-disdain-constitution-senate/"
  },
  {
    "text": "At least 103 dead in bomb blasts near Iran general Qasem Soleimani's tomb - state TV  —  Watch: Moment crowds disperse after deadly bomb blasts in Iran  —  At least 103 people have been killed by two bomb explosions near the tomb of Iranian general Qasem Soleimani on the fourth anniversary … ",
    "url": "https://www.bbc.com/news/world-middle-east-67872281"
  },
  {
    "text": "MEDIA ADVISORY: Chairman Green Announces First Hearing as Part of Impeachment Proceedings Against DHS Secretary Mayorkas  —  WASHINGTON, D.C. — Today, House Homeland Security Committee Chairman Mark E. Green, MD (R-TN) announced a full committee hearing on Wednesday, January 10, 2024 … ",
    "url": "https://homeland.house.gov/2024/01/03/media-advisory-chairman-green-announces-first-hearing-as-part-of-impeachment-proceedings-against-dhs-secretary-mayorkas/"
  },
  {
    "text": "Former Guard Official Says Army Retaliated for His Account of Jan. 6 Delay  —  Col. Earl Matthews, the top lawyer for the D.C. National Guard during the assault on the Capitol, said in a whistle-blower complaint that he was punished for contradicting the testimony of two top generals.",
    "url": "https://www.nytimes.com/2024/01/03/us/politics/national-guard-whistleblower-complaint-jan-6.html"
  },
  {
    "text": "Anti-abortion OB-GYNs react to court victory in Texas case  —  The anti-abortion physicians group that sued the Biden administration over abortion restrictions in Texas praised a ruling from the United States Court of Appeals for the 5th Circuit on Tuesday that found that federal regulations do not grant an absolute right to abortion.",
    "url": "https://www.washingtonexaminer.com/policy/healthcare/anti-abortion-ob-gyns-react-court-victory-texas"
  }
]