[
  {
    "text": "Biden's reset moment … Officials close to him, needing a repeat triumph, will spend hours on everything from the text to his physical preparation to exploit the prime-time moment.  — “Everyone around him is well aware — well aware — of the need to jack this campaign up,” a source close to Biden said.",
    "url": "https://www.axios.com/2024/02/19/biden-trump-age-state-union-election"
  },
  {
    "text": "It's time for the White House to put up or shut up  —  If you'd asked me a year ago, I would have told you that Joe Biden was a reasonably clear favorite in the event of a rematch against Donald Trump.  —  Not an overwhelming favorite, mind you.  But perhaps a 65:35 favorite.",
    "url": "https://www.natesilver.net/p/its-time-for-the-white-house-to-put"
  },
  {
    "text": "Wisconsin's Democratic governor signs his new state legislative maps into law  —  Republicans control the Legislature but approved the new lines to avoid a court fight.  —  MADISON, Wisconsin — Wisconsin Democratic Gov. Tony Evers signed new legislative district maps into law on Monday … ",
    "url": "https://www.politico.com/news/2024/02/19/wisconsin-democratic-governor-signs-state-legislative-maps-00142096"
  },
  {
    "text": "Measles erupts in Florida school where 11% of kids are unvaccinated  —  Over 100 children at the school are susceptible to virus.  —  Florida health officials on Sunday announced an investigation into a cluster of measles cases at an elementary school in the Fort Lauderdale area with a low vaccination rate … ",
    "url": "https://arstechnica.com/science/2024/02/measles-erupts-in-florida-school-where-11-of-kids-are-unvaccinated/"
  },
  {
    "text": "Florida health officials investigate measles outbreak at school  — Four measles cases were confirmed at a South Florida elementary school  — The first case was reported Thursday; three others were confirmed Saturday  — Officials advise contacting health providers before vising offices if sick",
    "url": "https://thehill.com/policy/healthcare/4476924-florida-health-officials-investigate-measles-outbreak-at-school/"
  },
  {
    "text": "Judge Engoron's Ruling Is a Detailed Road Map to Trump's Thievery  —  The news about the eye-popping $355 million judgment against Donald Trump Friday minimized or even missed the real story in the judge's richly detailed ruling.  —  In justifying his findings of fact … ",
    "url": "https://newrepublic.com/article/179079/engoron-ruling-details-trump-thievery"
  },
  {
    "text": "New York Times publisher A. G. Sulzberger: “Our industry needs to think bigger”  —  In this exclusive interview, he discusses his role in shaping the paper and preserving its values  —  In early January 1996 journalist Kevin McKenna presented the New York Times' first website to three generations … ",
    "url": "https://reutersinstitute.politics.ox.ac.uk/news/new-york-times-publisher-g-sulzberger-our-industry-needs-think-bigger"
  },
  {
    "text": "NYT publisher: White House ‘extremely upset’ on Biden age coverage  —  “We are going to continue to report fully and fairly,” A.G. Sulzberger said.  —  The New York Times Publisher A.G. Sulzberger said Monday that the White House is “extremely upset” about its coverage on President Joe Biden's age … ",
    "url": "https://www.politico.com/news/2024/02/19/nyt-white-house-upset-biden-age-coverage-00142098"
  },
  {
    "text": "John Oliver Offers Supreme Court Justice Clarence Thomas $1 Million a Year to Resign  —  John Oliver made Justice Clarence Thomas an offer too good to refuse, but he has 30 days to take a cool million a year — plus a sweet bus — or it goes away.  —  Oliver made the stunning offer at the end … ",
    "url": "https://www.mediaite.com/tv/john-oliver-offers-supreme-court-justice-clarence-thomas-1-million-a-year-to-resign/"
  },
  {
    "text": "Read: Historians rank Trump as worst president … - Lincoln.  — F.D. Roosevelt.  — Washington.  — T. Roosevelt.  — Jefferson.  — Truman.  — Obama.  — Eisenhower.  — L.B. Johnson.  — Kennedy.",
    "url": "https://www.axios.com/2024/02/19/presidents-survey-trump-ranks-last-biden-14th"
  },
  {
    "text": "Documents reveal Abraham Lincoln pardoned Biden's great-great-grandfather  —  Every new president selects personalized Oval Office decor to suit his tastes and pay homage to admired predecessors.  President Biden's Oval Office boasts both a portrait and a bust of Abraham Lincoln.",
    "url": "https://www.washingtonpost.com/history/2024/02/19/abraham-lincoln-joe-biden-pardon-presidents-day/"
  },
  {
    "text": "Trump musical about ex-wives, Stormy Daniels debuts in New York  —  A parody musical centered on former President Trump and some of the well-known women in his life is hitting the off-Broadway stage in New York City this month.  —  The musical, titled “Five: The Parody Musical,” … ",
    "url": "https://thehill.com/blogs/in-the-know/4477302-trump-musical-five-ex-wives-stormy-daniels-ivanka-melania-debuts-new-york/"
  },
  {
    "text": "‘What a Coward’: Fox Contributor Blasts J.D. Vance For Refusing to ‘Look Zelensky in the Eye’ While Opposing Aid  —  Sen. J.D. Vance (R-OH) received a bevy criticism over the weekend for skipping out on a meeting with Ukrainian President Volodymyr Zelensky at the Munich Security Conference … ",
    "url": "https://www.mediaite.com/politics/what-a-coward-fox-contributor-blasts-j-d-vance-for-refusing-to-look-zelensky-in-the-eye-while-opposing-aid/"
  },
  {
    "text": "High-profile Republicans head for the exits amid House GOP dysfunction  —  House Republicans were shocked by some of the recent high-profile retirements announced by their colleagues, which have included powerful committee chairs and rising stars inside the GOP.",
    "url": "https://www.cnn.com/2024/02/19/politics/republicans-retiring-house/"
  },
  {
    "text": "Bipartisan House members unveil new border, foreign aid proposal  —  It's not yet clear if House GOP leadership would consider the proposal.  —  Representative Brian Fitzpatrick, a Republican from Pennsylvania, pauses while speaking during the American Federation of Government Employees … ",
    "url": "https://abcnews.go.com/Politics/bipartisan-house-members-unveil-new-border-foreign-aid/story?id=107348740"
  },
  {
    "text": "Trump-Putin 2024  —  Happy Presidents' Day—a quick missive today, and we'll let you get back to your holiday.  —  Hanging Putin Around Trump's Neck  —  Not to be a Debbie Downer on Presidents' Day, but I want to talk about Donald Trump and Vladimir Putin.",
    "url": "https://plus.thebulwark.com/p/trump-putin-2024"
  },
  {
    "text": "Every Accusation a Confession  —  OK, this was another long one, so I split it—bifurcated, that is.  —  Part 1 from yesterday is here.  This is part 2 and it is from thisterday.  —  At the U.S./Mexico border, Republicans are defending their right to make themselves feel safe by murdering refugee men … ",
    "url": "https://www.the-reframe.com/one-must-imagine-charlie-brown-happy-copy/"
  }
]