[
  {
    "text": "Trump Tells Supporters He 'Shouldn't Have Left' the White House  —  Donald J. Trump, who sought to overturn his loss of the 2020 election, also joked that he didn't mind if reporters were shot.  —  Former President Donald J. Trump told supporters on Sunday that he “shouldn't have left” … ",
    "url": "https://www.nytimes.com/2024/11/03/us/politics/trump-pa-rally-election.html"
  },
  {
    "text": "British ‘mega poll’ leans toward Harris victory  —  Election pollsters may be ‘herding’ and giving the impression Trump is stronger than he really is, Focaldata research suggests.  —  The British are a-coming.  This time, they're wielding a new polling technique with a huge survey sample … ",
    "url": "https://www.politico.com/news/2024/11/03/swing-state-mrp-mega-poll-00186941"
  },
  {
    "text": "Final NBC News poll: Harris-Trump race is neck and neck, with significant gender gap  —  Abortion and rising Democratic enthusiasm boost Harris, while the economy and the cost of living lift Trump ahead of an uncertain election.  —  The final national NBC News poll of the 2024 presidential campaign finds … ",
    "url": "https://www.nbcnews.com/politics/2024-election/final-nbc-news-poll-harris-trump-race-neck-neck-significant-gender-gap-rcna178361"
  },
  {
    "text": "Some Surprises in Last Battleground Polls, but Still a Deadlock  —  A rise for Kamala Harris in the Sun Belt, and a dip in the Northern swing states.  —  Kamala Harris and Donald J. Trump stayed deadlocked to the finish in the final New York Times/Siena College polls of the 2024 presidential election … ",
    "url": "https://www.nytimes.com/2024/11/03/upshot/polls-harris-trump-battlegrounds.html?unlocked_article_code=1.XE4.1qmh.hNVT64YEm95p&smid=url-share"
  },
  {
    "text": "Trump talks about reporters being shot and says he shouldn't have left White House in 2020  —  Donald Trump gave a profane and conspiracy-laden speech two days before the presidential election, talking about reporters being shot and suggesting he “shouldn't have left” the White House after his 2020 loss to Democrat Joe Biden.",
    "url": "https://apnews.com/article/donald-trump-kamala-harris-presidential-election-a310fbc211ad8f0f5e290547ec284187"
  },
  {
    "text": "Canvassers for Elon Musk's America PAC Were Fired and Stranded in Michigan After Speaking Out  —  A dozen Black canvassers were tricked, threatened, and driven in seatless U-Haul vans.  They were fired after WIRED reported on their plight—some without full pay or a way back home.",
    "url": "https://www.wired.com/story/canvassers-elon-musk-america-pac-fired-stranded-michigan-mistreatment/"
  },
  {
    "text": "FCC commissioner claims Harris on ‘SNL’ violates ‘equal time’ rule  —  A Federal Communications Commission (FCC) commissioner has claimed that Vice President Harris's recent appearance on “Saturday Night Live” violates the “equal time” rule.  —  “This is a clear and blatant effort to evade … ",
    "url": "https://thehill.com/homenews/4968217-fcc-commissioner-claims-harris-on-snl-violates-equal-time-rule/"
  },
  {
    "text": "Apology Not Accepted  —  I woke up yesterday morning to learn that Don Trump—the famed rapist, convicted felon, and white christian presidential candidate—had mimed performing a blowjob on his microphone stand to the clear delight of his crowd.  —  There's a famous Christian thinker named Jesus H. Christ … ",
    "url": "https://www.the-reframe.com/apology-not-accepted/"
  },
  {
    "text": "Trump doesn't rule out banning vaccines if he becomes president: 'I'll make a decision'  —  In an interview with NBC News, the former president also said that a push by RFK Jr. to remove fluoride in water “sounds OK to me.”  —  Former President Donald Trump said that Robert F. Kennedy Jr. would have a … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-banning-vaccines-president-rfk-fluoride-rcna178570"
  },
  {
    "text": "2024's biggest gaffe?  GOP telling the truth about what it will do to America.  —  The most wildly misunderstood yet commonly used word in American politics is “gaffe.”  The dictionary defines it as “an unintentional act or remark causing embarrassment to its originator; a blunder” — and that's not wrong.",
    "url": "https://www.inquirer.com/opinion/commentary/gop-agenda-repeal-obamacare-chips-act-20241103.html"
  },
  {
    "text": "Final Senate rankings: 5 seats most likely to flip  —  Two days remain until Election Day, and Republicans are aiming to take control of the Senate and expand their majority.  —  Democrats hold a 51-49 advantage, which Republicans have already sliced into with their pending victory in West Virginia.",
    "url": "https://thehill.com/homenews/state-watch/4966663-2024-senate-races-top-flip-targets/"
  },
  {
    "text": "Megyn Kelly presses Sheehy on bullet wound story: “So confusing” … - Sheehy, a former Navy SEAL, claims he was shot while deployed in Afghanistan. … Sheehy said: “There isn't.”  — “There's not an extensive medical record for any of this stuff,” Sheehy said.",
    "url": "https://www.axios.com/2024/11/02/megyn-kelly-sheehy-bullet-wound-story-confusing"
  },
  {
    "text": "Trump Boasts ‘Every Rally Is Full’ as Camera Immediately Pans to Empty Seats, People Leaving  —  The former president falsely claimed his rallies “do not have any seats that are empty”  —  A savvy camera operator fact checked Donald Trump live.  —  During his rally in Greensboro … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-rally-full-empty-seats-1235151596/"
  },
  {
    "text": "Epstein Claimed: Trump Liked to F**k His Friends' Wives  —  In recordings taken by author Michael Wolff, Epstein claimed Trump first slept with Melania on his Lolita Express and enjoyed cuckholding.  —  'Don't Do This Again': Harrison Ford Endorses Kamala Harris  —  'WE'LL MOVE FORWARD'",
    "url": "https://www.thedailybeast.com/epstein-claimed-trump-liked-to-fk-his-friends-wives/"
  },
  {
    "text": "Trump tells ABC he expects a winner to be declared election night  —  Trump tells Jonathan Karl he has “a substantial lead,” but admits he could lose.  —  Republican presidential nominee, former President Donald Trump, speaks during a campaign rally at First Horizon Coliseumin Greensboro, N.C., Nov. 02, 2024.",
    "url": "https://abcnews.go.com/Politics/trump-tells-abc-expects-winner-declared-election-night/story?id=115438086"
  },
  {
    "text": "Trump says ‘Fox News is not our friend,’ claims it's airing ‘Democrat ads’  —  Former President Trump on Sunday took aim at Fox News for airing what the GOP presidential nominee sees as too much coverage devoted to the Democrats, just a few days before the election.",
    "url": "https://thehill.com/media/4968450-trump-fox-news-not-our-friend-claiming-its-airing-democrat-ads/"
  }
]