[
  {
    "text": "It's Official: With “Vermin,” Trump Is Now Using Straight-up Nazi Talk  —  We've all often wondered whether Donald Trump understands the historical import of what comes out of his mouth.  He's so ill-informed, so proudly ignorant, that it's easy to think that when he hurls a historical insult, he just doesn't know.",
    "url": "https://newrepublic.com/article/176877/trump-vermin-speech-nazi-language"
  },
  {
    "text": "Trump calls political enemies ‘vermin,’ echoing dictators Hitler, Mussolini  —  On Veterans Day, the former president vowed to “root out” his liberal opponents, drawing backlash from historians who say his rhetoric is reminiscent of authoritarians  —  Former president Donald Trump denigrated … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/12/trump-rally-vermin-political-opponents/"
  },
  {
    "text": "Raskin says second Trump term would ‘look a lot like Vladimir Putin in Russia’  —  Rep. Jamie Raskin (D-Md.) on Sunday compared a hypothetical second Trump White House term to that of President Vladimir Putin's Russia and other authoritarian leaders in response to Trump's veiled threats … ",
    "url": "https://thehill.com/homenews/house/4306411-raskin-says-second-trump-term-would-look-a-lot-like-vladimir-putin-in-russia/"
  },
  {
    "text": "Longtime NY House Democrat Brian Higgins to step down over frustrations in Congress  —  Rep. Brian Higgins (D-N.Y.) announced Sunday he plans to resign from Congress in February 2024, after serving 19 years in the House of Representatives.  —  Higgins, who represents New York's heavily … ",
    "url": "https://thehill.com/homenews/house/4306322-longtime-ny-house-democrat-brian-higgins-to-resign-citing-frustrations-in-congress/"
  },
  {
    "text": "Trump's plans if he returns to the White House include deportation raids, tariffs and mass firings  —  President Joe Biden has a lot of unfinished business from his first term that he intends to continue if reelected.  It's a far different vision for the country than Donald Trump has outlined during his own campaign.",
    "url": "https://apnews.com/article/trump-policies-agenda-election-2024-second-term-d656d8f08629a8da14a65c4075545e0f"
  },
  {
    "text": "Tim Scott drops out of the 2024 presidential race  —  The South Carolina senator has been stagnating in the polls for months despite spending big on early TV ads.  —  Sen. Tim Scott of South Carolina announced Sunday night that he is dropping out of the 2024 presidential campaign.",
    "url": "https://www.nbcnews.com/politics/2024-election/tim-scott-drops-2024-presidential-race-rcna124836"
  },
  {
    "text": "Hamas envisioned deeper attacks, aiming to provoke an Israeli war  —  Evidence gleaned since Oct. 7 shows Hamas terrorists prepared for a ‘second phase’ of assaults amid hopes of inspiring violence in the West Bank and beyond  —  TEL AVIV — The first clues came from the bodies of slain terrorists … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/12/hamas-planning-terror-gaza-israel/"
  },
  {
    "text": "Jan. 6 rioter dubbed “QAnon Shaman” plans to run for U.S. Congress  —  Jacob Chansley, who rose to notoriety as the “QAnon Shaman” during the Jan. 6 U.S. Capitol riot, plans to run for Congress as a Libertarian in the 2024 general election. … - Rep. Debbie Lesko (R-Ariz.) has said she won't seek re-election in the district.",
    "url": "https://www.axios.com/2023/11/12/jan-6-rioter-qanon-shaman-jacob-chansley-congress"
  },
  {
    "text": "More than 180,000 people across France march against soaring antisemitism amid the Israel-Hamas war  —  More than 180,000 people across France, including 100,000 in Paris, marched peacefully on Sunday to protest against rising antisemitism in the wake of Israel's ongoing war against Hamas in Gaza.",
    "url": "https://apnews.com/article/france-paris-antisemitism-march-macron-1083d79342ce7a27ccd4f5f63e2abc57"
  },
  {
    "text": "Jewish families leaving synagogue ‘targeted’ by pro-Palestinian demonstrators  —  Social media footage showed protesters spraying green smoke, waving Palestinian flags and shouting from cars in north-west London  —  Jewish families leaving synagogue on Saturday were “targeted” … ",
    "url": "https://www.telegraph.co.uk/news/2023/11/11/protesters-extreme-anti-semitic-signs-pro-palestinian-march/"
  },
  {
    "text": "How abortion could upend the 2024 battle for Congress  —  Democrats' rush to get abortion-related initiatives on the ballot in key states could throw a wrench in Republicans' effort to keep the House in 2024. … - Democrats took the results to show that the grassroots energy they've enjoyed since … ",
    "url": "https://www.axios.com/2023/11/12/abortion-congress-senate-house-democrats"
  },
  {
    "text": "5 U.S. Special Operations Troops Killed in Helicopter Crash in Mediterranean  —  The troops were on a refueling training mission when the aircraft crashed off the coast of Cyprus.  The episode, which Defense Secretary Lloyd J. Austin III said was an accident, is under investigation.",
    "url": "https://www.nytimes.com/2023/11/12/us/politics/us-service-members-killed-crash.html"
  },
  {
    "text": "Army Ammunition Plant Is Tied to Mass Shootings Across the U.S.  —  The site was built for the military, but commercial sales are booming with little public accountability.  Rounds have been bought by murderers, antigovernment groups and others.  —  By Ben DooleyVideos by Emily Rhyne",
    "url": "https://www.nytimes.com/2023/11/11/us/army-ammunition-factory-shootings.html"
  },
  {
    "text": "Trump defense at New York fraud trial set to counter state attorney general  —  NEW YORK — Former Trump Organization insider Michael Cohen testified in state court that his ex-boss Donald Trump instructed him to fudge numbers on annual financial statements so that they would show his desired net worth.",
    "url": "https://www.washingtonpost.com/politics/2023/11/12/trump-new-york-fraud-trial-james/"
  }
]