[
  {
    "text": "Hillary Clinton Debated Trump.  Here's Her Advice for Kamala Harris.  —  The 2016 Democratic nominee fell short to Donald Trump, but she had strong debate moments against him.  In an interview, she offered some thoughts for Kamala Harris.  —  Hillary Clinton has as much experience as any Democrat in debating Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/09/07/us/politics/hillary-clinton-debate-trump-harris.html"
  },
  {
    "text": "Why Kamala Isn't Preparing to Knock Out Trump at the Debate  —  To her campaign, something else is more important.  —  It's the stuff of #Resistance dreams: Kamala Harris, the prosecutor, gets onstage in Philadelphia next Tuesday across from Donald Trump, the felon, and proceeds to brutally expose … ",
    "url": "https://nymag.com/intelligencer/article/abc-debate-kamala-harris-strategy-donald-trump.html"
  },
  {
    "text": "Inside the Trump-Harris Debate Prep: Method Acting, Insults, Tough Questions  —  Kamala Harris is camped out at a Pittsburgh hotel.  Donald Trump is being peppered informally by aides.  Both sides share the same belief about why the debate is so crucial.  —  Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2024/09/07/us/politics/trump-harris-debate-prep.html"
  },
  {
    "text": "Pro-Trump Media Firm Abruptly Folds After Russia Scheme Exposed  —  Tenet Media is no more.  —  The conservative media network folded Thursday night, just one day after the Department of Justice unsealed an indictment accusing it of being funded by Russian state-controlled media, according to Tenet Media field reporter Tayler Hansen.",
    "url": "https://newrepublic.com/post/185686/donald-trump-tenet-media-russia-scheme"
  },
  {
    "text": "YouTubers Are Almost Too Easy to Dupe  —  No wonder Russia finds its useful idiots among the extremely online.  —  Perhaps the most accurate cliché is that if a deal appears too good to be true, then it probably is.  —  To wit: If a “private investor” of unknown origin approaches … ",
    "url": "https://www.theatlantic.com/technology/archive/2024/09/tenet-media-indictment/679743/?gift=bQgJMMVzeo8RHHcE1_KM0VphL_8ZeL3_E3Ounhk8H3s&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Former Vice President Dick Cheney will vote for Harris, his daughter Liz Cheney says  —  The younger Cheney, one of former President Donald Trump's most prominent conservative critics, also said she was supporting Democratic Rep. Colin Allred for Senate in Texas.",
    "url": "https://www.nbcnews.com/politics/2024-election/dick-cheney-kamala-harris-liz-cheney-rcna169979"
  },
  {
    "text": "Trump's incomprehensible child care comments appear to have broken a dam  —  In a “30 Rock” episode called “Governor Dunston,” the writing staff of the fictional sketch comedy show is confronted with a conundrum: The newly tapped Republican vice presidential candidate looks exactly … ",
    "url": "https://www.sfchronicle.com/politics/article/donald-trump-childcare-comments-19747778.php"
  },
  {
    "text": "Trump's New E. Jean Carroll Defense Is That He Assaulted Other Women  —  Donald Trump on Friday inexplicably started detailing two horrific sexual assault allegations made against him, as part of a hapless attempt to discredit a completely different sexual assault allegation.",
    "url": "https://newrepublic.com/post/185680/donald-trump-new-e-jean-carroll-defense-assaulted-women"
  },
  {
    "text": "Pakistani National Charged for Plotting Terrorist Attack in New York City in Support of ISIS  —  For Immediate Release  —  Muhammad Shahzeb Khan, also known as Shazeb Jadoon, Attempted to Enter the United States to Carry Out a Mass Shooting at a Jewish Center in New York City  —  Note: View the complaint here.",
    "url": "https://www.justice.gov/opa/pr/pakistani-national-charged-plotting-terrorist-attack-new-york-city-support-isis-0"
  },
  {
    "text": "Man Plotted to Kill Jews in New York on Oct. 7 Anniversary, U.S. Says  —  A 20-year-old Pakistani citizen was arrested in Canada after plotting to carry out a mass shooting at a Jewish center in New York, according to the Justice Department.  —  A Pakistani citizen was arrested in Quebec … ",
    "url": "https://www.nytimes.com/2024/09/06/us/politics/new-york-terror-plot-jewish-center-isis.html"
  },
  {
    "text": "DNC to fly banners about Trump-Vance ticket, “Project 2025” over battleground state football games  —  Spectators at the University of Michigan football game against Texas on Saturday will be reminded of a different rival before the game: Ohio State.  —  At the Big House in Ann Arbor … ",
    "url": "https://www.cbsnews.com/news/dnc-banners-trump-vance-ticket-project-2025-over-battleground-state-football-games/"
  },
  {
    "text": "DeSantis' election police questioned people who signed abortion petitions  —  Two residents of Lee County said they were questioned at their homes about the validity of petition signatures.  —  Isaac Menasche remembers being at the Cape Coral farmer's market last year when someone asked … ",
    "url": "https://www.tampabay.com/news/florida-politics/elections/2024/09/06/florida-abortion-amendment-petition-signature-fraud-voters/"
  },
  {
    "text": "California state senator's former staffer sues lawmaker for alleged sexual harassment  —  Sen. Marie Alvarado-Gil recently changed her party registration from Democrat to Republican.  —  SACRAMENTO, California — State Sen. Marie Alvarado-Gil's former chief of staff has sued … ",
    "url": "https://www.politico.com/news/2024/09/06/california-sexual-harassment-discrimination-00177846"
  },
  {
    "text": "Donald Trump gets the ‘inside straight’ he's been hoping for in court  —  The former president has had remarkable success with his strategy of delays, but a legal reckoning looms if he loses the election.  —  Donald Trump has pulled it off.  —  Voters will go to the polls … ",
    "url": "https://www.politico.com/news/2024/09/06/trump-court-delay-strategy-00177810"
  },
  {
    "text": "IRS joins investigation into NYPD's nightclub enforcement practices, commissioner's phone seized  —  The NYPD investigation is one of three News 4 learned are underway connected to top city officials  —  The Internal Revenue Service's Criminal Investigation division has joined … ",
    "url": "https://www.nbcnewyork.com/news/local/irs-joins-federal-investigation-into-nypd-nightclub-enforcement-practices-edward-caban/5771174/"
  },
  {
    "text": "Person infected with bird flu in Missouri had no contact with animals  —  The case adds to growing anxiety about the risk of the H5 virus spreading among humans.  —  A person in Missouri has been infected with bird flu, the Centers for Disease Control and Prevention said Friday.",
    "url": "https://www.nbcnews.com/health/health-news/person-infected-bird-flu-missouri-no-contact-animals-know-rcna170010"
  },
  {
    "text": "Tucker Carlson blasted for interview with Holocaust revisionist  —  Conservative commentator Tucker Carlson is facing criticism after hosting a Holocaust revisionist on his podcast.  —  Carlson, a former Fox News pundit, now hosts a show, “The Tucker Carlson Show,” on the social media platform X. Earlier … ",
    "url": "https://thehill.com/homenews/media/4866301-tucker-carlson-interview-holocaust-revisionist/"
  },
  {
    "text": "Dick Cheney will back Kamala Harris, his daughter says  —  CHEYENNE, Wyo. (AP) — Former Vice President Dick Cheney, a lifelong Republican, will vote for Kamala Harris for president, his daughter Liz Cheney said Friday.  —  Liz Cheney, who herself endorsed Harris on Thursday … ",
    "url": "https://apnews.com/article/liz-dick-cheney-kamala-harris-trump-tim-walz-texas-tribune-festival-17304eb4f0c3faeabbc37c5da4b6bf51"
  },
  {
    "text": "American citizen killed in West Bank anti-settler protest  —  RAMALLAH, West Bank − A dual U.S.-Turkish citizen taking part in a protest against settlement expansion in the Israeli-occupied West Bank died of her wounds on Friday after being shot in the head by Israeli troops, the official Palestinian news agency WAFA reported.",
    "url": "https://www.usatoday.com/story/news/world/israel-hamas/2024/09/06/american-killed-west-bank-protest/75103020007/"
  },
  {
    "text": "N.Y.P.D. Ousts 2 Reporters From Headquarters in Escalation of Tensions  —  The actions taken against the reporters, from The New York Post and The New York Times, came after federal agents seized the phone of New York City's police commissioner.  —  Two reporters who cover the New York Police Department … ",
    "url": "https://www.nytimes.com/2024/09/06/nyregion/nypd-reporters-adams.html?unlocked_article_code=1.Ik4.M7Xe.es51fx8c-_Gu&smid=url-share"
  }
]