[
  {
    "text": "What is Rudy Giuliani's net worth in 2023?  Here's a look into his assets amid defamation trial.  —  Rudy Giuliani followed his time in public service with a lucrative career in the private sector that turned him into a multimillionaire.  But the former New York mayor now faces legal damages … ",
    "url": "https://www.cbsnews.com/news/rudy-giuliani-net-worth/"
  },
  {
    "text": "Jury Orders Giuliani to Pay $148 Million to Election Workers He Defamed  —  Ruby Freeman and Shaye Moss, wrongfully accused by Rudolph W. Giuliani of having tried to steal votes from Donald J. Trump in Georgia, were awarded the damages by a federal court in Washington.",
    "url": "https://www.nytimes.com/2023/12/15/us/politics/rudy-giuliani-defamation-trial-damages.html"
  },
  {
    "text": "Rudy Giuliani must pay $148 million to 2 Georgia election workers he defamed, jury decides  —  Washington — A federal jury on Friday ordered former New York City Mayor Rudy Giuliani to pay a total of $148 million to two former Georgia election workers who were at the center of baseless claims … ",
    "url": "https://www.cbsnews.com/news/rudy-giuliani-verdict-defamation-trial-georgia-election-workers/"
  },
  {
    "text": "Rudy Giuliani ordered to pay $148M to Georgia poll workers  —  Rudy Giuliani must pay two Georgia poll workers who sued him for defamation $148 million after he falsely accused them of helping to steal the 2020 presidential election from Donald Trump.  Show more  —  Live coverage contributors 8",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/12/15/giuliani-defamation-trial-verdict-georgia-election-workers/"
  },
  {
    "text": "Why a Trump conviction might not save Biden's reelection  —  Pollsters have already started to explore what effect, if any, a criminal conviction before the election would have on Trump's support.  —  It's the go-to refrain for Democrats watching Joe Biden fall behind Donald Trump in polls: Just wait until Trump is convicted.",
    "url": "https://www.politico.com/news/2023/12/16/why-a-trump-conviction-might-not-save-bidens-reelection-00132125"
  },
  {
    "text": "Biden prides himself on being pro-labor.  But one union that backed him early in 2020 remains on the sidelines this time.  —  The firefighters union was the first to support Biden last time he ran, but so far hasn't waded into this contest.  Some leaders say that is because Trump is more popular among members.",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-firefighters-union-rcna129571?taid=657d83327bf49b0001e638a0"
  },
  {
    "text": "McCarthy mentee Vince Fong determined ineligible for congressional candidacy  —  California Assemblyman Vince Fong (R) isn't eligible to run for Congress in 2024, the state Secretary of State determined Friday, throwing Rep. Kevin McCarthy's (R-Calif.) succession into question.",
    "url": "https://thehill.com/homenews/house/4363558-mccarthy-mentee-vince-fong-ineligible-for-congress/"
  },
  {
    "text": "EXCLUSIVE: Senate Staffer Caught Filming Gay Sex Tape In Senate Hearing Room (GRAPHIC)  —  Leaked amateur pornography shows a congressional staffer having anal sex with an unknown man in the Senate hearing room, video obtained by the Daily Caller shows.  —  The alleged staffer can also be seen … ",
    "url": "https://dailycaller.com/2023/12/15/staffer-caught-filming-sex-tape-senate-hearing-room/"
  },
  {
    "text": "Florida Sex Scandal Shakes Moms for Liberty, as Group's Influence Wanes  —  The conservative group led the charge on the Covid-era education battles.  But scandals and losses are threatening its power.  —  Moms for Liberty, a national right-wing advocacy group, was born in Florida as a response … ",
    "url": "https://www.nytimes.com/2023/12/16/us/politics/moms-for-liberty-sex-scandal.html"
  },
  {
    "text": "Watchdog groups push for disbarment of ex-Trump attorney Jenna Ellis over Georgia charges  —  Watchdog groups called for former Trump attorney Jenna Ellis's disbarment in a letter Friday.  —  “We, together with the additional signatories below, write to urge the Office of Attorney Regulation Counsel … ",
    "url": "https://thehill.com/regulation/court-battles/4363534-watchdog-groups-push-disbarment-ellis-over-georgia-charges/"
  },
  {
    "text": "‘The venom of our age’: James Carville on the danger of Mike Johnson's Christian nationalism  —  The veteran Democratic strategist discusses the ‘hypocrisy’ of his fellow Louisianan and the solace found in his own Catholic faith  —  As hard-right movements rattle or control European governments … ",
    "url": "https://www.theguardian.com/us-news/2023/dec/16/james-carville-mike-johnson-christian-nationalism"
  },
  {
    "text": "House GOP reeling after a top recruit blasts Trump on tape  —  In a must-win Ohio race, one Republican candidate is facing allegations of stolen valor — and now another is inviting the former president's wrath by bashing him.  —  House Republicans are scrambling to fix … ",
    "url": "https://www.politico.com/news/2023/12/15/house-gop-trump-ohio-00131833"
  },
  {
    "text": "Senators Hold Up 43 Biden Diplomatic Nominees as Crises Roil World  —  The State Department says the monthslong blockade has damaged U.S. national security.  Several Republican senators have objected to advancing the slate of nominees.  —  The Biden administration has 43 presidential … ",
    "url": "https://www.nytimes.com/2023/12/15/us/politics/senate-state-nominees-diplomats-republicans.html"
  },
  {
    "text": "10 IEDs found at US-Mexico border in cartel gunfight  —  CBP is warning its agents to ‘exercise extreme caution’ after the Mexican military seized 10 IEDs at the border  —  U.S. Customs and Border Protection is warning agents to be on the lookout for explosive devices.",
    "url": "https://www.foxbusiness.com/fox-news-us/10-ieds-found-us-mexico-border-cartel-gunfight"
  },
  {
    "text": "Appeals court rules against Alex Jones, upholding $75K fine after missed deposition  —  An appeals court in Connecticut upheld a $75,000 fine against right-wing personality Alex Jones due to him missing a deposition in March of last year Friday.  —  “We agree with the trial court … ",
    "url": "https://thehill.com/regulation/court-battles/4363193-appeals-court-rules-against-alex-jones-after-missed-deposition/"
  }
]