[
  {
    "text": "Republican Randy Fine wins Florida special election for Waltz seat  —  Florida state Sen. Randy Fine (R) has won the special election for Florida's 6th Congressional District on Tuesday, according to Decision Desk HQ, defeating Democrat Josh Weil in what became a closely contested race in the deep-red district.",
    "url": "https://thehill.com/homenews/campaign/5226000-florida-republican-randy-fine-special-election/"
  },
  {
    "text": "Wisconsin Supreme Court Election Results  —  ‹ See all Wisconsin state results  —  Wisconsin voters will choose a new State Supreme Court justice in an election that will determine whether liberals retain a 4-to-3 majority or whether conservatives take control of the state's judiciary.",
    "url": "https://www.nytimes.com/interactive/2025/04/01/us/elections/results-wisconsin-supreme-court.html"
  },
  {
    "text": "Susan Crawford wins Wisconsin Supreme Court race, defying Elon Musk  —  Liberals will maintain their narrow majority on the court after Crawford's victory in the first battleground state election of Trump's second term.  —  Susan Crawford has won a seat on the Wisconsin Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/elections/wisconsin-supreme-court-election-results-rcna198353"
  },
  {
    "text": "Waltz and staff used Gmail for government communications, officials say  —  Trump's national security adviser is trying to manage his way out of a crisis.  But new revelations about his team's operational security are piling up in the inbox.  —  Just now  —  Members of President Donald … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/01/waltz-national-security-council-signal-gmail/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzNDgwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0ODYyMzk5LCJpYXQiOjE3NDM0ODAwMDAsImp0aSI6ImNjNmE3ZmYzLTViMWYtNDdjZi05YTcwLTJlZTdjY2YxOGE1YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzAxL3dhbHR6LW5hdGlvbmFsLXNlY3VyaXR5LWNvdW5jaWwtc2lnbmFsLWdtYWlsLyJ9.B_oXWbANc-R7inHV48C9AqkmVIA-41Ip1IVrDyYc60Y&itid=gfta"
  },
  {
    "text": "Adam Schiff places hold on Ed Martin's nomination to be D.C. U.S. attorney  —  President Trump's controversial choice to be the top federal prosecutor in Washington, D.C., Ed Martin, faces an uncertain future, as a Senate Democrat plans to put an indefinite hold on his nomination.",
    "url": "https://www.cbsnews.com/news/trump-nominee-u-s-attorney-in-d-c-ed-martin-blocked-adam-schiff/"
  },
  {
    "text": "Trump-Allied Prosecutor Looks to Undermine Biden Pardons  —  In an unorthodox move, Ed Martin, the interim U.S. attorney in Washington, is questioning former President Joseph R. Biden Jr.'s family and former White House officials about clemency.  —  Ed Martin, the ardent Trump loyalist serving … ",
    "url": "https://www.nytimes.com/2025/04/01/us/politics/trump-prosecutor-biden-pardons.html"
  },
  {
    "text": "White House studying cost of Greenland takeover, long in Trump's sights  —  It's the most concrete effort yet to turn President Donald Trump's desire to acquire the Danish territory into actionable policy, despite widespread international outrage.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/04/01/trump-greenland-us-territory-cost/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzNDgwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0ODYyMzk5LCJpYXQiOjE3NDM0ODAwMDAsImp0aSI6ImQxYjNkZDNjLWJiMmUtNDQ3OS05NGQ3LWQ2NTc0NmJmMDUyYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzAxL3RydW1wLWdyZWVubGFuZC11cy10ZXJyaXRvcnktY29zdC8ifQ.M7TA8wbOhnY6VNyZaznyQhC280Sua5mj0VvQh_NlDZo&itid=gfta"
  },
  {
    "text": "Cory Booker Just Gave The Longest Speech In The History of The US Senate  —  Only two men have spoken on the floor of the U.S. Senate for more than 24 straight hours.  One of them fought to keep Black people out of public life, the other was a Black leader who staged a landmark protest.",
    "url": "https://talkingpointsmemo.com/news/cory-booker-just-gave-the-longest-speech-in-the-history-of-the-us-senate"
  },
  {
    "text": "Booker's speech tops 350M likes on TikTok live  —  More than 350 million people liked Sen. Cory Booker's (D-N.J.) floor speech on TikTok live, as the senator approached 25 hours of holding the floor in the Senate chamber.  —  By 7:07 p.m. EDT on Tuesday — just over 24 hours after Booker began … ",
    "url": "https://thehill.com/homenews/senate/5226903-bookers-speech-tops-350-million-likes-on-tiktok-live/"
  },
  {
    "text": "Val Kilmer, Film Star Who Played Batman and Jim Morrison, Dies at 65  —  A wide-ranging leading man who earned critical praise, he was known to be charismatic but unpredictable.  At one point he dropped out of Hollywood for a decade.  —  Val Kilmer, a homegrown Hollywood actor … ",
    "url": "https://www.nytimes.com/2025/04/01/movies/val-kilmer-dead.html?unlocked_article_code=1.8k4.kU71.-KagT79moRR2&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Costa Rican former President Oscar Arias says US revoked his visa  —  Former Costa Rican President and Nobel Prize winner Oscar Arias said on Tuesday that the U.S. had revoked his visa to enter the country, weeks after he criticized U.S. President Donald Trump on social media saying he was behaving like “a Roman emperor.”",
    "url": "https://www.reuters.com/world/americas/costa-rican-former-president-oscar-arias-says-us-revoked-his-visa-2025-04-01/"
  },
  {
    "text": "Entire staff responsible for utility assistance included in HHS cuts, sources say  —  Those who work closely with the Low Income Home Energy Assistance Program now fear for its future.  —  The Trump administration on Tuesday eliminated the entire staff of a federal program … ",
    "url": "https://www.nbcnews.com/business/business-news/trump-admin-fires-staff-liheap-agency-utilities-assistance-program-rcna199177"
  },
  {
    "text": "The Lawlessness Is the Point  —  If JD Vance were capable of shame, he'd be embarrassed by what just happened.  After the news broke that President Trump's administration admitted to deporting a Maryland man in “error,” Vance lashed out at podcaster Jon Favreau, who had asked him to comment on what had transpired.",
    "url": "https://newrepublic.com/article/193442/trump-deportation-mistake-el-salvador"
  },
  {
    "text": "Trump to escalate global trade tensions with new reciprocal tariffs on US trading partners  —  U.S. President Donald Trump was poised to impose sweeping new reciprocal tariffs on global trading partners on Wednesday, upending decades of rules-based trade, threatening cost increases and likely drawing retaliation from all sides.",
    "url": "https://www.reuters.com/world/us/trump-escalate-global-trade-tensions-with-new-reciprocal-tariffs-us-trading-2025-04-02/"
  },
  {
    "text": "Bice: Elon Musk group removes video from $1M winner after she says she got money to ‘vote’  — Elon Musk's super PAC replaced a video featuring a $1 million giveaway winner who said she got the money, in part, to vote.  — Experts suggest that offering money in exchange for voting … ",
    "url": "https://www.jsonline.com/story/news/politics/elections/2025/04/01/elon-musk-group-removes-video-of-1m-winner-under-bribery-concerns/82766242007/"
  },
  {
    "text": "Some Conservative Voices Raise Alarm Over Trump's Immigration Tactics  —  The cracks in support show how seriously some conservatives are taking the administration's aggressive and at times slapdash tactics.  —  Influential figures on the right have largely cheered on the opening months of the Trump presidency.",
    "url": "https://www.nytimes.com/2025/04/01/us/politics/trump-immigration-joe-rogan-conservatives.html"
  },
  {
    "text": "‘One of the darkest days’: NIH purges agency leadership amid mass layoffs … - Max Kozlov  —  You can also search for this author in  —  PubMed Google Scholar  —  On health economist Jay Bhattacharya's first day as head of the US National Institutes of Health (NIH) … ",
    "url": "https://www.nature.com/articles/d41586-025-01016-z"
  },
  {
    "text": "Johnson Fails to Kill Bipartisan Measure to Allow Proxy Voting for New Parents  —  The speaker tried to use an unprecedented parliamentary maneuver to deny a bipartisan majority the chance to hold a vote on their proposal to allow new parents to vote remotely in the House.",
    "url": "https://www.nytimes.com/2025/04/01/us/politics/house-proxy-voting-parents-mike-johnson.html"
  },
  {
    "text": "Trump Is Asking the Supreme Court To Let Him Have Black Sites  —  The Trump administration inadvertently revealed on Monday that it is attempting to trap Venezuelan migrants in a catch-22 that would effectively block them from challenging their deportation and detention in an El Salvador prison.",
    "url": "https://slate.com/news-and-politics/2025/04/trump-administration-cecot-black-site-el-salvador.html"
  },
  {
    "text": "Doctor Behind Award-Winning Parkinson's Research Among Scientists Purged From NIH  —  Leading scientists at the National Institutes of Health, the US's leading medical research agency, were swept up Tuesday in the Trump administration's latest firing blitz.  —  Several top scientists charged … ",
    "url": "https://www.wired.com/story/doctor-breakthrough-parkinsons-research-nih-purge/"
  },
  {
    "text": "Elon Musk's disclosure of planned Social Security fraud arrest troubles top law enforcement officials: Sources  —  Musk seemed to boast of advance knowledge of the arrest during a tele-rally.  —  Elon Musk attends the Division 1 Men's Wrestling Championship in Philadelphia, Mar. 22, 2025.",
    "url": "https://abcnews.go.com/US/elon-musks-disclosure-planned-social-security-fraud-arrest/story?id=120379202"
  },
  {
    "text": "Dozens of free measles vaccine clinics close in Texas as federal funding is cut  —  Many clinics had been planned at schools in the Dallas area with low vaccination rates.  —  Steep federal funding cuts have forced public health officials in one of Texas' most populous counties — Dallas … ",
    "url": "https://www.nbcnews.com/health/health-news/texas-measles-outbreak-dallas-vaccines-hhs-funding-cuts-rcna199144"
  },
  {
    "text": "Planned Parenthood Is Latest Target in Trump's Washington  —  Legal, political and financial threats pressure the abortion-rights juggernaut  —  Planned Parenthood is closing clinics and facing more financial strains as Republican control of Washington opens new avenues for weakening the abortion provider.",
    "url": "https://www.wsj.com/politics/policy/planned-parenthood-abortion-trump-supreme-court-a0c54920"
  },
  {
    "text": "Columbia Campus Occupation Could Have Ended Without Police, Report Says  —  A university senate review concludes that some demonstrators who occupied Hamilton Hall were willing to leave voluntarily.  —  Columbia University's move to use police force to clear demonstrators from a campus building … ",
    "url": "https://www.nytimes.com/2025/04/01/nyregion/columbia-protests-police.html"
  },
  {
    "text": "The dirty little secret of universities everywhere  —  The students don't have any significant voice in the management of the university, oh heck no. It's definitely not the faculty, either — they are allowed to contribute to strictly defined internal academic domains, but that's it.",
    "url": "https://freethoughtblogs.com/pharyngula/2025/04/01/the-dirty-little-secret-of-universities-everywhere/"
  },
  {
    "text": "He Got Clemency From Trump.  Now He's Facing Charges of Injuring a Child.  —  Jonathan Braun, who has had a string of legal issues since President Trump commuted his drug sentence four years ago, was arrested after allegedly punching an acquaintance and shoving a 3-year-old.",
    "url": "https://www.nytimes.com/2025/04/01/us/politics/jonathan-braun-trump-pardons-arrests.html"
  }
]