[
  {
    "text": "Trump Draft Executive Order Would Create Board to Purge Generals  —  The panel could upend the military review process and raise concerns about the politicization of the military  —  WASHINGTON—The Trump transition team is considering a draft executive order that establishes a “warrior board” … ",
    "url": "https://www.wsj.com/politics/national-security/trump-draft-executive-order-would-create-board-to-purge-generals-7ebaa606?st=Phr48B&reflink=article_copyURL_share"
  },
  {
    "text": "Donald Trump names former intelligence chief John Ratcliffe to CIA director  —  WASHINGTON − President-elect Donald Trump designated his former Director of National Intelligence John Ratcliffe, to become director of the Central Intelligence Agency.  —  Prior to being appointed by Trump … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/11/12/trump-john-ratcliffe-cia-transition/76201901007/"
  },
  {
    "text": "Trump picks Fox News host Pete Hegseth to serve as secretary of defense  —  President-elect Donald Trump announced Tuesday he has chosen Fox News host Pete Hegseth to serve as his secretary of defense.  —  The selection elevates the television personality to a Cabinet-level position in Trump's second term.",
    "url": "https://www.cnn.com/2024/11/12/politics/pete-hegseth-secretary-of-defense/"
  },
  {
    "text": "Trump nominates Pete Hegseth to serve as defense secretary  —  Hegseth served in the US Army and did tours in Guantanamo Bay, Iraq and Afghanistan  —  Pete Hegseth has been selected by President-elect Trump to serve as his secretary of defense.  —  “I am honored to announce … ",
    "url": "https://www.foxnews.com/politics/trump-nominates-pete-hegseth-serve-defense-secretary"
  },
  {
    "text": "Trump Picks Pete Hegseth, a Veteran and Fox News Host, for Defense Secretary  —  The choice of Mr. Hegseth, a dedicated supporter of the president-elect in his first term, was outside the norm of the traditional choice for the post.  —  President-elect Donald J. Trump chose Pete Hegseth … ",
    "url": "https://www.nytimes.com/2024/11/12/us/politics/pete-hegseth-defense-secretary-trump.html"
  },
  {
    "text": "‘Who the f—k is this guy?’:  Defense world reacts to Trump's surprise Pentagon pick  —  “Hegseth is undoubtedly the least qualified nominee for SecDef in American history,” one veterans' advocate said.  —  President-elect Donald Trump's Tuesday night surprise pick of a conservative commentator … ",
    "url": "https://www.politico.com/news/2024/11/12/defense-world-reacts-to-trump-pick-pete-hegseth-00189221"
  },
  {
    "text": "Conservatives plot challenge against Johnson in internal Speaker elections  —  Hardline conservatives are plotting to challenge Speaker Mike Johnson (R-La.) for the gavel during Wednesday's internal House GOP elections, four sources familiar with the matter told The Hill.",
    "url": "https://thehill.com/homenews/house/4986503-gop-conservatives-challenge-speaker-johnson/"
  },
  {
    "text": "Trump announces Elon Musk, Vivek Ramaswamy to lead new ‘Department of Government Efficiency’  —  President-elect Donald Trump continued to fill his administration at breakneck speed Tuesday night, tapping SpaceX and Tesla CEO Elon Musk and biotech entrepreneur Vivek Ramaswamy to head up a new “Department of Government Efficiency.”",
    "url": "https://nypost.com/2024/11/12/us-news/trump-announces-elon-musk-vivek-ramaswamy-to-lead-new-department-of-government-efficiency/"
  },
  {
    "text": "Putin Aide Issues Ominous Warning About Trump's New “Obligations” … Donald Trump may have secured a second term in the White House, but his Russia problems are far from over—at least according to suspiciously phrased comments by some of Russian President Vladimir Putin's closest allies.",
    "url": "https://newrepublic.com/post/188284/vladimir-putin-donald-trump-election-obligations"
  },
  {
    "text": "It's 2004 all over again  —  I wish I could give you a crystal-clear sense of what Democrats felt like in 2004 after George W. Bush was elected to a second term.  But the truth is, my memories of that time are hazy.  That's partly because I was a twentysomething doing dumb twentysomething things … ",
    "url": "https://www.natesilver.net/p/its-2004-all-over-again"
  },
  {
    "text": "Pentagon secrets leaker Jack Teixeira sentenced to 15 years in prison by a federal judge  —  A federal judge on Tuesday sentenced a Massachusetts Air National Guard member to 15 years in prison after he pleaded guilty to leaking highly classified military documents about the war in Ukraine.",
    "url": "https://apnews.com/article/jack-teixeira-pentagon-leak-sentence-e67e18f310101b2f1c894ca1b550a3eb"
  },
  {
    "text": "Robert F. Kennedy Jr. Reveals Plans to Fire 600 Federal Health Workers  —  The Trump ally and anti-vax conspiracist takes aim at the agencies he loathes.  —  At an event late last week in Arizona, anti-vaccine activist and Donald Trump transition team member Robert F. Kennedy Jr. said he'd fire … ",
    "url": "https://www.motherjones.com/politics/2024/11/robert-f-kennedy-jr-national-institutes-of-health/"
  },
  {
    "text": "Mike Huckabee, Trump's pick for ambassador to Israel, has long called himself a Zionist  —  Former Arkansas Gov. Mike Huckabee, President-elect Donald Trump's pick to be ambassador to Israel, has long rejected a Palestinian state in territory previously seized by Israel and has repeatedly signaled … ",
    "url": "https://apnews.com/article/trump-huckabee-ambassador-israel-ace1894ce731c36622d5f09982a0a9b2"
  },
  {
    "text": "Exxon Chief to Trump: Don't Withdraw From Paris Climate Deal  —  Darren Woods was one of only a few Western oil executives attending a global climate conference in Baku, Azerbaijan.  —  Darren Woods, the chief executive of Exxon Mobil, cautioned President-elect Donald J. Trump on Tuesday … ",
    "url": "https://www.nytimes.com/2024/11/12/business/energy-environment/exxon-mobil-baku-climate-cop29.html"
  },
  {
    "text": "‘Your Body, My Choice’ Posts Are Spreading Post-Election.  Anyone Who Says This Should Be Fired—Immediately  —  Women at work deserve respect.  Nick Fuentes's followers are not offering that respect and should not be working in your offices.  —  Last week, Nick Fuentes, who Wikipedia describes as … ",
    "url": "https://www.inc.com/suzanne-lucas/your-body-my-choice-posts-are-spreading-post-election-anyone-who-says-this-should-be-fired-immediately/91016921"
  },
  {
    "text": "They Turned Against Kamala Harris in Decisive Numbers.  They're About to Find Out if It Was Worth It.  —  Dearborn, Michigan, turned against Kamala Harris decisively.  Now the city is about to find out if Trump was worth it.  —  On election night, at a political watch party, Abbas Alawieh … ",
    "url": "https://slate.com/news-and-politics/2024/11/election-results-2024-trump-harris-michigan-muslim.html"
  },
  {
    "text": "Trump's Cabinet moves hand Ron DeSantis a gift — but possibly with strings attached  —  Florida Gov. Ron DeSantis may get to appoint a Senate replacement for Marco Rubio.  But he'd need to balance the preferences of Trump and allies with his own wishes.  —  TALLAHASSEE, Fla. … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trumps-cabinet-moves-hand-ron-desantis-gift-possibly-strings-attached-rcna179714"
  },
  {
    "text": "Incoming Trump admin is eyeing new immigrant detention centers near major U.S. cities  —  The plan would also include restarting the policy of detaining parents with their children, known as family detention, which immigration advocates have criticized.  —  The incoming Trump administration … ",
    "url": "https://www.nbcnews.com/politics/immigration/incoming-trump-admin-eyeing-new-immigrant-detention-centers-major-us-c-rcna179843"
  },
  {
    "text": "Judge in Arizona election case against Trump allies steps aside after accusations of anti-Trump bias  —  In emails to colleagues, Maricopa County Judge Bruce Cohen defended Kamala Harris and invoked resistance to Nazis.  —  The judge overseeing the criminal case in Arizona … ",
    "url": "https://www.politico.com/news/2024/11/12/arizona-judge-trump-case-bias-00189054"
  },
  {
    "text": "Scoop: Alina Habba Emerges as Front-Runner For Trump Press Secretary  —  Alina Habba, a lawyer who represented Donald Trump in a series of high-profile cases, has emerged as a front-runner to serve as press secretary in the incoming White House, four sources told Mediaite.",
    "url": "https://www.mediaite.com/trump/scoop-alina-habba-emerges-as-front-runner-for-trump-press-secretary/"
  },
  {
    "text": "Putin Isn't Fighting for Land in Ukraine  —  And Biden has mere weeks to give the Ukrainians the resources they need to fight.  —  russian drone and missile strikes on Ukrainian targets have increased in frequency in the week since the U.S. election, killing civilians and destroying another dam.",
    "url": "https://www.theatlantic.com/international/archive/2024/11/biden-trump-ukraine/680632/?gift=hVZeG3M9DnxL4CekrWGK3-1_K7E1RdOWOBSJN46wpFA&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  }
]