[
  {
    "text": "Matt Gaetz ethics report says his drug use and sex with a minor violated state laws  —  Former Rep. Matt Gaetz, a Florida Republican who briefly stood to become President-elect Donald Trump's nominee to be attorney general, was found by congressional ethics investigators to have paid numerous women … ",
    "url": "https://www.cbsnews.com/news/matt-gaetz-ethics-report-released/"
  },
  {
    "text": "House Ethics report finds evidence Matt Gaetz paid thousands for sex and drugs including paying a 17-year-old for sex in 2017  —  The House Ethics Committee found evidence that former Rep. Matt Gaetz paid tens of thousands of dollars to women for sex or drugs on at least 20 occasions … ",
    "url": "https://www.cnn.com/2024/12/23/politics/matt-gaetz-house-ethics-report"
  },
  {
    "text": "Statement of the Committee on Ethics Regarding Representative Matt Gaetz  —  On December 23, 2024, the Committee on Ethics (Committee) released the attached Report regarding allegations relating to Representative Matt Gaetz.  —  The Committee previously noted that there has been a significant … ",
    "url": "https://ethics.house.gov/press-releases/statement-of-the-committee-on-ethics-regarding-representative-matt-gaetz-2/"
  },
  {
    "text": "Ethics report alleges Gaetz paid 17-year-old for sex  —  Investigators also said the Florida Republican solicited prostitutes, used illegal drugs, took improper gifts and tried to obstruct their probe.  —  A yearslong House Ethics Committee investigation into former Rep. Matt Gaetz found … ",
    "url": "https://www.politico.com/news/2024/12/23/matt-gaetz-ethics-report-findings-00195875"
  },
  {
    "text": "Former Rep. Matt Gaetz seeks restraining order to halt release of House Ethics report  —  The committee was expected to soon release the report about the former GOP lawmaker.  —  WASHINGTON — Former Rep. Matt Gaetz, R-Fla., sought a restraining order Monday against the House Ethics Committee … ",
    "url": "https://www.nbcnews.com/politics/congress/former-rep-matt-gaetz-seeks-restraining-order-halt-release-house-ethic-rcna185209"
  },
  {
    "text": "Gaetz sues Ethics Committee in last-minute bid to block release of report  —  Former Rep. Matt Gaetz (R-Fla.) on Monday filed a lawsuit against the House Ethics Committee in a last-minute attempt to block the panel from releasing its report on the Florida Republican.",
    "url": "https://thehill.com/homenews/house/5053397-gaetz-ethics-committee-lawsuit/"
  },
  {
    "text": "Statement from President Joe Biden on Federal Death Row Commutations  —  I've dedicated my career to reducing violent crime and ensuring a fair and effective justice system.  —  Today, I am commuting the sentences of 37 of the 40 individuals on federal death row to life sentences without the possibility of parole.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/23/statement-from-president-joe-biden-on-federal-death-row-commutations/"
  },
  {
    "text": "Biden gives life in prison to 37 of 40 federal death row inmates before Trump can resume executions  —  President Joe Biden announced on Monday that he is commuting the sentences of 37 of the 40 people on federal death row, converting their punishments to life imprisonment just weeks … ",
    "url": "https://apnews.com/article/biden-death-row-commutations-trump-executions-f67b5e04453cd1aa6383c516bc14f300"
  },
  {
    "text": "Biden commutes most federal death row sentences to life in prison before Trump takes office  —  President Joe Biden announced Monday that he is taking 37 people off federal death row to serve out life sentences behind bars — a decision that leaves only three federal prisoners awaiting execution … ",
    "url": "https://www.cnn.com/2024/12/23/politics/biden-federal-death-row-trump"
  },
  {
    "text": "Trump's big Mike Johnson decision  —  A messy Capitol Hill endgame has the president-elect pondering a change in House leadership.  —  After the House passed a shutdown-averting spending bill Friday, a very relieved Speaker Mike Johnson proclaimed to reporters that President-elect Donald Trump was “certainly happy about this outcome.”",
    "url": "https://www.politico.com/news/2024/12/23/mike-johnson-speaker-trump-limbo-00195854"
  },
  {
    "text": "Greenland is not for sale, its leader says in response to Trump  —  Greenland is not for sale, its elected leader said on Monday, responding to comments made by U.S. President-elect Donald Trump regarding the “ownership and control” of the vast Arctic island that has been part of Denmark for over 600 years.",
    "url": "https://www.reuters.com/world/americas/greenland-is-not-sale-its-leader-says-response-trump-2024-12-23/"
  },
  {
    "text": "AmFest: Rob Schneider Helps Out Clueless Dems Who Still Can't Figure Out Why They Lost to Trump  —  Comedian and actor Rob Schneider is no stranger to speaking out about conservative principles; you might even say he has found himself caught up in the modern battle between wokeness … ",
    "url": "https://redstate.com/beccalower/2024/12/22/amfest-rob-schneider-helps-out-clueless-dems-who-cant-figure-out-why-they-lost-to-trump-n2183530"
  },
  {
    "text": "Trump Organization Accused of Tax Evasion in Panama: What We Know  —  has started a quarrel with Panama over the fees it's charging American ships to use the Panama Canal, while the Trump Organization is fighting a court case over taxes in the central American country.  —  What to Know",
    "url": "https://www.newsweek.com/donald-trump-panama-canal-threats-hotel-taxes-court-filing-2005079"
  },
  {
    "text": "Anti-Abortion Officials Continue Deputizing Angry Men To Turn Over Their Partners In New Legal Foray  —  A 20-year-old woman in Collin County, Texas arrives at the emergency room to address severe bleeding.  A health care provider tells the man she's with that the woman had been nine weeks pregnant.",
    "url": "https://talkingpointsmemo.com/news/paxton-abortion-texas"
  },
  {
    "text": "D.C. officer guilty for leaking to Proud Boys' Tarrio before Jan. 6  —  Prosecutors said former intel unit head Shane Lamond helped Tarrio and the Proud Boys stay “one step ahead” of law enforcement in the fateful days before the Capitol riot, a cat-and-mouse game with police.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/12/23/lamond-proud-boys-jan6-verdict/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM0OTMwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM2MzEyMzk5LCJpYXQiOjE3MzQ5MzAwMDAsImp0aSI6ImI2ZTk2YzA3LWJkMzAtNDk1Yy05ZWY4LWIyODg4ZDQ0OGFkMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI0LzEyLzIzL2xhbW9uZC1wcm91ZC1ib3lzLWphbjYtdmVyZGljdC8ifQ.9bWHjK2_2uiiIgJOaXfdxaZltYvBIofnuuclnUAKspc&itid=gfta"
  },
  {
    "text": "The Absurdity of NATO Worrying About Russia  —  I am tired of the “Donald Trump will hand Europe over to Russia” by neglecting or withdrawing from NATO.  —  First of all, Trump is not going to withdraw from NATO unless European Countries keep attacking US interests or fail to meet or exceed their obligations.",
    "url": "https://hotair.com/david-strom/2024/12/23/the-absurdity-of-nato-worrying-about-russia-n3798128"
  }
]