[
  {
    "text": "For 20 Years, I Couldn't Say What Donald Trump Did on the Set of The Apprentice.  Now I Can.  —  For 20 years, I couldn't say what I watched the former president do on the set of the show that changed everything.  Now I can.  —  On Jan. 8, 2004, just more than 20 years ago, the first episode of The Apprentice aired.",
    "url": "https://slate.com/culture/2024/05/donald-trump-news-2024-trial-verdict-apprentice.html"
  },
  {
    "text": "Trump Called ‘Apprentice’ Contestant Kwame Jackson N-Word, Producer Says  —  HIT RECORD  —  Bill Pruitt also claims there are tapes to prove it.  —  At the end of the first season of his reality TV show The Apprentice, Donald Trump's choice of a winner was a matter of black and white.",
    "url": "https://www.thedailybeast.com/trump-called-apprentice-contestant-kwame-jackson-n-word-producer"
  },
  {
    "text": "False right-wing reports about Trump trial jury instructions fuel threats against judge  —  False reporting and social media commentary about the jury instructions in Trump's hush money trial has spurred calls for the assassination of the judge overseeing the case.",
    "url": "https://www.nbcnews.com/politics/donald-trump/false-right-wing-reports-trump-trial-jury-instructions-fuel-threats-ju-rcna154678"
  },
  {
    "text": "Why Donald Trump supporters are complaining about jury instructions in his criminal trial  —  Former President Donald Trump and some of his supporters are complaining that the judge in his hush money criminal trial isn't requiring a unanimous verdict from the jury - but that's not quite right.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/30/trump-jury-instructions-new-york-trial/73904370007/"
  },
  {
    "text": "November's Presidential Election May 2024  —  NPR/PBS NewsHour/Marist National Poll  —  Biden and Trump Locked in Tight Race Nationally...West & Stein, Not RFK, Make Difference in Multi-Candidate Field  —  President Joe Biden and former President Donald Trump are closely matched … ",
    "url": "https://maristpoll.marist.edu/polls/novembers-presidential-election-may-2024/"
  },
  {
    "text": "Biden's problems with younger voters are glaring, poll finds  —  Younger voters have been a crucial voting bloc for Democrats for decades.  —  Voters 18-29 years old made up roughly 1 in 6 voters in 2020, and President Biden won them by more than 20 points, according to exit polls.",
    "url": "https://www.npr.org/2024/05/30/nx-s1-4984972/poll-biden-younger-voters-trump"
  },
  {
    "text": "Sam Alito believes you — and, perhaps, his colleagues — are stupid  —  Alito defiantly refused to recuse himself from January 6 or Trump-related cases in a letter sent to members of Congress on Wednesday.  —  Justice Sam Alito, who is a problem, went even further on Wednesday than I thought … ",
    "url": "https://www.lawdork.com/p/sam-alito-believes-you-and-perhaps"
  },
  {
    "text": "Two more US officials resign over Biden administration's position on Gaza war  —  The officials accuse the administration of not telling the truth about Israel's obstruction of aid to Palestinians in Gaza  —  Two more US officials have resigned over the Gaza war, saying that the Biden administration … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/30/two-more-us-officials-resign-over-biden-administrations-position-on-gaza-war"
  },
  {
    "text": "NRA can sue ex-NY official it says tried to blacklist it after Parkland shooting, Supreme Court says  —  A unanimous Supreme Court on Thursday cleared the way for a National Rifle Association lawsuit against a former New York state official over claims she pressured companies to blacklist … ",
    "url": "https://apnews.com/article/nra-aclu-parkland-shooting-lawsuit-supreme-court-953424f3fd33f279b0cc2ce050069d48"
  },
  {
    "text": "GOP mega-donor Miriam Adelson to fund colossal super PAC for Trump  —  The casino billionaire is planning to back the newly reconstituted Preserve America effort to help the former president.  —  Republican mega-donor and casino billionaire Miriam Adelson plans to help bankroll a massive super PAC … ",
    "url": "https://www.politico.com/news/2024/05/30/miriam-adelson-republican-trump-super-pac-preserve-america-00160660"
  },
  {
    "text": "Biden secretly gave Ukraine permission to strike inside Russia with US weapons  —  It's a major reversal that will help Ukraine to better defend its second-largest city.  —  The Biden administration has quietly given Ukraine permission to strike inside Russia — solely near the area of Kharkiv … ",
    "url": "https://www.politico.com/news/2024/05/30/biden-ukraine-weapons-strike-russia-00160731"
  },
  {
    "text": "Biden's Black voter troubles are setting off alarm bells  —  The message out of battleground states and focus groups is that the president's problems are real — and he is running out of time to fix them.  —  Prominent Black officials are warning the Biden campaign that the president's efforts … ",
    "url": "https://www.politico.com/news/2024/05/30/biden-black-voters-00160520"
  },
  {
    "text": "Why Trump's team thinks he can survive any verdict  —  The former president's advisers and allies plan to situate any outcome within the same grievance narrative he's been cultivating for years.  —  Donald Trump's pollsters have been tracking the impact of his indictments throughout his first trial and … ",
    "url": "https://www.politico.com/news/2024/05/30/trump-verdict-campaign-spin-00160506"
  },
  {
    "text": "Off Leash: Inside the Secret, Global, Far-Right Group Chat  —  In his book In the Garden of Beasts: Love, Terror, and an American Family in Hitler's Berlin, Erik Larson cites a cable sent to the State Department in June 1933 by a U.S. diplomat posted in Germany that provided a far … ",
    "url": "https://newrepublic.com/article/182008/erik-prince-secret-global-group-chat-off-leash"
  },
  {
    "text": "R.I. neo-Nazi member accused of possessing child pornography  —  Stephen Farrea, of Portsmouth, is part of the Nationalist Social Club-131, which targets drag queen story hours  —  PORTSMOUTH, R.I. — A local member of a New England-based neo-Nazi group known for disrupting children's … ",
    "url": "https://www.bostonglobe.com/2024/05/29/metro/warwick-rhode-island-neo-nazi-child-pornography-nsc-131/"
  },
  {
    "text": "Chief Justice John Roberts declines to meet with Democratic lawmakers about ethics flap and Alito's flags  —  Chief Justice John Roberts on Thursday rejected a meeting request from Democratic lawmakers who wanted to discuss two provocative flags hoisted at Justice Samuel Alito's properties.",
    "url": "https://www.cnn.com/2024/05/30/politics/john-roberts-ethics-alito-flag-supreme-court-durbin/"
  },
  {
    "text": "Minnesota GOP's endorsed Senate candidate has faced court actions over unpaid child support  —  Royce White, a former NBA player, won the state Republican Party's endorsement at its convention this month.  —  Royce White, a George Floyd protest leader and former college basketball star … ",
    "url": "https://www.nbcnews.com/politics/2024-election/minnesota-gops-endorsed-senate-candidate-faced-court-actions-unpaid-ch-rcna153100?taid=6658543de860dd0001d037a9"
  },
  {
    "text": "SCOTUS's farcical endorsement of gerrymandering  —  The right-wing majority turned back the clock on efforts to address racial inequality. … Perhaps because he's been busy lying about his wife's visible support for an insurrection, Justice Samuel Alito can't seem to make time to do his job properly.",
    "url": "https://www.publicnotice.co/p/scotus-gerrymandering-south-carolina-alexander"
  },
  {
    "text": "Free IRS online tax filing program coming soon to all states … - Treasury announced earlier this month that more than 140,000 people participated in the Direct File pilot program in a dozen states claiming more than $90 million in refunds.  — The pilot exceeded its 100,000-person target during this past tax season.",
    "url": "https://www.axios.com/2024/05/30/irs-taxes-direct-file-free-program"
  },
  {
    "text": "Trump has touted potential VP picks for months.  He may end up picking someone off the public's radar  —  In recent weeks, an increasingly familiar list of Republicans has dominated the not-very-subtle competition to become Donald Trump's running mate.  Trump himself has added to the air … ",
    "url": "https://www.cnn.com/2024/05/29/politics/trump-vp-dark-horse/"
  }
]