[
  {
    "text": "Johnson aide discouraged Hutchinson subpoena over concerns about lawmakers' ‘sexual texts’  —  The move was intended in part to prevent the release of sexually explicit texts that lawmakers sent Cassidy Hutchinson.",
    "url": "https://www.washingtonpost.com/politics/2025/01/23/cassidy-hutchinson-lawmakers-texts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NjA4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4OTkwNzk5LCJpYXQiOjE3Mzc2MDg0MDAsImp0aSI6Ijc0NWQyMGVmLTIwNDEtNDEyNi1iYjNkLTJkNjM5NmU2ZjMwMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzIzL2Nhc3NpZHktaHV0Y2hpbnNvbi1sYXdtYWtlcnMtdGV4dHMvIn0.7Ls-g5QQAxsT3ZwpfrOAlVcnD6OWWF6dR_ihLvpdR94&itid=gfta"
  },
  {
    "text": "MAYOR RAS J. BARAKA'S STATEMENT ON ICE RAID ON NEWARK BUSINESS ESTABLISHMENT  —  “Today, U.S. Immigration and Customs Enforcement (ICE) agents raided a local establishment in the City of Newark, detaining undocumented residents as well as citizens, without producing a warrant.",
    "url": "https://www.newarknj.gov/news/mayor-ras-j-barakas-statement-on-ice-raid-on-newark-business-establishment"
  },
  {
    "text": "ICE agents arrest hundreds of migrants in sanctuary cities, including New York City  —  N.J. Burkett reports from City Hall with the latest on the ICE raids.  —  NEW YORK CITY (WABC) — Federal law enforcement and ICE agents have arrested over 500 undocumented migrants wanted for outstanding crimes … ",
    "url": "https://abc7ny.com/post/nyc-immigration-ice-agents-arrest-300-migrants-sanctuary-cities-including-couple-new-york-city/15829571/"
  },
  {
    "text": "Trump Officials Move to Quickly Expel Migrants Biden Allowed In Temporarily  —  A memo appears to allow Immigration and Customs Enforcement officers to target programs that let in more than a million people.  —  The Trump administration is giving Immigration and Customs Enforcement officers … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-immigrants-deportation.html?unlocked_article_code=1.rk4.jkfQ.TGWT4A93zYdo&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Hegseth told senator he paid $50,000 to woman who accused him of 2017 sex assault  —  Pete Hegseth, President Donald Trump's nominee for defense secretary, paid $50,000 to the woman who accused him of sexual assault in 2017, according to answers he provided to a senator during his confirmation process … ",
    "url": "https://apnews.com/article/hegseth-sex-assault-payment-trump-6674cc8cfee654c374725948e01ff666"
  },
  {
    "text": "Pete Hegseth's nomination to lead the Pentagon clears a key hurdle in the Senate  —  Senators voted 51-49 to advance Hegseth's defense secretary bid, which has been mired in a series of controversies.  —  WASHINGTON — The Senate on Thursday voted to advance Pete Hegseth's nomination … ",
    "url": "https://www.nbcnews.com/politics/congress/pete-hegseths-nomination-lead-pentagon-clears-key-hurdle-senate-rcna188932"
  },
  {
    "text": "A federal judge temporarily blocks Trump's executive order redefining birthright citizenship  —  A federal judge on Thursday temporarily blocked President Donald Trump's executive order denying U.S. citizenship to the children of parents living in the country illegally, calling it … ",
    "url": "https://apnews.com/article/birthright-citizenship-donald-trump-lawsuit-immigration-9ac27b234c854a68a9b9f8c0d6cd8a1c"
  },
  {
    "text": "Senate confirms John Ratcliffe to be Trump's CIA director  —  Ratcliffe becomes the second Trump nominee to be approved by the Republican-led Senate.  —  WASHINGTON — The Senate voted Thursday to confirm John Ratcliffe as the next CIA director under President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-confirms-john-ratcliffe-trumps-cia-director-rcna188588"
  },
  {
    "text": "Trump staff ‘furious’ after Musk trashes AI project  —  “It's clear he has abused the proximity to the president,” said one ally of the president.  —  Some of President Donald Trump's key aides and allies are furious with Elon Musk for publicly trashing his $500 billion artificial intelligence mega-deal.",
    "url": "https://www.politico.com/news/2025/01/23/trump-staff-musk-conflict-00200311"
  },
  {
    "text": "The AP establishes style guidance on the Gulf of Mexico and Mount McKinley  —  President Donald Trump signed an executive order Monday shortly after his inauguration calling for the Gulf of Mexico to be renamed the Gulf of America, and Denali, the tallest peak in the United States, to revert to the name Mount McKinley.",
    "url": "https://apnews.com/article/ap-style-gulf-mexico-mount-mckinley-denali-13bd46d636cef6f2608bd5d2c3d907ee"
  },
  {
    "text": "Costco shareholders overwhelmingly reject anti-DEI measure … - Costco grabbed headlines over the holidays when its board of directors put out a robust defense of its DEI efforts in response to the anti-DEI proposal.  — The board had voted unanimously to ask shareholders to reject the motion.",
    "url": "https://www.axios.com/2025/01/23/costco-dei-shareholders-reject-anti-diversity-proposal"
  },
  {
    "text": "Rep. Ogles Proposes Amending the 22nd Amendment to Allow Trump to Serve a Third Term  —  WASHINGTON, DC - Congressman Andy Ogles introduced a House Joint Resolution to amend the Constitution of the United States to allow a President to be elected for up to but no more than three terms.",
    "url": "https://ogles.house.gov/media/press-releases/rep-ogles-proposes-amending-22nd-amendment-allow-trump-serve-third-term"
  },
  {
    "text": "Declassification of Records Concerning the Assassinations  —  OF PRESIDENT JOHN F. KENNEDY, SENATOR ROBERT F. KENNEDY, AND THE REVEREND DR. MARTIN LUTHER KING, JR.  —  EXECUTIVE ORDER  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/declassification-of-records-concerning-the-assassinations-of-president-john-f-kenned/"
  },
  {
    "text": "Trump Revokes Security Detail for Pompeo and Others Despite Threats From Iran  —  The officials had been part of an aggressive posture against Iran during President Trump's first term.  —  President Trump revoked security protection for his former secretary of state, Mike Pompeo … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-pompeo-security-iran.html?unlocked_article_code=1.rU4.6oMb.eKfhCujI5hAG&smid=url-share"
  },
  {
    "text": "Trump's White House Press Secretary Reveals Her Failed Campaign Spent $200K in Illicit Contributions  —  On Thursday, Karoline Leavitt's failed congressional campaign amended every FEC filing it had ever made to reveal that she failed to disclose hundreds of thousands of dollars … ",
    "url": "https://www.notus.org/whitehouse/trump-white-house-press-secretary-200k-illicit-contributions"
  },
  {
    "text": "Trump's FCC chair gets to work on punishing TV news stations accused of bias … Federal Communications Commission Chairman Brendan Carr has revived three complaints against broadcast stations accused of bias against President Donald Trump.  —  Outgoing Chairwoman Jessica Rosenworcel … ",
    "url": "https://arstechnica.com/tech-policy/2025/01/trumps-fcc-chair-gets-to-work-on-punishing-news-stations-accused-of-bias/"
  },
  {
    "text": "“Excluding Indians”: Trump admin questions Native Americans' birthright citizenship in court  —  The Trump admin is leaning on a pre-14th Amendment law in its fight to redefine birthright citizenship  —  In the Trump administration's arguments defending his order to suspend birthright citizenship … ",
    "url": "https://www.salon.com/2025/01/23/excluding-indians-admin-questions-native-americans-birthright-citizenship-in/"
  },
  {
    "text": "Hegseth's divorce agreement with his second wife includes a non-disparagement clause  —  Pete and Samantha Hegseth's 2018 divorce decree prohibits each of them from engaging in “any public discourse ... disparaging the other party.”  —  Defense secretary nominee Pete Hegseth testified during … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/pete-hegseth-divorce-confirmation-defense-department-rcna189059"
  },
  {
    "text": "‘The Holocaust is not a joke’: Elon Musk finally goes too far for Anti-Defamation League  —  The Anti-Defamation League took criticism earlier this week when it declined to condemn X owner Elon Musk for making a salute at a Trump rally that many overt racists approvingly interpreted as a Nazi salute.",
    "url": "https://www.rawstory.com/elon-musk-adl/"
  },
  {
    "text": "Mississippi lawmaker introduces ‘Contraception Begins at Erection Act’  —  The bill, which is unlikely to pass, would make it unlawful for “a person to discharge genetic material without the intent to fertilize an embryo.”  —  Mississippi state Sen. Bradford Blackmon, a Democrat … ",
    "url": "https://www.nbcnews.com/politics/politics-news/mississippi-lawmaker-introduces-contraception-begins-erection-act-rcna188938"
  },
  {
    "text": "Rubio instructs staff to freeze passport applications with ‘X’ sex markers  —  Secretary of state tells staff ‘sex is not changeable’ in email following Trump executive order on gender  —  The US state department has frozen all applications for passports with “X” sex markers and changes … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/23/trump-rubio-x-gender-passport"
  },
  {
    "text": "Trump Pardons Anti-Abortion Activists Who Blockaded Clinic  —  The move came ahead of the March for Life, the annual anti-abortion rally in Washington where Vice President JD Vance is expected to address attendees.  —  President Trump signed orders on Thursday granting pardons … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-pardon-abortion-clinic-activists.html"
  },
  {
    "text": "DOGE's Top Lawyer to Depart  —  Bill McGinley, the group's counsel, is planning to return to the private sector  —  The top lawyer at Elon Musk's Department of Government Efficiency is announcing his departure just days after President Trump's return to the White House.",
    "url": "https://www.wsj.com/politics/policy/doges-top-lawyer-to-depart-b3fe71a1?st=jXuXyY&reflink=article_copyURL_share"
  },
  {
    "text": "Trump moves to close Pentagon office focused on curbing civilian deaths  —  Officials are drafting a proposal to defund and potentially ‘disestablish’ the Civilian Protection Center of Excellence, though Congress would have to approve doing so.  —  The Trump administration is moving to abolish … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/23/trump-pentagon-civilian-deaths/"
  },
  {
    "text": "Internet Spams Trump's ‘DEI Truth’ Tip Line With Porn, ‘Simpsons’ Jokes  —  Federal employees were told to report “disguised” Diversity, Equity, Inclusion and Accessibility offices to the email.  The public is... pitching in.  —  A tip line meant to encourage federal employees to rat … ",
    "url": "https://www.huffpost.com/entry/deia-truth-email-spam-campaign_n_67929d77e4b0629837bf0363"
  }
]