[
  {
    "text": "Ruling Against Trump Cuts to the Heart of His Identity  —  The finding by a judge in a New York civil case that Donald Trump committed fraud in valuing his real estate properties undermined the narrative of the business career that launched him in politics.  —  Nearly every aspect … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-fraud-ruling.html"
  },
  {
    "text": "Judge Gives Trump Organization the Corporate Death Penalty  —  Donald Trump is no longer in business.  —  Worse, the self-proclaimed multibillionaire may soon be personally bankrupt as a result, stripped of just about everything because for years he engaged in calculated bank fraud … ",
    "url": "https://www.dcreport.org/2023/09/26/donald-trump-liable-for-fraud/"
  },
  {
    "text": "How much would your house be worth if the Trump Organization owned it?  —  A year offering no shortage of bad news for Donald Trump outdid itself Tuesday afternoon, with New York Supreme Court Justice Arthur Engoron ruling that the former president's namesake business, the Trump Organization … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/trump-property-inflated-values/"
  },
  {
    "text": "McCarthy's new shutdown strategy: Shifting the blame  —  Good morning, Early Birds.  The New York Times's Vanessa Friedman says it's “a cliché” to wear a Patagonia fleece vest in the office if you don't work in outdoor recreation — but it's so cold in The Post's newsroom.  What's a man to do?",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/mccarthys-new-shutdown-strategy-shifting-blame/"
  },
  {
    "text": "McCarthy told conference he won't allow vote on Senate stopgap: GOP lawmakers  —  Speaker Kevin McCarthy (R-Calif.) told members of the House GOP conference Wednesday morning that he will not bring the Senate's bipartisan continuing resolution to the floor for a vote.",
    "url": "https://thehill.com/homenews/house/4225849-mccarthy-told-conference-he-wont-allow-vote-on-senate-stopgap-gop-lawmakers/"
  },
  {
    "text": "Poll: Republicans see Trump as a ‘person of faith’ ... more so than Mitt Romney, Mike Pence and others  —  Sen. Mitt Romney tops the list for independents, while more Democrats say President Biden is a man of faith  —  More than half of Republicans see former President Donald Trump as a person of faith … ",
    "url": "https://www.deseret.com/2023/9/26/23891360/trump-biden-man-of-faith-religious-mitt-romney-vivek-ramaswamy"
  },
  {
    "text": "Biden tops Trump by 5 points in new survey  —  President Biden tops former President Trump by 5 points among registered voters in a 2024 hypothetical matchup, new polling shows.  —  Asked who they'd back if Trump and Biden were their respective party's nominees, 45 percent of registered voters … ",
    "url": "https://thehill.com/homenews/campaign/4225778-biden-tops-trump-by-5-points-in-new-survey/"
  },
  {
    "text": "Jared Kushner pressured Washington Post to fire editor over Russia, book says  —  Marty Baron says Trump's son-in-law leaned on Post publisher to withdraw support of Russia election interference investigation  —  Donald Trump's son-in-law and senior White House adviser, Jared Kushner … ",
    "url": "https://www.theguardian.com/books/2023/sep/27/jared-kushner-editor-washington-post-trump-russia-election-interference-2016"
  },
  {
    "text": "The impeachment inquiry is starting exactly as might have been expected  —  When the Democratic majority in the House held the first public hearing in its 2019 impeachment inquiry targeting President Trump, it heard testimony from members of Trump's administration who could speak to the central allegation … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/comer-biden-impeachment-hearing/"
  },
  {
    "text": "Trump Tries to Court Blue-Collar Workers at a Nonunion Factory  —  A day after President Biden appeared on a union picket line, the former president will speak at an auto parts factory, but it's unclear whether any striking workers will be in the crowd.  —  Former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-autoworkers-detroit.html"
  },
  {
    "text": "At least 20 arrested in night of looting throughout Philly, police say  —  Large crowds — mostly consisting of juveniles — looted multiple stores and damaged property across Philadelphia Tuesday night, police said.  —  It was around 8 p.m. when, officials said, police started receiving calls … ",
    "url": "https://www.nbcphiladelphia.com/news/local/large-crowds-of-juveniles-loot-multiple-stores-in-center-city-police-say/3654732/"
  },
  {
    "text": "President Drink Bleach says what?  Trump now claims he beat George W. Bush and Barack Obama  —  The press should cover his decline anyway  —  Donald Trump is skipping another GOP primary debate this week and the theories abound as to why.  Some paint it as a smart strategy … ",
    "url": "https://www.salon.com/2023/09/27/drink-bleach-says-what-now-claims-he-beat-george-w-bush-and-barack-obama/"
  },
  {
    "text": "US Senator Bob Menendez pleads not guilty to corruption charges  —  U.S. Senator Bob Menendez pleaded not guilty on Wednesday to charges of taking bribes from three New Jersey businessman, as calls for his resignation from his fellow Democrats escalated.  —  Federal prosecutors in Manhattan … ",
    "url": "https://www.reuters.com/world/us/us-senator-bob-menendez-appear-court-calls-resignation-mount-2023-09-27/"
  },
  {
    "text": "Court rulings poised to play pivotal role in battle for Congress  —  The Supreme Court's Alabama decision was just one among a series of redistricting cases expected to influence the balance of power on Capitol Hill  —  The Supreme Court's order Tuesday clearing the way for a second Alabama … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/supreme-court-alabama-redistricting/"
  },
  {
    "text": "Four-Time Congressional Candidate Charged in Long-Running Misuse of Campaign Funds  —  For Immediate Release  —  U.S. Attorney's Office, Central District of California  —  LOS ANGELES - Federal prosecutors today unsealed a grand jury indictment that accuses a Torrance man who was a candidate … ",
    "url": "https://www.justice.gov/usao-cdca/pr/four-time-congressional-candidate-charged-long-running-misuse-campaign-funds"
  },
  {
    "text": "In Rare Alliance, Democrats and Republicans Seek Legal Power to Clear Homeless Camps  —  Dozens of leaders, mostly from Western states, have asked the Supreme Court to overturn lower court decisions that restrict enforcement against public camping.  —  Garbage, feces and needles run through … ",
    "url": "https://www.nytimes.com/2023/09/27/us/in-rare-alliance-democrats-and-republicans-seek-legal-power-to-clear-homeless-camps.html"
  },
  {
    "text": "Musk's X disabled feature for reporting electoral misinformation - researcher  —  Elon Musk's X, formerly called Twitter, disabled a feature that let users report misinformation about elections, a research organisation said on Wednesday, throwing fresh concern about false claims spreading just before major U.S. and Australian votes.",
    "url": "https://www.reuters.com/technology/musks-x-disabled-feature-reporting-electoral-misinformation-researcher-2023-09-27/"
  },
  {
    "text": "Yellen Goes to Georgia to Tout Over $1 Billion in Infrastructure Spending  — Treasury aims at disconnect between economy and Biden approval  — Will highlight port, power and broadband improvements  —  Treasury Secretary Janet Yellen will travel to the battleground state of Georgia … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-27/yellen-heads-for-georgia-touting-infrastructure-spending-push"
  },
  {
    "text": "Fox slashes ad prices for second debate as primary turns into ‘snoozer’  —  The Scoop  —  Advertisers paid a premium for airtime during the first Republican presidential debate on Fox News, but it looks like they'll be getting a major discount during round two on Wednesday night.",
    "url": "https://www.semafor.com/article/09/27/2023/fox-slashes-ad-prices-for-second-debate-as-primary-turns-into-snoozer"
  },
  {
    "text": "Utah House speaker jumps in Senate race to replace Romney: ‘Our country is not on the right path’  —  Brad Wilson will formally announce his US Senate candidacy at an event Wednesday evening in Draper, Utah  —  FIRST ON FOX: Utah House Speaker Brad Wilson, a Republican … ",
    "url": "https://www.foxnews.com/politics/utah-house-speaker-jumps-senate-race-replace-romney-our-country-not-on-right-path"
  }
]