[
  {
    "text": "Trump escalates his immigration rhetoric with baseless claim about Biden trying to overthrow the US  —  Former President Donald Trump on Saturday further escalated his immigration rhetoric and baselessly accused President Joe Biden of waging a “conspiracy to overthrow the United States of America” … ",
    "url": "https://apnews.com/article/trump-immigration-biden-gop-voters-border-migrants-1fc6624188f540f495e1087bee64318e"
  },
  {
    "text": "For Democrats Pining for an Alternative, Biden Team Has a Message: Get Over It  —  A new poll shows that nearly two in five Democrats say that the president should not be their nominee.  But no one who matters to the president seems willing to suggest he step aside.",
    "url": "https://www.nytimes.com/2024/03/02/us/politics/biden-poll.html"
  },
  {
    "text": "Cross-Tabs: February 2024 Times/Siena Poll of Registered Voters Nationwide  —  Donald Trump leads Joe Biden, 48 percent to 43 percent, among registered voters.",
    "url": "https://www.nytimes.com/interactive/2024/03/02/us/elections/times-siena-poll-registered-voter-crosstabs.html"
  },
  {
    "text": "US says Israel has agreed to the framework for a Gaza cease-fire.  Hamas must now decide  —  (March 1) (AP Video by Mohammad Hajjar, production by Wafaa Shurafa)  —  Biden approves military air drops of aid into Gaza after chaotic encounter left more than 100 dead",
    "url": "https://apnews.com/article/israel-hamas-war-news-03-02-2024-531593c27931a2764357b6f7b11ce394"
  },
  {
    "text": "US military aircraft airdrop thousands of meals into Gaza in emergency humanitarian aid operation  —  U.S. military C-13 cargo planes dropped food in pallets over Gaza on Saturday in the opening stage of an emergency humanitarian assistance authorized by President Joe Biden after more than 100 Palestinians … ",
    "url": "https://apnews.com/article/israel-hamas-gaza-airdrop-humanitarian-assistance-f8bc071193f89906abf21478bc70a084"
  },
  {
    "text": "Georgia Senate passes bill banning American Library Association from state libraries  —  Republican state senators in Georgia on Thursday passed a bill that would force state libraries to cut ties with the American Library Association.  Senate Bill 390 was passed by a vote of 33-20 vote with no support from Democratic senators.",
    "url": "https://www.advocate.com/politics/georgia-senate-ala"
  },
  {
    "text": "The turnout gap between white and Black voters is growing, study finds  —  A report by the Brennan Center for Justice studied nearly a billion voter files and found that white voters turn out at higher rates than Black voters — and the gap is growing.  —  The difference in turnout between white … ",
    "url": "https://www.nbcnews.com/politics/turnout-gap-white-black-voters-growing-study-finds-rcna141512"
  },
  {
    "text": "McConnell and Haley fight losing battles against Trump's ‘America First’ worldview  —  Senate Republican leader Mitch McConnell (R-Ky.) and former South Carolina governor Nikki Haley have spent the first months of this election year fighting losing battles — separate but related.",
    "url": "https://www.washingtonpost.com/politics/2024/03/02/mitch-mcconnell-nikki-haley-trump-foreign-policy/"
  },
  {
    "text": "Vindman: Trump has ‘every intention’ to undo American democracy if reelected  —  Retired Army Lt. Col. Alexander Vindman suggested Friday that President Trump has “every intention” to undo American democracy if reelected, as concerns rise over whether the former president would launch revenge campaign in a second term.",
    "url": "https://thehill.com/homenews/campaign/4503490-vindman-trump-intention-undo-american-democracy-if-reelected/"
  },
  {
    "text": "“Better than Jesus”: How far will the cult of Trump go?  —  MAGA has “been persuaded,” Katherine Stewart tells Salon, “that Trump is the savior who will face down the demons”  —  Donald Trump is a human chaos engine.  It is a function of both his personality and his politics.",
    "url": "https://www.salon.com/2024/03/02/better-than-jesus-how-far-will-the-of-go/"
  },
  {
    "text": "Trump wins Michigan GOP convention  —  Former President Trump is projected to win the Michigan Republican convention after winning the state's GOP primary earlier this week, according to results from Decision Desk HQ (DDHQ).  —  The numbers deliver another, albeit expected, blow to rival Nikki Haley … ",
    "url": "https://thehill.com/homenews/campaign/4500512-trump-wins-michigan-gop-convention/"
  },
  {
    "text": "Trump Casts Aside Repeated Scandals To Endorse Lauren Boebert Again  —  Boebert is currently running to represent Colorado's 4th congressional district.  —  LOADING  —  Former President Donald Trump once again threw his support behind Republican Rep. Lauren Boebert, whose three-year tenure … ",
    "url": "https://www.huffpost.com/entry/trump-casts-aside-repeated-scandals-to-endorse-lauren-boebert-again_n_65e37178e4b013678e156f35"
  },
  {
    "text": "Offensive comments by N.C. Republican stand out even in Trump's party  —  Mark Robinson is favored to win the Republican nomination for governor in a battleground state, even as some see serious liabilities for November.  —  OCEAN ISLE BEACH, N.C. — Surrounded by fans at a beach town bar, Mark Robinson addressed his absent critics.",
    "url": "https://www.washingtonpost.com/elections/2024/03/02/mark-robinson-governor-candidate-north-carolina-offensive-comments/"
  },
  {
    "text": "Chris Hayes Hits Fox For ‘Deluge’ Of Fearmongering Over Manufactured Crisis  —  Fox does this every time there's an election coming up.  Good for Chris Hayes for pointing out just how manipulative and cynical they are.  —  Can you help us out?  —  For nearly 20 years we have been exposing Washington lies … ",
    "url": "https://crooksandliars.com/2024/03/chris-hayes-hits-fox-deluge-fearmongering"
  }
]