[
  {
    "text": "Ex-Trump adviser Peter Navarro sentenced to 4 months for contempt of Congress  —  Former Trump White House official Peter Navarro was sentenced Thursday to four months in prison for contempt of Congress for defying a subpoena from the House committee investigating the Jan. 6 U.S. Capitol attack.",
    "url": "https://www.npr.org/2024/01/25/1226836737/peter-navarro-sentence-contempt-congress"
  },
  {
    "text": "Ex-Trump aide Peter Navarro sentenced to 4 months for defying Jan. 6 committee subpoena  —  The former White House adviser was sentenced on Thursday.  —  In this Sept. 7, 2023 file photo, Peter Navarro, an advisor to former U.S. President Donald Trump, speaks to reporters as he arrives … ",
    "url": "https://abcnews.go.com/US/trump-aide-peter-navarro-sentenced-defying-jan-6/story?id=106653782"
  },
  {
    "text": "Behind the Curtain: Trump's exponential power surge  —  Something shocking — and telling — has unfolded beyond Donald Trump's onstage, online and courtroom theatrics: He's running a professional, well-managed, disciplined presidential campaign.  — His 2024 operation is more sophisticated … ",
    "url": "https://www.axios.com/2024/01/25/trump-2024-campaign-republican-nominee"
  },
  {
    "text": "Trump opens up lead over Biden in rematch many Americans don't want  —  Donald Trump leads Democratic President Joe Biden by six percentage points in a Reuters/Ipsos poll that showed Americans are unhappy about an election rematch that came into sharper focus this week.",
    "url": "https://www.reuters.com/world/us/americans-dismayed-by-biden-trump-2024-rematch-reutersipsos-poll-finds-2024-01-25/"
  },
  {
    "text": "As 2024 race advances, Trump eyes a new priority: blacklisting  —  Ten months ago, Donald Trump and his team let Republicans know they'd embrace blacklisting tactics as the race unfolded.  Evidently, they meant it.  —  Gov. Ron DeSantis launched his doomed presidential campaign in May 2023 … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/2024-race-advances-trump-eyes-new-priority-blacklisting-rcna135613"
  },
  {
    "text": "1/25/24 ☀️ Punchbowl News AM … Senate Minority Leader Mitch McConnell did four extraordinary things Wednesday afternoon, all of which we scooped in our PM edition Wednesday night. … McConnell told GOP senators that before border security talks began, immigration policy united Republicans and Ukraine aid divided them.",
    "url": "https://punchbowl.news/archive/12524-punchbowl-news-am/"
  },
  {
    "text": "McConnell Casts Doubt on Border Deal, Saying Trump Opposition May Sink It  —  The minority leader privately told Republicans that the former president had put his party “in a quandary,” casting further doubt on the deal's chances and the fate of Ukraine aid that the G.O.P. has tied to it.",
    "url": "https://www.nytimes.com/2024/01/25/us/politics/mcconnell-border-deal-trump.html"
  },
  {
    "text": "Trump Spokesperson Steven Cheung Booted From Defamation Trial for Phone Alarm  —  U.S. District Judge Lewis Kaplan, notoriously strict about electronics in his courtroom, brought down the hammer when the alarm went off in the middle of witness testimony on Thursday",
    "url": "https://themessenger.com/politics/trump-spokesperson-steven-cheung-booted-defamation-trial-phone-alarm"
  },
  {
    "text": "The US and Iraq plan talks soon on ending the mission of the US-led military coalition in Iraq  —  The United States and Iraq expect to begin talks soon to wind down the mission of a U.S.-led military coalition formed to fight the Islamic State group in Iraq, both governments said Thursday.",
    "url": "https://apnews.com/article/iraq-us-coalition-islamic-state-israel-hamas-5639e1328ac0dbb9dd57fa9f027db332"
  },
  {
    "text": "Watch live: Treasury chief Yellen touts GDP numbers as a boon to the middle class  — Treasury Secretary Janet Yellen praised better-than-estimated economic indicators released Thursday.  — The economy grew at an annualized rate of 3.3% in the last few months of 2023, faster than the Wall Street estimate.",
    "url": "https://www.cnbc.com/2024/01/25/treasurys-yellen-touts-favorable-gdp-numbers-as-boon-to-middle-class.html"
  },
  {
    "text": "Eagle Pass is today's Fort Sumter.  Biden must federalize the Texas National Guard.  —  The high-stakes game of Texas Hold 'Em taking place on the banks of the Rio Grande between the tin soldiers of that state's Republican Gov. Greg Abbott and the U.S. Border Patrol has reached a tension level … ",
    "url": "https://www.inquirer.com/opinion/texas-border-abbott-biden-national-guard-20240125.html"
  },
  {
    "text": "‘A Warning Shot’: Maggie Haberman Explains Why Trump Attacked Kayleigh McEnany  —  The New York Times reporter shared her analysis after Trump lashed out at his former press secretary over her comments on Fox News.  —  LOADING  —  New York Times journalist Maggie Haberman said Donald Trump's outburst … ",
    "url": "https://www.huffpost.com/entry/maggie-haberman-kayleigh-mcenany-trump_n_65b242a1e4b074981636eb7d"
  },
  {
    "text": "Tea with salt?  American scientist's “outrageous proposal” leaves U.S.-U.K. relations in “hot water,” embassy says  —  How do you take your tea?  One lump of sugar, two or maybe some milk?  Unless you're adding salt, one U.S. scientist says, your cup won't be perfect … ",
    "url": "https://www.cbsnews.com/news/tea-with-salt-american-scientists-outrageous-proposal-leaves-u-s-u-k-relations-in-hot-water-embassy-says/"
  },
  {
    "text": "Biden to deploy CIA director to help broker major Gaza deal  —  William Burns is looking to close gaps between Israel and Hamas on a deal that includes the release of all hostages in Gaza and a two-month cease-fire  —  President Biden plans to dispatch CIA Director William J. Burns … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/25/william-burns-cia-gaza-israel-hostages/"
  },
  {
    "text": "FTC Launches Inquiry into Generative AI Investments and Partnerships  —  Agency Issues 6(b) Orders to Alphabet, Inc., Amazon.com, Inc., Anthropic PBC, Microsoft Corp., and OpenAI, Inc.  —  The Federal Trade Commission announced today that it issued orders to five companies requiring … ",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2024/01/ftc-launches-inquiry-generative-ai-investments-partnerships"
  },
  {
    "text": "Housing is now unaffordable for a record half of all U.S. renters, study finds  —  Over the past two years, Genuine Campbell was shocked at how rent for her two-bedroom apartment in Philadelphia just kept going up — from $1,300 a month to $1,600.  She's a single mom of four … ",
    "url": "https://www.npr.org/2024/01/25/1225957874/housing-unaffordable-for-record-half-all-u-s-renters-study-finds"
  },
  {
    "text": "Alabama GOP congressman disagrees with Nikki Haley: ‘Everyone has some racist in them’  —  Rep. Jerry Carl, R-Ala., said that in his experience, the GOP presidential candidate's comments that America is “not a racist country” was not true.  —  An Alabama Republican congressman said on Wednesday that … ",
    "url": "https://www.nbcnews.com/politics/2024-election/alabama-gop-congressman-jerry-carl-nikki-haley-racist-rcna135693"
  },
  {
    "text": "Intimidation of State and Local Officeholders  —  Left unchecked, abuse harms not only elected officials but also the public they serve.  —  The January 6 insurrection at the Capitol seemed to mark a new peak in extremist intimidation targeting public officials.",
    "url": "https://www.brennancenter.org/our-work/research-reports/intimidation-state-and-local-officeholders"
  },
  {
    "text": "An Iowa bill would make students sing the national anthem every day.  One lawmaker sang it  —  When it came time for her closing comments at Wednesday's Iowa House subcommittee meeting, Rep. Sue Cahill stood — and began singing the national anthem.  —  “O say can you see, by the dawn's early light … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/01/25/iowa-bill-require-students-sing-national-anthem-every-day/72349739007/"
  },
  {
    "text": "How Big Pharma Is Fueling a Radical MAGA Agenda  —  Republicans' Project 2025 blueprint is an assault on women's health care.  It would also end Biden's Medicare drug-pricing plan  —  Big Pharma has invested big money in the organizations planning what a MAGA policy agenda will look like in a new Trump administration.",
    "url": "https://www.rollingstone.com/politics/politics-features/big-pharma-fueling-maga-agenda-1234953950/"
  },
  {
    "text": "New Cars Would Require Speed-Limiting Technology Under California Bill  —  A California bill would require new cars sold or made in the state to incorporate technology that limits the speed of the vehicle.  —  “This bill would require certain vehicles, commencing with the 2027 model year … ",
    "url": "https://freebeacon.com/latest-news/new-cars-would-require-speed-limiting-technology-under-california-bill/"
  },
  {
    "text": "Sen. Barrasso's wife dies after 2-year battle with brain cancer  —  Sen. Barrasso announces wife's death  —  Sen. John Barrasso, R-Wy., announced on Thursday that his wife, Bobbi, died after a two-year battle with glioblastoma, a type of brain cancer.  —  “After a courageous battle with cancer … ",
    "url": "https://www.foxnews.com/politics/sen-barrassos-wife-dies-after-2-year-battle-cancer"
  },
  {
    "text": "Putin Sends US Signal on Ukraine Talks, Sensing Advantage in War  — Russia may be open to talks on Ukraine security, sources say  — US officials skeptical, see no sign Putin wants to end the war  —  Vladimir Putin is testing the waters on whether the US is ready to engage in talks for ending Russia's war in Ukraine.",
    "url": "https://www.bloomberg.com/news/articles/2024-01-25/russia-ukraine-putin-signals-interest-in-discussing-end-to-war"
  },
  {
    "text": "Transgender veterans sue the VA for gender-affirming surgery  —  The Department of Veterans Affairs excludes gender-confirming surgery from veteran health benefits, even though major medical groups say it can be lifesaving.  —  An advocacy group for transgender veterans is suing the government … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/transgender-veterans-lawsuit-va-gender-affirming-surgery-rcna135566"
  },
  {
    "text": "SCOTUS is poised to take a sledgehammer to federal agencies  —  Why overturning the Chevron precedent would be very big (and bad) deal.  —  ∙ Paid … Since conservatives fully captured the US Supreme Court during the Trump administration, right-wingers have been racking up wins.",
    "url": "https://www.publicnotice.co/p/scotus-chevron-precedent-overturned-explained"
  }
]