[
  {
    "text": "When Will Democrats Learn to Say No?  —  When Donald Trump held a rally in the Bronx in May, critics scoffed that there was no way he could win New York State.  Yet as a strategic matter, asking the question “What would it take for a Republican to win New York?” leads to the answer … ",
    "url": "https://www.nytimes.com/2024/11/16/opinion/democrats-interest-groups-majority.html"
  },
  {
    "text": "Democrats Draw Up an Entirely New Anti-Trump Battle Plan  —  The party's early preparations to oppose the next Trump administration are heavily focused on legal fights and consolidating state power, rather than marching in the streets.  —  Locked out of power next year … ",
    "url": "https://www.nytimes.com/2024/11/16/us/politics/democrats-anti-trump-battle-plan.html"
  },
  {
    "text": "Elon Musk pushes Lutnick for Treasury  —  The billionaire Trump confidant posted an endorsement on his social media network on Saturday.  —  Elon Musk is backing Donald Trump's transition co-chair Howard Lutnick to lead the Treasury Department, touting the billionaire CEO of Cantor Fitzgerald … ",
    "url": "https://www.politico.com/news/2024/11/16/elon-musk-backs-lutnick-for-treasury-00190015"
  },
  {
    "text": "The ‘team of vipers’ is back  —  Cliff Sims wrote the definitive tale of Trump administration infighting.  He's back, and fangs are out.  —  The last time Cliff Sims was this close to presidential power, he coined an indelible phrase for the cut-throat coterie around Donald Trump … ",
    "url": "https://www.politico.com/news/2024/11/16/cliff-sims-trump-transition-vipers-00189924"
  },
  {
    "text": "Jay Bhattacharya, an NIH critic, emerges as a top candidate to lead the agency  —  The Stanford physician was excoriated by NIH's director in 2020 for his “fringe” ideas on covid.  Four years later, he's poised for power in Trump's Washington.",
    "url": "https://www.washingtonpost.com/health/2024/11/16/nih-director-jay-bhattacharya-covid-great-barrington-declaration/"
  },
  {
    "text": "Trump Allies Were Told to Stop Saying They'll Put Migrants in ‘Camps’  —  “Apparently some people think it makes us look like Nazis,” says a close Trump ally … To be sure, Trump's migrant expulsion program, if he were to follow through with his plans to deport millions … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-allies-migrants-camps-miller-homan-1235168998/"
  },
  {
    "text": "Trump taps oil executive Chris Wright as Energy secretary  —  The oil executive and GOP fundraiser disputes the need to fight against climate change.  —  President-elect Donald Trump named Chris Wright, head of a Denver-based oil service company and a vocal opponent of government action … ",
    "url": "https://www.politico.com/news/2024/11/16/chris-wright-energy-secretary-trump-00189456"
  },
  {
    "text": "Under the Chandelier at Mar-a-Lago, Trump Makes Picks at Breakneck Speed  —  President-elect Donald J. Trump is more contemptuous than ever of Washington expertise and determined to hire people based on loyalty.  —  President-elect Donald J. Trump chose his attorney general almost on a whim … ",
    "url": "https://www.nytimes.com/2024/11/16/us/politics/trump-transition-picks.html"
  },
  {
    "text": "Trump's recess appointment power is constitutional and vital to his agenda  —  President-elect Trump's victory is an end to business as usual in Washington.  —  His desire to use recess appointment authority is a clear expression of how serious he is about making the federal government responsive to the will of the American people.",
    "url": "https://thehill.com/opinion/congress-blog/4993235-trump-recess-appointments/"
  },
  {
    "text": "A majority of Senate Republicans doubt Matt Gaetz will be confirmed as attorney general, sources say  —  More than half of Senate Republicans, including some in senior leadership positions, privately say they don't see a path for the former Florida representative, according to a number of Republican sources.",
    "url": "https://www.nbcnews.com/politics/justice-department/majority-senate-republicans-doubt-matt-gaetz-confirm-attorney-general-rcna180464"
  },
  {
    "text": "Democratic jockeying for the 2028 presidential election is already underway  —  Nearly two dozen Democrats are seen as possible contenders ahead of an invisible primary that will be shaped partly by Trump and his second term.  —  As the dust settles from Vice President Kamala Harris' defeat … ",
    "url": "https://www.nbcnews.com/politics/democratic-jockeying-2028-presidential-election-already-underway-rcna179653"
  },
  {
    "text": "Xi Says China Is Ready to Work With Trump to Boost Relations  —  Chinese leader Xi Jinping told US President Joe Biden that he's ready to work with Donald Trump to improve the relationship between the world's biggest economies.  —  Speaking in their final meeting before Trump takes office … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-16/xi-says-china-is-ready-to-work-with-trump-to-boost-relations"
  },
  {
    "text": "Trump won.  The celebrations started.  Then the trouble began.  —  The president-elect has been operating off his own script, making Cabinet picks that have posed immediate political challenges.",
    "url": "https://www.washingtonpost.com/politics/2024/11/16/trump-transition-cabinet-controversy/"
  },
  {
    "text": "Trump's victory means war will end sooner, says Zelensky  —  Ukrainian president said he had had a ‘constructive’ conversation with the US president-elect and he had heard nothing ‘that goes against our position’  —  President Zelensky has said the war in Ukraine will “end sooner” … ",
    "url": "https://www.thetimes.com/world/russia-ukraine-war/article/trumps-victory-means-war-will-end-sooner-says-zelensky-v7ckmjw3t"
  },
  {
    "text": "American Kakistocracy  —  Italy knows a thing or two about what the United States faces—but there are key differences between the two countries' experiences.  —  Why is a regular guy attracted to a billionaire candidate?  It's simple: Because the candidate can play to people's fantasies.",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/american-kakistocracy-donald-trump-berlusconi/680675/"
  }
]