[
  {
    "text": "Trump will stay on ballot in Washington state  —  A judge in Washington rejected an effort to boot former President Trump off the state's primary and general ballots in a ruling Thursday.  —  Thurston County, Wash., Superior Court Judge Mary Sue Wilson's ruling was in response to a challenge … ",
    "url": "https://thehill.com/regulation/court-battles/4416366-trump-washington-state-ballot-challenge/"
  },
  {
    "text": "McConnell, Republican lawmakers sign Supreme Court brief on keeping Trump on ballot  —  Nearly 180 congressional Republicans signed on to an amicus brief to the U.S. Supreme Court in support of Donald Trump's legal battle to remain on the primary election ballot in Colorado.",
    "url": "https://www.washingtonpost.com/politics/2024/01/18/mcconnell-trump-supreme-court-colorado-ballot/"
  },
  {
    "text": "The DeSantis Team Ran the Worst Campaign in History  —  The bizarre decisions behind a $130 million debacle.  —  Tim Pawlenty's and Scott Walker's presidential campaigns can breathe a sigh of relief.  The mantle of Worst Republican Presidential Campaign Ever has been lifted from their shoulders … ",
    "url": "https://www.politico.com/news/magazine/2024/01/19/the-desantis-team-ran-the-worst-campaign-in-history-00136527"
  },
  {
    "text": "Comer Statement on Transcribed Interview with Kevin Morris  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) issued the following statement on today's transcribed interview with Kevin Morris, a Hollywood lawyer and Democrat donor:",
    "url": "https://oversight.house.gov/release/comer-statement-on-transcribed-interview-with-kevin-morris%EF%BF%BC/"
  },
  {
    "text": "Judge hints at delay for Trump's March trial date in federal election case  —  Judge Tanya Chutkan suggested that Trump will get additional time to prepare for trial if appellate courts reject his claims of immunity.  —  The judge overseeing the federal criminal case against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/01/18/judge-hints-at-delay-for-trumps-march-trial-date-in-federal-election-case-00136403"
  },
  {
    "text": "Is It Over?  —  The opinions expressed by columnists are their own and do not necessarily represent the views of Townhall.com.  —  Top Columns  —  Trending on Townhall Media  —  Call For a Mop - There's Been an Evisceration During Congressional Testimony and the Floor Is Slippery",
    "url": "https://townhall.com/columnists/calthomas/2024/01/18/is-it-over-n2633759"
  },
  {
    "text": "How a Judge in India Prevented Americans From Seeing a Blockbuster Report  —  Free speech on the internet took a huge hit when the news agency Reuters took down an important hacking investigation to comply with an overseas legal challenge.  —  Two months ago, the news agency Reuters published … ",
    "url": "https://www.politico.com/news/magazine/2024/01/19/india-judge-reuters-story-00136339"
  },
  {
    "text": "Steve Garvey is running for Senate in California as a Republican — but don't ask about Trump  —  The former Dodger says he would consider voting for a Democrat.  —  SACRAMENTO, California — California Republicans are so desperate to separate themselves from Donald Trump that their leading candidate … ",
    "url": "https://www.politico.com/news/2024/01/18/steve-garvey-trump-california-senate-00136450"
  },
  {
    "text": "Google News Is Boosting Garbage AI-Generated Articles  —  Google News is boosting sites that rip-off other outlets by using AI to rapidly churn out content, 404 Media has found.  Google told 404 Media that although it tries to address spam on Google News, the company ultimately does not focus … ",
    "url": "https://www.404media.co/google-news-is-boosting-garbage-ai-generated-articles/"
  },
  {
    "text": "Statement from President Joe Biden on Nearly $5 Billion in Additional Student Debt Cancellation for 74,000 Borrowers  —  Today, my Administration approved debt cancellation for another 74,000 student loan borrowers across the country, bringing the total number of people who have gotten … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/19/statement-by-president-joe-biden-on-nearly-5-billion-in-additional-student-debt-cancellation-for-74000-borrowers/"
  },
  {
    "text": "Senate Democrats launch website targeting GOP on abortion ahead of Roe v Wade anniversary  —  The Senate Democrats' campaign arm launched a website on Friday targeting Republicans in battleground states on their past comments on abortion ahead of the anniversary of the Roe v. Wade decision.",
    "url": "https://thehill.com/homenews/senate/4416758-senate-democrats-launch-website-targeting-gop-on-abortion-ahead-of-roe-v-wade-anniversary/"
  },
  {
    "text": "Pro-Biden group raised $208M as Dems brace for tough election year  —  The top outside group supporting Joe Biden's reelection raised $208 million in 2023.  —  The top outside group supporting President Joe Biden raised $208 million in 2023, an enormous sum as Democrats gear up for a difficult reelection year.",
    "url": "https://www.politico.com/news/2024/01/19/pro-biden-group-raised-208-m-as-dems-brace-for-tough-election-year-00136510"
  },
  {
    "text": "House, Senate pass short-term bill averting government shutdown until March  —  Far-right House conservatives were furious over the move, which sends the bill to President Biden to sign into law and keep the government open.  —  Congress on Thursday passed legislation to keep … ",
    "url": "https://www.washingtonpost.com/business/2024/01/18/government-shutdown-bill-senate-house/"
  },
  {
    "text": "Salad and spinach kits sold in 7 states recalled over listeria risk  —  BrightFarms spinach and salad kits sold in seven U.S. states are being recalled because they may be contaminated with listeria, according to a notice posted by the U.S. Food and Drug Administration.",
    "url": "https://www.cbsnews.com/news/spinach-salad-kit-recall-listeria-stop-shop-wegmans/"
  },
  {
    "text": "State Health Department Issues Unprecedented $300K Penalty to Midwife for Falsifying Vaccine Records  —  Roughly 1,500 School-Aged Children Affected Across New York State  —  Children Are Required to Receive Vaccines Prior to Returning to School  —  The New York State Department of Health … ",
    "url": "https://www.health.ny.gov/press/releases/2024/2024-01-17_baldwin_midwifery.htm"
  },
  {
    "text": "ROGERS REQUESTS SECRETARY AUSTIN TESTIFY BEFORE HASC ON FAILURE TO DISCLOSE HOSPITALIZATION  —  Washington, D.C. - U.S. Representative Mike Rogers (R-AL), Chairman of the House Armed Services Committee, sent a letter to Secretary of Defense Lloyd J. Austin III, requesting that he testify … ",
    "url": "https://armedservices.house.gov/news/press-releases/rogers-requests-secretary-austin-testify-hasc-failure-disclose-hospitalization"
  },
  {
    "text": "USCP Threat Assessment Cases for 2023  —  The number of United States Capitol Police (USCP) threat assessment cases climbed last year, as we head into an election year when threats typically surge.  —  In 2023, the USCP's Threat Assessment Section (TAS) investigated 8,008 cases.",
    "url": "https://www.uscp.gov/media-center/press-releases/uscp-threat-assessment-cases-2023"
  },
  {
    "text": "L.A. Times Guild calls for one-day strike to protest looming staff cuts  —  Los Angeles Times newsroom guild leaders called for a one-day walkout Friday to protest planned cuts to offset steep financial losses that owner Dr. Patrick Soon-Shiong and his family have absorbed since acquiring the paper nearly six years ago.",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2024-01-18/la-times-guild-calls-for-one-day-walkout-to-protest-looming-staff-cuts"
  },
  {
    "text": "Pakistan Launches Retaliatory Strikes Against ‘Terrorist Hideouts’ in Iran  —  Pakistan said Thursday its military carried out strikes against “terrorist hideouts” in neighboring Iran two days after Tehran bombed what it said were “Iranian terrorists” sheltering on Pakistani soil.",
    "url": "https://www.voanews.com/a/pakistan-launches-retaliatory-strikes-against-terrorist-hideouts-in-iran/7444994.html"
  }
]