[
  {
    "text": "3 ways Trump might try to defuse the Epstein mess  —  President Trump isn't ready to course-correct over how his administration has handled the Jeffrey Epstein evidence.  — But officials and advisers are considering at least three ways Trump could try to defuse an issue that … ",
    "url": "https://www.axios.com/2025/07/14/trump-epstein-maga-defuse-mess"
  },
  {
    "text": "Bongino still in limbo as Trump fumes and JD Vance seeks to play mediator, sources say  —  Several of President Donald Trump's top officials went to work on Monday with a key question unanswered: would Dan Bongino show up today?  —  The deputy FBI director did not go into the office Friday … ",
    "url": "https://cnn.com/2025/07/14/politics/dan-bongino-epstein"
  },
  {
    "text": "Two-thirds of the DOJ unit defending Trump policies in court have quit  —  The U.S. Justice Department unit charged with defending against legal challenges to signature Trump administration policies - such as restricting birthright citizenship and slashing funding to Harvard University … ",
    "url": "https://www.reuters.com/legal/litigation/two-thirds-doj-unit-defending-trump-policies-court-have-quit-2025-07-14/"
  },
  {
    "text": "Trump to announce “aggressive” Ukraine weapons plan  —  President Trump will announce a new plan to arm Ukraine on Monday that is expected to include offensive weapons, two sources with knowledge of the plans tell Axios. … - U.S., Ukrainian and European officials hope the weapons will shift … ",
    "url": "https://www.axios.com/2025/07/14/trump-ukraine-weapons-missiles-russia"
  },
  {
    "text": "Why Trump's ‘major’ announcement on Russia sounds familiar — and falls far short  —  For the fifth time, the American president has threatened Russia with economic sanctions.  The first four times, Trump failed to follow through.  —  In recent days, Americans have repeatedly been told … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-major-announcement-russia-sounds-familiar-falls-far-short-rcna218677"
  },
  {
    "text": "Trump Kept Gold Club World Cup Trophy for Himself So FIFA Had to Give the Winners a Replica  —  OWN GOAL  —  Trump took every opportunity to make the new, expanded soccer tournament all about himself.  —  President Trump has revealed that the champions of the Club World Cup won't be getting … ",
    "url": "https://www.thedailybeast.com/trump-kept-gold-club-world-cup-trophy-for-himself-so-fifa-had-to-give-the-winners-a-replica/"
  },
  {
    "text": "Chelsea put on show in Club World Cup final — only to have Trump steal their moment  —  EAST RUTHERFORD, N.J. — Chelsea star Cole Palmer was like much of the world wondering why President Donald Trump was obliviously standing in the middle of their trophy celebration after winning the FIFA Club World Cup.",
    "url": "https://www.usatoday.com/story/sports/soccer/2025/07/13/trump-chelsea-club-world-cup-trophy-celebration/85173092007/"
  },
  {
    "text": "Defense Department to begin using Grok, Musk's controversial AI Model  —  Elon Musk's artificial intelligence start-up said its models are now available to federal agencies.  —  The U.S. Department of Defense will begin using Grok, the AI chatbot built by Elon Musk's start-up xAI, the company announced in a post on Monday.",
    "url": "https://www.washingtonpost.com/technology/2025/07/14/elon-musk-grok-defense-department/"
  },
  {
    "text": "Why Gov. Greg Abbott Won't Release His Emails With Elon Musk  —  We asked Abbott for his and his staff's emails with Elon Musk and Musk's companies.  The governor's office won't turn them over, saying some contain “intimate and embarrassing” information that is “not of legitimate concern to the public.”",
    "url": "https://www.propublica.org/article/texas-governor-greg-abbott-elon-musk-emails-foia"
  },
  {
    "text": "The Young GOPer Behind “Alligator Alcatraz” Is the Dark Future of MAGA  —  The other day, Stephen Miller went on Fox News and offered a plea that got surprisingly little attention given its highly toxic and unnerving implications.  Miller urged politicians in GOP-run states to build their own versions of … ",
    "url": "https://newrepublic.com/article/197899/james-uthmeier-florida-alligator-alcatraz-maga-dark-future"
  },
  {
    "text": "Marc Andreessen and the Billionaire Victims Club  —  The gripes of this bigwig of the tech right don't stand up to scrutiny.  —  ∙ Paid  —  1. White People  —  Over the weekend the Washington Post got hold of a text chain in which Marc Andreessen explained some facts of life to his fellow travelers in the Trump White House.",
    "url": "https://www.thebulwark.com/p/marc-andreesen-and-the-billionaire"
  },
  {
    "text": "Marc Andreessen Is a Traitor  —  A recent leak of venture capitalist Marc Andreessen's group chats has revealed that he's quite happy to see our university system destroyed if it will keep out foreigners and humiliate the elites who “actively discriminated against” people like him.",
    "url": "https://www.liberalcurrents.com/marc-andreessen-is-a-traitor/"
  },
  {
    "text": "Cuomo to Fight On in Mayor's Race After Bruising Primary Loss to Mamdani  —  Former Gov. Andrew M. Cuomo is expected to announce his commitment to a third-party run against Assemblyman Zohran Mamdani, who soundly defeated him in the Democratic primary for New York City mayor.",
    "url": "https://www.nytimes.com/2025/07/14/nyregion/andrew-cuomo-mamdani-nyc-mayor.html?unlocked_article_code=1.WU8.nwO-.AWpGD56nTku7&smid=url-share"
  },
  {
    "text": "Supreme Court allows Trump to lay off nearly 1,400 Education Department employees  —  The Supreme Court is allowing President Donald Trump to put his plan to dismantle the Education Department back on track — and to go through with laying off nearly 1,400 employees.",
    "url": "https://apnews.com/article/supreme-court-trump-education-layoffs-9370415531185092341b16a6bfea9344"
  },
  {
    "text": "Obama's blunt message for Democrats: ‘Toughen up’  —  Former President Barack Obama issued a call to action for Democrats at a private fundraiser in New Jersey on Friday evening, urging those frustrated by the state of the country under President Donald Trump to “stand up for the things that you think are right.”",
    "url": "https://cnn.com/2025/07/14/politics/obama-democrats-message"
  },
  {
    "text": "Mark Cuban Reveals A Cold Truth About Why Democrats Are Flailing  —  “That's not the way to win.  It's just not,” said the billionaire.  —  Billionaire investor and “Shark Tank” alum Mark Cuban pulled no punches when talking about what he sees as the Democratic Party's current failings.",
    "url": "https://www.huffpost.com/entry/mark-cuban-democrats-suck_n_6874bcb8e4b04f3e272f574b"
  },
  {
    "text": "The Situation: The Case of Erez Reuveni  —  What if America had checks and balances and nobody came?  —  benjaminwittes.lawfaremedia.org  —  Meet The Authors … The Situation on Wednesday predicted that the so-called investigation of John Brennan and James Comey will prove to be a ghost … ",
    "url": "https://www.lawfaremedia.org/article/the-situation--the-case-of-erez-reuveni"
  },
  {
    "text": "Trump finds himself on the wrong side of a conspiracy theory  —  He has leveraged conspiracy theories for a decade — now one lumps him in with The Elites.  —  One of the common misunderstandings about President Donald Trump is that he created the culture of conspiracy and surreality in which the American right is now immersed.",
    "url": "https://www.washingtonpost.com/opinions/2025/07/14/trump-jeffrey-epstein-conspiracy-theory-qanon/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUyNDY1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzODQ3OTk5LCJpYXQiOjE3NTI0NjU2MDAsImp0aSI6IjRlMzE0OTM2LWMzNDktNDNkZi05MTcyLWE2MmU0MTI4YmVmZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA3LzE0L3RydW1wLWplZmZyZXktZXBzdGVpbi1jb25zcGlyYWN5LXRoZW9yeS1xYW5vbi8ifQ.MAWClW7iS-Zbmb3ySD26mSf0Iqa1xnSSQ16C-TKSzQk&itid=gfta"
  },
  {
    "text": "The right-wing outrage machine gears up, and a cartoonist gets death threats  —  Here are some possible reasonable responses to seeing an editorial cartoon you don't agree with:  — Write an email to the journalist who created it, expressing your opposing view.",
    "url": "https://margaretsullivan.substack.com/p/the-right-wing-outrage-machine-strikes"
  },
  {
    "text": "EXCLUSIVE: Jeffery Epstein's accomplice Ghislaine Maxwell is ready to reveal ‘truth’ of the pedophile client list, say insiders.  So, why are Republicans blocking her?  —  Ghislaine Maxwell is willing to speak in front of Congress about The Epstein Files, sources tell Daily Mail.",
    "url": "https://www.dailymail.co.uk/news/article-14901591/Jeffery-Epstein-Ghislaine-Maxwell-trump-congress.html"
  },
  {
    "text": "DOGE told regulator to ‘rubber stamp’ nuclear … The meeting was held after President Donald Trump signed a May 23 executive order that would supplant the NRC's historical role as the sole agency responsible for ensuring commercial nuclear projects are safe and won't threaten public health.",
    "url": "https://www.politico.com/news/2025/07/14/doge-to-regulator-rubber-stamp-nuclear-00450658"
  },
  {
    "text": "Camp Mystic's leader got a ‘life threatening’ flood alert.  They evacuated an hour later. … Camp Mystic Executive Director Richard “Dick” Eastland did not begin to evacuate the young campers asleep in cabins near the rapidly rising Guadalupe River for more than an hour after he received … ",
    "url": "https://www.washingtonpost.com/nation/interactive/2025/camp-mystic-alerts-texas-floods/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUyNDY1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzODQ3OTk5LCJpYXQiOjE3NTI0NjU2MDAsImp0aSI6ImEzNGQ1YmI0LTU3MGEtNDhiNi05MjgxLTc2OWE5MTQ0N2FjNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vaW50ZXJhY3RpdmUvMjAyNS9jYW1wLW15c3RpYy1hbGVydHMtdGV4YXMtZmxvb2RzLyJ9.93Km1lh5WJveP02Liqa4tIDowgypIqujlKs8ktfMlEI&itid=gfta"
  },
  {
    "text": "Plan to Indefinitely Displace Palestinians Threatens to Derail Gaza Truce  —  An Israeli proposal to force much of Gaza's population into a small enclave is now overshadowing negotiations over a truce.  —  Israel's defense ministry has promoted a plan to force much of Gaza's population … ",
    "url": "https://www.nytimes.com/2025/07/14/world/middleeast/israel-hamas-gaza-cease-fire.html"
  },
  {
    "text": "The Canadians Are Furious  —  Trump accomplished what was once considered impossible: Our northern neighbors have united against us.  —  In May, I reoriented my algorithms to flood me with Canadian content, turned on push notifications from The Globe and Mail, and temporarily moved my family north of the border.",
    "url": "https://nymag.com/intelligencer/article/canadians-join-the-us-trump-america-canada-reaction.html"
  }
]