[
  {
    "text": "I'm the Governor of Ohio.  I Don't Recognize the Springfield That Trump and Vance Describe.  —  I was born in Springfield, Ohio.  My wife, Fran, and I have lived our entire lives less than 10 miles from this city.  —  When we were dating in high school, we would go there to see movies … ",
    "url": "https://www.nytimes.com/2024/09/20/opinion/springfield-haitian-migrants-ohio.html?unlocked_article_code=1.ME4.GXDA.7LLopMRyJqap&smid=url-share"
  },
  {
    "text": "How Dumb Do They Think You Are?  —  Ohio's Republican governor, Mike DeWine, comes to the defense of Springfield and its Haitian community in the New York Times today: … Happy Friday.  —  Uh, Gross  —Andrew Egger  —  When the rumor mill started churning yesterday that some major … ",
    "url": "https://www.thebulwark.com/p/how-dumb-do-they-think-you-are"
  },
  {
    "text": "Trump Ignores Mark Robinson Controversy, Hoping Gubernatorial Candidate Will Drop Out  —  CNN's article scrambled G.O.P. plans for winning North Carolina.  People close to Donald Trump are holding out hope Lt. Gov. Mark Robinson will decide to quit the governor's race.",
    "url": "https://www.nytimes.com/2024/09/20/us/politics/trump-mark-robinson.html"
  },
  {
    "text": "Pro-Trump Georgia election board votes to require hand counts of ballots  —  Critics plan to sue, saying the new requirement would almost certainly lead to errors and could disrupt the process of certifying the vote in a crucial battleground state.  —  ATLANTA — The Georgia State Election Board approved … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/20/trump-georgia-election-board-hand-count-ballots/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2ODA0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4MTg3MTk5LCJpYXQiOjE3MjY4MDQ4MDAsImp0aSI6IjE4ZWFiMzg0LWI0YzAtNDg0OS1iZDAyLWQ2OWY3M2Q4OWUzMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzIwL3RydW1wLWdlb3JnaWEtZWxlY3Rpb24tYm9hcmQtaGFuZC1jb3VudC1iYWxsb3RzLyJ9.6YbhZUEbRz6Z5KR45vVgeF7W8k1P4tuRjFroyQvDRR8"
  },
  {
    "text": "Georgia election board requires ballots be hand-counted despite warning from key GOP state officials  —  Allies of former President Donald Trump who control the Georgia State Election Board approved a controversial new rule Friday requiring counties to hand-count the number of ballots cast … ",
    "url": "https://www.cnn.com/2024/09/20/politics/georgia-republican-election-rules-hand-count"
  },
  {
    "text": "Nuzzi's RFK Relationship  —  “Had the magazine been aware of this relationship, she would not have continued to cover the presidential campaign,” the spokesperson said. … “Recently our Washington Correspondent Olivia Nuzzi acknowledged to the magazine's editors that she had engaged … ",
    "url": "https://www.status.news/p/olivia-nuzzi-rfk-new-york-magazine"
  },
  {
    "text": "‘I agonized over it’: Behind the scenes with the reporter who uncovered the RFK Jr./Olivia Nuzzi story  — One of the country's most high-profile journalists says she had a “personal” relationship with RFK Jr.  — Now Olivia Nuzzi is on leave from New York magazine, where she's written many buzzy political stories.",
    "url": "https://www.businessinsider.com/robert-f-kennedy-jr-rfk-olivia-nuzzi-oliver-darcy-interview-2024-9"
  },
  {
    "text": "New Court Filings Place Matt Gaetz at a Party at the Center of the Sex Trafficking Scandal  —  This is the first public filing that cites sworn testimony alleging that Gaetz attended one of the long-rumored parties with a teenage girl.  — Copy  —  Rep. Matt Gaetz attended a drug-fueled sex party … ",
    "url": "https://www.notus.org/florida/new-court-filings-matt-gaetz-dorworth-sex-party"
  },
  {
    "text": "Microsoft deal would reopen Three Mile Island nuclear plant to power AI  —  The owner of the shuttered Pennsylvania plant plans to bring it online by 2028, with the tech giant buying all the power it produces.  —  Pennsylvania's dormant Three Mile Island nuclear plant would be brought … ",
    "url": "https://www.washingtonpost.com/business/2024/09/20/microsoft-three-mile-island-nuclear-constellation/"
  },
  {
    "text": "Microsoft AI Needs So Much Power It's Tapping Site of US Nuclear Meltdown  —  Constellation to invest $1.6 billion to restart dormant reactor as data-center power demand surges.  —  The owner of the shuttered Three Mile Island nuclear plant in Pennsylvania will invest $1.6 billion to revive it … ",
    "url": "https://www.bloomberg.com/news/articles/2024-09-20/microsoft-s-ai-power-needs-prompt-revival-of-three-mile-island-nuclear-plant"
  },
  {
    "text": "Trump says Jews would deserve much of the blame if he loses  —  In a speech Thursday billed as former President Donald Trump's answer to rising antisemitism, he said Jews would bear much of the responsibility if he loses the presidential election.  —  And in a second speech later in the evening … ",
    "url": "https://forward.com/fast-forward/655947/trump-jews-blame-israel-harris/"
  },
  {
    "text": "House Republicans work to defuse Trump as they defy shutdown demands  —  GOP appropriators have been calling their presidential nominee, trying to convince him his calls to shut down the government over a voting bill are a bad idea.  —  House Republicans are typically hesitant to defy Donald Trump.",
    "url": "https://www.politico.com/news/2024/09/20/house-gop-trump-shutdown-00180243"
  },
  {
    "text": "I co-chaired Nikki Haley's Iowa campaign.  I am endorsing Kamala Harris.  —  I heard Harris articulate that she has always brought groups of diverse individuals and opinions together to solve problems.  That is a healthier and wiser way to lead.  —  I served as an Iowa state co-chair of the Nikki Haley for President campaign.",
    "url": "https://www.desmoinesregister.com/story/opinion/columnists/iowa-view/2024/09/20/republicans-for-kamala-harris-dawn-roberts-iowa-campaign-nikki-haley/75306017007/"
  },
  {
    "text": "Playbook: Inside the mind of Harris' messaging maven  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  OVERNIGHT MILESTONE — The midnight deadline having passed, it's now officially too late to remove scandal-plagued Republican gubernatorial candidate … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/09/20/inside-the-mind-of-harris-messaging-maven-00180187"
  },
  {
    "text": "The Trump Lie Machine Is Broken  —  It shouldn't have taken a year, let alone nine, for political elites to stop getting snookered by Donald Trump.  —  I say that as someone with very low expectations.  Being an easy mark is part of the price of admission to the heights of American discourse.",
    "url": "https://www.offmessage.net/p/the-trump-lie-machine-is-broken"
  },
  {
    "text": "Trump Media closes at a new 52-week low, as Dow finishes week at record high … Shares of Trump Media fell to a new 52-week low Friday, closing down 8% just one day after “lockup” restrictions expired, which had previously prevented its majority shareholder, former President Donald Trump … ",
    "url": "https://www.cnbc.com/2024/09/20/djt-trump-media-stock-selloff-lockup-.html"
  },
  {
    "text": "Which Mexico are you?  New Mexico furious after Texas installs razor wire along its border  —  Texas' latest move is a ‘political stunt’ that will have 'will have no meaningful impact on our nation's broken immigration system,' New Mexico Governor Michelle Lujan Grisham said",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/texas-new-mexico-border-wire-b2615743.html"
  },
  {
    "text": "Republicans plan to push a potential Harris cabinet to the right  —  There's a real possibility that Kamala Harris wins the presidency and Democrats lose the Senate in November - in which case she'll almost surely run into trouble stocking a Cabinet and the courts.",
    "url": "https://www.semafor.com/article/09/19/2024/republicans-plot-a-nominee-rebellion-against-a-potential-president-harris"
  }
]