[
  {
    "text": "Exclusive: Early US intel assessment suggests strikes on Iran did not destroy nuclear sites, sources say  —  The US military strikes on three of Iran's nuclear facilities last weekend did not destroy the core components of the country's nuclear program and likely only set it back by months … ",
    "url": "https://cnn.com/2025/06/24/politics/intel-assessment-us-strikes-iran-nuclear-sites"
  },
  {
    "text": "Strike Set Back Iran's Nuclear Program by Only a Few Months, U.S. Report Says  —  Classified findings indicate that the attack sealed off the entrances to two facilities but did not collapse their underground buildings.  —  A preliminary classified U.S. report says the American bombing … ",
    "url": "https://www.nytimes.com/2025/06/24/us/politics/iran-nuclear-sites.html?unlocked_article_code=1.RU8.3ALC.LpnGMmyLfpyW&smid=url-share"
  },
  {
    "text": "Iran ‘much further away’ from building nukes after US strike, Rubio says  —  The secretary of state dismissed media reports of new intel assessments as “false.”  —  THE HAGUE, Netherlands - Secretary of State Marco Rubio said on Wednesday that Iran is “much further away from a nuclear weapon” … ",
    "url": "https://www.politico.com/news/2025/06/25/marco-rubio-dasha-burns-interview-nato-00421760"
  },
  {
    "text": "Live Updates: Mamdani Holds Lead Over Cuomo in Democratic Primary for N.Y.C. Mayor  —  Zohran Mamdani, a 33-year-old state assemblyman, built a significant advantage over former Gov. Andrew Cuomo thanks to a strong showing in Brooklyn and Manhattan.  A winner might not be declared until ranked-choice ballots are tabulated next week.",
    "url": "https://www.nytimes.com/live/2025/06/24/nyregion/nyc-democratic-primary-election-mayor?unlocked_article_code=1.Rk8.JmS3.B_aryLPg6Yny&smid=url-share"
  },
  {
    "text": "Zohran Mamdani topples Andrew Cuomo in NYC mayoral race  —  The 33-year-old Democratic Socialist lawmaker outpaced the former governor, who has conceded, in a stunning primary, signaling generational change in the Democratic Party.  —  NEW YORK — Zohran Mamdani, a 33-year-old democratic socialist lawmaker … ",
    "url": "https://www.politico.com/news/2025/06/24/mamdani-leads-cuomo-nyc-mayor-race-00422363"
  },
  {
    "text": "Andrew Cuomo concedes to Zohran Mamdani in NYC mayoral primary  —  Former New York Gov. Andrew Cuomo conceded to state assemblyman Zohran Mamdani in New York City's Democratic mayoral primary on Tuesday night.  —  Why it matters: Mamdani, a 33-year-old democratic socialist … ",
    "url": "https://www.axios.com/2025/06/25/zohran-mamdani-new-york-city-primary-election-cuomo-concedes"
  },
  {
    "text": "‘Big Balls’ No Longer Works for the US Government  —  The technologist Edward Coristine, a key operative in Elon Musk's so-called Department of Government Efficiency who's gone by the name “Big Balls” online, has resigned, the White House tells WIRED.  —  Edward “Big Balls” Coristine … ",
    "url": "https://www.wired.com/story/big-balls-coristine-doge-resigned-us-government/"
  },
  {
    "text": "Edward Coristine, Key Player on Elon Musk's DOGE Team, Resigns  —  Edward Coristine, the 19-year-old who was hired by Elon Musk to help slash the government bureaucracy, became a public symbol of his team.  —  Edward Coristine, the 19-year-old high-profile operative for the Department … ",
    "url": "https://www.nytimes.com/2025/06/24/us/politics/big-balls-edward-coristine-musk-doge.html"
  },
  {
    "text": "Donald Trump Nobel Peace Prize Nomination Withdrawn  —  A senior Ukrainian lawmaker who nominated U.S. President Donald Trump for a Nobel Peace Prize has withdrawn it, as peace talks between Kyiv and Moscow slip under the radar and the president keeps his sights fixed on the Middle East.",
    "url": "https://www.newsweek.com/donald-trump-nobel-peace-prize-nomination-withdrawn-ukraine-russia-2089818"
  },
  {
    "text": "Trump Complains Biden Let Thunderstorms Into the U.S.  —  FORCE OF NATURE  —  The president made an embarrassing flub aboard Air Force One while en route to a summit where he will discuss mounting global instability with other NATO leaders.  —  President Donald Trump got a little tongue-tied speaking … ",
    "url": "https://www.thedailybeast.com/trump-complains-joe-biden-let-thunderstorms-into-the-united-states/"
  },
  {
    "text": "6/25/25 ☀️ AM: … There are nine days until July 4 — Republicans' deadline to pass President Donald Trump's “one big, beautiful bill.” … The complaints span the party's ideological spectrum — and they're only getting louder. … Over two days, Tillis circulated flyers explaining … ",
    "url": "https://punchbowl.news/archive/62525-am/"
  },
  {
    "text": "The National Archives at College Park, Maryland  —  We hold permanent records created by Federal agencies that include:  — Textual records from civilian agencies  — Army unit records dating from WW1  — Navy unit records dating from WW2  — Berlin Documents Center microfilm",
    "url": "https://www.archives.gov/college-park"
  },
  {
    "text": "Democrats fume at “unserious” Trump impeachment vote  —  House Democrats privately vented their fury Tuesday about what they said is a “premature” and “unhelpful” vote on impeaching President Trump for his strikes on Iran.  —  Why it matters: Impeachment has dogged Democrats since Trump came … ",
    "url": "https://www.axios.com/2025/06/24/trump-impeachment-iran-democrats-al-green"
  },
  {
    "text": "Exclusive: Thune urges “light touch” on AI regulations  —  Senate Majority Leader John Thune expects some form of freeze on state AI regulations to remain in the “big, beautiful bill” — even as his Republicans keep debating the move. … - The moratorium has been criticized but Thune's … ",
    "url": "https://www.axios.com/2025/06/25/thune-ai-moratorium-big-beautiful-bill"
  },
  {
    "text": "DOJ Whistleblower Erez Reuveni Exposes High-Level Defiance of Court Orders and Retaliation  —  WASHINGTON—Today, Government Accountability Project and Gilbert Employment Law, P.C. submitted a protected whistleblower disclosure on behalf of Erez Reuveni, former Acting Deputy Director … ",
    "url": "https://whistleblower.org/press/doj-whistleblower-erez-reuveni-exposes-high-level-defiance-of-court-orders-and-retaliation/"
  },
  {
    "text": "Mike Johnson says War Powers Act is unconstitutional  —  Speaker Mike Johnson (R-La.) on Tuesday asserted that the War Powers Act is unconstitutional, pushing back forcefully against the lawmakers in both parties who are invoking the law in an effort to block President Trump from further military action in Iran.",
    "url": "https://thehill.com/homenews/house/5367102-speaker-johnson-war-powers-act/"
  },
  {
    "text": "Masked Terror  —  At this point, we have all seen the videos.  Men dressed in plaid shirts, jeans and boots descending on constructions sites, chasing migrants in fields, lurking in courthouse hallways at courthouses, knocking on doors of homes, and surrounding cars.  We see them wrestling men and women to the ground.",
    "url": "https://sherrilyn.substack.com/p/masked-terror"
  },
  {
    "text": "A decade after Obergefell, LGBTQ+ rights remain under threat  —  It's been ten years since the Supreme Court's landmark Obergefell v. Hodges decision legalized same-sex marriage across the U.S. But Jim Obergefell, the case's lead plaintiff, says the fight is far from over — marriage equality remains under threat.",
    "url": "https://www.axios.com/2025/06/25/obergefell-decade-lgbtq-rights-threat"
  },
  {
    "text": "Disgusting  —  Don't pour yourself a whiskey and get too comfortable, settling in for protracted Slack Tide goodness.  This isn't a real piece, where I tap dance and dazzle you with wordplay, as is our custom around these parts.  It's just a short, blunt, angry cry.",
    "url": "https://mattlabash.substack.com/p/disgusting"
  },
  {
    "text": "Dead congressman promotes candidate for his seat on social media  —  Deceased Rep. Gerry Connolly's (D-Va.) social media accounts shocked the internet Tuesday by seemingly resurrecting the congressman to endorse his former chief of staff, James Walkinshaw, to fill his seat.",
    "url": "https://www.axios.com/2025/06/24/gerry-connolly-james-walkinshaw-dead-social-media"
  },
  {
    "text": "Stephen Miller Has Financial Stake in Company Helping ICE With Deportations: Report  —  The president's chief immigration hawk has a substantial amount of stock in Palantir, one of ICE's most prominent contractors … According to ethics disclosure reports released by the White House … ",
    "url": "https://www.rollingstone.com/politics/politics-news/stephen-miller-financial-stake-palantir-ice-contractor-1235371343/"
  }
]