[
  {
    "text": "Trump is everywhere.  Anxious Dems wonder why Harris isn't.  —  Trump is everywhere.  Democrats are increasingly wondering why Harris isn't.  —  Democratic operatives, including some of Kamala Harris' own staffers, are growing increasingly concerned about her relatively light campaign schedule … ",
    "url": "https://www.politico.com/news/2024/10/05/harris-30-days-00182592"
  },
  {
    "text": "Harris is running a much bigger campaign than Trump.  Will it matter?  —  She spends three times as much, employs hundreds more staff and dominates the ad war.  But the race is effectively tied.  —  With a month to go, Donald Trump and Kamala Harris remain nearly tied in battleground polls.",
    "url": "https://www.washingtonpost.com/politics/2024/10/05/harris-trump-campaign-spending/"
  },
  {
    "text": "30 Days Out, the Harris and Trump Campaigns Brace for ‘Trench Warfare’  —  With tight contests in all seven battleground states, the candidates are pressing for a few thousand votes that could sway the outcome of the entire election.  —  As Vice President Kamala Harris and former President … ",
    "url": "https://www.nytimes.com/2024/10/05/us/politics/trump-harris-30-days-to-election.html"
  },
  {
    "text": "Trump Made Another Joke About Supporter Killed At Pennsylvania Rally: Report  —  The news comes as the former president is set to return to the site of his July assassination attempt.  —  LOADING  —  Donald Trump used a reference to the widow of Corey Comperatore — a supporter killed during … ",
    "url": "https://www.huffpost.com/entry/trump-joke-widow-corey-comperatore-butler-rally-tape_n_670107d0e4b0c12c1d3bf72e"
  },
  {
    "text": "As Lawmaker Claims Trump's Shooting Was Inside Job, G.O.P. Indulges Him  —  Representative Eli Crane, a first-term Arizona Republican, has emerged as the chief right-wing voice pushing conspiracy theories about the Trump assassination attempts.  —  He posits that there is a mole within … ",
    "url": "https://www.nytimes.com/2024/10/05/us/politics/as-lawmaker-claims-trumps-shooting-was-inside-job-gop-indulges-him.html"
  },
  {
    "text": "October 4, 2024  —  MAGA Republicans are now lying about the federal response to Hurricane Helene in much the same way they lied about Haitian migrants bringing chaos and disease to Springfield, Ohio.  Both disinformation efforts are flat-out lies, and both are designed to demonize immigrants.",
    "url": "https://heathercoxrichardson.substack.com/p/october-4-2024"
  },
  {
    "text": "US officials struggle to quash Hurricane Helene conspiracy theories  —  In the wake of the devastation of Hurricane Helene in the United States this week, a new storm emerged on social media - false rumors about how disaster funds have been used, and even claims that officials control the weather.",
    "url": "https://www.reuters.com/world/us/us-officials-struggle-quash-hurricane-helene-conspiracy-theories-2024-10-05/"
  },
  {
    "text": "What Really Happened On Tim Walz's Trips to China  —  Former students reflect on their time in China with the would-be vice president.  —  Tim Walz would like to take Donald Trump to China — or at least that is what he said during this week's vice-presidential debate.",
    "url": "https://www.politico.com/news/magazine/2024/10/05/what-really-happened-on-tim-walzs-trips-to-china-00179326"
  },
  {
    "text": "Who's Who in Jack Smith's Immunity Brief  —  Editors' notes: Readers may also be interested in an annotated version of the DOJ brief with names included.  Klasfeld's reporting is part of Just Security's Trump Trials Clearinghouse.  —  Special Counsel Jack Smith's massive legal brief detailing … ",
    "url": "https://www.justsecurity.org/103533/whos-who-jack-smith-immunity-brief/"
  },
  {
    "text": "Truth Social Users Are Losing Ridiculous Sums of Money to Scams  —  Read the complaints submitted to the FTC by users of Donald Trump's social media platform. … Donald Trump launched Truth Social in 2022 as a social media platform where the MAGA faithful could hang out without any liberals to spoil the fun.",
    "url": "https://gizmodo.com/truth-social-users-are-losing-ridiculous-sums-of-money-to-scams-2000506604"
  },
  {
    "text": "For First Time in 20 Years, Purdue Won't Have Election Day Polling Place on Campus  —  Purdue University in Indiana will not have an Election Day polling place this year.  The Tippecanoe County Election Board decided not to hold one, even though the campus has had one during the last four presidential elections.",
    "url": "https://www.democracydocket.com/news-alerts/for-first-time-in-20-years-purdue-wont-have-election-day-polling-place-on-campus/"
  },
  {
    "text": "U.S. Wiretap Systems Targeted in China-Linked Hack  —  AT&T and Verizon are among the broadband providers that were breached  —  A cyberattack tied to the Chinese government penetrated the networks of a swath of U.S. broadband providers, potentially accessing information from systems … ",
    "url": "https://www.wsj.com/tech/cybersecurity/u-s-wiretap-systems-targeted-in-china-linked-hack-327fc63b?st=C5ywbp&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Marco Rubio-linked thinktank produces anti-LGBTQ+ conspiracy theory videos  —  Videos voiced by Nate Hochman tout conspiracy theories about McKinsey and have elements of fascist rhetoric  —  A Marco Rubio-linked thinktank stoking fears about Haitian migrants in Pennsylvania has also produced … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/04/marco-rubio-thinktank-conspiracy-theories"
  },
  {
    "text": "Scoop: VC titan Ben Horowitz plans “significant” donation to Kamala Harris … - At the time, President Biden was still running for re-election. … - He notes that he and Felicia have known Harris for more than a decade, and she's been “a great friend to both of us over that time.”",
    "url": "https://www.axios.com/2024/10/04/ben-horowitz-endorse-kamala-harris"
  },
  {
    "text": "Battle for the House Goes Down to the Wire  —  Republicans try to keep majority in tight contests against Democrats in California, Iowa and New York  —  WASHINGTON—House Speaker Mike Johnson hopes to retain and build out his slim Republican majority.  Top Democrat Hakeem Jeffries needs … ",
    "url": "https://www.wsj.com/politics/elections/house-campaign-election-2024-bc58c72b"
  },
  {
    "text": "Exclusive: Conservative think tank targeting NASA employees' communications about Musk, Trump  —  An influential conservative think tank has asked the National Aeronautics and Space Administration to disclose what employees are discussing internally about billionaire Elon Musk … ",
    "url": "https://www.reuters.com/world/us/conservative-think-tank-targeting-nasa-employees-communications-about-musk-trump-2024-10-04/"
  },
  {
    "text": "Trump's Election Bid Is a Wild Card as Supreme Court Term Opens  — Court returns with cases on ‘ghost guns’, trans care on agenda  — Presidential election disputes may wind up before justices  —  The US Supreme Court opens its new term under the shadow of a presidential election … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-05/supreme-court-returns-to-ghost-guns-trans-care-and-maybe-trump-cases"
  }
]