[
  {
    "text": "How Aleksei Navalny's Death Restored Evan Gershkovich's Life  —  A few days ago, Russian political prisoners started vanishing from their prison colonies: Their lawyers would come to see them only to be told their clients were no longer there.  The disappearance of an inmate is often bad news … ",
    "url": "https://www.nytimes.com/2024/08/02/opinion/evan-gershkovich-release.html"
  },
  {
    "text": "How Biden Persuaded Scholz to Release a Top Kremlin Assassin  — Close relationship between German, US leaders was key to deal  — Biden cites German concessions, Scholz sees solidarity with US  —  The historic prisoner swap that brought about the release of US journalist Evan Gershkovich … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-01/how-biden-persuaded-scholz-to-surrender-a-top-kremlin-assassin"
  },
  {
    "text": "Biden Disses Trump On Prisoner Swap: 'Why Didn't He Do It?'  —  CHECK THE RECORD  —  President Joe Biden took a swipe at former President Donald Trump during a press conference on Thursday after Trump needled Biden over his prisoner swap deal with Russian President Vladimir Putin.",
    "url": "https://www.thedailybeast.com/biden-disses-trump-on-prisoner-swap-why-didnt-he-do-it"
  },
  {
    "text": "Morning Report — Historic swap frees U.S. hostages from Russia  —  President Biden and Vice President Harris made their way late Thursday to the tarmac at Joint Base Andrews near Washington to welcome Americans who were wrongly imprisoned by Russia and freed as part of the largest prisoner swap negotiated since the Cold War.",
    "url": "https://thehill.com/homenews/morning-report/4807361-morning-report-historic-swap-frees-u-s-hostages-from-russia/"
  },
  {
    "text": "Kamala Harris' veepstakes races toward the finish line  —  The vetting team has met with several contenders as Harris prepares to pick a running mate in the next few days.  —  Kamala Harris is preparing for the final stage of selecting a running mate: face-to-face interviews.",
    "url": "https://www.politico.com/news/2024/08/01/kamala-harris-vp-search-00172401"
  },
  {
    "text": "Scoop: Kamala Harris' brother-in-law emerges as key campaign adviser … - But some Democratic advisers in close contact with the campaign worry West's prominent role could re-create the same family dynamics that at times caused unnecessary drama in her 2020 campaign.",
    "url": "https://www.axios.com/2024/08/01/kamala-harris-tony-west-president-campaign"
  },
  {
    "text": "Can Kamala Harris Rebuild the Democratic Coalition?  —  Early polling suggests she has made some progress since President Biden's exit.  —  With a little over three months until the presidential election, Kamala Harris inherited a Democratic coalition that was badly frayed.",
    "url": "https://www.nytimes.com/2024/08/02/upshot/kamala-harris-democrats.html"
  },
  {
    "text": "Trump's Racist Attack on Kamala Harris Was No Accident  —  Is it, perhaps, a sign that the Vice-President's swift rise in the polls has him panicked?  —  Spoiler alert: he meant it.  When Donald Trump claimed, on Wednesday afternoon, in a combative onstage interview at the National Association … ",
    "url": "https://www.newyorker.com/news/letter-from-bidens-washington/trumps-racist-attack-on-kamala-harris-was-no-accident"
  },
  {
    "text": "Trump hits back at Dem attacks: 'They're the weird ones'  —  “Nobody's ever called me weird.  I'm a lot of things, but weird I'm not,” Trump said.  —  After over a week of Vice President Kamala Harris and her surrogates calling Donald Trump and running mate JD Vance “weird,” the former president attempted to play an Uno reverse card.",
    "url": "https://www.politico.com/news/2024/08/01/trump-dem-attacks-weird-00172386"
  },
  {
    "text": "$10M cash withdrawal drove secret probe into whether Trump took money from Egypt  —  Political appointees rejected efforts to search for additional evidence investigators believed might provide answers, then closed the case.  —  This story is based partly on research that Davis and Leonnig conducted … ",
    "url": "https://www.washingtonpost.com/investigations/2024/08/02/trump-campaign-egypt-investigation/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyNTcxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzOTUzNTk5LCJpYXQiOjE3MjI1NzEyMDAsImp0aSI6IjRiNzI0ZGZiLWY2NDItNDQzZi04ZmNjLTBjNDYzOTQ3MGM5MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbnZlc3RpZ2F0aW9ucy8yMDI0LzA4LzAyL3RydW1wLWNhbXBhaWduLWVneXB0LWludmVzdGlnYXRpb24vIn0.ypaqtPM-b3YjnqwBgiZoYyFTfbHakuQf0APCEAvVDE4&itid=gfta"
  },
  {
    "text": "Republicans Want Someone Younger Than Donald Trump as President: New Poll  —  voters have said they would prefer a president who is younger than the 78-year-old former commander-in-chief.  —  In a YouGov poll conducted between July 25-29, 59 percent of  —  surveyed said they would prefer a president under the age of 75.",
    "url": "https://www.newsweek.com/donald-trump-too-old-age-2024-election-president-poll-1932983"
  },
  {
    "text": "Kamala Harris Now Leads Donald Trump in Seven National Polls  —  Kamala Harris is now leading her opponent Donald Trump in seven national polls.  —  The new polls show the presumptive Democratic nominee is leading the former president by between 1 and 4 points.  —  The vice president has the biggest lead in a",
    "url": "https://www.newsweek.com/kamala-harris-donald-trump-national-polls-1933639"
  },
  {
    "text": "What happened to JD Vance?  —  The 2014 version had a lot more to offer than the guy who now exemplifies the toxicity of Trumpism. … Americans have been waiting for decades, since the assassination of Sen. Robert F. Kennedy, for a political leader who offered the promise of bringing … ",
    "url": "https://www.publicnotice.co/p/jd-vance-what-happened-2014-2024-trumpism"
  },
  {
    "text": "JD Vance Is An Investor In A Far Right Video Platform Filled With Neo-Nazi Content  —  This is your TPM evening briefing.  —  Sen. J.D. Vance (R-OH) has been making headlines for his “rocky rollout” since being named former President Donald Trump's running mate last month.",
    "url": "https://talkingpointsmemo.com/where-things-stand/jd-vance-is-an-investor-in-a-far-right-video-platform-filled-with-neo-nazi-content"
  },
  {
    "text": "Scoop: Trump stalled Black journalists interview over fact-checking … - “[Trump's team] said, 'Well, can you not fact check? … - At the time, President Trump blamed the delay on audio problems.  — Lemon told Axios, “There were audio problems, but they were resolved very quickly.”",
    "url": "https://www.axios.com/2024/08/02/trump-nabj-fact-checking-black-journalists"
  },
  {
    "text": "Harris Campaign Says It Raised $310 Million in July, More Than Double Trump's Haul  —  In the seven days after President Biden stepped down as the presumptive Democratic nominee, the Harris campaign raked in $200 million.  —  Vice President Kamala Harris's campaign survived a brutal few weeks … ",
    "url": "https://www.nytimes.com/2024/08/02/us/politics/harris-campaign-fundraising-july.html?unlocked_article_code=1._00.r-ew.PCn68jTvNozl&smid=url-share"
  },
  {
    "text": "US adds 114K jobs in July, jobless rate rises to 4.3 percent  —  The U.S. added 114,000 jobs in July and the unemployment rate rose to 4.3 percent, according to data released Friday by the Labor Department.  —  Economists expected the U.S. to add 175,000 jobs and keep the jobless rate steady at 4.1 percent … ",
    "url": "https://thehill.com/business/4807399-july-jobs-report-unemployment/"
  },
  {
    "text": "Recount confirms Bob Good's loss after GOP rallies to oust one of their own  —  A recount on Thursday confirmed that state Sen. John McGuire beat Good in the June election by just a few hundred votes, according to The Associated Press.  —  Rep. Bob Good (R-Va.), the chair … ",
    "url": "https://www.politico.com/news/2024/08/01/recount-confirms-bob-goods-loss-after-gop-rallies-to-oust-one-of-their-own-00172424"
  },
  {
    "text": "U.S. prepares to counter Iranian attack on Israel within days, U.S. officials say … - Iranian Supreme Leader Ayatollah Ali Khamenei and other senior Iranian political and military officials said Iran is going to retaliate for Haniyeh's assassination.  — Hezbollah leader Hassan Nasrallah … ",
    "url": "https://www.axios.com/2024/08/01/us-iran-israel-attack-preparation"
  }
]