[
  {
    "text": "Mike Pence Says He Won't Endorse Donald Trump For President  —  This should come as “no surprise,” Trump's former vice president said.  —  Former Vice President Mike Pence confirmed Friday that he will not be endorsing Donald Trump for president.  —  “It should come as no surprise … ",
    "url": "https://www.huffpost.com/entry/mike-pence-not-endorsing-donald-trump-2024-election_n_65f4ab9de4b0b4d0b8995cbe"
  },
  {
    "text": "Pence says he ‘cannot in good conscience’ endorse Trump  —  Former Vice President Mike Pence on Friday said he “cannot in good conscience” endorse presumptive GOP nominee Donald Trump, arguing that Trump is pursuing an agenda that is “at odds with the conservative agenda.”",
    "url": "https://www.cnn.com/2024/03/15/politics/pence-will-not-endorse-trump/"
  },
  {
    "text": "Pence says he will not endorse Trump in 2024  —  The former vice president who served under Trump but has been critical of the former president after the Jan. 6, 2021, insurrection in which Pence was targeted, said Trump's agenda doesn't align with conservatives.",
    "url": "https://www.washingtonpost.com/politics/2024/03/15/pence-trump-no-endorsement-2024/"
  },
  {
    "text": "Pence declines to endorse Trump, won't back Biden  —  Former Vice President Mike Pence has declined to endorse his onetime running mate, former President Trump, in a bombshell announcement Friday.  —  Pence, whose relationship soured with Trump after the January 6 riots wherein the president faulted … ",
    "url": "https://www.foxnews.com/media/pence-declines-to-endorse-trump-wont-back-biden"
  },
  {
    "text": "Trump hush money trial postponed until mid-April, judge rules  —  Manhattan District Attorney Alvin Bragg had said he would support the trial being delayed 30 days, while Trump's legal team requested that it be postponed for 90 days.  —  The trial in the New York hush money case … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-hush-money-trial-briefly-postponed-april-judge-rules-rcna143612"
  },
  {
    "text": "Judge delays Trump's hush-money criminal trial 30 days, citing last-minute evidence dump  —  NEW YORK (AP) — A judge on Friday delayed former President Donald Trump's hush-money criminal trial until at least mid-April after his lawyers said they needed more time to sift through a profusion … ",
    "url": "https://apnews.com/article/trump-hush-money-criminal-trial-delay-8e41f4be00f0420056433d2381189df8"
  },
  {
    "text": "Justice Ginsburg's Family Decries Bestowing RBG Award on Elon Musk and Rupert Murdoch  —  The awards are being handed out by a foundation chaired by a Trump donor.  —  On Wednesday, the Dwight D. Opperman Foundation announced the 2024 recipients of the Justice Ruth Bader Ginsburg Leadership Award.",
    "url": "https://www.motherjones.com/politics/2024/03/justice-ginsburgs-family-decries-bestowing-rbg-award-on-elon-musk-and-rupert-murdoch/"
  },
  {
    "text": "Ginsburg family blasts plan to give RBG Award to Musk, Murdoch, others  —  The family of the late Ruth Bader Ginsburg and some of the Supreme Court justice's former colleagues have denounced this year's slate of honorees for an award that a philanthropic foundation bestows in the name of the liberal icon.",
    "url": "https://www.washingtonpost.com/style/power/2024/03/15/ruth-bader-ginsburg-award-backlash/"
  },
  {
    "text": "Mike Johnson Suddenly Seems Ready to Stick a Shiv in MAGA  —  Poor Mike Johnson is in quite a bind.  The House speaker simply doesn't have a governing majority: It is borderline impossible to pass anything with only Republican votes, because the hard-right MAGA bloc wants to thwart governing at all costs.",
    "url": "https://newrepublic.com/article/179861/mike-johnson-ukraine-aid-bill-shiv-maga"
  },
  {
    "text": "Nathan Wade resigns from Trump Georgia case following judge's ruling  —  ATLANTA — Either Fani Willis goes or Nathan Wade does - that was the ruling from Fulton County Superior Court Scott McAfee on Friday in the Georgia election interference case.  —  Channel 2 Action News confirms … ",
    "url": "https://www.wsbtv.com/news/local/atlanta/nathan-wade-resigns-trump-georgia-case-following-judges-ruling/MZV2BLXKW5GCBM6WLMMKILS67U/"
  },
  {
    "text": "Secret Service, Justice Dept locate person of interest in swatting attacks on DHS Secretary Mayorkas and other officials  —  Federal agents have located a person of interest in over 100 swatting calls, which included calls targeting  Homeland Security Secretary Alejandro Mayorkas … ",
    "url": "https://www.cbsnews.com/news/swatting-suspect-mayorkas-secret-service-justice-dept/"
  },
  {
    "text": "White House counsel urges House speaker to end GOP impeachment inquiry  —  The letter comes as the Republican investigation has stretched more than a year without producing clear evidence of wrongdoing  —  White House counsel Ed Siskel sent a letter Friday morning to House Speaker Mike Johnson … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/15/white-house-counsel-speaker-impeachment-inquiry/"
  },
  {
    "text": "2 Orange school board conservatives ousted by recalls with LGBTQ+ policies at the center  —  Voters in the city of Orange appear to have ousted two conservative school board members who had spearheaded policies widely opposed by advocates for LGBTQ+ youth in a recall election viewed … ",
    "url": "https://www.latimes.com/california/story/2024-03-15/orange-unified-school-board-members-who-embraced-culture-wars-are-ousted"
  },
  {
    "text": "How CrowdTangle predicted the future  —  Eight years after buying the data analysis tool CrowdTangle, and four years after it began exasperating the executives responsible for it, Meta said Thursday that it would shut down the tool on August 14.  —  CrowdTangle, a data analysis tool … ",
    "url": "https://www.platformer.news/meta-crowdtangle-shutdown-dsa-platform-transparency/"
  },
  {
    "text": "Kushner Developing Deals Overseas Even as His Father-in-Law Runs for President  —  Donald Trump's son-in-law, who was also a senior White House official, said he was close to finalizing real estate projects in Albania and Serbia.  —  Jared Kushner, the son-in-law of Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/03/15/us/politics/jared-kushner-pursuing-development-deals-in-albania-and-serbia.html"
  },
  {
    "text": "Supreme Court Narrowly Interprets Landmark Reduced Sentencing Law  —  The justices sided with the government in a case focused on who is eligible for shorter prison sentences under the bipartisan First Step Act passed in 2018.  —  The Supreme Court sided with the government on Friday … ",
    "url": "https://www.nytimes.com/2024/03/15/us/politics/supreme-court-sentencing-first-step-act.html"
  },
  {
    "text": "Lara Trump says she wants to hire QAnon conspiracy theorist Scott Presler to work for the RNC  —  Lara Trump, who was recently elected as co-chair to the Republican National Committee, said on March 14 that she is interested in hiring right-wing influencer, QAnon conspiracy theorist, and … ",
    "url": "https://www.mediamatters.org/lara-trump/lara-trump-says-she-wants-hire-qanon-conspiracy-theorist-scott-presler-work-rnc"
  },
  {
    "text": "Brazil's military leaders told police Bolsonaro was involved in plan to reverse 2022 election result  —  Top Brazilian military leaders declared to police that former President Jair Bolsonaro presented them a plan to reverse the results of the 2022 election he lost, but they refused and warned … ",
    "url": "https://apnews.com/article/bolsonaro-military-chiefs-testimonies-arrest-fb03d16461fab0d31846d630fb93acc1"
  },
  {
    "text": "GOP backtracks on closing community centers and sidetracking early-vote program  —  Officials said Friday that the shift in announced plans was a result of the fast pace of the takeover of the Republican National Committee at the start of the week  —  The Republican Party's new chairman … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/15/rnc-backtrack-cuts/"
  },
  {
    "text": "‘Squid Game’ actor O Yeong-su convicted of sexual harassment and given a suspended sentence  —  As he was leaving the court, O told reporters he planned to appeal against the decision.  —  SEOUL — South Korean actor O Yeong-su, who starred in the first season of the hit Netflix series … ",
    "url": "https://www.nbcnews.com/news/world/squid-game-actor-o-yeong-su-convicted-sexual-harassment-suspended-sent-rcna143595"
  }
]