[
  {
    "text": "Behind the Curtain: Top Dems now believe Biden will exit … - The president is being told that if he stays in, former President Trump could win in a landslide and wipe away Biden's legacy and Democrats' hopes in November. … - Democrats fully expect polls after the Republican National Convention … ",
    "url": "https://www.axios.com/2024/07/18/president-biden-drop-out-election-democrats"
  },
  {
    "text": "Pelosi privately told Biden polls show he cannot win and will take down the House; Biden responded with defensiveness  —  Former House Speaker Nancy Pelosi privately told President Joe Biden in a recent conversation that polling shows that the president cannot defeat Donald Trump and that Biden … ",
    "url": "https://www.cnn.com/2024/07/17/politics/nancy-pelosi-biden-conversation/"
  },
  {
    "text": "Obama tells allies Biden needs to seriously consider his viability  —  The former president, hugely influential in the party, has told associates that Biden's path to victory has significantly shrunk.  —  Former president Barack Obama has told allies in recent days that President Biden's path … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/18/obama-says-biden-must-consider-viability/"
  },
  {
    "text": "Playbook: The walls close in around Biden  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  For weeks, the Democratic Party has been paralyzed by uncertainty about whether President JOE BIDEN should stay atop the ticket or step aside.",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/18/the-walls-close-in-around-biden-00169335"
  },
  {
    "text": "Democratic delegates erupt over Biden's nomination in private chats  —  Messages shared between Democratic delegates and activists in California, the biggest and one of the bluest states, lay bare the infighting over their nominee's fitness for a presidential run.",
    "url": "https://www.politico.com/news/2024/07/17/california-democratic-delegates-private-chats-biden-00169210"
  },
  {
    "text": "July 2024 Swing State Polls  —  Trump Leads Biden in Swing States and National Poll as Biden's Support Declines  —  New polling conducted July 15-16 by Emerson College Polling and sponsored by Democrats for Next Generation finds former President Trump leading Biden in seven swing states and in a national poll.",
    "url": "https://emersoncollegepolling.com/july-2024-swing-state-polls/"
  },
  {
    "text": "The VP is clearly the stronger candidate  —  The case for Kamala Harris, from a former hater  —  I did not support selecting Kamala Harris as Joe Biden's running mate in 2020.  —  My reasons for this were pretty boring.  It's genuinely difficult to make it to the top of the political pyramid … ",
    "url": "https://www.slowboring.com/p/the-vp-is-clearly-the-stronger-candidate"
  },
  {
    "text": "Trump has given no official info about his medical care for days since an assassination attempt  —  Four days after a gunman's attempt to assassinate former President Donald Trump at a Pennsylvania rally, the public is still in the dark over the extent of his injuries, what treatment … ",
    "url": "https://apnews.com/article/trump-shooting-transparency-db2f4437237ad03d3b04b0b5f1573977"
  },
  {
    "text": "Project 2025 *is* the GOP platform  —  Don't let them fool you. … Project 2025 — the right-wing template for a second Trump term — is so exhaustively evil, so vast in scope, that it feels impossible to fully comprehend it.  —  However, as the GOP faithful gather in Milwaukee … ",
    "url": "https://www.publicnotice.co/p/project-2025-explained-2024-gop-platform"
  },
  {
    "text": "Biden Forgives $1.2 Billion in Student Loans in Latest Relief  — Debt assistance will help 35,000 public service workers  — Education Department has now forgiven $168.5 billion in debt  —  President Joe Biden canceled an additional $1.2 billion in student debt for public servants on Thursday … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-18/biden-forgives-1-2-billion-in-student-loans-in-latest-relief"
  },
  {
    "text": "Trump gunman seen as threat before attack but was lost in crowd  —  Donald Trump's would-be assassin was flagged as “suspicious” by the Secret Service up to an hour before he began shooting but was lost in the crowd, lawmakers have been told by law enforcement officials.",
    "url": "https://www.bbc.com/news/articles/c51ydg792ggo"
  },
  {
    "text": "Trump brags about ending Roe.  No one's talking about it in Milwaukee.  —  Heading into the final day of the Republican Party's first national gathering since the Supreme Court's landmark decision, the issue has barely received a passing mention.  —  MILWAUKEE — Overturning Roe … ",
    "url": "https://www.politico.com/news/2024/07/18/trump-abortion-rnc-00169304"
  },
  {
    "text": "Statement from Press Secretary Karine Jean-Pierre  —  Earlier today following his first event in Las Vegas, President Biden tested positive for COVID-19.  He is vaccinated and boosted and he is experiencing mild symptoms.  He will be returning to Delaware where he will self-isolate … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/07/17/statement-from-press-secretary-karine-jean-pierre-3/"
  },
  {
    "text": "Five Just Stop Oil activists receive record sentences for planning to block M25  —  Campaigners receive longest ever sentences for non-violent protest after being convicted of conspiracy to cause public nuisance  —  Five supporters of the Just Stop Oil climate campaign who conspired … ",
    "url": "https://www.theguardian.com/environment/article/2024/jul/18/five-just-stop-oil-supporters-jailed-over-protest-that-blocked-m25"
  },
  {
    "text": "J.D. Vance's radical plan to build a government of Trump loyalists  —  Donald Trump's allies have laid out sweeping plans to reshape the executive branch of the federal government if he is returned to power, plans that involve firing perhaps tens of thousands of career civil servants and replacing them with handpicked MAGA allies.",
    "url": "https://www.vox.com/politics/361455/jd-vance-trump-vice-president-rnc-speech"
  },
  {
    "text": "First Term  —  Is a  —  Warning  —  This week, Republicans have tried to rewrite the four years of Trump's presidency as a time of unparalleled peace, prosperity and tranquility: “the strongest economy in history,” as Senator Katie Britt of Alabama put it.  The difference between Trump and Biden?",
    "url": "https://www.nytimes.com/interactive/2024/07/18/opinion/trump-presidency-record.html"
  },
  {
    "text": "To his supporters, Trump is a martyred messiah, resurrected after crucifixion  —  His near assassination transformed Trump's theology, giving the decidedly earthly ex-president a powerful spiritual sheen  —  The attempted assassination of Donald Trump has transformed the theology of Trump.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/18/to-his-supporters-trump-is-a-martyred-messiah-resurrected-after-crucifixion"
  },
  {
    "text": "‘One screen, two movies’: Conflicting conspiracy theories emerge from Trump shooting  —  A former president is shot, the gunman quickly neutralized, and all of it is caught on camera.  But for those who don't believe their eyes, that's just the start of the story.",
    "url": "https://apnews.com/article/trump-assassination-attempt-x-biden-misinformation-bf345b7cd72cc8c243084fe6ba8fa53a"
  },
  {
    "text": "Democratic Sen. Bob Menendez tells allies he will resign after bribery conviction  —  The New Jersey lawmaker has faced calls to step down from fellow Democrats, including Gov. Phil Murphy, who will, appoint a senator to finish out Menendez's term.  —  WASHINGTON — Sen. Bob Menendez … ",
    "url": "https://www.nbcnews.com/politics/congress/democratic-sen-bob-menendez-tells-allies-will-resign-bribery-convictio-rcna116970"
  }
]