[
  {
    "text": "Trump's DOJ secretly obtained records of his FBI pick Kash Patel, lawmakers, staffers and media in leak investigation  —  The Justice Department secretly obtained phone records from two members of Congress and 43 staffers - including Kash Patel, President-elect Donald Trump's pick to lead the FBI … ",
    "url": "https://www.cnn.com/2024/12/10/politics/justice-department-spying-congress-patel-trump-ig-report"
  },
  {
    "text": "FBI Director Christopher Wray preparing to resign  —  FBI Director Christopher A. Wray plans to resign on or before Inauguration Day, The Washington Times has learned.  —  Mr. Wray is calling it quits because he doesn't want to get fired by President-elect Donald Trump … ",
    "url": "https://www.washingtontimes.com/news/2024/dec/9/christopher-wray-fbi-director-preparing-resign/"
  },
  {
    "text": "“President-elect immunity does not exist:” Prosecutors on Trump hush money case … - The New York attorney general's office also wrote in a letter dated Monday that there is “no merit” to the argument that Trump's appeal of his civil fraud judgment would impede his presidential duties.",
    "url": "https://www.axios.com/2024/12/10/trump-hush-money-presidential-immunity-alvin-bragg"
  },
  {
    "text": "Mitch McConnell falls during Senate Republican lunch  —  Incoming Senate GOP Leader John Thune says he's “fine.”  —  Senate Minority Leader Mitch McConnell accompanied by Senate Minority Whip John Thune takes a question from a reporter during a news conference following … ",
    "url": "https://abcnews.go.com/Politics/mitch-mcconnell-falls-senate-republican-lunch/story?id=116650005"
  },
  {
    "text": "McConnell falls and sprains wrist after GOP luncheon, colleague says he is ‘fine’  —  Senate Republican leader Mitch McConnell fell and sprained his wrist while walking out of a GOP luncheon on Tuesday, the latest in a series of medical incidents for him in recent years.",
    "url": "https://apnews.com/article/mcconnell-senate-fall-republican-8d58004d3f14c1995d83c11319d77d72"
  },
  {
    "text": "Exclusive: Luigi's Manifesto  —  I've obtained a copy of suspected killer Luigi Mangione's manifesto — the real one, not the forgery circulating online.  Major media outlets are also in possession of the document but have refused to publish it and not even articulated a reason why.",
    "url": "https://www.kenklippenstein.com/p/luigis-manifesto"
  },
  {
    "text": "The Memo: Social media sympathy for killing of health insurance CEO sparks pushback  —  The battle lines over the killing of UnitedHealthcare CEO Brian Thompson, and the ethics of the health care industry, are receiving additional scrutiny from Pennsylvania Gov. Josh Shapiro (D) … ",
    "url": "https://thehill.com/policy/healthcare/5033590-healthcare-industry-battles-thompson-murder/"
  },
  {
    "text": "Trump to nominate Kimberly Guilfoyle for ambassador to Greece  —  President-elect Donald Trump announced Monday he is nominating Kimberly Guilfoyle to be U.S. ambassador to Greece.  Guilfoyle, a former Fox News host-turned-political fundraiser, was dating Trump's eldest son, Donald Trump Jr.",
    "url": "https://www.cbsnews.com/news/trump-kimberly-guilfoyle-greece-ambassador/"
  },
  {
    "text": "Trump lawyers and aide hit with 10 additional felony charges in Wisconsin over 2020 fake electors  —  Wisconsin prosecutors filed 10 additional felony charges Tuesday against two attorneys and an aide to President-elect Donald Trump who advised Trump in 2020 as part of a plan … ",
    "url": "https://apnews.com/article/wisconsin-trump-fake-electors-5624cb3e441f6866da4f2dd452a902bc"
  },
  {
    "text": "‘Delusional’ AOC slammed for suggesting subway riders should be scared of Daniel Penny: ‘Utter stupidity’  —  Progressive Rep. Alexandria Ocasio-Cortez (D-NY) said New York City subway riders should be scared of Daniel Penny after he was found not guilty in the chokehold death of Jordan Neely … ",
    "url": "https://nypost.com/2024/12/10/us-news/aoc-suggests-subway-riders-should-be-scared-of-daniel-penny/"
  },
  {
    "text": "Eric Trump Promises the ‘Most Pro-Crypto President’ in History  —  Speaking at a Middle East conference, President-elect Donald J. Trump's son said his family had embraced cryptocurrency because some banks stopped doing business with them after Jan. 6.  —  Eric Trump flew across the world … ",
    "url": "https://www.nytimes.com/2024/12/10/us/politics/eric-trump-cryptocurrency-conference.html?unlocked_article_code=1.gU4.e9yv.zkrZWiaBWJHl&smid=url-share"
  },
  {
    "text": "President Biden says it was ‘stupid’ not to put name on COVID checks like Trump did  —  WASHINGTON ― President Joe Biden said Donald Trump will inherit the “strongest economy in modern history,” and warned the president-elect not to return to “trickle-down economics” in a legacy-focused speech Tuesday.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/12/10/biden-stupid-leave-name-off-covid-checks/76892475007/"
  },
  {
    "text": "Israel Says It Destroyed Syria's Navy, Part of Wave of Post-Assad Attacks  —  Israel says it is striking Syrian military sites to keep them out of “the hands of extremists.”  The rebels who toppled the Assad government began laying out their plans while rival groups fought fierce battles for territory.",
    "url": "https://www.nytimes.com/live/2024/12/10/world/syria-news-assad-rebels"
  },
  {
    "text": "Federal Judge Blocks $25 Billion Kroger-Albertsons Grocery Merger  —  The Federal Trade Commission notched a victory in its efforts against the supermarket merger, which it sought to block over concerns about harm to shoppers and workers.  —  The biggest grocery store merger in U.S. history … ",
    "url": "https://www.nytimes.com/2024/12/10/business/kroger-albertsons-merger-ftc.html"
  },
  {
    "text": "Kennedy's War on Corn Syrup Brings a Health Crusade to Trump Country  —  When Donald J. Trump said Robert F. Kennedy Jr. could “go wild” on health, he might not have expected his pick for health secretary doing battle against the president-elect's own voters.",
    "url": "https://www.nytimes.com/2024/12/10/us/politics/rfk-jr-corn-trump.html?unlocked_article_code=1.gU4.c-Ys.p9iO4T9CcUh9&smid=url-share"
  },
  {
    "text": "Florida lawmaker abruptly switches to GOP shortly after winning election as Democrat  —  “It is sad that she has elevated her own needs above the needs of her district,” Democrat says  —  Florida state Rep. Susan Valdes switched her party registration from Democrat to Republican on Monday … ",
    "url": "https://www.salon.com/2024/12/10/florida-lawmaker-abruptly-switches-to-shortly-after-winning-as-democrat/"
  },
  {
    "text": "Top Republicans split over strategy to move Trump's 2025 agenda  —  Incoming Senate GOP Leader John Thune wants to pass two bills: border and energy policy in one, and tax cuts in a second.  The House's top tax writer is pushing for one big package.  —  WASHINGTON — Top Republicans … ",
    "url": "https://www.nbcnews.com/politics/congress/top-republicans-split-strategy-move-trumps-2025-agenda-rcna183692"
  },
  {
    "text": "How Trump could try to deport immigrants to countries other than their own  —  President-elect Donald Trump is reportedly considering deporting some immigrants to countries other than their own.  If he tries to do so, it won't be the first time.  Like before, however, he would probably face legal challenges.",
    "url": "https://www.vox.com/politics/390533/trump-third-country-deportation-bahamas-panama-grenada-turks-caicos"
  },
  {
    "text": "Trump's Defense Pick Is Now Denying Things He Said on Tape  —  Pete Hegseth is hoping you'll forget he thinks women aren't suited for combat roles in the military.  Too bad he enthusiastically declared it on camera a little over a month ago.  —  The vitriolic television host … ",
    "url": "https://newrepublic.com/post/189208/donald-trump-defense-pete-hegseth-women-combat"
  },
  {
    "text": "Biden — addressing critics, voters and history — defends his economy  —  One month after voters rejected his party amid deep economic anxiety, Biden defends his economic legacy.  —  President Joe Biden offered a robust defense of his economic record on Tuesday in an impassioned speech aimed … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/10/biden-economy-record-legacy-election/"
  },
  {
    "text": "DOGE Heads Musk and Ramaswamy Signal Social Security Cuts Are Coming  —  Trump vowed to “not cut one penny” from Social Security, but his other statements and actions suggest that he plans to.",
    "url": "https://truthout.org/articles/doge-heads-musk-and-ramaswamy-signal-social-security-cuts-are-coming/"
  },
  {
    "text": "Sanders says next term is likely his last  —  Progressive icon was reelected for another six years in November.  —  Sen. Bernie Sanders, former presidential candidate and leader of the progressive movement in the United States for decades, said his term starting in January would likely be his last in an interview with POLITICO.",
    "url": "https://www.politico.com/news/2024/12/10/bernie-sanders-senate-term-00193608"
  },
  {
    "text": "Some Other America, One I Do Not Know  —  Some people are very upset about the public reaction to the assassination of UnitedHealthcare CEO Brian Thompson.  The killing has generated horror, but also mocking memes, a wave of hostility towards the healthcare industry, and rhetoric that stops barely short of calling the murder justified.",
    "url": "https://www.popehat.com/p/some-other-america-one-i-do-not-know"
  },
  {
    "text": "Incoming border czar Tom Homan promises mass deportation: ‘Going to start right here in Chicago’  —  Donald Trump's incoming border czar Tom Homan promised mass deportation at an event Monday, saying he'll start with Chicago migrants.  —  CHICAGO (WLS) — Incoming border czar Tom Homan showed … ",
    "url": "https://abc7chicago.com/post/donald-trump-immigration-incoming-border-czar-tom-homan-promises-mass-deportation-says-hell-start-chicago-migrants/15633535/"
  },
  {
    "text": "US Steel Drops as Biden Plans to Block Sale to Nippon Steel  — CFIUS panel is set to refer decision to Biden later this month  — Both companies likely to pursue litigation if deal is blocked  —  President Joe Biden plans to formally block the $14.1 billion sale of United States Steel Corp … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-10/biden-set-to-finally-kill-nippon-steel-s-proposed-takeover-of-us-steel?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczMzg2NDMwMSwiZXhwIjoxNzM0NDY5MTAxLCJhcnRpY2xlSWQiOiJTTzJXMjNEV1gyUFMwMCIsImJjb25uZWN0SWQiOiI1Q0UxNDZFN0UyMzA0RUM5OEIxOUI3MjU4M0NDNzM0MiJ9.1ETRZ8ZXVSyh2dUi7v1GQYxMJtxdJKTvXd34LiA00dY"
  },
  {
    "text": "White House Threatens Biden Veto of Bipartisan Bill to Add New Judges  —  The legislation would create more than 60 new federal court seats over the next decade, giving the Trump White House a first shot at filling dozens of new vacancies.  —  White House officials on Tuesday said President Biden … ",
    "url": "https://www.nytimes.com/2024/12/10/us/politics/biden-judges-veto-white-house.html"
  },
  {
    "text": "Postmaster general visibly covers his ears amid criticism from GOP lawmaker  —  Postmaster General Louis DeJoy covered his ears when faced with criticism from Rep. Rich McCormick (R-GA) over his handling of the U.S. Postal Service, a move the Republican mocked and emphasized after it happened.",
    "url": "https://www.washingtonexaminer.com/news/house/3256407/postmaster-general-visibly-covers-his-ears-amid-criticism-from-gop-lawmaker/"
  },
  {
    "text": "Scoop: RFK Jr. pushes his daughter-in-law for CIA deputy director … - President-elect Trump, who has signaled plans to try to overhaul U.S. intelligence agencies during his second term, has already named former intelligence director John Ratcliffe to lead the CIA.",
    "url": "https://www.axios.com/2024/12/10/rfk-jr-amaryllis-fox-cia-trump"
  },
  {
    "text": "New York AG Letitia James says she won't drop civil fraud case against Trump  —  Trump demanded James drop the case against him  —  New York Attorney General Letitia James said she will not drop the civil fraud case against President-elect Donald Trump as she waits for the appeal court decision … ",
    "url": "https://www.foxnews.com/politics/new-york-ag-letitia-james-says-she-wont-drop-civil-fraud-case-against-trump"
  }
]