[
  {
    "text": "Texas attorney general opens probe into Media Matters over report on X ads  —  Texas Attorney General Ken Paxton (R) said Monday that his office is opening an investigation into Media Matters for America over its recent reports accusing X, the platform formerly known as Twitter … ",
    "url": "https://thehill.com/policy/technology/4320745-texas-attorney-general-ken-paxton-opens-probe-media-matters-x-ads/"
  },
  {
    "text": "Elon Musk's X sues media watchdog Media Matters over report on pro-Nazi content on the social media site  —  After a devastating advertiser exodus last week involving some of the world's largest media companies, X owner Elon Musk is suing the progressive watchdog group Media Matters … ",
    "url": "https://www.cnn.com/2023/11/20/tech/x-sues-media-matters/"
  },
  {
    "text": "Far-right conspiracy theorists accused a 22-year-old Jewish man of being a neo-Nazi.  Then Elon Musk got involved  —  Ben Brody says his life was going fine.  He had just finished college, stayed out of trouble, and was prepping for law school.  Then, seemingly out of nowhere … ",
    "url": "https://www.cnn.com/2023/11/20/business/brody-musk-lawsuit-invs/"
  },
  {
    "text": "America's most unhinged, unelected official  —  Stephen Miller, the notorious advisor to former president Donald Trump, suggested on X yesterday that a “conservative state Attorney[] General” should pursue civil and criminal charges against Media Matters.  Miller claims that Media Matters committed … ",
    "url": "https://popular.info/p/americas-most-unhinged-unelected"
  },
  {
    "text": "Many now see Haley as Trump's top GOP challenger.  She faces hurdles ahead.  —  Jockeying in a tier below the former president has moved, with Haley surging into a distant second place  —  HOOKSETT, N.H. — Nikki Haley has in many ways pushed past Ron DeSantis to become the top alternative to Donald Trump … ",
    "url": "https://www.washingtonpost.com/elections/2023/11/21/haley-trump-desantis-republican-presidential/"
  },
  {
    "text": "Billionaires are lining up to fund Donald Trump's anti-democratic agenda  —  The more disturbing Trump's public proclamations become, the more US plutocrats seem to want him to win  —  As an ever-greater portion of the nation's total wealth goes to the top, it's hardly surprising that ever … ",
    "url": "https://www.theguardian.com/commentisfree/2023/nov/21/donald-trump-anti-democratic-agenda-billionaires-neofascism"
  },
  {
    "text": "The Trump Threat Is Growing.  Lawyers Must Rise to Meet This Moment.  —  American democracy, the Constitution and the rule of law are the righteous causes of our times, and the nation's legal profession is obligated to support them.  But with the acquiescence of the larger conservative legal movement … ",
    "url": "https://www.nytimes.com/2023/11/21/opinion/trump-lawyers-constitution-democracy.html"
  },
  {
    "text": "Israel-Hamas deal on hostage release and ceasefire is imminent, sources say  —  A deal between Israel and Hamas to free dozens of hostages and declare a multi-day ceasefire is imminent and could be announced by the Qatari mediators as soon as Tuesday, two sources with direct knowledge of the issue told Axios.",
    "url": "https://www.axios.com/2023/11/21/israel-hamas-hostage-ceasefire-deal-imminent"
  },
  {
    "text": "Tux-Wearing Christian Nationalists Laugh About Their Influence, Live From Mar-a-Lago  —  The pastor with whom Speaker Mike Johnson prayed to ward off God's judgment made the case for Christian dominion at Trump's Florida domain  —  CHRISTIAN NATIONALISTS WERE out in force at Mar-a-Lago on Friday night … ",
    "url": "https://www.rollingstone.com/politics/politics-features/christian-nationalists-influence-mar-a-lago-1234889682/"
  },
  {
    "text": "Matt Gaetz at 21% approval rating in Florida, poll says  —  A new poll shows U.S. Rep. Matt Gaetz is a polarizing figure in Florida, both in and outside of the Republican Party.  —  A poll from the Florida Atlantic University Mainstreet PolCom Lab released last week showed that 57% … ",
    "url": "https://www.pnj.com/story/news/politics/2023/11/21/congressman-matt-gaetz-at-21-approval-following-house-speaker-drama/71653429007/"
  },
  {
    "text": "House GOP's Biden impeachment effort heads into final stage  —  The conference plans to depose Hunter Biden in December and is working to tie up other threads before January — when advocates hope they can start moving toward a vote.  —  House Republicans are closing in on a make-or-break moment … ",
    "url": "https://www.politico.com/news/2023/11/21/house-republicans-biden-impeachment-00128154"
  },
  {
    "text": "Utah special congressional election sees GOP ex-House staffer face Democratic legislator  —  Republican Celeste Maloy and state Sen. Kathleen Riebe are competing to become the first woman in Utah's congressional delegation since 2019 and only the fifth in history.",
    "url": "https://www.nbcnews.com/politics/congress/utah-special-congressional-election-sees-gop-ex-house-staffer-face-dem-rcna126132"
  },
  {
    "text": "CFPB chief's warning: AI is a ‘natural oligopoly’ in the making  —  Director Rohit Chopra's comments came in the wake of the stunning ouster of OpenAI's co-founder and CEO Sam Altman.  —  Consumer Financial Protection Bureau Director Rohit Chopra is warning that the nature … ",
    "url": "https://www.politico.com/news/2023/11/21/cfpb-rohit-chopra-ai-warning-00128249"
  },
  {
    "text": "App payment confusion causes IRS to delay $600 sales reporting threshold — again  —  Taxpayers and gig workers who use apps such as Venmo and Paypal to make money selling personal goods and services don't have to worry about the new $600 threshold for reporting sales on form 1099-K to the IRS this year.",
    "url": "https://thehill.com/business/4320982-app-payment-irs-delay-sales-reporting-threshold/"
  },
  {
    "text": "North Carolina sued over new state Senate maps  —  The newly redrawn district boundaries for the North Carolina state Senate divide predominantly Black counties in a way that dilutes the power of Black residents, according to a lawsuit filed Monday.  —  The lawsuit — filed … ",
    "url": "https://thehill.com/homenews/state-watch/4320719-north-carolina-lawsuit-redrawn-house-maps/"
  },
  {
    "text": "Silicon Valley Congresswoman Anna Eshoo is retiring  —  For the first time in two decades, a Silicon Valley congressmember is poised to retire and shake up the South Bay's political landscape — with many local Democrats reportedly eyeing the seat.  —  Multiple sources in Sacramento … ",
    "url": "https://sanjosespotlight.com/silicon-valley-congresswoman-anna-eshoo-plans-to-retire/"
  },
  {
    "text": "Large military aircraft overshoots runway, ends up in Kaneohe Bay  —  HONOLULU (HawaiiNewsNow) - A large U.S. Navy aircraft ended up in shallow waters of Kaneohe Bay on Monday afternoon after overshooting the runway at Marine Corps Base Hawaii.  —  The incident happened about 1:57 p.m. when the P-8 Poseidon aircraft was landing.",
    "url": "https://www.hawaiinewsnow.com/2023/11/21/emergency-crews-responding-after-reported-downed-military-aircraft-kaneohe-bay/"
  }
]