[
  {
    "text": "The Trump Administration Accidentally Texted Me Its War Plans  —  The world found out shortly before 2 p.m. eastern time on March 15 that the United States was bombing Houthi targets across Yemen.  —  I, however, knew two hours before the first bombs exploded that the attack might be coming.",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/trump-administration-accidentally-texted-me-its-war-plans/682151/?gift=kPTlqn0J1iP9IBZcsdI5IVJpB2t9BYyxpzU4sooa69M&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "‘Amateur hour’: Washington aghast at Trump administration's war plan group chat  —  One Democratic lawmaker also called for immediate hearings on the incident.  —  Members of Congress and national security staffers were stunned Monday by a bombshell report that top Trump administration officials … ",
    "url": "https://www.politico.com/news/2025/03/24/hegseth-national-security-group-chat-atlantic-reaction-00244983"
  },
  {
    "text": "“Heads should roll”: Congress erupts over stunning Trump admin leak  —  Members of Congress in both parties exploded in anger Monday after the editor-in-chief of The Atlantic revealed he was inadvertently included in a highly-sensitive Trump administration Signal chat on airstrikes in Yemen.",
    "url": "https://www.axios.com/2025/03/24/atlantic-yemen-signal-hegseth-jeffrey-goldberg"
  },
  {
    "text": "Fox's Brian Kilmeade: “It's not practical to think that we can do due process on 8 million people”  —  Co-host Lawrence Jones: Constitutional rights “are afforded to illegals in this country.  We should revisit that.”",
    "url": "https://www.mediamatters.org/brian-kilmeade/foxs-brian-kilmeade-its-not-practical-think-we-can-do-due-process-8-million-people"
  },
  {
    "text": "Why DOGE is struggling to find fraud in Social Security  —  Claims of massive problems by Elon Musk and President Trump are at odds with the agency's audits and reports.  —  Just now  —  Elon Musk put a big target on the Social Security Administration in the first weeks of the Trump administration … ",
    "url": "https://www.washingtonpost.com/business/2025/03/24/social-security-fraud-doge-cuts-dead/"
  },
  {
    "text": "Social Security: A Time for Outrage  —  Trump's policies attack his own base — but who will tell them?  —  Donald Trump is often described as a “populist.”  Yet his administration is stuffed with wealthy men who are clueless about how the other 99.99 percent lives, while his policies involve undermining … ",
    "url": "https://paulkrugman.substack.com/p/social-security-a-time-for-outrage"
  },
  {
    "text": "Trump demands Colorado take down ‘purposefully distorted’ painting  —  President Trump is demanding that Colorado take down it's “purposefully distorted” painting of him hanging in the State Capitol.  —  “Nobody likes a bad picture or painting of themselves, but the one in Colorado … ",
    "url": "https://thehill.com/homenews/state-watch/5210127-trump-demands-colorado-take-down-purposefully-distorted-painting/"
  },
  {
    "text": "Behind the Curtain: Dems' dark, deep hole  —  Top Democrats tell us their party is in its deepest hole in nearly 50 years — and they fear things could actually get worse:  — The party has its lowest favorability ever.  — No popular national leader to help improve it.",
    "url": "https://www.axios.com/2025/03/24/democrats-popularity-crisis-trump-elections"
  },
  {
    "text": "Anger in Greenland over Usha Vance and Mike Waltz's planned visit this week  —  Greenland's prime minister says move is ‘demonstration of power’ and accuses US of interfering in its political affairs  —  Greenland's prime minister, Múte B Egede, has called for the international community … ",
    "url": "https://www.theguardian.com/world/2025/mar/24/greenland-usha-vance-mike-waltz-visit-anger"
  },
  {
    "text": "Trump's Moves on Greenland Appear to Be Backfiring  —  The Greenlandic government is calling an upcoming visit by Trump officials “aggressive,” pushing the island further from the United States.  —  For more than 150 years, U.S. officials have repeatedly wanted, as President Trump puts it, to “get” Greenland.",
    "url": "https://www.nytimes.com/2025/03/24/world/europe/trump-greenland-us.html"
  },
  {
    "text": "‘We Are in an Emergency’: Progressive TikTok Star Launches Bid to Unseat Old-Guard Dem  —  The Democratic district where Kat Abughazaleh is running hasn't had a competitive primary in decades  —  Illinois 9th District has only been represented by two people since 1965 … ",
    "url": "https://www.rollingstone.com/politics/politics-features/kat-abughazaleh-congress-1235301996/"
  },
  {
    "text": "Trump says any country buying Venezuelan oil will face a 25% tariff  —  President Donald Trump said Monday that he will impose tariffs of 25% on any nation that purchases oil from Venezuela.  —  “Venezuela has been very hostile to the United States and the Freedoms which we espouse.",
    "url": "https://cnn.com/2025/03/24/business/trump-venezuela-oil-tariffs"
  },
  {
    "text": "Judge keeps block on Trump gang deportations, says they face ‘torture, beatings’ in El Salvador  —  An appeals court is set to weigh President Trump's use of the Alien Enemies Act.  —  Alleged members of the Venezuelan criminal organization Tren de Aragua who were deported by the U.S. government … ",
    "url": "https://abcnews.go.com/US/appeals-court-hear-arguments-deportation-alleged-venezuelan-gang/story?id=120094673"
  },
  {
    "text": "Trump's Most Dangerous Enabler Is Not Who You Think It Is  —  Who is President Donald Trump's most dangerous enabler?  As his second term got underway, it initially appeared that this coveted title might fall to FBI Director Kash Patel, who'd vowed to investigate Trump's enemies.",
    "url": "https://newrepublic.com/article/193064/trump-dangerous-enabler-marco-rubio"
  },
  {
    "text": "23andMe files for bankruptcy, Anne Wojcicki steps down as CEO … Embattled genetic testing company 23andMe, once valued at $6 billion, filed for Chapter 11 bankruptcy protection in Missouri federal court on Sunday night.  —  The company's CEO, Anne Wojcicki, has resigned from her role … ",
    "url": "https://www.cnbc.com/2025/03/24/23andme-files-for-bankruptcy-anne-wojcicki-steps-down-as-ceo.html"
  },
  {
    "text": "Trump to nominate Susan Monarez for CDC director, elevating from acting role, sources say  —  President Trump has decided to pick Dr. Susan Monarez to be the new nominee to head the Centers for Disease Control and Prevention, sources familiar with the decision tell CBS News … ",
    "url": "https://www.cbsnews.com/news/susan-monarez-cdc-director-nominee-trump/"
  },
  {
    "text": "Trump administration asks Supreme Court to allow mass firings of probationary workers  —  The appeal is part of a nascent effort by the Trump administration to press the Supreme Court to rein in district court judges.  —  The Trump administration asked the Supreme Court on Monday to allow … ",
    "url": "https://www.politico.com/news/2025/03/24/trump-supreme-court-fired-probationary-workers-00244890"
  },
  {
    "text": "Why Charles Schumer could be in trouble  —  Polling shows the Senate Democratic leader is in a historically bad position for a party leader, as some call to replace him.  —  Just now  —  To lead your party in either the House or the Senate is to consent to being disliked.",
    "url": "https://www.washingtonpost.com/politics/2025/03/24/schumer-senate-polling-democrats-trump/"
  },
  {
    "text": "Man charged with assault at Tesla dealership after driving car at protesters  —  The protest was one of several across the country in opposition to Tesla founder Elon Musk, who has been slashing government costs and firing thousands of federal workers.  —  A man was arrested and charged … ",
    "url": "https://www.nbcnews.com/news/us-news/man-charged-assault-tesla-dealership-driving-car-protesters-rcna197746"
  },
  {
    "text": "Trump appoints Alina Habba as US attorney for New Jersey  —  Habba served as Trump's personal attorney before becoming White House counselor.  —  Counselor to the President Alina Habba speaks to reporters outside the West Wing at the White House, Mar. 17, 2025, in Washington.",
    "url": "https://abcnews.go.com/Politics/trump-appoints-alina-habba-us-attorney-new-jersey/story?id=120099632"
  },
  {
    "text": "Tesla's Europe sales collapse as anti-Musk backlash grows  —  To add insult to injury, Chinese EVs are surging.  —  Tesla's downward spiral is turning into a rout, with its share of European electric car sales falling by 58 percent in the first two months of this year … ",
    "url": "https://www.politico.eu/article/teslas-europe-sales-collapse-by-over-half-while-chinese-evs-rise/"
  },
  {
    "text": "How to Think (and Act) Like a Dissident Movement  —  We had a good show in Phoenix and during our conversation something clicked for me that I want to unpack today.  —  I'm leaving this edition unlocked.  I hope you'll share it.  And if you're not a member of Bulwark+ yet, I hope you'll consider joining today.",
    "url": "https://www.thebulwark.com/p/how-to-think-and-act-like-a-dissident-in-trumps-america"
  },
  {
    "text": "Gulf of Fear  —  When news anchors tiptoe around the name Gulf of Mexico, it's not just semantics—it's a glimpse at how the press starts to flinch under political pressure.  —  In China, Taiwan doesn't exist—at least not as a country.  On official maps, it's a province.",
    "url": "https://www.status.news/p/gulf-of-mexico-tv-news-networks"
  },
  {
    "text": "Supreme Court declines to hear challenge to landmark press freedom case  —  The Supreme Court on Monday declined to hear a case seeking to challenge the 1964 precedent that protects news outlets from litigation for publishing critical information about public figures.",
    "url": "https://www.axios.com/2025/03/24/supreme-court-nyt-sullivan-press-freedom-steve-wynn"
  },
  {
    "text": "Lobbyist And Government Contractor Bought JD Vance's Home For $170,000 Over Asking Price  —  A government contractor and lobbyist who served in President Donald Trump's first administration bought Vice President JD Vance's Virginia home in an above-market deal, a sale his spokesperson says was based on the market.",
    "url": "https://www.forbes.com/sites/zacheverson/2025/03/24/jd-vance-house-sale-government-contractor-lobbyist-trump/"
  },
  {
    "text": "VICTORY: Federal court blocks Texas A&M's unconstitutional drag ban  —  A federal judge today upheld the First Amendment rights of a Texas A&M student group by blocking an attempt by officials to prohibit the group's upcoming drag show on the College Station campus.",
    "url": "https://www.thefire.org/news/victory-federal-court-blocks-texas-ams-unconstitutional-drag-ban"
  },
  {
    "text": "‘Not how this works’: The GOP agenda is stuck amid House vs. Senate infighting  —  To show quick progress, lawmakers will have to make a host of difficult decisions in the coming weeks.  —  Congressional Republicans left Washington riding high after their big victory on government spending.",
    "url": "https://www.politico.com/news/2025/03/24/trump-agenda-stuck-congress-00242977"
  }
]