[
  {
    "text": "Six Short Thoughts on the Most Insane Trump Story of All Time  —  Trump's “Team of Amateurs” Screwed Up in the Most Hilarious (and Troublesome) Way  —  This afternoon, just before 1 pm ET, The Atlantic posted what is, hands down, the wildest and most insane story I have ever read about US national security … ",
    "url": "https://www.doomsdayscenario.co/p/six-short-thoughts-on-the-most-insane-trump-story-of-all-time"
  },
  {
    "text": "Waltz's future in doubt following accidental war plan leak  —  “You can't have recklessness as the national security adviser,” one official said.  —  The stunning revelation that top administration officials accidentally included a reporter in a group chat discussing war plans … ",
    "url": "https://www.politico.com/news/2025/03/24/mike-waltz-signal-chat-resign-00246541"
  },
  {
    "text": "Trump stands by national security adviser despite leaked military plans, saying mishap had ‘no impact’ on Yemen strikes  —  “Michael Waltz has learned a lesson, and he's a good man,” President Donald Trump said of his national security adviser in a Tuesday phone interview with NBC News.",
    "url": "https://www.nbcnews.com/politics/white-house/trump-stands-national-security-adviser-leaked-military-plans-saying-mi-rcna197944"
  },
  {
    "text": "If Pete Hegseth Had Any Honor, He Would Resign  —  I don't know how Pete Hegseth can look service members in the eye.  He's just blown his credibility as a military leader.  —  On Monday, The Atlantic's Jeffrey Goldberg published one of the most extraordinary stories I've ever read.",
    "url": "https://www.nytimes.com/2025/03/24/opinion/atlantic-hegseth-vance-houthis.html?unlocked_article_code=1.6k4.PLfr.Gdy7mk57gGG9&smid=url-share"
  },
  {
    "text": "A Conversation With Jeffrey Goldberg About His Extraordinary Scoop  —  How The Atlantic's editor in chief found himself in a group chat with Trump-administration officials who were planning an attack on Yemen  —  The Trump administration has provided many jaw-dropping moments … ",
    "url": "https://www.theatlantic.com/newsletters/archive/2025/03/jeffrey-goldberg-group-chat-military-houthi-yemen/682160/?gift=49wmX9XxesaxFXKJmFp0PiUM0jF-UVSY5Pe5ceBgrPY&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Kaine & Colleagues Demand Answers about Trump Cabinet Officials' Use of Unsecured Group Chat for Military Planning  —  WASHINGTON, D.C. - Today, U.S. Senator Tim Kaine (D-VA), a member of the Senate Armed Services and Foreign Relations Committees, and 13 of his Senate colleagues sent a letter … ",
    "url": "https://www.kaine.senate.gov/press-releases/kaine-and-colleagues-demand-answers-about-trump-cabinet-officials-use-of-unsecured-group-chat-for-military-planning"
  },
  {
    "text": "White House defiant after messaging fiasco with The Atlantic  —  Trump administration true believers are closing ranks to try to protect top national security officials from being pushed out over Monday's Signal scandal, insiders tell Axios.  — Why it matters: Democrats and critics … ",
    "url": "https://www.axios.com/2025/03/25/trump-administration-atlantic-houthi-war-messages"
  },
  {
    "text": "Trump Officials in Signal Fiasco Attended Secret Mar-a-Lago Dinner Shortly After Celebrating Bombing  —  Trump officials accidentally invited the editor-in-chief of The Atlantic to their Signal group chat.  Hours after bombs dropped on Yemen, they partied at a $1-million-per-seat Mar-a-Lago dinner.",
    "url": "https://www.wired.com/story/trump-officials-signal-chat-candlelight-dinner-mar-a-lago-yemen/"
  },
  {
    "text": "Watch live: Gabbard, Patel, Ratcliffe testify at global threats hearing  —  National Intelligence Director Tulsi Gabbard, FBI Director Kash Patel and CIA Director John Ratcliffe will testify Tuesday before the Senate Intelligence Committee at a public hearing on global threats facing the United States.",
    "url": "https://thehill.com/policy/national-security/5212193-watch-live-gabbard-patel-ratcliffe-testify-on-global-threats/"
  },
  {
    "text": "Watch: Intelligence leaders testify before Congress, fresh off the group chat fiasco  —  As fallout from the Signal scandal continues, the leaders of several intelligence agencies — some of whom were part of the group chat that inadvertently shared war plans with a journalist — are set to testify before Congress this week.",
    "url": "https://www.npr.org/2025/03/25/nx-s1-5339484/signal-war-plans-congress"
  },
  {
    "text": "Trump administration live updates: Intelligence officials to face Senate questions about journalist's inclusion on military strikes chat  —  President Donald Trump stood by his national security adviser after the group chat mishap. … Senate Intelligence Chairman Tom Cotton doesn't mention leak of military plans in opening remarks",
    "url": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-administration-hegseth-ukraine-immigration-musk-live-updates-rcna197445"
  },
  {
    "text": "Long waits, waves of calls, website crashes: Social Security is breaking down  —  A flood of cuts led by Elon Musk has sent the agency into chaos as a new commissioner prepares to take charge.",
    "url": "https://www.washingtonpost.com/politics/2025/03/25/social-security-phones-doge-cuts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyODc1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0MjU3NTk5LCJpYXQiOjE3NDI4NzUyMDAsImp0aSI6IjFkMDMzZWUyLWQ5ZTItNDdjNS05OWY4LTk1NmE1YmVlMGU1NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI1L3NvY2lhbC1zZWN1cml0eS1waG9uZXMtZG9nZS1jdXRzLyJ9.r-0WQpn_MpOALvoIcQHovmsrG46R2HoKXKyTK8lg0CY&itid=gfta"
  },
  {
    "text": "Social Security, Buffeted by Turmoil, Awaits a New Leader … Frank Bisignano, a Wall Street veteran, will face Congress this week as President Trump's pick to lead the Social Security Administration.Joe Buglewicz/Bloomberg  —  When the Wall Street veteran Frank Bisignano goes before Congress … ",
    "url": "https://www.nytimes.com/2025/03/24/us/politics/frank-bisignano-social-security-upheaval.html?unlocked_article_code=1.6U4.dAMP.HSI4FQ8JtcTl"
  },
  {
    "text": "Social Security rushing service cuts at White House request, sources say  —  The Social Security Administration is rushing cuts to phone services at the White House's request, the agency's acting commissioner told Social Security advocates in a meeting on Monday, two sources who attended tell Axios.",
    "url": "https://www.axios.com/2025/03/24/social-security-cuts-doge"
  },
  {
    "text": "Law firms refuse to represent Trump opponents in the wake of his attacks  —  The result is an extraordinary threat to constitutional rights of due process and legal representation and a far weaker effort to challenge Trump's actions in court than during his first term.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/03/25/trump-law-firms/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyODc1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0MjU3NTk5LCJpYXQiOjE3NDI4NzUyMDAsImp0aSI6Ijc1MzFjOGI2LTU2ODItNDU0NC1iMzNjLWIxNDQwOWU3MGEyZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI1L3RydW1wLWxhdy1maXJtcy8ifQ.ihgngGFFkV8B5ErBReXHfw_0te5Zm494nb87SWDPKJk&itid=gfta"
  },
  {
    "text": "They Are America's Most Powerful Law Firms.  Their Silence Is Deafening.  —  In his chaotic attempt to dismantle democratic governance, redefine citizenship and cast aside fundamental rights of speech and due process, President Trump has all but declared war on one of the most effective forces … ",
    "url": "https://www.nytimes.com/2025/03/25/opinion/trump-law-firms.html"
  },
  {
    "text": "Danish Leader Raps US for ‘Unacceptable Pressure’ on Greenland  — Premier Frederiksen comments on planned visit by US officials  — Usha Vance to lead US delegation on trip to island on Thursday  —  A planned visit by US officials to Greenland this week is putting “unacceptable pressure” … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-25/danish-leader-raps-us-for-unacceptable-pressure-on-greenland"
  },
  {
    "text": "As Trump's Policies Worry Scientists, France and Others Put Out a Welcome Mat  —  European universities have begun recruiting researchers who lost their jobs in the administration's cost-cutting efforts, or are anxious over perceived threats to academic freedom.",
    "url": "https://www.nytimes.com/2025/03/25/europe-trump-science-research.html"
  },
  {
    "text": "Clock ticks on Trump and GOP's ‘big, beautiful’ bill on taxes  —  Economic turmoil from tariffs could push Republicans to move faster on budget legislation.  —  Just now  —  As President Donald Trump's tariffs roil the U.S. and global economies, lawmakers returned to Washington late Monday under … ",
    "url": "https://www.washingtonpost.com/business/2025/03/25/trump-tax-cuts-tariffs-economy/"
  },
  {
    "text": "A Rising Democratic Star Is Ready for New Leadership — Without Chuck Schumer  —  Michigan Democrat Mallory McMorrow says it's time for a new generation to take on Trump.  —  Mallory McMorrow doesn't claim to have all the answers for the Democratic Party.  But as the 38-year-old Michigan Democrat gears … ",
    "url": "https://www.politico.com/news/magazine/2025/03/25/mallory-mcmorrow-michigan-senate-chuck-schumer-00246369"
  },
  {
    "text": "MAGA Influencers May Have Been Paid to Break With RFK  —  Secret cash flies in the MAGA soda wars  —  IF YOU'VE EVER BEEN READING YOUR social media feed and suddenly noticed that conservative personalities have latched on to some obscure issue they've never cared about before … ",
    "url": "https://www.thebulwark.com/p/maga-influencers-break-with-rfk-soda-payola-scandal-influenceable-atlantic"
  },
  {
    "text": "Trump's portrait to be taken down at Colorado Capitol after president claimed it was ‘distorted’  —  A painting of Donald Trump hanging with other presidential portraits at the Colorado state Capitol will be taken down after Trump claimed that his was “purposefully distorted,” according to a letter obtained by The Associated Press.",
    "url": "https://apnews.com/article/trump-portrait-colorado-capitol-president-2f60271ddd58d979627ec5d2cd5dea89"
  },
  {
    "text": "USPS chief Louis DeJoy resigns as Trump eyes overhauling mail agency  —  The postmaster general had said in February that he would stay on until a successor was chosen.  —  U.S. Postmaster General Louis DeJoy will resign at the end of the day Monday, concluding a five-year tenure that began … ",
    "url": "https://www.washingtonpost.com/business/2025/03/24/louis-dejoy-steps-down-usps-chief/"
  },
  {
    "text": "Columbia Student Hunted by ICE Sues to Prevent Deportation  —  Yunseo Chung, a legal permanent resident who has lived in the U.S. since she was 7, participated in pro-Palestinian demonstrations.  Immigration agents visited residences looking for her.  —  A 21-year-old Columbia University student … ",
    "url": "https://www.nytimes.com/2025/03/24/nyregion/columbia-student-ice-suit-yunseo-chung.html?unlocked_article_code=1.6U4.Yj1G.FUi0xl3HHpi2&smid=url-share"
  },
  {
    "text": "Bubble Trouble  —  An AI bubble threatens Silicon Valley, and all of us. … The week of Donald Trump's inauguration, Sam Altman, the CEO of OpenAI, stood tall next to the president as he made a dramatic announcement: the launch of Project Stargate, a $500 billion supercluster in the rolling plains … ",
    "url": "https://prospect.org/power/2025-03-25-bubble-trouble-ai-threat/"
  },
  {
    "text": "Oscar-winning Palestinian director is attacked by Israeli settlers and detained by the army  —  Israeli settlers beat up one of the Palestinian co-directors of the Oscar-winning documentary film “ No Other Land ” on Monday in the occupied West Bank before he was detained by the Israeli military … ",
    "url": "https://apnews.com/article/no-other-land-oscar-israel-palestinians-084c63f33e748a3279646759e9b705c2"
  }
]