[
  {
    "text": "Gaetz, Gabbard and Hegseth are unqualified — Senate Republicans should reject them  —  President-elect Donald Trump has nominated three political hacks to highly sensitive and important federal positions: former Rep. Matt Gaetz (R-Fla.) as attorney general, former Rep. Tulsi Gabbard (D-Hawaii) … ",
    "url": "https://thehill.com/opinion/campaign/4996058-gaetz-gabbard-and-hegseth-are-unqualified-senate-republicans-should-reject-them/"
  },
  {
    "text": "Senate Republicans deliver a message to Trump: Gaetz's confirmation is in jeopardy  —  They're privately hoping Trump doesn't make them walk the plank.  —  Numerous Republican lawmakers told Donald Trump and his team that they believe his pick to be attorney general, controversial Rep. Matt Gaetz … ",
    "url": "https://www.politico.com/news/2024/11/19/senate-republicans-matt-gaetz-attorney-general-00190332"
  },
  {
    "text": "Gaetz May Not Be Confirmed, Trump Admits.  He's Pushing Him and Others Anyway.  —  The president-elect is taking a flood-the-zone approach to his cabinet nominations, betting that the Senate won't dare to turn them all down.  —  In his private conversations over the past few days … ",
    "url": "https://www.nytimes.com/2024/11/18/us/politics/trump-cabinet.html"
  },
  {
    "text": "Hacker Is Said to Have Gained Access to File With Damaging Testimony About Gaetz  —  The computer file is said to contain testimony from the woman who said she had sex with Matt Gaetz, President-elect Donald Trump's choice to be attorney general, when she was 17.",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/matt-gaetz-hack-testimony.html?unlocked_article_code=1.bE4.f2SX.A-EoaFu8nQma&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Transition Live Updates: Hacker Is Said to Have Obtained Damaging Testimony About Gaetz  —  President-elect Donald J. Trump's attorney general candidate, Matt Gaetz, was investigated, but not charged, with having sex with a 17-year-old girl.  The computer file included testimony from the girl … ",
    "url": "https://www.nytimes.com/live/2024/11/19/us/trump-news-live-updates"
  },
  {
    "text": "‘Morning Joe’ meeting with Trump was driven by fears of retribution from incoming administration, sources say  —  New York CNN  —  “Morning Joe” co-hosts Joe Scarborough and Mika Brzezinski announced Monday, in dramatic fashion, that they went to Mar-a-Lago last week for a fence-mending meeting with President-elect Donald Trump.",
    "url": "https://www.cnn.com/2024/11/19/media/morning-joe-trump-mar-a-lago-meeting-fears/"
  },
  {
    "text": "Behind the Mar-a-Lago meeting  —  Joe Scarborough and Mika Brzezinski's fence-mending meeting with President-elect Donald Trump has the media world buzzing.  Now I have some new reporting to share about why it happened.  —  Yesterday, as outraged “Morning Joe” fans registered their objections … ",
    "url": "https://view.newsletters.cnn.com/messages/17320243327424fa19cf3ca3d/raw"
  },
  {
    "text": "Ukraine fires first US-made missile into Russia: WW3 fears as Kremlin threatens ‘nuclear response’ if long-range Western weapons are used on its territory  — Ukrainian officials confirmed the use of ATACMS on Russian soil for the first time  — Comes as Kremlin said its updated nuclear doctrine allowed a ‘nuclear response’",
    "url": "https://www.dailymail.co.uk/news/article-14100327/Ukraine-fires-missile-Russia-WW3-fears-Kremlin-threatens-nuclear-response-long-range-Western-weapons-used-territory.html"
  },
  {
    "text": "Republican bathroom bill targets Congress's first transgender member  —  South Carolina Republican Nancy Mace introduces bill two months before Sarah McBride is to be sworn in  —  After Delaware elected the first ever openly transgender member of Congress earlier this month … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/19/sarah-mcbride-congress-bathroom-bill-transgender"
  },
  {
    "text": "Johnson pressured by GOP firebrands on trans bathroom access … - Mace told Axios on Tuesday morning that Johnson “said to me last night that he would include it in House Rules.”  — But Johnson stopped short of making that commitment at a press conference, telling reporters, “We're not going to address the plans on any of that.”",
    "url": "https://www.axios.com/2024/11/19/mike-johnson-mace-mtg-mcbride-bathroom"
  },
  {
    "text": "The law is clear on birthright citizenship.  Can Trump end it anyway?  —  Ending birthright citizenship has been on President-elect Donald Trump's wish list for years, and he's pledged to kill it once and for all in his next term.  But ending it may not be as easy as he's promised.",
    "url": "https://www.vox.com/policy/386094/birthright-citizenship-trump-2024-immigration"
  },
  {
    "text": "Why House Democrats stayed the course with their leaders  —  Despite coming up short in their fight for the majority, House Democrats aren't tossing their leaders aside.  The caucus opted to keep their top slate of leaders in Tuesday's party elections, with every single top Democratic leader reelected without opposition.",
    "url": "https://www.politico.com/live-updates/2024/11/19/congress/house-dem-leaders-jeffries-clark-aguilar-minority-00190394"
  },
  {
    "text": "RFK Jr. is a massive public health threat  —  Dems like Jared Polis shouldn't pretend pretend otherwise.  —  ∙ Paid … Donald Trump, in his vacuous orange wisdom, has nominated vaccine denier, crank, and champion of disease Robert F. Kennedy Jr. to be the Secretary of Health and Human Services (HHS).",
    "url": "https://www.publicnotice.co/p/rfk-jr-public-health-threat-vaccines"
  },
  {
    "text": "Trump's Nov. 26 Hush Money Sentencing Called Off, Court Says  — Sentencing status updated on court records without explanation  — DA Bragg faces deadline to tell court how case should proceed  —  Donald Trump's Nov. 26 sentencing in his New York hush money case was adjourned … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-19/trump-s-nov-26-hush-money-sentencing-adjourned-court-says"
  },
  {
    "text": "Trump Defies the #MeToo Movement With Cabinet Picks Facing Accusations  —  Donald J. Trump, who was found liable for sexual abuse last year, appears determined to force a fight over the role of such allegations in society.  —  When he takes the oath of office in January … ",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/trump-women-metoo.html"
  },
  {
    "text": "Sen. Thom Tillis Faces an Early Trump Loyalty Test … Calen Razor and  Alex Roarty  — Copy  —  Donald Trump's controversial Cabinet selections are already making life difficult for Republican senators.  —  No one should know that better than Thom Tillis.",
    "url": "https://www.notus.org/congress/sen-thom-tillis-trump-loyalty-test-2026"
  },
  {
    "text": "Leak it like Sam Alito  —  What is obviously a very damning report about Matt Gaetz is now available for everyone on the Ethics Committee to view: … Guest's claims to be free of influence from leadership are the antithesis of credible.  But it shouldn't matter.",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/11/leak-it-like-sam-alito"
  },
  {
    "text": "Elon Musk Asked People to Upload Their Health Data.  X Users Obliged.  —  Privacy experts cringed when people started feeding their medical images to the A.I. tool Grok.  —  Over the past few weeks, users on X have been submitting X-rays, MRIs, CT scans and other medical images to Grok … ",
    "url": "https://www.nytimes.com/2024/11/18/well/x-grok-health-privacy.html?unlocked_article_code=1.a04.1kQf.3oUwP24zv4G8&smid=url-share"
  },
  {
    "text": "Nancy Mace defends anti-trans bathroom bill, says it ‘absolutely’ targets Sarah McBride  —  McBride, the first out transgender person elected to Congress, will be serving in the House starting next year and Mace doesn't want her using women's bathrooms at the Capitol.",
    "url": "https://www.nbcnews.com/politics/congress/nancy-mace-defends-anti-trans-bathroom-bill-says-absolutely-targets-sa-rcna180805"
  },
  {
    "text": "November 18, 2024  —  On Friday, Secretary of Commerce Gina Raimondo locked in a $6.6 billion deal with the Taiwan Semiconductor Manufacturing Company for it to invest $65 billion in three state-of-the-art fabrication plants in Arizona.  This will bring thousands of jobs to the state.",
    "url": "https://heathercoxrichardson.substack.com/p/november-18-2024"
  },
  {
    "text": "Trump to tap Howard Lutnick as Commerce Secretary … - Lutnick was hoping to become Treasury secretary, but Trump recently soured on the finalists and is considering other options, transition sources tell Axios. … - Lutnick became one of the most prominent business voices in the aftermath of the September 11 attacks.",
    "url": "https://www.axios.com/2024/11/19/trump-commerce-secretary-howard-lutnick"
  },
  {
    "text": "House GOP lays out legislative priorities: Border wall, tax cuts, cutting Biden programs  —  House Republican leaders laid out their biggest legislative priorities for next year in a closed-door Tuesday meeting, including funding the U.S.-Mexico border wall, cutting various Democratic policies … ",
    "url": "https://www.politico.com/live-updates/2024/11/19/congress/gop-leaders-lay-out-legislative-agenda-00190405"
  }
]