[
  {
    "text": "Russian activist and Putin critic Alexei Navalny dies in prison  —  Opposition leader, 47, was being held in jail about 40 miles north of Arctic Circle  —  The Russian opposition leader Alexei Navalny has died in jail, the country's prison service has said, in what is likely to be seen … ",
    "url": "https://www.theguardian.com/world/2024/feb/16/russian-activist-and-putin-critic-alexei-navalny-dies-in-prison"
  },
  {
    "text": "Alexei Navalny, Russian opposition leader, dies in prison, officials say  —  RIGA, Latvia — Russia's jailed opposition leader, Alexei Navalny, died in a Russian prison colony on Friday, Russia's prison service announced early afternoon, without giving the cause of his death.",
    "url": "https://www.washingtonpost.com/world/2024/02/16/alexei-navalny-dead-russia-prsion/"
  },
  {
    "text": "Alexei Navalny, the fiercest foe of Russia's Putin, has died, Russian authorities say  —  Alexei Navalny, the fiercest foe of Russian President Vladimir Putin who crusaded against official corruption and staged massive anti-Kremlin protests, died in prison Friday, Russia's prison agency said.",
    "url": "https://apnews.com/article/russia-navalny-dead-opposition-leader-2d11644f7ae5332587b39150f1fd1738"
  },
  {
    "text": "Russian opposition leader Alexei Navalny dies in prison  —  Navalny, 47, a prominent critic of President Vladimir Putin, spent his final years behind bars as the Russian leader reshaped the country to rally behind his war in Ukraine.  —  Russian opposition leader Alexei Navalny has died in prison … ",
    "url": "https://www.nbcnews.com/news/world/russian-opposition-leader-alexei-navalny-dies-prison-rcna79718"
  },
  {
    "text": "Putin critic Alexei Navalny, 47, dies in Arctic Circle jail  —  Russia's most significant opposition leader for the past decade, Alexei Navalny, has died in an Arctic Circle jail, the prison service said.  —  Seen as President Vladimir Putin's most vociferous critic, Navalny was serving … ",
    "url": "https://www.bbc.com/news/world-europe-68315943"
  },
  {
    "text": "Inside Trump's ouster of Ronna McDaniel as RNC chair  —  “Loyalty is a one-way street” for the former president, one party committeeman said  —  For much of the fall, Donald Trump was annoyed at Republican National Committee Chair Ronna McDaniel.  She was refusing to cancel the party's primary debates … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/16/ronna-mcdaniel-trump-rnc/"
  },
  {
    "text": "Trump opts against Supreme Court appeal on civil immunity claim over Jan. 6 lawsuits  —  The decision not to seek high court review means cases brought against Trump over Jan. 6 can move forward in district court, although he can still mount an immunity defense.",
    "url": "https://www.nbcnews.com/politics/supreme-court/trump-opts-supreme-court-appeal-immunity-claim-police-jan-6-lawsuits-rcna138869"
  },
  {
    "text": "FBI informant charged with lying about Joe and Hunter Biden's ties to Ukrainian energy company  —  An FBI informant has been charged with fabricating a multimillion-dollar bribery scheme involving President Joe Biden, his son Hunter and a Ukrainian energy company, a claim that is central … ",
    "url": "https://apnews.com/article/hunter-biden-burisma-fbi-informant-lying-6969656f6012780a23a4b8841ce2689b"
  },
  {
    "text": "Special counsel charges FBI informant with lying to the bureau about Hunter and Joe Biden  —  Alexander Smirnov, 43, disliked President Joe Biden, according to the Justice Department.  He was arrested in Las Vegas after returning from a trip overseas.  —  WASHINGTON — An FBI confidential human source … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/special-counsel-charges-fbi-informant-lying-bureau-hunter-joe-biden-rcna139091"
  },
  {
    "text": "Former FBI informant charged with lying about the Bidens' role in Ukraine business, undercutting GOP impeachment inquiry  —  Special counsel David Weiss charged a former FBI informant with lying about President Joe Biden and his son Hunter Biden's involvement in business dealings … ",
    "url": "https://www.cnn.com/2024/02/15/politics/former-fbi-informant-charged-biden-burisma/"
  },
  {
    "text": "Greece becomes first Orthodox Christian country to legalize same-sex civil marriage  —  Lawmakers in Greece have begun a debate on a landmark bill to legalize same-sex marriage.  It would make Greece the first Orthodox Christian country to do so.  The Valentine's Day session … ",
    "url": "https://apnews.com/article/greece-same-sex-marriage-law-parliament-church-5be190dd6a7628d7a057be683256b8c2"
  },
  {
    "text": "Witness Told Feds She Was Paid for Sex Parties With Matt Gaetz  —  The Ethics Committee is investigating Gaetz—and has text messages between the congressman and a woman who claims she had sex with Gaetz at parties she was paid to attend. … When ABC News reported on Wednesday … ",
    "url": "https://www.thedailybeast.com/witness-told-feds-she-was-paid-for-sex-parties-with-matt-gaetz"
  },
  {
    "text": "Rosendale drops Montana Senate bid — after less than a week  —  Rosendale had just launched his long-anticipated Senate bid last Friday.  —  GOP Rep. Matt Rosendale is dropping his Montana Senate bid less than a week after he officially launched it, he confirmed to POLITICO.",
    "url": "https://www.politico.com/news/2024/02/15/rosendale-drops-montana-senate-bid-00141812"
  },
  {
    "text": "Joe Rogan and Bret Weinstein Promote AIDS Denialism to an Audience of Millions  —  Weinstein repeated discredited theories to Rogan about HIV not being the cause of AIDS, alarming and infuriating public health experts.  —  Bret Weinstein, the evolutionary biology professor turned podcaster … ",
    "url": "https://www.vice.com/en/article/jg543y/joe-rogan-and-bret-weinstein-promote-aids-denialism-to-an-audience-of-millions"
  },
  {
    "text": "Reporter asks Ron DeSantis why he can affirm his height with lifts, but stands against gender-affirming care  —  In a Thursday morning press conference in Florida, Republican Gov. Ron DeSantis, a failed 2024 presidential candidate, flanked by representatives from the Southern Poverty Law … ",
    "url": "https://www.advocate.com/politics/ron-desantis-shoe-lifts-presser"
  },
  {
    "text": "The top doctor for CBP tried to order fentanyl lollipops for a helicopter mission in New York, whistleblowers say  —  The whistleblowers also allege Dr. Alexander Eastman was already under investigation for trying to procure narcotics for a friend who worked as a chopper pilot for the border agency.",
    "url": "https://www.nbcnews.com/politics/immigration/cbp-doctor-tried-order-fentanyl-lollipops-helicopter-mission-new-york-rcna139116"
  }
]