[
  {
    "text": "US charges Hamas leader, other militants in connection with Oct. 7 massacre in Israel  —  The Justice Department announced criminal charges Tuesday against Hamas leader Yahya Sinwar and other senior militants in connection with the Oct. 7, 2023, rampage in Israel, marking the first effort … ",
    "url": "https://apnews.com/article/justice-department-hamas-sinwar-87674285aa9b066392953db1310312ca"
  },
  {
    "text": "Harris to propose tenfold startup tax incentive increase she says will spur small business creation  —  Vice President Kamala Harris plans to propose on Wednesday a tenfold increase in federal tax incentives for small business startup expenses, from $5,000 to $50,000, hoping to help spur … ",
    "url": "https://apnews.com/article/harris-small-business-tax-plan-new-hampshire-12f34210263458ddb1b02fbd846d2be5"
  },
  {
    "text": "SURPRISE!  —  Hello again, it's Brian Stelter — yes, really.  —  I am thrilled to share that I am returning as the lead author of CNN's Reliable Sources newsletter, the digest I founded in 2015.  —  But this is not going to be a “Back to the Future” remake.",
    "url": "https://view.newsletters.cnn.com/messages/1725400860804a11dd2d3fed6/raw"
  },
  {
    "text": "Ex-Porn Shop Employees Say Mark Robinson Was A Regular.  He Denies It.  —  After he embraced Christianity in the late 1980s, the GOP candidate for governor says his behavior “did not immediately reform.”  Six men say Robinson frequented Greensboro video-porn shops in the '90s and early 2000s.",
    "url": "https://www.theassemblync.com/politics/nc-election-governor-republican-mark-robinson-porn-allegations/"
  },
  {
    "text": "New poll shows where Michigan voters stand in Trump-Harris race  —  Survey shows tight race with 2 months before election  —  A new WDIV/Detroit News survey asked Michigan voters where they stand on the race for president between Donald Trump and Kamala Harris.",
    "url": "https://www.clickondetroit.com/decision-2024/2024/09/03/new-poll-shows-where-michigan-voters-stand-in-trump-harris-race/"
  },
  {
    "text": "The ugly truth we're missing on Trump, Arlington  —  There's an old saying: Never take any time off in 2024.  OK, I just made that up, but no sooner did I decide to skip a few column slots to recover from the joy, or whatever, of Chicago's Democratic National Convention, than all heck broke loose.",
    "url": "https://www.inquirer.com/columnists/attytood/trump-arlington-cemetery-sundown-towns-ferguson-20240903.html"
  },
  {
    "text": "Conservatives expect Johnson will embrace proof-of-citizenship voting in anti-shutdown measure  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/house/4860441-hard-line-conservatives-vote-bill/"
  },
  {
    "text": "Trump Media stock falls to new low  —  Donald Trump and other major investors will be allowed to sell their shares in the Truth Social parent company later this month.  —  The share price of Trump Media, whose majority shareholder is former President Donald Trump, fell Tuesday … ",
    "url": "https://www.nbcnews.com/business/markets/trump-media-stock-falls-new-low-rcna169392"
  },
  {
    "text": "Doctors grapple with how to save women's lives amid ‘confusion and angst’ over new Louisiana law  —  When a woman starts bleeding out after labor, every second matters.  But soon, under a new state law, Louisiana doctors might not be able to quickly access one of the most widely used life-saving medications for postpartum hemorrhage.",
    "url": "https://lailluminator.com/2024/09/03/louisiana-women/"
  },
  {
    "text": "Prosecutors balk at Trump's bid to delay post-conviction hush money rulings  —  NEW YORK (AP) — Manhattan prosecutors balked Tuesday at Donald Trump 's effort to delay post-trial decisions in his New York hush money criminal case while he seeks to have a federal court intervene and potentially overturn his felony conviction.",
    "url": "https://apnews.com/article/trump-hush-money-sentencing-new-york-immunity-a905207c7db9fc48d022d68ac6cc12e1"
  },
  {
    "text": "Judge Cannon Should Be Removed From Trump Case, Watchdog Group Argues in New Legal Filing  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Judge Aileen M. Cannon has shown bias … ",
    "url": "https://www.propublica.org/article/judge-aileen-cannon-trump-documents-case-ethics-complaint-crew-jack-smith"
  },
  {
    "text": "Israeli hostage deaths ‘changed everything’ about Gaza cease-fire talks  —  Recent optimism has deflated and worries mount that tensions between Israeli leadership and Hamas will only continue to increase.  —  U.S. and Israeli officials acknowledged that the killing of six hostages in Gaza … ",
    "url": "https://www.politico.com/news/2024/09/03/israeli-hostage-deaths-gaza-cease-fire-talks-peril-00177229"
  },
  {
    "text": "RFK Jr. must remain on the Michigan ballot, judge says  —  A Michigan judge ruled that Robert F. Kennedy Jr. must remain on the November presidential ballot, dealing a blow to his crusade to strategically remove his ticket from the battleground state.  Kennedy suspended his campaign and endorsed former President Donald Trump in August.",
    "url": "https://apnews.com/article/rfk-michigan-ballot-daac0d6ab5dd1abd29b6e40cdaa044e6"
  },
  {
    "text": "Iowa Lt. Gov Adam Gregg resigns in surprise announcement  —  Iowa Lieutenant Gov. Adam Gregg resigned his position effective immediately Tuesday to take a job leading the Iowa Bankers Association, he said in a surprise announcement.  —  Gov. Kim Reynolds issued a statement Tuesday afternoon saying Gregg … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/03/iowa-lt-gov-adam-gregg-resigns/75064073007/"
  },
  {
    "text": "Big Tech ‘Clients’ of Jacob Wohl's Secret AI Lobbying Firm Say They've Never Heard of It  —  Monday, Politico revealed that convicted fraudsters and right-wing activists Jacob Wohl and Jack Burkman have been secretly operating a company that purports to do AI-powered lobbying called LobbyMatic.",
    "url": "https://www.404media.co/big-tech-clients-of-jacob-wohls-secret-ai-lobbying-firm-lobbymatic-say-theyve-never-heard-of-it/"
  },
  {
    "text": "Donald Trump's Incredible ‘Transgender Thing’  —  During a conversation onstage at a Moms for Liberty event last week, Donald Trump said something that made even me—a seasoned visitor to Trump's theme park of hyperbole—look around in confusion at the people around me in the audience.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/donald-trump-schools-sex-change/679690/"
  },
  {
    "text": "The #Americans  —  Chinese State-Linked Influence Operation Spamouflage Masquerades as U.S. Voters to Push Divisive Online Narratives Ahead of 2024 Election  — Chinese state-linked influence operation (IO) Spamouflage has become more aggressive in its efforts to influence U.S. political … ",
    "url": "https://graphika.com/reports/the-americans"
  },
  {
    "text": "Goldman Sachs predicts stronger GDP and job growth if Democrats sweep White House and Congress … Goldman Sachs Group Inc. economists gamed out the potential economic implications of a Republican or Democratic victory in the November elections, cautioning that US GDP faces a hit in the case of a win for Donald Trump.",
    "url": "https://fortune.com/2024/09/03/goldman-sachs-predicts-stronger-gdp-and-job-growth-if-democrats-sweep-white-house-and-congress/"
  },
  {
    "text": "Danish police detain activist Greta Thunberg during Gaza war protest  —  Danish police on Wednesday apprehended activist Greta Thunberg at a Copenhagen protest against the war in Gaza, a spokesperson for the student group organising the demonstration said.  —  Six people were detained … ",
    "url": "https://www.reuters.com/world/europe/danish-police-apprehend-activist-greta-thunberg-during-gaza-war-protest-2024-09-04/"
  },
  {
    "text": "China Signs Deal to Revamp Decades-Old Southern African Railway  — Line links copper-rich Zambia with Tanzania's main ocean port  — China's move follows US support for rail link going to Angola  —  China signed an agreement Wednesday to revamp a railway that will help landlocked Zambia … ",
    "url": "https://www.bloomberg.com/news/articles/2024-09-04/china-signs-deal-to-revamp-decades-old-southern-african-railway"
  },
  {
    "text": "New York man sentenced to prison after thousands of harassing calls to Congress and threat to kill staffer  —  Ade Salim Lilly pleaded guilty in May to interstate communications with a threat to kidnap or injure, and making repeated threatening phone calls.  —  A New York man was sentenced Tuesday … ",
    "url": "https://www.nbcnews.com/politics/congress/new-york-man-sentenced-prison-harassing-calls-congress-threat-kill-sta-rcna169452"
  },
  {
    "text": "Former aide to New York's governor is charged with being an agent of the Chinese government  —  A former New York state government official who worked for former Gov. Andrew Cuomo and current Gov. Kathy Hochul was charged Tuesday with acting as an undisclosed agent of the Chinese government … ",
    "url": "https://apnews.com/article/former-hochul-aide-arrested-new-york-c588a95e87b853ca3d23b36aae4c87cd"
  }
]