[
  {
    "text": "Playbook: What Ohio might tell us about 2024  —  With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  HE'S IN — “Mike Pence qualifies for first GOP debate,” by Zach Montellaro and Adam Wren  —  WEATHER REPORT — “Thousands of flight cancellations, 1.1 million lose power … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/08/what-ohio-might-tell-us-about-2024-00110229"
  },
  {
    "text": "High turnout, long lines: A look at Ohio's last weekend of early voting on Issue 1  —  Saturday and Sunday were the last days to vote early in-person on Issue 1 and turnout was high across Ohio with lines stretching around buildings in some counties.  —  While many projected low turnout … ",
    "url": "https://www.dispatch.com/story/news/politics/elections/state/2023/08/07/issue-1-early-voting-closes-in-ohio-bringing-high-turnout-ahead-of-aug-8/70512342007/"
  },
  {
    "text": "Trump Turned the GOP Into the Party of Wishful Thinking  —  Its leaders assumed he was a joke, tried to make peace with him, and reckoned he was finished after 2020.  —  For a political class that likes to think of itself as a hardened cadre of cold-eyed realists, the leadership … ",
    "url": "https://www.wsj.com/articles/trump-turned-the-gop-into-the-party-of-wishful-thinking-2024-indictment-jack-smith-7c849bfa?mod=djemalertNEWS"
  },
  {
    "text": "The Prosecution of Trump May Have Terrible Consequences  —  Mr. Goldsmith served in the George W. Bush administration as an assistant attorney general and as special counsel to the general counsel of the Department of Defense.  —  It may be satisfying now to see Special Counsel Jack Smith … ",
    "url": "https://www.nytimes.com/2023/08/08/opinion/trump-indictment-cost-danger.html"
  },
  {
    "text": "Security increases for judge assigned to Donald Trump's January 6 criminal case  —  Security for the federal judge assigned to oversee the criminal case against former President Donald Trump over his attempts to overturn the 2020 election has been increased in the federal courthouse in Washington, DC.",
    "url": "https://www.cnn.com/2023/08/07/politics/security-judge-tanya-chutkan-trump-january-6/"
  },
  {
    "text": "Ex-Pence Adviser Trashes Former Boss, Backs Trump Instead  —  ‘UNWORTHY’  —  Mike Pence's former national security adviser Keith Kellogg released a statement Monday calling his old boss “unworthy of the presidency” and expressing admiration for Donald Trump.",
    "url": "https://www.thedailybeast.com/ex-pence-adviser-keith-kellogg-trashes-former-boss-backs-trump-instead"
  },
  {
    "text": "8/8/23 ☀️ Punchbowl News AM  —  THE TOP … While the exact timing of the request remains fluid, the funding proposal will tee up a high-stakes political battle when Congress returns from recess.  This will be a major test of U.S. support for Ukraine that could see Republican … ",
    "url": "https://punchbowl.news/archive/8823-punchbowl-news-am/"
  },
  {
    "text": "Trump Charges Could Speed Moves to Impeach or Censure Biden Officials  —  Punishments meant to be used only in the most serious circumstances have grown politicized and normalized.  New charges against former President Donald J. Trump are likely to spur more recriminations.",
    "url": "https://www.nytimes.com/2023/08/08/us/politics/censure-impeachment-congress-republicans-biden.html"
  },
  {
    "text": "House GOP eyes fall push for Biden impeachment inquiry  —  Speaker Kevin McCarthy has been insistent: House Republicans are still gathering evidence and have yet to decide whether to open up a formal impeachment inquiry against President Joe Biden.  —  “I didn't say I was doing an impeachment inquiry … ",
    "url": "https://www.cnn.com/2023/08/08/politics/house-republicans-impeachment-inquiry-biden/"
  },
  {
    "text": "Biden's Newest National Monument Will Block Uranium Mining Near The Grand Canyon  —  President Joe Biden will protect nearly 1 million acres adjacent to the national park, answering calls from a coalition of Native American tribes.  —  President Joe Biden on Tuesday will establish … ",
    "url": "https://www.huffpost.com/entry/biden-national-monument-grand-canyon_n_64d17547e4b0d52bee9fa076"
  },
  {
    "text": "DeSantis Replaces Campaign Manager with Florida Chief of Staff As He ‘Reloads’ (Exclusive)  —  James Uthmeier has earned the governor's trust as an always-on-offense political fixer, but he has no campaign experience  —  A Facebook icon representing an external link to share the article … ",
    "url": "https://themessenger.com/politics/desantis-new-campaign-manager-exclusive"
  },
  {
    "text": "Global child sexual abuse probe that was launched after two FBI agents were killed leads to almost 100 arrests  —  The Australian Federal Police announced Tuesday that at least 13 children were rescued from further harm as a result of a joint operation with the FBI, dubbed “Operation Bakis.”",
    "url": "https://www.nbcnews.com/news/world/child-sex-abuse-australia-arrests-fbi-agents-murder-rcna98707"
  },
  {
    "text": "EXCLUSIVE POLL: Trump Holds Big Lead in NH, DeSantis Drops to Tie With Christie  —  When Donald Trump returns to New Hampshire on Tuesday, he will be greeted by a Republican base that is overwhelmingly loyal to the former president.  —  How loyal?  In an exclusive new NHJournal/co-efficient poll … ",
    "url": "https://nhjournal.com/exclusive-poll-trump-holds-big-lead-in-nh-desantis-drops-to-tie-with-christie/"
  },
  {
    "text": "DNC names leadership posts for 2024 presidential convention in Chicago  —  Minyon Moore, who has been active behind the scenes in the White House, has been tapped for convention chair.  —  CHICAGO — The Democratic National Committee on Tuesday named its leadership team for the national convention … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/dnc-names-leadership-posts-2024-presidential-convention-chicago-rcna98670"
  },
  {
    "text": "DeSantis' Florida approves classroom videos that compare climate activists to Nazis  —  Florida Gov. Ron DeSantis has already come under fire after the administration formally approved the use of far-right PragerU videos as educational material in K-12 schools, owing to these videos' distorted takes … ",
    "url": "https://www.rawstory.com/prageru-florida-2662923106/"
  },
  {
    "text": "Arizona ‘audit’ leader wants texts with Michigan lawyer indicted over voting machines to stay secret  —  Cyber Ninjas CEO Doug Logan is trying to keep secret more than 1,600 texts he exchanged with a Michigan lawyer who was indicted on charges of illegally accessing voting machines as part of a plot to overturn 2020 election results.",
    "url": "https://www.azcentral.com/story/news/local/arizona-investigations/2023/08/07/cyber-ninjas-ceo-doug-logan-aims-to-keep-texts-with-stefanie-lambert-secret/70516217007/"
  },
  {
    "text": "Appeals court halts new Biden rules on debt relief for defrauded students  —  The future of the Biden administration's rules to ease the path to student loan forgiveness for people who were defrauded borrowers by their college or whose schools abruptly close is in doubt.",
    "url": "https://www.washingtonpost.com/education/2023/08/07/student-loan-forgiveness-defrauded-borrowers-court-injunction/"
  },
  {
    "text": "SSU detains russian informant preparing enemy air strike on Mykolaiv region during President's visit (video)  —  The SSU has detained an informant of russian intelligence services who on the eve of the visit of the President of Ukraine to Mykolaiv oblast was collecting information on the planned events.",
    "url": "https://ssu.gov.ua/en/novyny/sbu-zatrymala-rosiisku-informatorku-yaka-hotuvala-povitrianyi-udar-rf-po-mykolaivshchyni-pid-chas-vizytu-prezydenta-ukrainy-video"
  },
  {
    "text": "Mississippi Officials Made 161 Voting Precinct Changes Since November 2022  —  Mississippi election officials have made 161 voting precinct changes since November 2022, leaving voters with slightly fewer voting precincts statewide and dozens moved after the completion of post-Census redistricting efforts … ",
    "url": "https://www.mississippifreepress.org/35295/mississippi-officials-made-161-voting-precinct-changes-since-november-2022"
  },
  {
    "text": "Dwindling Blue Dog Democrats look to stage a comeback for moderates  —  The new leaders of the once-powerful group are working to change its perception and grow their ranks  —  Rep. Jared Golden (D-Maine) has never really been into labels.  —  His liberal colleagues have called … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/08/blue-dog-democrats-congress-new-leaders/"
  },
  {
    "text": "Tucker Carlson could see Rebekah Mercer, Peter Thiel invest in his media company  — Rebekah Mercer has spoken with Tucker Carlson since his April departure from Fox News about possibly investing into his as yet unnamed media company.  — Peter Thiel has hinted to allies that he could invest in the media company, sources said.",
    "url": "https://www.cnbc.com/2023/08/08/tucker-carlson-may-see-rebekah-mercer-peter-thiel-invest-in-company.html"
  }
]