[
  {
    "text": "Security increases for judge assigned to Donald Trump's January 6 criminal case  —  Security for the federal judge assigned to oversee the criminal case against former President Donald Trump over his attempts to overturn the 2020 election has been increased in the federal courthouse in Washington, DC.",
    "url": "https://www.cnn.com/2023/08/07/politics/security-judge-tanya-chutkan-trump-january-6/"
  },
  {
    "text": "Trump objects to strict limits on sharing evidence in election interference case  —  In a new court filing, his legal team said prosecutors' proposed restrictions are too onerous.  —  Donald Trump argued Monday that he should be allowed to share evidence in his latest criminal case with … ",
    "url": "https://www.politico.com/news/2023/08/07/trump-protective-order-response-00110188"
  },
  {
    "text": "Judge asks prosecutors to justify use of 2 grand juries in Trump documents case  —  Judge Aileen M. Cannon on Monday asked federal prosecutors to explain the use of grand juries in Florida and Washington in the classified documents case against Donald Trump even though charges were filed in South Florida.",
    "url": "https://www.washingtonpost.com/national-security/2023/08/07/trump-grand-juries-cannon/"
  },
  {
    "text": "Exclusive: Trump ally Bernie Kerik meets with special counsel investigators  —  Donald Trump ally Bernie Kerik met Monday with special counsel Jack Smith's investigators who are handling the probe related to the 2020 election aftermath and the January 6, 2021, insurrection.",
    "url": "https://www.cnn.com/2023/08/07/politics/bernie-kerik-trump-grand-jury/"
  },
  {
    "text": "Judge dismisses Trump's defamation claim against E. Jean Carroll  —  A U.S. judge on Monday dismissed Donald Trump's defamation counterclaim against the writer E. Jean Carroll, handing a fresh legal defeat to the former president as he seeks another White House term.",
    "url": "https://www.reuters.com/legal/judge-dismisses-donald-trumps-defamation-claim-against-e-jean-carroll-2023-08-07/"
  },
  {
    "text": "SSU detains russian informant preparing enemy air strike on Mykolaiv region during President's visit (video)  —  The SSU has detained an informant of russian intelligence services who on the eve of the visit of the President of Ukraine to Mykolaiv oblast was collecting information on the planned events.",
    "url": "https://ssu.gov.ua/en/novyny/sbu-zatrymala-rosiisku-informatorku-yaka-hotuvala-povitrianyi-udar-rf-po-mykolaivshchyni-pid-chas-vizytu-prezydenta-ukrainy-video"
  },
  {
    "text": "Pence announces he's reached donor threshold to qualify for first Republican presidential debate  —  The former vice president's campaign spotlights that they passed the donor threshold without the need of any gimmicks or giveaways  —  FIRST ON FOX: Former Vice President Mike Pence has met … ",
    "url": "https://www.foxnews.com/politics/pence-announces-hes-reached-donor-threshold-qualify-first-republican-presidential-debate"
  },
  {
    "text": "Mississippi Officials Made 161 Voting Precinct Changes Since November 2022  —  Mississippi election officials have made 161 voting precinct changes since November 2022, leaving voters with slightly fewer voting precincts statewide and dozens moved after the completion of post-Census redistricting efforts … ",
    "url": "https://www.mississippifreepress.org/35295/mississippi-officials-made-161-voting-precinct-changes-since-november-2022"
  },
  {
    "text": "Biden to Designate Monument Near Grand Canyon, Preventing Uranium Mining  —  Uranium extraction had already been restricted in the area, which Native tribes consider sacred, but the moratorium was set to expire in 2032.  Mr. Biden's designation will make it permanent.",
    "url": "https://www.nytimes.com/2023/08/07/us/politics/biden-grand-canyon-arizona-national-monument.html"
  },
  {
    "text": "Judge Cannon Blows Off Concerns about Walt Nauta's Conflicted Representation  —  Before I attempt to explain the substance of the order that Aileen Cannon issued in response to DOJ's request for a Garcia hearing, let me point out how it looks on the docket.  —  Before DOJ filed its motion … ",
    "url": "https://www.emptywheel.net/2023/08/07/judge-cannon-blows-off-concerns-about-walt-nautas-conflicted-representation/"
  },
  {
    "text": "The Secret Hand Behind the Women Who Stood by Cuomo?  His Sister.  —  For nearly two years, Madeline Cuomo back channeled with grass-roots activists to help smear her brother's accusers.  He was “seeing everything,” she told his defenders.  —  The menacing posts began cropping up on Twitter … ",
    "url": "https://www.nytimes.com/2023/08/07/nyregion/cuomo-women-sister-madeline.html"
  },
  {
    "text": "G.O.P. Contenders Feed Voter Distrust in Courts, Schools and Military  —  As Donald J. Trump has escalated his attacks on the justice system and other core institutions, his competitors for the Republican nomination have followed his lead.  —  Ron DeSantis says the military is more interested … ",
    "url": "https://www.nytimes.com/2023/08/07/us/politics/trump-republican-primary-candidate-trust.html"
  },
  {
    "text": "John Eastman, awaiting potential indictment, asks judge to postpone his disbarment proceedings  —  The lawyer who advised Donald Trump in the weeks leading up to Jan. 6 is known as “co-conspirator 2” in the special counsel's newest case.  —  Attorney John Eastman, an architect of Donald Trump's … ",
    "url": "https://www.politico.com/news/2023/08/07/eastman-trump-disbarment-postpone-00110131"
  },
  {
    "text": "Acting US deputy secretary of state meets with military junta members in Niger  —  Acting Deputy Secretary of State Victoria Nuland met with some of the members of the military junta in Niger Monday - a significant diplomatic push to restore democratic rule in what has been a key US partner nation.",
    "url": "https://www.cnn.com/2023/08/07/politics/niger-military-junta-nuland-meeting/"
  },
  {
    "text": "Arizona ‘audit’ leader wants texts with Michigan lawyer indicted over voting machines to stay secret  —  Cyber Ninjas CEO Doug Logan is trying to keep secret more than 1,600 texts he exchanged with a Michigan lawyer who was indicted on charges of illegally accessing voting machines as part of a plot to overturn 2020 election results.",
    "url": "https://www.azcentral.com/story/news/local/arizona-investigations/2023/08/07/cyber-ninjas-ceo-doug-logan-aims-to-keep-texts-with-stefanie-lambert-secret/70516217007/"
  },
  {
    "text": "Texans minority owner Javier Loya faces rape charge in Kentucky  —  Javier Loya, a successful Houston businessman and a minority owner of the Texans since 2002, faces multiple criminal charges in Kentucky.  —  PFT has learned that Loya faces one count of first-degree rape … ",
    "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/texans-minority-owner-javier-loya-faces-rape-charge-in-kentucky"
  },
  {
    "text": "Newsmax Ropes Matt Gaetz Into Battle to Become GOP's Comms Shop  —  Gaetz has filled in during Newsmax primetime, often “reporting” on political stories of which he's very much a part.  It's an ethics nightmare, say experts. … Newsmax will apparently stop at nothing … ",
    "url": "https://www.thedailybeast.com/newsmax-ropes-matt-gaetz-into-battle-to-become-gops-comms-shop"
  },
  {
    "text": "Leader of Texas' largest county takes leave from job for treatment of clinical depression  —  Lina Hidalgo was just 27 years old and had never previously held elected office when she pulled a stunning upset in 2018, jolting her to national attention.  —  HOUSTON — Harris County Judge Lina Hidalgo … ",
    "url": "https://www.nbcnews.com/news/latino/lina-hidalgo-takes-leave-job-treatment-clinical-depression-rcna98669"
  },
  {
    "text": "Argentina's Next President Is on a Collision Course With Hyperinflation … With inflation at 116%, Argentina feels like a country careening out of control.  The big question in this weekend's presidential ballot is who, if anyone, can avert a crash.  —  For millions of voters … ",
    "url": "https://www.bloomberg.com/features/2023-argentina-presidential-elections-inflation/"
  },
  {
    "text": "Former Georgia Lt. Gov. Geoff Duncan subpoenaed in Fulton's Trump probe  —  X  —  Former Lt. Gov. Geoff Duncan has received a subpoena to testify as a witness before a Fulton County grand jury that could deliver indictments against former President Donald Trump and his allies this month.",
    "url": "https://www.ajc.com/politics/geoff-duncan-subpoenaed-in-fultons-trump-probe/C4UZWTCSPJGU5HNRX4IHP4Z5DQ/"
  },
  {
    "text": "Exclusive: DeSantis talks Trump, 2024, pro-life policies  —  In an NBC News exclusive, Florida Gov. Ron DeSantis sits down with Dasha Burns for a wide-ranging interview, from taking on Donald Trump in the 2024 election to supporting pro-life policies and leaning on his wife, Casey, on the campaign trail.",
    "url": "https://www.today.com/video/ron-desantis-of-course-trump-lost-2020-election-190166085855"
  }
]