[
  {
    "text": "How I Would Script This Moment for Biden and the Democrats  —  The Paley Center for Media just opened an exhibition celebrating the 25th anniversary of “The West Wing,” the NBC series I wrote from 1999 to 2003.  Some of the show's story points have become outdated in the last quarter-century … ",
    "url": "https://www.nytimes.com/2024/07/21/opinion/biden-west-wing-aaron-sorkin.html"
  },
  {
    "text": "Democratic Party chairs in 7 battleground states reaffirm support for Biden  —  WASHINGTON — Democratic Party chairs of seven critical battleground states Sunday reaffirmed their support for President Joe Biden, urging their fellow Democrats to focus on beating former President Donald Trump … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/21/dem-party-chairs-in-7-key-swing-states-reaffirm-support-for-biden/74486033007/"
  },
  {
    "text": "For Biden, a Decision to Step Aside Would Raise Another Question  —  As President Biden grapples with the possibility of dropping his bid for re-election, a secondary question looms: Should he endorse his own vice president as the nominee?  —  President Biden has been saying some awfully nice things … ",
    "url": "https://www.nytimes.com/2024/07/21/us/politics/biden-harris-nomination.html"
  },
  {
    "text": "How Democrats would pick a new candidate if Biden drops out, step by step  —  If President Biden decides to stop running for reelection, Democratic delegates will be free to pick a new nominee, possibly at an open convention in Chicago in August.  —  If President Biden decides to end … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/21/open-convention-democrats-biden-drop-out/"
  },
  {
    "text": "Democratic donors funding an effort to vet potential VP candidates  —  The effort to vet potential running mates, should Biden exit and Harris become the nominee, is independent of the Biden campaign  —  Major Democratic donors are funding a preliminary vetting process for potential vice … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/20/democrat-donors-fund-vp-vetting-push/"
  },
  {
    "text": "JD Vance Demands Joe Biden Resign from Office: 'If You Can't Run, You Can't Serve'  —  Republican vice presidential nominee Sen. JD Vance (OH) demanded President Joe Biden “resign” from office in a Saturday X post.  —  “Everyone calling on Joe Biden to *stop running* without also calling … ",
    "url": "https://www.breitbart.com/2024-election/2024/07/20/jd-vance-demands-joe-biden-resign-from-office-if-you-cant-run-you-cant-serve/"
  },
  {
    "text": "Secret Service said to have denied requests for more security at Trump events  —  Top officials repeatedly rejected requests from Trump's security detail for more manpower and gear at events before attempted assassination, at times citing lack of resources, people familiar with the asks said.",
    "url": "https://www.washingtonpost.com/nation/2024/07/20/trump-secret-service-security-attempted-assassination/"
  },
  {
    "text": "Will Peter Baker Exhibit the Same Tenacity about Medical Records on the Trump Shooting as He Did a Parkinson's Conspiracy Theory?  —  Something funny happened on Xitter.  —  In an attempt to demonstrate the double standard and cowardice of the captive media, I tweeted at Peter Baker asking … ",
    "url": "https://www.emptywheel.net/2024/07/20/will-peter-baker-exhibit-the-same-tenacity-about-medical-records-on-the-trump-shooting-as-he-did-a-parkinsons-conspiracy-theory/"
  },
  {
    "text": "Tech broligarchs are lining up to court Trump.  And Vance is one more link in the chain  —  Elon Musk and Peter Thiel, a longtime backer of the new vice-president pick, are among those pledging support  —  Less than a month after Donald Trump was elected president in November 2016 … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/20/tech-broligarchs-court-trump-vance-elon-musk-peter-thiel"
  },
  {
    "text": "“It's not that complicated”: Pete Buttigieg on why a gay billionaire is backing JD Vance  —  When asked to weigh in on Peter Thiel's reasons for supporting Vance, Buttigieg broke it down plainly: Money  —  In a segment of “Real Time with Bill Maher” at the start of the weekend … ",
    "url": "https://www.salon.com/2024/07/20/its-not-that-complicated-pete-buttigieg-on-why-a-gay-billionaire-is-backing-jd-vance/"
  },
  {
    "text": "Inside the ‘Gangster’ Image of Donald Trump  —  Former President Donald J. Trump has an aggressive — and some argue offensive — campaign using hip-hop and rap to reach young Black and Latino voters.  —  Former President Donald J. Trump has played up a macho invincibility in his messaging … ",
    "url": "https://www.nytimes.com/2024/07/21/us/politics/donald-trump-hiphop.html"
  },
  {
    "text": "Data centers draining resources in water-stressed communities  —  This opinion column was written by Eric Olson, Anne Grau, and Taylor Tipton and was first published in the Dallas Morning News.  Olson is an associate professor of finance and director of the Center for Energy Studies at The University of Tulsa.",
    "url": "https://utulsa.edu/news/data-centers-draining-resources-in-water-stressed-communities/"
  },
  {
    "text": "Republicans' June fundraising is party's strongest month in years  —  The GOP surge comes as a growing number of Democrats are calling on Biden to drop out in the wake of a politically devastating debate performance  —  The GOP posted another strong fundraising month in June … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/20/fundraising-july-election-trump-biden/"
  },
  {
    "text": "Rep. Sheila Jackson Lee Dies at 74 After Pancreatic Cancer Diagnosis  —  ‘INCREDIBLE GRIEF’  —  The long-serving Democratic congresswoman went public with her health battle in June.  —  Rep. Sheila Jackson Lee (D-TX), a longtime congresswoman who served three decades in Congress … ",
    "url": "https://www.thedailybeast.com/rep-sheila-jackson-lee-dies-at-74-after-pancreatic-cancer-diagnosis"
  }
]