[
  {
    "text": "Biden clinches Democratic nomination  —  President Biden won the Georgia Democratic primary, according to Decision Desk HQ projections, giving him enough delegates to clinch the Democratic presidential nomination and all but guaranteeing he will face off against former President Trump again in November.",
    "url": "https://thehill.com/homenews/campaign/4527035-joe-biden-democratic-nomination-delegates/"
  },
  {
    "text": "Robert Hur Admits Telling Biden He Seemed To Have ‘Photographic Recall’  —  The special counsel admitted his comment wasn't in the final report, in which he described the president's memory as “faulty,” “hazy” and “poor.”  —  LOADING  —  Although special counsel Robert Hur impugned Joe Biden's memory … ",
    "url": "https://www.huffpost.com/entry/robert-hur-biden-photographic-recall-eric-swalwell_n_65f0920ae4b01707c6d1f807"
  },
  {
    "text": "Trump's RNC makeover signals his plans for 2025 … - Trump “clearly wants a Republican National Committee that dances to his tune, jumps when he says jump,” said Norman Ornstein, an emeritus scholar at the conservative American Enterprise Institute.  — “That is a harbinger of things to come,” Ornstein added.",
    "url": "https://www.axios.com/2024/03/13/trump-rnc-makeover-2025-plan-government"
  },
  {
    "text": "Trump takes control of the RNC with mass layoffs, restructuring  —  The move has raised fears among some former officials about the party's future support for down-ballot candidates  —  Former president Donald Trump took charge of the Republican National Committee this week with the political equivalent … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/12/rnc-trump-firings-takeover/"
  },
  {
    "text": "House GOP panics as another Republican sprints for the exits … - “I was surprised by Ken's announcement — I look forward to talking with him about that,” House Speaker Mike Johnson (R-La.) told reporters.  — House Majority Leader Steve Scalise (R-La.) said: “I haven't gotten to talk to him.",
    "url": "https://www.axios.com/2024/03/12/republican-retire-house-gop"
  },
  {
    "text": "Ken Buck announces he will leave Congress on March 22, scrambling race to replace him that includes Lauren Boebert  —  U.S. Rep. Ken Buck will leave Congress on March 22, the Windsor Republican announced Tuesday in a surprise decision that's scrambling the already highly contentious … ",
    "url": "https://coloradosun.com/2024/03/12/ken-buck-congress-departure-march-22/"
  },
  {
    "text": "Conference Acts to Promote Random Case Assignment  —  The Judicial Conference of the United States has strengthened the policy governing random case assignment, limiting the ability of litigants to effectively choose judges in certain cases by where they file a lawsuit.",
    "url": "https://www.uscourts.gov/news/2024/03/12/conference-acts-promote-random-case-assignment"
  },
  {
    "text": "Aaron Rodgers and Jesse Ventura Top R.F.K. Jr.'s List for Running Mate  —  Mr. Kennedy said he had been speaking with the Jets quarterback “pretty continuously” for the past month.  —  Robert F. Kennedy Jr. has recently approached the N.F.L. quarterback Aaron Rodgers and the former Minnesota governor … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/rfk-jr-aaron-rodgers-jesse-ventura.html"
  },
  {
    "text": "Wisconsin Republicans fire 8 more Evers appointees, including regents and judicial watchdogs  —  Republicans who control the state Senate fired eight more of Democratic Gov. Tony Evers' appointees Tuesday, including two Universities of Wisconsin regents who voted against a deal … ",
    "url": "https://apnews.com/article/senate-republicans-reject-governor-appointees-wisconsin-9041cc81dabcdd0851e8064e31ed7d54"
  },
  {
    "text": "NAACP asks Black student-athletes to reconsider Florida colleges  —  The NAACP asked Black student-athletes to reconsider their decisions to attend public colleges and universities in the state of Florida, in response to the University of Florida and other state schools recently eliminating their diversity … ",
    "url": "https://www.espn.com/college-sports/story/_/id/39710283/naacp-asks-black-student-athletes-reconsider-florida-colleges"
  },
  {
    "text": "Wisconsin Supreme Court will reconsider ruling limiting absentee ballot drop boxes  —  The Wisconsin Supreme Court will consider overturning its own ruling limiting the use of absentee ballot drop boxes, the justices said Tuesday.  The court ruled in July 2022 that absentee drop boxes … ",
    "url": "https://apnews.com/article/wisconsin-absentee-ballots-drop-boxes-supreme-court-17a8a322d20e2562d23016e98978ad0b"
  },
  {
    "text": "Racial reset shakes American politics … But they've been shifting Republican over the last two decades, and are no longer the slam-dunk Democrats they were in 1960 when JFK ran for president. … - A New York Times/Siena College poll out March 2 found that President Biden led former President Trump … ",
    "url": "https://www.axios.com/2024/03/13/why-democrats-black-hispanic-vote-republican"
  },
  {
    "text": "Arkansas stops offering ‘X’ as an alternative to male and female on driver's licenses and IDs  —  Arkansas will no longer allow residents to use “X” instead of male or female on state-issued driver's licenses or identification cards, officials announced under new rules Tuesday … ",
    "url": "https://apnews.com/article/arkansas-licenses-gender-nonbinary-intersex-huckabee-sanders-61ca930c323cb36844ab304dfde5dd61"
  },
  {
    "text": "Georgia Republican Primary Election Results  —  See the Democratic p rimary r esults ›  —  Donald J. Trump wins the Georgia Republican primary.  —  Race called by The Associated Press.",
    "url": "https://www.nytimes.com/interactive/2024/03/12/us/elections/results-georgia-republican-presidential-primary.html"
  },
  {
    "text": "Discharge Petition No. 9, Bill Number: H.Res. 1016, 118th Congress  —  SPONSOR: James P. McGovern DESCRIPTION: Pursuant to clause 2 of rule XV, I, James P. McGovern, move to discharge the Committee on Rules from the consideration of the resolution entitled, a resolution providing for consideration of the bill … ",
    "url": "https://clerk.house.gov/DischargePetition/2024031209?CongressNum=118"
  },
  {
    "text": "Pentagon alerted of potential ‘maritime mass migration’ from Haiti  —  The Department of Defense revealed that it was alerted of a possible “maritime mass migration” from Haiti amid deteriorating conditions in the country.  —  During a House hearing, Rep. Matt Gaetz (R-FL) … ",
    "url": "https://www.washingtonexaminer.com/policy/national-security/2917284/pentagon-alerted-potential-maritime-mass-migration-haiti/"
  }
]