[
  {
    "text": "J.D. Vance Awkwardly Retreats After Bizarre Attempt to Storm Harris' Empty Plane  —  NO, NOT WEIRD  —  The made-for-TV moment was so weird that it could have been a page taken right out of the script of political TV show “Veep”.  —  J.D. Vance briskly marched up to Air Force 2 … ",
    "url": "https://www.thedailybeast.com/jd-vance-awkwardly-retreats-from-confronting-kamala-harris-on-air-force-2-after-realizing-she-wasnt-around"
  },
  {
    "text": "Trump complains about campaign as advisers try to focus on attacking Harris  —  The GOP nominee has grown increasingly upset about Kamala Harris's surging poll numbers and media coverage since replacing Joe Biden on the ticket.  —  Donald Trump's candidacy appeared all but destined for victory only weeks ago.",
    "url": "https://www.washingtonpost.com/politics/2024/08/07/trump-election-campaign/"
  },
  {
    "text": "Harris Shuts Down Trumpian ‘Lock Him Up’ Chants  —  CROWD CONTROL  —  Supporters in Wisconsin were just winding up against Donald Trump when Kamala Harris told them to “hold on.”  —  Democratic presidential nominee Kamala Harris stopped her fans from getting too wild with their Trump bashing … ",
    "url": "https://www.thedailybeast.com/kamala-harris-shuts-down-trumpian-lock-him-up-chants"
  },
  {
    "text": "BREAKING: The New York Times helps JD Vance Swiftboat Tim Walz  —  Tim Walz “enlisted Army National Guard in Nebraska in 1981 and retired honorably in 2005,” according to his military records.  Months after Tim Walz retired from the Army National Guard in 2005, his unit received orders to deploy to Iraq.",
    "url": "https://www.findinggravity.net/p/breaking-the-new-york-times-helps"
  },
  {
    "text": "Right-wing media push old debunked smear of Walz's military record despite his 24 years of service  —  National Guards members who served with Walz praised him and supported his decision to retire to run for Congress, where he helped veterans  —  Right-wing media are reviving old smears pushed … ",
    "url": "https://www.mediamatters.org/tim-walz/right-wing-media-push-old-debunked-smear-walzs-military-record-despite-his-24-years"
  },
  {
    "text": "Republicans start tearing down Walz by going after his military record  —  The charge has been led by Vance, a veteran who served in Iraq, going after Walz's decision to leave the National Guard to run for public office.  —  Donald Trump's presidential campaign is homing in on what advisers … ",
    "url": "https://www.nbcnews.com/politics/2024-election/republicans-vance-start-tearing-walz-going-military-record-rcna165564"
  },
  {
    "text": "Vance reopens line of attack into Walz's military record as two veterans now vie to be vice president  —  Donald Trump's running mate Ohio Sen. JD Vance stepped up his attacks on Minnesota Gov. Tim Walz's portrayal of his military career, accusing him of ducking service in Iraq when he left … ",
    "url": "https://www.cnn.com/2024/08/07/politics/tim-walz-military-record-vance-attack"
  },
  {
    "text": "JD Vance Is on a Stalker Tour of Swing States  —  Following Kamala Harris and Tim Walz on the campaign trail, Vance just reinforces the notion: He's creepy.  —  Pocket  —  One of my favorite moments in that Harris-Walzapalooza in Philadelphia last night was when second gentleman Doug … ",
    "url": "https://www.thenation.com/article/politics/j-d-vance-trump-rallies/"
  },
  {
    "text": "Tim Walz's Sudden Rise in the Democratic Party Was No Accident  —  More than a year ago, Tim Walz and his aides decided to be ready in case an irresistible opportunity arose.  Their tightly held strategy helped them catch political lightning in a bottle.  —  Shortly after the 2022 midterms … ",
    "url": "https://www.nytimes.com/2024/08/07/us/politics/tim-walz-kamala-harris-2024.html"
  },
  {
    "text": "Trump took a private flight with Project 2025 leader in 2022  —  Trump took the flight to speak at a Heritage Foundation conference, where he said, “They're going to lay the groundwork and detail plans for exactly what our movement will do.”  —  Republican presidential nominee Donald Trump … ",
    "url": "https://www.washingtonpost.com/elections/2024/08/07/trump-heritage-project-2025-roberts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMDAzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0Mzg1NTk5LCJpYXQiOjE3MjMwMDMyMDAsImp0aSI6IjU5YWFlZjcyLWU1ZDgtNGE1NC04MWZiLTdkYWVjNDIxOGU1ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbGVjdGlvbnMvMjAyNC8wOC8wNy90cnVtcC1oZXJpdGFnZS1wcm9qZWN0LTIwMjUtcm9iZXJ0cy8ifQ.2HhqEQNVoqvh9Bm-KPcK5zwpQDNFngVH67ucIvuc1uY&itid=gfta"
  },
  {
    "text": "Biden “not confident” Trump will accept 2024 election results  —  President Biden said he is “not confident at all” that there will be a peaceful transfer of power in January 2025 if former President Donald Trump is defeated.  —  “He means what he says.  We don't take him seriously.  He means it.",
    "url": "https://www.cbsnews.com/news/biden-on-dropping-out-2024-race-donald-trump-cbs-sunday-morning-exclusive-interview/"
  },
  {
    "text": "Despite new criticism, Trump told Walz in 2020 he was ‘very happy’ with his handling of George Floyd protests  —  GOP critics are seizing on the VP candidate's handling of the protests.  —  In this June 3, 2020, file photo, Minnesota Governor Tim Walz speaks to the press in St. Paul, Minnesota.",
    "url": "https://abcnews.go.com/US/despite-new-criticism-trump-told-walz-2020-happy/story?id=112616502"
  },
  {
    "text": "Elon Musk's X accused of bias after pro-Harris accounts labeled as ‘spam’  —  A string of incidents raises questions about whether X is restricting accounts that oppose Musk's political views, or just mishandling a rush of political speech.  —  SAN FRANCISCO — Prominent X accounts advocating … ",
    "url": "https://www.washingtonpost.com/technology/2024/08/07/musk-x-harris-bias/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMDAzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0Mzg1NTk5LCJpYXQiOjE3MjMwMDMyMDAsImp0aSI6ImYwYTQxYzg5LTkxM2YtNDQzZS1iMDFhLThmZGYxZGZjMWI5YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDgvMDcvbXVzay14LWhhcnJpcy1iaWFzLyJ9.3zf8AO3IHgMKLhayUjTwOQKod87Pm481Pn5P6j8v0y0&itid=gfta"
  },
  {
    "text": "Former aides of John McCain throw support to Democratic Senate candidate Ruben Gallego  —  Two former state directors for the late former Sen. John McCain, the 2008 Republican presidential nominee, are supporting Democratic Rep. Ruben Gallego's bid for U.S. Senate.",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/08/07/ruben-gallego-gets-across-the-aisle-support-from-mccain-republicans/74696886007/"
  },
  {
    "text": "Why the Harris Walz Camo Hat Is Becoming a Status Symbol for Liberals  —  Nearly $1 million worth of Walz inspired hats have been sold through the Harris campaign.  —  Before 2015, a red hat was just a red hat.  A bold choice, sure, but not one that made everyone look twice to read what was embroidered on the front of it.",
    "url": "https://www.teenvogue.com/story/why-the-harris-walz-camo-hat-is-becoming-a-status-symbol-for-liberals"
  },
  {
    "text": "Electoral College Rating Changes: GA Back to Toss-up, MN/NH Better for Democrats  —  KEY POINTS FROM THIS ARTICLE  — In the few weeks that Vice President Kamala Harris has emerged as Democrats' standard bearer, she has “reset” the electoral map to some degree, as she has polled better … ",
    "url": "https://centerforpolitics.org/crystalball/electoral-college-rating-changes-ga-back-to-toss-up-mn-nh-better-for-democrats/"
  },
  {
    "text": "Why Steve Martin declined Lorne Michaels' offer to play Tim Walz on ‘SNL’  —  Not long after Vice President Kamala Harris, the Democratic nominee for president, picked Minnesota's Gov. Tim Walz as her running mate, social media users began to line up candidates to play Walz when “Saturday Night Live” returns in the fall.",
    "url": "https://www.latimes.com/entertainment-arts/tv/story/2024-08-07/steve-martin-will-not-play-tim-walz-on-saturday-night-live"
  },
  {
    "text": "Governor Glenn Youngkin Issues Executive Order to Codify Comprehensive Election Security Measures to Protect Legal Voters and Accurate Counts  —  RICHMOND, VA — Governor Glenn Youngkin today issued Executive Order 35, which codifies the election security procedures put into place during his administration … ",
    "url": "https://www.governor.virginia.gov/newsroom/news-releases/2024/august/name-1031585-en.html"
  }
]