[
  {
    "text": "Department of Defense Security for the Protection of Department of Homeland Security Functions  —  MEMORANDUM FOR THE SECRETARY OF DEFENSE  —  THE ATTORNEY GENERAL THE SECRETARY OF HOMELAND SECURITY  —  Numerous incidents of violence and disorder have recently occurred and threaten … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/06/department-of-defense-security-for-the-protection-of-department-of-homeland-security-functions/"
  },
  {
    "text": "Trump Administration Says National Guard Will Be Deployed to L.A. Protests  —  Streets of Paramount, Calif., in Los Angeles County were in chaos as federal immigration officials squared off with protesters, using tear gas and flash-bang grenades.  —  The Trump administration said it planned … ",
    "url": "https://www.nytimes.com/2025/06/07/us/la-immigration-raids-ice.html"
  },
  {
    "text": "Newsom blasts deployment of National Guard to LA as ‘purposefully inflammatory’  —  The California governor said the federal government is deploying 2,000 soldiers amid unrest over immigration sweeps in Los Angeles.  —  LOS ANGELES — California Gov. Gavin Newsom on Saturday denounced … ",
    "url": "https://www.politico.com/news/2025/06/07/newsom-national-guard-los-angeles-00393526"
  },
  {
    "text": "Trump deploying California National Guard over governor's objections to LA to quell protests  —  President Donald Trump is deploying 2,000 California National Guard troops over the governor's objections to Los Angeles where protests Saturday led to clashes between immigration authorities and demonstrators.",
    "url": "https://apnews.com/article/immigration-raids-los-angeles-2d1d5e2f638da600c4b34fe8bf8cf3aa"
  },
  {
    "text": "Trump activates National Guard in L.A.-area protests  —  California Gov. Gavin Newsom condemned the move  —  LOS ANGELES — President Donald Trump on Saturday ordered the California National Guard to Los Angeles to intervene in protests of immigration sweeps, a move condemned by California Gov. Gavin Newsom (D).",
    "url": "https://www.washingtonpost.com/politics/2025/06/07/los-angeles-immigration-protests-national-guard/"
  },
  {
    "text": "Trump deploys National Guard after second day of Los Angeles immigration protests  —  Video Ad Feedback  —  CNN on scene where clashes between protesters and federal enforcement officers took place  —  CNN on scene where clashes between protesters and federal enforcement officers took place",
    "url": "https://cnn.com/2025/06/06/us/los-angeles-immigration-enforcement-protesters"
  },
  {
    "text": "Live updates: Trump to deploy National Guard in L.A. amid protests over immigration raids  —  California Gov. Gavin Newsom said the move is unnecessary and will escalate tensions after limited protests over federal immigration raids in the Los Angeles area.",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/paramount-california-home-depot-protest-rcna211650#rcrd80998"
  },
  {
    "text": "Live updates: Protests erupt outside Los Angeles-area Home Depot amid federal enforcement operations  —  People were seen chanting and yelling while walking along the street near a Home Depot in Paramount, about 15 miles from downtown Los Angeles. … Feds moving to ‘take over’ California National Guard, Gov. Newsom says",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/paramount-california-home-depot-protest-rcna211650"
  },
  {
    "text": "White House aide calls Los Angeles anti-ICE protests an ‘insurrection’  —  Federal agents in Los Angeles on Saturday faced off against demonstrators protesting immigration raids following Friday's protests that senior White House aide Stephen Miller condemned as an “insurrection” against the United States.",
    "url": "https://www.reuters.com/world/us/white-house-aide-calls-los-angeles-anti-ice-protests-an-insurrection-2025-06-07/"
  },
  {
    "text": "Trump says Elon Musk will face ‘very serious consequences’ if he funds Democratic candidates  —  In an interview with NBC News, the president also said he assumes his relationship with the tech billionaire is over following their recent falling out.  —  President Donald Trump on Saturday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-elon-musk-consequences-funds-democratic-candidates-rcna211605"
  },
  {
    "text": "NASA, Pentagon push for SpaceX alternatives amid Trump's feud with Musk  —  The fight between President Donald Trump and Elon Musk highlights the government's outsized dependence on a single company for missions.  —  NASA and Pentagon officials moved swiftly this week to urge competitors … ",
    "url": "https://www.washingtonpost.com/technology/2025/06/07/trump-musk-spacex-nasa-national-security/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MjY4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNjUxMTk5LCJpYXQiOjE3NDkyNjg4MDAsImp0aSI6ImVhNjUwNWE2LTA4NmYtNDg4Zi05YzhlLWEwNjk4YzYxODI4NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDYvMDcvdHJ1bXAtbXVzay1zcGFjZXgtbmFzYS1uYXRpb25hbC1zZWN1cml0eS8ifQ.Iila_cuA9PeViYr9JwWcIHNlu-o-svv5N1flR0uZGEg&itid=gfta"
  },
  {
    "text": "Colombia Candidate Fighting for Life After Assassination Bid  —  Surgeons are operating on Colombian presidential candidate Miguel Uribe Turbay after an assassination attempt that recalled the political violence that roiled the nation in the 1980s and 1990s.",
    "url": "https://www.bloomberg.com/news/articles/2025-06-07/colombia-presidential-candidate-uribe-shot-in-bogota-semana"
  },
  {
    "text": "Trump says he thinks the government has a ‘very easy case’ against Kilmar Abrego Garcia  —  In an interview with NBC News, the president said it was the Justice Department's decision, not his, to bring the Maryland man back to the U.S.  —  President Donald Trump on Saturday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-thinks-government-easy-case-kilmar-abrego-garcia-rcna211606"
  },
  {
    "text": "Conservatives on SCOTUS give DOGE the go-ahead  —  A one-two punch: DOGE gets access to your data, but the public is restricted from getting information about DOGE.  —  On Friday afternoon, heading into the weekend, the U.S. Supreme Court told the Trump administration that the non-department Department … ",
    "url": "https://www.lawdork.com/p/conservatives-on-scotus-give-doge"
  },
  {
    "text": "Beyond Musk, Senators face another budget bill foe — callers  —  5 Calls app's internal data shows consistent, monthlong opposition to Trump's “disgusting abomination” budget bill. … After the breakup with Elon Musk, Donald Trump's budget bill has been rechristened a “disgusting abomination … ",
    "url": "https://www.allrisenews.com/p/budget-bill-reps"
  }
]