[
  {
    "text": "Read the full transcript: President Donald Trump interviewed by ‘Meet the Press’ moderator Kristen Welker  —  Trump spoke on a range of topics in the May 2025 interview, including the state of the economy, foreign affairs, immigration, electoral politics and more.  —  KRISTEN WELKER:",
    "url": "https://www.nbcnews.com/politics/trump-administration/read-full-transcript-president-donald-trump-interviewed-meet-press-mod-rcna203514"
  },
  {
    "text": "Ron Johnson on a potential recession: ‘You have to act boldly’  —  Sen. Ron Johnson (R-Wis.) weighed in on the potential recession due to the Trump administration's economic policies, noting that “you have to act boldly” to clean up a mess.  —  Johnson joined CNN's “State of the Union” … ",
    "url": "https://thehill.com/homenews/senate/5281683-trump-economic-policies-recession-ron-johnson/"
  },
  {
    "text": "Trump, asked if he has to ‘uphold the Constitution,’ says, 'I don't know'  —  Trump said on NBC News' “Meet the Press” that he's following lawyers' advice as he tries to execute rapid deportations, arguing that giving immigrants due process is time-consuming.",
    "url": "https://www.nbcnews.com/politics/trump-administration/trump-asked-uphold-constitution-says-dont-know-rcna204580"
  },
  {
    "text": "Trump says 'I don't know' when asked if he's required to uphold Constitution  —  The president also downplayed fears of a recession and spoke of potential successors when his four-year term ends in an NBC interview.  —  WEST PALM BEACH, Fla. — President Donald Trump, asked during an interview on NBC News's … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/04/trump-nbc-interview-constitution-economy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MzMxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NzEzNTk5LCJpYXQiOjE3NDYzMzEyMDAsImp0aSI6IjQ0NzE5NGM5LWMzOWMtNGIzMC05ZWRkLWJjMjBiMWM3NTM5MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzA0L3RydW1wLW5iYy1pbnRlcnZpZXctY29uc3RpdHV0aW9uLWVjb25vbXkvIn0.ts5YWWrQEfp-OXw7r84u2vY5gmzwSiqLWI-3Joier-Q&itid=gfta"
  },
  {
    "text": "The Signal Clone the Trump Admin Uses Was Hacked  —  A hacker has breached and stolen customer data from TeleMessage, an obscure Israeli company that sells modified versions of Signal and other messaging apps to the U.S. government to archive messages, 404 Media has learned.",
    "url": "https://www.404media.co/the-signal-clone-the-trump-admin-uses-was-hacked/"
  },
  {
    "text": "Trump Administration Slashes Research Into L.G.B.T.Q. Health  —  More than $800 million in N.I.H. grants canceled as of early May — nearly half of those terminated to date — covered the health of sexual and gender minority groups, The Times found.  —  The Trump administration has scrapped … ",
    "url": "https://www.nytimes.com/2025/05/04/health/trump-administration-slashes-research-into-lgbtq-health.html?unlocked_article_code=1.Ek8.knZN.jTTK7yMhzd_d&smid=url-share"
  },
  {
    "text": "Trump Administration Live Updates: President Casts Doubt on Due Process Rights  —  Where Things Stand  — Trump on due process: President Trump said in an interview aired on Sunday that he did not know whether every person on American soil was entitled to due process … ",
    "url": "https://www.nytimes.com/live/2025/05/04/us/trump-news"
  },
  {
    "text": "Trump says he will reopen Alcatraz prison  —  President Donald Trump says he is directing his government to reopen and expand Alcatraz, the notorious former prison on a California island.  In a message on his Truth Social site Sunday evening, Trump wrote that, “For too long … ",
    "url": "https://apnews.com/article/trump-alcatraz-prison-fabe3385415ae03829d44e50efb3c1fb"
  },
  {
    "text": "Trump orders feds to reopen Alcatraz to house 'America's most ruthless and violent' criminals  —  President Donald Trump is calling for the notorious prison and now historical landmark, Alcatraz, in San Francisco, California, to be rebuilt larger and reopened to house the country's most ruthless and violent criminals.",
    "url": "https://www.foxnews.com/politics/trump-orders-feds-reopen-alcatraz-house-americas-most-ruthless-violent-criminals"
  },
  {
    "text": "Trump on using military force says “I don't see it with Canada,” but “something could happen with Greenland.”  —  President Trump said he would talk to Canadian Prime Minister Mark Carney about making Canada the 51st state.  But the president said he didn't expect it to get to the point … ",
    "url": "https://www.cbsnews.com/news/trump-greenland-military-force-canada/"
  },
  {
    "text": "Catholic leaders criticize Trump for posting apparent AI photo of himself as the pope  —  Some Catholic leaders and at least one U.S. Catholic group are criticizing President Trump after he posted on social media what appears to be an artificial intelligence-generated image of himself dressed as the pope.",
    "url": "https://www.npr.org/2025/05/04/nx-s1-5386516/catholic-leaders-criticize-trump-ai-pope-photo"
  },
  {
    "text": "Democrats Denounce Rubio Holding Four Roles in Trump Administration  —  “There's no way he can carry all that entire load on his own,” Sen. Tammy Duckworth said of Rubio occupying multiple jobs in the executive branch  —  Secretary of state, acting administrator for USAID, acting lead archivist, acting national security adviser.",
    "url": "https://www.rollingstone.com/politics/politics-news/democrats-rubio-four-roles-trump-administration-1235331112/"
  },
  {
    "text": "Trump's 48-hour scramble to fly migrants to a Salvadoran prison  —  The administration rounded up some of the Venezuelans two days before the flights took off, pressing forward even as Venezuela agreed to accept deportees.  —  The message from Secretary of State Marco Rubio … ",
    "url": "https://www.washingtonpost.com/immigration/2025/05/04/trump-el-salvador-alien-enemies-act-venezuelans/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MzMxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NzEzNTk5LCJpYXQiOjE3NDYzMzEyMDAsImp0aSI6IjhhOTQ4MDU5LTU2YjQtNGQyZC1hZDQ0LTVmNWJlNDkzNDMzNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA1LzA0L3RydW1wLWVsLXNhbHZhZG9yLWFsaWVuLWVuZW1pZXMtYWN0LXZlbmV6dWVsYW5zLyJ9.NX0-UlQELrhci3ft5ktVwQ1VpmPffOelKB_JoptGd_0&itid=gfta"
  },
  {
    "text": "Biden Aides Decided Against a Cognitive Test in Early 2024, Book Says  —  His White House advisers considered giving him such a test to prove his fitness for a second term, but they worried it would draw new attention to his age, according to a forthcoming book.",
    "url": "https://www.nytimes.com/2025/05/04/us/politics/joe-biden-cognitive-test-age.html"
  },
  {
    "text": "Justice Department lawyers face skeptical judges upset by ‘shoddy work’  —  As they defend against more than 200 lawsuits challenging President Donald Trump's initiatives, some government lawyers are getting scolded from the bench.  —  Justice Department lawyers defending … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/04/trump-policies-lawyers-court-judges-unimpressed/"
  },
  {
    "text": "The White House's Next Orchestrated Budget Crisis … This is something I'm still trying to get my head around - both the technical legislative details as well as how all this plays in political terms.  The details are still fuzzy to me but I want to get the outlines in front of you.",
    "url": "https://talkingpointsmemo.com/edblog/the-white-houses-next-orchestrated-budget-crisis"
  },
  {
    "text": "The Trump family is taking crypto payoffs in the middle of Fifth Avenue.  Who will stop them?  —  A trucking logistics magnate from Monterrey, Mexico, named Javier Selgas didn't need to direct a rig laden with crypto cash toward Trump Tower on New York's gilded Fifth Avenue … ",
    "url": "https://www.inquirer.com/opinion/commentary/trump-corruption-cryptocurrency-abu-dhabi-20250504.html"
  },
  {
    "text": "These Thinkers Set the Stage for Trump the All-Powerful  —  With a blitz of moves in his 100 days in office, President Trump has sought to greatly enlarge executive power.  The typical explanation is that he's following and expanding a legal idea devised by conservatives during the Reagan administration, the unitary executive theory.",
    "url": "https://www.nytimes.com/2025/05/04/opinion/trump-schmitt-strauss-intellectuals.html?unlocked_article_code=1.Ek8.hhQi.Za3SoEmn5ezY&smid=url-share"
  }
]