[
  {
    "text": "Trump expected to announce Stephen Miller as deputy chief of staff for policy  —  President-elect Donald Trump is expected to announce in the coming days that Stephen Miller, his top immigration adviser, will serve as White House deputy chief of staff for policy, two sources familiar with the plans told CNN.",
    "url": "https://www.cnn.com/2024/11/11/politics/stephen-miller-trump-administration/"
  },
  {
    "text": "White House pushes back on Trump call to halt confirmations in lame duck period  —  A White House spokesperson on Monday pushed back on President-elect Trump's demand that the Democratic Senate stop confirming judges during the lame-duck period before he takes office and the upper chamber flips to GOP control.",
    "url": "https://thehill.com/homenews/administration/4984559-white-house-trump-lame-duck-judicial-confirmations-senate/"
  },
  {
    "text": "Alexandria Ocasio-Cortez Directly Addresses People Who Voted For Both Her And Trump  —  “I'm listening,” the New York Democrat said.  —  LOADING  —  Rep. Alexandria Ocasio-Cortez (D-N.Y.) on Sunday reflected on Donald Trump's success in last week's election and engaged with supporters … ",
    "url": "https://www.huffpost.com/entry/aoc-trump-voters_n_67320370e4b052f25adcff55"
  },
  {
    "text": "Authoritarianism Expert Shatters A Trump ‘Illusion’: ‘One Of The Biggest Scams Of All’  —  Ruth Ben-Ghiat said this reason for voting for Trump would have “very sad” consequences.  —  LOADING  —  Authoritarianism expert Ruth Ben-Ghiat spoke on MSNBC's “The Weekend” about one particular appeal … ",
    "url": "https://www.huffpost.com/entry/ruth-ben-ghiat-donald-trump-scam_n_6731e1a0e4b0231a203af70c"
  },
  {
    "text": "Trump selects Lee Zeldin to lead EPA  —  President-elect Trump has selected former Rep.  Lee Zeldin (R-N.Y.) to lead the Environmental Protection Agency, putting a second New Yorker and loyalist into his forming Cabinet.  —  “I am pleased to announce that the Highly Respected former Congressman … ",
    "url": "https://thehill.com/homenews/administration/4984481-trump-lee-zeldin-epa/"
  },
  {
    "text": "Trump picks Lee Zeldin to lead EPA — adding second NYer to cabinet  —  WASHINGTON — President-elect Donald Trump has selected former Rep. Lee Zeldin to serve as administrator of the Environmental Protection Agency, The Post can exclusively report.  —  Zeldin, 44, served four terms … ",
    "url": "https://nypost.com/2024/11/11/us-news/trump-picks-lee-zeldin-to-lead-epa-adding-second-nyer-to-cabinet/"
  },
  {
    "text": "John Oliver Exposes Trump's Likely Cabinet: ‘Oops!  All A**holes’  —  ‘IDIOTS, FREAKS’  —  The late-night host ran through some concerns surrounding potential Trump administration picks.  —  Talk of who will fill President-elect Donald J. Trump's new Cabinet has already inspired rampant speculation … ",
    "url": "https://www.thedailybeast.com/john-oliver-exposes-trumps-likely-cabinet-oops-all-aholes/"
  },
  {
    "text": "He Went To A White Supremacist Event.  Now He'll Oversee Trump's Mass Deportations.  —  “We are going to have a historic deportation operation,” Tom Homan promised this summer.  —  LOADING  —  In February 2022, Tom Homan went to the Orlando World Center Marriott in Orlando, Florida … ",
    "url": "https://www.huffpost.com/entry/tom-homan-white-supremacist-event-border-czar-trump_n_67326794e4b07ebab74212ff"
  },
  {
    "text": "Trump calls on GOP senators vying to be majority leader to agree to recess appointments  —  President-elect Donald Trump is demanding Republican senators vying to be majority leader support recess appointments for his nominees — a way for presidents to essentially bypass Congress that has recently been blocked by the minority party.",
    "url": "https://www.cnn.com/2024/11/10/politics/trump-senate-recess-appointments-gop-leader/"
  },
  {
    "text": "The Democrats' Senate Nightmare Is Only Beginning  —  Democrats in mourning over Donald Trump's victory can comfort themselves with the fact that, if the United States follows the pattern of other democracies that elect wannabe strongmen, their party should have a very good chance to win back the White House in 2028.",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/democrats-senate-nightmare/680620/"
  },
  {
    "text": "‘Hail Hitler and hail Trump’: People wave Nazi flags outside Jewish play in Michigan  —  President-elect Donald Trump's reelection was credited for emboldening a group of people waving Nazi flags in Michigan over the weekend.  —  WLNS reported that the flags were seen in two cities, including at a Jewish play.",
    "url": "https://www.rawstory.com/nazi-flags-michigan/"
  },
  {
    "text": "COP29 climate summit begins today in Baku.  Will it be the last for the U.S.?  —  As delegates from nearly 200 countries gather for a major international summit on addressing the threat of climate change, they're confronting a new era of uncertainty for the United States' climate commitments … ",
    "url": "https://www.cbsnews.com/news/cop29-climate-change-summit-baku-azerbaijan/"
  },
  {
    "text": "Markwayne Mullin Under Consideration for Trump Appointment to Interior or Veterans Affairs  —  The Oklahoma senator becomes the latest congressional Republican floated as a cabinet secretary.  — Copy  —  As President-elect Donald Trump's transition team looks at building out a cabinet … ",
    "url": "https://www.notus.org/trump-2024/markwayne-mullin-trump-appointment-interior-veterans-affairs"
  },
  {
    "text": "DOJ says Jack Smith's delay in Trump case is no reason to do the same for Jan. 6 defendants  —  Special counsel Jack Smith's decision to pause his prosecution of President-elect Donald Trump is no reason to do the same for members of the mob that attacked the Capitol on Jan. 6, 2021, the Justice Department argued Monday.",
    "url": "https://www.politico.com/live-updates/2024/11/11/congress/department-of-justice-january-6-cases-00188804"
  },
  {
    "text": "Elon Musk weighing in on Trump staffing decisions: Sources  —  Musk has been with Trump nearly every day since the election, sources say.  —  Elon Musk, chief executive officer of Tesla Inc., left, and Donald Trump, prior to a campaign event at the Butler Farm Show in Butler, Pennsylvania, Oct. 5, 2024.",
    "url": "https://abcnews.go.com/Politics/elon-musk-weighing-trump-staffing-decisions-sources/story?id=115730434"
  },
  {
    "text": "Warren: Trump transition ‘already breaking the law’  —  Sen. Elizabeth Warren (D-Mass.) said on Monday that President elect-Trump “and his transition team are already breaking” a law on presidential transition.  —  “Donald Trump and his transition team are already breaking the law,” Warren said in a post on the social platform X.",
    "url": "https://thehill.com/homenews/campaign/4984590-trump-transition-law-violation-elizabeth-warren/"
  },
  {
    "text": "Far-right leaders are winning across the globe.  Blaming ‘the economy’ or ‘the left-behinds’ won't cut it  —  The economy matters, but the likes of Trump succeed by offering voters revenge for problems both real and imagined  —  Donald Trump, for the first time, won a majority of the popular vote.",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/11/far-right-leaders-economy-voters"
  },
  {
    "text": "Trump Plans Series of Executive Orders for Day 1, Susie Wiles Tells Donors  —  Ms. Wiles, the next White House chief of staff, said Donald Trump would move quickly to reinstate orders from his first term that President Biden had revoked, though she did not specify which ones.",
    "url": "https://www.nytimes.com/2024/11/11/us/politics/trump-executive-orders-susie-wiles.html"
  },
  {
    "text": "Markets Hail Trump's Economics  —  He'll repair the Biden damage, and his pro-growth agenda will drive private investment.  —  Twenty-three Nobel laureates in economics warned two weeks ago that Donald Trump's economic agenda would be disastrous for the U.S. Immediately after Mr. Trump's landslide victory … ",
    "url": "https://www.wsj.com/opinion/markets-hail-trumps-economics-he-will-repair-biden-damage-pro-growth-investment-boost-f3954dbe"
  }
]