[
  {
    "text": "George Santos Accused Of Stealing House Member's Personal Credit Card Info  —  GOP Rep. Max Miller of Ohio made the allegation not long before Santos was expelled from Congress.  —  Rep. Max Miller (R-Ohio) accused his now-former GOP colleague George Santos of stealing his and his mother's … ",
    "url": "https://www.huffpost.com/entry/max-miller-george-santos-expelled_n_656a0ee7e4b066e398b77240"
  },
  {
    "text": "House Expels George Santos From Congress in Historic Vote  —  Mr. Santos, a New York Republican, is the sixth member of the House to be expelled in the body's history.  “To hell with this place,” he said after his colleagues ousted him.  —  Back  —  TRANSCRIPT  —  House Ousts George Santos From Office in Bipartisan Vote",
    "url": "https://www.nytimes.com/live/2023/12/01/nyregion/george-santos-expulsion-vote"
  },
  {
    "text": "DC diner unveils ‘Adios Santos’ cocktail after expulsion vote  —  A Washington restaurant is toasting now-former Rep. George Santos's expulsion from Congress by hawking a new cocktail marking the New York Republican's ouster.  —  Sticky Fingers Diner, in the District's H Street Corridor … ",
    "url": "https://thehill.com/blogs/in-the-know/4337847-dc-adios-santos-expulsion-vote/"
  },
  {
    "text": "40 bills that didn't get a single vote: What Rep. George Santos did in Congress  —  An NBC News analysis of the New York Republican's legislative record shows few accomplishments and little support from his colleagues.  —  WASHINGTON — Former Rep. George Santos, R-N.Y. … ",
    "url": "https://www.nbcnews.com/politics/congress/george-santos-bills-vote-congress-legislative-career-rcna127464"
  },
  {
    "text": "Sparks flew behind the scenes at the Ron DeSantis and Gavin Newsom debate  —  While the candidates said they were happy to keep debating for longer than 90 minutes, an intervention from the California governor's wife put a stop to it.  —  Florida Gov. Ron DeSantis and California Gov. Gavin Newsom … ",
    "url": "https://www.nbcnews.com/politics/2024-election/gavin-newsom-fox-debate-rcna127563"
  },
  {
    "text": "Newsom camp: Hannity, DeSantis cheated.  They dispute the charges.  —  The messy prime-time event outside Atlanta between Gavin Newsom and Ron DeSantis didn't end when the Fox News cameras stopped.  Newsom's team says DeSantis and Fox broke several rules.  —  ALPHARETTA, Georgia — So much for that Newsom-Hannity bromance.",
    "url": "https://www.politico.com/news/2023/12/01/newsom-desanitis-debate-cheating-00129555"
  },
  {
    "text": "Trump can be held civilly liable in Jan. 6 riot, judges rule  —  Donald Trump can be held civilly liable for the actions of the mob that attacked the U.S. Capitol on Jan. 6, 2021, an appeals court ruled Friday in a long-awaited decision that could clear the way for lawsuits seeking financial damages from the former president.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/12/01/trump-can-be-sued-jan-6-immunity/"
  },
  {
    "text": "Trump may be sued over Jan. 6 incitement claims, appeals court panel rules  —  The three-judge panel turned aside Trump's sweeping argument that nearly all speech and conduct by an incumbent president should be shielded from lawsuits.  —  Donald Trump can be sued over claims that he incited violence … ",
    "url": "https://www.politico.com/news/2023/12/01/trump-may-be-sued-over-jan-6-incitement-claims-appeals-court-panel-rules-00129576"
  },
  {
    "text": "DeSantis Super PAC Suffers Another Big Staff Loss, This Time Its Chairman  —  The departure of Adam Laxalt, a longtime friend of the Florida governor, is the latest shake-up inside Never Back Down as it faces questions over the group's strategy and spending.",
    "url": "https://www.nytimes.com/2023/12/01/us/politics/desantis-super-pac-adam-laxalt.html"
  },
  {
    "text": "DeSantis campaign blames its own super PAC for leaks, bad TV advertising  —  The criticism comes amid an intensifying feud between Ron DeSantis' presidential campaign and Never Back Down.  —  Tensions between Ron DeSantis' struggling presidential campaign and his allied super PAC are boiling over … ",
    "url": "https://www.politico.com/news/2023/12/01/desantis-campaign-blames-its-own-super-pac-for-leaks-bad-tv-advertising-00129637"
  },
  {
    "text": "Sandra Day O'Connor, pathbreaking woman on Supreme Court, dies at 93  —  The court's first female justice was known for her independence on the bench  —  Sandra Day O'Connor, the first female U.S. Supreme Court justice, whose independence on a court that was often ideologically divided … ",
    "url": "https://www.washingtonpost.com/obituaries/2023/12/01/sandra-day-oconnor-supreme-court-justice-dead/"
  },
  {
    "text": "Walmart says it is not advertising on social platform X  —  Walmart (WMT.N) said on Friday it is not advertising on social media platform X, one of the latest brands to say it has dropped the Elon Musk-owned site.  —  “We aren't advertising on X as we've found other platforms to better reach our customers … ",
    "url": "https://www.reuters.com/business/retail-consumer/walmart-says-it-is-not-advertising-social-platform-x-2023-12-01/"
  },
  {
    "text": "Speaker Johnson wrote foreword for book filled with conspiracy theories and homophobic insults  —  Speaker of the House Mike Johnson wrote the foreword and publicly promoted a 2022 book that spread baseless and discredited conspiracy theories and used derogatory homophobic insults.",
    "url": "https://www.cnn.com/2023/12/01/politics/kfile-mike-johnson-conspiracy-theories-homophobic-slurs/"
  },
  {
    "text": "Why Cornel West Is Broke  —  Newly uncovered divorce filings reveal allegations of a “secret life” and help explain why the presidential candidate, who has earned millions of dollars over the years, has hardly anything left.  —  Cornel West has been a fixture of American society for more than three decades … ",
    "url": "https://www.forbes.com/sites/jemimadenham/2023/12/01/why-cornel-west-is-broke/"
  },
  {
    "text": "Biden Wants to Abolish the Fees Trump Charges at His Resorts  —  In going after Donald Trump's business practices, Joe Biden is combining a hit on his opponent with a boost of his own economic record. … Biden resorts to a fresh Trump attack  —  Ahead of the 2024 election … ",
    "url": "https://www.thedailybeast.com/joe-biden-wants-to-abolish-the-fees-donald-trump-charges-at-his-resorts"
  },
  {
    "text": "Behind the Curtain — Scoop: The Trump job applications revealed  —  We told you in a “Behind the Curtain” column last month that Trump allies are pre-screening the ideologies of thousands of potential appointees and employees in case he wins back the White House.",
    "url": "https://www.axios.com/2023/12/01/trump-government-job-applications-2025"
  }
]