[
  {
    "text": "Detroit synagogue president Samantha Woll found dead outside her home  —  A politically connected Detroit synagogue president was found stabbed dead this morning outside her home in the city's Lafayette Park neighborhood, east of downtown.  —  Samantha Woll, 40, led the Isaac Agree Downtown Detroit Synagogue … ",
    "url": "https://www.freep.com/story/news/local/michigan/detroit/2023/10/21/samantha-woll-dead-isaac-agree-downtown-detroit-synagogue-president/71271616007/"
  },
  {
    "text": "President of Detroit synagogue found stabbed to death outside home, police say  —  The president of a Detroit synagogue board was found dead Saturday morning with multiple stab wounds outside her home, police said.  —  The victim, Samantha Woll, was the president of the board … ",
    "url": "https://www.cnn.com/2023/10/21/us/detroit-synagogue-president-killing/"
  },
  {
    "text": "GOP lawmaker urges Republicans to sign unity pledge to back eventual Speaker nominee  —  Rep. Mike Flood (R-Neb.) is urging his caucus to vote together as chaos over the House Speakership continues, launching a unity pledge for lawmakers to commit to a single candidate.",
    "url": "https://thehill.com/homenews/house/4268966-gop-unity-pledge-house-speaker-nominee/"
  },
  {
    "text": "What to know about Speaker candidate Kevin Hern  —  The House GOP is in chaos amid attempts to elect a Speaker after Rep. Jim Jordan (R-Ohio) lost his third attempt at securing the gavel in a floor vote Friday.  —  Nine congressmen have stepped up for the job, or have signaled … ",
    "url": "https://thehill.com/homenews/house/4268915-kevin-hern-official-gop-speaker-bid/"
  },
  {
    "text": "Meet the Republicans Running for Speaker  —  The lawmakers vying for the job include veterans of the House, committee chairmen, a top member of Republican leadership and a sophomore.  —  At least 10 Republicans have announced that they will run for speaker or that they are considering doing so since Friday … ",
    "url": "https://www.nytimes.com/2023/10/22/us/politics/meet-the-republicans-running-for-speaker.html"
  },
  {
    "text": "'I'm disappointed': Even Tim Scott's friends and fans see a campaign on the ropes  —  Scott's polling is down, his super PAC is in retreat and his hometown newspaper is cheering on Nikki Haley instead.  —  Tim Scott's old friend and former colleague in the Senate, Cory Gardner, kept pleading with him to get on TV more.",
    "url": "https://www.politico.com/news/2023/10/22/tim-scott-disappointed-campaign-00122896"
  },
  {
    "text": "One GOP candidate can defeat Trump.  Clear the field for Haley.  —  Donald Trump won the GOP nomination in 2016 not because he was the choice of most Republican primary voters; he was not.  He won because, in a crowded field, he got more votes than any of his rivals in South Carolina, and then in later-voting states.",
    "url": "https://www.postandcourier.com/opinion/editorials/editorial-one-gop-candidate-can-defeat-trump-clear-the-field-for-haley/article_f805cfde-6d00-11ee-a8e9-f7d028b02e2a.html"
  },
  {
    "text": "More Bad News for Trump  —  It turns out it wasn't just a bad day for Trump, as I captioned my column Thursday night.  It was a bad week.  A really bad week.  —  After Sidney Powell's guilty plea, there was Kenneth Chesebro's plea.  His was to a felony charge of filing false information … ",
    "url": "https://joycevance.substack.com/p/more-bad-news-for-trump"
  },
  {
    "text": "Chesebro attorney argues client never believed Trump's ‘big lie’ of election fraud  —  Kenneth Chesebro, one of former President Trump's 18 co-defendants in the George election fraud case, didn't truly believe the 2020 election was stolen, according to his attorney.",
    "url": "https://thehill.com/regulation/court-battles/4268727-chesebro-attorney-client-never-believed-2020-election-fraud/"
  },
  {
    "text": "Statement From Secretary of Defense Lloyd J. Austin III on Steps to Increase Force Posture  —  Following detailed discussions with President Biden on recent escalations by Iran and its proxy forces across the Middle East Region, today I directed a series of additional steps to further strengthen … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3564874/statement-from-secretary-of-defense-lloyd-j-austin-iii-on-steps-to-increase-for/"
  },
  {
    "text": "EXCLUSIVE: Israeli morgue worker says horrors inflicted on Hamas's victims are ‘worse than the Holocaust’ including decapitated pregnant woman and her beheaded unborn child  — Shari says the atrocities committed by Hamas are ‘worse than the Holocaust’  — She and her team spend 12 hours a day cleaning mutilated corpses",
    "url": "https://www.dailymail.co.uk/news/article-12653435/Israeli-morgue-worker-says-horrors-inflicted-Hamass-victims-worse-Holocaust-including-decapitated-pregnant-woman-beheaded-unborn-child.html"
  },
  {
    "text": "U.S. Marshals Searching for Fugitive Wanted for the Murder of a State Judge  —  Pedro Manuel Argote now the target of an interstate manhunt  —  For Immediate Release  —  District of Maryland  —  (410) 362-7550  —  Baltimore, MD - The U.S. Marshals Service is seeking the public's assistance … ",
    "url": "https://www.usmarshals.gov/news/press-release/us-marshals-searching-fugitive-wanted-murder-of-state-judge"
  },
  {
    "text": "Google owes executive $1 million after losing gender bias lawsuit … A jury found Google guilty of sexual discrimination and awarded female Google Cloud executive Ulku Rowe, who filed the complaint, $1.1 million.  Rowe's lawsuit alleged that the company gave higher pay to less-experienced male cohorts … ",
    "url": "https://www.theverge.com/2023/10/21/23926501/google-cloud-lawsuit-ulku-rowe-verdict"
  },
  {
    "text": "Australia PM to visit China, reaches deal to resolve WTO wine dispute  —  Australian Prime Minister Anthony Albanese said on Sunday that he would travel to China from Nov. 4 to 7 to meet with President Xi Jinping and Premier Li Qiang, with the aim of ensuring a “stable and productive” relationship between the two countries.",
    "url": "https://www.reuters.com/world/australia-pm-says-deal-reached-with-china-resolve-wto-wine-dispute-2023-10-21/"
  }
]