[
  {
    "text": "Trump serves McDonald's fries to supporters in stage-managed campaign stop  —  Trump didn't answer a question on the minimum wage, instead promoting his unsubstantiated claim that Kamala Harris never worked at the burger chain.  —  Trump works fry station at McDonald's in Pennsylvania",
    "url": "https://www.washingtonpost.com/politics/2024/10/20/trump-mcdonalds-minimum-wage/"
  },
  {
    "text": "Trump Makes Fries at McDonald's in Bizarre Attempt to Troll Harris  —  The former president contends — without any evidence — that his opponent never worked at the fast food restaurant as she has said  —  Donald Trump is spending part of his Sunday afternoon behind the counter at a Pennsylvania McDonald's.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-mcdonalds-troll-harris-1235138509/"
  },
  {
    "text": "Harris and Trump locked in dead heat in seven-state poll, with some voters still deciding  —  Former president Donald Trump shows strength in Arizona while Vice President Kamala Harris runs strongest in Georgia, according to a Post-Schar School survey.",
    "url": "https://www.washingtonpost.com/politics/2024/10/21/harris-trump-post-schar-school-poll/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5NDgzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwODY5MTk5LCJpYXQiOjE3Mjk0ODMyMDAsImp0aSI6IjE2M2EwNjUyLTQ5NDgtNDZiZC1iN2Q4LWVkMDRjN2FlMzVlNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzIxL2hhcnJpcy10cnVtcC1wb3N0LXNjaGFyLXNjaG9vbC1wb2xsLyJ9.lEgHdbTMirhcJeNiVIGanUbJ0bH068brV3fXvYA1qFA&itid=gfta"
  },
  {
    "text": "Harris leads Trump 2-1 among the earliest voters, many driven by abortion access: new poll  —  Democrat Kamala Harris has a sweeping lead over Republican Donald Trump − among voters who have already cast their ballots, that is.  —  A new USA TODAY/Suffolk University Poll shows … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/21/harris-leads-trump-early-voting-abortion/75763483007/"
  },
  {
    "text": "Exclusive poll: Harris and Trump tied amid battle for Latino and Black voters  —  Susan Page Sudiksha Kochi Maya Marchel HoffUSA TODAY  —  Kamala Harris and Donald Trump are essentially tied as they head into the final stretch of the presidential campaign, an exclusive USA TODAY/Suffolk University Poll finds … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/21/harris-trump-tied-battle-latino-black-voters/75682566007/"
  },
  {
    "text": "State of the Race: A Slight Shift Toward Trump but Still No Clear Favorite  —  The polls are not precise enough for a 0.2-point edge to convey meaningful information.  —  With two weeks to go, the polls of the presidential election are starting to run out of room to get any closer.",
    "url": "https://www.nytimes.com/2024/10/21/upshot/trump-harris-polls-election.html"
  },
  {
    "text": "Scoop: Mike Johnson's tense text messages with Liz Cheney … - Johnson said the two “agreed to disagree” over whether Trump is a threat to democracy.  — Cheney disputed Johnson's characterization of the exchange, telling Axios that she and the speaker “used to be friends, but we did not ‘agree to disagree.’”",
    "url": "https://www.axios.com/2024/10/20/mike-johnson-liz-cheney-text-messages-trump"
  },
  {
    "text": "A statement from 60 Minutes  —  Former President Donald Trump is accusing 60 Minutes of deceitful editing of our Oct. 7 interview with Vice President Kamala Harris.  That is false.  —  60 Minutes gave an excerpt of our interview to Face the Nation that used a longer section of her answer than that on 60 Minutes.",
    "url": "https://www.cbsnews.com/news/60-minutes-statement/"
  },
  {
    "text": "McConnell backed Jack Smith, wanted Trump to “pay” for Jan. 6 … - “If he hasn't committed indictable offenses, I don't know what one is,” the longest-serving Republican leader told journalist Michael Tackett in an interview for “The Price of Power,” weeks after Smith brought the charges against Trump in August 2023.",
    "url": "https://www.axios.com/2024/10/20/mcconnell-trump-jack-smith-jan-6th-indictment"
  },
  {
    "text": "Harris Rallies Georgia's Black Churchgoers With Help Of Stevie Wonder  —  Harris celebrated her 60th birthday while visiting two Atlanta-area churches during campaign stops on Sunday.  —  LOADING  —  Kamala Harris on Sunday summoned Black churchgoers to turn out at the polls and got … ",
    "url": "https://www.huffpost.com/entry/kamala-harris-campaigns-black-churches-georgia-stevie-wonder_n_6715816ee4b0ae82147ff26c"
  },
  {
    "text": "Where are the polls?  —  Just by looking at the polls, you wouldn't know Election Day is 16 days away.  That's because there really aren't any new polls — or at least, many reliable ones.  And it's making it hard to discern just how close is the race between Kamala Harris and Donald Trump.",
    "url": "https://www.politico.com/live-updates/2024/10/20/2024-elections-live-coverage-updates-analysis/polls-trump-harris-00184538"
  },
  {
    "text": "The GOP has been using a campaign finance loophole to save on TV ads.  Now Dems are getting in on it.  —  Democrats are starting to use a campaign finance loophole to save big bucks on TV advertising — after failing to stop Republicans from doing the same.",
    "url": "https://www.politico.com/live-updates/2024/10/20/2024-elections-live-coverage-updates-analysis/slotkin-jfc-ad-00184540"
  },
  {
    "text": "The ‘Fascist’ Meme Returns  —  Why the public isn't buying this Democratic claim about Trump.  —  No doubt it was inevitable.  As Election Day nears, and the progressive panic over Donald Trump escalates, Democrats are closing their campaign with a favorite theme: Mr. Trump is a threat to the Constitution … ",
    "url": "https://www.wsj.com/opinion/the-fascist-meme-returns-donald-trump-election-voters-5e513359"
  },
  {
    "text": "One of the last Navajo Code Talkers from World War II dies at 107  —  John Kinsel Sr., one of the last remaining Navajo Code Talkers who transmitted messages during World War II based on the tribe's native language, has died.  He was 107.  —  Navajo Nation officials in Window Rock announced Kinsel's death on Saturday.",
    "url": "https://apnews.com/article/navajo-code-talkers-word-war-ii-5f527f43eebaede11eb86f7bdad27a39"
  },
  {
    "text": "Can the Media Survive? … On and off the record with:  —  Imran Amed, founder and editor-in-chief, The Business of Fashion.  Willa Bennett, editor-in-chief, Cosmopolitan and Seventeen.  Jeremy Boreing, co-founder and co-CEO, The Daily Wire.  Graydon Carter, founder and co-editor, Air Mail.",
    "url": "https://nymag.com/intelligencer/article/digital-media-industry-press-journalism-future.html"
  },
  {
    "text": "I'll stand for Russian president when Putin's gone, Navalny's widow tells BBC  —  Yulia Navalnaya intends to be president of Russia, she tells me.  She looks me straight in the eye.  No hesitation or wavering.  —  This, like so many of the decisions she made with her husband, the opposition leader Alexei Navalny, is unambiguous.",
    "url": "https://www.bbc.com/news/articles/ce3z4ydk90vo"
  },
  {
    "text": "Biden to Propose That Insurers Cover Over-the-Counter Birth Control  —  The new rules under the Affordable Care Act would include emergency contraception, a newly approved nonprescription birth control pill, spermicides and condoms.  —  The White House announced on Monday that it would propose … ",
    "url": "https://www.nytimes.com/2024/10/21/us/politics/biden-harris-birth-control-rules.html?unlocked_article_code=1.T04.0_KN.ahImNm_4ocdl&smid=url-share"
  },
  {
    "text": "1 in 5 Republicans want Trump to call election invalid if he loses … - The survey from the nonpartisan Public Religion Research Institute (PRRI) and the Brookings Institution is the latest sign of how Trump's grievances and conspiracy theories have reshaped his party — and whipped up its most disaffected, far-right elements.",
    "url": "https://www.axios.com/2024/10/21/republicans-trump-declare-election-invalid"
  },
  {
    "text": "Harris outraised Trump more than 3-to-1 in September  —  Kamala Harris' campaign outraised Donald Trump by more than 3-to-1 in September, with the vice president's massive $222 million haul further extending her financial advantage in the final stretch of a tight presidential election.",
    "url": "https://www.politico.com/live-updates/2024/10/20/2024-elections-live-coverage-updates-analysis/harris-trump-september-fec-fundraising-00184583"
  }
]