[
  {
    "text": "USDA says it accidentally fired officials working on bird flu and is trying to rehire them  —  In a statement, an Agriculture Department spokesperson told NBC News that officials are “working to swiftly rectify the situation.”  —  The United States Department of Agriculture on Tuesday acknowledged that … ",
    "url": "https://www.nbcnews.com/politics/doge/usda-accidentally-fired-officials-bird-flu-rehire-rcna192716"
  },
  {
    "text": "‘Russian asset’: Trump scorched over ‘disgusting’ comments blaming Ukraine for war  —  Critics blasted President Donald Trump after he followed up a proposed Ukrainian “peace plan” — that essentially gives Russia one-sided concessions for nothing — with a speech from his private residence … ",
    "url": "https://www.rawstory.com/trump-russia-ukraine/"
  },
  {
    "text": "Trump says Ukraine ‘should never have started it’ in comments about war with Russia  —  Trump made the remark while deriding Ukrainian President Volodymyr Zelenskyy, whose country was invaded by Russia in February 2022.  —  President Donald Trump suggested Tuesday that Ukraine was responsible … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-ukraine-should-never-have-started-it-remarks-war-russia-rcna192710"
  },
  {
    "text": "Senior U.S. prosecutor resigns, citing demands to open probe into Biden-era contract  —  The top federal prosecutor who supervised criminal cases at the Washington, D.C. U.S. Attorney's office resigned on Tuesday, citing what she described as an improper demand by officials appointed … ",
    "url": "https://ca.news.yahoo.com/senior-u-prosecutor-resigns-citing-150420249.html"
  },
  {
    "text": "Head of Justice Department's Washington, DC, criminal division quits  —  The head of the criminal division within the DC US Attorney's Office has left her post, according to four sources.  —  The sudden departure of Justice Department veteran Denise Cheung comes a day after President Donald … ",
    "url": "https://www.cnn.com/2025/02/18/politics/justice-department-dc-criminal-division"
  },
  {
    "text": "DOGE Claimed It Saved $8 Billion in One Contract.  It Was Actually $8 Million.  —  The biggest single line item on the website of Elon Musk's cost-cutting team appears to include an error.  —  The Department of Government Efficiency, the federal cost-cutting initiative championed by Elon Musk … ",
    "url": "https://www.nytimes.com/2025/02/18/upshot/doge-contracts-musk-trump.html?unlocked_article_code=1.yE4.Qyxv.7AizyFV7824L"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Reins in Independent Agencies to Restore a Government that Answers to the American People  —  RESTORING DEMOCRACY AND ACCOUNTABILITY IN GOVERNMENT: Today, President Donald J. Trump signed an Executive Order ensuring that all federal agencies are accountable … ",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/02/fact-sheet-president-donald-j-trump-reins-in-independent-agencies-to-restore-a-government-that-answers-to-the-american-people/"
  },
  {
    "text": "Trump signs order to claim power over independent agencies  —  The action is likely to face court challenges and test a once-fringe legal theory.  —  President Donald Trump on Tuesday signed a sweeping executive order bringing independent agencies under the control of the White House … ",
    "url": "https://www.politico.com/news/2025/02/18/trump-order-power-independent-agencies-00204798"
  },
  {
    "text": "Musk Ally Demands Admin Access to System That Lets Government Text the Public  —  A worker at the General Services Administration told colleagues in a Slack message Tuesday that they have resigned in protest after Elon Musk ally Thomas Shedd requested “admin/root access to all components … ",
    "url": "https://www.404media.co/musk-ally-demands-admin-access-to-system-that-lets-government-text-the-public/"
  },
  {
    "text": "U.S. weighs destroying $500 million in stockpiled covid tests  —  The government is reviewing proposals to shut down the program that ships free covid tests to American households and has been considering destroying 160 million tests.",
    "url": "https://www.washingtonpost.com/health/2025/02/18/trump-administration-covid-tests-stockpile/"
  },
  {
    "text": "Brazil Charges Bolsonaro With Attempting a Coup  —  Brazil's attorney general charged the former president Jair Bolsonaro with trying to overturn the 2022 elections.  —  Jair Bolsonaro, Brazil's former president, was charged Tuesday with overseeing a vast scheme to try to undermine … ",
    "url": "https://www.nytimes.com/2025/02/18/world/americas/brazil-charges-bolsonaro-with-attempting-a-coup.html?unlocked_article_code=1.yE4.2sw0.VYH5zB6UhP9f&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Live updates: Judge declines to block Musk and DOGE from accessing federal data or laying off workers  —  Two Democratic state attorneys general spelled out their arguments ahead of a court hearing Friday on whether a temporary ban should continue that would bar Elon Musk's Department … ",
    "url": "https://apnews.com/live/trump-presidency-updates-2-18-2025#00000195-1af6-df2b-a5b7-fbfe7f8c0000"
  },
  {
    "text": "Vance's Munich Disgrace  —  In April 1928, Joseph Goebbels, later the Third Reich's chief propagandist, wrote a newspaper essay addressing the question of why the National Socialists, despite being an “anti-parliamentarian party,” would nonetheless compete in that May's parliamentary elections.",
    "url": "https://www.nytimes.com/2025/02/18/opinion/vance-munich-germany-afd.html?unlocked_article_code=1.x04.r2RX.dLNx26_jm71e&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "F.D.A.'s Food Safety Chief Resigns Over Trump Administration Layoffs  —  The chief said the loss of critical employees overseeing the nation's food supply made his work impossible.  Robert F. Kennedy Jr., the nation's new health secretary, has pledged to gut the division.",
    "url": "https://www.nytimes.com/2025/02/18/us/politics/fda-food-safety-jim-jones-resignation.html"
  },
  {
    "text": "Judge halts firing of intel agency personnel involved with DEI  —  The order may amount to only a temporary reprieve.  —  A federal judge has temporarily blocked the CIA and the Office of Director of National Intelligence from firing 11 people whose jobs were eliminated to comply … ",
    "url": "https://www.politico.com/news/2025/02/18/judge-halts-firing-dei-personnel-00204803"
  },
  {
    "text": "‘Good luck with that.’ Trump administration terminates privacy officials at agency overseeing government hiring and firing  —  The Trump administration has quietly fired multiple members of the “privacy team” and other officials from the office that oversees the hiring of federal workers … ",
    "url": "https://www.cnn.com/2025/02/18/politics/opm-privacy-team-fired/"
  },
  {
    "text": "11-Year-Old Texas Girl Bullied Over Family's Immigration Status Takes Her Own Life  —  Students also threatened to call ICE to deport the girl's family  —  Jocelynn Rojo Carranza took her life after experiencing months of relentless bullying from her sixth grade classmates … ",
    "url": "https://www.latintimes.com/11-year-old-texas-girl-bullied-over-familys-immigration-status-takes-her-own-life-575984"
  },
  {
    "text": "'Stephen, let's calm down': Yelling Trump aide berates host as he loses cool live on CNN  —  White House aide Stephen Miller launched into a barrage of shouting aimed at CNN's Brianna Keilar Tuesday as she grilled him on cuts being made by Elon Musk's Department of Government Efficiency … ",
    "url": "https://www.rawstory.com/stephen-miller-cnn/"
  },
  {
    "text": "Moving on from 18F.  —  note: This post gets into the last few weeks of American politics.  If that's not your cup of tea, or if that's a stressful topic for you, please feel free to skip this one.  (Also, it's a bit long.  Sorry about that.)  —  Last week, I finished my tenure as a designer at 18F.",
    "url": "https://ethanmarcotte.com/wrote/leaving-18f/"
  },
  {
    "text": "Not Even DOGE Employees Know Who's Legally Running DOGE  —  Despite all appearances, the White House insists that Elon Musk is not in charge of DOGE.  US Doge Service employees can't get a straight answer about who is.  —  President Donald Trump and Elon Musk have repeatedly affirmed Musk's leadership … ",
    "url": "https://www.wired.com/story/doge-elon-musk-leadership-administrator/"
  },
  {
    "text": "Kennedy says panel will examine childhood vaccine schedule after promising not to change it  —  To earn the vote he needed to become the nation's top health official, Robert F. Kennedy Jr. made a special promise to a U.S. senator: He would not change the nation's current vaccination schedule.",
    "url": "https://apnews.com/article/childhood-vaccines-schedule-kennedy-trump-hhs-4d5e6c52c602f5edbcd837748605e9d0"
  },
  {
    "text": "Trump says AP will continue to be curtailed at White House until it changes style to Gulf of America  —  President Donald Trump said Tuesday that he will continue to restrict The Associated Press' access to his events and news conferences until the news outlet goes along with his renaming of the Gulf of Mexico in its reports.",
    "url": "https://apnews.com/article/trump-ap-white-house-press-corps-pool-91535a6384d681fee1cd7e384ea6c627"
  },
  {
    "text": "Zachary Levi Begs Elon Musk Not To Fire The ‘Good’ Federal Workers Who Voted For Trump  —  The “Shazam” star was upset that Trump supporters are getting “lost in the cracks” during DOGE's firing frenzy.  —  LOADING  —  Oh, bless his heart: Zachary Levi seems to believe that a billionaire cares … ",
    "url": "https://www.huffpost.com/entry/zachary-levi-elon-musk-trump-voters_n_67b4ba4fe4b0765f4479cbfc"
  },
  {
    "text": "Kennedy Library closes abruptly  —  “The sudden dismissal of federal employees at the JFK Library forced the museum to close today,” a statement from the foundation read.  —  The John F. Kennedy Presidential Library and Museum closed abruptly Tuesday afternoon amid a flurry of mass firings at federal agencies across the government.",
    "url": "https://www.politico.com/news/2025/02/18/kennedy-library-closed-boston-doge-00204790"
  },
  {
    "text": "State Dept. orders cancellation of news subscriptions around the world  —  Embassies and consulates were told to terminate subscriptions to the New York Times, the Associated Press and others.  —  The State Department has ordered the cancellation of all news subscriptions deemed … ",
    "url": "https://www.washingtonpost.com/style/media/2025/02/18/state-department-news-subscriptions-trump-media-crackdown/"
  },
  {
    "text": "Musk and DOGE Might Soon Have Access to the Most Lucrative Defense-Contract Database of All  —  Ex-officials warn Zeteo that the USXports database is a means for Musk to undercut competitors to SpaceX in the defense sector.  —  ∙ Paid  —  Elon Musk's so-called Department of Government Efficiency … ",
    "url": "https://zeteo.com/p/musk-and-doge-might-soon-have-access"
  },
  {
    "text": "Bannon Calls Musk a ‘Parasitic Illegal Immigrant’  —  Stephen Bannon, a top adviser during President Trump's first term and a key figure among his supporters, said Elon Musk wants to “play-act as God” as part of his push to overhaul the federal government.  —  Stephen K. Bannon … ",
    "url": "https://www.nytimes.com/2025/02/18/us/politics/steve-bannon-elon-musk-feud.html"
  },
  {
    "text": "Trump's DOJ Erases Report On Violence Against Native American Women  —  The Justice Department has removed a report from its website that lays out recommendations for tackling the crisis of missing and murdered Indigenous women.  —  The Not Invisible Act Commission's final report … ",
    "url": "https://www.huffpost.com/entry/donald-trump-white-house-live-updates_n_67aa443de4b0cced3687c9ec/liveblog_67b4f9e5e4b08e2e24824c73"
  },
  {
    "text": "“I'm Suffering:” Holiday Massacre of Federal Workforce Is a Rude Awakening for Rural Westerners  —  Park rangers, biologists, maintenance crews, wildfire prevention people—all fired arbitrarily.  —  A President's Day weekend swept by fear and grief from the sudden termination of thousands … ",
    "url": "https://www.motherjones.com/politics/2025/02/presidents-day-firings-federal-workers-interior-fish-wildlife-service-rural-national-parks/"
  },
  {
    "text": "National Science Foundation Fires 168 Workers as Federal Purge Continues  —  Firings at the NSF included permanent employees who had already completed their one-year probationary period, as well as at-will workers.  —  The National Science Foundation fired nearly 170 workers in a Zoom call … ",
    "url": "https://www.wired.com/story/national-science-foundation-february-2025-firings/"
  },
  {
    "text": "Defense Department firings expected to start soon, officials say  —  Pentagon agencies were told to submit lists of probationary employees after members of Elon Musk's DOGE arrived, people familiar with the matter said.  —  The Trump administration has directed defense agencies to turn … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/18/pentagon-layoffs-musk-doge-trump/"
  },
  {
    "text": "Tens of millions of dead people aren't getting Social Security checks, despite Trump and Musk claims  —  The Trump administration is falsely claiming that tens of millions of dead people over 100 years old are receiving Social Security payments.  Over the past few days … ",
    "url": "https://apnews.com/article/social-security-payments-deceased-false-claims-doge-ed2885f5769f368853ac3615b4852cf7"
  },
  {
    "text": "Missouri bill proposes registry for pregnant women to ‘reduce preventable abortions’  —  JEFFERSON CITY, Mo. (KTVI) — Legislation introduced in Missouri would create a list of “at risk” pregnant women in the state in order to “reduce the number of preventable abortions.”",
    "url": "https://thehill.com/homenews/state-watch/5151439-missouri-bill-registry-pregnant-women-abortion/"
  },
  {
    "text": "Inside Trump's Million-Dollar Dinners With Healthcare Executives  —  Donald Trump hosted meals with dozens of the corporate leaders during the presidential transition, in a lucrative moneymaking venture  —  First came the pharmaceutical executives.  —  Then the insurance companies and the hospital leaders.",
    "url": "https://www.wsj.com/politics/policy/trump-mar-o-lago-corporate-dinners-healthcare-executives-a8f171b0?st=LJ5vSw"
  }
]