[
  {
    "text": "Melania Trump reveals son Barron, 18, has pulled out of being a delegate nominating his father for president because he has ‘prior commitments’  — ‘He regretfully declines to participate due to prior commitments,’ the Office of Melania Trump said to DailyMail.com",
    "url": "https://www.dailymail.co.uk/news/article-13405541/melania-trump-office-son-barron-delegates-president.html"
  },
  {
    "text": "Change of plan: Barron Trump will no longer be a delegate at the Republican convention  —  WASHINGTON - Barron Trump won't be an at-large convention delegate for his father after all.  —  “While Barron is honored to have been chosen as a delegate by the Florida Republican Party … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/10/barron-trump-delegate-gop-convention/73646811007/"
  },
  {
    "text": "Trump's youngest son Barron ‘declines’ to be RNC delegate, his mother Melania says  —  Barron Trump is declining to serve as a delegate on behalf of his father at the Republican National Convention, according to his mother's office.  —  The Florida Republican Party announced on Wednesday … ",
    "url": "https://www.bbc.com/news/world-us-canada-68992293"
  },
  {
    "text": "Barron Trump will not be a Florida delegate at the GOP convention  —  A statement from former first lady Melania Trump's office said Barron “regretfully declines to participate due to prior commitments.”  —  Barron Trump will no longer serve as a delegate at the Republican National Convention in July due to “prior commitments.”",
    "url": "https://www.politico.com/news/2024/05/10/barron-trump-rnc-delegate-00157443"
  },
  {
    "text": "Giuliani Is Suspended by WABC, and His Radio Show Is Canceled  —  The radio station disciplined Rudolph W. Giuliani after he violated company policy by trying to discuss the legitimacy of the 2020 election on the air.  —  Rudolph W. Giuliani was suspended by WABC radio on Friday … ",
    "url": "https://www.nytimes.com/2024/05/10/nyregion/giuliani-radio-suspended.html"
  },
  {
    "text": "Federal Appeals Court Upholds Bannon's Contempt Conviction  —  Stephen Bannon, a longtime ally of Donald Trump, had been found guilty of defying a subpoena from the House Jan. 6 committee.  He now faces a four-month prison sentence.  —  A federal appeals court on Friday upheld … ",
    "url": "https://www.nytimes.com/2024/05/10/us/politics/stephen-bannon-contempt-upheld.html"
  },
  {
    "text": "Trump Hush-Money Payment Revealed in Bank Records  —  Evidence at the center of Trump's criminal trial was just released by the FBI in response to an ongoing FOIA lawsuit. … How I got these documents is kind of a long story.  Five years ago, I filed a FOIA lawsuit against the FBI.",
    "url": "https://www.bloomberg.com/news/newsletters/2024-05-10/trump-trial-bank-records-show-130k-hush-money-payment-to-stormy-daniels"
  },
  {
    "text": "Blinken sends Congress report on Israeli military's operations in Gaza  —  Secretary of State Antony Blinken delivered to Congress on Friday a highly anticipated report on the Israeli military's operations in Gaza, accusing its forces of potentially violating international humanitarian law … ",
    "url": "https://www.cbsnews.com/news/israeli-forces-in-gaza-u-s-assessment-says/"
  },
  {
    "text": "Schools in One Virginia County to Reinstate Confederate Names  —  The school board voted on Friday to reverse a decision made four years ago, when the killing of George Floyd prompted nationwide demands for a racial reckoning, to rename the schools.  —  After a meeting that lasted for hours … ",
    "url": "https://www.nytimes.com/2024/05/10/us/virginia-confederate-school-stonewall-jackson-shenandoah.html"
  },
  {
    "text": "Virginia budget leaders reach compromise with governor on state spending plan  —  Virginia budget negotiators and Gov. Glenn Youngkin have reached a compromise on the next two-year state spending plan that would include 3% raises for state employees and teachers while not raising taxes and risking a potential veto by Youngkin.",
    "url": "https://apnews.com/article/budget-lawmakers-glenn-youngkin-virginia-2df36aa8ac4cb0dba0a12e63a483d872"
  },
  {
    "text": "Mike Johnson Told Us What He Really Thinks About Joe Biden, Hakeem Jeffries and Donald Trump  —  Fresh off fending off a hard-right coup attempt, the House speaker opened up about his strategy in a lengthy interview.  —  Mike Johnson was impersonating Donald Trump talking about Mike Johnson.",
    "url": "https://www.politico.com/news/magazine/2024/05/10/mike-johnson-interview-strategy-00157133"
  },
  {
    "text": "Nancy Mace says staff ‘sabotaged’ her: Republican accuses ex-aides of mismanaging $1million, hacking her phone, spying on medical records and dumping office devices in water in extraordinary interview  — Mace says her new staff are still repairing the damage left behind by her ‘sabotaging’ former aides",
    "url": "https://www.dailymail.co.uk/news/article-13393357/Nancy-Mace-staffers-1-million.html"
  },
  {
    "text": "Donald Trump Is Short on Cash—and Selling Laws to Anyone Who Will Pay  —  It has never been a better time to be a corporate lobbyist.  The Republican Party, having run out of ideas, no longer even pretends to represent anything other than capital.  The party's standard-bearer, Donald Trump … ",
    "url": "https://newrepublic.com/article/181459/donald-trump-broke-2024-agenda-sale"
  },
  {
    "text": "Israeli war cabinet votes to expand Rafah operation area, amid growing U.S. concerns … - The third source said the approved expansion includes actions that could be interpreted by the U.S. as crossing Biden's red line. … - The three sources said the cabinet also instructed … ",
    "url": "https://www.axios.com/2024/05/10/israel-gaza-rafah-operation-expansion"
  },
  {
    "text": "People leaving Rafah describe yet another fearful flight from Israeli assaults.  —  U.N. General Assembly Adopts Resolution Supporting Palestinian Statehood … The U.N. General Assembly adopts a resolution in support of Palestinian statehood.  —  The United Nations General Assembly … ",
    "url": "https://www.nytimes.com/live/2024/05/10/world/israel-gaza-war-hamas-rafah"
  },
  {
    "text": "Clarence Thomas says critics are pushing ‘nastiness’ and calls Washington a ‘hideous place’  —  The Supreme Court justice said that “reckless” people in Washington, D.C., will “bomb your reputation.”  —  FAIRHOPE, Ala. — Supreme Court Justice Clarence Thomas told attendees … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/justice-clarence-thomas-calls-washington-hideous-place-rcna151782"
  },
  {
    "text": "Trump Campaign Hid Settlements With Women, New Complaint Says  —  UNDERCOVER  —  A former Trump 2016 aide claims to have “information and reason to believe” that the campaign settled with other women for discrimination or harassment. … A sex discrimination lawsuit against Donald Trump's campaign … ",
    "url": "https://www.thedailybeast.com/trump-campaign-hid-settlements-with-women-new-complaint-says"
  },
  {
    "text": "Target Limiting LGBTQ-Themed Merchandise for ‘Pride Month’ After Massive Blowback  —  Target is dialing back its LGBTQ-themed merchandise for “Pride Month” after the company took a massive hit in 2023.  —  Target said it will only offer Pride-themed items in select stores after having sold … ",
    "url": "https://www.breitbart.com/social-justice/2024/05/10/target-limiting-lgbtq-themed-merchandise-for-pride-month-after-massive-blowback/"
  },
  {
    "text": "Does Rick Scott really want to relitigate his Medicare scandal?  —  Republican Sen. Rick Scott doesn't just want to relitigate his Medicare scandal during his re-election campaign, he also has a new conspiracy theory.  —  The Senate was in session yesterday, though Sen. Rick Scott missed some of the proceedings on Capitol Hill.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/rick-scott-really-want-relitigate-medicare-scandal-rcna151636"
  },
  {
    "text": "Police disband pro-Palestinian student encampments across the US  —  Authorities moved in overnight to clear campuses from Arizona to Massachusetts of students demanding schools cut ties to Israel  —  Police moved in to disband several pro-Palestinian student encampments on US campuses … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/10/police-disband-pro-palestinian-student-encampments"
  },
  {
    "text": "Kari Lake keeps giving Republicans new reasons to worry  —  Lake keeps reversing her own positions and stirring up feuds, and some in the GOP see other states as better targets this fall.  —  National Republicans embraced Kari Lake's Arizona Senate bid, reasoning she was likely to win the primary with or without their support.",
    "url": "https://www.politico.com/news/2024/05/10/gop-kari-lake-questions-00157290"
  },
  {
    "text": "Criticizing Israel?  Nonprofit Media Could Lose Tax-Exempt Status Without Due Process  —  It doesn't take much to be accused of supporting terrorism these days.  And that doesn't just go for student activists.  In recent months, dozens of lawmakers and public officials have, without evidence … ",
    "url": "https://theintercept.com/2024/05/10/terrorism-bill-nonprofit-journalists-israel-hamas/"
  },
  {
    "text": "Ethics review finds probable cause that Rep. Troy Nehls misused campaign funds  —  WASHINGTON (AP) — The independent office that reviews allegations against House members found probable cause that Rep. Troy Nehls of Texas converted campaign funds to personal use, triggering an investigation … ",
    "url": "https://apnews.com/article/troy-nehls-texas-republican-campaign-ethics-investigation-147d702a83e3fab96a874cb757bbaa3f"
  }
]