[
  {
    "text": "Black House Democrats embrace Biden at another critical juncture  —  “You've had my back, and I'll continue to have yours,” Biden told the Congressional Black Caucus on a Monday night call, echoing the 2020 race.  —  When the naysayers doubted that Joe Biden could win the 2020 presidential primary … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/08/black-house-democrats-cbc-biden-congressional-black-caucus/"
  },
  {
    "text": "Hill Dems brace for party reckoning over Biden  —  The party's panic over the president's electability has spiraled behind the scenes — and is likely to spill more into public view in the coming days.  —  President Joe Biden's outreach efforts to congressional Democrats haven't quelled … ",
    "url": "https://www.politico.com/news/2024/07/08/hill-dems-brace-for-fight-over-bidens-future-to-get-worse-00166950"
  },
  {
    "text": "Biden Gets Unexpected Boost From ‘Squad’ Members He Once Battled  — Ocasio-Cortez, Omar stand behind president in debate aftermath  — Several other Democrats openly calling for Biden to step aside  —  Biden Tells Lawmakers to End Revolt Over Candidacy",
    "url": "https://www.bloomberg.com/news/articles/2024-07-09/biden-gets-unexpected-boost-from-squad-members-he-once-battled"
  },
  {
    "text": "Read the letter President Biden sent to House Democrats telling them to support him in the election  —  President Joe Biden wants Democrats in Congress to know he has no intention of exiting this year's election, sending them a letter on Monday on his personal letterhead.",
    "url": "https://apnews.com/article/biden-letter-democrats-4562a72aa3a891e55261617d0d494d00"
  },
  {
    "text": "Poll finds Biden damaged by debate; with Harris and Clinton best positioned to win  —  Vice President Kamala Harris is now running ahead of Trump, 42 percent to 41 percent, the survey found.  —  A top Democratic pollster has a new survey showing President Joe Biden still in contention against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/07/09/biden-clinton-harris-democrat-poll-00166937"
  },
  {
    "text": "Playbook: The Democratic split to watch  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  DEPT. OF SHIT-STIRRING — “Poll finds Biden damaged by debate; with Harris and Clinton best positioned to win,” by Christopher Cadelago: “The national poll … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/09/the-democratic-split-to-watch-00166992"
  },
  {
    "text": "Kamala Harris beats Donald Trump, new poll shows, performs better than Joe Biden  —  WASHINGTON — Vice President Kamala Harris could narrowly beat Donald Trump in November, according to a new national poll from a Democratic pollster.  —  Harris is ahead by 1 point in the poll conducted … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/09/harris-beat-trump-poll-biden/74333759007/"
  },
  {
    "text": "Whoopi Says She'd Vote for Biden Even if He ‘Pooped His Pants’  —  'I DON'T CARE'  —  “The View” host opened Monday's episode by digging her heels in on her support of the President.  —  Whoopi Goldberg was very clear about her support of President Biden's bid for a second term … ",
    "url": "https://www.thedailybeast.com/whoopi-goldberg-says-shed-vote-for-biden-even-if-he-pooped-his-pants"
  },
  {
    "text": "The media has been breathlessly attacking Biden.  What about Trump?  —  The bigger story is Donald Trump's appalling unfitness for office.  He tried to overturn a legitimate election and is a felon  —  It's possible for two conflicting ideas to be true at once.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/09/biden-media-attacks-trump-felon"
  },
  {
    "text": "The Double Standard in Trump-Biden Coverage  —  It's real, and it's not going anywhere.  —  After President Joe Biden's disastrous recent public appearances, he and his supporters are attacking media outlets for a double standard in coverage of him and his opponent.",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/07/the-double-standard-in-trump-biden-coverage/678943/"
  },
  {
    "text": "How Biden woes could affect Trump's VP pick … - The GOP sources believe Biden's woes could leave Trump feeling free to pick a conservative firebrand such as Vance over lower-key top contenders such as North Dakota Gov. Doug Burgum or Sen. Marco Rubio (R-Fla.).  —  Trump's pick remains anyone's guess, and he's not saying — yet.",
    "url": "https://www.axios.com/2024/07/09/biden-trump-vp-decision"
  },
  {
    "text": "White House doctor offers explanation for Parkinson's expert's visits  —  The doctor held regular Neurology clinics at the White House, she said  —  In a letter released late Monday night by the president's physician, Dr. Kevin O'Connor, he confirmed that Dr. Kevin Cannard … ",
    "url": "https://abcnews.go.com/Politics/white-house-doctor-offers-explanation-parkinsons-experts-visits/story?id=111764565"
  },
  {
    "text": "The alarming new power Trump will claim in a second term  —  Donald Trump says that if he returns to the White House in 2025, he will have the power to effectively cancel any federal program — or even an entire agency — by refusing to spend money appropriated by Congress.",
    "url": "https://popular.info/p/the-alarming-new-power-trump-will"
  },
  {
    "text": "U.S. Officials Say Russia Is Unlikely to Take Much More Ukrainian Territory  —  Russian forces continue to inflict pain, but NATO leaders gathering in Washington can say that their efforts to strengthen Ukraine are working.  —  Russia is unlikely to make significant territorial gains … ",
    "url": "https://www.nytimes.com/2024/07/09/us/politics/russia-ukraine-nato.html"
  },
  {
    "text": "A Dangerous Double Standard  —  All our energies must go to defeating Trump  —  What a weekend.  You know I have seen some things in my seven decades covering American politics.  I have never seen anything quite like the wrangling, hand-wringing, and behind-the-scenes gamesmanship currently swirling around President Biden.",
    "url": "https://steady.substack.com/p/a-dangerous-double-standard"
  },
  {
    "text": "‘No one is picking up the phone’: Joe Biden's fundraising confronts new hurdles after debate … President Joe Biden's fundraising operation started showing cracks in its once formidable armor, almost 10 days after his disastrous presidential debate performance.",
    "url": "https://www.cnbc.com/2024/07/08/joe-biden-fundraising-debate.html"
  },
  {
    "text": "The Enormous Risks a Second Trump Term Poses to Our Economy  —  Not long ago, one of us was having lunch with someone who manages a multibillion-dollar fund when the subject turned to the prospect of a second Trump term.  —  This person was disturbed by many of Donald Trump's actions … ",
    "url": "https://www.nytimes.com/2024/07/08/opinion/economic-risks-second-trump-term.html"
  },
  {
    "text": "Holding China Accountable for Its Role in the Most Catastrophic Pandemic of Our Time: COVID-19  —  The Heritage Foundation's Nonpartisan Commission on China and COVID-19 was formed and founded with a unity of purpose: to review the facts and circumstances related to one of the most devastating pandemics … ",
    "url": "https://www.heritage.org/china/report/holding-china-accountable-its-role-the-most-catastrophic-pandemic-our-time-covid-19"
  },
  {
    "text": "A Republican Platform That Could Read Like a Trump Rally  —  The former president's campaign team has packed the 2024 platform committee, which meets in Milwaukee this week, with the MAGA faithful.  —  Steve Nagel, a chiropractor and talk radio host based in North Dakota … ",
    "url": "https://www.nytimes.com/2024/07/08/us/politics/trump-republican-platform.html"
  }
]