[
  {
    "text": "Hegseth orders makeup studio installed at Pentagon  —  Defense Secretary Pete Hegseth recently ordered modifications to a room next to the Pentagon press briefing room to retrofit it with a makeup studio that can be used to prepare for television appearances, multiple sources told CBS News.",
    "url": "https://www.cbsnews.com/news/hegseth-orders-makeup-studio-installed-pentagon/"
  },
  {
    "text": "3 ways Trump's immigration crackdown could hit U.S. citizens  —  Trump administration officials are suggesting their immigration crackdown could expand to include deporting convicted U.S. citizens and charging anyone — not just immigrants — who criticizes Trump's policies.",
    "url": "https://www.axios.com/2025/04/23/trump-immigration-crackdown-us-citizens"
  },
  {
    "text": "Laura Ingraham's Angry Rants at Dem on Fox Reveal MAGA's Dark Endgame  —  Democrats have long intensely debated whether to appear on Fox News.  Going on Fox risks providing a sheen of legitimacy to a propaganda outlet.  But not going on risks leaving Republican news consumers … ",
    "url": "https://newrepublic.com/article/194298/laura-ingraham-yassamin-ansari-deportation"
  },
  {
    "text": "Trump's Job Rating Drops, Key Policies Draw Majority Disapproval as He Nears 100 Days  —  Majorities in both parties say Trump administration must stop an action if a federal court rules it is illegal  —  Table of Contents Table of Contents  —  Majorities in both parties … ",
    "url": "https://www.pewresearch.org/politics/2025/04/23/trumps-job-rating-drops-key-policies-draw-majority-disapproval-as-he-nears-100-days/"
  },
  {
    "text": "White House Considers Slashing China Tariffs to De-Escalate Trade War  —  Levies could be cut by more than half in some cases although Trump hasn't yet made a final decision  —  The Trump administration is considering slashing its steep tariffs on Chinese imports—in some cases by more than half … ",
    "url": "https://www.wsj.com/politics/policy/white-house-considers-slashing-china-tariffs-to-de-escalate-trade-war-6f875d69?st=G8BM9H&reflink=article_imessage_share"
  },
  {
    "text": "Jan Schakowsky planning May 5 retirement announcement  —  The veteran House Democrat is facing a longshot primary challenge.  —  Rep. Jan Schakowsky is planning to announce next month she won't seek reelection after 14 terms in the House and has started informing allies of her retirement decision … ",
    "url": "https://www.politico.com/news/2025/04/23/jan-schakowsky-retirement-announcement-00306181"
  },
  {
    "text": "U.S. citizen wrongly detained by Border Patrol says government account is false  —  On April 8, Jose Hermosillo, a 19-year-old U.S. citizen, was wrongfully incarcerated by immigration authorities in Arizona, who claimed he was an undocumented immigrant.  He was held for 10 days … ",
    "url": "https://popular.info/p/us-citizen-wrongly-detained-by-border"
  },
  {
    "text": "Abrego Garcia's Wife Forced to Go Into Hiding Thanks to DHS Slip-Up  —  The wife of Kilmar Abrego Garcia, who was mistakenly deported to El Salvador by the Trump administration, was forced to move to a safe house with her children, after the government posted their home address to social media.",
    "url": "https://newrepublic.com/post/194289/abrego-garcia-wife-hiding-dhs-address"
  },
  {
    "text": "Ukraine's Zelensky Pushes Back on U.S. Peace Plan  —  The Ukrainian president said his country would never recognize Russian control of Crimea, a key Russian demand  —  KYIV, Ukraine—Ukrainian President Volodymyr Zelensky pushed back on a U.S. proposal to recognize Russia's control of Crimea … ",
    "url": "https://www.wsj.com/world/europe/ukraines-zelensky-pushes-back-on-u-s-peace-plan-359d74b1?st=DiXLG6&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Majorities disapprove of some key Trump administration actions  —  Post Infographics  — More disapprove than approve of the administration's government cuts, but views largely split along partisan lines  — Among Republicans, support for ending DEI policies in federal government varies across demographic groups",
    "url": "https://www.pewresearch.org/politics/2025/04/23/tariffs-dei-and-cuts-to-government-views-of-trumps-key-actions/pp_2025-4-23_trump-100-days_03-01/"
  },
  {
    "text": "Scoop: Musk vs. Bessent dispute erupted into West Wing shouting match  —  Elon Musk and Treasury Secretary Scott Bessent got into a heated shouting match in earshot of President Trump and other officials in the White House last week during a dispute about the IRS, two witnesses and three sources briefed on the matter tell Axios.",
    "url": "https://www.axios.com/2025/04/23/musk-bessent-trump-white-house-irs"
  },
  {
    "text": "Trump to Sign Executive Order Targeting University Accreditors  —  Move is latest in effort to remake higher education after the president and other Republicans have long criticized the accreditation process  —  President Trump is expected to sign an executive order Wednesday to shake … ",
    "url": "https://www.wsj.com/us-news/education/trump-accreditors-executive-order-universities-4e4366cc?st=jR6Cq3&reflink=article_copyURL_share"
  },
  {
    "text": "President Trump to Host Dinner With Holders of His Memecoin  —  President Donald Trump will have dinner with the top 220 holders of the Trump memecoin, the issuers of the cryptocurrency announced on Wednesday.  —  At the “intimate private dinner” on May 22 at Trump National Golf Club near Washington … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-23/president-trump-to-host-dinner-with-top-holders-of-his-memecoin"
  },
  {
    "text": "Trump Administration Texted College Professors' Personal Phones to Ask If They're Jewish  —  Most professors at Barnard College received text messages on Monday notifying them that a federal agency was reviewing the college's employment practices, according to copies of the messages reviewed by The Intercept.",
    "url": "https://theintercept.com/2025/04/23/trump-eeoc-barnard-columbia-texts-jewish/"
  },
  {
    "text": "Restoring Equality of Opportunity and Meritocracy  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  A bedrock principle of the United States is that all citizens are treated equally under the law.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/restoring-equality-of-opportunity-and-meritocracy/"
  },
  {
    "text": "Trump Finds Another Country to Accept His Mass Deportations  —  The U.S. government is reportedly preparing to deport immigrants to Rwanda who can't be sent back to their country of origin due to fears of prosecution.  —  The Handbasket newsletter reported Tuesday that a State Department cable sent … ",
    "url": "https://newrepublic.com/post/194312/trump-deportation-rwanda"
  },
  {
    "text": "Hegseth had Signal messaging app installed on an office computer  —  The move was intended to circumvent a lack of cellphone service in much of the Pentagon and enable easier communication between Hegseth and other Trump officials, said people familiar with the matter.",
    "url": "https://www.washingtonpost.com/national-security/2025/04/23/hegseth-signal-pentagon-computer/"
  },
  {
    "text": "The courage to be decent  —  One of the more pernicious effects of authoritarianism is to make the everyday participation in civic life we take for granted feel subversive.  The goal isn't to police all behavior at all times.  It's to make us fearful to the point that we police our own behavior.",
    "url": "https://radleybalko.substack.com/p/the-courage-to-be-decent"
  },
  {
    "text": "Let's talk about a civic uprising  —  Mainstream media coverage of the widespread anti-Trump protests on April 19 was much more extensive than it was after the April 5 protests — despite smaller crowds.  —  Watch MSBNC's Rachel Maddow wrap up the coverage and the protests on her show Monday night - it's must-see TV.",
    "url": "https://www.headsupnews.org/p/lets-talk-about-a-civic-uprising"
  },
  {
    "text": "They Criticized Musk on X. Then Their Reach Collapsed.  —  Note: Five-day moving average.  Views are only shown up to 400,000.  Source: X  —  When Mr. Musk purchased X in 2022, he promised to create a free speech haven and named himself a “free speech absolutist.”",
    "url": "https://www.nytimes.com/interactive/2025/04/23/business/elon-musk-x-suppression-laura-loomer.html?unlocked_article_code=1.B08.-KRh.oD5OYidUGf7G&smid=url-share"
  },
  {
    "text": "Tom Homan vows action as California set to release illegal immigrant who killed two teens  —  Outrage is growing after the California Department of Corrections and Rehabilitation announced it will release an undocumented immigrant convicted of killing two American teenagers … ",
    "url": "https://www.foxnews.com/media/tom-homan-vows-action-california-set-release-illegal-immigrant-who-killed-two-teens"
  },
  {
    "text": "STAT+: New England Journal of Medicine gets swept up in U.S. attorney inquiry into alleged bias  —  Last week, at least one scientific journal received a letter from a top U.S. attorney asking it to respond to alleged bias.  Now, one of the world's leading medical journals, has received a similar inquiry as well.",
    "url": "https://www.statnews.com/2025/04/23/new-england-journal-of-medicine-us-attorney-letter-scientific-journals/"
  },
  {
    "text": "Democratic Governor Moves To Boycott El Salvador For Aiding Trump  —  Illinois Gov. J.B. Prtizker is ordering the state's pension funds and procurement agencies to review any investments in the Latin American country.  —  Illinois Gov. J.B. Pritzker (D) is asking his state's pension funds … ",
    "url": "https://www.huffpost.com/entry/democratic-governor-moves-to-boycott-el-salvador-for-aiding-trump_n_68090080e4b096ecd6e83472"
  },
  {
    "text": "Harvard Youth Poll  —  Introduction  —  A new national poll from the Institute of Politics at Harvard Kennedy School reveals a generation navigating financial hardship, frayed social bonds, and declining trust in institutions.  As the nation confronts generational turnover and a volatile political climate … ",
    "url": "https://iop.harvard.edu/youth-poll/50th-edition-spring-2025"
  }
]