[
  {
    "text": "Biden responds angrily to special counsel report questioning his memory  —  President Biden on Thursday night gave an emotional and at times angry response to a special counsel's report questioning his memory, addressing the nation hours after a special counsel report painted a devastating picture … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/08/biden-hur-response/"
  },
  {
    "text": "Thoughts On the Hur Report  —  Let me share a few thoughts on the Biden special counsel report.  —  First off, this is another example of the universal rule: Republican special counsels are chosen to investigate Democrats.  And Republican special counsels are chosen to investigate Republicans.",
    "url": "https://talkingpointsmemo.com/edblog/thoughts-on-the-hur-report"
  },
  {
    "text": "Biden Cleared in Documents Case; Report Raises Concerns About His Memory  —  The inquiry found that the president had willfully retained material after finishing his term as vice president and had shared sensitive information with a ghostwriter.  —  The special counsel investigating President Biden … ",
    "url": "https://www.nytimes.com/2024/02/08/us/biden-documents-special-counsel.html"
  },
  {
    "text": "Biden investigation reveals event that nearly pushed Joe to resign as Obama's vice president  —  Then-Vice President Joe Biden considered resigning from his post under former President Barack Obama over disagreements with the administration's policies during the Afghanistan War … ",
    "url": "https://www.washingtonexaminer.com/news/white-house/2846948/biden-investigation-reveals-event-nearly-pushed-joe-resign-obamas-vice-president/"
  },
  {
    "text": "Playbook: A day Biden world wishes it could forget  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TALK OF THIS TOWN — Michael Schaffer's latest column: “To See the Toxic Effect of Crime on Politics, Look at Local DC”",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/09/a-day-biden-world-wishes-it-could-forget-00140647"
  },
  {
    "text": "How Trump turned the GOP into the party of lawless disorder  —  Can Republicans win by promoting contempt for the rule of law?  We're about to find out. … As the GOP prepares for the third general election with Donald Trump at the head of its ticket, it is becoming clear that the 2024 race … ",
    "url": "https://www.publicnotice.co/p/trump-gop-lawless-disorder"
  },
  {
    "text": "'It's devastating': Trump seizes unmatched control over GOP  —  Trump's influence was felt across the country, from Nevada to Congress to the Republican National Committee.  —  RENO, Nevada — Donald Trump long ago bent the Republican Party to his will.  But seldom has the sheer sweep … ",
    "url": "https://www.politico.com/news/2024/02/09/trump-gop-dominance-00140592"
  },
  {
    "text": "Nikki Haley Doesn't Care if Extended GOP Race Damages Trump  —  Former South Carolina governor is adamant Republicans would regret setting up a 2020 rematch  —  AIKEN, S.C.—Nikki Haley makes no apologies for hurting Donald Trump.  —  “I'm weakening Trump because of who Trump is,” she said in an interview here earlier this week.",
    "url": "https://www.wsj.com/politics/elections/nikki-haley-doesnt-care-if-extended-gop-race-damages-trump-060c0a01?mod=followamazon"
  },
  {
    "text": "Jury awards climate scientist Michael Mann $1 million in defamation lawsuit  —  A jury on Thursday awarded $1 million to climate scientist Michael Mann who sued a pair of conservative writers 12 years ago after they compared his depictions of global warming to a convicted child molester.",
    "url": "https://apnews.com/article/climate-change-defamation-michael-mann-penn-state-61289ee2d8d2143768d28995c83899ef"
  },
  {
    "text": "Famed climate scientist wins million-dollar verdict against right-wing bloggers  —  The verdict comes amid heightened attacks on scientists working on climate change, vaccines and other issues  —  Michael Mann, a prominent climate scientist, won his long-standing legal battle … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/02/08/michael-mann-bloggers-defamation-trial/"
  },
  {
    "text": "Oral surgery at today's Supreme Court  —  The Supreme Court hears oral arguments today on whether Section 3 of the 14th Amendment of the Constitution bars Trump from appearing on the ballot in Colorado and other states because of his role in the January 6 Capitol riot.",
    "url": "https://robertreich.substack.com/p/oral-surgery-at-todays-supreme-court"
  },
  {
    "text": "Revealed: rightwinger Leonard Leo linked to efforts to keep Trump on ballot  —  Federalist Society co-chair has ties to the groups arguing in the US supreme court case that Trump should stay on the Colorado ballot  —  The man behind the conservative effort to move the judiciary to the right … ",
    "url": "https://www.theguardian.com/law/2024/feb/09/leonard-leo-federalist-society-trump-ballot-supreme-court"
  },
  {
    "text": "Putin walks away with propaganda victory after Tucker Carlson's softball interview  —  Editor's Note: A version of this article first appeared in the “Reliable Sources” newsletter.  Sign up for the daily digest chronicling the evolving media landscape here.  —  CNN  —",
    "url": "https://www.cnn.com/2024/02/08/media/vladimir-putin-tucker-carlson-interview-reliable-sources/"
  },
  {
    "text": "Arizona prevents election recount nightmare scenario with a bipartisan fix  —  Lawmakers approved a change to the battleground state's election policies to ensure Arizona delivers its presidential electors to Washington on time in the event of a close race.  —  Arizona lawmakers dodged … ",
    "url": "https://www.nbcnews.com/politics/2024-election/arizona-prevents-election-recount-nightmare-scenario-rcna138028"
  },
  {
    "text": "Election officials go on offense to prevent disruptions of 2024 vote  —  The efforts reflect the challenges facing American elections as Trump and his supporters continue to falsely dispute the results from 2020  —  PHOENIX — In training poll workers for this year's presidential election … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/09/election-worker-voting-preparation/"
  },
  {
    "text": "Scoop — Forthcoming book on Jill Biden in 2022: “Why didn't anyone stop that? … President Biden and top aides were gathered in the Treaty Room, the president's study in the executive residence, after a press conference that ran nearly two hours. … - Suddenly, the group saw First Lady Jill Biden … ",
    "url": "https://www.axios.com/2024/02/09/forthcoming-book-jill-biden-why-didnt-anyone-stop-that"
  }
]