[
  {
    "text": "Mike Waltz out as national security adviser, but Trump says he'll be ambassador to U.N.  —  National security adviser Mike Waltz and his deputy, Alex Wong, will be leaving their posts in the Trump White House, according to multiple sources familiar with their departure.",
    "url": "https://www.cbsnews.com/news/trump-mike-waltz-alex-wong/"
  },
  {
    "text": "Why Trump's White House turned on Mike Waltz  —  Mike Waltz has been a dead man walking for the past month, and the outgoing national security adviser started to act like it, Trump administration sources tell Axios.  —  Why it matters: “Signalgate” badly damaged Waltz, but it wasn't his only problem.",
    "url": "https://www.axios.com/2025/05/01/mike-waltz-firing-trump-white-house"
  },
  {
    "text": "Trump gives commencement address at University of Alabama  —  President Donald Trump announced Thursday that he plans to nominate Michael Waltz as ambassador to the United Nations, hours after reports emerged that he would be replacing Waltz in his current position as national security adviser.",
    "url": "https://www.washingtonpost.com/politics/2025/05/01/trump-presidency-news-100-days/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MDcyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NDU0Mzk5LCJpYXQiOjE3NDYwNzIwMDAsImp0aSI6ImViZjhhMDZiLTRlYmQtNDY3OC1iZWYzLTVhOWU0YTkzYjFmZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzAxL3RydW1wLXByZXNpZGVuY3ktbmV3cy0xMDAtZGF5cy8ifQ.QnThY0o0ScVflPY7Ea67Er6x5s8wFBAXVeqMMYCROUs&itid=gfta"
  },
  {
    "text": "Marco Rubio Adds a New Title Under Trump: Interim National Security Adviser  —  The former senator from Florida is now the head of four government bodies.  He has outdone Henry Kissinger and even Xi Jinping, China's leader, who has only three main titles.  —  Secretary of state.",
    "url": "https://www.nytimes.com/2025/05/01/us/politics/marco-rubio-national-security-secretary-state.html"
  },
  {
    "text": "Trump ousts Mike Waltz as national security adviser  —  Names for a replacement have been discussed around the West Wing for weeks.  —  President Donald Trump ousted Mike Waltz, who has lost the confidence of other administration officials, from his national security adviser position on Thursday.",
    "url": "https://www.politico.com/news/2025/05/01/trump-plans-to-oust-national-security-adviser-mike-waltz-00321200"
  },
  {
    "text": "Army plans for a potential parade on Trump's birthday call for 6,600 soldiers, AP learns  —  Detailed Army plans for a potential military parade on President Donald Trump's birthday in June call for more than 6,600 soldiers, at least 150 vehicles, 50 helicopters, seven bands and possibly … ",
    "url": "https://apnews.com/article/army-parade-trump-birthday-96bb9c8e9af1ef285c56fdc3d1ba4b35"
  },
  {
    "text": "House Republicans look to sunset clean energy credits, hike endowment tax  —  Republicans on the House Ways and Means committee are starting to nail down the contours of their tax package, which could include sunsetting most or all of the clean energy tax credits from the Democrats' 2022 climate law … ",
    "url": "https://www.politico.com/live-updates/2025/05/01/congress/ways-and-means-whittles-down-outstanding-issues-00322028"
  },
  {
    "text": "Judge bars deportations of Venezuelans from South Texas under the Alien Enemies Act  —  A federal judge on Thursday barred the Trump administration from deporting any Venezuelans from South Texas under an 18th-century wartime law and said President Donald Trump's invocation of it was “unlawful.”",
    "url": "https://apnews.com/article/trump-deportations-alien-enemies-act-venezuelans-texas-e0dda59f64b1f5752fb92a91ff7878f8"
  },
  {
    "text": "Exclusive: NSF stops awarding new grants and funding existing ones … - Dan Garisto  —  You can also search for this author in  —  PubMed Google Scholar  —  Staff members at the US National Science Foundation (NSF) were told on 30 April to “stop awarding all funding actions until further notice … ",
    "url": "https://www.nature.com/articles/d41586-025-01396-2"
  },
  {
    "text": "Microsoft Drops Law Firm That Made a Deal With Trump From a Case  —  The tech giant instead engaged a firm that is fighting the president's executive orders, Jenner & Block, in a sign that those firms can still attract clients.  —  When big law firms attacked by President Trump decided … ",
    "url": "https://www.nytimes.com/2025/05/01/business/microsoft-drops-trump-compliant-law-firm.html"
  },
  {
    "text": "Orders to Investigate Columbia Protesters Raised Alarms in Justice Dept.  —  Behind the scenes, a top department official pressed employees to gather a list of activists and investigate them, people familiar with the matter said.  —  A top Trump appointee in the Justice Department ordered … ",
    "url": "https://www.nytimes.com/2025/05/01/us/politics/columbia-protests-justice-department.html?unlocked_article_code=1.D08.fy7e.P0sXbqrbXdLl&smid=url-share"
  },
  {
    "text": "Senior State Department official sought internal communications with journalists, European officials, and Trump critics … A previously unreported document distributed by senior US State Department official Darren Beattie reveals a sweeping effort to uncover all communications between the staff … ",
    "url": "https://www.technologyreview.com/2025/05/01/1115988/senior-state-department-official-sought-internal-communications-with-journalists-european-officials-and-trump-critics/"
  },
  {
    "text": "Tulsi Gabbard is out to prove Covid came from a lab  —  The director of national intelligence told podcast host Megyn Kelly she's working with top HHS officials to investigate Covid-19's origins.  —  National Intelligence Director Tulsi Gabbard's office is working with NIH Director Jay Bhattacharya … ",
    "url": "https://www.politico.com/news/2025/05/01/gabbard-00322598"
  },
  {
    "text": "Fired DOJ attorney says on TikTok that Trump pardons cost $1 billion  —  Liz Oyer says Americans lost out on restitution because President Donald Trump sidestepped the usual clemency process to pardon allies.  —  Liz Oyer, the Justice Department's recently fired pardon attorney … ",
    "url": "https://www.washingtonpost.com/national-security/2025/05/01/liz-oyer-trump-pardons-restitution-1-billion/"
  },
  {
    "text": "RFK Jr. changing new vaccine testing to include placebo  —  Health and Human Services Secretary Robert F. Kennedy Jr. is changing the way vaccines are tested.  —  The department will now require all new vaccines to undergo safety testing in placebo-controlled trials, meaning some people … ",
    "url": "https://thehill.com/policy/healthcare/5277641-hhs-vaccine-testing-placebos/"
  },
  {
    "text": "The Justice Department ended a decades-old school desegregation order.  Others are expected to fall  —  When the Justice Department lifted a school desegregation order in Louisiana this week, officials called its continued existence a “historical wrong” and suggested that others dating … ",
    "url": "https://apnews.com/article/school-segregation-order-civil-rights-justice-department-7fc5e2e4ef8e9ad4a283f563c042ae7c"
  },
  {
    "text": "Trump to Propose Slashing $163 Billion in Government Programs in Budget Blueprint  —  The president's budget wish list would cut health research, climate and education programs  —  WASHINGTON—President Trump is expected to propose far-reaching cuts to federal environmental, renewable energy … ",
    "url": "https://www.wsj.com/politics/policy/trump-to-propose-slashing-163-billion-in-government-programs-in-budget-blueprint-86309f80"
  },
  {
    "text": "Ilhan Omar Cusses Out Right-Wing Reporter Over Question on Wrongfully Deported Man  —  NO REGRETS  —  A reporter from The Daily Caller asked whether the Democratic lawmaker would encourage more of her colleagues to fly to El Salvador.  —  Rep. Ilhan Omar had no patience for a right-wing journalist … ",
    "url": "https://www.thedailybeast.com/ilhan-omar-cusses-out-right-wing-reporter-over-question-on-wrongfully-deported-man/"
  },
  {
    "text": "Ed Martin, Trump's controversial U.S. attorney pick, on thin ice in the Senate  —  President Trump's pick to be Washington's top prosecutor appears to be in trouble with Senate Republicans.  No GOP senator has said they will oppose Ed Martin to be U.S. attorney for the District of Columbia … ",
    "url": "https://www.politico.com/live-updates/2025/05/01/congress/ed-martin-senate-confirmation-woes-00322346"
  },
  {
    "text": "Pentagon Inspector General Expands Investigation Into Hegseth's Use of Signal  —  Probe seeks to determine who put sensitive military information in unclassified chat group that included Hegseth's family  —  The Pentagon inspector general has expanded an investigation into Defense Secretary … ",
    "url": "https://www.wsj.com/politics/national-security/pete-hegseth-signal-chat-wife-pentagon-investigation-b60457db"
  },
  {
    "text": "HHS redirects $500 million to Trump appointee's vaccine project, bypassing reviews  —  The Department of Health and Human Services has transferred $500 million from research into next-generation COVID-19 vaccines, redirecting the money to a single vaccine project linked to the Trump … ",
    "url": "https://www.cbsnews.com/news/covid-flu-vaccine-funding-trump-administration/"
  },
  {
    "text": "Mike Waltz Accidentally Reveals Obscure App the Government Is Using to Archive Signal Messages  —  Mike Waltz, who was until Thursday U.S. National Security Advisor, has inadvertently revealed he is using an obscure and unofficial version of Signal that is designed to archive messages … ",
    "url": "https://www.404media.co/mike-waltz-accidentally-reveals-obscure-app-the-government-is-using-to-archive-signal-messages/"
  },
  {
    "text": "Trump Administration Cancels $1 Billion in Grants for Student Mental Health  —  Congress authorized the money in a bipartisan breakthrough around addressing gun violence after a shooting at an elementary school in Uvalde, Texas, killed 19 children and two teachers.",
    "url": "https://nytimes.com/2025/05/01/us/politics/trump-mental-health-grants.html?unlocked_article_code=1.D08.-FT6.gyMf3mNjKNKw&smid=tw-share"
  },
  {
    "text": "Spooked By Trade Wars, Trump Officials Hoard Supplies: ‘It Would Be Stupid Not To!’  —  Some Trump administration officials are stockpiling toilet paper and food before Trump's tariffs cause prices to skyrocket … Well, many Americans aren't listening to that advice, according to survey data this year … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-officials-hoarding-supplies-trade-war-tariffs-1235329235/"
  },
  {
    "text": "Senate overturns EPA rule on seven highly toxic air pollutants  —  If also passed by the House as expected, the action will be the first time Congress has weakened protections under the Clean Air Act.  —  The Senate voted Thursday to overturn an Environmental Protection Agency rule limiting … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/05/01/senate-vote-epa-air-pollution/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MDcyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NDU0Mzk5LCJpYXQiOjE3NDYwNzIwMDAsImp0aSI6ImUyOGEyZTNiLTFhNzgtNDgzNC1iY2Y4LTMyMTEwMmEwZjhkOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jbGltYXRlLWVudmlyb25tZW50LzIwMjUvMDUvMDEvc2VuYXRlLXZvdGUtZXBhLWFpci1wb2xsdXRpb24vIn0.583sITOwSobzxzHGIXvN5QWZKnV3s1Njq68wt6fxpnw&itid=gfta"
  },
  {
    "text": "DHS Reveals Second Domestic Abuse Filing Filed by Kilmar Abrego Garcia's Wife  —  So-called “Maryland Dad's” Track Record of Violence  —  WASHINGTON - On Wednesday April 30, the Department of Homeland Security (DHS) revealed that the wife of Kilmar Abrego Garcia — the so-called “Maryland Dad” … ",
    "url": "https://www.dhs.gov/news/2025/04/30/dhs-reveals-second-domestic-abuse-filing-filed-kilmar-abrego-garcias-wife"
  },
  {
    "text": "Ketanji Brown Jackson sharply condemns Trump's attacks on judges  —  The Supreme Court justice warned Thursday that increasingly hostile rhetoric poses a dire threat to the country's political fabric.  —  RIO GRANDE, PUERTO RICO — Justice Ketanji Brown Jackson forcefully condemned attacks … ",
    "url": "https://www.politico.com/news/2025/05/01/ketanji-brown-jackson-sharply-condemns-trumps-attacks-on-judges-00323010"
  },
  {
    "text": "Yadira Caraveo's former aides say they were mistreated, traumatized by Colorado congresswoman  —  Warning: This story contains details about apparent suicide attempts.  Here's how to get involved with suicide prevention, or find help.  —  U.S. Rep. Yadira Caraveo's behavior last year … ",
    "url": "https://coloradosun.com/2025/05/01/yadira-caraveo-staff-mistreatment-allegations-colorado/"
  },
  {
    "text": "At a Dubai Conference, Trump's Conflicts Take Center Stage  —  A deal for a state-backed Emirati firm to use a Trump-affiliated digital coin was announced in a panel that included the president's son and his business partner, who promised, “This is only the beginning.”",
    "url": "https://www.nytimes.com/2025/05/01/us/politics/trump-cryptocurrency-usd1-dubai-conference-announcement.html?unlocked_article_code=1.D08.ONb_._5tK-MNW9xSf&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "There Is a Way Forward: How to Defeat Trump's Power Grab  —  The first 100 days of President Trump's second term have done more damage to American democracy than anything else since the demise of Reconstruction.  Mr. Trump is attempting to create a presidency unconstrained by Congress or the courts … ",
    "url": "https://www.nytimes.com/2025/05/01/opinion/trump-100-days-opposition.html?unlocked_article_code=1.D08.Wnt3.Ah8QmwuoCnE2"
  },
  {
    "text": "U.S. Prosecutors Accuse Large Insurers of Paying Kickbacks for Private Medicare Plans  —  The Justice Department accused large insurers of colluding with national brokers to steer older people and those with disabilities toward coverage that might not offer the best medical care.",
    "url": "https://www.nytimes.com/2025/05/01/health/medicare-kickbacks-private-plans-trump.html"
  },
  {
    "text": "STAT+: Autism evaluations are being canceled over fears about a national registry  —  SEATTLE — Michael VanPelt spent several weeks recently glued to his telephone, dialing doctors who might be able to get his 3-year-old son in for an autism evaluation.  The music teacher ran out of providers … ",
    "url": "https://www.statnews.com/2025/05/01/autism-registry-fears-hurt-diagnosis-screening-parents-cancel-autism-evaluations/"
  }
]