[
  {
    "text": "House GOP fumes at changes to Trump bill: “Insulting and disgusting” … - For lawmakers from high-tax states, that's the watering down of a hard-fought increase to the State and Local Tax (SALT) deduction cap.  — For fiscal hawks, it's rulings made by the Senate parliamentarian … ",
    "url": "https://www.axios.com/2025/06/26/trump-big-beautiful-bill-house-republicans-senate"
  },
  {
    "text": "5 House Republicans declare red line on megabill land sales  —  Five House Republicans on Thursday threatened to vote down the GOP megabill if the Senate includes a provision to sell public lands for development.  The move comes after Sen. Mike Lee (R-Utah) sought to include those sales in the bill … ",
    "url": "https://www.politico.com/live-updates/2025/06/26/congress/five-house-republicans-declare-red-line-on-land-sales-in-megabill-00428521"
  },
  {
    "text": "Cuomo will stay on NYC mayor's ballot after conceding Democratic primary to Mamdani, sources tell CNN  —  Andrew Cuomo will not drop out of the New York City mayoral race by the Friday deadline to remove himself from the general election ballot, sources tell CNN.",
    "url": "https://cnn.com/2025/06/26/politics/cuomo-mamdani-mayor-november-ballot"
  },
  {
    "text": "Inside Andrew Cuomo's flat, flailing comeback bid  —  The former governor was on track to win the New York City mayoralty but focused on the past and struggled against Mamdani's digital skills.  —  NEW YORK — Andrew Cuomo was a cable TV candidate in a TikTok world.",
    "url": "https://www.politico.com/news/2025/06/27/inside-andrew-cuomos-flat-flailing-comeback-bid-00428791"
  },
  {
    "text": "Trump Justice Dept. Pressuring University of Virginia President to Resign  —  The Justice Department has demanded that James E. Ryan step down to help resolve a civil rights investigation into the school, three people familiar with the matter said.  —  The Trump administration has privately demanded … ",
    "url": "https://www.nytimes.com/2025/06/26/us/politics/university-of-virginia-president-trump.html?unlocked_article_code=1.SE8.H015.ebP-n2IzBxuT&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Bill Moyers, the former White House press secretary turned acclaimed TV journalist, dead at 91  —  Bill Moyers, the former White House press secretary who became one of television's most honored journalists, masterfully using a visual medium to illuminate a world of ideas, died Thursday at age 91.",
    "url": "https://apnews.com/article/bill-moyers-dead-eed7ecae0e20c2db4b82500996916dfe"
  },
  {
    "text": "Trump Threatens to Sue The Times and CNN Over Iran Reporting  —  The president has criticized media coverage of a preliminary classified report that ran counter to his assertion that U.S. strikes had “obliterated” Iran's nuclear program.  —  President Trump on Wednesday threatened to sue … ",
    "url": "https://www.nytimes.com/2025/06/26/business/media/trump-iran-new-york-times-cnn.html?unlocked_article_code=1.R08.zz4o.GhMIicEh533s&smid=url-share"
  },
  {
    "text": "Kennedy's New Advisers Rescind Recommendations for Some Flu Vaccines  —  Critics saw in the move the beginnings of a more restrictive approach to providing vaccines to Americans.  —  An advisory panel recently appointed by Health Secretary Robert F. Kennedy Jr. voted on Thursday to walk … ",
    "url": "https://www.nytimes.com/2025/06/26/health/rfk-jr-vaccines-acip-cdc.html?unlocked_article_code=1.R08.J5ol.F_ZAuAgH1pJr&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "CDC vaccine advisory committee recommends against flu vaccines containing thimerosal  —  Opponents worry the decision will reduce access and fuel skepticism.  —  A sign marks the entrance to the federal Centers for Disease Control and Prevention (CDC) in Atlanta, on Oct. 8, 2013.",
    "url": "https://abcnews.go.com/Health/cdc-vaccine-advisory-committee-recommends-flu-vaccines-thimerosal/story?id=123224218"
  },
  {
    "text": "‘Big Balls’ Is Now at the Social Security Administration  —  Edward “Big Balls” Coristine's placement at the SSA comes after a White House official told WIRED on Tuesday that the 19-year-old had resigned from his position in government.  —  Edward “Big Balls” Coristine … ",
    "url": "https://www.wired.com/story/big-balls-social-security-administration/"
  },
  {
    "text": "US plans to deport Abrego Garcia to a country that's not El Salvador, prosecutor tells judge  —  President Donald Trump's administration plans to deport Kilmar Abrego Garcia to a country that's not his native El Salvador after he's released from jail in Tennessee, a federal prosecutor told a federal judge in Maryland on Thursday.",
    "url": "https://apnews.com/article/kilmar-abrego-garcia-maryland-tennessee-charges-deportation-c96844906793b35a80f9bbb4afa07e94"
  },
  {
    "text": "Support Rises For Giving Most Undocumented Immigrants A Pathway To Legal Status vs. Deportations, Quinnipiac University National Poll Finds; More Than 9 In 10 Voters Say Politically Motivated Violence In The U.S. Is A Serious Problem  — mail_outline",
    "url": "https://poll.qu.edu/poll-release?releaseid=3926"
  },
  {
    "text": "States can cut off Medicaid funding to Planned Parenthood, the Supreme Court rules  —  A divided Supreme Court allowed states to cut off Medicaid money to Planned Parenthood in a ruling handed down Thursday amid a wider Republican-backed push to defund the country's biggest abortion provider.",
    "url": "https://apnews.com/article/supreme-court-planned-parenthood-abortion-medicaid-e056395b9e5646d13539e76605027a1f"
  },
  {
    "text": "Former Trump lawyer Kenneth Chesebro disbarred in New York over 2020 election interference case  —  Chesebro pleaded guilty in 2023 to one count of conspiracy to commit filing false documents in the Georgia election interference case against Trump and his allies.",
    "url": "https://www.nbcnews.com/politics/donald-trump/former-trump-lawyer-kenneth-chesebro-disbarred-new-york-2020-election-rcna215425"
  },
  {
    "text": "Former Supreme Court Justice Kennedy says ‘democracy is at risk’  —  The retired Reagan appointee joined a forum on threats to judges and the rule of law.  —  Former Supreme Court Justice Anthony Kennedy warned Thursday that acrimonious political discourse and threats to judges are eroding … ",
    "url": "https://www.politico.com/news/2025/06/26/anthony-kennedy-democracy-judiciary-threats-00427714"
  },
  {
    "text": "Harvard Is Asking Corporations to Fill Its Federal Funding Gap  —  Top universities look to big tech and pharmaceutical companies for support after Trump's cuts to government grants  —  Harvard University and other top research schools are seeking corporate funders to support … ",
    "url": "https://www.wsj.com/us-news/education/harvard-funding-corporate-sponsors-4ee36388?st=AxFDez&reflink=article_copyURL_share"
  },
  {
    "text": "American Vogue Seeks New Head of Editorial Content  —  Anna Wintour will continue in her roles as chief content officer for Condé Nast and global editorial director, Vogue.  —  It's the end of an era. … Wintour, 75, will remain chief content officer for Condé Nast and global editorial director, Vogue.",
    "url": "https://wwd.com/fashion-news/fashion-scoops/american-vogue-new-head-editorial-content-search-1237951685/"
  },
  {
    "text": "After 10 years of marriage equality, the fight continues for LGBTQ+ rights  —  Your support makes The Advocate's original LGBTQ+ reporting possible.  Become a member today to help us continue this work.  —  Join the fight  —  A lot of queer people can tell you exactly where they were at 10 a.m. on Friday, June 26, 2015.",
    "url": "https://www.advocate.com/voices/marriage-equality-fight-continues-opinion"
  },
  {
    "text": "Canadian man awaiting deportation dies at detention facility in downtown Miami  —  Johnny Noviello moved from Canada to Daytona Beach when he was 10 years old.  He grew up in Florida and became a lawful permanent resident.  —  On Monday, June 23, he died at the Federal Detention Center in downtown Miami … ",
    "url": "https://www.miamiherald.com/news/local/immigration/article309501470.html"
  },
  {
    "text": "Gen Z content creator challenges old guard with long-shot run for Congress  —  Twenty-five-year-old Deja Foxx's run against Adelita Grijalva, the daughter of a longtime lawmaker who died in office this year, shows some of the tensions in today's Democratic Party.",
    "url": "https://www.washingtonpost.com/politics/2025/06/27/deja-foxx-gen-z-creator-congress-democrats/"
  },
  {
    "text": "Republican senators propose slashing size of intel office led by Tulsi Gabbard  —  A bill by Sen. Tom Cotton would cut the Office of the Director of National Intelligence by 60%.  The move comes as Gabbard appears to have fallen out of favor in the Trump administration.",
    "url": "https://www.nbcnews.com/politics/national-security/republican-senators-propose-slashing-size-intel-office-led-tulsi-gabba-rcna214330"
  },
  {
    "text": "Exclusive poll: Most voters back Iran strikes, but worry about attacks on U.S.  —  The U.S. attacks on Iran's nuclear facilities Saturday have left American voters with contradictory feelings, a new poll finds:  — A majority favored limited strikes, but nearly as many said they were worried … ",
    "url": "https://www.axios.com/2025/06/27/poll-trump-strikes-iran-israel"
  },
  {
    "text": "ICE Is Using a New Facial Recognition App to Identify People, Leaked Emails Show  —  Immigration and Customs Enforcement (ICE) is using a new mobile phone app that can identify someone based on their fingerprints or face by simply pointing a smartphone camera at them, according to internal ICE emails viewed by 404 Media.",
    "url": "https://www.404media.co/ice-is-using-a-new-facial-recognition-app-to-identify-people-leaked-emails-show/"
  }
]