[
  {
    "text": "X ad boycott gathers pace amid antisemitism storm  —  Firms including Apple, Disney and IBM have paused advertising on X amid an antisemitism storm on the site.  —  It comes after X owner Elon Musk amplified an antisemitic trope on the platform formerly known as Twitter.",
    "url": "https://www.bbc.com/news/world-us-canada-67460386"
  },
  {
    "text": "X is placing ads for Amazon, NBA Mexico, NBCUniversal, and others next to content with white nationalist hashtags  —  IBM recently announced that it suspended advertising on X — will others follow? … IBM announced yesterday that it is suspending its advertising on X (formerly Twitter) … ",
    "url": "https://www.mediamatters.org/twitter/x-placing-ads-amazon-nba-mexico-nbcuniversal-and-others-next-content-white-nationalist"
  },
  {
    "text": "With antisemitic tweet, Elon Musk reveals his ‘actual truth’  —  Editor's Note: A version of this story appeared in CNN Business' Nightcap newsletter.  To get it in your inbox, sign up for free, here.  —  New York CNN  —  Elon Musk has publicly endorsed an antisemitic conspiracy … ",
    "url": "https://www.cnn.com/2023/11/17/business/elon-musk-reveals-his-actual-truth/"
  },
  {
    "text": "How a flood of congressional retirements is rocking the 2024 elections  —  Nine incumbents have already announced this month they aren't running for reelection next year.  —  A surge of lawmakers calling it quits the past three weeks is on the verge of putting Congress on pace … ",
    "url": "https://www.politico.com/news/2023/11/18/congress-retirements-2024-elections-00127883"
  },
  {
    "text": "The No Labels party asked its supporters if they would pay $100 to help choose its 2024 nominee  —  No Labels, a political organization that has alarmed some Democrats with talk of launching a third-party presidential candidate, has contemplated requiring a donation of at least $100 in order … ",
    "url": "https://apnews.com/article/no-labels-poll-unity-ticket-5713de0765dcf4b1b5ec16fb2ee4088d"
  },
  {
    "text": "Trump Engaged in Insurrection but Can Stay on Colorado's Ballot Anyway, Court Rules  —  He did not meet the qualification of “an officer of the United States.”  —  Former President Donald Trump can appear on Colorado's primary ballot despite his having engaged in an insurrection for his role in Jan. 6, 2021, a judge ruled Friday.",
    "url": "https://www.thedailybeast.com/donald-trump-engaged-in-insurrection-but-can-stay-on-colorados-ballot-anyway-court-rules"
  },
  {
    "text": "Colorado Judge Keeps Trump on Ballot but Finds He ‘Engaged in Insurrection’  —  A district court judge ruled that former President Donald J. Trump “engaged in insurrection” but said the disqualification clause of the 14th Amendment did not apply to him.  —  A Colorado judge ruled on Friday … ",
    "url": "https://www.nytimes.com/2023/11/17/us/politics/colorado-trump-14th-amendment.html"
  },
  {
    "text": "Hunter Biden's career of benefiting from his father's name  —  The president's son has had a complex, even tortured relationship with the ‘Biden brand’  —  Hunter Biden worked for years to cultivate high-level relationships in China, flying to the country with his father on Air Force … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/18/hunter-biden-family-name/"
  },
  {
    "text": "Wall Street Eyes Nikki Haley as Trump Spoiler  —  Republican donors aim to boost Haley while Biden backers fret about his chances  —  Big hitters on Wall Street are lining up to support Nikki Haley's long-shot bid to snatch the 2024 Republican presidential nomination from Donald Trump.",
    "url": "https://www.wsj.com/politics/elections/wall-street-eyes-nikki-haley-as-trump-spoiler-1b3144f3?mod=followamazon"
  },
  {
    "text": "Biden Skillfully Handled Xi Jinping's U.S. Visit in Ways Trump Simply Never Could  —  The president was gracious but tough, candid but thoughtful, and unlike his predecessor, did not sell out the country to a dictator. … Had Donald Trump been the U.S. president hosting this week's APEC meetings … ",
    "url": "https://www.thedailybeast.com/biden-handled-xi-jinpings-us-visit-in-ways-trump-simply-never-could"
  },
  {
    "text": "Former first lady Rosalynn Carter enters hospice care  —  The Carter Center says former first Lady Rosalynn Carter entered hospice care at her home on Friday  —  Former first lady Rosalynn Carter has entered hospice care at her home in Georgia, according to a statement from the Carter Center on behalf of her grandson, Jason Carter.",
    "url": "https://www.foxnews.com/politics/former-first-lady-rosalynn-carter-enters-hospice-care"
  },
  {
    "text": "Texas: Republican-controlled school board votes against climate textbooks  —  Republican board member condemns photos in some textbooks for being unfairly critical of oil and gas industry  —  Texas's Republican-controlled education board voted Friday against including several climate textbooks in the state science curriculum.",
    "url": "https://www.theguardian.com/us-news/2023/nov/17/texas-republican-school-board-climate-textbooks"
  },
  {
    "text": "‘Blood on your hands’: Jewish congressman's office defaced with pro-Palestinian graffiti  —  (New York Jewish Week) — The Brooklyn office of Rep. Daniel Goldman was defaced with pro-Palestinian graffiti, as antisemitic crimes surge in New York during the war between Israel and Hamas in Gaza.",
    "url": "https://www.jta.org/2023/11/17/ny/blood-on-your-hands-jewish-congressmans-office-defaced-with-pro-palestinian-graffiti"
  },
  {
    "text": "The Bin Laden Letter Is Being Weaponized by the Far Right  —  Far-right influencers and right-wing lawmakers are using the spread of Osama bin Laden's “Letter to America” to call for a TikTok ban and boost decades old conspiracies.  —  A number of users have posted TikToks in recent days … ",
    "url": "https://www.wired.com/story/far-right-bin-laden-letter-to-america-conspiracies/"
  }
]