[
  {
    "text": "Hamas surprise attack out of Gaza stuns Israel and leaves hundreds dead in fighting, retaliation  —  Hamas militants fired thousands of rockets and sent dozens of fighters into Israeli towns near the Gaza Strip in an unprecedented surprise early morning attack during a major Jewish holiday Saturday … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-rockets-airstrikes-tel-aviv-11fb98655c256d54ecb5329284fc37d2"
  },
  {
    "text": "Israel confirms soldiers and civilians taken hostage by militants  —  Summary  — Dozens of Israelis are believed to have been captured by Palestinian militants in an unprecedented assault into Israeli territory  — “We are at war,” says Israel's PM Benjamin Netanyahu",
    "url": "https://www.bbc.com/news/live/world-middle-east-67037895"
  },
  {
    "text": "Israel at War: Hamas has Israeli hostages  —  More than 100 Israelis are dead nearly 1,000 Israelis have been injured in the Hamas rocket and terror assault from Beersheba to Jerusalem, the Health Ministry said.  —  Operation Swords of Iron: Israel hits 100 dead and 900 injured",
    "url": "https://www.jpost.com/israel-news/defense-news/2023-10-07/live-updates-762053"
  },
  {
    "text": "Netanyahu says Israel ‘at war’ after Hamas attack; air force kills nearly 200 in Gaza air strikes  —  Israeli Prime Minister Benjamin Netanyahu said “we are at war, and we will win it” Saturday after Hamas launched an assault and took captives following the 50th anniversary of the start … ",
    "url": "https://www.washingtonpost.com/world/2023/10/07/israel-gaza-rocket-attack-hamas/"
  },
  {
    "text": "Terrorist group's attack on Israel is yet another Biden geopolitical failure  —  How many billions of dollars does President Joe Biden want to send to countries that support terrorist groups?  It's an important question that needs answering after Hamas' attack on Israel on Saturday morning.",
    "url": "https://www.washingtonexaminer.com/opinion/terrorist-groups-attack-on-israel-is-yet-another-biden-geopolitical-failure"
  },
  {
    "text": "Gunmen in homes and captives abducted to Gaza leave Israelis in shock  —  Bloodied bodies in the streets, gunmen raiding door-to-door and news of captives taken to Gaza left Israelis terrified and in shock after the Palestinian militant group Hamas launched a surprise attack that was unprecedented in audacity and scale.",
    "url": "https://www.reuters.com/world/middle-east/gunmen-homes-captives-abducted-gaza-leave-israelis-shock-2023-10-07/"
  },
  {
    "text": "Pence slams Trump, GOP ‘voices of appeasement’ as Israel comes under attack  —  The former vice president called out Donald Trump, Ron DeSantis and Vivek Ramaswamy by name.  —  GLENWOOD, I.A. — Former Vice President Mike Pence tore into Donald Trump and pointed to isolationism … ",
    "url": "https://www.politico.com/news/2023/10/07/gop-presidential-hopefuls-reaffirm-support-for-israel-following-hamas-attack-00120481"
  },
  {
    "text": "2024 GOP presidential contenders blame Biden for Hamas attacks on Israel  —  Several of them baselessly claimed the U.S. funded the attacks as a result of the prisoner exchange deal with Iran.  —  Republican 2024 presidential candidates blamed the Biden administration for the attacks Hamas … ",
    "url": "https://www.nbcnews.com/politics/2024-election/2024-gop-presidential-contenders-blame-biden-hamas-attacks-israel-rcna119328"
  },
  {
    "text": "Eyes turn to Iran as Israel responds to Hamas terror attacks  —  As Israel reels from a coordinated terror operation by Gaza-based Hamas that, by early accounts, has left dozens of civilians dead and wounded, it's unclear how the military may retaliate.  —  Early reports show that dozens … ",
    "url": "https://www.washingtonexaminer.com/policy/defense-national-security/iran-israel-responds-hamas-terror-attacks"
  },
  {
    "text": "'There's Going to Be a Lot of Soul-Searching in Israel When This Is Over'  —  Former U.S. peace negotiator Dennis Ross weighs in on Hamas' attack on Israel and the “missed opportunities” that led to the war.  —  No American diplomat is more familiar with the long history of enmity between Israelis … ",
    "url": "https://www.politico.com/news/magazine/2023/10/07/israel-hamas-attack-00120498"
  },
  {
    "text": "The significance of why Hamas chose to attack Israel now  —  Former U.S. officials say the group and its Iranian backers tried to exploit Israeli political divisions and to derail historic negotiations between Saudi Arabia, Israel and the U.S.  —  Hamas's unprecedented attack on Israel comes … ",
    "url": "https://www.nbcnews.com/news/significance-hamas-chose-attack-israel-now-rcna119351"
  },
  {
    "text": "Amazon's Alexa has been claiming the 2020 election was stolen  —  The popular voice assistant says the 2020 race was stolen, even as parent company Amazon promotes the tool as a reliable election news source — foreshadowing a new information battleground  —  Amid concerns the rise … ",
    "url": "https://www.washingtonpost.com/technology/2023/10/07/amazon-alexa-news-2020-election-misinformation/"
  },
  {
    "text": "Biden Condemns Hamas Attack on Israel  —  The president vowed that the United States “will not ever fail” to support Israel after the country faced an early-morning assault by Palestinian militants.  —  Today, the people of Israel are under attack orchestrated by a terrorist organization, Hamas.",
    "url": "https://www.nytimes.com/video/us/politics/100000009122678/biden-israel-gaza-attack.html"
  },
  {
    "text": "Two Families Got Fed Up With Their States' Politics.  So They Moved Out.  —  The Nobles of Iowa moved to blue Minnesota.  The Huckinses of Oregon moved to red Missouri.  Their separate journeys, five weeks apart, illustrate the fracturing of America.  —  By Trip GabrielPhotographs by Hilary Swift",
    "url": "https://www.nytimes.com/2023/10/07/us/politics/politics-states-moving.html"
  },
  {
    "text": "How not to cover Donald Trump's bizarre 2024 campaign for president  —  The press should borrow a lyric from “The Sound of Music” and ask itself: “How do you solve a problem like Donald?”  Or, put another way, how should journalists cover Trump's unprecedented campaign for president … ",
    "url": "https://www.latimes.com/opinion/story/2023-10-07/donald-trump-2024-campaign-president-media-press-ron-desantis-primary-election"
  }
]