[
  {
    "text": "Billionaires are lining up to fund Donald Trump's anti-democratic agenda  —  The more disturbing Trump's public proclamations become, the more US plutocrats seem to want him to win  —  As an ever-greater portion of the nation's total wealth goes to the top, it's hardly surprising that ever … ",
    "url": "https://www.theguardian.com/commentisfree/2023/nov/21/donald-trump-anti-democratic-agenda-billionaires-neofascism"
  },
  {
    "text": "House Democrat apologizes after saying Trump ‘has to be eliminated’  —  Rep. Daniel Goldman (D-N.Y.) apologized Monday for his “poor choice of words” when he said former President Trump must be “eliminated” to protect democracy.  —  “Yesterday on TV, I mistakenly used the wrong word to express … ",
    "url": "https://thehill.com/homenews/house/4321089-trump-goldman-apology-eliminated-democracy-2024/"
  },
  {
    "text": "House Speaker Mike Johnson Visits Trump at Mar-a-Lago  —  It was the speaker's first trip to see the former president since he won his post, and it came as he faced anger from right-wing lawmakers for moving to fund the government.  —  Speaker Mike Johnson on Monday night visited former … ",
    "url": "https://www.nytimes.com/2023/11/21/us/politics/johnson-trump-mar-a-lago.html"
  },
  {
    "text": "Texas attorney general opens probe into Media Matters over report on X ads  —  Texas Attorney General Ken Paxton (R) said Monday that his office is opening an investigation into Media Matters for America over its recent reports accusing X, the platform formerly known as Twitter … ",
    "url": "https://thehill.com/policy/technology/4320745-texas-attorney-general-ken-paxton-opens-probe-media-matters-x-ads/"
  },
  {
    "text": "Far-right conspiracy theorists accused a 22-year-old Jewish man of being a neo-Nazi.  Then Elon Musk got involved  —  Ben Brody says his life was going fine.  He had just finished college, stayed out of trouble, and was prepping for law school.  Then, seemingly out of nowhere … ",
    "url": "https://www.cnn.com/2023/11/20/business/brody-musk-lawsuit-invs/"
  },
  {
    "text": "Elon Musk provides yet another platform for far-right attacks  —  Since Elon Musk took possession of Twitter last year — after unsuccessfully trying to back out of its purchase — changes to the platform have ranged from obvious to subtle.  It's now called “X,” for inexplicable reasons … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/21/musk-media-matters-texas/"
  },
  {
    "text": "Israel-Hamas deal on hostage release and ceasefire is imminent, sources say  —  A deal between Israel and Hamas to free dozens of hostages and declare a multi-day ceasefire is imminent and could be announced by the Qatari mediators as soon as Tuesday, two sources with direct knowledge of the issue told Axios.",
    "url": "https://www.axios.com/2023/11/21/israel-hamas-hostage-ceasefire-deal-imminent"
  },
  {
    "text": "How a Maine Businessman Made the AR-15 Into America's Best-Selling Rifle  —  Neither a gun enthusiast nor a right-wing ideologue, Richard Dyke used political connections and lobster giveaways to build Bushmaster, the company that popularized assault-style rifles.  —  Under the Gun: How Gun Violence Is Impacting the Nation",
    "url": "https://www.propublica.org/article/how-bushmaster-made-ar-15-into-best-selling-rifle-us"
  },
  {
    "text": "Binance Founder Changpeng Zhao Agrees to Step Down, Plead Guilty  —  Zhao's crypto exchange will also admit wrongdoing and agree to pay $4.3 billion in fines  —  The chief executive of Binance, the largest global cryptocurrency exchange, plans to step down and plead guilty … ",
    "url": "https://www.wsj.com/finance/currencies/binance-ceo-changpeng-zhao-step-down-plead-guilty-01f72a40?mod=followamazon"
  },
  {
    "text": "Mike Johnson's America: Revisit landmark SCOTUS decisions and use government to ‘restrain evil’  —  Mike Johnson, the new speaker of the House, voiced support for revisiting Supreme Court decisions that struck down restrictions on the use of contraception, barred bans on gay sex … ",
    "url": "https://www.cnn.com/2023/11/21/politics/mike-johnson-kfile-invs"
  },
  {
    "text": "Attorney for Alleged MI Fake Elector Wants Co-Defendants to ‘Shut Up’  —  Some defendants in a scheme to overturn Michigan's 2020 presidential election results claim they were acting on Trump's orders.  —  During a September fundraiser for his client, an attorney for a defendant … ",
    "url": "https://www.thedailybeast.com/kevin-kijewski-attorney-for-alleged-mi-fake-elector-clifford-frost-wants-co-defendants-to-shut-up"
  },
  {
    "text": "House GOP's Biden impeachment effort heads into final stage  —  The conference plans to depose Hunter Biden in December and is working to tie up other threads before January — when advocates hope they can start moving toward a vote.  —  House Republicans are closing in on a make-or-break moment … ",
    "url": "https://www.politico.com/news/2023/11/21/house-republicans-biden-impeachment-00128154"
  },
  {
    "text": "Tux-Wearing Christian Nationalists Laugh About Their Influence, Live From Mar-a-Lago  —  The pastor with whom Speaker Mike Johnson prayed to ward off God's judgment made the case for Christian dominion at Trump's Florida domain  —  CHRISTIAN NATIONALISTS WERE out in force at Mar-a-Lago on Friday night … ",
    "url": "https://www.rollingstone.com/politics/politics-features/christian-nationalists-influence-mar-a-lago-1234889682/"
  },
  {
    "text": "Many now see Haley as Trump's top GOP challenger.  She faces hurdles ahead.  —  Jockeying in a tier below the former president has moved, with Haley surging into a distant second place  —  HOOKSETT, N.H. — Nikki Haley has in many ways pushed past Ron DeSantis to become the top alternative to Donald Trump … ",
    "url": "https://www.washingtonpost.com/elections/2023/11/21/haley-trump-desantis-republican-presidential/"
  },
  {
    "text": "Federal appeals court strikes Maryland handgun rule  —  A federal appeals court struck down part of Maryland's laws regulating handguns Tuesday, overturning a requirement to obtain a handgun license before purchasing a firearm.  —  In a 2-1 ruling, a panel of the Virginia-based 4th Circuit Court … ",
    "url": "https://thehill.com/regulation/court-battles/4321243-federal-appeals-court-strikes-maryland-handgun-rule/"
  },
  {
    "text": "The Trump Threat Is Growing.  Lawyers Must Rise to Meet This Moment.  —  American democracy, the Constitution and the rule of law are the righteous causes of our times, and the nation's legal profession is obligated to support them.  But with the acquiescence of the larger conservative legal movement … ",
    "url": "https://www.nytimes.com/2023/11/21/opinion/trump-lawyers-constitution-democracy.html"
  },
  {
    "text": "Matt Gaetz at 21% approval rating in Florida, poll says  —  A new poll shows U.S. Rep. Matt Gaetz is a polarizing figure in Florida, both in and outside of the Republican Party.  —  A poll from the Florida Atlantic University Mainstreet PolCom Lab released last week showed that 57% … ",
    "url": "https://www.pnj.com/story/news/politics/2023/11/21/congressman-matt-gaetz-at-21-approval-following-house-speaker-drama/71653429007/"
  },
  {
    "text": "Utah special congressional election sees GOP ex-House staffer face Democratic legislator  —  Republican Celeste Maloy and state Sen. Kathleen Riebe are competing to become the first woman in Utah's congressional delegation since 2019 and only the fifth in history.",
    "url": "https://www.nbcnews.com/politics/congress/utah-special-congressional-election-sees-gop-ex-house-staffer-face-dem-rcna126132"
  },
  {
    "text": "Appeal filed in Colorado 14th Amendment case  —  The six Republican and unaffiliated Colorado voters who challenged Donald Trump's eligibility to be on the ballot following his actions on January 6th last night filed an appeal with the Colorado Supreme Court challenging the judge's rulings … ",
    "url": "https://www.citizensforethics.org/news/press-releases/appeal-filed-in-colorado-14th-amendment-case/"
  },
  {
    "text": "The ‘Anti-Defeat’ Candidate  —  Like many politicians, Representative Dean Phillips likes to look people in the eye.  And because he's a politician, Phillips can glean things, just as President George W. Bush did when he peered into Vladimir Putin's eyes and saw his soul.",
    "url": "https://www.theatlantic.com/politics/archive/2023/11/dean-phillips-2024-election-new-hampshire-primary/676058/"
  },
  {
    "text": "Cornel West sets his sights on a key battleground state  —  The independent candidate is well positioned to capitalize on Biden's weaknesses in a certain swing state.  —  Independent presidential hopeful Cornel West is taking aim at Michigan by courting voter groups that Joe Biden is struggling with … ",
    "url": "https://www.politico.com/news/2023/11/21/joe-biden-cornel-west-michigan-2024-00128244"
  }
]