[
  {
    "text": "Trump's Case Against Man Deported in “Error” Just Took Another Big Hit  —  As Trump administration officials seek to defend their refusal to return Kilmar Abrego Garcia to the United States after deporting him in “error,” one of the government's chief justifications has been that he was a member of the MS-13 gang.",
    "url": "https://newrepublic.com/article/194010/kilmar-abrego-garcia-case-trump-deported-error-another-hit"
  },
  {
    "text": "Karoline Leavitt Melts Down Over Deported ‘Father of the Year’  —  LEAVITT ALONE  —  Trump's press secretary mocked the Maryland father who the administration mistakenly deported to a Salvadoran mega-prison.  —  White House Press Secretary Karoline Leavitt lashed out at reporters Tuesday … ",
    "url": "https://www.thedailybeast.com/karoline-leavitt-melts-down-over-deported-father-of-the-year/"
  },
  {
    "text": "Judge in Abrego Garcia case indicates she's weighing contempt proceedings against Trump administration  —  U.S. District Judge Paula Xinis also ordered the administration to provide evidence about what steps it's taken — or hasn't taken — to facilitate the return of Kilmar Abrego Garcia.",
    "url": "https://www.nbcnews.com/politics/immigration/judge-abrego-garcia-case-indicates-weighing-contempt-proceedings-trump-rcna201359"
  },
  {
    "text": "Exclusive: Top Hegseth adviser Dan Caldwell put on leave in Pentagon leak probe  —  One of U.S. Defense Secretary Pete Hegseth's leading advisers, Dan Caldwell, was escorted from the Pentagon on Tuesday after being identified during an investigation into leaks at the Department of Defense, a U.S. official told Reuters.",
    "url": "https://www.reuters.com/world/us/top-hegseth-advisor-dan-caldwell-put-leave-pentagon-leak-probe-2025-04-15/"
  },
  {
    "text": "Two top Pentagon officials placed on leave in leak probe  —  The disclosures under investigation include Elon Musk's visit to the Pentagon.  —  The Pentagon placed two top political appointees under administrative leave on Tuesday after a probe into potential leaks of sensitive information, according to three defense officials.",
    "url": "https://www.politico.com/news/2025/04/15/caldwell-pentagon-leaks-00291735"
  },
  {
    "text": "Pentagon's ‘SWAT team of nerds’ resigns en masse  —  Employees of a defense tech unit say they were sidelined by DOGE.  “Either we die quickly or we die slowly,” says the director.  —  Under pressure from the Elon Musk-led Department of Government Efficiency, nearly all the staff … ",
    "url": "https://www.politico.com/news/2025/04/15/pentagons-digital-resignations-00290930"
  },
  {
    "text": "The Tactics Elon Musk Uses to Manage His ‘Legion’ of Babies—and Their Mothers  —  The world's richest man juggles more than a dozen children and ‘harem drama’ along with running his companies and advising Trump.  He recently took a paternity test in a battle with one woman over money and privacy.",
    "url": "https://www.wsj.com/politics/elon-musk-children-mothers-ashley-st-clair-grimes-dc7ba05c?st=rbiMzK&reflink=mobilewebshare_permalink"
  },
  {
    "text": "White House Moves to Limit Newswire Access After AP Lawsuit Win  —  The White House announced Tuesday that it was eliminating the traditional press pool access for wire services after a federal court ordered the administration to end viewpoint discrimination against the Associated Press.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-15/white-house-moves-to-limit-newswire-access-after-ap-lawsuit-win"
  },
  {
    "text": "The demands Harvard refused  —  The Trump administration is attempting to gain partial control over one of the nation's top universities. … The Trump administration last night froze $2.2 billion in federal funding for Harvard, punishment after the university said Monday it would not comply with the administration's demands.",
    "url": "https://www.vox.com/the-logoff-newsletter-trump/408890/trump-harvard-university-funding-logoff"
  },
  {
    "text": "‘Treated like a criminal’: US citizen says he was detained returning from Canada  —  Bachir Atallah, a real estate attorney from New Hampshire, says he and his wife, Jessica Fakhri, were stopped crossing from Canada into Vermont  —  A New Hampshire real estate attorney and American citizen returning home … ",
    "url": "https://www.nbcboston.com/news/politics/treated-like-a-criminal-us-citizen-says-he-was-detained-returning-from-canada/3686188/"
  },
  {
    "text": "Uncle Sam abruptly turns off funding for CVE program.  Yes, that CVE program  —  Because vulnerability management has nothing to do with national security, right?  —  US government funding for the world's CVE program - the centralized Common Vulnerabilities and Exposures database of product security flaws - ends Wednesday.",
    "url": "https://www.theregister.com/2025/04/16/homeland_security_funding_for_cve/"
  },
  {
    "text": "Biden to deliver first public address since leaving White House  —  Former President Biden is set to deliver his first public address since leaving the White House, speaking at the national conference of Advocates, Counselors and Representatives for the Disabled (ACRD) in Chicago on Tuesday, according to a release from the organization.",
    "url": "https://thehill.com/homenews/administration/5248033-biden-address-social-security/"
  },
  {
    "text": "Lawyer: Federal agents detain Guatemalan man, 29, with no criminal record  —  A Guatemalan immigrant with no Massachusetts criminal record was arrested Monday on Tallman Street after federal agents shattered the glass on his vehicle as he and his wife waited inside the car for their lawyer to arrive.",
    "url": "https://newbedfordlight.org/lawyer-federal-agents-detain-guatemalan-man-29-with-no-criminal-record/"
  },
  {
    "text": "The NPR, PBS Grift Has Ripped Us Off for Too Long  —  For years, American taxpayers have been on the hook for subsidizing National Public Radio (NPR) and the Public Broadcasting Service (PBS), which spread radical, woke propaganda disguised as “news.”  —  As President Trump has stated … ",
    "url": "https://www.whitehouse.gov/articles/2025/04/the-npr-pbs-grift-has-ripped-us-off-for-too-long/"
  },
  {
    "text": "Senator Chuck Grassley grilled at Iowa town hall over ‘shameful’ Trump policies  —  The Republican, 91, was confronted by attendees angered over mass deportations and executive overreach  —  The Republican senator Chuck Grassley struggled to control a town hall meeting on Tuesday … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/15/chuck-grassley-town-hall"
  },
  {
    "text": "Shop this look: Buy cheap, faux gold dupes of Oval Office decor  —  BARGAIN BAROQUE  —  Shop this look: Buy cheap, faux gold dupes of Oval Office decor … By Luke Kawa  —  2H  —  US stocks slip on poor progress in trade talks with the EU  —  Major indexes gave up early gains … ",
    "url": "https://sherwood.news/power/shop-this-look-buy-cheap-faux-gold-dupes-of-oval-office-decor/"
  },
  {
    "text": "Trump signs healthcare executive order that includes a win for pharma companies  —  U.S. President Donald Trump directed his health department on Tuesday to work with Congress on revamping a law that allows Medicare to negotiate prescription drug prices, seeking to introduce a change the pharmaceutical industry has lobbied for.",
    "url": "https://www.reuters.com/world/us/trump-signs-healthcare-executive-order-that-includes-win-pharma-companies-2025-04-15/"
  },
  {
    "text": "Republicans Are Trying to Steal an Election  —  Republicans are trying to steal an election in North Carolina.  They have been laying the groundwork for five months, and unless the federal courts intervene, they just might succeed.  If they do, it could usher in a new era of election subversion in future contests across the country.",
    "url": "https://www.democracydocket.com/opinion/republicans-are-trying-to-steal-an-election/"
  },
  {
    "text": "CAUT advises academics against non-essential travel to the U.S.  —  Given the rapidly evolving political landscape in the United States and reports of individuals encountering difficulties crossing the border, CAUT strongly recommends that academic staff travel to the U.S. only if essential and necessary.",
    "url": "https://www.caut.ca/latest/2025/04/caut-advises-academics-against-non-essential-travel-us"
  },
  {
    "text": "Leading Harvard scientist ordered to halt research in funding freeze  —  A top scientist at Harvard who has spent years unraveling the mysteries of tuberculosis woke up Tuesday morning and discovered an order from the federal government telling her to halt her research.",
    "url": "https://www.bostonglobe.com/2025/04/15/metro/harvard-scientist-funding-freeze/"
  },
  {
    "text": "DOGE sought to assign a team to an independent nonprofit group  —  A representative of DOGE met with leaders of the Vera Institute of Justice, a nonprofit organization that advocates for lower incarceration rates.  —  U.S. DOGE Service representatives told leaders of a nonprofit group Tuesday … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/15/doge-musk-nonprofit-vera-institute/"
  },
  {
    "text": "IRS to Lose 20% of Workforce to New Trump Resignation Offer  —  About 20,000 IRS workers—roughly one-fifth of the agency—are taking the Trump administration's second deferred resignation offer, according to a person familiar with the matter.  —  That uptake effectively reverses the staff hikes … ",
    "url": "https://news.bloombergtax.com/daily-tax-report/about-20-000-irs-workers-take-second-deferred-resignation-offer"
  },
  {
    "text": "Jimmy Kimmel: ‘Now I See Myself More as a Place to Scream’  —  The late-night stalwart talks about taking on Trump, growing up in Vegas, and his path from host of The Man Show to defender of democracy  —  T … This is not the case.  The talk-show host's workspace is very public … ",
    "url": "https://www.rollingstone.com/tv-movies/tv-movie-features/jimmy-kimmel-trump-late-night-future-interview-1235315906/"
  },
  {
    "text": "How Well Is Congestion Pricing Doing?  Very.  —  “By the way, I have a favorite statistic,” Juliette Michaelson tells me midway through our conversation.  She's a deputy chief of the MTA, working on policy and especially on the rollout of the congestion-pricing toll program.",
    "url": "https://www.curbed.com/article/100-dayscongestion-pricing-mta-results.html?_gl=1*1m2okg0*_gcl_aw*R0NMLjE3MzkxMjk5MTAuQ2p3S0NBaUF3YUc5QmhBUkVpd0FkaHY2WTI2WlAxWGtCZjhJLUw2cmFNam51NWthTjhqNEl6VWN3ZnlsQlZrWElLZmpvcVd5d0dFbWpCb0NMN2dRQXZEX0J3RQ..*FPAU*MTM5NDU3MjI3OC4xNzQzNDUxOTE4*_ga*MTQ2NDAxNjU0OC4xNjgwNzkxNTU5*_ga_DNE38RK1HX*MTc0NDc0NDcyMC4yMjIuMS4xNzQ0NzQ0Nzg5LjAuMC45MDMxODk4NDQ.*_fplc*S21WSHRObzdGMkZaMXFJJTJGUnU0TTExOWZ0cyUyQms3NFk2ZFNENlNNaUtURXQ1eDB1V1ElMkJ3RnptWTFUWUhvQXRvc1ZSRTVwbzd2ejlNYnlja0FUZ1FnRGRXY2FlckZHYk9GZjRpWGk3eHQwbGRXTGZYSEtVOVhna1NRSkkya1NRJTNEJTNE"
  },
  {
    "text": "Mayra Flores hospitalized hours after launching comeback House bid  —  Former Republican Rep. Mayra Flores was hospitalized hours after she announced a run for embattled Rep. Henry Cuellar's (D-TX) House seat in Texas, her campaign said in a Tuesday statement.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/congressional/3380923/mayra-flores-hospitalized-hours-comeback-house-bid/"
  },
  {
    "text": "David Hogg, Parkland Survivor and D.N.C. Vice Chair, Hopes to Unseat Democratic Incumbents  —  David Hogg, a young liberal activist and now a vice chair of the Democratic National Committee, is leading an effort to unseat the party's older lawmakers in primaries.",
    "url": "https://www.nytimes.com/2025/04/15/us/politics/david-hogg-dnc-leaders-we-deserve.html"
  },
  {
    "text": "Autism rate increased, CDC says in report that contradicts RFK Jr. on cause  —  In a sample of communities, the biennial autism surveillance report found that 1 in 31 8-year-olds had the condition.  The CDC attributed the increase to better screening.  —  One in 31 8-year-olds had autism … ",
    "url": "https://www.washingtonpost.com/health/2025/04/15/autism-rfk-jr-trump-cdc/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0Njg5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MDcxOTk5LCJpYXQiOjE3NDQ2ODk2MDAsImp0aSI6IjAyYzM3ZDY1LTU4YjYtNDM4My1hMjNlLTAyZWRhZGYyZmM2ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wNC8xNS9hdXRpc20tcmZrLWpyLXRydW1wLWNkYy8ifQ.H0ENRVaxryUv70rJ_OnlegIQKyVirGC8zpfCbEtpmiU&itid=gfta"
  },
  {
    "text": "Has America Reached the End of the Road?  —  Donald Trump has forced the one crisis that will tell us who we are. … I have to say that the unraveling of American democracy has proceeded far faster than I thought it would: I always assumed concentration camps for Donald Trump's enemies … ",
    "url": "https://www.doomsdayscenario.co/p/has-america-reached-the-end-of-the-road-a1d4feac8041058a"
  },
  {
    "text": "Scoop: Top House Dems trying to send delegation to El Salvador  —  Two members of House Democratic leadership are trying to send an official congressional delegation to the El Salvadorian prison where the Trump administration is sending deportees, Axios has learned.",
    "url": "https://www.axios.com/2025/04/15/house-democrats-el-salvador-cecot-trump-bukele"
  },
  {
    "text": "Trump Administration Live Updates: Judge Scolds Government for Doing ‘Nothing’ to Return Deported Man  —  Where Things Stand  — Deportation hearing: A federal judge rebuked the Trump administration for doing “nothing” to arrange the return a Maryland man who was wrongly flown to a prison … ",
    "url": "https://www.nytimes.com/live/2025/04/15/us/trump-news"
  },
  {
    "text": "US Economy to Lose Billions as Foreign Tourists Stay Away … The US economy is set to lose billions of dollars in revenue in 2025 from a pullback in foreign tourism and boycotts of American products, adding to a growing list of headwinds keeping recession risk elevated.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-15/us-economy-is-set-to-lose-billions-as-foreign-tourists-stay-away?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NDcyMTA2NiwiZXhwIjoxNzQ1MzI1ODY2LCJhcnRpY2xlSWQiOiJTVUlONTZUMVVNMFcwMCIsImJjb25uZWN0SWQiOiIxNTI1ODQyQjlGOEY0MDMzQUVGNjI4MTNFMkIxMEY0OSJ9.wS0IkqtQyQvATuAxGJy6lWTZtnEbLJ5lfphLYnw6BdU"
  },
  {
    "text": "Border deployment vehicle accident kills two service members, third in critical condition  —  Two service members deployed to the U.S. Southern border were killed and a third is in serious condition after a vehicle accident near Santa Teresa, New Mexico, the military announced late Tuesday.",
    "url": "https://apnews.com/article/border-service-members-killed-vehicle-accident-0676c8454bff6d647f93cc14c61fcae5"
  }
]