[
  {
    "text": "Matt Gaetz says he will attempt to oust Kevin McCarthy from the speakership this week  —  Rep. Matt Gaetz is planning to attempt to oust Speaker Kevin McCarthy from the role this week after the House leader worked with Democrats to avoid a government shutdown on Saturday.",
    "url": "https://www.cnn.com/2023/10/01/politics/house-republicans-infighting-matt-gaetz-kevin-mccarthy-shutdown/"
  },
  {
    "text": "Gaetz Says He Will Move to Oust McCarthy for Working With Democrats  —  A day after the Republican speaker turned to Democrats for help passing a stopgap spending bill to avert a shutdown, the far-right congressman promised to try to remove him from his post.",
    "url": "https://www.nytimes.com/2023/10/01/us/politics/mccarthy-speaker-gaetz.html"
  },
  {
    "text": "Playbook: Inside the chess match between McCarthy, Jeffries and Gaetz  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  SPOTTED leaving the Capitol after the House CR vote: House Democratic leaders HAKEEM JEFFRIES, KATHERINE CLARK and PETE AGUILAR all laughing … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/01/inside-the-chess-match-between-mccarthy-jeffries-and-gaetz-00119335"
  },
  {
    "text": "AOC Says She Would ‘Absolutely’ Vote to Oust ‘Very Weak’ Speaker McCarthy  —  The congresswoman quipped that in attempting to avert a shutdown Republicans were “run[ning] around the House like a Roomba, until they found a door that House Democrats opened”  —  IN A RARE moment of unity … ",
    "url": "https://www.rollingstone.com/politics/politics-news/aoc-would-vote-to-oust-speaker-mccarthy-1234836365/"
  },
  {
    "text": "Who is this man and what has he done with Kevin McCarthy?  —  For eight months, there were no adults working in the House Republican day-care center.  —  Day after day, the toddlers of the far right threw tantrum after tantrum.  But instead of giving the brats in his caucus a timeout … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/30/mccarthy-government-shutdown-avoided/"
  },
  {
    "text": "Gaetz says he will force vote to oust McCarthy as House speaker  —  Rep. Matt Gaetz (R-Fla.) said Sunday that he is determined to try to oust Rep. Kevin McCarthy (R-Calif.) from his position as House speaker after McCarthy passed a stopgap measure to fund the government with Democratic support.",
    "url": "https://www.washingtonpost.com/politics/2023/10/01/kevin-mccarthy-matt-gaetz-house-speaker/"
  },
  {
    "text": "McCarthy, McConnell suffer setbacks over control of their caucuses  —  The House speaker and Senate minority leader faced rejection on different fronts: McCarthy forced into leaning on Democrats to keep the government open and McConnell defied by GOP senators on Ukraine  —  Congressional bureau chief",
    "url": "https://www.washingtonpost.com/politics/2023/10/01/mccarthy-mcconnell-congress-government-shutdown/"
  },
  {
    "text": "Trump Campaign Leaves Actual Birdcage at Nikki Haley's Hotel Door as Part of ‘Birdbrain’ Attack  —  It's unclear why Trump chose the nickname for the GOP presidential hopeful  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/trump-camp-steps-up-birdbrain-attacks-on-haley"
  },
  {
    "text": "Joe Manchin On Potential 2024 Third Party Run: ‘Why Not Have Options?’  —  The West Virginia senator argued Donald Trump and Joe Biden are too partisan and vowed to make a decision before the end of the year  —  A Facebook icon representing an external link to share the article on Facebook … ",
    "url": "https://themessenger.com/politics/joe-manchin-on-potential-2024-third-party-run-why-not-have-options"
  },
  {
    "text": "One Reason the Trump Fever Won't Break  —  The more I consider the challenge posed by Christian nationalism, the more I think most observers and critics are paying too much attention to the wrong group of Christian nationalists.  We mainly think of Christian nationalism as a theology or at least as a philosophy.",
    "url": "https://www.nytimes.com/2023/10/01/opinion/christian-nationalism-trump-renew-america.html"
  },
  {
    "text": "The Case for Amplifying Trump's Insanity  —  The “Banality of Crazy” has warped American politics, as few voters recognize just how deranged, delusional, and dangerous Donald Trump is...because the press rarely reports on his routine insanity. … Sometimes, you have to write when you're angry.",
    "url": "https://www.forkingpaths.co/p/the-case-for-amplifying-trumps-insanity"
  },
  {
    "text": "Meghan Markle Linked to Run for Dianne Feinstein's Senate Seat  —  Plus, hackers crash the royal website, Harry and Meghan backstage at Invictus Games, stay at Diana's childhood home, and why does runner William want to trademark race numbers? … Meghan “long-shot” replacement for Feinstein seat",
    "url": "https://www.thedailybeast.com/meghan-markle-linked-to-run-for-dianne-feinsteins-senate-seat"
  },
  {
    "text": "Fetterman: 'I'm done normalizing this dysfunction'  —  Pennsylvania Sen. John Fetterman (D) expressed his frustration with the recent state of Congress in the wake of the Senate voting to approve a continuing resolution (CR) to keep the government funded Saturday.",
    "url": "https://thehill.com/homenews/senate/4232340-fetterman-im-done-normalizing-this-dysfunction/"
  },
  {
    "text": "How the right's elevation of Robert F. Kennedy Jr. could now backfire  —  The American right's efforts to elevate Robert F. Kennedy Jr. were as transparent as they were cynical.  The idea, as advanced by Stephen K. Bannon and the like, was clearly to try to embarrass President Biden in the Democratic primary.",
    "url": "https://www.washingtonpost.com/politics/2023/10/01/how-rights-elevation-robert-f-kennedy-jr-could-now-backfire/"
  },
  {
    "text": "Lee supporters reignite pressure on Newsom over Senate appointment  —  The Congressional Black Caucus wrote to Newsom on Sunday voicing “strong support for Congresswoman Barbara Lee for that appointment.”  —  Allies of Rep. Barbara Lee are mounting a last-ditch effort to persuade Gov. Gavin Newsom … ",
    "url": "https://www.politico.com/news/2023/10/01/lee-newsom-senate-appointment-00119344"
  }
]