[
  {
    "text": "Trump urges Christians to vote: 'You won't have to do it' in four years  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4795823-trump-encourages-christians-vote/"
  },
  {
    "text": "Trump Tells Christians 'You Won't Have to Vote Anymore' If He's Elected  —  Donald Trump, after lamenting that conservative Christians are not “big voters,” urged the religious right to turn out for him “just this time.”  —  In the closing minutes of his speech to a gathering … ",
    "url": "https://www.nytimes.com/2024/07/27/us/politics/trump-votes-christians.html?unlocked_article_code=1.-U0.99ad.Z58CgfqpBLXD&smid=url-share"
  },
  {
    "text": "Trump Cryptically Declares, 'You Won't Have to Vote Anymore' If He Wins Second Term  —  Former President Donald Trump urged members of a crowd in Florida to vote and said that if he wins, they “won't have to vote anymore.”  —  Speaking at a Turning Point Action event in West Palm Beach on Friday … ",
    "url": "https://www.mediaite.com/trump/trump-cryptically-declares-you-wont-have-to-vote-anymore-if-he-wins-second-term/"
  },
  {
    "text": "Trump Tells Christians They Won't Have to Vote in Future: 'We'll Have It Fixed'  —  During an event in Florida, the former president urged attendees to vote and said that if reelected, they “won't have to do it anymore”  —  Donald Trump, the former president who double downed on his ambitions … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-if-reelected-wont-have-to-vote-fixed-1235069397/"
  },
  {
    "text": "Playbook: The JD Vance remorse parade  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT A CENTURY THIS MONTH HAS BEEN — “I don't know what they've got in these performance enhancers, but I'm feeling pretty jacked up,” President JOE BIDEN posted … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/27/the-jd-vance-remorse-parade-00171512"
  },
  {
    "text": "Pete Buttigieg Thinks the Trump Fever Could Break  —  This past month has been one of the most consequential and dizzying periods in modern American politics.  It began with President Biden's disastrous debate in late June.  Then came an assassination attempt against former President Trump.",
    "url": "https://www.nytimes.com/2024/07/27/magazine/pete-buttigieg-interview-election-democrats.html?unlocked_article_code=1.-U0.ScME.1jqtmBa1p-Nu&smid=url-share"
  },
  {
    "text": "House Republicans continue to flail, further endangering their majority  —  GOP members struggled with basic tasks this summer, heading for a long break with few accomplishments.  —  In his bid to claim the House speaker's gavel and end three weeks of chaos last fall, Rep. Mike Johnson mapped out an ambitious agenda.",
    "url": "https://www.washingtonpost.com/politics/2024/07/27/house-republicans-mike-johnson-recess-appropriations-bills/"
  },
  {
    "text": "Usha Vance told friends Trump appalled her.  Now she's working to elect him.  —  The potential second lady found Trump's actions on Jan. 6 “deeply disturbing,” a friend said.  But ambition and devotion to her husband ultimately drove her to a place in the former president's campaign.",
    "url": "https://www.washingtonpost.com/politics/2024/07/27/usha-vance-trump-jan6/"
  },
  {
    "text": "JD Vance, an Unlikely Friendship and Why It Ended  —  His political views differed from a transgender classmate's, but they forged a bond that lasted a decade — until Mr. Vance seemed to pivot, politically and personally.  —  When his book, “Hillbilly Elegy,” was published in 2016 … ",
    "url": "https://www.nytimes.com/2024/07/27/us/politics/jd-vance-friend-transgender.html?unlocked_article_code=1.-U0.Leu-.RgRLUedl-zbL&smid=url-share"
  },
  {
    "text": "Harris' Zoom-fueled campaign triggers a dormant Democratic base  —  They logged on.  They raised millions.  —  When a group of Black women political organizers assembled for a regular Zoom call on Sunday, they suddenly had a new mission.  A mere hours earlier, President Joe Biden had ended … ",
    "url": "https://www.politico.com/news/2024/07/27/kamala-harris-identity-zoom-00171489"
  },
  {
    "text": "This is a misogyny emergency.  A huge outpouring is coming in the runup to the US election  —  This time Kamala Harris will be the target for the social media platforms that promote prejudice  —  In 2016, a historically unprecedented incident took place.  And yet, barely anyone even noticed.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/27/misogyny-emergency-huge-outpouring-kamala-harris-us-electionction"
  },
  {
    "text": "KSTP/SurveyUSA poll: Harris takes lead over Trump in first Minnesota poll  —  Riding a wave of mostly positive coverage as the presumptive new presidential nominee for Democrats, Vice President Kamala Harris has a significant lead over former Republican President Donald Trump in Minnesota … ",
    "url": "https://kstp.com/kstp-news/top-news/kstp-surveyusa-poll-harris-takes-lead-over-trump-in-first-minnesota-poll/"
  },
  {
    "text": "Biden to announce plans to reform US supreme court - report  —  US president also to seek constitutional amendment to limit immunity for presidents and various officeholders  —  Joe Biden will announce plans to reform the US supreme court on Monday, Politico reported, citing two people familiar … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/26/biden-to-announce-plans-to-reform-us-supreme"
  },
  {
    "text": "Major Democratic donors want Kamala Harris to fire the FTC chair if she becomes president  —  FTC Chair Lina Khan has taken an aggressive approach to antitrust enforcement  —  Not even a week after Kamala Harris took over as the Democratic presidential nominee, major donors are already making demands of her potential administration.",
    "url": "https://qz.com/kamala-harris-democrat-donor-ftc-lina-khan-linkedin-iac-1851606256"
  },
  {
    "text": "Republicans Keep Trying to Copy Trump's Humor — And Voters Keep Cringing  —  Far-right candidates just can't duplicate the flair Trump brings from his TV career.  —  On Monday, in the midst of a speech in his hometown of Middletown, Ohio, one of JD Vance's half-jokes landed with a thud.",
    "url": "https://www.politico.com/news/magazine/2024/07/27/jd-vance-trump-imitation-00171375"
  },
  {
    "text": "Donald Trump Seen in Public Without Ear Bandage  —  LOOKS GOOD  —  The former president has ditched the gauze over his right ear which became a viral meme after the Republican National Convention.  —  Journalist  —  Donald Trump ditched his ear bandage for his meeting with Israeli Prime Minister Benjamin Netanyahu on Friday.",
    "url": "https://www.thedailybeast.com/donald-trump-seen-in-public-without-ear-bandage-after-assassination-attempt"
  },
  {
    "text": "Justice Department reaches $2M in settlements with FBI officials whose texts infuriated Trump  —  Other portions of Peter Strzok's lawsuit over his firing will continue as former FBI attorney Lisa Page's case is resolved.  —  The Justice Department has agreed to pay a total of $2 million … ",
    "url": "https://www.politico.com/news/2024/07/26/peter-strzok-lawsuit-settlement-00171498"
  }
]