[
  {
    "text": "A White Nationalist Wrote a Law School Paper Promoting Racist Views.  It Won Him an Award.  —  The University of Florida student won an academic honor after he argued in a paper that the Constitution applies only to white people.  From there, the situation spiraled.",
    "url": "https://www.nytimes.com/2025/06/21/us/white-supremacist-university-of-florida-paper.html?unlocked_article_code=1.Qk8.Zdse.9h3KhkfNOqv2&smid=url-share"
  },
  {
    "text": "‘A good day’: Detained U.S. citizen said agents bragged after arresting dozens at Home Depot  —  A 37-year-old U.S. citizen who was tackled to the ground and arrested after filming federal agents at Home Depot on Thursday said he was held for more than an hour at Dodger Stadium … ",
    "url": "https://www.latimes.com/california/story/2025-06-20/border-patrol-agents-brag-in-front-of-detained"
  },
  {
    "text": "Vance reference to Alex Padilla as ‘Jose’ during LA presser sparks Dem backlash  —  Several California Democrats slammed Vice President Vance after he referred to Sen. Alex Padilla (D-Calif.) as “Jose” during a Friday presser in Los Angeles.  —  “I was hoping Jose Padilla would be here to ask a question … ",
    "url": "https://thehill.com/homenews/administration/5361883-vance-padilla-california-democrats-backlash/"
  },
  {
    "text": "Harvard and Trump Restart Talks to Potentially End Bitter Dispute  —  Details about the discussions emerged after President Trump said the two sides, which have been locked in court battles for weeks, might reach a settlement soon.  —  Harvard University and the Trump administration … ",
    "url": "https://www.nytimes.com/2025/06/20/us/politics/harvard-federal-funding-trump.html?unlocked_article_code=1.Qk8.0K_m.N3CJMIcyCt7J&smid=url-share"
  },
  {
    "text": "Pro-Palestinian activist Mahmoud Khalil released after months in detention  —  The Columbia University activist had been held in immigration agents' custody since March 8.  —  Pro-Palestinian activist and Columbia University graduate Mahmoud Khalil was released from detention Friday evening … ",
    "url": "https://www.nbcnews.com/news/us-news/mahmoud-khalil-ordered-released-federal-judge-rcna214163"
  },
  {
    "text": "June 20, 2025  —  Individuals in plain clothes with their faces covered and without badges or name tags are snatching people off the streets and taking them away.  Todd Lyons, the acting director of Immigration and Customs Enforcement (ICE), which is housed within the Department of Homeland Security … ",
    "url": "https://heathercoxrichardson.substack.com/p/june-20-2025"
  },
  {
    "text": "Social Security stops reporting call wait times and other metrics  —  The changes are the latest sign of the agency's struggle with website crashes, overloaded servers and long lines at field offices amid Trump cutbacks.  —  Social Security has stopped publicly reporting its processing times for benefits … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/20/social-security-wait-times-cuts/"
  },
  {
    "text": "“Neither our media nor our political system is designed to deal with a far right authoritarian party”  —  Mark Copelovitch unpacks his signature phrase.  —  ∙ Paid … “Performative public lying is a hallmark of far right authoritarian parties.”  —  “Neither our media nor … ",
    "url": "https://www.publicnotice.co/p/mark-copelovitch-interview-2025"
  },
  {
    "text": "How Trump Treats Black History Differently Than Other Parts of America's Past  —  Since taking office in January, President Trump has tried to reframe the country's past involving racism and discrimination by de-emphasizing that history or at times denying that it happened.  —  NEWS ANALYSIS",
    "url": "https://www.nytimes.com/2025/06/20/us/politics/trump-black-history-federal-holidays.html"
  },
  {
    "text": "A judge sided with Trump.  Behind the scenes, he was lobbying for a nomination.  —  Ed Artau was already meeting with Senate staff about securing a nomination to the federal bench when he sided with Trump in a case, according to a new Senate disclosure obtained by POLITICO.",
    "url": "https://www.politico.com/news/2025/06/20/ed-artau-trump-judge-nomination-florida-00415408"
  },
  {
    "text": "Kari Lake follows through on Trump order, axes most of Voice of America's staff  —  After three months of legal battles and lobbying, the Voice of America network is officially being reduced to a fraction of its pre-Trump form.  —  Widespread layoffs took place Friday at VOA and its parent agency … ",
    "url": "https://cnn.com/2025/06/20/media/kari-lake-voa-trump-voice-of-america-staff"
  },
  {
    "text": "ICE agents scatter as SD Bishop Pham, other clergy visit immigration court  —  Eight immigration courts line the fourth-floor hallway of the downtown Edward J. Schwartz Federal Building.  On the walls: boot prints of ICE agents.  —  But on World Refugee Day, masked immigration agents … ",
    "url": "https://timesofsandiego.com/life/2025/06/20/ice-agents-scatter-as-sd-bishop-pham-other-clergy-visit-immigration-court/"
  },
  {
    "text": "Abandoned by Trump, a farmer and a migrant search for a better future  —  For this story, John Woodrow Cox interviewed more than 40 farmers across the country.  He and photographer Matt McClain reported from Colorado while Sarah Blaskey talked to more than two dozen employees … ",
    "url": "https://www.washingtonpost.com/investigations/interactive/2025/trump-farmers-grants-freeze-usda-migrants"
  },
  {
    "text": "Stephen Miller's Fingerprints Are on Everything in Trump's Second Term  —  The deputy chief of staff has played an outsize role in immigration—and amassed more power than almost anyone else at the White House  —  Stephen Miller wanted to keep the planes in the air—and that is where they stayed.",
    "url": "https://www.wsj.com/politics/policy/stephen-miller-trump-immigration-c1e0e924?st=vGtF1T&reflink=desktopwebshare_permalink"
  },
  {
    "text": "B-2 Stealth Bombers Depart Whiteman AFB for Andersen AFB, Guam, Amid Iran Conflict  —  Following a large number of tanker positioning movements over the previous few days, aviation enthusiasts have now confirmed the departure of B-2 Spirits from Whiteman AFB en route to Guam.",
    "url": "https://theaviationist.com/2025/06/21/b-2-guam-amid-iran-conflict/"
  },
  {
    "text": "Senate GOP's plan to push food aid costs onto states axed from megabill  —  The cost-share plan was a critical way for Republicans to trim spending to pay for their massive reconciliation package and farm bill programs.  —  Senate Republicans' plan to force states to share the cost … ",
    "url": "https://www.politico.com/news/2025/06/21/senate-republicans-snap-cost-share-plan-axed-megabill-00416367"
  },
  {
    "text": "Pakistan to nominate Donald Trump for Nobel peace prize  —  Islamabad says US president helped resolve India conflict but critic says 'Israel's sugar daddy in Gaza' not candidate for any prize  —  Pakistan has said it will recommend Donald Trump for the Nobel peace prize for his work … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/21/pakistan-trump-nobel-prize-recommendation-india-ceasefire"
  },
  {
    "text": "Foreign Students Help Make America Great  —  Trump has recognized this repeatedly, but some of his policies risk hindering American innovation.  —  Click for Sound  —  The competition for economic supremacy between the U.S. and China is compounded by the view that American trade policy is unbalanced.",
    "url": "https://www.wsj.com/opinion/international-students-help-make-america-great-higher-education-colleges-universities-8ad3ba1a"
  },
  {
    "text": "Ayatollah Ali Khamenei, Planning for His Possible Assassination, Picks Successors  —  Ayatollah Ali Khamenei has not only picked replacements in his chain of military command in case they are killed in Israeli strikes, he has also named three senior clerics to replace him should he, too, be slain.",
    "url": "https://www.nytimes.com/2025/06/21/world/middleeast/iran-ayatollah-israel-war.html"
  },
  {
    "text": "LA Dodgers to donate $1M to help immigrants hit by ICE raids  —  The Los Angeles Dodgers announced it will donate $1 million to assist immigrant families recently affected by U.S. Immigration and Customs Enforcement (ICE) raids in the Los Angeles area.  —  Why it matters: The announcement came … ",
    "url": "https://www.axios.com/2025/06/21/la-dodgers-donate-million-immigrants-ice-raids"
  },
  {
    "text": "Letter to FBI from shooting suspect made wild claims about Klobuchar and Walz, sources say  —  People with direct knowledge of a letter Vance Boelter addressed to the FBI say it is rambling and conspiratorial. … Acting U.S. Attorney Joe Thompson addresses the media regarding the federal charges … ",
    "url": "https://www.startribune.com/vance-boelter-letter-klobuchar-walz-mn-assassination/601376682"
  },
  {
    "text": "Top Pentagon spy pick rejected by White House  —  Army Lt. Gen. Richard Angle's name was put forward to lead the National Security Agency and U.S. Cyber Command.  —  The White House recently nixed the Pentagon's pick to head the country's top spy agency and command its elite hacking force … ",
    "url": "https://www.politico.com/news/2025/06/20/richard-angle-nsa-cyber-command-00415619"
  },
  {
    "text": "Pelosi raked in millions last year — and her portfolio out-performed every large hedge fund with stunning returns  —  She might be the She-Wolf of Wall Street.  —  Rep. Nancy Pelosi (D-California) raked in between $7.8 and $42.5 million in 2024 — meaning her estimated net worth … ",
    "url": "https://nypost.com/2025/06/21/us-news/pelosi-added-millions-to-net-worth-last-year-report/"
  },
  {
    "text": "Trump throws Gabbard under the bus — again  —  For the second time this week, the president dismissed his intelligence director's view on Iran's nuclear program.  —  For the second time this week, President Donald Trump publicly undermined Director of National Intelligence Tulsi Gabbard … ",
    "url": "https://www.politico.com/news/2025/06/20/trump-gabbard-dismiss-iran-assessment-00415805"
  },
  {
    "text": "Trump admin shortens ACA enrollment window  —  The Trump administration on Friday narrowed the period to sign up for Affordable Care Act coverage and imposed other restrictions aimed at rolling back Biden-era flexibilities for the program.  —  Why it matters: The Centers for Medicare … ",
    "url": "https://www.axios.com/2025/06/20/trump-admin-aca-coverage-changes"
  },
  {
    "text": "Ireland shuts last coal plant, becomes 15th coal-free country in Europe  —  Moneypoint in County Clare, Ireland, joins the ranks of other European nations exiting coal by shutting off power generation at its sole remaining coal plant.  Industry observers say Ireland's increased renewable energy generation … ",
    "url": "https://www.pv-magazine.com/2025/06/20/ireland-coal-free-ends-coal-power-generation-moneypoint/"
  }
]