[
  {
    "text": "Former Trump aide Steve Bannon ordered to jail by July 1 to serve contempt of Congress sentence … A federal judge in Washington, D.C., at a hearing Thursday ordered former Trump White House aide Steve Bannon to report to jail by July 1 to begin serving a four-month sentence for his criminal contempt of Congress conviction.",
    "url": "https://www.cnbc.com/2024/06/06/steve-bannon-ordered-to-jail-bail-revoked.html"
  },
  {
    "text": "Judge to consider if ex-Trump adviser Steve Bannon should begin prison sentence  —  Bannon was sentenced to four months in prisfor contempt of Congress.  —  Steve Bannon, former adviser to Donald Trump, during the Conservative Political Action Conference (CPAC) in National Harbor, Md., Feb. 24, 2024.",
    "url": "https://abcnews.go.com/US/judge-trump-adviser-steve-bannon-begin-prison-sentence/story?id=110890486"
  },
  {
    "text": "Exclusive: Biden tells Muir he wouldn't pardon son Hunter, says Trump got ‘fair trial’  —  Biden is in Normandy commemorating the 80th anniversary of D-Day.  —  ABC News' David Muir sat down exclusively with President Joe Biden in Normandy, France, on the 80th anniversary of D-Day on June 6, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-tells-muir-wouldnt-pardon-son-hunter/story?id=110904482"
  },
  {
    "text": "Biden says he wouldn't pardon son in felony gun case in Delaware  —  The White House press secretary has said previously the president would not pardon his son, Hunter Biden.  —  President Biden said Thursday he would not pardon his son, Hunter Biden, if he is convicted in his felony gun trial in Delaware.",
    "url": "https://www.washingtonpost.com/politics/2024/06/06/joe-biden-hunter-not-pardon/"
  },
  {
    "text": "Going Retrograde  —  Today was an important day to be paying attention.  In many ways, we seem to be going backward.  Only our votes can ultimately change that.  —  Senate Republicans blocked a measure that would have created a federal right to contraception access today.",
    "url": "https://joycevance.substack.com/p/going-retrograde"
  },
  {
    "text": "Several Pa. House Republicans boo officers who defended Capitol on Jan. 6  —  Harry Dunn and Aquilino Gonell were invited to Pennsylvania's House of Representatives — but several GOP lawmakers booed and some walked out, Democratic lawmakers said.  —  Two former law enforcement officers … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/06/pennsylvania-house-republicans-capitol-walkout/"
  },
  {
    "text": "The Billionaires Have Captured Donald Trump  —  One of the most enduring—and ridiculous—#Resistance narratives of the Trump era was the idea that the president of the United States was a literal Manchurian Candidate, a man who had been compromised for years (perhaps even decades) by a foreign power, namely Russia.",
    "url": "https://newrepublic.com/article/182300/donald-trump-compromised-billionaires-selling-presidency"
  },
  {
    "text": "Trump: Critics saying he'd seek retribution are ‘wrong,’ but ‘I would have every right’ to go after opponents  —  Former President Trump told Fox News on Wednesday that critics claiming he'd seek retribution against political opponents are “wrong,” but he would have “every right” … ",
    "url": "https://www.foxnews.com/media/trump-addresses-concerns-he-would-seek-retribution-i-would-have-every-right-go-after-them"
  },
  {
    "text": "Clash Over Phone Hacking Article Preceded Exit of Washington Post Editor  —  Will Lewis, the chief executive of The Washington Post, objected to coverage of a legal development involving him in a phone hacking case.  —  Weeks before the embattled executive editor of The Washington Post abruptly resigned … ",
    "url": "https://www.nytimes.com/2024/06/05/business/media/washington-post-buzbee-lewis.html"
  },
  {
    "text": "Biden's D-Day Speech Nailed the Threat of Modern Fascism  —  80 YEARS ON  —  Speaking on sacred ground in Normandy, the president correctly drew parallels between America's enemies in World War II and the threats we face domestically and globally today.",
    "url": "https://www.thedailybeast.com/bidens-d-day-speech-nailed-the-threat-of-modern-fascism"
  },
  {
    "text": "Judge Noreika Risks Narrowing Hunter Biden's Right to Confront His Accuser Even Further  —  Gordon Cleveland, the man who sold Hunter Biden a gun without seeing an ID with an address on it on October 12, 2018, did not finish testifying at the Hunter Biden trial yesterday.",
    "url": "https://www.emptywheel.net/2024/06/06/judge-noreika-risks-narrowing-hunter-bidens-right-to-confront-his-accuser-even-further/"
  },
  {
    "text": "The Myth That Biden Had Nothing to Do with the Prosecutions of Trump … The five criminal and civil prosecutions of Donald Trump all prompt heated denials from Democrats that President Biden and Democrat operatives had a role in any of them.  —  But Joe Biden has long let it be known … ",
    "url": "https://amgreatness.com/2024/06/06/the-myth-that-biden-had-nothing-to-do-with-the-prosecutions-of-trump/"
  },
  {
    "text": "YouTuber's Wacko Lamborghini Stunt Ends in Federal Charges  —  FROM CLICKS TO CLINK  —  He took aim at a $300,000 Italian supercar from a helicopter with an arsenal of fireworks onboard.  —  What's more American than celebrating July 4 by taking aim at a $300,000 Italian supercar … ",
    "url": "https://www.thedailybeast.com/youtuber-alex-chois-wacko-lamborghini-stunt-ends-in-federal-charges"
  },
  {
    "text": "'It's Really Shameful': House Republicans Accuse Rep. Troy Nehls of Stolen Valor Over Military Award Pin … House Republicans are accusing Rep. Troy Nehls of “stolen valor” for continuing to wear a lapel pin for infantrymen or Special Forces who fought in active combat.  —  “It matters.",
    "url": "https://www.notus.org/congress/troy-nehls-combat-infantry-badge-pin-revoked"
  },
  {
    "text": "Exclusive: Cows infected with bird flu have died in five US states  —  Dairy cows infected with avian flu in five U.S. states have died or been slaughtered by farmers because they did not recover, state officials and academics told Reuters.  —  Reports of the deaths suggest the bird flu outbreak … ",
    "url": "https://www.reuters.com/world/us/cows-infected-with-bird-flu-have-died-five-us-states-2024-06-06/"
  },
  {
    "text": "Progressive Caucus rescinds endorsement of former Rep. Mondaire Jones  —  The Congressional Progressive Caucus PAC unendorsed one of its former members after the New York Democrat backed a primary rival to another progressive lawmaker.  —  WASHINGTON — The Congressional Progressive Caucus PAC … ",
    "url": "https://www.nbcnews.com/politics/2024-election/progressive-caucus-rescinds-endorsement-former-rep-mondaire-jones-rcna155754?taid=6661dd57acd5750001e05bec"
  },
  {
    "text": "Words like moderate and centrist are political weasel words with no set definitions  —  In 2021, billionaire tech executive Chamath Palahapitiya briefly considered running for California governor on a moderate-sounding platform of low taxes and school reform.",
    "url": "https://www.sfchronicle.com/opinion/openforum/article/donald-trump-san-francisco-19495231.php"
  },
  {
    "text": "June 2024 National Poll: Trump 46%, Biden 45%  —  Home Polls June 2024 National Poll: Trump 46%, Biden 45%  —  Plurality of voters think Trump should be sentenced to prison.  —  A new Emerson College Polling national survey of U.S. voters finds 46% of voters support former President Donald Trump … ",
    "url": "https://emersoncollegepolling.com/june-2024-national-poll-trump-46-biden-45/"
  }
]