[
  {
    "text": "The Courts Blocked Trump's Federal Funding Freeze.  Agencies Are Withholding Money Anyway.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  When the federal courts first blocked … ",
    "url": "https://www.propublica.org/article/trump-administration-funding-freeze-workarounds"
  },
  {
    "text": "The federal judge in Rhode Island said the Trump administration had failed to comply with his order unfreezing billions of dollars in federal grants.  —  A federal judge on Monday said the White House has defied his order to release billions of dollars in federal grants … ",
    "url": "https://www.nytimes.com/2025/02/10/us/trump-unfreezing-federal-grants-judge-ruling.html?unlocked_article_code=1.v04.xIcU.OwbtX7agS7FL&smid=url-share"
  },
  {
    "text": "Donald Trump Declines to Endorse JD Vance as 2028 Republican ‘Successor’  —  said in a preview of his Super Bowl interview on Monday that it's “too early” to endorse Vice President  —  successor.  —  When  —  's Bret Baier asked if he views Vance as his “successor” and the Republican nominee in 2028 … ",
    "url": "https://www.newsweek.com/donald-trump-declines-endorse-jd-vance-2028-successor-2029106"
  },
  {
    "text": "Justice officials tell prosecutors to drop charges against N.Y. Mayor Eric Adams  —  A top Justice official said New York Mayor Eric Adams should not have to face trial given his reelection campaign and the fight against crime and illegal immigration.  —  NEW YORK — The Justice Department … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/10/new-york-mayor-eric-adams-charges-drop-justice/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5MTYzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwNTQ1OTk5LCJpYXQiOjE3MzkxNjM2MDAsImp0aSI6ImRiOWM0MTQzLThmNTEtNDc1MS1iYjQ4LWExZTExZjE1MWY2MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzEwL25ldy15b3JrLW1heW9yLWVyaWMtYWRhbXMtY2hhcmdlcy1kcm9wLWp1c3RpY2UvIn0.p61-pFMCc_DX6FHdZVTMWKeNScpO1EC8ghdzkgWDCFw&itid=gfta"
  },
  {
    "text": "Justice Dept. Seeks Dismissal of Federal Corruption Case Against Adams  —  The New York City mayor cultivated a close relationship with President Trump, who said they had both been persecuted.  —  The Justice Department on Monday told federal prosecutors in Manhattan to drop the corruption charges … ",
    "url": "https://www.nytimes.com/2025/02/10/nyregion/eric-adams-charges-doj-trump.html?unlocked_article_code=1.v04.xV7N.XsN0iYwQoAJQ"
  },
  {
    "text": "1 dead, 4 hospitalized after two planes crash on runway at Scottsdale Airport  —  The incident happened around 2:30 p.m. Monday  —  SCOTTSDALE, AZ — Officials confirm at least one person has died after an aircraft crash on the runway Monday at the Scottsdale Airport.",
    "url": "https://www.abc15.com/news/region-northeast-valley/scottsdale/scottsdale-airport-runway-closed-after-plane-crash-injuries-unclear"
  },
  {
    "text": "Trump signs order pausing enforcement of foreign bribery ban … WATCH NOW  —  President Donald Trump on Monday signed an executive order directing the Department of Justice to pause enforcing a nearly half-century-old law that prohibits American companies and foreign firms from bribing officials … ",
    "url": "https://www.cnbc.com/2025/02/10/trump-doj-foreign-corrupt-practices-act-pause.html"
  },
  {
    "text": "Trump says he may withhold aid to Jordan, Egypt if they don't take in Palestinians  —  President Trump said Monday he would consider withholding aid to Jordan and Egypt if they do not agree to take in Palestinians as part of a plan for the U.S. to take over and develop the Gaza Strip.",
    "url": "https://thehill.com/homenews/administration/5137309-trump-jordan-egypt-aid/"
  },
  {
    "text": "Scoop: Trump planning to pardon Rod Blagojevich … - Blagojevich, who was a Democrat while in office, supported Trump in the 2024 election and attended the Republican National Convention.  — The former governor defended Trump after Trump was indicted in the New York hush money case and likened Trump's legal problems to his own.",
    "url": "https://www.axios.com/2025/02/10/trump-pardon-rod-blagojevich"
  },
  {
    "text": "Military Drops Recruiting Efforts at Prestigious Black Engineering Awards Event  —  The Army and other service branches are abandoning recruiting efforts at a prestigious Black engineering event this week, turning down access to a key pool of highly qualified potential applicants amid President … ",
    "url": "https://www.military.com/daily-news/2025/02/10/military-drops-recruiting-efforts-prestigious-black-engineering-awards-event.html"
  },
  {
    "text": "Exclusive |  Elon Musk-Led Group Makes $97.4 Billion Bid for Control of OpenAI  —  The unsolicited offer complicates Sam Altman's plans to convert OpenAI to a for-profit company.",
    "url": "https://www.wsj.com/tech/elon-musk-openai-bid-4af12827?st=j5pQRs&reflink=article_copyURL_share"
  },
  {
    "text": "Trump ousts director of Office of Government Ethics  —  Washington — President Trump on Monday removed the director of the Office of Government Ethics, the independent agency responsible for overseeing ethics rules and financial disclosures for the executive branch.",
    "url": "https://www.cbsnews.com/news/trump-office-of-government-ethics-director/"
  },
  {
    "text": "19-year-old Musk surrogate has State Department email address  —  The move illustrates that Elon Musk's U.S. DOGE Service aides are being asked to fulfill multiple roles at once.",
    "url": "https://www.washingtonpost.com/business/2025/02/10/musk-doge-state-department-surrogate/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5MTYzNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwNTQ1OTk5LCJpYXQiOjE3MzkxNjM2MDAsImp0aSI6IjRiNjg2NDU1LTI5MWUtNGJhNS1hMTEyLTgwYjU0MmQzMWYxYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzEwL211c2stZG9nZS1zdGF0ZS1kZXBhcnRtZW50LXN1cnJvZ2F0ZS8ifQ.WQGnPJJFbq3W4fuvq3tZXdbERXUkuXikg8hmmMMI7Ss&itid=gfta"
  },
  {
    "text": "Trump announces fresh round of tariffs on steel and aluminum  —  Additional trade measures are expected as soon as tomorrow  —  President Donald Trump signed executive orders on Monday imposing 25-percent tariffs on imported steel and aluminum, the latest salvo in his ongoing effort to overhaul … ",
    "url": "https://www.washingtonpost.com/business/2025/02/10/trump-tariffs-steel/"
  },
  {
    "text": "Trump Names Loyalist Interim Leader of Kennedy Center as He Strengthens His Grip  —  The president also purged 18 board members appointed by former President Joseph R. Biden Jr., who were scrubbed from an official roster on the center's website, along with the chairman, David M. Rubenstein.",
    "url": "https://www.nytimes.com/2025/02/10/arts/music/trump-kennedy-center-board-removed.html?unlocked_article_code=1.wE4.2rq6.M7mtq-Eky3p2&smid=url-share"
  },
  {
    "text": "Scoop: FBI finds secret JFK assassination records after Trump order … - The existence of the new documents was disclosed Friday to the White House, when the Office of the Director of National Intelligence submitted its plan to disclose the assassination records under Trump's order.",
    "url": "https://www.axios.com/2025/02/10/trump-jfk-assassination-records"
  },
  {
    "text": "The GOP Says They Love Elon.  Privately, They're Expressing Concerns.  —  REPUBLICANS IN CONGRESS HAVE WIDELY praised Elon Musk as he's gone about restructuring and in certain cases eliminating entire parts of the government.  —  But in private, they've expressed quite a different perspective … ",
    "url": "https://www.thebulwark.com/p/the-gop-says-they-love-elon-privately"
  },
  {
    "text": "Tesla Is Elon Musk's Soft Underbelly  —  Tesla's brand is toxic and its sales are in the toilet.  That's how you hurt Musk.  —  ∙ Paid  —  1. Consequences  —  Tesla sales have fallen off a cliff.  —  This fact is satisfying on moral, spiritual, and psychosexual levels.",
    "url": "https://www.thebulwark.com/p/tesla-is-elon-musks-soft-underbelly"
  },
  {
    "text": "Judge extends freeze on Trump's unprecedented plan to get millions of federal workers to resign  —  U.S. District Judge George A. O'Toole Jr. said the pause would continue until he ruled on the legality of Trump's “deferred resignation” plan.  —  A federal judge in Boston on Monday continued … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-extends-freeze-trumps-unprecedented-plan-get-millions-federal-wo-rcna191542"
  },
  {
    "text": "Secretary of Defense Pete Hegseth Renames Fort Liberty to Fort Roland L. Bragg  —  While flying aboard a C-17 from Joint Base Andrews to Stuttgart on February 10, 2025, Secretary of Defense Pete Hegseth signed a memorandum renaming Fort Liberty in North Carolina to Fort Roland L. Bragg.",
    "url": "https://www.defense.gov/News/Releases/Release/Article/4062245/secretary-of-defense-pete-hegseth-renames-fort-liberty-to-fort-roland-l-bragg/"
  },
  {
    "text": "Supreme Court lawyer Tom Goldstein jailed as flight risk after cryptocurrency hiding claim … A federal judge on Monday ordered leading Supreme Court lawyer Tom Goldstein held in jail without bail after prosecutors warned that the high-stakes poker player is a “serious” flight risk from his criminal tax evasion case.",
    "url": "https://www.cnbc.com/2025/02/10/supreme-court-lawyer-tom-goldstein-rearrested-as-serious-flight-risk-after-hiding-cryptocurrency-prosecutors-say.html"
  },
  {
    "text": "Microsoft Study Finds AI Makes Human Cognition “Atrophied and Unprepared”  —  Researchers find that the more people use AI at their job, the less critical thinking they use.  —  A new paper from researchers at Microsoft and Carnegie Mellon University finds that as humans increasingly rely … ",
    "url": "https://www.404media.co/microsoft-study-finds-ai-makes-human-cognition-atrophied-and-unprepared-3/"
  },
  {
    "text": "Mace Takes to House Floor With Charges of Rape and Sexual Predation  —  The South Carolina Republican used her floor privileges to lodge shocking accusations against her former fiancé and three other men.  —  Representative Nancy Mace, the South Carolina Republican who in recent weeks … ",
    "url": "https://www.nytimes.com/2025/02/10/us/politics/nancy-mace-rape-accusation.html"
  }
]