[
  {
    "text": "Trump Has for Months Privately Discussed Firing Fed Chair Powell  —  The president hasn't made a decision on whether to try to oust Powell, and some of his advisers have warned against the move  —  WASHINGTON—President Trump has for months privately discussed firing Federal Reserve Chair Jerome Powell … ",
    "url": "https://www.wsj.com/economy/central-banking/trump-has-for-months-privately-discussed-firing-fed-chair-powell-628d3d79?st=xhpbir&reflink=article_copyURL_share"
  },
  {
    "text": "Bessent privately urges caution as Trump attacks Powell  —  Any attempt to remove the Fed chair — a legally questionable option Trump considered in his first term — would feed instability in markets already woozy from the recent tariff whiplash.  —  Treasury Secretary Scott Bessent … ",
    "url": "https://www.politico.com/news/2025/04/17/trump-powell-fired-fed-00295552"
  },
  {
    "text": "Trump says Powell's “termination can't come fast enough”  —  President Trump blasted Federal Reserve chair Jerome Powell on Thursday with the strongest suggestion yet of intentions to try to fire the nation's most powerful economic policymaker.  —  Why it matters: Trump's attack comes … ",
    "url": "https://www.axios.com/2025/04/17/trump-powell-fed-reserve-tariffs-inflation"
  },
  {
    "text": "Trump Threatens to Block International Students Unless Harvard Shares Student Data  —  The demand from the Department of Homeland Security is an escalation in President Trump's fight against Harvard, the country's oldest and richest university.  —  The Trump administration has threatened … ",
    "url": "https://www.nytimes.com/2025/04/17/us/politics/trump-harvard-international-students.html"
  },
  {
    "text": "Live Updates: Active shooter reported at Florida State University; multiple patients hospitalized  —  The university sent out an alert urging students to seek shelter as a shooter was reported in the area of the student union. … FSU was site of shooting in 2014",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/florida-state-university-active-shooter-rcna201756"
  },
  {
    "text": "At least 4 injured in shooting at Florida State University, suspect in custody: Sources  —  Police are responding to the scene, which is near the Student Union.  —  LIVE  —  People comfort each other on Florida State University's campus in Tallahassee, Fla., where law enforcement responded … ",
    "url": "https://abcnews.go.com/US/active-shooter-reported-florida-state-university-fsu-alert/story?id=120911309"
  },
  {
    "text": "GOP photos at El Salvador prison evoke Abu Ghraib—and worse  —  Members of Congress visited CECOT for some torture tourism—and to prove loyalty to Trump. … A row of Latino men with shaved heads and stoic expressions wearing identical white boxer shorts stand behind thick metal bars.",
    "url": "https://www.thehandbasket.co/p/selfies-cecot-el-salvador-abu-ghraib"
  },
  {
    "text": "Supreme Court to hear oral arguments on whether Trump can implement birthright citizenship plan  —  The Trump administration wants to end automatic birthright citizenship as enshrined in the Constitution's 14th Amendment.  —  WASHINGTON — The Supreme Court on Thursday said it will hear … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-hear-oral-arguments-whether-trump-can-implement-birthrig-rcna199498"
  },
  {
    "text": "The Most Damning Aspect of the Supreme Court's Latest Trump Dodge  —  The story of Kilmar Abrego Garcia—the Maryland father wrongly deported to a Salvadoran prison—has captivated the nation and spurred Democratic lawmakers into action, with Maryland Sen. Chris Van Hollen flying to El Salvador on Wednesday to try to get him freed.",
    "url": "https://slate.com/news-and-politics/2025/04/abrego-garcia-supreme-court-trump-biden.html"
  },
  {
    "text": "‘We are all afraid’: Speaking to Alaska nonprofit leaders, Murkowski gets candid on upheaval in federal government  —  U.S. Sen. Lisa Murkowski told a room full of Alaska nonprofit leaders that the tumult of tariffs, executive orders, court battles, and cuts to federal services under … ",
    "url": "https://www.adn.com/politics/2025/04/14/we-are-all-afraid-speaking-to-alaska-nonprofit-leaders-murkowski-gets-candid-on-upheaval-in-federal-government/"
  },
  {
    "text": "As Garber Stands Against Trump, Money From Harvard Donors Pours In  —  After Harvard publicly rejected the Trump administration's demands, a wave of support — and money — has come rushing in.  —  In the 24 hours after Harvard President Alan M. Garber '76 announced that he would not comply … ",
    "url": "https://www.thecrimson.com/article/2025/4/18/garber-trump-harvard-donors/"
  },
  {
    "text": "Europe's ‘Trump whisperer’ arrives  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Good Thursday morning.  This is Jack Blanchard, genuinely excited to hear (via the NYT and others) that we've found possible signs of life on a distant planet.",
    "url": "https://www.politico.com/newsletters/playbook/2025/04/17/europes-trump-whisperer-arrives-00295414"
  },
  {
    "text": "Leaked: Palantir's Plan to Help ICE Deport People  —  Palantir, the surveillance giant, is taking on an increased role with Immigration and Customs Enforcement (ICE), including finding the physical location of people who are marked for deportation, according to Palantir Slacks and other internal messages obtained by 404 Media.",
    "url": "https://www.404media.co/leaked-palantirs-plan-to-help-ice-deport-people/"
  },
  {
    "text": "Trump Team Eyes Politically Connected Startup to Overhaul $700 Billion Government Payments Program  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Four days before Donald Trump's inauguration … ",
    "url": "https://www.propublica.org/article/trump-peter-thiel-ramp-gsa-smartpay-expense-payment-system"
  },
  {
    "text": "Exclusive: Musk's SpaceX is frontrunner to build Trump's Golden Dome missile shield  —  Elon Musk's SpaceX and two partners have emerged as frontrunners to win a crucial part of President Donald Trump's “Golden Dome” missile defense shield, six people familiar with the matter said.",
    "url": "https://www.reuters.com/business/aerospace-defense/musks-spacex-is-frontrunner-build-trumps-golden-dome-missile-shield-2025-04-17/"
  },
  {
    "text": "American doctor receives email from immigration officials telling her to leave the country immediately  —  Dr. Lisa Anderson, 58, was born in Pennsylvania and is a U.S. citizen.  —  A doctor born in the United States says she received an email from federal immigration authorities demanding that she leave the country immediately.",
    "url": "https://www.nbcnews.com/news/us-news/doctor-email-immigration-leave-country-rcna201698?taid=6801097d07fad10001c18175"
  },
  {
    "text": "Trump appointee asked IRS to review audit of MyPillow CEO Mike Lindell  —  Experts say the outreach on behalf of Lindell, a Trump political ally, is highly unusual and represents a change in how political appointees engage with the IRS.",
    "url": "https://www.washingtonpost.com/business/2025/04/17/lindell-irs-audit/"
  },
  {
    "text": "Boasberg Finds Probable Cause to Hold Trump Officials in Contempt Over Deportation Flights  —  The move was a remarkable attempt by a jurist to hold the White House accountable for its apparent willingness to flout court orders.  —  A federal judge in Washington threatened on Wednesday … ",
    "url": "https://www.nytimes.com/2025/04/16/us/politics/trump-probable-cause-contempt-deportation-flights.html"
  },
  {
    "text": "Former FAA contractor pleads guilty to sharing US airport files with Iran  —  A former Federal Aviation Administration (FAA) contractor pleaded guilty Wednesday to working as an agent of Iran and sharing sensitive U.S. airport data with Iranian intelligence officers.",
    "url": "https://thehill.com/regulation/court-battles/5253738-former-faa-contracter-guilty-agent-of-iran/"
  },
  {
    "text": "BYU Ph.D. student's international student visa revoked over apparent fishing license violation  —  A Brigham Young University Ph.D. candidate from Japan has had his international student visa revoked — perhaps because of a fishing violation from years ago.  —  Outside of a couple … ",
    "url": "https://www.deseret.com/utah/2025/04/16/byu-grad-student-has-student-visa-revoked/"
  },
  {
    "text": "Van Hollen stopped at military checkpoint on way to Salvadoran prison  —  TECOLUCA, El Salvador - Sen. Chris Van Hollen was stopped by armed guards Thursday at a military checkpoint and turned away less than two miles from the notorious prison where a Maryland father who was wrongly deported from the U.S. is being held.",
    "url": "https://www.usatoday.com/story/news/politics/2025/04/17/abrego-garcia-el-salvador-deportation-van-hollen/83138586007/"
  },
  {
    "text": "Trump's pick to be DC's top prosecutor failed to report nearly 200 appearances on far-right media outlets to Senate  —  Ed Martin, the Trump administration's nominee to serve as US attorney for Washington, DC, failed to report hundreds of media appearances he's made in the past few years … ",
    "url": "https://cnn.com/2025/04/17/politics/ed-martin-failed-to-report-media-appearances-senate/"
  },
  {
    "text": "Anxious Trading Partners Promise to Buy American to Stave Off Trump's Tariffs  —  Countries offer to buy more U.S. energy, defense and agricultural products, but not everyone is splurging  —  In the two weeks since President Trump's “Liberation Day,” many U.S. trade partners have a clear plan … ",
    "url": "https://www.wsj.com/economy/trade/anxious-trading-partners-promise-to-buy-american-to-stave-off-trumps-tariffs-784ed405?st=hAfSkc&reflink=article_copyURL_share"
  },
  {
    "text": "A Loophole That Would Swallow the Constitution  —  Donald Trump's most frightening power grab was undertaken with an undertone of sinister jocularity.  There was no column of tanks in the streets, no burning of the legislature.  The president and his partner in despotism … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/trump-constitution-abrego-garcia/682487/"
  },
  {
    "text": "Supreme Court will review Trump's attempt to ban birthright citizenship  —  President Donald Trump's birthright citizenship ban would deny automatic citizenship for newborns if neither parent is a U.S. citizen or legal permanent resident.",
    "url": "https://www.washingtonpost.com/politics/2025/04/17/supreme-court-trump-birthright-citizenship-ban/"
  },
  {
    "text": "White House Eyes Overhaul of Federal Housing Aid to the Poor  —  The Trump administration has considered sharply curtailing vouchers as part of its budget for the 2026 fiscal year.  —  The White House is considering deep cuts to federal housing programs, including a sweeping overhaul of aid … ",
    "url": "https://www.nytimes.com/2025/04/17/us/politics/housing-aid-hud-federal-budget.html"
  }
]