[
  {
    "text": "Trump and EU Reach Tariff Deal, Avoiding Trade War  —  Pact imposes baseline tariff of 15% on the U.S.'s biggest trading partner  —  President Trump said he reached a trade agreement on Sunday with the European Union, avoiding a damaging trade war with the U.S.'s largest trading partner … ",
    "url": "https://www.wsj.com/economy/trade/trump-says-he-has-a-tariff-deal-with-european-union-avoiding-trade-war-3ca72c5d?st=iJpyhN&reflink=article_copyURL_share"
  },
  {
    "text": "Trump sets EU tariff at 15%, lower than his original threat, after meeting in Scotland  —  TURNBERRY and ABERDEEN, Scotland — President Trump said he struck a trade deal with the European Union on Sunday after talks with the president of the European Commission, Ursula von der Leyen, at his golf course on Scotland's western coast.",
    "url": "https://www.npr.org/2025/07/27/nx-s1-5481246/trump-tariffs-european-union"
  },
  {
    "text": "How the EU dashed to Trump's Scottish hideaway — and got the deal it craved  —  TURNBERRY, Scotland — There was something deeply ironic in the EU's top brass having to fly to Britain to seal the bloc's biggest deal since Brexit — but that's what Donald Trump wanted and that's what Donald Trump got.",
    "url": "https://www.politico.eu/article/us-and-eu-strike-trade-deal/"
  },
  {
    "text": "Trump's Tariffs Are Already Stunting World Growth While Markets Shrug  —  With the president's new trade deals, US protectionism is slowing investment and rewiring supply chains at the expense of the global economy  —  As Donald Trump barrels toward his latest tariff deadline … ",
    "url": "https://www.bloomberg.com/news/features/2025-07-27/how-trump-s-tariffs-are-already-stunting-world-economic-growth"
  },
  {
    "text": "Von der Leyen and Trump strike EU-US trade deal with 15% tariff for the bloc  —  The trade deal will introduce a 15% tariff for the vast majority of EU products.  But some will benefit from a “zero-for-zero” scheme.  —  The European Union and the United States have struck a tentative trade deal … ",
    "url": "https://www.euronews.com/my-europe/2025/07/27/von-der-leyen-and-trump-strike-eu-us-trade-deal-to-avert-all-out-tariff-war"
  },
  {
    "text": "What Will It Cost to Renovate the ‘Free’ Air Force One?  Don't Ask.  —  To hide the cost of renovating the plane Qatar donated to President Trump, the Air Force appears to have tucked it inside an over-budget, behind-schedule nuclear modernization program.  —  President Trump makes no secret … ",
    "url": "https://www.nytimes.com/2025/07/27/us/politics/air-force-one-trump-cost.html?unlocked_article_code=1.Zk8.1kZ2.llxYF3gaD7eI&smid=url-share"
  },
  {
    "text": "Speaker Johnson says all ‘credible’ Epstein files should be released: Full interview  —  In an exclusive interview with Meet the Press, House Speaker Mike Johnson (R-La.) calls the bipartisan push to force a House vote on releasing the Epstein files “reckless,” adding that it does not do enough to protect victims.",
    "url": "https://www.nbcnews.com/meet-the-press/video/speaker-johnson-says-all-credible-epstein-files-should-be-released-full-interview-243905605708"
  },
  {
    "text": "Leno Calls for Late Night to Drop Partisan Politics: ‘Why Shoot for Just Half an Audience?’  —  PLAY NICE  —  Jay Leno thinks his former fellow late-night show hosts are alienating audiences with their barbs and jabs against the Trump administration.  “I love political humor, don't get me wrong … ",
    "url": "https://www.thedailybeast.com/jay-leno-calls-for-late-night-shows-to-drop-partisan-politics-why-shoot-for-just-half-an-audience/"
  },
  {
    "text": "Senate Democrats urge U.S. to stop funding GHF, resume support for U.N. food distribution in Gaza as more starve  —  A group of Democratic senators led by Democratic Sen. Chris Van Hollen of Maryland is urging the Trump administration to suspend American financial support … ",
    "url": "https://www.cbsnews.com/news/gaza-starvation-senate-democrats-urge-u-s-to-stop-funding-ghf-resume-support-for-un/"
  },
  {
    "text": "Tom Lehrer, Musical Satirist With a Dark Streak, Dies at 97  —  A mathematician by training, he acquired a devoted following with songs that set sardonic lyrics to music that was often maddeningly cheerful.  —  Tom Lehrer, the Harvard-trained mathematician whose wickedly iconoclastic songs … ",
    "url": "https://www.nytimes.com/2025/07/27/arts/music/tom-lehrer-dead.html?unlocked_article_code=1.Zk8.j4kp.ADZ8OeduFlbp&smid=url-share"
  },
  {
    "text": "Colorado lawmaker says Gabbard has become ‘weapon’ for Trump … “There have been four investigations including a bipartisan Senate investigation led under the first Trump administration in part by Marco Rubio that is very clear on these findings,” he said, referencing Trump's secretary of state.",
    "url": "https://www.politico.com/news/2025/07/27/crow-gabbard-weapon-of-mass-destruction-00479152"
  },
  {
    "text": "Sen. Graham says there will be a ‘change in strategy’ in Gaza ‘to destroy Hamas’  —  In an exclusive interview with Meet the Press, Sen. Lindsey Graham (R-S.C.) shares what he's hearing from the White House and Israeli officials about the next stage of the war, saying “there will be a full military effort … ",
    "url": "https://www.nbcnews.com/meet-the-press/video/sen-graham-says-there-will-be-a-change-in-strategy-in-gaza-to-destroy-hamas-243905605826"
  },
  {
    "text": "Full transcript of “Face the Nation with Margaret Brennan,” July 27, 2025  —  On this “Face the Nation with Margaret Brennan” broadcast, moderated by Margaret Brennan:  — Office of Managment and Budget Director Russell Vought  — Sen. Chris Van Hollen, Democrat of Maryland",
    "url": "https://www.cbsnews.com/news/face-the-nation-full-episode-transcript-07-27-2025/"
  },
  {
    "text": "The Ripple Effects of an ICE Raid on a Nebraska Meatpacking Company … They gathered in a conference room for the weekly management meeting, even though there was hardly anyone left to manage.  Chad Hartmann, the president of Glenn Valley Foods in Omaha, pushed a few empty chairs to the side … ",
    "url": "https://www.nytimes.com/2025/07/27/us/ice-glenn-valley-foods.html?unlocked_article_code=1.Zk8.OObR.AY8qhcrmmP1I&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Software group Auterion to ship 33,000 AI drone ‘strike kits’ to Ukraine  —  Pentagon-backed deal aims to help combat mass attacks by Russia  —  Sylvia Pfeifer in London, Laura Pitel in Berlin and Christopher Miller in Kyiv  —  US-German software company Auterion will send tens of thousands … ",
    "url": "https://www.ft.com/content/fe708758-619e-47a8-ae7a-18adcede267a"
  },
  {
    "text": "Top MAGA Rep's 20-Year-Old Son Cited for Alleged Child Abuse  —  BUSTED  —  It's not the first time the controversial Colorado Congresswoman's eldest has had a run-in with the law.  —  MAGA Rep. Lauren Boebert's son has been slapped with misdemeanor child abuse charges—the latest in a series of encounters with law enforcement.",
    "url": "https://www.thedailybeast.com/top-maga-representative-lauren-boeberts-son-cited-for-misdemeanor-child-abuse-in-colorado/"
  },
  {
    "text": "California Democrats debate what a Harris governor run could mean for them  —  Rep. Dave Min was chatting with reporters at the US Capitol when the California Democrat was asked about whether he wants Kamala Harris to run for governor.  —  Suddenly, Min no longer had time to talk.",
    "url": "https://cnn.com/2025/07/27/politics/kamala-harris-governor-california-democrats-debate"
  },
  {
    "text": "Another whistleblower claims that top DOJ official suggested department could ignore court orders  —  Another whistleblower has made claims to the Justice Department's watchdog that Emil Bove — a top agency official who is now nominated for a judgeship — suggested others in the department … ",
    "url": "https://cnn.com/2025/07/27/politics/justice-department-official-second-whistleblower"
  },
  {
    "text": "‘A nightmare that no one wants’: GOP fears Mastriano's down-ballot drag in Pennsylvania … A person close to Trump's political operation — one of the four aforementioned Republicans — described the president's team as “very concerned” that a Mastriano campaign “could jeopardize or add … ",
    "url": "https://www.politico.com/news/2025/07/27/republicans-mastriano-down-ballot-fears-pennsylvania-00478155"
  },
  {
    "text": "GOP Sen. Refuses to Admit Bush, Not Obama, Was President During Epstein's Plea Deal  —  The senator takes the “blame Obama” game to new heights  —  Sen. Markwayne Mullin tried to blame former President Barack Obama for Jeffrey Epstein's 2008 plea deal, despite Obama not being president at the time.",
    "url": "https://www.rollingstone.com/politics/politics-news/markwayne-mullin-bush-obama-epstein-plea-deal-1235394775/"
  },
  {
    "text": "Ohio State president says he feels ‘no pressure’ after White House complaints … Carter's comments come shortly after the Trump administration announced the school — of which Vice President JD Vance is an alum — is one of 60 universities it has deemed may have antisemitic practices and policies on campus.",
    "url": "https://www.politico.com/news/2025/07/27/ohio-state-president-white-house-antisemitic-00479526"
  }
]