[
  {
    "text": "Fear and loathing grips the House GOP  —  While Republicans appear to be turning next to Jim Jordan, some are already airing open doubts that he can pull off what the majority leader couldn't.  —  The House GOP has entered an angrier and more bewildered phase in its leadership crisis.",
    "url": "https://www.politico.com/news/2023/10/13/republicans-speaker-mccarthy-jim-jordan-00121370"
  },
  {
    "text": "House GOP in total chaos: So much for fascist order and discipline!  —  Aren't far-right movements supposed to make the trains run on time?  GOP can't elect a speaker from its own tribe  —  Nearly eight decades after the end of World War II, the thing we ought to understand most clearly … ",
    "url": "https://www.salon.com/2023/10/13/in-total-chaos-so-much-for-fascist-order-and-discipline/"
  },
  {
    "text": "Jim Jordan Revives Bid for US House Speaker After Scalise Withdraws  —  Representative Jim Jordan of Ohio will again run to be US House speaker now that his fellow Republican Steve Scalise has withdrawn from the contest, his office confirmed Friday.  —  Jordan, the chairman … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-13/jordan-revives-bid-for-house-speaker-after-scalise-withdraws"
  },
  {
    "text": "Live updates House speakership stalled as Scalise withdraws from race  —  Rep. Steve Scalise (R-La.) announced at a Republican conference meeting Thursday night that he is pulling out of the race to become speaker.  The announcement came after a day full of lengthy meetings with fellow Republicans … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/12/house-speaker-vote/"
  },
  {
    "text": "Playbook: The House GOP sinks deeper into chaos  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  OVERNIGHT — AP: “Israel's military told some 1 million Palestinians living in Gaza on Friday to evacuate the north, according to the United Nations … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/13/the-house-gop-sinks-deeper-into-chaos-00121390"
  },
  {
    "text": "Israel orders unprecedented evacuation of 1 million in Gaza as possible ground offensive looms  —  Gaza's energy crisis risk hospitals turning into morgues  —  Israel Defense Forces release footage of assault on Gaza-adjacent outpost  —  Israel's military told some 1 million Palestinians … ",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-c8b4fc20e4fd2ef381d5edb7e9e8308c"
  },
  {
    "text": "Hamas practiced in plain sight, posting video of mock attack weeks before border breach  —  Less than a month before Hamas fighters blew through Israel's high-tech “Iron Wall” and launched an attack that would leave more than 1,200 Israelis dead, they practiced in a very public dress rehearsal.",
    "url": "https://apnews.com/article/israel-palestinian-war-hamas-attack-border-wall-aa0b0f5f3613b6c6882cf37168e8e8ed"
  },
  {
    "text": "How 91 felony charges boosted Trump's standing in the GOP  —  Interviews in multiple states show that Trump's constant message of victimhood has seeped in with voters  —  David Alexander, an engineer who attended the Iowa Faith and Freedom dinner last month, called the absent Donald Trump … ",
    "url": "https://www.washingtonpost.com/elections/2023/10/13/trump-support-indictments/"
  },
  {
    "text": "Trump's turn against Israel offers stark reminder of what his diplomacy looks like  —  Donald Trump's inflammatory and artless comments about Hamas' horror in Israel emphasize the defining characteristic of his attitude toward foreign policy and his entire political world view: It's all about him.",
    "url": "https://www.cnn.com/2023/10/13/politics/donald-trump-israel-netanyahu-diplomacy/"
  },
  {
    "text": "Supreme Court Justices Avoid Falling Chunk Of Marble In Courtyard  —  Democratic institutions in D.C. are literally crumbling, apparently.  —  LOADING  —  The Supreme Court avoided a catastrophic accident last year when a piece of marble at least 2 feet long crashed to the ground … ",
    "url": "https://www.huffpost.com/entry/supreme-court-falling-chunk-of-marble_n_65293963e4b03ea0c004c463"
  },
  {
    "text": "October 12, 2023  —  We are in a bizarre moment.  —  If the U.S. government were operating within its normal parameters, my first story tonight would be about new federal charges that Senator Bob Menendez (D-NJ) was acting as an agent of Egypt while chairing the Senate Foreign Relations Committee.",
    "url": "https://heathercoxrichardson.substack.com/p/october-12-2023"
  },
  {
    "text": "Jack Smith tells Trump to put up or shut up  —  Smith's demand that Trump and his lawyers clarify his strategy is important because an affirmative defense would trigger two significant consequences  —  Jack Smith is asking former President Donald Trump to put his money where his mouth is.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-jack-smith-2020-election-interference-defense-rcna120166"
  },
  {
    "text": "‘America wants me’: How GOP Rep. Wagner recalls a private Scalise-Jordan conversation  —  The Ohio Republican's spokesperson disputes the Missourian's recollection.  But her frustration illustrates that Jordan has a speakership race problem.",
    "url": "https://www.politico.com/live-updates/2023/10/12/congress/wagners-memory-00121375"
  },
  {
    "text": "Gov. DeSantis signs executive order authorizing rescue of Floridians stranded in Israel: ‘Help is on the way’  —  Hundreds of U.S. families are believed to be stranded in Israel  —  Florida Gov. Ron DeSantis signed an executive order on Thursday authorizing planes from his state … ",
    "url": "https://www.foxnews.com/politics/gov-desantis-signs-executive-order-authorizing-rescue-floridians-stranded-israel"
  },
  {
    "text": "Biden team launches organizing pilot project in Wisconsin and Arizona  —  The reelection effort is focused on recruiting large numbers of volunteers to use their own relationships to spread the Biden message directly  —  President Biden's reelection effort will launch a pilot test … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/13/biden-organizing-campaign-election/"
  }
]