[
  {
    "text": "Ron DeSantis bashes Trump and teases plans to ‘supersede’ Obamacare  —  The Florida governor touted his campaign's efforts in Iowa on NBC's “Meet the Press” six weeks ahead of the caucuses.  —  Florida Gov. Ron DeSantis said on NBC's “Meet the Press” that he would replace Obamacare with a … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-bashes-trump-teases-plans-supersede-obamacare-rcna127414"
  },
  {
    "text": "DeSantis says he will win Iowa  —  “I think it's going to help propel us to the nomination,” DeSantis said.  —  Florida Gov. Ron DeSantis has staked his campaign's success on his performance in Iowa, where he's secured a key endorsement from Gov. Kim Reynolds and recently completed a 99-county campaign swing.",
    "url": "https://www.politico.com/news/2023/12/03/desantis-projects-confidence-iowa-00129772"
  },
  {
    "text": "Trump attempts to spin anti-democracy, authoritarian criticism against Biden  —  The former president declared his 2024 campaign as a ‘righteous crusade’ against ‘tyrants and villains’  —  CEDAR RAPIDS, Iowa — Republican polling leader Donald Trump moved to deflect from criminal charges … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/02/trump-speech-authoritarian-criticism-biden/"
  },
  {
    "text": "Pro-DeSantis super PAC fires interim CEO after 9 days  —  Never Back Down fired Kristin Davison on Friday, according to two people familiar with the decision.  —  The chief super PAC supporting Republican presidential candidate Ron DeSantis, Never Back Down, has fired its interim chief executive officer after less than two weeks.",
    "url": "https://www.politico.com/news/2023/12/02/desantis-super-pac-ceo-00129765"
  },
  {
    "text": "DeSantis PAC CEO out in latest shakeup  —  Never Back Down - the super PAC supporting Republican presidential candidate Ron DeSantis - has parted ways with its interim chief executive officer after she served nine days on the job.  —  Kristin Davison replaced former CEO Chris Jankowski on Nov. 22.",
    "url": "https://thehill.com/homenews/campaign/4339588-desantis-pac-ceo-out-in-latest-shakeup/"
  },
  {
    "text": "Pro-DeSantis super PAC parts with CEO amid turmoil  —  Kristin Davison departs just 10 days after the previous chief executive resigned, the latest shake-up as fighting between the governor's allies has escalated and erupted into public view  —  A super PAC that has overseen … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/02/kristin-davison-desantis-never-back-down/"
  },
  {
    "text": "Cop28 president says there is ‘no science’ behind demands for phase-out of fossil fuels  —  Exclusive: UAE's Sultan Al Jaber says phase-out of coal, oil and gas would take world ‘back into caves’  —  The president of Cop28, Sultan Al Jaber, has claimed there is “no science” … ",
    "url": "https://www.theguardian.com/environment/2023/dec/03/back-into-caves-cop28-president-dismisses-phase-out-of-fossil-fuels"
  },
  {
    "text": "Texas GOP executive committee rejects proposed ban on associating with Nazi sympathizers and Holocaust deniers  —  Some members of the committee said such a ban, proposed two months after a prominent conservative activist was caught meeting with a famous white supremacist, might be a “slippery slope” or too vague.",
    "url": "https://www.texastribune.org/2023/12/02/texas-gop-antisemitism-resolution/"
  },
  {
    "text": "Swing-state Muslim leaders launch campaign to ‘abandon’ Biden in 2024  —  The bubbling anger among Arab and Muslim Americans over the president's handling of the Israel-Hamas conflict could threaten his chances of reelection.  —  Muslim leaders from several swing states on Saturday descended on Dearborn … ",
    "url": "https://www.politico.com/news/2023/12/02/swing-state-muslim-leaders-biden-00129758"
  },
  {
    "text": "DeSantis's Education Policies in Florida Drive Out Liberal-Leaning Professors  —  Liberal-leaning professors are leaving coveted jobs with tenure.  And there are signs that recruiting scholars has become harder.  —  Gov. Ron DeSantis had just taken office in 2019 when the University … ",
    "url": "https://www.nytimes.com/2023/12/03/us/florida-professors-education-desantis.html"
  },
  {
    "text": "Open secret at climate talks: The top temperature goal is mostly gone  —  Researchers injected a sobering finding into global climate negotiations Sunday by saying the world will likely fail its most important warming test.  —  Leading scientists worldwide delivered a striking dose of reality … ",
    "url": "https://www.politico.com/news/2023/12/03/cop28-global-temperature-goal-00129766"
  },
  {
    "text": "George Santos Movie In Works At HBO Films From ‘Veep’ EP Frank Rich  —  Co-Editor-in-Chief, TV  — ‘Riches’ U.K. Series Canceled By Prime Video After One Season; “I Still Had Many More Stories To Tell,” Creator Says  — Julianna Margulies Apologizes For Comments Tying Black & LGBTQ Communities … ",
    "url": "https://deadline.com/2023/12/george-santos-movie-hbo-films-frank-rich-1235649730/"
  },
  {
    "text": "Several killed in bombing during Catholic mass in Philippines  —  At least three people were killed and seven wounded in a bomb attack on a Catholic mass in the insurgency-plagued southern Philippines on Sunday, officials said.  —  The blast took place during a regular service … ",
    "url": "https://www.cbsnews.com/news/several-killed-bombing-catholic-mass-philippines-marawi/"
  },
  {
    "text": "Drunk and Asleep on the Job: Air Traffic Controllers Pushed to the Brink  —  A nationwide shortage of controllers has resulted in an exhausted and demoralized work force that is increasingly prone to making dangerous mistakes.  —  One air traffic controller went into work drunk this summer and joked about “making big money buzzed.”",
    "url": "https://www.nytimes.com/2023/12/02/business/air-traffic-controllers-safety.html"
  },
  {
    "text": "Hard-right backtrack on spending levels leaves sour taste for colleagues  —  Fiscal fights have been at the heart of Republican conflict this year, including the debate over the top-line spending level for 2024  —  Under a sweltering July heat outside the Capitol, members … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/02/house-freedom-caucus-spending-plan/"
  }
]