[
  {
    "text": "FL CFO Backs Bill to Use Tax Dollars to Pay for Trump's Legal Defense  —  This is just gross.  —  Florida's Chief Financial Officer Jimmy Patronis announced today that he is supporting State Senator Ileana Garcia's bill SB 1740 to create a “Florida Freedom Fighter's Fund” … ",
    "url": "https://www.meidastouch.com/news/fl-cfo-backs-bill-to-use-tax-dollars-to-pay-for-trumps-legal-defense"
  },
  {
    "text": "Trump's Campaign of Humiliation Against Ron DeSantis  —  The former president's brutal, yearlong campaign of humiliation helped torpedo the Florida governor's White House hopes and left his next moves in politics uncertain.  —  Donald J. Trump plumbed new depths of degradation in his savage takedown … ",
    "url": "https://www.nytimes.com/2024/01/22/us/politics/desantis-trump-humiliation.html"
  },
  {
    "text": "Donald Trump has a big problem ahead  —  A whole swath of GOP voters appears firmly committed to not voting for Trump in November.  —  Donald Trump has a problem no matter what happens in New Hampshire on Tuesday night: There's a whole swath of the Republican electorate and a good chunk … ",
    "url": "https://www.politico.com/news/2024/01/23/trump-moderate-republicans-problem-00137112"
  },
  {
    "text": "The gamble Republicans are about to take on Trump  —  In a little more than 24 hours, New Hampshire Republican primary voters could effectively bring the 2024 nominating contest to a close.  —  Nikki Haley now has Donald Trump in the one-on-one race she had hoped for, but she trails in every poll in the state.",
    "url": "https://www.washingtonpost.com/politics/2024/01/22/trump-gamble-republicans/"
  },
  {
    "text": "Trump vs. Haley: Could the polls be wrong?  —  TRUMP VS. HALEY: COULD THE POLLS BE WRONG?  Salem, New Hampshire — Everything that everyone says about the New Hampshire Republican presidential primary is shaped by the polls showing Donald Trump far ahead of Nikki Haley.",
    "url": "https://www.washingtonexaminer.com/daily-memo/2812118/trump-vs-haley-could-the-polls-be-wrong/"
  },
  {
    "text": "Playbook: How Trump is winning on the issues  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — “21 Israeli troops are killed in the deadliest attack on the military since the Gaza offensive began,” by AP's Josef Federman and Najib Jobain … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/01/23/how-trump-is-winning-on-the-issues-00137155"
  },
  {
    "text": "Trump's surprise fan club: Why many Dems want him to win big in N.H. … Many Democrats are rooting for the same thing. … - The president's campaign has internal data indicating that most of the undecided voters Biden is targeting don't think Trump will be the Republican nominee … ",
    "url": "https://www.axios.com/2024/01/23/why-many-dems-want-trump-win-new-hampshire"
  },
  {
    "text": "The Inside Story Of Barack Obama's 2024 Campaign Calculations  —  ‘Existential’ fears, a focus on young people, and a history of helping Biden behind the scenes  —  Barack Obama is worried about America in 2024.  —  This is an “all hands on deck moment,” a source close to former President Obama told TPM, describing his thinking.",
    "url": "https://talkingpointsmemo.com/news/barack-obama-joe-biden-2024"
  },
  {
    "text": "U.S. Supreme Court says Texas can't block federal agents from the border  —  The high court's order effectively maintains long-running precedent that the federal government — not individual states — has authority to enforce border security.  —  The U.S. Supreme Court on Monday ordered Texas … ",
    "url": "https://www.texastribune.org/2024/01/22/texas-border-supreme-court-immigration/"
  },
  {
    "text": "Germany's surging far right provokes a reckoning  —  You're reading an excerpt from the Today's WorldView newsletter.  Sign up to get the rest free, including news from around the globe and interesting ideas and opinions to know, sent to your inbox every weekday.",
    "url": "https://www.washingtonpost.com/world/2024/01/23/germany-far-right-alternative-for-germany-afd-reckoning-protest-future/"
  },
  {
    "text": "The Fall of the House of Dead Bounce Ron  —  I wrote a few days ago that Ron DeSantis's long campaign collapse was likely the most ignominious and vertiginous in the presidential primary era, which dates in stages from the 1960s and early 1970s.  Some skeptics pointed to Jeb! in 2016 or Rudy Giuliani in 2008.",
    "url": "https://talkingpointsmemo.com/edblog/the-fall-of-the-house-of-dead-bounce-ron"
  },
  {
    "text": "The tide turns on Florida book bans  —  For years, Florida has been at the vanguard of removing books from school libraries.  Florida Republicans, including Governor Ron DeSantis (R), insisted that school librarians were seeking to “groom” children with pornographic materials.",
    "url": "https://popular.info/p/the-tide-turns-on-florida-book-bans"
  },
  {
    "text": "Jamie Dimon's MAGA warning to Dems is right on target  —  Call it a “road to Davos” moment: Jamie Dimon has seen the light.  —  The J.P. Morgan Chase CEO had liberals clutching at their pearls when he copped to a simple but (in some circles) unutterable truth: Former President Donald Trump … ",
    "url": "https://nypost.com/2024/01/22/opinion/jamie-dimons-maga-warning-to-dems-is-right-on-target/"
  },
  {
    "text": "How Steve Garvey became a punchline at the first California Senate debate  —  The Republican and former Dodger was an easy target for House Democrats on Thursday night.  —  LOS ANGELES — Steve Garvey was less a heavy hitter on Thursday night's Senate debate stage and more often a punchline.",
    "url": "https://www.politico.com/news/2024/01/23/steve-garvey-ca-senate-debate-punchline-00137143"
  },
  {
    "text": "Scoop: Israel proposes 2-month fighting pause in Gaza for release of all hostages  —  Israel has given Hamas a proposal through Qatari and Egyptian mediators that includes up to two months of a pause in the fighting as part of a multi-phase deal that would include the release … ",
    "url": "https://www.axios.com/2024/01/22/israel-hamas-gaza-ceasefire-hostages"
  },
  {
    "text": "The Rise of the American Oligarchy  —  What targeting Russia's wayward billionaires revealed about our own. … For the last 18 months one of the most opulent and unnecessary vessels ever constructed has been floating in a narrow channel next to a jungle gym and a fleet of industrial cranes at the Port of San Diego.",
    "url": "https://www.motherjones.com/politics/2024/01/american-oligarchy-introduction-essay-russia-ukraine-capitalism/"
  },
  {
    "text": "US, British militaries team up again to bomb sites in Yemen used by Iran-backed Houthis  —  WASHINGTON (AP) — The U.S. and British militaries bombed multiple sites used by the Iranian-backed Houthis in Yemen on Monday night, the second time the two allies have conducted coordinated retaliatory strikes … ",
    "url": "https://apnews.com/article/us-british-strikes-houthi-yemen-4ca86a7c0f484fcdf9c386cd752c1878"
  },
  {
    "text": "Immigration Wasn't Always a Divisive Issue in America  —  Why have Republicans and Democrats moved so far apart on immigration?  That's the question that drives the Opinion video above.  —  We are publishing this as President Biden comes under extraordinary pressure to curb surging illegal immigration at the southwestern border.",
    "url": "https://www.nytimes.com/2024/01/23/opinion/immigration-migrants-border-crisis.html"
  },
  {
    "text": "Fetterman's break from the left excites Republicans  —  The Pennsylvania Democrat is straying from liberal orthodoxy on the border and Israel, giving GOP colleagues hope that he might keep surprising them.  —  Republicans once slammed John Fetterman as a “radical socialist” who was “too dangerous” to get elected.",
    "url": "https://www.politico.com/news/2024/01/23/republicans-john-fetterman-00136343"
  },
  {
    "text": "A Fossil Fuel Miseducation  —  How an oil and gas organization in Illinois is promoting misinformation in schools.  —  On a balmy day in December, in Oblong, Illinois, I sat on a folding chair in a small, windowless room and watched a '90s VHS tape about a high school student who couldn't live without her petroleum products.",
    "url": "https://www.levernews.com/a-fossil-fuel-miseducation/"
  }
]