[
  {
    "text": "Supreme Court says Trump has absolute immunity for core acts only  —  The U.S. Supreme Court, in a 6-3 decision along ideological lines, ruled that a former president has absolute immunity for his core constitutional powers — and is entitled to a presumption of immunity for his official acts, but lacks immunity for unofficial acts.",
    "url": "https://www.npr.org/2024/07/01/nx-s1-5002157/supreme-court-trump-immunity"
  },
  {
    "text": "US Supreme Court rules Trump has immunity for official, not private acts  —  The U.S. Supreme Court found on Monday that Donald Trump cannot be prosecuted for official actions taken as president, but can for private acts, in a landmark ruling recognizing for the first time any form of presidential immunity from prosecution.",
    "url": "https://www.reuters.com/legal/us-supreme-court-due-rule-trumps-immunity-bid-blockbuster-case-2024-07-01/"
  },
  {
    "text": "Supreme Court says Trump has immunity for official acts in landmark ruling on presidential power  —  Washington — The Supreme Court on Monday ruled that former President Donald Trump is entitled to immunity from federal prosecution for official actions he took while in office … ",
    "url": "https://www.cbsnews.com/news/supreme-court-trump-immunity-decision-opinion/"
  },
  {
    "text": "Democrats Say the Supreme Court's Immunity Ruling Proves Its Pro-Trump Bias  —  Rep. Alexandria Ocasio-Cortez said she plans to file articles of impeachment against justices over the ruling.  “It is up to Congress to defend our nation from this authoritarian capture,” she wrote.  — Copy",
    "url": "https://www.notus.org/democrats/supreme-court-ethics-trump"
  },
  {
    "text": "Live updates Supreme Court to rule on Trump immunity, social media laws  —  The Supreme Court says presidents have “absolute” immunity for clearly official acts, but no immunity for unofficial acts.  Former president and presumptive Republican nominee Donald Trump faces four federal felony counts … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/01/trump-presidential-immunity-supreme-court/"
  },
  {
    "text": "What's next for Trump's criminal cases after SCOTUS immunity ruling … - The Supreme Court ruled Monday that he and other former presidents have “absolute immunity” from prosecution for their constitutionally defined authority, “presumed immunity” for other official acts and “no immunity” for unofficial acts.",
    "url": "https://www.axios.com/2024/07/01/trump-criminal-cases-supreme-court-immunity-ruling"
  },
  {
    "text": "Whitmer Disavows ‘Draft Gretch’ Movement — and Delivers A Warning to Biden  —  Democrats' 2028 bench is eager to avoid appearing eager to push Biden aside.  —  When Michigan Gov. Gretchen Whitmer telephoned a senior official with President Biden's campaign on Friday night … ",
    "url": "https://www.politico.com/news/magazine/2024/07/01/whitmer-biden-democrats-2028-00165995"
  },
  {
    "text": "Why I Want an Open Convention  —  Over the past few years, many people have told me I should stop making Biden-is-old jokes because “it just helps Trump” — as if voters wouldn't have noticed his age otherwise.  I can't ignore the obvious; none of us can.  And I'm not going to mindlessly … ",
    "url": "https://www.nytimes.com/2024/07/01/opinion/bill-maher-open-convention.html"
  },
  {
    "text": "Behind the Curtain: Biden's salvation plan … - Dismiss “bedwetting.” … - Squeeze polls for juice. … - Warn of chaos. … - Limit dissent. … - Keep elected leaders close. … - Get the donor class to chill. … - Prove vitality. … - Ignore/engage the media.",
    "url": "https://www.axios.com/2024/07/01/biden-2024-election-pr-campaign-step-aside"
  },
  {
    "text": "Don't Let a Biden Succession Crisis Create a Succession Crisis  —  It took no time for the pundits calling for Joe Biden to drop out of the race to reveal their fundamental childishness by asking for someone — Gavin Newsom, Gretchen Whitmer, JB Pritzker, Josh Shapiro … ",
    "url": "https://www.emptywheel.net/2024/07/01/dont-let-a-biden-succession-crisis-create-a-succession-crisis/"
  },
  {
    "text": "Steve Bannon reports to prison for contempt of Congress sentence  —  Bannon was sentenced to four months in prison for contempt of Congress.  —  Steve Bannon, former advisor to U.S. President Donald Trump, aattends an event in Detroit, Michigan, June, 15, 2024.",
    "url": "https://abcnews.go.com/US/steve-bannon-surrenders-reports-prison/story?id=111569255"
  },
  {
    "text": "Five Takeaways From France's Snap Election  —  It was a big day for the far-right National Rally.  Just how big will not be clear until after a second round of voting.  —  A new week of frenetic campaigning started in France on Monday, a day after the far-right National Rally party dominated … ",
    "url": "https://www.nytimes.com/2024/07/01/world/europe/france-election-takeaways.html"
  },
  {
    "text": "Biden's Handlers Release a New Video, and It's a Five-Alarm Fire Moment  —  It's only been four days since Joe Biden's disastrous debate performance, and the White House is scrambling to find its feet.  Truly, I've never seen anything like this.  I understand that there have been past presidents … ",
    "url": "https://redstate.com/bonchie/2024/07/01/biden-releases-a-new-video-and-its-a-five-alarm-fire-moment-n2176212"
  },
  {
    "text": "Trump Throws Middle-Of-The-Night Fit After Nancy Pelosi Called Him Out On Live TV  —  The former president attacked the former House speaker as a “sick puppy.”  —  LOADING  —  Donald Trump posted a wild late night rant aimed at Rep. Nancy Pelosi (D-Calif.) after the former House speaker slammed … ",
    "url": "https://www.huffpost.com/entry/nancy-pelosi-trump-late-night-fit_n_668225aae4b08dc39c833e5b"
  },
  {
    "text": "SCOTUS completes the biggest power grab in modern US history  —  This free edition of Public Notice is made possible by paid subscribers.  If you aren't one already, please sign up to support our independent journalism.  —  ⚖️ Subscribe to Public Notice ⚖️",
    "url": "https://www.publicnotice.co/p/scotus-loper-bright-chevron-jarkesy-explained"
  }
]