[
  {
    "text": "Trump suggests his plan for Gaza Strip is to ‘clean out the whole thing’  —  President Donald Trump indicated Saturday that he had spoken with the king of Jordan about a potential plan to construct housing and move more than 1 million Palestinians from the Gaza Strip to other countries … ",
    "url": "https://www.cnn.com/2025/01/25/politics/trump-gaza-strip-jordan-egypt/"
  },
  {
    "text": "Trump Says He Wants Jordan and Egypt to Take in Palestinians From Gaza  —  President Trump said he had spoken to Jordan's leader and planned to call Egypt's on Sunday.  Most of Gaza's two million residents have been displaced in 15 months of fighting.  —  President Trump said he told King Abdullah II … ",
    "url": "https://www.nytimes.com/2025/01/25/us/politics/trump-palestinians-jordan-egypt-refugees.html"
  },
  {
    "text": "Scoop: Trump lifts Biden's hold on 2,000-pound bombs to Israel … - The officials said that 1,800 MK-84 bombs, which were held in storage in the U.S., will be put on a ship and delivered to Israel in the coming days.  — “A lot of things that were ordered and paid for by Israel … ",
    "url": "https://www.axios.com/2025/01/25/trump-israel-bomb-shipment-hold-gaza"
  },
  {
    "text": "Trump vows to deliver on ‘no tax on tips’ campaign promise during Las Vegas speech: ‘100% yours’  —  Trump visited Nevada to ‘thank’ voters for electing him  —  President Trump visited Las Vegas on Saturday afternoon to discuss his agenda for American workers, stressing a “no tax on tips” … ",
    "url": "https://www.foxnews.com/politics/trump-vows-deliver-no-tax-tips-campaign-promise-during-las-vegas-speech-100-yours"
  },
  {
    "text": "Trump's first-week strategy: ‘Flood the zone.’ Repeat.  —  It was all part of a plan to begin with a bang and follow a detailed policy blueprint, although key administrative posts remained stuck in a hiring bottleneck and many of his directives lacked immediate effect.",
    "url": "https://www.washingtonpost.com/politics/2025/01/25/trump-week-one-flood-the-zone/"
  },
  {
    "text": "Elon Musk appears on video at German far right campaign event  —  Elon Musk made a surprise appearance during Germany's AfD (Alternative fuer Deutschland) election campaign event in Halle in eastern Germany on Saturday, speaking publicly in support of the far right party for the second time in as many weeks.",
    "url": "https://www.reuters.com/world/europe/elon-musk-appears-video-german-far-right-campaign-event-2025-01-25/"
  },
  {
    "text": "Musk tells Germans to get over ‘past guilt’ in speech to far-right AfD rally  —  The tech billionaire and Trump adviser has drawn rebukes for repeatedly endorsing the AfD in the leadup to Germany's snap election next month.  —  Elon Musk made a virtual appearance at a rally for the far-right Alternative … ",
    "url": "https://www.politico.com/news/2025/01/25/musk-german-afd-rally-weidel-00200620"
  },
  {
    "text": "C.I.A. Now Favors Lab Leak Theory to Explain Covid's Origins  —  A new analysis that began under the Biden administration is released by the C.I.A.'s new director, John Ratcliffe, who wants the agency to get “off the sidelines” in the debate.  —  The C.I.A. has said for years … ",
    "url": "https://www.nytimes.com/2025/01/25/us/politics/cia-covid-lab-leak.html?unlocked_article_code=1.sE4.POa5.MspHars29YXa&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "‘I am terrified’: Workers describe the dark mood inside federal agencies  —  “I would love to leave, but I don't know where I'd go,” said one staffer.  —  President Donald Trump's executive orders targeting the federal workforce have injected a fresh wave of anxiety among employees across the bureaucracy … ",
    "url": "https://www.politico.com/news/2025/01/25/federal-workers-trump-dei-00200588"
  },
  {
    "text": "Exclusive: White House in talks to have Oracle and U.S. investors take over TikTok  —  The Trump administration is working on a plan to save TikTok that involves tapping software company Oracle and a group of outside investors to effectively take control of the app's global operations … ",
    "url": "https://www.npr.org/2025/01/25/g-s1-44779/tiktok-ban-deal-trump-oracle"
  },
  {
    "text": "Kansas tuberculosis outbreak is now America's largest in recorded history  —  An ongoing tuberculosis outbreak in Kansas has become the largest in recorded history in the United States.  —  “Currently, Kansas has the largest outbreak that they've ever had in history,” Ashley Goss … ",
    "url": "https://www.cjonline.com/story/news/politics/government/2025/01/24/kansas-tuberculosis-outbreak-is-largest-in-recorded-history-in-u-s/77881467007/"
  },
  {
    "text": "Expect record-high egg prices for most of the year  —  Americans can continue to expect high prices for eggs this year, new estimates show, due to the ongoing avian flu outbreak and inflation.  —  Egg prices are estimated to increase about 20% in 2025, compared to about 2.2% for food prices in general … ",
    "url": "https://www.cnn.com/2025/01/25/business/egg-prices-avian-flu-outbreak/"
  },
  {
    "text": "Trump's canceling of 50 security clearances is unprecedented and partisan, experts say  —  The move is meant to please Trump voters, punish perceived enemies and represents “the most politically saturated security action since the Oppenheimer case in the 1950s.”",
    "url": "https://www.nbcnews.com/politics/national-security/trumps-canceling-scores-security-clearances-unprecedented-rcna189245?utm"
  },
  {
    "text": "They Were Waiting for Flights.  Then Trump Closed a Door for Afghan Allies.  —  An executive order has halted refugee flights for Afghans who supported the American mission in Afghanistan and had been approved to resettle in the U.S.  —  Nasir, a legal adviser to the Afghan Air Force during the war … ",
    "url": "https://www.nytimes.com/2025/01/25/world/asia/trump-executive-order-immigration-afghanistan.html"
  },
  {
    "text": "A Montgomery County official mimicked Elon Musk's controversial ‘salute,’ sparking outrage online and her resignation from the local library and a nonprofit  —  A township supervisor in Montgomery County has come under fire, and resigned from her position at the local library and a nonprofit … ",
    "url": "https://www.inquirer.com/politics/pennsylvania/towamencin-supervisor-laura-smith-nazi-salute-20250125.html"
  },
  {
    "text": "House Speaker Invites Trump to Address Congress on March 4  —  House Speaker Mike Johnson invited President Donald Trump to address a joint session of Congress on March 4, seeking to set the stage for his first major speech to lawmakers since he returned to the White House.",
    "url": "https://www.bloomberg.com/news/articles/2025-01-25/house-speaker-invites-trump-to-address-congress-on-march-4"
  },
  {
    "text": "The Tech Arsenal That Could Power Trump's Immigration Crackdown  —  Border enforcement agencies have spent billions assembling surveillance tools to track and find people.  These could be critical in President Trump's immigration agenda.  —  Apps and ankle monitors that track asylum seekers in real time wherever they go.",
    "url": "https://www.nytimes.com/2025/01/25/technology/trump-immigration-deportation-surveillance.html"
  },
  {
    "text": "More DEI fallout: Air Force scraps course that used videos of Tuskegee Airmen and female WWII pilots  —  The Air Force has removed training courses with videos of its storied Tuskegee Airmen and the Women Airforce Service Pilots, or WASPs — the female World War II pilots who were vital … ",
    "url": "https://apnews.com/article/air-force-dei-tuskegee-women-wwii-pilots-ecdeac68dc7696535d093c7690ab73bc"
  },
  {
    "text": "Florida Republican urges Trump to spare some migrants under deportation plan  —  Rep. Maria Elvira Salazar (R-Fla.) is urging President Trump's Department of Homeland Security (DHS) to spare some migrants from Latin America and the Caribbean from being deported under the new administration's immigration guidelines.",
    "url": "https://thehill.com/homenews/house/5106861-florida-republican-urges-trump-to-spare-some-migrants-under-deportation-plan/"
  },
  {
    "text": "Hegseth's Views May Clash With Reality at the Pentagon  —  The new defense secretary's goals run counter to the military's apolitical tradition and efforts to build a force that mirrors America.  —  Pete Hegseth, the newly confirmed defense secretary, has pledged to restore “the warrior ethos” … ",
    "url": "https://www.nytimes.com/2025/01/25/us/politics/pete-hegseth-new-defense-secretary.html"
  }
]