[
  {
    "text": "There Is No Going Back  —  Even if anyone had elected Elon Musk to anything, the past week would still be one of the most serious examples of executive branch malfeasance in American history.  —  Musk has seized hold of critical levers of power and authority within the federal government … ",
    "url": "https://www.nytimes.com/2025/02/05/opinion/trump-musk-federal-government.html?unlocked_article_code=1.uk4.KjGs.NBjDp6WVakwq&smid=url-share"
  },
  {
    "text": "Trump Brazenly Defies Laws in Escalating Executive Power Grab  —  In the radical opening weeks of his second term, President Trump has appeared to feel little constraint by any need to show respect for the rule of law.  —  In his first term, President Trump seemed to relish ripping through … ",
    "url": "https://www.nytimes.com/2025/02/05/us/trump-federal-law-power.html?unlocked_article_code=1.uk4.Yri7.3if-NnTFkGWc"
  },
  {
    "text": "DOGE Employees Ordered to Stop Using Slack While Agency Transitions to a Records System Not Subject to FOIA  —  Employees working for the agency now known as DOGE have been ordered to stop using Slack while government lawyers attempt to transition the agency to one that is not subject … ",
    "url": "https://www.404media.co/doge-employees-ordered-to-stop-using-slack-while-agency-transitions-to-a-records-system-not-subject-to-foia/"
  },
  {
    "text": "C.I.A. Sends White House an Unclassified Email With Names of Some Employees  —  The list of partial names was provided in an effort to comply with an executive order to trim the federal work force.  —  The C.I.A. sent the White House an unclassified email listing all employees hired … ",
    "url": "https://www.nytimes.com/2025/02/05/us/politics/cia-names-list.html?unlocked_article_code=1.uk4.jLCR.AnsTfF5SjWV-&smid=url-share"
  },
  {
    "text": "Trump Administration Live Updates: C.I.A. Provides List of Recent Hires as White House Eyes Deep Cuts  —  Where Things Stand  — Worker purge expands: The C.I.A. sent the White House an unclassified email listing employees hired in the past two years, part of the Elon Musk-led effort to drastically shrink the federal work force.",
    "url": "https://www.nytimes.com/live/2025/02/05/us/trump-news"
  },
  {
    "text": "The CIA Is About to Get a Trump Makeover  —  Spy agency's workforce receives buyout-style offer  —  WASHINGTON—The Central Intelligence Agency offered buyouts to its entire workforce Tuesday, in what officials said is a bid to bring the agency in line with President Trump's priorities, including targeting drug cartels.",
    "url": "https://www.wsj.com/politics/national-security/the-cia-is-about-to-get-a-trump-makeover-16fc0cbf?st=UkTZ8Q"
  },
  {
    "text": "Trump's suggestion that US ‘take over’ the Gaza Strip is rejected by allies and adversaries alike  —  President Donald Trump's proposal that the United States “take over” the Gaza Strip and permanently resettle its Palestinian residents was swiftly rejected and denounced on Wednesday by American allies and adversaries alike.",
    "url": "https://apnews.com/article/israel-hamas-war-gaza-trump-netanyahu-db2c407baf803291a4acf6edfd708c48"
  },
  {
    "text": "Trump says the U.S. will ‘take over’ Gaza and relocate its people.  What does it mean?  —  TEL AVIV, Israel — President Trump floated two bombshell ideas Tuesday about Gaza that has Palestinians, Israelis and the wider Middle East scrambling.  —  The first: that the U.S. would take over the territory.",
    "url": "https://www.npr.org/2025/02/05/nx-s1-5287576/trump-gaza-takeover"
  },
  {
    "text": "DOGE Aides Search Medicare Agency Payment Systems for Fraud  —  Elon Musk's allies have been on site at Centers for Medicare and Medicaid Services offices this week  —  Representatives of Elon Musk's Department of Government Efficiency have been working at the Centers for Medicare and Medicaid Services … ",
    "url": "https://www.wsj.com/politics/elon-musk-doge-medicare-medicaid-fraud-e697b162?st=N9byaJ"
  },
  {
    "text": "Trump White House Moves to Allow for a Musk Takeover of Government IT  —  The Office of Personnel Management is trying to make it easier to put ideologues and cronies in key tech roles.  —  It's a rather wonky position in the US government: chief information officer.  Most federal agencies and departments have one.",
    "url": "https://www.motherjones.com/politics/2025/02/donald-trump-opm-memo-elon-musk-takeover-government-it/"
  },
  {
    "text": "King Musk's Government Purge Hits a Snag  —  Before Elon Musk can exercise authoritarian power, he must purge the federal bureaucracy.  But federal workers aren't playing ball.  —  Protesters gather outside the United States Office of Personal Management (OPM) headquarters, February 4, 2025, in Washington.",
    "url": "https://prospect.org/labor/2025-02-05-king-musks-government-purge-hits-snag/"
  },
  {
    "text": "Why Elon Will Be Trump's Undoing  —  Yes, yes, “the wheels of justice grind slowly” and all that.  But when do the courts get involved?  —  Happy Wednesday.  —  Never Musk  —  by William Kristol  —  It's grim out there.  Limiting the damage done by Donald Trump and the Trumpists … ",
    "url": "https://www.thebulwark.com/p/why-elon-will-be-trumps-undoing"
  },
  {
    "text": "Top Trump prosecutor in DC dropped federal case against Capitol rioter he represented  —  As President Donald Trump moved last month to free the people who stormed the U.S. Capitol, his newly appointed top prosecutor in Washington put his name on a request that a judge drop charges … ",
    "url": "https://www.reuters.com/world/us/top-trump-prosecutor-dc-who-was-present-capitol-riot-dropped-us-case-against-2025-02-05/"
  },
  {
    "text": "Doge staffers enter Noaa headquarters and incite reports of cuts and threats  —  Members reportedly sought access to IT systems at agency that Project 2025 has called ‘harmful to US prosperity’  —  Staffers with Elon Musk's “department of government efficiency” (Doge) reportedly entered … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/04/doge-noaa-headquarters"
  },
  {
    "text": "Fox News hires Lara Trump to host weekend show  —  Fox News has inked a deal with Lara Trump, a former co-chair of the Republican National Committee (RNC) and daughter-in-law to President Trump, to host a show on the channel.  —  The new show, dubbed “My View with Lara Trump,” … ",
    "url": "https://thehill.com/homenews/media/5128423-lara-trump-fox-news/"
  },
  {
    "text": "Senate's top appropriator says Elon Musk has gone too far  —  The Senate's top appropriator thinks Elon Musk has gone too far.  Senate Appropriations Chair Susan Collins, a Maine Republican, is raising alarms about the influence that billionaire Elon Musk is wielding inside the Trump administration and across federal agencies.",
    "url": "https://www.politico.com/live-updates/2025/02/05/congress/susan-collins-elon-musk-trump-spending-00202633"
  },
  {
    "text": "The 24-Hour Reality Check: Musk's Impossible Power Grab And America's Crisis  —  There are twenty-four hours in a day.  This isn't a matter of political opinion or technological disruption—it's as immutable as the fact that two plus two equals four.  No amount of genius, innovation … ",
    "url": "https://www.techdirt.com/2025/02/05/the-24-hour-reality-check-musks-impossible-power-grab-and-americas-crisis/"
  },
  {
    "text": "Trump Revokes Security Detail for Mark Esper, Former Defense Secretary  —  Within hours of his inauguration, Mr. Trump began to pull security details from nearly a half-dozen people who had served in his first term, most of them under threat for enforcing his Iran policy.",
    "url": "https://www.nytimes.com/2025/02/05/us/politics/trump-security-mark-esper.html"
  },
  {
    "text": "Judge cements block on Trump's order restricting birthright citizenship  —  GREENBELT, Md. — A federal judge Wednesday furthered a block of President Trump's executive order preventing the children of migrants without legal status from receiving birthright citizenship.",
    "url": "https://thehill.com/regulation/court-battles/5128057-donald-trump-birthright-citizenship-judge-block/amp/"
  },
  {
    "text": "House Democrat plans articles of impeachment against Trump … - “Ethnic cleansing in Gaza is not a joke, especially when it emanates from the president of the United States,” Green said.  — Green continued: “I rise to announce that the movement to impeach the president has begun.",
    "url": "https://www.axios.com/2025/02/05/donald-trump-house-democrat-impeachment-articles"
  },
  {
    "text": "Senate panel will advance budget next week, Graham says  —  The Senate will move forward with a budget blueprint next week setting out a two-track approach to enacting President Donald Trump's domestic agenda, key senators said Wednesday.  The announcement, made by Senate Budget Committee … ",
    "url": "https://www.politico.com/live-updates/2025/02/05/congress/senate-budget-lindsey-graham-00202649"
  },
  {
    "text": "Thousands protest Trump administration policies in cities across the US  —  A movement to protest the early actions of President Donald Trump's administration took off Wednesday, as thousands of demonstrators gathered outside a federal courthouse in Philadelphia and at state capitols in Michigan, Texas, Wisconsin and Indiana.",
    "url": "https://apnews.com/article/50501-protests-project-2025-trump-state-capitols-ddd341171a54ba9b498cbfe7530e18ab"
  },
  {
    "text": "FBI agents who ‘simply followed orders’ in Jan. 6 probes won't be fired, a Justice official says  —  FBI agents “who simply followed orders and carried out their duties in an ethical manner” while investigating the Jan. 6 riot at the U.S. Capitol are not at risk of being fired … ",
    "url": "https://apnews.com/article/trump-fbi-justice-department-jan-6-ff003e46ea48c4e8be710d1ba2eb2d02"
  },
  {
    "text": "Federal health workers terrified after ‘DEI’ website publishes list of ‘targets’  —  The site calls out workers who have been involved with DEI initiatives.  A majority are Black.  —  Federal health workers are expressing fear and alarm after a website called “DEI Watch List” published the photos … ",
    "url": "https://www.nbcnews.com/health/health-news/federal-health-workers-terrified-dei-website-publishes-list-targets-rcna190711"
  },
  {
    "text": "Trump-voting states have more to lose if Education Department dismantled … - States that voted for Trump last November, on average, use more federal funding in their education apportions than states that voted for former Vice President Harris.  — “That dependence is, in large part … ",
    "url": "https://www.axios.com/2025/02/05/trump-federal-education-funding-map-schools"
  },
  {
    "text": "Elon Musk and the League of Shadows  —  America gets government by vigilante.  —  ∙ Paid  —  1. Vigilante Shit  —  What is Elon Musk's role within the federal government?  —  He is not an elected official.  He is not an appointed bureaucrat.  He is not even a formal employee.",
    "url": "https://www.thebulwark.com/p/elon-musk-and-the-league-of-shadows"
  },
  {
    "text": "Watch The Credit-Ratings Agencies  —  If the illegal commandeering of the federal budget doesn't make the U.S. less creditworthy, then Wall Street is cowed and misleading investors.  —  ∙ Paid  —  In August 2011, after Republicans brought the country to the brink of default on the national debt … ",
    "url": "https://www.offmessage.net/p/watch-the-credit-ratings-agencies"
  },
  {
    "text": "Committee blocks Musk subpoena  —  Democrats on the House Oversight and Government Reform Committee moved to subpoena Elon Musk “at the earliest possible moment” to appear before lawmakers — a motion that failed in a party-line vote, 20-19.  Ranking member Gerry Connolly (D-Va.) … ",
    "url": "https://www.politico.com/live-updates/2025/02/05/congress/elon-musk-subpoena-congress-00202592"
  }
]