[
  {
    "text": "Iowa Poll shows Nikki Haley leads Ron DeSantis in Iowa Caucuses.  Donald Trump far ahead  —  Although Nikki Haley has pulled ahead of Ron DeSantis, the Iowa Poll shows clear dangers lurk for her going into a caucus night that could be decided by Iowans' willingness to brave the bitter cold",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2024/01/13/iowa-poll-nikki-haley-leads-ron-desantis-ahead-of-republican-caucus-night-big-lead-for-donald-trump/72216523007/"
  },
  {
    "text": "Poll: Nearly half of Haley's Iowa backers say they'll vote for Biden over Trump  —  The Iowa poll finds most likely GOP caucusgoers will vote for Trump in the 2024 general election — but not Haley's supporters.  —  DES MOINES, Iowa — Most likely Republican Iowa caucusgoers say they'll vote … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-nearly-half-haleys-iowa-backers-say-ll-vote-biden-trump-rcna133821"
  },
  {
    "text": "How College-Educated Republicans Learned to Love Trump Again  —  Blue-collar white voters make up Donald Trump's base.  But his political resurgence has been fueled largely by Republicans from the other end of the socioeconomic scale.  —  Working-class voters delivered the Republican Party to Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/01/14/us/politics/trump-college-educated-voters.html"
  },
  {
    "text": "Did Trump or Biden deliver more for farmers?  The answer may surprise you.  —  The former president is using his ag record to appeal to Iowa voters.  Farm income, however, rose under Biden.  —  To hear former President Donald Trump tell it, America's farmers never had it so good as during his four years in the White House.",
    "url": "https://www.politico.com/news/2024/01/14/trump-biden-farmers-00135396"
  },
  {
    "text": "Iowa's deep freeze scrambles caucus turnout tactics for GOP campaigns  —  The Trump campaign is aiming to prove its organizational competence, while Haley and DeSantis rely on outside groups  —  JOHNSTON, Iowa — The Iowans who answered their doorbells, held back their barking dogs … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/13/iowa-caucus-weather/"
  },
  {
    "text": "Trump tops his opponents while Biden hits a new low in approval ahead of Iowa caucus: POLL  —  72% of Republican-aligned adults would be satisfied with Trump as the nominee.  —  The 2024 primary season begins with Donald Trump well ahead of his Republican opponents on key measures of popularity … ",
    "url": "https://abcnews.go.com/Politics/trump-tops-opponents-biden-hits-new-low-approval/story?id=106335244"
  },
  {
    "text": "Dems could give Haley a boost in Iowa caucuses … - Iowa allows day-of party registration for voters, and Democrats aren't holding in-person presidential caucuses this year.  — That's given mischievous anti-Trump voters “a chance to diminish Trump's inevitability,” as Don McLeese of West Des Moines put it.",
    "url": "https://www.axios.com/2024/01/14/democrats-boost-haley-iowa-trump-desantis"
  },
  {
    "text": "Where Donald Trump, Nikki Haley, Ron DeSantis stand in final Iowa Poll before caucus night  —  Donald Trump is the first choice of 48% of likely Republican caucusgoers, while former United Nations Ambassador Haley is at 20% and Florida Gov. DeSantis drops to 16%",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2024/01/13/iowa-poll-final-caucus-rankings-for-trump-haley-desantis-ramaswamy/72215669007/"
  },
  {
    "text": "Lawyer for E. Jean Carroll suggests Trump misrepresented need to adjourn trial  —  The attorney for writer E. Jean Carroll suggested that the lawyer for former President Trump misrepresented the former president's need to delay the trial in connection to $10 million in defamation damages that the writer is seeking.",
    "url": "https://thehill.com/regulation/court-battles/4408002-lawyer-for-e-jean-carroll-suggests-trump-misrepresented-need-to-adjourn-trial/"
  },
  {
    "text": "Pro-Palestinian protesters chant ‘f-k Joe Biden,’ damage fence outside White House  —  A swarm of Pro-Palestinian supporters shouted “f-k Joe Biden” slogans as they nearly ripped down a reinforced fence outside the White House during a charged protest Saturday night.",
    "url": "https://nypost.com/2024/01/13/news/pro-palestinian-protesters-chant-anti-biden-slogans-outside-white-house/"
  },
  {
    "text": "Fears grow that Trump will use the military in ‘dictatorial ways’ if he returns to the White House  —  Among those being mentioned for Trump's secretary of defense are Christopher Miller, who served temporarily during his administration, Michael Flynn and Mike Pompeo.",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-military-fears-rcna129159"
  },
  {
    "text": "Biden “running out” of patience with Bibi as Gaza war hits 100 days  —  President Biden and other senior U.S. officials are becoming increasingly frustrated with Israeli Prime Minister Benjamin Netanyahu and his rejection of most of the administration's recent requests related to the war in Gaza … ",
    "url": "https://www.axios.com/2024/01/14/biden-netanyahu-israel-gaza-war-tensions"
  },
  {
    "text": "How Iowa Turned the Caucuses Into a Gold Mine  —  Presidential-campaign capitalism brings windfall as state taps candidates and the media  —  DES MOINES, Iowa—When Jimmy Carter crisscrossed this state ahead of the 1976 presidential caucuses, his campaign's Iowa budget was roughly $100,000 in today's dollars.",
    "url": "https://www.wsj.com/politics/policy/iowa-caucus-economy-money-8803f2c0?mod=followamazon"
  },
  {
    "text": "Three migrants drowned near Eagle Pass park after Border Patrol was denied access  —  Texas officers took control over Shelby Park against the city's wishes on Wednesday and have since blocked U.S. Border Patrol agents from entering.  —  A woman and two children drowned trying to cross the Rio Grande … ",
    "url": "https://www.texastribune.org/2024/01/13/henry-cuellar-texas-border-eagle-pass/"
  },
  {
    "text": "John Kerry to step down as top U.S. climate change negotiator  —  The U.S. special climate envoy, who turned 80 last year, is expected to depart from the Biden administration by the spring  —  John F. Kerry, who has served as the U.S. special climate envoy for nearly three years … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/13/john-kerry-resigns-climate-change-envoy/"
  }
]