[
  {
    "text": "The testimony from Trump's White House chief of staff could change everything  —  Former White House chief of staff Mark Meadows rolled the dice on Monday with his opening move in the sprawling Fulton County election subversion trial: he took the stand himself.",
    "url": "https://www.cnn.com/2023/08/29/politics/mark-meadows-gamble-trump-fani-willis/"
  },
  {
    "text": "Jack Smith's Team Grilled Witnesses About Rudy Giuliani's Drinking  —  The special counsel's interest in Rudy's drinking could play a role in undermining one of Trump's key legal defenses … In their questioning of multiple witnesses, Smith's team of federal investigators have asked questions … ",
    "url": "https://www.rollingstone.com/politics/politics-features/rudy-giuliani-jack-smith-donald-trump-jan6-1234814129/"
  },
  {
    "text": "These are the first 10 drugs subject to Medicare price negotiations  —  The Biden administration unveiled Tuesday the names of the first 10 drugs subject to price negotiations in Medicare.  —  They are: Eliquis, Jardiance, Xarelto, Januvia, Farxiga, Entresto, Enbrel, Imbruvica, Stelara … ",
    "url": "https://www.cnn.com/2023/08/29/politics/medicare-drug-price-negotiations/"
  },
  {
    "text": "How Trump's Election Lies Left the Michigan G.O.P. Broken and Battered  —  Infighting between Trump acolytes and traditionalists has driven away donors and voters.  Can the Michigan Republican Party rebuild in time for the presidential election?  —  The Michigan Republican Party is starving for cash.",
    "url": "https://www.nytimes.com/2023/08/29/us/politics/trump-michigan-republican-party.html"
  },
  {
    "text": "Steve Scalise diagnosed with ‘very treatable’ blood cancer  —  House Majority Leader Steve Scalise (R-La.) was diagnosed with multiple myeloma, a blood cancer, he announced Tuesday.  —  Scalise, 57, has begun treatment and plans to return to Washington, D.C.",
    "url": "https://thehill.com/homenews/house/4176620-steve-scalise-diagnosed-blood-cancer/"
  },
  {
    "text": "Francis Suarez ends campaign for Republican presidential nomination  —  Miami Mayor Francis Suarez announced Tuesday that he is ending his campaign for the 2024 Republican presidential nomination.  —  “While I have decided to suspend my campaign for President, my commitment to making … ",
    "url": "https://www.cnn.com/2023/08/29/politics/francis-suarez-ends-president-campaign-republican/"
  },
  {
    "text": "Texas Guardsmen spied on migrants via WhatsApp, mishandled secret docs  —  Senior leaders allegedly ignored oversight officials' concerns.  —  This article is co-published and co-reported with The Texas Tribune, a nonprofit newsroom that informs Texans about state policy and politics.",
    "url": "https://www.armytimes.com/news/your-army/2023/08/29/texas-guardsmen-spied-on-migrants-via-whatsapp-mishandled-secret-docs/"
  },
  {
    "text": "Supreme Court Justice Amy Coney Barrett Says She Welcomes Public Scrutiny Of Court  —  U.S. Supreme Court Justice Amy Coney Barrett did not offer any opinion, or speak directly about, recent calls for the justices to institute an official code of conduct.  —  LOADING",
    "url": "https://www.huffpost.com/entry/supreme-court-barrett_n_64edc1e4e4b05b73949dea39"
  },
  {
    "text": "GOP salivates at the biggest campaign finance win since Citizens United  —  It could be a seismic shift in how tens of millions of campaign dollars are spent.  —  Republicans have waged a decades-long battle to blow up the campaign-finance laws that rein in big-money spending.",
    "url": "https://www.politico.com/news/2023/08/29/gop-campaign-finance-citizens-united-00113235"
  },
  {
    "text": "The Fourteenth Amendment Fantasy  —  The Constitution won't disqualify Trump from running.  The only real-world way of stopping him is through the ballot box.  —  The fourteenth amendment won't save us from Donald Trump.  —  Eminent jurists are promising that it will.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/08/trump-disqualified-president-14th-amendment/675163/"
  },
  {
    "text": "FBI announces it has dismantled global network of hacked computers used in major fraud scheme  —  The FBI and European law enforcement agencies dismantled a massive network of hacked computers that had been used to defraud victims of hundreds of millions of dollars, agencies announced Tuesday.",
    "url": "https://www.cnn.com/2023/08/29/politics/fbi-dismantled-network-hacked-computers/"
  },
  {
    "text": "The Christian home-schooler who made ‘parental rights’ a GOP rallying cry  —  On a private call with Christian millionaires, home-schooling pioneer Michael Farris pushed for a strategy aimed at siphoning billions of tax dollars from public schools  —  The message Michael Farris had come … ",
    "url": "https://www.washingtonpost.com/education/2023/08/29/michael-farris-homeschoolers-parents-rights-ziklag/"
  },
  {
    "text": "Gadsden flag now a symbol of hate?  —  A schoolboy has become an instant internet legend for defying a school district.  —  The 12-year-old has, as is so often the case, a bunch of patches on his backpack as an expression of his individuality.  His school didn't like one of the patches and demanded that he quit displaying it.",
    "url": "https://hotair.com/david-strom/2023/08/29/gadsden-flag-now-a-symbol-of-hate-n574491"
  },
  {
    "text": "The Final Days  —  Joe Biden was determined to get out of Afghanistan—no matter the cost.  —  august is the month when oppressive humidity causes the mass evacuation of official Washington.  In 2021, White House Press Secretary Jen Psaki piled her family into the car for a week at the beach.",
    "url": "https://www.theatlantic.com/magazine/archive/2023/10/afghanistan-withdrawal-biden-decision/675116/"
  },
  {
    "text": "Florida Governor Ron DeSantis faces Black leaders' anger after racist killings in Jacksonville  —  Ron DeSantis scoffed when the NAACP issued a travel advisory this spring warning Black people to use “extreme care” if traveling to Florida.  The leading civil rights group argued … ",
    "url": "https://apnews.com/article/jacksonville-desantis-racist-republican-shooting-haley-scott-9bba89577ae8d0571e1d19b6a947fef5"
  },
  {
    "text": "Christie Super PAC Airing Trump Mugshot On TV In New Hampshire  —  The pro-Christie super PAC is spending six figures to air the former president's mugshot on television  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing an external link … ",
    "url": "https://themessenger.com/politics/christie-super-pac-airing-trump-mugshot-on-tv-in-new-hampshire"
  },
  {
    "text": "Conservative Coalition Recruiting for Plan to Dismantle Federal Government  —  NOW HIRING  —  A coalition of right-wing organizations has started recruiting thousands of people as part of a project aimed at gutting the federal government in anticipation of a Republican victory in the 2024 election, according to a report.",
    "url": "https://www.thedailybeast.com/project-2025-conservative-coalition-recruiting-for-plan-to-dismantle-federal-government"
  },
  {
    "text": "A shutdown wouldn't halt Trump's trials, so Republicans seek to rein in his prosecutors  —  Federal criminal proceedings are exempted from shutdowns.  But GOP House members want to use a must-pass funding bill to defund or limit law enforcement investigating Trump.",
    "url": "https://www.nbcnews.com/politics/donald-trump/shutdown-wouldnt-halt-trumps-trials-republicans-seek-rein-prosecutors-rcna102152"
  },
  {
    "text": "US announces new Ukraine security package  —  The U.S. on Tuesday announced a new security package for Ukraine valued at $250 million, which includes more small arms ammunition and munitions for missiles for Kyiv.  —  The package announced Tuesday includes AIM-9M air defense missiles … ",
    "url": "https://thehill.com/policy/defense/4177107-us-announces-new-ukraine-security-package/"
  },
  {
    "text": "Vivek Ramaswamy thinks college applications should include a 1-mile run and other parts of the Presidential Fitness Test  — GOP presidential candidate Vivek Ramaswamy suggested an additional criteria for college applicants.  — He said colleges should screen applicants on their physical fitness, such as their 1-mile run time.",
    "url": "https://www.businessinsider.com/ramaswamy-thinks-college-applicants-should-be-judged-on-fitness-2023-8?op=1"
  },
  {
    "text": "GOP silences ‘Tennessee Three’ Democrat on House floor for day on ‘out of order’ rule; crowd erupts  —  Republican lawmakers voted Monday to temporarily silence a Democratic member of the so-called Tennessee Three during an already tense House floor session after determining … ",
    "url": "https://apnews.com/article/tennessee-special-session-gun-control-f0af470eb6f377633735c5a1dcefa66f"
  }
]