[
  {
    "text": "House Republicans just exposed the limits of Trump's power  —  That bodes poorly for his agenda next year. … This week's installment of the long-running saga, “House Republicans cannot govern,” will soon be forgotten.  Elon Musk's decision to blow up a bipartisan agreement to keep … ",
    "url": "https://www.vox.com/politics/392278/government-shutdown-fight-spending-bill-trump-musk-house-republicans"
  },
  {
    "text": "Musk Shows Trump That He's the New Chaos in Town  —  If you haven't seen the details, the meltdown on Capitol Hill went from bad to worse this evening.  Or awesome to awesomer, depending on your perspective.  Let's review.  Donald Trump wanted a smooth ride to January 20th.",
    "url": "https://talkingpointsmemo.com/edblog/musk-shows-trump-that-hes-the-new-chaos-in-town"
  },
  {
    "text": "House GOP floats new plans to prevent government shutdown with just hours to go  —  Veering toward a midnight Friday government shutdown, House Speaker Mike Johnson is proposing a new plan that would temporarily fund federal operations and disaster aid, but punts President-elect Donald Trump demands … ",
    "url": "https://apnews.com/article/trump-government-shutdown-deadline-speaker-johnson-budget-da117337aa0c0adab34a5626bb5816af"
  },
  {
    "text": "Meet the 38 Republicans Who Defied Trump on the Spending and Debt Deal  —  The rebels are largely the most conservative lawmakers who are passionate about slashing spending and debt.  They hail from deep-red districts where a primary challenge is less of a danger.",
    "url": "https://www.nytimes.com/2024/12/20/us/politics/republican-defectors-trump.html"
  },
  {
    "text": "Backlash builds as Elon Musk endorses Germany's far right  —  Elon Musk is backing the far-right Alternative for Germany (AfD), triggering an outcry in Berlin in the run-up to a critical snap election.  —  “Only the AfD can save Germany,” the billionaire X owner wrote on the platform on Friday … ",
    "url": "https://www.politico.eu/article/elon-musk-endorses-germanys-far-right/"
  },
  {
    "text": "House GOP picks new funding plan that will need wide Democratic support  —  House Republicans have landed on their fourth plan to fund the government: Relying on Democrats to pass a bill that doesn't include a debt limit measure pushed by Donald Trump.  House Republicans voted … ",
    "url": "https://www.politico.com/live-updates/2024/12/20/congress/house-gop-moves-forward-on-new-funding-plan-00195660"
  },
  {
    "text": "Party City is going out of business  —  New York CNN  —  Party City is closing down all of its stores, ending nearly 40 years in business, CNN has learned.  —  CEO Barry Litwin told corporate employees Friday in a meeting viewed by CNN that Party City is “winding down” … ",
    "url": "https://www.cnn.com/2024/12/20/business/party-city-shut-down"
  },
  {
    "text": "2 dead, many injured after man drives into German Christmas market in suspected terror attack: report  —  A festive Christmas market in Eastern Germany erupted into chaos after a car was driven into a group of people in the city of Magdeburg on Friday in a suspected terrorist attack.",
    "url": "https://www.foxnews.com/world/car-drives-idyllic-germany-christmas-market-suspected-terrorist-attack-report"
  },
  {
    "text": "Elon Musk is becoming a one-man rogue state - it's time we reined him in  —  He has bankrolled elections, stoked riots and ignored laws.  We mustn't make the mistake of playing nice with the world's richest bully  —  Elon Musk is, more or less, a rogue state.",
    "url": "https://www.theguardian.com/commentisfree/2024/dec/20/elon-musk-is-becoming-a-one-man-rogue-state-its-time-we-reined-him-in"
  },
  {
    "text": "Louisiana forbids public health workers from promoting COVID, flu and mpox shots  —  A group of high-level managers at the Louisiana Department of Health walked into a Nov. 14 meeting in Baton Rouge expecting to talk about outreach and community events.  —  Instead, they were told … ",
    "url": "https://www.npr.org/sections/shots-health-news/2024/12/20/nx-s1-5223440/louisiana-ban-public-health-promoting-covid-flu-mpox-vaccines-landry-rfk-jr-anti-vaccine"
  },
  {
    "text": "‘It Will Be a More Robust Check on Trump Than the G.O.P. Congress’: Three Legal Experts on Trump 2.0  —  Kate Shaw, a contributing Opinion writer, hosted a written online conversation with Times Opinion columnist David French and Jack Goldsmith, a law professor at Harvard and a co-author of … ",
    "url": "https://www.nytimes.com/2024/12/20/opinion/trump-supreme-court-second-term.html"
  },
  {
    "text": "Trump Moves to Replace Officials Whom New Presidents Traditionally Leave Alone  —  Congress devised some positions to stay on during changes in administrations.  But Donald Trump has declared his intent to replace at least three.  —  President-elect Donald J. Trump has moved to install loyalists … ",
    "url": "https://www.nytimes.com/2024/12/20/us/politics/trump-replace-officials.html"
  },
  {
    "text": "Major Trump donors who complained of immigrant ‘invasion’ used Mexican workers illegally, sources allege  —  Exclusive: Experts believe the alleged ‘shuttle support’ program used by Uline - a company owned by billionaires Liz and Dick Uihlein - is likely illegal and exploitative of workers",
    "url": "https://www.theguardian.com/us-news/2024/dec/20/uline-mexican-workers-trump"
  },
  {
    "text": "Musk vows to fund ‘moderate’ Democratic primary challengers  —  Elon Musk said he'll be funding moderate primary challengers to incumbent Democrats in deep-blue seats around the country, as he continues to try to influence a wide swath of government.  “Forgot to mention that I'm also going … ",
    "url": "https://www.politico.com/live-updates/2024/12/20/congress/elon-musk-democratic-primary-challengers-00195617"
  },
  {
    "text": "Trump wants 5% Nato defence spending target, Europe told  —  US president-elect's closest foreign policy aides indicate he will continue arming Ukraine while pursuing end to war  —  Donald Trump's team has told European officials that the incoming US president will demand Nato member states … ",
    "url": "https://www.ft.com/content/35f490c5-3abb-4ac9-8fa3-65e804dd158f"
  },
  {
    "text": "Judges increasingly alarmed as Trump's Jan. 6 clemency decision nears  —  “The rewriting of the history of Jan. 6, 2021, is incredibly disturbing,” Judge Beryl Howell said.  —  U.S. District Judge Tanya Chutkan says she has often reassured police officers traumatized by the violence of Jan. 6 … ",
    "url": "https://www.politico.com/news/2024/12/20/judges-trump-jan6-clemency-warnings-00195496"
  },
  {
    "text": "White House starts scrapping pending regulations, including student debt cancellation  —  President Joe Biden is abandoning his effort to cancel student loans for more than 38 million Americans, the first step in an administration-wide plan to jettison pending regulations … ",
    "url": "https://apnews.com/article/student-loan-forgiveness-debt-cancellation-619a94aa46c4e356f6d6cf7c6fa13e32"
  },
  {
    "text": "As Musk forces a shutdown, the Trump presidency is already collapsing into chaos  —  Lies, conspiracy theories and middle-of-the-night rants are no way to run a country.  —  They're baaaack.  —  Just six weeks ago, voters elected Donald Trump by the slimmest of margins in hopes that he would lower the cost of living.",
    "url": "https://www.washingtonpost.com/opinions/2024/12/20/trump-musk-government-shutdown/"
  },
  {
    "text": "Biden Administration Weighs Putting Up Roadblocks to Trump's Deportation Campaign  —  The administration may extend protections for hundreds of thousands of immigrants whose legal status is set to expire near the start of the Trump administration.  —  The Biden administration … ",
    "url": "https://www.nytimes.com/2024/12/20/us/politics/biden-trump-deportation-protection.html"
  }
]