[
  {
    "text": "We received internal Trump documents from ‘Robert.’ Then the campaign confirmed it was hacked.  —  The campaign suggested Iran was to blame.  POLITICO has not independently verified the identity of the hacker or their motivation.  —  Former President Donald Trump's campaign said Saturday … ",
    "url": "https://www.politico.com/news/2024/08/10/trump-campaign-hack-00173503"
  },
  {
    "text": "Trump campaign says it is victim of foreign hack after leak of Vance report  —  Microsoft discovered evidence that Iranian hackers compromised the email account of a former Trump campaign adviser, a person familiar with the matter says.  —  Donald Trump's presidential campaign said on Saturday … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/10/trump-hack-iran-vance-report/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMjYyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0NjQ0Nzk5LCJpYXQiOjE3MjMyNjI0MDAsImp0aSI6ImI5ZGY3MDc4LTljZDktNGVlOC1iYmI3LTBjZGI3ODU1ZjkwNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzEwL3RydW1wLWhhY2staXJhbi12YW5jZS1yZXBvcnQvIn0.O1wwyu0W06PHqlDN03JBiBZQdzPT9glUFfi_8WHSLgE&itid=gfta"
  },
  {
    "text": "Trump's 270-Page Dossier of JD Vance's ‘Vulnerabilities’ Hacked by Iran  —  POTENTIALLY DAMAGING  —  The Trump campaign told Politico that a slew of internal documents leaked to Politico may have originated from an Iranian hacker, although these claims are unconfirmed.",
    "url": "https://www.thedailybeast.com/trumps-270-page-dossier-of-jd-vances-vulnerabilities-hacked-by-iran"
  },
  {
    "text": "Kamala Harris leads Trump in the critical swing states of Michigan, Pennsylvania, and Wisconsin, new poll says  — The Harris campaign is showing new strength in must-win states ahead of the party's convention.  — In Michigan, Pennsylvania, and Wisconsin, Harris leads Trump 50% to 46% among likely voters.",
    "url": "https://www.businessinsider.com/kamala-harris-leads-trump-michigan-pennsylvania-wisconsin-swing-state-polls-2024-8"
  },
  {
    "text": "Donald Trump Privately Rants That Kamala Harris Is a ‘B***h’ as His Polls Plunge  —  ‘I AM WHO I AM’  —  Sources close to the Republican presidential nominee say he is struggling with how to campaign against his Democratic opponent, Vice President Kamala Harris.",
    "url": "https://www.thedailybeast.com/donald-trump-rants-that-kamala-harris-is-a-bh-as-his-polls-plunge-nyt-report"
  },
  {
    "text": "Live Election Updates: Trump Tries to Curb Harris Enthusiasm After Another Big Rally  —  Vice President Kamala Harris and Gov. Tim Walz of Minnesota were in Nevada for the final rally of their tour of battleground states.  Former President Donald J. Trump tested a new attack at an event in Montana.",
    "url": "https://www.nytimes.com/live/2024/08/10/us/harris-trump-election"
  },
  {
    "text": "Trump Reportedly Refers To Harris As A ‘Bitch’ In Private  —  A New York Times report goes inside what it calls the worst three weeks of Donald Trump's presidential campaign.  —  LOADING  —  Former President Donald Trump has repeatedly called Vice President Kamala Harris a “bitch” … ",
    "url": "https://www.huffpost.com/entry/trump-reportedly-harris-bitch-private_n_66b79b0ae4b084249ca197f7"
  },
  {
    "text": "Tim Walz served his country honorably for 24 years.  JD Vance, Trump need to respect that.  He earned it  —  Following in his father's footsteps, Democratic VP nominee Tim Walz joined the Army National Guard.  He enlisted just two days after his 17th birthday",
    "url": "https://www.foxnews.com/opinion/tim-walz-served-his-country-honorably-24-years-jd-vance-trump-need-respect-that-he-earned?intcmp=tw_fnc"
  },
  {
    "text": "Recommended Reading: Captured States  —  Editor's note: a semi-regular feature here on NIDC, Recommended Reading shares links to, and offers casual commentary on, two or more related news articles in a simple rundown blog.  —  Dystopian Visions of a Fascist Future  —  “Houston, we have a problem.”",
    "url": "https://www.ninaillingworth.com/2024/08/10/recommended-reading-captured-states/"
  },
  {
    "text": "STATEMENT by Culinary Union Secretary-Treasurer Ted Pappageorge regarding the endorsement of Kamala Harris for President and Tim Walz for Vice-President:  —  FOR IMMEDIATE RELEASE:  —  MEDIA CONTACT:  —  Bethany Khan: bkhan@culinaryunion226.org ▪ (702) 387-7088",
    "url": "https://m.culinaryunion226.org/news/press/statement-endorsement-of-kamala-harris-for-president-and-tim-walz-for-vice-president"
  },
  {
    "text": "Uvalde City Officials Release Shooting Records That Provide New Details, Reaffirm Previous Reporting  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  This article is co-published with The Texas Tribune … ",
    "url": "https://www.propublica.org/article/uvalde-city-officials-release-school-shooting-records"
  },
  {
    "text": "Trump is putting mass deportations at the heart of his campaign.  Some Republicans are worried  —  Trump told Time he's considering the National Guard, and possibly the military, to target 15-20 million people  — Click to email a link to a friend (Opens in new window)",
    "url": "https://sentinelcolorado.com/nation-world/nation/trump-is-putting-mass-deportations-at-the-heart-of-his-campaign-some-republicans-are-worried/"
  },
  {
    "text": "Report: Trump calls Harris a “bitch” … Steven Cheung, Trump campaign communications director, told The Times: “That is not language President Trump has used to describe Kamala, and it's not how the campaign would characterize her.” … - At his Mar-a-Lago news conference on Thursday … ",
    "url": "https://www.axios.com/2024/08/10/trump-calls-harris-bitch-report"
  },
  {
    "text": "Gavin Newsom's office pays famed photographer $200,000 a year  —  The California governor is increasingly relying on in-house staff to showcase his accomplishments.  —  SACRAMENTO, California — Gov. Gavin Newsom has quietly hired a famed photographer — who boasts Mark Zuckerberg … ",
    "url": "https://www.politico.com/news/2024/08/09/gavin-newsom-celebrity-photographer-00173482"
  },
  {
    "text": "We're Entering an AI Price-Fixing Dystopia  —  Algorithmic price-fixing appears to be spreading to more and more industries.  And existing laws may not be equipped to stop it.  —  If you rent your home, there's a good chance your landlord uses RealPage to set your monthly payment.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/08/ai-price-algorithms-realpage/679405/"
  }
]