[
  {
    "text": "‘Unprecedented’: Launch of ‘Republicans for Harris’ causes commotion  —  Vice President Kamala Harris is scoring support not only from top Democratic leaders, but also GOP leaders, as the group, “Republicans for Harris,” officially announced its launch via social media Sunday.",
    "url": "https://www.alternet.org/republicans-for-harris/"
  },
  {
    "text": "Ex-Trump White House officials, dozens of Republicans endorse Harris … Vice President Kamala Harris' campaign on Sunday flaunted over two dozen presidential endorsements from Republican party members, including some who served in former President Donald Trump's administration.",
    "url": "https://www.cnbc.com/2024/08/04/trump-white-house-kamala-harris-election.html"
  },
  {
    "text": "Robert F. Kennedy Jr. Admits He Left a Dead Bear in Central Park  —  Mr. Kennedy, an independent presidential candidate, confessed to dropping off the bear cub 10 years ago and making it appear that a bike had hit the animal.  —  Robert F. Kennedy Jr., the independent presidential candidate … ",
    "url": "https://www.nytimes.com/2024/08/04/us/politics/robert-f-kennedy-jr-bear-central-park.html?unlocked_article_code=1.AU4.v_4C.6a8n_hnrMY7m&smid=url-share"
  },
  {
    "text": "Robert F. Kennedy Jr. posts video saying he put a young dead bear in Central Park  —  Kennedy said that The New Yorker magazine found out about the incident and asked him for confirmation.  —  Independent presidential candidate Robert F. Kennedy Jr. acknowledged Sunday that he abandoned … ",
    "url": "https://www.nbcnews.com/politics/2024-election/robert-f-kennedy-jr-posts-video-saying-put-young-dead-bear-central-par-rcna165095"
  },
  {
    "text": "What's Rattling Trump: The Size of Harris's Crowds  —  The numbers game is everything to Donald J. Trump.  Vice President Kamala Harris's first big rally appears to have gotten under his skin.  —  When former President Donald J. Trump walked onto the stage at his rally in Atlanta on Saturday … ",
    "url": "https://www.nytimes.com/2024/08/04/us/politics/whats-rattling-trump-the-size-of-harriss-crowds.html?unlocked_article_code=1.AU4.g0O8.0wAVpWOJxFO5&smid=url-share"
  },
  {
    "text": "Is Sen. Marky Kelly in or out of Harris VP search?  Posts on X stir intrigue  —  WASHINGTON — Sen. Mark Kelly, D-Ariz., posted a message on social media that seemed to imply he's not Kamala Harris' pick to serve as vice president − then deleted and replaced the post − fueling intrigue … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/04/sen-mark-kelly-stirs-intrigue-about-harris-vp-decision-with-x-posts/74668387007/"
  },
  {
    "text": "Secretaries of state urge Musk to fix AI chatbot spreading false election info  —  Grok, the AI search assistant on Musk's X platform, suggested that Kamala Harris had missed the ballot deadline in nine states.  She hasn't.  —  Five secretaries of state plan to send an open letter … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/04/secretaries-state-urge-musk-fix-ai-chatbot-spreading-false-election-info/"
  },
  {
    "text": "Elon Musk PAC being investigated by Michigan secretary of state for potential violations … A political action committee backed by billionaire Elon Musk is under investigation in Michigan amid efforts to collect voter data.  —  Musk, the CEO of Tesla and SpaceX, has said he created … ",
    "url": "https://www.cnbc.com/2024/08/04/elon-musk-pac-investigated-michigan.html"
  },
  {
    "text": "Rioters attack hotels used to house asylum seekers amid worst UK disorder in years  —  Rioters set fire and broke into hotels used to shelter asylum seekers in northern England on Sunday, as the country grapples with the worst social unrest it has seen in years.",
    "url": "https://www.cnn.com/2024/08/04/uk/uk-riots-rotherham-southport-intl/"
  },
  {
    "text": "Gorsuch on Biden Supreme Court proposals: ‘Be careful’  —  The justice said an independent judiciary “means that when you're unpopular, you can get a fair hearing.”  —  Justice Neil Gorsuch is pushing back against President Joe Biden's recent proposals to restructure the Supreme Court.",
    "url": "https://www.politico.com/news/2024/08/04/gorsuch-biden-supreme-court-proposals-00172574"
  },
  {
    "text": "ABC's Stephanopoulos Loses His Crap When Rep. Donalds Refuses to Back Off on Kamala's ‘Blackness’  —  ABC Washington correspondent and host of This Week George Stephanopoulos went down in a spectacular blaze when he tried to badger Trump surrogate and Florida Congressman Byron Donalds … ",
    "url": "https://redstate.com/streiff/2024/08/04/abcs-stephanopoulos-loses-his-crap-when-rep-donalds-refuses-to-back-off-on-kamalas-blackness-n2177730"
  },
  {
    "text": "Trump says he has ‘no choice’ but to support electric vehicles because Elon Musk ‘endorsed me very strongly’  — Trump said at a rally on Saturday that he supports electric vehicles because Elon Musk endorsed him.  — However, he also criticized EV infrastructure and Biden's EV mandates.",
    "url": "https://www.businessinsider.com/trump-electric-vehicles-elon-musk-endorsement-2024-8"
  },
  {
    "text": "The obscure Russian-linked ‘news’ outlet fuelling violence on Britain's streets  —  Channel3 Now falsely named the Southport murderer, sending conspiracy theorists and the far-Right into a tailspin.  How did this happen?  —  Before the fire and fury in Southport, there was a name - Ali Al-Shakati.",
    "url": "https://www.telegraph.co.uk/news/2024/08/03/obscure-russian-linked-news-outlet-fuelling-violence/"
  },
  {
    "text": "Scoop: Blinken told G7 Iran and Hezbollah could attack Israel in next 24 hours … - But unlike the Iranian attack against Israel on April 13 — in which Iran launched nearly 350 attack drones and missiles toward Israel, and Israel, the U.S. and their allies worked together to intercept most of them … ",
    "url": "https://www.axios.com/2024/08/05/iran-hezbollah-attack-israel-monday-blinken"
  },
  {
    "text": "Democracy dies if we drop the case of Trump, Egypt and $10 million in cash  —  America's Founders were a little unclear about a lot of stuff — we're still arguing after 233 years about just what the heck they were saying about guns in the Second Amendment — but they seemed very adamant … ",
    "url": "https://www.inquirer.com/opinion/commentary/trump-sisi-egypt-10-million-bribe-20240804.html"
  },
  {
    "text": "The NABJ interview with Trump provides a model for media coverage  —  No other sit-down this cycle has laid bare as much about the candidate.  —  The National Association of Black Journalists' invitation to former president Donald Trump to sit for an interview last Wednesday at its Chicago convention had its critics.",
    "url": "https://www.washingtonpost.com/opinions/2024/08/04/nabj-trump-interview-media-coverage/"
  }
]