[
  {
    "text": "WATCH: Stephen Miller says Trump administration is ‘actively looking at’ suspending habeas corpus  —  Stephen Miller, a top White House adviser, said the administration is looking for ways to expand its legal power to deport migrants who are in the country illegally.  —  Watch Miller's remarks in the video player above.",
    "url": "https://www.pbs.org/newshour/politics/watch-stephen-miller-says-trump-administration-is-actively-looking-at-suspending-habeas-corpus"
  },
  {
    "text": "148. Suspending Habeas Corpus  —  Welcome back to “One First,” an (increasingly frequent) newsletter that aims to make the U.S. Supreme Court more accessible to all of us.  If you're not already a subscriber, I hope you'll consider becoming one (and, if you already are … ",
    "url": "https://www.stevevladeck.com/p/148-suspending-habeas-corpus"
  },
  {
    "text": "White House considering suspending habeas corpus, Stephen Miller says  —  Stephen Miller, President Trump's top policy adviser, said Friday the White House is exploring the option of suspending habeas corpus, the constitutional provision that protects from unlawful detainment.",
    "url": "https://www.axios.com/2025/05/09/habeas-corpus-white-house"
  },
  {
    "text": "White House ‘actively looking’ at suspending habeas corpus in immigration crackdown  —  White House deputy chief of staff Stephen Miller said Friday that President Trump and his team are “actively looking at” suspending habeas corpus as part of the administration's immigration crackdown.",
    "url": "https://thehill.com/homenews/administration/5292820-white-house-miller-immigration-crackdown/"
  },
  {
    "text": "Trump Officials Consider Suspending Habeas Corpus for Detained Migrants  —  Stephen Miller, a top aide, repeated a justification used in the immigration crackdown: that the country is fighting an invasion.  But it is unclear the president has the power to take such a step.",
    "url": "https://www.nytimes.com/2025/05/09/us/trump-habeas-corpus.html"
  },
  {
    "text": "Newark's Mayor Arrested at Protest Outside ICE Detention Center  —  Ras J. Baraka and city officials have said that the lockup is operating without a valid certificate of occupancy.  Three members of Congress from New Jersey were with Mr. Baraka when he was arrested.",
    "url": "https://www.nytimes.com/2025/05/09/nyregion/newark-ice-protest-arrest-ras-baraka.html"
  },
  {
    "text": "New Jersey mayor arrested at ICE detention center where he was protesting, prosecutor says  —  Newark, N.J. AP  —  Newark Mayor Ras Baraka was arrested Friday at a federal immigration detention center where he has been protesting its opening this week, a federal prosecutor said.",
    "url": "https://cnn.com/2025/05/09/us/new-jersey-mayor-arrested-at-ice-detention-center"
  },
  {
    "text": "Judge Orders Release of Tufts Student Detained by ICE  —  The student, Rumeysa Ozturk, was being detained in Louisiana.  A federal judge said her detention threatened to chill the speech of millions of noncitizens.  —  A federal judge in Vermont ordered the Trump administration on Friday … ",
    "url": "https://www.nytimes.com/2025/05/09/us/judge-orders-government-release-tufts-student.html"
  },
  {
    "text": "Kash Patel Is Seriously Infuriating FBI Officials  —  NOT A FAN OF BRIEFINGS  —  The FBI director has canceled key intelligence briefings and upset rank-and-file by carrying a field agent badge he never earned.  —  FBI Director Kash Patel has alarmed some members of the bureau by taking … ",
    "url": "https://www.thedailybeast.com/kash-patel-is-seriously-infuriating-fbi-officials/"
  },
  {
    "text": "Trump has sat for only 12 ‘daily’ intelligence briefings since taking office  —  The scarcity of the President's Daily Briefings comes as he pursues high-stakes diplomacy with America's friends and foes.  —  Since President Donald Trump was sworn into office in January … ",
    "url": "https://www.politico.com/news/2025/05/09/trump-intelligence-briefing-frequency-00338946"
  },
  {
    "text": "Crypto Is Still for Criming  —  Yesterday “the president” announced a trade “deal” with “Britain.”  IN CASE YOU'RE WONDERING, I'M TRYING TO EMULATE TRUMP'S STYLE, WITH RANDOM QUOTATION MARKS AND BLOCK CAPITALS, PLUS EXCLAMATION POINTS AT WEIRD PLACES!  —  Anyway, as I predicted yesterday … ",
    "url": "https://paulkrugman.substack.com/p/crypto-is-still-for-criming"
  },
  {
    "text": "Trump fires 3 Democrats on Consumer Product Safety Commission  —  President Trump fired the three Democrats on the Consumer Product Safety Commission (CPSC), a White House official told The Hill, aligning with his view that the president has authority over independent agencies.",
    "url": "https://thehill.com/homenews/administration/5292326-trump-fires-dems-cpsc-reports/"
  },
  {
    "text": "Rep. Marjorie Taylor Greene says she won't run for U.S. Senate  —  Republicans, who are wary of Greene, have been looking for an alternative candidate after Georgia Gov. Brian Kemp said he wouldn't enter the Senate race.  —  Rep. Marjorie Taylor Greene, R-Ga., said definitively on Friday … ",
    "url": "https://www.nbcnews.com/politics/congress/rep-marjorie-taylor-greene-says-wont-run-us-senate-rcna205987"
  },
  {
    "text": "Exclusive: US weighs special status for Greenland as quest for island intensifies  —  U.S. officials are discussing a plan to pull Greenland into America's sphere of influence using a type of agreement that the United States has used to keep close ties with several Pacific Island nations … ",
    "url": "https://www.reuters.com/world/us-weighs-special-status-greenland-quest-island-intensifies-2025-05-09/"
  },
  {
    "text": "New FEMA head tells staff: “Don't get in my way... I will run right over you”  —  During his first all-hands meeting with agency personnel, acting Federal Emergency Management Agency Administrator David Richardson issued a striking warning: “Don't get in my way,” the former United States … ",
    "url": "https://www.cbsnews.com/news/fema-acting-administrator-david-richardson-staff-meeting/"
  },
  {
    "text": "‘Harrowing’: Video shows Worcester police hold girl's face on ground during ICE operation  —  Telemundo Nueva Inglaterra captured video of a 16-year-old girl's face being held on the ground by Worcester police officers; she and her mother were detained in an apparent ICE operation",
    "url": "https://www.nbcboston.com/news/local/harrowing-video-shows-worcester-police-hold-girls-face-on-ground-during-ice-operation/3708641/"
  },
  {
    "text": "Trump Officials Seek to Bring First White Afrikaners to U.S. as Refugees Next Week  —  The rapid relocation of the Afrikaners, who President Trump says have been racially persecuted in South Africa, stands in stark contrast to the virtual shutdown of all other refugee admissions.",
    "url": "https://www.nytimes.com/2025/05/09/world/africa/trump-afrikaner-refugees.html?unlocked_article_code=1.F08.t-lY.vzWqetLkTWYN&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "DOGE's Zombie Contracts: They Were Killed but Have Come Back to Life  —  The Times found that federal agencies have revived dozens of contracts that Elon Musk's group still publicly listed as canceled, inflating what it has saved.  —  At least 44 of the government contracts canceled … ",
    "url": "https://www.nytimes.com/2025/05/09/us/politics/doge-musk-contracts-agencies.html"
  },
  {
    "text": "Here's what we know about Trump's June 14 D.C. military parade  —  With June 14 fast approaching, President Trump's proposed military parade is yet to be finalized, but permit applications give us a glimpse into the spectacle that's expected to cost tens of millions of dollars.",
    "url": "https://www.axios.com/local/washington-dc/2025/05/09/trump-military-parade-route-concert-music"
  },
  {
    "text": "Barnard suspends WKCR and Spectator reporters who covered Butler Library protest  —  Barnard and Columbia issued interim suspensions Thursday afternoon to four student journalists who covered a Wednesday pro-Palestinian protest in Butler Library, citing “information received” … ",
    "url": "https://www.columbiaspectator.com/news/2025/05/09/barnard-suspends-wkcr-and-spectator-reporters-who-covered-butler-library-protest/"
  },
  {
    "text": "Trump to Tap McKernan for Domestic Finance Role at Treasury  —  President Donald Trump intends to nominate attorney Jonathan McKernan as the Treasury Department's head of domestic finance, a surprise move given he was previously tapped to run the Consumer Financial Protection Bureau.",
    "url": "https://www.bloomberg.com/news/articles/2025-05-09/trump-to-nominate-mckernan-for-domestic-finance-role-at-treasury"
  },
  {
    "text": "White House to take choice of Pentagon chief of staff out of Hegseth's hands  —  Exclusive: The intervention to marginalize Ricky Buria is aimed at insulating the Pentagon from any more missteps  —  Exasperated by the turmoil that has dogged Pete Hegseth's office in recent weeks … ",
    "url": "https://www.theguardian.com/us-news/2025/may/09/white-house-pentagon-hegseth-chief-of-staff"
  },
  {
    "text": "USDA, DOGE demand states hand over personal data about food stamp recipients  —  The Department of Agriculture is demanding states hand over personal data of food assistance recipients — including Social Security numbers, addresses and, in at least one state, citizenship status … ",
    "url": "https://www.npr.org/2025/05/09/nx-s1-5389952/usda-snap-doge-data-immigration"
  },
  {
    "text": "Colbert Was Sold on Pope Leo by a Single Tweet About JD Vance  —  X CATHEDRA  —  Pope Leo's posts on X have captured the attention of commentators, including the ‘Late Show’ host.  —  Stephen Colbert was won over by the newly elected Pope Leo XIV in no time.",
    "url": "https://www.thedailybeast.com/stephen-colbert-was-sold-on-pope-leo-by-a-single-tweet-about-jd-vance/"
  },
  {
    "text": "Texas Senate passes bill requiring solar plants to provide power at night  —  The Texas Senate passed a bill Thursday that leading business interests fear would lead to an age of expensive power and rolling blackouts.  —  If passed by the House, state S.B. 715 would require all renewable projects … ",
    "url": "https://thehill.com/policy/equilibrium-sustainability/5292792-texas-senate-bill-power-cost/"
  }
]