[
  {
    "text": "U.S. Inflation Accelerated in June as Trump's Tariffs Pushed Up Prices  —  The Consumer Price Index rose 2.7 percent from a year ago, as the global trade war started to bite.  —  Inflation accelerated in June as President Trump's tariffs started to leave a bigger imprint on the economy … ",
    "url": "https://www.nytimes.com/2025/07/15/business/cpi-report-inflation-june.html?unlocked_article_code=1.Wk8.MJtl.X16STPLfsGj_&smid=tw-share"
  },
  {
    "text": "Inflation Picks Up to 2.7% as Tariffs Start to Seep Into Prices  —  Prices were up for furniture, clothing and other tariff-sensitive items  —  Inflation picked up in June, a potential sign that companies are starting to pass tariff costs on to consumers.  —  Consumer prices rose 2.7% … ",
    "url": "https://www.wsj.com/economy/inflation-hit-2-7-in-june-in-line-with-expectations-8f92a8cd?st=e76k8B&reflink=article_copyURL_share"
  },
  {
    "text": "The tariff-driven inflation that economists feared begins to emerge  —  Inflation rose last month to its highest level since February as President Donald Trump's sweeping tariffs push up the cost of a range of goods, including furniture, clothing, and large appliances.",
    "url": "https://apnews.com/article/inflation-trump-fed-powell-prices-8842d6ebca9d1870983e678e578d2091"
  },
  {
    "text": "Donald Trump asked Volodymyr Zelenskyy if Ukraine could hit Moscow, say people briefed on call  —  US president encouraged Ukrainian leader to step up deep strikes on Russia  —  Christopher Miller in Kyiv, Henry Foy in Brussels and Max Seddon in Berlin  —  Donald Trump has privately encouraged Ukraine … ",
    "url": "https://www.ft.com/content/b66f03b5-e295-4f8c-92ba-516a527d588c"
  },
  {
    "text": "The IRS Is Building a Vast System to Share Millions of Taxpayers' Data With ICE  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  The Internal Revenue Service is building a computer program … ",
    "url": "https://www.propublica.org/article/trump-irs-share-tax-records-ice-dhs-deportations"
  },
  {
    "text": "ICE Lawyers Are Hiding Their Names in Immigration Court  —  ICE attorneys fighting to deport immigrants are able to obscure their identities — no masks required.  —  INSIDE A FEDERAL immigration courtroom in New York City last month, a judge took an exceedingly unusual step … ",
    "url": "https://theintercept.com/2025/07/15/ice-lawyers-hiding-names-court/"
  },
  {
    "text": "House GOP blocks second Dem attempt to release Epstein files  —  House Republicans on Tuesday voted down another Democratic procedural maneuver aimed at forcing the Justice Department to release documents related to Jeffrey Epstein. … - Democrats are already promising future votes … ",
    "url": "https://www.axios.com/2025/07/15/epstein-house-democrats-republicans-trump-doj"
  },
  {
    "text": "Global AIDS funding to be pulled from Trump clawbacks request  —  Senate Republicans will scale back the White House's $9.4 billion spending clawback request as they look to shore up their vote count.  Sen. Eric Schmitt (R-Mo.), who is leading the rescissions effort in concert with the White House … ",
    "url": "https://www.politico.com/live-updates/2025/07/15/congress/pepfar-rescissions-amendment-00454275"
  },
  {
    "text": "Trump is flunking his Epstein test  —  For years he insisted on a deep-state plot that only he could expose.  Now he says there is nothing to show  —  Cult loyalty is blind until it isn't.  Donald Trump's populist truth test now seems to be at hand.  Whether or not the “Epstein files” exist is secondary.",
    "url": "https://www.ft.com/content/4d7e000a-67ab-4585-a485-63588424381f"
  },
  {
    "text": "Irish tourist jailed by Ice for months after overstaying US visit by three days: ‘Nobody is safe’  —  Exclusive: For roughly 100 days, Thomas says he faced harsh detention conditions, despite agreeing to deportation  —  Thomas, a 35-year-old tech worker and father of three from Ireland … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/15/irish-tourist-ice-detention"
  },
  {
    "text": "Lead investigator into Biden's use of an autopen signed letters with a digital signature  —  House Oversight Committee Chair Rep. James Comer, R-Ky., used a digital signature to send out letters and subpoena notices related to the Biden autopen investigation.",
    "url": "https://www.nbcnews.com/politics/congress/lead-investigator-james-comer-biden-autopen-digital-signature-rcna216719"
  },
  {
    "text": "The Trump Administration Is About to Incinerate 500 Tons of Emergency Food  —  Federal workers warned for months that the high-energy biscuits would go to waste.  —  Five months into its unprecedented dismantling of foreign-aid programs, the Trump administration has given the order … ",
    "url": "https://www.theatlantic.com/health/archive/2025/07/usaid-emergency-food-incinerate-trump/683532/?gift=hVZeG3M9DnxL4CekrWGK34UoPtkCxvKSW-rp40Qt1-Q&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "More than 75 former judges urge Senate committee to reject Trump judicial nominee Emil Bove  —  More than 75 former federal and state judges on Tuesday called on the Senate Judiciary Committee to reject the nomination of Emil Bove, President Donald Trump's former personal attorney, to a prestigious appeals court judgeship.",
    "url": "https://cnn.com/2025/07/15/politics/emil-bove-former-judges-reject-trump-judicial-nominee"
  },
  {
    "text": "The FBI's Jeffrey Epstein Prison Video Had Nearly 3 Minutes Cut Out  —  Metadata from the “raw” Epstein prison video shows approximately 2 minutes and 53 seconds were removed from one of two stitched-together clips.  The cut starts right at the “missing minute.”",
    "url": "https://www.wired.com/story/the-fbis-jeffrey-epstein-prison-video-had-nearly-3-minutes-cut-out/"
  },
  {
    "text": "Federal agents describe unusual run-up to arrests of Pro-Palestinian academics … The agents appeared as witnesses for the government at an ongoing trial in Boston on a lawsuit claiming the Trump administration is implementing an “ideological deportation policy” that targets non-citizens … ",
    "url": "https://www.politico.com/news/2025/07/15/pro-palestinian-academics-deportations-trial-00454324"
  },
  {
    "text": "The Enshittification of American Power  —  First Google and Facebook, then the world.  Under Trump 2.0, US statecraft is starting to mimic the worst tendencies of Big Tech.  —  For decades, allies of the United States lived comfortably amid the sprawl of American hegemony.",
    "url": "https://www.wired.com/story/enshittification-of-american-power/"
  },
  {
    "text": "Elizabeth Warren Exposes All The Corporate Money Flowing To Trump's Presidential Library  —  Paramount, Meta and X are among the companies giving tens of millions of dollars to Trump's future library as they seek perks from his administration.  —  WASHINGTON — Companies hoping … ",
    "url": "https://www.huffpost.com/entry/elizabeth-warran-donald-trump-presidential-library-bribery_n_68766871e4b0eefef0c4f890"
  },
  {
    "text": "For MAGA, Ignorance is Strength  —  Research cuts aren't about shrinking government, they're about killing science  —  I start almost every morning the same way.  First I start the coffee brewing.  Then I feed Jack, our cat.  Then I fire up the weather app on my phone, to help plan my day.",
    "url": "https://paulkrugman.substack.com/p/for-maga-ignorance-is-strength"
  },
  {
    "text": "DOJ urges Supreme Court to turn away Epstein accomplice Ghislaine Maxwell's appeal  —  The former Jeffrey Epstein associate is currently serving a 20-year sentence.  —  Jeffrey Epstein and Ghislaine Maxwell attend de Grisogono Sponsors The 2005 Wall Street Concert Series Benefitting Wall Street Rising … ",
    "url": "https://abcnews.go.com/US/doj-urges-supreme-court-turn-epstein-accomplice-ghislaine/story?id=123752067"
  },
  {
    "text": "Workers at the CFPB watch hopelessly as the GOP undoes the work they did to help consumers  —  The lights are on at the Consumer Financial Protection Bureau across the street from the White House, and employees still get paid.  But, in practice, the bureau has been mostly inoperable for nearly six months.",
    "url": "https://apnews.com/article/cfpb-vought-trump-rohit-chopra-banks-consumers-fef24aa0d7fdf46967df8041586743bd"
  },
  {
    "text": "Dismissals at Justice Dept. Would Bypass Civil Service and Whistle-Blower Laws  —  In court filings and dismissal letters, the Justice Department's political leadership claims sweeping authority to fire career law enforcement officials without cause.  —  The Justice Department is accelerating … ",
    "url": "https://www.nytimes.com/2025/07/15/us/politics/justice-department-dismissals-civil-service-laws.html"
  },
  {
    "text": "I'm a Genocide Scholar.  I Know It When I See It.  —  A month after the Hamas attack on Israel on Oct. 7, 2023, I believed there was evidence that the Israeli military had committed war crimes and potentially crimes against humanity in its counterattack on Gaza.",
    "url": "https://www.nytimes.com/2025/07/15/opinion/israel-gaza-holocaust-genocide-palestinians.html?unlocked_article_code=1.Wk8.qHnC.tm-Sl4pqA4ez&smid=url-share"
  },
  {
    "text": "Mike Waltz faces grilling over Signal chat at Senate hearing for UN ambassador role  —  Mike Waltz told lawmakers Tuesday at his confirmation hearing to be U.S. ambassador to the United Nations that he plans to make the world body “great again,” echoing President Donald Trump's message for revamping America.",
    "url": "https://apnews.com/article/waltz-trump-signal-united-nations-ambassador-14e98e2f6326877083a19f15992b8e54"
  },
  {
    "text": "Bessent Suggests Powell Should Leave Fed Board in May  —  US Treasury Secretary Scott Bessent suggested that Federal Reserve Chair Jerome Powell should step down from the central bank's board when his term as chair is up in May 2026.  —  “Traditionally, the Fed chair also steps down as a governor … ",
    "url": "https://www.bloomberg.com/news/articles/2025-07-15/bessent-says-formal-process-for-powell-succcessor-has-started"
  },
  {
    "text": "GOP Wrecking Ball Slams Through Medical System  —  Hospitals are shutting down, slashing programs, and laying off staff.  And the worst parts of the spending law haven't even hit yet.  —  Demonstrators protest President Donald Trump's tax breaks and spending cuts package, June 30, 2025, outside the U.S. Capitol in Washington.",
    "url": "https://prospect.org/health/2025-07-15-gop-wrecking-ball-slams-through-medical-system/"
  }
]