[
  {
    "text": "Iowa Poll shows Nikki Haley leads Ron DeSantis in Iowa Caucuses.  Donald Trump far ahead  —  Although Nikki Haley has pulled ahead of Ron DeSantis, the Iowa Poll shows clear dangers lurk for her going into a caucus night that could be decided by Iowans' willingness to brave the bitter cold",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2024/01/13/iowa-poll-nikki-haley-leads-ron-desantis-ahead-of-republican-caucus-night-big-lead-for-donald-trump/72216523007/"
  },
  {
    "text": "Trump aims to break caucus records, but Iowa sometimes surprises  —  The former president is the heavy favorite, zapping some suspense ahead of Monday's Iowa caucuses, but Nikki Haley and Ron DeSantis are angling for a surprise showing.  —  DES MOINES — Donald Trump's expected march … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/13/trump-iowa-caucuses-republican-records/"
  },
  {
    "text": "Trump maintains wide lead in Iowa poll, while Haley climbs to second  —  Former president Donald Trump is polling at 48 percent in Iowa, maintaining his wide lead over his two main rivals for the Republican presidential nomination, according to the Des Moines Register/NBC News/Mediacom poll released Saturday night.",
    "url": "https://www.washingtonpost.com/politics/2024/01/13/iowa-poll-trump-haley-desantis/"
  },
  {
    "text": "Scoop: John Kerry to leave Biden administration, help campaign  —  John Kerry, the U.S. special presidential envoy for climate, will leave the administration later this winter, and plans to help President Biden's campaign, Axios has learned. … - Kerry is working with White House Chief … ",
    "url": "https://www.axios.com/2024/01/13/john-kerry-biden-campaign-climate-2024"
  },
  {
    "text": "John Kerry to step down as top U.S. climate change negotiator  —  The U.S. special climate envoy, who turned 80 last year, is expected to depart from the Biden administration by the spring  —  John F. Kerry, who has served as the U.S. special climate envoy for nearly three years … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/13/john-kerry-resigns-climate-change-envoy/"
  },
  {
    "text": "Trump Uses Mobster-Turned-Rat as Character Witness  —  The former president suggested two presiding justices could learn ethics from ex-mobster Sammy the Bull.  —  Donald Trump would like to thank former mob boss Salvatore Gravano aka “Sammy the Bull” for his support.",
    "url": "https://www.thedailybeast.com/trump-uses-mob-boss-sammy-the-bull-gravano-as-character-witness-on-truth-social"
  },
  {
    "text": "Ban on guns in post offices is unconstitutional, US judge rules  —  A federal judge in Florida on Friday ruled that a U.S. law that bars people from possessing firearms in post offices is unconstitutional, citing a landmark U.S. Supreme Court ruling from 2022 that expanded gun rights.",
    "url": "https://www.reuters.com/world/us/ban-guns-post-offices-is-unconstitutional-us-judge-rules-2024-01-13/"
  },
  {
    "text": "Multiple earthquakes hit Oklahoma City metro area, including 2 of 4.4 magnitude  —  No damage or injuries have been reported so far.  —  This map from the USGS shows the epicenter of an earthquake near Oklahoma City on Jan 13, 2024.  —  A series of earthquakes struck Oklahoma Friday evening … ",
    "url": "https://abcnews.go.com/US/multiple-earthquakes-hit-oklahoma-city-metro-area-including/story?id=106349469"
  },
  {
    "text": "White House staff ‘relocated’ after pro-Palestinian rioters damage anti-scale fencing, hurl objects at cops  —  Anti-Israel protesters and rioters gathered outside the White House on Saturday night, with some demonstrators damaging security fencing and hurling objects at police.",
    "url": "https://www.foxnews.com/politics/white-house-staff-relocated-pro-palestinian-rioters-damage-exterior-fencing-hurl-objects-cops"
  },
  {
    "text": "Congress readies ‘laddered’ March funding patch as shutdown looms  —  House and Senate leadership are both backing the plan, despite Speaker Mike Johnson's earlier dismissal of the idea of clearing another short-term extension.  —  Congressional leaders will move next week to pass … ",
    "url": "https://www.politico.com/news/2024/01/13/congress-readies-laddered-march-funding-patch-as-shutdown-looms-00135476"
  },
  {
    "text": "Taiwan voters dismiss China warnings and hand ruling party a historic third consecutive presidential win  —  Taiwan's ruling Democratic Progressive Party pulled off a historic third consecutive presidential victory on Saturday as voters shrugged off warnings by China that their re-election would increase the risk of conflict.",
    "url": "https://www.cnn.com/2024/01/13/asia/taiwan-presidential-election-results-intl-hnk"
  },
  {
    "text": "Tom Shales, Pulitzer-winning TV critic of fine-tuned wit, dies at 79  —  He spent nearly 40 years writing for The Washington Post and was known for his incisive and barbed commentary  —  Tom Shales, a Pulitzer Prize-winning television critic for The Washington Post who brought incisive … ",
    "url": "https://www.washingtonpost.com/obituaries/2024/01/13/tom-shales-washington-ppost-tv-critic-obituary-dead/"
  },
  {
    "text": "Remarks by President Biden Before Marine One Departure  —  Q    Mr. President, do you have a reaction to the Taiwan election?  —  THE PRESIDENT:  We do not support independence.  (Inaudible.)  —  Q    Mr. President, would you call the situation on the southern border a “crisis”?",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2024/01/13/remarks-by-president-biden-before-marine-one-departure-41/"
  },
  {
    "text": "Wenstrup Issues Key Takeaways from Interview with Dr. Francis Collins  —  WASHINGTON — Select Subcommittee on the Coronavirus Pandemic Chairman Brad Wenstrup (R-Ohio) released key takeaways after the Select Subcommittee's seven-hour transcribed interview with Dr. Francis Collins … ",
    "url": "https://oversight.house.gov/release/wenstrup-issues-key-takeaways-from-interview-with-dr-francis-collins/"
  },
  {
    "text": "Donald Trump ordered to pay The New York Times and its reporters nearly $400,000 in legal fees  —  Former President Donald Trump was ordered Friday to pay nearly $400,000 in legal fees to The New York Times and three investigative reporters after he sued them unsuccessfully … ",
    "url": "https://apnews.com/article/trump-new-york-times-taxes-lawsuit-slapp-f39342501d9a2a5cfd36181f9f336215"
  }
]