[
  {
    "text": "Trump Gutted Key Aviation Safety Committee Before D.C. Plane Crash  —  Last week, just days after his inauguration, Donald Trump eliminated the membership of a key committee that handles aviation security.  And on Wednesday night,  a passenger plane collided with a military helicopter in the Washington, D.C., area.",
    "url": "https://newrepublic.com/post/190934/trump-aviation-safety-committee-dc-plane-crash"
  },
  {
    "text": "Live updates: Plane crashes into Potomac River after collision with helicopter near Reagan National Airport  —  A regional jet collided in midair with a helicopter while on approach to Reagan Washington National Airport around 9 p.m., the FAA said Wednesday evening in a preliminary update.",
    "url": "https://www.nbcnews.com/news/us-news/live-blog/live-updates-plane-crashes-potomac-river-collision-helicopter-reagan-n-rcna189942"
  },
  {
    "text": "Plane crashes in D.C.'s Potomac River with 64 on board after midair collision with Army helicopter — live updates  —  What to know about the Washington, D.C., plane crash  — Search efforts continue in the Potomac River after an American Airlines plane with 60 passengers and four crew … ",
    "url": "https://www.cbsnews.com/live-updates/plane-crash-dc-helicopter-potomac-river/"
  },
  {
    "text": "Inside 45 hours of chaos: The brief life and quick death of Trump's federal spending freeze  —  The Trump administration's biggest swing at radically reshaping federal spending lasted just under 45 hours.  —  A sweeping freeze on trillions in federal spending for grants and loans … ",
    "url": "https://www.cnn.com/2025/01/29/politics/inside-brief-life-trump-federal-spending-freeze/"
  },
  {
    "text": "Trump criticizes FAA diversity efforts after deadly plane crash, even as he says he doesn't know the cause yet  — Trump suggested on Thursday that diversity initiatives at the FAA led to a plane crash near DC.  — The president said he was offering a series of “very strong opinions and ideas” on what happened.",
    "url": "https://www.businessinsider.com/trump-faa-diversity-initiatives-biden-plane-crash-2025-1"
  },
  {
    "text": "FAA Chief Quit on Jan. 20 After Elon Musk Told Him to Resign  —  The Federal Aviation Administration's leader stepped down on Jan. 20, months after Elon Musk demanded that he quit.The move by Michael Whitaker means the FAA has no Senate-confirmed leader for one of the biggest crises in its history … ",
    "url": "https://www.thedailybeast.com/faa-chief-michael-whitaker-quit-on-jan-20-after-elon-musk-told-him-to-resign/"
  },
  {
    "text": "FAA Administrator Quit on Jan. 20 After Elon Musk Told Him to Resign  —  The Federal Aviation Administration's leader stepped down on Jan. 20, months after Elon Musk demanded that he quit.  —  The move by Michael Whitaker means the FAA has no Senate-confirmed leader for one of the biggest crises … ",
    "url": "https://www.yahoo.com/news/faa-administrator-quit-jan-20-045322293.html"
  },
  {
    "text": "In Tense Call, Governors Push Schumer to Fight Harder Against Trump  —  On a call with Senator Chuck Schumer, the minority leader, six Democratic governors pushed him to slow down the confirmation of President Trump's nominees and to do more to block his agenda.",
    "url": "https://www.nytimes.com/2025/01/29/us/politics/chuck-schumer-trump-agenda-cabinet.html?unlocked_article_code=1.tE4.uTbf.cKtvP65o9Anu&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Democrats to boycott committee vote on OMB nominee  —  Democrats on the Senate Budget Committee say they will boycott Thursday's scheduled vote on Russ Vought's nomination to lead the Office of Management and Budget.  It won't affect the panel's ability to send Vought's nomination to the Senate floor … ",
    "url": "https://www.politico.com/live-updates/2025/01/30/congress/democrats-vought-omb-funding-freeze-00201526"
  },
  {
    "text": "People on Kash Patel's so-called ‘enemies list’ taking drastic steps for protection before his potential FBI takeover  —  One of the people on Kash Patel's list of “corrupt actors” from the “deep state” is taking the drastic step of moving their family before Patel's potential confirmation to lead the FBI.",
    "url": "https://www.cnn.com/2025/01/30/politics/kash-patel-critics-fbi-takeover/"
  },
  {
    "text": "Former USDA Inspector General Defies Trump Order, Escorted from Her Office  —  Security agents escorted the inspector general of the U.S. Department of Agriculture out of her office on Monday after she refused to comply with her dismissal by the Trump administration, according to Reuters.",
    "url": "https://www.newsweek.com/former-usda-inspector-general-defies-trump-order-escorted-her-office-2023069"
  },
  {
    "text": "Alexandria Ocasio-Cortez lays out battle plan against ‘shockingly dim’ Trump White House  —  The Trump White House this week sparked chaos across the nation when it issued an executive order that resulted in Medicaid portals getting shut down in all 50 states.",
    "url": "https://www.rawstory.com/alexandria-ocasio-cortez-2671031806/"
  },
  {
    "text": "Trump's Inaugural Approval Rating Is Historically Low Again  —  Americans divided over whether Trump's pace in addressing major U.S. problems is about right or too fast  —  WASHINGTON, D.C. — At 47%, President Donald Trump's initial job approval rating for his second term is similar … ",
    "url": "https://news.gallup.com/poll/655955/trump-inaugural-approval-rating-historically-low-again.aspx"
  },
  {
    "text": "Despite media reports, Trump has not offered federal employees a “buyout”  —  Anyone who has read reports in the Associated Press, the New York Times, CBS News, CNN, USA Today, the Los Angeles Times, NBC News, or Axios would be under the impression that the Trump administration … ",
    "url": "https://popular.info/p/despite-media-reports-trump-has-not"
  },
  {
    "text": "To Pay for Trump Tax Cuts, House GOP Floats Plan to Slash Benefits for the Poor and Working Class  —  A menu of options being circulated by congressional Republicans also includes new tax cuts for corporations and the ultrawealthy.  —  One of the hallmarks of Donald Trump's presidential campaign … ",
    "url": "https://www.propublica.org/article/trump-tax-cuts-congress-republicans-plan-slash-benefits"
  },
  {
    "text": "Criminal records of Jan. 6 rioters pardoned by Trump include rape, domestic violence  —  Editor's Note: This story includes descriptions of violent crimes and sexual abuse involving both adults and children that may be disturbing to readers.  —  On his first day in office … ",
    "url": "https://www.npr.org/2025/01/30/nx-s1-5276336/donald-trump-jan-6-rape-assault-pardons-rioters"
  },
  {
    "text": "See what Tulsi Gabbard deleted from her Senate Intel opening remarks … - The opening remarks Gabbard first provided to the Senate Intelligence Committee included lines later removed from the final version that she delivered at Thursday's hearing, according to both copies obtained by Axios.",
    "url": "https://www.axios.com/2025/01/30/tulsi-gabbard-senate-intel-opening-remarks-changes"
  },
  {
    "text": "Ogles: ‘Did DEI play a role’ in fatal DC plane crash?  —  Rep. Andy Ogles (R-Tenn.) is questioning whether diversity, equity and inclusion (DEI) played a role in the fatal plane crash at Reagan Washington National Airport outside of Washington, D.C.  —  Ogles, in an interview … ",
    "url": "https://thehill.com/homenews/house/5116066-andy-ogles-dei-role-dca-crash/"
  },
  {
    "text": "Tulsi Gabbard refuses to call Edward Snowden a “traitor” … “So, was Edward Snowden a traitor?”  — Gabbard would not give a yes or no answer, saying only that she is “committed if confirmed as Director of National Intelligence to join you in making sure that there is no future Snowden-type leak.”",
    "url": "https://www.axios.com/2025/01/30/tulsi-gabbard-edward-snowden-traitor"
  },
  {
    "text": "Small airplane down in Potomac River near Ronald Reagan National Airport  —  A small aircraft is down in the Potomac River near Ronald Reagan Washington National Airport and fireboats were on the scene, the Washington fire department said.  —  The airport said late on Wednesday that all takeoffs … ",
    "url": "https://www.reuters.com/world/us/takeoffs-landings-halted-ronald-reagan-national-airport-after-aircraft-incident-2025-01-30/"
  },
  {
    "text": "Franklin County woman pardoned for Capitol riot is sentenced to 10 years in fatal crash  —  UNION, Mo. — The Franklin County woman pardoned for her participation in the U.S. Capitol insurrection on Jan. 6, 2021 was sentenced Wednesday to 10 years in prison for her role in a fatal drunk driving crash.",
    "url": "https://www.stltoday.com/news/local/crime-courts/emily-hernandez-pardoned-for-capitol-riot-sentenced-to-17-years-in-fatal-dwi-crash/article_bf4def6e-de51-11ef-a3a0-97de6fd4bd53.html"
  },
  {
    "text": "RFK Jr. Says Trump Gave Him 1 Directive On The Abortion Pill  —  The drugs are used for 63% of abortion care and have been widely deemed safe by scientists.  —  LOADING  —  Abortion came up several times during the first of Robert F. Kennedy Jr.'s confirmation hearings for health secretary … ",
    "url": "https://www.huffpost.com/entry/rfk-jr-will-study-the-safety-of-abortion-pill-on-trumps-orders_n_679a71e5e4b0c5507e4ae06e"
  },
  {
    "text": "Pentagon agency pauses celebrations for Martin Luther King Jr. Day, Black History Month and more  —  The Defense Department's intelligence agency has paused observances of Martin Luther King Jr. Day, Pride Month, Holocaust Days of Remembrance and other cultural or historical annual events … ",
    "url": "https://apnews.com/article/trump-holiday-mlk-day-pride-black-hispanic-dei-047bbdbfc12ea6e9a9731f5861d84e70"
  },
  {
    "text": "Trump Administration's Halt of CDC's Weekly Scientific Report Stalls Bird Flu Studies  —  The Trump administration has intervened in the release of important studies on the bird flu, as an outbreak escalates across the United States.  —  One of the studies would reveal whether veterinarians … ",
    "url": "https://kffhealthnews.org/news/article/cdc-trump-mmwr-bird-flu-studies-blocked-meddling/"
  }
]