[
  {
    "text": "House Republicans fume over “messaging” votes … - Rep. Troy Nehls (R-Texas) said he is moving his “focus to the presidential election.”  — “I think it's fair to say we've been frustrated for the past several months,” Nehls said.  — “This place is dysfunctional, unfortunately,” he added.",
    "url": "https://www.axios.com/2024/04/12/house-republicans-anger-messaging-votes"
  },
  {
    "text": "Judge rejects Hunter Biden's bid to dismiss the federal gun charges against him  —  The judge denied all of Biden's attempts to have the case thrown out.  —  The federal judge overseeing a case involving gun charges against Hunter Biden rejected efforts by the president's son to have the case dismissed.",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-rejects-hunter-bidens-bid-dismiss-federal-gun-charges-rcna147675"
  },
  {
    "text": "Judge rejects defense efforts to dismiss Hunter Biden's federal gun case  —  WASHINGTON (AP) — A federal judge in Delaware refused Friday to throw out a federal gun case against Hunter Biden, rejecting the president's son's claim that he is being prosecuted for political purposes as well as other arguments.",
    "url": "https://apnews.com/article/hunter-biden-dismiss-federal-gun-case-ccc77cf35e8c2626edd3d94479abe3ec"
  },
  {
    "text": "Trump tries to boost support for Truth Social as DJT stock tanks … Donald Trump on Friday urged his followers to support his social media app Truth Social, as its parent company's stock continues to sink lower.  —  Trump in a post on that app said he believes Truth Social embodies the political … ",
    "url": "https://www.cnbc.com/2024/04/12/trump-tries-to-boost-support-for-truth-social-as-his-media-stock-tanks.html"
  },
  {
    "text": "Judge declines to delay Trump's NY hush money trial over complaints of pretrial publicity  —  Trump the defendant and 2024 presidential candidate aims to campaign at New York hush money trial  —  The judge in Donald Trump's hush money criminal case on Friday turned down the former president's request … ",
    "url": "https://apnews.com/article/trump-hush-money-trial-4c79619c5e89e13d672e070a4244a302"
  },
  {
    "text": "Exclusive: Google Contract Shows Deal With Israel Defense Ministry  —  Google provides cloud computing services to the Israeli Ministry of Defense, and the tech giant has negotiated deepening its partnership during Israel's war in Gaza, a company document viewed by TIME shows.",
    "url": "https://time.com/6966102/google-contract-israel-defense-ministry-gaza-war/"
  },
  {
    "text": "Belgium investigating Russian influence network suspected of paying EU lawmakers  —  The Belgian federal prosecutor has opened an investigation into EU lawmakers accused of receiving payments for spreading pro-Russian propaganda.  —  Prime Minister Alexander De Croo told reporters on Friday … ",
    "url": "https://www.euronews.com/my-europe/2024/04/12/belgium-investigating-russian-influence-network-suspected-of-paying-eu-lawmakers"
  },
  {
    "text": "Biden Shrinks Trump's Edge in Latest Times/Siena Poll  —  The president's popularity has ticked up slightly, though voters still view Donald J. Trump more favorably and have dour views of the economy.  —  President Biden has nearly erased Donald J. Trump's early polling advantage … ",
    "url": "https://www.nytimes.com/2024/04/13/us/politics/trump-biden-times-siena-poll.html"
  },
  {
    "text": "No, “convenience” isn't the problem (permalink)  —  Using Amazon, or Twitter, or Facebook, or Google, or Doordash, or Uber doesn't make you lazy.  Platform capitalism isn't enshittifying because you made the wrong shopping choices.  —  Remember, the reason these corporations were able … ",
    "url": "https://pluralistic.net/2024/04/12/give-me-convenience/#or-give-me-death"
  },
  {
    "text": "Trump holds Mar-a-Lago joint appearance with Johnson amid speakership threat  —  The meeting comes days after Trump helped spike the Johnson-backed FISA bill.  —  Republican presidential candidate former President Donald Trump speaks as Speaker of the House Mike Johnson, listens during a news conference … ",
    "url": "https://abcnews.go.com/Politics/trump-mar-lago-joint-appearance-speaker-johnson/story?id=109134980"
  },
  {
    "text": "‘The Golden Bachelor’ Divorce Has Killed My Belief in Love  —  Did Gerry Turner and Theresa Nist just dismantle the whole point “The Golden Bachelor” tried to prove?  —  Like the rest of groggily caffeinating America, this morning I woke up to the wild news that Gerry Turner and Theresa Nist … ",
    "url": "https://www.thedailybeast.com/obsessed/the-golden-bachelor-divorce-has-killed-my-belief-in-love"
  },
  {
    "text": "US Steel shareholders approve takeover by Japan's Nippon Steel opposed by Biden administration  —  U.S. Steel shareholders have overwhelmingly approved the company's sale to Nippon Steel of Japan for $14.1 billion in cash, voicing unequivocal support for a combination that has drawn opposition … ",
    "url": "https://apnews.com/article/us-nippon-steel-takeover-aa6075aabe046f86350f7df4e009cde6"
  },
  {
    "text": "Republicans aim to stop noncitizen voting in federal elections.  It's already illegal  —  Former President Donald Trump and House Speaker Mike Johnson, R-La., appeared together Friday to tout legislation aimed at stopping something that is already illegal in America: noncitizens voting in federal elections.",
    "url": "https://npr.org/2024/04/12/1244302080/trump-johnson-noncitizen-voting-bill"
  },
  {
    "text": "Pence's second act: Former VP will teach about Christianity in public institutions at Pennsylvania college  —  Former Vice President Mike Pence has found his first official job since dropping out of the 2024 Republican presidential primaries, and will be teaching at a private college in Pennsylvania.",
    "url": "https://www.washingtonexaminer.com/policy/education/2964757/pences-second-act-former-vp-will-teach-about-christianity-in-public-institutions-at-pennsylvania-college/"
  },
  {
    "text": "If Trump wins, he plans to free Wall Street from ‘burdensome regulations’  —  A second Trump White House would seek to sharply reduce the power of U.S. financial regulators, according to a review of public documents and interviews with people allied with the former president.",
    "url": "https://www.reuters.com/markets/us/if-trump-wins-he-plans-free-wall-street-burdensome-regulations-2024-04-12/"
  },
  {
    "text": "Why the California Journalism Preservation Act is putting support of the news ecosystem at risk  —  A pending bill in the California state legislature, the California Journalism Preservation Act (CJPA), would create a “link tax” that would require Google to pay for simply connecting Californians to news articles.",
    "url": "https://blog.google/products/news/california-journalism-preservation-act-puts-news-ecosystem-at-risk/"
  },
  {
    "text": "Iranian Attack Expected on Israel in Next Two Days  —  Israel is preparing for an imminent direct attack from Iran; Tehran yet to decide, says person briefed on the matter  —  TEL AVIV—Israel is preparing for a direct attack from Iran on southern or northern Israel as soon as Friday or Saturday … ",
    "url": "https://www.wsj.com/world/middle-east/iranian-attack-expected-on-israel-in-next-two-days-42b0537c"
  }
]