[
  {
    "text": "Tommy Tuberville On Alabama Deeming Embryos Children: Great!  Wait, Bad!  —  In the span of three minutes, the GOP senator said he was “all for it,” didn't agree with it, supports IVF and just needs to read the bill.  (There is no bill.)  —  LOADING  —  NATIONAL HARBOR, Md. … ",
    "url": "https://www.huffpost.com/entry/tommy-tubervile-alabama-supreme-court-embryos-children-ivf_n_65d78e1fe4b0cc1f2f7b1a81"
  },
  {
    "text": "Biden ties Trump tight to the Alabama court's IVF ruling  —  The ruling has scrambled GOP politics.  And the ex-president has, so far, not commented on it.  —  President Joe Biden's reelection campaign is trying to pin the blame for the Alabama court ruling jeopardizing access … ",
    "url": "https://www.politico.com/news/2024/02/22/biden-ties-trump-tight-to-the-alabama-courts-ivf-ruling-00142741"
  },
  {
    "text": "‘Assholes come and go’: Trump isn't the future, Sununu says  —  “It won't be his party forever. ...  It just won't,” Sununu said.  —  The future of the Republican Party isn't Donald Trump, New Hampshire Gov. Chris Sununu said Thursday.  —  “It won't be his party forever.  Right?  It just won't.",
    "url": "https://www.politico.com/news/2024/02/22/trump-sununu-republican-party-00142635"
  },
  {
    "text": "Trump seeks 30-day delay in enforcement of damages in New York civil fraud case  —  Judge Arthur Engoron ordered the former president and the Trump Organization to pay over $354 million in damages.  —  An attorney for Donald Trump has asked New York Judge Arthur Engoron for a 30-day delay … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-seeks-30-day-delay-enforcement-damages-new-york-civil-fraud-case-rcna139948"
  },
  {
    "text": "Judge Engoron Denies Trump's Attempt To Stay $350+ Million Judgment  —  The short ruling came in the form of an email  —  That was quick!  Despite Donald Trump's attempt to delay the enforcement of the $350+ million civil fraud judgment, Judge Arthur Engoron has denied Trump's request in a short email to his attorney Clifford Robert.",
    "url": "https://www.meidastouch.com/news/judge-engoron-denies-trumps-attempt-to-stay-350-million-judgment"
  },
  {
    "text": "Ken Buck Says Republicans Ignored Warning About Biden Impeachment Witness  —  ‘WE WERE WARNED’  —  Representative Ken Buck (R-CO) said that the testimony of the FBI's now-discredited star witness in Joe Biden's impeachment came with a disclaimer—one which many Republicans ignored, according to The Hill.",
    "url": "https://www.thedailybeast.com/ken-buck-says-republicans-ignored-warning-about-biden-impeachment-witness"
  },
  {
    "text": "Fetterman to Democrats criticizing Biden: ‘Get your MAGA hat’  —  Sen. John Fetterman (D-Pa.) panned Democrats who are upping their criticisms of President Biden ahead of the November election, saying they might as well don a “MAGA hat.”  —  Fetterman noted during an interview an uptick … ",
    "url": "https://thehill.com/homenews/senate/4482892-fetterman-to-democrats-criticizing-biden-get-your-maga-hat/"
  },
  {
    "text": "Hillary Clinton warns birth control is ‘next’ after Alabama IVF ruling  —  Hillary Clinton is warning about the legality of birth control in the wake of a decision by the Alabama Supreme Court that found frozen embryos created through fertility treatments are children under state law.",
    "url": "https://thehill.com/policy/healthcare/4483403-hillary-clinton-warns-birth-control-is-next-after-alabama-ivf-ruling/"
  },
  {
    "text": "Biden Pledges Sanctions on Russia During Meeting With Navalny's Widow, Daughter  —  Joe Biden announced during the meeting that he planned to announce major new sanctions on Russia following Navalny's death.  —  President Joe Biden met with Yulia and Dasha Navalnaya, Alexei Navalny's widow and daughter on Thursday.",
    "url": "https://www.thedailybeast.com/biden-pledges-sanctions-on-russia-during-meeting-with-navalnys-widow-daughter"
  },
  {
    "text": "‘More than stupidity’: Analyst claims Comer was willing to use Russian lies against Biden  —  House Oversight Chair James Comer's seeming lack of embarrassment after his key witness in the drive to impeach President Joe Biden turned out to be a now-accused liar who the Department of Justice claims … ",
    "url": "https://www.rawstory.com/comer-russia/"
  },
  {
    "text": "School punishment for Black student's hair is legal in CROWN Act lawsuit, judge rules  —  The CROWN Act prohibits race-based hair discrimination.  —  In this Sept. 18, 2023, file photo, Darryl George, a 17-year-old junior, walks across the street to go into Barbers Hill High School after serving … ",
    "url": "https://abcnews.go.com/US/judge-school-punishment-black-students-hair-legal-crown/story?id=107451979"
  },
  {
    "text": "‘Morning Joe’ Mocks Fox News ‘Liberal’ Pundit's ‘Both Sides’ BS  —  The razzing had a little more bite considering Ford was once a fixture on the MSNBC morning show.  —  The Morning Joe crew on Thursday took some potshots at Fox News “liberal” pundit Harold Ford Jr. over his tendency to agree … ",
    "url": "https://www.thedailybeast.com/morning-joe-mocks-fox-news-liberal-pundit-harold-ford-jr-both-sides-bs"
  },
  {
    "text": "To collect $1.5B from Alex Jones, Sandy Hook families vote to liquidate assets  —  In order to collect on the $1.5 billion in defamation judgments they won against Alex Jones, the families of the victims of the massacre at Sandy Hook Elementary School in Connecticut have voted to liquidate the far-right conspiracy theorist's assets.",
    "url": "https://lawandcrime.com/high-profile/to-collect-1-5b-from-alex-jones-sandy-hook-families-vote-to-liquidate-assets/"
  },
  {
    "text": "AT&T outage prompts urgent investigation into possible cyberattack: Sources  —  AT&T says their network is now 75% restored.  —  FILE PHOTO: The company logo for AT&T is displayed on a screen on the floor at the New York Stock Exchange (NYSE) in New York, U.S., September 18, 2019.",
    "url": "https://abcnews.go.com/US/att-outage-impacting-us-customers-company/story?id=107440297"
  },
  {
    "text": "Journalist Tim Burke Indicted For Leaking Tucker Carlson Clips That Embarrassed Fox News  —  The clips, which included unaired, antisemitic remarks by Kanye West, were published by Vice and Media Matters  —  TIM BURKE, A freelance journalist and media consultant, has been charged with 14 federal crimes, including conspiracy.",
    "url": "https://www.rollingstone.com/politics/politics-news/tim-burke-indicted-tucker-carlson-fox-news-kanye-1234973771/"
  },
  {
    "text": "Sirota's Signals: Yes, $13,000 Per Hour  —  How does the fine print of a government report expose the real reason billionaires hate the IRS?  What are regulators telling us about our credit card bills?  Why is dopamine ruining our society?  Where are lawmakers refusing to ban assault weapons, but looking into banning cold beer?",
    "url": "https://www.levernews.com/sirotas-signals-yes-13-000-per-hour/"
  },
  {
    "text": "Wendy Williams Diagnosed with Primary Progressive Aphasia and Dementia  —  On behalf of Wendy Williams Hunter, her care team is sharing this very personal update with her cherished fans, friends, and supporters to correct inaccurate and hurtful rumors about her health.",
    "url": "https://www.prnewswire.com/news-releases/wendy-williams-diagnosed-with-primary-progressive-aphasia-and-dementia-302068851.html"
  },
  {
    "text": "Mike Lindell must pay man $5M in ‘Prove Mike Wrong’ challenge, judge says  —  In 2021, MyPillow founder Mike Lindell offered $5 million to anyone who could disprove his claim that he had data showing voter fraud in the 2020 presidential election.  —  Now, he must pay a 64-year-old from Nevada that award … ",
    "url": "https://www.washingtonpost.com/nation/2024/02/22/mike-lindell-election-dispute-decision/"
  },
  {
    "text": "Tax evasion by millionaires and billionaires tops $150 billion a year, says IRS chief  — The nation's millionaires and billionaires are evading more than $150 billion a year in taxes, according to the head of the Internal Revenue Service.  — The IRS, with billion of dollars in new funding … ",
    "url": "https://www.cnbc.com/2024/02/22/tax-evasion-by-wealthiest-americans-tops-150-billion-a-year-irs.html"
  },
  {
    "text": "Lara Trump says RNC needs to raise $500 million, sees interest in paying Trump legal fees  —  Lara Trump, who Donald Trump has endorsed to be the new co-chair of the Republican National Committee, said on Wednesday that the organization needed to raise $500 million for the 2024 general election … ",
    "url": "https://www.reuters.com/world/us/lara-trump-says-rnc-needs-raise-500-mln-does-not-rule-out-paying-trump-legal-2024-02-22/"
  },
  {
    "text": "Former House speaker Paul Ryan on what's at stake in 2024 presidential election  —  Paul Ryan, former House speaker and vice presidential nominee, has long championed a brand of conservatism that is at odds with today's Republican Party.  Ryan joins The Post's Paul Kane to discuss … ",
    "url": "https://www.washingtonpost.com/washington-post-live/2024/02/21/former-house-speaker-paul-ryan-whats-stake-2024-presidential-election/"
  },
  {
    "text": "US intelligence casts doubt on Israeli claims of UNRWA-Hamas links, report says  —  Intel report says some accusations that aid workers participated in Hamas attacks credible but could not be independently verified  —  A US intelligence assessment of Israel's claims that UN aid agency staff … ",
    "url": "https://www.theguardian.com/world/2024/feb/22/us-intelligence-unrwa-hamas"
  }
]