[
  {
    "text": "Increasing numbers of voters don't think Biden should be running after debate with Trump — CBS News poll  —  For months before the first debate, the nation's voters repeatedly expressed doubts over whether President Biden had the cognitive health enough to serve.",
    "url": "https://www.cbsnews.com/news/poll-debate-should-biden-be-running-mental-abilities/"
  },
  {
    "text": "'It's a mess': Biden turns to family on his path forward after his disastrous debate  —  Democratic leaders have stood by the president as he faces questions about his ability to defeat Trump in November.  But privately, many are expressing concern.  —  WASHINGTON — President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-family-path-forward-disastrous-debate-mess-rcna159591"
  },
  {
    "text": "Historian who predicted 9 of the last 10 election results says Democrats shouldn't drop Joe Biden  —  WASHINGTON - Allan Lichtman, the historian who has correctly forecast the results of nine out of the 10 most recent presidential elections argued on Saturday that replacing President Joe Biden could cost Democrats the 2024 election.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/30/lichtman-dems-replace-biden/74260967007/"
  },
  {
    "text": "Behind the Curtain: What scares Democrats most … A Democratic official talked us through the gentle approach to getting Biden to end his run on his terms.  This official, who demanded anonymity for self-evident reasons, said Biden's sister, Valerie Biden, and longtime friend, Ted Kaufman, should make this case to the president:",
    "url": "https://www.axios.com/2024/06/30/biden-age-debate-disaster-democrats"
  },
  {
    "text": "Top aides shielded Biden from staff, but couldn't hide the debate … - “It's time for Joe to go.” … - “I know many of these people and how the White House operates. … - Reached by phone, West said he wrote the post because “the debate was not the first bad day, and it's not gonna be the last.”",
    "url": "https://www.axios.com/2024/06/30/top-aides-shielded-biden-white-house-debate"
  },
  {
    "text": "48 Hours to Fix a 90-Minute Mess: Inside the Biden Camp's Post-Debate Frenzy  —  With countless calls and a rush of campaign events, the president's team began a damage-control effort to pressure and plead with anxious Democratic lawmakers, surrogates, activists and donors.",
    "url": "https://www.nytimes.com/2024/06/30/us/politics/biden-campaign-debate-scramble.html"
  },
  {
    "text": "The Reckoning of Joe Biden  —  For the President to insist on remaining the Democratic candidate would be an act not only of self-delusion but of national endangerment.  —  There is an immense bounty of bunk about the wisdom of age available to all of us who require it from time to time … ",
    "url": "https://www.newyorker.com/news/daily-comment/the-reckoning-of-joe-biden"
  },
  {
    "text": "Biden campaign argues president dropping out would ‘lead to weeks of chaos’  —  The president has spent Friday and Saturday fundraising, vowing to fight harder.  —  President Joe Biden participates in the CNN Presidential Debate, June 27, 2024, in Atlanta.",
    "url": "https://abcnews.go.com/Politics/biden-campaign-argues-president-dropping-lead-weeks-chaos/story?id=111552401"
  },
  {
    "text": "Biden aides plotted debate strategy for months.  Then it all collapsed.  —  The Biden team gambled on an early debate and prepared intensively at Camp David, but they could not prevent their candidate's stumbles onstage.  —  CAMP DAVID, Md. — President Biden's debate prep went fine.",
    "url": "https://www.washingtonpost.com/politics/2024/06/30/how-biden-debate-prep-led-to-damaging-event/"
  },
  {
    "text": "To serve his country, Donald Trump should leave the raceBoard  —  President Joe Biden's debate performance was a disaster.  His disjointed responses and dazed look sparked calls for him to drop out of the presidential race.But lost in the hand wringing was Donald Trump's usual bombastic litany of lies … ",
    "url": "https://www.inquirer.com/opinion/editorials/first-presidential-debate-joe-biden-donald-trump-withdraw-20240629.html"
  },
  {
    "text": "The “Wow, Pictures!”  Tabloid Coverage of Trump's Stolen Documents Is as Bad as Conspiracy Mongering  —  The other day, I mined the documents and photographs released in the government's response to Trump's bid to throw out his indictment based on a complaint that the FBI failed to preserve the order of documents in boxes.",
    "url": "https://www.emptywheel.net/2024/06/30/the-wow-pictures-tabloid-coverage-of-trumps-stolen-documents-is-as-bad-as-conspiracy-mongering/"
  },
  {
    "text": "Pattern of Brain Damage Is Pervasive in Navy SEALs Who Died by Suicide … Longtime Navy SEALs like David Metcalf, shown with teammates in a photo from a personal collection, are exposed repeatedly in training to the blasts from detonating explosives and firing weapons.",
    "url": "https://www.nytimes.com/2024/06/30/us/navy-seals-brain-damage-suicide.html"
  },
  {
    "text": "The Pride March Doesn't Have a Place for Me  —  I've been marching in Pride parades since 1995, but I won't be marching this year in New York, where I live.  —  Pride Month has always been about a political and progressive embrace of our rainbow of choices.",
    "url": "https://www.nytimes.com/2024/06/30/opinion/pride-march-lgbtq-gaza.html"
  },
  {
    "text": "Donald Trump's Theory of Everything  —  At Thursday's debate, while Joe Biden struggled to put a sentence together, Donald Trump struggled to utter any sentence that wasn't about illegal immigrants destroying the country.  —  Harsh rhetoric—and policy—on migrants and the border has long … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/donald-trumps-migrant-obsession/678856/"
  }
]