[
  {
    "text": "Poll on Trump's 2025 joint address to Congress finds large majority of viewers approve  —  A large majority of speech watchers approved of what they heard from President Trump's joint address to Congress Tuesday night.  —  The viewership was heavily Republican — historically a president's party draws more of their own partisans.",
    "url": "https://www.cbsnews.com/news/trump-speech-joint-address-congress-poll-2025/"
  },
  {
    "text": "US cuts off intelligence sharing with Ukraine  —  Fresh blow to embattled government in Kyiv as Trump administration shifts on conflict  —  The US has cut off intelligence-sharing with Kyiv in a move that could seriously hamper the Ukrainian military's ability to target Russian forces, according to officials familiar with the matter.",
    "url": "https://www.ft.com/content/c58fccea-00c4-4fad-bc0a-0185b7415579"
  },
  {
    "text": "The IRS is drafting plans to cut as much as half of its 90,000-person workforce, AP sources say  —  The IRS is drafting plans to cut its workforce by as much as half through a mix of layoffs, attrition and incentivized buyouts, according to two people familiar with the situation.",
    "url": "https://apnews.com/article/irs-doge-layoffs-tax-season-0659e4b439400bf66023273f6a532fa0"
  },
  {
    "text": "How DOGE's Cuts to the IRS Threaten to Cost More Than DOGE Will Ever Save  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Dave Nershi was finalizing a report he'd worked on for months when an ominous email appeared in his inbox.",
    "url": "https://www.propublica.org/article/how-doge-irs-cuts-will-cost-more-than-savings-trump-musk-deficit"
  },
  {
    "text": "The Two-Headed Monster Stalking the Economy Has a Name: Stagflation  —  Tariffs have stoked fears of a dreary combination of weak growth and inflation  —  Stagflation has entered the chat.  —  President Trump's decision to dramatically raise tariffs on imports threatens the U.S … ",
    "url": "https://www.wsj.com/economy/trade/what-is-stagflation-trump-tariffs-b8be754c?st=uxLk5o&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Fact-checking 26 suspect claims in Trump's address to Congress  —  President makes false claims about border crossings, regulations, the economy, inflation and many other issues  —  President Donald Trump's address to a joint session of Congress on Tuesday was vintage Trump: long … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/05/fact-check-trump-speech-address-congress/"
  },
  {
    "text": "The American Century is Over  —  President in Name Only Donald Trump delivered remarks to a joint session of Congress typical of him—overstuffed, narcissistic, mean-spirited, and deeply dishonest.  And boring—not to mention interminable.  Some (smart) Democrats chose not to attend … ",
    "url": "https://contrarian.substack.com/p/the-american-century-is-over"
  },
  {
    "text": "Full Transcript of President Trump's Speech to Congress  —  In a speech to Congress in his first weeks in office, the president laid out his vision to remake U.S. policy on the military, trade, immigration and foreign aid. … President Trump: Speaker Johnson.  Vice President Vance, the first lady of the United States.",
    "url": "https://www.nytimes.com/2025/03/04/us/politics/transcript-trump-speech-congress.html?unlocked_article_code=1.1k4.I2S7.olOZbnXkKUJM&smid=url-share"
  },
  {
    "text": "Supreme Court won't lift lower court order unfreezing $2 billion in foreign aid funding  —  Washington — The Supreme Court on Wednesday declined to halt a lower court order that required the Trump administration to unfreeze nearly $2 billion in foreign-aid funding, clearing the way for the money … ",
    "url": "https://www.cbsnews.com/news/supreme-court-foreign-aid-usaid/"
  },
  {
    "text": "Supreme Court rejects Trump administration's bid to avoid paying USAID contractors  —  The Trump administration's efforts to effectively dismantle the foreign aid agency led contractors to file suit claiming they are owed money.  —  WASHINGTON — The Supreme Court on Wednesday endorsed … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-trump-administrations-bid-avoid-paying-usaid-con-rcna194230"
  },
  {
    "text": "Trump Administration Live Updates: Supreme Court Denies Bid to Freeze Nearly $2 Billion in Foreign Aid  —  Where Things Stand:  — Foreign aid ruling: The Supreme Court rejected President Trump's emergency request to freeze nearly $2 billion in foreign aid on Wednesday morning … ",
    "url": "https://www.nytimes.com/live/2025/03/05/us/trump-news"
  },
  {
    "text": "Jay Bhattacharya, once condemned for his lockdown critique, is poised for a comeback  —  The Covid contrarian's Senate confirmation hearing to lead the National Institutes of Health promises another airing of pandemic grievances.  —  Jay Bhattacharya is about to get his chance to settle old Covid scores.",
    "url": "https://www.politico.com/news/2025/03/05/jay-bhattacharya-poised-for-a-comeback-00211333"
  },
  {
    "text": "Trump, Ukraine, and the Meme-ing of Marco Rubio  —  Why the Secretary of State's stone-like posture during the Zelenskyy meltdown might have been exactly as telling as observed.  —  Even as it was happening on Friday, the Oval Office blowup between President Donald Trump, Vice President JD Vance … ",
    "url": "https://www.vanityfair.com/news/story/trump-ukraine-and-the-meme-ing-of-marco-rubio"
  },
  {
    "text": "Trump's Rage Over “Low” Deportations Suddenly Gets More Unnerving  —  For weeks now, President Donald Trump's propagandists have relentlessly glorified his mass deportations, even posting images of defeated-looking migrants getting frog-marched onto shiny military planes.",
    "url": "https://newrepublic.com/article/192318/trump-immigrant-deportations-low-rage-unnerving"
  },
  {
    "text": "Exclusive: Judges face rise in threats as Musk blasts them over rulings  —  U.S. Marshals have warned federal judges of unusually high threat levels as tech billionaire Elon Musk and other Trump administration allies ramp up efforts to discredit judges who stand in the way of White House efforts … ",
    "url": "https://www.reuters.com/world/us/judges-face-rise-threats-musk-blasts-them-over-rulings-2025-03-05/"
  },
  {
    "text": "Non-core property list  —  We are identifying buildings and facilities that are not core to government operations, or non-core properties for disposal.  Selling ensures that taxpayer dollars are no longer spent on vacant or underutilized federal spaces.  Disposing of these assets helps … ",
    "url": "https://www.gsa.gov/real-estate/real-estate-services/real-property-disposition/noncore-property-list"
  },
  {
    "text": "Tesla Sales Plunge in Germany, Reflecting Broader Slump in Europe  —  February numbers show the U.S. electric car maker is struggling to attract buyers in the region, as anger at Elon Musk's politics intensifies.  —  Tesla's sales in Germany plunged in February, part of a wider slump across Europe … ",
    "url": "https://www.nytimes.com/2025/03/05/business/tesla-germany-sales-elon-musk.html"
  },
  {
    "text": "MAGA Newspaper Owner's AI Bot Defends KKK  —  An AI-generated summary tried to offer “different views” on the hate group.",
    "url": "https://www.thedailybeast.com/maga-newspaper-owners-ai-bot-defends-kkk/"
  },
  {
    "text": "How Elon Musk Muscled His Way Into the FAA  —  The billionaire overseeing a wide-ranging government efficiency effort is offering his own SpaceX technology as the future of flight-safety inside the Federal Aviation Administration  —  Two weeks ago, SpaceX engineer Ted Malaska showed … ",
    "url": "https://www.bloomberg.com/news/features/2025-03-05/after-elon-musk-lands-at-faa-his-starlink-business-stands-to-gain-business?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0MTE4MzcwMywiZXhwIjoxNzQxNzg4NTAzLCJhcnRpY2xlSWQiOiJTU05EODBUMEFGQjUwMCIsImJjb25uZWN0SWQiOiIyQjE3NzFFOTlEODc0QzRDOTY1Njg1RTZBQkJGM0QwRCJ9.TDRlodRA_4vXOGL7ETxW9z4EWut0hVv9bnCs7SkMsNY"
  },
  {
    "text": "The Post's Beacon of Inspiration  —  As Jeff Bezos pushes The Washington Post to the right, publisher Will Lewis quietly met with a conservative editor last month, Status has learned.  —  Last month, Will Lewis, the embattled publisher and chief executive of The Washington Post, sat down for a curious off-the-record meeting.",
    "url": "https://www.status.news/p/washington-post-will-lewis-free-beacon"
  },
  {
    "text": "Bowser signals D.C. will paint over BLM Plaza after GOP threatens funding  —  The mayor's announcement represents a remarkable retreat from her defiant posture toward President Donald Trump during his first term.  —  D.C. Mayor Muriel E. Bowser (D) signaled Tuesday that the city would paint … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/03/04/dc-black-lives-matter-plaza-repainted-bowser/"
  }
]