[
  {
    "text": "Jack Smith's Big New Jan. 6 Brief Is a Major Indictment of the Supreme Court  —  It's rare to simultaneously feel red-hot anger and wistfulness, especially when merely reading a document.  But those are exactly the emotions that washed over me when I read the redacted version … ",
    "url": "https://slate.com/news-and-politics/2024/10/trump-election-interference-trial-jack-smith-brief-supreme-court-failure.html"
  },
  {
    "text": "October 2, 2024  —  When moderator Margaret Brennan noted during last night's vice presidential debate that Republican nominee J.D. Vance had, once again, lied about the legal status of migrants in Springfield, Ohio, Vance retorted: “The rules were that you guys weren't going to fact-check!”",
    "url": "https://heathercoxrichardson.substack.com/p/october-2-2024"
  },
  {
    "text": "11 damning details in Jack Smith's new brief in the Trump election case  —  From Trump's fictitious stats about voter fraud to the FBI's forensic analysis of Trump's phone, prosecutors previewed how they would make their case at trial.  —  Special counsel Jack Smith won't get a chance … ",
    "url": "https://www.politico.com/news/2024/10/02/jack-smith-trump-election-brief-details-00182287"
  },
  {
    "text": "Trump casts ‘election interference’ label on everything while facing federal charges  —  Trump is already laying the groundwork to dispute the results of another election, leveling baseless charges of interference as his own federal election interference case progresses.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-casts-election-interference-label-everything-facing-federal-char-rcna173754"
  },
  {
    "text": "JD Vance is a con artist, and the debate proved it  —  JD Vance's performance in this week's vice presidential debate was real slick.  A radical devotee of the MAGA cause, branded as “weird” by his critics and unpopular in polls, the Republican VP nominee used the debate to debut Vance 2.0.",
    "url": "https://thehill.com/opinion/campaign/4912024-jd-vance-debate-con-man/"
  },
  {
    "text": "Trump fear factor hits Senate GOP … - “I said, 'Sir, if I was you, I would stay out of the race, because there's no win for you in this,'” Sen. Markwayne Mullin (R-Okla.) told us about a recent call with Trump.  — “I hope not,” said Sen. Thom Tillis, when asked if he thinks Trump will weigh in.",
    "url": "https://www.axios.com/2024/10/03/trump-senate-republicans-mcconnell-thune-cornyn"
  },
  {
    "text": "John Roberts' Sordid Legacy: 14 Pages of Mean Tweets  —  “One of the ways Trump” disseminated false claims of election fraud, Jack Smith's immunity briefing describes, “was by Tweet, day in and day out.”  —  I'm still wading through Jack Smith's immunity briefing.",
    "url": "https://www.emptywheel.net/2024/10/03/john-roberts-sordid-legacy-14-pages-of-mean-tweets/"
  },
  {
    "text": "Liz Cheney to join Harris on campaign trail at birthplace of GOP  —  Former Rep. Liz Cheney (R-Wyo.) will join Vice President Harris at a campaign event on Thursday in Ripon, Wisc., known as the birthplace of the Republican Party, according to a senior campaign official.",
    "url": "https://thehill.com/homenews/campaign/4912623-liz-cheney-kamala-harris-wisconsin/"
  },
  {
    "text": "Biden's student loan forgiveness plan can take effect after judge lets restraining order expire  —  The judge wrote that he would transfer the case to the U.S. District Court for the Eastern District of Missouri.  —  President Joe Biden's student loan forgiveness program can take effect … ",
    "url": "https://www.nbcnews.com/politics/white-house/bidens-student-loan-forgiveness-plan-can-take-effect-judge-lets-restra-rcna173837"
  },
  {
    "text": "Harris holds a 66-electoral-vote lead over Trump, calculates prominent data scientist  —  Kamala Harris turned the tables on Trump, according to betting markets, and hasn't looked back.  —  Data scientist Thomas Miller has crafted a model for forecasting the 2024 presidential election that … ",
    "url": "https://fortune.com/2024/10/03/kamala-harris-trump-latest-polls-swing-states/"
  },
  {
    "text": "Melania Trump says she forced Donald to drop hardline immigration policy  —  Ex-first lady says she told Trump to stop separating children from parents and addresses jacket controversy in book  —  Melania Trump describes in her new memoir how she made her husband, then president Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/03/melania-trump-donald-immigration-jacket-slogan-book"
  },
  {
    "text": "UK will give sovereignty of Chagos Islands to Mauritius  —  The UK has announced it is giving up sovereignty of a remote but strategically important cluster of islands in the Indian Ocean after more than half a century.  —  The deal - reached after years of negotiations … ",
    "url": "https://www.bbc.com/news/articles/c98ynejg4l5o"
  },
  {
    "text": "Mayorkas warns FEMA doesn't have enough funding to last through hurricane season … The Federal Emergency Management Agency can meet immediate needs but does not have enough funding to make it through the hurricane season, Homeland Security Secretary Alejandro Mayorkas told reporters Wednesday.",
    "url": "https://apnews.com/article/hurricane-helene-congress-fema-funding-5be4f18e00ce2b509d6830410cf2c1cb"
  },
  {
    "text": "Giuliani's daughter: ‘The biggest threat to our country is Trump’  —  Former New York City Mayor Rudy Giuliani's (R) daughter said she thinks the biggest threat to America is former President Trump.  —  Caroline Giuliani has spoken out in recent days about her father's entanglements with Trump and the upcoming election.",
    "url": "https://thehill.com/blogs/in-the-know/4913595-giuliani-daughter-trump-threat/"
  },
  {
    "text": "Why conservatives get suspended more than liberals on social media  —  Happy Thursday!  I'm filling in for Cristiano today.  Send news tips to: will.oremus@washpost.com.  —  Below: Vice President Harris is ‘coming around’ to 'Little Tech's' agenda.  But first:",
    "url": "https://www.washingtonpost.com/politics/2024/10/03/nature-study-social-media-liberal-bias-censorship/"
  },
  {
    "text": "CNN requested an interview with Melania Trump.  Her book publisher asked for $250,000 in exchange  —  Nearly two months ago, CNN reached out to Melania Trump's book publisher to request an interview with the former first lady ahead of her upcoming memoir.  After several exchanges … ",
    "url": "https://www.cnn.com/2024/10/03/politics/melania-trump-book-cnn-interview/"
  },
  {
    "text": "How the North Carolina Legislature Left Homes Vulnerable to Helene  —  Under pressure to control housing costs, Republican lawmakers rejected standards meant to protect against disasters, experts say.  —  The amount of rain that Tropical Storm Helene unleashed over North Carolina was so intense … ",
    "url": "https://www.nytimes.com/2024/10/03/climate/north-carolina-homes-helene-building-codes.html"
  },
  {
    "text": "U.S. and Microsoft seize dozens of domains tied to Russian hacking group  —  U.S. authorities have seized dozens of internet domains used by Russian intelligence agents and their proxies to steal valuable information from U.S. government computers and email accounts, the Department of Justice revealed Thursday.",
    "url": "https://www.cbsnews.com/news/us-microsoft-russia-domains-seized/"
  }
]