[
  {
    "text": "Gov. Chris Sununu: This Is How to Beat Trump  —  This week, Republican primary candidates for president will have a chance to make their case before a national audience — with or without Donald Trump on the debate stage.  To win, they must break free of Mr. Trump's drama, step out of his shadow … ",
    "url": "https://www.nytimes.com/2023/08/21/opinion/governor-sununu-republicans-trump.html"
  },
  {
    "text": "Iowa poll: Trump challengers face huge climb to stop him in first GOP contest  —  Among likely GOP caucusgoers, 65% believe Trump hasn't committed serious crimes, while the survey also shows strong numbers considering DeSantis and Scott.  —  Former President Donald Trump starts … ",
    "url": "https://www.nbcnews.com/meet-the-press/first-read/iowa-poll-trump-challengers-face-huge-climb-stop-first-gop-contest-rcna100886"
  },
  {
    "text": "Trump's legal woes are part of his quasi-religious mythology of martyrdom  —  These criminal entanglements are not only means but ends - not a sideshow, but the heart and soul of Trump's campaign  —  n 16 or perhaps 17 July 2024, in Milwaukee, the Republican national convention will likely nominate … ",
    "url": "https://www.theguardian.com/commentisfree/2023/aug/21/trump-election-giuliani-sidney-blumenthal"
  },
  {
    "text": "Vivek Ramaswamy's Truth  —  The Millennial outsider Republican says he wants a revolution.  To get there, he'd gut the federal government.  —  vivek ramaswamy leaned forward in his leather seat aboard the Cessna 750.  He was fiddling with his pen, talking about Donald Trump.  It was the final Friday in July.",
    "url": "https://www.theatlantic.com/politics/archive/2023/08/vivek-ramaswamy-gop-election/675041/"
  },
  {
    "text": "‘Wanting to be famous’: How Vivek Ramaswamy sought podcast stardom prior to White House run  —  “He's been wanting to be famous for a long time,” one former aide told ABC News.  —  In early 2023, biotech entrepreneur Vivek Ramaswamy summoned a small group of conservative operatives to discuss … ",
    "url": "https://abcnews.go.com/US/wanting-famous-vivek-ramaswamy-sought-podcast-stardom-prior/story?id=102112582"
  },
  {
    "text": "Statement from President Joe Biden on Tomorrow's Visit to Maui  —  My heart, my prayers, and my focus are on the victims of the Maui wildfires and their families.  I know how profoundly loss can impact a family and a community and I know nothing can replace the loss of life.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/08/20/statement-from-president-joe-biden-on-tomorrows-visit-to-maui/"
  },
  {
    "text": "Biden Visiting Hawaii to Inspect Wildfire Damage  —  After remaining secluded since Friday, the president will break away from his vacation for a brief trip to Maui, where flames have demolished a town and killed more than 100 people.  —  President Biden is set to break away from his summer vacation … ",
    "url": "https://www.nytimes.com/2023/08/21/us/politics/biden-maui-hawaii-wildfires.html"
  },
  {
    "text": "Scoop: Inside Trump's new plan to limit immigration  —  Former President Trump wants unprecedented restrictions on immigration and the border if he's elected in 2024 — such as screening prospective immigrants for “Marxist” ideologies and a naval blockade to target drug smugglers, Axios has learned.",
    "url": "https://www.axios.com/2023/08/21/trump-immigration-border-mexico-cartels-2024-election"
  },
  {
    "text": "Trump and his allies double down on election lies after indictments for trying to undo 2020 results  —  A federal indictment and one in Georgia charging Donald Trump with lying about the 2020 election to overturn President Joe Biden's win have done nothing to slow the geyser of election falsehoods flowing … ",
    "url": "https://apnews.com/article/trump-indictment-2020-election-lies-georgia-misinformation-4b2269d68dad3024bd5afa711478505a"
  },
  {
    "text": "House Freedom Caucus fires warning shot over government shutdown  —  Members of the House Freedom Caucus are making it harder for leadership to avoid a government shutdown, announcing on Monday that they'll oppose a stopgap funding bill unless it caves to their terms.",
    "url": "https://www.axios.com/2023/08/21/freedom-caucus-government-shutdown-border"
  },
  {
    "text": "Elon Musk's Shadow Rule  —  How the U.S. government came to rely on the tech billionaire—and is now struggling to rein him in.  —  Last October, Colin Kahl, then the Under-Secretary of Defense for Policy at the Pentagon, sat in a hotel in Paris and prepared to make a call to avert disaster in Ukraine.",
    "url": "https://www.newyorker.com/magazine/2023/08/28/elon-musks-shadow-rule?currentPage=all"
  },
  {
    "text": "Judge blocks Georgia's ban on hormone therapy for transgender minors  —  A federal judge in Georgia on Sunday issued a ruling that blocks the state from enforcing its new ban on hormone therapy for transgender minors while the case proceeds.  —  U.S. District Judge Sarah Geraghty … ",
    "url": "https://www.lawdork.com/p/georgia-trans-minors-hormone-ban-injunction"
  },
  {
    "text": "New district lines will scramble key New York House races  —  The interminable legal fight over redistricting in New York will likely leave both parties unclear which races will be competitive until sometime next spring.  —  ALBANY, N.Y. — Candidates are eager to run in competitive House seats in New York next year.",
    "url": "https://www.politico.com/news/2023/08/21/new-york-redistricting-2024-elections-00111914"
  },
  {
    "text": "As the 2024 election revs up, Asian Americans rise as a powerful voting bloc  —  They're America's fastest-growing demographic, and they delivered a turnout jump in swing states that proved crucial to Joe Biden's victory in 2020.  Both parties have taken note.",
    "url": "https://www.nbcnews.com/politics/2024-election/2024-election-revs-asian-americans-rise-powerful-voting-bloc-rcna99875"
  }
]