[
  {
    "text": "Letter With White Powder Mailed to Donald Trump Jr.'s Florida Home: Sources  —  Multiple fire trucks and men in hazmat suits were spotted outside Donald Trump Jr.'s home in Jupiter, Florida, on Monday evening. … Multiple fire trucks and men in hazmat suits were spotted outside Donald Trump Jr.'s home … ",
    "url": "https://www.thedailybeast.com/hazmat-teams-spotted-at-don-jrs-florida-home-after-white-powder-discovered"
  },
  {
    "text": "Trump seeks to block Stormy Daniels, Michael Cohen from testifying at NY hush money trial  —  Former President Trump's lawyers in his hush-money case on Monday demanded a New York judge block key witnesses from testifying in Trump's first criminal trial set to begin next month.",
    "url": "https://thehill.com/homenews/4490109-trump-block-stormy-daniels-michael-cohen-ny-hush-money-trial/"
  },
  {
    "text": "GOP Rep. Scott Perry Wants to Cancel Biden's SOTU Address Over Border  —  “There's no reason that we need to invite him to get more propaganda,” Perry said, even though Biden accepted the House Speaker's invitation seven weeks ago.  —  Rep. Scott Perry (R-PA) suggested Monday … ",
    "url": "https://www.thedailybeast.com/gop-rep-scott-perry-wants-to-cancel-bidens-sotu-address-over-the-border"
  },
  {
    "text": "Biden says temporary cease-fire in Gaza could come next week  —  Negotiators have been working for months to secure a deal to release more than 100 Israeli hostages  —  President Biden on Monday said he hoped a deal between Israel and Hamas could emerge as soon as next week … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/26/biden-cease-fire-gaza/"
  },
  {
    "text": "Jack Smith says Trump's handling of classified docs was far worse than Biden's  —  In a new filing in Trump's Florida case, Smith cited Robert Hur's report on Joe Biden's retention of classified material.  —  Special counsel Jack Smith said Monday that President Joe Biden's handling … ",
    "url": "https://www.politico.com/news/2024/02/26/jack-smith-says-trump-classified-docs-00143346"
  },
  {
    "text": "Kroger's “nefarious bargain”  —  This is a special joint edition of Popular Information and Fingers, a newsletter about drinking in America by journalist Dave Infante.  Fingers is a must-read for anyone who cares about the business, culture, and chaos of booze.  Sign up HERE.",
    "url": "https://popular.info/p/krogers-nefarious-bargain"
  },
  {
    "text": "Judge orders Biden informant Alexander Smirnov to remain in jail  —  The former FBI informant is accused of lying when he claimed that Joe and Hunter Biden took bribes to shield a Ukrainian energy company  —  LOS ANGELES — A former FBI informant pleaded not guilty Monday to charges … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/26/fbi-informant-biden-smirnov-not-guilty/"
  },
  {
    "text": "Exclusive: Key figure in fake electors plot concealed damning posts on secret Twitter account from investigators  —  Kenneth Chesebro, the right-wing attorney who helped devise the Trump campaign's fake electors plot in 2020, concealed a secret Twitter account from Michigan prosecutors … ",
    "url": "https://www.cnn.com/2024/02/26/politics/kenneth-chesebro-secret-twitter-account-kfile/"
  },
  {
    "text": "Students Walk Out Of Oklahoma High School To Protest Nex Benedict's Death  —  Dozens of students at Owasso High said that they believe the school has not responded adequately to the 16-year-old's death and that a culture of bullying persists.  —  Dozens of students at Owasso High School … ",
    "url": "https://www.huffpost.com/entry/nex-benedict-death-oklahoma-student-walkout_n_65dd105ee4b0e4346d537fc7"
  },
  {
    "text": "Zelensky says Trump doesn't understand Putin because he has never fought him  —  Former US President Donald Trump will be “against Americans” if he chooses to support Russia over Ukraine, President Volodymyr Zelensky told CNN Sunday, in a stark warning as his country enters a third year of full-scale war.",
    "url": "https://www.cnn.com/2024/02/26/europe/zelensky-interview-ukraine-war-aid-trump-intl/"
  },
  {
    "text": "Fani Willis slammed with harassing calls after Trump lawyer puts contact info in court doc  —  Fulton County District Attorney Fani Willis and special prosecutor Nathan Wade were slammed with harassing phone calls over the weekend after one of former President Donald Trump's attorneys put … ",
    "url": "https://www.rawstory.com/fani-willis-nathan-wade-2667369713/"
  },
  {
    "text": "Letitia James live tweets $114,000 daily interest charges on Trump's $464m fraud ruling  —  New York Attorney General trolls former president as interest starts accruing on monster judgment  —  Trump says his $355m fraud penalty is ‘a form of Navalny’  —  A $455m judgment against Donald Trump … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/letitia-james-donald-trump-fine-b2502007.html"
  },
  {
    "text": "The House GOP's defense against hardliners is about to get weaker  —  If Republicans can hold the majority, they'll likely have to wrangle a bloc of even more emboldened conservatives who made their name by fighting their own party.  —  House Republicans are facing a growing exodus … ",
    "url": "https://www.politico.com/news/2024/02/27/bipartisan-republicans-trump-leaving-congress-00142908"
  },
  {
    "text": "New York Democrats reject bipartisan congressional map for a chance to draw their own lines  —  Democrats who control the New York Legislature on Monday rejected a congressional map devised by a bipartisan commission that would have given their party only a modest electoral advantage and will now have the chance to draw their own lines.",
    "url": "https://www.cnn.com/2024/02/26/politics/new-york-congressional-map/"
  },
  {
    "text": "Justices question Texas and Florida efforts to restrict social media companies  —  On Monday, over nearly four hours of oral arguments, the justices of the U.S. Supreme Court debated whether Florida and Texas can — with slightly different laws — mandate that social media companies change … ",
    "url": "https://www.lawdork.com/p/scotus-texas-florida-social-media-laws"
  },
  {
    "text": "Airman who set self on fire grew up on religious compound, had anarchist past  —  Less than two weeks before Aaron Bushnell walked toward the gates of the Israeli Embassy on Sunday, he and a friend talked by phone about their shared identities as anarchists and what kinds of risks and sacrifices were needed to be effective.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/02/26/israeli-embassy-airman-fire-death-gaza/"
  },
  {
    "text": "Pregnant women can't get divorced in Missouri.  Here's why  —  JEFFERSON CITY, Mo. (WDAF) - As it stands, Missouri judges cannot legally finalize a divorce if a woman is pregnant.  —  Three other states have similar laws: Texas, Arizona, and Arkansas.  While a pregnant woman can still file … ",
    "url": "https://thehill.com/changing-america/respect/equality/4488919-pregnant-women-cant-get-divorced-in-missouri-heres-why/"
  },
  {
    "text": "Alabama is using the notion that embryos are people to surveil and harass women  —  Even before the court ruled in favor of this vulgar fiction, state authorities relied on the concept to intimidate and jail women  —  Something that's important to remember about last week's ruling … ",
    "url": "https://www.theguardian.com/commentisfree/2024/feb/26/alabama-ivf-frozen-embryos-surveillance"
  },
  {
    "text": "Navalny aides say the Russian opposition leader was close to being freed before his death  —  Associates of Russian opposition leader Alexei Navalny said Monday that talks were underway shortly before his death to exchange him for a Russian imprisoned in Germany.  —  “Alexei Navalny could have been sitting here now, today.",
    "url": "https://apnews.com/article/russia-navalny-prison-death-swap-ce214909b1088a1d67fa9cd323864f50"
  }
]