[
  {
    "text": "Biden's family starts discussing his exit plan from the 2024 race  —  The president's family members have discussed how he would want to end his re-election bid on his own timing and with a carefully calculated plan in place.  —  WASHINGTON — Members of President Joe Biden's family … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/bidens-family-starts-discussing-exit-plan-2024-race-rcna162658"
  },
  {
    "text": "Rep. Sean Casten: It's time for Joe Biden to pass the torch  —  Our country faces an existential threat this November.  —  On the one hand, we have Joe Biden.  A man who passed the biggest climate and infrastructure bills in our nation's history; expanded NATO; has overseen record-breaking economic growth … ",
    "url": "https://www.chicagotribune.com/2024/07/19/opinion-joe-biden-presidential-candidacy-pass-the-torch/"
  },
  {
    "text": "Here's the latest on the Democratic campaign.  —  The president's resolve to continue his re-election bid has been shaken by Nancy Pelosi's comments, worsening state polls and a spending boycott by key donors, some in his camp said.  —  Here's the latest on the Democratic campaign.",
    "url": "https://www.nytimes.com/live/2024/07/19/us/biden-election-news"
  },
  {
    "text": "Biden left feeling angry and betrayed by top Democratic leaders wavering on his campaign  —  President Joe Biden is furious at how the party has tried to force him out, as Democrats in Congress increasingly believe the question is when, not if, he will end his campaign.",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-left-feeling-angry-betrayed-top-democratic-leaders-wavering-camp-rcna162635"
  },
  {
    "text": "People Close to Biden Say He Appears to Accept He May Have to Leave the Race  —  One person familiar with President Biden's thinking cautioned that he had not yet made up his mind to leave the race, after three weeks of insisting that almost nothing would drive him out.",
    "url": "https://www.nytimes.com/2024/07/18/us/politics/biden-election-drop-out.html"
  },
  {
    "text": "Excruciating!  Trump's Endlessly Long, Wildly Dishonest RNC Speech  —  Donald Trump briefly tried a “new tone” — before pivoting to Hannibal Lecter, “crazy” Pelosi, insurrection lies and more of his greatest hits.  —  LOADING  —  MILWAUKEE — Not four years after Donald Trump's eldest son boasted … ",
    "url": "https://www.huffpost.com/entry/donald-trump-republican-takeover_n_66998a0ae4b047588a4b2aac"
  },
  {
    "text": "This Crew Is Totally Beatable … At the climax of the Republican National Convention last night, former President Donald Trump's nomination-acceptance speech was a disheveled mess, endless and boring.  He spoke for 93 minutes, the longest such speech on record.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/donald-trump-republican-party-nomineee/679109/"
  },
  {
    "text": "Trump tramples unity theme in two-act convention speech … - Inside the Fiserv Forum, the ebullient mood gave way to rapt silence. … - “I stand before you in this arena only by the grace of Almighty God,” he said, echoing a long list of GOP convention speakers who had cited divine intervention for Trump's survival.",
    "url": "https://www.axios.com/2024/07/19/trump-convention-speech-unity-biden"
  },
  {
    "text": "Donald Trump Cannot Even Pretend to Change Who He Is  —  In the final season of The Marvelous Mrs. Maisel, Sophie Lennon decides to abandon her commercially successful, bawdy shtick to adopt a new persona as a respected actress for Miss Julie, a serious highbrow play.",
    "url": "https://nymag.com/intelligencer/article/donald-trump-republican-national-convention-speech-cannot-change.html"
  },
  {
    "text": "Donald Trump Can (and Must) Be Defeated  —  His bizarre, boring convention speech is a reminder that Trump is a terrible candidate  —  Unlike my party, there was no question who would be the Republican nominee.  It's not a surprise, but it's still shocking.",
    "url": "https://www.messageboxnews.com/p/donald-trump-can-and-must-be-defeated"
  },
  {
    "text": "Fact check: Trump makes more than 20 false claims in RNC acceptance speech  —  Former President Donald Trump accepted the Republican presidential nomination on Thursday with the most dishonest speech of the four-day Republican National Convention, making more than 20 false claims by CNN's count.",
    "url": "https://www.cnn.com/2024/07/18/politics/fact-checking-night-4-republican-national-convention-trump/"
  },
  {
    "text": "Elon Musk's X adds pro-Trump icons for Trump hashtags  —  The move comes after Musk publicly endorsed Trump  —  Over the weekend, Elon Musk made his support for Donald Trump official by publicly endorsing the former-president shortly after Trump was wounded in the ear by a would-be assassin during a campaign rally in Pennsylvania.",
    "url": "https://mashable.com/article/elon-musk-x-twitter-pro-trump-custom-hashtag-icon"
  },
  {
    "text": "Global cyber outage grounds flights, hits banks, telecoms, media  —  A software update wreaked havoc on computer systems globally on Friday, grounding flights, forcing some broadcasters off air and hitting services from banking to healthcare.  —  An update to a product offered … ",
    "url": "https://www.reuters.com/technology/global-cyber-outage-grounds-flights-hits-media-financial-telecoms-2024-07-19/"
  },
  {
    "text": "Republican National Convention Is a Trumpian Triumph  —  A movement that was a joke nine years ago is a party now.  Its members are certain they will win.  —  I will make something clear before sharing some honest, perhaps startling thoughts.  I did not support either … ",
    "url": "https://www.wsj.com/articles/a-trumpian-triumph-in-milwaukee-republican-national-convention-2024-election-0230db27"
  },
  {
    "text": "The Zeal of a Convert  —  Much of the coverage of JD Vance presents has implied, if not outright stated, that Vance is a hypocrite and opportunist.  How else do you explain someone who denounced Trump in a myriad of ways, and then jumped onto Trump bandwagon when struggling in his primary race?",
    "url": "https://donmoynihan.substack.com/p/the-zeal-of-a-convert"
  },
  {
    "text": "Rudy Giuliani can't even fall out of bankruptcy right  —  His tumble at the RNC was bad.  His legal problems are even worse. … If Rudy Giuliani simply would've walked into the sunset after his 2008 presidential bid, he'd probably have airports named after him by now.",
    "url": "https://www.publicnotice.co/p/rudy-giuliani-bankruptcy-rnc-2024-moss-freeman"
  },
  {
    "text": "Read the Transcript of Donald J. Trump's Convention Speech  —  He spoke for just over 90 minutes.  —  Thank you very much.  Thank you very, very much.  And thank you, Dana.  Thank you, Kid Rock, sometimes referred to as “Bob.”  And thank you, Lee, right from the beginning, thank you very much.",
    "url": "https://www.nytimes.com/2024/07/19/us/politics/trump-rnc-speech-transcript.html"
  },
  {
    "text": "Democratic donors begin mobilizing to raise money for Harris if she's the nominee  —  While acknowledging the volatility of the situation, some organizers said donors were already “lining up” to give in case Kamala Harris leads the Democratic ticket.  —  Allies of Vice President Kamala Harris … ",
    "url": "https://www.politico.com/news/2024/07/18/kamala-harris-fundraising-democrats-00169634"
  }
]