[
  {
    "text": "Like School Shootings, Political Violence Is Becoming Almost Routine  —  Threats and violent acts have become part of the political landscape, still shocking but somehow not so surprising.  —  The statements of shock and condolences streamed in eerily one after another on Saturday … ",
    "url": "https://www.nytimes.com/2025/06/14/us/politics/minnesota-political-violence.html"
  },
  {
    "text": "Suspect in Minnesota Shooting Linked to Security Company, Evangelical Ministry  —  The alleged shooter is a 57-year-old white male; according to his ministry's website, he “sought out militant Islamists in order to share the gospel and tell them that violence wasn't the answer.”",
    "url": "https://www.wired.com/story/shooting-minnesota-melissa-hortman-vance-boelter/"
  },
  {
    "text": "Congress' fight over security erupts after Minnesota shootings  —  A long-simmering fight over congressional security roared back to the surface this weekend following a pair of shootings against Minnesota state legislators at their homes that left two dead and two others hospitalized.",
    "url": "https://www.axios.com/2025/06/15/hortman-hoffman-congress-security-minnesota"
  },
  {
    "text": "Who Is Vance Boelter?  The Minnesota Lawmaker Shooting Suspect  —  The 57-year-old worked in security and as a pastor.  A list found in his car included prominent abortion-rights supporters in Minnesota, according to an official.  —  MINNEAPOLIS—The suspect in the shooting of Minnesota lawmakers … ",
    "url": "https://www.wsj.com/us-news/vance-boelter-minnesota-lawmaker-shooting-6dc7b72a?st=Gdq5Cq&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Tanks, troops and flyovers in D.C. as Trump gets his military parade  —  For its 250th birthday, the Army put on the largest show of military might in the capital in more than three decades.  —  Summary0  —  Planes roared over the heart of Washington on Saturday evening … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/06/14/army-parade-dc-trump-birthday-national-mall/"
  },
  {
    "text": "‘No Kings’ rallies draw big crowds to protest Trump and his policies  —  Across the country, relatively few disruptions were reported during protests and marches where the mood ranged from joyful to defiant.  —  Summary2689  —  Americans turned out en masse in communities across the country Saturday … ",
    "url": "https://www.washingtonpost.com/nation/2025/06/14/no-kings-protests-anti-trump-rallies-us/"
  },
  {
    "text": "Trump's Military Birthday Parade Was a Gross Failure  —  The president's military parade, which reportedly cost up to $45 million, was short on attendees, long on political speeches  —  WASHINGTON — On Saturday, President Donald Trump held a hideously expensive military parade in Washington, D.C., on his birthday.",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-military-birthday-parade-dc-failure-1235365040/"
  },
  {
    "text": "Man drives into crowd of protesters at ‘No Kings’ rally in Virginia  — Police say 21-year-old Joseph R. Checklick Jr. intentionally drove an SUV into a crowd of protesters in Culpeper, hitting at least one person.  — Checklick Jr. was arrested and charged with reckless driving … ",
    "url": "https://www.fox5dc.com/news/man-drives-crowd-protesters-no-kings-rally-virginia"
  },
  {
    "text": "Fox News Hosts Gushed Over the Parade, With No Protests in Sight  —  Cable networks covered President Trump's Army parade on a busy day of protests, a political assassination and Middle East strikes.  ABC, CBS and NBC aired other programming on their affiliates.",
    "url": "https://www.nytimes.com/2025/06/14/business/media/trump-parade-tv-coverage.html"
  },
  {
    "text": "“No Kings Day” protests turn out millions, rebuking Trump  —  The “No Kings Day” nationwide rallies against Donald Trump/for democracy on Saturday turned out millions of people.  —  That's per a collective crowdsourcing effort led by Strength In Numbers, and involving many members of the independent data journalism community.",
    "url": "https://www.gelliottmorris.com/p/no-kings-day-protests-turn-out-millions"
  },
  {
    "text": "Israel and Iran trade more deadly strikes in third day of escalating conflict  —  Israel and Iran exchanged another round of intense missile strikes into Sunday, fueling growing concerns that the fighting could escalate into a wider regional conflict.  The latest exchanges came just hours … ",
    "url": "https://www.npr.org/2025/06/15/nx-s1-5434172/israel-iran-strikes"
  },
  {
    "text": "Inside Trump's Extraordinary Turnaround on Immigration Raids  —  President Trump's decision to pause most raids targeting farms and hospitality workers took many inside the White House by surprise.  It came after intensive lobbying by his agriculture secretary.",
    "url": "https://www.nytimes.com/2025/06/14/us/politics/trump-immigration-raids-workers.html?unlocked_article_code=1.PE8.rsrr.8MI9w66BUTOm&smid=url-share"
  },
  {
    "text": "Poll: Americans disapprove of Trump's performance, as Republicans manage splits over spending plans  —  Immigration remains Trump's strongest issue, according to the NBC News Decision Desk Poll, powered by SurveyMonkey, though Americans are closely divided over how he's handling it.",
    "url": "https://www.nbcnews.com/politics/trump-administration/poll-americans-disapprove-trumps-performance-republicans-manage-splits-rcna212585"
  },
  {
    "text": "Australian deported from US says he was ‘targeted’ due to writing on pro-Palestine student protests  —  Alistair Kitchen says he was detained and questioned about views on Israel and Palestine before being deported from LA to Melbourne  —  An Australian man who was detained upon arrival … ",
    "url": "https://www.theguardian.com/australia-news/2025/jun/15/australian-deported-from-us-says-he-was-targeted-due-to-writing-on-pro-palestine-student-protests"
  },
  {
    "text": "Trump reports over $600 million in income in latest financial disclosure  —  The president reported making millions from cryptocurrency, his golf properties, foreign licensing deals and other sources.  JD Vance also filed forms disclosing Bitcoin holdings.  —  Summary172",
    "url": "https://www.washingtonpost.com/politics/2025/06/14/trump-income-assets/"
  },
  {
    "text": "House launches probe of Catholic nongovernmental organizations' role aiding migrants  —  The U.S. House Committee on Homeland Security and Subcommittee on Oversight, Investigations, and Accountability have announced the launch of an investigation into more than 200 nongovernmental organizations … ",
    "url": "https://www.catholicnewsagency.com/news/264743/house-launches-probe-of-catholic-nongovernmental-organizations-role-aiding-migrants"
  },
  {
    "text": "Yes, They're Going After Medicare Too  —  REPUBLICANS SAY THE HEALTH CARE CUTS in their One Big Beautiful Bill wouldn't touch Medicare.  —  That is not true.  —  One reason is the bill's projected fiscal effects.  Thanks to all the tax cuts, the legislation would likely increase deficits enough … ",
    "url": "https://www.thebulwark.com/p/yes-they-are-going-after-medicare-too-republicans-big-beautiful-bill-health-care-vulnerable"
  },
  {
    "text": "Gunman Opens Fire on ‘No Kings’ Protest in Salt Lake City  —  ‘DEEPLY TROUBLING’  —  One person has been taken to the hospital with life-threatening injuries.  —  A gunman opened fire on thousands of protesters in Salt Lake City, Utah, on Saturday evening.",
    "url": "https://www.thedailybeast.com/gunman-opens-fire-on-no-kings-protest-in-salt-lake-city/"
  }
]