[
  {
    "text": "Why I'm quitting the Washington Post  —  I've worked for the Washington Post since 2008 as an editorial cartoonist.  I have had editorial feedback and productive conversations—and some differences—about cartoons I have submitted for publication, but in all that time I've never had a cartoon killed … ",
    "url": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post"
  },
  {
    "text": "Washington Post Cartoonist Quits After Jeff Bezos Cartoon Is Killed  —  The cartoon, by Ann Telnaes, depicted the owner of The Post, Jeff Bezos, and other billionaires genuflecting toward a statue of President-elect Donald Trump.  —  Ann Telnaes, a Pulitzer Prize-winning cartoonist for The Washington Post … ",
    "url": "https://www.nytimes.com/2025/01/03/business/media/washington-post-cartoonist-quits-after-jeff-bezos-cartoon-is-killed.html?unlocked_article_code=1.mk4.6_zx.YOY8uSvF1m7i&smid=nytcore-ios-share&referringSource=articleShare&tgrp=ctr"
  },
  {
    "text": "Scoop: Apple CEO Tim Cook donates $1 million to Trump inauguration … The company is not expected to give.  — Cook, with a consistent presence in Washington, has made it clear over the years that he believes in participation, not sitting on the sidelines, and engaging with policymakers from both sides of the aisle.",
    "url": "https://www.axios.com/2025/01/03/tim-cook-apple-donate-1-million-trump-inauguration"
  },
  {
    "text": "Apple CEO Tim Cook donates $1M to Trump's inauguration fund  —  Apple CEO Tim Cook has joined a chorus of Big Tech executives making sizeable donations to President-elect Donald Trump's inauguration.  The news comes via a scoop from Axios as we approach Trump's inauguration on January 20.",
    "url": "https://9to5mac.com/2025/01/03/apple-ceo-tim-cook-donates-1m-to-trumps-inauguration-fund/"
  },
  {
    "text": "Trump Has Reeled in More Than $200 Million Since Election Day  —  The president-elect has boasted about the donations for his inauguration, library and political activities from those seeking favor or perhaps in some cases, atonement.  —  Since his victory in November … ",
    "url": "https://www.nytimes.com/2025/01/04/us/politics/trump-inaugural-donations.html"
  },
  {
    "text": "Apple CEO Tim Cook personally invested $1 million in Trump's inauguration  —  In a bid to gain favor with the president-elect, Apple CEO Tim Cook has contributed $1 million of his personal finances to the inauguration fund.  —  President-elect Donald Trump will be inaugurated on January 20 … ",
    "url": "https://appleinsider.com/articles/25/01/03/apple-ceo-tim-cook-personally-invested-1-million-in-trumps-inauguration"
  },
  {
    "text": "Judge Upholds Trump's Conviction but Signals No Jail Time  —  The New York judge who oversaw President-elect Donald J. Trump's hush-money trial scheduled his sentencing for Jan. 10.  Mr. Trump is expected to appeal his conviction.  —  A New York judge on Friday upheld President-elect Donald … ",
    "url": "https://www.nytimes.com/2025/01/03/nyregion/trump-sentencing-hush-money-case-ny.html"
  },
  {
    "text": "Judge upholds Trump's felony conviction, but does not plan to order jail time  —  Donald Trump was found guilty in May of falsifying business records to conceal a payment to adult-film star Stormy Daniels ahead of the 2016 election.  —  NEW YORK — President-elect Donald Trump will be sentenced … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/03/trump-new-york-hush-money-conviction-sentence/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM1ODgwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3MjYyNzk5LCJpYXQiOjE3MzU4ODA0MDAsImp0aSI6ImNhNmJhZTk5LTM2NzQtNDA1OS1iNGYzLWUwODA1MGMwOTQ1NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzAzL3RydW1wLW5ldy15b3JrLWh1c2gtbW9uZXktY29udmljdGlvbi1zZW50ZW5jZS8ifQ._xSiYrmilUvxjopNjH7qphaLD2AitGvr3Vzv68-Pd2E&itid=gfta"
  },
  {
    "text": "Trump cheers Johnson winning speaker vote: ‘America is back’  —  Mike Johnson was elected speaker for the 119th Congress on Friday  —  FIRST ON FOX: President-elect Trump reacted to Mike Johnson's re-election as speaker of the House, telling Fox News Digital the process brought House Republicans … ",
    "url": "https://www.foxnews.com/politics/trump-cheers-johnson-winning-speaker-vote-america-back"
  },
  {
    "text": "Biden Presidential Medal of Freedom honorees to include Hillary Clinton, Lionel Messi  —  Among Saturday's 19 recipients are rockstar Bono and actor Denzel Washington.  —  President Joe Biden is pictured during an event to award the Presidential Citizens Medal to recipients in the East Room … ",
    "url": "https://abcnews.go.com/Politics/biden-presidential-medal-freedom-honorees-include-hillary-clinton/story?id=117325468"
  },
  {
    "text": "Biden to Dole Out 19 Medals of Freedom, and One Unmistakable Message  —  With a recipient list stocked with old-guard icons and political backers, the president is signaling support for the establishment his successor wants to tear down.  —  With 16 days left in a political career that spanned … ",
    "url": "https://www.nytimes.com/2025/01/04/us/politics/biden-to-dole-out-19-medals-of-freedom-and-one-unmistakable-message.html"
  },
  {
    "text": "Driver who exploded Cybertruck in Las Vegas railed about ‘political grievances’ and domestic issues before suicide  —  Editor's Note: Help is available if you or someone you know is struggling with suicidal thoughts or mental health matters.  In the US: Call or text 988, the Suicide & Crisis Lifeline.",
    "url": "https://www.cnn.com/2025/01/03/us/las-vegas-cybertruck-explosion/"
  },
  {
    "text": "Soldier who blew up Tesla at Trump hotel left note saying blast was to be a ‘wake up call’ for US  —  A highly decorated Army soldier who fatally shot himself in a Tesla Cybertruck just before it blew up outside the Trump hotel in Las Vegas left notes saying the New Year's Day explosion … ",
    "url": "https://apnews.com/article/cybertruck-explosion-trump-hotel-las-vegas-6c85af85255753db497f2cd344fb2ace"
  },
  {
    "text": "Jimmy Carter's Funeral: See the Full Schedule of Events  —  The gestures of remembrance have all been selected to reflect the 39th president's rural roots and political career in Georgia and Washington, and his legacy of global advocacy.  —  Over the next six days, various dignitaries … ",
    "url": "https://www.nytimes.com/2025/01/04/us/jimmy-carter-funeral-schedule.html"
  },
  {
    "text": "Vegas Cybertruck bomber Matthew Livelsberger's vile marriage secrets revealed  —  Cybertruck suicide bomber Matthew Livelsberger was ‘unstable, misogynistic’ and emotionally ‘abusive’ to his first wife, says a pal of the active-duty Green Beret's ex.  —  'I never considered him stable or solid … ",
    "url": "https://www.dailymail.co.uk/news/article-14247555/matthew-livelsberger-marriage-vegas-cybertruck-trump.html"
  },
  {
    "text": "Democratic Women's Caucus Celebrates Largest Membership Ever; Welcomes 16 New Members  —  CONTACT:  —  Today, Friday January 3, the Democratic Women's Caucus (DWC) celebrated its largest membership ever, 96 Democratic women strong, following the swearing in of the 119th Congress.",
    "url": "https://democraticwomenscaucus.house.gov/media/press-releases/democratic-womens-caucus-celebrates-largest-membership-ever-welcomes-16-new"
  },
  {
    "text": "US surgeon general sounds alarm about link between alcohol and cancer  —  US Surgeon General Dr. Vivek Murthy issued an advisory Friday warning Americans that alcohol consumption can increase their cancer risk and called for an updated health warning label on alcoholic beverages.",
    "url": "https://www.cnn.com/2025/01/03/health/alcohol-cancer-surgeon-generals-advisory"
  }
]