[
  {
    "text": "NIH cuts billions of dollars in biomedical funding, effective immediately  —  The move halts a large slice of money for most universities and research institutions virtually overnight, imperiling vital research in everything from cancer to heart disease.  —  The Trump administration … ",
    "url": "https://www.washingtonpost.com/health/2025/02/08/nih-cuts-billions-dollars-biomedical-funding-effective-immediately/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4OTkwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMzczMTk5LCJpYXQiOjE3Mzg5OTA4MDAsImp0aSI6IjU5NWFmNTI5LTEwMTYtNDhmZC1iOGJiLTU4NTdmYWNkMWVjZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMi8wOC9uaWgtY3V0cy1iaWxsaW9ucy1kb2xsYXJzLWJpb21lZGljYWwtZnVuZGluZy1lZmZlY3RpdmUtaW1tZWRpYXRlbHkvIn0.OcEQXaQ6GEgeA8scM1_Xktlj4L_KU_yq77TQ8tne0EU&itid=gfta"
  },
  {
    "text": "In chaotic Washington blitz, Elon Musk's ultimate goal becomes clear  —  Shrink government, control data and — according to one official closely watching the billionaire's DOGE — replace “the human workforce with machines.”  —  Billionaire Elon Musk's blitzkrieg on Washington has brought … ",
    "url": "https://www.washingtonpost.com/business/2025/02/08/doge-musk-goals/"
  },
  {
    "text": "Federal judge blocks Musk's DOGE from access to Treasury Department material  —  The judge also ordered Musk and his team to “immediately destroy any and all copies of material downloaded from Treasury Department's records and systems, if any.”  —  NEW YORK — A federal judge issued … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/07/trump-musk-government-efficiency-attorneys-general-lawsuit/"
  },
  {
    "text": "Trump stripping the security clearances of numerous antagonists — including NY AG Letitia James, DA Alvin Bragg  —  President Trump has ordered security clearances stripped from a new hit list of antagonists.  —  Just days after revoking Joe Biden's access to classified information … ",
    "url": "https://nypost.com/2025/02/08/us-news/trump-stripping-the-security-clearances-from-a-new-hit-list-of-antagonists-including-ny-ag-letitia-james-da-alvin-bragg/"
  },
  {
    "text": "Trump chops away at the government and the fallout is felt in the Virginia governor's race  —  The Trump administration's aggressive push to cut government jobs is reverberating in the early stages of this year's race for governor in Virginia.  The fast-moving effort by Republican President Donald … ",
    "url": "https://apnews.com/article/virginia-governors-race-earlesears-spanberger-federal-workers-94ee683b86836d83f1fbd97411cedfc8"
  },
  {
    "text": "Advocate of Jan. 6 Rioters Now Runs Office That Investigated Them  —  Ed Martin, a loyal Trump soldier, oversees the U.S. attorney's office, which is likely to help turn the investigative powers of the government on several of the president's perceived enemies.",
    "url": "https://www.nytimes.com/2025/02/08/us/ed-martin-us-attorneys-office-trump.html"
  },
  {
    "text": "Russell Vought takes the helm at CFPB as Musk's DOGE accesses key systems  —  Russell Vought, an architect of Project 2025 and the new director at the Office of Management and Budget, is now also the acting leader of the Consumer Finance Protection Bureau, according to a source familiar with the situation.",
    "url": "https://www.npr.org/2025/02/08/nx-s1-5290914/russell-vought-cfpb-doge-access-musk"
  },
  {
    "text": "Trump rules out deporting Prince Harry: 'He's got enough problems with his wife'  —  Prince Harry can breathe freely in Montecito, because President Donald Trump has ruled out deporting the self-exiled British royal.  —  Harry's immigration status is the subject of litigation in Washington DC … ",
    "url": "https://nypost.com/2025/02/08/us-news/trump-rules-out-deporting-prince-harry-takes-jab-at-meghan-markle/"
  },
  {
    "text": "Why would a ‘Christian’ destroy the world's largest relief agency?  —  For Christians here and across the world, the ongoing confrontation over the fate of USAID dramatically illustrates the moral degeneration of the politicians who most fervently profess their piety.",
    "url": "https://www.alternet.org/franklin-graham-2671119286/"
  },
  {
    "text": "Did Trump Quietly Kill a Sensitive Pentagon Probe into Elon Musk?  —  In December, more than a month before Donald Trump took the presidential oath of office, The New York Times reported a blockbuster scoop: Elon Musk and his SpaceX company had repeatedly failed to meet federal reporting requirements designed … ",
    "url": "https://newrepublic.com/article/191330/trump-quietly-kill-sensitive-pentagon-probe-elon-musk"
  },
  {
    "text": "Elon's X army takes the wheel … - Musk, who typically posts between 50 and 100 tweets per day, is taking the bottom-up approach by letting foot soldiers supply suggestions that get seen — and acted on — by his Department of Government Efficiency (DOGE). … Then on Monday, he declared that Trump “agreed” to shut it down.",
    "url": "https://www.axios.com/2025/02/08/elon-musk-x-followers-us-government"
  },
  {
    "text": "Trump's Conquest of the Kennedy Center Is Accelerating  —  The president has begun purging the board of Washington's premier arts organization.  —  Donald Trump's hostile takeover of the John F. Kennedy Center for the Performing Arts is moving quickly.  —  On Friday night … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/02/trump-kennedy-center-board/681623/"
  },
  {
    "text": "Measles outbreak expands in West Texas around county with low vaccination rate  —  A measles outbreak is growing in a rural area of West Texas where vaccination rates are well below the recommended level.  —  In late January, two children in Gaines County were hospitalized for measles.",
    "url": "https://www.cnn.com/2025/02/07/health/west-texas-measles-outbreak/"
  },
  {
    "text": "New York lawmakers moving to deny House GOP a key vote  —  A new proposal would allow New York Gov. Kathy Hochul to set a special election for later in the year.  —  ALBANY, New York — New York Democrats are poised to delay until November the special election to fill Rep. Elise Stefanik's House seat … ",
    "url": "https://www.politico.com/news/2025/02/08/new-york-lawmakers-moving-to-deny-house-gop-a-key-vote-00203249"
  },
  {
    "text": "The Department of Education Told Employees to End Support for Transgender Students  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  The U.S. Department of Education told employees late Friday … ",
    "url": "https://www.propublica.org/article/department-of-education-transgender-students-email"
  },
  {
    "text": "Far-Right Leaders Rally in Spain to ‘Make Europe Great Again’  —  At a gathering in Madrid, members of Europe's far-right parties set aside any trepidation they might have about President Trump's threats, and instead focused on a common enemy — the European Union.",
    "url": "https://www.nytimes.com/2025/02/08/world/europe/far-right-spain-rally.html?unlocked_article_code=1.vU4.uTVE.9Gxuw_DMfBm1"
  },
  {
    "text": "Trudeau Caught on Hot Mic Revealing Trump's Plans for Canada  —  Canadian Prime Minister Justin Trudeau told business leaders that U.S. President Donald Trump's interest in annexing Canada was a very real plan aimed at controlling the country's vast mineral resources.Trudeau was caught … ",
    "url": "https://www.thedailybeast.com/justin-trudeau-caught-on-hot-mic-revealing-trumps-plans-for-canada/"
  },
  {
    "text": "The Cybertruck Appears to Be More Deadly Than the Infamous Ford Pinto, According to a New Analysis  —  On New Years morning this year, US Army Master Sergeant Matthew Livelsberger rolled his rental cybertruck up near the front doors of Trump International Hotel Las Vegas.",
    "url": "https://futurism.com/the-byte/cybertruck-ford-pinto-comparison"
  },
  {
    "text": "'It's a Circus': Trump Unleashes Chaos at Key US Science Agency  —  Muddled directives and early-morning emails at NOAA, one of the world's top weather and climate forecasters, have put the agency on edge.  —  The email arrived in US government workers' inboxes just after 1 a.m. East Coast time on Friday … ",
    "url": "https://www.bloomberg.com/news/features/2025-02-08/trump-unleashes-chaos-at-noaa-us-weather-and-climate-agency?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczOTAyMTE3NiwiZXhwIjoxNzM5NjI1OTc2LCJhcnRpY2xlSWQiOiJTUkQ4NTdEV1JHRzAwMCIsImJjb25uZWN0SWQiOiI2M0I1MDYzMjkwODY0OTRDQjIzMThFMDVCOTBGMkMwNiJ9.NSlU1N5cABXOWkZTZ4kUnXGHXVivsTdx9rgITsmja_A"
  },
  {
    "text": "In a harbinger of illiberalism, Trump fired the Archivist of the United States without telling her or Congress why  —  Good afternoon from Washington, where my daughter and I made blueberry pancakes and took the dogs for a walk before the rains rolled in.  I hope you and yours are well this morning.",
    "url": "https://civic-texts.ghost.io/in-a-harbinger-of-illiberalism-trump-fires-archivist-of-the-united-states-2/"
  },
  {
    "text": "Why Trump's in-your-face campaign will never end … - On Jan. 31, the Rapid Response account posted a message portraying House Minority Leader Hakeem Jeffries (D-N.Y.) as violent for promising that Democrats will “fight” Trump's agenda “legislatively... in the courts, and ... in the streets.”",
    "url": "https://www.axios.com/2025/02/08/trump-strategy-messaging-insults"
  },
  {
    "text": "Who is helping Elon Musk gut the US government?  —  The billionaire's cost-cutting ‘Doge’ staff includes wealthy executives, far-right ideologues and young engineers  —  Elon Musk's rapid attempt to defund and depopulate the federal government has thrown US politics into chaos while the billionaire's … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/08/elon-musk-doge-team-staff"
  },
  {
    "text": "Now Is Not the Time to Tune Out  —  Don't get distracted.  Don't get overwhelmed.  Don't get paralyzed and pulled into the chaos that President Trump and his allies are purposely creating with the volume and speed of executive orders; the effort to dismantle the federal government … ",
    "url": "https://www.nytimes.com/2025/02/08/opinion/trump-musk-public-attention.html?unlocked_article_code=1.vU4.PGv6.3q5Z-7BwVfAs&smid=url-share"
  }
]