[
  {
    "text": "JD Vance got a former professor to delete a blog post Vance wrote in 2012 attacking GOP over anti-immigrant rhetoric  —  A week after President Barack Obama won reelection in November 2012, JD Vance, then a law student at Yale, wrote a scathing rebuke of the Republican Party's stance on migrants … ",
    "url": "https://www.cnn.com/2024/09/17/politics/jd-vance-delete-2012-blog-post-attacking-gop-anti-immigrant-rhetoric/"
  },
  {
    "text": "Overseas threats hit the Ohio city where Trump and Vance lied about Haitians eating pets  —  SPRINGFIELD, Ohio (AP) — Ohio stationed state police at Springfield schools Tuesday in response to a rash of bomb threats — the vast majority that officials said came from overseas —",
    "url": "https://apnews.com/article/trump-vance-haitian-immigrants-ohio-threats-8035cbe409b471e61fe2e5457870d7b4"
  },
  {
    "text": "J.D. Vance's Admission Shouldn't Shock You—They've Done This for Years  —  There was some surprise on Sunday when vice presidential nominee J.D. Vance argued that the “American media totally ignored” the plight of Springfield and Vance's own claims about immigration “until Donald Trump and I started talking about cat memes.”",
    "url": "https://newrepublic.com/article/185992/jd-vance-springfield-ohio-spread-lies-haitians"
  },
  {
    "text": "Dozens of Hezbollah members wounded in Lebanon when pagers exploded, sources and witnesses say  —  At least eight people were killed and 2,750 others including Hezbollah fighters, medics and Iran's envoy to Beirut were wounded on Tuesday when the pagers they use to communicate exploded across Lebanon … ",
    "url": "https://www.reuters.com/world/middle-east/dozens-hezbollah-members-wounded-lebanon-when-pagers-exploded-sources-witnesses-2024-09-17/"
  },
  {
    "text": "Hezbollah Pagers Explode in Apparent Attack Across Lebanon  —  Eight people were killed and 2,750 wounded, country's health minister says  —  BEIRUT—Pagers carried by thousands of Hezbollah operatives exploded at about the same time Tuesday afternoon in what appeared to be an unprecedented attack … ",
    "url": "https://www.wsj.com/world/middle-east/hundreds-of-hezbollah-operatives-pagers-explode-in-apparent-attack-across-lebanon-cf31cad4?st=trumvlry6nd9rff&reflink=article_copyURL_share"
  },
  {
    "text": "Hezbollah hit by a wave of exploding pagers and blames Israel.  At least 9 dead, thousands injured … Pagers used by hundreds of members of the militant group Hezbollah exploded near simultaneously in Lebanon and Syria on Tuesday, killing at least nine people — including an 8-year-old girl … ",
    "url": "https://apnews.com/article/lebanon-hezbollah-israel-exploding-pagers-8893a09816410959b6fe94aec124461b"
  },
  {
    "text": "Thousands injured in Lebanon as pagers used by Hezbollah explode  —  Pagers used by the militant group Hezbollah simultaneously exploded, injuring more than 2,800 people and killing at least nine, officials said.  —  BEIRUT — Thousands of people were injured across Lebanon on Tuesday … ",
    "url": "https://www.washingtonpost.com/national-security/2024/09/17/lebanon-pagers-exploding-hezbollah/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2NTQ1NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI3OTI3OTk5LCJpYXQiOjE3MjY1NDU2MDAsImp0aSI6IjJmMzFhYzMxLTQ2NTMtNGIxNC04N2VkLWMxOWMyYTBkMWNiZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI0LzA5LzE3L2xlYmFub24tcGFnZXJzLWV4cGxvZGluZy1oZXpib2xsYWgvIn0.Lq6Y7cTXTrAKVz5Dt0qFpe2r2UoTKG9Y5_knW2D9D9c&itid=gfta"
  },
  {
    "text": "Judge Aileen Cannon Failed to Disclose a Right-Wing Junket  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Federal Judge Aileen M. Cannon, the controversial jurist who tossed … ",
    "url": "https://www.propublica.org/article/judge-aileen-cannon-trump-documents-case-travel-disclosures"
  },
  {
    "text": "Judge Who Tossed Trump's Docs Case Repeatedly Violated Disclosure Rule: Report  —  Florida Judge Aileen Cannon failed to disclose lavish trips hosted by influential conservative law school  —  FLORIDA DISTRICT COURT Judge Aileen Cannon failed to disclose her attendance at several right-wing … ",
    "url": "https://www.rollingstone.com/politics/politics-news/aileen-cannon-disclosure-reports-trips-1235104678/"
  },
  {
    "text": "Harris refuses to veer off script in her second high-profile interview  —  Harris' appearance at the NABJ event follows Donald Trump's combative sit-down interview with the association.  —  PHILADELPHIA — Kamala Harris largely stuck to her script during an interview Tuesday with a panel … ",
    "url": "https://www.politico.com/news/2024/09/17/kamala-harris-interview-nabj-00179695"
  },
  {
    "text": "Republicans block Democratic bill on IVF protections  —  As Trump pitches himself as a “leader on IVF,” GOP senators dismiss the legislation as a Democratic stunt.  —  Senate Republicans blocked passage on Tuesday of a Democratic bill that would federally protect access to in vitro fertilization … ",
    "url": "https://www.politico.com/news/2024/09/17/republicans-block-ivf-bill-00179626"
  },
  {
    "text": "Secret Service Told Trump It Needs to Bolster Security if He Keeps Golfing  —  The agency's acting director, Ronald L. Rowe Jr., met with Donald J. Trump on Monday in the aftermath of the apparent assassination attempt on Sunday.  —  The acting director of the Secret Service told former … ",
    "url": "https://www.nytimes.com/2024/09/17/us/politics/trump-secret-service-golf.html"
  },
  {
    "text": "Trump: When I Win, The People Who Tried To Defeat Me Are Going To Prison  —  He's openly calling for rigging the election via voter intimidation, in a truly classic example of Every Accusation is a Confession: … To continue to treat this as a normal election, the media have to either ignore … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2024/09/trump-when-i-win-the-people-who-tried-to-defeat-me-are-going-to-prison"
  },
  {
    "text": "Elon Musk Shared Memes Made by FSB Propaganda Machine  —  EGG ON YOUR FACE  —  A journalistic investigation has revealed that the content was generated by a Russian propaganda machine set up to sow discord over the war in Ukraine.  —  DENIED  —  A Manhattan court rejected Maxwell's argument that she was protected from prosecution.",
    "url": "https://www.thedailybeast.com/billionaire-tesla-ceo-elon-musk-shared-memes-made-by-fsb-propaganda-machine"
  },
  {
    "text": "US senator accuses Muslim advocate of supporting extremism in hearing on hate  —  Republican U.S. Senator John Kennedy accused a leading Muslim civil rights advocate of supporting extremism during a Senate hearing on hate incidents in the U.S., drawing criticism from many rights groups.",
    "url": "https://www.reuters.com/world/us/us-senator-accuses-muslim-advocate-supporting-extremism-hearing-hate-2024-09-17/"
  },
  {
    "text": "J.D. Vance Reveals How Trump Will Use Musk to Target Social Security  —  J.D. Vance's recent comments regarding Elon Musk's potential role in a second Trump administration are ringing alarm bells for some.  —  In the past few weeks, Trump has confirmed that he plans to create … ",
    "url": "https://newrepublic.com/post/186059/jd-vance-reveals-trump-will-use-musk-target-social-security"
  },
  {
    "text": "Judge rules Trump Media breached stock contract with early investor … Trump Media breached an agreement with one of the investors that helped the company go public, and must grant the investor a larger share of its stock, a judge ruled.  —  The order in Delaware Chancery Court on Monday came … ",
    "url": "https://www.cnbc.com/2024/09/17/djt-trump-media-stock-lawsuit-lockup.html"
  },
  {
    "text": "Russian cyber operatives shift focus to Harris campaign, Microsoft says … - One claimed to show a group of alleged Harris supporters attacking an assumed Trump rally attendee. … - Both videos were spread through a website posing as a local San Francisco news outlet.",
    "url": "https://www.axios.com/2024/09/17/harris-elections-russia-disinformation-microsoft"
  },
  {
    "text": "‘Flat Out Illegal’: MAGA Sheriff Is Keeping Note of Homes With Harris Yard Signs  —  DISTURBING  —  Bruce Zuchowski used the word “locust” to describe undocumented immigrants and said they should be sent to the homes of Kamala Harris supporters.  —  An Ohio sheriff has made a chilling … ",
    "url": "https://www.thedailybeast.com/maga-sheriff-bruce-zuchowski-says-hes-keeping-note-of-homes-with-harris-walz-yard-signs"
  },
  {
    "text": "Freedom Caucus taps Rep. Harris as next chief … - Often described as a thorn in leadership's side, the Freedom Caucus played played key roles in former Speaker John Boehner's (R-Ohio) decision to step down, as well as in the ouster of former Speaker Kevin McCarthy (R-Calif.).",
    "url": "https://www.axios.com/2024/09/18/house-freedom-caucus-taps-andy-harris-as-new-chairman"
  },
  {
    "text": "Court may decide if Arizonans with missing citizenship records can vote in state races  —  Arizona officials discovered they have no records showing if nearly 100,000 longtime residents provided proof of citizenship, which is required by law to vote in state and local races.",
    "url": "https://www.washingtonpost.com/politics/2024/09/17/arizona-noncitizen-voters/"
  },
  {
    "text": "Refuse to Be Silenced  —  Trump's Strategy To Shut Down the 2024 Campaign  —  The emerging MAGA conflation that every criticism of Donald Trump is a call for his assassination is a logical, moral, and political fallacy of the most sublimely stupid nature, a false equivalence so profoundly wrong … ",
    "url": "https://therickwilson.substack.com/p/refuse-to-be-silenced"
  },
  {
    "text": "“Depressed, disgusted and horrified”: These lifelong Republicans say they're finally done with Trump  —  Former Republicans opposed to Donald Trump are working to give conservatives “permission” to vote for a Democrat  —  Robert Nix, a 62-year-old lawyer from Philadelphia, was a lifelong Republican before Donald Trump came to office.",
    "url": "https://www.salon.com/2024/09/17/depressed-disgusted-and-horrified-these-lifelong-say-theyre-finally-done-with/"
  }
]