[
  {
    "text": "Trump vows to end birthright citizenship and pardon US Capitol rioters  —  President-elect Donald Trump has said he will look at pardons for those involved in the 2021 US Capitol riot on his first day back in office next month.  —  “These people are living in hell,” he told NBC's Meet … ",
    "url": "https://www.bbc.com/news/articles/cj30er1d6mxo"
  },
  {
    "text": "Trump says he can't guarantee tariffs won't raise US prices and won't rule out revenge prosecutions  —  Donald Trump said he can't guarantee that his promised tariffs on key U.S. foreign trade partners won't raise prices for American consumers and he suggested once more that some political rivals … ",
    "url": "https://apnews.com/article/trump-immigration-tariffs-pardons-abortion-prosecutions-riot-72c08269f0a870d20e29033319201e22"
  },
  {
    "text": "With Assad Gone, a Brutal Dictatorship Ends.  But the New Risks Are Huge.  —  The overthrow of the Assad government could mean Russia's bases in Syria are closed and Iran's pathway to Hezbollah is cut off.  Now Iran, newly vulnerable, will have to decide between negotiation and the bomb.",
    "url": "https://www.nytimes.com/2024/12/08/us/politics/syria-assad-iran-risks.html"
  },
  {
    "text": "Biden Weighs Approach to Rebels in Syria Amid Secret Message Exchange  —  President Biden faces the challenge of deciding how to engage the main armed group that toppled President Bashar al-Assad, even though it remains designated a terrorist organization by the United States.",
    "url": "https://www.nytimes.com/2024/12/08/us/politics/biden-syria-assad-isis.html"
  },
  {
    "text": "Khamenei Loses Everything  —  The October 7 attack on Israel has now cost Iran its regional proxy forces.  —  When Hamas's Yahya Sinwar launched Operation Al-Aqsa Flood against Israel on October 7, 2023, he intended to deal a decisive blow against a powerful nation-state—and he succeeded.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/12/khamenei-iran-syria/680920/?gift=5Jt_OsUNCrDLh-WaaPKh0XxkVqXiByOZektEmQ-ztgE"
  },
  {
    "text": "Trump Suggests Kennedy Will Examine Debunked Link Between Vaccines and Autism  —  The president-elect has promoted the theory for more than a decade and said on Sunday that he was “open to anything” to address a nationwide rise in autism.  —  President-elect Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/12/08/us/politics/trump-rfk-jr-vaccines-autism.html"
  },
  {
    "text": "Trump says RFK Jr. will investigate the discredited link between vaccines and autism: ‘Somebody has to find out’  —  Researchers attribute a rise in autism diagnoses to increased screening and changing definitions of the condition.  Hundreds of studies have found childhood vaccines to be safe.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-rfk-jr-will-investigate-discredited-link-vaccines-autism-so-rcna183273"
  },
  {
    "text": "Weakened US public broadcasters will fight for their lives in 2025  —  The Scoop  —  Last week, Republican Sen. John Kennedy introduced the subtly named “No Propaganda Act.”  If enacted, it would end federal funding for America's public media.  —  He joined an effort by billionaires Elon Musk … ",
    "url": "https://www.semafor.com/article/12/08/2024/weakened-us-public-broadcasters-will-fight-for-their-lives-in-2025"
  },
  {
    "text": "Jay-Z accused in a civil lawsuit of raping a 13-year-old girl in 2000 along with Sean ‘Diddy’ Combs  —  Jay-Z responded with a lengthy statement calling the allegations “idiotic.”  The accuser is anonymous.  —  Jay-Z, the star rapper and entrepreneur whose real name is Shawn Carter … ",
    "url": "https://www.nbcnews.com/news/us-news/jay-z-accused-civil-lawsuit-raping-13-year-old-girl-2000-sean-diddy-co-rcna183376"
  },
  {
    "text": "Biden shrinks from view ahead of Trump's return to Washington  —  With 42 days left in office, Biden avoids unscripted moments or press questions.  —  Joe Biden is president of the United States for 42 more days.  But within the Democratic Party, on Capitol Hill — and even within his own administration … ",
    "url": "https://www.politico.com/news/2024/12/09/biden-absent-washington-00192575"
  },
  {
    "text": "Rep. Ro Khanna: US should be moving toward Medicare for all to cure inequities  —  Khanna tells “This Week” that “I believe we can make Medicare for all happen.”  —  Rep. Ro Khanna appears on “This Week,” Dec. 8.  2024.  —  After an onslaught of criticism toward the insurance industry following … ",
    "url": "https://abcnews.go.com/Politics/rep-ro-khanna-us-moving-medicare-cure-inequities/story?id=116564621"
  },
  {
    "text": "Boeing failing to keep track of non-conforming parts, whistleblower says: “It's like Russian roulette”  —  When a panel known as a door plug blew off an Alaska Airlines flight minutes after takeoff earlier this year,  a quality investigator at the factory where the Boeing plane was manufactured … ",
    "url": "https://www.cbsnews.com/news/boeing-whistleblowers-speak-out-60-minutes/"
  },
  {
    "text": "Trump says members of Jan. 6 committee should be jailed  —  The president-elect said he would not instruct his pick for attorney general to investigate Jack Smith, the special counsel appointed to investigate him.  —  President-elect Donald Trump said members of the now-defunct House select committee tasked … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/08/trump-january-6-biden-jack-smith/"
  },
  {
    "text": "More lawsuits are barreling toward Trump over Jan. 6  —  The criminal cases against the president-elect have crumbled, but he remains enmeshed in civil litigation over Jan. 6 and a barrage of cases he filed against the media.  —  Donald Trump isn't off the hook for Jan. 6 just yet.",
    "url": "https://www.politico.com/news/2024/12/08/trump-civil-lawsuits-00193121"
  },
  {
    "text": "Trump is stacking his White House roster with uber-rich backers … Donald Trump's first administration was chock full of super-rich figures whose combined wealth exceeded $5 billion, marking an unprecedented marriage of money and executive power.  —  Trump's second term could make that total look like chump change.",
    "url": "https://www.cnbc.com/2024/12/08/trump-billionaires-white-house-cabinet.html"
  }
]