[
  {
    "text": "Australia re-elects Anthony Albanese as Labor rides anti-Trump wave to seal crushing win  —  Opposition leader Peter Dutton fails to dissociate himself from Trump-like rhetoric and policies - and loses his seat  —  Australia's centre-left prime minister, Anthony Albanese … ",
    "url": "https://www.theguardian.com/australia-news/2025/may/03/australia-election-anthony-albanese-labor-party-peter-dutton"
  },
  {
    "text": "Australia's center-left Labor Party retains power in vote seen as test of anti-Trump sentiment  —  Brisbane and Sydney, Australia CNN  —  Australia's Prime Minister Anthony Albanese has secured a second term in office in a disastrous night for his conservative rivals … ",
    "url": "https://cnn.com/2025/05/03/australia/australia-election-results-albanese-dutton-intl-hnk"
  },
  {
    "text": "How Trump lost conservatives the Australian election  —  Prime Minister Anthony Albanese is on track to form a majority government, powered by a backlash to U.S.-style MAGA politics.  —  SYDNEY, Australia — Incumbent Prime Minister Anthony Albanese secured a come-from-behind win … ",
    "url": "https://www.politico.eu/article/donald-trump-cost-conservative-australia-election-takeaway/"
  },
  {
    "text": "Vance defends Trump's post depicting AI-generated image of himself as pope  —  The vice president said he is “fine with people telling jokes.”  —  Vice President JD Vance defended President Donald Trump after he posted an AI image of himself as pope on Truth Social, dismissing the post as a joke.",
    "url": "https://www.politico.com/news/2025/05/03/vance-ai-pope-trump-00325197"
  },
  {
    "text": "Trump Posts an Image of Himself as Pope  —  The president has joked about being the next pontiff, but the image, which appeared to be A.I.-generated, took things a step further and drew some pushback.  —  President Trump on Tuesday had a ready answer when reporters asked who he would like to see become the next supreme pontiff.",
    "url": "https://www.nytimes.com/2025/05/03/us/politics/trump-pope-photo.html"
  },
  {
    "text": "Embattled Voice of America's fate uncertain after brief apparent reprieve  —  Trump has targeted the government-funded media outlet that has been off the air for almost two months.  —  The future of Voice of America remains in flux after a federal appellate court Saturday paused a ruling reversing … ",
    "url": "https://www.politico.com/news/2025/05/03/voice-of-america-resume-broadcasting-00325193"
  },
  {
    "text": "Company Boasts Spending Up To $20 Million On Trump Crypto Coin To Buy Influence  —  The arrangement puts money in Trump's pocket in return for the opportunity to change policy — exactly the sort of pay-to-play scheme critics warned about.  —  WASHINGTON — An international trucking logistics firm … ",
    "url": "https://www.huffpost.com/entry/trump-coins-freight-influence_n_68153967e4b03d516aad99d3"
  },
  {
    "text": "L.A. federal prosecutors resign over plea deal for convicted sheriff's deputy, sources say  —  Several federal prosecutors — including the chief of the Public Corruption and Civil Rights Section — have submitted their resignations following a plea deal offered by the new U.S. attorney … ",
    "url": "https://www.latimes.com/california/story/2025-05-03/los-angeles-federal-prosecutors-resign-deputy-plea"
  },
  {
    "text": "More than 15,000 USDA employees take Trump's offer to resign  —  Their departures will affect how the department administers food safety and nutrition programs, conducts research and offers services to farmers.  —  At least 15,000 Agriculture Department employees have taken … ",
    "url": "https://www.politico.com/news/2025/05/03/more-than-15000-employees-resign-agriculture-department-trump-00324834"
  },
  {
    "text": "Trump administration plans to cut thousands of employees at spy agencies  —  Sources familiar with the situation said the downsizing would cut about 1,000 to 1,200 employees at the Central Intelligence Agency.  —  The Trump administration plans to significantly shrink the workforce … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-administration-cut-thousands-employees-spy-agencies-rcna204648"
  },
  {
    "text": "Don't Look at Stock Markets.  Look at the Ports.  —  A drop in maritime traffic suggests that the worst is yet to come.  —  Stock markets plunged for days after President Donald Trump announced steep tariffs on imports from around the world.  The sell-off ebbed only when he suspended most … ",
    "url": "https://www.theatlantic.com/economy/archive/2025/05/trump-tariff-shipping-ports/682673/"
  },
  {
    "text": "Lawsuit Against Humanities Endowment Offers Details on DOGE  —  Three scholarly groups are challenging the recent cancellation of most grants by the National Endowment for the Humanities.  —  Three major scholarly groups have sued the National Endowment for the Humanities and Elon Musk's Department … ",
    "url": "https://www.nytimes.com/2025/05/02/arts/humanities-endowment-doge-grants.html"
  },
  {
    "text": "Inside Waltz's ouster: Before Signalgate, talks with Israel angered Trump  —  The fired national security adviser engaged in intense coordination with Israeli Prime Minister Benjamin Netanyahu about military options against Iran ahead of an Oval Office meeting between the Israeli leader and Trump, two people said.",
    "url": "https://www.washingtonpost.com/politics/2025/05/03/waltz-trump-israel/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2MjQ0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3NjI3MTk5LCJpYXQiOjE3NDYyNDQ4MDAsImp0aSI6ImMzNzJhNDgyLTlhYjAtNGMzZS04N2M3LWFkYTQyYzYxZGM1NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzAzL3dhbHR6LXRydW1wLWlzcmFlbC8ifQ.bWnAb6nqV9dU4waDOYJNMC1mMAT_ARkp-wQGqajQfEo&itid=gfta"
  },
  {
    "text": "Trump Rages at Own Judge After Ruling Halting Deportations Under Wartime Act  —  DID IT TO YOURSELF  —  “Our Country, as we know it, is finished!” the president wrote after a court ruled he could not deport migrants without due process.  —  President Donald Trump had a meltdown Saturday … ",
    "url": "https://www.thedailybeast.com/trump-rages-at-own-judge-after-ruling-halting-deportations-under-wartime-act/"
  },
  {
    "text": "Harvard's President Alan Garber Talks About His Legal Fight With Trump  —  Alan Garber became a hero to liberals after Harvard resisted the federal government.  At the same time, he is trying to remake campus culture in ways the Trump administration might appreciate.",
    "url": "https://www.nytimes.com/2025/05/03/us/harvard-alan-garber-trump-administration.html"
  },
  {
    "text": "Justice Department hasn't filed Eric Adams docs, despite court order  —  The public may not see any other documents in this case.  —  NEW YORK — The Justice Department failed to publicly disclose documents in the now-dismissed corruption case against New York City Mayor Eric Adams by a Friday deadline … ",
    "url": "https://www.politico.com/news/2025/05/03/eric-adams-search-warrant-00325199"
  },
  {
    "text": "‘Do I Look Like I Care?’:  AOC Shreds Trump's Border Czar In Blunt Free Speech Reminder  —  The congresswoman slammed Tom Homan after he claimed she could be in “trouble” over her “know your rights” advice.  —  Rep. Alexandria Ocasio-Cortez (D-N.Y.) tore apart White House border czar Tom Homan … ",
    "url": "https://www.huffpost.com/entry/aoc-alexandria-ocasio-cortez-trump-tom-homan-immigration_n_68155361e4b08215e5f69edd"
  },
  {
    "text": "Visual Analysis Shows U.S. Likely Bombed Yemen Migrant Detention Center  —  Videos and photos reveal remnants of at least three U.S.-made GBU-39 bombs at the site of an April 28 attack.  The strike killed 68 African migrants, according to the Houthis, a militant group that controls northern Yemen.",
    "url": "https://www.nytimes.com/video/world/middleeast/100000010137049/us-bombing-yemen-migrant-shelter.html?smtyp=cur&smid=bsky-nytimes"
  },
  {
    "text": "Trump is trying to chill the investigative journalism that holds him to account  —  So much of what the public knows about President Trump's chaotic governance stems from robust reporting, including leaks from anonymous sources in the government.  —  But Trump and his aides are now actively trying … ",
    "url": "https://cnn.com/2025/05/03/media/analysis-trump-world-press-freedom-day-chill-journalism"
  }
]