[
  {
    "text": "Hidden-camera video shows Project 2025 co-author discussing his secret work preparing for a second Trump term  —  Last month, Russell Vought sat in a five-star Washington, DC, hotel suite, bowing his head in prayer with two men he thought were relatives of a wealthy conservative donor.",
    "url": "https://www.cnn.com/2024/08/15/politics/russ-vought-project-2025-trump-secret-recording-invs/"
  },
  {
    "text": "Walz Says He'll Make Debate With JD Vance All About Project 2025  —  HE CAN'T WAIT  —  Donald Trump and JD Vance have sidestepped discussions about the right-wing blueprint but their Democratic opponents are determined to make it a key talking point in the campaign.",
    "url": "https://www.thedailybeast.com/tim-walz-says-hell-make-debate-with-jd-vance-all-about-project-2025"
  },
  {
    "text": "New hidden camera video reinforces Trump's Project 2025 problem  —  The former president knows that Project 2025 is unpopular.  But he can't distance himself from its contents or its authors.  —  When Donald Trump was president, Russell Vought joined the White House Office of Management and Budget.",
    "url": "https://www.washingtonpost.com/politics/2024/08/15/new-hidden-camera-video-reinforces-trumps-project-2025-problem/"
  },
  {
    "text": "Trump Will Try to Drag Kamala Into the Mud With Him  —  It's his only play.  —  ∙ Paid  —  1. Mud Pit  —  One of the things we're hearing from Good Republicans is that Donald Trump is falling down on the job by indulging in his usual personal attacks and shenanigans.",
    "url": "https://www.thebulwark.com/p/trump-will-try-to-drag-kamala-into"
  },
  {
    "text": "Aides not telling Trump red states “looking worse than they should” to avoid upsetting him: report  —  “This election was his to lose, and he's losing it,” says longtime Republican pollster  —  Early in July, a poll showing President Joe Biden leading former President Donald Trump … ",
    "url": "https://www.salon.com/2024/08/15/aides-not-telling-red-states-looking-worse-than-they-should-to-avoid-upsetting-him-report/"
  },
  {
    "text": "Trump VP pick JD Vance is seen posing with three female classmates at boys' urinals in unearthed high school photo  — 18-year-old JD Vance was snapped posing with three girls in the boys' bathroom  — The photo appeared in the 2003 yearbook of Middletown High School in Ohio",
    "url": "https://www.dailymail.co.uk/news/article-13742781/JD-Vance-posing-female-classmates-urinals-photo.html"
  },
  {
    "text": "Unearthed Photo Shows Teen JD Vance Posing in Bathroom With Three Girls at Urinals  —  WIZZ GOING ON?  —  A resurfaced yearbook photo shows the GOP vice presidential nominee next to three girls pretending to use the urinals in his high school's bathroom.  —  JD Vance, no fan … ",
    "url": "https://www.thedailybeast.com/jd-vance-poses-in-bathroom-with-three-girls-at-urinals-in-unearthed-photo"
  },
  {
    "text": "Secret Service approves new plan for Trump to continue outdoor rallies  —  In a first for Trump's 2024 campaign, the agency will use bulletproof glass to shield the Republican nominee, as well as other technical security measures that have not normally been provided for presidential candidates.",
    "url": "https://www.washingtonpost.com/politics/2024/08/15/secret-service-trump-rallies-bulletproof-glass/"
  },
  {
    "text": "Democrats Maintain Edge in New Senate Polls, As Nevada Moves Back to Lean Democrat  —  The 2024 election has already been historic in a number of ways, but November could mark another recent electoral oddity — a rise in ticket-splitting between presidential and Senate races.",
    "url": "https://www.cookpolitical.com/analysis/survey-research/2024-swing-state-project/democrats-maintain-edge-new-senate-polls-nevada"
  },
  {
    "text": "New College of Florida tosses hundreds of library books, empties gender diversity library  —  Hundreds of New College of Florida library books, including many on LGBTQ+ topics and religious studies, are headed to a landfill.  —  A dumpster in the parking lot of Jane Bancroft Cook Library … ",
    "url": "https://www.heraldtribune.com/story/news/education/2024/08/15/new-college-of-florida-throws-away-hundreds-of-library-books-diversity-lgbtq/74814756007/"
  },
  {
    "text": "Harris has opened up a second path to victory, according to The Post's polling model  —  The Democratic nominee could win in the Rust Belt or the Sun Belt and get to the White House, while Donald Trump must win in both geographic regions to triumph.  —  A lot has changed in the presidential race … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/15/kamala-harris-polling-electoral-college-polling-model-donald-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzNjk0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI1MDc2Nzk5LCJpYXQiOjE3MjM2OTQ0MDAsImp0aSI6IjYxYjQ1NzRiLTc4YTQtNDA1NS05NDk0LTY2YjAyNjI0NmI2YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzE1L2thbWFsYS1oYXJyaXMtcG9sbGluZy1lbGVjdG9yYWwtY29sbGVnZS1wb2xsaW5nLW1vZGVsLWRvbmFsZC10cnVtcC8ifQ.F8UT0Xn_3aVoCGHqZDOi_ZWgqDXr88WdtOJNYfSuBUE&itid=gfta"
  },
  {
    "text": "Harris to Unveil Housing Initiatives Aimed at First-Time Buyers  —  Democratic nominee to address thorny economic issue by calling for more construction, tax incentives  —  WASHINGTON—Vice President Kamala Harris will call for the construction of 3 million new housing units in her first four years … ",
    "url": "https://www.wsj.com/politics/elections/kamala-harris-policy-agenda-election-2024-9e057b83"
  },
  {
    "text": "Trump campaign brings Corey Lewandowski back on board  —  The move is part of an expansion of the campaign's ranks  —  Donald Trump's campaign is expanding its ranks as he seeks to regain his footing in the presidential campaign, bringing on a handful of top allies — including former Trump 2016 campaign manager Corey Lewandowski.",
    "url": "https://www.politico.com/news/2024/08/15/trump-campaign-brings-corey-lewandowski-back-on-board-00174155"
  },
  {
    "text": "DOJ says man attacked Florida businesses over perceived support of Israel  —  A Jordanian citizen living in Florida has been charged with attacking businesses over perceived support of Israel, according to a release from the U.S. Attorney's Office, Middle District of Florida.",
    "url": "https://thehill.com/blogs/blog-briefing-room/4829958-doj-man-florida-business-attacks-alleged-support-israel/"
  },
  {
    "text": "Trump seeks to delay his hush money sentencing until after the election  —  His lawyers are seeking to have the conviction overturned on immunity grounds.  —  NEW YORK — Attorneys for Donald Trump asked the judge overseeing the former president's Manhattan criminal case to postpone his sentencing … ",
    "url": "https://www.politico.com/news/2024/08/15/trump-seeks-delay-to-hush-money-sentencing-00174157"
  },
  {
    "text": "White House says deals struck to cut prices of popular Medicare drugs that cost $50 billion yearly  —  WASHINGTON (AP) — The Biden administration is taking a victory lap after federal officials inked deals with drug companies to lower the price for 10 of Medicare's most popular and costliest drugs … ",
    "url": "https://apnews.com/article/biden-drug-prices-medicare-prescriptions-34886d6f362c242be268c05d5efd5411"
  },
  {
    "text": "Inside the rift that could define the future of Pennsylvania politics  —  A dispute between Sen. John Fetterman and Gov. Josh Shapiro spilled into the open during Kamala Harris' VP search.  It could roil state and Democratic politics for years.  —  John Fetterman was angry.",
    "url": "https://www.nbcnews.com/politics/elections/rift-define-future-pennsylvania-politics-rcna165614?taid=66be5e5e4b96700001cc2fac"
  },
  {
    "text": "When Is “Recyclable” Not Really Recyclable?  When the Plastics Industry Gets to Define What the Word Means.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Is there anything more pathetic than a used plastic bag?",
    "url": "https://www.propublica.org/article/plastics-industry-redefine-recyclable-ftc-grocery-bags"
  },
  {
    "text": "August 2024 National Poll: Harris 50%, Trump 46%  —  Home Polls August 2024 National Poll: Harris 50%, Trump 46%  —  Independents, Younger Voters Swing Toward Harris  —  The first Emerson College Polling national survey following President Biden's decision not to seek re-election finds … ",
    "url": "https://emersoncollegepolling.com/august-2024-national-poll-harris-50-trump-46/"
  },
  {
    "text": "The Saudi Payments to Trump Are More Important than the Suspected Egyptian One  —  As you know, I was calling on the press to focus on the suspected $10 million payment Egypt made to Trump since before it was cool — since even before the WaPo significantly advanced the story over a month later.",
    "url": "https://www.emptywheel.net/2024/08/15/the-saudi-payments-to-trump-are-more-important-than-the-suspected-egyptian-one/"
  },
  {
    "text": "Eric Adams and His Campaign Receive Subpoenas in Federal Investigation  —  A new round of federal grand jury subpoenas in the investigation of Mayor Eric Adams and his 2021 fund-raising seeks a wide range of information.  —  Federal prosecutors investigating Mayor Eric Adams of New York … ",
    "url": "https://www.nytimes.com/2024/08/15/nyregion/eric-adams-fbi-investigation.html"
  },
  {
    "text": "Montana's top court strikes down parental consent law for minors seeking abortion  —  Montana's highest court on Wednesday ruled that a law requiring minors to get parental consent when seeking an abortion violated the state's constitution, upholding a legal challenge by Planned Parenthood.",
    "url": "https://www.reuters.com/legal/montanas-top-court-strikes-down-parental-consent-law-minors-seeking-abortion-2024-08-14/"
  },
  {
    "text": "Musk's New AI Image Generator Immediately Used to Troll Him  —  OBVIOUSLY  —  Images flooded X showing Musk carrying out a school shooting with Mickey Mouse or being led on a leash by Donald Trump.  —  Elon Musk's AI chatbot launched a new image generation feature Wednesday … ",
    "url": "https://www.thedailybeast.com/musks-new-ai-image-generator-grok-2-immediately-used-to-troll-him"
  },
  {
    "text": "What Are Females For?  —  Republican vice presidential nominee JD Vance really does love to run his mouth on podcasts.  The latest unearthed audio has him agreeing with a conservative podcast host on what women are for once we hit menopause: Helping to raise children is “the whole purpose of the postmenopausal female.”",
    "url": "https://jill.substack.com/p/what-are-females-for"
  },
  {
    "text": "JD Vance: Amazon funded Black Lives Matter so riots would destroy rival retailers  —  Loading...  WASHINGTON  —  In 2021, J.D. Vance gave a speech to a conservative think tank on “woke capital” - and accused Amazon of funding Black Lives Matter in order to burn down the competition.",
    "url": "https://www.csmonitor.com/USA/Politics/2024/0815/jd-vance-speech-bezos-amazon-abortion"
  }
]