[
  {
    "text": "Poll Finds Wide Disapproval of Biden on Gaza, and Little Room to Shift Gears  —  Opinion is split between those wanting the war to end and those pressing for a definitive Israeli victory, and the divide is starkest among older and younger generations.  —  Opinion is split between those wanting … ",
    "url": "https://www.nytimes.com/2023/12/19/us/politics/biden-israel-gaza-poll.html"
  },
  {
    "text": "Playbook: Dropping the H-bomb on 2024  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  NEW NYT/SIENA POLL — Among registered voters: Trump beats Biden, 46% to 44%.  Among likely voters: Biden beats Trump, 47% to 45%.  Toplines ... Crosstabs",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/19/dropping-the-h-bomb-on-2024-00132405"
  },
  {
    "text": "Fox anchor Bret Baier compares Biden's vaccine mandates and student loan relief to Trump's attempted coup  —  Fox News' purported “straight news anchor” Bret Baier pushed an unbelievable false equivalency on Monday, during an interview with former Rep. Liz Cheney (R-WY).",
    "url": "https://www.mediamatters.org/bret-baier/fox-anchor-bret-baier-compares-bidens-vaccine-mandates-and-student-loan-relief-trumps"
  },
  {
    "text": "Federal judge orders documents naming Jeffrey Epstein's associates to be unsealed  —  More than 150 people are expected to be identified in early January.  —  Jeffrey Epstein attends Launch of RADAR MAGAZINE at Hotel QT on May 18, 2005.  —  A federal judge in New York has ordered … ",
    "url": "https://abcnews.go.com/US/federal-judge-orders-documents-naming-jeffrey-epsteins-associates/story?id=105779882"
  },
  {
    "text": "Nearly 200 People Tied to Pedophile Jeffrey Epstein Will Be Publicly Named in New Year: Judge  —  The names of at least two journalists are among those that will be revealed, according to the documents  —  The names of nearly 200 people connected to pedophile sex trafficker Jeffrey Epstein … ",
    "url": "https://themessenger.com/news/nearly-200-people-tied-to-pedophile-jeffrey-epstein-will-be-publicly-named-in-new-year-judge"
  },
  {
    "text": "Tucker Carlson rips DeSantis' political operation as ‘nastiest’ and ‘stupidest’ he's seen  —  A member of DeSantis' team appeared to respond with a jab at Donald Trump's campaign.  —  Former Fox News host Tucker Carlson lit into Florida Gov. Ron DeSantis' allies during Turning Point USA's AmericaFest … ",
    "url": "https://www.politico.com/news/2023/12/19/tucker-carlson-rips-desantis-political-operation-as-nastiest-and-stupidest-hes-seen-00132523"
  },
  {
    "text": "Biden resists his age limitations, causing tension  —  President Biden's reluctance to acknowledge his physical limitations at age 81 is causing some tension on his team, as senior aides and First Lady Jill Biden push him to rest more and be vigilant about his health going into 2024.",
    "url": "https://www.axios.com/2023/12/19/biden-resistance-age-trump-election-2024"
  },
  {
    "text": "$750 a month, no questions asked, improved the lives of homeless people  —  For L.A. Times Subscribers  —  If 100 homeless people were given $750 per month for a year, no questions asked, what would they spend it on?  —  That question was at the core of a controlled study conducted … ",
    "url": "https://www.latimes.com/california/story/2023-12-19/750-a-month-no-questions-asked-improved-the-lives-of-homeless-people"
  },
  {
    "text": "Counsel withdraws for former Kanye West publicist, Trump co-defendant Trevian Kutti  —  Trevian Kutti (Fulton County Sheriff's Office)  —  FULTON COUNTY, Ga. - The attorneys representing Trevian Kutti, a co-defendant of Donald Trump and former publicist for Kanye West, have filed a motion to withdraw as counsel of record.",
    "url": "https://www.fox5atlanta.com/news/counsel-withdraws-for-former-kanye-west-publicist-trump-co-defendant-trevian-kutti"
  },
  {
    "text": "Trump Georgia Co-Defendant's Lawyers File Notice to Withdraw from RICO Case  —  Defense lawyers for Trevian Kutti, the former publicist for the rapper known as Kanye West, on Monday night filed notice they want to drop their client in the Fulton County case  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-georgia-trevian-kutti-codefendant-lawyers-notice-withdraw"
  },
  {
    "text": "Turning Point USA conference-goers yell hate slurs at Black and gay GOPer: video  —  A Black and openly gay conservative influencer posted a video to X that apparently shows him being heckled with homophobic slurs by “white supremacists” during the right-wing Turning Point USA conference currently being held in Phoenix.",
    "url": "https://www.rawstory.com/turning-point-usa-2666660490/"
  },
  {
    "text": "Mexico to challenge Texas' new ‘inhumane’ migration law, president says  —  Mexican President Andres Manuel Lopez Obrador on Tuesday said his government was preparing to challenge a new Texas law allowing state law enforcement to arrest suspected migrants, which he called “inhumane.”",
    "url": "https://www.reuters.com/world/americas/mexico-challenge-texas-new-inhumane-migration-law-president-says-2023-12-19/"
  },
  {
    "text": "Trump Is Scrambling to Block One Particular Expert Witness in His New E. Jean Carroll Case  —  Donald Trump's lawyers want to bar the same expert witness who came up with a hefty calculation in Rudy Giuliani's defamation case from testifying in a new E. Jean Carroll lawsuit.",
    "url": "https://www.thedailybeast.com/donald-trump-scrambles-to-block-expert-witness-ashlee-humphreys-in-his-new-e-jean-carroll-case"
  },
  {
    "text": "Prosecutors eyed obstruction charges months before Jack Smith took over Trump case  —  A newly unsealed court document underscores the Justice Department's long pursuit of evidence to support the obstruction allegations now lodged against Trump.  —  Months before special counsel Jack Smith took … ",
    "url": "https://www.politico.com/news/2023/12/19/obstruction-charges-jack-smith-trump-case-00132500"
  },
  {
    "text": "Ex-Proud Boys leader is sentenced to over 3 years in prison for Capitol riot plot  —  A former leader of the far-right Proud Boys extremist group was sentenced on Tuesday to more than three years behind bars for joining a plot to attack the U.S. Capitol nearly three years ago.",
    "url": "https://apnews.com/article/charles-donohoe-proud-boys-capitol-riot-trump-2c4bf37d2dd4f1dc82d6a1caa423a205"
  },
  {
    "text": "Tuberville may drop remaining holds on military nominations, citing end of the year  —  Chuck Schumer has said he plans to bring up the four-star military promotions this week.",
    "url": "https://www.politico.com/live-updates/2023/12/19/congress/tuberville-holds-senate-military-00132486"
  },
  {
    "text": "GOP Lawmaker: Congressional Colleagues ‘Compromised’ on Jeffrey Epstein Flight Logs  —  The Tennessee congressman said Marsha Blackburn was ‘snubbed’ when trying to subpoena the flight records for the infamous ‘Lolita Express’  —  Rep. Tim Burchett, R-Tenn., is accusing colleagues of being … ",
    "url": "https://themessenger.com/politics/tim-burchett-epstein-flight-logs-senate-blocked"
  }
]