[
  {
    "text": "Trump's border power play is a push for civil war  —  Donald Trump wants Congress to refuse to do any deal until he can win and create the “PERFECT” border  —  Donald Trump is having a rolling hissy fit that's escalating by the day.  From courtrooms to rallies to incoherent interviews … ",
    "url": "https://www.salon.com/2024/01/26/donald-border-powerplay-is-a-push-for-civil/"
  },
  {
    "text": "Nikki Haley touts $1.2 million in donations after Trump vows to blacklist her donors  — Nikki Haley's presidential campaign said it raised $1.2 million in one day after former President Donald Trump vowed to blacklist Haley's donors.  — Haley's campaign said it has taken a total … ",
    "url": "https://www.cnbc.com/2024/01/26/nikki-haley-touts-1point2-million-in-donations-after-trump-vows-to-blacklist-her-donors.html"
  },
  {
    "text": "California Gov. Newsom Blasts ‘Weak’ GOP, Says They're ‘Rolling Over’ For Trump  —  The former president has called Republicans, urging them to kill the upcoming border security legislation  —  Democratic California Gov. Gavin Newsom branded the Republican Party as “pathetically weak” for … ",
    "url": "https://themessenger.com/politics/california-gov-newsom-blasts-weak-gop-says-theyre-rolling-over-for-trump"
  },
  {
    "text": "Protest Convoy Headed to Southern Border Is Calling Itself an ‘Army of God’  —  Experts say that the Christian nationalist rhetoric adds a dangerous dimension to the standoff between Texas and the Federal Government.  —  A trucker convoy of “patriots” is heading to the U.S. border with Mexico next week … ",
    "url": "https://www.vice.com/en/article/5d9adk/trucker-convoy-eagle-pass-texas-border-dispute-christian-nationalism"
  },
  {
    "text": "Border standoff between Texas, feds intensifies as governor defies Supreme Court ruling  —  This week, the Supreme Court sided with federal agents to remove razor wire put in place by Texas along the Rio Grande.  The state is using wire and state agents to block Border Patrol from accessing a section of the border in Eagle Pass.",
    "url": "https://www.pbs.org/newshour/show/border-standoff-between-texas-feds-intensifies-as-governor-defies-supreme-court-ruling"
  },
  {
    "text": "Judge Threatens to Send Trump Lawyer Alina Habba ‘in the Lockup’ at E. Jean Carroll Trial  —  The blockbuster remark came moments before closing arguments in Trump's second trial in a case brought by E. Jean Carroll  —  A federal judge threatened Donald Trump's attorney Alina Habba with jail time on Friday … ",
    "url": "https://themessenger.com/politics/trump-alina-habba-jail-e-jean-carroll-federal-judge-threat"
  },
  {
    "text": "Donald Trump storms out of closing arguments in E Jean Carroll trial  —  The former president continued to attack the woman suing him for defamation after his testimony on Thursday  —  Why is Donald Trump back in court against E. Jean Carroll?  —  Roughly 20 minutes after walking into the courtroom … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-storms-out-court-carroll-trial-b2485495.html"
  },
  {
    "text": "E. Jean Carroll defamation case live updates: ‘He is not the victim,’ Carroll's attorney says of Trump  —  The trial will determine if Trump owes any more for defaming E. Jean Carroll.  —  Former President Donald Trump is on trial this week in New York City to determine whether … ",
    "url": "https://abcnews.go.com/US/live-updates/trump-defamation-trial/?id=106403966"
  },
  {
    "text": "Statement from President Joe Biden on Decision to Pause Pending Approvals of Liquefied Natural Gas Exports  —  In every corner of the country and the world, people are suffering the devastating toll of climate change.  Historic hurricanes and floods wiping out homes, businesses, and houses of worship.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/26/statement-from-president-joe-biden-on-decision-to-pause-pending-approvals-of-liquefied-natural-gas-exports/"
  },
  {
    "text": "Ex-coal CEO who called himself ‘Trumpier than Trump’ launches Democratic Senate bid in West Virginia  —  A former CEO of a coal company who once said he is “Trumpier than Trump” has launched a bid for Senate as a Democrat in West Virginia.  —  Don Blankenship, who previously ran … ",
    "url": "https://thehill.com/homenews/campaign/4431661-coal-blankenship-trumpier-than-trump-democratic-senate-west-virginia/"
  },
  {
    "text": "Mainstream media bloodbath: News outlets slash jobs as business suffers  —  Nearly a dozen mainstream media companies are gutting staff and scrambling to rescue their struggling businesses. … But an ongoing bloodbath is decimating news outlets nationwide.",
    "url": "https://www.axios.com/2024/01/26/media-layoffs-strikes-journalism-dying"
  },
  {
    "text": "U.S. pauses funding to UNRWA after 12 staffers accused of involvement in Oct. 7 attack … - State Department spokesperson Matthew Miller said the U.S. is “extremely troubled by the allegations” and the administration has “temporarily paused additional funding for UNRWA while we review … ",
    "url": "https://www.axios.com/2024/01/26/unrwa-gaza-hamas-israel-attack"
  },
  {
    "text": "Speaker Johnson: Senate border deal ‘dead on arrival’ in House  —  Speaker Mike Johnson (R-La.) said in a Friday letter to his colleagues that Senate legislation addressing the border and aid to Ukraine and other countries would have been “dead on arrival” in the House, if reports about its terms are true.",
    "url": "https://thehill.com/homenews/house/4431375-speaker-johnson-senate-border-deal-dead-on-arrival-in-house/"
  },
  {
    "text": "Missouri GOP Lawmaker Floats Rule Change to Bring Back Duels  —  A senator could challenge another to mortal combat if the first's “honor is impugned.”  —  Bitter divisions between Republicans in the Missouri Senate culminated in a proposed rule change that would allow senators to settle … ",
    "url": "https://www.thedailybeast.com/missouri-gop-lawmaker-floats-rule-change-to-bring-back-duels"
  },
  {
    "text": "Justice Department Announces Surge of Resources to Fight Violent Crime in Washington, D.C.  —  For Immediate Release  —  The Justice Department announced today that it will surge additional law enforcement tools and resources to target those most responsible for violent crime and carjackings in Washington, D.C.",
    "url": "https://www.justice.gov/opa/pr/justice-department-announces-surge-resources-fight-violent-crime-washington-dc"
  },
  {
    "text": "Another longtime House Democrat announces retirement  —  Rep. Dutch Ruppersberger (D-Md.) on Friday became the latest veteran House member to announce plans to retire from Congress at the end of this year. … - “But it is time to pass the torch to a younger generation of leaders … ",
    "url": "https://www.axios.com/2024/01/26/another-longtime-house-democrat-announces-retirement"
  },
  {
    "text": "White House offers unredacted Jan. 6 transcripts to GOP — with conditions  —  House Republicans have pushed for the records for months as they've cast doubt on the Jan. 6 select committee's work.",
    "url": "https://www.politico.com/live-updates/2024/01/26/congress/new-white-house-move-jan-6-transcripts-saga-00137977"
  },
  {
    "text": "The Pentagon planned to train troops from coup states.  It backed off under scrutiny.  —  The U.S. military has reversed course on some — but not all — of its plans to train with those involved in coups d'etat or accused of human rights abuses  —  The Pentagon has abruptly abandoned plans … ",
    "url": "https://www.washingtonpost.com/national-security/2024/01/26/pentagon-military-training-human-rights/"
  },
  {
    "text": "Leading Museums Remove Native Displays Amid New Federal Rules  —  The American Museum of Natural History is closing two major halls as museums around the nation respond to updated policies from the Biden administration.  —  The American Museum of Natural History will close … ",
    "url": "https://www.nytimes.com/2024/01/26/arts/design/american-museum-of-natural-history-nagpra.html"
  },
  {
    "text": "Transgender swimmer Lia Thomas in secret legal challenge against ban  —  Exclusive: Thomas has enlisted Canadian law firm Tyr to represent her after going to the Court of Arbitration for Sport  —  Lia Thomas, the swimmer at the centre of one sport's biggest transgender storms … ",
    "url": "https://www.telegraph.co.uk/swimming/2024/01/25/transgender-swimmer-lia-thomas-legal-challenge-ban/"
  },
  {
    "text": "Texas senator who voted to acquit Paxton calls to reopen impeachment trial  —  In a court filing last week, Texas Attorney General Ken Paxton's office said they would not contest accusations he violated the Whistleblower Act  —  Texas Sen. Drew Springer (R-Muenster) wrote a letter … ",
    "url": "https://www.nbcdfw.com/news/politics/lone-star-politics/texas-senator-who-voted-to-acquit-paxton-calls-to-reopen-impeachment-trial/3444726/"
  }
]