[
  {
    "text": "RNC fires dozens of employees after Trump-backed leadership takes over  —  About 60 people were told they were no longer employed, according to a person with direct knowledge  —  The new leadership team at the Republican National Committee — handpicked by former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/11/rnc-trump-firings/"
  },
  {
    "text": "Trump's renewed attacks against E. Jean Carroll open the door for new lawsuit, lawyer says  —  An attorney for a longtime advice columnist who won an $83.3 million defamation award against Donald Trump suggested Monday that a new defamation lawsuit was possible against the ex-president … ",
    "url": "https://apnews.com/article/e-jean-carroll-trump-defamation-columnist-9a9932b83d2f7dcae1b63701f6405352"
  },
  {
    "text": "Calling Out a Would-Be Bully In Chief  —  To ignore bad behavior is to normalize it.  Here at Steady we will continue to publicize Donald Trump's outrageous conduct as long as he exhibits it.  —  Insecurity Parading as Strength  —  At a Saturday campaign rally in Georgia, Trump mocked President Biden's stutter.",
    "url": "https://steady.substack.com/p/calling-out-a-would-be-bully-in-chief"
  },
  {
    "text": "Trump's Biden Mockery Upsets People Who Stutter: 'We've Heard This Before'  —  The former president mimicked his rival while at a rally over the weekend.  For those who stutter, his remark “hits that familiar humiliation feeling.”  —  Róisín McManus has stuttered her whole life.",
    "url": "https://www.nytimes.com/2024/03/11/us/politics/trump-mocks-biden-stutter.html"
  },
  {
    "text": "Republican Voters Against Trump Plans $50 Million Ad Campaign  —  The group, Republican Voters Against Trump, will run a series of homemade videos of Americans who voted for him in the past but say they can no longer do so in 2024.  —  A Republican group dedicated to opposing former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/republican-voters-against-trump.html"
  },
  {
    "text": "Robert Hur will testify as private citizen with help from Trumpworld figures  —  EXCLUSIVE: Ex-Special Counsel arranged to leave Justice Department the day before his appearance with the House Judiciary Committee  —  Special Counsel Robert Hur to testify on Biden's handling of classified documents",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/robert-hur-trump-special-counsel-b2510944.html"
  },
  {
    "text": "Robert Hur, Special Counsel Who Investigated Biden, to Testify Before Congress  —  Republicans are likely to pepper him about his justifications for not charging the president.  Democrats will almost certainly slam him for making broad assertions about Mr. Biden's memory.",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/robert-hur-biden-report.html"
  },
  {
    "text": "Boeing whistleblower found dead in US  —  Prior to his death, whistleblower John Barnett was testifying against Boeing over concerns about standards.",
    "url": "https://www.bbc.com/news/business-68534703"
  },
  {
    "text": "Who posted the $91 million bond for Trump?  Follow the Russian connections.  —  Trump Posts $92 Million Bond to Support Jury Award to E. Jean Carroll in Defamation Suit - Time  —  Where did the money for the bond come from?  Read Seth Abaramson's article.",
    "url": "https://thedemlabs.org/2024/03/11/chubb-posts-91-million-bond-for-trump-defamation-case-follow-russian-connections/"
  },
  {
    "text": "Exclusive: ‘Trump Employee 5,’ who unknowingly helped move classified documents, speaks out  —  Watch the full interview with Kaitlan Collins at 9 p.m. ET Monday on “The Source.”  —  CNN  —  A longtime Mar-a-Lago employee who is a central witness in the investigation … ",
    "url": "https://www.cnn.com/2024/03/11/politics/trump-employee-5-classified-documents-mar-a-lago/"
  },
  {
    "text": "House GOP report aims to undermine Jan. 6 committee … - A senior Democratic congressional aide called the report “yet another attempt to rewrite the history of January 6th and whitewash the events of that horrible, bloody, and violent day.”  — Rep. Bennie Thompson (D-Miss.) … ",
    "url": "https://www.axios.com/2024/03/11/house-republican-report-jan-6-committee"
  },
  {
    "text": "Florida teachers can discuss sexual orientation and gender ID under 'Don't Say Gay' bill settlement  —  Students and teachers will be able to speak freely about sexual orientation and gender identity in Florida classrooms, provided it's not part of instruction, under a settlement reached … ",
    "url": "https://apnews.com/article/florida-dont-say-gay-bill-settlement-987904b3e19122d719cf468034746b6e"
  },
  {
    "text": "Polish Leader to Press for Surge in NATO Spending to Counter Russia  —  President Andrzej Duda of Poland plans to use a White House meeting on Tuesday to propose that NATO members increase their military spending by at least half.  —  The president of Poland plans to use a White House meeting … ",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/biden-poland-nato-duda-tusk.html"
  },
  {
    "text": "Britt backlash stokes GOP fears about losing women voters  —  Sen. Katie Britt's (R-Ala.) State of the Union response is shining a light on the GOP's struggle to appeal to women voters ahead of November's elections.  —  The rebuttal was met with an avalanche of backlash for being out of touch … ",
    "url": "https://thehill.com/homenews/campaign/4524790-britt-backlash-stokes-gop-fears-about-losing-women-voters/"
  },
  {
    "text": "Biden effigy beaten, kicked at Kansas county GOP event, drawing outrage  —  A Republican fundraiser in the Kansas City suburbs on Friday night at which attendees beat and kicked an effigy of President Biden has sparked bipartisan outrage and calls for the GOP leaders responsible for the event to resign.",
    "url": "https://www.washingtonpost.com/nation/2024/03/11/biden-effigy-kansas-republican-event/"
  },
  {
    "text": "Meta's stock drops after Trump calls Facebook ‘an enemy of the people’  —  The stock of Meta Platforms dropped Monday after former President Trump labeled Facebook as “an enemy of the people” earlier that day.  —  Shares for Meta, the parent company of Facebook, dropped by about 4.5 percent … ",
    "url": "https://thehill.com/policy/technology/4524989-metas-stock-drops-after-trump-calls-facebook-an-enemy-of-the-people/"
  },
  {
    "text": "Senators Urge Biden to Stop Arming Israel, Citing Violation of U.S. Aid Law  —  An independent and seven Democrats argued in a letter that the administration had run afoul of a part of a law that bars military aid from going to any country that blocks humanitarian aid.",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/democrats-biden-israel-letter.html"
  },
  {
    "text": "On the Tripwire of a ‘Red Line,’ It's Often Presidents Who Trip  —  Barack Obama drew one for Syria.  George W. Bush drew several, for North Korea and Iran.  Now President Biden has drawn one for Israel.  The hard part is figuring out what to do when they are crossed.",
    "url": "https://www.nytimes.com/2024/03/12/us/politics/biden-red-line-israel.html"
  }
]