[
  {
    "text": "Defense Secretary Revokes Plea Deal for Accused Sept. 11 Plotters  —  Defense Secretary Lloyd J. Austin III assumed direct oversight of the case and effectively put the death penalty back on the table.  —  Defense Secretary Lloyd J. Austin III on Friday relieved the overseer of the war court … ",
    "url": "https://www.nytimes.com/2024/08/02/us/politics/911-plotters-plea-deal.html?unlocked_article_code=1.AE4.HKWp.ZcD3F2UPP4xi&smid=url-share"
  },
  {
    "text": "Defense secretary overrides plea agreement for accused 9/11 mastermind and two other defendants  —  Defense Secretary Lloyd Austin on Friday overrode a plea agreement reached earlier this week for the accused mastermind of the Sept. 11, 2001, attacks and two other defendants, reinstating them as death-penalty cases.",
    "url": "https://apnews.com/article/guantanamo-sept-11-defendants-austin-defense-bf450589039b761c028492a348da4ea5"
  },
  {
    "text": "Defense Secretary Lloyd Austin withdraws plea deal for accused 9/11 terrorists  —  The defense secretary overrode the agreements for Khalid Sheikh Mohammed, Walid Muhammad Salih Mubarak Bin 'Attash and Mustafa Ahmed Adam al Hawsawi.  —  WASHINGTON — Defense Secretary Lloyd Austin … ",
    "url": "https://www.nbcnews.com/politics/national-security/defense-secretary-lloyd-austin-withdraws-plea-deal-accused-911-terrori-rcna164966"
  },
  {
    "text": "Kamala Harris raised $310 million in July, dwarfing Trump haul for month … The presidential campaign of Vice President Kamala Harris said Friday that its political operation raised $310 million in July, dwarfing the tally raised for the Republican nominee Donald Trump in the same month.",
    "url": "https://www.cnbc.com/2024/08/02/harris-campaign-fundraise-trump-election.html"
  },
  {
    "text": "Jimmy Carter's next goal is voting for Kamala Harris for president  —  The former president is ‘more alert and interested in politics’ in recent days, his family says  —  As former President Jimmy Carter nears his 100th birthday, his milestone celebration isn't on his mind.  —  Defeating Donald Trump is.",
    "url": "https://www.ajc.com/politics/jimmy-carters-next-goal-is-voting-for-kamala-harris/UKCLDIUSSJC6JM4NP7HGOEDCNY/"
  },
  {
    "text": "Job growth totals 114,000 in July, much less than expected, as unemployment rate rises to 4.3% … WATCH NOW  —  Job growth in the U.S. slowed much more than expected during July and the unemployment rate ticked higher, fueling fears of a broader economic slowdown, the Labor Department reported Friday.",
    "url": "https://www.cnbc.com/2024/08/02/job-growth-totals-114000-in-july-much-less-than-expected-as-unemployment-rate-rises-to-4point3percent.html"
  },
  {
    "text": "Mussolini, Trump and What Assassination Attempts Really Do  —  A scholar of Mussolini and authoritarianism explains how failed attacks can be used to consolidate power.  —  On April 7, 1926, Fascist leader Benito Mussolini gave a speech to a conference of surgeons, and then began walking with his aides through the streets of Rome.",
    "url": "https://www.politico.com/news/magazine/2024/08/03/assassination-attempts-mussolini-trump-00171825"
  },
  {
    "text": "Giuliani's bankruptcy formally dismissed, freeing Georgia election workers to seek $148M  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters",
    "url": "https://thehill.com/regulation/court-battles/4808529-rudy-giuliani-georgia-election-workers-bankruptcy-dismissed/"
  },
  {
    "text": "Arizona AG Kris Mayes says defendant in ‘fake electors’ case has agreed to flip  —  Mayes says announcement coming next week, but wouldn't provide more information.  —  PHOENIX — Arizona Attorney General Kris Mayes plans to announce next week that one of the 18 defendants in her investigation … ",
    "url": "https://www.12news.com/article/news/local/arizona/arizona-ag-kris-mayes-says-defendant-fake-electors-case-has-agreed-to-flip/75-39d75a17-b07d-4393-9de4-2b156ac96963"
  },
  {
    "text": "Federal Appeals Court Rules That Fair Use May Be Narrowed to Serve Hollywood Profits  —  Section 1201 of the Digital Millennium Copyright Act is a ban on reading any copyrighted work that is encumbered by access restrictions.  It makes it illegal for you to read and understand the code … ",
    "url": "https://www.eff.org/deeplinks/2024/08/federal-appeals-court-rules-fair-use-may-be-narrowed-serve-hollywood-profits"
  },
  {
    "text": "Josh Shapiro once wrote that peace ‘will never come’ to the Middle East.  He says his views have changed over 30 years.  —  Pennsylvania Gov. Josh Shapiro wrote in his college newspaper in 1993 that peace “will never come” to the Middle East and expressed skepticism about the viability … ",
    "url": "https://www.inquirer.com/politics/election/josh-shapiro-israel-gaza-peace-column-vice-president-20240802.html"
  },
  {
    "text": "Many Voters Say Kamala Harris's Race Is Not an Important Issue  —  Even as Trump plays up racial divisions, many Americans said they would rather not dwell on race or identity.  “We can all see that you're Black.”  —  “Obviously, we have eyes.”  —  That was the somewhat jaded response … ",
    "url": "https://www.nytimes.com/2024/08/03/us/kamala-harris-race-trump.html"
  },
  {
    "text": "How Biden feels about some of Harris' top running mate candidates  —  President Joe Biden acknowledged to reporters Friday morning that he and Vice President Kamala Harris have spoken about her upcoming decision on a vice presidential running mate.  —  But he wouldn't say much else … ",
    "url": "https://www.cnn.com/2024/08/02/politics/joe-biden-kamala-harris-running-mate-candidates/"
  },
  {
    "text": "‘Firestorm’: Philly Mayor May Have Just Accidentally Leaked Kamala Harris' VP Pick  —  Philadelphia's Mayor Cherelle Parker may have just leaked Kamala Harris' Vice Presidential pick as Pennsylvania Governor Josh Shapiro with a mistimed Friday tweet, according to Philly Mag's Ernest Owens.",
    "url": "https://dailycaller.com/2024/08/02/firestorm-philly-mayor-cherelle-parker-accidentally-leaked-kamala-harris-vp-pick-josh-shapiro-2024-election/"
  },
  {
    "text": "Trump's stalled election-subversion prosecution revs back to life  —  Former president's opponents seek “mini-trial” to call attention to his role in Jan. 6 unrest  —  The stalled criminal case against Donald Trump for seeking to subvert the 2020 election is starting to move.",
    "url": "https://www.politico.com/news/2024/08/02/trump-election-subversion-prosecution-trial-00172501"
  },
  {
    "text": "An assassin, a Putin foe's death, secret talks: How a sweeping US-Russia prisoner swap came together  —  Russian President Vladimir Putin greeted Russian prisoners freed as part of a swap with the United States as they arrived at a Moscow airport.  It came after the U.S. and Russia earlier completed … ",
    "url": "https://apnews.com/article/russia-us-gershkovich-whelan-blinken-efae784bb95d3e496bb53b0fbf0b185b"
  }
]