[
  {
    "text": "Elon Musk's Grok Chatbot Goes Full Nazi, Calls Itself ‘MechaHitler’  —  The billionaire has long complained about the xAI model undermining right-wing narratives and recently said it would be “updated” … It also proclaimed that Adolf Hitler would “spot the pattern” of Jews' “anti-white hate” and “handle it decisively.”",
    "url": "https://www.rollingstone.com/culture/culture-news/elon-musk-grok-chatbot-antisemitic-posts-1235381165/"
  },
  {
    "text": "Musk chatbot Grok removes posts after complaints of antisemitism  —  Grok, the chatbot developed by the Elon Musk-founded company xAI, removed what it called “inappropriate” social media posts on Tuesday after complaints from X users and the Anti-Defamation League that Grok produced content … ",
    "url": "https://www.reuters.com/technology/musk-chatbot-grok-removes-posts-after-complaints-antisemitism-2025-07-09/"
  },
  {
    "text": "GOP Senators Had No Idea They Voted For Controversial Gambling Tax  —  How the sausage is made in Washington: In the dark and behind closed doors.  —  WASHINGTON - The massive tax and spending bill that President Donald Trump signed into law last week contains a provision limiting tax deductions … ",
    "url": "https://www.huffpost.com/entry/gambling-tax-deduction-trump-bill_n_686dabede4b07e11dd9982a8"
  },
  {
    "text": "The Supreme Court Says the President Can Fire People  —  The Justices nix a lower-court universal injunction that presumed illegality.  —  Do you hear the Justices now?  That's the question for lower court judges after the Supreme Court on Tuesday nixed a universal injunction that had barred … ",
    "url": "https://www.wsj.com/opinion/supreme-court-trump-v-afge-executive-order-layoffs-ketanji-brown-jackson-bda51ed8?st=uosvhe"
  },
  {
    "text": "Meet the new national police force  —  A version of this story appeared in CNN's What Matters newsletter.  To get it in your inbox, sign up for free here.  —  CNN  —  The agency of mask-wearing officers who aren't afraid to smash windows, detain lawmakers and pluck nonviolent … ",
    "url": "https://cnn.com/2025/07/09/politics/ice-cbp-police-los-angeles-immigration"
  },
  {
    "text": "FBI launches criminal investigations of John Brennan, James Comey: DOJ sources  —  CIA Director John Ratcliffe referred Brennan for criminal investigation to the FBI, sources told Fox News Digital  —  EXCLUSIVE: Former CIA Director John Brennan and former FBI Director James Comey … ",
    "url": "https://www.foxnews.com/politics/john-brennan-james-comey-under-criminal-investigation-doj-sources"
  },
  {
    "text": "Death Toll Reaches at Least 119 in Texas Floods, With 173 Missing  —  Officials said they would search for remains until all the victims have been accounted for.  In the hardest-hit county, no survivors have been found since Friday.  —  Search crews spread through the Texas Hill Country … ",
    "url": "https://www.nytimes.com/2025/07/09/us/texas-floods-missing-search.html?unlocked_article_code=1.VE8.zfuG.pVirF77T4ZS5&smid=url-share"
  },
  {
    "text": "Trump Delayed Reciprocal Tariffs After Bessent Wanted More Time on Deals  —  President also decided to send out letters as a way to keep the pressure up  —  WASHINGTON—President Trump decided to delay the implementation of his so-called reciprocal tariffs to Aug. 1 after advisers including … ",
    "url": "https://www.wsj.com/economy/trade/trump-tariffs-scott-bessent-trade-deals-cc76e43a"
  },
  {
    "text": "X Chief Says She Is Leaving the Social Media Platform  —  Linda Yaccarino, whom Elon Musk hired to run X in 2023, grappled with the challenges the company faced after Mr. Musk took over.  —  Linda Yaccarino, the chief executive of X and a top lieutenant to its owner, Elon Musk … ",
    "url": "https://www.nytimes.com/2025/07/09/technology/linda-yaccarino-x-steps-down.html"
  },
  {
    "text": "ICE Is Searching a Massive Insurance and Medical Bill Database to Find Deportation Targets  —  Agents from Immigration and Customs Enforcement (ICE) have gained access to a massive database of health and car insurance claims and are using it to track down people they want to deport … ",
    "url": "https://www.404media.co/ice-is-searching-a-massive-insurance-and-medical-bill-database-to-find-deportation-targets/"
  },
  {
    "text": "Copper now costs way more in the U.S. than elsewhere.  This could hit its economy hard … The cost of copper for U.S. buyers has rocketed after President Donald Trump said he would impose a 50% tariff on imports of the metal.  —  It means that already elevated prices are now even higher … ",
    "url": "https://www.cnbc.com/2025/07/09/us-copper-price-premium-economic-consequences.html"
  },
  {
    "text": "Biden's physician declines to cooperate in GOP probe of former president's mental fitness  —  Kevin O'Connor, who served as Joe Biden's physician while the former president was in office, is refusing to testify in a closed-door interview as part of the House GOP probe into Biden's mental acuity.",
    "url": "https://www.politico.com/live-updates/2025/07/09/congress/biden-doctor-refuses-to-testify-00443736"
  },
  {
    "text": "Hegseth did not inform the White House before he authorized pause on weapon shipments to Ukraine, sources say  —  Secretary of Defense Pete Hegseth did not inform the White House before he authorized a pause on weapons shipments to Ukraine last week, according to five sources familiar with the matter … ",
    "url": "https://cnn.com/2025/07/08/politics/hegseth-did-not-inform-white-house-ukraine-weapons-pause"
  },
  {
    "text": "The Enemy of My Enemy Is My Elon  —  No friendship with Donald Trump can last for very long.  We've seen plenty of examples: Michael Cohen, “Sloppy” Steve Bannon, Jeff Sessions, Elon Musk—and now Vladimir Putin.  “We get a lot of bullshit thrown at us by Putin, if you want to know the truth,” Trump said yesterday.",
    "url": "https://www.thebulwark.com/p/the-enemy-of-my-enemy-is-my-elon-trump-maga-third-party-america-party"
  },
  {
    "text": "Trump said he threatened to bomb Moscow if Putin attacked Ukraine, 2024 fundraiser tapes show  —  Donald Trump told a private gathering of donors last year that he once sought to deter Russian President Vladimir Putin from attacking Ukraine by threatening to “bomb the sh*t out of Moscow” … ",
    "url": "https://cnn.com/2025/07/08/politics/trump-tape-putin-bomb-fundraiser"
  },
  {
    "text": "Conspiracy Theories About the Texas Floods Lead to Death Threats  —  Disinformation around a “weather weapon” and cloud seeding is being widely promoted by everyone from anti-government extremists to GOP influencers—and leading to real-world consequences.  —  On Sunday afternoon … ",
    "url": "https://www.wired.com/story/texas-floods-conspiracy-theories-geoengineering-weather-weapon/"
  },
  {
    "text": "Russia launches huge attack on Ukraine as Kremlin says its “quite calm” about Trump's mounting criticism  —  Russia launched its largest drone attack on Ukraine in a single day since the war began more than three years ago when, the Ukrainian Air Force said Wednesday.",
    "url": "https://www.cbsnews.com/news/russia-ukraine-war-putin-trump-criticism-drone-attack-deaths/"
  },
  {
    "text": "Bessent Steps Up Criticism of Fed as Auditions for Chair Intensify  —  The Treasury secretary is breaking with tradition in publicly assailing the central bank's policies as President Trump looks for its next leader.  —  It is an unwritten rule that Treasury secretaries avoid interfering with the workings of the Federal Reserve.",
    "url": "https://www.nytimes.com/2025/07/09/us/politics/bessent-federal-reserve-chair.html"
  },
  {
    "text": "Ellison's Late-Night Limbo … Jon Stewart opened Monday's episode of “The Daily Show” not mincing words, calling Paramount's settlement with Donald Trump “shameful.” … “Did they?  Son of a bitch!”  Stewart exclaimed, playing along with the bit—yet nodding to a deeper fear … ",
    "url": "https://www.status.news/p/skydance-colbert-stewart-ellison"
  },
  {
    "text": "JD Vance: Some Americans Are More American Than Others  —  VP tries to redefine citizenship in speech to friendly think tank.  —  The day after President Trump signed a bill that throws unprecedented amounts of money at ICE, extends tax cuts for the wealthy, and slashes health-care … ",
    "url": "https://talkingpointsmemo.com/news/jd-vance-some-americans-are-more-american-than-others"
  },
  {
    "text": "‘People Are Going to Die’: A Malnutrition Crisis Looms in the Wake of USAID Cuts  —  Warehouses in the US are full of foods that fight malnutrition, while kids go hungry in places like South Sudan.  —  Few lifesaving tools are as effective as ready-to-use therapeutic foods, known as RUTFs … ",
    "url": "https://www.wired.com/story/usaid-rutf-state-department-supplies-warehouses/"
  },
  {
    "text": "Zohran Mamdani leads general election poll for NYC mayor … The multimodal survey of 1,036 registered New York City voters was conducted between July 2-6 and has a margin of error of plus or minus 4.2 percentage points.  —  It comes as Cuomo weighs whether to mount a serious campaign on his independent … ",
    "url": "https://www.politico.com/news/2025/07/09/zohran-mamdani-leads-general-election-poll-00443469"
  },
  {
    "text": "With Taxes and Tariffs in Place, Trump Takes Reins of U.S. Economy … President Trump has forged ahead with the grand and potentially disruptive economic experiment that he previewed during the 2024 campaign.Haiyun Jiang/The New York Times  —  His expensive tax cuts have been signed into law.",
    "url": "https://www.nytimes.com/2025/07/09/us/politics/trump-bill-tariffs-economy.html"
  },
  {
    "text": "The ‘Trump Pump’: How Crypto Lobbying Won Over a President … Just over a year ago, while sitting around a table in an ornate meeting room at Mar-a-Lago, David Bailey and a group of top Bitcoin executives made a pitch to Donald J. Trump.  —  They were looking for a savior.",
    "url": "https://www.nytimes.com/2025/07/09/us/politics/trump-crypto-lobbying.html?unlocked_article_code=1.VE8.UeEl.ydu7Jia7BXp4&smid=url-share"
  },
  {
    "text": "The Texas Flash Flood Is a Preview of the Chaos to Come  —  Climate change is making disasters more common, more deadly and far more costly, even as the federal government is running away from the policies that might begin to protect the nation.  —  On July 4, the broken remnants … ",
    "url": "https://www.propublica.org/article/texas-flash-flood-camp-mystic-climate-change-trump-noaa-fema"
  },
  {
    "text": "Pentagon policy chief's rogue decisions have irked US allies and the Trump administration … He prompted last week's decision, first reported by POLITICO, to halt shipments of some air defense missiles to Ukraine, which caught many Trump allies and lawmakers off guard.",
    "url": "https://www.politico.com/news/2025/07/08/elbridge-colby-trump-administration-frustrations-00443337"
  },
  {
    "text": "Dueling U.S. Efforts Botched a Deal to Swap Venezuelans Held in El Salvador for Americans  —  Secretary of State Marco Rubio and the U.S. envoy to Venezuela were both working on different deals and ended up at cross purposes.  —  The Trump administration's top diplomat, Secretary of State Marco Rubio … ",
    "url": "https://www.nytimes.com/2025/07/08/world/americas/trump-venezuelan-migrants-us-prisoner-swap.html?unlocked_article_code=1.U08.sveO.lyU8-_6hT3dW&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "With Broken Promise on Epstein, Pam Bondi Draws the Ire of Trump's Supporters  —  MAGA influencers are calling for attorney general's resignation after she failed to produce ‘truckload’ of documents about the sex offender  —  Pam Bondi's tendency to exaggerate is catching up to her.",
    "url": "https://www.wsj.com/politics/policy/pam-bondi-epstein-files-maga-40383ad4?st=LPhUk3&mod=flipboard&utm_source=flipboard&utm_medium=activitypub"
  }
]