[
  {
    "text": "I Love Joe Biden.  But We Need a New Nominee.  —  I'm a lifelong Democrat; I make no apologies for that.  I'm proud of what my party represents and what it stands for.  As part of my participation in the democratic process and in support of my chosen candidate, I have led some of the biggest fund-raisers in my party's history.",
    "url": "https://www.nytimes.com/2024/07/10/opinion/joe-biden-democratic-nominee.html"
  },
  {
    "text": "Biden support slips in deep blue New York: 'We're a battleground state now'  —  Democrats are worried the president is taking New York for granted as the state becomes surprisingly competitive.  —  NEW YORK — President Joe Biden has a new problem: a competitive race in deep blue New York.",
    "url": "https://www.politico.com/news/2024/07/10/biden-new-york-trouble-00167198"
  },
  {
    "text": "Biden says it's Dem ‘elites’ who are alarmed about his debate.  Voters in Wisconsin beg to differ.  —  There's little consensus, however, that Biden dropping out of the presidential race would improve the party's odds in November.  —  MILWAUKEE, Wisconsin — Voters and local candidates … ",
    "url": "https://www.politico.com/news/2024/07/10/biden-age-wisconsin-voters-00167214"
  },
  {
    "text": "Trump airs list of false grievances at Florida rally: 'We don't eat bacon any more'  —  Ex-president returns to campaign trail in Doral and makes baseless accusations but doesn't name running mate  —  Donald Trump returned to the campaign trail in Florida on Tuesday night … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/09/trump-doral-florida-campaign-rally"
  },
  {
    "text": "Playbook PM: Watch Nancy Pelosi  —  THE CATCH-UP  —  GOOD NIGHT AND GOOD LUCK — “I Love Joe Biden.  But We Need a New Nominee,” by George Clooney in the NYT: “It's devastating to say it, but the JOE BIDEN I was with three weeks ago at the fund-raiser was not the Joe ‘big F-ing deal’ Biden of 2010.",
    "url": "https://www.politico.com/newsletters/playbook-pm/2024/07/10/watch-nancy-pelosi-00132333"
  },
  {
    "text": "Watch: Trump Fumbles Repeatedly in Terrifying Speech at Florida Rally  —  Donald Trump gave a particularly incoherent speech during a recent rally, as he rattled through a lengthy list of odd grievances that didn't quite ring true, devoid of some very necessary segues.",
    "url": "https://newrepublic.com/post/183641/watch-trump-fumbles-terrifying-speech-florida-rally"
  },
  {
    "text": "Ron DeSantis will get an RNC speaking slot after a ‘change in schedule’  —  The Florida governor's team, however, says they always expected they would be invited to speak at the convention.  —  After initially being given no role at next week's Republican National Convention, Ron DeSantis … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ron-desantis-rnc-speaking-slot-change-schedule-rcna161137"
  },
  {
    "text": "George Stephanopoulos Says Biden Can't Serve Another 4 Years  —  GEORGE STEPHANOPOULOS BIDEN CAN'T SERVE 4 MORE YEARS … 6:28 PM PT — George Stephanopoulos tells TMZ, “Earlier today, I responded to a question from a passerby.  I shouldn't have.”  An ABC spokesperson tells TMZ … ",
    "url": "https://www.tmz.com/2024/07/09/george-stephanopoulos-president-joe-biden-cant-serve-4-more-years-sidewalk-election/"
  },
  {
    "text": "Trump Donors on the Brink of Civil War Over J.D. Vance for VP  —  KILLBILLY ELEGY  —  Part of what brought Vance to the dance may be his undoing.  Donors are scared of him. … In his rise from Donald Trump critic to viable contender to be the presumptive Republican nominee's running mate, Sen. J.D. Vance of Ohio has come so far.",
    "url": "https://www.thedailybeast.com/trump-donors-on-the-brink-of-civil-war-over-jd-vance-for-vp"
  },
  {
    "text": "The Lie David Sanger Told to Sustain NYT's Non-Stop Campaign against Joe Biden  —  Predictably, the NYT treated President Biden's speech to kick off NATO's 75th Anniversary as if Biden merely invented the date and the event and maybe even NATO itself to cover up a shoddy debate performance.",
    "url": "https://www.emptywheel.net/2024/07/10/the-lie-david-sanger-told-to-sustain-nyts-non-stop-campaign-against-joe-biden/"
  },
  {
    "text": "Pelosi: “Time is running short” for Biden to decide on re-election bid … - Biden has repeatedly said that he's not dropping out and dismissed calls to step aside following a poor debate performance that set off a panic among some members of his own party.  — He sent a letter … ",
    "url": "https://www.axios.com/2024/07/10/nancy-pelosi-biden-2024-run"
  },
  {
    "text": "Judge signals he's likely to dismiss Rudy Giuliani's bankruptcy case  —  The judge said he intended to issue a final ruling by Friday.  —  A New York federal judge is poised to dismiss Rudy Giuliani's bankruptcy case, expressing concern Wednesday that Giuliani has used the proceedings … ",
    "url": "https://www.politico.com/news/2024/07/10/rudy-giuliani-bankruptcy-hearing-00167325"
  },
  {
    "text": "Clarence Thomas Took Free Yacht Trip to Russia, Chopper Flight to Putin's Hometown: Dems  —  NYET  —  The allegedly secret gifts were disclosed in a letter from two Democratic senators that accused Thomas of potentially committing tax fraud.  —  Supreme Court Justice Clarence Thomas … ",
    "url": "https://www.thedailybeast.com/clarence-thomas-accepted-yacht-trip-to-russia-chopper-flight-to-putins-hometown-democrats"
  },
  {
    "text": "‘Deranged’: Critics React To Trump's ‘Fat Pig’ Rally Rant  —  The former president went off on a strange tangent about a “beautiful waitress” before pivoting to a backhanded attack on Chris Christie.  —  LOADING  —  In his first campaign rally since the presidential debate … ",
    "url": "https://www.huffpost.com/entry/trump-fat-pig-rant-reactions_n_668e4da5e4b0a62057b8ca78"
  },
  {
    "text": "Behind the Curtain: Trump's new 2024 plan … (You could flip the first two, but the campaign puts Pennsylvania first because it's the biggest swing state, and because Biden desperately needs it.)  — Job 1 for the V.P. nominee, besides raising money, will be to park in Pennsylvania to try … ",
    "url": "https://www.axios.com/2024/07/10/trump-undecided-voters-plan-election-2024"
  },
  {
    "text": "Nevada's Washoe County votes against certifying recount results of 2 local primaries  —  Commissioners in Washoe County, Nevada's second most populous county, refused Tuesday to certify the results of local recounts from two June primaries, an unusual move that may have implications … ",
    "url": "https://www.cbsnews.com/news/nevada-county-refuses-to-certify-recount-election-results/"
  },
  {
    "text": "Democrats are justified in being freaked out about November  —  Biden's position is worse than any Democrat's in decades — and much worse than his own in 2020.  —  On CNN on Tuesday night, Sen. Michael Bennet (D-Colo.) said what a lot of Democrats seem to be thinking: His party is in deep trouble … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/10/biden-polling-drop-out-bennet/"
  },
  {
    "text": "Margaret Sullivan on how the media normalizes Trump  —  “When you have such a disparity between candidates, it's not fulfilling our duty to treat them as equals.”  —  ∙ Paid … When we spoke with Margaret Sullivan about a month ago to get her view on coverage of the 2024 election … ",
    "url": "https://www.publicnotice.co/p/margaret-sullivan-interview-media-trump-biden-24"
  }
]