[
  {
    "text": "Louis Gossett Jr., 1st Black man to win supporting actor Oscar, dies at 87  —  Louis Gossett Jr., the first Black man to win a supporting actor Oscar and an Emmy winner for his role in the seminal TV miniseries “Roots,” has died.  He was 87.  —  Gossett's first cousin Neal L. Gossett told … ",
    "url": "https://apnews.com/article/louis-gossett-jr-dies-1e86e1441ec8b614a282f3de22490a07"
  },
  {
    "text": "Trump's actual record comes back to haunt him  —  This isn't 2016 anymore. … Donald Trump continued his Nazi-style rhetoric at his most recent campaign rally in Dayton, Ohio, warning that if he didn't win the presidential election, “it's going to be a bloodbath for the country.”",
    "url": "https://www.publicnotice.co/p/trump-policy-record-2024-entitlements-abortion"
  },
  {
    "text": "Anti-Israel protesters disrupt Biden's lavish NYC fundraiser with Obama, Clinton, where tickets went for up to $500K: ‘War pig’  —  Several waves of protesters disrupted President Biden's grandiose fundraiser at Radio City Music Hall Thursday, where he kicked it with former Presidents Barack Obama … ",
    "url": "https://nypost.com/2024/03/28/us-news/biden-holds-lavish-nyc-grassroots-fundraiser-with-obama-clinton-in-tow-tickets-going-for-up-to-500k/"
  },
  {
    "text": "Biden threatens Russia with costs on Evan Gershkovich arrest anniversary  —  President Joe Biden said on Friday the U.S. will impose costs for Russia's “appalling attempts” to use Americans as bargaining chips in a statement to mark the one-year anniversary of Wall Street Journal reporter Evan Gershkovich's arrest in Russia.",
    "url": "https://www.reuters.com/world/biden-threatens-russia-with-costs-evan-gershkovich-arrest-anniversary-2024-03-29/"
  },
  {
    "text": "Evan Gershkovich's Year in Captivity  —  The U.S. journalist is in prison because Vladimir Putin has made no pretenses about using Americans as human bargaining chips.  —  Evan Gershkovich, a reporter for The Wall Street Journal, has now been held in Russia's infamous Lefortovo prison for a year.",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/03/evan-gershkovich-one-year-in-captivity/677917/"
  },
  {
    "text": "Crystal Mason: Texas woman sentenced to five years over voting error acquitted  —  Appeals court rules Mason, now 49, did not know she was ineligible when she voted in 2016 and throws out conviction  —  The fight for democracy is supported by  —  A Texas appeals court has thrown … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/28/crystal-mason-texas-woman-acquitted"
  },
  {
    "text": "Many GOP billionaires balked at Jan. 6.  They're coming back to Trump.  —  Elite donors are rediscovering their affinity for the former president over taxes — even as he vows to free Jan. 6 defendants, promises mass deportations and faces 88 felony charges",
    "url": "https://www.washingtonpost.com/politics/2024/03/29/trump-billionaires-gop-donors/"
  },
  {
    "text": "Trump Has a Big Problem With GOP Voters  —  NOT DONE YET  —  The GOP primary has been effectively over for weeks, but voters are still showing up to cast their ballots for anyone but Donald Trump. … ZOMBIE PRIMARY  —  Donald Trump may believe the 2024 Republican presidential primary is done—but clearly, it's not done with him.",
    "url": "https://www.thedailybeast.com/trump-has-a-big-problem-with-gop-voters"
  },
  {
    "text": "Trump can't remember much.  He hopes you won't be able to, either.  —  The Very Stable Genius is glitching again.  —  This week, he announced that he is not — repeat, NOT — planning to repeal the Affordable Care Act.  He apparently forgot that he had vowed over and over again to do exactly that … ",
    "url": "https://www.washingtonpost.com/opinions/2024/03/29/trump-collective-amnesia-campaign-strategy/"
  },
  {
    "text": "The real D.C. crime wave  —  Welcome to POLITICO's West Wing Playbook, your guide to the people and power centers in the Biden administration.  —  In a sense, it's a daring crime given that the aircraft and the individual traveling in its executive cabin are among the most heavily secured entities in the world.",
    "url": "https://www.politico.com/newsletters/west-wing-playbook/2024/03/28/the-real-d-c-crime-wave-00149591"
  },
  {
    "text": "Scotland was ‘hoodwinked’ by Donald Trump, says former aide  —  Donald Trump flanked by his children and pipers on the official opening day of the Trump International Golf Links course in Aberdeenshire in 2012  —  The man who helped broker the deal for Donald Trump's first Scottish golf resort … ",
    "url": "https://www.bbc.com/news/uk-scotland-68069245"
  },
  {
    "text": "Cesar Chavez's family to endorse Biden after RFK Jr. claims civil rights leader would've voted for him  —  President Biden is set to be endorsed Friday by members of Cesar Chavez's family — a mostly symbolic gesture, but one meant to send a signal to independent presidential candidate Robert F. Kennedy Jr. … ",
    "url": "https://www.cbsnews.com/news/cesar-chavez-family-endorse-biden-robert-kennedy-jr/"
  },
  {
    "text": "Suicide Mission  —  What Boeing did to all the guys who remember how to build a plane  —  A Boeing Dreamlifter sits on the tarmac at their campus in North Charleston, South Carolina, May 30, 2023.  —  John Barnett had one of those bosses who seemed to spend most of his waking hours scheming to inflict humiliation upon him.",
    "url": "https://prospect.org/infrastructure/transportation/2024-03-28-suicide-mission-boeing/"
  },
  {
    "text": "Why Hasn't Biden Called Chris Christie?  —  The man who never misses a funeral seems to have lost his personal touch when it comes to Republicans he needs — badly — in the fall.  —  Chris Christie's extended flirtation with No Labels should be a wake-up call — for President Joe Biden.",
    "url": "https://www.politico.com/news/magazine/2024/03/29/biden-anti-trump-republicans-00149610"
  },
  {
    "text": "March 28, 2024  —  Yesterday the National Economic Council called a meeting of the Supply Chain Disruptions Task Force, which the Biden-Harris administration launched in 2021, to discuss the impact of the collapse of the Francis Scott Key Bridge and the partial closure of the Port of Baltimore on regional and national supply chains.",
    "url": "https://heathercoxrichardson.substack.com/p/march-28-2024"
  },
  {
    "text": "Va. Gov. Youngkin arrived like a GOP star, but arena failure clouds legacy  —  RICHMOND — No Virginia governor has come into office with a deeper dealmaking background than Glenn Youngkin, who as former co-chief executive of the Carlyle Group made a fortune acquiring and merging companies around the globe.",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/03/28/virginia-youngkin-wizards-arena-legacy/"
  },
  {
    "text": "Taliban edict to resume stoning women to death met with horror  —  Afghan regime's return to public stoning and flogging is because there is ‘no one to hold them accountable’ for abuses, say activists  —  The Taliban's announcement that it is resuming publicly stoning women to death … ",
    "url": "https://www.theguardian.com/global-development/2024/mar/28/taliban-edict-to-resume-stoning-women-to-death-met-with-horror"
  },
  {
    "text": "A Judge Finally Found Fraudulent Votes.  They're All From a Republican.  —  A prominent Georgia state Republican, who has repeatedly claimed the 2020 election was stolen, was found to have voted illegally nine times.  —  Brian Pritchard, the first vice chairman of the state Republican Party … ",
    "url": "https://newrepublic.com/post/180230/georgia-official-vote-illegally"
  },
  {
    "text": "Biden's green economy will break the energy grid  —  The United States economy is in danger of running out of power.  After a decade of flat demand, electricity demand is set to grow by 80% by 2034.  The grid and the Biden administration are not prepared.  The sudden increase in demand … ",
    "url": "https://www.washingtonexaminer.com/restoring-america/courage-strength-optimism/2941511/bidens-green-economy-will-break-the-energy-grid/"
  },
  {
    "text": "U.S. updates how it classifies people by race, ethnicity for first time in decades  —  The changes, announced Thursday by the U.S. Office of Management and Budget, aim to better capture an increasingly diverse country and give policymakers a fuller view of Americans",
    "url": "https://www.washingtonpost.com/politics/2024/03/28/census-update-race-ethnicity/"
  },
  {
    "text": "GOP Biden impeachment witness sues Fox News co-host Tarlov  —  Tony Bobulinski, a former associate of Hunter Biden, filed a $30 million defamation lawsuit against Fox News host Jessica Tarlov over her comments about his legal fees, which she corrected a day later.",
    "url": "https://thehill.com/media/4562793-gop-biden-impeachment-witness-sues-fox-news-co-host-tarlov/"
  }
]