[
  {
    "text": "Trump Escalates Threats as Campaign Enters Dark Final Stretch  —  Top military leaders and high-ranking former officials from his administration have issued warning after warning that Donald J. Trump would rule as a dictator if given the chance.  —  A campaign marked by Donald J. Trump's … ",
    "url": "https://www.nytimes.com/2024/10/26/us/politics/trump-democracy-threats.html"
  },
  {
    "text": "Who won the day?  Harris  —  For at least a couple hours Friday, Kamala Harris assembled a rally star-studded enough to drown out the growing chorus of doubters in her own party.  Those in the crowd wore light-up bracelets flashing red, white and blue, and the screens above the stage read … ",
    "url": "https://www.politico.com/live-updates/2024/10/25/2024-elections-live-coverage-updates-analysis/who-won-the-day-00185667"
  },
  {
    "text": "5 things a tardy Trump said in Traverse City  —  Donald Trump was three hours late to his Friday night rally in Traverse City, Michigan.  We still watched it.  Here's what you missed: Trump apologized for being tardy to his event ... by telling the crowd in this critical battleground state … ",
    "url": "https://www.politico.com/live-updates/2024/10/25/2024-elections-live-coverage-updates-analysis/5-things-a-tardy-trump-said-in-traverse-city-00185674"
  },
  {
    "text": "Mayor Adams refutes Kamala Harris, says Trump is not a fascist as he urges Dems to ‘dial down the temperature’  —  Mayor Adams defended Donald Trump Saturday, slamming claims from Democrats that the Republican nominee is a “fascist” who could be compared to Adolf Hitler.",
    "url": "https://nypost.com/2024/10/26/us-news/mayor-adams-refutes-kamala-harris-says-trump-is-not-a-fascist-as-he-urges-dems-to-dial-down-the-temperature/"
  },
  {
    "text": "Mayor Adams Bucks Harris and Democrats on Calling Trump a ‘Fascist’  —  Mayor Eric Adams of New York, an embattled Democrat who has been indicted on federal corruption charges, has been careful in what he says about the former president.  —  Mayor Eric Adams of New York said on Saturday … ",
    "url": "https://www.nytimes.com/2024/10/26/us/politics/trump-fascist-mayor-adams.html"
  },
  {
    "text": "It has fallen to me, the humor columnist, to endorse Harris for president  —  Isn't this what a newspaper is supposed to do?  —  The Washington Post is not bothering to endorse a candidate in the 2024 presidential election.  (Jeff Bezos, the founder of Blue Origin and the founder … ",
    "url": "https://www.washingtonpost.com/opinions/2024/10/26/washington-post-endorses-kamala-harris-satire/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5OTE1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMzAxMTk5LCJpYXQiOjE3Mjk5MTUyMDAsImp0aSI6IjZmNDVhNGI3LTk2NzUtNDQ2Ny1hOTE1LTJlOTc4YWI4YWFmMSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzEwLzI2L3dhc2hpbmd0b24tcG9zdC1lbmRvcnNlcy1rYW1hbGEtaGFycmlzLXNhdGlyZS8ifQ.-e7OOyCCBjp8Hw059JyTEdGNCsm5REJ6MeNHgnETEnI&itid=gfta"
  },
  {
    "text": "Ex-WaPo Editor: This Is a Straight Bezos-Trump ‘Quid Pro Quo’  —  DIRTY DEAL  —  Robert Kagan tells the Daily Beast that Donald Trump's meeting with Blue Origin executives the day its founder Jeff Bezos killed his paper's Kamala Harris endorsement is proof of a backroom deal.  —  EXCLUSIVE",
    "url": "https://www.thedailybeast.com/ex-washington-post-editor-robert-kagan-this-is-a-straight-jeff-bezos-donald-trump-quid-pro-quo/"
  },
  {
    "text": "Texas poll worker assaulted during early voting  —  An election clerk in San Antonio was allegedly assaulted late Thursday and the suspect, a voter, was arrested, officials said.  —  The suspect was arrested on suspicion of injury to an elderly person, a felony.",
    "url": "https://www.alternet.org/poll-worker/"
  },
  {
    "text": "Elon Musk, enemy of ‘open borders,’ launched his career working illegally  —  Investors in Musk's first company worried about “our founder being deported” and gave him a deadline for obtaining a work visa.  —  PALO ALTO, Calif. — Long before he became one of Donald Trump's biggest donors … ",
    "url": "https://www.washingtonpost.com/business/2024/10/26/elon-musk-immigration-status/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5OTE1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxMzAxMTk5LCJpYXQiOjE3Mjk5MTUyMDAsImp0aSI6IjQxZGVhY2ExLTg4NzQtNDAyYy05ZGU2LTMzYjZjODBjZDQwMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzEwLzI2L2Vsb24tbXVzay1pbW1pZ3JhdGlvbi1zdGF0dXMvIn0.A_tsea6jQIWaQ1Q1Rp1WROrhBlr0IksHUlC4vxqZXY0&itid=gfta"
  },
  {
    "text": "Biden says Elon Musk was an ‘illegal worker’ when he began U.S. career … President Joe Biden called out Tesla and SpaceX CEO Elon Musk, now a Republican megadonor and Trump campaign surrogate, for hypocrisy on immigration on Saturday, saying Musk launched his long career in the U.S. as an … ",
    "url": "https://www.cnbc.com/2024/10/26/biden-elon-musk-illegal-worker-began-career.html"
  },
  {
    "text": "Trump, Who Once Proposed a Muslim Registry, Now Courts Their Votes  —  The former president is reaching out to Muslim and Arab American voters in Michigan, a key battleground state.  —  When he ran for president eight years ago, Donald J. Trump floated the idea of creating a national registry … ",
    "url": "https://www.nytimes.com/2024/10/26/us/politics/trump-muslim-arab-american-voters-michigan.html"
  },
  {
    "text": "Why Is Trump Holding a Rally at Madison Square Garden?  —  New York is not exactly a battleground state.  Here are five reasons Donald J. Trump is holding a rally there in the final days of the presidential campaign.  —  When former President Donald J. Trump decided to take a day off … ",
    "url": "https://www.nytimes.com/2024/10/26/us/politics/trump-rally-madison-square-garden.html"
  },
  {
    "text": "Trump-aligned group is already planning lawsuits over election results  —  A Trump-aligned group that has filed lawsuits in several swing states challenging voter registration lists is already planning to sue over this year's election results, one of the group's founders told USA TODAY.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/27/election-result-lawsuits-planned/75828364007/"
  },
  {
    "text": "Leading civil rights lawyer shows 20 ways Trump is copying Hitler's early rhetoric and policies  —  A new book by one of the nation's foremost civil liberties lawyers powerfully describes how America's constitutional checks and balances are being pushed to the brink by a president … ",
    "url": "https://www.alternet.org/trump-hitler-2669488123/"
  }
]