[
  {
    "text": "Supreme Court Clears Way for Mass Firings at Federal Agencies  —  The Trump administration had asked the justices to block a lower court's ruling that paused the largest phase of the president's efforts to downsize the government.  —  The Trump administration can move forward with plans … ",
    "url": "https://www.nytimes.com/2025/07/08/us/politics/supreme-court-federal-workers-layoffs.html?unlocked_article_code=1.U08.0Mrk.meMp6Z3dy3B0&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "US Supreme Court lifts order that blocked Trump's mass federal layoffs  —  The U.S. Supreme Court cleared the way on Tuesday for President Donald Trump's administration to resume carrying out mass job cuts and the restructuring of agencies, elements of his campaign to downsize and reshape the federal government.",
    "url": "https://www.reuters.com/legal/litigation/us-supreme-court-lifts-order-that-blocked-trumps-mass-federal-layoffs-2025-07-08/"
  },
  {
    "text": "Supreme Court allows Trump to launch mass layoff and restructuring plans  —  The justices said they were not ruling on the legality of specific firing plans but simply allowing the administration to launch such efforts while litigation continues.  —  The Supreme Court on Tuesday cleared … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/08/supreme-court-trump-mass-layoffs-federal-workers/"
  },
  {
    "text": "Trump says he's “thinking about” taking over D.C.  —  President Trump revived the idea of taking over Washington, D.C. on Tuesday, saying the capital city should be run “flawlessly.”  —  Why it matters: Trump is floating his takeover threat amid a high-profile project to build a new NFL stadium … ",
    "url": "https://www.axios.com/2025/07/08/trump-taking-over-dc"
  },
  {
    "text": "Hegseth did not inform the White House before he authorized pause on weapon shipments to Ukraine, sources say  —  Secretary of Defense Pete Hegseth did not inform the White House before he authorized a pause on weapons shipments to Ukraine last week, according to five sources familiar with the matter … ",
    "url": "https://cnn.com/2025/07/08/politics/hegseth-did-not-inform-white-house-ukraine-weapons-pause"
  },
  {
    "text": "Alvarado ICE facility attack: 11 charged in ‘ambush’ on ICE officers, officials say  — 11 people have been arrested in what it calls a “planned ambush” on an ICE facility in Alvarado on July 4.  — Officials say 10-12 individuals in military-style clothing fired fireworks to lure officers out … ",
    "url": "https://www.fox4news.com/news/texas-ice-detention-center-attack-alvarado"
  },
  {
    "text": "Elon Musk's Grok Chatbot Goes Full Nazi, Calls Itself ‘MechaHitler’  —  The billionaire has long complained about the xAI model undermining right-wing narratives and recently said it would be “updated” … It also proclaimed that Adolf Hitler would “spot the pattern” of Jews' “anti-white hate” and “handle it decisively.”",
    "url": "https://www.rollingstone.com/culture/culture-news/elon-musk-grok-chatbot-antisemitic-posts-1235381165/"
  },
  {
    "text": "Top House Democrats demand release of Epstein files that mention Trump  —  Exclusive: Jamie Raskin and 15 others accuse justice department of withholding Epstein files to protect Trump  —  Hugo Lowell and Chris Stein in Washington  —  House Democrats on Tuesday demanded … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/08/house-democrats-epstein-files-trump"
  },
  {
    "text": "The Tariff Beatings Will Continue Until Morale Improves  —  The video above has nothing to do with the subject of this post.  A big red-headed woodpecker got to work right in front of me yesterday, and I thought I'd give him a few seconds before getting to the dreary subject of tariffs.  —  Yes, tariffs.",
    "url": "https://paulkrugman.substack.com/p/the-tariff-beatings-will-continue"
  },
  {
    "text": "JD Vance: Some Americans Are More American Than Others  —  VP tries to redefine citizenship in speech to friendly think tank.  —  The day after President Trump signed a bill that throws unprecedented amounts of money at ICE, extends tax cuts for the wealthy, and slashes health-care … ",
    "url": "https://talkingpointsmemo.com/news/jd-vance-some-americans-are-more-american-than-others"
  },
  {
    "text": "Ag secretary says able-bodied Medicaid recipients should replace immigrant farm workforce  —  Agriculture Secretary Brooke Rollins said millions of adult Medicaid participants who will face stricter work requirements under the GOP megabill should replace foreign farm workers deported under … ",
    "url": "https://www.politico.com/live-updates/2025/07/08/congress/rollins-says-able-bodied-medicaid-recipients-should-replace-immigrant-farm-workforce-00442065"
  },
  {
    "text": "FBI launches criminal investigations of John Brennan, James Comey: DOJ sources  —  CIA Director John Ratcliffe referred Brennan for criminal investigation to the FBI, sources told Fox News Digital  —  EXCLUSIVE: Former CIA Director John Brennan and former FBI Director James Comey … ",
    "url": "https://www.foxnews.com/politics/john-brennan-james-comey-under-criminal-investigation-doj-sources"
  },
  {
    "text": "How Insularity Defined the Last Stages of Biden's Career … At the most perilous moment of his presidency, Joseph R. Biden Jr. was all but impossible for anyone outside his tight inner circle to reach.Eric Lee/The New York Times  —  Former President Joseph R. Biden Jr.'s aides did not want him to speak with me.",
    "url": "https://www.nytimes.com/2025/07/08/us/politics/biden-aides-election-age.html?unlocked_article_code=1.U08.sP7n.Rl0Tv7kjzM5S&smid=url-share"
  },
  {
    "text": "Conspiracy Theories About the Texas Floods Lead to Death Threats  —  Disinformation around a “weather weapon” and cloud seeding is being widely promoted by everyone from anti-government extremists to GOP influencers—and leading to real-world consequences.  —  On Sunday afternoon … ",
    "url": "https://www.wired.com/story/texas-floods-conspiracy-theories-geoengineering-weather-weapon/"
  },
  {
    "text": "Ted Cruz Toured the Parthenon Before Heading Home to Texas Disaster: Report  —  Photos appear to show the senator visiting ancient Greek ruins one day after Camp Mystic announced that more than 20 campers had gone missing in the flood.  —  Texas senator Ted Cruz, whose superpower is always doing … ",
    "url": "https://www.vanityfair.com/news/story/ted-cruz-toured-the-parthenon-before-heading-home-to-texas-disaster-report"
  },
  {
    "text": "Alligator Alcatraz detainees allege inhumane conditions at immigration detention center  —  Cuban reggaeton artist Leamsy La Figura, arrested last week in Miami-Dade on assault charges, was transferred to South Florida's new immigration detention facility known as Alligator Alcatraz in the Everglades … ",
    "url": "https://www.cbsnews.com/miami/news/alligator-alcatraz-detainees-allege-inhumane-conditions-at-immigration-detention-center/"
  },
  {
    "text": "Major medical groups sue Health Secretary Robert F. Kennedy Jr. over vaccines  —  Kennedy's track record of undermining vaccine safety and effectiveness prompted the lawsuit.  “We've had enough,” one public health expert said.  —  Several major medical organizations are suing Health Secretary … ",
    "url": "https://www.nbcnews.com/health/health-news/rfk-jr-sued-pediatricians-medical-groups-covid-vaccines-rcna217218"
  },
  {
    "text": "A Marco Rubio impostor is using AI voice to call high-level officials  —  The unknown individual contacted at least five government officials, including three foreign ministers, a U.S. governor and a member of Congress, according to a State Department cable.  —  Summary167",
    "url": "https://www.washingtonpost.com/national-security/2025/07/08/marco-rubio-ai-imposter-signal/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxOTQ3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzMzI5NTk5LCJpYXQiOjE3NTE5NDcyMDAsImp0aSI6IjhkYzljMTliLTQ4OTItNDU1Yy04ZWM1LTk3OTZkNDJhOWFhNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzA4L21hcmNvLXJ1YmlvLWFpLWltcG9zdGVyLXNpZ25hbC8ifQ.FXo72snQ4-mCIcX0ZziTprUYrRvc5av38deD9RnjkUc&itid=gfta"
  },
  {
    "text": "Only Criminals Don't Want To Be Gassed By The Government  —  The United States Attorney's Office for the Central District of California, my former employer, has filed a criminal complaint against Alejandro Orellana, a local immigration activist in Los Angeles.  They've charged him for distributing face masks to protestors.",
    "url": "https://www.popehat.com/p/only-criminals-don-t-want-to-be-gassed-by-the-government"
  },
  {
    "text": "Trump now backs tough Russia sanctions bill, Graham says  —  A bill targeting Russia with substantial new sanctions is gaining momentum in the Senate, with a key GOP senator signaling Tuesday that President Donald Trump is now on board.  “We're moving,” said Sen. Lindsey Graham (R-S.C.) … ",
    "url": "https://www.politico.com/live-updates/2025/07/08/congress/senate-russia-sanctions-lindsey-graham-00443192"
  },
  {
    "text": "Transcript: Trump Blurts Out Awkward Truth about ICE as MAGA Seethes  —  The following is a lightly edited transcript of the July 8 episode of the Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/197676/transcript-trump-blurts-awkward-truth-ice-maga-seethes"
  },
  {
    "text": "Dueling U.S. Efforts Botched a Deal to Swap Venezuelans Held in El Salvador for Americans  —  Secretary of State Marco Rubio and the U.S. envoy to Venezuela were both working on different deals and ended up at cross purposes.  —  The Trump administration's top diplomat, Secretary of State Marco Rubio … ",
    "url": "https://www.nytimes.com/2025/07/08/world/americas/trump-venezuelan-migrants-us-prisoner-swap.html?unlocked_article_code=1.U08.sveO.lyU8-_6hT3dW&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "How The New York Times is (still) getting gamed by the right … Lately, it has been difficult to ignore a tendency at The New York Times to make astonishingly bad news judgments.  The paper's obsession with a view from nowhere is long-standing, but as Republicans increasingly circulate … ",
    "url": "https://www.theverge.com/culture/700082/nyt-mamdani-news-judgment"
  },
  {
    "text": "Trump on DOGE cuts: ‘I would have done it differently’ … Trump praised the Department of Government Efficiency for many of its cuts to the federal workforce, specifically citing the exodus at the Environmental Protection Agency, where more than 1,300 employees have left through the Trump administration's deferred resignation program.",
    "url": "https://www.politico.com/news/2025/07/08/trump-on-doge-cuts-i-would-have-done-it-differently-00442255"
  },
  {
    "text": "Pam Bondi Explains Her Apparent Backtrack on the Epstein ‘Client List’  —  Her comments seemingly contradicted a February interview in which she said, “It is sitting on my desk right now to review.”  — Copy  —  Attorney General Pam Bondi on Tuesday explained her previous comments … ",
    "url": "https://www.notus.org/trump-white-house/pam-bondi-epstein-client-list-donald-trump-cabinet"
  },
  {
    "text": "IRS says churches should be allowed to make political endorsements  —  Since 1954, the IRS has banned nonprofits — including congregations — from participating in political campaigns.  The agency now says political endorsements by churches should be allowed.",
    "url": "https://www.washingtonpost.com/nation/2025/07/08/irs-church-endorsements/"
  },
  {
    "text": "US court strikes down ‘click-to-cancel’ rule designed to make unsubscribing easier  —  Rule would have kept businesses from forcing customers through lengthy chats or other barriers to cancellation  —  A federal rule designed to make canceling subscriptions as easy as signing … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/08/court-click-to-cancel-ruling"
  },
  {
    "text": "Gabbard's team has sought spy agency data to enforce Trump's agenda  —  The Director's Initiative Group has expressed an interest in gaining access to emails and chat logs of the largest U.S. intelligence agencies to root out “weaponization,” according to multiple people familiar with the effort.",
    "url": "https://www.washingtonpost.com/national-security/2025/07/08/gabbard-dig-odni-weaponization-intelligence/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxOTQ3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzMzI5NTk5LCJpYXQiOjE3NTE5NDcyMDAsImp0aSI6ImFmYjhjNDQ5LTc1NGUtNDY1NC04ZWE5LWVlYTMzNDM3YzkyMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzA4L2dhYmJhcmQtZGlnLW9kbmktd2VhcG9uaXphdGlvbi1pbnRlbGxpZ2VuY2UvIn0.7cdYrbt23E431Pjdhlelfx5i4jHkZ42yeoJFMPCZ6HA&itid=gfta"
  },
  {
    "text": "Harvard's Fight Is a Defense of Democracy and Civic Virtue  —  Harvard's case will set precedent for every college that relies on federal grants or hosts international students.  —  Living in a liberal democracy, a free society, doesn't always look like a marble rotunda or a dramatic floor vote.",
    "url": "https://www.liberalcurrents.com/harvards-fight-is-a-defense-of-democracy-and-civic-virtue/"
  },
  {
    "text": "Team Trump struggles to control the Epstein ‘client list’ fire it helped create  —  It was members of the president's own team who helped light the match and fan the flames, starting a political fire that they've clearly lost control over.  —  To know anything about contemporary conservative politics … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/team-trump-struggles-control-epstein-client-list-fire-helped-create-rcna217441"
  },
  {
    "text": "Texas flood exposed America's warped priorities  —  I've always believed there's a lifetime limit on excitement from fireworks — even on July 4 — and that I passed mine many years ago.  Maybe that's why I volunteered to pick up a family member at New York's JFK Airport last Friday night … ",
    "url": "https://www.inquirer.com/columnists/attytood/texas-flood-climate-change-camp-mystic-20250708.html"
  }
]