[
  {
    "text": "SpaceX Positioned to Secure Billions in New Federal Contracts Under Trump  —  Elon Musk's role in the White House allows him to cancel contracts and influence policy, potentially benefiting his companies.  Supporters say he has the best technology.  —  A SpaceX Falcon 9 rocket preparing … ",
    "url": "https://www.nytimes.com/2025/03/23/us/politics/spacex-contracts-musk-doge-trump.html?unlocked_article_code=1.6E4.Js11.uNYKUZdBQkCf"
  },
  {
    "text": "Former US attorney for Eastern District of Virginia Jessica Aber found dead at 43  —  The cause of her death is still under investigation  —  Jessica Aber, former U.S. attorney for the Eastern District of Virginia (EDVA), was found dead Saturday morning, the Alexandria Police Department said.",
    "url": "https://www.nbcwashington.com/news/local/former-us-attorney-for-eastern-district-of-virginia-jessica-aber-found-dead-at-43/3874185/"
  },
  {
    "text": "Former federal prosecutor found dead in Virginia home  —  A former federal prosecutor was found dead Saturday morning at a home in Alexandria, Virginia, authorities said.  —  Officers with the Alexandria Police Department were dispatched to the home at 9:18 a.m. Eastern Time on a report of an unresponsive woman.",
    "url": "https://www.cbsnews.com/news/jessica-aber-former-federal-prosecutor-found-dead-virginia-home/"
  },
  {
    "text": "What the Venezuelans Deported to El Salvador Experienced  —  On the night of Saturday, March 15, three planes touched down in El Salvador, carrying 261 men deported from the United States. … I was there to document their arrival.  —  For more than a year, I have been embedded throughout … ",
    "url": "https://time.com/7269604/el-salvador-photos-venezuelan-detainees/"
  },
  {
    "text": "More US states report measles cases amid vaccine misinformation  —  Ohio, Maryland and Alabama among states to report new cases, with 378 confirmed in first few months of 2025  —  More US states are reporting measles cases as the Texas outbreak expands, surpassing last year's total, amid vaccine misinformation and hesitancy.",
    "url": "https://www.theguardian.com/us-news/2025/mar/23/measles-spread-vaccine-misinformation"
  },
  {
    "text": "March 22, 2025  —  Perhaps in response to the growing outcry over last weekend's rendition of Venezuelan migrants to El Salvador under a legal justification a federal judge has found questionable, President Donald Trump last night told reporters that he didn't sign the proclamation that set that legal process in motion.",
    "url": "https://heathercoxrichardson.substack.com/p/march-22-2025"
  },
  {
    "text": "Homan says Trump administration won't defy judge's order on deportation flights  —  But Trump's “border czar” says he doesn't care what judges think.  —  Tom Homan, President Donald Trump's border czar, appears in ABC News' “This Week” on Mar. 23, 2025.  —  Tom Homan, President Donald Trump's … ",
    "url": "https://abcnews.go.com/Politics/homan-trump-administration-defy-judges-order-deportation-flights/story?id=120058328"
  },
  {
    "text": "Chuck Schumer rejects calls to step down as Senate Democratic leader  —  The Senate minority leader responded to criticism from within his party about his handling of a GOP government funding bill and accused Trump of triggering a constitutional crisis.  —  WASHINGTON — A defiant Senate … ",
    "url": "https://www.nbcnews.com/politics/congress/chuck-schumer-rejects-calls-step-down-senate-democratic-leader-rcna197374"
  },
  {
    "text": "With New Decree, Trump Seeks to Cow the Legal Profession  —  A presidential memorandum aimed at lawyers everywhere struck a menacing tone.  —  President Trump broadened his campaign of retaliation against lawyers he dislikes with a new memorandum that threatens to use government power … ",
    "url": "https://www.nytimes.com/2025/03/22/us/politics/trump-memo-lawyers.html"
  },
  {
    "text": "Democrats Need More Combative Centrists  —  To be an effective opposition, the party needs to win back the Senate — and to do that, it needs to become more moderate.  —  Senate Minority Leader Chuck Schumer is under fire from progressives for not having a clear plan to fight President Donald Trump.",
    "url": "https://www.bloomberg.com/opinion/articles/2025-03-23/democrats-need-more-combative-centrists"
  },
  {
    "text": "Trump Won't Win a War Against the Courts  —  President Trump has wasted no time in his second term in declaring war on the nation's federal judiciary, the country's legal profession and the rule of law.  He has provoked a constitutional crisis with his stunning frontal assault on the third branch … ",
    "url": "https://www.nytimes.com/2025/03/23/opinion/trump-judge-venezuela-deportation.html"
  },
  {
    "text": "IRS nears deal with ICE to share addresses of suspected undocumented immigrants  —  The move toward information-sharing comes as President Donald Trump pushes his administration to use every resource to conduct what he hopes will be the largest mass deportation of immigrants in U.S. history.",
    "url": "https://www.washingtonpost.com/us-policy/2025/03/22/ice-irs-immigrants-deport/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyNjE2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzOTk4Mzk5LCJpYXQiOjE3NDI2MTYwMDAsImp0aSI6ImVlZDViMjExLTkwZDYtNDRkNi1iODA3LTJkOTQyNzRhZjJiOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS91cy1wb2xpY3kvMjAyNS8wMy8yMi9pY2UtaXJzLWltbWlncmFudHMtZGVwb3J0LyJ9.YYErFt49qsNUlix8F8-roAlWjN9SrzqvpFYjc-wOiXs&itid=gfta"
  },
  {
    "text": "CNN Host Says Trump Doesn't ‘Really Do Much’ Before Noon  —  CNN host Kaitlan Collins says President Donald Trump is not a morning person.  “He doesn't really do much in the morning,” Collins said on The New Yorker podcast Friday.  “Maybe he'll be posting, but he's not doing a lot of meetings or press conferences or anything.”",
    "url": "https://www.thedailybeast.com/kaitlan-collins-trump-doesnt-really-do-much-before-noon/"
  },
  {
    "text": "Trump allies press the White House to dial back Elon Musk's media interviews over his Social Security jabs  —  Republicans are voicing concerns about Musk's downsizing efforts, which include closing some Social Security offices and curtailing telephone services.",
    "url": "https://www.nbcnews.com/politics/trump-administration/elon-musk-social-security-concern-trump-allies-rcna197527"
  },
  {
    "text": "Columbia University's Concessions to Trump Seen as a Watershed  —  Threatened with losing $400 million in federal funding, the university agreed to overhaul its protest policies and security practices.  —  Many professors saw it as surrender, a reward to the Trump administration's heavy hand.",
    "url": "https://www.nytimes.com/2025/03/22/nyregion/columbia-trump-concessions-watershed.html"
  },
  {
    "text": "Hanging by a Thread  —  Meta's decisions at the once promising “Twitter killer” serve as a cautionary tale about the risks of prioritizing corporate interests and political appeasement over user trust. … Earlier this week, Meta made a small but notable change to Threads … ",
    "url": "https://www.status.news/p/threads-engagement-meta-bluesky-x"
  },
  {
    "text": "America Is Watching the Rise of a Dual State  —  For most people, the courts will continue to operate as usual—until they don't.  —  On september 20, 1938, a man who had witnessed the rise of fascism packed his suitcases and fled his home in Berlin.  He arranged to have smuggled separately … ",
    "url": "https://www.theatlantic.com/magazine/archive/2025/05/trump-executive-order-lawlessness-constitutional-crisis/682112/?gift=guxsrl_dAdXUP9zqbQPWxXIqlJnvnf_thi93W4-JS0Y&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Protesters denounce Musk, DOGE outside Tesla showroom  —  Jasmine Fernández Antonio FinsPalm Beach Post  —  (This story has been updated to add new information and to change or add a photo or video..)  —  WEST PALM BEACH — Protesters lined up outside the Tesla showroom … ",
    "url": "https://www.palmbeachpost.com/story/news/trump/2025/03/22/demonstrators-denounce-musk-outside-telsa-showroom-in-wpb/82610986007/"
  },
  {
    "text": "Walz reemerges as Democratic fighter with shots at Musk  —  Minnesota Gov. Tim Walz (D) all but disappeared after he and former Vice President Kamala Harris lost the presidential race to President Trump in November.  —  But while Harris has remained out of the spotlight … ",
    "url": "https://thehill.com/homenews/campaign/5208305-gov-tim-walz-rehabilitation-tour/"
  }
]