[
  {
    "text": "Why Biden Was Really Forced Out of the Race, According to Anita Dunn  —  The longtime presidential adviser blames the press and her party for forcing Biden out of the race.  —  Anita Dunn has no regrets about holding a historically early debate between Joe Biden and Donald Trump … ",
    "url": "https://www.politico.com/news/magazine/2024/08/09/anita-dunn-no-regrets-biden-trump-debate-00173348"
  },
  {
    "text": "The Same Old Tired Shtick  —  The Harris-Walz barnstorming tour heads for the Sun Belt today, with rallies scheduled in Arizona and Nevada.  As Politico notes this morning, those events will provide an interesting test for “whether Walz's folksy, Midwestern brand can resonate beyond middle America.”",
    "url": "https://www.thebulwark.com/p/the-same-old-tired-schtick"
  },
  {
    "text": "Harris campaign weaponizes crowd size against Trump … - Vice President Kamala Harris and Minnesota Gov. Tim Walz are drawing huge crowds as they barnstorm swing states this week, generating an exuberant atmosphere that had been missing from the Biden campaign.",
    "url": "https://www.axios.com/2024/08/09/kamala-harris-rally-crowd-size-trump"
  },
  {
    "text": "Willie Brown Says Trump's Helicopter Crash Story Never Happened  —  In a news conference, the former president recounted a brush with death alongside Willie Brown, the former San Francisco mayor.  A few aspects of the story don't hold up to scrutiny.  —  Former President Donald J. Trump told … ",
    "url": "https://www.nytimes.com/2024/08/08/us/politics/trump-helicopter-willie-brown.html?unlocked_article_code=1.Bk4.JcCw._4-K1z1DIapT&smid=url-share"
  },
  {
    "text": "Donald Trump isn't fun anymore: How Kamala Harris stole the show — and extinguished his flame  —  We are currently watching Trump realize for the first time that he might lose again  —  Donald Trump is in a bad way.  —  His campaign has completely lost its bearings with the withdrawal … ",
    "url": "https://www.salon.com/2024/08/09/donald-isnt-fun-anymore-how-kamala-harris-stole-the-show--and-extinguished-his-flame/"
  },
  {
    "text": "Rep. Meeks on Trump presser: Maybe 'he's not all there anymore'  —  Rep. Gregory Meeks (D-N.Y.), the chair of the Congressional Black Caucus (CBC) PAC, on Friday suggested former President Trump may be “not all there anymore” after he held a lengthy and rambling press conference.",
    "url": "https://thehill.com/homenews/campaign/4820426-meeks-trump-press-conference/"
  },
  {
    "text": "Lawrence: ‘Stupidest’ candidate Trump did not answer reporters' questions  —  Donald Trump rambled and lied for over an hour without any follow up questions or fact-checking.  MSNBC's Lawrence O'Donnell says that while he hopes Vice President Harris answers questions from reporters … ",
    "url": "https://www.msnbc.com/the-last-word/watch/lawrence-stupidest-candidate-trump-did-not-answer-reporters-questions-216787525948"
  },
  {
    "text": "Jack Smith Granted Delay in Trump Election Interference Case  —  EXTRA TIME  —  Special Counsel Jack Smith will have three more weeks to come up with a game plan to prosecute of former President Donald Trump.  —  D.C. Circuit Court Judge Tanya Chutkan has granted Special Counsel Jack Smith's request … ",
    "url": "https://www.thedailybeast.com/jack-smith-granted-delay-in-trump-election-interference-case"
  },
  {
    "text": "Man who attacked police at the US Capitol with poles gets 20 years, one of longest Jan. 6 sentences  —  A California man with a history of political violence was sentenced on Friday to 20 years in prison for repeatedly attacking police with flagpoles and other makeshift weapons during the Jan. 6, 2021, riot at the U.S. Capitol.",
    "url": "https://apnews.com/article/david-dempsey-capitol-riot-prison-sentence-d724e95dd3a39951deae482fa3ec4ff5"
  },
  {
    "text": "Oldest Latino civil rights group breaks with past to endorse Harris  —  The Harris-Walz campaign has received the first-ever presidential endorsement from the League of United Latin American Citizens, the oldest and largest Latino civil rights group in the country.",
    "url": "https://thehill.com/homenews/4820488-oldest-latino-civil-rights-group-breaks-with-past-to-endorse-harris/"
  },
  {
    "text": "MAGA Turns on Joe Rogan as He Endorses RFK Jr. and Not Trump  —  TWIN FLAME  —  Right-wingers on X are not impressed that the popular podcaster is throwing his weight behind RFK Jr.  —  Podcast host and comedian Joe Rogan told listeners he supports longshot presidential candidate Robert F. Kennedy Jr. on his show Thursday afternoon.",
    "url": "https://www.thedailybeast.com/joe-rogan-endorses-fellow-vaccine-skeptic-robert-f-kennedy-jr-a-week-after-saying-kamala-harris-could-win"
  },
  {
    "text": "‘Hercules’ Star Kevin Sorbo Tells Kamala Harris to ‘Say the N-word’ If She ‘Really Is Black’  —  UNGODLY  —  Former “Hercules” TV star Kevin Sorbo tweeted that the vice president should say the slur to prove her Blackness, and he was epically torched online for it.",
    "url": "https://www.thedailybeast.com/ex-hercules-star-maga-troll-kevin-sorbo-tells-kamala-harris-to-say-the-n-word-if-she-really-is-black"
  },
  {
    "text": "The Real Reason Trump and Vance Hate Being Called ‘Weird’  —  In 2016, Democrats taunted Donald Trump as “dangerous Donald.”  In 2020, they moved on from dangerous to say that Trump's Republican Party was a threat to the “soul of America.”  Both messages — one relatively successful … ",
    "url": "https://www.nytimes.com/2024/08/09/opinion/trump-vance-harris-walz-weird.html?unlocked_article_code=1.Bk4.lghK.zkTkB8hofqGL&smid=url-share"
  },
  {
    "text": "New Nevada poll sees Harris with biggest lead over Trump yet  —  The poll also found that Nevada's three Democratic congressional incumbents lead their re-election races.  —  Election 2024 Elections Polls  —  A new poll of likely Nevada voters found Vice President Kamala Harris … ",
    "url": "https://thenevadaindependent.com/article/new-nevada-poll-sees-harris-with-biggest-lead-over-trump-yet"
  },
  {
    "text": "Tim Walz repeatedly hosted Muslim cleric who celebrated Oct. 7 and shared pro-Hitler website link  —  Democratic vice presidential nominee Tim Walz, on at least five occasions as governor of Minnesota, hosted a Muslim cleric who celebrated Hamas's Oct. 7 attack last year on Israel and promoted … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3114957/tim-walz-repeatedly-hosted-muslim-cleric-oct-7-pro-hitler-website-link/"
  },
  {
    "text": "Trump Has Started to Piss Off White Supremacists … White supremacist, Hitler fan, and far-right political pundit Nick Fuentes shockingly revoked his support from Donald Trump's campaign early Friday, announcing on social media that he and his allies believed that the presidential bid is headed for a “catastrophic loss.”",
    "url": "https://newrepublic.com/post/184729/donald-trump-nick-fuentes-white-supremacists-support"
  },
  {
    "text": "Democrats, sink this swiftboat immediately  —  The smear campaign against Tim Walz is stale and cynical.  But left alone, it can do damage.  —  Republicans have rummaged through their vast library of dirty tricks and pulled out a 20-year-old playbook to attack Minnesota Gov. Tim Walz … ",
    "url": "https://www.washingtonpost.com/opinions/2024/08/08/republican-vance-walz-swiftboating/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMDg5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0NDcxOTk5LCJpYXQiOjE3MjMwODk2MDAsImp0aSI6IjNhZjJhYjkxLWUxOTYtNGQ1OC05NGI0LTAxNjFmZDJlNzU1ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI0LzA4LzA4L3JlcHVibGljYW4tdmFuY2Utd2Fsei1zd2lmdGJvYXRpbmcvIn0.KId20wLYap2aAZNJcUF6Nz1rOKhGFbATgiQ7jqCLxXo&itid=gfta"
  }
]