[
  {
    "text": "Johnson ‘all in’ for Trump  —  Speaker Mike Johnson said he's “all in” for former President Donald Trump's 2024 bid to return to the White House during a Tuesday morning appearance on CNBC's “Squawk Box.”  “I have endorsed him wholeheartedly,” Johnson said, adding he was … ",
    "url": "https://www.politico.com/live-updates/2023/11/14/congress/johnson-trump-2024-00127013"
  },
  {
    "text": "Trump Wants Us to Know He Will Stop at Nothing in 2025  —  Over the last few weeks, we've gotten a pretty good idea of what Donald Trump would do if given a second chance in the White House.  And it is neither exaggeration nor hyperbole to say that it looks an awful lot like a set … ",
    "url": "https://www.nytimes.com/2023/11/14/opinion/trump-stephen-miller-immigration.html"
  },
  {
    "text": "Trump's Truth Social has lost $73 million in less than 2 years, new filing says  —  Former President Trump's social media platform, Truth Social, has lost $73 million in net sales since the platform's official launch in February 2022, according to a new financial disclosure filing from Digital World Acquisition Corp. (DWAC).",
    "url": "https://thehill.com/homenews/media/4308023-trumps-truth-social-has-lost-73-million-in-less-than-two-years-new-filing-says/"
  },
  {
    "text": "‘The boss is not going to leave’: Proffer videos show ex-Trump lawyers telling Georgia prosecutors about efforts to overturn 2020 election  —  ABC News obtained video from interviews held with Jenna Ellis and Sidney Powell.  —  Jenna Ellis reads a statement after Ellis pleading guilty … ",
    "url": "https://abcnews.go.com/US/boss-leave-proffer-videos-show-trump-lawyers-telling/story?id=104831939"
  },
  {
    "text": "Ex-Trump allies detail efforts to overturn election in Georgia plea videos  —  A former attorney for Donald Trump has told Georgia prosecutors that a top presidential aide said to her in December 2020 that “the boss” did not plan to leave the White House “under any circumstances,” … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/13/trump-georgia-case-videos-overturn-2020-election/"
  },
  {
    "text": "‘I do my best not to revisit this’: Emotional Paul Pelosi tells court of the moment he was attacked by a hammer-wielding David DePape in his own home in front of cops - having stalled him by calling 911  — DePape said he was looking for Nancy Pelosi, the then-Speaker of the House, and attacked Paul with a hammer, fracturing his skull",
    "url": "https://www.dailymail.co.uk/news/article-12745289/paul-pelosi-david-depape-attacked-san-francisco-trial-testimony.html"
  },
  {
    "text": "Paul Pelosi Describes the Night He Was Attacked at Home  —  Mr. Pelosi told a federal jury that the intruder was targeting his wife, the former House speaker Nancy Pelosi, and wanted to “take her out.”  —  It was a typical low-key evening for Paul Pelosi while his wife was out of town … ",
    "url": "https://www.nytimes.com/2023/11/13/us/paul-pelosi-david-depape-trial.html"
  },
  {
    "text": "Biden is in a deep hole on the economy.  New polling may show a way out.  —  Top White House aides reviewed private polling showing Biden's economic message falling flat and suggesting paths toward a turnaround.  —  Earlier this fall, President Joe Biden's top aides met a pair of progressives … ",
    "url": "https://www.politico.com/news/2023/11/14/white-house-bidenomics-polling-00126982"
  },
  {
    "text": "'He'll be out': Santos' GOP critics anxiously await report they hope will help boot him  —  If it's damning, as many expect, an Ethics Committee report could provide the votes to officially sever the New York Republican from the House.  —  Rep. George Santos (R-N.Y.) has evaded two efforts this year to oust him from the House.",
    "url": "https://www.politico.com/news/2023/11/14/george-santos-ethics-report-ouster-00126887"
  },
  {
    "text": "Nearly two dozen toddlers sickened by lead linked to applesauce pouches, CDC says  —  Children ages 1 to 3 were affected, and at least one child showed a blood lead level eight times higher than the level that raises concern, the Centers for Disease Control and Prevention said.",
    "url": "https://www.nbcnews.com/health/health-news/nearly-two-dozen-toddlers-sickened-lead-linked-applesauce-pouches-cdc-rcna125067"
  },
  {
    "text": "He's a Communist Trust Fund Baby Who Inherited Millions.  Now, He's Using Daddy's Money To Harass Jews.  —  James ‘Fergie’ Chambers wants to make Israel's supporters ‘afraid to go out in public’  —  Earlier this year, avowed communist James “Fergie” Chambers secured “multiple hundreds … ",
    "url": "https://freebeacon.com/israel/hes-a-communist-trust-fund-baby-who-inherited-millions-now-hes-using-daddys-money-to-harass-jews/"
  },
  {
    "text": "How Trump's rhetoric compares to Hitler's  —  Donald Trump has long toyed with the language of famous autocrats, authoritarians and fascists.  Think: “enemy of the people,” “retribution” and the frequent, years-long allusions to political violence.  —  But even by his standards … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/13/how-trumps-rhetoric-compares-hitlers/"
  },
  {
    "text": "Mike Johnson's Shady Finances Are Already Coming Back to Bite Him  —  Speaker Mike Johnson (R-LA) is facing a new ethics complaint over a litany of alleged violations with his financial disclosures. … When newly minted Republican Speaker of the House Mike Johnson was asked on Fox News … ",
    "url": "https://www.thedailybeast.com/mike-johnsons-shady-finances-are-already-coming-back-to-bite-him"
  },
  {
    "text": "More Than 400 U.S. Officials Sign Letter Protesting Biden's Israel Policy  —  The signers, representing some 40 government agencies, reflect growing internal dissent over the administration's support of Israel's military campaign in Gaza.  —  More than 400 political appointees … ",
    "url": "https://www.nytimes.com/2023/11/14/us/politics/israel-biden-letter-gaza-cease-fire.html"
  },
  {
    "text": "Inflation expected to have cooled in October  —  Economists expect prices to have risen 3.3% over the year ending in October.  —  Prices are displayed as a person shops in a grocery store on Sept. 12, 2023 in Los Angeles.  —  Economists expect fresh data on Tuesday to show that inflation cooled … ",
    "url": "https://abcnews.go.com/Business/inflation-expected-cooled-october/story?id=104843301"
  },
  {
    "text": "Scoop: Nikki Haley and Jamie Dimon hold private convos on the economy  —  JPMorgan Chase CEO Jamie Dimon has been talking privately with GOP presidential candidate Nikki Haley about the global economy, and believes she has the potential to bring the country together, a top banking source tells Axios.",
    "url": "https://www.axios.com/2023/11/14/nikki-haley-republicans-jamie-dimon-economy"
  },
  {
    "text": "These companies spent over $100 million to avoid accountability for drinking water contamination  —  Between 2019 and 2022, chemical companies spent more than $110 million lobbying against rules to curb potentially harmful “forever chemicals,” according to a new study by Food & Water Watch (FWW).",
    "url": "https://popular.info/p/these-companies-spent-over-100-million"
  },
  {
    "text": "Cameron's Baggage: New Foreign Secretary's Legacy of Brexit, China & Greensill  —  Rishi Sunak's refreshed cabinet meets today, but does the presence of new Foreign Secretary David Cameron bring back bad memories?  We've assembled our own top team to look at the biggest questions raised … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-14/cameron-s-baggage-new-foreign-secretary-s-legacy-of-brexit-china-greensill"
  },
  {
    "text": "Biden administration bolsters effort to battle antisemitism and Islamophobia in schools  —  President Joe Biden has been under pressure to respond to mounting incidents on college campuses.  —  WASHINGTON — The Biden administration is rolling out new tools Tuesday to address the continued rise … ",
    "url": "https://www.nbcnews.com/politics/white-house/biden-administration-bolsters-effort-battle-antisemitism-islamophobia-rcna125005"
  },
  {
    "text": "Unmarried to the Mob  —  After the ex-wife of a Trump Organization insider talked to prosecutors, she lost her children and her home.  But she's still fighting.  —  Pocket  —  This article appears in the November 27/December 4, 2023 issue, with the headline “Unmarried to the Mob.”",
    "url": "https://www.thenation.com/article/society/jennifer-weisselberg-trump-organization/"
  },
  {
    "text": "U.S. Economic Calendar  —  This Week's Major U.S. Economic Reports & Fed Speakers  —  Time (ET) Report Period Actual Median Forecast Previous  —  New York Fed President John Williams speaks Fed Vice Chair Philip Jefferson speaks  —  Fed Vice Chair for Supervision Michael Barr testifies to Senate panel",
    "url": "https://www.marketwatch.com/economy-politics/calendar"
  },
  {
    "text": "'I've seen better run city council campaigns': Tim Scott's allies fume after exit  —  The South Carolina senator told just two campaign staff members of his plan to drop out.  —  When Tim Scott announced the end of his presidential bid from the studio of his house in Hanahan, S.C. … ",
    "url": "https://www.politico.com/news/2023/11/13/tim-scott-allies-fume-exit-00126827"
  },
  {
    "text": "First nonbinary Mexican magistrate found dead at home  —  Jesús Ociel Baena made history last year after becoming the first openly nonbinary person to assume a judicial position in the country.  —  MEXICO CITY — The first openly nonbinary person to assume a judicial position in Mexico … ",
    "url": "https://www.nbcnews.com/news/latino/first-nonbinary-mexican-magistrate-found-dead-home-rcna125009"
  },
  {
    "text": "Republican Pat Fallon to give up Congress seat and run for his old Texas Senate post  —  Fallon served in the Texas Senate for two years before running for Congress.  He won't see reelection in the U.S. House.  —  U.S. Rep. Pat Fallon, R-Sherman, is quitting Congress and running for his old seat in the Texas Senate.",
    "url": "https://www.texastribune.org/2023/11/13/pat-fallon-texas-senate/"
  }
]