[
  {
    "text": "Libertarians block Trump's longshot bid for party support … - Trump and independent presidential candidate Robert F. Kennedy Jr. were both among the candidates nominated by delegates on Sunday, but Libertarian Party chair Angela McArdle determined the former president was ineligible … ",
    "url": "https://www.axios.com/2024/05/26/trump-libertarian-rfk-jr-ineligible-nominee"
  },
  {
    "text": "Tim Scott on Trump Getting Booed by Libertarians: He's So Popular!  —  THEY WERE SAYING ‘BOO-URNS’  —  Trump was met with a wall of boos on Saturday night.  For one of his veepstakes frontrunners, that shows the ex-president is only getting more popular.  —  Donald Trump was met … ",
    "url": "https://www.thedailybeast.com/tim-scott-on-trump-getting-booed-by-libertarians-hes-so-popular"
  },
  {
    "text": "Trump booed and heckled by raucous crowd at Libertarian convention  —  Presidential candidate Donald Trump was booed and heckled by many in a raucous audience at the Libertarian National Convention on Saturday night, a marked change from the adulation he receives at rallies from his fervently loyal supporters.",
    "url": "https://www.reuters.com/world/us/trump-booed-heckled-by-raucous-crowd-libertarian-convention-2024-05-26/"
  },
  {
    "text": "‘No wannabe dictators!’:  Donald Trump booed at Libertarian convention  —  Jeers suggest Republican presidential candidate faces a challenge in broadening his appeal  —  Donald Trump, the former US president, has suffered the rare humiliation of getting booed and heckled during a raucous speech to the Libertarian National Convention.",
    "url": "https://www.theguardian.com/us-news/article/2024/may/26/no-wannabe-dictators-donald-trump-booed-at-libertarian-convention"
  },
  {
    "text": "Denial about Donald Trump has reached a new low  —  Authoritarians have often told us what they are going to do, but people have rarely believed them.  —  Republican presidential candidate Donald Trump, who incited a violent insurrection in January 2021 to try and remain in office illegally … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/trump-authoritarianism-american-denial-2024-rcna153962"
  },
  {
    "text": "Who is Ross Ulbricht, the prison inmate who could be key to Trump's libertarian support  —  Former President Donald Trump received a frosty reception at this weekend's Libertarian Party's national convention, but one of his few applause lines was for promising to commute a sentence for a man named Ross Ulbricht.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3017931/ross-ulbricht-prison-inmate-key-trump-libertarian-support/"
  },
  {
    "text": "Hill GOP urges Trump to consider a running mate with center-right appeal — maybe even Haley  —  Rep. Ryan Zinke (R-Mont.) advised Trump to look at a VP pick who “really reflects areas where he needs to be more competitive to win.”  —  Donald Trump is getting clear advice from a sizable number … ",
    "url": "https://www.politico.com/news/2024/05/26/trump-running-mate-haley-gop-00159747"
  },
  {
    "text": "Royce White—Steve Bannon Protege Who Called Our Reporter a “Cuck”—Endorsed by Minnesota GOP for Senate  —  The former NBA player and Black Lives Matter protester leader became a MAGA star spewing galaxy-brain conspiracies about Jews.  Now, he's got the stamp of approval from the GOP.",
    "url": "https://www.motherjones.com/politics/2024/05/royce-white-us-senate-2024-republican-nomination-blm-george-floyd-nba/"
  },
  {
    "text": "Russia Steps Up a Covert Sabotage Campaign Aimed at Europe  —  Russian military intelligence, the G.R.U., is behind arson attacks aimed at undermining support for Ukraine's war effort, security officials say.  —  U.S. and allied intelligence officials are tracking an increase … ",
    "url": "https://www.nytimes.com/2024/05/26/us/politics/russia-sabotage-campaign-ukraine.html"
  },
  {
    "text": "Proposed Texas GOP platform calls for the Bible in schools, electoral changes that would lock Democrats out of statewide office  —  The platform was voted on Saturday, with tallies expected next week.  Other planks call abortion homicide and gender-transition care “child abuse.”",
    "url": "https://www.texastribune.org/2024/05/25/texas-republican-party-convention-platform/"
  },
  {
    "text": "Peru's Unpopular Leader Hits New Low: A 5% Approval Rating  — A new poll by IEP shows continuous decline in voters' support  — Scandals have led to several impeachment attempts this year  —  Peru's Dina Boluarte saw her approval rating fall to a new low, with only 5% of people indicating … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-26/peru-s-unpopular-leader-hits-new-low-a-5-approval-rating"
  },
  {
    "text": "Trump's new policy wonks are proteges of Stephen Miller and Newt Gingrich … - Haley and Worthington write the first drafts of scripts Trump uses to record policy videos as well as the text on how a second Trump administration would handle issues from education to energy and immigration.",
    "url": "https://www.axios.com/2024/05/26/trump-campaign-policy-stephen-miller-newt-gingrich"
  },
  {
    "text": "Rafah rocket volley targets Tel Aviv area, in first such attack in 4 months  —  One person lightly hurt when shrapnel hits a house in Herzliya; Hamas takes responsibility for attack, which IDF predicted would be likely as troops push into southern Gaza city  —  The Hamas terror group fired … ",
    "url": "https://www.timesofisrael.com/rocket-volley-fired-from-rafah-targets-tel-aviv-area-in-first-such-attack-in-months/"
  },
  {
    "text": "Netanyahu's split with Biden and the Democrats was years in the making  —  The Israeli leader's longtime strategy of aligning with the GOP has helped shatter the American consensus behind Israel.  —  When President Barack Obama hosted Prime Minister Benjamin Netanyahu in the Oval Office in 2014 … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/26/netanyahu-embrace-republicans-strategy-israel-divisions/"
  }
]