[
  {
    "text": "Read the JD Vance Dossier  —  We publish what others won't.  Subscribe to support our work and for updates on this breaking story.  —  Behold the dossier.  —  It reportedly comes from an alleged Iranian government hack of the Trump campaign, and since June, the news media has been sitting on it … ",
    "url": "https://www.kenklippenstein.com/p/read-the-jd-vance-dossier"
  },
  {
    "text": "X blocks links to hacked JD Vance dossier … X is preventing users from posting links to a newsletter containing a hacked document that's alleged to be the Trump campaign's research into vice presidential candidate JD Vance.  The journalist who wrote the newsletter, Ken Klippenstein, has been suspended from the platform.",
    "url": "https://www.theverge.com/2024/9/26/24255298/elon-musk-x-blocks-jd-vance-dossier"
  },
  {
    "text": "The Undecided Voters Are Not Who You Think They Are  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  For the great majority of Americans who have firmly settled on Kamala Harris or Donald Trump, the idea that anyone could still be undecided in that choice is almost incomprehensible.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/undecided-voters-2024-election/680026/"
  },
  {
    "text": "Fox News suddenly changes its tune after Eric Adams indictment unsealed  —  Fox claimed it was an act of retaliation from Biden's DOJ, but that conspiracy theory took a hit after the indictment was unsealed  —  After the indictment of New York Mayor Eric Adams was unsealed … ",
    "url": "https://www.mediamatters.org/fox-news/fox-news-suddenly-changes-its-tune-after-eric-adams-indictment-unsealed"
  },
  {
    "text": "Eric Adams indictment unsealed: New York mayor charged in campaign contribution scheme … WATCH NOW  —  A federal indictment charging New York City Mayor Eric Adams with a decade-long campaign contribution scheme, bribery and other crimes was unsealed Thursday morning … ",
    "url": "https://www.cnbc.com/2024/09/26/new-york-city-mayor-eric-adams-indicted-in-federal-court.html"
  },
  {
    "text": "Newsmax and Smartmatic settle 2020 election defamation case on eve of trial  —  CNN  —  The pro-Trump cable channel Newsmax has settled a major 2020 election defamation lawsuit with Smartmatic in a last-minute agreement to avoid a high-stakes trial that posed a significant risk to the small outlet, according to a court official.",
    "url": "https://www.cnn.com/2024/09/26/business/newsmax-smartmatic-settle-defamation-case"
  },
  {
    "text": "Sweeping bill to overhaul Supreme Court would add six justices  —  The legislation by Sen. Ron Wyden (D-Ore.) is one of the most ambitious efforts to date to remake the Supreme Court following controversies over rulings and ethics.  —  A sweeping bill introduced by a Democratic senator Wednesday … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/26/supreme-court-reform-15-justices-wyden/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3MzIzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4NzA1NTk5LCJpYXQiOjE3MjczMjMyMDAsImp0aSI6IjNjY2FjYjk2LTQ3ZjgtNDQ5OC1iZDRjLWYxNTdiM2RkM2Q1YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzI2L3N1cHJlbWUtY291cnQtcmVmb3JtLTE1LWp1c3RpY2VzLXd5ZGVuLyJ9.HukdfS6VYXwKk7dIAfDHtJ6wAz077lgns4NrAKqFvfs&itid=gfta"
  },
  {
    "text": "North Carolina removes 747,000 from voter rolls, citing ineligibility  —  North Carolina's State Board of Elections has removed 747,000 people from its list of registered voters within the last 20 months, officials announced Thursday in a press release.  —  The State Board of Elections … ",
    "url": "https://thehill.com/homenews/campaign/4901476-north-carolina-purges-747k-voters/"
  },
  {
    "text": "Trump Media shareholder UAV dumped nearly 11 million shares … United Atlantic Ventures LLC, a major shareholder in Trump Media, has sold or otherwise gotten rid of nearly 11 million shares in the company, according to a regulatory filing Thursday.  —  The move left UAV, a partnership of former … ",
    "url": "https://www.cnbc.com/2024/09/26/trump-media-shareholder-dumped-more-than-7point5-million-shares.html"
  },
  {
    "text": "Appeals panel signals skepticism over NY civil fraud case against Trump  —  A New York appeals panel on Thursday appeared wary of the state's civil fraud case against former President Trump that ended in a $464 million judgment against him and his business.  —  During arguments lasting … ",
    "url": "https://thehill.com/regulation/court-battles/4901615-trump-ny-fraud-case-judgment-appeal/"
  },
  {
    "text": "House Democrats likely to force action on measure formally reprimanding Clay Higgins  —  Rep. Clay Higgins (R-La.) infuriated many of his House colleagues with his since-deleted racist X post about Haitian migrants, prompting a top Black Democrat to introduce a measure to formally reprimand him that will likely see a floor vote.",
    "url": "https://www.politico.com/live-updates/2024/09/26/congress/dems-seek-censure-of-clay-higgins-00181204"
  },
  {
    "text": "Gaetz says he will no longer voluntarily cooperate with House Ethics probe  —  Rep. Matt Gaetz (R-Fla.) said Thursday he will no longer voluntarily cooperate with a House Ethics Committee investigation into his conduct, calling the probe “uncomfortably nosey.”",
    "url": "https://www.politico.com/live-updates/2024/09/26/congress/gaetz-done-with-ethics-probe-00181219"
  },
  {
    "text": "The fruits of Jack Smith's 2-year investigation into Trump will land on Tanya Chutkan's desk today  —  It may be the final inflection point in the case before Nov. 5.  —  Special counsel Jack Smith, stymied at every turn by federal courts from putting Donald Trump on trial … ",
    "url": "https://www.politico.com/news/2024/09/26/jack-smith-trump-investigation-dossier-00181108"
  },
  {
    "text": "Biden Administration Denying Protection Assets For Trump Forces Him To Cancel Wisconsin Rally  —  The Secret Service recently forced former President Donald Trump to cancel a campaign rally in Wisconsin over lack of ‘assets.’  —  Former President Donald Trump was recently forced to cancel … ",
    "url": "https://thefederalist.com/2024/09/26/biden-administration-denying-protection-assets-for-trump-forces-him-to-cancel-wisconsin-rally/"
  },
  {
    "text": "Why Kamala Harris Has Won Me Over  —  Some deeply consequential decisions are starkly simple.  That is how I view our upcoming presidential election.  And that is why I have already cast my ballot for character — and voted for Vice President Kamala Harris.",
    "url": "https://www.nytimes.com/2024/09/26/opinion/kamala-harris-president.html?unlocked_article_code=1.Nk4.hflF.s-X4z_pN-b8c&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Trump voter turnout program now largely run by Elon Musk-backed group  —  Exclusive: America Pac has up to 400 employees in each of the seven key states, with the campaign dependent on it  —  Donald Trump's mass voter turnout program in crucial battleground states is now principally being run … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/26/trump-voter-turnout-elon-musk-pac"
  },
  {
    "text": "Rudy Giuliani disbarred in Washington, D.C., after losing N.Y. law license  —  Giuliani lost his license in New York state in July over his actions to disseminate lies about voter fraud in the 2020 election.  —  WASHINGTON — Former New York City Mayor Rudy Giuliani has been disbarred … ",
    "url": "https://www.nbcnews.com/politics/politics-news/rudy-giuliani-disbarred-washington-dc-losing-new-york-law-license-rcna172827"
  },
  {
    "text": "Former Republican U.S. senator endorses Kamala Harris, says election offers ‘stark choice’  —  Retired Sen. Nancy Kassebaum chaired the Senate Labor Committee  —  EXCLUSIVE: Three more Republicans are crossing the aisle to endorse Vice President Kamala Harris for the White House.",
    "url": "https://www.foxnews.com/politics/former-republican-us-senator-endorses-kamala-harris-says-election-stark-choice"
  },
  {
    "text": "RFK Jr.'s tour with Jordan Peterson: “Make America Healthy Again” shows why “alt medicine” went MAGA  —  Despite a crunchy exterior, “alternative medicine” has always been rooted in opposition to social progress  —  In his endorsement of Donald Trump, Robert Kennedy Jr. continued to insist he remains … ",
    "url": "https://www.salon.com/2024/09/26/rfk-jrs-tour-with-jordan-peterson-make-america-healthy-again-shows-why-alt-medicine-went-maga/"
  },
  {
    "text": "Trump Would Totally Demolish Economy With His Plans, Says New Report … Donald Trump says he has a plan for the economy, but that doesn't mean it's any good.  —  According to independent nonprofit nonpartisan researchers, Trump's policies on tariffs, deportations, and the Federal Reserve would … ",
    "url": "https://newrepublic.com/post/186413/trump-demolish-economy-hike-inflation-report"
  },
  {
    "text": "China's Newest Nuclear Submarine Sank, Setting Back Its Military Modernization  —  Pierside accident came as Beijing attempts to expand its navy  —  WASHINGTON—China's newest nuclear-powered attack submarine sank in the spring, a major setback for one of the country's priority weapons programs, U.S. officials said.",
    "url": "https://www.wsj.com/world/china/chinas-newest-nuclear-submarine-sank-setting-back-its-military-modernization-785b4d37?st=zHoxBT"
  },
  {
    "text": "Trump fatigue has set: Post-election disruption plans suggests the pressure is getting to MAGA  —  Trump — realizing he has nowhere to hide — looks to disrupt  —  Donald Trump can be defeated.  —  He was in 2020, although he'll never admit it.  He was defeated by E. Jean Carroll in court … ",
    "url": "https://www.salon.com/2024/09/26/fatigue-has-set-post-disruption-plans-suggests-the-pressure-is-getting-to-maga/"
  },
  {
    "text": "Harris-backed filibuster change would ‘break’ the Senate, McConnell says  —  The outgoing Republican leader blasted the vice president's proposal to restore abortion rights.  —  Senate Minority Leader Mitch McConnell lambasted a proposal from Vice President Kamala Harris to eliminate … ",
    "url": "https://www.politico.com/news/2024/09/26/mcconnell-filibuster-harris-roe-abortion-00181310"
  },
  {
    "text": "Pro-Harris sticky notes pop up in women's restrooms and gyms and on tampon boxes  —  Word about the grassroots campaign has spread on social media, primarily on Facebook, with women putting “Woman to woman” notes in places where other women will see them.  —  In the weeks before Election Day … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-sticky-notes-women-restrooms-gyms-tampon-boxes-rcna172570"
  },
  {
    "text": "FACT SHEET: President Biden and Vice President Harris Announce Additional Actions to Reduce Gun Violence and Save Lives  —  New Executive Order Directs Federal Agencies to Combat Emerging Firearms Threats and  —  Improve School-Based Active Shooter Drills  —  Today, President Biden … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/09/26/fact-sheet-president-biden-and-vice-president-harris-announce-additional-actions-to-reduce-gun-violence-and-save-lives/"
  },
  {
    "text": "Vance keeps gaffing by actually detailing Trump's policies  —  “Concepts of a plan” is an easier sell than what they really want to do. … Donald Trump is a scam artist.  He promises voters everything and delivers almost nothing.  That's worked for him in the past, but Trump's current running mate … ",
    "url": "https://www.publicnotice.co/p/jd-vance-gaffes"
  }
]