[
  {
    "text": "Trump has a plan to remake the economy.  But he's not explaining it very well.  —  President Donald Trump's economic plan is causing brief pain while the nation advances to a new “Golden Age.”  But officials have been much less clear about what that destination will look like.",
    "url": "https://www.washingtonpost.com/business/2025/03/17/trump-economy-trade/"
  },
  {
    "text": "‘Dictator S**t’: Trump's Middle-Of-The-Night Meltdown Nulling Biden Pardons Is Slammed  —  The president sent a chilling warning to people pardoned by former President Joe Biden.  —  Donald Trump claimed late Sunday — in a middle-of-the-night rant on his Truth Social platform … ",
    "url": "https://www.huffpost.com/entry/donald-trump-biden-pardons_n_67d7ba6be4b041fe9a9c90c5"
  },
  {
    "text": "Exclusive: How the White House defied a judge's order to turn back deportation flights  —  The Trump administration says it ignored a Saturday court order to turn around two planeloads of alleged Venezuelan gang members because the flights were over international waters and therefore the ruling didn't apply … ",
    "url": "https://www.axios.com/2025/03/16/trump-white-house-defy-judge-deport-venezuelans"
  },
  {
    "text": "Scientists Say NIH Officials Told Them To Scrub mRNA References on Grants  —  National Institutes of Health officials have urged scientists to remove all references to mRNA vaccine technology from their grant applications, two researchers said, in a move that signaled the agency might abandon a promising field of medical research.",
    "url": "https://kffhealthnews.org/news/article/nih-grants-mrna-vaccines-trump-administration-hhs-rfk/"
  },
  {
    "text": "Deported Brown University professor had ‘sympathetic photos’ of Hezbollah leaders on her phone, DOJ says  —  The government's explanation for Rasha Alawieh's deportation came before a judge postponed a hearing on whether it defied a judge's order that she not be deported without advance notice to the court.",
    "url": "https://www.politico.com/news/2025/03/17/rasha-alawieh-deportation-026038"
  },
  {
    "text": "DOGE Cuts Reach Key Nuclear Scientists, Bomb Engineers and Safety Experts … Los Alamos National Laboratory in New Mexico.  The National Nuclear Safety Administration field office that oversees the lab lost nine staff members, according to documents reviewed by The New York Times.The Albuquerque Journal, via Associated Press",
    "url": "https://www.nytimes.com/2025/03/17/us/politics/federal-job-cuts-nuclear-bomb-engineers-scientists.html?unlocked_article_code=1.4k4.uE6b._YafB7bQ-dvX&smid=url-share"
  },
  {
    "text": "EXCLUSIVE: Memo details Trump plan to sabotage the Social Security Administration  —  An internal Social Security Administration (SSA) memo, sent on March 13 and obtained by Popular Information, details proposed changes to the claims process that would debilitate the agency … ",
    "url": "https://popular.info/p/exclusive-memo-details-trump-plan"
  },
  {
    "text": "Destroying America's Brand  —  Last week Mark Carney, having won the Liberal Party's leadership election, became Canada's Prime Minister.  And it looks possible that he may hold that position for a while.  Not long ago the Liberals seemed headed for an electoral wipeout, but they've seen an amazing surge in the polls:",
    "url": "https://paulkrugman.substack.com/p/teslafying-us-exports"
  },
  {
    "text": "The Competition to Get Into Law School Is Brutal This Year  —  Applications are surging as students seek stability in a difficult job market  —  A weakening white-collar job market and a contentious political climate are fueling interest in law school, leading to one of the most competitive years … ",
    "url": "https://www.wsj.com/us-news/education/law-school-application-increase-job-market-623bb314?st=XJZCCb&reflink=article_copyURL_share"
  },
  {
    "text": "Social Security Employees Warn of Damage From DOGE  —  Current and former employees, both Republican and Democratic, are raising alarms about the damage cost-cutting efforts could do to the agency's ability to serve the public.  —  When Eleanor H., 66, called the Social Security Administration … ",
    "url": "https://www.nytimes.com/2025/03/17/business/social-security-doge-ssa.html?unlocked_article_code=1.4k4.eClI.r8nJVMof_cw_&smid=url-share"
  },
  {
    "text": "After CDC pick is abruptly yanked, worry over U.S. measles messaging remains  —  Medical experts and politicians question who will be chosen as the CDC's next leader amid a surge in measles cases and concerns over vaccine-preventable diseases.  —  March 17, 2025  —  The Fix  —  Analysis",
    "url": "https://www.washingtonpost.com/health/2025/03/17/cdc-nomination-measles-vaccine-safety-kennedy/"
  },
  {
    "text": "Most Men Don't Want To Be Heroes (And That's Okay)  —  We are continually being asked to feel sorry for men, to understand that there is some significant sense in which we men are being poorly served by a liberal society.  Exactly how is usually left undefined.",
    "url": "https://www.liberalcurrents.com/most-men-dont-want-to-be-heroes-and-thats-okay/"
  },
  {
    "text": "Legal Experts Question Trump's Authority to Cancel Columbia's Funding  —  The government has demanded drastic changes to the university before it will consider reinstating $400 million.  Lee C. Bollinger, the school's former president calls it an “existential threat.”",
    "url": "https://www.nytimes.com/2025/03/17/nyregion/columbia-trump-administration-funding-fight.html?unlocked_article_code=1.4k4.Dss5.5Wuk14ZgtaK2"
  },
  {
    "text": "How a Push to Amend the Constitution Could Help Trump Expand Presidential Power  —  A draft lawsuit being floated to attorneys general in several states argues Congress must call a convention over the national debt.  But the legal theory mixes and matches petitions from states dating back to 1789.",
    "url": "https://www.propublica.org/article/constitutional-convention-congress-donald-trump-power"
  },
  {
    "text": "DOGE's Cuts at the USDA Could Cause US Grocery Prices to Rise and Invasive Species to Spread  —  Thousands of US Department of Agriculture employees, including food inspectors and disease-sniffing dog trainers, remain out of work, leaving food to rot in ports and pests to proliferate.",
    "url": "https://www.wired.com/story/usda-food-supply-chains/"
  },
  {
    "text": "Musk forced to halt Cybertruck deliveries as parts fall off  —  Latest development adds to a litany of build-quality issues with the electric pickup  —  Elon Musk's Tesla has been forced to halt sales of its electric Cybertruck pickup amid mounting concern about metal panels falling off the supposedly indestructible vehicles.",
    "url": "https://www.telegraph.co.uk/business/2025/03/16/musk-forced-halt-cybertuck-deliveries-as-parts-fall-off/"
  },
  {
    "text": "Chuck Schumer Is Facing a Biden Moment  —  Chuck's Turn in the Barrel  —  SENATE MINORITY LEADER CHUCK SCHUMER'S handling of the government funding fight has caused such damage to his standing in the party that even supporters were privately discussing this week whether it represented the nadir of his lengthy political career.",
    "url": "https://www.thebulwark.com/p/chuck-schumer-is-facing-a-biden-moment"
  },
  {
    "text": "MAGA figures start chatter over Derek Chauvin pardon  —  Prominent supporters of President Trump — led by podcaster Ben Shapiro — are fueling a major push to pardon Derek Chauvin, the white former Minnesota police officer convicted of killing George Floyd in 2020.",
    "url": "https://www.axios.com/2025/03/17/derek-chauvin-pardon-ben-shapiro-trump"
  },
  {
    "text": "The evil at your door  —  Individuals associated with the federal government have, in defiance of a court order and without a trial or any form of due process, deported hundreds of people from the territory of the United States to El Salvador, where they will be held indefinitely in a concentration camp.",
    "url": "https://snyder.substack.com/p/the-evil-at-your-door"
  },
  {
    "text": "Schumer's Specter of a Shutdown  —  Not long after Senate Democratic Leader Chuck Schumer engineered enough of his party's votes to smooth passage of the partisan Republican “Continuing Resolution” to avoid a government shutdown, he made sure that his rationale made it into a sympathetic piece in the New York Times.",
    "url": "https://contrarian.substack.com/p/schumers-specter-of-a-shutdown"
  },
  {
    "text": "Schumer book tour on antisemitism postponed  —  A tour around Senate Minority Leader Chuck Schumer's (D-NY) upcoming book, Antisemitism in America, has been postponed as the New York Democrat faces blowback over his recent vote to avert a government shutdown.",
    "url": "https://jewishinsider.com/2025/03/chuck-schumer-ritchie-torres-antisemitism-book-even/"
  },
  {
    "text": "Trump Halted an Agent Orange Cleanup.  That Puts Hundreds of Thousands at Risk for Poisoning.  —  In mid-February, Trump administration leaders received a desperate warning from their diplomats posted in Vietnam, one of the most important American partners in Asia.",
    "url": "https://www.propublica.org/article/trump-halted-agent-orange-cleanup-dioxin-vietnam-poison-risk"
  },
  {
    "text": "Another Columbia student targeted by ICE says she wasn't involved in protests on the night of her arrest  —  Days after federal immigration agents showed up to Ranjani Srinivasan's apartment - prompting her to leave the country out of fear she would be taken into custody … ",
    "url": "https://www.cnn.com/2025/03/16/us/ranjani-srinivasan-columbia-university/"
  }
]