[
  {
    "text": "Trump shows his dominance over Congress in passing the ‘big, beautiful bill’  —  President Donald Trump, assisted by Vice President JD Vance, remained in talks with lawmakers throughout the week to coax them into voting for the legislation.  —  WASHINGTON — Donald Trump wanted … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-dominance-congress-passing-big-beautiful-bill-rcna216747"
  },
  {
    "text": "Trump Rails Against ‘Shylocks And Bad People’ In Iowa Speech  —  President Donald Trump employed a term often used as a slur against Jewish people as he blasted bankers during a speech in Iowa on Thursday evening.  The remark came as he was touting tax cuts in his so-called “Big Beautiful Bill … ",
    "url": "https://talkingpointsmemo.com/news/trump-rails-against-shylocks-and-bad-people-in-iowa-speech"
  },
  {
    "text": "Trump uses term viewed as antisemitic slur to refer to unscrupulous bankers  —  President Donald Trump deployed the term during a rally at the Iowa State Fairgrounds held to kick off a year of events culminating in America's 250th birthday celebration.  —  President Donald Trump used a term … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/04/trump-rally-jewish-stereotype/"
  },
  {
    "text": "Trump says he had ‘never heard’ Shylock as an anti-semitic term after using it at rally  —  President Donald Trump said early Friday that he wasn't aware that some people view the word “Shylock” as antisemitic after using the term during a rally to decry amoral money lenders.  —  “I've never heard it that way.",
    "url": "https://cnn.com/2025/07/04/politics/trump-iowa-rally-antisemitic-term"
  },
  {
    "text": "Trump uses antisemitic slur in remarks promoting his ‘big, beautiful bill’  —  Speaking at the Iowa State Fairgrounds, the president used the word “Shylocks” when talking about bankers lending money to family farms.  —  President Donald Trump used an antisemitic slur to describe exploitative bankers during … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-antisemitic-slur-shylocks-iowa-big-beautiful-bill-rcna216904"
  },
  {
    "text": "Mamdani Identified as Asian and African American on College Application  —  Zohran Mamdani, the Democrat running for mayor of New York City, was born in Uganda.  He doesn't consider himself Black but said the application didn't allow for the complexity of his background.",
    "url": "https://www.nytimes.com/2025/07/03/nyregion/mamdani-columbia-black-application.html?unlocked_article_code=1.Tk8.dq-_.OgG4Ktak82Hp&smid=url-share"
  },
  {
    "text": "Who's Afraid of Zohran Mamdani?  —  Here is one version of the story.  An anti-affirmative action hacker broke into Columbia's records, stealing private student information in the hope of providing material for Trump's authoritarian squeezing of the university.",
    "url": "https://donmoynihan.substack.com/p/whos-afraid-of-zohran-mamdani"
  },
  {
    "text": "Trump Claims Sweeping Power to Nullify Laws, Letters on TikTok Ban Show  —  In purporting to license otherwise illegal conduct by tech firms, President Trump set a precedent expanding executive power, legal experts warned.  —  Attorney General Pam Bondi told tech companies … ",
    "url": "https://www.nytimes.com/2025/07/03/us/politics/trump-bondi-tiktok-executive-power.html?unlocked_article_code=1.Tk8.cwes.GGYdG9AILg_A&smid=url-share"
  },
  {
    "text": "SCOTUS allows Trump admin to send eight men to South Sudan with no process  —  The U.S. Supreme Court issued an order on Thursday that will empower the Trump administration to send people subject to deportation to countries they have no connection with that are so dangerous the Trump administration advises Americans not to travel there.",
    "url": "https://www.lawdork.com/p/scotus-allows-trump-admin-to-send"
  },
  {
    "text": "Hegseth halted weapons for Ukraine despite military analysis that the aid wouldn't jeopardize U.S. readiness  —  The move blindsided the State Department, Ukraine, European allies and members of Congress, who demanded an explanation from the Pentagon.  —  The Defense Department held … ",
    "url": "https://www.nbcnews.com/news/military/hegseth-halted-weapons-ukraine-military-analysis-aid-wouldnt-jeopardiz-rcna216790"
  },
  {
    "text": "Trump, Zelenskiy discuss weapons, escalating Russian strikes  —  Ukrainian President Volodymyr Zelenskiy said he discussed air defences in a conversation with U.S. President Donald Trump on Friday, and agreed to work on increasing Kyiv's capability to “defend the sky” as Russian attacks escalate.",
    "url": "https://www.reuters.com/business/aerospace-defense/trump-zelesnkiy-discuss-weapons-escalating-russian-strikes-2025-07-04/"
  },
  {
    "text": "The U.S. Is Switching Sides  —  Trump is giving the Russian dictator every incentive to keep killing Ukrainians.  —  The American president wrote, “Vladimir, STOP!” on his Truth Social account in April, but the Russian president did not halt his offensive in eastern Ukraine.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/07/putin-trump-russia-ukraine/683414/?gift=hVZeG3M9DnxL4CekrWGK38jq6vvO2FygkuCulUcodbA&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "‘Deliberately massive and cynical’ — Russian attack on Ukraine began as Trump and Putin spoke, Zelensky says  —  President Volodymyr Zelensky called for more air defence for Ukraine after a massive drone and missile attack on Ukraine's capital overnight on July 4.",
    "url": "https://kyivindependent.com/air-raids-in-ukraine-began-as-trump-and-putin-spoke-zelensky-calls-for-more-patriot-missiles-06-2025/"
  },
  {
    "text": "Russian use of chemical weapons against Ukraine ‘widespread’, Dutch defence minister says  —  Dutch and German intelligence agencies have gathered evidence of widespread Russian use of banned chemical weapons in Ukraine, including dropping a choking agent from drones to drive soldiers … ",
    "url": "https://www.reuters.com/world/europe/russian-use-chemical-weapons-against-ukraine-widespread-dutch-defence-minister-2025-07-04/"
  },
  {
    "text": "Rural hospitals brace for financial hits or even closure under Republicans' $1 trillion Medicaid cut  —  Tyler Sherman, a nurse at a rural Nebraska hospital, is used to the area's aging farmers delaying care until they end up in his emergency room.  Now, with Congress planning around $1 trillion … ",
    "url": "https://apnews.com/article/medicaid-tax-cuts-rural-hospitals-nebraska-kentucky-cf6bb787fc6a4d387c55d90051ff2f1f"
  },
  {
    "text": "The Supreme Court and Congress cede powers to Trump and the presidency  —  The high court has given the president immunity and protected him from nationwide injunctions.  Congress is giving ground on spending and tariffs.  It adds up to a turbocharged executive.",
    "url": "https://www.washingtonpost.com/politics/2025/07/04/executive-trump-powers-congress-supreme-court/"
  },
  {
    "text": "Congress Throws More Money at Removing Immigrants than Most Countries Spend on Their Armies  —  It's hard to convey just how big the new budget makes the country's immigration enforcement infrastructure.  —  The Bureau of Prisons?  Bigger than that.  The FBI?  Bigger.  The Marine Corps?",
    "url": "https://talkingpointsmemo.com/news/congress-throws-more-money-at-removing-immigrants-than-most-countries-spend-on-their-armies"
  },
  {
    "text": "200 Marines among those being sent to Florida to help ICE  —  ICE will determine the duties assigned to the Marines.  —  Marines from the Marine Corps Air Ground Combat Center (MCAGCC) at Twentynine Palms guard the Wilshire Federal Building as people protest the involvement of the U.S … ",
    "url": "https://abcnews.go.com/Politics/200-marines-florida-ice/story?id=123466361"
  },
  {
    "text": "U.N. Pulls Nuclear Inspectors Out of Iran for Safety Reasons  —  Move intensifies standoff over agency's oversight of Iran's nuclear work  —  The United Nations atomic agency is pulling its inspectors out of Iran over safety concerns, severing the link between the agency and Tehran … ",
    "url": "https://www.wsj.com/world/middle-east/u-n-pulls-nuclear-inspectors-out-of-iran-for-safety-reasons-b65d84ef?st=W7U8GK&reflink=article_copyURL_share"
  },
  {
    "text": "Trump to host UFC fight at White House as part of “America250” celebrations  —  President Trump will host a UFC fight at the White House as part of celebrations marking 250 years since the signing of the U.S. Declaration of Independence, he announced at a Thursday rally in Iowa.",
    "url": "https://www.axios.com/2025/07/04/trump-ufc-white-house-fight-america-250-celebration"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Makes Our National Parks Great Again  —  PUTTING AMERICANS FIRST: Today, President Donald J. Trump signed an Executive Order investing in our national treasures by increasing fees for foreign tourists visiting our national parks to improve services, access, and affordability for Americans.",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/07/fact-sheet-president-donald-j-trump-makes-our-national-parks-great-again/"
  },
  {
    "text": "Immigration Agents Appear to Urinate in Public at a California School  —  School officials have demanded answers from federal agencies.  It was the latest example of how locals have scrutinized the actions of immigration agents.  —  The line of S.U.V.s and vans streamed through an open gate … ",
    "url": "https://www.nytimes.com/2025/07/03/us/immigration-agents-urinate-california-school.html?unlocked_article_code=1.T08.3CJR.PU7F2LVKhfCi&smid=url-share"
  }
]