[
  {
    "text": "Musk's DOGE Teen Was Fired By Cybersecurity Firm for Leaking Company Secrets  —  Edward Coristine posted online that he had retained access to the firm's servers.  Now he has access to sensitive government information.  —  Edward Coristine, a 19-year-old member of Elon Musk's squad that's … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-07/musk-s-doge-teen-was-fired-by-cybersecurity-firm-for-leaking-company-secrets?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczODk1NzQyNCwiZXhwIjoxNzM5NTYyMjI0LCJhcnRpY2xlSWQiOiJTUkJXMTlUMVVNMFcwMCIsImJjb25uZWN0SWQiOiIyQjE3NzFFOTlEODc0QzRDOTY1Njg1RTZBQkJGM0QwRCJ9.vxGv4ncXEbIrUGmUYpTUdxLmCVDwzmEWp-VRWV9otME"
  },
  {
    "text": "Staffer with Elon Musk's DOGE amplified white supremacists online  —  One of the people working with billionaire Elon Musk in his efforts to overhaul the U.S. government is a Berkeley-educated computer scientist who has boosted white supremacists and misogynists online.",
    "url": "https://www.reuters.com/world/us/staffer-with-elon-musks-doge-amplified-white-supremacists-online-2025-02-07/"
  },
  {
    "text": "Teen on Musk's DOGE Team Graduated from ‘The Com’  —  Wired reported this week that a 19-year-old working for Elon Musk's so-called Department of Government Efficiency (DOGE) was given access to sensitive US government systems even though his past association with cybercrime communities … ",
    "url": "https://krebsonsecurity.com/2025/02/teen-on-musks-doge-team-graduated-from-the-com/"
  },
  {
    "text": "A US Treasury Threat Intelligence Analysis Designates DOGE Staff as ‘Insider Threat’  —  An internal email reviewed by WIRED calls DOGE staff's access to federal payments systems “the single biggest insider threat risk the Bureau of the Fiscal Service has ever faced.”",
    "url": "https://www.wired.com/story/treasury-bfs-doge-insider-threat/"
  },
  {
    "text": "Trump Says He Will Dismiss Kennedy Center Board Members and Install Himself as Chair  —  The move by the president, whose authority to make the changes was not clear, is the latest attempt to bring a Washington institution under his control.  —  President Trump announced his intention … ",
    "url": "https://www.nytimes.com/2025/02/07/us/politics/trump-kennedy-center.html?unlocked_article_code=1.vE4.ztf6.xFI6kA7RgBnV&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Judge Will Freeze Elements of Trump Plan to Shut Down U.S.A.I.D.  —  Where Things Stand  — Political payback: President Trump said on Friday that he was revoking former President Joseph R. Biden Jr.'s security clearances, and made clear that he was doing so because Mr. Biden had rescinded his privileges four years ago.",
    "url": "https://www.nytimes.com/live/2025/02/07/us/trump-administration-updates"
  },
  {
    "text": "Donald Trump Says He'll Name Himself Chairman Of Kennedy Center And Oust Board Members  —  Donald Trump said that he will oust board members of the Kennedy Center, while naming himself as its new chairman.  —  David Rubenstein is the current chairman of the center and agreed to stay in that role through 2026.",
    "url": "https://deadline.com/2025/02/trump-kennedy-center-board-1236281969/"
  },
  {
    "text": "Supplemental Guidance to the 2024 NIH Grants Policy Statement: Indirect Cost Rates  —  Related Announcements  —  Issued by  —  Office of The Director, National Institutes of Health (OD)  —  Purpose  —  The National Institutes of Health (NIH) awards a large number of grants providing … ",
    "url": "https://grants.nih.gov/grants/guide/notice-files/NOT-OD-25-068.html"
  },
  {
    "text": "Deep Cuts to Medical Research Funds Could Hobble University Budgets  —  Grants from the National Institutes of Health come with additional money for overhead.  Proposed funding cuts would leave colleges with large budget gaps.  —  The National Institutes of Health announced a new policy Friday … ",
    "url": "https://www.nytimes.com/2025/02/07/us/politics/medical-research-funding-cuts-university-budgets.html"
  },
  {
    "text": "Kash Patel Took $25,000 From Russia-Linked Firm to Appear on an Anti-FBI TV Series  —  Last year, Kash Patel, the MAGA provocateur whom Donald Trump has nominated to head the FBI, received $25,000 from a Russia-linked production company to participate in a documentary in which he assailed the FBI and called for closing its headquarters.",
    "url": "https://www.motherjones.com/politics/2025/02/kash-patel-fbi-trump-tucker-carlson-russia-ukraine-putin/"
  },
  {
    "text": "Kash Patel was paid by Russian filmmaker with Kremlin ties, documents show  —  Patel, President Trump's nominee to be FBI director, was paid $25,000 last year by a film company that has promoted anti-Western views advanced by the Kremlin, documents show.  —  Kash Patel, President Donald Trump's nominee … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/07/patel-fbi-russia-lopatonok/"
  },
  {
    "text": "Is Donald Trump Afraid of Elon Musk?  —  The president has long operated without anything resembling worry when it comes to appointments or executive action, but as his most powerful—and richest—political ally chainsaws his way through the federal government, some observers wonder if Trump might be tasting his own medicine.",
    "url": "https://www.vanityfair.com/news/story/is-donald-trump-afraid-of-elon-musk"
  },
  {
    "text": "Trump says he's ending Biden's classified intelligence briefings in payback move  —  President Donald Trump said Friday that he's revoking former President Joe Biden's access to government secrets and ending the daily intelligence briefings he's receiving in payback for Biden doing the same to him in 2021.",
    "url": "https://apnews.com/article/trump-biden-security-clearance-revoked-be82cd4f185f01404718fcc69e074fbf"
  },
  {
    "text": "1. Trump's second term: Early ratings and expectations  —  Table of Contents Table of Contents  —  Americans are deeply divided over Donald Trump's plans and the way he is handling his job in the early weeks of his return to the presidency.  —  Overall, 47% of U.S. adults approve … ",
    "url": "https://www.pewresearch.org/politics/2025/02/07/trumps-second-term-early-ratings-and-expectations/#trump-s-jan-6-pardons"
  },
  {
    "text": "Trump fires archivist of the United States, official who oversees government records  —  President Trump has fired Archivist of the United States Colleen J. Shogan, the government official responsible for preserving and providing access to government records.",
    "url": "https://www.cbsnews.com/news/trump-fires-archivist-of-the-united-states-colleen-shogan/"
  },
  {
    "text": "The Elite Lawyers Working for Elon Musk's DOGE Include Former Supreme Court Clerks  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  As members of Elon Musk's Department of Government Efficiency … ",
    "url": "https://www.propublica.org/article/elon-musk-doge-lawyers-supreme-court"
  },
  {
    "text": "Judge to pause Trump administration effort to gut USAID's workforce by thousands  —  Two labor groups had sued the Trump administration after it said that thousands of USAID employees would be placed on administrative leave starting at 11:59 p.m. Friday.  —  A federal judge on Friday … ",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-pause-trump-administration-effort-gut-usaids-workforce-thousands-rcna191280"
  },
  {
    "text": "Senate Republicans release budget blueprint ahead of Wednesday markup  —  Senate Republicans will hold a committee vote next week on a budget blueprint that will unlock their two-bill strategy for enacting the heart of President Donald Trump's domestic policy agenda.",
    "url": "https://www.politico.com/live-updates/2025/02/07/congress/senate-republican-budget-resolution-00203114"
  },
  {
    "text": "North Carolina Judge Rejects GOP State Supreme Court Candidate's Bid To Throw Out 60K Ballots  —  A Wake County Superior Court judge rejected a bid by GOP North Carolina Supreme Court candidate Jefferson Griffin to overturn his 2024 election loss to incumbent Democratic Justice Allison Riggs … ",
    "url": "https://www.democracydocket.com/news-alerts/north-carolina-judge-rejects-gop-state-supreme-court-candidates-bid-to-throw-out-60k-ballots/"
  },
  {
    "text": "Trump and Musk Attack Journalists by Name in Social Media Posts  —  Since his inauguration, the president has been quick to demonize what he calls “the fake news media.”  On Friday, both men demanded that individuals be fired.  —  President Trump has made clear his animus toward mainstream media organizations.",
    "url": "https://www.nytimes.com/2025/02/07/business/media/trump-musk-attack-journalists.html"
  },
  {
    "text": "Exclusive: Trump Air Force nominee arranged satellite contract in manner that favored Musk's SpaceX, sources say  —  President Donald Trump's nominee as Air Force Secretary, currently a top official at the national spy satellite agency, arranged a multibillion-dollar contract solicitation … ",
    "url": "https://www.reuters.com/world/us/trump-air-force-nominee-arranged-satellite-contract-manner-that-favored-musks-2025-02-07/"
  },
  {
    "text": "Trump's FBI Pick Kash Patel Took Up to $5M in Stock from Chinese Ecommerce Giant Shein  —  Donald Trump's pick for FBI director told senators he has no plans to divest his shares, which his financial disclosure form says were received in exchange for consulting services.",
    "url": "https://www.wired.com/story/kash-patel-elite-depot-shein/"
  },
  {
    "text": "Former GOP Director Of FBI, CIA Urges Chuck Grassley To Stop Kash Patel's Nomination  —  “After all the hard work that you've done over your career, to allow it to be destroyed on your watch would not be a legacy I would want,” warned William Webster.  —  LOADING",
    "url": "https://www.huffpost.com/entry/william-webster-chuck-grassley-kash-patel_n_67a639f2e4b0f2a1787a0010"
  },
  {
    "text": "Falsehoods Fuel the Right-Wing Crusade Against U.S.A.I.D.  —  As the Trump administration works to dismantle the aid agency, right-wing influencers have flooded the internet with falsehoods about its work.  —  The video falsely claiming that the United States Agency for International … ",
    "url": "https://www.nytimes.com/2025/02/07/business/usaid-conspiracy-theories-disinformation.html"
  },
  {
    "text": "AG Bondi to Criminally Prosecute Private Entities for DEIA  —  Bondi makes clear that the “again” in MAGA refers to the period of Jim Crow America  —  This week a contact at the DOJ sent me a dozen memos just been issued by new US Attorney General Pam Bondi.",
    "url": "https://lets-address-this-with-qasim-rashid.ghost.io/ag-bondi-to-criminally-prosecute-private-entities-for-deia/"
  },
  {
    "text": "RFK Jr. had up to $1.2 million in credit card debt — what experts say about tackling high balances … Americans' credit card balances soared to a record $1.17 trillion in 2024 — and even the wealthy are not immune from carrying these balances.  —  One example is Robert F. Kennedy Jr. … ",
    "url": "https://www.cnbc.com/2025/02/07/what-rfk-jrs-financial-disclosures-may-teach-us-about-managing-debt.html"
  },
  {
    "text": "As Trump and Musk Upend Washington, Congressional Phones Can't Keep Up  —  In the three weeks since President Trump took office and gave Elon Musk free rein inside the federal government, millions of calls have poured in to members of Congress, jamming the system.",
    "url": "https://www.nytimes.com/2025/02/07/us/politics/congressional-phone-lines-trump-musk.html?unlocked_article_code=1.vU4.JpN7.1YXzr_AcTgVn&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Why Trump's plan to “clean out” Gaza actually matters  —  It's a safe bet that much of what President Donald Trump described in two press availabilities at the White House alongside Prime Minister Benjamin Netanyahu on Tuesday, as well as a follow-up social media post, is not going to happen.",
    "url": "https://www.vox.com/world-politics/398894/trump-gaza-clean-out-riviera-egypt-jordan-palestinians-netanyahu"
  },
  {
    "text": "Trump's New Line of Attack Against the Media Gains Momentum  —  First Amendment experts say Mr. Trump's lawsuits, based on an unproven legal theory, lack merit.  But more could be on the way.  —  Media lawyers scoffed last year when President Trump sued two news organizations for producing journalism that … ",
    "url": "https://www.nytimes.com/2025/02/07/business/media/trump-media-lawsuits.html"
  },
  {
    "text": "Measles Outbreak Mounts Among Children in One of Texas' Least Vaccinated Counties  —  A measles outbreak is growing in a Texas county with dangerously low vaccination rates.  —  In late January, two school-age children from Gaines County were hospitalized with measles.",
    "url": "https://kffhealthnews.org/news/article/texas-measles-outbreak-gaines-county-public-health-measles-vaccine/"
  }
]