[
  {
    "text": "Playbook: Ronna strikes back  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  ROLL TIDE — More evidence came in overnight that reproductive rights remains a potent issue for Democrats, at least in low-turnout contests: The party flipped an Alabama state House seat … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/03/27/ronna-strikes-back-00149270"
  },
  {
    "text": "Was the 2020 election stolen?  Job interviews at RNC take an unusual turn.  —  Prospective hires say agreeing with Trump's false election claim appears to be a new litmus test for being hired by the party  —  Those seeking employment at the Republican National Committee after a Trump-backed purge … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/26/rnc-2020-election-stolen-trump-hiring/"
  },
  {
    "text": "Chris Cuomo rips NBC's reversal on Ronna McDaniel hiring  —  NewsNation host Chris Cuomo criticized NBC's News's decision to oust former Republican National Committee (RNC) Chair Ronna McDaniel as a paid contributor.  —  “How is this not a '[former President Trump] and his people tried to rig the election … ",
    "url": "https://thehill.com/homenews/media/4559035-chris-cuomo-nbc-news-ronna-mcdaniel/"
  },
  {
    "text": "Democrat wins Alabama special election after focusing on IVF, abortion  —  Democratic candidate Marilyn Lands is projected to win the special election in Alabama state House District 10, according to Decision Desk HQ.  —  Lands, a licensed professional counselor, beat Republican Teddy Powell … ",
    "url": "https://thehill.com/homenews/campaign/4557670-democrat-wins-alabama-special-election-after-focusing-on-ivf-abortion/"
  },
  {
    "text": "Democrat who made reproductive rights a campaign focus will win Alabama special election, CNN projects  —  Marilyn Lands, a Democrat who made reproductive rights a central part of her campaign, will win a special election Tuesday for an Alabama state House seat, CNN projects.",
    "url": "https://www.cnn.com/2024/03/26/politics/alabama-special-election-democrat-reproductive-rights"
  },
  {
    "text": "A victory for reproductive rights?  Democratic candidate Marilyn Lands wins Alabama special election  —  Democrat Marilyn Lands won a contentious special election for a state house seat in deep-red Alabama on Tuesday night, in a race that could signal the dominant role of abortion … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/26/alabama-special-election-marilyn-lands-results/73107672007/"
  },
  {
    "text": "The Biden Campaign Is Quietly Preparing a Trump Ambush  —  LOW MALARKEY  —  The ingredients for a Biden comeback are falling into place at a moment in the 2024 campaign when Trump is mired in legal and financial problems.  —  Just a few months ago, it was hard to see the ingredients … ",
    "url": "https://www.thedailybeast.com/the-biden-campaign-is-quietly-preparing-a-trump-ambush"
  },
  {
    "text": "In MAGA world, there are no accidents  —  The Baltimore bridge disaster reminded us that these folks should be nowhere near power. … Donald Trump has been talking disconcertingly often on the campaign trail about a looming terror attack.  All indications are that Tuesday's bridge collapse … ",
    "url": "https://www.publicnotice.co/p/baltimore-bridge-collapse-maga-unhinged-response"
  },
  {
    "text": "Baltimore bridge collapse caused by DEI efforts, Utah Rep. Phil Lyman says  —  Lyman, who is also running for Utah governor, blamed diversity efforts for the disaster.  —  Phil Lyman, a Utah Republican lawmaker and candidate for governor, quickly used Baltimore's Francis Scott Key Bridge collapse … ",
    "url": "https://www.sltrib.com/news/politics/2024/03/26/baltimore-bridge-collapse-caused/"
  },
  {
    "text": "Even the US supreme court was baffled by conservatives' attack on abortion pills  —  The anti-choice case relies on outlandish legal leaps.  And if they can't win there, they'll redouble efforts to win the White House  —  It is a testament to how weak the plaintiffs' case is that the justices seemed so skeptical.",
    "url": "https://www.theguardian.com/commentisfree/2024/mar/27/us-supreme-court-anti-choice-abortion-pills-case"
  },
  {
    "text": "Trump is selling ‘God Bless the USA’ Bibles for $59.99 as he faces mounting legal bills  —  Former President Donald Trump is now selling Bibles as he runs to return to the White House.  Trump, who became the presumptive Republican nominee earlier this month, released a video on his Truth Social platform … ",
    "url": "https://apnews.com/article/trump-god-bless-usa-bible-greenwood-2713fda3efdfa297d0f024efb1ca3003"
  },
  {
    "text": "People say they're leaving religion due to anti-LGBTQ teachings and sexual abuse  —  People in the U.S. are leaving and switching faith traditions in large numbers.  The idea of “religious churning” is very common in America, according to a new survey from the Public Religion Research Institute (PRRI).",
    "url": "https://www.npr.org/2024/03/27/1240811895/leaving-religion-anti-lgbtq-sexual-abuse"
  },
  {
    "text": "‘Assured failure’: Ex-White House lawyer provides new details of final days of Trump's 2020 election gambit  —  Pat Philbin gave his first public testimony about the chaotic final days of the Trump presidency.  —  Donald Trump's deputy White House counsel, Pat Philbin, was nervous.",
    "url": "https://www.politico.com/news/2024/03/26/white-house-trump-2020-00149195"
  },
  {
    "text": "Trump's Truth Social is now a public company.  Experts warn its multibillion-dollar valuation defies logic  —  New York CNN  —  For the first time in almost 30 years, part of Donald Trump's business empire has gone public.  Trading started with a bang, but the frenzy eased considerably … ",
    "url": "https://www.cnn.com/2024/03/26/markets/trump-media-stock-truth-social/"
  },
  {
    "text": "Missouri AG sues Media Matters over its X research, demands donor names  —  Media watchdog slams “meritless, expensive, and harassing investigations.”  —  Missouri Attorney General Andrew Bailey yesterday sued Media Matters in an attempt to protect Elon Musk and X from the nonprofit watchdog … ",
    "url": "https://arstechnica.com/tech-policy/2024/03/missouri-ag-sues-media-matters-in-lawsuit-echoing-elon-musks-complaints/"
  },
  {
    "text": "Facebook snooped on users' Snapchat traffic in secret project, documents reveal  —  In 2016, Facebook launched a secret project designed to intercept and decrypt the network traffic between people using Snapchat's app and its servers.  The goal was to understand users' behavior … ",
    "url": "https://techcrunch.com/2024/03/26/facebook-secret-project-snooped-snapchat-user-traffic/"
  },
  {
    "text": "Another top House Democrat announces plans to retire … But, more than anything, it has been an honor,\" Kuster said in a statement to WMUR.  — “I will continue serving the people of New Hampshire until the end of my term in January 2025. … - She has routinely faced competitive reelection battles … ",
    "url": "https://www.axios.com/2024/03/27/annie-kuster-retire-house-democrat"
  },
  {
    "text": "Trump Goes on Bizarre Rant About ‘CROOKED JOE BUDEN’ Who 'DISINFORMATES AND ‘MISINFORMATES’ About Obamacare  —  Former President Donald Trump appeared to announce he supports Obamacare — or at least is not running to end the ACA -but that's the least newsworthy part of his latest ALL CAPS rant … ",
    "url": "https://www.mediaite.com/opinion/trump-goes-on-bizarre-rant-about-crooked-joe-buden-who-disinformates-and-misinformates-about-obamacare/"
  }
]