[
  {
    "text": "What Mitt Romney Saw in the Senate  —  In an exclusive excerpt from my forthcoming biography of the senator, Romney: A Reckoning, he reveals what drove him to retire.  —  For most of his life, Mitt Romney has nursed a morbid fascination with his own death, suspecting that it might assert itself one day suddenly and violently.",
    "url": "https://www.theatlantic.com/magazine/archive/2023/11/mitt-romney-retiring-senate-trump-mcconnell/675306/"
  },
  {
    "text": "Playbook: Biden's impeachment tightrope  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  FOER BEATS THE BIDEN BOOK CURSE — FRANKLIN FOER's “The Last Politician: Inside Joe Biden's White House and the Struggle for America's Future” ($30) debuted at No. 6 on the NYT Best Sellers list.",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/14/bidens-impeachment-tightrope-00115856"
  },
  {
    "text": "Mitch McConnell told Mitt Romney that Trump is an ‘idiot’ who 'doesn't think when he says things:' book  — An upcoming Sen. Mitt Romney biography details his relationship with his fellow GOP senators.  — Romney, who's been a vocal critic of Trump for years, said GOP lawmakers told him they envy him.",
    "url": "https://www.businessinsider.com/mitch-mcconnell-told-mitt-romney-that-trump-is-an-idiot-2023-9?op=1"
  },
  {
    "text": "Fact-checking McCarthy's claims while launching Biden impeachment inquiry  —  House Speaker Kevin McCarthy made several unproven claims Tuesday while announcing the opening of a formal impeachment inquiry into President Joe Biden.  —  The Republican-led investigation will focus on … ",
    "url": "https://www.cnn.com/2023/09/13/politics/fact-check-mccarthy-biden-impeachment-claims/"
  },
  {
    "text": "Pelosi mocks McCarthy's ‘ever incredibly shrinking speakership’  —  She told CNN's Anderson Cooper that her successor made too many concessions.  —  House Speaker Emerita Nancy Pelosi said on Wednesday that House Speaker Kevin McCarthy's concessions to conservatives on his right flank to win … ",
    "url": "https://www.politico.com/news/2023/09/13/pelosi-mocks-mccarthys-ever-incredibly-shrinking-speakership-00115841"
  },
  {
    "text": "Video shows Lauren Boebert giving the middle finger to an usher after being kicked out of a performance of ‘Beetlejuice’  — Rep. Lauren Boebert was escorted out of a performance of “Beetlejuice” in Denver over the weekend.  — Surveillance footage shows her giving the middle finger to an usher as she leaves the venue.",
    "url": "https://www.businessinsider.com/footage-shows-lauren-boebert-giving-middle-finger-beetlejuice-usher-2023-9?op=1"
  },
  {
    "text": "DeSantis: Criminalizing women for getting abortions ‘will not happen in Florida’  —  Florida Gov. Ron DeSantis (R) said Wednesday that he does not support criminalizing abortion in his state.  —  “We have no criminal penalty,” he said in a CBS News interview.  “The penalties are for the physician.”",
    "url": "https://thehill.com/homenews/state-watch/4203547-desantis-criminalizing-women-for-getting-abortions-will-not-happen-in-florida/"
  },
  {
    "text": "DeSantis and top Fla. health official warn against COVID shots for people under 65  —  Florida Gov. Ron DeSantis (R) and the state's surgeon general are advising against the use of updated COVID-19 vaccines for anyone under the age of 65, a move that counters a new recommendation from the Centers … ",
    "url": "https://thehill.com/policy/healthcare/4203200-desantis-and-top-fla-health-official-warn-against-covid-shots-for-people-under-65/"
  },
  {
    "text": "Florida surgeon general rejects FDA guidance, urges people under 65 not to get Covid booster  —  Previous guidance by Joe Ladapo has been widely rejected by the medical community.  —  TALLAHASSEE, Fla. — Gov. Ron DeSantis' hand-picked surgeon general on Wednesday warned healthy adults under … ",
    "url": "https://www.politico.com/news/2023/09/13/florida-surgeon-general-fda-covid-booster-00115781"
  },
  {
    "text": "Federal judge again declares Obama-era DACA program unlawful  —  A federal judge in Texas ruled Wednesday that a regulation intended to preserve the Obama-era Deferred Action for Childhood Arrivals program is unlawful, delivering a major blow to the Biden administration.",
    "url": "https://www.cnn.com/2023/09/13/politics/daca-program-unlawful/"
  },
  {
    "text": "Democrats set to meet on New Hampshire primary as tensions rise  —  The Democratic National Committee (DNC) is set to meet again to discuss the status of the 2024 New Hampshire primary amid an internal party dispute that has stoked tensions between members and the Biden administration.",
    "url": "https://thehill.com/homenews/campaign/4202977-democrats-set-to-meet-on-new-hampshire-primary-as-tensions-rise/"
  },
  {
    "text": "A closer look at California's $267 million war on “organized retail crime”  —  On Tuesday, California Governor Gavin Newsom (D) announced the state would spend hundreds of millions of dollars to combat “organized retail crime.”  More than $267 million will be distributed in grants to 55 cities and counties across the state.",
    "url": "https://popular.info/p/a-closer-look-at-californias-267"
  },
  {
    "text": "Wisconsin Republican leader asks former state Supreme Court justices to review impeachment  —  Wisconsin's Republican Assembly leader announced Wednesday that he's created a panel to investigate the criteria for impeachment as he mulls taking that unprecedented step against a liberal state Supreme Court justice.",
    "url": "https://apnews.com/article/wisconsin-supreme-court-justice-impeachment-03d6f56ef7d27c6c45913a4310df7953"
  },
  {
    "text": "DeSantis took undisclosed private flights and lodging through wealthy donors  —  The trips included a private flight to the prestigious home of the Masters tournament, with an overnight stay and a round of golf  —  Florida Gov. Ron DeSantis took at least six undisclosed trips on private jets … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/ron-desantis-private-flights/"
  },
  {
    "text": "In Poland, Testing Women for Abortion Drugs Is a Reality.  It Could Happen Here.  —  Nearly three years ago, Poland's Constitutional Tribunal effectively ended legal abortion in the country.  Since then, the Polish government has vigorously repressed the nation's reproductive rights movement … ",
    "url": "https://www.nytimes.com/2023/09/14/opinion/abortion-pills-testing-poland.html"
  },
  {
    "text": "Haley gets a bounce in New Hampshire - right into the veepstakes  —  Even supporters of Trump's rivals talk about them like potential vice presidents.  —  MERRIMACK, N.H. — Nikki Haley is finally getting a bounce in New Hampshire.  It's just not the one she wants.",
    "url": "https://www.politico.com/news/2023/09/14/new-hampshire-trump-vice-president-00115786"
  },
  {
    "text": "In private meetings, Manchin grapples with his political future  —  Whether he runs for reelection or president, the Democratic senator has signaled he would probably leave the party and run as an independent  —  Sen. Joe Manchin III (D-W.Va.) is having trouble making a decision about his political future.",
    "url": "https://www.washingtonpost.com/elections/2023/09/14/manchin-2024-reelection-president/"
  },
  {
    "text": "Jury awards $100,000 to Kentucky gay couple denied marriage license  —  The couple sued former county clerk Kim Davis, who was briefly jailed in 2015 over her refusal to issue marriage licenses to same-sex couples.  —  A federal jury has awarded $100,000 to a Kentucky couple … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/jury-awards-100000-kentucky-gay-couple-denied-marriage-license-rcna104971"
  },
  {
    "text": "Federal staff recommend first safety rules for infant rockers after deaths stretching back over a decade  —  Rockers can pose a suffocation threat to infants when they fall asleep or are left unattended, Consumer Product Safety Commission staff wrote.  —  Staff at the Consumer Product Safety … ",
    "url": "https://www.nbcnews.com/news/us-news/infant-rockers-deaths-consumer-product-safety-commission-rcna103589"
  },
  {
    "text": "Milley disputes claim he recommended Trump attack Iran  —  You can watch the full interview with Gen. Mark Milley on “Fareed Zakaria GPS” on Sunday at 10 a.m. ET.  —  CNN  —  Chairman of the Joint Chiefs of Staff Gen. Mark Milley told CNN's Fareed Zakaria in an interview Wednesday … ",
    "url": "https://www.cnn.com/2023/09/13/politics/milley-cnn-interview-trump-iran/"
  },
  {
    "text": "Court blocks Jack Smith's access to many of Rep. Scott Perry's contacts about 2020 election  —  The appeals panel concluded that prosecutors' effort to access cellphone communications with colleagues officials violated the lawmaker's constitutional immunity.",
    "url": "https://www.politico.com/news/2023/09/13/court-smith-perry-2020-election-00115682"
  },
  {
    "text": "Calif. passes strongest right-to-repair bill yet, requiring 7 years of parts  —  Repair shops must disclose if they're using “non-authorized” parts.  —  California, the home to many of tech's biggest companies and the nation's most populous state, is pushing ahead with a right-to-repair bill for consumer electronics and appliances.",
    "url": "https://arstechnica.com/gadgets/2023/09/calif-passes-strongest-right-to-repair-bill-yet-requiring-7-years-of-parts/"
  }
]