[
  {
    "text": "A chunk of Republican primary and caucus voters say they wouldn't vote for Trump as the GOP nominee  —  A small but substantial chunk of Republican primary and caucus voters say they would be so dissatisfied if Donald Trump became the party's presidential nominee that they would not vote … ",
    "url": "https://apnews.com/article/trump-primary-caucus-republican-voters-general-election-4a64d34b6d74e167cf6b256784c841c0"
  },
  {
    "text": "CBS News poll finds voters remember Trump's economy as good, boosting Trump to national lead over Biden today  —  As Super Tuesday makes an historic rematch all but official, voters are comparing not just two presidents, but two presidencies.  —  And right now former President Donald Trump emerges … ",
    "url": "https://www.cbsnews.com/news/poll-trump-leads-biden-economy/"
  },
  {
    "text": "Trump warns of ‘languages coming into our country’ that ‘nobody’ has heard of  —  Trump's warnings about words add to a pattern of stoking fear around migrants coming into the United States.  —  Warning about the dangers of illegal immigration at the southern border has long … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-warns-languages-immigration-migrants-rcna141535"
  },
  {
    "text": "Majority of Biden's 2020 Voters Now Say He's Too Old to Be Effective  —  A New York Times/Siena College poll revealed how much even his supporters worry about his age, intensifying what has become a grave threat to his re-election bid.  —  Widespread concerns about President Biden's age pose … ",
    "url": "https://www.nytimes.com/2024/03/03/us/politics/biden-age-trump-poll.html"
  },
  {
    "text": "Lisa Murkowski says she ‘could not’ vote for Trump or Biden in 2024  —  The Alaska senator admitted that she also didn't vote for former President Donald Trump in 2020.  —  WASHINGTON — Republican Sen. Lisa Murkowski said Saturday she “could not” vote for former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/lisa-murkowski-says-not-vote-trump-biden-2024-rcna141551"
  },
  {
    "text": "Trump escalates his immigration rhetoric with baseless claim about Biden trying to overthrow the US  —  Former President Donald Trump on Saturday further escalated his immigration rhetoric and baselessly accused President Joe Biden of waging a “conspiracy to overthrow the United States of America” … ",
    "url": "https://apnews.com/article/trump-immigration-biden-gop-voters-border-migrants-1fc6624188f540f495e1087bee64318e"
  },
  {
    "text": "Florida is swamped by disease outbreaks as quackery replaces science  —  The state is in the grip of a measles outbreak, yet Joseph Ladapo, the surgeon general, continues to ignore medical science to stop it  —  Shortly before Joseph Ladapo was sworn in as Florida's surgeon general in 2022 … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/03/florida-measles-outbreak-preventable"
  },
  {
    "text": "Nikki Haley says she's no longer bound by RNC pledge to endorse Trump if he wins  —  In an interview with “Meet the Press,” Haley dodged, saying, “When you all ask Donald Trump if he would support me, then I will talk about that.”  —  Former U.N. Ambassador Nikki Haley no longer feels bound … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-says-s-no-longer-bound-rnc-pledge-endorse-trump-wins-rcna141518"
  },
  {
    "text": "Haley hints she isn't bound by loyalty pledge to support GOP nominee  —  Former South Carolina governor Nikki Haley said Sunday that she no longer feels bound by the earlier pledge made by her and other presidential hopefuls to support the GOP's eventual nominee — widely expected to be former president Donald Trump.",
    "url": "https://www.washingtonpost.com/politics/2024/03/03/nikki-haley-donald-trump-rnc-pledge/"
  },
  {
    "text": "Lauren Boebert doesn't want to lose the House  —  A messy divorce and flagging popularity upended her personal life and threatened her political future.  Can the MAGA Mean Girl start over without changing?  —  WINDSOR, Colo. — On a recent February afternoon, Rep. Lauren Boebert's (R-Colo.) … ",
    "url": "https://www.washingtonpost.com/style/power/2024/03/03/lauren-boebert-reelection/"
  },
  {
    "text": "Backlogged with blockbuster cases, Supreme Court takes on Trump  —  Justices are considering Donald Trump's immunity appeal amid a glut of other high-profile, impactful decisions and emergency requests  —  In the next four months, the Supreme Court will resolve a huge number of highly consequential cases … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/03/supreme-court-trump-history-backlog/"
  },
  {
    "text": "Fani Willis and Nathan Wade Now Facing Trouble With the Georgia State Bar  —  After all the problems regarding Fulton County District Attorney Fani Willis and her former paramour, whom she appointed to be a special prosecutor in the Trump election case, you knew that they were going to be in trouble.",
    "url": "https://redstate.com/nick-arama/2024/03/02/fani-willis-nathan-wade-state-bar-n2170852"
  },
  {
    "text": "Biden to hostage-ceasefire negotiators: Get me a deal … - Biden wants the Qataris and the Egyptians — the key mediators in the hostage talks — to get the terror group to agree to a deal before the Muslim holy month of Ramadan, which starts March 10.",
    "url": "https://www.axios.com/2024/03/03/biden-hostage-ceasefire-deal-gaza-israel-hamas"
  },
  {
    "text": "Georgia Senate passes bill banning American Library Association from state libraries  —  Republican state senators in Georgia on Thursday passed a bill that would force state libraries to cut ties with the American Library Association.  Senate Bill 390 was passed by a vote of 33-20 vote with no support from Democratic senators.",
    "url": "https://www.advocate.com/politics/georgia-senate-ala"
  }
]