[
  {
    "text": "Security increases for judge assigned to Donald Trump's January 6 criminal case  —  Security for the federal judge assigned to oversee the criminal case against former President Donald Trump over his attempts to overturn the 2020 election has been increased in the federal courthouse in Washington, DC.",
    "url": "https://www.cnn.com/2023/08/07/politics/security-judge-tanya-chutkan-trump-january-6/"
  },
  {
    "text": "Trump objects to strict limits on sharing evidence in election interference case  —  In a new court filing, his legal team said prosecutors' proposed restrictions are too onerous.  —  Donald Trump argued Monday that he should be allowed to share evidence in his latest criminal case with … ",
    "url": "https://www.politico.com/news/2023/08/07/trump-protective-order-response-00110188"
  },
  {
    "text": "Ex-Pence Adviser Trashes Former Boss, Backs Trump Instead  —  ‘UNWORTHY’  —  Mike Pence's former national security adviser Keith Kellogg released a statement Monday calling his old boss “unworthy of the presidency” and expressing admiration for Donald Trump.",
    "url": "https://www.thedailybeast.com/ex-pence-adviser-keith-kellogg-trashes-former-boss-backs-trump-instead"
  },
  {
    "text": "Exclusive: Trump ally Bernie Kerik meets with special counsel investigators  —  Donald Trump ally Bernie Kerik met Monday with special counsel Jack Smith's investigators who are handling the probe related to the 2020 election aftermath and the January 6, 2021, insurrection.",
    "url": "https://www.cnn.com/2023/08/07/politics/bernie-kerik-trump-grand-jury/"
  },
  {
    "text": "House GOP eyes fall push for Biden impeachment inquiry  —  Speaker Kevin McCarthy has been insistent: House Republicans are still gathering evidence and have yet to decide whether to open up a formal impeachment inquiry against President Joe Biden.  —  “I didn't say I was doing an impeachment inquiry … ",
    "url": "https://www.cnn.com/2023/08/08/politics/house-republicans-impeachment-inquiry-biden/"
  },
  {
    "text": "Biden to Designate Monument Near Grand Canyon, Preventing Uranium Mining  —  Uranium extraction had already been restricted in the area, which Native tribes consider sacred, but the moratorium was set to expire in 2032.  Mr. Biden's designation will make it permanent.",
    "url": "https://www.nytimes.com/2023/08/07/us/politics/biden-grand-canyon-arizona-national-monument.html"
  },
  {
    "text": "Pence announces he's reached donor threshold to qualify for first Republican presidential debate  —  The former vice president's campaign spotlights that they passed the donor threshold without the need of any gimmicks or giveaways  —  FIRST ON FOX: Former Vice President Mike Pence has met … ",
    "url": "https://www.foxnews.com/politics/pence-announces-hes-reached-donor-threshold-qualify-first-republican-presidential-debate"
  },
  {
    "text": "SSU detains russian informant preparing enemy air strike on Mykolaiv region during President's visit (video)  —  The SSU has detained an informant of russian intelligence services who on the eve of the visit of the President of Ukraine to Mykolaiv oblast was collecting information on the planned events.",
    "url": "https://ssu.gov.ua/en/novyny/sbu-zatrymala-rosiisku-informatorku-yaka-hotuvala-povitrianyi-udar-rf-po-mykolaivshchyni-pid-chas-vizytu-prezydenta-ukrainy-video"
  },
  {
    "text": "DNC names leadership posts for 2024 presidential convention in Chicago  —  Minyon Moore, who has been active behind the scenes in the White House, has been tapped for convention chair.  —  CHICAGO — The Democratic National Committee on Tuesday named its leadership team for the national convention … ",
    "url": "https://www.nbcnews.com/meet-the-press/meetthepressblog/dnc-names-leadership-posts-2024-presidential-convention-chicago-rcna98670"
  },
  {
    "text": "Appeals court halts new Biden rules on debt relief for defrauded students  —  The future of the Biden administration's rules to ease the path to student loan forgiveness for people who were defrauded borrowers by their college or whose schools abruptly close is in doubt.",
    "url": "https://www.washingtonpost.com/education/2023/08/07/student-loan-forgiveness-defrauded-borrowers-court-injunction/"
  },
  {
    "text": "Mississippi Officials Made 161 Voting Precinct Changes Since November 2022  —  Mississippi election officials have made 161 voting precinct changes since November 2022, leaving voters with slightly fewer voting precincts statewide and dozens moved after the completion of post-Census redistricting efforts … ",
    "url": "https://www.mississippifreepress.org/35295/mississippi-officials-made-161-voting-precinct-changes-since-november-2022"
  },
  {
    "text": "Tucker Carlson could see Rebekah Mercer, Peter Thiel invest in his media company  — Rebekah Mercer has spoken with Tucker Carlson since his April departure from Fox News about possibly investing into his as yet unnamed media company.  — Peter Thiel has hinted to allies that he could invest in the media company, sources said.",
    "url": "https://www.cnbc.com/2023/08/08/tucker-carlson-may-see-rebekah-mercer-peter-thiel-invest-in-company.html"
  },
  {
    "text": "Judge asks prosecutors to justify use of 2 grand juries in Trump documents case  —  Judge Aileen M. Cannon on Monday asked federal prosecutors to explain the use of grand juries in Florida and Washington in the classified documents case against Donald Trump even though charges were filed in South Florida.",
    "url": "https://www.washingtonpost.com/national-security/2023/08/07/trump-grand-juries-cannon/"
  },
  {
    "text": "Arizona ‘audit’ leader wants texts with Michigan lawyer indicted over voting machines to stay secret  —  Cyber Ninjas CEO Doug Logan is trying to keep secret more than 1,600 texts he exchanged with a Michigan lawyer who was indicted on charges of illegally accessing voting machines as part of a plot to overturn 2020 election results.",
    "url": "https://www.azcentral.com/story/news/local/arizona-investigations/2023/08/07/cyber-ninjas-ceo-doug-logan-aims-to-keep-texts-with-stefanie-lambert-secret/70516217007/"
  },
  {
    "text": "Judge Cannon Blows Off Concerns about Walt Nauta's Conflicted Representation  —  Before I attempt to explain the substance of the order that Aileen Cannon issued in response to DOJ's request for a Garcia hearing, let me point out how it looks on the docket.  —  Before DOJ filed its motion … ",
    "url": "https://www.emptywheel.net/2023/08/07/judge-cannon-blows-off-concerns-about-walt-nautas-conflicted-representation/"
  },
  {
    "text": "Newsmax Ropes Matt Gaetz Into Battle to Become GOP's Comms Shop  —  Gaetz has filled in during Newsmax primetime, often “reporting” on political stories of which he's very much a part.  It's an ethics nightmare, say experts. … Newsmax will apparently stop at nothing … ",
    "url": "https://www.thedailybeast.com/newsmax-ropes-matt-gaetz-into-battle-to-become-gops-comms-shop"
  },
  {
    "text": "High turnout, long lines: A look at Ohio's last weekend of early voting on Issue 1  —  Saturday and Sunday were the last days to vote early in-person on Issue 1 and turnout was high across Ohio with lines stretching around buildings in some counties.  —  While many projected low turnout … ",
    "url": "https://www.dispatch.com/story/news/politics/elections/state/2023/08/07/issue-1-early-voting-closes-in-ohio-bringing-high-turnout-ahead-of-aug-8/70512342007/"
  },
  {
    "text": "Dwindling Blue Dog Democrats look to stage a comeback for moderates  —  The new leaders of the once-powerful group are working to change its perception and grow their ranks  —  Rep. Jared Golden (D-Maine) has never really been into labels.  —  His liberal colleagues have called … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/08/blue-dog-democrats-congress-new-leaders/"
  }
]