[
  {
    "text": "How to pick a jury that can judge Donald Trump  —  Tailoring questions to probe prospective jurors' political biases and opinions of the former president is more art than science.  —  Former President Donald Trump's criminal trial in New York begins Monday with an immediate and fundamental challenge … ",
    "url": "https://www.politico.com/news/2024/04/14/jury-selection-donald-trump-00151962"
  },
  {
    "text": "It's Time to Play to Win  —  Pushing the advantage against Iran and a new poll that shows the new normal.  —  BUCKLE UP—Donald Trump's first criminal trial starts today.  The jury—when they manage to seat one—will consider whether Trump falsified business records to cover up hush-money payments … ",
    "url": "https://www.thebulwark.com/p/its-time-to-play-to-win"
  },
  {
    "text": "Trump's Criminal Trial to Begin in Manhattan With Jury Selection  —  Hundreds of Manhattanites have been summoned to court so that prosecutors and defense lawyers can choose 12 who will decide the fate of Donald J. Trump.  —  The first criminal trial of an American president will begin Monday … ",
    "url": "https://www.nytimes.com/2024/04/15/nyregion/trump-trial-hush-money.html"
  },
  {
    "text": "Federal criminal investigation opened into Key Bridge crash  —  The FBI has opened a criminal investigation focusing on the massive container ship that brought down the Francis Scott Key Bridge in Baltimore last month — a probe that will look at least in part at whether the crew left … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/04/15/balitmore-key-bridge-criminal-investigation/"
  },
  {
    "text": "US to Israel: Don't do something you'll regret  —  In private calls and public moves, President Joe Biden and his aides are pointing to reasons to look for an off-ramp.  —  The Biden administration's main message for Israel following Iran's aerial assault comes down to this: Stop and think.",
    "url": "https://www.politico.com/news/2024/04/14/us-israel-responding-iran-00152150"
  },
  {
    "text": "Iran's Attack on Israel Has U.S. Politicians Scrambling … As the world waits to see what will come next between Israel and Iran, politicians in America are scrambling to determine their own next steps.  —  The roiling Israel policy debate has remained near the center of U.S. politics … ",
    "url": "https://www.notus.org/congress/israel-iran-strike-congress-biden-response"
  },
  {
    "text": "Israel Repelled Iran's Huge Attack.  But Only With Help From U.S. and Arab Partners.  —  Working with partners, it fended off worst of Iranian strikes; what comes next will test powers in the Middle East and beyond  —  Saturday's Iranian strike on Israel was huge by any standard.",
    "url": "https://www.wsj.com/world/middle-east/analysis-israel-repelled-irans-huge-attack-but-only-with-help-from-u-s-and-arab-partners-a7844065"
  },
  {
    "text": "Trump Media shares plunge 13% after company files to issue additional DJT stock … This photo illustration shows an image of former President Donald Trump reflected in a phone screen that is displaying the Truth Social app, in Washington, DC, on February 21, 2022.",
    "url": "https://www.cnbc.com/2024/04/15/trump-media-shares-plunge-after-company-files-to-issue-additional-djt-stock.html"
  },
  {
    "text": "Tax Day reveals a major split in how Joe Biden and Donald Trump would govern  —  Tax Day reveals a major split in how Joe Biden and Donald Trump would govern: The presidential candidates have conflicting ideas about how much to reveal about their own finances and the best ways to boost the economy through tax policy.",
    "url": "https://apnews.com/article/trump-biden-income-taxes-irs-returns-filings-55d3031de64251169eb247f52430618d"
  },
  {
    "text": "Mark Cuban says he's proud to pay $288 million in taxes this year, unlike a certain former president  — Mark Cuban says he'll be paying $288 million in taxes to the IRS.  — “I pay what I owe,” Cuban wrote on X.  — The billionaire says he's “proud to pay my taxes every single year,” unlike one ex-president.",
    "url": "https://www.businessinsider.com/mark-cuban-proud-to-pay-taxes-unlike-certain-ex-president-2024-4"
  },
  {
    "text": "Far Right's Ties to Russia Sow Rising Alarm in Germany  —  As cases proliferate, opponents fear the Alternative for Germany party is becoming a tool of Russian influence operations to undermine support for Ukraine.  —  To enter a secret session of Germany's Parliament, lawmakers must lock their phones and leave them outside.",
    "url": "https://www.nytimes.com/2024/04/15/world/europe/germany-afd-russia.html"
  },
  {
    "text": "Trump trade advisers plot dollar devaluation  —  Advisers close to the former president — particularly his former trade chief Robert Lighthizer — are considering policies that would weaken the dollar relative to other currencies, which could juice U.S. exports but also fuel inflation.",
    "url": "https://www.politico.com/news/2024/04/15/devaluing-dollar-trump-trade-war-00152009"
  },
  {
    "text": "Supreme Court rejects BLM activist's bid to evade police officer's lawsuit  —  DeRay Mckesson was sued by a police officer who was injured during a Baton Rouge protest sparked by the killing of a Black man.  —  WASHINGTON — Rejecting an appeal brought by Black Lives Matter activist DeRay Mckesson … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-blm-activists-bid-evade-police-officers-lawsuit-rcna140048"
  },
  {
    "text": "Haley joining conservative think tank  —  Former U.N. Ambassador Nikki Haley is set to join the Hudson Institute think tank, the group announced Monday.  The post will allow her to keep a notable profile as she mulls a second presidential bid for 2028.  —  Haley, former President Trump's … ",
    "url": "https://thehill.com/homenews/campaign/4594519-haley-joining-conservative-think-tank/"
  },
  {
    "text": "Democrats descend on Chicago as specter of '68 convention looms  —  Protests over Israel-Gaza war expected as party nominates President Joe Biden.  —  Democrats from across the country are converging in Chicago this week to lay the groundwork for their upcoming convention … ",
    "url": "https://www.politico.com/news/2024/04/15/democrats-chicago-convention-unrest-00152164"
  },
  {
    "text": "Senate spotlight: A Trump Republican's China problem  —  November's election will not only determine which party controls the White House but also the United States Senate.  Currently, the Democratic caucus holds a narrow 51-49 advantage.  Control of the chamber will come down to a handful of competitive races.",
    "url": "https://popular.info/p/senate-spotlight-a-trump-republicans"
  }
]