[
  {
    "text": "U.S. Intercepts Drones and Missiles Aimed at Israel, as Allies Pledge Support  —  Iran fired more than 300 drones and missiles at Israel overnight.  The U.S. military shot some of them down, but most were intercepted by Israel's military.  —  Here are the latest developments.",
    "url": "https://www.nytimes.com/live/2024/04/13/world/israel-iran-gaza-war-news"
  },
  {
    "text": "Iran launches unprecedented drone and missile attack on Israel … - The specific targets were initially unclear.  — The Biden administration has vowed to help Israel counter the Iranian attack.  — Iranian officials had threatened to retaliate against Israel for an airstrike in Syria … ",
    "url": "https://www.axios.com/2024/04/13/iran-israel-attack"
  },
  {
    "text": "Iran's state-run news agency says Iran has fired ballistic missiles at targets inside Israel … Iran says it has launched ballistic missiles as part of its attack targeting Israel.  The state-run IRNA news agency quoted an anonymous official saying ballistic missiles were part of the attack.",
    "url": "https://apnews.com/article/strait-of-hormuz-vessel-33fcffde2d867380e98c89403776a8ac"
  },
  {
    "text": "Biden returns to the White House as imminent Iranian attack on Israel is possible … - Israel Defense Forces' home front command announced a state of alert starting 4pm ET Saturday and added that all schools and education institutions will be closed Sunday — another sign of an imminent attack.",
    "url": "https://www.axios.com/2024/04/13/biden-israel-iran-white-house"
  },
  {
    "text": "Scoop: Biden told Bibi U.S. won't support an Israeli counterattack on Iran … - Iran launched attack drones and missiles against Israel on Saturday night local time in retaliation for an airstrike in Syria that killed a top Iranian general.  — “More than 200 drones … ",
    "url": "https://www.axios.com/2024/04/14/biden-netanyahu-iran-israel-us-wont-support"
  },
  {
    "text": "Iran launches hundreds of suicide drones in ‘significant escalation’ against Israel  —  Iran has launched an attack against Israel using hundreds of suicide drones, the Jewish state has confirmed.  —  Axios journalist Barak Ravid, citing a senior Israeli official, reported that hundreds of drones were headed for Israel.",
    "url": "https://nypost.com/2024/04/13/world-news/iran-launches-wave-of-drone-attacks-at-israel-report/"
  },
  {
    "text": "Iran attacks Israel: IDF warns that threat is ongoing, interceptions continue  —  Seven-year-old girl from Bedouin village seriously wounded in Iranian attack.  • US, Israel, UK, Jordan intercept Iranian projectiles  —  Sirens blared across Israel on Saturday night as hundreds of drones … ",
    "url": "https://www.jpost.com/breaking-news/article-796838"
  },
  {
    "text": "UN Security Council to meet Sunday on Iran attack after Israel request  —  The United Nations Security Council is set to meet on Sunday after Israel requested the council condemn Iran's attack on Israel and designate the Iranian Revolutionary Guard Corps a terrorist organization.",
    "url": "https://www.reuters.com/world/middle-east/un-security-council-aims-meet-sunday-iran-attack-after-israel-request-diplomat-2024-04-14/"
  },
  {
    "text": "Lawmakers send message to White House on impending Iran drone attack to Israel: ‘Stand firm’  —  Rep. Nancy Mace, R-S.C., said that the White House must ‘stop coddling Iran’ and ‘stand firm’  —  Lawmakers reacted after Iran launched drones from its own territory toward Israel late Saturday … ",
    "url": "https://www.foxnews.com/politics/lawmakers-send-message-white-house-impending-iran-drone-attack-israel-stand-firm"
  },
  {
    "text": "Majority of voters think Trump committed ‘serious federal crimes,’ according to NYT poll  —  The new poll comes as jury selection will begin in Trump's New York trial on Monday.  —  A majority of voters believe former President Donald Trump has committed “serious federal crimes,” … ",
    "url": "https://www.politico.com/news/2024/04/13/trump-crimes-poll-voters-00152110"
  },
  {
    "text": "Republicans in swing state Wisconsin unenthused by Trump: ‘A bad candidate’  —  Fervent Trump supporters from last elections air doubts over abortion and the man himself in state where turnout will be key  —  Terri Burl has come full circle.  —  The local Republican party official … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/13/election-trump-wisconsin-republicans"
  },
  {
    "text": "Trump targets two likely witnesses ahead of his criminal trial, despite gag order … In this courtroom sketch, Michael Cohen looks toward former U.S. President Donald Trump as he is questioned by a lawyer for the attorney general's office, during the Trump Organization civil fraud trial … ",
    "url": "https://www.cnbc.com/2024/04/13/trump-targets-two-likely-witnesses-ahead-of-his-criminal-trial-despite-gag-order.html"
  },
  {
    "text": "Robert F. Kennedy Jr. says he has ruled out Libertarian run for president  —  This is a shift from his prior stance of keeping the door open.  —  Independent presidential candidate Robert F. Kennedy Jr. attends a Cesar Chavez Day event at Union Station on March 30, 2024, in Los Angeles.",
    "url": "https://abcnews.go.com/Politics/robert-kennedy-jr-ruled-libertarian-run-president/story?id=109208097"
  },
  {
    "text": "The Myth of the Molly Maguires  —  The Day of the Rope  —  The Myth of the Molly Maguires became international news on June 21, 1877, when the authorities hanged ten Irish miners in a single day in Schuylkill County, Pennsylvania.  Known as Black Thursday, or Day of the Rope, it was the second largest mass execution in U.S. history.",
    "url": "https://michaeldunnauthor.com/2024/04/13/the-myth-of-the-molly-maguires/"
  }
]