[
  {
    "text": "Ron DeSantis is refusing to take Harris' call on Hurricane Helene  —  An aide to the Florida governor said that Harris' call “seemed political” and that she “was trying to reach out, and we didn't answer.”  —  Florida Gov. Ron DeSantis is not taking calls from Vice President Kamala Harris … ",
    "url": "https://www.nbcnews.com/politics/kamala-harris/ron-desantis-harris-call-hurricane-helene-political-rcna174276"
  },
  {
    "text": "Hurricane Milton is a Category 5.  Florida orders evacuations and scrambles to clear Helene's debris  —  Florida's storm-battered Gulf Coast raced against a Category 5 hurricane Monday as workers sprinted to pick up heaps of appliances and other street debris left over from Helene two weeks ago … ",
    "url": "https://apnews.com/article/hurricane-milton-helene-florida-557c5c512135e0a8661b298e45e17c92"
  },
  {
    "text": "Florida Gov. Ron DeSantis refused call from VP Kamala Harris about hurricane aid: Source  —  DeSantis believed the call was politically motivated, a source said.  —  Florida Gov. Ron DeSantis speaks about Hurricane Helene as Adjutant General of Florida Major General John Haas looks on during … ",
    "url": "https://abcnews.go.com/US/florida-gov-ron-desantis-refuses-call-vp-kamala/story?id=114570089"
  },
  {
    "text": "What Kamala Harris' ‘Call Her Daddy’ media strategy is really about  —  Hint: it's not about mainstream media's egos.  —  On Sunday, a 40-minute interview with Vice President Kamala Harris aired on a platform with an audience of 5 million engaged and loyal listeners.  No, it wasn't “Meet the Press” or “Face the Nation.”",
    "url": "https://www.politico.com/news/2024/10/07/kamala-harris-media-strategy-call-her-daddy-00182781"
  },
  {
    "text": "What Going on Call Her Daddy Did for Kamala Harris  —  Very few podcasters would apologize to their fans for clogging up their feed by interviewing a presidential candidate.  But Alex Cooper—the host of a podcast variously described as “raunchy, “sex-positive,” “mega-popular,” and … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/kamala-harris-call-her-daddy-podcast/680181/?gift=hKlyhOsAqtwHzNWWygN1jkI7qhWUc3cEJDawK2DNwO0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Harris undergoes a ‘60 Minutes’ grilling as Trump sits it out  —  Harris refused to say whether the Biden administration's early border policy was a mistake.  Trump backed out of an interview with the program.  —  Vice President Kamala Harris for weeks was criticized for avoiding tough questions … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-undergoes-60-minutes-grilling-trump-sits-rcna174415"
  },
  {
    "text": "‘60 Minutes’ Brings the Receipts on Trump's Interview About-Face  —  STRAIGHT FROM THE SOURCE  —  The former president pulled out of the sit-down over an apparent dispute about the show's fact-checking policies.  —  CBS gave further detail Monday on Donald Trump's decision to bail … ",
    "url": "https://www.thedailybeast.com/60-minutes-brings-the-receipts-on-trumps-interview-about-face"
  },
  {
    "text": "Trump Says He's Visited Gaza, but No Record of Such a Trip Exists  —  An aide, speaking on the condition of anonymity, pointed to the former president's trip to Israel.  But Gaza is not in Israel.  —  Donald J. Trump suggested in a radio interview on Monday that he had visited war-torn Gaza in the past … ",
    "url": "https://www.nytimes.com/2024/10/07/us/politics/trump-gaza-israel.html"
  },
  {
    "text": "Ron DeSantis' Administration Is Threatening to Prosecute the Media for Airing Pro-Choice Ads  —  Florida Gov. Ron DeSantis' administration is threatening TV stations that air ads in support of an abortion rights ballot initiative with criminal penalties, including jail time.",
    "url": "https://slate.com/news-and-politics/2024/10/florida-amendment-4-ron-desantis-administration-prosecute-media-airing-pro-choice-ads.html"
  },
  {
    "text": "Lying Is Loyalty in Trump's GOP  —  So how far will his allies go to keep their king happy?  —  Donald Trump, who proved to be deeply dishonest as a candidate in 2016, and as president for four years, is lying with reckless abandon as he tries to return to the White House.",
    "url": "https://www.vanityfair.com/news/story/lying-is-loyalty-in-trumps-gop"
  },
  {
    "text": "Payments of $750 are only part of federal financial assistance after Helene |  Fact check  —  The claim: Americans affected by Hurricane Helene receive ‘only $750’ in aid  —  An Oct. 2 Instagram post (direct link, archive link) by conservative commentator Benny Johnson includes a clip … ",
    "url": "https://www.usatoday.com/story/news/factcheck/2024/10/07/helene-aid-more-than-75-fact-check/75559425007/"
  },
  {
    "text": "As Major Hurricane Approaches Florida, FEMA Faces Severe Staffing Shortage  —  Fewer than 10 percent of the agency's disaster workers are available to respond to Hurricane Milton and other calamities.  —  The Federal Emergency Management Agency is running out of staff to deal … ",
    "url": "https://www.nytimes.com/2024/10/07/climate/hurricane-milton-fema-staff-shortage.html?unlocked_article_code=1.QU4.uhu9.t5doUgPt3Zz8&smid=url-share"
  },
  {
    "text": "Montana GOP Senate candidate says women have been ‘indoctrinated’ on abortion  —  In newly unearthed audio from last year, Tim Sheehy said abortion is “all” young women “want to talk about.”  —  Montana Senate candidate Tim Sheehy, who is locked in a highly consequential race … ",
    "url": "https://www.nbcnews.com/politics/2024-election/montana-senate-candidate-tim-sheehy-women-indoctrinated-abortion-rcna174390"
  },
  {
    "text": "Kamala Harris gains slight lead over Donald Trump in Michigan, poll shows  —  Democratic Vice President Kamala Harris appears to have gained momentum in a race for the White House that remains neck and neck in Michigan with a month until Election Day, according to a new poll from The Detroit News and WDIV-TV (Channel 4).",
    "url": "https://www.detroitnews.com/story/news/politics/2024/10/07/kamala-harris-donald-trump-michigan-poll-slight-lead-presidential-race-white-house-rfk-kennedy/75552929007/"
  },
  {
    "text": "Why asking about the 2020 election isn't a ‘gotcha’ question  —  The question is less about 2020 than about the willingness of Trump supporters to reject his efforts to subvert the 2024 results.  —  House Speaker Mike Johnson (R-La.) is not interested in talking about the 2020 election.",
    "url": "https://www.washingtonpost.com/politics/2024/10/07/why-asking-about-2020-election-isnt-gotcha-question/"
  },
  {
    "text": "A Distributional Analysis of Donald Trump's Tax Plan  —  Impact Of Donald Trump's Tax Proposals by Income Group  —  Former President Donald Trump has proposed a wide variety of tax policy changes.  Taken together, these proposals would, on average, lead to a tax cut for the richest 5 percent … ",
    "url": "https://itep.org/a-distributional-analysis-of-donald-trumps-tax-plan-2024/"
  },
  {
    "text": "Porn Stars Aim to Turn Own Audience With Anti-Project 2025 Blitz  —  NAKED AGENDA  —  More than a dozen adult entertainment stars have established a campaign against right-wing efforts to ban pornography.  —  Journalist  —  Porn stars threw their hat in the political ring … ",
    "url": "https://www.thedailybeast.com/porn-stars-aim-to-turn-viewers-with-anti-project-2025-blitz"
  },
  {
    "text": "‘We already have the receipts.’ Election denier says his group gained access to U.S. banking data  —  Arizona's Mark Finchem says Millersville, Tennessee's assistant police chief, Shawn Taylor, used Treasury Department's FinCen data in work for Finchem's Election Fairness Institute",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/qanon-comes-to-main-street/we-already-have-the-receipts-election-denier-says-his-group-gained-access-to-u-s-banking-data"
  },
  {
    "text": "‘Easy money’: Trump backer Elon Musk claims PAC will pay $47 for swing state voter information … Tesla CEO Elon Musk, who is backing Donald Trump in the presidential election, on Sunday touted a $47 referral bonus that the billionaire's political action committee is offering to people … ",
    "url": "https://www.cnbc.com/2024/10/07/elon-musk-pac-election-bonus-gun-rights-petition-referrals.html"
  },
  {
    "text": "Supreme Court lets stand a decision barring emergency abortions that violate Texas ban  —  The Supreme Court on Monday let stand a decision barring emergency abortions that violate the law in Texas, which has one of the country's strictest abortion bans.  Without detailing their reasoning … ",
    "url": "https://apnews.com/article/supreme-court-emergency-abortion-texas-bf79fafceba4ab9df9df2489e5d43e72"
  },
  {
    "text": "GEICO is Terminating Insurance Coverage of Tesla Cybertrucks, Says “This Type of Vehicle Doesn't Meet Our Underwriting Guidelines”  —  GEICO, the second-largest vehicle insurance underwriter in the US, has decided it will no longer cover Tesla Cybertrucks.  The company is terminating current … ",
    "url": "https://www.torquenews.com/11826/geico-terminating-insurance-coverage-tesla-cybertrucks-says-type-vehicle-doesnt-meet-our"
  },
  {
    "text": "Saying immigrants bring ‘bad genes’ echoes Trump's history — and the world's  —  With a mishmash of false claims about crime and ridiculous race science, Trump makes explicit the racism at the heart of his politics.  —  Former president Donald Trump has long espoused a worldview in which genes … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/07/trump-finally-just-says-that-some-immigrants-are-genetically-inferior/"
  }
]