[
  {
    "text": "Israel and Hamas reach tentative U.S.-brokered deal to pause conflict, free dozens of hostages  —  A five-day pause in fighting, monitored by aerial surveillance, could see dozens of women and children freed from captivity in Gaza, according to people familiar with the terms of the agreement",
    "url": "https://www.washingtonpost.com/national-security/2023/11/18/us-israel-hamas-reach-tentative-deal-pause-conflict-free-dozens-hostages/"
  },
  {
    "text": "PM says bucking int'l pressure against Gaza op, stresses no hostage deal ‘as of now’  —  Netanyahu, Gallant vow IDF will track down Hamas operatives in south of Strip, outside enclave; Gantz: ‘Everything we are doing is aimed first and foremost’ at return of hostages",
    "url": "https://www.timesofisrael.com/pm-says-bucking-intl-pressure-against-gaza-op-stresses-as-of-now-no-hostage-deal/"
  },
  {
    "text": "Gov. Evers says ‘Neo-Nazis, antisemitism, and white supremacy have no home in Wisconsin’ after demonstration on state Capitol grounds  —  MADISON — A group of nearly two dozen people waving swastika flags and chanting antisemitic rhetoric marched on the Wisconsin state Capitol grounds Saturday afternoon … ",
    "url": "https://www.jsonline.com/story/news/politics/2023/11/18/neo-nazi-group-marches-on-state-capital/71636061007/"
  },
  {
    "text": "Neo-Nazis March Through Madison Yelling ‘There Will Be Blood’  —  They wore masks, of course.  —  A group of masked neo-Nazis marched through the capital of Wisconsin on Saturday afternoon waving swastikas around, shouting racial slurs at onlookers, and chanting “there will be blood.”",
    "url": "https://www.thedailybeast.com/neo-nazis-march-through-madison-yelling-there-will-be-blood"
  },
  {
    "text": "The U.S. won't back down from the challenge of Putin and Hamas  —  Joe Biden, a Democrat, is president of the United States.  —  Today, the world faces an inflection point, where the choices we make — including in the crises in Europe and the Middle East — will determine the direction of our future for generations to come.",
    "url": "https://www.washingtonpost.com/opinions/2023/11/18/joe-biden-gaza-hamas-putin/"
  },
  {
    "text": "X ad boycott gathers pace amid antisemitism storm  —  Firms including Apple, Disney and IBM have paused advertising on X amid an antisemitism storm on the site.  —  It comes after X owner Elon Musk amplified an antisemitic trope on the platform formerly known as Twitter.",
    "url": "https://www.bbc.com/news/world-us-canada-67460386"
  },
  {
    "text": "With antisemitic tweet, Elon Musk reveals his ‘actual truth’  —  Editor's Note: A version of this story appeared in CNN Business' Nightcap newsletter.  To get it in your inbox, sign up for free, here.  —  New York CNN  —  Elon Musk has publicly endorsed an antisemitic conspiracy … ",
    "url": "https://www.cnn.com/2023/11/17/business/elon-musk-reveals-his-actual-truth/"
  },
  {
    "text": "The No Labels party asked its supporters if they would pay $100 to help choose its 2024 nominee  —  No Labels, a political organization that has alarmed some Democrats with talk of launching a third-party presidential candidate, has contemplated requiring a donation of at least $100 in order … ",
    "url": "https://apnews.com/article/no-labels-poll-unity-ticket-5713de0765dcf4b1b5ec16fb2ee4088d"
  },
  {
    "text": "Trump vows to kill Asia trade deal being pursued by Biden if elected  —  Donald Trump, the frontrunner for the Republican presidential nomination, said on Saturday that he would kill off a Pacific trade pact being advanced by U.S. President Joe Biden if he were to win the 2024 election and return to the White House.",
    "url": "https://www.reuters.com/world/us/trump-vows-kill-asia-trade-deal-being-pursued-by-biden-if-elected-2023-11-19/"
  },
  {
    "text": "You shouldn't be driving over 100 mph—and your car shouldn't let you  —  The NTSB recommended that automakers be required to install technology to prevent reckless speeding.  —  The traffic signal on North Las Vegas's North Commerce Street had been red for at least 29 seconds, but the Dodge Challenger did not slow down.",
    "url": "https://www.fastcompany.com/90985257/you-shouldnt-be-driving-over-100-mph-and-your-car-shouldnt-let-you"
  },
  {
    "text": "Federal Indictment Unsealed After U.S. Postal Employee And Two Co-Conspirators Are Arrested For $24 Million Stolen Check Scheme  —  For Immediate Release  —  U.S. Attorney's Office, Western District of North Carolina  —  CHARLOTTE, N.C. - A U.S. Postal Service employee and two co-conspirators … ",
    "url": "https://www.justice.gov/usao-wdnc/pr/federal-indictment-unsealed-after-us-postal-employee-and-two-c-conspirators-are"
  },
  {
    "text": "How a flood of congressional retirements is rocking the 2024 elections  —  Nine incumbents have already announced this month they aren't running for reelection next year.  —  A surge of lawmakers calling it quits the past three weeks is on the verge of putting Congress on pace … ",
    "url": "https://www.politico.com/news/2023/11/18/congress-retirements-2024-elections-00127883"
  },
  {
    "text": "Hunter Biden's career of benefiting from his father's name  —  The president's son has had a complex, even tortured relationship with the ‘Biden brand’  —  Hunter Biden worked for years to cultivate high-level relationships in China, flying to the country with his father on Air Force … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/18/hunter-biden-family-name/"
  },
  {
    "text": "Wall Street Eyes Nikki Haley as Trump Spoiler  —  Republican donors aim to boost Haley while Biden backers fret about his chances  —  Big hitters on Wall Street are lining up to support Nikki Haley's long-shot bid to snatch the 2024 Republican presidential nomination from Donald Trump.",
    "url": "https://www.wsj.com/politics/elections/wall-street-eyes-nikki-haley-as-trump-spoiler-1b3144f3?mod=followamazon"
  },
  {
    "text": "Colorado Judge Keeps Trump on Ballot but Finds He ‘Engaged in Insurrection’  —  A district court judge ruled that former President Donald J. Trump “engaged in insurrection” but said the disqualification clause of the 14th Amendment did not apply to him.  —  A Colorado judge ruled on Friday … ",
    "url": "https://www.nytimes.com/2023/11/17/us/politics/colorado-trump-14th-amendment.html"
  }
]