[
  {
    "text": "Inside the Democratic rebellion against Biden over the Gaza war  —  The depth of Democratic Party anger over President Joe Biden's handling of the Gaza war has caught his campaign off guard and could depress support in November's election, according to Reuters interviews with more than a dozen senior party … ",
    "url": "https://www.reuters.com/world/us/inside-democratic-rebellion-against-biden-over-gaza-war-2024-02-27/"
  },
  {
    "text": "Playbook: What Joe Biden has to fear from Michigan  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  A NEWSY EPISODE OF ‘LATE NIGHT’ — President JOE BIDEN addressed prospects for a cease-fire in the Israel-Hamas war during his appearance on NBC's … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/27/what-joe-biden-has-to-fear-from-michigan-00143487"
  },
  {
    "text": "My Nikki Haley Theory  —  From the day she came in third in Iowa to her 20-point loss to Donald Trump on Saturday in South Carolina, Nikki Haley and her aims have been the subject of intense speculation.  Clearly, in the absence of a lightning bolt from the blue that strikes Donald Trump … ",
    "url": "https://www.commentary.org/john-podhoretz/my-nikki-haley-theory/"
  },
  {
    "text": "“Suicide for our country”: Nikki Haley goes scorched earth on Trump … - “This may be his survival mode to pay his legal fees and get out of some sort of legal peril, but this is like suicide for our country,” she said of the former president, who faces 91 criminal counts across four cases.",
    "url": "https://www.axios.com/2024/02/27/nikki-haley-trump-wall-street-journal-interview"
  },
  {
    "text": "Jack Smith Pounds Trump For His Unprecedented Conduct In MAL Case  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  No One Has Ever Done What Trump Did  —  Special Counsel Jack Smith unleashed a tight, targeted fusillade in the Mar-a-Lago case … ",
    "url": "https://morningmemo.talkingpointsmemo.com/p/jack-smith-pounds-trump-for-his-unprecedented"
  },
  {
    "text": "Pride flags would be largely banned in Tennessee classrooms in bill advanced by GOP lawmakers  —  The GOP-led Tennessee House has passed a bill that would largely ban displaying pride flags in public school classrooms  —  NASHVILLE, Tenn. — A bill that would largely ban displaying pride flags … ",
    "url": "https://abcnews.go.com/Politics/wireStory/pride-flags-largely-banned-tennessee-classrooms-bill-advanced-107568221"
  },
  {
    "text": "Tennessee House advances bill to ban reappointing lawmakers booted for behavior  —  One of the Legislature's staff attorneys expressed concerns about the bill last week, telling House lawmakers during a committee hearing that it raises constitutional questions.",
    "url": "https://www.nbcnews.com/politics/politics-news/tennessee-house-advances-bill-ban-reappointing-lawmakers-booted-behavi-rcna140641"
  },
  {
    "text": "Duckworth to demand vote on IVF bill  —  The bill would establish federal protections that override any state policy restricting IVF access.  —  Sens. Tammy Duckworth (D-Ill.) and Patty Murray (D-Wash.) will hold a press conference Tuesday morning demanding a vote on their bill to federally protect … ",
    "url": "https://www.politico.com/news/2024/02/27/duckworth-ivf-senate-vote-00143509"
  },
  {
    "text": "The economy is roaring.  Immigration is a key reason.  —  Momentum in the job market picked up aggressively over the past year — all while Washington is deadlocked on a border deal.  —  Immigration has propelled the U.S. job market further than just about anyone expected … ",
    "url": "https://www.washingtonpost.com/business/2024/02/27/economy-immigration-border-biden/"
  },
  {
    "text": "'The numbers right now aren't good.'  —  FOR YEARS, DONALD TRUMP'S CAMPAIGN STAFF struggled to get him to make donor calls and take fundraising seriously.  —  But that was before Trump faced an incumbent president and a primary opponent who was outraising him.",
    "url": "https://plus.thebulwark.com/p/trump-fundraising-more-than-ever"
  },
  {
    "text": "Two candidates for mayor of a Mexican city are shot dead within hours of each other  —  Candidates Armando Pérez and Miguel Ángel Zavala were found dead days before campaigning was set to formally begin.  —  MEXICO CITY — Two candidates for mayor in the Mexican city of Maravatio … ",
    "url": "https://www.nbcnews.com/news/latino/mexican-mayoral-candidates-shot-dead-hours-rcna140739"
  },
  {
    "text": "Schumer: MAGA hard right ‘wants a shutdown’  —  Senate Majority Leader Chuck Schumer (D-N.Y.) ahead of a White House meeting Tuesday called on Speaker Mike Johnson (R-La.) to “reject the MAGA hard right, which wants a shutdown.”  —  Schumer is ramping up his rhetoric ahead of a Tuesday midday meeting … ",
    "url": "https://thehill.com/policy/energy-environment/4491370-schumer-maga-hard-right-wants-a-shutdown/"
  },
  {
    "text": "Kroger's “nefarious bargain”  —  This is a special joint edition of Popular Information and Fingers, a newsletter about drinking in America by journalist Dave Infante.  Fingers is a must-read for anyone who cares about the business, culture, and chaos of booze.  Sign up HERE.",
    "url": "https://popular.info/p/krogers-nefarious-bargain"
  },
  {
    "text": "Major new Canadian legislation would penalize online hate at risk of censorship  —  The Canadian government has introduced legislation proposing new regulatory bodies and heavier sentences to combat online abuse, a proposal backed by some U.S. Big Tech firms with major implications for free speech.",
    "url": "https://www.washingtonexaminer.com/policy/technology/2888876/major-new-canadian-legislation-would-penalize-online-hate-at-risk-of-censorship/"
  },
  {
    "text": "Emhoff unveiling $1.7B in new commitments to Biden anti-hunger initiative  —  Second gentleman Doug Emhoff is unveiling nearly $1.7 billion in new commitments to the Biden administration's efforts to end hunger by the end of the decade.  —  The list includes more than 140 commitments from nonprofits … ",
    "url": "https://thehill.com/homenews/administration/4491163-emhoff-unveiling-1-7b-in-new-commitments-to-biden-anti-hunger-initiative/"
  },
  {
    "text": "Vice president's SUV was partially ‘airborne’ during 2022 motorcade accident, records show  —  The Secret Service agent involved in the accident was allowed to avoid defensive driving training.  —  The back end of the vehicle carrying Vice President Kamala Harris “became momentarily airborne” … ",
    "url": "https://www.nbcnews.com/news/us-news/president-kamala-harris-suv-airborne-2022-accident-driver-rcna140599"
  },
  {
    "text": "The far right has replaced the old left as Russia's propaganda tool  —  During the 20th century, the American Communist Party and left-leaning journalists acted as conduits for the Soviet Union's propaganda.  At no time was this clearer than in August 1939, when the Soviet Union and Nazi Germany signed a non-aggression pact.",
    "url": "https://thehill.com/opinion/international/4489496-the-far-right-has-replaced-the-old-left-as-russias-propaganda-tool/"
  },
  {
    "text": "This ex-congressman couldn't take it anymore  —  Elizabeth Becker, a former Post correspondent, began her career covering the war in Cambodia and its aftermath under Pol Pot.  She is the author of five books, including “You Don't Belong Here: How Three Women Rewrote the Story of War.",
    "url": "https://www.washingtonpost.com/opinions/2024/02/27/jim-mcdermott-expat-france-trump/"
  },
  {
    "text": "Project 2025: The “Cowboy Catholic” & the Conservative Counter-Reformation  —  “Mandate for Leadership,” a totalitarian tome produced by the Heritage Foundation and its partners, is a how-to guide for ending the United States as we know it.  —  I. The “Cowboy Catholic”",
    "url": "https://gregolear.substack.com/p/project-2025-the-cowboy-catholic"
  },
  {
    "text": "In leaked audio, Supreme Court Justice John Devine railed against “brainwashed” GOP colleagues  —  Devine, a former anti-abortion activist, faces a heated primary challenge that has focused on questions about his ethics.  —  Speaking to a group of East Texas voters in September … ",
    "url": "https://www.texastribune.org/2024/02/27/john-devine-texas-supreme-court-conservatives/"
  },
  {
    "text": "Sri Lanka ends visas for hundreds of thousands of Russians staying there to avoid war  —  Investigation launched into order asking Russians to leave country amid blacklash over ‘whites only policy’  —  With Maldives Out Sri Lanka Witnesses An Influx Of Indian Tourists - Travel Guide To Sri Lanka",
    "url": "https://www.independent.co.uk/asia/south-asia/sri-lanka-russia-tourist-visa-ukraine-war-b2502986.html"
  },
  {
    "text": "Johnson said to commit to avoiding shutdown during White House meeting  —  The speaker made “unequivocally” clear that he wants to avoid even a partial closure that's set to happen Saturday at midnight, Senate Majority Leader Chuck Schumer said.",
    "url": "https://www.politico.com/live-updates/2024/02/27/congress/johnson-at-meeting-00143561"
  }
]