[
  {
    "text": "Lawyers found classified docs in Trump's bedroom 4 months after Mar-a-Lago search  —  The revelation was contained in a newly unsealed opinion that a federal judge issued in 2023.  —  Four months after the FBI raided his Mar-a-Lago estate, Donald Trump's attorneys discovered four documents marked “classified” in his personal bedroom.",
    "url": "https://www.politico.com/news/2024/05/21/trump-classified-documents-bedroom-00159182"
  },
  {
    "text": "Trump email falsely says Biden was ‘locked & loaded’ to ‘take me out’ in Mar-a-Lago search  —  A former president falsely accusing his successor and rival of posing a threat to his life is without precedent in modern U.S. history.  —  Donald Trump on Tuesday falsely claimed … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/21/trump-mar-a-lago-raid-fbi-deadly-force/"
  },
  {
    "text": "Fani Willis and judge presiding over Georgia Trump election case defeat challengers  —  Fulton County District Attorney Fani Willis, the Georgia prosecutor who brought a sprawling racketeering case against former President Donald Trump and others, has won the Democratic primary in her bid for reelection.",
    "url": "https://apnews.com/article/fani-willis-scott-mcafee-trump-georgia-indictment-6e55b3a7eafd66c6ae3dae3a50d3187a"
  },
  {
    "text": "Fani Willis, top prosecutor in Georgia Trump case, wins primary  —  Willis now proceeds to November's general election, where she will face Courtney Kramer, a Republican lawyer who interned in the Trump White House.  —  ATLANTA — Two of the most prominent figures in the Georgia criminal case … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/21/fani-willis-georgia-democratic-primary/"
  },
  {
    "text": "‘Unified Reich’: Trump campaign goes full Nazi  —  In a shocking development - even by the Republican Party's low, low standards - Donald Trump has directly framed his campaign using Nazi terminology.  —  A video posted on his social media accounts yesterday promised a “unified Reich” if he wins the presidency in 2024.",
    "url": "https://www.theframelab.org/unified-reich-trump-campaign-goes-full-nazi/"
  },
  {
    "text": "The right's fascism problem  —  UNFORCED ERROR — Since Donald Trump emerged on the national political scene in 2015, journalists and pundits have been debating whether it's appropriate to compare him and the MAGA movement to the fascist movements of 20th-century Europe — and, more specifically … ",
    "url": "https://www.politico.com/newsletters/politico-nightly/2024/05/21/the-rights-fascism-problem-00159265"
  },
  {
    "text": "Biden's approval rating falls to lowest level in nearly two years-Reuters/Ipsos poll  —  U.S. President Joe Biden's public approval rating this month fell to its lowest level in almost two years, tying the lowest reading of his presidency in a warning sign for his reelection effort, a Reuters/Ipsos poll showed.",
    "url": "https://www.reuters.com/world/us/bidens-approval-rating-falls-lowest-level-nearly-two-years-reutersipsos-poll-2024-05-21/"
  },
  {
    "text": "Kremlin TV Drops ‘New’ Tucker Carlson Show  —  THEY'LL NEVER LET GO  —  The former Fox News host has responded to becoming a fixture on Russian TV.  —  The Kremlin propaganda machine has made Tucker Carlson its newest star television host, whether he likes it or not.",
    "url": "https://www.thedailybeast.com/kremlin-tv-drops-new-tucker-carlson-show"
  },
  {
    "text": "Trump says he will ‘never advocate’ for contraception restrictions after earlier saying he's ‘looking at’ them  —  The social media post came after Trump said in a TV interview that he plans to share a policy on contraception “very shortly,” without providing details.",
    "url": "https://www.politico.com/news/2024/05/21/trump-contraception-abortion-00159118"
  },
  {
    "text": "SHOCK POLL: Trump Tied With Biden in Blue New Hampshire  —  Democrats have all but owned the Granite State's four Electoral College votes, winning seven of the past eight presidential contests - including Joe Biden's eight-point victory over President Donald Trump in 2020.",
    "url": "https://nhjournal.com/shock-poll-trump-tied-with-biden-in-solid-blue-new-hampshire/"
  },
  {
    "text": "House G.O.P. Moves to Crack Down on Noncitizen Voting, Sowing False Narrative  —  The bills under consideration in the House have virtually no chance of becoming law, but Republicans are using them to amplify former President Donald J. Trump's false claims of widespread illegal voting by noncitizens.",
    "url": "https://www.nytimes.com/2024/05/21/us/politics/republicans-noncitizen-voting-false-narrative.html"
  },
  {
    "text": "Rep. Greg Murphy reveals skull tumor diagnosis, planned surgery … - He is an active member of the House Committee on Ways and Means, the Committee on Veterans' Affairs and the Committee on House Administration.  — “As a physician I have, for the last 30 years, taken care of thousands and thousands of patients.",
    "url": "https://www.axios.com/2024/05/21/skull-tumor-greg-murphy-north-carolina"
  },
  {
    "text": "The Right Has A Terrifying Second Trump Term Plan Called Project 2025  —  Many of our readers have asked us to explore the details and dangers of “Project 2025”—a right-wing plan for how to move America toward authoritarian rule under a second Trump term.  —  Few writers and scholars … ",
    "url": "https://thinkbigpicture.substack.com/p/project-2025-thomas-zimmer-trump"
  },
  {
    "text": "“Pro-Pedophile” Activist Group Celebrates As Germany Decriminalizes Child Porn Possession  —  Germany's Parliament (Bundestag) has received the votes necessary to remove a section of the Criminal Code which made the possession of child sexual abuse materials a felony crime.",
    "url": "https://reduxx.info/pro-pedophile-activist-group-celebrates-as-germany-decriminalizes-child-porn-possession/"
  },
  {
    "text": "Low Energy, Part 2  —  Let me follow up about the comment TPM Reader HS got when she called the office of her state's senior senator, Alex Padilla.  She called insisting there should be some kind of investigation into the Justice Alito flag controversy.  When HS got through to Padilla's office … ",
    "url": "https://talkingpointsmemo.com/edblog/low-energy-part-2/sharetoken/GqTtixfpJuqz"
  },
  {
    "text": "Scoop: Mike Johnson's communications director to leave Capitol Hill … - Shah's timeline on leaving Johnson's office is unclear, but he is expected to remain on through at least the end of the month.  — “It's an honor to serve Speaker Johnson, especially through such an historic time,” Shah said in a statement.",
    "url": "https://www.axios.com/2024/05/22/mike-johnson-communications-raj-shah-trump"
  },
  {
    "text": "California pushes through Gavin Newsom's bill helping Arizona abortion-seekers  —  The measure is expected to go into effect imminently, just weeks after the blue-state governor made the proposal to take in patients from the neighboring state.  —  SACRAMENTO, Calif. … ",
    "url": "https://www.politico.com/news/2024/05/21/california-newsom-bill-arizona-abortion-00158274"
  },
  {
    "text": "Louisiana House passes bill to make abortion pills a controlled dangerous substance  —  The measure would make possession of the medications without valid prescriptions or orders from medical professionals punishable by up to five years in prison, with an exception for pregnant people.",
    "url": "https://www.nbcnews.com/news/us-news/louisiana-passes-bill-make-abortion-pills-controlled-dangerous-substan-rcna153052"
  },
  {
    "text": "Now, Biden's Gaza pier aid is being stolen  —  .  —  The Biden administration continues dreaming up ways to deliver aid to Gaza while knowing full well that aid is going to be stolen, likely by Hamas terrorists.  —  On Friday, 10 truckloads of food aid arrived at United Nations facilities in Gaza … ",
    "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/3011753/now-bidens-gaza-pier-aid-being-stolen/"
  },
  {
    "text": "Key GOP senators criticize Alito over upside-down flag incident  —  Key Republican senators sharply criticized Supreme Court Justice Samuel Alito after news reports showed an upside-down American flag - a symbol used by some supporters of former President Donald Trump who challenged the legitimacy … ",
    "url": "https://www.cnn.com/2024/05/21/politics/republican-senators-alito-upside-down-flag"
  },
  {
    "text": "Trump seems unlikely to testify.  Here's the latest.  —  The jury has been dismissed until closing arguments next Tuesday, but the court has more business to deal with this afternoon.  Lawyers for Donald J. Trump called just two witnesses before wrapping up their case.  —  The jury will begin deliberations next week.",
    "url": "https://www.nytimes.com/live/2024/05/21/nyregion/trump-trial-hush-money"
  },
  {
    "text": "Giuliani says he will stop accusing Georgia workers of election tampering  —  A federal jury in December ordered Giuliani, a former attorney to Donald Trump, to pay $148 million to poll workers for falsely accusing them of election fraud.  —  Rudy Giuliani has agreed to no longer accuse … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/21/giuliani-georgia-defamation-agreement/"
  },
  {
    "text": "5/21/24 ☀️ Punchbowl News AM  —  The Vault: How G7 could reshape the REPO Act  —  The Vault: Dems push for quick Gruenberg replacement  —  Esper warns of a ‘cool war’ with China and threats to world order  —  Johnson loses trio of key policy aides",
    "url": "https://punchbowl.news/archive/52124-punchbowl-news-am/"
  },
  {
    "text": "UN halts all food distribution in Rafah after running out of supplies in the southern Gaza city  —  The United Nations says it has suspended food distribution in the southern Gaza city of Rafah due to lack of supplies and insecurity.  It also said no aid trucks entered in the past two days via … ",
    "url": "https://apnews.com/article/israel-palestinians-west-bank-jenin-raid-a3320a77a3a6ccff41db2a4bc63e4aa3"
  }
]