[
  {
    "text": "Gov. Shapiro and Family Evacuated After Arson at Pennsylvania Residence  —  The governor said the State Police banged on the door early on Sunday to wake him and his family after an arsonist set fire to the governor's official residence in Harrisburg.  —  The governor of Pennsylvania … ",
    "url": "https://www.nytimes.com/2025/04/13/us/politics/josh-shapiro-arson-attack-pennsylvania.html"
  },
  {
    "text": "Suspect in custody after overnight fire at Pennsylvania Gov. Josh Shapiro's residence  —  Shapiro said his family was evacuated from the official Harrisburg residence at 2 a.m. and that no one was injured.  —  One person is in custody in relation to the fire set to to Gov. Josh Shapiro's official residence … ",
    "url": "https://www.nbcnews.com/news/us-news/gov-josh-shapiro-residence-arson-investigation-rcna201044"
  },
  {
    "text": "Josh Shapiro's Firebombed House Revealed in New Inside Pics  —  SCORCHED EARTH  —  Photos show the horrific aftermath after an alleged 38-year-old arsonist set fire to the Pennsylvania governor's home.  —  New photos have been released capturing the horrific aftermath of a suspected arson attack … ",
    "url": "https://www.thedailybeast.com/pictures-capture-horrific-aftermath-of-arson-attack-on-josh-shapiros-home/"
  },
  {
    "text": "Suspect arrested after arson at Pennsylvania governor's house forced Shapiro and family to evacuate  —  A 38-year-old man has been arrested in connection with an arson fire at the Pennsylvania governor's house as the governor and his family slept inside.  —  Harrisburg Bureau of Fire responded … ",
    "url": "https://cnn.com/2025/04/13/us/pennsylvania-governor-josh-shapiro-arson"
  },
  {
    "text": "No evidence linking Tufts student to antisemitism or terrorism, State Dept. office found  —  An internal memo, prepared days before Rumeysa Ozturk was detained by ICE agents, raises doubts about the Trump administration's claims that she supports Hamas.  —  Just now",
    "url": "https://www.washingtonpost.com/national-security/2025/04/13/tufts-student-rumeysa-ozturk-rubio-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0NTE2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1ODk5MTk5LCJpYXQiOjE3NDQ1MTY4MDAsImp0aSI6ImUxOGViZjAxLTdjZWUtNDY2Ni1iMDllLWRiZmE1NmEzMDIzZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzEzL3R1ZnRzLXN0dWRlbnQtcnVtZXlzYS1venR1cmstcnViaW8tdHJ1bXAvIn0.w9ScWurkqrxRu6P10aQmXl6ArBXvUe9CH2oTdp7fFjU&itid=gfta"
  },
  {
    "text": "American Rendition: Rümeysa Öztürk's Journey From Ph.D. Scholar to Trump Target Languishing in Louisiana Cell  — Odyssey: Rümeysa Öztürk's arrest and detention reveal what President Donald Trump's deportation campaign looks like on the street level.",
    "url": "https://www.propublica.org/article/rumeysa-ozturk-best-friend-inside-story-tufts-trump-louisiana-ice"
  },
  {
    "text": "Trump Signals New Tariffs on Chips, Calling Exclusions Temporary  —  On Friday, the administration carved out an exception for a variety of electronics from the steep taxes now applied to Chinese imports.  —  President Trump signaled on Sunday that he would pursue new tariffs … ",
    "url": "https://www.nytimes.com/2025/04/13/us/politics/trump-tariffs-china-chips-technology.html"
  },
  {
    "text": "Trump mulls semiconductor levies after lifting reciprocal tariffs on electronics  —  The Trump administration is considering new semiconductor tariffs, after the White House exempted certain electronics from reciprocal tariffs.  —  “We are taking a look at Semiconductors … ",
    "url": "https://www.npr.org/2025/04/13/g-s1-60086/semiconduct-tariffs-trump"
  },
  {
    "text": "Trump plans separate levy on exempted electronics amid trade war, Lutnick says  —  U.S. Commerce Secretary Howard Lutnick said on Sunday that smartphones, computers and some other electronics, just exempted from steep tariffs on imports from China, would face separate new duties along with semiconductors within the next two months.",
    "url": "https://www.reuters.com/markets/trump-plans-separate-levy-exempted-electronics-amid-trade-war-lutnick-says-2025-04-13/"
  },
  {
    "text": "Trump administration contends it has no duty to return illegally deported man to US  —  The administration's position suggests officials do not view the Supreme Court's order as compelling them to seek Abrego Garcia's return.  —  The Trump administration insisted Sunday that it has no legal obligation … ",
    "url": "https://www.politico.com/news/2025/04/13/abrego-garcia-el-salvador-trump-administration-00288502"
  },
  {
    "text": "Bukele, Abrego Garcia, and Red Lines  —  An emergency Sunday Triad, because I'm concerned that people don't appreciate how important this week will be for American democracy and our constitutional order.  —  Buckle up.  —  Join now  —  1. Escape  —  If you were Chris Krebs, would you flee the country?",
    "url": "https://www.thebulwark.com/p/bukele-abrego-garcia-and-red-lines"
  },
  {
    "text": "China Halts Critical Exports as Trade War Intensifies  —  Beijing has suspended exports of certain rare earth minerals and magnets that are crucial for the world's car, semiconductor and aerospace industries.  —  China has suspended exports of a wide range of critical minerals and magnets … ",
    "url": "https://www.nytimes.com/2025/04/13/business/china-rare-earths-exports.html?unlocked_article_code=1._U4.7FA3.WsbGOZqzHPWS&smid=bs-share"
  },
  {
    "text": "Trump Official Who Oversaw Closure of USAID Has Left State Department  —  Pete Marocco led the foreign-assistance mission at the State Department  —  WASHINGTON—A key architect of the Trump administration's campaign to slash foreign aid has left the State Department after less than three months on the job … ",
    "url": "https://www.wsj.com/politics/policy/trump-official-who-oversaw-closure-of-usaid-has-left-state-department-5760da3d?st=aaPBeP&reflink=mobilewebshare_permalink"
  },
  {
    "text": "Official who oversaw dismantling of USAID leaves State Department  —  Pete Marocco, a Trump administration official, left his position after less than three months.  He and Elon Musk both recommended severe cuts to the aid agency.  —  Pete Marocco, a State Department official who oversaw … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/13/pete-marocco-usaid/"
  },
  {
    "text": "Nostalgia for manufacturing will make the US poorer  —  Donald Trump's vision to onshore factory jobs reverses decades of progress  —  Welcome back.  Now that Donald Trump has paused his “reciprocal” tariff plans (as predicted in last week's newsletter), this edition will unpick … ",
    "url": "https://www.ft.com/content/845917ed-41a5-449f-946f-70263adbaeb7"
  },
  {
    "text": "Johnson: US must ‘eliminate people on Medicaid’ who are not ‘eligible to be there’  —  House Speaker Mike Johnson (R-La.) said Sunday that Republicans would protect entitlement programs as they press ahead with deep cuts to federal spending, but added the government must “eliminate people on Medicaid” who are not “eligible to be there.”",
    "url": "https://thehill.com/homenews/house/5247051-house-speaker-johnson-medicaid-cuts/"
  },
  {
    "text": "Mario Vargas Llosa, Nobel-Winning Peru Novelist, Dies at 89  — One of the foremost writers and intellectuals in Latin America  — He ran an unsuccessful campaign for president in 1990  —  Mario Vargas Llosa, the Peruvian winner of the 2010 Nobel Prize in Literature … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-14/mario-vargas-llosa-peruvian-nobel-winning-novelist-dies"
  },
  {
    "text": "SCOOP: Arizona to begin removing as many as 50K noncitizens from voter rolls following lawsuit  —  EXCLUSIVE: All 15 Arizona counties have now begun the process of verifying and removing noncitizens from their voter rolls, including nearly 50,000 registrants who did not provide proof of U.S. citizenship.",
    "url": "https://www.foxnews.com/politics/scoop-arizona-begin-removing-many-50k-non-citizens-from-voter-rolls-following-lawsuit"
  },
  {
    "text": "Australian academics refuse to attend US conferences for fear of being detained  —  ‘When academics fear travelling or partnering with US institutions, the impacts ripple through the entire global knowledge ecosystem,’ one says  — Get our afternoon election email, free app or daily news podcast",
    "url": "https://www.theguardian.com/australia-news/2025/apr/14/australian-academics-refuse-to-attend-us-conferences-for-fear-of-being-detained"
  }
]