[
  {
    "text": "One Big Unpopular Bill  —  Midday on Thursday, July 3, Republicans in the U.S. House of Representatives voted to approve a marquee tax cut and budget bill they've been trying to pass since May. Republicans in the Senate passed the same bill on Tuesday, courtesy of a tie-breaker by Vice President JD Vance … ",
    "url": "https://www.gelliottmorris.com/p/one-big-unpopular-bill"
  },
  {
    "text": "Is This Really How We're Legislating Now?  —  Speaker Mike Johnson once again defied skeptics and found a majority in a high-stakes vote, with the House passing the president's big policy bill on Thursday along party lines.  He and John Thune, the Senate leader, ably made whatever deals … ",
    "url": "https://www.nytimes.com/2025/07/04/opinion/congress-john-thune-mike-johnson.html"
  },
  {
    "text": "AOC Warns of ICE ‘Explosion’ After ‘Big Beautiful’ Bill Passes  —  THE WORST HAS YET TO COME  —  “It is setting up to make what's happening now look like child's play,” said the Democratic representative.  —  Rep. Alexandria Ocasio-Cortez warned that the effects of President Donald Trump's … ",
    "url": "https://www.thedailybeast.com/alexandria-ocasio-cortez-warns-ice-explosion-imminent-after-beautiful-bill/"
  },
  {
    "text": "GOP megabill littered with special tax breaks … There's a new supersized deduction for business meals — though only for employees at certain Alaskan fishing boats and processing plants, with the measure stipulating the facilities must be “located in the United States north of 50 degrees north latitude” … ",
    "url": "https://www.politico.com/news/2025/07/04/from-rum-to-gun-silencers-tailored-tax-breaks-add-billions-to-megabill-00438962"
  },
  {
    "text": "Trump tells Zelensky he wants to help Ukraine with air defense, sources say  —  President Trump told Ukrainian President Zelensky in a call on Friday that the U.S. wants to help Ukraine with air defense, due to escalating Russian attacks, a Ukrainian official and a source with knowledge of the call said.",
    "url": "https://www.axios.com/2025/07/04/trump-zelensky-ukraine-air-defense"
  },
  {
    "text": "Trump uses term viewed as antisemitic slur to refer to unscrupulous bankers  —  President Donald Trump deployed the term during a rally at the Iowa State Fairgrounds held to kick off a year of events culminating in America's 250th birthday celebration.  —  President Donald Trump used a term … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/04/trump-rally-jewish-stereotype/"
  },
  {
    "text": "Multiple deaths reported in Hill Country, rescue efforts underway as flash flooding threatens communities  —  Lt. Gov. Dan Patrick said rescuers are searching for survivors, including 23 girls missing from a Christian camp along the Guadalupe River.  —  Officials said as many as 13 bodies … ",
    "url": "https://www.texastribune.org/2025/07/04/texas-flooding-deaths/"
  },
  {
    "text": "Twenty-three girls missing from Texas summer camp after flash floods devastate area  —  At least six people are dead, and 23 children are unaccounted for from a girls' summer camp after heavy rainfall caused the Guadalupe River in Texas to flood on Friday.  —  Overnight, residents … ",
    "url": "https://www.washingtonexaminer.com/news/3463190/texas-flash-flood-results-multiple-missing-fatalities/"
  },
  {
    "text": "Hegseth halted weapons for Ukraine despite military analysis that the aid wouldn't jeopardize U.S. readiness  —  The move blindsided the State Department, Ukraine, European allies and members of Congress, who demanded an explanation from the Pentagon.  —  The Defense Department held … ",
    "url": "https://www.nbcnews.com/news/military/hegseth-halted-weapons-ukraine-military-analysis-aid-wouldnt-jeopardiz-rcna216790"
  },
  {
    "text": "Patel and Ratcliffe try to bolster claims that FBI and CIA conspired against Trump  —  The release of formerly classified documents this week shows how Trump appointees are using their power to try to prop up his allegations about both agencies.  —  The release of formerly classified FBI … ",
    "url": "https://www.nbcnews.com/politics/national-security/patel-ratcliffe-try-bolster-claims-fbi-cia-conspired-trump-rcna216848"
  },
  {
    "text": "Judge transfers new case challenging South Sudan deportations  —  An administrative stay issued Friday morning will last until 4:30 p.m. Further action would have to come from Massachusetts.  Read the new claims at Law Dork.  —  After a hearing on Friday, U.S. District Judge Randolph Moss transferred … ",
    "url": "https://www.lawdork.com/p/breaking-judge-issues-administrative"
  },
  {
    "text": "The Fourth Of July, Rethought  —  For years, I have retold the story reprinted below every Fourth of July.  It describes a formative experience in my life and in my identity as an American.  I still feel powerfully many of its sentiments: my fondness and appreciation for the late Judge Lew … ",
    "url": "https://www.popehat.com/p/the-fourth-of-july-rethought"
  },
  {
    "text": "Congress Throws More Money at Removing Immigrants than Most Countries Spend on Their Armies  —  It's hard to convey just how big the new budget makes the country's immigration enforcement infrastructure.  —  The Bureau of Prisons?  Bigger than that.  The FBI?  Bigger.  The Marine Corps?",
    "url": "https://talkingpointsmemo.com/news/congress-throws-more-money-at-removing-immigrants-than-most-countries-spend-on-their-armies"
  },
  {
    "text": "Trump's Pardons Cost At Least $1.5 Billion In Restitution  —  Topline  —  President Donald Trump's pardons and commutations have cost more than $100 million in fines owed to the federal government and another $1.5 billion in restitution to victims.  —  Key Facts",
    "url": "https://www.forbes.com/sites/saradorn/2025/07/04/trumps-pardons-cost-at-least-15-billion-in-restitution/"
  },
  {
    "text": "BCG modelled plan to ‘relocate’ Palestinians from Gaza  —  Consulting firm had multimillion-dollar role in contentious new aid scheme for shattered enclave  —  Unlock the Editor's Digest for free  —  Boston Consulting Group modelled the costs of “relocating” Palestinians from Gaza and entered … ",
    "url": "https://www.ft.com/content/c0e661cc-55db-4e2a-b17b-a656e0cf6c14"
  },
  {
    "text": "Concentration Camp Labor  —  With the passage of Trump's death bill, we face the prospect of many great harms, including an archipelago of concentration camps across the United States.  —  Concentration camps are sites of tempting slave labor.  Among many other aims, the Soviets used … ",
    "url": "https://snyder.substack.com/p/concentration-camp-labor"
  },
  {
    "text": "Elon Musk floats strategy for new political party  —  Elon Musk on Friday floated an electoral strategy for his hypothetical political party, via a post on X. … - Most recently, Musk has been an outspoken critic of Trump's signature legislation, which the Tesla CEO believes is fiscally irresponsible … ",
    "url": "https://www.axios.com/2025/07/04/elon-musk-new-political-party"
  },
  {
    "text": "Law used to kick out Nazis could be used to strip citizenship from many more Americans  —  For decades, the US Department of Justice has used a tool to sniff out former Nazis who lied their way into becoming American citizens: a law that allowed the department to denaturalize, or strip … ",
    "url": "https://cnn.com/2025/07/04/politics/justice-department-trump-denaturalization"
  },
  {
    "text": "The Bulwark's top editor shares how the anti-Trump site tripled its subscriber base in a year — and why it's betting on YouTube  — The Bulwark, a news website that's fiercely critical of President Donald Trump, has grown rapidly.  — Since the 2024 election, The Bulwark has roughly doubled its paid subscriber base.",
    "url": "https://www.businessinsider.com/the-bulwark-jonathan-last-interview-growth-youtube-cable-msnbc-cnn-2025-7"
  }
]