[
  {
    "text": "Burning Man 2023: Feds shut down entry, tell burners waiting to get in to go home  —  Noon update: Burning Man entry shut down for remainder of event  —  The Bureau of Land Management released a statement Saturday, saying Burning Man entry is now closed for good:",
    "url": "https://www.rgj.com/story/life/arts/burning-man/2023/09/02/burning-man-2023-rain-keeps-burners-confined-to-camps/70749751007/"
  },
  {
    "text": "The leaked internal poll numbers scrambling the GOP primary  —  The DeSantis campaign is trying to shape the race with its own data.  —  Ron DeSantis' supporters were thrilled last week when a poll emerged following the first primary debate showing him bouncing up 7 points in the critical first caucus state of Iowa.",
    "url": "https://www.politico.com/news/2023/09/02/desantis-gop-primary-internal-polling-00113716"
  },
  {
    "text": "Kinzinger slams DeSantis for not meeting with Biden in Florida: ‘Absolutely outrageous’  —  Former Rep. Adam Kinzinger (R-Ill.) criticized Florida Gov. Ron DeSantis (R) for not meeting with President Biden while he visited the state Friday to survey hurricane damage, calling the decision “absolutely outrageous.”",
    "url": "https://thehill.com/homenews/campaign/4184404-kinzinger-slams-desantis-for-not-meeting-with-biden-in-florida-absolutely-outrageous/"
  },
  {
    "text": "Biden: ‘Nobody intelligent’ can deny the impact of climate crisis  —  President Biden on Saturday said that no intelligent person can deny the impacts of climate change after the president toured storm damage in Florida from Hurricane Idalia.  —  “Nobody can deny the impact of climate crises … ",
    "url": "https://thehill.com/homenews/administration/4184642-biden-says-nobody-intelligent-can-deny-the-impact-of-climate-crisis/"
  },
  {
    "text": "Biden tours Idalia damage in Florida as presidential politics swirl  —  President Joe Biden visited storm-ravaged Florida on Saturday in the wake of Hurricane Idalia, touring areas damaged by the storm, meeting residents and thanking emergency responders.  The post-disaster trip … ",
    "url": "https://www.cnn.com/2023/09/02/politics/joe-biden-florida-trip-hurricane-idalia-ron-desantis/"
  },
  {
    "text": "Florida Judge Throws Out DeSantis-Backed Congressional Map, Rules In Favor of Civil Rights Groups  —  The ruling, which will likely be appealed, is the latest legal victory for Democrats challenging redistricting in deep red states. … A judge in Florida ruled in favor of civil rights groups on Saturday … ",
    "url": "https://themessenger.com/politics/florida-redistricting-judge-throws-out-desantis-backed-congressional-map"
  },
  {
    "text": "Florida judge rejects state congressional map championed by DeSantis  —  A Florida judge on Saturday struck down congressional district lines for northern Florida advocated by Gov. Ron DeSantis, ruling that the Republican governor's map had improperly diluted Black voting power.",
    "url": "https://www.cnn.com/2023/09/02/politics/florida-redistricting-map-lawsuit-desantis/"
  },
  {
    "text": "Greene responds to criticism over impeachment comments: ‘The White House is attacking me’  —  Rep. Marjorie Taylor Greene (R-Ga.) responded Saturday to recent White House criticism of her saying she would vote against funding the government if the House decides not to open an impeachment inquiry against the president.",
    "url": "https://thehill.com/homenews/house/4184683-greene-responds-to-criticism-over-impeachment-comments/"
  },
  {
    "text": "Bill Richardson, a former governor and UN ambassador who worked to free detained Americans, dies  —  Bill Richardson, a two-term Democratic governor of New Mexico and an American ambassador to the United Nations who also worked for years to secure the release of Americans detained by foreign adversaries, has died.",
    "url": "https://apnews.com/article/bill-richardson-un-ambassador-new-mexico-governor-c1e6ed9705564452824d537293945662"
  },
  {
    "text": "Trump's Truth Social facing a key funding deadline  —  The ‘blank check’ ally of former president Donald Trump's media start-up was once a stock-market star.  It's now days away from potential liquidation.  —  When former president Donald Trump's media start-up announced in October 2021 … ",
    "url": "https://www.washingtonpost.com/technology/2023/09/02/truth-social-trump-media-digital-world/"
  },
  {
    "text": "Neo-Nazis March Through Florida Park  —  ‘WE ARE EVERYWHERE’  —  A large group of neo-Nazis wearing red and waving flags with swastikas marched through Cranes Roost Park in Altamonte Springs, Florida, on Saturday shouting “we are everywhere,” according to a video shared by a state lawmaker.",
    "url": "https://www.thedailybeast.com/neo-nazis-chanting-in-unison-march-through-florida-park-in-terrifying-video"
  },
  {
    "text": "Statement from President Joe Biden on the Passing of Jimmy Buffett  —  A poet of paradise, Jimmy Buffett was an American music icon who inspired generations to step back and find the joy in life and in one another.  —  His witty, wistful songs celebrate a uniquely American cast of characters … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/09/02/statement-from-president-joe-biden-on-the-passing-of-jimmy-buffett/"
  },
  {
    "text": "The Story of Our Universe May Be Starting to Unravel  —  Not long after the James Webb Space Telescope began beaming back from outer space its stunning images of planets and nebulae last year, astronomers, though dazzled, had to admit that something was amiss.",
    "url": "https://www.nytimes.com/2023/09/02/opinion/cosmology-crisis-webb-telescope.html"
  },
  {
    "text": "Biden has DNC plow $1.2M into Virginia amid Youngkin fundraising blitz  —  RICHMOND — President Biden directed the Democratic National Committee this week to pour $1.2 million into Virginia legislative races to counter record-smashing fundraising by Gov. Glenn Youngkin (R) … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/09/02/biden-fundraising-virginia-democrats/"
  }
]