[
  {
    "text": "A Second Trump Term Poses a Crucial Test of the Senate's Independence  —  President-elect Donald J. Trump is threatening to challenge the institution's historic role, and the Constitution, with his prospective nominees and threats to push the boundaries of executive authority.",
    "url": "https://www.nytimes.com/2024/12/01/us/politics/trump-senate-independence.html"
  },
  {
    "text": "Behind the Curtain: Trump's shock and awe … - Trump named real estate developer Charles Kushner — father of Trump's son-in-law, Jared — as ambassador to France. … - Less than six hours later, Trump announced he picked Kash Patel, one of the hardest of his first-term hardliners, as FBI director.",
    "url": "https://www.axios.com/2024/12/01/trump-cabinet-kash-patel-fbi"
  },
  {
    "text": "Playbook: Two big fights defining Washington right now  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  Over the last 16 or so hours, we've seen a dramatic escalation in two big fights that will define the near-term future of politics here in Washington.",
    "url": "https://www.politico.com/newsletters/playbook/2024/12/01/two-big-fights-defining-washington-right-now-00192053"
  },
  {
    "text": "The Kash Patel Principle  —  Donald Trump has been releasing names of his nominees for the Cabinet and other senior posts in waves.  He began with some relatively conventional choices, and then unloaded one bombshell after another, perhaps in an attempt to paralyze opposition in the Senate … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/kash-patel-principle/680838/?gift=_IXYI0Wrwnxuvm7JZ0fMfLyMalbJhTJ1f4imheld7FU&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Five Things to Know About Kash Patel, Trump's Pick to Lead the F.B.I.  —  President-elect Donald J. Trump has long seen his bombastic national security operative as a political “enforcer.”  But former colleagues question his fitness for the job.  —  Kash Patel, President-elect Donald J. Trump's choice … ",
    "url": "https://www.nytimes.com/2024/11/30/us/politics/kash-patel.html?unlocked_article_code=1.eE4.kmdG.P_w0bxnZZvkT&smid=url-share"
  },
  {
    "text": "Cheryl Hines sells products with naked RFK Jr. showering behind her  —  Actress Cheryl Hines, the wife of former independent presidential candidate Robert F. Kennedy Jr., posted a video promoting her beauty products featuring her husband showering half-naked in the background.",
    "url": "https://thehill.com/policy/healthcare/5016353-cheryl-hines-video-kennedy-shower/"
  },
  {
    "text": "Trump's health team: RFK Jr. and 5 doctors tapped to lead ‘MAHA’  —  President-elect Trump has finished making selections for the top public health roles in his incoming administration after he issued a flurry of nominations late Friday and tapped a leader for the National Institutes of Health (NIH) on Wednesday.",
    "url": "https://thehill.com/policy/healthcare/5012348-trump-health-care-picks/"
  },
  {
    "text": "Wisconsin Democratic Chair Says He Is the One to Revive a Distressed Party  —  Ben Wikler, who has led the Wisconsin Democratic Party since 2019, announced a bid to be national party chair with a platform to “unite, fight, win.”  —  Ben Wikler, the Wisconsin Democratic chairman … ",
    "url": "https://www.nytimes.com/2024/12/01/us/politics/ben-wikler-democratic-national-committee-wisconsin.html?unlocked_article_code=1.eE4.gNV6.LMZEyttmVIQL&smid=url-share"
  },
  {
    "text": "Social democrats gain and incumbents are punished in Iceland's election  —  Voters in Iceland appeared to have rejected incumbent parties in a parliamentary election, partial results showed Sunday, with a center-left party leading the contest in the North Atlantic island nation.",
    "url": "https://apnews.com/article/iceland-election-results-social-democrats-989773ec8a24cddef7ba78d5aa933df2"
  },
  {
    "text": "‘The first oligarch’: Russian dissident warns of ‘extremely dangerous’ development in U.S.  —  America is close to having its first real oligarch, a Russian dissident — and former world chess champion — warned in an interview Sunday.  —  Garry Kasparov, who now chairs the Renew Democracy Initiative … ",
    "url": "https://www.rawstory.com/the-2670272615/"
  },
  {
    "text": "Democrats Face an Existential Crisis on X  —  Conversations with a dozen insiders point to a party that is unsure about whether to leave or engage with the increasingly MAGA platform.  —  Two days after the election, Patrick Dillon, a longtime Democratic strategist and current Biden administration official … ",
    "url": "https://www.politico.com/news/magazine/2024/11/30/dems-leave-twitter-musk-00191755"
  },
  {
    "text": "John Bolton compares Kash Patel to Soviet secret police leader  —  Former National Security Advisor John Bolton compared Kash Patel, President-elect Trump's nomination for head of FBI, to one of the USSR's most feared secret police chiefs, Lavrentiy Beria.  —  “Trump has nominated Kash Patel … ",
    "url": "https://thehill.com/homenews/sunday-talk-shows/5016380-john-bolton-compares-kash-patel-to-soviet-secret-police-leader/"
  },
  {
    "text": "Putin signs off record Russian defense spending as top EU officials visit Kyiv  —  Russian President Vladimir Putin approved budget plans, raising 2025 military spending to record levels as Moscow seeks to prevail in the war in Ukraine.  Around 32.5% of the budget posted on a government website Sunday … ",
    "url": "https://apnews.com/article/russia-ukraine-budget-defense-spending-putin-drone-3a1a73c559b250ec26190edd9332100c"
  },
  {
    "text": "Transcript: Jill Schlesinger on “Face the Nation with Margaret Brennan,” Dec. 1, 2024  —  The following is a transcript of an interview with CBS News business analyst Jill Schlesinger on “Face the Nation with Margaret Brennan” that aired on Dec. 1, 2024.  —  MAJOR GARRETT: Welcome back to Face The Nation.",
    "url": "https://www.cbsnews.com/news/jill-schlesinger-face-the-nation-transcript-12-01-2024/"
  },
  {
    "text": "The congressional battlegrounds were set.  Then Trump changed everything.  —  “There's definitely a realignment going on in American politics,” said Dan Conston, the president of the Congressional Leadership Fund.  —  Donald Trump's surge among Latino voters is upending the American political map.",
    "url": "https://www.politico.com/news/2024/12/01/trump-latino-voters-surge-00191902"
  },
  {
    "text": "Long a ‘Crown Jewel’ of Government, N.I.H. Is Now a Target  —  The agency long benefited from broad bipartisan support.  But Republican criticism has intensified, and new choices for top health posts hope to upend the organization.  —  The National Institutes of Health … ",
    "url": "https://www.nytimes.com/2024/12/01/health/nih-trump-kennedy-bhattacharya.html"
  },
  {
    "text": "Former House Democrat lays into ‘toxic’ party, calls for ‘rebrand’ after election blowout  —  As assessments of what went wrong for Democrats in the 2024 election have poured in over the past few weeks and the party searches for its next leader, one former House member is calling for a “complete rebranding.”",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3246295/former-house-democrat-lays-into-toxic-party/"
  },
  {
    "text": "Recess appointments could put Trump at odds with conservatives on the Supreme Court  —  Republicans will control the White House and both houses of Congress come January.  But President-elect Donald Trump's intent to nominate loyalists to fill key Cabinet posts has set up a possible confrontation … ",
    "url": "https://apnews.com/article/supreme-court-trump-recess-appointments-senate-constitution-55004d00cfa7d4b4832e9701cad48a06"
  },
  {
    "text": "Misogyny and Antisemitism Are a Toxic Brew  —  “Zio bitch!” a young man in a kaffiyeh and Black Lives Matter T-shirt barked at one of us, his ire apparently provoked by a yellow ribbon pin, a symbol of the Israeli hostages held by Hamas.  The exchange was unsettling but not surprising.",
    "url": "https://www.nytimes.com/2024/12/01/opinion/jewish-women-misogyny-antisemitism.html"
  },
  {
    "text": "Trump and His Team Are ‘Laughing’ at Biden's Commitment to Decorum  —  Biden called Trump a fascist.  Now his White House is ensuring an orderly transfer of power — and staging photo ops with the president-elect  —  Donald Trump and his incoming administration officials think Joe Biden and Kamala Harris are suckers.",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-biden-harris-transfer-power-laughing-1235188028/"
  },
  {
    "text": "Trump is now threatening 100% tariffs on the BRICS group — which comprises 9 emerging market countries  — Trump on Saturday floated “100% tariffs” on the BRICS group of emerging markets.  — Trump is pushing back on efforts to dethrone the US dollar as the primary global reserve currency.",
    "url": "https://www.businessinsider.com/trump-tariffs-brics-nations-trade-war-us-dollar-2024-11"
  },
  {
    "text": "Charles Kushner, pardoned in 2020, to be nominated ambassador to France  —  The New Jersey real estate developer, political donor and philanthropist is also the father of Trump's son-in-law Jared Kushner.  —  President-elect Donald Trump said on Saturday he would nominate Charles Kushner … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/30/donald-trump-charles-kushner/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMyOTQyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0MzI1MTk5LCJpYXQiOjE3MzI5NDI4MDAsImp0aSI6IjRhNjY2YzdmLTc1NjctNGRmOC05OGU3LTBiMTQzNzM4NzYxYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzMwL2RvbmFsZC10cnVtcC1jaGFybGVzLWt1c2huZXIvIn0.VpAR1B9yDLB2ag9SQAJ49Lg7SpMKg5K6WdBsqI0NlJk&itid=gfta"
  }
]