[
  {
    "text": "Trump tries to boost support for Truth Social as DJT stock tanks … Donald Trump on Friday urged his followers to support his social media app Truth Social, as its parent company's stock continues to sink lower.  —  Trump in a post on that app said he believes Truth Social embodies the political … ",
    "url": "https://www.cnbc.com/2024/04/12/trump-tries-to-boost-support-for-truth-social-as-his-media-stock-tanks.html"
  },
  {
    "text": "Marjorie Taylor Greene won't say what happened to her Trump Media stock … US Representative Marjorie Taylor Greene (R) speaks alongside former US President and 2024 presidential hopeful Donald Trump at a campaign event in Rome, Georgia, on March 9, 2024.  —  A media company with ties … ",
    "url": "https://www.cnbc.com/2024/04/12/marjorie-taylor-greene-wont-say-what-happened-to-her-trump-media-stock-.html"
  },
  {
    "text": "House Republicans fume over “messaging” votes … - Rep. Troy Nehls (R-Texas) said he is moving his “focus to the presidential election.”  — “I think it's fair to say we've been frustrated for the past several months,” Nehls said.  — “This place is dysfunctional, unfortunately,” he added.",
    "url": "https://www.axios.com/2024/04/12/house-republicans-anger-messaging-votes"
  },
  {
    "text": "Judge declines to delay Trump's NY hush money trial over complaints of pretrial publicity  —  Trump the defendant and 2024 presidential candidate aims to campaign at New York hush money trial  —  The judge in Donald Trump's hush money criminal case on Friday turned down the former president's request … ",
    "url": "https://apnews.com/article/trump-hush-money-trial-4c79619c5e89e13d672e070a4244a302"
  },
  {
    "text": "Russia Is Buying Politicians in Europe.  Is It Happening Here Too?  —  Democrats for years have warned about Russian influence in the Republican Party under Donald Trump.  But now even some prominent GOP members of Congress are sounding the alarm.  —  “I think Russian propaganda … ",
    "url": "https://newrepublic.com/article/180630/russia-corruption-network-europe-buying-politicians-america"
  },
  {
    "text": "Belgium investigating Russian influence network suspected of paying EU lawmakers  —  The Belgian federal prosecutor has opened an investigation into EU lawmakers accused of receiving payments for spreading pro-Russian propaganda.  —  Prime Minister Alexander De Croo told reporters on Friday … ",
    "url": "https://www.euronews.com/my-europe/2024/04/12/belgium-investigating-russian-influence-network-suspected-of-paying-eu-lawmakers"
  },
  {
    "text": "Iranian Attack Expected on Israel in Next Two Days  —  Israel is preparing for an imminent direct attack from Iran; Tehran yet to decide, says person briefed on the matter  —  TEL AVIV—Israel is preparing for a direct attack from Iran on southern or northern Israel as soon as Friday or Saturday … ",
    "url": "https://www.wsj.com/world/middle-east/iranian-attack-expected-on-israel-in-next-two-days-42b0537c"
  },
  {
    "text": "Judge rejects Hunter Biden's bid to dismiss the federal gun charges against him  —  The judge denied all of Biden's attempts to have the case thrown out.  —  The federal judge overseeing a case involving gun charges against Hunter Biden rejected efforts by the president's son to have the case dismissed.",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-rejects-hunter-bidens-bid-dismiss-federal-gun-charges-rcna147675"
  },
  {
    "text": "House finally passes surveillance bill after three stumbles  —  Friday's passage came only after Speaker Mike Johnson and GOP leaders shortened the length of the program's extension amid resistance from former President Donald Trump.",
    "url": "https://www.politico.com/live-updates/2024/04/12/congress/government-surveillance-702-house-gop-pass-fisa-johnson-00151946"
  },
  {
    "text": "Exclusive: Google Contract Shows Deal With Israel Defense Ministry  —  Google provides cloud computing services to the Israeli Ministry of Defense, and the tech giant has negotiated deepening its partnership during Israel's war in Gaza, a company document viewed by TIME shows.",
    "url": "https://time.com/6966102/google-contract-israel-defense-ministry-gaza-war/"
  },
  {
    "text": "‘The Golden Bachelor’ Divorce Has Killed My Belief in Love  —  Did Gerry Turner and Theresa Nist just dismantle the whole point “The Golden Bachelor” tried to prove?  —  Like the rest of groggily caffeinating America, this morning I woke up to the wild news that Gerry Turner and Theresa Nist … ",
    "url": "https://www.thedailybeast.com/obsessed/the-golden-bachelor-divorce-has-killed-my-belief-in-love"
  },
  {
    "text": "Florida blocks heat protections for workers right before summer  —  Florida Governor Ron DeStantis has signed a law that prevents cities or counties from creating protections for workers who labor in the state's often extreme and dangerous heat.  —  Two million people in Florida … ",
    "url": "https://www.npr.org/2024/04/12/1244316874/florida-blocks-heat-protections-for-workers-right-before-summer"
  },
  {
    "text": "Biden administration cancels another $7.4 billion in student loans  —  The president is wiping away the loan balances of 277,000 Americans through a mix of existing forgiveness programs  —  Days after heralding its latest student debt forgiveness plan, the Biden administration … ",
    "url": "https://www.washingtonpost.com/education/2024/04/12/biden-student-loan-forgiveness-update-save-pslf/"
  },
  {
    "text": "No, “convenience” isn't the problem (permalink)  —  Using Amazon, or Twitter, or Facebook, or Google, or Doordash, or Uber doesn't make you lazy.  Platform capitalism isn't enshittifying because you made the wrong shopping choices.  —  Remember, the reason these corporations were able … ",
    "url": "https://pluralistic.net/2024/04/12/give-me-convenience/#or-give-me-death"
  },
  {
    "text": "Pence's second act: Former VP will teach about Christianity in public institutions at Pennsylvania college  —  Former Vice President Mike Pence has found his first official job since dropping out of the 2024 Republican presidential primaries, and will be teaching at a private college in Pennsylvania.",
    "url": "https://www.washingtonexaminer.com/policy/education/2964757/pences-second-act-former-vp-will-teach-about-christianity-in-public-institutions-at-pennsylvania-college/"
  },
  {
    "text": "The New Great-Power Politics  —  How an emerging alliance is shaping the world.  —  The Houthis, the Iran-backed militia that controls much of Yemen, have disrupted the global economy by firing on commercial ships traveling through the Red Sea.  But the Houthis have made some exceptions … ",
    "url": "https://www.nytimes.com/2024/04/12/briefing/the-new-great-power-politics.html"
  },
  {
    "text": "Trump Bond's Cayman Connection ‘Stinks to High Heaven’  —  ISLAND TIME  —  The company that saved Donald Trump with a $175 million bank fraud bond is playing an insurance game that has experts questioning whether New York will ever see the money. … When the questionably leveraged company … ",
    "url": "https://www.thedailybeast.com/trump-bonds-cayman-connection-stinks-to-high-heaven"
  },
  {
    "text": "Trump tells Arizona Legislature to act after GOP blocks bills to repeal 1864 abortion ban  —  Former President Trump on Friday urged Arizona lawmakers to act “as fast as possible” to adjust the state's abortion policy after a state Supreme Court ruling upheld an 1864 law and made performing the procedure a felony.",
    "url": "https://thehill.com/homenews/campaign/4590617-trump-tells-arizona-legislature-to-act-after-gop-blocks-bills-repeal-1864-abortion-ban/"
  },
  {
    "text": "If Trump wins, he plans to free Wall Street from ‘burdensome regulations’  —  A second Trump White House would seek to sharply reduce the power of U.S. financial regulators, according to a review of public documents and interviews with people allied with the former president.",
    "url": "https://www.reuters.com/markets/us/if-trump-wins-he-plans-free-wall-street-burdensome-regulations-2024-04-12/"
  },
  {
    "text": "Trump's Abortion Gambit Proves He's Bad at Politics  —  It's been pathetic over these recent years to watch people impute certain skills to Donald Trump.  Oh, he's very smart politically.  He's charismatic.  It's all nonsense.  It's political commentators trying to assess him in normal political terms … ",
    "url": "https://newrepublic.com/post/180665/donald-trump-worst-possible-abortion-position"
  },
  {
    "text": "Why the California Journalism Preservation Act is putting support of the news ecosystem at risk  —  A pending bill in the California state legislature, the California Journalism Preservation Act (CJPA), would create a “link tax” that would require Google to pay for simply connecting Californians to news articles.",
    "url": "https://blog.google/products/news/california-journalism-preservation-act-puts-news-ecosystem-at-risk/"
  }
]