[
  {
    "text": "Lock Him Up?  A New Poll Has Some Bad News for Trump  —  A new POLITICO Magazine/Ipsos poll punctures some prevailing political narratives about the Trump indictments.  —  To hear Donald Trump tell it, the fact that he keeps getting indicted by prosecutors is a boon to his reelection effort.",
    "url": "https://www.politico.com/news/magazine/2023/08/25/ipsos-poll-trump-indictment-00112755"
  },
  {
    "text": "The Georgia election case against Donald Trump and 18 others is about to get ugly.  Here's why.  —  For former President Donald Trump, Rudy Giuliani and their 17 other co-defendants, the threat of jail time is getting very real for those charged, arrested and booked in the Georgia election fraud case.",
    "url": "https://www.usatoday.com/story/news/politics/2023/08/25/trumps-georgia-election-case-could-get-ugly-as-others-seek-to-avoid-jail/70662386007/"
  },
  {
    "text": "Sarah Palin Says Civil War Is ‘Going to Happen’ After Trump's Arrest  —  ‘RISE UP’  —  Sarah Palin responded to Donald Trump's arrest in Georgia on Thursday night by talking up the possibility of civil war.  Speaking to Eric Bolling as the former president was booked at the Fulton County Jail … ",
    "url": "https://www.thedailybeast.com/sarah-palin-says-civil-war-is-going-to-happen-after-trumps-arrest"
  },
  {
    "text": "Parsing Trump's post-surrender comments in Georgia  —  Donald Trump's visit to Georgia on Thursday was brief.  He flew in to Atlanta, drove to the Fulton County Jail, surrendered to authorities, was processed on criminal charges and then released.  Back into the SUV and back to the airport … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/25/trump-georgia-speech/"
  },
  {
    "text": "Arizona Prosecutors Are Probing Rudy Giuliani's Role as Fake-Elector Kingpin  —  State investigators have also started gathering information on Trump's personal involvement in the plot, knowledgeable sources tell Rolling Stone  —  PROSECUTORS IN ARIZONA are “aggressively” … ",
    "url": "https://www.rollingstone.com/politics/politics-features/rudy-giuliani-arizona-proseuctors-fake-elector-scheme-1234812075/"
  },
  {
    "text": "The Mugshot  —  This presidential portrait was inevitable, wasn't it?  —  Think for a moment what it took to bring us to this point: the twisted, bizarre, tangled story, with so many chapters, and legions of enablers, rationalizers, clowns, cowards, and co-conspirators.",
    "url": "https://morningshots.thebulwark.com/p/the-mugshot"
  },
  {
    "text": "Donald Trump Sold Mar-a-Lago Before Arrest, Listing Claims  —  A Zillow listing claimed to have shown that Donald Trump has sold his signature Mar-a-Lago luxury residence in Florida.  The listing claimed the resort was purchased on August 4—weeks before the former president voluntarily turned himself … ",
    "url": "https://www.newsweek.com/donald-trump-mar-lago-sold-arrest-listing-1822370"
  },
  {
    "text": "GOP picks Houston for Republican National Convention in 2028  —  The decision comes a full year before the GOP holds its 2024 nominating event.  —  The Republican Party will host its 2028 convention in Houston, party officials decided in a private meeting on Friday.",
    "url": "https://www.politico.com/news/2023/08/25/gop-houston-republican-national-convention-2028-00113008"
  },
  {
    "text": "How one Republican nearly blew a lead bigger than Trump's — and what it means for 2024  —  Bob Dole's 1996 near-collapse in Iowa after racking up a huge polling lead offers some hope for Trump challengers, but the underlying numbers show key differences.  —  For Republicans hoping to avoid … ",
    "url": "https://www.nbcnews.com/politics/2024-election/one-republican-nearly-blew-lead-bigger-trumps-means-2024-rcna101733"
  },
  {
    "text": "Trumpworld Isn't Turning on Vivek Ramaswamy—Yet  —  The first GOP debate launched Ramaswamy to the front of the field challenging Trump—putting his ambitious campaign under the MAGA microscope. … Vivek Ramaswamy may have opened the first Republican presidential debate by ripping … ",
    "url": "https://www.thedailybeast.com/trumpworld-isnt-turning-on-vivek-ramaswamyyet"
  },
  {
    "text": "County of Maui releases validated list of names of individuals who remain unaccounted for following  —  8/24/2023 — County of Maui releases validated list of names of individuals who remain unaccounted for following Lahaina wildfire disaster  —  The County of Maui on Thursday released … ",
    "url": "https://www.mauicounty.gov/CivicAlerts.aspx?AID=12763"
  },
  {
    "text": "Split ballot board approves reproductive rights amendment summary written by Ohio Sec. of State  —  COLUMBUS, Ohio — AUGUST 24: Ohio Ballot Board Chair, Secretary of State Frank LaRose at the Ballot Board meeting to certify the language for Issue 1, the proposed constitutional amendment entitled … ",
    "url": "https://ohiocapitaljournal.com/2023/08/24/split-ballot-board-approves-reproductive-rights-amendment-summary-written-by-ohio-sec-of-state/"
  },
  {
    "text": "Newly declassified US intel claims Russia is laundering propaganda through unwitting Westerners  —  Russian intelligence is operating a systematic program to launder pro-Kremlin propaganda through private relationships between Russian operatives and unwitting US and western targets, according to newly declassified US intelligence.",
    "url": "https://www.cnn.com/2023/08/25/politics/us-intel-russia-propaganda/"
  },
  {
    "text": "Following Elon Musk's lead, Big Tech is surrendering to disinformation  —  Facebook and YouTube are receding from their role as watchdogs against conspiracy theories ahead of the 2024 presidential election  —  Social media companies are receding from their role as watchdogs against political misinformation … ",
    "url": "https://www.washingtonpost.com/technology/2023/08/25/political-conspiracies-facebook-youtube-elon-musk/"
  },
  {
    "text": "'He's an insider': Ramaswamy's deep ties to rightwing kingpins revealed  —  Republican candidate brands himself as an ‘outsider’ but has close links to prominent figures Leonard Leo and Peter Thiel  —  Vivek Ramaswamy has described himself as an “outsider”, accusing rivals … ",
    "url": "https://www.theguardian.com/us-news/2023/aug/25/vivek-ramaswamy-rightwing-elite-close-ties-leonard-leo-peter-thiel"
  },
  {
    "text": "Endicott man sentenced to federal prison for telephone threats to Marjorie Taylor Greene  —  A Broome County man will spend three months in federal prison for threatening a member of the U.S. Congress last year.  —  Joseph F. Morelli, 51, of Endicott was also sentenced to three years … ",
    "url": "https://www.pressconnects.com/story/news/local/2023/08/25/endicott-man-sentenced-to-prison-for-threats-against-congresswoman/70677121007/"
  }
]