[
  {
    "text": "Trump recorded pressuring Wayne County canvassers not to certify 2020 vote  —  Then-President Donald Trump personally pressured two Republican members of the Wayne County Board of Canvassers not to sign the certification of the 2020 presidential election, according to recordings reviewed … ",
    "url": "https://www.detroitnews.com/story/news/politics/2023/12/21/donald-trump-recorded-pressuring-wayne-canvassers-not-to-certify-2020-vote-michigan/72004514007/"
  },
  {
    "text": "Georgia officials ask FBI to investigate emails from pro-Trump election skeptic  —  Georgia officials have asked the FBI to investigate a series of emails a Texas activist sent members of the State Election Board demanding an investigation into Georgia's 2020 election, according to three people familiar with the situation.",
    "url": "https://www.ajc.com/politics/georgia-officials-ask-fbi-to-investigate-emails-from-pro-trump-election-skeptic/UPYEMVQ4D5DZNJL4WAQYABNP7Q/"
  },
  {
    "text": "Trump allegedly pressured Michigan election workers not to certify 2020 vote: Report  —  Details have emerged from a previously unknown phone call.  —  Former President Donald Trump speaks at a campaign rally, Dec. 16, 2023, in Durham, N.H.  —  A Michigan newspaper is reporting … ",
    "url": "https://abcnews.go.com/Politics/trump-allegedly-pressured-michigan-election-workers-certify-2020/story?id=105868133"
  },
  {
    "text": "A Proclamation on Granting Pardon for the Offense of Simple Possession of Marijuana, Attempted Simple Possession of Marijuana, or Use of Marijuana  —       In Proclamation 10467 of October 6, 2022 (Granting Pardon for the Offense of Simple Possession of Marijuana), I exercised my authority under … ",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2023/12/22/a-proclamation-on-granting-pardon-for-the-offense-of-simple-possession-of-marijuana-attempted-simple-possession-of-marijuana-or-use-of-marijuana/"
  },
  {
    "text": "Police have recovered second Ziegler sex video, sources say  —  A  sex video involving Sarasota School Board member Bridget Ziegler and an unidentified woman has been recovered by police as part of the ongoing criminal investigation of a rape allegation made against Bridget's husband … ",
    "url": "https://flcga.org/police-have-recovered-second-ziegler-sex-video-sources-say/"
  },
  {
    "text": "New COVID variant JN.1 surges to 44% of cases, CDC estimates — even higher in New York, New Jersey  —  The new COVID-19 variant that scientists call JN.1 now makes up about 44.1% of COVID-19 cases across the country, the Centers for Disease Control and Prevention estimated Friday … ",
    "url": "https://www.cbsnews.com/news/new-covid-variant-jn-1-cases-cdc-new-york-new-jersey/"
  },
  {
    "text": "New Hampshire Man Indicted for Threatening to Kill Three Presidential Candidates  —  For Immediate Release  —  A New Hampshire man has been indicted in connection with sending threatening text messages to three presidential candidates.  —  Tyler Anderson, 30, of Dover … ",
    "url": "https://www.justice.gov/opa/pr/new-hampshire-man-indicted-threatening-kill-three-presidential-candidates"
  },
  {
    "text": "Raunchy celebrity party in Russia draws outrage over ‘nude illusion’ theme  —  RIGA, Latvia — A raunchy celebrity-filled party in Moscow has drawn the ire of Russian politicians and fervent Christian Orthodox activists who are urging law enforcement to punish the event's guests and organizers … ",
    "url": "https://www.washingtonpost.com/world/2023/12/21/russia-celebrity-party-nude-putin/"
  },
  {
    "text": "California town proposes ban on Pride, Black and women's history celebrations  —  Far-right council members in Huntington Beach introduce agenda item to switch focus to US wars and America's independence  —  The southern California city of Huntington Beach, a bastion of conservative voters … ",
    "url": "https://www.theguardian.com/us-news/2023/dec/22/california-huntington-beach-ban-diverse-celebrations"
  },
  {
    "text": "Democrats sue New Hampshire over GOP-backed election law  —  President Joe Biden's campaign is supporting the legal challenge, which was first shared with POLITICO.  —  The Democratic National Committee is suing New Hampshire officials over a Republican-backed election law that it claims … ",
    "url": "https://www.politico.com/news/2023/12/22/democrats-sue-new-hampshire-over-gop-backed-election-law-00133018"
  },
  {
    "text": "Jan. 6 rioters the far right claimed were antifa keep getting unmasked as Trump supporters  —  Misinformation about the Capitol attack continues to go viral on the right, but the claims are slowly getting debunked, federal case by federal case.  —  WASHINGTON — In nearly three years since … ",
    "url": "https://www.nbcnews.com/politics/justice-department/antifa-january-6-capitol-riot-conspiracy-theory-social-media-rcna125369"
  },
  {
    "text": "Biden Ends 2023 With 39% Job Approval  —  WASHINGTON, D.C. — President Joe Biden's job approval rating is 39%, marking a slight improvement from the 37% low points in October and November but the fifth time his rating is below 40% in 2023.  —  ###Embeddable###",
    "url": "https://news.gallup.com/poll/547763/biden-ends-2023-job-approval.aspx"
  },
  {
    "text": "Disqualifying Trump may be legally sound but fraught for democracy, scholars say  —  Experts say there's a strong basis for the Colorado Supreme Court's decision to bar Trump from the ballot, but the larger political context makes the question one of the thorniest in recent memory",
    "url": "https://www.washingtonpost.com/politics/2023/12/21/trump-disqualified-14th-amendment-democracy/"
  },
  {
    "text": "U.S.-Mexico border closures could cost billions … - Republicans say the Biden administration needs to do more to address the issue, and former President Trump says he is “closing the border” as one of his first acts if he returns to office. … - After railway operations in Eagle Pass and El Paso … ",
    "url": "https://www.axios.com/2023/12/22/us-mexico-border-closures-could-cost-billions"
  },
  {
    "text": "A Forgotten Chapter of Abortion History Repeats Itself  —  Much of the country no doubt watched in amazement last week as a woman with a doomed pregnancy was forced to flee her home state, Texas, to get the abortion her doctors deemed necessary to protect her future ability to bear children.",
    "url": "https://www.nytimes.com/2023/12/22/opinion/history-texas-abortion.html"
  },
  {
    "text": "Biden kept at distance from McConnell on border deal talks  —  President Biden has kept a distance from Senate negotiations on a border deal critical to securing congressional aid to Ukraine, even as GOP lawmakers repeatedly called for him to enter the talks.",
    "url": "https://thehill.com/homenews/senate/4372546-biden-kept-at-a-distance-from-mcconnell-on-border-deal-talks/"
  },
  {
    "text": "Clemency Recipient List  —  Today, President Joseph R. Biden Jr. is using his authority under the Constitution to uphold the values of redemption and rehabilitation by commuting the sentences of 11 fellow Americans who are serving unduly long sentences for non-violent drug offenses.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/22/clemency-recipient-list-5/"
  },
  {
    "text": "Hunter Biden Text Cited in Impeachment Inquiry Is Not What G.O.P. Suggests  —  A 2019 message from the president's son alluded to giving his father half his salary.  The back story offers unflattering insights into the Biden family but does not support assertions of corruption.",
    "url": "https://www.nytimes.com/2023/12/22/us/politics/hunter-biden-texts-impeachment-republicans.html"
  },
  {
    "text": "Crisis communicators face blowback after disastrous college hearing  —  Who got paid to give advice on one of the most disastrous public relations moments in modern memory?  —  The appearance of three elite university presidents on Capitol Hill this month to testify about campus antisemitism … ",
    "url": "https://www.politico.com/news/2023/12/22/college-presidents-debacle-over-antisemitism-hearing-meets-pr-blame-game-00132994"
  },
  {
    "text": "How DeSantis's Ambitious, Costly Ground Game Has Sputtered  —  The Florida governor's field operation, one of the most expensive in modern political history, has met challenges from the outset, interviews with a range of voters and political officials revealed.",
    "url": "https://www.nytimes.com/2023/12/22/us/politics/desantis-iowa-pac-ground-game.html"
  },
  {
    "text": "Substack says it will not remove or demonetize Nazi content … More than 200 Substack authors asked the platform to explain why it's “platforming and monetizing Nazis,” and now they have an answer straight from co-founder Hamish McKenzie: … While McKenzie offers no evidence to back these ideas … ",
    "url": "https://www.theverge.com/2023/12/21/24011232/substack-nazi-moderation-demonetization-hamish-mckenzie"
  }
]