[
  {
    "text": "The GOP's legal challenges to Harris's candidacy are bunk  —  They're also amazingly hypocritical. … While Democrats wasted no time this week rallying around Kamala Harris, Republicans were just as quick to start trying to sabotage her campaign with lawfare.  —  It isn't surprising that the GOP is taking this approach.",
    "url": "https://www.publicnotice.co/p/trump-legal-challenges-harris-candidacy-bunk"
  },
  {
    "text": "Harris Narrows Gap Against Trump, Times/Siena Poll Finds  —  In a survey taken after President Biden stepped aside, Donald Trump and Kamala Harris are locked in a tight race separated by a single percentage point among likely voters.  —  Vice President Kamala Harris begins a 103-day sprint … ",
    "url": "https://www.nytimes.com/2024/07/25/us/politics/poll-kamala-harris-donald-trump.html"
  },
  {
    "text": "Exclusive poll: Harris opens up early edge with young voters  —  Vice President Kamala Harris is significantly more popular among America's youngest voters than President Biden, a new Axios/Generation Lab poll shows. … But Harris could be extending the gap once again.",
    "url": "https://www.axios.com/2024/07/25/poll-harris-biden-trump-young-voters"
  },
  {
    "text": "Republicans see Gov. Josh Shapiro as Harris' ‘super strong’ VP contender  —  But a few of the reasons Republicans consider the Pennsylvania governor a potential boost to Vice President Kamala Harris' campaign may cause heartburn among some Democrats.  —  PITTSBURGH — Republicans increasingly … ",
    "url": "https://www.nbcnews.com/politics/2024-election/republicans-see-gov-josh-shapiro-harris-super-strong-vp-contender-rcna163322"
  },
  {
    "text": "July 2024 Swing State Polls: Harris Trails Trump in Arizona, Georgia, Michigan, Pennsylvania, Tied in Wisconsin  —  Home Polls July 2024 Swing State Polls: Harris Trails Trump in Arizona, Georgia, Michigan, Pennsylvania, Tied in Wisconsin  —  Majority of Democrats in Swing States Say Harris Should be Nominated at DNC",
    "url": "https://emersoncollegepolling.com/july-2024-swing-state-polls-harris-trails-trump-in-arizona-georgia-michigan-pennsylvania-tied-in-wisconsin/"
  },
  {
    "text": "Some Republicans express buyer's remorse over Vance VP pick … - Vance's nomination at the GOP convention came at the peak of the party's confidence about the 2024 election, which polls suggested was shaping up to be a potential landslide.  — But less than a week later … ",
    "url": "https://www.axios.com/2024/07/25/jd-vance-kamala-harris-trump-election"
  },
  {
    "text": "‘Trump Is Old And Quite Weird’: Kamala Harris Camp Hits Back At ‘78-Year-Old Criminal’ Trump's Fox News Interview  —  Harris for President tore into former President Donald Trump over a Fox News interview in which he referred to Vice President Kamala Harris as “garbage” among other things.",
    "url": "https://www.mediaite.com/news/kamala-harris-campaign-takes-aim-at-trumps-age-in-response-to-fox-news-interview-78-year-old-criminal/"
  },
  {
    "text": "Harris campaign hits Trump over Fox News interview: 'This guy shouldn't be president ever again'  —  Vice President Harris's campaign hit at former President Trump's interview on Fox News on Thursday, questioning his age and mental stamina.  —  The campaign released a “Statement … ",
    "url": "https://thehill.com/homenews/campaign/4792471-kamala-harris-campaign-trump-fox-news-president/"
  },
  {
    "text": "A Good Speech and a Sad Spectacle  —  This morning's good vibe, per WaPo: “The U.S. economy grew at a robust 2.8 percent annualized rate in the second quarter, capping two years of solid expansion, despite some signs of softening.”  —  And this morning's terrible vibe, also per WaPo … ",
    "url": "https://www.thebulwark.com/p/a-good-speech-and-a-sad-spectacle"
  },
  {
    "text": "‘I Approve This Message’: Kamala Harris Instantly Uses Trump's Own Words Against Him  —  That didn't take long.  —  LOADING  —  Donald Trump's own words on Wednesday were quickly turned back at him in a new video from Vice President Kamala Harris's rapid response team.",
    "url": "https://www.huffpost.com/entry/donald-trump-kamala-harris-ad_n_66a1f26fe4b070e6bd5298e2"
  },
  {
    "text": "Obama plans to endorse Harris for president soon  —  The former president has had multiple conversations with Vice President Kamala Harris about her campaign this week.  —  WASHINGTON — Former President Barack Obama and Vice President Kamala Harris have been in close touch since she announced … ",
    "url": "https://www.nbcnews.com/politics/2024-election/obama-plans-endorse-harris-president-soon-rcna163279"
  },
  {
    "text": "J.D. Vance Endorsed Book That Calls Progressives “Unhumans” and Praises Jan. 6 Rioters  —  The GOP veep candidate embraced the extreme view that today's left is part of a centuries-long effort to “destroy” civilization.  —  During his acceptance speech at the Republican convention last week … ",
    "url": "https://www.motherjones.com/politics/2024/07/jd-vance-unhumans-book-jack-posobiec-alt-right-january-6/"
  },
  {
    "text": "Beware the Mump  —  Speaking in Charlotte, North Carolina, yesterday, at his first campaign rally since President Biden dropped out of the race and Kamala Harris became the presumptive Democratic candidate, Trump deployed his usual barrage of lies and smears.",
    "url": "https://robertreich.substack.com/p/beware-the-mump-0ee"
  },
  {
    "text": "Melania Trump to tell her story in memoir, ‘Melania,’ scheduled for this fall  —  Former first lady Melania Trump has a memoir coming out this fall, “Melania,” billed by her office as “a powerful and inspiring story of a woman who has carved her own path, overcome adversity and defined personal excellence.”",
    "url": "https://apnews.com/article/melania-trump-memoir-first-lady-0461dbb098a2218d41fbe7960c05a1a5"
  },
  {
    "text": "Half-dozen Dems join GOP in condemning Harris' work on the border  —  House Republicans used their slim majority on Thursday to target Vice President Kamala Harris — and some Democrats backed the effort.  The House passed a resolution criticizing Harris for her work on the border in a 220-196 vote … ",
    "url": "https://www.politico.com/live-updates/2024/07/25/congress/house-condemns-harris-on-border-00171124"
  },
  {
    "text": "Newsom Orders California Officials to Remove Homeless Encampments  —  The directive from Gov. Gavin Newsom is the nation's most sweeping response to a Supreme Court decision last month that gave local leaders greater authority to remove homeless campers.  —  Gov. Gavin Newsom ordered … ",
    "url": "https://www.nytimes.com/2024/07/25/us/newsom-homeless-california.html?unlocked_article_code=1.900.Nmzh.O0WaaYpN9Npy&smid=url-share"
  },
  {
    "text": "July 24, 2024  —  Tonight, President Joe Biden explained to the American people why he decided to refuse the 2024 Democratic presidential nomination and hand the torch to Vice President Kamala Harris.  —  Speaking from the Oval Office from his seat behind the Resolute Desk … ",
    "url": "https://heathercoxrichardson.substack.com/p/july-24-2024"
  },
  {
    "text": "Kamala Harris condemns pro-Hamas protesters who burned American flag in D.C.  —  Washington — Vice President Kamala Harris condemned demonstrators who voiced support for Hamas and burned an American flag near the U.S. Capitol to protest Israeli Prime Minister Benjamin Netanyahu's address … ",
    "url": "https://www.cbsnews.com/news/kamala-harris-american-flag-burning-union-station-dc-hamas-israel/"
  },
  {
    "text": "FBI Is Not Fully Convinced Trump Was Struck by a Bullet  —  LINGERING QUESTIONS  —  “There is some question about whether or not it was a bullet or shrapnel that hit his ear,” FBI Director Christopher Wray said Wednesday.  —  FBI Director Christopher Wray revealed during a marathon testimony … ",
    "url": "https://www.thedailybeast.com/fbi-is-not-fully-convinced-trump-was-struck-by-a-bullet"
  }
]