[
  {
    "text": "Hawaii governor says Biden could decide within days whether to remain in the presidential race  —  U.S. President Joe Biden could make a decision within days whether to remain a candidate for reelection, said Hawaii's governor who participated in a recent meeting with Biden and other Democratic governors … ",
    "url": "https://apnews.com/article/biden-hawaii-governor-election-decision-6da41f7987622fd838858a6535e9ad34"
  },
  {
    "text": "At Essence, Black Democrats rally behind Biden and talk up Kamala Harris, but she avoids the drama  —  NEW ORLEANS (AP) — As President Joe Biden tries to revive his embattled reelection bid, Vice President Kamala Harris led a parade of Black Democrats who warned Saturday that the threat … ",
    "url": "https://apnews.com/article/joe-biden-drop-out-kamala-harris-replacement-2ab8780866fb2c8a0fe6e1e28a7e6de2"
  },
  {
    "text": "Biden's team drafted the questions for his first post-debate interviews … - WURD is the only African-American owned and operated talk radio station in Pennsylvania, but the White House's director of Black media was not part of the process.  — It is the latest instance of the White House continuing … ",
    "url": "https://www.axios.com/2024/07/06/biden-interview-draft-questions-wurd"
  },
  {
    "text": "As Biden Digs In, More Supporters Look to Push Him Out  —  Interviews with dozens of Democrats illustrated an imminent clash between a defiant president and those who question his ability to win.  Many rank-and-file party officials remain supportive.  —  Numerous officials … ",
    "url": "https://www.nytimes.com/2024/07/06/us/politics/biden-campaign-democrats.html"
  },
  {
    "text": "The lingering focus on Biden's shaky debate obscures Trump's major verbal miscues  —  President Joe Biden dug himself a hole and now he is trying to climb out.  But many fellow Democrats and some in the media keep shoveling dirt on him.One 20-minute TV interview was never going to swing … ",
    "url": "https://www.inquirer.com/opinion/editorials/trump-verbal-miscues-presidential-debate-20240706.html"
  },
  {
    "text": "Secret Meetings, Private Threats and a Massive Arms Race: How the World is Preparing for Trump  —  In 2016, no one in the world was ready for President Trump.  America's NATO allies aren't making the same mistake this time.  —  In Brussels, NATO officials have devised a plan to lock … ",
    "url": "https://www.politico.com/news/2024/07/07/nato-prepare-trump-2024-00165522"
  },
  {
    "text": "American allies fear Biden is finished and can't beat Trump  —  “We're not sure that, even if he wins, he can survive four years more,” said one official from a European NATO country.  —  Diplomats and world leaders preparing for next week's NATO summit are privately expressing acute concern … ",
    "url": "https://www.politico.com/news/2024/07/06/american-allies-fear-biden-trump-00166700"
  },
  {
    "text": "Mike Lee spreads fake claim of Biden medical emergency on Air Force One  —  Utah Senator then attacked media for being untrustworthy, during frenzied posting on social media  —  On Friday evening, Utah Sen. Mike Lee used his personal X/Twitter account to amplify a baseless claim … ",
    "url": "https://www.sltrib.com/news/politics/2024/07/06/mike-lee-spreads-fake-claim-biden/"
  },
  {
    "text": "FACT FOCUS: Online reports falsely claim Biden suffered a ‘medical emergency’ on Air Force One  —  False reports that President Joe Biden had a “medical emergency” while traveling back to Delaware on Friday after a campaign stop in Wisconsin, spread widely on social media on Friday.  They were without merit.",
    "url": "https://www.seattletimes.com/nation-world/fact-focus-online-reports-falsely-claim-biden-suffered-a-medical-emergency-on-air-force-one/"
  },
  {
    "text": "Former Trump Advisor Stephen Miller Denies Involvement With Project 2025, Ad Says Otherwise  —  WE GOT THE RECEIPTS  —  Former Trump advisor Stephen Miller claimed he has “never been involved with Project 2025” in a post on X on Saturday, however, a video on the Project 2025 YouTube channel says otherwise.",
    "url": "https://www.thedailybeast.com/former-trump-advisor-stephen-miller-squirms-to-deny-involvement-with-project-2025-ad-says-otherwise"
  },
  {
    "text": "'It's Shakespearean': Long-simmering tensions between Biden's family and aides spill out  —  Biden has taken full responsibility for his debate performance, saying in an interview on Friday it was “nobody's fault but mine.”  —  President Joe Biden's family is attempting to become more involved … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/tensions-biden-family-aides-spill-rcna160468"
  },
  {
    "text": "America may soon be subjected to the country's first DEI president: Kamala Harris  —  There is a raging debate in corporate America on the future of DEI, aka Diversity Equity and Inclusion, because it is literally destroying businesses that go there.  —  And yet the American public may soon … ",
    "url": "https://nypost.com/2024/07/06/business/america-may-soon-be-subjected-to-the-countrys-first-dei-president-kamala-harris/"
  },
  {
    "text": "McCarthy's Revenge Tour Rolls On, With Mixed Results … Kevin McCarthy, the former House speaker, held his leadership role for 269 days.T.J. Kirkpatrick for The New York Times  —  During the awkward interlude after he was ousted from the speakership but before he resigned from Congress … ",
    "url": "https://www.nytimes.com/2024/07/07/us/politics/kevin-mccarthy-revenge-tour.html"
  },
  {
    "text": "Trump wins delay in classified documents case … - It's an opinion that Trump has used to throw a wrench in prosecutors' plans although the SCOTUS decision on July 1 failed to clarify whether his alleged conduct on Jan. 6 was protected. … - Trump's attorneys have also used presidential immunity … ",
    "url": "https://www.axios.com/2024/07/06/donald-trump-classified-documents-delay"
  }
]