[
  {
    "text": "Silt police investigating incident involving U.S. Rep. Lauren Boebert and her ex-husband  —  The Silt Police Department is investigating a Saturday night incident at a restaurant involving U.S. Rep. Lauren Boebert and her ex-husband Jayson Boebert.  —  Silt police Chief Mike Kite confirmed … ",
    "url": "https://www.denverpost.com/2024/01/07/lauren-boebert-ex-husband-jayson-police-silt-colorado-restaurant/"
  },
  {
    "text": "Boebert's ex-husband calls police after fight with congresswoman  —  The representative from Colorado denies allegations that she punched her former spouse  —  Police were called to a restaurant in Silt, Colo., on Saturday night after Rep. Lauren Boebert (R-Colo.) and her ex-husband Jayson … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/07/lauren-boebert-ex-husband/"
  },
  {
    "text": "Lauren Boebert's Ex Called The Cops After Physical Fight in Public on Saturday Night  —  Police confirmed an “active investigation” into the incident, while a Boebert aide told The Daily Beast that the congresswoman was acting in self-defense. … On Saturday night, three years … ",
    "url": "https://www.thedailybeast.com/lauren-boeberts-ex-husband-jayson-called-the-cops-after-physical-fight-in-public"
  },
  {
    "text": "Johnson strikes his first bipartisan deal — a $1.7T funding accord  —  Ahead of a government shutdown cliff on Jan. 19, angst among House Republicans could still derail efforts to avert a funding lapse.  —  Congressional leaders have clinched a deal on overall budget totals that could pave … ",
    "url": "https://www.politico.com/news/2024/01/07/congress-spending-deal-shutdown-00134200"
  },
  {
    "text": "Congressional leaders reach deal that would avert government shutdown  —  The negotiated totals would preserve funding for key domestic and social safety net programs despite GOP demands for cuts  —  Congressional leaders reached a $1.66 trillion agreement Sunday to finance the federal government in 2024 … ",
    "url": "https://www.washingtonpost.com/business/2024/01/07/congress-budget-deal/"
  },
  {
    "text": "Congress reaches spending deal that could help avoid government shutdown  —  Congressional leaders have reached an agreement on overall spending levels for the current fiscal year that could help avoid a partial government shutdown later this month.  The agreement largely hews to spending caps … ",
    "url": "https://apnews.com/article/congress-spending-shutdown-5809f29447b250a3902c45098cbd6909"
  },
  {
    "text": "Biden will visit church where Black people were killed to lay out election stakes and perils of hate  —  WILMINGTON, Del. (AP) — President Joe Biden wants Americans to grasp the extraordinary stakes of this year's presidential election, as he sees them.  As part of that effort … ",
    "url": "https://apnews.com/article/biden-trump-2024-election-jan-6-3e40b3732036a237a5a8af45b7ad6a6b"
  },
  {
    "text": "Biden campaign raises $1M online in 24 hours after Jan. 6 speech  —  President Biden's reelection campaign raised more than $1 million through online fundraising alone in the 24 hours after the president's Jan. 6 anniversary speech, according to numbers exclusively provided to The Hill.",
    "url": "https://thehill.com/homenews/campaign/4394598-biden-campaign-raises-1m-online-in-24-hours-after-jan-6-speech/"
  },
  {
    "text": "'He's a cipher': How Austin's need for privacy just backfired  —  Pressure is growing on Capitol Hill and within the administration for someone to lose their job.  —  Defense Secretary Lloyd Austin is one of the most reclusive Pentagon chiefs in recent memory.  That strategy may be backfiring on him.",
    "url": "https://www.politico.com/news/2024/01/07/austin-has-long-been-a-quiet-operator-that-just-backfired-on-him-00134199"
  },
  {
    "text": "Deputy defense secretary was not told Austin had been hospitalized when she assumed his duties  —  When the deputy secretary of defense began assuming some of Secretary of Defense Lloyd Austin's responsibilities on January 2, not even she knew that it was because Austin was hospitalized, two defense officials told CNN.",
    "url": "https://www.cnn.com/2024/01/07/politics/austin-hospitalization-leaders-not-informed/"
  },
  {
    "text": "Special counsel probe uncovers new details about Trump's inaction on Jan. 6: Sources  —  Aides allegedly said Trump was “not interested” in doing more to stop the riot.  —  In a video message posted to Twitter on the afternoon of Jan. 6, 2021, President Donald Trump addresses supporters participating in the attack on the U.S. Capitol.",
    "url": "https://abcnews.go.com/US/special-counsel-probe-uncovers-new-details-trumps-inaction/story?id=106131854"
  },
  {
    "text": "Trump Is Connecting With a Different Type of Evangelical Voter  —  They are not just the churchgoing, conservative activists who once dominated the G.O.P.  —  Karen Johnson went to her Lutheran church so regularly as a child that she won a perfect attendance award.  As an adult, she taught Sunday school.",
    "url": "https://www.nytimes.com/2024/01/08/us/politics/donald-trump-evangelicals-iowa.html"
  },
  {
    "text": "National Park Service to Remove William Penn Statue from Historic Site  —  The National Park Service (NPS) has announced it will be rehabilitating (via reduction) Pennsylvania founder William Penn's Welcome Park to “provide a more welcoming, accurate, and inclusive experience.”",
    "url": "https://www.nationalreview.com/corner/national-park-service-to-remove-william-penn-statue-from-historic-site/"
  },
  {
    "text": "‘Piece Of S**t’: Meghan McCain Rips Trump For Mocking Her Late Father  —  McCain criticized the former president for dishing out another attack at the late senator.  —  LOADING  —  Meghan McCain slammed former President Donald Trump for mocking her late father, Sen. John McCain (R-Ariz.) … ",
    "url": "https://www.huffpost.com/entry/meghan-mccain-trump-john-mccain-injuries_n_659a24d0e4b0bfe5ff636f22"
  }
]