[
  {
    "text": "House Republicans push to rename DC international airport after Trump  —  ‘In my lifetime, our nation has never been greater than under the leadership of President Donald J Trump’: Reschenthaler  —  FIRST ON FOX: A group of House Republicans is pushing to rename Washington, D.C.'s … ",
    "url": "https://www.foxnews.com/politics/house-republicans-push-rename-dc-international-airport-trump"
  },
  {
    "text": "World Central Kitchen Says U.S. Citizen Among 7 Staff Killed in ‘Targeted’ Triple Israeli Attack  —  ‘UNFORGIVABLE’  —  José Andrés' international aid organization said it would pause its work in Gaza in the wake of the killings.  —  A dual U.S.-Canadian citizen … ",
    "url": "https://www.thedailybeast.com/world-central-kitchen-says-us-citizen-among-7-staff-killed-in-targeted-triple-israeli-attack"
  },
  {
    "text": "‘The threat is very real’: Trump's defense of his attacks is rejected  —  Donald Trump has and continues to benefit enormously from the overlap of his campaign and his legal travails.  —  For all of his complaints about the timing and his insistence that his various indictments and trials … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/02/trump-gag-order-politics-legal-cases/"
  },
  {
    "text": "The Republican party has become a full-fledged anti-sex movement  —  The conservative obsession with purity and control is being achieved by increasingly punitive means  —  The US supreme court justices Samuel Alito and Clarence Thomas cited the Comstock Act, named after the 19th-century … ",
    "url": "https://www.theguardian.com/commentisfree/2024/apr/02/the-republican-party-has-become-a-full-fledged-anti-sex-movement"
  },
  {
    "text": "Iran vows response after strike it blames on Israel demolishes consulate in Syria  —  Iran and one of its key proxies vowed Tuesday to respond to a strike widely attributed to Israel that demolished Iran's consulate in the Syrian capital of Damascus and killed eight people, including two Iranian generals.",
    "url": "https://apnews.com/article/iran-syria-israel-hezbollah-gaza-damascus-f7a1af3a9fc67de1962d4f1589d7e9f0"
  },
  {
    "text": "RFK Jr. rebuked for calling Biden bigger threat to democracy than Trump  —  Independent presidential candidate Robert F. Kennedy Jr. repeatedly advanced an argument Monday that President Biden poses a greater threat to democracy than Donald Trump, a comment that drew swift rebukes from several historians and experts.",
    "url": "https://www.washingtonpost.com/elections/2024/04/02/rfk-jr-biden-trump-democracy/"
  },
  {
    "text": "Video shows California police fatally shooting teenager who was reported kidnapped  —  Revealed: Savannah Graziano, 15, shot by sheriff's deputies in 2022 while unarmed and following instructions to move toward them  —  Newly released law enforcement footage captures the moment California police fatally shot … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/01/california-police-video-shooting-15-year-old-girl-savannah-graziano"
  },
  {
    "text": "Manufacturing discontent  —  How Dems can fight back against Republican resentment politics. … It's become something of a cottage industry to explore how white rural animus gives much-needed support to Republican candidates in local, state, and national elections.",
    "url": "https://www.publicnotice.co/p/white-maga-rural-rage-how-to-counter-it"
  },
  {
    "text": "Trump secures $175 million bond in New York civil fraud case  —  An appeals court last week reduced the amount of bond he was required to post.  —  Former President Donald Trump speaks at a campaign rally in Rome, GA, March 9, 2024.  —  Former President Donald Trump and his co-defendants … ",
    "url": "https://abcnews.go.com/US/trump-secures-175-million-bond-new-york-civil/story?id=108715465"
  },
  {
    "text": "‘No help here’: Florida abortion ruling leaves women with few options  —  The law allowed to go into effect by Florida's Supreme Court will affect more people seeking abortions in the first trimester than any other ban to date  —  More than 80,000 women get an abortion in Florida in a typical year … ",
    "url": "https://www.washingtonpost.com/nation/2024/04/02/florida-supreme-court-abortion-access/"
  },
  {
    "text": "Trump Media shares plummet 21% days after debut  —  Shares of Donald Trump's social media company plunged 21% on Monday, wiping out the gains from its debut last week, after disclosing millions in losses and saying it would struggle to meet its financial liabilities going forward.",
    "url": "https://www.reuters.com/markets/us/trumps-media-company-falls-after-raising-going-concern-doubts-2024-04-01/"
  },
  {
    "text": "The Russian Army Just Launched The Biggest Tank Assault Of The War  —  Forty-eight tanks and fighting vehicles attacked along a single road west of Avdiivka—and got massacred  —  On Saturday, the Russian army launched what may have been one of the largest-scale tank assaults of Russia's 25-month wider war on Ukraine.",
    "url": "https://www.forbes.com/sites/davidaxe/2024/03/31/the-russian-army-just-launched-the-biggest-tank-assault-of-the-war/"
  },
  {
    "text": "Arizona abortion rights amendment backers says they've gathered signatures needed for 2024 ballot  —  First to NBC News: Arizona for Abortion Access says it's exceeded the state petition signature threshold by over 120,000, with plans to keep gathering until a July 3 deadline.",
    "url": "https://www.nbcnews.com/politics/2024-election/arizona-abortion-rights-amendment-backers-says-gathered-signatures-nee-rcna145922"
  },
  {
    "text": "New York judge says FDNY booing of Letitia James, pro-Trump chants not about politics, ‘has to do with race’  —  Brooklyn federal judge suggests recent incident is evidence of racist culture at FDNY  —  Brooklyn Federal Court Judge Nicholas Garaufis reportedly cited the incident involving members … ",
    "url": "https://www.foxnews.com/politics/new-york-judge-says-fdny-booing-letitia-james-pro-trump-chants-not-about-politics-race"
  },
  {
    "text": "Corporate profit bonanza  —  In the last three months of 2023, after-tax corporate profits reached an all-time high of $2.8 trillion.  This is part of a long-term growth in corporate profits that began in the 1980s, picked up steam at the turn of the millennium, and exploded since 2020.",
    "url": "https://popular.info/p/corporate-profit-bonanza"
  },
  {
    "text": "Readout of President Joe Biden's Call with President Xi Jinping of the People's Republic of China  —  President Joseph R. Biden, Jr. spoke today with President Xi Jinping of the People's Republic of China (PRC).  The call follows the two leaders' meeting in Woodside, California in November 2023.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/02/readout-of-president-joe-bidens-call-with-president-xi-jinping-of-the-peoples-republic-of-china/"
  },
  {
    "text": "Pair of Warner Bros. Discovery board members resign amid DOJ antitrust probe  —  Two members of Warner Bros. Discovery's (WBD) board have resigned amid an investigation from the Department of Justice into whether their presence on the body violated antitrust law.",
    "url": "https://thehill.com/homenews/media/4569503-warnerbros-discovery-doj-antitrust-probe/"
  },
  {
    "text": "Jon Stewart: Apple ‘Did Not Want’ Interview With FTC Chair Lina Khan  —  “They literally said, 'Please don't talk to her,'” Stewart recalled Apple telling him while speaking with Khan on Monday.  —  LOADING  —  Jon Stewart said Monday night that Apple asked him not to interview Lina Khan … ",
    "url": "https://www.huffpost.com/entry/jon-stewart-apple-lina-khan-interview_n_660c1c5ae4b09f580bc59700"
  }
]