[
  {
    "text": "Trump is planning 100 executive orders starting Day 1 on border, deportations and other priorities  —  President-elect Donald Trump is preparing more than 100 executive orders starting Day One of the new White House, in what amounts to a shock-and-awe campaign on border security, deportations and a rush of other policy priorities.",
    "url": "https://apnews.com/article/trump-day-one-border-executive-actions-30f78c3c983ae74555f281446fe22710"
  },
  {
    "text": "Trump claims Biden blocking his agenda at the last-minute.  Policy experts weigh in.  —  Biden has banned much offshore drilling while Trump says “drill, baby, drill.”  —  President Joe Biden and President-elect Donald Trump  —  As his time in the White House comes to a close … ",
    "url": "https://abcnews.go.com/Politics/trump-claims-biden-blocking-agenda-minute-policy-experts/story?id=117562473"
  },
  {
    "text": "Mark Zuckerberg lies about content moderation to Joe Rogan's face … I'll spare you the experience of listening to one of the richest men in the world whine and just tell you straight out: Mark Zuckerberg's interview on The Joe Rogan Experience is full of lies.",
    "url": "https://www.theverge.com/2025/1/10/24341117/mark-zuckerberg-facebook-joe-rogan-lies"
  },
  {
    "text": "Despite Trump's Attacks, Republicans Made Big Gains in Mail Voting  —  As Republican voters embraced a practice that Donald J. Trump railed against for years, softening his tone only slightly in 2024, the party eroded a key Democratic advantage across the country.",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/trump-2024-election-mail-votes.html"
  },
  {
    "text": "Federal judge slams Rudy Giuliani as ‘outrageous and shameful’ as she holds him in contempt in 2020 election defamation case  —  Rudy Giuliani has been held in contempt of court for the second time in a week, as the former New York mayor and top Donald Trump lawyer's fall from grace continues … ",
    "url": "https://www.cnn.com/2025/01/10/politics/rudy-giuliani-contempt-hearing-defamation-case"
  },
  {
    "text": "DoJ releases its Tulsa race massacre report over 100 years after initial review  —  DoJ report acknowledges attack ‘was so systematic and coordinated that it transcended mere mob violence’  —  On Friday, the Department of Justice (DoJ) released its report on the Tulsa race massacre after announcing the review last September.",
    "url": "https://www.theguardian.com/us-news/2025/jan/10/tulsa-race-massacre-report-doj"
  },
  {
    "text": "Did Mayor Karen Bass really cut the fire department budget?  The answer gets tricky  —  When Mayor Karen Bass unveiled her budget plan for 2024-25, she called for a 2.7% reduction in spending at the Los Angeles Fire Department.  —  Her proposal, unveiled in April, sought $23 million in cuts … ",
    "url": "https://www.latimes.com/california/story/2025-01-10/how-much-did-the-l-a-fire-department-really-cut-its-budget"
  },
  {
    "text": "Zuckerberg urges Trump to stop the EU from fining US tech companies  —  Comparing the bloc's antitrust penalties to tariffs, the Meta boss argued that Brussels is “screwing with” American industry.  —  The U.S. government under incoming President Donald Trump should intervene to stop the EU … ",
    "url": "https://www.politico.eu/article/zuckerberg-urges-trump-to-stop-eu-from-screwing-with-fining-us-tech-companies/"
  },
  {
    "text": "Protesters chanting ‘no to Nazis’ block access to AfD party congress  —  Summit attendees are expected to formally nominate Alice Weidel as the far-right candidate for chancellor in next month's election.  —  Thousands of demonstrators gathered in the East German town of Riesa on Saturday … ",
    "url": "https://www.politico.eu/article/protesters-chanting-no-to-nazis-block-access-to-afd-party-congress/"
  },
  {
    "text": "O Canada, Come Join Us  —  My great-great-grandmother was born in Saint John, New Brunswick, and first saw the United States as a 10-year-old.  My great-grandfather was an Irish Canadian who married a Maine girl.  My wife's father was born in Ontario, descended from a long line of Newfoundlanders … ",
    "url": "https://www.nytimes.com/2025/01/11/opinion/o-canada-come-join-us.html"
  },
  {
    "text": "State to probe why Pacific Palisades reservoir was offline, empty when firestorm exploded  —  A large reservoir in Pacific Palisades that is part of the Los Angeles water supply system was out of use when a ferocious wildfire destroyed thousands of homes and other structures nearby, the Los Angeles Times found.",
    "url": "https://www.latimes.com/california/story/2025-01-10/as-flames-raged-in-palisades-a-key-reservoir-nearby-was-offline"
  },
  {
    "text": "Trump vilified tech giants.  Now they're giving him millions.  —  After years in which Trump called them enemies of the people, Silicon Valley executives are hoping $1 million gifts and Mar-a-Lago dinners will mend bridges with the president-elect.  —  On Jan. 7, 2021, when Meta suspended … ",
    "url": "https://www.washingtonpost.com/technology/2025/01/11/trump-big-tech-inauguration-zuckerberg-bezos-google/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2NTcxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3OTUzOTk5LCJpYXQiOjE3MzY1NzE2MDAsImp0aSI6IjI4NzIzMThkLTE2NzktNGRkYy1iYjI2LTg4YThlN2M1YzQ3MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDEvMTEvdHJ1bXAtYmlnLXRlY2gtaW5hdWd1cmF0aW9uLXp1Y2tlcmJlcmctYmV6b3MtZ29vZ2xlLyJ9.QfwA1E0QKGOmw6E1d1ANY_Q7jbKSen85RhyaI-IVAR0"
  },
  {
    "text": "As L.A. Fires Rage, Trump and Newsom's Hostilities Resurface  —  California's Democratic governor, Gavin Newsom, and President-elect Donald J. Trump have long feuded.  Can the rancor be set aside to help a devastated city recover?  —  As fires raged around Los Angeles, Gov. Gavin Newsom … ",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/los-angeles-fires-trump-newsom.html"
  },
  {
    "text": "The California Wildfires Are the Latest Disaster Supercharged by Climate Change  —  Extreme weather events — deadly heat waves, floods, fires and hurricanes — are the consequences of a warming planet, scientists say.  —  As Los Angeles burned for days on end, horrifying the nation … ",
    "url": "https://www.nytimes.com/2025/01/10/climate/california-fires-climate-change-disasters.html?unlocked_article_code=1.oU4.teAw.73gudJ3Hvi9J&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Biden Calls Meta's Ending of Fact-Checking Program ‘Shameful’  —  Responding to a question from a reporter, the president said he believed Americans “want to tell the truth.”  —  President Biden criticized Mark Zuckerberg, the chief executive of Meta, on Friday for deciding to abandon … ",
    "url": "https://www.nytimes.com/2025/01/10/us/politics/biden-meta-fact-checking.html"
  },
  {
    "text": "As a Felon, Trump Upends How Americans View the Presidency  —  President-elect Donald J. Trump has worked for years to discredit any and all criminal and civil cases against him as nothing more than politically motivated witch hunts.  —  A big economic package, mass deportations, maybe even some invasions of other countries.",
    "url": "https://www.nytimes.com/2025/01/10/us/politics/trump-felon-presidency.html"
  },
  {
    "text": "Republicans Can Slow but Not Stop Electric Vehicles, Experts Say  —  More car buyers are expected to eventually pick battery-powered cars and trucks as prices fall and technology improves, even if Biden-era incentives disappear.  —  To a large extent, the electric vehicle market in the United States runs on Democratic policies.",
    "url": "https://www.nytimes.com/2025/01/11/business/energy-environment/trump-republicans-electric-vehicles-automakers.html"
  },
  {
    "text": "Pressure mounts on Farage to resign after break with Musk  —  Ten Reform UK councillors quit in protest over the “incompetent or malevolent” management of the far-right party.  —  A group of 10 Reform UK councillors have resigned in a bid to get Nigel Farage to step down as the right-wing party's leader.",
    "url": "https://www.politico.eu/article/pressure-mounts-on-farage-to-resign-savage-break-with-musk-rejection/"
  },
  {
    "text": "Scoop: Denmark sent Trump team private messages on Greenland … - Trump has repeatedly declared that controlling Greenland — the world's largest island — is necessary for U.S. national security vis-a-vis Russia and China. … - Climate change is opening up the Arctic for competition between superpowers … ",
    "url": "https://www.axios.com/2025/01/11/denmark-response-trump-greenland-threat"
  },
  {
    "text": "Trump's return to power has old critics and skeptics reconciling with a new ‘normal’  —  Across the spectrum of American society, leaders who once shunned Trump or battled him are now seeking to bolster their ties or extend olive branches.  —  In the weeks and months after Donald Trump won … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-return-critics-skeptics-reconciling-new-normal-rcna186146"
  },
  {
    "text": "Key senators receive Pete Hegseth's FBI background check days out from confirmation hearing  —  Democrats have expressed concern over the delay and how thorough the report on Trump's embattled defense secretary pick will be.  —  WASHINGTON — An FBI background check for Pete Hegseth … ",
    "url": "https://www.nbcnews.com/politics/congress/senators-receive-pete-hegseths-fbi-background-check-days-rcna187035"
  },
  {
    "text": "Poke The Bear  —  After two months of watching American corporate and opposition-party officials “obey in advance” or, worse, choose to align with Donald Trump for selfish reasons, it's nice to see leaders in foreign countries recognize something that hasn't really sunk in among U.S. elites: Donald Trump is a lame duck.",
    "url": "https://www.offmessage.net/p/poke-the-bear"
  }
]