[
  {
    "text": "Trump says Epstein ‘stole’ underage victim Virginia Giuffre from his Mar-a-Lago spa leading to feud  —  President tells reporters he cut off contact with Epstein because he was poaching employees from his club … President Donald Trump on Tuesday said he ended his friendship … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-epstein-virginia-giuffre-mar-a-lago-b2798336.html"
  },
  {
    "text": "Did Trump Just Confess He Learned about Virginia Giuffre before Jeffrey Epstein Recruited Someone Else at Mar-a-Lago?  —  Update: In a Gaggle today, Trump did just confess this is about Giuffre and others. … Video  —  Yesterday, Donald Trump offered an entirely new explanation for his falling … ",
    "url": "https://www.emptywheel.net/2025/07/29/did-trump-just-confess-he-learned-about-virginia-giuffre-before-jeffrey-epstein-recruited-someone-else-at-mar-a-lago/"
  },
  {
    "text": "In Game-Changing Climate Rollback, E.P.A. Aims to Kill a Bedrock Scientific Finding  —  The proposal is President Trump's most consequential step yet to derail federal climate efforts and appears to represent a shift toward outright denial of the scientific consensus.",
    "url": "https://www.nytimes.com/2025/07/29/climate/epa-endangerment-finding-repeal-proposal.html"
  },
  {
    "text": "EPA moves to end climate regulation under Clean Air Act  —  The agency announced a proposal to rescind the landmark “endangerment finding,” which says that greenhouse gases are a threat to public health.  —  The Environmental Protection Agency on Tuesday announced a proposal to rescind … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/07/29/epa-endangerment-finding-clean-air-act/"
  },
  {
    "text": "Senate Confirms Emil Bove, Trump's ‘Enforcer,’ To A Lifetime Federal Judgeship  —  Bove faced credible allegations of telling DOJ attorneys to defy court orders.  Republicans confirmed him to a seat on a U.S. appeals court anyway.  —  WASHINGTON — Senate Republicans on Tuesday confirmed Emil Bove … ",
    "url": "https://www.huffpost.com/entry/senate-confirms-emil-bove-trump-judge_n_6883c652e4b09c928ae1cea0"
  },
  {
    "text": "Bove misled lawmakers about his actions in NYC mayor case, evidence suggests  —  The details from a whistleblower complaint emerged hours before a final vote on Bove's nomination to a federal judgeship.  —  Emil Bove misled lawmakers in his confirmation hearings for a federal judgeship … ",
    "url": "https://www.washingtonpost.com/investigations/2025/07/29/emil-bove-nyc-mayor-adams-whistleblower/"
  },
  {
    "text": "Maxwell offers to testify before Congress but with major conditions, including immunity  —  Jeffrey Epstein accomplice Ghislaine Maxwell has offered to testify before Congress, but with major conditions, including immunity, according to a list of her demands sent to the House Oversight Committee by her attorneys.",
    "url": "https://cnn.com/2025/07/29/politics/maxwell-conditions-congressional-testimony"
  },
  {
    "text": "170. DOJ's (Ridiculous) Misconduct Complaint Against Chief Judge Boasberg  —  DOJ's complaint that Chief Judge Boasberg engaged in “misconduct” would be laughably stupid if it didn't reflect such a transparently obvious and dangerous attempt to delegitimize the federal courts.",
    "url": "https://www.stevevladeck.com/p/170-dojs-ridiculous-misconduct-complaint"
  },
  {
    "text": "There was no “missing minute” in the original Epstein jail video, government source says  —  The “missing minute” from the surveillance video at the Manhattan Metropolitan Correctional Center where Jeffrey Epstein died in 2019 may not be missing after all, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/jeffrey-epstein-jail-video-no-missing-minute-government-source-says/"
  },
  {
    "text": "CBS News investigation of Jeffrey Epstein jail video reveals new discrepancies  —  In the weeks after Jeffrey Epstein died at the Metropolitan Correctional Center in lower Manhattan, in August 2019, then-Attorney General William Barr said his “personal review” of surveillance footage clearly showed … ",
    "url": "https://www.cbsnews.com/news/jeffrey-epstein-jail-video-investigation/"
  },
  {
    "text": "‘DO IT!’  Trump Pushes Chuck Grassley Hard to Ditch Senate ‘Blue Slip’ Tradition, Get Appointees Confirmed  —  As the Democrats continue to attempt to use every trick in the book to block confirmation of Trump's judicial nominees, the president came after Sen. Chuck Grassley (R-IA) on Tuesday … ",
    "url": "https://redstate.com/bobhoge/2025/07/29/do-it-trump-pushes-chuck-grassley-hard-to-ditch-senate-blue-slip-tradition-get-appointees-confirmed-n2192247"
  },
  {
    "text": "Senate confirms Trump nominee to lead CDC  —  The Senate on Tuesday confirmed Susan Monarez to lead the Centers for Disease Control and Prevention, putting a longtime government scientist at the helm of an agency being upended by Health and Human Services Secretary Robert F. Kennedy Jr.",
    "url": "https://thehill.com/homenews/senate/5425950-senate-confirms-susan-monarez-cdc/"
  },
  {
    "text": "Top Generals Nominated for New Positions Must Now Meet With Trump  —  The move is a departure from past practice and has raised worries that it could lead to the politicization of the military's top ranks.  —  Defense Secretary Pete Hegseth has begun requiring that nominees … ",
    "url": "https://www.nytimes.com/2025/07/29/us/politics/generals-trump.html"
  },
  {
    "text": "Joe Rogan's friends followed him to Texas.  They all seem to hate it.  —  From the heat to the state's power grid, Joe Rogan's friends are learning that Texas isn't what they were promised.  —  In 2020, Joe Rogan moved from Los Angeles to Austin after visiting and realizing he didn't have to wear a mask at a restaurant.",
    "url": "https://www.chron.com/culture/celebrities/article/joe-rogan-friends-austin-texas-20790258.php"
  },
  {
    "text": "Portrait of a Young DOGE Coder Dismantling America's Institutions",
    "url": "https://www.bloomberg.com/features/2025-luke-farritor-doge/"
  },
  {
    "text": "Pete Hegseth has discussed running for political office in Tennessee, sources say  —  The defense secretary has talked privately about running a campaign in Tennessee, sources told NBC News.  The Pentagon said Hegseth's “focus remains solely on serving under” Trump.",
    "url": "https://www.nbcnews.com/politics/trump-administration/pete-hegseth-discussed-running-political-office-tennessee-rcna221681"
  },
  {
    "text": "Trump Administration Puts New Chokehold on Billions in Health-Research Funding  —  The National Institutes of Health can't award grants to outside researchers under new White House restriction  —  The Trump administration is blocking all funding that flows to outside health researchers … ",
    "url": "https://www.wsj.com/politics/policy/trump-administration-puts-new-chokehold-on-billions-in-health-research-funding-19660215?st=YWVyJH&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Burchett kicked by horse, breaks rib  —  Rep. Tim Burchett is on the mend after suffering a horse-related snafu.  —  The Tennessee Republican was “accidentally kicked by a horse” while working on his farm over the weekend, according to his office.  —  While the 60-year-old Congress member's … ",
    "url": "https://thehill.com/homenews/house/5426101-tim-burchett-kicked-by-horse-tennessee/"
  },
  {
    "text": "Trump's Trade Deals Come With Few Details to Flesh Out Big Numbers  —  President Donald Trump's flurry of trade deal announcements are so far proving light on detail — with key aspects still under negotiation, partners giving mixed signals about what they signed up for, and big numbers shrinking under scrutiny.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-29/trump-trade-deals-come-with-few-details-to-flesh-out-big-numbers"
  },
  {
    "text": "Justice Department Finds the University of California-Los Angeles in Violation of Federal Civil Rights Law  —  For Immediate Release  —  Today, the U.S. Department of Justice's Civil Rights Division announced that the University of California, Los Angeles (UCLA) violated the Equal Protection Clause … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-finds-university-california-los-angeles-violation-federal-civil-rights"
  },
  {
    "text": "Navy Set to Unplug Critical Hurricane Satellites this Week  —  UPDATE: The Department of Defense made a late-breaking decision after this story was published to fix the security issues and keep data flowing to hurricane forecasters from the three defense weather satellites.  For a full update, please see this post.",
    "url": "https://michaelrlowry.substack.com/p/navy-set-to-unplug-critical-hurricane"
  },
  {
    "text": "IRS Chief Says Direct File Is ‘Gone,’ Other Audit Tech Is Coming  —  The Biden-era IRS free filing tool, Direct File, is “gone,” IRS Commissioner Billy Long said.  —  “You've heard of Direct File,” Long said Monday at the National Association of Enrolled Agents Tax Summit … ",
    "url": "https://news.bloombergtax.com/daily-tax-report/irs-chief-says-direct-file-is-gone-other-audit-tech-is-coming?link_source=ta_bluesky_link&taid=6888c5e198449400013024d1"
  },
  {
    "text": "Wave of condemnation after killing of Palestinian activist in West Bank  —  Israeli soldiers raid mourning tent after death of Awdah Hathaleen, who helped make Oscar-winning No Other Land  —  William Christou and Quique Kierszenbaum in Umm al-Khair  —  Awdah Hathaleen, a Palestinian activist … ",
    "url": "https://www.theguardian.com/world/2025/jul/29/palestinian-awdah-hathaleen-oscar-winning-no-other-land-killed-in-west-bank"
  },
  {
    "text": "FTC eyes trans youth care providers, seeking input on alleged deceptive practices investigation  —  The Federal Trade Commission (FTC) on Monday launched a public inquiry into whether providers of gender-affirming health care are violating federal consumer protection laws.",
    "url": "https://thehill.com/homenews/administration/5425966-ftc-youth-health-care-providers-proposed-probe/"
  },
  {
    "text": "ICE arrests illegal alien serving as a local police officer after attempting to unlawfully purchase firearm in Maine  —  Jamaican national attempted to illegally purchase firearm for his employment as a local police officer  —  BIDDEFORD, Maine - U.S. Immigration and Customs Enforcement officers … ",
    "url": "https://www.ice.gov/news/releases/ice-arrests-illegal-alien-serving-local-police-officer-after-attempting-unlawfully"
  },
  {
    "text": "Trump-CBS deal is even worse than you thought  —  Every so often there comes a moment of clarity about what immigration really means in America, often wrapped in tragedy.  The essential work that immigrants do was hammered home last year when six of them perished in the collapse of Baltimore's Key Bridge.",
    "url": "https://www.inquirer.com/columnists/attytood/trump-cbs-paramount-media-press-freedom-authoritarian-censorship-20250729.html"
  },
  {
    "text": "Trump approval rating sinks to 40%, the lowest of his term, Reuters/Ipsos poll finds  —  U.S. President Donald Trump's approval rating dropped one percentage point to 40%, the lowest level of his second term in office, as Americans remained concerned about his handling of the economy and immigration, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/trump-approval-rating-sinks-40-lowest-his-term-reutersipsos-poll-finds-2025-07-29/"
  },
  {
    "text": "The Biggest House GOP Bullies Are Now Impotent  —  From the moment they formed in early 2015, the far-right House Freedom Caucus has been a pest, but one to be reckoned with on Capitol Hill.  Any time government funding was in jeopardy, or a fiscal cliff loomed, or a Republican party boss … ",
    "url": "https://www.thebulwark.com/p/house-freedom-caucus-became-impotent-continuing-resolution-congress-budget-big-beautiful-bill-ralph-norman-andy-harris-chip-roy"
  },
  {
    "text": "Gunman who killed 4 at NYC building was targeting NFL offices but took wrong elevator, mayor says  —  A gunman who killed four people at a Manhattan office building before killing himself was trying to target the headquarters of the National Football League but took the wrong elevator, Mayor Eric Adams said Tuesday.",
    "url": "https://apnews.com/article/manhattan-office-shooting-nfl-nyc-d32bec88dfe208af1a413cec02034a14"
  },
  {
    "text": "Scientist on green card detained for a week without explanation, lawyer says  —  Tae Heung Kim, a Korean citizen studying in the United States, is being held in San Francisco after returning from his brother's wedding overseas.  —  A Korean-born researcher and longtime U.S. legal permanent resident … ",
    "url": "https://www.washingtonpost.com/immigration/2025/07/29/korean-scientist-green-card-detained/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzNzYxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU1MTQzOTk5LCJpYXQiOjE3NTM3NjE2MDAsImp0aSI6IjM1YzljYzgwLTYxN2EtNDYyMC04MmJhLWVkZmZjYTVhMzM3MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA3LzI5L2tvcmVhbi1zY2llbnRpc3QtZ3JlZW4tY2FyZC1kZXRhaW5lZC8ifQ.5BctpJoDDLFBrYKsaiV0fvWyZoFqW86Sl5JHsqc3ih4&itid=gfta"
  },
  {
    "text": "Exclusive: Inside the Preparations for Trump's Next Supreme Court Nominee  —  Updates on Manhattan shooting, Gaza, and more  —  White House officials and a close circle of conservative lawyers are preparing for President Donald Trump to be able to hit the ground running if a Supreme Court vacancy opens … ",
    "url": "https://time.com/7305987/donald-trump-supreme-court-justices/"
  },
  {
    "text": "Voters See Dems as More Corrupt Than Republicans Despite Trump's Grifting  —  The poll, taken by a respected liberal firm, is another sign of trouble for the Democratic brand  —  On Tuesday morning, the White House posted a livestream of the “Grand Opening Ceremony” of his newest golf club … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-democrats-more-corrupt-than-republicans-poll-1235396092/"
  }
]