[
  {
    "text": "Officials Concede They Don't Know the Fate of Iran's Uranium Stockpile  —  Both Vice President JD Vance and Rafael Grossi, the head of the International Atomic Energy Agency, acknowledged questions about the whereabouts of Iran's stockpile of near-bomb-grade nuclear material.",
    "url": "https://www.nytimes.com/2025/06/22/us/politics/iran-uranium-stockpile-whereabouts.html"
  },
  {
    "text": "Trump Meets the Moment on Iran  —  The President bombs three nuclear sites to spare the world from an intolerable risk.  —  “Iran's key nuclear enrichment facilities have been completely and totally obliterated,” Mr. Trump said Saturday night.  He made clear Iran brought this on itself.",
    "url": "https://www.wsj.com/opinion/trump-meets-the-moment-on-iran-1794ade3"
  },
  {
    "text": "U.S. Investigates How Much of Iran's Nuclear Program Was Destroyed—And How Much Remains  —  Pentagon says it is still assessing the results of the attack as Tehran vows to continue its nuclear efforts.  —  WASHINGTON—Trump administration officials said Sunday that the air and missile strikes … ",
    "url": "https://www.wsj.com/world/middle-east/damage-extent-from-u-s-strikes-on-irans-fordow-nuclear-site-unclear-b86b9a58?st=muqUhF"
  },
  {
    "text": "Trump's team launches group to unseat GOP Rep. Thomas Massie  —  Trump has heavily criticized Massie, of Kentucky, who has opposed his strikes on Iran and his “big, beautiful bill” in Congress.  —  Two key advisers to President Donald Trump are launching a group to unseat Rep. Thomas Massie … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-thomas-massie-criticism-us-strikes-iran-kentucky-maga-rcna214387"
  },
  {
    "text": "What Satellite Images Reveal About the US Bombing of Iran's Nuclear Sites  —  The US concentrated its attack on Fordow, an enrichment plant built hundreds of feet underground.  Aerial photos give important clues about what damage the “bunker-buster” bombs may have caused.",
    "url": "https://www.wired.com/story/iran-fordow-nuclear-site-satellite-images-damage/"
  },
  {
    "text": "No matter what Trump says, the US has gone to war - and there will be profound and lasting consequences  —  Trump has fallen slap bang into the trap laid for him by Netanyahu.  His reckless gamble makes a nuclear weapon for Iran more, not less, likely  —  Bombing will not make Iran go away.",
    "url": "https://www.theguardian.com/commentisfree/2025/jun/22/donald-trump-usa-iran-israel-war-bombing"
  },
  {
    "text": "Three ways Trump's attack on Iran could spin out of control  —  When Vice President JD Vance appeared on Meet the Press on Sunday morning, anchor Kristen Welker asked him a simple question: Is the United States now at war with Iran?  —  In response, Vance said, “We're not at war with Iran; we're at war with Iran's nuclear program.”",
    "url": "https://www.vox.com/world-politics/417478/iran-bomb-united-states-trump-fordow-natanz-escalation"
  },
  {
    "text": "Trump floats regime change in Iran, muddying the administration's message  —  Top Trump officials said their strikes on Iran's nuclear sites were limited, but they don't have much control over the knock-on effects in the Middle East and their party.  —  President Donald Trump's top national … ",
    "url": "https://www.politico.com/news/2025/06/22/trump-administration-says-it-doesnt-want-regime-change-and-admits-it-may-happen-00417738"
  },
  {
    "text": "‘There Is No Intel’: Trump's Attacks on Iran Were Based on Vibes, Sources Say  —  Following Trump's attacks on Iran, an admin official tells Rolling Stone, “The intelligence assessments have not really changed” … Just months ago, Trump's Director of National Intelligence Tulsi Gabbard testified … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-iran-attack-no-intel-nuclear-1235369641/"
  },
  {
    "text": "Early assessments raise questions over whether US destroyed bulk of enriched Iranian nuclear material  —  President Donald Trump declared that Iran's nuclear enrichment facilities were “completely and totally obliterated” following this weekend's air strikes, but the US appears to have held … ",
    "url": "https://cnn.com/2025/06/22/politics/iran-strike-analysis-raises-questions"
  },
  {
    "text": "6/23/25 ☀️ AM: … Congress is back this week for what can only be described as a monumental five (or more) days in session.  —  House members left town on June 12.  The Senate left Wednesday afternoon.  Since then, the United States has joined Israel's war against Iran … ",
    "url": "https://punchbowl.news/archive/62325-am/"
  },
  {
    "text": "“One Big, Beautiful Bill” Has More Provisions That Violate the Byrd Rule, According to Senate Parliamentarian  —  WASHINGTON, D.C. - The Republicans' “One Big, Beautiful Bill” continues to include provisions that violate the Senate's Byrd Rule, according to the Senate Parliamentarian … ",
    "url": "https://www.budget.senate.gov/ranking-member/newsroom/press/one-big-beautiful-bill-has-more-provisions-that-violate-the-byrd-rule-according-to-senate-parliamentarian"
  },
  {
    "text": "Senate parliamentarian rejects GOP's attempt to limit courts' contempt powers  —  The Senate parliamentarian has ruled against a controversial provision in the Senate Republicans' megabill that would have made it significantly more difficult for courts to enforce contempt findings against the Trump administration.",
    "url": "https://thehill.com/homenews/senate/5363225-senate-parliamentarian-rules-out-contempt-provision/"
  },
  {
    "text": "ICE will likely detain Kilmar Abrego Garcia despite judge's motion to have him released  —  Abrego Garcia was returned to the U.S. after being mistakenly deported.  —  Kilmar Abrego Garcia, a Salvadoran migrant in this handout image obtained by Reuters on April 9, 2025.  —  Abrego Garcia Family via Reuters",
    "url": "https://abcnews.go.com/Politics/judge-denies-governments-motion-detain-kilmar-abrego-garcia/story?id=123105021"
  },
  {
    "text": "Republican's Life-Threatening Pregnancy Collided With Florida's Abortion Politics  —  Due in August with her first child, Rep. Kat Cammack says doctors last year hesitated to treat her ectopic pregnancy  —  Rep. Kat Cammack arrived at the emergency room in May 2024 terrified by what she had just learned … ",
    "url": "https://www.wsj.com/politics/policy/republicans-life-threatening-pregnancy-collided-with-floridas-abortion-politics-ad96f8d4?st=FwZvY5&reflink=article_copyURL_share"
  },
  {
    "text": "IMF's Georgieva Warns of Broader Risks From US Strikes on Iran  —  International Monetary Fund Managing Director Kristalina Georgieva warned that the US strikes on Iran could potentially have broader impacts beyond energy channels, as global uncertainty escalates.",
    "url": "https://www.bloomberg.com/news/articles/2025-06-23/imf-s-georgieva-warns-of-broader-risks-from-us-strikes-on-iran"
  },
  {
    "text": "Judge will order Kilmar Abrego Garcia's release before trial, but ICE plans to detain him  —  A federal judge in Tennessee plans to order the release of Kilmar Abrego Garcia, whose mistaken deportation to El Salvador has become a flashpoint in President Donald Trump's immigration crackdown … ",
    "url": "https://apnews.com/article/abrego-garcia-deportation-error-c0a515baffdf54baba412edf4cdbd310"
  }
]