[
  {
    "text": "Jack Smith Wants Trump Convicted by Super Tuesday  —  The Department of Justice is suggesting that Trump's trial for trying to overturn the 2020 election should begin on Jan. 2, 2024—and last no more than six weeks.  —  Special Counsel Jack Smith's office wants to put former President Donald Trump … ",
    "url": "https://www.thedailybeast.com/jack-smith-wants-trump-convicted-by-super-tuesday"
  },
  {
    "text": "Trump confronted on golf course about no-showing Florida court appearance  —  Trump told the judge in court papers last week he is not guilty and waived his right to appear at the hearing  —  FIRST ON FOX: Former President Donald Trump said Thursday he didn't think it was “necessary” … ",
    "url": "https://www.foxnews.com/politics/trump-confronted-golf-course-no-showing-florida-court-appearance"
  },
  {
    "text": "Clarence Thomas' 38 Vacations: The Other Billionaires Who Have Treated the Supreme Court Justice to Luxury Travel  —  Co-published with CNN  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship … ",
    "url": "https://www.propublica.org/article/clarence-thomas-other-billionaires-sokol-huizenga-novelly-supreme-court"
  },
  {
    "text": "Ron DeSantis is running for president but doesn't believe in democracy  —  Republican Florida Gov. Ron DeSantis is staying in the presidential race because he thinks he's the best bet for the Republican Party if Donald Trump can't be the nominee.  He can't defeat Trump because he's … ",
    "url": "https://www.lawdork.com/p/ron-desantis-is-running-for-president"
  },
  {
    "text": "Conservative Case Emerges to Disqualify Trump for Role on Jan. 6  —  Two law professors active in the Federalist Society wrote that the original meaning of the 14th Amendment makes Donald Trump ineligible to hold government office.  —  Reporting from Washington",
    "url": "https://www.nytimes.com/2023/08/10/us/trump-jan-6-insurrection-conservatives.html"
  },
  {
    "text": "Trump's Truth Social tipped FBI to man killed during arrest attempt for Biden threats  — The social media company owned by former President Donald Trump in March tipped off the FBI about threats made by a Utah man who was fatally shot Wednesday by FBI agents as they attempted to arrest him for threatening to kill President Joe Biden.",
    "url": "https://www.cnbc.com/2023/08/10/trumps-truth-social-tipped-fbi-to-man-killed-during-arrest-attempt-for-biden-threats.html"
  },
  {
    "text": "Ex-Trump attorney Michael Cohen considers run for Congress  —  Michael Cohen, Donald Trump's ex-attorney-turned-critic who has characterized his former boss as a “conman” and “racist,” is considering a run for Congress.  —  Cohen said he would run as a Democrat, potentially mounting … ",
    "url": "https://www.semafor.com/article/08/10/2023/michael-cohen-congress"
  },
  {
    "text": "Trump adviser groped 2 women in 2021 at Scottsdale club, one tells police  —  A woman says Boris Epshteyn, a special adviser to Donald Trump, repeatedly groped her and her sister inside a Scottsdale nightclub in 2021, according to police body camera footage obtained by The Arizona Republic.",
    "url": "https://www.azcentral.com/story/news/politics/elections/2023/08/10/trump-adviser-boris-epshteyn-groped-2-women-in-scottsdale-one-says/70562482007/"
  },
  {
    "text": "Sen. Joe Manchin Again Teases Defection From Democratic Party  —  The West Virginia moderate has often refused to go along with the Democratic agenda in Washington.  —  Sen. Joe Manchin (W.Va.) said Thursday he's thinking about leaving the Democratic Party and becoming an independent.",
    "url": "https://www.huffpost.com/entry/joe-manchin-democratic-party_n_64d522b7e4b0ce07804b168a"
  },
  {
    "text": "GOP Oversight Chairman Comer vows to subpoena the Biden family  —  Comer's promise follows a Republican-led investigation that has largely focused on Hunter Biden's foreign business dealings but shown no direct links to the president.  —  WASHINGTON — House Oversight Committee James Comer … ",
    "url": "https://www.nbcnews.com/politics/congress/oversight-chairman-comer-threatens-subpoenas-biden-family-rcna99313"
  },
  {
    "text": "Nikki Haley signs RNC pledge to support eventual GOP nominee but makes one small edit  —  RNC Chairwoman Ronna McDaniel made the ‘Beat Biden pledge’ a requirement for candidates wishing to participate in party-sanctioned debates  —  FIRST ON FOX: GOP presidential candidate Nikki Haley … ",
    "url": "https://www.foxnews.com/politics/nikki-haley-signs-rnc-pledge-support-eventual-republican-presidential-nominee"
  },
  {
    "text": "U.S. Reaches Deal With Iran to Free Americans for Jailed Iranians and Funds  —  Five American detainees will eventually be allowed to leave Iran in exchange for Tehran gaining access to $6 billion for humanitarian purposes and the United States freeing several jailed Iranians.",
    "url": "https://www.nytimes.com/2023/08/10/us/politics/iran-us-prisoner-swap.html"
  },
  {
    "text": "Tommy Tuberville: Florida's third senator?  —  The Fact Checker  —  “Tuberville lives in Auburn, Alabama, with his wife Suzanne.”  — website of Sen. Tommy Tuberville (R-Ala.)  —  In late June, Tommy Tuberville traveled to the Wiregrass region of Alabama, which borders Florida.",
    "url": "https://www.washingtonpost.com/politics/2023/08/10/tommy-tuberville-floridas-third-senator/"
  },
  {
    "text": "Maui fire deaths surge to 53 and likely to go higher, governor says.  Over 1,000 structures burned  —  The search of the wildfire wreckage on the Hawaiian island of Maui is revealing a wasteland of burned out homes and obliterated communities as firefighters battle the stubborn blaze that has already claimed 36 lives.",
    "url": "https://apnews.com/article/hawaii-wildfire-maui-lahaina-f5a7047d407f836f89e90dd7f10faa94"
  },
  {
    "text": "White House asks Congress for $40B in additional funding  —  The White House on Thursday outlined a supplemental funding request for Congress for the start of the coming fiscal year, asking for billions more dollars for assistance to Ukraine amid its war with Russia as well as money … ",
    "url": "https://thehill.com/homenews/administration/4147785-white-house-asks-congress-for-40b-in-additional-funding/"
  },
  {
    "text": "Supreme Court pauses Purdue Pharma bankruptcy deal  —  The Supreme Court on Thursday agreed to consider the Biden administration's challenge to a bankruptcy settlement for Purdue Pharma, pausing the $6 billion deal over the administration's concerns about a provision that would shield the members … ",
    "url": "https://thehill.com/regulation/court-battles/4148000-supreme-court-pauses-purdue-pharma-bankruptcy-deal/"
  },
  {
    "text": "Miscommunication between pilots caused United plane to drop near ocean's surface, investigation finds  —  The crew failed to manage the plane's path, airspeed and nose direction after the mix-up, the NTSB said in its report.  No one was injured.  —  Federal investigators said Thursday … ",
    "url": "https://www.nbcnews.com/news/us-news/miscommunication-pilots-caused-united-plane-drop-oceans-surface-invest-rcna99374"
  },
  {
    "text": "Research Firm Says Proud Boys Legal Team Stiffed Them $30,000  —  A lingering legal fight from the Jan. 6 attack gives new insight into the Proud Boys' seditious conspiracy case.  —  A seditious conspiracy trial for members of the Proud Boys is over.  But a legal loose end from the case … ",
    "url": "https://www.thedailybeast.com/research-firm-says-proud-boys-legal-team-stiffed-them-dollar30000"
  },
  {
    "text": "California Democrat suspends congressional campaign due to ‘lack of joy’  —  Democratic House candidate Aditya Pai — running for Rep. Michelle Steel's (R-Calif.) seat — announced Thursday that he is suspending his campaign, citing a “lack of joy.”  —  “I'm writing to announce the suspension … ",
    "url": "https://thehill.com/homenews/campaign/4147739-california-democrat-suspends-congressional-campaign-due-to-lack-of-joy/"
  },
  {
    "text": "Golf legend Phil Mickelson wagered more than $1 billion over decades, lost around $100 million, gambler claims  — Star golfer Phil Mickelson bet more than $1 billion over three decades, and sustained gambling losses of close to $100 million, Billy Walters says in a new book.",
    "url": "https://www.cnbc.com/2023/08/10/golf-legend-phil-mickelson-wagered-more-than-1-billion-over-decades.html"
  },
  {
    "text": "Ecuadorian presidential candidate Fernando Villavicencio assassinated  —  Anti-corruption figure killed days before election amid sharp rise in violent and organised crime  —  The Ecuadorian presidential candidate Fernando Villavicencio has been shot dead as he left a campaign event in Quito … ",
    "url": "https://www.theguardian.com/world/2023/aug/10/ecuador-presidential-candidate-fernando-villavicencio-killed"
  },
  {
    "text": "House GOP weighs shutdown escape hatch: A deal with Dems  —  House Republicans are nearing an uncomfortable realization: They may have to rely on their opponents to help avoid a government shutdown.  —  If Speaker Kevin McCarthy has any hope of avoiding a shutdown this fall, he'll probably need help from Democrats.",
    "url": "https://www.politico.com/news/2023/08/10/house-republicans-democrats-deal-00110508"
  }
]