[
  {
    "text": "Republican Praises Protest Hecklers, Including 1 Who Made Monkey Noises At Black Woman  —  A clip from the University of Mississippi shows a white counter-protester making the noises and gestures amid students' pro-Palestinian protest on campus.  —  LOADING",
    "url": "https://www.huffpost.com/entry/university-of-mississippi-counter-protester-monkey-noises_n_6635acb9e4b0e44cfb1197cb"
  },
  {
    "text": "Politics Without Trump?  His Youngest Fans Barely Remember It.  —  Democrats call Donald J. Trump dangerous.  Republicans see him as revolutionary.  For young Trump voters, he is just normal.  —  When Donald J. Trump held a rally in Rome, Ga., in March, his audience included … ",
    "url": "https://www.nytimes.com/2024/05/04/us/politics/trump-biden-campaign-young-voters.html"
  },
  {
    "text": "Winning the super-haters  —  President Biden and former President Trump are in hot pursuit of a big — and possibly determinative — group of voters who loathe both men. … - That makes 2024 more similar to 2016 — when exit polls showed 18% of voters disliked both Trump and Hillary Clinton … ",
    "url": "https://www.axios.com/2024/05/04/double-haters-trump-biden-2024-election"
  },
  {
    "text": "Utah trolled with 4,000 hoax reports of trans bathroom ban violations within days of reporting form launch  —  HB257, which took full effect Wednesday, requires the Utah auditor's office to receive and investigate complaints when government entities don't comply with the law.",
    "url": "https://www.sltrib.com/news/politics/2024/05/03/utah-trolled-with-4000-hoax/"
  },
  {
    "text": "How Counterprotesters at U.C.L.A. Provoked Violence, Unchecked for Hours  —  The New York Times used videos filmed by journalists, witnesses and protesters to analyze hours of clashes — and a delayed police response — at a pro-Palestinian encampment on Tuesday.",
    "url": "https://www.nytimes.com/interactive/2024/05/03/us/ucla-protests-encampment-violence.html"
  },
  {
    "text": "Senior UN official says northern Gaza is now in ‘full-blown famine’  —  WASHINGTON — A top U.N. official said Friday that hard-hit northern Gaza was now in “full-blown famine” after more than six months of war between Israel and Hamas and severe Israeli restrictions on food deliveries to the Palestinian territory.",
    "url": "https://www.npr.org/2024/05/04/1249153712/united-nations-northern-gaza-famine"
  },
  {
    "text": "Republican Firebrand Ted Cruz Now Courts Democrats to Win Re-Election  —  Texas senator faces competitive contest against Colin Allred this fall  —  CYPRESS, Texas—There are two sides to Ted Cruz, the Republican senator says.  —  The self-described conservative warrior has opposed most big compromise legislation.",
    "url": "https://www.wsj.com/politics/elections/ted-cruz-texas-senate-election-strategy-313d0be3"
  },
  {
    "text": "Truth Social keeps shrinking despite the Trump trial and looming election  —  New York CNN  —  Former President Donald Trump hit the jackpot this spring when his social media company finally went public.  —  Even though Trump Media & Technology Group (DJT) generates very little revenue … ",
    "url": "https://www.cnn.com/2024/05/03/media/truth-social-stock-trump-djt/"
  },
  {
    "text": "Japan disappointed by Biden's “xenophobic” comments  —  Japan has told the United States that President Joe Biden's recent remarks describing the Asian nation as “xenophobic” were disappointing, a source close to the matter said Friday.  —  The Japanese government told the U.S. side that Biden's comments … ",
    "url": "https://english.kyodonews.net/news/2024/05/14d6da84e84d-japan-disappointed-by-bidens-xenophobic-comments.html"
  },
  {
    "text": "Democrats bracing for massive protests at party's August convention  —  As demonstrations over Gaza erupt at campuses across the country, Biden team faces prospect of chaotic scenes in Chicago.  —  As protests over the Israel-Gaza war sweep college campuses, pro-Palestinian activists … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/04/democratic-convention-protests-gaza/"
  },
  {
    "text": "Activist Groups Trained Students for Months Before Campus Protests  —  Left-wing groups and veteran demonstrators provided guidance and support before rise of pro-Palestinian encampments",
    "url": "https://www.wsj.com/us-news/education/student-campus-protests-veteran-activist-groups-17ccd094"
  },
  {
    "text": "Germany denounces rising political violence after MEP seriously hurt  —  German Interior Minister Nancy Faeser on Saturday vowed to fight a surge in violence against politicians after a German member of the European Parliament had to be taken to hospital after being attacked while campaigning for re-election.",
    "url": "https://www.reuters.com/world/europe/germany-denounces-rising-political-violence-after-mep-seriously-hurt-2024-05-04/"
  },
  {
    "text": "Kristi Noem's New Book Falsely Says She Met Kim Jong-un  —  “I'm sure he underestimated me,” Ms. Noem writes of the North Korean leader in her forthcoming book.  A spokesman said the error would be corrected.  —  The new book by Gov. Kristi Noem of South Dakota, a biography that will be released … ",
    "url": "https://www.nytimes.com/2024/05/03/us/politics/kristi-noem-book-kim-jong-un.html"
  },
  {
    "text": "Arizona GOP wins state high court appeal of sanctions for 2020 election challenge  —  The Arizona Supreme Court has reversed lower court rulings that held the Arizona Republican Party responsible for more than $27,000 in sanctions and Secretary of State office attorney fees spent defending … ",
    "url": "https://apnews.com/article/arizona-republican-2020-election-challenge-sanction-b0dede9935c87d9d8c906030bf421bc1"
  }
]