[
  {
    "text": "The Reconciliation Timeline Is Slipping as Trump Struggles to Flip Votes  —  The president told one group of House Republicans Wednesday that Congress shouldn't touch three things if they want to win elections: Medicaid, Medicare and Social Security.  — Copy",
    "url": "https://www.notus.org/congress/reconciliation-timeline-slipping-trump"
  },
  {
    "text": "Tax Cuts Now, Benefit Cuts Later: The Timeline in the Republican Megabill  —  Republicans deferred some of their most painful spending cuts until after the midterm elections.  —  At the core of Republicans' sprawling domestic policy package is an important political calculation.",
    "url": "https://www.nytimes.com/2025/07/02/us/politics/tax-cuts-benefit-cuts.html"
  },
  {
    "text": "Trump Goes on a Charm Offensive as He Woos Holdout Republicans  —  President Trump worked the phones and welcomed Republicans to the White House to cajole them into supporting his megabill.  They left with signed merchandise and photos of the Oval Office.  —  A conga line of angsty Republican … ",
    "url": "https://www.nytimes.com/2025/07/02/us/politics/trump-bill-holdout-republicans.html"
  },
  {
    "text": "Kilmar Abrego Garcia describes ‘severe beatings’ and ‘psychological torture’ in Salvadoran prison … The Salvadoran prison where Abrego was initially housed, known as the Anti-Terrorism Confinement Center or by its Spanish-language acronym CECOT, is reputed to be rife with gang violence and human rights abuses.",
    "url": "https://www.politico.com/news/2025/07/02/kilmar-abrego-garcia-salvadoran-prison-account-00438153"
  },
  {
    "text": "Kilmar Abrego Garcia says he was beaten and subjected to psychological torture in El Salvador jail  —  Kilmar Abrego Garcia said he suffered severe beatings, severe sleep deprivation and psychological torture in the notorious El Salvador prison the Trump administration had deported him to in March … ",
    "url": "https://apnews.com/article/kilmar-abrego-garcia-deportation-mistake-salvadoran-prison-40ce4ab7e93517e018715943afa0464e"
  },
  {
    "text": "Biden, in Rare Remarks Since Presidency, Warns His Accomplishments Are Coming Undone  —  Former president says European and domestic political leaders are seeking out his advice during Trump's second term  —  Joe Biden, in his lengthiest public remarks since he revealed his cancer diagnosis in May … ",
    "url": "https://www.wsj.com/politics/policy/biden-in-rare-remarks-since-presidency-warns-his-accomplishments-are-coming-undone-18c58c50"
  },
  {
    "text": "Trump allies caught off guard by Pentagon's Ukraine weapons freeze … Even allies of President Donald Trump were frustrated by the move, and accused officials such as Colby — who led a review of U.S. munitions stockpiles that preceded the freeze — of pushing the move forward without notifying the rest of the administration or others.",
    "url": "https://www.politico.com/news/2025/07/02/ukraine-weapons-freeze-elbridge-colby-00438156"
  },
  {
    "text": "Justice Dept. Explores Using Criminal Charges Against Election Officials  —  Such a path could drastically raise the stakes for federal investigations of state or county officials, bringing the department and the threat of criminalization into the election system.",
    "url": "https://www.nytimes.com/2025/07/02/us/politics/justice-department-election-data.html?unlocked_article_code=1.TU8.Ust9.wNx2U0tJzyiQ&smid=url-share"
  },
  {
    "text": "Illegal Border Crossings Plunge to Lowest Level in Decades  —  Border Patrol agents made just over 6,000 arrests in June, according to government figures, a sign that President Trump's hard-line immigration policies are working to keep people out.  —  The number of people crossing … ",
    "url": "https://www.nytimes.com/2025/07/02/us/politics/border-crossings-trump.html"
  },
  {
    "text": "Paramount betrays ‘60 Minutes’ and the rest of us  —  Parent company caves to baseless suit by Donald Trump.  —  On Nov. 3, a top lawyer for CBS News wrote to a lawyer representing Donald Trump in a baseless suit against CBS News.  “We urge your client to voluntarily dismiss the complaint … ",
    "url": "https://www.washingtonpost.com/opinions/2025/07/02/paramount-settlement-trump-betrayal/"
  },
  {
    "text": "Inside CBS News, Staffers Voice Disgust, Anger, Relief and Anxiety After Trump Settlement  —  The network's employees are angry about the $16 million ‘60 Minutes’ settlement, relieved at the lack of an apology, and nervous for what comes next under Skydance ownership.",
    "url": "https://www.hollywoodreporter.com/business/business-news/inside-cbs-news-staff-anger-60-minutes-paramount-1236304554/"
  },
  {
    "text": "Trump's Lawfare Against the Free Press  —  He suggests prosecuting CNN, while pressuring a settlement out of CBS.  —  Click for Sound  —  President Trump has taunted the media for years, and some of his jibes are deserved given the groupthink in most newsrooms.",
    "url": "https://www.wsj.com/opinion/donald-trump-lawfare-media-kristi-noem-cnn-iceblock-cbs-paramount-2ce75c5e"
  },
  {
    "text": "US contractors say their colleagues are firing live ammo as Palestinians seek food in Gaza  —  American contractors guarding aid distribution sites in Gaza are using live ammunition and stun grenades as hungry Palestinians scramble for food, according to accounts and videos obtained by The Associated Press.",
    "url": "https://apnews.com/article/palestinians-israel-gaza-contractors-aid-distribution-fe27f3ea83e06a09d66424eed7a5d56f"
  },
  {
    "text": "Swamp Thing  —  ‘Alligator Alcatraz’ sounds like a video game or thrill ride at an amusement park.  It was pitched that way in a music thumping, high energy, reality-tv style video with quick edits of people in handcuffs, military hardware, alligators and tough talk: “People get out … ",
    "url": "https://jenniferschulze.substack.com/p/swamp-thing"
  },
  {
    "text": "Intern for House Republican Ron Estes fatally shot in DC  —  A 21-year-old intern for Rep. Ron Estes (R-KS) was killed in a shooting in Washington, D.C., on Monday night.  —  The intern, Eric Tarpinian-Jachym, joined Estes's office in June.  He is a resident of Granby, Massachusetts, and is attending college at UMass Amherst.",
    "url": "https://www.washingtonexaminer.com/news/crime/3461476/intern-house-republican-ron-estes-killed-dc-shooting/"
  },
  {
    "text": "What we know about the jury's deliberations.  —  To summarize a whirlwind moment in court: Sean Combs was acquitted of the most serious counts against him, including sex trafficking.  The jury was not convinced that the women who testified were coerced into the sex marathons with male escorts at the heart of the case.",
    "url": "https://www.nytimes.com/live/2025/07/02/arts/sean-combs-diddy-trial-jury"
  },
  {
    "text": "For Democrats, Mamdani Is a Wake-Up Call—and a Bad Example  —  He shows how the party is falling short, but he has the wrong solutions.  —  Zohran Mamdani, the socialist who just won New York's Democratic mayoral primary, is a charismatic, smart and effective campaigner with whom I disagree.",
    "url": "https://www.wsj.com/opinion/for-democrats-mamdani-is-a-wake-up-call-and-a-bad-example-7e43189c?st=KqkjDk"
  },
  {
    "text": "Trump Says U.S. Has Reached Trade Deal With Vietnam  —  The president said he had agreed to initial trade terms with Vietnam, the second country to strike a limited deal after Mr. Trump threatened steep tariffs.  —  President Trump said on Wednesday that the United States had reached … ",
    "url": "https://www.nytimes.com/2025/07/02/business/economy/trump-vietnam-trade-deal.html"
  }
]