[
  {
    "text": "In Which Ian Miles Cheong Understands Trump's Campaign Better than NYT  —  The second I saw video of Vice President Harris rolling up to a hangar at Detroit's airport on Air Force Two, then alighting with Tim Walz in front of cheering crowds, I knew it would break Donald Trump's brain.",
    "url": "https://www.emptywheel.net/2024/08/12/in-which-ian-miles-cheong-understands-trumps-campaign-better-than-nyt/"
  },
  {
    "text": "Trump Can't Deal With Harris's Success  —  Kamala Harris has had as good a three-week stretch as any presidential candidate in modern American history.  —  When Joe Biden dropped out on July 21, less than a month after his catastrophic debate performance against Donald Trump … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/harris-trump/679444/"
  },
  {
    "text": "Why Donald Trump Can't Let Go of Joe Biden  —  The former president is caught in a nostalgia trap of his own making.  —  Pocket  —  With remarkable speed, the Democratic Party has embraced Kamala Harris as their presumptive nominee and moved on from Joe Biden, the party's standard-bearer since 2020 … ",
    "url": "https://www.thenation.com/article/politics/trump-biden-nostalgia-trap/"
  },
  {
    "text": "The Reintroduction of Kamala Harris  —  The soundtrack suggested a Beyoncé concert.  The light-up bracelets evoked the Eras Tour.  And the exuberant crowd—more than 14,000 strong, lining up in the rain—resembled the early days of Barack Obama.  Inside a Philadelphia arena on Aug. 6 … ",
    "url": "https://time.com/7009317/reintroduction-of-kamala-harris/"
  },
  {
    "text": "EU's Breton warns Musk on hate speech ahead of Trump interview; receives profane response  —  The European Union's digital enforcer wrote an open letter to tech mogul Elon Musk on Monday ahead of a planned interview with former United States President Donald Trump to remind him of the EU's rules on promoting hate speech.",
    "url": "https://www.politico.eu/article/eu-warns-elon-musk-hate-speech-donald-trump-interview-breton-x/"
  },
  {
    "text": "The most expensive political ad of all time  —  In 2022, Elon Musk purchased Twitter, one of the world's largest social networks, for $44 billion.  From a financial perspective, it has not worked out well.  Over the last two years, the value of Twitter — which Musk renamed X — has plunged.",
    "url": "https://popular.info/p/the-most-expensive-political-ad-of"
  },
  {
    "text": "Elon Musk's Machine for Political Violence  —  Last October, I wrote a post called “Elon Musk's Machine for Fascism,” describing how Twitter had twice served Donald Trump's electoral ambitions.  —  In 2016, trolls — including Don Jr — workshopped memes on a DM list and then used their reach to pressure MSM to adopt their narratives.",
    "url": "https://www.emptywheel.net/2024/08/12/elon-musks-machine-for-political-violence/"
  },
  {
    "text": "FBI investigating alleged campaign hack that Trump blames on Iran  —  The GOP campaign claimed this weekend that it had been hacked by Iran, leading to the compromise of a JD Vance vetting document.  —  The FBI confirmed Monday it is investigating the alleged hacking of sensitive Trump campaign documents … ",
    "url": "https://www.washingtonpost.com/national-security/2024/08/12/trump-hack-iran-fbi/"
  },
  {
    "text": "Trump campaign office in Virginia burglarized, police say  —  The Loudoun County Sheriff's Office said it's investigating whether anything was stolen, as well as the identity of the alleged suspect who was captured on surveillance video.  —  Police in a Virginia suburb of Washington, D.C. … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-campaign-office-virginia-burglarized-police-say-rcna166306"
  },
  {
    "text": "Donald Trump Is Freaked Out in Ways He Never Imagined Were Possible  —  The Harris-Walz campaign proved two important things last week.  First, it proved that sometimes all you really have to do is answer attacks—the mere fact of answering them deflates their momentum.",
    "url": "https://newrepublic.com/article/184754/donald-trump-freaked-out-harris-walz-attacks"
  },
  {
    "text": "Dozens of pregnant women, some bleeding or in labor, being turned away from ERs despite federal law  —  WASHINGTON (AP) — Bleeding and in pain, Kyleigh Thurman didn't know her doomed pregnancy could kill her.  —  Emergency room doctors at Ascension Seton Williamson in Texas handed … ",
    "url": "https://apnews.com/article/pregnant-women-emergency-room-ectopic-er-edd66276d2f6c412c988051b618fb8f9"
  },
  {
    "text": "Should You Get Another Covid Shot Now?  —  The virus is spreading, but new vaccines coming this fall could offer better protection.  We asked experts about the right time for a booster.  —  Patients keep asking Dr. Peter Chin-Hong, an infectious disease specialist at the University of California … ",
    "url": "https://www.nytimes.com/2024/08/12/well/coronavirus-vaccine-booster.html?unlocked_article_code=1.CU4.ILY9.CIpw6MLSPVRn&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Trump to sue DOJ for $100M over Mar-a-Lago raid, alleging ‘political persecution’  —  Trump attorney says ‘unconstitutional’ raid should never have been approved by Garland, Wray  —  Join Fox News for access to this content  —  EXCLUSIVE: Former President Donald Trump is set to sue … ",
    "url": "https://www.foxnews.com/politics/trump-sue-doj-100m-over-mar-a-lago-raid-alleging-political-persecution"
  },
  {
    "text": "Silver Bulletin 2024 presidential election forecast  —  All the numbers for Trump vs. Harris.  —  ∙ Paid … Let's cut to the chase: So, who's gonna win the election?  —  Well, honestly, we don't know — but we can give you our best probabilistic guess.",
    "url": "https://www.natesilver.net/p/nate-silver-2024-president-election-polls-model?triedRedirect=true"
  },
  {
    "text": "Second Photo Alleged to Show JD Vance in Drag Posted Online  —  OMG!  —  The Vance campaign has not denied that the man in drag in a viral photo was Donald Trump's 2024 presidential election running mate.  —  A second image of JD Vance allegedly dressed as a woman in a blonde wig has been posted to X, formerly known as Twitter.",
    "url": "https://www.thedailybeast.com/second-photo-alleging-to-be-jd-vance-in-drag-posted-online"
  },
  {
    "text": "US air force avoids PFAS water cleanup, citing supreme court's Chevron ruling  —  EPA says Tucson's drinking water is contaminated but air force claims agency lacks authority to order cleanup  —  The US air force is refusing to comply with an order to clean drinking water it polluted in Tucson … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/12/air-force-epa-water-pfas-tucson"
  },
  {
    "text": "Poll: Democratic attacks on JD Vance are working  —  The Scoop  —  New polling shared exclusively with Semafor shows Democrats' attacks on JD Vance's views on abortion, divorce and “childless cat ladies” are sticking with voters.  —  A pair of surveys by Blueprint, the centrist Democratic pollster backed … ",
    "url": "https://www.semafor.com/article/08/12/2024/poll-democratic-attacks-on-jd-vance-are-working"
  },
  {
    "text": "Betsy DeVos would consider working with Trump again — under one condition  —  Donald Trump's former education secretary Betsy DeVos has changed her mind on serving in his administration if he wins re-election.  —  DeVos resigned on Jan. 7, 2021, following the U.S. Capitol riot, which she called … ",
    "url": "https://www.rawstory.com/betsy-devos-2668949091/"
  },
  {
    "text": "Two Illegals Allegedly Rape Woman in Coney Island Near Migrant Hotel  —  On Sunday night, a woman was raped at knifepoint in Coney Island.  The two suspects are alleged to be two illegals from Nicaragua and Mexico.  —  According to police, the attack took place outside a hotel housing asylum seekers … ",
    "url": "https://www.thegatewaypundit.com/2024/08/two-illegals-allegedly-rape-woman-coney-island-near/"
  },
  {
    "text": "Broadcast news and major papers failed to cover report of possible Egyptian bribery involving Trump  —  NBC, ABC, CBS, as well as the LA Times, USA Today, and Wall Street Journal, all ignored the reporting … According to an August 2 report in The Washington Post, the U.S. Department … ",
    "url": "https://www.mediamatters.org/donald-trump/broadcast-news-and-major-papers-failed-cover-report-possible-egyptian-bribery"
  },
  {
    "text": "Senior investigator of House Foreign Affairs Committee resigns over committee's ‘disappointing lack of courage’  —  A senior investigator at the House Foreign Affairs Committee has resigned over what he says is Chairman Michael McCaul's (R-TX) failure “to seek answers & accountability” … ",
    "url": "https://www.washingtonexaminer.com/news/house/3118289/senior-investigator-foreign-affairs-committee-resigns-committees-lack-courage/"
  }
]