[
  {
    "text": "Donald Trump has a big problem ahead  —  A whole swath of GOP voters appears firmly committed to not voting for Trump in November.  —  Donald Trump has a problem no matter what happens in New Hampshire on Tuesday night: There's a whole swath of the Republican electorate and a good chunk … ",
    "url": "https://www.politico.com/news/2024/01/23/trump-moderate-republicans-problem-00137112"
  },
  {
    "text": "Elise Stefanik's Deranged Defense of Trump Offers Democrats a Lesson  —  When it comes to Donald Trump's legal travails, there are two general schools of thought among Democrats.  In one, a jury's finding that Trump is liable for sexually abusing E. Jean Carroll—and his pending trials … ",
    "url": "https://newrepublic.com/article/178320/elise-stefanik-deranged-defense-trump-democrats-lesson"
  },
  {
    "text": "Former Trump Aide Says Ex-President's Recent Fumbles Are ‘Concerning’  —  “I think it's fair to question his mental acuity,” said Sarah Matthews, Trump's former deputy press secretary.  —  LOADING  —  Sarah Matthews, who served as White House deputy press secretary under Donald Trump … ",
    "url": "https://www.huffpost.com/entry/sarah-matthews-trump-gaffes_n_65afc83ce4b09e7f5b9d3147"
  },
  {
    "text": "Farah Griffin says Trump victory in NH would be ‘bad for America’  —  Alyssa Farah Griffin, a co-host of ABC's “The View,” offered a stark warning for New Hampshire primary voters Tuesday, arguing a victory for former President Trump would “be bad for America.”",
    "url": "https://thehill.com/homenews/campaign/4424476-farah-griffin-trump-victory-nh-bad-for-america/"
  },
  {
    "text": "Trump's surprise fan club: Why many Dems want him to win big in N.H. … Many Democrats are rooting for the same thing. … - The president's campaign has internal data indicating that most of the undecided voters Biden is targeting don't think Trump will be the Republican nominee … ",
    "url": "https://www.axios.com/2024/01/23/why-many-dems-want-trump-win-new-hampshire"
  },
  {
    "text": "Florida insiders fear vengeful DeSantis will ‘burn it all down’  —  Many wonder if he'll seek political vengeance against people he views as disloyal.  —  TALLAHASSEE, Florida — Ron DeSantis is out of the Republican presidential race.  But in Florida, his second term as governor has only just gotten started.",
    "url": "https://www.politico.com/news/2024/01/23/florida-desantis-next-vengeance-00137239"
  },
  {
    "text": "Florida plan to have taxpayers pay Trump's legal bills nixed after DeSantis veto threat  —  DeSantis suggested he would veto the proposal.  —  TALLAHASSEE, Florida — A push by some Florida Republicans to use taxpayer money to help pay for former President Donald Trump's multiple legal … ",
    "url": "https://www.politico.com/news/2024/01/22/florida-trump-legal-bills-00136984"
  },
  {
    "text": "Charles Osgood, veteran CBS newsman and longtime host of “Sunday Morning,” dies at 91  —  Award-winning journalist Charles Osgood, who anchored “CBS Sunday Morning” for 22 years and was host of the long-running radio program “The Osgood File,” died Tuesday at home in New Jersey.  He was 91.",
    "url": "https://www.cbsnews.com/news/charles-osgood-veteran-cbs-newsman-and-longtime-host-of-sunday-morning-dies-at-91/"
  },
  {
    "text": "How One New Hampshire Voter and One Politico Journalist Refused to Hold “a Pig ... a Womanizer ...  [an] Arrogant Asshole” Accountable  —  Politico has an interesting profile of a two-time Obama voter, who will today become a three-time Trump voter, New Hampshire voter Ted Johnson.",
    "url": "https://www.emptywheel.net/2024/01/23/how-one-new-hampshire-voter-and-one-politico-journalist-refused-to-hold-a-pig-a-womanizer-an-arrogant-asshole-accountable/"
  },
  {
    "text": "No Labels Sued by Durst Family Members Claiming Breach of Contract  —  Two members of the Durst real estate family are suing the centrist political group No Labels, saying its pursuit of a possible third-party presidential bid is a breach of contract.  —  Two members of the powerful Durst … ",
    "url": "https://www.nytimes.com/2024/01/23/us/politics/durst-no-labels-lawsuit-election-donors.html"
  },
  {
    "text": "House ethics probe into Rep. Matt Gaetz picks up steam with new witnesses contacted: Sources  —  The DOJ last year declined to bring charges against Gaetz following its probe.  —  Rep. Matt Gaetz greets supporters at the New Hampshire campaign headquarters of former President Donald Trump in Manchester, NH, Jan. 21, 2024.",
    "url": "https://abcnews.go.com/US/gaetz-house-ethics-probe-picks-steam-new-witnesses/story?id=106600322"
  },
  {
    "text": "What counts as a win for Biden in New Hampshire's unprecedented primary?  —  Biden supporters and detractors alike have been trying to set expectations in a primary that won't officially count and has no clear benchmarks.  —  MANCHESTER, N.H. — What counts as a good outcome for President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/2024-election/counts-win-joe-biden-new-hampshires-unprecedented-primary-rcna135153"
  },
  {
    "text": "Putin aide mocks CIA video recruiting Russian double agents  —  The Kremlin's press secretary mocked the CIA on Tuesday after the agency posted a Russian-language video attempting to recruit spies.  —  Dmitry Peskov joked that the video, posted to X, the platform formerly known as Twitter … ",
    "url": "https://thehill.com/policy/international/4424334-putin-cia-recruiting-russian-spies-ukraine/"
  },
  {
    "text": "Chip Roy urges Texas officials to ignore Supreme Court order on border razor wire: ‘Go to hell’  —  Roy called the Supreme Court's 5-4 decision ‘unconscionable’  —  Join Fox News for access to this content  —  Plus get unlimited access to thousands of articles, videos and more with your free account!",
    "url": "https://www.foxnews.com/politics/chip-roy-urges-texas-officials-ignore-supreme-court-order-border-razor-wire-go-hell"
  },
  {
    "text": "Alaska Airlines CEO: We found ‘many’ loose bolts on our Max 9s following near-disaster  —  “I'm angry,” said Alaska CEO Ben Minicucci.  “This happened to Alaska Airlines.  It happened to our guests and happened to our our people.”  —  The CEO of Alaska Airlines said new … ",
    "url": "https://www.nbcnews.com/business/business-news/alaska-airlines-found-more-loose-bolts-boeing-737-max-9-ceo-says-rcna135316"
  },
  {
    "text": "Republican Dan Frei announces primary challenge against Bacon  —  Former GOP congressional candidate Dan Frei is launching a primary bid against Rep. Don Bacon (R) in Nebraska's 2nd Congressional District, he announced Tuesday.  —  News of Frei's bid, which was first shared with The Hill … ",
    "url": "https://thehill.com/homenews/campaign/4424335-republican-dan-frei-primary-challenge-don-bacon/"
  },
  {
    "text": "Doomsday Clock time update says humanity is as close as ever to global catastrophe  —  We're still as close as ever to global catastrophe, according to the annual update of the Doomsday Clock, announced Tuesday morning.  —  The time on the symbolic clock is the same as last year … ",
    "url": "https://www.usatoday.com/story/news/nation/2024/01/23/doomsday-clock-announcement-2024/72311076007/"
  }
]