[
  {
    "text": "President Trump's mindless tariffs will cause economic havoc  —  But the rest of the world can limit the damage  —  If you failed to spot America being “looted, pillaged, raped and plundered by nations near and far” or it being cruelly denied a “turn to prosper”, then congratulations … ",
    "url": "https://www.economist.com/leaders/2025/04/03/president-trumps-mindless-tariffs-will-cause-economic-havoc"
  },
  {
    "text": "Will Malignant Stupidity Kill the World Economy?  —  A quick thank you to my readers.  When I struck out on my own, I wasn't sure if anyone would follow.  But I just passed 300K subscribers.  I'll try to be worthy of your support.  —  America created the modern world trading system.",
    "url": "https://paulkrugman.substack.com/p/will-careless-stupidity-kill-the"
  },
  {
    "text": "Trump Jets Off to Watch Golf as U.S. Economy Goes Up in Flames  —  TRUMPENOMICS  —  The stock market is in free fall, but the president is headed to Florida.  —  President Donald Trump's response to a tanking U.S. stock market—brought on by his sweeping tariff announcement Wednesday—is to fly to Florida.",
    "url": "https://www.thedailybeast.com/trump-jets-off-to-watch-golf-as-us-economy-goes-up-in-flames/"
  },
  {
    "text": "They're Not Tariffs, They're Sanctions  —  Stop trying to place coherence on a policy that's really just a mob boss breaking legs and asking for protection money.  —  President Donald Trump departs after signing an executive order on tariffs in the Rose Garden at the White House, April 2, 2025, in Washington.",
    "url": "https://prospect.org/economy/2025-04-03-theyre-not-tariffs-theyre-sanctions/"
  },
  {
    "text": "Trump's New Protectionist Age  —  Blowing up the world trading system has consequences that the President isn't advertising.  —  President Trump unveiled his new “liberation day” tariffs on Wednesday, and they are another large step toward a new old era of trade protectionism.",
    "url": "https://www.wsj.com/opinion/donald-trump-liberation-day-tariffs-protectionism-82d0aa3a"
  },
  {
    "text": "White House fires three NSC staffers after president meets with far-right activist Laura Loomer  —  The White House has fired at least three National Security Council staffers, three sources familiar with the move told CNN.  —  The firings came after Laura Loomer, the far-right activist … ",
    "url": "https://cnn.com/2025/04/03/politics/nsc-firings-trump-laura-loomer-meeting/"
  },
  {
    "text": "In Oval Office Meeting, Far-Right Activist Pushes Trump to Fire National Security Staff  —  During the 30-minute meeting, Laura Loomer excoriated National Security Council officials in front of the president and Michael Waltz, the national security adviser.  —  Laura Loomer, the far-right activist … ",
    "url": "https://www.nytimes.com/2025/04/03/us/politics/trump-meeting-laura-loomer.html"
  },
  {
    "text": "Scoop: Multiple firings on Trump's National Security Council after Loomer visit  —  Several members of President Trump's embattled National Security Council have been fired, a U.S. official and a second source familiar told Axios on Thursday.  —  Why it matters: The firings come … ",
    "url": "https://www.axios.com/2025/04/03/trump-laura-loomer-fire-national-security-council"
  },
  {
    "text": "Trump Administration Live Updates: Security Officials Said to Be Fired at Conspiracy Theorist's Urging  —  Where Things Stand  — Security officials fired: President Trump fired at least three senior National Security Council officials at the urging of the far-right conspiracy theorist Laura Loomer … ",
    "url": "https://www.nytimes.com/live/2025/04/03/us/trump-news-updates?unlocked_article_code=1.804.-QBa.8EPrp3uBV0sn&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Fires NatSec Officials After Meeting With Far-Right Conspiracy Theorist  —  Laura Loomer is “not even on staff and calling more shots than some actual officials,” one Trump official told Rolling Stone  —  President Trump has fired six National Security Council staffers … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-fires-natsec-officials-meeting-laura-loomer-1235310177/"
  },
  {
    "text": "Top Republican leads bill to reassert Congress' tariff power amid Trump trade war  —  Sen. Chuck Grassley, a senior Republican lawmaker from the farm-heavy state of Iowa, is spearheading new legislation that would reassert Congress' authority over tariffs amid President Donald Trump's trade war escalation.",
    "url": "https://www.politico.com/live-updates/2025/04/03/congress/top-republican-leads-bill-to-reassert-congress-tariff-power-amid-trump-trade-war-00268710"
  },
  {
    "text": "Trump Administration Threatens to Withhold Funds From Public Schools  —  State education officials will be required to verify that they have eliminated all programs that promote diversity, equity and inclusion that the administration deems unlawful, according to a new memo.",
    "url": "https://www.nytimes.com/2025/04/03/us/politics/public-school-funding-trump-dei.html"
  },
  {
    "text": "Pentagon's watchdog to review Hegseth's use of Signal app to convey plans for Houthi strike  —  The Pentagon's acting inspector general announced Thursday that he would review Defense Secretary Pete Hegseth's use of the Signal messaging app to convey plans for a military strike against Houthi militants in Yemen.",
    "url": "https://apnews.com/article/hegseth-signal-messaging-app-attack-plans-f8581bcb447b91d2e7f9cb7809ae0f06"
  },
  {
    "text": "Stellantis idles plants in Mexico and Canada due to tariffs … DETROIT — Stellantis is pausing production at two assembly plants in Canada and Mexico as the company attempts to navigate President Donald Trump's new round of 25% automotive tariffs that took effect Thursday.",
    "url": "https://www.cnbc.com/2025/04/03/stellantis-idles-plants-in-mexico-and-canada-due-to-tariffs.html"
  },
  {
    "text": "‘Beware a dollar confidence crisis’ — DB  —  Taking another look at the puzzling greenback puke  —  There's a lot going on at the moment, but the most interesting might be how the dollar has been absolutely tanked by yesterday's tariff news.  —  The DXY dollar index has plunged 1.7 per cent today … ",
    "url": "https://www.ft.com/content/7664bc1e-9551-430d-b64b-ccae1b7d1916"
  },
  {
    "text": "Dow drops 1,400 as US stocks lead worldwide sell-off after Trump's tariffs ignite a COVID-like shock  —  Financial markets around the world are reeling Thursday following President Donald Trump's latest and most severe set of tariffs, and the U.S. stock market is taking the worst of it so far.",
    "url": "https://apnews.com/article/stocks-markets-rates-tariffs-52dbb020a4c41122e31669c2da236d67"
  },
  {
    "text": "RFK Jr. cuts CDC labs investigating outbreaks of STDs and hepatitis  —  Health and Human Services Secretary Robert F. Kennedy Jr. has eliminated the Centers for Disease Control and Prevention's laboratories for sexually transmitted diseases and hepatitis, multiple officials tell CBS News, disrupting ongoing work to respond to outbreaks.",
    "url": "https://www.cbsnews.com/news/rfk-jr-cdc-labs-stds-hepatitis/"
  },
  {
    "text": "Adams to skip New York City's Democratic primary, run for reelection on nonpartisan line  —  The mayor has been at odds with his party and wants time to recover from now-dismissed federal charges.  —  NEW YORK — Mayor Eric Adams is opting out of New York City's Democratic primary and running … ",
    "url": "https://www.politico.com/news/2025/04/03/eric-adams-reelection-independent-00267865"
  },
  {
    "text": "Liberation Day: How Trump's Tariff Strategy Will Reset the Global Order (Sources)  —  German police get deep into a murder investigation before the case takes a twist not even Sherlock Holmes could see coming.  A stabbing death in Frisco goes largely uncovered by the mainstream media, and we think you know the reason.",
    "url": "https://www.louderwithcrowder.com/sources-april-3-2025"
  },
  {
    "text": "The U.S. Agency for Global Media Was Working  —  I know because I was appointed to the board overseeing the parent organization for Voice of America and other crucial outlets.  Congress needs to hold hearings on what to do now.  —  Fifty years ago, I sat in a classroom at Stanford University … ",
    "url": "https://washingtonmonthly.com/2025/04/03/the-u-s-agency-for-global-media-was-working/"
  }
]