[
  {
    "text": "D.E.A. Says More Than 100 Undocumented Immigrants Were Detained in a Colorado Raid  —  Officials said agents found weapons and illicit drugs inside the nightclub, including cocaine, methamphetamine and a mixture of powdered drugs known as pink cocaine.  —  Federal agents raided … ",
    "url": "https://www.nytimes.com/2025/04/27/us/politics/immigrants-colorado-raid-dea.html"
  },
  {
    "text": "Over 100 immigrants arrested in raid on underground Colorado nightclub where active-duty military members worked, feds say  —  More than 100 immigrants, allegedly in the country illegally, were detained in Colorado Springs after an overnight raid at what authorities described as an underground nightclub in a strip mall.",
    "url": "https://cnn.com/2025/04/27/us/colorado-springs-ice-raid-club"
  },
  {
    "text": "Trump is softening his tariff talk.  But the damage may already be done.  —  The economic effects of new trade wars could be hard to dodge even if talks yield new deals soon.  —  With 14 months remaining before the United States' 250th birthday on July 4, 2026, Stacy Blake should be placing big orders … ",
    "url": "https://www.washingtonpost.com/business/2025/04/27/trump-tariffs-us-economy/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NzI2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MTA4Nzk5LCJpYXQiOjE3NDU3MjY0MDAsImp0aSI6ImIxZDgxODFhLWQ5ZWItNDg4YS1hMzBhLTcxOTRhMTBhMmZmNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzA0LzI3L3RydW1wLXRhcmlmZnMtdXMtZWNvbm9teS8ifQ.AFsxxt-AEgGDofKnlVFLIlGGsZtUyGeOExVBICiMSsM&itid=gfta"
  },
  {
    "text": "The group chats that changed America  —  THE SCOOP  —  Last Thursday morning, a bit before 10 am in Austin and nearly 11 pm in Singapore, Joe Lonsdale had enough of Balaji Srinivasan's views on China.  —  “This is insane CCP thinking,” Lonsdale, a co-founder of Palantir, wrote to a 300-member Signal group.",
    "url": "https://www.semafor.com/article/04/27/2025/the-group-chats-that-changed-america"
  },
  {
    "text": "Elite Universities Form Private Collective to Resist Trump Administration  —  Separate from the public dissent, a group of school leaders are strategizing behind the scenes about how to respond and push back against the White House  —  Leaders of some of the nation's most prestigious universities … ",
    "url": "https://www.wsj.com/us-news/education/elite-universities-form-private-collective-to-resist-trump-administration-95a14ff3?st=wkgzD3&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Cory Booker and Hakeem Jeffries Are Sitting in to Stand up for Medicaid  —  The lawmakers are having “An Urgent Conversation with the American People” on the Capitol steps to oppose Republican plans to cut public healthcare benefits  —  Sen. Cory Booker and House Minority Leader Hakeem Jeffries … ",
    "url": "https://www.rollingstone.com/politics/politics-news/booker-jeffries-capitol-sit-in-medicaid-1235326047/"
  },
  {
    "text": "American Panopticon  —  The Trump administration is pooling data on Americans.  Experts fear what comes next.  —  If you have tips about DOGE and its data collection, you can contact Ian and Charlie on Signal at @ibogost.47 and @cwarzel.92.  —  If you were tasked with building a panopticon … ",
    "url": "https://www.theatlantic.com/technology/archive/2025/04/american-panopticon/682616/?gift=guxsrl_dAdXUP9zqbQPWxc3WqSyzCi3gasJ-au_BC9g&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "On DOGE, Directives, and DOJ  —  A new court filing reveals the most compelling evidence yet that the government has been spinning a fiction about DOGE in federal court.  —  @annabower.bsky.social  —  Meet The Authors … “US DOGE service advises and consults,” said Kendall Lindemann … ",
    "url": "https://www.lawfaremedia.org/article/on-doge--directives--and-doj"
  },
  {
    "text": "‘60 Minutes’ Calls Out Paramount for Executive Producer's Exit in Rare On-Air Rebuke  —  All seemed normal in the first 98% of Sunday's broadcast of “60 Minutes” on CBS.  But the remaining 2% may have shocked viewers.  —  In the show's “Last Minute” segment, correspondent Scott Pelley told … ",
    "url": "https://variety.com/2025/tv/news/60-minutes-scott-pelley-rebukes-paramount-bill-owens-exit-1236379735/"
  },
  {
    "text": "Trump Says He's Restoring Columbus Day to Its Former Prominence  —  President Donald Trump pledged to boost the status of Columbus Day, stoking a conflict with activists and some US states that argue the day should honor indigenous Americans rather than the Italian explorer's legacy.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-27/trump-says-he-s-restoring-columbus-day-to-its-former-prominence"
  },
  {
    "text": "Rubio Says Trump Will Decide This Week on Continuing Ukraine War Talks  —  Secretary of State Marco Rubio said there are reasons to be optimistic, but also asserted there are “other issues” on which the administration wants to spend its energy.  —  Secretary of State Marco Rubio said Sunday … ",
    "url": "https://www.nytimes.com/2025/04/27/us/politics/trump-ukraine-rubio-zelensky-putin.html"
  },
  {
    "text": "Sen. Bernie Sanders says Democrats lack ‘vision for the future’: Full interview  —  In an exclusive interview with Meet the Press, Sen. Bernie Sanders (I-Vt.) says he and Rep. Alexandria Ocasio-Cortez (D-N.Y.) are trying to “strengthen democracy” rather than start a third party as they traverse … ",
    "url": "https://www.nbcnews.com/meet-the-press/video/sen-bernie-sanders-says-democrats-lack-vision-for-the-future-full-interview-238425157563"
  },
  {
    "text": "Trump officials deny U.S. citizen children were ‘deported’ to Honduras  —  The children's removals have intensified concerns about whether the administration is violating the rights of citizens and noncitizens.  —  Tom Homan, President Donald Trump's border czar, insisted Sunday … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/27/trump-deportation-citizens-children/"
  },
  {
    "text": "Donald Trump Is Selling the White House to the Highest Bidder  — He turned a legitimate federal employee designation into a loophole.  By giving senior officials such as Elon Musk the title “special government employee,” Mr. Trump avoided requirements that they publicly disclose … ",
    "url": "https://www.nytimes.com/2025/04/27/opinion/trump-crypto-musk-spacex.html?unlocked_article_code=1.C08.DiVY.2LGUGa4tIpc2&smid=bs-share"
  },
  {
    "text": "Trump's team brushes off economic concerns ahead of 100-day mark  —  Facing troubling polling, the White House insists tariffs and trade talks will pay off for Americans.  —  As President Donald Trump nears the 100th day of his second term, members of his administration are brushing off … ",
    "url": "https://www.politico.com/news/2025/04/27/trump-polling-economic-concerns-00311974"
  },
  {
    "text": "Justice Department halts funds for programs for victims of hate crimes, child abuse, school violence and more  —  CBS News has obtained a list of 365 federal grant programs halted this week by the Justice Department, disrupting programs to help victims of hate crime and sex trafficking, children who've suffered violence, and refugees.",
    "url": "https://www.cbsnews.com/news/federal-grants-halted-justice-department-hate-crime-sex-trafficking-refugees/"
  },
  {
    "text": "Transcript: Gary Cohn on “Face the Nation with Margaret Brennan,” April 27, 2025  —  The following is the transcript of an interview with Gary Cohn, IBM vice chairman and former director of the U.S. National Economic Council, that aired on “Face the Nation with Margaret Brennan” on April 27, 2025.",
    "url": "https://www.cbsnews.com/news/gary-cohn-ibm-face-the-nation-transcript-04-27-2025/"
  },
  {
    "text": "April 27, 2025, Statement on the Arrest of Suspects Allegedly Linked to DHS Secretary Robbery  —  Published By U.S. Secret Service Media Relations  —  WASHINGTON, D.C.  —  Special Agent in Charge of the Secret Service Washington Field Office Matt McCool released the following the statement:",
    "url": "https://www.secretservice.gov/newsroom/releases/2025/04/april-27-2025-statement-arrest-suspects-allegedly-linked-dhs-secretary"
  },
  {
    "text": "Irish woman living legally in US for decades detained after visiting her father in Ireland  —  Cliona Ward (54) lives in California but is being held in a large immigration prison in Washington state  —  An Irish woman who has been living legally in the United States for decades has been taken … ",
    "url": "https://www.irishtimes.com/crime-law/2025/04/27/irish-woman-living-legally-in-us-for-decades-detained-after-returning-from-visit-to-ireland-to-see-her-father/"
  },
  {
    "text": "This Weekend in Politics, Bulletin 119  —  ... AG Pam Bondi is going to start locking up journalists: “Safeguarding classified, privileged, and other sensitive information is essential to effective governance and law enforcement.  Fed govt employees intentionally leaking sensitive information … ",
    "url": "https://www.meidasplus.com/p/this-weekend-in-politics-bulletin-83b"
  },
  {
    "text": "ICE promises bystanders who challenged Charlottesville raid will be prosecuted  —  After ICE raided a downtown Charlottesville courthouse and arrested two men, the federal agency is promising to prosecute the bystanders who challenged their authority.  —  ×  —  Week in Virginia",
    "url": "https://dailyprogress.com/news/local/crime-courts/article_e6ce6e4a-4161-476f-8d28-94150a891092.html"
  },
  {
    "text": "'I don't know if President Trump has spoken with President Xi': Secretary Bessent  —  ABC News' Martha Raddatz interviews Treasury Secretary Scott Bessent on “This Week.”",
    "url": "https://abcnews.go.com/ThisWeek/video/1-1-treasury-secretary-scott-bessent-121212194"
  },
  {
    "text": "The Missteps That Led to a Fatal Plane Crash at Reagan National Airport … As they flew south along the Potomac River on the gusty night of Jan. 29, the crew aboard an Army Black Hawk helicopter attempted to execute a common aviation practice.  It would play a role in ending their lives.",
    "url": "https://www.nytimes.com/2025/04/27/business/dc-plane-crash-reagan-airport.html"
  }
]