[
  {
    "text": "Trump campaign casts fresh doubt on September debate with Harris over microphone dispute  —  Former President Donald Trump's campaign is casting fresh doubt on whether a September 10 debate will take place on ABC amid a dispute over the rules, a source familiar with the matter tells CNN.",
    "url": "https://www.cnn.com/2024/08/26/politics/trump-harris-september-debate"
  },
  {
    "text": "Finally, the Democrats Have Found Trump's Achilles' Heel: Ridicule Him  —  Donald Trump is in free fall.  Read this description from Sunday's Washington Post of how the GOP nominee spent last week: “[A]ides did not want a situation where he was watching the convention every night, getting angry … ",
    "url": "https://newrepublic.com/article/185270/democrats-harris-trump-achilles-heel-ridicule"
  },
  {
    "text": "Is this thing on?  Harris and Trump battle over hot mics at debate.  —  Negotiations over the Sept. 10 spectacle have hit an impasse over whether to leave the microphones on.  —  With just 15 days left until the scheduled Sept. 10 presidential debate between Vice President Kamala Harris … ",
    "url": "https://www.politico.com/news/2024/08/26/kamala-harris-donald-trump-debate-abc-microphones-00176294"
  },
  {
    "text": "Playbook: Scoop: The secret debate about the Trump-Harris debate  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  SCOOP: IS THIS THING ON?  — Last night, former President DONALD TRUMP posted on Truth Social, tearing into ABC News for a “This Week” … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/26/scoop-the-secret-debate-about-the-trump-harris-debate-00176296"
  },
  {
    "text": "Trump Can Win on Character  —  With the defenestration of Joe Biden and the ascent of Kamala Harris, conventional wisdom has gone from asking, “How can Donald Trump lose?” to, “How can he win?”  —  It's basically a tossup race, but a successful Harris rollout and convention … ",
    "url": "https://www.nytimes.com/2024/08/26/opinion/advice-for-trump-win.html?unlocked_article_code=1.F04.cXyO.TvoG0z6u3iWU&smid=url-share"
  },
  {
    "text": "Trump suggests he might skip ABC debate with Harris  —  The Sept. 10 debate with ABC is the only one both campaigns have agreed to do with one of the major networks.  —  Former president Donald Trump suggested Sunday evening that he might skip a Sept. 10 ABC News debate with Vice President Kamala Harris … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/26/trump-harris-debate-abc/"
  },
  {
    "text": "“He's now terrified of debating her”: Trump's debate flip-flop is a sign Harris has him figured out  —  The former president suggested Sunday that he would not attend his scheduled Sept. 10 debate with Kamala Harris  —  Donald Trump is not feeling great.  This year alone he's been found liable … ",
    "url": "https://www.salon.com/2024/08/26/hes-now-terrified-of-debating-her-debate-flip-flop-is-a-sign-harris-has-him-figured-out/"
  },
  {
    "text": "Michelle Obama's secret feud with Biden... what Nancy Pelosi thinks of Kamala Harris... and why the president was left physically shaking: EMILY GOODIN's dispatch reveals what REALLY went down at the DNC  —  As Joe Biden disembarked Air Force One in the early hours of Tuesday morning in California last week, he was visibly shaking.",
    "url": "https://www.dailymail.co.uk/news/article-13778321/Michelle-Obama-feud-Biden-Kamala-Harris-DNC.html"
  },
  {
    "text": "Are Trump's campaign rallies energizing his base - or sowing doubt?  —  Given rambling speeches and personal attacks over policy talk, supporters wonder if events do more harm than good  —  As Donald Trump emerged to a thunderous roar of approval in the heart of Pennsylvania's Rust belt … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/26/trumps-campaign-rallies-harmful-or-helpful"
  },
  {
    "text": "The Proud Boys' Reliance on Telegram Didn't Save Them, But It Thwarted Preventing the Attack  —  At 8:06PM on January 4, 2021, shortly after the arrest of Enrique Tarrio, a Proud Boy named Travis instructed everyone on the Proud Boys' Ministry of Self Defense Telegram list to “nuke everything.”",
    "url": "https://www.emptywheel.net/2024/08/26/the-proud-boys-reliance-on-telegram-didnt-save-them-but-it-thwarted-preventing-the-attack/"
  },
  {
    "text": "Japan says it scrambled fighter jets after Chinese spy plane violated its airspace  —  Japan said it scrambled fighter jets on Monday after a Chinese military aircraft violated its airspace in a further escalation of regional tensions.  The incident comes just weeks after the U.S. military … ",
    "url": "https://www.cbsnews.com/news/japan-scrambles-jets-china-spy-plane-violates-airspace/"
  },
  {
    "text": "They Served With Trump and Saw the Crazy.  They Should Endorse Harris.  —  THE MOMENT FROM THE DEMOCRATIC CONVENTION I kept coming back to this weekend wasn't from Oprah or the Obamas, Steph or Steve, Kamala or Doug—not even Gus Walz, America's proudest son.",
    "url": "https://www.thebulwark.com/p/republicans-who-served-with-trump-and-saw-the-crazy-should-endorse-kamala-harris"
  },
  {
    "text": "Kamala Harris Has Left the Building  —  Gail Collins: Bret, I can't wait to hear your impression of Kamala Harris's big Chicago speech.  Tell, tell.  —  Bret Stephens: As rhetoric?  I thought it was strong.  She told Americans who she was, where she came from, what her values and dreams are made of … ",
    "url": "https://www.nytimes.com/2024/08/26/opinion/harris-walz-democratic-convention.html"
  },
  {
    "text": "The Unequal Effects of School Closings  —  As more families opt for charter and private schools or homeschooling in the wake of the pandemic, cities around the country are shuttering schools.  The effects fall hardest on majority-Black schools and special-needs students.  —  Co-published with The New Yorker",
    "url": "https://www.propublica.org/article/school-closures-students-charter-schools-home-schooling-rochester"
  },
  {
    "text": "Cornel West Courts Anti-Vax Voters After RFK Jr. Drops Out  —  A BIT OBVIOUS  —  Independent presidential candidate Cornel West seems to see an opening in the field after Robert F. Kennedy Jr. dropped his bid for the office this past week.  In what appeared to be a blatant play for RFK Jr.'s supporters … ",
    "url": "https://www.thedailybeast.com/cornel-west-courts-anti-vax-voters-after-rfk-jr-drops-out"
  },
  {
    "text": "Biden mourns US service members killed in Kabul airport attack 3 years ago  —  President Biden mourned the three-year anniversary of the terrorist attack at the Kabul airport, when 13 U.S. service members were killed.  —  He named the 13 service members in a statement on Monday … ",
    "url": "https://thehill.com/homenews/administration/4847503-biden-honors-afghanistan-attack-anniversary/"
  },
  {
    "text": "Meet the megadonors pumping millions into the 2024 election  —  The 50 biggest donors this cycle have collectively pumped $1.5 billion into political committees and other groups competing in the election, according to a Washington Post analysis of Federal Election Commission data.",
    "url": "https://www.washingtonpost.com/elections/interactive/2024/biggest-campaign-donors-election-2024/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI0NjQ0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2MDI3MTk5LCJpYXQiOjE3MjQ2NDQ4MDAsImp0aSI6Ijk3NmZiYTVkLWU4ZDgtNGVjZC1iZWZhLWJmYjU1ZWI2OGQ4OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lbGVjdGlvbnMvaW50ZXJhY3RpdmUvMjAyNC9iaWdnZXN0LWNhbXBhaWduLWRvbm9ycy1lbGVjdGlvbi0yMDI0LyJ9.MF7AZpm-FyvjoJvaIGdDJrgQghac8j_1skYgqh0sOpo&itid=gfta"
  },
  {
    "text": "The Man Who Will Do Anything for Trump  —  Why Kash Patel is exactly the kind of person who would serve in a second Trump administration  —  kash patel was dangerous.  On this both Trump appointees and career officials could agree.  —  A 40-year-old lawyer with little government experience … ",
    "url": "https://www.theatlantic.com/magazine/archive/2024/10/kash-patel-trump-national-security-council/679566/?gift=guxsrl_dAdXUP9zqbQPWxUTFY-P5GrITPPtq0i0w0s8&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump visits Arlington Cemetery to mark Afghanistan withdrawal anniversary  —  Former President Trump on Monday visited Arlington National Cemetery to mark the three-year anniversary of the U.S. withdrawal from Afghanistan as he sought to turn the chaotic pull out into a resonant line of attack against Vice President Harris.",
    "url": "https://thehill.com/homenews/campaign/4847537-trump-arlington-cemetery-afghanistan-anniversary/"
  }
]