[
  {
    "text": "‘Visible cringe’: Serviceman scowls amid Trump rant on 'people who don't speak languages'  —  A serviceman standing behind Donald Trump at a border town press conference Thursday was seen scowling as the former president ranted against “people who don't speak languages.”",
    "url": "https://www.rawstory.com/trump-s-language/"
  },
  {
    "text": "Trump pushes Steve Daines to succeed McConnell as GOP's Senate leader … - Trump, is consolidating his power over the GOP and Republicans in Congress, and his blessing — along with a triumphant November election — could position Daines for the Senate leadership job when the new Congress starts in January.",
    "url": "https://www.axios.com/2024/02/29/trump-pushes-steve-daines-mcconnell-successor-senate"
  },
  {
    "text": "Thoughts on the Supreme Court's Massive Gift to Trump  —  Delaying the January 6th trial means Trump may never face accountability for his crimes  —  Thanks to the shenanigans of Mitch McConnell, Donald Trump appointed three justices to the Supreme Court.  Yesterday, the MAGA justices thanked Trump … ",
    "url": "https://www.messageboxnews.com/p/thoughts-on-the-supreme-courts-massive"
  },
  {
    "text": "Supreme Court narrows the lens as it takes up Trump's immunity claim  —  In agreeing to hear the case, the court made it clear that it will focus on specifics of when a former president might be able to claim immunity for official acts taken in office.  —  WASHINGTON — As former President … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-narrows-lens-takes-trumps-immunity-claim-rcna141155"
  },
  {
    "text": "“Join me,” Biden tells Trump … - “Instead of telling members of Congress to block this legislation, join me,” Biden said in Brownsville, Texas.  — Biden prodded House Republicans to “show a little spine” and take up the Senate border deal they helped torpedo earlier this year.",
    "url": "https://www.axios.com/2024/03/01/biden-trump-border-immigration-migrant-crisis"
  },
  {
    "text": "Scoop: GOP Rep. Mark Green reverses decision to retire after Trump pressure … - “While my strong desire was to leave Congress at the end of this year, since my announcement, I have received countless calls from constituents, colleagues, and President Trump urging me to reconsider,” he said in a statement.",
    "url": "https://www.axios.com/2024/02/29/mark-green-congress-retire-reelection-trump"
  },
  {
    "text": "Trump's Team ‘Literally Popping Champagne’ Over Supreme Court Taking Up Immunity Claim  —  The former president is now highly unlikely to stand trial in the Justice Department's election interference case before November  —  The Supreme Court handed Donald Trump a massive victory on Wednesday … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-team-celebrating-supreme-court-immunity-decision-1234978336/"
  },
  {
    "text": "Goodbye, Mitch: You were the worst  —  He will be remembered as one of the most dangerous politicians in living memory.  He helped transform the Republican Party into a cult, worshiping at the altar of authoritarianism.  He's damaged our country in ways that may take a generation to undo.",
    "url": "https://robertreich.substack.com/p/goodbye-mitch-you-were-the-worst"
  },
  {
    "text": "Republican senator blocks bill to protect IVF  —  Sen. Cindy Hyde-Smith, R-Miss., blocked the bill brought by Sen. Tammy Duckworth, D-Ill., who used IVF to have her daughters.  —  WASHINGTON — Republican Sen. Cindy Hyde-Smith of Mississippi blocked passage of legislation Wednesday that would protect access to in vitro fertilization.",
    "url": "https://www.nbcnews.com/politics/congress/republican-senator-cindy-hyde-smith-blocks-bill-protecting-ivf-rcna141083"
  },
  {
    "text": "Senate passes spending bill, punting shutdown threat to next week  —  The Senate on Thursday passed a short-term spending bill that punts this weekend's shutdown threat to later in the month, but leaves questions about how Congress will fund the government through the rest of the year.",
    "url": "https://thehill.com/homenews/senate/4498962-senate-passes-spending-bill-punting-shutdown-threat-to-next-week/"
  },
  {
    "text": "Journalist Catherine Herridge held in contempt for not revealing source  —  The veteran correspondent for CBS and Fox News was ordered to pay $800 a day in a case that had triggered alarm for press advocates  —  In a case that has worried press advocates, veteran journalist Catherine Herridge … ",
    "url": "https://www.washingtonpost.com/style/media/2024/02/29/catherine-herridge-held-contempt-cbs-fox-journalist/"
  },
  {
    "text": "Missouri GOP Candidate for Governor Was Only ‘Honorary’ KKK Member  —  The name of “Pro-White man” Darrell Leon McClanahan III sits atop Missouri's gubernatorial ballot  —  These photos tweeted yesterday by former Missouri Representative Shamed Dogan first appeared on the website … ",
    "url": "https://www.riverfronttimes.com/news/missouri-gop-candidate-for-governor-is-only-honorary-kkk-member-42007057"
  },
  {
    "text": "F.B.I. Searches Houses Owned by Adams's Asian Affairs Adviser  —  Federal agents descended on at least two properties owned by the adviser, Winnie Greco, who was a prominent fund-raiser for Mayor Eric Adams's campaign.  —  F.B.I. agents on Thursday searched two houses owned by a close aide … ",
    "url": "https://www.nytimes.com/2024/02/29/nyregion/fbi-adams-greco-investigation-nyc.html"
  },
  {
    "text": "Arizona Senate Passes Bill Preventing Presidents From Ballot Removal Under 14th Amendment  —  WASHINGTON, D.C. — As states eagerly await the U.S. Supreme Court's ruling on if former President Donald Trump should be allowed on the ballot for supporting an insurrection, Arizona Republicans took … ",
    "url": "https://www.democracydocket.com/news-alerts/arizona-senate-passes-bill-preventing-presidents-from-ballot-removal-under-14th-amendment/"
  },
  {
    "text": "Hunter Biden gives House Republicans the rebuttal they didn't want  —  Hunter Biden's appearance in front of investigators and members of the House Oversight and Judiciary Committees unfolded a bit like a Bruce Lee movie.  —  Republican legislators and interviewers challenging the president's son … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/29/hunter-biden-transcript-impeachment-inquiry/"
  },
  {
    "text": "Details Emerge About Arrest and Charges Against Lauren Boebert's Son  —  Investigators say Tyler Boebert and three underage pals swiped credit cards from people's cars and tried using them at gas stations and other places. … The felony charges that Representative Lauren Boebert's eighteen-year-old son … ",
    "url": "https://www.westword.com/news/details-emerge-about-arrest-and-charges-against-lauren-boeberts-son-19659817"
  },
  {
    "text": "Former US ambassador to plead guilty for spying for Cuba over decades  —  A former U.S. ambassador will plead guilty to charges of spying for Cuba for decades, court records showed on Thursday, in what the Justice Department described as one of the highest-reaching and longest-lasting infiltrations … ",
    "url": "https://www.reuters.com/world/americas/former-us-ambassador-plead-guilty-spying-cuba-over-decades-2024-02-29/"
  },
  {
    "text": "Brian Mulroney, Who Led Canada Into Accords With US, Dies at 84  — Warm ties with US leaders helped bring about NAFTA agreement  — Domestic legacy overshadowed by failed constitutional reform  —  Brian Mulroney, the former Canadian prime minister who oversaw the treaty that tore … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-01/brian-mulroney-who-led-canada-into-accords-with-us-dies-at-84"
  },
  {
    "text": "The overlap of Trumpism and Christian nationalism  —  Shortly after the 2020 election, the research organization PRRI released a fascinating set of data showing just how closely support for Donald Trump was linked to religion.  The higher the percentage of White Christian residents in a county … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/29/trump-christian-nationalism-polling/"
  },
  {
    "text": "Why the Biden administration is delaying this key climate rule  —  The EPA wants to toughen regulations on gas power plants nationwide but delay the final decision until after the 2024 election  —  The Environmental Protection Agency plans to delay final limits on planet-warming emissions … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/02/29/epa-gas-power-plant-rule/"
  },
  {
    "text": "Mitch McConnell: Some Thoughts on Mastery, Destruction and Minority Rule  —  Mitch McConnell is one of those perhaps historic figures for whom the greatness of his skill and impact are matched only in inverse by the malignity of his impact on our politics.  To put it more brashly, McConnell was great at doing political evil.",
    "url": "https://talkingpointsmemo.com/edblog/mitch-mcconnell-some-thoughts-on-mastery-destruction-and-minority-rule/sharetoken/HKlwxw9i77vE"
  }
]