[
  {
    "text": "Trump's Tirade at Reporter Wrecks His Own Case Against Abrego Garcia  —  President Donald Trump grew angry as a reporter persistently questioned him about his refusal to bring back Kilmar Abrego Garcia from a prison in El Salvador—and in so doing, Trump accidentally demolished his whole case … ",
    "url": "https://newrepublic.com/post/194593/donald-trump-reporter-wrecks-case-kilmar-abrego-garcia"
  },
  {
    "text": "Trump says he ‘could’ bring Abrego Garcia back from El Salvador, but won't  —  President Donald Trump on Tuesday acknowledged that he could secure the return of Kilmar Armando Abrego Garcia, a Maryland man who was wrongly deported to El Salvador last month but refuses to do so.",
    "url": "https://cnn.com/2025/04/30/us/trump-could-bring-abrego-garcia-back-us-hnk/"
  },
  {
    "text": "Jeffries Wants Dems to Put an End to the El Salvador Trips  —  [Note: This article has been updated to include a new response from the office of Hakeem Jeffries.]  —  HOUSE MINORITY LEADER Hakeem Jeffries was asked Monday whether Democrats should continue to advocate for the return of Kilmar Abrego Garcia … ",
    "url": "https://www.thebulwark.com/p/what-happened-to-democrats-trips-to-el-salvador-van-hollen-booker-jeffries-abrego-garcia"
  },
  {
    "text": "Senate GOP leaders succeed in protecting Trump tariffs  —  The Senate on Wednesday killed a resolution that would have effectively reversed President Trump's 10% tariffs on all imported goods, with just three Republicans joining with Democrats in support of the measure.",
    "url": "https://www.axios.com/2025/04/30/senate-tariff-vote-gop"
  },
  {
    "text": "US economy goes into reverse from Trump's abrupt policy shifts  —  The US economy just had its worst quarter since 2022 as President Donald Trump's significant policy changes unnerved consumers and businesses.  —  Gross domestic product, which measures all the goods and services produced in the economy … ",
    "url": "https://cnn.com/2025/04/30/economy/us-gdp-q1"
  },
  {
    "text": "DOGE Put a College Student in Charge of Using AI to Rewrite Regulations  —  A DOGE operative has been tasked with using AI to propose rewrites to the Department of Housing and Urban Development's regulations—an effort sources are told will roll out across government.",
    "url": "https://www.wired.com/story/doge-college-student-ai-rewrite-regulations-deregulation/"
  },
  {
    "text": "Behind Trump's Deal to Deport Venezuelans to El Salvador's Most Feared Prison … As they addressed reporters inside the Oval Office in mid-April, President Trump and his Salvadoran counterpart appeared to be operating in lock step.  —  The United States had just deported more than 200 migrants … ",
    "url": "https://www.nytimes.com/2025/04/30/us/politics/trump-deportations-venezuela-el-salvador.html?unlocked_article_code=1.Dk8.X579.aP0eo6Niradd&smid=url-share"
  },
  {
    "text": "El Salvador Is Said to Have Spurned U.S. Request for Return of Deported Migrant  —  It remained unclear whether the diplomatic effort was a genuine bid by the White House to address the plight of the immigrant, Kilmar Armando Abrego Garcia.  —  The Trump administration recently sent … ",
    "url": "https://www.nytimes.com/2025/04/30/us/politics/trump-abrego-garcia-bukele-el-salvador.html"
  },
  {
    "text": "Judge frees Columbia student activist whom Trump administration wants to deport  —  Mohsen Mahdawi was arrested by immigration authorities as part of a crackdown on foreign students who were legally studying in the United States.  —  BURLINGTON, Vermont — A federal judge on Wednesday ordered … ",
    "url": "https://www.politico.com/news/2025/04/30/judge-frees-columbia-student-activist-whom-trump-administration-wants-to-deport-00317981"
  },
  {
    "text": "RFK Jr.'s HHS Orders Lab Studying Deadly Infectious Diseases to Stop Research  —  NIAID's Integrated Research Facility is one of the few federal facilities charged with studying Ebola.  Tuesday afternoon, all of its work was put on indefinite pause by Robert F. Kennedy Jr.'s department.",
    "url": "https://www.wired.com/story/hhs-niaid-irf-ebola-disease-research-stop/"
  },
  {
    "text": "The GOP plan to fund Trump's agenda is running into a major roadblock: Trump  —  House Republicans are relying on deep cuts to the safety-net health program to finance their megabill.  But the president is deeply wary.  —  President Donald Trump is skeptical of congressional Republicans' emerging plans … ",
    "url": "https://www.politico.com/news/2025/04/30/donald-trump-medicaid-cuts-mike-johnson-00320262"
  },
  {
    "text": "Three House Democrats ask to be removed from Trump impeachment resolution  —  A trio of House Democrats asked to be removed as co-sponsors of a resolution to impeach President Trump, a sign that many in the party do not want to go down the path of trying to remove the president from office — at least at the current moment.",
    "url": "https://thehill.com/homenews/house/5275353-democrats-trump-impeachment-resolution/"
  },
  {
    "text": "Robert De Niro's Son Comes Out as Transgender at Age 29  —  Robert De Niro's 29-year-old son Airyn (formerly Aaron) has come out as transgender after beginning hormone treatment in 2024.  —  Born via surrogate with the acclaimed actor's ex-girlfriend Toukie Smith, Airyn told Them magazine … ",
    "url": "https://www.breitbart.com/entertainment/2025/04/29/robert-de-niros-son-comes-out-as-transgender-at-age-29/"
  },
  {
    "text": "DOGE hits Trump country  —  Red states have borne the brunt of DOGE's targeting of AmeriCorps  —  Three months in, it's become abundantly clear that it's not just federal Washington-based programs and overseas aid that are feeling the wrath of Elon Musk and DOGE.",
    "url": "https://www.politico.com/news/2025/04/30/doge-hits-trump-country-00319654"
  },
  {
    "text": "Trump administration weighs sending migrants to Libya and Rwanda, sources say  —  The Trump administration has discussed with Libya and Rwanda the possibility of sending migrants who have criminal records and are in the United States to those two countries, according to multiple sources familiar with the talks.",
    "url": "https://cnn.com/2025/04/30/politics/migrants-libya-rwanda-trump"
  },
  {
    "text": "US and Ukraine Sign Resources Deal After Fraught Negotiations  —  The US and Ukraine reached a deal over access to the country's natural resources, offering a measure of assurance to officials in Kyiv who had feared that President Donald Trump would pull back his support in peace talks with Russia.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-30/us-and-ukraine-sign-agreement-on-access-to-natural-resources"
  },
  {
    "text": "House Republicans advance plan to cut federal worker benefits and undermine civil service protections  —  Republicans on the House Oversight and Government Reform Committee voted Wednesday mostly along party lines to advance a series of proposals that would require federal workers to pay … ",
    "url": "https://www.govexec.com/pay-benefits/2025/04/house-republicans-advance-plan-cut-federal-worker-benefits-and-undermine-civil-service-protections/404969/"
  },
  {
    "text": "The religious right is headed toward a revolutionary victory in the Supreme Court  —  The Court's Christian right makeover of the Constitution enters its endgame. … During an oral argument on Wednesday, the Supreme Court appeared all but certain to divide along party lines in a case … ",
    "url": "https://www.vox.com/scotus/411185/supreme-court-religion-charter-schools-oklahoma-drummond"
  },
  {
    "text": "NIH cancels participation in Safe to Sleep campaign that decreased infant deaths  —  Non-profits scramble to continue program despite ‘devastating’ loss of federal support  —  WASHINGTON — The Trump administration has cancelled federal participation in Safe to Sleep, a 30-year campaign … ",
    "url": "https://www.statnews.com/2025/04/30/nih-ends-participation-in-safe-to-sleep-campaign-to-prevent-infant-deaths/"
  },
  {
    "text": "Trump is losing  —  In the first 100 days of Donald Trump's second term, his administration has proven exceptionally good at breaking things.  The Department of Government Efficiency's total demolition of USAID, Robert F. Kennedy Jr.'s depopulation of America's public health agencies … ",
    "url": "https://www.vox.com/politics/410966/trump-democracy-100-days-losing"
  },
  {
    "text": "New Mideast Project Is Latest Trump Company Deal Tied to a Foreign Government  —  The Trump Organization agreed to partner on a real estate project in Qatar in the latest of a series of projects tied to foreign governments.  —  The Trump Organization has agreed to a new Middle East golf course … ",
    "url": "https://www.nytimes.com/2025/04/30/world/middleeast/trump-family-qatar-dubai.html?unlocked_article_code=1.Dk8.lMSj.0rYxsXDCJlg7&smid=url-share"
  },
  {
    "text": "RFK Jr. rejects cornerstone of health science: Germ theory … With the rise of Robert F. Kennedy Jr., brain worms have gotten a bad rap.  —  A year ago, the long-time anti-vaccine advocate and current US health secretary famously told The New York Times that a parasitic worm “got into my brain and ate a portion of it and then died.”",
    "url": "https://arstechnica.com/health/2025/04/rfk-jr-s-anti-vaccine-stance-is-rooted-in-a-disbelief-in-germ-theory/"
  },
  {
    "text": "Musk's Parting Gift: The Construction of a Surveillance State  —  Elon Musk may be stepping back from running the so-called Department of Government Efficiency, but his legacy there is already secured.  DOGE is assembling a sprawling domestic surveillance system for the Trump administration … ",
    "url": "https://www.nytimes.com/2025/04/30/opinion/musk-doge-data-ai.html?unlocked_article_code=1.Dk8.vyAK.kc1VVGj9yyJp&smid=url-share"
  },
  {
    "text": "12 Most Painfully Sycophantic Comments From Trump's ‘Kim Jong Il-Style’ Cabinet Meeting  —  President Donald Trump assembled his cabinet Wednesday for a two-hour meeting — in which every official seated at the table went out of their way to fawn over him.  —  One-by-one, the Trump officials … ",
    "url": "https://www.mediaite.com/news/12-most-painfully-sycophantic-comments-from-trumps-kim-jong-il-style-cabinet-meeting/"
  },
  {
    "text": "Haitian national in ICE custody passes away  —  MIAMI — Marie Ange Blaise, a 44-year-old citizen of Haiti in the custody of U.S. Immigration and Customs Enforcement, was pronounced deceased by medical professionals at the Broward Transitional Center in Pompano Beach, Florida, April 25 … ",
    "url": "https://www.ice.gov/news/releases/haitian-national-ice-custody-passes-away"
  },
  {
    "text": "Judge Temporarily Blocks Border Patrol's Stop-and-Arrest Tactics in California  —  Border Patrol agents carried out sweeps in California's Central Valley.  Lawyers argued that people were stopped and arrested based on their skin color.  —  In January, Border Patrol agents conducted sweeps … ",
    "url": "https://www.nytimes.com/2025/04/29/us/politics/trump-farm-workers-california-lawsuit.html?unlocked_article_code=1.Dk8.VGXt.iUbVzGUufUam&smid=nytcore-ios-share&referringSource=articleShare"
  }
]