[
  {
    "text": "'We're ungovernable': House Republicans nix votes on two funding bills as shutdown deadline nears  —  Funding to keep the government open is set to expire on Nov. 17, and there's no deal on how to avoid it.  —  WASHINGTON — House Republicans closed out the week by canceling votes … ",
    "url": "https://www.nbcnews.com/politics/congress/-ungovernable-house-republicans-nix-votes-two-funding-bills-shutdown-d-rcna124441"
  },
  {
    "text": "Playbook PM: Another GOP spending bill goes poof  —  Governing just isn't getting any easier for new House Speaker MIKE JOHNSON.  —  The House GOP's plan to pass a host of conservative, budget-slashing spending bills hit yet another pothole this morning, with leaders officially shelving … ",
    "url": "https://www.politico.com/newsletters/playbook-pm/2023/11/09/another-gop-spending-bill-goes-poof-00126381"
  },
  {
    "text": "The public doesn't understand the risks of a Trump victory.  That's the media's fault  —  With democracy in the balance, the press must relay the crucial importance of this election and the dangers of a Trump win  —  Whatever doubts you may have about public-opinion polls, one recent example should not be dismissed.",
    "url": "https://www.theguardian.com/commentisfree/2023/nov/09/trump-president-democracy-threat-media-journalism"
  },
  {
    "text": "Echoes of Jan. 6 committee as Jack Smith foreshadows plan to tie Trump to Capitol riot  —  Donald Trump doesn't want prosecutors to talk about Jan. 6.  They want to make it central to their case.  —  When Donald Trump faces a jury on charges stemming from his bid to subvert the 2020 election … ",
    "url": "https://www.politico.com/news/2023/11/09/donald-trump-jan-6-riot-defendant-00126258"
  },
  {
    "text": "Peter Thiel Is Taking a Break From Democracy  —  This article was featured in One Story to Read Today, a newsletter in which our editors recommend a single must-read from The Atlantic, Monday through Friday.  Sign up for it here.  —  It wasn't clear at first why Peter Thiel agreed to talk to me.",
    "url": "https://www.theatlantic.com/politics/archive/2023/11/peter-thiel-2024-election-politics-investing-life-views/675946/"
  },
  {
    "text": "Joe Manchin says he won't seek re-election in 2024  —  Sen. Joe Manchin (D-W.Va) announced Thursday that he is not seeking re-election in West Virginia next year. … - Manchin is widely viewed as the only Democrat who could win a statewide contest in the red state.",
    "url": "https://www.axios.com/2023/11/09/manchin-not-running-2024-election-democrats"
  },
  {
    "text": "Manchin won't seek reelection in West Virginia  —  Sen. Joe Manchin (D-W.Va.) announced Thursday that he will not seek reelection to the Senate in 2024, almost certainly handing Republicans a seat in next year's elections in a deep red state.  —  “After months of deliberation and long conversations … ",
    "url": "https://thehill.com/homenews/senate/4302658-manchin-wont-seek-reelection-in-west-virginia/"
  },
  {
    "text": "James Comer, Like Joe Biden, Also Paid His Brother $200K  —  James Comer is going after Joe Biden because he loaned his brother, James Biden, $200,000.  If that's the standard, James Comer may want to investigate himself. … Pay Dirt is a weekly foray into the pigpen of political funding.",
    "url": "https://www.thedailybeast.com/james-comer-like-joe-biden-also-paid-his-brother-dollar200k"
  },
  {
    "text": "Israel agrees to 4-hour daily pauses in Gaza fighting to allow civilians to flee, White House says  —  Israeli forces have severed northern Gaza from the rest of the besieged territory setting the stage for an expected push into the dense confines of Gaza City and an even bloodier phase of the month-old war.",
    "url": "https://apnews.com/article/israel-gaza-humanitarian-pauses-b8fc613ffd8b9351c0dc37b90b6e10dd"
  },
  {
    "text": "McSally says she was sexually assaulted during run  —  Former Sen. Martha McSally (R-Ariz.) said she was sexually assaulted Wednesday during a run along the Missouri River on the border of Nebraska and Iowa.  —  “I am OK,” McSally said in a video shared to Instagram after the run, while she was “still in an adrenaline state.”",
    "url": "https://thehill.com/blogs/blog-briefing-room/4301669-mcsally-claims-sexually-assault-during-run/"
  },
  {
    "text": "Readers respond to a Hamas cartoon  —  Editor's note: As editor of the opinion section, I am responsible for what appears in its pages and on its screens.  The section depends on my judgment.  A cartoon we published by Michael Ramirez on the war in Gaza, a cartoon whose publication I approved, was seen by many readers as racist.",
    "url": "https://www.washingtonpost.com/opinions/2023/11/08/readers-response-hamas-cartoon/"
  },
  {
    "text": "She saw Trump coming in 2016 better than anyone.  What does Salena Zito see for 2024?  —  If you've heard the phrase about how you should take former President Donald Trump “seriously but not literally,” you can thank Salena Zito.  The reporter from Pittsburgh coined the incisive observation … ",
    "url": "https://thehill.com/opinion/white-house/4302014-she-saw-trump-coming-in-2016-better-than-anyone-what-does-salena-zito-see-for-2024/"
  },
  {
    "text": "Gruesome Footage of Oct. 7 Hamas Atrocities Screens in Hollywood Under Heavy Guard  —  On Wednesday night, with a sizable security presence and protesters audible through the walls, some 200 members of the industry screened ‘Bearing Witness,’ comprising 43 minutes of uncensored footage, at the Museum of Tolerance in West L.A.",
    "url": "https://www.hollywoodreporter.com/news/general-news/hollywood-screening-bearing-witness-hamas-israel-attack-1235642773/"
  },
  {
    "text": "Broken Borders: AP & Reuters Pictures of Hamas Atrocities Raise Ethical Questions  —  On October 7, Hamas terrorists were not the only ones who documented the war crimes they had committed during their deadly rampage across southern Israel.  Some of their atrocities were captured … ",
    "url": "https://honestreporting.com/photographers-without-borders-ap-reuters-pictures-of-hamas-atrocities-raise-ethical-questions/"
  },
  {
    "text": "Tuesday Was Great for Democrats.  It Doesn't Change the Outlook for 2024.  —  A pattern continued with success in low-turnout elections, which favors highly engaged voters.  Presidential years tend to be different.  —  Almost every Tuesday election since the Supreme Court's decision … ",
    "url": "https://www.nytimes.com/2023/11/08/upshot/biden-election-results-2024.html"
  },
  {
    "text": "Please get Ramaswamy off my TV, and other debate thoughts  —  Is there anyone who isn't annoyed to death by this guy? … The third of four Republican presidential debates didn't change the trajectory of a race that Donald Trump will win, barring shocking developments.",
    "url": "https://www.publicnotice.co/p/gop-debate-vivek-ramaswamy-annoying"
  },
  {
    "text": "Nearly half of Democrats disapprove of Biden's response to the Israel-Hamas war, AP-NORC poll shows  —  Nearly half of Democrats disapprove of how President Joe Biden is handling the Israel-Hamas conflict, according to a new poll from The Associated Press-NORC Center for Public Affairs Research … ",
    "url": "https://apnews.com/article/israel-palestinians-apnorc-poll-biden-democrats-42b195c5a577a40ff981d26afbff9997"
  },
  {
    "text": "Richmond Mayor Levar Stoney will launch Virginia gubernatorial run by end of year  —  Stoney has already hired several top campaign officials.  —  Richmond Mayor Levar Stoney has begun assembling a campaign team ahead of launching a 2025 Virginia governor's bid later this year.",
    "url": "https://www.politico.com/news/2023/11/09/levar-stoney-virginia-gov-race-00126373"
  },
  {
    "text": "Young Americans are losing faith in democracy — educators must act now  —  There is a quiet revolution going on among the younger generation in this country, marked by a dramatic erosion of support for America's constitutional democracy.  —  The younger generation has good reason to be disillusioned with democracy.",
    "url": "https://thehill.com/opinion/education/4302113-young-americans-are-losing-faith-in-democracy-educators-must-act-now/"
  },
  {
    "text": "Exclusive: Trump defends family separation, warns ‘weaponized’ government could target his opponents, in Univision sitdown  —  The Scoop  —  Former President Donald Trump talked about turning “weaponized” government against his political opponents, defended his family separation policy … ",
    "url": "https://www.semafor.com/article/11/09/2023/exclusive-trump-defends-family-separation-warns-weaponized-government-could-target-his-opponents-in-univision-sitdown"
  },
  {
    "text": "Authorities investigating ‘suspicious’ envelopes sent to election offices in Washington, Georgia  —  A powdery substance in one envelope tested positive for fentanyl.  —  Authorities in at least two states are investigating a spate of suspicious envelopes sent to election offices this week … ",
    "url": "https://abcnews.go.com/US/authorities-investigating-suspicious-envelopes-election-offices-washington-georgia/story?id=104761286"
  },
  {
    "text": "Resign if you cannot follow the Constitution?  Great idea.  —  A telling incident occurred in the Missouri governor's race this month.  After a hearing in the Western District Court of Appeals, Missouri Secretary of State Jay Ashcroft, a Republican candidate for governor … ",
    "url": "https://www.washingtonpost.com/opinions/2023/11/09/public-service-constitution-abortion-lgbtq/"
  }
]