[
  {
    "text": "Steve Bannon condemns Elon Musk as ‘racist’ and ‘truly evil’  —  Ex-Trump adviser denounces tech CEO's embrace of some forms of immigration and vows to ‘take this guy down’  —  In an escalation of discontent among the highest-profile far-right followers of Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/12/steve-bannon-calls-elon-musk-racist"
  },
  {
    "text": "Steve Bannon derides Elon Musk, vowing to limit influence over Trump  —  His comments reflect an intensifying battle over Musk's West Wing influence as Trump prepares to take office  —  President-elect Donald Trump's former chief strategist Stephen K. Bannon is ramping up public attacks … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/12/bannon-musk-trump-maga/"
  },
  {
    "text": "Newsom suspends landmark environmental laws to ease rebuilding in wildfire zones  — Requirements for building permits and reviews in the California Environmental Quality Act and the California Coastal Act will be eased for victims of the fires in Pacific Palisades, Altadena and other communities.",
    "url": "https://www.latimes.com/california/story/2025-01-12/newsom-suspends-landmark-environmental-regulations-palisades-altadena-fires"
  },
  {
    "text": "Trump Calls Officials Handling Los Angeles Wildfires ‘Incompetent’  —  Governor Gavin Newsom and Los Angeles County authorities have invited President-elect Donald J. Trump to tour the devastation, but he has not publicly responded.  —  President-elect Donald J. Trump offered fresh criticism early Sunday … ",
    "url": "https://www.nytimes.com/2025/01/12/us/trump-los-angeles-fire-newsom-bass.html"
  },
  {
    "text": "Vance says those who ‘committed violence’ on Jan. 6 ‘obviously’ shouldn't be pardoned  —  Vice President-elect JD Vance said people who “committed violence” on Jan. 6, 2021, “obviously” shouldn't be pardoned by President-elect Trump.  —  “I think it's very simple, look … ",
    "url": "https://thehill.com/homenews/administration/5081525-vance-says-those-who-committed-violence-on-jan-6-obviously-shouldnt-be-pardoned/"
  },
  {
    "text": "Vance says Jan. 6 participants who committed violence ‘obviously’ shouldn't be pardoned  —  Vice President-elect JD Vance says people responsible for the violence during the Capitol riot “obviously” should not be pardoned, as President-elect Donald Trump is promising to use his clemency power … ",
    "url": "https://apnews.com/article/vance-trump-pardons-capitol-riot-31308a54ebac4ef6783662f595262dec"
  },
  {
    "text": "Inside Elon Musk's Plan for DOGE to Slash Government Costs  —  Mr. Musk has turned to Silicon Valley to help recruit executives who will take up unofficial positions across the federal government.  —  An unpaid group of billionaires, tech executives and some disciples of Peter Thiel … ",
    "url": "https://www.nytimes.com/2025/01/12/us/politics/elon-musk-doge-government-trump.html?unlocked_article_code=1.ok4.JXW-.m8CE_yWg6VxQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "California Fire Facts  —  LIE - California Cut Firefighting Budgets  — FACT: The number of CalFIRE personnel has nearly doubled since 2019 (from 5,829 to 10,741)  — FACT: CalFIRE's budget has nearly doubled since 2019 ($2 Billion to $3.8 Billion)  —  LIE - These Wildfires are Caused … ",
    "url": "https://gavinnewsom.com/california-fire-facts/"
  },
  {
    "text": "He gave his cats raw milk because he thought it was healthier.  He says it tragically backfired  —  A California man whose two cats died after drinking raw milk recalled for bird flu risk says he meant to keep his beloved pets healthy, but his efforts tragically backfired.",
    "url": "https://apnews.com/article/raw-milk-california-cats-bird-flu-c3f6201216efb2a7e98ca143329a631a"
  },
  {
    "text": "Biden spoke with Netanyahu; Sullivan says hostage deal very close  —  Netanyahu updated Biden on progress and on the mandate he has given his top-level security delegation now in Doha in order to advance a hostage deal, Netanyahu said in a statement.  —  WASHINGTON — U.S. President Joe Biden spoke … ",
    "url": "https://www.nbcnews.com/politics/politics-news/biden-spoke-netanyahu-sullivan-says-hostage-deal-close-rcna187328"
  },
  {
    "text": "Which of Trump's nominees should get confirmed?  We made a chart.  —  Confirmation hearings will begin Tuesday for President-elect Donald Trump's intended Cabinet nominees.  We would not have picked any of his choices for our hypothetical Cabinet.  But, as we have argued for decades … ",
    "url": "https://www.washingtonpost.com/opinions/interactive/2025/trump-nominees-confirmation-hearings-editorial-board/"
  },
  {
    "text": "Europe's Largest Pension Fund Sold Tesla Stake Over Musk's Pay  —  Europe's largest pension fund sold its entire €571 million ($585 million) stake in Tesla Inc. in the third quarter partly due to disagreement with Elon Musk's remuneration package.  —  “We had a problem” with Musk's pay package … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-12/europe-s-largest-pension-fund-sold-tesla-stake-over-musk-s-pay"
  },
  {
    "text": "DOJ seeks interviews with former UnitedHealth Group doctors  —  Clinicians told STAT that UnitedHealth pressured them to apply lucrative diagnosis codes to patients  —  The Justice Department is interviewing former UnitedHealth Group physicians about their experiences working at practices owned … ",
    "url": "https://www.statnews.com/2025/01/12/doj-interview-unitedhealth-group-optum-doctors-health-cares-colossus/"
  },
  {
    "text": "White Christian nationalists are poised to remake America in their image during Trump's second term, author says  —  There's an image that captures the threat posed by the White Christian nationalist movement — and how it could become even more dangerous over the next four years.",
    "url": "https://www.cnn.com/2025/01/12/us/white-christian-nationalism-du-mez-cec/"
  },
  {
    "text": "Pardoned by Trump, Manafort Is Back and Looking for Foreign Work  —  The president-elect's 2016 campaign chairman, four years after receiving clemency, is testing the international market with a team of Trump-linked consultants.  —  Constant Méheut and Michael Schwirtz",
    "url": "https://www.nytimes.com/2025/01/12/us/politics/trump-manafort.html?unlocked_article_code=1.ok4.k_bq.-NCsI5kUVYHV&smid=url-share"
  },
  {
    "text": "Transcript: Sen. Mark Kelly on “Face the Nation with Margaret Brennan,” Jan. 12, 2025  —  The following is the full transcript of an interview with Sen. Mark Kelly, Democrat of Arizona, on “Face the Nation with Margaret Brennan” that aired on Jan. 12, 2025.  —  MARGARET BRENNAN … ",
    "url": "https://www.cbsnews.com/news/mark-kelly-arizona-democrat-face-the-nation-transcript-01-12-2025/"
  },
  {
    "text": "Trump Discusses Tax Cuts for New Yorkers With G.O.P. Lawmakers  —  The president-elect told Republicans from New York, New Jersey and California to come up with a plan for increasing the state and local tax deduction — a move that would benefit their constituents.",
    "url": "https://www.nytimes.com/2025/01/12/us/politics/trump-salt-tax-new-york-new-jersey.html"
  },
  {
    "text": "GOP Sen. Lankford says U.S. ‘is not going to invade’ Greenland despite Trump's comments  —  Sen. James Lankford (R-Okla.) reacts to President-elect Trump not ruling out using military force to take control of Greenland, a territory of Denmark.",
    "url": "https://www.nbcnews.com/meet-the-press/video/gop-sen-lankford-says-u-s-is-not-going-to-invade-greenland-despite-trump-s-comments-229085253888"
  }
]