[
  {
    "text": "Top Social Security official exits after clash with Musk's DOGE over data  —  Yet another top career staffer is leaving the administration amid a disagreement over a request by Elon Musk's team for sensitive government information.",
    "url": "https://www.washingtonpost.com/politics/2025/02/17/doge-social-security-musk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NzY4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMTUwNzk5LCJpYXQiOjE3Mzk3Njg0MDAsImp0aSI6Ijc5N2IyNDA4LTg2YjMtNDgyYS1hZDlmLTg4ZWUzOTNlODM1MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAyLzE3L2RvZ2Utc29jaWFsLXNlY3VyaXR5LW11c2svIn0.daGls0KNeZgZ7r2NbGG7PZ88Va-QLs-d_GVYjFblJLs&itid=gfta"
  },
  {
    "text": "Who's in charge of DOGE?  Not Elon Musk, White House says  —  A Trump administration personnel official says Musk has “no actual or formal authority to make government decisions.”  —  Elon Musk is not the leader of DOGE — the mysterious Trump administration operation overseeing an effort to break and remake the federal bureaucracy.",
    "url": "https://www.politico.com/news/2025/02/17/doge-administrator-elon-musk-00204639"
  },
  {
    "text": "Why Elon Musk Can't Run DOGE [sic] Anymore  —  Yesterday, Judge Tanya Chutkan had a Presidents Day hearing on a lawsuit challenging DOGE's actions.  While she reportedly seemed inclined not to grant an emergency restraining order, she did order the government to provide her with two pieces of information … ",
    "url": "https://www.emptywheel.net/2025/02/18/why-elon-musk-cant-run-doge-sic-anymore/"
  },
  {
    "text": "No, 150-Year-Olds Aren't Collecting Social Security Benefits  —  Elon Musk claims to have found rampant fraud in the Social Security Administration.  There's a much simpler explanation.  —  Elon Musk has repeatedly claimed that his so-called Department of Government Efficiency (DOGE) … ",
    "url": "https://www.wired.com/story/elon-musk-doge-social-security-150-year-old-benefits/"
  },
  {
    "text": "Scoop: Dems prep for Trump legal meltdown … Democrats are meeting with state attorneys general, top lawyers, litigation firms, constitutional experts and advocacy organizations, multiple top lawmakers told Axios.  — “Looking into all the implications and all the strategies … ",
    "url": "https://www.axios.com/2025/02/18/democrats-trump-judges-constitution-doge"
  },
  {
    "text": "Under Trump's Mass Deportation Plan, Some Migrants Are Being Sent to Panama  —  Migrants deported from the United States are being held at the Decapolis Hotel Panama in Panama City.  The deportees come from Afghanistan, Iran, China and other nations.  —  They arrived at the United States border … ",
    "url": "https://www.nytimes.com/2025/02/18/world/americas/trump-migrant-deportation-panama.html"
  },
  {
    "text": "Marco Rubio Is Walking into a Trap  —  I'M AN ETERNAL OPTIMIST.  But my gut, informed by a career spent studying and implementing American foreign policy, tells me this week will not go well.  Secretary of State Marco Rubio is set to meet Russian Foreign Minister Sergey Lavrov in Riyadh, Saudi Arabia.",
    "url": "https://www.thebulwark.com/p/marco-rubio-is-walking-into-a-trap-ukraine-russia-lavrov"
  },
  {
    "text": "Statement from Governor Kathy Hochul  —  “Since taking office in 2021, I've done everything possible to partner with the City of New York under the leadership of two different mayors.  We've worked together to fight crime on the streets and subways, close illegal cannabis shops and build more housing through ‘City of Yes’.",
    "url": "https://www.governor.ny.gov/news/statement-governor-kathy-hochul-58"
  },
  {
    "text": "Delta Plane Overturns at Toronto Airport While Landing  —  The airport said on social media that emergency teams were responding and that all passengers and crew were accounted for.  —  A Delta Air Lines flight arriving at Toronto Pearson Airport from Minneapolis appears to have overturned … ",
    "url": "https://www.nytimes.com/2025/02/17/world/canada/delta-toronto-plane-crash.html?unlocked_article_code=1.xk4.UE47.jx1FYaRcA_lv&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "C.I.A. Expands Secret Drone Flights Over Mexico  —  The covert program, begun during the Biden administration and stepped up by President Trump, is hunting for the location of fentanyl labs.  —  The United States has stepped up secret drone flights over Mexico to hunt for fentanyl labs … ",
    "url": "https://www.nytimes.com/2025/02/18/us/politics/cia-drone-flights-mexico.html"
  },
  {
    "text": "Exclusive: FDA staff reviewing Musk's Neuralink were included in DOGE employee firings, sources say  —  U.S. Food and Drug Administration employees reviewing Elon Musk's brain implant company Neuralink were fired over the weekend as part of a broader purge of the federal workforce, according to two sources with knowledge of the matter.",
    "url": "https://www.reuters.com/world/us/fda-staff-reviewing-musks-neuralink-were-included-doge-employee-firings-sources-2025-02-17/"
  },
  {
    "text": "Wokeness Is Not to Blame for Trump  —  How a misdiagnosis of the 2024 election has calcified into self-defeating conventional wisdom.  —  In the midst of chaos and cataclysm, it's rare to find agreement across partisan divides, but in the months since Donald Trump won his second presidential election … ",
    "url": "https://nymag.com/intelligencer/article/wokeness-is-not-to-blame-for-trump.html"
  },
  {
    "text": "Europe, Dazed by Trump, Confronts Hard Choices in Ukraine  —  Faced with undisguised hostility from the Trump administration, Europeans are preparing for what is shaping up to be a go-it-alone era.  —  For years, European leaders have fretted about reducing their dependence on a wayward United States.",
    "url": "https://www.nytimes.com/2025/02/18/world/europe/trump-europe-ukraine.html?unlocked_article_code=1.x04.6q69.7G8j2vzoXqt8&smid=url-share"
  },
  {
    "text": "Making Microbes Great Again  —  The Texas measles outbreak is just the beginning  —  I'm almost certain that I had measles as a child.  My memories are a bit vague, and unfortunately my parents, who would surely have remembered the incident, have passed on.",
    "url": "https://paulkrugman.substack.com/p/making-microbes-great-again"
  },
  {
    "text": "Head of Justice Department's Washington, DC, criminal division quits  —  The head of the criminal division within the DC US Attorney's Office has left her post, according to four sources.  —  The sudden departure of Justice Department veteran Denise Cheung comes a day after President Donald … ",
    "url": "https://www.cnn.com/2025/02/18/politics/justice-department-dc-criminal-division"
  },
  {
    "text": "Trump administration fires thousands for ‘performance’ without evidence, in messy rush  —  Many probationary employees targeted in latest Trump cuts across agencies had excellent ratings; legal challenges are expected.  —  The first message from her manager on Saturday afternoon misspelled Amanda Mae Downey's name.",
    "url": "https://www.washingtonpost.com/nation/2025/02/17/trump-fires-federal-workers-performance/"
  },
  {
    "text": "“His mission is to eradicate ‘woke Jesus’”: How money, lies and religion are abused to gut democracy  —  Journalist Katherine Stewart's “Money, Lies, and God” takes readers into Trump's movement to end America  —  Money, God and lies: These are the three pillars of the movement that led … ",
    "url": "https://www.salon.com/2025/02/18/his-mission-is-to-eradicate-woke-jesus-how-money-lies-and-religion-are-abused-to-gut-democracy/"
  },
  {
    "text": "Trump Cuts Target Next Generation of Scientists and Public Health Leaders  —  A core group of so-called disease detectives, who track outbreaks, was apparently spared.  But other young researchers are out of jobs.  —  The notices came all weekend, landing in the inboxes of federal scientists … ",
    "url": "https://www.nytimes.com/2025/02/18/us/politics/fda-cdc-health-department-trump.html?unlocked_article_code=1.x04.VfSw.oErs0To42kzH"
  },
  {
    "text": "The Personalist Presidency  —  Right now, so many things are happening so quickly that it is hard to keep up.  This is part of a deliberate strategy to “flood the zone” with so many changes that it is impossible to make sense of them all.  I've been trying to step back and identify bigger patterns … ",
    "url": "https://donmoynihan.substack.com/p/the-personalist-presidency"
  },
  {
    "text": "NYC Mayor Adams calls demands to resign over Trump DOJ indictment dismissal a ‘modern day Mein Kampf,’ sparking outrage  —  Mayor Adams contended Monday that renewed calls for his resignation over President Trump's Justice Department bid to drop his corruption indictment amounts to … ",
    "url": "https://www.nydailynews.com/2025/02/17/adams-calls-demands-to-resign-modern-day-mein-kampf-sparking-outrage/"
  },
  {
    "text": "Washington Post Cancels Ad From Groups Calling for Trump to Fire Musk  —  The newspaper told Common Cause, an advocacy group, that it was pulling its special ad, which would have covered the front and back pages of some Tuesday editions.  —  An advertisement that was set to run in some editions … ",
    "url": "https://www.nytimes.com/2025/02/17/business/washington-post-ad-trump-musk.html"
  },
  {
    "text": "This Is the Way to Stop Elon Musk  —  With the backing of President Donald Trump, Elon Musk has embarked on an unconstitutional rampage against the federal government.  The world's wealthiest man is trying to shut down key agencies and programs that protect the health, welfare, and prosperity of millions of Americans.",
    "url": "https://theintercept.com/2025/02/17/elon-musk-trump-government-tesla-spacex/"
  },
  {
    "text": "Thousands Gather on Presidents' Day to Call Trump a Tyrant  —  Thousands of protesters opposing broad swaths of President Trump's agenda took to the streets across the country, including outside the U.S. Capitol.  —  Thousands of protesters opposing broad swaths of President Trump's agenda took … ",
    "url": "https://www.nytimes.com/2025/02/17/us/politics/trump-musk-protests-50501-presidents-day.html?unlocked_article_code=1.x04.tG-e.UWjWRCoH_X6G&smid=nytcore-ios-share&referringSource=articleShare"
  }
]