[
  {
    "text": "Trump's shocking cash comeback  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BIDEN'S CASH EDGE DISAPPEARS — Yesterday, we hit the latest FEC filing deadline for presidential campaigns, super PACs and party committees.",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/21/trumps-shocking-cash-comeback-00164386"
  },
  {
    "text": "Timothy Mellon, Secretive Donor, Gives $50 Million to Pro-Trump Group  —  The cash from Mr. Mellon, a reclusive billionaire who has also been a major donor to a super PAC supporting Robert F. Kennedy Jr., is among the largest single disclosed gifts ever.  —  Timothy Mellon … ",
    "url": "https://www.nytimes.com/2024/06/20/us/politics/timothy-mellon-trump-donation.html"
  },
  {
    "text": "Scoop: Trump has big fundraising plans for VP … - Clicking with Trump, and skill on TV, remain essential prerequisites.  — And although the campaign has received waves of donations since Trump was convicted, money is still a priority. … - The Trump-controlled Republican National Committee … ",
    "url": "https://www.axios.com/2024/06/21/trump-vp-candidates-fundraising"
  },
  {
    "text": "Trump's convictions fueled donation surge that could reshape contest  —  The Trump campaign, the Republican National Committee and an allied super PAC raised more than $170 million in May, including tens of millions that came in after Trump's May 30 conviction on 34 felony counts of falsifying business records",
    "url": "https://www.washingtonpost.com/politics/2024/06/20/trump-conviction-fundraising-campaign-donations/"
  },
  {
    "text": "Robert Winnett will not join The Post as editor  —  Robert Winnett, hired by Washington Post publisher William Lewis, faced questions about his U.K. work, including stories based on stolen records.  —  Robert Winnett, the British journalist recently tapped to become editor of The Washington Post later … ",
    "url": "https://www.washingtonpost.com/style/media/2024/06/21/robert-winnett-steps-down-washington-post-lewis-buzbee/"
  },
  {
    "text": "Newly named Washington Post editor decides not to take job after backlash, will stay in Britain  —  The Washington Post said Friday that newly named editor Robert Winnett has decided not to take the job and remain in Britain instead, another upheaval at a news outlet where a reorganization plan has gone disastrously wrong.",
    "url": "https://apnews.com/article/washington-post-editor-england-telegraph-quits-e650409305a2f1011926306791bc97b1"
  },
  {
    "text": "Supreme Court upholds domestic violence gun restriction  —  The case was a test for how far the court's conservative majority is willing to go in backing gun rights following a major ruling in 2022.  —  WASHINGTON — The Supreme Court on Friday upheld a federal law that prohibits people subjected … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-upholds-domestic-violence-gun-restriction-rcna137782"
  },
  {
    "text": "How Marco Rubio Could Cost Biden the Election  —  Pennsylvania has been political ground zero in presidential elections for nearly a quarter-century, and 2024 will be no different.  Joe Biden carried his birth state by almost 82,000 votes in 2020, and will need to win it again this year.",
    "url": "https://www.nytimes.com/2024/06/21/opinion/trump-vp-pick-marco-rubio.html"
  },
  {
    "text": "Is Jack Smith's appointment constitutional?  Trump's Florida judge is set to decide.  —  A hearing starting Friday will delve into Trump's claim that the special counsel lacks authority.  —  Special counsel Jack Smith's case against Donald Trump for allegedly stealing national security secrets … ",
    "url": "https://www.politico.com/news/2024/06/21/trump-classified-documents-jack-smith-constitutional-00164368"
  },
  {
    "text": "Don't be gaslit: Trump's corruption is unparalleled  —  PN is a reader-supported publication made possible by paid subscribers.  Appreciate our independent journalism?  Then please sign up to support us.  —  📈 Subscribe to Public Notice 📈",
    "url": "https://www.publicnotice.co/p/trump-corruption-explained-emoluments-hotel"
  },
  {
    "text": "GOP Michigan rep and gun-rights supporter Neil Friske accused of chasing a stripper while firing a gun  —  LANSING, Mich. — Neil Friske apparently lives up to his name: The Michigan state representative was arrested early Thursday after Lansing police responded to a report of gunshots … ",
    "url": "https://nypost.com/2024/06/20/us-news/gop-michigan-rep-and-gun-rights-supporter-neil-friske-accused-of-chasing-a-stripper-while-firing-a-gun/"
  },
  {
    "text": "Bragg Asks Judge to Extend Trump's Gag Order, Citing Deluge of Threats  —  Donald J. Trump claims the order has unfairly restricted his free speech rights ahead of his sentencing on 34 felony counts.  He has nonetheless attacked the judge, prosecutor and justice system.",
    "url": "https://www.nytimes.com/2024/06/21/nyregion/trump-gag-order-bragg.html"
  },
  {
    "text": "Club urges members to donate for Aubuchon winner's hospice care  —  The National Press Club is grieved to learn that freelance photojournalist Linda Tirado, the recipient of the Club's 2020 domestic John Aubuchon Press Freedom Award, is dying and has entered hospice care as a result … ",
    "url": "https://www.press.org/newsroom/club-urges-members-donate-aubuchon-winners-hospice-care"
  },
  {
    "text": "Roger Stone Seems to Imply Trump Totally Controls Judge Cannon … A secretly recorded conversation with Roger Stone suggests that the Donald Trump adviser and confidant is implying that the judge in Trump's classified documents case, Aileen Cannon, could be in the convicted felon and former president's pocket.",
    "url": "https://newrepublic.com/post/182935/roger-stone-trump-judge-cannon-classified-documents"
  },
  {
    "text": "Appeals court denies Bannon bid to stave off July 1 jail sentence  —  A divided three-judge panel ruled Bannon's argument was unlikely to gain traction at the Supreme Court.  —  A federal appeals court has denied a last-minute bid by Steve Bannon, a longtime Donald Trump adviser … ",
    "url": "https://www.politico.com/news/2024/06/20/appeals-court-steve-bannon-jail-sentence-00164377"
  },
  {
    "text": "Supreme Court decides cases related to guns for domestic abusers and more  —  The Supreme Court justices announced decisions in five cases Friday morning, including a high-profile gun rights case involving domestic abusers.  They will return to the bench next week to release more 2024 decisions … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/21/supreme-court-decisions-rulings-trump-abortion-social-media/"
  },
  {
    "text": "Jake Sherman interviews Benjamin Netanyahu: Full transcript … Punchbowl News co-founder Jake Sherman discussed a wide range of issues with the longtime Israeli premier, including Netanyahu's sharp disagreements with President Joe Biden, his views on Congress, pro-Palestinian protests … ",
    "url": "https://punchbowl.news/article/foreign-policy/jake-sherman-benjamin-netanyahu-full-transcript/"
  },
  {
    "text": "Why this election desperately matters  —  Editor's Note: Melinda French Gates is a philanthropist, business leader and global advocate for women and girls.  —  CNN  —  As President Joe Biden faces former President Donald Trump in another contest for the White House, the stakes for women and families couldn't be higher.",
    "url": "https://www.cnn.com/2024/06/20/opinions/melinda-french-gates-biden-election-endorsement-gates/"
  },
  {
    "text": "FBI raids home of Oakland Mayor Sheng Thao  —  Federal agents raided the home of Oakland Mayor Sheng Thao early Thursday morning in a probe that included searches of three properties connected to a politically influential family that runs the city's curbside recycling program.",
    "url": "https://www.sfchronicle.com/crime/article/fbi-raids-home-of-oakland-mayor-sheng-thao-19523532.php"
  },
  {
    "text": "Supreme Court rules for ex-council member in Texas arrested after criticizing city official  —  Sylvia Gonzalez alleged she was arrested for criticizing the city manager of Castle Hills, Texas, and organizing a petition to remove him from office.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-texas-councilmember-arrest-sylvia-gonzalez-lawsuit-rcna151050"
  }
]