[
  {
    "text": "Senate Republicans deliver a message to Trump: Gaetz's confirmation is in jeopardy  —  They're privately hoping Trump doesn't make them walk the plank.  —  Numerous Republican lawmakers told Donald Trump and his team that they believe his pick to be attorney general, controversial Rep. Matt Gaetz … ",
    "url": "https://www.politico.com/news/2024/11/19/senate-republicans-matt-gaetz-attorney-general-00190332"
  },
  {
    "text": "Gaetz May Not Be Confirmed, Trump Admits.  He's Pushing Him and Others Anyway.  —  The president-elect is taking a flood-the-zone approach to his cabinet nominations, betting that the Senate won't dare to turn them all down.  —  In his private conversations over the past few days … ",
    "url": "https://www.nytimes.com/2024/11/18/us/politics/trump-cabinet.html"
  },
  {
    "text": "Don't let Matt Gaetz escape accountability — release the ethics report  —  I've served on the House Ethics Committee — here's why it should release its report on former Rep. Matt Gaetz.  —  The selecti o n of former Rep. Matt Gaetz, R-Fla., by President-elect Donald Trump to lead … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/matt-gaetz-house-ethics-committee-report-attorney-general-rcna180705"
  },
  {
    "text": "GOP senators deride idea of replacing FBI background checks for Trump nominees  —  Senate Republicans are rejecting a proposal floated by some advisers to President-elect Trump to take the job of conducting background checks for high-level nominees away from the FBI and give it to private investigators.",
    "url": "https://thehill.com/homenews/senate/4996945-senate-republicans-reject-private-investigators/"
  },
  {
    "text": "Behind the Mar-a-Lago meeting  —  Joe Scarborough and Mika Brzezinski's fence-mending meeting with President-elect Donald Trump has the media world buzzing.  Now I have some new reporting to share about why it happened.  —  Yesterday, as outraged “Morning Joe” fans registered their objections … ",
    "url": "https://view.newsletters.cnn.com/messages/17320243327424fa19cf3ca3d/raw"
  },
  {
    "text": "‘Morning Joe’ meeting with Trump was driven by fears of retribution from incoming administration, sources say  —  New York CNN  —  “Morning Joe” co-hosts Joe Scarborough and Mika Brzezinski announced Monday, in dramatic fashion, that they went to Mar-a-Lago last week for a fence-mending meeting with President-elect Donald Trump.",
    "url": "https://www.cnn.com/2024/11/19/media/morning-joe-trump-mar-a-lago-meeting-fears/"
  },
  {
    "text": "Hacker Is Said to Have Gained Access to File With Damaging Testimony About Gaetz  —  The computer file is said to contain testimony from the woman who said she had sex with Matt Gaetz, President-elect Donald Trump's choice to be attorney general, when she was 17.",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/matt-gaetz-hack-testimony.html?unlocked_article_code=1.bE4.f2SX.A-EoaFu8nQma&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Republican bathroom bill targets Congress's first transgender member  —  South Carolina Republican Nancy Mace introduces bill two months before Sarah McBride is to be sworn in  —  After Delaware elected the first ever openly transgender member of Congress earlier this month … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/19/sarah-mcbride-congress-bathroom-bill-transgender"
  },
  {
    "text": "Mace introduces bill to bar trans women from Capitol restrooms  —  Rep. Nancy Mace (R-S.C.) on Monday introduced a bill to bar transgender women from facilities on Capitol Hill that match their gender identity.  —  The resolution, which would prohibit members, officers and employees … ",
    "url": "https://thehill.com/homenews/house/4997024-mace-introduces-bill-transgender/"
  },
  {
    "text": "Ukraine fires first US-made missile into Russia: WW3 fears as Kremlin threatens ‘nuclear response’ if long-range Western weapons are used on its territory  — Ukrainian officials confirmed the use of ATACMS on Russian soil for the first time  — Comes as Kremlin said its updated nuclear doctrine allowed a ‘nuclear response’",
    "url": "https://www.dailymail.co.uk/news/article-14100327/Ukraine-fires-missile-Russia-WW3-fears-Kremlin-threatens-nuclear-response-long-range-Western-weapons-used-territory.html"
  },
  {
    "text": "Trump Confirms Plan to Use Military to Carry Out Mass Deportations  —  Further proof that the president-elect is willing—even excited—to implement the cruel immigration policy.  —  On Monday, Donald Trump appeared to confirm that he is willing—even eager—to declare a national emergency … ",
    "url": "https://www.motherjones.com/politics/2024/11/trump-mass-deportations-military-national-emergency/"
  },
  {
    "text": "RFK Jr. is a massive public health threat  —  Dems like Jared Polis shouldn't pretend pretend otherwise.  —  ∙ Paid … Donald Trump, in his vacuous orange wisdom, has nominated vaccine denier, crank, and champion of disease Robert F. Kennedy Jr. to be the Secretary of Health and Human Services (HHS).",
    "url": "https://www.publicnotice.co/p/rfk-jr-public-health-threat-vaccines"
  },
  {
    "text": "The Trump administration's next target: naturalized US citizens  —  It appears that President-elect Donald Trump intends to keep his campaign promise to begin deporting at least 15 million people who, he claims, have been “poisoning the blood” of our country.",
    "url": "https://thehill.com/opinion/immigration/4992787-trump-deportation-plan-immigration/"
  },
  {
    "text": "NY judge adjourns Trump hearing without explanation, delaying sentencing  —  Trump's election victory threw the New York court proceedings into uncertain territory  —  Donald Trump's sentencing for 34 criminal charges in the state of New York was abruptly adjourned by the court Tuesday without explanation … ",
    "url": "https://www.foxnews.com/politics/ny-judge-adjourns-trump-hearing-without-explanation-delaying-sentencing"
  },
  {
    "text": "November 18, 2024  —  On Friday, Secretary of Commerce Gina Raimondo locked in a $6.6 billion deal with the Taiwan Semiconductor Manufacturing Company for it to invest $65 billion in three state-of-the-art fabrication plants in Arizona.  This will bring thousands of jobs to the state.",
    "url": "https://heathercoxrichardson.substack.com/p/november-18-2024"
  },
  {
    "text": "Judge denies Jan. 6 defendant's bid to delay trial that could straddle Trump inauguration  —  A Jan. 6 defendant facing five felony charges could be on trial at the precise moment power changes hand from President Joe Biden to President-elect Donald Trump — an uncomfortable prospect … ",
    "url": "https://www.politico.com/live-updates/2024/11/19/congress/january-6-donald-trump-doj-00190348"
  },
  {
    "text": "Half of Ukrainians Want Quick, Negotiated End to War  —  EU, U.K. favored over U.S. as negotiators … LONDON — After more than two years of grinding conflict, Ukrainians are increasingly weary of the war with Russia.  In Gallup's latest surveys of Ukraine, conducted in August and October 2024 … ",
    "url": "https://news.gallup.com/poll/653495/half-ukrainians-quick-negotiated-end-war.aspx"
  }
]