[
  {
    "text": "Disappointment and ‘depression’: Biden's biggest fundraisers watch their advantage vanish  —  Joe Biden's allies are bracing after Donald Trump erased the president's financial edge.  —  Joe Biden's campaign planned to bury Donald Trump in an avalanche of cash.",
    "url": "https://www.politico.com/news/2024/06/23/biden-trump-finances-00164566"
  },
  {
    "text": "As Biden lags in key states, big questions for Democrats … - It also raises critical questions for the 2024 election: Whether Democrats can fix the lack of enthusiasm for Biden — or whether he'll drag down other Democrats on the ballot. … - Republican and Democratic operatives expect … ",
    "url": "https://www.axios.com/2024/06/23/biden-trump-swing-states-polling-democrats"
  },
  {
    "text": "Meet the ‘double haters’ who could decide the election  —  Many voters express resignation, dismay and anger over being asked to choose between Biden and Trump again in November  —  HUDSON, Wis. — Ask voters here in far western Wisconsin what they think of their two main presidential choices in November … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/23/double-haters-biden-trump-deciders/"
  },
  {
    "text": "Biden campaign lays out debate week strategy in new memo  —  The Biden campaign is gearing up for more than 1,000 events in the lead-up to Thursday's debate, according to a memo shared first with NBC News.  —  WASHINGTON — The Biden campaign and its allies plan to hold 1,600 events and run … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-campaign-lays-debate-week-strategy-new-memo-rcna158444"
  },
  {
    "text": "Trump taunted Jewish employees with jokes about Nazi ovens: Ex-Trump Org VP  —  During an appearance on MSNBC on Sunday morning, a former executive vice president of the Trump Organization revealed that her former boss thought it was funny to make jokes about the Nazi ovens around Jewish employees.",
    "url": "https://www.rawstory.com/trump-attacking-jews/"
  },
  {
    "text": "Trump Made ‘Nazi Ovens’ Joke Around Jewish Execs: Ex-Trump Org VP  —  CRUEL AND UNUSUAL  —  “Everybody was shocked,” the former Trump Organization employee said on Sunday.  —  Donald Trump has claimed he's better for Jewish Americans than Democrats, but according to a former senior Trump … ",
    "url": "https://www.thedailybeast.com/trump-made-nazi-ovens-joke-around-jewish-execs-ex-trump-org-vp"
  },
  {
    "text": "Why Conservatives Should Vote for Joe Biden … In 2023, the United States had one of the sharpest drops in the murder rate on record, according to FBI statistics, and early data shows the trend continuing into 2024.  Republicans have persistently denied this, continuing to insist … ",
    "url": "https://nymag.com/intelligencer/article/why-conservatives-should-vote-for-joe-biden.html"
  },
  {
    "text": "Trump drops $500 tip at Philly cheesesteak restaurant as possible VP name is floated in crowd interaction  —  The former president has campaigned recently to end taxation on tips for those in the service industries  —  Former President Trump made an unexpected campaign stop Saturday at Tony … ",
    "url": "https://www.foxbusiness.com/fox-news-politics/trump-drops-tip-philly-cheesesteak-restaurant-possible-vp-name-floated-crowd-interaction"
  },
  {
    "text": "I Know What America's Leading C.E.O.s Really Think of Donald Trump  —  Recent headlines suggest that our nation's business leaders are embracing the presidential candidate Donald Trump.  His campaign would have you believe that our nation's top chief executives are returning to support … ",
    "url": "https://www.nytimes.com/2024/06/23/opinion/ceo-trump-republican-support.html"
  },
  {
    "text": "Scoop: House Dems try to make post-Dobbs comments haunt GOP … - The lawmakers targeted by the five-figure buy: Reps. Michelle Steel (R-Calif.), Nick LaLota (R-N.Y.), Brandon Williams (R-N.Y.), Lori Chavez-DeRemer (R-Ore.) and Scott Perry (R-Pa.).  — “Over the next five months … ",
    "url": "https://www.axios.com/2024/06/23/house-democrats-republicans-roe-v-wade-abortion"
  },
  {
    "text": "Matt Gaetz Hits the Road to Reshape the Republican Party  —  Florida lawmaker wants colleagues who can ‘end the wars, shut the border, reduce the spending’  —  FORT WALTON BEACH, Fla.—Eight months after plunging the Republican Party into a deep crisis, Rep. Matt Gaetz says he doesn't want to divide the GOP.",
    "url": "https://www.wsj.com/politics/elections/matt-gaetz-hits-the-road-to-reshape-the-republican-party-82f4c7cb"
  },
  {
    "text": "Transcript: New Mexico Gov. Michelle Lujan Grisham on “Face the Nation,” June 23, 2024  —  The following is a transcript of an interview with New Mexico Gov. Michelle Lujan Grisham, a Democrat, on “Face the Nation” that aired on June 23, 2024.  —  MARGARET BRENNAN: And we turn now to New Mexico governor Michelle Lujan Grisham.",
    "url": "https://www.cbsnews.com/news/michelle-lujan-grisham-new-mexico-governor-face-the-nation-transcript-06-23-2024/"
  },
  {
    "text": "Former first lady Melania Trump stays out of the public eye as Donald Trump runs for president  —  After Melania Trump missed key events in her husband's presidential bid earlier this year — from the kickoff of the 2024 election in Iowa to Donald Trump's Super Tuesday victory party … ",
    "url": "https://apnews.com/article/melania-trump-donald-campaign-role-first-lady-433bbc2c7d51e6b72a43a831c382c850"
  },
  {
    "text": "Netanyahu says US arms supplies fell away 4 months ago; he went public as last resort  —  At cabinet meeting, PM alleges ‘dramatic drop’ in weapons shipments, says he only spoke out after months of quiet efforts failed to solve problem; hopes it will be resolved soon",
    "url": "https://www.timesofisrael.com/netanyahu-says-he-only-complained-about-us-arms-delay-after-months-of-quiet-efforts/"
  }
]