[
  {
    "text": "Another battlground Dem calls on Biden to withdraw  —  A 19th Hill Democrat is calling on President Joe Biden to withdraw from the ticket — one of California's most vulnerable Democrats.  “First, let me say that President Biden has been an outstanding leader, not only of our nation, but of the entire free world.",
    "url": "https://www.politico.com/live-updates/2024/07/12/congress/19th-dem-calls-on-biden-to-drop-out-00167847"
  },
  {
    "text": "Live Election Updates: Donors Said to Freeze Roughly $90 Million as Long as Biden Stays in Race  —  It's one of the most concrete examples yet of the fallout from President Biden's poor debate performance.  After mixed reviews of his Thursday news conference, Mr. Biden sought to turn the focus on his opponent.",
    "url": "https://www.nytimes.com/live/2024/07/12/us/biden-trump-election"
  },
  {
    "text": "Breaking from NYT: The $90 Million Shoe Just Dropped on Biden  —  Clearly, Democrat donors have little interest in supporting Vice President Trump in this cycle.  Despite the spin coming from Team Biden, the presser last night failed to impress big-ticket donors supporting Joe Biden's re-election effort.",
    "url": "https://hotair.com/ed-morrissey/2024/07/12/breaking-from-nyt-the-90-million-shoe-just-dropped-on-biden-n3791707"
  },
  {
    "text": "Biden's Call With Hispanic Lawmakers Goes Off the Rails  —  The call ended abruptly after Rep. Mike Levin asked Biden to withdraw from the race.  Soon after, Levin formally called on Biden to step down as the nominee.  — Copy  —  As President Joe Biden tries to talk with Democratic lawmakers … ",
    "url": "https://www.notus.org/biden-2024/biden-call-hispanic-lawmakers-off-the-rails"
  },
  {
    "text": "Donors to Pro-Biden Super PAC Are Said to Withhold Roughly $90 Million  —  The decision to withhold such enormous sums of money is one of the most concrete examples of the fallout from President Biden's poor debate performance at the end of June.  —  Some major Democratic donors have told … ",
    "url": "https://www.nytimes.com/2024/07/12/us/politics/biden-donors-money.html"
  },
  {
    "text": "After Biden's debate performance, the presidential race is unchanged  —  The race for the presidency remains statistically tied despite President Biden's dismal debate performance two weeks ago, a new national NPR/PBS NewsHour/Marist poll finds.  —  Biden actually gained a point since last month's survey … ",
    "url": "https://www.npr.org/2024/07/12/nx-s1-5036518/biden-trump-poll"
  },
  {
    "text": "Behind the Curtain: Committee to Unelect the President … - Former Obama aides: The strained relationship between Obama and Biden extends to their former aides, including David Axelrod (Obama's ruthlessly pragmatic chief strategist) and the influential “Pod Save America” guys.",
    "url": "https://www.axios.com/2024/07/12/biden-news-old-democrats-president"
  },
  {
    "text": "Contest for President Still “Up for Grabs”  —  NPR/PBS News/Marist National Poll  —  Biden +2 Percentage Points Against Trump, Despite Concerns about Biden's Mental Fitness  —  With just days to go before the start of the Republican National Convention, President Joe Biden … ",
    "url": "https://maristpoll.marist.edu/polls/contest-for-president-still-up-for-grabs/"
  },
  {
    "text": "Is Kamala Harris Ready for Trump?  —  Vice President Kamala Harris seemed to have one goal at a campaign rally in Greensboro, North Carolina, yesterday: Prove she's ready to square up to Donald Trump.  Harris said Trump's name 15 times in fewer than 20 minutes, and you could hear the disdain in her voice each time.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/kamala-harris-north-carolina-rally/678975/"
  },
  {
    "text": "GOP Rep Delivers a House Floor Speech Straight Out of 'The Handmaid's Tale'  —  BLESSED BE THE FRUIT  —  In a speech before the House that seemed lifted right out of Margaret Atwood's dystopian classic, Rep. Glenn Grothman said he wants the U.S. to go back to 1960.",
    "url": "https://www.thedailybeast.com/rep-glenn-grothman-delivers-speech-straight-out-of-the-handmaids-tale"
  },
  {
    "text": "‘It was horrifying’: Chutkan warns against complacency about Jan. 6  —  The judge in Trump's federal election subversion case used a Friday sentencing in a relatively routine Jan. 6 case to issue the warning.  —  The Jan. 6 attack on the Capitol is far from ancient history and still inflicts pain … ",
    "url": "https://www.politico.com/news/2024/07/12/judge-warns-complacency-jan-6-capitol-riot-sentencing-00167841"
  },
  {
    "text": "Trump allies at Heritage declare 2024 election illegitimate in advance  —  A “war game” presented at the right-wing foundation imagined far-fetched scenarios for election interference to justify preemptive measures.  —  Barbra Streisand kidnapped by Hamas.  Antifa-BLM protesters taking over a migrant detention facility.",
    "url": "https://www.washingtonpost.com/politics/2024/07/11/heritage-foundation-election-war-game/"
  },
  {
    "text": "Sharply More Americans Want to Curb Immigration to U.S.  —  55% want immigration levels reduced, highest since 2001  —  WASHINGTON, D.C. — Significantly more U.S. adults than a year ago, 55% versus 41%, would like to see immigration to the U.S. decreased.",
    "url": "https://news.gallup.com/poll/647123/sharply-americans-curb-immigration.aspx"
  },
  {
    "text": "Sunrise, powerful youth climate group, calls for Biden to drop out  —  Sunrise's Executive Director Aru Shiney-Ajay on Friday cited low enthusiasm for Biden among young people.  —  The influential youth green group Sunrise Movement is calling on President Joe Biden to drop his reelection bid to “protect” his climate legacy.",
    "url": "https://www.politico.com/news/2024/07/12/sunrise-youth-climate-biden-elections-00167851"
  },
  {
    "text": "The most important story about Trump's VP is why he needs a new one  —  Trump is replacing Mike Pence for behaving honorably on Jan. 6.  His substitute would not.  —  The most important story about Donald Trump's incipient pick for his vice presidential running mate is the reason he needs … ",
    "url": "https://www.mediamatters.org/donald-trump/most-important-story-about-trumps-vp-why-he-needs-new-one"
  },
  {
    "text": "AT&T says hackers stole records of nearly all cellular customers' calls and texts  —  The data contains records of calls and texts between approximately May 1 and Oct. 31, 2022, and on Jan. 2, 2023.  —  Hackers stole six months' worth of call and text message records of nearly every … ",
    "url": "https://www.nbcnews.com/news/us-news/t-says-hackers-stole-records-nearly-cell-customers-calls-texts-rcna161507"
  }
]