[
  {
    "text": "Jen Rubin exits Washington Post, joins Norm Eisen to launch new outlet countering ‘authoritarian threat’  —  New York CNN  —  Veteran opinion columnist Jennifer Rubin is becoming the latest in a long list of Washington Post figures to leave the troubled institution.",
    "url": "https://www.cnn.com/2025/01/13/media/jennifer-rubin-norm-eisen-contrarian-washington-post/"
  },
  {
    "text": "Jennifer Rubin resigns from Washington Post  —  Journalist Jennifer Rubin has resigned from her position as a columnist at The Washington Post amid a period of internal strife at the outlet to begin the new year.  —  Rubin, who has been a columnist at the Post for years … ",
    "url": "https://thehill.com/homenews/media/5082152-jennifer-rubin-resigns-washington-post/"
  },
  {
    "text": "House Republicans and Trump discuss tying California wildfire aid to debt ceiling  —  The current California fires could become the costliest natural disaster in U.S. history.  —  A group of House Republicans and President-elect Donald Trump talked about tying wildfire aid … ",
    "url": "https://www.politico.com/news/2025/01/13/house-republicans-trump-wildfire-aid-00197766"
  },
  {
    "text": "Trump's thuggish response to the California fires is a bad omen  —  Southern California is experiencing its most devastating winter fire season in more than 40 years.  As of Sunday, ongoing wildfires have destroyed more than 12,000 homes and killed at least 24 people while burning through an area larger than San Francisco.",
    "url": "https://www.publicnotice.co/p/trump-california-wildfires-response-newsom"
  },
  {
    "text": "Exclusive: $50M deal reached on Trump special session  —  DRIVING THE DAY: The death toll of the Los Angeles County fires reached 24 on Sunday.  — Gov. Gavin Newsom invited President-elect Donald Trump to meet with residents affected by the wildfires.  — So did Los Angeles officials … ",
    "url": "https://www.politico.com/newsletters/california-playbook/2025/01/13/exclusive-deal-reached-on-trump-special-session-00197768"
  },
  {
    "text": "NVIDIA Statement on the Biden Administration's Misguided ‘AI Diffusion’ Rule  —  For decades, leadership in computing and software ecosystems has been a cornerstone of American strength and influence worldwide.  The federal government has wisely refrained from dictating the design … ",
    "url": "https://blogs.nvidia.com/blog/ai-policy/"
  },
  {
    "text": "In Praise of California  —  It has its flaws — what place doesn't? — but it plays a big role in America's greatness  —  One of the unwritten rules of American politics is that it's OK to sneer at and smear our big cities and the people who live in them, while it's an outrageous act … ",
    "url": "https://paulkrugman.substack.com/p/in-praise-of-california"
  },
  {
    "text": "Don't Call Kennedy a Vaccine Skeptic.  Call Him What He Is: A Cynic.  —  The news media labels Robert F. Kennedy Jr. a “vaccine skeptic.”  He's not.  I'm an actual vaccine skeptic.  In fact, everyone who serves with me on the Food and Drug Administration's vaccine advisory committee is a vaccine skeptic.",
    "url": "https://www.nytimes.com/2025/01/13/opinion/rfk-jr-is-a-vaccine-cynic.html?unlocked_article_code=1.o04.Z733.bTqiMVnTMqsm&smid=url-share"
  },
  {
    "text": "How Lagging Vaccination Could Lead to a Polio Resurgence  —  In its original form, the virus survives in just two countries.  But a type linked to an oral vaccine used in other nations has already turned up in the West.  —  Most American parents hardly give thought to polio beyond the instant … ",
    "url": "https://www.nytimes.com/2025/01/13/health/polio-vaccine-outbreaks.html"
  },
  {
    "text": "Incoming Trump Team Is Questioning National Security Council Staff Over Loyalty  —  Nonpolitical career civil servants are reportedly being grilled over who they voted for, their political contributions and more.  —  LOADING  —  Incoming senior Trump administration officials … ",
    "url": "https://www.huffpost.com/entry/donald-trump-nsc-loyalty-questions_n_6785077ae4b038251e9354a1"
  },
  {
    "text": "Pete Hegseth Is a Test  —  Inside the Senate's torturous debates over Donald Trump's worst cabinet nominee.  —  Pete Hegseth is, by every measure, an abysmal nominee to run the American military.  The Army National Guard veteran and former Fox News commentator has no experience managing enormous … ",
    "url": "https://nymag.com/intelligencer/article/inside-the-senate-battle-over-pete-hegseths-nomination.html"
  },
  {
    "text": "117. Judge Cannon and the Special Counsel's Report  —  The Supreme Court could soon be dragged into one last dispute arising from the prosecutions of President-Elect Trump—this time over public release of part of the Special Counsel's final report  —  Welcome back to “One First,” … ",
    "url": "https://www.stevevladeck.com/p/117-judge-cannon-and-the-special"
  },
  {
    "text": "Suspect arrested with ‘flamethrower’ near LA Fire is an illegal immigrant: sources  —  The homeless man tackled and zip-tied by onlookers who say he was trying to start fires with a blowtorch near a Los Angeles wildfire is an illegal immigrant who will likely be protected by California's sanctuary city status, according to sources.",
    "url": "https://nypost.com/2025/01/13/us-news/suspect-arrested-with-flamethrower-near-kenneth-fire-is-an-illegal-immigrant-report/"
  },
  {
    "text": "The people should own the town square  —  For any enquiry regarding this announcement, please contact press@joinmastodon.org  —  Mastodon was founded on the principles that people should be able to control their social circle online, curate their own timeline, and convene freely with any community of their choosing.",
    "url": "https://blog.joinmastodon.org/2025/01/the-people-should-own-the-town-square/"
  },
  {
    "text": "Trump's deportation vows only for ‘rabid’ Republicans and will fail, says Newt Gingrich  —  Former US House speaker says documented people, Dreamers, mothers and children must not be deported  —  Newt Gingrich, the former US House speaker and presidential hopeful, said a section … ",
    "url": "https://www.theguardian.com/us-news/2025/jan/13/trump-immigration-newt-gingrich"
  },
  {
    "text": "Statement from President Joe Biden on Approving Student Debt Cancellation for Over 5 Million Americans  —  Today, my Administration is approving student loan relief for more than 150,000 borrowers - bringing the total number of Americans who have had their student debt cancelled by my Administration to over 5 million.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/13/statement-from-president-joe-biden-on-approving-student-debt-cancellation-for-over-5-million-americans/"
  },
  {
    "text": "Defense pick Pete Hegseth repeatedly criticized removing names of Confederate generals from US bases  —  Pete Hegseth, President-elect Donald Trump's pick for secretary of defense, has voiced strong opposition to removing the names of Confederate generals from US military bases, repeatedly saying the names should be changed back.",
    "url": "https://www.cnn.com/2025/01/13/politics/pete-hegseth-confederate-generals-military-bases/"
  },
  {
    "text": "Before Taking Office, L.A.'s Mayor Said She Would Not Go Abroad  —  Mayor Karen Bass of Los Angeles has been criticized for being out of the country when the wildfires broke out.  Three years ago, she promised in an interview to cut back on her world travel and focus on the city.",
    "url": "https://www.nytimes.com/2025/01/12/us/karen-bass-ghana-wildfire-travel-los-angeles.html"
  },
  {
    "text": "Hegseth's views on women in combat, infidelity and more — in his own words  —  Pete Hegseth will try to convince members of the Senate Armed Services Committee on Tuesday that he should be the next secretary of defense, following weeks of meetings with lawmakers who peppered him with questions … ",
    "url": "https://apnews.com/article/pete-hegseth-background-defense-secretary-confirmation-hearing-e160e10c86385a8beff110d9190fb34e"
  },
  {
    "text": "FBI Director Chris Wray defends embattled bureau and warns of ‘unprecedented’ threats  —  In AJC interview, outgoing director says he still considers Atlanta home  —  WASHINGTON — Outgoing FBI Director Christopher Wray defended the bureau as it faces a barrage of attacks from President-elect Donald Trump and his allies.",
    "url": "https://www.ajc.com/politics/fbi-director-chris-wray-defends-embattled-bureau-and-warns-of-unprecedented-threats/3O6RCOQ33BFJFBTT33HL42P4IQ/"
  },
  {
    "text": "Moon over Mars?  Congress is determined to kill Elon Musk's space dream.  —  The Trump ally wants the U.S. to forgo the lunar surface for the red planet.  He faces one problem: Congress.  —  Trump confidant Elon Musk wants NASA to drop its ambitious plans to return to the moon and instead head straight to Mars.",
    "url": "https://www.politico.com/news/2025/01/13/mars-vs-moon-elon-musk-congress-fight-00197610"
  },
  {
    "text": "‘I Think Things Are Going to Be Bad, Really Bad’: The US Military Debates Possible Deployment on US Soil Under Trump  —  Trump has said he wants to use active duty U.S. troops to quell protests and round up immigrants.  Will the military comply?  —  Two National Guardsmen stand guard outside … ",
    "url": "https://www.politico.com/news/magazine/2025/01/12/trump-military-immigration-domestic-deployment-00195609"
  },
  {
    "text": "Scoop: House Dems plan $10 million opening salvo for 2026 … - Jeffries has already started to message against the legislation, labeling it the “GOP tax scam part two” at a press conference last week. … - The campaign will include TV and digital ads to “hold Republicans accountable … ",
    "url": "https://www.axios.com/2025/01/13/house-democrats-2026-election-economy"
  },
  {
    "text": "Supreme Court allows state and local climate suits against oil companies to proceed  —  WASHINGTON - Oil and gas companies have failed for now to convince the Supreme Court to stop numerous lawsuits filed across the country seeking to recover damages for harms caused by climate change.",
    "url": "https://www.usatoday.com/story/news/politics/2025/01/13/supreme-court-climate-change-oil-companies-hawaii/77436269007/"
  },
  {
    "text": "How Unauthorized Immigrants Help Finance Social Security Benefits  —  Undocumented workers often pay taxes that help fund programs like Social Security — even if they can't collect from them in the future.  —  The Social Security Administration receives billions in free money each year … ",
    "url": "https://www.nytimes.com/2025/01/13/business/social-security-undocumented-immigrants.html"
  }
]