[
  {
    "text": "The testimony from Trump's White House chief of staff could change everything  —  Former White House chief of staff Mark Meadows rolled the dice on Monday with his opening move in the sprawling Fulton County election subversion trial: he took the stand himself.",
    "url": "https://www.cnn.com/2023/08/29/politics/mark-meadows-gamble-trump-fani-willis/"
  },
  {
    "text": "Mark Meadows struggles to distance himself from Trump's plot  —  The many prosecutions involving former president Donald Trump effectively began in earnest Monday — and with a bang.  Former Trump White House chief of staff Mark Meadows opted to take the stand in Georgia with a bold … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/29/mark-meadows-struggles-distance-himself-trumps-plot/"
  },
  {
    "text": "Here's how Trump may try to challenge Jack Smith and delay his March 4 trial  —  Attorneys for former President Donald Trump have previewed that they will be seeking to launch several legal maneuvers to gum up the federal election subversion case that has been brought against him by special counsel Jack Smith.",
    "url": "https://www.cnn.com/2023/08/29/politics/trump-election-case-legal-challenges/"
  },
  {
    "text": "Jack Smith's Team Grilled Witnesses About Rudy Giuliani's Drinking  —  The special counsel's interest in Rudy's drinking could play a role in undermining one of Trump's key legal defenses … In their questioning of multiple witnesses, Smith's team of federal investigators have asked questions … ",
    "url": "https://www.rollingstone.com/politics/politics-features/rudy-giuliani-jack-smith-donald-trump-jan6-1234814129/"
  },
  {
    "text": "How Trump's Election Lies Left the Michigan G.O.P. Broken and Battered  —  Infighting between Trump acolytes and traditionalists has driven away donors and voters.  Can the Michigan Republican Party rebuild in time for the presidential election?  —  The Michigan Republican Party is starving for cash.",
    "url": "https://www.nytimes.com/2023/08/29/us/politics/trump-michigan-republican-party.html"
  },
  {
    "text": "Biden administration names 10 prescription drugs for price negotiations  —  The Biden administration Tuesday identified 10 expensive prescription drugs that have been chosen for price negotiations with pharmaceutical manufacturers as the government seeks to ease the financial burden on older and disabled Americans.",
    "url": "https://www.washingtonpost.com/health/2023/08/29/medicare-drug-price-negotiations/"
  },
  {
    "text": "The Fourteenth Amendment Fantasy  —  The Constitution won't disqualify Trump from running.  The only real-world way of stopping him is through the ballot box.  —  The fourteenth amendment won't save us from Donald Trump.  —  Eminent jurists are promising that it will.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/08/trump-disqualified-president-14th-amendment/675163/"
  },
  {
    "text": "Texas Guardsmen spied on migrants via WhatsApp, mishandled secret docs  —  Senior leaders allegedly ignored oversight officials' concerns.  —  This article is co-published and co-reported with The Texas Tribune, a nonprofit newsroom that informs Texans about state policy and politics.",
    "url": "https://www.armytimes.com/news/your-army/2023/08/29/texas-guardsmen-spied-on-migrants-via-whatsapp-mishandled-secret-docs/"
  },
  {
    "text": "The Jolt: Trump loyalists mount ‘defund’ movement targeting Fulton DA  —  News and analysis from the AJC politics team  —  X  —  U.S. Rep. Andrew Clyde opened a new front in the pro-Donald Trump offensive meant to undercut Fulton County District Attorney Fani Willis' indictment of the former president and his allies.",
    "url": "https://www.ajc.com/politics/politics-blog/the-jolt-trump-loyalists-mount-defund-movement-targeting-fulton-da/3PIXZSVO4NFNFFCNEDTOGZHO2E/"
  },
  {
    "text": "The Christian home-schooler who made ‘parental rights’ a GOP rallying cry  —  On a private call with Christian millionaires, home-schooling pioneer Michael Farris pushed for a strategy aimed at siphoning billions of tax dollars from public schools  —  The message Michael Farris had come … ",
    "url": "https://www.washingtonpost.com/education/2023/08/29/michael-farris-homeschoolers-parents-rights-ziklag/"
  },
  {
    "text": "Supreme Court Justice Amy Coney Barrett Says She Welcomes Public Scrutiny Of Court  —  U.S. Supreme Court Justice Amy Coney Barrett did not offer any opinion, or speak directly about, recent calls for the justices to institute an official code of conduct.  —  LOADING",
    "url": "https://www.huffpost.com/entry/supreme-court-barrett_n_64edc1e4e4b05b73949dea39"
  },
  {
    "text": "Florida reviewers of AP African American Studies sought ‘opposing viewpoints’ of slavery  —  When Florida rejected a new Advanced Placement course on African American Studies, state officials said they objected to the study of several concepts — like reparations, the Black Lives Matter movement and “queer theory.”",
    "url": "https://www.miamiherald.com/news/local/education/article278582149.html"
  },
  {
    "text": "Francis Suarez ends campaign for Republican presidential nomination  —  Miami Mayor Francis Suarez announced Tuesday that he is ending his campaign for the 2024 Republican presidential nomination.  —  “While I have decided to suspend my campaign for President, my commitment to making … ",
    "url": "https://www.cnn.com/2023/08/29/politics/francis-suarez-ends-president-campaign-republican/"
  },
  {
    "text": "GOP salivates at the biggest campaign finance win since Citizens United  —  It could be a seismic shift in how tens of millions of campaign dollars are spent.  —  Republicans have waged a decades-long battle to blow up the campaign-finance laws that rein in big-money spending.",
    "url": "https://www.politico.com/news/2023/08/29/gop-campaign-finance-citizens-united-00113235"
  },
  {
    "text": "The Final Days  —  Joe Biden was determined to get out of Afghanistan—no matter the cost.  —  august is the month when oppressive humidity causes the mass evacuation of official Washington.  In 2021, White House Press Secretary Jen Psaki piled her family into the car for a week at the beach.",
    "url": "https://www.theatlantic.com/magazine/archive/2023/10/afghanistan-withdrawal-biden-decision/675116/"
  },
  {
    "text": "Steve Scalise diagnosed with ‘very treatable’ blood cancer  —  House Majority Leader Steve Scalise (R-La.) was diagnosed with multiple myeloma, a blood cancer, he announced Tuesday.  —  Scalise, 57, has begun treatment and plans to return to Washington, D.C.",
    "url": "https://thehill.com/homenews/house/4176620-steve-scalise-diagnosed-blood-cancer/"
  },
  {
    "text": "FBI announces it has dismantled global network of hacked computers used in major fraud scheme  —  The FBI and European law enforcement agencies dismantled a massive network of hacked computers that had been used to defraud victims of hundreds of millions of dollars, agencies announced Tuesday.",
    "url": "https://www.cnn.com/2023/08/29/politics/fbi-dismantled-network-hacked-computers/"
  },
  {
    "text": "Gadsden flag now a symbol of hate?  —  A schoolboy has become an instant internet legend for defying a school district.  —  The 12-year-old has, as is so often the case, a bunch of patches on his backpack as an expression of his individuality.  His school didn't like one of the patches and demanded that he quit displaying it.",
    "url": "https://hotair.com/david-strom/2023/08/29/gadsden-flag-now-a-symbol-of-hate-n574491"
  },
  {
    "text": "Vivek Ramaswamy thinks college applications should include a 1-mile run and other parts of the Presidential Fitness Test  — GOP presidential candidate Vivek Ramaswamy suggested an additional criteria for college applicants.  — He said colleges should screen applicants on their physical fitness, such as their 1-mile run time.",
    "url": "https://www.businessinsider.com/ramaswamy-thinks-college-applicants-should-be-judged-on-fitness-2023-8?op=1"
  },
  {
    "text": "US announces new Ukraine security package  —  The U.S. on Tuesday announced a new security package for Ukraine valued at $250 million, which includes more small arms ammunition and munitions for missiles for Kyiv.  —  The package announced Tuesday includes AIM-9M air defense missiles … ",
    "url": "https://thehill.com/policy/defense/4177107-us-announces-new-ukraine-security-package/"
  },
  {
    "text": "Conservative Coalition Recruiting for Plan to Dismantle Federal Government  —  NOW HIRING  —  A coalition of right-wing organizations has started recruiting thousands of people as part of a project aimed at gutting the federal government in anticipation of a Republican victory in the 2024 election, according to a report.",
    "url": "https://www.thedailybeast.com/project-2025-conservative-coalition-recruiting-for-plan-to-dismantle-federal-government"
  }
]