[
  {
    "text": "Biden Allows Ukraine to Strike Russia With Long-Range U.S. Missiles  —  With two months left in office, the president for the first time authorized the Ukrainian military to use the system known as ATACMS to help defend its forces in the Kursk region of Russia.",
    "url": "https://www.nytimes.com/2024/11/17/us/politics/biden-ukraine-russia-atacms-missiles.html?unlocked_article_code=1.ak4.aBOC.aSmYrVBqcXMF&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Biden allows Ukraine to use US arms to strike inside Russia  —  President Joe Biden's administration will allow Ukraine to use U.S.-provided weapons to strike deep into Russian territory, three sources familiar with the matter said, in a significant change to Washington's policy in the Ukraine-Russia conflict.",
    "url": "https://www.reuters.com/world/biden-lifts-ban-ukraine-using-us-arms-strike-inside-russia-2024-11-17/"
  },
  {
    "text": "Biden approves Ukraine's use of long-range U.S. weapons inside Russia, reversing policy  —  The Biden administration will allow Kyiv limited use of ATACMS to strike enemy positions in Russia, according to senior U.S. officials.  —  President Joe Biden has authorized Ukraine to use … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/17/ukraine-russia-north-korea-atacms/"
  },
  {
    "text": "Biden authorizes Ukraine to use US-supplied long-range missiles for deeper strikes inside Russia  —  President Joe Biden has authorized Ukraine to use U.S.-supplied long-range missiles to strike deeper inside Russia, easing limitations on the weapons as Russia deploys thousands of North Korean troops … ",
    "url": "https://apnews.com/article/biden-ukraine-long-range-weapons-russia-52d424158182de2044ecc8bfcf011f9c"
  },
  {
    "text": "Haitian immigrants flee Springfield, Ohio, in droves after Trump election win  —  City subjected to false rumors from Trump loses residents integral to community over mass deportation fears  —  From a tiny office behind a Haitian grocery store on Springfield's South Limestone Street … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/17/haitian-immigrants-springfield-ohio-trump-election"
  },
  {
    "text": "Undocumented migrants hope Trump mass deportations only ‘for criminals’  —  Gabriela entered the United States more than two decades ago, gasping for breath under a pile of corn stalks in the boot of a smuggler's car.  —  Now a housekeeper in Maryland, the Bolivian national … ",
    "url": "https://www.bbc.com/news/articles/c79zxjj0j55o"
  },
  {
    "text": "Enough  —  For the past decade, as Donald Trump has risen in political stature, I have waited for that precarious but inevitable moment when his well-documented liabilities would end his political ascendancy, when it would all finally be too much.  I waited through scandalous allegations … ",
    "url": "https://www.nytimes.com/2024/11/17/opinion/america-trump-tolerance.html"
  },
  {
    "text": "After Flurry of Cabinet Picks, Trump Rethinks Candidates for Treasury Secretary  —  President-elect Donald J. Trump is expected to invite the contenders for the role, including Kevin Warsh and Marc Rowan, to Mar-a-Lago this week.  —  President-elect Donald J. Trump is eyeing a new candidate … ",
    "url": "https://www.nytimes.com/2024/11/17/us/politics/trump-treasury-candidates.html"
  },
  {
    "text": "Republicans suddenly think the economy's great and the election wasn't rigged  —  Less than two weeks since Donald Trump's victory, consumer sentiment in the Republican Party has skyrocketed.  Democrats, meanwhile, are despondent.  —  The vibes have officially shifted.  —  The economy Donald Trump said was broken?",
    "url": "https://www.politico.com/news/2024/11/17/republicans-trump-win-economy-election-security-confidence-00189941"
  },
  {
    "text": "Trump Makes RFK Jr. Pose with McDonald's Meal  —  Robert F. Kennedy Jr., who's set to run the Health and Human Services Department, recently complained that flying with Trump means eating “poison”  —  Robert F. Kennedy Jr., who is Donald Trump's pick to run the Department of Health and Human Services … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-rfk-jr-mcdonalds-meal-seed-oil-1235169870/"
  },
  {
    "text": "Trump Signals a ‘Seismic Shift,’ Shocking the Washington Establishment  —  The president-elect's early transition moves amount to a generational test of a system as he seeks to rewrite the balance of power and install lieutenants to blow up key parts of government.  —  Somehow disruption doesn't begin to cover it.",
    "url": "https://www.nytimes.com/2024/11/17/us/politics/trump-signals-a-seismic-shift-shocking-the-washington-establishment.html"
  },
  {
    "text": "Pollster Ann Selzer ending election polling, moving ‘to other ventures and opportunities’  —  Public opinion polling has been my life's work.  I collected my first research data as a freshman in college, if you don't count a neighborhood poll I did at age 5.",
    "url": "https://www.desmoinesregister.com/story/opinion/columnists/2024/11/17/ann-selzer-conducts-iowa-poll-ending-election-polling-moving-to-other-opportunities/76334909007/"
  },
  {
    "text": "Trump Team Is Seeking to Ease US Rules for Self-Driving Cars  — Policy leaders are being pursued for key Musk priority  — Tesla CEO, named to efficiency role, plans push on robotaxis  —  Members of President-elect Donald Trump's transition team have told advisers they plan … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-17/trump-team-said-to-want-to-ease-us-rules-for-self-driving-cars"
  },
  {
    "text": "In Donald Trump, the morality of civil society has been abandoned  —  Limiting access to civic education in US schools leads people to be less well educated in basic principles  —  The reason Donald Trump won is because he exemplifies men who think only of themselves.",
    "url": "https://www.theguardian.com/theobserver/2024/nov/17/in-donald-trump-the-morality-of-civil-society-has-been-abandoned"
  },
  {
    "text": "From the Amazon rainforest, Biden declares nobody can reverse US progress on clean energy  —  Joe Biden witnessed the devastation of drought up close as the first sitting American president to visit the Amazon rainforest Sunday, declaring that nobody can reverse “the clean energy revolution that's underway … ",
    "url": "https://apnews.com/article/biden-amazon-peru-g20-3cc827382d1e3c32865a14616ddfe467"
  },
  {
    "text": "Donald Trump's Cabinet of Wonders  —  The President-elect's nominations look like the most flagrant act of vindictive trolling since the rise of the Internet.  But it is a trolling beyond mischief.  —  In the first few days after the reëlection of Donald Trump, one heard across … ",
    "url": "https://www.newyorker.com/magazine/2024/11/25/donald-trumps-cabinet-of-wonders?currentPage=all"
  },
  {
    "text": "Trump defense secretary pick Pete Hegseth denies sexual assault allegation, acknowledges payment to accuser  —  In a statement, Hegseth's attorney said the former Fox News host paid a woman in 2023 who had previously accused him of sexual assault but maintained that the woman lied.",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-defense-pick-pete-hegseth-denies-sexual-assault-allegation-rcna180535"
  },
  {
    "text": "Trump picks fracking company CEO Chris Wright as next Department of Energy secretary  —  President-elect Donald Trump on Saturday named Chris Wright, the CEO of Denver-based fracking company Liberty Energy, as his pick to be the next secretary of the Department of Energy.",
    "url": "https://www.cnn.com/2024/11/16/politics/chris-wright-energy-secretary-trump/"
  }
]