[
  {
    "text": "Trump ousts at least 15 independent inspectors general in late-night purge  —  The dismissals appeared to violate federal law, which requires Congress to receive 30 days' notice of any intent to fire a Senate-confirmed inspector general.",
    "url": "https://www.washingtonpost.com/politics/2025/01/24/trump-fire-inspectors-general-federal-agencies/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3Njk0ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MDc3MTk5LCJpYXQiOjE3Mzc2OTQ4MDAsImp0aSI6IjM0ZGM3MzVkLTU4ODktNDEzOC04MWQ1LTEwZjQzOGY3NjUzZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzI0L3RydW1wLWZpcmUtaW5zcGVjdG9ycy1nZW5lcmFsLWZlZGVyYWwtYWdlbmNpZXMvIn0.8XF_Noz3ifkriOenjwC09PgmWb3cN91LcQD73dnY3uA&itid=gfta"
  },
  {
    "text": "Trump fires independent inspectors general in Friday night purge  —  The watchdogs say the removals may be invalid for failing to comply with a 2022 law requiring a 30-day notification to Congress before removals.  —  President Donald Trump fired multiple independent federal watchdogs … ",
    "url": "https://www.politico.com/news/2025/01/25/donald-trump-inspectors-general-firing-00200611"
  },
  {
    "text": "Trump Fires at Least 12 Inspectors General in Late-Night Purge  —  The internal government watchdogs were believed to have been dismissed at several major agencies, though the Justice Department's was not said to have been among them.  —  President Trump fired at least 12 inspectors general late … ",
    "url": "https://www.nytimes.com/2025/01/24/us/politics/trump-fires-inspectors-general.html"
  },
  {
    "text": "Trump fires 17 independent inspectors general at federal agencies, source says  —  U.S. President Donald Trump fired 17 independent watchdogs at multiple government agencies on Friday, a person with knowledge of the matter said, eliminating a critical oversight component and clearing the way to replace them with loyalists.",
    "url": "https://www.reuters.com/world/us/trump-fires-least-12-independent-inspectors-general-washington-post-reports-2025-01-25/"
  },
  {
    "text": "McConnell sends a message  —  With a vote against Pete Hegseth, the former GOP leader makes clear he will be an unreliable ally of Donald Trump.  —  Mitch McConnell might not run the Senate anymore.  But he made clear on Friday night that he still knows how to wield power.",
    "url": "https://www.politico.com/news/2025/01/24/pete-hegseth-vote-mcconnell-006649"
  },
  {
    "text": "Trump's canceling of 50 security clearances is unprecedented and partisan, experts say  —  The move is meant to please Trump voters, punish perceived enemies and represents “the most politically saturated security action since the Oppenheimer case in the 1950s.”",
    "url": "https://www.nbcnews.com/politics/national-security/trumps-canceling-scores-security-clearances-unprecedented-rcna189245?utm"
  },
  {
    "text": "Let's Get to the Marrow of What Trump Just Did  —  This is an edited transcript of an episode of “The Ezra Klein Show.”  You can listen to the conversation by following or subscribing to the show on the NYT Audio App, Apple, Spotify, Amazon Music, YouTube, iHeartRadio or wherever you get your podcasts.",
    "url": "https://www.nytimes.com/2025/01/25/opinion/ezra-klein-podcast-dara-lind-matthew-yglesias.html"
  },
  {
    "text": "Kristi Noem confirmed by Senate as secretary of Dept. of Homeland Security  —  The role is key to Trump's plans for his second term after his pledge to deport millions of undocumented immigrants and impose a crackdown at the U.S.-Mexico border.  —  Kristi L. Noem, President Donald Trump's nominee … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/25/kristi-noem-dhs/"
  },
  {
    "text": "Through the blizzard of edicts, see Trump for what he is: an autocrat reaching for limitless power  —  In just 100 hours, the returned president has already revealed his goal and exposed the weakness of those who might challenge him  —  It's hard to see in a blizzard.",
    "url": "https://www.theguardian.com/commentisfree/2025/jan/24/donald-trump-executive-orders-autocrat-limitless-power"
  },
  {
    "text": "Scientists at NIH can't purchase supplies for their studies after Trump administration pauses outside communications  —  Scientists at the National Institutes of Health have been told the communications pause announced by the Trump Administration earlier this week includes a pause on all purchasing … ",
    "url": "https://www.cnn.com/2025/01/24/health/nih-scientists-purchase-supplies-trump-administration-pauses-communications/"
  },
  {
    "text": "Keene man arrested for storming the Capitol on Jan. 6 rejects Trump's pardon  —  On his first day in office this week, President Donald Trump pardoned all rioters at the Jan. 6 attack on the U.S. Capitol.  Jason Riddle served time in jail for his participation in the 2021 riot where he stole … ",
    "url": "https://www.nhpr.org/nh-news/2025-01-24/keene-man-arrested-for-storming-the-capitol-on-jan-6-rejects-trumps-pardon"
  },
  {
    "text": "Elon Musk appears on video at German far right campaign event  —  Elon Musk made a surprise appearance during Germany's AfD (Alternative fuer Deutschland) election campaign event in Halle in eastern Germany on Saturday, speaking publicly in support of the far right party for the second time in as many weeks.",
    "url": "https://www.reuters.com/world/europe/elon-musk-appears-video-german-far-right-campaign-event-2025-01-25/"
  },
  {
    "text": "‘Hit Him Back Twice as Hard’: Canada's No. 1 Populist Has a Risky Trump Strategy  —  Eight years ago, Justin Trudeau was the face of Canadian resistance to Trump.  Not anymore.  —  “I'm a street fighter in politics,” Ontario Premier Doug Ford said.  “If someone throws a punch at me, I'm going to hit him back twice as hard.”",
    "url": "https://www.politico.com/news/magazine/2025/01/25/doug-ford-trump-trade-resistance-00200457"
  },
  {
    "text": "Pete Hegseth Is Confirmed as Defense Secretary By Slim Margin  —  Pete Hegseth has vowed to bring his “warrior” ethos to the Pentagon.  Democrats had assailed him as unfit for the job, and his confirmation came down to Vice President JD Vance serving as tiebreaker.",
    "url": "https://www.nytimes.com/live/2025/01/24/us/pete-hegseth-defense-secretary-vote"
  },
  {
    "text": "JD Vance said ‘Trump and I will stop this,’ but Skyline Chili ice cream is still happening  —  A polarizing collaboration Vice President JD Vance promised to stop is moving forward.  —  Graeter's Ice Cream and Skyline Chili are releasing a new Skyline Spice Ice Cream flavor Monday, the two chains said in an announcement Friday.",
    "url": "https://www.cincinnati.com/story/entertainment/2025/01/24/despite-jd-vance-promise-to-stop-skyline-chili-ice-cream-graeters/77911562007/"
  },
  {
    "text": "China tells Rubio to behave himself in veiled warning  —  China's veteran foreign minister has issued a veiled warning to America's new secretary of state: Behave yourself.  Foreign Minister Wang Yi conveyed the message in a phone call Friday, their first conversation since Marco Rubio's confirmation … ",
    "url": "https://apnews.com/article/china-us-rubio-wang-phone-0c2dfd278aa002cfb6100683daec5b7f"
  },
  {
    "text": "Trump's Crypto Venture Divides the Industry He Aims to Support  —  The president's promotion of a speculative digital coin left some crypto investors feeling blindsided, while others saw it as a gimmick that undermined the industry's credibility.  —  Dressed in ball gowns, tuxedos and … ",
    "url": "https://www.nytimes.com/2025/01/25/us/politics/trumps-crypto-venture-divides-the-industry-he-aims-to-support.html?unlocked_article_code=1.r04.gjsf.lSovxP_CKvBU&smid=url-share"
  },
  {
    "text": "Mexico refuses to accept a U.S. deportation flight  —  The Mexican government has criticized President Donald Trump's unilateral immigration actions, and the landing would have required Mexico's assistance.  —  WASHINGTON — Mexico denied a U.S. military plane access to land Thursday … ",
    "url": "https://www.nbcnews.com/politics/immigration/mexico-refuses-accept-us-deportation-flight-rcna189182"
  },
  {
    "text": "Deportation Fears Spread Among Immigrants With Provisional Legal Status  —  President Trump is targeting people who have been living in the country under Biden immigration programs that shielded them from deportation and allowed them to work.  —  Bearing Social Security numbers and employment authorization … ",
    "url": "https://www.nytimes.com/2025/01/24/us/trump-deportation-legal-immigrant-fears.html"
  }
]