[
  {
    "text": "Trump Says He Will Nominate Kash Patel to Run F.B.I.  —  President-elect Donald J. Trump turned to a firebrand loyalist to become director of the bureau, which he sees as part of a ‘deep state’ conspiracy against him.  —  President-elect Donald J. Trump said on Saturday that he wants … ",
    "url": "https://www.nytimes.com/2024/11/30/us/politics/trump-replace-christopher-wray.html?unlocked_article_code=1.eE4.w9RE.n67AAUSC95x0&smid=url-share"
  },
  {
    "text": "Trump taps Kash Patel for FBI director, an ally who would aid in his effort to upend law enforcement  —  President-elect Donald Trump says he will nominate Kash Patel to serve as FBI director, turning to a fierce ally to upend America's premier law enforcement agency and rid the government of perceived “conspirators.”",
    "url": "https://apnews.com/article/trump-fbi-patel-wray-879dc7629905946cc242e90f6ab98739"
  },
  {
    "text": "Trump taps Kash Patel for FBI director  —  Patel served as chief of staff to to the acting secretary of defense during the first Trump administration.  —  President-elect Donald Trump announced Saturday he would pick Kash Patel, the former chief of staff to to the acting secretary … ",
    "url": "https://www.nbcnews.com/politics/national-security/trump-taps-kash-patel-fbi-director-rcna179736"
  },
  {
    "text": "Trump Picks Kash Patel as FBI Director  —  President-elect chooses loyalist as he looks to force out current leader Christopher Wray  —  WASHINGTON—Donald Trump has chosen Kash Patel to be Federal Bureau of Investigation director, moving to force out the bureau's current leader … ",
    "url": "https://www.wsj.com/politics/elections/trump-picks-kash-patel-as-fbi-director-06a1cdc2?st=GEWuQa&reflink=article_copyURL_share"
  },
  {
    "text": "Trump nominates Charles Kushner, father of Jared Kushner, as US Ambassador to France  —  WASHINGTON - President-elect Donald Trump selected Charles Kushner, father of Jared Kushner, to serve as U.S. Ambassador to France on Saturday.  —  “I am pleased to nominate Charles Kusher, of New Jersey … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/11/30/trump-charles-kushner-france-ambassador/76677177007/"
  },
  {
    "text": "Charles Kushner, pardoned in 2020, to be nominated ambassador to France  —  The New Jersey real estate developer, political donor and philanthropist is also the father of Trump's son-in-law Jared Kushner.  —  President-elect Donald Trump said on Saturday he would nominate Charles Kushner … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/30/donald-trump-charles-kushner/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMyOTQyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0MzI1MTk5LCJpYXQiOjE3MzI5NDI4MDAsImp0aSI6IjRhNjY2YzdmLTc1NjctNGRmOC05OGU3LTBiMTQzNzM4NzYxYSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzExLzMwL2RvbmFsZC10cnVtcC1jaGFybGVzLWt1c2huZXIvIn0.VpAR1B9yDLB2ag9SQAJ49Lg7SpMKg5K6WdBsqI0NlJk&itid=gfta"
  },
  {
    "text": "Trump threatens 100% tariff on the BRIC bloc of nations if they act to undermine US dollar  —  President-elect Donald Trump on Saturday threatened 100% tariffs against a bloc of nine nations if they act to undermine the U.S. dollar.  His threat was directed at countries in the so-called BRIC alliance … ",
    "url": "https://apnews.com/article/trump-dollar-dominance-brics-treasury-8572985f41754fe008b98f38180945c3"
  },
  {
    "text": "Trump is now threatening 100% tariffs on the BRICS group — which comprises 9 emerging market countries  — Trump on Saturday floated “100% tariffs” on the BRICS group of emerging markets.  — Trump is pushing back on efforts to dethrone the US dollar as the primary global reserve currency.",
    "url": "https://www.businessinsider.com/trump-tariffs-brics-nations-trade-war-us-dollar-2024-11"
  },
  {
    "text": "What to know about sudden rebel gains in Syria's 13-year war and why it matters  —  The 13-year civil war in Syria has roared back into prominence with a surprise rebel offensive on Aleppo, one of Syria's largest cities and an ancient business hub.  The push is among the rebels' strongest … ",
    "url": "https://apnews.com/article/syria-hts-assad-aleppo-fighting-2be43ee530b7932b123a0f26b158ac22"
  },
  {
    "text": "Journalists flock to Bluesky as X becomes increasingly ‘toxic’  —  Journalists are finding more readers and less hate on Bluesky than on the platform they used to know as Twitter.  —  When Ashton Pittman, an award-winning news editor and reporter, first joined the app Bluesky, he said … ",
    "url": "https://www.nbcnews.com/tech/social-media/bluesky-x-becomes-social-media-rcna181685"
  },
  {
    "text": "Former House Democrat lays into ‘toxic’ party, calls for ‘rebrand’ after election blowout  —  As assessments of what went wrong for Democrats in the 2024 election have poured in over the past few weeks and the party searches for its next leader, one former House member is calling for a “complete rebranding.”",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3246295/former-house-democrat-lays-into-toxic-party/"
  },
  {
    "text": "Ex-Dem Rep Tim Ryan Warns On MSNBC His Own Party ‘Is Toxic’ To Voters: ‘What Are We Doing?’  —  Former Rep. Tim Ryan (D-OH) told MSNBC that Democrats need a complete “rebrand” and to find common ground with MAGA figures like Elon Musk.  —  Ryan joined MSNBC's The Weekend on Saturday and offered … ",
    "url": "https://www.mediaite.com/tv/ex-dem-rep-tim-ryan-warns-on-msnbc-his-own-party-is-toxic-to-voters-what-are-we-doing/"
  },
  {
    "text": "Statement by NSC Spokesperson Sean Savett on Edan Alexander  —  The hostage video released today of American-Israeli citizen Edan Alexander is a cruel reminder of Hamas's terror against citizens of multiple countries, including our own.  We have been in touch with Edan's family.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/11/30/statement-by-nsc-spokesperson-sean-savett-on-edan-alexander/"
  },
  {
    "text": "Iceland Opposition Social Democrats Set for Election Victory  — Party is seen getting most seats in Nordic nation's parliament  — Voters' dismay over sticky inflation dominated short campaign  —  Iceland's opposition Social Democrats remain on track to win snap parliamentary elections … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-01/icelandic-opposition-party-on-track-to-win-snap-elections"
  },
  {
    "text": "Trump taps Florida sheriff as DEA administrator  —  The change in DEA leadership comes as the agency — and the nation — is still grappling with a drug crisis fueled by the flow of illicit fentanyl.  —  President-elect Donald Trump on Saturday tapped Hillsborough County Sheriff Chad Chronister … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/30/chad-chronister-dea-administrator-trump/"
  },
  {
    "text": "Pete Hegseth's Mom Said He Abused ‘Many’ Women in Bombshell Email  —  CLOSE TO HOME  —  The family matriarch said in a 2018 email that she had “no respect” for the Fox News host turned Trump defense secretary nominee.  —  Pete Hegseth's mother trashed his character in a blistering email shortly … ",
    "url": "https://www.thedailybeast.com/pete-hegseths-mom-said-he-abused-many-women-in-bombshell-email/"
  }
]