[
  {
    "text": "Sarah Palin Says Civil War Is ‘Going to Happen’ After Trump's Arrest  —  ‘RISE UP’  —  Sarah Palin responded to Donald Trump's arrest in Georgia on Thursday night by talking up the possibility of civil war.  Speaking to Eric Bolling as the former president was booked at the Fulton County Jail … ",
    "url": "https://www.thedailybeast.com/sarah-palin-says-civil-war-is-going-to-happen-after-trumps-arrest"
  },
  {
    "text": "Trump's Mug Shot Gives His Haters Nothing  —  Donald Trump dropped in for a photo op in Georgia last night—not the usual kibbitz on the hustings for a former president, but a killer visual to end the week with: a mug shot.  —  And just like that, Trump was restored to his accustomed place in the Republican dogpile: everywhere.",
    "url": "https://www.theatlantic.com/politics/archive/2023/08/donald-trump-georgia-mug-shot-debate/675133/"
  },
  {
    "text": "A Trump Mug Shot for History  —  The former president's booking photo is unprecedented.  And that's just the beginning of its significance.  —  As soon as it was taken, it became the de facto picture of the year.  A historic image that will be seared into the public record and referred … ",
    "url": "https://www.nytimes.com/2023/08/25/style/trump-mugshot.html"
  },
  {
    "text": "You can buy Trump's mugshot on a t-shirt  —  Like clockwork, as soon as Trump's mugshot became available, money was being made off of it.  Everyone is getting in on the action.  Joe Biden sent out a fundraising letter, Etsy vendors have many products available from t-shirts to mugs (get it … ",
    "url": "https://hotair.com/karen-townsend/2023/08/25/you-can-buy-trumps-mugshot-on-a-t-shirt-n573601"
  },
  {
    "text": "The GOP's Dispiriting Display  —  The Republican debate was a mess.  —  The first GOP primary debate confirmed the end of the old Republican Party and squelched any hope for a normal presidential election in 2024.  —  First, here are three new stories from The Atlantic:  —  An Inane Spectacle",
    "url": "https://www.theatlantic.com/newsletters/archive/2023/08/gop-republican-presidential-debate/675129/"
  },
  {
    "text": "Ramaswamy raises $450,000 shortly after Republican debate  —  Biotech entrepreneur Vivek Ramaswamy raised $450,000 on Wednesday night after the first GOP debate, his campaign confirmed.  —  Tricia McLaughlin, a senior advisor for the campaign, confirmed the dollar amount, adding in a text message … ",
    "url": "https://thehill.com/homenews/campaign/4171031-ramaswamy-raises-450000-shortly-after-republican-debate/"
  },
  {
    "text": "The Georgia election case against Donald Trump and 18 others is about to get ugly.  Here's why.  —  For former President Donald Trump, Rudy Giuliani and their 17 other co-defendants, the threat of jail time is getting very real for those charged, arrested and booked in the Georgia election fraud case.",
    "url": "https://www.usatoday.com/story/news/politics/2023/08/25/trumps-georgia-election-case-could-get-ugly-as-others-seek-to-avoid-jail/70662386007/"
  },
  {
    "text": "5 more Trump defendants booked at Fulton jail overnight  —  X  —  Five more defendants in the Fulton County Trump case surrendered overnight at the Fulton County jail, hours after former President Donald Trump himself traveled to Atlanta to be booked.  —  First up, Michael Roman, a Trump campaign official.",
    "url": "https://www.ajc.com/news/crime/5-more-trump-defendants-booked-at-fulton-jail-overnight/DOOSLDJQZFCHJE6TGW5QJ4LQJY/"
  },
  {
    "text": "Maui utility may have compromised evidence in fire probe, lawyers say  —  The utility removed damaged poles, lines and other equipment from where the Lahaina fire reportedly started, documents show, before investigators were able to view the scene  —  LAHAINA, Hawaii — The Hawaii power utility believed … ",
    "url": "https://www.washingtonpost.com/climate-environment/2023/08/24/maui-fires-power-utility-lahaina-investigation/"
  },
  {
    "text": "County of Maui releases validated list of names of individuals who remain unaccounted for following  —  8/24/2023 — County of Maui releases validated list of names of individuals who remain unaccounted for following Lahaina wildfire disaster  —  The County of Maui on Thursday released … ",
    "url": "https://www.mauicounty.gov/CivicAlerts.aspx?AID=12763"
  },
  {
    "text": "Endicott man sentenced to federal prison for telephone threats to Marjorie Taylor Greene  —  A Broome County man will spend three months in federal prison for threatening a member of the U.S. Congress last year.  —  Joseph F. Morelli, 51, of Endicott was also sentenced to three years … ",
    "url": "https://www.pressconnects.com/story/news/local/2023/08/25/endicott-man-sentenced-to-prison-for-threats-against-congresswoman/70677121007/"
  },
  {
    "text": "Maryland Court says parents can't opt kids out of LGBTQ+ curriculum: ‘Not a fundamental right’  —  Parents argued the inclusion of LGBTQ+ books indoctrinated their kids  —  A federal court in Maryland decided Thursday that parents can't opt their kids out of reading books with LGBTQ+ content in Montgomery County Schools.",
    "url": "https://www.foxnews.com/politics/maryland-court-parents-cant-opt-kids-lgbtq-curriculum-fundamental-right"
  },
  {
    "text": "The Last Days of Wagner's Prigozhin  —  On the run, the paramilitary chief crisscrossed his global business empire, desperate to show he was still in control; ‘I need more gold’  —  Yevgeny Prigozhin spent his final days planning for the future.  —  Last Friday, the warlord's private jet touched … ",
    "url": "https://www.wsj.com/world/russia/prigozhin-wagner-plane-crash-last-days-2c44dd5c?mod=djemalertNEWS"
  },
  {
    "text": "Split ballot board approves reproductive rights amendment summary written by Ohio Sec. of State  —  In a 3-2 decision, the Ohio Ballot Board rejected using the full amendment proposal text for voters to see, and the approved summary language leaves out protecting contraception, fertility treatment and miscarriage care",
    "url": "https://ohiocapitaljournal.com/2023/08/24/split-ballot-board-approves-reproductive-rights-amendment-summary-written-by-ohio-sec-of-state/"
  },
  {
    "text": "Deadly storm leaves hundreds of thousands without power in Michigan  —  A severe storm in Michigan and northern Ohio left nearly 700,000 people without power Thursday night.  —  Winds of more than 75 mph downed trees, damaged homes and vehicles in hailstorms and killed at least four people in Michigan.",
    "url": "https://thehill.com/homenews/state-watch/4170977-deadly-storm-leaves-hundreds-of-thousands-without-power-in-michigan/"
  }
]