[
  {
    "text": "Joe Biden gives the media a desperately needed lesson about Donald Trump  —  The president has to break the news to journalists that Trump plans to jail us  —  The most disturbing thing I've ever heard a president say did not come from Donald Trump.  —  It came from Joe Biden.",
    "url": "https://www.salon.com/2024/02/24/joe-biden-gives-the-media-a-desperately-needed-lesson-about-donald/"
  },
  {
    "text": "‘Trump appears to be showing gross signs of dementia’: Expert points to new evidence  —  According to psychologist Dr. John Gartner, formerly of Johns Hopkins University Medical School, Donald Trump's slurring and inability to sometimes formulate complete sentences appears to be a sign … ",
    "url": "https://www.rawstory.com/donald-trump-dementia/"
  },
  {
    "text": "Prominent Republican Seeks to Shield the Party From Paying Trump's Legal Bills  —  Henry Barbour, a veteran R.N.C. member, is mounting a long-shot bid to keep the former president from taking control of the committee in order to block it from paying for his lawsuits.",
    "url": "https://www.nytimes.com/2024/02/24/us/politics/trump-barbour-rnc.html"
  },
  {
    "text": "Black leaders, DNC blast Trump for ‘racist’ comments  —  Black leaders are condemning former President Trump's recent comments about Black voters as “racist.”  —  Speaking at the Black Conservative Federation (BCF) annual gala in South Carolina on Friday, Trump said his legal woes have earned … ",
    "url": "https://thehill.com/homenews/race-politics/4486998-black-leaders-dnc-blast-trump-for-racist-comments/"
  },
  {
    "text": "Draft RNC resolution would block payment of candidate's legal bills  —  Two draft resolutions circulated by a member of the Republican National Committee call on the party to adopt proposals that would keep it from having to pay for any presidential candidate's legal fees and would also make it party policy … ",
    "url": "https://www.cbsnews.com/news/draft-rnc-resolution-would-block-paying-candidates-legal-bills/"
  },
  {
    "text": "Fewer grievances, more policy: Trump aides and allies push for a post-South Carolina ‘pivot’  —  In his victory speech Saturday night, Trump notably did not mention Nikki Haley, instead talking about GOP unity and focusing on the general election.  —  COLUMBIA, S.C. — A growing chorus … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-push-south-carolina-pivot-fewer-grievances-rcna140239"
  },
  {
    "text": "Draft RNC resolution would slow the party's embrace of Trump as the nominee  —  A second resolution would bar the RNC from paying the former president's legal bills.  —  COLUMBIA, S.C. — A prominent Republican National Committee member is proposing two resolutions that would put … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/draft-rnc-resolution-trump-nominee-legal-bills-rcna140346"
  },
  {
    "text": "Trump says Black voters like him more because of his indictments and mug shot  —  The GOP candidate tells a group of Black conservatives: 'I'm being indicted for you, the Black population'  —  COLUMBIA, S.C. — Former President Trump sought to appeal to Black voters on Friday night … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/24/trump-black-voters-indicted-mug-shot/"
  },
  {
    "text": "Nazis mingle openly at CPAC, spreading antisemitic conspiracy theories and finding allies  —  The presence of the individuals has been a persistent issue at CPAC, and in previous years, conference organizers have ejected well known nazis and white supremacists, such as Nick Fuentes.",
    "url": "https://www.nbcnews.com/news/us-news/nazis-mingle-openly-cpac-spreading-antisemitic-conspiracy-theories-fin-rcna140335"
  },
  {
    "text": "How ‘Libs of TikTok’ became a powerful presence in Oklahoma schools  —  The owner of the far-right social media account, who sits on a state advisory panel, has drawn attention since the death of a nonbinary student near Tulsa  —  LOS ANGELES — Far-right activist Chaya Raichik splits … ",
    "url": "https://www.washingtonpost.com/technology/2024/02/24/libs-tiktok-oklahoma-nonbinary-teen-death/"
  },
  {
    "text": "Oklahoma senator calls LGBTQ+ people “filth” while commenting on death of Nex Benedict  —  At a legislative forum on Friday, Sen. Tom Woods emphasized the moral and Christian fortitude he aims to represent  —  During a legislative forum in Oklahoma on Friday sponsored by the Tahlequah Area Chamber … ",
    "url": "https://www.salon.com/2024/02/24/oklahoma-senator-calls-lgbtq-people-filth-while-commenting-on-of-nex-benedict/"
  },
  {
    "text": "Okla. lawmaker describes LGBTQ people as ‘filth’  —  State Sen. Tom Woods made comment on Friday  —  Republican Oklahoma state Sen. Tom Woods took part in a public legislative panel forum on Friday, during which the panel was asked by a constituent about the death of Nex Benedict … ",
    "url": "https://www.washingtonblade.com/2024/02/24/okla-lawmaker-describes-lgbtq-people-as-filth/"
  },
  {
    "text": "Warren Buffett's son Howard has given $500M to Ukraine — he warns the US is making a historic mistake by pulling its support  — Business Insider interviewed Warren Buffett's son about his  support for Ukraine.  — Howard Buffett's foundation has given $520 million to Ukraine in humanitarian aid.",
    "url": "https://www.businessinsider.com/howard-buffett-gives-500-million-to-ukraine"
  },
  {
    "text": "Former U.S. spies warned in 2020 that the Hunter Biden scandal had Russian fingerprints.  They feel vindicated now.  —  The Justice Department said this week that informant Alexander Smirnov invented a story about $5 million bribes paid to Joe and Hunter Biden and is also “peddling new lies.”",
    "url": "https://www.nbcnews.com/politics/national-security/former-us-spies-warned-2020-hunter-biden-scandal-russian-fingerprints-rcna140240"
  },
  {
    "text": "Exclusive: Lawmakers Demand Elon Musk Provide SpaceX Internet To US Military In Taiwan  —  Rep. Mike Gallagher, who led a delegation to Taiwan this week, said in a letter to Musk that SpaceX could possibly be in breach of its “contractual obligations with the U.S. government.”",
    "url": "https://www.forbes.com/sites/davidjeans/2024/02/24/elon-musk-taiwan-spacex-starshield/"
  },
  {
    "text": "Being Denied a Press Pass at CPAC Was the Best Way to Cover the Conference  —  This is what happened when MAGA people thought I was one of them.  —  I've attended the Conservative Political Action Conference almost yearly since 2009, always as a credentialed reporter.",
    "url": "https://www.motherjones.com/politics/2024/02/being-denied-a-press-pass-at-cpac-was-the-best-way-to-cover-the-conference/"
  }
]