[
  {
    "text": "Trump Whines About Fox News as Poll Numbers Keep Dropping  —  ‘WRONG!!’  —  “I don't have to make calls to go on TV, or anything else — They call me!” the former president posted on Sunday.  —  Journalist  —  With 71 days until the election, Donald Trump spent Sunday morning ranting … ",
    "url": "https://www.thedailybeast.com/trump-whines-about-fox-news-as-poll-numbers-keep-dropping"
  },
  {
    "text": "Sunday Snapshot: Trump's ambiguous abortion messaging … 1. GOP lawmakers struggle with Trump's abortion policies … - Philip Klein, the editor of the conservative National Review Online, wrote Friday in a piece titled “Trump's Abandonment of Pro-Lifers Is Complete,” that with his Truth Social post … ",
    "url": "https://www.axios.com/2024/08/25/trump-reproductive-rights-sunday-snapshot"
  },
  {
    "text": "Harris leading Trump by 7 points: Poll  —  Vice President Harris holds a 7-point edge over former President Trump nationally in a new poll, marking the latest gain for the Democratic presidential candidate as the general election approaches.  —  A survey from Fairleigh Dickinson University … ",
    "url": "https://thehill.com/homenews/campaign/4846433-harris-leading-trump-by-7-points-poll/"
  },
  {
    "text": "Watch: Scott Jennings laughed at on CNN for claiming 'People don't want to feel joy'  —  It did not take long on Sunday morning for conservative CNN political commentator Scott Jennings to realize he had stepped in it when he claimed, “People don't want to feel joy” during his appearance on “State of the Union.”",
    "url": "https://www.rawstory.com/scott-jennings-cnn-joy/"
  },
  {
    "text": "Joyless Lindsey Graham: Democrats' Joy 'Doesn't Exist in Real World'  —  GLASS HALF FULL  —  The Republican senator made the comments in response to the DNC “love fest” during an appearance on CNN's “State of the Union.”  —  Republican Senator Lindsey Graham said he isn't buying all that Democratic … ",
    "url": "https://www.thedailybeast.com/lindsey-graham-says-joy-doesnt-exist-in-the-real-world"
  },
  {
    "text": "The DNC Gave Kamala Harris a Major Boost  —  The campaign raised over $80 million while attracting an army of volunteers.  —  The Democratic National Convention wasn't just four days of good vibes: It was also the cause of a major fundraising and volunteer boom for the Harris-Walz ticket.",
    "url": "https://www.motherjones.com/politics/2024/08/kamala-harris-post-dnc/"
  },
  {
    "text": "Be Careful What Trump's Lawyers Wish For, Superseding Indictment Edition  —  On Friday, first Bloomberg (Yahoo version), then NYT reported that Jack Smith “has decided against seeking a major hearing” to address which of the allegations charged against Donald Trump were official versus unofficial acts.",
    "url": "https://www.emptywheel.net/2024/08/25/be-careful-what-trumps-lawyers-wish-for-superseding-indictment-edition/"
  },
  {
    "text": "Trump aides alarmed he's ‘just golfing all day and stewing’ as election slips away: WaPo  —  According to a report from the Washington Post, Donald Trump's inner circle grew increasingly alarmed at his complacency during the Democratic National Convention and had to convince him to hit … ",
    "url": "https://www.rawstory.com/trump-campaign-faltering/"
  },
  {
    "text": "RFK Jr.'s Secret Service protection ends after suspended campaign  —  Washington —  Robert F. Kennedy Jr., who suspended his third-party presidential bid last week and endorsed former President Donald Trump, has lost his Secret Service protection following the decision to leave the race, his campaign said.",
    "url": "https://www.cbsnews.com/news/rfk-jr-secret-service-protection-over-campaign/"
  },
  {
    "text": "Gen. McMaster's blistering account of the Trump White House  —  Until now, Lt. Gen. H.R. McMaster has held his fire about his stint in the Trump White House.  McMaster served with distinction in key American conflicts of the past decades: the Gulf War, the Iraq War and the war in Afghanistan … ",
    "url": "https://www.cnn.com/2024/08/25/politics/mcmaster-trump-book-account/"
  },
  {
    "text": "House GOP shifts firepower from Biden to Harris and Walz  —  As Democrats enthusiastically turn their attention to the Democratic Party's new presidential ticket, so have House Republicans, who in recent weeks have launched a series of investigations into Vice President Harris and her running mate, Minnesota Gov. Tim Walz.",
    "url": "https://thehill.com/homenews/house/4844771-house-republicans-harris-walz-investigate/"
  },
  {
    "text": "Trump says Musk wouldn't have time to be in his White House cabinet, but could ‘consult’ … Former President Donald Trump said that Tesla and SpaceX CEO Elon Musk likely couldn't serve in his hypothetical White House cabinet due to the demanding schedule of running his various companies.",
    "url": "https://www.cnbc.com/2024/08/25/trump-elon-musk-white-house-cabinet-election-republicans.html"
  },
  {
    "text": "Israel and Hezbollah trade heavy fire before pulling back, jolting a region braced for war  —  Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it called a preemptive strike to avert a large Hezbollah rocket and missile attack.",
    "url": "https://apnews.com/article/israel-lebanon-gaza-palestinians-hezbollah-52056075daebc9aac6675043f64439ab"
  },
  {
    "text": "Why Were Justice Dept. Officials Scared to Talk to This Book's Author?  —  In “Where Tyranny Begins,” the journalist David Rohde reveals how former President Donald Trump tried to use the federal law enforcement agency to help himself and punish his foes.  —  Buy Book ▾",
    "url": "https://www.nytimes.com/2024/08/25/books/review/where-tyranny-begins-david-rohde.html?unlocked_article_code=1.Fk4.BuNG.jijwJoTIiZtS&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Lara Trump on DNC: 'They're attempting to run on hating Donald Trump'  —  Republican National Committee (RNC) co-chair Lara Trump said on Sunday she thought Democrats focused too much on bashing former President Trump during last week's convention and should have spent more time outlining their policy goals.",
    "url": "https://thehill.com/homenews/campaign/4846936-lara-trump-donald-trump-dnc/"
  }
]