[
  {
    "text": "Trump confirms names on VP shortlist: 'They're all good, they're all solid'  —  Former President Trump confirmed a list of names floated to be on his vice presidential shortlist Tuesday, during a town hall event in Greenville, S.C.  —  Trump joined Fox News Channel's Laura Ingraham to discuss … ",
    "url": "https://thehill.com/homenews/campaign/4480275-trump-confirms-names-on-vp-shortlist/"
  },
  {
    "text": "Trump says long VP shortlist includes Tim Scott, Ron DeSantis, Vivek Ramaswamy  —  The former president suggested his choice of running mate is still wide open but singled out Tim Scott for praise.  —  Former President Donald Trump suggested Tuesday that at least half a dozen names … ",
    "url": "https://www.politico.com/news/2024/02/20/trump-vp-shortlist-00142353"
  },
  {
    "text": "Biden cancels student debt for 150K borrowers  —  The Biden administration announced Wednesday it is forgiving a total of $1.2 billion in student debt for roughly 153,000 borrowers.  —  The relief comes through the Saving on a Valuable Education (SAVE) repayment plan, which made changes … ",
    "url": "https://thehill.com/homenews/administration/4480304-biden-cancels-student-debt-for-150k-borrowers/"
  },
  {
    "text": "FACT SHEET: President Biden Cancels Student Debt for more than 150,000 Student Loan Borrowers Ahead of Schedule  —  Today, President Biden announced the approval of $1.2 billion in student debt cancellation for almost 153,000 borrowers currently enrolled in the Saving on a Valuable Education (SAVE) repayment plan.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/21/fact-sheet-president-biden-cancels-student-debt-for-more-than-150000-student-loan-borrowers-ahead-of-schedule/"
  },
  {
    "text": "Ex-FBI informant charged with lying about Bidens had Russian intelligence contacts, prosecutors say  —  A former FBI informant charged with making up a multimillion-dollar bribery scheme involving President Joe Biden, his son Hunter and a Ukrainian energy company had contacts … ",
    "url": "https://apnews.com/article/hunter-biden-fbi-informant-joe-biden-ef48c7543e7a45cd3b8b671d0e2f60e5"
  },
  {
    "text": "Playbook: The Biden impeachment's latest big blow  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  A RACE TO WATCH — JOHN AVLON, the former CNN anchor, is officially jumping into the race for New York's 1st Congressional District.",
    "url": "https://www.politico.com/newsletters/playbook/2024/02/21/the-biden-impeachments-latest-big-blow-00142385"
  },
  {
    "text": "Shock, anger, confusion grip Alabama after court ruling on embryos  —  Alabama doctors are puzzled over whether they will have to make changes to in vitro fertilization procedures.  Couples have crammed into online support groups wondering if they should transfer frozen embryos out of state.",
    "url": "https://www.washingtonpost.com/nation/2024/02/20/alabama-supreme-court-ivf-embryos/"
  },
  {
    "text": "The Antisemitic Cartoon  —  Dear Members of the Harvard Community,  —  A few groups purporting to speak on behalf of Harvard affiliates recently circulated a flagrantly antisemitic cartoon in a post on social media channels.  The cartoon, included in a longer post, depicted what appeared … ",
    "url": "https://www.harvard.edu/president/news/2024/the-antisemitic-cartoon/"
  },
  {
    "text": "Former CNN anchor John Avlon announces bid for Congress  —  Former CNN anchor John Avlon announced a bid Wednesday for New York's first congressional district, claiming “democracy is in danger.”  —  In a video posted on X, formerly known as Twitter, Avlon said he was running to help preserve democracy … ",
    "url": "https://thehill.com/homenews/house/4480256-john-avlon-cnn-announces-bid-for-congress/"
  },
  {
    "text": "Nex Benedict matters  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  Nex Benedict, a 16-year-old Oklahoma sophomore, died on February 8.  Nex, who was non-binary, was attacked in an Owasso High School bathroom the previous day, sustaining serious head injuries.",
    "url": "https://popular.info/p/nex-benedict-matters"
  },
  {
    "text": "Scoop: GOP privately expects government shutdown … - “People are predicting a shutdown even if it's just for a few days,” a GOP lawmaker recently told Axios.  — They're either “close to reaching a deal or it's about to blow up,” one subcommittee chair recently told a fellow House Republican.",
    "url": "https://www.axios.com/2024/02/21/republicans-government-shutdown-mike-johnson"
  },
  {
    "text": "Exclusive: Iran sends Russia hundreds of ballistic missiles  —  Iran has provided Russia with a large number of powerful surface-to-surface ballistic missiles, six sources told Reuters, deepening the military cooperation between the two U.S.-sanctioned countries.",
    "url": "https://www.reuters.com/world/iran-sends-russia-hundreds-ballistic-missiles-sources-say-2024-02-21/"
  },
  {
    "text": "Ron DeSantis ally Chris Rufo has close ties with ‘dissident right’ magazine  —  Relationship with IM-1776 that praises dictators, racist ideologues and attacks liberal democracy is collaborative and supportive  —  Chris Rufo, a rightwing culture-war celebrity and close Ron DeSantis ally … ",
    "url": "https://www.theguardian.com/world/2024/feb/21/chris-rufo-im-1776-far-right-desantis"
  },
  {
    "text": "Donald Trump may not believe in God, but he still plans to turn America into a Christian theocracy  —  Like any cult leader, Trump's goal is to get power — and the religious right is ready to take advantage  —  If there were only some way to prove it, I would happily bet everything I own that Donald Trump does not believe in God.",
    "url": "https://www.salon.com/2024/02/21/donald-may-not-believe-in-god-but-he-still-plans-to-turn-america-into-a-christian-theocracy/"
  },
  {
    "text": "Tax records reveal the lucrative world of covid misinformation  —  Four major nonprofits that rose to prominence during the coronavirus pandemic by capitalizing on the spread of medical misinformation collectively gained more than $118 million between 2020 and 2022, enabling the organizations … ",
    "url": "https://www.washingtonpost.com/nation/2024/02/21/covid-misinformation-earnings/"
  },
  {
    "text": "FACT SHEET: Biden-Harris Administration Announces Initiative to Bolster Cybersecurity of U.S. Ports  —  Today, the Biden-Harris Administration will issue an Executive Order to bolster the security of the nation's ports, alongside a series of additional actions that will strengthen maritime cybersecurity … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/21/fact-sheet-biden-harris-administration-announces-initiative-to-bolster-cybersecurity-of-u-s-ports/"
  },
  {
    "text": "The high cost of promoting homeownership  —  It's individually rational, but collectively dysfunctional … According to the Federal Reserve's Survey of Consumer Finances, the median American household had a net worth of $192,700 in 2022, only $38,840 of which were financial assets.",
    "url": "https://www.slowboring.com/p/the-high-cost-of-promoting-homeownership"
  },
  {
    "text": "Trump and allies plotting militarized mass deportations, detention camps  —  As president, Trump sought to use military planes and bases for deportation.  Now, he and his allies are talking about a new effort that current and former officials warn could be impractical and dangerous.",
    "url": "https://www.washingtonpost.com/politics/2024/02/20/trump-mass-deportations-immigration/"
  },
  {
    "text": "Letitia James says she's prepared to seize Trump's buildings if he can't pay his $354M civil fraud fine  —  The New York attorney general made the remarks in an interview with ABC News.  —  Attorney General Letitia James arrives for a press conference following a verdict … ",
    "url": "https://abcnews.go.com/US/letitia-james-shes-prepared-seize-trumps-assets-pay/story?id=107381482"
  },
  {
    "text": "The Fani Willis mess, explained  —  It ultimately serves as a reminder that the courts can't save us. … While Trump continues to face 91 criminal charges and considerable financial liabilities from his losses in civil cases, a significant sideshow has developed in Georgia.",
    "url": "https://www.publicnotice.co/p/fani-willis-mistake-nathan-wade-trump-fulton-ga"
  },
  {
    "text": "Trump's G.O.P. Is a Confederacy of Fakers  —  I've got a suggestion for the next Trump-G.O.P. fund-raising scheme.  You know how sports memorabilia stores sometimes sell basketballs autographed by an entire N.B.A. team?  Well, I was imagining that Donald Trump could sell white flags at $1,000 … ",
    "url": "https://www.nytimes.com/2024/02/20/opinion/ukraine-trump-republicans.html"
  },
  {
    "text": "West Virginia Republicans Want to Throw Librarians in Jail  —  The Mountain State's House overwhelmingly passed a bill that would make schools, libraries, and museums criminally liable if books have too much sexy stuff in them. … We've got to do something about these sexy, sexy libraries.",
    "url": "https://www.thedailybeast.com/michael-ian-black-west-virginia-republicans-want-to-throw-librarians-in-jail"
  }
]