[
  {
    "text": "Trump's Bizarre Moments With Dr. Phil and Hannity Should Alarm Us All  —  During just this week, two of Donald Trump's friendliest interviewers handed him big prime-time opportunities to unequivocally renounce any intention to retaliate against Democrats for his criminal conviction by a jury of his peers in Manhattan.",
    "url": "https://newrepublic.com/article/182480/trump-dr-phil-hannity-bizarre-moments-alarm"
  },
  {
    "text": "It's Simple: Trump Is Treated Like a Criminal Because He's a Criminal … You are, I'm sure, familiar with Occam's razor.  It's the old philosophical theorem that holds that the simplest explanation for an event, the one requiring the fewest assumptions, is probably the best explanation.",
    "url": "https://newrepublic.com/post/182437/treat-trump-like-criminal-democrats"
  },
  {
    "text": "Trump loyalist pushes ‘post-constitutional’ vision for second term  —  Russ Vought, the former president's budget director, is laying the groundwork for a broad expansion of presidential powers.  —  A battle-tested D.C. bureaucrat and self-described Christian nationalist is drawing … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/08/russ-vought-trump-second-term-radical-constitutional/"
  },
  {
    "text": "‘That 10 percent is important’: Trump forgoes moderates to juice the base after his conviction  —  The former president is intensifying his post-conviction rhetoric, even as a majority of Americans say he got a fair trial.  —  In the days since his criminal conviction in New York … ",
    "url": "https://www.politico.com/news/2024/06/08/trump-rhetoric-post-conviction-00162365"
  },
  {
    "text": "Scoop: Johnson seeks votes for bill to support Trump after guilty verdict … It's in direct response to Trump's conviction last week in New York.  — Johnson's leadership team is making calls to whip support for the measure, the No More Political Prosecutions Act, according to two lawmakers … ",
    "url": "https://www.axios.com/2024/06/07/scoop-johnson-seeks-votes-for-bill-to-support-trump-after-guilty-verdict"
  },
  {
    "text": "Controversial Lawmaker Nancy Mace Fights for Her Political Life  —  ‘I owe Washington nothing,’ says South Carolina congresswoman as Kevin McCarthy's allies seek payback for his ouster  —  WASHINGTON—Rep. Nancy Mace says she is fighting a lonely battle.  She faces a tough Republican primary challenge … ",
    "url": "https://www.wsj.com/politics/policy/controversial-lawmaker-nancy-mace-fights-for-her-political-life-61d029a8"
  },
  {
    "text": "Playbook: 3 non-Trump trials Dems want to talk about  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE OTHER TRIALS — While the federal cases against DONALD TRUMP in Florida (violating the Espionage Act, making false statements and obstruction of justice) … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/08/3-non-trump-trials-dems-want-to-talk-about-00162396"
  },
  {
    "text": "If Trump Wins  —  Mr. Trump's top immigration adviser, Stephen Miller, said that a second Trump administration would seek a tenfold increase in the volume of deportations — to more than a million per year.  —  2. Increase the number of agents for ICE raids",
    "url": "https://www.nytimes.com/interactive/2024/06/07/us/politics/trump-policy-list-2025.html"
  },
  {
    "text": "Biden's Cabinet moonlights for campaign cash … - The moonlighting secretaries — Transportation Secretary Pete Buttigieg and Commerce Secretary Gina Raimondo are particularly active — give donors what many desperately crave: An inside view of how Biden's team plans to prevent Donald Trump from returning to the White House.",
    "url": "https://www.axios.com/2024/06/08/biden-cabinet-moonlights-campaign-cash-buttigieg-raimondo"
  },
  {
    "text": "Revealed: Trump ally Kari Lake gave speech in front of Confederate flag  —  Video shows Arizona Senate candidate repeating election-fraud claims at event with Confederate flag behind her  —  The Republican Senate candidate Kari Lake addressed supporters with a Confederate flag displayed behind … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/07/kari-lake-confederate-flag"
  },
  {
    "text": "Trump plans to claim sweeping powers to cancel federal spending  —  In a second term, allies said the former president would look at unilateral funding cuts for the World Health Organization and green energy initiatives.  —  Donald Trump is vowing to wrest key spending powers from Congress … ",
    "url": "https://www.washingtonpost.com/business/2024/06/07/trump-budget-impoundment-congress/"
  },
  {
    "text": "How to cover an abnormal presidential race  —  Could the media coverage adhere closer to reality?  Hard questions must be asked. … This week, I look at the challenge of covering a presidential campaign, in which a major political party plans to nominate a felon.",
    "url": "https://www.washingtonpost.com/opinions/2024/06/07/coverage-abnormal-campaign-2024/"
  },
  {
    "text": "Homeowners Want Housing Prices to Go Up  —  This is ultimately the biggest hurdle for affordable-housing policy.  —  In a study, home prices appeared to be the biggest factor in vote-switching in the counties where partisan preferences changed from one election to the next.",
    "url": "https://prospect.org/infrastructure/housing/2024-06-07-homeowners-want-housing-prices-to-go-up/"
  },
  {
    "text": "Apollo 8 astronaut Anders, who took ‘Earthrise’ photo, reported dead in plane crash  —  Retired astronaut William Anders, one of the first three humans to orbit the moon, who captured the “Earthrise” photo during NASA's Apollo 8 mission, died on Friday when the small plane he was piloting crashed … ",
    "url": "https://www.reuters.com/world/us/apollo-8-astronaut-anders-who-took-earthrise-photo-reported-dead-plane-crash-2024-06-08/"
  }
]