[
  {
    "text": "The Trump Campaign's ‘Please Shut Up’ Phase  —  That was a crazy public service provided by Elon Musk and X.  —  The X Spaces interview delivered Donald Trump without makeup or dress-up, talking unselfconsciously: manic, boastful, untruthful, aggrieved, abusive, obsessive, random, ignorant … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/trump-campaign-musk-interview/679451/"
  },
  {
    "text": "Trump rambles, slurs his way through Elon Musk interview.  It was an unmitigated disaster.  —  For a fascism-curious billionaire who loves cuddling up to right-wing loons, Elon Musk sure is good at making right-wing politicians look stupid.  —  For a fascism-curious billionaire who loves cuddling … ",
    "url": "https://www.usatoday.com/story/opinion/columnist/2024/08/12/trump-musk-interview-x-twitter-spaces-disaster/74774628007/"
  },
  {
    "text": "The Elon Musk / Donald Trump interview on X started with an immediate tech disaster … Elon Musk's “conversation” with former President Donald Trump got off to a rocky start.  The interview, which was hosted on X Spaces and scheduled to begin at 8PM ET on Monday night, crashed immediately and didn't begin until 42 minutes later.",
    "url": "https://www.theverge.com/2024/8/12/24219121/donald-trump-elon-musk-interview-x-twitter-crashes"
  },
  {
    "text": "Bizarre moment Trump says ‘beautiful’ Kamala Harris looks like wife Melania in Elon Musk X interview  —  ‘I saw a picture of her on Time Magazine today.  She looks like the most beautiful actress ever to live,’ the former president said of his presidential rival  —  Support truly  —  independent journalism",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-elon-musk-melania-harris-beautiful-b2595502.html"
  },
  {
    "text": "UAW Files Federal Labor Charges Against Donald Trump and Elon Musk for Attempting to Intimidate and Threaten Workers  —  The UAW has filed federal labor charges against disgraced billionaires Donald Trump and Elon Musk for their illegal attempts to threaten and intimidate workers who stand … ",
    "url": "https://uaw.org/uaw-files-federal-labor-charges-against-donald-trump-and-elon-musk-for-attempting-to-intimidate-and-threaten-workers/"
  },
  {
    "text": "UAW hits Musk, Trump with federal labor charges over union-busting comments … The United Auto Workers union on Tuesday filed federal labor charges with the National Labor Relations Board against former President Donald Trump and billionaire Elon Musk for publicly applauding the practice of firing employees who threaten to strike.",
    "url": "https://www.cnbc.com/2024/08/13/musk-trump-uaw-labor-union-x-interview.html"
  },
  {
    "text": "Trump's interview with Musk devolves into yet another X catastrophe  —  It started after about 45 minutes.  —  Elon Musk guaranteed entertainment.  He delivered technical difficulties instead.  —  Musk planned to host GOP nominee Donald Trump for an interview “Live on X,” formerly Twitter Spaces … ",
    "url": "https://www.politico.com/news/2024/08/12/trump-musk-x-interview-problems-00173739"
  },
  {
    "text": "News outlets were leaked insider material from the Trump campaign.  They chose not to print it  —  At least three news outlets were leaked confidential material from inside the Donald Trump campaign, including its report vetting JD Vance as a vice presidential candidate.",
    "url": "https://apnews.com/article/trump-vance-leak-media-wikileaks-e30bdccbdd4abc9506735408cdc9bf7b"
  },
  {
    "text": "Trump Email Hack Is A Moment Of Reckoning For Him—Or The News Media  —  Outlets like the New York Times owe their readers frenzied coverage of his campaign's emails, or a mea culpa for their history-altering emails fixation in 2016  —  You might say Politico won the weekend with a metascoop.",
    "url": "https://www.offmessage.net/p/trump-email-hack-is-a-moment-of-reckoning"
  },
  {
    "text": "Latest Harris-Trump poll highlights danger for former president in Florida  —  The red wave that washed over Florida in recent years might not be as large as it once seemed, if a new presidential survey is any indication.  —  Vice President Kamala Harris is within “striking distance” … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/08/13/kamala-harris-trump-florida-polls/74770114007/"
  },
  {
    "text": "Workers allege ‘nightmare’ conditions at Kentucky startup JD Vance helped fund  —  As a venture capitalist, JD Vance repeatedly touted his guiding principles for investing in a company: A business should not only turn a profit, it should also help American communities.",
    "url": "https://www.cnn.com/2024/08/13/politics/kentucky-startup-appharvest-jd-vance/"
  },
  {
    "text": "This oil tycoon brings in millions for Trump, and may set his agenda  —  Harold Hamm has become Trump's point person in raising funds from oil industry donors and relaying to the ex-president what the industry wants.  —  After Donald Trump asked the oil industry to contribute $1 billion … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/13/oil-donors-trump-pac-harold-hamm-election/"
  },
  {
    "text": "Historic Gun Suit Survives Serious Legal Threat Engineered by Indiana Republicans  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.",
    "url": "https://www.propublica.org/article/gary-indiana-lawsuit-guns-gunmakers-gop-glock-smith-wesson"
  },
  {
    "text": "Nate Silver on Kamala Harris's Chances and the Mistakes of the ‘Indigo Blob’  —  Nate Silver came to fame in American politics for election forecasting.  But before Silver was in politics, he was a poker player.  And after getting into politics, he went back to being a poker player.",
    "url": "https://www.nytimes.com/2024/08/13/opinion/ezra-klein-podcast-nate-silver.html"
  },
  {
    "text": "Progressives jostle for nat sec jobs under Harris  —  The liberal activists plan to offer Harris lists of names to consider, but their last such effort with Biden yielded little success.  —  Progressive national security professionals already are angling for positions in a possible Kamala … ",
    "url": "https://www.politico.com/news/2024/08/13/progressives-harris-foreign-policy-jobs-00173697"
  },
  {
    "text": "‘End of an era:’ the Times won't endorse in local races  —  Presented by With help from Rich Mendez  —  One of the most influential players in New York politics has benched itself without much explanation.  —  The New York Times' decision to immediately halt city and state endorsements scrambles … ",
    "url": "https://www.politico.com/newsletters/new-york-playbook/2024/08/13/end-of-an-era-the-times-wont-endorse-in-local-races-00173748"
  },
  {
    "text": "Meet the New Boss, Same as the Old Boss  —  Donald Trump is behind.  He trails in the pivotal postindustrial swing states and is treading water in the Southern and Sun Belt states — Arizona, Georgia and Nevada — that could help him find an alternative path to 270 electoral votes.",
    "url": "https://www.nytimes.com/2024/08/13/opinion/trump-republican-party-loss.html?unlocked_article_code=1.Ck4.IHCk.h2PR0Lqp0g2b&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "Tina Peters guilty: Former Mesa County clerk convicted on 7 charges  —  Twelve Mesa County jurors found Tina Peters guilty of four felonies on Monday after a lengthy criminal trial, marking yet another conviction tied to post-2020 election conspiracy theories.",
    "url": "https://www.cpr.org/2024/08/12/tina-peters-trial-verdict/"
  },
  {
    "text": "How Long Until Trump Fires His Campaign Managers?  —  Chris and Susie best be sleeping with one eye open.  —  ∙ Paid  —  1. Pear-Shaped  —  One of the Iron Laws of Trumpism is that it's always someone else's fault.  So when Donald Trump looks out today and surveys the world, someone will have to be blamed.",
    "url": "https://www.thebulwark.com/p/how-long-until-trump-fires-his-campaign"
  },
  {
    "text": "Putin pulls units out of Ukraine to defend Russia, Kyiv says  —  KYIV — Russia pulled some troops out of southern Ukraine and back into its own territory to try to fend off an escalating incursion by Kyiv's forces, a Ukrainian official said on Tuesday.  —  Ukraine's ongoing surprise attack … ",
    "url": "https://www.politico.eu/article/vladimir-putin-pull-army-units-out-ukraine-defend-russia-kursk-belgrod-region/"
  },
  {
    "text": "How hotels are colluding to jack up room rates, according to two lawsuits  —  If you traveled this summer, the rate you paid at hotels may have been artificially inflated.  According to two lawsuits, numerous hotel operators are participating in an illegal scheme to increase their prices.",
    "url": "https://popular.info/p/how-hotels-are-colluding-to-jack"
  },
  {
    "text": "Donald Trump Says He Will Go to Venezuela if He Loses Election  —  During his interview with billionaire donor  —  said they could “meet next time in Venezuela” if he loses November's election.  —  “If something happens with this election, which would be a horror show … ",
    "url": "https://www.newsweek.com/donald-trump-flee-venezuela-loses-election-elon-musk-interview-1938321"
  },
  {
    "text": "Reservoir of liquid water found deep in Martian rocks  —  Scientists have discovered a reservoir of liquid water on Mars - deep in the rocky outer crust of the planet.  —  The findings come from a new analysis of data from Nasa's Mars Insight Lander, which touched down on the planet back in 2018.",
    "url": "https://www.bbc.com/news/articles/czxl849j77ko"
  },
  {
    "text": "Judge rules against RFK Jr. in fight to be on New York's ballot, says he is not a state resident  —  A judge ruled Monday that independent presidential candidate Robert F. Kennedy Jr.'s name should not appear on New York's ballot, saying that he falsely claimed a New York residence on nominating petitions despite living in California.",
    "url": "https://apnews.com/article/kennedy-rfk-jr-ballot-new-york-residency-faaf0c8d7638cdfcdbe3c4eb7b542eef"
  }
]