[
  {
    "text": "Nikki Haley targeted in ‘swatting’ incident at her South Carolina home  —  Authorities responded to a fake emergency at the South Carolina home of Republican presidential candidate Nikki Haley last month after a man claimed to have shot a woman and threatened to harm himself at her home, according to town records obtained by Reuters.",
    "url": "https://www.reuters.com/world/us/republican-presidential-candidate-nikki-haley-targeted-swatting-incident-2024-01-27/"
  },
  {
    "text": "Key Network of G.O.P. Megadonors to Meet With Trump and Haley Camps  —  Assessing the presidential race, the American Opportunity Alliance has invited representatives from both the Trump and Haley campaigns to make their pitches at a meeting next week.  —  A network of Republican megadonors … ",
    "url": "https://www.nytimes.com/2024/01/27/us/politics/republican-megadonors-trump-haley.html"
  },
  {
    "text": "Nikki Haley taunts Trump and he takes the bait.  Will she keep it up?  —  Haley is the latest strong, persistent woman to find a soft spot in Trump's armor.  That makes the Republican race much more interesting if she decides to keep tormenting him.  —  Donald Trump doesn't respond well to women who challenge, question or mock him.",
    "url": "https://www.washingtonpost.com/politics/2024/01/27/nikki-haley-taunts-trump-primary/"
  },
  {
    "text": "Biden offers fresh assurances he would shut down border ‘right now’ if Congress sends him a deal  —  COLUMBIA, South Carolina (AP) — Bidding to salvage a border deal in Congress that also would unlock money for Ukraine, President Joe Biden offered fresh assurances Saturday night … ",
    "url": "https://apnews.com/article/biden-border-deal-mexico-migration-south-carolina-b83f83ed39e59ebb38b7ff093da14706"
  },
  {
    "text": "House Majority Whip: Biden only interested in border because it's a ‘political liability’  —  House Majority Whip Tom Emmer (R-Minn.) criticized President Biden Saturday for what he believes to be an increased interest in securing the southern border, as lawmakers continue to battle over a Senate-backed border deal.",
    "url": "https://thehill.com/homenews/house/4433491-emmer-biden-only-interested-border-political-liability/"
  },
  {
    "text": "Negotiators Close In on Hostage Deal That Would Halt Fighting in Gaza for Weeks  —  A written draft agreement calls for the phased release of captives held by Hamas in exchange for a cessation in Israel's military offensive for about two months.  —  American-led negotiators are edging closer … ",
    "url": "https://www.nytimes.com/2024/01/27/us/politics/hostage-deal-cease-fire-hamas-gaza.html"
  },
  {
    "text": "George Conway calls Trump an ‘evil man’ with ‘no conscience’ after defamation verdict  —  Conservative attorney George Conway railed against former President Trump, calling him an “evil man,” after a jury ruled Trump must pay columnist E. Jean Carroll for defaming her by repeatedly denying her sexual assault allegations.",
    "url": "https://thehill.com/regulation/court-battles/4433185-george-conway-trump-evil-man-after-defamation-verdict/"
  },
  {
    "text": "Trump's $50 Million Mystery Debt Looks Like ‘Tax Evasion’  —  Donald Trump has long claimed he personally owed tens of millions to an obscure entity related to his Chicago tower.  But court docs claim Trump Org. now says it never existed.  —  Always read the footnotes.",
    "url": "https://www.thedailybeast.com/trumps-dollar50-million-mystery-debt-looks-like-tax-evasion"
  },
  {
    "text": "Former senator says new film shows ‘how close’ we came to losing democracy on Jan. 6  —  Former Alabama Sen. Doug Jones (D) said that the new film “War Game” shows “how close” the U.S. came to losing democracy on Jan. 6, 2021.  —  During his appearance on CNN Saturday … ",
    "url": "https://thehill.com/blogs/in-the-know/4433751-former-senator-new-film-losing-democracy-jan-6/"
  },
  {
    "text": "Statement on allegations about UNRWA staff and 7 October attacks  —  The FCDO has issued a statement in response to allegations that UN Relief and Works Agency staff were involved in the 7 October attack against Israel  —  An FCDO spokesperson said: … Media enquiries  —  Email newsdesk@fcdo.gov.uk",
    "url": "https://www.gov.uk/government/news/statement-on-allegations-about-unrwa-staff-and-7-october-attacks"
  },
  {
    "text": "Rudy Giuliani targets Donald Trump for ‘unpaid legal fees’ in new bankruptcy filing  —  Mr Giuliani filed for bankruptcy last month after he was ordered to pay $148m to Georgia election workers he defamed  —  Rudy Giuliani announces lawsuit against Joe Biden",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/rudy-giuliani-defamation-trump-legal-fees-b2485911.html"
  },
  {
    "text": "Journalism may never again make money.  So it should focus on mission.  —  America is struggling with several crises, most notably a radical, antidemocratic leader and movement controlling one of its major political parties.  America's journalism industry is also in crisis … ",
    "url": "https://www.washingtonpost.com/opinions/2024/01/27/new-journalism-mission-save-america-make-money/"
  },
  {
    "text": "Trump Trade Adviser Peter Navarro Criticizes His ‘Death Sentence’ of 4 Months in Prison  —  Navarro was found guilty of two counts of contempt of Congress for ignoring a subpoena to testify about events leading to the violent insurrection  —  Former Trump trade adviser Peter Navarro complained … ",
    "url": "https://themessenger.com/politics/trump-adviser-peter-navarro-criticizes-death-sentence-of-four-months-in-prison"
  },
  {
    "text": "On The Record with Will Lewis  —  ON THE RECORD  —  Semafor Business' signature interview series, On The Record, brings you conversations with the people running, shaping, and changing our economy.  Read Liz Hoffman's earlier conversations with Mattel CEO Ynon Kreiz on Hollywood's golden age of IP … ",
    "url": "https://www.semafor.com/article/01/26/2024/semafor-interview-with-washington-post-ceo-will-lewis"
  },
  {
    "text": "What the Cheney-Stefanik clash shows about the GOP and Jan. 6  —  Their personal insults expose still-festering fissures over the Capitol riot as the party looks ahead to the general election.  —  A bitter clash over the aftermath of the Jan. 6 attack erupted between two prominent Republicans on Saturday … ",
    "url": "https://www.politico.com/news/2024/01/27/stefanik-deletes-jan-6-statement-after-cheney-callout-00138214"
  }
]