[
  {
    "text": "There is only one thing that matters about Donald Trump — and it's not his crimes or mental decline  —  Donald Trump must never return to the White House  —  I don't know about anyone else, but I'm already tired of the presidential election campaign and it's just mid-March.  And I like politics.",
    "url": "https://www.salon.com/2024/03/14/there-is-only-one-thing-that-matters-about-donald--and-its-not-his-or-mental-decline/"
  },
  {
    "text": "Stormy Daniels Is Going to Screw Trump's Campaign Schedule  —  Trump is about to have his entire schedule derailed by courtroom appearances and, even if his campaign thinks he can make it work, Trump is about to have real time problems.  —  Having secured his third straight Republican … ",
    "url": "https://www.thedailybeast.com/the-courtroom-over-the-campaign-trail-inside-trumps-broken-schedule"
  },
  {
    "text": "Trump's MAGA movement is causing Republicans in Congress to hate each other  —  Fewer than half of House Republicans bothered to attend Speaker Mike Johnson's retreat  —  It's wild what a few short months of actually getting to know a person can do to your opinion of them.",
    "url": "https://www.salon.com/2024/03/14/maga-movement-is-causing-in-congress-to-hate-each-other/"
  },
  {
    "text": "A rhetoric expert on how Biden can hit Trump where it hurts  —  “Biden's base wants a competent leader; Trump's base wants a strong man authoritarian.  Trump is neither,” Jennifer Mercieca says.  —  ∙ Paid … With Trump increasingly sounding like a zooted-out Hitler on the stump … ",
    "url": "https://www.publicnotice.co/p/jennifer-mercieca-interview-2024-trump-rhetoric"
  },
  {
    "text": "“That is frightening”: Legal analyst thinks Judge Cannon signaling she may “get rid” of Trump case  —  It “makes me think maybe she thinks she can get rid of this case without setting a trial date,” Lisa Rubin says  —  U.S. District Judge Aileen Cannon on Thursday is expected to hear … ",
    "url": "https://www.salon.com/2024/03/14/that-is-frightening-legal-analyst-thinks-cannon-signaling-she-may-get-rid-of-case/"
  },
  {
    "text": "US firm that paid indicted FBI informant tied to Trump associates, records reveal  —  Alexander Smirnov was paid $600,000 in 2020 - the same year he allegedly began lying to FBI about Bidens' role in Ukraine business  —  An American company that paid the now indicted FBI informant Alexander Smirnov … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/14/company-paying-fbi-informant-trump-connections"
  },
  {
    "text": "Rep. Matt Gaetz subpoenaed in defamation suit by woman he allegedly had sex with as minor: Sources  —  Gaetz could be asked under oath about the allegations involving a minor.  —  Rep. Matt Gaetz asks questions during a House Judiciary Committee hearing on Capitol Hill in Washington, D.C., on July 13, 2023.",
    "url": "https://abcnews.go.com/US/rep-matt-gaetz-subpoenaed-defamation-suit-woman-allegedly/story?id=108098265"
  },
  {
    "text": "Voters don't have a clue about how much worse Trump's second term would be  —  Gameli Fenuku, a 22-year-old Black college student in Richmond, Va. is exactly the demographic you'd think would never vote for Donald Trump in November — and indeed he may not.  But Fenuku told the New York Times … ",
    "url": "https://www.inquirer.com/columnists/trump-47-second-term-dangers-authoritarianism-20240314.html#loaded"
  },
  {
    "text": "Schumer to call for ‘new election’ in Israel in scathing speech on Netanyahu  —  “Israel cannot hope to succeed as a pariah opposed by the rest of the world,” the Senate majority leader is expected to say.  —  Senate Majority Leader Charles E. Schumer (D-N.Y.) will call for the Israeli government … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/14/israel-elections-netanyahu-charles-schumer/"
  },
  {
    "text": "‘Stumpy’ the iconic DC cherry tree to be turned into mulch  —  “Stumpy is a climate change story.”  —  Story at a glance  — Rising sea level and sinking seawalls have led to twice-a-day flooding around the Tidal Basin, leaving behind mud and debris.  — Stumpy, which is in the flood area … ",
    "url": "https://thehill.com/changing-america/sustainability/infrastructure/4532003-stumpy-the-iconic-dc-cherry-tree-to-be-turned-into-mulch/"
  },
  {
    "text": "Exclusive: Trump launched CIA covert influence operation against China  —  Two years into office, President Donald Trump authorized the Central Intelligence Agency to launch a clandestine campaign on Chinese social media aimed at turning public opinion in China against its government … ",
    "url": "https://www.reuters.com/world/us/trump-launched-cia-covert-influence-operation-against-china-2024-03-14/"
  },
  {
    "text": "McConnell raises pressure on Johnson over Ukraine: ‘Finish the job’  —  Senate Republican Leader Mitch McConnell (Ky.) on Thursday again pressed Speaker Mike Johnson (R-La.) to take up the Senate-passed national security spending package, which includes $60 billion for Ukraine … ",
    "url": "https://thehill.com/homenews/senate/4532133-mcconnell-raises-pressure-on-johnson-over-ukraine-finish-the-job/"
  },
  {
    "text": "Trump adviser Peter Navarro has to report to prison, federal appeals court rules  —  The former White House trade adviser was involved in Trump's efforts to overturn his 2020 election loss.  —  WASHINGTON — Peter Navarro, a Donald Trump adviser sentenced to four months in federal prison … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-adviser-peter-navarro-report-prison-federal-appeals-court-rules-rcna143454"
  },
  {
    "text": "Republicans pan Sanders's 32-hour workweek bill  —  GOP lawmakers pushed back against Sen. Bernie Sanders's (I-Vt.) new proposal for a 32-hour workweek during a committee hearing Thursday, saying such a mandate would hurt workers and crush small businesses.  —  The Senate Committee on Health … ",
    "url": "https://thehill.com/homenews/senate/4532457-republicans-pan-sanders-32-hour-work-week-bill/"
  },
  {
    "text": "“Experts are desperate to warn the public”: Hundreds sign Dr. John Gartner's Trump dementia petition  —  “They see the signs of Trump's cognitive decline through the eyes of years of training and experience”  —  Since at least 2016, a brave, determined, and stalwart group of psychologists … ",
    "url": "https://www.salon.com/2024/03/14/experts-are-desperate-to-warn-the-public-hundreds-sign-dr-john-gartners-dementia-petition/"
  },
  {
    "text": "Former Treasury Secretary Mnuchin is putting together an investor group to buy TikTok  — Former Treasury Secretary Steven Mnuchin said he is putting together an investor group to try to buy TikTok.  — “I think the legislation should pass and I think it should be sold,” Mnuchin told CNBC's “Squawk Box” on Thursday.",
    "url": "https://www.cnbc.com/2024/03/14/former-treasury-secretary-mnuchin-is-putting-together-an-investor-group-to-buy-tiktok.html"
  },
  {
    "text": "Kamala Harris to become first VP to visit abortion provider with Planned Parenthood visit  —  Vice President Kamala Harris will go to a Planned Parenthood clinic in Minnesota on Thursday, a White House official tells CNN, the first time a sitting US president or vice president is believed to visit an abortion provider.",
    "url": "https://www.cnn.com/2024/03/13/politics/kamala-harris-planned-parenthood-minnesota"
  },
  {
    "text": "Media compounds failure on Hur report  —  On February 8, Special Counsel Robert Hur released a report describing President Joe Biden as a “well-meaning, elderly man with a poor memory” and “diminished faculties.”  Although Hur concluded that criminal charges against Biden … ",
    "url": "https://popular.info/p/media-compounds-failure-on-hur-report"
  },
  {
    "text": "US ambassador hits out at Hungary's ‘unhinged anti-American messaging’  —  In speech in Budapest, David Pressman says while Hungary under Viktor Orbán tries to wait out US government, ‘we will act’  —  The US ambassador to Hungary has said Washington will act in response to Budapest's … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/14/us-ambassador-hungary-unhinged-anti-american-messaging-orban"
  },
  {
    "text": "Sen. Bob Menendez is considering running for re-election as an independent, sources say  —  The New Jersey Democrat has been indicted on 18 federal counts, including accepting bribes from a foreign government.  He and his wife have pleaded not guilty.  —  WASHINGTON — Indicted Sen. Bob Menendez … ",
    "url": "https://www.nbcnews.com/politics/2024-election/sen-bob-menendez-considering-running-re-election-independent-sources-s-rcna143406"
  },
  {
    "text": "N.Y. district attorney supports a 30-day delay in Donald Trump's hush money trial  —  The trial was scheduled to begin on March 25.  —  Manhattan District Attorney Alvin Bragg said in a court filing Thursday that his office doesn't oppose former President Donald Trump's motion to delay … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-trial-delay-rcna143481"
  },
  {
    "text": "Trump's RNC officially kills the GOP's mail-in voter effort  —  The Trump-branded Republican Party is less interested in promoting voting by mail than in legal challenges aimed at voting systems.  —  In a victory for the extremist wing of the Republican Party, it looks like Donald Trump's … ",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/main-in-voting-bank-your-vote-republicans-rcna143291"
  },
  {
    "text": "Supreme Court Justices Barrett and Sotomayor, ideological opposites, unite to promote civility  —  WASHINGTON (AP) — With the Supreme Court's approval hovering near record lows, two justices have teamed up to promote the art of disagreeing without being nasty about it.",
    "url": "https://apnews.com/article/supreme-court-barrett-sotomayor-politics-approval-cef871fc8ed114bae1e444bdaae4f31d"
  }
]