[
  {
    "text": "Trump's legal advisers urge him to cancel press conference to refute Georgia allegations: Sources  —  Trump had announced a plan to release info on alleged election interference.  —  Former President Donald Trump's promised press conference to refute the allegations in the indictment handed … ",
    "url": "https://abcnews.go.com/US/trumps-legal-advisers-urge-cancel-press-conference-refute/story?id=102336380"
  },
  {
    "text": "Top Georgia Republicans dismiss pro-Trump calls to change pardon rules  —  X  —  Georgia's most powerful Republican politicians rejected pro-Donald Trump calls to change the state constitution to give the governor direct authority to pardon those convicted of crimes.",
    "url": "https://www.ajc.com/politics/politics-blog/top-georgia-republicans-dismiss-pro-trump-calls-to-change-pardon-rules/5HTMB46BDFBC5KWAHMXOLTPVAM/"
  },
  {
    "text": "Majority of Americans think Trump's charges in Georgia election interference case are serious: POLL  —  The former president now faces four indictments; he denies all wrongdoing.  —  In a week where former President Donald Trump was indicted for a fourth time, a majority (63%) … ",
    "url": "https://abcnews.go.com/Politics/majority-americans-trumps-charges-ga-election-interference-case/story?id=102328543"
  },
  {
    "text": "The Georgia indictment is the biggest threat to democracy yet  —  Trust in America's institutions is at an all-time low.  Partisan hostility is high and growing.  Fulton County District Attorney Fani Willis's political indictment of not just former President Donald Trump but 18 other Republicans … ",
    "url": "https://www.washingtonexaminer.com/opinion/editorials/the-georgia-indictment-is-the-biggest-threat-to-democracy-yet"
  },
  {
    "text": "Unmasking the Co-Conspirators in Trump's Georgia Indictment  —  Trump's latest indictment includes 18 co-defendants and 30 unindicted co-conspirators.  Here's our attempt at figuring out as many as possible. … Donald Trump's fourth indictment is, on almost every level … ",
    "url": "https://www.thedailybeast.com/who-are-trumps-unindicted-co-conspirators-in-georgia-we-unmask-them"
  },
  {
    "text": "Texas woman charged with threatening to kill judge overseeing Trump case, Democratic congresswoman  —  Abigail Jo Shry, of Alvin, Texas, is accused of threatening to harm U.S. District Judge Tanya S. Chutkan and Rep. Sheila Jackson Lee (D-TX).  —  WASHINGTON — A Texas woman faces federal charges … ",
    "url": "https://www.wusa9.com/article/news/national/capitol-riots/texas-woman-charged-with-threatening-to-kill-judge-overseeing-trump-case-democrat-congresswoman-sheila-jackson-lee-tanya-chutkan/65-34a5a7c1-d049-4919-836a-755150d10ea7"
  },
  {
    "text": "Texas woman accused of threatening to kill judge overseeing Trump election case and a congresswoman  —  A Texas woman was arrested and has been charged with threatening to kill the federal judge overseeing the criminal case against former President Donald Trump in Washington and a member of Congress.",
    "url": "https://apnews.com/article/donald-trump-tanya-chutkan-judge-threats-texas-7d90ad3c8b552b49e269a3f842a6700c"
  },
  {
    "text": "Rudy Giuliani made desperate appeal to Trump to pay his legal bills in Mar-a-Lago meeting  —  With his attorney in tow, Rudy Giuliani traveled to Mar-a-Lago in recent months on a mission to make a personal and desperate appeal to former President Donald Trump to pay his legal bills.",
    "url": "https://www.cnn.com/2023/08/16/politics/giuliani-trump-legal-bills/"
  },
  {
    "text": "Pence world poised for a showdown with Trump  —  'We've been waiting for this for a while,' the former vice president's senior adviser told POLITICO.  —  INDIANAPOLIS — Mike Pence tosses out a now well-honed line whenever he's asked how he could go from loyally defending Donald Trump to throwing spears at him on the debate stage.",
    "url": "https://www.politico.com/news/2023/08/17/pence-debate-showdown-trump-00111589"
  },
  {
    "text": "Trump supporters post names and addresses of Georgia grand jurors online  —  A fringe website featured the purported names and addresses of the Fulton County grand jury that indicted Trump and 18 others for their efforts to overturn the 2020 election.  —  ATLANTA — The purported names … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/names-addresses-grand-jurors-georgia-trump-indictment-posted-online-rcna100239"
  },
  {
    "text": "You Could See The Appeals Court Ruling on the Abortion Pill Coming From a Mile Away  —  Now, all the lawyers seeking to ban mifepristone will need to do is talk very fast and use the word “abortifacient” a lot.  —  Cassandra got a very raw deal.  She was always right and her curse … ",
    "url": "https://www.esquire.com/news-politics/politics/a44833443/mifepristone-appeals-court-ruling-restrictions-ban/"
  },
  {
    "text": "Majority Of Americans Say Trump Should Be Prosecuted On Federal Criminal Charges Linked To 2020 Election, Quinnipiac University National Poll Finds; DeSantis Slips, Trump Widens Lead In GOP Primary  —  mail_outline  —  In the wake of a federal indictment accusing former President Donald Trump … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3877"
  },
  {
    "text": "Two brands suspend advertising on X after their ads appeared next to pro-Nazi content  —  New York CNN  —  At least two brands have said they will suspend advertising on X, the platform formerly known as Twitter, after their ads and those of other companies were run on an account promoting fascism.",
    "url": "https://www.cnn.com/2023/08/16/tech/x-ads-pro-nazi-account-brand-safety/"
  },
  {
    "text": "Trump Allies Likely to Be Booked at Notorious Atlanta Jail  —  The local sheriff has said the defendants would be treated like everyone else should they surrender at the jail; the process for Donald J. Trump could be different.  —  To locals, the jail is known simply as “Rice Street.”",
    "url": "https://www.nytimes.com/2023/08/16/us/trump-georgia-indictment-atlanta-jail.html"
  },
  {
    "text": "Special counsel raises new conflict of interest concerns for De Oliveira's lawyer  —  The special counsel has raised new conflict of interest concerns over a lawyer.  —  LIVE  —  Special Counsel Jack Smith raised new conflict of interest concerns Wednesday about another attorney representing … ",
    "url": "https://abcnews.go.com/US/special-counsel-raises-new-conflict-interest-concerns-de-Oliveira/story?id=102329443"
  },
  {
    "text": "As Xitter's Lawyer Stalled DOJ, Elon Musk Met with Jim Jordan (Twice!) and Kevin McCarthy  —  Elon Musk has been eerily quiet about being held in contempt by Beryl Howell since the DC Circuit opinion was first released on August 9.  —  It's not like him to pass up the opportunity to make an obnoxious comment.",
    "url": "https://www.emptywheel.net/2023/08/17/as-xitters-lawyer-stalled-doj-elon-musk-met-with-jim-jordan-twice-and-kevin-mccarthy/"
  },
  {
    "text": "New Footage of Roger Stone Working to Overturn 2020 Election Emerges  —  THE BEST LAID PLANS...  The longtime Republican operative was brainstorming ways to thwart the voters' will even before the election had been called for Joe Biden.  —  MSNBC's The Beat aired exclusive footage Wednesday … ",
    "url": "https://www.thedailybeast.com/msnbc-airs-new-footage-of-roger-stone-working-to-overturn-2020-election"
  },
  {
    "text": "Rudy Giuliani pocketed $300,000 from farmers investing in anti-Biden documentary that was never made, lawsuit claims  — A lawsuit claims Rudy Giuliani was paid $300,000 while pitching investors on an anti-Biden film.  — Giuliani allegedly said it would be a “kill shot” that would sink Joe Biden's campaign.",
    "url": "https://www.businessinsider.com/rudy-giuliani-biden-documentary-scam-money-lawsuit-2023-8?op=1"
  },
  {
    "text": "Santos Aide Who Impersonated McCarthy Staff Member Faces Federal Charges  —  The aide, Samuel Miele, was accused of impersonating the staff member in fund-raising appeals and was charged with wire fraud and identity theft.  —  A campaign associate of Representative George Santos … ",
    "url": "https://www.nytimes.com/2023/08/16/nyregion/sam-miele-charged-george-santos.html"
  },
  {
    "text": "Medical school professor says children can be ‘gender hybrids’ like a ‘gender minotaur’  —  A professor at the University of California, San Francisco School of Medicine reportedly said children can identify as “gender hybrid” and compared them to the minotaur, a mythological creature.",
    "url": "https://www.washingtonexaminer.com/policy/healthcare/medical-school-professor-says-children-can-be-gender-hybrids-like-a-gender-minotaur"
  }
]