[
  {
    "text": "Trump ridiculed after accusing Kamala Harris of mistreating Mike Pence  —  Harris campaign responds: ‘In a stunning senile moment Trump suggested it was Harris who treated Pence poorly’  —  Donald Trump has drawn ridicule and accusations of hypocrisy after accusing Kamala Harris of mistreating Mike Pence … ",
    "url": "https://www.theguardian.com/us-news/article/2024/sep/02/trump-hypocrisy-harris-pence"
  },
  {
    "text": "Kamala Harris drives Democrats' enthusiasm up as Donald Trump drags the GOP down  —  The 78-year-old's low-energy campaign could jeopardize down-ballot Republicans.  —  November's election is quickly approaching and, while the head-to-head polls between Vice President Kamala Harris … ",
    "url": "https://www.msnbc.com/top-stories/latest/kamala-harris-enthusiasm-donald-trump-polls-2024-rcna169033"
  },
  {
    "text": "How Trump Plans to Make Voters Hate Harris  —  FULL COURT PRESS  —  Harris' campaign has opted to cast her as the “underdog candidate,” hoping to move “past the bitterness, cynicism, and divisive battles of the past.”  —  Journalist  —  With Donald Trump and Kamala Harris neck and neck … ",
    "url": "https://www.thedailybeast.com/how-donald-trump-plans-to-make-voters-hate-kamala-harris"
  },
  {
    "text": "Biden and Harris rally in battleground Pennsylvania as Trump sits out Labor Day  —  Biden and Harris made the case for their administration's work with unions as Trump skipped the traditional campaign kickoff day.  He has several events planned later this week.",
    "url": "https://www.nbcnews.com/politics/2024-election/joe-biden-kamala-harris-rally-pennsylvania-labor-day-trump-rcna169255"
  },
  {
    "text": "Top Trump volunteer in Mass. no longer with campaign after warning New Hampshire is ‘no longer a battleground state’  —  RNC says campaign remains on the ground in New Hampshire  —  A top Trump volunteer in Massachusetts “will no longer have any involvement” in the campaign after he sent … ",
    "url": "https://www.bostonglobe.com/2024/09/02/nation/new-hampshire-battleground-2024-harris-trump/"
  },
  {
    "text": "Venezuelan judge issues arrest warrant for opposition's former presidential candidate  —  A Venezuelan judge on Monday issued an arrest warrant for the opposition's former presidential candidate Edmundo González as part of a criminal investigation into the results of the highly anticipated July election … ",
    "url": "https://apnews.com/article/venezuela-edmundo-gonzalez-arrest-warrant-d34272422cddb42c1dde9166539a85d5"
  },
  {
    "text": "Maduro Orders Arrest of Rival to Quell Venezuela Dissent  — Regime wants González arrested for snubbing probe into vote  — Ex-diplomat has been in hiding amid post-election crackdown  —  Venezuela ordered the arrest of presidential candidate Edmundo González … ",
    "url": "https://www.bloomberg.com/news/articles/2024-09-02/maduro-orders-arrest-of-rival-to-quell-venezuela-dissent"
  },
  {
    "text": "Elon Musk suggests support for replacing democracy with government of ‘high-status males’  —  The theory suggests that the only people able to think freely are ‘high [testostrone] alpha males’ and ‘aneurotypical people’  —  Support truly  —  independent journalism  —  Support us to deliver journalism without an agenda.",
    "url": "https://www.independent.co.uk/news/world/americas/elon-musk-trump-x-views-b2605907.html"
  },
  {
    "text": "Netanyahu pushes back against new pressure over Gaza and hostages: ‘No one will preach to me’  —  Israeli Prime Minister Benjamin Netanyahu on Monday pushed back against a new wave of pressure to reach a cease-fire deal in Gaza after hundreds of thousands of Israelis protested and went on strike … ",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-09-02-2024-f8a8c85f8947631a7f3039e087dd3904"
  },
  {
    "text": "Lara Trump's Singing Brutally Roasted: ‘Every Note Is a Violation’  —  ‘TONE DEAF’  —  The new, highly auto-tuned vocals from the RNC Chairwoman are being compared to “sack of rusty cans being thrown into an industrial wood chipper.”  —  Journalist  —  Lara Trump's new music video for her song … ",
    "url": "https://www.thedailybeast.com/lara-trumps-singing-brutally-roasted-on-social-media"
  },
  {
    "text": "Watch live: Harris, Biden target union workers with Labor Day stop in Pittsburgh  —  Vice President Harris and President Biden will appear together in Pennsylvania at a Labor Day campaign event Monday as the vice president seeks to shore up support from union workers ahead of the November election.",
    "url": "https://thehill.com/homenews/4858626-joe-biden-kamala-harris-labor-day/"
  },
  {
    "text": "Voters beginning to think Conservatives are ‘weird’, research suggests  —  Tories found to have problems with relatability, and few voters can identify party leadership candidates  —  Conservative politicians have started to be seen as “weird”, and few members of the public … ",
    "url": "https://www.theguardian.com/politics/article/2024/sep/02/voters-beginning-to-think-conservatives-are-weird-research-suggests"
  },
  {
    "text": "Donald Trump is losing it  —  His alarming cognitive decline deserves the scrutiny that Joe Biden received.  —  The process of removing Biden as the Democratic presidential candidate can't exactly be said to have worked well, but it worked.  And now it's time for Americans to turn … ",
    "url": "https://www.newstatesman.com/us-election-2024/2024/09/donald-trump-is-losing-it"
  },
  {
    "text": "Elon Musk is an unguided geopolitical missile  —  While his influence is showing up from Ukraine to China, he still lacks the ability to make the law  —  Big businesses and billionaires usually steer clear of political controversy.  If they exercise power, they prefer to do it in the shadows.",
    "url": "https://www.ft.com/content/b384c68c-a8b8-42ea-8786-337d962c2e96"
  },
  {
    "text": "2020 election deniers ordered to pay $1 million in Pennsylvania voting machine dispute  —  A Pennsylvania judge has determined that three 2020 election deniers must pay nearly $1 million in fees as the result of a years-long legal dispute with state officials over voting equipment used during … ",
    "url": "https://www.cnn.com/2024/09/02/politics/election-deniers-pennsylvania-voting-machine-dispute/"
  },
  {
    "text": "The right's obsession with childless women isn't just about ideology: it's essential to the capitalist machine  —  JD Vance's comments on Kamala Harris reflect a stubborn debate in supposedly progressive societies  —  A woman without biological children is running for high political office … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/sep/02/jd-vance-childless-women-kamala-harris"
  },
  {
    "text": "Exclusive: US seizes Venezuela President Nicolas Maduro's airplane in the Dominican Republic  —  The United States has seized Venezuela President Nicolas Maduro's airplane after determining that its acquisition was in violation of US sanctions, among other criminal issues.",
    "url": "https://www.cnn.com/2024/09/02/politics/us-seizes-venezuela-president-maduros-airplane"
  },
  {
    "text": "Motorcade accompanying VP nominee Tim Walz involved in crash  —  Vans carrying members of the press that were part of Minnesota Gov. Tim Walz's motorcade were involved in a crash on Monday afternoon.  —  Journalists traveling with the vice presidential nominee said the crash happened shortly before 1 p.m. on Interstate 794.",
    "url": "https://www.cbsnews.com/news/tim-walz-motorcade-crash-milwaukee-laborfest/"
  },
  {
    "text": "‘Ticking time bomb’: Plunging office values alarm Washington  —  Fed Chair Jerome Powell has voiced concern, saying that commercial real estate risk “will be with us for some time, probably for years.”  —  Four and a half years after the pandemic sent workers home, the office property bill is finally coming due.",
    "url": "https://www.politico.com/news/2024/09/02/office-property-values-fed-00174697"
  }
]