[
  {
    "text": "Is it too late for McCarthy to save his job as speaker? … But it might be too late.  —  With the House on the brink of voting on a motion to oust McCarthy, there's very strong sentiment inside the Democratic Caucus against helping the speaker, according to multiple aides and lawmakers.",
    "url": "https://punchbowl.news/article/kevin-mccarthy-running-out-of-time-to-save-job/"
  },
  {
    "text": "McCarthy tells GOP lawmakers that House will vote today on effort to oust him as speaker  —  House Speaker Kevin McCarthy (R-Calif.) told Republican lawmakers that the House will vote Tuesday afternoon on a motion to table a resolution to remove him as speaker, according to two people familiar … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/03/kevin-mccarthy-house-speaker-vote-motion-to-vacate/"
  },
  {
    "text": "Judge Shuts Down Trump's Claim That He Reversed Himself on Statute of Limitations  —  The former president claimed the judge ‘overruled’ himself and would knock out ‘80%’ of the case, but the judge began day two of the trial by shooting that down  —  A Facebook icon representing an external link … ",
    "url": "https://themessenger.com/politics/judge-rejects-trump-claim-overruled-statute-of-limitations"
  },
  {
    "text": "Exclusive: John Kelly goes on the record to confirm several disturbing stories about Trump  —  John Kelly, the longest-serving White House chief of staff for Donald Trump, offered his harshest criticism yet of the former president in an exclusive statement to CNN.",
    "url": "https://www.cnn.com/2023/10/02/politics/john-kelly-donald-trump-us-service-members-veterans/"
  },
  {
    "text": "USCP Searching for Criminals Who Carjacked Congressman  —  The United States Capitol Police (USCP) is working to find the three criminals who carjacked a Member of Congress.  —  “We have a number of leads,” said U.S. Capitol Police Chief Tom Manger.  “Our investigators are focused, determined and working around the clock.”",
    "url": "https://www.uscp.gov/media-center/press-releases/uscp-searching-armed-robbers-who-carjacked-congressman"
  },
  {
    "text": "As Trump's Legal Woes Have Escalated, So Have His Violent Remarks  —  Recent incendiary statements by the former president, including that shoplifters should be shot, come at a time when his supporters are already angry over his indictments.  —  Former President Donald J. Trump had a lot … ",
    "url": "https://www.nytimes.com/2023/10/03/us/politics/trump-indictments-shoplifters-violence.html"
  },
  {
    "text": "RNC warns Christie and Ramaswamy not to hold joint Fox News segment  —  The two candidates will now sit down for separate interviews.  —  The Republican National Committee told former New Jersey Gov. Chris Christie and entrepreneur Vivek Ramaswamy Monday night that if they went through … ",
    "url": "https://www.politico.com/news/2023/10/03/rnc-chris-christie-vivek-ramaswamy-debate-fox-00119629"
  },
  {
    "text": "Neither Party Well-Liked, but GOP Holds Advantage on Issues  — Republican and Democratic Parties viewed unfavorably on balance  — Between the two, Republican Party trusted more on economy and security  — GOP also ahead on which party can handle “most important problem”",
    "url": "https://news.gallup.com/poll/511979/neither-party-liked-gop-holds-advantage-issues.aspx"
  },
  {
    "text": "No Labels makes its choice  —  No Labels claims to be a non-partisan centrist organization.  It describes itself as a movement for the “politically homeless.”  But in practice, it has supported Republicans and very conservative Democrats.  This year, No Labels has spent millions … ",
    "url": "https://popular.info/p/no-labels-makes-its-choice"
  },
  {
    "text": "Supreme Court appears hesitant to upend Consumer Financial Protection Bureau  —  The Supreme Court justices at oral arguments Tuesday appeared hesitant to upend the Consumer Financial Protection Bureau (CFPB) by finding the agency's funding mechanism unconstitutional.",
    "url": "https://thehill.com/regulation/court-battles/4236078-supreme-court-appears-hesitant-to-upend-consumer-financial-protection-bureau/"
  },
  {
    "text": "Buckle up: McCarthy's future to be decided on Tuesday  —  The speaker said he would not make a deal with Democrats to save his gavel: “They haven't asked for anything.  I'm not going to provide anything.”",
    "url": "https://www.politico.com/live-updates/2023/10/03/congress/mccarthy-wont-deal-with-dems-00119620"
  },
  {
    "text": "'They're just meat': Russia deploys punishment battalions in echo of Stalin  —  Drunk recruits.  Insubordinate soldiers.  Convicts.  —  They're among hundreds of military and civilian offenders who've been pressed into Russian penal units known as “Storm-Z” squads and sent to the frontlines … ",
    "url": "https://www.reuters.com/world/europe/theyre-just-meat-russia-deploys-punishment-battalions-echo-stalin-2023-10-03/"
  },
  {
    "text": "Two Anne Arundel County Men, Including Department of Defense Deputy Chief, Charged with Facilitating Dog Fighting Ring  —  For Immediate Release  —  U.S. Attorney's Office, District of Maryland  —  A Related Federal Search Recovered Veterinary Steroids and a Device Consisting of an Electrical Plug … ",
    "url": "https://www.justice.gov/usao-md/pr/two-anne-arundel-county-men-including-department-defense-deputy-chief-charged"
  },
  {
    "text": "What was Elon Musk's strategy for Twitter?  —  A year after the world's richest man acquired the social media platform, a game plan published by a fired Trump White House staffer provides a clue.  —  On the day that public records revealed that Elon Musk had become Twitter's biggest shareholder … ",
    "url": "https://www.nbcnews.com/tech/was-elon-musks-strategy-twitter-rcna118490"
  },
  {
    "text": "FBI interviewed individuals who accuse Amy Coney Barrett faith group of abuse  —  Revealed: individuals contacted by agency gave detailed accounts of abusive behavior they allegedly experienced or witnessed  —  The FBI has interviewed several individuals who have alleged they were abused … ",
    "url": "https://www.theguardian.com/us-news/2023/oct/03/fbi-people-of-praise-amy-coney-barrett-faith-group-abuse-allegations"
  },
  {
    "text": "Arizona governor revokes Saudi-owned alfalfa farm lease, announces nonrenewal of others  —  Arizona Gov. Katie Hobbs (D) declared on Monday that she would be revoking the lease of a Saudi-owned alfalfa venture that has for years siphoned off state water resources and rattled residents across party lines.",
    "url": "https://thehill.com/homenews/state-watch/4236066-arizona-governor-revokes-saudi-owned-alfalfa-farm-lease/"
  },
  {
    "text": "Playbook: Inside a new senator's big decision  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  CAREFUL OUT THERE — Rep. HENRY CUELLAR (D-Texas) was carjacked at gunpoint last night outside his apartment building south of the Capitol, Sarah Ferris and Nick Wu first reported.",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/03/inside-a-new-senators-big-decision-00119609"
  }
]