[
  {
    "text": "New Pics Show Nuclear Secrets Stashed Beside the Diet Cokes at Mar-a-Lago  —  HOARDERS: MAR-A-LAGO EDITION  —  Another photo shows sweaty, balled-up golf shirts next to a folder marked “CONFIDENTIAL” at Donald Trump's country-club-turned-residence.  —  When Donald Trump was indicted … ",
    "url": "https://www.thedailybeast.com/new-pics-show-nuclear-secrets-stashed-beside-the-diet-cokes-at-mar-a-lago"
  },
  {
    "text": "Judge Cannon is skeptical that evidence from Mar-a-Lago should be thrown out  —  The judge in Trump's classified documents case was not receptive to the defense's complaints about the 2022 search of Trump's home.  —  FORT PIERCE, Florida — Judge Aileen Cannon appeared highly skeptical … ",
    "url": "https://www.politico.com/news/2024/06/25/aileen-cannon-trump-evidence-classified-documents-00164944"
  },
  {
    "text": "Bowman Falls to Latimer in a Loss for Progressive Democrats  —  Representative Jamaal Bowman of New York, a member of the House's left-wing “squad,” was defeated by George Latimer in a race that exposed Democratic fissures.  —  Representative Jamaal Bowman of New York … ",
    "url": "https://www.nytimes.com/2024/06/25/nyregion/bowman-latimer-house-new-york.html"
  },
  {
    "text": "Will Trump chicken out of the presidential debate?  Probably.  He's a Grade-A coward.  —  Until we see him set foot on the debate stage Thursday night in Atlanta, there's a strong chance the former president chickens out and runs to the safety of a rally.  —  The breathless advance coverage … ",
    "url": "https://www.usatoday.com/story/opinion/columnist/2024/06/25/trump-biden-presidential-debate-cnn-rigged/74195698007/"
  },
  {
    "text": "Hillary Clinton: I've Debated Trump and Biden.  Here's What I'm Watching For.  —  Last week, I had the time of my life at the Tony Awards introducing a song from “Suffs,” the Broadway musical I co-produced about the suffragists who won women the right to vote.",
    "url": "https://www.nytimes.com/2024/06/25/opinion/hillary-clinton-trump-biden-debate.html"
  },
  {
    "text": "Trump's VP announcement could come as early as this week  —  Four sources told NBC News that the campaign is considering revealing Trump's running mate this week, possibly before his debate with Biden on Thursday.  —  Former President Donald Trump could announce his vice presidential pick … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-considering-announcing-vp-pick-this-week-debate-rcna158827"
  },
  {
    "text": "A Knives-Out House Primary: MAGA in Microcosm  —  It's been one week since Virginia held its primaries for congressional races, and one of them remains up in the air.  In Virginia's 5th district, the Republican nomination to serve in the U.S. House of Representatives has turned into a scale model … ",
    "url": "https://www.thebulwark.com/p/a-knives-out-house-primary-maga-in"
  },
  {
    "text": "Rosendale pushes spending amendment that declares IVF ‘morally wrong’  —  Many national Republicans have been trying to reassure voters that they're not working to curb reproductive rights, especially when it comes to in vitro fertilization.  Rep. Matt Rosendale is complicating that in the House.",
    "url": "https://www.politico.com/live-updates/2024/06/25/congress/rosendale-ivf-morally-wrong-00164916"
  },
  {
    "text": "Donald Trump hush money gag on witnesses and jurors lifted, but prosecutors remain protected  —  Former President Donald Trump was freed on Tuesday from gag order restrictions that protected witnesses and jurors in his hush money case, although prosecutors and the family members … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/25/trump-hush-money-gag-order-lifted/74207314007/"
  },
  {
    "text": "UN tells Israel it will suspend aid operations across Gaza without improved safety  —  Senior U.N. officials have warned Israel that they will suspend the world body's aid operations across Gaza unless Israel acts urgently to better protect humanitarian workers, two U.N. officials said Tuesday.",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-06-25-2024-c6a905b264ddb827c087072968d681ce"
  },
  {
    "text": "Steve Bannon Prepares for Prison  —  Steve Bannon is taking his show on the road.  Convicted by a federal jury in 2022 for contempt of Congress, the right-wing agitator is set to spend four months in a Connecticut penitentiary starting July 1.  It's the latest act in the iconoclastic performance … ",
    "url": "https://time.com/6991472/steve-bannon-prison-trump/"
  },
  {
    "text": "'It's Horrifying': West Virginia Judge Revokes Bond of White Couple Who Reportedly Kept Their Black Adopted Children Locked In Shed In ‘Despicable’ Conditions with No Water, Lights and Little Food  —  A white couple from rural West Virginia is back behind bars after a judge revoked the initial bond … ",
    "url": "https://atlantablackstar.com/2024/06/24/hite-west-virginia-couple-forced-black-adopted-children-found-locked-in-barn-to-do-farm-labor/"
  },
  {
    "text": "Paramount Erases Archives of MTV Website, Wipes Music, Culture History After 30 Plus Years  —  MTV.com is gone.  Kaput.  Wiped off the face of the Earth.  —  Parent company Paramount, formerly Viacom, has tossed twenty plus years of news archives.  All that's left is a placeholder site for reality shows.",
    "url": "https://www.showbiz411.com/2024/06/25/paramount-shuts-down-mtv-website-wipes-history-after-20-plus-years"
  },
  {
    "text": "Trump Could Actually Lose Florida.  Here's Why.  —  After two years of Governor Ron DeSantis pushing his extremist agenda, there's a case to be made that voters have had enough of the Republican Party's obsession with culture wars.  —  The Florida Democratic Party insists the state is in play in November … ",
    "url": "https://www.bloomberg.com/opinion/articles/2024-06-25/florida-democrats-think-biden-can-win-the-state-in-november"
  },
  {
    "text": "Israeli Military Must Draft Ultra-Orthodox Jews, Supreme Court Rules  —  The court ruled there was no legal justification for the ultra-Orthodox exemption from service, a decision that threatened to split Prime Minister Benjamin Netanyahu's wartime government.",
    "url": "https://www.nytimes.com/2024/06/25/world/middleeast/israel-military-ultra-orthodox-jews-supreme-court.html"
  },
  {
    "text": "'Bob's Burgers' Actor Jay Johnston Set to Change Plea in Jan. 6 Case  —  BACKTRACK  —  The comedian and actor is expected to officially change his plea to guilty in an upcoming hearing according to new court documents.  —  Jay Johnston, the actor known for small roles in Anchorman … ",
    "url": "https://www.thedailybeast.com/bobs-burgers-actor-jay-johnston-set-to-change-plea-in-jan-6-case"
  },
  {
    "text": "Gov. Spencer Cox Holds Off Challenger From Right in Utah's G.O.P. Primary  —  The governor's rival, State Representative Phil Lyman, had the state party's backing and argued that Mr. Cox was not conservative enough.  —  Gov. Spencer Cox of Utah fended off a challenge from the right … ",
    "url": "https://www.nytimes.com/2024/06/25/us/politics/spencer-cox-utah-republican-primary.html"
  },
  {
    "text": "The numbers behind the ‘public health crisis’ of gun violence  —  The uptick in deaths related to firearms beginning in 2020 is less about homicide than you might assume.  —  As is the case with many official acts that originate in the executive branch of the government … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/25/numbers-behind-public-health-crisis-gun-violence/"
  },
  {
    "text": "How Trump Can Win the Debate  —  No need for showmanship.  Just contrast Biden's record with his own.  —  The Debate Expectations Game  —  By NOAH ROTHMAN  —  Both presidential campaigns are trying to manage expectations ahead of Thursday night's debate.  —  VIEW MORE  —  ANTISEMITISM",
    "url": "https://www.nationalreview.com/2024/06/how-trump-can-win-the-debate/"
  },
  {
    "text": "AJC Poll: Trump leads Biden in Georgia ahead of first debate  —  Sharp warning signs emerge in the state for both candidates.  —  Former President Donald Trump holds a slight lead over President Joe Biden in Georgia in an Atlanta Journal-Constitution poll released Tuesday ahead of an Atlanta debate … ",
    "url": "https://www.ajc.com/politics/ajc-poll-trump-leads-biden-in-georgia-ahead-of-first-debate/2INZ7K3PNFCGNHF7N5SFP2HF4A/"
  },
  {
    "text": "Donald Trump May ‘Reignite’ Inflation, Nobel Prize-Winning Economists Warn  —  A coalition of Nobel Prize-winning economists has warned about inflation if former President  —  wins the presidential election.  —  President  —  and Trump are set to face off in the November election, and inflation remains a key issue in the race.",
    "url": "https://www.newsweek.com/donald-trump-inflation-nobel-economists-warning-1917046"
  }
]