[
  {
    "text": "Navy demoted Ronny Jackson after probe into White House behavior  —  Ronny Jackson, the former White House physician turned GOP congressman, regularly touts his military bona fides.  —  “As a retired U.S. Navy Rear Admiral with nearly three decades of military service I understand the commitment … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/07/ronny-jackson-demotion-white-house-medical-unit-navy/"
  },
  {
    "text": "Dr. John Gartner: The world is watching “a fundamental breakdown in Trump's ability to use language”  —  Experts say Trump's decline may be “caused by his incapacity to manage the stress caused by multiple indictments”  —  It has become undeniably clear and obvious to any reasonable person … ",
    "url": "https://www.salon.com/2024/03/07/dr-john-gartner-the-world-is-watching-a-fundamental-breakdown-in-trumps-ability-to-use-language/"
  },
  {
    "text": "These New Ads Targeting Biden Are Absolutely Brutal  —  Donald Trump, Speaker Mike Johnson, Building America's Future, and Senator Ted Cruz all recently put out new ads targeting Joe Biden...and they're BRUTAL.",
    "url": "https://hotair.com/videos/2024/03/07/these-new-ads-targeting-biden-are-absolutely-brutal-n3784288"
  },
  {
    "text": "Donald Trump told to pay six-figure costs of firm he sued  —  The former US president's case against a company founded by an ex-MI6 officer was thrown out.",
    "url": "https://www.bbc.com/news/uk-68499543"
  },
  {
    "text": "Trump is ordered to pay legal fees after failed lawsuit over the Steele dossier  —  Former U.S. President Donald Trump has been ordered to pay legal fees to a company founded by a former British spy that he sued for making what he claimed were false claims that harmed his reputation",
    "url": "https://abcnews.go.com/International/wireStory/trump-ordered-pay-legal-fees-after-failed-lawsuit-107891658"
  },
  {
    "text": "Biden to announce US will build port on Gaza shore for large-scale aid delivery  —  President to make announcement in State of the Union speech while senior US official says ‘We are not waiting on the Israelis’  —  US forces will build a temporary port on the Gaza shoreline in the next few weeks … ",
    "url": "https://www.theguardian.com/world/2024/mar/07/biden-us-port-gaza-aid-delivery"
  },
  {
    "text": "Sweden officially joins NATO, ending decades of post-World War II neutrality  —  Sweden on Thursday formally joined NATO as the 32nd member of the transatlantic military alliance, ending decades of post-World War II neutrality and centuries of broader non-alignment with major powers … ",
    "url": "https://apnews.com/article/sweden-nato-us-russia-ukraine-8372bc866c8ddcf42d2b8209fa5cd2b1"
  },
  {
    "text": "Why is New York Times campaign coverage so bad?  Because that's what the publisher wants.  —  It's an increasingly common critique of the New York Times: The largest, most influential news organization in the nation is not warning sufficiently of the threat to democracy … ",
    "url": "https://presswatchers.org/2024/03/why-is-new-york-times-campaign-coverage-so-bad-because-thats-what-the-publisher-wants/"
  },
  {
    "text": "Spate of Mock News Sites With Russian Ties Pop Up in U.S.  —  The fake news organizations, experts say, represent a technological leap in the Kremlin's efforts to spread false and misleading narratives.  —  Into the depleted field of journalism in America, a handful of websites have appeared … ",
    "url": "https://www.nytimes.com/2024/03/07/business/media/russia-us-news-sites.html"
  },
  {
    "text": "Stormy Daniels alleges in new documentary that Donald Trump cornered her the night they met  —  Stormy Daniels goes into new detail in a documentary about her alleged 2006 sexual encounter with former President Trump, saying she was cornered by him in his hotel room the night they met and that she blames herself for not stopping him.",
    "url": "https://www.latimes.com/entertainment-arts/tv/story/2024-03-07/stormy-documentary-donald-trump-peacock"
  },
  {
    "text": "Charted: Trump world allies sentenced to prison … - He is expected to be sentenced to five months in prison in April. … - Former Trump campaign lawyer Sidney Powell — one of Trump's co-defendants in the sprawling Georgia election subversion case — took a plea deal to testify against co-defendants that helped her avoid prison.",
    "url": "https://www.axios.com/2024/03/07/trump-associates-prison-sentence-crimes-list"
  },
  {
    "text": "How millions in corporate cash could help a radical conspiracy theorist become governor  —  Judd Legum, Tesnim Zekeria, and Rebecca Crosby  —  On Tuesday, Mark Robinson (R) won the Republican nomination for Governor of North Carolina.  Robinson, currently North Carolina's lieutenant governor … ",
    "url": "https://popular.info/p/how-millions-in-corporate-cash-could"
  },
  {
    "text": "The Republicans Who Sold Their Souls to Vladimir Putin  —  In American politics, a presidential campaign cannot coordinate with its associated political action committee.  The campaign can wink and nod publicly in the press and on its official website, but a direct line of communication is, technically, illegal.",
    "url": "https://newrepublic.com/article/179393/republican-vladimir-putin-2024-shift"
  },
  {
    "text": "Biden to propose new $5,000 tax credit for first-time home buyers  —  The president will also add to earlier pushes to tame rent costs and boost U.S. housing supply  —  President Biden will propose a set of new housing initiatives in Thursday's State of the Union address … ",
    "url": "https://www.washingtonpost.com/business/2024/03/07/biden-housing-sotu/"
  },
  {
    "text": "Steve Bannon's Refusal to Pay His Bills Is Costing Him Big  —  Bannon has refused to pay his legal bills for two years.  Now he and his current lawyer are facing fines over Bannon's refusal to make good on his debts. … For two years, Steve Bannon has refused to pay the half-million dollars he owes his former lawyer.",
    "url": "https://www.thedailybeast.com/steve-bannons-refusal-to-pay-his-bills-is-costing-him-big"
  },
  {
    "text": "Byron Donalds wouldn't commit to certifying election results if he was VP … - Donalds also did not clarify if he would have certified the 2020 election results, during an interview with Axios' Sophia Cai.  — Trump, the GOP presidential frontrunner, has continued to push the false theory … ",
    "url": "https://www.axios.com/2024/03/07/byron-donalds-certifying-election-results-trump-vp"
  },
  {
    "text": "GOP Rep. Michelle Steel rescinds her co-sponsorship of the Life at Conception Act after winning her primary  —  Steel says she supports IVF, which the bill could threaten.  She has put forward a nonbinding resolution backing IVF but has not signed on to a bill offering legal protection for it.",
    "url": "https://www.nbcnews.com/politics/congress/gop-rep-michelle-steel-rescinds-cosponsorship-life-conception-act-rcna142285"
  },
  {
    "text": "Sherrod Brown raises nearly $6M in 2 months amid Ohio Senate race  —  Sen. Sherrod Brown (D-Ohio) has raised $5.7 million in the first two months of the year amid a contentious race as he tries for reelection to the Senate, his campaign announced.  —  The Friends of Sherrod Brown campaign … ",
    "url": "https://thehill.com/homenews/campaign/4516832-sherrod-brown-raises-nearly-6m-in-2-months-amid-ohio-senate-race/"
  },
  {
    "text": "Trump loses bid to delay $83.3 million E. Jean Carroll defamation judgment  — Donald Trump lost a bid to delay paying an $83.3 million civil defamation judgment to writer E. Jean Carroll.  — Trump had asked Manhattan federal Judge Lewis Kaplan to delay the judgment from taking effect until … ",
    "url": "https://www.cnbc.com/2024/03/07/trump-loses-bid-to-delay-83point3-million-e-jean-carroll-judgment.html"
  },
  {
    "text": "In Shinzo's shadow, Japan fears ‘if Trump’  —  Moshi Tora.  That's the compact phrase now spreading like wildfire in Japan.  It means “If Trump,” and is often said with a sense of foreboding.  —  This haiku-like, four-syllable phrase is short for the longer sentence: “What if Trump wins the presidency again?”",
    "url": "https://thehill.com/opinion/white-house/4513866-in-shinzos-shadow-japan-fears-if-trump/"
  },
  {
    "text": "House panel passes measure blocking Biden administration from finalizing nursing home staffing rule  —  The GOP-controlled House Ways & Means Committee on Wednesday passed a bill that would block the Biden administration from implementing rules requiring minimum staffing levels for nursing homes.",
    "url": "https://thehill.com/homenews/house/4516104-house-panel-passes-measure-blocking-biden-administration-from-finalizing-nursing-home-staffing-rule/"
  }
]