[
  {
    "text": "Former Trump campaign lawyer Jenna Ellis pleads guilty in Georgia case  —  Former Trump campaign lawyer Jenna Ellis pleaded guilty Tuesday in the Georgia election subversion case and will cooperate with Fulton County prosecutors - the third guilty plea in the past week.",
    "url": "https://www.cnn.com/2023/10/24/politics/jenna-ellis-fulton-county/"
  },
  {
    "text": "Fourth defendant negotiates plea deal with Fulton prosecutors  —  Attorney Jenna Ellis on Tuesday became the fourth defendant in the Fulton County election interference case to strike a deal with prosecutors.  —  In exchange for her cooperation, Ellis pleaded guilty to one count of aiding and abetting false statements and writings.",
    "url": "https://www.ajc.com/politics/fourth-defendant-negotiates-plea-deal-with-fulton-prosecutors/S3SO4MZ3MBGCJD6YD47ZE4MYQE/"
  },
  {
    "text": "Jenna Ellis, Former Trump Lawyer, Pleads Guilty in Georgia Election Case  —  Three lawyers indicted with Donald Trump for trying to overturn the 2020 election results will now cooperate with prosecutors in the racketeering case.  —  Jenna Ellis, a pro-Trump lawyer who amplified former … ",
    "url": "https://www.nytimes.com/2023/10/24/us/jenna-ellis-guilty-trump-georgia.html"
  },
  {
    "text": "Fourth Trump Co-Defendant Pleads Guilty: Jenna Ellis Takes Deal with Prosecutors in Georgia  —  Former Trump attorney Jenna Ellis, who was facing four felony counts in the Georgia election case, was sentenced to five years' probation after pleading guilty Tuesday to one felony count of aiding and abetting false statements and writings",
    "url": "https://themessenger.com/politics/trump-jenna-ellis-pleads-guilty-georgia"
  },
  {
    "text": "Trump's lawyers argue DC fed'l charges unconstitutional, should be tossed  —  The lawyers argue the indictment violates the First Amendment, due process, and double jeopardy protections in one of four late-night filings Monday.  —  In a late-night filing Monday, Donald Trump's lawyers argued … ",
    "url": "https://www.lawdork.com/p/trump-dc-case-constitutional-dismissal-motion"
  },
  {
    "text": "Republicans nominate Tom Emmer for House speaker: Live updates  — House Republicans nominated Tom Emmer of Minnesota to be their candidate for speaker.  — The GOP gathered behind closed doors this morning to vote by secret ballot and choose among seven contenders.",
    "url": "https://www.nbcnews.com/politics/congress/live-blog/house-republicans-choose-new-speaker-nominee-live-updates-rcna121674"
  },
  {
    "text": "10/24/23 ☀️ Punchbowl News AM  —  THE TOP … So you think this is bad, the interminable House Republican race for speaker?  —  Just wait until we get to the other side of this crisis. … None of the eight candidates for the House's top job has extensive time in a senior leadership role … ",
    "url": "https://punchbowl.news/archive/102423-punchbowl-news-am/"
  },
  {
    "text": "Playbook: The House's ‘Purge’ moment  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  DEBATE UPDATE — CHRIS CHRISTIE now says he has enough donors to qualify for the third GOP presidential debate, Natalie Allison scoops this morning.",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/24/the-houses-purge-moment-00123137"
  },
  {
    "text": "The No Labels Party's Radical New Plan to Force a Contingent Election  —  The No Labels Party Will Re-Elect Trump  —  Since they launched their third-party presidential effort last year, the No Labels Party has repeated a central refrain: “our bipartisan ticket, led either by a Democrat or a Republican … ",
    "url": "https://www.thirdway.org/memo/the-no-labels-partys-radical-new-plan-to-force-a-contingent-election"
  },
  {
    "text": "U.S. State Senator Arrested in Hong Kong After Carrying Gun Onto Flight  —  Jeff Wilson, who was released on bail, says he didn't realize it was in his bag and that baggage screeners in the U.S. hadn't detected it  —  A Washington state senator was on a flight from San Francisco to Hong Kong … ",
    "url": "https://www.wsj.com/world/asia/u-s-state-senator-arrested-in-hong-kong-after-carrying-gun-onto-flight-c2df0b9c?mod=followamazon"
  },
  {
    "text": "US Lawmaker Arrested in Hong Kong Airport Over Unloaded Gun  — Washington state Senator Jeff Wilson faces Oct. 30 hearing  — Wilson says Portland baggage screeners didn't detect",
    "url": "https://www.bloomberg.com/news/articles/2023-10-24/us-state-senator-arrested-in-hong-kong-airport-over-unloaded-gun"
  },
  {
    "text": "‘Netanyahu Got All the Warnings,’ Says Former Head of Israeli Military Intelligence  —  Former chief of Israeli military intelligence Amos Yadlin on where the war goes from here.  —  Israeli men pray during a rally calling for the return of more than 200 people captured by Hamas militants.",
    "url": "https://www.politico.com/news/magazine/2023/10/24/amos-yaldin-israeli-military-intelligence-netanyahu-qa-00123099"
  },
  {
    "text": "Republican Party of Virginia mails out thousands of explicit fliers about Susanna Gibson scandal  —  RICHMOND, Va. (WWBT) - Election Day in Virginia is two weeks away and Virginia's Republican Party is now taking further steps to warn voters of the online sex scandal surrounding 57th District House Candidate Susanna Gibson.",
    "url": "https://www.nbc12.com/2023/10/24/republican-party-virginia-mails-out-thousands-explicit-fliers-about-susanna-gibson-scandal/"
  },
  {
    "text": "Trump's Motions to Dismiss Things That Aren't the Charges Against Him  —  Last night, Trump just met the deadline for filing motions to dismiss his January 6 indictment.  —  I'm going to lay out what he filed.  I'll review them at length in follow-ups.  Here's a handy table to understand them.",
    "url": "https://www.emptywheel.net/2023/10/24/trumps-motions-to-dismiss-things-that-arent-the-charges-against-him/"
  },
  {
    "text": "Fact check: Trump falsely claims the US had no terrorist attacks during his presidency  —  Former President Donald Trump made numerous false claims in a campaign speech Monday in New Hampshire.  —  Trump falsely claimed that the United States had no terrorist attacks during his presidency.",
    "url": "https://www.cnn.com/2023/10/23/politics/fact-check-trump-speech-new-hampshire/"
  },
  {
    "text": "Woman charged with homicide of Mika Westwolf  —  In the early morning of March 31, 2023, Mika Westwolf, a 22-year-old Indigenous woman, was walking on the shoulder of U.S. Highway 93, which passes through the Flathead reservation in Montana.  Westwolf was struck by a Cadillac Escalade and declared dead at the scene.",
    "url": "https://popular.info/p/update-woman-charged-with-homicide"
  },
  {
    "text": "Tucker Carlson media company signs its first ad deal  — Former Fox News host Tucker Carlson's new media company signed its first advertising deal.  — The agreement is with conservative-friendly marketplace app PublicSq., whose shares went public in July.",
    "url": "https://www.cnbc.com/2023/10/24/tucker-carlson-signs-first-ad-deal-since-fox-news-departure.html"
  },
  {
    "text": "‘I Mean, Is This My Party?’  —  A new book asks if even anti-Trumpers like Mitt Romney bear some blame for the rise of a man who has destroyed the GOP.  —  “I have learned through my life experience,” Mitt Romney said, “that it's human to rationalize what's in our best interest.”  J. Scott Applewhite/AP",
    "url": "https://www.politico.com/news/magazine/2023/10/24/mitt-romney-trump-rise-00123096"
  }
]