[
  {
    "text": "Scoop: Biden told Bibi U.S. won't support an Israeli counterattack on Iran … - Iran launched attack drones and missiles against Israel on Saturday night local time in retaliation for an airstrike in Syria that killed a top Iranian general.  — “More than 200 drones … ",
    "url": "https://www.axios.com/2024/04/14/biden-netanyahu-iran-israel-us-wont-support"
  },
  {
    "text": "U.S. Intercepts Drones and Missiles Aimed at Israel, as Allies Pledge Support  —  Iran fired more than 300 drones and missiles at Israel overnight.  The U.S. military shot some of them down, but most were intercepted by Israel's military.  —  Here are the latest developments.",
    "url": "https://www.nytimes.com/live/2024/04/13/world/israel-iran-gaza-war-news"
  },
  {
    "text": "UN Security Council to meet Sunday on Iran attack after Israel request  —  The United Nations Security Council is set to meet on Sunday after Israel requested the council condemn Iran's attack on Israel and designate the Iranian Revolutionary Guard Corps a terrorist organization.",
    "url": "https://www.reuters.com/world/middle-east/un-security-council-aims-meet-sunday-iran-attack-after-israel-request-diplomat-2024-04-14/"
  },
  {
    "text": "Israel says Iran launched more than 300 drones and missiles, 99% of which were intercepted  —  Sirens and explosions in Jerusalem after Iran fires drones and missiles  —  Israeli military spokesman: we will do everything to defend Israel  —  Military expert weighs in on Iran's military attack against Israel",
    "url": "https://apnews.com/article/strait-of-hormuz-vessel-33fcffde2d867380e98c89403776a8ac"
  },
  {
    "text": "Iran launches unprecedented drone and missile attack on Israel … - The specific targets were initially unclear.  — The Biden administration has vowed to help Israel counter the Iranian attack.  — Iranian officials had threatened to retaliate against Israel for an airstrike in Syria … ",
    "url": "https://www.axios.com/2024/04/13/iran-israel-attack"
  },
  {
    "text": "Statement from President Joe Biden on Iran's Attacks against the State of Israel  —  Earlier today, Iran—and its proxies operating out of Yemen, Syria and Iraq—launched an unprecedented air attack against military facilities in Israel.  I condemn these attacks in the strongest possible terms.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/13/statement-from-president-joe-biden-on-irans-attacks-against-the-state-of-israel/"
  },
  {
    "text": "Iran attacks Israel: IDF warns that threat is ongoing, interceptions continue  —  Seven-year-old girl from Bedouin village seriously wounded in Iranian attack.  • US, Israel, UK, Jordan intercept Iranian projectiles  —  Sirens blared across Israel on Saturday night as hundreds of drones … ",
    "url": "https://www.jpost.com/breaking-news/article-796838"
  },
  {
    "text": "Four Years Out, Some Voters Look Back at Trump's Presidency More Positively  —  A new poll by The New York Times and Siena College finds that voters think highly of the former president's record on the economy, but memories of his divisiveness largely remain intact.",
    "url": "https://www.nytimes.com/2024/04/14/us/politics/poll-trump-views.html"
  },
  {
    "text": "Trump endorses a Pennsylvania U.S. Senate candidate he once condemned  —  The former president backed former hedge fund CEO Dave McCormick to take on Democratic Sen. Bob Casey  —  SCHNECKSVILLE, Pa. — Former President Donald Trump backed former hedge fund CEO Dave McCormick on Saturday … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/13/trump-mccormick-pennsylvania-senate/"
  },
  {
    "text": "Major media organizations urge Biden and Trump to debate  —  ABC News and other major TV networks sent a letter to the candidates Sunday.  —  President Joe Biden and Former President Donald Trump  —  ABC News is among a unified grouping of the five chief broadcast and cable news networks … ",
    "url": "https://abcnews.go.com/Politics/major-media-organizations-urge-biden-trump-debate/story?id=109169895"
  },
  {
    "text": "Scoop: How a key skeptic got behind Democrats' Ukraine aid push … - But only one Republican, former Rep. Ken Buck (R-Colo.), has signed on, and some progressives won't sign over the bill's military aid for Israel. … - “I remain skeptical that they will get enough Republicans on it to get to 218 … ",
    "url": "https://www.axios.com/2024/04/14/israel-ukraine-aid-democrat-petition"
  },
  {
    "text": "As Trump goes on trial, Biden goes to Pennsylvania  —  Biden plans to attack Trump on the economy while the former president is in court, though abortion will still be his campaign's top message.  —  WASHINGTON — While President Donald Trump is in his hometown of New York this week … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-goes-trial-biden-goes-pennsylvania-rcna147703"
  },
  {
    "text": "Trump targets two likely witnesses ahead of his criminal trial, despite gag order … In this courtroom sketch, Michael Cohen looks toward former U.S. President Donald Trump as he is questioned by a lawyer for the attorney general's office, during the Trump Organization civil fraud trial … ",
    "url": "https://www.cnbc.com/2024/04/13/trump-targets-two-likely-witnesses-ahead-of-his-criminal-trial-despite-gag-order.html"
  },
  {
    "text": "The Myth of the Molly Maguires  —  The Day of the Rope  —  The Myth of the Molly Maguires became international news on June 21, 1877, when the authorities hanged ten Irish miners in a single day in Schuylkill County, Pennsylvania.  Known as Black Thursday, or Day of the Rope, it was the second largest mass execution in U.S. history.",
    "url": "https://michaeldunnauthor.com/2024/04/13/the-myth-of-the-molly-maguires/"
  }
]