[
  {
    "text": "New Orleans attack suspect named, accused of killing at least 10, injuring dozens  —  The suspect accused of plowing a truck through a crowd on Bourbon Street early Wednesday morning has been identified by a law enforcement source as 42-year-old Shamsud Din Jabbar.",
    "url": "https://www.nola.com/news/crime_police/new-orleans-suspect-bourbon-street-attack/article_d90e3452-c85f-11ef-a68f-f30b3ad49828.html"
  },
  {
    "text": "Man intentionally slams truck into crowd in New Orleans, killing 10 and injuring dozens; suspect dead  —  Ten people were killed and dozens injured early Wednesday when a man intentionally drove a pickup truck into a crowd on Bourbon Street in New Orleans' French Quarter as revelers were celebrating the new year, officials said.",
    "url": "https://www.cbsnews.com/news/new-orleans-vehicle-crash-bourbon-street-crowd-casualties-shooting/"
  },
  {
    "text": "New Orleans updates: 10 dead in ‘terrorist attack’ with pickup in New Orleans, local officials say  —  The driver remained at large after the Bourbon Street incident, police said.  —  Emergency vehicles are seen near Bourbon Street in New Orleans on Wednesday, Jan. 1, 2025.",
    "url": "https://abcnews.go.com/US/1-dead-vehicle-strikes-crowd-new-orleans-police/story?id=117246329"
  },
  {
    "text": "Live updates 10 killed in New Orleans as driver plows truck into crowd  —  Ten people were killed and dozens injured when a man intentionally drove a pickup truck into a large crowd in the Bourbon Street area of New Orleans early Wednesday, officials said.  The FBI said that the driver is dead … ",
    "url": "https://www.washingtonpost.com/nation/2025/01/01/new-orleans-vehicle-crowd-bourbon-street/"
  },
  {
    "text": "BREAKING: Cybertruck blows up outside Trump International Hotel Las Vegas  —  Witnesses reported a “massive explosion” near the 64-story luxury building owned by President-elect Donald Trump. … Minute Read  —  Authorities are investigating a vehicle explosion that occurred Wednesday outside … ",
    "url": "https://thepostmillennial.com/breaking-cybertruck-blows-up-outside-trump-international-hotel-las-vegas"
  },
  {
    "text": "Police treating vehicle explosion at Trump Las Vegas hotel as possible act of terror: Official  —  Police are also probing the Cybertruck incident as a possible criminal act.  —  General views of the Trump International Hotel Las Vegas on April 15, 2024 in Las Vegas, Nevada.",
    "url": "https://abcnews.go.com/Politics/police-investigating-vehicle-explosion-trump-hotel-las-vegas/story?id=117252987"
  },
  {
    "text": "Truck engulfed in flames outside Trump Hotel lobby on Las Vegas Strip  —  LAS VEGAS (KSNV) — Firefighters and police are responding to a vehicle fire and explosion just outside Trump International Hotel near the north end of the Las Vegas Strip Wednesday morning.",
    "url": "https://news3lv.com/news/local/vehicle-fire-fashion-show-mall-trump-international-las-vegas-strip-ccfd-southern-nevada-new-years-day"
  },
  {
    "text": "Trump uses New Orleans attack to rant about ‘Democrats and the Fake News Media’  —  Hours after a man drove an F-150 truck through barriers in New Orleans' Bourbon Street district killing at least ten revelers and injuring at three dozen, Donald Trump weighed in on Truth Social.",
    "url": "https://www.rawstory.com/new-orleans-driver/"
  },
  {
    "text": "John Roberts attacks court criticism that he decides lacks a “credible basis” as “illegitimate”  —  Conflating violence against judges with broad criticism the court faces for its extremism, the chief justice ultimately sends a chilling end-of-year report.  —  Chief Justice John Roberts decided … ",
    "url": "https://www.lawdork.com/p/john-roberts-attacks-court-criticism"
  },
  {
    "text": "Johnson protected, diversity office scrapped in new House rules … - Instead of any single House Republican being able to force such a vote, now the motion will have to have eight additional GOP co-sponsors.  — The change is the result of a deal struck between House Republican factions … ",
    "url": "https://www.axios.com/2025/01/01/house-republican-rules-diversity-motion-to-vacate"
  },
  {
    "text": "Sugar Bowl postponed until Thursday due to terror attack in French Quarter, sources say  —  Sources confirm to WDSU that the Sugar Bowl has been postponed to Thursday after a terror attack happened in the New Orleans French Quarter.  —  As tourists descended on New Orleans to attend … ",
    "url": "https://www.wdsu.com/article/sugar-bowl-new-orleans-postponed-terror-attack/63316433"
  },
  {
    "text": "Elon Musk changes his name to Kekius Maximus on X  —  The world's richest man, Elon Musk, has sparked speculation after changing his name on his social media platform X to “Kekius Maximus”.  —  The tech mogul - and close confidant of US President-Elect Donald Trump - offered no immediate explanation … ",
    "url": "https://www.bbc.com/news/articles/cy53vz1qpx1o"
  },
  {
    "text": "‘Trump is a little guy, Musk is a big guy’: historian predicts trouble for president-elect  —  Timothy Snyder says world's richest man is likely to exert uncomfortable influence over White House  —  Allies and aides to Donald Trump should be increasingly concerned by Elon Musk's proximity … ",
    "url": "https://www.theguardian.com/books/2025/jan/01/elon-musk-donald-trump"
  },
  {
    "text": "Trump Voters Are in for a Rude Awakening  —  In his 1987 book, The Art of the Deal, Donald Trump let readers in on a promotional strategy of his.  “I play to people's fantasies,” the real estate developer wrote, by insisting that a project “is the biggest and the greatest and the most spectacular.”",
    "url": "https://newrepublic.com/article/189523/trump-voters-2025-rude-awakening"
  },
  {
    "text": "Let's Try Something Different in How We Deal With Trump  —  President-elect Donald Trump and the Republicans have managed to sell themselves as the party of change.  It worked: They will soon control the presidency, Congress and, in essence, the Supreme Court.  But to change and fix America requires both parties to work together.",
    "url": "https://www.nytimes.com/2025/01/01/opinion/democrats-trump-agenda.html"
  },
  {
    "text": "Louisiana Congressman Mike Johnson expects to be re-elected as House Speaker after Trump's endorsement  —  Baton Rouge / louisianaradionetwork.com  —  Louisiana Republican Congressman Mike Johnson says President-elect Donald Trump's endorsement of him for House Speaker was supposed to come … ",
    "url": "https://louisianaradionetwork.com/2024/12/31/louisiana-republican-congressman-mike-johnson-anticipates-president-elect-donald-trumps-backing-for-house-speaker/"
  },
  {
    "text": "Ukraine Halts the Flow of Natural Gas From Russia to Europe  —  A transnational pipeline was shut down on Wednesday after Kyiv refused to renew a prewar agreement that allowed for the transit of Russian gas through its territory.  —  The flow of natural gas through a major pipeline from Russia … ",
    "url": "https://www.nytimes.com/2025/01/01/world/europe/russia-ukraine-natural-gas-europe.html"
  }
]