[
  {
    "text": "Texas flooding latest: 43 dead, including 15 children, as search for some two dozen girls continues - as it happened  —  Girls from Camp Mystic, a Christian summer camp along the Guadalupe River, are still missing, says city manager.  This blog is now closed.  —  Closing summary",
    "url": "https://www.theguardian.com/us-news/live/2025/jul/05/texas-flooding-latest-news-updates-guadalupe-river-flood-camp-mystic"
  },
  {
    "text": "As Floods Hit, Key Roles Were Vacant at Weather Service Offices in Texas  —  Some experts say staff shortages might have complicated forecasters' ability to coordinate responses with local emergency management officials.  —  Crucial positions at the local offices of the National Weather Service … ",
    "url": "https://www.nytimes.com/2025/07/05/us/politics/texas-floods-warnings-vacancies.html?unlocked_article_code=1.UU8.21M8.MBBE3OCzrBAa&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Here's a timeline of the catastrophic Texas floods  —  In the early hours of Friday, floods swept across Texas Hill Country.  The Guadalupe River rose 26 feet within 45 minutes, according to state officials.  —  The flooding killed at least 14 children and 18 adults, officials said at a press conference on Saturday afternoon.",
    "url": "https://www.npr.org/2025/07/05/nx-s1-5457759/texas-floods-timeline"
  },
  {
    "text": "In Texas region prone to catastrophic floods, questions grow about lack of warning  —  Water rose fast along the Guadalupe River, causing more than two dozen deaths.  Local officials said they couldn't have seen it coming.  —  The forecast began to look ominous in Texas Hill County on Thursday afternoon.",
    "url": "https://www.texastribune.org/2025/07/05/texas-hill-country-floods-warning-forecast-nws/"
  },
  {
    "text": "Texas Officials Slam Trump's National Weather Service for Bad Forecast  —  BLAME GAME  —  The government weather forecaster has been hit with huge cuts by the president's administration.  —  Officials in Texas are casting blame on the National Weather Service (NWS) for failing … ",
    "url": "https://www.thedailybeast.com/texas-officials-slam-donald-trumps-national-weather-service-for-bad-forecast/"
  },
  {
    "text": "Meteorologists Say the National Weather Service Did Its Job in Texas  —  DOGE cut hundreds of jobs at the NWS, but experts who spoke to WIRED say the agency accurately predicted the state's weekend flood risk.  —  At least 27 people, including nine children, are dead in central Texas … ",
    "url": "https://www.wired.com/story/meteorologists-say-the-national-weather-service-did-its-job-in-texas/"
  },
  {
    "text": "The NWS apparently did its job  —  I can understand the temptation to blame DOGE for the horrible consequences of the Guadalupe River flood, but leaving aside that this would almost certainly be counterproductive (the Republican response to bureaucratic failure is to see it as a pretext for further cuts) it also appears to be false:",
    "url": "https://www.lawyersgunsmoneyblog.com/2025/07/the-nws-apparently-did-its-job"
  },
  {
    "text": "Elon Musk announces new ‘America’ party after slamming Trump's megabill  —  Elon Musk announced the formation of a new political party amid his strident criticism of President Donald Trump's signature legislation.  —  “When it comes to bankrupting our country with waste & graft … ",
    "url": "https://www.usatoday.com/story/news/politics/2025/07/05/elon-musk-new-america-party-rift-donald-trump/84480422007/"
  },
  {
    "text": "Elon Musk Says He Will Start a New Political Party  —  The tech billionaire, who has publicly feuded with President Trump, wrote on social media that he would be creating “the America Party,” though he hadn't yet filed paperwork.  —  Elon Musk, the world's wealthiest person … ",
    "url": "https://www.nytimes.com/2025/07/05/us/politics/elon-musk-third-party.html"
  },
  {
    "text": "U.S. Turns Eight Migrants Over to South Sudan, Ending Weeks of Legal Limbo  —  Courts blocked the handover after lawyers raised concerns of torture.  Then the Supreme Court intervened to allow the Trump administration's plan to move forward.  —  A flight carrying eight men who had been held … ",
    "url": "https://www.nytimes.com/2025/07/05/us/migrants-djibouti-south-sudan.html"
  },
  {
    "text": "Trump Admin Insider Blows Lid Off Tariffs: 'It's All Fake'  —  MADE FOR TV  —  A source close to the MAGA administration suggested the president's “deals” are all theatrics.  —  A source deeply embedded in the Trump administration's ongoing trade talks accused the Republican president of waging a tariff war for TV ratings.",
    "url": "https://www.thedailybeast.com/trump-admin-insider-blows-lid-off-tariffs-its-all-fake/"
  },
  {
    "text": "‘Tears My Heart to Pieces’: North Carolina Braces for Medicaid Cuts  —  President Trump's domestic policy law jeopardizes plans to reopen one rural county's hospital — and health coverage for hundreds of thousands of state residents.  —  The only hospital in Martin County, N.C., closed in 2023, but the electricity is still on inside.",
    "url": "https://www.nytimes.com/2025/07/06/us/north-carolina-medicaid-cuts.html"
  },
  {
    "text": "Rep. Mark Green resigns from Congress, leaving Speaker Johnson with an even narrower Republican majority in the House … Rep. Mark Green, R-Tenn., announced his official resignation from Congress on Friday, a move that was expected but one that could, at least for now, shrink Republicans' already narrow majority in the House.",
    "url": "https://www.cnbc.com/2025/07/05/rep-mark-green-announces-resignation.html"
  },
  {
    "text": "6-year-old Honduran boy with leukemia who had been seized by ICE is back in L.A.  —  The boy was arrested by Immigration and Customs Enforcement along with his mother and sister after an asylum hearing in May.  —  A 6-year-old Honduran boy with leukemia whose arrest sparked a public outcry after he … ",
    "url": "https://www.nbcnews.com/news/us-news/ice-releases-honduran-boy-leukemia-immigration-rcna216951"
  },
  {
    "text": "Live Updates: More Than 50 Dead in Texas Floods as Search for Missing Grows Dire  —  At least 15 children were among those killed by flooding in Central Texas.  Some two dozen girls from a camp on the Guadalupe River remained unaccounted for.  —  Hunt, Texas  —  Hunt, Texas  —  Ingram, Texas Ingram, Texas",
    "url": "https://www.nytimes.com/live/2025/07/05/us/texas-floods"
  },
  {
    "text": "Tesla robotaxi incidents spark confusion and concerns in Austin  —  Two weeks into Tesla's invite-only ride-hailing service, CEO Elon Musk's die-hard fans are amazed, but it's not clear anyone else is.  —  Two weeks into Tesla's robotaxi prototype rollout on the streets of Austin, Texas … ",
    "url": "https://www.nbcnews.com/tech/innovation/tesla-robotaxi-incidents-spark-confusion-concerns-austin-rcna215909"
  },
  {
    "text": "Kamala Harris Sparks MAGA Meltdown With Fourth of July Post  —  FIREWORKS  —  President Donald Trump's supporters took the former vice president's holiday sentiments as a sign she'd be looking to run for office again.  —  Former Vice President Kamala Harris sent MAGA into a frenzy with her simple Fourth of July message.",
    "url": "https://www.thedailybeast.com/kamala-harris-sparks-maga-meltdown-with-fourth-of-july-post/"
  },
  {
    "text": "Musk says ‘America Party’ is formed in US  —  A day after asking his followers on X whether a new U.S. political party should be created, Elon Musk said on Saturday that the “America Party is formed.”  —  “By a factor of 2 to 1, you want a new political party and you shall have it!” he said in a post on X.",
    "url": "https://www.reuters.com/world/us/musk-says-america-party-is-formed-us-2025-07-05/"
  },
  {
    "text": "The next megabill Congress needs to worry about … It's not escaping the notice of Democrats.  House Minority Leader Hakeem Jeffries spent much of his marathon floor speech before the vote Thursday calling out GOP moderates in battleground seats, many of whom had swallowed their misgivings … ",
    "url": "https://www.politico.com/news/2025/07/05/gop-megabill-cliffs-tax-cuts-medicaid-00439973"
  },
  {
    "text": "Measles cases surge to record high since disease was declared eliminated in the US  —  Falling childhood vaccine coverage and a large, smoldering outbreak that was kindled in an undervaccinated pocket of West Texas have driven the United States to a troubling new milestone … ",
    "url": "https://cnn.com/2025/07/05/health/measles-cases-us-record-since-elimination"
  },
  {
    "text": "Several in custody after North Texas police officer shot in neck outside ICE facility  —  Several suspects are in custody after a police officer was injured in a shooting at an Immigration and Customs Enforcement detention facility in Alvarado, Texas, in the late night hours of the Fourth of July, officials said.",
    "url": "https://www.cbsnews.com/texas/news/alvarado-police-officer-shot-suspects-open-fire-fourth-of-july-johnson-county/"
  }
]