[
  {
    "text": "Trump's $91.6 million question  —  New York juries have found, by a preponderance of the evidence, that former President Donald Trump sexually assaulted writer E. Jean Carroll in a Bergdorf Goodman dressing room in the mid-90s and then repeatedly defamed her, falsely accusing Carroll of lying about the incident.",
    "url": "https://popular.info/p/trumps-916-million-question"
  },
  {
    "text": "The media is still selling a fantasy version of Trump  —  This free edition of PN is made possible by paid subscribers.  If you aren't one already, hit the button and sign up to support our independent journalism.  —  ⌨️ Subscribe to Public Notice ⌨️",
    "url": "https://www.publicnotice.co/p/axios-new-york-times-nbc-trump-fantasy-version"
  },
  {
    "text": "Trump floats ‘cutting’ retirement spending, drawing quick pushback from Biden  —  The Republican nominee-in-waiting said that “there's a lot you can do in terms of cutting” when pressed on CNBC about the solvency of Social Security, Medicare and Medicaid.  —  Presumptive Republican nominee … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-floats-cutting-retirement-spending-drawing-quick-pushback-biden-rcna142776"
  },
  {
    "text": "Donald Trump May Be Closer To Bankruptcy Than It Seems  —  Donald Trump may be in a worse financial situation than most people think, a financial analyst has said.  —  Jon Gabrielsen, an Atlanta-based market economist, told Newsweek that Trump's liquidity problems may be more acute than they first appear … ",
    "url": "https://www.newsweek.com/donald-trump-bankruptcy-court-awards-e-jean-carroll-new-york-fraud-case-engoron-1877890"
  },
  {
    "text": "Trump Gives Rambling Answer on Why He Backtracked on a TikTok Ban  —  Donald Trump told CNBC that banning TikTok would make young people “go crazy” and could benefit Facebook, which he called an “enemy of the people.”  —  Former President Donald J. Trump offered a rambling and confusing explanation … ",
    "url": "https://www.nytimes.com/2024/03/11/us/politics/trump-tiktok-ban-cnbc.html"
  },
  {
    "text": "E. Jean Carroll lawyer suggests third Trump defamation lawsuit possible after new comments  — Donald Trump again denied rape and defamation claims against him by E. Jean Carroll.  — The presumptive Republican presidential nominee claimed on CNBC's “Squawk Box” that the numerous judgments … ",
    "url": "https://www.cnbc.com/2024/03/11/trump-again-attacks-e-jean-carroll-as-he-appeals-rape-defamation-penalties.html"
  },
  {
    "text": "Adding to an ugly record, Trump mocks Biden's stutter (again)  —  Donald Trump's fractured relationship with human decency is especially evident when it comes to those with disabilities.  —  A couple of months ago, while on the campaign trail in Iowa, Donald Trump had plenty … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/adding-ugly-record-trump-mocks-bidens-stutter-rcna142802"
  },
  {
    "text": "Trump's freewheeling speeches offer a dark vision of a second term  —  A close examination of one appearance in Rock Hill, S.C., offers an anatomy of a signature rally by the former president  —  A Donald Trump rally is a freewheeling extravaganza.  A festival of grievance and retribution.",
    "url": "https://www.washingtonpost.com/politics/2024/03/11/trump-campaign-speech-anatomy/"
  },
  {
    "text": "Former advisers sound the alarm that Trump praises despots in private and on the campaign trail  —  To Donald Trump, Hungarian strongman Viktor Orbán is “fantastic,” Chinese leader Xi Jinping is “brilliant,” North Korea's Kim Jong Un is “an OK guy,” and, most alarmingly … ",
    "url": "https://www.cnn.com/2024/03/11/politics/trump-despots-advisers-sound-alarm/"
  },
  {
    "text": "The MAGA Aesthetic Is Beginning to Rot  —  The stable of imagery associated with the far-right insurgency no longer seems as fresh as it did when Trump first donned his red cap.  —  Pocket  —  For headline writers and Beltway pundits, the takeaway from last week's State of the Union address was clear … ",
    "url": "https://www.thenation.com/article/politics/maga-aesthetic-trump-style/"
  },
  {
    "text": "Trump seeks to derail New York hush money trial over immunity claims  —  Former President Trump is seeking to derail the start of his first criminal trial just two weeks out from when it is scheduled to begin, asserting a presidential immunity defense in the case for the first time.",
    "url": "https://thehill.com/regulation/court-battles/4524017-trump-new-york-hush-money-trial-immunity/"
  },
  {
    "text": "How a tenacious reporter revealed Sen. Katie Britt's SOTU response to be ‘beyond misleading’  —  Britt tied an anecdote about a woman who survived sex trafficking to Biden's border policies.  But it happened during the George W. Bush admin.  —  Last Thursday was President Joe Biden's big State of the Union address.",
    "url": "https://www.poynter.org/commentary/2024/katie-britt-scarlett-johansson-teacup-snl/"
  },
  {
    "text": "Sex trafficking victim says Sen. Katie Britt telling her story during SOTU rebuttal is ‘not fair’  —  The woman whose story Alabama Sen. Katie Britt appeared to have shared in the Republican response to the State of the Union as an example of President Joe Biden's failed immigration policies told CNN … ",
    "url": "https://www.cnn.com/2024/03/10/politics/katie-britt-sex-trafficking-victim-interview"
  },
  {
    "text": "Why Democrats Are Hopeful in North Carolina and Nervous in Georgia  —  President Biden's campaign and its allies are targeting both battlegrounds — but only one state has a highly controversial Republican nominee lower on the ballot.  —  Democrats are starting to dream that President Biden … ",
    "url": "https://www.nytimes.com/2024/03/11/us/politics/biden-trump-north-carolina-georgia.html"
  },
  {
    "text": "HUD Secretary Marcia Fudge to resign, says affordable housing is ‘an American issue’  —  WASHINGTON ‒ Housing and Urban Development Secretary Marcia Fudge will step down from her top post in the Biden administration this month, she announced Monday, saying that after decades of public service, she's retiring and returning to Ohio.",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/11/hud-secretary-marcia-fudge-steps-down/72886441007/"
  },
  {
    "text": "How Big Pharma is fighting Biden's program to lower seniors' drug costs  —  In court cases nationwide, drug companies are trying to block a new law that would cut prices on drugs for high blood pressure, heart disease, cancer and diabetes.  —  TRENTON, N.J. — Pharmaceutical giants are mounting … ",
    "url": "https://www.washingtonpost.com/business/2024/03/11/pharma-drug-priding-biden-negotiations/"
  }
]