[
  {
    "text": "U.S. Deploys B-2 Bombers as Trump Plans to Meet National Security Team  —  President Trump announced the United States had struck Fordo, Iran's heavily fortified nuclear facilities, as well as two other sites.  —  Here are the latest developments.  —  The United States has entered Israel's war against Iran.",
    "url": "https://www.nytimes.com/live/2025/06/21/world/iran-israel-trump?unlocked_article_code=1.Q08.70nJ.4dnQ-xScDwbt&smid=url-share"
  },
  {
    "text": "Trump's Two-Week Window for Diplomacy Was a Smoke Screen  —  Well, he did it.  He actually did it.  —  President Donald Trump had insisted for months that he wanted the ultimate deal with Iran, one that would put a definitive end to the country's ability to produce a nuclear weapon.",
    "url": "https://www.theatlantic.com/politics/archive/2025/06/trump-israel-iran-bomb/683275/?gift=kPTlqn0J1iP9IBZcsdI5Ie8uG5lCCjj8j4qVMruuL_s"
  },
  {
    "text": "Some lawmakers in both parties question the legality of Trump's Iran strikes  —  Multiple Republicans and Democrats raised constitutional concerns about Trump acting without approval by Congress.  But GOP leaders offered support for his move.  —  WASHINGTON — Several members of Congress … ",
    "url": "https://www.nbcnews.com/politics/congress/lawmakers-both-parties-question-legality-trumps-iran-strikes-rcna214316"
  },
  {
    "text": "The United States Bombed Iran.  What Comes Next?  —  President Donald Trump has done what he swore he would not do: involve the United States in a war in the Middle East.  His supporters will tie themselves in knots (as Vice President J. D. Vance did last week) trying to jam the square peg … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/06/united-states-bombed-iran-now-what/683276/"
  },
  {
    "text": "Vance says U.S. 'not at war with Iran, we're at war with Iran's nuclear program'  —  President Donald Trump said Saturday night that the U.S. had dropped bombs on three Iranian nuclear sites, the first time the U.S. has directly attacked Iran.  —  WASHINGTON — Vice President JD Vance … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/vance-says-us-not-war-iran-re-war-irans-nuclear-program-rcna214329"
  },
  {
    "text": "U.S. strikes on Iran nuclear facilities see Hamas and the Houthis vow retaliation, as world leaders react  —  The U.S. strike on Iran's nuclear sites has fueled fears that Israel's war with Tehran could escalate into a wider regional conflict, and other countries reacted Sunday with calls for diplomacy and words of caution.",
    "url": "https://www.cbsnews.com/news/us-strikes-iran-nuclear-sites-world-reaction-israel-hamas-houthis/"
  },
  {
    "text": "With Military Strike His Predecessors Avoided, Trump Takes a Huge Gamble  —  President Trump is betting the United States can repel whatever retaliation Iran orders, and that it has destroyed the regime's chances of reconstituting its nuclear program.  —  Over the past two decades … ",
    "url": "https://www.nytimes.com/2025/06/21/us/politics/trump-iran-risks.html?unlocked_article_code=1.Q08.Vji2.MlL5VIBdC-WV&smid=url-share"
  },
  {
    "text": "Hegseth claims US ‘obliterated’ Iranian nuclear sites despite lack of assessment  —  US defense secretary praises Trump at first news briefing but Pentagon says it is too early for full damage assessment  —  The US defense secretary, Pete Hegseth, on Sunday repeated claims by Donald Trump … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/22/hegseth-iran-nuclear-sites-pentagon"
  },
  {
    "text": "Trump Says Key Nuclear Sites Were ‘Obliterated’  —  President Trump said the aim of attacking the three facilities was to destroy Iran's nuclear capability.  Iran said the sites had been hit but did not immediately describe the damage.  —  “Thank you very much.",
    "url": "https://www.nytimes.com/live/2025/06/22/world/israel-iran-us-trump?unlocked_article_code=1.Q08.OoFc.YX6pwPAUBdnS&smid=url-share"
  },
  {
    "text": "This time, it's Trump's war  —  Donald Trump brings America into Israel's war on Iran. … President Donald Trump claimed during his 2024 campaign for president that America had fought “no wars” during his first presidency, and that he was the first president in 72 years who could say that.",
    "url": "https://www.vox.com/world-politics/417460/iran-attack-trump-war"
  },
  {
    "text": "Iran parliament reportedly backs closure of oil transit channel  —  Iran's parliament has endorsed closing the Strait of Hormuz, a vital oil transit point off its coast, but the authority rests with regime security officials, per summaries of state-controlled media.",
    "url": "https://www.axios.com/2025/06/22/iran-closure-strait-of-hormuz"
  },
  {
    "text": "Top Democrats left in dark on Iran strike plans  —  Top Democrats on Capitol Hill say they weren't briefed in advance of the U.S. attack on Iran on Saturday, multiple sources familiar with the discussions told Axios.  —  Why it matters: Democrats left Capitol Hill for the Juneteenth holiday … ",
    "url": "https://www.axios.com/2025/06/22/democrats-trump-iran-nuclear-facilities"
  },
  {
    "text": "Bill Clinton Endorses Andrew Cuomo for New York City Mayor  —  The former president's endorsement is the latest example of how establishment Democrats seem to prefer Mr. Cuomo to his prime rival, Zohran Mamdani.  —  Former President Bill Clinton will offer a last-minute boost of support … ",
    "url": "https://www.nytimes.com/2025/06/22/nyregion/bill-clinton-endorse-cuomo-mayor.html?unlocked_article_code=1.Q08.tGef.ms0hR8bCURNQ&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "EXCLUSIVE: The Onion calls out ‘cowardice’ of Congress in full-page NYT ad  —  The ad features a scathing editorial, a physical copy of which was sent to all House and Senate members.  —  If you want to support The Handbasket's 100% independent journalism, become a paid subscriber or leave a tip.",
    "url": "https://www.thehandbasket.co/p/exclusive-the-onion-nyt-ad-congress-cowardice"
  },
  {
    "text": "Hundreds of Voice of America reporters fired as Trump guts outlet  —  Hundreds of journalists for Voice of America (VOA) - most of its remaining staff - have been fired by President Donald Trump's administration, effectively shutting down the US-funded news outlet.",
    "url": "https://www.bbc.com/news/articles/cgrx0e98peeo"
  },
  {
    "text": "Missteps, Confusion and ‘Viral Waste’: The 14 Days That Doomed U.S.A.I.D.  —  The rapid dismantling of the global aid agency remains one of the most consequential outcomes of President Trump's efforts to overhaul the federal government, showing his willingness to tear down institutions in defiance of the courts.",
    "url": "https://www.nytimes.com/2025/06/22/us/politics/usaid-cuts-doge.html"
  }
]