[
  {
    "text": "Trump's Speeches, Increasingly Angry and Rambling, Reignite the Question of Age … Former President Donald J. Trump vividly recounted how the audience at his climactic debate with Vice President Kamala Harris was on his side.  Except that there was no audience.  The debate was held in an empty hall.",
    "url": "https://www.nytimes.com/2024/10/06/us/politics/trump-speeches-age-cognitive-decline.html?unlocked_article_code=1.QE4.Sj6N.wDMvFD_Cmj4k&smid=url-share"
  },
  {
    "text": "Republicans are trying to up their early voting game — but Trump keeps getting in the way  —  The former president's rhetoric threatens to undermine a massive get-out-the-vote effort, some Republican strategists say.  —  Republicans are pouring tens of millions of dollars into getting GOP voters to cast ballots before Election Day.",
    "url": "https://www.politico.com/news/2024/10/06/trumps-early-voting-00182611"
  },
  {
    "text": "Election Skeptics Are Running Some County Election Boards in Georgia.  A New Rule Could Allow Them to Exclude Decisive Votes.  —  An examination of a new election rule in Georgia suggests that local officials in just a handful of rural counties could exclude enough votes to affect the outcome of the 2024 presidential race.",
    "url": "https://www.propublica.org/article/georgia-election-rule-could-exclude-votes"
  },
  {
    "text": "Mike Johnson refuses to say Donald Trump lost the 2020 election to Joe Biden  —  House Speaker Mike Johnson, R-La., on Sunday refused to say former President Donald Trump lost the 2020 election to President Joe Biden.  —  During a heated interview with ABC News' George Stephanopoulos … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/06/johnson-trump-lost-2020-election-biden/75544144007/"
  },
  {
    "text": "Kamala Harris, Tim Walz will be featured on “60 Minutes” tomorrow.  Here's what to know for the interview.  —  Voters will get the chance to hear from Vice President Kamala Harris on Monday as she presents her case for why she should be president in a “60 Minutes” election special.",
    "url": "https://www.cbsnews.com/news/how-to-watch-kamala-harris-60-minutes-interview/"
  },
  {
    "text": "Harris Will Appear in a Whirlwind of Interviews, Most of Them Friendly  —  After mostly avoiding interviews as her campaign began, the vice president will hold several this week, including with Howard Stern, Stephen Colbert and the hosts of “The View.”  —  Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2024/10/06/us/politics/kamala-harris-interviews-the-view-stern-stephen-colbert.html"
  },
  {
    "text": "All Hell Is Going to Break Loose: Maybe Jack Smith Did Precisely What Elie Honig Claims He Didn't  —  There are a number of laugh-in-his-face funny things about Elie Honig's column bitching that Jack Smith submitted his immunity filing before the election.  First, for years Honig whined … ",
    "url": "https://www.emptywheel.net/2024/10/06/all-hell-is-going-to-break-loose-maybe-jack-smith-did-precisely-what-elie-honig-claims-he-didnt/"
  },
  {
    "text": "Senate Republicans' strangely uneven spending map  —  The distribution of ad spending for Senate GOP candidates is highly lopsided, with a massive amount focused on Pennsylvania.  —  Senate Republican spending is heavily concentrated in just a handful of races — a distribution that doesn't match the reality of the battleground map.",
    "url": "https://www.politico.com/news/2024/10/06/senate-republican-ad-spending-map-uneven-00182625"
  },
  {
    "text": "Tim Walz Easily Bats Down Fox Anchor's Anti-Abortion Questions  —  Shannon Bream tried to frame the vice presidential nominee as an extremist on abortion.  He didn't let her  —  Gov. Tim Walz vociferously defended his record on abortion rights during an appearance on Fox News Sunday.",
    "url": "https://www.rollingstone.com/politics/politics-news/tim-walz-fox-anchor-abortion-law-1235127283/"
  },
  {
    "text": "‘Undisciplined, unhinged and deranged’: will Trump's strange behavior hurt him at the polls?  —  While he's always been quick to insult, he's now frequently vicious, and his speeches are increasingly disjointed  —  A “beautiful” beach body and a “mentally disabled” opponent.",
    "url": "https://www.theguardian.com/us-news/2024/oct/06/trump-behavior-final-meltdown"
  },
  {
    "text": "Florida prepares to evacuate millions of people ahead of another potential hurricane  —  The state is still recovering from Helene, which made landfall less than two weeks ago.  —  TALLAHASSEE, Florida — Florida is facing the threat of another major hurricane making landfall in the state … ",
    "url": "https://www.politico.com/news/2024/10/06/florida-hurricane-milton-evacuations-recovery-00182622"
  },
  {
    "text": "October 5, 2024  —  William McKinley is having a moment (which I confess is a sentence I never expected to write).  —  Republican presidential nominee Donald Trump is elevating McKinley, representative from Ohio from 1877 to 1891 and president from 1897 to 1901, to justify his plan to impose new high tariffs.",
    "url": "https://heathercoxrichardson.substack.com/p/october-5-2024"
  },
  {
    "text": "New York Dems are queasy over Cuomo's potential comeback  —  Cuomo's history of hardball politics haunts Democrats.  —  NEW YORK — Andrew Cuomo wants out of the political wilderness.  Many fellow New York Democrats wish he would stay there.  —  Concern over Cuomo possibly running … ",
    "url": "https://www.politico.com/news/2024/10/06/new-york-dems-cuomos-00182596"
  },
  {
    "text": "Hines & RFK Jr. ‘Have Barely Spoken’ Since Affair News Broke  —  EMBARRASSED  —  Cheryl Hines and Robert F. Kennedy Jr. “have barely spoken” since news emerged that he had a digital affair with New York magazine reporter Olivia Nuzzi, a source told People magazine.",
    "url": "https://www.thedailybeast.com/cheryl-hines-and-rfk-jr-have-barely-spoken-since-affair-news-broke"
  },
  {
    "text": "Hungarians protest state media ‘propaganda factory’ and demand unbiased press  —  Thousands of protesters gathered outside the headquarters of Hungary's public media corporation on Saturday to demonstrate against what they say is an entrenched propaganda network operated by the nationalist government at taxpayer expense.",
    "url": "https://apnews.com/article/hungarians-protest-media-propaganda-ef0f419ea38ea8d2beb4f0dd56d82d57"
  },
  {
    "text": "Trump's Return to Scene of Attack Was a Do-Over in More Ways Than One  —  The former president returned to the stage where a gunman tried to kill him in July and tried to recapture some of the momentum he had before President Biden dropped out.  —  Donald J. Trump returned to Butler, Pa. … ",
    "url": "https://www.nytimes.com/2024/10/05/us/politics/trump-butler-rally-musk.html"
  },
  {
    "text": "Harris attacks Trump with new Jack Smith revelations  —  The digital ad, shared first with POLITICO, is targeting voters in key battleground states.  —  Vice President Kamala Harris' campaign is directly invoking special counsel Jack Smith's investigation to attack former President Donald Trump, in a new ad provided first to POLITICO.",
    "url": "https://www.politico.com/news/2024/10/06/harris-trump-jack-smith-ad-00182628"
  },
  {
    "text": "Fact check: Six days of Trump lies about the Hurricane Helene response  —  Former President Donald Trump has delivered a barrage of lies and distortions about the federal response to Hurricane Helene.  —  While various misinformation about the response has spread widely without Trump's involvement … ",
    "url": "https://www.cnn.com/2024/10/06/politics/fact-check-trump-helene-response-north-carolina/"
  },
  {
    "text": "'It's not won': Democrats jittery over razor-thin race in Michigan  —  Harris still faces a number of challenges in the state.  —  FLINT, Michigan — Democrats across the country are fretting about Pennsylvania, a blue wall state that could crumble Vice President Kamala Harris' most straightforward path to victory.",
    "url": "https://www.politico.com/news/2024/10/05/kamala-harris-michigan-battleground-2024-00182614"
  }
]