[
  {
    "text": "Democrats romp, Youngkin flops: 4 takeaways from Tuesday's election  —  Joe Biden's party has had a very strong year at the ballot box.  Whether it extends to the president in 2024 is another matter.  —  Joe Biden has had a very bad few days.  His party just had a banner year.",
    "url": "https://www.politico.com/news/2023/11/08/election-day-2023-results-takeaways-00126035"
  },
  {
    "text": "Cassidy Hutchinson: Why I Testified  —  Happy Wednesday.  —  This is what is known as a vibe shift.  —  The polls suggested that Democrats were entering another Dark Night of the Soul, but once again they overperformed when the actual votes were counted.",
    "url": "https://plus.thebulwark.com/p/cassidy-hutchinson-why-i-testified-b25"
  },
  {
    "text": "Maybe Stealing Womens' Rights Wasn't the Best Election Plan  —  Abortion initiatives have gone seven for seven at the ballot box since the Supreme Court killed Roe.  Democrats are pressing the advantage  —  It's abortion, stupid.  —  Across the country on Tuesday night … ",
    "url": "https://www.rollingstone.com/politics/politics-features/abortion-wins-big-kentucky-ohio-virginia-2023-elections-1234872518/"
  },
  {
    "text": "Fox & Friends Blast Governor Glenn Youngkin's ‘Epic Failure’ in Virginia Election One Day After Going ALL IN On Him  —  One day after featuring Governor Glenn Youngkin and co-hosting Tuesday's show from Manassas, Virginia, Fox & Friends piled on following Tuesday's election results.",
    "url": "https://www.mediaite.com/tv/fox-friends-blast-governor-glenn-youngkins-epic-failure-in-virginia-election-one-day-after-going-all-in-on-him/"
  },
  {
    "text": "The GOP is in a Trump trap  —  Trump hasn't been a consistent electoral success — but Republicans have had even fewer winning nights without him.  —  I've never been a huge off-year elections person.  There are different types of election nerds, and I've always been more of a macro guy … ",
    "url": "https://www.natesilver.net/p/the-gop-is-in-a-trump-trap"
  },
  {
    "text": "Three Arrested for Operating High-End Brothel Network  —  For Immediate Release  —  U.S. Attorney's Office, District of Massachusetts  —  Interested sex buyers were allegedly required to provide employer information and references before booking appointments",
    "url": "https://www.justice.gov/usao-ma/pr/three-arrested-operating-high-end-brothel-network"
  },
  {
    "text": "Feds charge three with running high-end brothels allegedly frequented by politicians  —  Brothels were allegedly located in Fairfax and Tysons, Va.  —  The Justice Department said Wednesday it is investigating politicians, military officers and government contractors for buying sex through … ",
    "url": "https://www.politico.com/news/2023/11/08/feds-brothel-investigation-politicians-00126153"
  },
  {
    "text": "Minnesota Supreme Court dismisses effort to block Trump from state's primary ballot  —  A group of voters have been trying to ban Trump from the 2024 GOP primary and general election ballots based on 14th Amendment grounds.  —  The Minnesota Supreme Court on Wednesday dismissed an effort … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/minnesota-supreme-court-dismisses-effort-block-trump-states-primary-ba-rcna124291"
  },
  {
    "text": "Moms for Liberty Falls Flat on Its Face in School Board Races  —  Iowa chapters of the far-right group Moms for Liberty endorsed 13 candidates in school board races across the state.  Only one was elected.  —  The Tuesday loss is a stinging rebuke of Moms for Liberty, a “parental rights” … ",
    "url": "https://newrepublic.com/post/176746/moms-liberty-falls-flat-face-school-board-races-iowa"
  },
  {
    "text": "Behind Hamas's Bloody Gambit to Create a ‘Permanent’ State of War  —  Hamas leaders say they waged their Oct. 7 attack on Israel because they believed the Palestinian cause was slipping away, and that only violence could revive it.  —  Thousands have been killed in Gaza, with entire families wiped out.",
    "url": "https://www.nytimes.com/2023/11/08/world/middleeast/hamas-israel-gaza-war.html"
  },
  {
    "text": "Fatalism creeps in around DeSantis  —  In the shadow of polls showing DeSantis hasn't cut into former Trump's lead at the national level or in early state contests, there is a sense of growing fatalism around the Florida governor.  —  “It feels like in July I'll be wearing a f—",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/third-republican-debate-live-updates-rcna121790/rcrd24990?canonicalCard=true"
  },
  {
    "text": "House GOP subpoenas Hunter Biden alongside suite of Biden family members  —  Hunter Biden and his uncle James Biden have been subpoenaed Wednesday by the House Oversight Committee, which took the remarkable step of seeking depositions from family members of President Biden amid its impeachment inquiry.",
    "url": "https://thehill.com/homenews/house/4300041-house-gop-subpoenas-hunter-biden/"
  },
  {
    "text": "Comer Issues Subpoenas to Biden Family & Associates  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today issued subpoenas to President Joe Biden's son, Hunter Biden, brother, James Biden, and Biden family associate, Rob Walker, to appear for depositions.",
    "url": "https://oversight.house.gov/release/comer-issues-subpoenas-to-biden-family-associates%EF%BF%BC/"
  },
  {
    "text": "'I'm calling from Israeli intelligence.  We have the order to bomb.  You have two hours'  —  The call to Mahmoud Shaheen came at dawn.  —  It was Thursday 19 October at about 06:30, and Israel had been bombing Gaza for 12 days straight.  —  He'd been in his third-floor … ",
    "url": "https://www.bbc.com/news/world-middle-east-67327079"
  },
  {
    "text": "Jim Jordan Sniffs Dick Pics While Rome Burns  —  Yesterday, David Weiss, the US Attorney turned Special Counsel leading an investigation into Hunter Biden that has entered a sixth year, testified to the House Judiciary Committee.  —  His written statement debunked Gary Shapley's claims … ",
    "url": "https://www.emptywheel.net/2023/11/08/jim-jordan-sniffs-dick-pics-while-rome-burns/"
  },
  {
    "text": "FDA approves blockbuster Eli Lilly drug for weight loss  —  The Food and Drug Administration (FDA) approved Eli Lilly's blockbuster diabetes drug for weight loss management Wednesday, giving patients another tool and opening the door to potentially much wider use.",
    "url": "https://thehill.com/policy/healthcare/4300243-fda-approves-lilly-drug-weight-loss/"
  },
  {
    "text": "House Republicans don't want a government shutdown, but there's still no plan  —  With nine days left before the Nov. 17 deadline, neither the House nor the Senate have settled on a path forward, and Speaker Mike Johnson is considering an array of GOP ideas.",
    "url": "https://www.nbcnews.com/politics/congress/congress-no-deal-avoid-government-shutdown-nov-17-rcna124214"
  },
  {
    "text": "Ten Members and Associates of the Gambino Crime Family Arrested in Coordinated U.S.-Italian Takedown  —  For Immediate Release  —  U.S. Attorney's Office, Eastern District of New York  —  Defendants Charged in Brooklyn Federal Court with Racketeering Conspiracy Involving Violent Extortions, Assaults, Arson, and Union-Related Crimes",
    "url": "https://www.justice.gov/usao-edny/pr/ten-members-and-associates-gambino-crime-family-arrested-coordinated-us-italian"
  }
]