[
  {
    "text": "Exclusive: Liz Cheney's new book blasts GOP as ‘enablers and collaborators’ of Trump, whom one member called ‘Orange Jesus’  —  In her new book, former Rep. Liz Cheney paints a scathing portrait of the Republican Party, condemning her former colleagues and party leaders as … ",
    "url": "https://www.cnn.com/2023/11/28/politics/liz-cheney-trump-mccarthy-book/"
  },
  {
    "text": "If Trump convicted, Home Depot billionaire says he'd still likely fund campaign  —  Republican mega-donor Bernie Marcus said on Tuesday he would likely still give money to Donald Trump's 2024 presidential bid if the former president was convicted of a crime - but the billionaire does not plan to be one of his biggest financial backers.",
    "url": "https://www.reuters.com/world/us/home-depot-billionaire-says-hed-likely-still-fund-trump-if-candidate-convicted-2023-11-28/"
  },
  {
    "text": "The bad news is Trump is polling well — but the good news is he's ready to blow it  —  Trump is running on the Big Lie and a promise to take away Obamacare — both are losing strategies  —  Democrats, for very good reason, have been in a poll-induced panic for weeks now.",
    "url": "https://www.salon.com/2023/11/29/the-news-is-is-polling-well--but-the-good-news-is-hes-ready-to-blow-it/"
  },
  {
    "text": "Biden, Faced with Economic Pessimism, Turns to Economic Populism  —  As ‘Bidenomics’ fails to catch on with voters, the president is turning to a more populist message focused on price gouging and business ‘greed’  —  President Joe Biden is reemphasizing his focus on an economic populism … ",
    "url": "https://themessenger.com/politics/biden-faced-with-economic-pessimism-turns-to-economic-populism"
  },
  {
    "text": "Biden targets GOP Rep. Boebert in her district in a fresh political attack on Republicans  —  DENVER (AP) — President Joe Biden will try to turn Rep. Lauren Boebert of Colorado into the embodiment of Republican opposition to his agenda as he visits her congressional district on Wednesday.",
    "url": "https://apnews.com/article/joe-biden-boebert-colorado-republicans-0edd0c6f25fe17edd92f8c80b0488f89"
  },
  {
    "text": "Mysterious woman tells school board that Scholastic book sparked porn addiction  —  On November 14, a 20-year-old woman named Lanah Burkhardt appeared before the school board of the Conroe Independent School District in Texas.  Burkhardt told the board that, when she was 11 … ",
    "url": "https://popular.info/p/mysterious-woman-tells-school-board"
  },
  {
    "text": "Playbook: Why the left is blanching at the border talks  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — “US military Osprey aircraft with 6 aboard crashes off southern Japan, at least 1 dead,” by AP's Mari Yamaguchi in Tokyo",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/29/why-the-left-is-blanching-at-the-border-talks-00129019"
  },
  {
    "text": "US military Osprey aircraft with 6 aboard crashes off southern Japan, at least 1 dead  —  A crew member who was recovered from the ocean after a U.S. military Osprey aircraft carrying six people crashed Wednesday off southern Japan has been pronounced dead, coast guard officials said.",
    "url": "https://apnews.com/article/japan-us-military-osprey-helicopter-crash-7d704ec5925826593aebcf0e7d1312ca"
  },
  {
    "text": "Why an anti-Trump group is running some pro-Trump ads  —  Well-funded groups connected to the conservative Club for Growth have been spending millions this year to attack Donald Trump — while simultaneously running ads touting their endorsed GOP candidates' ties to Trump.",
    "url": "https://www.axios.com/2023/11/29/pac-trump-ads-campaign-spending"
  },
  {
    "text": "Elon Musk has boosted the ‘pizzagate’ conspiracy theory five times in the last two weeks  —  A new iteration of “pizzagate” has focused on unfounded claims that journalists were part of the conspiracy theory.  —  Elon Musk continued to boost a debunked conspiracy theory Tuesday … ",
    "url": "https://www.nbcnews.com/tech/tech-news/elon-musk-boosted-pizzagate-conspiracy-theory-rcna127087"
  },
  {
    "text": "Indian gov't official directed Sikh separatist's assassination plot in US, DOJ says  —  An Indian government official directed an unsuccessful plot to assassinate a Sikh separatist on U.S. soil, the U.S. Justice Department said on Wednesday, in announcing charges against a man accused of orchestrating the attempted murder.",
    "url": "https://www.reuters.com/world/us/us-charges-indian-national-with-conspiracy-assassinate-sikh-advocate-2023-11-29/"
  },
  {
    "text": "First plane using only sustainable fuel flies across Atlantic  —  A Virgin Atlantic plane powered using only sustainable fuel completed its flight from London to New York on Tuesday, highlighting an eco-friendly and low-carbon option for transatlantic flights.",
    "url": "https://thehill.com/policy/energy-environment/4332469-first-plane-using-only-sustainable-fuel-flies-across-atlantic/"
  },
  {
    "text": "Underserved communities benefiting most from Biden climate law: Treasury  —  Underserved communities are the ones benefitting the most from the Biden administration's Inflation Reduction Act (IRA) climate efforts, the Treasury Department announced Wednesday.",
    "url": "https://thehill.com/policy/energy-environment/4333010-inflation-reduction-act-analysis-underserved-communities/"
  },
  {
    "text": "Whitmer's sister suspends campaign in New York House district, backs Jones  —  Liz Whitmer Gereghty, a small-business owner and the sister of Michigan Gov. Gretchen Whitmer (D), announced Wednesday that she's suspending her House campaign in New York and backing former Rep. Mondaire Jones (D-N.Y.) instead.",
    "url": "https://thehill.com/homenews/campaign/4332932-liz-whitmer-gereghty-new-york-house-suspends-campaign-backs-mondaire-jones/"
  },
  {
    "text": "Jimmy Carter Emerges From Hospice Care for Rosalynn's Memorial Service  —  “Come hell or high water, Jimmy Carter was going to use his inner resources to be there,” the presidential historian Douglas Brinkley said of Mr. Carter's emerging from hospice care for his wife's memorial service.",
    "url": "https://www.nytimes.com/2023/11/28/us/jimmy-carter-health.html"
  },
  {
    "text": "Saudi Arabia Offers Iran Investment to Limit Israel-Hamas War  — Kingdom's offer hinges on Iran reining in its regional proxies  — Riyadh is also working with US and Arab allies to contain Iran … The proposal has been delivered directly and through multiple means since Hamas's attack … ",
    "url": "https://www.bloomberg.com/news/articles/2023-11-29/iran-saudi-proposals-seek-to-deescalate-tensions-amid-israel-hamas-war"
  },
  {
    "text": "Chicago's Brandon Johnson blames Lori Lightfoot for ‘international crisis’ he inherited  —  Mayor Brandon Johnson is blaming the growing migrant crisis in Chicago on his predecessor Lori Lightfoot, saying he “inherited” the influx of immigrants from the previous administration.",
    "url": "https://www.washingtonexaminer.com/policy/immigration/chicago-brandon-johnson-blames-lori-lightfoot-migrant-crisis"
  },
  {
    "text": "Melania Trump Adds Awkward Touch to Rosalynn Carter Funeral  —  In recent decades the former presidents and First Ladies have made a big show of their post-White House chumminess.  In 2005, Bill Clinton and George H.W. Bush teamed up to raise money for victims of the Indian Ocean tsunami … ",
    "url": "https://nymag.com/intelligencer/2023/11/melania-trump-rosalynn-carter-funeral.html"
  },
  {
    "text": "Top-ranking CIA official shared pro-Palestinian Facebook posts weeks after Hamas terror attack: report  —  A high-ranking CIA official boldly shared multiple pro-Palestinian images on her Facebook page just two weeks after Hamas launched its bloody surprise attack on Israel … ",
    "url": "https://nypost.com/2023/11/28/news/top-cia-agent-shared-pro-palestinian-to-facebook-after-hamas-attack-report/"
  }
]