[
  {
    "text": "Republican debate: Haley calls Ramaswamy ‘scum’ in dustup over TikTok  —  Former U.N. Ambassador Nikki Haley and entrepreneur Vivek Ramaswamy swung at each other during the third Republican primary presidential debate over their use of TikTok, with Haley calling her opponent scum.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/republican-debate-haley-calls-ramaswamy-scum-dustup-tiktok"
  },
  {
    "text": "Trump says he's bored by the primary debates, won't attend the next one  —  “They're not watchable,” Trump said.  —  HIALEAH, Fla. — Donald Trump spent the third presidential primary debate 10 miles away, musing about how dull the night he was ditching surely was.",
    "url": "https://www.politico.com/news/2023/11/08/trump-hialeah-fl-rally-debate-00126287"
  },
  {
    "text": "Losers, scumbags and policy, too.  The third GOP debate got testy, quick.  —  The former U.N. ambassador sparred with, seemingly, everyone amid a race for the number-two slot.  —  Nikki Haley's ascension in the GOP primary was hard to ignore Wednesday night.",
    "url": "https://www.politico.com/news/2023/11/08/third-republican-debate-highlights-key-moments-00126221"
  },
  {
    "text": "GOP strategists urge congressional candidates to campaign against a national abortion ban  —  Disturbed by tough election losses on Tuesday, Republicans say the party needs to make clear to voters, in speeches and TV ads, that it doesn't favor banning all abortions.",
    "url": "https://www.nbcnews.com/politics/congress/republicans-urge-congress-candidates-oppose-national-abortion-ban-rcna124253"
  },
  {
    "text": "DOJ announces arrests in ‘high-end brothel network’ used by elected officials, military officers and others  —  Three individuals have been arrested on charges of operating a “high-end brothel network” in Massachusetts and Virginia with a clientele that included elected officials … ",
    "url": "https://www.cnn.com/2023/11/08/politics/high-end-brothel-network-arrests/"
  },
  {
    "text": "Three Arrested for Operating High-End Brothel Network  —  For Immediate Release  —  U.S. Attorney's Office, District of Massachusetts  —  Interested sex buyers were allegedly required to provide employer information and references before booking appointments",
    "url": "https://www.justice.gov/usao-ma/pr/three-arrested-operating-high-end-brothel-network"
  },
  {
    "text": "Ramaswamy appears to call Zelensky a ‘Nazi’ at GOP debate  —  Republican presidential candidate Vivek Ramaswamy appeared to call Ukrainian President Volodymyr Zelensky a “Nazi” during the GOP debate Wednesday, with his campaign later seeking to clarify his remarks.",
    "url": "https://thehill.com/homenews/campaign/4300935-ramaswamy-calls-zelensky-a-nazi/"
  },
  {
    "text": "Ramaswamy Seemed to Call Zelensky a Nazi.  His Campaign Says That's Not What He Meant.  —  A spokeswoman for Mr. Ramaswamy acknowledged that, without context, his remark could be easily misunderstood.  —  Vivek Ramaswamy drew shock and criticism online on Wednesday when he appeared to accuse … ",
    "url": "https://www.nytimes.com/2023/11/08/us/politics/ramaswamy-zelensky-nazi-comment.html"
  },
  {
    "text": "SAG-AFTRA Reaches Tentative Agreement With Studios, Ending Actors Strike  —  The work stoppage will end 12:01 a.m. on Thursday. … The SAG-AFTRA TV/Theatrical Committee approved the agreement in a unanimous vote on Wednesday, SAG-AFTRA announced.  The strike will end at 12:01 am Thursday.",
    "url": "https://www.hollywoodreporter.com/business/business-news/sag-aftra-deal-reached-studios-union-contract-terms-1235607563/"
  },
  {
    "text": "School board voters fight back  —  Earlier this year, Popular Information reported that the Pennridge School Board in Pennsylvania hired Jordan Adams, a right-wing educational consultant, to assist in the development of curriculum and other issues.  Adams launched his company, Vermilion Education, in March 2023.",
    "url": "https://popular.info/p/update-school-board-voters-fight"
  },
  {
    "text": "Echoes of Jan. 6 committee as Jack Smith foreshadows plan to tie Trump to Capitol riot  —  Donald Trump doesn't want prosecutors to talk about Jan. 6.  They want to make it central to their case.  —  When Donald Trump faces a jury on charges stemming from his bid to subvert the 2020 election … ",
    "url": "https://www.politico.com/news/2023/11/09/donald-trump-jan-6-riot-defendant-00126258"
  },
  {
    "text": "James Comer, Like Joe Biden, Also Paid His Brother $200K  —  James Comer is going after Joe Biden because he loaned his brother, James Biden, $200,000.  If that's the standard, James Comer may want to investigate himself. … Pay Dirt is a weekly foray into the pigpen of political funding.",
    "url": "https://www.thedailybeast.com/james-comer-like-joe-biden-also-paid-his-brother-dollar200k"
  },
  {
    "text": "The untold story of an FBI inquiry into Biden's golf club membership  —  GREENVILLE, Del. — In August 2001, leaders at the exclusive Fieldstone Golf Club voted to admit a prominent new member: Sen. Joe Biden.  —  At the time, Biden walked a delicate line.",
    "url": "https://www.washingtonpost.com/politics/2023/11/09/fbi-biden-golf-club-membership-probe/"
  },
  {
    "text": "Tim Scott's girlfriend is, in fact, real.  —  The senator debuted his significant other at the most charming of spots: the stage of the GOP primary debate.  —  Who says that politics isn't romantic?  —  Sen. Tim Scott on Wednesday finally debuted his girlfriend, bringing her onstage … ",
    "url": "https://www.politico.com/news/2023/11/08/tim-scott-girlfriend-is-real-00126293"
  },
  {
    "text": "GOP Candidates Say Lack Of Energy Is Causing Inflation — Despite Record Oil Production  —  August now holds the record for the most barrels of oil, according to the Energy Department.  —  LOADING  —  Looking for solutions to inflation, a couple of Republican presidential candidates … ",
    "url": "https://www.huffpost.com/entry/gop-debate-energy-inflation_n_654c482fe4b0ea0b7f95a411"
  },
  {
    "text": "U.S. officials pick Greenbelt, Md., for new FBI national headquarters  —  Prince George's suburb selected despite concerns from FBI leaders over the decision-making process, a person familiar with the situation said  —  Federal officials have decided the FBI will leave its iconic … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/11/08/fbi-headquarters-chosen-greenbelt/"
  },
  {
    "text": "Nikki Haley is running for president as a China hawk — but her record suggests a different picture  —  As governor of South Carolina, she embraced doing business with China.  —  White House hopeful Nikki Haley speaks during a presidential campaign stop at the South Carolina State House, Oct. 30, 2023, in Columbia, S.C.",
    "url": "https://abcnews.go.com/US/nikki-haley-running-china-hawk-record-suggests-picture/story?id=104726771"
  },
  {
    "text": "Emotions are running high at the White House as some aides' frustration with Israel is growing  —  Washington and Tokyo CNN  —  Angst, unease and outrage are spreading through corners of the Biden administration as Israeli forces show no signs of letting up their relentless attacks inside Gaza … ",
    "url": "https://www.cnn.com/2023/11/08/politics/biden-administration-israel-hamas-war/"
  }
]