[
  {
    "text": "Statement from President Joe Biden  —  The Special Counsel released today its findings about its look into my handling of classified documents.  I was pleased to see they reached the conclusion I believed all along they would reach - that there would be no charges brought in this case and the matter is now closed.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/08/statement-from-president-joe-biden-5/"
  },
  {
    "text": "Just Say It, Democrats: Biden Has Been a Great President … A plea to my Democratic friends: It's time to start calling Joe Biden a great president.  Not a good one.  Not a better choice than Donald Trump.  Joe Biden is a historically great president.  Say it with passion backed by the conviction that it's true.",
    "url": "https://newrepublic.com/article/178435/biden-great-president-say-it-democrats"
  },
  {
    "text": "Biden Cleared in Documents Case; Report Raises Concerns About His Memory  —  The inquiry found that the president had willfully retained material after finishing his term as vice president and had shared sensitive information with a ghostwriter.  —  The special counsel investigating President Biden … ",
    "url": "https://www.nytimes.com/2024/02/08/us/biden-documents-special-counsel.html"
  },
  {
    "text": "Special counsel says there is evidence Biden ‘willfully retained and disclosed classified materials’ but will not be charged  —  The decision caps off a year-long saga and means Donald Trump remains the only president in history to face criminal charges.  —  WASHINGTON — Special counsel Robert Hur … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/special-counsel-says-evidence-biden-willfully-retained-disclosed-class-rcna96666"
  },
  {
    "text": "Special counsel describes Biden as ‘elderly man with a poor memory’ in eyebrow-raising report  —  Special counsel Robert Hur on Thursday released a 388-page report on President Biden's retention of classified material, finding the president frequently showed limitations with his memory and recall.",
    "url": "https://thehill.com/homenews/administration/4456879-special-counsel-describes-biden-as-elderly-man-with-a-poor-memory-in-eye-raising-report/"
  },
  {
    "text": "Biden responds angrily to special counsel report questioning his memory  —  President Biden on Thursday night gave an emotional and at times angry response to a special counsel's report questioning his memory, addressing the nation hours after a special counsel report painted a devastating picture … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/08/biden-hur-response/"
  },
  {
    "text": "Oral surgery at today's Supreme Court  —  They will dissect Section 3 of the 14th Amendment during oral argument  —  The Supreme Court hears oral arguments today on whether Section 3 of the 14th Amendment of the Constitution bars Trump from appearing on the ballot in Colorado and other states … ",
    "url": "https://robertreich.substack.com/p/oral-surgery-at-todays-supreme-court"
  },
  {
    "text": "Congress has already disqualified Trump from the ballot  —  Editor's Note: Tristan Snell is author of the new book “Taking Down Trump: 12 Rules for Prosecuting Donald Trump by Someone Who Did it Successfully.”  He is a lawyer and legal commentator who has appeared on MSNBC and CNN … ",
    "url": "https://www.cnn.com/2024/02/08/opinions/trump-supreme-court-oral-arguments-election-snell/"
  },
  {
    "text": "Live updates Supreme Court skeptical of challenge to Trump's eligibility  —  The Supreme Court on Thursday seemed prepared to keep Donald Trump on the Colorado ballot, expressing deep concerns about the ability of a single state to disqualify a candidate from seeking national office.",
    "url": "https://www.washingtonpost.com/politics/2024/02/08/trump-supreme-court-colorado-ballot/"
  },
  {
    "text": "“Awful and unethical”: Legal experts say Judge Cannon could face removal for “disturbing” order  —  “Compromising national security is a bridge too far,” says longtime Harvard legal scholar Laurence Tribe  —  Legal experts sounded the alarm after the judge overseeing Donald Trump's classified … ",
    "url": "https://www.salon.com/2024/02/08/awful-and-unethical-legal-experts-say-cannon-could-face-removal-for-disturbing-order/"
  },
  {
    "text": "Authorities investigating online threats made to potential witness related to Trump classified docs case  —  The threats are cited in a court filing from the special prosecutor.  —  Former President Donald Trump arrives at the New York State Supreme Court in New York, on Oct. 2, 2023.",
    "url": "https://abcnews.go.com/US/authorities-investigating-online-threats-made-potential-witness-trump/story?id=107057357"
  },
  {
    "text": "Foreign aid package finally breaks through Senate logjam  —  After a four-month detour for a border deal that died in three days, the Senate is moving forward on a $95 billion aid package for Ukraine, Israel and the Indo-Pacific. … The Pentagon is already out of funds for Ukraine … ",
    "url": "https://www.axios.com/2024/02/08/senate-foreign-aid-package-vote-border"
  },
  {
    "text": "On live TV, Guardian Angels rough up a man in Times Square then misidentify him as a ‘migrant’  —  Members of the Guardian Angels roughed up a man during a live interview on Fox News Tuesday night, then misidentified him as a “migrant” in a primetime segment meant to highlight disorder and crime caused by new arrivals to New York City.",
    "url": "https://apnews.com/article/guardian-angels-times-square-migrants-curtis-sliwa-dacb23b7cfe0679d12642bca116543d4"
  },
  {
    "text": "Famed climate scientist wins million-dollar verdict against right-wing bloggers  —  The verdict comes amid heightened attacks on scientists working on climate change, vaccines and other issues  —  Michael Mann, a prominent climate scientist, won his long-standing legal battle … ",
    "url": "https://www.washingtonpost.com/climate-environment/2024/02/08/michael-mann-bloggers-defamation-trial/"
  },
  {
    "text": "Trader Joe's announces recall for 4 items over Listeria concerns  —  Trader Joe's on Wednesday recalled four items containing cotija cheese over a potential listeria contamination following an announcement by the Food and Drug Administration (FDA).  —  The grocery store announced … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/4457120-trader-joes-recall-listeria-concerns/"
  },
  {
    "text": "Missouri senators vote against allowing abortions in rape, incest cases  —  Missouri senators voted Wednesday against amendments that would have allowed abortions in the cases of rape and incest in the state.  —  Missouri senators debated a bill that would make it illegal for public funds … ",
    "url": "https://thehill.com/homenews/state-watch/4456756-missouri-senators-vote-against-allowing-abortions-in-rape-incest-cases/"
  },
  {
    "text": "Horrifying: ‘Transwoman’ Child Abuser Who Molested a BABY Gets Plea Deal With Zero Jail Time  —  We get told all the time by the trans rights activists (TRAs) that trans people are not child abusers and it's true that a great many of them likely are not.  But then the TRAs try to tell us … ",
    "url": "https://twitchy.com/grateful-calvin/2024/02/08/horrifying-transwoman-child-abuser-who-molested-a-baby-gets-plea-deal-with-zero-jail-time-n2392695"
  },
  {
    "text": "FCC outlaws AI voices in robocall fraud  —  The Federal Communications Commission has declared the use of AI-generated voices in scam robocalls illegal, with immediate effect. … - While using AI to perpetrate a scam or fraud was already illegal, now using AI to generate voices in such calls is itself illegal.",
    "url": "https://www.axios.com/2024/02/08/fcc-ai-robocalls-illegal"
  },
  {
    "text": "Hawaii's Supreme Court Insists There Is No Individual Right to Arms  —  In the landmark 2008 case District of Columbia v. Heller, the U.S. Supreme Court explicitly recognized that the Second Amendment protects an individual right to arms.  It reaffirmed that conclusion two years later in McDonald v. Chicago … ",
    "url": "https://reason.com/2024/02/08/hawaiis-supreme-court-insists-there-is-no-individual-right-to-arms/"
  },
  {
    "text": "CIA terminates whistleblower who prompted flood of sexual misconduct complaints  —  The CIA this week terminated a woman whose whistleblower account of being assaulted in a stairwell at the spy agency's headquarters prompted a flood of colleagues to come forward with their own complaints of sexual misconduct.",
    "url": "https://apnews.com/article/cia-sexual-misconduct-harassment-spying-whistleblower-49b949a293f51416f51dca9daa9b6180"
  },
  {
    "text": "Chinese hackers infiltrated plane, train and water systems for five years, US says  —  A group known as Volt Typhoon, geared toward sabotage, quietly burrowed into critical US infrastructure networks  —  An advanced group of Chinese hackers taking aim at critical US infrastructure has been active … ",
    "url": "https://www.theguardian.com/technology/2024/feb/08/chinese-hack-us-transportation-infrastructure"
  },
  {
    "text": "Tucker Carlson's Fatal Attraction  —  The right-wing conspiracy monger shares Putin's worldview.  —  THE TITLE OF MY 2003 BOOK, Useful Idiots, was a reference to a perhaps apocryphal quote sometimes attributed to Lenin to the effect that gullible liberals in the West would prove useful idiots for the Soviet Union.",
    "url": "https://plus.thebulwark.com/p/tucker-carlsons-fatal-attraction"
  },
  {
    "text": "Statement from Congresswoman Cathy McMorris Rodgers  —  Washington, D.C. - Today, Eastern Washington Congresswoman Cathy McMorris Rodgers (WA-05) released the following statement.",
    "url": "https://mcmorris.house.gov/posts/statement-from-congresswoman-cathy-mcmorris-rodgers"
  },
  {
    "text": "Right-Wing Bloggers Busted During Militia Border Tour  —  The Texas Department of Public Safety (DPS) recently arrested two right-wing bloggers riding in a caravan near Eagle Pass after finding what law enforcement described as a plastic bag containing a “white powdery substance,” marijuana … ",
    "url": "https://www.texasobserver.org/celeste-sparks-pena-ahuyon-bloggers-eagle-pass/"
  },
  {
    "text": "Video shows KCPD wrestle Black woman to ground at Power & Light, call her an ‘animal’  —  A Kansas City woman says she suffered a concussion, memory loss, a swollen eye and a bruised face when several off-duty Kansas City police officers wrestled her to the ground during an arrest at the Power & Light District last week.",
    "url": "https://www.kansascity.com/news/local/article285132147.html"
  },
  {
    "text": "Mike Johnson Traded Senate Endorsement for Israel Vote—Then Went Back on His Word  —  Johnson's endorsement of Rep. Matt Rosendale's Senate campaign, and Rosendale's vote for an Israel aid bill, both raised eyebrows.  It turns out they were linked. … A pair of unusual moves … ",
    "url": "https://www.thedailybeast.com/mike-johnson-traded-matt-rosendale-montana-senate-endorsement-for-israel-votethen-went-back-on-his-word"
  }
]