[
  {
    "text": "Trump Drops Lawsuit Against Judge Who Doomed His Company  —  The former president's attempt to throw a wrench in the New York AG's case against him by suing Justice Arthur F. Engoron was a failure.  —  A week into his bank fraud trial, Donald Trump late Thursday night dropped … ",
    "url": "https://www.thedailybeast.com/trump-drops-lawsuit-against-judge-arthur-f-engoron-who-doomed-his-company"
  },
  {
    "text": "The Irony of Trump Whining About a Jury Trial His Lawyers Didn't Formally Request  —  How can Donald Trump complain about not getting a jury trial if his own lawyers didn't file the paperwork to ask for one?  By being Donald Trump. … When the judge overseeing Donald Trump's bank fraud trial reminded … ",
    "url": "https://www.thedailybeast.com/the-irony-of-trump-whining-about-a-jury-trial-his-lawyers-didnt-formally-request"
  },
  {
    "text": "Trump seeks pause in New York fraud trial  —  Attorneys for former President Trump are seeking to temporarily pause his civil fraud trial, along with the enforcement of a ruling issued before the trial started finding Trump and his business liable for fraud, until after the case has been appealed.",
    "url": "https://thehill.com/regulation/court-battles/4242026-trump-seeks-pause-in-new-york-fraud-trial/"
  },
  {
    "text": "Speaker race splits House Republicans … Hern hasn't officially entered the speaker race.  —  House Republicans will host a candidate forum Tuesday night and the closed party election Wednesday.  There is no timeline for electing a speaker on the House floor. … There's no other way to say it.",
    "url": "https://punchbowl.news/article/jordan-scalise-hern-to-face-off-in-speaker-debate/"
  },
  {
    "text": "Inside Trump's earlier secret bid for House speaker as McCarthy nomination drama unfolded  —  From ABC News Chief Washington Correspondent Jonathan Karl's upcoming book.  —  Former U.S. President Donald Trump arrives to deliver remarks at the South Carolina State House, Jan. 28, 2023 in Columbia, SC.",
    "url": "https://abcnews.go.com/Politics/inside-trumps-earlier-secret-bid-house-speaker-mccarthy/story?id=103779066"
  },
  {
    "text": "America needs to talk about the right's ‘Red Caesar’ plan for U.S. dictatorship  —  The incredible scenes this week on Capitol Hill — leaving the U.S. House without a speaker and promising an autumn of sheer chaos in Congress — marked a rapid escalation of the downward spiral of American democracy.",
    "url": "https://www.inquirer.com/opinion/red-caesar-right-american-dictatorship-20231005.html"
  },
  {
    "text": "‘What Is Broken in American Politics Is the Republican Party’  —  Fourteen experts on the roots of Kevin McCarthy's ouster and what's broken in American politics  —  “McCarthy chose to accept his fate” “Trump acted as a lightning rod” “The culture of democracy is robust” “A project at war with the Constitution”",
    "url": "https://www.politico.com/news/magazine/2023/10/06/republican-leaders-mccarthy-expert-roundup-00120170"
  },
  {
    "text": "Playbook: Inside Trump's surprise endorsement  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  BREAKING OVERNIGHT — AP: “Imprisoned activist NARGES MOHAMMADI won the Nobel Peace Prize Friday for fighting the oppression of women in Iran.”",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/06/inside-trumps-surprise-endorsement-00120314"
  },
  {
    "text": "Trump allegedly discussed US nuclear subs with foreign national after leaving White House: Sources  —  Trump allegedly discussed the information with an Australian billionaire.  —  Months after leaving the White House, former President Donald Trump allegedly discussed potentially sensitive information … ",
    "url": "https://abcnews.go.com/US/after-white-house-trump-allegedly-discussed-potentially-sensitive/story?id=103760456"
  },
  {
    "text": "Payrolls soared by 336,000 in September, defying expectations for a hiring slowdown  — Nonfarm payrolls increased by 336,000 for the month, better than the Dow Jones consensus estimate for 170,000.  — Average hourly earnings rose 0.2% for the month and 4.2% from a year ago, compared to respective estimates for 0.3% and 4.3%.",
    "url": "https://www.cnbc.com/2023/10/06/jobs-report-september-2023.html"
  },
  {
    "text": "Running Spoiler Campaigns Does Not Protect ‘Democracy’ … Most Americans who oppose Donald Trump agree the threat to democracy is the major issue of the 2024 election.  But what, precisely, constitutes the threat?  To most Democrats, the danger is that the election will install into power … ",
    "url": "https://nymag.com/intelligencer/2023/10/running-spoiler-campaigns-does-not-protect-democracy.html"
  },
  {
    "text": "Kentucky 2023 Poll: Beshear Holds 16-Point Lead Over Cameron in Gubernatorial Election  —  Home Polls Kentucky 2023 Poll: Beshear Holds 16-Point Lead Over Cameron in Gubernatorial Election  —  A new Emerson College Polling survey of Kentucky voters finds incumbent Democratic Governor Andy Beshear … ",
    "url": "https://emersoncollegepolling.com/kentucky-2023-poll-beshear-holds-16-point-lead-over-cameron-in-gubernatorial-election/"
  },
  {
    "text": "During an online fundraiser, Matt Gaetz denounced the Biden impeachment effort as unserious  —  As the House tries to replace Kevin McCarthy, the future of the impeachment inquiry could become a bargaining chip in the wrangling to win the speakership.  —  WASHINGTON — Days before Rep. Matt Gaetz led … ",
    "url": "https://www.nbcnews.com/politics/congress/gaetz-biden-impeachment-rosendale-rcna119131"
  },
  {
    "text": "Ron DeSantis jabs Trump, says he would be a ‘lame duck’ president if elected  — Gov. Ron DeSantis of Florida says former President Donald Trump failed to “drain the swamp” in Washington while serving in the White House.  — DeSantis lags rump by around 40 points nationally in the average polling numbers of the Republican primary.",
    "url": "https://www.cnbc.com/2023/10/06/ron-desantis-jabs-former-president-trump-in-white-house-race.html"
  },
  {
    "text": "I.R.S. Puts Lien on Giuliani's Palm Beach Condo for $550,000 Tax Debt  —  The action by federal tax officials is the latest sign of Rudolph W. Giuliani's growing financial troubles.  —  The I.R.S. has placed a lien on a Florida property owned by Rudolph W. Giuliani, the former New York City mayor … ",
    "url": "https://www.nytimes.com/2023/10/05/us/politics/irs-lien-giuliani-palm-beach-condo.html"
  },
  {
    "text": "Hannity Mocks ‘The View’ Co-Host by Saying His Dad Hit Him With a Belt  —  CORPORAL PUNISHMENT  —  Sean Hannity took a swipe at The View co-host Sunny Hostin on Thursday night for being a “snowflake” and said his own father used to beat him with a belt.  In a segment about Rep. Jim Jordan … ",
    "url": "https://www.thedailybeast.com/hannity-mocks-the-view-co-host-sunny-hostin-by-saying-his-dad-hit-him-with-a-belt"
  },
  {
    "text": "First to ABC: Steve Laffey leaves the 2024 race, reflects on longshot campaign  —  “You haven't heard the last from me,” Laffey told ABC News.  —  Steve Laffey, the former mayor of Cranston, Rhode Island, who announced his candidacy back in February, is dropping out of the race for the 2024 Republican presidential nomination.",
    "url": "https://abcnews.go.com/Politics/abc-steve-laffey-leaves-2024-race-reflects-longshot/story?id=103736277"
  },
  {
    "text": "Boston University Loaned $600K to a Mysterious Trust Run by Ibram Kendi's Brother-In-Law  —  Kendi's Center for Antiracist Research faces allegations of financial mismanagement  —  In September of 2020, just weeks after Ibram X. Kendi launched the Center for Antiracist Research at Boston University … ",
    "url": "https://freebeacon.com/issues/boston-university-loaned-600k-to-a-mysterious-trust-run-by-ibram-kendis-brother-in-law/"
  },
  {
    "text": "Narges Mohammadi, Jailed Iranian Activist, Is 2023 Laureate  —  The activist, who is serving a 10-year sentence in Tehran, was honored “for her fight against the oppression of women in Iran.”  —  Here's what to know about this year's prize.  —  Narges Mohammadi, an Iranian activist … ",
    "url": "https://www.nytimes.com/live/2023/10/06/world/nobel-peace-prize"
  }
]