[
  {
    "text": "People Close to Biden Say He Appears to Accept He May Have to Leave the Race  —  One person familiar with President Biden's thinking cautioned that he had not yet made up his mind to leave the race, after three weeks of insisting that almost nothing would drive him out.",
    "url": "https://www.nytimes.com/2024/07/18/us/politics/biden-election-drop-out.html"
  },
  {
    "text": "Biden left feeling angry and betrayed by top Democratic leaders wavering on his campaign  —  President Joe Biden is furious at how the party has tried to force him out, as Democrats in Congress increasingly believe the question is when, not if, he will end his campaign.",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-left-feeling-angry-betrayed-top-democratic-leaders-wavering-camp-rcna162635"
  },
  {
    "text": "Once defiant, Biden is now ‘soul searching’ about dropping out of race, source says  —  U.S. President Joe Biden is taking calls to step aside as the Democratic presidential candidate seriously and multiple Democratic officials think an exit is a matter of time, according to sources familiar with the matter.",
    "url": "https://www.reuters.com/world/us/once-defiant-biden-is-now-soul-searching-about-dropping-out-race-source-says-2024-07-18/"
  },
  {
    "text": "Pelosi has told House Democrats that Biden may soon be persuaded to exit race  —  The former House speaker has stepped up her behind-the-scenes role in working to persuade the president to bow out of campaign  —  Former House speaker Nancy Pelosi has told some House Democrats … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/18/nancy-pelosi-biden-close-to-dropping-out/"
  },
  {
    "text": "Why the big boot-Biden House Dem wave isn't here yet  —  With assists from POLITICO's Congress team  —  In the last 24 hours, Chuck Schumer, Nancy Pelosi and, now, Barack Obama, have essentially given political cover to any congressional Democrat who wishes to speak out against Joe Biden.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/07/18/why-the-big-boot-biden-house-dem-wave-isnt-here-yet-00169487"
  },
  {
    "text": "Sen. Jon Tester calls on Biden to drop 2024 presidential bid … - “While I appreciate his commitment to public service and our country, I believe President Biden should not seek re-election to another term,” Tester said in a statement Thursday.  — Tester is facing re-election in deep-red Montana … ",
    "url": "https://www.axios.com/2024/07/19/jon-tester-montana-senate-biden-president-2024"
  },
  {
    "text": "Excruciating!  Trump's Endlessly Long, Wildly Dishonest RNC Speech  —  Donald Trump briefly tried a “new tone” — before pivoting to Hannibal Lecter, “crazy” Pelosi, insurrection lies and more of his greatest hits.  —  LOADING  —  MILWAUKEE — Not four years after Donald Trump's eldest son boasted … ",
    "url": "https://www.huffpost.com/entry/donald-trump-republican-takeover_n_66998a0ae4b047588a4b2aac"
  },
  {
    "text": "Donald Trump Can (and Must) Be Defeated  —  His bizarre, boring convention speech is a reminder that Trump is a terrible candidate  —  Unlike my party, there was no question who would be the Republican nominee.  It's not a surprise, but it's still shocking.",
    "url": "https://www.messageboxnews.com/p/donald-trump-can-and-must-be-defeated"
  },
  {
    "text": "Trump tramples unity theme in two-act convention speech … - Inside the Fiserv Forum, the ebullient mood gave way to rapt silence. … - “I stand before you in this arena only by the grace of Almighty God,” he said, echoing a long list of GOP convention speakers who had cited divine intervention for Trump's survival.",
    "url": "https://www.axios.com/2024/07/19/trump-convention-speech-unity-biden"
  },
  {
    "text": "Fact check: Trump makes more than 20 false claims in RNC acceptance speech  —  Former President Donald Trump accepted the Republican presidential nomination on Thursday with the most dishonest speech of the four-day Republican National Convention, making more than 20 false claims by CNN's count.",
    "url": "https://www.cnn.com/2024/07/18/politics/fact-checking-night-4-republican-national-convention-trump/"
  },
  {
    "text": "Democratic donors begin mobilizing to raise money for Harris if she's the nominee  —  While acknowledging the volatility of the situation, some organizers said donors were already “lining up” to give in case Kamala Harris leads the Democratic ticket.  —  Allies of Vice President Kamala Harris … ",
    "url": "https://www.politico.com/news/2024/07/18/kamala-harris-fundraising-democrats-00169634"
  },
  {
    "text": "Global cyber outage grounds flights, hits banks, telecoms, media  —  A software update wreaked havoc on computer systems globally on Friday, grounding flights, forcing some broadcasters off air and hitting services from banking to healthcare.  —  An update to a product offered … ",
    "url": "https://www.reuters.com/technology/global-cyber-outage-grounds-flights-hits-media-financial-telecoms-2024-07-19/"
  },
  {
    "text": "Hunter Biden seeks dismissal of tax, gun cases, citing decision to toss Trump's classified docs case  —  President Joe Biden's son, Hunter, asked federal judges on Thursday to dismiss tax and gun cases against him, citing a ruling in Florida this week that threw out a separate prosecution of former President Donald Trump.",
    "url": "https://apnews.com/article/hunter-biden-taxes-guns-justice-department-cannon-c403a3ed8e8f2b2f45ebcbd78d113aa3"
  },
  {
    "text": "What Secret Service and FBI told Congress about attempted Trump assassination … - FBI and Secret Service officials briefed House lawmakers on Wednesday on their preliminary findings.  — The Secret Service said they identified the building used in the assassination attempt as … ",
    "url": "https://www.axios.com/2024/07/18/secret-service-fbi-trump-assassination-attempt"
  },
  {
    "text": "J.D. Vance Left His Venmo Public.  Here's What It Shows  —  The Republican VP nominee's Venmo network reveals connections ranging from the architects of Project 2025 to enemies of Donald Trump—and the populist's close ties to the very elites he rails against.",
    "url": "https://www.wired.com/story/jd-vance-venmo/"
  },
  {
    "text": "‘Treated like a convict’: NFL legend Terrell Davis describes getting handcuffed on a plane near his kids after asking for ice  —  Terrell Davis and his family were looking forward to vacationing in California when pro football Hall of Famer was handcuffed and removed from a United Airlines plane - for no apparent reason.",
    "url": "https://www.cnn.com/2024/07/17/us/terrell-davis-united-flight-attendant/"
  },
  {
    "text": "Elon Musk's X pushes Trump tags on all US users  —  The platform prevents users from blocking or muting the tags, which inorganically appear atop the trending page  —  X, the social media platform owned by Trump megadonor Elon Musk, is promoting Trump campaign-curated content to all U.S. users … ",
    "url": "https://www.salon.com/2024/07/18/elon-musks-x-pushes-tags-on-all-us-users/"
  },
  {
    "text": "Rudy Giuliani can't even fall out of bankruptcy right  —  His tumble at the RNC was bad.  His legal problems are even worse. … If Rudy Giuliani simply would've walked into the sunset after his 2008 presidential bid, he'd probably have airports named after him by now.",
    "url": "https://www.publicnotice.co/p/rudy-giuliani-bankruptcy-rnc-2024-moss-freeman"
  },
  {
    "text": "Republicans Say They Want to Tone Down Political Rhetoric — But They Keep Calling Immigration an ‘Invasion’  —  “We have to be nice until they begin the deportations,” said former Democratic Rep. Luis Gutierrez.  — Copy  —  Republicans have said Democrats must stop demonizing Donald Trump … ",
    "url": "https://www.notus.org/immigration/republican-national-convention-immigration-rhetoric"
  }
]