[
  {
    "text": "Trump will ‘most likely’ pardon Capitol rioters on Day 1 and says Jan. 6 committee members should be jailed  —  The president-elect also said during an exclusive interview with “Meet the Press” that he won't request a special prosecutor to investigate outgoing President Joe Biden.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-will-likely-pardon-capitol-rioters-day-1-says-jan-6-committee-me-rcna183275"
  },
  {
    "text": "Trump details sweeping changes he'll carry out on day one and beyond in an exclusive interview  —  Trump vowed to launch a mass deportation effort, impose tariffs and pardon many convicted in the Jan. 6 attack in an interview with “Meet the Press” moderator Kristen Welker.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-details-sweeping-changes-ll-carry-day-one-exclusive-interview-rcna182858"
  },
  {
    "text": "Trump aims to end birthright citizenship, says American citizens with family here illegally may be deported  —  President-elect Donald Trump, in an exclusive interview with “Meet the Press,” also said he is open to working with Democrats on a legislative way to keep Dreamers in the United States.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-aims-end-birthright-citizenship-says-american-citizens-family-il-rcna183274"
  },
  {
    "text": "Trump's Biggest Lies From His ‘Meet the Press’ Interview  —  From immigrants to Obamacare, the president-elect continued his campaign trail falsehoods  —  Donald Trump gave his first network interview since the election and spread falsehoods about immigrants, the Affordable Care Act and — of course — the 2020 election.",
    "url": "https://www.rollingstone.com/politics/politics-news/trumps-lies-meet-the-press-2024-1235196576/"
  },
  {
    "text": "Trump Transition Live Updates: Trump Gives First Televised Interview Since Election  —  Where Things Stand  — President-elect Donald J. Trump insisted in an interview with NBC's “Meet the Press” to air on Sunday that he would not direct his administration to seek retribution … ",
    "url": "https://www.nytimes.com/live/2024/12/08/us/trump-interview-news"
  },
  {
    "text": "The Syrian Regime Collapsed Gradually—And Then Suddenly  —  Assad's fall offers the possibility of change.  —  As Hemingway once wrote of bankruptcy, the collapse of autocratic regimes tends to happen gradually and then suddenly—slowly, and then all at once.  This is not just a literary metaphor.",
    "url": "https://www.theatlantic.com/international/archive/2024/12/sudden-collapse-bashar-assad/680917/?gift=hVZeG3M9DnxL4CekrWGK39JslY0QVDPx4BZRvytxmgI&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Syrian rebels announce fall of Russia-backed Assad regime  —  Syrian rebels announced on Dec. 8 that they had ousted President Bashar al-Assad from the capital city of Damascus.  —  “The tyrant Bashar al-Assad has fled.  We declare the city of Damascus free from the tyrant Bashar al-Assad,” rebel leaders said in a statement.",
    "url": "https://kyivindependent.com/breaking-syrian-rebels-announce-fall-of-assad-regime/"
  },
  {
    "text": "Russia says Syria's Assad has left country and gave orders for peaceful power handover  —  Russia said on Sunday that Syrian President Bashar al-Assad had left office and departed his country after giving orders for a peaceful transfer of power, but did not say where he was now or whether the Russian military planned to stay in Syria.",
    "url": "https://www.reuters.com/world/russia-says-syrias-assad-has-left-country-given-orders-peaceful-power-handover-2024-12-08/"
  },
  {
    "text": "Jubilation and gunfire as Syrians celebrate the end of the Assad family's half-century rule  —  Syrians poured into streets echoing with celebratory gunfire on Sunday after a stunning rebel advance reached the capital, ending the Assad family's 50 years of iron rule but raising questions … ",
    "url": "https://apnews.com/article/syria-assad-sweida-daraa-homs-hts-qatar-816e538565d1ae47e016b5765b044d31"
  },
  {
    "text": "Khamenei Loses Everything  —  The October 7 attack on Israel has now cost Iran its regional proxy forces.  —  When Hamas's Yahya Sinwar launched Operation Al-Aqsa Flood against Israel on October 7, 2023, he intended to deal a decisive blow against a powerful nation-state—and he succeeded.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/12/khamenei-iran-syria/680920/?gift=5Jt_OsUNCrDLh-WaaPKh0XxkVqXiByOZektEmQ-ztgE"
  },
  {
    "text": "Biden Says U.S. Conducted Airstrikes Against Islamic State Targets in Syria  —  President Biden hailed the fall of President Bashar al-Assad as a “fundamental act of justice” but warned of “a moment of risk and uncertainty.”  —  President Biden announced on Sunday that U.S. military forces … ",
    "url": "https://www.nytimes.com/2024/12/08/us/politics/biden-syria-assad-isis.html"
  },
  {
    "text": "Trump 'can't guarantee' Americans won't pay more if tariffs enacted  —  “I can't guarantee anything.  I can't guarantee tomorrow,” the president-elect said.  —  President-elect Donald Trump said he “can't guarantee anything” when asked whether his proposed tariffs would increase prices … ",
    "url": "https://www.politico.com/news/2024/12/08/trump-defends-tariff-proposal-00193182"
  },
  {
    "text": "Did Trump Drain Democrats' Energy?  These Races Will Be the First Test.  —  As Democrats try to fire up their fatigued base, two contests for the Virginia legislature will serve as the first measure of partisan enthusiasm since Donald J. Trump's victory.  —  Even as the exhausted nation recovers … ",
    "url": "https://www.nytimes.com/2024/12/08/us/politics/virginia-special-elections.html?unlocked_article_code=1.f04.0xhq.E1-trGTVZzJy&smid=url-share"
  },
  {
    "text": "Trump's FBI pick co-hosted a show for a conspiracy-filled, far-right media organization  —  The show could receive fresh scrutiny as Kash Patel faces Senate confirmation hearings.  —  Rampant FBI misconduct, election fraud, the deep state.  Such were the weekly topics on “Kash's Corner,” … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trumps-fbi-pick-co-hosted-show-conspiracy-filled-far-right-media-organ-rcna182823"
  },
  {
    "text": "Trump is stacking his White House roster with uber-rich backers … Donald Trump's first administration was chock full of super-rich figures whose combined wealth exceeded $5 billion, marking an unprecedented marriage of money and executive power.  —  Trump's second term could make that total look like chump change.",
    "url": "https://www.cnbc.com/2024/12/08/trump-billionaires-white-house-cabinet.html"
  }
]