[
  {
    "text": "Newsom picks Laphonza Butler as Feinstein replacement  —  California's governor chose a labor leader turned power player to serve in the Senate, and an adviser told POLITICO there were no preconditions about whether she could run in 2024.  —  California Gov. Gavin Newsom … ",
    "url": "https://www.politico.com/news/2023/10/01/newsom-senate-pick-butler-00119360"
  },
  {
    "text": "Playbook: A new senator, and a new showdown  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  MADAME SENATOR — EMILY's List President LAPHONZA BUTLER will be named California's junior senator later today by Gov. GAVIN NEWSOM, Chris Cadelago scooped last night.",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/02/a-new-senator-and-a-new-showdown-00119426"
  },
  {
    "text": "Trump arrives at New York court for $250 million fraud trial  — The $250 million civil fraud trial that could see Donald Trump permanently banned from doing business in New York is set to begin.  — Trump arrived at Manhattan Supreme Court to attend the trial.",
    "url": "https://www.cnbc.com/2023/10/02/trump-fraud-trial-to-kick-off-in-new-york-court.html"
  },
  {
    "text": "Trump says New York fraud case is a ‘scam’: Latest updates  —  Donald Trump denounces New York fraud case as ‘scam’  —  New York Attorney General Letitia James: President Trump engaged in ‘persistent and repeated fraud’  —  The fraud lawsuit that could cost former President Donald Trump control … ",
    "url": "https://apnews.com/article/trump-letitia-james-fraud-lawsuit-new-york-eb98c99fe918da139b0d8b6347211afe"
  },
  {
    "text": "Supreme Court declines to consider longshot bid to disqualify Trump from running for president  —  The Supreme Court said Monday that it will not take up a longshot challenge to Donald Trump's eligibility to run for president because of his alleged role in the January 6, 2021, attack on the US Capitol.",
    "url": "https://www.cnn.com/2023/10/02/politics/donald-trump-fourteenth-amendment-ballot-case-supreme-court/"
  },
  {
    "text": "Biden Plans Call With Allies to Reassure Support for Ukraine  — Call between allies could take place as early as tomorrow  — US Congress omitted $6 billion in aid from spending bill  —  President Joe Biden is planning to call allies to reassure them that US support for Ukraine will continue … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-02/biden-plans-call-with-allies-to-reassure-support-for-ukraine"
  },
  {
    "text": "Supreme Court denies Eastman petition, with rare recusal from Thomas  —  The Supreme Court on Monday denied an effort by lawyer John Eastman to appeal a ruling that found he may have acted criminally with the legal advice he gave former President Trump.  It spurred a rare recusal … ",
    "url": "https://thehill.com/regulation/court-battles/4233719-supreme-court-denies-eastman-petition-with-rare-recusal-from-thomas/"
  },
  {
    "text": "Matt Gaetz: 'Biden's Favorite Republican'  —  A vote to oust Speaker McCarthy would empower Democrats.  —  Kevin McCarthy chose the only option he had on Saturday to avoid a pointless government shutdown by seeking a bipartisan vote.  He succeeded, but now the GOP Jacobins who blocked … ",
    "url": "https://www.wsj.com/articles/matt-gaetz-bidens-favorite-republican-politics-government-shutdown-cb084a55?mod=followamazon"
  },
  {
    "text": "Play it again, Sam  —  Inside Bankman-Fried's last year in the crypto game  —  Most of the people who went to work for Sam Bankman-Fried ended up in jobs for which they were not obviously qualified, and Natalie Tien was no exception.  She'd been raised in Taiwan by middle-class parents whose … ",
    "url": "https://www.washingtonpost.com/opinions/interactive/2023/michael-lewis-sam-bankman-fried-ftx-crypto/"
  },
  {
    "text": "Meet Joe Biden's Newest Campaign Surrogates: The Republicans Who Hate Him  —  A Biden campaign strategy has turned Marjorie Taylor Greene, Ron DeSantis, and Nikki Haley into effective messengers for his reelection campaign  —  A Facebook icon representing an external link to share the article … ",
    "url": "https://themessenger.com/politics/biden-marjorie-taylor-greene-desantis-nikki-haley-campaign-ads"
  },
  {
    "text": "First on CNN: Fulton County DA subpoenas Trump ally Kerik to testify, and he wants immunity  —  The Fulton County district attorney's office has issued a subpoena to former New York Police Commissioner Bernie Kerik to testify in the first trial later this month in the case stemming … ",
    "url": "https://www.cnn.com/2023/10/02/politics/bernie-kerik-fulton-county/"
  },
  {
    "text": "North Carolina Republicans create “secret police force”  —  North Carolina's new $300 billion state budget contains a provision that gives extraordinary investigative powers to a partisan oversight committee co-chaired by Senate Leader Phil Berger (R) and House Speaker Tim Moore (R).",
    "url": "https://popular.info/p/north-carolina-republicans-create"
  },
  {
    "text": "Little Enthusiasm for 2024 Front-Runners  —  Voters much more likely to see Biden as too old than Trump  —  West Long Branch, NJ - There is not a lot of enthusiasm for either President Joe Biden or former President Donald Trump becoming the major party nominees in 2024.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_100223/"
  },
  {
    "text": "Putin's Next Target: U.S. Support for Ukraine, Officials Say  —  Russian spy agencies and new technologies could be used to push conspiracy theories, U.S. officials say.  —  Russia's strategy to win the war in Ukraine is to outlast the West.  —  But how does Vladimir Putin plan to do that?",
    "url": "https://www.nytimes.com/2023/10/02/us/politics/putin-ukraine-spy-united-states.html"
  },
  {
    "text": "Four SCOTUS cases to watch this term  —  The 2023-24 term starts today.  Let's break down some cases worth tracking. … The 2023-24 Supreme Court term starts today and we're staring down the barrel of nine months of decisions from a hyper-conservative majority.",
    "url": "https://www.publicnotice.co/p/scotus-2023-24-term-preview-cases-to-watch"
  },
  {
    "text": "Watching Fox News with Gavin Newsom  —  The Scoop  —  Gov. Gavin Newsom says Fox News is “quite literally bullshit and misinformation,” and a “24/7 doom loop” that traffics in fear and anger.  —  Also, he can't stop watching.  And he suggests other Democrats do too.",
    "url": "https://www.semafor.com/article/10/01/2023/watching-fox-news-with-gavin-newsom"
  }
]