[
  {
    "text": "White House pauses all federal grants, sparking confusion  —  Trillions of dollars could be on hold, according to an Office of Management and Budget memo.  —  The White House budget office is ordering a pause to all grants and loans disbursed by the federal government … ",
    "url": "https://www.washingtonpost.com/business/2025/01/27/white-house-pauses-federal-grants/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3OTU0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MzM2Mzk5LCJpYXQiOjE3Mzc5NTQwMDAsImp0aSI6ImZlYzlhZTI3LTQ5ODUtNGNiYi04ZWEyLWNjNWE3YWE5NDE4MiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzI3L3doaXRlLWhvdXNlLXBhdXNlcy1mZWRlcmFsLWdyYW50cy8ifQ.OH6OKaNolVYueeEJz2SzVWQBrgB372ZHhXvCMTAU0zU"
  },
  {
    "text": "Trump administration orders sweeping freeze of federal aid  —  In a two-page memo, the Office of Management and Budget ordered all federal agencies to temporarily suspend payments.  —  One week in, the Trump administration is broadening its assault on the functions of government … ",
    "url": "https://www.politico.com/news/2025/01/27/trump-freezes-federal-aid-omb-00200891"
  },
  {
    "text": "Trump administration fires DOJ officials who worked on criminal investigations of the president  —  The DOJ employees had been involved in special counsel Jack Smith's investigation that led to Trump's classified documents and Jan. 6 cases.  —  WASHINGTON — The Department of Justice … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-administration-fires-doj-officials-worked-criminal-investigation-rcna189512"
  },
  {
    "text": "Trump-Appointed Prosecutor Opens Review of Justice Department's Jan. 6 Cases  —  Lawyers who worked on the matters are asked to turn over files, notes and other records  —  WASHINGTON—A top Trump-appointed prosecutor has opened an internal review of the Justice Department's decision … ",
    "url": "https://www.wsj.com/us-news/law/trump-appointed-prosecutor-opens-review-of-justice-departments-jan-6-cases-72cd371c?st=7w92vg&reflink=article_copyURL_share"
  },
  {
    "text": "Trump Justice Department fires officials who investigated Trump and launches ‘special project’ into January 6 cases  —  More than a dozen officials who worked on the criminal investigations into Donald Trump have been fired, according to sources familiar with the matter.",
    "url": "https://www.cnn.com/2025/01/27/politics/trump-special-project-january-6-prosecutors"
  },
  {
    "text": "Justice Department fires more than a dozen key officials on former Special Counsel Jack Smith's team  —  Acting Attorney General James McHenry 'does not trust these officials to assist in faithfully implementing the President's agenda'  —  EXCLUSIVE: The Justice Department is firing … ",
    "url": "https://www.foxnews.com/politics/justice-department-fires-more-than-dozen-key-officials-former-special-counsel-jack-smiths-team?intcmp=tw_fnc"
  },
  {
    "text": "Top USAID career staff placed on immediate leave  —  “This is like taking out all the generals,” said a former Trump administration official informed of the decision.  —  The Trump administration has ordered dozens of top career employees of the U.S. Agency for International Development … ",
    "url": "https://www.politico.com/news/2025/01/27/top-usaid-career-staff-ordered-leave-00200854"
  },
  {
    "text": "Trump Administration Halts H.I.V. Drug Distribution in Poor Countries  —  PEPFAR's computer systems also are being taken offline, a sign that the program may not return, as Republican critics had hoped.  —  The Trump administration has instructed organizations in other countries … ",
    "url": "https://www.nytimes.com/2025/01/27/health/pepfar-trump-freeze.html?unlocked_article_code=1.sU4.nnB5.iT69u4FuwlEZ&smid=url-share"
  },
  {
    "text": "Acosta La Vista  —  The anchor signaled to associates in private conversations over the weekend that he intends to depart the network, Status has learned. … The anchor, I'm told, signaled to associates in private conversations over the weekend that he intends to depart the network … ",
    "url": "https://www.status.news/p/jim-acosta-leaving-cnn"
  },
  {
    "text": "Man Pardoned in Jan. 6 Riot Is Fatally Shot by Sheriff's Deputy During Traffic Stop  —  The police said that Matthew W. Huttle, 42, of Hobart, Ind., who was sentenced to six months for his role in the riot at the U.S. Capitol in 2021, resisted arrest after he was stopped in Indiana on Sunday.",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/jan-6-rioter-shot-indiana-traffic-stop.html"
  },
  {
    "text": "Trump's Victory Over Colombia Now Looks Less Clear Cut  — Colombia sends own planes to bring people home after showdown  — Trump runs the risk of overuse of tariff, sanctions threats  —  A deportation arrangement with Colombia that the White House on Sunday night presented … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-27/trump-s-victory-over-colombia-less-clear-as-more-details-emerge"
  },
  {
    "text": "Google says it will change Gulf of Mexico to ‘Gulf of America’ in Maps after government updates … Google said Monday it will change the name of Gulf of Mexico to “Gulf of America” after the government updates its “official government sources.”  —  The company also said it will start using Mount McKinley … ",
    "url": "https://www.cnbc.com/2025/01/27/google-maps-to-show-gulf-of-america-after-government-updates.html"
  },
  {
    "text": "CDC ordered to stop working with WHO immediately, upending expectations of an extended withdrawal  —  U.S. public health officials have been told to stop working with the World Health Organization, effective immediately.  A U.S. Centers for Disease Control and Prevention official … ",
    "url": "https://apnews.com/article/cdc-who-trump-548cf18b1c409c7d22e17311ccdfe1f6"
  },
  {
    "text": "Tillis Assured Hegseth's Former Sister-in-Law Her Testimony Could Convince GOP Senators to Vote No  —  North Carolina senator provided pivotal 50th ‘yes’ vote to confirm Hegseth as defense secretary  —  WASHINGTON—A key witness in the contentious Senate confirmation of Defense Secretary Pete Hegseth … ",
    "url": "https://www.wsj.com/politics/policy/pete-hegseth-affidavit-thom-tillis-08af5bce?st=CDkJjM&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Chief Corruption Prosecutor Resigns From Justice Dept.  —  Corey Amundson chose to leave the department after being told he was being reassigned by the Trump administration to a position related to immigration enforcement.  —  The head of the Justice Department's public integrity section … ",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/chief-corruption-prosecutor.html"
  },
  {
    "text": "Scott Bessent easily wins Senate confirmation to lead Treasury … - Bessent, 62, founded hedge fund Key Square Capital Management. … - During his confirmation hearing, Bessent warned of economic disaster if Trump's 2017 tax cuts aren't extended, calling the effort\"the single most important economic issue of the day.\"",
    "url": "https://www.axios.com/2025/01/27/scott-bessent-senate-confirmation-treasury-secretary"
  },
  {
    "text": "Banking regulator rescinds more than 200 job offers for examiners it needs  —  A federal hiring freeze has made the Federal Deposit Insurance Corp. even more short-handed.  —  A government-wide hiring freeze has led the Federal Deposit Insurance Corp. to yank job offers to more than 200 new examiners … ",
    "url": "https://www.washingtonpost.com/business/2025/01/27/fdic-bank-examiners-job-offers-rescinded/"
  },
  {
    "text": "Trump Paralyzes Independent Rights Watchdog, Firing Members Selected by Democrats  —  The move removed three of the four sitting members of the Privacy and Civil Liberties Oversight Board, leaving it unable to act as the Trump administration begins reshaping intelligence agencies.",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/trump-fires-independent-watchdog-officials.html"
  },
  {
    "text": "Inside a network of AI-generated newsletters targeting “small town America”  —  Good Daily, which operates in 47 states and 355 towns and cities across the U.S., is run by one person.  —  On first glance, Good Day Fort Collins appears to be a standard local news round-up.",
    "url": "https://www.niemanlab.org/2025/01/inside-a-network-of-ai-generated-newsletters-targeting-small-town-america/"
  },
  {
    "text": "Gabbard's path through Intelligence Committee narrows ahead of key hearing  —  Republicans are cautioning that Tulsi Gabbard's path to confirmation to lead the U.S. intelligence apparatus is narrowing as she seemingly has trouble winning over key GOP senators.",
    "url": "https://thehill.com/homenews/5106082-tulsi-gabbard-intelligence-committee-hearing/"
  },
  {
    "text": "Direct File shows how civic tech can work for good  —  Good evening from Washington, where the news cycles are moving faster than rats on a hot tin roof.  —  Thanks to all of the news subscribers over the weekend and everyone whose become a member since soft launch last year.",
    "url": "https://civic-texts.ghost.io/direct-file-shows-how-civic-tech-can-work-for-good-2/"
  },
  {
    "text": "They Followed North Carolina Election Rules When They Cast Their Ballots.  Now Their Votes Could Be Tossed Anyway.  —  A Republican judge is trying to overturn his election loss by challenging more than 60,000 ballots.  These are some of those voters' stories.",
    "url": "https://www.propublica.org/article/north-carolina-voters-jefferson-griffin-supreme-court-challenge"
  },
  {
    "text": "Murkowski and Chemnitz: Greenland “Ally, not an Asset”  —  Washington, DC - Today, United States Senator Lisa Murkowski (R-Alaska and Co-Chair of the Standing Committee of Parliamentarians of the Arctic Region) and Aaja Chemnitz (Member of Danish Parliament representing Greenland for Inuit Ataqatigiit … ",
    "url": "https://www.murkowski.senate.gov/press/release/murkowski-and-chemnitz-greenland-ally-not-an-asset"
  },
  {
    "text": "Trump Pardoned A Jan. 6 Rioter.  Now He's ‘At Large’ For A Crime.  —  The alleged victim is under 17 years old, prosecutors said.  —  LOADING  —  Andrew Taake's legal troubles might not be over — even though the Texas man was just pardoned by President Donald Trump after being convicted … ",
    "url": "https://www.huffpost.com/entry/trump-pardoned-jan-6-rioter-at-large-for-crime_n_6797c88fe4b04a90c0953b3f"
  },
  {
    "text": "Anchor Dimitri Sotis, whose distinctive warm voice led WTOP's evening news, dies at 55  — WTOP will honor Dimitri Sotis' legacy with a live hourlong radio special at 7 p.m. Monday, Jan. 27, on 103.5 FM and on the WTOP News app.  Listen live here.  —  WTOP evening anchor Dimitri Sotis … ",
    "url": "https://wtop.com/inside-wtop/2025/01/wtop-anchor-dimitri-sotis-dies-at-55-warm-conversational-voice-informed-listeners-since-1999/"
  },
  {
    "text": "Tucker Carlson's son Buckley is joining JD Vance's staff  —  Vance has brought over several of his Senate staff to serve in his VP office.  —  Vice President JD Vance walks from Air Force Two as he arrives at Tri-Cities Airport, Jan. 27, 2025, in Blountville, Tenn.",
    "url": "https://abcnews.go.com/US/tucker-carlsons-son-buckley-joining-jd-vances-staff/story?id=118150708"
  },
  {
    "text": "Quaker groups file suit over end of policy restricting ICE arrests in houses of worship  —  The suit appears to be the first from a faith-based organization challenging the change in court.  —  A group of Quaker congregations are suing the Department of Homeland Security for changing a policy … ",
    "url": "https://www.nbcnews.com/politics/national-security/quaker-groups-file-suit-end-policy-restricting-ice-arrests-houses-wors-rcna189471"
  }
]