[
  {
    "text": "Trump Has a Master Plan for Destroying the ‘Deep State’  —  I study government bureaucracies.  This is not normally a key political issue.  Right now, it is, and everyone should be paying attention.  —  Donald Trump, the former president and current candidate, puts it in apocalyptic terms … ",
    "url": "https://www.nytimes.com/2023/11/27/opinion/trump-deep-state-schedule-f.html"
  },
  {
    "text": "Judge denies Trump's ‘fishing expedition’ to subpoena Jan. 6 committee records  —  In one of the cases brought by Jack Smith, Trump's team had wanted to get its hands on what it described as “missing” records from the Jan. 6 committee.  —  WASHINGTON — A federal judge overseeing President … ",
    "url": "https://www.nbcnews.com/politics/justice-department/judge-denies-trumps-fishing-expedition-subpoena-jan-6-committee-record-rcna126894"
  },
  {
    "text": "With Trump moving closer to renomination, rewriting Jan. 6 attack gains urgency  —  There is no mystery about the Capitol riot.  There is nothing intangible, no unseen engine for what occurred.  There is no uncertainty about what happened and why.  —  But because everything about what unfolded … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/27/jan6-donald-trump-truth-lies/"
  },
  {
    "text": "Man pleads not guilty in shooting of 3 Palestinian American students in Vermont  —  The man accused of shooting three Palestinian American students in Vermont pleaded not guilty to charges at an arraignment hearing Monday.  —  Jason Eaton, 48, appeared in court virtually … ",
    "url": "https://thehill.com/homenews/state-watch/4328958-vermont-shooting-palestinian-american-students-man-charged/"
  },
  {
    "text": "Expelling George Santos: Democrats May Force GOP's Hand  —  Democrats may make the first move if Santos doesn't resign, or if GOP leaders don't act  —  As GOP leaders agonize over how to handle disgraced Rep. George Santos, R-N.Y., whose expulsion from Congress seemed inevitable last week, Democrats have a plan to force action.",
    "url": "https://themessenger.com/politics/expelling-george-santos-democrats-may-force-gops-hand"
  },
  {
    "text": "Word of the Year 2023  —  ‘Authentic,’ plus ‘rizz,’ ‘deepfake,’ ‘coronation,’ and other words that defined the year  —  Merriam-Webster's Word of the Year for 2023 is authentic—the term for something we're thinking about, writing about, aspiring to, and judging more than ever.",
    "url": "https://www.merriam-webster.com/wordplay/word-of-the-year"
  },
  {
    "text": "Sports Illustrated Published Articles by Fake, AI-Generated Writers  —  There was nothing in Drew Ortiz's author biography at Sports Illustrated to suggest that he was anything other than human.  —  “Drew has spent much of his life outdoors, and is excited to guide you through his never-ending list … ",
    "url": "https://futurism.com/sports-illustrated-ai-generated-writers"
  },
  {
    "text": "Donations to GOP drop as worries mount about the party's finances  —  Donors have not cut as many large checks to the RNC in recent years, and the party's small-dollar program has also suffered  —  The Republican Party's finances are increasingly worrisome to party members … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/27/republican-party-finances-election/"
  },
  {
    "text": "Matt Gaetz is 2023's ‘Politician of the Year’  —  Two numbers define the last year in politics.  The first is 15, for the 15 votes it took in January to confirm a Republican Speaker of the House.  The second is three, for when the House shut down in October for three weeks … ",
    "url": "https://thehill.com/opinion/campaign/4326000-matt-gaetz-is-the-2023-politician-of-the-year/"
  },
  {
    "text": "Trump Rallies Aren't Even Really About Politics at This Point  —  Ron DeSantis and Nikki Haley have partisans.  Donald Trump has fans.  —  For all of Donald Trump's rhetorical innovations, personality quirks, and alleged criminal malfeasance, what has made him truly unique as a political figure … ",
    "url": "https://slate.com/news-and-politics/2023/11/trump-rallies-2024-presidential-campaign-biden-desantis-haley.html"
  },
  {
    "text": "Netanyahu Welcomes Elon Musk to Israel After Antisemitic Post  —  The editor of the Israeli newspaper Haaretz bashed the prime minister for giving the “blatant antisemite” X owner a “PR visit”  —  DAYS AFTER ENDORSING an antisemitic conspiracy theory on X, Elon Musk flew to Israel to meet … ",
    "url": "https://www.rollingstone.com/politics/politics-news/netanyahu-elon-musk-israel-kibbtz-tour-antisemitic-post-1234898183/"
  },
  {
    "text": "‘This guy is a charlatan’: University of Florida turns against Joe Ladapo  —  Colleagues say the state surgeon general rarely is on campus and has “sullied” the reputation of the flagship school.  —  TALLAHASSEE, Fla. — Professors at the University of Florida had high hopes for Joseph Ladapo.",
    "url": "https://www.politico.com/news/2023/11/27/joe-ladapo-university-of-florida-00128541"
  },
  {
    "text": "In Countdown to Iowa, Trump Is Coasting, as DeSantis and Haley Clash  —  The former president's chief rivals are running low on time to make a statement in Iowa's caucuses, which could determine whether the Republicans' nominating contest is seriously contested at all.  —  Negative mailers are overstuffing Iowa mailboxes.",
    "url": "https://www.nytimes.com/2023/11/27/us/politics/trump-desantis-haley-iowa.html"
  },
  {
    "text": "Just How Bad Is the US Cost-of-Living Squeeze?  We Did the Math  —  After years of inflation, US consumers are shouldering a burden unlike anything seen in decades — even as the pace of price increases has slowed.  —  It now requires $119.27 to buy the same goods and services a family could afford with $100 before the pandemic.",
    "url": "https://www.bloomberg.com/graphics/2023-inflation-economy-cost-of-living/"
  },
  {
    "text": "We Spied on Trump's ‘Southern White House’ From Our Couches  —  Tracking people in-and-out of Mar-a-Lago was easy, thanks to commercial software.  Think your privacy is any better protected?  —  SPYING ON PRESIDENTS used to be a tough business.  One of the great unsung heroes of American history … ",
    "url": "https://www.rollingstone.com/culture/culture-features/data-brokers-trump-tech-spying-privacy-threat-1234897098/"
  },
  {
    "text": "How Christie dropping out could help Haley  —  Yes, polls suggest his supporters would largely move to her.  But it's probably helpful only in one state, and it's not nearly enough.  —  A battery of recent New Hampshire polls has shown Nikki Haley and Chris Christie running second and third … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/27/how-christie-dropping-out-could-help-haley/"
  },
  {
    "text": "Why Biden's Weakness Among Young Voters Should Be Taken Seriously  —  Almost all the polling shows the same pattern.  Could the coming campaign restore Democrats' usual advantage?  —  Could President Biden and Donald J. Trump really be locked in a close race among young voters … ",
    "url": "https://www.nytimes.com/2023/11/27/upshot/poll-biden-young-voters.html"
  },
  {
    "text": "Biden campaign jumps into ObamaCare fight  —  The Big Story  —  President Biden's reelection campaign is enthusiastically jumping into a fight with former President Trump over the Affordable Care Act, also known as ObamaCare.  —  © Greg Nash, The Hill",
    "url": "https://thehill.com/newsletters/health-care/4329922-obamacare-fight-biden-trump/"
  },
  {
    "text": "We the People...Demand More Amendments!  —  A modest proposal to add six new codicils to the US Constitution.  —  If, like me, you're a child of the '70s (or maybe someone who gets high and watches cartoons), you might recall when you first learned of the US Constitution: Schoolhouse Rock!, the animated Saturday morning show.",
    "url": "https://www.vanityfair.com/news/2023/11/monica-lewinsky-more-amendments"
  }
]