[
  {
    "text": "Voters describe their 2024 choice between a Trump second term and a Biden second term as a choice between REVENGE or NOTHING in Daily Mail poll  — JL Partners asked 1000 voters for a word to sum up Biden and Trump's plans  — The results suggest the nation has a bleak view of the 2024 candidates",
    "url": "https://www.dailymail.co.uk/news/article-12890411/Voters-2024-choice-Trump-second-term-Biden-second-term-choice-REVENGE-Daily-Mail-poll.html"
  },
  {
    "text": "A Trump Conviction Could Cost Him Enough Voters to Tip the Election  —  Recent general-election polling has generally shown Donald Trump maintaining a slight lead over President Biden.  Yet many of those polls also reveal an Achilles' heel for Mr. Trump that has the potential to change the shape of the race.",
    "url": "https://www.nytimes.com/2023/12/26/opinion/trump-polling-conviction.html"
  },
  {
    "text": "Israeli military says Gaza ground offensive has expanded into urban refugee camps  —  Gaza's more than 54,500 wounded include a growing number of amputees.  Health officials say overwhelmed hospitals at times had to amputate limbs, which in normal times could have been saved.",
    "url": "https://apnews.com/article/israel-hamas-war-news-12-26-2023-698c895797ccb057d13fe4f68690c98b"
  },
  {
    "text": "Vivek Ramaswamy's campaign stops all TV ad spending less than a month before Iowa and New Hampshire  —  A spokesperson for the GOP candidate's presidential campaign said it has “the ability to be nimble and hyper targeted” in ad spending going forward.  —  Vivek Ramaswamy's presidential campaign … ",
    "url": "https://www.nbcnews.com/politics/2024-election/vivek-ramaswamys-campaign-stops-tv-ad-spending-less-month-iowa-new-ham-rcna131240"
  },
  {
    "text": "1st Amendment claim struck down in Project Veritas case focused on diary of Biden's daughter  —  Criminal prosecutors may soon get to see over 900 documents pertaining to the alleged theft of a diary belonging to President Joe Biden's daughter after a judge rejected the conservative group Project Veritas' First Amendment claim.",
    "url": "https://apnews.com/article/project-veritas-okeefe-first-amendment-biden-2eebae06ea33abdf1bb130e93e486755"
  },
  {
    "text": "An avalanche of money is coming to kick Lauren Boebert out of Congress  — Lauren Boebert was nearly unseated in 2022 by Adam Frisch, a Democrat who's running again in 2024.  — He's raised more money than all but two members of Congress and the most of any nonincumbent.",
    "url": "https://www.businessinsider.com/lauren-boebert-fundraising-adam-frisch-congress-2023-12"
  },
  {
    "text": "Appeals court wipes conviction for ex-congressman  —  A federal appeals court panel wiped ex-Rep. Jeff Fortenberry's (R-Neb.) conviction of lying to the FBI about an illegal campaign contribution, ruling Tuesday that he was not tried in the proper venue.  —  Last year, a jury sitting … ",
    "url": "https://thehill.com/regulation/court-battles/4377688-appeals-court-wipes-conviction-ex-congressman/"
  },
  {
    "text": "The DEI Rollback of 2023  —  States start to limit programs that sow racial and political division.  —  The diversity, equity and inclusion (DEI) bureaucracy on campus has proliferated in recent years, but there are signs it's finally meeting resistance.  The latest good news is from Wisconsin … ",
    "url": "https://www.wsj.com/articles/dei-wisconsin-oklahoma-state-universities-88ecc684?mod=followamazon"
  },
  {
    "text": "Ohio grand jury to decide whether to charge woman who miscarried for ‘abuse of a corpse’  —  Brittany Watts's water broke prematurely and she miscarried at home; when she went to the hospital a nurse called the police  —  A grand jury is set to decide whether an Ohio woman who miscarried … ",
    "url": "https://www.theguardian.com/us-news/2023/dec/26/ohio-jury-woman-miscarriage-abuse-corpse"
  },
  {
    "text": "After Nashville School Shooting, Parents Push for Gun Control Action  —  A group of parents reeling from a mass shooting at their children's private Christian school believed no one was in a better position to persuade the G.O.P. to enact limited gun control.  —  Mary Joyce told herself she would be kind, just as she always had been.",
    "url": "https://www.nytimes.com/2023/12/26/us/politics/nashville-school-shooting-covenant-parents.html"
  },
  {
    "text": "Will Trump provoke a crisis of legitimacy for the US supreme court?  —  The court can only rescue Trump from the Colorado ruling by shredding originalism and textualism.  Will it?  —  Donald Trump's packing of the supreme court, to which he appointed three members, to create … ",
    "url": "https://www.theguardian.com/commentisfree/2023/dec/26/trump-us-supreme-court-crisis"
  },
  {
    "text": "Colorado Gov. Jared Polis faces backlash for cringy ‘Feliz Navidad’ rendition as migrant crisis surges  —  Colorado Governor Jared Polis is drawing harsh criticism for his “Feliz Navidad” holiday message as the state struggles for resources while battling a significant immigration crisis … ",
    "url": "https://nypost.com/2023/12/26/news/colorado-gov-jared-polis-ripped-for-cringy-feliz-navidad-rendition-as-migrant-crisis-surges-in-denver/"
  },
  {
    "text": "Rapper Ye, the former Kanye West, apologizes in Hebrew for anti-Jewish remarks  —  The rapper Ye, formerly known as Kanye West, issued an apology in Hebrew to the Jewish community on Tuesday for his past antisemitic remarks, saying he sought forgiveness and regretted any pain that his words had caused.",
    "url": "https://www.reuters.com/world/us/rapper-kanye-west-apologies-jewish-community-antisemitic-remarks-2023-12-26/"
  },
  {
    "text": "Prosecutors oppose Sen. Bob Menendez's effort to delay May bribery trial until July  —  NEW YORK (AP) — Federal prosecutors on Tuesday urged a judge to reject U.S. Sen. Bob Menendez's request to delay his bribery trial scheduled for next spring by two months, until July.",
    "url": "https://apnews.com/article/bob-menendez-wife-defendants-bribery-indictment-af5d97b5b9c1371cf48eebde10fb33c9"
  },
  {
    "text": "The latest front in the Gaetz vs. McCarthy fight: House primaries  —  Gaetz keeps supporting candidates in primaries where McCarthy has already backed someone else.  —  Republicans are desperate to avoid nasty primaries next year.  But the architect of Kevin McCarthy's ouster from the speakership has other plans.",
    "url": "https://www.politico.com/news/2023/12/26/the-latest-front-in-the-gaetz-vs-mccarthy-fight-house-primaries-00133131"
  },
  {
    "text": "Republican Rep. Marjorie Taylor Greene targeted in swatting attempt on Christmas Day  —  Rep. Marjorie Taylor Greene, R-Ga., was targeted by a swatting attempt at her Georgia home on Christmas Day.  —  The Republican lawmaker shared on X, the platform formerly known as Twitter, on Monday that … ",
    "url": "https://www.usatoday.com/story/news/politics/2023/12/26/marjorie-taylor-green-ga-swatting-christmas/72029352007/"
  },
  {
    "text": "Police increase security for Colorado Supreme Court justices in wake of Donald Trump ruling  —  The court ruled Trump is ineligible for president under the 14th Amendment.  —  A general view of the Colorado Supreme Court in Denver, Colo., Dec. 20, 2023, the day after the court ruled … ",
    "url": "https://abcnews.go.com/Politics/police-increase-security-colorado-supreme-court-justices-wake/story?id=105923471"
  }
]