[
  {
    "text": "Judge rules Donald Trump defrauded banks and insurers while building real estate empire  —  A judge ruled Tuesday that Donald Trump committed fraud for years while building the real estate empire that catapulted him to fame and the White House, and he ordered some of the former president's companies removed … ",
    "url": "https://apnews.com/article/donald-trump-letitia-james-fraud-lawsuit-1569245a9284427117b8d3ba5da74249"
  },
  {
    "text": "Judge Finds Trump Inflated Property Values, a Victory for New York A.G.  —  The decision will simplify the path for Attorney General Letitia James, who has accused former President Donald J. Trump of overvaluing his holdings by as much as $2.2 billion.  —  The New York attorney general won … ",
    "url": "https://www.nytimes.com/2023/09/26/nyregion/trump-james-fraud-trial.html"
  },
  {
    "text": "Ruling Against Trump Cuts to the Heart of His Identity  —  The finding by a judge in a New York civil case that Donald Trump committed fraud in valuing his real estate properties undermined the narrative of the business career that launched him in politics.  —  Nearly every aspect … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-fraud-ruling.html"
  },
  {
    "text": "Trump's threats to Milley fuel fears he'll seek vengeance in second term  —  Former President Trump's violent rhetoric toward Gen. Mark Milley is raising fears he will use a second term in the Oval Office to seek retribution against his enemies.  —  Trump suggested Friday that Milley … ",
    "url": "https://thehill.com/policy/defense/4224405-trumps-threats-to-milley-fuel-fears-hell-seek-vengeance-in-second-term/"
  },
  {
    "text": "The Republican debate is fake  —  With Trump dominating the GOP primary, the debate is a cosplay of a competitive election — and a distraction from an ugly truth.  —  Tonight's Republican primary debate is not a real event.  It is a performance, a show, a pantomime: a shiny object … ",
    "url": "https://www.vox.com/2024-elections/2023/9/27/23890683/second-republican-debate-gop-fake-rnc-trump"
  },
  {
    "text": "McCarthy's new shutdown strategy: Shifting the blame  —  Good morning, Early Birds.  The New York Times's Vanessa Friedman says it's “a cliché” to wear a Patagonia fleece vest in the office if you don't work in outdoor recreation — but it's so cold in The Post's newsroom.  What's a man to do?",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/mccarthys-new-shutdown-strategy-shifting-blame/"
  },
  {
    "text": "Trump Adds Two Attorneys to Criminal Defense Team  —  The former president has been stacking his defense team as he prepares for the trove of legal cases against him and their upcoming trials  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/trump-adds-two-attorneys-to-criminal-defense-team"
  },
  {
    "text": "Trump Wooed UAW Workers with Big Promises in 2016.  Here's What Actually Happened  —  “He, in so many words, has talked a great talk, but he didn't walk any of the walk,” a striking UAW worker said of Trump's 2016 promises to union workers  —  A Facebook icon representing an external link … ",
    "url": "https://themessenger.com/politics/trump-jobs-uaw-union-michigan"
  },
  {
    "text": "UAW Leader Has No Desire at All to Talk to Trump in Michigan  —  Trump's expected appearance Wednesday at a non-union auto plant is a “pathetic irony,” Shawn Fain said on CNN.  —  The United Auto Workers union's president derided GOP presidential candidate Donald Trump as being out of touch … ",
    "url": "https://www.thedailybeast.com/united-auto-workers-unions-president-doesnt-want-to-meet-trump-in-michigan"
  },
  {
    "text": "North Korea says it will expel Travis King, the US soldier who crossed into the country in July  —  North Korea said Wednesday that it will expel a U.S. soldier who crossed into the country through the heavily armed border between the Koreas in July.  The North's official Korean Central News Agency … ",
    "url": "https://apnews.com/article/north-korea-us-soldier-travis-king-00c171778e378d95fe1115fe31612ec2"
  },
  {
    "text": "Target Closes Select Stores to Prioritize Team Member and Guest Safety  —  At Target, we take the decision to close stores very seriously, and only do so after taking meaningful steps to invest in the guest experience and improve business performance.  With that said, we have made the difficult decision … ",
    "url": "https://corporate.target.com/press/releases/2023/09/Target-Closes-Select-Stores-to-Prioritize-Team-Mem"
  },
  {
    "text": "“They've already succeeded”: Will Bunch on the GOP's impeachment clown show  —  They don't have evidence.  But they don't need any for their purposes.  —  ∙ Paid … As House Republicans turn the impeachment process into a joke with their evidence-free Joe Biden fishing expedition … ",
    "url": "https://www.publicnotice.co/p/biden-impeachment-inquiry-explained-will-bunch"
  },
  {
    "text": "Unraveling what's really happening in Florida school libraries  —  On Tuesday, Popular Information reported that librarians in Charlotte County, Florida, were instructed by the school district superintendent to remove all books with LGBTQ characters.  This story was based on a document dated July 24 … ",
    "url": "https://popular.info/p/update-unraveling-whats-really-happening"
  },
  {
    "text": "Comer Reveals Wires from China Have Joe Biden's Wilmington Home as the Beneficiary Address￼  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today announced the House Oversight Committee subpoenaed and obtained two bank wires revealing Hunter … ",
    "url": "https://oversight.house.gov/release/comer-reveals-wires-from-china-have-joe-bidens-wilmington-home-as-the-beneficiary-address%EF%BF%BC/"
  },
  {
    "text": "FCC chair proposes reinstating Obama-era net neutrality rules  —  Federal Communications Commission (FCC) Chairwoman Jessica Rosenworcel said on Tuesday that she plans to put forward a proposal to reinstate net neutrality rules that were repealed under former President Trump.",
    "url": "https://thehill.com/policy/technology/4224200-fcc-chair-proposes-reinstating-obama-era-net-neutrality-rules/"
  },
  {
    "text": "Commander Biden bites another Secret Service agent, the 11th known incident  —  President Joe Biden's younger dog, Commander, bit another US Secret Service agent at the White House Monday evening, CNN has learned, the 11th known biting incident involving the 2-year-old German Shepherd.",
    "url": "https://www.cnn.com/2023/09/26/politics/commander-biden-biting-incident/"
  },
  {
    "text": "The Sick, Racist Message Behind Why Trump Chose That Particular Gun Store  —  During a campaign trip to South Carolina, Donald Trump took some time to visit the gun store that sold weapons to the racist Jacksonville, Florida, mass shooter.  —  Trump visited Palmetto State Armory on Monday … ",
    "url": "https://newrepublic.com/post/175764/trump-gun-store-south-carolina-palmetto-state-armory-racist-message"
  },
  {
    "text": "At least 20 arrested in night of looting throughout Philly, police say  —  Large crowds — mostly consisting of juveniles — looted multiple stores and damaged property across Philadelphia Tuesday night, police said.  —  It was around 8 p.m. when, officials said, police started receiving calls … ",
    "url": "https://www.nbcphiladelphia.com/news/local/large-crowds-of-juveniles-loot-multiple-stores-in-center-city-police-say/3654732/"
  }
]