[
  {
    "text": "Live Updates: Prosecutors Say Trump's Attacks Are Threat to Trial  —  Prosecutors in Donald J. Trump's criminal trial want him held in contempt for attacking witnesses and others close to the case, which centers on a hush-money payment to a porn star.  Testimony is set to resume later Tuesday morning.",
    "url": "https://www.nytimes.com/live/2024/04/23/nyregion/trump-hush-money-trial-news"
  },
  {
    "text": "Trump was going to dominate the courtroom.  Instead, he is shrinking.  —  For months, the news coverage of Donald Trump's legal ordeal eagerly amplified the four-times-indicted former president's narcissistic spin: He would use his trials to his benefit, dominating the 2024 campaign.",
    "url": "https://www.washingtonpost.com/opinions/2024/04/23/trump-losing-courtroom-campaign-bragg-trial/"
  },
  {
    "text": "Secret Service prepares for if Trump is jailed for contempt in hush money case  —  Judge Merchan on Tuesday reserved decision after a contentious hearing.  —  Former President Donald Trump appears in court for his trial at Manhattan Criminal Court on April 23, 2024 in New York City.",
    "url": "https://abcnews.go.com/US/secret-services-prepares-potential-trump-contempt-order-hush/story?id=109542824"
  },
  {
    "text": "FTC Announces Rule Banning Noncompetes  —  FTC's final rule will generate over 8,500 new businesses each year, raise worker wages, lower health care costs, and boost innovation  —  Today, the Federal Trade Commission issued a final rule to promote competition by banning noncompetes nationwide … ",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2024/04/ftc-announces-rule-banning-noncompetes"
  },
  {
    "text": "Federal Trade Commission Approves Ban Of Noncompete Agreements  —  Commissioners approved the historic regulation on the grounds that noncompetes stifle competition for workers.  A legal challenge is all but certain.  —  LOADING  —  The Federal Trade Commission on Tuesday voted 3-2 … ",
    "url": "https://www.huffpost.com/entry/federal-trade-commission-approves-ban-noncompete-agreements_n_6622b47ee4b0167f7bf4d211"
  },
  {
    "text": "McConnell says Tucker Carlson and Trump's waffling delayed crucial Ukraine aid  —  The Senate Republican leader pointed to Carlson's “demonization of Ukraine,” along with Trump's “mixed views” and resistance to additional aid as reasons it's taken so long to pass.",
    "url": "https://www.nbcnews.com/politics/congress/mcconnell-says-tucker-carlson-trumps-waffling-delayed-crucial-ukraine-rcna149057"
  },
  {
    "text": "How Mike Johnson Is Taming Trump and His Party — Against All Odds  —  At a crucial juncture, the speaker went from pandering to Trump to managing him and from challenging the Democrats to working with them.  —  There are no atheists in foxholes and few isolationists in high office.",
    "url": "https://www.politico.com/news/magazine/2024/04/23/mike-johnson-ukraine-shift-00153825"
  },
  {
    "text": "National Enquirer made up the story about Ted Cruz's father and Lee Harvey Oswald, former publisher says  —  The Texas senator told NBC News that he's “not interested in revisiting ancient history.”  —  David Pecker, the former publisher of the National Enquirer, testified at Donald Trump's trial Tuesday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/national-enquirer-ted-cruz-father-rafael-lee-harvey-oswald-rcna149027"
  },
  {
    "text": "The media should be celebrating college protesters instead of demonizing them  —  Mainstream-media reporters covering the growing wave of college protests against Israel's war in Gaza have adopted an overwhelmingly negative tone about something they should be celebrating … ",
    "url": "https://presswatchers.org/2024/04/the-media-should-be-celebrating-college-protesters-instead-of-demonizing-them/"
  },
  {
    "text": "Kari Lake says ‘unfortunately’ Arizona isn't enforcing 1864 abortion ban, flipping again  —  The Senate candidate supported the 19th-century ban in 2022, came out against it this month, and now appears to be backing it again in a new interview.  —  Arizona GOP Senate candidate Kari Lake … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kari-lake-says-unfortunately-arizona-isnt-enforcing-1864-abortion-ban-rcna148948"
  },
  {
    "text": "Biden rule grants overtime pay to 4 million US workers  —  The administration of U.S. President Joe Biden on Tuesday unveiled a rule extending mandatory overtime pay to an estimated 4 million salaried workers, going even further than an Obama-era rule that was struck down in court.",
    "url": "https://www.reuters.com/world/us/biden-rule-grants-overtime-pay-4-million-us-workers-2024-04-23/"
  },
  {
    "text": "No one buys books  —  In 2022, Penguin Random House wanted to buy Simon & Schuster.  The two publishing houses made up 37 percent and 11 percent of the market share, according to the filing, and combined they would have condensed the Big Five publishing houses into the Big Four.",
    "url": "https://www.elysian.press/p/no-one-buys-books"
  },
  {
    "text": "Tennessee passes bill to let teachers carry guns, a year after mass shooting  —  One year after six were killed at Nashville's Covenant School, Tennessee remains the arena of one of the fiercest debates over gun policy nationwide  —  The Tennessee legislature passed a bill Tuesday … ",
    "url": "https://www.washingtonpost.com/nation/2024/04/23/tennessee-bill-arming-teachers-guns-passes/"
  },
  {
    "text": "George Santos drops independent House bid  —  Former Rep. George Santos (R-N.Y.) announced Tuesday that he was suspending his independent House bid, just over a month after entering the race.  —  “I have [met] with leaders and with constituents and I have made the decision to hang it up here and stop [pursuing] this race, THIS YEAR!”",
    "url": "https://thehill.com/homenews/campaign/4616359-george-santos-drops-independent-house-bid/"
  },
  {
    "text": "Bird flu virus found in grocery milk as officials say supply still safe  —  Viral fragments of bird flu have been identified in samples of milk taken from grocery store shelves in the United States, a finding that does not necessarily suggest a threat to human health but indicates the avian flu virus … ",
    "url": "https://www.washingtonpost.com/health/2024/04/23/bird-flu-virus-milk/"
  },
  {
    "text": "Appeals court greenlights release of secret Trump battles to block aides from testifying  —  The ruling came in response to a POLITICO petition to access records related to the Jan. 6 investigation.  —  Details of prosecutors' battles to obtain testimony from high-level White House aides … ",
    "url": "https://www.politico.com/news/2024/04/23/appeals-court-greenlights-release-of-secret-trump-battles-to-block-aides-from-testifying-00153829"
  },
  {
    "text": "Top tech companies seek more cash for the lab keeping AI safe  —  Hi again!  I'm filling in for your usual host Cristiano Lima-Strong, who has been working around-the-clock to bring you the latest news about Congress's potential TikTok ban.  It's great to be back in your inboxes during this busy week for tech policy news!",
    "url": "https://www.washingtonpost.com/politics/2024/04/23/top-ai-companies-seek-more-cash-lab-keeping-ai-safe/"
  },
  {
    "text": "You don't want immigrants?  Then tell grandma she can never retire.  —  Don't want more immigrants in this country?  Then tell grandma she can never retire.  —  As I've noted before, immigrants are driving the U.S. economic boom.  That is: The United States has escaped recession … ",
    "url": "https://www.washingtonpost.com/opinions/2024/04/23/immigration-jobs-economy/"
  },
  {
    "text": "No Soft Power Shake-Ups for Now  —  Germany is No. 1 in leadership approval ratings; Russia is unpopular  —  This article is the first in a series detailing the results from the latest Rating World Leaders report, which analyzes trends in approval ratings of the leadership of the U.S., Germany, Russia and China in over 130 countries.",
    "url": "https://news.gallup.com/poll/643853/no-soft-power-shake-ups.aspx"
  },
  {
    "text": "Playbook: Trump to MTG: Give it a rest  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  SPOILER ALERT — “Republicans are starting to worry about RFK Jr.,” by Lisa Kashinsky, Brittany Gibson, Jessica Piper and Steven Shepard: “'Kennedy was introduced … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/23/trump-to-mtg-give-it-a-rest-00153784"
  },
  {
    "text": "House GOP conservatives galvanize against Tony Gonzales … Hardline House GOP conservatives tell us they're feeling a renewed sense of motivation to go after Gonzales after he called out Rep. Matt Gaetz (R-Fla.) and House Freedom Caucus Chair Bob Good (R-Va.) on CNN this weekend.",
    "url": "https://punchbowl.news/article/tony-gonzales-brandon-herrera-primary-runoff/"
  },
  {
    "text": "Minnesota state senator arrested on burglary charge  —  A Minnesota state senator has been charged with first-degree burglary after being arrested in the city of Detroit Lakes early Monday morning.  —  Democratic state Sen. Nicole Mitchell, 49, was arrested at a residence after police responded … ",
    "url": "https://thehill.com/homenews/state-watch/4615108-minnesota-state-senator-arrested-burglary-charge/"
  },
  {
    "text": "Senate poised to pass bill that could ban TikTok  —  The Senate is poised to pass a bill as part of a broader foreign aid package that could lead to a ban on the social media app TikTok.  —  The Senate voted 80-19 to limit debate on the package, which includes a provision … ",
    "url": "https://thehill.com/policy/technology/4616071-senate-poised-to-pass-bill-that-could-ban-tiktok/"
  }
]