[
  {
    "text": "Trump, 18 others indicted for trying to overthrow 2020 Georgia election  —  X  —  Former President Donald Trump and 18 allies were charged on Monday with conspiring to overturn the results of the 2020 election in Georgia.  —  In a sweeping 98-page indictment handed up by a Fulton County grand jury … ",
    "url": "https://www.ajc.com/politics/trump-18-others-indicted-for-trying-to-overthrow-2020-georgia-election/PQ3N2YBIDRDJFLJGFLEBZUWM6I/"
  },
  {
    "text": "READ: Trump indictment in Fulton County, Georgia, probe  —  An Atlanta-based grand jury on Monday indicted former President Donald Trump on state charges stemming from his efforts to overturn his 2020 electoral defeat in the Peach State.",
    "url": "https://www.cnn.com/2023/08/14/politics/read-trump-indictment-georgia-election/"
  },
  {
    "text": "What to Know About Donald Trump's Four Indictments  —  From prosecutors and judges to charges and trial dates, it's all right here.  —  Former President Donald Trump became the first U.S. president to face criminal charges when he was indicted in New York in April.",
    "url": "https://www.thedailybeast.com/what-to-know-about-donald-trumps-four-indictments"
  },
  {
    "text": "Georgia Trump Investigation  —  Grand Jurors Hear Hours of Testimony in Election Interference Case  —  Prosecutors brought at least three witnesses before a grand jury considering efforts by former President Donald J. Trump and his allies to overturn Georgia's results in the 2020 election.",
    "url": "https://www.nytimes.com/live/2023/08/14/us/trump-indictment-georgia-election"
  },
  {
    "text": "Trump charged in Georgia 2020 election probe, his fourth indictment  —  ATLANTA — Former president Donald Trump and 18 others were criminally charged in Georgia on Monday in connection with efforts to overturn Joe Biden's 2020 victory in the state, according to an indictment made public late Monday night.",
    "url": "https://www.washingtonpost.com/national-security/2023/08/14/trump-indictment-georgia-election-2020/"
  },
  {
    "text": "Trump is indicted in Georgia on charges of racketeering.  What it means, what happens next  —  What's the maximum sentence if he's convicted?  Will he pose for a mug shot?  —  Former president Donald Trump has been indicted in Georgia for crimes related to his efforts to overturn … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/15/trump-indicted-georgia-explained/"
  },
  {
    "text": "Judge rules in favor of Montana youths in landmark climate decision  —  ‘This is a monumental decision,’ said a lawyer for the young plaintiffs, and could influence how judges handle similar cases in other states  —  In the first ruling of its kind nationwide, a Montana state court decided Monday … ",
    "url": "https://www.washingtonpost.com/climate-environment/2023/08/14/youths-win-montana-climate-trial/"
  },
  {
    "text": "‘Blind Side’ subject Oher alleges Tuohys made millions off lie  —  Retired NFL star Michael Oher, whose supposed adoption out of grinding poverty by a wealthy, white family was immortalized in the 2009 movie “The Blind Side,” petitioned a Tennessee court Monday with allegations that a central element … ",
    "url": "https://www.espn.com/nfl/story/_/id/38190720/blind-side-subject-michael-oher-alleges-adoption-was-lie-family-took-all-film-proceeds"
  },
  {
    "text": "Philadelphia teen arrested, charged in FBI terrorism investigation  —  The 17-year-old is being charged as a juvenile.  —  A Philadelphia teen has been charged and arrested with multiple state charges stemming from an FBI terrorism investigation, officials announced Monday.",
    "url": "https://abcnews.go.com/Politics/philadelphia-teen-arrested-charged-fbi-terrorism-investigation/story?id=102263409"
  },
  {
    "text": "The Looming Supreme Court Nullification Crisis  —  “In the name of the greatest people that have ever trod this earth,” Alabama Governor George Wallace proclaimed in his 1963 inaugural address at the state capitol in Montgomery, the first seat of the Confederacy, “I draw the line in the dust … ",
    "url": "https://washingtonmonthly.com/2023/08/14/the-looming-supreme-court-nullification-crisis/"
  },
  {
    "text": "Bodycam video shows confrontation between U.S. Rep. Ronny Jackson and law enforcement  —  The footage shows Jackson being tackled to the ground and placed in handcuffs, with the Amarillo Republican directing a profanity-laced tirade toward a trooper.  His office has said Jackson, a physician … ",
    "url": "https://www.texastribune.org/2023/08/14/ronny-jackson-dps-bodycam-video/"
  },
  {
    "text": "Arkansas rejects AP African American Studies, cites Arkansas law on “prohibited topics”  —  The Arkansas Department of Education (DOE) abruptly rejected AP African American Studies, saying the course may violate Arkansas law.  “The department encourages the teaching of all American history … ",
    "url": "https://popular.info/p/arkansas-rejects-ap-african-american"
  },
  {
    "text": "Biden's plan to forgive student debt for over 800,000 borrowers upheld by judge  —  A federal judge dismissed a lawsuit Monday from conservative groups looking to block student loan forgiveness for some 804,000 borrowers. … - They argued the federal government doesn't have the legal authority to forgive the debt.",
    "url": "https://www.axios.com/2023/08/14/student-debt-biden-lawsuit-dismissed"
  },
  {
    "text": "DeSantis urges Bob Iger to drop Disney lawsuit, accept the end of ‘special privileges’  — Florida Gov. Ron DeSantis told CNBC that Disney CEO Bob Iger should drop his company's political retaliation lawsuit.  — The lawsuit centers on Walt Disney World's special tax district … ",
    "url": "https://www.cnbc.com/2023/08/14/desantis-urges-bob-iger-to-drop-disney-lawsuit-accept-the-end-of-special-privileges.html"
  },
  {
    "text": "China central bank unexpectedly cuts rates to support sputtering economy  —  China's central bank unexpectedly cut key policy rates for the second time in three months on Tuesday, in a fresh sign that the authorities are ramping up monetary easing efforts to boost a sputtering economic recovery.",
    "url": "https://www.reuters.com/world/china/china-central-bank-cuts-rates-second-time-three-months-support-economy-2023-08-15/"
  },
  {
    "text": "She Wasn't Able to Get an Abortion.  Now She's a Mom.  Soon She'll Start 7th Grade.  —  Ashley just had a baby.  She's sitting on the couch in a relative's apartment in Clarksdale, Miss., wearing camo-print leggings and fiddling with the plastic hospital bracelets still on her wrists.",
    "url": "https://time.com/6303701/a-rape-in-mississippi/"
  },
  {
    "text": "Coast Guard rescues 4 divers who went missing off the Carolinas  —  Four divers were found and rescued about 50 miles off the coast of Cape Fear, North Carolina, after going missing on Sunday, the U.S. Coast Guard said.  Crews with the Coast Guard and the U.S. Navy had been searching for the divers since at least Sunday night.",
    "url": "https://www.cbsnews.com/news/divers-rescued-missing-coast-guard-north-carolina-south-carolina/"
  }
]