[
  {
    "text": "Clarence Thomas Secretly Participated in Koch Network Donor Events  —  Friends of the Court: SCOTUS Justices' Beneficial Relationships With Billionaire Donors  —  Supreme Court Justice Clarence Thomas' decadeslong friendship with real estate tycoon Harlan Crow and Samuel Alito's luxury travel … ",
    "url": "https://www.propublica.org/article/clarence-thomas-secretly-attended-koch-brothers-donor-events-scotus"
  },
  {
    "text": "Senator Robert Menendez Is Indicted in New York  —  Mr. Menendez, a New Jersey Democrat, was charged six years after his trial in a different corruption case ended in a hung jury.  —  Senator Robert Menendez of New Jersey, the chairman of the Foreign Relations Committee … ",
    "url": "https://www.nytimes.com/2023/09/22/nyregion/robert-menendez-indicted.html"
  },
  {
    "text": "Sen. Bob Menendez indicted over gifts of gold bars, car, apartment  —  Menendez has served as senator from New Jersey since 2006.  —  A federal grand jury in New York has returned an indictment against United States Sen. Bob Menendez, D-N.J., chairman of the powerful Foreign Relations Committee.",
    "url": "https://abcnews.go.com/Politics/sen-bob-menendez-indicted-gifts-gold-bars-car/story?id=103407936"
  },
  {
    "text": "Sen. Menendez, wife indicted on bribe charges as probe finds $100,000 in gold bars, prosecutors say  —  U.S. Sen. Bob Menendez of New Jersey and his wife were indicted Friday on charges that they took bribes of cash, gold bars and a luxury car for a range of corrupt acts … ",
    "url": "https://apnews.com/article/senator-menendez-indicted-729db45fcf21c42ba707c9d0139349e9"
  },
  {
    "text": "Playbook: How Matt Gaetz took over the House  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  NEW SCOTUS INVESTIGATION JUST DROPPED — ProPublica is up with its latest must-read dive into ethics on the Supreme Court.  This time, the story centers … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/22/how-matt-gaetz-took-over-the-house-00117565"
  },
  {
    "text": "Katherine Clark names the Democrats' price to save Kevin McCarthy  —  The number two Democratic leader in the House reveals the conditions upon which her caucus may lend Kevin McCarthy the votes he needs to pass a CR and fend-off a potential challenge to his speakership.",
    "url": "https://www.politico.com/news/2023/09/22/pbdd-house-minority-whip-katherine-clark-dems-00117441"
  },
  {
    "text": "Trump lights his legal defenses on fire on Meet the Press  —  This is why you shut the hell up when you're facing criminal charges. … Last week, Kristen Welker kicked off her tenure at NBC's “Meet the Press” by interviewing Donald Trump.  It was roundly criticized as an epic shitshow … ",
    "url": "https://www.publicnotice.co/p/trump-meet-the-press-legal-defenses-destroyed"
  },
  {
    "text": "U.A.W. President Steps Up Pressure on Biden With Invite to Picket Lines  —  President Biden has defended the striking autoworkers, who expanded their walkout on Friday, but has so far not announced plans to visit them.  —  Shawn Fain, the United Automobile Workers president … ",
    "url": "https://www.nytimes.com/2023/09/22/us/politics/uaw-biden-shawn-fain.html"
  },
  {
    "text": "U.S. will send Ukraine ATACMS long-range missiles for the first time  —  Some in Washington had resisted supplying the weapons system, known as “attack-ems,” out of fear that would widen the war with Russia.  —  U.S to give Ukraine an additional $325 million in military aid",
    "url": "https://www.nbcnews.com/news/world/russia-ukraine-war-atacms-biden-zelenskyy-long-range-missile-rcna116876"
  },
  {
    "text": "America's Cities Need Republicans, and I'm Becoming One  —  While Dallas has thrived, elsewhere Democratic policies have exacerbated crime and homelessness.  —  Dallas  —  I have been mayor of Dallas for more than four years.  During that time, my priority has been to make the city safer, stronger and more vibrant.",
    "url": "https://www.wsj.com/articles/americas-cities-need-republicans-and-im-becoming-one-dallas-texas-mayor-965dbaa4?mod=followamazon"
  },
  {
    "text": "‘Waiting for him to drop out’: DeSantis' influence nosedives in Florida  —  Some party members view the once-powerful governor as weakened amid his campaign struggles.  —  TALLAHASSEE, Fla. — Florida Gov. Ron DeSantis is losing his clout in Florida.  —  College boards, stacked … ",
    "url": "https://www.politico.com/news/2023/09/22/desantis-florida-republicans-governor-elections-00117514"
  },
  {
    "text": "Michigan attorney general says fake GOP electors she charged are ‘brainwashed’  —  Michigan Attorney General Dana Nessel said at a recent event with liberal activists that the fake Republican electors from 2020 that she charged were “brainwashed” to keep former President Donald Trump in power … ",
    "url": "https://www.cnn.com/2023/09/22/politics/dana-nessel-fake-electors-michigan-comments/"
  },
  {
    "text": "U.S. braces for calamitous, costly government shutdown in eight days  —  Federal workers and military service members won't be paid, while federal programs — from some food safety inspections to child care funds — come to an abrupt halt  —  Millions of federal employees … ",
    "url": "https://www.washingtonpost.com/business/2023/09/22/us-braces-calamitous-costly-government-shutdown-eight-days/"
  },
  {
    "text": "Clinton on Trump saying he's unlikely to pardon himself: 'I don't believe him'  —  In an interview set to air this Sunday, former presidential candidate Hilary Clinton said she doesn't believe former President Trump when he said it would be very unlikely that he would pardon himself.",
    "url": "https://thehill.com/homenews/4218428-clinton-on-trump-saying-hes-unlikely-to-pardon-himself-i-dont-believe-him/"
  },
  {
    "text": "David Brooks is laughing at you, peasant  —  David Brooks, the “moderate” columnist for the New York Times, is a very deep thinker who understands the important issues of the day well, and who deigns to share his understanding with the plebs as long as he gets a nice paycheck for doing so.",
    "url": "https://hotair.com/david-strom/2023/09/22/david-brooks-is-laughing-at-you-peasant-n579726"
  },
  {
    "text": "Office of Management and Budget to initiate process of preparing for a shutdown  —  While the House and Senate remain far apart on a spending deal, the federal government will soon formally initiate the process of preparing for a potential shutdown, participating in the mandatory but standard process … ",
    "url": "https://www.cnn.com/2023/09/22/politics/omb-government-shutdown-process/"
  },
  {
    "text": "Trump Tries to Strike Down New York AG Case Before It Starts  —  Trump's lawyers took to court Friday to effectively kill the New York AG's case just days before it's set to begin.  —  Former President Donald Trump's lawyers and New York state investigators duked it out in court Friday morning … ",
    "url": "https://www.thedailybeast.com/trump-tries-to-strike-down-new-york-ag-case-before-it-starts"
  },
  {
    "text": "The Ludicrous Agony of Rupert Murdoch  —  It's nice to know that Fox News, which has so deranged America while making Rupert Murdoch ungodly sums of money, has in the end made Murdoch miserable, at least if the journalist Michael Wolff is to be believed.  But the consolation is a small one.",
    "url": "https://www.nytimes.com/2023/09/21/opinion/rupert-murdoch-fox-news.html"
  }
]