[
  {
    "text": "Trump says he 'couldn't care less' if automakers raise prices due to tariffs, says he believes it will make people buy American-made cars  —  In an interview with NBC News, President Donald Trump also said he would not fire anyone involved in the Signal group chat.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-couldnt-care-less-automakers-raise-prices-tariffs-rcna198731"
  },
  {
    "text": "Trump says he 'couldn't care less' if foreign automakers raise prices due to tariffs  —  In an interview with NBC News, President Donald Trump also said he wouldn't fire anyone involved in the Signal group chat.  —  President Donald Trump told NBC News in an interview Saturday … ",
    "url": "https://www.nbcnews.com/news/amp/rcna198731"
  },
  {
    "text": "Trump says he 'couldn't care less' if auto prices rise because of his tariffs  —  He expressed confidence that the policy would prompt more Americans to buy cars and trucks made in the U.S.  —  Just now  —  President Donald Trump said on Saturday that he “couldn't care less” … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/29/trump-auto-tariffs-prices-rise/"
  },
  {
    "text": "SCOOP: ICE Revoking Students' Immigration Statuses Without Their or the University's Knowledge  —  In a developing story, it appears the Trump administration is quietly targeting even more students for deportation and doing so in a way that is taking universities and the students themselves completely by surprise.",
    "url": "https://zeteo.com/p/ice-manually-revoking-university-students-residency-status-middle-east"
  },
  {
    "text": "White House Correspondents' Association cancels plans to have a comedian headline annual dinner  —  The White House Correspondents' Association is reversing course and canceling its plans to have comedian Amber Ruffin headline this year's annual fundraising dinner in Washington, DC.",
    "url": "https://cnn.com/2025/03/29/media/white-house-correspondents-association-dinner-comedian/"
  },
  {
    "text": "White House Correspondents' Association cancels comedian headliner for annual dinner  —  The group's board unanimously decided it would no longer feature a comedic performance, WHCA President Eugene Daniels wrote in an email Saturday  —  The White House Correspondents' Association … ",
    "url": "https://www.politico.com/news/2025/03/29/white-house-correspondents-dinner-trump-00259299"
  },
  {
    "text": "Most US Institute of Peace workers get late-night word of their mass firing  —  Most employees at the U.S. Institute of Peace, a congressionally created and funded think tank now taken over by Elon Musk's Department of Government Efficiency, received email notices of their mass firing … ",
    "url": "https://apnews.com/article/us-institute-peace-trump-doge-mass-firing-746aa4fce9ad35fe17e8e22ce29417e3"
  },
  {
    "text": "DOGE fires nearly all staff at U.S. Institute of Peace headquarters  —  Employees who worked at the headquarters of the institute, founded and funded by Congress, received late-night termination notices, though most of its overseas staff were left in place.  —  Just now",
    "url": "https://www.washingtonpost.com/national-security/2025/03/29/doge-usip-peace-institute-fired/"
  },
  {
    "text": "Over 200 ‘Tesla Takedown’ protests take place throughout US on ‘Global Day of Action’ against Elon Musk's role with DOGE  —  Hundreds of “Tesla Takedown” demonstrations are taking place in the United States, Canada and Europe as activists ramp up their opposition to CEO Elon Musk's efforts … ",
    "url": "https://cnn.com/2025/03/29/business/tesla-takedown-elon-musk-doge/"
  },
  {
    "text": "White House ordered firing of L.A. federal prosecutor on ex-Fatburger CEO case, sources say  —  A federal prosecutor in Los Angeles was fired Friday at the behest of the White House, after lawyers for a fast-food executive he was prosecuting pushed officials in Washington to drop all charges against him … ",
    "url": "https://www.latimes.com/california/story/2025-03-29/los-angeles-federal-prosecutor-fired"
  },
  {
    "text": "JD Vance admits that he wasn't entirely sure why Trump wanted Greenland in the first place  —  Vice President JD Vance and second lady Usha Vance visited the territory for just a few hours … Vice President JD Vance told U.S. service members at a Greenland base that he only recently realized what they were doing there.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/jd-vance-greenland-b2723850.html"
  },
  {
    "text": "‘Should I Fire Him?’  Inside Trump's Deliberations Over the Fate of Michael Waltz  —  In public, President Trump has defended his national security adviser.  But behind the scenes, he has been casting around for advice.  —  For much of this week, President Trump was consumed by a single question.",
    "url": "https://www.nytimes.com/2025/03/29/us/politics/trump-signal-michael-waltz.html?unlocked_article_code=1.7k4.mPYh.-3zVC5P5UD8M&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Secret Pentagon memo on China, homeland has Heritage fingerprints  —  An internal guidance memo from Defense Secretary Pete Hegseth focuses on deterring China's seizure of Taiwan and shoring up homeland defense.  In some instances, the document is nearly a word-for-word facsimile of a report … ",
    "url": "https://www.washingtonpost.com/national-security/2025/03/29/secret-pentagon-memo-hegseth-heritage-foundation-china/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzMjIwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0NjAzMTk5LCJpYXQiOjE3NDMyMjA4MDAsImp0aSI6IjYyOTVlOGVmLTI2MTgtNGVjMC04ZWI1LWVjMWFkY2Q5YmUyZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAzLzI5L3NlY3JldC1wZW50YWdvbi1tZW1vLWhlZ3NldGgtaGVyaXRhZ2UtZm91bmRhdGlvbi1jaGluYS8ifQ.O7lt8b5w3iNyhAEn8NUezugixhGd3QZzjekjJ4C6mas&itid=gfta"
  },
  {
    "text": "Florida college fires Chinese professor under state's ‘countries of concern’ law  —  New College of Florida fired Kevin Wang, a professor who sought asylum and is authorized to work in the US  —  The New College of Florida has fired a Chinese language professor under a state law … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/29/florida-new-college-fires-chinese-professor"
  },
  {
    "text": "STAT+: Ouster of FDA's Peter Marks alarms a biopharma industry that saw him as an ally  —  When Robert F. Kennedy Jr., a longtime and visceral critic of pharmaceutical and biotech companies, was nominated by President Trump to be the nation's health secretary, the head of biotech's largest trade group issued … ",
    "url": "https://www.statnews.com/2025/03/29/fda-peter-marks-ouster-alarms-biopharma-that-saw-him-as-ally/"
  },
  {
    "text": "Pete Hegseth's wife reportedly attended meetings with foreign defense officials  —  Defense secretary, already under fire for chat group blunder, faces new scrutiny for having wife in high-level meetings  —  The wife of the US defense secretary, Pete Hegseth, attended two meetings … ",
    "url": "https://www.theguardian.com/us-news/2025/mar/29/pete-hegseth-wife-jennifer-foreign-defense-official-meetings"
  }
]