[
  {
    "text": "The Self-Immolation of the AZ GOP  —  Inflation is still running a little hot, according to the Department of Labor.  Overall inflation was at 3.5 percent year-over-year, with more stable “core” inflation at 3.8 percent.  While it's moving in the right direction, it's not returning … ",
    "url": "https://www.thebulwark.com/p/the-self-immolation-of-the-az-gop"
  },
  {
    "text": "Arizona Republicans condemn their own abortion policy  —  On Tuesday, the Arizona Supreme Court issued a bombshell decision banning virtually all abortions in the state.  The majority found that since the Supreme Court overturned Roe v. Wade, a near-total ban from 1864 — before Arizona was a state — was back in effect.",
    "url": "https://popular.info/p/arizona-republicans-condemn-their"
  },
  {
    "text": "Trump's telling comment on punishing doctors who provide abortions  —  The Republican Party needs leadership on abortion.  Trump is so frightened of it that he's liable to just create more problems.  —  Back in 2022, when it looked as if the Supreme Court would soon overturn Roe v. Wade … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/10/trumps-telling-comment-punishing-doctors-who-provide-abortions/"
  },
  {
    "text": "O.J. Simpson, Football Star Whose Trial Riveted the Nation, Dies at 76  —  He ran to football fame and made fortunes in movies.  His trial for the murder of his former wife and her friend became an inflection point on race in America.  —  O.J. Simpson, who ran to fame on the football field … ",
    "url": "https://www.nytimes.com/2024/04/11/sports/oj-simpson-dead.html"
  },
  {
    "text": "Biden Administration Is Closing the ‘Gun Show Loophole’  —  HOLSTERED  —  People selling firearms at gun shows and elsewhere will now be required to carry out background checks on their customers.  —  The Biden administration on Thursday announced that it is moving to close … ",
    "url": "https://www.thedailybeast.com/biden-administration-is-closing-the-gun-show-loophole"
  },
  {
    "text": "Trump's Big Lie About Biden Implodes After MAGA Ally Admits Truth  —  Steve Bannon no doubt thought he was being deviously clever.  Speaking with The New York Times this week, he elaborated on a sophisticated plan that Donald Trump's allies have developed for boosting third-party candidates, so they siphon votes from President Biden.",
    "url": "https://newrepublic.com/article/180617/steve-bannon-trump-lies-biden-jill-stein"
  },
  {
    "text": "Matt Gaetz Is Winning  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  Usually, you need about 10 minutes to walk from the Rayburn House Office Building to the House Chamber.  But if you're running from a reporter, it'll only take you five.",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/matt-gaetz-house-republican-congress-profile/677915/"
  },
  {
    "text": "Florida 2024 Poll: Plurality Plan to Vote “Yes” on Abortion Protection Ballot Measure  —  A new Emerson College Polling survey in Florida finds 42% of voters plan to vote yes on the November ballot measure that will provide a constitutional right to abortion before fetal viability, 32% are unsure, and 25% will vote no.",
    "url": "https://emersoncollegepolling.com/florida-2024-poll-plurality-plan-to-vote-yes-on-abortion-protection-ballot-measure/"
  },
  {
    "text": "Georgia's Lieutenant Governor to Face Inquiry for Role as Fake Trump Elector  —  Fani T. Willis, the district attorney of Fulton County, Ga., had been disqualified from pursuing the case against Lt. Gov. Burt Jones, but another prosecutor said he would now take it over.",
    "url": "https://www.nytimes.com/2024/04/11/us/burt-jones-trump-georgia.html"
  },
  {
    "text": "Mike Johnson and Donald Trump will propose bill to prevent non-citizens from voting  —  WASHINGTON - House Speaker Mike Johnson will introduce a bill with former President Donald Trump at his Mar-a-Lago residence aimed at preventing non-citizens from voting.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/11/mike-johnson-donald-trump-election-integrity-bill/73289385007/"
  },
  {
    "text": "Truong My Lan: Vietnamese billionaire sentenced to death for $44bn fraud  —  Truong My Lan is accused of looting one of Vietnam's largest banks over a period of 11 years  —  It was the most spectacular trial ever held in Vietnam, befitting one of the greatest bank frauds the world has ever seen.",
    "url": "https://www.bbc.com/news/world-asia-68778636"
  },
  {
    "text": "Bill to make marrying your first cousin illegal in Tennessee passes but not without a fight  —  Two Republican lawmakers voted against making marriage between first cousins illegal in Tennessee.  —  NASHVILLE, Tenn. (WSMV) - The Tennessee House passed a bill on Thursday that would make it illegal … ",
    "url": "https://www.wsmv.com/2024/04/11/bill-make-marrying-your-first-cousin-illegal-tennessee-passes-not-without-fight/"
  },
  {
    "text": "Men Rescued From Desert Island Thanks to Giant ‘HELP’ Sign  —  SOS  —  The trio had been stranded for over a week and surviving on coconut meat.  —  Three mariners were rescued from a remote atoll in the Pacific on Tuesday after a U.S. Navy plane spotted a sign reading “HELP” … ",
    "url": "https://www.thedailybeast.com/men-rescued-from-desert-island-thanks-to-giant-help-sign"
  },
  {
    "text": "Trump campaign demands Biden debate him ‘much earlier’ and more often  —  The Trump campaign is asking for additional debates and for the showdowns to begin much earlier than initially scheduled  —  EXCLUSIVE: The Trump campaign is calling for additional 2024 presidential debates and for them to take place … ",
    "url": "https://www.foxnews.com/politics/trump-campaign-debates-biden-much-earlier-more-often"
  },
  {
    "text": "Bankruptcy documents detail how GOP NC governor nominee Mark Robinson failed to file federal income taxes for 5 years  —  Mark Robinson claims Democrats have caused the “death” of “responsibility.”  —  North Carolina Lieutenant Governor Mark Robinson, whom Republican presidential candidate … ",
    "url": "https://abcnews.go.com/US/bankruptcy-documents-detail-gop-nc-governor-nominee-mark/story?id=108763847"
  },
  {
    "text": "Florida can't ban teacher from asking students to use her preferred pronouns, judge rules  —  Katie Wood, a transgender algebra teacher, has long gone by ‘Ms Wood’ but the law required students to say ‘Teacher Wood’  —  Florida cannot prohibit a 10th-grade math teacher from asking her students … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/11/florida-pronouns-teacher"
  },
  {
    "text": "Wisconsin Supreme Court liberal won't run again, shaking up race for control  —  The retirement of Justice Ann Walsh Bradley improves conservatives' chances of retaking the majority after losing it last year in the most expensive judicial contest in U.S. history.",
    "url": "https://www.washingtonpost.com/politics/2024/04/11/wisconsin-supreme-court-justice-reelection/"
  },
  {
    "text": "An Honest Assessment of Rural White Resentment Is Long Overdue … Something remarkable happened among rural whites between the 2016 and 2020 elections: According to the Pew Research Center's validated voter study, as the rest of the country moved away from Donald Trump … ",
    "url": "https://newrepublic.com/article/180570/trump-rural-white-resentment-honest-assessment"
  },
  {
    "text": "Biden plans to expand two national monuments in California  —  The president is expected to enlarge the San Gabriel Mountains National Monument and the Berryessa Snow Mountain National Monument  —  President Biden plans to expand the boundaries of two national monuments in California in the coming weeks … ",
    "url": "https://www.washingtonpost.com/climate-solutions/2024/04/11/biden-monuments-berryessa-san-gabriel/"
  },
  {
    "text": "Menendez trial still set for May, but wife's will be delayed  —  Menendez attorney Adam Fee argued against the delay because the senator's career is affected every day the charges loom over him.  —  Sen. Bob Menendez's bribery trial will start in May — without his wife.",
    "url": "https://www.politico.com/news/2024/04/11/menendez-trial-set-without-wife-00151768"
  },
  {
    "text": "Republican leaders go to the mat to protect judge shopping  —  When you've lost John Roberts ...  Besides the fact that Trump was able to stuff the federal courts with Federalist Society hard-line judges, conservatives have another tool at their disposal: rampant judge shopping.",
    "url": "https://www.publicnotice.co/p/judge-shopping-new-judicial-conference-policy"
  },
  {
    "text": "RFK Jr. Campaign Fires Staffer Who Said the Quiet Part Out Loud  —  RFK Jr.'s campaign has dismissed a staffer who said a Trump reelection was all right because her “number one priority” was defeating Biden … On Wednesday, the Kennedy camp quietly announced that Rita Palma had been removed from their roster.",
    "url": "https://www.rollingstone.com/politics/politics-news/rfk-fires-staffer-endorsed-trump-reelection-1235002839/"
  }
]