[
  {
    "text": "Trump's Dire Words Raise New Fears About His Authoritarian Bent  —  The former president is focusing his most vicious attacks on domestic political opponents, setting off fresh worries among autocracy experts.  —  Donald J. Trump rose to power with political campaigns that largely attacked external targets … ",
    "url": "https://www.nytimes.com/2023/11/20/us/politics/trump-rhetoric-fascism.html"
  },
  {
    "text": "Playbook: Why the Trump gag order fight matters  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  CAMPAIGN DEATHWATCH — “Vivek Ramaswamy struggles to gain traction with Iowa Republicans as critics question his path ahead,” by AP's Margery A. Beck … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/11/21/why-the-trump-gag-order-fight-matters-00128231"
  },
  {
    "text": "‘Did Trump Change, or Did You?’:  We Asked a Pro-Impeachment Republican Why He'd Back Trump  —  In a new Q&A, former GOP Rep. Peter Meijer defends his decision to back Donald Trump if he's the Republican nominee.  —  Things have gotten complicated for Peter Meijer when it comes to his feelings about Donald Trump.",
    "url": "https://www.politico.com/news/magazine/2023/11/20/peter-meijer-senate-donald-trump-00128137"
  },
  {
    "text": "Trump calls to ‘revamp the RNC’ if GOP debates go ahead  —  “GREAT POLLS JUST RELEASED - BEST EVER!  Harvard/Harris TRUMP 67%, DeSanctimonious 9%, Birdbrain 8%, Ramaswamy 5%, Christie - dead in the water, a total loser!  TRUMP UP 7% to 10% on CROOKED JOE BIDEN,” Trump wrote on his Truth Social platform … ",
    "url": "https://thehill.com/homenews/campaign/4319600-trump-calls-to-revamp-the-rnc-if-gop-debates-go-ahead/"
  },
  {
    "text": "What happens after Donald Trump's ‘final battle’?  —  I was driving with my kids on Sunday, mind wandering as I steered.  I was looking at a cluster of leafless trees when the first words from a social media post by Donald Trump popped into my mind.  —  “2024 is our final battle.”",
    "url": "https://www.washingtonpost.com/politics/2023/11/20/trump-final-battle-evangelicals/"
  },
  {
    "text": "Elon Musk's X sues media watchdog Media Matters over report on pro-Nazi content on the social media site  —  After a devastating advertiser exodus last week involving some of the world's largest media companies, X owner Elon Musk is suing the progressive watchdog group Media Matters … ",
    "url": "https://www.cnn.com/2023/11/20/tech/x-sues-media-matters/"
  },
  {
    "text": "America's most unhinged, unelected official  —  Stephen Miller, the notorious advisor to former president Donald Trump, suggested on X yesterday that a “conservative state Attorney[] General” should pursue civil and criminal charges against Media Matters.  Miller claims that Media Matters committed … ",
    "url": "https://popular.info/p/americas-most-unhinged-unelected"
  },
  {
    "text": "Large military aircraft overshoots runway, ends up in Kaneohe Bay  —  HONOLULU (HawaiiNewsNow) - A large U.S. Navy aircraft ended up in shallow waters of Kaneohe Bay on Monday afternoon after overshooting the runway at Marine Corps Base Hawaii.  —  The incident happened about 1:57 p.m. when the P-8 Poseidon aircraft was landing.",
    "url": "https://www.hawaiinewsnow.com/2023/11/21/emergency-crews-responding-after-reported-downed-military-aircraft-kaneohe-bay/"
  },
  {
    "text": "House GOP's Biden impeachment effort heads into final stage  —  The conference plans to depose Hunter Biden in December and is working to tie up other threads before January — when advocates hope they can start moving toward a vote.  —  House Republicans are closing in on a make-or-break moment … ",
    "url": "https://www.politico.com/news/2023/11/21/house-republicans-biden-impeachment-00128154"
  },
  {
    "text": "Democratic machine looms large in race to unseat Menendez  —  Good morning, Early Birds.  So you can plan your week, The Early will be in your inboxes tomorrow.  But we're taking Thursday and Friday off.  Tips: earlytips@washpost.com.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/11/21/democratic-machine-looms-large-race-unseat-menendez/"
  },
  {
    "text": "Israel-Hamas deal on hostage release and ceasefire is imminent, sources say  —  A deal between Israel and Hamas to free dozens of hostages and declare a multi-day ceasefire is imminent and could be announced by the Qatari mediators as soon as Tuesday, two sources with direct knowledge of the issue told Axios.",
    "url": "https://www.axios.com/2023/11/21/israel-hamas-hostage-ceasefire-deal-imminent"
  },
  {
    "text": "The Way Nevada Will Pick the GOP Presidential Nominee Is a Mess  —  Dueling caucus and primary confuse voters  —  LAS VEGAS—In January, roughly half a million Republican voters in Nevada will receive presidential primary ballots in the mail.  Former President Donald Trump's name won't be on them.",
    "url": "https://www.wsj.com/politics/elections/the-way-nevada-will-pick-the-gop-presidential-nominee-is-a-mess-5d165f46?mod=followamazon"
  },
  {
    "text": "Israeli Victim's Family Calls for Ceasefire: ‘War Is Only Serving Hamas and Netanyahu’  —  One man lost both of his parents on Oct. 7, but he doesn't want vengeance.  He wants an end to his government's bombing of the Gaza Strip.  —  KIBBUTZ BE'ERI, Israel—From Kibbutz Be'eri … ",
    "url": "https://www.thedailybeast.com/israeli-victims-family-calls-for-ceasefire-war-is-only-serving-hamas-and-netanyahu"
  },
  {
    "text": "Eighth Circuit's Holding that Private Plaintiffs Do Not Have Right to Sue to Enforce Section 2 of the Voting Rights Act Would Decimate the Rights of Minority Voters; Supreme Court Review Almost Certain  —  Derek just blogged about this divided decision of the Eighth Circuit.",
    "url": "https://electionlawblog.org/?p=139769"
  },
  {
    "text": "How the U.S. Violates Its Own Trade Laws to Buy Seafood from China  —  Uyghurs and North Koreans are forced to work in Chinese seafood processing plants.  But the federal government purchases millions of dollars of this seafood for the military and school lunches.",
    "url": "https://www.politico.com/news/magazine/2023/11/21/chinese-forced-labor-seafood-00126642"
  },
  {
    "text": "After the Civil War, Robert E. Lee Couldn't Run for President, but Trump Can?  —  In 1865, when the 39th Congress assembled in Washington, D.C., lawmakers faced an unusual problem: The former Confederate states, decisively defeated on the battlefield and having surrendered, were poised to return to the Union and take it over.",
    "url": "https://washingtonmonthly.com/2023/11/20/after-the-civil-war-robert-e-lee-couldnt-run-for-president-but-trump-can/"
  },
  {
    "text": "Beavercreek Walmart mass shooting: 4 injured, gunman kills self, police say  —  Captain: 'There's no immediate threat to the community.'  —  Four people were wounded and one person dead following a mass shooting Monday night inside the Beavercreek Walmart.  —  Explore",
    "url": "https://www.daytondailynews.com/local/crews-respond-to-active-shooter-at-beavercreek-walmart/Q24SROW5F5DNPJLTHJQUVXIAB4/"
  },
  {
    "text": "Secretive White House Surveillance Program Gives Cops Access to Trillions of US Phone Records  —  A WIRED analysis of leaked police documents verifies that a secretive government program is allowing federal, state, and local law enforcement to access phone records of Americans who are not suspected of a crime.",
    "url": "https://www.wired.com/story/hemisphere-das-white-house-surveillance-trillions-us-call-records/"
  },
  {
    "text": "Maria Bartiromo Floats Bonkers New COVID Conspiracy About Trump and China  —  While “just asking questions,” the once-respected anchor suggested China unleashed COVID-19 on the world just to destroy Trump.  —  Fox Business Network anchor Maria Bartiromo was once again just asking questions … ",
    "url": "https://www.thedailybeast.com/foxs-maria-bartiromo-floats-bonkers-new-covid-conspiracy-about-trump-and-china"
  },
  {
    "text": "‘Congratulations, Birds’: Biden Pardons a Pair of Turkeys  —  The president celebrated his 81st birthday on the same day he spared two turkeys in the annual pre-Thanksgiving tradition.  —  For the 76th year in a row on Monday, an American president took part in the pre-Thanksgiving ritual of pardoning a turkey.",
    "url": "https://www.nytimes.com/2023/11/20/us/politics/biden-turkey-pardon.html"
  }
]