[
  {
    "text": "Suddenly Trump Looks Older and More Deranged  —  Four days after the end of the Republican National Convention, it suddenly looks like a very different event.  I watched it intermittently, on television, along with perhaps 25 million other Americans (a relatively small number, though enough to matter).",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-looks-older-and-more-deranged/679186/"
  },
  {
    "text": "Democrats Are Making a Huge Mistake  —  Yesterday, Joe Biden did the honorable thing, after weeks of denying that anything had to be done at all.  His announcement took his party by surprise—and now, in haste, the Democrats are making a colossal error and ensuring that they will reap … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/kamala-harris-democrat-mini-primary/679187/"
  },
  {
    "text": "‘DEI,’ ‘Colored,’ ‘Jezebel’: MAGA Attacks on Kamala Harris Are Getting Ugly  —  The right right can barely contain its racist, sexist contempt for Biden's likely 2024 replacement  —  MAGA REPUBLICANS ARE subjecting Vice President Kamala Harris to a barrage of racist and sexist attacks … ",
    "url": "https://www.rollingstone.com/politics/politics-news/maga-republicans-racist-sexist-attacks-kamala-harris-1235065295/"
  },
  {
    "text": "Scoop: Harris' big-donor money bomb  —  SCOOP — Future Forward, the flagship super PAC blessed by President JOE BIDEN, received $150 million in new commitments from major Democratic donors in the 24 hours since the president announced he would step aside from the race, Elena Schneider reports.",
    "url": "https://www.politico.com/newsletters/playbook-pm/2024/07/22/scoop-harris-big-donor-money-bomb-00132333"
  },
  {
    "text": "MAGA Crowd Melts Down After Mike Pence Says Something Reasonable  —  Trump followers were in a tizzy after the former vice president thanked Biden for “putting the interests of our Nation ahead of his own” by ending his campaign.  —  LOADING  —  Former Vice President Mike Pence managed … ",
    "url": "https://www.huffpost.com/entry/mike-pence-tweet-response-biden_n_669e8f38e4b03375f56eb520"
  },
  {
    "text": "JD Vance says he's annoyed that he won't have the chance to debate Kamala Harris  —  In his first solo event as Trump's running mate, Vance blasted Biden and Harris, leaned into the culture wars and reminisced with a hometown crowd in Ohio.  —  MIDDLETOWN, Ohio — Sen. JD Vance, R-Ohio … ",
    "url": "https://www.nbcnews.com/politics/2024-election/jd-vance-annoyed-debate-kamala-harris-rcna163074"
  },
  {
    "text": "Fake Harris audio spreads like wildfire on TikTok after Biden's announcement  —  Incoherent audio wrongly attributed to Vice President Kamala Harris is going viral among right-wing accounts on TikTok following President Joe Biden's exit from the presidential race.",
    "url": "https://www.mediamatters.org/tiktok/fake-harris-audio-spreads-wildfire-tiktok-after-bidens-announcement"
  },
  {
    "text": "This Is Exactly What the Trump Team Feared  —  On the evening of Super Tuesday, March 5, shortly before Donald Trump effectively ended the Republican primary and earned a general-election rematch with President Joe Biden, I asked the co-managers of Trump's presidential campaign what they feared most about Biden.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-campaign-biden-dropping-out/679183/"
  },
  {
    "text": "The post-Biden era may be uncertain for the Democrats, but for Trump it will be utterly dismaying  —  Whoever is nominated, a fresh choice will be on offer - a far better one than a grudge match between two grumpy old men  —  To borrow from Shakespeare, “Nothing in his life became him like the leaving it.”",
    "url": "https://www.theguardian.com/commentisfree/article/2024/jul/22/post-joe-biden-era-democrats-donald-trump"
  },
  {
    "text": "Trump's age and health under renewed scrutiny after Biden's exit  —  As president, Donald Trump released a report that experts said showed he had heart disease and was obese.  But as a candidate, he has refused to release bloodwork results, his weight or other key information.",
    "url": "https://www.washingtonpost.com/politics/2024/07/22/trump-age-health/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIxNjIwODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzMDAzMTk5LCJpYXQiOjE3MjE2MjA4MDAsImp0aSI6IjQ1MDY4ODcyLTI3OWQtNGIzNC1iNWM0LWFkZjdhMmEzYTVmYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA3LzIyL3RydW1wLWFnZS1oZWFsdGgvIn0.9mEdo0-zGkhN2Ac_-k0CywQf9hAgY-2dVwY5fWNd-RQ&itid=gfta"
  },
  {
    "text": "Scoop: Senate GOP plots new attacks on Kamala Harris … - The GOP plans to exploit the dynamic of Biden himself having doubted his VP's chances at beating Trump.  — “It is important to remember the only reason Joe Biden held on as long as he did was by aggressively making the case … ",
    "url": "https://www.axios.com/2024/07/22/kamala-harris-senate-republicans-nrsc-president"
  },
  {
    "text": "Kamala Harris's vice presidential pick: The pros and cons of her top contenders  —  Vice President Kamala Harris appears to be on track to lock down the Democratic presidential nomination after President Joe Biden suspended his campaign Sunday afternoon.  —  Most of her potential competitors … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3093736/kamala-harris-vice-presidental-pick-pros-cons-top-contenders/"
  },
  {
    "text": "Trump and His Allies Are Freaking Out Over Biden Leaving Race  —  The former president is falling apart at the prospect of facing Kamala Harris instead of the president … “It's not over!  Tomorrow Crooked Joe Biden's going to wake up and forget that he dropped out of the race today!” … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-maga-allies-freak-out-biden-race-harris-1235064883/"
  },
  {
    "text": "A guide to the coming attacks on Kamala Harris  —  On Sunday at 1:46 PM Eastern Time, President Joe Biden announced he would end his campaign for reelection.  Seconds later, the attacks on Vice President Kamala Harris began.  —  Harris is not yet the nominee.",
    "url": "https://popular.info/p/a-guide-to-the-coming-attacks-on"
  },
  {
    "text": "Raskin joins calls for Secret Service director's resignation  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/house/4786459-raskin-demands-secret-service-director-resign/"
  },
  {
    "text": "RFK Jr. floated a job in a Trump White House as he weighed endorsing Trump  —  The independent candidate suggested being given a senior job overseeing a portfolio of health and medical issues, an idea that the Trump campaign rejected  —  Independent presidential candidate Robert F. Kennedy Jr. held talks … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/22/rfk-jr-floated-job-trump-white-house-he-weighed-endorsing-trump/"
  },
  {
    "text": "Major permitting reform bill unveiled by Manchin and Barrasso  —  Top energy legislators released a long-awaited proposal for speeding up the approval of a wide range of projects, but it's expected to be dead-on-arrival in the Senate.  —  Sens. Joe Manchin (I-WV) and John Barrasso (R-WY) … ",
    "url": "https://www.washingtonexaminer.com/policy/energy-and-environment/3094750/major-permitting-reform-bill-unveiled-manchin-barrasso/"
  },
  {
    "text": "Harris won't preside over Netanyahu's speech to Congress  —  All eyes will be on how Harris navigates the inflammatory and divisive issue of Israel's war in Gaza after the Oct. 7 attack on the country by Hamas.  —  Vice President Harris has declined to preside over the Senate chamber … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/22/kamala-harris-bibi-netanyahu-speech-congress/"
  }
]