[
  {
    "text": "Melania's Appearance With Donald Trump Sparks Mockery: ‘Checking the Clock’  —  Melania Trump's appearance at a fundraiser with husband Donald Trump has prompted mockery on social media.  —  The former first lady has maintained a low profile as her husband seeks to reclaim the White House in 2024.",
    "url": "https://www.newsweek.com/melania-appearance-donald-trump-mockery-1887693"
  },
  {
    "text": "Trump Panders to Billionaires, Vows to Keep Their Taxes Low During Fundraiser  —  A handful of billionaires who abandoned the former president after the Jan. 6 attacks have come crawling back  —  Donald Trump promised to keep billionaires' taxes low at a fundraising dinner Saturday night in Palm Beach … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-billionaires-taxes-low-fundraiser-1235000282/"
  },
  {
    "text": "Trump tells billionaires he'll keep their taxes low at $50 million fundraising gala  —  Biden hit Trump for promising to extend the tax cuts in a video released Saturday.  —  WASHINGTON — Former President Donald Trump emphasized the importance of extending his signature tax cuts … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-tells-billionaires-ll-keep-taxes-low-50-million-fundraising-gala-rcna146748"
  },
  {
    "text": "Trump protest vote warnings … - In 10 recent primary contests, more than one-quarter of GOP primary voters cast a ballot for a non-Trump candidate.  — “Joe Biden has a real golden opportunity to capture all those disaffected people who voted for Nikki Haley,” said Arizona-based GOP strategist Barrett Marson.",
    "url": "https://www.axios.com/2024/04/07/trump-biden-protest-vote-2024"
  },
  {
    "text": "Suspect Arrested in Arson at Burlington Office of Senator Sanders  —  For Immediate Release  —  U.S. Attorney's Office, District of Vermont  —  Burlington, Vermont - The United States Attorney's Office for the District of Vermont stated that Shant Soghomonian (also known as Michael Soghomonian) … ",
    "url": "https://www.justice.gov/usao-vt/pr/suspect-arrested-arson-burlington-office-senator-sanders"
  },
  {
    "text": "Trump: it would be ‘great honor’ to go to jail for violating gag order  —  Former U.S. President Donald Trump said it would be “my great honor” to go to jail for violating a gag order imposed by the judge who will hear his upcoming trial on charges stemming from a hush-money payment to a porn star.",
    "url": "https://www.reuters.com/world/us/trump-it-would-be-great-honor-go-jail-violating-gag-order-2024-04-07/"
  },
  {
    "text": "Boomers deliver surprise strength for Biden  —  Baby boomers are on track to make President Biden the first Democrat to carry the senior vote since Al Gore in 2000. … - The biggest trend at risk is the notion that voters become more conservative as they get older, Politico's Steven Shepard writes in a deep dive on the polling.",
    "url": "https://www.axios.com/2024/04/07/joe-biden-senior-voters-baby-boomers"
  },
  {
    "text": "Why is the Press Making Trump Seem More Normal?  —  Believe it or not, much of the political press has an inadvertent pro-Trump bias  —  On Thursday morning, Donald Trump was a guest on Hugh Hewitt's radio show.  Hewitt is a one time Never Trump conservative turned obsequious Trump flunkie.",
    "url": "https://www.messageboxnews.com/p/why-the-press-ignored-trump-accusing"
  },
  {
    "text": "The world is safer for a renewed Entente  —  The British Foreign Secretary and French Foreign Minister celebrate 120 years of cooperation between our two countries  —  'A masterpiece of statesmanship,\" declared The Daily Telegraph. “  Un résultat considérable,” judged Le Figaro.",
    "url": "https://www.telegraph.co.uk/news/2024/04/07/world-is-safer-for-a-renewed-entente/"
  },
  {
    "text": "José Andrés Frustrated It Took Foreign Aid Workers' Deaths To Spark Global Outrage Over Gaza  —  The chef said that while the World Central Kitchen attack was devastating, it should not have taken six foreigners' deaths for the world to care about Gaza.  —  LOADING",
    "url": "https://www.huffpost.com/entry/jose-andres-frustrated-israel-kills-foreign-aid-workers-gaza-outrage_n_6612f620e4b056f720586f3d"
  },
  {
    "text": "House, Senate commerce chairs release bipartisan privacy bill  —  Commerce Committee chairs in the House and Senate released a bipartisan bill Sunday evening that aims to protect Americans' personal data online.  —  Sen. Maria Cantwell (D-Wash.) and Rep. Cathy McMorris Rodgers (R-Wash.) … ",
    "url": "https://thehill.com/policy/technology/4579903-house-senate-commerce-chairs-release-bipartisan-privacy-bill/"
  },
  {
    "text": "‘Increasingly chaotic’: Why House Republicans are heading for the exits  —  The decision by 21 Republican lawmakers to step back is indicative of the broader morale problem within the GOP conference  —  House Majority Leader Steve Scalise thought he had a good argument for Rep. Mike Gallagher (R-Wis.).",
    "url": "https://www.washingtonpost.com/politics/2024/04/07/house-republicans-retirements-mike-johnson-majority-elections/"
  },
  {
    "text": "Gaza buildings and land decimated in 6 months of war … - More than 100 Israelis are still being held hostage in Gaza.  — Even prior to Oct. 7, years of Israeli blockade and military operations in the densely-populated enclave left many in Gaza with inadequate access to clean water, electricity or sewer.",
    "url": "https://www.axios.com/2024/04/07/gaza-infrastructure-land-damage-israel-six-months-war"
  },
  {
    "text": "Judge Cannon rules are not the rules lawyers are used to seeing applied in a courtroom.  Hers is a court increasingly reminiscent of “Alice's Adventures in Wonderland,” where important matters are upside down.  The Queen of Hearts told Alice during the trial of the Knave of Hearts, “sentence first, verdict afterwards.”",
    "url": "https://joycevance.substack.com/p/judge-cannon-rules"
  }
]