[
  {
    "text": "Is Trump OK?  Unhinged reaction to rise of Harris worries supporters  —  Rambling speeches peppered with insults, narcissism and an obsession with crowd size have raised questions about the former president's fitness for office  —  Even some of Donald Trump's supporters are now asking … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/24/donald-trump-mental-fitness-campaign"
  },
  {
    "text": "Trump's Carefully Scripted Week Kept Veering Off Script  —  Despite calls by his advisers to focus on the issues, former President Donald J. Trump has made it clear that he intends to keep running his campaign his way.  —  Donald J. Trump's political endurance this year has been attributed … ",
    "url": "https://www.nytimes.com/2024/08/24/us/politics/trump-campaign-2024.html?unlocked_article_code=1.FU4.F6Z6.d5lNA8CP3hx6&smid=url-share"
  },
  {
    "text": "DNC ratings thump Trump as 29 million TV viewers watch Harris' acceptance speech  —  The momentum of Vice President Kamala Harris' presidential campaign helped push the ratings for the Democratic National Convention past the Republican festivities for former President Trump.",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2024-08-23/dnc-ratings-thump-trump-as-29-million-tv-viewers-watch-harriss-acceptance-speech"
  },
  {
    "text": "Trump Fumes When Fox News Asks About Harris's Momentum After DNC … Donald Trump called in to Fox News to give his thoughts on Kamala Harris's speech at the Democratic National Convention Thursday night, and he wasn't taking it well.  —  Host Martha MacCallum asked Trump what he would do to regain … ",
    "url": "https://newrepublic.com/post/185231/trump-reaction-fox-news-call-kamala-harris-momentum"
  },
  {
    "text": "RFK Jr. suspends his campaign — with an appropriately bizarre theory  —  Robert F. Kennedy Jr. insisted he can somehow still be elected president.  Let's count the holes in his reasoning.  —  The promise of Robert F. Kennedy Jr.'s independent 2024 campaign was always something of a mirage.",
    "url": "https://www.washingtonpost.com/politics/2024/08/23/rfk-jr-suspends-his-campaign-with-an-appropriately-bizarre-theory/"
  },
  {
    "text": "Foo Fighters Did Not Allow Donald Trump to Use ‘My Hero’ at Rally, Will Donate Any Royalties to Harris Campaign  —  Trump played the 1997 hit to bring Robert Kennedy Jr. to the stage in Glendale, Arizona.  —  Donald Trump may consider Robert F. Kennedy Jr. his hero, given he played … ",
    "url": "https://www.billboard.com/culture/politics/foo-fighters-donald-trump-my-hero-rally-1235760416/"
  },
  {
    "text": "Harris, Walz lean into erasing medical debt  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/policy/healthcare/4842471-harris-walz-lean-into-erasing-medical-debt/"
  },
  {
    "text": "Democratic convention energy, Harris hot streak making Republicans nervous  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4844833-republicans-nervous-harris-dnc-surge/"
  },
  {
    "text": "RFK Jr. Was My Drug Dealer  —  he leading third-party candidate for president—an environmental lawyer and activist, a son and nephew of legendary liberal Democratic politicians—just quit the race and announced that he is joining the campaign of the most anti-environment president … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/rfk-jr-endorse-trump-execute-drug-dealers/679597/?gift=_YJWRO9sT6lILBJDbj6IXBARrGSL_SiqmR7eWDgV4og"
  },
  {
    "text": "Kamala's Harsh Takedown of Trump Points the Way to a Post-MAGA America  —  Kamala Harris just showed us the promise of a post-MAGA future.  Now it's up to the voters to decide to take us there.  —  In her rousing convention speech on Thursday, Harris offered many olive branches to right-leaning independents and Republican voters.",
    "url": "https://newrepublic.com/article/185258/kamala-harris-trump-takedown-post-maga-america"
  },
  {
    "text": "Fauci recovering after hospitalization for West Nile virus  —  Dr. Anthony Fauci, former director of the National Institute of Allergy and Infectious Diseases, is recovering at home after being hospitalized with West Nile virus, a spokesperson said.  —  Fauci, a longtime public health official … ",
    "url": "https://www.cnn.com/2024/08/24/health/fauci-west-nile-virus"
  },
  {
    "text": "These Young Women Didn't Want to Vote for Biden.  They're All In on Harris.  —  In new polls, a large majority of young women plan to vote for the vice president.  We talked with eight of them.  —  Constance Lancelle, 22, of Milwaukee, was “definitely not interested in voting for Biden,” she said.",
    "url": "https://www.nytimes.com/2024/08/24/upshot/harris-polling-young-women.html"
  },
  {
    "text": "‘Throwing money down a well’: McCarthy's revenge tour comes to an end  —  Rep. Matt Gaetz's decisive victory this week capped off multiple losses for allies of Kevin McCarthy, and they're unsure if they'll continue their vendetta in 2026.  —  Kevin McCarthy's revenge tour is over — and it might be for good.",
    "url": "https://www.politico.com/news/2024/08/24/mccarthy-revenge-tour-gaetz-00176220"
  },
  {
    "text": "Are Republicans losing the culture wars?  —  School board candidates who ran on parental rights in classrooms are suffering defeats in states like Florida, once a leader in the “anti-woke” movement.  —  Republicans are confronting a decisive moment in the battle over public education: proving they can still win a culture war.",
    "url": "https://www.politico.com/news/2024/08/24/republicans-culture-war-races-00176166"
  },
  {
    "text": "There's a reason Adam Kinzinger defended Democrats' patriotism  —  Republicans are 25 times more likely to describe the Democratic Party as “anti-American” than to use the term “patriotic.”  —  Recognizing that the audience for Vice President Kamala Harris's acceptance speech would probably draw … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/23/theres-reason-adam-kinzinger-defended-democrats-patriotism/"
  }
]