[
  {
    "text": "Trump administration poised to accept ‘palace in the sky’ as a gift for Trump from Qatar: Sources  —  The luxury jumbo jet is to be used as Air Force One, sources told ABC News.  —  In what may be the most valuable gift ever extended to the United States from a foreign government … ",
    "url": "https://abcnews.go.com/Politics/trump-administration-poised-accept-palace-sky-gift-trump/story?id=121680511"
  },
  {
    "text": "Trump Is to Accept a Luxury 747 From Qatar for Use as Air Force One  —  The plan raises substantial ethical issues, given the immense value of the lavishly-appointed plane and the fact that Mr. Trump plans to use it after he leaves office.  —  The Trump administration plans to accept … ",
    "url": "https://www.nytimes.com/2025/05/11/us/politics/trump-qatar-jet-gift-air-force-one.html"
  },
  {
    "text": "Trump reportedly is set to accept a jet from Qatar's ruling family for possible use as Air Force One  —  President Donald Trump reportedly is set to accept a luxury Boeing 747-8 jumbo jet as a gift from the ruling family of Qatar during his trip to the Middle East this coming week … ",
    "url": "https://apnews.com/article/trump-qatar-gift-jet-air-force-one-7f9afb461c6b3ac16fca3bb0973715ff"
  },
  {
    "text": "Trump Administration Live Updates: Trump Is Said to Be Getting Qatari 747 for Air Force One, and Post-Presidency Travel  —  Where Things Stand  — Air Force One: The Trump administration plans to accept a luxury Boeing 747-80 plane from the Qatari royal family that will be upgraded to serve … ",
    "url": "https://www.nytimes.com/live/2025/05/11/us/trump-news?unlocked_article_code=1.GU8.y_Ln.HmcGQM3_ooo0&smid=url-share"
  },
  {
    "text": "Trump and China close in on trade deal after productive talks, Bessent says  —  Secretary Bessent says more details will be revealed on Monday  —  Treasury Secretary Scott Bessent said on Sunday that the Trump administration has made progress in its trade negotiations with China.",
    "url": "https://www.foxnews.com/politics/trump-china-close-trade-deal-after-productive-talks-bessent-says"
  },
  {
    "text": "Morelle's Statement on Abrupt Firing of Shira Perlmutter, Register of Copyrights  —  WASHINGTON - Rep. Joe Morelle (NY-25), the top Democrat on the Committee on House Administration, issued this statement after Register of Copyrights and Director of the U.S. Copyright Office, Shira Perlmutter … ",
    "url": "https://democrats-cha.house.gov/media/press-releases/morelles-statement-abrupt-firing-shira-perlmutter-register-copyrights"
  },
  {
    "text": "Another equipment outage impacts flights at Newark Liberty International Airport  —  Another air traffic control equipment outage caused the FAA to implement a ground stop for Newark Liberty International Airport bound flights Sunday morning.  —  The ground stop, which means flights heading … ",
    "url": "https://cnn.com/2025/05/11/us/another-equipment-outage-impacts-newark-airport"
  },
  {
    "text": "Dem Crypto Ally Defends Fundraiser With Trump Crypto Donor  —  Democrats have gotten too “pure,” Arizona Sen. Ruben Gallego argued at a Pennsylvania town hall to explain his ties to crypto investor Marc Andreessen  —  Sen. Ruben Gallego (D-Ariz.) traveled to Pennsylvania for a town hall … ",
    "url": "https://www.rollingstone.com/politics/politics-news/gallego-democrat-crypto-fundraiser-andreessen-trump-1235336588/"
  },
  {
    "text": "Homeland Security Dept. accuses lawmakers of ‘storming’ an ICE facility despite oversight laws saying they could be there  —  The battle over immigration came to a dramatic head Friday afternoon when Democratic lawmakers faced off with Homeland Security Department officers as they tried to visit a Newark … ",
    "url": "https://cnn.com/2025/05/10/politics/dhs-lawmakers-ice-newark-mayor-arrest"
  },
  {
    "text": "Judges say unsolicited pizza deliveries are meant to intimidate them  —  Judges in several states say they have faced threats and intimidation tactics associated with pizza deliveries.  —  Federal judges say unsolicited pizza deliveries to jurists' homes that began in February may number … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/11/justice-judges-threats-intimidation-pizza-deliveries/"
  },
  {
    "text": "In Mideast, Trump plans to focus on business deals, not geopolitics  —  The trip is expected to focus primarily on cementing trade ties.  On the heels of Trump Organization business deals in the region, it also showcases the blurring of Trump's private business ventures with foreign policy.",
    "url": "https://www.washingtonpost.com/politics/2025/05/11/trump-mideast-trip/"
  },
  {
    "text": "Secretary of Defense Pete Hegseth '03 ‘plagiarized’ small portions of his senior thesis, experts say.  But how serious is it?  —  “After Card's whisper, Bush looked distracted and somber but continued to listen to the second-graders, joking that they ‘read like sixth-graders,’” … ",
    "url": "https://www.dailyprincetonian.com/article/2025/05/princeton-news-pete-hegseth-senior-thesis-plagiarism-allegations"
  },
  {
    "text": "FEMA cuts emergency training under Trump as hurricane season looms  —  The U.S. federal disaster agency FEMA has sharply reduced training for state and local emergency managers ahead of the start of the hurricane season on June 1, according to current and former officials, memos seen by Reuters … ",
    "url": "https://www.reuters.com/business/environment/fema-cuts-emergency-training-hurricane-season-looms-2025-05-11/"
  },
  {
    "text": "Being a mom in the federal government wasn't easy.  Trump made it “impossible.”  —  The Handbasket spoke to several moms about the series of painful choices they've had to make since January. … When Gabrielle was home on a recent Saturday morning, her older child sadly asked her if she had to go to work.",
    "url": "https://www.thehandbasket.co/p/moms-federal-government-trump-return-to-office"
  },
  {
    "text": "The hidden ways Trump, DOGE are shutting down parts of the U.S. government  —  Limits on spending have incapacitated parts of agencies as varied as the National Park Service and the Pentagon.  —  At the Environmental Protection Agency, research at 11 laboratories has ground to a halt … ",
    "url": "https://www.washingtonpost.com/nation/2025/05/11/trump-government-operations-halt-funding-cuts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2OTM2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4MzE4Mzk5LCJpYXQiOjE3NDY5MzYwMDAsImp0aSI6IjY0NzcxZDliLTc5ZGUtNGQxMy1hZDk0LTg1MjExZDZiNDI1MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vMjAyNS8wNS8xMS90cnVtcC1nb3Zlcm5tZW50LW9wZXJhdGlvbnMtaGFsdC1mdW5kaW5nLWN1dHMvIn0.UmcilYpN3kgfVtnfXSXiHlWr5JfXu6XkuCb0cgaxKGs&itid=gfta"
  },
  {
    "text": "AOC Isn't Ruling Anything Out, Including the White House  —  Alexandria Ocasio-Cortez's rise to prominence worries some Democrats who say the base is taking the wrong lessons from the 2024 election  —  Rep. Alexandria Ocasio-Cortez (D., N.Y.) was standing in front of thousands of angry Democrats … ",
    "url": "https://www.wsj.com/politics/alexandria-ocasio-cortez-political-future-1b1ad7cc"
  },
  {
    "text": "Barrasso: 'I don't believe' suggested habeas corpus suspension will ‘come to Congress’  —  Senate Majority Whip John Barrasso (R-Wyo.) said he doesn't believe that the White House's suggested habeas corpus suspension will reach Congress.  —  During an appearance on NBC's “Meet The Press” … ",
    "url": "https://thehill.com/homenews/sunday-talk-shows/5294430-barrasso-habeas-corpus-suspension-congress/"
  },
  {
    "text": "Elon Musk's regulatory troubles have begun to melt away in Trump's second term  —  The Trump administration has halted some regulatory matters involving Musk's companies and fired people from agencies investigating Tesla, SpaceX and Neuralink.  —  Tech billionaire Elon Musk's regulatory problems have started to fade into the past.",
    "url": "https://www.nbcnews.com/tech/elon-musk/elon-musks-regulatory-issues-begun-melt-away-trumps-second-term-rcna202848"
  },
  {
    "text": "'It's time for Joe Biden to go away': Democrats are triggered by Biden's return to the spotlight  —  Democrats are ready to move on even if their former standard bearer is not.  —  Joe Biden's return to the spotlight this week is igniting anger among Democrats who wish the former president … ",
    "url": "https://www.politico.com/news/2025/05/11/biden-go-away-00339909"
  },
  {
    "text": "This Obscure New York Court Is Set to Decide Fate of Trump's Tariffs  —  The Court of International Trade this week will consider the legality of president's ‘Liberation Day’ levies  —  The Trump administration's global tariffs face their first major legal test this week … ",
    "url": "https://www.wsj.com/us-news/law/court-of-international-trade-edb2da94"
  }
]