[
  {
    "text": "Playbook: What the GOP's new Big 3 discussed this weekend  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  TOP-ED — “The Price of American Retreat,” by Mitch McConnell for Foreign Affairs: “To pretend that the United States can focus on just one threat at a time … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/12/16/what-the-gops-new-big-3-discussed-this-weekend-00194463"
  },
  {
    "text": "Congress grapples over pre-Christmas catch-all deal as government shutdown looms  —  Top lawmakers had aimed to release bill text over the weekend but hit an impasse over agriculture aid.  —  Congressional leaders were still trading offers Sunday afternoon on a government funding patch attached … ",
    "url": "https://www.politico.com/news/2024/12/15/congress-grapples-deal-government-shutdown-looms-00194422"
  },
  {
    "text": "Donald Trump Adviser Collapses On Stage At New York Young Republican Gala  —  The president-elect called into the event and addressed the incident, saying Alex Bruesewitz is “a very special guy.”  —  LOADING  —  Alex Bruesewitz, a consultant who helped President-elect Donald Trump cut through to young … ",
    "url": "https://www.huffpost.com/entry/donald-trump-adviser-collapses-on-stage_n_67600aa7e4b0d06419ec078e"
  },
  {
    "text": "RFK Jr. Has a Battle Plan to Get Senate Confirmation  —  Health secretary nominee, after meeting resistance in some corners, plans to play down vaccine skepticism, pro-abortion stances  —  WASHINGTON—Robert F. Kennedy Jr.'s attempt to win over Capitol Hill starts this week with a strategy … ",
    "url": "https://www.wsj.com/politics/policy/rfk-jr-hhs-senate-confirmation-plan-a02a0609"
  },
  {
    "text": "Journalists anticipate a renewed hostility toward their work under the incoming Trump administration  —  For the press heading into a second Trump administration, there's a balancing act between being prepared and being fearful.  The return to power of Donald Trump, who has called journalists enemies … ",
    "url": "https://apnews.com/article/trump-press-media-news-1915c25137eb4605b95ab3b3ccc6fb4c"
  },
  {
    "text": "Trump vows to ‘hire American.’ His businesses keep hiring foreign guest workers  —  President-elect Donald Trump vowed on the campaign trail to do everything in his power to benefit American workers.  “We will build American, buy American and hire American,” he said during a rally in August.",
    "url": "https://www.cnn.com/2024/12/16/politics/trump-more-foreign-workers-invs/"
  },
  {
    "text": "Why Musk Doesn't Have Access to SpaceX's Biggest Government Secrets  —  Executives haven't sought higher security clearance for the CEO to avoid questions about his drug use and contact with foreign officials; the answers might no longer matter  —  The payloads SpaceX launches into the heavens … ",
    "url": "https://www.wsj.com/tech/musk-spacex-security-clearance-secrets-b9774346?st=DWoEW7&reflink=article_copyURL_share"
  },
  {
    "text": "Amazon Disregarded Internal Warnings on Injuries, Senate Investigation Claims  —  A staff report by the Senate labor committee, led by Bernie Sanders, uncovered evidence of internal concern about high injury rates at the e-commerce giant.  —  For years, worker advocates and some government officials … ",
    "url": "https://www.nytimes.com/2024/12/16/business/economy/amazon-warehouse-injuries.html?unlocked_article_code=1.h04.4o0F.0Wz9AlQpIZRI&smid=url-share"
  },
  {
    "text": "How Pam Bondi boosted Trump's election fraud claims in a key swing state  —  In Pennsylvania in 2020, Trump's pick for attorney general pushed baseless claims of widespread voting fraud  —  On the morning of Nov. 4, 2020, former Florida Attorney General Pam Bondi drove northeast from Washington … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/16/pam-bond-attorney-general-2020-pennsylvania/"
  },
  {
    "text": "Steve Bannon Is Already Claiming Trump Can Run Again in 2028  —  WHO'S GONNA STOP ME?  —  The political strategist says the Constitution doesn't count in this case.",
    "url": "https://www.thedailybeast.com/steve-bannon-is-already-claiming-trump-can-run-again-in-2028/"
  },
  {
    "text": "Tax Cuts Take Lead Over Deficit Worries in GOP's Internal Fight  —  Republicans embrace the contentious idea that some of their tax cuts would largely pay for themselves  —  WASHINGTON—Tax cutters are beating deficit hawks in the early phases of the Republican Party's fiscal tug of war.",
    "url": "https://www.wsj.com/politics/policy/republican-tax-cuts-budget-deficit-plan-f9e58e80"
  },
  {
    "text": "Speaker Johnson faces ‘complicated’ decision on crucial Rules Committee chair  —  Speaker Mike Johnson (R-La.) is barreling into a tricky — yet critical — decision over whom to appoint as the next chair of the House Rules Committee, a post that will set the tone for legislating and play … ",
    "url": "https://thehill.com/homenews/house/5039296-speaker-johnson-rules-committee-foxx-roy-fischbach-sessions/"
  },
  {
    "text": "Trump girds for battle with Democrats, Supreme Court over birthright citizenship  —  President-elect Trump, Democratic lawmakers and the Supreme Court are on a collision course over restricting birthright citizenship, which Trump has identified as a top priority for his incoming administration.",
    "url": "https://thehill.com/homenews/senate/5040111-trump-proposal-birthright-citizenship/"
  },
  {
    "text": "His Family Voted to Support Trump's Deportation Plan.  That Includes Him.  —  His friends and family members in Rome, Ga., voted to support mass deportation.  Now he's scrambling to stay in the country.  —  Jaime Cachua with his son Julian.  He fears he will be deported.",
    "url": "https://www.nytimes.com/2024/12/15/us/trump-immigrant-deportations-rome-georgia.html?unlocked_article_code=1.hk4.0wkS.eiVnFWvxDD6j"
  },
  {
    "text": "Trump Allies Fear Watered Down Deportation Efforts  —  President-elect's team is committed to pursuing immigrants who crossed illegally, but is wary about logistical challenges and setting expectations  —  WASHINGTON—Donald Trump ran for president on a bold promise: to carry out the largest mass deportation in U.S. history.",
    "url": "https://www.wsj.com/politics/policy/trump-immigration-deportation-promises-worried-allies-6b78418d?st=dhx3wn&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump's ‘explosive’ economic growth claims are no match for the $36 trillion debt  —  The new president could face even more daunting challenges than his predecessors if he follows through on his tax and tariff pledges.  —  Jeff Bezos, Larry Fink and Donald Trump's Treasury pick Scott Bessent all agree … ",
    "url": "https://www.politico.com/news/2024/12/16/trump-ceos-american-debt-plan-00194362"
  },
  {
    "text": "Bernie Sanders believes Hunter Biden pardon sets a ‘dangerous’ precedent  —  Sanders discusses Biden's legacy, one way he will work with President-elect Trump  —  Sen. Bernie Sanders, I-Vt., had two thoughts about President Biden pardoning his son Hunter Biden after previously saying he would not … ",
    "url": "https://www.foxnews.com/politics/bernie-sanders-believes-hunter-biden-pardon-sets-dangerous-precedent"
  }
]