[
  {
    "text": "Schumer: Vance VP pick helps Democrats  —  “I'll bet President Trump is sitting there, scratching his head, and wondering, ‘Why did I pick this guy?’”  Schumer said.  “The choice may be one of the best things he ever did for Democrats.”  —  Senate Majority Leader Chuck Schumer (D-N.Y.) … ",
    "url": "https://www.politico.com/news/2024/07/28/schumer-vance-vp-pick-helps-democrats-00171535"
  },
  {
    "text": "How Kamala Harris took control of the Democratic Party  —  Party officials and campaign aides raced to flip an entire brand from fading hope to salute emojis.  —  The boss had earned that much.  Vice President Harris approved no discussions.  Campaign advisers did not break ranks in public.",
    "url": "https://www.washingtonpost.com/politics/2024/07/28/kamala-harris-control-democratic-party/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIyMTM5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzIzNTIxNTk5LCJpYXQiOjE3MjIxMzkyMDAsImp0aSI6IjE1MTNhMjQwLWFjYWUtNDczNi05MGZiLTIzMTkxZTgwY2I4MyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA3LzI4L2thbWFsYS1oYXJyaXMtY29udHJvbC1kZW1vY3JhdGljLXBhcnR5LyJ9.g0CkFWIo3hJJ1_NJlUpMLhOv5G28kzmBBv0UeXE_6xQ&itid=gfta"
  },
  {
    "text": "Vance stumps in a reliably Republican part of Minnesota after a rocky start.  —  Democrats are increasingly adopting a line of attack pioneered by Gov. Tim Walz of Minnesota, a top contender to be Kamala Harris's running mate: Donald J. Trump and his Republican allies are “just plain weird.”",
    "url": "https://www.nytimes.com/live/2024/07/28/us/harris-trump-election"
  },
  {
    "text": "Elon Musk Shares Kamala Harris Deepfake  —  The billionaire troll posted a video with altered audio that made it sound like the vice president said she did not “know the first thing about running the country” and is “the ultimate diversity hire”  —  Billionaire Elon Musk shared a deepfake video … ",
    "url": "https://www.rollingstone.com/politics/politics-news/elon-musk-kamala-harris-deepfake-1235069564/"
  },
  {
    "text": "A manipulated video shared by Musk mimics Harris' voice, raising concerns about AI in politics  —  NEW YORK (AP) — A manipulated video that mimics the voice of Vice President Kamala Harris saying things she did not say is raising concerns about the power of artificial intelligence to mislead with Election Day about three months away.",
    "url": "https://apnews.com/article/parody-ad-ai-harris-musk-x-misleading-3a5df582f911a808d34f68b766aa3b8e"
  },
  {
    "text": "JD Vance is faltering in the Midwest, a big problem for the GOP  — When Trump tapped JD Vance as his running mate, the Ohioan's background was a major selling point.  — But new CNN data shows Vance with a double-digit net unfavorable rating across the Midwest.",
    "url": "https://www.businessinsider.com/jd-vance-midwest-presidential-election-gop-trump-2024-7"
  },
  {
    "text": "Buttigieg Tells Fox Viewers that MAGA Is a Cult  —  “We don't have that kind of warped reality on our side,” the Biden transportation secretary said, calling Trump “older and stranger” than he was in 2016  —  Pete Buttigieg offered a dose of reality for viewers on Fox, pointing out the lies and “cult of personality” of Donald Trump.",
    "url": "https://www.rollingstone.com/politics/politics-news/buttigieg-fox-viewers-maga-cult-1235069586/"
  },
  {
    "text": "Venezuela election live updates: Opposition claims victory after Maduro was declared the winner  —  Supporters of President Nicolás Maduro gather at Miraflores Palace in Caracas as Maduro is declared the winner in Venezuela's presidential election amid opposition claims of irregularities.",
    "url": "https://apnews.com/live/venezuela-election-updates-maduro-machado-gonzalez"
  },
  {
    "text": "Buttigieg says voters have transferred their concerns about age to Trump  —  “How could anybody not watch the stuff he's saying, the rambling on the trail, and not be just a little bit concerned?” he said.  —  Secretary of Transportation Pete Buttigieg said Sunday that with incumbent Joe Biden … ",
    "url": "https://www.politico.com/news/2024/07/28/buttigieg-voters-trump-age-00171533"
  },
  {
    "text": "Harris Camp Warns Supporters: Don't Get Duped by ‘Scam PACs’  —  KAMALA HARRIS'S TEAM IS WARNING DONORS not to fall prey to “financial scams” from groups sending email and text messages that suggest they're raising money for the vice president.  —  Those messages came rapidly last week … ",
    "url": "https://www.thebulwark.com/p/harris-camp-warns-of-democratic-scam-pacs"
  },
  {
    "text": "America's New Political War Pits Young Men Against Young Women  —  A majority of men under 30 support former President Trump and Republican control of Congress, a sharp reversal from the 2020 race; young women strongly favor Democrats",
    "url": "https://www.wsj.com/politics/policy/men-women-vote-republican-democrat-election-7f5f726c"
  },
  {
    "text": "Inside the powerful Peter Thiel network that anointed JD Vance  —  A small influential network of right-wing techies orchestrated Vance's rise in Silicon Valley — and then the GOP.  Now the industry stands to gain if he wins the White House.  —  In the weeks before former president Donald … ",
    "url": "https://www.washingtonpost.com/technology/2024/07/28/jd-vance-peter-thiel-donors-big-tech-trump-vp/"
  },
  {
    "text": "How Elon Musk Broke With Biden and the Democrats  —  The split started with a snub at a White House electric-vehicle summit.  Things got worse from there.",
    "url": "https://www.wsj.com/politics/elections/how-elon-musk-broke-with-biden-and-the-democrats-4960b7d8?st=b048xiy2088ceh4"
  },
  {
    "text": "Donald Trump jumps to defend female Secret Service agent who ‘shielded’ him from assassination  —  Donald Trump said the female Secret Agent ‘wanted to take a bullet’ for him  —  BUTLER, Pa. - Former President Trump leaped to the defense of a female Secret Service agent who “shielded” … ",
    "url": "https://www.foxnews.com/us/donald-trump-jumps-defend-female-secret-service-agent-who-shielded-him-from-assassination"
  },
  {
    "text": "Trump gunman planned to create ‘diversion’ with explosives to escape, Mike McCaul says  —  The FBI said last week law enforcement had recovered explosive devices from Thomas Crooks' vehicle.  —  House Foreign Affairs Chair Rep. Michael McCaul (R-Texas) said Sunday that the gunman behind … ",
    "url": "https://www.politico.com/news/2024/07/28/trump-gunman-planned-to-create-diversion-mccaul-00171541"
  }
]