[
  {
    "text": "How each Speaker candidate voted in overturning 2020 election results  —  With nine candidates in the running for Speaker, some Republicans are raising questions over whether their votes on overturning the 2020 election results should be a factor in electing the next leader.",
    "url": "https://thehill.com/homenews/house/4269717-speaker-candidate-votes-2020-election-results-overturn/"
  },
  {
    "text": "GOP speaker chaos: 9 Republicans will battle for top post  —  Each candidate faces the near-impossible task of succeeding in both an internal vote and then a tricky floor vote.  —  The House GOP's enormous speaker field is officially set, with nine Republicans seeking to somehow unify … ",
    "url": "https://www.politico.com/news/2023/10/22/gop-speaker-chaos-republicans-battle-00122918"
  },
  {
    "text": "Gingrich says House GOP poses ‘very real danger’ of electing Speaker, then going ‘back into the same mess’  —  Former House Speaker Newt Gingrich (R-Ga.) warned that the House GOP conference poses a “very real danger” of electing a Speaker and then in a few weeks going “back into the same mess.”",
    "url": "https://thehill.com/homenews/house/4269688-gingrich-house-gop-poses-danger-electing-speaker-then-going-into-same-mess/"
  },
  {
    "text": "House Republicans say the speaker race stalemate is ‘embarrassing’ for the GOP  — House Republicans are deadlocked on who to elect as their next speaker, hampering their ability to govern.  — The previous frontrunner, Rep. Jim Jordan, dropped out of the race on Friday after an internal GOP vote expressed a loss of confidence.",
    "url": "https://www.cnbc.com/2023/10/22/house-republicans-say-the-speaker-race-stalemate-is-embarrassing-.html"
  },
  {
    "text": "If you have nine candidates for Speaker you have no candidates for speaker  —  I would call this the political equivalent of a “let's remember some guys” blog except that you would have had to ever have known who they were to remember them: … Emmer has thus far avoided getting the ultimate kiss … ",
    "url": "https://www.lawyersgunsmoneyblog.com/2023/10/if-you-have-nine-candidates-for-speaker-you-have-no-candidates-for-speaker"
  },
  {
    "text": "A President, a Billionaire and Questions About Access and National Security  —  Anthony Pratt, one of Australia's wealthiest men, made his way into Donald Trump's inner circle with money and flattery.  What he heard there has become of interest to federal prosecutors.",
    "url": "https://www.nytimes.com/2023/10/22/us/politics/anthony-pratt-donald-trump.html"
  },
  {
    "text": "Listen: Billionaire Brags About Trump Sharing Secret Information With Him  —  “I hadn't even heard it.  It hadn't even been on the news yet and [Trump] said, ‘I just bombed Iraq today,’” Australian multibillionaire Anthony Pratt said on a recording aired by 60 Minutes Australia",
    "url": "https://www.rollingstone.com/politics/politics-news/secret-tapes-trump-australian-billionaire-anthony-pratt-1234859957/"
  },
  {
    "text": "Liz Cheney doesn't rule out presidential bid, calls Donald Trump ‘the single most dangerous threat’  —  WASHINGTON — Former Wyoming Republican Rep. Liz Cheney said in an interview that former President Donald Trump is the “single most dangerous threat” the country faces and did not rule out a 2024 presidential bid.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2023/10/22/liz-cheney-2024-donald-trump-threat/71281238007/"
  },
  {
    "text": "Second Aid Convoy Arrives in Gaza as Fears Grow of a Widening Conflict  —  The United Nations said 14 more trucks carried aid into the enclave late Sunday as escalating clashes on Israel's border with Lebanon and violence in the occupied West Bank raised fears the conflict could spill over.",
    "url": "https://www.nytimes.com/live/2023/10/22/world/israel-hamas-war-gaza-news"
  },
  {
    "text": "Jordan's implosion in House speaker bid lays bare GOP civil war  —  The hard-charging tactics during his race to lead the House sour new and established Republican members  —  Congressional bureau chief  —  Rep. Jake Ellzey (R-Tex.) described his Monday meeting with Rep. Jim Jordan as … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/21/jim-jordan-house-speaker/"
  },
  {
    "text": "Manhunt continues for Nashville police chief's son suspected in shooting of 2 Tennessee officers  —  Police identified the suspect as John C. Drake, Jr., 38, who is the son of Metro Nashville Police Department Chief John Drake.  —  LA VERGNE, Tenn. — Police in Tennessee were searching Sunday … ",
    "url": "https://www.nbcnews.com/news/us-news/manhunt-continues-nashville-police-chiefs-son-suspected-shooting-2-ten-rcna121612"
  },
  {
    "text": "Michigan State University ‘deeply sorry’ for Hitler image displayed on video boards before football game  —  Hitler and his birthplace, Austria, were broadcast on video boards as part of a pregame quiz.  —  Michigan State University apologized for images of Adolf Hitler that were displayed … ",
    "url": "https://www.nbcnews.com/news/us-news/michigan-state-university-apologizes-hitler-image-displayed-video-boar-rcna121594"
  },
  {
    "text": "Biden and Netanyahu agree to a ‘continued flow’ of humanitarian aid to Gaza  —  The first two convoys of aid reached Palestinians this weekend, after the border crossing between Egypt and Gaza opened Saturday.  —  President Joe Biden and Israeli Prime Minister Benjamin Netanyahu affirmed … ",
    "url": "https://www.politico.com/news/2023/10/22/biden-netanyahu-continued-flow-humanitarian-aid-00122929"
  },
  {
    "text": "Statement From Secretary of Defense Lloyd J. Austin III on Steps to Increase Force Posture  —  Following detailed discussions with President Biden on recent escalations by Iran and its proxy forces across the Middle East Region, today I directed a series of additional steps to further strengthen … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3564874/statement-from-secretary-of-defense-lloyd-j-austin-iii-on-steps-to-increase-for/"
  },
  {
    "text": "One GOP candidate can defeat Trump.  Clear the field for Haley.  —  Donald Trump won the GOP nomination in 2016 not because he was the choice of most Republican primary voters; he was not.  He won because, in a crowded field, he got more votes than any of his rivals in South Carolina, and then in later-voting states.",
    "url": "https://www.postandcourier.com/opinion/editorials/editorial-one-gop-candidate-can-defeat-trump-clear-the-field-for-haley/article_f805cfde-6d00-11ee-a8e9-f7d028b02e2a.html"
  }
]