[
  {
    "text": "Behind the Curtain: Trump's shock and awe … - Trump named real estate developer Charles Kushner — father of Trump's son-in-law, Jared — as ambassador to France. … - Less than six hours later, Trump announced he picked Kash Patel, one of the hardest of his first-term hardliners, as FBI director.",
    "url": "https://www.axios.com/2024/12/01/trump-cabinet-kash-patel-fbi"
  },
  {
    "text": "John Bolton compares Kash Patel to Soviet secret police leader  —  Former National Security Advisor John Bolton compared Kash Patel, President-elect Trump's nomination for head of FBI, to one of the USSR's most feared secret police chiefs, Lavrentiy Beria.  —  “Trump has nominated Kash Patel … ",
    "url": "https://thehill.com/homenews/sunday-talk-shows/5016380-john-bolton-compares-kash-patel-to-soviet-secret-police-leader/"
  },
  {
    "text": "The Kash Patel Principle  —  Donald Trump has been releasing names of his nominees for the Cabinet and other senior posts in waves.  He began with some relatively conventional choices, and then unloaded one bombshell after another, perhaps in an attempt to paralyze opposition in the Senate … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/kash-patel-principle/680838/?gift=_IXYI0Wrwnxuvm7JZ0fMfLyMalbJhTJ1f4imheld7FU&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "A Second Trump Term Poses a Crucial Test of the Senate's Independence  —  President-elect Donald J. Trump is threatening to challenge the institution's historic role, and the Constitution, with his prospective nominees and threats to push the boundaries of executive authority.",
    "url": "https://www.nytimes.com/2024/12/01/us/politics/trump-senate-independence.html"
  },
  {
    "text": "Lawmakers express doubt over Trump plan to replace FBI's Christopher Wray  —  On Sunday, members of Congress on both sides of the aisle said the FBI director, whom Trump appointed in 2017, should be allowed to serve out his 10-year term.  —  President-elect Donald Trump's announcement … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/01/kash-patel-fbi-lawmakers/"
  },
  {
    "text": "How Kash Patel, Trump's FBI Pick, Embraced the Unhinged QAnon Movement  —  In the middle of the Thanksgiving holiday stretch, Donald Trump announced what might be his most extreme and controversial appointment yet: Kash Patel for FBI director.  There are many reasons why this decision is outrageous.",
    "url": "https://www.motherjones.com/politics/2024/12/kash-patel-qanon-trump-fbi/"
  },
  {
    "text": "Five Things to Know About Kash Patel, Trump's Pick to Lead the F.B.I.  —  President-elect Donald J. Trump has long seen his bombastic national security operative as a political “enforcer.”  But former colleagues question his fitness for the job.  —  Kash Patel, President-elect Donald J. Trump's choice … ",
    "url": "https://www.nytimes.com/2024/11/30/us/politics/kash-patel.html?unlocked_article_code=1.eE4.kmdG.P_w0bxnZZvkT&smid=url-share"
  },
  {
    "text": "Cheryl Hines sells products with naked RFK Jr. showering behind her  —  Actress Cheryl Hines, the wife of former independent presidential candidate Robert F. Kennedy Jr., posted a video promoting her beauty products featuring her husband showering half-naked in the background.",
    "url": "https://thehill.com/policy/healthcare/5016353-cheryl-hines-video-kennedy-shower/"
  },
  {
    "text": "Trump's Next Term Could See America's First True Oligarchs, Warns Democracy Activist Garry Kasparov  —  Elon Musk's DOGE plan could mix public and private interests in a way previously not seen in American politics, the former world chess champion said.  —  LOADING",
    "url": "https://www.huffpost.com/entry/trump-musk-america-oligarchs_n_6746b6efe4b0800c73f710a5"
  },
  {
    "text": "Wisconsin Democratic Chair Says He Is the One to Revive a Distressed Party  —  Ben Wikler, who has led the Wisconsin Democratic Party since 2019, announced a bid to be national party chair with a platform to “unite, fight, win.”  —  Ben Wikler, the Wisconsin Democratic chairman … ",
    "url": "https://www.nytimes.com/2024/12/01/us/politics/ben-wikler-democratic-national-committee-wisconsin.html?unlocked_article_code=1.eE4.gNV6.LMZEyttmVIQL&smid=url-share"
  },
  {
    "text": "Democrats Face an Existential Crisis on X  —  Conversations with a dozen insiders point to a party that is unsure about whether to leave or engage with the increasingly MAGA platform.  —  Two days after the election, Patrick Dillon, a longtime Democratic strategist and current Biden administration official … ",
    "url": "https://www.politico.com/news/magazine/2024/11/30/dems-leave-twitter-musk-00191755"
  },
  {
    "text": "Putin signs off record Russian defense spending as top EU officials visit Kyiv  —  Russian President Vladimir Putin approved budget plans, raising 2025 military spending to record levels as Moscow seeks to prevail in the war in Ukraine.  Around 32.5% of the budget posted on a government website Sunday … ",
    "url": "https://apnews.com/article/russia-ukraine-budget-defense-spending-putin-drone-3a1a73c559b250ec26190edd9332100c"
  },
  {
    "text": "Social democrats gain and incumbents are punished in Iceland's election  —  Voters in Iceland appeared to have rejected incumbent parties in a parliamentary election, partial results showed Sunday, with a center-left party leading the contest in the North Atlantic island nation.",
    "url": "https://apnews.com/article/iceland-election-results-social-democrats-989773ec8a24cddef7ba78d5aa933df2"
  },
  {
    "text": "Trump and His Team Are ‘Laughing’ at Biden's Commitment to Decorum  —  Biden called Trump a fascist.  Now his White House is ensuring an orderly transfer of power — and staging photo ops with the president-elect  —  Donald Trump and his incoming administration officials think Joe Biden and Kamala Harris are suckers.",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-biden-harris-transfer-power-laughing-1235188028/"
  },
  {
    "text": "Trump and allies blur the lines between politician and influencer  —  The president-elect and some in his proposed Cabinet are adopting influencer tactics to hawk products, boost political points and promote their personal brands.  —  A few weeks before he was named to lead the Department … ",
    "url": "https://www.washingtonpost.com/technology/2024/12/01/trump-social-media-influencer-cabinet/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzMDI5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0NDExNTk5LCJpYXQiOjE3MzMwMjkyMDAsImp0aSI6IjRlNTU5ZmIyLWY2MjctNDc4ZC1hNjhmLTQ1MzllODkyMzU5MiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMTIvMDEvdHJ1bXAtc29jaWFsLW1lZGlhLWluZmx1ZW5jZXItY2FiaW5ldC8ifQ.2tC92jjg3M6Pnbrd1DMKkSWB8f2Qd46W0cnZZSEZn7M&itid=gfta"
  },
  {
    "text": "The congressional battlegrounds were set.  Then Trump changed everything.  —  “There's definitely a realignment going on in American politics,” said Dan Conston, the president of the Congressional Leadership Fund.  —  Donald Trump's surge among Latino voters is upending the American political map.",
    "url": "https://www.politico.com/news/2024/12/01/trump-latino-voters-surge-00191902"
  },
  {
    "text": "Ex-Dem Rep Tim Ryan Warns On MSNBC His Own Party ‘Is Toxic’ To Voters: ‘What Are We Doing?’  —  Former Rep. Tim Ryan (D-OH) told MSNBC that Democrats need a complete “rebrand” and to find common ground with MAGA figures like Elon Musk.  —  Ryan joined MSNBC's The Weekend on Saturday and offered … ",
    "url": "https://www.mediaite.com/tv/ex-dem-rep-tim-ryan-warns-on-msnbc-his-own-party-is-toxic-to-voters-what-are-we-doing/"
  }
]