[
  {
    "text": "Two hours after mocking Arizona's Attorney General, Rudy Giuliani is served at his own birthday party  —  The announcement came shortly after Giuliani posted a photo taunting the Arizona AG  —  PHOENIX — Arizona's Democratic Attorney General Kris Mayes on Friday announced that Rudy Giuliani … ",
    "url": "https://www.nbcnews.com/politics/politics-news/two-hours-mocking-arizonas-attorney-general-rudy-giuliani-served-birth-rcna152905"
  },
  {
    "text": "Rudy Giuliani served with Arizona ‘fake electors’ indictment during 80th birthday bash in Palm Beach  —  Rudy Giuliani's 80th birthday bash in Palm Beach was stormed “like it was Normandy” as the former New York City mayor was served with notice of his Arizona indictment, sources told The Post.",
    "url": "https://nypost.com/2024/05/18/us-news/rudy-giuliani-served-with-arizona-fake-electors-indictment-during-80th-birthday-bash-in-palm-beach/"
  },
  {
    "text": "Rudy Giuliani served Arizona indictment same day as his 80th birthday party … - She also posted an X photo from Giuliani Friday.  — “If Arizona authorities can't find me by tomorrow morning: 1. … - Roger Stone and Steve Bannon, strategists for the former president, were also at the party, per ABC15.",
    "url": "https://www.axios.com/2024/05/18/rudy-giuliani-indicted-arizona-election-trump"
  },
  {
    "text": "Playbook: Trump — and Fox — strike back in the debate wars  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  HAPPY BIRTHDAY RUDY — “Rudy Giuliani served with Arizona ‘fake electors’ indictment during 80th birthday bash in Palm Beach,” … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/05/18/trump-and-fox-strike-back-in-the-debate-wars-00158773"
  },
  {
    "text": "‘Never Trump?’  ‘Never Biden’ voters might loom larger.  —  Biden's ceiling of support is actually lower than Trump's right now.  It's a stark reversal from 2020 — with major implications.  —  Certain Democrats trying to cope with President Biden's continually underwhelming 2024 poll numbers share … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/18/never-trump-never-biden-voters-might-loom-larger/"
  },
  {
    "text": "AOC Reveals Darker Intentions Behind MTG Hearing Chaos  —  Representative Alexandria Ocasio-Cortez revealed Friday that the GOP-led House Oversight Committee abdicated normal procedures after the panel devolved into mudslinging, sparked by a characteristically bizarre outburst by Marjorie Taylor Greene.",
    "url": "https://newrepublic.com/post/181718/aoc-darker-intentions-mtg-hearing-chaos"
  },
  {
    "text": "Unpacking the presidential money machines  —  A POLITICO analysis of campaign finance filings shows clear contrasts between Trump's and Biden's sprawling political operations.  —  Donald Trump's political operation had a startling weakness as the general election kicked off this year … ",
    "url": "https://www.politico.com/news/2024/05/18/trump-biden-2024-campaign-spending-00158758"
  },
  {
    "text": "Trump Plans to Reward Peter Navarro for Going to Jail Instead of Being a ‘Rat’  —  Trump wants to pardon Peter Navarro and give him a job after he went to jail for refusing to comply with the Jan. 6 congressional investigation  —  FORMER TRUMP WHITE House aide Peter Navarro was sent … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-peter-navarro-reward-jail-rat-1235023334/"
  },
  {
    "text": "Rich, Loyal and Good Looking: Why Little-Known Doug Burgum Is in Trump's VP Mix  —  The presumptive Republican nominee likes North Dakota's governor—and his rich friends  —  WASHINGTON—As court adjourned for lunch Tuesday in Donald Trump's hush-money trial, the former president's lawyers … ",
    "url": "https://www.wsj.com/politics/elections/doug-burgum-trump-vp-shortlist-e41a2b45"
  },
  {
    "text": "Georgia president vetoes ‘foreign agent’ law  —  Governing Georgian Dream party can still force the controversial legislation through parliament.  —  TBILISI — The Georgian government's plans to brand Western-funded NGOs, media outlets and campaign groups as “foreign agents” … ",
    "url": "https://www.politico.eu/article/georgia-president-zurabishvili-vetoes-foreign-agent-law-russia-eu/"
  },
  {
    "text": "Trump is eager to prove Florida is his kingdom — by anointing DeSantis' successor  —  Trump famously helped Gov. Ron DeSantis six years ago, and seems itching to reprise the role of kingmaker after his own election.  —  MIAMI — Ron DeSantis has more than two years left as Florida governor.",
    "url": "https://www.politico.com/news/2024/05/18/trump-desantis-florida-governor-2026-00158501"
  },
  {
    "text": "Biden's plan to admit Gazans to US could backfire: ‘Brainwashed by Hamas,’ expert warns  —  JERUSALEM — The White House is considering the resettlement of Palestinians from the Gaza Strip to the United States, sparking warnings from experts about the potential for terrorism and failed assimilation.",
    "url": "https://www.foxnews.com/world/bidens-plan-admit-gazans-us-could-backfire-brainwashed-hamas-expert-warns"
  },
  {
    "text": "Biden Likens MAGA Movement to Segregationists in Speech to NAACP  —  President Biden drew a parallel on Friday between Donald Trump “and his MAGA Republican allies” and segregationists in the 1950s who tried to prevent Black and white Americans from going to school together.",
    "url": "https://time.com/6979631/biden-likens-maga-to-segregationists/"
  },
  {
    "text": "Bridget and Christian Ziegler ‘Prowled’ Florida Bars for Women, Police Memo Says  —  PREDATORY  —  “Don't come home until your d*ck is wet,” Moms For Liberty founder Bridget Ziegler allegedly told her husband.  —  Newly released documents say Moms For Liberty co-founder Bridget Ziegler … ",
    "url": "https://www.thedailybeast.com/bridget-and-christian-ziegler-prowled-florida-bars-in-search-of-women-to-have-sex-with-docs"
  }
]