[
  {
    "text": "Here's Why Mike Johnson Is More Dangerous Than Donald Trump  —  The former president only cares about himself.  The new Speaker of the House actually wants to make America a Christian theocracy. … The most dangerous movement in American politics today is not Trumpism.  It is Christofascism.",
    "url": "https://www.thedailybeast.com/heres-why-mike-johnson-is-more-dangerous-than-donald-trump"
  },
  {
    "text": "Republican Speaker Nominee Mike Johnson Has a Plan to Avoid a November Shutdown  —  House Republican speaker nominee Mike Johnson is working to convince ultraconservatives to avert a Nov. 18 government shutdown, a signal that even hardliners in the GOP may be willing to compromise on a short-term spending deal.",
    "url": "https://www.bloomberg.com/news/articles/2023-10-25/gop-speaker-nominee-johnson-has-plan-to-avoid-november-shutdown"
  },
  {
    "text": "Before Mike Johnson Was Speaker, He Was Blaming Abortion for School Shootings  —  What is it about Representative Mike Johnson that ended Republicans' spasms of disunity, electing him Speaker of the House on Wednesday?  The initial response was befuddlement, a collective who?",
    "url": "https://nymag.com/intelligencer/2023/10/mike-johnson-abortion-school-shootings.html"
  },
  {
    "text": "New House Speaker Blamed School Shootings on Teaching Evolution and Abortion  —  Mike Johnson is a Christian nationalist with extreme views on guns, reproductive rights, and more.  He's now second in line for the presidency … The Louisiana Republican's record on guns has come under scrutiny … ",
    "url": "https://www.rollingstone.com/politics/politics-news/mike-johnson-blamed-shootings-teaching-evolution-abortion-1234863223/"
  },
  {
    "text": "Televise Trump's federal trials?  Judicial panel says its hands are tied  —  A courts committee says it lacks authority to modify a broadcasting ban in time for the historic criminal cases against the former president.  —  A federal judicial panel has turned down a bid to allow live television coverage … ",
    "url": "https://www.politico.com/news/2023/10/26/trump-federal-trials-televise-00123801"
  },
  {
    "text": "Family Reveals Suspected Gunman's Link to Maine Massacre Sites  —  “He just has to reach out and do the right thing,” Robert Card's sister-in-law told The Daily Beast. … The family of Robert Card—who is suspected of killing 18 people in double mass shootings in Maine on Wednesday night … ",
    "url": "https://www.thedailybeast.com/family-reveals-suspected-gunman-robert-cards-link-to-maine-massacre-sites"
  },
  {
    "text": "Robert Card: What we know about Maine shooting person of interest  —  Maine police have identified a person of interest in the mass shootings across the state Wednesday night that left at least 18 dead and dozens injured.  —  The Lewiston Maine Police Department identified 40-year-old Robert Card as a … ",
    "url": "https://www.washingtonexaminer.com/news/robert-card-maine-shooting-person-of-interest"
  },
  {
    "text": "New House Speaker Thinks Creationist Museum Is ‘Pointing People To The Truth’  —  An ark replica with dinosaurs “is one way to bring people to this recognition ... that what we read in the Bible are actual historical events,” Mike Johnson said.  —  Before arriving in Washington less than a decade ago … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-young-earth-creationist_n_653adc81e4b0d69ae7068a0b"
  },
  {
    "text": "Rep. Jared Golden reverses on assault weapons ban  —  The Maine Democrat says he must take responsibility following the mass shooting in his state and now opposes the weapons.  —  Rep. Jared Golden (D-Maine), a conservative Democrat, reversed his previously held opposition and said on Thursday … ",
    "url": "https://www.politico.com/news/2023/10/26/golden-reverses-on-assault-weapons-ban-00123899"
  },
  {
    "text": "DeSantis says he's sending weapons to Israel in move that could bolster him in the GOP primary  —  Florida Gov. Ron DeSantis said Thursday he's arranged to send drones, weapons, and ammunition to Israel as it prepares for an incursion of Gaza in response to Hamas' attack.",
    "url": "https://apnews.com/article/desantis-drones-weapons-shipment-israel-gaza-3fedd0b434552bad313f9109379df071"
  },
  {
    "text": "Senate Voted to Let Vets With Mental Issues Keep Guns Hours Before Maine Shooting  —  Five senators who caucus with Democrats joined Republicans in voting to adopt the amendment  —  ROBERT CARD, AN Army reservist with a history of mental health issues, is suspected of killing at least 18 people … ",
    "url": "https://www.rollingstone.com/politics/politics-news/senate-adopts-amendment-veterans-mental-issues-guns-1234863402/"
  },
  {
    "text": "Charlottesville's Lee statue meets its end, in a 2,250-degree furnace  —  Melted down in secret, the divisive Confederate monument will be turned into a new piece of public art … SOMEWHERE IN THE U.S. SOUTH — It was a choice to melt down Robert E. Lee.  But it would have been a choice to keep him intact, too.",
    "url": "https://www.washingtonpost.com/dc-md-va/interactive/2023/civil-war-monument-melting-robert-e-lee-confederate/"
  },
  {
    "text": "U.S., Qatar to revisit Doha's ties to Hamas after Gaza hostage crisis  —  The agreement strives to balance the Biden administration's goal of rescuing as many captives as possible with its desire to isolate the militants after their rampage in Israel  —  The United States and Qatar have agreed … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/26/qatar-hamas-hostage-negotiations/"
  },
  {
    "text": "And the Winner Is...  “If you don't think that moving from Kevin McCarthy to MAGA Mike Johnson shows the ascendance of this movement and where the power in the Republican Party truly lies, then you're not paying attention,” — Matt Gaetz to Steve Bannon Wednesday morning.  —  And of course, he was right.",
    "url": "https://plus.thebulwark.com/p/and-the-winner-is"
  },
  {
    "text": "U.S. Department of State Commemorates Intersex Awareness Day.  No, Really.  —  Americans are being held hostage by Hamas.  Israel is fighting for its existence.  Ukraine is fighting Russia for its sovereignty.  The United States is being overrun by unvetted illegal immigrants who are showing up on the terror watch list.",
    "url": "https://hotair.com/karen-townsend/2023/10/26/u-s-department-of-state-commemorates-intersex-awareness-day-no-really-n587959"
  },
  {
    "text": "Larry Elder drops out of 2024 GOP primary, backs Trump  —  Republican presidential candidate Larry Elder is suspending his 2024 campaign for the White House and has endorsed former President Trump for the party nominee.  —  “As I look at the path forward, and after careful consideration … ",
    "url": "https://thehill.com/homenews/campaign/4248455-larry-elder-2024-gop-primary-donald-trump/"
  },
  {
    "text": "Donald Trump Jr. goes after Robert F. Kennedy Jr. in Iowa appearance  —  The former president's son spoke in Iowa Thursday, with less than three months to go until the first-in-the-nation caucuses.  —  URBANDALE, Iowa — It was junior-on-junior warfare at former President Donald Trump's … ",
    "url": "https://www.nbcnews.com/politics/2024-election/donald-trump-jr-goes-robert-f-kennedy-jr-iowa-appearance-rcna122421"
  },
  {
    "text": "White House slams ‘grotesque’ displays of antisemitism on college campuses  —  The White House calls out the “grotesque” and “antisemitic” actions of students protesting against Israel on American college campuses since the outbreak of the Gaza war.  —  “Amidst the rise in poisonous … ",
    "url": "https://www.timesofisrael.com/liveblog_entry/white-house-slams-grotesque-antisemitism-on-college-campuses-by-pro-palestinian-groups/"
  }
]