[
  {
    "text": "Liz Cheney Tells George W. Bush to Endorse Kamala Harris: 'It's Time'  —  TICK TOCK  —  The Republican publicly urged Bush to speak out in the wake of his daughter's shock endorsement.  —  Liz Cheney is calling on George W. Bush to make his voice heard on the “danger that Donald Trump poses.”",
    "url": "https://www.thedailybeast.com/liz-cheney-tells-george-w-bush-to-endorse-kamala-harris-its-time/"
  },
  {
    "text": "Arizona's top prosecutor investigating Trump's comments about Cheney as possible death threat  —  During his Glendale appearance, Trump suggested his Republican critic should face ‘nine barrels shooting at her.’  —  PHOENIX — Arizona's top prosecutor tells 12News she is investigating whether … ",
    "url": "https://www.12news.com/article/news/politics/elections/arizona-top-prosecutor-kris-investigating-trumps-comments-about-cheney-possible-death-threat/75-91f8b734-06eb-4aeb-a633-89be0df7c4c4"
  },
  {
    "text": "How Risky Is a Trump Second Term?  —  He'd slow the left's coercive march, but his policies are likely to be a jump ball. … Unlimited access across all platforms and devices.",
    "url": "https://www.wsj.com/opinion/donald-trump-candidacy-2024-election-kamala-harris-f8f99a69"
  },
  {
    "text": "So, Can We Trust the Polls?  —  Recent changes add up to a case for cautious optimism on better accuracy, but that's far from a guarantee.  —  The polls underestimated Donald J. Trump in 2016.  —  They underestimated him again in 2020.  —  So can we trust the polls this time?",
    "url": "https://www.nytimes.com/2024/11/01/upshot/so-can-we-trust-the-polls.html"
  },
  {
    "text": "Election guru Nate Silver accuses pollsters of putting ‘finger on the scale,’ lying to keep presidential race close  —  Polling guru Nate Silver lashed out at other survey junkies in his field for “cheating” in the final stretch of the 2024 presidential election — accusing them of recycling … ",
    "url": "https://nypost.com/2024/11/01/us-news/election-guru-nate-silver-accuses-pollsters-of-putting-finger-on-the-scale-lying-to-keep-presidential-race-close/"
  },
  {
    "text": "Hugh Hewitt quits Washington Post after storming off livestream talk over dispute with liberal columnists: 'I won't come back'  —  Conservative radio host Hugh Hewitt resigned from the Washington Post after he stormed off a livestreamed discussion on Friday amid a dispute … ",
    "url": "https://nypost.com/2024/11/01/media/hugh-hewitt-quits-washington-post-after-storming-off-broadcast/"
  },
  {
    "text": "Longtime Washington Post columnist Hugh Hewitt quits newspaper  —  Hewitt quit after walking off newspaper's ‘Washington Post Live’ show  —  Longtime Washington Post columnist Hugh Hewitt quit the newspaper on Friday, he told Fox News Digital.  —  Hewitt, a conservative who hosts … ",
    "url": "https://www.foxnews.com/media/longtime-washington-post-columnist-hugh-hewitt-quits-newspaper-after-seven-year-run"
  },
  {
    "text": "Hugh Hewitt resigns from Washington Post after storming out of live interview  —  Hewitt abruptly left a live broadcast of the Post's show “First Look,” leaving the host and his fellow guest stunned.  —  Conservative radio host Hugh Hewitt resigned Friday from his columnist position at The Washington Post … ",
    "url": "https://www.politico.com/news/2024/11/01/hugh-hewitt-washington-post-00186778"
  },
  {
    "text": "Johnson leans on Trump in frantic push to save House majority  —  It's been two years of a chaotic GOP-led House.  But this time, Speaker Mike Johnson insists, things will be different.  —  As he barnstorms through blue districts central to the fight for the House, Johnson is seeking … ",
    "url": "https://www.cnn.com/2024/11/01/politics/johnson-trump-house-elections-agenda/"
  },
  {
    "text": "Elon Musk's Machine for Fascism: A One-Stop Shop for Disinformation and Violence  —  Just over a year ago, I described how Twitter had been used as a way to sow false claims in support of Trump in 2016 and 2020.  —  I described how, in 2016, trolls professionalized their efforts … ",
    "url": "https://www.emptywheel.net/2024/11/01/elon-musks-machine-for-fascism-a-one-stop-shop-for-disinformation-and-violence/"
  },
  {
    "text": "A Pregnant Teenager Died After Trying to Get Care in Three Visits to Texas Emergency Rooms  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Candace Fails screamed for someone in the Texas hospital to help her pregnant daughter.",
    "url": "https://www.propublica.org/article/nevaeh-crain-death-texas-abortion-ban-emtala"
  },
  {
    "text": "Jeffrey Epstein details close relationship with Trump in newly released tapes  —  Recordings from 2017 reveal Epstein talking for some ‘100 hours’ about the ex-president, journalist Michael Wolff says  —  A New York author and journalist has released audio tapes that appear to detail … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/01/trump-jeffrey-epstein-tapes"
  },
  {
    "text": "An Idaho health department isn't allowed to give COVID-19 vaccines anymore.  Experts say it's a first  —  A regional public health department in Idaho is no longer providing COVID-19 vaccines to residents in six counties after a narrow decision by its board.",
    "url": "https://apnews.com/article/covid19-vaccine-public-health-idaho-76f1c29bf3f07a2c029175bf6c2180c4"
  },
  {
    "text": "European Greens ask Jill Stein to stand down and endorse Kamala Harris  —  US Green party leader urged to withdraw from presidential race to prevent Donald Trump victory  —  A coalition of European Greens have urged the US Green party's nominee, Jill Stein, to pull out of next week's election … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/01/european-greens-ask-jill-stein-to-stand-down-and-endorse-kamala-harris"
  },
  {
    "text": "Some Maga men seem to think women don't have rights - starting with their wives  —  The 2024 election is in part about whether women can be free and equal citizens of this republic.  Right now too many cannot  —  This week, the fundamentalist Christian pastor Dale Partridge argued in a series … ",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/01/maga-trump-men-supporters-womens-rights"
  },
  {
    "text": "Texas hospitals must now ask patients whether they're in the US legally.  Here's how it works  —  Texas hospitals must ask patients starting Friday whether they are in the U.S. legally and track the cost of treating people without legal status following an order by Republican Gov. Greg Abbott … ",
    "url": "https://apnews.com/article/texas-immigration-hospital-health-care-abbott-florida-aeee92d7515a18b492c737b3657569ab"
  },
  {
    "text": "What we know about deadly Orlando mass shooting  —  A 17-year-old suspect could be charged as an adult after allegedly shooting at least eight people in downtown Orlando as Halloween celebrations continued into early Friday morning.  CBS News' Manuel Bojorquez reports.",
    "url": "https://www.cbsnews.com/video/what-we-know-about-deadly-orlando-mass-shooting/"
  },
  {
    "text": "When You Thought He Couldn't Sink Lower  —  Donald Trump's two strongest personality traits each had a moment on the campaign trail yesterday.  —  At a rally in Albuquerque, New Mexico, the buffoon: “I'm here for one very simple reason.  I like you very much, and it's good for my credentials with the Hispanic and Latino community.”",
    "url": "https://www.thebulwark.com/p/when-you-thought-he-couldnt-sink"
  },
  {
    "text": "Float in Pennsylvania parade had person in chains resembling Harris  —  A float at a Halloween parade in Pennsylvania is sparking sharp criticism, as many called its depictions of former President Trump and Vice President Harris “racist and offensive.”  —  Several photos and videos circulating … ",
    "url": "https://thehill.com/homenews/race-politics/4966078-racist-offensive-halloween-parade/"
  },
  {
    "text": "Trump on RFK, Jr.: 'He's going to have a big role in health care'  —  Donald Trump said Friday that if he wins the presidency, Robert F. Kennedy Jr. will “have a big role in health care.”  “He's going to have a big role in health care, a very big role.  He knows it better than anybody,” … ",
    "url": "https://www.politico.com/live-updates/2024/11/01/2024-elections-live-coverage-updates-analysis/trump-rfk-jr-health-care-vaccines-00186837"
  },
  {
    "text": "FBI links video falsely depicting voter fraud in Georgia to ‘Russian influence actors’  —  A video purporting to depict voter fraud in Georgia is fake and the work of “Russian influence actors,” U.S. intelligence officials said Friday as they warned that foreign efforts to undermine faith … ",
    "url": "https://apnews.com/article/fbi-russia-georgia-fraud-disinformation-eebea4ab200682ccd3e97fb9f164e6ca"
  },
  {
    "text": "Elon Musk $1 million voter lottery suit sent back to state court … A federal judge in Pennsylvania on Friday sent back to state court a lawsuit against Elon Musk and his political action committee over their $1 million daily giveaway to voters in swing states.",
    "url": "https://www.cnbc.com/2024/11/01/elon-musk-1-million-voter-lottery-suit-sent-back-to-state-court.html"
  },
  {
    "text": "Shifting $677m from the banks to the people, every year, forever (permalink)  —  “Switching costs” are one of the great underappreciated evils in our world: the more it costs you to change from one product or service to another, the worse the vendor, provider, or service you're using today can treat you without risking your business.",
    "url": "https://pluralistic.net/2024/11/01/bankshot/#personal-financial-data-rights"
  },
  {
    "text": "A Calif. property manager said he voted for Trump 6 times.  He's being investigated.  —  The man claimed online that he used his position to fill out 4 ballots that were mailed to tenants who had moved  —  A property manager in Redding was reportedly fired over claims that he used his position … ",
    "url": "https://www.sfgate.com/politics/article/california-man-says-he-voted-for-trump-6-times-19878211.php"
  },
  {
    "text": "‘All hell has broken loose’: Inside Elon Musk's high-stakes pro-Trump door-knocking effort  —  More than a half-dozen operatives and canvassers connected to America PAC described an inordinate number of suspect entries and having to canvass during Hurricane Helene.",
    "url": "https://www.nbcnews.com/politics/2024-election/elon-musks-high-stakes-trump-door-knocking-effort-america-pac-rcna176255?taid=6724d0249f2d880001f6fdb4"
  }
]