[
  {
    "text": "Liz Cheney Nukes the Supreme Court Over Trump Delay—and Hands Dems a Weapon  —  In the wake of the Supreme Court agreeing to hear Donald Trump's demand for absolute immunity from prosecution—potentially delaying his insurrection-related trial until after the election—Democrats … ",
    "url": "https://newrepublic.com/article/179438/liz-cheney-supreme-court-trump-trial-delay-dems-weapon"
  },
  {
    "text": "Donald Trump Says Local Police Will Play Key Role In His Mass Deportation Plan  —  The front-runner in the Republican presidential primary contest said he would give officers immunity to carry out his plan.  —  LOADING  —  Former President Donald Trump on Thursday suggested that local police … ",
    "url": "https://www.huffpost.com/entry/trump-mass-deportation-local-police_n_65e1df88e4b013678e14f39f"
  },
  {
    "text": "Joe Biden should hope Trump wins his immunity case  —  The Supreme Court announced Wednesday that it will hear former President Donald Trump's appeal in his Jan. 6 criminal case arguing that he has immunity from prosecution for his actions during his time as president.",
    "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/2896458/joe-biden-should-hope-trump-wins-his-immunity-case/"
  },
  {
    "text": "Nikki Haley calls for all Trump legal cases to be ‘dealt with’ before November  —  The Republican presidential candidate's comments came in an interview with NBC News' “Meet the Press” moderator Kristen Welker in Virginia.  —  Republican presidential candidate Nikki Haley … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-calls-trump-legal-cases-dealt-november-rcna141276"
  },
  {
    "text": "We're Going To Need More Coffee  —  The legal landscape in three of the four criminal cases against Trump continues to shift in his favor this week, following the Supreme Court's decision to hear the presidential immunity appeal in the D.C. election interference case, creating at least a two-month delay for Trump.",
    "url": "https://joycevance.substack.com/p/were-going-to-need-more-coffee"
  },
  {
    "text": "CDC officially drops five-day covid isolation guidelines  —  Americans who test positive for the coronavirus no longer need to routinely stay home from work and school for five days under new guidance released Friday by the Centers for Disease Control and Prevention.",
    "url": "https://www.washingtonpost.com/health/2024/03/01/new-cdc-covid-isolation-guidelines/"
  },
  {
    "text": "Thousands of millionaires haven't filed tax returns for years, IRS says  —  About 125,000 notices will be sent to high-income earners, including 25,000 people with income more than $1 million, the tax agency said  —  Thousands of high-income earners have not filed tax returns for several years … ",
    "url": "https://www.washingtonpost.com/business/2024/02/29/tax-returns-irs-millionaires/"
  },
  {
    "text": "Trump Has One Week To Pay $83.3 Million To E. Jean Carroll—And She's Expressing ‘Very Serious Concerns’  —  Former President Donald Trump's scramble to cover millions in legal fines could start to come to a head next week, as the ex-president has only until next weekend to pay the $83.3 million verdict … ",
    "url": "https://www.forbes.com/sites/alisondurkee/2024/03/01/trump-has-one-week-to-pay-833-million-to-e-jean-carroll-and-shes-expressing-very-strong-concerns/"
  },
  {
    "text": "Hunter Biden's point-by-point rebuttal of allegations against his father  —  It has been abundantly clear for months that the House Republican case suggesting that President Biden was corruptly involved in his son Hunter's business engagements was a function of frenzied cherry-picking.",
    "url": "https://www.washingtonpost.com/politics/2024/03/01/hunter-biden-business-rebuttal/"
  },
  {
    "text": "Garvey now in statistical tie with Schiff in California Senate race: Poll  —  Rep. Adam Schiff (D-Calif.) and Republican candidate Steve Garvey are now in a statistical tie in California's nonpartisan Senate primary, polling released Friday shows.  —  The poll from the Institute of Governmental Studies … ",
    "url": "https://thehill.com/homenews/campaign/4500747-garvey-now-in-statistical-tie-with-schiff-in-california-senate-race-poll/"
  },
  {
    "text": "CVS and Walgreens Will Begin Selling Abortion Pills This Month  —  The pill mifepristone will be available with a prescription at pharmacy counters in a few states to start.  —  The two largest pharmacy chains in the United States will start dispensing the abortion pill mifepristone this month … ",
    "url": "https://www.nytimes.com/2024/03/01/health/abortion-pills-cvs-walgreens.html"
  },
  {
    "text": "The private chats and chance encounters that shape Joe Biden's thinking  —  After conversations with his grandchildren, fellow churchgoers and Delaware neighbors, the president brings their worries to the Oval Office  —  In the early months of his presidency, as the pandemic dragged … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/01/how-biden-leads-gets-information/"
  },
  {
    "text": "Haley rules out a No Labels bid for president … - Not so, Haley said Friday at a roundtable with journalists.  — “If I were to do No Labels, that would require a Democrat vice president,” Haley said.  — “I can't do what I want to do as president with a Democrat vice president.”",
    "url": "https://www.axios.com/2024/03/01/haley-rules-out-no-labels-president"
  },
  {
    "text": "Fox News guest decrying “migrant crime” previously arrested after getting violent over a grilled cheese sandwich he deemed too cheesy  —  On February 28, Fox News host Jesse Watters hosted “James Lee” on his show to discuss the murder of Laken Riley on the campus of the University of Georgia.",
    "url": "https://www.mediamatters.org/jesse-watters/fox-news-guest-decrying-migrant-crime-previously-arrested-after-getting-violent-over"
  },
  {
    "text": "“I Don't Know If Most People Even Know What Party Is In The Senate Majority”  —  AOC explains the value of accountability, excoriates Senate Democratic leaders for shirking oversight obligations, and lays out a vision for a more fearless, effective party  —  If you've been following the news recently … ",
    "url": "https://www.offmessage.net/p/aoc-oversight-senate-democrats"
  },
  {
    "text": "Arizona's new voting laws that require proof of citizenship are not discriminatory, a US judge rules  —  PHOENIX (AP) — A federal judge is upholding provisions of new Arizona laws that would require counties to verify the status of registered voters who haven't provided proof of U.S. citizenship … ",
    "url": "https://apnews.com/article/arizona-voting-laws-citizenship-proof-50dafd68f8dd4af5cf669afa62efdf19"
  },
  {
    "text": "GOP's post-Roe peril spreads like wildfire  —  Republicans are trapped in a political minefield over reproductive rights, paralyzed in fear that their vulnerabilities on abortion and in-vitro fertilization (IVF) could hand Democrats the 2024 election.",
    "url": "https://www.axios.com/2024/03/01/republicans-reproductive-rights-2024-election"
  },
  {
    "text": "Journalist Catherine Herridge held in contempt for not revealing source  —  The veteran correspondent for CBS and Fox News was ordered to pay $800 a day in a case that had triggered alarm for press advocates  —  In a case that has worried press advocates, veteran journalist Catherine Herridge … ",
    "url": "https://www.washingtonpost.com/style/media/2024/02/29/catherine-herridge-held-contempt-cbs-fox-journalist/"
  },
  {
    "text": "Fox News' “migrant crime” hysteria is a sign of GOP weakness  —  When you've got nothing else, run on hate. … The Republican Party wanted to run a 2024 election campaign on inflation and the economy.  That made some sense in June 2022, when inflation was at a 40-year high of 9.1 percent.",
    "url": "https://www.publicnotice.co/p/fox-news-migrant-crime-hysteria-trump-explained"
  }
]