[
  {
    "text": "As Floods Hit, Key Roles Were Vacant at Weather Service Offices in Texas  —  Some experts say staff shortages might have complicated forecasters' ability to coordinate responses with local emergency management officials.  —  Crucial positions at the local offices of the National Weather Service … ",
    "url": "https://www.nytimes.com/2025/07/05/us/politics/texas-floods-warnings-vacancies.html?unlocked_article_code=1.UU8.21M8.MBBE3OCzrBAa&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Texas flooding latest: 43 dead, including 15 children, as search for some two dozen girls continues - as it happened  —  Girls from Camp Mystic, a Christian summer camp along the Guadalupe River, are still missing, says city manager.  This blog is now closed.  —  Closing summary",
    "url": "https://www.theguardian.com/us-news/live/2025/jul/05/texas-flooding-latest-news-updates-guadalupe-river-flood-camp-mystic"
  },
  {
    "text": "Texas officials face scrutiny over response to catastrophic and deadly flooding … The destructive fast-moving waters that began before sunrise Friday in the Texas Hill Country killed at least 43 people in Kerr County, authorities said Saturday, and an unknown number of people remained missing.",
    "url": "https://www.politico.com/news/2025/07/06/texas-officials-face-scrutiny-over-response-to-catastrophic-and-deadly-flooding-00440035"
  },
  {
    "text": "Live Updates: More Than 50 Dead in Texas Floods as Search for Missing Grows Dire  —  At least 15 children were among those killed by flooding in Central Texas.  Some two dozen girls from a camp on the Guadalupe River remained unaccounted for.  —  Hunt, Texas  —  Hunt, Texas  —  Ingram, Texas Ingram, Texas",
    "url": "https://www.nytimes.com/live/2025/07/05/us/texas-floods"
  },
  {
    "text": "Here's a timeline of the catastrophic Texas floods  —  In the early hours of Friday, floods swept across Texas Hill Country.  The Guadalupe River rose 26 feet within 45 minutes, according to state officials.  —  The flooding killed at least 14 children and 18 adults, officials said at a press conference on Saturday afternoon.",
    "url": "https://www.npr.org/2025/07/05/nx-s1-5457759/texas-floods-timeline"
  },
  {
    "text": "The NWS apparently did its job  —  I can understand the temptation to blame DOGE for the horrible consequences of the Guadalupe River flood, but leaving aside that this would almost certainly be counterproductive (the Republican response to bureaucratic failure is to see it as a pretext for further cuts) it also appears to be false:",
    "url": "https://www.lawyersgunsmoneyblog.com/2025/07/the-nws-apparently-did-its-job"
  },
  {
    "text": "July 5, 2025  —  Yesterday afternoon, President Donald J. Trump signed the nearly 1,000-page budget reconciliation bill Republicans passed last week.  Trump had demanded Congress pass the measure by July 4, and Republicans rammed it through despite the bill's deep unpopularity and Congress's lack of debate on it.",
    "url": "https://heathercoxrichardson.substack.com/p/july-5-2025"
  },
  {
    "text": "‘I want my vote back’: Trump-voting family stunned after Canadian mother detained over immigration status  —  Family of Cynthia Olivera reconsiders support for president after Ice detained her at green card interview  —  The family of a Canadian national who supported Donald Trump's plans … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/06/trump-voting-family-canadian-mother-detained-immigration-status"
  },
  {
    "text": "Can Democrats Find Their Way on Immigration?  —  The party's leftward shift in the Biden administration arguably laid the groundwork for President Trump's aggressive approach.  Deciding the next move won't be easy.  —  Many Democratic presidential candidates in 2019 supported decriminalizing … ",
    "url": "https://www.nytimes.com/2025/07/06/us/politics/democrats-immigration-trump.html?unlocked_article_code=1.UU8.01gK.UcD_ADN9lhY7&smid=url-share"
  },
  {
    "text": "How Trump's policies are reshaping immigration enforcement in Puerto Rico  —  Residents have decried the “aggressiveness” of immigration raids in a U.S. territory without permanent detention centers, as immigrants are flown across the ocean to the mainland.  —  In Barrio Obrero … ",
    "url": "https://www.nbcnews.com/news/latino/immigration-raids-ice-puerto-rico-trump-dominicans-rcna216080"
  },
  {
    "text": "Things Worth Remembering: Lady Liberty's Open Arms  —  It was a poet who transformed America's favorite statue from a celebration of independence to a symbol of welcome.  —  Upgrade to Listen … My grandfather, Lorenzo Nocera, immigrated to America in 1904 from a small town south of Naples, Italy.",
    "url": "https://www.thefp.com/p/things-worth-remembering-lady-liberty-immigration"
  },
  {
    "text": "‘The American system is being destroyed’: academics on leaving US for ‘scientific asylum’ in France  —  Almost 300 researchers have applied for positions at Aix-Marseille University after Trump unleashed his attack on academia  —  It was on a US-bound flight in March, as Brian Sandberg stressed … ",
    "url": "https://www.theguardian.com/education/2025/jul/05/academics-leaving-us-scientific-asylum-france-trump"
  },
  {
    "text": "Inside Trump's supercharged version of Bush's “War on Terror”  —  Mass surveillance. … Citing national security to hide information from the courts.  Labeling people as “terrorists” as a political and legal strategy. … But now Trump is supercharging many of the post-9/11 legal, tactical and political strategies Bush used.",
    "url": "https://www.axios.com/2025/07/06/trump-bush-war-on-terror-immigration"
  },
  {
    "text": "Trump's economy remains pretty strong, but some warning signs are flashing  —  Stock markets are up and tax cuts are coming for some, but consumer spending is slowing and the full effects of tariffs have not yet hit.  —  Summary  —  Nearly six months into his second term … ",
    "url": "https://washingtonpost.com/business/2025/07/05/trump-policies-economic-growth/"
  },
  {
    "text": "Trump, GOP target ballots arriving after Election Day that feed conspiracy fears  —  President Donald Trump and other Republicans have long criticized states that take weeks to count their ballots after Election Day  —  ATLANTA — President Donald Trump and other Republicans have long criticized states … ",
    "url": "https://abcnews.go.com/Politics/wireStory/trump-gop-target-ballots-arriving-after-election-day-123513633"
  },
  {
    "text": "Israeli airstrikes kill 38 Palestinians in Gaza as truce negotiating team heads to Qatar  —  Israeli airstrikes killed at least 38 Palestinians in Gaza, hospital officials said on Sunday, as Israel was sending a ceasefire negotiating team to Qatar ahead of Prime Minister Benjamin Netanyahu 's White House visit for talks toward a deal.",
    "url": "https://apnews.com/article/gaza-hamas-israel-ceasefire-f98461150ec7572beb8432325cbfd299"
  },
  {
    "text": "‘Tears My Heart to Pieces’: North Carolina Braces for Medicaid Cuts  —  President Trump's domestic policy law jeopardizes plans to reopen one rural county's hospital — and health coverage for hundreds of thousands of state residents.  —  The only hospital in Martin County, N.C., closed in 2023, but the electricity is still on inside.",
    "url": "https://www.nytimes.com/2025/07/06/us/north-carolina-medicaid-cuts.html"
  },
  {
    "text": "U.S. Turns Eight Migrants Over to South Sudan, Ending Weeks of Legal Limbo  —  Courts blocked the handover after lawyers raised concerns of torture.  Then the Supreme Court intervened to allow the Trump administration's plan to move forward.  —  A flight carrying eight men who had been held … ",
    "url": "https://www.nytimes.com/2025/07/05/us/migrants-djibouti-south-sudan.html"
  }
]