[
  {
    "text": "Biden ‘Garbage’ Remark Causes Big Stink: Latest Responses  —  Kamala Harris delivered the closing argument of her campaign on Tuesday night, telling about 75,000 people assembled on the Ellipse in Washington that she will work to deliver for everyday Americans, while Donald Trump is a “petty tyrant” who's “obsessed with revenge.”",
    "url": "https://nymag.com/intelligencer/article/did-biden-call-trump-supporters-garbage-latest-responses.html"
  },
  {
    "text": "No, Corporate Media.  This Isn't the October Surprise You've Been Waiting For  —  Joe called hateful rhetoric “garbage,” end of story  —  This morning as I was reviewing the Press coverage of Kamala's historic DC event, something else caught my attention that was too ridiculous to ignore.",
    "url": "https://www.dworkinsubstack.com/p/no-corporate-media-this-isnt-the"
  },
  {
    "text": "‘Garbage’ Comments Push Sidelined Biden Back Into Campaign Spotlight  —  Fading into the background has been bittersweet for the president, now focused on his legacy  —  WASHINGTON—When Vice President Kamala Harris delivered her marquee closing address on the Ellipse Tuesday to tens … ",
    "url": "https://www.wsj.com/politics/elections/biden-sits-uncomfortably-on-the-campaigns-sidelines-a72915b7"
  },
  {
    "text": "Brigadier General Buzz Aldrin Endorses Donald J. Trump for President of the United States  —  Brigadier General Buzz Aldrin endorses Donald J. Trump for President of the United States.  General Aldrin, Lunar Module Pilot on Apollo 11 and Gemini 12 pilot, provides the following statement:",
    "url": "https://www.prnewswire.com/news-releases/brigadier-general-buzz-aldrin-endorses-donald-j-trump-for-president-of-the-united-states-302291636.html"
  },
  {
    "text": "CNN Polls: Harris has a narrow edge in Michigan and Wisconsin, while she and Trump remain tied in Pennsylvania  —  Vice President Kamala Harris maintains a narrow advantage in two of the three “blue wall” states that collectively represent her clearest path to an Electoral College victory … ",
    "url": "https://www.cnn.com/2024/10/30/politics/cnn-polls-michigan-wisconsin-pennsylvania-blue-wall/"
  },
  {
    "text": "A Woman Died After Being Told It Would Be a “Crime” to Intervene in Her Miscarriage at a Texas Hospital  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Josseli Barnica grieved the news … ",
    "url": "https://www.propublica.org/article/josseli-barnica-death-miscarriage-texas-abortion-ban"
  },
  {
    "text": "The Billionaire Is the Threat, Not the Solution  —  I learned how to read by reading Baltimore Orioles game recaps in the sports section of the Washington Post.  I remember sitting on our couch as my dad pointed to words like “Cal Ripken” and “Mike Mussina” and “baseball” and “Orioles,” … ",
    "url": "https://www.404media.co/the-billionaire-is-the-threat-not-the-solution/"
  },
  {
    "text": "After non-endorsement, 250,000 subscribers cancel The Washington Post  —  Newsroom staffers press for answers on the loss of readers and trust after the owner and publisher decided to no longer endorse presidential candidates.  —  At least 250,000 Washington Post readers have canceled … ",
    "url": "https://www.washingtonpost.com/style/media/2024/10/29/washington-post-cancellations-number/"
  },
  {
    "text": "Beauty queen claims Donald Trump groped her after luring her back to suite at New York's Plaza Hotel  — Beatrice Keul, 53, was invited to US by Trump after Miss Switzerland pageant  —  He was grabbing and touching my body everywhere'  —  Donald Trump ‘jumped’ on a blonde 6' 1' pageant queen … ",
    "url": "https://www.dailymail.co.uk/news/article-13983755/beauty-queen-beatrice-keul-donald-trump-groped-plaza-hotel.html"
  },
  {
    "text": "Workers Say They Were Tricked and Threatened as Part of Elon Musk's Get-Out-the-Vote Effort  —  America PAC door knockers were flown to Michigan, driven in the back of a U-Haul, and told they'd have to pay hotel bills unless they met unrealistic quotas.  One was surprised they were working to elect Donald Trump.",
    "url": "https://www.wired.com/story/elon-musk-america-pac-blitz-canvassing-michigan-uhaul/"
  },
  {
    "text": "Supreme Court allows Virginia to resume its purge of voter registrations  —  The Supreme Court on Wednesday allowed Virginia to resume its purge of voter registrations that the state says is aimed at stopping people who are not U.S. citizens from voting.  The justices, over the dissents … ",
    "url": "https://apnews.com/article/supreme-court-virginia-voter-registration-purge-ba3d785d9d2d169d9c02207a42893757"
  },
  {
    "text": "Donald Trump's cognitive decline becoming a troubling concern  —  VIEW MORE OF THE SUN'S OPINION SECTION",
    "url": "https://lasvegassun.com/news/2024/oct/30/trumps-decline-has-been-alarming/"
  },
  {
    "text": "Jeff Bezos Should Donate the Washington Post to a Charity  —  His conflicts of interests are insurmountable.  He can take a heroic path to strengthen journalism.  —  With one ill-timed decision, Jeff Bezos undermined eleven years of positive behavior as a newspaper owner.",
    "url": "https://www.cjr.org/opinion/waldman-bezos-washington-post-donation-charity-goodwill-endorsements-harris-spiked.php"
  },
  {
    "text": "Donald Trump Just Shat Himself  —  1. The Law of the Jungle  —  In the Netflix docuseries Mr. McMahon, Vince McMahon says precisely one true thing.  It's the end of the second episode and McMahon tells the filmmakers, “I believe in the law of the jungle.”",
    "url": "https://www.thebulwark.com/p/donald-trump-just-shat-himself"
  },
  {
    "text": "Chinese student to face criminal charges for voting in Michigan.  Ballot will apparently count  —  A University of Michigan student who is from China and not a U.S. citizen allegedly voted Sunday in Ann Arbor and is being charged with two crimes, six days before a pivotal presidential election.",
    "url": "https://www.detroitnews.com/story/news/politics/elections/2024/10/30/chinese-university-of-michigan-college-student-voted-presidential-election-michigan-china-benson/75936701007/"
  },
  {
    "text": "Machete-wielding teen arrested after group accused of intimidating Democrat supporters at Florida polling station, police say  —  Caleb James Williams was arrested for allegedly brandishing his weapon at two women, aged 71 and 54, police said.  —  Police arrested an 18-year-old wielding … ",
    "url": "https://www.nbcnews.com/politics/2024-election/machete-wielding-teen-arrested-group-accused-intimidating-democrat-sup-rcna177981"
  },
  {
    "text": "Arnold Schwarzenegger Endorses Kamala Harris: 'Don't Recognize Our Country'  —  Arnold Schwarzenegger announced on Wednesday that he is endorsing Vice President  —  for president.  —  “I don't really do endorsements.  I'm not shy about sharing my views, but I hate politics and don't trust most politicians.",
    "url": "https://www.newsweek.com/arnold-schwarzenegger-endorses-kamala-harris-dont-recognize-our-country-1977324"
  },
  {
    "text": "These look like Harris ads.  Trump backers bought them.  —  The Washington Post's essential guide to tech policy news  —  Happy Wednesday!  Apple Intelligence is going just great.  Send news tips to: will.oremus@washpost.com.  —  They look like Harris ads.  Trump backers bought them.",
    "url": "https://www.washingtonpost.com/politics/2024/10/30/progress-2028-ads-facebook-harris-musk/"
  },
  {
    "text": "Judge Mutes Ranting Rudy Giuliani During Bonkers Hearing  —  Last week, Rudy Giuliani was ordered to hand over basically everything he owns — including his Upper East Side apartment, his 1980 Mercedes, and even his television — in order to pay $148 million in damages for defaming Georgia election workers Ruby Freeman and Shaye Moss.",
    "url": "https://nymag.com/intelligencer/article/judge-mutes-ranting-rudy-giuliani-lawsuit.html"
  },
  {
    "text": "That “Little Secret” Between Trump and Johnson?  Here's What It Could Mean.  —  The “secret” almost certainly involves a plan to install Trump in the White House if he loses the election—but this plan could be even worse than you think.  —  Pocket  —  During the Nazi-throwback rally … ",
    "url": "https://www.thenation.com/article/politics/little-secret-trump-johnson-election/"
  },
  {
    "text": "They tried to prove Trump's fraud claims.  They failed — and got in trouble.  —  Trump's voter-fraud push has led to increasing legal jeopardy, but largely for those who flouted the law as they tried to substantiate it.  —  Four years after the 2020 election, there is still zero proof … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/30/they-tried-prove-trumps-fraud-claims-they-failed-got-trouble/"
  },
  {
    "text": "What Will You Do?  —  Life-changing choices we may be forced to make if Donald Trump wins  —  Former President Donald Trump arrives to speak at a campaign event at Nassau Coliseum, September 18, 2024, in Uniondale, New York.  —  What will you do if men in uniforms arrive in your neighborhood … ",
    "url": "https://prospect.org/politics/2024-10-30-what-will-you-do-trump-wins/"
  },
  {
    "text": "Star-Ledger ending print edition and closing production facility in 2025  —  The Star-Ledger will cease publishing a print newspaper and will close its Montville production facility in February 2025.  The decision was made by the Star-Ledger's owner, Newark Morning Ledger Co., due to rising costs … ",
    "url": "https://www.nj.com/news/2024/10/star-ledger-ending-print-edition-and-closing-production-facility-in-2025.html"
  },
  {
    "text": "Bracing for Trump's tariffs  —  The Big Story  —  Businesses brace for new Trump tariffs  —  Companies are preparing for a spate of new tariffs on Chinese goods promised by former President Trump should he emerge victorious from the presidential election.",
    "url": "https://thehill.com/newsletters/business-economy/4962759-bracing-for-trumps-tariffs/"
  },
  {
    "text": "Iran will likely try to contact Americans directly in influence campaign, sources say  —  In recent years, Iran has been accused of sending threatening and intimidating emails and text messages to citizens of three countries.  —  U.S. officials expect that in the coming weeks … ",
    "url": "https://www.nbcnews.com/tech/security/iran-foreign-influence-election-us-campaign-email-news-rcna177269"
  },
  {
    "text": "Historian who correctly predicted 9 of last 10 presidential elections picks Harris, still  —  Democratic nominee Kamala Harris will be the next president of the United States and beat Republican rival Donald Trump on Election Day, or so historian and election forecaster Allan Lichtman still predicts.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/30/historian-allan-lichtman-predicts-harris-win/75939976007/"
  }
]