[
  {
    "text": "Trump's Net Worth Hits $6.5 Billion, Making Him One of World's 500 Richest People  — Former president joins Bloomberg's list of 500 richest people  — Trump Media merger adds billions of dollars to paper fortune  —  Trump Bond Cut to $175 Million Amid Appeal of NY Fine",
    "url": "https://www.bloomberg.com/news/articles/2024-03-25/donald-trump-6-4-billion-net-worth-makes-him-one-of-world-s-richest-people"
  },
  {
    "text": "Team Biden Roasts ‘Feeble, Confused, Tired’ Trump After Unhinged Presser  —  The president has been going after his presumptive 2024 opponent with a little more venom than usual … The president's campaign responded to Trump's wild press conference in New York on Monday by slamming the former president as … ",
    "url": "https://www.rollingstone.com/politics/politics-news/biden-campaign-roasts-feeble-confused-tired-trump-1234994066/"
  },
  {
    "text": "Trump Can Post Smaller Bond in Civil Fraud Case, Court Rules  —  The former president must post a bond of $175 million within 10 days as he appeals the $454 million judgment against him.  —  With Donald J. Trump on the clock to secure a nearly half-billion-dollar bond in his civil fraud case … ",
    "url": "https://www.nytimes.com/2024/03/25/nyregion/trump-bond-reduced.html"
  },
  {
    "text": "The other failure of the Republican investigation into Biden  —  Donald Trump needs money.  Maybe he doesn't need as much as it seemed like he was going to need a week ago; a judge on Monday substantially reduced the size of the bond Trump needs to post while he appeals the judgment from his civil fraud trial in New York.",
    "url": "https://www.washingtonpost.com/politics/2024/03/25/biden-impeachment-inquiry-trump-influence/"
  },
  {
    "text": "Billionaires sought to help fund Trump bond in civil fraud case, sources say  —  Some major Republican donors were working together to help U.S. presidential candidate Donald Trump fund the original bond amount needed to cover his $454 million civil fraud judgment ahead of Monday's deadline … ",
    "url": "https://www.reuters.com/world/us/billionaires-sought-help-fund-trump-bond-civil-fraud-case-sources-say-2024-03-26/"
  },
  {
    "text": "Chuck Todd Elaborates On Why NBC Shouldn't Have Hired Ronna McDaniel  —  In a social media post, the NBC newsman said honest journalists shouldn't have to “lend their credibility to someone who intentionally tried to ruin ours.”  —  LOADING  —  Chuck Todd is elaborating on why NBC News … ",
    "url": "https://www.huffpost.com/entry/chuck-todd-x-ronna-mcdaniel_n_660209a3e4b079ac3ef1ed54"
  },
  {
    "text": "Ohio man gets 2.5 years in prison for death threats made in 2022 to Arizona's top election official  —  An Ohio man who acknowledged making death threats in voicemails left for then-Arizona Secretary of State Katie Hobbs during the 2022 election season was sentenced Monday to 2 1/2 years in prison.",
    "url": "https://apnews.com/article/arizona-election-threats-voicemails-hobbs-sentence-87e7b8e99cb5961ff2ed38eab550a44b"
  },
  {
    "text": "Sean ‘Diddy’ Combs's homes raided by Homeland Security  —  The Los Angeles and Miami homes of renowned musician and producer Sean “Diddy” Combs were raided by authorities as part of a federal investigation, officials said.  —  The action is related to a sex trafficking probe in New York … ",
    "url": "https://thehill.com/blogs/in-the-know/4555004-sean-diddy-combs-homes-raided/"
  },
  {
    "text": "Florida Passes Law Banning Social Media for Minors Under 14  —  The legislation prohibits social-media accounts for some teens regardless of parental consent  —  Florida Gov. Ron DeSantis signed legislation Monday that prohibits people under 14 years old from having social-media accounts … ",
    "url": "https://www.wsj.com/politics/florida-passes-law-banning-social-media-for-minors-under-14-abae4ce3"
  },
  {
    "text": "Wife of Judge on Mifepristone Case Was Paid by Anti-Abortion Group  —  FRIENDS OF THE COURT  —  The fate of the abortion pill mifepristone is now before the Supreme Court, after a fifth-circuit appeals panel of three judges ruled against its distribution last summer.",
    "url": "https://www.thedailybeast.com/wife-of-james-ho-judge-on-mifepristone-case-was-paid-by-anti-abortion-group"
  },
  {
    "text": "Elon Musk Fought Government Surveillance — While Profiting Off Government Surveillance  —  Musk made hay of his legal battle against secret surveillance but continued selling X user data to a company that facilitates government monitoring.  —  Ten years ago, the internet platform X … ",
    "url": "https://theintercept.com/2024/03/25/elon-musk-x-dataminr-surveillance-privacy/"
  },
  {
    "text": "Could Murkowski's dislike for Trump remake the Senate?  —  With assists from POLITICO's Congress team  —  TIME FOR SOME ALASKA GAME THEORY  —  Sen. Lisa Murkowski (R-Alaska) has always been a free thinker.  But a second White House term for Donald Trump could force her into a new lane.",
    "url": "https://www.politico.com/newsletters/inside-congress"
  },
  {
    "text": "Scoop: GOP group privately warns against all-in Biden attacks … - “Steer clear of making the election a singular referendum on Joe Biden,” wrote Dee Duncan, the president of the Republican State Leadership Committee (RSLC).  — The memo advised against using Biden “as your crutch” … ",
    "url": "https://www.axios.com/2024/03/25/republicans-attack-biden-2024-gop"
  },
  {
    "text": "Records confirm Trump's mother-in-law came to U.S. through process he derided  —  Melania Trump sponsored her mother to immigrate to the United States through a family-based process that former president Donald Trump aggressively sought to end, according to federal immigration records released Monday.",
    "url": "https://www.washingtonpost.com/immigration/2024/03/25/trump-melania-parents-chain-migration/"
  },
  {
    "text": "Pluralistic: Conspiratorialism and the epistemological crisis (25 Mar 2024)  — Conspiratorialism and the epistemological crisis: We may not know what's in the box, but we can tell if it's been damaged in transit.  — Hey look at this: Delights to delectate.  — This day in history: 2004, 2009, 2014, 2019, 2023",
    "url": "https://pluralistic.net/2024/03/25/black-boxes/"
  },
  {
    "text": "Hamas, Al Jazeera admit: Story of IDF rapes in Gaza hospital fabricated  —  Although the Qatari mouthpiece has yet to officially refer to the retraction, all content related to the allegation has been deleted.  —  After more than 24 hours of letting the story run freely … ",
    "url": "https://www.jpost.com/israel-hamas-war/article-793560"
  },
  {
    "text": "Jeff Yass just bought Trump.  Here's what he stands to gain.  —  The right-wing billionaire and TikTok investor is about to help the former president add billions of dollars to his net worth.  This is what oligarchy looks like.  —  Billionaire investor Jeff Yass is playing his Trump card.",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/trump-truth-social-tik-tok-jeff-yass-rcna144951"
  },
  {
    "text": "The goofy origins of Trump's ‘too big to rig’ mantra  —  The reason casinos make money — or, at least, most casinos — is that the odds are stacked in their favor.  The extent of this advantage varies by game; it's generally smallest in craps.  But over time, the house comes out on top because probability says it will.",
    "url": "https://www.washingtonpost.com/politics/2024/03/25/trump-rigged-elections/"
  },
  {
    "text": "What's at stake in the Supreme Court abortion pill case  —  Tuesday's oral argument is focused on whether to overrule the FDA and reimpose some restrictions on getting medication to terminate pregnancy  —  Less than two years after the Supreme Court overturned Roe v. Wade … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/24/supreme-court-abortion-pill-case/"
  }
]