[
  {
    "text": "Republican Praises Protest Hecklers, Including 1 Who Made Monkey Noises At Black Woman  —  A clip from the University of Mississippi shows a white counter-protester making the noises and gestures amid students' pro-Palestinian protest on campus.  —  LOADING",
    "url": "https://www.huffpost.com/entry/university-of-mississippi-counter-protester-monkey-noises_n_6635acb9e4b0e44cfb1197cb"
  },
  {
    "text": "Congressman appears to praise University of Mississippi students, including one making monkey gestures, who taunted a lone Black Gaza protester  — Rep. Mike Collins appeared to praise University of Mississippi students for racist chants.  — A video on X showed students engaging in racial taunts towards a Black war protester.",
    "url": "https://www.businessinsider.com/ole-miss-students-taunting-black-gaza-protester-approval-from-rep-2024-5"
  },
  {
    "text": "Politics Without Trump?  His Youngest Fans Barely Remember It.  —  Democrats call Donald J. Trump dangerous.  Republicans see him as revolutionary.  For young Trump voters, he is just normal.  —  When Donald J. Trump held a rally in Rome, Ga., in March, his audience included … ",
    "url": "https://www.nytimes.com/2024/05/04/us/politics/trump-biden-campaign-young-voters.html"
  },
  {
    "text": "Winning the super-haters  —  President Biden and former President Trump are in hot pursuit of a big — and possibly determinative — group of voters who loathe both men. … - That makes 2024 more similar to 2016 — when exit polls showed 18% of voters disliked both Trump and Hillary Clinton … ",
    "url": "https://www.axios.com/2024/05/04/double-haters-trump-biden-2024-election"
  },
  {
    "text": "Senior UN official says northern Gaza is now in ‘full-blown famine’  —  WASHINGTON — A top U.N. official said Friday that hard-hit northern Gaza was now in “full-blown famine” after more than six months of war between Israel and Hamas and severe Israeli restrictions on food deliveries to the Palestinian territory.",
    "url": "https://www.npr.org/2024/05/04/1249153712/united-nations-northern-gaza-famine"
  },
  {
    "text": "Utah trolled with 4,000 hoax reports of trans bathroom ban violations within days of reporting form launch  —  HB257, which took full effect Wednesday, requires the Utah auditor's office to receive and investigate complaints when government entities don't comply with the law.",
    "url": "https://www.sltrib.com/news/politics/2024/05/03/utah-trolled-with-4000-hoax/"
  },
  {
    "text": "How Counterprotesters at U.C.L.A. Provoked Violence, Unchecked for Hours  —  The New York Times used videos filmed by journalists, witnesses and protesters to analyze hours of clashes — and a delayed police response — at a pro-Palestinian encampment on Tuesday.",
    "url": "https://www.nytimes.com/interactive/2024/05/03/us/ucla-protests-encampment-violence.html"
  },
  {
    "text": "A group of Republicans has united to defend the legitimacy of US elections and those who run them  —  It was Election Day last November, and one of Georgia's top election officials saw that reports of a voting machine problem in an eastern Pennsylvania county were gaining traction online.",
    "url": "https://apnews.com/article/election-lies-trump-republicans-2024-legitimacy-f9b015fb3ead18f5c7b1432415680361"
  },
  {
    "text": "Activist Groups Trained Students for Months Before Campus Protests  —  Left-wing groups and veteran demonstrators provided guidance and support before rise of pro-Palestinian encampments",
    "url": "https://www.wsj.com/us-news/education/student-campus-protests-veteran-activist-groups-17ccd094"
  },
  {
    "text": "Trump Campaign Files First Election Lawsuit of the Cycle, Targets Nevada Mail-in Voting  —  WASHINGTON, D.C. — The Trump campaign is challenging Nevada's mail-in ballot receipt deadline in its first election lawsuit of the year with the help of the Republican National Committee (RNC) and the Nevada Republican Party.",
    "url": "https://www.democracydocket.com/news-alerts/trump-campaign-files-first-election-lawsuit-of-the-cycle-targets-nevada-mail-in-voting/"
  },
  {
    "text": "The Cuellar Indictment: DOJ Moves to Make 219 FARA a Thing  —  DOJ indicted Henry Cuellar and his spouse Imelda last Monday on charges that they laundered almost $600K in bribes through sham consulting contracts to Imelda in return for policies favorable to a state-owned Azerbaijani oil company and a Mexican bank.",
    "url": "https://www.emptywheel.net/2024/05/04/the-cuellar-indictment-doj-moves-to-make-219-fara-a-thing/"
  },
  {
    "text": "How Do I Prepare My Phone for a Protest?  (Updated 2024)  —  Simple steps to take before hitting the streets  —  This article is an updated version of The Markup's original article on how to prepare your phone for a protest, published in 2020.  —  Gaza solidarity encampments have appeared … ",
    "url": "https://themarkup.org/the-breakdown/2024/05/04/how-do-i-prepare-my-phone-for-a-protest-updated-2024"
  },
  {
    "text": "Republican Firebrand Ted Cruz Now Courts Democrats to Win Re-Election  —  Texas senator faces competitive contest against Colin Allred this fall  —  CYPRESS, Texas—There are two sides to Ted Cruz, the Republican senator says.  —  The self-described conservative warrior has opposed most big compromise legislation.",
    "url": "https://www.wsj.com/politics/elections/ted-cruz-texas-senate-election-strategy-313d0be3"
  },
  {
    "text": "There's progress reported in Gaza truce talks, but Israel downplays chances of ending war with Hamas  —  In Rafah, Civil Defense members evacuated injured victims from the building hit by the strike, and carried away the bodies of those killed.  At Al Aqsa hospital, mourners prayed over the bodies of those killed in the strike.",
    "url": "https://apnews.com/article/israel-hamas-war-news-05-04-2024-4eae8b7a75440d4dd9a201219d60bcd9"
  }
]