[
  {
    "text": "Hegseth Orders Pentagon to Stop Offensive Cyberoperations Against Russia  —  The defense secretary's instructions, which were given before President Trump's blowup with the Ukrainian president, are apparently part of an effort to draw Russia into talks on the war.",
    "url": "https://www.nytimes.com/2025/03/02/us/politics/hegseth-cyber-russia-trump-putin.html?unlocked_article_code=1.004.B7lh.Cy2TjG3-0IlO&smid=url-share"
  },
  {
    "text": "In Ukraine, Many Watch and Wait for Signs of Hope From Abroad  —  After a summit of European leaders in London, Prime Minister Kier Starmer said a “coalition of the willing” would be assembled to defend Ukraine, but he did not name the countries expected to participate.  —  Stephen Castle and Jeanna Smialek",
    "url": "https://www.nytimes.com/live/2025/03/02/us/trump-news-zelensky-europe?unlocked_article_code=1.004.1Vhs.RD4JB8HptudB&smid=url-share"
  },
  {
    "text": "GOP piles on Trump's Zelensky hostility … - Asked if Russian President Vladimir Putin also needed to step down, Johnson said he'd like to see him “defeated.”  — He argued the U.S. is not abandoning Ukraine but criticized the country's leader for appearing “rather stiff-necked … ",
    "url": "https://www.axios.com/2025/03/02/gop-trump-zelensky-meeting-lawmakers-react"
  },
  {
    "text": "FAA Officials Ordered Staff to Find Funding for Elon Musk's Starlink  —  The Federal Aviation Administration directed staff to locate tens of millions of dollars for a Starlink deal, sources tell Rolling Stone … However, on Friday, FAA officials ordered staff to begin finding tens of millions … ",
    "url": "https://www.rollingstone.com/politics/politics-features/elon-musk-starlink-faa-officials-find-funding-1235285246/"
  },
  {
    "text": "The Trump administration may exclude government spending from GDP, obscuring the impact of DOGE cuts  —  Commerce Secretary Howard Lutnick said Sunday that government spending could be separated from gross domestic product reports in response to questions about whether the spending cuts pushed … ",
    "url": "https://apnews.com/article/trump-gdp-economy-government-spending-lutnick-7414ba1bd441bd4bf64620bfd66923b2"
  },
  {
    "text": "Crypto Prices Jump After Trump Announces Five Tokens for Strategic Reserve  —  Bitcoin, ether, solana, Ripple-linked XRP and cardano will be in the stockpile  —  Crypto prices surged Sunday after President Trump said he would move forward on a U.S. crypto strategic reserve that would include bitcoin … ",
    "url": "https://www.wsj.com/finance/currencies/crypto-prices-jump-after-trump-announces-five-tokens-for-strategic-reserve-636f31d7?st=iLbGRS&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Playbook: Democrats in despair  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Happy Sunday.  You have roughly eight hours to catch up on Oscars movies before the big awards show begins tonight at 7 p.m. Drop me a line: [email protected].  —  DRIVING THE DAY",
    "url": "https://www.politico.com/newsletters/playbook/2025/03/02/democrats-in-despair-00206883"
  },
  {
    "text": "Trump Heads Toward Tariff Barrage on Canada, Mexico, China  — US to add 25% levies on Mexican products, most Canadian goods  — Trump would also double China levy barring last-minute delay … President Donald Trump is on the verge of slapping new tariffs on Canada and Mexico … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-02/trump-barrels-toward-tariff-barrage-on-canada-mexico-and-china"
  },
  {
    "text": "CNN Poll: Public remains negative on Trump ahead of address to Congress  —  The American public's view of Donald Trump's presidency and the direction he's leading the country is more negative than positive just ahead of his first formal address to Congress since returning to office, according to a new CNN poll conducted by SSRS.",
    "url": "https://www.cnn.com/2025/03/02/politics/poll-trump-negative-congress-address/"
  },
  {
    "text": "Israel cuts off Gaza aid to pressure Hamas to accept new ceasefire proposal  —  Israel stopped the entry of all goods and supplies into the Gaza Strip on Sunday and warned of “additional consequences” if Hamas doesn't accept a new proposal to extend a fragile ceasefire.",
    "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-ceasefire-hostages-03-02-2025-99402570996dcf33239d0492d99909e4"
  },
  {
    "text": "Amid West Texas measles outbreak, vaccine resistance hardens  —  A child has died in an outbreak that has grown to 146 cases.  —  SEMINOLE, Texas — When the local hospital warned of a brewing measles outbreak, Kaleigh Brantner urged fellow residents of this rural West Texas community to beware of vaccinating their children.",
    "url": "https://www.washingtonpost.com/health/2025/03/02/measles-outbreak-texas-vaccine-hesitancy-death/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwODkxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMjcwMzk5LCJpYXQiOjE3NDA4OTE2MDAsImp0aSI6ImEyZWVlMTA3LTc3Y2MtNDBlNy04ZjdjLTNhNmE0ZmJjYWM4MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wMy8wMi9tZWFzbGVzLW91dGJyZWFrLXRleGFzLXZhY2NpbmUtaGVzaXRhbmN5LWRlYXRoLyJ9.fMDWpTMGus_hFPo7_qd6ywjZV0yb0s5PiQsdxCQPMrU&itid=gfta"
  },
  {
    "text": "Pentagon guts national security program that harnessed social science  —  Dozens of U.S. academics lose grants from Minerva program for studies related to terrorism, drug trafficking, and other threats  —  The U.S. Department of Defense (DoD) is gutting a landmark project designed … ",
    "url": "https://www.science.org/content/article/pentagon-guts-national-security-program-harnessed-social-science"
  },
  {
    "text": "Rubio Bypasses Congress to Send Israel $4 Billion in Arms  —  Secretary of State Marco Rubio's emergency declaration calls for sending 2,000-pound bombs and other weapons to Israel as the war in Gaza continues.  —  Secretary of State Marco Rubio has invoked “emergency authorities” … ",
    "url": "https://www.nytimes.com/2025/03/02/us/politics/rubio-arms-israel.html?unlocked_article_code=1.004.Tiic.RCDf8rCeRXrU"
  },
  {
    "text": "Crowds protest JD Vance at Vermont ski resort  —  The vice president was set for a family vacation.  —  WAITSFIELD, Vermont— Crowds protesting Vice President JD Vance the day after an Oval Office blowout over Ukraine lined roadways Saturday near a Vermont ski resort where he planned a weekend vacation with his family.",
    "url": "https://www.politico.com/news/2025/03/02/crowds-protest-jd-vance-vermont-ski-resort-00206906"
  },
  {
    "text": "John Gotti would have OK'd the Trump-Vance mob hit on Zelensky  —  The late American architect Philip Johnson is famous for his iconic 20th-century skyscrapers and also less well-known — while fascinating his biographers — for a 1930s flirtation with rising global fascism during … ",
    "url": "https://www.inquirer.com/opinion/commentary/trump-zelensky-ukraine-mob-boss-20250302.html"
  },
  {
    "text": "DOGE Claims Credit for Killing Contracts That Were Already Dead  —  Elon Musk's group claimed credit for canceling procurement agreements that had been completed years earlier, the latest in a string of public errors on its site.  —  While George W. Bush was president … ",
    "url": "https://www.nytimes.com/2025/03/02/us/politics/doge-musk-contracts-errors.html?unlocked_article_code=1.004.cQmy.o6z0GzXWryLU"
  },
  {
    "text": "How DOGE detonated a crisis at a highly sensitive nuclear weapons agency  —  Perfunctory mass firings sparked alarm across the country, as cost-cutting missteps throughout government rattle lawmakers  —  Amid the tumult of mass firings, the Trump administration's dismissal of workers … ",
    "url": "https://www.washingtonpost.com/business/2025/03/02/doge-nuclear-worker-firings-musk-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwODkxNjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMjcwMzk5LCJpYXQiOjE3NDA4OTE2MDAsImp0aSI6ImQ3MDIyMDVhLTU3M2ItNGUwMC04YTc2LWIwZDIzY2M0NTkyNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAzLzAyL2RvZ2UtbnVjbGVhci13b3JrZXItZmlyaW5ncy1tdXNrLXRydW1wLyJ9._L7dAHznJWdh8PNqOsMtIGOH_OvP3_Lt1sI-ivdf_ys&itid=gfta"
  },
  {
    "text": "Putin ally pushes deal to restart Nord Stream 2 with US backing  —  Ex-spy Warnig's plan to involve American investors shows breadth of Trump's rapprochement with Russian president  —  A former spy and close friend of Vladimir Putin has been engineering a restart of Russia's Nord Stream 2 gas pipeline … ",
    "url": "https://www.ft.com/content/dc9c51ab-03cb-47ba-ad0a-09c4deed9b50"
  },
  {
    "text": "Russia celebrates US foreign policy that now ‘coincides’ with Moscow's worldview  —  Moscow hopes to take advantage of a growing rift between the U.S. and Ukraine, and Europe more broadly.  —  The Kremlin on Sunday cheered the shift in U.S. foreign policy under President Donald Trump … ",
    "url": "https://www.politico.eu/article/russia-celebrates-united-states-foreign-policy-coinciding-moscow-ukraine/"
  }
]