[
  {
    "text": "An ‘Administrative Error’ Sends a Maryland Father to a Salvadoran Prison  —  Sign up for Trump's Return, a newsletter featuring coverage of the second Trump presidency.  —  The Trump administration acknowledged in a court filing Monday that it had grabbed a Maryland father with protected legal status … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/an-administrative-error-sends-a-man-to-a-salvadoran-prison/682254/?gift=Tsjgy5hc-Y7tsZCY3EHYrWOoNzx9Xi-w5fH-zT91Z90&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Innocent (in a Brutal Prison) Abroad  —  Big night for developments in the field of White House mass-deportation rake steps.  Let's get right into it.  Happy Tuesday.  —  Ordeal of Innocence  —  by William Kristol  —  Last night, Nick Miroff of the Atlantic reported … ",
    "url": "https://www.thebulwark.com/p/innocent-brutal-prison-abroad-deportation-ms-13-court-salvador"
  },
  {
    "text": "Waltz and staff used Gmail for government communications, officials say  —  Trump's national security adviser is trying to manage his way out of a crisis.  But new revelations about his team's operational security are piling up in the inbox.  —  Just now  —  Members of President Donald … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/01/waltz-national-security-council-signal-gmail/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzNDgwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0ODYyMzk5LCJpYXQiOjE3NDM0ODAwMDAsImp0aSI6ImNjNmE3ZmYzLTViMWYtNDdjZi05YTcwLTJlZTdjY2YxOGE1YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzAxL3dhbHR6LW5hdGlvbmFsLXNlY3VyaXR5LWNvdW5jaWwtc2lnbmFsLWdtYWlsLyJ9.B_oXWbANc-R7inHV48C9AqkmVIA-41Ip1IVrDyYc60Y&itid=gfta"
  },
  {
    "text": "A Cory Booker Staffer Was Arrested for Carrying a Gun on Capitol Grounds, Police Said  —  The arrest comes the same day the New Jersey senator began a protest of President Donald Trump's agenda.  — Copy  —  A staffer for Sen. Cory Booker was arrested Monday by U.S. Capitol Police … ",
    "url": "https://www.notus.org/senate/cory-booker-staffer-arrested-police-say"
  },
  {
    "text": "New Jersey Sen. Booker presses his marathon speech against Trump's agenda past 18 hours and counting  —  Watch live as U.S. Senator Cory Booker addresses the Senate floor.  Booker, a Democrat from New Jersey, has promised to speak “as long” as he's physically able on the Senate floor Monday night … ",
    "url": "https://apnews.com/article/cory-booker-new-jersey-senator-speech-ab573bb7c3c76fa107cacac7136d3823"
  },
  {
    "text": "Johnson Fails to Kill Bipartisan Measure to Allow Proxy Voting for New Parents  —  The speaker tried to use an unprecedented parliamentary maneuver to deny a bipartisan majority the chance to hold a vote on their proposal to allow new parents to vote remotely in the House.",
    "url": "https://www.nytimes.com/2025/04/01/us/politics/house-proxy-voting-parents-mike-johnson.html"
  },
  {
    "text": "House votes to defy Mike Johnson in painful blow  —  The House voted Tuesday to defy House Speaker Mike Johnson (R-La.) and force a vote on allowing members who are new parents to vote by proxy for three months.  —  Why it matters: It's a brutal loss for Johnson, who poured considerable political capital … ",
    "url": "https://www.axios.com/2025/04/01/mike-johnson-anna-paulina-luna-proxy-voting"
  },
  {
    "text": "Layoffs begin at US health agencies responsible for research, tracking disease and regulating food  —  Employees across the massive U.S. Health and Human Services Department began receiving notices of dismissal on Tuesday in an overhaul ultimately expected to lay off up to 10,000 people.",
    "url": "https://apnews.com/article/health-human-services-layoffs-restructuring-rfk-jr-ec4d7731695e4204970c7eab953b2289"
  },
  {
    "text": "'It's a bloodbath': Massive wave of job cuts underway at US health agencies  —  A massive wave of job cuts got underway at US health agencies early Tuesday, with some employees receiving early morning emails that their jobs were eliminated and some unable to access the building when they arrived at work.",
    "url": "https://cnn.com/2025/04/01/health/staff-cuts-at-federal-health-agencies-have-begun/"
  },
  {
    "text": "The CDC Has Been Gutted  —  Thousands of CDC employees who worked on things like preventing HIV and lead poisoning have been told they were subject to a reduction in force.  Experts say people will die.  —  Thousands of federal employees at the Centers for Disease Control and Prevention … ",
    "url": "https://www.wired.com/story/cdc-gutted-rif/"
  },
  {
    "text": "Hundreds of scientists accuse Donald Trump of censorship  —  The US risks losing a generation of scientists under Donald Trump's draconian targeting of universities and federal agencies, scientists warn in an open letter. … More than 1,900 scientists and engineers have signed a letter saying they … ",
    "url": "https://www.theverge.com/news/640664/science-censorship-trump-letter-climate-vaccine-national-academies"
  },
  {
    "text": "Trump Hit by Brutal New Polls on Econ as GOP Tariff Panic Goes Nuclear  —  President Donald Trump is set to announce that he'll impose sweeping new global tariffs on imports, and congressional Republicans are already scrambling wildly to try to shield their states and districts from the fallout.",
    "url": "https://newrepublic.com/article/193408/trump-hit-two-brutal-polls-econ-gop-tariff-panic-goes-nuclear"
  },
  {
    "text": "Professors Pushed Harvard to Resist Trump.  Now Billions Are on the Line.  —  Harvard, the wealthiest school in the world, sought compromise amid pressure to do more to combat antisemitism.  The Trump administration is examining its funding anyway.  —  The Trump administration … ",
    "url": "https://www.nytimes.com/2025/04/01/us/republicans-harvard-funding.html?unlocked_article_code=1.8U4.SCx3.HVXOQzI22jOd&smid=url-share"
  },
  {
    "text": "Top Trump USAID Staffer Accused of Violent Outbursts, Racist Remarks  —  Ten people who knew Jeremy Lewin expressed concerns about his new position due to troubling behavior in his youth … Jeremy Lewin recently became deputy administrator for policy and programs for what's left of USAID … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-usaid-jeremy-lewin-accused-violence-racist-remarks-1235307731/"
  },
  {
    "text": "Democrats Have Problems.  Turning Out for Special Elections Isn't One of Them.  —  They have come out in strong numbers in smaller races so far this year, and in the early voting for today's elections.  —  It can feel as if the Democratic Party has a lot of work to do before it is ready to win elections again.",
    "url": "https://www.nytimes.com/2025/04/01/upshot/special-elections-democrats-voting.html"
  },
  {
    "text": "EU readies counterstrike on Big Tech and US banks over Trump's mega tariffs  —  Brussels sees America's transatlantic trade surplus in services as its Achilles' heel.  —  BRUSSELS — It's one thing to hit Harley-Davidson motorbikes and bourbon whiskey.  It's another to go after Silicon Valley or Wall Street.",
    "url": "https://www.politico.eu/article/eu-tariffs-counter-strike-big-tech-us-banks-donald-trump/"
  },
  {
    "text": "'I don't know anyone that isn't pissed off at him': Trump world turns on Lutnick  —  As ‘Liberation Day’ nears, patience for the Commerce secretary is wearing thin across the Trump administration.  —  Inside the White House, Commerce Secretary Howard Lutnick has been perhaps the biggest proponent of … ",
    "url": "https://www.politico.com/news/2025/04/01/trump-tariffs-liberation-day-lutnick-politics-00262869"
  },
  {
    "text": "Le Pen could still become French president after appeal slated for 2026  —  The shock decision comes after the far-right icon's embezzlement conviction appeared to stop her running in 2027.  —  PARIS — Far-right leader Marine Le Pen has been handed a lifeline in her bid to become France's president … ",
    "url": "https://www.politico.eu/article/marine-le-pen-rule-appeal-summer-president-election/"
  },
  {
    "text": "Attorney General Pamela Bondi Directs Prosecutors to Seek Death Penalty for Luigi Mangione  —  For Immediate Release  —  Today, Attorney General Pamela Bondi released the following statement:  —  “Luigi Mangione's murder of Brian Thompson — an innocent man and father of two young children … ",
    "url": "https://www.justice.gov/opa/pr/attorney-general-pamela-bondi-directs-prosecutors-seek-death-penalty-luigi-mangione"
  },
  {
    "text": "Inside ICE Air: Flight Attendants on Deportation Planes Say Disaster Is “Only a Matter of Time”  —  Current and former flight attendants for GlobalX, the private charter airline at the center of Trump's immigration crackdown, expressed concern about their inability to treat passengers humanely and to keep them safe.",
    "url": "https://www.propublica.org/article/inside-ice-air-deportation-flights"
  },
  {
    "text": "Democratic Party Leaders and “Free Speech” Warriors Shrug as Trump Deports Dissidents  —  While the Trump administration targets hundreds over their constitutionally protected right to political speech, Democratic leadership and influential media pundits have largely stayed quiet.",
    "url": "https://inthesetimes.com/article/democratic-party-free-speech-trump-deportation-mahmoud-khalil"
  },
  {
    "text": "Rubio Orders U.S. Diplomats to Scour Student Visa Applicants' Social Media  —  The order comes as President Trump expands deportation efforts, including of students who have spoken out in support of Palestinians during Israel's war in Gaza.  —  Secretary of State Marco Rubio … ",
    "url": "https://www.nytimes.com/2025/04/01/us/politics/student-visas-social-media.html?unlocked_article_code=1.8U4.vBeO.jqiUHL77iuUr&smid=url-share"
  },
  {
    "text": "Elon Musk's $1 million handout winners are connected to Republican causes  —  Nicholas Jacobs and Ekaterina Diestler were presented with giant checks, but they're not exactly random voters. … On Sunday, a few thousand people in Green Bay, Wisconsin, gathered to hear Elon Musk speak … ",
    "url": "https://www.theverge.com/politics/640230/elon-musk-wisconsin-supreme-court-million-dollars-brad-schimel"
  },
  {
    "text": "23 states, DC sue Trump administration over billions in lost public health funding  —  Democratic attorneys general and governors in 23 states and Washington, DC, have filed a lawsuit against the US Department of Health and Human Services and HHS Secretary Robert F. Kennedy Jr. … ",
    "url": "https://cnn.com/2025/04/01/health/public-health-funding-states-sue-hhs-rfk"
  },
  {
    "text": "Air Traffic Controller Arrested in Incident at Reagan National Tower  —  The arrest of an F.A.A. employee on assault and battery charges comes as flight operations at the airport have been under scrutiny since a passenger jet and an Army helicopter collided in January.",
    "url": "https://www.nytimes.com/2025/04/01/us/politics/air-traffic-controller-arrest-reagan-airport.html"
  }
]