[
  {
    "text": "Scoop: Biden team's don't-let-him-trip mission … - With a physical therapist, Biden has been doing exercises to improve his balance as far back as November 2021.  — Since his stumble in June, he has been wearing tennis shoes more often to avoid slipping — and using the short stairs on Air Force One … ",
    "url": "https://www.axios.com/2023/09/26/biden-trip-2024-campaign-sneakers"
  },
  {
    "text": "Inside the spending cuts House Republicans are fighting for  —  Good morning, Early Birds.  If you like Kehinde Wiley's famous portrait of former president Barack Obama, check out his new exhibition of portraits of 11 African leaders.  Tips: earlytips@washpost.com.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2023/09/26/inside-spending-cuts-house-republicans-are-fighting/"
  },
  {
    "text": "Bending to far right, McCarthy pushes steep safety net cuts in shutdown battle  —  Republican House speaker embraces major spending reductions in trying to win conservative support for funding bill  —  Cutting housing subsidies for the poor by 33 percent as soaring rents drive a national affordability crisis.",
    "url": "https://www.washingtonpost.com/business/2023/09/26/mccarthy-conservatives-cut-spending/"
  },
  {
    "text": "Cassidy Hutchinson's new book reveals a Trump White House even more chaotic than previously known  —  In her new book “Enough,” former White House aide Cassidy Hutchinson paints the closing days of the Trump White House as even more chaotic and lawless than she previously disclosed in her shocking televised testimony last summer.",
    "url": "https://www.cnn.com/2023/09/26/politics/cassidy-hutchinson-book-trump-white-house-chaos/"
  },
  {
    "text": "Cassidy Hutchinson says Trump said ‘hang’ as he watched rioters chant ‘hang Mike Pence’ on Jan. 6  —  He watched the Jan. 6 Capitol attack unfold on a TV in the Oval, she said.  —  Former Trump White House aide Cassidy Hutchinson claims without providing further evidence that former President Donald Trump … ",
    "url": "https://abcnews.go.com/Politics/cassidy-hutchinson-trump-hang-watched-rioters-chant-hang/story?id=103495123"
  },
  {
    "text": "Supreme Court rejects Alabama's bid to use congressional map with just one majority-Black district  —  The court's decision is in line with its June ruling in the same case that reaffirmed key protections for minority voters.  —  WASHINGTON — The Supreme Court on Tuesday handed a defeat … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-alabamas-bid-use-congressional-map-just-one-majo-rcna105688"
  },
  {
    "text": "Supreme Court won't let Alabama use disputed House map for 2024  —  The Supreme Court on Tuesday refused Alabama's request to hold 2024 elections under a new congressional map judged to be an unlawful attempt to diminish the power of the state's Black voters.",
    "url": "https://www.washingtonpost.com/politics/2023/09/26/supreme-court-alabama-congressional-redistricting/"
  },
  {
    "text": "FTC Sues Amazon for Illegally Maintaining Monopoly Power  —  Amazon's ongoing pattern of illegal conduct blocks competition, allowing it to wield monopoly power to inflate prices, degrade quality, and stifle innovation for consumers and businesses  —  The Federal Trade Commission … ",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2023/09/ftc-sues-amazon-illegally-maintaining-monopoly-power"
  },
  {
    "text": "Hunter Biden sues former Trump lawyer Rudy Giuliani over infamous laptop  — Hunter Biden sued former Trump lawyer Rudy Giuliani and another attorney over alleged violations of computer fraud and data access related to a laptop computer Biden is said to have left at a Delaware repair shop.",
    "url": "https://www.cnbc.com/2023/09/26/hunter-biden-sues-rudy-giuliani-over-infamous-laptop.html"
  },
  {
    "text": "Booker Says Menendez Should Resign, Breaking Silence  —  The decision by Senator Cory Booker, a close ally, to condemn Senator Robert Menendez underscores the deepening crisis Mr. Menendez faces after his indictment.  —  Senator Cory Booker called on Senator Robert Menendez … ",
    "url": "https://www.nytimes.com/2023/09/26/nyregion/menendez-indictment-resignation-booker.html"
  },
  {
    "text": "Fulton DA prosecuting Trump, Young Thug says her family has been threatened  —  'It's been very troubling,' Fani Willis tells event crowd  —  X  —  Fulton County District Attorney Fani Willis, whose office is prosecuting cases involving former President Donald Trump … ",
    "url": "https://www.ajc.com/news/crime/fulton-da-prosecuting-trump-young-thug-says-her-family-has-been-threatened/QJZMKODGUJHWBGSBIMSPV3WDEM/"
  },
  {
    "text": "What Is J.D. Vance's Angle?  —  J.D. Vance was trying to find his groove.  I had just shown up at his office last week to interview the Ohio Republican about his first nine months in the Senate, where he has proved curiously hard to pigeonhole.  As we sat down, Mr. Vance — at 39 … ",
    "url": "https://www.nytimes.com/2023/09/26/opinion/jd-vance-trump.html"
  },
  {
    "text": "Judge Cannon Enters a Minute Order  —  Today, Judge Aileen Cannon in the Southern District of Florida finally ruled on the special counsel's request to hold Garcia hearings to resolve potential conflicts of interest the lawyers for Trump's two co-defendants in the Mar-a-Lago case may have … ",
    "url": "https://joycevance.substack.com/p/judge-cannon-enters-a-minute-order"
  },
  {
    "text": "Florida school district orders librarians to purge all books with LGBTQ characters  —  Librarians in public schools in Charlotte County, Florida, were instructed by the school district superintendent to remove all books with LGBTQ characters or themes from school and classroom libraries.",
    "url": "https://popular.info/p/florida-school-district-orders-librarians"
  },
  {
    "text": "The Coming Attack on an Essential Element of Women's Freedom  —  No-fault divorce has improved the lives of millions.  Now some extreme Republicans want to abandon it.  —  For the past half century, many women in America have enjoyed an unprecedented degree of freedom and legal protection … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/09/no-fault-divorce-laws-republicans-repeal/675371/"
  },
  {
    "text": "JPMorgan Settles Epstein Suits With U.S. Virgin Islands and James Staley  —  The bank agreed to pay $75 million to settle with the U.S. Virgin Islands and also reached a confidential settlement with a former top banker who pushed to keep the disgraced financier as a client.",
    "url": "https://www.nytimes.com/2023/09/26/business/jpmorgan-jeffrey-epstein-virgin-islands.html"
  },
  {
    "text": "Jewish leaders rip X, accuse Musk of antisemitism  —  A group of Jewish leaders published a letter warning of the rise in antisemitic rhetoric on X, formerly Twitter, and placed responsibility largely on owner Elon Musk — who they claimed has “facilitated and enabled” its growth.",
    "url": "https://thehill.com/policy/4223934-jewish-leaders-rip-x-and-elon-musk/"
  },
  {
    "text": "McCarthy pushes for Biden meeting with shutdown 5 days away  —  GOP leaders hope they'll be able to pass a handful of spending bills this week, believing it will give them a stronger hand in negotiations.  Their first test will be Tuesday night.",
    "url": "https://www.politico.com/live-updates/2023/09/26/congress/mccarthy-pushes-for-biden-meeting-00118186"
  }
]