[
  {
    "text": "3 takeaways from the South Carolina GOP primary  —  Donald Trump has swept the traditional early states in the Republican presidential nominating contest after defeating Nikki Haley on Saturday in South Carolina.  —  News organizations called the race shortly after polls closed … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/24/south-carolina-gop-primary-trump-haley/"
  },
  {
    "text": "Trump's request to suspend E. Jean Carroll's $83M verdict swiftly denied by judge  —  U.S. District Court Judge Lewis Kaplan declined a request to grant a stay after a jury ordered Donald Trump to pay writer E. Jean Carroll over $83 million for defamation.  —  “Twenty-five days … ",
    "url": "https://www.rawstory.com/trump-e-jean-carroll-stay-denied/"
  },
  {
    "text": "Beyond shock and awe: Inside Trump's potential second-term agenda  —  From nationwide abortion bans to classroom culture wars, assaults on climate science and political weaponization of the military, his return to the White House could make Trump 1.0 seem tame.",
    "url": "https://www.politico.com/news/2024/02/25/second-trump-term-00140488"
  },
  {
    "text": "Republicans Are Done With Mike Pence — Except Trump's VP Contenders  —  Intermediaries for Elise Stefanik, Kristi Noem and Tim Scott have been asking questions about how Pence handled the vetting gauntlet in 2016.  —  With the GOP presidential primary over in all but name … ",
    "url": "https://www.politico.com/news/magazine/2024/02/25/mike-pence-is-toxic-in-trump-world-but-vp-hopefuls-still-want-his-teams-wisdom-00142725"
  },
  {
    "text": "‘SNL’ Shames Terrified Republicans for Surrendering to Trump  —  The latest “SNL” cold open featured Jim Risch, Marco Rubio, Lindsey Graham, and Tim Scott saying out loud what everyone is already thinking.  —  Saturday Night Live put up its best cold open in quite a while this week … ",
    "url": "https://www.thedailybeast.com/snl-shames-terrified-republicans-for-surrendering-to-trump"
  },
  {
    "text": "Climate change is throwing the water cycle into chaos across the U.S.  —  As the planet continues to warm, this cycle is expected to be increasingly stretched, warped and broken.  —  The water cycle that shuttles Earth's most vital resource around in an unending, life-giving loop is in trouble.",
    "url": "https://www.nbcnews.com/science/science-news/climate-change-throwing-water-cycle-chaos-us-rcna137892"
  },
  {
    "text": "One of the world's biggest cities may be just months away from running out of water  —  Mexico City CNN  —  Alejandro Gomez has been without proper running water for more than three months.  Sometimes it comes on for an hour or two, but only a small trickle, barely enough to fill a couple of buckets.",
    "url": "https://www.cnn.com/2024/02/25/climate/mexico-city-water-crisis-climate-intl"
  },
  {
    "text": "Biden's frustration with the media boils over  —  Months out from November's high-stakes election, the White House and the Biden campaign are going public with growing frustration over how the president is being portrayed in the media.  —  Biden's camp is taking swings over press coverage … ",
    "url": "https://thehill.com/homenews/administration/4485566-joe-biden-donald-trump-media-frustration/"
  },
  {
    "text": "Congressman presses Elon Musk to provide SpaceX satellite services for US defense forces in Taiwan, report says  — A Congressman is urging Elon Musk to give SpaceX Starshield access to US forces in Taiwan.  — Refusal could breach SpaceX's contractual obligations with the US government, Forbes reported.",
    "url": "https://www.businessinsider.com/lawmaker-urges-elon-musk-provide-spacex-starshield-us-defense-taiwan-2024-2"
  },
  {
    "text": "Warren Buffett's son Howard has given $500M to Ukraine — he warns the US is making a historic mistake by pulling its support  — Business Insider interviewed Warren Buffett's son about his  support for Ukraine.  — Howard Buffett's foundation has given $520 million to Ukraine in humanitarian aid.",
    "url": "https://www.businessinsider.com/howard-buffett-gives-500-million-to-ukraine"
  },
  {
    "text": "Justice Thomas Hires Law Clerk Accused of Sending Racist Text Messages  —  Crystal Clanton, who is close with the Thomas family, has said she does not remember sending the messages, which emerged in 2017.  —  Justice Clarence Thomas recently hired a law clerk who was previously accused … ",
    "url": "https://www.nytimes.com/2024/02/24/us/crystal-clanton-clarence-thomas-clerk.html"
  },
  {
    "text": "Gov. Gavin Newsom's super PAC launches TV ad targeting GOP on abortion  —  Campaign for Democracy will run TV ads in Tennessee targeting two state bills that would restrict minors traveling out of state for abortion care.  —  California Democratic Gov. Gavin Newsom's super PAC is launching … ",
    "url": "https://www.nbcnews.com/politics/gov-gavin-newsoms-super-pac-launches-tv-ad-targeting-gop-abortion-rcna140342"
  },
  {
    "text": "Nazis mingle openly at CPAC, spreading antisemitic conspiracy theories and finding allies  —  The presence of the individuals has been a persistent issue at CPAC, and in previous years, conference organizers have ejected well known nazis and white supremacists, such as Nick Fuentes.",
    "url": "https://www.nbcnews.com/news/us-news/nazis-mingle-openly-cpac-spreading-antisemitic-conspiracy-theories-fin-rcna140335"
  },
  {
    "text": "How Johnson wooed Trump to back a GOP congressman targeted by Gaetz  —  Watch CNN's coverage of Donald Trump's involvement in key House Republican primaries on ‘Inside Politics Sunday with Manu Raju’ at 11 a.m. ET.﻿  —  Speaker Mike Johnson and his top lieutenants had a mission … ",
    "url": "https://www.cnn.com/2024/02/25/politics/mike-johnson-matt-gaetz-trump/"
  },
  {
    "text": "How ‘Libs of TikTok’ became a powerful presence in Oklahoma schools  —  The owner of the far-right social media account, who sits on a state advisory panel, has drawn attention since the death of a nonbinary student near Tulsa  —  LOS ANGELES — Far-right activist Chaya Raichik splits … ",
    "url": "https://www.washingtonpost.com/technology/2024/02/24/libs-tiktok-oklahoma-nonbinary-teen-death/"
  }
]