[
  {
    "text": "Biden declares ‘collective bargaining works’ after deal struck  —  President Biden on Thursday hailed the agreement made between the International Longshoremen's Association (ILA) union and the U.S. Maritime Alliance (USMX) to end the port strike, arguing that collective bargaining works and is essential to the economy.",
    "url": "https://thehill.com/homenews/administration/4915156-port-strike-end-agreement/"
  },
  {
    "text": "Striking port workers to return to work Friday as negotiators reach an agreement on wages  —  New York CNN  —  Striking members of the International Longshoremen's Association will be back to work at the ports on Friday, the union announced Thursday evening, as the union … ",
    "url": "https://www.cnn.com/2024/10/03/business/port-strike-union-deal/"
  },
  {
    "text": "Port strike deal ends no-win dilemma for Democrats  —  Quiet — and, finally, public — pressure from President Joe Biden and his team helped seal the agreement, people familiar with White House thinking said.  —  A dockworkers strike that threatened the U.S. supply chain weeks before an election … ",
    "url": "https://www.politico.com/news/2024/10/03/port-strike-ends-defusing-a-political-time-bomb-00182455"
  },
  {
    "text": "Playbook: Obama hits the campaign trail  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  MAKE TIME TO READ THIS ONE — “The Woman Who Made Kamala Harris — and Modern America,” by Michael Kruse for POLITICO Magazine: “SHYAMALA GOPALAN'S immigrant story explains … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/10/04/obama-hits-the-campaign-trail-00182496"
  },
  {
    "text": "Trump says if he thought he lost the 2020 election, he wouldn't be running again  —  Trump said toward the top of his remarks at a rally in Saginaw, Michigan, that if he thought he lost the 2020 presidential election, he wouldn't be running again.  —  “It was a rigged election.",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/trump-harris-presidential-election-live-updates-rcna173209/rcrd58425?canonicalCard=true"
  },
  {
    "text": "Former Colorado county clerk Tina Peters sentenced to 9 years for voting data scheme  —  A judge excoriated a Colorado county clerk for her crimes and lies before sentencing her Thursday to nine years behind bars for a data-breach scheme spawned from the rampant false claims about voting machine fraud in the 2020 presidential race.",
    "url": "https://apnews.com/article/tina-peters-colorado-clerk-election-vote-fraud-b456ce4f80dc97f4b967eb6297311a51"
  },
  {
    "text": "Trump's True Crowd Size Exposed in Embarrassing Video  —  Donald Trump was an hour and a half late to his rally in Saginaw, Michigan, on Thursday, but even the extra time couldn't muster more people to line the stadium.  —  “Who else fills big places like this at three in the afternoon?”",
    "url": "https://newrepublic.com/post/186758/donald-trump-crowd-size-exposed-video"
  },
  {
    "text": "Bruce Springsteen Endorses Kamala Harris for President  —  The rock star has long aligned himself with Democrats and been critical of former President Donald J. Trump.  —  Bruce Springsteen, the rock star and longtime critic of former President Donald J. Trump, endorsed Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/2024/10/03/us/politics/bruce-springsteen-kamala-harris-endorsement.html?unlocked_article_code=1.PU4.09b4.GT9amTu4QOtD&smid=url-share"
  },
  {
    "text": "Top Execs Exit Trump Media Amid Allegations of CEO's Mismanagement and Retaliation  —  Several people involved with the former president's company, operator of Truth Social, believe the departures were retaliation following internal complaints about CEO Devin Nunes to the company board.",
    "url": "https://www.propublica.org/article/trump-media-truth-social-executives-ousted-devin-nunes"
  },
  {
    "text": "Trump losing ground with women on economy, poll shows  —  An American University poll shows a majority of women trust Harris over Trump to address inflation and bring down the cost of living.  —  Not only do women prefer Vice President Kamala Harris over former President Donald Trump by 15 percentage points, according to a new poll.",
    "url": "https://www.politico.com/news/2024/10/04/trump-women-economy-poll-00182451"
  },
  {
    "text": "Democratic fears emerge on Wisconsin Senate race … - Baldwin leads by just two points in internal Democratic polling, a source familiar with the campaign told Axios. … - Democrats are on pace to be outspent by Republicans in the state every week until Election Day, with an infusion of around $20 million from GOP sources.",
    "url": "https://www.axios.com/2024/10/04/wisconsin-senate-race-baldwin-hovde"
  },
  {
    "text": "Photos Show New York Congressman in Blackface as Michael Jackson  —  Representative Mike Lawler, a Republican locked in a tight race for re-election, dressed as the pop star for Halloween as a college student in 2006.  —  Representative Mike Lawler of New York wore blackface as part … ",
    "url": "https://www.nytimes.com/2024/10/03/nyregion/lawler-blackface-michael-jackson.html?unlocked_article_code=1.PU4.QjF5.v5JniminTZBb&smid=url-share"
  },
  {
    "text": "Mixed verdict for 3 Memphis officers convicted in Tyre Nichols' fatal beating  —  Three former Memphis police officers were convicted Thursday in the 2023 fatal beating of Tyre Nichols, but were acquitted of the harshest charges they faced for a death that sparked national protests and calls for broad changes in policing.",
    "url": "https://apnews.com/article/tyre-nichols-beating-death-memphis-officers-trial-5e19e800cd5017c89cb652cfc8235ea2"
  },
  {
    "text": "Helene isn't the first time Trump inserted politics into a natural disaster … In the aftermath of Hurricane Helene, former President Donald Trump has blasted the Biden administration for its handling of the disaster — going so far as to accuse Democratic leaders of ignoring the needs of Republican storm victims.",
    "url": "https://www.eenews.net/articles/helene-isnt-the-first-time-trump-inserted-politics-into-a-natural-disaster/"
  },
  {
    "text": "Missouri judge blocks Biden student loan forgiveness that was cleared to proceed … The Biden administration's sweeping student loan forgiveness plan was temporarily blocked again Thursday by a Missouri judge, just one day after a federal judge in Georgia said he would let a restraining order against the relief expire.",
    "url": "https://www.cnbc.com/2024/10/03/biden-student-loan-forgiveness-blocked-again-missouri.html"
  },
  {
    "text": "The disappearing Bidens: A quiet end to a presidency … - Vice President Kamala Harris — who has praised Biden but doesn't routinely talk about him in her speeches — has had just one campaign event with him along with a few official events in Washington.  — First Lady Jill Biden … ",
    "url": "https://www.axios.com/2024/10/04/joe-biden-presidency-2024-election"
  },
  {
    "text": "How Trump Could Punish His Enemies  —  We look at why legal experts are concerned.  —  Donald Trump says Kamala Harris should be prosecuted for the Biden administration's border policies.  He wants President Biden to be prosecuted for corruption, Nancy Pelosi for her husband's stock trades … ",
    "url": "https://www.nytimes.com/2024/10/03/briefing/how-trump-could-punish-his-enemies.html"
  },
  {
    "text": "Senator tells Native American candidate to go back to where she came from, storms out of public event  —  A bipartisan forum in a small Latah County community took a turn when Republican Senate incumbent Dan Foreman stormed out of the event, following a racist outburst directed at a Native American candidate.",
    "url": "https://www.boisestatepublicradio.org/politics-government/2024-10-03/dan-foreman-racism-idaho-nez-perce-candidate-kendrick"
  },
  {
    "text": "No Time Like the Present for the UK to Give Away *gulp* Diego Garcia...  In this world, there have been “giveaways”  - like Oprah with her cars for you and you and YOU!!  —  And then there have been “giveaways,” or “givebacks' like, says, the Panama Canal.  —  Or Bagram.",
    "url": "https://hotair.com/tree-hugging-sister/2024/10/03/no-time-like-the-present-for-the-uk-to-give-away-gulp-diego-garcia-n3795360"
  }
]