[
  {
    "text": "Trump Shows Signs of Strength in Sun Belt Battlegrounds, Polls Find  —  New polls from The New York Times and Siena College showed Donald J. Trump ahead in Arizona and leading in tight races in Georgia and North Carolina.  —  Voters across the Sun Belt say that Donald J. Trump improved … ",
    "url": "https://www.nytimes.com/2024/09/23/us/politics/times-siena-polls-arizona-georgia-north-carolina.html?unlocked_article_code=1.M04.Hgpg.xK18tSe_NRsR&smid=url-share"
  },
  {
    "text": "The ‘policy’ mirage that undergirds Donald Trump's support  —  The former president and his supporters insist he wins a race centered on policy.  It's not because of Trump's detailed policy platform.  —  One of the central characteristics of the 2024 presidential election is its steadiness.",
    "url": "https://www.washingtonpost.com/politics/2024/09/23/policy-mirage-that-undergirds-donald-trumps-support/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3MDY0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4NDQ2Mzk5LCJpYXQiOjE3MjcwNjQwMDAsImp0aSI6ImYxMWY1NWNhLTc0YWMtNDMyOC05ZWRkLTEzYzJhNTk1YzM4MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzIzL3BvbGljeS1taXJhZ2UtdGhhdC11bmRlcmdpcmRzLWRvbmFsZC10cnVtcHMtc3VwcG9ydC8ifQ.yv3HcKEdyJu8jUhCOYO9Rxfvn8LDcZO53iAQI8Mw9y0&itid=gfta"
  },
  {
    "text": "Trump is at 48 percent.  How could this be possible but for widespread racism?  —  At this point, the racism is obvious.  How else does it make sense that 48 percent of registered voters in last week's Fox News poll say they have no problem putting Donald Trump back in the White House?",
    "url": "https://thehill.com/opinion/columnists/juan-williams/4890931-trump-racism-voters-support/"
  },
  {
    "text": "These companies are bankrolling a multi-million dollar effort to elect Mark Robinson governor of North Carolina  —  Even before securing the Republican nomination for Governor of North Carolina in March, Mark Robinson had a long and well-documented record of promoting conspiracy theories … ",
    "url": "https://popular.info/p/these-companies-are-bankrolling-a"
  },
  {
    "text": "State Sen. Mike McDonnell deflates GOP hopes for Nebraska winner-take-all in 2024  —  State Sen. Mike McDonnell announces leaving the Democratic Party after he was censured by the state and Douglas County Democrats.  LINCOLN — The Republican push to change how Nebraska awards … ",
    "url": "https://nebraskaexaminer.com/2024/09/23/state-sen-mike-mcdonnell-deflates-gop-hopes-for-nebraska-winner-take-all-in-2024/"
  },
  {
    "text": "Key Nebraska Republican Rejects Trump's Push to Shake Up Electoral Map  —  Mike McDonnell, a state senator, said he would not support an effort to change the state's electoral system to winner take all, an outcome that could have cost Kamala Harris an electoral vote.",
    "url": "https://www.nytimes.com/2024/09/23/us/politics/nebraska-mike-mcdonnell-electoral-vote-trump.html?unlocked_article_code=1.M04.sivX.p-U70YD2AlAG&smid=url-share"
  },
  {
    "text": "California AG sues Exxon over alleged lies about plastics pollution  —  California Attorney General Rob Bonta (D) on Monday filed a lawsuit against ExxonMobil, alleging that the company has engaged in a decades-long effort to mislead the public about the recyclability of plastics.",
    "url": "https://thehill.com/policy/energy-environment/4894500-california-exxonmobil-plastic-waste-lawsuit/"
  },
  {
    "text": "Trump gunman said to have left note: ‘This was an assassination attempt’  —  New evidence was filed in court ahead of a detention hearing for Ryan Routh, who is charged with weapons violations.  —  WEST PALM BEACH, Fla. — The gunman arrested near where Donald Trump was playing golf … ",
    "url": "https://www.washingtonpost.com/nation/2024/09/23/trump-ryan-routh-florida-threat/"
  },
  {
    "text": "Murder and other violent crime dropped across the U.S. last year, FBI data shows  —  Murder dropped 11.6% from 2022 to 2023, the largest single-year decline in the last 20 years.  Property crime was also down overall, while motor vehicle theft and shoplifting rose.",
    "url": "https://www.nbcnews.com/politics/justice-department/violent-crime-dropped-america-last-year-new-fbi-data-shows-rcna172217"
  },
  {
    "text": "Melania Trump was paid for a rare appearance at a political event.  It's not clear who cut the unusual six-figure check  —  Melania Trump has barely been seen on the campaign trail this year.  One of the few times she has appeared at a political event, she's received a six-figure paycheck … ",
    "url": "https://www.cnn.com/2024/09/23/politics/melania-trump-speaking-engagements"
  },
  {
    "text": "MAGA Sheriff's Post About Harris Yard Signs Gets Department Booted From Election Duties  —  BLEW IT  —  Bruce Zuchowski, a Trump-supporting Republican, likened migrants to “human locusts” and called the vice president a “Flip-Flopping, Laughing Hyena.”  —  The sheriff's department in Portage County … ",
    "url": "https://www.thedailybeast.com/maga-sheriffs-post-about-kamala-harris-yard-signs-gets-department-booted-from-election-duties"
  },
  {
    "text": "J.D. Vance Caught Lying About Egg Prices in Painfully Bad Video  —  J.D. Vance attempted to point out high prices in a recent campaign stunt at a grocery store, only to be caught with egg on his face.  —  On Saturday, the Trump War Room account on X posted a video of Vance visiting a grocery story … ",
    "url": "https://newrepublic.com/post/186233/jd-vance-caught-lying-egg-prices-video"
  },
  {
    "text": "She was accused of murder after losing her pregnancy.  SC woman now tells her story  —  Orangeburg, South Carolina , KFF Health News  —  Amari Marsh had just finished her junior year at South Carolina State University in May 2023 when she received a text message from a law enforcement officer.",
    "url": "https://www.cnn.com/2024/09/23/health/south-carolina-abortion-kff-health-news-partner/"
  },
  {
    "text": "Trump Media stock hits lowest point since 2021 after DJT lockup lifts … Shares of Trump Media sank Monday to their lowest price since 2021, days after majority owner Donald Trump and other company insiders got the green light to start selling their stakes in the Truth Social operator.",
    "url": "https://www.cnbc.com/2024/09/23/djt-trump-media-stock-drop-lockup.html"
  },
  {
    "text": "Matt Gaetz Hit With a Bar Complaint Following Allegations That He Attended a Sex Party With a Teenager  —  A Florida activist accused Gaetz of violating rules enforced by the Florida Bar.  — Copy  —  Just hours after court filings were released claiming that witnesses saw Rep. Matt Gaetz attend … ",
    "url": "https://www.notus.org/congress/gaetz-bar-association-sex-party"
  },
  {
    "text": "Resurfaced video shows Kamala Harris protesting against deporting migrants with disgraced celebrity  —  Vice President Kamala Harris in now promising to secure the border, but when she was a senator of California, she was a staunch opponent of deporting illegal immigrants.",
    "url": "https://www.dailymail.co.uk/news/article-13881751/kamala-harris-deportation-jussie-smollett.html"
  },
  {
    "text": "How the Congressional Hackathon helped the House work better for the People  —  Good afternoon from cloudy Washington, where fall arrived on Sunday, along with a continuing resolution that will, if enacted, avert a government shutdown in October.  (Thanks to Politico for linking to the bill, for folks who like to read then.)",
    "url": "https://civic-texts.ghost.io/how-the-congressional-hackathon-helped-the-house-work-better-for-the-people/"
  },
  {
    "text": "Zelensky: Trump doesn't know how to end war and Vance is too radical  —  The president of Ukraine criticises the Republican nominees as he visits the US to share his plan for victory over Russia  —  Donald Trump doesn't know how to stop the war in Ukraine, despite claiming he could end … ",
    "url": "https://www.telegraph.co.uk/us/politics/2024/09/23/zelensky-trump-doesnt-know-how-to-end-war-and-vance-radical/"
  },
  {
    "text": "JD Vance Has Turned to a Minnesota Republican to Help Him Prepare for the Debate  —  Donald J. Trump's running mate invited Representative Tom Emmer to stand in for his fellow Minnesotan, Gov. Tim Walz, ahead of the vice-presidential debate next month.  —  Senator JD Vance of Ohio … ",
    "url": "https://www.nytimes.com/2024/09/23/us/politics/vance-debate-prep-emmer.html"
  },
  {
    "text": "Trump Promises Immigrants He Wants to Deport Will Get Serial Numbers  —  Immigrants are no longer welcome in Donald Trump's America.  Instead, the Republican presidential nominee posited that under his potential second administration, he would round up and mass-deport noncitizens based on their “serial numbers.”",
    "url": "https://newrepublic.com/post/186239/donald-trump-full-holocaust-immigration"
  },
  {
    "text": "US is sending more troops to the Middle East as violence rises between Israel and Hezbollah  —  The U.S. is sending additional troops to the Middle East during a sharp spike in violence between Israel and Hezbollah forces in Lebanon that has raised the risk of a greater regional war, the Pentagon said Monday.",
    "url": "https://apnews.com/article/israel-lebanon-violence-war-hezbollah-63a15fa390a94acf46ef886cc5fb88db"
  },
  {
    "text": "Biden Administration Proposes Ban on Chinese Software in Vehicles  —  Federal officials acknowledged that few Chinese vehicles were on U.S. roads now, but said that the administration wanted to take proactive measures to strengthen national security.  —  The Biden administration announced … ",
    "url": "https://www.nytimes.com/2024/09/23/us/politics/chinese-software-ban-cars-biden.html"
  }
]