[
  {
    "text": "Trump approval sinks as Americans criticize his major policies, poll finds  —  After high expectations before he returned to office, most Americans say the president has made the economy worse.  —  As he nears the end of his first 100 days in office, President Donald Trump is facing growing opposition … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/27/trump-poll-approval-rating-100-days/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NzI2NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MTA4Nzk5LCJpYXQiOjE3NDU3MjY0MDAsImp0aSI6ImM4MDVkM2Y0LWU1ZDAtNGY1Yi05MmMwLTkzNWZhMWUwYzhhNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzI3L3RydW1wLXBvbGwtYXBwcm92YWwtcmF0aW5nLTEwMC1kYXlzLyJ9.9JTGanwIHAx27t6faYMkGv66fWprICpdIDGOupOvm8k"
  },
  {
    "text": "CNN Poll: Trump's approval at 100 days lower than any president in at least seven decades  —  Donald Trump won back the Oval Office and took charge of the government amid the strongest poll numbers of his political career, but as the 100-day mark of his presidency approaches … ",
    "url": "https://cnn.com/2025/04/27/politics/approval-rating-trump-100-days/"
  },
  {
    "text": "April 27, 2025, Statement on the Arrest of Suspects Allegedly Linked to DHS Secretary Robbery  —  Published By U.S. Secret Service Media Relations  —  WASHINGTON, D.C.  —  Special Agent in Charge of the Secret Service Washington Field Office Matt McCool released the following the statement:",
    "url": "https://www.secretservice.gov/newsroom/releases/2025/04/april-27-2025-statement-arrest-suspects-allegedly-linked-dhs-secretary"
  },
  {
    "text": "Cory Booker and Hakeem Jeffries Are Sitting in to Stand up for Medicaid  —  The lawmakers are having “An Urgent Conversation with the American People” on the Capitol steps to oppose Republican plans to cut public healthcare benefits  —  Sen. Cory Booker and House Minority Leader Hakeem Jeffries … ",
    "url": "https://www.rollingstone.com/politics/politics-news/booker-jeffries-capitol-sit-in-medicaid-1235326047/"
  },
  {
    "text": "American Panopticon  —  The Trump administration is pooling data on Americans.  Experts fear what comes next.  —  If you have tips about DOGE and its data collection, you can contact Ian and Charlie on Signal at @ibogost.47 and @cwarzel.92.  —  If you were tasked with building a panopticon … ",
    "url": "https://www.theatlantic.com/technology/archive/2025/04/american-panopticon/682616/?gift=guxsrl_dAdXUP9zqbQPWxc3WqSyzCi3gasJ-au_BC9g&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "'I don't know if President Trump has spoken with President Xi': Secretary Bessent  —  ABC News' Martha Raddatz interviews Treasury Secretary Scott Bessent on “This Week.”",
    "url": "https://abcnews.go.com/ThisWeek/video/1-1-treasury-secretary-scott-bessent-121212194"
  },
  {
    "text": "ICE promises bystanders who challenged Charlottesville raid will be prosecuted  —  After ICE raided a downtown Charlottesville courthouse and arrested two men, the federal agency is promising to prosecute the bystanders who challenged their authority.  —  ×  —  Week in Virginia",
    "url": "https://dailyprogress.com/news/local/crime-courts/article_e6ce6e4a-4161-476f-8d28-94150a891092.html"
  },
  {
    "text": "On DOGE, Directives, and DOJ  —  A new court filing reveals the most compelling evidence yet that the government has been spinning a fiction about DOGE in federal court.  —  @annabower.bsky.social  —  Meet The Authors … “US DOGE service advises and consults,” said Kendall Lindemann … ",
    "url": "https://www.lawfaremedia.org/article/on-doge--directives--and-doj"
  },
  {
    "text": "Trump Says He's Restoring Columbus Day to Its Former Prominence  —  President Donald Trump pledged to boost the status of Columbus Day, stoking a conflict with activists and some US states that argue the day should honor indigenous Americans rather than the Italian explorer's legacy.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-27/trump-says-he-s-restoring-columbus-day-to-its-former-prominence"
  },
  {
    "text": "Sen. Bernie Sanders says Democrats lack ‘vision for the future’: Full interview  —  In an exclusive interview with Meet the Press, Sen. Bernie Sanders (I-Vt.) says he and Rep. Alexandria Ocasio-Cortez (D-N.Y.) are trying to “strengthen democracy” rather than start a third party as they traverse … ",
    "url": "https://www.nbcnews.com/meet-the-press/video/sen-bernie-sanders-says-democrats-lack-vision-for-the-future-full-interview-238425157563"
  },
  {
    "text": "D.E.A. Says More Than 100 Undocumented Immigrants Were Detained in a Colorado Raid  —  Officials said agents found weapons and illicit drugs inside the nightclub, including cocaine, methamphetamine and a mixture of powdered drugs known as pink cocaine.  —  Federal agents raided … ",
    "url": "https://www.nytimes.com/2025/04/27/us/politics/immigrants-colorado-raid-dea.html"
  },
  {
    "text": "Trump officials deny U.S. citizen children were ‘deported’ to Honduras  —  The children's removals have intensified concerns about whether the administration is violating the rights of citizens and noncitizens.  —  Tom Homan, President Donald Trump's border czar, insisted Sunday … ",
    "url": "https://www.washingtonpost.com/immigration/2025/04/27/trump-deportation-citizens-children/"
  },
  {
    "text": "Transcript: Gary Cohn on “Face the Nation with Margaret Brennan,” April 27, 2025  —  The following is the transcript of an interview with Gary Cohn, IBM vice chairman and former director of the U.S. National Economic Council, that aired on “Face the Nation with Margaret Brennan” on April 27, 2025.",
    "url": "https://www.cbsnews.com/news/gary-cohn-ibm-face-the-nation-transcript-04-27-2025/"
  },
  {
    "text": "Your Home Without China  —  It's hard to imagine an American home without Chinese products.  —  Many essentials are imported almost entirely from China — and with new tariffs, they're likely to become more expensive.  —  We analyzed import data to show where Americans may see product shortages, fewer choices and price increases.",
    "url": "https://www.nytimes.com/interactive/2025/04/27/world/asia/china-products-us-tariffs-trump.html?unlocked_article_code=1.C08.2JdV.9cofYH6YYyNC&smid=url-share"
  },
  {
    "text": "Donald Trump Is Selling the White House to the Highest Bidder  — He turned a legitimate federal employee designation into a loophole.  By giving senior officials such as Elon Musk the title “special government employee,” Mr. Trump avoided requirements that they publicly disclose … ",
    "url": "https://www.nytimes.com/2025/04/27/opinion/trump-crypto-musk-spacex.html?unlocked_article_code=1.C08.DiVY.2LGUGa4tIpc2&smid=bs-share"
  },
  {
    "text": "Nine dead and multiple injured as driver plows into Vancouver crowd  —  The attack happened during a block party celebrating Filipino culture.  The crowd took the suspect into custody at the scene, and police say they are “confident” it was not an act of terrorism.",
    "url": "https://www.nbcnews.com/world/canada/multiple-dead-injured-driver-plows-vancouver-crowd-police-say-rcna203182"
  },
  {
    "text": "Justice Department halts funds for programs for victims of hate crimes, child abuse, school violence and more  —  CBS News has obtained a list of 365 federal grant programs halted this week by the Justice Department, disrupting programs to help victims of hate crime and sex trafficking, children who've suffered violence, and refugees.",
    "url": "https://www.cbsnews.com/news/federal-grants-halted-justice-department-hate-crime-sex-trafficking-refugees/"
  },
  {
    "text": "Trump's Newest IRS Chief Tries to Steer a Leaner Agency Through Turmoil  —  Michael Faulkender, fourth interim leader since January, promises modernization of agency systems in two years  —  WASHINGTON—It's Michael Faulkender's turn in the hot seat atop the Internal Revenue Service … ",
    "url": "https://www.wsj.com/politics/policy/michael-faulkender-acting-irs-commissioner-5f910134"
  },
  {
    "text": "The Missteps That Led to a Fatal Plane Crash at Reagan National Airport … As they flew south along the Potomac River on the gusty night of Jan. 29, the crew aboard an Army Black Hawk helicopter attempted to execute a common aviation practice.  It would play a role in ending their lives.",
    "url": "https://www.nytimes.com/2025/04/27/business/dc-plane-crash-reagan-airport.html"
  },
  {
    "text": "This Weekend in Politics, Bulletin 119  —  ... AG Pam Bondi is going to start locking up journalists: “Safeguarding classified, privileged, and other sensitive information is essential to effective governance and law enforcement.  Fed govt employees intentionally leaking sensitive information … ",
    "url": "https://www.meidasplus.com/p/this-weekend-in-politics-bulletin-83b"
  }
]