[
  {
    "text": "Major national outlets adopt House GOP spin to protect rich tax cheats  —  Several major national news outlets are promoting House Republicans' deceptive spin as the party seeks to leverage emergency funding for Israel to enact its top priority of protecting wealthy tax cheats.",
    "url": "https://www.mediamatters.org/joe-biden/major-national-outlets-adopt-house-gop-spin-protect-rich-tax-cheats"
  },
  {
    "text": "Israel strikes Gaza's Jabalya refugee camp  —  An Israeli strike targeting a Hamas commander in the densely populated Jabalya refugee camp in northern Gaza has left catastrophic damage and killed a large number of people, according to eyewitnesses and medics in the enclave.",
    "url": "https://www.cnn.com/2023/10/31/middleeast/jabalya-blast-gaza-intl/"
  },
  {
    "text": "Bolivia severs diplomatic ties with Israel, citing ‘crimes against humanity’  —  Bolivia's government said it had broken diplomatic ties with Israel on Tuesday, accusing Israel of committing crimes against humanity in its attacks on the Gaza Strip.  —  Bolivia “has decided to break diplomatic relations … ",
    "url": "https://www.reuters.com/world/americas/bolivia-severs-diplomatic-ties-with-israel-citing-crimes-against-humanity-2023-10-31/"
  },
  {
    "text": "Colleges braced for antisemitism and violence.  It's happening.  —  ‘I had Jewish blood on my hands,’ a Tulane student said after aiding a classmate who was assaulted at a pro-Palestinian rally  —  Recent days have witnessed what Jewish students and watchdog groups describe as a raft of antisemitic incidents on college campuses.",
    "url": "https://www.washingtonpost.com/education/2023/10/31/antisemitism-college-campuses-jewish-hamas-gaza/"
  },
  {
    "text": "Home schooling's rise from fringe to fastest-growing form of education  —  A district-by-district look at home schooling's explosive growth, which a Post analysis finds has far outpaced the rate at private and public schools  —  Home schooling has become — by a wide margin … ",
    "url": "https://www.washingtonpost.com/education/interactive/2023/homeschooling-growth-data-by-district/"
  },
  {
    "text": "Muslim Democrats give Biden ultimatum: Israel ceasefire by 5 or battleground states turn ‘red’  —  The National Muslim Democratic Council, a nationwide group of Democratic leaders and activists, threatened President Joe Biden that if he does not force Israel to reach a ceasefire with Hamas … ",
    "url": "https://justthenews.com/politics-policy/elections/muslim-democrats-give-biden-ultimatum-israel-ceasefire-5-or-battleground"
  },
  {
    "text": "Home Sellers Win $1.8 Billion as Jury Finds Realtors Inflated Commissions  —  Future homebuyers could be paying smaller commissions following the decision by a federal jury in Missouri  —  In a verdict that's roiling the real estate world, an eight-person jury in a federal Missouri court found … ",
    "url": "https://themessenger.com/business/realtors-found-liable-for-1-8-billion-for-keeping-commissions-artificially-high"
  },
  {
    "text": "‘Wake Up, It Is a Time to Be Concerned’: FBI Director Wray Issues Stark Warning at Committee Hearing  —  In a Senate Homeland Security Committee hearing on Tuesday, FBI Director Christopher Wray provided some worrying — if not outright alarming — answers to questions from U.S. Senator Rick Scott … ",
    "url": "https://townhall.com/tipsheet/spencerbrown/2023/10/31/fbi-director-wray-it-is-a-time-to-be-concerned-about-terrorism-in-the-us-n2630588"
  },
  {
    "text": "Romney steps in as Halloween dog parade emcee  —  Sen. Mitt Romney (R-Utah) stepped in as the emcee for the annual bipartisan Halloween dog parade after host Sen. Thom Tillis (R-N.C.) said Tuesday that he tested positive for COVID-19.  —  “Glad to host some furry friends in the Senate today … ",
    "url": "https://thehill.com/homenews/4286316-romney-steps-in-as-halloween-dog-parade-emcee/"
  },
  {
    "text": "Speaker Johnson taps veteran GOP operative as chief spokesperson  —  Raj Shah previously spent four years as senior vice president for public affairs at Fox Corporation.",
    "url": "https://www.politico.com/live-updates/2023/10/31/congress/johnsons-comms-hire-00124592"
  },
  {
    "text": "Idaho's first ‘abortion trafficking’ arrest  —  Police used geo-location data to place teen at Oregon clinic  —  Last week, an Idaho teenager and his mother were arrested for bringing the teen's girlfriend out-of-state for an abortion.  The pair were charged with multiple felonies … ",
    "url": "https://jessica.substack.com/p/idahos-first-abortion-trafficking"
  },
  {
    "text": "Israeli forces battle Hamas around Gaza City, as military says 800,000 have fled south  —  Israel advances in Gaza as Netanyahu rejects cease-fire  —  Israel rescues soldier held hostage by Hamas  —  A flurry of Israeli airstrikes Tuesday on a refugee camp near Gaza City leveled apartment buildings … ",
    "url": "https://apnews.com/article/israel-palestinians-hamas-gaza-war-news-10-31-2023-54ab6bd7f6861be86266770c245827e1"
  },
  {
    "text": "Tim Scott secures spot in third GOP debate following campaign strategy overhaul  —  Sen. Tim Scott of South Carolina has secured his spot in the third GOP presidential debate in Miami next week, announcing that he has met the final requirement — gathering enough individual donations needed … ",
    "url": "https://www.cbsnews.com/news/sen-tim-scott-secures-spot-third-gop-presidential-debate-miami-campaign-strategy-overhaul/"
  },
  {
    "text": "Republicans Out to Impeach Biden Have a Friend in House Speaker Mike Johnson  —  Jim Jordan says he's eager to work with his friend, Speaker Johnson, to uncover the 'Biden Family's numerous scandals'  —  House Republicans leading the impeachment investigation into President Joe Biden … ",
    "url": "https://themessenger.com/politics/republicans-out-to-impeach-biden-have-a-friend-in-house-speaker-mike-johnson"
  },
  {
    "text": "House Ethics says update on Santos investigation coming as possible expulsion vote looms  —  Washington — The House Ethics Committee said Tuesday it will announce its “next course of action” in its investigation into embattled Rep. George Santos by Nov. 17.",
    "url": "https://www.cbsnews.com/news/george-santos-house-ethics-committee-investigation-update/"
  },
  {
    "text": "Mesa high school teacher on administrative leave after students say he dressed up as devil, said ‘hail Satan’ to students  —  Mesa Public Schools said it is investigating the alleged incident.  —  MESA, Ariz. — A Mesa High School teacher is being investigated after reportedly dressing … ",
    "url": "https://www.12news.com/article/news/local/valley/mesa-teacher-on-administrative-leave-after-students-say-he-dressed-up-as-devil-said-hail-satan-to-students/75-e5d398be-5171-4a2c-bb27-dc6909c73bd0"
  }
]