[
  {
    "text": "Scoop: Former GOP Rep. Charlie Dent voted for Kamala Harris … - Some are going as far as to actively campaign for Harris, with former Reps. Adam Kinzinger (R-Ill.) and Barbara Comstock (R-Va.) appearing with the vice president at a rally in the key battleground of Pennsylvania on Wednesday.",
    "url": "https://www.axios.com/2024/10/17/charlie-dent-2024-republicans-trump-harris"
  },
  {
    "text": "Trump World in Talks With Haley for Eleventh-Hour Joint Campaign Event  —  DONALD TRUMP'S ONETIME U.N. ambassador and former primary rival, Nikki Haley, is in talks to join him on the campaign trail in an attempt to win over disaffected Republicans, sources familiar with the discussions tell The Bulwark.",
    "url": "https://www.thebulwark.com/p/trump-world-in-talks-with-haley-for"
  },
  {
    "text": "Trump's Meandering Speeches Motivate His Critics and Worry His Allies  —  Some advisers and allies of former President Donald J. Trump are concerned about his scattershot style on the campaign trail as he continues to veer off script.  —  In the final weeks of the 2020 election … ",
    "url": "https://www.nytimes.com/2024/10/17/us/politics/trump-rally-speeches.html?unlocked_article_code=1.TE4.xen_.kuDAxMqyN3xf&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump delivers profanity, below-the-belt digs at Catholic charity banquet  —  The only person off limits for Trump's roast was himself.  —  NEW YORK — Republican presidential nominee Donald Trump used his remarks at a Catholic charity banquet here on Thursday to skewer prominent Democrats, often in off-color terms.",
    "url": "https://www.washingtonpost.com/politics/2024/10/17/trump-harris-al-smith-dinner/"
  },
  {
    "text": "Even Fox News's Bret Baier Admits Harris Outsmarted Him in Interview  —  Fox News's Brett Baier went on the offensive during an interview with Kamala Harris Wednesday night, but even he had to admit she got the best of him.  —  In a segment reacting to his own contentious interview … ",
    "url": "https://newrepublic.com/post/187245/kamala-harris-fox-news-bret-baier-roasted-interview"
  },
  {
    "text": "Fox News anchor Bret Baier admits Kamala Harris did damage to Trump: ‘She was on a mission’  —  Fox News anchor Bret Baier is taking criticism from all sides:  — Donald Trump supporters are screaming that that the anchor from the Trump-friendly cable giant wasn't tough enough … ",
    "url": "https://www.nj.com/politics/2024/10/fox-news-anchor-bret-baier-admits-kamala-harris-did-damage-to-trump-she-was-on-a-mission.html"
  },
  {
    "text": "Harris's Harsh Takedown of Fox's Bret Baier Exposes MAGA's Biggest Lie  —  Judging by the video that Kamala Harris's campaign is circulating, her aides are pleased with one particular exchange during her interview with Fox News's Bret Baier.  In it, Harris dressed down Baier for playing video … ",
    "url": "https://newrepublic.com/article/187269/harriss-harsh-takedown-foxs-bret-baier-exposes-magas-biggest-lie"
  },
  {
    "text": "Statement from President Joe Biden on the Death of Yahya Sinwar  —  Early this morning, Israeli authorities informed my national security team that a mission they conducted in Gaza likely killed Hamas leader Yahya Sinwar.  DNA tests have now confirmed that Sinwar is dead.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/10/17/statement-from-president-joe-biden-on-the-death-of-yahya-sinwar/"
  },
  {
    "text": "Biden tells Obama 'she's not as strong as me' — and ex-prez agrees 'that's true' at Ethel Kennedy service  —  WASHINGTON — President Biden griped to former President Barack Obama that “she” is “not as strong as me” — with Obama agreeing “that's true” — in a stunning off-mic conversation deciphered … ",
    "url": "https://nypost.com/2024/10/17/us-news/biden-told-obama-shes-not-as-strong-as-me-and-ex-prez-agreed-thats-true-at-ethel-kennedy-funeral/"
  },
  {
    "text": "Critics drag Harris for ‘cringe’ pre-recorded video aired during Catholic charity dinner  —  Critics of Harris called her pre-recorded Al Smith dinner video ‘historically bad’  —  Conservatives and critics on social media dragged Vice President Kamala Harris over her “cringe” … ",
    "url": "https://www.foxnews.com/politics/critics-drag-harris-cringe-pre-recorded-video-aired-during-catholic-charity-dinner"
  },
  {
    "text": "When the Top General in the U.S. Says You're ‘Fascist to the Core’  —  Toward the end of his tenure, Gen. Mark Milley, who was the chairman of the Joint Chiefs of Staff from 2019 to 2023, told Bob Woodward of The Washington Post that Donald Trump was a fundamental threat to the safety and integrity of the United States.",
    "url": "https://www.nytimes.com/2024/10/18/opinion/trump-woodward-milley-mass-deportation.html?unlocked_article_code=1.TE4.aEQr.bu63SohLeWP4&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "META/Facebook Engineer Admits That Company Is Rigging the Election  —  James O'Keefe strikes again.  —  At this rate, lefties are going to quit dating people since the technique he uses is the “honeypot” in which people open up on what they assume are legitimate dates.",
    "url": "https://hotair.com/david-strom/2024/10/17/metafacebook-engineer-admits-that-company-is-rigging-the-election-n3795933"
  },
  {
    "text": "Scoop: Google will block election ads after polls close … - Google is implementing the policy “out of an abundance of caution and to limit the potential for confusion, given the likelihood that votes will continue to be counted after Election Day,” per a spokesperson.",
    "url": "https://www.axios.com/2024/10/17/google-block-election-ads-nov-5"
  },
  {
    "text": "Trump assassination suspect demands Judge Cannon recuse from case  —  Ryan Routh, the man charged with attempting to assassinate former President Trump at his Florida golf course last month, asked U.S. District Judge Aileen Cannon on Thursday to recuse herself from the case because Trump appointed … ",
    "url": "https://thehill.com/regulation/court-battles/4940160-ryan-routh-trump-assassination-cannon-recuse/"
  },
  {
    "text": "Jan. 6 rioter who attacked multiple officers sentenced to 17 months in prison  —  The widow of an MPD officer delivered an emotional victim impact statement.  —  Demonstrators swarm the U.S. Capitol building during a protest in Washington, D.C., Jan. 6, 2021.",
    "url": "https://abcnews.go.com/Politics/jan-6-rioter-attacked-multiple-officers-sentenced-17/story?id=114914567"
  },
  {
    "text": "U.S. judge blocks DeSantis admin's threats to broadcasters over Amendment 4 ads  —  Update: A federal judge temporarily barred the DeSantis administration from intimidating and coercing television stations that air ads in support of the proposed Amendment 4, which would bar government interference in abortion.",
    "url": "https://floridaphoenix.com/2024/10/17/federal-judge-rebukes-attorney-defending-desantis-admins-threats-to-broadcasters/"
  },
  {
    "text": "Turns out we'll see a big Jack Smith document dump before the election  —  U.S. District Judge Tanya Chutkan has agreed to release a dossier of evidence amassed by special counsel Jack Smith, ruling Thursday that the high public interest in the document outweighs Trump's demand that she keep it hidden until after the election.",
    "url": "https://www.politico.com/live-updates/2024/10/17/2024-elections-live-coverage-updates-analysis/more-trump-evidence-coming-00184297"
  },
  {
    "text": "The flu shot is different this year, thanks to COVID  —  This year's flu shot will be missing a strain of influenza it's protected against for more than a decade.  —  That's because there have been no confirmed flu cases caused by the Influenza B/Yamagata lineage since spring 2020.",
    "url": "https://www.npr.org/sections/shots-health-news/2024/10/17/nx-s1-5155104/flu-shot-vaccine-b-yamagata-extinct"
  },
  {
    "text": "The Biden administration has canceled student loans for more than 1 million in public service jobs  —  A student loan cancellation program for public service workers has granted relief to more than 1 million Americans — up from just 7,000 who were approved before it was updated by the Biden administration two years ago.",
    "url": "https://apnews.com/article/student-loan-cancellation-forgiveness-debt-774b0ee69f911f68f646a066031ee604"
  },
  {
    "text": "Ruben, Kate Gallego's divorce records unsealed.  Here's what is in them  —  (This story was updated to add new information.)  —  U.S. Senate candidate Ruben Gallego filed suit to end his marriage with Phoenix Mayor Kate Gallego just before she gave birth to their son and sought to keep … ",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/10/17/ruben-kate-gallegos-divorce-records-unsealed-after-legal-battle-ends/75694151007/"
  }
]