[
  {
    "text": "Helicopter Carrying Iran's President Has Crashed, State Media Reports  —  Rescuers are trying to locate the helicopter on which President Ebrahim Raisi and Foreign Minister Hossein Amir Abdollahian were traveling, state media reported.  Their status is unknown.",
    "url": "https://www.nytimes.com/2024/05/19/world/middleeast/iran-president-helicopter-crash.html"
  },
  {
    "text": "Iran State TV Says ‘No Sign of Life’ at Helicopter Crash Site  — Raisi was in Iran's East Azerbaijan province to inaugurate dam  — President's entourage includes foreign minister, also missing  —  Iranian President Raisi Missing After Helicopter Crash",
    "url": "https://www.bloomberg.com/news/articles/2024-05-19/air-fleet-of-iran-s-raisi-involved-in-incident-iranian-state-tv"
  },
  {
    "text": "Iran's president, foreign minister and others found dead at helicopter crash site, state media says  —  Iranian President Ebrahim Raisi, the country's foreign minister and others have been found dead at the site of a helicopter crash Monday after an hourslong search through a foggy … ",
    "url": "https://apnews.com/article/iran-president-ebrahim-raisi-426c6f4ae2dd1f0801c73875bb696f48"
  },
  {
    "text": "Trump at NRA convention floats a 3-term presidency  —  The former president has more recently shut down the proposition of seeking a third term, which is barred by the Constitution.  —  Former President Donald Trump on Saturday floated the idea of a third term if he wins in November.",
    "url": "https://www.politico.com/news/2024/05/18/trump-at-nra-convention-floats-a-three-term-presidency-00158786"
  },
  {
    "text": "Trump floats idea of three-term presidency at NRA convention  —  During a bombastic speech in Dallas, GOP frontrunner asks: ‘Are we going to be considered three-term?  Or two-term?’  —  Donald Trump flirted with the idea of being president for three terms - a clear violation of the US constitution … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/19/trump-nra-convention-dallas"
  },
  {
    "text": "Joint Statement From the U.S. Department of Defense and the Department of National Defense of the Republic of Niger  —  Representatives of the U.S. Department of Defense and the Department of National Defense of the Republic of Niger met from May 15 to 19, 2024, in Niamey, Republic of Niger … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3780392/joint-statement-from-the-us-department-of-defense-and-the-department-of-nationa/"
  },
  {
    "text": "Biden vows to fight ‘poison of white supremacy’ at Morehouse speech  —  Speech warmly received at historically Black college despite backlash from students in weeks leading to address over war  —  Joe Biden told graduating students of Morehouse College that American democracy has failed the Black community … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/19/biden-morehouse-graduation-speech"
  },
  {
    "text": "Hungary's far-right PM Viktor Orbán has made “some smart decisions,” Sen. J.D. Vance says  —  Washington — Republican Sen. J.D. Vance of Ohio, rumored to be one of former President Donald Trump's vice-presidential contenders, said Sunday that the U.S “could learn from” … ",
    "url": "https://www.cbsnews.com/news/jd-vance-viktor-orban-smart-decisions-face-the-nation/"
  },
  {
    "text": "Democrats tee up showdown with GOP over non-citizen voting … - This dynamic has played out repeatedly in the 118th Congress - with House Republicans using their majority to try to overturn progressive D.C. laws and squeeze Democrats in the process.  — Republicans' campaign apparatus … ",
    "url": "https://www.axios.com/2024/05/19/house-democrats-republicans-noncitizen-voting-dc"
  },
  {
    "text": "Senate Democrats don't believe Biden's bad polls, either … - “No, I do not think that they are accurate,” Sen. Debbie Stabenow (D-Mich.) told Axios. … - “The polls showed that I was down when I entered my race. … - Now, Democrats say the polls are missing key voter dynamics on their side.",
    "url": "https://www.axios.com/2024/05/19/biden-senators-swing-states-polling"
  },
  {
    "text": "RFK Jr. lists voting address at Westchester home — that's in foreclosure and neighbors have never seen him  —  Presidential candidate Robert F. Kennedy Jr. lists his residence to vote as a tony Westchester County address — which is in foreclosure proceedings for non-payment, court records show.",
    "url": "https://nypost.com/2024/05/19/us-news/rfk-jr-lists-voting-address-at-westchester-home-thats-in-foreclosure-and-neighbors-have-never-seen-him/"
  },
  {
    "text": "Lawyer preparation suggests Trump won't testify in New York trial  —  Awaiting final word from the mercurial defendant, the judge is proceeding as if Trump will not take the stand.  —  After brashly declaring he wanted to testify in his criminal trial, it appears increasingly unlikely … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/18/trump-trial-testifying/"
  },
  {
    "text": "Sen. Marco Rubio won't commit to accepting 2024 election results  —  Rubio blamed Democrats for opposing “every Republican victory since 2000.  Every single one.”  —  Florida GOP Sen. Marco Rubio, widely seen as a potential vice presidential pick for former President Donald Trump … ",
    "url": "https://www.nbcnews.com/politics/2024-election/marco-rubio-2024-election-results-rcna152954"
  },
  {
    "text": "Full transcript of “Face the Nation,” May 19, 2024  —  On this “Face the Nation” broadcast, moderated by Margaret Brennan:  — Sen. J.D. Vance, Republican of Ohio  — Sen. Gary Peters, Democrat of Michigan  — Oksana Markarova, Ukrainian ambassador to the U.S.",
    "url": "https://www.cbsnews.com/news/face-the-nation-full-transcript-05-19-2024/"
  }
]