[
  {
    "text": "3 ways Trump might try to defuse the Epstein mess  —  President Trump isn't ready to course-correct over how his administration has handled the Jeffrey Epstein evidence.  — But officials and advisers are considering at least three ways Trump could try to defuse an issue that … ",
    "url": "https://www.axios.com/2025/07/14/trump-epstein-maga-defuse-mess"
  },
  {
    "text": "Tucker Carlson leads MAGA's worried warriors in questioning Trump  —  The former Fox News host and “America First” leader spoke with NBC News as MAGA influencers rebel over amnesty, Iran and the Epstein files.  —  As President Donald Trump weighed U.S. involvement in the conflict between Israel … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/tucker-carlson-maga-trump-rcna217473"
  },
  {
    "text": "Trump says US will send Patriot missiles to Ukraine: ‘They desperately need’ them  —  WASHINGTON — President Donald Trump said the United States will send Patriot air defense missiles to Ukraine that will be reimbursed for by the European Union, offering critical help to Kyiv as it battles an onslaught of Russian drone attacks.",
    "url": "https://www.usatoday.com/story/news/world/2025/07/13/donald-trump-patriot-air-defense-systems-missiles-ukraine-russia/85154117007/"
  },
  {
    "text": "Trump to announce “aggressive” Ukraine weapons plan  —  President Trump will announce a new plan to arm Ukraine on Monday that is expected to include offensive weapons, two sources with knowledge of the plans tell Axios. … - U.S., Ukrainian and European officials hope the weapons will shift … ",
    "url": "https://www.axios.com/2025/07/14/trump-ukraine-weapons-missiles-russia"
  },
  {
    "text": "Bondi Fires Her Personal Ethics Chief as DOJ Purge Continues  —  Attorney General Pam Bondi has fired her personal ethics adviser, removing the Justice Department's top official responsible for counseling the most senior political appointees, according to two people familiar with the move.",
    "url": "https://news.bloomberglaw.com/us-law-week/bondi-fires-her-personal-ethics-chief-as-doj-purge-continues"
  },
  {
    "text": "Under Trump, the government mobilizes in response to fringe theories  —  Trump officials have assigned government workers and spent taxpayer dollars to address conspiracy theories and easily-disproven assertions  —  After President Donald Trump wrongly suggested that Social Security funds … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/14/under-trump-government-mobilizes-response-fringe-theories/"
  },
  {
    "text": "Tigers players aren't worried about deportation but union suggests they carry documents  — The MLBPA advises players to carry documentation and offers support regarding immigration issues.  — Even high-profile athletes are not immune to immigration issues, as demonstrated by recent cases.",
    "url": "https://eu.freep.com/story/sports/mlb/tigers/2025/07/13/tigers-arent-worried-about-deportation-but-told-to-carry-documents/84507852007/"
  },
  {
    "text": "Exclusive: Hundreds at Alligator Alcatraz have no criminal charges, Miami Herald learns  —  Hundreds of immigrants with no criminal charges in the United States are being held at Alligator Alcatraz, a detention facility state and federal officials have characterized as a place where “vicious” … ",
    "url": "https://www.miamiherald.com/news/local/immigration/article310541810.html"
  },
  {
    "text": "Gov. Hobbs demands inquiry into federal response to Grand Canyon Lodge fire  —  Gov. Katie Hobbs questioned the federal government's handling of the Dragon Bravo Fire, which destroyed numerous structures on the North Rim of the Grand Canyon, including the historic Grand Canyon Lodge.",
    "url": "https://eu.azcentral.com/story/news/local/arizona-breaking/2025/07/13/hobbs-inquiry-north-rim-fire/85145940007/"
  },
  {
    "text": "Biden Says He Made the Clemency Decisions That Were Recorded With Autopen … Toward the end of his term as president, Joseph R. Biden Jr. reduced the sentences of nearly 4,000 federal convicts and pre-emptively pardoned dozens of politically prominent people he saw as potential targets … ",
    "url": "https://www.nytimes.com/2025/07/13/us/politics/biden-pardon-autopen-trump.html"
  },
  {
    "text": "House Democrat floats radical solution to Congress' age problem  —  Rep. Marie Gluesenkamp Perez is proposing something unprecedented: Having Congress' ethics office effectively adjudicate whether lawmakers are too cognitively impaired to do their jobs.",
    "url": "https://www.axios.com/2025/07/14/congress-age-mental-marie-gluesenkamp-perez"
  },
  {
    "text": "Trump Booed By Soccer Fans at FIFA World Cup Final  —  The president was in New Jersey for the final of the U.S.-hosted tournament.  —  SUPES RISE TO THE TOP  —  This marks yet another victory for Warner Bros. following a series of box office flops.  —  SHOP WITH SCOUTED  —  CHEERS",
    "url": "https://www.thedailybeast.com/trump-booed-by-soccer-fans-at-fifa-world-cup-finals/"
  },
  {
    "text": "I Triggered Another Federal Investigation  —  I'm committed to providing you with documents other media refuse to publish; but I can only do that with your help.  Funding hasn't been great lately - please become a paid subscriber!  —  The California National Guard cut off soldier access … ",
    "url": "https://www.kenklippenstein.com/p/i-triggered-another-federal-investigation"
  },
  {
    "text": "Andrew Cuomo set to run as an independent in NYC mayoral race — but there's a catch  —  Andrew Cuomo is expected to announce plans to stay in the New York City Mayoral race as an independent, despite his stunning loss to socialist Zohran Mamdani — with critics blasting the disgraced ex-governor as a … ",
    "url": "https://nypost.com/2025/07/13/us-news/andrew-cuomo-set-to-run-as-independent-in-nyc-mayoral-race/"
  },
  {
    "text": "What we know about the shooting at a Kentucky church  —  A now-deceased suspect shot a member of law enforcement Sunday in Fayette County, Kentucky, before fleeing to a Baptist church, leaving multiple victims, according to state officials. … - The trooper who was shot and others … ",
    "url": "https://www.axios.com/2025/07/13/kentucky-church-shooting-what-we-know"
  },
  {
    "text": "FEMA search and rescue teams take days to reach Texas after flooding as agency faces overhaul  —  Multiple urban search and rescue teams from across the country that responded to the deadly floods in central Texas told CNN they were not deployed by the Federal Emergency Management Agency until … ",
    "url": "https://cnn.com/2025/07/13/politics/fema-texas-flooding-search-rescue"
  },
  {
    "text": "Zohran Mamdani and Mahmoud Khalil Are in on the Joke  —  What it feels like to laugh when the world expects you to disappear.  —  I sometimes say that I consider myself a junior-varsity Muslim.  Whether this comes off as a joke or as an invitation for scolding (spoken or unspoken … ",
    "url": "https://www.newyorker.com/news/essay/zohran-mamdani-and-mahmoud-khalil-are-in-on-the-joke"
  },
  {
    "text": "Please Shout Fire.  This Theater Is Burning  —  The United States is being destroyed from within, and mainstream journalism isn't making that clear.  When I was a kid, there was a popular phrase—\"what if they had a war and no one came?\"  What if we were in a war and no one noticed?",
    "url": "https://www.meditationsinanemergency.com/please-shout-fire-this-tis-burning/"
  },
  {
    "text": "Elmo's X account gets hacked, posts antisemitic messages on social media  —  The official X account of the Sesame Street character, Elmo, was allegedly hacked on Sunday.  —  Several hate-filled posts with slurs and antisemitic messages were posted by the X account of the beloved Sesame Street puppet.",
    "url": "https://www.washingtonexaminer.com/news/3469974/elmo-account-hacked-antisemitic-messages/"
  },
  {
    "text": "A clinic blames its closing on Trump's Medicaid cuts.  Patients don't buy it.  —  A clinic in rural Nebraska has become a political flash point after tying its looming closure to Trump's law cutting Medicaid.  —  CURTIS, Nebraska — The only health clinic here is shutting down … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/13/trump-tax-bill-medicaid-rural/"
  }
]