[
  {
    "text": "Chuck Schumer on Democrats, Antisemitism and His Shutdown Retreat  —  Philip Montgomery for The New York Times  —  It has been quite a week for Chuck Schumer.  When I spoke to the Senate minority leader on Monday, we talked about a lot of things: the direction of his party … ",
    "url": "https://www.nytimes.com/2025/03/16/magazine/chuck-schumer-interview.html?unlocked_article_code=1.4U4.a_Nh.s7z6d3rD9zaE&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Democratic Party hits new polling low, while its voters want to fight Trump harder  —  Unlike in Trump's first term, Democratic voters say 2-to-1 they want party leaders to fight rather than compromise, even at the risk of not getting things done, per the NBC News poll.",
    "url": "https://www.nbcnews.com/politics/politics-news/democratic-party-hits-new-polling-low-voters-want-fight-trump-harder-rcna196161"
  },
  {
    "text": "CNN Poll: Democratic Party's favorability drops to a record low  —  The Democratic Party's favorability rating among Americans stands at a record low, according to a new CNN poll conducted by SSRS, fueled in part by dimming views from its own frustrated supporters.",
    "url": "https://www.cnn.com/2025/03/16/politics/cnn-poll-democrats"
  },
  {
    "text": "Trump administration deports hundreds of migrants, despite judge's order stopping removal  —  The Trump administration has transferred hundreds of immigrants to El Salvador despite a federal judge's order temporarily barring the deportations under an 18th century wartime declaration targeting … ",
    "url": "https://apnews.com/article/trump-venezuela-el-salvador-immigration-dd4f61999f85c4dd8bcaba7d4fc7c9af"
  },
  {
    "text": "US deports hundreds of Venezuelans despite court order  —  A plane carrying more than 200 Venezuelans deported by the US has landed in El Salvador, hours after a US judge ordered the Trump administration not to do so.  —  El Salvador's president, Nayib Bukele, wrote on social media … ",
    "url": "https://www.bbc.com/news/articles/cp9yv1gnzyvo"
  },
  {
    "text": "He voted for Trump.  Now his wife sits in an ICE detention center.  —  Bradley Bartell and Camila Muñoz had a familiar small-town love story, before they collided with immigration politics.  —  They met through mutual friends, had a first date at the local steakhouse … ",
    "url": "https://www.usatoday.com/story/news/nation/2025/03/16/mass-deportation-ice-detains-non-criminals/82304354007/"
  },
  {
    "text": "Trump tapped Kari Lake to run VOA.  Then he dismantled it.  —  Lake had big plans to transform the outlet into a powerful “weapon” to fight an “information war.”  Instead, the president has essentially shut it down.  —  Just now  —  During his first term, Donald Trump accused Voice … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/16/trump-voa-voice-of-america/"
  },
  {
    "text": "Nervous about Trump, international tourists scrap their U.S. travel plans  —  The Trump administration's hard stance on tariffs and other international policies has some travelers rethinking where they vacation.  —  International travelers concerned about President Donald Trump's trade policies … ",
    "url": "https://www.washingtonpost.com/business/2025/03/16/international-tourism-travel-trump-canada/"
  },
  {
    "text": "Trade War Retaliation Will Hit Trump Voters Hardest  —  The counties where tariffs could hit jobs, by presidential vote winner  —  Source: New York Times analysis of data from Lightcast and the Bureau of Labor Statistics' Quarterly Census of Employment and Wages.  Note: Vote results are for the 2024 U.S. presidential election.",
    "url": "https://www.nytimes.com/interactive/2025/03/15/business/economy/tariffs-trump-maps-voters.html?unlocked_article_code=1.4U4.ttEE.d5kGMuP3mV8b&smid=url-share"
  },
  {
    "text": "Don't Fool Yourself Into Thinking It Will Stop With Columbia  —  Columbia University is now the epicenter of the American culture war.  The Trump administration is targeting a former Columbia student — and the university itself — as a test case for its new authoritarian regime.",
    "url": "https://www.nytimes.com/2025/03/16/opinion/trump-khalil-columbia-speech.html"
  },
  {
    "text": "Wall Street hoped Scott Bessent would keep Trump in check.  He had other ideas.  —  The Treasury secretary's muted reassurances to financial markets shows there may be no one in the administration willing to stand in the way of Trump's agenda.  —  Treasury Secretary Scott Bessent … ",
    "url": "https://www.politico.com/news/2025/03/16/wall-street-hoped-scott-bessent-would-keep-trump-in-check-he-had-other-ideas-00231771"
  },
  {
    "text": "Featured Comment  —  Bill Clinton enacted his Reinventing Government package of streamlining restructuring (REIGO) in 1993, when he still held legislative majorities.  It was passed by a margin of ONE VOTE.  Al Gore was the one who actually drafted the plan in writing … ",
    "url": "https://www.gocomics.com/doonesbury/2025/03/16"
  },
  {
    "text": "Surgeon and Professor Is Deported to Lebanon Despite a Judge's Order  —  Dr. Rasha Alawieh, a kidney transplant specialist and Brown University professor who had a valid visa, was expelled in apparent defiance of a court order.  —  A kidney transplant specialist and professor … ",
    "url": "https://www.nytimes.com/2025/03/16/us/brown-university-rasha-alawieh-professor-deported.html"
  },
  {
    "text": "‘Not getting the donations’: DC insider notes Kennedy Center decline after Trump takeover  —  A longtime insider who has been at the center of the Washington, D.C. social scene for decade claims Donald Trump's takeover of the Kennedy Center is destroying the venerable institution as ticket sales dry up … ",
    "url": "https://www.rawstory.com/trump-kennedy-center-2671337514/"
  },
  {
    "text": "132. Five Questions About Trump's Alien Enemy Act Proclamation  —  A quick take on some of the questions raised by President Trump's ... dubious invocation of a 1798 statute as a basis for arresting, detaining, and removing non-citizens with ties to Tren de Aragua.",
    "url": "https://www.stevevladeck.com/p/132-five-questions-about-trumps-alien"
  },
  {
    "text": "Nita M. Lowey, Tenacious New York Representative, Dies at 87  —  A Democrat, she represented Westchester County for three decades and became the first woman to lead the powerful House Appropriations Committee.  —  Nita M. Lowey, who represented a congressional district based in Westchester County … ",
    "url": "https://www.nytimes.com/2025/03/16/us/politics/nita-m-lowey-dead.html"
  },
  {
    "text": "A Trump county worries Medicaid cuts could throw them back into opioid spiral  —  The president has said entitlement programs like Medicaid, Medicare and Social Security will remain untouched, even as he pushes for a contraction of federal spending.  —  HARLAN, Ky. — Candice Fee … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/16/medicaid-cuts-addiction-treatment/"
  },
  {
    "text": "Top broadband official exits Commerce Department with sharp Musk warning  —  “Stranding all or part of rural America with worse internet so that we can make the world's richest man even richer is yet another in a long line of betrayals by Washington,” Evan Feinman warned.",
    "url": "https://www.politico.com/news/2025/03/16/official-exits-commerce-department-musk-warning-00232278"
  },
  {
    "text": "Trump's Moves Are Boosting Stocks ... Overseas  —  For years, the S&P 500 soared above the stock indexes of other countries.  But since Trump's inauguration, it has fallen 6 percent and is now trailing major markets in Europe and China.  —  President Trump has promised to create an age … ",
    "url": "https://www.nytimes.com/2025/03/16/business/trump-sp-500-stocks-europe-china.html"
  },
  {
    "text": "What Authoritarianism Means  —  An audio version of this piece will be added by Monday morning.  —  It has been almost two months since Donald Trump's inauguration.  It feels much longer.  The speed and the scope of the assault on the constitutional order, on the foundations of democratic self-government have been unprecedented.",
    "url": "https://thomaszimmer.substack.com/p/what-authoritarianism-means"
  }
]