[
  {
    "text": "Trump executive order will attempt to end birthright citizenship  —  The incoming president plans to take at least 10 actions related to the border or immigration, including ramping up deportations and suspending refugee resettlement.  —  The U.S. government will no longer recognize … ",
    "url": "https://www.washingtonpost.com/immigration/2025/01/20/trump-immigration-executive-orders/"
  },
  {
    "text": "All of the Day 1 executive actions Trump has announced so far  —  For updates, context and analysis of Donald Trump's 2025 inauguration, check out NPR's live blog throughout the day Monday.  —  President Trump is expected to sign a flurry of executive orders, memorandums and proclamations … ",
    "url": "https://www.npr.org/2025/01/20/g-s1-43698/trump-inauguration-executive-orders-2025-day-1"
  },
  {
    "text": "Here Are Trump's Expected Executive Orders  —  The incoming president's team said he would take unilateral action on a variety of fronts during his first hours in office, including 10 executive orders cracking down on immigration and immigrants.  —  President-elect Donald J. Trump on Monday … ",
    "url": "https://www.nytimes.com/2025/01/20/us/politics/trump-executive-orders-list.html"
  },
  {
    "text": "Trump preparing sweeping pardons for Jan. 6 defendants, with commutations for violent offenders: Sources  —  President Donald Trump is preparing to issue a sweeping series of pardons for defendants charged in the Jan. 6, 2021, attack on the U.S. Capitol, including commuting the prison sentences … ",
    "url": "https://www.goodmorningamerica.com/news/story/trump-teases-pardoning-jan-6-rioters-day-1-117880690"
  },
  {
    "text": "Biden pardons Fauci, Milley and the Jan. 6 panel.  It's a guard against potential ‘revenge’ by Trump  —  Joe Biden, in one of his final acts as president, pardoned Dr. Anthony Fauci, retired Gen. Mark Milley and members of the House committee that investigated the Jan. 6 attack on the Capitol … ",
    "url": "https://apnews.com/article/biden-trump-fauci-milley-pardons-january-6-3cba287f89051513fb48d7ae700ae747"
  },
  {
    "text": "Left off Biden's list of pardons: Jack Smith  —  Biden did not issue preemptive pardons to prosecutors and judges whom Trump has rebuked.  —  Among the flurry of last-minute pardons issued by Joe Biden in the final moments of his presidency Monday, a group of names was conspicuously absent … ",
    "url": "https://www.politico.com/news/2025/01/20/biden-pardon-prosecutors-judges-00199428"
  },
  {
    "text": "Milley portrait taken down from Pentagon  —  A portrait of retired Gen. Mark Milley, the former chair of the Joint Chiefs of Staff who has feuded in highly public spats with President Trump, was taken down in the Pentagon on Monday.  —  A spokesperson for the Pentagon confirmed the portrait … ",
    "url": "https://thehill.com/policy/defense/5096091-milley-portrait-taken-down-pentagon/"
  },
  {
    "text": "Statement from President Joe Biden  —  I am issuing pardons to Gerald G. Lundergan and Ernest William Cromartie.  I am also commuting the life sentence imposed on Leonard Peltier so that he serves the remainder of his sentence in home confinement.  —  My family has been subjected … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/20/statement-from-president-joe-biden-16/"
  },
  {
    "text": "Joe Biden Grants Clemency To Leonard Peltier  —  The ailing Native American rights activist has been in prison for nearly 50 years after the U.S. government lied to put him there.  —  LOADING  —  WASHINGTON ― With literally minutes left in his presidency, Joe Biden on Monday granted clemency … ",
    "url": "https://www.huffpost.com/entry/joe-biden-leonard-peltier-clemency_n_67608b04e4b0d06419ec6367"
  },
  {
    "text": "Elon Musk's DOGE to be sued within minutes of Trump inauguration  —  The legal status of Musk's government waste panel will be challenged in federal court almost as soon as the president-elect is sworn in.",
    "url": "https://www.washingtonpost.com/business/2025/01/20/doge-trump-musk-ramaswamy/"
  },
  {
    "text": "Cecile Richards, former Planned Parenthood president and feminist activist, has died  —  Richards died Monday of an aggressive brain cancer.  She was 67.  —  Cecile Richards, the former president of Planned Parenthood and feminist activist, died Monday of an aggressive brain cancer, her family confirmed in a statement.",
    "url": "https://19thnews.org/2025/01/cecile-richards-former-planned-parenthood-president-and-feminist-activist-has-died/"
  },
  {
    "text": "Right-Wing Extremists Are Abuzz Over Musk's Straight-Arm Salute  —  “Incredible things are happening already lmao,” wrote Gab founder and Hitlerbot innovator Andrew Torba  —  Right-wing extremists, white nationalists, and neo-Nazis are celebrating an alarming gesture made by the world's richest man.",
    "url": "https://www.rollingstone.com/politics/politics-news/elon-musk-salute-reaction-right-wing-extremists-1235241866/"
  },
  {
    "text": "Trump to rename Gulf of Mexico, Denali  —  Donald Trump will rename the Gulf of Mexico and Alaska's Denali as part of his Day One actions, incoming White House press secretary Karoline Leavitt confirmed on X on Monday morning.  Trump will rename the Gulf of Mexico the “Gulf of America,” … ",
    "url": "https://www.politico.com/live-updates/2025/01/20/donald-trump-inauguration-day-news-updates-analysis/trump-rename-00199278"
  },
  {
    "text": "Pentagon removes new portrait of Mark Milley  —  The portrait of Gen. Mark Milley, the former Chair of the Joint Chiefs of Staff, disappeared Monday from the Pentagon — less than three hours after President Donald Trump took office.  Incoming Defense Department officials did not explain … ",
    "url": "https://www.politico.com/live-updates/2025/01/20/donald-trump-inauguration-day-news-updates-analysis/pentagon-removes-mark-milley-portrait-00199441"
  },
  {
    "text": "Trump doesn't place hand on Bible during swearing-in  —  Chief Justice John Roberts administered the oath of office.  —  Donald Trump is sworn in as the 47th president of the United States by Chief Justice John Roberts as Melania Trump holds the Bible during the 60th Presidential Inauguration … ",
    "url": "https://abcnews.go.com/Politics/trump-inauguration-hand-bible-swearing-in/story?id=117897715"
  },
  {
    "text": "Trump to withdraw from Paris climate agreement  —  The decision delivers a blow to the effort to keep global temperatures from rising to dangerous levels.  —  President Donald Trump will withdraw the United States from the Paris climate agreement for the second time, delivering a blow … ",
    "url": "https://www.politico.com/news/2025/01/20/trump-withdraws-paris-climate-agreement-00199385"
  },
  {
    "text": "As Trump arrives, Macron hints NATO spending target is too low  —  CESSON-SÉVIGNÉ, France — French President Emmanuel Macron hinted on Monday that France would need to go beyond NATO's current spending target, especially if United States President Donald Trump pulls the American military out of Europe.",
    "url": "https://www.politico.eu/article/france-emmanuel-macron-hints-nato-spending-target-is-too-low-donald-trump/"
  },
  {
    "text": "Exclusive: Trump administration canceling flights for nearly 1,660 Afghan refugees, say U.S official, advocate  —  Nearly 1,660 Afghans cleared by the U.S. government to resettle in the U.S., including family members of active duty U.S. military personnel, are having their flights canceled … ",
    "url": "https://www.reuters.com/world/us/trump-administration-canceling-flights-nearly-1660-afghan-refugees-say-us-2025-01-20/"
  },
  {
    "text": "It's ‘Just Begun’—Trump Meme Coin Suddenly Crashes Back As Melania Coin Shock Hits Crypto  —  Crypto markets have been rocked by the launch of an “official” Donald Trump memecoin this weekend—with traders braced for more mayhem this coming week.  —  Unlock over $3,000 in NFT, web3 and crypto perks — Apply now!",
    "url": "https://www.forbes.com/sites/digital-assets/2025/01/19/its-just-begun-trump-meme-coin-suddenly-crashes-back-as-melania-coin-shock-hits-crypto/"
  }
]