[
  {
    "text": "Trump Media shares fall sharply after company reports net loss of $58 million in 2023 … This photo illustration shows an image of former President Donald Trump reflected in a phone screen that is displaying the Truth Social app, in Washington, DC, on February 21, 2022.",
    "url": "https://www.cnbc.com/2024/04/01/trump-media-lost-58-million-last-year-sec-filing-shows.html"
  },
  {
    "text": "The Easter Madness Of Donald J. Trump  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  —  Trump's Messianic Complex  —  I trust that most of you were offline celebrating the holiday, warming to the Spring, welcoming baseball back, or watching college basketball.",
    "url": "https://morningmemo.talkingpointsmemo.com/p/the-easter-madness-of-donald-j-trump"
  },
  {
    "text": "Would-be Tesla buyers snub company as Musk's reputation dips  —  The ranks of would-be Tesla buyers in the United States are shrinking, according to a survey by market intelligence firm Caliber, which attributed the drop in part to CEO Elon Musk's polarizing persona.",
    "url": "https://www.reuters.com/business/autos-transportation/would-be-tesla-buyers-snub-company-musks-reputation-dips-2024-04-01/"
  },
  {
    "text": "US judge receptive to Trump documents claims in warning sign for prosecutors  —  A federal judge overseeing the criminal case that accuses Donald Trump of mishandling classified documents has signaled an openness to the former U.S. president's defense claims, in a sign that prosecutors might face a difficult road ahead.",
    "url": "https://www.reuters.com/world/us/us-judge-receptive-trump-documents-claims-warning-sign-prosecutors-2024-04-01/"
  },
  {
    "text": "Exclusive: Trump allies plot anti-racism protections — for white people … Targets would range from decades-old policies aimed at giving minorities economic opportunities, to more recent programs that began in response to the pandemic and the killing of George Floyd.",
    "url": "https://www.axios.com/2024/04/01/trump-reverse-racism-civil-rights"
  },
  {
    "text": "“Trending: Easter Controversy,” or: How little lies pave the way for the next big lie  —  No-News Weekend Internet is stupid-dangerous in the Trump era — as this weekend's attack on the Transgender Day of Visibility shows.  —  This weekend's gaslighting from the right around Easter falling … ",
    "url": "https://www.lawdork.com/p/trending-easter-controversy-tdov"
  },
  {
    "text": "The GOP's extremism problem predates Trump  —  And it will outlast him. … There's an old adage that politics has no tolerance for losers.  But since 2016, the Republican Party has proven otherwise.  —  Whatever the outcome of the 2024 election, Donald Trump will have realized … ",
    "url": "https://www.publicnotice.co/p/republican-party-extremism-predates-trump"
  },
  {
    "text": "How Republicans texted and emailed their way into a money problem  —  Small-dollar donations to Trump and the GOP are way down since 2019 and 2020.  But the former president's team says they see a turnaround.  —  In the years after Donald Trump lost the presidency to Joe Biden … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/01/trump-republican-small-donations-problems/"
  },
  {
    "text": "China's Advancing Efforts to Influence the U.S. Election Raise Alarms  —  China has adopted some of the same misinformation tactics that Russia used ahead of the 2016 election, researchers and government officials say.  —  Covert Chinese accounts are masquerading online as American supporters … ",
    "url": "https://www.nytimes.com/2024/04/01/business/media/china-online-disinformation-us-election.html"
  },
  {
    "text": "GOP rep on Trump targeting judge's daughter: ‘Families should always be off-limits’  —  Republican Rep. Mike Lawler (N.Y.) on Sunday said “families should always be off-limits” after former President Trump lashed out at the daughter of the Manhattan judge overseeing his hush money trial",
    "url": "https://thehill.com/homenews/house/4567157-gop-rep-on-trump-judge-attacks-families-should-always-be-off-limits/"
  },
  {
    "text": "“Unit 29155's scope is global for conducting lethal operations and acts of sabotage.  Their mission is to find, fix, and finish, all in support of Vladimir Putin's imperial dreams.\"  —  Originally conceived as a training unit within the GRU, it was reorganized and expanded in 2008 … ",
    "url": "https://theins.press/en/politics/270425"
  },
  {
    "text": "Remote work can reshape DC's urban core for the better  —  The House 0f Representatives recently passed a bill calling for federal government agencies to report office space usage and give up any office space where they have less than 60 percent occupancy.  While it appears to be perfectly logical … ",
    "url": "https://thehill.com/opinion/technology/4559721-remote-work-has-the-potential-to-reshape-dcs-core-for-the-better/"
  },
  {
    "text": "“Stand where he tells you to stand”: Why the GOP is doubling down on misogyny in 2024  —  Republicans placate an evangelical base that's getting nastier with sexism — even if costs the party women's votes  —  “Stand where he tells you to stand, wear what he tells you to wear, and do what he tells you to do.”",
    "url": "https://www.salon.com/2024/04/01/stand-where-he-tells-you-to-stand-why-the-is-doubling-down-on-misogyny-in-2024/"
  },
  {
    "text": "Exclusive: Hackers stole Russian prisoner database to avenge death of Navalny  —  Within hours of opposition leader Alexey Navalny's death in February in a Russian prison, a group of anti-Kremlin hackers went looking for revenge.  —  Using their access to a computer network  … ",
    "url": "https://www.cnn.com/2024/03/31/politics/navalny-russian-prisoner-database-hack/"
  },
  {
    "text": "The anti-abortion movement is losing the battle on IVF.  It's preparing to win the war.  —  The groups are not advocating banning IVF but want new restrictions that would significantly curtail access to the procedure.  —  Anti-abortion advocates worked for five decades to topple Roe v. Wade.",
    "url": "https://www.politico.com/news/2024/04/01/anti-abortion-movement-ivf-war-00149766"
  }
]