[
  {
    "text": "Jim Jordan's allies tried strong-arming his GOP critics.  It backfired.  —  “The one thing that will never work with me — if you try to pressure me, if you try to threaten me, then I shut off,” GOP Rep. Mario Díaz-Balart said.  —  Jim Jordan's allies attempted to badger House Republicans into making him speaker.",
    "url": "https://www.politico.com/news/2023/10/17/conservative-pressure-jordan-speaker-bid-00122089"
  },
  {
    "text": "The quest for a speaker may never end  —  Good morning, Early Birds.  Sneakers are not allowed in the Speaker's Lobby — but surely the House could make an exception for a reporter as fashionable as our colleague Jackie Alemany, especially when there is no speaker?  —  Tips: earlytips@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2023/10/18/quest-speaker-may-never-end/"
  },
  {
    "text": "Congressman's Wife Receives Anonymous Texts Warning Husband to Vote For Jim Jordan: ‘Will Not Hold Any Political Office Ever Again’  —  The wife of Rep. Don Bacon (R-NE) reportedly received anonymous text messages and emails warning her husband to back Rep. Jim Jordan's (R-OH) House speakership campaign ahead of Tuesday's vote.",
    "url": "https://www.mediaite.com/politics/congressmans-wife-receives-anonymous-texts-warning-husband-to-vote-for-jim-jordan-will-not-hold-any-political-office-ever-again/"
  },
  {
    "text": "10/18/23 ☀️ Punchbowl News AM … If it wasn't obvious to you Tuesday morning when we laid out 10-plus members who were likely to vote no, it should be obvious now.  —  Jordan lost 20 Republicans on the House floor Tuesday during the speaker tally, netting just 200 votes.",
    "url": "https://punchbowl.news/archive/101823-punchbowl-news-am/"
  },
  {
    "text": "Playbook: Revenge of the squishes  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  DATELINE TEL AVIV — President JOE BIDEN landed less than three hours ago at Ben Gurion International Airport, where he was greeted and embraced on the tarmac … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/18/revenge-of-the-squishes-00122168"
  },
  {
    "text": "The resurrection of Jim Jordan  —  Tesnim Zekeria, Rebecca Crosby, and Judd Legum  —  On Tuesday, Republicans came close to making Congressman Jim Jordan (R-OH), a key player in the effort to overturn the 2020 presidential election, the next Speaker of the House.  Jordan received 200 votes — 17 fewer than he needed.",
    "url": "https://popular.info/p/the-resurrection-of-jim-jordan"
  },
  {
    "text": "Biden pledges solidarity with Israelis and suggests ‘other team’ to blame for Gaza hospital blast  —  Biden arrives in Israel on high stakes trip  —  President Joe Biden vowed to show the world that the U.S. stands in solidarity with Israel during his visit there Wednesday … ",
    "url": "https://apnews.com/article/joe-biden-israel-hamas-gaza-palestinians-a85cb682fdc61b80285cf4ab354354ce"
  },
  {
    "text": "U.S. says thwarts drone attack on its troops in Iraq  —  The U.S. military thwarted an attack targeting its forces in Iraq early on Wednesday, intercepting two drones before they could strike, two U.S. officials told Reuters.  —  The officials, who spoke on condition of anonymity … ",
    "url": "https://www.reuters.com/world/us-says-thwarts-drone-attack-its-troops-iraq-2023-10-18/"
  },
  {
    "text": "Center for Politics Study: Partisan Desires Override Support for Constitutional Freedoms and American Values  —  A new national study by the Center for Politics at the University of Virginia reveals a stunning number of Americans endorsing policies that could challenge the U.S. Constitution … ",
    "url": "https://centerforpolitics.org/crystalball/articles/center-for-politics-study-indicates-many-americans-favor-actions-that-challenge-constitutional-bounds-to-serve-partisan-aims/"
  },
  {
    "text": "The 2024 Presidential Contest  —  NPR/PBS NewsHour/Marist National Poll  —  Biden and Trump Competitive in Potential 2024 Matchup... Biden Benefits in Three-Way Contest with RFK Jr.  —  In a potential presidential re-match, President Joe Biden and former President Donald Trump remain competitive … ",
    "url": "https://maristpoll.marist.edu/polls/the-2024-presidential-contest/"
  },
  {
    "text": "Russian sources disappeared after Trump declassified ex-spy's evidence, UK court told  —  Former MI6 officer's witness statement criticises ‘reckless’ publication of Mueller testimony about ex-president's Russia links  —  Donald Trump's decision to declassify evidence given by a former British spy … ",
    "url": "https://www.theguardian.com/us-news/2023/oct/17/russian-sources-disappeared-after-trump-declassified-ex-spys-evidence-uk-court-told"
  },
  {
    "text": "EXCLUSIVE: X, formerly known as Twitter, will begin charging new users $1 a year to access key features including the ability to tweet and retweet  —  The owner of X, Elon Musk, has long floated the idea of charging users $1 to use the platform.  —  X, the platform formerly known as Twitter … ",
    "url": "https://fortune.com/2023/10/17/twitter-x-charging-new-users-1-dollar-year-to-tweet/"
  },
  {
    "text": "Travel Advisory  —  Lebanon - Level 4: Do Not Travel  —  Raised to Level 4 and updated to reflect the authorized departure of family members of U.S. government personnel and some non-emergency personnel on a case-by-case basis.  —  Raised to Level 4 and updated to reflect the authorized departure … ",
    "url": "https://travel.state.gov/content/travel/en/international-travel/International-Travel-Country-Information-Pages/Lebanon.html"
  },
  {
    "text": "85% Of Voters Concerned Israel - Hamas War Will Escalate Into A Wider War In The Middle East, Quinnipiac University National Poll Finds; Approval For Building Border Wall With Mexico Reaches Record High  —  mail_outline  —  In the wake of the Hamas terrorist attack on Israel and Israel declaring war … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3880"
  },
  {
    "text": "School vouchers are even worse than you think  —  Republicans in states like Texas complain that public schools are failing, then starve them under the guise of “choice.” … Texas Gov. Greg Abbott really, really wants school vouchers.  So much so that he called a special session to pass a bill … ",
    "url": "https://www.publicnotice.co/p/school-vouchers-texas-explained"
  },
  {
    "text": "Failed GOP Michigan Gubernatorial Candidate Jailed on Jan. 6 Charges  —  ‘CELEBRATED VIOLENCE’  —  A former Republican candidate for the Michigan governorship will spend two months behind bars after a judge sentenced him Tuesday on charges related to the Jan. 6 attack on the U.S. Capitol.",
    "url": "https://www.thedailybeast.com/failed-republican-michigan-gubernatorial-candidate-ryan-kelley-jailed-on-jan-6-charges"
  }
]