[
  {
    "text": "DOGE Quietly Deletes the 5 Biggest Spending Cuts It Celebrated Last Week  —  The cuts, highlighted on an earlier version of the “wall of receipts” posted by Elon Musk's team, contained mistakes that vastly inflated the amount of money saved.  —  Last week, Elon Musk's government cost-slashing initiative … ",
    "url": "https://www.nytimes.com/2025/02/25/upshot/doge-spending-cuts-changed.html?unlocked_article_code=1.zk4.b82f.Kh1AnGbHOfOG&smid=url-share"
  },
  {
    "text": "Nearly 40% of contracts canceled by Musk's DOGE are expected to produce no savings  —  Nearly 40% of the federal contracts that President Donald Trump's administration claims to have canceled as part of its signature cost-cutting program aren't expected to save the government any money, the administration's own data shows.",
    "url": "https://apnews.com/article/doge-federal-contracts-canceled-musk-trump-cuts-a65976a725412934ad686389889db0df"
  },
  {
    "text": "Federal technology staffers resign rather than help Musk and DOGE  —  More than 20 civil service employees resigned Tuesday from billionaire Trump adviser Elon Musk's Department of Government Efficiency, saying they were refusing to use their technical expertise to “dismantle critical public services.”",
    "url": "https://apnews.com/article/doge-elon-musk-federal-government-resignations-usds-6b7e9b7022e6d89d69305e9510f2a43c"
  },
  {
    "text": "White House seizes control of press pool, will decide which outlets cover events with president  —  The move reverses the long established precedent of journalists determining who participates in the press pool.  —  The White House announced on Tuesday that the administration … ",
    "url": "https://www.politico.com/news/2025/02/25/trump-white-house-press-pool-access-00206001"
  },
  {
    "text": "White House Moves to Pick the Pool Reporters Who Cover Trump  —  In announcing plans to handpick the reporters who can ask the president questions, the White House is breaking decades of precedent.  —  The White House press secretary, Karoline Leavitt, said on Tuesday that the Trump administration … ",
    "url": "https://www.nytimes.com/2025/02/25/business/media/trump-white-house-press.html"
  },
  {
    "text": "Ukraine agrees minerals deal with US  —  Kyiv hopes agreement on jointly exploring resources will improve relations with Trump administration  —  Kyiv has agreed terms with Washington on a minerals deal that Ukrainian officials hope will improve relations with the Trump administration … ",
    "url": "https://www.ft.com/content/1890d104-1395-4393-a71d-d299aed448e6?accessToken=zwAAAZU-aRdLkc8YkNEEE5VDk9OnHdKZrtRI5g.MEUCIH6zPwj2DIjUCuIiJRKw87FNWYqsd-Y24NSOfyUBhXCEAiEAq9xHBCnBuaCRJTwFmc3nHO8Fp7lRT6vGHZRnQWltusA&segmentId=e95a9ae7-622c-6235-5f87-51e412b47e97&shareId=fb705b02-cb2e-4bdd-b6e4-5e1b66c87949&shareType=enterprise"
  },
  {
    "text": "DOGE Is Working on Software That Automates the Firing of Government Workers  —  Operatives working for Elon Musk's DOGE appear to be editing the code of AutoRIF—software designed by the Defense Department that could assist in mass firings of federal workers, sources tell WIRED.",
    "url": "https://www.wired.com/story/doge-autorif-mass-firing-government-workers/"
  },
  {
    "text": "Trump Takes Aim at Law Firm Aiding Jack Smith  —  The move, signed by President Trump on Thursday, is a major escalation of his promise to pursue perceived foes.  —  President Trump plans to punish a prominent Washington law firm that has aided the former special counsel Jack Smith … ",
    "url": "https://www.nytimes.com/2025/02/25/us/trump-jack-smith-law-firm-security.html?unlocked_article_code=1.zk4.ZC2a.V7FT4i33g4-2"
  },
  {
    "text": "Trump allies circulate mass deportation plan calling for ‘processing camps’ and a private citizen ‘army’  —  The group, led by Blackwater veteran Erik Prince, has close Trump ties.  —  A group of prominent military contractors, including former Blackwater CEO Erik Prince … ",
    "url": "https://www.politico.com/news/2025/02/25/documents-military-contractors-mass-deportations-022648"
  },
  {
    "text": "This Shocking Moment at a GOP Town Hall in Idaho Is a Foreboding Sign  —  Teresa Borrenpohl later told the Coeur d'Alene/Post Falls Press that, as it happened, she didn't know if it was an arrest or a kidnapping.  She was seated in a nearly full town hall hosted by the Kootenai County Republican Central Committee on Saturday.",
    "url": "https://newrepublic.com/article/191908/gop-town-hall-idaho-lear"
  },
  {
    "text": "Conservatives threaten to tank House budget vote needed to advance Trump agenda  —  Speaker Mike Johnson has been making progress with moderates who've raised concerns about potential Medicaid cuts, but a band of fiscal hawks are refusing to budge.  —  WASHINGTON — Speaker Mike Johnson … ",
    "url": "https://www.nbcnews.com/politics/congress/house-budget-vote-speaker-johnson-trump-agenda-rcna193626"
  },
  {
    "text": "Big, Big Scandal Brewing at DC US Attys Office … There's a big, big scandal brewing beneath the already big scandal of the alleged assault by Florida congressman Corey Mills (R).  But as yet no one seems inclined to pull on the dangling thread.  As you've probably already seen … ",
    "url": "https://talkingpointsmemo.com/edblog/big-big-scandal-brewing-at-dc-us-attys-office"
  },
  {
    "text": "White House official pushes to axe Canada from Five Eyes intelligence group  —  Peter Navarro wants to increase pressure on country that Donald Trump has threatened to annex  —  A top White House official has proposed expelling Canada from the Five Eyes intelligence-sharing network … ",
    "url": "https://www.ft.com/content/2dfa3c11-64a7-49f6-83df-939b8d1cfb8e"
  },
  {
    "text": "For Trump, 3 court losses in 90 minutes  —  Three different federal judges delivered legal setbacks and slap downs to President Donald Trump in the span of an hour and a half on Tuesday in a series of cases challenging controversial moves taken during the early days of his second term.",
    "url": "https://www.cnn.com/2025/02/25/politics/trump-court-losses-immigration-spending-freeze/"
  },
  {
    "text": "DOJ Hires A State Judge Who Was Once Suspended To Advise The Deputy AG  —  Ex-Oregon Judge Vance Day was suspended by a state judicial ethics commission in 2018.  —  A new top Justice Department appointee brings a bizarre past to the job: he was a state judge in Oregon but was, in 2018 … ",
    "url": "https://talkingpointsmemo.com/news/doj-hires-a-state-judge-who-was-once-suspended-to-advise-the-deputy-ag"
  },
  {
    "text": "It's Time for a Daring Political Maneuver, Democrats  —  The Republican Party is all too often effective at campaigning and winning elections, but there's another fact about it that a lot of Americans forget: The Republican Party flat out sucks at governing.  Even Tucker Carlson agrees with this.",
    "url": "https://www.nytimes.com/2025/02/25/opinion/democrats-trump-congress.html"
  },
  {
    "text": "‘Unknown disease’ that can kill within days leaves 53 dead in Congo  —  World Health Organization officials said the outbreak appeared to originate from a village where three children died after reportedly eating a bat carcass.  —  An unknown illness has killed 53 people in a northwest region … ",
    "url": "https://www.washingtonpost.com/world/2025/02/25/unknown-illness-hemorrhagic-fever-congo-africa/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNDU5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxODM4Mzk5LCJpYXQiOjE3NDA0NTk2MDAsImp0aSI6ImJhYWIxZGM4LTA5OTUtNDk3YS05YmNhLTVhN2EwZmQwMTY5MiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI1LzAyLzI1L3Vua25vd24taWxsbmVzcy1oZW1vcnJoYWdpYy1mZXZlci1jb25nby1hZnJpY2EvIn0.LZoXmv8Vb_8BfzLDtvm9SupjbNZSDIyWm8pgJ0vr4ig"
  },
  {
    "text": "Trump Proposes Fines, Prison Time for Migrants Who Don't Join Registry  —  Administration plans to establish registration website as soon as this week  —  WASHINGTON—The Trump administration plans to create a registry for immigrants in the U.S. illegally to submit their personal information … ",
    "url": "https://www.wsj.com/politics/policy/trump-immigration-migrant-registry-jail-time-95c405a7?st=REipHQ"
  },
  {
    "text": "French Resistance Steps in After AP Banned From Trump-Macron Presser  —  MERCI  —  The Paris Press Corps today ensured that an AP reporter could enter and ask a question.",
    "url": "https://www.thedailybeast.com/paris-press-corps-intervene-when-reporter-is-barred-from-trump-macron-press-conference/"
  },
  {
    "text": "Trump to Offer ‘Gold Card’ Visas for $5 Million to the Rich  — Initiative would replace the existing EB-5 visa program  — Trump, Lutnick tout move as draw for wealthy investors  —  President Donald Trump said he is starting a program to offer residency and a path to citizenship … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-25/trump-to-launch-gold-card-visa-program-for-wealthy-investors"
  },
  {
    "text": "US threatens permanent visa bans on trans athletes based on sex markers  —  Exclusive: State department memo directs officers to bar those deemed to misrepresent birth sex on applications  —  The US state department has ordered officials worldwide to deny visas to transgender athletes attempting … ",
    "url": "https://www.theguardian.com/us-news/2025/feb/25/visa-ban-transgender-athletes"
  },
  {
    "text": "Slashing Medicaid to Pay for Trump's Tax Cuts Could Lead to Vast State Shortfalls  —  Republicans have proposed lowering the federal share of costs for Medicaid expansions, which could reshape the program by gutting one of the Affordable Care Act's major provisions.",
    "url": "https://www.nytimes.com/2025/02/25/us/politics/medicaid-cuts-republican-budget.html"
  },
  {
    "text": "“That Feels Indefensible”: MSNBC's New Direction Leads Rachel Maddow to Speak Out  —  As Joy Reid and Alex Wagner lose their shows, Rachel Maddow uses her platform to challenge management's decisions.  —  MSNBC's major programming overhaul has sparked a rare public rebuke from the network's biggest star … ",
    "url": "https://www.readtpa.com/p/that-feels-indefensible-msnbcs-new?triedRedirect=true"
  },
  {
    "text": "The US is now the enemy of the west  —  Washington has decided to abandon both Ukraine and its postwar role in the world  —  “Freedom and independence are today in jeopardy the world over.  If the forces of conquest are not successfully resisted and defeated there will be no freedom … ",
    "url": "https://www.ft.com/content/b46e2e24-ca71-4269-a7ca-3344e6215ae3"
  },
  {
    "text": "This is who the White House says is the DOGE acting administrator  —  A White House official says Amy Gleason is the acting administrator of the Department of Government Efficiency, after the White House struggled to answer who is technically at the top of the organizational chart.",
    "url": "https://www.cbsnews.com/news/this-is-who-the-white-house-says-is-in-charge-of-doge/"
  },
  {
    "text": "Musk Scandal at USAID Takes Ugly Turn, Putting Starving Kids at Risk  —  Ever since Donald Trump and Elon Musk began downsizing the U.S. Agency for International Development, the administration has claimed that aid for lifesaving humanitarian assistance would continue.",
    "url": "https://newrepublic.com/article/191935/usaid-musk-scandal-starving-kids"
  },
  {
    "text": "Trump Media Paid Donald Trump Jr. Nearly A Quarter Of Its Annual Revenue.  He Attended Just Two Board Meetings  —  Donald Trump Jr. made $813,000 in 2024 as a director of Trump Media & Technology Group—roughly a quarter of the company's annual revenue—despite attending … ",
    "url": "https://www.forbes.com/sites/zacheverson/2025/02/25/trump-media-truth-social-donald-trump-jr-board-meetings-revenue/"
  },
  {
    "text": "Musk's Starlink gets FAA contract, raising new conflict of interest concerns  —  New York CNN  —  The Federal Aviation Administration has agreed to use SpaceX's Starlink internet system to upgrade the information technology networks it uses to manage US airspace, raising new concerns … ",
    "url": "https://www.cnn.com/2025/02/25/business/musk-faa-starlink-contract/"
  },
  {
    "text": "DOGE's grab of personal data stokes privacy and security fears  —  Associates of Elon Musk have sought unfettered access to information that is typically guarded very closely.  —  Deputies of Elon Musk have sought access to massive amounts of information across the federal government … ",
    "url": "https://www.washingtonpost.com/business/2025/02/25/elon-musk-doge-data-privacy-security/"
  },
  {
    "text": "Donald Trump Accidentally Insults Himself: ‘Who Would Ever Sign A Thing Like This?’  —  The president recently rebuked a 2020 trade deal known as the U.S.-Mexico-Canada Agreement even though he signed it.  —  President Donald Trump is outraged that Americans are footing an unfair financial burden … ",
    "url": "https://www.huffpost.com/entry/trump-usmca-nafta-tariffs-canada-mexico_n_67bda523e4b0f4e8df29f534"
  },
  {
    "text": "Senate Republican recovering at home after being hurt in fall  —  Sen. Kevin Cramer (R-N.D.) said he is recovering at home after suffering a concussion and “brain bleed” following a fall on the ice during a weekend trip home to North Dakota.  —  “While walking on the hill down to the dock … ",
    "url": "https://thehill.com/homenews/senate/5163468-kevin-cramer-concussion-ice-fall-north-dakota/"
  }
]