[
  {
    "text": "Supreme Court upholds broad access to key abortion pill mifepristone  —  Ever since the high court eliminated the right to abortion in 2022, medications to terminate pregnancy have grown in importance and been challenged in court.  —  The Supreme Court on Thursday refused to limit access … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/13/supreme-court-abortion-pill-ruling-mifepristone/"
  },
  {
    "text": "Supreme Court rejects bid to restrict access to abortion pill  —  The court found that anti-abortion doctors who questioned the FDA's easing of access to the pill did not have legal standing to sue.  —  WASHINGTON — The Supreme Court on Thursday rejected a challenge to the abortion pill mifepristone … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-rejects-bid-restrict-access-abortion-pill-rcna151308"
  },
  {
    "text": "Even Brett Kavanaugh Tears Anti-Abortion Lawsuit Apart  —  BIG NOPE  —  The conservative-leaning Supreme Court has slapped down a challenge to the availability of mifepristone, a widely-used abortion pill.  —  Justices Brett Kavanaugh and Clarence Thomas led the U.S. Supreme Court ruling … ",
    "url": "https://www.thedailybeast.com/abortion-pill-lawsuit-even-scotus-justice-brett-kavanaugh-tears-case-apart"
  },
  {
    "text": "Trump floats eliminating U.S. income tax and replacing it with tariffs on imports … Donald Trump on Thursday brought up the idea of imposing an “all tariff policy” that would ultimately enable the U.S. to get rid of the income tax, sources in a private meeting with the Republican presidential candidate told CNBC.",
    "url": "https://www.cnbc.com/2024/06/13/trump-all-tariff-policy-to-replace-income-tax.html"
  },
  {
    "text": "Trump pumps himself up in session with House GOP … - Noted that nearly all of the Republicans who voted in favor of impeaching him have since either retired or lost re-election and touted polling showing him leading by a slim margin in Virginia;  — Warned House Republicans … ",
    "url": "https://www.axios.com/2024/06/13/trump-pumps-himself-up-in-session-with-house-gop"
  },
  {
    "text": "DNC to tail Trump with mobile billboard of Jan. 6 attack during visit to Capitol Hill  —  Democrats are highlighting the riot, which took place after a Trump speech to supporters near the White House, as he returns to meet with lawmakers.  —  When Donald Trump visits Washington on Thursday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/dnc-tail-trump-mobile-billboard-jan-6-attack-visit-capitol-hill-rcna156870"
  },
  {
    "text": "Let's Talk About Trump's Gibberish  —  Sign up for The Decision, a newsletter featuring our 2024 election coverage.  —  Perhaps the greatest trick Donald Trump ever pulled was convincing millions of people—and the American media—to treat his lapses into fantasies and gibberish as a normal, meaningful form of oratory.",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/trump-sharks-las-vegas-rally-speech/678667/"
  },
  {
    "text": "Playbook: What Trump wants from Capitol Hill  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  THE $46 BILLION MAN — “Elon Musk Says Vote on His Pay Winning by ‘Wide Margins,’” by WSJ's Christina Rogers and David Benoit",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/13/what-trump-wants-from-capitol-hill-00163125"
  },
  {
    "text": "Supreme Court blocks ‘Trump too small’ trademark gambit  —  The justices weighed a lawyer's attempt to trademark a phrase used on T-shirts that stems from a crude exchange during a 2016 presidential debate in which the size of Trump's hands was discussed.  —  WASHINGTON — The Supreme Court … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-blocks-trump-small-trademark-gambit-rcna137779"
  },
  {
    "text": "Public Notice's Sinclair report makes national headlines  —  From Morning Joe to the HuffPost, it's been a big week for the newsletter.  —  As part of a collaboration with Judd Legum of Popular Information, earlier this week I published a report on Sinclair's right-wing media empire … ",
    "url": "https://www.publicnotice.co/p/aaron-rupar-public-notice-sinclair-judd-legum"
  },
  {
    "text": "This Top Democrat Isn't Afraid to Call Trump a Felon and a Grifter  —  Most of the party's leaders want to avoid too much focus on Donald Trump's felonies.  JB Pritzker, the governor of Illinois, feels differently.  —  When former President Donald J. Trump was convicted in his New York criminal trial … ",
    "url": "https://www.nytimes.com/2024/06/13/us/politics/trump-jb-pritzker-felony.html"
  },
  {
    "text": "Republican National Committee prepares for a convention Trump may not attend  —  Republican officials are working to ensure that Trump will be able to address convention attendees from afar if he chooses to do so — or if he is forced to because of his legal troubles.",
    "url": "https://www.nbcnews.com/politics/2024-election/republican-national-committee-convention-trump-may-not-attend-rcna156838?taid=666ad0faf5f56e0001ae0cda"
  },
  {
    "text": "Record Share of U.S. Electorate Is Pro-Choice and Voting on It  —  Democrats continue to rally around abortion rights since Dobbs verdict  —  WASHINGTON, D.C. — A record-high 32% of U.S. voters say they would only vote for a candidate for major office who shares their views on abortion.",
    "url": "https://news.gallup.com/poll/645836/record-share-electorate-pro-choice-voting.aspx"
  },
  {
    "text": "Microsoft Chose Profit Over Security and Left U.S. Government Vulnerable to Russian Hack, Whistleblower Says  —  Microsoft hired Andrew Harris for his extraordinary skill in keeping hackers out of the nation's most sensitive computer networks.  In 2016, Harris was hard at work on a mystifying incident … ",
    "url": "https://www.propublica.org/article/microsoft-solarwinds-golden-saml-data-breach-russian-hackers"
  },
  {
    "text": "GOP Senate Hopeful Royce White Puts His Foot in It (Again)  —  DRINKING THE KOOL-AID  —  It's been a rough couple of weeks for Minnesota's Royce White.  —  Embattled GOP-endorsed Senate hopeful Royce White was caught in yet another embarrassing moment Tuesday when he blindly posted a map of … ",
    "url": "https://www.thedailybeast.com/gop-senate-hopeful-royce-white-puts-his-foot-in-it-again"
  },
  {
    "text": "The Christian right is coming for divorce next  —  Some conservatives want to make it a lot harder to dissolve a marriage. … Before the 1960s, it was really hard to get divorced in America.  —  Typically, the only way to do it was to convince a judge that your spouse had committed … ",
    "url": "https://www.vox.com/today-explained-newsletter/354635/divorce-no-fault-states-marriage-republicans"
  },
  {
    "text": "Here's what the Christian right wants from a second Trump term  —  Religious conservatives see opportunities for fresh gains after a series of victories during Trump's first term.  Rights advocates see a dangerous blurring of church and state.  —  Donald Trump's presidency delivered … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/13/trump-christian-right-abortion-prayer/"
  },
  {
    "text": "Supreme Court Ruling in Starbucks Case Curbs Labor Regulation  —  In a blow to the National Labor Relations Board, the justices cited inconsistent standards for courts to order employers to reinstate fired workers.  —  The Supreme Court ruled in favor of Starbucks on Thursday in a challenge … ",
    "url": "https://www.nytimes.com/2024/06/13/business/economy/supreme-court-starbucks-nlrb.html"
  },
  {
    "text": "Fox News buried Paul Ryan denouncing Donald Trump as “unfit for office”  —  Fox News buried comments Paul Ryan made on the network in which the former Republican House speaker and current director of Fox News' parent company said Donald Trump's willingness to “suborn” the Constitution makes him “unfit for office.”",
    "url": "https://www.mediamatters.org/fox-news/fox-news-buried-paul-ryan-denouncing-donald-trump-unfit-office"
  },
  {
    "text": "Denial and Forgetting at the Hunter Biden Trial  —  Consider the levels of denial and forgetting that it takes to write this paragraph the week that Hunter Biden, charged by a Trump US Attorney turned Special Counsel using evidence significantly sourced from a laptop handed over by John Paul Mac Isaac, stood trial.",
    "url": "https://www.emptywheel.net/2024/06/13/denial-and-forgetting-at-the-hunter-biden-trial/"
  },
  {
    "text": "Electoral College Rating Changes: Half-Dozen Moves Toward Republicans in What Remains a Toss-up Race  —  KEY POINTS FROM THIS ARTICLE  — We are making six Electoral College rating changes this week, all in favor of Republicans.  — However, we don't really see a clear favorite … ",
    "url": "https://centerforpolitics.org/crystalball/electoral-college-rating-changes-half-dozen-moves-toward-republicans-in-what-remains-a-toss-up-race/"
  },
  {
    "text": "'Who's the Black guy?':  Evangelicals want Trump to pick an anti-abortion running mate.  They care less who it is.  —  Trump has evangelical voters locked in.  —  INDIANAPOLIS — Eight years ago, needing a running mate to vouch for him among skittish evangelicals, Donald Trump turned to Mike Pence … ",
    "url": "https://www.politico.com/news/2024/06/13/trump-evangelical-voters-anti-abortion-vice-president-00163053"
  },
  {
    "text": "Trump's bid to steal the youth … - The latest New York Times/Siena polling of likely voters has President Biden with just a 2-point lead over Trump. … - By contrast, CNN exit polling showed that Biden won the 18-29-year-old vote by 24 percentage points in 2020, and that Hillary Clinton won it by 19 points in 2016.",
    "url": "https://www.axios.com/2024/06/13/trump-election-young-voters-polling"
  },
  {
    "text": "“It appears to be a payoff”: Expert says Kushner's Saudi cash an “egregious” national security worry  —  Senate Finance Committee Chairman Ron Wyden is investigating Saudi support for Jared Kushner's private equity firm  —  Based on his prior experience and demonstrated abilities … ",
    "url": "https://www.salon.com/2024/06/12/it-appears-to-be-a-payoff-expert-says-kushners-saudi-cash-an-egregious-national-security-worry/"
  }
]