[
  {
    "text": "New York City Mayor Eric Adams Accused of Sexual Assault in Legal Filing (Exclusive)  —  The Adult Survivors Act filing alleges the Big Apple leader, a former NYPD captain, sexually assaulted a woman when they both worked for the city in 1993  —  JWPlayer  —  Mayor Eric Adams has been accused … ",
    "url": "https://themessenger.com/news/eric-adams-sexual-assault-claim-new-york-city-mayor-accused-adult-survivors-act"
  },
  {
    "text": "Dutch Election Results Deliver a Turn to the Far Right  —  In an election result that sent shock waves across Europe, Geert Wilders, a longtime far-right provocateur, is closer than ever to becoming prime minister.  —  The Netherlands, long regarded as one of Europe's most socially liberal countries … ",
    "url": "https://www.nytimes.com/2023/11/23/world/europe/dutch-election-results-far-right-geert-wilders.html"
  },
  {
    "text": "Far-Right Populist Geert Wilders Scores Major Victory in Dutch Election  —  Wilders campaigned to ban the Quran and close the borders to migrants from Islamic countries  —  Dutch far-right leader Geert Wilders was on course for a surprise election victory Thursday, putting a leader … ",
    "url": "https://www.wsj.com/world/europe/anti-immigration-politician-geert-wilders-scores-major-victory-in-dutch-election-8b13bca4?mod=followamazon"
  },
  {
    "text": "Dutch election winner Geert Wilders is an anti-Islam firebrand known as the Dutch Donald Trump  —  He's been called the Dutch Donald Trump.  He's been threatened with death countless times by Islamic extremists, convicted of insulting Moroccans and Britain once banned him from entering the country.",
    "url": "https://apnews.com/article/wilders-netherlands-islam-trump-8efc30fa18dd9c4a0da21b25eca9e01d"
  },
  {
    "text": "Right-Wing Riots Erupt in Dublin After Stabbing Attack  —  Garda Commissioner Drew Harris blamed the unrest on a “lunatic, hooligan faction driven by far-right ideology,” following horrific stabbing of three children and a woman.  —  DUBLIN—Right-wing rioters turned a usually bustling district … ",
    "url": "https://www.thedailybeast.com/right-wing-riots-erupt-in-dublin-after-stabbing-attack"
  },
  {
    "text": "Trump Called Evangelicals ‘So-Called Christians,’ ‘Real Pieces of S-t’ During 2016 Primary: Book  —  The former president was angered after flubbing his favorite Bible verse and seeing voters turn to Ted Cruz, according to author Tim Alberta  —  JWPlayer  —  Then White House hopeful-Donald … ",
    "url": "https://themessenger.com/politics/donald-trump-evangelicals-ted-cruz-2016-tim-alberta"
  },
  {
    "text": "OpenAI researchers warned board of AI breakthrough ahead of CEO ouster, sources say  —  Ahead of OpenAI CEO Sam Altman's four days in exile, several staff researchers wrote a letter to the board of directors warning of a powerful artificial intelligence discovery that they said could threaten humanity … ",
    "url": "https://www.reuters.com/technology/sam-altmans-ouster-openai-was-precipitated-by-letter-board-about-ai-breakthrough-2023-11-22/"
  },
  {
    "text": "Small Kentucky town urged to evacuate after train derails, spilling chemicals  —  Two of the derailed cars were carrying molten sulfur, which caught fire after the cars were breached, officials said.  —  MOUNT VERNON, Ky. — A train derailed and spilled a chemical in a remote part … ",
    "url": "https://www.nbcnews.com/news/us-news/small-kentucky-town-urged-evacuate-train-derails-spilling-chemicals-rcna126481"
  },
  {
    "text": "Trump tells Argentina's President-elect Javier Milei he plans to visit Buenos Aires  —  BUENOS AIRES, Argentina (AP) — Former President Donald Trump has told Argentina's President-elect Javier Milei that he plans to travel to the South American country so the two can meet, Milei's office said Thursday.",
    "url": "https://apnews.com/article/milei-trump-argentina-bolsonaro-5d75b7d86ae1e5948c46b5f40c5264d5"
  },
  {
    "text": "Statement from President Joe Biden on the Arrest of Néstor Isidro Pérez Salas (\"El Nini\")  —  On November 22, Mexican security forces captured Néstor Isidro Pérez Salas (\"El Nini\"), the notorious head of security for the Chapitos wing of the Sinaloa Cartel.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/11/23/statement-from-president-joe-biden-on-the-arrest-of-nestor-isidro-perez-salas-el-nini/"
  },
  {
    "text": "Judge and clerk in Trump civil fraud trial have received hundreds of ‘serious and credible’ threats  —  The New York judge overseeing Donald Trump's civil fraud trial and his law clerk have received hundreds of harassing messages that court security has deemed “serious and credible” … ",
    "url": "https://www.cnn.com/2023/11/22/politics/trump-gag-order-threats-judge-clerk/"
  },
  {
    "text": "Ex-Trump Staffer A.J. Delgado Now Says Her Boss, Jason Miller, Raped Her  —  Jason Miller has been dogged by allegations that he preyed on former fellow 2016 Trump campaign employee A.J. Delgado—and left her alone with their kid.  Now she says he raped her.",
    "url": "https://www.thedailybeast.com/ex-trump-staffer-aj-delgado-now-says-her-boss-jason-miller-raped-her"
  },
  {
    "text": "Democrats who swept Moms For Liberty off school board fight superintendent's $700,000 exit deal  —  A Pennsylvania school board that banned books, Pride flags and transgender athletes slipped a last-minute item into their final meeting before leaving office, hastily awarding a $700,000 exit package … ",
    "url": "https://apnews.com/article/moms-for-liberty-pennsylvania-superintendent-fdd5dcecd0c8649bc73c09c76c769f17"
  },
  {
    "text": "Louisiana Sheriff Candidate Wins by Just One Vote After 43,000 Ballots Cast  —  Republican John Nickelson says a hand recount is ‘absolutely’ needed due to the slim margin victory  —  A Republican sheriff candidate in Louisiana is demanding a recount after losing an election this week by just one vote.",
    "url": "https://themessenger.com/politics/louisiana-sheriff-john-nickelson-recount"
  }
]