[
  {
    "text": "The Reconciliation Timeline Is Slipping as Trump Struggles to Flip Votes  —  The president told one group of House Republicans Wednesday that Congress shouldn't touch three things if they want to win elections: Medicaid, Medicare and Social Security.  — Copy",
    "url": "https://www.notus.org/congress/reconciliation-timeline-slipping-trump"
  },
  {
    "text": "Thomas Massie on why fellow Republicans keep folding: 'They're just afraid of Trump'  —  Rep. Thomas Massie, R-Ky., the lone House Republican who has consistently opposed Trump's deficit-raising “big, beautiful bill,” said he sleeps well at night.  —  “I have raised $400,000 from 4,500 donors … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/live-blog/trump-big-beautiful-bill-house-taxes-immigration-live-updates-rcna215840/rcrd84197?canonicalCard=true"
  },
  {
    "text": "The Conscience of Lisa Murkowski  —  Today's newsletter is farrago of cruelty, cowardice, betrayal, and hypocrisy. … — Lisa Murkowski.  —  Or not.  —  This morning, I'm tempted to write that Lisa Murkowski is simply the worst.  But, of course this is unfair, because there is so much competition for that distinction.",
    "url": "https://charliesykes.substack.com/p/the-conscience-of-lisa-murkowski"
  },
  {
    "text": "House left in limbo as megabill talks continue  —  Republican holdouts on the Senate-passed version of the party's “big, beautiful bill” are huddling with House GOP leaders, who are holding open a vote to move the legislation forward as they negotiate.  The procedural vote remained stuck more than 90 minutes after it was first called.",
    "url": "https://www.politico.com/live-updates/2025/07/02/congress/house-left-in-limbo-as-megabill-talks-continue-00437830"
  },
  {
    "text": "Inside CBS News, Staffers Voice Disgust, Anger, Relief and Anxiety After Trump Settlement  —  The network's employees are angry about the $16 million ‘60 Minutes’ settlement, relieved at the lack of an apology, and nervous for what comes next under Skydance ownership.",
    "url": "https://www.hollywoodreporter.com/business/business-news/inside-cbs-news-staff-anger-60-minutes-paramount-1236304554/"
  },
  {
    "text": "Paramount, CBS forced to pay eight figures, change editorial policy in settlement with President Trump  —  Result of the agreement on lawsuit could reach north of $30 million with $16 million upfront  —  FIRST ON FOX - Paramount Global and CBS agreed on Tuesday to pay President Donald Trump … ",
    "url": "https://www.foxnews.com/media/paramount-global-settles-trumps-lawsuit-against-cbs-news-over-60-minutes-interview"
  },
  {
    "text": "Trump Says U.S. Has Reached Trade Deal With Vietnam  —  The president said he had agreed to initial trade terms with Vietnam, the second country to strike a limited deal after Mr. Trump threatened steep tariffs.  —  President Trump said on Wednesday that the United States had reached … ",
    "url": "https://www.nytimes.com/2025/07/02/business/economy/trump-vietnam-trade-deal.html"
  },
  {
    "text": "Kilmar Abrego Garcia describes ‘severe beatings’ and ‘psychological torture’ in Salvadoran prison … The Salvadoran prison where Abrego was initially housed, known as the Anti-Terrorism Confinement Center or by its Spanish-language acronym CECOT, is reputed to be rife with gang violence and human rights abuses.",
    "url": "https://www.politico.com/news/2025/07/02/kilmar-abrego-garcia-salvadoran-prison-account-00438153"
  },
  {
    "text": "The private sector lost 33,000 jobs in June, badly missing expectations for a 100,000 increase, ADP says … Private sector hiring unexpectedly contracted in June, payrolls processing firm ADP said Wednesday, in a possible sign that the economy may not be as sturdy as investors believe … ",
    "url": "https://www.cnbc.com/2025/07/02/adp-jobs-report-june-2025.html"
  },
  {
    "text": "Federal judge bars Trump administration from expelling asylum seekers  —  The judge ruled that the president cannot create an “alternative immigration system” that tramples on existing federal law.  —  Summary241  —  A federal judge in the District of Columbia barred the Trump administration Wednesday … ",
    "url": "https://www.washingtonpost.com/immigration/2025/07/02/trump-asylum-border-lawsuit-immigration/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUxNDI4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUyODExMTk5LCJpYXQiOjE3NTE0Mjg4MDAsImp0aSI6ImMzMTMyMTJkLTA2ZWMtNDAwOS1hY2ZjLTM0MjI4NTkwN2IyNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzA3LzAyL3RydW1wLWFzeWx1bS1ib3JkZXItbGF3c3VpdC1pbW1pZ3JhdGlvbi8ifQ.ugCxI8IzDbZDCPYFzu2rOPWr-RtkoTdyWQtHGwlIFkE&itid=gfta"
  },
  {
    "text": "Justice Dept. Explores Using Criminal Charges Against Election Officials  —  Such a path could drastically raise the stakes for federal investigations of state or county officials, bringing the department and the threat of criminalization into the election system.",
    "url": "https://www.nytimes.com/2025/07/02/us/politics/justice-department-election-data.html?unlocked_article_code=1.TU8.Ust9.wNx2U0tJzyiQ&smid=url-share"
  },
  {
    "text": "Judge Rejects Trump's Attempt to Stop Migrant Asylum Claims  —  Judge Rejects Trump's Attempt to Stop Asylum Claims at Border  —  What Has Trump Said About Undocumented Farmers and Hotel Workers?  —  4 MIN READ  —  Somebody Explain Why Everybody Loves Phil Rosenthal",
    "url": "https://www.nytimes.com/2025/07/02/us/politics/asylum-trump.html?unlocked_article_code=1.TU8.oFiG.scm8h_9vNgmY&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Wisconsin Supreme Court's liberal majority strikes down 176-year-old abortion ban  —  The Wisconsin Supreme Court's liberal majority struck down the state's 176-year-old abortion ban on Wednesday, ruling 4-3 that it was superseded by a newer state law that criminalizes abortions only after a fetus can survive outside the womb.",
    "url": "https://apnews.com/article/wisconsin-abortion-ban-1849-01658358639a63db7df92aeec34c612d"
  },
  {
    "text": "Tesla Sales Fall 13%, Putting Carmaker on Course for Annual Drop  —  Tesla Inc. shares jumped after the carmaker posted a less drastic decline in vehicle sales than the most pessimistic analysts feared.  —  The company delivered 384,122 vehicles during the last three months, down 13% from a year earlier.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-02/tesla-sales-fall-13-putting-carmaker-on-course-for-annual-drop"
  },
  {
    "text": "What we know about the jury's deliberations.  —  To summarize a whirlwind moment in court: Sean Combs was acquitted of the most serious counts against him, including sex trafficking.  The jury was not convinced that the women who testified were coerced into the sex marathons with male escorts at the heart of the case.",
    "url": "https://www.nytimes.com/live/2025/07/02/arts/sean-combs-diddy-trial-jury"
  },
  {
    "text": "The Grand Opening of an American Concentration Camp  —  What were you doing the day the president attended the opening of an American concentration camp in the Everglades?  Dubbed “Alligator Alcatraz” by Republican officials because of the predators living in the surrounding swampland … ",
    "url": "https://newrepublic.com/article/197508/alligator-alcatraz-trump-concentration-camp"
  },
  {
    "text": "US contractors say their colleagues are firing live ammo as Palestinians seek food in Gaza  —  American contractors guarding aid distribution sites in Gaza are using live ammunition and stun grenades as hungry Palestinians scramble for food, according to accounts and videos obtained by The Associated Press.",
    "url": "https://apnews.com/article/palestinians-israel-gaza-contractors-aid-distribution-fe27f3ea83e06a09d66424eed7a5d56f"
  },
  {
    "text": "Ukraine summons top US diplomat after Washington halts some arms supplies  —  Reduction in weapons shipments makes Kyiv more vulnerable to Russia's escalating attacks  —  Christopher Miller and Fabrice Deprez in Kyiv and James Politi in Washington  —  Ukraine summoned a top diplomat … ",
    "url": "https://www.ft.com/content/b69e327d-95a3-487d-a9b6-6a72ef48ba61"
  },
  {
    "text": "Trump's Lawfare Against the Free Press  —  He suggests prosecuting CNN, while pressuring a settlement out of CBS.  —  Click for Sound  —  President Trump has taunted the media for years, and some of his jibes are deserved given the groupthink in most newsrooms.",
    "url": "https://www.wsj.com/opinion/donald-trump-lawfare-media-kristi-noem-cnn-iceblock-cbs-paramount-2ce75c5e"
  },
  {
    "text": "Jan. 6 defendant sentenced to life in prison for plotting to kill FBI special agents who investigated him  —  President Donald Trump's mass pardon of Jan. 6 rioters did not apply to Edward Kelley's separate plot to murder law enforcement officials, the Justice Department said.",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-defendant-sentenced-life-prison-plotting-kill-fbi-special-agents-rcna216526"
  },
  {
    "text": "Trump's Finances Were Shaky.  Then He Began to Capitalize on His Comeback. … An attendee posed with a cutout of President Trump at a Bitcoin conference in Las Vegas at the end of May.Gabriela Bhaskar/The New York Times  —  Last spring, even as Donald J. Trump's march back toward … ",
    "url": "https://www.nytimes.com/2025/07/02/us/trump-finances-crypto.html?unlocked_article_code=1.TU8.0-Hw.gkOsbJKO2qrj&smid=url-share"
  },
  {
    "text": "Intern for House Republican Ron Estes fatally shot in DC  —  A 21-year-old intern for Rep. Ron Estes (R-KS) was killed in a shooting in Washington, D.C., on Monday night.  —  The intern, Eric Tarpinian-Jachym, joined Estes's office in June.  He is a resident of Granby, Massachusetts, and is attending college at UMass Amherst.",
    "url": "https://www.washingtonexaminer.com/news/crime/3461476/intern-house-republican-ron-estes-killed-dc-shooting/"
  }
]