[
  {
    "text": "We received internal Trump documents from ‘Robert.’ Then the campaign confirmed it was hacked.  —  The campaign suggested Iran was to blame.  POLITICO has not independently verified the identity of the hacker or their motivation.  —  Former President Donald Trump's campaign said Saturday … ",
    "url": "https://www.politico.com/news/2024/08/10/trump-campaign-hack-00173503"
  },
  {
    "text": "The Trump Hack Could Extend Far Beyond a Hack-and-Leak  —  When news first broke that Donald Trump's campaign says it has been hacked, I started drafting a post on applying the lessons of past ratfucks.  —  The alleged hack was first reported by Politico, which says some person using … ",
    "url": "https://www.emptywheel.net/2024/08/11/the-trump-hack-could-extend-far-beyond-a-hack-and-leak/"
  },
  {
    "text": "Trump campaign says it is victim of foreign hack after leak of Vance report  —  Microsoft discovered evidence that Iranian hackers compromised the email account of a former Trump campaign adviser, a person familiar with the matter says.  —  Donald Trump's presidential campaign said on Saturday … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/10/trump-hack-iran-vance-report/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzIzMjYyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI0NjQ0Nzk5LCJpYXQiOjE3MjMyNjI0MDAsImp0aSI6ImI5ZGY3MDc4LTljZDktNGVlOC1iYmI3LTBjZGI3ODU1ZjkwNSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA4LzEwL3RydW1wLWhhY2staXJhbi12YW5jZS1yZXBvcnQvIn0.O1wwyu0W06PHqlDN03JBiBZQdzPT9glUFfi_8WHSLgE&itid=gfta"
  },
  {
    "text": "Kamala Harris is more trusted than Donald Trump on the US economy  —  FT Michigan Ross poll shows Democratic candidate leading on the issue for first time in nearly a year  —  More Americans trust Kamala Harris to handle the US economy than Donald Trump, according to a new poll that marks … ",
    "url": "https://www.ft.com/content/cf9a7c4d-3b82-4867-892c-f4f95daebbc7?accessToken=zwAGH2gd7xL4kdPPmnxNO4JIZ9OJLPT5Xa67xw.MEQCIDptIGbmMgmN9TRig75y1Ne5WzlIsMxg6zXeOsiHOYRdAiBfWjVfomB3nzmWEnEQZq-nTQBg-C8JBETsnUPgyv9bow&sharetype=gift&token=90fe1eb2-ff26-4235-a105-63f294bb9aff"
  },
  {
    "text": "Kamala Harris leads Trump in the critical swing states of Michigan, Pennsylvania, and Wisconsin, new poll says  — The Harris campaign is showing new strength in must-win states ahead of the party's convention.  — In Michigan, Pennsylvania, and Wisconsin, Harris leads Trump 50% to 46% among likely voters.",
    "url": "https://www.businessinsider.com/kamala-harris-leads-trump-michigan-pennsylvania-wisconsin-swing-state-polls-2024-8"
  },
  {
    "text": "Live Election Updates: Trump Tries to Curb Harris Enthusiasm After Another Big Rally  —  Vice President Kamala Harris and Gov. Tim Walz of Minnesota were in Nevada for the final rally of their tour of battleground states.  Former President Donald J. Trump tested a new attack at an event in Montana.",
    "url": "https://www.nytimes.com/live/2024/08/10/us/harris-trump-election"
  },
  {
    "text": "British Writer Pens The Best Description Of Trump I've Read  —  “Why do some British people not like Donald Trump?”  Nate White, an articulate and witty writer from England wrote the following response:  —  A few things spring to mind.  Trump lacks certain qualities which the British traditionally esteem.",
    "url": "https://londondaily.com/british-writer-pens-the-best-description-of-trump-i-ve-read"
  },
  {
    "text": "‘Neoliberal capitalism’ has contributed to the rise of fascism, says Nobel laureate  —  abc.net.au/news/joseph-stiglitz-the- road-to-freedom-neoliberalism-fascism/ 104210670  —  How would you define the “good society”?  —  It's a question Joseph Stiglitz, winner of the Nobel Memorial Prize … ",
    "url": "https://www.abc.net.au/news/2024-08-11/joseph-stiglitz-the-road-to-freedom-neoliberalism-fascism/104210670"
  },
  {
    "text": "Trump's Attacks on Georgia's GOP Governor Stand to Benefit Harris  —  As the presidential race tightens, Republicans in the state would rather focus on unifying against Democrats  —  ATLANTA—Georgia Republicans are having a bad case of déjà vu.",
    "url": "https://www.wsj.com/politics/elections/trumps-attacks-on-georgias-gop-governor-stand-to-benefit-harris-acbe967a"
  },
  {
    "text": "STATEMENT by Culinary Union Secretary-Treasurer Ted Pappageorge regarding the endorsement of Kamala Harris for President and Tim Walz for Vice-President:  —  FOR IMMEDIATE RELEASE:  —  MEDIA CONTACT:  —  Bethany Khan: bkhan@culinaryunion226.org ▪ (702) 387-7088",
    "url": "https://m.culinaryunion226.org/news/press/statement-endorsement-of-kamala-harris-for-president-and-tim-walz-for-vice-president"
  },
  {
    "text": "Recommended Reading: Captured States  —  Editor's note: a semi-regular feature here on NIDC, Recommended Reading shares links to, and offers casual commentary on, two or more related news articles in a simple rundown blog.  —  Dystopian Visions of a Fascist Future  —  “Houston, we have a problem.”",
    "url": "https://www.ninaillingworth.com/2024/08/10/recommended-reading-captured-states/"
  },
  {
    "text": "Uvalde City Officials Release Shooting Records That Provide New Details, Reaffirm Previous Reporting  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  This article is co-published with The Texas Tribune … ",
    "url": "https://www.propublica.org/article/uvalde-city-officials-release-school-shooting-records"
  },
  {
    "text": "Tim Walz served his country honorably for 24 years.  JD Vance, Trump need to respect that.  He earned it  —  Following in his father's footsteps, Democratic VP nominee Tim Walz joined the Army National Guard.  He enlisted just two days after his 17th birthday",
    "url": "https://www.foxnews.com/opinion/tim-walz-served-his-country-honorably-24-years-jd-vance-trump-need-respect-that-he-earned?intcmp=tw_fnc"
  },
  {
    "text": "We're Entering an AI Price-Fixing Dystopia  —  Algorithmic price-fixing appears to be spreading to more and more industries.  And existing laws may not be equipped to stop it.  —  If you rent your home, there's a good chance your landlord uses RealPage to set your monthly payment.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/08/ai-price-algorithms-realpage/679405/"
  }
]