[
  {
    "text": "Supreme Court Justice Alito's Beach House Displayed ‘Appeal to Heaven’ Flag … The “Appeal to Heaven” flag flew outside the Alitos' New Jersey vacation home last summer, along with a “2022” Phillies flag and a Long Beach Island flag.  —  Last summer, two years after an upside-down American flag … ",
    "url": "https://www.nytimes.com/2024/05/22/us/justice-alito-flag-appeal-to-heaven.html"
  },
  {
    "text": "They're all election deniers now  —  Trump's veep hopefuls are saying it over and over. … Lately, Republicans have been getting one simple question: “Will you accept the results of the 2024 election, regardless of its outcome?”  Their responses keep exposing that election denialism has taken over the party.",
    "url": "https://www.publicnotice.co/p/election-denial-marco-rubio-lara-trump-burgum"
  },
  {
    "text": "Nikki Haley Surrendered, but Not Her Voters  —  The views of Nikki Haley Republicans—pro-Ukraine, pro-Israel, pro-market—reflect all those things that Republicans used to think in that bygone era when Reagans and Bushes and Romneys roamed the Earth.  But few feel any emotional bond to Haley.",
    "url": "https://www.theatlantic.com/politics/archive/2024/05/nikki-haley-trump-endorse/678461/"
  },
  {
    "text": "Florida hearing in Trump classified documents case devolves into shouting match  —  A hearing in the Mar-a-Lago classified documents case devolved into shouting Wednesday as attorneys battled over an alleged threat made last year to a defense attorney.  —  The morning proceeding in Fort Pierce … ",
    "url": "https://www.cnn.com/2024/05/22/politics/trump-documents-case-judge-cannon-hearing/"
  },
  {
    "text": "A Unique Election Driven by a Traditional Issue  —  There are a lot of unique and untested variables in this upcoming presidential election.  It is the first race in more than 100 years between an incumbent and former incumbent president (both of whom would be the oldest ever to be inaugurated).",
    "url": "https://www.cookpolitical.com/survey-research/2024-swing-state-project/unique-election-driven-traditional-issue"
  },
  {
    "text": "Joe Biden and the Inversion of Reality  —  Americans are terribly misinformed about the state of the economy—at the expense of Joe Biden—and the media is partly to blame for it. … I: Ignorance is not bliss  —  One of the problems with democracy is that people vote … ",
    "url": "https://www.forkingpaths.co/p/joe-biden-and-the-inversion-of-reality"
  },
  {
    "text": "Political consultant indicted for AI robocalls with fake Biden voice made to New Hampshire voters  —  MANCHESTER, N.H. —  A man who admitted to sending out robocalls mimicking President Joe Biden's voice on the day of the New Hampshire primary is now facing criminal charges.",
    "url": "https://www.wmur.com/article/steve-kramer-ai-robocalls-biden-indictment-52224/60875422"
  },
  {
    "text": "House Democrat Banned From Speaking for Simply Listing Trump's Trials  —  SPITTING FACTS  —  Lawmakers apparently aren't allowed to speak about Trump's trials on the House floor—unless they're backing him.  —  Rep. Jim McGovern (D-MA) was temporarily banned from speaking on the House floor Wednesday … ",
    "url": "https://www.thedailybeast.com/house-democrat-banned-from-speaking-for-simply-listing-trumps-trials"
  },
  {
    "text": "The Minnesota GOP endorsed an anti-semite for U.S. Senate.  Republicans are silent.  —  Earlier this month, Congressman Tom Emmer (R-MN) blasted college students protesting Israel's military operations in Gaza.  “By these students' own admission, they're not just standing in solidarity with this pro-Hamas … ",
    "url": "https://popular.info/p/the-minnesota-gop-endorsed-an-anti"
  },
  {
    "text": "The Biden administration has a plan to shut down the border.  But it needs Mexico's help.  —  The administration hopes to unveil a series of executive actions that President Biden can sign but will likely have to wait for the outcome of Mexico's June 2 presidential election.",
    "url": "https://www.nbcnews.com/politics/immigration/biden-administration-plan-shut-border-needs-mexicos-help-rcna153620"
  },
  {
    "text": "Two hundred judges, more nominees moving, and a shadow docket bill  —  A little past noon Wednesday, the U.S. Senate confirmed Angela Martinez to be a judge on the U.S. District Court for the District of Arizona on a 66-28 vote.  —  Martinez is the 200th of President Biden's judicial nominees … ",
    "url": "https://www.lawdork.com/p/two-hundred-judges-shadow-docket-bill"
  },
  {
    "text": "Trump gears up for unique South Bronx rally … - It will be his first large-scale campaign rally in New York since 2016. … - It has been working with the predominantly Hispanic members of the Bodega Association and the National Supermarket Association, made up of independent supermarket owners.",
    "url": "https://www.axios.com/2024/05/23/trump-south-bronx-rally-new-york"
  },
  {
    "text": "Trump vows to “NEVER” take away birth control — except he spent four years doing just that  —  Trump's attacks on contraception were unrelenting.  He even asked the Supreme Court to block women's access  —  If he's elected president, Donald Trump will try to take away your birth control.",
    "url": "https://www.salon.com/2024/05/23/vows-to-never-take-away-birth-control--except-he-spent-four-years-doing-just-that/"
  },
  {
    "text": "Republican Abe Hamadeh called election deniers ‘crazies’ in text messages to now-rival Blake Masters  —  Republican congressional candidate Abe Hamadeh privately called those who believe stolen election claims “crazies” in text messages obtained by The Arizona Republic.",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/05/22/abe-hamadeh-called-election-deniers-crazies-in-text-messages/73803422007/"
  },
  {
    "text": "Sickening new video shows Hamas line up female Israeli soldiers on Oct. 7: ‘Here are the girls who can get pregnant’  —  Harrowing video released Wednesday shows the moment five female Israeli soldiers — covered in blood and surrounded by the bodies of their massacred comrades … ",
    "url": "https://nypost.com/2024/05/22/world-news/sickening-new-video-shows-hamas-line-up-female-israeli-soldiers-on-oct-7-here-are-the-girls-who-can-get-pregnant/"
  },
  {
    "text": "Do you need a college degree to succeed?  Here's what the data shows.  —  College was once widely viewed as a pathway to success, but today only about 1 in 4 Americans say a bachelor's degree is necessary to secure a well-paying job, according to a new survey from the Pew Research Center.",
    "url": "https://www.cbsnews.com/news/college-degree-income-is-college-worth-it-pew/"
  },
  {
    "text": "Shock summer election in Britain predicted to deliver ‘historic’ result … U.K. Prime Minister Rishi Sunak ended months of speculation this week by announcing a national election on July 4, as forecasts suggest his right-wing Conservative Party is likely to be ousted after 14 years in power.",
    "url": "https://www.cnbc.com/2024/05/23/shock-summer-election-in-britain-predicted-to-deliver-historic-result.html"
  },
  {
    "text": "Trump Claims Putin Will Only Release Wall Street Journal Reporter If He Is Elected President  —  ‘NOT FOR ANYONE ELSE’  —  The Kremlin quickly denied that Putin had spoken to Trump about the American journalist's case.  —  Donald Trump claimed his uniquely special relationship … ",
    "url": "https://www.thedailybeast.com/evan-gershkovich-trump-says-putin-will-release-wsj-reporter-if-hes-elected"
  },
  {
    "text": "TikTok Is Seeing an Increasing Amount of Pro-Trump Posts  —  An internal analysis found nearly twice as many pro-Trump posts as pro-Biden ones on TikTok since November, a sign of the right's use of a liberal-friendly platform.  —  Donald Trump isn't on TikTok.",
    "url": "https://www.nytimes.com/2024/05/23/us/politics/trump-biden-tiktok.html"
  },
  {
    "text": "GOP officials frustrated by the Secret Service's refusal to move protesters away from the RNC convention hall  —  One proposal from the RNC would place the protest zone in a park across the Milwaukee River.  Milwaukee officials have so far shown no interest in helping out, either.",
    "url": "https://www.nbcnews.com/politics/2024-election/gop-secret-services-refusal-protesters-rnc-convention-rcna153109"
  },
  {
    "text": "The Trumpire Strikes Back  —  Joe Biden, the Democrats, and the mainstream media (but I repeat myself) have been banging on the “Trump is an existential threat to democracy” drum for years now.  —  The mantra worked for quite a while, but according to the polls, the sting has been taken out of this thorn.",
    "url": "https://hotair.com/david-strom/2024/05/23/the-trumpire-strikes-back-n3788904"
  },
  {
    "text": "Netanyahu speech plans spark internal furor for Democrats … - House Intelligence Committee Ranking Member Jim Himes (D-Conn.) said Netanyahu “should be focused on freeing hostages, not on charming legislators.”  — Rep. Dan Kildee (D-Mich.), a member of Democratic leadership, told Axios … ",
    "url": "https://www.axios.com/2024/05/23/netanyahu-johnson-schumer-address-congress-israel"
  }
]