[
  {
    "text": "Judge rules Donald Trump defrauded banks and insurers while building real estate empire  —  A judge ruled Tuesday that Donald Trump committed fraud for years while building the real estate empire that catapulted him to fame and the White House, and he ordered some of the former president's companies removed … ",
    "url": "https://apnews.com/article/donald-trump-letitia-james-fraud-lawsuit-1569245a9284427117b8d3ba5da74249"
  },
  {
    "text": "Judge Finds Trump Inflated Property Values, a Victory for New York A.G.  —  The decision will simplify the path for Attorney General Letitia James, who has accused former President Donald J. Trump of overvaluing his holdings by as much as $2.2 billion.  —  The New York attorney general won … ",
    "url": "https://www.nytimes.com/2023/09/26/nyregion/trump-james-fraud-trial.html"
  },
  {
    "text": "Ruling Against Trump Cuts to the Heart of His Identity  —  The finding by a judge in a New York civil case that Donald Trump committed fraud in valuing his real estate properties undermined the narrative of the business career that launched him in politics.  —  Nearly every aspect … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/trump-fraud-ruling.html"
  },
  {
    "text": "Judge rules Trump engaged in repeated fraud, effectively deciding central question in $250M civil trial  —  The civil case is scheduled to go to trial on Oct. 2.  —  Former President Donald Trump submitted “fraudulent valuations” for assets that were then used by himself … ",
    "url": "https://abcnews.go.com/Politics/donald-trump-submitted-fraudulent-valuations-assets-secure-loans/story?id=103508205"
  },
  {
    "text": "Trump fraudulently inflated his net worth by up to $2.2 billion, New York judge rules  —  The ruling is a major blow for Trump and his business empire in the run-up to a civil fraud trial.  —  NEW YORK — A state judge on Tuesday found Donald Trump and his company liable for fraud for inflating … ",
    "url": "https://www.politico.com/news/2023/09/26/trump-fraud-trial-inflate-net-worth-00118269"
  },
  {
    "text": "UAW Leader Has No Desire at All to Talk to Trump in Michigan  —  Trump's expected appearance Wednesday at a non-union auto plant is a “pathetic irony,” Shawn Fain said on CNN.  —  The United Auto Workers union's president derided GOP presidential candidate Donald Trump as being out of touch … ",
    "url": "https://www.thedailybeast.com/united-auto-workers-unions-president-doesnt-want-to-meet-trump-in-michigan"
  },
  {
    "text": "McCarthy's new shutdown strategy: Shifting the blame  —  Good morning, Early Birds.  The New York Times's Vanessa Friedman says it's “a cliché” to wear a Patagonia fleece vest in the office if you don't work in outdoor recreation — but it's so cold in The Post's newsroom.  What's a man to do?",
    "url": "https://www.washingtonpost.com/politics/2023/09/27/mccarthys-new-shutdown-strategy-shifting-blame/"
  },
  {
    "text": "Playbook: McCarthy bets it all on the border  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  NEWS NEW JERSEY CAN USE — “The Right Amount of Cash to Keep at Home for Emergencies.  Hint: Not $480,000,” by WSJ's Anne Tergesen and Jeremy Olshan",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/27/mccarthy-bets-it-all-on-the-border-00118334"
  },
  {
    "text": "Commander Biden bites another Secret Service agent, the 11th known incident  —  President Joe Biden's younger dog, Commander, bit another US Secret Service agent at the White House Monday evening, CNN has learned, the 11th known biting incident involving the 2-year-old German Shepherd.",
    "url": "https://www.cnn.com/2023/09/26/politics/commander-biden-biting-incident/"
  },
  {
    "text": "Target Closes Select Stores to Prioritize Team Member and Guest Safety  —  At Target, we take the decision to close stores very seriously, and only do so after taking meaningful steps to invest in the guest experience and improve business performance.  With that said, we have made the difficult decision … ",
    "url": "https://corporate.target.com/press/releases/2023/09/Target-Closes-Select-Stores-to-Prioritize-Team-Mem"
  },
  {
    "text": "Comer Reveals Wires from China Have Joe Biden's Wilmington Home as the Beneficiary Address￼  —  WASHINGTON—House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) today announced the House Oversight Committee subpoenaed and obtained two bank wires revealing Hunter … ",
    "url": "https://oversight.house.gov/release/comer-reveals-wires-from-china-have-joe-bidens-wilmington-home-as-the-beneficiary-address%EF%BF%BC/"
  },
  {
    "text": "The Sick, Racist Message Behind Why Trump Chose That Particular Gun Store  —  During a campaign trip to South Carolina, Donald Trump took some time to visit the gun store that sold weapons to the racist Jacksonville, Florida, mass shooter.  —  Trump visited Palmetto State Armory on Monday … ",
    "url": "https://newrepublic.com/post/175764/trump-gun-store-south-carolina-palmetto-state-armory-racist-message"
  },
  {
    "text": "House Republicans vow to continue impeachment inquiry even if government shuts down  —  House Republicans are planning to plow ahead with their impeachment inquiry into President Joe Biden in the event of a government shutdown, though a lapse in federal funding could present logistical challenges to their investigative work.",
    "url": "https://www.cnn.com/2023/09/26/politics/impeachment-inquiry-shutdown/"
  },
  {
    "text": "From secretaries to secretary of state, Biden documents probe casts wide net: Sources  —  Investigators have interviewed scores of witnesses — some more than once.  —  The federal investigation into President Joe Biden's handling of classified documents prior to becoming president has grown … ",
    "url": "https://abcnews.go.com/US/secretaries-secretary-state-biden-documents-probe-casts-wide/story?id=103504213"
  },
  {
    "text": "Biden Administration Says Israelis Can Travel to U.S. Without a Visa  —  The U.S. allowed Israel into its visa-waiver program after a summer test run that gave U.S. citizens, including Palestinian Americans, visa-less entry into Israel.  —  The Biden administration is announcing on Wednesday … ",
    "url": "https://www.nytimes.com/2023/09/27/us/politics/biden-israel-visa-program.html"
  },
  {
    "text": "Unraveling what's really happening in Florida school libraries  —  On Tuesday, Popular Information reported that librarians in Charlotte County, Florida, were instructed by the school district superintendent to remove all books with LGBTQ characters.  This story was based on a document dated July 24 … ",
    "url": "https://popular.info/p/update-unraveling-whats-really-happening"
  },
  {
    "text": "North Korea says it will expel Travis King, the US soldier who crossed into the country in July  —  North Korea said Wednesday that it will expel a U.S. soldier who crossed into the country through the heavily armed border between the Koreas in July.  The North's official Korean Central News Agency … ",
    "url": "https://apnews.com/article/north-korea-us-soldier-travis-king-00c171778e378d95fe1115fe31612ec2"
  },
  {
    "text": "Under India's pressure, Facebook let propaganda and hate speech thrive  —  SAN FRANCISCO — Nearly three years ago, Facebook's propaganda hunters uncovered a vast social media influence operation that used hundreds of fake accounts to praise the Indian army's crackdown in the restive border region … ",
    "url": "https://www.washingtonpost.com/world/2023/09/26/india-facebook-propaganda-hate-speech/"
  }
]