[
  {
    "text": "A Manufactured Fight over Incumbency Hides Trump's Fascism  —  Thinking of Trump in terms of presidential administrations — reading this race as a fight over incumbency — is a category error that serves to hide the threat Trump poses to democracy.  —  Yet a slew of reviews of the DNC … ",
    "url": "https://www.emptywheel.net/2024/08/24/a-manufactured-fight-over-incumbency-hides-trumps-fascism/"
  },
  {
    "text": "Trump allies try to energize him as he struggles to adapt to Harris  —  The Republican nominee has fixated on Biden's withdrawal: “It feels like he's lost his mojo.”  —  Republican nominee Donald Trump looked cheerful playing golf at his New Jersey club one day earlier this month … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/24/trump-energy-campaign-harris/"
  },
  {
    "text": "We removed RFK Jr. from our model.  But it didn't hurt Kamala.  —  Harris's convention bounce has offset any impact — so far.  —  ∙ Paid  —  Like everything else about his presidential campaign, Robert F. Kennedy's withdrawal from the presidential race was weird.",
    "url": "https://www.natesilver.net/p/we-removed-rfk-jr-from-our-model"
  },
  {
    "text": "German Police Arrest Suspect After Deadly Attack at Festival  — Three stabbed to death and eight wounded in city of Solingen  — Latest incident poised to fuel debate about immigration laws  —  German police have arrested a man who is “to the highest degree” suspected … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-24/terror-group-islamic-state-claims-responsibility-for-germany-attack-ap-says"
  },
  {
    "text": "Islamic State claims responsibility for knife attack in Germany's Solingen  —  The Islamic State group claimed responsibility on Saturday for a knife attack in the western German city of Solingen that killed three people on Friday.  —  The militant group said in a statement on its Telegram account … ",
    "url": "https://www.reuters.com/world/europe/islamic-state-claims-responsibility-knife-attack-germanys-solingen-2024-08-24/"
  },
  {
    "text": "Harris's campaign has raised $540 million since launch, Democrats say  —  The amount raised since Biden bowed out in July amounts to “a record for any campaign in history,” the Harris campaign's manager says.  —  Vice President Kamala Harris's campaign has raised $540 million since it launched last month … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/25/kamala-harris-fundraising-trump-election/"
  },
  {
    "text": "Audience signs and chants at the DNC were all about America.  At the RNC, it was the Trump show.  — The Democratic and Republican national conventions concluded this week.  — Between party speeches and celebrity appearances, audience members held signs and led chants.",
    "url": "https://www.businessinsider.com/dnc-audience-signs-kamala-harris-compared-rnc-voters-donald-trump-2024-8"
  },
  {
    "text": "For Tim Walz, a Pattern of Prevarications Stretches Back Almost Two Decades  —  When Tim Walz launched his 2006 campaign for Congress in rural Minnesota, he boasted in his public biography that in 1993, he “was named the Outstanding Young Nebraskan by the Nebraska Chamber of Commerce … ",
    "url": "https://freebeacon.com/democrats/for-tim-walz-a-pattern-of-prevarications-stretches-back-almost-two-decades/"
  },
  {
    "text": "Suspect arrested after arson attack on French synagogue  —  French police arrested a man suspected of trying to set a synagogue on fire in La Grande-Motte, France, on Saturday following a lengthy manhunt.  —  French Interior Minister Gerald Darmanin confirmed the arrest in a post on X … ",
    "url": "https://www.washingtonexaminer.com/news/world/3133711/suspect-arrested-arson-attack-french-synagogue/"
  },
  {
    "text": "Rick Scott dials up election denialism … - “We just had an election stolen in Venezuela. … Scott also recently echoed a right-wing talking point falsely suggesting noncitizens often vote in elections.  — If Democrats win in November, “They won't have to commit fraud to win elections anymore … ",
    "url": "https://www.axios.com/local/tampa-bay/2024/08/23/rick-scott-dials-up-election-denialism"
  },
  {
    "text": "Vance says Trump would veto a national abortion ban  —  In an interview on NBC News' “Meet the Press,” Vance argued that Trump has “explicitly” said he would veto an abortion ban.  —  Ohio Sen. JD Vance, former President Donald Trump's running mate, on Saturday said Trump would veto … ",
    "url": "https://www.nbcnews.com/politics/2024-election/jd-vance-says-trump-veto-national-abortion-ban-rcna168084"
  },
  {
    "text": "Kari Lake Trolled With Photo of Her Urged Off Stage at Trump Rally  —  U.S.  —  candidate  —  was trolled on Friday by her Democratic opponent, Representative  —  , with a photo of her being urged to get off the stage while speaking at a rally for former President  —  .",
    "url": "https://www.newsweek.com/kari-lake-trolled-ruben-gallego-urged-off-stage-donald-trump-rally-1943919"
  },
  {
    "text": "How Tim Walz's dumb taco joke broke MAGA brains  —  Tough-talking right-wing pundits leaned into victimhood culture with their collective freakout over an anodyne joke.  —  Minnesota Gov. Tim Walz broke MAGA brains for the second time in a month — and he wasn't even calling them “weird” this time.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/tim-walz-white-guy-tacos-harris-campaign-video-trump-ann-coulter-rcna167678"
  },
  {
    "text": "DNC Bump?:  Harris extends lead over Trump with base built on youth vote  —  Three-quarters say it's harder for women to win elections as Harris becomes second female candidate  —  With the presidential race formalized, the “business” part of the 2024 election truly begins.",
    "url": "https://angusreid.org/us-election-polling-harris-trump-democratic-national-convention/"
  },
  {
    "text": "Foo Fighters Say Trump Didn't Have Permission to Use ‘My Hero’ at Arizona Rally  —  Band will take “appropriate action” as well as donate royalties from usage to Harris/Walz campaign",
    "url": "https://www.rollingstone.com/music/music-news/foo-fighters-trump-unauthorized-use-my-hero-arizona-rally-1235087493/"
  }
]