[
  {
    "text": "Biden to Give Legal Protections to Undocumented Spouses of U.S. Citizens  —  Undocumented spouses of American citizens will be shielded from deportation, provided work permits and given a pathway to citizenship, according to officials briefed on the plan.  —  President Biden on Tuesday … ",
    "url": "https://www.nytimes.com/2024/06/17/us/politics/biden-immigration-spouses.html"
  },
  {
    "text": "Closing asset loophole could add billions to tax collections, IRS says  —  The Treasury Department said it will enact rules to prevent certain large businesses from depreciating the same asset repeatedly.  —  The Biden administration plans to stop businesses and wealthy individuals … ",
    "url": "https://www.washingtonpost.com/business/2024/06/17/tax-basis-shifting-irs-partnerships/"
  },
  {
    "text": "The IRS wants to end another major tax loophole for the wealthy and raise $50 billion in the process  —  The IRS plans to end a major tax loophole for wealthy taxpayers that could raise more than $50 billion in revenue over the next decade, the U.S. Treasury Department says.",
    "url": "https://apnews.com/article/irs-treasury-tax-audit-income-7c10474b3129c11d28a3e6a6cb245743"
  },
  {
    "text": "Scoop: Senate Dems line up behind Schumer's bump stock ban … - Republicans are likely to object to Schumer's unanimous consent request to pass the bill.  — Even a single GOP objection would give Democrats the opportunity to paint Republicans as broadly against a ban that polls have shown … ",
    "url": "https://www.axios.com/2024/06/18/bump-stocks-ban-bill-democrats-schumer"
  },
  {
    "text": "The war cabinet is gone.  Who's left in Netanyahu's inner circle?  —  Israeli Daytime Pause in Combat Appears to Take Hold in Gaza … The daily pause applies to part of southern Gaza, but not to some of the places most in need.  —  The Israeli military said on Monday … ",
    "url": "https://www.nytimes.com/live/2024/06/17/world/israel-gaza-war-hamas"
  },
  {
    "text": "Texas Man Sentenced to Nearly 3 Years in Federal Prison for Threatening Violence Against Los Angeles-Area Congresswoman  —  For Immediate Release  —  U.S. Attorney's Office, Central District of California  —  LOS ANGELES - A Texas man was sentenced today to 33 months in federal prison … ",
    "url": "https://www.justice.gov/usao-cdca/pr/texas-man-sentenced-nearly-3-years-federal-prison-threatening-violence-against-los"
  },
  {
    "text": "Trump maintains big lead over Biden and RFK Jr. despite felony conviction, Iowa Poll shows … Two weeks after he was convicted in a New York courtroom of multiple felony counts, former Republican president Donald Trump still holds a double-digit lead over Democratic incumbent Joe Biden in Iowa.",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/2024/06/17/2024-election-donald-trump-vs-joe-biden-vs-robert-kennedy-jr-iowa-poll/74088665007/"
  },
  {
    "text": "The Surgeon General's Fear-Mongering, Unconstitutional Effort to Label Social Media  —  Surgeon General Vivek Murthy's extraordinarily misguided and speech-chilling call this week to label social media platforms as harmful to adolescents is shameful fear-mongering that lacks scientific evidence … ",
    "url": "https://www.eff.org/deeplinks/2024/06/no-online-speech-should-not-have-warning-labels"
  },
  {
    "text": "Doctor charged for unauthorized access to personal information of pediatric patients at Texas Children's Hospital  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of Texas  —  HOUSTON - A Houston doctor has been indicted for obtaining protected individual health information … ",
    "url": "https://www.justice.gov/usao-sdtx/pr/doctor-charged-unauthorized-access-personal-information-pediatric-patients-texas"
  },
  {
    "text": "FTC Takes Action Against Adobe and Executives for Hiding Fees, Preventing Consumers from Easily Cancelling Software Subscriptions  —  Complaint charges that maker of Photoshop and Acrobat deceived consumers about early termination fees, inhibited cancellations",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2024/06/ftc-takes-action-against-adobe-executives-hiding-fees-preventing-consumers-easily-cancelling"
  },
  {
    "text": "North Carolina Supreme Court Secretly Squashed Discipline of Two GOP Judges Who Admitted to Violating Judicial Code  —  The decisions came despite the Judicial Standards Commission's recommendations to publicly reprimand the judges, and these are likely the only times in more than a decade … ",
    "url": "https://www.propublica.org/article/north-carolina-supreme-court-republican-judges-violations"
  },
  {
    "text": "New Jersey AG charges Democratic power broker George Norcross in bombshell indictment  —  He has long been the subject of scrutiny by law enforcement and a political task force, but has never been charged.  —  New Jersey's attorney general on Monday charged one of the state's most powerful Democrats … ",
    "url": "https://www.politico.com/news/2024/06/17/george-norcross-indictment-new-jersey-corruption-00163700"
  },
  {
    "text": "“The peanut gallery”: Experts say Cannon opened door to “unheard of” GOP intervention in Trump case  —  GOP attorneys general back Trump after Cannon allowed “everyone under the sun to chime in,” lawyer says  —  There should be no consequences for Donald Trump lying about federal law enforcement officers … ",
    "url": "https://www.salon.com/2024/06/17/the-peanut-gallery-experts-say-cannon-opened-door-to-unheard-of-intervention-in-case/"
  },
  {
    "text": "Christian Nationalists Are Opening Private Schools.  Taxpayers Are Funding Them.  —  Trump's favorite Arizona megachurch has one.  —  Earlier this month, former President Donald Trump held his first campaign rally as a convicted felon at Dream City Church in Phoenix, Arizona … ",
    "url": "https://www.motherjones.com/politics/2024/06/christian-nationalists-are-opening-private-schools-taxpayers-are-funding-them/"
  },
  {
    "text": "Trump, Kevin McCarthy and other Republicans gang up on Freedom Caucus chair in primary  —  Rep. Bob Good, R-Va., is facing a hotly contested primary Tuesday against state Sen. John McGuire.  —  GOOCHLAND, Va. — For Rep. Bob Good, Tuesday's primary is about much more than the next member … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-kevin-mccarthy-republicans-bob-good-primary-rcna157442"
  },
  {
    "text": "Half of Hamas in Rafah beaten, IDF will gain full control in two weeks  —  The IDF also revealed that the houses and tunnels in Rafah had new kinds of defenses and boobytraps, with some houses having video surveillance in each room of the given house to facilitate ambushes.",
    "url": "https://www.jpost.com/israel-hamas-war/article-806594"
  },
  {
    "text": "Trump's Tariff Is a Scheme to Shift the Tax Burden to the Non-Rich … Imagine you were a close observer of American politics who fell asleep, say, 25 years ago and woke up last week.  You discover the Republican Party's leader is a wealthy heir who is broadly supported by CEOs and other rich people.",
    "url": "https://nymag.com/intelligencer/article/trumps-tariff-is-a-scheme-to-shift-tax-burden-to-non-rich.html"
  },
  {
    "text": "Mystery fundraising firm takes in millions from the Trump campaign  —  The campaign says it has fulfilled its legal reporting obligation, though the spending appears to mirror past attempts to mask who is actually receiving donor cash.  —  Former President Donald Trump's political operation … ",
    "url": "https://www.nbcnews.com/politics/2024-election/mystery-fundraising-firm-takes-millions-trump-campaign-rcna156755"
  },
  {
    "text": "GOP rising star candidate and PA state Rep Ryan Mackenzie lied about age on Tinder profile by EIGHT YEARS  —  Eight years into his state lawmaker career, Pennsylvania state Rep. Ryan Mackenzie misrepresented his age on a dating profile by nearly a decade, DailyMail.com can reveal.",
    "url": "https://www.dailymail.co.uk/news/article-13530821/gop-candidate-state-representative-ryan-mackenzie-lied-tinder-profile.html"
  },
  {
    "text": "Secret Service agent robbed at gunpoint during President Biden's trip to California over the weekend  —  It was not immediately clear whether the Secret Service agent's work assignment was connected to the president's visit.  —  Romina Ruiz-Goiriena Michael CollinsUSA TODAY",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/17/secret-service-agent-robbed-during-biden-california-trip/74131176007/"
  },
  {
    "text": "Biden unloads on Trump in ad: 'A convicted criminal who's only out for himself'  —  The campaign's shift to more forceful rhetoric comes ahead of the first presidential debate next week.  —  Joe Biden's campaign is unleashing its most biting attack yet against Donald Trump … ",
    "url": "https://www.politico.com/news/2024/06/17/biden-ad-trump-convicted-criminal-00163633"
  },
  {
    "text": "White House Tears Into New York Post, Other Outlets For New Biden ‘Freeze’ Claim  —  Deputy press secretary Andrew Bates said the Post's ethics “could deal with a little unfreezing.”  —  LOADING  —  White House spokesperson Andrew Bates accused the New York Post, amid other right-wing media … ",
    "url": "https://www.huffpost.com/entry/joe-biden-freeze-hollywood-fundraiser-obama_n_66701d53e4b08889dbe58560"
  },
  {
    "text": "Psaki agrees to sit for interview with House panel probing Afghanistan withdrawal  —  Former White House press secretary and current MSNBC host Jen Psaki has agreed to be interviewed by the House Foreign Affairs Committee, Chair Michael McCaul (R-Texas) said this week.",
    "url": "https://thehill.com/policy/defense/4725775-jen-psaki-msnbc-afghanistan-michael-mccaul-foreign-affairs/"
  }
]