[
  {
    "text": "To Serve His Country, President Biden Should Leave the Race  —  President Biden has repeatedly and rightfully described the stakes in this November's presidential election as nothing less than the future of American democracy.  —  Donald Trump has proved himself to be a significant jeopardy … ",
    "url": "https://www.nytimes.com/2024/06/28/opinion/biden-election-debate-trump.html"
  },
  {
    "text": "Scoop: Schumer's pre-debate fears come true  —  Before Thursday night's debate, Senate Majority Leader Chuck Schumer (D-N.Y.) had signaled to political allies that he was open to options other than President Biden if his debate performance was disastrous, Axios has learned.",
    "url": "https://www.axios.com/2024/06/29/schumer-debate-fears-come-true-biden"
  },
  {
    "text": "The Sum of All Fears  —  No Secret podcast today.  This stuff is as serious as a heart attack, so Sarah and I sat down with Tim and did an emergency pod for the flagship instead.  We didn't want it hidden behind a paywall.  The moment is too important.  —  That conversation … ",
    "url": "https://www.thebulwark.com/p/the-sum-of-all-fears-a60"
  },
  {
    "text": "Biden team worries as Macron's election gamble looks doomed  —  France's main far right party appears poised to do well in the two-round parliamentary vote.  —  Before President Emmanuel Macron of France went on national television to announce his call for snap parliamentary elections … ",
    "url": "https://www.politico.com/news/2024/06/29/macron-french-election-biden-00165818"
  },
  {
    "text": "Haley Warns Trump to Prepare for Younger Rival, Renews Call for Cognitive Tests  —  Former GOP presidential contender says Democrats should move on from Biden  —  Nikki Haley, the runner-up to Donald Trump in this year's GOP nomination race, said Democrats need to dump President Biden … ",
    "url": "https://www.wsj.com/politics/elections/haley-warns-trump-to-prepare-for-younger-rival-renews-call-for-cognitive-tests-5c6d7294"
  },
  {
    "text": "Obama Rode to Biden's Rescue—but Intervention Could Yet Come  —  TIME TO GO, JOE?  —  The 44th president is one of four big names Democrats think could persuade his successor to stand aside.  The others are Bill Clinton, Jill Biden and Valerie Biden Owens.",
    "url": "https://www.thedailybeast.com/obama-rode-to-bidens-rescuebut-intervention-could-yet-come"
  },
  {
    "text": "Biden acknowledges bad debate performance and age … - The president appeared to address some of those criticisms head-on Friday in an attempt to assuage Democrats' concerns. … - “I don't walk as easy as I used to, I don't speak as smoothly as I used to, I don't debate as well as I used to, but I know what I do know.",
    "url": "https://www.axios.com/2024/06/28/biden-debate-rally-north-carolina"
  },
  {
    "text": "A Newly Energized Joe Biden Addresses The Elephant In The Room  —  “I don't debate as well as I used to, but I know what I do know: I know how to tell the truth,” Biden said at a North Carolina rally.  —  LOADING  —  At a rally in North Carolina on Friday, President Joe Biden brought … ",
    "url": "https://www.huffpost.com/entry/joe-biden-rally-debate-performance_n_667ef506e4b0d079dd459439"
  },
  {
    "text": "Attorney General Merrick B. Garland Statement on the Supreme Court's Decision in Fischer v. United States  —  For Immediate Release  —  The Justice Department issued the following statement from Attorney General Merrick B. Garland on the Supreme Court's decision in Fischer v. United States:",
    "url": "https://www.justice.gov/opa/pr/attorney-general-merrick-b-garland-statement-supreme-courts-decision-fischer-v-united-states"
  },
  {
    "text": "Supreme Court gives cities and towns power to criminalize homelessness  —  The Oregon case has been closely watched by Western cities and states.  —  On Friday, the U.S. Supreme Court ruled that cities and municipalities can punish people for sleeping outside, even when they have nowhere else to go.",
    "url": "https://www.hcn.org/articles/supreme-court-gives-cities-and-towns-power-to-criminalize-homelessness/"
  },
  {
    "text": "CNN fails the nation  —  The signal failure of the American media during the Trump era has been the refusal to hold Donald Trump accountable for his behavior - and, in particular, his endless lies.  —  That has never been more obvious than it was at Thursday night's presidential debate.",
    "url": "https://presswatchers.org/2024/06/cnn-fails-the-nation/"
  },
  {
    "text": "Supreme Court Executes Massive Power Grab From Executive Branch In New Ruling  —  The Court's conservatives overruled Chevron Friday, a right-wing legal world quest years in the making.  —  The Supreme Court overruled a key pillar of federal agency authority Friday, appropriating a massive amount of executive branch power to itself.",
    "url": "https://talkingpointsmemo.com/news/supreme-court-chevron-overrule-agency"
  },
  {
    "text": "Bannon Is ‘Quite Concerned’ About His New Prison Digs: Source  —  DO NOT PASS GO  —  He was ordered to report to jail on Monday after his last-minute plea to the Supreme Court was rejected. … MAGA loyalist Steve Bannon is dreading his soon-to-be-reality of being housed alongside sex offenders … ",
    "url": "https://www.thedailybeast.com/steve-bannon-is-quite-concerned-about-his-new-prison-digs"
  },
  {
    "text": "Major Democratic Donors Ask Themselves: What to Do About Biden?  —  Some floated interventions and wondered about how to reach Jill Biden.  Others hoped the president would bow out of the race on his own.  Many came to terms with the low chances that he will do so.",
    "url": "https://www.nytimes.com/2024/06/29/us/politics/biden-donors-democrats.html"
  },
  {
    "text": "Supreme Court Imperils an Array of Federal Rules  —  A foundational 1984 decision required courts to defer to agencies' reasonable interpretations of ambiguous statutes, underpinning regulations on health care, safety and the environment.  —  The decision is the latest upending longstanding precedents.",
    "url": "https://www.nytimes.com/live/2024/06/28/us/supreme-court-chevron"
  },
  {
    "text": "New Jersey Does Not Renew Trump Liquor Licenses In Wake Of Felony Conviction  —  The state issued interim licenses and scheduled a hearing for two clubs to prove they still qualify to serve alcohol.  —  The New Jersey Division of Alcoholic Beverage Control decided against renewing liquor licenses … ",
    "url": "https://www.forbes.com/sites/zacheverson/2024/06/28/new-jersey-does-not-renew-trump-liquor-licenses-in-wake-of-felony-conviction/"
  },
  {
    "text": "Who do you think the Democratic Party should nominate as its presidential candidate, if it wants to have the best chance of winning?  —  EXPLORE MORE DATA & ARTICLES  —  See results",
    "url": "https://today.yougov.com/topics/politics/survey-results/daily/2024/06/28/3f653/2"
  }
]