[
  {
    "text": "Musk's DOGE seeks access to personal taxpayer data, raising alarm at IRS  —  The unusual request would put sensitive data about millions of American taxpayers in the hands of Trump political appointees.  —  Elon Musk's U.S. DOGE Service is seeking access to a heavily-guarded Internal Revenue Service system … ",
    "url": "https://www.washingtonpost.com/business/2025/02/16/doge-irs-access-taxpayer-data/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5NjgyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMDY0Mzk5LCJpYXQiOjE3Mzk2ODIwMDAsImp0aSI6ImQyZjZkNzAxLWRlNDYtNDBkMy1hMzdlLTEzYTVkMmFiZDQwZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzE2L2RvZ2UtaXJzLWFjY2Vzcy10YXhwYXllci1kYXRhLyJ9.GTR7Kzo7RHkVEfAw9fm8z_ME0V59fiFRofc8rtH9dG8&itid=gfta"
  },
  {
    "text": "DOGE-affiliated employee has accessed IRS system with sensitive taxpayer information  —  The Integrated Data Retrieval System allows IRS employees to access taxpayer information.  —  WASHINGTON — An Internal Revenue Service employee who is affiliated with the Department of Government Efficiency … ",
    "url": "https://www.nbcnews.com/politics/doge/doge-affiliated-employee-accessed-irs-system-sensitive-taxpayer-inform-rcna192423"
  },
  {
    "text": "Washington Post backs out of ‘Fire Elon Musk’ ad order  —  The Washington Post this week backed out of a “Fire Elon Musk” advertising order that was to run as a wrap on some of its Tuesday editions, according to the advocacy group Common Cause.  —  The group said it signed a $115,000 agreement … ",
    "url": "https://thehill.com/media/5148497-washington-post-backs-out-of-fire-elon-musk-ad-order/"
  },
  {
    "text": "Hundreds of FAA probationary workers fired by Trump administration, union says  —  The Trump administration has started firing hundreds of Federal Aviation Administration probationary employees who maintain critical air traffic control infrastructure, according to their union.",
    "url": "https://www.cnn.com/2025/02/16/politics/faa-employees-fired-trump-administration/"
  },
  {
    "text": "Our Government Is Experiencing a Rapid Unscheduled Disassembly  —  Musk is moving fast and breaking important things  —  Last month SpaceX carried out a test launch of its in-development Starship rocket.  Liftoff was achieved, but as the company later announced, “Starship experienced … ",
    "url": "https://paulkrugman.substack.com/p/our-government-is-experiencing-a"
  },
  {
    "text": "Trump begins firings of FAA air traffic control staff just weeks after fatal DC plane crash  —  The Trump administration has begun firing several hundred Federal Aviation Administration employees, upending staff on a busy air travel weekend and just weeks after a January fatal mid-air collision … ",
    "url": "https://apnews.com/article/doge-faa-air-traffic-firings-safety-67981aec33b6ee72cbad8dcee31f3437"
  },
  {
    "text": "CDC ‘disease detectors’ among hundreds fired as Trump administration ramps up agency cuts  —  Administration officials last week informed CDC leaders of plans to cut up to 10% of its workforce as it targeted federal probationary employees.  —  The Trump administration on Saturday terminated hundreds … ",
    "url": "https://www.nbcnews.com/politics/doge/cdc-disease-detectors-fired-trump-administration-agency-cuts-doge-rcna192420"
  },
  {
    "text": "Mass firings continue across nation's health agencies  —  The cuts have raised questions about the extent of the impact on public health.  —  The Trump administration carried out more mass firings across the Health and Human Services Department this weekend, continuing a chaotic purge … ",
    "url": "https://www.politico.com/news/2025/02/16/mass-firings-health-agencies-00204570"
  },
  {
    "text": "Trump administration tries to bring back fired nuclear weapons workers in DOGE reversal  —  The Trump administration has halted the firings of hundreds of federal employees who were tasked with working on the nation's nuclear weapons programs, in an about-face that has left workers confused … ",
    "url": "https://apnews.com/article/nuclear-doge-firings-trump-federal-916e6819104f04f44c345b7dde4904d5"
  },
  {
    "text": "Trump Voters Splinter Over His Rapid Shake-Up of Washington  —  Some core supporters love his no-holds-barred approach, but several swing voters are taken aback at his early moves",
    "url": "https://www.wsj.com/politics/policy/trump-voter-regrets-presidential-election-7b4fc43d?st=zk6sog"
  },
  {
    "text": "125. The Court's First Trump II Case Won't Be a Bellwether  —  The challenge to Trump's removal of the head of the Office of Special Counsel raises unique procedural and substantive issues likely to prevent it from serving as a referendum—in either direction.",
    "url": "https://www.stevevladeck.com/p/125-the-courts-first-trump-ii-case"
  },
  {
    "text": "Trump administration pressures Romania to lift restrictions on Tate brothers  —  Tristan and Andrew Tate have been charged with sexual misconduct, organised crime and money laundering  —  The Trump administration has pressured Romanian authorities to lift travel restrictions … ",
    "url": "https://www.ft.com/content/3f951e0b-a9cb-489a-be89-fdf9f996ed27"
  },
  {
    "text": "Adams Forcefully Resists Calls to Resign: ‘I Am Going Nowhere’  —  Mayor Eric Adams spoke at two Black churches in Queens and pushed back at those who “are dancing on my grave.”  —  Whenever Mayor Eric Adams has faced adversity, he has sought refuge in the pulpit of Black churches … ",
    "url": "https://www.nytimes.com/2025/02/16/nyregion/eric-adams-resign.html"
  },
  {
    "text": "Playbook: Europe's split-screen moment  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  Good Monday morning, and happy Presidents' Day.  This is Jack Blanchard, still trying to forgive Gen. George Washington for that whole armed rebellion business.  Give it another 250 years, we'll get there.",
    "url": "https://www.politico.com/newsletters/playbook/2025/02/17/europes-split-screen-moment-00204578"
  },
  {
    "text": "Elon Musk's X blocks links to Signal, the encrypted messaging service  —  Signal has been a primary method of communication for federal workers looking to blow the whistle on DOGE.  —  Elon Musk's social media platform, X, is currently banning links to “Signal.me,” a URL used by the encrypted messaging service Signal.",
    "url": "https://www.disruptionist.com/p/elon-musks-x-blocks-links-to-signal"
  },
  {
    "text": "Jan. 6 Rioters Argue Pardons Apply to Charges Including Murder Plot, Child Porn  —  Defendants argue that Trump pardons should absolve them of additional crimes, some discovered during investigations of the Capitol riot",
    "url": "https://www.wsj.com/us-news/law/jan-6-released-aftermath-7e8a57a4?st=yA5BVX&reflink=article_copyURL_share"
  },
  {
    "text": "This is Not Marco Rubio's State Department  —  The secretary of State is taking positions that were once anathema and sounding very Trumpy online.  —  It is becoming increasingly clear that Marco Rubio is secretary of State in name only.  —  Since taking over Foggy Bottom … ",
    "url": "https://www.politico.com/news/magazine/2025/02/17/marco-rubio-state-department-toosi-00204407"
  },
  {
    "text": "2/17/25 ☀️ AM:  —  Senate GOP readies to consider budget plan with House out  —  Introducing the first speakers at The Conference  —  DOGE on the rampage but cracks start to emerge  —  Senate GOP readies to consider budget plan with House out … And happy Presidents' Day.",
    "url": "https://punchbowl.news/archive/21725-am/"
  },
  {
    "text": "The Week Ahead  —  Who you vote for is a political choice.  Whether a fully eligible citizen can vote isn't about politics, it's about your fundamental rights as an American.  For decades now, the Republican party's trajectory has involved making it more difficult for eligible people to vote … ",
    "url": "https://joycevance.substack.com/p/the-week-ahead-b87"
  },
  {
    "text": "Birthright Citizenship: Barnett & Wurman's NY Times Essay and their Bates/Blackstone Double Backfire  —  Randy Barnett & Ilan Wurman had a guest essay in the N.Y. Times on Feb. 15th: “Trump Might Have a Case on Birthright Citizenship.”  The bottom line is that their essay backfires … ",
    "url": "https://shugerblogcom.wordpress.com/2025/02/16/birthright-citizenship-barnett-wurmans-ny-times-essay-and-their-bates-backfire/"
  }
]