[
  {
    "text": "Trump's classified documents case dismissed by Judge Aileen Cannon  —  The Florida judge accepted a long-shot legal argument, embraced by conservatives, that special counsel Jack Smith was improperly appointed.  —  The federal judge overseeing the classified documents charges … ",
    "url": "https://www.washingtonpost.com/national-security/2024/07/15/trump-classified-trial-dismisssed-cannon/"
  },
  {
    "text": "Federal judge dismisses Trump classified documents case over concerns with prosecutor's appointment  —  The federal judge presiding over the classified documents case of former President Donald Trump in Florida dismissed the prosecution on Monday, siding with defense lawyers who said the special counsel … ",
    "url": "https://apnews.com/article/trump-classified-documents-smith-c66d5ffb7ba86c1b991f95e89bdeba0c"
  },
  {
    "text": "Judge dismisses classified documents case against Donald Trump  —  A federal judge on Monday dismissed the classified documents case against Donald Trump, a shock ruling that clears away one of the major legal challenges facing the former president.  —  In a 93-page ruling … ",
    "url": "https://www.cnn.com/2024/07/15/politics/classified-documents-case-trump-dismissed-aileen-cannon/"
  },
  {
    "text": "Live Updates: Judge Dismisses Classified Documents Case Against Trump  —  Judge Aileen Cannon ruled that the entire case should be thrown out because the appointment of the special counsel who brought the case, Jack Smith, had violated the Constitution.  Her decision is sure to be appealed.",
    "url": "https://www.nytimes.com/live/2024/07/15/us/trump-documents-case-dismissed"
  },
  {
    "text": "A History of Violence  —  And Aileen Cannon's justice.  —  Reminder: We'll be livestreaming convention coverage tonight on YouTube.  Interesting times are best experienced among friends.  —  Also: Joe will be publishing a daily version of Press Pass this week.",
    "url": "https://www.thebulwark.com/p/a-history-of-violence"
  },
  {
    "text": "Judge Dismisses Classified Documents Case Against Trump  —  Judge Aileen Cannon ruled that the entire case should be thrown out because the appointment of the special counsel who brought the case, Jack Smith, had violated the Constitution.  Her decision is sure to be appealed.",
    "url": "https://www.nytimes.com/2024/07/15/us/politics/trump-document-case-dismissed.html"
  },
  {
    "text": "Behind the Curtain: “Getting shot in the face changes a man” … - He can unify the party. … - He could unify America. … - He could box out Democrats. … - He could show a different side of himself.",
    "url": "https://www.axios.com/2024/07/15/trump-convention-speech-rnc-milwaukee"
  },
  {
    "text": "Grateful, defiant Trump recounts surviving ‘surreal’ assassination attempt at rally: 'I'm supposed to be dead'  —  A grateful and at times defiant Donald Trump told The Post Sunday he's “supposed to be dead” as he recalled the harrowing moment a would-be assassin shot him at a Pennsylvania campaign rally.",
    "url": "https://nypost.com/2024/07/14/us-news/grateful-defiant-trump-recounts-surreal-assassination-attempt-at-rally-im-supposed-to-be-dead/"
  },
  {
    "text": "Trump's VP pick is a naked authoritarian  —  I met Sen. J.D. Vance (R-OH), Donald Trump's new choice for vice president, in the summer of 2022.  I was covering a conservative conference in Israel, and Vance was the surprise VIP attraction.  We chatted for a bit about the connections between … ",
    "url": "https://www.vox.com/politics/360283/jd-vance-trump-vp-vice-president-authoritarian"
  },
  {
    "text": "Mystery Over Trump's Diagnosis and Treatment After Assassination Attempt  —  UNANSWERED QUESTIONS  —  Trump was taken to Butler Memorial Hospital close to where the attack happened, but no details have been officially released.  —  Deputy Washington Bureau Chief",
    "url": "https://www.thedailybeast.com/mystery-over-donald-trumps-medical-condition-and-treatment-after-assassination-attempt"
  },
  {
    "text": "RNC 2024 Day 1 live updates: Trump picks Vance as running mate  —  J.D. Vance is a 39-year-old first-time senator from Ohio.  —  LIVE  —  A view of the convention floor before the 2024 Republican National Convention at the Fiserv Forum, July 14, 2024, in Milwaukee, Wisconsin.",
    "url": "https://abcnews.go.com/Politics/live-updates/republican-national-convention-2024-day-1/?id=111935976"
  },
  {
    "text": "Multiple things are true about Trump's shooting  —  PN is a reader-supported publication made possible by paid subscribers.  Appreciate our independent journalism?  Then please sign up to support us.  —  ✍️ Subscribe to Public Notice ✍️  —  I picked a hell of a night to log off.",
    "url": "https://www.publicnotice.co/p/trump-shooting-butler-pennsylvania"
  },
  {
    "text": "‘Morning Joe’ pulled from air Monday because of Trump shooting  —  New York CNN  —  MSNBC will not air “Morning Joe,” its celebrated politics roundtable program, on Monday, opting to instead air continued breaking news coverage of the attempted assassination of former President Donald Trump.",
    "url": "https://www.cnn.com/2024/07/14/media/msnbc-morning-joe-pulled-trump-assassination/"
  },
  {
    "text": "Statement From U.S. Secret Service Director Kimberly Cheatle  —  Published By U.S. Secret Service Media Relations  —  I would like to start by extending my deepest condolences to the family and friends of Corey Comperatore, who was killed during the assassination attempt … ",
    "url": "https://www.secretservice.gov/newsroom/releases/2024/07/statement-us-secret-service-director-kimberly-cheatle"
  },
  {
    "text": "Political Violence  —  Reflections from the 1920s and 1930s  —  What to make of the assassination attempt?  —  I am sharing a few thoughts about where we are, based on assassinations during the interwar period, the 1920s and 1930s.  It is distant enough that perhaps we can attend … ",
    "url": "https://snyder.substack.com/p/political-violence"
  },
  {
    "text": "Man killed at Trump rally identified as firefighter Corey Comperatore, who ‘died a hero’  —  Friends and neighbors are remembering firefighter Corey Comperatore - the man shot and killed during the attempted assassination of former President Donald Trump - as a family man who served his community and was quick to help friends in need.",
    "url": "https://www.cnn.com/2024/07/14/politics/corey-comperatore-trump-shooting-victim/"
  },
  {
    "text": "AOC to anonymous Democrat who said party resigned to Trump win: ‘Retire’  —  Comments made by unnamed senior Democrat after Trump shooting draw stinging rebuke from progressive  —  Alexandria Ocasio-Cortez had a simple message for an unnamed senior Democrat who reportedly said the party had … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/15/aoc-democrat-trump-election-win-comments"
  },
  {
    "text": "Republicans approve new platform with revised abortion position  —  The new platform leaves open a path to legislation or court decisions that would offer fetuses legal rights, but it infuriated some anti-abortion advocates.  —  MILWAUKEE — Delegates at the Republican National Convention approved … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/15/republican-party-platform-trum-abortion/"
  }
]