[
  {
    "text": "‘Cheap shot’: Biden allies go on the attack against the special counsel and the media  —  The White House depicted the report as partisan and the media coverage as unfair.  —  WASHINGTON — The Biden campaign and the White House have landed on an initial strategy for responding … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/cheap-shot-biden-allies-go-attack-special-counsel-media-rcna138123?taid=65c757381ba9b100015eceee"
  },
  {
    "text": "White House frustration with Garland grows  —  The president believes the special counsel investigating his handling of classified documents went beyond his remit.  And part of the blame is being placed on the AG.  —  Joe Biden has told aides and outside advisers that Attorney General Merrick Garland … ",
    "url": "https://www.politico.com/news/2024/02/09/white-house-frustration-with-garland-grows-00140813"
  },
  {
    "text": "White House Calls Special Counsel Report on Biden Politically Motivated  —  The White House and some Democrats tried to discredit a document that characterized the president as elderly and forgetful.  —  White House officials on Friday called the special counsel's report into President Biden's handling … ",
    "url": "https://www.nytimes.com/2024/02/09/us/politics/kamala-harris-biden-special-counsel.html"
  },
  {
    "text": "‘Hair on fire’: Democratic worries grow over claims about Biden's memory lapses  —  The broad conclusion among Democrats is that a dangerous and misleading caricature of the president's performance is at risk of setting in  —  President Biden arrived in the Diplomatic Reception Room … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/09/biden-memory-age-hur-documents/"
  },
  {
    "text": "Robert Hur's Box-Checking  —  In the middle of his explanation for why he believed that Joe Biden had willfully retained classified records pertaining to Afghanistan but that he couldn't prove that beyond a reasonable doubt, Special Counsel Robert Hur admitted that jurors … ",
    "url": "https://www.emptywheel.net/2024/02/09/robert-hurs-box-checking/"
  },
  {
    "text": "‘Yikes’: Internet erupts after ‘Dementia Trump’ makes several verbal slip-ups at NRA rally  —  Donald Trump Friday was hit with a stream of criticism for several verbal slip-ups at an event for the NRA in Pennsylvania.  —  The former president slurred when saying the word “subsidies,” said … ",
    "url": "https://www.rawstory.com/yikes-dementia-trump-slip-ups/"
  },
  {
    "text": "Trump promises NRA that if elected, ‘no one will lay a finger on your firearms’  —  The former president vowed to roll back Biden-era gun restrictions.  —  Donald Trump told National Rifle Association members on Friday that “no one will lay a finger on your firearms” if he wins the presidency … ",
    "url": "https://www.politico.com/news/2024/02/09/trump-promises-nra-that-if-elected-no-one-will-lay-a-finger-on-your-firearms-00140818"
  },
  {
    "text": "McCarthy confident in McDaniel and bristles at Gaetz suggestion of leading RNC  —  LAS VEGAS — Former House Speaker and California GOP Rep. Kevin McCarthy said Republican National Committee Chairwoman Ronna McDaniel is equipped to continue leading the party.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/2847495/kevin-mccarthy-confident-rnc-chairwoman-mcdaniel-leadership/"
  },
  {
    "text": "Critical Atlantic Ocean current system is showing early signs of collapse, prompting warning from scientists  —  A crucial system of ocean currents may already be on course to collapse, according to a new report, with alarming implications for sea level rise and global weather … ",
    "url": "https://www.cnn.com/2024/02/09/climate/atlantic-circulation-collapse-weather-climate"
  },
  {
    "text": "What the Long Island special election tells us about the battle over the suburbs  —  The race between former Rep. Tom Suozzi and Mazi Melesa Pilip could provide clues for both parties on immigration and crime as they gear up for 2024.  —  The nation's suburbs are moving toward Democrats.",
    "url": "https://www.politico.com/news/2024/02/10/new-york-special-election-suburbs-00140796"
  },
  {
    "text": "Republicans see Latino voters in Nevada as key to retaking the White House in 2024  —  LAS VEGAS - Shuffling through jeans on a clothing rack in her small store at a Latino market, Christy Rosales says she hopes Trump returns to office.  —  The 40-year-old native of Colombia complains … ",
    "url": "https://www.npr.org/2024/02/10/1230546093/republicans-see-latino-voters-in-nevada-as-key-to-retaking-the-white-house-in-20"
  },
  {
    "text": "Ukraine funding package moves closer to Senate passage  —  The Senate voted Friday evening to push a $95.3 billion package funding Ukraine, Israel and other national security priorities closer to passing the upper chamber, even though many Republican senators are upset the legislation … ",
    "url": "https://thehill.com/homenews/senate/4459618-ukraine-funding-package-moves-closer-to-senate-passage/"
  },
  {
    "text": "Big Pharma spends billions more on executives and stockholders than on R&D  —  Senate report points to greed and “patent thickets” as key reasons for high prices.  —  When big pharmaceutical companies are confronted over their exorbitant pricing of prescription drugs in the US … ",
    "url": "https://arstechnica.com/science/2024/02/big-pharma-spends-billions-more-on-executives-and-stockholders-than-on-rd/"
  },
  {
    "text": "DNC accuses RFK Jr. campaign and super PAC of illegal coordination  —  The Democratic National Committee (DNC) accused independent candidate Robert F. Kennedy Jr.'s presidential campaign and his aligned super PAC of illegal coordination, alleging he is receiving improper benefits … ",
    "url": "https://thehill.com/homenews/campaign/4459038-dnc-accuses-rfk-jr-campaign-super-pac-of-illegal-coordination/"
  },
  {
    "text": "Putin's interview with his fawning stooge Tucker Carlson was straight out of Hitler's playbook.  I pray Americans see through this unholy charade  —  When Tucker Carlson went to the Kremlin he had a function well known to history.  He was to be the stooge of the tyrant, the dictaphone to the dictator and a traitor to journalism.",
    "url": "https://www.dailymail.co.uk/columnists/article-13066311/BORIS-JOHNSON-Putin-Tucker-Carlson-interview-stooge-Hitler-charade.html"
  }
]