[
  {
    "text": "Live updates: President Joe Biden ends his 2024 bid  —  President Joe Biden says he's ready to return to the campaign trail, even as a growing chorus of Democratic lawmakers called for him to step aside.  —  Meanwhile, Donald Trump on Saturday held his first public campaign rally since … ",
    "url": "https://apnews.com/live/biden-trump-election-campaign-updates"
  },
  {
    "text": "Election 2024 live updates: Biden says he will end his re-election bid  —  President Joe Biden said he is stepping aside from the presidential race in a letter posted to X.  “It has been the greatest honor of my lift to serve as your president,” he wrote.  “And while it has been my intention … ",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/trump-biden-president-election-live-updates-rcna162646"
  },
  {
    "text": "Biden drops out of 2024 presidential race  —  He struggled to recover from a disastrous debate and Democrats' doubts.  —  LIVE  —  President Joe Biden speaks alongside Prime Minister of the Czech Republic Petr Fiala before a bilateral meeting in the Oval Office of the White House, April 15, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-drops-2024-presidential-race/story?id=111648603"
  },
  {
    "text": "Republicans could file challenges if Biden replaced, Speaker Johnson says  —  “Every state has its own system,” he said of election laws.  —  House Speaker Mike Johnson reiterated Sunday that any attempt by Democrats to sub in a new candidate in place of President Joe Biden is likely to be met by legal challenges.",
    "url": "https://www.politico.com/news/2024/07/21/biden-johnson-2024-elections-laws-00169973"
  },
  {
    "text": "Trump's edge over Biden takes notable leap in Michigan, new battleground state poll shows  —  An exclusive new Free Press poll of likely Michigan voters shows former President Donald Trump has taken a notable 7-percentage-point lead over incumbent President Joe Biden in the state … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/07/21/michigan-poll-trump-biden-polling/74488606007/"
  },
  {
    "text": "Trump favorability rises following shooting, majority of Americans want Biden to end campaign: POLL  —  More Americans also blame Trump for rise in political violence.  —  Republican presidential nominee and former President Donald Trump gives his acceptance speech at the Republican National Convention … ",
    "url": "https://abcnews.go.com/Politics/trump-favorability-rises-shooting-majority-americans-biden-end/story?id=112112043"
  },
  {
    "text": "Election Live Updates: Trump, Leaving Unity Behind, Insults Biden, Who Remains Sidelined With Covid  —  President Biden wrote on social media that he was ending his campaign for re-election after intense pressure from within his own party.  He endorsed Vice President Kamala Harris to replace him atop the Democratic ticket.",
    "url": "https://www.nytimes.com/live/2024/07/21/us/trump-biden-election"
  },
  {
    "text": "GOP lawmakers call for Biden to resign presidency after dropout bombshell  —  Immediately after Joe Biden dropped the bombshell that he was dropping out of the presidential race, congressional Republicans started to openly call for him to resign from the White House now.",
    "url": "https://www.politico.com/live-updates/2024/07/21/joe-biden-drops-out-election/gop-calls-on-biden-to-resign-presidency-00169992"
  },
  {
    "text": "How I Would Script This Moment for Biden and the Democrats  —  The Paley Center for Media just opened an exhibition celebrating the 25th anniversary of “The West Wing,” the NBC series I wrote from 1999 to 2003.  Some of the show's story points have become outdated in the last quarter-century … ",
    "url": "https://www.nytimes.com/2024/07/21/opinion/biden-west-wing-aaron-sorkin.html?unlocked_article_code=1.800.mJpZ.eTOV3Li2kEkN&smid=url-share"
  },
  {
    "text": "President Joe Biden drops out of 2024 presidential race  —  Biden, after a five-decade political career, faced a reckoning over his age and whether he could defeat Donald Trump.  His party now faces a historic effort to replace him.  —  WASHINGTON — President Joe Biden announced Sunday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/president-joe-biden-drops-2024-presidential-race-rcna159867"
  },
  {
    "text": "Biden drops out of presidential race after Democratic revolt following disastrous debate: ‘Best interest of the country’  —  President Biden made the historically rare decision Sunday to drop out of the 2024 presidential race, less than four months after being declared the Democratic Party's … ",
    "url": "https://nypost.com/2024/07/21/us-news/biden-drops-out-of-presidential-race-after-disastrous-debate-performance/"
  },
  {
    "text": "Election 2024 live updates  —  Biden steps aside as Democratic nominee, endorses Harris  —  President Biden is ending his presidential campaign, a momentous decision that upends the 2024 presidential race, and is endorsing Vice President Harris for the top of the ticket.",
    "url": "https://www.washingtonpost.com/elections/2024/07/21/election-2024-biden-trump-campaign-updates/"
  },
  {
    "text": "Since Leaving Butler, Trump Has Foregone the Best Medical Care and Is Withholding CT Scan Results  —  Fresh off his stunt calls for Joe Biden to be drug tested during the debate, Ronny Jackson — the lapsed doctor who turned the White House into a pill mill and covered up Trump's near-lethal COVID … ",
    "url": "https://www.emptywheel.net/2024/07/21/since-butler-trump-has-foregone-competent-medical-care-and-is-withholding-ct-scan-results/"
  },
  {
    "text": "“It's not that complicated”: Pete Buttigieg on why a gay billionaire is backing JD Vance  —  When asked to weigh in on Peter Thiel's reasons for supporting Vance, Buttigieg broke it down plainly: Money  —  In a segment of “Real Time with Bill Maher” at the start of the weekend … ",
    "url": "https://www.salon.com/2024/07/20/its-not-that-complicated-pete-buttigieg-on-why-a-gay-billionaire-is-backing-jd-vance/"
  },
  {
    "text": "Pulitzer-winning author Anne Applebaum: ‘Often, for autocrats, the second time in power is worse’  —  The journalist tells of her fears for democracy's future, the dangers of another Trump presidency and how her husband became Poland's foreign minister  —  A couple of years ago … ",
    "url": "https://www.theguardian.com/books/article/2024/jul/21/anne-applebaum-autocracy-inc-donald-trump-vladimir-putin-gaza-european-elections-propaganda-keir-starmer"
  }
]