[
  {
    "text": "Trump Privately Approved of Attack Plans for Iran but Has Withheld Final Order  —  As the conflict between Iran and Israel continues, President Trump is considering multiple options, including a U.S. strike on Iran  —  President Trump told senior aides late Tuesday that he approved of attack plans for Iran … ",
    "url": "https://www.wsj.com/livecoverage/iran-israel-conflict-news"
  },
  {
    "text": "Trump Privately Approved Attack Plans For Iran But Has Withheld Final Order  —  The president is hoping that threatening to join Israel's strikes will lead Tehran to abandon its nuclear program  —  WASHINGTON—President Trump told senior aides late Tuesday that he approved of attack plans for Iran … ",
    "url": "https://www.wsj.com/politics/national-security/trump-privately-approved-attack-plans-for-iran-but-has-withheld-final-order-4563c526?st=2G6TEe&reflink=desktopwebshare_permalink"
  },
  {
    "text": "We asked 1,000 Americans if they support U.S. strikes on Iran.  This is how they responded.  —  if they support U.S. strikes on Iran.  —  Cannot allow Iran to have nukes  —  Israel can handle it defend our country Diplomacy first  —  going to war and dying  —  Too dangerous",
    "url": "https://www.washingtonpost.com/politics/interactive/2025/iran-strike-us-involvement-poll/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUwMjE5MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUxNjAxNTk5LCJpYXQiOjE3NTAyMTkyMDAsImp0aSI6IjRmYjZmMjg3LTk2NTktNDcwNy05YTliLWFmZWY0NDM3YTM2YiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy9pbnRlcmFjdGl2ZS8yMDI1L2lyYW4tc3RyaWtlLXVzLWludm9sdmVtZW50LXBvbGwvIn0.LXvYNAAwBfe-J00k07MxGXiC0oasTGMh46sEWVN-JtU&itid=gfta"
  },
  {
    "text": "Trump presses aides on whether bunker-buster plan to bomb Iran will work  —  One key question is on President Trump's mind these days, his advisers say: If the U.S. joins Israel's war and drops its massive bunker busters, will they actually destroy Iran's most heavily fortified nuclear facility?",
    "url": "https://www.axios.com/2025/06/18/trump-bunker-buster-bomb-iran-nuclear-program"
  },
  {
    "text": "Fox News Is Demanding War With Iran.  Donald Trump Is Listening  —  Trump's heavy consumption of Fox News content is increasing his appetite for direct military confrontation with Iran  —  As President Donald Trump weighs sending U.S. forces to help Israel bomb Iran … ",
    "url": "https://www.rollingstone.com/politics/politics-features/fox-news-war-iran-donald-trump-propaganda-1235367796/"
  },
  {
    "text": "Navigating Iran crisis, Trump relies on experience over star power  —  Gabbard, Hegseth outside the inner circle as president weighs military actions against Iran.  —  Summary55  —  As President-elect Donald Trump assembled his core national security team early this year … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/18/iran-war-trump-hegseth-gabbard/"
  },
  {
    "text": "State Dept. restarts student visa interviews with tougher social media rules  —  The new visa requirements could impact hundreds of thousands of visa applications each year, raising concerns about staffing requirements.  —  The State Department is restarting interviews for new student visas … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/18/student-visas-social-media-vetting-state-department/"
  },
  {
    "text": "U.S. to Review Social Media Posts of Student and Scholar Visa Applicants  —  The State Department is restarting the processing of visa applications from students and visiting scholars, but is screening for “hostility” toward the United States.  —  The State Department plans to review … ",
    "url": "https://www.nytimes.com/2025/06/18/us/politics/student-visa-applications.html"
  },
  {
    "text": "State Department unveils social media screening rules for all student visa applicants  —  Applicants will be vetted for “any indications of hostility towards the citizens, culture, government, institutions or founding principles of the United States.”  —  U.S. diplomats have officially … ",
    "url": "https://www.politico.com/news/2025/06/18/social-media-screening-student-visas-00413160"
  },
  {
    "text": "SAMHSA Statement on 988 Press 3 Option  —  On July 17, the 988 Suicide & Crisis Lifeline will no longer silo LGB+ youth services, also known as the “Press 3 option,” to focus on serving all help seekers, including those previously served through the Press 3 option.",
    "url": "https://www.samhsa.gov/about/news-announcements/statements/2025/samhsa-statement-988-press-3-option"
  },
  {
    "text": "The Supreme Court's incoherent new attack on trans rights, explained  —  What the hell did the Court just do to equal protection law? … It was obvious, if you listened to the Supreme Court's oral argument in United States v. Skrmetti last December, that the Court would vote … ",
    "url": "https://www.vox.com/scotus/417281/supreme-court-skremett-transgender-tennessee-health"
  },
  {
    "text": "FDA approves 6-month HIV prevention shot  —  Pharmaceutical company Gilead Sciences announced Wednesday the Food and Drug Administration (FDA) has approved its six-month, twice-yearly HIV PrEP injection, which was found in trials to be more than 99.9 percent effective among participants.",
    "url": "https://thehill.com/policy/healthcare/5357828-fda-approves-gilead-hiv-prep/"
  },
  {
    "text": "ICE Bars Reps. Goldman and Nadler From Immigrant Detention Area ‘Approaching Capacity’  —  Two members of Congress were refused entry to Immigration and Customs Enforcement detention areas inside 26 Federal Plaza Wednesday morning, despite rules laid out by Congress allowing members to conduct unannounced visits for oversight purposes.",
    "url": "https://www.thecity.nyc/2025/06/18/ice-nadler-goldman-federal-detention-manhattan/"
  },
  {
    "text": "Justice Dept. to Cut Two-Thirds of Inspectors Monitoring Gun Sales  —  The move is part of the Trump administration's effort to defang and downsize the Bureau of Alcohol, Tobacco, Firearms and Explosives.  —  The Justice Department plans to slash the number of inspectors … ",
    "url": "https://www.nytimes.com/2025/06/18/us/politics/justice-dept-guns-atf-trump.html"
  },
  {
    "text": "Accounts peddling child abuse content flood some X hashtags as safety partner cuts ties  —  Thorn, a non-profit that provides detection and moderation software related to child safety, said they canceled their contract with X after the platform stopped paying them.",
    "url": "https://www.nbcnews.com/tech/tech-news/x-accounts-peddle-child-abuse-musk-material-thorn-cuts-ties-rcna212107"
  },
  {
    "text": "Some Democratic senators regret voting to confirm Kristi Noem as DHS secretary  —  After seven Democrats voted for Noem, some say they'd now oppose her in the wake of Trump's aggressive deportation plans and last week's incident involving Sen. Alex Padilla.  —  WASHINGTON — Five days … ",
    "url": "https://www.nbcnews.com/politics/congress/democratic-senators-regret-voting-confirm-kristi-noem-dhs-secretary-rcna213809"
  },
  {
    "text": "6/19/25 ☀️ AM: … We only have one edition today in honor of the Juneteenth federal holiday.  —  Republicans know they have a big, beautiful problem: The centerpiece of President Donald Trump's agenda is polling like garbage.  —  Public surveys from this month paint … ",
    "url": "https://punchbowl.news/archive/61925-am/"
  },
  {
    "text": "The D.N.C. Is in Chaos and Desperate for Cash  —  Under its new leader, Ken Martin, the Democratic National Committee has been plagued by infighting and a drop in big donations, raising alarms from Democrats as they try to win back power.  —  Just months into the tenure of a new party leader … ",
    "url": "https://www.nytimes.com/2025/06/18/us/politics/dnc-ken-martin.html?unlocked_article_code=1.P08.BUDk._WYObmCl7JWm&smid=url-share"
  },
  {
    "text": "US housing construction falls to 5-year low as tariffs weigh on sector  —  Signs of property market weakness come hours ahead of Federal Reserve's decision on interest rates  —  Residential construction in the US dropped to a five-year low in May, as homebuilders grappled with volatile tariffs … ",
    "url": "https://www.ft.com/content/3ffaf2cf-815c-4962-95a5-efda946c46c0"
  },
  {
    "text": "Business Leaders Call Trump Attacks on Universities a Competitive Threat  —  More than 200 business leaders signed an open letter calling on the Trump administration to reverse its moves against colleges and universities, arguing that funding cuts and restrictions on student visas threaten America's economic competitiveness.",
    "url": "https://www.wsj.com/livecoverage/fed-meeting-interest-rates-stock-market-06-18-2025/card/business-leaders-call-trump-attacks-on-universities-a-competitive-threat-hphDJbcZLTsaa6Bmeqwg"
  },
  {
    "text": "Trump Travel Restrictions Bar Residents Needed at U.S. Hospitals  —  Limits on travel and visa appointments have delayed or prevented foreign doctors from entering the country for jobs set to begin in weeks.  —  Travel and visa restrictions imposed by the Trump administration threaten patient care … ",
    "url": "https://www.nytimes.com/2025/06/18/health/medical-residents-travel-ban.html"
  },
  {
    "text": "Kennedy's picks for vaccine advisory panel raise concerns about anti-vaccine bias  —  A few of the new members Health Secretary Robert F. Kennedy Jr. appointed to the federal panel have promoted misinformation about vaccines and public health.  —  Health and Human Services Secretary Robert … ",
    "url": "https://www.nbcnews.com/health/health-news/rfk-jr-advisory-panel-concerns-anti-vaccine-bias-rcna213496"
  },
  {
    "text": "Senate leadership ponders rural hospital fund to sway megabill holdouts  —  Senate Republican leaders are working to assuage a group of key megabill holdouts — “the Medicaid moderates” — as they try to lock down votes next week for President Donald Trump's “big, beautiful bill.”",
    "url": "https://www.politico.com/live-updates/2025/06/18/congress/senate-leadership-rural-hospital-fund-00413628"
  },
  {
    "text": "The One Global Problem That's Easy to Fix  —  Middle East peace, climate change, Ukraine — if Sisyphus were assigned one of today's global problems, he'd plead to be returned to rock rolling.  So let's focus for a moment on a global challenge that we can actually solve: starvation.",
    "url": "https://www.nytimes.com/2025/06/18/opinion/hunger-trump-aid-cuts.html"
  },
  {
    "text": "Social Security fund could run dry ahead of earlier forecast, trustees say  —  If Congress does not overhaul the funds' financing, automatic cuts will slash Social Security benefits by 23 percent in 2033, according to the latest trustees report.  —  Summary384",
    "url": "https://www.washingtonpost.com/business/2025/06/18/social-security-predictions-questions-answers/"
  },
  {
    "text": "Break-in reported at home of slain Minnesota state Rep. Melissa Hortman  —  Police say someone pried off a wood covering and broke a window to enter the Brooklyn Park house.  —  Police are investigating a reported overnight break-in at the boarded-up home where Minnesota state Rep. Melissa Hortman … ",
    "url": "https://www.nbcnews.com/news/us-news/break-reported-home-slain-minnesota-state-rep-melissa-hortman-rcna213780"
  },
  {
    "text": "A Wild Number of People Have Already Blocked JD Vance on Bluesky  —  RUDE WELCOME  —  JD Vance's Bluesky launch is not going smoothly.  The vice president had already been blocked by more than 55,000 users on the social media site, according to ClearSky, a third-party tool that tracks Bluesky user activity.",
    "url": "https://www.thedailybeast.com/a-wild-number-of-people-have-already-blocked-jd-vance-on-bluesky/"
  },
  {
    "text": "Why the Trump Administration Is Handcuffing Politicians  —  The detention of Brad Lander, the second-highest-ranking official in New York City, is the latest in a series of aggressive actions that the Administration has taken against members of the opposition party.",
    "url": "https://www.newyorker.com/newsletter/the-daily/why-the-trump-administration-is-handcuffing-politicians"
  }
]