[
  {
    "text": "Rep. Dean Phillips will challenge Biden in Democratic presidential race: “This is an election about the future”  —  Rep. Dean Phillips of Minnesota has decided to challenge President Biden for the Democratic presidential nomination and will launch his 2024 campaign on Friday in New Hampshire … ",
    "url": "https://www.cbsnews.com/news/dean-phillips-biden-presidential-primary-challenge/"
  },
  {
    "text": "Mike Johnson pushed the ‘Big Lie.’ But Biden world sees thornier issues ahead.  —  The White House has begun envisioning life with a new speaker — and the path to keeping the government's lights on.  —  The rapid ascension of Rep. Mike Johnson to the House speakership has forced the White House … ",
    "url": "https://www.politico.com/news/2023/10/26/mike-johnson-speaker-drama-biden-00123841"
  },
  {
    "text": "Before Mike Johnson Was Speaker, He Was Blaming Abortion for School Shootings  —  What is it about Representative Mike Johnson that ended Republicans' spasms of disunity, electing him Speaker of the House on Wednesday?  The initial response was befuddlement, a collective who?",
    "url": "https://nymag.com/intelligencer/2023/10/mike-johnson-abortion-school-shootings.html"
  },
  {
    "text": "Prosecutors Withdraw Second Subpoena in Trump Fund-Raising Inquiry  —  The decision suggests that the special counsel is winding down an investigation into whether the former president's political operation defrauded investors by promoting election lies.  —  Federal prosecutors … ",
    "url": "https://www.nytimes.com/2023/10/26/us/politics/trump-fundraising-jack-smith-election.html"
  },
  {
    "text": "Maine's loose gun laws come under scrutiny after deadly shootings  —  The state does not require permits to carry concealed guns or background checks for private gun sales.  —  The deadly shootings in Maine have brought fresh scrutiny to the relatively loose gun laws in the state … ",
    "url": "https://www.washingtonpost.com/nation/2023/10/26/maine-shooting-gun-safety-laws/"
  },
  {
    "text": "New House Speaker Thinks Creationist Museum Is ‘Pointing People To The Truth’  —  An ark replica with dinosaurs “is one way to bring people to this recognition ... that what we read in the Bible are actual historical events,” Mike Johnson said.  —  Before arriving in Washington less than a decade ago … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-young-earth-creationist_n_653adc81e4b0d69ae7068a0b"
  },
  {
    "text": "Senate Voted to Let Vets With Mental Issues Keep Guns Hours Before Maine Shooting  —  Five senators who caucus with Democrats joined Republicans in voting to adopt the amendment  —  ROBERT CARD, AN Army reservist with a history of mental health issues, is suspected of killing at least 18 people … ",
    "url": "https://www.rollingstone.com/politics/politics-news/senate-adopts-amendment-veterans-mental-issues-guns-1234863402/"
  },
  {
    "text": "Rep. Jared Golden reverses on assault weapons ban  —  The Maine Democrat says he must take responsibility following the mass shooting in his state and now opposes the weapons.  —  Rep. Jared Golden (D-Maine), a conservative Democrat, reversed his previously held opposition and said on Thursday … ",
    "url": "https://www.politico.com/news/2023/10/26/golden-reverses-on-assault-weapons-ban-00123899"
  },
  {
    "text": "DeSantis says he's sending weapons to Israel in move that could bolster him in the GOP primary  —  Florida Gov. Ron DeSantis said Thursday he's arranged to send drones, weapons, and ammunition to Israel as it prepares for an incursion of Gaza in response to Hamas' attack.",
    "url": "https://apnews.com/article/desantis-drones-weapons-shipment-israel-gaza-3fedd0b434552bad313f9109379df071"
  },
  {
    "text": "Trump Prosecutors Fani Willis and Jack Smith Have Been Keeping Their Distance.  That Might Soon Change.  —  A rash of plea deals in the Fulton County election-racketeering case has yielded fresh statements by three former top Trump election attorneys that may be of interest to federal prosecutors",
    "url": "https://themessenger.com/politics/trump-fani-willis-jack-smith-evidence-georgia"
  },
  {
    "text": "A barrage and a midair explosion: What visual evidence shows about the Gaza hospital blast  —  Videos analyzed by The Post reveal that rockets were launched from Gaza in the direction of the hospital 44 seconds before an explosion there  —  Fighters in Gaza launched a barrage of rockets toward Israel … ",
    "url": "https://www.washingtonpost.com/investigations/2023/10/26/gaza-hospital-blast-evidence-israel-hamas/"
  },
  {
    "text": "Here's Why Mike Johnson Is More Dangerous Than Donald Trump  —  The former president only cares about himself.  The new Speaker of the House actually wants to make America a Christian theocracy. … The most dangerous movement in American politics today is not Trumpism.  It is Christofascism.",
    "url": "https://www.thedailybeast.com/heres-why-mike-johnson-is-more-dangerous-than-donald-trump"
  },
  {
    "text": "Charlottesville's Lee statue meets its end, in a 2,250-degree furnace  —  Melted down in secret, the divisive Confederate monument will be turned into a new piece of public art … SOMEWHERE IN THE U.S. SOUTH — It was a choice to melt down Robert E. Lee.  But it would have been a choice to keep him intact, too.",
    "url": "https://www.washingtonpost.com/dc-md-va/interactive/2023/civil-war-monument-melting-robert-e-lee-confederate/"
  },
  {
    "text": "Arming Ukraine is cheap compared to the far higher price of Russian victory  —  Search Suggestions  — {{ suggestion }}  —  Total Results {{ currentCount }}/{{ totalCount }}  —  LOAD MORE  — ISSUES  — REGION  — FOCUS  —  How much longer can the West afford to continue supporting Ukraine?",
    "url": "https://www.atlanticcouncil.org/blogs/ukrainealert/arming-ukraine-is-cheap-compared-to-the-far-higher-price-of-russian-victory/"
  },
  {
    "text": "Intruder Arrested Twice Wednesday at RFK, Jr.'s Home  —  On Wednesday an intruder was arrested after climbing a fence at the residence of Robert F. Kennedy, Jr.  —  Protectors from Gavin de Becker & Associates (GDBA) detected and detained the intruder, who asked to see the candidate.",
    "url": "https://www.kennedy24.com/intruder_arrested_twice_wednesday_rfk_jr_home"
  },
  {
    "text": "Donald Trump Jr. goes after Robert F. Kennedy Jr. in Iowa appearance  —  The former president's son spoke in Iowa Thursday, with less than three months to go until the first-in-the-nation caucuses.  —  URBANDALE, Iowa — It was junior-on-junior warfare at former President Donald Trump's … ",
    "url": "https://www.nbcnews.com/politics/2024-election/donald-trump-jr-goes-robert-f-kennedy-jr-iowa-appearance-rcna122421"
  },
  {
    "text": "Larry Elder drops out of 2024 GOP primary, backs Trump  —  Republican presidential candidate Larry Elder is suspending his 2024 campaign for the White House and has endorsed former President Trump for the party nominee.  —  “As I look at the path forward, and after careful consideration … ",
    "url": "https://thehill.com/homenews/campaign/4248455-larry-elder-2024-gop-primary-donald-trump/"
  },
  {
    "text": "Judge Rejects Bryan Kohberger's Request to Dismiss Idaho Murders Case  —  The University of Idaho stabbing suspect's lawyers had argued the grand jury indictment against him should be dismissed, citing bias and prosecutorial misconduct.  —  Bryan Kohberger lost a long-shot bid to get the murder case … ",
    "url": "https://www.thedailybeast.com/judge-rejects-bryan-kohbergers-request-to-have-university-of-idaho-murders-case-thrown-out"
  }
]