[
  {
    "text": "Trump is having trouble getting cash for his bond.  And he's growing frustrated.  —  The former president is in the unprecedented position of attempting to raise cash for both his campaign and his legal battles.  —  The prospect that Donald Trump may fail to post a bond by Monday's deadline … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-trouble-getting-cash-bond-growing-frustrated-rcna144351"
  },
  {
    "text": "Trump leadership PAC racks up millions in legal bills amid courtroom fights  —  The PAC paid $5.6 million in legal bills last month.  —  Donald Trump's leadership PAC spent another $5.6 million on legal expenses in February, furthering a trend that has seen the former president put valuable campaign dollars into his courtroom fights.",
    "url": "https://www.politico.com/news/2024/03/20/trump-leadership-pac-legal-bills-00148184"
  },
  {
    "text": "Trump eyes Sen. Marco Rubio as a potential VP pick  —  The short list remains on the long side.  But the Florida senator is gaining traction, six sources tell NBC News.  —  TALLAHASSEE, Fla. — Sen. Marco Rubio, R-Fla., is moving up the list of former President Donald Trump's potential … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-eyes-sen-marco-rubio-potential-vp-pick-rcna144003"
  },
  {
    "text": "Trump has an early lead on Biden.  But problems are piling up around him.  —  Missteps and unresolved policy problems are mounting for the former president.  —  Donald Trump is walking back recent comments about cutting Social Security.  He's searching for an elusive abortion message … ",
    "url": "https://www.politico.com/news/2024/03/21/trump-biden-polling-lead-problems-00148131"
  },
  {
    "text": "Trump is broke.  That's bad news for the GOP.  —  President Biden, meanwhile, is loaded. … Presumptive GOP presidential nominee Donald Trump owes the state of New York $454 million for being a fraudulent businessman who lied about the value of his assets for years.",
    "url": "https://www.publicnotice.co/p/trump-is-broke-and-thats-bad-for-republicans"
  },
  {
    "text": "Bankruptcy is one way out of Trump's financial jam.  He doesn't want to take it.  —  People close to the presumptive 2024 Republican nominee say he is not considering bankruptcy, even though it could ease his immediate cash crunch  —  As Donald Trump faces dwindling options to pay off … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/20/trump-bond-bankruptcy/"
  },
  {
    "text": "Biden impeachment hearing descends into chaos as lawmaker caught on hot mic branding it ‘Jurassic Park’  —  'You can't make this stuff up,' someone can be heard saying  —  A hot mic captured a lawmaker labelling the heated House Oversight Committee's impeachment inquiry hearing … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/biden-impeachment-hearing-jurassic-park-b2515858.html"
  },
  {
    "text": "Impeachment inquiry appears on ice as House GOP tries to wrangle support  —  ‘Ultimately the American people will be voting ... to decide whether or not this president is suitable for office,’ one Republican said  —  Lacking support and evidence, the GOP-led impeachment inquiry … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/20/biden-impeachment-inquiry-hearing/"
  },
  {
    "text": "House Republican budget calls for raising the retirement age for Social Security  —  A budget by the Republican Study Committee, a group of more than 170 GOP lawmakers, highlights how many in the party would seek to govern if Republicans win in November.  —  WASHINGTON — A new budget … ",
    "url": "https://www.nbcnews.com/politics/congress/republican-budget-raise-age-retirement-social-security-medicare-rcna144341"
  },
  {
    "text": "Mississippi ex-deputy gets 40-year sentence as judge decries brutal attack on 2 Black men  —  Two former Mississippi deputies wept in court Wednesday as a federal judge sentenced them to years in prison and condemned their cruelty for breaking into a home with four other white officers and torturing two Black men.",
    "url": "https://apnews.com/article/mississippi-goon-squad-sentencing-94d9dcfa00e582b9d50a6eb7288b058b"
  },
  {
    "text": "Nikki Haley's campaign had cash left over as her primary run ended  —  The former U.N. ambassador reported more than $11 million on hand at the end of February.  —  Nikki Haley's presidential campaign had $11.5 million in the bank at the end of February, just days before the former U.N. ambassador dropped … ",
    "url": "https://www.politico.com/news/2024/03/20/nikki-haleys-campaign-had-cash-left-over-as-her-primary-run-ended-00148206"
  },
  {
    "text": "Biden's stutter surges into the presidential campaign  —  Trump mocks and exaggerates the speech impediment.  Biden embraces it as reflecting compassion.  —  President Biden recently sent out a video of a meeting with a 9-year-old with a stutter, telling the young boy, “Don't let anybody tell you that you can't do anything.”",
    "url": "https://www.washingtonpost.com/politics/2024/03/21/biden-stutter-trump-mock-compassion/"
  },
  {
    "text": "Republicans Are Counting on Millionaires to Flip the Senate  —  With Democrats at a fund-raising advantage, the G.O.P. has backed candidates who can self-fund.  But their wealth is likely to factor in the fight for Senate control.  —  Since his rise to the presidency … ",
    "url": "https://www.nytimes.com/2024/03/21/us/politics/republican-gop-senate-wealth.html"
  },
  {
    "text": "Secretary Antony J. Blinken With Christiane Baissary of Al Hadath  —  RITZ-CARLTON HOTEL JEDDAH, SAUDI ARABIA  —  QUESTION:  Mr. Secretary, thank you for joining us.  —  SECRETARY BLINKEN:  Thank you for having me.  —  QUESTION:  This is your sixth tour in the region since the war started in October.",
    "url": "https://www.state.gov/secretary-antony-j-blinken-with-christiane-baissary-of-al-hadath/"
  },
  {
    "text": "Statement from President Joe Biden on Nearly $6 Billion in Student Debt Cancellation for 78,000 Public Service Workers  —  Today, my Administration is cancelling student loans for an additional 78,000 public service workers - teachers, nurses, firefighters, and more - through Public Service Loan Forgiveness.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/03/21/statement-from-president-joe-biden-on-nearly-6-billion-in-student-debt-cancellation-for-78000-public-service-workers/"
  },
  {
    "text": "Mass Shooter Father's Chilling Prison Calls to Prosecutor Revealed  —  An investigation is now underway after threatening calls from prison by James Crumbley were revealed by the prosecutor handling his case.  —  The alleged jailhouse threats the father of the Oxford High School mass shooter … ",
    "url": "https://www.thedailybeast.com/mass-shooter-father-james-crumbleys-chilling-prison-calls-to-prosecutor-revealed"
  },
  {
    "text": "‘Very, very troubling’: Judges, lawyers flummoxed by Judge Cannon  —  The jurist overseeing Donald Trump's classified documents case in Florida has raised eyebrows and alarms with her latest order  —  Lawyers and former judges said they are baffled by an order issued this week … ",
    "url": "https://www.washingtonpost.com/national-security/2024/03/20/trump-cannon-judge-pra-jury-instructions/"
  },
  {
    "text": "Biden's EV Mandate Blows Its Cover  —  The EPA's new tailpipe emissions rule is a plan to eliminate gas-powered cars.  —  Biden officials are stressing that the new auto greenhouse gas emissions standards they rolled out on Wednesday aren't an electric-vehicle mandate.",
    "url": "https://www.wsj.com/articles/joe-biden-electric-vehicle-mandate-gas-powered-cars-2032-epa-c2a72414"
  },
  {
    "text": "Georgia's Medicaid system is a disaster.  Other states want to copy it.  —  In 2018, the Trump administration issued a rule allowing states to tie Medicaid eligibility to employment, a first in the program's 50-year history.  The policy shift was the result of decades of work by Republicans who believe … ",
    "url": "https://popular.info/p/georgias-medicaid-system-is-a-disaster"
  }
]