[
  {
    "text": "Top House Republican Wants Help From Democrats to Pick a Speaker  — House Armed Services Chair Says GOP unable to elect speaker  — Calls on Democratic leader to offer conditions to aid GOP  —  A powerful Republican is looking to Democrats to help resolve his party's impasse over naming a speaker of the House.",
    "url": "https://www.bloomberg.com/news/articles/2023-10-12/democrats-to-the-rescue-some-republicans-see-it-as-solution-to-speaker-impasse"
  },
  {
    "text": "Live updates House speakership stalled as Scalise withdraws from race  —  Rep. Steve Scalise (R-La.) announced at a Republican conference meeting Thursday night that he is pulling out of the race to become speaker.  The announcement came after a day full of lengthy meetings with fellow Republicans … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/12/house-speaker-vote/"
  },
  {
    "text": "Steve Scalise drops out of Speaker's race  —  House Majority Leader Steve Scalise (R-La.) on Thursday dropped out of the race for Speaker, just one day after he won the Republican nomination for the role.  —  Scalise narrowly prevailed in a secret ballot internal GOP election on Wednesday … ",
    "url": "https://thehill.com/homenews/house/4253448-steve-scalise-drops-out-speakers-race/"
  },
  {
    "text": "Moderate House Republicans Plot To Empower McHenry Amid Stalled Speaker Search  —  The Republican Governance Group has gathered signatures on a petition to give temporary Speaker Patrick McHenry, R-N.C., more authority … As House Republicans remain divided over their next leader … ",
    "url": "https://themessenger.com/politics/moderate-house-republicans-plot-to-empower-mchenry-amid-stalled-speaker-search"
  },
  {
    "text": "With the World in Crisis, House Republicans Bicker Among Themselves  —  Despite conflicts overseas and an approaching deadline to avert a government shutdown, Republicans are unable to rise above their internal divisions.  —  Two key U.S. allies are engulfed in vicious wars.",
    "url": "https://www.nytimes.com/2023/10/12/us/politics/house-republicans-bicker-world-crisis.html"
  },
  {
    "text": "Chaos persists as ‘fractured’ House GOP frets about when — or if — it will elect a speaker  —  Some Republicans worry they might never get the votes without some Democratic help.  Others say it's time to empower Speaker Pro Tempore Patrick McHenry to conduct business.",
    "url": "https://www.nbcnews.com/politics/congress/chaos-house-republicans-speaker-rcna119967"
  },
  {
    "text": "Steve Scalise drops out of speaker's race as House GOP faces leadership crisis  —  Rep. Steve Scalise announced he was dropping out of the speaker's race Thursday after House Republicans failed to coalesce behind him in the aftermath of Kevin McCarthy's historic ouster.",
    "url": "https://www.cnn.com/2023/10/12/politics/steve-scalise-speaker-fight/"
  },
  {
    "text": "Why is Trump Trashing Netanyahu?  —  On Wednesday, Donald Trump held a rally in West Palm Beach, Florida.  Considering Palm Beach County has one of the highest concentrations of Jewish people in America, the typical person at a Trump rally is quite conservative, and Israel is now responding … ",
    "url": "https://washingtonmonthly.com/2023/10/12/why-is-trump-trashing-netanyahu/"
  },
  {
    "text": "Biden aides slam Trump for calling Hezbollah ‘very smart’  —  Aides to President Biden and his campaign blasted former President Trump on Thursday for remarks a night earlier in which Trump described Hezbollah as “very smart” amid unfolding violence in Israel.",
    "url": "https://thehill.com/homenews/campaign/4251829-biden-aides-slam-trump-for-calling-hezbollah-very-smart/"
  },
  {
    "text": "Israeli official says government cannot confirm babies were beheaded in Hamas attack  —  The Israeli government has not confirmed the specific claim that Hamas attackers cut off the heads of babies during their shock attack on Saturday, an Israeli official told CNN, contradicting … ",
    "url": "https://www.cnn.com/2023/10/12/middleeast/israel-hamas-beheading-claims-intl"
  },
  {
    "text": "Poll: Majority blames gov't for Hamas massacre, says Netanyahu must resign  —  An overwhelming majority of 86% of respondents, including 79% of coalition supporters, said the surprise attack from Gaza is a failure of the country's leadership.  —  Four out of five Jewish Israelis believe … ",
    "url": "https://www.jpost.com/israel-news/article-767880"
  },
  {
    "text": "A new indictment charges Sen. Menendez with being an unregistered agent of the Egyptian government  —  Federal prosecutors have rewritten their indictment against U.S. Sen. Bob Menendez of New Jersey and his wife to charge them with conspiring to have him act as an agent of Egypt and Egyptian officials.",
    "url": "https://apnews.com/article/bob-menendez-indictment-c1850764b8ce7c613fc50f0e4f495e87"
  },
  {
    "text": "Six Months Ago NPR Left Twitter.  The Effects Have Been Negligible  —  A lot of people threaten to leave Twitter.  Not many of them have actually done it.  —  This was true even before Elon Musk's purchase of the platform a year ago.  But the parade of calamities since … ",
    "url": "https://niemanreports.org/articles/npr-twitter-musk/"
  },
  {
    "text": "What It Would Mean to Treat Hamas Like ISIS  —  The instant I understood the scale of Hamas's attack on Israel, I understood the probable response.  As I read reports of Hamas terrorists murdering entire families, raping Israeli women beside the bodies of their dead friends and dragging Israeli hostages … ",
    "url": "https://www.nytimes.com/2023/10/12/opinion/israel-hamas-isis-gaza.html"
  },
  {
    "text": "Wisconsin Republicans Retreat From Threats to Impeach Liberal Justice  —  Republicans had floated the idea of impeaching Janet Protasiewicz, newly seated on the Wisconsin Supreme Court, before she could undo the party's legislative gerrymander.  But on Thursday, they backed off.",
    "url": "https://www.nytimes.com/2023/10/12/us/politics/wisconsin-republicans-impeach-janet-protasiewicz.html"
  },
  {
    "text": "Van Orden defends outburst at Biden officials over Israel, denies cursing  —  Rep. Derrick Van Orden (R-Wis.) on Thursday defended his questioning of Biden administration officials at a briefing this week on Israel after other lawmakers criticized him for what they called rude and obnoxious behavior.",
    "url": "https://thehill.com/homenews/house/4253013-van-orden-defends-outburst-at-biden-officials-over-israel-denies-cursing/"
  },
  {
    "text": "Trump Doral event with Eric Trump will feature a Hitler-promoting antisemite who killed someone  —  This is at least the fourth Hitler-promoting antisemite who's toured with Eric Trump  —  Trump National Doral Miami is scheduled to host a ReAwaken America tour event featuring Eric Trump … ",
    "url": "https://www.mediamatters.org/eric-trump/trump-doral-event-eric-trump-will-feature-ian-smith-hitler-promoting-antisemite-who"
  },
  {
    "text": "France bans pro-Palestinian protests, citing risk of ‘disturbances to public order’  —  French police used teargas and water cannon to break up a banned rally in support of the Palestinian people in Paris on Thursday after the interior minister said such gatherings were “likely to generate disturbances to public order”.",
    "url": "https://www.reuters.com/world/europe/france-bans-pro-palestinian-protests-citing-risk-disturbances-public-order-2023-10-12/"
  },
  {
    "text": "One officer who arrested Elijah McClain convicted of criminally negligent homicide; second officer acquitted  —  One of the Aurora, Colorado, police officers, Randy Roedema, who arrested Elijah McClain, an unarmed 23-year-old Black man who died after he was subdued by police and injected … ",
    "url": "https://www.cnn.com/2023/10/12/us/elijah-mcclain-police-trial-thursday/"
  },
  {
    "text": "IRS Contractor Pleads Guilty to Disclosing Tax Return Information to News Organizations  —  For Immediate Release  —  An IRS contractor, Charles Littlejohn, 38, of Washington, D.C., pleaded guilty today to disclosing tax return information without authorization.",
    "url": "https://www.justice.gov/opa/pr/irs-contractor-pleads-guilty-disclosing-tax-return-information-news-organizations"
  },
  {
    "text": "U.S., Qatar agree to stop Iran from tapping $6 billion fund after Hamas attack  —  U.S. officials and the Qatari government have agreed to stop Iran from accessing a $6 billion account for humanitarian assistance in light of Hamas's attack on Israel, Deputy Treasury Secretary Wally Adeyemo told House Democrats … ",
    "url": "https://www.washingtonpost.com/business/2023/10/12/iran-oil-fund-us-israel/"
  },
  {
    "text": "NYPD investigating several violent incidents possibly motivated by the war in Israel  —  The violence in New York comes as the NYPD prepares for the possibility of unrest on Friday due to a “Day of Action” in Palestine.  Reporter Lindsay Tuchman has more.  —  BROOKYLN, New York (WABC) … ",
    "url": "https://abc7ny.com/israel-hamas-war-nyc-unrest-hate-crime-palestinian-rally/13900258/"
  }
]