[
  {
    "text": "Hill leaders question Trump's attempted Library of Congress takeover  —  Top congressional leaders are pushing back against President Donald Trump's attempt to replace to Library of Congress leaders, with the dispute over presidential powers over the institution leaving its future in question Monday.",
    "url": "https://www.politico.com/live-updates/2025/05/12/congress/donald-trump-library-of-congress-fight-00342326"
  },
  {
    "text": "Trump naming his former defense attorney as acting Librarian of Congress  —  President Trump will name deputy attorney general Todd Blanche to be the acting Librarian of Congress, a Justice Department official confirmed to Axios.  —  Why it matters: Blanche, who represented Trump in his hush money trial … ",
    "url": "https://www.axios.com/2025/05/12/trump-former-attorney-acting-librarian-congress-blanche"
  },
  {
    "text": "Todd Blanche, DOJ No. 2, is now acting Library of Congress chief  —  The Justice Department's No. 2 official now has a second job: running the Library of Congress.  President Donald Trump has appointed Deputy Attorney General Todd Blanche as the acting librarian, a DOJ official said Monday.",
    "url": "https://www.politico.com/live-updates/2025/05/12/congress/doj-no-2-is-now-locs-no-1-00341700"
  },
  {
    "text": "Despite China trade deal, Trump maintains 120% tariff on cheap goods  —  Small packages from China are still subject to tariffs of 120%, a White House official confirmed Monday — a major blow for U.S. consumers seeking cheap goods from e-commerce retailers like Shein and Temu.",
    "url": "https://www.axios.com/2025/05/12/china-trade-deal-shein-temu-trump"
  },
  {
    "text": "Trump Administration Live Updates: President Asks Companies to Lower Drug Prices  —  Where Things Stand  — Drug prices: President Trump signed an executive order that asks pharmaceutical companies to voluntarily lower drug prices.  But it was not clear what legal authority Mr. Trump would invoke … ",
    "url": "https://www.nytimes.com/live/2025/05/12/us/trump-news"
  },
  {
    "text": "U.S. and China Agree to Temporarily Slash Tariffs in Bid to Defuse Trade War  —  The 145 percent U.S. tariff on Chinese goods will come down to 30 percent for 90 days, while the two sides continue talks aimed at resolving their differences.  —  The United States and China said Monday … ",
    "url": "https://www.nytimes.com/2025/05/12/business/china-us-tariffs.html"
  },
  {
    "text": "Markets Celebrate Total Trump Surrender on Signature Policy  —  WHITE FLAG  —  The U.S. agreed to temporarily lower tariffs on Chinese products while the two sides negotiate.  —  Investors welcomed the news on Monday that President Donald Trump was backing away from at least … ",
    "url": "https://www.thedailybeast.com/stocks-soar-as-trump-blows-up-his-trademark-tariff-policy-with-china/"
  },
  {
    "text": "Episcopal Church refuses to resettle white Afrikaners, ends partnership with US government  —  (RNS) — In a striking move that ends a nearly four-decades-old relationship between the federal government and the Episcopal Church, the denomination announced on Monday (May 12) … ",
    "url": "https://religionnews.com/2025/05/12/episcopal-church-ends-refugee-resettlement-citing-moral-opposition-to-resettling-white-afrikaners/"
  },
  {
    "text": "Letter from Presiding Bishop Sean Rowe on Episcopal Migration Ministries  —  Office of Public Affairs  —  English  —  Dear People of God in The Episcopal Church:  —  I am writing today with some significant news about Episcopal Migration Ministries, the organization that leads The Episcopal Church's refugee resettlement ministry.",
    "url": "https://www.episcopalchurch.org/publicaffairs/letter-from-presiding-bishop-sean-rowe-on-episcopal-migration-ministries/"
  },
  {
    "text": "Trump's free plane is not so free  —  The Boeing aircraft that Qatar may give the president would require a pricy and complicated overhaul to serve as Air Force One.  —  President Donald Trump insists he's getting a “free, very expensive airplane” from Qatar's royal family.",
    "url": "https://www.politico.com/news/2025/05/12/trump-qatar-air-force-one-taxpayer-costs-00342299"
  },
  {
    "text": "Corruption and a Security Catastrophe in Plane Sight  —  Of course a foreign government would love to give the US president a plane....  I will admit that as a presidential historian and national security nerd one of my first thoughts last November after Donald Trump won office was, “Ugh” … ",
    "url": "https://www.doomsdayscenario.co/p/corruption-and-a-security-catastrophe-in-plane-sight-c5cd67a113caf678"
  },
  {
    "text": "House Republicans unveil Medicaid cuts that Democrats warn will leave millions without care  —  House Republicans unveiled the cost-saving centerpiece of President Donald Trump's “ big, beautiful bill ” late Sunday, at least $880 billion in cuts largely to Medicaid to help cover the cost of $4.5 trillion in tax breaks.",
    "url": "https://apnews.com/article/medicaid-cuts-trump-tax-cuts-bill-1e2b12a91a3d12ceb0420ce7053de58e"
  },
  {
    "text": "Why Trump Suddenly Declared Victory Over the Houthi Militia … President Trump has never bought into long-running military entanglements in the Middle East.Haiyun Jiang for The New York Times  —  When he approved a campaign to reopen shipping in the Red Sea by bombing the Houthi militant group … ",
    "url": "https://www.nytimes.com/2025/05/12/us/politics/trump-houthis-bombing.html"
  },
  {
    "text": "Delivering Most-Favored-Nation Prescription Drug Pricing to American Patients  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  The United States has less than five percent … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/05/delivering-most-favored-nation-prescription-drug-pricing-to-american-patients/"
  },
  {
    "text": "Auction to Dine With Trump Creates Foreign Influence Opportunity … The sale of face-to-face access to President Trump using the Trump family's own cryptocurrency has done more than benefit him financially, though it has certainly done that.  —  Mr. Trump announced last month that leading buyers … ",
    "url": "https://www.nytimes.com/2025/05/12/us/politics/auction-to-dine-with-trump-creates-foreign-influence-opportunity.html?unlocked_article_code=1.Gk8.yzzI.Y7iQnH7Ph6sL"
  },
  {
    "text": "Rock Creek Isn't Safe to Swim In.  RFK Jr. Did It Anyway.  —  Health Secretary Robert F. Kennedy Jr. went for a swim in Rock Creek yesterday.  —  Health officials typically advise against swimming in that DC waterway, because sewage from the city's aging system flows into it.",
    "url": "https://www.washingtonian.com/2025/05/12/rock-creek-isnt-safe-to-swim-in-rfk-jr-did-it-anyway/"
  },
  {
    "text": "DHS terminates temporary protected status program for Afghans  —  The move follows the Trump administration's decision last month to not renew such protections for Afghans residing in the U.S.  —  Secretary of Homeland Security Kristi Noem announced on Monday that the U.S. will terminate … ",
    "url": "https://www.politico.com/news/2025/05/12/temporary-protected-status-afghans-00342250"
  },
  {
    "text": "Newsom Asks Cities to Ban Homeless Encampments, Escalating Crackdown  —  “There are no more excuses,” the California governor said in pushing for municipalities to address one of the most visible byproducts of homelessness.  —  Gov. Gavin Newsom escalated California's push … ",
    "url": "https://www.nytimes.com/2025/05/12/us/newsom-california-homeless-encampments.html"
  },
  {
    "text": "Republicans Try to Cram Ban on AI Regulation Into Budget Reconciliation Bill  —  Republicans try to use the Budget Reconciliation bill to stop states from regulating AI entirely for 10 years.  —  Late last night, House Republicans introduced new language to the Budget Reconciliation bill … ",
    "url": "https://www.404media.co/republicans-try-to-cram-ban-on-ai-regulation-into-budget-reconciliation-bill/"
  },
  {
    "text": "Rule of law is ‘endangered,’ chief justice says  —  Speaking at Georgetown Law, Chief Justice John Roberts denounced “ad hominem” criticism of the justices.  —  Chief Justice John Roberts described the rule of law as “endangered” and warned against “trashing the justices,” … ",
    "url": "https://www.politico.com/news/2025/05/12/chief-justice-roberts-speech-georgetown-00343406"
  },
  {
    "text": "Hasan Piker detained at the border and questioned for hours over politics  —  “They straight up tried to get something out of me that I think they could use to basically detain me permanently” … Hasan Piker, the biggest progressive political streamer in America, was detained by Customs … ",
    "url": "https://www.usermag.co/p/hasan-piker-detained-at-the-border-and-questioned-for-hours-over-politics-trump-immigration"
  }
]