[
  {
    "text": "Google Explains Why Search for ‘Where Can I Vote for Harris’ Showed a Map While Similar Trump Search Didn't … Earlier Tuesday, searches on Google for “Where can I vote for Harris?” displayed a “Where to vote” map that lets uses enter their street address to find their polling location.",
    "url": "https://variety.com/2024/digital/news/google-search-where-can-i-vote-for-harris-trump-map-1236201473/"
  },
  {
    "text": "Election Live Updates: A Caustic and Turbulent Race Is in Voters' Hands  — Polls in parts of Indiana and Kentucky have closed, and voting ends in six more states including Georgia, a key battleground, at 7 p.m. Eastern time.  Turnout looked strong in an election that Vice President Kamala Harris … ",
    "url": "https://www.nytimes.com/live/2024/11/05/us/trump-harris-election"
  },
  {
    "text": "NBC News Exit Poll: Voters express deep concern about America's democracy and economy  —  Women are twice as likely as men to rank abortion as their top issue, according to preliminary results from the national survey.  —  The state of democracy and the economy in the United States … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nbc-news-exit-poll-voters-express-concern-democracy-economy-rcna178602"
  },
  {
    "text": "How Trump Accidentally Let His Biggest Advantage Over Harris Slip Away  —  If you've spent time on social media lately, you've surely encountered the argument that Kamala Harris and Democrats have squandered way too much time and resources on attacking Donald Trump as a sexual predator, dangerous madman, and wannabe fascist dictator.",
    "url": "https://newrepublic.com/article/187950/trump-2024-election-advantage-harris-slip-away"
  },
  {
    "text": "AP VoteCast: Economy ranked as a top issue, but concerns over democracy drove many voters to polls  —  Voters said the economy and immigration are the top issues facing the country, but the future of democracy was also a leading motivator for many Americans casting a ballot in Tuesday's presidential election.",
    "url": "https://apnews.com/article/ap-votecast-elections-harris-trump-voters-d5cf4e3611f50ec4349d93ddc7f037cd"
  },
  {
    "text": "Florida's abortion amendment fails, leaving 6-week ban in place  —  Florida's abortion-rights ballot initiative fell short of passing on Tuesday, leaving in place a six-week abortion ban that has helped restrict access across almost all of the Southern U.S.  —  The measure's defeat … ",
    "url": "https://thehill.com/policy/healthcare/4969765-florida-abortion-rights-ballot/"
  },
  {
    "text": "Trump snaps at reporter when asked about abortion: ‘Stop talking about that’  —  Donald Trump is refusing to say how he voted on Florida's abortion measure — and getting testy about it.  The former president was asked twice after casting his ballot in Palm Beach, Florida … ",
    "url": "https://apnews.com/article/trump-abortion-ballot-question-florida-reporter-9bfb26f6866f4c389437374688531a77"
  },
  {
    "text": "Musk to Spend Election Night With Trump  —  Elon Musk has spent $119 million on a super PAC supporting Donald Trump and held events on his behalf.  But his ownership of X is especially valuable.  —  Elon Musk plans to spend election night with former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/11/05/us/politics/elon-musk-trump-election-night.html"
  },
  {
    "text": "Election 2024 live updates: Latest news and results as Americans head to the polls to vote for Trump or Harris  —  Control of the House, Senate and many key states is also up for grabs, in addition to a number of crucial ballot measures. … Arab American voters in Michigan opt for third-party candidate Jill Stein",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/presidential-election-2024-live-updates-rcna175556#rcrd62376"
  },
  {
    "text": "Trump votes, and then utters 15 falsehoods in 15 minutes  —  The former president couldn't resist repeating his greatest hits on crime, immigration, elections and Oprah's last show.  —  Former president Donald Trump cast his ballot in West Palm Beach, Florida, on Tuesday and then spoke to reporters.",
    "url": "https://www.washingtonpost.com/politics/2024/11/05/trump-votes-then-utters-15-falsehoods-15-minutes/"
  },
  {
    "text": "Republican Jim Justice flips US Senate seat from West Virginia after Manchin retirement  —  Jim Justice won a U.S. Senate race from West Virginia on Tuesday, flipping a seat to the Republican Party after Joe Manchin decided not to seek reelection.  Justice, who boldly predicted victory long … ",
    "url": "https://apnews.com/article/west-virginia-senate-justice-elliott-7376ed0ceb9bebd0766190fb14cc0e69"
  },
  {
    "text": "Non-credible bomb threats against Atlanta-area polling places were from Russia, secretary of state says  —  Several non-credible bomb threats that briefly disrupted voting at two Georgia polling places originated from Russia, Georgia Secretary of State Brad Raffensperger told reporters Tuesday.",
    "url": "https://www.cnn.com/2024/11/05/us/georgia-non-credible-bomb-threat-russia/"
  },
  {
    "text": "Israel's Netanyahu dismisses his defense minister as wars rage.  Protests erupt across country  —  Israeli Prime Minister Benjamin Netanyahu on Tuesday dismissed his popular defense minister, Yoav Gallant, in a surprise announcement that came as the country is embroiled in wars on multiple fronts across the region.",
    "url": "https://apnews.com/article/israel-netanyahu-gallant-gaza-war-lebanon-3810d3adb1603e8485b4be46a5b79f8b"
  },
  {
    "text": "Trump campaign denies and revokes journalists' election night credentials after critical coverage  —  New York CNN  —  Journalists from multiple news organizations have been denied credentials to former President Donald Trump's election night watch event in West Palm Beach, Florida … ",
    "url": "https://www.cnn.com/2024/11/05/media/trump-revokes-journalists-election-night-credentials/"
  },
  {
    "text": "Supreme Court: Cobb County absentee ballots must be returned by Election Day  —  The court sided with the Republican National Committee, removing the relief that a lower court ordered.  —  The Georgia Supreme Court on Monday ordered that Cobb County may only count absentee ballots received by 7 p.m. on Election Day.",
    "url": "https://www.ajc.com/politics/cobb-county-absentee-ballots-must-be-returned-by-election-day-georgia-supreme-court-rules/7DHUDZ4IARGOLDHYPR53AI7PYU/"
  },
  {
    "text": "Live Presidential Forecast  —  Our election model estimates the outcome of the race in real time based on polling data, the votes reported so far and what we expect from remaining votes.  Read how it works ›  —  Chance of winning  —  No estimates yet",
    "url": "https://www.nytimes.com/interactive/2024/11/05/us/elections/results-president-forecast-needle.html"
  },
  {
    "text": "X Is a White-Supremacist Site … X has always had a nazi problem.  I've covered the site, formerly known as Twitter, for more than a decade and reported extensively on its harassment problems, its verification (and then de-verification) of a white nationalist, and the glut of anti-Semitic hatred that roiled the platform in 2016.",
    "url": "https://www.theatlantic.com/technology/archive/2024/11/x-white-supremacist-site/680538/?gift=bQgJMMVzeo8RHHcE1_KM0T8uB7iimO1-elCapdzG8XE&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "How are things looking in Pennsylvania?  Dems are feeling cautiously optimistic  —  How are Democrats feeling in Pennsylvania, the most pivotal battleground in the country?  Cautiously optimistic.  I surveyed 10 Dem elected officials and strategists across the state and, to a person … ",
    "url": "https://www.politico.com/live-updates/2024/11/05/2024-election-results-live-coverage-updates-analysis/pennsylvania-vibe-check-early-00187540"
  },
  {
    "text": "Greene easily wins reelection in Georgia  —  GOP Rep. Marjorie Taylor Greene (Ga.) easily won reelection Tuesday, fending off a challenge from Democrat Shawn Harris, a retired Army general, in Georgia's deep-red 14th District, Decision Desk HQ projects.  —  The outcome was never in question … ",
    "url": "https://thehill.com/homenews/campaign/4972962-marjorie-taylor-greene-georgia/"
  },
  {
    "text": "Michigan on pace to break voter turnout records, official says  —  Michigan Secretary of State Jocelyn Benson (D) said Tuesday that the Great Lake State, a critical battleground in the presidential race, is on track to break voter turnout records.  —  “Michiganders are already voting in record numbers.",
    "url": "https://thehill.com/homenews/campaign/4973132-michigan-on-pace-to-break-voter-turnout-records-official-says/"
  },
  {
    "text": "Capitol Police arrest man who ‘smelled like fuel’ and had torch and flare gun  —  The U.S. Capitol Visitors Center was closed Tuesday afternoon, after Capitol Police arrested a man during their security screening process who was carrying a torch and flare gun.",
    "url": "https://thehill.com/regulation/court-battles/4973099-capitol-police-arrest-man-fuel-torch-flare-gun/"
  },
  {
    "text": "Trump-loving evangelical leader busted with hard drive full of appalling images  —  The former head of a Christian conservative voter outreach has been arrested for possession of child sexual abuse materials.  —  Jason C. Yates, former CEO of My Faith Votes, has been charged in Minnesota … ",
    "url": "https://www.rawstory.com/jason-yates-my-faith-votes/"
  },
  {
    "text": "Elon Musk is sued over $1 million election giveaway  —  Elon Musk was sued in a proposed class action on Tuesday by registered voters who signed his petition to support the Constitution for a chance to win his $1 million-a-day giveaway, and now claim it was a fraud.",
    "url": "https://www.reuters.com/legal/elon-musk-is-sued-over-1-million-election-giveaway-2024-11-05/"
  },
  {
    "text": "Ukrainian troops have engaged with North Korean units for the 1st time in Russia, an official says  —  Ukrainian troops have for the first time engaged with North Korean units that were recently deployed to help Russia in the war with its neighbor, Ukraine's defense minister said Tuesday.",
    "url": "https://apnews.com/article/russia-ukraine-war-north-korea-troops-c8cf9599591e50caf1c48a98b6841fe4"
  }
]