[
  {
    "text": "Harris on Ellipse: Time to turn the page on Trump  —  Vice President Harris delivered a speech Tuesday on the White House Ellipse in Washington, D.C. — the very site at which former President Trump gave remarks to a crowd that later incited a riot at the Capitol.",
    "url": "https://thehill.com/homenews/4960670-harris-ellipse-turn-page-trump/"
  },
  {
    "text": "Biden sets off election firestorm with “garbage” comment … - The comment came in a video call with the progressive group Voto Latino when Biden wanted to respond to a comedian calling Puerto Rico an “island of garbage” at Trump's Madison Square Garden rally on Sunday.",
    "url": "https://www.axios.com/2024/10/30/biden-garbage-trump-supporters-puerto-rico"
  },
  {
    "text": "'The suburbs — that's the whole deal': How the suburbs became Harris' clearest path to victory  —  Dems are betting they can improve on Joe Biden's numbers in the suburbs.  —  KNIGHTDALE, North Carolina — Kamala Harris is counting on suburban voters to do what they've done since Donald Trump won the presidency in 2016: reject him.",
    "url": "https://www.politico.com/news/2024/10/29/harris-suburbs-votes-00186166"
  },
  {
    "text": "‘I was the director of the Michigan Republican Party.  I will vote for Kamala Harris.’  —  I was the executive director of the Michigan Republican Party, back during a time when the GOP embraced values like fiscal discipline and a strong foreign policy.  —  I voted for Nikki Haley … ",
    "url": "https://www.lansingcitypulse.com/stories/i-was-the-director-of-the-michigan-republican-party-i-will-vote-for-kamala-harris,115386"
  },
  {
    "text": "Kamala Harris Draws Massive Crowd at Ellipse, Notches Larger Audience Than Trump's Jan. 6 Rally in Same Spot, Campaign Says  —  Vice President Kamala Harris delivered remarks in Washington, D.C. on Tuesday night in front of a massive crowd where she made her closing argument to voters at The Ellipse ahead of next week's election.",
    "url": "https://www.mediaite.com/politics/kamala-harris-draws-massive-crowd-at-ellipse-notches-larger-audience-than-trumps-jan-6-rally-in-same-spot-campaign-says/"
  },
  {
    "text": "Biden calls Trump supporters ‘garbage’ during Harris campaign event as VP promises unity at Ellipse rally  —  President Biden went viral Tuesday night for comments disparaging Trump supporters as his No. 2, Vice President Kamala Harris, made a major speech to voters calling for unity from the Ellipse right outside the White House.",
    "url": "https://www.foxnews.com/media/biden-calls-trump-supporters-garbage-during-harris-campaign-call-vp-calls-unity-ellipse-rally"
  },
  {
    "text": "Man who attacked Nancy Pelosi's husband gets life in prison  —  SAN FRANCISCO — The man who was sentenced to 30 years in federal prison for attacking the husband of former House Speaker Nancy Pelosi with a hammer in their California home was sentenced Tuesday to life in prison without … ",
    "url": "https://www.npr.org/2024/10/29/nx-s1-5171029/man-who-attacked-nancy-pelosis-husband-gets-life-in-prison"
  },
  {
    "text": "Former GOP congressional candidate arrested on allegations of Madison County ballot theft  —  Larry Lee Savage Jr., a former Republican 5th Congressional District candidate, turned himself in to authorities Tuesday morning after he was charged with stealing ballots during a public test of voting machines in Madison County.",
    "url": "https://www.indystar.com/story/news/crime/2024/10/29/former-5th-district-candidate-arrested-on-allegations-of-ballot-theft-larry-savage-jr-madison-county/75918036007/"
  },
  {
    "text": "Speaker Mike Johnson criticizes Obamacare and promises ‘massive reform’ if Trump wins  —  The Republican speaker said at an event in Pennsylvania that overhauling health care will be a major focus and that “Trump's going to go big” if he takes the presidency.",
    "url": "https://www.nbcnews.com/politics/congress/speaker-johnson-criticizes-obamacare-promises-massive-reform-trump-win-rcna177853"
  },
  {
    "text": "Haley warns Republicans about messaging on women, Latinos after ‘harmful’ rally moment  —  Former GOP presidential candidate Nikki Haley warned Republicans about the messaging on women and Latinos during the final stretch of the 2024 presidential election after a “harmful” rally moment that occurred over the weekend in New York City.",
    "url": "https://thehill.com/homenews/campaign/4960554-haley-warns-republicans-latino-women-messaging/"
  },
  {
    "text": "Supreme Court rules RFK Jr. will appear on battleground ballots despite suspending campaign  —  The Supreme Court declined Tuesday to let Robert F. Kennedy Jr. withdraw his name from ballots in Michigan and Wisconsin, battleground states where votes for his now suspended campaign could cut into support for former President Donald Trump.",
    "url": "https://www.cnn.com/2024/10/29/politics/rfk-jr-supreme-court-wisconsin-michigan"
  },
  {
    "text": "Elon Musk-Funded PAC Supercharges ‘Progress 2028’ Democrat Impersonation Ad Campaign … An Elon Musk-funded super PAC has expanded an advertising campaign in which it is impersonating Democrats and targeting registered Republicans with policies unpopular with conservatives they say Kamala Harris will pass if she wins the election.",
    "url": "https://www.404media.co/elon-musk-funded-pac-supercharges-progress-2028-democrat-impersonation-ad-campaign/"
  },
  {
    "text": "On Elon Musk's X, Republicans go viral as Democrats disappear  —  A Washington Post analysis found that Republicans are posting more, getting followed more and going viral more now that the world's richest Trump supporter is running the show.  —  The top political accounts on X have seen … ",
    "url": "https://www.washingtonpost.com/technology/2024/10/29/elon-musk-x-republican-democrat-twitter-election/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMwMTc0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMxNTYwMzk5LCJpYXQiOjE3MzAxNzQ0MDAsImp0aSI6ImRjZjEzNDYxLTBlNjEtNGNhYy1hODE2LTMxNmIyZmRiNDcyMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMTAvMjkvZWxvbi1tdXNrLXgtcmVwdWJsaWNhbi1kZW1vY3JhdC10d2l0dGVyLWVsZWN0aW9uLyJ9._swxWtRAVNu7JUVWoRNfQo9uNEN8IbkWnVcw-C_22eg&itid=gfta"
  },
  {
    "text": "Teri Garr, the offbeat comic actor of ‘Young Frankenstein’ and ‘Tootsie,’ has died  —  Teri Garr, the quirky comedy actor who rose from background dancer in Elvis Presley movies to co-star of such favorites as “Young Frankenstein” and “Tootsie,” has died.  She was 79.",
    "url": "https://apnews.com/article/teri-garr-dies-be39482a60724c5bb81bbd8f34dfaf2d"
  },
  {
    "text": "GOP Political Consultant Once Wrote for Richard Spencer  —  Ryan Girdusky used his own name on Spencer's Alternative Right website  —  Last night, CNN had Ryan Girdusky, a pro-Trump political consultant, on a panel discussing Trump's Sunday rally at Madison Square Garden.",
    "url": "https://www.turtlediaries.net/p/gop-political-consultant-once-wrote"
  },
  {
    "text": "Vice President Harris Delivers Address on The Ellipse in Washington, D.C.  —  2024 Democratic presidential nominee and Vice President Kamala Harris delivered her “closing arguments” to voters in an address at The Ellipse in Washington, DC.",
    "url": "https://www.c-span.org/video/?539540-1/vice-president-harris-delivers-address-ellipse-washington-dc"
  },
  {
    "text": "Ukraine is now struggling to survive, not to win  —  Russia is slicing through Ukrainian defences in parts of the battlefield  —  “After 970 days of war,” said Lloyd Austin, America's defence secretary, visiting Kyiv on October 21st, “Putin has not achieved one single strategic objective.”",
    "url": "https://www.economist.com/europe/2024/10/29/ukraine-is-now-struggling-to-survive-not-to-win"
  },
  {
    "text": "We led some of America's largest companies.  Here's why we are voting for Harris, not Trump  —  Doug Parker is a former CEO of American Airlines.  Ken Frazier is a former CEO of Merck.  Anne Mulcahy is a former CEO of Xerox.  Ursula Burns is a former CEO of Xerox.  Reid Hoffman is a former CEO of LinkedIn.",
    "url": "https://fortune.com/2024/10/29/ceos-america-largest-companies-voting-for-harris-not-trump-leadership-elections-politics/"
  },
  {
    "text": "Elon Musk Makes Shocking Confession on His Plans After Trump Victory  —  Elon Musk admitted that he knows that Donald Trump's policies would crash the economy if he's elected president, but thinks that the price is worth it.  —  The tech CEO and social media mogul on Monday evening replied … ",
    "url": "https://newrepublic.com/post/187662/elon-musk-confession-economy-trump-victory"
  },
  {
    "text": "Heritage Foundation's Far-Right Project 2025 Will Guide Trump's Second Term  —  Trump loyalists authored it so don't believe his denials that it has nothing to do with him  —  Project 2025 is a governing blueprint prepared by the Heritage Foundation, one of the right's most prominent intellectual organs … ",
    "url": "https://www.theunpopulist.net/p/heritage-foundations-far-right-project"
  }
]