[
  {
    "text": "Read the Full Transcript of Donald Trump's 2024 Person of the Year Interview With TIME  —  President-elect Donald Trump, TIME's 2024 Person of the Year, sat down for a wide-ranging interview at his Mar-a-Lago Club in Palm Beach, Fla., on Nov. 25.  —  Over the course of the interview … ",
    "url": "https://time.com/7201565/person-of-the-year-2024-donald-trump-transcript/"
  },
  {
    "text": "FBI didn't deploy undercover agents on Jan. 6, watchdog report finds, undercutting conspiracy theories  —  The DOJ inspector general also said the FBI should have done more to canvass its sources in advance of Jan. 6 to try to understand the potential for violence.",
    "url": "https://www.politico.com/news/2024/12/12/fbi-jan-6-undercover-agents-inspector-general-report-00194036"
  },
  {
    "text": "DOJ IG reveals 26 FBI informants were present on Jan. 6  —  The FBI only directed 3 confidential human sources to attend the events of Jan. 6, 2021, Horowitz says  —  Justice Department Inspector General Michael Horowitz said there were more than two dozen confidential human sources in the crowd on Jan. 6 … ",
    "url": "https://www.foxnews.com/politics/doj-ig-reveals-number-fbi-confidential-sources-ground-during-jan-6"
  },
  {
    "text": "FBI missed ‘basic step’ when gathering intel in the lead-up to Jan. 6, DOJ watchdog finds  —  Investigators found no evidence of undercover FBI employees at the Capitol, but the presence of FBI informants could further fuel right-wing “fedsurrection” conspiracy theories.",
    "url": "https://www.nbcnews.com/politics/national-security/fbi-missed-basic-step-gathering-intel-lead-jan-6-doj-watchdog-finds-rcna183449"
  },
  {
    "text": "Trump's Middle East Adviser Pick Is a Small-Time Truck Salesman  —  The lore around Massad Boulos, Tiffany Trump's father-in-law, is that he is a billionaire dealmaker.  Records show otherwise.  —  The lore around Massad Boulos, Tiffany Trump's father-in-law, is that he is a billionaire dealmaker.",
    "url": "https://www.nytimes.com/2024/12/12/world/africa/trump-massad-boulos-middle-east.html?unlocked_article_code=1.g04.kvZk.eE-d0JxFTQec&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Christopher Wray Is Preparing to Sabotage Trump and Patel  —  On Wednesday, Christopher Wray announced that he is resigning as director of the FBI.  —  “After weeks of careful thought, I've decided the right thing for the bureau is for me to serve until the end of the current administration … ",
    "url": "https://pjmedia.com/matt-margolis/2024/12/12/christopher-wray-is-preparing-to-sabotage-trump-and-patel-n4935055"
  },
  {
    "text": "FACT SHEET: President Biden Announces Clemency for Nearly 1,500 Americans  —  Today's announcement will commute the sentences of close to 1,500 individuals who were placed on home confinement and will pardon 39 individuals convicted of non-violent crimes  —  Today, President Biden announced … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/12/fact-sheet-president-biden-announces-clemency-for-nearly-1500-americans/"
  },
  {
    "text": "Trump Advisers Seek to Shrink or Eliminate Bank Regulators  —  Advisers asked potential nominees whether Trump could abolish the FDIC  —  The Trump transition team has started to explore pathways to dramatically shrink, consolidate or even eliminate the top bank watchdogs in Washington.",
    "url": "https://www.wsj.com/finance/regulation/trump-advisers-bank-regulations-fdic-efa761dc?st=nN2iCh"
  },
  {
    "text": "Jeff Bezos' Amazon Plans to Donate $1 Million to Trump's Inauguration  —  The tycoon, long a Trump foe, is among tech leaders seeking improved ties with the president-elect  —  Amazon.com is planning a $1 million donation to president-elect Donald Trump's inaugural fund … ",
    "url": "https://www.wsj.com/politics/elections/jeff-bezos-amazon-plans-to-donate-1-million-to-trumps-inauguration-dc3705ac"
  },
  {
    "text": "It's Time to Break Up Big Medicine  —  UnitedHealth Group is not an insurer, it's a platform.  And it's in the crosshairs as Elizabeth Warren and Josh Hawley propose breaking it apart, severing its pharmacy arm from the rest of the business  —  The saga of the UnitedHealth Care CEO assassination has … ",
    "url": "https://www.thebignewsletter.com/p/its-time-to-break-up-big-medicine"
  },
  {
    "text": "House Republicans launch investigation into CVS Caremark for potential antitrust violations  —  House Republicans want to know whether pharmacy benefit manager (PBM) CVS Caremark violated federal antitrust laws by threatening independent pharmacies to keep them from using money-saving tools outside the PBM's network.",
    "url": "https://thehill.com/policy/healthcare/5037786-house-republicans-launch-investigation-into-cvs-caremark-for-potential-antitrust-violations/"
  },
  {
    "text": "Trump says reducing food prices will be ‘very hard,’ after campaign promise to cut costs  —  Trump said he would pardon people convicted of participating in the Jan. 6, 2021, assault on the Capitol within the first minutes or hours of taking office.",
    "url": "https://www.washingtonpost.com/politics/2024/12/12/trump-time-food-costs-jan-6-transgender-rights/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzOTc5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM1MzYxOTk5LCJpYXQiOjE3MzM5Nzk2MDAsImp0aSI6ImI3YjA5ZjVlLTk4MWYtNGI1Yi04MWUyLWJhMGFiMTIyNjFiOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEyLzEyL3RydW1wLXRpbWUtZm9vZC1jb3N0cy1qYW4tNi10cmFuc2dlbmRlci1yaWdodHMvIn0.TzvopiDkP0LFNNFMKUmRVsHwqHntBa2_YGe3EM_im2A&itid=gfta"
  },
  {
    "text": "Republicans clash over ‘SALT’ deduction as they seek to extend Trump's tax law  —  Early battle lines are forming over a contentious issue that has split Republicans in high-tax states from their other colleagues as they plan a big tax bill next year.  —  WASHINGTON — A group … ",
    "url": "https://www.nbcnews.com/politics/congress/republicans-clash-salt-deduction-extend-trump-tax-law-rcna183876"
  },
  {
    "text": "US senator says mysterious drones spotted in New Jersey should be ‘shot down, if necessary’  —  A U.S. senator has called for mysterious drones spotted flying over sensitive areas in New Jersey and other parts of the Mid-Atlantic region to be “shot down, if necessary,” even as it remains unclear who owns them.",
    "url": "https://apnews.com/article/fbi-drones-new-jersey-8bfe84cf2678400181292b75f9193395"
  },
  {
    "text": "Jeffries super PAC looks deep into GOP territory for 2026 map  —  A super PAC closely aligned with House Minority Leader Hakeem Jeffries (D-N.Y.) is circling districts that voted for their Republican incumbents by as much as 30 percentage points as it charts a course back to the majority",
    "url": "https://www.axios.com/2024/12/13/jeffries-2026-elections-republican-seats"
  },
  {
    "text": "China's Xi is likely to decline Trump's inauguration invitation, seeing it as too risky to attend  —  Chinese leader Xi Jinping would likely see President-elect Donald Trump's invitation to attend his inauguration as too risky to accept, and the gesture from Trump may have little bearing … ",
    "url": "https://apnews.com/article/trump-xi-china-inauguration-invitation-a0fbde24ca2ccafa9a953813955d532f"
  },
  {
    "text": "Democrats Ask That Trump Cabinet Picks Produce Communications With Epshteyn  —  The two top Democrats on the Senate Judiciary Committee said prospective nominees should be prepared to testify about any discussions with Boris Epshteyn about their selections.  —  The two top Democrats … ",
    "url": "https://www.nytimes.com/2024/12/12/us/politics/boris-epshteyn-senate.html"
  },
  {
    "text": "EXCLUSIVE: Biden Races To Sell Off Border Wall Parts Before Trump Takes Office  —  ‘The goal is to move all of it off the border before Christmas,’ Arizona border patrol agent tells The Daily Wire  —  The Biden administration is using its final weeks to haul a massive amount … ",
    "url": "https://www.dailywire.com/news/exclusive-biden-races-to-sell-off-border-wall-parts-before-trump-takes-office"
  },
  {
    "text": "Was mocking Musk a mistake?  Democrats think about warmer relationship with the billionaire  —  Democrats had soured on the richest man on the planet.  But a few are starting to wonder if that was a mistake.  —  Ro Khanna is trading texts with Elon Musk.  Josh Shapiro took a call from him.",
    "url": "https://www.politico.com/news/2024/12/12/democrats-elon-musk-relationship-000579"
  },
  {
    "text": "SEC charges Cantor Fitzgerald, led by Trump's Commerce pick, with breaking securities laws … WASHINGTON — The Securities and Exchange Commission on Thursday charged global financial services firm Cantor Fitzgerald with violating laws related to disclosures by so-called blank-check companies before they raised money from the public.",
    "url": "https://www.cnbc.com/2024/12/12/sec-cantor-fitzgerald-charges-howard-lutnick-trump-commerce-spac-.html"
  },
  {
    "text": "Los Angeles Times Owner Wades Deeper Into Opinion Section  —  Dr. Patrick Soon-Shiong's public comments and actions, including recently blocking an editorial weighing in on President-elect Trump's cabinet picks, have concerned many staff members.  —  After President-elect Donald J. Trump announced … ",
    "url": "https://www.nytimes.com/2024/12/12/business/media/la-times-patrick-soon-shiong.html"
  },
  {
    "text": "'Now she's the world's problem': Some Arizona Republicans relieved Lake is heading to Washington  —  She's still expected to play a role in Arizona politics.  —  President-elect Donald Trump's pick of longtime loyalist Kari Lake to lead Voice of America has some Arizona Republicans breathing a sigh of relief.",
    "url": "https://www.politico.com/news/2024/12/12/kari-lake-voa-republicans-00194096"
  },
  {
    "text": "Pete Hegseth, Trump's Defense pick, says allowing gay troops to serve openly reflects a Marxist agenda  —  Pete Hegseth, President-elect Donald Trump's pick for secretary of defense, has repeatedly criticized policies allowing gay people to serve openly in the US military, calling them part of a … ",
    "url": "https://www.cnn.com/2024/12/12/politics/pete-hegseth-gay-trans-troops-marxist-agenda/"
  },
  {
    "text": "University of Michigan May Fire D.E.I. Official Over Antisemitism Claim  —  The official, an administrator of multicultural programs, was accused of making antisemitic remarks in a private conversation.  She has denied the allegations.  —  The University of Michigan is considering firing … ",
    "url": "https://www.nytimes.com/2024/12/12/us/university-of-michigan-dei-administrator-antisemitism.html"
  },
  {
    "text": "AOC faces Pelosi-led slugfest for Oversight role … - The fight comes as several septuagenarian committee ranking members are facing desperate battles against - or yielding to - younger challengers.  — “Many members are concerned about [the] precedent these races are setting,” one senior House Democrat told Axios.",
    "url": "https://www.axios.com/2024/12/12/aoc-pelosi-oversight-committee-connolly-raskin"
  },
  {
    "text": "Why The Onion's Infowars bid has been blocked — for now  —  In November, satirical newspaper The Onion won a bankruptcy auction to purchase Infowars, a website dedicated to hawking anti-government conspiracy theories.  On Wednesday, however, a federal bankruptcy judge rejected the purchase … ",
    "url": "https://www.vox.com/politics/390953/the-onion-infowars-alex-jones"
  },
  {
    "text": "Musk's Foundation Gave Away Less Money Than Required in 2023  —  Private foundations must donate 5 percent of their assets every year.  Elon Musk's enormous charity missed that standard for three consecutive years.  —  For the third year in a row, Elon Musk's charitable foundation did not give away enough of its money.",
    "url": "https://www.nytimes.com/2024/12/12/us/politics/musk-foundation-taxes-donations.html"
  },
  {
    "text": "Exclusive: Officer who killed Ashli Babbitt abandoned US Capitol post for card game, lied to investigators about it, source says  —  The U.S. Capitol Police lieutenant who shot and killed Ashli Babbitt at the Capitol on Jan. 6 was recommended for termination in 2001 for abandoning his post … ",
    "url": "https://www.theblaze.com/news/exclusive-officer-who-killed-ashli-babbitt-abandoned-us-capitol-post-for-card-game-lied-to-investigators-about-it-source-says"
  },
  {
    "text": "White House releases strategy to counter anti-Muslim, anti-Arab hate  —  U.S. President Joe Biden on Thursday released a long-awaited strategy for countering anti-Muslim and anti-Arab hate, up sharply since the start of the Israel-Gaza war, calling for urgent, continued work to reduce discrimination and bias.",
    "url": "https://www.reuters.com/world/us/white-house-releases-strategy-counter-anti-muslim-anti-arab-hate-2024-12-12/"
  },
  {
    "text": "Trump says he'll pull vaccines if he finds they're unsafe  —  President-elect Donald Trump said he's open to getting rid of vaccines depending on Robert F. Kennedy Jr.'s review of their safety.  Trump's comments to Time magazine contradict promises previously made by Kennedy … ",
    "url": "https://www.politico.com/live-updates/2024/12/12/congress/trump-open-to-pulling-vaccines-00194060"
  },
  {
    "text": "U.S. charges 14 North Koreans in $88 million identity theft and extortion case … The Department of Justice accused 14 North Korean nationals of conspiring to use false identities to get IT jobs with U.S. companies and siphon money back to their home country in violation of U.S. sanctions.",
    "url": "https://www.cnbc.com/2024/12/12/north-koreans-charged-identity-theft-extortion-conspiracy-doj.html"
  }
]