[
  {
    "text": "Trump Administration Live Updates: President Threatens Brazil With Tariffs of 50 Percent as He Assails Prosecution of Bolsonaro  —  Where Things Stand  — Trade war: President Trump said he planned to impose tariffs of 50 percent on imports from Brazil, as he and U.S. diplomats also accused … ",
    "url": "https://www.nytimes.com/live/2025/07/09/us/trump-news"
  },
  {
    "text": "Trump hits Brazil with 50% tariff, in part due to trial of ally Jair Bolsonaro  —  “The way Brazil has treated former President Bolsonaro ... is an international disgrace,” Trump wrote.  —  President Donald Trump announced Wednesday he planned to hit Brazil with a 50% tariff … ",
    "url": "https://www.nbcnews.com/business/economy/trump-hits-brazil-50-percent-tariff-citing-ex-president-jair-bolsonaro-rcna217859"
  },
  {
    "text": "California awaits disaster relief as GOP offers full support of Texas  —  California Gov. Gavin Newsom (D) on a trip to South Carolina this week highlighted the plight of Los Angeles communities still reeling from January's devastating wildfires.  —  For months, California Gov. Gavin Newsom … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/09/texas-flooding-trump-politics-disaster-relief/"
  },
  {
    "text": "Brazil will respond to Trump's 50% tariff with ‘reciprocity,’ says da Silva … Brazilian President Luiz Inacio Lula da Silva said Wednesday that his country will respond with reciprocity to U.S. President Donald Trump's newly announced 50% tariff rate on his country's exports … ",
    "url": "https://www.cnbc.com/2025/07/09/trump-brazil-tariffs-bolsonaro.html"
  },
  {
    "text": "FEMA's response to Texas flood slowed by Noem's cost controls  —  As monstrous floodwaters surged across central Texas late last week, officials at the Federal Emergency Management Agency leapt into action, preparing to deploy critical search and rescue teams and life-saving resources, like they have in countless past disasters.",
    "url": "https://cnn.com/2025/07/09/politics/fema-texas-flood-noem"
  },
  {
    "text": "Comey Tracked by Secret Service After Post Critical of Trump  —  After the former F.B.I. director put a picture on Instagram of seashells arranged to say “86 47,” law enforcement tailed his car and tracked his cellphone, steps usually reserved for serious threats.",
    "url": "https://www.nytimes.com/2025/07/09/us/politics/james-comey-secret-service.html?unlocked_article_code=1.VE8.TGun.w6VwPKhnTw6_&smid=url-share"
  },
  {
    "text": "6 Secret Service agents suspended over conduct during attempted Trump assassination  —  The July 2024 incident left Trump's ear bloodied and a firefighter killed.  —  Former President Donald Trump is rushed offstage by Secret Service agents after being grazed by a bullet during a rally in Butler, Penn., July 13, 2024.",
    "url": "https://abcnews.go.com/US/secret-service-agents-suspended-conduct-attempted-trump-assassination/story?id=123628351"
  },
  {
    "text": "Trump praises English-speaking Liberian president's English  —  At a lunch with African leaders, President Trump complimented the president of Liberia on his English, apparently unaware that it's the country's official language.  —  During his lunch with African leaders at the White House on Wednesday … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/09/trump-liberia-english/"
  },
  {
    "text": "Trump says the president of Liberia, where English is the official language, speaks ‘good English’  —  Trump's remarks came during a meeting in Washington with the leaders of several African nations.  Many people who live in Liberia are descendants of freed American slaves.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-president-liberia-english-official-language-speaks-good-eng-rcna217827"
  },
  {
    "text": "Trump on Brennan, Comey probe reports: “Maybe they have to pay a price”  —  President Trump responded Wednesday to reports that former CIA Director John Brennan and former FBI Director James Comey are being investigated over allegations that they made false statements to Congress during the Russia probe.",
    "url": "https://www.axios.com/2025/07/09/trump-comey-brennan-fbi-investigation"
  },
  {
    "text": "Over 2,000 senior staff set to leave NASA under agency push … Many of those leaving also serve in NASA's core mission sets, according to the documents.  Those leaving include 1,818 staff serving in mission areas like science or human space flight, with the rest performing mission support roles like IT … ",
    "url": "https://www.politico.com/news/2025/07/09/nasa-staff-departures-00444674"
  },
  {
    "text": "The GOP's New Lie After Cutting $1 Trillion From Medicaid: We Gave It More Money!  —  “We are increasing Medicaid expenditures by $200 billion,” Rep. Rob Bresnahan (R-Pa.) falsely said of Trump's tax law, which will strip health care from millions.  —  WASHINGTON ― … ",
    "url": "https://www.huffpost.com/entry/house-republicans-cut-medicaid-damage-control_n_686d96a0e4b041f69cfd6636"
  },
  {
    "text": "Attorney General Bailey Fights To Expose Big Tech Censorship Of President Trump As AI Chatbots Produce Fake News  —  JEFFERSON CITY, Mo. - Today, Missouri Attorney General Andrew Bailey sent a formal demand letter to Google, Microsoft, OpenAI, and Meta regarding biased and factually inaccurate … ",
    "url": "https://ago.mo.gov/attorney-general-bailey-fights-to-expose-big-tech-censorship-of-president-trump-as-ai-chatbots-produce-fake-news/"
  },
  {
    "text": "Exclusive: Evidence of cell phone surveillance detected at anti-ICE protest  —  Mobile network anomalies consistent with cell phone surveillance were detected at a July 4 protest at an Immigration and Customs Enforcement field office in Washington state.  Those anomalies, according … ",
    "url": "https://san.com/cc/exclusive-evidence-of-cell-phone-surveillance-detected-at-anti-ice-protest/"
  },
  {
    "text": "Tillis Suggests He Regrets Vote to Confirm Hegseth, Calling Him ‘Out of His Depth’  —  The North Carolina senator, who recently said he did not plan to run for re-election, said the defense secretary's decisions have been amateurish and show he is unfit to lead a large organization.",
    "url": "https://www.nytimes.com/2025/07/09/us/politics/tillis-hegseth-vote-unfit.html"
  },
  {
    "text": "Governor Abbott Announces Special Session Agenda  —  Governor Greg Abbott today issued a proclamation identifying 18 agenda items for the upcoming Special Session that begins at 12:00 PM on Monday, July 21.  —  “We delivered on historic legislation in the 89th Regular Legislative Session … ",
    "url": "https://gov.texas.gov/news/post/governor-abbott-announces-special-session-agenda-"
  },
  {
    "text": "Trump officials used shadowy website to target pro-Palestinian academics for deportation, court records show … The federal judge currently overseeing a trial in the case unsealed the deposition transcripts, which contain hundreds of pages of sworn testimony by administration officials about the campus deportation effort.",
    "url": "https://www.politico.com/news/2025/07/09/pro-palestinian-deportation-documents-trial-00445238"
  },
  {
    "text": "Trump Administration Renews Attacks On Harvard With Negotiations Uncertain  —  The Department of Homeland Security issued administrative subpoenas seeking data about the university's international students, while two federal agencies challenged Harvard's accreditation.",
    "url": "https://www.nytimes.com/2025/07/09/us/politics/trump-harvard-data-accreditation.html"
  },
  {
    "text": "Noem claims 1 in 6 survivors of Lahaina wildfires had to ‘trade sexual favors’ for supplies … The study found that women had “survival sex” with “a landlord, an employer, family members, friends and acquaintances.”  —  Khara Jabola-Carolus, one of the authors of the Tagnawa report … ",
    "url": "https://www.politico.com/news/2025/07/09/kristi-noem-fema-attack-00445683"
  },
  {
    "text": "MTG says Americans are ‘not going to accept’ there is no Epstein client list  —  The federal government said Monday there is no Jeffrey Epstein client list after Attorney General Pam Bondi said evidence was “sitting on my desk” in February  —  The latest headlines from our reporters across … ",
    "url": "https://www.independent.co.uk/news/world/americas/marjorie-taylor-greene-jeffrey-epstein-client-list-b2786010.html"
  },
  {
    "text": "U.S. Pushes More African Countries to Accept Deported Migrants  —  Five countries whose leaders held talks with Trump at the White House were sent a U.S. proposal to accept deportees, document shows  —  WASHINGTON—As President Trump met Wednesday with the leaders of five West African countries … ",
    "url": "https://www.wsj.com/politics/policy/u-s-pushes-more-african-countries-to-accept-deported-migrants-b6f330c5"
  },
  {
    "text": "Courts Can Check, and Have Checked, Executives' Military Judgment  —  Last month, Brennan Center attorneys Katherine Yon Ebright and Leah Tulin, and I submitted an amicus brief in the Fifth Circuit case of W.M.M. v. Trump, opposing the Trump Administration's use of the Alien Enemies Act of 1798 … ",
    "url": "https://reason.com/volokh/2025/07/09/courts-can-check-and-have-checked-executives-military-judgment/"
  },
  {
    "text": "Texas to take up congressional redistricting in special session  —  Texas Gov. Greg Abbott announced Wednesday the state Legislature will focus on redistricting during a special session later this year, as Republicans look to defend their narrow House majority in 2026.",
    "url": "https://www.politico.com/live-updates/2025/07/09/congress/texas-redistricting-2026-midterms-00445561"
  },
  {
    "text": "Federal workers fear Trump will fire them after court ruling: ‘We are toast’  —  Next steps aren't clear, but the White House says it plans to resume mass government layoffs.  —  Some federal workers cried.  Some shook their heads and began updating their résumés.",
    "url": "https://www.washingtonpost.com/business/2025/07/09/trump-mass-firings-federal-workers-supreme-court/"
  },
  {
    "text": "DOJ Demands Access to Minnesota's Voter Rolls  —  The U.S. Department of Justice is demanding access to Minnesota's voter rolls, as well as proof of the state's compliance with the Help America Vote Act (HAVA), according to a letter exclusively obtained by Democracy Docket.",
    "url": "https://www.democracydocket.com/news-alerts/doj-demands-access-to-minnesotas-voter-rolls/"
  },
  {
    "text": "The Epstein Files Anticlimax Is Exposing Trump for Who He Really Is  —  Donald Trump does not want to talk about Jeffrey Epstein.  Asked on Tuesday about his administration's refusal to release files related to the dead financier who allegedly sex-trafficked underage girls … ",
    "url": "https://newrepublic.com/article/197760/epstein-files-exposing-trump-elites"
  },
  {
    "text": "Trump Says He's Making America More Competitive.  Is He?  —  Experts fear that the president's economic policies could increase costs and stifle innovation.  —  President Trump won his office twice by promising to turbocharge the American economy and restore its global dominance over international competitors.",
    "url": "https://www.nytimes.com/2025/07/09/us/politics/trump-tariffs-taxes-economy.html"
  },
  {
    "text": "Eric Adams Asked Bill Ackman to Vet Campaign Manager Before Hiring Him  —  Mr. Ackman and another hedge fund titan, Daniel S. Loeb, interviewed a potential campaign hire for Mayor Adams, who is courting their financial support.  —  As Mayor Eric Adams of New York City searched for a new campaign manager … ",
    "url": "https://www.nytimes.com/2025/07/09/nyregion/eric-adams-eugene-noh-bill-ackman.html?unlocked_article_code=1.VE8.qiRm.JIPWArBdmpe4&smid=url-share"
  },
  {
    "text": "Trump taps Sean Duffy as interim NASA administrator  —  President Trump said late Wednesday that he was tapping Transportation Secretary Sean Duffy to lead NASA on an interim basis after Trump yanked his original nominee for the post.  —  “Sean is doing a TREMENDOUS job in handling … ",
    "url": "https://thehill.com/homenews/administration/5393470-trump-taps-sean-duffy-as-interim-nasa-administrator/"
  },
  {
    "text": "Putin, Undeterred by Trump's Words, Escalates His War Against Ukraine  —  The Russian leader is convinced that Moscow's battlefield superiority is growing, and that Ukraine's defenses may collapse in the coming months, according to people close to the Kremlin.",
    "url": "https://www.nytimes.com/2025/07/09/world/europe/russia-ukraine-putin-trump.html"
  },
  {
    "text": "GOP senators start turning against Powell  —  Sen. Bernie Moreno is recruiting more GOP senators for his pressure campaign to force Federal Reserve Chair Jerome Powell to resign. … - Moreno (R-Ohio) wants to broaden the case against Powell and amp up the pressure to persuade the Fed to lower interest rates more quickly.",
    "url": "https://www.axios.com/2025/07/10/powell-fed-senate-bernie-moreno-interest-rates"
  }
]