[
  {
    "text": "Playbook: The ugly war over a Trump snub  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  A FRATERNAL GLOBAL BRAID — “Under siege, 3 world leaders say: Bring it on,” John F. Harris and Alexander Burns: “The calculations of [JOE BIDEN … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/11/the-ugly-war-over-a-trump-snub-00162656"
  },
  {
    "text": "Still Digging: Justice Alito  —  At some point, he should stop digging and start recusing.  There was more bad news for Justice Alito today.  —  This news involves a reporter who surreptitiously, and while representing herself to be someone she isn't (a like-minded conservative) … ",
    "url": "https://joycevance.substack.com/p/still-digging-justice-alito"
  },
  {
    "text": "Justice Alito Caught on Tape Discussing How Battle for America 'Can't Be Compromised'  —  In a new, secret recording, the Supreme Court justice says he “agrees” that the U.S. should return to a place of godliness  —  Justice Samuel Alito spoke candidly about the ideological battle between … ",
    "url": "https://www.rollingstone.com/politics/politics-features/samuel-alito-supreme-court-justice-recording-tape-battle-1235036470/"
  },
  {
    "text": "Alito and Roberts, Secretly Recorded at Gala, Share Markedly Different Worldviews  —  The two justices were surreptitiously recorded at a Supreme Court gala last week by a woman posing as a Catholic conservative.  —  Justice Samuel A. Alito Jr. told a woman posing as a Catholic conservative … ",
    "url": "https://www.nytimes.com/2024/06/10/us/politics/supreme-court-alito.html"
  },
  {
    "text": "Samuel Alito's Wife, Martha-Ann, Goes Full MAGA in Secret Recording  —  SWEET JESUS  —  The audio was posted hours after similarly shocking comments by the Supreme Court justice were published.  —  Martha-Ann Alito, the wife of Supreme Court Justice Samuel Alito, complained about the Pride flag … ",
    "url": "https://www.thedailybeast.com/samuel-alitos-wife-martha-ann-goes-full-maga-in-secret-recording"
  },
  {
    "text": "Martha-Ann Alito Condemns Pride Flags, the Left, and the Media  —  In a new, secret recording, the Supreme Court justice's wife bemoans having to “look across the lagoon at the Pride flag” … If it were up to her, she would be flying a Sacred Heart of Jesus flag in response.",
    "url": "https://www.rollingstone.com/politics/politics-features/supreme-court-martha-ann-alito-pride-flags-left-media-1235037338/"
  },
  {
    "text": "Donald Trump completes mandatory presentencing interview after less than 30 minutes of questioning  —  Donald Trump completed his mandatory presentencing interview Monday after less than 30 minutes of routine, uneventful questions and answers, a person familiar with the matter told The Associated Press.",
    "url": "https://apnews.com/article/trump-hush-money-interview-probation-new-york-8c6e79c8b87fe361e2adce7536e31d27"
  },
  {
    "text": "Sinclair injects deceptive attacks on Biden's age into dozens of local broadcasts  —  This is a special joint edition of Public Notice and Judd Legum's Popular Information.  You can subscribe to Popular Information here.  —  Two outlets controlled by right-wing media tycoons are working … ",
    "url": "https://www.publicnotice.co/p/sinclair-biden-slipping-wall-street-journal-hit"
  },
  {
    "text": "Hamas says it accepts UN-backed Gaza truce plan, US cites ‘hopeful sign’  —  Hamas accepts a U.N. resolution backing a plan to end the war with Israel in Gaza and is ready to negotiate details, a senior official of the Palestinian militant group said on Tuesday in what the U.S. Secretary of State called “a hopeful sign”.",
    "url": "https://www.reuters.com/world/middle-east/blinken-says-hamas-signal-support-un-backed-gaza-truce-deal-is-hopeful-sign-2024-06-11/"
  },
  {
    "text": "No lawmakers have lost primaries yet.  Will the streak end tonight?  —  Good morning, Early Birds.  We're wishing Sen. John Fetterman (D-Pa.) a rapid recovery after he suffered a bruised shoulder in a car crash on Sunday.  Send tips to earlytips@washpost.com.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2024/06/11/no-lawmakers-have-lost-primaries-yet-will-streak-end-tonight/"
  },
  {
    "text": "Judge Strikes One Element From Trump Indictment in Documents Case  —  Judge Aileen Cannon threw out one basis for the case against the former president, involving a highly sensitive military map he showed an aide after leaving office.  —  The federal judge overseeing former President Donald … ",
    "url": "https://www.nytimes.com/2024/06/10/us/politics/trump-documents-charges-cannon.html"
  },
  {
    "text": "Fox News Edited Out Trump Saying He Might Keep Epstein Files Sealed  —  But a later release of the interview included his full response.  —  LOADING  —  The initial airing of a Fox News interview with Donald Trump last week cut out the former president saying he may not declassify federal files … ",
    "url": "https://www.huffpost.com/entry/donald-trump-jeffrey-epstein-fox-news_n_6667330de4b019027bc727f4"
  },
  {
    "text": "Unfounded attacks on the Justice Department must end  —  Conspiracy theories, falsehoods and threats of violence against DOJ personnel are not normal.  —  Merrick Garland is attorney general of the United States.  —  Last week, a California man was convicted of threatening to bomb … ",
    "url": "https://www.washingtonpost.com/opinions/2024/06/11/merrick-garland-justice-department-threats-fbi-2024/"
  },
  {
    "text": "Canada's Parliament rocked by allegations of treason  —  Foreign interference probe exposes links to “witting” lawmakers in Ottawa.  —  OTTAWA — The capital of one of the world's most stable democracies is gripped by growing panic about foreign agents working in elected office.",
    "url": "https://www.politico.com/news/2024/06/10/canada-parliament-treason-allegations-00162163"
  },
  {
    "text": "Is Donald Trump okay?  —  His story about hypothetically being electrocuted is another glimpse into a mind that is unwell.  —  It is irresponsible to obsess over President Biden's tendency to mangle a couple of words in a speech while Donald Trump is out there sounding detached from reality.",
    "url": "https://www.washingtonpost.com/opinions/2024/06/10/trump-sharks-electrocuted-boat-story/"
  },
  {
    "text": "How Republicans used misleading videos to attack Biden in a 24-hour period  —  Such deceptively edited videos, known as “cheap fakes,” have become staples of Republican attacks against President Biden.",
    "url": "https://www.washingtonpost.com/politics/2024/06/11/biden-videos-republicans-cheap-fake-d-day/"
  },
  {
    "text": "Trump's Liquor Licenses Under Scrutiny After Felony Conviction  —  States across the country have laws restricting felons from selling alcohol.  What does that mean for Donald Trump, who does not drink but sells plenty of booze?  —  The State of New Jersey is reviewing whether Donald Trump's … ",
    "url": "https://www.forbes.com/sites/zacheverson/2024/06/10/donald-trump-liquor-licenses-felony-conviction-new-jersey-new-york-california/"
  },
  {
    "text": "John Fetterman and wife Gisele are hospitalized after Democratic senator rear-ended car on the highway  — Fetterman and his wife were driving in northern Maryland at the time  —  Pennsylvania Democrat Sen. John Fetterman and his wife Gisele were hospitalized after a car crash Sunday morning.",
    "url": "https://www.dailymail.co.uk/news/article-13515011/john-fetterman-wife-gisele-hospitalized-car-accident.html"
  },
  {
    "text": "Trump threats ‘terrifying’ for feds, ex-FBI chief says.  Steve Bannon says they ‘should be’  —  WASHINGTON − Steve Bannon, who has advised former President Donald Trump, just warned the last two ex-FBI directors to “Get your passport, get the hell out of the country because hey, we're coming,” in a second Trump term.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/11/trump-threats-scare-agents/74039044007/"
  },
  {
    "text": "The CFPB is genuinely making America better, and they're going HARD (permalink)  —  Let's take a sec here and notice something genuinely great happening in the US government: the Consumer Finance Protection Bureau's stunning, unbroken streak of major, muscular victories over the forces … ",
    "url": "https://pluralistic.net/2024/06/10/getting-things-done/#deliverism"
  },
  {
    "text": "Things to know about FDA warning on paralytic shellfish poisoning in Pacific Northwest  —  The U.S. Food and Drug Administration says consumers should avoid eating shellfish from Oregon and Washington state as they may be contaminated with toxins that cause paralytic shellfish poisoning.",
    "url": "https://apnews.com/article/fda-warning-shellfish-oregon-washington-f5724c1b91fb78ed16c3f98a7c9e8cae"
  },
  {
    "text": "Why Two Simple Words Bother Trump So Much  —  TOUCHY MUCH?  —  The former president's fury over a Biden ad highlighting his comments about fallen U.S. soldiers shows he can dish out his favorite insults but can't take them in return.  —  Donald Trump has always been comfortable hurling insults.",
    "url": "https://www.thedailybeast.com/why-two-simple-words-bother-trump-so-much"
  },
  {
    "text": "Behind the Republican Effort to Win Over Black Men  —  The party is trying to make inroads with Black voters, a key demographic for Democrats, which could swing the 2024 election.  —  Two Black Republican House members and Trump surrogates reserved a cigar bar near downtown Philadelphia … ",
    "url": "https://www.nytimes.com/2024/06/10/us/politics/2024-election-gop-black-men-voters.html"
  }
]