[
  {
    "text": "Donald Trump has a big problem ahead  —  A whole swath of GOP voters appears firmly committed to not voting for Trump in November.  —  Donald Trump has a problem no matter what happens in New Hampshire on Tuesday night: There's a whole swath of the Republican electorate and a good chunk … ",
    "url": "https://www.politico.com/news/2024/01/23/trump-moderate-republicans-problem-00137112"
  },
  {
    "text": "Trump's surprise fan club: Why many Dems want him to win big in N.H. … Many Democrats are rooting for the same thing. … - The president's campaign has internal data indicating that most of the undecided voters Biden is targeting don't think Trump will be the Republican nominee … ",
    "url": "https://www.axios.com/2024/01/23/why-many-dems-want-trump-win-new-hampshire"
  },
  {
    "text": "Elise Stefanik's Deranged Defense of Trump Offers Democrats a Lesson … When it comes to Donald Trump's legal travails, there are two general schools of thought among Democrats.  In one, a jury's finding that Trump is liable for sexually abusing E. Jean Carroll—and his pending trials … ",
    "url": "https://newrepublic.com/article/178320/elise-stefanik-deranged-defense-trump-democrats-lesson"
  },
  {
    "text": "The GOP Wants Pure Uncut Trumpism  —  The race for the Republican presidential nomination appears all but over unless Haley pulls off a New Hampshire upset  —  SEABROOK, N.H.—The zero hour was approaching, and in a plywood-walled lobster shack on the New Hampshire seacoast … ",
    "url": "https://www.wsj.com/politics/elections/gop-new-hampshire-trump-haley-403080ca?mod=followamazon"
  },
  {
    "text": "Florida plan to have taxpayers pay Trump's legal bills nixed after DeSantis veto threat  —  DeSantis suggested he would veto the proposal.  —  TALLAHASSEE, Florida — A push by some Florida Republicans to use taxpayer money to help pay for former President Donald Trump's multiple legal … ",
    "url": "https://www.politico.com/news/2024/01/22/florida-trump-legal-bills-00136984"
  },
  {
    "text": "Jamie Dimon's MAGA warning to Dems is right on target  —  Call it a “road to Davos” moment: Jamie Dimon has seen the light.  —  The J.P. Morgan Chase CEO had liberals clutching at their pearls when he copped to a simple but (in some circles) unutterable truth: Former President Donald Trump … ",
    "url": "https://nypost.com/2024/01/22/opinion/jamie-dimons-maga-warning-to-dems-is-right-on-target/"
  },
  {
    "text": "How One New Hampshire Voter and One Politico Journalist Refused to Hold “a Pig ... a Womanizer ...  [an] Arrogant Asshole” Accountable  —  Politico has an interesting profile of a two-time Obama voter, who will today become a three-time Trump voter, New Hampshire voter Ted Johnson.",
    "url": "https://www.emptywheel.net/2024/01/23/how-one-new-hampshire-voter-and-one-politico-journalist-refused-to-hold-a-pig-a-womanizer-an-arrogant-asshole-accountable/"
  },
  {
    "text": "What counts as a win for Biden in New Hampshire's unprecedented primary?  —  Biden supporters and detractors alike have been trying to set expectations in a primary that won't officially count and has no clear benchmarks.  —  MANCHESTER, N.H. — What counts as a good outcome for President Joe Biden … ",
    "url": "https://www.nbcnews.com/politics/2024-election/counts-win-joe-biden-new-hampshires-unprecedented-primary-rcna135153"
  },
  {
    "text": "Chip Roy urges Texas officials to ignore Supreme Court order on border razor wire: ‘Go to hell’  —  Roy called the Supreme Court's 5-4 decision ‘unconscionable’  —  Join Fox News for access to this content  —  Plus get unlimited access to thousands of articles, videos and more with your free account!",
    "url": "https://www.foxnews.com/politics/chip-roy-urges-texas-officials-ignore-supreme-court-order-border-razor-wire-go-hell"
  },
  {
    "text": "How Steve Garvey became a punchline at the first California Senate debate  —  The Republican and former Dodger was an easy target for House Democrats on Thursday night.  —  LOS ANGELES — Steve Garvey was less a heavy hitter on Thursday night's Senate debate stage and more often a punchline.",
    "url": "https://www.politico.com/news/2024/01/23/steve-garvey-ca-senate-debate-punchline-00137143"
  },
  {
    "text": "Putin aide mocks CIA video recruiting Russian double agents  —  The Kremlin's press secretary mocked the CIA on Tuesday after the agency posted a Russian-language video attempting to recruit spies.  —  Dmitry Peskov joked that the video, posted to X, the platform formerly known as Twitter … ",
    "url": "https://thehill.com/policy/international/4424334-putin-cia-recruiting-russian-spies-ukraine/"
  },
  {
    "text": "Germany's surging far right provokes a reckoning  —  You're reading an excerpt from the Today's WorldView newsletter.  Sign up to get the rest free, including news from around the globe and interesting ideas and opinions to know, sent to your inbox every weekday.",
    "url": "https://www.washingtonpost.com/world/2024/01/23/germany-far-right-alternative-for-germany-afd-reckoning-protest-future/"
  },
  {
    "text": "Doomsday Clock time update says humanity is as close as ever to global catastrophe  —  We're still as close as ever to global catastrophe, according to the annual update of the Doomsday Clock, announced Tuesday morning.  —  The time on the symbolic clock is the same as last year … ",
    "url": "https://www.usatoday.com/story/news/nation/2024/01/23/doomsday-clock-announcement-2024/72311076007/"
  },
  {
    "text": "No Labels Sued by Durst Family Members Claiming Breach of Contract  —  Two members of the Durst real estate family are suing the centrist political group No Labels, saying its pursuit of a possible third-party presidential bid is a breach of contract.  —  Two members of the powerful Durst … ",
    "url": "https://www.nytimes.com/2024/01/23/us/politics/durst-no-labels-lawsuit-election-donors.html"
  },
  {
    "text": "The Rise of the American Oligarchy  —  What targeting Russia's wayward billionaires revealed about our own. … For the last 18 months one of the most opulent and unnecessary vessels ever constructed has been floating in a narrow channel next to a jungle gym and a fleet of industrial cranes at the Port of San Diego.",
    "url": "https://www.motherjones.com/politics/2024/01/american-oligarchy-introduction-essay-russia-ukraine-capitalism/"
  },
  {
    "text": "Exclusive: Israel's spy chief proposed Hamas leaders leave Gaza as part of broader ceasefire talks  —  Israel has proposed that Hamas senior leaders could leave Gaza as part of a broader ceasefire agreement, two officials familiar with the ongoing international discussions told CNN.",
    "url": "https://www.cnn.com/2024/01/22/politics/israel-proposal-hamas-leaders-leave-gaza"
  },
  {
    "text": "CFO Patronis Announces Filing of Florida Freedom Fighters Fund ~Provides Grant Funding for Legal Defense of Florida Presidential Candidates~  —  Tallahassee, Fla. - Today, Florida Chief Financial Officer (CFO) Jimmy Patronis announced the filing of SB 1740 by Senator Ileana Garcia, which creates the Florida Freedom Fighters Fund.",
    "url": "https://myfloridacfo.com/news/pressreleases/press-release-details/2024/01/22/cfo-patronis-announces-filing-of-florida-freedom-fighters-fund"
  }
]