[
  {
    "text": "Inside House Dems' 11th-hour plot to sabotage Trump's agenda … - House Minority Leader Hakeem Jeffries (D-N.Y.) is already telling allies how he is preparing to lead the resistance to Trump, Axios' Hans Nichols reported.  — “We as Democrats have to roll up our sleeves and get into defense … ",
    "url": "https://www.axios.com/2024/11/11/house-democrats-trump-lame-duck"
  },
  {
    "text": "White House pushes back on Trump call to halt confirmations in lame duck period  —  A White House spokesperson on Monday pushed back on President-elect Trump's demand that the Democratic Senate stop confirming judges during the lame-duck period before he takes office and the upper chamber flips to GOP control.",
    "url": "https://thehill.com/homenews/administration/4984559-white-house-trump-lame-duck-judicial-confirmations-senate/"
  },
  {
    "text": "How the Senate map explains Trump  —  TURNAROUND — As Democrats continue to shift into recrimination mode about exactly what happened last Tuesday evening, they've found blame in lots of places — demographic shifts, inflation, concerns about immigration and even the wide world of podcasts.",
    "url": "https://www.politico.com/newsletters/politico-nightly/2024/11/11/how-the-senate-map-explains-trump-00188929"
  },
  {
    "text": "Alexandria Ocasio-Cortez Directly Addresses People Who Voted For Both Her And Trump  —  “I'm listening,” the New York Democrat said.  —  LOADING  —  Rep. Alexandria Ocasio-Cortez (D-N.Y.) on Sunday reflected on Donald Trump's success in last week's election and engaged with supporters … ",
    "url": "https://www.huffpost.com/entry/aoc-trump-voters_n_67320370e4b052f25adcff55"
  },
  {
    "text": "A Look at Democratic Voter Turnout and Trump's Election Victory  —  Many Democrats failed to turn out to vote at the rate they did in 2020 when they ousted Donald Trump, according to an analysis of election data.  —  Voters in liberal strongholds across the country, from city centers to suburban stretches … ",
    "url": "https://www.nytimes.com/2024/11/11/us/politics/democrats-trump-harris-turnout.html"
  },
  {
    "text": "Trump Expected to Name Marco Rubio as Secretary of State  —  The president-elect appears to have settled on the Florida senator to be the nation's top diplomat.  —  President-elect Donald J. Trump is expected to name Senator Marco Rubio of Florida as his secretary of state … ",
    "url": "https://www.nytimes.com/2024/11/11/us/politics/trump-rubio-secretary-of-state.html?unlocked_article_code=1.ZU4.El0L.6KFa6omup__S&smid=url-share"
  },
  {
    "text": "Trump taps US Senator Marco Rubio for secretary of state  —  Donald Trump selected U.S. Senator Marco Rubio to be his secretary of state, the New York Times reported on Monday, putting the Florida-born politician on track to be the first Latino to serve as America's top diplomat once … ",
    "url": "https://www.reuters.com/world/us/trump-taps-us-senator-marco-rubio-secretary-state-2024-11-12/"
  },
  {
    "text": "Republicans win House, delivering Trump a trifecta  —  Republicans are projected to keep control of the House of Representatives, handing the party total control of Washington with former President Trump back in the White House in January.  —  Decision Desk HQ projected the GOP would hold … ",
    "url": "https://thehill.com/homenews/state-watch/4974235-house-republicans-control-majority/"
  },
  {
    "text": "Republicans win majority of US House seats in government sweep  —  President-elect Donald Trump's Republican Party will control both houses of Congress when he takes office in January, Decision Desk HQ projected on Monday, enabling him to push an agenda of slashing taxes and shrinking the federal government.",
    "url": "https://www.reuters.com/world/us/republicans-win-majority-us-house-seats-government-sweep-2024-11-12/"
  },
  {
    "text": "Musk Turning Himself Into the 'Guest Who Wouldn't Leave' at Mar-a-Lago  —  WORN-OUT WELCOME  —  The Tesla CEO is not expected to have an official position in Trump's incoming administration, but he's apparently weighing in on staffing decisions already being made in Florida.",
    "url": "https://www.thedailybeast.com/elon-musk-turning-himself-into-the-guest-who-wouldnt-leave-at-mar-a-lago/"
  },
  {
    "text": "Trump Selects Florida Rep. Mike Waltz as National Security Adviser  —  The congressman is known as a China hawk and NATO critic.",
    "url": "https://www.wsj.com/politics/national-security/trump-selects-florida-rep-mike-waltz-as-national-security-adviser-104414fe?st=kWsXC4&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Chris Wallace Quits CNN to Build Future in Streaming  —  The veteran broadcaster, 77, will walk away from his seven-figure role in a watershed moment for cable TV.  —  EXCLUSIVE  —  Chris Wallace is quitting CNN after three years as one of its biggest stars, he exclusively told the Daily Beast Monday.",
    "url": "https://www.thedailybeast.com/broadcaster-chris-wallace-quits-cnn-to-build-future-in-streaming-or-podcasting/"
  },
  {
    "text": "Trump picks Lee Zeldin to lead EPA — adding second NYer to cabinet  —  WASHINGTON — President-elect Donald Trump has selected former Rep. Lee Zeldin to serve as administrator of the Environmental Protection Agency, The Post can exclusively report.  —  Zeldin, 44, served four terms … ",
    "url": "https://nypost.com/2024/11/11/us-news/trump-picks-lee-zeldin-to-lead-epa-adding-second-nyer-to-cabinet/"
  },
  {
    "text": "He Went To A White Supremacist Event.  Now He'll Oversee Trump's Mass Deportations.  —  “We are going to have a historic deportation operation,” Tom Homan promised this summer.  —  LOADING  —  In February 2022, Tom Homan went to the Orlando World Center Marriott in Orlando, Florida … ",
    "url": "https://www.huffpost.com/entry/tom-homan-white-supremacist-event-border-czar-trump_n_67326794e4b07ebab74212ff"
  },
  {
    "text": "Warren: Trump transition ‘already breaking the law’  —  Sen. Elizabeth Warren (D-Mass.) said on Monday that President elect-Trump “and his transition team are already breaking” a law on presidential transition.  —  “Donald Trump and his transition team are already breaking the law,” Warren said in a post on the social platform X.",
    "url": "https://thehill.com/homenews/campaign/4984590-trump-transition-law-violation-elizabeth-warren/"
  },
  {
    "text": "Melania Trump expected to skip Wednesday White House meeting with Jill Biden  —  Melania Trump is not expected to attend the traditional White House meeting with first lady Jill Biden, sources familiar with her plans said.  —  It's a decision that underscores Melania Trump's long-held willingness … ",
    "url": "https://www.cnn.com/2024/11/11/politics/melania-trump-jill-biden/"
  },
  {
    "text": "Trump's shadow falls on Chinese solar giant  —  The United States' clean energy landscape is already changing just days after Donald Trump's election — as signs build of even bigger shake-ups to come.  —  Case in point: One of China's largest solar manufacturers — which had been slated … ",
    "url": "https://www.politico.com/newsletters/power-switch/2024/11/11/trumps-shadow-falls-on-chinese-solar-giant-00188747"
  },
  {
    "text": "‘Hail Hitler and hail Trump’: People wave Nazi flags outside Jewish play in Michigan  —  President-elect Donald Trump's reelection was credited for emboldening a group of people waving Nazi flags in Michigan over the weekend.  —  WLNS reported that the flags were seen in two cities, including at a Jewish play.",
    "url": "https://www.rawstory.com/nazi-flags-michigan/"
  },
  {
    "text": "COP29 climate summit begins today in Baku.  Will it be the last for the U.S.?  —  As delegates from nearly 200 countries gather for a major international summit on addressing the threat of climate change, they're confronting a new era of uncertainty for the United States' climate commitments … ",
    "url": "https://www.cbsnews.com/news/cop29-climate-change-summit-baku-azerbaijan/"
  },
  {
    "text": "Kevin Costner defends Liz Cheney: ‘We should applaud her.  We should protect her.’  —  Costner endorsed Cheney during the 2022 midterm elections in which she was defeated by Harriet Hageman amid her criticism of Donald Trump  —  Actor Kevin Costner on Monday defended Liz Cheney … ",
    "url": "https://www.foxnews.com/politics/kevin-costner-defends-liz-cheney-we-should-applaud-her-we-should-protect-her"
  },
  {
    "text": "FDA Recalls 80K Pounds of Costco Butter from Costco — Label Didn't Say ‘Contains Milk’  —  The U.S. Food and Drug Administration (FDA) ordered the recall of nearly 80,000 pounds of butter produced in Texas for Costco.  The agency ordered the recall because the product packaging contained no “Contains Milk” allergy statement.",
    "url": "https://www.breitbart.com/border/2024/11/11/fda-recalls-80000-pounds-of-butter-from-costco-in-texas-over-labeling-issue/"
  },
  {
    "text": "Rick Scott's MAGA momentum backfires in the Senate … - Scott has his supporters, there's no question. … At this point I won't vote for him for anything ever,\" one Republican told Axios.  — Senate offices are dealing with a flood of trolling on social media from Scott allies … ",
    "url": "https://www.axios.com/2024/11/11/rick-scott-senate-republican-leader-maga-trump"
  },
  {
    "text": "Trump Plans Series of Executive Orders for Day 1, Susie Wiles Tells Donors  —  Ms. Wiles, the next White House chief of staff, said Donald Trump would move quickly to reinstate orders from his first term that President Biden had revoked, though she did not specify which ones.",
    "url": "https://www.nytimes.com/2024/11/11/us/politics/trump-executive-orders-susie-wiles.html"
  },
  {
    "text": "David Remnick sounds off on the 2024 election, MAGA Media, Jeff Bezos, and more  —  “Tucker Carlson might lack the institutional home he once had, but his demagogic skills are much like those of Putin's TV mouthpieces.”  —  American media — and democracy itself — stands at a critical juncture … ",
    "url": "https://www.status.news/p/david-remnick-interview-2024-election"
  }
]