[
  {
    "text": "Ghislaine Maxwell received limited immunity during meetings with deputy attorney general: Sources  —  “She didn't hold anything back,” Maxwell's attorney said earlier.  —  Attorney General Pam Bondi and Deputy Attorney General Todd Blanche look on as US President Donald Trump (not on frame) … ",
    "url": "https://abcnews.go.com/US/deputy-ag-blanche-set-meet-2nd-day-ghislaine/story?id=124064062"
  },
  {
    "text": "After Ghislaine Maxwell Interview, Concerns Mount Over Possibility of Pardon  —  President Trump, asked whether he would consider pardoning her, said, “I'm allowed to do it, but it's something I haven't thought about.”  —  The yellowjacket buzz of a plane circling above the federal courthouse … ",
    "url": "https://www.nytimes.com/2025/07/25/us/politics/ghislaine-maxwell-trump-pardon.html"
  },
  {
    "text": "Under Siege From Trump and Musk, a Top Liberal Group Falls Into Crisis  —  Scrambling to pay legal fees, Media Matters has dialed back its criticism, trimmed its staff and contemplated closing entirely.  —  Media Matters, a nonprofit group that has played a key role in liberal politics … ",
    "url": "https://www.nytimes.com/2025/07/25/us/politics/media-matters-musk-crisis.html?unlocked_article_code=1.ZE8.uS77.aCoRbTwphEFY&smid=url-share"
  },
  {
    "text": "Immigration agents told a teenage US citizen: 'You've got no rights.' He secretly recorded his brutal arrest  —  Video from Kenny Laynez-Ambrosio, 18, puts fresh scrutiny on the harsh tactics used to reach the Trump administration's ambitious enforcement targets",
    "url": "https://www.theguardian.com/us-news/2025/jul/25/florida-teen-immigration-arrest"
  },
  {
    "text": "Cracks widen in Japan and US's interpretation of tariff trade deal  —  Tokyo officials contest Washington's claim that American investors assured of vast share of profits from joint investment  —  The US will secure 90 per cent of profits from joint investments with Japan only if it takes … ",
    "url": "https://t.co/0oMSSetSP7"
  },
  {
    "text": "Exclusive: US diplomats asked if non-whites qualify for Trump refugee program for South Africans  —  In early July, the top official at the U.S. embassy in South Africa reached out to Washington asking for clarification on a contentious U.S. policy: could non-whites apply … ",
    "url": "https://www.reuters.com/world/africa/us-diplomats-asked-if-non-whites-qualify-trump-refugee-program-south-africans-2025-07-25/"
  },
  {
    "text": "Texas GOP Rep. Giovanni Capriglione admits affair, denies abortion allegations  —  A conservative news site published an interview with a woman who alleges a 17-year affair with the Southlake representative, who said this week he wouldn't seek reelection.  —  Three days after state … ",
    "url": "https://www.texastribune.org/2025/07/25/giovanni-capriglione-affair-texas-house-republican/"
  },
  {
    "text": "Author of Texas Abortion Ban Denies He Paid for Abortions Amid Bombshell Allegations from Former Exotic Dancer  —  State Rep. Giovanni Capriglione, who authored Texas' “trigger ban” on abortion, said in a statement on Friday that he has never paid for an abortion.",
    "url": "https://thebarbedwire.com/2025/07/25/texas-politician-giovanni-capriglione-abortion-allegations/"
  },
  {
    "text": "Trump administration releases billions it withheld from schools  —  Lawmakers of both parties had lobbied to release the funds, which support English-language learning programs, teacher training and academic enrichment.  —  The Trump administration plans to release more than $5 billion … ",
    "url": "https://www.washingtonpost.com/education/2025/07/25/school-funds-released-trump-omb/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzNDE2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0Nzk4Mzk5LCJpYXQiOjE3NTM0MTYwMDAsImp0aSI6IjNjOGNiMWUzLTZmMmUtNDZhMi1hYmEzLTVkOTdmY2UxMDc5NCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9lZHVjYXRpb24vMjAyNS8wNy8yNS9zY2hvb2wtZnVuZHMtcmVsZWFzZWQtdHJ1bXAtb21iLyJ9.3mCH2y3aTnaeSxUmA3n_kUv_hzIXKmDPWXY2SiFtlE0"
  },
  {
    "text": "Education Department says it will release billions in remaining withheld grant money for schools  —  The Trump administration is releasing billions of dollars in grants to schools for adult literacy, English language instruction and other programs, the Education Department said Friday.",
    "url": "https://apnews.com/article/trump-education-freeze-school-grants-released-gop-f9ac79dd44595fc9d8a3c72609cb5574"
  },
  {
    "text": "FCC to Appoint a Babysitter to Make Sure CBS Isn't Anti-Trump  —  FCC commissioner Brendan Carr says CBS will have a “bias monitor” who reports directly to the president. … The Federal Communications Commission finally approved an $8 billion merger between Paramount and Skydance on Thursday … ",
    "url": "https://gizmodo.com/fcc-to-appoint-a-babysitter-to-make-sure-cbs-isnt-anti-trump-2000634566"
  },
  {
    "text": "Why Trump can't shake Epstein  —  And the gerrymandering arms race.  —  Transcript  —  On the latest episode of Nir & Rupar, our live weekly video show, David Nir of The Downballot and Aaron Rupar of Public Notice explain why, no matter what misdirection he attempts, Donald Trump just can't shake Jeffrey Epstein.",
    "url": "https://www.publicnotice.co/p/why-trump-cant-shake-epstein"
  },
  {
    "text": "Judge dismisses DOJ lawsuit against Illinois, Chicago over ‘sanctuary city’ policies  —  U.S. District Court Judge Lindsay C. Jenkins for the Northern District of Illinois Eastern Division said the Trump administration “lacks standing” to invalidate the state, city and county laws … ",
    "url": "https://www.washingtonpost.com/politics/2025/07/25/judge-dismisses-doj-illinois-chicago-immigration-lawsuit/"
  },
  {
    "text": "White House Seeks Payments From Other Universities—Including Harvard—After Columbia Deal Sets Precedent  —  The Trump administration is in talks with several schools about future funding following allegations of antisemitism  —  The White House is seeking fines from several universities … ",
    "url": "https://www.wsj.com/us-news/education/harvard-columbia-trump-white-house-fines-payment-deal-settlement-d61aa9c6?st=GFFNMs&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Second Whistleblower Backs Up Claims Emil Bove Told DOJ Lawyers To Defy Court Orders  —  A second whistleblower and former Justice Department attorney has come forward with evidence that corroborates allegations that Trump's judicial nominee Emil Bove directed DOJ attorneys to defy court orders … ",
    "url": "https://www.huffpost.com/entry/trump-tariffs-white-house-latest_n_686ec29fe4b09bd98fe4be7e/liveblog_6883c79ee4b0dc9c82941b6b"
  },
  {
    "text": "Convicted Murderer Released by Trump From Venezuelan Prison Is Free in U.S.  —  At least some American officials knew that Dahud Hanid Ortiz had been convicted of a triple murder when he was put on the plane to the United States.  —  He killed three people in Spain and fled to Venezuela … ",
    "url": "https://www.nytimes.com/2025/07/24/world/americas/trump-venezuela-convicted-murderer-swap.html?unlocked_article_code=1.ZE8.Z_6z.ysX5oJ-cHfjm&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Two Southwest flight attendants injured after jet moved to avoid another aircraft  —  Two flight attendants on a Southwest Airlines (LUV.N) flight departing from Burbank, California, were injured and being treated on Friday after pilots took evasive action to avoid another aircraft, the airline said.",
    "url": "https://www.reuters.com/world/us/two-southwest-flight-attendants-injured-after-jet-moved-avoid-another-aircraft-2025-07-25/"
  },
  {
    "text": "Judge blocks Trump's birthright citizenship restrictions in third ruling since high court decision  —  A federal judge on Friday blocked the Trump administration from ending birthright citizenship for the children of parents who are in the U.S. illegally, issuing the third court ruling blocking … ",
    "url": "https://apnews.com/article/immigration-birthright-citizenship-trump-3d94d355e1892baab810c9efddd1fd92"
  },
  {
    "text": "Two senior NOAA officials were just placed on leave.  Both led ‘Sharpiegate’ inquiry  —  Two high-ranking officials at the National Oceanic and Atmospheric Administration with a connection to the likely incoming NOAA administrator were placed on administrative leave Thursday … ",
    "url": "https://cnn.com/2025/07/25/weather/noaa-sharpiegate-hurricane-officials-trump"
  },
  {
    "text": "US states to get $608 million from FEMA to build migrant detention centers  —  The Federal Emergency Management Agency is preparing to send $608 million to states to construct immigrant detention centers as part of the Trump administration's push to expand capacity to hold migrants.",
    "url": "https://www.reuters.com/legal/government/us-states-get-608-million-fema-build-migrant-detention-centers-2025-07-25/"
  },
  {
    "text": "I Watched 20 Arrests In Trump's America.  Here's What They Looked Like.  —  “This is fishing in a stocked pool.  You tell them, ‘Show up at this location,’ and then they show up and you grab them,” one federal agent involved with immigration court arrests told HuffPost.",
    "url": "https://www.huffpost.com/entry/five-days-in-new-york-city-immigration-court-federal-agents_n_68640763e4b0aa65edbb4642"
  },
  {
    "text": "New Reports on Russian Interference Don't Show What Trump Says They Do … The Trump administration in recent weeks has released a series of reports intended to undermine the conclusion reached by intelligence agencies before President Trump's first term that Russia had favored his candidacy … ",
    "url": "https://www.nytimes.com/2025/07/25/us/trump-obama-russia.html?unlocked_article_code=1.ZU8.G1XD.fcxqFuw9_3i-&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "How Liberalism Sabotages Itself  —  Our intentional blindness to bad faith is a loophole fascists use to gain respectability and power.  —  The progressive journalist Mehdi Hasan recently participated in an episode of the popular online series Jubilee, which is a bit like speed-dating, but for public political debate.",
    "url": "https://www.offmessage.net/p/how-liberalism-sabotages-itself"
  },
  {
    "text": "U.S. Department of Education Finds Five Northern Virginia School Districts in Violation of Title IX  —  Today, the U.S. Department of Education's Office for Civil Rights (OCR) announced that it has concluded its investigation of five Northern Virginia school districts (the Divisions) … ",
    "url": "https://www.ed.gov/about/news/press-release/us-department-of-education-finds-five-northern-virginia-school-districts-violation-of-title-ix"
  },
  {
    "text": "Trump Spending $10 Million Of Taxpayer Money To Promote His Scotland Golf Course  —  The five-day trip will also raise his second-term golf tab to $52 million in just six months.  He spent $152 million during his first term.  —  WASHINGTON - American taxpayers will shell out at least $10 million … ",
    "url": "https://www.huffpost.com/entry/trump-scotland-golf-vacation_n_688278b0e4b01be72b3e620b"
  },
  {
    "text": "YouTuber Tim Pool Wants Answers—and Trusts No One  —  The right-wing streamer built an empire while stoking suspicion of the government and mainstream media.  Will President Trump be his next target?",
    "url": "https://www.wsj.com/business/media/podcaster-tim-pool-wants-answersand-trusts-no-one-a430ab06?st=KiRsje&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Tony Evers Did What Too Many Senior Democrats Have Not  —  Wisconsin's governor was well positioned to win a third term.  Instead, he cleared the way for a new generation of Democrats to run.  Others should take note.  —  Bluesky  —  Pocket  —  Wisconsin Governor Tony Evers gave Democrats … ",
    "url": "https://www.thenation.com/article/politics/tony-evers-retirement-generational-change/"
  },
  {
    "text": "Some Republicans push to undo gambling tax hike they passed in Trump's megabill  —  An outcry from bettors has caused some top GOP lawmakers to rethink a provision in Trump's bill.  Some say it was sloppily added.  Others say they didn't even know it was in the legislation.",
    "url": "https://www.nbcnews.com/politics/congress/republicans-gambling-tax-hike-trump-megabill-rcna220852"
  },
  {
    "text": "RFK Jr. to Oust Advisory Panel on Cancer Screenings, HIV Prevention Drugs  —  The task force determines which preventive services insurers must cover at no cost to patients  —  Health and Human Services Secretary Robert F. Kennedy Jr. is planning to remove all the members of an advisory panel … ",
    "url": "https://www.wsj.com/health/healthcare/rfk-health-screening-panel-members-c308cbb0"
  }
]