[
  {
    "text": "Trump Spurned by 30 Companies as He Seeks Bond in $454 Million Judgment  —  Donald J. Trump's lawyers said in a court filing that he faces “insurmountable difficulties” as he tries to raise cash for the civil fraud penalty he faces in New York.  —  Donald J. Trump's lawyers disclosed on Monday … ",
    "url": "https://www.nytimes.com/2024/03/18/nyregion/trump-bond-civil-fraud-case.html"
  },
  {
    "text": "Trump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New Team  — Former president eyeing loyalty, ideological agreement in pick  — Trump team aiming for smooth transition should he win election  —  Donald Trump has ruled out Vivek Ramaswamy as his running mate and is instead eyeing … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-18/trump-rules-out-ramaswamy-as-running-mate-as-he-eyes-new-team"
  },
  {
    "text": "Trump Says Jews Who Support Democrats ‘Hate Israel’ and ‘Their Religion’  —  The comments, on a conservative radio program, echo an antisemitic trope and escalate claims he made as president that were widely criticized.  —  Former president Donald J. Trump accused Jewish voters of hating … ",
    "url": "https://www.nytimes.com/2024/03/18/us/politics/trump-israel-jewish-voters.html"
  },
  {
    "text": "Behind Trump's campaign cash crunch: Small-dollar donor fatigue, major donor hesitation  — Former President Donald Trump is facing two major fundraising problems: A shortage of big money interest and a drop in small-dollar donor support.  — The drop in Trump's small-dollar contributors … ",
    "url": "https://www.cnbc.com/2024/03/18/trump-campaign-cash-crunch-small-dollar-donor-fatigue-major-donor-nerves.html"
  },
  {
    "text": "Is Donald Trump About to Go Bankrupt? … Debt is becoming a major campaign issue in 2024.  I don't mean the national debt, which today stands at 99 percent of gross domestic product and which, the Congressional Budget Office projects, will total 116 percent of GDP 10 years from now.",
    "url": "https://newrepublic.com/article/179879/trump-legal-debts-chubb-payment"
  },
  {
    "text": "Context collapse  —  On Saturday, Donald Trump spoke at a rally in Ohio.  Before he began, an announcer instructed the crowd to rise in tribute to the insurrectionists who stormed the Capitol on January 6, and Trump himself stood and saluted the national anthem as recorded by the “J6 Prison Choir.”",
    "url": "https://www.cjr.org/the_media_today/trump_ohio_speech_bloodbath_media_broadcast_live.php"
  },
  {
    "text": "Supreme Court says Trump White House official Peter Navarro must begin prison sentence  —  Navarro, who refused to cooperate with the Jan. 6 committee, wanted to remain free while he appealed his contempt of Congress conviction.  —  WASHINGTON − Former Trump adviser Peter Navarro … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/18/supreme-court-peter-navarro-trump-prison/72999868007/"
  },
  {
    "text": "Trump has been unable to get bond for $464 million judgment, his lawyers say  —  In a filing to an appeals court, Trump's attorneys said getting the bond needed to halt proceedings while they appeal is a “practical impossibility.”  —  Former President Donald Trump has not been able to get a bond … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-unable-get-bond-464-million-judgment-lawyers-say-rcna143860"
  },
  {
    "text": "The Good, Bad and Ugly in a New Poll on Trump's Trials and the Supreme Court  —  A new POLITICO Magazine/Ipsos poll suggests a conviction in the Manhattan trial could turn off independents.  —  Some Americans' opinions on Donald Trump's guilt may be a proxy for their views on him more generally … ",
    "url": "https://www.politico.com/news/magazine/2024/03/18/poll-conviction-trump-2024-elections-00147338"
  },
  {
    "text": "Supreme Court refuses to delay prison time for Trump aide Peter Navarro  —  Chief Justice John G. Roberts Jr. on Monday refused to delay prison time for Peter Navarro, a former senior aide to President Donald Trump, as he appeals his conviction for refusing to testify before Congress … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/18/navarro-supreme-court-prison-report/"
  },
  {
    "text": "Trump loses bid to block Michael Cohen, Stormy Daniels testimony at hush money trial  —  Donald Trump on Monday lost a bid to block testimony from Michael Cohen and Stormy Daniels at his upcoming trial on charges stemming from hush money that Cohen, his former lawyer and fixer, paid Daniels, a porn star, before the 2016 election.",
    "url": "https://www.reuters.com/world/us/judge-denies-trump-request-exclude-michael-cohens-testimony-hush-money-trial-2024-03-18/"
  },
  {
    "text": "Navarro's bid to stave off jail sentence denied at Supreme Court  —  His sentence is set to begin Tuesday.  —  Peter Navarro, a former trade adviser in Donald Trump's White House, appears to be heading to jail.  —  Chief Justice John Roberts on Monday turned down Navarro's emergency motion … ",
    "url": "https://www.politico.com/news/2024/03/18/peter-navarro-supreme-court-00147649"
  },
  {
    "text": "Pro-Trump lawyer arrested on bench warrant in Washington, D.C.  —  Stefanie Lambert, a Michigan lawyer who has championed dubious claims of election fraud, was arrested in Washington, D.C., Monday afternoon because of a bench warrant, according to a spokesman for the U.S. Marshals Service.",
    "url": "https://www.detroitnews.com/story/news/politics/2024/03/18/pro-trump-lawyer-stefanie-lambert-arrested-on-bench-warrant-in-washington-dominion-voting-elections/73023957007/"
  },
  {
    "text": "Ohio 2024 GOP Poll: Moreno 38%, Dolan 29%, LaRose 12%  —  Home Polls Ohio 2024 GOP Poll: Moreno 38%, Dolan 29%, LaRose 12%  —  The final Emerson College Polling Ohio Republican Primary poll, fielded Sunday-Monday before the Tuesday election, finds 38% of likely voters support Bernie Moreno, 29% Matt Dolan, and 12% Frank LaRose.",
    "url": "https://emersoncollegepolling.com/ohio-2024-gop-poll-moreno-38-dolan-29-larose-12/"
  },
  {
    "text": "EPA bans asbestos, a deadly carcinogen still in use decades after a partial ban was enacted  —  The Environmental Protection Agency on Monday announced a comprehensive ban on asbestos, a carcinogen that kills tens of thousands of Americans every year but is still used in some chlorine bleach, brake pads and other products.",
    "url": "https://apnews.com/article/epa-asbestos-cancer-brakes-biden-72b0fa8b36adedaff6000034d35c2acd"
  },
  {
    "text": "Justice Breyer, Off the Bench, Sounds an Alarm Over the Supreme Court's Direction  —  In an interview in his chambers and in a new book, the justice, who retired in 2022, discussed Dobbs, originalism and the decline of trust in the court.  —  Justice Stephen G. Breyer's Supreme Court chambers … ",
    "url": "https://www.nytimes.com/2024/03/18/us/breyer-supreme-court-interview.html"
  },
  {
    "text": "Tuberville says GOP leadership should have vetted claims in Katie Britt's speech  —  Sen. Tommy Tuberville (R-Ala.) said GOP leadership should have more carefully reviewed the claims in Sen. Katie Britt (R-Ala.)'s response to President Biden's State of the Union address as she faces criticism … ",
    "url": "https://thehill.com/homenews/senate/4540525-tuberville-says-gop-leadership-should-have-vetted-claims-in-katie-britts-speech/"
  },
  {
    "text": "Justice Jackson Complains First Amendment Is ‘Hamstringing’ Feds' Censorship Efforts  —  Free speech is on trial at the Supreme Court, and Justice Ketanji Brown Jackson is no fan of the First Amendment.  —  Free speech is on trial at the Supreme Court, but Justice Kentanji Brown Jackson is no fan of the First Amendment.",
    "url": "https://thefederalist.com/2024/03/18/justice-jackson-complains-first-amendment-is-hamstringing-feds-censorship-efforts/"
  },
  {
    "text": "Niger ordered US troops to leave after Biden officials warned about ties to Russia, Iran: Pentagon  —  Niger is pulling its military cooperation deal with the United States and ordering some 1,000 American military personnel to leave the country, a startling development that comes … ",
    "url": "https://thehill.com/policy/defense/4539830-niger-ends-us-military-deal/"
  },
  {
    "text": "What the Data Says About Pandemic School Closures, Four Years Later  —  The more time students spent in remote instruction, the further they fell behind.  And, experts say, extended closures did little to stop the spread of Covid.  —  Four years ago this month, schools nationwide began to shut down … ",
    "url": "https://www.nytimes.com/2024/03/18/upshot/pandemic-school-closures-data.html"
  },
  {
    "text": "Jan. 6 defendant got 2 congressional internships after she allegedly breached the building  —  Isabella DeLuca, who interned for two House Republicans, was charged on Monday by federal prosecutors.  —  In the three years since the Jan. 6 attack on the Capitol, Isabella DeLuca gained … ",
    "url": "https://www.politico.com/news/2024/03/18/jan-6-defendant-got-2-congressional-internships-after-she-allegedly-breached-the-building-00147674"
  },
  {
    "text": "“Obama would be jealous”: How Biden's rivalry with his ex-boss shapes his presidency … - “Obama would be jealous,” Biden sometimes says when speaking about a perceived accomplishment, according to two Biden aides familiar with such instances.  — The competitive dynamic has informed Biden's approach … ",
    "url": "https://www.axios.com/2024/03/18/biden-obama-rivalry-presidency"
  }
]