[
  {
    "text": "Inside House Dems' 11th-hour plot to sabotage Trump's agenda … - House Minority Leader Hakeem Jeffries (D-N.Y.) is already telling allies how he is preparing to lead the resistance to Trump, Axios' Hans Nichols reported.  — “We as Democrats have to roll up our sleeves and get into defense … ",
    "url": "https://www.axios.com/2024/11/11/house-democrats-trump-lame-duck"
  },
  {
    "text": "White House pushes back on Trump call to halt confirmations in lame duck period  —  A White House spokesperson on Monday pushed back on President-elect Trump's demand that the Democratic Senate stop confirming judges during the lame-duck period before he takes office and the upper chamber flips to GOP control.",
    "url": "https://thehill.com/homenews/administration/4984559-white-house-trump-lame-duck-judicial-confirmations-senate/"
  },
  {
    "text": "Alexandria Ocasio-Cortez Directly Addresses People Who Voted For Both Her And Trump  —  “I'm listening,” the New York Democrat said.  —  LOADING  —  Rep. Alexandria Ocasio-Cortez (D-N.Y.) on Sunday reflected on Donald Trump's success in last week's election and engaged with supporters … ",
    "url": "https://www.huffpost.com/entry/aoc-trump-voters_n_67320370e4b052f25adcff55"
  },
  {
    "text": "Trump expected to announce Stephen Miller as deputy chief of staff for policy  —  President-elect Donald Trump is expected to announce in the coming days that Stephen Miller, his top immigration adviser, will serve as White House deputy chief of staff for policy, two sources familiar with the plans told CNN.",
    "url": "https://www.cnn.com/2024/11/11/politics/stephen-miller-trump-administration/"
  },
  {
    "text": "Trump's Cabinet Picks Put a Further Strain on a Shrinking House Majority  —  Rep. Elise Stefanik said she was “deeply humbled” Trump picked her to serve in the administration.  But a two-seat majority “for us is basically us being in the minority,” one lawmaker said.  —  Haley Byrd Wilt and  Reese Gorman",
    "url": "https://www.notus.org/congress/elise-stefanik-congress-trump"
  },
  {
    "text": "A Look at Democratic Voter Turnout and Trump's Election Victory  —  Many Democrats failed to turn out to vote at the rate they did in 2020 when they ousted Donald Trump, according to an analysis of election data.  —  Voters in liberal strongholds across the country, from city centers to suburban stretches … ",
    "url": "https://www.nytimes.com/2024/11/11/us/politics/democrats-trump-harris-turnout.html"
  },
  {
    "text": "Trump picks Lee Zeldin to lead EPA — adding second NYer to cabinet  —  WASHINGTON — President-elect Donald Trump has selected former Rep. Lee Zeldin to serve as administrator of the Environmental Protection Agency, The Post can exclusively report.  —  Zeldin, 44, served four terms … ",
    "url": "https://nypost.com/2024/11/11/us-news/trump-picks-lee-zeldin-to-lead-epa-adding-second-nyer-to-cabinet/"
  },
  {
    "text": "Trump selects Lee Zeldin to lead EPA  —  President-elect Trump has selected former Rep.  Lee Zeldin (R-N.Y.) to lead the Environmental Protection Agency, putting a second New Yorker and loyalist into his forming Cabinet.  —  “I am pleased to announce that the Highly Respected former Congressman … ",
    "url": "https://thehill.com/homenews/administration/4984481-trump-lee-zeldin-epa/"
  },
  {
    "text": "Trump calls on GOP senators vying to be majority leader to agree to recess appointments  —  President-elect Donald Trump is demanding Republican senators vying to be majority leader support recess appointments for his nominees — a way for presidents to essentially bypass Congress that has recently been blocked by the minority party.",
    "url": "https://www.cnn.com/2024/11/10/politics/trump-senate-recess-appointments-gop-leader/"
  },
  {
    "text": "Elon Musk weighing in on Trump staffing decisions: Sources  —  Musk has been with Trump nearly every day since the election, sources say.  —  Elon Musk, chief executive officer of Tesla Inc., left, and Donald Trump, prior to a campaign event at the Butler Farm Show in Butler, Pennsylvania, Oct. 5, 2024.",
    "url": "https://abcnews.go.com/Politics/elon-musk-weighing-trump-staffing-decisions-sources/story?id=115730434"
  },
  {
    "text": "Democrat Cleo Fields wins re-drawn Louisiana congressional district, flipping red seat blue  —  Democrat Cleo Fields has won Louisiana's congressional race in a recently redrawn second majority-Black district, flipping a once reliably Republican seat blue.  Fields' win means Democrats will hold … ",
    "url": "https://apnews.com/article/democrat-cleo-fields-louisiana-congressional-district-01cbab22601bef1cd8f4463a1ad395ef"
  },
  {
    "text": "Starmer Pushes UK Climate Leadership as Trump Win Poses Threat  — British premier attends UN summit as other leaders stay away  — UK expected to unveil pledge on climate emissions in Baku  —  Prime Minister Keir Starmer said he wants the UK to assume a “global leadership” … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-11/starmer-pushes-uk-climate-leadership-as-trump-win-poses-threat"
  },
  {
    "text": "He Went To A White Supremacist Event.  Now He'll Oversee Trump's Mass Deportations.  —  “We are going to have a historic deportation operation,” Tom Homan promised this summer.  —  LOADING  —  In February 2022, Tom Homan went to the Orlando World Center Marriott in Orlando, Florida … ",
    "url": "https://www.huffpost.com/entry/tom-homan-white-supremacist-event-border-czar-trump_n_67326794e4b07ebab74212ff"
  },
  {
    "text": "Warren: Trump transition ‘already breaking the law’  —  Sen. Elizabeth Warren (D-Mass.) said on Monday that President elect-Trump “and his transition team are already breaking” a law on presidential transition.  —  “Donald Trump and his transition team are already breaking the law,” Warren said in a post on the social platform X.",
    "url": "https://thehill.com/homenews/campaign/4984590-trump-transition-law-violation-elizabeth-warren/"
  },
  {
    "text": "‘Hail Hitler and hail Trump’: People wave Nazi flags outside Jewish play in Michigan  —  President-elect Donald Trump's reelection was credited for emboldening a group of people waving Nazi flags in Michigan over the weekend.  —  WLNS reported that the flags were seen in two cities, including at a Jewish play.",
    "url": "https://www.rawstory.com/nazi-flags-michigan/"
  },
  {
    "text": "Trump transition figure warns DOJ lawyers: Get on board or get out  —  A conservative lawyer working on Donald Trump's transition, Mark Paoletta, offered a stark warning to career Justice Department lawyers Monday that those who refuse to advance Trump's agenda should resign or face the possibility of being fired.",
    "url": "https://www.politico.com/live-updates/2024/11/11/congress/mark-paoletta-justice-department-lawyers-00188772"
  },
  {
    "text": "Trump's Cabinet Could Include Senator Who Tried to Fight Hearing Witness: Report  —  Oklahoma Senator Markwayne Mullin is reportedly being considered for a position as head of the Department of Interior or Veterans Affairs  —  If you're in line for a position in President-Elect Donald Trump's cabinet … ",
    "url": "https://www.rollingstone.com/politics/politics-news/markwayne-mullin-trump-cabinet-position-1235162109/"
  },
  {
    "text": "Trump Plans Series of Executive Orders for Day 1, Susie Wiles Tells Donors  —  Ms. Wiles, the next White House chief of staff, said Donald Trump would move quickly to reinstate orders from his first term that President Biden had revoked, though she did not specify which ones.",
    "url": "https://www.nytimes.com/2024/11/11/us/politics/trump-executive-orders-susie-wiles.html"
  },
  {
    "text": "Rick Scott's MAGA momentum backfires in the Senate … - Scott has his supporters, there's no question. … At this point I won't vote for him for anything ever,\" one Republican told Axios.  — Senate offices are dealing with a flood of trolling on social media from Scott allies … ",
    "url": "https://www.axios.com/2024/11/11/rick-scott-senate-republican-leader-maga-trump"
  },
  {
    "text": "Authoritarianism Expert Shatters A Trump ‘Illusion’: ‘One Of The Biggest Scams Of All’  —  Ruth Ben-Ghiat said this reason for voting for Trump would have “very sad” consequences.  —  LOADING  —  Authoritarianism expert Ruth Ben-Ghiat spoke on MSNBC's “The Weekend” about one particular appeal … ",
    "url": "https://www.huffpost.com/entry/ruth-ben-ghiat-donald-trump-scam_n_6731e1a0e4b0231a203af70c"
  },
  {
    "text": "Kevin Costner defends Liz Cheney: ‘We should applaud her.  We should protect her.’  —  Costner endorsed Cheney during the 2022 midterm elections in which she was defeated by Harriet Hageman amid her criticism of Donald Trump  —  Actor Kevin Costner on Monday defended Liz Cheney … ",
    "url": "https://www.foxnews.com/politics/kevin-costner-defends-liz-cheney-we-should-applaud-her-we-should-protect-her"
  }
]