[
  {
    "text": "The Cruelty Isn't the Point.  It's the Pleasure.  —  Over the years, we've piled up some indelible images of gutless Republican surrender to Trump.  Ted Cruz's face of pure pain as he phone-banked for Trump in 2016.  Mitt Romney's rueful smile at dinner with Trump after that election.1 And now … ",
    "url": "https://www.thebulwark.com/p/the-cruelty-isnt-the-point-its-the"
  },
  {
    "text": "Zelensky and Trump Trade Blows as Feud Escalates Over Peace Talks  —  President Trump called Volodymyr Zelensky a “dictator” after the Ukrainian president took issue with his statements on the war with Russia.  — 2.3k  —  Constant Méheut and Anton Troianovski",
    "url": "https://www.nytimes.com/2025/02/19/world/europe/ukraine-zelensky-trump-russia-war.html?unlocked_article_code=1.yE4.LEYS.s7qNMoAirzdD&smid=url-share"
  },
  {
    "text": "After ceding power of the purse, GOP lawmakers beg Trump team for funds  —  Republican senators are asking Cabinet secretaries and other Trump officials to let money flow back into their states.  —  Republican senators find themselves in an unusual position these days … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/19/trump-musk-senators-funding/"
  },
  {
    "text": "‘You would see lawsuits:’ Susan Collins fires new warning shot at Trump on spending  —  The senior Republican senator negotiating a deal to avoid a government shutdown in less than one month says the Trump administration might be breaking the law — and flouting the U.S. Constitution.",
    "url": "https://www.politico.com/live-updates/2025/02/19/congress/susan-collins-elon-musk-warning-00204873"
  },
  {
    "text": "Trump faces growing DOGE revolt from GOP lawmakers … - DOGE's efforts to shutter the U.S. Agency for International Development, the Consumer Financial Protection Bureau and other agencies could bring matters to a head, one House Republican told Axios.  — “I think you're going to see a clash … ",
    "url": "https://www.axios.com/2025/02/19/donald-trump-doge-republicans-congress"
  },
  {
    "text": "One confirmed dead in Marana Regional Airport crash Wednesday morning  —  KGUN 9 has a crew on scene  —  MARANA, Ariz. (KGUN) — A crash has occurred at Marana Regional Airport, 11700 W. Avra Valley Road, Wednesday morning, KGUN 9 has confirmed with airport personnel.",
    "url": "https://www.kgun9.com/news/community-inspired-journalism/marana/marana-regional-airport-confirms-crash-wednesday-morning"
  },
  {
    "text": "Aircraft collision at Arizona airport leaves at least 1 person dead  —  The crash happened Wednesday at the Marana Regional Airport in Marana.  —  At least one person has died after two planes collided Wednesday morning at an Arizona airport, police said.  —  The crash happened … ",
    "url": "https://www.nbcnews.com/news/us-news/aircraft-collision-arizona-airport-leaves-least-1-person-dead-rcna192843"
  },
  {
    "text": "DOGE Says It's Saved $55 Billion; Data Show Much Less  — Cost-cutting effort itemizes about $8.6 billion in savings  — Data includes error that inflates value of DOGE savings so far  —  The federal cost-cutting effort dubbed the Department of Government Efficiency says it has saved $55 billion … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-19/doge-says-it-s-saved-55-billion-itemized-data-show-far-less"
  },
  {
    "text": "Did DOGE Take Credit for Spending Cuts Related to President Carter's Death?  —  Inaccuracies on DOGE's website raise questions about DOGE's activities and transparency.  —  Meet The Authors … Following the 2024 election, Elon Musk and Vivek Ramaswamy announced that the Department … ",
    "url": "https://www.lawfaremedia.org/article/did-doge-take-credit-for-spending-cuts-related-to-president-carter-s-death"
  },
  {
    "text": "DOGE Claimed It Saved $8 Billion in One Contract.  It Was Actually $8 Million.  —  The biggest single line item on the website of Elon Musk's cost-cutting team appears to include an error.  —  The Department of Government Efficiency, the federal cost-cutting initiative championed by Elon Musk … ",
    "url": "https://www.nytimes.com/2025/02/18/upshot/doge-contracts-musk-trump.html?unlocked_article_code=1.yE4.Qyxv.7AizyFV7824L"
  },
  {
    "text": "Trump's approval rating slips as Americans worry about the economy  —  U.S. President Donald Trump's approval rating has ticked slightly lower in recent days as more Americans worried about the direction of the U.S. economy as the new leader threatens a host of countries with tariffs, a Reuters/Ipsos poll found.",
    "url": "https://www.reuters.com/world/us/trumps-approval-rating-slips-americans-worry-about-economy-2025-02-19/"
  },
  {
    "text": "Trump's Job Approval Rating at 45%; Congress' Jumps to 29%  —  WASHINGTON, D.C. — Less than one month into his second term in office, President Donald Trump's job approval rating is at 45%, similar to his first post-inauguration reading of 47% in January.  —  Trump's ratings on several issues … ",
    "url": "https://news.gallup.com/poll/656891/trump-job-approval-rating-congress-jumps.aspx"
  },
  {
    "text": "Oops: Trump-Musk Cuts Just Wrecked an NIH Org Championed by GOPers  —  With co-Presidents Donald Trump and Elon Musk now inflicting deep cuts on federal agencies that sponsor medical research, thousands of scientists, researchers, and medical professionals are getting fired.",
    "url": "https://newrepublic.com/article/191702/trump-musk-national-institutes-health-wrecked"
  },
  {
    "text": "The DOGE Brain Drain Has Begun  —  THREE DAYS AFTER the National Institutes of Health abruptly announced it would place a strict, low cap on the money it sends to universities and research institutions for the administrative costs of scientific research, the University of Iowa made an abrupt announcement of its own.",
    "url": "https://www.thebulwark.com/p/the-doge-brain-drain-has-begun-science-government-cuts-budget-researchers"
  },
  {
    "text": "NYC congestion pricing axed as Trump pulls approval of hated toll  —  Congestion pricing, we hardly knew ye.  —  New York City's spectacularly unpopular congestion pricing scheme is on death row as the Trump administration will announce Wednesday it is pulling its approval of the toll … ",
    "url": "https://nypost.com/2025/02/19/us-news/nyc-congestion-pricing-axed-as-trump-pulls-approval-of-hated-toll/"
  },
  {
    "text": "How Americans view Elon Musk and Mark Zuckerberg  —  Americans' views of two prominent tech executives - Elon Musk and Mark Zuckerberg - tilt more negative than positive.  Musk is a deeply polarizing figure, with Republicans largely viewing him favorably and Democrats largely unfavorably.",
    "url": "https://www.pewresearch.org/short-reads/2025/02/19/how-americans-view-elon-musk-and-mark-zuckerberg/"
  },
  {
    "text": "Trump says ‘inflation is back’: ‘I had nothing to do with it’  —  President Trump is seeking to distance himself from a rise in inflation, arguing that the uptick had “nothing to do” with his return to the Oval Office.  —  Trump instead placed the blame on former President Biden in an interview Tuesday … ",
    "url": "https://thehill.com/homenews/administration/5152657-donald-trump-rising-inflation-doge-tariffs-economy/"
  },
  {
    "text": "Trump Media Group Sues Brazilian Judge Weighing Arrest of Jair Bolsonaro  —  The lawsuit came hours after the justice received an indictment of Brazil's former president, who is an ally of President Trump.  —  President Trump's media company sued a Brazilian Supreme Court justice on Wednesday … ",
    "url": "https://www.nytimes.com/2025/02/19/world/americas/trump-brazil-bolsonaro-judge.html?unlocked_article_code=1.yE4.S0nJ.QBE4wGqYxgGZ&smid=url-share"
  },
  {
    "text": "Migrants, Deported to Panama Under Trump Plan, Detained in Remote Jungle Camp  —  The group of unauthorized migrants, which includes children, were bused to the camp late Tuesday night.  “It looks like a zoo, there are fenced cages,” said one of the detainees.",
    "url": "https://www.nytimes.com/2025/02/19/world/americas/us-migrants-panama-jungle-camp.html?unlocked_article_code=1.yE4.hVp5.ktuqykyI4e38&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump administration orders Pentagon to plan for sweeping budget cuts  —  The directive, detailed in a memo dated Tuesday, exempts a handful of programs, including the president's expanded military mission along the U.S.-Mexico border.",
    "url": "https://www.washingtonpost.com/national-security/2025/02/19/trump-pentagon-budget-cuts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM5OTQxMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQxMzIzNTk5LCJpYXQiOjE3Mzk5NDEyMDAsImp0aSI6ImE4YmYwMzA5LTU0OTUtNDcwNi05N2UyLTAwZjRlYzMzMjE5NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzE5L3RydW1wLXBlbnRhZ29uLWJ1ZGdldC1jdXRzLyJ9.9StAqisJCLd4To7GKOHeJcKsZRTOPxPMcznFhvFtT2k&itid=gfta"
  },
  {
    "text": "Ensuring Accountability for All Agencies  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Policy and Purpose.  The Constitution vests all executive power in the President and charges him with faithfully executing the laws.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/02/ensuring-accountability-for-all-agencies/"
  },
  {
    "text": "A Frustrated Trump Wants His New Air Force One Planes Pronto  —  Among the ways being discussed to force faster delivery of two presidential planes are relaxing security clearances for Boeing workers and even purchasing a temporary luxury plane and retrofitting it.",
    "url": "https://www.nytimes.com/2025/02/19/us/politics/trump-musk-air-force-one-boeing.html"
  },
  {
    "text": "As measles outbreak rages in Texas, RFK Jr. pushes anti-vaccine message  —  The largest measles outbreak Texas has seen in over 30 years is sweeping through the western part of the state.  According to information released yesterday by the Texas Department of State Health Services, 58 cases have been confirmed throughout five counties.",
    "url": "https://popular.info/p/the-return-of-measles-and-the-rise"
  },
  {
    "text": "RFK 's plan to make America healthy again?  Round up people with mental health conditions in camps  —  Robert F. Kennedy wants to replace standard psychological care with unpaid labor on “wellness farms”  —  Robert F. Kennedy's “make America healthy again” motto is meant to convey … ",
    "url": "https://www.salon.com/2025/02/19/rfk-s-plan-to-make-america-healthy-again-round-up-people-with-mental-health-conditions-in-camps/"
  },
  {
    "text": "Musk's X in Talks to Raise Money at a $44 Billion Valuation  — Valuation is the same as Musk's 2022 Twitter acquisition  — Billionaire has recently tapped private markets for big sums  —  Elon Musk's X is in talks to raise money from investors at a $44 billion valuation, according to people familiar with the matter.",
    "url": "https://www.bloomberg.com/news/articles/2025-02-19/musk-s-x-is-in-talks-to-raise-money-at-a-44-billion-valuation"
  },
  {
    "text": "Why Democrats Won't Throw a Real Punch  —  Faced with existential threats from the right, the Democratic leadership remains timid; faced with demands for justice from the left, it goes on the attack.  —  Bluesky  —  Pocket  —  A relative of mine—an older gent with a penchant for salty language … ",
    "url": "https://www.thenation.com/article/politics/democratic-party-fecklessness/"
  },
  {
    "text": "‘It makes no logical sense’: A Mass. immigration judge is among more than 20 fired by Trump administration  —  In December, the Biden administration appointed Kerry Doyle to serve as a judge on Massachusetts' newest immigration court, which opened last year in Chelmsford to help ease the state's growing backlog of cases.",
    "url": "https://www.bostonglobe.com/2025/02/18/metro/trump-immigration-judges-fired-deportation-court-cases/"
  },
  {
    "text": "Tens of millions of dead people aren't getting Social Security checks, despite Trump and Musk claims  —  The Trump administration is falsely claiming that tens of millions of dead people over 100 years old are receiving Social Security payments.  Over the past few days … ",
    "url": "https://apnews.com/article/social-security-payments-deceased-false-claims-doge-ed2885f5769f368853ac3615b4852cf7"
  },
  {
    "text": "We are on the road for democracy and justice  —  What we are fighting for is not ‘utopian’ or unachievable.  Trumpism can and must be defeated  —  I will be doing town meetings in Omaha, Nebraska, this Friday night and Iowa City, Iowa, on Saturday morning.",
    "url": "https://www.theguardian.com/commentisfree/2025/feb/19/trumpism-bernie-sanders"
  },
  {
    "text": "Tesla's law firm drafts Delaware bill that could salvage Musk pay package … A law firm that represents Tesla and Elon Musk has written proposed legislation that would alter Delaware corporate law, according to a person directly familiar with the drafting of the bill who asked to remain unnamed in order to speak about the matter.",
    "url": "https://www.cnbc.com/2025/02/18/firm-representing-musk-tesla-drafts-bill-for-delaware-corporate-law.html"
  }
]