[
  {
    "text": "Biden offers fresh assurances he would shut down border ‘right now’ if Congress sends him a deal  —  Bidding to salvage a border deal in Congress that also would unlock money for Ukraine, President Joe Biden offered fresh assurances Saturday night that he would be willing to close … ",
    "url": "https://apnews.com/article/biden-border-deal-mexico-migration-south-carolina-b83f83ed39e59ebb38b7ff093da14706"
  },
  {
    "text": "Trump brags about efforts to stymie border talks: ‘Please blame it on me’  —  The Republican front-runner slams bipartisan talks in the Senate for a deal as Biden calls for emergency authority to address surging crossings  —  Republican front-runner Donald Trump said he wants to be held responsible … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/27/trump-border-biden/"
  },
  {
    "text": "House GOP unveils Mayorkas impeachment articles despite lack of evidence  —  House Republicans held two hearings on the inquiry and have struggled to detail clear evidence of high crimes and misdemeanors  —  House Republicans announced two articles of impeachment against Homeland Security … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/28/house-republicans-mayorkas-impeachment/"
  },
  {
    "text": "Falling inflation, rising growth give U.S. the world's best recovery  —  The European economy, hobbled by unfamiliar weakness in Germany, is barely growing.  China is struggling to recapture its sizzle.  And Japan continues to disappoint.  —  But in the United States, it's a different story.",
    "url": "https://www.washingtonpost.com/business/2024/01/28/global-economy-gdp-inflation/"
  },
  {
    "text": "Nikki Haley says the RNC is ‘clearly not’ an honest broker after calls to unify around Trump in primary  —  She acknowledged that she must do better in the South Carolina primary than in New Hampshire in order to continue her campaign.  —  Former South Carolina Gov. Nikki Haley blasted … ",
    "url": "https://www.nbcnews.com/politics/2024-election/nikki-haley-says-rnc-clearly-not-honest-broker-calls-unify-trump-prima-rcna135931"
  },
  {
    "text": "Carroll Promises to Do ‘Something Good’ With a Fortune Won From Trump  —  The writer was awarded $83.3 million for his defamation.  Now, she will have to figure out how to use it.  —  As soon as E. Jean Carroll heard the verdict on Friday — $83.3 million in defamation damages against Donald J. Trump … ",
    "url": "https://www.nytimes.com/2024/01/27/nyregion/e-jean-carroll-trump-interview.html"
  },
  {
    "text": "E. Jean Carroll Vows to ‘Do Something Good’ With Trump's $83.3 Million  —  ‘WOMEN WON THIS ONE’  —  E. Jean Carroll says the historic $83.3 million defamation verdict against Donald Trump earlier this week “bodes well for the future” and gives women a win when it's needed most.",
    "url": "https://www.thedailybeast.com/e-jean-carroll-vows-to-do-something-good-with-trumps-dollar833-million"
  },
  {
    "text": "US historians sign brief to support Colorado's removal of Trump from ballot  —  Twenty-five civil war and Reconstruction scholars support invoking 14th amendment to bar Trump from ballot over January 6  —  Twenty-five historians of the civil war and Reconstruction filed a US supreme court brief … ",
    "url": "https://www.theguardian.com/law/2024/jan/28/us-historians-sign-brief-to-support-colorados-removal-of-trump-from-ballot"
  },
  {
    "text": "Trump's $50 Million Mystery Debt Looks Like ‘Tax Evasion’  —  Donald Trump has long claimed he personally owed tens of millions to an obscure entity related to his Chicago tower.  But court docs claim Trump Org. now says it never existed.  —  Always read the footnotes.",
    "url": "https://www.thedailybeast.com/trumps-dollar50-million-mystery-debt-looks-like-tax-evasion"
  },
  {
    "text": "Biden administration discussing slowing some weaponry deliveries to Israel to pressure Netanyahu  —  U.S. officials are considering pausing or slowing some U.S. arms shipments to Israel to convince the government to heed U.S. calls to scale back its military assault in Gaza,",
    "url": "https://www.nbcnews.com/politics/white-house/biden-administration-discussing-slowing-weaponry-deliveries-israel-pre-rcna136035"
  },
  {
    "text": "First-of-its-kind campaign fundraiser in the works with Bill Clinton, Barack Obama and Biden  —  The Biden campaign is planning a spring fundraiser for the president to appear with his two Democratic predecessors.  —  WASHINGTON — President Joe Biden's campaign is trying to organize … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-campaign-fundraiser-president-bill-clinton-barack-obama-rcna136020?taid=65b655122fcc0f0001ff2a9b"
  },
  {
    "text": "Ohio, Michigan Republicans In Released Audio: “Endgame” Is To Ban Trans Care “For Everyone”  —  In audio released Friday evening, senators and representatives from Ohio and Michigan revealed the “endgame” is to ban transgender care “for everyone.” … Audio from a small Twitter Space featuring legislators … ",
    "url": "https://www.erininthemorning.com/p/ohio-michigan-republicans-in-released"
  },
  {
    "text": "The world's biggest meat processor — a major polluter — is coming to Wall Street  —  JBS wants to join the New York Stock Exchange.  The move could lead to rapid deforestation, critics say.  —  An unusual collection of Senate leaders, British lords, environmentalists and a secretive lobbying group … ",
    "url": "https://www.politico.com/news/2024/01/28/meat-giant-deforestation-jbs-00137084"
  },
  {
    "text": "Texas' Border Stunt Is Based on the Same Legal Theory Confederate States Used to Secede  —  Gov. Greg Abbott says the federal government has “broken the compact between the United States and the States” with its immigration policies. … A clash between Texas and the Biden administration … ",
    "url": "https://www.thedailybeast.com/texas-border-stunt-is-based-on-a-confederate-legal-theory"
  }
]