[
  {
    "text": "Lawyers found classified docs in Trump's bedroom 4 months after Mar-a-Lago search  —  The revelation was contained in a newly unsealed opinion that a federal judge issued in 2023.  —  Four months after the FBI raided his Mar-a-Lago estate, Donald Trump's attorneys discovered four documents marked “classified” in his personal bedroom.",
    "url": "https://www.politico.com/news/2024/05/21/trump-classified-documents-bedroom-00159182"
  },
  {
    "text": "Special counsel suspected additional obstruction effort by Trump in classified docs case  —  The allegations were revealed in a newly unsealed court filing Tuesday.  —  Former President Donald Trump listens during a news conference after attending the wake of New York City police officer Jonathan Diller … ",
    "url": "https://abcnews.go.com/US/special-counsel-suspected-additional-obstruction-effort-trump-classified/story?id=110438582"
  },
  {
    "text": "SHOCK POLL: Trump Tied With Biden in Blue New Hampshire  —  Democrats have all but owned the Granite State's four Electoral College votes, winning seven of the past eight presidential contests - including Joe Biden's eight-point victory over President Donald Trump in 2020.",
    "url": "https://nhjournal.com/shock-poll-trump-tied-with-biden-in-solid-blue-new-hampshire/"
  },
  {
    "text": "A Hidden Variable in the Presidential Race: Fears of ‘Trump Forever’  —  Undecided voters are concerned that if Donald Trump returns to the White House, he'll never leave.  —  As the rematch between Joe Biden and Donald Trump draws nearer, political professionals are detecting … ",
    "url": "https://www.bloomberg.com/news/features/2024-05-21/voters-fear-trump-won-t-leave-if-he-wins-2024-presidential-election"
  },
  {
    "text": "Kremlin TV Drops ‘New’ Tucker Carlson Show  —  THEY'LL NEVER LET GO  —  The former Fox News host has responded to becoming a fixture on Russian TV.  —  The Kremlin propaganda machine has made Tucker Carlson its newest star television host, whether he likes it or not.",
    "url": "https://www.thedailybeast.com/kremlin-tv-drops-new-tucker-carlson-show"
  },
  {
    "text": "Trump says he will ‘never advocate’ for contraception restrictions after earlier saying he's ‘looking at’ them  —  The social media post came after Trump said in a TV interview that he plans to share a policy on contraception “very shortly,” without providing details.",
    "url": "https://www.politico.com/news/2024/05/21/trump-contraception-abortion-00159118"
  },
  {
    "text": "‘Unified Reich’: Trump campaign goes full Nazi  —  In a shocking development - even by the Republican Party's low, low standards - Donald Trump has directly framed his campaign using Nazi terminology.  —  A video posted on his social media accounts yesterday promised a “unified Reich” if he wins the presidency in 2024.",
    "url": "https://www.theframelab.org/unified-reich-trump-campaign-goes-full-nazi/"
  },
  {
    "text": "Now, Biden's Gaza pier aid is being stolen  —  .  —  The Biden administration continues dreaming up ways to deliver aid to Gaza while knowing full well that aid is going to be stolen, likely by Hamas terrorists.  —  On Friday, 10 truckloads of food aid arrived at United Nations facilities in Gaza … ",
    "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/3011753/now-bidens-gaza-pier-aid-being-stolen/"
  },
  {
    "text": "Israeli officials seize AP equipment and take down live shot of northern Gaza, citing new media law  —  Israeli officials seized a camera and broadcasting equipment belonging to The Associated Press in southern Israel, accusing the news organization of violating a new media law by providing images to Al Jazeera.",
    "url": "https://apnews.com/article/live-transmission-israel-associated-press-57e8f662907334ba3599156276381190"
  },
  {
    "text": "Rep. Greg Murphy reveals skull tumor diagnosis, planned surgery … - He is an active member of the House Committee on Ways and Means, the Committee on Veterans' Affairs and the Committee on House Administration.  — “As a physician I have, for the last 30 years, taken care of thousands and thousands of patients.",
    "url": "https://www.axios.com/2024/05/21/skull-tumor-greg-murphy-north-carolina"
  },
  {
    "text": "Trump seems unlikely to testify.  Here's the latest.  —  The jury has been dismissed until closing arguments next Tuesday, but the court has more business to deal with this afternoon.  Lawyers for Donald J. Trump called just two witnesses before wrapping up their case.  —  The jury will begin deliberations next week.",
    "url": "https://www.nytimes.com/live/2024/05/21/nyregion/trump-trial-hush-money"
  },
  {
    "text": "Biden releasing 1 million barrels of gasoline from Northeast reserve in bid to lower prices at pump  —  The Biden administration said Tuesday that it is releasing 1 million barrels of gasoline from a Northeast reserve established after Superstorm Sandy in a bid to lower prices at the pump this summer.",
    "url": "https://apnews.com/article/gas-prices-biden-northeast-reserve-6fa669ef3c963d212852513e4b312060"
  },
  {
    "text": "Trump's Reported Fund-Raising Tops Biden's for First Time  —  The pace of giving to Donald Trump's campaign and the Republican Party picked up in April, according to his advisers.  But President Biden still has far more cash on hand.  —  Former President Donald J. Trump and the Republican Party … ",
    "url": "https://www.nytimes.com/2024/05/21/us/politics/trump-biden-fundraising.html"
  },
  {
    "text": "Harrison Butker is Catholic.  So What?  —  This is America: We need to tolerate a Catholic man saying Catholic things at a Catholic university.  —  Perhaps you have heard of Harrison Butker, the 28-year-old Kansas City Chiefs kicker at the center of the latest viral outrage.",
    "url": "https://www.thefp.com/p/harrison-butker-is-catholic"
  },
  {
    "text": "California pushes through Gavin Newsom's bill helping Arizona abortion-seekers  —  The measure is expected to go into effect imminently, just weeks after the blue-state governor made the proposal to take in patients from the neighboring state.  —  SACRAMENTO, Calif. … ",
    "url": "https://www.politico.com/news/2024/05/21/california-newsom-bill-arizona-abortion-00158274"
  },
  {
    "text": "Fani Willis, top prosecutor in Georgia Trump case, wins primary  —  Willis now proceeds to November's general election, where she will face Courtney Kramer, a Republican lawyer who interned in the Trump White House.  —  ATLANTA — Two of the most prominent figures in the Georgia criminal case … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/21/fani-willis-georgia-democratic-primary/"
  },
  {
    "text": "Low Energy, Part 2  —  Let me follow up about the comment TPM Reader HS got when she called the office of her state's senior senator, Alex Padilla.  She called insisting there should be some kind of investigation into the Justice Alito flag controversy.  When HS got through to Padilla's office … ",
    "url": "https://talkingpointsmemo.com/edblog/low-energy-part-2/sharetoken/GqTtixfpJuqz"
  },
  {
    "text": "Imprisoned ex-Trump aide Peter Navarro predicts Fed Chair's ouster and ‘mass deportations’ in a second presidential term  —  The Scoop  —  Federal Reserve Chair Jerome Powell would be gone in the first 100 days of a second Donald Trump term that would also include mass deportations … ",
    "url": "https://www.semafor.com/article/05/21/2024/imprisoned-ex-trump-aide-peter-navarro-predicts-ouster-of-fed-chair-jay-powell"
  },
  {
    "text": "Biden's approval rating falls to lowest level in nearly two years-Reuters/Ipsos poll  —  U.S. President Joe Biden's public approval rating this month fell to its lowest level in almost two years, tying the lowest reading of his presidency in a warning sign for his reelection effort, a Reuters/Ipsos poll showed.",
    "url": "https://www.reuters.com/world/us/bidens-approval-rating-falls-lowest-level-nearly-two-years-reutersipsos-poll-2024-05-21/"
  },
  {
    "text": "How Donald Trump's Financial Future Became Tied to Trump Media  —  Mr. Trump has treated Trump Media, which runs his social network Truth Social, as a low-cost sideshow.  Now a big portion of his wealth hinges on its success.  —  At Mar-a-Lago on a Wednesday evening last month … ",
    "url": "https://www.nytimes.com/2024/05/21/business/donald-trump-wealth-trump-media.html"
  },
  {
    "text": "Biden quietly advances a range of progressive policies  —  He did so just before a deadline on his rule-making authority.  —  ∙ Paid … Congress, in case you're just back from Mars, has been so mired in gridlock that its main function — passing laws — has become about as common as hens teeth.",
    "url": "https://www.publicnotice.co/p/biden-congressional-review-act-2024-deadline"
  }
]