[
  {
    "text": "We've Been Entertaining an Illusion About the Supreme Court.  It's Finally Been Shattered.  —  There will be no more self-soothing after this.  —  For three long years, Supreme Court watchers mollified themselves (and others) with vague promises that when the rubber hit the road … ",
    "url": "https://slate.com/news-and-politics/2024/04/supreme-court-immunity-arguments-which-way-now.html"
  },
  {
    "text": "Samuel Alito's Resentment Goes Full Tilt on a Black Day for the Court  —  On the day Donald Trump took office in January 2017, pondering what he might do to the country's democratic norms and institutions, I wrote these words: “Trump will destroy them, if keeping Trump on top requires it.  Or try to.",
    "url": "https://newrepublic.com/post/181023/samuel-alito-trump-immunity-black-day-supreme-court"
  },
  {
    "text": "The Trumpification of the Supreme Court  —  This article was featured in the One Story to Read Today newsletter.  Sign up for it here.  —  The notion that Donald Trump's supporters believe that he should be able to overthrow the government and get away with it sounds like hyperbole … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/trump-presidential-inmunity-supreme-court/678193/"
  },
  {
    "text": "Conservative Legal Philosophy Was All a Lie, Too  —  Great analysis of yesterday's oral arguments across The Bulwark: Kim Wehle was on the site and then talked with Mona and Gregg Nunziata on the livestream.  Sarah and George Conway did an emergency pod.  Andrew Egger had good stuff in Morning Shots.",
    "url": "https://www.thebulwark.com/p/conservative-legal-philosophy-was"
  },
  {
    "text": "SCOTUS majority abandons conservative principles to mount bizarre defense of Trump's immunity claim  —  Our justice system may leave Americans with one choice  —  Yesterday's message from the rightwing justices of the Supreme Court, particularly the male justices, was shocking to any believer in true … ",
    "url": "https://www.salon.com/2024/04/26/scotus-majority-abandons-conservative-principles-to-mount-bizarre-defense-of-trumps-immunity-claim/"
  },
  {
    "text": "Trump VP contender Kristi Noem writes of killing dog - and goat - in new book  —  South Dakota governor includes bloody tale in campaign volume - and admits 'a better politician ... wouldn't tell the story here'  —  In 1952, as a Republican candidate for vice-president … ",
    "url": "https://www.theguardian.com/books/2024/apr/26/trump-kristi-noem-shot-dog-and-goat-book"
  },
  {
    "text": "Biden Taunts Trump, Calling Him a ‘Loser,’ Trying to Get Under His Skin  —  President Biden has been trying to hit his opponent where it hurts, critiquing everything from his hairstyle to his energy levels in court.  —  This week, one presidential candidate has called the other a loser … ",
    "url": "https://www.nytimes.com/2024/04/26/us/politics/biden-trump-taunts.html"
  },
  {
    "text": "Election Updates: Biden says he is ‘happy to’ debate Trump, a notable shift.  —  Biden, asked if he's planning to debate Trump, says ‘I am happy to.’  —  President Biden said on Friday that he would participate in a general-election debate with former President Donald J. Trump … ",
    "url": "https://www.nytimes.com/live/2024/04/26/us/biden-trump-election"
  },
  {
    "text": "Florida GOP Rep. Posey abruptly announces retirement  —  He first won his deep-red seat in 2008.  —  TALLAHASSEE, Florida — Rep. Bill Posey (R-Fla.) abruptly announced on Friday that he will not seek reelection, after initially planning to run for another term.",
    "url": "https://www.politico.com/news/2024/04/26/florida-bill-posey-retirement-00154658"
  },
  {
    "text": "Scoop: Biden changes walking routine to Marine One … - Weeks ago the president told aides that he'd prefer a less formal approach, a White House official told Axios. … White House staffers and reporters alike noticed the sudden change in Biden's walk routine beginning in mid-April … ",
    "url": "https://www.axios.com/2024/04/26/biden-walkers-white-house-marine-one"
  },
  {
    "text": "Biden Administration Drops Plan to Ban Menthol Cigarettes  —  White House had been weighing health benefit of ban against angering Black voters  —  The Biden administration is reversing course on its plan to ban menthol cigarettes, after the White House weighed the potential public-health benefits … ",
    "url": "https://www.wsj.com/politics/policy/menthol-cigarette-ban-explained-0c41df7a"
  },
  {
    "text": "No One Has a Right to Protest in My Home  —  The difference between a private yard and a public forum  —  as a constitutional scholar and the dean of the UC Berkeley School of Law, I strongly defend the right to speak one's mind in public forums.  But the rancorous debate over the Israel-Hamas war seems … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/04/campus-protest-first-amendment-berkeley/678186/"
  },
  {
    "text": "Thieves snatch Rep. Adam Schiff's luggage in S.F. He gives dinner speech without a suit  —  Hello to the city, goodbye to your luggage.  That was Senatorial candidate Adam Schiff's rude introduction to San Francisco's vexing reputation for car burglaries Thursday when thieves swiped the bags … ",
    "url": "https://www.sfchronicle.com/bayarea/article/car-burglars-snatch-rep-adam-schiff-s-luggage-19424026.php"
  },
  {
    "text": "The dishonest — and ironic — push to blame campus protests on George Soros  —  There is very obviously an element of opposition to the ongoing protests on college campuses that is rooted in familiar partisan rhetoric.  The political right's hostility to college professors and insistences … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/26/dishonest-ironic-push-blame-campus-protests-george-soros/"
  },
  {
    "text": "Donald Trump Refusing To Go After David Pecker Raises Questions  —  Speculation has risen as to why Donald Trump has not risked violating his gag order to attack former National Enquirer publisher David Pecker following his damning testimony in the hush money trial.",
    "url": "https://www.newsweek.com/donald-trump-trial-david-pecker-national-enquirer-1894487"
  },
  {
    "text": "Trump's isolation deepens after his coup crew is hit with Arizona criminal indictments  —  The January 6 co-conspirators are likely too wrapped up in their criminal cases to help Trump with another coup  —  Because Donald Trump himself wasn't indicted, there was a surprisingly muted response … ",
    "url": "https://www.salon.com/2024/04/26/isolation-deepens-after-his-coup-crew-is-hit-with-arizona-criminal-indictments/"
  },
  {
    "text": "Maine Dems say they'll consider cutting off Trump's path, if Nebraska moves to hurt Biden  —  Converting the state's electoral votes to winner-take-all would likely erase any gains Trump would make in Nebraska.  —  If Nebraska Republicans changed their electoral college rules to help Donald Trump … ",
    "url": "https://www.politico.com/news/2024/04/26/maine-nebraska-electoral-votes-trump-00154645"
  }
]