[
  {
    "text": "Booting Trump off the ballot isn't just legally correct — it's the smart move for the Supreme Court  —  This is one of those rare situations where what's good for the country is also good for the GOP  —  Let's just get this out the way up front: If Donald Trump is removed from enough state ballots … ",
    "url": "https://www.salon.com/2023/12/20/booting-off-the-ballot-isnt-just-legally-correct--its-the-smart-move-for-the/"
  },
  {
    "text": "The Colorado Decision: Heads Trump Wins.  Tails America Loses.  —  1. The Sunshine State  —  I don't have a firm opinion about the Colorado Supreme Court's ruling that Donald Trump cannot appear on the state's presidential ballot.  —  As a matter of law, I can see it both ways.",
    "url": "https://plus.thebulwark.com/p/the-colorado-decision-heads-trump"
  },
  {
    "text": "Trump Asks Supreme Court to Put Off Hearing Case on Immunity Claim  —  The former president urged the justices to move slowly in his federal election interference case, an apparent attempt to delay the trial, set for March.  —  Former President Donald J. Trump urged the Supreme Court … ",
    "url": "https://www.nytimes.com/2023/12/20/us/politics/trump-supreme-court-immunity.html"
  },
  {
    "text": "‘I will beat him fair and square,’ Nikki Haley says after Colorado court disqualifies Trump  —  AGENCY, Iowa — Republican candidate Nikki Haley said Tuesday night “the last thing we want” is judges deciding who can and can't be on the presidential ballot after Colorado's high court ruled … ",
    "url": "https://www.desmoinesregister.com/story/news/elections/presidential/caucus/2023/12/19/nikki-haley-says-voters-should-decide-on-trump-after-colorado-supreme-court-blocks-him-from-ballot/71978047007/"
  },
  {
    "text": "Jan. 6 rioter nabbed in Bumble dating app sting pleads guilty to assaulting officers  —  Andrew Taake was turned in by a Bumble user who used the dating app to try to illicit confessions from Donald Trump supporters who took part in the Capitol attack.  —  WASHINGTON — Nearly three years ago … ",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-rioter-nabbed-bumble-dating-app-sting-pleads-guilty-assaulting-o-rcna130593"
  },
  {
    "text": "Capitol Rioter's High-School Classmate Gives Him Up to Feds  —  REVENGE OF THE NERDS  —  The FBI arrested a Minnesota man for his alleged role in the Jan. 6 riots after one of his high-school classmates told the feds he'd posted a selfie from the U.S. Capitol during the attack … ",
    "url": "https://www.thedailybeast.com/capitol-rioters-high-school-classmate-gives-him-up-to-feds"
  },
  {
    "text": "Lieutenant Governor Eleni Kounalakis Calls for Secretary of State Weber to Explore Legal Options to Remove Former President Donald Trump from California's 2024 Presidential Primary Ballot  —  Contact: Press@ltg.ca.gov, (916) 803-2191  —  SACRAMENTO - Today, Lieutenant Governor Eleni Kounalakis sent … ",
    "url": "https://ltg.ca.gov/2023/12/20/lt-governor-kounalakis-calls-for-secretary-of-state-weber-to-explore-legal-options-to-remove-former-president-donald-trump-from-californias-2024-presidential-primary-ballot/"
  },
  {
    "text": "U.S. to free ally of Venezuela's Maduro in exchange for 36 prisoners -source  —  The government of Venezuelan President Nicolas Maduro plans to release up to 36 people, including up to 12 Americans, in exchange for the U.S. government's release of a Maduro ally, two Venezuelan sources said on Wednesday.",
    "url": "https://www.reuters.com/world/us/us-has-freed-close-ally-venezuela-president-swap-jailed-americans-ap-2023-12-20/"
  },
  {
    "text": "Haley Ties DeSantis For First Time In GOP Primary, While Trump Still Dominates, With Biggest Lead To Date, Quinnipiac University National Poll Finds; Voter Support For U.S. Military Aid To Israel Dips  —  mail_outline  —  As the 2024 presidential race draws closer to primaries and caucuses getting underway … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3887"
  },
  {
    "text": "Speaker Mike Johnson and daughter were profiled attending ‘purity ball’ in 2015 German TV news segment  —  The unearthed segment is the latest example of Johnson's deeply held views.  —  A still image from a 2015 German news segment featuring Mike Johnson and his family.",
    "url": "https://abcnews.go.com/US/speaker-mike-johnson-daughter-profiled-attending-purity-ball/story?id=105785626"
  },
  {
    "text": "House Republicans land last-minute Ohio recruit for key House race  —  House Republicans launched a last-minute scramble to recruit state Rep. Derek Merrin.  —  House Republicans may have found a way to salvage their flailing prospects in a crucial swing seat.",
    "url": "https://www.politico.com/news/2023/12/20/derek-merrin-ohio-00132746"
  },
  {
    "text": "Xi warned Biden during summit that Beijing will reunify Taiwan with China  —  The Chinese leader's message in San Francisco got the attention of U.S. officials because it was delivered at a meeting that was intended to reduce tensions.  —  WASHINGTON — Chinese President Xi Jinping bluntly … ",
    "url": "https://www.nbcnews.com/news/china/xi-warned-biden-summit-beijing-will-reunify-taiwan-china-rcna130087"
  },
  {
    "text": "Pilot, photographer killed after Action News' Chopper 6 crashes in wooded area of New Jersey  —  The crew members have a long history with our station and have been working as part of the Action News team for years.  —  By, 6abc Digital Staff, Trish Hartman, Maggie Kent, and Katherine Scott",
    "url": "https://6abc.com/action-news-helicopter-6abc-chopper-6-crash-new-jersey-philadelphia-crew-wpvi-tv/14205051/"
  },
  {
    "text": "Lincoln Memorial steps vandalized with ‘Free Gaza’ graffiti  —  The steps of the Lincoln Memorial in Washington were vandalized overnight Tuesday with graffiti that read “Free Gaza,” among other phrases, according to U.S. Park Police and local news reports.  —  U.S. Park Police confirmed … ",
    "url": "https://thehill.com/homenews/state-watch/4369746-lincoln-memorial-steps-vandalized-with-free-gaza-graffiti/"
  },
  {
    "text": "Matt Gaetz fundraises off the possibility that the House will expel him like Santos  —  Following the expulsion of former New York Rep. George Santos, Rep. Matt Gaetz (R-FL) is fundraising off the possibility that the House might come after him next.  —  In a fundraising email sent Dec. 13 … ",
    "url": "https://www.washingtonexaminer.com/news/house/following-santos-expulsion-gaetz-fundraises-possibility-house-expel-him"
  },
  {
    "text": "42 percent of GOP Iowa caucusgoers say ‘poisoning the blood’ remarks make them more likely to support Trump: poll  —  Forty-two percent of likely Iowa Republican caucusgoers said that former President Trump's recent remarks about immigrants “poisoning the blood” of the country makes … ",
    "url": "https://thehill.com/homenews/campaign/4370059-42-percent-of-gop-iowa-caucus-goers-say-poisoning-the-blood-remarks-make-them-more-likely-to-support-trump-poll/"
  },
  {
    "text": "‘Incompetent dumpster fire’: Michigan GOP rocked by financial turmoil and infighting  —  The Mackinac Republican Leadership Conference often lures a who's who of GOP power players to Michigan.  Wealthy donors shake hands with presidential candidates, who give rousing speeches to packed audiences … ",
    "url": "https://www.cnn.com/2023/12/20/politics/michigan-gop-financial-turmoil-infighting-invs/"
  }
]