[
  {
    "text": "Liz Cheney, outspoken Trump critic, weighs third-party presidential run  —  The former congresswoman says she is determined to stop Trump.  Other Trump critics think a third-party candidacy could help him.  —  Liz Cheney, one of the most vociferous critics of Donald Trump in the Republican Party … ",
    "url": "https://www.washingtonpost.com/elections/2023/12/05/liz-cheney-trump-president-2024/"
  },
  {
    "text": "Fewer young Americans plan to vote in 2024, Harvard youth poll finds  —  The potential decline in participation by young voters could hurt President Biden in a potential matchup with former president Donald Trump.  —  Fewer voters under age 30 plan to vote in the upcoming presidential election … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/05/fewer-voters-harvard-youth-poll/"
  },
  {
    "text": "The anti-Trump alarm goes off  —  THE ANTI-TRUMP ALARM GOES OFF.  Around this time in 2015, some in the political commentary class had a collective realization: Donald Trump could win the 2016 Republican presidential nomination.  A freakout of sorts ensued, although many remained confident … ",
    "url": "https://www.washingtonexaminer.com/opinion/the-anti-trump-alarm-goes-off"
  },
  {
    "text": "Trump Rips Drudge Report For Covering Him ‘Unfairly’: ‘Site Fell Apart’  —  The former president praised the aggregation news site's downfall: ‘I love it!’  —  Former President Donald Trump over the weekend slammed conservative news aggregation site the Drudge Report in a Truth Social post for … ",
    "url": "https://themessenger.com/politics/trump-rips-drudge-report-for-covering-him-unfairly-site-fell-apart"
  },
  {
    "text": "Nikki Haley wants to reform Social Security and Medicare.  Donors are paying attention  —  As she woos her party's wealthy donors, former South Carolina Gov. Nikki Haley is promoting a policy that sets her apart from her closest competitors for the 2024 Republican presidential nomination … ",
    "url": "https://www.cnn.com/2023/12/05/politics/nikki-haley-social-security-medicare-reform/"
  },
  {
    "text": "Fetterman mocks Speaker Johnson over Biden impeachment inquiry push: ‘Oh no!’  —  Sen. John Fetterman (D-Pa.) went after Speaker Mike Johnson (R-La.) on Monday, mocking his effort for an impeach inquiry of President Biden over unproven claims of illicit family business deals.  —  “Oh, no, please, please don't!”",
    "url": "https://thehill.com/homenews/senate/4342520-fetterman-speaker-johnson-biden-impeachment/"
  },
  {
    "text": "Congress provided $7.5B for electric vehicle chargers.  Built so far: Zero.  —  The sluggish rollout could undermine President Joe Biden's reelection messaging promoting electric vehicles.  —  Congress at the urging of the Biden administration agreed in 2021 to spend $7.5 billion to build tens … ",
    "url": "https://www.politico.com/news/2023/12/05/congress-ev-chargers-billions-00129996"
  },
  {
    "text": "Top Democratic Donor, Reid Hoffman, Gives $250,000 to a Nikki Haley Super PAC  —  Mr. Hoffman, the co-founder of LinkedIn, has funded an array of anti-Trump candidates and causes.  —  When Jamie Dimon, the chief executive of JPMorgan Chase, urged Democratic donors last week to rally behind Nikki Haley … ",
    "url": "https://www.nytimes.com/2023/12/05/us/politics/nikki-haley-reid-hoffman-donation.html"
  },
  {
    "text": "Rep. Patrick McHenry, who briefly served as acting House speaker, will not seek reelection  —  Rep. Patrick McHenry (R-N.C.), who served as acting House speaker for three weeks in October while GOP lawmakers struggled to unite behind a permanent leader, will not seek reelection next year … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/05/patrick-mcchenry-not-seeking-reelection/"
  },
  {
    "text": "Gold bars featured in Sen. Bob Menendez bribery case are linked to a 2013 robbery, records show  —  A businessman told police that he was the victim of a robbery in 2013, and asked them to recover the 22 gold bars stolen.  Four bars were found a decade later in Menendez's home.",
    "url": "https://www.nbcnews.com/politics/congress/gold-bars-featured-bob-menendez-bribery-case-linked-2013-robbery-recor-rcna128006"
  },
  {
    "text": "Powerful members of Congress are dead-set on killing UFO transparency  —  Since 2020, no fewer than 10 former government officials, military officers and scientists, along with a former senate majority leader, have alleged (or suggested) publicly that the U.S. government has recovered advanced craft of unknown origin — that is, UFOs.",
    "url": "https://thehill.com/opinion/national-security/4341947-powerful-members-of-congress-are-dead-set-on-killing-ufo-transparency/"
  },
  {
    "text": "Sen. Rick Scott: 'I Don't See How' Florida GOP Leader Can Serve Amid Rape Investigation  —  Florida Sen. Rick Scott suggested Tuesday that the state GOP's chair, Christian Ziegler, should step aside as he faces a rape investigation.  —  Scott's written statement stopped short of clearly calling for Ziegler to step down.",
    "url": "https://themessenger.com/politics/sen-rick-scott-i-dont-see-how-florida-gop-leader-can-serve-amid-rape-investigation"
  },
  {
    "text": "Sen. Bernie Sanders opposes giving Israel $10 billion in aid  —  The White House has called on Congress to approve aid to Israel and Ukraine, but Republicans oppose any measure that excludes provisions to address security on the U.S.-Mexico border.  —  WASHINGTON — Sen. Bernie Sanders … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-bernie-sanders-opposes-giving-israel-10-billion-aid-rcna128102"
  },
  {
    "text": "Biography of civil rights leader Rep. John Lewis in the works  —  A biography of late civil rights pioneer and former Rep. John Lewis (D-Ga.), which will draw upon hundreds of interviews and classified documents and files, is in the works.  —  Publishing company Simon & Schuster announced Tuesday … ",
    "url": "https://thehill.com/blogs/in-the-know/4342908-biography-rep-john-lewis/"
  },
  {
    "text": "“Someone tell me what to do”  —  Across the country, states require more training to prepare students and teachers for mass shootings than for those expected to protect them.  The differences were clear in Uvalde, where children and officers waited on opposite sides of the door.",
    "url": "https://www.texastribune.org/2023/12/05/uvalde-officer-student-trainings-mass-shootings/"
  },
  {
    "text": "Higher Ed Has Become a Threat to America  —  Our corrupt, radical universities feed every scourge from censorship and crime to antisemitism.  —  America faces a formidable range of calamities: crime out of control, borders in chaos by design, children poorly educated while sexualized … ",
    "url": "https://www.wsj.com/articles/higher-ed-has-become-a-threat-to-america-antisemitism-dei-college-f52bb0b5?mod=followamazon"
  },
  {
    "text": "Comer Releases Direct Monthly Payments to Joe Biden from Hunter Biden's Business Entity  —  WASHINGTON—Today, House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) released subpoenaed bank records revealing Hunter Biden's business entity, Owasco PC, made direct monthly payments to Joe Biden.",
    "url": "https://oversight.house.gov/release/comer-releases-direct-monthly-payments-to-joe-biden-from-hunter-bidens-business-entity%EF%BF%BC/"
  }
]