[
  {
    "text": "Trump Finds Another Line to Cross  —  The former president used to exercise a modicum of restraint around Joe Biden's stutter.  No longer.  —  former president donald trump, perhaps threatened by President Joe Biden's well-received State of the Union address, mocked his opponent's lifelong stutter at a rally in Georgia yesterday.",
    "url": "https://www.theatlantic.com/politics/archive/2024/03/donald-trump-mocks-joe-bidens-stutter/677708/"
  },
  {
    "text": "Biden marks start of Ramadan by recognizing ‘moment of immense pain’ for Muslims  —  President Biden marked the start of Ramadan on Sunday with a statement recognizing the “moment of immense pain” for many Muslim Americans and pledging to lead international efforts to deliver humanitarian aid into Gaza.",
    "url": "https://thehill.com/homenews/administration/4523123-biden-marks-start-of-ramadan-by-recognizing-moment-of-immense-pain-for-muslims/"
  },
  {
    "text": "There should be newspapers that we work at where we do this  —  Katie Britt, the Republican junior United States senator from Alabama, became a national punchline Thursday night by delivering a  deeply bizarre and disastrous State of the Union rebuttal.  Social media was already going nuts … ",
    "url": "https://flaminghydra.com/there-should-be-newspapers-that-we-work-at-where-we-do-this/"
  },
  {
    "text": "Netanyahu vows to defy Biden's ‘red line’ on Rafah  —  Paul Ronzheimer is the deputy editor-in-chief of BILD and a senior journalist reporting for Axel Springer, the parent company of POLITICO.  —  TEL AVIV — Israeli Prime Minister Benjamin Netanyahu says he intends to press ahead … ",
    "url": "https://www.politico.eu/article/israels-netanyahu-says-he-will-defy-bidens-red-line-and-invade-rafah/"
  },
  {
    "text": "Netanyahu denies Palestinians are starving  —  Numerous world leaders and humanitarian charities have criticized Israel for not letting enough food aid into Gaza.  —  Paul Ronzheimer is the deputy editor-in-chief of BILD and a senior journalist reporting for Axel Springer, the parent company of POLITICO.",
    "url": "https://www.politico.eu/article/israel-pm-netanyahu-denies-palestinians-are-starving/"
  },
  {
    "text": "The Trump campaign paid an expert $750,000 to find fraud in the 2020 election, only for him to dismiss their complaints in minutes  — A new book sheds light on the lengths Trump's campaign went to find fraud in the 2020 election.  — Ken Block, a software engineer, revealed he was paid about $750,000 to help conduct the search.",
    "url": "https://www.businessinsider.com/ken-block-disproven-book-trump-campaign-election-fraud-2024-3"
  },
  {
    "text": "Trump campaign insider recounts failed hunt for 2020 fraud in new book  —  Ken Block, an expert hired by the campaign, writes that he shot down false claim after false claim in an election that was not stolen  —  The December 2020 claim of voter fraud was explosive, if true … ",
    "url": "https://www.washingtonpost.com/nation/2024/03/10/trump-ken-block-campaign-fraud-book/"
  },
  {
    "text": "Trump supporters hoping to oust Wisconsin leader say they have enough signatures to force recall  —  MADISON, Wis. (AP) — Backers of an effort to oust Wisconsin Republican Assembly Speaker Robin Vos from office over his opposition to former President Donald Trump announced Sunday … ",
    "url": "https://apnews.com/article/wisconsin-speaker-recall-robin-vos-c12e8391c9e254327c5de344b640d067"
  },
  {
    "text": "Kimmel knocks Britt for SOTU rebuttal at Oscars: She's an ‘adult woman with the brain of a child’  —  Jimmy Kimmel is taking a knock at Sen. Katie Britt at the Academy Awards for the Alabama Republican's much-mocked State of the Union rebuttal.  —  The late-night TV host took to the stage … ",
    "url": "https://thehill.com/homenews/4522991-kimmel-knocks-britt-for-sotu-rebuttal-at-oscars-shes-an-adult-woman-with-the-brain-of-a-child/"
  },
  {
    "text": "Elon Musk Has a Giant Charity.  Its Money Stays Close to Home.  —  After making billions in tax-deductible donations to his philanthropy, the owner of Tesla and SpaceX gave away far less than required in some years — and what he did give often supported his own interests.",
    "url": "https://www.nytimes.com/2024/03/10/us/elon-musk-charity.html"
  },
  {
    "text": "Democrats attack Senate GOP's wealthy “carpetbagger” candidates … - It's not unusual to see candidates move to the state they want to run in, but “carpetbagger” attacks can be potent. … - Democrats also hope to use the wealth of Republican candidates to convey the message that the GOP … ",
    "url": "https://www.axios.com/2024/03/10/senate-republicans-carpetbagger-wealthy"
  },
  {
    "text": "The Body Shop is closing down all US operations after filing for bankruptcy  —  The Body Shop announced this month that it has closed all its stores in the United States as it filed for bankruptcy.  —  The Body Shop Canada Limited, the Canadian subsidiary of the UK-based cosmetics company … ",
    "url": "https://thehill.com/business/4523260-the-body-shop-is-closing-down-all-us-operations-after-filing-for-bankruptcy/"
  },
  {
    "text": "Republican politico accused of ‘sexual torture’ and murder of pal in Alabama  —  A well-known GOP politico in Alabama has been charged with the “sexual torture” and murder of a man he knew.  —  Kyle Hayden Lewter, 36, allegedly killed Derek Franklin Walls, 54, of Harvest, Alabama … ",
    "url": "https://nypost.com/2024/03/10/us-news/ala-republican-politico-charged-with-sexual-torture-murder/"
  },
  {
    "text": "Meloni's Party Avoids Second Straight Defeat in Regional Ballot  — Victory in Abruzzo follows setback in Sardinia last month  — Marsilio is a member of hard-right Brothers of Italy party  —  Brothers of Italy's Marco Marsilio was reelected as governor of Abruzzo … ",
    "url": "https://www.bloomberg.com/news/articles/2024-03-11/meloni-s-party-avoids-second-straight-defeat-in-regional-ballot"
  },
  {
    "text": "Nancy Mace explodes at ABC host for rape ‘shaming’ her for supporting rapist Donald Trump  —  Rep. Nancy Mace (R-SC) exploded at ABC host George Stephanopoulos on Sunday after he asked why she supported Donald Trump after he was found liable for sexual assault.",
    "url": "https://www.rawstory.com/nancy-mace-shame/"
  }
]