[
  {
    "text": "Trump Takes the Dumbest Tariff Plunge  —  He says the 25% levies on Mexico and Canada will begin Tuesday.  Stocks fall.  —  President Trump likes to cite the stock market when it's rising as a sign of his policy success, so what does he think about Monday's plunge?",
    "url": "https://www.wsj.com/opinion/trump-takes-the-dumbest-tariff-plunge-5da57946"
  },
  {
    "text": "Statement by the Prime Minister on unjustified U.S. tariffs against Canada  — Statement by the Prime Minister on unjustified U.S. tariffs against Canada  —  The Prime Minister, Justin Trudeau, today issued the following statement on unjustified U.S. tariffs against Canada:",
    "url": "https://www.pm.gc.ca/en/news/statements/2025/03/03/statement-prime-minister-trudeau-on-unjustified-us-tariffs-against-canada"
  },
  {
    "text": "Trump Hit by Brutal Fox News Graphic on Tariffs as More Bad Polls Land  —  On Monday, while President Trump talked about his tariffs, Fox News showed him speaking even as a graphic in the corner displayed the markets sliding.  That said it all: No matter how much boasting he does about the economy … ",
    "url": "https://newrepublic.com/article/192262/trump-hit-brutal-fox-news-graphic-tariffs-bad-polls-land"
  },
  {
    "text": "Trump's Goal in Trade War Is to Annex Canada, Trudeau Says  — Canada discussing non-tariff measures against US, PM says  — US claims about Canada drug trafficking are ‘bogus’: Trudeau  —  US President Donald Trump's objective is to destroy Canada's economy so he can annex the country … ",
    "url": "https://www.bloomberg.com/news/articles/2025-03-04/trump-s-goal-in-trade-war-is-to-annex-canada-trudeau-says"
  },
  {
    "text": "Mexico to impose retaliatory tariffs on US following China and Canada as trade war heats up  —  Mexico President Claudia Sheinbaum said Tuesday that Mexico will respond to 25% tariffs imposed by the United States with its own retaliatory tariffs on U.S. goods.",
    "url": "https://apnews.com/article/trade-war-mexico-trump-9cefdded035a0b35e700a7ba0bfc34b4"
  },
  {
    "text": "Trump's trade war draws swift retaliation as Mexico, Canada and China impose tariffs on the US  —  President Donald Trump launched a trade war Tuesday against America's three biggest trading partners, drawing immediate retaliation from Mexico, Canada and China and sending financial markets … ",
    "url": "https://apnews.com/article/trump-tariffs-canada-mexico-china-643086a6dc7ff716d876b3c83e3255b0"
  },
  {
    "text": "No more town halls, NRCC chief tells House Republicans  —  The chair of the House GOP's campaign arm told Republican lawmakers Tuesday to stop holding in-person town halls amid a wave of angry backlash over the cuts undertaken by President Donald Trump's administration.",
    "url": "https://www.politico.com/live-updates/2025/03/04/congress/gop-town-halls-richard-hudson-00210024"
  },
  {
    "text": "Scoop: Some Dems plot to disrupt Trump's speech to Congress … - “The part that we all agree on is that this is not business as usual and we would like to find a way — productively — to express our outrage,” one House Democrat told Axios.  — There is widespread disagreement among Democrats … ",
    "url": "https://www.axios.com/2025/03/04/trump-congress-address-democrats-disrupt-plan"
  },
  {
    "text": "People Are Paying Millions to Dine With Donald Trump at Mar-a-Lago  —  Business leaders are paying as much as $5,000,000 to meet one-on-one with the president at his Florida compound, sources tell WIRED, while others are paying $1,000,000 apiece to dine with him in a group setting.",
    "url": "https://www.wired.com/story/people-paying-millions-donald-trump-mar-a-lago/"
  },
  {
    "text": "Trump Abruptly Walks Back His Directive To Fire Thousands Of Federal Employees  —  His administration is suddenly reversing course after a federal judge ruled that the mass firings of probationary workers were probably illegal.  —  WASHINGTON — President Donald Trump on Tuesday abruptly walked … ",
    "url": "https://www.huffpost.com/entry/trump-reverses-directive-fire-federal-employees_n_67c65042e4b044c440ed75bd"
  },
  {
    "text": "Ethical Concerns Surround Sen. Joni Ernst's Relationships With Top Military Officials Who Lobbied Her Committee  —  Earlier this year, the Air Force revealed that the general who oversaw its lobbying before Congress had inappropriate romantic relationships with five women, including three who worked on Capitol Hill.",
    "url": "https://www.propublica.org/article/joni-ernst-congress-military-relationships"
  },
  {
    "text": "Vance Ignites Outrage in Britain With ‘Random Country’ Comment  —  The vice president denied that he was talking about Britain and France when he downplayed “20,000 troops from some random country” protecting Ukraine.  No other countries have pledged troops.",
    "url": "https://www.nytimes.com/2025/03/04/us/politics/jd-vance-uk-random-country.html"
  },
  {
    "text": "Economic growth is slowing — so Trump wants to redefine “economic growth”  —  The government produces many of America's most important economic indicators.  And that data influences the media's coverage of the economy, which likely colors voters' views of the president.",
    "url": "https://www.vox.com/politics/402410/trump-musk-lutnick-gdp-economic-data"
  },
  {
    "text": "How Federal Workers Are Dealing With the $1 Limit on Their Corporate Cards  —  Most workers now have the spending limit on their government-issued plastic—rendering it functionally useless  —  WASHINGTON—For much of the federal workforce, pulling out a government credit card during … ",
    "url": "https://www.wsj.com/politics/policy/trump-doge-federal-credit-card-freeze-994bcf0e"
  },
  {
    "text": "Vengeance Is His  —  With Trump back in the White House, each new week produces an onslaught of radical policy initiatives.  —  In an essay posted on Substack, Stephen I. Vladeck, a law professor at Georgetown, described a sequence — running from Feb. 21 to Feb. 27 … ",
    "url": "https://www.nytimes.com/2025/03/04/opinion/trump-imperial-presidency.html?unlocked_article_code=1.1U4.Vs4c.my7GP-TSaNUf&smid=url-share"
  },
  {
    "text": "Secretary McMahon: Our Department's Final Mission  —  When I took the oath of office as Secretary of Education, I accepted responsibility for overseeing the U.S. Department of Education and those who work here.  But more importantly, I took responsibility for supporting over 100 million American children … ",
    "url": "https://www.ed.gov/about/news/speech/secretary-mcmahon-our-departments-final-mission"
  },
  {
    "text": "Non-core property list  —  We are identifying buildings and facilities that are not core to government operations, or non-core properties for disposal.  Selling ensures that taxpayer dollars are no longer spent on vacant or underutilized federal spaces.  Disposing of these assets helps … ",
    "url": "https://www.gsa.gov/real-estate/real-estate-services/real-property-disposition/noncore-property-list"
  },
  {
    "text": "How an Arizona DJ and karate instructor won Trump's ear on Ukraine  —  Until President Donald Trump quoted Michael McCune's Facebook post, it wasn't clear whether he remained interested in pursuing a minerals deal with Ukraine.  —  Just now  —  PHOENIX — In between deejaying weddings … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/04/arizona-trump-michael-mccune-ukraine/"
  },
  {
    "text": "EXCLUSIVE: A Hitler-quoting ‘Aryan’ has the attention of JD Vance and Elon Musk—who is @captivedreamer7?  —  The account, followed by JD Vance, previously boasted of being a white supremacist.  —  Days after the 2024 election, Vice President JD Vance followed @capitivedreamer7 … ",
    "url": "https://www.dailydot.com/debug/captive-dreamer-elon-musk-jd-vance/"
  },
  {
    "text": "Shell-Shocked at CBS  —  As Paramount's merger with Skydance nears the finish line, CBS News chief Wendy McMahon and “60 Minutes” boss Bill Owens have faced escalating pressure to settle Donald Trump's lawsuit—including from incoming president Jeff Shell.",
    "url": "https://www.status.news/p/paramount-cbs-60-minutes-lawsuit-settlement-talks"
  },
  {
    "text": "There Is No Musk Exception in the Constitution  —  It's difficult to convey the full magnitude of the legal chaos emanating from the Trump administration.  It goes well beyond the violation of individual laws — much of the past month has featured what feels like an assault on the very idea of law as a binding constraint.",
    "url": "https://www.nytimes.com/2025/03/04/opinion/elon-musk-trump-constitution.html?unlocked_article_code=1.1U4.Tdyf.eAhWW6iK9F1x&smid=url-share"
  },
  {
    "text": "BlackRock Strikes $23 Billion Deal for Ports on Both Sides of Panama Canal  —  A consortium of investors is buying a majority stake in the ports from CK Hutchison  —  A consortium of investors led by BlackRock has agreed to buy majority stakes in ports on both sides of the Panama Canal … ",
    "url": "https://www.wsj.com/business/logistics/blackrock-strikes-23-billion-deal-for-ports-on-both-sides-of-panama-canal-d42a5b5e"
  },
  {
    "text": "Supreme Court Deals Blow to E.P.A. in Dispute Over Federal Water Rules  —  The 5-to-4 decision is the latest setback for the agency and could have sweeping implications for curtailing water pollution offshore.  —  The Supreme Court sided with San Francisco on Tuesday in a challenge … ",
    "url": "https://www.nytimes.com/2025/03/04/us/politics/supreme-court-epa-water.html"
  },
  {
    "text": "Trump says federal funding will stop for colleges, schools allowing ‘illegal’ protests  —  President Donald Trump said on Tuesday that all federal funding will stop for colleges and schools that allow “illegal” protests and that agitators will be imprisoned or sent back to the country they came from.",
    "url": "https://www.reuters.com/world/us/trump-says-federal-funding-will-stop-colleges-schools-allowing-illegal-protests-2025-03-04/"
  }
]