[
  {
    "text": "Trump says Elon Musk will face ‘very serious consequences’ if he funds Democratic candidates  —  In an interview with NBC News, the president also said he assumes his relationship with the tech billionaire is over following their recent falling out.  —  President Donald Trump on Saturday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-elon-musk-consequences-funds-democratic-candidates-rcna211605"
  },
  {
    "text": "Inside the battles that shattered Trump and Musk's alliance  —  Trump called Musk “a big-time drug addict” in a phone call shortly after their public feud.  —  President Donald Trump was dejected, processing his very public split with the world's richest man.",
    "url": "https://www.washingtonpost.com/politics/2025/06/07/trump-elon-musk-fight-behind-scenes/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MjY4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNjUxMTk5LCJpYXQiOjE3NDkyNjg4MDAsImp0aSI6ImNhNTkwZWQyLTQ1ODMtNDZjOC1iZTFkLWU0OTYwMjg0NjhlOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA2LzA3L3RydW1wLWVsb24tbXVzay1maWdodC1iZWhpbmQtc2NlbmVzLyJ9.RkUPkArItHizAr7HCg185DaEzBhfES918Mvvu2Wf_2c&itid=gfta"
  },
  {
    "text": "NASA, Pentagon push for SpaceX alternatives amid Trump's feud with Musk  —  The fight between President Donald Trump and Elon Musk highlights the government's outsized dependence on a single company for missions.  —  NASA and Pentagon officials moved swiftly this week to urge competitors … ",
    "url": "https://www.washingtonpost.com/technology/2025/06/07/trump-musk-spacex-nasa-national-security/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MjY4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNjUxMTk5LCJpYXQiOjE3NDkyNjg4MDAsImp0aSI6ImVhNjUwNWE2LTA4NmYtNDg4Zi05YzhlLWEwNjk4YzYxODI4NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDYvMDcvdHJ1bXAtbXVzay1zcGFjZXgtbmFzYS1uYXRpb25hbC1zZWN1cml0eS8ifQ.Iila_cuA9PeViYr9JwWcIHNlu-o-svv5N1flR0uZGEg&itid=gfta"
  },
  {
    "text": "Elon Musk appears to delete some explosive X posts amid feud with Trump … Elon Musk has appeared to delete some of his posts on his social media platform X that escalated his bitter feud with President Donald Trump this week.  —  One post, no longer available as of Saturday morning … ",
    "url": "https://www.cnbc.com/2025/06/07/trump-musk-x-posts-feud.html"
  },
  {
    "text": "Trump advised Vance to take a diplomatic approach after Musk's blowup  —  Trump declined to go all-out in his attacks on Musk and counseled the vice president to show restraint in his comments about Musk, preserving a possible bridge.  —  While Elon Musk fired off social media posts excoriating … ",
    "url": "https://www.washingtonpost.com/politics/2025/06/07/trump-musk-vance/"
  },
  {
    "text": "Trump says he thinks the government has a ‘very easy case’ against Kilmar Abrego Garcia  —  In an interview with NBC News, the president said it was the Justice Department's decision, not his, to bring the Maryland man back to the U.S.  —  President Donald Trump on Saturday … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-thinks-government-easy-case-kilmar-abrego-garcia-rcna211606"
  },
  {
    "text": "White House security staff warned Musk's Starlink is a security risk  —  Starlink satellite connections in the White House bypass controls meant to stop leaks and hacking.  —  Elon Musk's team at the U.S. DOGE Service and allies in the Trump administration ignored White House communications experts worried … ",
    "url": "https://www.washingtonpost.com/technology/2025/06/07/starlink-white-house-security-doge-musk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5MjY4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwNjUxMTk5LCJpYXQiOjE3NDkyNjg4MDAsImp0aSI6IjFkMjZiM2ZmLWI1NWUtNDNiYS1iZDY4LWMyMWY3YWFhYTJhZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDYvMDcvc3Rhcmxpbmstd2hpdGUtaG91c2Utc2VjdXJpdHktZG9nZS1tdXNrLyJ9.HUMCoxKyZvfEtXsaid9wL2eW6I6JPvmH_8-vp_Yeoz4&itid=gfta"
  },
  {
    "text": "Los Angeles ICE raids spark protests, fear, outrage.  ‘Our community is under attack’  —  A series of surprise U.S. Immigration and Customs Enforcement sweeps in downtown Los Angeles on Friday prompted fierce pushback from elected officials and protesters, who decried the enforcement actions as … ",
    "url": "https://www.latimes.com/california/story/2025-06-06/la-me-ice-raids-protests-color-scene"
  },
  {
    "text": "Five Proud Boys leaders, including Philly resident Zach Rehl, want the government to pay them $100 million in restitution for Jan. 6 convictions  —  Zach Rehl, the former leader of the Philadelphia Proud Boys who was convicted of seditious conspiracy for his role in helping incite the Jan. 6 … ",
    "url": "https://www.inquirer.com/politics/proud-boy-lawsuit-illegal-prosecution-20250606.html"
  },
  {
    "text": "Proud Boys Freed by Trump Sue the Government for $100 Million  —  Once convicted of serious felonies, members of the extremist group now paint themselves as “patriotic” victims of political warfare  —  In a Bizarro World lawsuit against the federal government, Proud Boys who were pardoned … ",
    "url": "https://www.rollingstone.com/politics/politics-news/proud-boys-freed-trump-sue-government-1235358123/"
  },
  {
    "text": "The Great Un-Awokening  —  Presented by With help from Eli Okun and Bethany Irvine  —  Happy Saturday.  This is Adam Wren.  Get in touch.  —  President Donald Trump attends UFC-316 featuring Merab Dvalishvili vs. Sean O'Malley at 9:30 p.m.  —  DRIVING THE DAY",
    "url": "https://www.politico.com/newsletters/playbook/2025/06/07/the-great-un-awokening-00393429"
  },
  {
    "text": "Sikh man from Vineland criticized for leading Congress in prayer  —  After leading the U.S. House in a prayer with an entreaty to God to help people “remember that we belong to one family” on Friday, a Sikh man from South Jersey was the target of a highly critical social media post by U.S. Rep. Mary Miller … ",
    "url": "https://www.inquirer.com/politics/new-jersey/south-jersey-sikh-van-drew-congress-prayer-20250606.html"
  },
  {
    "text": "Neo-Nazi group ‘actively seeking to grow in US’ with planned paramilitary training event  —  The Base is emerging from shadows and ramping up its ranks as White House turns blind eye to the far right  —  An international neo-Nazi terrorist organization is boldly continuing to build in the US … ",
    "url": "https://www.theguardian.com/us-news/2025/jun/07/the-base-neo-nazi-group-paramilitary-training"
  },
  {
    "text": "The great poaching: America's brain drain begins  —  The Trump administration's spending cuts and restrictions on foreign students are triggering a brain drain — and American scientists are panicking.  —  Why it matters: U.S. researchers' fears are coming true.",
    "url": "https://www.axios.com/2025/06/07/us-science-brain-drain"
  },
  {
    "text": "After His Trump Blowup, Musk May Be Out.  But DOGE Is Just Getting Started.  —  With members embedded in multiple agencies, the team's approach to transforming government is becoming “institutionalized,” as one official put it.  —  With members embedded in multiple agencies … ",
    "url": "https://www.nytimes.com/2025/06/07/us/politics/trump-musk-doge-interior-epa.html?unlocked_article_code=1.NE8.xi_0.H-c1CNgicDl_&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Conservatives on SCOTUS give DOGE the go-ahead  —  A one-two punch: DOGE gets access to your data, but the public is restricted from getting information about DOGE.  —  On Friday afternoon, heading into the weekend, the U.S. Supreme Court told the Trump administration that the non-department Department … ",
    "url": "https://www.lawdork.com/p/conservatives-on-scotus-give-doge"
  },
  {
    "text": "There are only two commissioners left at the FCC  —  ﻿After two departures on Friday, parts of Brendan Carr's agenda are in limbo. … After the departure of one Republican and one Democratic commissioner on Friday, the Federal Communications Commission is down to two members … ",
    "url": "https://www.theverge.com/policy/681638/fcc-quorum-starks-simington-departure-brendan-carr"
  },
  {
    "text": "Trump stokes fear, confusion with pulled emergency abortion guidance  —  The Trump administration sowed confusion and fear among physicians with its move this past week to rescind Biden-era guidelines to hospitals that provide life-saving abortions.  —  While the move doesn't change the law … ",
    "url": "https://thehill.com/policy/healthcare/5337924-abortion-guidance-confusion-doctors/"
  },
  {
    "text": "Ohio food banks strain as Trump slashes federal aid programs  —  On a warm spring morning, volunteers at the Mid-Ohio Food Collective plucked cucumbers from a greenhouse where a state psychiatric hospital once stood and the land lay fallow.  Now the state's largest food bank is working that ground again … ",
    "url": "https://www.reuters.com/investigates/special-report/usa-trump-ohio/"
  }
]