[
  {
    "text": "Netanyahu says Israel ‘at war’ after Hamas attack; air force kills nearly 200 in Gaza air strikes  —  Israeli Prime Minister Benjamin Netanyahu said “we are at war, and we will win it” Saturday after Hamas launched an assault and took captives following the 50th anniversary of the start … ",
    "url": "https://www.washingtonpost.com/world/2023/10/07/israel-gaza-rocket-attack-hamas/"
  },
  {
    "text": "‘Jan. 6 choir’ member sentenced to 7 years in Capitol attack  —  A man who joined a nightly performance of the national anthem inside the D.C. jail that has been promoted by former president Donald Trump and his allies was sentenced to seven years in prison for assaulting police and obstructing Congress on Jan. 6.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/10/06/jenkins-jan-6-choir-member-sentence-attack/"
  },
  {
    "text": "Jim Jordan, Who's Running For Speaker, Played A Key Role In Trump's 2020 Election Plot  —  “Jim Jordan knew more about what Donald Trump had planned for Jan. 6 than any other member of the House,” former Rep. Liz Cheney (R-Wyo.) said.  —  LOADING  —  WASHINGTON ― … ",
    "url": "https://www.huffpost.com/entry/jim-jordan-speaker-january-6_n_65202c86e4b091a3dc271695"
  },
  {
    "text": "Robert F. Kennedy is headed for a breakup with the Democratic Party  —  Kennedy's expected independent presidential campaign is based on the conspiracy theory that the party has “rigged” the primaries against him.  —  Robert F. Kennedy Jr. appears headed for a breakup with the party … ",
    "url": "https://www.nbcnews.com/politics/2024-election/robert-f-kennedy-headed-breakup-democratic-party-rcna118646"
  },
  {
    "text": "Pentagon says it will support Israel after Netanyahu declares war  —  Defense Secretary Lloyd Austin said the U.S. stands squarely by Israel and will ensure it “has what it needs to defend itself” after Israeli Prime Minister Benjamin Netanyahu declared war against Palestinian militants that launched a surprise attack on his country.",
    "url": "https://thehill.com/policy/defense/4243366-pentagon-says-it-will-support-israel-after-leader-declares-war/"
  },
  {
    "text": "U.S. condemns Hamas ‘terrorism’ as attacks on Israeli civilians leave 40 dead  —  Senior national security officials have briefed President Joe Biden as Israel responds by striking targets in neighboring Gaza.  —  The U.S. on Saturday strongly condemned a surprise attack and incursion … ",
    "url": "https://www.politico.com/news/2023/10/07/hamas-terrorism-attacks-on-israeli-civilians-00120480"
  },
  {
    "text": "Kevin McCarthy considers resigning from the House before the end of his term  —  The deposed former speaker has made clear he plans to stay at least through the speakership election before ending his House career, two people familiar with the matter tell POLITICO.",
    "url": "https://www.politico.com/news/2023/10/06/kevin-mccarthy-considers-resigning-congress-00120381"
  },
  {
    "text": "Trump trial Day 5 highlights: Ex-Trump executive says Allen Weisselberg asked for help in committing tax fraud  —  Trump's New York civil fraud trial wraps up its first week … 25m ago / 9:41 PM UTC  —  Appeals court stays cancellation of Trump biz certificates  —  By Dareh Gregorian, Adam Reiss and Lisa Rubin",
    "url": "https://www.nbcnews.com/politics/live-blog/trump-fraud-trial-live-updates-rcna119144"
  },
  {
    "text": "Destroy Trump's old excuses instantly, then preemptively destroy his new ones @spocko@mastodon.online  —  Today's news on Trump's national security crimes:  —  Trump Leaked Nuclear Sub Secrets To Australian Businessman  —  Susie Madrak, Oct 6, 2023 Crooks and Liars",
    "url": "https://digbysblog.net/2023/10/06/destroy-trumps-old-excuses-instantly-then-preemptively-destroy-his-new-ones-spockomastodon-online/"
  },
  {
    "text": "Empty speaker's office aggravates House-Senate beef  —  It's not just increased fears about a shutdown.  Senators would consider themselves lucky to end the year without a catastrophe.  —  The chaos-ridden, speaker-less House is threatening to stymie a host of bipartisan legislative efforts across … ",
    "url": "https://www.politico.com/news/2023/10/07/house-speaker-shutdown-mccarthy-00120146"
  },
  {
    "text": "Republicans bash Hillary Clinton for floating ‘formal deprogramming’ of Trump supporters  —  Clinton referred to half of Trump's supporters as belonging in ‘basket of deplorables’ before losing to former president in 2016  —  Republicans bashed former Democratic presidential candidate Hillary Clinton … ",
    "url": "https://www.foxnews.com/politics/republicans-bash-hillary-clinton-floating-formal-deprogramming-trump-supporters"
  },
  {
    "text": "X rolls out new ad format that can't be reported, blocked  —  The new ads also don't disclose who the advertiser is or that they are even ads.  —  X, the Elon Musk-owned platform formerly known as Twitter, has begun serving its users with a weird new ad format and it's one of the company's least transparent products yet.",
    "url": "https://mashable.com/article/twitter-x-new-clickbait-ad-format"
  },
  {
    "text": "Michael Benz, a rising voice for conservative criticism of online censorship, appears to have a secret history as an alt-right persona  —  Frame Game, the pseudonym of an alt-right internet personality, hid his face while pushing racist conspiracy theories.  Inadvertent slips revealed details about his identity.",
    "url": "https://www.nbcnews.com/tech/internet/michael-benz-rising-voice-conservative-criticism-online-censorship-rcna119213"
  },
  {
    "text": "Should you believe the polls or the special elections?  There's a third way: Virginia.  —  The close race for control of the state legislature will tell us a lot about which party has the upper hand going into next year.  —  RICHMOND, Va. — Next month's Virginia state legislative election … ",
    "url": "https://www.politico.com/news/2023/10/07/virginia-legislative-elections-2024-00120467"
  },
  {
    "text": "The final 11 seconds of a fatal Tesla Autopilot crash  —  A reconstruction of the wreck shows how human error and emerging technology can collide with deadly results  —  The sun had yet to rise in Delray Beach, Fla., when Jeremy Banner flicked on Autopilot.",
    "url": "https://www.washingtonpost.com/technology/interactive/2023/tesla-autopilot-crash-analysis/"
  },
  {
    "text": "Leaders of “Genesis II Church of Health and Healing,” who sold toxic bleach as fake “Miracle” cure for COVID-19 and other serious diseases, sentenced to more than 12 years in federal prison  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of Florida",
    "url": "https://www.justice.gov/usao-sdfl/pr/leaders-genesis-ii-church-health-and-healing-who-sold-toxic-bleach-fake-miracle-cure"
  }
]