[
  {
    "text": "How to Force Justices Alito and Thomas to Recuse Themselves in the Jan. 6 Cases  —  Many people have gloomily accepted the conventional wisdom that because there is no binding Supreme Court ethics code, there is no way to force Associate Justices Samuel Alito and Clarence Thomas to recuse themselves … ",
    "url": "https://www.nytimes.com/2024/05/29/opinion/alito-thomas-recuse-trump-jan-6.html"
  },
  {
    "text": "Alito Refuses to Recuse: ‘My Wife Is Fond of Flying Flags’  —  The Supreme Court justice threw his wife under the bus after far-right flags were seen flying outside of his homes  —  Supreme Court Justice Samuel Alito has finally responded to concerns about his ability to remain impartial … ",
    "url": "https://www.rollingstone.com/politics/politics-news/samuel-alito-refuses-recuse-flags-1235029552/"
  },
  {
    "text": "Trump congratulates Alito for rejecting recusal calls amid flag flap  —  He said the justice showed “INTELLIGENCE, COURAGE, and ‘GUTS.’”  —  Donald Trump praised Supreme Court Justice Samuel Alito for rejecting calls to recuse himself from two pending cases involving the former president … ",
    "url": "https://www.politico.com/news/2024/05/29/trump-samuel-alito-flags-00160484"
  },
  {
    "text": "Roanoke College Poll: Biden and Trump tied in Virginia  —  President Joe Biden and former President Donald Trump are tied (42%-42%) in a head-to-head matchup in Virginia, while Biden holds a two-point lead (40%-38%) when other candidates are included, according to the Roanoke College Poll.",
    "url": "https://www.roanoke.edu/news/rc_poll_politics_may_2024"
  },
  {
    "text": "Inside Donald Trump and Elon Musk's Growing Alliance  —  Donald Trump is weighing an advisory role for the Tesla leader in the event the former president reclaims the White House",
    "url": "https://www.wsj.com/politics/donald-trump-elon-musk-alliance-d1fe43e3"
  },
  {
    "text": "Texas GOP Platform Endorses Death Penalty for Abortion Patients  —  We need to talk about Plank 35 in the Texas GOP platform.  Because while there's been lots of coverage about how extremist the state's Republican convention was, people seem to have missed the fact that delegates adopted … ",
    "url": "https://jessica.substack.com/p/texas-gop-platform-endorses-death"
  },
  {
    "text": "Florida sticks by social studies standard teaching ‘benefit’ of slavery  —  The updated standards include new required instruction surrounding the Sept. 11 attacks and the history of Asian Americans and Pacific Islanders, as well as several other more subtle changes.",
    "url": "https://www.politico.com/news/2024/05/29/florida-education-aapi-slavery-00160431"
  },
  {
    "text": "Trump Boasted About Sex With Stormy in Tahoe, Athlete Says  —  SUB PAR  —  The athlete also told The Daily Beast that in the run-up to the 2016 election he received anonymous calls from strangers asking what he remembered of the weekend. … Donald Trump boasted about having sex … ",
    "url": "https://www.thedailybeast.com/trump-boasted-about-sex-with-stormy-in-tahoe-athlete-says"
  },
  {
    "text": "Once a Sheriff's Deputy in Florida, Now a Source of Disinformation From Russia  —  In 2016, Russia used an army of trolls to interfere in the U.S. presidential election.  This year, an American given asylum in Moscow may be accomplishing much the same thing all by himself.",
    "url": "https://www.nytimes.com/2024/05/29/business/mark-dougan-russia-disinformation.html"
  },
  {
    "text": "ACLU of Louisiana Denounces Governor Jeff Landry's Signing of Bill Restricting Public Observation of Police  —  NEW ORLEANS—Alanah Odoms, Executive Director of the ACLU of Louisiana, has released the following statement in response to Governor Jeff Landry's signing of HB 173.",
    "url": "https://www.laaclu.org/en/press-releases/aclu-louisiana-denounces-governor-jeff-landrys-signing-bill-restricting-public"
  },
  {
    "text": "Google won't comment on a potentially massive leak of its search algorithm documentation … Google's search algorithm is perhaps the most consequential system on the internet, dictating what sites live and die and what content on the web looks like.  But how exactly Google ranks websites … ",
    "url": "https://www.theverge.com/2024/5/28/24166177/google-search-ranking-algorithm-leak-documents-link-seo"
  },
  {
    "text": "Biden: If Black Americans stormed the Capitol, Trump wouldn't be ‘talking about pardons’  —  The remarks came as the campaign launched a new Black voter outreach strategy in Philadelphia.  —  President Joe Biden tore into Donald Trump over his record on race on Wednesday … ",
    "url": "https://www.politico.com/news/2024/05/29/biden-trump-birtherism-black-voters-00160502"
  },
  {
    "text": "Top Biden aides signal openness to letting Ukraine strike Russia with US weapons  —  No final decision has been made, but the consideration comes amid mounting pressure from allies and Democrats.  —  Two senior Biden administration officials Wednesday opened the door to allowing Ukraine … ",
    "url": "https://www.politico.com/news/2024/05/29/biden-aides-signal-openness-to-allowing-ukraine-to-strike-russia-with-us-weapons-00160462"
  },
  {
    "text": "RFK Jr. files complaint with Federal Election Commission over CNN debate criteria  —  Robert F. Kennedy Jr.'s campaign filed a complaint with the Federal Election Commission on Tuesday alleging President Joe Biden's campaign, former President Donald Trump's campaign and CNN violated federal campaign laws … ",
    "url": "https://www.cnn.com/2024/05/29/politics/rfk-jr-fec-complaint-cnn-debate/"
  },
  {
    "text": "Mother of Jan. 6 officer Michael Fanone swatted after he called Trump ‘authoritarian’  —  Fanone was abducted by the mob on Jan. 6 and nearly killed when a MAGA-hatted rioter who believed Donald Trump's lies about the 2020 election drove a stun gun into his neck.",
    "url": "https://www.nbcnews.com/politics/justice-department/mother-jan-6-officer-michael-fanone-swatted-called-trump-authoritarian-rcna154467"
  },
  {
    "text": "911 S5 Botnet Dismantled and Its Administrator Arrested in Coordinated International Operation  —  For Immediate Release  —  Botnet Infected Over 19M IP Addresses to Enable Billions of Dollars in Pandemic and Unemployment Fraud, and Access to Child Exploitation Materials",
    "url": "https://www.justice.gov/opa/pr/911-s5-botnet-dismantled-and-its-administrator-arrested-coordinated-international-operation"
  },
  {
    "text": "Live Updates: Jury Begins Deciding Trump's Fate in Hush-Money Case  —  Twelve New Yorkers have begun deliberations on the 34 felony counts against Donald Trump in the first criminal trial of an American president.  He is accused of falsifying business records in connection with a payment to a porn star.",
    "url": "https://www.nytimes.com/live/2024/05/29/nyregion/trump-trial-hush-money"
  },
  {
    "text": "Jenna Ellis, ex-Trump campaign legal adviser, has Colorado law license suspended for 3 years  —  Washington — Jenna Ellis, who served as a legal adviser to former President Donald Trump during the 2020 election, is barred from practicing law in the state of Colorado for three years … ",
    "url": "https://www.cbsnews.com/news/jenna-ellis-ex-trump-campaign-legal-adviser-colorado-law-license-suspended/"
  },
  {
    "text": "Life on Ukraine's front line: ‘Worse than hell’ as Russia advances  —  Ukraine's soldiers talk of exhaustion, faith, personal loss and a perilous shortage of munitions as Russian forces take new ground.  Reuters traveled along the front line, where Ukrainian troops say Vladimir Putin must be beaten back.",
    "url": "https://www.reuters.com/investigates/special-report/ukraine-war-frontline/"
  },
  {
    "text": "Phil Scott allows ‘ghost guns,’ union organizing bills to become law without his signature  —  Republican Gov. Phil Scott on Tuesday evening allowed two bills to go into law without his signature: one that bans unserialized firearms and another that aims to make it easier for employees to organize unions.",
    "url": "https://vtdigger.org/2024/05/28/phil-scott-allows-ghost-guns-union-organizing-bills-to-become-law-without-his-signature/"
  }
]