[
  {
    "text": "Trump Is Losing The Post-Debate Debate, Too  —  Donald Trump has an announcement: He won the first debate against Kamala Harris so handily, and was praised so universally for doing so, that he really doesn't see a need to take the stage with her again.  —  “When a prizefighter loses a fight … ",
    "url": "https://www.thebulwark.com/p/trump-is-losing-the-post-debate-debate"
  },
  {
    "text": "Biden Slams Trump Over False Story of Pets and Immigrants: ‘This Has to Stop’  —  The president made the comments at an event where he boasted of his work for Black Americans, implicitly trying to rally a critical Democratic constituency on behalf of Vice President Kamala Harris.",
    "url": "https://www.nytimes.com/2024/09/13/us/politics/biden-trump-haitian-immigrants-cats-dogs.html"
  },
  {
    "text": "MAGA Scrambles to Excuse Trump Chickening Out of Second Debate … Donald Trump flubbed the last debate.  His allies know it, his fundraisers know it—but that doesn't mean they're willing to admit it.  —  On Thursday, the Republican presidential nominee announced that he had decided … ",
    "url": "https://newrepublic.com/post/185935/maga-scrambles-donald-trump-second-debate"
  },
  {
    "text": "Moooooods!!!!  —  Donald Trump's flailing performance at Tuesday night's debate triggered a multiday right-wing freakout at the ABC News moderators, punctuated by calls from the former president and his allies to target the network and its parent company with a regulatory crackdown, congressional investigation, and even prosecutions.",
    "url": "https://www.mediamatters.org/donald-trump/rights-post-debate-assault-abc-preview-trumps-authoritarian-agenda"
  },
  {
    "text": "Trump allies alarmed by far-right activist's influence on him … - “Marjorie Taylor Greene is right. … - Greene, a GOP firebrand known for her politically provocative speeches in Congress, has had a series of disagreements with Loomer long before this week.",
    "url": "https://www.axios.com/2024/09/13/trump-allies-far-right-activist-loomer"
  },
  {
    "text": "Trump shrugs off Loomer association: 'I don't control Laura'  —  Former President Trump shrugged off a question about his association with far-right activist Laura Loomer as some of his Republican allies sound the alarm about her influence, saying Friday she brings “a spirit” to his campaign.",
    "url": "https://thehill.com/homenews/campaign/4878970-trump-laura-loomer-association/"
  },
  {
    "text": "MAGA Civil War: How Trump Campaign Chief Tried to Whack Laura Loomer  —  MAGA CIVIL WAR LATEST  —  The former president's co-campaign manager Susie Wiles is now part of the civil war going on around Trump.  —  Former president Donald Trump moved to hire his racist firebrand pal Laura Loomer … ",
    "url": "https://www.thedailybeast.com/donald-trump-campaign-chief-susie-wiles-killed-laura-loomer-bid-to-get-hired"
  },
  {
    "text": "Biden administration expected to unveil new evidence of RT's key role in Russian intelligence operations globally  —  The Biden administration is expected on Friday to announce a major effort to blunt the global influence of RT and expose what it says is the Russian state media network's key role … ",
    "url": "https://www.cnn.com/2024/09/13/politics/biden-administration-rt-russian-intelligence"
  },
  {
    "text": "State Department labels RT as covert influence arm of Russian government  —  The State Department on Friday accused Russian outlet RT of being involved in covert influence campaigns across the globe, sanctioning its parent company for working on behalf of the Russian government.",
    "url": "https://thehill.com/policy/international/4879151-state-department-rt-as-covert-influence-russia/"
  },
  {
    "text": "Battleground House Republican dodges how she'll vote on Florida's abortion amendment  —  Rep. Anna Paulina Luna, who Democrats are targeting in November, in an interview wouldn't say how she'll vote.  —  Rep. Anna Paulina Luna is the lone Republican member of the Florida House delegation … ",
    "url": "https://www.politico.com/news/2024/09/13/florida-abortion-amendment-anna-paulina-luna-00179066"
  },
  {
    "text": "If True, the ABC News Presidential Debate Could Be Rocked by Explosive Scandal  —  Anyone who watched the presidential debate hosted by ABC News on Tuesday knows that the moderators were biased and repeatedly fact-checked Trump while letting Kamala Harris's lies go unchallenged.",
    "url": "https://pjmedia.com/matt-margolis/2024/09/12/if-true-the-abc-news-presidential-debate-could-be-rocked-by-explosive-scandal-n4932479"
  },
  {
    "text": "Texas comes for the right to interstate travel  —  States' rights for me, not for thee. … During Tuesday's debate, as Donald Trump tried to take credit for the demise of Roe while pretending a second Trump administration wouldn't obliterate abortion protections at a national level … ",
    "url": "https://www.publicnotice.co/p/texas-medical-records-abortion"
  },
  {
    "text": "Triple Hearsay: Original Sources of the Claim that Haitians Eat Pets in Ohio Admit No First-Hand Knowledge  —  “I'm not sure I'm the most credible source because I don't actually know the person who lost the cat,” Kimberly Newton told NewsGuard.  She is the Springfield, Ohio, resident whose story started it all",
    "url": "https://www.newsguardrealitycheck.com/p/origins-haitians-eating-pets-claim"
  },
  {
    "text": "Martha Stewart Just Quietly Made a Rare Presidential Endorsement  —  ‘KEEP IT QUIET’  —  After declining to endorse a candidate in 2020, Stewart has finally broken her silence on the 2024 election. … Martha Stewart has finally weighed in on the 2024 election and endorsed a candidate.",
    "url": "https://www.thedailybeast.com/martha-stewart-just-quietly-endorsed-kamala-harris-for-president"
  },
  {
    "text": "Bomb threats force second consecutive day of school closures in Springfield, Ohio  —  Several local leaders have also been targeted in the wake of baseless claims aimed at Haitian immigrants that have been repeated by former President Donald Trump.  —  SPRINGFIELD, Ohio … ",
    "url": "https://www.nbcnews.com/news/us-news/bomb-threats-force-second-consecutive-day-school-closures-springfield-rcna171043"
  },
  {
    "text": "Christian Conservatives Face Reality: Increasingly, They Stand Alone  —  As opposition to their agenda grows, especially on abortion, many conservatives are grappling with how to handle this new uncertain political world.  —  Conservative Christians are expected to vote overwhelmingly … ",
    "url": "https://www.nytimes.com/2024/09/13/us/christian-conservatives-beliefs-election.html?unlocked_article_code=1.KU4.nSgH.FVGwZFnRhtEm&smid=url-share"
  },
  {
    "text": "The ‘feral 25-year-olds’ making Kamala Harris go viral on TikTok  —  Harris's “digital rapid response” operation and all-Gen-Z TikTok team are tapping the trends and rhythms of internet culture to create an online presence that's unique in presidential politics.",
    "url": "https://www.washingtonpost.com/technology/2024/09/13/harris-tiktok-social-media-team/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI2MjAwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI3NTgyMzk5LCJpYXQiOjE3MjYyMDAwMDAsImp0aSI6IjM2NmU0NzM2LWVkZTEtNGMwNS1iMGFjLTZjMjNjNTdiNmY3MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDkvMTMvaGFycmlzLXRpa3Rvay1zb2NpYWwtbWVkaWEtdGVhbS8ifQ.RWqlnFXoyxhpX8b0_e9bperwKF_uJDLS1-UQUsKnopc&itid=gfta"
  },
  {
    "text": "Trump threatens to cut off California wildfire aid if Newsom doesn't change water policy  —  Former President Trump threatened to withhold federal aid to battle California wildfires, should he be reelected, if Gov. Gavin Newsom (D) does not change a policy that protects an endangered species of fish.",
    "url": "https://thehill.com/homenews/campaign/4879150-trump-threatens-wildfire-aid-newsom-smelt/"
  },
  {
    "text": "Elon Musk spent hundreds of thousands of dollars trying to unseat a Texas prosecutor, report says.  It didn't work.  — Elon Musk spent heavily in a failed attempt to unseat a Texas prosecutor, per a report.  — The Wall Street Journal said the Tesla CEO funneled money to a PAC to oppose José Garza in Texas.",
    "url": "https://www.businessinsider.com/musk-spent-big-trying-to-unseat-texas-prosecutor-failed-report-2024-9"
  },
  {
    "text": "Is There More to JD Vance's MAGA Alliance Than Meets the Eye?  —  The New Right has a blueprint for taking power.  JD Vance could be following it.  —  JD Vance's political career has been defined by an apparent paradox.  On the one hand, Vance is a member of the upper echelon of America's ruling elite … ",
    "url": "https://www.politico.com/news/magazine/2024/09/13/jd-vance-new-right-political-movement-00177203"
  }
]