[
  {
    "text": "Trump says some undocumented immigrants are ‘not people’  —  The former president also warned of “a bloodbath” if he does not defeat Joe Biden in November  —  VANDALIA, Ohio — Former president Donald Trump ratcheted up his dehumanizing rhetoric against immigrants Saturday by saying … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/16/trump-immigrants-not-people/"
  },
  {
    "text": "Trump Says Some Migrants Are ‘Not People’ and Predicts a ‘Blood Bath’ if He Loses  —  In a caustic and discursive speech in Ohio, former President Donald J. Trump once again doubled down on a doomsday vision of the United States.  —  Former President Donald J. Trump, at an event … ",
    "url": "https://www.nytimes.com/2024/03/16/us/politics/trump-speech-ohio.html"
  },
  {
    "text": "This Is The First Big Test Of Donald Trump's Endorsement Power In 2024  —  Trump's in Ohio just days ahead of a key U.S. Senate primary after his endorsement of businessman Bernie Moreno failed to clear the field.  —  COLUMBUS, Ohio — Donald Trump was in the Buckeye State on Saturday … ",
    "url": "https://www.huffpost.com/entry/donald-trump-bernie-moreno-ohio-rally_n_65f5e73fe4b0b4d0b8998c79"
  },
  {
    "text": "Trump Says There Will Be a ‘Bloodbath’ and Elections Will End if He Isn't Reelected  —  Former president appeared at Ohio rally for Bernie Moreno, who is competing in a split GOP Senate race  —  Donald Trump appeared at a rally hosted by super PAC Buckeye Values in Dayton, Ohio … ",
    "url": "https://www.rollingstone.com/politics/politics-news/donald-trump-bloodbath-no-elections-ohio-rally-1234989056/"
  },
  {
    "text": "Why does Biden keep mentioning January 6?  Because Trump won't stop talking about it  —  The rallies start with a recording of January 6 prisoners singing the national anthem.  Campaign staff hand out pre-made “Too Big to Rig” signs to supporters.  When the candidate takes the stage … ",
    "url": "https://www.cnn.com/2024/03/16/politics/biden-trump-january-6/"
  },
  {
    "text": "Johnson: Second Trump term would be like first ‘on turbo’  —  In a recent interview with New Yorker Magazine, Speaker Mike Johnson (R-La.) argued that if former President Trump were reelected, his second term would be much like his first, except it'd be “on turbo.”",
    "url": "https://thehill.com/homenews/campaign/4536657-johnson-second-trump-term-would-be-like-first-on-turbo/"
  },
  {
    "text": "Andre Gordon: Suspect in 3 Falls Township murders captured after Trenton barricade  —  FALLS TOWNSHIP, Pa. - A man accused of killing three people during a violent rampage in Falls Township, Pennsylvania Saturday morning before barricading himself inside a Trenton home has finally been captured, officials say.",
    "url": "https://www.fox29.com/news/falls-township-shelter-in-place"
  },
  {
    "text": "Supreme Court to decide if White House went too far fighting social media misinformation  —  The case grew out of concern from conservatives that their views were being suppressed about 2020 election fraud, COVID-19 origins and treatments and other issues.  —  WASHINGTON − … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/17/supreme-court-social-media-disinformation-censorship/72936443007/"
  },
  {
    "text": "Trump granted clemency to Medicare fraudsters before vowing to cut entitlement program abuse  —  In an attempt to clean up comments he made this week about “cutting” entitlement programs, former president Donald Trump has vowed in recent days that he would reduce spending on Social Security … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/16/trump-clemency-medicare-fraud/"
  },
  {
    "text": "Pro-Ukraine PAC launched with eye on congressional races  —  A pro-Ukraine political campaign committee has launched to boost lawmakers who are supportive of the country as it attempts to fend off Russia's invasion.  —  The new group, dubbed American Ukraine PAC, is headed by Jed Sunden … ",
    "url": "https://thehill.com/homenews/campaign/4536824-pro-ukraine-pac-launched-with-eye-on-congressional-races/"
  },
  {
    "text": "Share of Democratic Registrations Is Declining, but What Does It Mean?  —  Virtually every group of voters under 70 has become less likely to register as Democrats compared with Republicans since 2019.  —  Newly registered voters, who are disproportionately young and nonwhite, have tended to lean Democratic.",
    "url": "https://www.nytimes.com/2024/03/16/upshot/democrats-voter-registration-decline.html"
  },
  {
    "text": "U.S. courts clarify policy limiting ‘judge shopping’  —  On Tuesday, officials said a new policy would mean assigning certain cases randomly.  Now they say it is just guidance.  —  Federal judiciary leaders on Friday released the text of a revised policy directing district courts … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/16/judge-shopping-guidance-abortion-patent-courts/"
  },
  {
    "text": "GOP Base Has Shriveled Compared to Last Presidential Election  —  The number of people who describe themselves as Republican has slightly declined since the last presidential election.  —  The polling firm Gallup, which tracks party affiliation monthly, says that those identifying as Republicans … ",
    "url": "https://www.newsweek.com/republican-party-affiliation-voters-presidential-election-1879653"
  },
  {
    "text": "AOC district neighborhood labeled ‘Third World’ as migrants clog streets and prostitutes overrun every block  —  The neighborhood has become so renowned for its prostitution that it has garnered the nickname ‘the market of sweethearts’  —  FIRST ON FOX: An area in Squad member Alexandria … ",
    "url": "https://www.foxnews.com/politics/aoc-district-neighborhood-labeled-third-world-migrants-clog-streets-prostitutes-overrun-every-block"
  }
]