[
  {
    "text": "How Trump's Verbal Slips Could Weaken His Attacks on Biden's Age  —  Donald Trump, 77, has relentlessly attacked President Biden, 80, as too old for office.  But the former president himself has had a series of gaffes that go beyond his usual freewheeling style.",
    "url": "https://www.nytimes.com/2023/10/30/us/politics/trump-biden-age.html"
  },
  {
    "text": "Colorado Trial Will Consider Whether the 14th Amendment Disqualifies Trump  —  While some prominent constitutional experts argue that a clause in the amendment applies to former President Donald J. Trump after Jan. 6, that view is far from universal among legal scholars.",
    "url": "https://www.nytimes.com/2023/10/30/us/politics/trump-colorado-trial-14th-amendment-jan-6.html"
  },
  {
    "text": "DOJ seeks 10 years for Trump appointee who assaulted officers on Jan. 6  —  “Hell yea I'm going.  I'm a Trump appointee.  I better be there,” Federico Klein wrote ahead of the Capitol attack.  —  WASHINGTON — The Justice Department is seeking 10 years in federal prison … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-appointee-federico-klein-jan-6-doj-10-years-sentence-memo-rcna122774"
  },
  {
    "text": "Why Trump's Drastic Plan to Slash the Government Could Succeed  —  Republican presidential front-runner wants to fire federal employees, assert control over independent agencies and wrest spending authority from Congress  —  WASHINGTON—For decades, conservatives have tried—and largely failed … ",
    "url": "https://www.wsj.com/politics/elections/why-trumps-drastic-plan-to-slash-the-government-could-succeed-6828ccbe?mod=followamazon"
  },
  {
    "text": "Vivek Ramaswamy's Unfavorable Rating Surges in Iowa as Voters Get to Know Him  —  A new poll from NBC News and the Des Moines Register, long considered the gold standard in the Hawkeye State, shows that the more voters get to know Vivek Ramaswamy, the less inclined they are to like him.",
    "url": "https://www.mediaite.com/politics/vivek-ramaswamys-unfavorable-rating-surges-in-iowa-as-voters-get-to-know-him/"
  },
  {
    "text": "Playbook: Johnson makes money moves  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  NEW JMART — “Joe Biden's Big New Hampshire Blunder,” by Jonathan Martin: “President JOE BIDEN was hoping to preempt a nuisance primary challenge that could embarrass him before the general election.",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/30/johnson-makes-money-moves-00124190"
  },
  {
    "text": "Ex-North Dakota Lawmaker Accused Of Flying To Prague To Rape Minor  —  Ex-Republican state Sen. Ray Holmberg is facing federal charges for intent to rape a minor and receiving images depicting child sexual abuse.  —  A former longtime North Dakota lawmaker is charged with traveling to Prague … ",
    "url": "https://www.huffpost.com/entry/ap-us-former-legislator-indicted-north-dakota_n_653ff3dee4b0a78a26a44b60"
  },
  {
    "text": "Former state senator Ray Holmberg indicted, arrested on federal child porn charges  —  GRAND FORKS, N.D. (KFGO) - Ray Holmberg, who was North Dakota's - and one of the country's - longest-serving state senators until he resigned last spring, has been indicted on federal charges of travel … ",
    "url": "https://kfgo.com/2023/10/30/917202/"
  },
  {
    "text": "Judge Postpones Ivanka Trump's Testimony For a Few Days in Civil Fraud Trial  —  The former president's daughter is now scheduled to take the witness stand on Wednesday, Nov. 8 — instead of this coming Friday  —  JWPlayer  —  Ivanka Trump's testimony in her family's civil fraud trial … ",
    "url": "https://themessenger.com/politics/ivanka-trump-testimony-postponed-civil-fraud-case"
  },
  {
    "text": "Outraised and embattled, Lauren Boebert heads back to Colorado with a revamped campaign strategy  —  Retreating from the turmoil in Washington, D.C., Rep. Lauren Boebert arrived in bucolic southwest Colorado to turmoil of a different sort — the lingering impact of an embarrassing moment … ",
    "url": "https://apnews.com/article/boebert-gop-voters-campaign-apology-reelection-frisch-af8cf7cb563e6b97bc75f3e8b849281c"
  },
  {
    "text": "‘Chilling’: Dem Lawmaker Says She Had Election-Denying Exchange With Mike Johnson  —  Rep. Madeleine Dean said Johnson managed to become House speaker because “very few people knew him or knew what he stands for.”  —  LOADING  —  Rep. Madeleine Dean (D-Pa.) described new House Speaker Mike Johnson … ",
    "url": "https://www.huffpost.com/entry/madeleine-dean-mike-johnson-election-denier_n_653f9f74e4b0ae2dc0b46f48"
  },
  {
    "text": "Kevin McCarthy gets MAGA primary challenger  —  Former Speaker Kevin McCarthy (R-Calif.) is getting a primary challenger in his reelection race for his House seat representing the state's 20th congressional district.  —  David Giglio, who previously lost a congressional bid for the state's 13th district … ",
    "url": "https://thehill.com/homenews/campaign/4283327-mccarthy-maga-gop-primary-challenger/"
  },
  {
    "text": "Lawyer for Former George Santos Treasurer Says He Was Also Duped  —  A lawyer representing one of George Santos' former treasurers says he was also lied to—and the false information he provided to the media wasn't his fault.  —  When George Santos' congressional campaign came under federal investigation … ",
    "url": "https://www.thedailybeast.com/lawyer-for-former-george-santos-treasurer-says-he-was-also-duped"
  },
  {
    "text": "Antisemitic threats to our community  —  Dear members of the Cornell community,  —  Earlier today, a series of horrendous, antisemitic messages threatening violence to our Jewish community and specifically naming 104 West — the home of the Center for Jewish Living — was posted on a website unaffiliated with Cornell.",
    "url": "https://statements.cornell.edu/2023/20231029-antisemitic-threats.cfm"
  },
  {
    "text": "Antisemitic mob storms through Russian airport as flight from Tel Aviv lands  —  An angry crowd in Russia's mostly Muslim region of Dagestan stormed an airport where a flight from Israel arrived on Sunday, forcing authorities to close the facility and divert flights.",
    "url": "https://www.cnn.com/2023/10/30/europe/russia-dagestan-airport-anti-israel-intl-hnk/"
  },
  {
    "text": "Israel at war: IDF operates in Gaza, frees captive soldier  —  1,400 Israelis murdered since October 7, including 315 soldiers  • Four out of 239 known hostages released by Hamas, one rescued  —  Mossad chief Barnea flies to Qatar to secure hostage release",
    "url": "https://www.jpost.com/middle-east/2023-10-30/live-updates-770764"
  },
  {
    "text": "The Christofascism of Mike Johnson  —  The new House speaker is an opposition researcher's goldmine. … It took Mike Johnson just a couple days last week to rise from a relatively obscure Louisiana congressman to House speaker.  Suffice it to say his background and policy positions … ",
    "url": "https://www.publicnotice.co/p/mike-johnson-christofascism"
  }
]