[
  {
    "text": "Meadows, Giuliani and other Trump allies charged in Arizona 2020 election probe  —  PHOENIX — An Arizona grand jury on Wednesday indicted seven attorneys and aides affiliated with Donald Trump's 2020 presidential campaign as well as 11 Arizona Republicans on felony charges related … ",
    "url": "https://www.washingtonpost.com/national-security/2024/04/24/arizona-2020-election-charges-meadows-giuliani-ellis/"
  },
  {
    "text": "Trump's 2020 ‘fake electors’ charged with state crimes in Arizona  —  The indictments follow an investigation led by Arizona Attorney General Kris Mayes, a Democrat, into efforts to subvert the results of the 2020 election.  —  A state grand jury in Arizona on Wednesday indicted so-called … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trumps-2020-fake-electors-charged-state-crimes-arizona-rcna149214"
  },
  {
    "text": "Arizona grand jury indicts 11 Republicans who falsely declared Trump won the state in 2020  —  PHOENIX (AP) — Eleven Republicans who submitted a document to Congress falsely declaring that Donald Trump beat Joe Biden in Arizona in the 2020 presidential election were charged Wednesday with conspiracy … ",
    "url": "https://apnews.com/article/arizona-fake-electors-charges-2020-election-9da5a7e58814ed55ceea1ca55401af85"
  },
  {
    "text": "Grand jury indicts fake electors who falsely certified Donald Trump as 2020 winner in Arizona  —  A grand jury has charged 11 Arizona Republicans and seven former aides to Donald Trump in a scheme to keep Trump in the White House by falsely certifying he won the state in 2020 … ",
    "url": "https://www.azcentral.com/story/news/politics/elections/2024/04/24/arizona-fake-electors-indictments/73184206007/"
  },
  {
    "text": "Arizona GOP lawmaker booted from committee after backing abortion ban repeal  —  Two Arizona state House lawmakers were removed from key committees Monday following the chamber's vote to repeal the state's 1864 abortion ban, with one Republican who voted with Democrats among them.",
    "url": "https://thehill.com/homenews/state-watch/4619080-arizona-lawmakers-booted-committees-abortion-ban-repeal/"
  },
  {
    "text": "Arizona state House passes a bill to repeal 1864 abortion ban  —  On their third try in three weeks, state House lawmakers voted to reverse a near-total ban on the procedure following an Arizona Supreme Court ruling.  —  On their third attempt in three weeks, Arizona state House lawmakers voted Wednesday … ",
    "url": "https://www.nbcnews.com/politics/arizona-abortion-ban-lawmakers-repeal-rcna149181?taid=66293ac2029dc600017aa414"
  },
  {
    "text": "Arizona House votes to repeal abortion ban, advancing issue to state Senate  —  PHOENIX — The Arizona House voted Wednesday to repeal a Civil War-era ban on nearly all abortions that is set to take effect as early as June 8.  The measure now heads to the state Senate, which could grant final passage next week.",
    "url": "https://www.washingtonpost.com/politics/2024/04/24/arizona-abortion-ban/"
  },
  {
    "text": "More than 20 arrests made at pro-Palestine protest on UT Austin campus  —  Students walked out of class on Wednesday morning and gathered near Gregory Gym.  —  AUSTIN, Texas — More than 20 people have been arrested at a pro-Palestine protest at the University of Texas at Austin on Wednesday afternoon.",
    "url": "https://www.kvue.com/article/news/nation-world/israel-hamas-conflict/ut-palestine-protest/269-9fa17214-53c1-47e1-965e-629c0d22f1c9"
  },
  {
    "text": "Team Trump Is Ready to Lose the Supreme Court Immunity Case.  They're Celebrating  —  Trump's lawyers don't expect the Supreme Court to bless his absurd immunity claims.  “We already pulled off the heist,” says a source close to Trump … But what the high court does now is almost beside the point: Trump already won.",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-celebrating-supreme-court-immunity-heist-1235009838/"
  },
  {
    "text": "A Message from The Gateway Pundit Founder Jim Hoft to Our Readers  —  A message from our Founder:  —  TGP Communications, the parent company of The Gateway Pundit, recently made the decision to seek protection under Chapter 11 of the United States Bankruptcy Code in the Southern District … ",
    "url": "https://www.thegatewaypundit.com/2024/04/message-gateway-pundit-founder-jim-hoft-our-readers/"
  },
  {
    "text": "Rightwing US website that spreads election conspiracies declares bankruptcy  —  Gateway Pundit, run by Jim Hoft, is being sued for defamation by Georgia election workers Ruby Freeman and Shaye Moss and others  —  The Gateway Pundit, a rightwing website known for spreading election conspiracies … ",
    "url": "https://www.theguardian.com/world/2024/apr/24/gateway-pundit-rightwing-website-bankruptcy"
  },
  {
    "text": "‘Lost touch with reality’: How TikTok's vaunted lobbying operation went wrong  —  The app always faced an uphill battle in Congress because of its owner's ties to China.  But observers say TikTok's complacency, tone deafness and hubris caused its lobbyists to lose its most important fight in Washington.",
    "url": "https://www.politico.com/news/2024/04/24/tiktok-china-lobbying-washington-00154232"
  },
  {
    "text": "Ukraine uses long-range missiles secretly provided by US to hit Russian-held areas, officials say  —  Ukraine for the first time has begun using long-range ballistic missiles provided secretly by the United States, bombing a Russian military airfield in Crimea last week and Russian forces … ",
    "url": "https://apnews.com/article/russia-ukraine-war-long-range-missiles-4d2254639eb5a503d8b0a291ed0680e9"
  },
  {
    "text": "The WA GOP put it in writing that they're not into democracy  —  Political forecasters called it that the state Republican convention would feature turmoil ending in endorsements of the most extreme candidates, all to match the party's current MAGA mood.  —  Among the jilted … ",
    "url": "https://www.seattletimes.com/seattle-news/politics/the-wa-gop-put-it-in-writing-that-theyre-not-into-democracy/"
  },
  {
    "text": "McKinsey Is Under Criminal Investigation for Its Opioid Work  —  Federal prosecutors are examining the consulting company's role in helping “turbocharge” the sale of painkillers like OxyContin.  —  The Justice Department is investigating McKinsey & Company, the international consulting giant … ",
    "url": "https://www.nytimes.com/2024/04/24/business/mckinsey-criminal-investigation.html"
  },
  {
    "text": "Supreme Court wrestles with fallout of Dobbs in arguments on emergency abortions  —  Slippery slopes, tension on the bench and other takeaways from Wednesday's arguments.  —  The Supreme Court heard nearly two hours of heated arguments Wednesday on the tension between Idaho's near-total abortion ban … ",
    "url": "https://www.politico.com/news/2024/04/24/scotus-dobbs-idaho-emergency-abortions-00154173"
  },
  {
    "text": "Secret Service agent assigned to Kamala Harris hospitalized after exhibiting “distressing behavior,” officials say  —  Washington — A U.S. Secret Service agent assigned to Vice President Kamala Harris exhibited “distressing behavior” Monday morning at Joint Base Andrews and was hospitalized, authorities said.",
    "url": "https://www.cbsnews.com/news/secret-service-agent-assigned-to-kamala-harris-exhibits-distressing-behavior/"
  },
  {
    "text": "Russia vetoes UN resolution to prevent nuclear weapons in space  —  Russia on Wednesday vetoed a United Nations Security Council resolution that would have called on all states to prevent the placement of nuclear weapons in space and not take steps to develop weapons of mass destruction that could be deployed above Earth.",
    "url": "https://thehill.com/policy/defense/4619197-russia-vetoes-un-resolution-to-prevent-nuclear-weapons-in-space/"
  },
  {
    "text": "In Florida, an exodus of people fleeing rising anti-immigrant sentiment  —  FORT MYERS, Fla.— Manuel Vasquez says he remembers when the exodus began.  When one by one, people in this community started vanishing.  —  It began about a year ago, in May 2023, when a new law was signed into law by Governor … ",
    "url": "https://npr.org/2024/04/24/1236631178/in-florida-an-exodus-of-people-fleeing-rising-anti-immigrant-sentiment"
  },
  {
    "text": "Chairman Sanders Launches Investigation into Outrageously High Price of Ozempic and Wegovy in the United States  —  Sen. Bernie Sanders (I-Vt.), Chairman of the Senate Health, Education, Labor, and Pensions (HELP) Committee, today sent a letter to the CEO of Novo Nordisk … ",
    "url": "https://www.sanders.senate.gov/press-releases/news-chairman-sanders-launches-investigation-into-outrageously-high-price-of-ozempic-and-wegovy-in-the-united-states/"
  },
  {
    "text": "My Dinner With Andreessen  —  Billionaires I have known: Part One of a three-part series  —  Marc Andreessen and Laura Arrillaga-Andreessen arrive at the tenth Breakthrough Prize Ceremony on April 13, 2024, at the Academy Museum of Motion Pictures in Los Angeles.",
    "url": "https://prospect.org/power/2024-04-24-my-dinner-with-andreessen/"
  },
  {
    "text": "Government watchdog alleges Trump campaign broke the law trying to hide legal payments  —  A complaint filed with the Federal Election Commission alleges Donald Trump's 2024 White House campaign and its related political committees engaged in a scheme to conceal who is being paid … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/24/donald-trump-campaign-legal-bills-complaint/73444749007/"
  }
]