[
  {
    "text": "Childless GOP Candidate Borrows Friend's Wife and Kids for Photo Ops  —  The GOP's antipathy towards childless Americans is prompting some weird behavior  —  REPUBLICANS HAVE TAKEN umbrage with the notion that they're weird — specifically when it comes to accusations that they're weird about people … ",
    "url": "https://www.rollingstone.com/politics/politics-news/derrick-anderson-borrows-friends-wife-family-photo-ops-1235115338/"
  },
  {
    "text": "G.O.P. Candidates, Looking to Soften Their Image, Turn to Their Wives  —  Ads featuring candidates' families have long been a campaign staple.  But they have taken on new urgency, especially for vulnerable Republicans, in a year when reproductive rights are a pivotal issue.",
    "url": "https://www.nytimes.com/2024/09/27/us/politics/republican-candidates-wives-ads.html?unlocked_article_code=1.N04.2aZO.phY3k3xPK1m_&smid=url-share"
  },
  {
    "text": "Trump Lays the Groundwork for More Bogus Stolen Election Claims: ‘They Cheat’  —  Former President Donald Trump is already blaming voter fraud if he loses November's election.  —  Trump infamously and falsely claimed the 2020 election was rigged against him.",
    "url": "https://www.mediaite.com/trump/trump-lays-the-groundwork-for-more-bogus-stolen-election-claims-they-cheat/"
  },
  {
    "text": "What if the media has the election all wrong?  —  Here's a question for you: What if the dynamics of the 2024 presidential election have dramatically shifted — and the national media has been too busy doing stenography to notice?  —  What if Kamala Harris — after a spectacular entry into the race … ",
    "url": "https://presswatchers.org/2024/09/what-if-the-media-has-the-election-all-wrong/"
  },
  {
    "text": "Trump Threatens to Prosecute Google for Showing ‘Bad Stories’ About Him  —  The former president said on social media that he would “request their prosecution, at the maximum levels” if he was elected to a second term.  —  Former President Donald J. Trump threatened Friday to prosecute Google … ",
    "url": "https://www.nytimes.com/2024/09/27/us/politics/trump-google-prosecute.html"
  },
  {
    "text": "Justice Department sues Alabama, claiming it purged voters too close to the election  —  The U.S. Justice Department filed a lawsuit Friday against Alabama and its top election official, alleging a state program violated federal law by removing voters from its election rolls too close to this fall's general election.",
    "url": "https://www.npr.org/2024/09/27/nx-s1-5131578/alabama-noncitizen-voter-purge-lawsuit"
  },
  {
    "text": "Justice Department Sues Alabama for Violating Federal Law's Prohibition on Systematic Efforts to Remove Voters Within 90 Days of an Election  —  For Immediate Release  —  The Justice Department announced today that it has filed a lawsuit against the State of Alabama and the Alabama Secretary … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-alabama-violating-federal-laws-prohibition-systematic-efforts-remove"
  },
  {
    "text": "Harris to call for tougher security measures in first trip to southern border as nominee  —  During a visit to the U.S.-Mexico border on Friday, Vice President Kamala Harris is planning to announce that she intends to keep President Biden's asylum crackdown in place if elected and make it harder … ",
    "url": "https://www.cbsnews.com/news/kamala-harris-border-visit-douglas-arizona/"
  },
  {
    "text": "Special counsel pushing for public release of key filing in Trump's Jan. 6 case  —  Jack Smith wants to file a public version of the sealed brief he filed Thursday.  —  In this July 31, 2024, file photo, Republican presidential candidate former President Donald Trump waits on stage to speak at a campaign rally, in Harrisburg, Pa.",
    "url": "https://abcnews.go.com/US/special-counsel-pushing-public-release-key-filing-trumps/story?id=114294940"
  },
  {
    "text": "Trump Camp Says State Menstrual Surveillance Programs are A-OK  —  One of the most toxic and politically explosive parts of the current abortion rights debate is tied the complexities and perhaps inanities of leaving national abortion policy up to individual states.",
    "url": "https://talkingpointsmemo.com/edblog/trump-camp-says-state-menstrual-surveillance-programs-are-a-ok"
  },
  {
    "text": "Iranian Hackers Compromised Roger Stone's Email Eight Years After Russian Hackers Exfiltrated DNC Emails  —  DOJ unsealed the indictment against three Iranian hackers it accuses of targeting Donald Trump's campaign (as well as a bunch of other victims, including one of his top State Department officials).",
    "url": "https://www.emptywheel.net/2024/09/27/iranian-hackers-compromised-roger-stones-email-eight-years-after-russian-hackers-exfiltrated-dnc-emails/"
  },
  {
    "text": "Tens of thousands of illegal immigrants with sexual assault, murder convictions roaming US streets: ICE data  —  ICE provided the new data to lawmakers this week  —  Tens of thousands of illegal immigrants with sex offenses and homicide convictions are loose on the streets … ",
    "url": "https://www.foxnews.com/politics/tens-thousands-illegal-immigrants-sexual-assault-homicide-convictions-roaming-us-streets"
  },
  {
    "text": "How the VP debate rules will work for the Walz-Vance 2024 showdown  —  Republican vice presidential nominee Sen. JD Vance and Democratic vice presidential nominee Gov. Tim Walz will meet for their first and only debate on Tuesday, hosted by CBS News at the CBS Broadcast Center in New York.",
    "url": "https://www.cbsnews.com/news/cbs-debate-rules-vp-debate-2024/"
  },
  {
    "text": "Schiff introduces bill that would stop presidents from dismissing prosecution against themselves  —  California Rep. Adam Schiff (D) introduced a bill on Friday that would prevent sitting presidents from dismissing criminal prosecution against themselves, including through coercion … ",
    "url": "https://thehill.com/policy/4904631-schiff-bill-presidential-immunity/"
  },
  {
    "text": "The far right is using AI to sell Hitler to a new generation  —  Videos of the Nazi leader speaking in English are reaching millions online.  Experts fear they are fueling a surge of antisemitism.  —  Extremists are using artificial intelligence to reanimate Adolf Hitler online for a new generation … ",
    "url": "https://www.washingtonpost.com/technology/2024/09/27/neonazis-ai-hitler-videos/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NDA5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4NzkxOTk5LCJpYXQiOjE3Mjc0MDk2MDAsImp0aSI6IjU0OTU1MDhkLTYxMjctNDMyZi1iNjE3LWRmMTQyZmIxYjBkZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDkvMjcvbmVvbmF6aXMtYWktaGl0bGVyLXZpZGVvcy8ifQ.edgh5GTRmJnFDxbofUneFxJcQKB9ZygdU2AtHWOwZLI&itid=gfta"
  },
  {
    "text": "NC court rules UNC digital IDs not valid at the polls  —  The North Carolina Court of Appeals on Friday overturned a lower court's decision to accept the University of North Carolina at Chapel Hill's mobile One Card as valid voter identification.  —  The ruling supported the plaintiff's argument … ",
    "url": "https://thehill.com/homenews/state-watch/4904725-north-carolina-court-appeals-overturns/"
  },
  {
    "text": "Everything You Never Wanted to Know About the Trump Watch  —  On the Secret pod Sarah and I talked about whether or not Kamala Harris is “doing enough,” which is a question some people (not you guys) have been very unhappy with me for asking.  —  The show is here.  —  1. Trump Watch",
    "url": "https://www.thebulwark.com/p/everything-you-never-wanted-to-know"
  },
  {
    "text": "Bad blood with Republicans drives a decline in Taylor Swift's poll numbers  —  The number of people with a favorable opinion of Swift declined compared to last year in the latest NBC News poll.  Swift endorsed Kamala Harris several weeks ago.  —  Republican views of Taylor Swift have taken … ",
    "url": "https://www.nbcnews.com/politics/bad-blood-republicans-drives-decline-taylor-swifts-poll-numbers-rcna172999"
  },
  {
    "text": "‘A true friend of Turkey’: Four writers on the Eric Adams indictment  —  Ronald L. Kuby, Ruth Marcus, Matt Bai and Elif Batuman contemplate the corruption charges against the New York City mayor.  —  On Thursday, Eric Adams was charged with bribery, wire fraud and seeking illegal campaign donations … ",
    "url": "https://www.washingtonpost.com/opinions/2024/09/27/eric-adams-mayor-new-york-indictment-reaction/"
  },
  {
    "text": "Fox Weather meteorologist saves Atlanta woman from floodwaters during broadcast  —  Fox Weather meteorologist Bob Van Dillen is being called a hero after he rescued an Atlanta woman trapped in rising floodwaters mid-broadcast.  —  Van Dillen launched the one-man rescue mission to save the screaming woman … ",
    "url": "https://www.washingtonexaminer.com/news/3169146/fox-meteorologist-saves-atlanta-woman-floodwaters-broadcast/"
  },
  {
    "text": "Rescuers race to free people trapped by Hurricane Helene after storm kills at least 35 in 4 states … Hurricane Helene left an enormous path of destruction across Florida and the entire southeastern U.S. on Friday, killing at least 35 people in four states, snapping trees like twigs … ",
    "url": "https://apnews.com/article/hurricane-helene-florida-georgia-carolina-e5769b56dea81e40fae2161ad1b4e75d"
  },
  {
    "text": "What X silencing a journalist reporting on hacked materials shows about the ethics of weaponized disclosures  —  As always, thank you for subscribing and amplifying Civic Texts, which will not be sustainable without you.  Many thanks to everyone who has supported my work … ",
    "url": "https://civic-texts.ghost.io/what-x-silencing-a-journalist-reporting-on-hacked-materials-shows-about-the-ethics-of-weaponized-disclosures/"
  },
  {
    "text": "Bill Barr, “So Far as We Knew”  —  As I described, the book written by Aaron Zebley and two of Robert Mueller's other former prosecutors breaks most new ground in its description of discussions between Mueller's team, Trump's lawyers, and those supervising the investigation at DOJ.",
    "url": "https://www.emptywheel.net/2024/09/27/bill-barr-so-far-as-we-knew/"
  },
  {
    "text": "Rep. Ilhan Omar to Introduce Major Long Covid Bill  —  The Long Covid Research Moonshot Act would earmark $10 billion to fight the condition.  —  On Friday, Minnesota Rep. Ilhan Omar (D-Minn.) will introduce a potentially groundbreaking piece of federal legislation in the House of Representatives … ",
    "url": "https://www.motherjones.com/politics/2024/09/ilhan-omar-bernie-long-covid-house-bill/"
  },
  {
    "text": "Trump declines to withdraw his endorsement of “Black Nazi” Mark Robinson  —  The former president claimed ignorance of the scandal surrounding Robinson and his posts on a pornographic website  —  Donald Trump has declined to withdraw his endorsement of Mark Robinson, the North Carolina … ",
    "url": "https://www.salon.com/2024/09/27/declines-to-withdraw-his-endorsement-of-black-nazi-mark-robinson/"
  },
  {
    "text": "‘Quiet Place’ in Pennsylvania Is Thrust Into Loud Immigration Debate  —  Former President Donald J. Trump turned his sights on Charleroi, Pa., where many Haitians have settled in recent years, and he fueled a fire that was already smoldering.  —  Amos Vougar felt as though he had found … ",
    "url": "https://www.nytimes.com/2024/09/27/us/charleroi-pennsylvania-haitian-migrants.html"
  }
]