[
  {
    "text": "Why I'm quitting the Washington Post  —  I've worked for the Washington Post since 2008 as an editorial cartoonist.  I have had editorial feedback and productive conversations—and some differences—about cartoons I have submitted for publication, but in all that time I've never had a cartoon killed … ",
    "url": "https://anntelnaes.substack.com/p/why-im-quitting-the-washington-post"
  },
  {
    "text": "Washington Post Cartoonist Quits After Jeff Bezos Cartoon Is Killed  —  The cartoon, by Ann Telnaes, depicted the owner of The Post, Jeff Bezos, and other billionaires genuflecting toward a statue of President-elect Donald Trump.  —  Ann Telnaes, a Pulitzer Prize-winning cartoonist for The Washington Post … ",
    "url": "https://www.nytimes.com/2025/01/03/business/media/washington-post-cartoonist-quits-after-jeff-bezos-cartoon-is-killed.html?unlocked_article_code=1.mk4.6_zx.YOY8uSvF1m7i&smid=nytcore-ios-share&referringSource=articleShare&tgrp=ctr"
  },
  {
    "text": "Mike Johnson Scrapes Speakership Win After Republicans Change Votes  —  The congressional leader's attempt to hold the gavel in a straight vote was foiled by disgruntled Republicans — until it wasn't  —  The House Republican caucus kicked off the 119th U.S. Congress with what is becoming … ",
    "url": "https://www.rollingstone.com/politics/politics-news/mike-johnson-house-speaker-vote-1235224706/"
  },
  {
    "text": "Judge Upholds Trump's Conviction but Signals No Jail Time  —  The New York judge who oversaw President-elect Donald J. Trump's hush-money trial scheduled his sentencing for Jan. 10.  Mr. Trump is expected to appeal his conviction.  —  A New York judge on Friday upheld President-elect Donald … ",
    "url": "https://www.nytimes.com/2025/01/03/nyregion/trump-sentencing-hush-money-case-ny.html"
  },
  {
    "text": "Judge upholds Trump's felony conviction, but does not plan to order jail time  —  Donald Trump was found guilty in May of falsifying business records to conceal a payment to adult-film star Stormy Daniels ahead of the 2016 election.  —  NEW YORK — President-elect Donald Trump will be sentenced … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/03/trump-new-york-hush-money-conviction-sentence/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM1ODgwNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3MjYyNzk5LCJpYXQiOjE3MzU4ODA0MDAsImp0aSI6ImNhNmJhZTk5LTM2NzQtNDA1OS1iNGYzLWUwODA1MGMwOTQ1NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzAzL3RydW1wLW5ldy15b3JrLWh1c2gtbW9uZXktY29udmljdGlvbi1zZW50ZW5jZS8ifQ._xSiYrmilUvxjopNjH7qphaLD2AitGvr3Vzv68-Pd2E&itid=gfta"
  },
  {
    "text": "Judge Orders Trump Sentencing Before Inauguration Day  —  Judge Juan Merchan ordered President-elect Donald Trump to be sentenced before his inauguration on Jan. 20.  —  Merchan found there is “no legal impediment” to imposing a sentence and ordered Trump to appear in court on Jan. 10.",
    "url": "https://dailycaller.com/2025/01/03/judge-orders-trump-sentencing-before-inauguration-day/"
  },
  {
    "text": "Scoop: Apple CEO Tim Cook donates $1 million to Trump inauguration … The company is not expected to give.  — Cook, with a consistent presence in Washington, has made it clear over the years that he believes in participation, not sitting on the sidelines, and engaging with policymakers from both sides of the aisle.",
    "url": "https://www.axios.com/2025/01/03/tim-cook-apple-donate-1-million-trump-inauguration"
  },
  {
    "text": "Apple CEO Tim Cook donates $1M to Trump's inauguration fund  —  Apple CEO Tim Cook has joined a chorus of Big Tech executives making sizeable donations to President-elect Donald Trump's inauguration.  The news comes via a scoop from Axios as we approach Trump's inauguration on January 20.",
    "url": "https://9to5mac.com/2025/01/03/apple-ceo-tim-cook-donates-1m-to-trumps-inauguration-fund/"
  },
  {
    "text": "Apple CEO Tim Cook personally invested $1 million in Trump's inauguration  —  In a bid to gain favor with the president-elect, Apple CEO Tim Cook has contributed $1 million of his personal finances to the inauguration fund.  —  President-elect Donald Trump will be inaugurated on January 20 … ",
    "url": "https://appleinsider.com/articles/25/01/03/apple-ceo-tim-cook-personally-invested-1-million-in-trumps-inauguration"
  },
  {
    "text": "Meta's AI Profiles Are Indistinguishable From Terrible Spam That Took Over Facebook  —  Earlier this week, Meta executive Connor Hayes told the Financial Times that the company is going to roll out AI character profiles on Instagram and Facebook that “exist on our platforms … ",
    "url": "https://www.404media.co/metas-ai-profiles-are-indistinguishable-from-terrible-spam-that-took-over-facebook/"
  },
  {
    "text": "Vegas Cybertruck bomber Matthew Livelsberger's vile marriage secrets revealed  —  Cybertruck suicide bomber Matthew Livelsberger was ‘unstable, misogynistic’ and emotionally ‘abusive’ to his first wife, says a pal of the active-duty Green Beret's ex.  —  'I never considered him stable or solid … ",
    "url": "https://www.dailymail.co.uk/news/article-14247555/matthew-livelsberger-marriage-vegas-cybertruck-trump.html"
  },
  {
    "text": "Soldier who blew up Tesla at Trump hotel left note saying blast was to be a ‘wake up call’ for US  —  A highly decorated Army soldier who fatally shot himself in a Tesla Cybertruck just before it blew up outside the Trump hotel in Las Vegas left notes saying the New Year's Day explosion … ",
    "url": "https://apnews.com/article/cybertruck-explosion-trump-hotel-las-vegas-6c85af85255753db497f2cd344fb2ace"
  },
  {
    "text": "US surgeon general sounds alarm about link between alcohol and cancer  —  US Surgeon General Dr. Vivek Murthy issued an advisory Friday warning Americans that alcohol consumption can increase their cancer risk and called for an updated health warning label on alcoholic beverages.",
    "url": "https://www.cnn.com/2025/01/03/health/alcohol-cancer-surgeon-generals-advisory"
  },
  {
    "text": "Democratic Women's Caucus Celebrates Largest Membership Ever; Welcomes 16 New Members  —  CONTACT:  —  Today, Friday January 3, the Democratic Women's Caucus (DWC) celebrated its largest membership ever, 96 Democratic women strong, following the swearing in of the 119th Congress.",
    "url": "https://democraticwomenscaucus.house.gov/media/press-releases/democratic-womens-caucus-celebrates-largest-membership-ever-welcomes-16-new"
  },
  {
    "text": "Cruise ships hit by worst year for stomach bugs in over a decade, CDC data reveals  —  The cruise industry continues to balloon — with ever bigger, ever wilder boats and some 37.1 million cruise passengers set to take to the waters in 2025, according to industry body Cruise Lines International Association (CLIA).",
    "url": "https://www.cnn.com/2025/01/03/travel/cruise-ships-worst-year-stomach-bugs-cdc-data/"
  },
  {
    "text": "Memorandum on the Designation of Officials of the United States Agency for Global Media to Act as Chief Executive Officer  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, including the Federal Vacancies Reform Act of 1998, as amended, 5 U.S.C. 3345 et seq.",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2025/01/03/memorandum-on-the-designation-of-officials-of-the-united-states-agency-for-global-media-to-act-as-chief-executive-officer/"
  },
  {
    "text": "UK Right Warns Trump Allies That Musk's Posts Have Gone Too Far  — Billionaire calls for release of far-right activist Robinson  — Reform leader Nigel Farage has distanced himself from Robinson  —  Senior politicians on the UK right have privately contacted Donald Trump's allies … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-03/uk-right-warns-trump-allies-that-musk-s-posts-have-gone-too-far"
  },
  {
    "text": "Judge turns down Jan. 6 felon's request to attend Trump inauguration at invitation of GOP lawmakers  —  It's the second time a federal judge has denied a Jan. 6 defendant's request to attend Trump's inauguration.  —  A federal judge has denied a Jan. 6 felony defendant's request for permission … ",
    "url": "https://www.politico.com/news/2025/01/03/donald-trump-inauguration-january-6-001888"
  },
  {
    "text": "How Biden Screwed the Steelworkers  —  Japan, one of our closest allies, wanted the deal.  So did Pittsburgh steelworkers and members of the president's cabinet.  So why did he block it?  —  Back in April, when President Joe Biden was still running for reelection, he told a gathering … ",
    "url": "https://www.thefp.com/p/how-biden-screwed-the-steelworkers-nippon-steel-japan"
  }
]