[
  {
    "text": "Trump and his allies had a plan for how to hit Harris.  Then he opened his mouth.  —  “He's grasping around,” said Chuck Coughlin, an Arizona-based political strategist.  —  Scrambling to put an end to Kamala Harris' ascent, Donald Trump's campaign and outside allies came up with a plan … ",
    "url": "https://www.politico.com/news/2024/08/01/donald-trump-kamala-harris-attack-plan-00172178"
  },
  {
    "text": "Republicans Freak Out Over Trump's New Race-Based Attack on Harris  —  MAGA MELTDOWN  —  GOP lawmakers expressed their exasperation about the shocking words of their party's presidential nominee.  —  Republican lawmakers were horrified by Donald Trump's comments Wednesday questioning Kamala Harris' racial identity.",
    "url": "https://www.thedailybeast.com/republicans-freak-out-over-donald-trumps-new-race-based-attack-on-kamala-harris"
  },
  {
    "text": "A Vintage Trump Meltdown  —  Huge prisoner-swap news breaking this morning: Russia has agreed to release Wall Street Journal reporter Evan Gershkovich, former Marine Paul Whelan, and Russian-British activist Vladimir Kara-Murza, all of whom had been detained on trumped-up charges.",
    "url": "https://www.thebulwark.com/p/a-vintage-trump-meltdown"
  },
  {
    "text": "Trump's Disastrous Interview Shows He's Afraid of Kamala Harris  —  The former President imploded on stage because the Vice President has him on his heels.  —  ∙ Paid  —  One of the abiding narratives of the 2024 campaign is that Donald Trump is a remarkably better candidate than in his 2016 and 2020 runs.",
    "url": "https://www.messageboxnews.com/p/trumps-disastrous-interview-shows"
  },
  {
    "text": "Trump Explodes Heads: Kamala Was Indian Before She Was Black  —  So former President Trump did what only he does best today and walked into the proverbial “lion's den” at the National Association of Black Journalists conference.  It was by invitation - they also issued one to his opponent … ",
    "url": "https://hotair.com/tree-hugging-sister/2024/07/31/trump-explodes-heads-kamala-was-indian-before-she-was-black-n3792531"
  },
  {
    "text": "WSJ Reporter Evan Gershkovich Is Free  —  Release of 32-year-old American from Russia secured as part of largest East-West prisoner swap since Cold War  —  Russia freed wrongly convicted Wall Street Journal reporter Evan Gershkovich as part of the largest and most complex East-West prisoner swap since … ",
    "url": "https://www.wsj.com/world/russia/evan-gershkovich-free-cde745b3?st=1ik3ftlbeb6izcd&reflink=article_copyURL_share"
  },
  {
    "text": "US Reporter to Be Freed by Russia in Major Prisoner Swap  — Wall Street Journal reporter Gershkovich to be let go in deal  — US, Russia had held extensive talks on prisoner exchange  —  Russia is releasing Wall Street Journal reporter Evan Gershkovich and former US Marine Paul Whelan … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-01/us-reporter-released-by-russia-in-multi-country-prisoner-swap"
  },
  {
    "text": "Putin Wanted His Hit Man Back.  A Mother Wanted Her Journalist Son to Come Home.  —  The secret negotiations to free The Wall Street Journal's Evan Gershkovich unfolded on three continents, involving spy agencies, billionaires, political power players and his fiercest advocate—his mom.",
    "url": "https://www.wsj.com/world/europe/evan-gershkovich-prisoner-exchange-ccb39ad3?st=4is8gx68wgvk2ar"
  },
  {
    "text": "Trump loses appeal of gag order in hush money criminal case  —  A New York state appeals court on Thursday rejected former U.S. President Donald Trump's challenge to a gag order in his criminal case on charges stemming from hush money paid to a porn star.  —  The Appellate Division's ruling … ",
    "url": "https://www.reuters.com/legal/trump-loses-appeal-gag-order-hush-money-criminal-case-2024-08-01/"
  },
  {
    "text": "The presidential election is a toss-up  —  Kamala Harris is giving Democrats the race that Joe Biden couldn't.  —  I don't want to get in the habit of making a huge ruckus every time the election model passes a certain arbitrary probabilistic threshold.  There are still a very long 96 days … ",
    "url": "https://www.natesilver.net/p/the-presidential-election-is-a-toss"
  },
  {
    "text": "Pennsylvania Gov. Shapiro cancels Hamptons trip, days before expected Harris VP reveal … Pennsylvania Gov. Josh Shapiro has cancelled a trip to the ritzy New York beach enclave of the Hamptons, as he's being considered to be Vice President Kamala Harris' running mate, according to a person with direct knowledge of the matter.",
    "url": "https://www.cnbc.com/2024/08/01/shapiro-harris-vp-reveal-plans.html"
  },
  {
    "text": "How Hamas Leader Ismail Haniyeh Was Killed in Iran … A photograph circulating on Telegram and among Iranian officials on Wednesday showed a damaged building in northern Tehran.Provided to The New York Times  —  Ismail Haniyeh, a top leader of Hamas, was assassinated on Wednesday … ",
    "url": "https://www.nytimes.com/2024/08/01/world/middleeast/how-hamas-leader-haniyeh-killed-iran-bomb.html?unlocked_article_code=1._k0.5p-b.ORvQNs8_SL9A&smid=url-share"
  },
  {
    "text": "Senate GOP blocks bipartisan bill to expand child tax credit  —  Senate Republicans blocked Wednesday a bipartisan bill that would boost a tax credit for parents as the GOP and Democrats feud over remarks from Republican vice president nominee Sen. JD Vance (Ohio).",
    "url": "https://thehill.com/business/4805927-senate-republicans-block-child-tax-credit-bill/"
  },
  {
    "text": "A long shot for vice president, Pete Buttigieg is suddenly everywhere  —  In a reshaped race, the transportation secretary has dialed up his role as a key political messenger for the Democratic Party.  —  On Sunday, Pete Buttigieg was on Fox News, challenging the “warped reality” … ",
    "url": "https://www.washingtonpost.com/business/2024/08/01/buttigieg-harris-vp-transportation-social-media/"
  },
  {
    "text": "While ‘Pod Save America’ Tries to Unite Democrats, Its Staff Rebels  —  Some employees feel their progressive ideals aren't reflected in the workplace at one of the most prominent liberal media outlets  —  As one of the most influential media outlets for Democrats, the liberal podcast Pod Save America … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-01/-pod-save-america-staff-is-disillusioned-by-the-politics-at-media-powerhouse?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTcyMjUxNDk2MSwiZXhwIjoxNzIzMTE5NzYxLCJhcnRpY2xlSWQiOiJTSEpHMDZUMEcxS1gwMCIsImJjb25uZWN0SWQiOiI2RjVFRDg4M0RCMDU0QUQwODc0QTE3MUNBOEI0MUY5NSJ9.sbvWLv5a04JcgpJ9zJYV_uA4fXhgSmNYaDYi3afZL-w"
  },
  {
    "text": "Critics Stunned By Donald Trump's ‘Heartless’ Punch Line About Man Killed At His Rally  —  The Republican nominee was slammed as horrible, unkind and a “self-centered sadistic monster” over the line.  —  LOADING  —  Donald Trump drew fierce criticism for making a crass comment about the wife … ",
    "url": "https://www.huffpost.com/entry/donald-trump-rally-joke-ripped_n_66ab2032e4b088c373ceeab5"
  },
  {
    "text": "Secret Service's Tech Flaws Helped Gunman Evade Detection at Trump Rally  —  Technologies that might have protected the former president failed because they were improperly deployed or because the Secret Service chose not to use them.  —  After a week of oversights and failures … ",
    "url": "https://www.nytimes.com/2024/08/01/us/politics/secret-service-technology-trump.html"
  },
  {
    "text": "Don Lemon Sues Elon Musk Over Canceled X Deal  —  The former CNN reporter said in a lawsuit that X had refused to pay him after a testy interview with its billionaire owner.  —  Don Lemon, the former CNN anchor, sued Elon Musk and X on Thursday, arguing that the billionaire refused to pay … ",
    "url": "https://www.nytimes.com/2024/08/01/technology/don-lemon-elon-musk-lawsuit.html"
  },
  {
    "text": "‘Betrayed the American People’: Rep. Stefanik Slams Biden-Harris Admin's ‘Sickening’ 9/11 Plea Deal  —  Rep. Elise Stefanik (R., N.Y.) on Thursday said the Biden-Harris administration “betrayed the American people” by striking a “sickening” plea deal that lets the three terrorists behind the 9/11 attack avoid the death penalty.",
    "url": "https://freebeacon.com/latest-news/betrayed-the-american-people-rep-stefanik-slams-biden-harris-admins-sickening-9-11-plea-deal/"
  }
]