[
  {
    "text": "Invocation of the Alien Enemies Act Regarding the Invasion of The United States by Tren De Aragua  —  BY THE PRESIDENT OF THE UNITED STATES OF AMERICA  —  Tren de Aragua (TdA) is a designated Foreign Terrorist Organization with thousands of members, many of whom have unlawfully infiltrated … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/invocation-of-the-alien-enemies-act-regarding-the-invasion-of-the-united-states-by-tren-de-aragua/"
  },
  {
    "text": "Court blocks deportations hours after Trump says he invoked Alien Enemies Act  —  A little before 7:00 p.m. Saturday, a federal judge issued an order temporarily stopping deportations set in motion by President Donald Trump hours earlier when he announced that he had invoked a law last used to justify Japanese internment camps.",
    "url": "https://www.lawdork.com/p/alien-enemies-act-venezuela-tro"
  },
  {
    "text": "Trump invokes 18th century law to speed deportations, judge stalls it hours later  —  A federal judge barred the Trump administration Saturday from carrying out deportations under a sweeping 18th century law that the president invoked hours earlier to speed removal of Venezuelan gang members from the United States.",
    "url": "https://apnews.com/article/trump-aclu-deportations-venezuelans-b2566f05b10bf1cde1caf467a3b001cc"
  },
  {
    "text": "LIVE March 15, 2025, 11:41 a.m. ET Trump Orders Gutting of 7 Agencies, Including Voice of America's Parent  —  Where Things Stand  — Alien Enemies Act: A federal judge on Saturday said the Trump administration must halt use of an obscure wartime law, called the Alien Enemies Act of 1798, to deport Venezuelans.",
    "url": "https://www.nytimes.com/live/2025/03/15/us/trump-news"
  },
  {
    "text": "Judge blocks Trump after he invokes wartime Alien Enemies Act to speed up deportations  —  Trump invoked the Alien Enemies Act against Tren de Aragua members.  A federal judge later ordered the administration to turn around any planes that had already taken off.",
    "url": "https://www.washingtonpost.com/immigration/2025/03/15/trump-alien-enemies-venezuela-migrants-deportations/"
  },
  {
    "text": "Voice of America staff put on leave after Trump orders cuts  —  Employees at Voice of America were placed on paid leave on Saturday and funding for two U.S. news services that broadcast to authoritarian regimes was slashed, one day after President Donald Trump signed an executive order gutting … ",
    "url": "https://www.reuters.com/business/media-telecom/trump-signs-order-gut-voice-america-other-agencies-2025-03-15/"
  },
  {
    "text": "Requiem for the voice that carried a nation's conscience  —  I am speaking here in my personal capacity and not as a representative of any agency or organization, past, present or future...  My colleagues and our broadcasts, devoted to telling America's story to the world — honestly … ",
    "url": "https://www.steveherman.press/p/requiem-for-the-voice-that-carried"
  },
  {
    "text": "Trump signs order to gut staff at Voice of America and other US-funded media organizations  —  President Donald Trump's administration on Saturday began making deep cuts to Voice of America and other government-run, pro-democracy programming, with the organization's director saying all VOA employees have been put on leave.",
    "url": "https://apnews.com/article/trump-voice-of-america-cuts-3faf72e620dbc5f42e5508a2b9d8c8da"
  },
  {
    "text": "‘Bloody Saturday’ at Voice of America and other U.S.-funded networks  —  Journalists showed up at the Voice of America today to broadcast their programs only to be told they had been locked out: Federal officials had embarked on indefinite mass suspensions.  —  All full-time staffers … ",
    "url": "https://www.npr.org/2025/03/15/nx-s1-5329244/bloody-saturday-voiceofamerica-radio-free-asia-europe-trump-kari-lake"
  },
  {
    "text": "Indivisible Calls on Schumer to Step Aside  —  WASHINGTON, D.C.—Yesterday, Minority Leader Chuck Schumer surrendered leverage in the Senate, paving the way for a GOP funding bill that jeopardizes critical programs and accelerates the efforts of Trump, Musk and congressional Republicans … ",
    "url": "https://indivisible.org/statements/indivisible-calls-schumer-step-aside"
  },
  {
    "text": "Liberal group calls for Schumer to step down as minority leader after spending bill vote  —  The request by Indivisible indicates just how much his decision has angered the Democratic grassroots.  —  The liberal organizing group Indivisible said Saturday it was calling for Senate Minority … ",
    "url": "https://www.politico.com/news/2025/03/15/dem-group-calls-schumer-step-down-minority-leader-spending-bill-vote-00232194"
  },
  {
    "text": "A Title VI Demand Letter That Itself Violates Title VI (and the Constitution)  —  By Kate Andrias, Jessica Bulman-Pozen, Jamal Greene, Olatunde Johnson, Jeremy Kessler, Gillian Metzger, and David Pozen  —  On Thursday, the president of Columbia University received a remarkable letter … ",
    "url": "https://balkin.blogspot.com/2025/03/a-title-vi-demand-letter-that-itself.html"
  },
  {
    "text": "Trump Orders Attacks on Militant Sites in Yemen and Issues a Warning to Iran  —  The air and naval strikes on targets controlled by the Iran-backed Houthi fighters were intended to open up international shipping lanes in the Red Sea.  —  The United States carried out large-scale military strikes … ",
    "url": "https://www.nytimes.com/2025/03/15/us/politics/us-attack-houthis.html?unlocked_article_code=1.4E4.L_Jf.rG1ujfWb4AWs&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Brown Medicine doctor deported despite federal court order.  What we know.  —  A federal court order that would have halted the immediate deportation of a Rhode Island doctor was issued Friday evening while the doctor's departing plane sat on the tarmac at Boston Logan International Airport, said a family friend and colleague.",
    "url": "https://www.providencejournal.com/story/news/local/2025/03/15/rhode-island-doctor-rasha-alawieh-deported-despite-federal-court-order/82441360007/"
  },
  {
    "text": "Oklahoma man says Social Security benefits terminated without warning or explanation  —  OKLAHOMA CITY (KFOR) — An Oklahoma City retiree said his Social Security benefits were suspended without warning — and with no explanation given when he reached out.  He worries it may have to do with the place … ",
    "url": "https://www.wkrn.com/news/national/oklahoma-man-says-social-security-benefits-terminated-without-warning-or-explanation/"
  },
  {
    "text": "RFE/RL President: Defunding Would be “Massive Gift to America's Enemies”  —  RFE/RL President: Defunding Would be “Massive Gift to America's Enemies”  —  Radio Free Europe/Radio Liberty (RFE/RL) was informed today by the U.S. Agency for Global Media (USAGM) that its federal grant agreement … ",
    "url": "https://about.rferl.org/article/rfe-rl-president-defunding-would-be-massive-gift-to-americas-enemies/"
  },
  {
    "text": "Border patrol grabs Venezuelan parents in D.C., despite protected status  —  Their arrests, weeks before TPS is set to expire for many Venezuelans, raised alarms that the Trump administration is again willing to separate parents and children.  —  Just now  —  The Venezuelan couple … ",
    "url": "https://www.washingtonpost.com/immigration/2025/03/15/immigration-arrests-temporary-protected-status/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyMDExMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzMzkzNTk5LCJpYXQiOjE3NDIwMTEyMDAsImp0aSI6IjdhNzA2NzgxLWJlYTQtNDEwMS1hOTk3LTZhNDE0MjMzNzVkYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9pbW1pZ3JhdGlvbi8yMDI1LzAzLzE1L2ltbWlncmF0aW9uLWFycmVzdHMtdGVtcG9yYXJ5LXByb3RlY3RlZC1zdGF0dXMvIn0.FnQcZJ07cj_r5VxFRzAzu9PQVTEFioSKop1fvsYVeac&itid=gfta"
  },
  {
    "text": "Trump Seeks More Sway in Picking Kennedy Center Honorees  —  The president, who recently had himself installed as the center's chairman, has called a meeting of its board to approve changes that would give him more input in the process.  —  When President Trump was criticized by some of the artists … ",
    "url": "https://www.nytimes.com/2025/03/15/arts/music/trump-kennedy-center-honors.html"
  },
  {
    "text": "A mural of Anthony Fauci was meant to inspire staff.  Then NIH took it down.  —  A mural of Tony Fauci was meant to inspire staff.  Then NIH took it down.  —  Five years after the coronavirus pandemic began, Trump officials continue to blame Fauci for missteps — and are minimizing his presence on his old campus.",
    "url": "https://www.washingtonpost.com/politics/2025/03/15/mural-tony-fauci-was-meant-inspire-staff-then-nih-it-down/"
  },
  {
    "text": "CA 120: Gavin's podcast - Presidential run or empire building?  —  This is the second of a two-part series analyzing the impact of Gov. Gavin Newsom's podcast, “This is Gavin Newsom.”  Part one can be accessed here.  —  In last week's article we reviewed polling on Governor Newsom's announcement … ",
    "url": "https://capitolweekly.net/ca-120-gavins-podcast-presidential-run-or-empire-building/"
  },
  {
    "text": "JACL condemns Trump erasure of 442nd and 100th Infantry Battalion  —  President Trump's crusade to wipe out any reference to diversity, equity and inclusion is leading to a whitewashing of American history.  —  On March 7, r eports surfaced that some 26,000 images equated with DEI … ",
    "url": "https://asamnews.com/2025/03/14/diversity-equity-and-inclusion-erasure-japanese-american-history-removed/"
  },
  {
    "text": "Fox News Host Jesse Watters Says His Mom Is ‘Upset’ Over DOGE Cuts  —  Watters previously advocated for the department's massive cuts, which are now slated to have an impact on the university where his sister is employed.  —  Fox News host Jesse Watters said his mom is “upset” … ",
    "url": "https://www.huffpost.com/entry/jesse-watters-doge-sister_n_67d5a6fbe4b0a37116af27d5"
  }
]