[
  {
    "text": "Exclusive: Newly discovered photos and video shed fresh light on Trump's ties to Jeffrey Epstein  —  Newly uncovered archived video footage and photos reveal fresh details about Donald Trump's past relationship with Jeffrey Epstein.  —  Photos from 1993 confirm for the first time that Epstein … ",
    "url": "https://cnn.com/2025/07/22/politics/kfile-trump-epstein-photos-footage"
  },
  {
    "text": "Trump Administration Live Updates: Johnson Shutting Down House Early to Block Epstein Vote  —  Where Things Stand  — Epstein case: Speaker Mike Johnson said he would shut the House down early for its summer recess to head off Democratic demands for votes on calling for the release of files … ",
    "url": "https://www.nytimes.com/live/2025/07/22/us/trump-news?unlocked_article_code=1.YU8.XvZe.Uq4wam0YefJ6&smid=url-share"
  },
  {
    "text": "Obama rebukes Trump's accusations in rare response  —  Former President Obama swung back at President Trump on Tuesday in a rare response to unfounded accusations. … - “But these claims are outrageous enough to merit one,” he added. … - “Nothing in the document issued last week undercuts … ",
    "url": "https://www.axios.com/2025/07/22/obama-trump-accusations-response"
  },
  {
    "text": "The Administration Wants Military Women to Know Their Place  —  Pete Hegseth seems to be on a mission to erase women from the top ranks of the U.S. armed forces.  —  President Donald Trump and Secretary of Defense Pete Hegseth seem to be on a mission to erase women from the top ranks of the U.S. armed forces.",
    "url": "https://www.theatlantic.com/newsletters/archive/2025/07/hegseths-purge-of-women-from-us-military-leadership/683631/?gift=otEsSHbRYKNfFYMngVFweGQt6vMeeEgrRT-qJs6gN1s&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Republicans propose naming Kennedy Center Opera House after Melania Trump  —  The House Appropriations committee passed an amendment that would rename the theater, months after President Donald Trump took over the performing arts center.  —  The Kennedy Center's Opera House could soon be called the … ",
    "url": "https://www.washingtonpost.com/entertainment/theater/2025/07/22/melania-trump-kennedy-center-opera-house-appropriations-bill/"
  },
  {
    "text": "U.S. Olympic Officials Bar Transgender Women From Women's Competitions  —  The U.S. Olympic & Paralympic Committee changed its eligibility rules on Monday to comply with President Trump's executive order, taking the decision away from national governing bodies for each sport.",
    "url": "https://www.nytimes.com/2025/07/22/us/politics/us-olympics-trans-women-athletes-ban-trump.html"
  },
  {
    "text": "Trump says trade deal struck with Japan includes 15% tariff  —  President Donald Trump on Tuesday said the U.S. and Japan had struck a trade deal that includes a 15% tariff that will be levied on U.S. imports from the country.  —  In a post on Truth Social, Trump said the deal … ",
    "url": "https://www.reuters.com/business/trump-says-trade-deal-struck-with-japan-includes-15-tariff-2025-07-22/"
  },
  {
    "text": "Videos reveal harsh conditions inside Ice's New York City confinement center  —  Footage shows people sleeping on floor next to toilets in facility that agency says is not a detention site  —  Two videos have surfaced shedding light on what is happening behind closed doors at a New York federal building … ",
    "url": "https://www.theguardian.com/us-news/2025/jul/22/ice-videos-new-york-trump"
  },
  {
    "text": "E.P.A. Is Said to Draft a Plan to End Its Ability to Fight Climate Change  —  According to two people familiar with the draft, it would eliminate the bedrock scientific finding that greenhouse-gas emissions threaten human life by dangerously warming the planet.",
    "url": "https://www.nytimes.com/2025/07/22/climate/epa-endangerment-finding-rescind.html?unlocked_article_code=1.Yk8.ASYE.FzW5jm0o_jfC&smid=url-share"
  },
  {
    "text": "Judges vote to oust Trump pick Alina Habba as U.S. attorney in New Jersey  —  The state's U.S. district court judges made the announcement in a brief order that did not offer any explanation for their decision.  —  New Jersey's federal judges declined Tuesday to appoint Alina Habba … ",
    "url": "https://www.washingtonpost.com/national-security/2025/07/22/trump-lawyer-alina-habba-nj-us-attorney/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUzMTU2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzU0NTM5MTk5LCJpYXQiOjE3NTMxNTY4MDAsImp0aSI6IjE4ZTBhYmRhLTM1ZWUtNGViNC1iNWY3LWY1YzQzODRkYWMxMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzIyL3RydW1wLWxhd3llci1hbGluYS1oYWJiYS1uai11cy1hdHRvcm5leS8ifQ.BphElPTMKa8bj56BBMNgBsUAWWYS8dHo5_4cjj1_Ghs&itid=gfta"
  },
  {
    "text": "Showdown in New Jersey Over Top Federal Prosecutor  —  Alina Habba's term as interim U.S. attorney was set to expire this week.  Federal judges announced a replacement, but Attorney General Pam Bondi quickly intervened.  —  5 MIN READ  —  As Billionaire Funds Opera House, Nazi-Era Questions Linger Over His Company",
    "url": "https://www.nytimes.com/2025/07/22/nyregion/alina-habba-nj-us-attorney.html?unlocked_article_code=1.YU8.xiUk.VhXWrRUwYs2C&smid=url-share"
  },
  {
    "text": "White House eyeing education cuts for next funding clawback package … In a brief interview Tuesday, House Majority Leader Steve Scalise also would not disclose specifics about the forthcoming package, but confirmed talks between GOP leaders and the administration on the matter are well underway.",
    "url": "https://www.politico.com/news/2025/07/22/white-house-education-cuts-clawback-package-00468856"
  },
  {
    "text": "Trump Told Park Workers to Report Displays That ‘Disparage’ Americans.  Here's What They Flagged.  —  Descriptions and displays at scores of parks and historic sites have been flagged for review in connection with an executive order from President Trump.  —  At Cape Hatteras National Seashore … ",
    "url": "https://www.nytimes.com/2025/07/22/climate/trump-national-park-service-history-changes.html?unlocked_article_code=1.Yk8.osVE.-tVxqA7q4xsJ&smid=url-share"
  },
  {
    "text": "7/23/25 ☀️ AM: … But if you're a House member or staffer, August starts this afternoon around 4 p.m. … Some members will hold town halls.  Others will head overseas as part of congressional delegations.  Many will vacation.  Speaker Mike Johnson has his annual high-dollar donor retreat in Wyoming.",
    "url": "https://punchbowl.news/archive/72325-am/"
  },
  {
    "text": "Hunter Biden Really Needs to Shut It  —  QUIET TIME  —  Why is he talking?  Why is he still talking?  —  OPINION  —  Let's establish a few quick facts about Hunter Biden: He has never been elected to anything, ever.  His business acumen appears to amount, largely, to having the last name “Biden.”",
    "url": "https://www.thedailybeast.com/hunter-biden-really-needs-to-shut-it/"
  },
  {
    "text": "Bari Weiss seeks more than $200mn for media start-up The Free Press  —  ‘Anti-woke’ journalist holds talks with incoming CBS owner David Ellison over sale of new media venture  —  Ivan Levingston and Daniel Thomas in London, James Fontanella-Khan and Anna Nicolaou in New York",
    "url": "https://www.ft.com/content/0f1ce3d6-35bc-461f-9685-13e2dfddb08d"
  },
  {
    "text": "US Nuclear Weapons Agency Breached in Microsoft SharePoint Hack  —  The US agency responsible for maintaining and designing the nation's cache of nuclear weapons was among those breached by a hack of Microsoft Corp.'s SharePoint document management software, according to a person with knowledge of the matter.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-23/us-nuclear-weapons-agency-breached-in-microsoft-sharepoint-hack"
  },
  {
    "text": "‘Those days are over’: Trump books draw lackluster sales … “Everyone is desperately looking for the next Michael Wolff or James Comey for next year, but it's not clear there could ever be one again,” said one concerned publisher, referencing two of the authors with biggest book successes of Trump's first term.",
    "url": "https://www.politico.com/news/2025/07/22/donald-trump-books-nonfiction-sales-00466907"
  },
  {
    "text": "Florida's attorney general targets a restaurant over an LGBTQ Pride event  —  Florida's statewide prosecutor has subpoenaed records of a popular restaurant after it hosted an LGBTQ Pride event last month that the prosecutor's office says was open to all ages, even though a recent state law … ",
    "url": "https://apnews.com/article/florida-drag-show-law-vero-beach-uthmeier-7793dbe3ffd356dda4e678940463922c"
  },
  {
    "text": "Self-proclaimed Catholic fascist fired after Jubilee appearance  —  The self-proclaimed Catholic fascist who recently appeared on an episode of Surrounded by the popular YouTube channel Jubilee has lost his job following the programme's release.  The debate, which first aired on Sunday … ",
    "url": "https://thecatholicherald.com/article/self-proclaimed-catholic-fascist-fired-after-jubilee-appearance"
  },
  {
    "text": "GOP Confirms Anti-Abortion Judge With Help From An Independent Senator  —  Senate Republicans handed Trump a win on Tuesday with confirmation of one his first judicial nominees, Joshua Divine.  —  Divine, 35, will now hold a lifetime seat on a U.S. district court in Missouri.",
    "url": "https://www.huffpost.com/entry/trump-tariffs-white-house-latest_n_686ec29fe4b09bd98fe4be7e/liveblog_687febe6e4b05e47c5b83536"
  },
  {
    "text": "NPR news chief announces she's leaving days after Congress kills federal funding  —  NPR's editor in chief and acting chief content officer Edith Chapin told colleagues Tuesday morning that she has decided to step down.  —  The veteran news leader's announcement comes just days … ",
    "url": "https://www.npr.org/2025/07/22/nx-s1-5476192/npr-news-chief-edith-chapin-to-step-down-congress-funding-trump"
  },
  {
    "text": "Zelenskyy approves bill weakening anti-corruption bodies despite big protests  —  Move by Ukrainian president widely opposed and may prove a setback to hopes of country one day joining the EU  —  Volodymyr Zelenskyy has approved a contentious bill weakening Ukraine's anti-corruption bodies … ",
    "url": "https://www.theguardian.com/world/2025/jul/22/zelenskyy-approves-bill-weakening-anti-corruption-bodies-despite-big-protests"
  },
  {
    "text": "FEMA Urban Search and Rescue Chief Resigns, Citing Agency ‘Chaos’, Colleagues Said  —  Ken Pagurek had told colleagues the Trump administration was causing ‘chaos’ inside FEMA and creating dangerous delays in disaster response.  —  The head of the Federal Emergency Management Agency's urban search … ",
    "url": "https://www.nytimes.com/2025/07/22/climate/fema-urban-search-rescue-chief-resigns.html?unlocked_article_code=1.YU8.mVWB.gPbabybsR3SL&smid=url-share"
  },
  {
    "text": "Trump Expects $20 Million More in Ad Dollars From ‘60 Minutes’ Settlement  —  President posts on social media that he will receive more than the already agreed to $16 million payment  —  President Trump said that he anticipates receiving advertising and public service ad commitments worth $20 million … ",
    "url": "https://www.wsj.com/business/media/trump-60-minutes-cbs-settlement-5e3f1ce0"
  },
  {
    "text": "Amid Fear of Retaliation, N.S.F. Workers Sign Letter of Dissent  —  In a public letter, employees of the National Science Foundation accused the administration of politicizing the agency and impeding scientific innovation.  —  More than 140 employees of the National Science Foundation … ",
    "url": "https://www.nytimes.com/2025/07/22/science/trump-science-foundation-letter.html"
  },
  {
    "text": "Military Says It Will ‘Continuously’ Monitor Bathrooms to Comply With Anti-Trans Order  —  This article was primarily reported using public records requests.  We are making it available to all readers as a public service.  FOIA reporting can be expensive, please consider subscribing to 404 Media to support this work.",
    "url": "https://www.404media.co/pentagon-says-it-will-continuously-monitor-bathrooms-to-comply-with-anti-trans-order/"
  }
]