[
  {
    "text": "Did ‘vermin’ mark a turning point in Trump coverage?  —  Saturday night was a low point in the elite media's coverage of Donald Trump.  —  The New York Times put a light-hearted headline on a news article about Trump's Veterans Day address in New Hampshire, in which he vowed to “root out” … ",
    "url": "https://presswatchers.org/2023/11/did-vermin-mark-a-turning-point-in-trump-coverage/"
  },
  {
    "text": "How Trump's rhetoric compares to Hitler's  —  Donald Trump has long toyed with the language of famous autocrats, authoritarians and fascists.  Think: “enemy of the people,” “retribution” and the frequent, years-long allusions to political violence.  —  But even by his standards … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/13/how-trumps-rhetoric-compares-hitlers/"
  },
  {
    "text": "It's Not the Gaffes.  It's the Plans.  —  Pay attention to what Trump is going to do.  —  Because it's Monday, let's start with the bottom story of the day: Tim Scott Suspends Campaign, as His Sunny Message Failed to Resonate - The New York Time s  —  Who knew that sunny optimism … ",
    "url": "https://plus.thebulwark.com/p/its-not-the-gaffes-its-the-plans"
  },
  {
    "text": "‘The boss is not going to leave’: Proffer videos show ex-Trump lawyers telling Georgia prosecutors about efforts to overturn 2020 election  —  ABC News obtained video from interviews held with Jenna Ellis and Sidney Powell.  —  Jenna Ellis reads a statement after Ellis pleading guilty … ",
    "url": "https://abcnews.go.com/US/boss-leave-proffer-videos-show-trump-lawyers-telling/story?id=104831939"
  },
  {
    "text": "South Carolina Sen. Tim Scott abruptly ends 2024 presidential bid, shocking even his campaign staff  —  Republican presidential candidate Tim Scott abruptly announced late Sunday that he was dropping out of the 2024 race, a development that surprised his donors and stunned his campaign staff … ",
    "url": "https://apnews.com/article/tim-scott-drops-out-2024-race-b9cc8fbeba57a123789d8d0484164e38"
  },
  {
    "text": "'I've seen better run city council campaigns': Tim Scott's allies fume after exit  —  The South Carolina senator told just two campaign staff members of his plan to drop out.  —  When Tim Scott announced the end of his presidential bid from the studio of his house in Hanahan, S.C. … ",
    "url": "https://www.politico.com/news/2023/11/13/tim-scott-allies-fume-exit-00126827"
  },
  {
    "text": "Mike Johnson's Shady Finances Are Already Coming Back to Bite Him  —  Speaker Mike Johnson (R-LA) is facing a new ethics complaint over a litany of alleged violations with his financial disclosures. … When newly minted Republican Speaker of the House Mike Johnson was asked on Fox News … ",
    "url": "https://www.thedailybeast.com/mike-johnsons-shady-finances-are-already-coming-back-to-bite-him"
  },
  {
    "text": "The Supreme Court says it is adopting a code of ethics for the first time  —  The Supreme Court is adopting its first code of ethics, in the face of sustained criticism over undisclosed trips and gifts from wealthy benefactors to some justices.  The policy was issued by the court Monday.",
    "url": "https://apnews.com/article/supreme-court-ethics-code-conflicts-clarence-thomas-64d393ceb6f05402d762dca06f0f4187"
  },
  {
    "text": "Trump's Truth Social has lost $73 million in less than 2 years, new filing says  —  Former President Trump's social media platform, Truth Social, has lost $73 million in net sales since the platform's official launch in February 2022, according to a new financial disclosure filing from Digital World Acquisition Corp. (DWAC).",
    "url": "https://thehill.com/homenews/media/4308023-trumps-truth-social-has-lost-73-million-in-less-than-two-years-new-filing-says/"
  },
  {
    "text": "If Biden can't run a normal campaign, he should step aside  —  Democrats are taking a huge risk either way.  But they shouldn't try to get away with a Rose Garden campaign.  —  It's inherently kind of crazy that American presidential campaigns take more than a year to run, but they do.",
    "url": "https://www.natesilver.net/p/if-biden-cant-run-a-normal-campaign"
  },
  {
    "text": "Maryanne Trump Barry, Donald Trump's Older Sister, Dies at 86  —  A retired federal judge in New Jersey, she supported her brother but, as secret audio recordings revealed in 2019, she could also be scathingly critical of him.  —  Maryanne Trump Barry, a former federal judge who was an older sister … ",
    "url": "https://www.nytimes.com/2023/11/13/us/politics/maryanne-trump-barry-dead.html"
  },
  {
    "text": "Virginia Rep. Abigail Spanberger is running for governor instead of seeking reelection to the House  —  Democratic U.S. Rep. Abigail Spanberger, a former CIA officer who has cultivated an identity as a bipartisan consensus builder over three terms in Congress, announced on Monday that she will run … ",
    "url": "https://apnews.com/article/spanberger-virginia-governor-candidacy-c19ade683ab0dfaef67051b36791d30a"
  },
  {
    "text": "Democrats get surprisingly good news from America's Trumpiest court  —  The Fifth Circuit decided to obey the law, for a change.  —  Last Friday, a federal appeals court nudged Louisiana toward redrawing its congressional maps to include a second Black-majority district.",
    "url": "https://www.vox.com/scotus/2023/11/13/23959252/supreme-court-fifth-circuit-louisiana-gerrymander-robinson-ardoin"
  },
  {
    "text": "EXCLUSIVE - First photos reveal the COCAINE found in the White House: Images of the baggy in cubby hole that sparked White House investigation - and the culprit has still not been found  — DailyMail.com uncovered photos through a Freedom of Information Act request",
    "url": "https://www.dailymail.co.uk/news/article-12744675/First-photos-reveal-COCAINE-White-House-Images.html"
  },
  {
    "text": "House shelves Greene's resolution to impeach Mayorkas  —  The House shelved a resolution to impeach Homeland Security Secretary Alejandro Mayorkas on Monday, punting on Rep. Marjorie Taylor Greene's (R-Ga.) effort to boot the Biden administration official from his post for his handling of the situation at the U.S.-Mexico border.",
    "url": "https://thehill.com/homenews/house/4307918-house-shelves-greenes-resolution-to-impeach-mayorkas/"
  },
  {
    "text": "First nonbinary Mexican magistrate found dead at home  —  Jesús Ociel Baena made history last year after becoming the first openly nonbinary person to assume a judicial position in the country.  —  MEXICO CITY — The first openly nonbinary person to assume a judicial position in Mexico … ",
    "url": "https://www.nbcnews.com/news/latino/first-nonbinary-mexican-magistrate-found-dead-home-rcna125009"
  },
  {
    "text": "California middle-schooler banned from sports over ‘black face’ — but group says he was just wearing eye paint  —  A California middle-schooler was suspended for allegedly wearing “blackface” to a local football game — but a national civil rights group claims the boy was just wearing eye paint.",
    "url": "https://nypost.com/2023/11/13/news/california-middle-schooler-banned-from-sports-over-black-face-but-group-says-he-was-just-wearing-eye-paint/"
  },
  {
    "text": "Strip Clubs, Lewd Photos and a Boozy Hotel: The Toxic Atmosphere at Bank Regulator FDIC  —  Employees say sexual harassment, misogyny pervade federal agency tasked with ensuring stability of nation's banks, driving women to leave  —  A male Federal Deposit Insurance Corp. supervisor in San Francisco invited employees to a strip club.",
    "url": "https://www.wsj.com/us-news/fdic-toxic-atmosphere-strip-clubs-lewd-photos-boozy-hotel-12c89da7?mod=followamazon"
  }
]