[
  {
    "text": "Mark Zuckerberg lies about content moderation to Joe Rogan's face … I'll spare you the experience of listening to one of the richest men in the world whine and just tell you straight out: Mark Zuckerberg's interview on The Joe Rogan Experience is full of lies.",
    "url": "https://www.theverge.com/2025/1/10/24341117/mark-zuckerberg-facebook-joe-rogan-lies"
  },
  {
    "text": "Trump claims Biden blocking his agenda at the last-minute.  Policy experts weigh in.  —  Biden has banned much offshore drilling while Trump says “drill, baby, drill.”  —  President Joe Biden and President-elect Donald Trump  —  As his time in the White House comes to a close … ",
    "url": "https://abcnews.go.com/Politics/trump-claims-biden-blocking-agenda-minute-policy-experts/story?id=117562473"
  },
  {
    "text": "Jeff Bezos' WaPo reeling from losses and ‘internal drama’ as Trump returns to DC: report  —  At a time when the always newsworthy Donald Trump is headed back to the White House, the venerable Washington Post should be gearing up to cover his second term but instead is being subjected to an exodus … ",
    "url": "https://www.rawstory.com/bezos-washington-post/"
  },
  {
    "text": "Despite Trump's Attacks, Republicans Made Big Gains in Mail Voting  —  As Republican voters embraced a practice that Donald J. Trump railed against for years, softening his tone only slightly in 2024, the party eroded a key Democratic advantage across the country.",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/trump-2024-election-mail-votes.html"
  },
  {
    "text": "President Biden Awards Presidential Medal of Freedom with Distinction to His Holiness Pope Francis  —  Today, President Biden spoke with His Holiness Pope Francis and named him as a recipient of the Presidential Medal of Freedom with Distinction.  The Presidential Medal of Freedom … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/11/president-biden-awards-presidential-medal-of-freedom-with-distinction-to-his-holiness-pope-francis/"
  },
  {
    "text": "'There are a lot of bitter people here, I'm one of them': rust belt voters on why they backed Trump again despite his broken promises  —  Many in Youngstown, Ohio, believe the president-elect will tackle the town's decline this time.  Others are worried about his character flaws.",
    "url": "https://www.theguardian.com/us-news/2025/jan/11/there-are-a-lot-of-bitter-people-here-im-one-of-them-rust-belt-voters-on-why-they-backed-trump-again-despite-his-broken-promises"
  },
  {
    "text": "DoJ releases its Tulsa race massacre report over 100 years after initial review  —  DoJ report acknowledges attack ‘was so systematic and coordinated that it transcended mere mob violence’  —  On Friday, the Department of Justice (DoJ) released its report on the Tulsa race massacre after announcing the review last September.",
    "url": "https://www.theguardian.com/us-news/2025/jan/10/tulsa-race-massacre-report-doj"
  },
  {
    "text": "Scoop: Denmark sent Trump team private messages on Greenland … - Trump has repeatedly declared that controlling Greenland — the world's largest island — is necessary for U.S. national security vis-a-vis Russia and China. … - Climate change is opening up the Arctic for competition between superpowers … ",
    "url": "https://www.axios.com/2025/01/11/denmark-response-trump-greenland-threat"
  },
  {
    "text": "In Congress, a Push for Proxy Voting for New Parents Draws Bipartisan Support … Representative Brittany Pettersen at the Capitol on Wednesday.Haiyun Jiang for The New York Times  —  Representative Brittany Pettersen, a second-term Colorado Democrat, was not planning to have a second child at the age of 43.",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/congress-proxy-voting-parental-leave.html"
  },
  {
    "text": "Scott Bessent, Trump's Billionaire Treasury Pick, Will Shed Assets to Avoid Conflicts  —  Financial disclosure forms show hundreds of millions of assets including property in the Bahamas and investments in Bitcoin and China's currency.  —  Scott Bessent, the billionaire hedge fund manager … ",
    "url": "https://www.nytimes.com/2025/01/11/business/scott-bessent-treasury-divest.html"
  },
  {
    "text": "O Canada, Come Join Us  —  My great-great-grandmother was born in Saint John, New Brunswick, and first saw the United States as a 10-year-old.  My great-grandfather was an Irish Canadian who married a Maine girl.  My wife's father was born in Ontario, descended from a long line of Newfoundlanders … ",
    "url": "https://www.nytimes.com/2025/01/11/opinion/o-canada-come-join-us.html"
  },
  {
    "text": "The California Wildfires Are the Latest Disaster Supercharged by Climate Change  —  Extreme weather events — deadly heat waves, floods, fires and hurricanes — are the consequences of a warming planet, scientists say.  —  As Los Angeles burned for days on end, horrifying the nation … ",
    "url": "https://www.nytimes.com/2025/01/10/climate/california-fires-climate-change-disasters.html?unlocked_article_code=1.oU4.teAw.73gudJ3Hvi9J&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Did Mayor Karen Bass really cut the fire department budget?  The answer gets tricky  —  When Mayor Karen Bass unveiled her budget plan for 2024-25, she called for a 2.7% reduction in spending at the Los Angeles Fire Department.  —  Her proposal, unveiled in April, sought $23 million in cuts … ",
    "url": "https://www.latimes.com/california/story/2025-01-10/how-much-did-the-l-a-fire-department-really-cut-its-budget"
  },
  {
    "text": "Mike Pence Shares the First Thing He Said to Trump in Four Years … Though Mike Pence hadn't seen Donald Trump since leaving the White House, the former vice president said he was grateful to get a moment to speak with him at Jimmy Carter's state funeral this week.",
    "url": "https://www.christianitytoday.com/2025/01/mike-pence-donald-trump-carter-funeral-russell-moore/"
  },
  {
    "text": "As L.A. Fires Rage, Trump and Newsom's Hostilities Resurface  —  California's Democratic governor, Gavin Newsom, and President-elect Donald J. Trump have long feuded.  Can the rancor be set aside to help a devastated city recover?  —  As fires raged around Los Angeles, Gov. Gavin Newsom … ",
    "url": "https://www.nytimes.com/2025/01/11/us/politics/los-angeles-fires-trump-newsom.html"
  },
  {
    "text": "Playbook: Kamala Harris' zombie fundraising  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  CALL IT THE 2028 BOWL — JD VANCE's Ohio State Buckeyes will meet PETE BUTTIGIEG's Notre Dame Fighting Irish in next Monday's college football national championship game in New Orleans.",
    "url": "https://www.politico.com/newsletters/playbook/2025/01/11/kamala-harris-zombie-fundraising-00197681"
  },
  {
    "text": "DOJ says judge was ‘plainly’ wrong to block Trump election interference report  —  The Justice Department filed an emergency motion late Friday pushing for the speedy release of special counsel Jack Smith's investigative report on President-elect Donald Trump's alleged effort to overturn … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2025/01/11/justice-department-jack-smith-trump-report-release/77624205007/"
  },
  {
    "text": "Protesters chanting ‘no to Nazis’ block access to AfD party congress  —  Summit attendees are expected to formally nominate Alice Weidel as the far-right candidate for chancellor in next month's election.  —  Thousands of demonstrators gathered in the East German town of Riesa on Saturday … ",
    "url": "https://www.politico.eu/article/protesters-chanting-no-to-nazis-block-access-to-afd-party-congress/"
  },
  {
    "text": "Pressure mounts on Farage to resign after break with Musk  —  Ten Reform UK councillors quit in protest over the “incompetent or malevolent” management of the far-right party.  —  A group of 10 Reform UK councillors have resigned in a bid to get Nigel Farage to step down as the right-wing party's leader.",
    "url": "https://www.politico.eu/article/pressure-mounts-on-farage-to-resign-savage-break-with-musk-rejection/"
  },
  {
    "text": "Biden Calls Meta's Ending of Fact-Checking Program ‘Shameful’  —  Responding to a question from a reporter, the president said he believed Americans “want to tell the truth.”  —  President Biden criticized Mark Zuckerberg, the chief executive of Meta, on Friday for deciding to abandon … ",
    "url": "https://www.nytimes.com/2025/01/10/us/politics/biden-meta-fact-checking.html"
  }
]