[
  {
    "text": "With Trump moving closer to renomination, rewriting Jan. 6 attack gains urgency  —  There is no mystery about the Capitol riot.  There is nothing intangible, no unseen engine for what occurred.  There is no uncertainty about what happened and why.  —  But because everything about what unfolded … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/27/jan6-donald-trump-truth-lies/"
  },
  {
    "text": "Judge denies Trump's ‘fishing expedition’ to subpoena Jan. 6 committee records  —  In one of the cases brought by Jack Smith, Trump's team had wanted to get its hands on what it described as “missing” records from the Jan. 6 committee.  —  WASHINGTON — A federal judge overseeing President … ",
    "url": "https://www.nbcnews.com/politics/justice-department/judge-denies-trumps-fishing-expedition-subpoena-jan-6-committee-record-rcna126894"
  },
  {
    "text": "Trump Has a Master Plan for Destroying the ‘Deep State’  —  I study government bureaucracies.  This is not normally a key political issue.  Right now, it is, and everyone should be paying attention.  —  Donald Trump, the former president and current candidate, puts it in apocalyptic terms … ",
    "url": "https://www.nytimes.com/2023/11/27/opinion/trump-deep-state-schedule-f.html"
  },
  {
    "text": "Sports Illustrated Published Articles by Fake, AI-Generated Writers  —  There was nothing in Drew Ortiz's author biography at Sports Illustrated to suggest that he was anything other than human.  —  “Drew has spent much of his life outdoors, and is excited to guide you through his never-ending list … ",
    "url": "https://futurism.com/sports-illustrated-ai-generated-writers"
  },
  {
    "text": "Biden condemns shooting of Palestinian students: ‘No place for violence or hate in America’  —  President Biden on Monday condemned the shooting in Burlington, Vt., that seriously injured three Palestinian college students visiting the city for Thanksgiving.",
    "url": "https://thehill.com/homenews/4329557-biden-condemns-shooting-palestinian-students-vermont/"
  },
  {
    "text": "Expelling George Santos: Democrats May Force GOP's Hand  —  Democrats may make the first move if Santos doesn't resign, or if GOP leaders don't act  —  As GOP leaders agonize over how to handle disgraced Rep. George Santos, R-N.Y., whose expulsion from Congress seemed inevitable last week, Democrats have a plan to force action.",
    "url": "https://themessenger.com/politics/expelling-george-santos-democrats-may-force-gops-hand"
  },
  {
    "text": "‘Stop the price-gouging’: Biden hits corporations over high consumer costs  — President Joe Biden took aim at corporations for charging prices he said were artificially high.  — “Any corporation that has not brought their prices back down, even as inflation has come down … ",
    "url": "https://www.cnbc.com/2023/11/27/white-house-supply-chain-bidenomics-wins.html"
  },
  {
    "text": "Word of the Year 2023  —  ‘Authentic,’ plus ‘rizz,’ ‘deepfake,’ ‘coronation,’ and other words that defined the year  —  Merriam-Webster's Word of the Year for 2023 is authentic—the term for something we're thinking about, writing about, aspiring to, and judging more than ever.",
    "url": "https://www.merriam-webster.com/wordplay/word-of-the-year"
  },
  {
    "text": "Antagonisms flare as red states try to dictate how blue cities are run  —  Despite long advocating small government and local control, Republican governors and legislators across a significant swath of the country are increasingly overriding the actions of Democratic cities … ",
    "url": "https://www.washingtonpost.com/nation/2023/11/27/red-states-blue-cities-preemption-control/"
  },
  {
    "text": "Biden campaign jumps into ObamaCare fight  —  The Big Story  —  President Biden's reelection campaign is enthusiastically jumping into a fight with former President Trump over the Affordable Care Act, also known as ObamaCare.  —  © Greg Nash, The Hill",
    "url": "https://thehill.com/newsletters/health-care/4329922-obamacare-fight-biden-trump/"
  },
  {
    "text": "Trump Rallies Aren't Even Really About Politics at This Point  —  Ron DeSantis and Nikki Haley have partisans.  Donald Trump has fans.  —  For all of Donald Trump's rhetorical innovations, personality quirks, and alleged criminal malfeasance, what has made him truly unique as a political figure … ",
    "url": "https://slate.com/news-and-politics/2023/11/trump-rallies-2024-presidential-campaign-biden-desantis-haley.html"
  },
  {
    "text": "How Christie dropping out could help Haley  —  Yes, polls suggest his supporters would largely move to her.  But it's probably helpful only in one state, and it's not nearly enough.  —  A battery of recent New Hampshire polls has shown Nikki Haley and Chris Christie running second and third … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/27/how-christie-dropping-out-could-help-haley/"
  },
  {
    "text": "Texas Gov. Abbott goes skydiving with 106-year-old  —  Texas Gov. Greg Abbott (R) just checked an item off his bucket list: going skydiving with a 106-year-old World War II veteran.  —  The Texas Tribune reported Monday that the governor traveled to an area near San Marcos to go skydiving with Al Blaschke … ",
    "url": "https://thehill.com/homenews/state-watch/4329372-texas-abbott-skydiving/"
  },
  {
    "text": "Speaker Johnson says he's ‘confident’ Ukraine, Israel aid will pass House  —  Speaker Mike Johnson (R-La.) said he is “confident and optimistic” that Congress can push through supplemental funding for both Israel and Ukraine — but did not commit to tying the two together … ",
    "url": "https://thehill.com/homenews/house/4329407-speaker-johnson-says-hes-confident-ukraine-israel-aid-will-pass-house/"
  },
  {
    "text": "Jonathan Braun, the drug smuggler Trump pardoned, once flew to California to beat an associate with a belt, prosecutors alleged  — A drug smuggler pardoned by Trump was accused of “viciously” beating a younger employee with a belt.  — Braun's “brutal assault left the 'kid's' entire body ‘black and blue,’” prosecutors alleged.",
    "url": "https://www.businessinsider.com/jonathan-braun-beat-associate-belt-prosecutors-trump-pardon-2023-11"
  },
  {
    "text": "Donations to GOP drop as worries mount about the party's finances  —  Donors have not cut as many large checks to the RNC in recent years, and the party's small-dollar program has also suffered  —  The Republican Party's finances are increasingly worrisome to party members … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/27/republican-party-finances-election/"
  },
  {
    "text": "Billionaire Ken Langone to meet with Nikki Haley in NY as he weighs backing her in 2024  — Home Depot co-founder and billionaire Ken Langone plans to meet with Nikki Haley next week in New York.  — “The only person I see who can give [Donald] Trump a run for his money is Nikki Haley,” Langone told CNBC in an interview Monday.",
    "url": "https://www.cnbc.com/2023/11/27/ken-langone-to-meet-with-nikki-haley-as-he-considers-support.html"
  },
  {
    "text": "COP28: UAE planned to use climate talks to make oil deals  —  The United Arab Emirates planned to use its role as the host of UN climate talks as an opportunity to strike oil and gas deals, the BBC has learned.  —  Leaked briefing documents reveal plans to discuss fossil fuel deals with 15 nations.",
    "url": "https://www.bbc.com/news/science-environment-67508331"
  }
]