[
  {
    "text": "Live Updates: Trump Guilty on All Counts in Hush-Money Case  —  Donald J. Trump, the former president and presumptive 2024 Republican nominee, was convicted on 34 felony counts of falsifying business records in a case stemming from a payment that silenced a porn star.",
    "url": "https://www.nytimes.com/live/2024/05/30/nyregion/trump-trial-verdict"
  },
  {
    "text": "Is Trump going to prison?  What to know about the possible sentence after his conviction  —  Washington — Former President Donald Trump has now been convicted in the New York “hush money” criminal trial, immediately raising a lot of questions and launching the case into uncharted territory … ",
    "url": "https://www.cbsnews.com/news/donald-trump-convicted-prison-sentence-new-york-criminal-trial/"
  },
  {
    "text": "Donald Trump Should Drop Out  —  Convicted felon Donald Trump's first words after the historic jury verdict were predictably defiant: “The real verdict is going to be November 5 by the people.”  —  The Biden-Harris campaign's communication director issued a statement (perhaps written … ",
    "url": "https://washingtonmonthly.com/2024/05/30/donald-trump-should-drop-out/"
  },
  {
    "text": "Queens man convicted  —  Former Jamaica Estates resident Donald Trump was convicted by a Manhattan jury on Thursday of 34 counts of falsifying business records in an effort to cover up a sex scandal he feared would ruin his chances of winning the 2016 presidential election.",
    "url": "https://queenseagle.com/all/2024/5/30/queens-man-convicted"
  },
  {
    "text": "Guilty: Trump becomes first former U.S. president convicted of felony crimes  —  He is the first former American president to be found guilty of felony crimes  —  Jurors in Trump hush money trial end 1st day of deliberations without a verdict, AP Explains  —  Donald Trump became … ",
    "url": "https://apnews.com/article/trump-trial-deliberations-jury-testimony-verdict-85558c6d08efb434d05b694364470aa0"
  },
  {
    "text": "Wrong Case, Right Verdict  —  The wrong case for the wrong offense just reached the right verdict.  —  Donald Trump will not be held accountable before the 2024 presidential election for his violent attempt to overturn the previous election.  He will not be held accountable before the election … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/05/wrong-case-right-verdict-trump-guilty/678551/"
  },
  {
    "text": "Trump Loses a Big Battle in His Lifelong War Against Accountability  —  His 34 guilty convictions turn this escape artist into a felon.  —  Donald Trump has been in a war with accountability his entire adult life, and accountability has usually lost.  In a New York City courtroom on Thursday … ",
    "url": "https://www.motherjones.com/politics/2024/05/trump-guilty-hush-money-election-interference/"
  },
  {
    "text": "How Trump's Team Blew It  —  The criminal trial of Donald Trump didn't have to end this way.  —  The prosecution's case had flaws that couldn't be wallpapered over even with weeks of testimony, over 200 exhibits and a polished and persuasive presentation by Alvin Bragg, the Manhattan district attorney, and his team.",
    "url": "https://www.nytimes.com/2024/05/30/opinion/trump-trial-defense.html"
  },
  {
    "text": "Sometimes, the system works  —  Trump finally meets a consequence for his criming. … It's almost impossible to overstate how weird it is to write about the former president of the United States being convicted of 34 counts of falsifying business records.",
    "url": "https://www.publicnotice.co/p/trump-guilty-verdict-new-york-criming"
  },
  {
    "text": "Trump aide declares Larry Hogan's campaign dead … - Hogan's call to respect the rule of law seems to have incensed at least one top Trump advisor.  — “You just ended your campaign,” said Chris LaCivita, a senior Trump advisor, on X in response to Hogan's comments.",
    "url": "https://www.axios.com/2024/05/30/trump-aide-larry-hogan-senate-campaign"
  },
  {
    "text": "Trump Convicted of Fraud to Cover-up Fucking a Sex Worker  —  The first five verdicts were guilty.  Updates as they come.  —  Update: All 34 counts came back guilty.  —  Update: Sentencing will be July 11, the week before the GOP Convention.  —  Update: The Biden campaign has issued this statement.",
    "url": "https://www.emptywheel.net/2024/05/30/trump-convicted-of-fraud-to-cover-up-fucking-a-sex-worker/"
  },
  {
    "text": "Biden secretly gave Ukraine permission to strike inside Russia with US weapons  —  It's a major reversal that will help Ukraine to better defend its second-largest city.  —  The Biden administration has quietly given Ukraine permission to strike inside Russia — solely near the area of Kharkiv … ",
    "url": "https://www.politico.com/news/2024/05/30/biden-ukraine-weapons-strike-russia-00160731"
  },
  {
    "text": "The Federalist CEO Calls For Republicans to Draw Up Lists of Democrats to ‘Put in Prison’ After Trump Verdict  —  Sean Davis, the CEO and co-founder of the the right-wing website The Federalist, called on Republicans to draw up lists of Democrats to “put in prison” in a social media post reacting … ",
    "url": "https://www.mediaite.com/news/the-federalist-ceo-calls-for-republicans-to-draw-up-lists-of-democrats-to-put-in-prison-after-trump-verdict/"
  },
  {
    "text": "John Cuneo's “A Man of Conviction”  —  The former President is found guilty on all thirty-four counts.  —  It's not the first time that news of a verdict against Donald J. Trump has been eagerly awaited by cartoonists, commentators, and the general public.",
    "url": "https://www.newyorker.com/culture/cover-story/cover-story-2024-06-10"
  },
  {
    "text": "U.S. Department of the Treasury, IRS Announce Direct File as Permanent Free Tax Filing Option, All 50 States and D.C. Invited to Join in Filing Season 2025  —  New Free Tool Made Possible by Resources from President Biden's Inflation Reduction Act  —  WASHINGTON—Today, the U.S. Department … ",
    "url": "https://home.treasury.gov/news/press-releases/jy2385"
  },
  {
    "text": "Readout of Secretary of Defense Lloyd J. Austin III's Meeting With People's Republic of China (PRC) Minister of National Defense Admiral Dong Jun  —  Pentagon Press Secretary Maj. Gen. Pat Ryder provided the following readout:  —  Secretary of Defense Lloyd J. Austin III and Admiral Dong Jun … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3792119/readout-of-secretary-of-defense-lloyd-j-austin-iiis-meeting-with-peoples-republ/"
  }
]