[
  {
    "text": "5 takeaways from the Republican Iowa caucuses  —  Former president Donald Trump won the Iowa caucuses Monday in the first step toward the 2024 Republican presidential nomination, keeping him on course for the coronation that has looked likely for months.  —  With an estimated 88 percent of the vote in … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/15/iowa-results-2024-takeaways/"
  },
  {
    "text": "Biden's weakness bolstered Trump's support in Iowa as electability took a back seat  —  Eight years after losing the Iowa caucuses, former President Donald Trump won the Hawkeye State by a record margin of nearly 30 percentage points, winning an outright majority of the state and blowing the polls out of the water.",
    "url": "https://www.washingtonexaminer.com/opinion/2798268/biden-weakness-bolstered-trump-iowa-electability-back-seat/"
  },
  {
    "text": "Iowa was Trump's to win.  Can anyone stop his march to the nomination?  —  The race for the Republican nomination heads to New Hampshire, where the pressure is on for Nikki Haley or Ron DeSantis to wrest a win from the former president  —  DES MOINES — Iowa was never destined to surprise.",
    "url": "https://www.washingtonpost.com/politics/2024/01/15/trumps-iowa-victory-analysis/"
  },
  {
    "text": "Haley's Missed Opportunity: Iowa Slows Her Roll Into New Hampshire  —  A third-place finish didn't deliver the boost Nikki Haley wanted as she tries to turn the race into a one-on-one with Donald Trump.  —  Nikki Haley had hoped to vault into New Hampshire ahead of next Tuesday's … ",
    "url": "https://www.nytimes.com/2024/01/16/us/politics/haley-new-hampshire-iowa.html"
  },
  {
    "text": "Vivek Ramaswamy drops out of the 2024 presidential race, endorses Trump  —  The 38-year-old first-time candidate campaigned as someone who could carry on the MAGA movement — but those voters largely stayed with Trump in Iowa.  —  DES MOINES, Iowa — Businessman Vivek Ramaswamy dropped … ",
    "url": "https://www.nbcnews.com/politics/2024-election/vivek-ramaswamy-dropping-2024-presidential-race-rcna133875"
  },
  {
    "text": "AP VoteCast: Who voted (and how) in Iowa caucuses  —  The majority of Iowa Republicans who are caucusing Monday believe in the need to “Make America Great Again,” a sign of how Donald Trump and his political movement have transformed a state party that denied him a victory eight years ago.",
    "url": "https://apnews.com/article/iowa-caucus-who-voted-how-poll-votecast-4d1d5eb89b32fbba3afedee90334148c"
  },
  {
    "text": "NBC News entrance poll: Breaking down Trump's big Iowa win  —  Republican caucusgoers who were older, very conservative, evangelical and didn't have a college degree made up Trump's Iowa coalition.  —  Donald Trump won nearly every voting bloc in the Iowa Republican caucuses … ",
    "url": "https://www.nbcnews.com/politics/2024-election/entrance-poll-trump-iowa-win-rcna133950"
  },
  {
    "text": "Live updates: DeSantis and Haley race for second place in Iowa  —  Donald Trump has won Iowa's leadoff presidential caucuses.  The former president's victory gives him a strong start in the race for the 2024 Republican presidential nomination as the contest moves to New Hampshire.",
    "url": "https://apnews.com/live/iowa-republican-caucuses-live-updates#0000018d-0fea-d051-a3bd-dffe2b310000"
  },
  {
    "text": "Trump plans to attend start of new E. Jean Carroll trial after Iowa caucuses  —  The former president will travel from Iowa, where NBC News projects he has won the first-in-the-nation caucuses, to the first day of the defamation damages trial in New York.  —  Former President Donald Trump intends … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-plans-attend-start-new-e-jean-carroll-trial-iowa-caucuses-rcna134028"
  },
  {
    "text": "Ann Coulter Breaks Down Why Trump Can't Beat Biden and ‘Trump Voters Are Morons’  —  Conservative pundit Ann Coulter expressed her frustration with Republican Trump voters over the weekend and made the case for why she doesn't believe the former president can beat President Joe Biden in a general election.",
    "url": "https://www.mediaite.com/politics/ann-coulter-breaks-down-why-trump-cant-beat-biden-and-trump-voters-are-morons/"
  },
  {
    "text": "Iowa Caucus Results  —  Donald J. Trump wins the Iowa Republican caucus.  —  Race called by The Associated Press.  —  Latest results from just now  —  39% of votes in  —  Republican Caucus  —  Candidate Votes  —  Pct.  Delegates Del.  —  23,736  —  52.8%  —  8,994  —  20.0%",
    "url": "https://www.nytimes.com/interactive/2024/01/15/us/elections/results-iowa-caucus.html"
  },
  {
    "text": "Sen. Bob Menendez and his wife seek separate trials in bribery case  —  Menendez and his wife have pleaded not guilty to charges alleging they accepted hundreds of thousands of dollars in exchange for the senator's influence in order to benefit three New Jersey businessmen and the Egyptian government.",
    "url": "https://www.nbcnews.com/politics/congress/sen-bob-menendez-wife-seek-separate-trials-bribery-case-rcna134059"
  },
  {
    "text": "The Baltimore Sun purchased by Sinclair's David D. Smith  —  The Baltimore Sun, the largest newspaper in Maryland, has been acquired in a private deal by David D. Smith, executive chairman of Hunt Valley-based television station owner Sinclair Inc.  —  Smith said Monday that he acquired Baltimore Sun Media … ",
    "url": "https://www.baltimoresun.com/2024/01/15/baltimore-sun-media-sold-david-d-smith/"
  },
  {
    "text": "‘Scared to Death’: Local election officials on edge ahead of 2024 vote  —  America's frontline election workers are bracing for another torrent of conspiracy theories and attacks from election deniers.  —  Election officials across the U.S. are confident they can overcome foreign … ",
    "url": "https://www.politico.com/news/2024/01/16/election-officials-fears-2024-00135378"
  },
  {
    "text": "Wyden, Smith Announce Agreement on Tax Framework to Help Families and Main Street Businesses  —  Three-Year Proposal Would Help Families, Spur Innovation, Improve Economic Competitiveness, Boost Affordable Housing  —  Washington, D.C. - Senate Finance Committee Chairman Ron Wyden (D-Ore.) … ",
    "url": "https://www.finance.senate.gov/chairmans-news/wyden-smith-announce-agreement-on-tax-framework-to-help-families-and-main-street-businesses"
  },
  {
    "text": "Explosions reported near US Consulate in Iraq; Iran claims responsibility  —  Iran's Revolutionary Guard claimed it was targeting “the headquarters of spies.”  —  This is a breaking news story please check back for updates.  —  Several explosions were reported near the U.S. Consulate in Erbil … ",
    "url": "https://abcnews.go.com/International/explosions-reported-us-consulate-iraq-iran-claims-responsibility/story?id=106390671"
  }
]