[
  {
    "text": "Robinson rejected offers of tech help to investigate posts on porn site, sources say  —  Lt. Gov. Mark Robinson's alleged rejection of the offers sowed doubt among some staff members, people familiar with the matter tell WRAL.  His response in the wake of the report likely played a role … ",
    "url": "https://www.wral.com/story/robinson-rejected-offers-of-tech-help-to-investigate-posts-on-porn-site-sources-say/21638904/"
  },
  {
    "text": "GOP retreats from North Carolina after Mark Robinson allegations … - “We don't comment on internal strategy or investment decisions, but we can confirm what's public — our current media buy in North Carolina expires tomorrow, and no further placements have been made,” … ",
    "url": "https://www.axios.com/2024/09/23/north-carolina-mark-robinson-democrats-republicans"
  },
  {
    "text": "Oops!  Mark Robinson Decries ‘Lies’ About Porn Site Posts, Then Says They ‘Possibly Happened’  —  The North Carolina GOP gubernatorial nominee has lost staff and ad spending after a bombshell CNN report tied him to lewd and racist comments online.  —  LOADING",
    "url": "https://www.huffpost.com/entry/mark-robinson-porn-site-lies-possibly-happened_n_66f1c18ce4b03a18c4a2641d"
  },
  {
    "text": "Trump Shows Signs of Strength in Sun Belt Battlegrounds, Polls Find  —  New polls from The New York Times and Siena College showed Donald J. Trump ahead in Arizona and leading in tight races in Georgia and North Carolina.  —  Voters across the Sun Belt say that Donald J. Trump improved … ",
    "url": "https://www.nytimes.com/2024/09/23/us/politics/times-siena-polls-arizona-georgia-north-carolina.html?unlocked_article_code=1.M04.Hgpg.xK18tSe_NRsR&smid=url-share"
  },
  {
    "text": "These companies are bankrolling a multi-million dollar effort to elect Mark Robinson governor of North Carolina  —  Even before securing the Republican nomination for Governor of North Carolina in March, Mark Robinson had a long and well-documented record of promoting conspiracy theories … ",
    "url": "https://popular.info/p/these-companies-are-bankrolling-a"
  },
  {
    "text": "Newly unearthed data shows closer links to Robinson and porn, dating sites  —  Trump, who endorsed Robinson, has publicly remained silent about the embattled lieutenant governor.  —  Top Republican leaders in North Carolina have called on Mark Robinson to provide proof that he wasn't behind salacious posts … ",
    "url": "https://www.politico.com/news/2024/09/23/mark-robinson-porn-sites-00180545"
  },
  {
    "text": "State Sen. Mike McDonnell deflates GOP hopes for Nebraska winner-take-all in 2024  —  State Sen. Mike McDonnell announces leaving the Democratic Party after he was censured by the state and Douglas County Democrats.  LINCOLN — The Republican push to change how Nebraska awards … ",
    "url": "https://nebraskaexaminer.com/2024/09/23/state-sen-mike-mcdonnell-deflates-gop-hopes-for-nebraska-winner-take-all-in-2024/"
  },
  {
    "text": "X will let people you've blocked see your posts … X will now make your posts visible to users you've blocked.  In a reply on Monday, X owner Elon Musk said the “block function will block that account from engaging with, but not block seeing, public post.”",
    "url": "https://www.theverge.com/2024/9/23/24252438/x-blocked-users-view-public-posts"
  },
  {
    "text": "Kamala Harris has largest post-debate lead yet over Donald Trump in new Wisconsin Watch poll  —  Vice President Kamala Harris has grown her lead over former President Donald Trump in Wisconsin following their Sept. 10 debate, according to a new Wisconsin Watch poll conducted by The MassINC Polling Group and released on Monday.",
    "url": "https://wisconsinwatch.org/2024/09/harris-trump-wisconsin-watch-poll-voters-election-president/"
  },
  {
    "text": "FBI Releases 2023 Crime in the Nation Statistics  —  The FBI released detailed data on over 14 million criminal offenses for 2023 reported to the Uniform Crime Reporting (UCR) Program by participating law enforcement agencies.  More than 16,000 state, county, city, university and college … ",
    "url": "https://www.fbi.gov/news/press-releases/fbi-releases-2023-crime-in-the-nation-statistics"
  },
  {
    "text": "Man suspected of assassination attempt against Trump left a letter detailing his plans, prosecutors say  —  The man who authorities say sat with a rifle in the trees where Donald Trump was golfing earlier this month in West Palm Beach, Florida, previously wrote a letter stating … ",
    "url": "https://www.cnn.com/2024/09/23/politics/ryan-wesley-routh-trump-assassination-attempt-letter"
  },
  {
    "text": "The ‘policy’ mirage that undergirds Donald Trump's support  —  The former president and his supporters insist he wins a race centered on policy.  It's not because of Trump's detailed policy platform.  —  One of the central characteristics of the 2024 presidential election is its steadiness.",
    "url": "https://www.washingtonpost.com/politics/2024/09/23/policy-mirage-that-undergirds-donald-trumps-support/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3MDY0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4NDQ2Mzk5LCJpYXQiOjE3MjcwNjQwMDAsImp0aSI6ImYxMWY1NWNhLTc0YWMtNDMyOC05ZWRkLTEzYzJhNTk1YzM4MSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzIzL3BvbGljeS1taXJhZ2UtdGhhdC11bmRlcmdpcmRzLWRvbmFsZC10cnVtcHMtc3VwcG9ydC8ifQ.yv3HcKEdyJu8jUhCOYO9Rxfvn8LDcZO53iAQI8Mw9y0&itid=gfta"
  },
  {
    "text": "J.D. Vance Caught Lying About Egg Prices in Painfully Bad Video  —  J.D. Vance attempted to point out high prices in a recent campaign stunt at a grocery store, only to be caught with egg on his face.  —  On Saturday, the Trump War Room account on X posted a video of Vance visiting a grocery story … ",
    "url": "https://newrepublic.com/post/186233/jd-vance-caught-lying-egg-prices-video"
  },
  {
    "text": "Attorney General Bonta Sues ExxonMobil for Deceiving the Public on Recyclability of Plastic Products  — Attorney General Bonta Sues ExxonMobil for Deceiving the Pub...  Contact: (916) 210-6000, agpressoffice@doj.ca.gov  —  The first-of-its-kind lawsuit seeks to hold … ",
    "url": "https://oag.ca.gov/news/press-releases/attorney-general-bonta-sues-exxonmobil-deceiving-public-recyclability-plastic"
  },
  {
    "text": "Melania Trump was paid for a rare appearance at a political event.  It's not clear who cut the unusual six-figure check  —  Melania Trump has barely been seen on the campaign trail this year.  One of the few times she has appeared at a political event, she's received a six-figure paycheck … ",
    "url": "https://www.cnn.com/2024/09/23/politics/melania-trump-speaking-engagements"
  },
  {
    "text": "She was accused of murder after losing her pregnancy.  SC woman now tells her story  —  Orangeburg, South Carolina , KFF Health News  —  Amari Marsh had just finished her junior year at South Carolina State University in May 2023 when she received a text message from a law enforcement officer.",
    "url": "https://www.cnn.com/2024/09/23/health/south-carolina-abortion-kff-health-news-partner/"
  },
  {
    "text": "Resurfaced video shows Kamala Harris protesting against deporting migrants with disgraced celebrity  —  Vice President Kamala Harris in now promising to secure the border, but when she was a senator of California, she was a staunch opponent of deporting illegal immigrants.",
    "url": "https://www.dailymail.co.uk/news/article-13881751/kamala-harris-deportation-jussie-smollett.html"
  },
  {
    "text": "Jill Stein paid $100,000 to a Republican consulting firm led by a suspected January 6 rioter  —  The Green Party leader has hired a GOP consulting firm and worked with Trump-affiliated lawyers  —  Allies of former President Donald Trump and others affiliated with the GOP are supporting … ",
    "url": "https://www.salon.com/2024/09/23/jill-stein-paid-100000-to-a-consulting-firm-led-by-a-suspected-january-6-rioter/"
  },
  {
    "text": "Texas jury clears ‘Trump Train’ for surrounding 2020 Biden-Harris bus  —  Those onboard the bus had alleged they were ‘terrorised’ for over 90 minutes and calling 911 also did not yield any help  —  A federal jury in Texas on Monday cleared a group of Donald Trump's supporters and found … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/23/texas-court-clears-trump-train"
  },
  {
    "text": "Zelensky: Trump doesn't know how to end war and Vance is too radical  —  The president of Ukraine criticises the Republican nominees as he visits the US to share his plan for victory over Russia  —  Donald Trump doesn't know how to stop the war in Ukraine, despite claiming he could end … ",
    "url": "https://www.telegraph.co.uk/us/politics/2024/09/23/zelensky-trump-doesnt-know-how-to-end-war-and-vance-radical/"
  },
  {
    "text": "Trump Media plummets 10% as post-lockup selloff picks up steam … Shares of Trump Media sank Monday to their lowest price since 2021, days after majority owner Donald Trump and other company insiders got the green light to start selling their stakes in the Truth Social operator.",
    "url": "https://www.cnbc.com/2024/09/23/djt-trump-media-stock-drop-lockup.html"
  },
  {
    "text": "Harris to skip, Trump to attend annual Al Smith dinner  —  Vice President Harris will not attend the annual Al Smith dinner in New York next month, while former President Trump said on Monday that he will be there.  —  The New York Catholic Charities fundraiser, which is scheduled for Oct. 17 … ",
    "url": "https://thehill.com/homenews/campaign/4894697-harris-trump-al-smith-dinner/"
  },
  {
    "text": "New COVID subvariant XEC poses potential threat heading into winter  — XEC, which was first detected in Germany, is gaining traction in Western Europe  — There are estimates that XEC makes up 13% of coronavirus samples in Germany and 7% in Britain.  Will America be next?",
    "url": "https://www.latimes.com/california/story/2024-09-23/new-covid-subvariant-xec-a-potential-threat-for-winter-as-doctors-urge-vaccinations"
  },
  {
    "text": "MAGA Sheriff's Post About Harris Yard Signs Gets Department Booted From Election Duties  —  BLEW IT  —  Bruce Zuchowski, a Trump-supporting Republican, likened migrants to “human locusts” and called the vice president a “Flip-Flopping, Laughing Hyena.”  —  The sheriff's department in Portage County … ",
    "url": "https://www.thedailybeast.com/maga-sheriffs-post-about-kamala-harris-yard-signs-gets-department-booted-from-election-duties"
  }
]