[
  {
    "text": "Trump Administration Live Updates: Judge Plans to Press White House Over Deportation Flights  —  Where Things Stand  — Deportation flights: A federal judge is set to press Trump administration lawyers at a 5 p.m. hearing about whether the White House had violated a court order in deporting migrants with little to no due process.",
    "url": "https://www.nytimes.com/live/2025/03/17/us/trump-news?unlocked_article_code=1.4k4.lzKK.8mLbMK-3nPeL&smid=url-share"
  },
  {
    "text": "Judge in Alien Enemies Act case chides DOJ lawyer over refusal to answer key questions about deportations  —  The court fight focuses on the Trump administration's use of a 1798 law to deport people it claims are part of the Venezuelan gang Tren de Aragua.  —  WASHINGTON — A federal judge pressed … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/judge-alien-enemies-act-case-chides-doj-lawyer-refusal-answer-key-ques-rcna196754"
  },
  {
    "text": "The evil at your door  —  Individuals associated with the federal government have, in defiance of a court order and without a trial or any form of due process, deported hundreds of people from the territory of the United States to El Salvador, where they will be held indefinitely in a concentration camp.",
    "url": "https://snyder.substack.com/p/the-evil-at-your-door"
  },
  {
    "text": "EXCLUSIVE: Memo details Trump plan to sabotage the Social Security Administration  —  An internal Social Security Administration (SSA) memo, sent on March 13 and obtained by Popular Information, details proposed changes to the claims process that would debilitate the agency … ",
    "url": "https://popular.info/p/exclusive-memo-details-trump-plan"
  },
  {
    "text": "Leaked memo: DOGE plots to cut Social Security phone support  —  An internal memo from the Social Security Administration proposes changes to its phone service that could derail the benefits application process for many Americans.  —  Why it matters: The Trump administration has repeatedly … ",
    "url": "https://www.axios.com/2025/03/17/social-security-trump-doge"
  },
  {
    "text": "US Institute of Peace says DOGE has broken into its building  —  Employees of Elon Musk's Department of Government Efficiency have entered the U.S. Institute of Peace despite protests from the nonprofit that it is not part of the executive branch and is instead an independent agency.",
    "url": "https://apnews.com/article/doge-trump-us-institute-of-peace-03362c3440884c6b29e28ad0d88f5014"
  },
  {
    "text": "US Institute of Peace says DOGE has broken into its building  —  President Trump targeted the organization and a few others in a Feb. 19 executive order aiming to shrink the federal government  —  Employees of Elon Musk's Department of Government Efficiency entered the U.S. Institute … ",
    "url": "https://www.nbcwashington.com/news/president-trump-politics/us-institute-of-peace-doge-trump-administration/3869923/"
  },
  {
    "text": "Trump has a plan to remake the economy.  But he's not explaining it very well.  —  President Donald Trump's economic plan is causing brief pain while the nation advances to a new “Golden Age.”  But officials have been much less clear about what that destination will look like.",
    "url": "https://www.washingtonpost.com/business/2025/03/17/trump-economy-trade/"
  },
  {
    "text": "Exclusive: Navajo Code Talkers disappear from military websites after Trump DEI order  —  Articles about the renowned Native American Code Talkers have disappeared from some military websites, with several broken URLs now labeled “DEI.”  —  Why it matters: From 1942 to 1945 … ",
    "url": "https://www.axios.com/local/salt-lake-city/2025/03/17/navajo-code-talkers-trump-dei-military-websites-wwii"
  },
  {
    "text": "Deported Brown University professor had ‘sympathetic photos’ of Hezbollah leaders on her phone, DOJ says  —  The government's explanation for Rasha Alawieh's deportation came before a judge postponed a hearing on whether it defied a judge's order that she not be deported without advance notice to the court.",
    "url": "https://www.politico.com/news/2025/03/17/rasha-alawieh-deportation-026038"
  },
  {
    "text": "At Kennedy Center, Trump envisions remaking Honors, suggests he could host  —  Trump and his board suggested several artists for the awards, including Sylvester Stallone, Andrea Bocelli, Elvis Presley and Babe Ruth.  —  President Donald Trump visited the Kennedy Center on Monday … ",
    "url": "https://www.washingtonpost.com/entertainment/theater/2025/03/17/trump-kennedy-center-honors-board-meeting/"
  },
  {
    "text": "Give back the Statue of Liberty, French MEP tells US  —  French Socialist MEP says Washington's embrace of dictators negates the values that led France to bestow the iconic statue some 140 years ago.  —  She's been covered by a glacier, smashed up by various giant monsters … ",
    "url": "https://www.politico.eu/article/statue-of-liberty-france-nyc-mep-socialists-democrats-group/"
  },
  {
    "text": "Trump Lays Groundwork for Investigating People Pardoned by Biden  —  President asserts in social-media post that Biden's pardons were ‘void, vacant, and of no further force of effect’  —  President Trump questioned the validity of pardons granted by President Joe Biden before he left office … ",
    "url": "https://www.wsj.com/politics/policy/trump-lays-groundwork-for-investigating-people-pardoned-by-biden-73ee33ad"
  },
  {
    "text": "Trump Insists He Was Being “Sarcastic” About Major Campaign Promise  —  One month before the election, 70 percent of Americans felt that foreign affairs comprised either a “very important” or “extremely important” component of their vote.  But as it turns out, Donald Trump's repeat campaign promises … ",
    "url": "https://newrepublic.com/post/192824/donald-trump-ukraine-war-campaign-promise"
  },
  {
    "text": "Texas Arrests Midwife and Associate on Charges of Providing Abortions  —  The two arrests in greater Houston appear to be the first time abortion providers have been charged with violating abortion bans in their state since Roe v. Wade was overturned in 2022.",
    "url": "https://www.nytimes.com/2025/03/17/us/politics/abortion-arrest.html"
  },
  {
    "text": "'Don't Tell Melania': Trump Once Offered Rising MAGA Star His Bed  —  The alleged comments cast new light on the president's eyebrow-raising marriage to Melania Trump.",
    "url": "https://www.thedailybeast.com/dont-tell-melania-trump-once-offered-rising-maga-star-his-bed/"
  },
  {
    "text": "GUEST POST: We Are Professors at Columbia.  Here is How We Would Respond.  —  Five Columbia University political scientists offer their unofficial response to the Trump administration's demands on their university.  —  Everything that has been posted on Drezner's World over the past … ",
    "url": "https://danieldrezner.substack.com/p/guest-post-we-are-professors-at-columbia"
  },
  {
    "text": "EEOC Acting Chair Andrea Lucas Sends Letters to 20 Law Firms Requesting Information About DEI-Related Employment Practices  —  WASHINGTON - Today, U.S. Equal Employment Opportunity Commission (EEOC) Acting Chair Andrea Lucas sent letters to 20 law firms requesting information about their diversity … ",
    "url": "https://www.eeoc.gov/newsroom/eeoc-acting-chair-andrea-lucas-sends-letters-20-law-firms-requesting-information-about-dei"
  },
  {
    "text": "Destroying America's Brand  —  Last week Mark Carney, having won the Liberal Party's leadership election, became Canada's Prime Minister.  And it looks possible that he may hold that position for a while.  Not long ago the Liberals seemed headed for an electoral wipeout, but they've seen an amazing surge in the polls:",
    "url": "https://paulkrugman.substack.com/p/teslafying-us-exports"
  },
  {
    "text": "Trump appoints Charlie Kirk, Walt Nauta, Michael Flynn to military boards  —  President Trump on Monday announced a slew of allies would be appointed to the Board of Visitors at the nation's military academies, including lawmakers and conservative media personalities.",
    "url": "https://thehill.com/policy/defense/5199551-trump-appoints-charlie-kirk-walt-nauta-michael-flynn-to-military-boards/"
  },
  {
    "text": "DOGE Cuts Reach Key Nuclear Scientists, Bomb Engineers and Safety Experts … Los Alamos National Laboratory in New Mexico.  The National Nuclear Safety Administration field office that oversees the lab lost nine staff members, according to documents reviewed by The New York Times.The Albuquerque Journal, via Associated Press",
    "url": "https://www.nytimes.com/2025/03/17/us/politics/federal-job-cuts-nuclear-bomb-engineers-scientists.html?unlocked_article_code=1.4k4.uE6b._YafB7bQ-dvX&smid=url-share"
  },
  {
    "text": "Commerce Department Director Leaves Job With a Scathing Musk Warning  —  A top director at the Commerce Department in charge of expanding internet access to rural areas claimed in a scathing email to colleagues that rural broadband funding may soon be funneled to Elon Musk's Starlink, despite its comparatively lower quality service.",
    "url": "https://www.thedailybeast.com/commerce-department-director-leaves-job-with-a-scathing-warning-about-elon-musk/"
  },
  {
    "text": "Anti-Abortion Lawyer Pushed Out of F.D.A. After Republican Senator's Pressure Campaign  —  Hilary Perkins, a career lawyer and a conservative, was targeted by Senator Josh Hawley of Missouri for defending the Biden administration's position on the abortion pill.",
    "url": "https://www.nytimes.com/2025/03/17/us/politics/lawyer-fda-abortion-josh-hawley.html"
  }
]