[
  {
    "text": "Judge blocks Trump administration's mass firings of federal workers  —  A federal judge ruled that the terminations at several agencies, including the Department of Defense, were likely illegal.  —  SAN FRANCISCO — A federal judge on Thursday ordered the Office of Personnel Management … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/02/27/judge-probationary-federal-employee-firings-lawsuit/"
  },
  {
    "text": "Trump fires hundreds working on weather forecasts, satellite data and radar systems  —  The terminations come days before a potential severe weather outbreak in the southeastern U.S. — and just months ahead of the next Atlantic hurricane season.  —  just now",
    "url": "https://www.washingtonpost.com/climate-environment/2025/02/27/noaa-nws-mass-firings-trump-administration/"
  },
  {
    "text": "How Elon Musk Executed His Takeover of the Federal Bureaucracy  —  The operation was driven with a frenetic focus by the billionaire, who channeled his resentment of regulatory oversight into a drastic overhaul of government agencies.  —  On the last Friday of September 2023 … ",
    "url": "https://www.nytimes.com/2025/02/28/us/politics/musk-federal-bureaucracy-takeover.html?unlocked_article_code=1.0U4.7b0-.RIySfDb8XxjY&smid=url-share"
  },
  {
    "text": "Inside DOGE's Clash With the Federal Workforce  —  With a surprise incursion in the first minutes of the Trump presidency, Elon Musk's programmers seized control of a key personnel agency; ‘rogue bureaucrats’ fight back  —  WASHINGTON, D.C.-At 12:01 p.m. on Jan. 20, as Donald Trump … ",
    "url": "https://www.wsj.com/politics/policy/inside-doge-elon-musk-government-employees-b87fc17a?st=76SP5J&reflink=article_copyURL_share"
  },
  {
    "text": "Elon Musk's Takeover Is Being Aided by a Trumpworld Power Couple  —  Stephen and Katie Miller—he's “the prime minister,” sources say; she's DOGE's comms guru—liaise between the White House and Elon Musk, and are centrally involved as he tears the government apart.",
    "url": "https://www.wired.com/story/katie-stephen-miller-elon-musk-takeover/"
  },
  {
    "text": "BREAKING: SEC halts fraud prosecution of Chinese national who sent Trump millions  —  In December, Popular Information reported that Chinese crypto entrepreneur Justin Sun purchased $30 million in crypto tokens from World Liberty Financial (WLF), a new venture backed by President Donald Trump and his family.",
    "url": "https://popular.info/p/breaking-sec-halts-fraud-prosecution"
  },
  {
    "text": "A crypto mogul who invested millions into Trump coins is getting a reprieve on civil fraud charges  —  A version of this story appeared in CNN Business' Nightcap newsletter.  To get it in your inbox, sign up for free here.  —  New York CNN  —  A businessman who pumped $75 million … ",
    "url": "https://www.cnn.com/2025/02/28/business/crypto-mogul-trump-coins-civil-fraud-charges"
  },
  {
    "text": "NOAA fires about 800 employees, with more possible Friday  —  The Trump administration has its government-shrinking sights set on the National Oceanic and Atmospheric Administration, where around 800 employees have been tapped for termination, according to two sources close to the agency.",
    "url": "https://www.cnn.com/2025/02/27/politics/noaa-federal-workers-firings/"
  },
  {
    "text": "FBI investigating Trump EPA claims of fraud in $20B Biden grant fund  —  While career prosecutors in two U.S. attorney offices and a U.S. judge balked at a court-ordered freeze, Citibank has locked down billions without explanation.  —  Just now  —  FBI agents this week questioned … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/02/27/trump-fbi-epa-grant-investigation/"
  },
  {
    "text": "U.S. Terminates Funding for Polio, H.I.V., Malaria and Nutrition Programs Around the World  —  Here are some of the 5,800 contracts the Trump administration formally canceled this week in a wave of terse emails.  —  Starting Wednesday afternoon, a wave of emails went out from the State Department … ",
    "url": "https://www.nytimes.com/2025/02/27/health/usaid-contract-terminations.html?unlocked_article_code=1.0E4.MuCt.9hGUQZ9l81ZH&smid=url-share"
  },
  {
    "text": "Republicans consider major budget change to obscure deficit impact of extending Trump's tax cuts  —  GOP leaders argue that extending Trump's expiring 2017 tax cuts shouldn't be treated as costing any money.  Democrats compare the tactic to nuking the 60-vote filibuster rule.",
    "url": "https://www.nbcnews.com/politics/congress/republicans-budget-change-deficit-impact-trump-tax-cuts-rcna194015"
  },
  {
    "text": "Trump's Assault on Social Security  —  Social Security is our biggest and most successful safety net program.  The annual $1.6 trillion in benefits constitutes 21% of federal spending and 40% of older adults' income.  It lifts more people out of poverty than any other government program.",
    "url": "https://donmoynihan.substack.com/p/trump-is-trying-to-kill-social-security"
  },
  {
    "text": "Young Republicans Group Invites Accused Sex Trafficker Brothers to Speak: ‘As Free Speech Absolutists...’  —  The Tampa Bay Young Republicans tweeted an invitation to Andrew Tate and his brother Tristan to come speak to their group, drawing swift criticism for the outreach to the men currently facing charges … ",
    "url": "https://www.mediaite.com/news/young-republicans-group-invites-tate-brothers-to-speak-to-members-as-free-speech-absolutists/"
  },
  {
    "text": "CDC Statement on Measles Outbreak  —  RELEASE  —  CDC Media Relations  —  (404) 639-3286  —  media@cdc.gov  —  CDC continues to be in close communication with Texas health authorities about the measles outbreak in West Texas, following the death of a child.  HHS sends its deepest condolences to the family.",
    "url": "https://www.cdc.gov/media/releases/2025/2025-cdc-statement-on-measles-outbreak.html"
  },
  {
    "text": "Behind the scenes, GOP senators challenge legality of Trump's aid cuts  —  Sen. Lindsey Graham, a close Trump ally who lauded the USAID cuts, quietly joined Democrats in expressing alarm.  —  Just now  —  A handful of Republican senators have joined their Democratic colleagues in expressing alarm … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/27/usaid-senators-graham-rubio/"
  },
  {
    "text": "Musk Makes Big Mistake While Trying to Smear CNN Legal Analyst Norm Eisen  —  CARELESS  —  The billionaire DOGE chief found a woman with the same last name as a lawyer he hates.  Cue the conspiracy.",
    "url": "https://www.thedailybeast.com/elon-musk-makes-big-mistake-while-trying-to-smear-cnn-legal-analyst-norm-eisen/"
  },
  {
    "text": "Trump tried to extort Zelenskyy and was impeached - now he may succeed  —  The Ukrainian president is expected at the White House on Friday to sign a multimillion-dollar minerals deal with echoes of a notorious 2019 phone call  —  Alexander Vindman remembers the phone call - and what he did next.",
    "url": "https://www.theguardian.com/us-news/2025/feb/28/trump-zelenskyy-ukraine-impeachment"
  },
  {
    "text": "Here's the real threat to ‘personal liberties and free markets’  —  The rapidly spreading authoritarianism coming from this administration threatens all of our freedoms.  —  Over the last 48 hours, I've been receiving from readers and friends the sort of notes one gets upon losing a loved one … ",
    "url": "https://www.washingtonpost.com/opinions/2025/02/28/free-markets-personal-liberties-trump-threat/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNzE4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMDk3NTk5LCJpYXQiOjE3NDA3MTg4MDAsImp0aSI6IjJmNGI5ZTJiLWU0ZmMtNDBiNi05N2E2LTMwY2M4MWRjNzMwOSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzAyLzI4L2ZyZWUtbWFya2V0cy1wZXJzb25hbC1saWJlcnRpZXMtdHJ1bXAtdGhyZWF0LyJ9.vk_xqU0U-9i92b2c-jWPeCIzm7ILdtT-h37stIcRdv8&itid=gfta"
  },
  {
    "text": "Speaker Mike Johnson Is Living in a D.C. House That Is the Center of a Pastor's Secretive Influence Campaign  —  In 2021, Steve Berger, an evangelical pastor who has attacked the separation of church and state as “a delusional lie” and called multinational institutions “demonic,” set off on an ambitious project.",
    "url": "https://www.propublica.org/article/mike-johnson-evangelical-pastor-steve-berger-roommates"
  },
  {
    "text": "The MAGA War on Speech  —  In 1791, the nation's founders ratified the First Amendment to the Constitution.  It would come to offer protections in the new nation essentially never seen before: the right to ask things of and to criticize the government; to express opinions, popular or not … ",
    "url": "https://www.nytimes.com/2025/02/28/opinion/free-speech-trump-maga.html"
  },
  {
    "text": "Harsh findings on Trump's aid freeze kept secret by USAID watchdog  —  Two reports showing dire impacts on Africa and Gaza have not been released in fear of Trump's wrath, official says  —  The watchdog for the U.S. Agency for International Development has yet to release two critical reports … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/27/usaid-trump-gaza-aid-probe/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNjMyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMDExMTk5LCJpYXQiOjE3NDA2MzI0MDAsImp0aSI6ImRmMjI2NTc4LTVlNjItNDQxOC04Nzk5LTMxMzZkNzNjMWJjYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAyLzI3L3VzYWlkLXRydW1wLWdhemEtYWlkLXByb2JlLyJ9.n47qLmxS0qiHuz-o8Xlw5KVXoIoEJ0AIGF-rq_9hUdA&itid=gfta"
  },
  {
    "text": "Some people online are planning an ‘economic blackout’ Friday.  What does that mean?  —  Shoppers say they're targeting major companies to protest what they describe as corporate corruption.  —  An effort to encourage U.S. consumers to participate in a day of protest by not spending money Friday … ",
    "url": "https://www.nbcnews.com/business/business-news/consumers-plan-economic-blackout-feb-28-rcna193767"
  },
  {
    "text": "Elon Musk Is South African.  It Explains a Lot.  —  Elon Musk is everywhere.  —  He is firing federal employees, gaining access to important government data, popping into the Oval Office, appearing on Fox News alongside President Trump and even attending a White House cabinet meeting.",
    "url": "https://www.nytimes.com/2025/02/28/opinion/elon-musk-south-africa.html"
  },
  {
    "text": "Attorney General Pamela Bondi Releases First Phase of Declassified Epstein Files  —  Today, Attorney General Pamela Bondi, in conjunction with the Federal Bureau of Investigation (FBI), declassified and publicly released files related to convicted sex offender Jeffrey Epstein and his sexual exploitation … ",
    "url": "https://www.justice.gov/opa/pr/attorney-general-pamela-bondi-releases-first-phase-declassified-epstein-files"
  },
  {
    "text": "Former defense chiefs denounce Trump's ‘reckless’ Pentagon firings  —  The five former leaders urged Congress to hold the president accountable for what they called his unjustified removal of the Joint Chiefs chairman and other top military officers.  —  Five former defense secretaries … ",
    "url": "https://www.washingtonpost.com/national-security/2025/02/27/mattis-defense-secretaries-trump-pentagon-firings/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQwNjMyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQyMDExMTk5LCJpYXQiOjE3NDA2MzI0MDAsImp0aSI6ImVhNDNhZDE1LTVjNmMtNGZhZS04ZDY4LWJhNTMxNzM0YmY3MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAyLzI3L21hdHRpcy1kZWZlbnNlLXNlY3JldGFyaWVzLXRydW1wLXBlbnRhZ29uLWZpcmluZ3MvIn0.Y0W1SvJIllke98Rq4gwJAp7E4Bwf9UQBHTJOaPrEVyE&itid=gfta"
  },
  {
    "text": "2/28/25 ☀️ AM:  —  New Democratic ads, plus a big CPC PAC-DCCC fundraiser  —  Dem freshman confronts constituent concerns about DOGE … So it's time to take a spin around Capitol Hill for a Leader Look.  —  This is a particularly advantageous time to pass judgment … ",
    "url": "https://punchbowl.news/archive/22825-am/"
  },
  {
    "text": "Trump to Sign Executive Order Making English Official U.S. Language  —  The U.S. has never had a national language in its nearly 250-year history  —  WASHINGTON—President Trump is planning to sign an executive order that would for the first time make English the official language of the U.S., according to White House officials.",
    "url": "https://www.wsj.com/politics/policy/trump-executive-order-english-official-language-5c0b7665"
  },
  {
    "text": "Pardoned Jan. 6 protester: ‘The DOJ was not weaponized against me’  —  Pam Hemphill, who was charged for her involvement in the Jan. 6, 2021, attack on the Capitol, is pushing back against the notion that the Department of Justice (DOJ) was weaponized against the rioters.",
    "url": "https://thehill.com/homenews/administration/5168696-pardoned-jan-6-rioter-doj-weaponization/"
  },
  {
    "text": "MAGA Loses It as DOGE Staffer Identities Revealed  —  The New York Times identified several dozen employees working for the Department of Government Efficiency, but conservatives were surprisingly unhappy about the transparency.  —  “The so-called New York Times outs 45 people working for DOGE … ",
    "url": "https://newrepublic.com/post/192086/maga-doge-staffers-identities-revealed"
  },
  {
    "text": "Judge orders Trump administration officials to give sworn testimony on DOGE  —  The Justice Department fought the effort to put staffers involved in the controversial cost-slashing effort under oath.  —  A federal judge has ordered Trump administration officials involved in Elon Musk's … ",
    "url": "https://www.politico.com/news/2025/02/27/doge-depositions-union-lawsuits-00206542"
  }
]