[
  {
    "text": "From 9/11 to Benjamin Netanyahu: The world is learning that toxic masculinity can't keep us safe  —  Feminists have long warned about men who hide incompetence with belligerence — Israel proves them right  —  In his Oval Office address following the Oct. 7 attacks, President Joe Biden … ",
    "url": "https://www.salon.com/2023/11/02/from-911-to-benjamin-netanyahu-the-world-is-learning-that-masculinity-cant-keep-us-safe/"
  },
  {
    "text": "U.S. to Press Israel for ‘Pauses’ in War Against Hamas  —  Brief cessations of military operations would allow food, water and other aid to reach Gaza and help with hostage releases, officials say.  —  Secretary of State Antony J. Blinken will urge the Israeli government to agree to a series … ",
    "url": "https://www.nytimes.com/2023/11/02/us/politics/biden-israel-gaza-fighting-pause.html"
  },
  {
    "text": "Biden and Netanyahu Look Headed for a Breakup on Unqualified U.S. Support for the Gaza War  —  The president was right to support Israel after Hamas' attacks on Oct. 7.  But the U.S. must make it clear its priority is a lasting peace, not endless carnage.",
    "url": "https://www.thedailybeast.com/biden-and-netanyahu-look-headed-for-a-breakup-on-us-support-for-gaza-war"
  },
  {
    "text": "Santos vows to remain ‘valuable voice’ in Congress after failed vote to remove him  —  Rep. George Santos (R-N.Y.) on Thursday vowed to be a “valuable voice” in Congress and to continue fighting for his constituents after a vote to expel him failed on the House floor Wednesday evening.",
    "url": "https://thehill.com/homenews/house/4289855-santos-response-failed-expulsion-vote/"
  },
  {
    "text": "F.B.I. Raids Home of Eric Adams's Fund-Raising Chief  —  The raid of the home of Brianna Suggs, a consultant with close ties to the mayor, came as Mr. Adams canceled a series of meetings in Washington, D.C., on Thursday.  —  Agents from the Federal Bureau of Investigation on Thursday searched … ",
    "url": "https://www.nytimes.com/2023/11/02/nyregion/eric-adams-brianna-suggs-fbi-raid.html"
  },
  {
    "text": "Mary Trump says Ivanka Trump will throw her father ‘under the bus’ in fraud trial testimony  —  Mary Trump, the niece of former President Trump, said she thinks Ivanka Trump will throw her father “under the bus” when she testifies in the fraud trial underway in New York.",
    "url": "https://thehill.com/regulation/court-battles/4290490-mary-trump-ivanka-trump-fraud-trial-testimony/"
  },
  {
    "text": "NY Judge Explodes at Trump Lawyer's ‘Misogyny’ After Swipes at Court Clerk  —  Attorney Chris Kise denied he was a misogynist, saying he was “happily married” and had a 17-year-old daughter.  —  Proceedings at Donald Trump's civil fraud trial in New York grew heated on Thursday … ",
    "url": "https://www.thedailybeast.com/new-york-judge-arthur-engoron-explodes-at-trump-lawyers-misogyny-after-he-swipes-at-court-clerk"
  },
  {
    "text": "Minnesota Supreme Court grapples with Trump's eligibility to run in 2024  —  The court heard arguments on a constitutional provision that bars people from holding office if they engaged in insurrection.  —  Minnesota's top judges expressed skepticism on Thursday about the role of state courts … ",
    "url": "https://www.politico.com/news/2023/11/02/trump-ballot-eligibility-minnesota-00125123"
  },
  {
    "text": "‘You just gaslit her’: How Dean Phillips' first town hall went off the rails in N.H.  —  MANCHESTER, N.H. — Rep. Dean Phillips (D-Minn.) says he will host 119 town halls in his long-shot primary challenge against President Biden.  If the reception at his first is any indication of the next potential 118 … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/02/dean-phillips-town-hall-new-hampshire/"
  },
  {
    "text": "Donald Trump Jr. asked courtroom artist to make him ‘look sexy’ like an illustration of Sam Bankman-Fried  — “Make me look sexy,” Donald Trump Jr. told a courtroom illustrator after he finished testifying Thursday.  — The ex-president's son pointed out an image of Sam Bankman-Fried as inspiration.",
    "url": "https://www.businessinsider.com/donald-trump-jr-requests-sexy-courtroom-illustration-2023-11?op=1"
  },
  {
    "text": "I fought to get sober.  Political weaponization of my addiction hurts more than me.  —  My struggles and my mistakes have been fodder for a vile and sustained disinformation campaign against my father, President Joe Biden, and an all-out annihilation of my reputation.",
    "url": "https://www.usatoday.com/story/opinion/voices/2023/11/02/hunter-biden-addiction-substance-abuse-not-political-ploy/71332255007/"
  },
  {
    "text": "How Microsoft is making a mess of the news after replacing staff with AI  —  False claims that President Joe Biden fell asleep during a moment of silence for victims of the Maui wildfire.  A conspiracy theory that the latest surge in Covid-19 cases is being orchestrated by the Democratic Party ahead of the election.",
    "url": "https://www.cnn.com/2023/11/02/tech/microsoft-ai-news/"
  },
  {
    "text": "Students walk out of Hillary Clinton's Columbia class in protest after anti-Israel students exposed by ‘doxxing trucks’  —  Thirty students walked out of Hillary Clinton's class at Columbia University to “shame” the Ivy League school for how they perceive it allowed its students who signed … ",
    "url": "https://nypost.com/2023/11/02/metro/students-walk-out-of-hillary-clintons-columbia-class-in-protest/"
  },
  {
    "text": "Tuberville staffer asks anti-abortion groups to float primaries against Republicans who oppose military holds  —  The GOP senator's communications director said the email to those groups reflected his personal opinion, and was not endorsed by his boss.",
    "url": "https://www.politico.com/live-updates/2023/11/02/congress/tuberville-staffers-anti-abortion-group-ask-00124994"
  },
  {
    "text": "MAGA and Christian nationalism: Bigger threat to America than Hamas could ever be  —  Even Mitch McConnell is trying to push back against Mike Johnson and the MAGA lunatics.  It isn't working  —  The world inches closer to a war that only psychopaths want to see.",
    "url": "https://www.salon.com/2023/11/02/maga-and-christian-nationalism-bigger-to-america-than-hamas-could-ever-be/"
  },
  {
    "text": "Second woman sues Steven Tyler, alleging he sexually assaulted her when she was a teen  —  The woman alleges that Aerosmith frontman Steven Tyler sexually assaulted her twice in one day after they met when she was 17 in 1975.  —  A second woman has come forward with allegations … ",
    "url": "https://www.nbcnews.com/news/second-woman-sues-steven-tyler-alleging-sexually-assaulted-was-teen-rcna123397"
  },
  {
    "text": "Pelsoi launches an all-out attack against No Labels  —  The former House speaker became the most high-profile Democrat to oppose the organization's bid.  —  Speaker Emerita Nancy Pelosi on Thursday became one of the highest-profile elected Democrats to go public with her concerns … ",
    "url": "https://www.politico.com/news/2023/11/02/pelsoi-launches-attack-against-no-labels-00125043"
  },
  {
    "text": "Fetterman introduces resolution that would bar Menendez from classified briefings  —  Fetterman's proposed resolution comes a day after the New Jersey senator attended a classified briefing on Ukraine held by the Senate Foreign Relations Committee.  —  Sen. John Fetterman, D-Pa. … ",
    "url": "https://www.nbcnews.com/politics/congress/fetterman-introduces-resolution-bar-menendez-classified-briefings-comm-rcna123417"
  },
  {
    "text": "It's Time To Unite Behind Donald Trump  —  An open border with terrorists, criminals, and drugs pouring into our country.  A botched withdrawal from Afghanistan that stranded thousands of Americans and our allies behind enemy lines, left billions of dollars' worth of U.S. military equipment … ",
    "url": "https://www.newsweek.com/rick-scott-its-time-unite-behind-donald-trump-opinion-1840060"
  },
  {
    "text": "U.S. Says Russia's Wagner Group Plans to Send Air Defenses to Hezbollah  —  Lebanese militant group could potentially create a second front against Israel, according to American intelligence  —  Wagner Group, the Russian paramilitary organization, plans to provide an air-defense system to Hezbollah … ",
    "url": "https://www.wsj.com/world/russias-wagner-group-may-provide-air-defense-weapon-to-hezbollah-u-s-intel-says-37dc8f45?mod=followamazon"
  },
  {
    "text": "Trump describes imprisoned Jan. 6 rioters as ‘hostages’  —  Former President Trump on Thursday referred to those jailed over their actions during the Jan. 6, 2021, riot at the Capitol as “hostages” during a rally with supporters in Texas.  —  Trump walked on stage at a Houston rally to Lee Greenwood's … ",
    "url": "https://thehill.com/homenews/campaign/4290939-trump-jan-6-capitol-rioters-hostages/"
  },
  {
    "text": "House Passes Aid Bill for Israel but Not for Ukraine  —  The Republican-led House approved a $14.3 billion measure for Israel's war with Hamas, tying the aid to spending cuts.  The Senate does not plan to take it up.  —  A divided House on Thursday passed a Republican-written bill … ",
    "url": "https://www.nytimes.com/2023/11/02/us/politics/house-aid-bill-israel.html"
  },
  {
    "text": "Adam Kinzinger muses: ‘I would love to run against Ted Cruz’  —  The former congressman explains why he's not done with politics just yet.  —  46:24  —  Former Illinois Rep. Adam Kinzinger in the 538 Politics podcast studio.  —  In an interview promoting his new book, “Renegade … ",
    "url": "https://abcnews.go.com/538/adam-kinzinger-muses-love-run-ted-cruz/story?id=104577461"
  },
  {
    "text": "Fetterman makes his move against scandal-plagued Menendez  —  The Pennsylvania progressive is proposing to punish any senator under indictment for certain crimes — like those Menendez is accused of.",
    "url": "https://www.politico.com/live-updates/2023/11/02/congress/fetterman-menendez-senate-expulsion-committees-classified-00125002"
  }
]