[
  {
    "text": "Trump pardons police officers convicted of murder, obstruction in man's death  —  President Donald Trump pardoned two Washington, D.C. police officers convicted in the death of Karon Hylton-Brown, who was riding a moped on a sidewalk without a helmet when he ignored instructions to stop.",
    "url": "https://www.usatoday.com/story/news/politics/2025/01/22/donald-trump-pardon-convicted-police-officers/77889905007/"
  },
  {
    "text": "CNN Plots Major Overhaul as It Enters a New Trump Era  —  Mark Thompson has promised to reinvent CNN since he arrived in 2023.  Now, he is remaking the network's TV lineup and its work force.  —  Give people news when and where they want it.  —  That, says Mark Thompson, CNN's chief executive … ",
    "url": "https://www.nytimes.com/2025/01/23/business/media/cnn-layoffs-mark-thompson.html?unlocked_article_code=1.rU4.Ktql.gY13zafutkB6&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "CNN to lay off hundreds of employees as post-inauguration transformation begins, sources say … Warner Bros. Discovery's CNN plans to lay off hundreds of employees Thursday as it refocuses the business around a global digital audience, according to people familiar with the matter.",
    "url": "https://www.cnbc.com/2025/01/22/cnn-to-lay-off-hundreds-of-employees-post-inauguration.html"
  },
  {
    "text": "Trump's Immigration Plans Are Already Wrecking the Food Industry  —  Fear of increased ICE raids have already negatively affected the nation's agricultural sector, causing alarm that food prices could skyrocket in the near future as a result of Donald Trump's aggressive immigration policies.",
    "url": "https://newrepublic.com/post/190555/donald-trump-immigration-deportations-farm-workers"
  },
  {
    "text": "Immigrants rush to prepare for Trump deportation raids … - Trump's executive orders that began laying the groundwork for his mass deportations reversed several longstanding policies. … - The New Mexico-based immigrant rights advocacy group Somos Un Pueblo Unido said it's launching a … ",
    "url": "https://www.axios.com/2025/01/23/immigrants-scramble-trump-deportation-raids"
  },
  {
    "text": "ICE Watch Programs Can Protect Immigrants in Your Neighborhood — Here's What to Know  —  This op-ed explains how to start an ICE Watch neighborhood program in your community.  —  President Donald Trump's plans to deport vastly more people living in our communities — whose children attend school alongside … ",
    "url": "https://www.teenvogue.com/story/ice-watch-programs-immigrants-how-to-start"
  },
  {
    "text": "Trump hits NIH with ‘devastating’ freezes on meetings, travel, communications, and hiring  —  Researchers facing “a lot uncertainty, fear and panic”  —  Donald Trump's return to the White House is already having a big impact at the $47.4 billion U.S. National Institutes of Health (NIH) … ",
    "url": "https://www.science.org/content/article/trump-hits-nih-devastating-freezes-meetings-travel-communications-and-hiring"
  },
  {
    "text": "Trump threatens to withhold aid for California wildfires in first TV interview since inauguration  —  “I don't think we should give California anything until they let water flow down,” he told Sean Hannity  —  Trump slams Biden over prosecutions, pardons  —  President Donald Trump threatened … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/22/trump-hannity-interview/"
  },
  {
    "text": "Trump undercuts enforcement of the Civil Rights Act of 1964  —  For decades, the political right has purported to broadly support the goals of the civil rights movement of the 1950s and 60s.  In recent years, Republicans sought to pare back perceived excesses benefiting minority groups and women … ",
    "url": "https://popular.info/p/trump-undercuts-enforcement-of-the"
  },
  {
    "text": "President Trump, Crypto Billionaire  —  His new family tokens, which have soared in value, are courting legal and political trouble.  —  Donald Trump doesn't always separate his personal interests from his public obligations, and a howling example is his sudden new status as a crypto billionaire.",
    "url": "https://www.wsj.com/opinion/donald-trump-crypto-token-melania-securities-and-exchange-commission-8cb7abf2?st=HoCrCm&reflink=article_copyURL_share"
  },
  {
    "text": "Trump freed a Jan. 6 defendant charged with assaulting police.  DOJ had him arrested again on a gun charge.  —  The charges against Daniel Ball, unrelated to Jan. 6, had been pending since 2023.  —  A Jan. 6 defendant whose felony assault charges were dismissed a day earlier was arrested Wednesday … ",
    "url": "https://www.politico.com/news/2025/01/22/trump-jan-6-defendant-gun-charge-005863"
  },
  {
    "text": "Justice Department freezes all cases in civil rights division  —  The memo doesn't state how long the freeze will last, but it essentially shuts down the civil rights division for at least the first weeks of the Trump administration.  —  The Justice Department has ordered its civil rights division … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/22/justice-civil-rights-freeze-shutdown/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NTIyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4OTA0Mzk5LCJpYXQiOjE3Mzc1MjIwMDAsImp0aSI6IjYzZDVhMjliLTFiODktNDhkOC1hODFkLWQwNzQyZDg4MTE4OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzIyL2p1c3RpY2UtY2l2aWwtcmlnaHRzLWZyZWV6ZS1zaHV0ZG93bi8ifQ.isWoVdxGAhzYxshHXI9pdB72Xbgq7MGVJsOcVBqTAOA&itid=gfta"
  },
  {
    "text": "Bishop who made plea to Trump says she won't apologize  —  The reverend who called on President Trump to have mercy on transgender children and immigrants during a prayer service for his inauguration said in a new interview she would not apologize for her remarks.",
    "url": "https://thehill.com/homenews/administration/5101739-reverend-refuses-apologize-trump/"
  },
  {
    "text": "CBS 58 weather reporter Sam Kuffel is out after criticizing Elon Musk arm gesture  —  Daniel Bice Mary SpicuzzaMilwaukee Journal Sentinel  —  A Milwaukee TV weather forecaster has been dropped by her station one day after she criticized Elon Musk on social media for his straight-arm gesture that many have likened to a Nazi salute.",
    "url": "https://www.jsonline.com/story/news/politics/2025/01/22/cbs-58s-sam-kuffel-is-out-after-criticizing-elon-musk-arm-gesture/77883983007/"
  },
  {
    "text": "Trump targeted federal workers in his opening act, starting with DEI employees  —  President Donald Trump signed a flurry of executive orders aimed at overhauling the federal workforce, but the details will determine who is affected and how.  —  President Donald Trump targeted federal workers … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/22/federal-workers-trump-remote-work/"
  },
  {
    "text": "Mississippi politician files ‘Contraception Begins at Erection Act’  —  JACKSON, Miss. (WLBT) - A state senator in Mississippi has filed a bill entitled the “Contraception Begins at Erection Act.”  —  As written by Sen. Bradford Blackmon, the bill would make it “unlawful for a person … ",
    "url": "https://www.wlbt.com/2025/01/22/mississippi-politician-files-contraception-begins-erection-act/"
  },
  {
    "text": "Three Disturbing Signs of Fourth Estate Failure  —  Corporate executives behaving obsequiously towards Donald Trump and his lackeys may be disturbing to witness, but it is squarely within their primary charge of increasing shareholder value.  Sucking up to a transactional president who uses power … ",
    "url": "https://washingtonmonthly.com/2025/01/23/three-disturbing-signs-of-fourth-estate-failure/"
  },
  {
    "text": "Trump Gives Gun, Drug Agents Deportation Power  —  The directive is the latest in a flurry of moves the new administration has taken on immigration  —  WASHINGTON—The Trump administration is attempting to amass a larger force of law-enforcement officials to help carry out deportations … ",
    "url": "https://www.wsj.com/politics/policy/trump-gives-gun-drug-agents-deportation-power-a62903b4?st=FPZqCw"
  },
  {
    "text": "Trump's end to “EV mandate” could weaken automakers against China … - Trump's policies, while meant to help the domestic industry, could leave it fighting China globally with one hand behind its back. … - Trump revoked a 2021 executive order from President Biden that aimed to make 50% … ",
    "url": "https://www.axios.com/2025/01/23/trump-ev-mandate-chinese-rivals-cars"
  },
  {
    "text": "GOP leaders mull a big debt-and-funding deal with Democrats  —  The option would include an agreement that ties together government funding, border money, disaster aid and a debt-limit hike.  —  House and Senate GOP leaders are internally debating a possible deal with Democrats … ",
    "url": "https://www.politico.com/news/2025/01/22/gop-debt-funding-deal-democrats-00200101"
  },
  {
    "text": "FTC Chairman Ferguson Announces that DEI is Over at the FTC  —  Today, Federal Trade Commission Chairman Andrew N. Ferguson announced that the agency is delivering on the promise that President Trump made to the American people and issued the following statement:  —  DEI is a scourge on our institutions.",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2025/01/ftc-chairman-ferguson-announces-dei-over-ftc"
  }
]