[
  {
    "text": "The Sound of Fear on Air  —  This morning, I had an unsettling experience.  —  I was invited onto MSNBC's Morning Joe to talk from a studio in Washington, D.C., about an article I'd written on Trump's approach to foreign policy.  Before getting to the article, I was asked about the nomination … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/12/appeasement-new-age-trump/680871/?gift=9uyuYdwstDXmDRiaAfJXJfIYiXaq8Cd9ZNwP23K4jY0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "What's Happening at MSNBC?  —  David Frum just shared a disturbing anecdote from an appearance this morning on MSNBC's Morning Joe.  According to his short article at The Atlantic, he made a flippant reference to reporting that Pentagon nominee Pete Hegseth was known for drinking on the job at Fox News.",
    "url": "https://talkingpointsmemo.com/edblog/whats-happening-at-msnbc"
  },
  {
    "text": "Pete Hegseth's Troubles at Work Raise Questions About Leadership  —  President-elect Donald J. Trump's choice for defense secretary led two nonprofits into debt, and episodes of drinking continued into his days as a Fox News personality.  —  Almost from the moment he first went on air … ",
    "url": "https://www.nytimes.com/2024/12/04/us/politics/pete-hegseth-workplace.html?unlocked_article_code=1.fE4.vShz.x84TMJu-J92k&smid=url-share"
  },
  {
    "text": "Biden White House Is Discussing Preemptive Pardons for Those in Trump's Crosshairs  —  The nomination of Kash Patel, who has vowed to pursue Trump's critics, as FBI director has heightened concerns within the president's inner circle.  —  President Joe Biden's senior aides are conducting … ",
    "url": "https://www.politico.com/news/magazine/2024/12/04/biden-white-house-pardons-00192610"
  },
  {
    "text": "Behind the Curtain: Biden's haunting twin sins … They expected some blowback — not a wicked backlash.  — But even Biden's best friends think it was nuts to pardon Hunter as a solo act on the same evening he left for a long-promised three-day trip to Africa.",
    "url": "https://www.axios.com/2024/12/05/joe-biden-pardon-hunter-biden-presidential-library"
  },
  {
    "text": "Hegseth nomination sinking fast in the Senate  —  Senate Republicans say Pete Hegseth, President-elect Trump's choice to head the Defense Department, faces a very tough path to confirmation in the Senate and his bleak prospects have been communicated directly to the Trump transition team, which is now mulling other options.",
    "url": "https://thehill.com/homenews/senate/5023165-hegseth-nomination-senate/"
  },
  {
    "text": "Hegseth Is Reportedly Vowing to Stop Drinking, Having His Mom Call Senators  —  Trump's pick to take over the Pentagon appears to be struggling to convince Republican senators he's fit for the job … The former Fox News host has been struggling to weather a firestorm of scrutiny stemming … ",
    "url": "https://www.rollingstone.com/politics/politics-news/pete-hegseth-vowing-stop-drinking-mom-call-senators-1235192656/"
  },
  {
    "text": "Jeffries stays out of the way as Dems mutiny against senior panel leaders  —  Democrats are increasingly anxious about the incoming Trump administration and are no longer bowing to seniority rules to pick their committee leaders.  —  House Democrats are poised to unseat several senior committee leaders … ",
    "url": "https://www.politico.com/news/2024/12/04/democrats-mutiny-against-leaders-jeffries-00192665"
  },
  {
    "text": "What to know about the fatal shooting of UnitedHealthcare's CEO  —  A manhunt is underway in New York for the suspect who shot the CEO of the country's largest private health insurer Wednesday morning.  —  Police said UnitedHealthcare CEO Brian Thompson was shot and killed outside … ",
    "url": "https://thehill.com/policy/healthcare/5023158-what-to-know-fatal-shooting-unitedhealthcare-ceo/"
  },
  {
    "text": "The Times They Are A-Changin'  —  The old Los Angeles Times building.  (Photo by David McNew/Getty Images)  —  Patrick Soon-Shiong is tightening his grip over the Los Angeles Times.  —  The MAGA-curious owner, who drew controversy when he blocked the newspaper's planned endorsement of Kamala Harris … ",
    "url": "https://www.status.news/p/los-angeles-times-patrick-soon-shiong"
  },
  {
    "text": "Jeff Bezos Says He Is “Proud” of Decision to End Endorsements at Washington Post, “Very Optimistic” About Second Trump Term  —  The Amazon founder said that he is working on a plan to turn around the Post: “We saved the Washington Post once, this will be the second time.”",
    "url": "https://www.hollywoodreporter.com/business/business-news/jeff-bezos-washington-post-amazon-trump-1236077799/"
  },
  {
    "text": "Trump and the GOP will have a historically tiny House majority.  What that means.  —  Republicans actually wound up losing a seat in the 2024 election, potentially imperiling the president-elect's agenda.  —  On Tuesday night came perhaps the final data point proving that Republicans' victory … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/04/trump-gop-house-majority-explained/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzMzMjg4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM0NjcwNzk5LCJpYXQiOjE3MzMyODg0MDAsImp0aSI6Ijk0MzBmMGFmLWYwNzItNGE1Yy1hMmNhLWRlNTA0MzA5OTZiZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEyLzA0L3RydW1wLWdvcC1ob3VzZS1tYWpvcml0eS1leHBsYWluZWQvIn0.Ll5fT_1t3wkalr7ONDyT21Bld7b6OZiZyyBu17jyrbY&itid=gfta"
  },
  {
    "text": "Trump Organization Plans an Ethics Policy Without Banning Foreign Deals  —  The family business of President-elect Donald J. Trump is expected to announce some restrictions on transactions but is not likely to accept as many limitations as it did eight years ago.",
    "url": "https://www.nytimes.com/2024/12/05/us/politics/trump-organization-plans-an-ethics-policy-without-banning-foreign-deals.html"
  },
  {
    "text": "Donald Trump is ready to make Republicans touch the third rail  —  Without a voting public to face again, Trump is gearing up to cut Social Security and Medicare  —  There are a thousand election hot takes and post-mortems floating around these days and I'm sure we'll soon come to some consensus … ",
    "url": "https://www.salon.com/2024/12/04/donald-is-ready-to-make-touch-the-third-rail/"
  },
  {
    "text": "Trump Nominee Pressured IRS To Crush The Humane Society  —  Donald Trump's pick to head the Internal Revenue Service pressed the agency to investigate and consider stripping the country's leading animal welfare group of its tax status after it supported an initiative to protect dogs, according to documents reviewed by The Lever.",
    "url": "https://www.levernews.com/trump-nominee-pressured-irs-to-crush-the-humane-society/"
  },
  {
    "text": "Pam Bondi's Journey From Traditional Republican to Warrior for Trump  —  The president-elect's choice for attorney general is known for her charm and fealty to him.  —  The day before Florida's 2016 presidential primary, the state attorney general, Pam Bondi, surprised her fellow Republicans … ",
    "url": "https://www.nytimes.com/2024/12/05/us/politics/pamela-bondi-attorney-general-trump.html"
  },
  {
    "text": "12/5/24 ☀️ AM: … The meeting is at 3 p.m., after the Senate leaves town for the week.  (The rhythms of Congress are hard.  It takes everyone time to learn.) … Unlike previous spending-reduction initiatives, DOGE has no statutory authority or fast-track floor process … ",
    "url": "https://punchbowl.news/archive/12524-am/"
  },
  {
    "text": "Missouri Voters Enshrined Abortion Rights.  GOP Lawmakers Are Already Working to Roll Them Back.  —  One month after Missouri approved a constitutional amendment guaranteeing the right to abortion, legislators have proposed a flurry of bills to tighten abortion access or raise the bar for future amendments driven by voter initiatives.",
    "url": "https://www.propublica.org/article/missouri-abortion-amendment-republican-bill-proposals"
  },
  {
    "text": "The Great DOGE Reversal  —  The project led by Elon Musk and Vivek Ramaswamy puts citizens back on top.  —  It is easy to mock or minimize DOGE.  Its name, the Department of Government Efficiency, reads like a Muskian stab at humor.  It may be an impossible dream.",
    "url": "https://www.wsj.com/opinion/the-great-doge-reversal-bureaucracy-cut-red-tape-government-spending-9c5f478b?st=UusTnM&reflink=article_copyURL_share"
  },
  {
    "text": "Hegseth Vows to Get Sober if Confirmed  —  The embattled Fox News host-turned-secretary of defense nominee denied ever having a drinking problem.  —  Satanic Temple To Host Public Elementary School Program  —  SEPARATION OF CHURCH AND STATE  —  A parent personally requested they offer … ",
    "url": "https://www.thedailybeast.com/hegseth-vows-to-stop-drinking-alcohol-if-confirmed/"
  },
  {
    "text": "Trump Replaces His White House Counsel Before He Even Started the Job  —  The shake-up is a sign that the new administration may see the same chaos and infighting that so often plagued President-elect Donald J. Trump's first term in office.  —  President-elect Donald J. Trump on Wednesday replaced … ",
    "url": "https://www.nytimes.com/2024/12/04/us/politics/trump-replaces-white-house-counsel.html"
  },
  {
    "text": "Campaign Board Head Hints Eric Adams Could Be Denied Reelection Matching Funds  —  Executive director says Campaign Finance Board members will make “judgment calls” that could take into account a recent federal indictment for allegedly obtaining $10 million illegally in 2021.  —  Support local news today!",
    "url": "https://www.thecity.nyc/2024/12/04/cfb-council-adams-matching-funds/"
  },
  {
    "text": "South Korea just gave Donald Trump a warning — if his opponents are listening  —  Swiftly and decisively rebutting would-be authoritarians works better than hoping it works out for the best.  —  Just before 11 p.m. local time Tuesday, South Korean President Yoon Suk Yeol declared martial law in a televised address to the nation.",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/south-korea-martial-law-president-democracy-trump-rcna182732"
  },
  {
    "text": "Trump energy nominee misinterprets studies to support claims, scientists say  —  Chris Wright cites data to back his claim there is no climate crisis.  Authors of the papers he cites say he is misinterpreting their work.  —  Oil executive Chris Wright, President-elect Donald Trump's pick … ",
    "url": "https://www.washingtonpost.com/business/2024/12/04/trump-energy-climate-nominee-chris-wright/"
  },
  {
    "text": "Trump Taps Fiserv CEO Bisignano for Social Security Chief  — Program faces shortfall and is politically risky to change  — Bisignano is JPMorgan veteran behind major fintech merger  —  President-elect Donald Trump is nominating Frank Bisignano, the chief executive officer of fintech … ",
    "url": "https://www.bloomberg.com/news/articles/2024-12-05/trump-taps-fiserv-s-bisignano-for-social-security-administration"
  },
  {
    "text": "Memphis police use excessive force and discriminate against Black people, Justice Department finds  —  The Memphis Police Department uses excessive force and discriminates against Black people, according to the findings of a U.S. Department of Justice investigation launched after the beating death … ",
    "url": "https://apnews.com/article/tyre-nichols-memphis-police-federal-investigation-beac021fcf8b5fd255ce79520cec86fa"
  },
  {
    "text": "Trump's Project 2025 May Not Be What It Seemed.  It's Worse.  —  On Nov. 19, two weeks after Election Day, Elon Musk demonstrated perhaps the most brutal, if not sadistic, technique for making life in the federal civil service intolerable.  —  A Wall Street Journal headline from Nov. 22 captures … ",
    "url": "https://www.nytimes.com/2024/12/04/opinion/trump-patel-vought-project-2025.html?unlocked_article_code=1.e04.OpCA.DOsQmilnKOBY&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Wired for the GOP  —  This column, by Alexander Burns, the head of news at Politico, is a rich example of the DC logic that only Democrats have agency and it's only to Democrats that standards, norms, rules or whatever else apply.  “Joe Biden's Parting Insult: The president delivered a vote … ",
    "url": "https://talkingpointsmemo.com/edblog/wired-for-the-gop-2"
  }
]