[
  {
    "text": "Judge dismisses some charges against Trump in the Georgia 2020 election interference case  —  The judge overseeing the Georgia 2020 election interference case has dismissed some of the charges against ex-President Donald Trump, but others remain  —  The judge overseeing the Georgia 2020 … ",
    "url": "https://apnews.com/article/georgia-election-interference-2020-trump-46e0b68c25719c404130f7e6eab69dcd"
  },
  {
    "text": "Kemp signs Georgia law reviving prosecutor sanctions panel.  Democrats fear it's aimed at Fani Willis  —  ATLANTA (AP) — Georgia Gov. Brian Kemp signed a law Wednesday that lets a state commission begin operating with powers to discipline and remove prosecutors, potentially disrupting Fulton … ",
    "url": "https://apnews.com/article/georgia-fani-willis-donald-trump-kemp-prosecutors-2cf16b27b33955b6a4355a96a23bde19"
  },
  {
    "text": "Boebert slams Buck's decision as ‘weak sauce,’ says she won't run in special election  —  Rep. Lauren Boebert (R-Colo.) called Rep. Ken Buck's (R-Colo.) decision to resign early “weak sauce” but said she would not be resigning to run in the special election to fill his seat.",
    "url": "https://thehill.com/homenews/campaign/4529046-lauren-boebert-ken-buck-colorado-special-election-reelection/"
  },
  {
    "text": "RFK Jr.'s VP prospect Aaron Rodgers has shared false Sandy Hook conspiracy theories in private conversations  —  Independent presidential candidate Robert F. Kennedy Jr. has confirmed that among his potential vice-presidential prospects is New York Jets quarterback Aaron Rodgers … ",
    "url": "https://www.cnn.com/2024/03/13/politics/aaron-rodgers-sandy-hook-conspiracy-theories/"
  },
  {
    "text": "Elon Musk Keeps Spreading a Very Specific Kind of Racism  —  He is the “patient zero for this sort of stuff right now.”  —  Racist pseudo-science is making a comeback thanks to Elon Musk.  Recently, the tech billionaire has been retweeting prominent race scientist adherents on his platform X … ",
    "url": "https://www.motherjones.com/politics/2024/03/elon-musk-racist-tweets-science-video/"
  },
  {
    "text": "DHS officials' texts show unfiltered reaction to January 6  —  Internal text messages from the Federal Protective Service obtained by CREW give a never before seen look at how senior government law enforcement officials prepared for and responded to the insurrection on January 6th.",
    "url": "https://www.citizensforethics.org/reports-investigations/crew-investigations/dhs-officials-texts-show-unfiltered-reaction-to-january-6/"
  },
  {
    "text": "No Labels Co-Chairman Pat McCrory Quits Group as It Presses Ahead With Presidential Ticket  —  GOP former North Carolina governor departs as centrist group plans to create a candidate selection committee  —  WASHINGTON—Former North Carolina Gov. Pat McCrory, a national co-chairman of No Labels … ",
    "url": "https://www.wsj.com/politics/elections/no-labels-co-chairman-pat-mccrory-quits-group-as-it-presses-ahead-with-presidential-ticket-a10b041f"
  },
  {
    "text": "South Dakota legislator calls for inquiry into Gov. Noem's Texas dental trip and promo video  —  A Democratic legislator on Wednesday called for an inquiry into South Dakota Republican Gov. Kristi Noem's trip to Texas for dental work and a promotional video in which she praises the doctors for giving her … ",
    "url": "https://apnews.com/article/south-dakota-texas-kristi-noem-dental-teeth-775ac3e08a73e232023e38425bc5a075"
  },
  {
    "text": "How immigration is driving U.S. job growth … - “Faster population and labor force growth has meant that employment could grow more quickly than previously believed without adding to inflationary pressures,” economists Wendy Edelberg and Tara Watson write for the Hamilton Project.",
    "url": "https://www.axios.com/2024/03/13/immigration-economy-jobs-growth-good"
  },
  {
    "text": "Tesla paid no federal income taxes while paying executives $2.5 billion over five years  —  Spoiler: The company actually received $1 million in refunds.  —  In case you need another reason to shout “tax the rich” from the rooftops, it's here, and it's going to make you angry.",
    "url": "https://www.engadget.com/tesla-paid-no-federal-income-taxes-while-paying-executives-25-billion-over-five-years-154529907.html"
  },
  {
    "text": "Religious supremacy, not Supremacy Clause, is key to Fifth Circuit contraception ruling  —  Two of Donald Trump's most conservative, religiously motivated judicial appointees have now issued a two-tier attack on the federal government's longstanding policy that clinics receiving Title X funding need … ",
    "url": "https://www.lawdork.com/p/duncan-religious-supremacy-not-supremacy-clause"
  },
  {
    "text": "GOP Senate Candidate Took Bold Stance Against the Sale of Alcohol... In Wisconsin  —  Eric Hovde, who's running for office in a state famous for its booze, bemoaned the commercialization of alcohol in 2017  —  Wisconsin is famous for its booze.  The brands Miller, Schlitz, Pabst … ",
    "url": "https://www.rollingstone.com/politics/politics-news/eric-hovde-alcohol-wisconsin-senate-1234986412/"
  },
  {
    "text": "RNC Shutting Down Community Centers Aimed at Minority Outreach  —  An overhaul of the party's operations continues after Donald Trump's allies take over.  —  The Republican National Committee, days after electing new leadership and overhauling its presidential campaign operation … ",
    "url": "https://www.nytimes.com/2024/03/13/us/politics/republican-community-centers-closed.html"
  },
  {
    "text": "Heat in one Arizona county played a role in 645 deaths last year  —  Maricopa County, which includes Phoenix and many of its suburbs, was hit by a brutal heat wave last sumer.  —  Arizona's largest county shattered its record for heat-related deaths in 2023, a grim reminder of how dangerous … ",
    "url": "https://www.nbcnews.com/science/environment/heat-one-arizona-county-played-role-645-deaths-last-year-rcna143274"
  },
  {
    "text": "Roll Call 86 Roll Call 86, Bill Number: H. R. 7521, 118th Congress, 2nd Session  —  VOTE QUESTION: On Motion to Suspend the Rules and Pass, as Amended, DESCRIPTION: Protecting Americans from Foreign Adversary Controlled Applications Act, VOTE TYPE: 2/3 Yea-And-Nay, STATUS: Passed",
    "url": "https://clerk.house.gov/Votes/202486"
  },
  {
    "text": "Family Dollar and Dollar Tree will close 1,000 stores  —  New York CNN  —  Family Dollar, the struggling discount chain that caters to low-income customers predominantly in cities, said Wednesday it will close nearly 1,000 stores.  —  Years of mismanagement and poor conditions in stores have hurt Family Dollar's brand.",
    "url": "https://www.cnn.com/2024/03/13/investing/family-dollar-dollar-tree-closing-stores/"
  },
  {
    "text": "Could the Senate pass federal bill for shorter workweek?  Here's what to know  —  WASHINGTON − There's a revived effort on Capitol Hill to make a shorter workweek the new norm.  —  Sen. Bernie Sanders, I-Vt., announced Wednesday he will introduce a bill to establish a standard 32-hour workweek … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/13/bernie-sanders-shorter-workweek-senate/72959569007/"
  },
  {
    "text": "DeSantis Accuses Libs of TikTok of Spreading Lies For ‘Clicks’  —  Libs of TikTok claimed Florida provides drivers licenses to undocumented immigrants, despite the state having some of the country's harshest anti-immigrant laws.  —  Florida Gov. Ron DeSantis skewered the right-wing social media account Libs … ",
    "url": "https://www.thedailybeast.com/desantis-accuses-libs-of-tiktok-of-spreading-lies-for-clicks"
  },
  {
    "text": "Kamala Harris to visit an abortion clinic, a first for a president or vice president  —  Harris plans to tour a Planned Parenthood clinic in Minnesota on Thursday.  —  Vice President Kamala Harris plans to tour a Planned Parenthood clinic in Minnesota that provides abortion services Thursday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kamala-harris-will-visit-planned-parenthood-rcna143324"
  },
  {
    "text": "Abortion is a top concern for Trump as he considers his VP pick  —  Former President Donald Trump has been laser-focused on the abortion views of his potential running mates, viewing the issue as a potential vulnerability for Republicans.  —  PALM BEACH, Fla. — Last month at Mar-a-Lago … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/abortion-trump-vp-pick-rcna142264"
  },
  {
    "text": "Republicans' House majority is their smallest in decades, and shrinking  —  Republicans are entering a months-long stretch of legislating with their smallest House majority in decades.  And the margin is about to tighten even more.  —  Jan. 200120032005200720092011201320152017201 9202120230170190230250Number … ",
    "url": "https://www.washingtonpost.com/politics/interactive/2024/house-control-republican-margin/"
  },
  {
    "text": "Speaker Mike Johnson is still dealing with Kevin McCarthy's baggage  —  Johnson is grappling with issues inherited from his predecessor: an unfunded government, a Rules panel stacked with conservatives and an impeachment inquiry that's losing steam.  —  WHITE SULPHUR SPRINGS, West Virginia … ",
    "url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-still-dealing-kevin-mccarthys-baggage-rcna142828"
  },
  {
    "text": "Conservatives are warning about noncitizens voting.  It's a myth with a long history  —  For those looking to raise doubts about American elections, it's becoming clear that a key 2024 voting boogeyman will be immigration.  —  The false notion that undocumented immigrants are affecting federal elections … ",
    "url": "https://npr.org/2024/03/13/1238102501/noncitizen-voting-immigration-conspiracy-theory"
  },
  {
    "text": "Sen. Katie Britt has told her misleading anecdote about sex trafficking multiple times  —  An NBC News analysis shows Britt has brought up the same victim, who was trafficked under the Bush administration, at least five times this year to criticize Biden's border policies.",
    "url": "https://www.nbcnews.com/politics/congress/katie-britt-misleading-sex-trafficking-multiple-times-biden-rcna143257"
  },
  {
    "text": "Chubb CEO defends backing Trump appeal bond in E. Jean Carroll case  — The CEO of the Chubb insurance company defended a subsidiary providing former President Donald Trump with a $91.6 million appeals bond in the case where he was found liable for defaming E. Jean Carroll after she accused him of rape.",
    "url": "https://www.cnbc.com/2024/03/13/chubb-ceo-defends-backing-trump-appeal-bond-in-e-jean-carroll-case.html"
  }
]