[
  {
    "text": "F.B.I. Seizes Eric Adams's Phones as Campaign Investigation Intensifies  —  Days after a raid at Mr. Adams's chief fund-raiser's home, federal agents took the mayor's phones and iPad, two people with knowledge of the matter said.  —  F.B.I. agents seized Mayor Eric Adams's electronic devices early … ",
    "url": "https://www.nytimes.com/2023/11/10/nyregion/adams-fbi-investigation-phones.html"
  },
  {
    "text": "The Key to Mike Johnson's Christian Extremism Hangs Outside His Office  —  The newly elected House Speaker has ties to the far-right New Apostolic Reformation — which is hell-bent on turning America into a religious state  —  THE AMERICAN PUBLIC has had much to learn about Mike Johnson over the past two weeks.",
    "url": "https://www.rollingstone.com/politics/political-commentary/mike-johnson-christian-nationalist-appeal-to-heaven-flag-1234873851/"
  },
  {
    "text": "Why Is Mike Johnson Flying a Christian Nationalist Flag Outside His Office?  —  House Speaker Mike Johnson has three flags hanging outside his office: the American flag, the Louisiana state flag, and a flag representing a movement that wants to turn the United States into a religious Christian nation.",
    "url": "https://newrepublic.com/post/176861/mike-johnson-flying-christian-nationalist-flag-outside-office"
  },
  {
    "text": "Ohio Republicans Say It's Their ‘God Given Right’ to Restrict Abortion Access  —  Republicans in Ohio want to undermine the will of voters who approved a measure enshrining reproductive freedom into the state's constitution  —  Ohio Republicans are claiming a constitutional amendment … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ohio-republicans-stop-issue-1-abortion-rights-1234875333/"
  },
  {
    "text": "Alarmed by Off-Year Losses, Mainstream Republicans Balk at Abortion Curbs  —  Worried about alienating critical blocs of voters, House Republicans from competitive districts are digging in against using spending bills for abortion and contraception restrictions.",
    "url": "https://www.nytimes.com/2023/11/10/us/politics/house-republicans-abortion.html"
  },
  {
    "text": "Statement From Gerald Rosberg, Chair of the Special Committee on Campus Safety  —  Columbia University is suspending Students for Justice in Palestine (SJP) and Jewish Voice for Peace (JVP) as official student groups through the end of the fall term.  This decision was made after the two … ",
    "url": "https://news.columbia.edu/news/statement-gerald-rosberg-chair-special-committee-campus-safety"
  },
  {
    "text": "White House tried, and failed, to persuade Manchin to make another Senate run  —  And now, the question is, will he run against Biden?  —  As Sen. Joe Manchin struggled for several months over the next step he would take politically, President Joe Biden's top advisers privately tried … ",
    "url": "https://www.politico.com/news/2023/11/10/biden-manchin-senate-run-00126683"
  },
  {
    "text": "Joe Manchin hits the road to ‘save the nation’ amid 2024 speculation  —  Fresh off his announcement that he wouldn't seek a third term in his coveted Senate seat next year, Sen. Joe Manchin (D-WV) is taking his show on the road.  —  Manchin, who was widely viewed as the most vulnerable incumbent … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/joe-manchin-post-senate-2024-speculation"
  },
  {
    "text": "Moody's cuts U.S. outlook to negative, citing deficits and political polarization  — Moody's Investors Service lowered its ratings outlook on the United States' government to negative from stable, pointing to rising risks to the nation's fiscal strength.  — The ratings agency has affirmed … ",
    "url": "https://www.cnbc.com/2023/11/10/moodys-cuts-usa-outlook-to-negative-citing-higher-interest-rates-and-deficits.html"
  },
  {
    "text": "Tennessee man admits to conspiring with Jan. 6 defendant to kill FBI agents  —  Austin Carter said that he plotted with Edward Kelley, who is awaiting trial on Jan. 6 charges, to kill as many as 37 people.  Kelley has pleaded not guilty to murder conspiracy charges.",
    "url": "https://www.nbcnews.com/politics/justice-department/tennessee-man-says-conspired-jan-6-defendant-kill-fbi-agents-rcna124683"
  },
  {
    "text": "Inside Mike Johnson's Ties to a Far-Right Movement to Gut the Constitution  —  The new House speaker has longstanding ties to the evangelical inspired Convention of States cause.  —  As the interregnum without a speaker of the House came to an end last month, people from across … ",
    "url": "https://www.politico.com/news/magazine/2023/11/10/mike-johnson-rewrite-constitution-00126157"
  },
  {
    "text": "Trump spreads alleged shirtless photos of fraud trial judge  —  In a now-deleted post on his platform Truth Social, the former president shared a link to an article from The Gateway Pundit  —  Trump zips his lips to camera after leaving New York court during civil fraud trial",
    "url": "https://www.independent.co.uk/news/world/americas/donald-trump-judge-arthur-engoron-photos-b2444784.html"
  },
  {
    "text": "Gaetz renews McCarthy fight with short film documenting his effort to take away the gavel  —  Rep. Matt Gaetz (R-FL) released a 13-minute short film documenting his journey to oust former House Speaker Kevin McCarthy (R-CA) from the chamber's top job.  —  Gaetz led the motion to vacate … ",
    "url": "https://www.washingtonexaminer.com/news/house/gaetz-renews-mccarthy-short-film-documenting-take-away-gavel"
  },
  {
    "text": "Ocasio-Cortez, Greene among lawmakers urging Biden to drop Assange extradition, prosecution  —  A group of lawmakers including Rep. Alexandria Ocasio-Cortez (D-N.Y.) and Rep. Marjorie Taylor Greene (R-Ga.) called on President Biden to drop the extradition and prosecution of WikiLeaks founder Julian Assange.",
    "url": "https://thehill.com/homenews/house/4304418-lawmakers-urge-biden-drop-assange-extradition-prosecution/"
  },
  {
    "text": "The House is most definitely not in order  —  Before Mike Johnson became speaker, the House of Representatives had voted to censure one of its own members only seven times in 100 years.  Since Johnson became speaker, members of the House have tried to censure each other eight times in two weeks.",
    "url": "https://www.washingtonpost.com/opinions/2023/11/10/new-speaker-mike-johnson-censure-resolutions-tlaib-shutdown/"
  },
  {
    "text": "Ramaswamy now selling merch after Haley's ‘scum’ comments  —  GOP presidential hopeful Vivek Ramaswamy has decided to capitalize on former United Nations ambassador Nikki Haley's “scum” comments by selling merchandise on his website.  —  Ramaswamy, 38, called out Haley's daughter during … ",
    "url": "https://thehill.com/homenews/campaign/4305022-ramaswamy-unveils-new-haley-scum-merch/"
  },
  {
    "text": "Judge in classified documents case rejects Trump's request to delay May trial date  —  The federal judge had announced in July that the trial would begin on May 20 in Fort Pierce, Florida.  —  A federal judge on Friday declined former President Donald Trump's request to postpone the May start date … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-classified-documents-case-rejects-trumps-request-delay-may-trial-rcna124614"
  },
  {
    "text": "France's Macron urges Israel to ‘stop this bombing’ in Gaza  —  French President Emanuel Macron strongly rebuked Israel's bombing campaign and ground offensive in Gaza on Friday, saying there is “no justification” for the effort in a BBC interview.  —  Macron said “we do urge them to stop this bombing” … ",
    "url": "https://thehill.com/policy/international/4304882-emanuel-macron-urges-israel-to-stop-bombing-gaza/"
  },
  {
    "text": "Trump Warns He Could ‘Certainly’ Indict Political Opponents if He's Reelected  —  The former president is planning his presidential revenge tour, and his closest allies are floating ghoulish figures as potential hires  —  Donald Trump gave his first interview to Univision on Thursday … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-warns-indict-political-opponents-reelected-1234875220/"
  },
  {
    "text": "‘I Got A Visit’: Dwayne ‘The Rock’ Johnson Says He Was Asked To Run For President  —  The actor, who said in 2017 that he was “seriously considering” a presidential run, claims he was approached by “the parties” last year.  —  LOADING  —  Dwayne “The Rock” Johnson says he was approached not long ago about leading the United States.",
    "url": "https://www.huffpost.com/entry/i-got-a-visit-dwayne-the-rock-johnson-president_n_654e4602e4b0c9f2465fe376"
  },
  {
    "text": "The West Must Defeat Russia  —  Putin hasn't given up his plans.  He thinks Ukraine's allies will lose interest.  —  They planned to take Kyiv in three days, the rest of Ukraine in six weeks.  —  More than 21 months later, Russian forces have withdrawn from half the territory they occupied in February of last year.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/11/us-ukraine-support-putin-defeat/675953/"
  },
  {
    "text": "With Manchin Out, Democrats' Path to Holding the Senate Is Narrow  —  While the party will be on defense in every competitive race, Republicans face some messy primaries and a recent history of nominating extreme candidates who have lost key contests.  —  Senator Joe Manchin III said he decided … ",
    "url": "https://www.nytimes.com/2023/11/10/us/politics/manchin-democrats-senate-map.html"
  },
  {
    "text": "Texas judge rules against GOP lawsuit seeking to toss 2022 election result in Houston area  —  A Texas judge has denied a Republican effort to overturn election results in the nation's third-most populous county, a Democratic stronghold that's been beset by GOP efforts to dictate how ballots are cast.",
    "url": "https://apnews.com/article/election-lawsuit-texas-harris-county-67dc7dc3055c684fed1349060de69d6f"
  }
]