[
  {
    "text": "Hamas announces it has accepted an Egyptian-Qatari cease-fire proposal  —  Israel's army has told Palestinians to temporarily evacuate from parts of Rafah in southern Gaza, signaling that a ground invasion is imminent.  People were told to move to Muwasi, an Israeli-declared humanitarian area near the coast.",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-humanitarian-aid-8659eae6e0a7362504f0aa4aa4be53e0"
  },
  {
    "text": "Hamas Agrees to a Cease-Fire Plan; Israel Says It Doesn't Meet Terms  —  Tsafrir Abayov/Associated Press Tsafrir Abayov/Associated Press … Hamas says it has agreed to a cease-fire proposal.  —  Ismail Haniyeh, the leader of Hamas's political wing, said on Monday that the group had agreed … ",
    "url": "https://www.nytimes.com/live/2024/05/06/world/israel-gaza-war-hamas"
  },
  {
    "text": "Trump interferes with House GOP messaging on Cuellar indictment … - The National Republican Congressional Committee plans to accuse Democrats of a double standard if they stay mum on Cuellar following their pressure on ex-Rep. George Santos (R-N.Y.) to resign, Politico reports.",
    "url": "https://www.axios.com/2024/05/06/trump-house-gop-cuellar-resign"
  },
  {
    "text": "Donald Trump's giant soft spot for indicted Democrats  —  The News  —  In last week's 54-page indictment, federal prosecutors charged Texas Rep. Henry Cuellar with bribery, money laundering, and a conspiracy on behalf a foreign government.  —  Donald Trump had another theory for Cuellar's reckoning: Joe Biden, getting revenge.",
    "url": "https://www.semafor.com/article/05/06/2024/donald-trumps-giant-soft-spot-for-indicted-democrats"
  },
  {
    "text": "Why I'm voting for Biden and other Republicans should, too  —  Donald Trump has disqualified himself through his conduct and his character,  —  It's disappointing to watch an increasing number of Republicans fall in line behind former president Donald Trump.",
    "url": "https://www.ajc.com/opinion/geoff-duncan-why-im-voting-for-biden-and-other-republicans-should-too/LFLE5YWCBBA6VDGJAJKMNPCDKQ/"
  },
  {
    "text": "400 Rich People Pay $40K to Hear Trump Glorify Cop Assailants  —  On Saturday, a bunch of people paid a lot of money — at least $40,0000 apiece, and one or two people took Trump up on an offer to speak if they gave $1 million — to hear Trump glorify cop assailants.",
    "url": "https://www.emptywheel.net/2024/05/06/400-rich-people-pay-40k-to-hear-trump-glorify-cop-assailants/"
  },
  {
    "text": "Hunter Biden's revenge  —  Smear campaigns have consequences.  —  ∙ Paid … Have you noticed that after years of saturation coverage, Fox News hosts have suddenly cooled it on the Hunter Biden stuff?  There's a reason for that.  —  Last week, Fox News pulled the six-part series … ",
    "url": "https://www.publicnotice.co/p/hunter-biden-sues-fox-news-explained"
  },
  {
    "text": "Congressman praises racist heckling.  Will his corporate backers stand by him?  —  On Thursday, Jaylin Smith, a graduate student at the University of Mississippi, participated in a small, non-violent protest calling for a ceasefire in Gaza.  Smith and the other protesters were greeted … ",
    "url": "https://popular.info/p/congressman-praises-racist-heckling"
  },
  {
    "text": "Right-Wing Nonprofit Paid Millions to Companies With Ties to Insiders  —  The Conservative Partnership Institute's three highest-paid contractors had connections to the group's leaders or their relatives, raising concerns about self-dealing.  —  The Conservative Partnership Institute … ",
    "url": "https://www.nytimes.com/2024/05/06/us/politics/trump-conservative-partnership-institute-funds.html"
  },
  {
    "text": "Behind the Curtain: 6% of six states … - Those were the battlegrounds disputed by Donald Trump after the 2020 election. … - A seventh state, North Carolina, is included in some swing-state polls. … Republicans think they're winning.  The swing-state map is a big reason why.",
    "url": "https://www.axios.com/2024/05/06/biden-trump-election-swing-states"
  },
  {
    "text": "Bernie Sanders will run for re-election … - People around Sanders have not given any indication that he is retiring, and say they are approaching 2024 as an election year for the senator.  — There was doubt that Sanders would seek re-election given his age, and he has yet to publicly announce a decision.",
    "url": "https://www.axios.com/2024/05/06/bernie-sanders-re-election-us-senator-vermont"
  },
  {
    "text": "Noem suggests Biden's dog Commander should suffer a similar fate to Cricket, the dog she shot  —  South Dakota Gov. Kristi Noem suggests in her new book that President Joe Biden's dog Commander should suffer a similar fate to the working dog she shot on her farm.",
    "url": "https://www.cnn.com/2024/05/05/politics/kristi-noem-dog-commander-biden/"
  },
  {
    "text": "Noem insists ‘I love dogs’ amid puppy-shooting controversy  —  South Dakota Gov. Kristi Noem (R) stressed her affection for dogs on Monday, as she sought to defend herself against an onslaught of criticism and mockery over the revelation in a new book that many years ago, she shot an ill-behaved 14-month-old puppy.",
    "url": "https://thehill.com/homenews/campaign/4646603-noem-i-love-dogs-puppy-shooting-controversy-cricket/"
  },
  {
    "text": "Kevin Spacey Endorses ‘Loyal Friend’ Robert F. Kennedy Jr.  —  HOUSE OF CARDS  —  The long-shot third party candidate got what is perhaps an unwanted boost from the accused sexual predator.  —  At the start of the same week a damning docuseries about his alleged sexual abuse is set the premiere … ",
    "url": "https://www.thedailybeast.com/kevin-spacey-endorses-loyal-friend-robert-f-kennedy-jr"
  },
  {
    "text": "Congress voted against funding a cure for cancer just to block a win for Biden  —  Some Republicans, refusing to give President Joe Biden a ‘win,’ voted against the renewal of funding for cancer research.  Vote for those who do not politicize Americans' health.  —  I'm afraid I have some bad news.",
    "url": "https://www.usatoday.com/story/opinion/voices/2024/05/05/biden-cancer-moonshot-initiative-congress-funding/73525016007/"
  },
  {
    "text": "Speaker Johnson to discuss issues with Marjorie Taylor Green ahead of her threats to oust him  —  Rep. Greene threatened to trigger her motion to vacate Monday evening  —  House Speaker Mike Johnson is expected to meet privately, one-on-one, with Rep. Marjorie Taylor Greene on Monday … ",
    "url": "https://www.foxnews.com/politics/speaker-johnson-marjorie-taylor-greene-meet-monday-threatst-motion-vacate"
  },
  {
    "text": "Readout of President Joe Biden's Call with Prime Minister Netanyahu of Israel  —  President Biden spoke this morning with Prime Minister Netanyahu.  The President reaffirmed his message on Yom HaShoah, Holocaust Remembrance Day.  The two leaders discussed the shared commitment of Israel … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/05/06/readout-of-president-joe-bidens-call-with-prime-minister-netanyahu-of-israel-5/"
  },
  {
    "text": "Donald Trump Is “A Colossal A**hole,” Jeffrey Katzenberg Says; Hasn't Yet Reached Out To Taylor Swift To Endorse “Decent” Joe Biden  —  Jeffrey Katzenberg is a man known for choosing his words very carefully most of the time, and tonight the WndrCo boss was pretty candid when it came to Donald Trump and Joe Biden.",
    "url": "https://deadline.com/2024/05/donald-trump-jeffrey-katzenberg-interview-joe-biden-talyor-swift-1235905004/"
  },
  {
    "text": "Prosecutors move deeper into Trump's orbit as testimony in hush money trial enters a third week  —  AP is live outside Trump Tower in New York as Donald Trump's hush money trial enters a third week.  —  Photos  —  The judge presiding over Donald Trump's hush money trial fined him $1,000 … ",
    "url": "https://apnews.com/article/trump-trial-hush-money-c41df6a82434247352fe7a110daae981"
  },
  {
    "text": "Trump's lawyers are trying to use his trial to generate conspiracy theories — but it's not working  —  Even the most MAGA-deluded voters struggle to pretend Trump is the victim in the Stormy Daniels plot  —  Donald Trump's lawyers famously spend a lot of their time placating … ",
    "url": "https://www.salon.com/2024/05/06/lawyers-are-trying-to-use-his-trial-to-generate-conspiracy-theories--but-its-not-working/"
  },
  {
    "text": "Money isn't enough to smooth the path for Republican candidates hoping to retake the Senate  —  Frustrated by the seemingly endless cash flowing to Democrats, Republicans aiming to retake the Senate have rallied around candidates with plenty of their own money.",
    "url": "https://apnews.com/article/gop-campaign-rich-candidates-senate-majority-68a8eb884c96ec53f13e1472d225cb21"
  }
]