[
  {
    "text": "Booting Trump off the ballot isn't just legally correct — it's the smart move for the Supreme Court  —  This is one of those rare situations where what's good for the country is also good for the GOP  —  Let's just get this out the way up front: If Donald Trump is removed from enough state ballots … ",
    "url": "https://www.salon.com/2023/12/20/booting-off-the-ballot-isnt-just-legally-correct--its-the-smart-move-for-the/"
  },
  {
    "text": "The Colorado Decision: Heads Trump Wins.  Tails America Loses.  —  1. The Sunshine State  —  I don't have a firm opinion about the Colorado Supreme Court's ruling that Donald Trump cannot appear on the state's presidential ballot.  —  As a matter of law, I can see it both ways.",
    "url": "https://plus.thebulwark.com/p/the-colorado-decision-heads-trump"
  },
  {
    "text": "Trump's GOP presidential rivals join in criticism of Colorado ruling  —  Former president Donald Trump's Republican presidential opponents are joining in his criticism of a Colorado Supreme Court ruling Tuesday that Trump could not appear on the ballot for the state's presidential primary.",
    "url": "https://www.washingtonpost.com/politics/2023/12/20/trump-republican-rivals-colorado-ballot/"
  },
  {
    "text": "4 takeaways from the Colorado Supreme Court's disqualifying Trump  —  Tuesday will go down as a momentous date in American political history, with the Colorado Supreme Court ruling that a former president engaged in insurrection and is therefore disqualified from the presidency.",
    "url": "https://www.washingtonpost.com/politics/2023/12/19/4-takeaways-colorado-supreme-courts-disqualifying-trump/"
  },
  {
    "text": "Disqualifying Trump from the Ballot is a Step Too Far  —  The political case against Colorado's legal ruling  —  Colorado's Supreme Court ruled that Donald Trump can be disqualified from the presidential ballot on the basis of the 14th Amendment to the Constitution, which bars people … ",
    "url": "https://nymag.com/intelligencer/2023/12/colorado-court-trump-disqualified-ballot-insurrection-case-against.html"
  },
  {
    "text": "Lieutenant Governor Eleni Kounalakis Calls for Secretary of State Weber to Explore Legal Options to Remove Former President Donald Trump from California's 2024 Presidential Primary Ballot  —  Contact: Press@ltg.ca.gov, (916) 803-2191  —  SACRAMENTO - Today, Lieutenant Governor Eleni Kounalakis sent … ",
    "url": "https://ltg.ca.gov/2023/12/20/lt-governor-kounalakis-calls-for-secretary-of-state-weber-to-explore-legal-options-to-remove-former-president-donald-trump-from-californias-2024-presidential-primary-ballot/"
  },
  {
    "text": "Texas Lt. Gov. Floats Removing Biden From State Ballot in Response to Colorado Dumping Trump  —  Dan Patrick cited the border when considering the move in response to Trump's current 2024 legal battle  —  Republican Texas Lt. Gov. Dan Patrick floated the idea of booting President Joe Biden … ",
    "url": "https://themessenger.com/politics/texas-dan-patrick-biden-ballot-removal-trump-colorado"
  },
  {
    "text": "Capitol Rioter's High-School Classmate Gives Him Up to Feds  —  REVENGE OF THE NERDS  —  The FBI arrested a Minnesota man for his alleged role in the Jan. 6 riots after one of his high-school classmates told the feds he'd posted a selfie from the U.S. Capitol during the attack … ",
    "url": "https://www.thedailybeast.com/capitol-rioters-high-school-classmate-gives-him-up-to-feds"
  },
  {
    "text": "U.S. to free ally of Venezuela's Maduro in exchange for 36 prisoners -source  —  The government of Venezuelan President Nicolas Maduro plans to release up to 36 people, including up to 12 Americans, in exchange for the U.S. government's release of a Maduro ally, two Venezuelan sources said on Wednesday.",
    "url": "https://www.reuters.com/world/us/us-has-freed-close-ally-venezuela-president-swap-jailed-americans-ap-2023-12-20/"
  },
  {
    "text": "The US has released an ally of Venezuela's president in a swap for jailed Americans, the AP learns  —  The Biden administration has released a close ally of Venezuelan President Nicolás Maduro in a swap for jailed Americans, The Associated Press has learned.",
    "url": "https://apnews.com/article/venezuela-maduro-saab-detained-americans-biden-d7148a34dd009d5bab3d5f50c28ed93e"
  },
  {
    "text": "Haley Ties DeSantis For First Time In GOP Primary, While Trump Still Dominates, With Biggest Lead To Date, Quinnipiac University National Poll Finds; Voter Support For U.S. Military Aid To Israel Dips  —  mail_outline  —  As the 2024 presidential race draws closer to primaries and caucuses getting underway … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3887"
  },
  {
    "text": "Xi warned Biden during summit that Beijing will reunify Taiwan with China  —  The Chinese leader's message in San Francisco got the attention of U.S. officials because it was delivered at a meeting that was intended to reduce tensions.  —  WASHINGTON — Chinese President Xi Jinping bluntly … ",
    "url": "https://www.nbcnews.com/news/china/xi-warned-biden-summit-beijing-will-reunify-taiwan-china-rcna130087"
  },
  {
    "text": "Pilot, photographer killed after Action News' Chopper 6 crashes in wooded area of New Jersey  —  The crew members have a long history with our station and have been working as part of the Action News team for years.  —  By, 6abc Digital Staff, Trish Hartman, Maggie Kent, and Katherine Scott",
    "url": "https://6abc.com/action-news-helicopter-6abc-chopper-6-crash-new-jersey-philadelphia-crew-wpvi-tv/14205051/"
  },
  {
    "text": "House Republicans land last-minute Ohio recruit for key House race  —  House Republicans launched a last-minute scramble to recruit state Rep. Derek Merrin.  —  House Republicans may have found a way to salvage their flailing prospects in a crucial swing seat.",
    "url": "https://www.politico.com/news/2023/12/20/derek-merrin-ohio-00132746"
  },
  {
    "text": "Giuliani's Money Woes Were a Focus of Ukraine Inquiry, Records Reveal  —  F.B.I. agents scrutinizing Rudolph W. Giuliani's efforts to oust the American ambassador to Ukraine thought financial problems might be motivating his actions.  —  Before Rudolph W. Giuliani was ordered to pay $148 million … ",
    "url": "https://www.nytimes.com/2023/12/19/nyregion/giuliani-trump-ukraine-fbi.html"
  },
  {
    "text": "‘Incompetent dumpster fire’: Michigan GOP rocked by financial turmoil and infighting  —  The Mackinac Republican Leadership Conference often lures a who's who of GOP power players to Michigan.  Wealthy donors shake hands with presidential candidates, who give rousing speeches to packed audiences … ",
    "url": "https://www.cnn.com/2023/12/20/politics/michigan-gop-financial-turmoil-infighting-invs/"
  },
  {
    "text": "Judge reverses earlier decision and allows removal of Confederate memorial at Arlington Cemetery  —  The allegations that the removal efforts amounted to grave desecration “were, at best, ill-informed and, at worst, inaccurate,” the judge wrote.  —  ALEXANDRIA, Va. — A federal judge … ",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-reverses-earlier-decision-allows-removal-confederate-memorial-ar-rcna130566"
  }
]