[
  {
    "text": "Trump booed at Libertarian convention  —  Donald Trump was booed repeatedly during an appearance at the Libertarian Party's national convention on Saturday as he asked members for their support.  —  Mr Trump, the presumptive Republican presidential nominee, told the party's delegates to unite with him to beat Democrat Joe Biden.",
    "url": "https://www.bbc.com/news/articles/c722qy5dzlgo"
  },
  {
    "text": "RFK Jr. loses in first round of Libertarian Party's presidential nomination vote.  Trump didn't file paperwork to qualify  —  Independent presidential candidate Robert F. Kennedy Jr. was eliminated from contention for the Libertarian Party's presidential nomination during the party's convention Sunday.",
    "url": "https://www.cnn.com/2024/05/26/politics/rfk-jr-nominated-libertarian-party/"
  },
  {
    "text": "Trump doesn't submit paperwork to be considered by Libertarian Party after soliciting votes  —  On Saturday, Trump asked multiple times for the libertarian audience to nominate him or vote for him.  —  WASHINGTON — Hours after former President Donald Trump asked libertarians … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-doesnt-submit-paperwork-libertarian-party-nomination-soliciting-rcna154132"
  },
  {
    "text": "Trump told donors he will crush pro-Palestinian protests, deport demonstrators  —  Trump has waffled on whether the Israel-Gaza war should end.  But speaking to wealthy donors behind closed doors, he said that he supports Israel's right to continue “its war on terror.”",
    "url": "https://www.washingtonpost.com/politics/2024/05/27/trump-israel-gaza-policy-donors/"
  },
  {
    "text": "Juliet Jeske on Fox News brain  —  “They enjoy sitting in their homes and being angry at the world.”  —  ∙ Paid … Are you terrified of migrants squatting in your home or randomly punching you in the face while you walk down the street?  Maybe you find yourself thinking a lot … ",
    "url": "https://www.publicnotice.co/p/juliet-jeske-decoding-fox-news-interview-2024"
  },
  {
    "text": "Biden Administration Presses Allies Not to Confront Iran on Nuclear Program  —  U.S. is arguing against an effort by Britain and France to censure Iran at the IAEA's member state board  —  BERLIN—The Biden administration is pressing European allies to back off plans to rebuke Iran for advances … ",
    "url": "https://www.wsj.com/world/middle-east/u-s-opposes-european-plan-to-censure-iran-over-nuclear-work-85ad7fc6"
  },
  {
    "text": "Russia is flooding Europe with disinformation.  The U.S. elections are next.  —  With European parliamentary elections coming in June, Moscow has jumped into action.  —  PARIS — In 2022, European monitors who track Russian disinformation spotted an ambitious online influence operation they called Doppelganger.",
    "url": "https://www.washingtonpost.com/opinions/2024/05/27/russia-disinformation-propaganda-eu-elections/"
  },
  {
    "text": "Washington Post sat on Alito upside-down flag interview for years … - “I agreed with Bob Barnes and others that we should not do a single-slice story about the flag, because it seemed like the story was about Martha-Ann Alito and not her husband,” Barr said.  — “In retrospect, I should have pushed harder for that story.”",
    "url": "https://www.axios.com/2024/05/27/samuel-alito-wife-flag-washington-post-interview"
  },
  {
    "text": "Biden's Memorial Day speech honors fallen troops, praises democracy … - Biden was accompanied at the tomb by Vice President Kamala Harris and Defense Secretary Lloyd Austin. … Biden said.  — Each of the veterans, he said, was “bound by a common commitment, not to a place … ",
    "url": "https://www.axios.com/2024/05/27/biden-memorial-day-speech-troops-democracy"
  },
  {
    "text": "If you think Biden has troubles, just look at Trudeau  —  The Canadian prime minister's grim poll numbers stoke speculation about his future.  —  OTTAWA — Justin Trudeau is running out of time.  —  He has trailed in polls by double digits for nearly a year, and the outlook … ",
    "url": "https://www.politico.com/news/2024/05/27/biden-trudeau-election-populism-00158842"
  },
  {
    "text": "Scoop: Bill and Hillary Clinton to headline Virginia fundraiser for Biden … - Scheduled for June 18, it follows the “three president” extravaganza in New York in April and a planned event with Biden, Clinton and former President Obama in mid-June in Los Angeles, hosted by George Clooney.",
    "url": "https://www.axios.com/2024/05/27/bill-hillary-clinton-fundraiser-biden-dc"
  },
  {
    "text": "Access to Food in Gaza is More Dire Than Ever  —  The flow of aid into Gaza has shrunk so much in May that humanitarian officials say their operations are at risk of shutting down, and that the threat of widespread starvation is more acute than ever.  —  Aid trucks entering Gaza fall far short of meeting need",
    "url": "https://www.nytimes.com/interactive/2024/05/27/world/middleeast/gaza-food-aid-crossings.html"
  },
  {
    "text": "How ‘Zionist’ Became a Bad Word in Publishing  —  This month, an account on X with the handle @moyurireads and 360 followers published a link to a color-coded spreadsheet classifying nearly 200 writers according to their views on the “genocide” in Gaza.  Titled “Is Your Fav Author a Zionist? … ",
    "url": "https://www.nytimes.com/2024/05/27/opinion/publishing-literary-antisemitism.html"
  },
  {
    "text": "America Is Getting Ready for Space Warfare  —  Pentagon officials open up about potential threats as China's presence in orbit grows and Russia shows interest in gear that can destroy satellites  —  In space warfare, the U.S. military is seeking the ultimate high ground.",
    "url": "https://www.wsj.com/politics/national-security/space-weapons-us-space-force-russia-china-abf1cc16"
  }
]