[
  {
    "text": "Trump's Case Against Man Deported in “Error” Just Took Another Big Hit  —  As Trump administration officials seek to defend their refusal to return Kilmar Abrego Garcia to the United States after deporting him in “error,” one of the government's chief justifications has been that he was a member of the MS-13 gang.",
    "url": "https://newrepublic.com/article/194010/kilmar-abrego-garcia-case-trump-deported-error-another-hit"
  },
  {
    "text": "Karoline Leavitt Melts Down Over Deported ‘Father of the Year’  —  LEAVITT ALONE  —  Trump's press secretary mocked the Maryland father who the administration mistakenly deported to a Salvadoran mega-prison.  —  White House Press Secretary Karoline Leavitt lashed out at reporters Tuesday … ",
    "url": "https://www.thedailybeast.com/karoline-leavitt-melts-down-over-deported-father-of-the-year/"
  },
  {
    "text": "Trump Admin's New Defense For Accidentally Sending Abrego Garcia To Salvadoran Torture Camp: We Meant To Do That  —  The Trump administration has settled on a terrifying new legal theory: they can declare anyone a “terrorist,” ship them to an offshore torture camp without due process … ",
    "url": "https://www.techdirt.com/2025/04/15/trump-admins-new-defense-for-accidentally-sending-abrego-garcia-to-salvadoran-torture-camp-we-meant-to-do-that/"
  },
  {
    "text": "Exclusive: Top Hegseth adviser Dan Caldwell put on leave in Pentagon leak probe  —  One of U.S. Defense Secretary Pete Hegseth's leading advisers, Dan Caldwell, was escorted from the Pentagon on Tuesday after being identified during an investigation into leaks at the Department of Defense, a U.S. official told Reuters.",
    "url": "https://www.reuters.com/world/us/top-hegseth-advisor-dan-caldwell-put-leave-pentagon-leak-probe-2025-04-15/"
  },
  {
    "text": "IRS to Lose 20% of Workforce to New Trump Resignation Offer  —  About 20,000 IRS workers—roughly one-fifth of the agency—are taking the Trump administration's second deferred resignation offer, according to a person familiar with the matter.  —  That uptake effectively reverses the staff hikes … ",
    "url": "https://news.bloombergtax.com/daily-tax-report/about-20-000-irs-workers-take-second-deferred-resignation-offer"
  },
  {
    "text": "The demands Harvard refused  —  The Trump administration is attempting to gain partial control over one of the nation's top universities. … The Trump administration last night froze $2.2 billion in federal funding for Harvard, punishment after the university said Monday it would not comply with the administration's demands.",
    "url": "https://www.vox.com/the-logoff-newsletter-trump/408890/trump-harvard-university-funding-logoff"
  },
  {
    "text": "Columbia Vows to Reject Any Trump Deal That Erodes Its Independence  —  A message from the university's acting president said that talks with the Trump administration were continuing as the White House is seeking to place the school under judicial oversight.",
    "url": "https://www.nytimes.com/2025/04/15/nyregion/columbia-trump-president-response.html"
  },
  {
    "text": "Pentagon's ‘SWAT team of nerds’ resigns en masse  —  Employees of a defense tech unit say they were sidelined by DOGE.  “Either we die quickly or we die slowly,” says the director.  —  Under pressure from the Elon Musk-led Department of Government Efficiency, nearly all the staff … ",
    "url": "https://www.politico.com/news/2025/04/15/pentagons-digital-resignations-00290930"
  },
  {
    "text": "The Trump White House is axing the wire service spot from the coverage pool, the latest salvo in its battle with the AP  —  Instead of restoring access to The Associated Press newswire, as required by a federal judge, the Trump administration is removing the wire position in the daily press corps rotation altogether.",
    "url": "https://cnn.com/2025/04/15/media/white-house-pool-wire-services-ap-reuters-bloomberg/"
  },
  {
    "text": "White House Moves to Limit Newswire Access After AP Lawsuit Win  —  The White House announced Tuesday that it was eliminating the traditional press pool access for wire services after a federal court ordered the administration to end viewpoint discrimination against the Associated Press.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-15/white-house-moves-to-limit-newswire-access-after-ap-lawsuit-win"
  },
  {
    "text": "A whistleblower's disclosure details how DOGE may have taken sensitive labor data  —  In the first days of March, a team of advisers from President Trump's new Department of Government Efficiency initiative arrived at the Southeast Washington, D.C., headquarters of the National Labor Relations Board.",
    "url": "https://www.npr.org/2025/04/15/nx-s1-5355896/doge-nlrb-elon-musk-spacex-security"
  },
  {
    "text": "Biden to deliver first public address since leaving White House  —  Former President Biden is set to deliver his first public address since leaving the White House, speaking at the national conference of Advocates, Counselors and Representatives for the Disabled (ACRD) in Chicago on Tuesday, according to a release from the organization.",
    "url": "https://thehill.com/homenews/administration/5248033-biden-address-social-security/"
  },
  {
    "text": "‘Alien Enemies’ or Innocent Men?  Inside Trump's Rushed Effort to Deport 238 Migrants  —  The Trump administration sent them to a prison in El Salvador under a wartime act, calling them members of a Venezuelan gang.  But a New York Times investigation found little evidence of criminal backgrounds or links to the gang.",
    "url": "https://www.nytimes.com/2025/04/15/world/americas/trump-migrants-deportations.html?unlocked_article_code=1._04.x9FD.FNEo2ecTisGA&smid=bs-share"
  },
  {
    "text": "State Terror  —  Yesterday the president defied a Supreme Court ruling to return a man who was mistakenly sent to a gulag in another country, celebrated the suffering of this innocent person, and spoke of sending Americans to foreign concentration camps.  —  This is the beginning … ",
    "url": "https://snyder.substack.com/p/state-terror"
  },
  {
    "text": "Senator Chuck Grassley grilled at Iowa town hall over ‘shameful’ Trump policies  —  The Republican, 91, was confronted by attendees angered over mass deportations and executive overreach  —  The Republican senator Chuck Grassley struggled to control a town hall meeting on Tuesday … ",
    "url": "https://www.theguardian.com/us-news/2025/apr/15/chuck-grassley-town-hall"
  },
  {
    "text": "Trump signs healthcare executive order that includes a win for pharma companies  —  U.S. President Donald Trump directed his health department on Tuesday to work with Congress on revamping a law that allows Medicare to negotiate prescription drug prices, seeking to introduce a change the pharmaceutical industry has lobbied for.",
    "url": "https://www.reuters.com/world/us/trump-signs-healthcare-executive-order-that-includes-win-pharma-companies-2025-04-15/"
  },
  {
    "text": "The NPR, PBS Grift Has Ripped Us Off for Too Long  —  For years, American taxpayers have been on the hook for subsidizing National Public Radio (NPR) and the Public Broadcasting Service (PBS), which spread radical, woke propaganda disguised as “news.”  —  As President Trump has stated … ",
    "url": "https://www.whitehouse.gov/articles/2025/04/the-npr-pbs-grift-has-ripped-us-off-for-too-long/"
  },
  {
    "text": "Republicans Are Trying to Steal an Election  —  Republicans are trying to steal an election in North Carolina.  They have been laying the groundwork for five months, and unless the federal courts intervene, they just might succeed.  If they do, it could usher in a new era of election subversion in future contests across the country.",
    "url": "https://www.democracydocket.com/opinion/republicans-are-trying-to-steal-an-election/"
  },
  {
    "text": "CAUT advises academics against non-essential travel to the U.S.  —  Given the rapidly evolving political landscape in the United States and reports of individuals encountering difficulties crossing the border, CAUT strongly recommends that academic staff travel to the U.S. only if essential and necessary.",
    "url": "https://www.caut.ca/latest/2025/04/caut-advises-academics-against-non-essential-travel-us"
  },
  {
    "text": "‘Treated like a criminal’: US citizen says he was detained returning from Canada  —  Bachir Atallah, a real estate attorney from New Hampshire, says he and his wife, Jessica Fakhri, were stopped crossing from Canada into Vermont  —  A New Hampshire real estate attorney and American citizen returning home … ",
    "url": "https://www.nbcboston.com/news/politics/treated-like-a-criminal-us-citizen-says-he-was-detained-returning-from-canada/3686188/"
  },
  {
    "text": "Trump is halfway to making America a police state  —  The president's refusal to accept a Supreme Court ruling on illegal deportation is a turning point  —  At around noon on April 14 2025, America ceased to have a law-abiding government.  Some would argue that had already happened on January 20, when Donald Trump was inaugurated.",
    "url": "https://www.ft.com/content/4c4b0f14-3e85-4436-94de-204d3f518f3c"
  },
  {
    "text": "Autism rate increased, CDC says in report that contradicts RFK Jr. on cause  —  In a sample of communities, the biennial autism surveillance report found that 1 in 31 8-year-olds had the condition.  The CDC attributed the increase to better screening.  —  One in 31 8-year-olds had autism … ",
    "url": "https://www.washingtonpost.com/health/2025/04/15/autism-rfk-jr-trump-cdc/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0Njg5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MDcxOTk5LCJpYXQiOjE3NDQ2ODk2MDAsImp0aSI6IjAyYzM3ZDY1LTU4YjYtNDM4My1hMjNlLTAyZWRhZGYyZmM2ZSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9oZWFsdGgvMjAyNS8wNC8xNS9hdXRpc20tcmZrLWpyLXRydW1wLWNkYy8ifQ.H0ENRVaxryUv70rJ_OnlegIQKyVirGC8zpfCbEtpmiU&itid=gfta"
  },
  {
    "text": "US Economy to Lose Billions as Foreign Tourists Stay Away … The US economy is set to lose billions of dollars in revenue in 2025 from a pullback in foreign tourism and boycotts of American products, adding to a growing list of headwinds keeping recession risk elevated.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-15/us-economy-is-set-to-lose-billions-as-foreign-tourists-stay-away?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc0NDcyMTA2NiwiZXhwIjoxNzQ1MzI1ODY2LCJhcnRpY2xlSWQiOiJTVUlONTZUMVVNMFcwMCIsImJjb25uZWN0SWQiOiIxNTI1ODQyQjlGOEY0MDMzQUVGNjI4MTNFMkIxMEY0OSJ9.wS0IkqtQyQvATuAxGJy6lWTZtnEbLJ5lfphLYnw6BdU"
  },
  {
    "text": "Lawyer: Federal agents detain Guatemalan man, 29, with no criminal record  —  A Guatemalan immigrant with no Massachusetts criminal record was arrested Monday on Tallman Street after federal agents shattered the glass on his vehicle as he and his wife waited inside the car for their lawyer to arrive.",
    "url": "https://newbedfordlight.org/lawyer-federal-agents-detain-guatemalan-man-29-with-no-criminal-record/"
  },
  {
    "text": "Mayra Flores hospitalized hours after launching comeback House bid  —  Former Republican Rep. Mayra Flores was hospitalized hours after she announced a run for embattled Rep. Henry Cuellar's (D-TX) House seat in Texas, her campaign said in a Tuesday statement.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/congressional/3380923/mayra-flores-hospitalized-hours-comeback-house-bid/"
  },
  {
    "text": "4chan Is Down Following What Looks to Be a Major Hack Spurred By Meme War  —  The notorious imageboard 4chan is down following what appears to be a major hack of its backend.  The hackers claim to have exposed code for the site, the emails of moderators, and a list of mod communications.",
    "url": "https://www.404media.co/4chan-is-down-following-what-looks-to-be-a-major-hack-spurred-by-meme-war/"
  }
]