[
  {
    "text": "Trump won't rule out seeking a third term in the White House, tells NBC News ‘there are methods’ for doing so  —  President Donald Trump said in a Sunday-morning phone call that he was “not joking” about a third term, adding that “it is far too early to think about it.”",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-third-term-white-house-methods-rcna198752"
  },
  {
    "text": "Trump says he's ‘very angry’ and ‘pissed off’ at Putin during an NBC News interview  —  Trump said in an early-morning phone call that if he believes Russia is at fault for a ceasefire not being reached with Ukraine, he may impose secondary tariffs on Russian oil.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-angry-putin-zelenskyy-iran-sanctions-rcna198729"
  },
  {
    "text": "Trump is ‘not joking’ about third term, though Constitution says he can't serve  —  President Trump said “there are methods” that would allow him to serve a third term in office — despite the two-term limit mandated by the Constitution.  —  His remarks came during a wide-ranging phone interview with NBC News on Sunday.",
    "url": "https://www.npr.org/2025/03/30/g-s1-57231/trump-third-term"
  },
  {
    "text": "Americans want Trump's focus more on prices, not tariffs; most approve of deportation efforts — CBS News poll  —  After a week that brought tough economic news and polling showing Americans' views of the economy are still sour, most say President Trump has focused too much on tariffs … ",
    "url": "https://www.cbsnews.com/news/opinion-poll-trump-economy-tariffs-deportation-immigration/"
  },
  {
    "text": "Mike Waltz Is Losing Support Inside the White House  —  Although Trump decided not to fire his national security adviser over the Signal group chat, Waltz's position is tenuous, officials say  —  WASHINGTON—President Trump has decided for now not to fire his national security adviser … ",
    "url": "https://www.wsj.com/politics/policy/mike-waltz-is-losing-support-inside-the-white-house-2b17459c?st=taX7tv&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Wisconsin Supreme Court refuses to take case challenging Elon Musk's $1 million payments  —  A unanimous Wisconsin Supreme Court on Sunday refused to hear a last-minute attempt by the state's Democratic attorney general to stop billionaire Elon Musk from handing over $1 million checks to two voters … ",
    "url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-giveaway-cdea66e0dcbaa53dd183e1d10bee2b35"
  },
  {
    "text": "Fire at New Mexico Republican Party Headquarters Being Investigated as Arson  —  Officials confirmed that the headquarters had been damaged in a fire, which the Republican Party called a “deliberate act of arson.”  —  The headquarters of the Republican Party of New Mexico in Albuquerque … ",
    "url": "https://www.nytimes.com/2025/03/30/us/politics/republican-party-new-mexico-fire-arson.html"
  },
  {
    "text": "Scoop: White House to take charge of briefing-room seating chart  —  The White House plans to impose its own seating chart for reporters in the briefing room in coming weeks, taking over a function long managed by the reporters themselves through the White House Correspondents' Association.",
    "url": "https://www.axios.com/2025/03/30/white-house-press-briefing-seating-chart"
  },
  {
    "text": "‘Climate of fear’: Montreal doctor says NYU cancelled her presentation  —  A Montreal doctor says her presentation at NYU was abruptly cancelled and believes the university did so out of fear of being pressured by the Donald Trump administration.  Dr. Joanne Liu, the former international president … ",
    "url": "https://www.ctvnews.ca/montreal/article/climate-of-fear-montreal-doctor-says-nyu-cancelled-her-presentation/"
  },
  {
    "text": "Deep fear in coal country: DOGE cuts put region's miners and families on edge  —  For federal safety inspectors, the urgent call to their sprawling mining office near Pittsburgh was bleak: Man crushed in the rubble of an aging mine in the heart of coal country.",
    "url": "https://www.post-gazette.com/business/powersource/2025/03/30/coal-mine-safety-doge-trump-spending-cuts-federal/stories/202503280062"
  },
  {
    "text": "For God's Sake, Fellow Lawyers, Stand Up to Trump  —  President Trump this month issued an executive order clearly intended to destroy the venerable law firm Perkins Coie, a firm that has zealously represented clients large and small for more than a century.",
    "url": "https://www.nytimes.com/2025/03/30/opinion/perkins-coie-trump.html?unlocked_article_code=1.704.9pYt.a6WWtBIYt52n"
  },
  {
    "text": "Iran has rejected direct negotiations with the US in response to Trump's letter  —  Iran's president said Sunday that the Islamic Republic rejected direct negotiations with the United States over its rapidly advancing nuclear program, offering Tehran's first response to a letter … ",
    "url": "https://apnews.com/article/iran-rejects-direct-negotiations-trump-letter-us-c414743a567c574b6f48f64a2e889f31"
  },
  {
    "text": "FBI raids home of prominent computer scientist who has gone incommunicado … A prominent computer scientist who has spent 20 years publishing academic papers on cryptography, privacy, and cybersecurity has gone incommunicado, had his professor profile, email account, and phone number removed … ",
    "url": "https://arstechnica.com/security/2025/03/computer-scientist-goes-silent-after-fbi-raid-and-purging-from-university-website/"
  },
  {
    "text": "‘It reminds you of a fascist state’: Smithsonian Institution braces for Trump rewrite of US history  —  Normally staid historians sound alarm at authoritarian grasping for control of the premier US museum complex  —  In a brightly lit gallery, they see the 66m-year-old skeleton of a Tyrannosaurus rex.",
    "url": "https://www.theguardian.com/us-news/2025/mar/30/smithsonian-institution-trump-executive-order"
  },
  {
    "text": "Trump calls ‘never ending’ Signal leak story ‘old and boring,’ blasts media  —  President Trump slammed the media for its “never ending” coverage of the Signal group chat leak, calling it “old and boring.”  —  In a post Sunday on Truth Social, Trump praised Sen. Markwayne Mullin (R-Okla.) … ",
    "url": "https://thehill.com/homenews/administration/5222684-trump-calls-never-ending-signal-leak-story-old-and-boring-blasts-media/"
  },
  {
    "text": "Universities Should Challenge Trump's Speech-Based Deportations of Students in Court  —  The Trump administration has been detaining and trying to deport immigrant and foreign students for their First-Amendment protected speech.  That includes even speech that does not even support terrorism … ",
    "url": "https://reason.com/volokh/2025/03/30/universities-should-challenge-trumps-speech-based-deportations-of-students-in-court/"
  },
  {
    "text": "Twenty Lessons, read by John Lithgow  —  Key selections from On Tyranny, for viewing and sharing  —  Here is my best guidance for action, rendered beautifully by the great John Lithgow.  I first published these lessons more than eight years ago, in late 2016.",
    "url": "https://snyder.substack.com/p/twenty-lessons-read-by-john-lithgow"
  },
  {
    "text": "Agency for older adults and people with disabilities to be shuttered under HHS cuts  —  Former head of agency sees the closure of the Administration for Community Living as an attack on vulnerable populations  —  With the announcement by the Department of Health and Human Services … ",
    "url": "https://www.marketwatch.com/story/agency-for-older-adults-and-people-with-disabilities-to-be-shuttered-under-hhs-cuts-d0ff3bc2"
  },
  {
    "text": "The s-word rippling through Wall Street and Main Street  —  Economic growth has flatlined so far this year.  Inflation has picked up.  And consumers expect both to get worse in the months ahead.  —  Why it matters: For the moment, it adds up to Wall Street's least-favorite “s-word,” … ",
    "url": "https://www.axios.com/2025/03/30/stagflation-economy-inflation-growth"
  },
  {
    "text": "Marine Le Pen Could Be Banned From France Election if She's Found Guilty of Embezzlement  —  A verdict Monday in an embezzlement trial is seen as a test of the country's democracy — and the rule of law.  —  Marine Le Pen, the French far-right leader, has tried and failed three times to become president.",
    "url": "https://www.nytimes.com/2025/03/30/world/europe/le-pen-embezzlement-trial-france-election.html"
  },
  {
    "text": "UAW president: ‘Deplorable’ that Trump stripped union rights for federal workers  —  United Auto Workers (UAW) President Shawn Fain said it is “deplorable” that President Trump moved to strip union rights from federal workers.  —  Fain joined CBS News's “Face the Nation” on Sunday … ",
    "url": "https://thehill.com/homenews/administration/5222300-uaw-president-deplorable-trump-strip-union-rights-federal-workers/"
  },
  {
    "text": "Minnesota officials seek answers in case of graduate student detained by ICE  —  Officials in Minnesota are seeking answers in the case of a University of Minnesota graduate student who's being detained by U.S. immigration authorities for unknown reasons.  University leadership said Immigration … ",
    "url": "https://apnews.com/article/university-of-minnesota-graduate-student-detained-38e5ac3681b3d5e2c9d82ae40f9ae7f9"
  },
  {
    "text": "In Gaza, Almost Every IDF Platoon Keeps a Human Shield, a Sub-army of Palestinian Slaves  —  Innocent Palestinians are regularly forced by soldiers to enter houses in Gaza to make sure there are no terrorists or explosives.  So why is the IDF's Military Police Criminal Investigation Division opening … ",
    "url": "https://www.haaretz.com/opinion/2025-03-30/ty-article-opinion/.premium/in-gaza-almost-every-idf-platoon-keeps-a-human-shield-a-sub-army-of-palestinian-slaves/00000195-e627-deaf-a397-f6674e390000"
  },
  {
    "text": "DOGE wants businesses to run government services ‘as much as possible’  —  Elon Musk's effort is pushing privatization — a longtime goal for conservatives and for Silicon Valley alike — across federal agencies  —  Mail delivery.  Real estate.  Foreign aid grants.",
    "url": "https://www.washingtonpost.com/technology/2025/03/30/doge-privatize-government-usps-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzMzA3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0Njg5NTk5LCJpYXQiOjE3NDMzMDcyMDAsImp0aSI6IjM5MzgyNDNiLTU2ZDUtNDRkOC04YzA5LTg1NTBmMWZhYjI1YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDMvMzAvZG9nZS1wcml2YXRpemUtZ292ZXJubWVudC11c3BzLXRydW1wLyJ9.SRNV-xoYzN5sJ9bun4C03UPYG3TCnPBxhqGLBmYS2ss&itid=gfta"
  }
]