[
  {
    "text": "Musk's DOGE Teen Was Fired By Cybersecurity Firm for Leaking Company Secrets  —  Edward Coristine posted online that he had retained access to the firm's servers.  Now he has access to sensitive government information.  —  Edward Coristine, a 19-year-old member of Elon Musk's squad that's … ",
    "url": "https://www.bloomberg.com/news/articles/2025-02-07/musk-s-doge-teen-was-fired-by-cybersecurity-firm-for-leaking-company-secrets?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczODk1NzQyNCwiZXhwIjoxNzM5NTYyMjI0LCJhcnRpY2xlSWQiOiJTUkJXMTlUMVVNMFcwMCIsImJjb25uZWN0SWQiOiIyQjE3NzFFOTlEODc0QzRDOTY1Njg1RTZBQkJGM0QwRCJ9.vxGv4ncXEbIrUGmUYpTUdxLmCVDwzmEWp-VRWV9otME"
  },
  {
    "text": "Staffer with Elon Musk's DOGE amplified white supremacists online  —  One of the people working with billionaire Elon Musk in his efforts to overhaul the U.S. government is a Berkeley-educated computer scientist who has boosted white supremacists and misogynists online.",
    "url": "https://www.reuters.com/world/us/staffer-with-elon-musks-doge-amplified-white-supremacists-online-2025-02-07/"
  },
  {
    "text": "Is Donald Trump Afraid of Elon Musk?  —  The president has long operated without anything resembling worry when it comes to appointments or executive action, but as his most powerful—and richest—political ally chainsaws his way through the federal government, some observers wonder if Trump might be tasting his own medicine.",
    "url": "https://www.vanityfair.com/news/story/is-donald-trump-afraid-of-elon-musk"
  },
  {
    "text": "The Now Deleted Tweets Of DOGE Staffer Gavin Kliger  —  From mass deportations and military tribunal executions to calling Hillary Clinton a slur, OPM staffer Gavin Kliger has embraced the fringes of Elon Musk's X and Trump's MAGA movement.  —  John Hyatt is a NYC-based Forbes staff writer covering billionaires.",
    "url": "https://www.forbes.com/sites/johnhyatt/2025/02/07/the-now-deleted-tweets-of-doge-staffer-gavin-kliger/"
  },
  {
    "text": "A US Treasury Threat Intelligence Analysis Designates DOGE Staff as ‘Insider Threat’  —  An internal email reviewed by WIRED calls DOGE staff's access to federal payments systems “the single biggest insider threat risk the Bureau of the Fiscal Service has ever faced.”",
    "url": "https://www.wired.com/story/treasury-bfs-doge-insider-threat/"
  },
  {
    "text": "The Government's Computing Experts Say They Are Terrified … Elon musk's unceasing attempts to access the data and information systems of the federal government range so widely, and are so unprecedented and unpredictable, that government computing experts believe the effort has spun out of control.",
    "url": "https://www.theatlantic.com/technology/archive/2025/02/elon-musk-doge-security/681600/?gift=bQgJMMVzeo8RHHcE1_KM0bQqBafgZ_W6mgfrvf8YevM&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Treasury installs ally of Musk's DOGE as head of payment system  —  The move follows the ousting of a career official who rebuffed attempts to use the payment system to stop federal spending.  —  The Treasury Department will make an ally of billionaire Elon Musk's U.S. DOGE Service the head … ",
    "url": "https://www.washingtonpost.com/business/2025/02/07/treasury-doge-payments-musk/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM4OTA0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQwMjg2Nzk5LCJpYXQiOjE3Mzg5MDQ0MDAsImp0aSI6IjQ2NWI2ZDVjLTIwNzItNGM4Yy1hNWJjLTkxOGJlMzFiOGE2NSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAyLzA3L3RyZWFzdXJ5LWRvZ2UtcGF5bWVudHMtbXVzay8ifQ.IhKQLHOnDhn22fYfL704Ha4INrtQrVnHGe4okyYMhpE&itid=gfta"
  },
  {
    "text": "Kash Patel Took $25,000 From Russia-Linked Firm to Appear on an Anti-FBI TV Series  —  Last year, Kash Patel, the MAGA provocateur whom Donald Trump has nominated to head the FBI, received $25,000 from a Russia-linked production company to participate in a documentary in which he assailed the FBI and called for closing its headquarters.",
    "url": "https://www.motherjones.com/politics/2025/02/kash-patel-fbi-trump-tucker-carlson-russia-ukraine-putin/"
  },
  {
    "text": "Judge to pause Trump administration effort to gut USAID's workforce by thousands  —  Two labor groups had sued the Trump administration after it said that thousands of USAID employees would be placed on administrative leave starting at 11:59 p.m. Friday.  —  A federal judge on Friday … ",
    "url": "https://www.nbcnews.com/politics/politics-news/judge-pause-trump-administration-effort-gut-usaids-workforce-thousands-rcna191280"
  },
  {
    "text": "Trump says he's revoking Biden's security clearance, ending intelligence briefings in payback move  —  President Donald Trump said Friday that he's revoking former President Joe Biden's security clearance and ending the daily intelligence briefings he's receiving in payback for Biden doing the same to him in 2021.",
    "url": "https://apnews.com/article/trump-biden-security-clearance-revoked-be82cd4f185f01404718fcc69e074fbf"
  },
  {
    "text": "Key Dates  —  Related Announcements  —  Issued by  —  Office of The Director, National Institutes of Health (OD)  —  Purpose  —  The National Institutes of Health (NIH) awards a large number of grants providing substantial federal funding for research purposes.",
    "url": "https://grants.nih.gov/grants/guide/notice-files/NOT-OD-25-068.html"
  },
  {
    "text": "Donald Trump Says He'll Name Himself Chairman Of Kennedy Center And Oust Board Members  —  Donald Trump said that he will oust board members of the Kennedy Center, while naming himself as its new chairman.  —  David Rubenstein is the current chairman of the center and agreed to stay in that role through 2026.",
    "url": "https://deadline.com/2025/02/trump-kennedy-center-board-1236281969/"
  },
  {
    "text": "Trump hints at tariffs on Japan during meeting with its prime minister  —  President Donald Trump hinted during a news conference that Japan could soon face U.S. tariffs if it doesn't take steps to buy more from the United States.  The comments come as Japan's new prime minister, Shigeru Ishiba … ",
    "url": "https://www.washingtonpost.com/politics/2025/02/07/trump-presidency-news/"
  },
  {
    "text": "Why Trump's plan to “clean out” Gaza actually matters  —  It's a safe bet that much of what President Donald Trump described in two press availabilities at the White House alongside Prime Minister Benjamin Netanyahu on Tuesday, as well as a follow-up social media post, is not going to happen.",
    "url": "https://www.vox.com/world-politics/398894/trump-gaza-clean-out-riviera-egypt-jordan-palestinians-netanyahu"
  },
  {
    "text": "Trump's FBI Pick Kash Patel Took Up to $5M in Stock from Chinese Ecommerce Giant Shein  —  Donald Trump's pick for FBI director told senators he has no plans to divest his shares, which his financial disclosure form says were received in exchange for consulting services.",
    "url": "https://www.wired.com/story/kash-patel-elite-depot-shein/"
  },
  {
    "text": "North Carolina Judge Rejects GOP State Supreme Court Candidate's Bid To Throw Out 60K Ballots  —  A Wake County Superior Court judge rejected a bid by GOP North Carolina Supreme Court candidate Jefferson Griffin to overturn his 2024 election loss to incumbent Democratic Justice Allison Riggs … ",
    "url": "https://www.democracydocket.com/news-alerts/north-carolina-judge-rejects-gop-state-supreme-court-candidates-bid-to-throw-out-60k-ballots/"
  },
  {
    "text": "Measles Outbreak Mounts Among Children in One of Texas' Least Vaccinated Counties  —  A measles outbreak is growing in a Texas county with dangerously low vaccination rates.  —  In late January, two school-age children from Gaines County were hospitalized with measles.",
    "url": "https://kffhealthnews.org/news/article/texas-measles-outbreak-gaines-county-public-health-measles-vaccine/"
  },
  {
    "text": "U.K. orders Apple to let it spy on users' encrypted accounts  —  Secret order requires blanket access to protected cloud backups around the world, which if implemented would undermine Apple's privacy pledge to its users.  —  Security officials in the United Kingdom have demanded that Apple create … ",
    "url": "https://www.washingtonpost.com/technology/2025/02/07/apple-encryption-backdoor-uk/"
  },
  {
    "text": "Former GOP Director Of FBI, CIA Urges Chuck Grassley To Stop Kash Patel's Nomination  —  “After all the hard work that you've done over your career, to allow it to be destroyed on your watch would not be a legacy I would want,” warned William Webster.  —  LOADING",
    "url": "https://www.huffpost.com/entry/william-webster-chuck-grassley-kash-patel_n_67a639f2e4b0f2a1787a0010"
  },
  {
    "text": "Exclusive: Trump Air Force nominee arranged satellite contract in manner that favored Musk's SpaceX, sources say  —  President Donald Trump's nominee as Air Force Secretary, currently a top official at the national spy satellite agency, arranged a multibillion-dollar contract solicitation … ",
    "url": "https://www.reuters.com/world/us/trump-air-force-nominee-arranged-satellite-contract-manner-that-favored-musks-2025-02-07/"
  },
  {
    "text": "As Trump and Musk Upend Washington, Congressional Phones Can't Keep Up  —  In the three weeks since President Trump took office and gave Elon Musk free rein inside the federal government, millions of calls have poured in to members of Congress, jamming the system.",
    "url": "https://www.nytimes.com/2025/02/07/us/politics/congressional-phone-lines-trump-musk.html?unlocked_article_code=1.vU4.JpN7.1YXzr_AcTgVn&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Dem Overseeing ‘Digital Assets’ to Hold Luxury Retreat With Crypto Kingpin  —  Ruben Gallego, Arizona's new senator, is set to hold a fundraising weekend with Silicon Valley investor Marc Andreessen and blogger Matt Yglesias  —  Freshman Arizona Sen. Ruben Gallego was recently named … ",
    "url": "https://www.rollingstone.com/politics/politics-features/ruben-gallego-crypto-digital-assets-andreessen-yglesias-1235260013/"
  },
  {
    "text": "How to Win the USAID Fight  —  First up: Sarah and I argued about everything on the Secret pod today.  The show is here.  —  Second: An update on yesterday's story about the confusion surrounding Trump's (maybe?) firing the head of the National Archives.  There had been conflicting reports … ",
    "url": "https://www.thebulwark.com/p/how-to-win-the-usaid-fight"
  },
  {
    "text": "Goodbye, Pamela Paul … Goodbye, Pamela Paul!  You hardly knew us.  —  The controversial columnist is exiting the New York Times “Opinion” section this spring as part of a wave of job cuts.  In 2022, after a decade of editing the Book Review, Paul joined “Opinion,” where she quickly gained … ",
    "url": "https://nymag.com/intelligencer/article/pamela-paul-goodbye-to-the-new-york-times-opinion-columnist.html"
  },
  {
    "text": "Be clear about what Trump and Musk's aid axe will do: people will face terror and starve, many will die  —  The decimation of USAid is already having a terrible effect in some of the poorest places on the planet.  It damages America: it will harm us all  —  An earthquake of magnitude 7.0 or above could not have caused more carnage.",
    "url": "https://www.theguardian.com/commentisfree/2025/feb/07/donald-trump-elon-musk-usaid-poverty-america"
  },
  {
    "text": "AG Bondi to Criminally Prosecute Private Entities for DEIA  —  Bondi makes clear that the “again” in MAGA refers to the period of Jim Crow America  —  This week a contact at the DOJ sent me a dozen memos just been issued by new US Attorney General Pam Bondi.",
    "url": "https://lets-address-this-with-qasim-rashid.ghost.io/ag-bondi-to-criminally-prosecute-private-entities-for-deia/"
  },
  {
    "text": "Trump makes an outrageous choice for his White House Faith Office  —  After Trump's 2020 loss, Paula White said “demonic confederacies” were trying to steal the election.  She'll now lead the new White House Faith Office.  —  Donald Trump's remarks at the latest National Prayer Breakfast went about as well as expected.",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-makes-outrageous-choice-white-house-faith-office-rcna191170"
  },
  {
    "text": "The US Government Is Not a Startup  —  Elon Musk is moving fast and breaking things that can't afford to be broken.  —  It feels like no one should have to say this, and yet we are in a situation where it needs to be said, very loudly and clearly, before it's too late to do anything about it: The United States is not a startup.",
    "url": "https://www.wired.com/story/the-us-government-is-not-a-startup/"
  },
  {
    "text": "States accuse Trump administration of continuing to block federal climate funding  —  A group of attorneys general allege that the Trump administration has not complied with a court order to keep federal funds flowing.  —  A group of state attorneys general accused the Trump administration Friday … ",
    "url": "https://www.politico.com/news/2025/02/07/states-trump-federal-climate-funding-00203214"
  },
  {
    "text": "Controversial Christian nationalist legislation introduced in North Dakota House  —  At the start of the new legislative session, a group of North Dakota legislators put forward a potentially unconstitutional resolution that would have the state “acknowledge the Kingship of Jesus Christ.”",
    "url": "https://heartlandsignal.com/2025/02/07/controversial-christian-nationalist-legislation-introduced-in-north-dakota-house/"
  },
  {
    "text": "Scoop: Jeffries' centrists press him to let them vote for GOP bills … - The discussion, according to one House Democrat who was present, centered on giving centrist and swing-district Democrats “flexibility to take certain votes.” … - Said another member who was at the meeting … ",
    "url": "https://www.axios.com/2025/02/07/hakeem-jeffries-centrists-republican-bills"
  },
  {
    "text": "DOJ orders child safety authority to comply with Trump's ‘gender ideology’ order  —  The National Center for Missing and Exploited Children said it would be removing all references to transgender people from its public materials.  —  The National Center for Missing and Exploited Children … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/doj-orders-child-safety-authority-comply-trumps-gender-ideology-order-rcna191282"
  },
  {
    "text": "What Elon Musk Wants  —  This is an edited transcript of an episode of “The Ezra Klein Show.”  You can listen to the conversation by following or subscribing to the show on the NYT Audio App, Apple, Spotify, Amazon Music, YouTube, iHeartRadio or wherever you get your podcasts.",
    "url": "https://www.nytimes.com/2025/02/07/opinion/ezra-klein-podcast-kara-swisher.html"
  }
]