[
  {
    "text": "Pentagon: Over 1 million pounds of aid reaches Gaza via U.S. pier … - The effort “is being carried out as part of the United States' broader efforts alongside international partners to surge assistance to Palestinians in need,” the Pentagon said in a blog post.",
    "url": "https://www.axios.com/2024/05/24/gaza-aid-us-pier-pentagon"
  },
  {
    "text": "Louisiana Legislature approves bill classifying abortion pills as controlled dangerous substances  —  Two abortion-inducing drugs could soon be reclassified as controlled and dangerous substances in Louisiana under a first-of-its-kind bill that received final legislative passage Thursday … ",
    "url": "https://apnews.com/article/abortion-pills-louisiana-legislature-controlled-substance-06ea3e8df86b72b473efe8fc71054ddf"
  },
  {
    "text": "Jailed Trump Adviser Peter Navarro Says He Doesn't Want a Pardon: ‘I Have No Regrets’  —  From a federal prison, former aide plots new MAGA agenda  —  Peter Navarro, a former top White House adviser to Donald Trump, isn't interested in a pardon should “the boss” return to power.",
    "url": "https://www.wsj.com/politics/policy/peter-navarro-pardon-donald-trump-presidency-2024-56ec0426"
  },
  {
    "text": "GOP Senate Candidate Spent Thousands in Donor Funds on Strip Clubs, Luxury, and Mysterious Wire Transfers  —  ROLLS ROYCE  —  Star athlete and conspiracy theorist Royce White just landed the Minnesota GOP's endorsement for Senate.  They must not have seen his previous campaign expenses.",
    "url": "https://www.thedailybeast.com/gop-sen-candidate-royce-white-spent-big-on-strip-clubs-limos-luxury"
  },
  {
    "text": "The Shaky Foundation of Trump's Lead: Disengaged Voters  —  The Biden team faces questions of its own: Why have these voters backed away from him, and can his campaign find a way to reach them?  —  The polls have shown Donald J. Trump with an edge for eight straight months … ",
    "url": "https://www.nytimes.com/2024/05/24/upshot/trump-biden-polls-voters.html"
  },
  {
    "text": "Trump's V.P. Pageant Has an Unexpectedly Strong Contender: Tom Cotton  —  Donald Trump's interest in the Arkansas senator reflects a desire to choose a running mate with experience and the ability to run a disciplined campaign.  —  Senator Tom Cotton of Arkansas has unexpectedly emerged … ",
    "url": "https://www.nytimes.com/2024/05/24/us/politics/tom-cotton-trump-vp.html"
  },
  {
    "text": "Trump Has Already Sown Doubts About the 2024 Election Results  —  Former President Donald J. Trump has baselessly and publicly cast doubt about the fairness of the 2024 election about once a day, on average, since he announced his candidacy for president, according to an analysis by The New York Times.",
    "url": "https://www.nytimes.com/interactive/2024/05/24/us/politics/trump-election-results-doubt.html"
  },
  {
    "text": "Exclusive: Putin wants Ukraine ceasefire on current frontlines  —  Russian President Vladimir Putin is ready to halt the war in Ukraine with a negotiated ceasefire that recognises the current battlefield lines, four Russian sources told Reuters, saying he is prepared to fight on if Kyiv and the West do not respond.",
    "url": "https://www.reuters.com/world/europe/putin-wants-ukraine-ceasefire-current-frontlines-sources-say-2024-05-24/"
  },
  {
    "text": "Ex-Labour Leader Corbyn to Stand as Independent in UK Election  —  Former Labour Party leader Jeremy Corbyn will stand as an independent candidate in the general election, a potentially awkward moment for his old party and Keir Starmer's campaign to become UK prime minister.",
    "url": "https://www.bloomberg.com/news/articles/2024-05-24/ex-labour-leader-corbyn-to-stand-as-independent-in-uk-election"
  },
  {
    "text": "The White House to the left: We told you so on crime  —  ‘Well-meaning ideas have gone too far, and we need a sensible approach.’  —  The defeat of a liberal Portland prosecutor at the hands of a tough-on-crime challenger has hardened a view among top White House officials that Democrats need … ",
    "url": "https://www.politico.com/news/2024/05/23/white-house-oregan-turn-towards-center-00159588"
  },
  {
    "text": "Clarence Thomas attacks Brown v. Education ruling amid 70th anniversary … - Those remedies came through “extravagant uses of judicial power” to end racial segregation in the 1950s and 60s, Thomas wrote.  — Federal courts have limited power to grant equitable relief … ",
    "url": "https://www.axios.com/2024/05/23/clarence-thomas-supreme-court-racial-segregation"
  },
  {
    "text": "Supreme Court allows disputed South Carolina voting map, a win for GOP  —  At issue was whether the map was an unconstitutional attempt to divvy voters up by race — or was permitted partisan gerrymandering.  —  The Supreme Court on Thursday allowed the use of a South Carolina congressional map … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/23/supreme-court-ruling-south-carolina-voting-map-gerrymander/"
  },
  {
    "text": "Most believe Trump probably guilty of crime as his NYC trial comes to an end, CBS News poll finds  —  As Donald Trump's trial in New York City nears closing arguments, most Americans believe he is guilty of a crime in this case.  But they are less sure what the jury will do after it deliberates next week.",
    "url": "https://www.cbsnews.com/news/trump-trial-poll-most-believe-guilty-new-york/"
  },
  {
    "text": "Ohio governor calls special session to ensure Biden gets on ballot  —  The Republican governor took the move after fellow GOP members in the state assembly were at an impasse to ensure President Biden would be on the November election ballot in his state.  —  Ohio Gov. Mike DeWine (R) … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/23/ohio-biden-ballot/"
  },
  {
    "text": "Russia denies Trump's claim he can free US journalist if he wins election  —  Spokesman says 'there aren't any contacts' with former president regarding Evan Gershkovich's release from Russia  —  Donald Trump boasted on Thursday he would quickly free the jailed US journalist Evan Gershkovich … ",
    "url": "https://www.theguardian.com/us-news/article/2024/may/23/russia-denies-trump-claim-us-journalist"
  },
  {
    "text": "North Carolina public universities board repeals policy in vote that likely cuts diversity jobs  —  North Carolina's public university system board voted Thursday to repeal a nearly five-year-old diversity, equity and inclusion policy, meaning its 17 schools will likely join other major universities … ",
    "url": "https://apnews.com/article/north-carolina-diversity-dei-board-of-governors-dc23328c84b9005fc1e916164e44c3fa"
  },
  {
    "text": "Revelation of secret Obama-era program casts doubt on stated reason for Trump Mar-a-Lago raid  —  ‘The law protects only those who follow the norms of one party,’ America First Legal Vice President Dan Epstein says  —  FIRST ON FOX: A purportedly never-before-seen Department of Defense memo … ",
    "url": "https://www.foxnews.com/politics/revelation-secret-obama-era-program-casts-doubt-stated-reason-trump-mar-a-lago-raid"
  },
  {
    "text": "Gavin Newsom signs bill allowing Arizona doctors to perform abortions in California  —  The California Democrat signed legislation drafted in response to the Arizona Supreme Court ruling that a near-total ban on abortion from 1864 is enforceable in the state.",
    "url": "https://www.nbcnews.com/politics/politics-news/gavin-newsom-signs-bill-letting-arizona-doctors-perform-abortions-cali-rcna153836"
  },
  {
    "text": "‘A Failed Medical School’: How Racial Preferences, Supposedly Outlawed in California, Have Persisted at UCLA … Long considered one of the best medical schools in the world, the University of California, Los Angeles's David Geffen School of Medicine receives as many as 14,000 applications a year.",
    "url": "https://freebeacon.com/campus/a-failed-medical-school-how-racial-preferences-supposedly-outlawed-in-california-have-persisted-at-ucla/"
  },
  {
    "text": "Is the Biden Campaign Running on False Hope?  —  Most polls show Donald Trump leading in swing states, but the Democratic Party strategist Simon Rosenberg believes the President's chances are better than the surveys suggest.  —  President Joe Biden trails Donald Trump by approximately … ",
    "url": "https://www.newyorker.com/news/q-and-a/is-the-biden-campaign-running-on-false-hope"
  },
  {
    "text": "'Ron, I love that you're back': Trump and DeSantis put an often personal primary fight behind them  —  Donald Trump, the presumptive Republican presidential nominee, and Florida Gov. Ron DeSantis are signaling to donors that they are putting their rivalry behind them after a contentious and often personal primary fight.",
    "url": "https://apnews.com/article/trump-desantis-presidential-campaign-rivalry-fundraising-republicans-d782508e303cd87ff853cac8b999c477"
  }
]