[
  {
    "text": "Columbia Yields to Trump in Battle Over Federal Funding  —  School to ban masks, empower police and rein in controversial academic department  —  Columbia University will cede to President Trump's far-reaching demands in negotiations over $400 million in federal funding he revoked this month … ",
    "url": "https://www.wsj.com/us-news/education/columbia-university-trump-demands-federal-funding-e94d41ca?st=MVb992&reflink=article_copyURL_share"
  },
  {
    "text": "Decades Ago, Columbia Refused to Pay Trump $400 Million.  Note That Number.  —  A quarter century ago, the university was looking to expand.  It considered, and rejected, property owned by Donald Trump.  He did not forget it.  —  Donald Trump was demanding $400 million from Columbia University.",
    "url": "https://www.nytimes.com/2025/03/21/nyregion/trump-columbia-university-400-million.html?unlocked_article_code=1.5k4.gPqS.2tWiVKxmUmh8&smid=url-share"
  },
  {
    "text": "Columbia University agrees to Trump demands in effort to restore federal funding  —  The Trump administration — which canceled $400 million in grants — had ordered the school to implement a mask ban, discipline protesters, reform admissions and more.  —  Columbia University has agreed … ",
    "url": "https://www.nbcnews.com/news/us-news/columbia-university-trump-demands-funding-rcna197261"
  },
  {
    "text": "Federal judge pushes back on acting Social Security head over threat to close agency  —  Leland Dudek backed off his argument that a ruling blocking Elon Musk's cost-cutting team from access to sensitive data could apply to all agency employees.  —  just now",
    "url": "https://www.washingtonpost.com/politics/2025/03/21/social-security-benefits-trump-doge/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyNTI5NjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQzOTExOTk5LCJpYXQiOjE3NDI1Mjk2MDAsImp0aSI6ImU3ZTBmZGQxLWUzNGItNDE4Ny1hMTFjLTZmZGU1YmZiZmE3ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzIxL3NvY2lhbC1zZWN1cml0eS1iZW5lZml0cy10cnVtcC1kb2dlLyJ9.NSr5fpbMc10PSQWZy7qubcqNthsh_Bjoq8b_btWprZ0&itid=gfta"
  },
  {
    "text": "U.S. to revoke legal status of more than a half-million migrants, urges them to self deport  —  The Trump administration will be revoking the legal status of hundreds of thousands of Latin American and Haitian migrants welcomed into the U.S. under a Biden-era sponsorship process … ",
    "url": "https://www.cbsnews.com/news/u-s-to-revoke-legal-status-of-over-a-half-million-migrants-chnv/"
  },
  {
    "text": "Trump revokes legal status for 530,000 Cubans, Haitians, Nicaraguans and Venezuelans  —  U.S. President Donald Trump's administration will revoke the temporary legal status of 530,000 Cubans, Haitians, Nicaraguans and Venezuelans in the United States, according to a Federal Register notice on Friday … ",
    "url": "https://www.reuters.com/world/us/trump-revokes-legal-status-530000-cubans-haitians-nicaraguans-venezuelans-2025-03-21/"
  },
  {
    "text": "Legal community shaken by a powerful law firm's decision to give in to Trump's demands  —  President Donald Trump rescinded his executive order targeting Paul Weiss — after the law firm agreed to certain conditions.  —  WASHINGTON — On Thursday, the powerful law firm Paul Weiss caved.",
    "url": "https://www.nbcnews.com/politics/trump-administration/legal-community-shaken-powerful-law-firm-paul-weiss-trump-rcna197490"
  },
  {
    "text": "We Dug Into the Polls.  Democrats in Congress Should Be Very Afraid.  —  Democratic voters are even angrier than you think.  —  As Senate Minority Leader Chuck Schumer knows better than anyone, the Democratic base is pissed off.  And not just a little.  —  The intensity of the anger roiling … ",
    "url": "https://www.politico.com/news/magazine/2025/03/21/polling-data-democrats-primaries-grassroots-tea-party-00241769"
  },
  {
    "text": "“They hate us”: Democrats confront their own Tea Party  —  Democratic members of Congress, back home in their districts for the last week, have been encountering a level of anger and hostility that some see as reminiscent of the 2010 Tea Party wave.  —  Why it matters: The dynamic could spill … ",
    "url": "https://www.axios.com/2025/03/21/democrats-house-senate-tea-party-trump"
  },
  {
    "text": "Trump Fires Nearly the Entire Civil Rights Branch of D.H.S.  —  The move guts the office responsible for oversight over President Trump's immigration crackdown.  —  The Trump administration fired nearly the entire civil rights branch of the Department of Homeland Security on Friday … ",
    "url": "https://www.nytimes.com/2025/03/21/us/politics/trump-civil-rights-homeland-security-deportations.html?unlocked_article_code=1.5k4.RV0s._A5mbmF3TuC0&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Judge vows to determine if Trump administration violated his order on deportation flights  —  “The government's not being terribly cooperative,” U.S. District Judge James Boasberg said.  —  U.S. District Judge James Boasberg vowed Friday to determine whether the Trump administration defied … ",
    "url": "https://www.politico.com/news/2025/03/21/james-boasberg-trump-administration-deportations-00003815"
  },
  {
    "text": "Trump unveils new ‘F-47’ fighter jet  —  Thank you for signing up!  —  The latest in politics and policy.  Direct to your inbox.  Sign up for the 12:30 Report newsletter  —     —  Happy Friday!  How many of you are planning to “stay online” today while actually watching March Madness games?",
    "url": "https://thehill.com/newsletters/1230-report/5207678-march-madness-specials-trump-elon-musk-classified-war-briefing-uk-travel-warning/"
  },
  {
    "text": "Commerce secretary: No one but ‘fraudsters’ would complain about missed Social Security check  —  Commerce Secretary Howard Lutnick raised alarm over “fraudsters” receiving Social Security benefits, as Trump allies have ramped up rhetoric about potential waste in the program amid … ",
    "url": "https://thehill.com/homenews/administration/5208187-commerce-secretary-social-security-fraud/"
  },
  {
    "text": "Canadians to Maine: No, thanks!  —  Canadian tourists make up about 30-40% of the revenue for many businesses in Old Orchard Beach, Maine.  This year, many are choosing to skip their regular getaway, given President Trump's antagonistic rhetoric towards Canada.",
    "url": "https://www.cnn.com/2025/03/20/travel/video/canada-trump-maine-travel-cancellations-digvid"
  },
  {
    "text": "Democratic Senators Team Up With MAGA To Hand Trump A Censorship Machine  —  At the exact moment when Donald Trump and his MAGA allies are actively dismantling democratic institutions and working to silence critics, a group of Democratic Senators have decided to collaborate with Trump's supporters … ",
    "url": "https://www.techdirt.com/2025/03/21/democratic-senators-team-up-with-maga-to-hand-trump-a-censorship-machine/"
  },
  {
    "text": "Leakers to Musk: We're 'not Elon's servants'  —  Even before Musk's comments, federal workers felt vulnerable and increasingly incensed.  —  The pervasive fear and anger that have been rippling through federal agencies over Elon Musk's slashing approach to shrinking government deepened … ",
    "url": "https://www.politico.com/news/2025/03/21/musk-leakers-government-trump-doge-00243208"
  },
  {
    "text": "Anti-Vaxx Mom Whose Daughter Died From Measles Says Disease 'Wasn't That Bad'  —  The child's parents doubled down on their decision not to vaccinate their child even after her death  —  The parents of an unvaccinated Texas child who died from measles appeared in a video formulated … ",
    "url": "https://www.latintimes.com/anti-vaxx-mom-whose-daughter-died-measles-says-disease-wasnt-that-bad-578871"
  },
  {
    "text": "“Ludicrous” Situation: Jeffrey Epstein Case Redaction Takes Over FBI's New York Office  —  The bureau's New York field office normally chases drug dealers and spies.  Right now, according to multiple sources, priority one is redacting the sex trafficker's case files.",
    "url": "https://www.vanityfair.com/news/story/epstein-case-review-fbis-new-york"
  },
  {
    "text": "No evidence of coordinated vandalism of Teslas despite Musk and Trump claims  —  The attacks have come as Musk has emerged as one of the brightest flashpoints of an already tumultuous second Trump administration.  —  Law enforcement officials and domestic extremism experts say they have found … ",
    "url": "https://www.nbcnews.com/tech/elon-musk/tesla-vandalism-not-coordinated-trump-musk-claims-rcna197369"
  },
  {
    "text": "Strengthening the Suitability and Fitness of the Federal Workforce  —  MEMORANDUM FOR THE DIRECTOR OF THE OFFICE OF PERSONNEL MANAGEMENT  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/strengthening-the-suitability-and-fitness-of-the-federal-workforce/"
  },
  {
    "text": "Trump weighs in on report King Charles will offer U.S. membership to British Commonwealth: ‘Sounds good!’  —  Trump indicates willingness to have America become 57th Commonwealth member … Your support helps us to tell the story  —  From reproductive rights to climate change to Big Tech … ",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-commonwealth-offer-us-member-b2719470.html"
  },
  {
    "text": "Elon Musk threatens Pentagon leakers after NYT report on secret China war briefing  —  “They will be found,” warns U.S. President Donald Trump's billionaire adviser as White House lashes out at the media.  —  Donald Trump's top adviser Elon Musk has openly threatened Pentagon employees … ",
    "url": "https://www.politico.eu/article/elon-musk-threatens-pentagon-leakers-new-york-times-briefing-china-war/"
  },
  {
    "text": "Trump administration cuts legal help for migrant children traveling alone  —  The Trump administration Friday ended a contract that provides legal help to migrant children entering the country without a parent or guardian, raising concerns that children will be forced to navigate the complex legal system alone.",
    "url": "https://apnews.com/article/trump-legal-aid-unaccompanied-children-immigration-court-127a69ce69573d2d16c72a74dacef3ab"
  },
  {
    "text": "“I don't regret the vote”: Why most Trump voters stand by him, even as he ruins their lives  —  It's not totally hopeless: Some swing voters who backed Trump may learn their lesson  —  Losing your wife to own the liberals: Sounds like a parody of a Donald Trump voter, but it's turning … ",
    "url": "https://www.salon.com/2025/03/21/i-dont-regret-the-vote-why-most-stand-by-him-even-as-he-ruins-their-lives/"
  },
  {
    "text": "Musk group offers $100 to Wisconsin voters ahead of pivotal state Supreme Court election  —  A group funded by billionaire Elon Musk is offering Wisconsin voters $100 to sign a petition in opposition to “activist judges,” a move that comes two weeks before the state's Supreme Court election … ",
    "url": "https://apnews.com/article/wisconsin-supreme-court-musk-trump-b9be6119d500bdacc9c6341be013cd62"
  },
  {
    "text": "Tornado Cash Delisting  —  WASHINGTON — Based on the Administration's review of the novel legal and policy issues raised by use of financial sanctions against financial and commercial activity occurring within evolving technology and legal environments, we have exercised our discretion … ",
    "url": "https://home.treasury.gov/news/press-releases/sb0057"
  },
  {
    "text": "Finland, Denmark Issue Travel Warnings For US  —  Denmark and Finland have revised their travel guidance for transgender individuals planning to visit the United States.  —  Newsweek has contacted the ministry for comment via email.  —  Why It Matters  —  The move follows similar guidance updates … ",
    "url": "https://www.newsweek.com/denmark-issues-travel-warning-us-2048508"
  },
  {
    "text": "Trump says student loans moving to SBA, ‘special needs’ to HHS  —  President Trump said Friday he is “immediately” moving the handling of federal student loans to the Small Business Administration (SBA), and shifting programs for students with disabilities to the Department of Health and Human Services … ",
    "url": "https://thehill.com/homenews/education/5207597-trump-student-loans-sba-special-needs-disabled-students-hhs-mcmahon-kennedy/"
  }
]