[
  {
    "text": "Trump's campaign is trying to hide his sad state from voters  —  His decline is undeniable.  They're hoping you don't notice in time. … MAGA-friendly CNBC host Joe Kernen dropped an interesting nugget right as Squawk Box went to commercial break on Tuesday.  —  “Well, Trump canceled, and he was going to come on,” Kernen said.",
    "url": "https://www.publicnotice.co/p/trump-cancels-cnbc-cnn-debate"
  },
  {
    "text": "‘Off the charts:’ How Trump tariffs would shock U.S., world economies  —  If implemented, the former president's tariff plans would lead to higher costs, stock market volatility and feuds with the rest of the world.  —  Former president Donald Trump is campaigning on the most significant increase … ",
    "url": "https://www.washingtonpost.com/business/2024/10/16/trump-tariffs-impact-economy/"
  },
  {
    "text": "Trump Crumbles When Pressed on Economic Policy in Tense Interview  —  The former president attempted to “weave” his way through an interview with Bloomberg News, but couldn't escape his own policy black hole  —  Donald Trump continued his pre-election economic event tour on Tuesday … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-crumbles-pressed-economic-policy-bloomberg-interview-1235134459/"
  },
  {
    "text": "Michelle Obama to headline get-out-the-vote rally in Georgia  —  Michelle Obama is headlining a get-out-the-vote rally in Georgia just days ahead of the presidential election.  —  The former first lady and founder of When We All Vote, a voter engagement and mobilization initiative … ",
    "url": "https://thehill.com/homenews/campaign/4936061-michelle-obama-georgia-voter-rally/"
  },
  {
    "text": "Record number of early votes cast in Georgia as election gets underway in battleground state  —  A record number of early votes have been cast in Georgia on Tuesday as residents headed to the polls in a critical battleground state that is grappling with the fallout from Hurricane Helene … ",
    "url": "https://www.cnn.com/2024/10/15/politics/early-voting-record-georgia/"
  },
  {
    "text": "Republicans Tell Trump That Elon Musk's Super PAC Is Blowing It  —  Donald Trump's allies have been warning him that Musk's field operation is failing in key states — and that it's being led by DeSantis' failed team  —  Donald Trump has largely outsourced his 2024 campaign's … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-elon-musk-republicans-super-pac-election-2024-1235134877/"
  },
  {
    "text": "Elon Musk and other billionaires invest staggering sums into electing Trump, plus other takeaways from third-quarter filings  —  Some of the world's wealthiest figures - led by conservative donor Miriam Adelson and tech billionaire Elon Musk - have funneled tens of millions of dollars … ",
    "url": "https://www.cnn.com/2024/10/16/politics/fundraising-takeaways-elon-musk-billionaires-trump/"
  },
  {
    "text": "Judge Blocks Hand-Counting of Election Ballots in Georgia  —  The ruling was confined to the current election, halting the measure from going into effect for 2024 while the judge further weighs its merits in the future.  —  A county judge in Georgia on Tuesday blocked a new rule mandating … ",
    "url": "https://www.nytimes.com/2024/10/15/us/elections/georgia-ballot-hand-count-ruling.html?unlocked_article_code=1.Sk4.22em.6WVg88W-IdP7&smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb"
  },
  {
    "text": "The U.S. Presidential Contest, October 16, 2024  —  Marist National Poll  —  Harris +5 Points Against Trump Nationally  —  In the presidential contest, Vice President Kamala Harris leads former President Donald Trump by five points among likely voters, including those who are undecided yet leaning toward a candidate.",
    "url": "https://maristpoll.marist.edu/polls/the-u-s-presidential-contest-october-16-2024/"
  },
  {
    "text": "The Delusions of the Donald  —  We'll see you tomorrow, Philadelphia!  Happy Wednesday.  —  Uh, What Was That?  —  by Andrew Egger  —  Back in January, the great McKay Coppins wrote a piece for the Atlantic titled “You Should Go to a Trump Rally.”  The idea was that secondhand media accounts … ",
    "url": "https://www.thebulwark.com/p/the-delusions-of-the-donald"
  },
  {
    "text": "A TV station stopped playing pro-abortion rights ads after state's threats, lawsuit says, … Gabrielle Russon  —  Gabrielle Russon is an award-winning journalist based in Orlando.  She covered the business of theme parks for the Orlando Sentinel.  Her previous newspaper stops include … ",
    "url": "https://floridapolitics.com/archives/701815-a-tv-station-stopped-playing-pro-abortion-rights-ads-after-states-threats-lawsuit-says/"
  },
  {
    "text": "‘Pennsylvania is such a mess’: Inside Team Harris' unusual levels of finger-pointing  —  Many of the state's most well-connected Democrats have been worried about the operation for months.  —  PHILADELPHIA — Top Democrats in Pennsylvania are worried Vice President Kamala Harris' operation … ",
    "url": "https://www.politico.com/news/2024/10/16/kamala-harris-pennsylvania-campaign-drama-00183844"
  },
  {
    "text": "Revealed: International ‘race science’ network secretly funded by US tech boss  —  Group promoting ‘dangerous’ scientific racism ideology teamed up with rightwing extremist, recordings reveal  —  An international network of “race science” activists seeking to influence public debate … ",
    "url": "https://www.theguardian.com/world/2024/oct/16/revealed-international-race-science-network-secretly-funded-by-us-tech-boss"
  },
  {
    "text": "USPS accused of retaliation and harassment after employee raised racism allegations  —  Exclusive: Carla Vinson, who worked for the USPS for 26 years, says she endured ‘intimidation and bullying’ after reporting two white co-workers who allegedly used racial slurs",
    "url": "https://www.theguardian.com/business/2024/oct/16/usps-employee-racism-retaliation-harrassment"
  },
  {
    "text": "Trump Escalates Threats to Political Opponents He Deems the ‘Enemy’  —  Never before has a presidential nominee openly suggested turning the military on Americans simply because they oppose his candidacy.  With voting underway, Donald Trump has turned to dark vows of retribution.",
    "url": "https://www.nytimes.com/2024/10/15/us/politics/trump-opponents-enemy-within.html"
  },
  {
    "text": "Ted Cruz Refuses to Say If He Supports Abortion Exceptions: ‘Why Do You Keep Asking?’  —  The Texas senator was given three chances to clarify his views on whether abortion bans should include any exceptions.  He did not answer  —  DURING A DEBATE against Rep. Colin Allred on Tuesday night … ",
    "url": "https://www.rollingstone.com/politics/politics-news/ted-cruz-colin-allred-debate-abortion-exceptions-1235134866/"
  },
  {
    "text": "Former GOP Rep. Liz Cheney endorses Democrat Susan Wild … - The endorsement was first reported by the Philadelphia Inquirer. … - “This election we must look beyond partisanship to ensure we defeat election deniers and support people like Susan, who are serious leaders, and will do what's right for their district and our nation.”",
    "url": "https://www.axios.com/2024/10/16/liz-cheney-endorses-house-democrat-susan-wild"
  },
  {
    "text": "Stealth Edit: FBI Quietly Revises Violent Crime Stats  —  When the FBI originally released the “final” crime data for 2022 in September 2023, it reported that the nation's violent crime rate fell by 2.1%.  This quickly became, and remains, a Democratic Party talking point to counter Donald Trump's claims of soaring crime.",
    "url": "https://www.realclearinvestigations.com/articles/2024/10/16/stealth_edit_fbi_quietly_revises_violent_crime_stats_1065396.html"
  },
  {
    "text": "Project 2025 ex-director condemns Heritage president's ‘violent rhetoric’  —  Paul Dans, who led the project until July, also called on JD Vance to withdraw his foreword for Heritage President Kevin Roberts's book.  —  The former director of the right-wing policy and personnel blueprint known … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/16/project-2025-heritage-violent-rhetoric/"
  },
  {
    "text": "What's behind the widening gender wage gap in the US?  —  Just how much of a setback was the COVID-19 pandemic for U.S. working women?  Although women who lost or left their jobs at the height of the crisis have largely returned to the workforce, a recent finding points to the price many paid … ",
    "url": "https://apnews.com/article/gender-wage-gap-women-pay-latina-work-dce2d7cf2c004dfe5322fffaf5fdbbcf"
  }
]