[
  {
    "text": "MAYOR RAS J. BARAKA'S STATEMENT ON ICE RAID ON NEWARK BUSINESS ESTABLISHMENT  —  “Today, U.S. Immigration and Customs Enforcement (ICE) agents raided a local establishment in the City of Newark, detaining undocumented residents as well as citizens, without producing a warrant.",
    "url": "https://www.newarknj.gov/news/mayor-ras-j-barakas-statement-on-ice-raid-on-newark-business-establishment"
  },
  {
    "text": "Trump Officials Move to Quickly Expel Migrants Biden Allowed In Temporarily  —  A memo appears to allow Immigration and Customs Enforcement officers to target programs that let in more than a million people.  —  The Trump administration is giving Immigration and Customs Enforcement officers … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-immigrants-deportation.html?unlocked_article_code=1.rk4.jkfQ.TGWT4A93zYdo&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Hegseth told senator he paid $50,000 to woman who accused him of 2017 sex assault  —  Pete Hegseth, President Donald Trump's nominee for defense secretary, paid $50,000 to the woman who accused him of sexual assault in 2017, according to answers he provided to a senator during his confirmation process … ",
    "url": "https://apnews.com/article/hegseth-sex-assault-payment-trump-6674cc8cfee654c374725948e01ff666"
  },
  {
    "text": "Johnson aide discouraged Hutchinson subpoena over concerns about lawmakers' ‘sexual texts’  —  The move was intended in part to prevent the release of sexually explicit texts that lawmakers sent Cassidy Hutchinson.",
    "url": "https://www.washingtonpost.com/politics/2025/01/23/cassidy-hutchinson-lawmakers-texts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NjA4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4OTkwNzk5LCJpYXQiOjE3Mzc2MDg0MDAsImp0aSI6Ijc0NWQyMGVmLTIwNDEtNDEyNi1iYjNkLTJkNjM5NmU2ZjMwMCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzIzL2Nhc3NpZHktaHV0Y2hpbnNvbi1sYXdtYWtlcnMtdGV4dHMvIn0.7Ls-g5QQAxsT3ZwpfrOAlVcnD6OWWF6dR_ihLvpdR94&itid=gfta"
  },
  {
    "text": "Trump staff ‘furious’ after Musk trashes AI project  —  “It's clear he has abused the proximity to the president,” said one ally of the president.  —  Some of President Donald Trump's key aides and allies are furious with Elon Musk for publicly trashing his $500 billion artificial intelligence mega-deal.",
    "url": "https://www.politico.com/news/2025/01/23/trump-staff-musk-conflict-00200311"
  },
  {
    "text": "Tennessee Republican proposes amendment to allow Trump to serve third term  —  Rep. Andy Ogles (R-Tenn.) proposed an amendment to the U.S. Constitution that would allow President Trump to serve a third term in the White House so that the country “can sustain the bold leadership our nation so desperately needs.”",
    "url": "https://thehill.com/homenews/house/5104133-rep-andy-ogles-proposes-trump-third-term-amendment/"
  },
  {
    "text": "Rep. Ogles Proposes Amending the 22nd Amendment to Allow Trump to Serve a Third Term  —  WASHINGTON, DC - Congressman Andy Ogles introduced a House Joint Resolution to amend the Constitution of the United States to allow a President to be elected for up to but no more than three terms.",
    "url": "https://ogles.house.gov/media/press-releases/rep-ogles-proposes-amending-22nd-amendment-allow-trump-serve-third-term"
  },
  {
    "text": "The AP establishes style guidance on the Gulf of Mexico and Mount McKinley  —  President Donald Trump signed an executive order Monday shortly after his inauguration calling for the Gulf of Mexico to be renamed the Gulf of America, and Denali, the tallest peak in the United States, to revert to the name Mount McKinley.",
    "url": "https://apnews.com/article/ap-style-gulf-mexico-mount-mckinley-denali-13bd46d636cef6f2608bd5d2c3d907ee"
  },
  {
    "text": "Republicans shoot down Democratic request to ditch party-line immigration push and write a bipartisan bill instead  —  Senate Republicans are making clear they will pursue a border package without Democratic input, despite the obstacles they face in going their own way.",
    "url": "https://www.nbcnews.com/politics/congress/republicans-shoot-democratic-request-bipartisan-immigration-bill-rcna189033"
  },
  {
    "text": "Costco shareholders overwhelmingly reject anti-DEI measure … - Costco grabbed headlines over the holidays when its board of directors put out a robust defense of its DEI efforts in response to the anti-DEI proposal.  — The board had voted unanimously to ask shareholders to reject the motion.",
    "url": "https://www.axios.com/2025/01/23/costco-dei-shareholders-reject-anti-diversity-proposal"
  },
  {
    "text": "From Fires to Mudslides, Catastrophe Has Defined Newsom's Tenure  —  Gov. Gavin Newsom faces what may be his greatest political test and leadership challenge.  He planned to greet President Trump upon his arrival in Southern California on Friday.  —  Gov. Gavin Newsom came into office … ",
    "url": "https://www.nytimes.com/2025/01/24/us/politics/gavin-newsom-california-fires-disasters.html"
  },
  {
    "text": "Hegseth's divorce agreement with his second wife includes a non-disparagement clause  —  Pete and Samantha Hegseth's 2018 divorce decree prohibits each of them from engaging in “any public discourse ... disparaging the other party.”  —  Defense secretary nominee Pete Hegseth testified during … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/pete-hegseth-divorce-confirmation-defense-department-rcna189059"
  },
  {
    "text": "Exclusive: U.S. whistleblower says Mastercard, Visa failed to stop payments for child sex abuse material on OnlyFans  —  Mastercard and Visa failed to stop their payment networks from laundering proceeds from child sexual abuse material and sex trafficking on the popular website OnlyFans … ",
    "url": "https://www.reuters.com/world/us/us-whistleblower-says-mastercard-visa-failed-stop-payments-child-sex-abuse-2025-01-24/"
  },
  {
    "text": "Trump's White House Press Secretary Reveals Her Failed Campaign Spent $200K in Illicit Contributions  —  On Thursday, Karoline Leavitt's failed congressional campaign amended every FEC filing it had ever made to reveal that she failed to disclose hundreds of thousands of dollars … ",
    "url": "https://www.notus.org/whitehouse/trump-white-house-press-secretary-200k-illicit-contributions"
  },
  {
    "text": "Declassification of Records Concerning the Assassinations  —  OF PRESIDENT JOHN F. KENNEDY, SENATOR ROBERT F. KENNEDY, AND THE REVEREND DR. MARTIN LUTHER KING, JR.  —  EXECUTIVE ORDER  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/01/declassification-of-records-concerning-the-assassinations-of-president-john-f-kenned/"
  },
  {
    "text": "Instagram and Facebook Blocked and Hid Abortion Pill Providers' Posts  —  Some posts related to obtaining abortion pills were recently hidden on Instagram and Facebook and some accounts were suspended, before being later restored.  —  Instagram and Facebook have recently blurred … ",
    "url": "https://www.nytimes.com/2025/01/23/technology/instagram-facebook-abortion-pill-providers.html"
  },
  {
    "text": "“Excluding Indians”: Trump admin questions Native Americans' birthright citizenship in court  —  The Trump admin is leaning on a pre-14th Amendment law in its fight to redefine birthright citizenship  —  In the Trump administration's arguments defending his order to suspend birthright citizenship … ",
    "url": "https://www.salon.com/2025/01/23/excluding-indians-admin-questions-native-americans-birthright-citizenship-in/"
  },
  {
    "text": "A federal judge temporarily blocks Trump's executive order redefining birthright citizenship  —  A federal judge on Thursday temporarily blocked President Donald Trump's executive order denying U.S. citizenship to the children of parents living in the country illegally, calling it … ",
    "url": "https://apnews.com/article/birthright-citizenship-donald-trump-lawsuit-immigration-9ac27b234c854a68a9b9f8c0d6cd8a1c"
  },
  {
    "text": "“A pact with the devil”  —  David de Jong on oligarchs getting in bed with fascists.  —  ∙ Paid  —  Donald Trump now has many of the country's richest and most powerful executives explicitly on his side.  That was evident this week as Elon Musk, Mark Zuckerberg, Jeff Bezos … ",
    "url": "https://www.publicnotice.co/p/david-de-jong-nazi-interview-trump-musk"
  },
  {
    "text": "Trump's rapid changes in U.S. government stuns, stirs anxiety among federal workers  —  U.S. President Donald Trump and his team have acted with stunning speed to begin removing or sidelining hundreds of government workers, while he has also sought to give himself the power to fire hundreds of thousands more.",
    "url": "https://www.reuters.com/world/us/trumps-rapid-changes-us-government-stuns-stirs-anxiety-among-federal-workers-2025-01-24/"
  },
  {
    "text": "Health researchers alarmed as Trump administration pauses travel, communications  —  The halt has frozen research grants, meetings and key health updates.  “Everything is basically in chaos,” said one cancer researcher.  —  No meetings of cancer researchers to discuss issuing new federal grants.",
    "url": "https://www.washingtonpost.com/health/2025/01/23/trump-administration-hhs-health-agencies-pause-travel-communications/"
  },
  {
    "text": "Trump Revokes Security Detail for Pompeo and Others Despite Threats From Iran  —  The officials had been part of an aggressive posture against Iran during President Trump's first term.  —  President Trump revoked security protection for his former secretary of state, Mike Pompeo … ",
    "url": "https://www.nytimes.com/2025/01/23/us/politics/trump-pompeo-security-iran.html?unlocked_article_code=1.rU4.6oMb.eKfhCujI5hAG&smid=url-share"
  }
]