[
  {
    "text": "Blaze fires contributor linked to alleged Russian operation  —  The Scoop  —  A conservative American media company has fired one of the YouTubers implicated in an alleged Russian influence operation exposed by the US Department of Justice this week.  —  “Lauren Chen was an independent contractor … ",
    "url": "https://www.semafor.com/article/09/05/2024/blaze-fires-contributor-linked-to-russian-operation"
  },
  {
    "text": "US charges former Trump 2016 campaign adviser Dimitri Simes over work for sanctioned Russian TV  —  WASHINGTON (AP) — The U.S. government has charged a Russian-born U.S. citizen and former adviser to Donald Trump's 2016 presidential campaign with working for a sanctioned Russian state television network and laundering the proceeds.",
    "url": "https://apnews.com/article/trump-simes-russia-election-fbi-f0b0fe681c821f735c4e951736f041c8"
  },
  {
    "text": "Stop letting right wing influencers cosplay as ‘independent’ media  —  We need to know who is funding the creator economy  —  Yesterday, a federal indictment revealed that a Tennessee media company working with right-wing influencers including Benny Johnson, Tim Pool, Dave Rubin … ",
    "url": "https://taylorlorenz.substack.com/p/we-need-to-know-who-is-funding-the"
  },
  {
    "text": "Trump deputy campaign manager identified in Arlington National Cemetery dustup  —  One of two staffers involved in the altercation at Arlington National Cemetery is a deputy campaign manager for Donald Trump's reelection bid, NPR has learned.  The former president insisted this week the incident … ",
    "url": "https://www.npr.org/2024/09/05/nx-s1-5101991/trump-campaign-arlington-national-cemetery-staff-debate"
  },
  {
    "text": "JD Vance says school shootings are a ‘fact of life,’ calls for better security  —  School shootings are a “fact of life,” so the U.S. needs to harden security to prevent more carnage like the shooting this week that left four dead in Georgia, Republican vice presidential nominee JD Vance said Thursday.",
    "url": "https://apnews.com/article/jd-vance-georgia-shooting-7d7727a1aff8491f66914a4d8a14cd8c"
  },
  {
    "text": "Vance calls for tightened school security after shooting: 'I don't like that this is a fact of life'  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters",
    "url": "https://thehill.com/homenews/campaign/4865074-jd-vance-georgia-school-shooting-security/"
  },
  {
    "text": "The father of the Georgia school shooting suspect has been arrested and charged, authorities say  —  The father of the Apalachee High School shooting suspect has been arrested in connection with the shooting that left four people dead, according to the Georgia Bureau of Investigation.",
    "url": "https://www.cnn.com/2024/09/05/us/winder-georgia-shooting-apalachee-high-school"
  },
  {
    "text": "Hunter Biden intends to change his plea in federal tax charges  —  The president's son was indicted in December on three felony and six misdemeanor counts alleging that he failed to pay his taxes over several years.  —  LOS ANGELES — Hunter Biden intends to change his plea … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/hunter-biden-intends-plead-guilty-federal-tax-charges-rcna169621"
  },
  {
    "text": "FBI raids homes of top aides to New York City Mayor Eric Adams  —  The two deputy mayors are the highest-ranking Adams administration officials yet to be ensnared in the federal probe into Adams' 2021 campaign.  —  NEW YORK — Federal authorities have raided the homes of two of New York City Mayor Eric Adams … ",
    "url": "https://www.politico.com/news/2024/09/05/fbi-new-york-city-mayor-eric-adams-00177536"
  },
  {
    "text": "Chutkan says 2024 election ‘not relevant’ in deciding Trump criminal case timeline  —  The judge declined to set a new trial date but appeared inclined to give prosecutors a chance to lay out damaging evidence against Trump in the next few weeks.  —  The imminent presidential election … ",
    "url": "https://www.politico.com/news/2024/09/05/trump-hearing-chutkan-timeline-00177538"
  },
  {
    "text": "Finally: Top Journo Erupts at Media for Ignoring Trump's Mental State  —  For many months, media critics and liberal Democrats have insisted that Donald Trump's mental unfitness for the presidency is—or should be treated as—a big and important news story in and of itself.",
    "url": "https://newrepublic.com/article/185622/finally-top-journo-erupts-media-ignoring-trumps-mental-state"
  },
  {
    "text": "Allan Lichtman's “Keys” Are BS  —  This one weird trick does not actually predict election results.  —  ∙ Paid  —  1. I Guess We're Doing This  —  The idiosyncratic mobile gaming company that publishes a dead-tree newspaper released a video this morning in which the 77-year-old Allan Lichtman runs … ",
    "url": "https://www.thebulwark.com/p/allan-lichtmans-keys-are-bs"
  },
  {
    "text": "Whoops: Report That Harris Team Regrets Not Picking Shapiro, As Nate Silver Has More Bad News for Them  —  As we reported, that honeymoon for Kamala Harris is looking like it might be over as the American people take a better look at her and her running mate, Tim Walz.",
    "url": "https://redstate.com/nick-arama/2024/09/05/whoops-sounds-like-harris-people-are-regretting-picking-walz-as-nate-silver-has-more-bad-news-for-them-n2178952"
  },
  {
    "text": "Rep. Byron Donalds didn't properly disclose up to $1.6 million in stock trades, violating federal law  — Rep. Byron Donalds failed to properly disclose two years' worth of his and his wife's stock trades.  — It was up to $1.6 million, including stock in companies he oversees on a House committee.",
    "url": "https://www.businessinsider.com/byron-donalds-stock-trades-insider-trading-ethics-complaint-2024-9"
  },
  {
    "text": "Harris raised over $300 million in August, extending cash windfall  —  Money has been pouring into the Democratic presidential campaign since President Joe Biden stepped aside from the 2024 election in July.  —  Vice President Kamala Harris' political operation raised more than $300 million … ",
    "url": "https://www.nbcnews.com/politics/2024-election/kamala-harris-raised-300-million-august-extending-cash-windfall-rcna169759"
  },
  {
    "text": "How Trump uses the ‘Gish Gallop’ to flood debates with lies and nonsense  —  Kamala Harris.  Donald Trump.  Gish Gallop.  —  All three are expected at Tuesday's presidential debate, even if most of America is unfamiliar with one name in that lineup.  —  GG, as I've now come to call it … ",
    "url": "https://www.latimes.com/politics/story/2024-09-05/gish-gallop-and-the-harris-trump-debate"
  },
  {
    "text": "Alaska judge strikes down law saying only doctors can provide abortions  —  A state judge in Alaska struck down a law prohibiting anyone other than a licensed physician from performing abortions.  —  Superior Court Judge Josie Garton ruled Wednesday the law imposed a substantial burden … ",
    "url": "https://thehill.com/policy/healthcare/4864049-alaska-judge-strikes-down-law-saying-only-doctors-can-provide-abortions/"
  },
  {
    "text": "Donald Trump Rambles Incoherently When Asked About Reducing Child Care Costs  —  Without explaining his child care policy, Trump suggested revenue from tariffs would more than cover its cost.  —  LOADING  —  Donald Trump on Thursday got a question about what he would do as president to make child care more affordable and accessible.",
    "url": "https://www.huffpost.com/entry/trump-child-care-answer-tariffs_n_66da026ce4b06ce2f28f5c9d"
  },
  {
    "text": "White House condemns Tucker Carlson's ‘Nazi propaganda’ interview as ‘disgusting and sadistic insult’  —  New York CNN  —  The Biden administration is denouncing Tucker Carlson after the far-right personality hosted a guest on his show this week who suggested the Holocaust happened by accident … ",
    "url": "https://www.cnn.com/2024/09/05/media/white-house-condemns-tucker-carlson-nazi-propaganda-interview/"
  },
  {
    "text": "Birds of a Feather: Audubon Joins Elon Musk in Challenging Constitutionality of Labor Law After Violating Workers' Rights  —  NEW YORK - The National Audubon Society took the extreme legal position that federal laws meant to protect American workers are unconstitutional.",
    "url": "https://cwa-union.org/news/releases/birds-feather-audubon-joins-elon-musk-challenging-constitutionality-labor-law-after"
  },
  {
    "text": "Steve Silberman, journalist who explored autism's history, dies at 66  —  He wrote about the developmental condition in “NeuroTribes,” a 2015 bestseller that promoted understanding and acceptance of people who think differently.  —  Steve Silberman, a journalist and author who helped shift … ",
    "url": "https://www.washingtonpost.com/obituaries/2024/09/04/steve-silberman-dead-neurotribes/"
  },
  {
    "text": "Physician sentenced to 9 months in prison for punching police officer during Capitol riot  —  A Massachusetts medical doctor who punched a police officer during a mob's attack on the U.S. Capitol was sentenced Thursday to nine months of imprisonment followed by nine months of home confinement.",
    "url": "https://apnews.com/article/jacquelyn-starer-doctor-massachusetts-capitol-riot-76190db8a354c339776f3e1c8169306a"
  },
  {
    "text": "Trump to attend oral arguments Friday in E. Jean Carroll judgment appeal: Sources  —  Oral arguments are set to begin in his appeal of the E. Jean Carroll verdict.  —  Republican presidential nominee, former President Donald Trump speaks during a campaign rally at Desert Diamond Arena, on Aug. 23, 2024, in Glendale, Arizona.",
    "url": "https://abcnews.go.com/Politics/trump-attend-oral-arguments-friday-jean-carroll-judgment/story?id=113442469"
  },
  {
    "text": "Texas Republican says GOP will cost itself the House majority in November  —  AUSTIN, Texas — A Texas Republican who survived a primary assault from his own party's right wing said Thursday that the GOP is on track to lose the House in November.  —  “What's frustrating me is I firmly believe … ",
    "url": "https://thehill.com/homenews/house/4864014-tony-gonzales-republican-house-loss/"
  }
]