[
  {
    "text": "Exclusive: Suspect in Coachella Valley Trump assassination attempt denies accusation, supports ex-president  —  Suspect a registered Republican from Las Vegas and member of a right-leaning anti-government group, sheriff says  —  A third assassination attempt against former President Donald Trump … ",
    "url": "https://www.pressenterprise.com/2024/10/13/las-vegas-man-found-with-loaded-firearm-high-capacity-magazine-near-trump-rally-in-coachella-valley/"
  },
  {
    "text": "Weapons Violation Arrest  —  Reporting Supervisor: Sergeant Ben Medina  —  File # C242860022  —  Details:  —  at 4:59 p.m., deputies assigned to former President Donald Trump's rally in the Coachella Valley contacted the driver of a black SUV at a checkpoint at the intersection of Avenue 52 and Celebration Drive.",
    "url": "https://www.riversidesheriff.org/CivicAlerts.aspx?AID=5898"
  },
  {
    "text": "Armed man arrested outside Trump's Coachella rally — and sheriff says it was possible third assassination attempt  —  Local cops arrested an armed man outside Donald Trump's Coachella Valley rally on Saturday, and the local sheriff said it may have been a third assassination attempt against the former president.",
    "url": "https://nypost.com/2024/10/13/us-news/third-trump-assassination-attempt-thwarted-when-armed-man-arrested-outside-coachella-rally-sheriff-says/"
  },
  {
    "text": "Man arrested near Donald Trump's California rally with loaded guns, police say  —  The suspect, identified as Las Vegas resident Vem Miller was, apprehended by authorities about half-mile from entrance to Coachella rally  —  A man armed with guns and false press and VIP passes was apprehended … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/13/las-vegas-man-arrested-trump-assassination-attempt-coachella-california"
  },
  {
    "text": "Kamala Harris' New Economic Agenda Reveals What She Would Do To Help Black Men  —  This is the vice president's latest attempt to engage a voting bloc that Donald Trump and his campaign have also attempted to court this election season.  —  LOADING  —  Vice President Kamala Harris … ",
    "url": "https://www.huffpost.com/entry/kamala-harris-black-voters-economic-agenda_n_670c6fd3e4b04266ae857c44"
  },
  {
    "text": "Harris Suggests Trump Is ‘Weak and Unstable’ in Pointed Challenge  —  Kamala Harris asked why Donald J. Trump had not released his medical records, appeared on “60 Minutes” or agreed to a second debate.  —  Vice President Kamala Harris challenged former President Donald J. Trump on Sunday … ",
    "url": "https://www.nytimes.com/2024/10/13/us/politics/harris-trump-weak-and-unstable.html"
  },
  {
    "text": "Trump goes to war against real-time fact checks  —  The moves are the latest example of Trump's long-held resistance to being called to account for his falsehoods  —  Donald Trump and his campaign have waged an aggressive campaign against fact-checking in recent months, pushing TV networks … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/14/trump-fact-checks-interviews-debates/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4ODc4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwMjYwNzk5LCJpYXQiOjE3Mjg4Nzg0MDAsImp0aSI6ImI2YWVjMjVmLTg5ZjAtNGUxZC1hNzZkLTUzYTA3NTE4MDExYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzE0L3RydW1wLWZhY3QtY2hlY2tzLWludGVydmlld3MtZGViYXRlcy8ifQ.XqIMcy51gjAE5KI8FSFomDkajk73pwJMikZtVVX7EdI&itid=gfta"
  },
  {
    "text": "Trump pledges raises and 10,000 more agents in border plan … - Trump said at the Prescott Valley, Ariz., rally he “will be asking Congress immediately to approve a 10% raise” for all agents if he wins the election.  — “Haven't had one in a long time,” he said as announced the retention … ",
    "url": "https://www.axios.com/2024/10/14/trump-border-agents-hire-immigration-plan-harris"
  },
  {
    "text": "‘Vile stuff’: NYT shamed by its own former public editor for whitewashing Trump racism  —  Former New York Times public editor Margaret Sullivan this week shamed her one-time employer for its coverage of the 2024 presidential election.  —  Writing on her Substack page … ",
    "url": "https://www.rawstory.com/trump-racism-2669387273/"
  },
  {
    "text": "About those New York Times headlines  —  Twitter, which is what I prefer to call Elon Musk's disaster, is still interesting and useful at times, despite its decay.  —  And the other day, there was a dustup there over two New York Times headlines.  One was about Kamala Harris, the other about Donald Trump.",
    "url": "https://margaretsullivan.substack.com/p/about-those-new-york-times-headlines"
  },
  {
    "text": "Cheney doubts Johnson will carry out ‘constitutional obligations’ to certify election  —  Former Rep. Liz Cheney (R-Wyo.) said in a Sunday interview that she doubts House Speaker Mike Johnson (R-La.) will carry out “his constitutional obligations” to certify the 2024 election.",
    "url": "https://thehill.com/homenews/campaign/4931211-cheney-johnson-certify-2024-election/"
  },
  {
    "text": "US to send anti-missile system and troops to Israel, Pentagon says  —  The United States said on Sunday it will send U.S. troops to Israel along with an advanced U.S. anti-missile system, in a highly unusual deployment meant to bolster the country's air defenses following missile attacks by Iran.",
    "url": "https://www.reuters.com/world/us-send-anti-missile-system-israel-says-pentagon-2024-10-13/"
  },
  {
    "text": "Hurricane recovery officials in N.C. relocated amid report of ‘armed militia,’ email shows  —  Safety fears are growing as misinformation collides with a large-scale federal recovery effort.  —  LAKE LURE, N.C. — Federal emergency response personnel on Saturday had employees operating … ",
    "url": "https://www.washingtonpost.com/weather/2024/10/13/federal-officials-nc-temporarily-relocated-amid-report-armed-militia-email-shows/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI4NzkyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwMTc0Mzk5LCJpYXQiOjE3Mjg3OTIwMDAsImp0aSI6ImVhZWZhZDUyLWFhY2EtNDc3Zi1iZDRlLWZkMzM1NmVjOTBjMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93ZWF0aGVyLzIwMjQvMTAvMTMvZmVkZXJhbC1vZmZpY2lhbHMtbmMtdGVtcG9yYXJpbHktcmVsb2NhdGVkLWFtaWQtcmVwb3J0LWFybWVkLW1pbGl0aWEtZW1haWwtc2hvd3MvIn0.BaGrTy9ZRxMPH9cxITvM1C18f2v862tZKRIZxsmtuSc&itid=gfta"
  },
  {
    "text": "Josh Hawley's Local Newspaper Declares Him the ‘Worst Sitting Senator’  —  NO CONFIDENCE  —  The St. Louis Post-Dispatch objected to Hawley's actions leading up to the Jan. 6 Capitol riots.  —  A local newspaper in Missouri wrote a scathing rebuke of the state's Sen. Josh Hawley … ",
    "url": "https://www.thedailybeast.com/st-louis-post-dispatch-names-josh-hawley-the-worst-sitting-senator"
  },
  {
    "text": "Internal polling memo has warning signs for Senate Republicans  —  Some races are tightening but other key pickup opportunities are moving in the wrong direction, according to a new round of polling from the Senate Leadership Fund.  —  The top GOP super PAC charged with flipping the Senate … ",
    "url": "https://www.politico.com/news/2024/10/13/senate-republican-poll-memo-00183570"
  },
  {
    "text": "Attacks on Gay Rights Push Russia's LGBTQ Community Into the Shadows  —  Vladimir Putin has weaponized antigay views to tighten his grip on power as he pursues his war in Ukraine  —  A decade ago, Russian publisher Leo Veles says, he could hang out in gay bars and clubs in Moscow and St. Petersburg.",
    "url": "https://www.wsj.com/world/russia/attacks-on-gay-rights-push-russias-lgbtq-community-into-the-shadows-3b5e417e?st=GWMLfG&reflink=article_copyURL_share"
  },
  {
    "text": "X blocked hacked JD Vance dossier links after the Trump campaign flagged it … The Presidential campaign of Donald Trump asked X to stop links to a story containing VP nominee JD Vance's hacked dossier from circulating before X chose to block them, reports The New York Times.",
    "url": "https://www.theverge.com/2024/10/13/24269234/x-blocked-jd-vance-dossier-after-trump-campaign-request"
  },
  {
    "text": "Trump Leaves Door Open to National Abortion Ban  —  'WE'LL SEE'  —  The Republican presidential candidate also praised his appointed justices who overturned Roe v Wade.  —  Donald Trump told Fox News' Maria Bartiromo that a national abortion ban would be “off the table” if he were elected president … ",
    "url": "https://www.thedailybeast.com/trump-leaves-door-open-to-national-abortion-ban"
  }
]