[
  {
    "text": "The Supreme Court's “Unanimous” Trump Ballot Ruling Is Actually a 5-4 Disaster  —  On Monday, the Supreme Court unanimously reversed a Colorado Supreme Court decision removing Donald Trump from the ballot because of his engagement in an insurrection on Jan. 6.",
    "url": "https://slate.com/news-and-politics/2024/03/supreme-court-trump-colorado-ballot-disaster.html"
  },
  {
    "text": "Lost Track of Trump's Weekend Verbal Gaffes?  Here's a Full List.  —  Donald Trump does not seem OK.  The GOP front-runner was alarmingly loose-lipped during back-to-back campaign rallies in Richmond, Virginia, and Greensboro, North Carolina, on Saturday, during which he admitted … ",
    "url": "https://newrepublic.com/post/179521/donald-trump-weekend-verbal-gaffes"
  },
  {
    "text": "Despite win, Supreme Court strikes blow to Trump's central campaign theme  —  He claims the legal system is corrupt, conflicted and rigged against him.  —  Former President Donald Trump arrives at a campaign rally in Richmond, VA, Mar. 2, 2024.  —  The U.S. Supreme Court's ruling Monday knocking … ",
    "url": "https://abcnews.go.com/Politics/despite-win-supreme-court-strikes-blow-trumps-central/story?id=107779801"
  },
  {
    "text": "Federal appeals panel skeptical of ObamaCare's preventative care authority  —  A federal appeals panel appeared skeptical Monday of the constitutionality of an Affordable Care Act (ACA) provision requiring insurers to cover specific preventive services.  —  Judges on the U.S. Court of Appeals … ",
    "url": "https://thehill.com/policy/healthcare/4507703-obamacares-preventative-care-authority-affordable-care-act/"
  },
  {
    "text": "Supreme Court unanimously allows Trump to remain on 2024 ballot, finds states ‘have no power’ to enforce insurrection clause — ‘especially’ as to the presidency  —  The U.S. Supreme Court on Monday ruled in a per curiam opinion that Donald Trump will remain on the presidential primary ballot in Colorado … ",
    "url": "https://lawandcrime.com/supreme-court/supreme-court-unanimously-allows-trump-to-remain-on-2024-ballot-finds-states-have-no-power-to-enforce-insurrection-clause-especially-as-to-the-presidency/"
  },
  {
    "text": "Donald Trump's String of Gaffes Over Weekend Raises Eyebrows  —  Donald Trump has been criticized for making a string of gaffes during two weekend campaign speeches.  —  The Republican presidential candidate addressed crowds on Saturday in Richmond, Virginia, and Greensboro, North Carolina … ",
    "url": "https://www.newsweek.com/donald-trump-campaign-speech-gaffes-errors-mistakes-virginia-north-carolina-1875462"
  },
  {
    "text": "It's Past Time to Quit Hoping the Courts Are Going to Stop Trump  —  The latest decisions out of the Supreme Court, first on when to hear former President Donald Trump's immunity appeal, then on how to deal with his Colorado ballot disqualification, have made one thing very clear … ",
    "url": "https://slate.com/news-and-politics/2024/03/supreme-court-trump-presidency-colorado-immunity-ouch.html"
  },
  {
    "text": "Supreme Court hands Trump victory in Colorado 14th Amendment ballot challenge  —  The Supreme Court unanimously ruled Colorado cannot disqualify former President Trump from the ballot under the 14th Amendment's insurrection ban, a historic decision that preserves Trump's ability to seek a second presidential term.",
    "url": "https://thehill.com/regulation/court-battles/4506318-supreme-court-trump-colorado-14th-amendment-ballot-challenge/"
  },
  {
    "text": "The Supreme Court's Gift To Donald Trump  —  Mehdi's Monday Memo  —  9-0.  —  That was the unanimous decision of the United States Supreme Court on Monday 4th March morning, reversing an earlier earth-shaking Colorado Supreme Court ruling that had disqualified Donald Trump from appearing on the ballot in the Centennial State.",
    "url": "https://www.zeteonews.com/p/the-supreme-courts-gift-to-donald"
  },
  {
    "text": "Supreme Court temporarily blocks new Texas immigration enforcement law  —  Justice Samuel Alito issued an order that puts the law on hold while the justices determine what next steps to take.  —  WASHINGTON — The Supreme Court on Monday temporarily blocked a new Texas immigration law in response to a Biden administration request.",
    "url": "https://www.nbcnews.com/politics/supreme-court/biden-administration-asks-supreme-court-block-texas-immigration-law-rcna141761"
  },
  {
    "text": "Air Force Employee Indicted for Unlawful Disclosure of Classified National Defense Information  —  For Immediate Release  —  A civilian employee of the U.S. Air Force assigned to the U.S. Strategic Command (USSTRATCOM), at Offutt Air Force Base, was arrested Saturday, March 2 … ",
    "url": "https://www.justice.gov/opa/pr/air-force-employee-indicted-unlawful-disclosure-classified-national-defense-information"
  },
  {
    "text": "How many delegates are at stake on Super Tuesday?  —  There are 865 Republican delegates up for grabs in 15 states that vote on Super Tuesday on March 5.  That represents more than one-third of the 2,429 total delegates in the nomination contest that began in mid-January and concludes with the Republican National Convention in July.",
    "url": "https://www.washingtonpost.com/politics/2024/03/04/super-tuesday-delegate-count/"
  },
  {
    "text": "Wisconsin fake elector settlement offers new details on the strategy by Trump lawyers  —  Two attorneys for then-President Donald Trump orchestrated a plan for fake electors to file paperwork falsely saying the Republican won Wisconsin in a strategy to overturn Joe Biden's 2020 victory … ",
    "url": "https://apnews.com/article/electors-trump-settlement-ballot-2020-wisconsin-f416cd04adfa9f92c382b7c9e8a94ce7"
  },
  {
    "text": "Mark Cuban Backs Biden in 2024, Urging More Action on Drug Costs  — Co-founder of Cost Plus Drugs joins White House roundtable  — Cuban backed Haley in primary but supports Biden in general",
    "url": "https://www.bloomberg.com/news/articles/2024-03-04/mark-cuban-backs-biden-over-trump-in-2024-calls-for-drug-cost-reform"
  },
  {
    "text": "FBI hunts for suspected Iranian assassin targeting Trump-era officials  —  The Scoop  —  The U.S. government is intensifying a manhunt for an Iranian intelligence operative who the Federal Bureau of Investigation believes has been plotting to assassinate current and former American officials … ",
    "url": "https://www.semafor.com/article/03/04/2024/fbi-hunts-for-suspected-iranian-assassin-targeting-trump-era-officials"
  },
  {
    "text": "Commission fines Apple over €1.8 billion over abusive App store rules for music streaming providers  —  The European Commission has fined Apple over €1.8 billion for abusing its dominant position on the market for the distribution of music streaming apps to iPhone and iPad users ('iOS users') through its App Store.",
    "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_24_1161"
  },
  {
    "text": "US Supreme Court seeks security funding to protect justices, homes  —  The U.S. Supreme Court is seeking $19.4 million in federal funds to bolster security for the nine justices and assign protection of their homes to its own police force rather than the U.S. Marshals Service, citing “evolving” … ",
    "url": "https://www.reuters.com/world/us/us-supreme-court-seeks-security-funding-protect-justices-homes-2024-03-04/"
  },
  {
    "text": "France becomes first country to explicitly enshrine abortion rights in constitution  —  PARIS — With the endorsement of a specially convened session of lawmakers at Versailles, France on Monday became the first country in the world to explicitly enshrine abortion rights in its constitution … ",
    "url": "https://www.washingtonpost.com/world/2024/03/04/france-abortion-constitution/"
  },
  {
    "text": "Sinead O'Connor's estate asks Donald Trump to stop playing her music at rallies  —  The estate of Sinead O'Connor has asked Donald Trump not to play her music at campaign rallies.  It says the late singer considered the former president a “biblical devil.”  —  The latest shake … ",
    "url": "https://apnews.com/article/sinead-oconnor-music-donald-trump-campaign-4e3d65969d2d01895accb4e02165a5ad"
  },
  {
    "text": "Rita Moreno on Trump: ‘I am not about to vote for someone who has 91 indictments’  —  Hollywood legend Rita Moreno, who turned 92 in December, sharply criticized the rhetoric comparing former President Trump's 91 criminal charges to President Biden's age of 81.",
    "url": "https://thehill.com/blogs/in-the-know/4507950-rita-moreno-trump-indictments/"
  }
]