[
  {
    "text": "How Far Trump Would Go  —  The former President, at Mar-a-Lago on April 12, is rallying the right at home and seeking common cause with autocratic leaders abroad.Photograph by Philip Montgomery for TIME  —  Donald Trump thinks he's identified a crucial mistake of his first term: He was too nice.",
    "url": "https://time.com/6972021/donald-trump-2024-election-interview/"
  },
  {
    "text": "Read the Full Transcripts of Donald Trump's Interviews With TIME … Over the course of the interviews, Trump discussed his agenda for a second term, which includes deporting millions of people, cutting the U.S. civil service, and intervening more directly in Justice Department prosecutions than his predecessors.",
    "url": "https://time.com/6972022/donald-trump-transcript-2024-election/"
  },
  {
    "text": "Democrats win a New York special election, further narrowing the House GOP's majority  —  Democratic state Sen. Tim Kennedy won a special election in the deep blue 26th District in western New York to serve the rest of Brian Higgins' term.  —  Democrats won a special election for a House seat … ",
    "url": "https://www.nbcnews.com/politics/2024-election/new-york-special-election-win-house-26-district-rcna149581"
  },
  {
    "text": "Democrat Tim Kennedy wins New York special election for House seat  —  Once he is sworn in to represent the state's 26th Congressional District, the Republican majority in the chamber will temporarily fall to just one vote.  —  State Sen. Tim Kennedy (D) is projected to win the special election … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/30/new-york-special-election-house-kennedy/"
  },
  {
    "text": "US drug control agency will move to reclassify marijuana in a historic shift, AP sources say  —  The U.S. Drug Enforcement Administration will move to reclassify marijuana as a less dangerous drug, The Associated Press has learned, a historic shift to generations of American drug policy … ",
    "url": "https://apnews.com/article/marijuana-biden-dea-criminal-justice-pot-f833a8dae6ceb31a8658a5d65832a3b8"
  },
  {
    "text": "White House considers admitting some Palestinians from Gaza as refugees  —  The Biden administration is considering admitting certain Palestinians to the U.S. as refugees, a report by CBS News found.  —  Senior officials in several U.S. agencies have discussed the idea of resettling Palestinians … ",
    "url": "https://thehill.com/homenews/administration/4634560-white-house-considers-admitting-some-palestinians-gaza-refugees/"
  },
  {
    "text": "White House considers welcoming some Palestinians from war-torn Gaza as refugees  —  The Biden administration is considering bringing certain Palestinians to the U.S. as refugees, a move that would offer a permanent safe haven to some of those fleeing war-torn Gaza, according … ",
    "url": "https://www.cbsnews.com/news/palestinian-refugees-us-gaza-white-house/"
  },
  {
    "text": "Here's where campus protesters have been arrested over the past day.  —  Columbia in New York and Portland State University closed their campuses after pro-Palestinian demonstrators took over buildings.  More than 1,100 protesters have been arrested across the country in recent weeks.",
    "url": "https://www.nytimes.com/live/2024/04/30/nyregion/columbia-protests-college"
  },
  {
    "text": "Judges Reject Map That Would Have Given Louisiana New Majority-Black House District  —  The decision is likely to be appealed to the Supreme Court, leaving Louisiana in congressional district limbo for now.  —  LOADING  —  A new congressional district map giving Louisiana … ",
    "url": "https://www.huffpost.com/entry/louisiana-congressional-district-map-rejected_n_66317c32e4b0c558f74224ce"
  },
  {
    "text": "Court tosses map that created second Black House district in Louisiana  —  The ruling, if it stands, could be a win for Republicans, since Democrats were almost certain to win the newly drawn district.  —  A panel of federal judges has tossed out Louisiana's new congressional map … ",
    "url": "https://www.politico.com/news/2024/04/30/louisiana-court-black-house-district-00155351"
  },
  {
    "text": "‘Jeffrey Clark betrayed his oath’: Trump DOJ lawyer behind fake electors plot should be disbarred, disciplinary panel says  —  The District of Columbia's Office of Disciplinary Counsel issued a recommendation this week battering the credibility of former Donald Trump Justice Department attorney Jeffrey Clark … ",
    "url": "https://lawandcrime.com/high-profile/jeffrey-clark-betrayed-his-oath-trump-doj-lawyer-behind-fake-electors-plot-should-be-disbarred-disciplinary-panel-says/"
  },
  {
    "text": "Law Firm Defending Trump Seeks to Withdraw From a Long-Running Case  —  The firm, LaRocca Hornik, has represented Donald Trump's political operation in numerous suits dating to his first presidential run, including a pregnancy discrimination case in New York.",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/trump-lawyers-delgado.html"
  },
  {
    "text": "After Ukraine Aid Vote, Republicans Braced for Backlash Find Little  —  Some Republicans who backed the aid encountered little resistance from voters, who were far more willing to embrace it — and less interested in ousting the speaker over it — than their right-wing colleagues.",
    "url": "https://www.nytimes.com/2024/04/30/us/politics/republicans-ukraine-aid-vote.html"
  },
  {
    "text": "EcoHealth Alliance president to testify on COVID origins, Wuhan lab taxpayer-funded research  —  NGO worked with China lab on gain-of-function research to assess transmission of bat coronaviruses to humans  —  EcoHealth Alliance President Peter Daszak is expected to publicly testify … ",
    "url": "https://www.foxnews.com/politics/ecohealth-alliance-president-testify-covid-origins-wuhan-lab-taxpayer-funded-research"
  },
  {
    "text": "USPol #USPolitics #Politics #Fascism  —  11 thoughts on “#USPol #USPolitics #Politics #Fascism”  —  @ArpComics Peaceful protesters who don't trespass or cause damage to property are for the most part left to protest peacefully.  What is happening now is an embarrassment and is in no way a protest.",
    "url": "https://whatwasidoingagain.com/notes/9a42a0bdb1/"
  },
  {
    "text": "Barnard president loses vote of no confidence as criticism mounts over protest response  —  The president of Barnard College at Columbia University lost a faculty-wide vote of no confidence on Tuesday, as criticism mounts over the school's response to a pro-Palestine encampment that has sparked … ",
    "url": "https://thehill.com/homenews/education/4634350-barnard-president-loses-vote-of-no-confidence-palestine-protest-response/"
  },
  {
    "text": "GOP senator calls for deporting certain foreign student protesters  —  Sen. Marsha Blackburn (R-Tenn.) called for the U.S. government to revoke the visas given to international students who are Hamas sympathizers and deport them as college protests continue nationwide.",
    "url": "https://thehill.com/policy/international/4634492-gop-senator-calls-for-deporting-certain-foreign-student-protesters/"
  },
  {
    "text": "Fox Business Host Goes There: Biden's ‘Woke’ Tax Policies Are Anti-White  —  QUIET PART OUT LOUD  —  Larry Kudlow on Tuesday made the assumption that Joe Biden's tax policies are part of a bigger scheme against conservatives.  —  Fox Business Network host and former Trump White House … ",
    "url": "https://www.thedailybeast.com/fox-business-host-larry-kudlow-labels-bidens-woke-tax-policies-as-anti-white"
  },
  {
    "text": "Philips Agrees to Pay $1 Billion to Patients Who Say They Were Injured by Breathing Machines  —  The proposed settlement will effectively end more than 700 lawsuits filed after the 2021 recall of millions of the company's widely used sleep apnea devices and ventilators.  —  Co-published with Pittsburgh Post-Gazette",
    "url": "https://www.propublica.org/article/philips-lawsuit-settlement-cpap-breathing-machine-recall"
  },
  {
    "text": "'I Didn't Shoot My Dog': Mitt Romney Resents Being Compared To Kristi Noem  —  “I loved my dog and my dog loved me,” the Utah senator said when asked about comparisons between him and South Dakota's GOP governor.  —  LOADING  —  WASHINGTON ― Sen. Mitt Romney (R-Utah) … ",
    "url": "https://www.huffpost.com/entry/kristi-noem-dog-mitt-romney_n_66316f70e4b0849b2edd5cd4"
  },
  {
    "text": "Guess Who's Coming to Elon's Dinner  —  A secret billionaire dinner party in Hollywood, convened by Elon Musk and David Sacks, presages a major political realignment as Silicon Valley money turns against Biden and begins flowing to Donald Trump.  —  On a brisk Friday evening earlier this month … ",
    "url": "https://puck.news/elon-musk-david-sacks-host-anti-biden-dinner-party/"
  },
  {
    "text": "Trumpworld has a new nonsensical theory of his document-case innocence  —  On his way into the Manhattan courtroom where he is being tried on 34 felony charges, former president Donald Trump on Tuesday spoke to reporters about another of his indictments, the one obtained by special counsel Jack Smith … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/30/trump-documents-case-rumor-false/"
  },
  {
    "text": "NEW: DHS Docs Show Top Cities Biden Admin Flew Migrants Under Controversial Program, 80% to Single State  —  Internal data obtained by Fox News via a House Homeland Security Committee subpoena to Secretary Alejandro Mayorkas' Department of Homeland Security (DHS) shows that thousands … ",
    "url": "https://redstate.com/brutalbrittany/2024/04/30/internal-dhs-docs-reveal-top-15-cities-biden-admin-flew-migrants-to-under-controversial-parole-program-n2173572"
  }
]