[
  {
    "text": "Biden set to announce support for major Supreme Court changes  —  Plans include proposals for legislation to establish term limits for the justices and an enforceable ethics code  —  President Biden is finalizing plans to endorse major changes to the Supreme Court in the coming weeks … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/16/biden-supreme-court-reforms/"
  },
  {
    "text": "Pelosi privately fields battleground Dem calls as she works to address Biden crisis  —  The former speaker gave the distinct impression that she wanted the president to take himself off the ticket, according to a battleground House Democrat who spoke to Nancy Pelosi recently.",
    "url": "https://www.politico.com/news/2024/07/16/pelosi-biden-2024-elections-00168767"
  },
  {
    "text": "Andreessen Horowitz co-founders explain why they're supporting Trump  —  Marc Andreessen, the co-founder of one of the most prominent venture capital firms in Silicon Valley, says he's been a Democrat most of his life.  He says he has endorsed and voted for Bill Clinton, Al Gore, John Kerry, Barack Obama and Hillary Clinton.",
    "url": "https://techcrunch.com/2024/07/16/andreessen-horowitz-co-founders-explain-why-theyre-supporting-trump/"
  },
  {
    "text": "Trump on Taxes, Tariffs, Jerome Powell and More … It's late June, and Donald Trump is plotting his next presidency in the gilded offseason isolation of the Mar-a-Lago Club.  The adoring club members may have decamped to cooler climates, but Trump is still in a good mood.",
    "url": "https://www.bloomberg.com/features/2024-trump-interview/"
  },
  {
    "text": "Megadonors Are Plotting to Change Biden's Mind With Money.  Will It Work?  —  They're calling politicians.  They're dangling money to members of Congress.  But major Democratic donors who want President Biden to step aside are also learning the limits of their powers.",
    "url": "https://www.nytimes.com/2024/07/17/us/politics/biden-democratic-donors-trump.html"
  },
  {
    "text": "GOP Platform Author Admits There's a National Ban  —  Click to skip ahead: In WTF NYT, the paper of record deceptively edited a quote.  In the States, news out of Ohio, Michigan, Montana and more.  I Told Ya So on the GOP's abortion plank.  Ballot Measure Updates has more on the financial impact statement fight in Florida.",
    "url": "https://jessica.substack.com/p/gop-platform-author-admits-theres"
  },
  {
    "text": "JD Vance on Abortion  —  Donald Trump's trad-husband VP pick wants women back in the kitchen  —  Donald Trump has chosen U.S. Sen. JD Vance of Ohio, anti-abortion loser galore, as his running mate.  It's an interesting choice, one that indicates that maybe Trump isn't as worried about abortion as he should be.",
    "url": "https://jessica.substack.com/p/jd-vance-on-abortion"
  },
  {
    "text": "The phony populism of JD Vance  —  It's a cynical branding exercise. … Trump chose JD Vance as his running mate this week, and a certain segment of the news media immediately rushed to declare the start of a new kind of working-class Republicanism.  —  “JD Vance pick unnerves GOP's business elite … ",
    "url": "https://www.publicnotice.co/p/jd-vance-phony-populism-trump"
  },
  {
    "text": "Donald Trump calls for Taiwan to ‘pay’ for its own defence  —  TSMC shares slide after Republican candidate's comments rattle island nation reliant on security guarantee  —  Former US president Donald Trump has said Taiwan should pay the US for its defence guarantees, a statement … ",
    "url": "https://www.ft.com/content/84f8336e-9b8a-4662-a665-47aa3edb6bc9"
  },
  {
    "text": "Exclusive: Secret Service ramped up security after receiving intel of Iranian plot to assassinate Trump; no known connection to shooting  —  US authorities obtained intelligence from a human source in recent weeks on a plot by Iran to try to assassinate Donald Trump, a development that led … ",
    "url": "https://www.cnn.com/2024/07/16/politics/iran-plot-assassinate-trump-secret-service/"
  },
  {
    "text": "Boiled Frog Journalism: Is Trump an Agent of Saudi Arabia, and Other Pressing Questions Buried under Biden's Age  —  A jury found Robert Menendez guilty on all charges yesterday, including those alleging he accepted payments from Egypt and Qatar (I didn't follow the trial closely enough … ",
    "url": "https://www.emptywheel.net/2024/07/17/boiled-frog-journalism-is-trump-an-agent-of-saudi-arabia-and-other-pressing-questions-buried-under-bidens-age/"
  },
  {
    "text": "Former Trump adviser Peter Navarro released from prison after serving 4 months for contempt of Congress  —  Former Donald Trump White House adviser Peter Navarro was released from a Miami federal prison Wednesday after completing his four-month sentence for defying a subpoena from the January 6 congressional committee.",
    "url": "https://www.cnn.com/2024/07/17/politics/peter-navarro-released-from-prison-contempt"
  },
  {
    "text": "Cop Fatally Shoots ‘Armed’ Suspect Just Outside RNC  —  CHILLING  —  The officer who opened fire was from Columbus, Ohio, and was attending the RNC.  —  An Ohio cop dispatched to help secure the RNC fatally shot an “armed” man just outside the convention's perimeter in Milwaukee on Tuesday afternoon … ",
    "url": "https://www.thedailybeast.com/rnc-shooting-cop-fatally-shoots-armed-suspect-just-outside-convention"
  },
  {
    "text": "Trump calls widow of firefighter who died protecting his family: ‘He was very kind’  —  Helen Comperatore says Trump phoned her on Tuesday after husband Corey was killed in Butler, Pennsylvania  —  The widow of the volunteer firefighter who was shot and killed over the weekend at the Trump rally … ",
    "url": "https://www.foxnews.com/politics/trump-calls-widow-firefighter-who-died-protecting-his-family-he-very-kind"
  },
  {
    "text": "Organizers expect enough signatures to ask Nebraska voters to repeal private school funding law  —  Public school advocates believe they have enough signatures to ask Nebraska voters in November to repeal a law that provides taxpayer money for private school tuition, marking the latest twist … ",
    "url": "https://apnews.com/article/private-school-choice-nebraska-ballot-3b73fe065060b753d2f2a0b8a7682dab"
  },
  {
    "text": "The extraordinary duplicity of Musk's $180 million donation to support Trump  —  Billionaire Elon Musk will reportedly spend $180 million to encourage former President Donald Trump supporters in swing states to vote absentee, a practice Musk has publicly described as “insane,” “too risky,” and a recipe for “large-scale fraud.”",
    "url": "https://popular.info/p/the-extraordinary-duplicity-of-musks"
  },
  {
    "text": "Biden, in 1st major speech after Trump shooting, accuses him of ‘lying like hell’  —  He hit back his rival's claims and policies but avoided personal attacks.  —  President Joe Biden speaks at the 115th NAACP National Convention at the Mandalay Bay Convention Center, on July 16, 2024, in Las Vegas.",
    "url": "https://abcnews.go.com/Politics/biden-1st-major-speech-after-trump-shooting-accuses/story?id=111998836"
  },
  {
    "text": "‘They’ didn't shoot Donald Trump  —  Despite the lack of any clear motive, the actions of Thomas Crooks have been attributed to the Democratic Party at large.  —  On Saturday afternoon, Thomas Crooks, 20, climbed onto the roof of a building in Butler, Pa., carrying an AR-style rifle purchased … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/16/they-didnt-shoot-donald-trump/"
  },
  {
    "text": "Biden Group Therapy  —  Fresh reporting on the collective private mourning of top Democrats after the tragic “events”—as they are known in Washington-speak—of the weekend.  Nevertheless, some cling to hope.  “He also said he would drop if he saw data saying he can't win,” said a campaign source.",
    "url": "https://puck.news/biden-saturday-zoom-call-with-house-democrats-goes-off-the-rails/"
  },
  {
    "text": "Armed man in ski mask arrested while approaching Republican National Convention perimeter in Milwaukee  —  Man had AK-47 pistol, ski mask, tactical bag and full magazine  —  A man armed with an AK-47 pistol and wearing a ski mask was arrested on Monday just blocks from Fiserv Forum … ",
    "url": "https://www.foxnews.com/politics/armed-man-ski-mask-arrested-while-approaching-republican-national-convention-perimeter-milwaukee"
  },
  {
    "text": "MAGA Makes Racist Attacks Against JD Vance's Wife  —  Extremist figures and members of the Make America Great Again movement have criticized the  —  named him as his running mate in the 2024 election.  —  Usha Vance, the daughter of Indian immigrants, was raised in San Diego before meeting her husband at Yale Law School.",
    "url": "https://www.newsweek.com/jd-vance-wife-attacks-maga-trump-running-mate-1926194"
  },
  {
    "text": "Georgian National Charged with Soliciting Hate Crimes and a Mass Casualty Attack in New York City  —  For Immediate Release … A federal grand jury in Brooklyn, New York, returned a four-count indictment today charging Georgian national Michail Chkhikvishvili, 21, also known as Mishka … ",
    "url": "https://www.justice.gov/opa/pr/georgian-national-charged-soliciting-hate-crimes-and-mass-casualty-attack-new-york-city"
  },
  {
    "text": "Rupert Murdoch Shows Up at Republican Convention  —  The media titan's attendance in Milwaukee was another extraordinary turn in his contorted relationship with Donald J. Trump.  —  He confided to friends in the fall of 2020 that he thought Donald J. Trump was going “increasingly mad” … ",
    "url": "https://www.nytimes.com/2024/07/16/business/media/rupert-murdoch-rnc.html"
  },
  {
    "text": "Chinese Billionaire and Bannon Ally Is Convicted of Fraud  —  A federal jury found that Guo Wengui defrauded investors, many his own fervent supporters, of hundreds of millions of dollars.  He could face decades in prison.  —  Guo Wengui, the exiled Chinese billionaire who transformed himself … ",
    "url": "https://www.nytimes.com/2024/07/16/nyregion/guo-wengui-fraud-trial-verdict-china.html"
  },
  {
    "text": "Trump Media Made a Deal That Could Secure a Major Financial Windfall for the GOP Candidate  —  The company behind Trump's Truth Social platform has the option to sell up to $2.5 billion worth of shares, easing the way for the former president to convert his paper stake into something more tangible.",
    "url": "https://www.propublica.org/article/trump-media-stock-sale-shares-truth-social-yorkville-advisors"
  }
]