[
  {
    "text": "Trump has been unable to get bond for $464 million judgment, his lawyers say  —  In a filing to an appeals court, Trump's attorneys said getting the bond needed to halt proceedings while they appeal is a “practical impossibility.”  —  Former President Donald Trump has not been able to get a bond … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-unable-get-bond-464-million-judgment-lawyers-say-rcna143860"
  },
  {
    "text": "Trump Spurned by 30 Companies as He Seeks Bond in $454 Million Judgment  —  Donald J. Trump's lawyers said in a court filing that he faces “insurmountable difficulties” as he tries to raise cash for the civil fraud penalty he faces in New York.  —  Donald J. Trump's lawyers disclosed on Monday … ",
    "url": "https://www.nytimes.com/2024/03/18/nyregion/trump-bond-civil-fraud-case.html"
  },
  {
    "text": "Trump can't post $464M bond to appeal New York fraud case, lawyers say … - Earlier this month, Trump posted a nearly $92 million bond to appeal the $83.3 million in damages a jury ordered him to pay to writer E. Jean Carroll for defamation by denying her sexual assault allegations.",
    "url": "https://www.axios.com/2024/03/18/trump-new-york-fraud-case-appeal-bond"
  },
  {
    "text": "Trump unable to finance an appeal bond for at least $450 million, lawyers say  —  NEW YORK — Donald Trump has been unable to finance an appeal bond for at least $450 million to cover a judgment in the New York attorney general's business fraud case against him and is seeking a reprieve … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/18/trump-civil-fraud-judgment-bond-450-million/"
  },
  {
    "text": "Trump is unable to make $464 million bond in civil fraud case, his lawyers tell court  —  Former President Donald Trump can't find an insurance company to underwrite his bond to cover the massive judgment against him in the New York attorney general's civil fraud case, his lawyers told a New York appeals court.",
    "url": "https://www.cnn.com/2024/03/18/politics/trump-464-million-dollar-bond/"
  },
  {
    "text": "Trump is eyeing Paul Manafort for 2024 campaign role  —  The former campaign manager was pardoned by Trump for bank and tax fraud convictions and accusations he hid millions he made consulting for pro-Russian Ukrainian politicians  —  Former president Donald Trump is expected to enlist Paul Manafort … ",
    "url": "https://www.washingtonpost.com/politics/2024/03/18/trump-manafort-2024-campaign/"
  },
  {
    "text": "The Good, Bad and Ugly in a New Poll on Trump's Trials and the Supreme Court  —  A new POLITICO Magazine/Ipsos poll suggests a conviction in the Manhattan trial could turn off independents.  —  Some Americans' opinions on Donald Trump's guilt may be a proxy for their views on him more generally … ",
    "url": "https://www.politico.com/news/magazine/2024/03/18/poll-conviction-trump-2024-elections-00147338"
  },
  {
    "text": "How to Make Trump Pay for Embracing Jan 6th  —  At a rally in Ohio on Saturday night, Trump once again demonstrated the unequivocal danger of his candidacy for the White House.  At one point, Trump said: … The man who tried to violently overturn the election promising a “bloodbath” … ",
    "url": "https://www.messageboxnews.com/p/how-to-make-trump-pay-for-embracing"
  },
  {
    "text": "Trump calls for Liz Cheney to be jailed for investigating him over Capitol attack  —  Former president's posts on Truth Social about Republican critic stoke fears of persecution of opponents if he wins 2024 election  —  Donald Trump has renewed calls for Liz Cheney - his most prominent Republican critic … ",
    "url": "https://www.theguardian.com/us-news/2024/mar/18/trump-liz-cheney-prison-jan-6-investigation"
  },
  {
    "text": "Justice Breyer, Off the Bench, Sounds an Alarm Over the Supreme Court's Direction  —  In an interview in his chambers and in a new book, the justice, who retired in 2022, discussed Dobbs, originalism and the decline of trust in the court.  —  Justice Stephen G. Breyer's Supreme Court chambers … ",
    "url": "https://www.nytimes.com/2024/03/18/us/breyer-supreme-court-interview.html"
  },
  {
    "text": "Supreme Court lets ‘insurrectionist’ ban against New Mexico official stand  —  Couy Griffin was a county commissioner in New Mexico until courts there ruled he was disqualified after a Jan. 6-related conviction.  —  The Supreme Court has turned away a convicted member of the Jan. 6 mob … ",
    "url": "https://www.politico.com/news/2024/03/18/supreme-court-new-mexico-griffin-00147547"
  },
  {
    "text": "“Obama would be jealous”: How Biden's rivalry with his ex-boss shapes his presidency … - “Obama would be jealous,” Biden sometimes says when speaking about a perceived accomplishment, according to two Biden aides familiar with such instances.  — The competitive dynamic has informed Biden's approach … ",
    "url": "https://www.axios.com/2024/03/18/biden-obama-rivalry-presidency"
  },
  {
    "text": "Adult MAGA rage is making schools more dangerous for students  —  Despite the Ethan Crumbley and Nex Benedict cases, a GOP nominee to run schools wants a “firing squad” for liberals  —  Last week saw national headlines regarding two tragic stories that illustrate how MAGA radicalization of adults endangers kids in school.",
    "url": "https://www.salon.com/2024/03/18/adult-maga-rage-is-making-schools-more-for-students/"
  },
  {
    "text": "Supreme Court likely to reject limits on White House tech contacts  —  The Supreme Court seems likely to reject a Republican-led effort that could reshape how politicians communicate with major social media companies — with sweeping consequences for government efforts to secure elections and combat health misinformation.",
    "url": "https://www.washingtonpost.com/technology/2024/03/18/supreme-court-social-media-biden-missouri/"
  },
  {
    "text": "Who Will Win the Biden-Trump Double-Haters?  —  Voters who despise both candidates are the coveted “swing” voters of 2024. … Move over swing voters, independents, NASCAR dads, and soccer moms.  So-called “double-haters” might be the most important voting bloc this year.",
    "url": "https://www.thedailybeast.com/who-will-win-the-biden-trump-double-haters"
  },
  {
    "text": "Sonia Sotomayor Should Retire Now  —  On Election Day in 2006, Justice Antonin Scalia was 70 years old and had been serving on the Supreme Court for 20 years.  That year would have been an opportune time for him to retire—Republicans held the White House and the Senate … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/03/sonia-sotomayor-should-retire/677764/"
  },
  {
    "text": "Susan Glasser Slams ABC Panel: Take Trump's Words As Fact  —  The New Yorker reporter reminded her panel members that Trump is “peddling an alternate reality vision of America that is built on lies.”  —  Can you help us out?  —  For nearly 20 years we have been exposing Washington lies … ",
    "url": "https://crooksandliars.com/2024/03/susan-glasser-slams-abc-panel-take-0"
  },
  {
    "text": "What the Data Says About Pandemic School Closures, Four Years Later  —  The more time students spent in remote instruction, the further they fell behind.  And, experts say, extended closures did little to stop the spread of Covid.  —  Four years ago this month, schools nationwide began to shut down … ",
    "url": "https://www.nytimes.com/2024/03/18/upshot/pandemic-school-closures-data.html"
  }
]