[
  {
    "text": "'I'm not a windmill person': Trump takes the witness stand and doesn't break character  —  In a series of outbursts while testifying, Trump assailed the judge who is overseeing his civil fraud case.  —  NEW YORK — Testimony by former President Donald Trump quickly descended into bitter sniping Monday … ",
    "url": "https://www.politico.com/news/2023/11/06/trump-civil-fraud-trial-00125515"
  },
  {
    "text": "Iowa Gov. Kim Reynolds says Trump can't win in 2024 as she endorses Ron DeSantis  —  Reynolds and DeSantis spoke about the state of the 2024 race and what led to the Iowa governor's endorsement in a joint interview with NBC News.  —  DES MOINES, Iowa  — Iowa Gov. Kim Reynolds touted Ron … ",
    "url": "https://www.nbcnews.com/politics/2024-election/iowa-gov-kim-reynolds-says-trump-cant-win-2024-endorses-ron-desantis-rcna123788"
  },
  {
    "text": "Trump Forgets What Years He Was President While on the Stand in NY Trial  —  WHOOPS!  —  Donald Trump forgot what years he served as president while on the stand in his New York fraud trial Monday.  He claimed at one point that he did not pay attention to his company's financial statements … ",
    "url": "https://www.thedailybeast.com/trump-forgets-what-years-he-was-president-while-on-the-stand-in-ny-fraud-trial"
  },
  {
    "text": "3 early takeaways from Trump's testimony  —  Donald Trump's many legal problems led to a historic scene Monday: a former president testifying under oath in his own civil fraud trial in New York.  —  New York Attorney General Letitia James (D) is suing Trump and others, including his two adult sons, seeking $250 million.",
    "url": "https://www.washingtonpost.com/politics/2023/11/06/trump-trial-testimony-takeaways/"
  },
  {
    "text": "Jan. 6 riot was ‘culmination’ of Trump conspiracies to overturn 2020 election, special counsel says in new filing  —  The special counsel's office called Trump's motion a “meritless effort” to evade allegations that he was responsible for the attack on the Capitol.",
    "url": "https://www.nbcnews.com/politics/donald-trump/jan-6-riot-was-culmination-trump-conspiracies-overturn-2020-election-s-rcna123897"
  },
  {
    "text": "Prosecutors Assail Trump's Bid to Have Federal Election Case Dismissed  —  Prosecutors said that Mr. Trump's barrage of motions to have the case tossed out were full of “distortions and misrepresentations.”  —  Federal prosecutors on Monday asked a judge to reject a barrage of motions filed … ",
    "url": "https://www.nytimes.com/2023/11/06/us/politics/trump-election-case-prosecutors.html"
  },
  {
    "text": "Trump doesn't just want to win.  He wants revenge.  —  It can happen here — again.  Our nation survived the first time.  I'm not at all confident about the second.  —  The news brings two stories, separately alarming, together bone-chilling.  “Trump leads in 5 Critical States as Voters Blast Biden … ",
    "url": "https://www.washingtonpost.com/opinions/2023/11/06/trump-revenge-polls-biden/"
  },
  {
    "text": "Trump kids' blame claims don't match with fraud case facts: reporter  —  Former President Donald Trump's children's claims that Trump Organization accountants are to blame for fraudulently inflated estimates of the company's value don't comport with the known facts of the case, a New York Times investigative reporter argued Monday.",
    "url": "https://www.rawstory.com/trump-organization-fraud-2666167395/"
  },
  {
    "text": "'He's a child' Trump is imploding because he thinks 'rules don't apply to him': biographer  —  Former President Donald Trump had a bad day on the witness stand at his civil fraud trial in New York, snapping at state attorneys and offering contradictory stories about his company's dubious property valuations … ",
    "url": "https://www.rawstory.com/trump-child-rules-dont-apply/"
  },
  {
    "text": "‘Wanna Kill All You Little Crackers’: Nashville Trans Shooter Manifesto Leaked?  Update: Confirmed  —  Has the long-buried “manifesto” of the Nashville transgender mass murderer finally leaked?  More than seven months after the massacre of six people inside The Covenant School … ",
    "url": "https://hotair.com/ed-morrissey/2023/11/06/wanna-kill-all-you-little-crackers-nashville-trans-shooter-manifesto-leaked-n590375"
  },
  {
    "text": "U.S. diplomats slam Israel policy in leaked memo  —  The document offers a window into internal fury at the State Department over President Joe Biden's Middle East policies.  —  State Department staffers offered a blistering critique of the Biden administration's handling of the Israel-Hamas war … ",
    "url": "https://www.politico.com/news/2023/11/06/u-s-diplomats-slam-israel-policy-in-leaked-memo-00125538"
  },
  {
    "text": "Iran Might Have Miscalculated in Gaza  —  It had an interest in dividing Israel from Arab states.  So far that hasn't happened.  —  Most news and commentary describes the war in Gaza as the latest brutal episode in the conflict between Israelis and Arabs.",
    "url": "https://www.wsj.com/articles/iran-might-have-miscalculated-in-gaza-abraham-accords-arab-allies-70bc087a?mod=followamazon"
  },
  {
    "text": "5 candidates qualify for the Miami GOP debate, with Doug Burgum missing out  —  Donald Trump is skipping another debate, but Chris Christie, Ron DeSantis, Nikki Haley, Vivek Ramaswamy and Tim Scott will be onstage Wednesday night.  —  Five candidates will be on the stage Wednesday night … ",
    "url": "https://www.nbcnews.com/politics/2024-election/republican-debate-candidates-qualify-rcna123741"
  },
  {
    "text": "Some Democrats worry Biden's team is ignoring political warning signs  —  A series of recent polls shows Trump running even or ahead of Biden.  His team says they don't mean much a year before the election.  —  Democrats are growing increasingly anxious about the state … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/06/biden-democrats-polls-politics/"
  },
  {
    "text": "Marijuana use linked with increased risk of heart attack, heart failure  —  American Heart Association Scientific Sessions 2023, Abstract Poster MDP250 and Abstract Poster MDP249  —  Research Highlights:  — As more people across the U.S. use marijuana for medical and recreational reasons … ",
    "url": "https://newsroom.heart.org/news/marijuana-use-linked-with-increased-risk-of-heart-attack-heart-failure"
  },
  {
    "text": "Moms for Liberty members call the cops on Florida librarians  —  Two members of Moms for Liberty, a right-wing activist group, have reported several Florida school librarians to law enforcement.  They claimed they had evidence that librarians were distributing “pornography” … ",
    "url": "https://popular.info/p/moms-for-liberty-members-call-the"
  },
  {
    "text": "Three GOP AGs seek to join medication abortion lawsuit, raising SCOTUS questions  —  The attorneys general of Missouri, Kansas, and Idaho are seeking to intervene in the lawsuit challenging the federal government's approval of and rules regarding one of the two drugs used in medication abortion … ",
    "url": "https://www.lawdork.com/p/gop-ags-seek-intervention-mifeprisone-case"
  },
  {
    "text": "Biden administration urges SCOTUS to hear trans care cases, strike down bans  —  The Biden administration on Monday urged the U.S. Supreme Court to take up cases over transgender health care bans, arguing that Tennessee's ban on gender-affirming medical care for minors violates … ",
    "url": "https://www.lawdork.com/p/biden-doj-scotus-trans-care-case-review"
  },
  {
    "text": "A disgraced former Trump official wants to deport Palestinians  —  For just under two years, Ryan Zinke served as Donald Trump's secretary of the interior.  In late 2018, though, he resigned under the weight of more than a dozen federal investigations into his actions.",
    "url": "https://www.washingtonpost.com/politics/2023/11/06/zinke-palestian-deportation-bill/"
  },
  {
    "text": "‘Secret reports’ reveal how government worked to ‘censor Americans’ prior to 2020 election, Jim Jordan says  —  ‘The federal government, disinformation ‘experts’ at universities, Big Tech, and others worked ... to monitor & censor Americans’ speech,' said Judiciary Committee Chair Jim Jordan",
    "url": "https://www.foxnews.com/politics/secret-reports-reveal-how-government-worked-censor-americans-prior-2020-election-jim-jordan-says"
  }
]