[
  {
    "text": "HARVARD PRESIDENT CLAUDINE GAY RESIGNS, SHORTEST TENURE IN UNIVERSITY HISTORY  —  Harvard President Claudine Gay will resign Tuesday afternoon, bringing an end to the shortest presidency in the University's history, according to a person with knowledge of the decision.",
    "url": "https://www.thecrimson.com/article/2024/1/3/claudine-gay-resign-harvard/"
  },
  {
    "text": "Personal News  —  Dear Members of the Harvard Community,  —  It is with a heavy heart but a deep love for Harvard that I write to share that I will be stepping down as president.  This is not a decision I came to easily.  Indeed, it has been difficult beyond words because I have looked forward … ",
    "url": "https://www.harvard.edu/president/news/2024/personal-news/"
  },
  {
    "text": "Harvard President Resigns After Mounting Plagiarism Accusations  —  Claudine Gay faced backlash over the university's response to antisemitism on campus, which led to increased scrutiny of her academic record.  —  Harvard's president, Claudine Gay, announced her resignation on Tuesday … ",
    "url": "https://www.nytimes.com/2024/01/02/us/harvard-claudine-gay-resigns.html"
  },
  {
    "text": "Harvard president resigns after antisemitism hearing and plagiarism probe  —  Harvard President Claudine Gay resigned Tuesday weeks after she appeared before Congress in a disastrous hearing on antisemitism. … She will have the shortest tenure in school history.",
    "url": "https://www.axios.com/2024/01/02/harvard-president-resign-claudine-gay"
  },
  {
    "text": "How death threats get Republicans to fall in line behind Trump  —  The insidious way violence is changing American politics — and shaping the 2024 election.  —  Stephen Richer should have been safe.  —  In early 2021, Richer was an Arizona Republican official who regularly attended local party events.",
    "url": "https://www.vox.com/23899688/2024-election-republican-primary-death-threats-trump"
  },
  {
    "text": "Exclusive — Trump Plans Aggressive Expansion of Electoral Map, Says He'll Make ‘Heavy Play’ for New York, New Jersey, Virginia, New Mexico, Minnesota  —  PALM BEACH, Florida — Former President Donald Trump told Breitbart News exclusively that assuming he wins the GOP nomination for president again … ",
    "url": "https://www.breitbart.com/politics/2024/01/02/exclusive-trump-plans-aggressive-expansion-electoral-map-says-hell-make-heavy-play-new-york-new-jersey-virginia-new-mexico-minnesota/"
  },
  {
    "text": "Republican loyalty to Trump, rioters climbs in 3 years after Jan. 6 attack  —  Three years after the Jan. 6 attack, Republicans are more sympathetic to those who stormed the U.S. Capitol and more likely to absolve Donald Trump of responsibility for the attack than they were in 2021 … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/01/02/jan-6-poll-post-trump/"
  },
  {
    "text": "Israeli drone strike kills senior Hamas official in Beirut, sources say  —  Saleh al-Arouri, the deputy chairman of Hamas' political bureau and the commander of the group's military wing in the occupied West Bank, was killed in a drone attack in a Beirut suburb on Tuesday, Hamas has confirmed.",
    "url": "https://www.axios.com/2024/01/02/hamas-saleh-arouri-killed-beirut-hezbollah-israel-gaza"
  },
  {
    "text": "Bill Johnson to resign Jan. 21 from Congress, start as YSU president the next day  —  YOUNGSTOWN - Bill Johnson submitted his letter of resignation today to the U.S. House of Representatives, effective Jan. 21, and will start the next day as Youngstown State University president.",
    "url": "https://www.vindy.com/news/latest-news/2024/01/bill-johnson-to-resign-jan-21-from-congress-start-as-ysu-president-the-next-day"
  },
  {
    "text": "Sen. Bob Menendez facing even more charges in new superseding indictment  —  The Democrat is now accused of making positive comments about Qatar for gifts.  —  Sen. Bob Menendez, D-N.J., departs the Senate floor in the Capitol, Sept. 28, 2023, in Washington.",
    "url": "https://abcnews.go.com/Politics/sen-bob-menendez-facing-charges-new-superseding-indictment/story?id=106056419"
  },
  {
    "text": "Sen. Menendez charged with receiving gifts from Qatar in new allegations in corruption scheme  —  Federal prosecutors allege Sen. Bob Menendez accepted race car tickets and other gifts from Qatar as part of a yearslong corruption scheme, making the Gulf nation the second foreign country … ",
    "url": "https://www.cnn.com/2024/01/02/politics/bob-menendez-superseding-indictment-qatar/"
  },
  {
    "text": "Disgraced former Iowa Rep. Steve King endorses Ramaswamy  —  Former Iowa Rep. Steve King endorsed GOP presidential candidate Vivek Ramaswamy on Tuesday.  —  King lost his House seat in the 2020 primary after he was stripped of his committee assignments after questioning why the terms … ",
    "url": "https://thehill.com/homenews/campaign/4385999-former-iowa-rep-endorses-ramaswamy/"
  },
  {
    "text": "Man forces way into Colorado Supreme Court days after Trump ballot decision  —  A man was arrested early Tuesday after he broke into the Colorado Supreme Court overnight, opened fire and caused “significant and extensive” damage, local authorities said.  —  The man was involved … ",
    "url": "https://thehill.com/homenews/state-watch/4384741-colorado-supreme-court-trump-ballot-14th-amendment/"
  },
  {
    "text": "MAGA Crowd Has A Breakdown After Green Day Swipes Them on Live TV  —  The pop-punk band changed the lyrics of their song “American Idiot” to fire at the “MAGA agenda,” causing an instantaneous social media meltdown.  —  The dawn of a new year might be a cause for hope and a time for new beginnings … ",
    "url": "https://www.thedailybeast.com/maga-crowd-has-a-breakdown-after-green-day-swipes-them-on-live-tv"
  },
  {
    "text": "Trouble with tha God  —  The influential radio host of “The Breakfast Club” is a thorn in the side of Democrats — but he's also representative of one of their biggest problems.  —  Charlamagne tha God sits in his throne in the recording studio for “The Breakfast Club” on iHeart Radio in New York on October 2023.",
    "url": "https://www.politico.com/news/2024/01/02/biden-charlamagne-tha-god-00132784"
  },
  {
    "text": "WATCH: CNN's Hot Take on Claudine Gay's Harvard Resignation Was Something Else  —  We wrote earlier about how Boston Mayor Michelle Wu (D) had conveniently been absolved of wrongdoing by Massachusetts' woke Attorney General Andrea Campbell (D), who declared just before the Christmas holiday … ",
    "url": "https://redstate.com/sister-toldjah/2024/01/02/watch-cnns-hot-take-on-claudine-gays-harvard-resignation-was-something-else-n2168208"
  },
  {
    "text": "Rape investigation of FL GOP chairman expands to video voyeurism  —  Sarasota police are investigating whether Florida GOP Chairman Christian Ziegler unlawfully videotaped the sexual encounter at the heart of a rape allegation against him, a third search warrant affidavit obtained by the Florida Trident reveals.",
    "url": "https://flcga.org/rape-investigation-of-fl-gop-chairman-expands-to-video-voyeurism/"
  }
]