[
  {
    "text": "Head of I.R.S. Is Ousted in Treasury's Power Struggle With Elon Musk  —  Treasury Secretary Scott Bessent complained to President Trump that the acting commissioner had been installed without his knowledge.  —  President Trump has replaced the acting commissioner of the Internal Revenue Service … ",
    "url": "https://www.nytimes.com/2025/04/18/us/politics/irs-scott-bessent-elon-musk.html?unlocked_article_code=1.Ak8.73ER.apF4cHc5pdP_&smid=url-share"
  },
  {
    "text": "Trump is replacing the acting IRS commissioner, part of a dispute between treasury and Elon Musk  —  The move comes after Treasury Secretary Scott Bessent told Trump that Gary Shapley was placed in the position without his knowledge and at Elon Musk's direction.",
    "url": "https://www.nbcnews.com/politics/politics-news/trump-replacing-acting-irs-commissioner-rcna201907"
  },
  {
    "text": "Abrego Garcia's deportation case exposes a rift among Democrats over how to take on Trump  —  As some Democrats vocally push for the release of the man the administration says was mistakenly deported, others have sought to steer clear and focus on high prices and economic issues.",
    "url": "https://www.nbcnews.com/politics/immigration/abrego-garcias-deportation-case-exposes-rift-democrats-take-trump-rcna201723"
  },
  {
    "text": "Rubio Says Trump to ‘Move On’ From Ukraine Peace Talks if No Progress Soon  —  “If it is not possible to end the war in Ukraine, we need to move on,” Secretary of State Marco Rubio said as he departed meetings in Paris.  —  The United States will abandon efforts to end the war in Ukraine … ",
    "url": "https://www.nytimes.com/2025/04/18/world/europe/rubio-ukraine-russia-war-paris.html"
  },
  {
    "text": "The New America: Federal (ICE) Agents Boarding Trains?  —  As an attorney I'm deeply alarmed by an incident that occurred just this week and feel compelled to share it—to raise awareness of the legal and constitutional crossroads we are rapidly approaching.",
    "url": "https://weknowwhatsup.blogspot.com/2025/04/the-new-america-federal-ice-agents.html"
  },
  {
    "text": "The State Department is changing its mind about what it calls human rights  —  The Trump administration is substantially scaling back the State Department's annual reports on international human rights to remove longstanding critiques of abuses such as harsh prison conditions … ",
    "url": "https://www.npr.org/2025/04/18/nx-s1-5357511/state-department-human-rights-report-cuts"
  },
  {
    "text": "Trump Is Flirting With Economic Disaster  —  By threatening the independence of the Federal Reserve, the president risks undermining many of his key goals.  —  According to President Donald Trump, the banker he picked to lead the Federal Reserve is “WRONG.”  His reports are a “complete ‘mess!’”",
    "url": "https://www.theatlantic.com/economy/archive/2025/04/trump-fed-economic-disaster/682506/"
  },
  {
    "text": "THE ORIGIN  —  1.  —  The virus possesses a biological characteristic that is not found in nature.  —  2.  —  Data shows that all COVID-19 cases stem from a single introduction into humans.  This runs contrary to previous pandemics where there were multiple spillover events.  —  3.",
    "url": "https://www.whitehouse.gov/lab-leak-true-origins-of-covid-19/"
  },
  {
    "text": "Immigrants prove they are alive, forcing Social Security to undo death label  —  The immigrants are among more than 6,000 who were falsely added to a deaths database by DHS and the U.S. DOGE Service in a bid to pressure them to leave the United States.  —  Immigrants falsely labeled dead … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/18/immigrants-dead-social-security-alive/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0OTQ4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MzMxMTk5LCJpYXQiOjE3NDQ5NDg4MDAsImp0aSI6IjA1NWY5NGJiLWE1M2UtNDk2MC1hMmExLTI5OTJhYWRmMDM2ZiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzE4L2ltbWlncmFudHMtZGVhZC1zb2NpYWwtc2VjdXJpdHktYWxpdmUvIn0.oCvuSF9ChTLwF38H1DMe2vay7BCg9D6oTSC_paYochs&itid=gfta"
  },
  {
    "text": "Judge orders halt to mass firings at Consumer Financial Protection Bureau  —  About 1,500 employees were set to be jettisoned at the bureau.  —  A security officer works inside of the Consumer Financial Protection Bureau building headquarters Monday, Feb. 10, 2025, in Washington.",
    "url": "https://abcnews.go.com/Politics/judge-orders-halt-mass-firings-consumer-financial-protection/story?id=120951391"
  },
  {
    "text": "Wisconsin governor can lock in 400-year school funding increase using a veto, court says  —  The Democratic governor of Wisconsin's creative use of his uniquely powerful veto can lock in a school funding increase for 400 years, the state Supreme Court ruled Friday.",
    "url": "https://apnews.com/article/wisconsin-400-year-veto-supreme-court-5a1be188f78ab5e4223b2c7c7ad3ca7d"
  },
  {
    "text": "Housing Secretary Lets Staff Go Home Early For Easter To Reflect On Jesus  —  “We go into this holy weekend with freedoms that the world has never known,” reads a department-wide email from Scott Turner's chief of staff.  —  WASHINGTON - Housing and Urban Development Secretary Scott Turner told … ",
    "url": "https://www.huffpost.com/entry/hud-scott-turner-easter-us-citizens_n_67f93f90e4b060848e3e3f56"
  },
  {
    "text": "DHS tells US citizen and immigration advocate to leave the country … Aldo Martinez received an email April 11 from the Department of Homeland Security (DHS), telling him to leave the country or he would be removed.  It read: … “I was born in National City, California,” Martinez said.",
    "url": "https://www.nbcsandiego.com/nbc-7-responds-2/dhs-us-citizen-immigration-leave-country/3806750/"
  },
  {
    "text": "Travel to the U.S. from almost everywhere is falling under Trump  —  Charts show the scale of a steep drop in visitors from key countries and regions after President Donald Trump returned to office.  —  Overseas travel to the United States has declined sharply since President Donald Trump returned to office.",
    "url": "https://www.washingtonpost.com/world/2025/04/18/us-tourism-travel-trump/"
  },
  {
    "text": "Chart of the week: Trump is losing voters on the economy  —  Inflation got Donald Trump elected in 2024.  Now, his ratings on economic issues are at their lowest point ever, even worse than during COVID-19  —  The numbers on the economy are basically unanimous and relatively straightforward … ",
    "url": "https://www.gelliottmorris.com/p/chart-of-the-week-trump-is-losing"
  },
  {
    "text": "‘You caved’: El Salvador president ripped for posting photos from US Senator's meeting  —  Sen. Chris Van Hollen (D-Md.) received applause Thursday after he succeeded in meeting with Kilmar Abrego Garcia, the man wrongly deported to a notorious prison in El Salvador who has become the face … ",
    "url": "https://www.alternet.org/trump-el-salvador-2671799699/"
  },
  {
    "text": "Scoop: Trump revamps “Schedule F,” making it easier to cut federal workers  —  The Trump administration on Friday will announce that it's moving ahead with a new rule, previously known as “Schedule F,” that will make it easier to remove federal employees it believes are undercutting President Trump's agenda.",
    "url": "https://www.axios.com/2025/04/18/trump-federal-workers-schedule-f-firings"
  },
  {
    "text": "Trump is wrapping up 100 days of historic failure  —  America has seen ruinous periods, but never when the president was the one knowingly causing the ruin.  —  By any reasonable measure, President Donald Trump's first 100 days will be judged an epic failure.  —  He has been a legislative failure.",
    "url": "https://www.washingtonpost.com/opinions/2025/04/18/trump-100-days-failure/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0OTQ4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2MzMxMTk5LCJpYXQiOjE3NDQ5NDg4MDAsImp0aSI6IjU5YzE0NzczLWJlYmItNDUzZi1hOGZkLWE3ODYxNTFiYmIxYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA0LzE4L3RydW1wLTEwMC1kYXlzLWZhaWx1cmUvIn0.KRNKLRGdKtW8a0iF-_VbzPaSTFQKKiAkGMLNAZmx1zQ&itid=gfta"
  },
  {
    "text": "New Trump policy to speed deportations cannot be implemented, US judge rules  —  A U.S. judge on Friday barred the Trump administration from implementing a new policy allowing it to rapidly deport hundreds if not thousands of migrants to countries other than their own without giving them a chance … ",
    "url": "https://www.reuters.com/world/us/new-trump-policy-speed-deportations-cannot-be-implemented-us-judge-rules-2025-04-18/"
  },
  {
    "text": "Trump administration eyes elimination of program that helps low-income people heat and cool their homes  —  The Trump administration is considering support for the end of a program that helps low-income people heat and cool their homes.  —  A draft budget request document reviewed … ",
    "url": "https://thehill.com/policy/energy-environment/5255650-trump-administration-considering-low-income-home-energy-assistance-program-elimination/"
  },
  {
    "text": "What to know about the nationwide ‘50501’ protests planned against Trump  —  Organizers say the demonstrations are expected in cities across the U.S., focused on different issues and include ‘day of action’ community service elements.  —  A national action against the Trump administration's policies … ",
    "url": "https://www.washingtonpost.com/nation/2025/04/18/50501-protests-anti-trump-movement-hands-off/"
  },
  {
    "text": "Records Related to the Assassination of Senator Robert F. Kennedy  —  On This Page  —  The National Archives' Role in Fulfilling Executive Order 14176  —  How is the National Archives Making These Records Available?  —  2025 Release  — Other Records Related to RFK  — Contact Us",
    "url": "https://www.archives.gov/research/rfk"
  },
  {
    "text": "Senator Warren demands documents outlining basis ‘or lack thereof’ of Tufts' student's immigration detention  —  In a letter sent Thursday, Massachusetts Senator Elizabeth Warren demanded documentation from the federal government explaining its rationale for detaining Rümeysa Öztürk … ",
    "url": "https://www.bostonglobe.com/2025/04/18/metro/senator-warren-demands-documents-outlining-basis-or-lack-thereof-tufts-students-immigration-detention/"
  },
  {
    "text": "House Democrats fume at David Hogg's plan to oust lawmakers  —  Democratic National Committee vice chair David Hogg's plan to spend $20 million to primary older Democratic incumbents in Congress has sparked intense anger from some lawmakers.  —  Why it matters: House Democrats told Axios that … ",
    "url": "https://www.axios.com/2025/04/18/house-democrats-david-hogg-primary-dnc"
  },
  {
    "text": "'I don't want to give money to this America': tourists' fears of US travel under Trump  —  With US visits down 11.6% in March compared with last year, people share their views and experiences on the US border  —  Last year, while Joe Biden was US president, Jenny and her husband booked a trip to Boston for June 2025.",
    "url": "https://www.theguardian.com/us-news/2025/apr/18/america-tourists-fears-us-travel-trump"
  },
  {
    "text": "13 Trump Voters on the Highs and Lows of His Term So Far  —  “There's a lot of social media saying: Hey, are you Republicans or MAGA people regretting your vote?  And no, I'm not,” one participant told us in Opinion's latest conversation with voters in our America in Focus series.",
    "url": "https://www.nytimes.com/interactive/2025/04/18/opinion/trump-approval-focus-group.html"
  },
  {
    "text": "Get Out by Good Friday, Feds Say to Afghan Christians  —  The Department of Homeland Security has revoked immigration status of some Afghans who fled to the U.S.  —  The first time a young Christian from Afghanistan heard music at a church service where he understood at least some of the language … ",
    "url": "https://thedispatch.com/article/afghanistan-christians-good-friday-trump-administration/"
  },
  {
    "text": "Strange sell-off in the dollar raises the specter of investors losing trust in the US under Trump  —  Among the threats tariffs pose to the U.S. economy, none may be as strange as the sell-off in the dollar.  Currencies rise and fall all the time because of inflation fears, central bank moves and other factors.",
    "url": "https://apnews.com/article/dollar-trump-tariffs-trade-safe-haven-china-c108fd36a3122f85872ad34ba5f5d977"
  },
  {
    "text": "Trump's War on Measurement Means Losing Data on Drug Use, Maternal Mortality, Climate Change and More  —  More children ages 1 to 4 die of drowning than any other cause of death.  Nearly a quarter of adults received mental health treatment in 2023, an increase of 3.4 million from the prior year.",
    "url": "https://www.propublica.org/article/trump-doge-data-collection-hhs-epa-cdc-maternal-mortality"
  },
  {
    "text": "Rubio's firing of Marocco ignites a MAGA world meltdown  —  When Marco Rubio fired the man in charge of dismantling USAID, he made enemies inside the MAGA movement.  —  Peter Marocco, the Trump administration official in charge of dismantling USAID, left a meeting at the White House last week … ",
    "url": "https://www.politico.com/news/2025/04/18/marco-rubio-peter-marocco-usaid-firing-00297812"
  },
  {
    "text": "Why You Should Fear a Trumpified Fed  —  Don't give an abuser power that's easy to abuse  —  Sometimes the Federal Reserve has extraordinary power over the economy.  —  Consider what happened from 1982 to 1984.  For most of 1982 the U.S. economy was in grim shape.  Employment had plunged, especially in manufacturing.",
    "url": "https://paulkrugman.substack.com/p/why-you-should-fear-a-trumpified"
  },
  {
    "text": "MAGA ‘Mean Girls’ are Trump's loyal foot soldiers  —  Donald Trump 2.0 is the first “I can do anything” president.  To facilitate that governing philosophy, his squad of four powerful female enablers mirror his cocky, bullying leadership style of never backing down and never admitting mistakes.",
    "url": "https://thehill.com/opinion/campaign/5254962-maga-mean-girls-are-trumps-loyal-foot-soldiers/"
  }
]