[
  {
    "text": "Schiff calls on Biden to drop out, citing ‘serious concerns’ he can't win  —  Rep. Adam B. Schiff (D-Burbank), who is running for U.S. Senate in California, is calling for President Biden to drop out of the presidential race, he said in an exclusive statement Wednesday to The Times.",
    "url": "https://www.latimes.com/politics/story/2024-07-17/schiff-calls-on-biden-to-drop-out-citing-serious-concerns-that-he-can-win"
  },
  {
    "text": "Nearly two-thirds of Democrats want Biden to withdraw, new AP-NORC poll finds … Nearly two-thirds of Democrats say President Joe Biden should withdraw from the presidential race and let his party nominate a different candidate, according to a new poll, sharply undercutting his post-debate claim that … ",
    "url": "https://apnews.com/article/biden-trump-poll-drop-out-debate-democrats-59eebaca6989985c2bfbf4f72bdfa112"
  },
  {
    "text": "Biden Says He'd Consider Dropping Out if a ‘Medical Condition’ Emerged  —  President Biden has said none of his doctors have told him he has a serious medical condition.  But his debate performance last month raised questions about his health and acuity.  —  President Biden said in an … ",
    "url": "https://www.nytimes.com/2024/07/17/us/politics/biden-health-election-drop-out.html"
  },
  {
    "text": "Playbook: New polling bolsters ‘Dump Biden’ push  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  FIRST IN PLAYBOOK: WHAT DEMOCRATS ARE READING — This polling memo (h/t JMart) from BlueLabs Analytics is circulating among party officials still keen … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/17/new-polling-bolsters-dump-biden-push-00168943"
  },
  {
    "text": "A new kind of Republican Party is forming at the RNC  —  The GOP is dramatically transforming.  Just listen carefully to the RNC.  —  MILWAUKEE — A new kind of Republican Party is revealing itself at its national convention.  —  All the markers of a MAGA jamboree are on display … ",
    "url": "https://www.politico.com/news/2024/07/17/rnc-republican-party-transformation-maga-00168933"
  },
  {
    "text": "J.D. Vance's Stunning Admission About Trump Spells Trouble for MAGA  —  Now that Ohio Senator J.D. Vance is Donald Trump's running mate, everyone is combing through his old quotes, and a striking one has surfaced: In 2016, Vance warned that Trump threatened to take the white working class to a “very dark place.”",
    "url": "https://newrepublic.com/article/183904/jd-vances-stunning-admission-trump-spells-trouble-maga"
  },
  {
    "text": "‘Scared to Death’: GOP Security Hawks Slam Vance Selection  —  By choosing the Ukraine-skeptic Ohio senator, Trump accelerates his party's rejection of its Reaganite roots.  —  MILWAUKEE —  Former President Donald Trump didn't just select a running mate here - he doused political kerosene … ",
    "url": "https://www.politico.com/news/magazine/2024/07/17/jd-vance-reagan-gop-foreign-policy-00168862"
  },
  {
    "text": "DNC letter says virtual roll call to nominate Biden will happen in August  —  The Democratic National Committee has determined that a virtual roll call vote to formally nominate President Biden as the party's nominee will happen in August, according to a letter sent Wednesday by the heads of the convention rules committee.",
    "url": "https://www.cbsnews.com/news/democratic-national-committee-letter-joe-biden-virtual-roll-call/"
  },
  {
    "text": "Scoop: House Democrats scrap letter opposing early DNC vote … - Rep. Jared Huffman (D-Calif.) told Axios the letter is being scrapped after party officials said earlier on Wednesday that the virtual roll call would not be held before August.  — “We've achieved what we wanted here,” … ",
    "url": "https://www.axios.com/2024/07/17/house-democrats-dnc-letter-biden-vote"
  },
  {
    "text": "Biden Group Therapy  —  Fresh reporting on the collective private mourning of top Democrats after the tragic “events”—as they are known in Washington-speak—of the weekend.  Nevertheless, some cling to hope.  “He also said he would drop if he saw data saying he can't win,” said a campaign source.",
    "url": "https://puck.news/biden-saturday-zoom-call-with-house-democrats-goes-off-the-rails/"
  },
  {
    "text": "Andreessen Horowitz co-founders explain why they're supporting Trump  —  Marc Andreessen, the co-founder of one of the most prominent venture capital firms in Silicon Valley, says he's been a Democrat most of his life.  He says he has endorsed and voted for Bill Clinton, Al Gore, John Kerry, Barack Obama and Hillary Clinton.",
    "url": "https://techcrunch.com/2024/07/16/andreessen-horowitz-co-founders-explain-why-theyre-supporting-trump/"
  },
  {
    "text": "Former Trump adviser Peter Navarro released from prison after serving 4 months for contempt of Congress  —  Former Donald Trump White House adviser Peter Navarro was released from a Miami federal prison Wednesday after completing his four-month sentence for defying a subpoena from the January 6 congressional committee.",
    "url": "https://www.cnn.com/2024/07/17/politics/peter-navarro-released-from-prison-contempt"
  },
  {
    "text": "GOP Platform Author Admits There's a National Ban  —  Click to skip ahead: In WTF NYT, the paper of record deceptively edited a quote.  In the States, news out of Ohio, Michigan, Montana and more.  I Told Ya So on the GOP's abortion plank.  Ballot Measure Updates has more on the financial impact statement fight in Florida.",
    "url": "https://jessica.substack.com/p/gop-platform-author-admits-theres"
  },
  {
    "text": "The phony populism of JD Vance  —  It's a cynical branding exercise. … Trump chose JD Vance as his running mate this week, and a certain segment of the news media immediately rushed to declare the start of a new kind of working-class Republicanism.  —  “JD Vance pick unnerves GOP's business elite … ",
    "url": "https://www.publicnotice.co/p/jd-vance-phony-populism-trump"
  },
  {
    "text": "Most Americans support Supreme Court reforms  —  Most Americans also disapprove of the job the court is doing.  —  The Washington Post reported on Tuesday that President Biden has warmed to the idea of reforming the Supreme Court.  At the beginning of his term, pressure from the base … ",
    "url": "https://www.washingtonpost.com/politics/2024/07/17/most-americans-support-supreme-court-reforms/"
  },
  {
    "text": "Boiled Frog Journalism: Is Trump an Agent of Saudi Arabia, and Other Pressing Questions Buried under Biden's Age  —  A jury found Robert Menendez guilty on all charges yesterday, including those alleging he accepted payments from Egypt and Qatar (I didn't follow the trial closely enough … ",
    "url": "https://www.emptywheel.net/2024/07/17/boiled-frog-journalism-is-trump-an-agent-of-saudi-arabia-and-other-pressing-questions-buried-under-bidens-age/"
  },
  {
    "text": "Donald Trump calls for Taiwan to ‘pay’ for its own defence  —  TSMC shares slide after Republican candidate's comments rattle island nation reliant on security guarantee  —  Former US president Donald Trump has said Taiwan should pay the US for its defence guarantees, a statement … ",
    "url": "https://www.ft.com/content/84f8336e-9b8a-4662-a665-47aa3edb6bc9"
  },
  {
    "text": "Germany to halve military aid for Ukraine despite possible Trump White House  —  Germany will halve military aid for Ukraine next year, even with the possibility that Republican candidate Donald Trump could return to the White House and curb support for Kyiv.",
    "url": "https://www.reuters.com/world/europe/germany-halve-military-aid-ukraine-despite-possible-trump-white-house-2024-07-17/"
  },
  {
    "text": "Court ‘Going To Remove’ Aileen Cannon From Trump Case: Anti-MAGA Lawyer  —  's classified documents case will be removed from the proceedings following her latest ruling, a legal expert has said.  —  Ben Meiselas, attorney and frequent Trump critic, hit out at the “horrific” decision from Judge",
    "url": "https://www.newsweek.com/aileen-cannon-removed-trump-classified-documents-jack-smith-1926234"
  },
  {
    "text": "Microsoft laid off a DEI team, and its lead wrote an internal email blasting how DEI is ‘no longer business critical’  — Microsoft laid off a diversity, equity, and inclusion team, citing “changing business needs.”  — The move follows commitments made by Microsoft and other tech firms after the George Floyd protests.",
    "url": "https://www.businessinsider.com/microsoft-layoffs-dei-leader-email-2024-7"
  },
  {
    "text": "J.D. Vance described Alex Jones as a truth teller to the Teneo Network, a Project 2025 partner organization  —  New reporting from ProPublica and Documented revealed that Trump's vice presidential pick, Ohio Sen. J.D. Vance, praised far-right conspiracy theorist Alex Jones as a truth teller during … ",
    "url": "https://www.mediamatters.org/project-2025/jd-vance-described-alex-jones-truth-teller-teneo-network-project-2025-partner"
  },
  {
    "text": "Trump's tariffs mean big opportunities for corruption  —  The White House will be picking winners and losers  —  I didn't write about tariffs or trade policy in Monday's post on the economic implications of a GOP sweep in November.  That's in part because, to the extent any policy issue … ",
    "url": "https://www.slowboring.com/p/trumps-tariffs-mean-big-opportunities"
  },
  {
    "text": "Donald Trump doesn't have stitches after assassination attempt, but a “nice flesh wound,” Eric Trump says  —  Former President Donald Trump's son, Eric Trump, said his father doesn't have stitches after he was shot in an assassination attempt at a rally in Pennsylvania over the weekend … ",
    "url": "https://www.cbsnews.com/news/assassination-attempt-trump-rally-shooting-ear-doesnt-have-stitches-nice-flesh-wound-eric-trump/"
  },
  {
    "text": "Trump calls widow of firefighter who died protecting his family: ‘He was very kind’  —  Helen Comperatore says Trump phoned her on Tuesday after husband Corey was killed in Butler, Pennsylvania  —  The widow of the volunteer firefighter who was shot and killed over the weekend at the Trump rally … ",
    "url": "https://www.foxnews.com/politics/trump-calls-widow-firefighter-who-died-protecting-his-family-he-very-kind"
  },
  {
    "text": "Military officers will get back pay for promotions blocked by Tuberville, senators vow  —  Upcoming negotiations over an annual defense policy bill will see lawmakers debate a measure that would grant back pay to military officers whose promotions were delayed by the Senate.",
    "url": "https://www.al.com/politics/2024/07/military-officers-will-get-back-pay-for-promotions-blocked-by-tuberville-senators-vow.html"
  },
  {
    "text": "MAGA Makes Racist Attacks Against JD Vance's Wife  —  Extremist figures and members of the Make America Great Again movement have criticized the  —  named him as his running mate in the 2024 election.  —  Usha Vance, the daughter of Indian immigrants, was raised in San Diego before meeting her husband at Yale Law School.",
    "url": "https://www.newsweek.com/jd-vance-wife-attacks-maga-trump-running-mate-1926194"
  }
]