[
  {
    "text": "Trump Directs Justice Dept. to Investigate ActBlue, Democrats' Cash Engine  —  The president ordered an inquiry into ActBlue, the main Democratic fund-raising platform, in his latest move using the government to target political opponents.  —  President Trump on Thursday directed … ",
    "url": "https://www.nytimes.com/2025/04/24/us/politics/trump-actblue-democrats.html"
  },
  {
    "text": "Trump to target Democratic fundraising powerhouse ActBlue with DOJ probe  —  President Donald Trump is slated to issue a memorandum on Thursday targeting ActBlue, the Democratic Party's main fundraising platform - taking aim at one of the key pillars of the financial infrastructure for Democratic candidates.",
    "url": "https://cnn.com/2025/04/24/politics/actblue-trump-memo-doj-probe/"
  },
  {
    "text": "Polygraph Threats, Leaks and Infighting: Pentagon Chaos Rattles Hegseth  —  Defense secretary has chastised top military officers and staffers as he seeks to quiet a storm he helped create  —  WASHINGTON—Defense Secretary Pete Hegseth was rattled.  —  Word had leaked that he was planning … ",
    "url": "https://www.wsj.com/politics/national-security/pete-hegseth-pentagon-fired-aides-cfa9e0d5?st=2DDS8u"
  },
  {
    "text": "Pentagon leadership vacuum overwhelms Hegseth's office: 'It's a free-for-all'  —  The departure of the Defense secretary's top advisers has left the first-time government official without senior staff who understand Washington.  —  The circle of top advisers in Defense Secretary Pete Hegseth's orbit … ",
    "url": "https://www.politico.com/news/2025/04/24/hegseth-pentagon-leadership-vacuum-00308620"
  },
  {
    "text": "Hegseth had an unsecured internet line set up in his office to connect to Signal, AP sources say  —  Defense Secretary Pete Hegseth had an internet connection that bypassed the Pentagon's security protocols set up in his office to use the Signal messaging app on a personal computer … ",
    "url": "https://apnews.com/article/hegseth-signal-chat-dirty-internet-line-6a64707f10ca553eb905e5a70e10bd9d"
  },
  {
    "text": "Hegseth used Signal app connected to ‘dirty line’ on personal computer in Pentagon office: Sources  —  It was connected to the internet on an unsecured commercial line, sources said.  —  Secretary of Defense Pete Hegseth attends a meeting of the Eradicating Anti-Christian Bias Task Force … ",
    "url": "https://abcnews.go.com/Politics/hegseth-signal-app-connected-dirtly-line-computer-pentagon/story?id=121142551"
  },
  {
    "text": "Trump Tells Putin to ‘STOP!’  After Deadly Russian Attack on Kyiv  —  The attack, which killed at least 12 people, was the deadliest on Ukraine's capital in nearly a year.  President Trump called on President Vladimir V. Putin to “STOP!” in a post on social media.",
    "url": "https://www.nytimes.com/2025/04/24/world/europe/ukraine-kyiv-russia-attack.html"
  },
  {
    "text": "Elon Musk and DOGE's Savings May Be Erased by New Costs  —  An expert on the federal work force estimates that the speed and chaos of Mr. Musk's cuts to the bureaucracy will cost taxpayers $135 billion this fiscal year.  —  President Trump and Elon Musk promised taxpayers big savings … ",
    "url": "https://www.nytimes.com/2025/04/24/us/politics/musk-cuts.html?unlocked_article_code=1.CE8.vMmE.oMshBwTC3mC8&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump pardons Nevada politician who paid for cosmetic surgery with funds to honor a slain officer  —  President Donald Trump has pardoned a Nevada Republican politician who was awaiting sentencing on federal charges that she used money meant for a statue honoring a slain police officer for personal costs, including plastic surgery.",
    "url": "https://apnews.com/article/trump-pardon-michele-fiore-nevada-fraud-cf56ef8b302b8111e47cf52d5a606d19"
  },
  {
    "text": "How Trump team turned a dinner invite into a crypto boon worth millions  —  Nearly two dozen crypto wallets acquired more than 100,000 $TRUMP meme coins, worth roughly $100 million, after its promoters said top buyers could join the president for dinner.  —  Buyers have poured tens of millions … ",
    "url": "https://www.washingtonpost.com/technology/2025/04/24/trump-trump-memecoin-cryto/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NDY3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2ODQ5NTk5LCJpYXQiOjE3NDU0NjcyMDAsImp0aSI6ImU2MzFmMjVlLTQ2NWYtNGJiZi05ZGYyLTQ3ODFiMzk0NGYzOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDQvMjQvdHJ1bXAtdHJ1bXAtbWVtZWNvaW4tY3J5dG8vIn0.twE8VExxCbf2pw4qfDwExNmPBhsGSNgyP24sMZeSoqE&itid=gfta"
  },
  {
    "text": "Judge halts parts of Trump's overhaul of US elections, including proof-of-citizenship requirement  —  A judge on Thursday blocked the Trump administration from immediately enacting certain changes to how federal elections are run, including adding a proof-of-citizenship requirement to the federal voter registration form.",
    "url": "https://apnews.com/article/trump-elections-executive-order-citizenship-lawsuit-4b683fe2e1106316fdb05621be9b7d0e"
  },
  {
    "text": "Federal Officials Promise to Restore Funding to Women's Health Initiative  —  Investigators had been informed that funding for the decades-long research effort would be slashed.  Officials said on Thursday evening that grants would be restored.  —  Following an outcry from scientists and health experts … ",
    "url": "https://www.nytimes.com/2025/04/24/health/womens-health-initiative-cuts.html?unlocked_article_code=1.CE8.2prR._hhjEWBLktfy&smid=nytcore-android-share"
  },
  {
    "text": "U.S. Sidelines Lawyers Who Doubted Their Own Case on Congestion Pricing  —  The Trump administration replaced lawyers who had exposed flaws in its legal battle over New York City's congestion pricing program.  —  The U.S. Department of Transportation on Thursday said it took the extraordinary step … ",
    "url": "https://www.nytimes.com/2025/04/24/nyregion/nyc-congestion-pricing-duffy-lawyers.html?unlocked_article_code=1.CE8.vgqL.VKDKYVyrggAf"
  },
  {
    "text": "The Trump Victim I Can't Stop Thinking About  —  I understand why Kilmar Abrego Garcia has become the face of Donald Trump's monstrous policy of sending migrants to a gulag in El Salvador.  In a court filing, the administration's own lawyers initially admitted that his deportation was an … ",
    "url": "https://www.nytimes.com/2025/04/24/opinion/trump-el-salvador-makeup-artist.html?unlocked_article_code=1.CU8.9Zkg.GcAWP4Xh3YyP&smid=url-share"
  },
  {
    "text": "Trump officials consider shrinking 6 national monuments in the West  —  Interior Department officials are considering scaling back the boundaries of national monuments in the West to encourage energy development on public lands.  —  Trump officials are analyzing whether to remove federal protections … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/04/24/trump-national-monument-reductions-mining-oil/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NDY3MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ2ODQ5NTk5LCJpYXQiOjE3NDU0NjcyMDAsImp0aSI6ImQzOWVjOGMzLTZjNmItNDk5ZC04NDJiLTMxYTIyOWUwYWExNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9jbGltYXRlLWVudmlyb25tZW50LzIwMjUvMDQvMjQvdHJ1bXAtbmF0aW9uYWwtbW9udW1lbnQtcmVkdWN0aW9ucy1taW5pbmctb2lsLyJ9.wP-Fnw4MScMLmpVidhArWpAqfbxFCGOsnZwfIe623K4&itid=gfta"
  },
  {
    "text": "Exclusive: Documents show differences over U.S. peace drive for Ukraine  —  Ukrainian and European officials pushed back this week against some U.S. proposals on how to end Russia's war in Ukraine, making counterproposals on issues from territory to sanctions, according to the full texts of the proposals seen by Reuters.",
    "url": "https://www.reuters.com/world/documents-show-differences-over-us-peace-drive-ukraine-2025-04-25/"
  },
  {
    "text": "Trump Takes His Biggest Step Yet Toward Restoring Meritocracy  —  The administration's executive order eliminating disparate-impact theory restores the 1964 Civil Rights Act to its original meaning.  —  Measured in Trump time, it took them eons to get around to it, but the White House … ",
    "url": "https://www.city-journal.org/article/trump-restoring-meritocracy-executive-order-disparate-impact-theory-civil-rights"
  },
  {
    "text": "Exclusive: NSF director to resign amid grant terminations, job cuts, and controversy  —  “I have done all I can,” says Sethuraman Panchanathan, a Trump appointee who has led agency since 2020  —  The director of the National Science Foundation (NSF) announced his resignation today … ",
    "url": "https://www.science.org/content/article/nsf-director-resign-amid-grant-terminations-job-cuts-and-controversy"
  },
  {
    "text": "Trump to be in third-tier seats at Pope's funeral  —  Arcane Vatican protocol suggests US president may have to settle for a place away from the limelight  —  Donald Trump may be the most famous person on the planet and leader of the free world, but he could be deeply disappointed when he sees … ",
    "url": "https://www.telegraph.co.uk/news/2025/04/24/trump-to-be-in-third-tier-seats-at-popes-funeral/"
  },
  {
    "text": "Slotkin is testing a ‘war plan’ to beat Trump.  She wants Dems to ditch wokeness and muscle up  —  The Michigan senator will give the first in a series of political speeches on Thursday.  —  Elissa Slotkin, the former CIA analyst turned battleground senator, will on Thursday start road-testing … ",
    "url": "https://www.politico.com/news/2025/04/24/slotkin-has-a-war-plan-to-beat-trump-dont-be-weak-and-woke-00308176"
  },
  {
    "text": "Investigation into Unlawful “Straw Donor” and Foreign Contributions in American Elections  —  MEMORANDUM FOR THE SECRETARY OF THE TREASURY  —  THE ATTORNEY GENERAL THE COUNSEL TO THE PRESIDENT  —  Federal law (52 U.S.C. 30121 and 30122) strictly prohibits making political contributions … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/investigation-into-unlawful-straw-donor-and-foreign-contributions-in-american-elections/"
  },
  {
    "text": "Hanoi denies Washington will snub Vietnam War commemoration  —  The Vietnamese government says it expects American officials to attend ceremonies, in spite of a US media report.  —  BANGKOK - The Vietnamese government says it is expecting a sizable U.S. presence when it marks the 50th anniversary … ",
    "url": "https://www.rfa.org/english/vietnam/2025/04/25/us-war-ceremony-snub/"
  },
  {
    "text": "Ex-judge, wife into custody after claims of hosting Tren de Aragua member in Las Cruces  —  LAS CRUCES, N.M. (KFOX14/CBS4) — A former judge and his wife were taken into custody after authorities raided their home in Las Cruces following accusations that they had an alleged Tren de Aragua member living in their home.",
    "url": "https://kfoxtv.com/news/local/home-of-ex-judge-raided-after-claims-of-hosting-tren-de-aragua-gang-member-in-las-cruces-cristhian-ortega-lopez-dona-ana-county-venezuela-joel-cano-nancy-tda-nm-hsi-homeland-security"
  },
  {
    "text": "Tuberville running for Governor of Alabama in 2026  —  U.S. Senator Tommy Tuberville (R-Auburn) is running for Governor of Alabama in 2026, according to reports confirmed by Yellowhammer News.  —  Back in state while Congress is in recess, Tuberville told a group of donors at a private event … ",
    "url": "https://yellowhammernews.com/tuberville-running-for-governor-of-alabama-in-2026/"
  },
  {
    "text": "Trump's Single Stroke of Brilliance  —  I've detested at least three-quarters of what the Trump administration has done so far, but it possesses one quality I can't help admiring: energy.  I don't know which cliché to throw at you, but it is flooding the zone, firing on all cylinders, moving rapidly on all fronts at once.",
    "url": "https://www.nytimes.com/2025/04/24/opinion/trump-administration-energy-strength-weakness.html"
  },
  {
    "text": "Trump grants interview to The Atlantic's Jeffrey Goldberg despite Signal chat bombshell, past criticism  —  He has attacked The Atlantic editor for what he claims are false stories.  —  President Donald Trump waits for the arrival of Norway's Prime Minister Jonas Gahr Store to the White House on April 24, 2025.",
    "url": "https://abcnews.go.com/Politics/trump-meet-atlantics-jeffrey-goldberg-interview-despite-signal/story?id=121128726"
  },
  {
    "text": "Bill Maher Fires Back at Larry David for ‘My Dinner With Adolf’ Essay Spoofing His Trump Meeting: 'It's Kind of Insulting to Six Million Dead Jews'  —  New rule: if you're going to satirize me in the New York Times, then I'm going to respond to you on Piers Morgan Uncensored.",
    "url": "https://variety.com/2025/tv/news/bill-maher-larry-david-spoofing-trump-insulting-1236377639/"
  },
  {
    "text": "JEI Poll: 72 Percent of US Jews Disapprove of Trump's Performance  —  By nearly a three to one margin, American Jews say they don't approve of the job that President Donald Trump is doing (72% to 24%) and think the country is moving in the wrong direction (72% and 23%), according to a new poll from the Jewish Electorate Institute.",
    "url": "https://www.newsmax.com/politics/poll-jews-u-s/2025/04/24/id/1208144/"
  },
  {
    "text": "DNC chair rips vice chair David Hogg's plan to challenge incumbent Democrats  —  Democratic National Committee Chair Ken Martin said Thursday that party officers should be banned from taking sides in primaries, countering DNC Vice Chair David Hogg's plan to raise money for candidates challenging Democratic incumbents.",
    "url": "https://apnews.com/article/david-hogg-ken-martin-dnc-incumbents-challenge-17af67b0e56813e383cd3beef327e858"
  },
  {
    "text": "If A.I. Systems Become Conscious, Should They Have Rights?  —  As artificial intelligence systems become smarter, one A.I. company is trying to figure out what to do if they become conscious.  —  One of my most deeply held values as a tech columnist is humanism.",
    "url": "https://www.nytimes.com/2025/04/24/technology/ai-welfare-anthropic-claude.html?https://www.nytimes.com/2025/04/24/technology/ai-welfare-anthropic-claude.html"
  }
]