[
  {
    "text": "The Only Patriotic Choice for President  —  It is hard to imagine a candidate more unworthy to serve as president of the United States than Donald Trump.  He has proved himself morally unfit for an office that asks its occupant to put the good of the nation above self-interest.",
    "url": "https://www.nytimes.com/2024/09/30/opinion/editorials/kamala-harris-2024.html"
  },
  {
    "text": "I help oversee federal elections.  Mike Johnson's words threaten our democracy.  —  It is disturbingly clear that the Republican Party is setting the stage to once again attempt to overturn a lawful American election.  —  It is disturbingly clear that the Republican Party … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/mike-johnson-election-denialism-congress-2024-results-rcna172657"
  },
  {
    "text": "‘Trump Is a Scab’: Harris Campaign Fumes Over Trump's Wild Anti-Overtime Rant  —  'I WOULDN'T PAY'  —  The former president admitted he “shouldn't say this” at a rally in Pennsylvania—just minutes before the Harris campaign highlighted the comments.  —  Former president Donald Trump openly admitted … ",
    "url": "https://www.thedailybeast.com/trump-is-a-scab-harris-campaign-fumes-over-trumps-wild-anti-overtime-rant"
  },
  {
    "text": "Top Republicans disavow Trump's ‘mentally disabled’ attacks on Harris  —  Lindsey Graham pushes back on ex-president's remarks as Minnesota's Emmer says ‘we should stick on the issues’  —  Senior Republicans distanced themselves Sunday from comments made by Donald Trump at campaign stops … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/29/trump-republicans-mentally-disabled-comments-harris"
  },
  {
    "text": "Fact check: 12 election lies Trump is using to set the stage to dispute a potential 2024 defeat  —  Former President Donald Trump has escalated his long-running assault on the integrity of US elections as the 2024 presidential campaign enters its final stretch, using a new series of lies about ballots … ",
    "url": "https://www.cnn.com/2024/09/30/politics/fact-check-trump-election-lies-2024"
  },
  {
    "text": "Republicans lay legal groundwork for election challenges  —  In Arizona, one of seven competitive U.S. states that are expected to decide the 2024 presidential election, an advocacy group founded by Donald Trump adviser Stephen Miller is advancing a bold legal theory: that judges can throw … ",
    "url": "https://www.reuters.com/world/us/legal-blitz-republicans-lay-groundwork-us-election-challenges-2024-09-29/"
  },
  {
    "text": "Trump preps catalog of “cheating” claims for potential election loss … - Overseas voting: Trump falsely claimed Monday that Democrats are exploiting an overseas ballot program for expats and military members in order to circumvent “any citizenship check or verification of identity.”",
    "url": "https://www.axios.com/2024/09/29/trump-voter-fraud-2024-election"
  },
  {
    "text": "Kris Kristofferson, Country Music Legend and ‘A Star Is Born’ Leading Man, Dies at 88  —  Kris Kristofferson, who attained success as both a groundbreaking country music singer-songwriter and a Hollywood film and TV star, died Saturday at home in Maui, Hawaii.",
    "url": "https://variety.com/2024/film/obituaries-people-news/kris-kristofferson-dead-country-music-legend-actor-1236159472/"
  },
  {
    "text": "Trump says ‘violent day’ of policing will end crime  —  The remarks at a campaign rally Sunday did not amount to a policy proposal allowing police retaliation, the former president's campaign said.  —  Former President Donald Trump on Sunday called for “one real rough, nasty” and “violent day” … ",
    "url": "https://www.politico.com/news/2024/09/29/trump-violent-day-policing-crime-00181619"
  },
  {
    "text": "Trump Suggests Terrifying Solution To Ending Crime: The Purge  —  His dangerous solution came on the heels of him repeating the false, fearmongering claim that crime is skyrocketing.  —  LOADING  —  At a rally on Sunday in Erie, Pennsylvania, Trump casually seemed to suggest that one day of violence would put an end to crime.",
    "url": "https://www.huffpost.com/entry/donald-trump-solution-crime-the-purge_n_66f9b7c8e4b019aae3aa34a3"
  },
  {
    "text": "What Tim Walz's past debate performances reveal about how he may take on JD Vance  —  Tim Walz gazed into the television camera and sped through a seemingly rehearsed set of points he was hoping to drive home in one of his first political debates, just days before the 2006 election … ",
    "url": "https://www.npr.org/2024/09/30/nx-s1-5130194/tim-walz-jd-vance-vice-presidential-debate"
  },
  {
    "text": "Rasmussen Found To Be Secretly Colluding With Trump Campaign  —  There's a reason why 538 doesn't use Rasmussen in their polling aggregates anymore, and this is just more evidence why: they can't be trusted.  Meanwhile, conservative sites like Real Clear Politics rely heavily on Rasmussen … ",
    "url": "https://crooksandliars.com/2024/09/rasmussen-found-be-secretly-colluding"
  },
  {
    "text": "Kamala Harris Raises $55 Million in California Fundraisers  — Events in San Francisco, Los Angeles pad advantage over Trump  — Vice president urges celebrity attendees to activate networks  —  Kamala Harris raised about $55 million in high-dollar events in California this weekend … ",
    "url": "https://www.bloomberg.com/news/articles/2024-09-30/kamala-harris-raises-55-million-in-san-francisco-la-fundraisers"
  },
  {
    "text": "Kamala Harris may be the first Democratic presidential nominee to win seniors since Al Gore  —  We've heard a lot about the groups of voters that Kamala Harris seems to be struggling with — or at least not doing as well as Joe Biden did with them four years ago.",
    "url": "https://www.cnn.com/2024/09/29/politics/kamala-harris-senior-voters-election-analysis/"
  },
  {
    "text": "Scoop: Rep. Elissa Slotkin warns Harris is “underwater” in Michigan … - FiveThirtyEight's average of polls has Harris up by about 2.4 points in Michigan. … - Michigan is also a top pickup opportunity for Senate Republicans, with millions of dollars now flooding the race between Slotkin and former Rep. Mike Rogers (R-Mich.).",
    "url": "https://www.axios.com/2024/09/29/michigan-senate-race-slotkin-harris"
  },
  {
    "text": "Britt says she thinks Putin ‘respects’ Trump  —  Sen. Katie Britt (R-Ala.) said in a Sunday interview she thinks Russian President Vladimir Putin “respects” former President Trump.  —  “Look, there is a reason that President Putin only invaded Ukraine under Obama-Biden, and then again … ",
    "url": "https://thehill.com/homenews/campaign/4906311-katie-britt-putin-trump/"
  }
]