[
  {
    "text": "Amazon to display tariff costs for consumers  —  Amazon doesn't want to shoulder the blame for the cost of President Donald Trump's trade war.  —  So the e-commerce giant will soon show how much Trump's tariffs are adding to the price of each product, according to a person familiar with the plan.",
    "url": "https://punchbowl.news/article/tech/amazon-display-tariff-costs/"
  },
  {
    "text": "Trump complained to Bezos before Amazon said it scrapped idea to display tariff cost … WATCH NOW  —  The White House on Tuesday slammed Amazon for reportedly planning to display the cost of President Donald Trump's tariffs next to the total price of products on its site.",
    "url": "https://www.cnbc.com/2025/04/29/white-house-blasts-amazon-over-tariff-cost-report-hostile-and-political-act.html"
  },
  {
    "text": "A ‘p*ssed’ Trump called Jeff Bezos after learning Amazon considered breaking out a tariff charge  —  New York CNN  —  The White House took aggressive aim at Amazon, with President Donald Trump putting in a call to Amazon founder Jeff Bezos Tuesday morning, after the company considered displaying … ",
    "url": "https://cnn.com/2025/04/29/business/white-house-calls-report-that-amazon-is-adding-a-tariff-charge-a-hostile-action/"
  },
  {
    "text": "Trump praises Bezos after Amazon denies plan to show tariffs' costs  —  Amazon said staff had considered listing tariff costs on its Temu competitor, Amazon Haul, but that it's “not going to happen.”  The Trump administration had condemned the idea.  —  White House: Reported Amazon tariff note would be ‘hostile’",
    "url": "https://www.washingtonpost.com/business/2025/04/29/amazon-trump-tariffs-leavitt/"
  },
  {
    "text": "Trump Fires Biden Appointees, Including Doug Emhoff, From Holocaust Museum  —  “Holocaust remembrance and education should never be politicized,” Mr. Emhoff said in reaction to the removal of him and senior Biden White House officials from the board that oversees the museum.",
    "url": "https://www.nytimes.com/2025/04/29/us/politics/trump-doug-emhoff-holocaust-museum-biden.html"
  },
  {
    "text": "Exclusive: Most Americans see Trump as “dangerous dictator,” poll says  —  A majority of Americans say President Trump is a “dangerous dictator” who poses a threat to democracy and believe he's overstepped his authority by actions such as the mass firing of federal employees, a new survey says.",
    "url": "https://www.axios.com/2025/04/29/prri-poll-most-americans-trump-dangerous-dictator"
  },
  {
    "text": "Trump is the Godfather in Reverse  —  Late post today: I'm still in Portugal and couldn't work on it yesterday because the power was out!  —  Yesterday's election in Canada was a bit closer than polls predicted.  Nonetheless, Mark Carney's Liberal Party, which appeared doomed just two months ago, won a solid victory.",
    "url": "https://paulkrugman.substack.com/p/trump-is-the-godfather-in-reverse"
  },
  {
    "text": "Paramount Board Clears Possible Path for Settling Trump's ‘60 Minutes’ Lawsuit  —  Paramount's interest in settling has dismayed CBS's news division.  The executive producer of “60 Minutes” abruptly resigned last week.  —  Lawyers for President Trump and Paramount, the parent of CBS News … ",
    "url": "https://www.nytimes.com/2025/04/29/business/media/paramount-cbs-60-minutes-trump-lawsuit.html"
  },
  {
    "text": "Judge Hannah Dugan has all-star legal team, including ‘LeBron James of lawyers’  — Former U.S. Attorney Steven Biskupic and former U.S. Solicitor General Paul Clement lead Judge Hannah Dugan's defense team.  — The prosecution is led by Assistant U.S. Attorneys Keith Alexander and Kelly Brown Watkza.",
    "url": "https://eu.jsonline.com/story/news/local/2025/04/29/see-the-legal-players-in-the-case-against-milwaukee-judge-hannah-dugan/83327855007/"
  },
  {
    "text": "Wisconsin high court suspends Milwaukee judge accused of helping man evade immigration authorities  —  The Wisconsin Supreme Court has suspended a judge accused of helping a man evade immigration authorities.  The FBI took Milwaukee County Circuit Judge Hannah Dugan into custody on Friday morning at the county courthouse.",
    "url": "https://apnews.com/article/milwaukee-judge-arrested-supreme-court-suspended-49f25ea7702d3211719f926f8cfc90b7"
  },
  {
    "text": "Don Bacon sets $500B red line on Medicaid  —  The Nebraska Republican is a key player in GOP megabill negotiations.  —  Rep. Don Bacon, a key GOP moderate, is drawing a red line on Medicaid cuts.  —  The Nebraska Republican has privately told the White House he won't accept more than $500 billion … ",
    "url": "https://www.politico.com/news/2025/04/29/don-bacon-sets-500-billion-red-line-on-medicaid-00315397"
  },
  {
    "text": "Corporation for Public Broadcasting sues Trump after he tries to fire board members  —  President Trump opened up a new front in his assault on public media on Monday, asserting that he was removing three of the five board members of the Corporation for Public Broadcasting.",
    "url": "https://www.npr.org/2025/04/29/nx-s1-5381045/cpb-board-members-trump-lawsuit-npr-pbs"
  },
  {
    "text": "Why the Antisemitism Awareness Act now has a religious liberty clause to protect ‘Jews killed Jesus’ statements  —  New language in antisemitism bill clarifies First Amendment protections  —  Senate Republicans added an amendment to bipartisan legislation addressing rising antisemitism … ",
    "url": "https://forward.com/fast-forward/716347/antisemitism-bill-congress-jews-jesus/"
  },
  {
    "text": "Native American woman gets a chance to topple Hogg at DNC  —  The Scoop  —  A candidate who failed to win a Democratic National Committee leadership role is challenging her defeat — the first threat to DNC Vice Chair David Hogg since he vowed to keep backing some primary challenges to incumbents.",
    "url": "https://www.semafor.com/article/04/29/2025/native-american-woman-gets-a-chance-to-topple-hogg-at-dnc"
  },
  {
    "text": "Kennedy Advises New Parents to ‘Do Your Own Research’ on Vaccines  —  In an interview with Dr. Phil, the health secretary offered false information about vaccine oversight and revealed a lack of basic understanding of new drug approvals.  —  Health Secretary Robert F. Kennedy Jr. advised parents … ",
    "url": "https://www.nytimes.com/2025/04/29/us/politics/kennedy-vaccines-research.html?unlocked_article_code=1.DU8.q2gO.NNlliA7KviQF&smid=url-share"
  },
  {
    "text": "Fortune 500 company abruptly fires lawyer who helped immigrant family  —  On March 4, Clay Jackson, an attorney in the Dallas area, was at a gas station near his home when the attendant asked if he would help a local immigrant family.  The family's father, who is undocumented … ",
    "url": "https://popular.info/p/fortune-500-company-abruptly-fires"
  },
  {
    "text": "Elon Musk's X lost 11 million users in the EU over the past 5 months  —  Millions of people in France and Germany have left X, according to X itself.  —  X's user base in the European Union is now officially lower than it was prior to Elon Musk's acquisition of the company.",
    "url": "https://mashable.com/article/elon-musk-x-twitter-eu-users-decline"
  },
  {
    "text": "Federal Court Says First Amendment Bars Government From Deporting Students and Faculty on Basis of Political Viewpoint, Says Challenge to Trump Policy Can Go Forward  —  Ruling is a victory for free speech and step towards ending unconstitutional policy across U.S. campuses, Knight Institute says",
    "url": "https://knightcolumbia.org/content/federal-court-says-first-amendment-bars-government-from-deporting-students-and-faculty-on-basis-of-political-viewpoint-says-challenge-to-trump-policy-can-go-forward"
  },
  {
    "text": "House Republican says no way to party's proposal to overhaul federal worker pension  —  The House Oversight and Government Reform Committee will mark up its portion of the GOP megabill Wednesday, and one Republican on the panel is already coming out against it.",
    "url": "https://www.politico.com/live-updates/2025/04/29/congress/mike-turner-says-no-way-to-federal-worker-pension-overhaul-00317333"
  },
  {
    "text": "Target gave $1M to Trump inauguration fund, a first for the company  —  President Donald Trump raised a record amount of cash for his inauguration, including donations from several companies with operations in Minnesota. … Target gave $1 million to President Donald Trump's inaugural fund.",
    "url": "https://www.startribune.com/target-gave-1m-to-trump-inauguration-fund-a-first-for-the-company/601341249"
  },
  {
    "text": "Across 500 Pages, Harvard Task Force Reports Detail Hostility on Campus and Urge Broad Policy Changes  —  Harvard's twin task forces on combating bias toward Jewish, Israeli, Muslim, Arab, and Palestinian affiliates released their long-awaited reports on Tuesday afternoon … ",
    "url": "https://www.thecrimson.com/article/2025/4/30/task-force-reports/"
  },
  {
    "text": "A DOGE Aide Involved in Dismantling Consumer Bureau Owns Stock in Companies That Could Benefit From the Cuts  —  Gavin Kliger helped oversee mass firings at the Consumer Financial Protection Bureau while holding stock in companies that experts say likely stand to benefit from dismantling that agency … ",
    "url": "https://www.propublica.org/article/doge-consumer-financial-protection-bureau-gavin-kliger-stock"
  },
  {
    "text": "Canada's conservative leader Pierre Poilievre loses his own seat in election collapse  —  The remarkable campaign was upended by a backlash against U.S. President Donald Trump, which sparked a stunning liberal resurgence.  —  Canada's conservative leader lost his own seat in Monday's election … ",
    "url": "https://www.politico.eu/article/pierre-poilievre-mark-carney-canada-election-conservative-liberal/"
  },
  {
    "text": "Trump's first ‘new media’ briefing hosts influencer who spent 7 days convinced the moon had disappeared  —  'Has anyone seen the moon lately?  I've been looking for 7 days.'  —  A conservative influencer who was convinced last year that the moon had disappeared attended a press briefing on Monday held at the White House.",
    "url": "https://www.dailydot.com/debug/kambree-nelson-moon-white-house-press-briefing/"
  },
  {
    "text": "China sends a stern video message to Trump: We won't ‘kneel down’  —  In a sharp rebuke of President Donald Trump's trade war, China's Foreign Ministry posted to social media a striking video that calls on the international community to stand up to America's “bully” leader.",
    "url": "https://cnn.com/2025/04/29/business/china-video-trump-trade-war/"
  },
  {
    "text": "A Mother and Father Were Deported.  What Happened to Their Toddler?  —  The Trump administration sent the mother of a 2-year-old to Venezuela and the father to a Salvadoran prison.  Their daughter remains somewhere in the United States.  —  A Venezuelan family is calling for a 2-year-old … ",
    "url": "https://www.nytimes.com/2025/04/29/world/americas/family-deported-trump-venezuela-el-salvador.html"
  },
  {
    "text": "USPS law enforcement assists Trump ‘mass deportation’ effort, sources and records show  —  The Postal Inspection Service recently joined a federal task force to locate undocumented immigrants using data from mail and packages, according to people familiar with the effort and records obtained by The Washington Post.",
    "url": "https://www.washingtonpost.com/business/2025/04/29/usps-immigration-trump-deportations/"
  },
  {
    "text": "Despite Trump's promised cuts, U.S. spent about $220 billion more in first 100 days than last year  —  Despite promises to cut spending during the campaign and his first few months in office, President Trump's federal government has spent about $220 billion more in his first 100 days compared to the same time period last year.",
    "url": "https://www.cbsnews.com/news/trump-promised-cuts-spent-200-billion-more/"
  },
  {
    "text": "100 Days In, Trump Blocks At Least $430 Billion Dollars in Funding Owed to American People  —  Since taking office, President Trump has trampled on our nation's laws and choked off critical investments that families, businesses, and local governments in every zip code in America are counting on.",
    "url": "https://democrats-appropriations.house.gov/100-days-trump-blocks-least-430-billion-dollars-funding-owed-american-people"
  },
  {
    "text": "Most Americans oppose Trump 3rd term, taking control of Greenland and Canada: POLL  —  A majority take Trump at his word when he talks about his potential actions.  —  President Donald Trump walks down the colonnade to the Oval Office after arriving on Marine One at the White House in Washington, April 27, 2025.",
    "url": "https://abcnews.go.com/Politics/americans-oppose-trump-term-taking-control-greenland-canada-poll/story?id=121244234"
  },
  {
    "text": "Kilmar Abrego Garcia accused of being gang-banger in 2018 court docs — in latest claim of MS-13 affiliation  —  Kilmar Abrego Garcia was accused of being a gang member in 2018 court papers, The Post can reveal — as the fight continues over whether the deported illegal immigrant dad was a part of MS-13.",
    "url": "https://nypost.com/2025/04/29/us-news/kilmar-abrego-garcia-accused-of-being-gang-banger-in-2018-court-docs/"
  },
  {
    "text": "Why I Am Leaving the USA  —  The author, a trans woman and mother of neurodivergent kids, has been monitoring this nation's political climate since Trump's first term.  Now that her worst fears are fast becoming a reality, she's had to make the most difficult decision of her life.",
    "url": "https://www.damemagazine.com/2025/04/29/why-i-am-leaving-the-usa/"
  },
  {
    "text": "Trump's late push for huge new corporate tax cuts  —  The Trump administration is pressing Congress to dramatically expand the number of business-friendly tax cuts in a budget bill that's already complicated and costly.  —  Why it matters: New additions, such as full expensing to build … ",
    "url": "https://www.axios.com/2025/04/30/trump-corporate-tax-cuts-expensing-factories"
  },
  {
    "text": "Hegseth cancels Pentagon program.  It was signed into law by Trump.  —  The 2017 bill Trump signed into law was backed by two current Cabinet members when they were members of Congress.  —  Defense Secretary Pete Hegseth said Tuesday he will wind down a program at the Pentagon that boosts … ",
    "url": "https://www.politico.com/news/2025/04/29/hegseth-women-peace-and-security-program-00315226"
  },
  {
    "text": "Let A Million Anti-Trump Flowers Bloom  —  Carefully orchestrated rebranding exercises are overrated.  —  ∙ Paid  —  Ask almost any professional Democrat what the party needs to do to become nationally viable and they'll respond with some version of the same boilerplate internal critique:",
    "url": "https://www.offmessage.net/p/a-million-anti-trump-flowers"
  },
  {
    "text": "How Trump chipped away at abortion access in his first 100 days  —  President Trump steadily chipped away at abortion access during the first 100 days of his second term.  —  Trump campaigned on leaving abortion decisions to the states, and has so far made no push to outlaw the procedure on a national level.",
    "url": "https://thehill.com/policy/healthcare/5273836-trump-second-term-abortion-access/"
  },
  {
    "text": "Elizabeth Warren Marks 100 Days Of Trump By Reading Aloud 100 Reports Of His Corruption  —  The Massachusetts senator plans to read into the congressional record dozens of cases of Trump using the presidency to benefit himself personally.  —  WASHINGTON - Donald Trump is 100 days into his second presidency … ",
    "url": "https://www.huffpost.com/entry/elizabeth-warren-donald-trump-100-days-corrupt_n_68111f2be4b0cbf3b6c1ddaa"
  }
]