[
  {
    "text": "White House official says Biden and Harris weren't invited to Arlington cemetery by families of service members killed during Afghanistan withdrawal  —  Biden and Harris' teams pushed back on claims from GOP Sen. Tom Cotton and former Rep. Tulsi Gabbard that the president and vice president had been invited alongside Trump.",
    "url": "https://www.nbcnews.com/politics/white-house/biden-harris-werent-invited-arlington-abbey-gate-trump-rcna169154"
  },
  {
    "text": "Arlington cemetery controversy deepens as Trump and Harris trade attacks  —  Donald Trump on Saturday continued to defend his visit this week to Arlington National Cemetery amid mounting criticism, including from Vice President Kamala Harris, who said the former president “is unable to comprehend anything other than service to himself.”",
    "url": "https://www.cnn.com/2024/08/31/politics/harris-slams-trump-arlington-national-cemetery/"
  },
  {
    "text": "An ugly case of ‘false balance’ in the New York Times  —  I once asked Jill Abramson, the former top editor of the New York Times, to name the best reporters she had ever encountered.  —  I recall she mentioned her friend and co-author Jane Mayer — definitely on my list, too — and a few others.",
    "url": "https://margaretsullivan.substack.com/p/an-ugly-case-of-false-balance-in"
  },
  {
    "text": "Trump Praises Authoritarian Viktor Orbán and Even Republicans Are Concerned  —  The Hungarian prime minister has visited Trump in Florida twice this year and boasted that he has influence over Trump's policy proposals  —  Donald Trump praised Hungarian Prime Minister Viktor Orbán … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-orban-republicans-concerned-1235093328/"
  },
  {
    "text": "Musk's Twitter investors have lost billions in value  —  Elon Musk bought Twitter with a combination of his own money, bank loans and capital raised from friends and associates.  Here's how far his investors are underwater.  —  When Elon Musk bought Twitter and renamed it X, he didn't do it alone.",
    "url": "https://www.washingtonpost.com/technology/2024/09/01/musk-twitter-investors-underwater/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI1MTYzMjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI2NTQ1NTk5LCJpYXQiOjE3MjUxNjMyMDAsImp0aSI6IjQ1Y2NkMWI5LTNkZmUtNDM3OC1iNjFkLWU4YmFiZGE3NGU0NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjQvMDkvMDEvbXVzay10d2l0dGVyLWludmVzdG9ycy11bmRlcndhdGVyLyJ9.r88ML3FI4pKvj91hBZUYiLfLuIwMcsXjEoP8xc2mxBI&itid=gfta"
  },
  {
    "text": "Abandon Biden campaign relaunches, targets Harris in key swing states  —  The Abandon Biden campaign is relaunching and “intensifying” its campaign, this time focusing its efforts against Vice President Kamala Harris in key swing states.  —  The campaign released a statement on X last week … ",
    "url": "https://www.foxnews.com/politics/abandon-biden-campaign-relaunches-targets-harris-key-swing-states"
  },
  {
    "text": "Americans love big cars, but new analysis suggests that the heaviest vehicles kill more people than they save  —  Witnesses said the driver showed no signs of slowing down.  On June 3rd Nicole Louthain and her six-year-old daughter were stopped at a red light in Grand Forks … ",
    "url": "https://www.economist.com/interactive/united-states/2024/08/31/americans-love-affair-with-big-cars-is-killing-them"
  },
  {
    "text": "Bodies of 6 hostages, murdered by Hamas just days ago, found in Rafah - IDF  —  Hersh Goldberg-Polin, Eden Yerushalmi, Ori Danino, Alex Lubnov, Carmel Gat, Almog Sarusi discovered in Gaza tunnel; families forum urges protests; autopsy said to find all 6 had gunshot wounds",
    "url": "https://www.timesofisrael.com/bodies-of-6-hostages-murdered-by-hamas-just-days-earlier-found-in-rafah-idf/"
  },
  {
    "text": "Anthony Scaramucci Drops Bombshell Melania Claims  —  HATERS GONNA HATE  —  “I judge the hatred of Donald Trump by the Melania standard,” the former White House communications director said during a podcast appearance Saturday.  —  Journalist  —  Anthony Scaramucci has claimed … ",
    "url": "https://www.thedailybeast.com/anthony-scaramucci-melania-hates-donald-trump-wants-kamala-harris-to-win"
  },
  {
    "text": "Justice Ketanji Brown Jackson is hitting the road to promote her new memoir, ‘Lovely One’  —  Supreme Court Justice Ketanji Brown Jackson is embarking on a high-profile, nationwide tour to promote her new memoir, “Lovely One.”  Jackson, 53, is using the book, publisher Random House says … ",
    "url": "https://apnews.com/article/ketanji-jackson-supreme-court-memoir-2dd0fb43e7bd6929e97817e05847ca5a"
  },
  {
    "text": "Meandering?  Off-Script?  Trump Insists His ‘Weave’ Is Oratorical Genius.  —  Former President Donald J. Trump's speeches often wander from topic to topic.  He insists there is an art to stitching them all together.  —  For weeks, former President Donald J. Trump's advisers have urged … ",
    "url": "https://www.nytimes.com/2024/09/01/us/elections/trump-speeches-weave.html"
  },
  {
    "text": "Linda Deutsch, AP trial writer who had front row to courtroom history, dies at 80  —  Linda Deutsch, a special correspondent for The Associated Press who for nearly 50 years wrote glittering first drafts of history for many of the nation's most significant criminal and civil trials … ",
    "url": "https://apnews.com/article/linda-deutsch-associated-press-trials-oj-manson-40b73ccda0b811ed90553c219cee77e8"
  },
  {
    "text": "Thousands Of U.S. Hotel Workers Are On Strike  —  The walkouts hit more than two dozen hotels in eight cities, according to the workers' union.  —  LOADING  —  Thousands of hotel workers around the country walked off the job Sunday amid labor disputes with several major hotel chains.",
    "url": "https://www.huffpost.com/entry/thousands-us-hotel-workers-strike_n_66d49470e4b0f968d26ceca8"
  },
  {
    "text": "Conservative Columnist Tells Bemused CNN Host Vance ‘Has Not Had One Misstep’  —  POBODY'S NERFECT  —  Vance is Vance is “not necessarily the most warm and fuzzy campaigner,” Rich Lowry asserted, “but he is proven a tireless, fearless, really effective spokesman for this ticket.”",
    "url": "https://www.thedailybeast.com/national-review-eic-rich-lowry-tells-bemused-cnn-host-jd-vance-has-not-had-one-misstep"
  },
  {
    "text": "Jan. 6 sentences under fresh scrutiny as Supreme Court fallout persists  —  The resounding impact of the Supreme Court's decision to neuter an obstruction charge used in Jan. 6 cases will face fresh scrutiny Wednesday when a rioter's resentencing tests whether prison terms in such cases must be reduced.",
    "url": "https://thehill.com/regulation/court-battles/4856162-jan-6-sentences-supreme-court-obstruction/"
  },
  {
    "text": "The kleptocrats aren't just stealing money.  They're stealing democracy … Donald Trump opened Trump Tower on Fifth Avenue in 1983 and occupied the penthouse himself.  The building was intended to advertise its owner's wealth, and also to attract other rich tenants — including, ironically, the very secretive rich.",
    "url": "https://www.ft.com/content/0876ef7a-bf88-463e-b8ca-bd9b4a11665c?accessToken=zwAGIQ6jzGSgkc8Idu96v4hGPtO4yr2bShFmXA.MEUCIAjwvv97o-GbDWICTJI-1kTLgIEmpcxXnmKwyCJyAEX8AiEAlIQ0PFuVHD2nCcw9QF_fmrHm03OPnWdNSPjMpn70j5k&sharetype=gift&token=cbe21496-8086-4af8-a07c-7c2201d2995e"
  },
  {
    "text": "Tulsi Gabbard's journey to Donald Trump is an ominous sign of Putin's power  —  From Democrat to pro-Putin isolationist: How did Tulsi Gabbard get here?  —  On Monday, former Democratic House member Tulsi Gabbard, D-HI, endorsed Donald Trump for the presidency and became one of his surrogates on the campaign trail.",
    "url": "https://www.salon.com/2024/09/01/tulsi-gabbards-journey-to-donald-is-an-ominous-sign-of-putins-power/"
  }
]