[
  {
    "text": "Trump's bond set for $200,000 in Fulton County  —  X  —  Former President Donald Trump was granted a $200,000 bond on Monday ahead of the Republican's expected surrender at the Fulton County jail.  —  Under the terms of the consent bond order, Trump can't perform any acts of witness intimidation … ",
    "url": "https://www.ajc.com/politics/trumps-bond-set-for-200000-in-fulton-county/YVM7QOLFL5FDRGIVL6A7FR6JMI/"
  },
  {
    "text": "Trump says he will surrender Thursday on Georgia charges tied to efforts to overturn 2020 election  —  Former President Donald Trump says he will surrender to authorities in Georgia on Thursday to face charges in the case accusing him of illegally scheming to overturn his 2020 election loss in the state.",
    "url": "https://apnews.com/article/trump-bond-georgia-election-indictment-79dbb26a14b5a4ccfc1472d6d3eacd2b"
  },
  {
    "text": "Justice Dept. pushes back against Trump's bid for a 2026 trial in D.C.  —  The Justice Department pushed back Monday on former president Donald Trump's claims that he cannot be ready to go to trial in January on charges that he illegally sought to subvert the results of the 2020 election.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/21/special-counsel-trial-dc-date-trump/"
  },
  {
    "text": "Iowa poll shows GOP divide over Trump remaining party leader  —  Among likely caucusgoers, 41% said they want Trump to continue as the Republican Party's leader, but more than half are open to moving in another direction.  —  Likely Republican Iowa caucusgoers are divided … ",
    "url": "https://www.nbcnews.com/politics/2024-election/iowa-poll-shows-gop-divide-trump-remaining-party-leader-rcna101027"
  },
  {
    "text": "Sen. Rick Scott picks up a Democratic challenger for 2024  —  Former Rep. Debbie Mucarsel-Powell announced Tuesday that she's taking on the incumbent Republican in what's considered an uphill climb for Democrats.  —  Former Democratic Rep. Debbie Mucarsel-Powell announced Tuesday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rep-debbie-mucarsel-powell-challening-rick-scott-senate-2024-rcna101023"
  },
  {
    "text": "Virginia Democrats raise alarms that Gov. Glenn Youngkin could be building toward a national bid  —  Youngkin has built a robust statewide political operation.  Virginia Democrats worry the national party isn't doing enough.  —  Virginia Democrats are worried the national party isn't doing enough … ",
    "url": "https://www.nbcnews.com/politics/2024-election/virginia-democrats-raise-alarms-gov-glenn-youngkin-building-national-b-rcna100435"
  },
  {
    "text": "Cambodia's Hun Sen Seals Political Dynasty as Son Becomes PM  — Hun Sen steps aside after more than 38 years in power  — Son becomes premier in long-planned political succession  —  Cambodia's parliament voted on Tuesday to approve a new government led by the son of outgoing leader Hun … ",
    "url": "https://www.bloomberg.com/news/articles/2023-08-22/hun-sen-seals-political-dynasty-as-son-becomes-cambodia-pm"
  },
  {
    "text": "Pennsylvania Gov. Josh Shapiro to headline New Hampshire Democrats' convention  —  The first-term governor's visit to an early presidential nominating state comes amid buzz that he may one day seek the Oval Office.  —  The New Hampshire Democratic Party announced Tuesday that Pennsylvania … ",
    "url": "https://www.nbcnews.com/politics/politics-news/pennsylvania-gov-josh-shapiro-headline-new-hampshire-democrats-convent-rcna101081"
  },
  {
    "text": "Trump indictments boost MSNBC primetime ratings  —  MSNBC has seen a boost in primetime ratings this summer, thanks in large part to its coverage of the slew of indictments against former President Donald Trump. … But Trump's legal woes, combined with Tucker Carlson's departure from Fox … ",
    "url": "https://www.axios.com/2023/08/22/msnbc-trump-indictments-ratings-boost"
  },
  {
    "text": "A right-wing sheriffs group that challenges federal law is gaining acceptance around the country  —  A national group of sheriffs that claims the top law enforcers in American counties are not bound by federal law has successfully spread its doctrine to dozens of states in recent years",
    "url": "https://abcnews.go.com/Politics/wireStory/wing-sheriffs-group-challenges-federal-law-gaining-acceptance-102427098"
  },
  {
    "text": "DeSantis defends ‘listless vessels’ remark: These lawmakers putting ‘entertainment,’ ‘personality’ first  —  GOP presidential candidate and Florida Gov. Ron DeSantis (R) on Monday defended his remarks calling for Republicans to not be “listless vessels” automatically supporting former President Trump … ",
    "url": "https://thehill.com/homenews/campaign/4163165-desantis-defends-listless-vessels-remark-these-lawmakers-putting-entertainment-personality-first/"
  },
  {
    "text": "‘I Could Use a Little More Self-Flagellation’  —  Before Chris Christie became Donald Trump's sharpest critic, he was an important early booster.  Does he need to apologize for that?  —  Mary Beth Koeth for POLITICO  —  SOUTH MIAMI, Fla. —  Early this past Friday morning … ",
    "url": "https://www.politico.com/news/magazine/2023/08/22/chris-christie-donald-trump-critic-00112106"
  },
  {
    "text": "First on CNN: Biden taps new WH counsel amid special counsel probe, GOP investigations  —  President Joe Biden has tapped Ed Siskel, the former White House attorney who helped manage the Obama White House's response to the Benghazi and Solyndra investigations, to serve as his next White House counsel.",
    "url": "https://www.cnn.com/2023/08/22/politics/ed-siskel-white-house-counsel/"
  },
  {
    "text": "Popular GOP governor reveals key for candidates onstage at Republican presidential debate  —  Fox News is hosting the first Republican presidential nomination debate on Wednesday at 9pm ET in Milwaukee, Wisconsin  —  LONDONDERRY, N.H. - Republican Gov. Chris Sununu of New Hampshire … ",
    "url": "https://www.foxnews.com/politics/popular-gop-governor-reveals-key-candidates-onstage-republican-presidential-debate"
  },
  {
    "text": "House Republicans subpoena DHS Secretary Mayorkas  —  House Republicans on Monday subpoenaed Homeland Security Secretary Alejandro Mayorkas, seeking information about a program that allows citizens of Cuba, Haiti, Nicaragua and Venezuela to enter the U.S. on a temporary basis.",
    "url": "https://thehill.com/homenews/house/4163240-house-republicans-subpoena-dhs-secretary-mayorkas/"
  },
  {
    "text": "Transmittal No  —  The State Department has made a determination approving a possible Foreign Military Sale to the Government of Poland of AH-64E Apache Helicopters and related equipment for an estimated cost of $12.0 billion.  The Defense Security Cooperation Agency delivered … ",
    "url": "https://www.dsca.mil/press-media/major-arms-sales/poland-ah-64e-apache-helicopters"
  },
  {
    "text": "Media organizations seek release of more court filings linked to special counsel Jack Smith's search warrant for Trump's Twitter account  —  A coalition of media organizations, including CNN, is asking the federal court in Washington, DC, to give more transparency into the legal fight … ",
    "url": "https://www.cnn.com/2023/08/21/politics/trump-twitter-special-counsel-unsealing/"
  },
  {
    "text": "Freedom Caucus rebels against a short-term funding bill with new demands  —  The new list of policy changes sought by the ultraconservative House lawmakers drew immediate pushback from Democratic leaders, who warned it would cause a shutdown.  —  WASHINGTON — The ultraconservative House Freedom Caucus … ",
    "url": "https://www.nbcnews.com/politics/congress/freedom-caucus-rebels-short-term-funding-bill-new-demands-rcna100993"
  }
]