[
  {
    "text": "Trump, without evidence, blames ‘rhetoric’ of Biden, Harris for possible assassination attempt  —  Former president Trump, who has a long history of inflammatory rhetoric, repeated the claim on his social media platform Truth Social.  —  Former president Donald Trump on Monday blamed the … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/16/trump-blames-biden-harris-rhetoric-potential-assassination-attempt/"
  },
  {
    "text": "You're Allowed to Call Trump a Threat to Democracy  —  Would-be assassins and migrant pogroms grab the headlines, but the most electorally important event of the week may be the much more boring one coming tomorrow: The Federal Reserve is set to cut interest rates for the first time in two years.",
    "url": "https://www.thebulwark.com/p/youre-allowed-to-call-trump-a-threat"
  },
  {
    "text": "Harris soars to record 6-point lead over Trump in post-debate poll … - “A majority of likely voters — including 1 in 5 Republicans — believe Harris won the debate, and performance appears to be crystalizing her national lead over the former president,” said Eli Yokley, political analyst at Morning Consult, in an emailed statement.",
    "url": "https://www.axios.com/2024/09/17/harris-leads-trump-poll-after-debate-record"
  },
  {
    "text": "Small Movement Post-Debate  —  Large gender gaps on trust to handle immigration, abortion  —  West Long Branch, NJ - Vice President Kamala Harris continues to hold slightly more voter support than former President Donald Trump in the 2024 race for president.",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_091724/"
  },
  {
    "text": "“Depressed, disgusted and horrified”: These lifelong Republicans say they're finally done with Trump  —  Former Republicans opposed to Donald Trump are working to give conservatives “permission” to vote for a Democrat  —  Robert Nix, a 62-year-old lawyer from Philadelphia, was a lifelong Republican before Donald Trump came to office.",
    "url": "https://www.salon.com/2024/09/17/depressed-disgusted-and-horrified-these-lifelong-say-theyre-finally-done-with/"
  },
  {
    "text": "Vance: Trump's Health-Care Plan Is to Let Insurers Charge More for Preexisting Conditions … Donald Trump infamously said at the presidential debate he had the “concept of a plan” to replace Obamacare.  As is often the case when Trump commits verbal self-harm, it fell to J.D. Vance to turn … ",
    "url": "https://nymag.com/intelligencer/article/trump-health-plan-charge-more-preexisting-conditions-concept-plan-j-d-vance.html"
  },
  {
    "text": "Dozens of Hezbollah members wounded in Lebanon when pagers exploded, sources and witnesses say  —  At least eight people were killed and 2,750 others including Hezbollah fighters, medics and Iran's envoy to Beirut were wounded on Tuesday when the pagers they use to communicate exploded across Lebanon … ",
    "url": "https://www.reuters.com/world/middle-east/dozens-hezbollah-members-wounded-lebanon-when-pagers-exploded-sources-witnesses-2024-09-17/"
  },
  {
    "text": "Senate GOP abandons anti-Biden strategy after unexpected backfire … - Sen. James Lankford (R-Okla.) told Axios they were “not actually getting anything done” with the votes, but it created a situation in which Democrats “can send a message that they're pretending to back home.”",
    "url": "https://www.axios.com/2024/09/17/senate-biden-cra-votes-congress-tester-brown"
  },
  {
    "text": "Palm Beach Asks for Help After Spending $93,000 a Day to Protect Trump  —  Palm Beach, one of the richest American enclaves, is seeking government assistance after the cost to protect its most famous resident — former President Donald Trump — soared to $93,000 a day.",
    "url": "https://www.bloomberg.com/news/articles/2024-09-17/palm-beach-asks-for-help-after-spending-93-000-a-day-to-protect-trump"
  },
  {
    "text": "U.S. Authorities Were Warned About Suspected Trump Gunman  —  Ryan Routh criticized Trump and threatened to kill Vladimir Putin, setting off alarm bells among those involved in Ukraine assistance efforts  —  in West Palm Beach, Fla., and Vera Bergengruen in Washington",
    "url": "https://www.wsj.com/us-news/u-s-authorities-were-warned-about-suspected-trump-gunman-153dab6f?st=dHi5Ft&reflink=article_copyURL_share"
  },
  {
    "text": "Trump's crypto venture faces scrutiny from House Democrats  —  “This makes Clarence Thomas look like Mother Teresa,” said Rep. Brad Sherman.  —  After weeks of hype, Donald Trump's family is rolling out its new cryptocurrency startup.  Democrats on Capitol Hill are taking notes.",
    "url": "https://www.politico.com/news/2024/09/17/donald-trump-crypto-democrats-scrutiny-00179495"
  },
  {
    "text": "Court may decide if Arizonans with missing citizenship records can vote in state races  —  Arizona officials discovered they have no records showing if nearly 100,000 longtime residents provided proof of citizenship, which is required by law to vote in state and local races.",
    "url": "https://www.washingtonpost.com/politics/2024/09/17/arizona-noncitizen-voters/"
  },
  {
    "text": "Harris holds 6-point national lead over Trump in postdebate polling  —  Vice President Harris is leading former President Trump nationally by 6 points, according to a polling released a week after the first debate between the major party nominees.  —  The Morning Consult survey … ",
    "url": "https://thehill.com/homenews/campaign/4883524-kamala-harris-donald-trump-post-debate-polling/"
  },
  {
    "text": "Mehdi Hasan sounds off  —  “The media is too timid, too cautious, too cowardly.”  —  ∙ Paid … Mehdi Hasan thinks elite media institutions are failing us, which is why he founded Zeteo, an “independent and unfiltered” news and commentary site that has grown exponentially since its debut earlier this year.",
    "url": "https://www.publicnotice.co/p/mehdi-hasan-interview-2024"
  },
  {
    "text": "Playbook: The next Jan. 6  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  APPOINTMENT VIEWING — We're excited to note Eugene is among the reporters who will question VP KAMALA HARRIS later today in Philadelphia at an event organized by the National Association of Black Journalists.",
    "url": "https://www.politico.com/newsletters/playbook/2024/09/17/the-next-jan-6-00179476"
  },
  {
    "text": "In an Unprecedented Move, Ohio Is Funding the Construction of Private Religious Schools  —  The state is giving millions in taxpayer dollars directly to private schools to help them renovate and expand their campuses.  It may be the next frontier in the push to increase the use of school vouchers, proponents say.",
    "url": "https://www.propublica.org/article/ohio-taxpayer-money-funding-private-religious-schools"
  },
  {
    "text": "Judge Aileen Cannon Failed to Disclose a Right-Wing Junket  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Federal Judge Aileen M. Cannon, the controversial jurist who tossed … ",
    "url": "https://www.propublica.org/article/judge-aileen-cannon-trump-documents-case-travel-disclosures"
  },
  {
    "text": "14% of Republicans would ‘take action to overturn’ the election if Trump loses, study finds  —  Nearly half of Republicans say they won't accept the results of the presidential election if their candidate loses, and some of them say they would “take action to overturn” the results, according to data released Tuesday.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/09/17/half-republicans-wont-accept-trump-loss-2024/75142477007/"
  },
  {
    "text": "Megyn Kelly owes Taylor Swift an apology  —  Megyn Kelly, formerly of NBC and Fox News, is enraged that Taylor Swift endorsed Kamala Harris for president.  The global superstar endorsed Harris in an Instagram post on September 10, immediately after the debate between Harris and Donald Trump.",
    "url": "https://popular.info/p/megyn-kelly-owes-taylor-swift-an"
  }
]