[
  {
    "text": "Here Are the Attack Plans That Trump's Advisers Shared on Signal  —  So, about that Signal chat.  —  On Monday, shortly after we published a story about a massive Trump-administration security breach, a reporter asked the secretary of defense, Pete Hegseth, why he had shared plans … ",
    "url": "https://www.theatlantic.com/politics/archive/2025/03/signal-group-chat-attack-plans-hegseth-goldberg/682176/?gift=49wmX9XxesaxFXKJmFp0PlFCOlSStPdC9KOycekgUy0&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump gave Waltz a vote of confidence.  It wasn't as smooth behind the scenes.  —  The fight over Waltz's survival shows the administration is obsessed with reporters more than NatSac protocols.  —  President Donald Trump was upset when he found out that National Security Adviser Mike Waltz … ",
    "url": "https://www.politico.com/news/2025/03/26/trump-leak-mike-waltz-atlantic-00249106"
  },
  {
    "text": "SignalGate Isn't About Signal  —  The Trump cabinet's shocking leak of its plans to bomb Yemen raises myriad confidentiality and legal issues.  The security of the encrypted messaging app Signal is not one of them.  —  The eye-popping scandal surrounding the Trump cabinet's accidental invitation … ",
    "url": "https://www.wired.com/story/signalgate-isnt-about-signal/"
  },
  {
    "text": "The country's most powerful institutions are bowing to Trump.  The Atlantic just backed him into a corner.  —  The president has used a strongman playbook to bring universities, news organizations and law firms to heel.  That didn't work on The Atlantic.  —  Over the past two months … ",
    "url": "https://www.politico.com/news/2025/03/26/the-countrys-most-powerful-institutions-are-bowing-to-trump-the-atlantic-just-backed-him-into-a-corner-00250630"
  },
  {
    "text": "Sources say the details shared by Hegseth in Signal chat were classified as Atlantic publishes additional messages  —  The information Defense Secretary Pete Hegseth disclosed in the Signal chat of top Trump national security officials was highly classified at the time he wrote it … ",
    "url": "https://cnn.com/2025/03/26/politics/the-atlantic-publishes-signal-messages-yemen-strike/"
  },
  {
    "text": "The Atlantic releases the entire Signal chat showing Hegseth's detailed attack plans against Houthis  —  The Atlantic on Wednesday released the entire Signal chat among senior national security officials, showing that Defense Secretary Pete Hegseth provided the exact timings of warplane launches … ",
    "url": "https://apnews.com/article/hegseth-atlantic-war-plans-signal-yemen-houthis-c0addd08c627ab01a37ea63621cb695e"
  },
  {
    "text": "Exclusive: DOGE staffer, ‘Big Balls’, provided tech support to cybercrime ring, records show  —  WILMINGTON, Delaware, March 26 (Reuters) - (This story contains strong language in paragraph 15)  —  The best-known member of Elon Musk's U.S. DOGE Service team of technologists once provided support … ",
    "url": "https://www.reuters.com/world/us/doge-staffer-big-balls-provided-tech-support-cybercrime-ring-records-show-2025-03-26/"
  },
  {
    "text": "‘A lot closer than people expected’: GOP worries, Dem cash dominate tense Florida special election  —  President Donald Trump handpicked state Sen. Randy Fine to replace Mike Waltz in the district.  —  Randy Fine has leaned into President Donald Trump's endorsement to try to win a congressional special election in Florida.",
    "url": "https://www.politico.com/news/2025/03/26/fine-weil-florida-special-election-00249679"
  },
  {
    "text": "Tufts international graduate student taken into ICE custody  —  A Tufts University international graduate student is in federal custody after being detained by Immigration and Customs Enforcement officials.  —  Rumeysa Ozturk, a Turkish national and PhD student in the Graduate School of Arts and Sciences … ",
    "url": "https://www.wgbh.org/news/local/2025-03-26/tufts-international-graduate-student-taken-into-ice-custody"
  },
  {
    "text": "Federal Government Detains International Student at Tufts  —  The university was told that the student's visa had been terminated, its president said in a late-night email to students and faculty members.  —  An international student in a graduate program at Tufts University was taken … ",
    "url": "https://www.nytimes.com/2025/03/26/us/ice-tufts-student-detained-rumeysa-ozturk.html"
  },
  {
    "text": "U.S. to End Vaccine Funds for Poor Countries  —  A 281-page spreadsheet obtained by The Times lists the Trump administration's plans for thousands of foreign aid programs.  —  The Trump administration intends to terminate the United States' financial support for Gavi, the organization … ",
    "url": "https://www.nytimes.com/2025/03/26/health/usaid-cuts-gavi-bird-flu.html?unlocked_article_code=1.604.mgUe.7Y_CkCo72lQh&smid=url-share"
  },
  {
    "text": "Trump's executive order on voting seems to ignore a lot of law  —  The process of governance matters, but the president pretends we don't have a Congress and rides roughshod over the states.  —  President Trump has finally issued an executive order on election administration.  —  I'd expected it to come sooner.",
    "url": "https://contrarian.substack.com/p/trumps-executive-order-on-voting"
  },
  {
    "text": "What the Bernie Sanders and Alexandria Ocasio-Cortez mega-rallies are really about  —  The two progressives are bringing energy to a party that has been exhausted and furious in the second Trump era.  —  Bernie Sanders and Alexandria Ocasio-Cortez are striking a chord.",
    "url": "https://www.politico.com/news/2025/03/26/what-the-bernie-sanders-and-alexandria-ocasio-cortez-mega-rallies-are-really-about-00249753"
  },
  {
    "text": "Rivals Pounce on Paul Weiss, a Top Law Firm, After Trump's Order  —  Fears that competitors could take its top rainmaking talent added to the law firm's worries about a Trump executive order that targeted it.  —  President Trump's executive order attacking Paul Weiss and severely restricting … ",
    "url": "https://www.nytimes.com/2025/03/26/business/paul-weiss-trump-deal.html?unlocked_article_code=1.604.F0lV.66hS1GBNC-EY&smid=bs-share"
  },
  {
    "text": "Inside DOGE's Plan to Invade the Treasury—and Throttle USAID  —  Court filings show that from the earliest days of the second Trump administration, Elon Musk's DOGE had a plan to infiltrate US Treasury payment systems—and turn them against USAID.  —  From the beginning of President Donald … ",
    "url": "https://www.wired.com/story/elon-musk-doge-plan-treasury-usaid/"
  },
  {
    "text": "Supreme Court upholds federal regulations on ghost gun kits  —  The 7-2 decision came from Justice Neil Gorsuch.  —  A view of the U.S. Supreme Court in Washington, July 19, 2024.  —  The Supreme Court on Wednesday upheld government regulation of self-assemble firearm kits that produce untraceable weapons known as “ghost guns.”",
    "url": "https://abcnews.go.com/Politics/supreme-court-upholds-federal-regulations-ghost-gun-kits/story?id=119207659"
  },
  {
    "text": "How Elon Musk's SpaceX Secretly Allows Investment From China  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Elon Musk's aerospace giant SpaceX allows investors from China to buy stakes … ",
    "url": "https://www.propublica.org/article/elon-musk-spacex-allows-china-investment-cayman-islands-secrecy"
  },
  {
    "text": "DOGE says it needs to know the government's most sensitive data, but can't say why  —  Fewer than 50 people have access to Social Security Administration databases containing hundreds of millions of people's private financial and personal information.  —  But only one also has access … ",
    "url": "https://www.npr.org/2025/03/26/nx-s1-5339842/doge-data-access-privacy-act-social-security-treasury-opm-lawsuit"
  },
  {
    "text": "Trump admin considers killing big energy projects in Dem states  —  The cuts, if carried through, would politicize the federal funds that Congress and the Biden administration awarded to seven regional applicants as part of the bipartisan infrastructure law.",
    "url": "https://www.politico.com/news/2025/03/26/energy-department-hydrogen-projects-blue-states-00249589"
  },
  {
    "text": "Gabbard says Signal comes ‘pre-installed’ on government devices  —  The app has been largely banned on government-issued devices in the past.  —  Director of National Intelligence Tulsi Gabbard testified to House Intelligence Committee members Wednesday that encrypted messaging app Signal comes … ",
    "url": "https://www.politico.com/news/2025/03/26/gabbard-signal-government-devices-cybersecurity-00250731"
  },
  {
    "text": "Incompetent or Evil: A False Dichotomy  —  Trump's people can be and are both  —  The amount of damage the second Trump administration has already done on many fronts, from foreign policy to public health to America's economic prospects, both for the months ahead and in the long run, is astonishing.",
    "url": "https://paulkrugman.substack.com/p/incompetent-or-evil-a-false-dichotomy"
  },
  {
    "text": "Corporate America's Euphoria Over Trump's ‘Golden Age’ Is Giving Way to Distress  —  CEOs and investors are fretting over what they see as whipsaw policy changes and complacency about the risks of recession  —  Rapturous applause and a sea of phones in the air greeted President Trump … ",
    "url": "https://www.wsj.com/economy/wall-street-trump-golden-age-distress-28a1dfcc?st=1EaSto&reflink=mobilewebshare_permalink"
  },
  {
    "text": "“You're Here Because of Your Tattoos”  —  The Trump administration sent Venezuelans to El Salvador's most infamous prison.  Their families are looking for answers.  —  On Friday, March 14, Arturo Suárez Trejo called his wife, Nathali Sánchez, from an immigration detention center in Texas.",
    "url": "https://www.motherjones.com/politics/2025/03/trump-el-salvador-venezulea-deportation-prison-cecot-bukele/"
  }
]