[
  {
    "text": "Trump Inflated Property Values by Up to $2.2 Billion, New York A.G. Says  —  Letitia James, the attorney general, asked a judge to find, without a trial, that the former president had fraudulently overvalued his assets.  —  Before Donald J. Trump was indicted four times over … ",
    "url": "https://www.nytimes.com/2023/08/30/nyregion/trump-james-civil-lawsuit-trial.html"
  },
  {
    "text": "Donald Trump vows to lock up political enemies if he returns to White House  —  Former president tells Glenn Beck he would have ‘no choice’ but to lock up opponents 'because they're doing it to us'  —  Donald Trump says he will lock up his political enemies if he is president again.",
    "url": "https://www.theguardian.com/us-news/2023/aug/30/trump-interview-jail-political-opponents-glenn-beck"
  },
  {
    "text": "Trump fraudulently inflated his net worth by billions of dollars, New York AG says  —  The estimates came in newly unsealed court filings ahead of an October trial in which Trump and his business empire are accused of fraud.  —  NEW YORK — Donald Trump fraudulently inflated his net worth … ",
    "url": "https://www.politico.com/news/2023/08/30/trump-net-worth-fraud-trial-00113541"
  },
  {
    "text": "Tucker Carlson: ‘Obviously’ We're ‘Speeding Toward Assassination’ of Trump  —  According to Carlson, “both parties have decided that there's something about Trump that's so threatening to them, they just can't have it.”  —  Twitter podcaster Tucker Carlson is pounding home the theory … ",
    "url": "https://www.thedailybeast.com/tucker-carlson-obviously-were-speeding-toward-assassination-of-trump"
  },
  {
    "text": "Giuliani Is Liable for Defaming Georgia Election Workers, Judge Says  —  The ruling means that a defamation case against Rudolph W. Giuliani, stemming from his role in seeking to overturn the 2020 election, can proceed to a trial where damages will be set.  —  A federal judge ruled on Wednesday … ",
    "url": "https://www.nytimes.com/2023/08/30/us/politics/giuliani-defamation-georgia.html"
  },
  {
    "text": "Rudy Giuliani is liable for defaming Georgia election workers, judge rules  —  U.S. District Court Judge Beryl Howell ordered Giuliani to pay the two election workers punitive damages.  —  A federal judge ruled Wednesday that Rudy Giuliani is legally liable for defaming two Georgia election workers … ",
    "url": "https://www.politico.com/news/2023/08/30/judge-rules-giuliani-is-liable-for-defaming-georgia-election-workers-orders-sanctions-00113462"
  },
  {
    "text": "Giuliani loses defamation lawsuit from two Georgia election workers  —  A federal judge has determined Rudy Giuliani forfeits the defamation lawsuit from two Georgia election workers against him, a decision that could lead to significant penalties for the former Donald Trump attorney.",
    "url": "https://www.cnn.com/2023/08/30/politics/rudy-giuliani-georgia-election-workers/"
  },
  {
    "text": "Sen. Mitch McConnell appears to freeze again at a Kentucky event  —  The Republican leader was silent for more than 30 seconds after being asked if he will run for re-election.  He previously froze during a July press conference.  —  Senate Minority Leader Mitch McConnell appeared … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-mitch-mcconnell-appears-freeze-kentucky-event-rcna102583"
  },
  {
    "text": "Mitch McConnell appears to freeze again while talking with reporters  —  Senate Minority Leader Mitch McConnell (R-Ky.) appeared to freeze for several seconds Wednesday while taking questions from journalists in an incident that mirrored another occasion when he abruptly stopped speaking in late July.",
    "url": "https://www.washingtonpost.com/politics/2023/08/30/mcconnell-freeze-speaking/"
  },
  {
    "text": "A Texas judge has declared unconstitutional a law championed by Gov. Greg Abbott that limits the power of Democrat-led cities  — A Texas judge declared a law that prevented cities from passing some local ordinances unconstitutional.  — The law, championed by Republican Gov. Greg Abbott … ",
    "url": "https://www.businessinsider.com/texas-judge-death-star-bill-greg-abbott-unconstitutional-2023-8?op=1"
  },
  {
    "text": "Proud Boy Enrique Tarrio's January 6 sentencing abruptly postponed due to ‘emergency’  —  The sentencing for Enrique Tarrio, the former chair of the Proud Boys, was postponed unexpectedly on Wednesday morning “due to an emergency,” according to the U.S. attorney's office in Washington, D.C.",
    "url": "https://www.washingtonexaminer.com/policy/courts/proud-boy-enrique-tarrior-january-6-sentenced-abruptly-postponed-emergency"
  },
  {
    "text": "Blake Masters Plans to Enter Race for Kyrsten Sinema's Senate Seat  —  Arizona is seen as one of the most competitive states in 2024  —  Republican Blake Masters, who lost his Arizona Senate bid last year, is set to announce he is running again in 2024, according to people familiar with his plans … ",
    "url": "https://www.wsj.com/politics/elections/blake-masters-plans-to-enter-race-for-kyrsten-sinemas-senate-seat-886280ac?mod=followamazon"
  },
  {
    "text": "Judge says Peter Navarro can't use privilege as defense in contempt case  —  A judge ruled Wednesday that Peter Navarro, a Trump White House adviser charged with criminal contempt of Congress, cannot argue to a jury that he was barred by executive privilege from providing testimony and documents … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/30/peter-navarro-defense-executive-privilege-trump/"
  },
  {
    "text": "DOJ, SEC Investigate Tesla Over Secret Glass House Project  —  Federal prosecutors are seeking information about benefits paid to Elon Musk  —  Manhattan federal prosecutors are investigating  —  use of company funds on a secret project that had been described internally as a house … ",
    "url": "https://www.wsj.com/business/autos/tesla-elon-musk-glass-house-doj-sec-investigation-c723166b?mod=followamazon"
  },
  {
    "text": "Gabon Junta Appoints Army Officer as Transitional President  — General Nguema's appointment comes hours after coup announced  — Deposed president Bongo has been placed under house arrest  —  Soldiers in Gabon appointed the head of the republican guard as the OPEC member state's new leader … ",
    "url": "https://www.bloomberg.com/news/articles/2023-08-30/gabon-junta-appoints-military-officer-as-transitional-president"
  },
  {
    "text": "US Health Officials Urge Moving Pot to Lower-Risk Category  — Change would remove drug from most restricted designation  — Cannabis industry stocks respond with double-digit jumps",
    "url": "https://www.bloomberg.com/news/articles/2023-08-30/hhs-calls-for-moving-marijuana-to-lower-risk-us-drug-category"
  },
  {
    "text": "Joe Manchin and Daughter Pitch $100 Million Project to Boost Centrist Policies  —  West Virginia senator and former Mylan CEO Heather Manchin have held meetings with major donors  —  Sen. Joe Manchin and his daughter Heather Manchin are pitching major political donors on a nascent effort … ",
    "url": "https://www.wsj.com/politics/policy/joe-manchin-and-daughter-pitch-100-million-project-to-boost-centrist-policies-155d19da?mod=followamazon"
  },
  {
    "text": "Alexandria Ocasio-Cortez on How She's Changed  —  The congresswoman from New York says she's different from when she first took office.  But she's not ready to call herself an insider.  —  Representative Alexandria Ocasio-Cortez is used to being a lightning rod.",
    "url": "https://www.nytimes.com/2023/08/30/us/politics/aoc-third-term-congress.html"
  },
  {
    "text": "Is Judge Cannon preparing to kneecap Trump's Florida documents case?  —  Spoiler alert: Yes. … Last year, Judge Aileen Cannon tried valiantly to derail the Justice Department's investigation of Donald Trump's retention of classified documents at his Florida country club.",
    "url": "https://www.publicnotice.co/p/judge-aileen-cannon-trump-florida-documents-case"
  }
]