[
  {
    "text": "Biden Tells Allies He Knows He Has Only Days to Salvage Candidacy  —  The president's conversations are the first indication that he is seriously considering whether he can recover after a devastating performance on the debate stage in Atlanta.  The White House said the report was false.",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/biden-withdraw-election-debate.html"
  },
  {
    "text": "Trump Caught on Video Claiming ‘Broken-Down’ Biden Has Quit: 'It's Kamala'  —  ‘SO F***ING BAD’  —  In a leaked video, Trump offers a frank analysis of his rival's performance in the first presidential debate, calling Biden a “broken-down pile of cr*p.”  —  Donald Trump delivered … ",
    "url": "https://www.thedailybeast.com/donald-trump-caught-on-video-claiming-broken-down-joe-biden-has-quit-its-kamala"
  },
  {
    "text": "Biden tells governors he got a medical checkup  —  Two governors also expressed concern over whether the president could still carry their blue-leaning states.  —  President Joe Biden on Wednesday evening told more than 20 Democratic governors in a private meeting that he underwent … ",
    "url": "https://www.politico.com/news/2024/07/03/biden-tells-governors-he-got-a-medical-check-up-00166579"
  },
  {
    "text": "Biden wins crucial support of Democratic governors to continue campaign: 'We're going to have his back' - as it happened  —  This blog is now closed  —  ABC to air full Joe Biden interview on Friday Newsom on Biden: 'He's all in - and so am I'  —  Whitmer gives backing to Biden: 'He's in it to win it and I support him'",
    "url": "https://www.theguardian.com/us-news/live/2024/jul/03/biden-debate-democrats-kamala-harris-election-updates"
  },
  {
    "text": "Playbook: Biden goes from bunker to blitz  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  JULY FOURTH READING — “The partisan gap in views of American greatness,” by WaPo's Philip Bump: “Democrats are more proud of the U.S. Republicans are more likely … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/04/biden-goes-from-bunker-to-blitz-00166585"
  },
  {
    "text": "Behind the Curtain: Kamala Harris' epic edge … - Rep. Bennie Thompson (D-Miss.), who chaired the House Jan. 6 committee, told Axios' Hans Nichols that Harris is “incredibly strong ... You can't say Biden has done a good job without saying she's done a good job.” … Of course, all this may take a while.",
    "url": "https://www.axios.com/2024/07/04/kamala-harris-replace-biden-2024-election"
  },
  {
    "text": "Netflix Co-founder Becomes One of the Biggest Democratic Donors to Call for Biden to Step Aside  —  A public declaration from a megadonor is another crack in the armor in the president's foundation of support.  —  Reed Hastings, the Netflix co-founder who in recent years has become … ",
    "url": "https://www.nytimes.com/2024/07/03/us/politics/reed-hastings-netflix-biden-withdraw.html"
  },
  {
    "text": "Biden at 81: Often sharp and focused but sometimes confused and forgetful  —  President Joe Biden's conduct behind closed doors, in the Oval Office, on Air Force One and in meetings around the world is described in the same dual way by those who regularly see him in action.  He is often sharp and focused.",
    "url": "https://apnews.com/article/biden-age-election-debate-trump-7c366fda83a697265d9ecc77e8a32fd1"
  },
  {
    "text": "The partisan gap in views of American greatness  —  Democrats are more proud of the U.S. Republicans are more likely to view it as the greatest country on Earth.  —  America, we are often told, is less a country than an idea.  That idea can be nebulous in its formulation, but it generally centers on opportunity and around freedom.",
    "url": "https://www.washingtonpost.com/politics/2024/07/04/republicans-democrats-america-polling/"
  },
  {
    "text": "House Democrat is proposing a constitutional amendment to reverse Supreme Court's immunity decision  —  A leading House Democrat is preparing a constitutional amendment in response to the Supreme Court's landmark immunity ruling, seeking to reverse the decision “and ensure that no president is above the law.”",
    "url": "https://apnews.com/article/supreme-court-immunity-trump-biden-9ec81d3aa8b2fd784c1b155d82650b3e"
  },
  {
    "text": "The untold story of the most chaotic Nato summit ever  —  Told by the people who witnessed the 2018 Trump show first hand  —  Donald Trump was going to pull out of Nato.  As the president's motorcade powered through the early morning light of July 12 2018, bound for a summit … ",
    "url": "https://www.ft.com/content/8985b970-0015-479f-9585-7a9b234715a4"
  },
  {
    "text": "The Supreme Court Has Murdered the Constitution  —  America's founding document is now an all-but-meaningless scrap of paper.  Happy Fourth!  —  Chief Justice John Roberts is seen before the State of the Union address to a joint session of Congress at the Capitol on March 7, 2024.",
    "url": "https://prospect.org/justice/2024-07-04-supreme-court-roberts-murdered-constitution/"
  },
  {
    "text": "Trump's New Racist Insult  —  The former president's recent attack on Senator Chuck Schumer is like an Everlasting Gobstopper of offense, with new layers emerging one after another.  —  Weird things happen on the debate stage—just ask Joe Biden.  So when Donald Trump used Palestinian … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-racist-insult-palestinian-schumer/678902/"
  },
  {
    "text": "“Bloodless if the left allows it to be”  —  A week ago, I started my post to you with some comments made by Kevin Roberts, the head of the Heritage Foundation and architect of Project 2025, when he learned Democrats were making plans to take on Project 2025.",
    "url": "https://joycevance.substack.com/p/bloodless-if-the-left-allows-it-to"
  }
]