[
  {
    "text": "Angry protesters from New York to Alaska assail Trump and Musk in ‘Hands Off!’ rallies  —  Crowds of people angry about the way President Donald Trump is running the country marched and rallied in scores of American cities Saturday in the biggest day of demonstrations yet by an opposition movement trying … ",
    "url": "https://apnews.com/article/trump-musk-doge-protests-hands-off-472c574303260cbac315367cc808960d"
  },
  {
    "text": "You Can Stop Asking Where the Mass Opposition Is.  It's Everywhere.  —  It is a cliche to begin a story about a rally with a quote from a funny sign, but one small piece of floppy brown cardboard floating down 40th Street in Manhattan on Saturday seemed to capture the mood of this weekend's … ",
    "url": "https://www.motherjones.com/politics/2025/04/hands-off-donald-trump-fear-new-york-city/"
  },
  {
    "text": "PHOTOS: Check Out These Signs at the “Hands Off!”  Protest in DC  —  Tens of thousands of people rallied on the National Mall to vent frustration at Trump and Musk.  —  In what was billed as a “national day of action,” more than 1,300 “Hands Off!” protests took place in all 50 states … ",
    "url": "https://www.washingtonian.com/2025/04/05/photos-check-out-these-signs-at-the-hands-off-protest-in-dc/"
  },
  {
    "text": "In photos: “Hands Off!” protesters rally against Trump across the U.S.  —  Protesters across the U.S. rallying as part of the “Hands Off!” movement on Saturday are taking to the streets, state capitals, federal buildings, congressional offices and city centers to protest the Trump administration.",
    "url": "https://www.axios.com/2025/04/05/hands-off-protest-movement-trump-musk"
  },
  {
    "text": "Mass Protests Across the Country Show Resistance to Trump  —  Demonstrators packed the streets in cities and towns to rail against government cutbacks, financial turmoil and what they viewed as attacks on democracy.  —  They came out in defense of national parks and small businesses … ",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/anti-trump-protests-hands-off.html"
  },
  {
    "text": "Justice Dept. Accuses Top Immigration Lawyer of Failing to Follow Orders  —  Erez Reuveni conceded in court that the deportation last month of Kilmar Armando Abrego Garcia, who had a court order allowing him to stay in the United States, should never have taken place.",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/justice-dept-immigration-lawyer-leave.html"
  },
  {
    "text": "Justice Department places attorney who struggled to explain Maryland man's deportation on leave  —  The DOJ attorney said in court that the administration should not have deported Kilmar Abrego Garcia, a protected legal resident.  —  A Justice Department attorney who struggled in court … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/justice-department-places-attorney-struggled-explain-maryland-mans-dep-rcna199866"
  },
  {
    "text": "138. Abrego Garcia, Constructive Custody, and Federal Judicial Power  —  Federal courts don't have jurisdiction over foreign prisons.  That doesn't mean that they're powerless when the U.S. government wrongly removes someone from the United States.  —  Welcome back to “One First,” an … ",
    "url": "https://www.stevevladeck.com/p/138-abrego-garcia-constructive-custody"
  },
  {
    "text": "Trump Admin Dismisses Judge's Order to Bring Back Man Accidentally Sent to El Salvador  —  “We suggest the judge contact President Bukele,” said White House Press Secretary Karoline Leavitt … “We suggest the judge contact President Bukele because we are unaware of the judge having jurisdiction … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-admin-order-man-accidentally-deported-el-salvador-1235311289/"
  },
  {
    "text": "DOGE Is Planning a Hackathon at the IRS.  It Wants Easier Access to Taxpayer Data  —  DOGE operatives have repeatedly referred to the software company Palantir as a possible partner in creating a “mega API” at the IRS, sources tell WIRED.  —  Elon Musk's so-called Department of Government Efficiency … ",
    "url": "https://www.wired.com/story/doge-hackathon-irs-data-palantir/"
  },
  {
    "text": "Lesotho, a Small African Nation, Expects a Big Hit From Trump's Tariffs  —  The amount of manufactured goods exported from Africa to the United States is minuscule.  But for Lesotho, the impact of a stunning 50 percent tariff is enormous.  —  The nation that the Trump administration slapped … ",
    "url": "https://www.nytimes.com/2025/04/05/business/economy/lesotho-trump-tariffs-trade.html"
  },
  {
    "text": "Musk slams key Trump adviser Navarro as tariffs bite  —  Elon Musk blasted top Trump administration trade adviser Peter Navarro overnight, calling out his education and lack of corporate credentials.  —  Why it matters: The two-day rout in the stock market this week, after Trump announced sweeping … ",
    "url": "https://www.axios.com/2025/04/05/musk-trump-tariffs-navarro-tesla"
  },
  {
    "text": "Firing of National Security Agency Chief Rattles Lawmakers  —  Gen. Timothy D. Haugh, who was also the head of U.S. Cyber Command, was one of several national security officials fired on the advice of a conspiracy theorist.  —  As soon as word spread that President Trump had fired Gen. Timothy D. Haugh … ",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/nsa-director-haugh-trump-loomer.html?unlocked_article_code=1.9U4.J3uJ.t8q903rxGTiy"
  },
  {
    "text": "DHS officials ask IRS to use tax data to locate up to 7 million immigrants  —  The agencies have still not reached an agreement on sharing information.  But immigration officials now say they're seeking records on millions of people suspected of being in the United States without authorization.",
    "url": "https://www.washingtonpost.com/business/2025/04/05/irs-tax-data-immigration-enforcement/"
  },
  {
    "text": "The History Books Purged From the Naval Academy's Library  —  We now have a list of the 381 books that have been removed from the U.S. Naval Academy's Nimitz Library in Annapolis, Maryland.  Many of the books in the list fall under categories such as Critical Race Theory, Gender and Ethnic Studies, LGBTQ Studies, etc.",
    "url": "https://kevinmlevin.substack.com/p/the-history-books-purged-from-the"
  },
  {
    "text": "Trump Family's Cash Registers Ring as Financial Meltdown Plays Out  —  The party was on at a Saudi-backed LIV Golf tournament at the president's Doral resort in Florida and a fund-raiser at Mar-a-Lago, even as markets tumbled.  —  The financial market meltdown was underway … ",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/trump-family-saudi-golf.html?unlocked_article_code=1.9U4.Ja7s.tKXlCFXVIMDV"
  },
  {
    "text": "I was a British tourist trying to leave America.  Then I was detained, shackled and sent to an immigration detention centre  —  Graphic artist Rebecca Burke was on the trip of a lifetime.  But as she tried to leave the US she was stopped, interrogated and branded an illegal alien by ICE.",
    "url": "https://www.theguardian.com/us-news/2025/apr/05/i-was-a-british-tourist-trying-to-leave-america-then-i-was-detained-shackled-and-sent-to-an-immigration-detention-centre"
  },
  {
    "text": "Video Shows Aid Workers Killed in Gaza Under Gunfire Barrage, With Ambulance Lights On  —  The U.N. has said Israel killed the workers.  The video appears to contradict Israel's version of events, which said the vehicles were “advancing suspiciously” without headlights or emergency signals.",
    "url": "https://www.nytimes.com/2025/04/04/world/middleeast/gaza-israel-aid-workers-deaths-video.html?unlocked_article_code=1.9U4.ueq4.aNDLWwV-_2T3&smid=url-share"
  },
  {
    "text": "Al Green says he'll present articles of impeachment against Trump in next 30 days  —  Rep. Al Green (D-Texas) said he will bring articles of impeachment against President Trump in the next 30 days, telling protestors at an anti-Trump rally in Washington that he does not “deserve” to hold the executive office.",
    "url": "https://thehill.com/homenews/house/5234386-al-green-donald-trump-impeachment/"
  },
  {
    "text": "He Said He Would Ban Congressional Stock Trading.  Now in Office, He Trades Freely.  —  Representative Rob Bresnahan Jr., who campaigned on prohibiting stock trading by members of Congress, has emerged as one of the most active stock traders in the freshman class.",
    "url": "https://www.nytimes.com/2025/04/05/us/politics/congress-stock-trading-ban.html"
  },
  {
    "text": "Doug Emhoff publicly criticizes his law firm for coming to agreement with Trump administration  —  Speaking at a charity gala dinner Thursday night in Los Angeles, former second gentleman Doug Emhoff condemned the decision by his law firm to preemptively come to an arrangement … ",
    "url": "https://cnn.com/2025/04/05/politics/doug-emhoff-criticizes-his-law-firm-for-coming-to-agreement-with-trump-administraiton"
  }
]