[
  {
    "text": "Trump freed a Jan. 6 defendant charged with assaulting police.  DOJ had him arrested again on a gun charge.  —  The charges against Daniel Ball, unrelated to Jan. 6, had been pending since 2023.  —  A Jan. 6 defendant whose felony assault charges were dismissed a day earlier was arrested Wednesday … ",
    "url": "https://www.politico.com/news/2025/01/22/trump-jan-6-defendant-gun-charge-005863"
  },
  {
    "text": "Pardoned Jan. 6 Rioter Already Rearrested on Gun Charges  —  Trump granted clemency to hundreds of alleged or convicted violent criminals.  One is back behind bars … In May 2023, Daniel Ball of Homosassa, Florida, was indicted on 12 counts related to his participation in the attack on the Capitol.",
    "url": "https://www.rollingstone.com/politics/politics-news/jan-6-rioter-pardoned-trump-rearrested-gun-charges-1235243994/"
  },
  {
    "text": "US military ordering thousands more troops to southern border  —  Thousands of additional active duty US troops are being ordered to the southern US border with Mexico, just two days after President Donald Trump mandated that the US military step up its presence there, according to officials familiar with the matter.",
    "url": "https://www.cnn.com/2025/01/22/politics/us-military-troops-southern-border/"
  },
  {
    "text": "Trump warns he'll adjourn Congress to make recess appointments.  How would that work?  —  President Trump is threatening to use his powers to adjourn Congress so he can make recess appointments for at least some of his top Cabinet nominees and their deputies, enabling them to begin running the largest federal departments.",
    "url": "https://www.cbsnews.com/news/trump-recess-appointments-adjourning-congress/"
  },
  {
    "text": "Bishop who made plea to Trump says she won't apologize  —  The reverend who called on President Trump to have mercy on transgender children and immigrants during a prayer service for his inauguration said in a new interview she would not apologize for her remarks.",
    "url": "https://thehill.com/homenews/administration/5101739-reverend-refuses-apologize-trump/"
  },
  {
    "text": "Justice Department freezes all cases in civil rights division  —  The memo doesn't state how long the freeze will last, but it essentially shuts down the civil rights division for at least the first weeks of the Trump administration.  —  The Justice Department has ordered its civil rights division … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/22/justice-civil-rights-freeze-shutdown/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3NTIyMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4OTA0Mzk5LCJpYXQiOjE3Mzc1MjIwMDAsImp0aSI6IjYzZDVhMjliLTFiODktNDhkOC1hODFkLWQwNzQyZDg4MTE4OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzIyL2p1c3RpY2UtY2l2aWwtcmlnaHRzLWZyZWV6ZS1zaHV0ZG93bi8ifQ.isWoVdxGAhzYxshHXI9pdB72Xbgq7MGVJsOcVBqTAOA&itid=gfta"
  },
  {
    "text": "Trump Revokes Workplace Discrimination Rules Enacted By LBJ In 1965  —  The new president just unwound a landmark anti-discrimination measure implemented amid the height of the Civil Rights Movement.  —  LOADING  —  On Wednesday, President Donald Trump revoked a six-decade-old executive order designed … ",
    "url": "https://www.huffpost.com/entry/trump-executive-order-discrimination-lbj_n_67914b7ce4b0835f2b834b9c"
  },
  {
    "text": "CBS 58 weather reporter Sam Kuffel is out after criticizing Elon Musk arm gesture  —  Daniel Bice Mary SpicuzzaMilwaukee Journal Sentinel  —  A Milwaukee TV weather forecaster has been dropped by her station one day after she criticized Elon Musk on social media for his straight-arm gesture that many have likened to a Nazi salute.",
    "url": "https://www.jsonline.com/story/news/politics/2025/01/22/cbs-58s-sam-kuffel-is-out-after-criticizing-elon-musk-arm-gesture/77883983007/"
  },
  {
    "text": "Trump suggests Biden and those he pardoned should be investigated  —  “I did it the hard way,” the president said, referring to his legal challenges.  “It's really hard to say they shouldn't have to go through it also.”  —  President Donald Trump appeared to suggest Wednesday … ",
    "url": "https://www.politico.com/news/2025/01/22/trump-hannity-takeaways-fox-interview-00200167"
  },
  {
    "text": "Trump's Immigration Plans Are Already Wrecking the Food Industry  —  Fear of increased ICE raids have already negatively affected the nation's agricultural sector, causing alarm that food prices could skyrocket in the near future as a result of Donald Trump's aggressive immigration policies.",
    "url": "https://newrepublic.com/post/190555/donald-trump-immigration-deportations-farm-workers"
  },
  {
    "text": "CNN to lay off hundreds of employees as post-inauguration transformation begins, sources say … Warner Bros. Discovery's CNN plans to lay off hundreds of employees Thursday as it refocuses the business around a global digital audience, according to people familiar with the matter.",
    "url": "https://www.cnbc.com/2025/01/22/cnn-to-lay-off-hundreds-of-employees-post-inauguration.html"
  },
  {
    "text": "Federal health agencies told to halt all external communications  —  Employees of the U.S. Department of Health and Human Services were told to halt all public communications Tuesday.  —  NPR obtained a memo issued by the acting head of HHS, Dr. Dorothy Fink, to the heads … ",
    "url": "https://www.npr.org/sections/shots-health-news/2025/01/22/nx-s1-5270866/hhs-cdc-health-communications-trump"
  },
  {
    "text": "Former Navy SEAL Said to Be Interim Head of FEMA  —  Cameron Hamilton does not appear to have experience coordinating responses to large-scale disasters, like the wildfires in California.  —  The Trump administration has made a former member of the Navy SEALs who has spoken about the importance … ",
    "url": "https://www.nytimes.com/2025/01/22/climate/fema-announcement-cameron-hamilton.html"
  },
  {
    "text": "Mississippi politician files ‘Contraception Begins at Erection Act’  —  JACKSON, Miss. (WLBT) - A state senator in Mississippi has filed a bill entitled the “Contraception Begins at Erection Act.”  —  As written by Sen. Bradford Blackmon, the bill would make it “unlawful for a person … ",
    "url": "https://www.wlbt.com/2025/01/22/mississippi-politician-files-contraception-begins-erection-act/"
  },
  {
    "text": "GOP leaders mull a big debt-and-funding deal with Democrats  —  The option would include an agreement that ties together government funding, border money, disaster aid and a debt-limit hike.  —  House and Senate GOP leaders are internally debating a possible deal with Democrats … ",
    "url": "https://www.politico.com/news/2025/01/22/gop-debt-funding-deal-democrats-00200101"
  },
  {
    "text": "Trump has canceled Biden's ethics rules.  Critics call it the opposite of ‘drain the swamp’  —  Donald Trump took office eight years ago, pledging to “drain the swamp” and end the domination of Washington influence peddlers.  Now, he's opening his second term by rolling back prohibitions … ",
    "url": "https://apnews.com/article/trump-revokes-ethics-rules-drain-swamp-b8e3ba0f98c9c60af11a8e70cbc902bd"
  },
  {
    "text": "Trump pardons two D.C. officers convicted in fatal chase  —  Amid the nation's racial reckoning of 2020, the pursuit killed a young Black man and sparked hours of destructive civil unrest in Northwest Washington.  —  President Donald Trump on Wednesday pardoned two D.C. police officers convicted … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/01/22/trum-pardon-dc-police-hylton-brown/"
  },
  {
    "text": "Trump Seeks to Paralyze Independent Privacy and Civil Liberties Watchdog  —  The Trump White House has told three Democratic-selected members of the Privacy and Civil Liberties Oversight Board to resign or be fired, which would stop the independent agency from functioning.",
    "url": "https://www.nytimes.com/2025/01/22/us/trump-privacy-civil-liberties-oversight-board.html"
  },
  {
    "text": "Trump threatens to withhold aid for California wildfires in first TV interview since inauguration  —  “I don't think we should give California anything until they let water flow down,” he told Sean Hannity  —  Trump slams Biden over prosecutions, pardons  —  President Donald Trump threatened … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/22/trump-hannity-interview/"
  },
  {
    "text": "FTC Chairman Ferguson Announces that DEI is Over at the FTC  —  Today, Federal Trade Commission Chairman Andrew N. Ferguson announced that the agency is delivering on the promise that President Trump made to the American people and issued the following statement:  —  DEI is a scourge on our institutions.",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2025/01/ftc-chairman-ferguson-announces-dei-over-ftc"
  },
  {
    "text": "Hundreds of subreddits are considering banning all links to X.com in response to Elon Musk's salute at a Donald Trump inauguration rally that was celebrated by Nazis as being a Nazi salute.  The moderators of dozens of those subreddits have said that they have decided they will ban all links to X.",
    "url": "https://www.404media.co/hundreds-of-subreddits-are-considering-banning-all-links-to-x/"
  },
  {
    "text": "Thousands ordered to flee their homes after new blaze ignites in Los Angeles County  —  The Hughes Fire was burning out of control near Castaic, north of Los Angeles.  —  Nearly 20,000 people were ordered to flee an area north of Los Angeles on Wednesday after a fast-moving wildfire exploded … ",
    "url": "https://www.nbcnews.com/weather/wildfires/hughes-fire-evacuation-los-angeles-rcna188834"
  }
]