[
  {
    "text": "Trump Says Americans 'Won't Have to Vote Anymore' If He Wins  —  Yesterday, former President Donald Trump told a group of supporters that they won't have to vote again if they elect him to the presidency.  “You won't have to do it anymore,” Trump said at the Turning Point Believers' Summit in Florida.",
    "url": "https://www.theatlantic.com/politics/archive/2024/07/trump-vote-believers-summit/679273/?gift=mIBPPidhhodu0voIJGg1qH_-FS-Cq1IdsyHamr8U3nU&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "The election has been totally upended.  Here's what the polls show.  —  It's clear the presidential contest is reshuffled.  —  The polls are in after a chaotic few weeks in the 2024 presidential election, and they point to a newly hyper-competitive race.  —  Vice President Kamala Harris' elevation … ",
    "url": "https://www.politico.com/news/2024/07/27/polling-kamala-harris-trump-00171514"
  },
  {
    "text": "Playbook: The JD Vance remorse parade  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT A CENTURY THIS MONTH HAS BEEN — “I don't know what they've got in these performance enhancers, but I'm feeling pretty jacked up,” President JOE BIDEN posted … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/07/27/the-jd-vance-remorse-parade-00171512"
  },
  {
    "text": "KSTP/SurveyUSA poll: Harris takes lead over Trump in first Minnesota poll  —  Riding a wave of mostly positive coverage as the presumptive new presidential nominee for Democrats, Vice President Kamala Harris has a significant lead over former Republican President Donald Trump in Minnesota … ",
    "url": "https://kstp.com/kstp-news/top-news/kstp-surveyusa-poll-harris-takes-lead-over-trump-in-first-minnesota-poll/"
  },
  {
    "text": "Pete Buttigieg Thinks the Trump Fever Could Break  —  This past month has been one of the most consequential and dizzying periods in modern American politics.  It began with President Biden's disastrous debate in late June.  Then came an assassination attempt against former President Trump.",
    "url": "https://www.nytimes.com/2024/07/27/magazine/pete-buttigieg-interview-election-democrats.html?unlocked_article_code=1.-U0.ScME.1jqtmBa1p-Nu&smid=url-share"
  },
  {
    "text": "JD Vance, an Unlikely Friendship and Why It Ended  —  His political views differed from a transgender classmate's, but they forged a bond that lasted a decade — until Mr. Vance seemed to pivot, politically and personally.  —  When his book, “Hillbilly Elegy,” was published in 2016 … ",
    "url": "https://www.nytimes.com/2024/07/27/us/politics/jd-vance-friend-transgender.html?unlocked_article_code=1.-U0.Leu-.RgRLUedl-zbL&smid=url-share"
  },
  {
    "text": "5 Excerpts From JD Vance's Emails to a Transgender Classmate  —  A former Yale Law School classmate shared with The Times about 90 emails and text messages with Mr. Vance.  Here are some of the most revealing moments in their correspondence.  —  As Senator JD Vance seeks the vice presidency … ",
    "url": "https://www.nytimes.com/2024/07/27/us/jd-vance-emails-transgender-classmate-highlights.html?unlocked_article_code=1.-U0.0o22.h4tNePHHg-VH"
  },
  {
    "text": "Could Josh Shapiro win Kamala Harris the Electoral College?  —  Do home-state effects matter?  —  In a change from four years ago, when neither Kamala Harris nor Mike Pence were from anything resembling a swing state  —  1, Harris — now heading the Democratic ticket … ",
    "url": "https://www.natesilver.net/p/could-josh-shapiro-win-kamala-harris"
  },
  {
    "text": "Harris' Running-Mate Search Zeroes In on Three Top Contenders  — Kelly, Shapiro, Walz are in top tier for vice presidential run  —  Vice President Kamala Harris is zeroing in on a group of potential running mates, as she faces a two-week dash to make the biggest decision of her nascent presidential bid.",
    "url": "https://www.bloomberg.com/news/articles/2024-07-27/kamala-harris-vice-presidential-search-focuses-on-3-candidates"
  },
  {
    "text": "Usha Vance told friends Trump appalled her.  Now she's working to elect him.  —  The potential second lady found Trump's actions on Jan. 6 “deeply disturbing,” a friend said.  But ambition and devotion to her husband ultimately drove her to a place in the former president's campaign.",
    "url": "https://www.washingtonpost.com/politics/2024/07/27/usha-vance-trump-jan6/"
  },
  {
    "text": "Dems Go All-In on Blasting Trump and MAGA as ‘Sick Freaks Who Everyone Hates’  —  After years of trying to stay above the fray, Democrats are going after Trump, J.D. Vance, and MAGA Republicans for being “weird”  —  DEMOCRATS INSIST THEY are learning from their mistakes … ",
    "url": "https://www.rollingstone.com/politics/politics-features/democrats-harris-trump-vance-weird-freaks-1235069189/"
  },
  {
    "text": "How ‘cat lady’ became an insult for women of a certain age  —  The stereotypical “cat lady” is one of pop culture's most bizarre characters — and easiest punching bags.  —  She's “The Simpsons” recurring character Eleanor Abernathy, a reclusive resident of Springfield who speaks in gibberish and hurls her cats at passersby.",
    "url": "https://www.cnn.com/2024/07/27/us/cat-lady-explained-cec/"
  },
  {
    "text": "The Seagulls Descend  —  So I guess it's time to write about elections.  —  In the United States, I've noticed that elections seem to be a time for politically activated people to come together to bicker and fight and make points that everyone has already heard and considered … ",
    "url": "https://www.the-reframe.com/the-seagulls-descend/"
  },
  {
    "text": "Harris' Zoom-fueled campaign triggers a dormant Democratic base  —  They logged on.  They raised millions.  —  When a group of Black women political organizers assembled for a regular Zoom call on Sunday, they suddenly had a new mission.  A mere hours earlier, President Joe Biden had ended … ",
    "url": "https://www.politico.com/news/2024/07/27/kamala-harris-identity-zoom-00171489"
  },
  {
    "text": "Major Democratic donors want Kamala Harris to fire the FTC chair if she becomes president  —  FTC Chair Lina Khan has taken an aggressive approach to antitrust enforcement  —  Not even a week after Kamala Harris took over as the Democratic presidential nominee, major donors are already making demands of her potential administration.",
    "url": "https://qz.com/kamala-harris-democrat-donor-ftc-lina-khan-linkedin-iac-1851606256"
  },
  {
    "text": "Biden to announce plans to reform US supreme court - report  —  US president also to seek constitutional amendment to limit immunity for presidents and various officeholders  —  Joe Biden will announce plans to reform the US supreme court on Monday, Politico reported, citing two people familiar … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jul/26/biden-to-announce-plans-to-reform-us-supreme"
  }
]