[
  {
    "text": "The Washington Post's New Mission: Reach ‘All of America’  —  This week, The Post began trying out a new mission statement: “Riveting Storytelling for All of America.”  —  After Donald J. Trump entered the White House in 2017, The Washington Post adopted a slogan that underscored … ",
    "url": "https://www.nytimes.com/2025/01/16/business/media/the-washington-post-new-mission.html?unlocked_article_code=1.pk4.Ab-S.xYMT0tmhkUl8&smid=url-share"
  },
  {
    "text": "Pelosi not attending Trump inauguration  —  Former Speaker Nancy Pelosi (D-Calif.) will not be attending President-elect Trump's inauguration on Monday, her spokesperson confirmed to The Hill.  —  Pelosi returned to Washington earlier this month for the entrance of the new class of lawmakers … ",
    "url": "https://thehill.com/homenews/house/5089322-nancy-pelosi-trump-inauguration/"
  },
  {
    "text": "Elon Musk to speak at Trump's inauguration weekend rally  —  The rally, which will be held in downtown Washington, D.C. on the day before Trump's inauguration ceremony, will also feature Hulk Hogan, Kid Rock and The Village People.  —  Elon Musk is among the opening speakers … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/elon-musk-speak-trump-inauguration-weekend-rally-rcna188047"
  },
  {
    "text": "Giuliani Keeps His Home in Settlement of Defamation Case  —  The former mayor of New York City was at risk of forfeiting his sole remaining home, a Palm Beach apartment, to election workers he defamed after the 2020 vote.  —  Rudolph W. Giuliani has reached a settlement with two Georgia election workers … ",
    "url": "https://www.nytimes.com/2025/01/16/nyregion/rudy-giuliani-defamation-damages-condo-rings.html?unlocked_article_code=1.pk4.0Bq1.gHNdRkKx3_CW&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "I knew one day I'd have to watch powerful men burn the world down - I just didn't expect them to be such losers  —  Elon Musk and Mark Zuckerberg's desperation to be cool as they suck up to Donald Trump is so cringe it makes my skin crawl  —  I don't know if anyone else has noticed … ",
    "url": "https://www.theguardian.com/commentisfree/2025/jan/16/i-knew-one-day-id-have-to-watch-powerful-men-burn-the-world-down-i-just-didnt-expect-them-to-be-such-losers"
  },
  {
    "text": "Mike Johnson faces bipartisan shock, fury for ousting Intel chair … - Turner's replacement is Rep. Rick Crawford (R-Ark.), who is closer to MAGA world on issues like Ukraine, Axios' Hans Nichols reported. … - “This is not a President Trump decision. … - “It's a new Congress.",
    "url": "https://www.axios.com/2025/01/16/mike-johnson-turner-intelligence-committee-anger"
  },
  {
    "text": "Rep. Rick Crawford expected to serve as House Intelligence chair  —  Speaker Mike Johnson is expected to choose Rep. Rick Crawford (R-Ark.) as the next chair of the House Intelligence Committee, two people familiar with Johnson's intentions said.  Johnson on Wednesday removed former Chair Mike Turner … ",
    "url": "https://www.politico.com/live-updates/2025/01/16/congress/crawford-to-be-named-house-intel-chair-00198644"
  },
  {
    "text": "Stephen Miller, Channeling Trump, Has Built More Power Than Ever … In less than a decade, Stephen Miller has risen from an anti-immigrant agitator on Capitol Hill to one of the most powerful unelected people in America.Doug Mills/The New York Times  —  When Stephen Miller met with Mark Zuckerberg … ",
    "url": "https://www.nytimes.com/2025/01/16/us/politics/stephen-miller-trump.html?unlocked_article_code=1.pk4.bIb0.BWyB-KWYxZ6u&smid=url-share"
  },
  {
    "text": "Far-right state senator arrested for trying to enter the Georgia House  —  State Sen. Colton Moore last year was banned from House chambers by the speaker.  —  A northwest Georgia senator was arrested Thursday after he refused to abide by a ban on entering the House chamber made by the speaker last year … ",
    "url": "https://www.ajc.com/politics/far-right-state-senator-detained-for-trying-to-enter-the-georgia-house/XPUPERQTCNANTI474T5P52CRSY/"
  },
  {
    "text": "Trump's Billionaire Treasury Pick Stresses Importance of Tax Cuts for Billionaires  —  Scott Bessent outlined his plan to enrich the rich and screw the poor during his confirmation hearing before the Senate Banking Committee  —  President-elect Donald Trump's Treasury Secretary pick … ",
    "url": "https://www.rollingstone.com/politics/politics-news/scott-bessent-treasury-secretary-nominee-tax-cuts-rich-1235238195/"
  },
  {
    "text": "Ex-CNN Analyst Tears Into Jill Biden For Being ‘Driving Force’ Behind Her Husband's Decision To Run Again  —  Former CNN political analyst Chris Cillizza criticized First Lady Jill Biden Thursday for her role in President Joe Biden's decision to run for reelection in 2024.",
    "url": "https://dailycaller.com/2025/01/16/chris-cillizza-jill-biden-blame-joe-biden-campaign/"
  },
  {
    "text": "An Expert in Grand Strategy Thinks Trump Is on to Something  —  Do you want a future in which Canada defects to the EU, Russia rules the Arctic and China runs Latin America?  That's the default outcome of non-action.  —  Our inbound president Donald Trump generates torrents of diplomatic angst … ",
    "url": "https://www.politico.com/news/magazine/2025/01/16/logic-trump-global-ambitions-canada-europe-greenland-00198656"
  },
  {
    "text": "FBI closed DEI office in December, agency says  —  EXCLUSIVE: The FBI has closed its DEI office, Fox News can confirm.  —  “In recent weeks, the FBI took steps to close the Office of Diversity and Inclusion (ODI), effective by December 2024,” the agency told Fox News Digital on Thursday.",
    "url": "https://www.foxnews.com/politics/fbi-closed-dei-office-december-agency-says"
  },
  {
    "text": "Eric Adams Heads to Mar-a-Lago to Meet With Trump  —  The New York mayor, who is under federal indictment, has spoken warmly about President-elect Donald J. Trump in recent weeks and has said he is open to receiving a pardon from him.  —  Mayor Eric Adams of New York City was on his way to Florida … ",
    "url": "https://www.nytimes.com/2025/01/16/nyregion/eric-adams-trump-mar-a-lago.html"
  },
  {
    "text": "Trump Picks a Jet-Setting Pal of Elon Musk to Go Get Greenland  —  Negotiations over an 836,000-square-mile island may fall to a close friend of Elon Musk with experience in deal-making.  Just not that kind of deal-making.  —  Ken Howery is a quiet, unassuming tech investor who prioritizes discretion.",
    "url": "https://www.nytimes.com/2025/01/16/us/politics/elon-musk-donald-trump-greenland.html"
  },
  {
    "text": "The House Democrat who wants Trump to go big on tariffs  —  Most Democrats are preparing to criticize Trump's tariff policies as too far-reaching.  Maine's Jared Golden says his party should embrace protectionism.",
    "url": "https://www.washingtonpost.com/business/2025/01/16/trump-tariffs-golden-democrats/"
  },
  {
    "text": "Donald Trump vows to help ‘troubled’ Hollywood with Mel Gibson, Jon Voight and Sylvester Stallone  —  Donald Trump wants to make Hollywood “bigger, better and stronger” and has cast Mel Gibson, Jon Voight and Sylvester Stallone as stars of what he is calling his “Special Ambassadors to a great … ",
    "url": "https://apnews.com/article/trump-hollywood-ambassadors-b3cd35a950fc6465c32551624feea332"
  },
  {
    "text": "Famed cartoonist with Bay Area ties arrested on child porn charges  —  Darrin Bell, 49, who got his start at UC Berkeley, was arrested in Sacramento County  —  A Pulitzer Prize-winning cartoonist with Bay Area ties has been arrested in Sacramento County on suspicion of child pornography.",
    "url": "https://www.nbcbayarea.com/news/california/cartoonist-arrested-child-porn/3762634/"
  },
  {
    "text": "A Euphoric Tech Industry Is Ready to Celebrate Trump and Itself  —  The elite of Silicon Valley are set to revel in their new clout during a long weekend of inaugural parties as President-elect Donald J. Trump is set to resume power.  —  A party at the Beaux-Arts mansion of the venture capitalist Peter Thiel.",
    "url": "https://www.nytimes.com/2025/01/16/us/politics/trump-tech-inauguration-parties.html?unlocked_article_code=1.pk4.RBH5.Oa0m4DY7KFu3&smid=url-share"
  },
  {
    "text": "Trump's attorney general pick owned at least $3.9 million in Truth Social stock and made $1 million as a lobbyist last year  — Pam Bondi owned $3.9 million in Truth Social stock as of mid-December, per financial documents.  — She also earned more than $1 million last year from lobbying.",
    "url": "https://www.businessinsider.com/pam-bondi-truth-social-stock-lobbying-financial-disclosure-2025-1"
  },
  {
    "text": "You Blamed DEI for Hurting Your Career.  Now What?  —  For people who pin their failures on diversity, corporate America's DEI retreat removes a barrier—or maybe an excuse  —  I hear from them all the time.  —  “Add one more to your list of aggrieved white males,” a reader wrote to me recently.",
    "url": "https://www.wsj.com/lifestyle/careers/you-blamed-dei-for-hurting-your-career-now-what-6150c575"
  },
  {
    "text": "Karine Jean-Pierre leaves reporters fuming as she blocks hostage-deal expert from final White House briefing for her ‘goodbye party’  —  WASHINGTON — Journalists and aides to President Biden are seething over White House press secretary Karine Jean-Pierre's refusal to let a national security expert discuss … ",
    "url": "https://nypost.com/2025/01/16/us-news/karine-jean-pierre-blocked-hostage-deal-expert-from-her-goodbye-party-white-house-briefing/"
  },
  {
    "text": "Breaking: Judge who wanted to ban mifepristone refuses to dismiss case  —  The federal judge who unsuccessfully tried to ban the medication abortion drug mifepristone nationwide back in 2023 announced on Thursday that he is keeping a version of the case alive for now.",
    "url": "https://www.lawdork.com/p/breaking-judge-who-wanted-to-ban"
  },
  {
    "text": "Moon added to list of threatened cultural sites for first time  —  Potential looting and commercial trips pose risk to artefacts left by lunar landings, says World Monuments Fund  —  The moon has been placed on a list of threatened heritage sites, owing to fears of potential looting and destruction caused by planned commercial trips.",
    "url": "https://www.theguardian.com/culture/2025/jan/16/moon-list-threatened-cultural-sites"
  },
  {
    "text": "Meta Is Laying the Narrative Groundwork for Trump's Mass Deportations  —  With Meta's recent speech policy changes regarding immigration, in which the company will allow people to call immigrants pieces of trash, Mark Zuckerberg is laying the narrative groundwork for President-elect Trump's … ",
    "url": "https://www.404media.co/meta-is-laying-the-narrative-groundwork-for-trumps-mass-deportations-2/"
  }
]