[
  {
    "text": "Speaker Kevin McCarthy On The Attack On Israel And What The GOP Caucus Must Do Next  —  Speaker Kevin McCarthy joined me this morning:  —  Audio:  —  10-09hhs-mccarthy  —  Transcript:  —  HH: I'm joined by Speaker Kevin McCarthy, longtime friend of mine and of the program.  Good morning, Mr. Speaker.",
    "url": "https://hughhewitt.com/speaker-kevin-mccarthy-on-the-attack-on-israel-and-what-the-gop-caucus-must-do-next"
  },
  {
    "text": "McCarthy does not rule out returning as Speaker if GOP deadlocked  —  Former Speaker Kevin McCarthy (R-Calif.) did not rule out returning to the post if the House Republican Conference cannot decide on a replacement.  —  Conservative radio host Hugh Hewitt asked McCarthy … ",
    "url": "https://thehill.com/homenews/house/4245422-mccarthy-returning-speaker-gop-deadlocked/"
  },
  {
    "text": "Republicans respond to attack on Israel by demonstrating their unfitness  —  From Tim Scott to Trump, they couldn't resist smearing Biden with shameless lies. … During a Fox News hit Saturday, RNC Chair Ronna McDaniel reacted to Hamas's attack on Israel by calling it a “great opportunity” for Republican candidates.",
    "url": "https://www.publicnotice.co/p/hamas-attack-israel-republican-responses-lies"
  },
  {
    "text": "Nikki Haley Raises $11 Million, Battling With DeSantis to Take on Trump  —  The former South Carolina governor has made gains in recent months — in fund-raising and polling — that have helped her compete for the No. 2 spot in the primary field.  —  Nikki Haley, the former governor of South Carolina … ",
    "url": "https://www.nytimes.com/2023/10/09/us/politics/haley-fundraising-2024-desantis.html"
  },
  {
    "text": "Playbook: Mideast in crisis, House in paralysis  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  WHAT EVERYONE IS READING — “Iran Helped Plot Attack on Israel Over Several Weeks,” by WSJ's Summer Said, Benoit Faucon and Stephen Kalin … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/09/mideast-in-crisis-house-in-paralysis-00120582"
  },
  {
    "text": "A Fake Loan Could Mean Real Trouble for George Santos  —  Representative George Santos was seemingly implicated in a fraudulent loan scheme that his treasurer admitted in her guilty plea.  —  Of all of the revelations to emerge from the federal prosecution of Representative George Santos's treasurer … ",
    "url": "https://www.nytimes.com/2023/10/09/nyregion/george-santos-nancy-marks.html"
  },
  {
    "text": "As false war information spreads on X, Musk promotes unvetted accounts  —  Information researchers said that the new outbreak of violence between Israel and Hamas is an early test of how the revamped X conveys accurate data during a major crisis.  —  As false information … ",
    "url": "https://www.washingtonpost.com/technology/2023/10/08/israel-hamas-disinfo-musk-twitter-x/"
  },
  {
    "text": "The Roots of Today's Authoritarianism Come From a 19th Century Supreme Court Ruling  —  In 1883, the Supreme Court refused to do away with racial segregation.  And that's helped set the stage for today's massive resistance to multiracial power.  —  A new Supreme Court term is upon us … ",
    "url": "https://www.politico.com/news/magazine/2023/10/09/supreme-court-history-race-authoritarianism-00119955"
  },
  {
    "text": "Putinite Republicans are disgracing America  —  Former House Speaker Kevin McCarthy (R-CA) was a victim of Russian propaganda.  Not directly, of course.  The Kremlin has more immediate things to worry about than who is the speaker of the House of Representatives.",
    "url": "https://www.washingtonexaminer.com/opinion/columnists/putinite-republicans-are-disgracing-america"
  },
  {
    "text": "Vietnam tried to hack U.S. officials, CNN with posts on X, probe finds  —  The attempts appear to have been unsuccessful, but came as the U.S. and Vietnam were negotiating an agreement that President Biden signed last month in Hanoi  —  Vietnamese government agents tried to plant spyware … ",
    "url": "https://www.washingtonpost.com/technology/2023/10/09/vietnam-predator-hack-investigation/"
  },
  {
    "text": "Scoop: Netanyahu tells Biden “we have to go” into Gaza … “We have to go in,” the Israeli leader said, according to three Israeli and U.S. sources briefed on the call. … - “We have to go in. … - The White House and the Israeli Prime Minister's Office declined to comment.",
    "url": "https://www.axios.com/2023/10/09/netanyahu-ground-invasion-gaza-israel-hamas-biden"
  },
  {
    "text": "White House blasted for throwing barbecue as war rages in Israel  —  The White House came under criticism on Sunday for holding a barbecue with a live band while war continues to rage in Israel, with United States citizens confirmed to be among the deceased after Hamas's surprise terror attacks.",
    "url": "https://www.washingtonexaminer.com/news/white-house/bbq-criticism-war-israel"
  },
  {
    "text": "Eyewitness Account of the Rave Massacre  —  Scenes of young women raped next to the dead bodies of their friends  —  I've spent the last 12 hours speaking to Israelis who were at the Supernova music festival.  Their testimonies, as you would imagine, are very emotional.",
    "url": "https://www.tabletmag.com/sections/news/articles/israel-music-festival-massacre-eyewitness-account"
  },
  {
    "text": "Union workers go on strike at Mack Trucks  —  Around 4,000 union workers at Mack Trucks facilities went on strike Monday morning after rejecting a tentative contract Sunday evening.  —  Striking Mack workers in Pennsylvania, Maryland and Florida are represented by the United Auto Workers … ",
    "url": "https://thehill.com/business/4245592-union-workers-go-on-strike-at-mack-trucks/"
  },
  {
    "text": "Tuberville won't bend on military blockade amid Israel crisis  —  After Hamas attacked Israel, Senate Democrats said it was past time for several top-level military nominees to be approved.  —  Sen. Tommy Tuberville is not relenting from his monthslong blockade of military nominations … ",
    "url": "https://www.politico.com/news/2023/10/08/tuberville-blockade-israel-military-00120525"
  }
]