[
  {
    "text": "No Labels Will Abandon 2024 Presidential Campaign Effort  —  The centrist group plans to announce it won't field a third-party ‘unity ticket’ after months of failing to find a candidate to lead its effort  —  WASHINGTON—No Labels, the centrist group which has sought to field a third-party presidential bid … ",
    "url": "https://www.wsj.com/politics/elections/no-labels-will-abandon-2024-presidential-campaign-effort-4b4e5121"
  },
  {
    "text": "Centrist group No Labels won't field a ticket in the presidential election  —  The group said in a statement that it had not identified candidates “with a credible path to winning the White House.”  —  The centrist group No Labels abandoned its ambitions for a third-party 2024 presidential … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/04/no-labels-no-presidential-ticket/"
  },
  {
    "text": "No Labels abandons 2024 presidential effort  —  The bipartisan group No Labels won't put forward a third-party presidential ticket after failing to find a candidate, multiple outlets have reported.  —  No Labels will reportedly announce Monday that it hasn't been able to recruit … ",
    "url": "https://thehill.com/homenews/campaign/4575052-no-labels-party-passes-2024-election-candidate/"
  },
  {
    "text": "Is Trump's $175 million civil fraud bond valid in New York?  —  When former President Donald Trump posted a $175 million bond in New York on Monday, it appeared that he had evaded a financial crisis.  He had paused enforcement of the more than $460 million judgment against him following a civil fraud trial, while his appeal is pending.",
    "url": "https://www.cbsnews.com/news/donald-trump-175-million-civil-fraud-bond-valid-new-york/"
  },
  {
    "text": "Playbook: How Mike Johnson boxed himself in  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  WHAT JEN O'MALLEY DILLON IS READING — The GOP-backed bid to change Nebraska's presidential elector system to a winner-take-all setup — likely giving DONALD TRUMP … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/04/04/how-mike-johnson-boxed-himself-in-00150544"
  },
  {
    "text": "Scoop: Johnson faces new pressure from Democrats on foreign aid … - “He's a bit boxed in,” one House Democrat said of Johnson. … - “No matter which path he walks down ... one's with alligators, one's with piranhas. … - In addition to Ukraine and Gaza, the letter calls for aid to Sudan … ",
    "url": "https://www.axios.com/2024/04/04/mike-johnson-ukraine-aid-bill-israel"
  },
  {
    "text": "Biden moves to defang political assaults on federal workforce  —  The move is widely seen as a response to former President Donald Trump's efforts to root out what he called a “deep state” that thwarted his policies.  —  The Biden administration put the finishing touches Thursday on a plan … ",
    "url": "https://www.politico.com/news/2024/04/04/biden-moves-to-defang-political-assaults-on-federal-workforce-00150446"
  },
  {
    "text": "G.O.P. Congressman's Wild Claim: F.B.I. Entrapped Jan. 6 Rioters  —  More than three years after the attack on Congress, a Republican subcommittee chairman offered a series of baseless and disproved claims about it, reflecting an effort on the right to falsify what occurred.",
    "url": "https://www.nytimes.com/2024/04/04/us/politics/clay-higgins-jan-6.html"
  },
  {
    "text": "Former President Donald Trump On Israel's War, 2024 And Much More  —  Former President Donald Trump joined me this morning:  —  Audio:  —  04-04hhs-trump  —  Transcript:  —  HH: Joined by our very special guest, former President Donald Trump.  Mr. President, welcome back.",
    "url": "https://hughhewitt.com/former-president-donald-trump-on-israels-war-2024-and-much-more"
  },
  {
    "text": "Biden says U.S. economy is world's best.  Trump calls it a ‘cesspool.’ Data is clear. … U.S. President Joe Biden, delivers remarks on the U.S. economy and his administration's effort to revive American manufacturing, during his visit in Flex LTD, a factory that makes solar energy microinverters … ",
    "url": "https://www.cnbc.com/2024/04/04/biden-us-economy-worlds-best-trump-claims-cesspool-data-is-clear.html"
  },
  {
    "text": "Trump tests gag order by sharing articles on judge's family  —  Former President Trump shared articles critical of Judge Juan Merchan and his family on Wednesday, appearing to test the bounds of the gag order placed on Trump in his New York hush money case.  —  Merchan expanded the gag order Monday … ",
    "url": "https://thehill.com/regulation/court-battles/4574362-trump-tests-gag-order-by-sharing-articles-on-judges-family/"
  },
  {
    "text": "Attempt to consolidate Electoral College votes fails in Nebraska Legislature  —  ‘Winner-take-all’ change would eliminate Democrats' opportunity to repeat the 2020 ‘blue dot’ win for Biden  —  LINCOLN, Neb. (WOWT) - An attempt to turn Nebraska into a “winner-take-all” state … ",
    "url": "https://www.wowt.com/2024/04/03/nebraska-lawmakers-pushing-consolidate-states-electoral-college-votes/"
  },
  {
    "text": "The Washington press corps doesn't have a freaking clue  —  I've been away for nearly two weeks, almost entirely unplugged, and let me tell you, a little distance makes the failure of the American political press even more horrifying and inexcusable.  —  The nation stands on the edge of a precipice … ",
    "url": "https://presswatchers.org/2024/04/the-washington-press-corps-doesnt-have-a-freaking-clue/"
  },
  {
    "text": "Louisiana HB 777 Would Criminalize Librarians and Libraries Who Join the American Library Association  —  Despite the fact that l ibrarians are among the most trusted professionals, per data acquired in several studies of parents on the perceptions of the profession, lawmakers across … ",
    "url": "https://bookriot.com/louisiana-hb-777/"
  },
  {
    "text": "Evicted, arrested and being sued by the boss: When will MAGA learn loyalty to Trump ends in sorrow?  —  Another week, another round of people destroying their lives while Trump skates free of consequences  —  When I saw the news that the stock price of Truth Social went into freefall … ",
    "url": "https://www.salon.com/2024/04/04/evicted-arrested-and-being-sued-by-the-boss-when-will-maga-learn-loyalty-to-ends-in-sorrow/"
  },
  {
    "text": "Bird flu pandemic could be ‘100 times worse’ than COVID, scientists warn  —  A bird flu pandemic with the potential to be “100 times worse than COVID” may be on the horizon after a rare human case was discovered in Texas, experts have warned.  —  The H5N1 avian flu has spread rapidly since … ",
    "url": "https://nypost.com/2024/04/04/us-news/bird-flu-pandemic-could-be-100-times-worse-than-covid-scientists-warn/"
  },
  {
    "text": "Reps. Andy Biggs, Paul Gosar subpoenaed in Arizona probe of Trump fake electors  —  The Arizona attorney general is nearing a decision on whether to charge Trump allies with crimes, but there is no indication Biggs or Gosar will face charges.  —  Arizona investigators probing Republicans' efforts … ",
    "url": "https://www.politico.com/news/2024/04/04/biggs-gosar-arizona-subpoenas-00150416"
  },
  {
    "text": "Jeffrey Clark's bid to aid Trump election scheme violated attorney rules, DC Bar panel finds  —  Disciplinary investigators who brought the charges against Clark say they intend to advocate for his disbarment.  —  A disciplinary panel in Washington has found that Jeffrey Clark … ",
    "url": "https://www.politico.com/news/2024/04/04/jeffrey-clark-ethics-rules-00150631"
  },
  {
    "text": "How Trump's story about Ruby Garcia's family went horribly awry  —  Donald Trump boasted about speaking to members of a murder victim's family.  It now appears he made that up.  —  In light of Donald Trump's overtly anti-immigrant platform, it wasn't too surprising to see the Republican seize … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trumps-story-ruby-garcias-family-went-horribly-awry-rcna146351"
  },
  {
    "text": "Missouri's ridiculous lawfare against Media Matters  —  AG Andrew Bailey is punishing the watchdog group for making Elon Musk sad. … Move over Ken Paxton!  There's a new crazy state attorney general in town, and he's coming for your crooked crown.  —  Last week, Missouri Attorney General … ",
    "url": "https://www.publicnotice.co/p/missouri-media-matters-lawsuit-ag-andrew-bailey"
  },
  {
    "text": "EPA awards $20 billion in green bank grants for clean energy projects nationwide  —  DETROIT (AP) — The Environmental Protection Agency on Thursday awarded $20 billion in federal “green bank” grants to eight community development banks and nonprofit organizations to use on projects combating climate change … ",
    "url": "https://apnews.com/article/epa-billions-clean-green-energy-community-grants-8f6c76cb41783a5e838ac4f7f7cce086"
  },
  {
    "text": "Forecasters warn of ‘extremely active’ hurricane season  —  Colorado State University (CSU) researchers warned of an “extremely active” Atlantic hurricane season, in a for e cast released Thursday.  —  CSU's Tropical Weather & Climate research forecasted that there will be 23 named storms … ",
    "url": "https://thehill.com/policy/energy-environment/4574561-atlantic-hurricane-season-2024-forecast/"
  },
  {
    "text": "Anti-Israel ‘Squad’ Rep. Jamaal Bowman trails rival George Latimer by 17 points  —  Far-left “Squad” Rep. Jamaal Bowman is in deep trouble in his bid for a third term in the House of Representatives.  —  In a shocking new poll obtained exclusively by The Post Wednesday … ",
    "url": "https://nypost.com/2024/04/03/us-news/rep-jamaal-bowman-trails-rival-george-latimer-by-17-points/"
  },
  {
    "text": "Louisiana governor unleashes ridiculous attack on LSU women's basketball team  —  The conservative movement is manufacturing controversies at a rapid pace these days, and making their followers look completely ridiculous in the process.  —  Over the last week the right-wing rage machine … ",
    "url": "https://www.msnbc.com/the-reidout/reidout-blog/jeff-landry-lsu-national-anthem-rcna146286"
  }
]