[
  {
    "text": "President Biden and Barack Obama Rip Donald Trump During Starry L.A. Fundraiser  —  Los Angeles Democrats and Hollywood stars like George Clooney, Julia Roberts and Barbra Streisand came out in full force on Saturday night for a record-setting fundraiser for Biden's reelection campaign.",
    "url": "https://www.hollywoodreporter.com/news/politics-news/biden-los-angeles-fundraiser-obama-kimmel-1235923818/"
  },
  {
    "text": "J.D. Vance for Trump's VP?  Here are the pros and cons of the 8 candidates on his shortlist  —  The former president is expected to announce his selection next month.  —  Donald Trump Jr. is urging his dad to pick a “fighter” as his running mate.  The elder Trump is locked in a general election … ",
    "url": "https://www.politico.com/news/2024/06/17/trump-vp-pick-list-pros-cons-00162820"
  },
  {
    "text": "Conservative grassroots activists want JD Vance as Trump's VP pick: Straw poll shows Ohio senator as the runaway leader ahead of Rubio, Burgum and Scott among Turning Point Action attendees  — J.D. Vance is one of four ‘finalists’ in the race to be Donald Trump's running mate",
    "url": "https://www.dailymail.co.uk/news/article-13535551/jd-vance-vp-donald-trump-poll-burgum-scott.html"
  },
  {
    "text": "Maryland governor to pardon 175,000 marijuana convictions in sweeping order  —  The blanket pardon by Gov. Wes Moore is among the country's most far reaching and will forgive decades of low-level marijuana possession charges for an estimated 100,000 people.  —  Maryland Gov. Wes Moore … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/06/16/maryland-mass-pardon-marijuana-conviction/"
  },
  {
    "text": "New Polling Shows the Real Fallout From the Trump Conviction  —  A new POLITICO Magazine/Ipsos poll shows that Trump's criminal conviction hurts him with independents.  —  Donald Trump's criminal conviction didn't instantly upend the 2024 presidential race.  But the results of a new poll should be worrying for Trump.",
    "url": "https://www.politico.com/news/magazine/2024/06/17/trouble-for-trump-in-a-new-poll-on-his-conviction-00163498"
  },
  {
    "text": "Hochul's bet against congestion pricing is backfiring  —  Blocking an unpopular New York City toll program has alienated many of the governor's key supporters.  —  NEW YORK — Gov. Kathy Hochul is facing political consequences for her congestion pricing reversal.",
    "url": "https://www.politico.com/news/2024/06/17/hochul-congestion-pricing-problems-00163601"
  },
  {
    "text": "White House Fumes at Trumpworld's Latest ‘Cheap Fake’ Video  —  NOT AGAIN!  —  Another deceptively cut video of President Joe Biden is being circulated by right-wing pundits and media outlets-and the White House is not happy.  —  Less than a week after being derided for using … ",
    "url": "https://www.thedailybeast.com/no-president-biden-didnt-freeze-at-star-studded-hollywood-fundraiser"
  },
  {
    "text": "Democratic senator calls Supreme Court “brazenly corrupt” … - Justice Clarence Thomas has been scrutinized for failing to report luxury trips gifted to him by GOP megadonor Harlan Crow and his wife's involvement in efforts to overturn the 2020 presidential election.",
    "url": "https://www.axios.com/2024/06/16/supreme-court-corrupt-chris-murphy"
  },
  {
    "text": "The Resistance to a New Trump Administration Has Already Started  —  An emerging coalition that views Donald J. Trump's agenda as a threat to democracy is laying the groundwork to push back if he wins in November, taking extraordinary pre-emptive actions.  —  Kica Matos with the National … ",
    "url": "https://www.nytimes.com/2024/06/16/us/politics/trump-2025-democratic-resistance.html"
  },
  {
    "text": "Half of the U.S. military bases nationwide are in ‘health care deserts’  —  For hundreds of thousands of U.S. troops and their families, when the Pentagon orders them to find health care off base there is none.  —  An NPR analysis found that 50% of active duty military installations stand … ",
    "url": "https://www.npr.org/2024/06/17/g-s1-4187/military-bases-shortage-health-care-troops-army-navy-marines"
  },
  {
    "text": "Trump's Spiritual Adviser Quasi-Confesses to Molesting 12-Year-Old Girl  —  HOLY MOLY  —  The senior pastor of megachurch Gateway Church said he engaged in “inappropriate sexual behavior” with a “young lady”—without noting the alleged victim was 12.  —  The pastor of one of the country's … ",
    "url": "https://www.thedailybeast.com/trumps-spiritual-adviser-robert-morris-half-confesses-to-molesting-12-year-old-girl"
  },
  {
    "text": "Trump Lets Loose With Unhinged Father's Day Message for His Enemies  —  BACK ON THE BANDWAGON  —  Trump did not mention any of his five children during his Father's Day rant, nor did he write about his feelings for his own family.  —  Donald Trump issued an angry and confrontational Father's … ",
    "url": "https://www.thedailybeast.com/trump-lets-loose-with-unhinged-fathers-day-message-for-his-enemies"
  },
  {
    "text": "Scoop: GOP smokes Johnson over loss of Capitol cigar space … - Given stark divisions and constant infighting in the House GOP conference, there's an argument for any arrangement that could help this crop of lawmakers build relationships. … - But after he became Appropriations chair … ",
    "url": "https://www.axios.com/2024/06/16/speaker-johnson-tom-cole-capitol-cigars"
  },
  {
    "text": "Man Plotted Mass Shooting in Atlanta to Incite ‘Race War,’ Officials Say  —  Prosecutors said Mark Adams Prieto of Arizona planned to target Black concertgoers at an Atlanta venue.  He was indicted on hate crime and firearm charges.  —  An Arizona man who planned to commit a mass shooting … ",
    "url": "https://www.nytimes.com/2024/06/16/us/atlanta-concert-shooting-plot.html"
  }
]