[
  {
    "text": "Nazis mingle openly at CPAC, spreading antisemitic conspiracy theories and finding allies  —  The presence of the individuals has been a persistent issue at CPAC, and in previous years, conference organizers have ejected well known nazis and white supremacists, such as Nick Fuentes.",
    "url": "https://www.nbcnews.com/news/us-news/nazis-mingle-openly-cpac-spreading-antisemitic-conspiracy-theories-fin-rcna140335"
  },
  {
    "text": "Trump says Black voters like him more because of his indictments and mug shot  —  The GOP candidate tells a group of Black conservatives: 'I'm being indicted for you, the Black population'  —  COLUMBIA, S.C. — Former President Trump sought to appeal to Black voters on Friday night … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/24/trump-black-voters-indicted-mug-shot/"
  },
  {
    "text": "Black leaders, DNC blast Trump for ‘racist’ comments  —  Black leaders are condemning former President Trump's recent comments about Black voters as “racist.”  —  Speaking at the Black Conservative Federation (BCF) annual gala in South Carolina on Friday, Trump said his legal woes have earned … ",
    "url": "https://thehill.com/homenews/race-politics/4486998-black-leaders-dnc-blast-trump-for-racist-comments/"
  },
  {
    "text": "Oklahoma senator calls LGBTQ+ people “filth” while commenting on death of Nex Benedict  —  At a legislative forum on Friday, Sen. Tom Woods emphasized the moral and Christian fortitude he aims to represent  —  During a legislative forum in Oklahoma on Friday sponsored by the Tahlequah Area Chamber … ",
    "url": "https://www.salon.com/2024/02/24/oklahoma-senator-calls-lgbtq-people-filth-while-commenting-on-of-nex-benedict/"
  },
  {
    "text": "Okla. lawmaker describes LGBTQ people as ‘filth’  —  State Sen. Tom Woods made comment on Friday  —  Republican Oklahoma state Sen. Tom Woods took part in a public legislative panel forum on Friday, during which the panel was asked by a constituent about the death of Nex Benedict … ",
    "url": "https://www.washingtonblade.com/2024/02/24/okla-lawmaker-describes-lgbtq-people-as-filth/"
  },
  {
    "text": "Joe Biden gives the media a desperately needed lesson about Donald Trump  —  The president has to break the news to journalists that Trump plans to jail us  —  The most disturbing thing I've ever heard a president say did not come from Donald Trump.  —  It came from Joe Biden.",
    "url": "https://www.salon.com/2024/02/24/joe-biden-gives-the-media-a-desperately-needed-lesson-about-donald/"
  },
  {
    "text": "Former U.S. spies warned in 2020 that the Hunter Biden scandal had Russian fingerprints.  They feel vindicated now.  —  The Justice Department said this week that informant Alexander Smirnov invented a story about $5 million bribes paid to Joe and Hunter Biden and is also “peddling new lies.”",
    "url": "https://www.nbcnews.com/politics/national-security/former-us-spies-warned-2020-hunter-biden-scandal-russian-fingerprints-rcna140240"
  },
  {
    "text": "They Came, They Saw, They Left Early: Trump Stumps in South Carolina  —  There are monsters to be found everywhere, even if they were not immediately visible outside Winthrop Coliseum in Rock Hill, South Carolina, at 10 am on a Friday morning.  It had been pouring on the drive from Columbia … ",
    "url": "https://newrepublic.com/article/179169/trump-rally-south-carolina-haley"
  },
  {
    "text": "Being Denied a Press Pass at CPAC Was the Best Way to Cover the Conference  —  This is what happened when MAGA people thought I was one of them.  —  I've attended the Conservative Political Action Conference almost yearly since 2009, always as a credentialed reporter.",
    "url": "https://www.motherjones.com/politics/2024/02/being-denied-a-press-pass-at-cpac-was-the-best-way-to-cover-the-conference/"
  },
  {
    "text": "Anderson Suspended After Claim London Mayor Controlled by Islamists  — Conservative Lee Anderson suspended for refusal to apologize  — GB News presenter has history of controversial remarks  —  A former deputy chairman in Rishi Sunak's ruling Conservatives has been suspended … ",
    "url": "https://www.bloomberg.com/news/articles/2024-02-24/tory-suspended-after-claim-london-mayor-controlled-by-islamists"
  },
  {
    "text": "Vindman: Trump's NATO threat likely a ‘contributing factor’ in Navalny's death  —  Retired Army Lt. Col. Alexander Vindman argued that former President Trump's recent comments about NATO are likely a “contributing factor” in the death of Russian opposition leader Alexei Navalny.",
    "url": "https://thehill.com/policy/international/4486707-vindman-trump-nato-threat-likely-contrinuting-factor-navalny-death/"
  },
  {
    "text": "RFK Jr.'s comedy night: Barbs for Biden, but the joke may be on Trump  —  The L.A. fundraiser featuring Adam Carolla, Jeremy Piven and others seemed to appeal to Kennedy-curious voters who might otherwise support the Republican  —  LOS ANGELES — There were plenty of moments during … ",
    "url": "https://www.washingtonpost.com/style/power/2024/02/22/rfk-jr-comedy-fundraiser-la/"
  },
  {
    "text": "This week, we faced all that the Dobbs justices unleashed  —  The five justices of the U.S. Supreme Court who overturned Roe v. Wade 20 months ago Saturday gave a green light to a new brand of Republican extremism in hyperdrive — a hyperdrive that has been on full, frightening display this week.",
    "url": "https://www.lawdork.com/p/dobbs-ivf-marriage-nex"
  },
  {
    "text": "G7 Leaders' Statement  —  We the Leaders of the Group of Seven (G7) met today with Ukrainian President Volodymyr Zelenskyy to reaffirm our unwavering support for Ukraine and salute once more the bravery and resilience of the Ukrainian people who have been fighting tirelessly for Ukraine's freedom and democratic future.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/24/g7-leaders-statement-7/"
  },
  {
    "text": "Beto O'Rourke supports uncommitted campaign in Michigan's Tuesday presidential primary  —  The Democratic former presidential candidate will be in Petoskey Saturday on a book tour  —  Former U.S. Rep. Beto O'Rourke (D-Texas) expressed support Friday for a campaign asking Democratic voters unhappy … ",
    "url": "https://michiganadvance.com/2024/02/24/beto-orourke-supports-uncommitted-campaign-in-michigans-tuesday-presidential-primary/"
  }
]