[
  {
    "text": "Details of Trump's $83.3 Million Payment to E. Jean Carroll  —  Donald J. Trump — the rare defendant who can afford a judgment of this size — could secure a bond to cover it while his appeals play out.  —  Donald J. Trump might one day have to pay E. Jean Carroll the $83.3 million she was awarded, but that day is not today.",
    "url": "https://www.nytimes.com/2024/01/26/nyregion/trump-carroll-pay-83-million.html"
  },
  {
    "text": "Verdict reached in E. Jean Carroll's defamation damages trial against Trump  —  The verdict comes after a dramatic day in court that included the former president storming out of the courtroom during Carroll's closing argument.  —  The jury in E. Jean Carroll's defamation damages trial … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/verdict-reached-e-jean-carrolls-defamation-damages-trial-trump-rcna135919"
  },
  {
    "text": "Trump's Court-Appointed Monitor Tells Judge Company Gave ‘Incomplete’ and ‘Inconsistent’ Disclosures with ‘Errors’  —  Court monitor Barbara Jones sent her letter to Justice Engoron, who will determine whether to ban Trump from New York real estate for life  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-barbara-jones-incomplete-inconsistent-disclosures-errors"
  },
  {
    "text": "Trump-Carroll Defamation Trial  —  Jury Orders Trump to Pay Carroll $83.3 Million for Years of Defamation  —  The jury found Donald J. Trump had acted maliciously in persistently attacking E. Jean Carroll.  He was found liable last year of sexually abusing her.  —  Jury orders Trump to pay Carroll damages for defamation.",
    "url": "https://www.nytimes.com/live/2024/01/26/nyregion/trump-carroll-defamation-trial"
  },
  {
    "text": "The 2024 door is closing faster than Haley thinks.  Here's what the delegate math shows.  —  Nikki Haley isn't wrong when she says it's early in the GOP primary — less than 3 percent of delegates have been awarded so far.  —  But the rest of the states are coming fast … ",
    "url": "https://www.politico.com/news/2024/01/27/republican-delegates-haley-trump-00138191"
  },
  {
    "text": "On Trump-Biden rematch, many senators say bring it on  —  Republicans and Democrats see the general election as historic moment pitting clearly different visions and records  —  Congressional bureau chief  —  Unlike some American voters, senators have come to grips with the reality … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/27/biden-trump-rematch-senators/"
  },
  {
    "text": "Trump Bashes ‘Worst’ Ever Border as He Arm-Twists GOP Lawmakers to Block Border Bill  —  Trump calls American border ‘worst ever in the history of the world,’ yet is working furiously behind the scenes to block bipartisan bill to boost security  —  Former President Donald Trump on Saturday attacked … ",
    "url": "https://themessenger.com/politics/trump-bashes-worst-ever-border-as-he-arm-twists-gop-lawmakers-to-block-border-bill"
  },
  {
    "text": "Trump's ‘achilles heel’?  Haley's refusal to drop out infuriates ex-president  —  A surprisingly disciplined campaign risks derailment as Trump lashes out at his former UN ambassador for staying in race  —  It was a moment for Donald Trump to be gracious, magnanimous, perhaps even presidential.",
    "url": "https://www.theguardian.com/us-news/2024/jan/27/donald-trump-nikki-haley-republican-nomination"
  },
  {
    "text": "Democrats' not-so-secret weapon in House races: Donald Trump  —  Democrats trying to claim competitive House seats in New York are hoping to tie GOP opponents to the former president.  —  ALBANY, N.Y. — A noun, a verb and Donald Trump.  —  Democrats are banking on the former president again … ",
    "url": "https://www.politico.com/news/2024/01/27/trump-election-house-races-00138162"
  },
  {
    "text": "Biden says he'll shut down the border if deal gives him authority  —  The White House statement comes after a week of frantic negotiations in the Senate.  —  President Joe Biden on Friday urged Congress to pass a bipartisan bill to address the immigration crisis at the nation's southern border … ",
    "url": "https://www.politico.com/news/2024/01/26/biden-urges-bipartisan-border-deal-00138206"
  },
  {
    "text": "US pauses funding to UN agency for Palestinians after claims staffers were involved in Hamas attack  —  UNRWA has been the main agency providing aid for Gaza's population amid the humanitarian disaster caused by Israel's offensive against Hamas in Gaza.  —  DEIR AL-BALAH, Gaza Strip … ",
    "url": "https://www.politico.com/news/2024/01/27/us-pauses-funding-to-un-agency-for-palestinians-after-claims-staffers-were-involved-in-hamas-attack-00138209"
  },
  {
    "text": "We Need Your Email Address  —  AI stealing our work.  The collapse of social networks.  The need to pay journalists to produce impactful journalism.  Here is why we are asking for your email address to read 404 Media. … You might have noticed that over the last few days … ",
    "url": "https://www.404media.co/why-404-media-needs-your-email-address/"
  },
  {
    "text": "Giuliani Notes Trump's ‘Unpaid Legal Fees’ in Bankruptcy Filing  —  He says his monthly net income is just $2,308.  —  A beleaguered and broke Rudy Giuliani listed a “possible claim for unpaid legal fees against Donald J. Trump” in bankruptcy filings submitted to court Friday.",
    "url": "https://www.thedailybeast.com/giuliani-notes-trumps-unpaid-legal-fees-in-bankruptcy-filing"
  },
  {
    "text": "Donald Trump is preparing for a massive new trade war with China  —  The former president has talked to advisers about imposing a 60 percent tariff sure to enrage Beijing  —  Former president Donald Trump is weighing options for a major new economic attack on China if reelected … ",
    "url": "https://www.washingtonpost.com/business/2024/01/27/trump-china-trade-war/"
  },
  {
    "text": "Trader Joe's Follows SpaceX in Arguing US Labor Board Is Unconstitutional  — Grocery chain tries new argument to fight union-busting charge  — Decision on constitutionality is unlikely before an appeal … At a Jan. 16 National Labor Relations Board hearing in Connecticut … ",
    "url": "https://www.bloomberg.com/news/articles/2024-01-26/trader-joe-s-follows-spacex-in-arguing-nlrb-is-unconstitutional"
  },
  {
    "text": "Trump Calls on ‘All Willing States’ to Send National Guard Soldiers to Texas  —  Sorry, were you expecting the former president to tell everyone to chill out?  —  Like pouring water on a grease fire, former President Donald Trump has weighed in on the escalating standoff between the federal government and Texas.",
    "url": "https://www.vice.com/en/article/epv7p7/trump-national-guard-texas-border-dispute-federal-government-standoff"
  },
  {
    "text": "The News Business Really Is Cratering  —  The state of the industry is more dire than ever.  —  Journalists across the country burst into flames of panic this week, as bad news for the news business crested and erupted everywhere all at once.  —  Patrick Soon-Shiong … ",
    "url": "https://www.politico.com/news/magazine/2024/01/27/is-the-journalism-death-spasm-finally-here-00138187"
  },
  {
    "text": "Eager for Economic Wins, Biden to Announce Billions for Advanced Chips  —  Industry, lawmakers worry semiconductor production could take years because of negotiations, permitting and worker shortages  —  WASHINGTON—The Biden administration, eager to highlight a signature economic initiative … ",
    "url": "https://www.wsj.com/politics/policy/eager-for-economic-wins-biden-to-announce-billions-for-advanced-chips-7e341e30?mod=followamazon"
  },
  {
    "text": "Cuomo Created ‘Sexually Hostile’ Workplace, Says Justice Department  —  Investigators found that the executive staff of Andrew Cuomo, the former governor, prioritized protecting him rather than the women accusing him of sexual harassment.  —  The Department of Justice concluded that former … ",
    "url": "https://www.nytimes.com/2024/01/26/nyregion/andrew-cuomo-justice-department-harassment.html"
  }
]