[
  {
    "text": "Johnson tells House Republicans that Trump wants one ‘big beautiful’ reconciliation package  —  Trump's decision is a win for House Ways & Means Chair Jason Smith.  —  Speaker Mike Johnson told Republicans on Saturday that President-elect Donald Trump wants one reconciliation package … ",
    "url": "https://www.politico.com/news/2025/01/04/johnson-trump-reconciliation-package-00196487"
  },
  {
    "text": "Washington Post cartoonist quits after paper rejects sketch of Bezos bowing to Trump  —  A cartoonist has decided to quit her job at the Washington Post after an editor rejected her sketch of the newspaper's owner and other media executives bowing before President-elect Donald Trump.",
    "url": "https://apnews.com/article/washington-post-trump-bezos-cartoonist-resigns-53928aadc4fb4dda8f35fd840b5717ac"
  },
  {
    "text": "A Pulitzer winner quits ‘Washington Post’ after a cartoon on Bezos is killed  —  A Pulitzer Prize-winning cartoonist for the Washington Post has resigned after its editorial page editor rejected a cartoon she created to mock media and tech titans abasing themselves before President-elect Donald Trump.",
    "url": "https://www.npr.org/2025/01/04/nx-s1-5248299/cartoonist-quits-wapo-over-bezos-trump-cartoon-washingtonpost"
  },
  {
    "text": "Washington Post cartoonist resigns over paper's refusal to publish cartoon critical of Jeff Bezos  —  Pulitzer prize winner Ann Telnaes drew a cartoon of the paper's owner kneeling before Donald Trump  —  The Washington Post's Pulitzer prize-winning editorial cartoonist Ann Telnaes has resigned … ",
    "url": "https://www.theguardian.com/media/2025/jan/04/washington-post-cartoonist-resigns-jeff-bezos"
  },
  {
    "text": "President Biden Announces Recipients of the Presidential Medal of Freedom  —  Today, President Biden named nineteen recipients of the Presidential Medal of Freedom.  —  The Presidential Medal of Freedom is the Nation's highest civilian honor, presented to individuals who have made exemplary contributions … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/04/president-biden-announces-recipients-of-the-presidential-medal-of-freedom-3/"
  },
  {
    "text": "Biden to present Hillary Clinton, George Soros and 17 others the Presidential Medal of Freedom  —  President Biden will award the Presidential Medal of Freedom, the nation's highest civilian honor, to former presidential candidate Hillary Clinton, billionaire Democratic megadonor George Soros … ",
    "url": "https://nypost.com/2025/01/04/us-news/biden-to-present-george-soros-hillary-clinton-and-17-others-the-presidential-medal-of-freedom/"
  },
  {
    "text": "The Militia and the Mole  —  Outraged by the Jan. 6 Capitol riot, a wilderness survival trainer spent years undercover climbing the ranks of right-wing militias.  He didn't tell police or the FBI.  He didn't tell family or friends.  The one person he told was a ProPublica reporter.",
    "url": "https://www.propublica.org/article/ap3-oath-keepers-militia-mole"
  },
  {
    "text": "Biden to block oil drilling across 625 million acres of U.S. waters  —  The president will sign memorandums prohibiting future oil and gas leasing across parts of the Atlantic Ocean, the Pacific Ocean, the eastern Gulf of Mexico and the Northern Bering Sea.  —  President Joe Biden … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/01/04/biden-offshore-oil-drilling/"
  },
  {
    "text": "Trump Has Reeled in More Than $200 Million Since Election Day  —  The president-elect has boasted about the donations for his inauguration, library and political activities from those seeking favor or perhaps in some cases, atonement.  —  Since his victory in November … ",
    "url": "https://www.nytimes.com/2025/01/04/us/politics/trump-inaugural-donations.html"
  },
  {
    "text": "US plans $8 billion arms sale to Israel, US official says  —  The administration of President Joe Biden has notified Congress of a proposed $8 billion arms sale to Israel, a U.S. official said on Friday, with Washington maintaining support for its ally whose war in Gaza has killed tens of thousands.",
    "url": "https://www.usatoday.com/story/news/world/2025/01/04/israel-arms-sale/77452408007/"
  },
  {
    "text": "Why Are Publications Sugar-Coating Livelsberger's Political Minifestos?  —  Over the last four days, the bizarre Cybertruck fire outside a Trump hotel in Las Vegas has run from comical interlude to possible terrorist incident to tragic suicide of another veteran of America's forever wars.",
    "url": "https://talkingpointsmemo.com/edblog/why-are-publications-sugar-coating-livilsbergers-political-minifestos"
  },
  {
    "text": "Trump 2.0 Is About Punishing the Vulnerable and Enriching the Mega Wealthy  —  Here's what to take away from Trump's reversal on H-1B visas — and what his policy approach means for the poor and the uber-wealthy like Elon Musk  —  Donald Trump led a virulently anti-immigrant campaign for president … ",
    "url": "https://www.rollingstone.com/politics/political-commentary/trump-second-term-punishing-vulnerable-enriching-wealthy-1235224656/"
  },
  {
    "text": "Italy's Prime Minister Visits Trump in Mar-a-Lago  —  Giorgia Meloni, the Italian prime minister, joins just a handful of other world leaders who have been to the president-elect's Florida estate since his victory.  —  Prime Minister Giorgia Meloni of Italy has gone to Mar-a-Lago … ",
    "url": "https://www.nytimes.com/2025/01/04/world/europe/italy-donald-trump-meloni-visit.html"
  },
  {
    "text": "Some Democrats said to be open to backing RFK Jr.  —  A handful of Senate Democrats are said to be leaving the door open to voting for Robert F. Kennedy Jr. to become the next Health and Human Services secretary.  —  As preparations for confirmation hearings begin to take shape … ",
    "url": "https://thehill.com/homenews/senate/5066601-senate-democrats-consider-rfk-jr/"
  },
  {
    "text": "Changing alcohol labels could take ‘decades’: Dr. Marion Nestle  — Surgeon general seeks to update alcohol label language, last changed in 1988  — Dr. Marion Nestle points to conflicting studies, political pitfalls  — Congress will decide whether to revise labels",
    "url": "https://thehill.com/policy/healthcare/5066791-surgeon-general-alcohol-labels/"
  }
]