[
  {
    "text": "McCarthy does not rule out returning as Speaker if GOP deadlocked  —  Former Speaker Kevin McCarthy (R-Calif.) did not rule out returning to the post if the House Republican Conference cannot decide on a replacement.  —  Conservative radio host Hugh Hewitt asked McCarthy … ",
    "url": "https://thehill.com/homenews/house/4245422-mccarthy-returning-speaker-gop-deadlocked/"
  },
  {
    "text": "House Republicans need to pick a new speaker.  Here's how that works.  —  House Republicans plan to gather Monday night in a closed-door, phones-off, members-only meeting to discuss where the conference goes next after their speaker, Rep. Kevin McCarthy (R-Calif.), was ousted in a historic vote last Tuesday.",
    "url": "https://www.washingtonpost.com/politics/2023/10/09/house-speaker-republicans/"
  },
  {
    "text": "‘The Diciest Thing’ Steve Scalise and Jim Jordan Are Battling Over  —  Both men know getting into detail on spending strategy could be fatal for their House speakership bids.  —  For years, a rotating cast of House GOP leaders have shared a fatal flaw: an inclination to only address their most immediate problems.",
    "url": "https://www.thedailybeast.com/the-diciest-thing-steve-scalise-and-jim-jordan-are-battling-over"
  },
  {
    "text": "Republicans respond to attack on Israel by demonstrating their unfitness  —  From Tim Scott to Trump, they couldn't resist smearing Biden with shameless lies. … During a Fox News hit Saturday, RNC Chair Ronna McDaniel reacted to Hamas's attack on Israel by calling it a “great opportunity” for Republican candidates.",
    "url": "https://www.publicnotice.co/p/hamas-attack-israel-republican-responses-lies"
  },
  {
    "text": "As false war information spreads on X, Musk promotes unvetted accounts  —  Information researchers said that the new outbreak of violence between Israel and Hamas is an early test of how the revamped X conveys accurate data during a major crisis.  —  As false information … ",
    "url": "https://www.washingtonpost.com/technology/2023/10/08/israel-hamas-disinfo-musk-twitter-x/"
  },
  {
    "text": "Putinite Republicans are disgracing America  —  Former House Speaker Kevin McCarthy (R-CA) was a victim of Russian propaganda.  Not directly, of course.  The Kremlin has more immediate things to worry about than who is the speaker of the House of Representatives.",
    "url": "https://www.washingtonexaminer.com/opinion/columnists/putinite-republicans-are-disgracing-america"
  },
  {
    "text": "Iran Helped Plot Attack on Israel Over Several Weeks  —  The Islamic Revolutionary Guard Corps gave the final go-ahead last Monday in Beirut  —  DUBAI—Iranian security officials helped plan Hamas's Saturday surprise attack on Israel and gave the green light for the assault at a meeting … ",
    "url": "https://www.wsj.com/world/middle-east/iran-israel-hamas-strike-planning-bbe07b25?mod=followamazon"
  },
  {
    "text": "Eyewitness Account of the Rave Massacre  —  Scenes of young women raped next to the dead bodies of their friends  —  I've spent the last 12 hours speaking to Israelis who were at the Supernova music festival.  Their testimonies, as you would imagine, are very emotional.",
    "url": "https://www.tabletmag.com/sections/news/articles/israel-music-festival-massacre-eyewitness-account"
  },
  {
    "text": "A Fake Loan Could Mean Real Trouble for George Santos  —  Representative George Santos was seemingly implicated in a fraudulent loan scheme that his treasurer admitted in her guilty plea.  —  Of all of the revelations to emerge from the federal prosecution of Representative George Santos's treasurer … ",
    "url": "https://www.nytimes.com/2023/10/09/nyregion/george-santos-nancy-marks.html"
  },
  {
    "text": "Vietnam tried to hack U.S. officials, CNN with posts on X, probe finds  —  The attempts appear to have been unsuccessful, but came as the U.S. and Vietnam were negotiating an agreement that President Biden signed last month in Hanoi  —  Vietnamese government agents tried to plant spyware … ",
    "url": "https://www.washingtonpost.com/technology/2023/10/09/vietnam-predator-hack-investigation/"
  },
  {
    "text": "You Eat  —  China has invested heavily in an armada of far-flung fishing vessels, in part to extend its global influence.  This maritime expansion has come at grave human cost.  —  DANIEL ARITONANG GRADUATED from high school in May, 2018, hoping to find a job.",
    "url": "https://www.newyorker.com/magazine/2023/10/16/the-crimes-behind-the-seafood-you-eat?currentPage=all"
  },
  {
    "text": "Haley is rising in New Hampshire.  But toppling Trump is a tall order.  —  The shifting terrain among the non-Trump candidates in the Granite State has drawn renewed attention to a unique and crucial 2024 GOP battleground  —  BEDFORD, N.H. — Diane Weir isn't an obvious vote for Nikki Haley.",
    "url": "https://www.washingtonpost.com/elections/2023/10/09/haley-trump-new-hampshire-primary-presidential/"
  },
  {
    "text": "Influential Texas activist Jonathan Stickland hosted white supremacist Nick Fuentes at Fort Worth office  —  The Texas Tribune also observed Texas GOP chair Matt Rinaldi outside the building, but he denied meeting Fuentes and denounced him.  —  FORT WORTH — Jonathan Stickland … ",
    "url": "https://www.texastribune.org/2023/10/08/nick-fuentes-kyle-rittenhouse-jonathan-stickland/"
  },
  {
    "text": "‘Everyone Was Surprised’: Palestinians in Gaza React to Conflict  —  01:34-01:38 What forced us to flee was the intensity of the bombing, 01:38-01:39 which was unlike anything in the past.  01:39 The bombing did not spare any tree or home or person; it targeted all.",
    "url": "https://www.nytimes.com/live/2023/10/08/world/israel-gaza-attack-hamas-news"
  },
  {
    "text": "There's not a chief of naval operations to help Israel due to Tommy Tuberville's protest: Retired Commander  —  The U.S. reported that a carrier strike group is being sent closer to Israel in solidarity with the country.  They'll be supplying munitions beginning Sunday, said President Joe Biden's Defense Secretary Lloyd Austin.",
    "url": "https://www.rawstory.com/tommy-tuberville-israel-naval-operations/"
  }
]