[
  {
    "text": "The Strategic Failure of 2024 Was Written in 2021  —  President Biden bet everything on the innate goodness of the American people.  We should learn from his mistake.  —  ∙ Paid  —  1. Two Paths in the Wood  —  At the beginning of Joe Biden's presidency he had a choice.",
    "url": "https://www.thebulwark.com/p/the-strategic-failure-of-2024-was"
  },
  {
    "text": "Why Biden's Team Thinks Harris Lost  —  Earlier this fall, one of Joe Biden's closest aides felt compelled to tell the president a hard truth about Kamala Harris's run for the presidency: “You have more to lose than she does.”  And now he's lost it.  Joe Biden cannot escape the fact … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/biden-harris-2024-election/680560/"
  },
  {
    "text": "Dems rage against Biden's ‘arrogance’ after Harris loss  —  Democratic leaders had hoped Harris could separate herself from Biden's deficiencies.  —  Democrats are directing their rage over losing the presidential race at Joe Biden, who they blame for setting up Kamala Harris for failure by not dropping out sooner.",
    "url": "https://www.politico.com/news/2024/11/06/democrats-blame-biden-trump-win-00188092"
  },
  {
    "text": "Democrats Will Win Again Once the Economy Tanks  —  Donald Trump is no economic mastermind, and all it takes is one bad economy to turn the political tables.  —  Jack Herrera, a reporter who specializes in covering the Latino community, posted on X early yesterday that he had … ",
    "url": "https://washingtonmonthly.com/2024/11/07/democrats-will-win-again-once-the-economy-tanks/"
  },
  {
    "text": "Trump says there's ‘no price tag’ for his mass deportation plan  —  In an exclusive interview with NBC News, Trump talked about his campaign promise to carry out the largest mass deportation of immigrants in U.S. history.  —  President-elect Donald Trump told NBC News on Thursday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-says-no-price-tag-mass-deportation-plan-rcna179178"
  },
  {
    "text": "Fed policy expected to collide with the reality of a second Trump term  —  As the Federal Open Market Committee wraps up its meetings ahead of its latest interest rate decision Thursday, questions about Trump's economic policies loom large.  —  The Federal Reserve is set to announce … ",
    "url": "https://www.nbcnews.com/business/economy/federal-reserve-interest-rate-decision-november-2024-post-election-rcna179025"
  },
  {
    "text": "Powell Says He Won't Step Down as Fed Chair If Asked by Trump  —  Federal Reserve Chair Jerome Powell said he would not leave his post if asked by President-Elect Donald Trump.  —  A reporter at the Fed's post-meeting press conference said that some of Trump's advisers have suggested that Powell resign … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-07/powell-says-he-won-t-step-down-as-fed-chair-if-asked-by-trump"
  },
  {
    "text": "Time for Democrats to Abandon the Mainstream Media  —  The ‘liberal media’ was in the tank for Trump.  Democrats should take their subscription dollars elsewhere.  —  Donald Trump's surprising victory has already inspired a frenzy of recriminations, as various Democratic Party factions seek … ",
    "url": "https://prospect.org/politics/2024-11-07-time-for-democrats-abandon-mainstream-media/"
  },
  {
    "text": "Governor Newsom convenes a special session of the Legislature to protect California values  —  What you need to know: Governor Newsom is convening a special session to protect California values, including fundamental civil rights, reproductive freedom, climate action, immigrant families, and more.",
    "url": "https://www.gov.ca.gov/2024/11/07/special-session-ca-values/"
  },
  {
    "text": "Trump Got Away With It — Because of the Biden Administration's Massive Missteps  —  Start with Merrick Garland, Mitch McConnell and the Supreme Court.  —  We have just witnessed the greatest failure of federal law enforcement in American history.  —  The reasons for Donald Trump's reelection … ",
    "url": "https://www.politico.com/news/magazine/2024/11/07/trump-legal-failures-blame-column-00187945"
  },
  {
    "text": "‘Doomed’: Experts say this crucial campaign decision led to VP Harris' ‘disastrous’ defeat  —  Many experts believed that PA Gov Josh Shapiro was a better choice for vice president  —  Vice President Kamala Harris' failed presidential bid has political strategists second guessing … ",
    "url": "https://www.foxnews.com/politics/doomed-experts-say-crucial-decision-led-harris-disastrous-defeat"
  },
  {
    "text": "Black students receive racist text messages after Trump's win, part of apparent nationwide trend  —  Black UA students reported receiving racist text messages from a slew of anonymous phone numbers Wednesday.  —  The messages, each seemingly coming from a different phone number … ",
    "url": "https://thecrimsonwhite.com/117349/news/black-students-receive-racist-text-messages-after-trumps-win-part-of-apparent-nationwide-trend/"
  },
  {
    "text": "Our mistake was to think we lived in a better country than we do  —  Americans will be stuck cleaning up after Maga's destructive streak because men like this never clean up after themselves  —  Our mistake was to think we lived in a better country than we do.",
    "url": "https://www.theguardian.com/commentisfree/2024/nov/07/us-progressive-election-trump-maga"
  },
  {
    "text": "Susie Wiles, Trump's low-key campaign manager, seen as the frontrunner to be White House chief of staff  —  Wiles helped usher in Trump's resounding victory and was a steady presence leading his campaign.  —  After helping engineer Donald Trump's improbable and sweeping victory in the presidential race … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/susie-wiles-frontrunner-trump-white-house-chief-staff-rcna179124"
  },
  {
    "text": "Ex-Hedge Fund CEO Defeats Senate Democrat Casey in Pennsylvania  — GOP's Senate victory in Pennsylvania the first since 2016  — McCormick's win adds to Republicans' Senate majority  —  Republican David McCormick defeated Democratic Senator Bob Casey in Pennsylvania … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-07/mccormick-wins-pennsylvania-senate-race-republicans-flip-seat"
  },
  {
    "text": "Crazy Liberal Women Choosing Plan 4B  —  Liberal women are claiming that they are going to give up Plan B and adopt Plan 4B.  —  Plan 4B is basically the Lysistrata strategy updated for the 21st century.  These women are planning to extort political compliance out of men by denying them sex … ",
    "url": "https://hotair.com/david-strom/2024/11/07/crazy-liberal-women-choosing-plan-4b-n3796784"
  },
  {
    "text": "Results of national exit poll on US presidential election  —  Democrat Kamala Harris faced Republican Donald Trump on Tuesday in the U.S. presidential election, after the two candidates vied for support by staking positions on issues including abortion, the economy and foreign policy.",
    "url": "https://www.reuters.com/world/us/results-nevada-exit-poll-us-presidential-election-2024-11-05/"
  },
  {
    "text": "Trump allies, private sector quietly prepare for mass detention of immigrants  —  Donald Trump's allies and some in the private sector have been quietly preparing to detain and deport migrants residing in the United States on a large scale, according to four sources familiar with the discussions.",
    "url": "https://www.cnn.com/2024/11/07/politics/trump-immigrant-detention-plans/"
  },
  {
    "text": "The Tattered Republic  —  Reflections on a fraying nation.  —  ∙ Paid … I: The Great Unravelling  —  When I was a boy, my parents organized and hosted an annual 4th of July parade in our neighborhood.  Kids would enthusiastically decorate our bikes, scooters, or rollerblades … ",
    "url": "https://www.forkingpaths.co/p/the-tattered-republic"
  }
]