[
  {
    "text": "Biden shifts into campaign mode with more attacks on Trump  —  President Joe Biden is ramping up attacks on former President Trump after some allies privately urged him to do so in recent days.  —  WASHINGTON — President Biden is shifting more into campaign mode, with plans to increasingly attack … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-shifts-campaign-mode-attacks-trump-rcna124777"
  },
  {
    "text": "Voters are worried about Biden's age.  He knows it.  —  AGE IS JUST A NUMBER — When the clatter of someone tripping interrupted President Joe Biden's remarks at an Illinois event this week, he paused and asked, “You OK?  I want the press to know that wasn't me.”",
    "url": "https://www.politico.com/newsletters/politico-nightly/2023/11/10/voters-are-worried-about-bidens-age-he-knows-it-00126664"
  },
  {
    "text": "Should Joe Manchin Run for President?  —  In the emotional life of the liberal mediasphere, there was so little space between the release of the New York Times/Siena poll showing President Biden losing to Donald Trump handily across a range of swing states (doom! doom!) and the Democratic overperformance … ",
    "url": "https://www.nytimes.com/2023/11/11/opinion/joe-manchin-president.html"
  },
  {
    "text": "Johnson announced his pitch to avoid a shutdown.  It's already hitting a wall.  —  It already seems unlikely the spending plan could pass the House, with the new speaker saying they would need Democrats to support it.  —  Speaker Mike Johnson is leaning into the demands of his right flank … ",
    "url": "https://www.politico.com/news/2023/11/11/johnson-leans-into-conservative-demands-on-shutdown-averting-plan-00126713"
  },
  {
    "text": "House GOP pursuing two-step plan to avert government shutdown  —  House Republicans are pursuing a two-step plan for funding the government, three sources familiar with the matter told CNN, as Congress barrels toward another spending deadline Friday.  —  Newly elected House Speaker Mike Johnson announced … ",
    "url": "https://www.cnn.com/2023/11/11/politics/house-speaker-mike-johnson-pitches/"
  },
  {
    "text": "House Republicans unveil their plan to avert a government shutdown next week  —  Congress has until Friday night to keep the government funded.  The House plans to vote on its short-term funding bill as early as Tuesday.  —  WASHINGTON — House Republicans on Saturday unveiled … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-unveil-plan-avert-government-shutdown-week-rcna124629"
  },
  {
    "text": "The Authoritarianism Is The Point  —  Why is the Trump campaign so loudmouthed about its autocratic policy plans?  —  If elected next year, Donald Trump's plans for his second term are not a secret.  Indeed, for the past six months or so there has been story after story about what he intended to do come January 20, 2025.",
    "url": "https://danieldrezner.substack.com/p/the-authoritarianism-is-the-point"
  },
  {
    "text": "Stephen Miller: Trump will implement ‘spectacular migration crackdown’  —  Former President Trump's immigration advisor Stephen Miller predicted that a second Trump term would include more strict policies against immigration, calling for a “spectacular migration crackdown.”",
    "url": "https://thehill.com/homenews/campaign/4305381-millter-trump-implement-spectacular-migration-crackdown/"
  },
  {
    "text": "The age pretext  —  I wanted to make a couple of follow-up points to Paul's excellent post below because bad faith arguments like Douthat's are going to become increasingly common, especially if some combination of Manchin and Romney decide to run a No Labels ratfucking campaign.",
    "url": "https://www.lawyersgunsmoneyblog.com/2023/11/the-age-pretext"
  },
  {
    "text": "UCLA faculty call on school to condemn protests, speech ‘crossing the line’  —  A group of over 300 faculty at the University of California, Los Angeles (UCLA) signed a letter calling on the school to condemn protests “crossing the line from protected speech to unlawful incitement” amid the ongoing Israel-Hamas war.",
    "url": "https://thehill.com/homenews/education/4305783-ucla-faculty-call-condemn-protests-crossing-the-line/"
  },
  {
    "text": "Ukrainian military officer coordinated Nord Stream pipeline attack  —  Roman Chervinsky, a colonel in Ukraine's Special Operations Forces, was integral to the brazen sabotage operation, say people familiar with planning  —  A senior Ukrainian military officer with deep ties … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/11/nordstream-bombing-ukraine-chervinsky/"
  },
  {
    "text": "The librarian who couldn't take it anymore  —  She loved books.  And in a time of spreading book bans in public schools, that's why this Florida librarian had to quit.  —  Deep Reads features The Washington Post's best immersive reporting and narrative writing.",
    "url": "https://www.washingtonpost.com/nation/interactive/2023/florida-book-bans-school-rules/"
  },
  {
    "text": "This school board made news for banning books.  Voters flipped it to majority Democrat  —  Meghan Budden's family was considering moving if their Pennsylvania school district didn't change course.  She normally isn't politically active, she said, but felt compelled to volunteer when a slate … ",
    "url": "https://www.npr.org/2023/11/11/1212185489/election-pennsylvania-school-board"
  },
  {
    "text": "U.S. military aircraft crashes in eastern Mediterranean during training operation, Pentagon says  —  A U.S. military aircraft crashed Friday night while taking part in a training operation in the eastern Mediterranean, the Pentagon said.  —  The aircraft “suffered a mishap and went down,” … ",
    "url": "https://www.cbsnews.com/news/u-s-military-aircraft-crashes-eastern-mediterranean-training-operation/"
  }
]