[
  {
    "text": "Bill Gates accuses Elon Musk of ‘killing’ children with USAID cuts  —  Billionaire reopens feud with Tesla chief as he unveils plan to spend $200bn on philanthropy and close foundation in 2045  —  Unlock the White House Watch newsletter for free  —  Your guide to what Trump's second term means for Washington, business and the world",
    "url": "https://t.co/gW0HJfrL46"
  },
  {
    "text": "Bill Gates Explains His Plans to Close the Gates Foundation in 2045 … Today the Gates Foundation celebrates its 25th anniversary by announcing its plans to close up shop.  —  Established in 2000 — when Melinda French Gates was just 35 and Bill Gates was 44 and the world's richest man … ",
    "url": "https://www.nytimes.com/2025/05/08/magazine/bill-gates-foundation-closing-2045.html?unlocked_article_code=1.Fk8.mBIv.zs6mjh2Ut3w8&smid=nytcore-ios-share&referringSource=articleShare&sgrp=p"
  },
  {
    "text": "Will Trump Pretend to Fix What He Broke?  —  The Trump administration is planning to announce its first trade deal today, with Britain.  Except it won't be a deal; more of a “deal.”  Reportedly it will mainly be a “framework” for an actual deal that may or may not happen sometime in the future.",
    "url": "https://paulkrugman.substack.com/p/will-trump-pretend-to-fix-what-he"
  },
  {
    "text": "Trump Taps a ‘MAHA’ Movement Leader for Surgeon General  —  Casey Means will work closely with RFK Jr. on health policy, president says  —  WASHINGTON—President Trump said he would nominate Dr. Casey Means, a California doctor and wellness influencer, to be the next surgeon general.",
    "url": "https://www.wsj.com/politics/policy/trump-taps-a-maha-movement-leader-for-surgeon-general-81756dfa?st=g8DcpA&reflink=article_copyURL_share"
  },
  {
    "text": "Trump administration eyes release of Hur interview blocked by Biden  —  Biden had asserted executive privilege to block House committees from obtaining the recordings.  —  The Trump administration is making plans to release the audio of former President Joe Biden's interview with Robert Hur … ",
    "url": "https://www.politico.com/news/2025/05/07/trump-administration-eyes-release-hur-interview-00334587"
  },
  {
    "text": "Biden enlists veteran Democratic operative to help defend his reputation  —  The Trump administration, meanwhile, is eying the release of Biden's interview with Robert Hur.  —  Joe Biden is in reputation management mode, hiring a veteran campaign and communications strategist to help burnish … ",
    "url": "https://www.politico.com/news/2025/05/08/biden-defend-reputation-operative-00334233"
  },
  {
    "text": "Sen. John Fetterman raises alarms with outburst at meeting with union officials, AP sources say  —  Democratic Sen. John Fetterman of Pennsylvania was meeting last week with representatives from a teachers union in his home state when things quickly devolved.",
    "url": "https://apnews.com/article/john-fetterman-trump-democrats-senate-pennsylvania-8129e206ed9479ad8534eac3fd128abe"
  },
  {
    "text": "What Ed Martin told the Senate about Jan. 6 — and what he said before  —  Martin's responses to Senate committee are at odds with previous public comments.  His views on the Capitol breach may derail his nomination.",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/05/08/ed-martin-jan-6-answers/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2Njc2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4MDU5MTk5LCJpYXQiOjE3NDY2NzY4MDAsImp0aSI6ImUzM2E4ZGFkLTE0NWQtNDBlYi1hYjU1LWI5YmMzMjA3NzY3NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS8yMDI1LzA1LzA4L2VkLW1hcnRpbi1qYW4tNi1hbnN3ZXJzLyJ9.Oz2VygcyGMuFuxcq8hl3UCIljrPvulCup1DI1pM1Kvk&itid=gfta"
  },
  {
    "text": "As D.C. U.S. attorney nomination falters, Ed Martin's past feeds doubts  —  Recurring accusations of abuse of power stalled Trump's D.C. U.S. attorney pick, who has supported Jan. 6 rioters who assaulted police.  —  President Donald Trump's pick for top federal prosecutor in D.C., Ed Martin … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2025/05/08/ed-martin-nomination-failing-record/"
  },
  {
    "text": "Trump Has Been Stopped By Courts More Than 200 Times  —  President Donald Trump's expansive use of executive power faced at least 328 lawsuits as of May 1 — with judges halting his policies far more often than they allowed them.  —  Courts entered more than 200 orders stopping … ",
    "url": "https://www.bloomberg.com/graphics/2025-lawsuits-against-trump-administration/"
  },
  {
    "text": "From traffic stop to ICE custody: Dalton student now in limbo, family wants answers  —  DALTON, Ga. — After a traffic stop for turning right on a red light in Dalton on Monday, a 19-year-old Dalton State student is now facing possible deportation.  —  Friends say Ximena Arias-Cristobal … ",
    "url": "https://newschannel9.com/news/local/from-traffic-stop-to-ice-custody-dalton-student-now-in-limbo-family-wants-answers-immigration-customs-enforcement-whitfield-county-georgia-law-enforcement-illegal-immigration-undocumented-migrants"
  },
  {
    "text": "Chief Justice John Roberts defends independent judiciary as Trump officials criticize courts  —  Speaking in Buffalo, the Supreme Court justice said judges sometimes have to “check the excesses” of the president and Congress.  —  Chief Justice John Roberts on Wednesday stressed the importance … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-john-roberts-independent-judiciary-trump-officials-rcna205461"
  },
  {
    "text": "Small-time Trump coin buyers have seen their investments collapse  —  Nearly 67,000 crypto novices have pulled out their debit cards to bet on Trump's meme coin venture, a Post analysis found.  So far it's been a monumental bust.  —  Rebecca Davis bought President Donald Trump's meme coin … ",
    "url": "https://www.washingtonpost.com/technology/2025/05/08/trump-coin-crypto-investors-wallets/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2Njc2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4MDU5MTk5LCJpYXQiOjE3NDY2NzY4MDAsImp0aSI6ImM4NmI4NWUwLTk4OGUtNDhjNy04OThlLTM2MTVlYzFjZDdhMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS90ZWNobm9sb2d5LzIwMjUvMDUvMDgvdHJ1bXAtY29pbi1jcnlwdG8taW52ZXN0b3JzLXdhbGxldHMvIn0.gzwcgh7MywN_76NQ5c2s_-c7j7eAbUCUR4bLd-Asb0s&itid=gfta"
  },
  {
    "text": "No One Has Ever Defeated Autocracy From the Sidelines  —  How will Americans know when we have lost our democracy?  —  Authoritarianism is harder to recognize than it used to be.  Most 21st-century autocrats are elected.  Rather than violently suppress opposition like Castro or Pinochet … ",
    "url": "https://www.nytimes.com/2025/05/08/opinion/trump-authoritarianism-democracy.html?unlocked_article_code=1.Fk8.HXmB.7gtBkcPbV4MG&smid=nytcore-ios-share&referringSource=articleShare&fbclid=IwY2xjawKJgTJleHRuA2FlbQIxMQBicmlkETFZUnNOZW9XZTNxWmdjRWN0AR5zMy8heIXpuccJnFe0VwdOmB07evj4TgM9VsdXBNy6FjhUYx95EFu-WKClmA_aem_S9Uhow7IXURgnYpM3ZNluQ"
  },
  {
    "text": "Trump's Border Czar Secretly Deported Two U.S. Citizen Children  —  WITHOUT A TRACE  —  Two citizens, 5 and 4, simply vanished when their mother was lured to an immigration appointment, advocates say.  —  EXCLUSIVE  —  Denisse Parra Vargas and her husband, Omar, had just dropped their three children … ",
    "url": "https://www.thedailybeast.com/trumps-border-czar-tom-homan-secretly-deported-two-us-citizen-children-to-mexico/"
  },
  {
    "text": "NOAA ends extreme weather database that has tracked cost of disasters since 1980  —  The National Oceanic and Atmospheric Administration announced Thursday its well-known “billion-dollar weather and climate disasters” database “will be retired,” a move that will make it next to impossible … ",
    "url": "https://cnn.com/2025/05/08/climate/noaa-ends-disaster-database"
  },
  {
    "text": "Kamala Harris Didn't Lose to the Couch  —  Why did Kamala Harris lose last November?  Three answers have been prominently offered:  — Too many 2020 Biden voters stayed home,  — Too many 2020 Biden voters changed their minds, or  — New 2024-only voters broke heavily for Donald Trump.",
    "url": "https://changeresearch.substack.com/p/kamala-harris-didnt-lose-to-the-couch"
  },
  {
    "text": "Toyota Says Tariffs Will Erase $1.3 Billion in Profits in Just 2 Months  —  The automaker's somber forecast for the fiscal year underscored how quickly fortunes have turned for many companies reckoning with President Trump's tariffs.  —  A year ago, the world's biggest automaker was on a tear.",
    "url": "https://www.nytimes.com/2025/05/08/business/toyota-earnings-trump-tariffs.html"
  },
  {
    "text": "Kennedy Announces New Database for Research Into ‘Root Causes’ of Autism  —  The director of the National Institutes of Health previously floated — then walked back — the idea of an autism registry, alarming researchers and parents.  —  After weeks of confusion about his plans for autism research … ",
    "url": "https://www.nytimes.com/2025/05/07/us/politics/rfk-jr-autism-cause-database.html?unlocked_article_code=1.Fk8.6QZ9.uhViPjhmu-WA&smid=url-share"
  },
  {
    "text": "Trump's NIH Axed Research Grants Even After a Judge Blocked the Cuts, Internal Records Show  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  For more than two months, the Trump administration … ",
    "url": "https://www.propublica.org/article/trump-nih-cuts-transgender-research-grants"
  },
  {
    "text": "‘Disturbing’: Trump admin tapping right-wing MAGA outlet OAN for taxpayer-funded news network  —  Voice of America will start airing content from the right wing-outlet One America News.  It marks a dire shift for the broadcaster, which was founded during the Cold War to counter Communist propaganda.",
    "url": "https://www.msnbc.com/the-beat-with-ari/watch/-disturbing-trump-admin-tapping-right-wing-maga-outlet-oan-for-taxpayer-funded-news-network-239126597921"
  },
  {
    "text": "Democrats Cave, Prepare to Rubber-Stamp Trump Crypto Corruption  —  Pro-crypto senators are poised to pass a stablecoin bill, while failing to crack down on the Trump organization issuing one to collect payments from foreign governments.  —  Despite the twists and turns and drama-creation … ",
    "url": "https://prospect.org/politics/2025-05-08-democrats-cave-prepare-rubber-stamp-trump-crypto-corruption/"
  },
  {
    "text": "Meet Trump's memecoin dinner guests  —  Citation Needed is an independent publication, entirely supported by readers like you.  Consider signing up for a pay-what-you-can subscription to support this kind of deep analysis and reporting.  —  Foreign investors have spent millions scrambling … ",
    "url": "https://www.citationneeded.news/trump-memecoin-dinner-guests/"
  },
  {
    "text": "Judge Boasberg grills DOJ on Trump's comments about El Salvador deportations  —  “Was the president telling the truth?” the judge asked.  —  Public comments from President Donald Trump and his aides are once again scrambling the Justice Department's efforts to defend his administration's deportation policies in court.",
    "url": "https://www.politico.com/news/2025/05/07/boasberg-trump-deportations-00334840"
  },
  {
    "text": "West Point Is Supposed to Educate, Not Indoctrinate  —  It turned out to be easy to undermine West Point.  All it took was an executive order from President Trump and a memo from Defense Secretary Pete Hegseth dictating what could and couldn't be taught in the military and its educational institutions.",
    "url": "https://www.nytimes.com/2025/05/08/opinion/west-point-trump-military.html?unlocked_article_code=1.Fk8.nAsH.FJBUeCyms015&smid=url-share"
  },
  {
    "text": "Joseph Nye, celebrated US political scientist who coined ‘soft power,’ dies  —  Joseph Nye, the US political scientist who coined the term “soft power,” died aged 88.  —  Nye served under former US President Bill Clinton as an assistant secretary of defense, but was best known for his academic work … ",
    "url": "https://www.semafor.com/article/05/08/2025/joseph-nye-soft-power-political-scientist-dies"
  },
  {
    "text": "Locals Fight Back After Naval Academy Removes Books in DEI Cull  —  After the pulling of 381 titles to comply with a Trump administration directive, many in Annapolis are rallying around the slogan 'Don't give up the book'  —  ANNAPOLIS, Md.— The U.S. Naval Academy's culling of hundreds … ",
    "url": "https://www.wsj.com/us-news/education/naval-academy-dei-book-removal-annapolis-maryland-072f1b02?st=o2dvsa&reflink=article_copyURL_share"
  },
  {
    "text": "Bernie Sanders partners with Run for Something to train candidates  —  The Vermont senator is adding organizational heft to his appeal for progressives to run for office.  —  Bernie Sanders, who has been calling for progressives to run for office on his “Fighting Oligarchy” tour … ",
    "url": "https://www.politico.com/news/2025/05/08/bernie-sanders-run-for-something-00334937"
  },
  {
    "text": "Exclusive: Some ‘Les Mis’ cast members plan to boycott Trump's attendance at Kennedy Center performance next month  —  When President Donald Trump descends on the Kennedy Performing Arts Center next month for a high-dollar fundraiser and a performance of “Les Misérables,” … ",
    "url": "https://cnn.com/2025/05/07/politics/kennedy-center-les-mis-cast-boycott-trump"
  },
  {
    "text": "Thousands of layoffs to hit Interior, National Parks imminently  —  The Interior Department is finalizing reduction-in-force plans expected to target thousands of employees, including 1,500 at the National Park Service, with notices going out to employees within 10 days.",
    "url": "https://www.govexec.com/workforce/2025/05/thousands-layoffs-hit-interior-national-parks-imminently/405145/"
  },
  {
    "text": "House GOP passes “Gulf of America” renaming bill  —  The House voted Thursday to formalize President Trump's executive order to rename the Gulf of Mexico the “Gulf of America.”  —  Why it matters: It's the first time the House has voted to codify one of the president's executive orders into federal law … ",
    "url": "https://www.axios.com/2025/05/08/house-passes-gulf-of-america-mexico-bill"
  },
  {
    "text": "House Republicans eye adding $60B farm bill package in Trump megabill  —  House Republicans are aiming to add $60 billion in farm bill programs to the agriculture portion of the GOP's megabill.  But they'll have to convince several centrist holdouts to vote for a controversial proposal … ",
    "url": "https://www.politico.com/live-updates/2025/05/08/congress/house-republicans-farm-programs-snap-megabill-00335377"
  },
  {
    "text": "Trump's Worst Idea Since Tariffs  —  The President is pitching a plan to outdo Democrats on drug price controls.  —  Loading...  President Trump and Republicans appear to be shrinking from reforming Medicaid, but that's not the worst of it.  To replace the spending slowdown they won't get in Medicaid … ",
    "url": "https://www.wsj.com/opinion/republicans-drug-prices-most-favored-nation-donald-trump-medicaid-7b48dbcd"
  },
  {
    "text": "A ‘Trump Card Visa’ Is Already Showing Up in Immigration Forms  —  Donald Trump has proposed launching a “gold card” program offering US residency for $5 million.  Elon Musk's DOGE has begun rolling out the technology to enable it.  —  Elon Musk's so-called Department of Government Efficiency … ",
    "url": "https://www.wired.com/story/doge-trump-gold-visa-program-immigration/"
  }
]