[
  {
    "text": "Gov. Chris Sununu: This Is How to Beat Trump  —  This week, Republican primary candidates for president will have a chance to make their case before a national audience — with or without Donald Trump on the debate stage.  To win, they must break free of Mr. Trump's drama, step out of his shadow … ",
    "url": "https://www.nytimes.com/2023/08/21/opinion/governor-sununu-republicans-trump.html"
  },
  {
    "text": "Iowa poll: Trump challengers face huge climb to stop him in first GOP contest  —  Among likely GOP caucusgoers, 65% believe Trump hasn't committed serious crimes, while the survey also shows strong numbers considering DeSantis and Scott.  —  Former President Donald Trump starts … ",
    "url": "https://www.nbcnews.com/meet-the-press/first-read/iowa-poll-trump-challengers-face-huge-climb-stop-first-gop-contest-rcna100886"
  },
  {
    "text": "Iowa Poll: Donald Trump holds commanding lead in first test of 2024 Republican caucus field  —  Donald Trump's lead among likely Republican caucusgoers grew 5 points after his indictment in Georgia, according to the new Des Moines Register/NBC News/Mediacom Iowa Poll  —  Brianne Pfannenstiel Michaela RammDes Moines Register",
    "url": "https://www.desmoinesregister.com/story/news/politics/iowa-poll/caucus/2023/08/21/iowa-poll-donald-trump-holds-commanding-lead-5-months-to-caucuses/70624481007/"
  },
  {
    "text": "Playbook: Harris fights her biggest foe: Washington's view of her  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  JUST POSTED — It's the first 2024 NBC News/Des Moines Register/Mediacom poll of the cycle by esteemed Iowa pollster ANN SELZER.",
    "url": "https://www.politico.com/newsletters/playbook/2023/08/21/harris-fights-her-biggest-foe-washingtons-view-of-her-00112045"
  },
  {
    "text": "Pence Undercuts Trump's Defense in Classified Documents Case  —  The former vice president said he knew of no broad order by Donald Trump that would have declassified documents the former president took with him when he left the White House.  —  Former Vice President Mike Pence said on Sunday … ",
    "url": "https://www.nytimes.com/2023/08/20/us/politics/pence-trump-classified-documents.html"
  },
  {
    "text": "Meet the Press - August 20, 2023  —  CHUCK TODD:  —  This Sunday, defending Trump.  The Republican presidential hopefuls are getting ready to take to the debate stage for the first time, as Donald Trump prepares to be arrested for the fourth time.  —  FMR. PRES. DONALD TRUMP:  —  It's a witch hunt.",
    "url": "https://www.nbcnews.com/meet-the-press/meet-press-august-20-2023-n1307056"
  },
  {
    "text": "Biden administration to urge Americans get new COVID-19 boosters  —  The Biden administration plans to urge all Americans to get a booster shot for the coronavirus this autumn to counter a new wave of infections, a White House official said on Sunday.  —  The official said that while the Centers … ",
    "url": "https://www.reuters.com/world/us/biden-administration-urge-americans-get-new-covid-19-boosters-2023-08-20/"
  },
  {
    "text": "New district lines will scramble key New York House races  —  The interminable legal fight over redistricting in New York will likely leave both parties unclear which races will be competitive until sometime next spring.  —  ALBANY, N.Y. — Candidates are eager to run in competitive House seats in New York next year.",
    "url": "https://www.politico.com/news/2023/08/21/new-york-redistricting-2024-elections-00111914"
  },
  {
    "text": "Biden Visiting Hawaii to Inspect Wildfire Damage  —  After remaining secluded since Friday, the president will break away from his vacation for a brief trip to Maui, where flames have demolished a town and killed more than 100 people.  —  President Biden is set to break away from his summer vacation … ",
    "url": "https://www.nytimes.com/2023/08/21/us/politics/biden-maui-hawaii-wildfires.html"
  },
  {
    "text": "How Hunter Biden's plea deal became a huge cluster  —  The irony is that if anyone is being treated unfairly, it's Hunter. … On July 26, what was supposed to be a routine plea hearing for Hunter Biden in federal court in Delaware turned into a protracted circus, culminating … ",
    "url": "https://www.publicnotice.co/p/hunter-biden-special-counsel-david-weiss-comer"
  },
  {
    "text": "Vivek Ramaswamy's Truth  —  The Millennial outsider Republican says he wants a revolution.  To get there, he'd gut the federal government.  —  vivek ramaswamy leaned forward in his leather seat aboard the Cessna 750.  He was fiddling with his pen, talking about Donald Trump.  It was the final Friday in July.",
    "url": "https://www.theatlantic.com/politics/archive/2023/08/vivek-ramaswamy-gop-election/675041/"
  },
  {
    "text": "Russia's Luna-25 Moon Lander Is Lost in a Crash  —  The robotic Luna-25 spacecraft appeared to have “ceased its existence” after a failed orbital adjustment, the space agency Roscosmos said.  —  A Russian robotic spacecraft that was headed to the lunar surface has crashed into the moon … ",
    "url": "https://www.nytimes.com/2023/08/20/science/russia-moon-space-crash.html"
  },
  {
    "text": "Youngkin retools message for new elections with ‘Parents Matter’ talks  —  SALEM, Va. — Gov. Glenn Youngkin (R) sat next to an American flag and a huge sign reading “Parents Matter” as a woman in the audience complained at length that social media and college had “brainwashed” … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/21/virginia-youngkin-parents-matter-elections/"
  },
  {
    "text": "How conservatives use ‘verbal jiu-jitsu’ to turn liberals' language against them  —  The two frontrunners for the White House in 2024 are tied in a hypothetical rematch.  Congress is paralyzed.  Every big election seems to be decided by razor-thin margins.",
    "url": "https://www.cnn.com/2023/08/20/politics/conservatives-verbal-combat-blake-cec/"
  }
]