[
  {
    "text": "Behind the Curtain: MAGA's jail plan … Nowhere would that be truer than at the Justice Department, which Trump wants to make his fief and retribution arm.  —  Bannon told us Bragg could be targeted using the 14th Amendment (equal protection) and Fourth Amendment (outlawing unreasonable searches … ",
    "url": "https://www.axios.com/2024/06/05/trump-alvin-bragg-election-2024-jail"
  },
  {
    "text": "The G.O.P. Push for Post-Verdict Payback: ‘Fight Fire With Fire’  —  Republican leaders in and out of government are publicly pushing to prosecute Democrats as legal retribution for Donald Trump's felony conviction.  —  Republican allies of Donald J. Trump are calling for revenge prosecutions … ",
    "url": "https://www.nytimes.com/2024/06/05/us/politics/trump-conviction-gop-revenge.html"
  },
  {
    "text": "Scoop: Trump's protectors push Johnson for House vote … - Conservatives want a floor vote on a bill that would allow current or former presidents to move any state case brought against them — such as the one in New York that resulted in Trump's conviction — to federal court, according to multiple House Republican sources.",
    "url": "https://www.axios.com/2024/06/04/trump-capitol-hill-protectors-house-mike-johnson"
  },
  {
    "text": "The facts about Biden's new immigration policy  —  On Tuesday, President Joe Biden announced executive actions that would impose sweeping changes to how the nation treats asylum seekers.  Anyone who attempts to cross the border outside of a designated port of entry will be considered presumptively ineligible … ",
    "url": "https://popular.info/p/the-facts-about-bidens-new-immigration"
  },
  {
    "text": "It's Not an Accident That So Many GOP Senate Candidates Are Rich … Tim Sheehy's victory in Montana's GOP primary Tuesday means national Republicans are dependent on a candidate with little political experience but a lot of money to win a key race for majority control of the Senate.",
    "url": "https://www.notus.org/2024-election/republican-senate-candidates-funding"
  },
  {
    "text": "Behind Closed Doors, Biden Shows Signs of Slipping  —  Participants in meetings said the 81-year-old president performed poorly at times.  The White House said Biden is sharp and his critics are playing partisan politics.  —  WASHINGTON—When President Biden met with congressional leaders … ",
    "url": "https://www.wsj.com/politics/policy/joe-biden-age-election-2024-8ee15246"
  },
  {
    "text": "Israel Secretly Targets U.S. Lawmakers With Influence Campaign on Gaza War  —  Israel's Ministry of Diaspora Affairs ordered the operation, which used fake social media accounts urging U.S. lawmakers to fund Israel's military, according to officials and documents about the effort.",
    "url": "https://www.nytimes.com/2024/06/05/technology/israel-campaign-gaza-social-media.html"
  },
  {
    "text": "Gaps and Forms: Hunter Biden's Defense  —  The first day of the Hunter Biden trial revealed a lot about gaps in the prosecution's case and Abbe Lowell's plan to mount a defense.  —  As this post will show, it will be easier for prosecutors to prove Count 3, Possession of a Firearm by a Drug User … ",
    "url": "https://www.emptywheel.net/2024/06/05/gaps-and-forms-hunter-bidens-defense/"
  },
  {
    "text": "Russia's Gas Giant Reports Costly Impact of Putin's War  —  The gas giant Gazprom, which has been an engine of Russia's economy, will pay a decadelong price for Russian leader  —  's invasion of Ukraine.  —  The U.K. newspaper Financial Times reported Wednesday that it had seen research commissioned … ",
    "url": "https://www.newsweek.com/gas-gazprom-putin-war-costly-impact-1908467"
  },
  {
    "text": "'It's very possible': Trump floats imprisoning his political opponents  —  Discussing his guilty verdict, Trump said his opponents were going down a “terrible path.”  —  Fresh off last week's historic guilty verdict, former President Donald Trump had a warning for his political opponents on Tuesday.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-floats-imprisoning-political-opponents-rcna155543"
  },
  {
    "text": "Playbook: Inside Dems' Bibi breach  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  IN MEMORIAM — Ben White, a longtime POLITICO reporter and Morning Money author who also worked for CNBC, the NYT, the FT, WaPo and The Messenger, died Saturday at 52 … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/05/inside-dems-bibi-breach-00161702"
  },
  {
    "text": "Alito's the tip of the iceberg: More Republicans wave Christian nationalist flag despite MAGA threat  —  Nothing innocent about the “Appeal to Heaven” flag, especially when Trump calls for the right's “breaking point”  —  When news broke late last month that Justice Samuel Alito had an … ",
    "url": "https://www.salon.com/2024/06/05/alitos-the-tip-of-the-iceberg-more-wave-christian-nationalist-flag-despite-maga/"
  },
  {
    "text": "US maternal mortality rate far higher than in peer nations, report finds  —  Alarming disparities persist, particularly between white and Black mothers, according to new report by Commonwealth Fund  —  The US has a far higher rate of maternal mortality than other peer wealthy nations … ",
    "url": "https://www.theguardian.com/global-development/article/2024/jun/05/maternal-mortality-rate"
  },
  {
    "text": "MSNBC Host Chris Hayes Guffaws At Matt Gaetz's ‘Law’ Defense Of Trump  —  The cable news channel has been yukking it up lately at Republican antics.  —  LOADING  —  MSNBC's Chris Hayes on Tuesday nearly busted a gut laughing at Rep. Matt Gaetz (R-Fla.) for his declaration that he loves the law and has given his life for it.",
    "url": "https://www.huffpost.com/entry/chris-hayes-laughs-matt-gaetz_n_666046dfe4b0f507c438bed6"
  },
  {
    "text": "Alabama federal judges forced LGBTQ advocates into a long, secretive “inquiry”  —  Part 1: An April 2022 order questioning if LGBTQ civil rights lawyers engaged in “judge shopping” in challenging an anti-transgender law prompted a two-year investigation.",
    "url": "https://www.lawdork.com/p/alabama-judges-lgbtq-lawyers-inquiry-part-1"
  },
  {
    "text": "Scoop: Dem groups to pour millions into downballot races in battleground states … - Money is already pouring into the same swing states, which will be critical to President Biden's re-election. … - The National Democratic Redistricting Committee and the States Project … ",
    "url": "https://www.axios.com/2024/06/05/emocrats-state-legislature-races-2024-election"
  },
  {
    "text": "Ethics panel probes Rep. Spartz over staff abuse claims  —  The Indiana Republican has drastically cut staff pay and communicated ‘with complete and total rage,’ according to complaints.  —  The House Ethics Committee has made preliminary inquiries into Rep. Victoria Spartz's treatment … ",
    "url": "https://www.politico.com/news/2024/06/04/ethics-panel-probes-rep-spartz-over-staff-abuse-claims-00161623"
  },
  {
    "text": "Colorado Republican Party issues call to burn all Pride flags  —  The party's shift toward extremism continued with a nod to an infamous anti-gay slur and an invitation to burn Pride flags.  —  COLORADO, USA — The Colorado Republican Party marked the start of Pride Month with a mass email attacking … ",
    "url": "https://www.9news.com/article/news/local/local-politics/colorado-gop-call-burn-gay-pride-flags/73-e5156582-2888-46d2-b535-d5981c149817"
  },
  {
    "text": "Donald Trump Is Banned from 37 Countries as Convicted Felon, Including Major Allies Like Canada and U.K.  —  If elected president again, Trump would need special permission to enter several key countries for maintaining foreign relations  —  Donald Trump may face travel restrictions … ",
    "url": "https://people.com/donald-trump-barred-entering-37-countries-convicted-felon-8657038"
  },
  {
    "text": "Scoop: Group that aided climate plan is lukewarm on Biden … - But Biden's position on college protests and the Israel-Hamas war, as well as his approval of some fossil fuel projects, is leaving some folks decidedly apathetic about supporting him in 2024. … - For now, the group is taking a wait-and-see approach.",
    "url": "https://www.axios.com/2024/06/04/scoop-group-that-aided-climate-plan-wont-back-biden"
  },
  {
    "text": "The Supreme Court remains the linchpin of Trumpworld's push for power  —  Trump's response to his New York conviction and a new indictment of his allies in Wisconsin are the latest examples.  —  Three of the nine justices on the Supreme Court were nominated by Donald Trump.",
    "url": "https://www.washingtonpost.com/politics/2024/06/04/trump-supreme-court-wisconsin-new-york/"
  }
]