[
  {
    "text": "Donald Trump appeals $454 million judgment in New York civil fraud case  —  Donald Trump has appealed his $454 million New York civil fraud judgment, challenging a judge's finding that Trump lied about his wealth as he grew the real estate empire that launched him to stardom and the presidency.",
    "url": "https://apnews.com/article/trump-new-york-civil-fraud-appeal-letitia-james-2f8cc521e00e4a34a1342b961c1416ce"
  },
  {
    "text": "The Back Channel Talks to Secure McConnell's Endorsement of Trump  —  The conversations between the Trump and McConnell camps have been happening between key advisers to both men.  —  Donald J. Trump and Mitch McConnell haven't said a word to each other since December 2020.",
    "url": "https://www.nytimes.com/2024/02/26/us/politics/trump-mcconnell-endorsement.html"
  },
  {
    "text": "In Trump Criminal Case, Manhattan D.A. Asks for Gag Order Before Trial  —  Lawyers for Alvin L. Bragg, the district attorney, are seeking to protect jurors and witnesses in the first criminal prosecution of a former president.  —  Manhattan prosecutors on Monday asked the judge overseeing … ",
    "url": "https://www.nytimes.com/2024/02/26/nyregion/trump-gag-order-hush-money-trial.html"
  },
  {
    "text": "Exclusive: Key figure in fake electors plot concealed damning posts on secret Twitter account from investigators  —  Kenneth Chesebro, the right-wing attorney who helped devise the Trump campaign's fake electors plot in 2020, concealed a secret Twitter account from Michigan prosecutors … ",
    "url": "https://www.cnn.com/2024/02/26/politics/kenneth-chesebro-secret-twitter-account-kfile/"
  },
  {
    "text": "Trump's CPAC speech showed clear signs of major cognitive decline — yet MAGA cheered  —  A confused Donald Trump kept up his threats of retribution during this weekend's conservative confab  —  Donald Trump was in his full glory over the weekend at the annual Conservative Political Action Committee (CPAC) conference.",
    "url": "https://www.salon.com/2024/02/26/cpac-speech-showed-clear-signs-of-major-cognitive-decline--yet-maga-cheered/"
  },
  {
    "text": "The MAGA enemies list is growing, and so are the odds that you're on it  —  As the Republican primaries slog toward the climax of a likely Trump nomination, I can't help thinking that we as a country are still dramatically underreacting to the MAGA threat.  The fact that Trump has even made it this far is proof of that.",
    "url": "https://thehill.com/opinion/campaign/4488097-trumps-enemies-list-is-growing-and-so-are-the-odds-that-youre-on-it/"
  },
  {
    "text": "Rep. Perry says House GOP should cancel Biden's SOTU address  —  Former House Freedom Caucus Chair Rep. Scott Perry (R-Pa.) is calling on Speaker Mike Johnson (R-La.) to stop President Biden from giving his annual State of the Union address next month.  —  Perry said during an appearance Monday … ",
    "url": "https://thehill.com/homenews/4489178-rep-perry-says-house-gop-should-cancel-bidens-sotu-address/"
  },
  {
    "text": "Three Theories for Why Trump's Primary Results Are Not Matching Expectations  —  He has underperformed the polls in each of the first three contests.  —  It's still early in the primary season, but a whiff of a possible polling error is already in the air.",
    "url": "https://www.nytimes.com/2024/02/26/upshot/trump-polling-primaries.html"
  },
  {
    "text": "Biden tops Trump by 4 points in new survey of young voters  —  President Biden is narrowly leading former President Trump by 4 points in a new survey of young voters — a key demographic Biden carried in 2020.  —  The new Axios-Generation Lab survey of 18- to 34-year-old voters found … ",
    "url": "https://thehill.com/homenews/campaign/4488989-biden-tops-trump-survey-young-voters/"
  },
  {
    "text": "The prospect of a second Trump presidency has the intelligence community on edge  —  Trump sought major changes at the intel agencies in his first term; former officials say he could be more radical in a second.  —  Former top officials from Donald Trump's administration are warning … ",
    "url": "https://www.politico.com/news/2024/02/26/trump-intelligence-agency-national-security-00142968"
  },
  {
    "text": "Supreme Court to Hear Free Speech Challenges to Social Media Laws  —  The tech industry argues that laws in Florida and Texas, prompted by conservative complaints about censorship, violate the First Amendment.  The court's decision could fundamentally alter the nature of speech on the internet.",
    "url": "https://www.nytimes.com/2024/02/26/us/politics/supreme-court-social-media-texas-florida.html"
  },
  {
    "text": "Russia's 2024 election interference has already begun  —  Moscow is spreading disinformation about Joe Biden and other Democrats to lessen U.S. military aid to Ukraine and U.S. support for NATO, former U.S. officials and cyber experts say.  —  Russia is already spreading disinformation … ",
    "url": "https://www.nbcnews.com/investigations/russias-2024-election-interference-already-begun-rcna134204"
  },
  {
    "text": "$1 Billion Donation Will Provide Free Tuition at a Bronx Medical School  —  Dr. Ruth Gottesman, a longtime professor at the Albert Einstein College of Medicine, is making free tuition available to all students going forward.  —  The 93-year-old widow of a Wall Street financier has donated $1 billion … ",
    "url": "https://www.nytimes.com/2024/02/26/nyregion/albert-einstein-college-medicine-bronx-donation.html"
  },
  {
    "text": "Police Bodycam Shows Sheriff Hunting for ‘Obscene’ Books at Library  —  Body camera footage from Idaho reveals a sheriff hunting for a YA book he could use for a political stunt.  —  Sheriff Robert Norris is speaking into his body camera.  “Today's date is April 20, approximately 7 a.m … ",
    "url": "https://www.404media.co/email/b3d9cb53-c0fa-43fc-b824-a302be50bb95/"
  },
  {
    "text": "Hungary's parliament ratifies Sweden's NATO accession, clearing the final obstacle to membership  —  Hungary's parliament voted Monday to ratify Sweden's bid to join NATO, bringing an end to more than 18 months of delays that have frustrated the alliance as it seeks to expand in response to Russia's war in Ukraine.",
    "url": "https://apnews.com/article/hungary-ratify-sweden-nato-membership-efc791c0d2e4da9fdcb247a2d6624cab"
  },
  {
    "text": "Exclusive: Hunter Biden sees his sobriety as key to keeping Trump from winning … - “Most importantly, you have to believe that you're worth the work, or you'll never be able to get sober. … “I have always been in awe of people who have stayed clean and sober through tragedies and obstacles few people ever face.",
    "url": "https://www.axios.com/2024/02/26/hunter-joe-biden-sober-2024-trump"
  },
  {
    "text": "RNC Chair Ronna McDaniel announces her resignation  —  Former President Donald Trump has already endorsed a new slate of leaders at the Republican National Committee ahead of the general election.  —  WASHINGTON — Ronna McDaniel said Monday that she will step down next month as chairwoman … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rnc-chair-ronna-mcdaniel-resignation-rcna137347"
  },
  {
    "text": "I Was a Heretic at The New York Times  —  I did what I was hired to do, and I paid for it.  —  On one of my first days at The New York Times, I went to an orientation with more than a dozen other new hires.  We had to do an icebreaker: Pick a Starburst out of a jar and then answer a question.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/tom-cotton-new-york-times/677546/"
  },
  {
    "text": "Gavin Newsom faces another recall threat in California  —  Activists who successfully placed a recall on California's ballot in 2021 and forced the Democratic governor to spend tens of millions are trying to oust him again.  —  SACRAMENTO, California — Conservative activists … ",
    "url": "https://www.politico.com/news/2024/02/26/newsom-recall-budget-2024-00143252"
  },
  {
    "text": "FTC Challenges Kroger's Acquisition of Albertsons  —  Largest supermarket merger in U.S. history will eliminate competition and raise grocery prices for millions of Americans, while harming tens of thousands of workers, FTC alleges  —  The Federal Trade Commission today sued to block … ",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2024/02/ftc-challenges-krogers-acquisition-albertsons"
  }
]