[
  {
    "text": "As top Trump aides sent texts on Signal, flight data show a member of the group chat was in Russia  —  President Trump's Ukraine and Middle East envoy Steve Witkoff was in Moscow, where he met with Russian President Vladimir Putin, when he was included in a group chat with more than a dozen … ",
    "url": "https://www.cbsnews.com/news/trump-envoy-steve-witkoff-signal-text-group-chat-russia-putin/"
  },
  {
    "text": "Pete Hegseth Sued Over Signal Text Debacle  —  A public watchdog group has launched the first lawsuit over the Trump administration's use of Signal to discuss war plans, HuffPost has learned.  —  A public watchdog group sued Defense Secretary Pete Hegseth and a slew of other Trump administration … ",
    "url": "https://www.huffpost.com/entry/pete-hegseth-sued-over-signal-text-debacle_n_67e2f9b5e4b074f0c26efadc"
  },
  {
    "text": "Preserving and Protecting the Integrity of American Elections  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose and Policy.  Despite pioneering self-government … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/preserving-and-protecting-the-integrity-of-american-elections/"
  },
  {
    "text": "Trump Signs Order Requiring Citizenship Proof to Vote in Federal Elections  —  Administration officials cited cracking down on immigrants illegally on voter rolls as one of the executive order's main goals, amplifying Mr. Trump's grievances about electoral integrity.",
    "url": "https://www.nytimes.com/2025/03/25/us/politics/trump-elections-executive-order.html"
  },
  {
    "text": "Trump signs order seeking to overhaul US elections, including requiring proof of citizenship  —  President Donald Trump on Tuesday signed a sweeping executive action to overhaul elections in the U.S., including requiring documentary proof of citizenship to register to vote in federal elections … ",
    "url": "https://apnews.com/article/voting-elections-trump-executive-order-4e9edb53f47e61e241a43ceef8164022"
  },
  {
    "text": "Trump signs executive order requiring proof of citizenship in federal elections  —  Election experts said Trump was claiming power he does not have and said lawsuits over the measure were all but guaranteed.  —  President Donald Trump signed an executive order Tuesday requiring people … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/25/trump-elections-citizenship-proof/"
  },
  {
    "text": "Trump Signs Order in Attempt to Vastly Reshape U.S. Elections  —  President Donald Trump signed an executive order Tuesday commanding wide-ranging changes to how U.S. elections are conducted, a move that will likely be swiftly challenged by voting rights organizations across the country.",
    "url": "https://www.democracydocket.com/news-alerts/trump-voting-elections-executive-order/"
  },
  {
    "text": "SignalGate Is Bad; But OPSEC Isn't Even the Worst Part Of It … I haven't had time to comment on the Jeff Goldberg story about the war cabinet planning a military campaign on the Signal app.  So a few brief thoughts.  —  To state the obvious, in any normal administration Hegseth and Waltz … ",
    "url": "https://talkingpointsmemo.com/edblog/signalgate-is-bad-but-opsec-isnt-even-the-worst-part-of-it"
  },
  {
    "text": "Days after the Signal leak, the Pentagon warned the app was the target of hackers  —  Several days after top national security officials accidentally included a reporter in a Signal chat about bombing the Houthi sites in Yemen, a Pentagon-wide advisory warned against using the messaging app, even for unclassified information.",
    "url": "https://www.npr.org/2025/03/25/nx-s1-5339801/pentagon-email-signal-vulnerability"
  },
  {
    "text": "NSA warned of vulnerabilities in Signal app a month before Houthi strike chat  —  The National Security Agency sent out an operational security special bulletin to its employees in February 2025 warning them of vulnerabilities in using the encrypted messaging application Signal, according to internal NSA documents obtained by CBS News.",
    "url": "https://www.cbsnews.com/news/nsa-signal-app-vulnerabilities-before-houthi-strike-chat/"
  },
  {
    "text": "Long waits, waves of calls, website crashes: Social Security is breaking down  —  A flood of cuts led by Elon Musk has sent the agency into chaos as a new commissioner prepares to take charge.",
    "url": "https://www.washingtonpost.com/politics/2025/03/25/social-security-phones-doge-cuts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQyODc1MjAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0MjU3NTk5LCJpYXQiOjE3NDI4NzUyMDAsImp0aSI6IjFkMDMzZWUyLWQ5ZTItNDdjNS05OWY4LTk1NmE1YmVlMGU1NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAzLzI1L3NvY2lhbC1zZWN1cml0eS1waG9uZXMtZG9nZS1jdXRzLyJ9.r-0WQpn_MpOALvoIcQHovmsrG46R2HoKXKyTK8lg0CY&itid=gfta"
  },
  {
    "text": "Speaker Mike Johnson floats eliminating federal courts as GOP ramps up attacks on judges  —  Republican lawmakers are setting their sights on the judiciary following court rulings that have halted Trump's agenda.  —  WASHINGTON — Facing pressure from his right flank to take on judges … ",
    "url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-floats-eliminating-federal-courts-rcna197986"
  },
  {
    "text": "Addressing Risks from Jenner & Block  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Background.  My Administration is committed to addressing the significant risks associated with law firms … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-jenner-block/"
  },
  {
    "text": "Protecting America's Bank Account Against Fraud, Waste, and Abuse  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  Promoting financial integrity and operational efficiency … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/protecting-americas-bank-account-against-fraud-waste-and-abuse/"
  },
  {
    "text": "SCOOP: Jasmine Crockett hit with censure effort for mocking paraplegic Texas governor as ‘Hot Wheels’  —  Rep. Jasmine Crockett appeared to mock Gov. Greg Abbott's disability during an event over the weekend  —  FIRST ON FOX: A GOP lawmaker is moving to have Rep. Jasmine Crockett, D-Texas … ",
    "url": "https://www.foxnews.com/politics/scoop-jasmine-crockett-hit-censure-effort-mocking-paraplegic-texas-governor-hot-wheels"
  },
  {
    "text": "Trump targets Jenner & Block in latest executive order aimed at law firms  —  President Donald Trump expanded his attacks on major U.S. law firms on Tuesday as he signed an executive order targeting Jenner & Block, which represents clients challenging some of his major policies and formerly employed … ",
    "url": "https://www.reuters.com/world/us/trump-signs-executive-order-against-law-firm-jenner-block-2025-03-25/"
  },
  {
    "text": "Trump stands by national security adviser despite leaked military plans, saying mishap had ‘no impact’ on Yemen strikes  —  “Michael Waltz has learned a lesson, and he's a good man,” President Donald Trump said of his national security adviser in a Tuesday phone interview with NBC News.",
    "url": "https://www.nbcnews.com/politics/white-house/trump-stands-national-security-adviser-leaked-military-plans-saying-mi-rcna197944"
  },
  {
    "text": "Judge Orders U.S. to Stop Attempts to Deport Columbia Undergraduate  —  The administration has been seeking to arrest and deport Yunseo Chung, who immigrated from South Korea as a child, after she participated in pro-Palestinian demonstrations.  —  A federal judge on Tuesday ordered … ",
    "url": "https://www.nytimes.com/2025/03/25/nyregion/columbia-university-protester-chung-deportation.html?unlocked_article_code=1.6k4.Xe39.n-8360aPtx0b&smid=url-share"
  },
  {
    "text": "Vaccine skeptic hired to head federal study of immunizations and autism  —  A long-discredited researcher and vaccine skeptic will conduct a government study on whether vaccines cause autism.  —  A vaccine skeptic who has long promoted false claims about the connection between immunizations … ",
    "url": "https://www.washingtonpost.com/health/2025/03/25/vaccine-skeptic-hhs-rfk-immunization-autism/"
  },
  {
    "text": "Europe fumes at Trump team's insults in leaked Signal chat  —  British forces already took part in strikes against Houthis, so don't call us “freeloaders,” former defense secretary says.  —  LONDON — Sometimes it's better not to know what your so-called friends say behind your back.",
    "url": "https://www.politico.eu/article/europe-fume-donald-trump-team-insult-leak-signal-chat/"
  },
  {
    "text": "White House Says Russia and Ukraine Agree to Stop Fighting in Black Sea  —  The agreement announced after parallel sets of talks in Riyadh would be the first significant step toward the full cease-fire the Trump Administration had been pushing, but it still would fall short.",
    "url": "https://www.nytimes.com/2025/03/25/world/europe/russia-ukraine-deal-black-sea.html"
  },
  {
    "text": "CDC is pulling back $11B in Covid funding sent to health departments across the U.S.  —  “Now that the pandemic is over, the grants and cooperative agreements are no longer necessary,” federal health authorities wrote to funding recipients this week.  —  The Centers for Disease Control … ",
    "url": "https://www.nbcnews.com/health/health-news/cdc-pulling-back-11b-covid-funding-sent-health-departments-us-rcna198006"
  },
  {
    "text": "Trump Administration Plans to Freeze Family-Planning Grants  —  Tens of millions of dollars in federal funding for Planned Parenthood and other groups would be cut off while the administration examines their DEI efforts  —  The Trump administration is moving to freeze tens of millions … ",
    "url": "https://www.wsj.com/politics/policy/trump-administration-plans-to-freeze-family-planning-grants-541441be?st=rEu3KY&reflink=mobilewebshare_permalink"
  },
  {
    "text": "60% of Republicans think the Trump administration's military leak is a very or somewhat serious problem  —  The Trump administration is currently facing questions about a story published Monday by a journalist at The Atlantic, who wrote that he had inadvertently been added … ",
    "url": "https://today.yougov.com/politics/articles/51888-republicans-think-the-trump-administrations-military-leak-is-problem"
  }
]