[
  {
    "text": "Donald Trump faces backlash after sharing video featuring a hogtied Joe Biden  —  Former President Donald Trump is facing intense criticism for what Democrats say is a new low this weekend after sharing a video on his social media website that has an image of President Joe Biden hogtied.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/30/trump-video-biden-hogtied/73154098007/"
  },
  {
    "text": "Donald Trump shares image of Joe Biden with hands and feet tied  —  Former president Donald Trump disseminated on social media on Friday an image of President Biden with his hands and feet tied, the latest example of the Republican candidate's use of increasingly violent rhetoric and imagery this campaign season.",
    "url": "https://www.washingtonpost.com/politics/2024/03/29/donald-trump-joe-biden-bound-and-gagged/"
  },
  {
    "text": "We Need to Talk About This  —  Today's widely discussed Trump post on Truth Social isn't just another instance of bad behavior.  It's not just a shrug of the shoulders and a resigned sigh of, “What are you going to do?”  Far too often, people resignedly accept Trump's behavior because they believe there's no alternative.",
    "url": "https://joycevance.substack.com/p/we-need-to-talk-about-this"
  },
  {
    "text": "Trump Posts Image of Joe Biden Kidnapped And Bound With Rope  —  Trump signals approval of violent imagery targeting his political opponents  —  On Truth Social, Trump posted a video of Trump themed vehicles driving in New York.  One of the trucks has an image of Joe Biden on the back bound with rope,.",
    "url": "https://www.meidastouch.com/news/trump-posts-image-of-joe-biden-kidnapped-and-bound-with-rope"
  },
  {
    "text": "Trump shares video with image depicting Biden tied up in the back of a pickup truck  —  The former president has previously used violent images and rhetoric as he seeks a return to the White House.  —  Former President Donald Trump shared a video on social media Friday that included an image … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-shares-image-depicting-biden-tied-back-pickup-truck-rcna145712"
  },
  {
    "text": "Arizona Republican lawmakers want to scrap early voting, question could be on November ballot  —  The Arizona state Legislature is considering asking Arizonans if they want to vote like it's 1990.  —  A measure before the state Senate would invite voters to abolish early voting and add … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/30/arizona-republicans-early-voting/73149008007/"
  },
  {
    "text": "Revisiting Florida 2000 and the Butterfly Effect  —  The evidence is strong that Al Gore would have won had it not been for an infamous ballot design in Palm Beach County.  —  We're still in a post-primary lull before the campaign starts to heat up — and before Donald J. Trump goes on trial.",
    "url": "https://www.nytimes.com/2024/03/30/upshot/florida-2000-gore-ballot.html"
  },
  {
    "text": "Republican-appointed judges raise alarm over Trump attacks on law  —  Federal D.C. Judge Reggie B. Walton warned Trump's attacks on hush-money trial judge and others could lead to violence.  Reagan, Bush-appointed judges decry Jan. 6 revisionism, threats.  —  A Republican-appointed judge … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/03/29/trump-judge-attacks-violence/"
  },
  {
    "text": "The Unhinged Arguments the Supreme Court Is Fielding on Trump Immunity  —  BUNKER MENTALITY  —  “Friend of the court” arguments are coming from across the political spectrum—and are showing the potential consequences of siding with Trump on immunity.  —  Retired American generals vehemently … ",
    "url": "https://www.thedailybeast.com/the-unhinged-arguments-the-supreme-court-is-fielding-on-trump-immunity"
  },
  {
    "text": "MAGA's Ugly, Hateful Response to Bridge Horror Is About to Get Worse … One of the ugliest features of MAGA politics is the eagerness to seize on large scale accidents, disasters, and pandemics to spread conspiracy theories, invent new culture-war obsessions, and pit one region of the country against another.",
    "url": "https://newrepublic.com/article/180286/magas-ugly-hateful-response-bridge-horror-get-worse"
  },
  {
    "text": "Donald Trump, Blasphemous Bible Thumper  —  On this holy weekend, one man is taking the Resurrection personally.  —  Donald Trump is presenting himself as the Man on the Cross, tortured for our sins.  “I consider it a great badge of courage,” he tells crowds.  “I am being indicted for you.”",
    "url": "https://www.nytimes.com/2024/03/30/opinion/trump-god-religion-easter.html"
  },
  {
    "text": "Half of senior staffers in Congress are so fed up that they may quit  —  Capitol Hill aides worry that lawmakers have increased their bombast so much that it makes it harder to do their jobs  —  When it comes to job satisfaction, members of Congress aren't the only ones considering calling it quits.",
    "url": "https://www.washingtonpost.com/politics/2024/03/30/congressional-staffers-survey/"
  },
  {
    "text": "California fast-food workers will get $20 minimum wage, starting Monday  —  California fast-food workers cooking Big Macs or whipping Frappuccinos will start making a minimum wage of $20 an hour on Monday.  For many, this means a 25% raise.  —  The new state minimum uniquely focuses … ",
    "url": "https://npr.org/2024/03/30/1241451631/california-fast-food-20-minimum-wage"
  },
  {
    "text": "Why there's no big wave of immigrants voting illegally … - “They are allowing these people to come in ... they are signing them up to vote,” Trump told a crowd at a campaign stop in Iowa in January.  — “That's why you are having millions of people pour into our country, and it could very well affect the next election.”",
    "url": "https://www.axios.com/2024/03/30/no-big-wave-immigrants-voting-illegally-trump"
  },
  {
    "text": "Democrats Embrace IVF in Fight to Regain House in 2024  —  In Iowa contest, Democratic challenger Christina Bohannan highlights her personal story in pitch to voters  —  DEWITT, Iowa—A congressional race in Iowa is testing whether the national uproar surrounding in vitro fertilization … ",
    "url": "https://www.wsj.com/politics/policy/democrats-embrace-ivf-in-fight-to-regain-house-in-2024-1fdacc87"
  },
  {
    "text": "Three gringos in Coral Gables launch Biden-Harris Latino campaign.  (Sad trombone.)  —  If a picture is worth a thousand words, then the one recently in the Miami Herald of Florida Democratic Party chair Nikki Fried, Second Gentleman Douglas Emhoff and Miami-Dade County Mayor Daniella Levine Cava … ",
    "url": "https://www.miamiherald.com/news/local/news-columns-blogs/fabiola-santiago/article287165135.html"
  }
]