[
  {
    "text": "Rep. Dean Phillips tears into fellow Democrats over 2024 loss … - “We have a political system ... that really has incentives that actually are working against us. … - “Both parties are subject to it. … - “I think that's what frankly has led to Trumpism, people getting tired … ",
    "url": "https://www.axios.com/2024/11/10/dean-phillips-democrats-fox-news"
  },
  {
    "text": "Biden appears to struggle while walking on beach with first lady  —  President Biden to meet with successor President-elect Trump at White House on Wednesday  —  A video clip making the rounds online shows President Biden appearing to struggle while walking on the beach with first lady Jill Biden.",
    "url": "https://www.foxnews.com/politics/biden-appears-struggle-while-walking-beach-first-lady"
  },
  {
    "text": "Trump talked to Putin, told Russian leader not to escalate in Ukraine  —  President-elect Donald Trump spoke with Russian President Vladimir Putin on Thursday and discussed the war in Ukraine, according to people familiar with the call.  —  President-elect Donald Trump spoke … ",
    "url": "https://www.washingtonpost.com/national-security/2024/11/10/trump-putin-phone-call-ukraine/"
  },
  {
    "text": "2024's other big loser?  The mainstream media.  Is there any path forward?  —  The American mainstream media, and its vital watchdog role that once made it a trusted, major institution in a flawed yet functioning democracy, imploded in 2024, and it happened in two ways … ",
    "url": "https://www.inquirer.com/opinion/commentary/trust-mainstream-media-2024-election-20241110.html?id=bpjtJ3uwA0BYL"
  },
  {
    "text": "Trump presses next GOP Senate leader to allow ‘recess appointments’  —  It comes as Rick Scott has racked up support from prominent conservative backers, including Elon Musk.  —  President-elect Donald Trump on Sunday said Senate Republicans' next leader must embrace so-called “recess appointments … ",
    "url": "https://www.politico.com/news/2024/11/10/trump-presses-next-republican-senate-leader-recess-appointments-00188640"
  },
  {
    "text": "Musk calls Thune “top choice of Democrats” for GOP leader … - President-elect Trump frequently battled GOP Leader Mitch McConnell (R-Ky.) during his first term and could decide to put his thumb on the scale to get someone sure to do his bidding this time around.",
    "url": "https://www.axios.com/2024/11/10/musk-calls-thune-top-choice-of-democrats-for-gop-leader"
  },
  {
    "text": "Trump offers Rep. Elise Stefanik role of UN ambassador, sources say  —  President-elect Donald Trump has offered Republican Rep. Elise Stefanik the job as US ambassador to the United Nations, two sources familiar told CNN on Sunday.  —  The New York congresswoman, the fourth-ranking House Republican … ",
    "url": "https://www.cnn.com/2024/11/10/politics/elise-stefanik-trump-us-ambassador-to-un"
  },
  {
    "text": "Jockeying kicks off to fill Vance vacancy in Senate  —  Ohio Gov. Mike DeWine (R) is facing a key decision on whom to tap to fill the term of Vice President-elect Vance as jockeying among Ohio Republicans for the coveted appointment is set to become a knife fight.",
    "url": "https://thehill.com/homenews/senate/4981631-senate-vacancy-vance-ohio-dewine/"
  },
  {
    "text": "Schumer withholds Senate orientation invite from McCormick  —  Democrats are holding out hope that Sen. Bob Casey can pick up enough votes to hold on to the Pennsylvania Senate seat.  —  Senate Majority Leader Chuck Schumer will not allow Sen.-elect Dave McCormick (R-Pa.) … ",
    "url": "https://www.politico.com/news/2024/11/10/schumer-casey-mccormick-senate-orientation-00188644"
  },
  {
    "text": "House Fast Tracks Bill That Would Give Trump Power to Target Nonprofits  —  The legislation would let the Treasury Department revoke tax-exempt status for any “terrorist supporting organization”  —  Donald Trump hasn't even taken office, and Congress is already moving to advance legislation to expand his ability to target his enemies.",
    "url": "https://www.rollingstone.com/politics/politics-news/house-bill-trump-power-target-nonprofits-1235161151/"
  },
  {
    "text": "Arizona attorney general says she has ‘no intention’ of dropping fake electors case  —  “A grand jury in the state of Arizona decided that these individuals who engaged in an attempt to overthrow our democracy in 2020 should be held accountable, so we won't be cowed,” Kris Mayes said.",
    "url": "https://www.nbcnews.com/politics/2020-election/arizona-attorney-general-says-no-intention-dropping-fake-electors-case-rcna179505"
  },
  {
    "text": "Many in government are worried about Trump's return.  At DOJ, they're terrified.  —  Trump blames DOJ for much of his torment over the past four years.  Lawyers there fear what's next.  —  A collective sense of dread has taken hold at the Department of Justice, which drew Donald Trump's rage … ",
    "url": "https://www.politico.com/news/2024/11/10/trump-return-justice-department-00188623"
  },
  {
    "text": "Trump Won, So Jim Jordan Is No Longer Worried About Election Fraud  —  The Republican congressman admitted the 2024 election was “free and fair.”  But what changed between 2020 and now?  —  Rep. Jim Jordan was a key figure in Jan. 6 and the attempt to overturn the results of the 2020 election … ",
    "url": "https://www.rollingstone.com/politics/politics-news/jim-jordan-election-fraud-2024-trump-won-1235159908/"
  },
  {
    "text": "The Dream of the Raised Arm  —  Born in 1907 in Forst, Germany, a town near the Polish border, Charlotte Beradt was a young journalist who reported on women's issues and other aspects of German social and political life for the weekly journal Die Weltbühne.",
    "url": "https://www.nybooks.com/articles/2024/12/05/the-dream-of-the-raised-arm-third-reich-of-dreams-beradt-zadie-smith/"
  },
  {
    "text": "Gannett probes possible leak of bombshell Iowa poll  —  THE SCOOP  —  Gannett, the publishing chain that owns the Des Moines Register, has launched an investigation into the apparent leak of Ann Selzer's bombshell Iowa poll, two people familiar with the matter confirmed to Semafor.",
    "url": "https://www.semafor.com/article/11/10/2024/gannett-probes-possible-leak-of-bombshell-iowa-poll"
  },
  {
    "text": "Justice Sonia Sotomayor Is Expected to Remain on Supreme Court  —  Some liberal activists have called for the 70-year-old Obama appointee to retire before Trump can fill her seat  —  WASHINGTON—Despite calls from some liberal activists for Justice Sonia Sotomayor to step down while Democrats … ",
    "url": "https://www.wsj.com/us-news/law/justice-sonia-sotomayor-is-expected-to-remain-on-supreme-court-2aaf62e0?st=gYLFiY"
  },
  {
    "text": "The Democrats Need an Honest Conversation on Gender Identity  —  One of the mysteries of this election is how the Democrats approached polling day with a set of policies on gender identity that they were neither proud to champion—nor prepared to disown.  —  Although most Americans agree … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/11/democrats-dishonest-gender-conversation-2024-election/680604/"
  }
]