[
  {
    "text": "Aide to Rep. Nadler Is Handcuffed Amid Confrontation With Federal Agents  —  Captured on video, the episode occurred in the congressman's Manhattan office, shortly after the aide observed agents detaining immigrants outside a courtroom.  —  Federal officers entered Representative Jerry Nadler's office … ",
    "url": "https://www.nytimes.com/2025/05/31/nyregion/nadler-aide-handcuffed-federal-agents.html"
  },
  {
    "text": "‘It can happen to anyone’: Nadler rebukes DHS after staffer detained in Manhattan office  —  The agency said the unidentified staff member was not charged.  —  Officers with the Department of Homeland Security briefly detained a staff member in Rep. Jerry Nadler's (D-N.Y.) … ",
    "url": "https://www.politico.com/news/2025/05/31/jerry-nadler-dhs-detained-00378785"
  },
  {
    "text": "White House to pull NASA nominee Isaacman  —  The Scoop  —  The White House is pulling the nomination of Jared Isaacman to be the next NASA administrator, just days before he was set to receive a confirmation vote in the Senate, according to three people familiar with the matter and confirmed by the administration.",
    "url": "https://www.semafor.com/article/05/31/2025/white-house-expected-to-pull-nasa-nominee-isaacman"
  },
  {
    "text": "Trump to Withdraw Musk's Ally as Nominee for Top NASA Job  —  Jared Isaacman was a close associate of Elon Musk, whose SpaceX company has multiple contracts with NASA.  —  President Trump plans to withdraw his nomination of Jared Isaacman, a billionaire entrepreneur and close associate of Elon Musk's … ",
    "url": "https://www.nytimes.com/2025/05/31/us/politics/trump-nasa-nominee-musk.html?unlocked_article_code=1.LU8.G-8p.0JCmE02dSBA0&smid=url-share"
  },
  {
    "text": "Jared Isaacman told his nomination as NASA administrator will be withdrawn  —  The billionaire entrepreneur has ties to SpaceX and Elon Musk.  —  Jared Isaacman, President Donald Trump's pick to be NASA administrator, has been told by the White House that his nomination will be rescinded … ",
    "url": "https://www.washingtonpost.com/technology/2025/05/31/nasa-nomination-administrator-senate-isaacman/"
  },
  {
    "text": "Gabbard considering ways to revamp Trump's intelligence briefing  —  One idea is to make the briefing, which according to his schedule Trump has been taking less often than his predecessors, a video that looks like Fox News.  —  WASHINGTON — President Donald Trump's intelligence chief … ",
    "url": "https://www.nbcnews.com/politics/national-security/gabbard-considering-ways-revamp-trumps-intelligence-briefing-rcna209805"
  },
  {
    "text": "It's called the Library of Congress.  But Trump claims it's his.  —  The case is the latest example of efforts by the Trump administration to erase the traditional lines that separate the branches of government.  —  The Trump White House has a new target in its campaign to expand executive power: the Library of Congress.",
    "url": "https://www.washingtonpost.com/politics/2025/05/31/library-of-congress-trump-executive-branch/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ4NjY0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwMDQ2Mzk5LCJpYXQiOjE3NDg2NjQwMDAsImp0aSI6IjU1ZTE0ZWRjLWI5NjItNDRiNy04NTY2LWI1NmZjNzc2MjA3OCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA1LzMxL2xpYnJhcnktb2YtY29uZ3Jlc3MtdHJ1bXAtZXhlY3V0aXZlLWJyYW5jaC8ifQ.1xxCRzWxK1NXz7G6wc_Lky79PBAew9D39HGzyAPzo58&itid=gfta"
  },
  {
    "text": "Trump's Hated ‘TACO’ Nickname Is Catching On: CNN Data Guru  —  WHAT'S IN A NAME?  —  The president is not happy with his new Wall Street-inspired moniker.  —  CNN's resident data guru says President Donald Trump's hated “TACO” nickname is gaining popularity.",
    "url": "https://www.thedailybeast.com/trumps-hated-taco-nickname-is-catching-on-cnn-data-guru-harry-enten/"
  },
  {
    "text": "‘TACO’ Is the Secret to Trump's Resilience  —  Judging by his reaction to a reporter's question this week, Donald Trump doesn't like it when you ask him about “TACO” — the reported Wall Street acronym for “Trump Always Chickens Out,” an assumption that makes it safe to be in the market … ",
    "url": "https://www.nytimes.com/2025/05/31/opinion/trump-taco-resilient.html"
  },
  {
    "text": "Trump, Bashing the Federalist Society, Asserts Autonomy on Judge Picks  —  The president has grown increasingly angry at court rulings blocking parts of his agenda, including by judges he appointed.  —  President Trump appears to be declaring independence from outside constraints on how he nominates judges … ",
    "url": "https://www.nytimes.com/2025/05/30/us/politics/trump-judges-nominations.html?unlocked_article_code=1.LU8.67al.TV7M3LuXBybz&smid=url-share"
  },
  {
    "text": "Universities quietly negotiating with White House aide to try to avoid Harvard's fate, source says  —  College and university leaders have been privately negotiating with a deputy to top Trump aide Stephen Miller in hopes of avoiding the same aggressive targeting of Harvard University … ",
    "url": "https://cnn.com/2025/05/31/politics/universities-negotiate-trump-administration-harvard"
  },
  {
    "text": "Trump Says Steel and Aluminum Tariffs Will Double to 50%  —  The president at a rally says U.S. Steel, which is in a deal with Nippon Steel, will remain U.S.-controlled  —  WEST MIFFLIN, Pa.—President Trump said he would double tariffs on imported steel, a move he said would bolster the domestic industry and protect U.S. jobs.",
    "url": "https://www.wsj.com/economy/trade/trump-is-praising-his-u-s-steel-deal-no-one-is-sure-what-it-means-a6cb15b5?st=B6YvLc"
  },
  {
    "text": "Really, Secretary Rubio?  I'm Lying About the Kids Dying Under Trump?  —  I see Secretary of State Marco Rubio as a good man doing bad things, but perhaps he thinks even worse of me: He recently suggested that I was a liar.  —  While testifying before Congress, Rubio claimed … ",
    "url": "https://www.nytimes.com/2025/05/31/opinion/rubio-usaid-africa.html?unlocked_article_code=1.LU8.j-Or.1ReLGqoFasLk&smid=url-share"
  },
  {
    "text": "Wes Moore and Tim Walz Go to a Fish Fry and Spatter 2028 Gossip Everywhere  —  As the two governors made buzzy appearances in South Carolina, Democrats in the influential state were already looking to the next election and wondering: Who can win?  —  Gov. Wes Moore of Maryland played … ",
    "url": "https://www.nytimes.com/2025/05/31/us/politics/wes-moore-tim-walz-south-carolina-democrats.html"
  },
  {
    "text": "Business owners confront ICE agents during arrest at Great Barrington job site  —  ‘I felt like I was in North Korea’  —  GREAT BARRINGTON — Federal agents arrested one of two men at their landscaping job site on Friday morning, but their clients confronted the agents and prevented the second man from being taken into custody.",
    "url": "https://www.berkshireeagle.com/news/southern_berkshires/ice-arrests-berkshires-great-barrington/article_f90f2550-5409-46c9-93a2-5d8daab8c82f.html"
  },
  {
    "text": "MAGA outlet's Pentagon correspondent criticized Hegseth.  And then she was fired, she says  —  Gabrielle Cuccia criticized Defense Secretary Pete Hegseth's crackdown on press access at the Pentagon.  And then, she said, she was fired.  —  Cuccia was briefly the chief Pentagon correspondent … ",
    "url": "https://cnn.com/2025/05/31/media/gabrielle-cuccia-oan-pentagon-maga-fired-hegseth"
  },
  {
    "text": "These Kentucky Republicans attempt an unlikely bulwark to Trump  —  While most Republicans in Congress cower at challenging the president, Mitch McConnell, Thomas Massie and Rand Paul are vocally pushing back on many administration policies.  —  It is one of the most politically conservative states … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/31/trump-mcconnell-rand-paul/"
  },
  {
    "text": "Trump to meet with Germany's Merz in Washington next week  —  President Trump is set to meet with German Chancellor Friedrich Merz next week in Washington, marking the first in-person meeting between the two leaders.  —  Merz, the leader of the center-right Christian Democratic Union (CDU) … ",
    "url": "https://thehill.com/homenews/administration/5327248-donald-trump-friedrich-merz-german-chancellor-washington-meeting/"
  },
  {
    "text": "‘Devastating.’ NIH cancels future funding plans for HIV vaccine consortia  —  Researchers decry agency's decision just as new leads reinvigorate search for long-sought vaccine  —  Skip backwardsGo ten seconds backward Skip forwardsGo ten seconds forward  —  Audio is AI-generated.  Report an issue|",
    "url": "https://www.science.org/content/article/devasting-nih-cancels-future-funding-plans-hiv-vaccine-consortia"
  },
  {
    "text": "Trump pardons drive a big, burgeoning business for lobbyists  —  With Trump issuing pardons on a rolling basis, lobbyists say clients are willing to pay significant sums to get their cases in front of the president.  —  Seeking a pardon from President Donald Trump has become big business … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-pardons-drive-big-burgeoning-business-lobbyists-rcna209801"
  },
  {
    "text": "Iran Builds Up Near Weapons-Grade Uranium Stockpile Despite Nuclear Talks  —  U.N. atomic agency reports that Iran hasn't cooperated with nuclear probe, raising prospect of snapback of sanctions on Tehran  —  Iran has continued to produce highly enriched uranium at a pace of roughly … ",
    "url": "https://www.wsj.com/world/middle-east/iran-builds-up-near-weapons-grade-uranium-stockpile-despite-nuclear-talks-2f371dae?st=kYET6n&reflink=article_copyURL_share"
  },
  {
    "text": "Trump pardons drug kingpins even as he escalates U.S. drug war rhetoric  —  President Donald Trump has long called for escalating the U.S. drug war against Mexican cartels and wants tougher penalties for dealers selling fentanyl and other street drugs in American communities.",
    "url": "https://www.npr.org/2025/05/31/nx-s1-5415939/trump-pardons-drug-kingpins-even-as-he-escalates-the-u-s-drug-war"
  },
  {
    "text": "Judge blocks Trump administration from revoking protected status for thousands of Venezuelans  —  The decision comes after the Supreme Court allowed the administration to remove protected status for hundreds of thousands of Venezuelans.  —  A federal judge on Friday blocked the Trump administration … ",
    "url": "https://www.nbcnews.com/politics/immigration/judge-blocks-trump-revoking-protected-status-thousands-venezuelans-rcna210153"
  },
  {
    "text": "Trump Officials Deported Another Man Despite Court Order  —  A federal appeals panel ordered officials not to deport a 31-year-old to El Salvador.  Minutes later, it happened anyway.  The government blamed “administrative errors.”  —  The Trump administration deported a 31-year-old Salvadoran man minutes … ",
    "url": "https://www.nytimes.com/2025/05/30/us/politics/trump-deportation-el-salvador.html"
  },
  {
    "text": "Biden decline was so bad he got lost in White House closet, whistleblower tells Senator  —  It comes as more reports emerge about the former president's alleged cognitive decline  —  As more reports emerge about former President Biden's alleged cognitive decline during his time in office … ",
    "url": "https://www.foxnews.com/politics/biden-decline-so-bad-he-got-lost-white-house-closet-whistleblower-tells-senator"
  }
]