[
  {
    "text": "GOP rep warns House has final say over election after states deem Trump ineligible for ballots  —  Rep. Thomas Massie (R-Ky.) issued a warning to states moving to keep former President Trump off the presidential ballot, saying the House of Representatives has the final say over whether electors … ",
    "url": "https://thehill.com/homenews/house/4382017-thomas-massie-house-2024-election-trump-ballots/"
  },
  {
    "text": "Suddenly, Trump Is Interested in Democracy  —  As Maine throws him off the ballot, the president who betrayed democracy is now pleading for its protections.  —  Donald Trump won the presidency with fewer votes than his opponent?  —  State Republican parties in Wisconsin, North Carolina … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/12/trump-maine-ballot/676987/"
  },
  {
    "text": "How the Supreme Court May Rule on Trump's Presidential Run  —  The legal issues are novel and tangled, experts said, and the justices may be wary of knocking a leading presidential candidate off the ballot.  —  The Supreme Court, battered by ethics scandals, a dip in public confidence … ",
    "url": "https://www.nytimes.com/2023/12/29/us/supreme-court-trump-election.html"
  },
  {
    "text": "Trump doesn't have immunity from Jan. 6 civil suit brought by U.S. Capitol Police officers, appeals court says  —  Washington — A federal appeals court on Friday allowed a lawsuit brought by a group of U.S. Capitol Police officers against former President Donald Trump to move forward … ",
    "url": "https://www.cbsnews.com/news/trump-jan-6-immunity-us-capitol-police-officers-civil-suit-appeals-court/"
  },
  {
    "text": "December 29, 2023  —  When asked at a town hall on Wednesday to identify the cause of the United States Civil War, presidential candidate and former governor of South Carolina Nikki Haley answered that the cause “was basically how government was going to run, the freedoms … ",
    "url": "https://heathercoxrichardson.substack.com/p/december-29-2023"
  },
  {
    "text": "Nikki Haley's Civil War Battlefield  —  The GOP presidential candidate made a political mistake with her initial comments.  But she wasn't wrong.  —  Nikki Haley made a mess.  —  Part of the job of running for president is being able to think on your feet and answer weird questions that come out of the blue.",
    "url": "https://www.wsj.com/articles/nikkis-charge-civil-war-history-slavery-campaign-new-hampshire-7d30bef3?mod=followamazon"
  },
  {
    "text": "Michael Cohen Used Fake Cases Cited by A.I. to Seek an End to Court Supervision  —  Donald Trump's former fixer had sought an early end to court supervision after his 2018 campaign finance conviction.  He enlisted the help of Google Bard.  —  Michael D. Cohen, the onetime fixer … ",
    "url": "https://www.nytimes.com/2023/12/29/nyregion/michael-cohen-ai-fake-cases.html"
  },
  {
    "text": "Michael Cohen admits fake cases in early release bid came from Google AI program  —  The former Trump attorney pleaded guilty to campaign finance violations in 2018.  —  Michael Cohen, former personal lawyer to President Donald Trump, arrives at New York State Supreme Court, Oct. 25, 2023, in New York.",
    "url": "https://abcnews.go.com/US/michael-cohen-admits-fake-cases-early-release-bid/story?id=105994743"
  },
  {
    "text": "New Jersey Man Charged With Attempting To Provide Material Support To Al Shabaab  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Damian Williams, the United States Attorney for the Southern District of New York, Matthew G. Olsen … ",
    "url": "https://www.justice.gov/usao-sdny/pr/new-jersey-man-charged-attempting-provide-material-support-al-shabaab"
  },
  {
    "text": "New Jersey man faces terrorism charge after allegedly being motivated by Oct. 7 attack on Israel  —  A New Jersey man is facing a terrorism charge after he attempted to provide material support for the Islamist militant group al Shabaab in Somalia, federal prosecutors announced Friday.",
    "url": "https://www.washingtonexaminer.com/policy/defense-national-security/new-jersey-man-terrorism-charge-oct-7"
  },
  {
    "text": "Judge blocks most of an Iowa law banning some school library books and discussion of LGBTQ+ issues  —  A federal judge on Friday temporarily blocked key parts of an Iowa law that bans some books from school libraries and forbids teachers from raising LGBTQ+ issues.",
    "url": "https://apnews.com/article/iowa-book-ban-lgbtq-2b53b6c361bad54e94626a8a26b7f034"
  },
  {
    "text": "Legal scholar Jonathan Turley becomes latest ‘swatting’ victim after false report of shooting at his home  —  Legal scholar Johnathan Turley has become the latest victim of “swatting” as a 911 call was made falsely reporting someone was shot at his Virginia home.  —  “Yes, I was swatted this evening.",
    "url": "https://nypost.com/2023/12/29/news/legal-scholar-jonathan-turley-becomes-latest-swatting-victim/"
  },
  {
    "text": "Ohio's Republican governor vetoes ban on gender-affirming care  —  Ohio Gov. Mike DeWine (R) vetoed a bill on Friday that would have prevented minors from receiving gender-affirming health care and restricted transgender girls' ability to participate on school sports teams.",
    "url": "https://www.axios.com/2023/12/29/ohio-republican-dewine-trans-care-sports-ban-veto"
  },
  {
    "text": "Magnetic balls sold by Walmart recalled due to choking and injury risks to kids  —  High-powered magnetic balls sold by Walmart are being recalled because similar products have led to serious injuries and even death for children who swallowed them.  —  The recall involves 5 millimeter … ",
    "url": "https://www.cbsnews.com/news/magnetic-balls-walmart-product-recall-relax/"
  }
]