[
  {
    "text": "Why Trump might regret passing on the first debate  —  In recent nominating contests, the nationally televised shoutfests have prompted significant shifts in polling afterward.  —  Donald Trump wants to deprive his competitors of any oxygen.  That's why the former president is likely skipping next week's debate in Milwaukee.",
    "url": "https://www.politico.com/news/2023/08/19/2024-debates-matter-00111948"
  },
  {
    "text": "Inside Trump's Decision to Skip the G.O.P. Debate  —  Fox News leaned on the former president privately and publicly to join the debate.  But all the while he was proceeding with a plan for his own counterprogramming.  —  On a cool August night on the crowded patio of his private club in New Jersey … ",
    "url": "https://www.nytimes.com/2023/08/19/us/politics/trump-fox-debate.html"
  },
  {
    "text": "Christie: Trump Canceled Election Fraud Press Conference Because 'He's Scared' Of Jail  —  Trump first promised a news conference to reveal proof that the 2020 election in Georgia had been “stolen” from him, but then canceled.  —  ATLANTA — While Donald Trump claims he canceled … ",
    "url": "https://www.huffpost.com/entry/christie-trump-scared-of-jail_n_64e0da41e4b04a3ebc33f537"
  },
  {
    "text": "Giuliani Repeatedly Sought Financial Lifeline From Trump  —  As Rudolph Giuliani has neared a financial breaking point with a pile of legal bills, the former president has largely demurred, despite making a vague promise to pay up.  —  Rudolph W. Giuliani is running out of money and looking … ",
    "url": "https://www.nytimes.com/2023/08/19/us/politics/giuliani-trump-legal-finances.html"
  },
  {
    "text": "Scoop: Big GOP donors push for Trump alternative  —  Several top GOP donors, panicked about their current choices, are holding back 2024 money with the long-shot dream of luring an alternative to former President Trump into the presidential race at the last minute.",
    "url": "https://www.axios.com/2023/08/19/gop-donors-dreaming-trump-alternative"
  },
  {
    "text": "Rupert Murdoch encouraged Virginia's Glenn Youngkin to seek presidency  —  CORRECTION  —  A previous version of this article incorrectly said that Fox News settled a lawsuit by Dominion Voting Systems for nearly $788 billion.  The settlement was for nearly $788 million.  The article has been corrected.",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/08/18/rupert-murdoch-glenn-youngkin-fox-news-presidency/"
  },
  {
    "text": "Kevin Kruse on Florida's whitewashing of Black history  —  The part about slavery is getting all the attention.  But Kruse argues that Florida's treatment of the 20th century is just as egregious.  —  ∙ Paid … Florida Gov. Ron DeSantis has been pilloried, and rightfully so … ",
    "url": "https://www.publicnotice.co/p/kevin-kruse-florida-history-curriculum-desantis"
  },
  {
    "text": "What's next for the one-time red state turned southwestern battleground?  —  Arizona's become more competitive, but a top Democratic strategist warns 'folks who assume that Arizona's gotten more progressive do so at their own peril'  —  President Biden not only made history in 2020 … ",
    "url": "https://www.foxnews.com/politics/whats-next-one-time-red-state-turned-southwestern-battleground"
  },
  {
    "text": "The Constitution Prohibits Trump From Ever Being President Again  —  The only question is whether American citizens today can uphold that commitment.  —  As students of the United States Constitution for many decades—one of us as a U.S. Court of Appeals judge, the other as a professor … ",
    "url": "https://www.theatlantic.com/ideas/archive/2023/08/donald-trump-constitutionally-prohibited-presidency/675048/"
  },
  {
    "text": "Biden campaign expects GOP candidates to ‘out-MAGA each other’ during first debate  —  In a memo first shared with NBC News, the Biden campaign plans to highlight abortion rights and threats to democracy when candidates take the stage Wednesday night.  —  The Biden campaign plans to highlight … ",
    "url": "https://www.nbcnews.com/politics/2024-election/biden-campaign-expects-candidates-maga-debate-rcna100712"
  },
  {
    "text": "Von der Leyen condemns Turkish Cypriot attack on UN peacekeepers  —  The European Commission President Ursula von der Leyen joined the U.K., France and the U.S. in expressing shock and disapproval over an assault on U.N. peacekeepers in Cyprus by Turkish Cypriots.",
    "url": "https://www.politico.eu/article/von-der-leyen-condemns-turkish-cypriot-attack-on-un-peacekeepers/"
  },
  {
    "text": "Proud Boy on house arrest in Jan. 6 case disappears ahead of sentencing  —  Authorities are searching for a member of the Proud Boys extremist group who disappeared days before his sentencing in a U.S. Capitol riot case, where prosecutors are seeking more than a decade in prison, according to a warrant made public Friday.",
    "url": "https://apnews.com/article/jan-6-capitol-attack-proud-boy-1341d4596fb96ee2828b54d70ef7e126"
  },
  {
    "text": "Camp David Summit: The U.S., Japan and South Korea Form Security Pact  —  Meeting at Camp David, the leaders of the three countries avoided raising tensions with China, but the country loomed large over the meeting.",
    "url": "https://www.nytimes.com/live/2023/08/18/us/biden-news-camp-david"
  },
  {
    "text": "The Spirit of Camp David: Joint Statement of Japan, the Republic of Korea, and the United States  —  We, the leaders of Japan, the Republic of Korea (ROK), and the United States, convened at Camp David to inaugurate a new era of trilateral partnership.  We do so at a time of unparalleled opportunity … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/08/18/the-spirit-of-camp-david-joint-statement-of-japan-the-republic-of-korea-and-the-united-states/"
  },
  {
    "text": "Our collective malady: Donald Trump's mental health crisis is America's problem  —  Experts: Trump's “denial of reality” and “primitive projections” are imploding.  He's even more dangerous  —  To properly respond to Donald Trump and the level of extreme danger he represents … ",
    "url": "https://www.salon.com/2023/08/18/our-collective-malady-donald-mental-health/"
  }
]