[
  {
    "text": "Trump immunity fight turns Supreme Court textualists topsy-turvy  —  “It sure ain't originalism,” one critic said.  —  The Supreme Court's conservatives often accuse liberals of inventing provisions nowhere to be found in the Constitution.  Now, the fingers are pointed in the other direction.",
    "url": "https://www.politico.com/news/2024/04/27/supreme-court-trump-immunity-00154744"
  },
  {
    "text": "The Court Just Sealed Everyone's Fate, Including Its Own  —  This week, the Supreme Court managed to fail to meet the already extremely low expectations most sane people already had for it.  First, during the Idaho EMTALA case on whether hospitals receiving federal funding can refuse … ",
    "url": "https://newrepublic.com/article/181032/supreme-court-trump-immunity-sealed-fate"
  },
  {
    "text": "Barr, who said Trump shouldn't be near Oval Office, says he will vote for him in 2024  —  Former Attorney General Bill Barr, who previously said that Donald Trump shouldn't be near the Oval Office, told CNN's Kaitlan Collins Friday that he would vote for the former president over President Joe Biden in the 2024 election.",
    "url": "https://www.cnn.com/2024/04/26/politics/barr-vote-for-trump-2024/"
  },
  {
    "text": "GOP urges Secret Service to move protesters from park near convention arena  —  The Republican Party is urging the Secret Service to move protesters farther away from the arena in Milwaukee where the party will hold its convention in July, according to a letter sent to the agency Friday and reviewed by The Washington Post.",
    "url": "https://www.washingtonpost.com/politics/2024/04/26/republican-national-convention-protests-milwaukee/"
  },
  {
    "text": "G.O.P. Asks Secret Service to Move Protesters Away From Convention Venue  —  The Republican National Committee said moving protesters farther away from the venue in Milwaukee would reduce the risk of confrontations.  —  The Republican Party sent a letter to the Secret Service on Friday urging … ",
    "url": "https://www.nytimes.com/2024/04/26/us/politics/republican-convention-protest-milwaukee.html"
  },
  {
    "text": "A physician, a lawyer, a CEO: the 84 fake electors who allegedly tried to steal the 2020 election  —  With a new indictment this week, 36 have been criminally charged and 10 face a civil lawsuit - but seven hold office  —  With the indictment announced in Arizona this week … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/27/fake-electors-2020-presidential-election"
  },
  {
    "text": "Britain's Conservative Party, like the U.S. Republican Party, is in turmoil  —  Five years after a landslide victory, Britain's Conservative Party is deeply divided and appears headed towards one of its worst defeats in a generation  —  LONDON — Five years ago, Britain's Conservative Party scored … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/28/britain-conservative-party-turmoil-analysis/"
  },
  {
    "text": "D.C. police rejected GWU's plea to sweep out university protesters  —  D.C. police rejected pleas from George Washington University officials to clear pro-Palestinian demonstrators out of an on-campus encampment early Friday morning, saying they worried about the optics of moving … ",
    "url": "https://www.washingtonpost.com/dc-md-va/2024/04/26/dc-police-george-washington-university-protests/"
  },
  {
    "text": "Donald Trump is now blasting RFK Jr. for taking support from him  —  WASHINGTON - Former President Donald Trump is now going all-out against Robert F. Kennedy, Jr., amid polls that indicate the independent candidate would take more votes than Trump than incumbent President Joe Biden.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/04/27/donald-trump-attacks-rfk-jr-votes/73481350007/"
  },
  {
    "text": "Columbia Bars Student Protester Who Said 'Zionists Don't Deserve to Live'  —  After video surfaced on social media, the student, Khymani James, said on Friday that his comments were wrong.  —  Columbia University has barred from its campus a leader in the pro-Palestinian student protest encampment … ",
    "url": "https://www.nytimes.com/2024/04/26/nyregion/columbia-student-protest-zionism.html"
  },
  {
    "text": "Putin Didn't Directly Order Alexei Navalny's February Death, U.S. Spy Agencies Find  —  The finding, which doesn't absolve the Russian leader of ultimate responsibility, deepens the mystery surrounding the dissident's death at an Arctic gulag",
    "url": "https://www.wsj.com/world/russia/alexei-navalny-death-us-intelligence-71bc95b0"
  },
  {
    "text": "'Where's Cricket?'  Don't Ask.  Kristi Noem Defends Killing Her Dog.  —  In a forthcoming book, the South Dakota governor, seen as a potential vice-presidential pick, tells of shooting her hunting dog.  And a goat.  —  Gov. Kristi Noem of South Dakota on Friday defended a story included … ",
    "url": "https://www.nytimes.com/2024/04/26/us/politics/kristi-noem-dog-killing.html"
  },
  {
    "text": "Trump will dismantle key US weather and science agency, climate experts fear  —  Plan to break up Noaa claims its research is ‘climate alarmism’ and calls for commercializing forecasts, weakening forecasts  —  Climate experts fear Donald Trump will follow a blueprint created by his allies … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/26/trump-presidency-gut-noaa-weather-climate-crisis"
  },
  {
    "text": "The Tech Baron Seeking to “Ethnically Cleanse” San Francisco … To fully grasp the current situation in San Francisco, where venture capitalists are trying to take control of City Hall, you must listen to Balaji Srinivasan.  Before you do, steel yourself for what's to come … ",
    "url": "https://newrepublic.com/article/180487/balaji-srinivasan-network-state-plutocrat"
  },
  {
    "text": "Biden, Asked if He's Planning to Debate Trump, Says ‘I Am’  —  The president's announcement came after months in which he and his campaign declined to say whether he would debate his predecessor.  —  President Biden said on Friday that he would participate in a general-election debate … ",
    "url": "https://www.nytimes.com/2024/04/26/us/politics/biden-debate-trump.html"
  }
]