[
  {
    "text": "The Supreme Court Should Rule Swiftly on Trump's Immunity Claim  —  On Thursday, the U.S. Supreme Court will hear Donald Trump's arguments that he is immune from prosecution for his efforts to steal the 2020 presidential election.  It is likely that all — or nearly all … ",
    "url": "https://www.nytimes.com/2024/04/22/opinion/trump-immunity-supreme-court.html"
  },
  {
    "text": "Live updates Opening statements expected in Trump hush money trial  —  NEW YORK — Opening statements are expected Monday morning in Donald Trump's trial for allegedly falsifying business records to hide a hush money payment during the 2016 presidential election campaign.",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/trump-hush-money-trial-live-updates/"
  },
  {
    "text": "Trump's Trial Is the Reality Show He Never Wanted  —  The former president faces weeks of challenging witnesses and tawdry stories.  —  Prosecutors and defense attorneys will make opening statements today in a criminal fraud trial in New York that Donald Trump has tried mightily, and unsuccessfully, to delay.",
    "url": "https://www.bloomberg.com/opinion/articles/2024-04-22/trump-s-trial-is-the-reality-show-he-never-wanted"
  },
  {
    "text": "Columbia University faces full-blown crisis as rabbi calls for Jewish students to ‘return home’  —  Columbia University is facing a full-blown crisis heading into Passover as a rabbi linked to the Ivy League school urged Jewish students to stay home and tense confrontations on campus sparked condemnation … ",
    "url": "https://www.cnn.com/2024/04/21/us/columbia-university-jewish-students-protests/"
  },
  {
    "text": "Republicans Are Suing for the Right To Harass Election Workers  —  You might think that even in today's highly polarized election environment there would be a bipartisan consensus to protect election workers from intimidation and harassment.  If you thought so, you would be wrong.",
    "url": "https://www.democracydocket.com/opinion/republicans-are-suing-for-the-right-to-harass-election-workers/"
  },
  {
    "text": "‘Civil War’ is terrifying not for what it says about America, but about journalism  —  Around 2 p.m. on Friday, I opened my laptop and bought a ticket on Fandango for that night's showing of Civil War, the No. 1 movie in America that depicts a not-too-distant U.S. future of killing fields, refugee camps and bombed-out shopping malls.",
    "url": "https://www.inquirer.com/opinion/commentary/civil-war-movie-about-journalism-20240421.html"
  },
  {
    "text": "How Trump has become angrier and more isolated on Truth Social  —  For years, Donald Trump was among Twitter's loudest and most inescapable voices: a brash, bomb-throwing businessman turned president who could capture the global news cycle with a single tweet.",
    "url": "https://www.washingtonpost.com/politics/interactive/2024/trump-truth-social-posts/"
  },
  {
    "text": "What Donald Trump Fears Most  —  A potential reckoning that he has spent a lifetime eluding could be coming.  —  Donald Trump's biographers all seem to agree that he didn't get a lot of love from his father.  But what Fred Trump did impart to his son was an indelible lesson … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/donald-trump-manhattan-trial-fear/678144/"
  },
  {
    "text": "LIVE: Over 45 pro-divestment protesters arrested on Beinecke Plaza  —  At the intersection, organizers announced their intent to stay.  —  “We don't need Beinecke to occupy,” a protester announced.  “Let's get performances going, let's get speakers going.”",
    "url": "https://yaledailynews.com/blog/2024/04/22/live-police-begin-arresting-pro-divestment-protesters-on-beinecke-plaza/"
  },
  {
    "text": "Paying for it doesn't make it a market (permalink)  —  Anyone who says “If you're not paying for the product, you're the product” has been suckered in by Big Tech, whose cargo-cult version of markets and the discipline they impose on companies.  —  Here's the way that story goes … ",
    "url": "https://pluralistic.net/2024/04/22/kargo-kult-kaptialism/#dont-buy-it"
  },
  {
    "text": "Some migrants flown by DeSantis to Martha's Vineyard qualify for victim visas, feds say  —  Some of the 49 migrants flown to Martha's Vineyard by the state of Florida are now able to legally work in the United States and have temporary protections from deportation — because they are considered victims … ",
    "url": "https://www.miamiherald.com/news/politics-government/state-politics/article287896095.html"
  },
  {
    "text": "John Legend says Trump believes ‘to his core’ that ‘Black people are inferior’  —  Singer John Legend says former President Trump is a racist down “to his core.”  —  Speaking to MSNBC's Jen Psaki on Sunday, Legend spoke of Trump's response to the Black Lives Matter protests following the 2020 murder of George Floyd.",
    "url": "https://thehill.com/blogs/in-the-know/4611098-john-legend-trump-black-people-racist/"
  },
  {
    "text": "House Republicans blame Greene and Freedom Caucus for lack of border wins … - GOP leadership brought up border security provisions alongside their foreign aid package — but the package was blocked by Republicans from reaching the House floor under normal rules.",
    "url": "https://www.axios.com/2024/04/22/house-republicans-greene-border-security-foreign-aid"
  },
  {
    "text": "Papua New Guinea leader takes offense after Biden implies an uncle was eaten by cannibals  —  MELBOURNE, Australia (AP) — Papua New Guinea's Prime Minister James Marape accused Joe Biden of disparaging the South Pacific island nation by implying that an uncle of the U.S. president had been eaten by … ",
    "url": "https://apnews.com/article/papua-new-guinea-biden-ambrose-finnegan-marape-cannibals-9479088c4262fe6879258e5ad135238f"
  },
  {
    "text": "Ilhan Omar's daughter, Isra Hirsi, says she's homeless, cries poverty after suspension from $90K-per-year college over anti-Israel protests  —  The privileged daughter of Minnesota Rep. Ilhan Omar amazingly claims she's homeless and can't get food after being kicked out of her prestigious $90 … ",
    "url": "https://nypost.com/2024/04/22/us-news/ilhan-omars-daughter-says-shes-homeless-after-being-suspended-from-college-over-anti-israel-protests/"
  },
  {
    "text": "No Strange New Respect For Mike Johnson  —  At least not until he explains why he sacrificed thousands of lives, swaths of territory, and perhaps the future of Ukraine for nothing.  —  ∙ Paid  —  A weekend of important news has quickly overshadowed something striking that led up to it … ",
    "url": "https://www.offmessage.net/p/no-strange-new-respect-for-mike-johnson"
  },
  {
    "text": "How Biden Can Press His Ukraine Advantage  —  A great new spot from our pals at Republican Voters Against Trump is out this morning.  “I was wondering if you guys are hiring right now,” the narrator toting the hidden camera asks a sequence of mall-store managers.  “I'm currently facing 88 felonies.",
    "url": "https://www.thebulwark.com/p/how-biden-can-press-his-ukraine-advantage"
  },
  {
    "text": "The next president may be chosen by indifference  —  Those born in 1995 or after have never been able to vote in a presidential general election for any Republican besides Donald Trump.  If you were born four years after that, your choices between the two major parties have only been Trump and Joe Biden.",
    "url": "https://www.washingtonpost.com/politics/2024/04/22/voter-interest-polling-biden-trump/"
  },
  {
    "text": "Americans who want to protect democracy need to stand up for public libraries  —  Public libraries, once considered the backbone of America's civic infrastructure, are now under attack in many places across the country.  Every day, librarians are harassed, threatened and intimidated for doing … ",
    "url": "https://thehill.com/opinion/civil-rights/4610887-americans-who-want-to-protect-democracy-need-to-stand-up-for-public-libraries/"
  },
  {
    "text": "Supreme Court to decide if Biden administration can regulate ‘ghost guns’  —  The latest gun rights dispute concerns the Biden administration's effort to regulate gun-making kits the same way as commercially available firearms.  —  WASHINGTON — The Supreme Court on Monday agreed … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-decide-biden-administration-can-regulate-ghost-guns-rcna147065"
  },
  {
    "text": "Israel has yet to provide evidence of Unrwa staff terrorist links, Colonna report says  —  Exclusive: Review finds government has yet to substantiate claims UN relief agency staff have ties to Hamas or Islamic Jihad  —  Israel has yet to provide supporting evidence of its claims that employees … ",
    "url": "https://www.theguardian.com/world/2024/apr/22/israel-unrwa-staff-terrorist-links-yet-to-provide-evidence-colonna-report"
  },
  {
    "text": "In race for his Senate seat, Joe Manchin endorses West Virginia Democratic Mayor Glenn Elliott  —  Outgoing U.S. Sen. Joe Manchin endorsed the mayor of Wheeling on Monday in the Democratic primary race for his seat representing deep-red West Virginia, where Manchin is the only Democrat holding statewide office.",
    "url": "https://apnews.com/article/west-virginia-joe-manchin-glenn-elliott-8b8ad1cb4989b4dc253b7cf95932285e"
  },
  {
    "text": "Biden is marking Earth Day by announcing $7 billion in federal solar power grants  —  WASHINGTON (AP) — President Joe Biden is marking Earth Day by announcing $7 billion in federal grants for residential solar projects serving 900,000-plus households in low- and middle-income communities.",
    "url": "https://apnews.com/article/biden-earth-day-solar-grants-epa-climate-5bece7e419e9141241287575abb0fefc"
  }
]