[
  {
    "text": "Rep. Rashida Tlaib, facing censure motion, calls Hamas actions ‘war crimes’  —  U.S. Rep. Rashida Tlaib, D-Detroit, said Wednesday evening her critics are purposefully distorting her position to make it seem she is sympathetic to Hamas and its attacks on Israel, which she called “war crimes.”",
    "url": "https://www.freep.com/story/news/politics/2023/10/11/rashida-tlaib-israel-hamas-war-crimes/71148560007/"
  },
  {
    "text": "Cenk Uygur running for president as Democrat  —  The News  —  Progressive pundit Cenk Uygur will challenge President Biden for the Democratic nomination, offering himself as an alternative to an incumbent who “is definitely going to lose” if he makes it to the general election.",
    "url": "https://www.semafor.com/article/10/11/2023/cenk-uygur-running-for-president-as-democrat"
  },
  {
    "text": "Sen. Mitt Romney urged Democratic senators to challenge Biden — and he named names  —  At the Park City E2 Summit with Republican donors and influencers, the Utah senator made another plea for the anti-Trump crowd to coalesce around a single opponent to Trump",
    "url": "https://www.deseret.com/2023/10/10/23910516/mitt-romney-e2-summit-trump-israel-biden"
  },
  {
    "text": "Donald Trump Criticizes Israel PM Benjamin Netanyahu, Calls Hezbollah ‘Very Smart’  —  The former president admitted he could have been dishing classified information at a campaign event with a claim about the Israeli leader.  —  LOADING  —  Former President Donald Trump … ",
    "url": "https://www.huffpost.com/entry/donald-trump-israel-hezbollah_n_6527b1aae4b0102e6964bb29"
  },
  {
    "text": "Biden aides slam Trump for calling Hezbollah ‘very smart’  —  Aides to President Biden and his campaign blasted former President Trump on Thursday for remarks a night earlier in which Trump described Hezbollah as “very smart” amid unfolding violence in Israel.",
    "url": "https://thehill.com/homenews/campaign/4251829-biden-aides-slam-trump-for-calling-hezbollah-very-smart/"
  },
  {
    "text": "Steve Scalise's celebration on pause  —  The House GOP's hoped-for moment of unity never materialized on Wednesday.  Now it's another long slog ahead.  —  After Steve Scalise clinched House Republicans' nod for speaker on Wednesday, he did not deliver a victory speech.",
    "url": "https://www.politico.com/news/2023/10/11/scalise-moment-of-unity-on-pause-house-gop-00121049"
  },
  {
    "text": "The New Republican Establishment  —  An alternative Trumpist governing elite gets closer to ruling the party.  —  In the final account, the rise and fall of Kevin McCarthy might read like the familiar tale of a Republican congressional leader toppled by a small but uncompromising right-wing faction.",
    "url": "https://www.nytimes.com/2023/10/12/upshot/new-republican-establishment-speaker.html"
  },
  {
    "text": "Trump Lawyers Want Us to Believe Key Witness Knows Nothing  —  During his bank fraud trial in New York, Donald Trump's lawyers said ex-controller Jeff McConney wasn't an expert on real estate values—except that was his job for Trump.  —  For years, a high-ranking accountant at the Trump Organization … ",
    "url": "https://www.thedailybeast.com/trump-lawyers-want-us-to-believe-key-witness-jeff-mcconney-knows-nothing"
  },
  {
    "text": "How to Make Trump Go “Crazy,” According to George Conway  —  Former Republican George Conway said Democrats need to wage a “psychological war” against Donald Trump until it makes him so “crazy” that he violates court orders.  —  “I think you have to wage psychological war on Donald Trump … ",
    "url": "https://newrepublic.com/post/176153/make-trump-go-crazy-according-george-conway"
  },
  {
    "text": "North Carolina's cautionary tale for purple states  —  Republicans have made themselves so powerful, it doesn't matter if Dems win elections. … North Carolina Republicans are having a very good year, and now that they've locked down both the legislature and the judiciary … ",
    "url": "https://www.publicnotice.co/p/north-carolina-gop-power-grab-roy-cooper"
  },
  {
    "text": "Saudi, Iranian Leaders Hold Rare Call to Discuss Israel-Hamas War  —  Saudi Arabia's Crown Prince and de facto ruler Mohammed bin Salman discussed the war between Israel and Hamas in a call with Iran's president, the first such conversation between the two leaders who normalized relations earlier this year.",
    "url": "https://www.bloomberg.com/news/articles/2023-10-12/israel-hamas-war-saudi-crown-prince-mbs-iran-president-raisi-hold-rare-call"
  },
  {
    "text": "It's Not Me, It's You: Cornel West's Messy Breakup  —  The presidential candidate's last-minute decision to ghost the Green Party is just the latest rift within the perennially squabbling American left.  —  Cornel West thinks the Greens can't take him where he wants to go.",
    "url": "https://www.politico.com/news/magazine/2023/10/12/cornel-west-campaign-breakup-green-party-00121048"
  },
  {
    "text": "Judge Accused of Sending Wildly Inappropriate Texts During Her First Murder Trial  —  The Oklahoma judge swapped more than 500 texts about everything from a prosecutor's genitals to a “pretty” cop, an investigation found.  —  An Oklahoma judge could be booted from the bench after an investigation found … ",
    "url": "https://www.thedailybeast.com/oklahoma-judge-traci-soderstrom-busted-sending-inappropriate-texts-during-murder-trial"
  },
  {
    "text": "Trump Doral event with Eric Trump will feature a Hitler-promoting antisemite who killed someone  —  This is at least the fourth Hitler-promoting antisemite who's toured with Eric Trump  —  Trump National Doral Miami is scheduled to host a ReAwaken America tour event featuring Eric Trump … ",
    "url": "https://www.mediamatters.org/eric-trump/trump-doral-event-eric-trump-will-feature-ian-smith-hitler-promoting-antisemite-who"
  },
  {
    "text": "Kushner Says Schumer Told Mother's Friends He Was ‘Going to Jail’  —  Trump's son-in-law and former adviser said he spent millions in legal fees while facing accusations of campaign ties to Russia … Jared Kushner, the son-in-law of former President Donald Trump, says he had to calm … ",
    "url": "https://themessenger.com/politics/kushner-says-schumer-told-mothers-friends-he-was-going-to-jail"
  },
  {
    "text": "Ramaswamy Says GOP ‘Selective Moral Outrage’ on Israel Driven By Money, Lobbying Groups  —  Vivek Ramaswamy criticized Republicans for their “selective moral outrage” at the mass terrorist attacks in Israel, and argued that politicians calling for a stronger military response against Hamas and Iran are driven by donor money.",
    "url": "https://freebeacon.com/national-security/ramaswamy-says-gop-selective-moral-outrage-on-israel-driven-by-money-lobbying-groups/"
  },
  {
    "text": "Trump's anti-immigrant onslaught sparks fresh alarm heading into 2024  —  His comments have renewed concern from Latino leaders, civil rights groups and experts on extremism, particularly as Trump has established a wide lead in polls of the Republican primary",
    "url": "https://www.washingtonpost.com/elections/2023/10/12/trump-immigrants-comments-criticism/"
  },
  {
    "text": "Fetterman: America ‘not sending their best and brightest’ to Congress  —  Sen. John Fetterman said Wednesday that America “is not sending their best and brightest” to represent them in Congress.  —  “Sometimes you literally just can't believe like, these people are making the decisions that are determining the government here.",
    "url": "https://thehill.com/blogs/in-the-know/4251913-fetterman-america-not-sending-their-best-and-brightest-to-congress/"
  }
]