[
  {
    "text": "30 Days Out, the Harris and Trump Campaigns Brace for ‘Trench Warfare’  —  With tight contests in all seven battleground states, the candidates are pressing for a few thousand votes that could sway the outcome of the entire election.  —  As Vice President Kamala Harris and former President … ",
    "url": "https://www.nytimes.com/2024/10/05/us/politics/trump-harris-30-days-to-election.html"
  },
  {
    "text": "Harris is running a much bigger campaign than Trump.  Will it matter?  —  She spends three times as much, employs hundreds more staff and dominates the ad war.  But the race is effectively tied.  —  With a month to go, Donald Trump and Kamala Harris remain nearly tied in battleground polls.",
    "url": "https://www.washingtonpost.com/politics/2024/10/05/harris-trump-campaign-spending/"
  },
  {
    "text": "Scoop: VC titan Ben Horowitz plans “significant” donation to Kamala Harris … - At the time, President Biden was still running for re-election. … - He notes that he and Felicia have known Harris for more than a decade, and she's been “a great friend to both of us over that time.”",
    "url": "https://www.axios.com/2024/10/04/ben-horowitz-endorse-kamala-harris"
  },
  {
    "text": "October 4, 2024  —  MAGA Republicans are now lying about the federal response to Hurricane Helene in much the same way they lied about Haitian migrants bringing chaos and disease to Springfield, Ohio.  Both disinformation efforts are flat-out lies, and both are designed to demonize immigrants.",
    "url": "https://heathercoxrichardson.substack.com/p/october-4-2024"
  },
  {
    "text": "US officials struggle to quash Hurricane Helene conspiracy theories  —  In the wake of the devastation of Hurricane Helene in the United States this week, a new storm emerged on social media - false rumors about how disaster funds have been used, and even claims that officials control the weather.",
    "url": "https://www.reuters.com/world/us/us-officials-struggle-quash-hurricane-helene-conspiracy-theories-2024-10-05/"
  },
  {
    "text": "Immigrants Are NOT Why FEMA Lacks Funds  —  Debunking a viral NY Post story that fabricates claims about FEMA funding and immigrants to detract from Republican cruelty and incompetence  —  A viral NY Post story claims that FEMA lacks funds to support Hurricane Helene victims due to misspending on asylum seekers.",
    "url": "https://www.qasimrashid.com/p/immigrants-are-not-why-fema-lacks"
  },
  {
    "text": "As Lawmaker Claims Trump's Shooting Was Inside Job, G.O.P. Indulges Him  —  Representative Eli Crane, a first-term Arizona Republican, has emerged as the chief right-wing voice pushing conspiracy theories about the Trump assassination attempts.  —  He posits that there is a mole within … ",
    "url": "https://www.nytimes.com/2024/10/05/us/politics/as-lawmaker-claims-trumps-shooting-was-inside-job-gop-indulges-him.html"
  },
  {
    "text": "Trump's return to Butler marks a dramatically changed race  —  “There's a message here, right?  To come back to the scene,” said one Republican.  —  Donald Trump appeared to be well on his way to the White House after he was shot nearly three months ago.  He was coming off … ",
    "url": "https://www.politico.com/news/2024/10/05/trump-return-butler-shooting-00182597"
  },
  {
    "text": "Trump's Election Bid Is a Wild Card as Supreme Court Term Opens  — Court returns with cases on ‘ghost guns’, trans care on agenda  — Presidential election disputes may wind up before justices  —  The US Supreme Court opens its new term under the shadow of a presidential election … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-05/supreme-court-returns-to-ghost-guns-trans-care-and-maybe-trump-cases"
  },
  {
    "text": "Helene hit Trump strongholds in Georgia and North Carolina.  It could swing the election.  —  Officials in both swing states face urgent decisions about helping people vote in shattered communities.  —  Hurricane Helene hit especially hard in heavily Republican areas of Georgia and North Carolina … ",
    "url": "https://www.politico.com/news/2024/10/04/helene-trump-georgia-north-carolina-elections-00182448"
  },
  {
    "text": "Marco Rubio-linked thinktank produces anti-LGBTQ+ conspiracy theory videos  —  Videos voiced by Nate Hochman tout conspiracy theories about McKinsey and have elements of fascist rhetoric  —  A Marco Rubio-linked thinktank stoking fears about Haitian migrants in Pennsylvania has also produced … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/04/marco-rubio-thinktank-conspiracy-theories"
  },
  {
    "text": "Okla. is buying schools 55,000 Bibles.  Specs match the $60 Trump Bible.  —  The state put out a bid for leather-bound Bibles with U.S. founding documents.  Few, if any, such Bibles are currently for sale besides a Bible endorsed by Trump.  —  The state of Oklahoma wants to buy 55,000 classroom Bibles … ",
    "url": "https://www.washingtonpost.com/education/2024/10/04/oklahoma-schools-trump-bible/"
  },
  {
    "text": "From the Willard to Danbury Correctional: Steve Bannon Allegedly Joins the Conspiracy  —  One of Danbury's Federal Correctional Institution's most illustrious residents likely discovered on Wednesday that he had been promoted.  —  Steve Bannon is now P1, a feature player in Jack Smith's latest description … ",
    "url": "https://www.emptywheel.net/2024/10/04/from-the-willard-to-danbury-correctional-steve-bannon-allegedly-joins-the-conspiracy/"
  },
  {
    "text": "Trump pledges to rename Army base after Confederate general  —  Fort Liberty, previously known as Fort Bragg, was renamed in 2022 as part of a sweeping Army push to change the names of installations honoring Confederate soldiers.  —  Donald Trump says that North Carolina's Fort Liberty … ",
    "url": "https://www.politico.com/news/2024/10/04/trump-rename-army-confederate-general-00182606"
  },
  {
    "text": "Entire Chicago Education Board to Resign Amid Tensions Between Mayor and Schools Chief  —  Mayor Brandon Johnson has been at odds with the head of Chicago Public Schools over his plan to fill a $1 billion gap in the district's budget.  —  All of Chicago's board of education members announced … ",
    "url": "https://www.nytimes.com/2024/10/04/us/chicago-education-board-resignations.html"
  },
  {
    "text": "Letter to Congress on Disaster Needs  —  Dear Speaker Johnson and Leaders Schumer, McConnell, and Jeffries,  —  I write to you regarding the needs of the Nation.  As communities across the Southeast devastated by Hurricane Helene assess the extent of the damage, they are expecting … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/10/04/letter-to-congress-on-disaster-needs/"
  },
  {
    "text": "Exclusive: Conservative think tank targeting NASA employees' communications about Musk, Trump  —  An influential conservative think tank has asked the National Aeronautics and Space Administration to disclose what employees are discussing internally about billionaire Elon Musk … ",
    "url": "https://www.reuters.com/world/us/conservative-think-tank-targeting-nasa-employees-communications-about-musk-trump-2024-10-04/"
  },
  {
    "text": "Some of Our Top Schools Are Embarrassing Themselves Over Covid  —  Why are places like Stanford and Johns Hopkins hosting gatherings of well-known coronavirus cranks?  —  Pocket  —  Today, Stanford University is holding an all-day gathering on the Covid pandemic, with its new president making opening remarks.",
    "url": "https://www.thenation.com/article/society/stanford-covid-symposium-misinformation/"
  },
  {
    "text": "Conservatives look to end — or replace — Miami teachers union  —  A historic vote in Miami-Dade could result in no teachers union at all in the county — or one backed by an enemy of organized labor.  —  TALLAHASSEE, Florida — Florida Republicans could strike a major blow … ",
    "url": "https://www.politico.com/news/2024/10/04/conservatives-look-end-replace-miami-teachers-union-00182246"
  },
  {
    "text": "Michele Fiore convicted by jury in wire fraud case  —  LAS VEGAS (KLAS) — A jury convicted Pahrump Justice of the Peace Michele Fiore on all counts in a federal wire fraud case on Thursday.  —  Fiore, currently suspended from her Pahrump duties, was charged with one count of conspiracy … ",
    "url": "https://www.8newsnow.com/investigators/michele-fiore-convicted-by-jury-in-wire-fraud-case/"
  },
  {
    "text": "Harris joined ‘Call Her Daddy’ podcast to talk abortion rights  —  Vice President Harris joined host Alex Cooper on her popular “Call Her Daddy” podcast for a discussion on reproductive rights, the campaign told The Hill.  —  She sat Tuesday for the popular podcast among young, female listeners … ",
    "url": "https://thehill.com/homenews/campaign/4917021-harris-call-her-daddy-podcast/"
  },
  {
    "text": "The ‘News Avoiders’ who could decide 2024  —  TUNED OUT — If you are reading this edition of Nightly, you are probably not a News Avoider.  —  And yes, News Avoiders are a thing.  —  Even during a wild, close presidential election where unknown numbers of Americans are compulsively checking … ",
    "url": "https://www.politico.com/newsletters/politico-nightly/2024/10/03/the-news-avoiders-who-could-decide-2024-00182446"
  },
  {
    "text": "Minnesota GOP Senate candidate: ‘The bad guys won in WWII’  —  As the control of the Senate hangs in the balance, GOP candidates across the country are facing a similar problem: Troubling and bizarre past statements, both in-person and on social media, are coming back to haunt them.",
    "url": "https://heartlandsignal.com/2024/10/04/minnesota-gop-senate-candidate-the-bad-guys-won-in-wwii/"
  }
]