[
  {
    "text": "NY vehicle explosion at Rainbow Bridge border crossing, two dead  —  The FBI is investigating a vehicle explosion that occurred Wednesday at the Rainbow Bridge border crossing between the U.S. and Canada.  —  The vehicle was heading from the U.S. to Canada and was going in the direction … ",
    "url": "https://www.foxnews.com/us/ny-vehicle-explosion-reported-rainbow-bridge-niagara-falls-injured"
  },
  {
    "text": "Rainbow Bridge in Niagara Falls closed after explosion of vehicle reportedly entering U.S. from Canada  —  “I've been briefed on the incident on the Rainbow Bridge in Niagara Falls and we are closely monitoring the situation.”  Gov. Kathy Hochul said.  —  The FBI is investigating … ",
    "url": "https://www.nbcnews.com/news/us-news/rainbow-bridge-niagara-falls-closed-explosion-vehicle-reportedly-enter-rcna126397"
  },
  {
    "text": "The Head of Ron DeSantis's Never Back Down Super PAC Resigns  —  Chris Jankowski, the chief executive of the Never Back Down super PAC, stepped down as internal disputes among supporters of Ron DeSantis intensified.  —  Chris Jankowski, the chief executive of Never Back Down … ",
    "url": "https://www.nytimes.com/2023/11/22/us/politics/desantis-pac-chris-jankowski.html"
  },
  {
    "text": "CEO of pro-DeSantis super PAC resigns amid rising tensions  —  The CEO of Never Back Down, the primary super PAC supporting Ron DeSantis's presidential bid, resigned on Wednesday amid increasingly public tensions over strategy that spilled out anew after close DeSantis allies created a new outside group to run ads.",
    "url": "https://www.washingtonpost.com/politics/2023/11/22/ron-desantis-super-pac-never-back-down/"
  },
  {
    "text": "Top Netanyahu aide announces delay in hostage releases, which won't start until Friday  —  In a surprise delay, National Security Council chairman Tzachi Hanegbi announces that the first hostages will not be released until Friday.  —  Senior Hamas official Moussa Abu Marzouk said earlier today … ",
    "url": "https://www.timesofisrael.com/liveblog_entry/in-apparent-delay-top-netanyahu-aide-announces-hostage-releases-wont-start-until-friday/"
  },
  {
    "text": "Plying Voters With Free Food, Ramaswamy Struggles to Win Them Over  —  The political newcomer's surge over the summer has fizzled.  But Vivek Ramaswamy is still spending freely to keep up a breakneck pace in Iowa and New Hampshire.  —  While many people were heading home for the Thanksgiving holiday … ",
    "url": "https://www.nytimes.com/2023/11/22/us/politics/vivek-ramaswamy-iowa.html"
  },
  {
    "text": "Witnesses saw smoke, fire from vehicle at Rainbow Bridge  —  The Rainbow Bridge has been closed to all traffic amid reports of a vehicle explosion just outside the border inspections plaza on the American side.  —  Traveling down Niagara Street, the car sped onto the bridge plaza … ",
    "url": "https://www.niagara-gazette.com/news/local_news/update-witnesses-saw-smoke-fire-from-vehicle-at-rainbow-bridge/article_eb3ffec8-8957-11ee-93e5-cf9e52289455.html"
  },
  {
    "text": "Ohio Walmart shooter may have been inspired by racist ideology, FBI says  —  The 20-year-old gunman wounded four people in the shooting in Beavercreek on Monday and then shot himself, police said.  —  The gunman who opened fire at Ohio Walmart this week, injuring four people … ",
    "url": "https://www.nbcnews.com/news/us-news/ohio-walmart-shooter-may-inspired-racist-ideology-fbi-says-rcna126449"
  },
  {
    "text": "Democrats can't quit Elon Musk's X  —  X is becoming more toxic for liberals.  But they're still posting — and it's not clear where they'd go next.  —  For politicians, it turns out an addictive social media platform is hard to quit, in spite of any moral qualms they might have about its owner.",
    "url": "https://www.politico.com/news/2023/11/22/democrats-cant-quit-elon-x-00128504"
  },
  {
    "text": "Have You Listened Lately to What Trump Is Saying?  —  He is becoming frighteningly clear about what he wants.  —  In 2019, Kennedy Ndahiro, the editor of the Rwandan daily newspaper The New Times, explained to readers of The Atlantic how years of cultivated had hatred led to death on a horrifying scale.",
    "url": "https://www.theatlantic.com/ideas/archive/2023/11/trump-becoming-frighteningly-clear-about-what-he-wants/676086/"
  },
  {
    "text": "Vermont discriminated against Christian school over transgender athlete rules: Lawsuit  —  A Christian school in Vermont has filed a lawsuit against the state's education agency after the school was banned from participating in intercollegiate sports for refusing to play a game against a girl's basketball team with a trans girl on it.",
    "url": "https://www.washingtonexaminer.com/policy/education/christian-school-banned-sports-competitions-refusing-transgender"
  },
  {
    "text": "‘You should be assassinated’: Officials flag ‘credible’ threats against Trump fraud judge  —  Judge Arthur Engoron, the New York jurist overseeing former President Donald Trump's fraud trial, has been targeted by a series of “credible” death threats, reported Frank Runyeon of Law360.",
    "url": "https://www.rawstory.com/trump-fraud-trial-threats/"
  },
  {
    "text": "GOP official's wife convicted in months-long 2020 voter-fraud scheme  —  As Tam and Thien Doan tried to file for absentee ballots in Iowa in 2020, they were surprised to find out that votes had already been cast in their names.  The siblings, both Democrats, were even more astonished to learn … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/22/iowa-voter-fraud-wife-husband-republican/"
  },
  {
    "text": "The Red State Brain Drain Isn't Coming.  It's Happening Right Now.  —  On Memorial Day weekend in 2022, Kate Arnold and her wife, Caroline Flint, flew from Oklahoma City to Cabo San Lucas for a little R&R. They had five kids, the youngest of them five-year-old twin girls, and demanding jobs as obstetrician-gynecologists.",
    "url": "https://newrepublic.com/article/176854/republican-red-states-brain-drain"
  },
  {
    "text": "Democrats who swept Moms For Liberty off school board fight superintendent's $700,000 exit deal  —  A Pennsylvania school board that banned books, Pride flags and transgender athletes slipped a last-minute item into their final meeting before leaving office, hastily awarding a $700,000 exit package … ",
    "url": "https://apnews.com/article/moms-for-liberty-pennsylvania-superintendent-fdd5dcecd0c8649bc73c09c76c769f17"
  },
  {
    "text": "Cogswell claims victory in Charleston mayor race  —  Charleston will have a new mayor.  —  William Cogswell won in a nail-biter runoff election on Nov. 21, delivering a stunning defeat to incumbent Mayor John Tecklenburg after a hard-fought campaign.  —  Cogswell declared victory shortly … ",
    "url": "https://www.postandcourier.com/news/cogswell-declares-victory-in-charleston-mayor-race-with-most-precincts-reporting/article_7dc0dc3a-87dd-11ee-aef6-535d4278cded.html"
  },
  {
    "text": "Johnson Learns on the Job, Drawing the Ire of the Republican Right  —  The new House speaker is facing complaints from his members that his leadership is no different from his predecessor's.  His style, however, is in stark contrast.  —  Speaker Mike Johnson struggled to defend himself … ",
    "url": "https://www.nytimes.com/2023/11/22/us/politics/mike-johnson-republicans.html"
  },
  {
    "text": "Donor allegedly offered $20M to recruit a Tlaib primary challenger  —  The lucrative proposal to Democratic Michigan Senate candidate Hill Harper arrived on Oct. 16, according to a source with direct knowledge — and got rejected.  —  A Michigan businessman called Democratic Senate candidate Hill Harper … ",
    "url": "https://www.politico.com/news/2023/11/22/donor-20-million-tlaib-primary-00128443"
  },
  {
    "text": "US Lawmakers Ask SEC to Launch Fraud Investigation Into Elon Musk  —  A letter members of Congress sent to the SEC claims Musk misled Neuralink investors in a post on X about the fate of monkeys used to test a brain-chip interface.  —  Federal regulators are being pushed … ",
    "url": "https://www.wired.com/story/elon-musk-nerualink-congress-sec-letter/"
  }
]