[
  {
    "text": "Syrian opposition activists say insurgents have reached the suburbs of Damascus  —  Insurgents' stunning march across Syria gained speed on Saturday with news that they had reached the suburbs of the capital and the government forced to deny rumors that President Bashar Assad had fled the country.",
    "url": "https://apnews.com/article/syria-assad-sweida-daraa-homs-hts-qatar-7f65823bbf0a7bd331109e8dff419430"
  },
  {
    "text": "Trump hesitates to personally lobby for endangered Cabinet picks  —  The president-elect is not yet personally pushing hard for his selections, limiting his exposure if they withdraw or fail to win confirmation.  —  President-elect Donald Trump, a lifelong teetotaler whose brother struggled … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/07/trump-hegseth-cabinet-picks/"
  },
  {
    "text": "What Republicans and Democrats Get Wrong About Crime  —  Americans are understandably concerned about crime.  Before the 2024 election, voters consistently ranked it among their top priorities.  At least two states rolled back reforms this year, and prison populations in many states … ",
    "url": "https://www.nytimes.com/2024/12/07/opinion/crime-prison-police-republicans-democrats.html?unlocked_article_code=1.fk4.dVnK.zcWrlFPy5XFo&smid=url-share"
  },
  {
    "text": "Supreme Court term-limits amendment proposed by Sens. Manchin, Welch  —  The long-shot proposal by Sen. Peter Welch (D-Vermont) and outgoing Sen. Joe Manchin III (I-West Virginia) would impose 18-year term limits on new justices.  —  Two senators have introduced a constitutional amendment … ",
    "url": "https://www.washingtonpost.com/politics/2024/12/07/supreme-court-term-limits-amendment-manchin-welch/"
  },
  {
    "text": "Trump isn't back in office but he's already pushing his agenda and negotiating with world leaders  —  He's making threats, traveling abroad and negotiating with world leaders.  Donald Trump has more than a month and a half to go before he's sworn in for a second term.",
    "url": "https://apnews.com/article/trump-transition-trade-foreign-leader-meetings-biden-c795cbb38b6b943c19a70fe046cad7d5"
  },
  {
    "text": "How Trump's transition could end up hamstringing his agenda  —  The president-elect's advisers haven't yet begun meeting with federal agencies, despite signing an agreement late last month allowing them to do so.  —  President-elect Donald Trump's transition team still has not sent policy advisers … ",
    "url": "https://www.politico.com/news/2024/12/07/trump-transition-team-delays-00193119"
  },
  {
    "text": "South Korean President Yoon's impeachment vote fails after ruling party boycotts it  —  A South Korean legislative push to impeach President Yoon Suk Yeol over his short-lived imposition of martial law fell through on Saturday after most lawmakers from his conservative governing party boycotted the vote.",
    "url": "https://apnews.com/article/south-korea-politics-yoon-martial-law-impeachment-3f2a9190bf5cec83b49e2c6ad5cf5379"
  },
  {
    "text": "Far-right activists from Germany spent US election day at Trump's Mar-a-Lago  —  AfD parliamentary candidate and influencers posed for photos with now president-elect at his Florida home  —  As Donald Trump gathered his supporters, family and friends at Mar-a-Lago on US election day last month … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/07/far-right-activists-from-germany-spent-us-election-day-at-trumps-mar-a-lago"
  },
  {
    "text": "Now Is the Time for Courage  —  One month after the election of Donald Trump I feel more certain about who he is and what he aims to achieve but less certain about who stands in opposition to him.  Trump is an aspiring dictator who aims to aggregate his power to reward his friends and punish his enemies.",
    "url": "https://www.democracydocket.com/opinion/now-is-the-time-for-courage/"
  },
  {
    "text": "Welcome to the New Dark Ages  —  If Trump has his way, the next four years will be far worse than even the Gilded Age  —  Donald Trump has moved at warp speed to nominate people to serve in his Cabinet and other important government posts who have chosen loyalty to him as their most important virtue … ",
    "url": "https://www.salon.com/2024/12/07/welcome-to-the-new-dark-ages/"
  },
  {
    "text": "How RFK Jr. can win over a skeptical medical community  —  Despite the skepticism and outrage over Robert F. Kennedy Jr.'s nomination to head the Department of Health and Human Services, there is a lot that he can do to reassure doubters in the medical community.",
    "url": "https://thehill.com/opinion/healthcare/5026624-rfk-jr-health-agency-nomination/"
  },
  {
    "text": "Trump Still Faces 8 Civil Lawsuits Over the Jan. 6 Attack  —  Donald J. Trump has successfully defeated or impeded many legal challenges against him over the storming of the Capitol, but eight lawsuits on the matter remain in the courts.  —  There have been many efforts, over nearly four years … ",
    "url": "https://www.nytimes.com/2024/12/06/us/politics/trump-jan-6-civil-cases.html"
  },
  {
    "text": "US alleges China hacked calls of ‘very senior’ political figures, official says  —  The U.S. believes that an alleged sweeping Chinese cyber espionage campaign known as Salt Typhoon targeted and recorded telephone calls of “very senior” American political figures, a White House official said on Saturday.",
    "url": "https://www.reuters.com/world/us-alleges-china-hacked-calls-very-senior-political-figures-official-says-2024-12-07/"
  },
  {
    "text": "Hegseth and Collins' push for cutting veterans health benefits alarms servicemembers and veterans groups  —  “Get Pete Hegseth on the phone!”  —  It was March 2018, and then-President Donald Trump was meeting with his Department of Veterans Affairs Secretary, Dr. David Shulkin, about how to reform veteran health care.",
    "url": "https://www.cnn.com/2024/12/07/politics/pete-hegseth-doug-collins-veterans-health-care/"
  },
  {
    "text": "How Alarmed Harris Staffers Went Rogue to Reach Black and Latino Voters  —  Worried that the campaign was neglecting voters of color in Philadelphia and other battleground cities, organizers secretly gathered at a Dunkin' Donuts and elsewhere to get out the vote.",
    "url": "https://www.nytimes.com/2024/12/07/us/politics/harris-philadelphia-black-latino-voters.html"
  },
  {
    "text": "'It's like Game of Thrones': Inside the jockeying for Trump administration jobs  —  Trump has moved quickly to identify top officials for his next administration, but it hasn't all gone smoothly.  —  President-elect Donald Trump is building his second administration at a breakneck speed … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/jockeying-trump-administration-jobs-rcna182901"
  },
  {
    "text": "Revealed: the tech bosses who poured $394.1m into US election - and how they compared to Elon Musk  —  FEC filings offer only a glimpse of the money tech is pouring into Washington as it seeks to influence government  —  Silicon Valley poured more than $394.1m into the US presidential election this year … ",
    "url": "https://www.theguardian.com/us-news/2024/dec/07/campaign-spending-crypto-tech-influence"
  },
  {
    "text": "The Musk Rat  —  The New York Times reported this morning that the world's richest man, Elon Musk, who owns Tesla, Space X and Twitter, spent a whopping $250 million to help elect Donald Trump.  —  He did this primarily through his America PAC, which spent $239 million in cash and in-kind contributions.",
    "url": "https://statuskuo.substack.com/p/the-musk-rat"
  },
  {
    "text": "Harris raised and spent twice as much as Trump in final days of 2024 election  —  WASHINGTON - Some Democrats are questioning how Kamala Harris' presidential campaign spent more than $1 billion but nonetheless lost to Donald Trump - and now they have more fodder as they continue with their post-election autopsies.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/12/06/harris-trump-final-campaign-spending-report/76460913007/"
  }
]