[
  {
    "text": "Ron who?  How Trump allies brought Hegseth back from the brink  —  Skeptical Republican senators were singing a different tune on Monday.  —  Donald Trump's transition team entered a critical week of nomination meetings on Capitol Hill with a new head of steam, emboldened by a swarm … ",
    "url": "https://www.politico.com/news/2024/12/10/trump-hegseth-controversial-nominee-playbook-00193349"
  },
  {
    "text": "GOP senators feel weight of Trump's loyalty test on nominees  —  Weeks before even taking office, President-elect Trump is already sorely testing the loyalty of Republican senators by pushing an array of controversial nominees to key positions, putting enormous pressure on GOP senators.",
    "url": "https://thehill.com/homenews/senate/5031601-trump-nominees-senate-test/"
  },
  {
    "text": "12/10/24 ☀️ AM:  —  Missing: House Republican women chairing committees … Buoyed by continued support from President-elect Donald Trump, the crisis atmosphere enveloping Hegseth's nomination has cooled somewhat, although the former Army National Guard officer and Fox News host … ",
    "url": "https://punchbowl.news/archive/121024-am/"
  },
  {
    "text": "Nobel Laureates Urge Senate to Turn Down Kennedy's Nomination  —  Elevating Mr. Kennedy to secretary of H.H.S. “would put the public's health in jeopardy,” more than 75 laureates wrote.  —  More than 75 Nobel Prize winners have signed a letter urging senators not to confirm Robert F. Kennedy Jr. … ",
    "url": "https://www.nytimes.com/2024/12/09/health/kennedy-hhs-nobel-laureates.html?unlocked_article_code=1.gE4.oGBh.LR5JFpV5S1fn&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "More than 75 Nobel laureates urge Senate to reject RFK Jr.  —  Seventy-seven Nobel laureates signed a letter urging the Senate to oppose the confirmation of Robert F. Kennedy Jr. to lead the Department of Health and Human Services (HHS), The New York Times reported Monday.",
    "url": "https://thehill.com/policy/healthcare/5031298-nobel-laureates-oppose-rfk-jr/"
  },
  {
    "text": "Rupert Murdoch Fails in Bid to Change Family Trust  —  A Nevada commissioner ruled resoundingly against Mr. Murdoch, who was trying to give full control of his empire to his son Lachlan and lock in Fox News's right-wing editorial slant.  —  A Nevada commissioner ruled resoundingly … ",
    "url": "https://www.nytimes.com/2024/12/09/business/media/rupert-lachlan-murdoch-family-trust.html?unlocked_article_code=1.gE4.iOYP.Rq-9tE_M2nfz&smid=url-share"
  },
  {
    "text": "Person of interest in fatal shooting of UnitedHealthcare CEO Brian Thompson ID'd as Luigi Mangione, an ex-Ivy League student  —  The person of interest identified in the killing of UnitedHealthcare CEO Brian Thompson is an anti-capitalist former Ivy League student — who liked online quotes from … ",
    "url": "https://nypost.com/2024/12/09/us-news/person-of-interest-in-fatal-shooting-of-unitedhealthcare-boss-brian-thompson-idd-as-luigi-mangione-an-ex-ivy-league-student/"
  },
  {
    "text": "Top ‘Washington Post’ editor kills article on deputy's departure  —  As the Washington Post newsroom awaits the appointment of a new top editor, its acting news chief intervened to block an article about the departure of its second-highest-ranking editor, a contender for the position … ",
    "url": "https://www.npr.org/2024/12/09/nx-s1-5222807/washington-post-editor-kills-article-times-bezos"
  },
  {
    "text": "Matt Gaetz to join One America News as an anchor, source says  —  Former Florida congressman Matt Gaetz is expected to announce he is joining One America News Network (OAN) as an anchor, a source familiar told CNN.  —  Last month, Gaetz withdrew his name from consideration to serve … ",
    "url": "https://www.cnn.com/2024/12/09/media/matt-gaetz-one-america-news-anchor/"
  },
  {
    "text": "Patel FBI plans spark concern over agency independence, retribution  —  Kash Patel, President-elect Trump's nominee to lead the FBI, has promised to deliver a massive reform of a bureau he sees as among the agencies that have “weaponized the government.”  —  Patel hasn't offered specifics … ",
    "url": "https://thehill.com/homenews/5030794-trump-kash-patel-fbi-reform-independence/"
  },
  {
    "text": "Criminal Charges Unsealed Against Two Former High-Ranking Syrian Government Intelligence Officials for War Crimes against Americans and Other Civilians  —  For Immediate Release  —  A copy of the indictment can be found here.  —  An indictment was unsealed today in the Northern District … ",
    "url": "https://www.justice.gov/opa/pr/criminal-charges-unsealed-against-two-former-high-ranking-syrian-government-intelligence"
  },
  {
    "text": "Trump talks ACA, abortion pills on ‘Meet the Press’  —  Health Care  —  Trump talks health care on ‘Meet the Press’  —  President-elect Trump had his first sit-down broadcast interview since he was reelected last month.  —  During the interview on NBC's “Meet the Press” Sunday night … ",
    "url": "https://thehill.com/newsletters/5031560-trump-talks-aca-abortion-pills-on-meet-the-press/"
  },
  {
    "text": "GOP Congresswoman Nancy Mace is caught on video in gross act with two women and a man  —  Her crusade against transgender bathroom access has cemented her role as a hardline culture warrior and MAGA favorite.  —  But an eye-popping video unearthed exclusively by DailyMail.com suggests … ",
    "url": "https://www.dailymail.co.uk/news/article-14152809/Nancy-Mace-caught-gross-video-two-women-man.html"
  },
  {
    "text": "Federal court blocks ACA coverage for Dreamers  —  A federal court in North Dakota has blocked Affordable Care Act (ACA) coverage for immigrants that came into the U.S. illegally as children, also known as “Dreamers.”  —  U.S. District Judge Daniel M. Traynor on Monday granted Kansas … ",
    "url": "https://thehill.com/policy/healthcare/5031527-federal-court-blocks-aca-coverage-for-dreamers/"
  },
  {
    "text": "Biden pardoned his son for good reason  —  Even if he's being coy about it. … ☃️  —  President Biden has taken a lot of heat from both Republicans and Democrats over the pardon of his sole surviving son, Hunter.  On the surface, the criticism is valid.",
    "url": "https://www.publicnotice.co/p/joe-biden-hunter-biden-pardon-kash-patel"
  },
  {
    "text": "Acrimonious Texas House Speaker race divides state's Republicans  —  An acrimonious race for Speaker of the Texas House is splitting the state GOP — and forcing a confrontation between the body's warring Republican camps.  —  Competing Republican state Reps. David Cook and Dustin Burrows … ",
    "url": "https://thehill.com/homenews/state-watch/5030621-texas-house-speaker-race-republican-divisions/"
  },
  {
    "text": "On Issue After Issue, Trump Promises the Moon.  No Word on the Rocket.  —  The president-elect has made some of the most expansive campaign pledges in history.  Some supporters fear that his bravado could undermine his ambitions.  —  In his own telling, President-elect Donald J. Trump wields magical powers … ",
    "url": "https://www.nytimes.com/2024/12/10/us/politics/trump-promises.html"
  },
  {
    "text": "Playbook PM: A Jan. 6 insider on the transition team?  —  ON THE WAY OUT THE DOOR — Interesting parting gesture from Sen. JOE MANCHIN (I-W.Va.): “I'm proud to introduce legislation with @SenPeterWelch that would establish 18-year term limits for Justices of the United States Supreme Court.”",
    "url": "https://www.politico.com/newsletters/playbook-pm/2024/12/09/a-jan-6-insider-on-the-transition-team-00132333"
  },
  {
    "text": "Republican-led states are rolling out plans that could aid Trump's mass deportation effort  —  As President-elect Donald Trump assembles his administration, Republican governors and lawmakers in some states are already rolling out proposals that could help him carry out his pledge to deport millions … ",
    "url": "https://apnews.com/article/trump-immigration-deportation-republican-states-da5c2465b9d4476176c09d87d6c00aed"
  },
  {
    "text": "Trump's Perfume Line Hits the Market With Jill Biden Photo  —  Donald J. Trump learned a long time ago that photo opportunities could get him attention and that slapping his name on everything from skyscrapers to steaks could make him money.  —  As a second-time presidential candidate … ",
    "url": "https://www.nytimes.com/2024/12/09/us/politics/trump-perfumes-sneakers-licensing.html"
  },
  {
    "text": "Trump Spoke to DeSantis About Choosing Lara Trump for Florida Senate Seat  —  Florida governor will decide who succeeds Sen. Marco Rubio and is considering a range of candidates  —  Lara Trump wants to be the next U.S. senator from Florida, and she has a powerful advocate in her corner: her father-in-law.",
    "url": "https://www.wsj.com/politics/policy/trump-spoke-to-desantis-about-choosing-lara-trump-for-florida-senate-seat-42b37fe6"
  },
  {
    "text": "Daniel Penny acquitted in subway chokehold death of Jordan Neely  —  A Manhattan jury has cleared Daniel Penny of criminal wrongdoing in the chokehold death of Jordan Neely on a crowded subway — a caught-on-video killing that sparked fierce debate over the city's mental health system and crime underground.",
    "url": "https://nypost.com/2024/12/09/us-news/daniel-penny-cleared-of-all-charges-in-jordan-neelys-death/"
  },
  {
    "text": "Kari Lake a top contender to become Trump's ambassador to Mexico  —  The Scoop  —  Kari Lake is a leading contender for the nomination as Donald Trump's ambassador to Mexico, two people familiar with the situation told Semafor.  —  Lake won Trump's endorsement in both her unsuccessful bids for statewide office in Arizona.",
    "url": "https://www.semafor.com/article/12/09/2024/kari-lake-a-top-contender-to-become-trumps-ambassador-to-mexico"
  },
  {
    "text": "Money in Your Pockets: Governor Hochul Proposes Sending 8.6 Million New Yorkers an Inflation Refund Check as First Proposal of 2025 State of the State  —  Proposal Would Deliver $3 Billion by Taking Excess Sales Tax Revenue Driven by Inflation and Giving That Money Back to Everyday New Yorkers",
    "url": "https://www.governor.ny.gov/news/money-your-pockets-governor-hochul-proposes-sending-86-million-new-yorkers-inflation-refund"
  },
  {
    "text": "What to look for in Supreme Court arguments over environmental regulation of Utah oil railway plan  —  A proposed western railroad expansion aimed at boosting crude oil production in Utah is coming before the Supreme Court Tuesday in a case that could have wider impact on federal environmental regulation.",
    "url": "https://apnews.com/article/supreme-court-environment-regulation-recuse-gorsuch-utah-16cff708f7549ff430823213eeaa22f6"
  }
]