[
  {
    "text": "Appeals Court Denies Another Trump Attempt to Delay Trial  —  Donald J. Trump's lawyers sought to pause his Manhattan criminal trial as they argued that it should be moved, but a judge rejected their appeal.  —  One week before Donald J. Trump is set to go on trial for criminal charges in Manhattan … ",
    "url": "https://www.nytimes.com/2024/04/08/nyregion/trump-hush-money-trial-delay.html"
  },
  {
    "text": "Donald Trump asks appeals court to intervene in last-minute bid to delay hush-money criminal case  —  NEW YORK (AP) — Donald Trump asked a New York appeals court on Monday to reverse his gag order and move his hush-money criminal trial out of Manhattan in an eleventh-hour bid for a delay just a week before it is scheduled to start.",
    "url": "https://apnews.com/article/donald-trump-juan-merchan-hush-money-appeal-lawsuit-6abe221a7cb2ea670eb3ed1a7a134643"
  },
  {
    "text": "N.Y. appeals judge rejects Trump's attempt to delay hush money trial  —  NEW YORK — A New York appeals court judge Monday rejected Donald Trump's attempt to delay the hush money trial scheduled to begin April 15 while he pursued an appeal to determine whether a change of venue is necessary outside Manhattan … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/08/trump-new-york-gag-order/"
  },
  {
    "text": "Graham says Trump is making ‘a mistake’ on abortion, vows to push forward with nationwide restrictions  —  The South Carolina Republican said the GOP presidential nominee is wrong to say the issue should be left to states, pressing his case that there should be some federal limits.",
    "url": "https://www.nbcnews.com/politics/donald-trump/lindsey-graham-says-donald-trump-making-mistake-abortion-vows-push-for-rcna146934"
  },
  {
    "text": "Elon Musk Didn't Want His Latest Deposition Released.  Here It Is.  —  Musk is being sued for falsely suggesting a 22-year-old Jewish man was part of a neo-Nazi brawl.  —  Elon Musk was deposed last month over his role in allegedly promoting a false conspiracy theory that a 22-year-old Jewish man participated in a neo-Nazi brawl.",
    "url": "https://www.huffpost.com/entry/elon-musk-didnt-want-his-latest-deposition-released-here-it-is_n_66133d2ce4b0d81853f9a766"
  },
  {
    "text": "‘Profoundly ahistorical’: 4-star generals side with Jack Smith, tell Supreme Court Trump's immunity claims are ‘assault’ on democracy  —  A distinguished group of retired four-star generals and admirals from the U.S. military have argued in a brief filed in the U.S. Supreme Court on Monday … ",
    "url": "https://lawandcrime.com/high-profile/profoundly-ahistorical-4-star-generals-side-with-jack-smith-tell-supreme-court-trumps-immunity-claims-are-assault-on-democracy/"
  },
  {
    "text": "Sonia Sotomayor's retirement is a political IQ test  —  Are you into politics to win — or to feel good about yourself?  —  Sonia Sotomayor, one of the three remaining liberal Supreme Court justices, will turn 70 years old in June, is diabetic and had one parent who died at a young age.",
    "url": "https://www.natesilver.net/p/sonia-sotomayors-retirement-is-a"
  },
  {
    "text": "Las Vegas attorney kills 2, self in Summerlin law office shooting: sources  —  LAS VEGAS (KLAS) — Three people are dead following a shooting Monday morning in a law office in a building near the Red Rock resort in Summerlin, according to Las Vegas Metropolitan Police Department Sheriff Kevin McMahill.",
    "url": "https://www.8newsnow.com/news/local-news/shooting-at-las-vegas-office-building-in-summerlin/"
  },
  {
    "text": "‘Donald Trump did this’: New Biden abortion ad features a woman who says she almost died because of the Texas ban  —  The ad was released hours after Trump said that he believes abortion laws should be left to the states, sidestepping the national ban that some of his supporters want.",
    "url": "https://www.nbcnews.com/politics/2024-election/donald-trump-new-biden-abortion-ad-features-woman-says-almost-died-tex-rcna146869"
  },
  {
    "text": "“It's Been Soiled”: Trump Bizarrely Suggests Biden Has S—t on Oval Office Desk at Billionaire Fundraiser  —  He also pledged to keep attendees' taxes low and doubled down on his desire to have immigrants from “nice” countries, like Norway and Denmark, come to the US.",
    "url": "https://www.vanityfair.com/news/donald-trump-bizarrely-suggests-biden-has-s-t-on-oval-office-desk"
  },
  {
    "text": "Men punching random women in NYC: A desperate last gasp of the male rage fueling MAGA  —  Random NYC attacks are an extreme manifestation of men feeling entitled to women's time and attention  —  Men are punching random women on the streets of New York City.",
    "url": "https://www.salon.com/2024/04/08/men-punching-random-women-in-nyc-a-desperate-last-gasp-of-the-male-rage-fueling-maga/"
  },
  {
    "text": "RFK Jr.'s New York state director says her ‘No. 1 priority’ is preventing a Biden victory  —  A New York-based campaign official for Robert F. Kennedy Jr. is pitching Republican voters to support his independent presidential bid by arguing that Kennedy will help Donald Trump defeat Joe Biden if he's on the ballot in New York.",
    "url": "https://www.cnn.com/2024/04/08/politics/rfk-jr-new-york-biden-trump/"
  },
  {
    "text": "Mitch McConnell backs House TikTok bill that could lead to ban  —  Washington — Senate Minority Leader Mitch McConnell on Monday endorsed a bill that could lead to a ban of TikTok in the U.S. after its momentum slowed in the Senate following its whirlwind passage in the House last month.",
    "url": "https://www.cbsnews.com/news/mcconnell-tiktok-ban-senate-house-bill/"
  },
  {
    "text": "Tesla settles with Apple engineer's family who said Autopilot caused his fatal crash  —  New York CNN  —  Tesla has settled a high-profile case that was set to put the electric car company and its controversial automated-driving system on trial starting Monday.  —  Terms of the settlement were not disclosed.",
    "url": "https://www.cnn.com/2024/04/08/tech/tesla-trial-wrongful-death-walter-huang"
  },
  {
    "text": "GOP Senate hopeful suggests nursing home residents are too close to death to vote  —  Wisconsin Republican Senate candidate Eric Hovde expressed doubts about the 2020 election results by arguing nursing home residents are too close to death to vote, newly released audio shows.",
    "url": "https://www.rawstory.com/eric-hovde-2667717417/"
  },
  {
    "text": "Elizabeth Warren says she believes Israel's war in Gaza will legally be considered a genocide  —  “If you want to do it as an application of law, I believe that they'll find that it is genocide, and they have ample evidence to do so,” Warren said of the case before the ICJ.",
    "url": "https://www.politico.com/news/2024/04/08/israel-gaza-war-elizabeth-warren-00151120"
  },
  {
    "text": "CSIS warned Prime Minister's Office in 2023 that China ‘clandestinely and deceptively’ interfered in elections  —  Top secret document claims at least 11 candidates, 13 staffers were implicated in foreign interference  —  Canada's spy agency believes the Chinese government … ",
    "url": "https://www.cbc.ca/news/politics/pmo-briefing-leaks-1.7167090"
  },
  {
    "text": "William Shatner promotes fighting climate change amid solar eclipse  —  Star Trek actor William Shatner told NBC News on Monday that there's no point in going into space if we “can't come back” to Earth due to the environment.  —  NBC's Maura Barrett pressed Shatner with a climate change question … ",
    "url": "https://www.washingtonexaminer.com/news/2958686/william-shatner-promotes-fighting-climate-change-amid-solar-eclipse/"
  },
  {
    "text": "Saying prosecutors should focus on Antifa, judge frees white supremacist in beating  —  In his sentencing memo Thursday, U.S. District Judge Cormac J. Carney made it clear why he was letting Tyler Laube off lightly.  —  It wasn't just because of what Laube did or didn't do … ",
    "url": "https://www.usatoday.com/story/news/investigations/2024/04/08/judge-cormac-carney-tyler-laube-sentence/73220283007/"
  },
  {
    "text": "The increasingly authoritarian-curious Republican Party  —  Donald Trump is eyeing a more authoritarian second term in the White House.  And, increasingly, Republicans seem inclined to support that goal.  —  Polling on the GOP's appetite for a more powerful chief executive has been slow in coming.",
    "url": "https://www.washingtonpost.com/politics/2024/04/08/republican-party-authoritarian/"
  },
  {
    "text": "ALA kicks off National Library Week revealing the annual list of Top 10 Most Challenged Books and the State of America's Libraries Report  —  Contact:  —  Communications Specialist  —  Communications, Marketing & Media Relation Office  —  cmomedia@ala.org",
    "url": "https://www.ala.org/news/press-releases/2024/04/ala-kicks-national-library-week-revealing-annual-list-top-10-most-challenged"
  },
  {
    "text": "Whoopi Goldberg: Abortion is ‘not mentioned’ in the Ten Commandments  —  The View co-host Whoopi Goldberg argued on Monday that abortion is “not mentioned” in the Ten Commandments while discussing former President Donald Trump's social media video stating his stance on abortion.",
    "url": "https://www.washingtonexaminer.com/news/2958042/whoopi-goldberg-abortion-is-not-mentioned-in-the-ten-commandments/"
  },
  {
    "text": "President Joe Biden Outlines New Plans to Deliver Student Debt Relief to Over 30 Million Americans Under the Biden-Harris Administration  —  Today, Biden-Harris Administration leaders will fan out across the country as President Biden announces his Administration's new plans to cancel student debt for tens of millions of Americans.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/08/president-joe-biden-outlines-new-plans-to-deliver-student-debt-relief-to-over-30-million-americans-under-the-biden-harris-administration/"
  }
]