[
  {
    "text": "The mystery of the missing binder: How a collection of raw Russian intelligence disappeared under Trump  —  A binder containing highly classified information related to Russian election interference went missing at the end of Donald Trump's presidency, raising alarms among intelligence officials … ",
    "url": "https://www.cnn.com/interactive/2023/12/politics/missing-russia-intelligence-trump-dg/"
  },
  {
    "text": "Material From Russia Investigation Went Missing as Trump Left Office  —  A binder given to the Trump White House contained details that intelligence agencies believe could reveal secret sources and methods.  —  Material from a binder with highly classified information connected to the investigation … ",
    "url": "https://www.nytimes.com/2023/12/15/us/politics/trump-binder-classified-material-russia.html"
  },
  {
    "text": "Behind the Scenes at the Dismantling of Roe v. Wade  —  On Feb. 10 last year, Justice Samuel A. Alito Jr. showed his eight colleagues how he intended to uproot the constitutional right to abortion.  —  At 11:16 a.m., his clerk circulated a 98-page draft opinion in Dobbs v. Jackson Women's Health Organization.",
    "url": "https://www.nytimes.com/2023/12/15/us/supreme-court-dobbs-roe-abortion.html"
  },
  {
    "text": "Why Bob Vander Plaats thinks some evangelicals can't quit Trump  —  Good morning, Early Birds.  We're running out of shelves on which to hide our elves.  Please send suggestions (and, more importantly, newsworthy tips) to earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2023/12/15/why-bob-vander-plaats-thinks-some-evangelicals-cant-quit-trump/"
  },
  {
    "text": "Melania Trump Welcomes You to America, for Some Reason  —  Her husband is accused of swiping Archives property.  But she's set to star in a winning photo op.  —  For two years, the National Archives stalked Donald Trump over secret presidential records he's accused of purloining.",
    "url": "https://www.politico.com/news/magazine/2023/12/15/melania-trump-national-archives-naturalization-ceremony-00131762"
  },
  {
    "text": "What's Driving Former Progressives to the Right?  —  In a new essay in the progressive magazine In These Times, the writers Kathryn Joyce and Jeff Sharlet grapple with the contemporary version of an old phenomenon: erstwhile leftists decamping to the right.  There have been plenty … ",
    "url": "https://www.nytimes.com/2023/12/15/opinion/democrats-shift-rightward.html"
  },
  {
    "text": "Progressives Worry About So Many Former Comrades Drifting to the Right  —  Maybe you've heard of O'Sullivan's First Law?  This was an idea introduced by John O'Sullivan back in 1989. … O'Sullivan's Law was about the behavior of groups and organizations but I thought of it today when I read … ",
    "url": "https://hotair.com/john-s-2/2023/12/15/auto-draft-193-3-n599243"
  },
  {
    "text": "Judges dubious of Mark Meadows' bid to avoid facing charges in Georgia state court  —  The former White House chief of staff is charged alongside Donald Trump with a conspiracy to tamper with the 2020 election in Georgia.  —  A federal appeals court panel took a skeptical stance Friday toward … ",
    "url": "https://www.politico.com/news/2023/12/15/mark-meadows-trump-georgia-charges-federal-court-00131993"
  },
  {
    "text": "Rep. Elise Stefanik files complaint against judge who has ruled in Jan. 6 and Trump cases  —  The New York Republican and staunch Trump ally is asking for an ethics investigation, arguing the judge has engaged in “highly inappropriate political speech.”  —  WASHINGTON — Rep. Elise Stefanik … ",
    "url": "https://www.nbcnews.com/politics/congress/elise-stefanik-files-complaint-judge-ruled-jan-6-trump-cases-rcna129878"
  },
  {
    "text": "Kanye West Goes On Unhinged Rant, ‘Jesus Christ, Hitler, Ye!  Sponsor That!!’  —  KANYE WEST UNHINGED RANT IN VEGAS ... ‘Jesus Christ, Hitler, Ye!  Sponsor That!!!’  —  RANTING & RAVING  —  Kanye West is apparently in the grips of a serious mental health episode … ",
    "url": "https://www.tmz.com/2023/12/15/kanye-west-rant-las-vegas-jesus-christ-hitler-ye-sponsor-that-vultures/"
  },
  {
    "text": "Billionaires Are Bankrolling Judges' Luxury Travel  —  Two deep-pocketed conservative organizations paid to send federal judges on 251 trips in 2021 and 2022 — far more than any other source.  —  In 2021 and 2022, two conservative, billionaire-funded legal interests sent more than 100 federal judges … ",
    "url": "https://www.levernews.com/billionaires-are-bankrolling-judges-luxury-travel/"
  },
  {
    "text": "Cornel West thinks Biden won't make it to the general election  —  The independent candidate rejected the idea he could be a “spoiler” for Biden in an exclusive meeting with POLITICO.  —  Cornel West doesn't think Joe Biden will make it to the general election.",
    "url": "https://www.politico.com/news/2023/12/15/cornel-west-biden-election-00131944"
  },
  {
    "text": "U.S. economy will pull off soft landing in 2024, CBO projects  —  The U.S. economy is on track to avoid a recession next year as inflation returns to normal, according to new economic projections released by the Congressional Budget Office. … But its projections suggest America will skirt an all-out contraction in growth.",
    "url": "https://www.axios.com/2023/12/15/us-economy-avoid-recession-inflation-cbo-projections"
  },
  {
    "text": "Hungary blocks €50bn of EU funding for Ukraine  —  Hungary has blocked €50bn ($55bn; £43bn) in EU aid for Ukraine - just hours after an agreement was reached on starting membership talks.  —  “Summary of the nightshift: veto for the extra money to Ukraine,” … ",
    "url": "https://www.bbc.com/news/world-europe-67724357"
  },
  {
    "text": "2. Assessments of Joe Biden  —  A third of Americans currently say they approve of Joe Biden's job performance as president, while nearly two-thirds (64%) say they disapprove.  This is little changed over the last year.  —  Around six-in-ten Democrats and Democratic leaners (61%) … ",
    "url": "https://www.pewresearch.org/politics/2023/12/14/assessments-of-joe-biden/"
  },
  {
    "text": "The Immigration Policy Spiral  —  Joe Biden, from a position of weakness, is trying to cut a punitive deal on border policy without the House.  —  Migrants are loaded onto shuttle buses as hundreds gather along the border, December 5, 2023, in Lukeville, Arizona.",
    "url": "https://prospect.org/politics/2023-12-15-immigration-policy-spiral/"
  },
  {
    "text": "Urgent Need to Increase Immunization Coverage for Influenza, COVID-19, and RSV and Use of Authorized/Approved Therapeutics in the Setting of Increased Respiratory Disease Activity During the 2023 - 2024 Winter Season  —  Distributed via the CDC Health Alert Network",
    "url": "https://emergency.cdc.gov/han/2023/han00503.asp"
  },
  {
    "text": "Ukraine councilor detonates grenades at meeting, wounding 26, in attack captured on video  —  A Ukrainian village councilor set off hand grenades at a meeting in an attack that was captured on video and left 26 people wounded, the country's national police said Friday.",
    "url": "https://www.cbsnews.com/news/ukraine-councilor-sets-off-grenades-meeting-captured-on-video/"
  },
  {
    "text": "GOP Sen. Mullin Says Biden ‘May Not Be Impeachable’ Because He Wasn't in Office at the Time of Accused Indiscretion  —  Mullin's comment comes after the House voted to formalize the impeachment inquiry of the president  —  Oklahoma Republican Sen. Markwayne Mullin suggested that President Joe Biden … ",
    "url": "https://themessenger.com/politics/gop-sen-mullin-says-biden-may-not-be-impeachable-because-he-wasnt-in-office-at-the-time-of-accused-indiscretion"
  },
  {
    "text": "'I'm not a progressive': Fetterman breaks with the left, showing a maverick side  —  Sen. John Fetterman, D-Pa., has drawn fire from progressives over his fierce support for Israel and broken with immigration advocates with his support for curtailing migration.",
    "url": "https://www.nbcnews.com/politics/congress/-not-progressive-fetterman-breaks-left-israel-immigration-rcna129747"
  },
  {
    "text": "Ex-FBI official sentenced for assisting “Putin's henchman”  —  A former FBI special agent in charge of counterintelligence at the bureau's New York Field Office was sentenced to 50 months in prison on Thursday in connection to working with a sanctioned Russian oligarch.",
    "url": "https://www.axios.com/2023/12/15/fbi-official-charles-mcgonigal-russian-oligarch-sentenced"
  }
]