[
  {
    "text": "Trump speaks with Justice Alito amid push to halt criminal sentencing  —  Alito spoke to Trump to recommend an ex-clerk for a job in his administration.  —  President-elect Donald Trump speaks during a news conference at Mar-a-Lago, Jan. 7, 2024, in Palm Beach, Fla.",
    "url": "https://abcnews.go.com/US/trump-speaks-justice-alito-amid-push-halt-criminal/story?id=117386419"
  },
  {
    "text": "Alito Spoke With Trump Shortly Before Supreme Court Filing  —  The justice said that the call was a routine job reference for one of his former clerks and that the request to stay the president-elect's sentencing did not come up.  —  Justice Samuel A. Alito Jr. spoke with President-elect Donald J. Trump … ",
    "url": "https://www.nytimes.com/2025/01/08/us/justice-alito-trump.html"
  },
  {
    "text": "Lack of water from hydrants in Palisades fire is hurting firefighters, Caruso says  —  As wildfires raged across Los Angeles on Tuesday, crews battling the Palisades blaze faced an additional burden: Scores of fire hydrants in the Pacific Palisades had little to no water flowing out.",
    "url": "https://www.latimes.com/california/story/2025-01-08/lack-of-water-from-hydrants-in-palisades-fire-is-hampering-firefighters-caruso-says"
  },
  {
    "text": "5 dead, more than 1,100 structures destroyed as firestorm besieges L.A. County  —  More than 1,100 buildings have burned and at least five people are dead in wildfires burning across L.A. County, making this one of the most destructive firestorms to hit the region in memory.",
    "url": "https://www.latimes.com/california/live/pacific-palisades-fire-updates-los-angeles"
  },
  {
    "text": "With Bass abroad, even Democrats are slamming LA mayor over wildfires  —  Los Angeles Times owner Patrick Soon-Shiong and developer Rick Caurso led the chorus of criticism against the mayor.  Tommy Vietor, a former Obama staffer and Pod Save America host, piled on.",
    "url": "https://www.politico.com/news/2025/01/08/los-angeles-fires-mayor-karen-bass-handling-criticized-00197137"
  },
  {
    "text": "Biden Has Presidential Immunity.  He Should Use It.  —  1. Shiny Objects  —  I want to talk about all of the Trump insanity.  I want to talk about his insistence on “taking” Greenland.  And the Panama Canal.  And making Canada a U.S. state.  And renaming the Gulf of Mexico the “Gulf of America.”",
    "url": "https://www.thebulwark.com/p/biden-has-presidential-immunity-he"
  },
  {
    "text": "AG Merrick Garland intends to release special counsel report on Trump's Jan. 6 case, DOJ says  —  The portion of the report about the classified documents case is being withheld pending litigation in Florida federal courts.  —  WASHINGTON — Special counsel Jack Smith has turned … ",
    "url": "https://www.nbcnews.com/politics/justice-department/merrick-garland-intends-release-special-counsel-report-trumps-jan-6-ca-rcna186777"
  },
  {
    "text": "Biden postpones Italy trip amid raging Los Angeles fires  —  President Biden will no longer travel to Italy this weekend as fires rage in Los Angeles County, the White House said Wednesday.  —  “After returning this evening from Los Angeles, where earlier today he had met with police … ",
    "url": "https://thehill.com/homenews/administration/5075775-biden-cancels-italy-trip-california-fires/"
  },
  {
    "text": "Poking Fun at Trump, Mexico's President Suggests Renaming the U.S.  —  President Claudia Sheinbaum of Mexico also said Donald Trump was ill-informed when he said Mexico was “essentially run by the cartels.”  —  Mexico's president rejected several of President-elect Donald J. Trump's assertions … ",
    "url": "https://www.nytimes.com/2025/01/08/us/politics/mexico-president-mexican-america-trump.html?unlocked_article_code=1.nk4._okz.NQR-QhN5oSkY&smid=url-share"
  },
  {
    "text": "Ozempic, Legos and Hearing Aids: What Trump's Greenland Plan Could Hit  —  Putting tariffs on Denmark unless it cedes the island of Greenland could hurt access to a few key products, including popular medicines.  —  President-elect Donald J. Trump has threatened tariffs on many countries for many different reasons.",
    "url": "https://www.nytimes.com/2025/01/08/us/politics/trump-greenland-denmark-ozempic.html"
  },
  {
    "text": "House Republican bill would pave way for Trump to acquire Panama Canal for US  —  Rep. Dusty Johnson (R-S.D.) will introduce a bill that would authorize the president to purchase the Panama Canal and put it under U.S. control, an acquisition that President-elect Trump has been pushing over the last several weeks.",
    "url": "https://thehill.com/homenews/house/5074775-republican-bill-panama-canal-trump-purchase/"
  },
  {
    "text": "Gallego is latest Dem to back Laken Riley Act  —  Sen. Ruben Gallego (D-Ariz.) is the latest Democratic senator to sign on to support the Laken Riley Act, the House-passed immigration legislation with improving odds of passing in the upper chamber.  “We must give law enforcement the means … ",
    "url": "https://www.politico.com/live-updates/2025/01/08/congress/laken-riley-act-ruben-gallego-00197043"
  },
  {
    "text": "Hawaii Gov: RFK Jr.'s Anti-Vax Misinformation Left Dozens Of Kids Dead In Samoa  —  The Senate is poised to make “an absolute life-or-death decision” in confirming Kennedy as HHS secretary, warned Gov. Josh Green, who is also a physician.  —  LOADING  —  WASHINGTON — Hawaii Gov. Josh Green … ",
    "url": "https://www.huffpost.com/entry/hawaii-governor-josh-green-rfk-jr-vaccines-hhs_n_677ebc3ce4b0f751b99402ae"
  },
  {
    "text": "Prepare to Be Shocked: Los Angeles' Fire Chief Is a DEI-Obsessed ‘LGBTQ’ Woman Who Wasted Millions  —  In perhaps the most unexpected, shocking revelation to come out of the devastating Los Angeles wildfires, it turns out their Fire Chief is an “LGBTQ+” woman who is obsessed with DEI.",
    "url": "https://redstate.com/bonchie/2025/01/08/in-a-shocking-turn-of-events-las-fire-chief-is-a-dei-obsessed-lgbtq-woman-n2184093"
  },
  {
    "text": "Trump transition considering D.C.-area showcase immigration raid in first days of administration  —  The raid under consideration would target immigrants allegedly living in the U.S. illegally at a workplace in the Washington, D.C., metropolitan area.  —  The incoming Trump administration … ",
    "url": "https://www.nbcnews.com/investigations/trump-raid-undocumented-immigrants-washington-dc-high-profile-rcna186780"
  },
  {
    "text": "Facebook Is Censoring 404 Media Stories About Facebook's Censorship  —  In early December I got the kind of tip we've been getting a lot over the past year.  A reader had noticed a post from someone on Reddit complaining about a very graphic sexual ad appearing in their Instagram Reels.",
    "url": "https://www.404media.co/facebook-is-censoring-404-media-stories-about-facebooks-censorship/"
  },
  {
    "text": "Japanese Yakuza Leader Pleads Guilty to Nuclear Materials Trafficking, Narcotics, and Weapons Charges  —  For Immediate Release  —  Takeshi Ebisawa, 60, of Japan, pleaded guilty in Manhattan, New York, today to conspiring with a network of associates to traffic nuclear materials … ",
    "url": "https://www.justice.gov/opa/pr/japanese-yakuza-leader-pleads-guilty-nuclear-materials-trafficking-narcotics-and-weapons"
  },
  {
    "text": "Watchdog group accuses RFK Jr. of voter fraud  —  The former independent candidate faces scrutiny over an address he used to vote in New York.  —  With less than two weeks before Donald Trump is sworn in as President, his pick to lead Health and Human Services is facing a new legal challenge — over alleged voter fraud.",
    "url": "https://www.politico.com/news/2025/01/08/rfk-voter-ny-accusations-00196984"
  },
  {
    "text": "In exclusive sit-down, Biden reveals his biggest regret and the compliment Trump gave him  —  Interviews like this one have been rare in Biden's tenure.  He has held fewer news conferences and individual sessions with reporters than any president since at least Ronald Reagan.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2025/01/08/exclusive-joe-biden-interview-donald-trump-election/77378693007/"
  },
  {
    "text": "Capitol Police arrest man with machete amid Carter visitation and ahead of Trump meeting  —  Washington — Capitol Police said officers arrested a man with a machete and other knives on Wednesday afternoon at the Capitol Visitor Center.  —  The arrest comes hours ahead of President-elect … ",
    "url": "https://www.cbsnews.com/news/capitol-police-arrest-machete-knives/"
  },
  {
    "text": "Threatening Canada  —  Trump posted this last night on Truth Social.  —  A lot of people went off on him.  A lot of other people chided those people for chasing a bright shiny object and ignoring important things, like Senator Majority Leader John Thune's claim he has the votes to confirm … ",
    "url": "https://joycevance.substack.com/p/threatening-canada"
  },
  {
    "text": "Powerful Labor Group Joins A.F.L.-C.I.O. Ahead of New Trump Era  —  A marriage between the service employees union and the A.F.L.-C.I.O. could better equip organized labor to deal with a less-friendly administration.  —  Two prominent labor groups are joining forces in an attempt … ",
    "url": "https://www.nytimes.com/2025/01/08/business/economy/afl-cio-seiu-labor-union-alliance.html"
  },
  {
    "text": "Body of hostage Youssef Ziyadne found in Gaza  —  The IDF confirmed Ziyadne was discovered in an underground tunnel in Rafah adding that it discovered “findings relating to Youssef's son.”  —  Israeli security forces have discovered the body of hostage Youssef al-Ziyadne, 53, in the Gaza Strip, his family was told on Wednesday.",
    "url": "https://www.jpost.com/breaking-news/article-836669"
  },
  {
    "text": "Trump Inauguration, Awash in Cash, Runs Out of Perks for Big Donors  —  The president-elect has raised more than $170 million for his swearing-in, an inaugural record, as wealthy Americans flock to curry favor with him and some give money even without the prospect of V.I.P. access.",
    "url": "https://www.nytimes.com/2025/01/08/us/politics/trump-inauguration-donors.html"
  },
  {
    "text": "UnitedHealth shareholders demand review of policies that ‘delayed or denied’ health care access  —  Shareholders of UnitedHealth Group (UHG) are calling on the company's board of directors to release a report on how its policy of limiting or delaying access to health care may be impacting the company's brand and the economy overall.",
    "url": "https://thehill.com/policy/healthcare/5074769-unitedhealth-denied-care-uhg-brian-thompson/"
  },
  {
    "text": "Elon Musk's Boring Company Is Tunneling Beneath Las Vegas With Little Oversight  —  Given Musk's role advising President-elect Donald Trump on ways to slash regulations and government oversight, Boring and the Vegas Loop project might be a harbinger for the country.  —  Co-published with City Cast Las Vegas",
    "url": "https://www.propublica.org/article/elon-musk-boring-company-las-vegas-loop-oversight"
  },
  {
    "text": "The gravity of a GOP election challenge in N.C.: ‘Invites incredible mischief’  —  Why the North Carolina state Supreme Court allowing the case to proceed two months after the election is so extraordinary.  —  When Republican Richard Dietz was running for the North Carolina state Supreme Court in 2022 … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/08/gop-election-challenge-north-carolina/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2MzEyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3Njk0Nzk5LCJpYXQiOjE3MzYzMTI0MDAsImp0aSI6IjgzNWYxZDA2LWMyMWUtNDIzYy1hNWVkLTExODg2ZWI5OTA5NiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzA4L2dvcC1lbGVjdGlvbi1jaGFsbGVuZ2Utbm9ydGgtY2Fyb2xpbmEvIn0.nDRDUrZds--y3LWFtxreQsbo9hZpP1PjpIqq6Yis4-g&itid=gfta"
  },
  {
    "text": "Palisades Fire  —  Unified Command: CAL FIRE San Bernardino-Inyo-Mono Unit, Los Angeles County Fire Department, Los Angeles City Fire Department and Los Angeles Police Department  —  Southeast of Palisades Drive, Pacific Palisades  —  Evacuation Orders  —  Immediate threat to life.",
    "url": "https://www.fire.ca.gov/incidents/2025/1/7/palisades-fire"
  }
]