[
  {
    "text": "China Discusses Sale of TikTok US to Musk as One Possible Option  — ByteDance's preferred strategy is to fight ban, sources say  — Trump has said he would like to delay ban to seek resolution  —  Chinese officials are evaluating a potential option that involves Elon Musk acquiring … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-14/china-discusses-sale-of-tiktok-us-to-musk-as-one-possible-option?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczNjgxMzk1OSwiZXhwIjoxNzM3NDE4NzU5LCJhcnRpY2xlSWQiOiJTUFJTMDNUMEFGQjQwMCIsImJjb25uZWN0SWQiOiI3MDQyN0U3REVGMkM0MDEzODNCNDUzRjAyNUE2NDc3NyJ9.7qgkxCtNvjSnnOz1POZ22exlVzW6sZbXYfKK9YbQ3oU&leadSource=uverify%20wall"
  },
  {
    "text": "Elon Musk Is Expected to Use Office Space in the White House Complex  —  The location suggests that Mr. Musk, who owns companies with billions of dollars in contracts with the federal government, will continue to have remarkable access to President-elect Donald J. Trump.",
    "url": "https://www.nytimes.com/2025/01/13/us/politics/elon-musk-white-house-trump.html?unlocked_article_code=1.pE4.GrrC.TVbMLIcP05Pd&smid=url-share"
  },
  {
    "text": "Johnson confirms ‘discussions’ on tying wildfire aid to debt limit  —  House Speaker Mike Johnson confirmed to reporters Monday there's “been some discussion” of tying California wildfire aid to a debt limit increase, after GOP members raised the issue with Donald Trump in several meetings … ",
    "url": "https://www.politico.com/live-updates/2025/01/13/congress/johnson-wildfire-california-debt-limit-00197900"
  },
  {
    "text": "Mike Johnson Vows to Hold Aid to California Hostage After Deadly Fires  —  Republican leadership continues to use one of the worst natural disasters in U.S. history as political leverage.  —  On Monday, House Speaker Mike Johnson told CNN's Manu Raju that there should be “conditions” … ",
    "url": "https://newrepublic.com/post/190179/mike-johnson-aid-california-fires-condition"
  },
  {
    "text": "Pete Hegseth's FBI background check does not include interviews with key women from his past  —  The report doesn't have material from his ex-wives or a woman who accused Hegseth of sexual assault in 2017.  Hegseth has said that encounter was consensual, and prosecutors never filed charges.",
    "url": "https://www.nbcnews.com/politics/congress/pete-hegseths-fbi-background-check-not-include-interviews-key-women-rcna187531"
  },
  {
    "text": "FBI did not interview Hegseth accuser ahead of hearing, people familiar say  —  Senate Democrats slam “significant gaps and inadequacies” in the background vetting of President-elect Donald Trump's pick to lead the Pentagon.  —  The FBI did not interview a woman who accused Pete Hegseth … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/13/hegseth-accuser-fbi-interview-senate-hearing/"
  },
  {
    "text": "Scoop: Trump team sets red line on Hegseth's FBI background check … - That means no FBI background check access for rank-and-file senators, according to two people familiar with the matter.  — Senate Armed Services chair Roger Wicker (R-Miss.) and ranking member Jack Reed (D-R.I.) have been briefed on the report.",
    "url": "https://www.axios.com/2025/01/14/trump-hegseth-confirmation-fbi-background-check"
  },
  {
    "text": "Star Washington Post Columnist Torches Paper on Her Way Out the Door  —  The star Washington Post columnist Jennifer Rubin resigned from the paper Monday and took a parting shot at Jeff Bezos, its billionaire owner.Driving her departure was recent executive decisions at the Post, she told CNN.",
    "url": "https://www.thedailybeast.com/star-washington-post-columnist-jennifer-rubin-torches-paper-on-her-way-out-the-door/"
  },
  {
    "text": "Greenland to Trump: We're Not for Sale but Let's Talk Business  —  The country's prime minister said that while Greenlanders do not want to become Americans, “the reality is we are going to work with the U.S. — yesterday, today and tomorrow.”  —  The country's prime minister … ",
    "url": "https://www.nytimes.com/2025/01/13/world/europe/greenland-trump-business.html"
  },
  {
    "text": "Biden's parting gift: Student loan debt relief  —  More than 5 million borrowers have had loans forgiven since the president took office.  —  In the waning days of Joe Biden's presidency, his administration announced on Monday that it will provide student debt relief to 150,000 borrowers.",
    "url": "https://www.politico.com/news/2025/01/13/biden-student-loan-relief-150000-borrowers-00197855"
  },
  {
    "text": "Statement from President Biden Announcing the Names of CVN 82 and CVN 83  —  I am proud to announce that the next two Gerald R. Ford-class nuclear-powered aircraft carriers will be named for two former presidents: Bill Clinton and George W. Bush.  —  When I personally delivered the news to Bill and George, they were deeply humbled.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/13/statement-from-president-biden-announcing-the-names-of-cvn-82-and-cvn-83/"
  },
  {
    "text": "Gavin Newsom and California Democrats reach $50M deal to Trump-proof the state  —  The first-of-its-kind agreement would fund litigation against the incoming White House and protect against a potential mass deportation of immigrants.  —  SACRAMENTO, California — California Democrats … ",
    "url": "https://www.politico.com/news/2025/01/13/newsom-california-democrats-trump-legal-fights-00197784"
  },
  {
    "text": "Justice Dept. says it plans to release Trump special counsel report after hold expires at midnight  —  President-elect Donald Trump has tried to prevent the release of special counsel Jack Smith's report before he takes office next week.  —  The Justice Department plans to release … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/13/trump-jan-6-classified-documents-investigations-report-jack-smith/"
  },
  {
    "text": "Maybe It Was Never About the Factory Jobs  —  The theory that populist economic policies can win back the working class for Democrats has been tried, and it has failed.  —  if there was any place in America where President Joe Biden's economic agenda ought to have won him votes, it would have been Lordstown, Ohio.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/01/biden-economic-populism-failure/681289/?gift=MEpCTQExoFIUxpSYhsgq4h9ejtl-jZIYXEk2wEKbqBo&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Zuckerberg Debuts ‘Real Mark’ in Push to Woo Trump  —  Meta pursues a MAGA makeover, in the latest political pivot for a company that once banned the now-president-elect from its platforms  —  Mark Zuckerberg wants Donald Trump to get to know the “real Mark.”",
    "url": "https://www.wsj.com/tech/mark-zuckerberg-meta-trump-pivot-392e4a3f?st=jPh9dB&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump Gets Insane Show of Support From Washington Post Editorial Board  —  The Washington Post's editorial board made the mind-boggling decision Monday to say they support all but four of Donald Trump's Cabinet nominees, and their rationales were as unconvincing as they were brief.",
    "url": "https://newrepublic.com/post/190180/donald-trump-nominees-support-washington-post-editorial-board"
  },
  {
    "text": "Trump Team Studies Gradual Tariff Hikes Under Emergency Powers  — Plan would boost import duties 2%-5% a month on trade partners  — Supporters include Trump advisers Bessent, Hassett and Miran  —  Members of President-elect Donald Trump's incoming economic team are discussing slowly ramping … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-13/trump-team-studies-gradual-tariff-hikes-under-emergency-powers"
  },
  {
    "text": "Here's who is performing at Trump's inauguration  —  Trump's inauguration performers include Carrie Underwood, Village People and Christopher Macchio.  —  The festivities planned for President-elect Donald Trump's inauguration next week symbolize a vibrant return to the White House … ",
    "url": "https://www.washingtonpost.com/style/2025/01/13/trump-inauguration-performers/"
  },
  {
    "text": "Trump flies US flag at full height before end of 30-day mourning period following Carter's death  —  U.S. flags at President-elect Donald Trump 's private Mar-a-Lago club are back to flying at full height.  Flags are supposed to fly at half-staff through the end of January out of respect … ",
    "url": "https://apnews.com/article/trump-carter-flag-half-staff-mar-a-lago-c90e341b89615aef8817c6fc021a93b7"
  },
  {
    "text": "Elon Musk Exposed Over Right-Wing Lie on L.A. Fires  —  Elon Musk was fact-checked on his own livestream after making false statements about the California wildfires, and Gavin Newsom was quick to call out the tech mogul on social media.  —  In a post on X Sunday night … ",
    "url": "https://newrepublic.com/post/190157/elon-musk-fact-check-water-shortage-la-fires"
  },
  {
    "text": "Special Counsel Report on Hunter Biden Denounces President's Criticism of Case  —  The report by the special counsel, David C. Weiss, criticized President Biden for making “baseless accusations” that threatened “the integrity of the justice system as a whole.”",
    "url": "https://www.nytimes.com/2025/01/13/us/politics/special-counsel-report-hunter-biden.html"
  },
  {
    "text": "Meta Is Blocking Links to Decentralized Instagram Competitor Pixelfed  —  Meta is deleting links to Pixelfed, a decentralized Instagram competitor.  On Facebook, the company is labeling links to Pixelfed.social as “spam” and deleting them immediately.  —  Pixelfed is an open-source … ",
    "url": "https://www.404media.co/meta-is-blocking-links-to-decentralized-instagram-competitor-pixelfed/"
  },
  {
    "text": "North Carolina Judge Denies Republicans' Request To Toss 60,000 Ballots  —  Today, a North Carolina judge rejected a request from the Republican National Committee (RNC), North Carolina GOP, Wake County GOP and two voters to toss out nearly 60,000 ballots cast in all November 2024 statewide races.",
    "url": "https://www.democracydocket.com/news-alerts/north-carolina-judge-denies-republicans-request-to-toss-60000-ballots/"
  },
  {
    "text": "Supreme Court denies oil industry plea to block climate lawsuits filed by California, other blue states  —  WASHINGTON — The Supreme Court dealt a major setback to the oil industry on Monday, refusing to block lawsuits from California and other blue states that seek billions of dollars in damages for the impact of climate change.",
    "url": "https://www.latimes.com/world-nation/story/2025-01-13/supreme-court-oil-industry-climate-change-lawsuits-california"
  },
  {
    "text": "There Is No Safe Word … Editor's note: This story contains content that readers may find disturbing, including graphic allegations of sexual assault.  —  Scarlett Pavlovich was a 22-year-old drama student when she met the performer Amanda Palmer by chance on the streets of Auckland.",
    "url": "https://www.vulture.com/article/neil-gaiman-allegations-controversy-amanda-palmer-sandman-madoc.html"
  },
  {
    "text": "Harris declines to invite Vance for courtesy visit to vice president's residence before inauguration  —  When JD Vance, his wife Usha and their three young children move into the Naval Observatory residence on Jan. 20, it will be their first time inside the white Queen Anne-style mansion … ",
    "url": "https://www.cbsnews.com/news/harris-jd-vance-vice-presidents-residence/"
  }
]