[
  {
    "text": "BREAKING: Trump will not seek to move Fulton case to federal court  —  X  —  In a surprise move, former President Donald Trump has decided not to seek to move his criminal trial from Fulton County to federal court, his lawyer said Thursday.  —  In a two-page notice filed in Fulton County … ",
    "url": "https://www.ajc.com/news/breaking-trump-will-not-seek-to-move-fulton-case-to-federal-court/B64PLR4I5ZCK3JQRSPLJMOSAIE/"
  },
  {
    "text": "Trump New York fraud trial cleared to start Monday after appeals panel ruling  — The New York civil fraud trial of former President Donald Trump and his company is back on track to start Monday after a state appeals court lifted a temporary stay of the case.",
    "url": "https://www.cnbc.com/2023/09/28/trump-new-york-fraud-trial-cleared-to-start-monday-after-appeals-panel-ruling.html"
  },
  {
    "text": "Trump unexpectedly says he won't seek to move his Georgia election case to federal court  —  The notification comes weeks after the former president's attorneys said that he was considering attempting to move the case to a federal venue.  —  Former President Donald Trump will not seek to move … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-unexpectedly-says-wont-seek-move-georgia-election-case-federal-c-rcna117963"
  },
  {
    "text": "EXCLUSIVE: Trump Rips RNC, Says They Have To Stop Debates … In an exclusive sit-down interview with the Daily Caller, Trump said there would not be a breakout candidate and the debates are bad for the Republican Party.  —  “They have to stop the debates.  Because it is just bad for the Republican Party.",
    "url": "https://dailycaller.com/2023/09/28/exclusive-trump-rips-rnc-stop-debates/"
  },
  {
    "text": "Trump's Promise of Lawlessness  —  Though it was lost in the four-year cyclone that was the presidency of Donald Trump, one of his most immoral acts was to pardon soldiers who were accused of committing war crimes by killing unarmed civilians or prisoners.  Military leaders … ",
    "url": "https://www.nytimes.com/2023/09/28/opinion/trump-debate-milley.html"
  },
  {
    "text": "Donald Trump: UAW negotiations 'don't mean as much as you think'  —  Clinton Township — Republican Donald Trump railed against electric vehicles during a campaign stop in suburban Detroit Wednesday night, saying they're too expensive, aren't capable of traveling far enough and would spur job losses for Americans.",
    "url": "https://www.detroitnews.com/story/news/politics/2023/09/27/donald-trump-returns-auto-industry-strike-uaw-ev-taking-center-stage-presidential-election-joe-biden/70960155007/"
  },
  {
    "text": "Trump suing ex-MI6 officer who alleged he was ‘compromised’ by Russian security service  —  Christopher Steele's dossier also alleged Putin ‘supported and directed’ plan to ‘cultivate’ Trump as a presidential candidate  —  Donald Trump is suing a former MI6 officer and the intelligence consultancy … ",
    "url": "https://www.theguardian.com/us-news/2023/sep/28/trump-suing-ex-mi6-officer-who-alleged-he-was-compromised-by-russian-security-service"
  },
  {
    "text": "Trump $250M fraud trial will go forward Monday, AG plans to call his adult sons as witnesses  —  A New York appellate court has denied Trump's motion to delay the trial.  —  The First Judicial Department Appellate Division of the New York State Supreme Court has denied Donald Trump's motion … ",
    "url": "https://abcnews.go.com/US/new-york-ag-plans-call-trump-adult-sons/story?id=103565222"
  },
  {
    "text": "Why a shutdown is looking inevitable  —  Presented by With assists from POLITICO's Congress team  —  TICK TOCK: The government will shut down in three days if Congress can't pass a funding patch.  —  FURLOUGH, SWEET CHARIOT  —  If you're a federal worker who doesn't know what the future holds … ",
    "url": "https://www.politico.com/newsletters/huddle/2023/09/28/why-a-shutdown-is-looking-inevitable-00118939"
  },
  {
    "text": "It's not just a shutdown — Congress has no plan for the FAA either  —  The airline sector is staring down an authorization and funding lapse amid congressional paralysis.  —  It's not just a broader government shutdown.  By Sunday, the aviation system could also have almost … ",
    "url": "https://www.politico.com/news/2023/09/28/congress-faa-lapse-government-shutdown-00118718"
  },
  {
    "text": "‘Botched this bad’: Insiders say GOPers furious at James Comer for his handling of impeachment inquiry  —  WASHINGTON — Republicans are growing more and more frustrated with the House Oversight Committee's impeachment hearing, with some beginning to admit it has been a failure.",
    "url": "https://www.rawstory.com/republicans-furious-biden-impeachment-flop/"
  },
  {
    "text": "First Impeachment Hearing Yields No New Information on Biden  —  In a chaotic session, Republicans accused the president of crime and corruption, but even their witnesses said the case for impeachment hadn't been made.  —  The first hearing in House Republicans' impeachment inquiry … ",
    "url": "https://www.nytimes.com/2023/09/28/us/politics/biden-impeachment-hearing.html"
  },
  {
    "text": "The biggest loser of last night's debate was ...  ... not any of the seven candidates on the stage.  It wasn't even one of the candidates who weren't on the stage — Donald Trump, Asa Hutchinson, and an assortment of also rans.  The biggest loser of the debate was Fox Business Channel, with the RNC that arranged it a close runner-up.",
    "url": "https://hotair.com/ed-morrissey/2023/09/28/the-biggest-loser-of-last-nights-debate-was-n581045"
  },
  {
    "text": "Alarmed Republicans are preparing to draft Glenn Youngkin  —  Robert Costa is the chief election and campaign correspondent for CBS News.  —  Some of the biggest Republican donors in the country will converge next month at the historic Cavalier Hotel in Virginia Beach for a two-day meeting to rally behind Gov. Glenn Youngkin.",
    "url": "https://www.washingtonpost.com/opinions/2023/09/28/draft-glenn-youngkin-2024-gop-donors/"
  },
  {
    "text": "Ojai, CA Becomes First U.S. City To Recognize Legal Rights Of Elephants  —  Ordinance gives elephants the right to liberty in Ojai  —  The Ojai City Council voted 4-1 on Wednesday to recognize the legal rights of elephants, becoming the first city in the United States to give legal rights to a non-human animal.",
    "url": "https://californiaglobe.com/fr/ojai-ca-becomes-first-u-s-city-to-recognize-legal-rights-of-elephants/"
  },
  {
    "text": "Teary-eyed influencer ‘Meatball’ who livestreamed Philadelphia looting mayhem is charged with 6 felonies  —  The Philadelphia social media influencer arrested while she livestreamed Tuesday night's looting mayhem fought back tears as she was charged with six felonies.",
    "url": "https://nypost.com/2023/09/28/philadelphia-influencer-meatball-livestreamed-lootings-charged-with-6-felonies/"
  },
  {
    "text": "Thousands of cantaloupes sold in 19 states recalled due to potential salmonella contamination  —  Thousands of whole cantaloupes sold in 19 states and Washington, D.C., have been recalled due to potential salmonella contamination, the Food and Drug Administration announced.",
    "url": "https://www.cbsnews.com/news/fda-recalls-cantaloupes-salmonella-contamination/"
  },
  {
    "text": "Youngkin: Virginia districts 'really don't have a choice' in school transgender policy  —  Republican Virginia Gov. Glenn Youngkin on Thursday said local school districts “don't really have a choice” in adopting his administration's new model policies for the treatment of transgender students … ",
    "url": "https://thehill.com/homenews/lgbtq/4228986-youngkin-virginia-districts-really-dont-have-a-choice-in-school-transgender-policy/"
  },
  {
    "text": "Democrats eye passport backlog with new legislation  —  A duo of Democrat lawmakers have introduced legislation that would implement new measures to clear passport application backlogs and reduce processing delays.  —  The proposed legislation, called the PASSPORT Act … ",
    "url": "https://thehill.com/homenews/house/4228157-democrats-eye-passport-backlog-with-new-legislation/"
  },
  {
    "text": "Joe Biden Personally Requested Meeting with Hunter's Chinese Business Partner, Text Messages Suggest  —  President Joe Biden personally requested an audience with a Chinese oil executive whose company weeks earlier paid Hunter Biden millions of dollars in consulting fees … ",
    "url": "https://freebeacon.com/biden-administration/joe-biden-personally-requested-meeting-with-hunters-chinese-business-partner-text-messages-suggest/"
  },
  {
    "text": "Peruvian National Arrested In Peru For Sending Over 150 Hoax Bomb Threats To Schools And Other Institutions In The United States And Soliciting Child Pornography  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Eddie Manuel Nunez Santos Allegedly … ",
    "url": "https://www.justice.gov/usao-sdny/pr/peruvian-national-arrested-peru-sending-over-150-hoax-bomb-threats-schools-and-other"
  },
  {
    "text": "New data on ultra-rich tax cheats wrecks the ‘working-class GOP’ ruse  —  Republicans have been amplifying the claim lately that their party has undergone a “populist” makeover, rendering it both anti-elite and pro-working class.  One way Republicans purport to illustrate … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/28/wealthy-tax-avoidance-ron-wyden-data/"
  }
]