[
  {
    "text": "Hidden-camera video shows Project 2025 co-author discussing his secret work preparing for a second Trump term  —  Last month, Russell Vought sat in a five-star Washington, DC, hotel suite, bowing his head in prayer with two men he thought were relatives of a wealthy conservative donor.",
    "url": "https://www.cnn.com/2024/08/15/politics/russ-vought-project-2025-trump-secret-recording-invs/"
  },
  {
    "text": "New hidden camera video reinforces Trump's Project 2025 problem  —  The former president knows that Project 2025 is unpopular.  But he can't distance himself from its contents or its authors.  —  When Donald Trump was president, Russell Vought joined the White House Office of Management and Budget.",
    "url": "https://www.washingtonpost.com/politics/2024/08/15/new-hidden-camera-video-reinforces-trumps-project-2025-problem/"
  },
  {
    "text": "Trump Will Try to Drag Kamala Into the Mud With Him  —  It's his only play.  —  ∙ Paid  —  1. Mud Pit  —  One of the things we're hearing from Good Republicans is that Donald Trump is falling down on the job by indulging in his usual personal attacks and shenanigans.",
    "url": "https://www.thebulwark.com/p/trump-will-try-to-drag-kamala-into"
  },
  {
    "text": "Aides not telling Trump red states “looking worse than they should” to avoid upsetting him: report  —  “This election was his to lose, and he's losing it,” says longtime Republican pollster  —  Early in July, a poll showing President Joe Biden leading former President Donald Trump … ",
    "url": "https://www.salon.com/2024/08/15/aides-not-telling-red-states-looking-worse-than-they-should-to-avoid-upsetting-him-report/"
  },
  {
    "text": "Top Trump advisers in turmoil after campaign's worst month of 2024  —  Senior aides see challenges from enemies real and perceived as the ex-president struggles against Harris  —  Donald Trump has privately expressed faith in his campaign leadership and no personnel changes are currently expected … ",
    "url": "https://www.theguardian.com/us-news/article/2024/aug/15/trump-campaign-leadership"
  },
  {
    "text": "Trump VP pick JD Vance is seen posing with three female classmates at boys' urinals in unearthed high school photo  — 18-year-old JD Vance was snapped posing with three girls in the boys' bathroom  — The photo appeared in the 2003 yearbook of Middletown High School in Ohio",
    "url": "https://www.dailymail.co.uk/news/article-13742781/JD-Vance-posing-female-classmates-urinals-photo.html"
  },
  {
    "text": "Secret Service prepares use of bulletproof glass for outdoor Trump rallies: Sources  —  The safety measure comes after a gunman tried to assassinate Trump last month.  —  Former president Donald Trump speaks during a campaign rally at Butler Farm Show Inc., July 13, 2024, in Butler, Pa.",
    "url": "https://abcnews.go.com/US/secret-service-prepares-bulletproof-glass-outdoor-trump-rallies/story?id=112847263"
  },
  {
    "text": "New College of Florida tosses hundreds of library books, empties gender diversity library  —  Hundreds of New College of Florida library books, including many on LGBTQ+ topics and religious studies, are headed to a landfill.  —  A dumpster in the parking lot of Jane Bancroft Cook Library … ",
    "url": "https://www.heraldtribune.com/story/news/education/2024/08/15/new-college-of-florida-throws-away-hundreds-of-library-books-diversity-lgbtq/74814756007/"
  },
  {
    "text": "Trump campaign brings Corey Lewandowski back on board  —  The move is part of an expansion of the campaign's ranks  —  Donald Trump's campaign is expanding its ranks as he seeks to regain his footing in the presidential campaign, bringing on a handful of top allies — including former Trump 2016 campaign manager Corey Lewandowski.",
    "url": "https://www.politico.com/news/2024/08/15/trump-campaign-brings-corey-lewandowski-back-on-board-00174155"
  },
  {
    "text": "Democrats Maintain Edge in New Senate Polls, As Nevada Moves Back to Lean Democrat  —  The 2024 election has already been historic in a number of ways, but November could mark another recent electoral oddity — a rise in ticket-splitting between presidential and Senate races.",
    "url": "https://www.cookpolitical.com/analysis/survey-research/2024-swing-state-project/democrats-maintain-edge-new-senate-polls-nevada"
  },
  {
    "text": "Man Arrested for Explosives Threats and Attack on Energy Facility  —  For Immediate Release  —  U.S. Attorney's Office, Middle District of Florida  —  Orlando, Florida - United States Attorney Roger B. Handberg announces the return of an indictment charging Hashem Younis Hashem Hnaihen … ",
    "url": "https://www.justice.gov/usao-mdfl/pr/jordanian-national-indicted-explosives-threats-and-attack-energy-facility"
  },
  {
    "text": "White House says deals struck to cut prices of popular Medicare drugs that cost $50 billion yearly  —  WASHINGTON (AP) — The Biden administration is taking a victory lap after federal officials inked deals with drug companies to lower the price for 10 of Medicare's most popular and costliest drugs … ",
    "url": "https://apnews.com/article/biden-drug-prices-medicare-prescriptions-34886d6f362c242be268c05d5efd5411"
  },
  {
    "text": "Harris has opened up a second path to victory, according to The Post's polling model  —  The Democratic nominee could win in the Rust Belt or the Sun Belt and get to the White House, while Donald Trump must win in both geographic regions to triumph.  —  A lot has changed in the presidential race … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/15/kamala-harris-polling-electoral-college-polling-model-donald-trump/"
  },
  {
    "text": "Trump seeks to delay his hush money sentencing until after the election  —  His lawyers are seeking to have the conviction overturned on immunity grounds.  —  NEW YORK — Attorneys for Donald Trump asked the judge overseeing the former president's Manhattan criminal case to postpone his sentencing … ",
    "url": "https://www.politico.com/news/2024/08/15/trump-seeks-delay-to-hush-money-sentencing-00174157"
  },
  {
    "text": "August 2024 National Poll: Harris 50%, Trump 46%  —  Home Polls August 2024 National Poll: Harris 50%, Trump 46%  —  Independents, Younger Voters Swing Toward Harris  —  The first Emerson College Polling national survey following President Biden's decision not to seek re-election finds … ",
    "url": "https://emersoncollegepolling.com/august-2024-national-poll-harris-50-trump-46/"
  },
  {
    "text": "Zelensky says Ukraine has captured key Russian town  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/policy/defense/4829130-ukraine-captures-sudzha-russian-kursk/"
  },
  {
    "text": "The Saudi Payments to Trump Are More Important than the Suspected Egyptian One  —  As you know, I was calling on the press to focus on the suspected $10 million payment Egypt made to Trump since before it was cool — since even before the WaPo significantly advanced the story over a month later.",
    "url": "https://www.emptywheel.net/2024/08/15/the-saudi-payments-to-trump-are-more-important-than-the-suspected-egyptian-one/"
  },
  {
    "text": "With JD Vance, Things Just Get Weirder And Weirder  —  A lot of things happened.  Here are some of the things.  This is TPM's Morning Memo.  Sign up for the email version.  —  What On Earth?  —  JD Vance is coming into focus as a living breathing embodiment of the caricature … ",
    "url": "https://talkingpointsmemo.com/morning-memo/jd-vance-postmenopausal-women-grandchildren"
  },
  {
    "text": "JD Vance: Amazon funded Black Lives Matter so riots would destroy rival retailers  —  Loading...  WASHINGTON  —  In 2021, J.D. Vance gave a speech to a conservative think tank on “woke capital” - and accused Amazon of funding Black Lives Matter in order to burn down the competition.",
    "url": "https://www.csmonitor.com/USA/Politics/2024/0815/jd-vance-speech-bezos-amazon-abortion"
  },
  {
    "text": "Musk's New AI Image Generator Immediately Used to Troll Him  —  OBVIOUSLY  —  Images flooded X showing Musk carrying out a school shooting with Mickey Mouse or being led on a leash by Donald Trump.  —  Elon Musk's AI chatbot launched a new image generation feature Wednesday … ",
    "url": "https://www.thedailybeast.com/musks-new-ai-image-generator-grok-2-immediately-used-to-troll-him"
  },
  {
    "text": "When Is “Recyclable” Not Really Recyclable?  When the Plastics Industry Gets to Define What the Word Means.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  Is there anything more pathetic than a used plastic bag?",
    "url": "https://www.propublica.org/article/plastics-industry-redefine-recyclable-ftc-grocery-bags"
  },
  {
    "text": "Why Facebook blocked Popular Information's reporting on Laura Loomer  —  Yesterday, Popular Information published a detailed report on the close relationship between former President Donald Trump and Laura Loomer, a far-right conspiracy theorist who says America should be a “white Judeo-Christian ethnostate.”",
    "url": "https://popular.info/p/update-why-facebook-blocked-popular"
  },
  {
    "text": "What Are Females For?  —  Republican vice presidential nominee JD Vance really does love to run his mouth on podcasts.  The latest unearthed audio has him agreeing with a conservative podcast host on what women are for once we hit menopause: Helping to raise children is “the whole purpose of the postmenopausal female.”",
    "url": "https://jill.substack.com/p/what-are-females-for"
  },
  {
    "text": "Election Live Updates: Biden and Harris Reunite to Celebrate Deal on Drug Prices  —  Former President Donald J. Trump is delivering a news conference now, just hours after President Biden and Vice President Kamala Harris made their first joint public appearance since Mr. Biden dropped out of the race.",
    "url": "https://www.nytimes.com/live/2024/08/15/us/harris-trump-election"
  },
  {
    "text": "Playbook: Look who's pushing for a Trump reset  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  QUOTE OF THE DAY — A senior administration official to WSJ's Alex Ward and Nancy Youssef on the possibility of an Iranian attack on Israel … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/15/look-whos-pushing-for-a-trump-reset-00174134"
  },
  {
    "text": "A Drunken Evening, a Rented Yacht: The Real Story of the Nord Stream Pipeline Sabotage  —  Private businessmen funded the shoestring operation, which was overseen by a top general; President Zelensky approved the plan, then tried unsuccessfully to call it off",
    "url": "https://www.wsj.com/world/europe/nord-stream-pipeline-explosion-real-story-da24839c?st=xir6glrvm7fxrf3&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Fox News totally ignored new report showing violent crime is down — while running more than 4.5 hours of violent crime coverage  —  RESEARCH CONTRIBUTIONS FROM TYLER MONROE, BEN VAN BLOEM, HARRISON RAY & NOAH DOWE  —  Fox News has not mentioned on air new data released on Friday showing … ",
    "url": "https://www.mediamatters.org/fox-news/fox-news-totally-ignored-new-report-showing-violent-crime-down-while-running-more-45-hours"
  }
]