[
  {
    "text": "Former Trump aide Steve Bannon ordered to jail by July 1 to serve contempt of Congress sentence … A federal judge in Washington, D.C., at a hearing Thursday ordered former Trump White House aide Steve Bannon to report to jail by July 1 to begin serving a four-month sentence for his criminal contempt of Congress conviction.",
    "url": "https://www.cnbc.com/2024/06/06/steve-bannon-ordered-to-jail-bail-revoked.html"
  },
  {
    "text": "Court hears arguments on whether Steve Bannon should be begin prison sentence  —  The former Trump adviser was sentenced to four months in prison for refusing to comply with Jan. 6 Committee subpoenas, but it had been put on hold while he appealed.  —  WASHINGTON — A federal judge … ",
    "url": "https://www.nbcnews.com/politics/justice-department/court-hears-arguments-whether-steve-bannon-begin-prison-sentence-rcna155209"
  },
  {
    "text": "Exclusive: Biden tells Muir he wouldn't pardon son Hunter, says Trump got ‘fair trial’  —  Biden is in Normandy commemorating the 80th anniversary of D-Day.  —  ABC News' David Muir sat down exclusively with President Joe Biden in Normandy, France, on the 80th anniversary of D-Day on June 6, 2024.",
    "url": "https://abcnews.go.com/Politics/biden-tells-muir-wouldnt-pardon-son-hunter/story?id=110904482"
  },
  {
    "text": "Biden says he wouldn't pardon son in felony gun case in Delaware  —  The White House press secretary has said previously the president would not pardon his son, Hunter Biden.  —  President Biden said Thursday he would not pardon his son, Hunter Biden, if he is convicted in his felony gun trial in Delaware.",
    "url": "https://www.washingtonpost.com/politics/2024/06/06/joe-biden-hunter-not-pardon/"
  },
  {
    "text": "Several Pa. House Republicans boo officers who defended Capitol on Jan. 6  —  Harry Dunn and Aquilino Gonell were invited to Pennsylvania's House of Representatives — but several GOP lawmakers booed and some walked out, Democratic lawmakers said.  —  Two former law enforcement officers … ",
    "url": "https://www.washingtonpost.com/politics/2024/06/06/pennsylvania-house-republicans-capitol-walkout/"
  },
  {
    "text": "Republicans hide their war on contraception in plain sight  —  Democrats call out the Trump-levels of lying by forcing Republicans to once again vote against birth control rights  —  Republicans know that their war on legal, accessible birth control is unpopular.",
    "url": "https://www.salon.com/2024/06/06/hide-their-on-contraception-in-plain-sight/"
  },
  {
    "text": "Biden's D-Day Speech Nailed the Threat of Modern Fascism  —  80 YEARS ON  —  Speaking on sacred ground in Normandy, the president correctly drew parallels between America's enemies in World War II and the threats we face domestically and globally today.",
    "url": "https://www.thedailybeast.com/bidens-d-day-speech-nailed-the-threat-of-modern-fascism"
  },
  {
    "text": "The Billionaires Have Captured Donald Trump  —  One of the most enduring—and ridiculous—#Resistance narratives of the Trump era was the idea that the president of the United States was a literal Manchurian Candidate, a man who had been compromised for years (perhaps even decades) by a foreign power, namely Russia.",
    "url": "https://newrepublic.com/article/182300/donald-trump-compromised-billionaires-selling-presidency"
  },
  {
    "text": "YouTuber's Wacko Lamborghini Stunt Ends in Federal Charges  —  FROM CLICKS TO CLINK  —  He took aim at a $300,000 Italian supercar from a helicopter with an arsenal of fireworks onboard.  —  What's more American than celebrating July 4 by taking aim at a $300,000 Italian supercar … ",
    "url": "https://www.thedailybeast.com/youtuber-alex-chois-wacko-lamborghini-stunt-ends-in-federal-charges"
  },
  {
    "text": "The Myth That Biden Had Nothing to Do with the Prosecutions of Trump … The five criminal and civil prosecutions of Donald Trump all prompt heated denials from Democrats that President Biden and Democrat operatives had a role in any of them.  —  But Joe Biden has long let it be known … ",
    "url": "https://amgreatness.com/2024/06/06/the-myth-that-biden-had-nothing-to-do-with-the-prosecutions-of-trump/"
  },
  {
    "text": "'It's Really Shameful': House Republicans Accuse Rep. Troy Nehls of Stolen Valor Over Military Award Pin … House Republicans are accusing Rep. Troy Nehls of “stolen valor” for continuing to wear a lapel pin for infantrymen or Special Forces who fought in active combat.  —  “It matters.",
    "url": "https://www.notus.org/congress/troy-nehls-combat-infantry-badge-pin-revoked"
  },
  {
    "text": "Tesla CEO Elon Musk could leave if $56 billion pay package not approved, shareholders warned … Tesla board chair Robyn Denholm is calling on the company's shareholders to approve Elon Musk's massive $56 billion pay package or risk driving the billionaire CEO to greener pastures.",
    "url": "https://www.theverge.com/2024/6/6/24173064/tesla-board-chair-warn-elon-musk-leave-pay-shareholders"
  },
  {
    "text": "Judge Noreika Risks Narrowing Hunter Biden's Right to Confront His Accuser Even Further  —  Gordon Cleveland, the man who sold Hunter Biden a gun without seeing an ID with an address on it on October 12, 2018, did not finish testifying at the Hunter Biden trial yesterday.",
    "url": "https://www.emptywheel.net/2024/06/06/judge-noreika-risks-narrowing-hunter-bidens-right-to-confront-his-accuser-even-further/"
  },
  {
    "text": "Trump: Critics saying I'd seek retribution are ‘wrong,’ but ‘I would have every right’ to go after opponents  —  Former President Trump told Fox News on Wednesday that critics claiming he'd seek retribution against political opponents are “wrong,” but he would have “every right” … ",
    "url": "https://www.foxnews.com/media/trump-addresses-concerns-he-would-seek-retribution-i-would-have-every-right-go-after-them"
  },
  {
    "text": "Alito's former neighbor says justice is ‘at best mistaken’ in flap over upside-down US flag  —  A former neighbor of Supreme Court Justice Samuel Alito on Wednesday disputed his account of a neighborhood spat that led to the hoisting of an upside-down US flag on his property in Virginia … ",
    "url": "https://www.cnn.com/2024/06/05/politics/alito-former-neighbor-flags-cnntv/"
  },
  {
    "text": "Milwaukee-based retail giant Kohl's says ‘No’ to sponsoring Republican convention events … Milwaukee based department store giant Kohl's says it will not sponsor any events related to the Republican National Convention in that city this summer, where Donald Trump will be crowned the party's nominee for president.",
    "url": "https://www.cnbc.com/2024/06/06/kohls-donation-trump-republican-national-convention.html"
  },
  {
    "text": "Exclusive: Cows infected with bird flu have died in five US states  —  Dairy cows infected with avian flu in five U.S. states have died or been slaughtered by farmers because they did not recover, state officials and academics told Reuters.  —  Reports of the deaths suggest the bird flu outbreak … ",
    "url": "https://www.reuters.com/world/us/cows-infected-with-bird-flu-have-died-five-us-states-2024-06-06/"
  },
  {
    "text": "Playbook: Biden in Normandy, WaPo in deeper turmoil  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  BIDEN SEEKS HIS ‘GIPPER’ MOMENT — Commemorations of the 80th anniversary of D-Day are underway in France, where President JOE BIDEN will speak today … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/06/06/biden-in-normandy-wapo-in-deeper-turmoil-00161979"
  },
  {
    "text": "Progressives Urge Biden to Push Harder on ‘Greedflation’  —  It's a moniker about corporate price increases that has bolstered some Democratic senators, and now the president is being encouraged to lean in on the issue for his economic messaging.  —  As high prices at grocery stores … ",
    "url": "https://www.nytimes.com/2024/06/06/us/politics/biden-inflation-greedflation-economy.html"
  },
  {
    "text": "Progressive Caucus rescinds endorsement of former Rep. Mondaire Jones  —  The Congressional Progressive Caucus PAC unendorsed one of its former members after the New York Democrat backed a primary rival to another progressive lawmaker.  —  WASHINGTON — The Congressional Progressive Caucus PAC … ",
    "url": "https://www.nbcnews.com/politics/2024-election/progressive-caucus-rescinds-endorsement-former-rep-mondaire-jones-rcna155754?taid=6661dd57acd5750001e05bec"
  }
]