[
  {
    "text": "The Hunter Biden story has done a total 180 but the MSM is in denial  —  The Hunter Biden impeachment drama has been transformed by the revelation that the most essential witness for the GOP is a pathological liar and Russian intelligence asset.  —  The story is no longer whether Joe Biden … ",
    "url": "https://presswatchers.org/2024/02/the-hunter-biden-story-has-done-a-total180-but-the-msm-is-in-denial/"
  },
  {
    "text": "Ex-FBI informant charged with lying about the Bidens is re-arrested as prosecutors fight to keep him behind bars  —  Alexander Smirnov, the former FBI informant indicted for lying about President Joe Biden's family and their alleged dealings in Ukraine, has been re-arrested in Nevada.",
    "url": "https://www.cnn.com/2024/02/22/politics/alexander-smirnov-re-arrested"
  },
  {
    "text": "'There's No Question This Is Dead': Biden Impeachment Inquiry Falls Apart  —  House Republicans reached a critical point this week in their bid to impeach Joe Biden: a closed-door interview with the President's younger brother James.  But the coveted testimony was dramatically overshadowed … ",
    "url": "https://time.com/6767653/biden-impeachment-fbi-informant-russia/"
  },
  {
    "text": "Can DC Reporters Overcome Their Trumper Shock-Training?  —  As I noted yesterday, the Alexander Smirnov news is either confirmation of what we already knew or else spurs a kind of mass outburst of incredulity about how it is we're still as a country, as a media, as a national political … ",
    "url": "https://talkingpointsmemo.com/edblog/can-dc-reporters-overcome-their-trumper-shock-training/sharetoken/KGBJRFFolANQ"
  },
  {
    "text": "A Trump Judge Under Scrutiny  —  Aileen Cannon is facing a series of tests in the classified documents case.  —  When Judge Aileen Cannon was handed the job last spring of overseeing Donald Trump's prosecution on charges of mishandling classified documents, she was already under fire.",
    "url": "https://www.nytimes.com/2024/02/22/us/politics/trump-trial-documents-cannon.html"
  },
  {
    "text": "Fight or flight: Fearful Trump critics weigh the risk of retribution if he's re-elected  —  Some are considering leaving the country if Trump returns to the White House or saving money to handle the expected legal costs.  —  WASHINGTON — If Donald Trump stood no chance of becoming president again … ",
    "url": "https://www.nbcnews.com/politics/2024-election/donald-trump-retribution-fear-rcna139497"
  },
  {
    "text": "Judge in Trump civil fraud case denies request to delay $355 million penalty  —  A New York judge presiding over former President Donald Trump's civil fraud case has denied his legal team's request to avoid paying a $355 million penalty in the case.  —  Trump lawyers had asked Judge Arthur Engoron … ",
    "url": "https://www.foxnews.com/politics/judge-trump-civil-fraud-case-denies-request-delay-355-million-penalty"
  },
  {
    "text": "How Trump is becoming more authoritarian  —  Donald Trump has been clear about his intentions to govern in a more authoritarian way if he's president again.  But what does that actually mean?  —  An authoritarian is someone who amasses power to amass more power, often exploiting gray areas … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/21/how-trump-is-becoming-more-authoritarian/"
  },
  {
    "text": "Scoop: Trump avoids precarious Maryland Senate race … - Hogan is a formidable candidate for Republicans, but he's already facing a tough issue on abortion, and his two gubernatorial wins came in years where Trump wasn't also on the ballot.  — Hogan told CNN that having Trump on the ballot would be a … ",
    "url": "https://www.axios.com/2024/02/23/hogan-trump-maryland-senate-race-2024-election"
  },
  {
    "text": "Tommy Tuberville On Alabama Deeming Embryos Children: Great!  Wait, Bad!  —  In the span of three minutes, the GOP senator said he was “all for it,” didn't agree with it, supports IVF and just needs to read the bill.  (There is no bill.)  —  LOADING  —  NATIONAL HARBOR, Md. … ",
    "url": "https://www.huffpost.com/entry/tommy-tubervile-alabama-supreme-court-embryos-children-ivf_n_65d78e1fe4b0cc1f2f7b1a81"
  },
  {
    "text": "Scoop: House GOP rushes to distance from Alabama IVF ruling … - “We should do everything we can to protect IVF for women everywhere,” Rep. Nancy Mace (R-S.C.) told Axios. … - Mace has variably criticized and supported her party's pro-life positions, often warning that overly strict policies will cost the GOP key elections.",
    "url": "https://www.axios.com/2024/02/22/house-republicans-alabama-ivf-ruling"
  },
  {
    "text": "CBS faces uproar after seizing investigative journalist's files  —  “Anyone who isn't confused really doesn't understand the situation.”  Those words, from CBS icon Edward R. Murrow, came to mind this week after I spoke with journalists at the network.  —  There is trouble brewing at Black Rock … ",
    "url": "https://thehill.com/opinion/campaign/4481433-cbs-faces-uproar-after-seizing-investigative-journalists-files/"
  },
  {
    "text": "To collect $1.5B from Alex Jones, Sandy Hook families vote to liquidate assets  —  In order to collect on the $1.5 billion in defamation judgments they won against Alex Jones, the families of the victims of the massacre at Sandy Hook Elementary School in Connecticut have voted to liquidate the far-right conspiracy theorist's assets.",
    "url": "https://lawandcrime.com/high-profile/to-collect-1-5b-from-alex-jones-sandy-hook-families-vote-to-liquidate-assets/"
  },
  {
    "text": "Fetterman to Democrats criticizing Biden: ‘Get your MAGA hat’  —  Sen. John Fetterman (D-Pa.) panned Democrats who are upping their criticisms of President Biden ahead of the November election, saying they might as well don a “MAGA hat.”  —  Fetterman noted during an interview an uptick … ",
    "url": "https://thehill.com/homenews/senate/4482892-fetterman-to-democrats-criticizing-biden-get-your-maga-hat/"
  },
  {
    "text": "Judge denies Trump's request to delay enforcement of $355M fraud case penalties  —  Trump's lawyers had requested a 30-day delay in the enforcement of penalties.  —  In this Oct. 4, 2023, file photo, former President Donald Trump attends the third day of his civil fraud trial in New York.",
    "url": "https://abcnews.go.com/Politics/trump-asks-judge-delay-penalties-civil-fraud-case/story?id=107433418"
  },
  {
    "text": "Journalist Tim Burke Indicted For Leaking Tucker Carlson Clips That Embarrassed Fox News  —  The clips, which included unaired, antisemitic remarks by Kanye West, were published by Vice and Media Matters  —  TIM BURKE, A freelance journalist and media consultant, has been charged with 14 federal crimes, including conspiracy.",
    "url": "https://www.rollingstone.com/politics/politics-news/tim-burke-indicted-tucker-carlson-fox-news-kanye-1234973771/"
  },
  {
    "text": "Inside the G.O.P.'s State Party Problem  —  Financial woes and other issues in state parties in crucial swing states such as Arizona and Michigan have caused deepening concern among top Republican officials.  —  State Republican parties in roughly half of the most important battleground states … ",
    "url": "https://www.nytimes.com/2024/02/22/us/politics/gop-state-party-dysfunction.html"
  },
  {
    "text": "Bidenomics Is Still Working Very Well  —  The economic news in 2023 was almost miraculously good.  Not only did America's economy defy widespread predictions of recession, it also defied claims that only a significant rise in unemployment could bring inflation under control.",
    "url": "https://www.nytimes.com/2024/02/22/opinion/biden-economy.html"
  },
  {
    "text": "Bewildered Conservatives Greet a Fallen British Prime Minister  —  Former British Prime Minister Liz Truss spoke in a hotel conference room that was less than half full.  —  Former British Prime Minister Liz Truss speaks during the Conservative Political Action Conference at the National Harbor in Oxon Hill, Md. on Feb. 22, 2024.",
    "url": "https://www.politico.com/news/magazine/2024/02/22/truss-at-cpac-00142807"
  },
  {
    "text": "Court battle reveals effort to undermine No Labels presidential bid  —  Liberal activists took over the website NoLabels.com with plans for mischief.  The group sees a larger conspiracy.  —  WILMINGTON.  — Political operatives opposed to No Labels' potential 2024 presidential ticket took … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/22/no-labels-lawsuit-election/"
  },
  {
    "text": "Biden meets Alexei Navalny's widow and daughter in California  —  President Biden on Thursday met in California with the widow and daughter of Alexei Navalny, the prominent Russian opposition figure whose sudden death in jail last week is being blamed on Russian President Vladimir Putin.",
    "url": "https://thehill.com/policy/international/4483626-biden-alexei-navalny-navalnaya-california/"
  },
  {
    "text": "New Tennessee law allows officials to refuse to perform same-sex marriages  —  The law, less than half a page long, states that a person “shall not be required to solemnize a marriage,” but does not specify grounds for refusal.  —  Tennessee Gov. Bill Lee signed a new law Wednesday … ",
    "url": "https://www.nbcnews.com/nbc-out/out-politics-and-policy/new-tennessee-law-allows-officials-refuse-perform-sex-marriages-rcna140011"
  },
  {
    "text": "School punishment for Black student's hair is legal in CROWN Act lawsuit, judge rules  —  The CROWN Act prohibits race-based hair discrimination.  —  In this Sept. 18, 2023, file photo, Darryl George, a 17-year-old junior, walks across the street to go into Barbers Hill High School after serving … ",
    "url": "https://abcnews.go.com/US/judge-school-punishment-black-students-hair-legal-crown/story?id=107451979"
  },
  {
    "text": "Alabama justice who ruled embryos are people says American law should be rooted in the Bible  —  Tom Parker, chief justice of the Alabama Supreme Court, expressed his support for the Seven Mountains Mandate, a once-fringe philosophy that calls on evangelical Christians to reshape American law and society based on their beliefs.",
    "url": "https://www.nbcnews.com/news/us-news/alabama-justice-embryos-biblical-seven-mountains-rcna139969"
  },
  {
    "text": "Inside the Christian Nationalist Church Where Proud Boys Go to be Baptized  —  Southern California pastor Hansel Orzame leads an “unwoke church” where he prepares his followers to wage “spiritual warfare.”  —  On a recent Sunday, a man dressed in basketball shorts and a black and yellow T-shirt that read … ",
    "url": "https://www.vice.com/en/article/3akex5/hansel-orzame-proud-boys-church-christian-nationalism"
  }
]