[
  {
    "text": "GOP senators defy Trump by advancing foreign aid bill  —  The vote was a decisive 67-27.  —  Donald Trump spent the weekend telling senators they should not pass more unconditional U.S. foreign aid.  More than a dozen Republicans ignored him Sunday, moving forward on a bill to send $95 billion in aid to Ukraine, Israel and Taiwan.",
    "url": "https://www.politico.com/news/2024/02/11/gop-senators-defy-trump-by-advancing-foreign-aid-00140868"
  },
  {
    "text": "Trump says he would ‘encourage’ Russia to attack Nato allies who do not pay their bills  —  Watch: Trump would not protect countries from attack by Russia if they do not pay enough into Nato  —  Donald Trump has said he would “encourage” Russia to attack any Nato member that fails to pay … ",
    "url": "https://www.bbc.com/news/world-us-canada-68266447"
  },
  {
    "text": "Favoring Foes Over Friends, Trump Threatens to Upend International Order  —  Former President Donald J. Trump suggested that he would incite Russia to attack “delinquent” U.S. allies, foreshadowing potentially far-reaching changes in the world order if he wins the White House again.",
    "url": "https://www.nytimes.com/2024/02/11/us/politics/trump-nato.html"
  },
  {
    "text": "Nato chief says Donald Trump comments ‘undermine all of our security’  —  Watch: Trump would not protect countries from attack by Russia if they do not pay enough into Nato  —  Donald Trump's suggestion the US would not protect Nato allies failing to spend enough on defence … ",
    "url": "https://www.bbc.com/news/world-us-canada-68269354"
  },
  {
    "text": "‘Enough to make Reagan ill’: Trump's NATO remarks under fire  —  “Honestly this seems kinda important,” said Sen. Brian Schatz.  —  Democrats and some Republicans were quick to condemn Donald Trump after the former president said Saturday night he would “encourage” Russia to attack … ",
    "url": "https://www.politico.com/news/2024/02/11/trump-nato-remarks-democrats-putin-00140848"
  },
  {
    "text": "Trump says he wouldn't defend NATO allies from Russia if they're ‘delinquent’  —  CONWAY, S.C. - Former President Donald Trump said America would not defend NATO allies against Russia if they did not meet his definition of contributing enough defense spending, threatening to upend the alliance if elected president again in 2024.",
    "url": "https://www.npr.org/2024/02/11/1230658309/trump-would-encourage-russia-to-attack-nato-allies-who-dont-pay-bills"
  },
  {
    "text": "Inside Trump's plans to deport millions from the U.S. … - If elected, Trump wants to mobilize ICE agents — along with the FBI, the Drug Enforcement Administration, federal prosecutors, the National Guard, and even state and local law enforcement officers — to carry out deportations … ",
    "url": "https://www.axios.com/2024/02/11/trump-promise-deport-millions-migrants-reality"
  },
  {
    "text": "‘But His Memory’ and the slow train wreck of American democracy  —  Some night around the year 2064, when the ragtag children of the last historians huddle around a cave fire and mix up some berries and the blood of their groundhog dinner to paint crude images of what the heck ever happened … ",
    "url": "https://www.inquirer.com/opinion/commentary/biden-memory-trump-supreme-court-20240211.html"
  },
  {
    "text": "Trump says 'there's no way' Taylor Swift will endorse Biden  —  Former President Trump on Sunday poured cold water on the idea global superstar Taylor Swift would endorse President Biden amid swirling speculation the incumbent's campaign team is trying to secure the endorsement of the pop singer.",
    "url": "https://thehill.com/homenews/campaign/4461575-trump-says-theres-no-way-taylor-swift-will-endorse-biden/"
  },
  {
    "text": "Overwhelming majority of Americans think Biden is too old for another term: POLL  —  A majority also think Trump is too old for a second term.  —  President Joe Biden delivers remarks in the State Dining Room of the White House in Washington, D.C., on Feb. 6, 2024.",
    "url": "https://abcnews.go.com/Politics/poll-americans-on-biden-age/story?id=107126589"
  },
  {
    "text": "Statement From Pentagon Press Secretary Maj. Gen. Pat Ryder on Secretary of Defense Lloyd J. Austin III's Health Status  —  Pentagon Press Secretary Maj. Gen. Pat Ryder provided the following statement:  —  Today, at approximately 2:20 pm, Secretary of Defense Lloyd J. Austin III was transported … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3673016/statement-from-pentagon-press-secretary-maj-gen-pat-ryder-on-secretary-of-defen/"
  },
  {
    "text": "Defense Secretary Lloyd Austin taken to hospital again, for potential ‘emergent bladder issue’  —  “The Secretary is retaining the functions and duties of his office.”  —  U.S. Defense Secretary Lloyd Austin delivers remarks during a meeting with Kenyan Defense Minister Aden Duale at the Pentagon on Feb. 07, 2024 in Arlington, Va.",
    "url": "https://abcnews.go.com/Politics/defense-secretary-lloyd-austin-hospitalized-potential-emergent-bladder/story?id=107142946"
  },
  {
    "text": "Biden moving closer to a breach with Netanyahu over war in Gaza  —  Some of Biden's aides are urging him to publicly criticize the Israeli prime minister as casualties mount  —  President Biden and his top aides are closer to a breach with Israeli Prime Minister Benjamin Netanyahu … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/11/biden-netanyahu-closer-to-a-breach/"
  },
  {
    "text": "Readout of President Biden's Call with Prime Minister Netanyahu of Israel  —  President Joseph R. Biden, Jr. spoke this morning with Prime Minister Benjamin Netanyahu of Israel.  The President reaffirmed our shared goal to see Hamas defeated and to ensure the long-term security of Israel and its people.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/11/readout-of-president-bidens-call-with-prime-minister-netanyahu-of-israel-11/"
  }
]