[
  {
    "text": "Democratic Senator Says He Will Stall Trump Nominees Until USAID Is Back  —  Schatz said he would hold up Trump's diplomatic confirmations  —  WASHINGTON—Sen. Brian Schatz (D., Hawaii) said he would place a “blanket hold” on all of President Trump's State Department nominees until … ",
    "url": "https://www.wsj.com/politics/policy/democratic-senator-says-he-will-block-trump-nominees-until-usaid-is-back-94f8699e?st=iRCZyy&reflink=article_copyURL_share"
  },
  {
    "text": "USAID workers at Washington HQ told to stay home on Monday in unexpected, early-morning email  —  The main office of the US Agency for International Development in Washington was unexpectedly closed Monday and workers were emailed shortly after midnight that they should not come in … ",
    "url": "https://www.cnn.com/2025/02/03/politics/usaid-washington-workers/"
  },
  {
    "text": "Democrats push back after Musk says Trump agrees to close USAID and workers are kept out  —  Democrats have delivered a strong rebuke against the Trump administration's attempts to gut an agency that provides crucial aid overseas to fund education and fight starvation and disease … ",
    "url": "https://apnews.com/article/trump-musk-usaid-c0c7799be0b2fa7cad4c806565985fe2"
  },
  {
    "text": "Trump Administration Closes USAID Headquarters  —  Monday closure comes as Elon Musk and DOGE are pushing to get rid of foreign-assistance agency  —  WASHINGTON—The U.S. Agency for International Development closed its headquarters to agency personnel on Monday following moves … ",
    "url": "https://www.wsj.com/politics/policy/trump-administration-shutters-usaid-headquarters-db3fac7e?st=DmHRG2&reflink=article_copyURL_share"
  },
  {
    "text": "White House: Mexico is ‘serious’, Canada appears to have ‘misunderstood’ Trump's executive order  —  The White House said on Monday it has noticed that Mexico is “serious” about President Donald Trump's executive order on tariffs but Canada has “misunderstood” it.",
    "url": "https://www.reuters.com/world/americas/white-house-mexico-is-serious-canada-appears-have-misunderstood-trumps-executive-2025-02-03/"
  },
  {
    "text": "Live Updates: Mexico Reaches Deal With U.S. to Delay Trump Tariffs  —  President Trump said he would pause tariffs on Mexico for a month, but levies on Canada and China were still set to take effect on Tuesday.  U.S. shares fell at the opening bell, following drops in Asian and European markets, amid fears of a trade war.",
    "url": "https://www.nytimes.com/live/2025/02/03/us/trump-tariffs"
  },
  {
    "text": "‘Trump will screw up’: Schumer plots the Democratic comeback  —  Chuck Schumer's advice for Democrats staring at a long two or more years out of power: Just wait.  —  “Trump will screw up,” he told Semafor in an interview.  —  The Senate minority leader and his 47-member caucus finally got … ",
    "url": "https://www.semafor.com/article/02/02/2025/trump-will-screw-up-schumer-plots-the-democratic-comeback"
  },
  {
    "text": "Primary Every Democrat  —  I spent almost a decade covering the United States Senate.  So, believe me when I tell you that I do not want to be a United States senator.  Imagine having a job where your mere existence in the role is a symbol of democratic backsliding, where your leaders torture … ",
    "url": "https://newrepublic.com/article/190922/primary-every-democrat-trump-durbin"
  },
  {
    "text": "Warren Questions Bessent Over Musk Access to Treasury Payment System  —  In a letter to the Treasury secretary, the Democratic senator warned against meddling with a system that processes trillions of dollars of transactions.  —  Senator Elizabeth Warren of Massachusetts sent a letter … ",
    "url": "https://www.nytimes.com/2025/02/03/us/politics/warren-bessent-treasury-musk-doge.html"
  },
  {
    "text": "I'm a Federal Worker.  Elon Musk's Government Data Heist Is the Entire Ballgame.  —  On Friday night, reports emerged that Elon Musk's aides had tussled with Office of Personnel Management and Treasury staffers while demanding access to troves of information about federal employees.",
    "url": "https://slate.com/news-and-politics/2025/02/elon-musk-us-aid-social-security-data-heist-trump.html"
  },
  {
    "text": "Musk associates given unfettered access to private data of government employees  —  Several of Elon Musk's associates installed at the Office of Personnel Management (OPM) have received unprecedented access to federal human resources databases containing sensitive personal information for millions of federal employees.",
    "url": "https://popular.info/p/musk-associates-given-unfettered"
  },
  {
    "text": "Trump orders creation of US sovereign wealth fund, says it could buy TikTok  —  U.S. President Donald Trump signed an executive order on Monday ordering the U.S. Treasury and Commerce Departments to create a sovereign wealth fund and said it may purchase TikTok.  —  “We're going to stand this thing up within the next 12 months.",
    "url": "https://www.reuters.com/markets/wealth/trump-signs-executive-order-create-sovereign-wealth-fund-2025-02-03/"
  },
  {
    "text": "Ford ‘ripping up’ Ontario's $100M contract with Elon Musk's Starlink in wake of U.S. tariffs  —  Musk part of President Donald Trump's team that wants to destroy families, Ford says  —  Progressive Conservative Leader Doug Ford is “ripping up” Ontario's nearly $100 million contract … ",
    "url": "https://www.cbc.ca/news/canada/toronto/ford-ripping-up-province-contract-with-starlink-1.7448763"
  },
  {
    "text": "CFPB halts work after Trump appoints Bessent as acting head  —  The consumer watchdog agency was formed in the wake of the 2008 financial crisis.  Elon Musk wants to “delete” it.  —  President Donald Trump on Monday appointed Treasury Secretary Scott Bessent as the acting director … ",
    "url": "https://www.washingtonpost.com/business/2025/02/03/trump-cfpb-bessent-halt/"
  },
  {
    "text": "DOJ Says Trump Administration Doesn't Have to Follow Court Order Halting Funding Freeze  —  The U.S. Department of Justice (DOJ) argued Monday that a federal court order blocking President Donald Trump's federal funding freeze doesn't halt the administration's efforts.",
    "url": "https://www.democracydocket.com/news-alerts/doj-says-trump-administration-doesnt-have-to-follow-court-order-halting-funding-freeze/"
  },
  {
    "text": "The Twitter Files Playbook Comes For The US Government  —  Remember the Twitter Files?  That carefully orchestrated “exposé” where incredibly gullible hand-picked journalists were given selective access to internal documents to manufacture misleading outrage about Twitter's content moderation?",
    "url": "https://www.techdirt.com/2025/02/03/the-twitter-files-playbook-comes-for-the-us-government/"
  },
  {
    "text": "Trump plans to invoke obscure 18th century wartime law in bid for mass deportations  —  President Donald Trump is set to test the limits of his immigration crackdown by invoking a wartime law to deport immigrants alleged to be gang members without court hearings, a broad authority … ",
    "url": "https://www.reuters.com/world/us/trump-plans-invoke-obscure-18th-century-wartime-law-bid-mass-deportations-2025-02-03/"
  },
  {
    "text": "Exclusive: Trump's meme coin made nearly $100 million in trading fees, as small traders lost money  —  Entities behind President Donald Trump's crypto coin have accumulated close to $100 million in trading fees in less than two weeks, according to estimates from three blockchain analysis firms … ",
    "url": "https://www.reuters.com/markets/currencies/trumps-meme-coin-made-nearly-100-million-trading-fees-small-traders-lost-money-2025-02-03/"
  },
  {
    "text": "N.Y. Attorney General Warns Hospitals Against Canceling Transgender Care  —  A White House executive order last week threatened to pull federal funding from hospitals that provide gender-affirming care.  But not providing the care could violate state law, Letitia James said in a letter on Monday.",
    "url": "https://www.nytimes.com/2025/02/03/nyregion/ny-attorney-general-transgender-care.html?unlocked_article_code=1.uE4.HvjA.s2RsEbp65qxV"
  }
]