[
  {
    "text": "Scoop: VC titan Ben Horowitz plans “significant” donation to Kamala Harris … - At the time, President Biden was still running for re-election. … - He notes that he and Felicia have known Harris for more than a decade, and she's been “a great friend to both of us over that time.”",
    "url": "https://www.axios.com/2024/10/04/ben-horowitz-endorse-kamala-harris"
  },
  {
    "text": "‘Trump Bible’ one of few that meet Walters' criteria for Oklahoma classrooms  —  Jennifer Palmer, Paul Monies, Heather WarlickOklahoma Watch  —  Superintendent Ryan Walters isn't just talking about buying Bibles for schools.  —  Bids opened Monday for a contract to supply the state Department of Education with 55,000 Bibles.",
    "url": "https://www.oklahoman.com/story/news/2024/10/04/donald-trump-supported-bible-one-of-few-that-meets-ryan-walters-criteria-for-ok-classrooms/75510021007/"
  },
  {
    "text": "Okla. is buying schools 55,000 Bibles.  Specs match the $60 Trump Bible.  —  The state put out a bid for leather-bound Bibles with U.S. founding documents.  Few, if any, such Bibles are currently for sale besides a Bible endorsed by Trump.  —  The state of Oklahoma wants to buy 55,000 classroom Bibles … ",
    "url": "https://www.washingtonpost.com/education/2024/10/04/oklahoma-schools-trump-bible/"
  },
  {
    "text": "Donald Trump's foul-mouthed migrant rant captured in private pitch to donors  —  Republican nominee claims Harris is threat to democracy in recording of top-dollar fundraiser in Colorado in August  —  Donald Trump unleashed a foul-mouthed tirade about undocumented immigrants and predicted that this … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/04/trump-fundraiser-recording"
  },
  {
    "text": "Trump Made Crass Jokes About Death of Rally Attendee in Leaked Recording  —  DUDE, NO  —  The 12-minute tape, reportedly from a dinner with donors in August, also features Trump launching into an expletive-laden rant against undocumented migrants.  —  Donald Trump was reportedly caught … ",
    "url": "https://www.thedailybeast.com/donald-trump-made-crass-jokes-about-death-of-corey-comparatore-in-leaked-recording"
  },
  {
    "text": "Trump pledges to rename Army base after Confederate general  —  Fort Liberty, previously known as Fort Bragg, was renamed in 2022 as part of a sweeping Army push to change the names of installations honoring Confederate soldiers.  —  Donald Trump says that North Carolina's Fort Liberty … ",
    "url": "https://www.politico.com/news/2024/10/04/trump-rename-army-confederate-general-00182606"
  },
  {
    "text": "Do the Math: Trump Is Toast  —  If everyone does their part in the next few weeks, Trump is going down in flames.  So say I.  —  Right now, if you know how to really read the polls, or if you have access to the various private and internal polling being conducted by and shared only amongst the elites … ",
    "url": "https://www.michaelmoore.com/p/do-the-math-trump-is-toast"
  },
  {
    "text": "Minnesota GOP Senate candidate: ‘The bad guys won in WWII’  —  As the control of the Senate hangs in the balance, GOP candidates across the country are facing a similar problem: Troubling and bizarre past statements, both in-person and on social media, are coming back to haunt them.",
    "url": "https://heartlandsignal.com/2024/10/04/minnesota-gop-senate-candidate-the-bad-guys-won-in-wwii/"
  },
  {
    "text": "From the Willard to Danbury Correctional: Steve Bannon Allegedly Joins the Conspiracy  —  One of Danbury's Federal Correctional Institution's most illustrious residents likely discovered on Wednesday that he had been promoted.  —  Steve Bannon is now P1, a feature player in Jack Smith's latest description … ",
    "url": "https://www.emptywheel.net/2024/10/04/from-the-willard-to-danbury-correctional-steve-bannon-allegedly-joins-the-conspiracy/"
  },
  {
    "text": "Helene hit Trump strongholds in Georgia and North Carolina.  It could swing the election.  —  Officials in both swing states face urgent decisions about helping people vote in shattered communities.  —  Hurricane Helene hit especially hard in heavily Republican areas of Georgia and North Carolina … ",
    "url": "https://www.politico.com/news/2024/10/04/helene-trump-georgia-north-carolina-elections-00182448"
  },
  {
    "text": "Some of Our Top Schools Are Embarrassing Themselves Over Covid  —  Why are places like Stanford and Johns Hopkins hosting gatherings of well-known coronavirus cranks?  —  Pocket  —  Today, Stanford University is holding an all-day gathering on the Covid pandemic, with its new president making opening remarks.",
    "url": "https://www.thenation.com/article/society/stanford-covid-symposium-misinformation/"
  },
  {
    "text": "Jamie Dimon denies Trump's claim that JPMorgan CEO has endorsed him … JPMorgan Chase on Friday flatly denied that its CEO, Jamie Dimon, has endorsed Donald Trump for president, minutes after the Republican nominee claimed on social media that Dimon had endorsed him.  —  “Jamie Dimon has not endorsed anyone.",
    "url": "https://www.cnbc.com/2024/10/04/trump-jamie-dimon-endorsement-jpmorgan.html"
  },
  {
    "text": "How Biden helped end a port strike that threatened Democrats in November  —  With early morning Zoom calls and a surprising ultimatum, the White House brain trust averted a potential economic disaster weeks before the election.  —  It was a stark ultimatum, delivered by President Joe Biden's most senior aide.",
    "url": "https://www.washingtonpost.com/business/2024/10/04/biden-white-house-harris-port-strike/"
  },
  {
    "text": "Bruce Springsteen Backs Harris and Blasts Trump Out of This World  —  Yesterday, rock legend Bruce Springsteen endorsed Kamala Harris for President.  —  In an Instagram video that instantly went viral, Springsteen said, “Kamala Harris and Tim Walz are committed to a vision of this country … ",
    "url": "https://www.dworkinsubstack.com/p/bruce-springsteen-backs-harris-and"
  },
  {
    "text": "Michele Fiore convicted by jury in wire fraud case  —  LAS VEGAS (KLAS) — A jury convicted Pahrump Justice of the Peace Michele Fiore on all counts in a federal wire fraud case on Thursday.  —  Fiore, currently suspended from her Pahrump duties, was charged with one count of conspiracy … ",
    "url": "https://www.8newsnow.com/investigators/michele-fiore-convicted-by-jury-in-wire-fraud-case/"
  },
  {
    "text": "Harris' campaign plans to ramp up its negative messaging against Trump  —  The new phase in the final weeks of the presidential campaign is aimed at trying to persuade undecided voters to support the vice president, Harris aides said.  —  WASHINGTON — Vice President Kamala Harris' campaign … ",
    "url": "https://www.nbcnews.com/politics/2024-election/harris-campaign-plans-ramp-negative-messaging-trump-rcna174039"
  },
  {
    "text": "NYC Deputy Mayor Sheena Wright, Adams' right hand, set to resign in latest City Hall turmoil  —  First Deputy Mayor Sheena Wright will be forced to resign as soon as Friday, The Post has learned — the latest high-level exit from Mayor Eric Adams' increasingly troubled administration.",
    "url": "https://nypost.com/2024/10/04/us-news/nyc-deputy-mayor-sheena-wright-adams-right-hand-set-to-resign-in-latest-city-hall-turmoil/"
  },
  {
    "text": "Conservatives look to end — or replace — Miami teachers union  —  A historic vote in Miami-Dade could result in no teachers union at all in the county — or one backed by an enemy of organized labor.  —  TALLAHASSEE, Florida — Florida Republicans could strike a major blow … ",
    "url": "https://www.politico.com/news/2024/10/04/conservatives-look-end-replace-miami-teachers-union-00182246"
  },
  {
    "text": "The ‘News Avoiders’ who could decide 2024  —  TUNED OUT — If you are reading this edition of Nightly, you are probably not a News Avoider.  —  And yes, News Avoiders are a thing.  —  Even during a wild, close presidential election where unknown numbers of Americans are compulsively checking … ",
    "url": "https://www.politico.com/newsletters/politico-nightly/2024/10/03/the-news-avoiders-who-could-decide-2024-00182446"
  },
  {
    "text": "Are You Ready for Another Bush v. Gore?  The Supreme Court Is.  —  How Trump could win, thanks to just five votes.  —  The Supreme Court will begin a new term on Monday, in which it is set to hear pivotal cases about transgender rights, our environment, and gun violence.",
    "url": "https://www.motherjones.com/politics/2024/10/supreme-court-2024-election-donald-trump/"
  },
  {
    "text": "Harris joined ‘Call Her Daddy’ podcast to talk abortion rights  —  Vice President Harris joined host Alex Cooper on her popular “Call Her Daddy” podcast for a discussion on reproductive rights, the campaign told The Hill.  —  She sat Tuesday for the popular podcast among young, female listeners … ",
    "url": "https://thehill.com/homenews/campaign/4917021-harris-call-her-daddy-podcast/"
  },
  {
    "text": "Kamala Harris's Wall Street charm offensive begins to pay off  —  Vice-president builds ties with finance bosses in attempt to quell support for Trump  —  Wall Street is warming to US presidential candidate Kamala Harris after weeks of behind-the-scenes courting between donors and her campaign … ",
    "url": "https://www.ft.com/content/2941e79d-cdc0-457e-a7a3-9c08f1f6e635"
  },
  {
    "text": "Blowout US employment report reinforces economy's resilience  —  U.S. job gains increased by the most in six months in September and the unemployment rate fell to 4.1%, pointing to a resilient economy that likely does not need the Federal Reserve to deliver large interest rate cuts for the rest of this year.",
    "url": "https://www.reuters.com/markets/us/us-job-growth-surges-september-unemployment-rate-falls-41-2024-10-04/"
  },
  {
    "text": "Hurricane Helene: Rumor Response  —  Help keep yourself, your family and your community safe after Hurricane Helene by being aware of rumors and scams and sharing official information from trusted sources.  —  Do your part to the stop the spread of rumors by doing three easy things:",
    "url": "https://www.fema.gov/disaster/current/hurricane-helene/rumor-response"
  },
  {
    "text": "As fraud scandals erupt in Minnesota on Gov. Tim Walz's watch, accountability is in short supply  —  One state audit found that bonus checks intended for frontline workers during the pandemic were handed out to undeserving recipients.  Another criticized a Minnesota state agency for failing … ",
    "url": "https://www.cnn.com/2024/10/04/politics/walz-audits-fraud-accountability-invs/"
  },
  {
    "text": "Letter to Congress on Disaster Needs  —  Dear Speaker Johnson and Leaders Schumer, McConnell, and Jeffries,  —  I write to you regarding the needs of the Nation.  As communities across the Southeast devastated by Hurricane Helene assess the extent of the damage, they are expecting … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/10/04/letter-to-congress-on-disaster-needs/"
  },
  {
    "text": "Harris meets with Arab American and Muslim leaders in Michigan  —  Vice President Harris met with leaders from the Muslim and Arab American community while in Flint, Mich., on Friday amid the ongoing war in the Middle East and shrinking support for Democrats from the community.",
    "url": "https://thehill.com/homenews/campaign/4916848-harris-meets-arab-muslim-leaders-michigan/"
  },
  {
    "text": "No, Biden didn't take FEMA relief money to use on migrants — but Trump did  —  Donald Trump falsely accuses President Biden of redirecting disaster funds, a budget maneuver Trump himself approved in 2019. … — Former president Donald Trump, remarks at a campaign rally in Saginaw, Mich., Oct. 3",
    "url": "https://www.washingtonpost.com/politics/2024/10/04/no-biden-didnt-take-fema-relief-money-use-migrants-trump-did/"
  },
  {
    "text": "As America's Marijuana Use Grows, So Do the Harms  —  The drug, legal in much of the country, is widely seen as nonaddictive and safe.  For some users, these assumptions are dangerously wrong.  —  In midcoast Maine, a pediatrician sees teenagers so dependent on cannabis that they consume … ",
    "url": "https://www.nytimes.com/2024/10/04/us/cannabis-marijuana-risks-addiction.html"
  },
  {
    "text": "Californians' backing of Prop. 36 remains solid.  —  But many voters support rehabilitation and treatment for first-time offenders among other options as the best way to improve the criminal justice system moving forward  —  With one month remaining before the state's November 5 general election … ",
    "url": "https://mailchi.mp/berkeley.edu/berkeley-igs-poll-2024-16-state-ballot-props?e=258e3e67dd"
  },
  {
    "text": "South Carolina Voter Registration Deadline Extended After Hurricane Helene  —  A trial judge in South Carolina extended the state's voter registration to Oct. 14  as a result of a lawsuit filed by the South Carolina Democratic Party due to Hurricane Helene.  —  The lawsuit, filed on Oct. 3 … ",
    "url": "https://www.democracydocket.com/news-alerts/south-carolina-voter-registration-deadline-extended-after-hurricane-helene/"
  },
  {
    "text": "Jack Smith's October Cheap Shot  —  Jack Smith has failed in his quest to try Donald Trump before the 2024 election.  So instead, the special counsel has bent ordinary procedure to get in one last shot, just weeks before voters go to the polls.  —  Smith has now dropped a 165-page doorstop … ",
    "url": "https://nymag.com/intelligencer/article/jack-smith-october-surprise-donald-trump.html"
  }
]