[
  {
    "text": "House Republicans: No Aid for Israel Unless Rich Tax Cheats Get a Break … A few years ago, Representative Mike Johnson, now Speaker of the House, told an audience that democracy is bad.  “By the way, the United States is not a democracy,” he explained.  “Do you know what a democracy is?",
    "url": "https://nymag.com/intelligencer/2023/10/house-gop-no-israel-aid-unless-rich-tax-cheats-get-a-break.html"
  },
  {
    "text": "In his first act, Speaker Mike Johnson uses Israel aid to pick a fight with Joe Biden  —  The newly minted Republican speaker is seeking to pay for aid to Israel by slashing $14.3 billion from IRS funds in the Democratic president's signature law.  —  WASHINGTON — In his first major move … ",
    "url": "https://www.nbcnews.com/politics/congress/speaker-mike-johnson-israel-aid-fight-biden-irs-rcna122868"
  },
  {
    "text": "3 Expert Shoemakers Say Ron DeSantis Is Probably Wearing Height Boosters  —  The internet has questions about the governor's boots.  So I asked the experts.  —  In the last few weeks, posts mocking Florida Gov. Ron DeSantis' strangely shaped cowboy boots have racked up millions of views … ",
    "url": "https://www.politico.com/news/magazine/2023/10/31/desantis-boots-shoemakers-00121044"
  },
  {
    "text": "“It Was Always Going to End Badly”: The Untold Story of Tucker Carlson's Ugly Exit From Fox News  —  Fox never explained that abrupt firing of cable news' biggest star, allowing conspiracy theories to fester.  Now, in his new book, Network of Lies, Brian Stelter explores the myriad factors contributing to Carlson's cancellation.",
    "url": "https://www.vanityfair.com/news/2023/10/tucker-carlsons-ugly-exit-from-fox-news"
  },
  {
    "text": "Former GOP Rep. Kinzinger Says Family Member Disowned Him Via ‘Certified Letter’  —  Kinzinger, a prominent Republican critic of Trump, said his family took issues with his refusal to support the former president  —  Former Rep. Adam Kinzinger, R-Ill., said he was disowned by some family members … ",
    "url": "https://themessenger.com/politics/former-gop-rep-kinzinger-says-family-member-disowned-him-via-certified-letter"
  },
  {
    "text": "Kinzinger says family disowned him over loss of Hannity's trust  —  Former Rep. Adam Kinzinger (R-Ill.) said he was disowned by his family after he left Congress and “lost the trust” of Fox News host Sean Hannity.  —  “So, I had family that sent a certified letter disowning me,” Kinzinger said in a CNN interview Monday.",
    "url": "https://thehill.com/homenews/4285023-adam-kinzinger-family-disowned-sean-hannity/"
  },
  {
    "text": "Hedge fund billionaire Leon Cooperman, in rare public rebuke of a Republican candidate, says Trump ‘belongs in jail’  —  New York CNN  —  Leon Cooperman, the hedge fund billionaire who has famously clashed with Sen. Elizabeth Warren over her proposed wealth tax, is cautioning voters … ",
    "url": "https://www.cnn.com/2023/10/30/investing/leon-cooperman-trump-biden/"
  },
  {
    "text": "Rep. Earl Blumenauer to retire after nearly three decades in Congress  —  Rep. Earl Blumenauer (D-Ore.), who has spent nearly three decades in Congress, announced Monday night that he does not plan to seek reelection next year.  —  “I have dedicated my career to creating livable communities … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/31/earl-blumenauer-retirement-congress/"
  },
  {
    "text": "Senate Dems plan to subpoena conservative justices' billionaire patrons … - “[I]t is imperative that we understand the full extent of how people with interests before the Court are able to use undisclosed gifts to gain private access to the justices,” the senators said.",
    "url": "https://www.axios.com/2023/10/31/democrats-supoena-harlan-crow-leonard-leo-supreme-court-justices"
  },
  {
    "text": "Top UN official in New York resigns and accuses body of supporting Israel  —  Craig Mokhiber, United Nations Human Rights office director in New York, has resigned from his position in protest of Israel's counterattacks in the Gaza Strip, calling it “a text-book case of genocide.”",
    "url": "https://www.washingtonexaminer.com/policy/foreign/top-un-official-new-york-resigns-accuses-body-supporting-israel"
  },
  {
    "text": "Mike Johnson Has a Dangerous Victim Complex  —  “Christ calls us to be ‘wise as serpents and harmless as doves,’” wrote Mike Johnson on a Creationist website in 2015.  Johnson, who became speaker of the House last week, was counseling his fellow Christians on how to live in a new and … ",
    "url": "https://newrepublic.com/article/176509/mike-johnson-dangerous-victim-complex"
  },
  {
    "text": "CNN Poll: Trump dominates South Carolina GOP primary, with Haley a clear but distant second  —  Former President Donald Trump currently holds majority support in the early primary state of South Carolina, where his strongest challenger is Nikki Haley, the state's former governor, according to a new CNN poll conducted by SSRS.",
    "url": "https://www.cnn.com/2023/10/31/politics/cnn-poll-south-carolina-trump-haley/"
  },
  {
    "text": "America's Rifle Fetish Is Destroying Its Sense of Freedom  —  In Anthony Mann's 1950 western “Winchester '73,” a rare and much-desired Winchester rifle brings misery and death to the unlucky souls who manage to bring it into their possession.  In the West as brought to you by Mann … ",
    "url": "https://www.nytimes.com/2023/10/31/opinion/maine-mass-shooting-rifles-freedom.html"
  },
  {
    "text": "Harris had a contingency plan for campus protests over Israel  —  The vice president, like other Democrats, is feeling some heat from her base.  —  Former aides to Kamala Harris' 2020 presidential campaign are collecting signatures for a letter urging the vice president to “seek an immediate ceasefire” … ",
    "url": "https://www.politico.com/news/2023/10/31/harris-campaign-alums-want-her-to-call-israelis-gaza-campaign-a-genocide-00124410"
  },
  {
    "text": "Hamas could inspire attacks in the U.S., FBI chief Christopher Wray says  —  The FBI is conducting “multiple, ongoing investigations” into people affiliated with the terrorist group, Wray said.  —  WASHINGTON — FBI Director Christopher Wray on Tuesday warned that Hamas' actions in the Middle East … ",
    "url": "https://www.nbcnews.com/politics/national-security/hamas-inspire-attacks-us-fbi-chief-christopher-wray-says-rcna122990"
  },
  {
    "text": "N.C. Gov. Cooper: Republicans' new map ‘will be challenged’  —  Good morning, Early Birds.  We're curious if there are any politicians in either party sporting more impressive costumes than Illinois Gov. J.B. Pritzker, who dressed as Albus Dumbledore.  Send us your nominations: earlytips@washpost.com.",
    "url": "https://www.washingtonpost.com/politics/2023/10/31/nc-gov-cooper-republicans-new-map-will-be-challenged/"
  },
  {
    "text": "Biden-Harris Administration Continues Efforts to Provide Debt Relief for More Student Loan Borrowers  —  U.S. Department of Education releases draft regulatory text that would provide much-needed debt relief to borrowers across the country  —  Contact:  Press Office, (202) 401-1576, press@ed.gov",
    "url": "https://www.ed.gov/news/press-releases/biden-harris-administration-continues-efforts-provide-debt-relief-more-student-loan-borrowers"
  }
]