[
  {
    "text": "Trump World Fueled an Anti-Shapiro Whisper Campaign  —  AS KAMALA HARRIS BEGAN WINDING DOWN her search for a running mate, Donald Trump's team knew one thing clearly: It didn't want her to pick Josh Shapiro, the popular governor of swing-state Pennsylvania whose more moderate record made him a formidable opponent.",
    "url": "https://www.thebulwark.com/p/trump-world-fueled-anti-shapiro-whisper-campaign"
  },
  {
    "text": "Democrats Lost Their Minds Over Tim Walz, Kamala Harris' New Midwestern Running Mate  —  The Minnesota governor delighted a Philadelphia audience with attacks on Donald Trump, previewing his role in the campaign for the next 91 days.  —  PHILADELPHIA — A crowd of thousands went absolutely nuts … ",
    "url": "https://www.huffpost.com/entry/kamala-harris-tim-walz-running-mate-philadelphia_n_66b2be69e4b0551015a185fb"
  },
  {
    "text": "What Walz told Harris in his VP interview  —  “I'm not angling for anything else.”  —  In the dining room of the Naval Observatory on Sunday, Tim Walz sat across from his soon-to-be running mate for the biggest interview of his life.  His message to Kamala Harris and her vetting team was one of deference.",
    "url": "https://www.politico.com/news/2024/08/06/walz-told-harris-vp-interview-00172952"
  },
  {
    "text": "In Walz, Harris Sees a Battleground Strategy Dressed in Carhartt  —  Democrats think Gov. Tim Walz's cultural ties are needed to talk to rural and working-class voters.  But Republicans are not going to let his folksy style obscure a liberal record.  —  In selecting Gov. Tim Walz of Minnesota … ",
    "url": "https://www.nytimes.com/2024/08/06/us/politics/kamala-harris-tim-walz-running-mate.html"
  },
  {
    "text": "Why Kamala Harris chose Tim Walz  —  Harris and Walz didn't know each other but quickly clicked.  —  Kamala Harris loved Tim Walz's governing record in Minnesota.  His biography and record of winning tough races resonated with her.  And most of all, she just really liked him.",
    "url": "https://www.politico.com/news/2024/08/06/why-kamala-harris-chose-tim-walz-00172834"
  },
  {
    "text": "Kamala Harris Shares Video Informing Walz He Is Her Pick  —  PUT A RING ON IT  —  “It'll be a privilege to take this with you across the country,” Walz told Harris in a newly released video of their call.  —  Vice President Kamala Harris released a video of her veep-proposal to Gov. Tim Walz … ",
    "url": "https://www.thedailybeast.com/kamala-harris-reveals-veep-proposal-to-tim-walz"
  },
  {
    "text": "X sues the advertising industry  —  I.  —  On Tuesday, X intensified its assault on advertisers that have declined to buy ads on the platform.  Today, let's talk about the case, how Elon Musk is using his conservative allies in the House of Representatives to bolster it … ",
    "url": "https://www.platformer.news/x-sues-advertising-industry-musk-garm-jordan/"
  },
  {
    "text": "X, Owned by Elon Musk, Brings Antitrust Suit Accusing Advertisers of a Boycott  —  The company claimed that members of the Global Alliance for Responsible Media coordinated to dissuade brands from advertising on X.  —  X on Tuesday filed a lawsuit against the Global Alliance for Responsible Media … ",
    "url": "https://www.nytimes.com/2024/08/06/technology/x-antitrust-suit-advertisers-elon-musk.html"
  },
  {
    "text": "Poll: Harris jumps to a small national lead over Trump  —  Vice President Harris has upended the presidential race and has now built a 51%-48% lead over former President Trump, according to the latest NPR/PBS News/Marist poll.  —  That result is 4 points better than just after Harris got … ",
    "url": "https://www.npr.org/2024/08/06/g-s1-15701/election-poll-harris-trump"
  },
  {
    "text": "JD Vance over text: Crude, dismissive and friendly with the far-right fringe  —  Private messages show Trump's running mate entertaining conspiracy theories and scorning the late Sheldon Adelson.  —  The day after JD Vance was elected to the U.S. Senate in 2022, he received a congratulatory text … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/07/jd-vance-charles-johnson-texts/"
  },
  {
    "text": "Republicans worry Trump is having a ‘public nervous breakdown’  —  ‘Donald Trump is losing his marbles,’ former Congressman and Republican Adam Kinzinger said  —  Support truly  —  independent journalism  —  Our mission is to deliver unbiased, fact-based reporting that holds power to account and exposes the truth.",
    "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-nervous-breakdown-republicans-harris-b2592064.html"
  },
  {
    "text": "Pluralistic: Circular battery self-sufficiency (06 Aug 2024)  — Circular battery self-sufficiency: 125m of tons of battery material is one *seventeenth* of our annual road transportation oil extraction.  — Hey look at this: Delights to delectate.  — This day in history: 2004, 2014, 2019, 2023",
    "url": "https://pluralistic.net/2024/08/06/with-great-power/"
  },
  {
    "text": "Appeals court upholds Maryland ban on certain semiautomatic weapons  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00  —  Loaded: 0%  —  Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/regulation/court-battles/4814489-federal-appeals-court-upholds-md-gun-law/"
  },
  {
    "text": "FBI agents execute search warrant on Tennessee Congressman Andy Ogles, NewsChannel 5 confirms  —  NASHVILLE, Tenn. (WTVF) — FBI agents executed a search warrant late last week on Tennessee Congressman Andy Ogles as the first-term Republican faces continuing scrutiny over fraudulent campaign financial reports … ",
    "url": "https://www.newschannel5.com/news/newschannel-5-investigates/revealed/fbi-agents-execute-search-warrant-on-tennessee-congressman-andy-ogles-newschannel-5-confirms"
  },
  {
    "text": "How Tim Walz made school meals free for all Minnesota students  —  As Governor, new vice presidential pick Tim Walz worked on a program that eliminated income requirements for school lunch.  —  When it comes to setting students up for success, making sure they eat lunch is crucial.",
    "url": "https://www.fastcompany.com/91168428/how-tim-walz-made-school-meals-free-for-all-minnesota-students"
  },
  {
    "text": "Republicans Would Love for Bad Things to Start Happening  —  Get Press Pass every Tuesday and Thursday:  —  We're now within three months of election day, and as we enter the final stretch, Democrats' anxieties are growing about the possibility of an unexpected catastrophe changing the race in its final leg.",
    "url": "https://www.thebulwark.com/p/republicans-would-love-for-bad-things"
  },
  {
    "text": "Pakistani national with ties to Iran charged in connection to a foiled assassination plot potentially targeting Trump  —  The Justice Department has charged a Pakistani man who has alleged ties to the Iranian government with seeking to carry out political assassinations … ",
    "url": "https://www.cnn.com/2024/08/06/politics/iran-trump-assassination-charges/"
  }
]