[
  {
    "text": "The Situation: The Cult of Unqualified Authenticity  —  On Pete Hegseth and the first hearing for a Trump nominee for a major cabinet position  —  Meet The Authors  —  Published by The Lawfare Institute in Cooperation With  —  The Situation on Friday reflected on the sentencing of Donald Trump in New York.",
    "url": "https://www.lawfaremedia.org/article/the-situation--the-cult-of-unqualified-authenticity"
  },
  {
    "text": "Joni Ernst Says She Will Vote to Confirm Pete Hegseth  —  The Iowa Republican's decision dramatically increases the likelihood that Mr. Hegseth will have enough votes to be confirmed as President-elect Donald J. Trump's defense secretary.  —  Senator Joni Ernst, Republican of Iowa … ",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/joni-ernst-pete-hegseth-confirmation.html"
  },
  {
    "text": "Joni Ernst says she'll vote to confirm Pete Hegseth  —  Pete Hegseth has won over Sen. Joni Ernst.  The Iowa senator said Tuesday she will be voting to confirm Hegseth to the next Defense secretary, a crucial endorsement for a nomination that seemed to be on shaky ground a few weeks ago.",
    "url": "https://www.politico.com/live-updates/2025/01/14/congress/ernst-says-shes-a-yes-on-hegseth-00198297"
  },
  {
    "text": "Ernst will vote for Hegseth, handing Trump big win  —  Sen. Joni Ernst (R-Iowa), a key member of the Senate Armed Services Committee who has championed women serving in combat roles, announced Tuesday that she will vote for Pete Hegseth, President-elect Trump's choice to lead the Pentagon.",
    "url": "https://thehill.com/homenews/5086108-ernst-will-vote-for-hegseth/"
  },
  {
    "text": "Search SEC.gov & EDGAR  —  Securities and Exchange Commission v. Elon Musk, No. 1:25-cv-00105 (D.D.C. filed Jan. 14, 2025)  —  SEC Charges Elon Musk for Violating the Beneficial Ownership Reporting Requirements of the Federal Securities Laws  —  The Securities and Exchange Commission announced today … ",
    "url": "https://www.sec.gov/enforcement-litigation/litigation-releases/lr-26219"
  },
  {
    "text": "SEC Sues Musk Over Securities Violation in Federal Court  —  The Securities and Exchange Commission sued Elon Musk in federal court over an alleged securities violation, according to a court docket.  —  The agency claimed Musk failed to timely disclose a major purchase of Twitter Inc. shares ahead … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-14/sec-sues-elon-musk-over-securities-violation-in-federal-court"
  },
  {
    "text": "S.E.C. Sues Elon Musk Over Twitter-Related Securities Violations  —  Regulators filed a lawsuit in federal court stemming from Mr. Musk's $44 billion purchase of the social media company now called X.  —  U.S. securities regulators sued Elon Musk in federal court in Washington on Tuesday … ",
    "url": "https://www.nytimes.com/2025/01/14/technology/sec-elon-musk-securities-violations.html"
  },
  {
    "text": "Texas House elects new Speaker in blow to far-right wing  —  The Texas House on Tuesday elected state Rep. Dustin Burrows (R) to lead the chamber in a blow to the rising far-right wing of the party, defeating a candidate supported by Texas Attorney General Ken Paxton (R) and other top state figures.",
    "url": "https://thehill.com/homenews/state-watch/5085530-texas-house-elects-new-speaker-blow-to-far-right-wing/"
  },
  {
    "text": "Jack Smith reminds us of the futility of truth in the Trump era  —  Yesterday unfolded in a sort of perfectly stupid synchronicity, with the past crimes of Donald Trump, as detailed in the just-released Jack Smith report, being overshadowed by the confirmation hearing for Trump's secretary of defense nominee, Pete Hegseth.",
    "url": "https://www.publicnotice.co/p/jack-smith-final-report-trump-january-6"
  },
  {
    "text": "Meta just flipped the switch that prevents misinformation from spreading in the United States  —  I.  —  Last week, Meta announced a series of changes to its content moderation policies and enforcement strategies designed to curry favor with the incoming Trump administration.",
    "url": "https://www.platformer.news/meta-ends-misinformation-enforcement-zuckerberg/"
  },
  {
    "text": "I have struggled with how to respond to Mark Zuckerberg and Facebook's descent into toxic masculinity and Neo-Nazi madness.  While I have thought about quitting Facebook, I find great value in the connections and friends I have here, and it doesn't seem fair that I should lose that because Zuckerberg is having a mid-life crisis.",
    "url": "https://www.linkedin.com/posts/marklemley_i-have-struggled-with-how-to-respond-to-mark-activity-7284685204676362241-7h9r"
  },
  {
    "text": "The Biden-Harris Administration Record  —  Letter from President Biden  —  Four years ago, we stood in a winter of peril and a winter of possibilities.  We were in the grip of the worst pandemic in a century, the worst economic crisis since the Great Depression, and the worst attack on our democracy since the Civil War.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/15/the-biden-harris-administration-record/"
  },
  {
    "text": "How a major bank cheated its customers out of $2 billion, according to a new federal lawsuit  —  An explosive new lawsuit filed by the Consumer Financial Protection Bureau (CFPB) alleges that Capital One bank cheated its customers out of $2 billion.  According to the lawsuit … ",
    "url": "https://popular.info/p/how-a-major-cheated-its-customers"
  },
  {
    "text": "Jeff Bezos, Elon Musk and Mark Zuckerberg to attend Trump's inauguration  —  They will be sitting on the dais during the swearing-in as Silicon Valley leaders aim to make inroads with Trump, who attacked Big Tech during his first presidency.  —  Tech moguls Jeff Bezos … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/14/jeff-bezos-elon-musk-mark-zuckerberg-attend-trump-inauguration/"
  },
  {
    "text": "Russell Vought Poised to Expand Power of White House Budget Office  —  If confirmed, Mr. Vought will be at the center of President-elect Donald Trump's plans to upend the federal bureaucracy.  —  While leading the Office of Management and Budget during the first Trump administration … ",
    "url": "https://www.nytimes.com/2025/01/15/business/russell-vought-budget-office-confirmation-hearing.html?unlocked_article_code=1.pU4.YUeP.xEk4xJrmJG9o&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Cuba  —  Biden moves to lift state sponsor of terrorism designation for Cuba, part of deal to free prisoners  —  President Joe Biden has notified Congress of his intent to lift the U.S. designation of Cuba as a state sponsor of terrorism, the White House announced, as part of a deal facilitated … ",
    "url": "https://apnews.com/hub/cuba"
  },
  {
    "text": "House passes ban on transgender students in girls sports  —  Washington — The House on Tuesday passed a Republican measure banning transgender girls and women from competing on school sports teams that match their gender identity after the party leaned into the issue during the 2024 campaign.",
    "url": "https://www.cbsnews.com/news/house-ban-transgender-girls-womens-sports/"
  },
  {
    "text": "Mike Johnson eyes April deadline to pass one big MAGA bill through the House, but GOP senators are skeptical  —  House and Senate Republicans still disagree on the best strategy to advance Trump's policy priorities on the border, energy and taxes.  A recent Trump-GOP meeting failed to resolve it.",
    "url": "https://www.nbcnews.com/politics/congress/mike-johnson-april-deadline-pass-one-big-maga-bill-house-rcna187688"
  },
  {
    "text": "A Biden-Trump Gaza deal?  —  With help from Connor O'Brien, John Sakellariadis, Maggie Miller and Daniel Lippman,  —  An Israel-Gaza cease-fire deal appears closer than ever, and both JOE BIDEN and DONALD TRUMP's camps are scrambling for credit.  —  Secretary of State ANTONY BLINKEN … ",
    "url": "https://www.politico.com/newsletters/national-security-daily/2025/01/14/a-biden-trump-gaza-deal-00198206"
  },
  {
    "text": "Crockett, Mace get into heated exchange over trans rights: ‘If you want to take it outside’  —  Reps. Jasmine Crockett (D-Texas) and Nancy Mace (R-S.C.) got into a heated exchange during a Tuesday Oversight and Accountability Committee hearing and discussion about civil rights and transgender rights … ",
    "url": "https://thehill.com/homenews/house/5085897-crockett-mace-get-into-heated-exchange-over-trans-rights-if-you-want-to-take-it-outside/"
  },
  {
    "text": "Michelle Obama Will Skip Trump's Inauguration  —  Mrs. Obama also declined to attend the funeral of Jimmy Carter last week, which would have put her face-to-face with Mr. Trump.  —  Michelle Obama, the former first lady, will not attend the inauguration of President-elect Donald J. Trump, her office said in a statement on Tuesday.",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/michelle-obama-trump-inauguration.html"
  },
  {
    "text": "Vice Is a Moat  —  1. Secretary Pete  —  Here is the thing about Pete Hegseth:  —  Imagine that his character was sterling.  That he was a fine, upstanding man, admired by all who know him.  That he had dedicated his life to service and been judged to be as good a human being as Mister Rogers or Dolly Parton.",
    "url": "https://www.thebulwark.com/p/vice-is-a-moat"
  },
  {
    "text": "Estimated Gaza Toll May Have Missed 25,000 Deaths, Study Says  —  Analysis found that more than 64,000 Palestinians may have been killed by traumatic injury in the first nine months of the war.  —  Deaths from bombs and other traumatic injuries during the first nine months of the war in Gaza … ",
    "url": "https://www.nytimes.com/2025/01/14/health/gaza-death-toll.html"
  },
  {
    "text": "Rep. Mace challenges Rep. Crockett to ‘take it outside’ at House hearing  —  The two firebrands for their respective parties got into a heated exchange Tuesday at a House Oversight Committee hearing.",
    "url": "https://www.washingtonpost.com/politics/2025/01/14/nancy-mace-jasmine-crockett-house-outside/"
  }
]