[
  {
    "text": "‘A colossal mistake to showcase this sociopath’: NBC facing backlash after ‘shameful’ Trump interview airs  —  NBC's attempt to avoid the pitfalls of the Donald Trump CNN town hall which was a contributing factor to the departure of CEO of CNN Worldwide Chris Licht does not appear to have panned out despite being taped and edited.",
    "url": "https://www.rawstory.com/trump-kristen-welker/"
  },
  {
    "text": "Trump Says He Hopes Meadows Will Remain ‘Loyal’ to Him in Election Case  —  The former president, who has been warned against saying anything that could influence witnesses in his election interference case, made the statements during an interview on “Meet the Press.”",
    "url": "https://www.nytimes.com/2023/09/17/us/politics/trump-meadows-meet-the-press.html"
  },
  {
    "text": "Rhetoric expert explains why there's no way to fact-check Trump's ‘layers of lies’  —  Rhetoric expert, Professor Jennifer Mercieca, explained that the way that new “Meet the Press” host Kristen Welker held the interview with Donald Trump had no hope of ever being able to adequately fact-check the president.",
    "url": "https://www.rawstory.com/trump-rhetoric-meet-the-press-interview/"
  },
  {
    "text": "‘A Terrible Mistake’: Trump Criticizes DeSantis on Abortion Ban  —  The former president, while denouncing his chief rival for the Republican nomination, also largely evaded questions on the issue.  —  Former President Donald J. Trump, whose Supreme Court appointments led to the overturning of Roe v. Wade … ",
    "url": "https://www.nytimes.com/2023/09/17/us/politics/trump-meet-the-press-abortion-desantis.html"
  },
  {
    "text": "Kristen Welker's ‘Meet the Press’ Debut Derailed by Trump Derangement  —  Her debut turn as “Meet the Press” moderator was doomed from the moment she booked Donald Trump as her first interview.  —  Journalists and commentators for years have wrestled with the question of how to approach Donald Trump … ",
    "url": "https://www.thedailybeast.com/kristen-welkers-meet-the-press-debut-derailed-by-trump-derangement"
  },
  {
    "text": "House Republicans strike deal on short-term funding, but Senate likely to reject it  —  Half a dozen House Republicans announced a deal on Sunday to temporarily fund the government with the goal of averting a shutdown at the end of the month.  But it's far from certain that the proposal … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/17/gop-continuing-resolution/"
  },
  {
    "text": "House GOP groups propose agreement on short-term government funding bill  —  House Republicans from both sides of the conference came to a deal.  —  LIVE  —  FILE PHOTO: The U.S. Capitol Building is seen in Washington, U.S., August 31, 2023.  REUTERS/Kevin Wurm/File Photo",
    "url": "https://abcnews.go.com/Politics/house-gop-groups-propose-agreement-short-term-government/story?id=103268993"
  },
  {
    "text": "Scoop: Schumer ditches Senate's informal dress code … - “Senators are able to choose what they wear on the Senate floor. … - Fetterman, who was elected last year, initially followed Senate tradition and wore suits. … The change applies only to senators — staff members will still be required to follow the old dress code.",
    "url": "https://www.axios.com/2023/09/17/senate-drops-dress-code-schumer"
  },
  {
    "text": "Ken Paxton emerges victorious from yet another career scandal  —  It marked a screaming milestone in a two-decade political career that has seen Paxton harness the state's increasingly conservative politics — and later the rise of Donald Trump — to stay in power longer than his vulnerabilities would suggest.",
    "url": "https://www.texastribune.org/2023/09/17/ken-paxton-impeachment-trial-scandal/"
  },
  {
    "text": "Two pilots killed in crash at National Championship Races in Reno  —  Two pilots were killed Sunday after their planes collided while landing at the National Championship Air Races in Reno, Nevada, the race organizers confirmed.  —  The Reno Air Racing Association (RARA) … ",
    "url": "https://thehill.com/blogs/blog-briefing-room/4209326-two-pilots-killed-in-crash-at-national-championship-races-in-reno/"
  },
  {
    "text": "Elon Musk likes to think he saved us from Armageddon.  He's just brought it closer  —  Whatever his new biography says, by giving into Russia's nuclear blackmail the X boss can only encourage more threats from Putin  —  he Silicon Valley oligarch, perhaps the richest man in the world … ",
    "url": "https://www.theguardian.com/commentisfree/2023/sep/17/elon-musk-likes-to-think-he-saved-us-from-armageddon-hes-just-brought-it-closer"
  },
  {
    "text": "Indiana attorney general sues hospital system over privacy of Ohio girl who traveled for abortion  —  The lawsuit, filed Friday in Indianapolis federal court, marked Attorney General Todd Rokita's latest attempt to seek disciplinary legal action against Dr. Caitlin Bernard.",
    "url": "https://www.nbcnews.com/news/crime-courts/indiana-attorney-general-sues-hospital-system-privacy-ohio-girl-travel-rcna105491"
  },
  {
    "text": "Boebert Claims She Was Booted from ‘Beetlejuice’ for Being ‘A Little Too Eccentric’  —  The congresswoman was caught vaping and engaging in disruptive behavior during a musical performance in Denver … That's certainly one way of framing it.  Theater surveillance footage … ",
    "url": "https://www.rollingstone.com/politics/politics-news/boebert-beetlejuice-little-too-eccentric-1234826753/"
  },
  {
    "text": "Biden Says ‘Lots of Luck’ to Republicans Looking to Impeach Him  — President first reacted to impeachment inquiry last week  — Republicans probe as federal budget deadline approaches  —  President Joe Biden derided the House's impeachment probe against him, responding with sarcasm … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-17/biden-says-lots-of-luck-to-republicans-looking-to-impeach-him"
  },
  {
    "text": "Jann Wenner Removed From Rock Hall Board After Times Interview  —  The Rolling Stone co-founder's exit comes a day after The New York Times published an interview in which he made widely criticized comments.  —  Jann Wenner, the co-founder of Rolling Stone magazine, has been removed … ",
    "url": "https://www.nytimes.com/2023/09/16/arts/music/jann-wenner-removed-rock-hall.html"
  }
]