[
  {
    "text": "‘A Day of Love’: How Trump Inverted the Violent History of Jan. 6  —  The president-elect and his allies have spent four years reinventing the Capitol attack — spreading conspiracy theories and weaving a tale of martyrdom to their ultimate political gain.  —  In two weeks, Donald J. Trump … ",
    "url": "https://www.nytimes.com/2025/01/05/us/politics/january-6-capitol-riot-trump.html?unlocked_article_code=1.m04.Bau7.PKFnFK8BJjxA"
  },
  {
    "text": "Donald Trump's quiet Jan. 6  —  Monday's certification of Trump's victory will be the antithesis of the carnage at the Capitol four years ago.  —  The transfer of power to Donald Trump is shaping up to be, well, peaceful.  —  No mobs are assembling to disrupt Congress' Jan. 6 counting of electoral votes.",
    "url": "https://www.politico.com/news/2025/01/05/trump-january-6-peaceful-00196493"
  },
  {
    "text": "Former Capitol Police officers call Trump's vows to pardon Jan. 6 rioters ‘a betrayal’  —  Former Capitol Police officers present during the Jan. 6, 2021 insurrection said President-elect Trump's commitment to pardon rioters is “a betrayal.”  —  “It's a betrayal, a stab in the heart,” … ",
    "url": "https://thehill.com/homenews/administration/5067236-january-6-pardons-officers-donald-trump/"
  },
  {
    "text": "Trump Sees the U.S. as a ‘Disaster.’ The Numbers Tell a Different Story.  —  President Biden is bequeathing his successor a nation that by many measures is in good shape, even if voters remain unconvinced.  —  To hear President-elect Donald J. Trump tell it, he is about to take over a nation ravaged … ",
    "url": "https://www.nytimes.com/2025/01/05/us/politics/trump-us-disaster-numbers.html"
  },
  {
    "text": "A different and more dangerous world awaits President-elect Trump  —  The war in Ukraine presents immediate challenges for the incoming president, with other problems looming in the Middle East and China.  —  President-elect Donald Trump will begin his second term stronger and more dominant … ",
    "url": "https://www.washingtonpost.com/politics/2025/01/05/trump-foreign-policy-ukraine-middle-east/"
  },
  {
    "text": "Biden to deliver two major speeches in his final days in office  —  The remarks include a foreign policy speech followed by a farewell address, people familiar with the plans told NBC News.  —  President Joe Biden plans to deliver two major speeches before leaving office as part of an effort … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-deliver-two-major-speeches-final-days-office-rcna186257"
  },
  {
    "text": "Washington Post cartoonist quits after paper rejects sketch of Bezos bowing to Trump  —  A cartoonist has decided to quit her job at the Washington Post after an editor rejected her sketch of the newspaper's owner and other media executives bowing before President-elect Donald Trump.",
    "url": "https://apnews.com/article/washington-post-trump-bezos-cartoonist-resigns-53928aadc4fb4dda8f35fd840b5717ac"
  },
  {
    "text": "A Pulitzer winner quits ‘Washington Post’ after a cartoon on Bezos is killed  —  A Pulitzer Prize-winning cartoonist for the Washington Post has resigned after its editorial page editor rejected a cartoon she created to mock media and tech titans abasing themselves before President-elect Donald Trump.",
    "url": "https://www.npr.org/2025/01/04/nx-s1-5248299/cartoonist-quits-wapo-over-bezos-trump-cartoon-washingtonpost"
  },
  {
    "text": "Italy's Prime Minister Visits Trump in Mar-a-Lago  —  Giorgia Meloni, the Italian prime minister, joins just a handful of other world leaders who have been to the president-elect's Florida estate since his victory.  —  Prime Minister Giorgia Meloni of Italy has gone to Mar-a-Lago … ",
    "url": "https://www.nytimes.com/2025/01/04/world/europe/italy-donald-trump-meloni-visit.html"
  },
  {
    "text": "Biden honors Dem donor George Soros, Hillary Clinton with Presidential Medal of Freedom, sparking outrage: ‘A national disgrace’  —  President Biden bestowed woke Democratic megadonor George Soros with the Presidential Medal of Freedom on Saturday — outraging critics  who ripped the selection as a “national disgrace.”",
    "url": "https://nypost.com/2025/01/04/us-news/joe-biden-bestows-presidential-medal-of-freedom-to-george-soros-hillary-clinton/"
  },
  {
    "text": "Austria's chancellor says will step down in ‘coming days’  —  Austria's conservative chancellor Karl Nehammer said on Saturday he would step down as chancellor in the ‘coming days’ after breaking off coalition talks with the Social Democrats.  —  Austria's coalition negotiations between … ",
    "url": "https://www.thelocal.at/20250104/breaking-austrias-chancellor-says-will-step-down-in-coming-days"
  },
  {
    "text": "Trump 2.0 Is About Punishing the Vulnerable and Enriching the Mega Wealthy  —  Here's what to take away from Trump's reversal on H-1B visas — and what his policy approach means for the poor and the uber-wealthy like Elon Musk  —  Donald Trump led a virulently anti-immigrant campaign for president … ",
    "url": "https://www.rollingstone.com/politics/political-commentary/trump-second-term-punishing-vulnerable-enriching-wealthy-1235224656/"
  },
  {
    "text": "Johnson tells House Republicans that Trump wants one ‘big beautiful’ reconciliation package  —  Trump's decision is a win for House Ways & Means Chair Jason Smith.  —  Speaker Mike Johnson told Republicans on Saturday that President-elect Donald Trump wants one reconciliation package … ",
    "url": "https://www.politico.com/news/2025/01/04/johnson-trump-reconciliation-package-00196487"
  },
  {
    "text": "How Trump “Won”  —  The Anesthetized Anti-MAGA Majority  —  With all the ballots counted and all the races decided, in today's post, I want to unpack what we already know about how Trump “won” the popular vote.1 I use quotes around the word “won” for two reasons.",
    "url": "https://www.weekendreading.net/p/how-trump-won"
  },
  {
    "text": "Biden to block new offshore drilling along most US coastline  —  The move may complicate Republican efforts to speed lease sales for oil and gas exploration in federal waters.  —  President Joe Biden is planning to prohibit future offshore oil and gas drilling along most of the nation's coastline … ",
    "url": "https://www.politico.com/news/2025/01/04/biden-block-offshore-drilling-00196484"
  }
]