[
  {
    "text": "Trump Justice Department fires officials who investigated Trump and launches ‘special project’ into January 6 cases  —  More than a dozen officials who worked on the criminal investigations into Donald Trump have been fired, according to sources familiar with the matter.",
    "url": "https://www.cnn.com/2025/01/27/politics/trump-special-project-january-6-prosecutors"
  },
  {
    "text": "Trump administration fires DOJ officials who worked on criminal investigations of the president  —  The DOJ employees had been involved in special counsel Jack Smith's investigation that led to Trump's classified documents and Jan. 6 cases.  —  WASHINGTON — The Department of Justice … ",
    "url": "https://www.nbcnews.com/politics/justice-department/trump-administration-fires-doj-officials-worked-criminal-investigation-rcna189512"
  },
  {
    "text": "Trump-Appointed Prosecutor Opens Review of Justice Department's Jan. 6 Cases  —  Lawyers who worked on the matters are asked to turn over files, notes and other records  —  WASHINGTON—A top Trump-appointed prosecutor has opened an internal review of the Justice Department's decision … ",
    "url": "https://www.wsj.com/us-news/law/trump-appointed-prosecutor-opens-review-of-justice-departments-jan-6-cases-72cd371c?st=7w92vg&reflink=article_copyURL_share"
  },
  {
    "text": "Justice Department fires more than a dozen key officials on former Special Counsel Jack Smith's team  —  Acting Attorney General James McHenry 'does not trust these officials to assist in faithfully implementing the President's agenda'  —  EXCLUSIVE: The Justice Department is firing … ",
    "url": "https://www.foxnews.com/politics/justice-department-fires-more-than-dozen-key-officials-former-special-counsel-jack-smiths-team?intcmp=tw_fnc"
  },
  {
    "text": "DeepSeek FAQ  —  It's Monday, January 27.  Why haven't you written about DeepSeek yet?  —  I did!  I wrote about R1 last Tuesday.  —  I totally forgot about that.  —  I take responsibility.  I stand by the post, including the two biggest takeaways that I highlighted … ",
    "url": "https://stratechery.com/2025/deepseek-faq/"
  },
  {
    "text": "Trump Just Broke the Law.  Blatantly.  And He Might Get Away With It.  —  Imagine that there were a particularly dirty NFL player—call him Thompson—who developed a habit of doing something new and possibly dangerous to opposing players.  Penalty flags didn't deter him.  On and on he went.",
    "url": "https://newrepublic.com/article/190704/trump-fires-inspectors-general-broke-law-blatantly"
  },
  {
    "text": "Transcript: Trump's Late-Night Purge Suddenly Becomes Bigger Scandal  —  The following is a lightly edited transcript of the January 27 episode of the Daily Blast podcast.  Listen to it here.  —  Greg Sargent: This is The Daily Blast from The New Republic, produced and presented by the DSR network.",
    "url": "https://newrepublic.com/article/190705/transcript-trumps-late-night-purge-suddenly-becomes-bigger-scandal"
  },
  {
    "text": "Democrats flip the script, eyeing debt limit to block Trump's agenda  —  Republicans have leveraged the debt ceiling for years to block Democrats' agenda.  Now liberals see an opening to stymie Trump.  —  DORAL, Florida — Democrats in Congress are considering forcing a showdown … ",
    "url": "https://www.washingtonpost.com/business/2025/01/27/trump-debt-ceiling-democrats/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM3OTU0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM5MzM2Mzk5LCJpYXQiOjE3Mzc5NTQwMDAsImp0aSI6IjQ3MzcwZTdjLTU3MzQtNDhiNi1hNDYyLWRmZWY1NzVjMWVkOCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzI3L3RydW1wLWRlYnQtY2VpbGluZy1kZW1vY3JhdHMvIn0.CeBmBdI_3R6YKWuAvfAu3bNJaA36oizBOCjo3MT5iOk&itid=gfta"
  },
  {
    "text": "Indiana man fatally shot by sheriff's deputy identified as Jan. 6 defendant  — A Jasper County sheriff's deputy fatally shot 42-year-old Matthew W. Huttle during a traffic stop in northwest Indiana on Sunday after an altercation in which Huttle reportedly resisted arrest and was armed.",
    "url": "https://www.fox32chicago.com/news/indiana-man-fatally-shot-deputy-identified-jan-6"
  },
  {
    "text": "Colombia yields on US deportation flights to avert trade war  —  A looming trade war between the US and Colombia appears to have been averted after the Colombian government agreed to allow US military flights carrying deported migrants to land in the Andean country.",
    "url": "https://www.bbc.com/news/articles/c20p36e62gyo"
  },
  {
    "text": "Chief Corruption Prosecutor Resigns From Justice Dept.  —  Corey Amundson chose to leave the department after being told he was being reassigned by the Trump administration to a position related to immigration enforcement.  —  The head of the Justice Department's public integrity section … ",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/chief-corruption-prosecutor.html"
  },
  {
    "text": "Trump expected to sign executive orders to reshape the military, including banning transgender troops  —  President Donald Trump on Monday is expected to sign three executive orders that would reshape the military, including banning transgender service members from serving in the US armed forces … ",
    "url": "https://www.cnn.com/2025/01/27/politics/donald-trump-military-executive-orders/"
  },
  {
    "text": "Quaker groups file suit over end of policy restricting ICE arrests in houses of worship  —  The suit appears to be the first from a faith-based organization challenging the change in court.  —  A group of Quaker congregations are suing the Department of Homeland Security for changing a policy … ",
    "url": "https://www.nbcnews.com/politics/national-security/quaker-groups-file-suit-end-policy-restricting-ice-arrests-houses-wors-rcna189471"
  },
  {
    "text": "CDC ordered to stop working with WHO immediately, upending expectations of an extended withdrawal  —  U.S. public health officials have been told to stop working with the World Health Organization, effective immediately.  A U.S. Centers for Disease Control and Prevention official … ",
    "url": "https://apnews.com/article/cdc-who-trump-548cf18b1c409c7d22e17311ccdfe1f6"
  },
  {
    "text": "Navajo Nation leaders raise alarm over reports of Indigenous people being questioned and detained during immigration sweeps  —  At least 15 Indigenous people in Arizona and New Mexico have reported being stopped at their homes and workplaces, questioned or detained by federal law enforcement … ",
    "url": "https://www.cnn.com/2025/01/27/us/navajo-detained-ice-indigenous-immigration-trump/"
  },
  {
    "text": "Inspector general fired by Trump has a warning for Americans  —  President Donald Trump fired the inspectors general from more than a dozen federal agencies in a Friday night purge, according to a Trump administration official, paving the way for him to install his own picks for the independent watchdog roles.",
    "url": "https://www.cnn.com/2025/01/27/politics/video/inspector-general-fired-trump-mark-greenblatt-digvid"
  },
  {
    "text": "Chris Hayes Made a Chamber of His Own  —  How Kierkegaard and a book contract saved the MSNBC host from smartphone addiction.  —  Chris Hayes cuts a peculiar figure in the media landscape.  He is omnivorously inquisitive, his owlish frames imparting the sense that he is always on the lookout … ",
    "url": "https://nymag.com/intelligencer/article/chris-hayes-msnbc-sirens-call-interview.html"
  },
  {
    "text": "US reports first outbreak of H5N9 bird flu in poultry  —  The United States has reported its first outbreak of H5N9 bird flu in poultry on a duck farm in California, the World Organisation for Animal Health (WOAH) said on Monday.  —  U.S. authorities also detected the more common H5N1 strain … ",
    "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-reported-first-outbreak-h5n9-bird-flu-poultry-woah-says-2025-01-27/"
  },
  {
    "text": "Is Trump's Plan to End Birthright Citizenship ‘Dred Scott II’?  —  The 14th Amendment overturned the 1857 decision that denied citizenship to Black people.  Scholars say President Trump's proposal betrays that history.  —  Thirty years ago, Congress considered a bill much like President … ",
    "url": "https://www.nytimes.com/2025/01/27/us/politics/trump-birthright-citizenship-dred-scott.html?unlocked_article_code=1.sU4.4jVX.fAzQ_-SoxBSa&smid=url-share"
  },
  {
    "text": "They Followed North Carolina Election Rules When They Cast Their Ballots.  Now Their Votes Could Be Tossed Anyway.  —  A Republican judge is trying to overturn his election loss by challenging more than 60,000 ballots.  These are some of those voters' stories.",
    "url": "https://www.propublica.org/article/north-carolina-voters-jefferson-griffin-supreme-court-challenge"
  },
  {
    "text": "Some GOP senators want open committee vote on Gabbard  —  Any Republican opposition could doom the top intelligence nominee's confirmation.  —  Some Republican senators are pushing for the unusual step of making public a key vote on Tulsi Gabbard's nomination in the Senate Intelligence Committee … ",
    "url": "https://www.politico.com/news/2025/01/27/tulsi-gabbard-senate-intelligence-committee-vote-006977"
  },
  {
    "text": "FBI insider raises concerns about Kash Patel's role in hostage rescue  —  Days before this week's high-stakes confirmation hearing of Kash Patel to be FBI director, a bureau insider has come forward with new information questioning Patel's judgment during sensitive hostage rescue missions, CBS News has learned.",
    "url": "https://www.cbsnews.com/news/fbi-insider-kash-patel-hostage-rescue/"
  },
  {
    "text": "It's pretty easy to cut $2 trillion from the federal budget, actually (permalink)  —  If Elon Musk wants to cut $2t from the US federal budget, there's a pretty straightforward way to get there - just eliminate all the beltway bandits who overcharge Uncle Sucker for everything from pharmaceuticals … ",
    "url": "https://pluralistic.net/2025/01/27/beltway-bandits/#henhouse-foxes"
  },
  {
    "text": "Europe's Elon Musk Problem … During an american election, a rich man can hand out $1 million checks to prospective voters.  Companies and people can use secretly funded “dark money” nonprofits to donate unlimited money, anonymously, to super PACs, which can then spend it on advertising campaigns.",
    "url": "https://www.theatlantic.com/magazine/archive/2025/03/musk-tech-oligarch-european-election-influence/681453/?gift=hVZeG3M9DnxL4CekrWGK34_jHWNsAU1mvPsKLSJcYGQ&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "No. We Should Not Move Beyond ‘That’  —  The Philadelphia Eagles are going to the Super Bowl.  (So are the Kansas City Chiefs, but who cares?)  The last time the Eagles won it all, in 2018, many of the players declined an invitation to the White House to celebrate with President Trump … ",
    "url": "https://www.thebulwark.com/p/no-we-should-not-move-beyond-that"
  }
]