[
  {
    "text": "Kim Reynolds Has Another Account, @Kimberl26890376, and Opinions About Donald Trump  —  In recent months, the Republican governor of Iowa has used a secondary account on X to share her unfiltered feelings on the Republican presidential primary race.  —  Not long after the calendar turned to 2024 … ",
    "url": "https://www.nytimes.com/2024/01/11/us/politics/kim-reynolds-twitter-account.html"
  },
  {
    "text": "Election 2024: Trump, DeSantis Lead Biden.  Haley?  Nope.  —  Former President Donald Trump continues to lead President Joe Biden in the 2024 election, and Florida Gov. Ron DeSantis also has a narrow edge over the incumbent, but Biden would beat former U.N. Secretary Nikki Haley.",
    "url": "https://www.rasmussenreports.com/public_content/politics/biden_administration/election_2024_trump_desantis_lead_biden_haley_nope"
  },
  {
    "text": "Trump Launches into Courtroom Tirade About ‘Witch Hunt’ Fraud Case, Claiming He Deserves Damages  —  The former president didn't wait for the judge's permission before reciting a roughly five-minute rant that he's being ‘persecuted’  —  Donald Trump launched into a tirade Thursday … ",
    "url": "https://themessenger.com/politics/trump-new-york-courtroom-rant-witch-hunt-fraud-case"
  },
  {
    "text": "Live updates Closing statements conclude in Trump's N.Y. civil fraud trial  —  Closing statements concluded Thursday in New York state's $370 million civil fraud trial against Donald Trump, his company and others.  Show more  —  Key updates  —  Trump rails against trial, judge from courtroom seat",
    "url": "https://www.washingtonpost.com/national-security/2024/01/11/trump-new-york-fraud-trial-closing-arguments/"
  },
  {
    "text": "Trump's Lawyers Argue Biden Can Assassinate Him  —  I CONFESS TO A LONGSTANDING PREFERENCE for the Army's Delta Force over the Navy's SEAL Team Six.  The preference is not rational—it is the product, no doubt, of some latent pro-Army sentiment because my stepson served in that branch.",
    "url": "https://plus.thebulwark.com/p/trump-lawyers-argue-biden-can-assassinate-him"
  },
  {
    "text": "US, British militaries launch massive retaliatory strike against Iranian-backed Houthis in Yemen  —  The U.S. and British militaries bombed more than a dozen sites used by the Iranian-backed Houthis in Yemen on Thursday, in a massive retaliatory strike using warship and submarine-launched Tomahawk missiles … ",
    "url": "https://apnews.com/article/yemen-houthis-biden-retaliation-attacks-0804b93372cd5e874a0dd03513fe36a2"
  },
  {
    "text": "Statement from President Joe Biden on Coalition Strikes in Houthi-Controlled Areas in Yemen  —  Today, at my direction, U.S. military forces—together with the United Kingdom and with support from Australia, Bahrain, Canada, and the Netherlands—successfully conducted strikes against a number … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/01/11/statement-from-president-joe-biden-on-coalition-strikes-in-houthi-controlled-areas-in-yemen/"
  },
  {
    "text": "US and UK launch strikes against Houthi militants in Yemen  —  Who are the Houthi rebels attacking Red Sea ships?  —  Summary  — US and UK forces have begun air strikes against Houthi rebel targets in Yemen, US officials say  — UK Prime Minister Rishi Sunak earlier briefed his cabinet … ",
    "url": "https://www.bbc.com/news/live/world-us-canada-67952029"
  },
  {
    "text": "Why Platformer is leaving Substack  —  After much consideration, we have decided to move Platformer off of Substack.  Over the next few days, the publication will migrate to a new website powered by the nonprofit, open-source publishing platform Ghost.  If you already subscribe to Platformer … ",
    "url": "https://www.platformer.news/p/why-platformer-is-leaving-substack"
  },
  {
    "text": "Jill Biden slams ‘horrible’ Republicans for showing nude Hunter photos during hearing and says what they're doing to him is ‘cruel’  — ‘What they are doing to Hunter is cruel,’ she said in interview on Morning Joe  — She also defended Joe's Biden age: ‘I say his age is an asset’",
    "url": "https://www.dailymail.co.uk/news/article-12951907/jill-hunter-biden-congress-republicans-nude-photos-hearing.html"
  },
  {
    "text": "Congress approves resolution against Biden EV charger plans  —  The measure targets a limited waiver from Buy America rules.  Democrats and the White House say it would backfire.  —  The House approved legislation Thursday to undo a Biden administration rule meant to facilitate the proliferation of electric vehicle charging stations.",
    "url": "https://www.politico.com/news/2024/01/11/congress-resolution-biden-ev-charger-plans-00134788"
  },
  {
    "text": "Ohio woman who miscarried at home will not be criminally charged, grand jury says  —  Brittany Watts, 34, had been charged with a felony for abuse of a corpse after she miscarried in her bathroom and was later admitted to a hospital for a life-threatening hemorrhage.",
    "url": "https://www.nbcnews.com/news/us-news/ohio-woman-miscarried-home-will-not-criminally-charged-grand-jury-says-rcna132093"
  },
  {
    "text": "Democrats Propose Bill to Neuter Militias  —  The “Preventing Private Paramilitary Activity Act” would effectively limit most militia activity.  —  Militias who like to spend their weekends training to overthrow the government could find themselves running afoul of federal law … ",
    "url": "https://www.vice.com/en/article/n7e5xm/democrats-propose-bill-to-neuter-militias"
  },
  {
    "text": "Hogan steps down from No Labels board amid 2024 speculation  —  Former Maryland Gov. Larry Hogan (R) stepped down as co-chair of No Labels last month, raising speculation about a potential third party presidential campaign.  —  Hogan's resignation letter, dated Dec. 15 and first reported … ",
    "url": "https://thehill.com/homenews/campaign/4398706-hogan-steps-down-no-labels-board-2024-speculation/"
  },
  {
    "text": "Johnson flails as Republicans demand consequences for conservative hijacking  —  The speaker denied making any commitments to conservatives who want him to scrap this week's bipartisan government spending agreement.",
    "url": "https://www.politico.com/live-updates/2024/01/11/congress/conservatives-push-johnson-00135080"
  },
  {
    "text": "Feds charge eBay over employees who sent live spiders and cockroaches to couple; company to pay $3M  —  Online retailer eBay Inc. will pay a $3 million fine to resolve criminal charges over a harassment campaign waged by employees who sent live spiders, cockroaches and other disturbing items … ",
    "url": "https://apnews.com/article/ebay-spiders-cockroaches-steiner-newsletter-9ac2c35bcd4c87af181382c71d992343"
  },
  {
    "text": "Johnson's rider push meets reality  —  With an assist from Ursula Perano, Jordain Carney, Burgess Everett and Katherine Tully-McManus  —  RIDERS OR DIE?  —  Speaker Mike Johnson is selling the dream of conservative “policy riders” as a big upside to the nearly $1.7 trillion bipartisan funding deal reached over the weekend.",
    "url": "https://www.politico.com/newsletters/inside-congress/2024/01/10/johnsons-rider-push-meets-reality-00134903"
  },
  {
    "text": "Abbott: 'We're not shooting people' who cross the border because feds ‘would charge us with murder’  —  Texas Gov. Greg Abbott (R) said shooting people who cross the border is the only tool the state is not using to deter migrants because the Biden administration would sue the state for “murder.”",
    "url": "https://thehill.com/homenews/state-watch/4404134-abbott-texas-border-shooting-migrants/"
  },
  {
    "text": "Secret Recording Shows NRA Treasurer Plotting to Conceal Extravagant Expenses Involving Wayne LaPierre  —  Audio obtained by The Trace and ProPublica reveals, in real time, the gun lobbying group enacting a plan that would conceal payments for fancy hotels, limousines and other luxury expenses connected to its longtime CEO for a decade.",
    "url": "https://www.propublica.org/article/nra-wayne-lapierre-recording-private-jet-limousine-expenses"
  }
]