[
  {
    "text": "Julian Assange has reached a plea deal with the U.S., allowing him to go free  —  The WikiLeaks founder has been held in a prison outside London for the last five years and fought extradition to the United States.  —  WASHINGTON — WikiLeaks founder Julian Assange plans to plead guilty … ",
    "url": "https://www.nbcnews.com/politics/justice-department/julian-assange-reached-plea-deal-us-allowing-go-free-rcna158695"
  },
  {
    "text": "Wikileaks founder Julian Assange to plead guilty, return to Australia  —  WASHINGTON (AP) — WikiLeaks founder Julian Assange will plead guilty to a felony charge in a deal with the U.S. Justice Department that will free him from prison and resolve a long-running legal saga that spanned multiple continents … ",
    "url": "https://apnews.com/article/assange-plea-deal-wikileaks-justice-department-d329ba4614dbfa77b5eb968d07fd9bd0"
  },
  {
    "text": "Julian Assange leaves UK after striking deal with US justice department  —  It is anticipated the WikiLeaks founder will plead guilty to violating US espionage law at a hearing in Saipan and will be allowed to return to Australia  —  Julian Assange has been released from a British prison … ",
    "url": "https://www.theguardian.com/media/article/2024/jun/25/julian-assange-plea-deal-with-us-free-to-return-australia"
  },
  {
    "text": "WikiLeaks founder Julian Assange strikes plea deal with the U.S.  —  WikiLeaks founder Julian Assange has entered into a plea deal with the U.S. government, bringing an end to a years-long international saga over his handling of national security secrets.  —  Assange is preparing to plead guilty … ",
    "url": "https://www.npr.org/2024/06/24/nx-s1-5017953/julian-assange-plea-deal"
  },
  {
    "text": "Bankruptcy trustee discloses plan to shut down Alex Jones' Infowars and liquidate assets  —  A U.S. bankruptcy court trustee is planning to shut down conspiracy theorist Alex Jones' Infowars media platform and liquidate its assets to help pay the $1.5 billion in lawsuit judgments Jones owes … ",
    "url": "https://apnews.com/article/alex-jones-infowars-bankruptcy-sandy-hook-e8bf9a3d11b9506abb18c285d3e7b138"
  },
  {
    "text": "Alex Jones' court trustee plans to shut down his notorious conspiracy outlet Infowars  —  Conspiracy theorist Alex Jones' Infowars media empire will be shut down and sold off, a bankruptcy court-appointed trustee said in an emergency court filing Sunday, signalling the end of the notorious far-right outlet … ",
    "url": "https://www.cnn.com/2024/06/24/media/alex-jones-infowars-court-trustee/"
  },
  {
    "text": "“Months she wasted”: National security lawyer says Judge Cannon's “hubris” turned case into a “mess”  —  Trump judge already made “egregiously flawed ruling” and appears to be “in over her head,” Bradley Moss told Salon  —  With no trial date in sight for Donald Trump's classified documents case … ",
    "url": "https://www.salon.com/2024/06/24/months-she-wasted-national-security-lawyer-says-cannons-hubris-turned-case-into-a-mess/"
  },
  {
    "text": "Infant mortality rate rose 8% in wake of Texas abortion ban, study shows  —  In the wake of Texas' abortion ban, the state's infant death rate increased and more died of birth defects, a study published Monday shows.  —  The analysis out of Johns Hopkins University is the latest research … ",
    "url": "https://apnews.com/article/abortion-texas-infant-mortality-birth-defects-b055ac35cdbc9ec13f400b4c3e1056e7"
  },
  {
    "text": "How ‘Pro-Life’ Lost all Meaning  —  The anti-abortion movement may have won the battle with Dobbs, but the war is just getting started.  —  The pro-life movement may have won the battle two years ago today, but they're losing the war—and turning an entire generation away from their cause.",
    "url": "https://www.theatlantic.com/newsletters/archive/2024/06/how-pro-life-lost-all-meaning/678784/"
  },
  {
    "text": "Days before debate, Trump spokesperson clashes with CNN anchor on air  —  “We're going to stop this interview if you're going to keep attacking my colleagues,” Kasie Hunt said.  —  A Donald Trump spokesperson got into a tense exchange with CNN's Kasie Hunt over debate hosts Dana Bash … ",
    "url": "https://www.politico.com/news/2024/06/24/trump-debate-cnn-00164658"
  },
  {
    "text": "One question Trump must be asked in the debate  —  On April 12, 2024, former president Donald Trump sat down for an interview with Time Magazine.  During the interview, Trump was asked explicitly about whether he would allow women to obtain abortion pills if he won another term as president.",
    "url": "https://popular.info/p/one-question-trump-must-be-asked"
  },
  {
    "text": "Inside Biden's Camp David Debate Prep  —  President Biden's aides are working to position him as a campaign-season fighter who can counterpunch on the fly and combat voters' concerns about his age.  —  At Camp David, a movie theater and an airplane hangar have been outfitted with lights … ",
    "url": "https://www.nytimes.com/2024/06/24/us/politics/biden-trump-debate-camp-david.html"
  },
  {
    "text": "Exclusive: Trump reviews plan to halt US military aid to Ukraine unless it negotiates peace with Moscow  —  Two key advisers to Donald Trump have presented him with a plan to end Russia's war in Ukraine — if he wins the presidential election — that involves telling Ukraine … ",
    "url": "https://www.reuters.com/world/us/trump-reviews-plan-halt-us-military-aid-ukraine-unless-it-negotiates-peace-with-2024-06-25/"
  },
  {
    "text": "Scoop: 16 Nobel economists see a Trump inflation bomb … - “While each of us has different views on the particulars of various economic policies, we all agree that Joe Biden's economic agenda is vastly superior to Donald Trump,” the 16 economists write in a letter, first obtained by Axios.",
    "url": "https://www.axios.com/2024/06/25/nobel-prize-winners-biden-economy-trump-inflation"
  },
  {
    "text": "Modi to Visit Russia for First Time Since Invasion of Ukraine  — Modi's trip underscores strong ties between Russia, India  — New Delhi has said diplomacy needed to resolve war in Ukraine  —  Indian Prime Minister Narendra Modi is expected to visit Russia for the first time since … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-25/indian-premier-modi-to-visit-russia-kremlin-aide-says"
  },
  {
    "text": "Rep. Bob Good says he will try to block certification of his GOP primary as he trails challenger  —  NBC News has not yet called the Republican primary in Virginia's 5th District, where state Sen. John McGuire is currently leading Good by just a few hundred votes.",
    "url": "https://www.nbcnews.com/politics/2024-election/bob-good-block-certification-gop-primary-virginia-rcna158648"
  },
  {
    "text": "Netanyahu walks back proposal for Gaza hostage-ceasefire deal endorsed by Biden … - More than 37,500 Palestinians have been killed in Gaza, according to local health officials.  — Netanyahu's comments contradicted statements by Biden administration officials who in recent days … ",
    "url": "https://www.axios.com/2024/06/24/netanyahu-walks-back-gaza-hostage-ceasefire-proposal"
  }
]