[
  {
    "text": "Byrd Rule Violations Continue to Mount on the Republicans' “One Big, Beautiful Bill”  —  WASHINGTON, D.C. - Today, the Senate Parliamentarian again advised that several provisions in the Republicans' “One Big, Beautiful Bill,” would be subject to a 60-vote threshold if they remain in the bill.",
    "url": "https://www.budget.senate.gov/ranking-member/newsroom/press/byrd-rule-violations-continue-to-mount-on-the-republicans-one-big-beautiful-bill"
  },
  {
    "text": "Medicaid changes don't meet Senate rules in ‘big, beautiful bill’ says parliamentarian  —  Senate Republicans hit a major setback in their race to pass a massive tax and spending package on Thursday, as a chamber official ruled against a key provision to get the conference on board to vote for the plan by week's end.",
    "url": "https://www.npr.org/2025/06/26/nx-s1-5446005/senate-republicans-parliamentarian-medicaid-reconciliation-big-beautiful-bill"
  },
  {
    "text": "Thune says Senate won't overrule parliamentarian  —  Senate Majority Leader John Thune said Thursday the Senate would not move to overrule its parliamentarian after she advised that including key provisions in the GOP's domestic-policy megabill would expose it to a fatal Democratic filibuster.",
    "url": "https://www.politico.com/live-updates/2025/06/26/congress/john-thune-senate-parliamentarian-overrule-00425792"
  },
  {
    "text": "Senate parliamentarian blocks Medicaid changes in “big, beautiful bill”  —  The Senate parliamentarian ruled out the Medicaid provider tax provision in the “one big, beautiful bill,” according to Senate Democrats. … - For Senate Majority Leader John Thune (R-S.D.), it removes … ",
    "url": "https://www.axios.com/2025/06/26/senate-medicaid-provider-tax-trump-thune"
  },
  {
    "text": "Eric Adams Meets With Business Leaders Desperate to Stop Mamdani's Rise  —  Daniel Loeb, the hedge fund manager, and some other New York City business leaders are aghast at Zohran Mamdani's success in the Democratic mayoral primary and are considering backing Mr. Adams in the general election.",
    "url": "https://www.nytimes.com/2025/06/26/nyregion/eric-adams-business-leaders-meeting.html"
  },
  {
    "text": "Republicans Ask Donald Trump to Revoke Zohran Mamdani's Citizenship  —  The New York Young Republican Club (NYYRC) has called on the federal government to strip Zohran Mamdani of his citizenship and deport him.  —  On Tuesday evening, Mamdani, a 33-year-old self-described democratic socialist … ",
    "url": "https://www.newsweek.com/republicans-ask-donald-trump-revoke-zohran-mamdani-citizenship-deport-2090891"
  },
  {
    "text": "States can cut off Medicaid funding to Planned Parenthood, the Supreme Court rules  —  A divided Supreme Court allowed states to cut off Medicaid money to Planned Parenthood in a ruling handed down Thursday amid a wider Republican-backed push to defund the country's biggest abortion provider.",
    "url": "https://apnews.com/article/supreme-court-planned-parenthood-abortion-medicaid-e056395b9e5646d13539e76605027a1f"
  },
  {
    "text": "White House to limit intelligence sharing, skip Gabbard at Senate Iran briefing  —  Top officials will brief lawmakers on Thursday amid a political battle over what intelligence reveals about the damage to Iran's nuclear facilities.  —  The White House plans to limit classified intelligence sharing … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/25/iran-intelligence-sharing-gabbard/"
  },
  {
    "text": "Gabbard Dropped From Intelligence Briefing as Trump Rages Over Leak  —  SIDELINED  —  The director of national intelligence is being left out after a leaked assessment said the president's strikes on Iran had set the country's nuclear program back just a few months.",
    "url": "https://www.thedailybeast.com/tulsi-gabbard-dropped-from-intelligence-briefing-as-trump-rages-over-leak/"
  },
  {
    "text": "Early intelligence suggests Iran's uranium largely intact, European officials say  —  Preliminary assessments suggest Tehran was able to move much of its stockpile  —  Preliminary intelligence assessments provided to European governments indicate that Iran's highly enriched uranium stockpile … ",
    "url": "https://www.ft.com/content/0808eeb8-341c-4a4e-8ccf-0db07febef91"
  },
  {
    "text": "Behind Trump's 2024 Victory, a More Racially and Ethnically Diverse Voter Coalition  —  A study of the 2024 election, based on validated voters  —  Table of Contents Table of Contents  —  Pew Research Center conducted this study to better understand which voters cast ballots in the 2024 presidential election and how they voted.",
    "url": "https://www.pewresearch.org/politics/2025/06/26/behind-trumps-2024-victory-a-more-racially-and-ethnically-diverse-voter-coalition/"
  },
  {
    "text": "Mamdani and the Moguls of Madness  —  Will he be a good mayor?  Nobody knows.  But the hysteria is revealing.  —  I was in mid-air when NYC's election results came in, and I'm still not quite home.  So again, not a proper post.  But a few late-morning reactions from the road.",
    "url": "https://paulkrugman.substack.com/p/mamdani-and-the-moguls-of-madness"
  },
  {
    "text": "Critical Hurricane Forecast Tool Abruptly Terminated  —  On Monday, the U.S. Department of Defense announced it would immediately stop ingesting, processing, and transmitting data essential to most hurricane forecasts.  —  The announcement was formalized on Tuesday when NOAA distributed … ",
    "url": "https://michaelrlowry.substack.com/p/critical-hurricane-forecast-tool"
  },
  {
    "text": "ICE Is Using a New Facial Recognition App to Identify People, Leaked Emails Show  —  Immigration and Customs Enforcement (ICE) is using a new mobile phone app that can identify someone based on their fingerprints or face by simply pointing a smartphone camera at them, according to internal ICE emails viewed by 404 Media.",
    "url": "https://www.404media.co/ice-is-using-a-new-facial-recognition-app-to-identify-people-leaked-emails-show/"
  },
  {
    "text": "Iran's Khamenei Makes First Public Comments Since Cease-Fire With Israel  —  Supreme leader strikes defiant tone in a video statement, after not being heard of or seen publicly in days.  —  Iran's supreme leader, Ayatollah Ali Khamenei congratulated Iranians for what he described as a victory … ",
    "url": "https://www.nytimes.com/2025/06/26/world/middleeast/iran-leader-khamenei-statement.html"
  },
  {
    "text": "Support Rises For Giving Most Undocumented Immigrants A Pathway To Legal Status vs. Deportations, Quinnipiac University National Poll Finds; More Than 9 In 10 Voters Say Politically Motivated Violence In The U.S. Is A Serious Problem  — mail_outline",
    "url": "https://poll.qu.edu/poll-release?releaseid=3926"
  },
  {
    "text": "The US economy shrank much faster in the first quarter than previously reported  —  The US economy contracted in the beginning of the year at a much faster pace than previously reported, after new data factored in much weaker consumer spending.  —  Gross domestic product … ",
    "url": "https://cnn.com/2025/06/26/economy/us-gdp-q1-final"
  },
  {
    "text": "Bill Moyers, eminence of public affairs broadcasting, dies at 91  —  He was White House press secretary under Lyndon B. Johnson and Newsday publisher before becoming an acclaimed television journalist, mostly for PBS.  —  Bill Moyers, who served as press secretary to President Lyndon B. Johnson and then … ",
    "url": "https://www.washingtonpost.com/obituaries/2025/06/26/bill-moyers-lbj-pbs-broadcasting-dead/"
  },
  {
    "text": "Former Supreme Court Justice Kennedy says ‘democracy is at risk’  —  The retired Reagan appointee joined a forum on threats to judges and the rule of law.  —  Former Supreme Court Justice Anthony Kennedy warned Thursday that acrimonious political discourse and threats to judges are eroding … ",
    "url": "https://www.politico.com/news/2025/06/26/anthony-kennedy-democracy-judiciary-threats-00427714"
  },
  {
    "text": "Crockett questions Melania Trump's reported ‘Einstein visa’: 'The math ain't mathin\"  —  Rep. Jasmine Crockett (D-Texas) questioned first lady Melania Trump's reported “Einstein visa” inata House hearing Wednesday.  —  “Let me remind y'all that Melania, the first lady, a model … ",
    "url": "https://thehill.com/homenews/house/5370991-crockett-melania-einstein-visa-question/"
  },
  {
    "text": "What It Took To Win  —  The old saw goes that politics is the art of the possible, but it often seems like the art of the impossible: putting together winning coalitions that “objectively” seem to defy logic—or at least, the logic of the pundits.)  My favorite example of this is Trump managing … ",
    "url": "https://www.unpopularfront.news/p/what-it-took-to-win"
  },
  {
    "text": "Vogue's Anna Wintour to tap new editorial leader  —  Anna Wintour, the longtime editor-in-chief of Vogue and a prominent Democratic fundraiser, is seeking a new day-to-day editorial leader at the famed fashion magazine.  —  While multiple outlets reported Thursday that Wintour announced … ",
    "url": "https://thehill.com/blogs/in-the-know/5371652-anna-wintour-vogue-editor-in-chief-conde-nast/"
  },
  {
    "text": "Why Trump regime shattered the Constitution to crush a 29-year-old Maryland laborer  —  “What's Kafkaesque [...] is when you enter a surreal world in which all your control patterns, all your plans, the whole way in which you have configured your own behavior, begins to fall to pieces [...] … ",
    "url": "https://www.inquirer.com/opinion/kilmar-abrego-garcia-trump-justice-20250626.html"
  },
  {
    "text": "ICE Plans to Send Abrego Garcia to an Unnamed Nation That Isn't El Salvador  —  A government lawyer laid out a plan in court Thursday, but without a clear timeline.  — Copy  —  Kilmar Armando Abrego Garcia, back in the United States after the Trump administration mistakenly deported … ",
    "url": "https://www.notus.org/immigration/abrego-garcia-third-country-ice-doj-court"
  }
]