[
  {
    "text": "Donald Trump appeals $454 million judgment in New York civil fraud case  —  Donald Trump has appealed his $454 million New York civil fraud judgment, challenging a judge's finding that Trump lied about his wealth as he grew the real estate empire that launched him to stardom and the presidency.",
    "url": "https://apnews.com/article/trump-new-york-civil-fraud-appeal-letitia-james-2f8cc521e00e4a34a1342b961c1416ce"
  },
  {
    "text": "Trump's plan to use Judge Cannon to block Judge Chutkan and avoid trial  —  Former President Donald Trump's lawyers see a major opportunity this week to use his criminal document mishandling case in Florida to create an impasse on his calendar for the two federal judges overseeing his major criminal cases.",
    "url": "https://www.cnn.com/2024/02/26/politics/trump-judge-cannon-chutkan-trial-plan/"
  },
  {
    "text": "The Back Channel Talks to Secure McConnell's Endorsement of Trump  —  The conversations between the Trump and McConnell camps have been happening between key advisers to both men.  —  Donald J. Trump and Mitch McConnell haven't said a word to each other since December 2020.",
    "url": "https://www.nytimes.com/2024/02/26/us/politics/trump-mcconnell-endorsement.html"
  },
  {
    "text": "Exclusive: Key figure in fake electors plot concealed damning posts on secret Twitter account from investigators  —  Kenneth Chesebro, the right-wing attorney who helped devise the Trump campaign's fake electors plot in 2020, concealed a secret Twitter account from Michigan prosecutors … ",
    "url": "https://www.cnn.com/2024/02/26/politics/kenneth-chesebro-secret-twitter-account-kfile/"
  },
  {
    "text": "Trump seeks to block Stormy Daniels, Michael Cohen from testifying at NY hush money trial  —  Former President Trump's lawyers in his hush-money case on Monday demanded a New York judge block key witnesses from testifying in Trump's first criminal trial set to begin next month.",
    "url": "https://thehill.com/homenews/4490109-trump-block-stormy-daniels-michael-cohen-ny-hush-money-trial/"
  },
  {
    "text": "Manhattan DA Alvin Bragg asks for gag order in Trump hush money case after dozens of threats  —  Trump is charged with falsifying records related to a hush money payment.  —  Manhattan District Attorney Alvin Bragg speaks during a news conference at his office in New York City, February 22, 2024.",
    "url": "https://abcnews.go.com/US/manhattan-da-alvin-bragg-asks-judge-impose-gag/story?id=107554385"
  },
  {
    "text": "Biden says temporary cease-fire in Gaza could come next week  —  Negotiators have been working for months to secure a deal to release more than 100 Israeli hostages  —  President Biden on Monday said he hoped a deal between Israel and Hamas could emerge as soon as next week … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/26/biden-cease-fire-gaza/"
  },
  {
    "text": "Zelensky says Trump doesn't understand Putin because he has never fought him  —  Former US President Donald Trump will be “against Americans” if he chooses to support Russia over Ukraine, President Volodymyr Zelensky told CNN Sunday, in a stark warning as his country enters a third year of full-scale war.",
    "url": "https://www.cnn.com/2024/02/26/europe/zelensky-interview-ukraine-war-aid-trump-intl/"
  },
  {
    "text": "Trump's CPAC speech showed clear signs of major cognitive decline — yet MAGA cheered  —  A confused Donald Trump kept up his threats of retribution during this weekend's conservative confab  —  Donald Trump was in his full glory over the weekend at the annual Conservative Political Action Committee (CPAC) conference.",
    "url": "https://www.salon.com/2024/02/26/cpac-speech-showed-clear-signs-of-major-cognitive-decline--yet-maga-cheered/"
  },
  {
    "text": "Judge orders Biden informant Alexander Smirnov to remain in jail  —  The former FBI informant is accused of lying when he claimed that Joe and Hunter Biden took bribes to shield a Ukrainian energy company  —  LOS ANGELES — A former FBI informant pleaded not guilty Monday to charges … ",
    "url": "https://www.washingtonpost.com/national-security/2024/02/26/fbi-informant-biden-smirnov-not-guilty/"
  },
  {
    "text": "I Was a Heretic at The New York Times  —  I did what I was hired to do, and I paid for it.  —  On one of my first days at The New York Times, I went to an orientation with more than a dozen other new hires.  We had to do an icebreaker: Pick a Starburst out of a jar and then answer a question.",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/tom-cotton-new-york-times/677546/"
  },
  {
    "text": "Pregnant women can't get divorced in Missouri.  Here's why  —  JEFFERSON CITY, Mo. (WDAF) - As it stands, Missouri judges cannot legally finalize a divorce if a woman is pregnant.  —  Three other states have similar laws: Texas, Arizona, and Arkansas.  While a pregnant woman can still file … ",
    "url": "https://thehill.com/changing-america/respect/equality/4488919-pregnant-women-cant-get-divorced-in-missouri-heres-why/"
  },
  {
    "text": "Jack Smith says Trump's handling of classified docs was far worse than Biden's  —  In a new filing in Trump's Florida case, Smith cited Robert Hur's report on Joe Biden's retention of classified material.  —  Special counsel Jack Smith said Monday that President Joe Biden's handling … ",
    "url": "https://www.politico.com/news/2024/02/26/jack-smith-says-trump-classified-docs-00143346"
  },
  {
    "text": "Letter With White Powder Mailed to Donald Trump Jr.'s Florida Home: Sources  —  Multiple fire trucks and men in hazmat suits were spotted outside Donald Trump Jr.'s home in Jupiter, Florida, on Monday evening. … Multiple fire trucks and men in hazmat suits were spotted outside Donald Trump Jr.'s home … ",
    "url": "https://www.thedailybeast.com/hazmat-teams-spotted-at-don-jrs-florida-home-after-white-powder-discovered"
  },
  {
    "text": "Justices question Texas and Florida efforts to restrict social media companies  —  On Monday, over nearly four hours of oral arguments, the justices of the U.S. Supreme Court debated whether Florida and Texas can — with slightly different laws — mandate that social media companies change … ",
    "url": "https://www.lawdork.com/p/scotus-texas-florida-social-media-laws"
  },
  {
    "text": "Fani Willis slammed with harassing calls after Trump lawyer puts contact info in court doc  —  Fulton County District Attorney Fani Willis and special prosecutor Nathan Wade were slammed with harassing phone calls over the weekend after one of former President Donald Trump's attorneys put … ",
    "url": "https://www.rawstory.com/fani-willis-nathan-wade-2667369713/"
  },
  {
    "text": "Alabama is using the notion that embryos are people to surveil and harass women  —  Even before the court ruled in favor of this vulgar fiction, state authorities relied on the concept to intimidate and jail women  —  Something that's important to remember about last week's ruling … ",
    "url": "https://www.theguardian.com/commentisfree/2024/feb/26/alabama-ivf-frozen-embryos-surveillance"
  },
  {
    "text": "Michael Whatley officially announces for RNC Chair  —  The announcement comes after Ronna McDaniel announced she would depart the committee.  —  North Carolina GOP Chair Michael Whatley announced his candidacy to lead the Republican National Committee on Monday.",
    "url": "https://www.politico.com/news/2024/02/26/michael-whatley-officially-announces-for-rnc-chair-00143364"
  },
  {
    "text": "Rep. Perry says House GOP should cancel Biden's SOTU address  —  Former House Freedom Caucus Chair Rep. Scott Perry (R-Pa.) is calling on Speaker Mike Johnson (R-La.) to stop President Biden from giving his annual State of the Union address next month.  —  Perry said during an appearance Monday … ",
    "url": "https://thehill.com/homenews/4489178-rep-perry-says-house-gop-should-cancel-bidens-sotu-address/"
  },
  {
    "text": "Andy Kim Sues to Block Preferential Treatment on Ballots in Senate Race  —  The federal lawsuit is seen as a direct challenge to Tammy Murphy, Mr. Kim's chief rival in New Jersey, who stands to benefit most from the current ballot layout.  —  Representative Andy Kim, a Democrat running … ",
    "url": "https://www.nytimes.com/2024/02/26/nyregion/new-jersey-senate-race-ballot-design.html"
  },
  {
    "text": "$1 Billion Donation Will Provide Free Tuition at a Bronx Medical School  —  Dr. Ruth Gottesman, a longtime professor at the Albert Einstein College of Medicine, is making free tuition available to all students going forward.  —  The 93-year-old widow of a Wall Street financier has donated $1 billion … ",
    "url": "https://www.nytimes.com/2024/02/26/nyregion/albert-einstein-college-medicine-bronx-donation.html"
  },
  {
    "text": "Gavin Newsom faces another recall threat in California  —  Activists who successfully placed a recall on California's ballot in 2021 and forced the Democratic governor to spend tens of millions are trying to oust him again.  —  SACRAMENTO, California — Conservative activists … ",
    "url": "https://www.politico.com/news/2024/02/26/newsom-recall-budget-2024-00143252"
  },
  {
    "text": "Police Bodycam Shows Sheriff Hunting for ‘Obscene’ Books at Library  —  Body camera footage from Idaho reveals a sheriff hunting for a YA book he could use for a political stunt.  —  Sheriff Robert Norris is speaking into his body camera.  “Today's date is April 20, approximately 7 a.m … ",
    "url": "https://www.404media.co/email/b3d9cb53-c0fa-43fc-b824-a302be50bb95/"
  },
  {
    "text": "FTC Challenges Kroger's Acquisition of Albertsons  —  Largest supermarket merger in U.S. history will eliminate competition and raise grocery prices for millions of Americans, while harming tens of thousands of workers, FTC alleges  —  The Federal Trade Commission today sued to block … ",
    "url": "https://www.ftc.gov/news-events/news/press-releases/2024/02/ftc-challenges-krogers-acquisition-albertsons"
  },
  {
    "text": "The Top Muslim State Lawmaker in Michigan Wants You to Turn on Joe Biden  —  Michigan Rep. Abraham Aiyash hopes to send the president a message in Tuesday's primary: Cease-fire or bust.  —  At just 28 years old, Michigan Rep. Abraham Aiyash, now 30, rocketed into political prominence last year … ",
    "url": "https://www.politico.com/news/magazine/2024/02/26/abraham-aiyash-biden-michigan-primary-00143347"
  }
]