[
  {
    "text": "Scoop: Trump personally squeezes senators on Matt Gaetz … - “He clearly wants Matt Gaetz,” said Sen. Kevin Cramer (R-N.D.), who received a call from Trump. … - “One thing about Donald Trump, people should never confuse his support for one of his nominees as a tactical or strategic tool for somebody else,” Cramer said.",
    "url": "https://www.axios.com/2024/11/18/trump-gaetz-confirmation-senate"
  },
  {
    "text": "Gaetz May Not Be Confirmed, Trump Admits.  He's Pushing Him and Others Anyway.  —  The president-elect is taking a flood-the-zone approach to his cabinet nominations, betting that the Senate won't dare to turn them all down.  —  In his private conversations over the past few days … ",
    "url": "https://www.nytimes.com/2024/11/18/us/politics/trump-cabinet.html"
  },
  {
    "text": "Senate Republicans deliver a message to Trump: Gaetz's confirmation is in jeopardy  —  They're privately hoping Trump doesn't make them walk the plank.  —  Numerous Republican lawmakers told Donald Trump and his team that they believe his pick to be attorney general, controversial Rep. Matt Gaetz … ",
    "url": "https://www.politico.com/news/2024/11/19/senate-republicans-matt-gaetz-attorney-general-00190332"
  },
  {
    "text": "Negative signs for Gaetz as senators brush off questions amid Trump pressure  —  A negative sign looms for Matt Gaetz: Nearly a dozen GOP senators won't commit to confirming him for attorney general, saying they want to let the process play out.  And many, even if they aren't insisting … ",
    "url": "https://www.politico.com/live-updates/2024/11/18/congress/gop-senators-on-gaetz-ethics-report-00190295"
  },
  {
    "text": "Mace introduces bill to bar trans women from Capitol restrooms  —  Rep. Nancy Mace (R-S.C.) on Monday introduced a bill to bar transgender women from facilities on Capitol Hill that match their gender identity.  —  The resolution, which would prohibit members, officers and employees … ",
    "url": "https://thehill.com/homenews/house/4997024-mace-introduces-bill-transgender/"
  },
  {
    "text": "Republican bathroom bill targets Congress's first transgender member  —  South Carolina Republican Nancy Mace introduces bill two months before Sarah McBride is to be sworn in  —  After Delaware elected the first ever openly transgender member of Congress earlier this month … ",
    "url": "https://www.theguardian.com/us-news/2024/nov/19/sarah-mcbride-congress-bathroom-bill-transgender"
  },
  {
    "text": "‘Kissing the ring?’  MSNBC ‘Morning Joe’ hosts meet with Trump to reopen lines of communication  —  MSNBC hosts Joe Scarborough and Mika Brzezinski, fierce critics of President-elect Donald Trump, say they traveled to Mar-a-Lago for a meeting with him to reopen lines of communication that would better serve their morning show viewers.",
    "url": "https://apnews.com/article/morning-joe-trump-meeting-ring-cf4816dd28372a4c942d256df2e440ae"
  },
  {
    "text": "‘Morning Joe’ meeting with Trump was driven by fears of retribution from incoming administration, sources say  —  New York CNN  —  “Morning Joe” co-hosts Joe Scarborough and Mika Brzezinski announced Monday, in dramatic fashion, that they went to Mar-a-Lago last week for a fence-mending meeting with President-elect Donald Trump.",
    "url": "https://www.cnn.com/2024/11/19/media/morning-joe-trump-mar-a-lago-meeting-fears/"
  },
  {
    "text": "Trump Confirms Plan to Use Military to Carry Out Mass Deportations  —  Further proof that the president-elect is willing—even excited—to implement the cruel immigration policy.  —  On Monday, Donald Trump appeared to confirm that he is willing—even eager—to declare a national emergency … ",
    "url": "https://www.motherjones.com/politics/2024/11/trump-mass-deportations-military-national-emergency/"
  },
  {
    "text": "Trump Reminds Everyone: He Wants US Soldiers in US Streets  —  At 4:03 a.m. ET, the President-elect was online.  He was thinking about “military assets” and mass deportations.  —  Tom Fitton, the right-wing activist and Judicial Watch leader, had written a post on the incoming President's … ",
    "url": "https://talkingpointsmemo.com/news/trump-reminds-everyone-he-wants-us-soldiers-in-us-streets"
  },
  {
    "text": "Trump nominates former Rep. Sean Duffy as transportation secretary  —  President-elect Donald Trump nominated former Rep. Sean Duffy as transportation secretary.  —  After appearing on several reality TV shows, on which he met his wife, Duffy served as a district attorney in Wisconsin from 2002 to 2010.",
    "url": "https://www.washingtonexaminer.com/news/white-house/3234060/trump-nominates-sean-duffy-transportation-secretary/"
  },
  {
    "text": "Lawyer tells ABC News his 2 clients told House Ethics Committee that Gaetz paid them for sex  —  Trump has tapped Gaetz, a former congressman, to be the new attorney general.  —  Rep. Matt Gaetz departs after speaking during the Conservative Political Action Conference, CPAC 2024 … ",
    "url": "https://abcnews.go.com/US/lawyer-tells-abc-news-2-clients-told-house/story?id=115863675"
  },
  {
    "text": "Biden should order background checks of Trump's Cabinet picks  —  The FBI has conducted background investigations of White House nominees since at least the tenure of President Dwight Eisenhower's time in office.  —  We had fair warning.  Last month, The New York Times reported … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/biden-trump-cabinet-picks-fbi-background-checks-rcna180698"
  },
  {
    "text": "Dan Osborn Wants to Help the Working Class Run for Office  —  Mr. Osborn, the industrial mechanic who turned a long-shot Senate bid in red Nebraska into an unexpectedly tight race, is starting a PAC aimed at recruiting more blue-collar candidates like himself.",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/dan-osborn-working-class-pac.html"
  },
  {
    "text": "RFK Jr. is a massive public health threat  —  Dems like Jared Polis shouldn't pretend pretend otherwise.  —  ∙ Paid … Donald Trump, in his vacuous orange wisdom, has nominated vaccine denier, crank, and champion of disease Robert F. Kennedy Jr. to be the Secretary of Health and Human Services (HHS).",
    "url": "https://www.publicnotice.co/p/rfk-jr-public-health-threat-vaccines"
  },
  {
    "text": "Half of Ukrainians Want Quick, Negotiated End to War  —  EU, U.K. favored over U.S. as negotiators … LONDON — After more than two years of grinding conflict, Ukrainians are increasingly weary of the war with Russia.  In Gallup's latest surveys of Ukraine, conducted in August and October 2024 … ",
    "url": "https://news.gallup.com/poll/653495/half-ukrainians-quick-negotiated-end-war.aspx"
  },
  {
    "text": "Republicans slow down Senate floor to delay Biden judicial picks  —  Senate Republicans moved to slow down the pace of judicial nomination confirmations in the waning days of Joe Biden's presidency on Monday evening, forcing the chamber into hours of routine votes.  What happened?",
    "url": "https://www.politico.com/live-updates/2024/11/19/congress/senate-slowdown-00190335"
  },
  {
    "text": "US Won't Adjust Posture After Russia Lowers Nuclear Threshold  —  The US sees no reason to adjust its nuclear posture in response to Russia's decision to lower the threshold for using atomic weapons, a National Security Council spokesperson said.  —  The Russian decision wasn't a surprise … ",
    "url": "https://www.bloomberg.com/news/articles/2024-11-19/us-won-t-adjust-posture-after-russia-lowers-nuclear-threshold"
  },
  {
    "text": "Ken Martin, a Minnesotan With Deep Democratic Ties, Joins the D.N.C. Race  —  The chairman of Minnesota Democrats, he has longstanding connections to many of the Democratic National Committee members who will choose their next leader.  —  The race for chair of the Democratic National Committee … ",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/ken-martin-dnc-race.html"
  },
  {
    "text": "For Minority Working-Class Voters, Dismay in Democrats Led to Distrust  —  In scores of interviews throughout 2024, Latino, Black and Asian American voters, many of whom voted for Donald Trump, said they no longer trusted Democrats to improve the economy.  —  The working-class voters Vice … ",
    "url": "https://www.nytimes.com/2024/11/19/us/politics/trump-working-class-voters.html"
  },
  {
    "text": "Trump Plans to Attend Musk's SpaceX Launch on Tuesday  —  The president-elect's decision to witness the liftoff is another example of his close ties to the world's wealthiest entrepreneur.  —  President-elect Donald J. Trump plans to attend a SpaceX launch in Texas on Tuesday … ",
    "url": "https://www.nytimes.com/2024/11/18/us/politics/trump-musk-spacex-launch-texas.html"
  },
  {
    "text": "Pennsylvania Dem Gov. Josh Shapiro sides with state supreme court ruling not to count certain mail-in ballots  —  The ruling is a victory for GOP officials in an effort to keep the party's narrow Senate victory  —  Join Fox News for access to this content  —  Pennsylvania Gov. Josh Shapiro … ",
    "url": "https://www.foxnews.com/politics/pennsylvania-dem-gov-josh-shapiro-sides-state-supreme-court-ruling-not-count-certain-mail-in-ballots"
  },
  {
    "text": "‘Ready for prime time’: Trump trots out once-scorned economic plans  —  The new world of policy debate reflects Trump's towering influence over a GOP that he has transformed, boosting ideas once considered quixotic or ill-advised in Washington.  —  Donald Trump has been president before … ",
    "url": "https://www.politico.com/news/2024/11/19/trump-unusual-economic-ideas-00189559"
  }
]