[
  {
    "text": "Special Counsel Report Says Trump Would Have Been Convicted in Election Case  —  “But for Mr. Trump's election and imminent return to the presidency, the office assessed that the admissible evidence was sufficient to obtain and sustain a conviction at trial,” the report said.",
    "url": "https://www.nytimes.com/2025/01/14/us/politics/trump-special-counsel-report-election-jan-6.html?unlocked_article_code=1.pE4.qEsJ.JEVOGbzuKumK&smid=url-share"
  },
  {
    "text": "Justice Dept. releases Trump special counsel report on Jan. 6 case  —  President-elect Donald Trump has tried to prevent the release of special counsel Jack Smith's report before he takes office next week.  —  If Donald Trump wasn't elected president in November, the Justice Department … ",
    "url": "https://www.washingtonpost.com/national-security/2025/01/13/trump-jan-6-classified-documents-investigations-report-jack-smith/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2NzQ0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM4MTI2Nzk5LCJpYXQiOjE3MzY3NDQ0MDAsImp0aSI6ImY3NDAxYjhlLTgwMTAtNDMxMi04ZGFhLTc1NzE4NzI4ZmZhMyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzAxLzEzL3RydW1wLWphbi02LWNsYXNzaWZpZWQtZG9jdW1lbnRzLWludmVzdGlnYXRpb25zLXJlcG9ydC1qYWNrLXNtaXRoLyJ9.htf79lOEXtgCoUMTpZO0-Xm_DRjwQJa0IS63ZOR4aXk&itid=gfta"
  },
  {
    "text": "Justice Dept. sends Congress Jack Smith's report on Trump's effort to overturn 2020 election  —  The special counsel's report calls Trump's claims that he was influenced by Biden for political reasons “laughable.”  —  WASHINGTON — President-elect Donald Trump “inspired his supporters … ",
    "url": "https://www.nbcnews.com/politics/justice-department/justice-dept-sends-congress-jack-smiths-report-trumps-effort-overturn-rcna187492"
  },
  {
    "text": "China Discusses Sale of TikTok US to Musk as One Possible Option  — ByteDance's preferred strategy is to fight ban, sources say  — Trump has said he would like to delay ban to seek resolution  —  Chinese officials are evaluating a potential option that involves Elon Musk acquiring … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-14/china-discusses-sale-of-tiktok-us-to-musk-as-one-possible-option?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTczNjgxMzk1OSwiZXhwIjoxNzM3NDE4NzU5LCJhcnRpY2xlSWQiOiJTUFJTMDNUMEFGQjQwMCIsImJjb25uZWN0SWQiOiI3MDQyN0U3REVGMkM0MDEzODNCNDUzRjAyNUE2NDc3NyJ9.7qgkxCtNvjSnnOz1POZ22exlVzW6sZbXYfKK9YbQ3oU&leadSource=uverify%20wall"
  },
  {
    "text": "Elon Musk Is Expected to Use Office Space in the White House Complex  —  The location suggests that Mr. Musk, who owns companies with billions of dollars in contracts with the federal government, will continue to have remarkable access to President-elect Donald J. Trump.",
    "url": "https://www.nytimes.com/2025/01/13/us/politics/elon-musk-white-house-trump.html?unlocked_article_code=1.pE4.GrrC.TVbMLIcP05Pd&smid=url-share"
  },
  {
    "text": "Pete Hegseth's FBI background check does not include interviews with key women from his past  —  The report doesn't have material from his ex-wives or a woman who accused Hegseth of sexual assault in 2017.  Hegseth has said that encounter was consensual, and prosecutors never filed charges.",
    "url": "https://www.nbcnews.com/politics/congress/pete-hegseths-fbi-background-check-not-include-interviews-key-women-rcna187531"
  },
  {
    "text": "The Pressure Campaign to Get Pete Hegseth Confirmed as Defense Secretary  —  Supporters of Donald Trump's nominee have intimidated potential witnesses and suppressed the F.B.I. background check of the former Fox News host in the run-up to his Senate hearing.",
    "url": "https://www.newyorker.com/news/the-lede/the-pressure-campaign-to-get-pete-hegseth-confirmed-as-defense-secretary"
  },
  {
    "text": "Playbook: Hegseth, Senate Dems prepare for battle  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  JACK SMITH'S MIDNIGHT RIDE — Six days before President-elect DONALD TRUMP is due to be sworn as the victor of the 2024 election, special counsel JACK SMITH's report … ",
    "url": "https://www.politico.com/newsletters/playbook/2025/01/14/hegseth-senate-dems-prepare-for-battle-00198030"
  },
  {
    "text": "Johnson confirms ‘discussions’ on tying wildfire aid to debt limit  —  House Speaker Mike Johnson confirmed to reporters Monday there's “been some discussion” of tying California wildfire aid to a debt limit increase, after GOP members raised the issue with Donald Trump in several meetings … ",
    "url": "https://www.politico.com/live-updates/2025/01/13/congress/johnson-wildfire-california-debt-limit-00197900"
  },
  {
    "text": "Greenland to Trump: We're Not for Sale but Let's Talk Business  —  The country's prime minister said that while Greenlanders do not want to become Americans, “the reality is we are going to work with the U.S. — yesterday, today and tomorrow.”  —  The country's prime minister … ",
    "url": "https://www.nytimes.com/2025/01/13/world/europe/greenland-trump-business.html"
  },
  {
    "text": "Harris declines to invite Vance for courtesy visit to vice president's residence before inauguration  —  When JD Vance, his wife Usha and their three young children move into the Naval Observatory residence on Jan. 20, it will be their first time inside the white Queen Anne-style mansion … ",
    "url": "https://www.cbsnews.com/news/harris-jd-vance-vice-presidents-residence/"
  },
  {
    "text": "Biden's parting gift: Student loan debt relief  —  More than 5 million borrowers have had loans forgiven since the president took office.  —  In the waning days of Joe Biden's presidency, his administration announced on Monday that it will provide student debt relief to 150,000 borrowers.",
    "url": "https://www.politico.com/news/2025/01/13/biden-student-loan-relief-150000-borrowers-00197855"
  },
  {
    "text": "Statement from President Biden Announcing the Names of CVN 82 and CVN 83  —  I am proud to announce that the next two Gerald R. Ford-class nuclear-powered aircraft carriers will be named for two former presidents: Bill Clinton and George W. Bush.  —  When I personally delivered the news to Bill and George, they were deeply humbled.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/13/statement-from-president-biden-announcing-the-names-of-cvn-82-and-cvn-83/"
  },
  {
    "text": "Gavin Newsom and California Democrats reach $50M deal to Trump-proof the state  —  The first-of-its-kind agreement would fund litigation against the incoming White House and protect against a potential mass deportation of immigrants.  —  SACRAMENTO, California — California Democrats … ",
    "url": "https://www.politico.com/news/2025/01/13/newsom-california-democrats-trump-legal-fights-00197784"
  },
  {
    "text": "Statement by President Biden on the Executive Order on Advancing U.S. Leadership in Artificial Intelligence Infrastructure  —  The United States leads the world at the frontier of artificial intelligence (AI).  Cutting-edge AI will have profound implications for national security … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2025/01/14/statement-by-president-biden-on-the-executive-order-on-advancing-u-s-leadership-in-artificial-intelligence-infrastructure/"
  },
  {
    "text": "Dollar Falls on Report Trump Team Is Mulling Gradual Tariffs  — Aussie, kiwi lead advance against greenback after the report  — The moves show the importance of tariffs in swaying sentiment  —  The dollar fell against almost every major currency after Bloomberg News reported … ",
    "url": "https://www.bloomberg.com/news/articles/2025-01-14/dollar-falls-on-report-trump-team-mulling-gradual-tariffs"
  },
  {
    "text": "Trump flies US flag at full height before end of 30-day mourning period following Carter's death  —  U.S. flags at President-elect Donald Trump 's private Mar-a-Lago club are back to flying at full height.  Flags are supposed to fly at half-staff through the end of January out of respect … ",
    "url": "https://apnews.com/article/trump-carter-flag-half-staff-mar-a-lago-c90e341b89615aef8817c6fc021a93b7"
  },
  {
    "text": "Trump Gets Insane Show of Support From Washington Post Editorial Board  —  The Washington Post's editorial board made the mind-boggling decision Monday to say they support all but four of Donald Trump's Cabinet nominees, and their rationales were as unconvincing as they were brief.",
    "url": "https://newrepublic.com/post/190180/donald-trump-nominees-support-washington-post-editorial-board"
  },
  {
    "text": "Putin needs Trump's help more than ever  —  And Trump is signaling that he'll deliver.  —  It's been nearly three years since Vladimir Putin's despotic regime began its reign of terror against Ukraine by attempting to conquer the country and, in Putin's words, put an end to the “fictional” Ukrainian nation.",
    "url": "https://www.publicnotice.co/p/putin-trump-ukraine-inauguration-2025"
  },
  {
    "text": "How Trump's Greenland demands could impact Ozempic costs  —  President-elect Trump's threat to tariff Denmark if it resists his acquisition plans for the island territory of Greenland could disrupt one export that is wildly popular in America: Ozempic.  —  Trump added Denmark to his growing list … ",
    "url": "https://thehill.com/homenews/administration/5083218-trump-greenland-denmark-ozempic-tariffs/"
  },
  {
    "text": "Zuckerberg Debuts ‘Real Mark’ in Push to Woo Trump  —  Meta pursues a MAGA makeover, in the latest political pivot for a company that once banned the now-president-elect from its platforms  —  Mark Zuckerberg wants Donald Trump to get to know the “real Mark.”",
    "url": "https://www.wsj.com/tech/mark-zuckerberg-meta-trump-pivot-392e4a3f?st=jPh9dB&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Special Counsel Report on Hunter Biden Denounces President's Criticism of Case  —  The report by the special counsel, David C. Weiss, criticized President Biden for making “baseless accusations” that threatened “the integrity of the justice system as a whole.”",
    "url": "https://www.nytimes.com/2025/01/13/us/politics/special-counsel-report-hunter-biden.html"
  },
  {
    "text": "Meta goes mask-off  —  I. Notes on a theme  —  On Wednesday, as news of Meta's new guidelines permitting homophobic and transphobic speech on its platforms spread through the company, Loredana Crisan spoke up to defend them.  —  As she would tell employees in a previously unreported internal post obtained … ",
    "url": "https://www.platformer.news/meta-trump-pivot-messenger-themes-labor-zuckerberg-wishlist/"
  },
  {
    "text": "Elon Musk Exposed Over Right-Wing Lie on L.A. Fires  —  Elon Musk was fact-checked on his own livestream after making false statements about the California wildfires, and Gavin Newsom was quick to call out the tech mogul on social media.  —  In a post on X Sunday night … ",
    "url": "https://newrepublic.com/post/190157/elon-musk-fact-check-water-shortage-la-fires"
  },
  {
    "text": "Trump made the GOP a big-tent party.  Now, he's stuck with the infighting.  —  The clashes are a preview to the challenges the president-elect faces.  —  A coalition of MAGA die-hards, tech bros and blue-collar workers were key to Donald Trump's November victory.  —  Now, some of them are already at each other's throats.",
    "url": "https://www.politico.com/news/2025/01/14/trump-republicans-bannon-musk-00197996"
  }
]