[
  {
    "text": "Trump is everywhere.  Anxious Dems wonder why Harris isn't.  —  Trump is everywhere.  Democrats are increasingly wondering why Harris isn't.  —  Democratic operatives, including some of Kamala Harris' own staffers, are growing increasingly concerned about her relatively light campaign schedule … ",
    "url": "https://www.politico.com/news/2024/10/05/harris-30-days-00182592"
  },
  {
    "text": "30 Days Out, the Harris and Trump Campaigns Brace for ‘Trench Warfare’  —  With tight contests in all seven battleground states, the candidates are pressing for a few thousand votes that could sway the outcome of the entire election.  —  As Vice President Kamala Harris and former President … ",
    "url": "https://www.nytimes.com/2024/10/05/us/politics/trump-harris-30-days-to-election.html"
  },
  {
    "text": "Harris is running a much bigger campaign than Trump.  Will it matter?  —  She spends three times as much, employs hundreds more staff and dominates the ad war.  But the race is effectively tied.  —  With a month to go, Donald Trump and Kamala Harris remain nearly tied in battleground polls.",
    "url": "https://www.washingtonpost.com/politics/2024/10/05/harris-trump-campaign-spending/"
  },
  {
    "text": "Trump Made Another Joke About Supporter Killed At Pennsylvania Rally: Report  —  The news comes as the former president is set to return to the site of his July assassination attempt.  —  LOADING  —  Donald Trump used a reference to the widow of Corey Comperatore — a supporter killed during … ",
    "url": "https://www.huffpost.com/entry/trump-joke-widow-corey-comperatore-butler-rally-tape_n_670107d0e4b0c12c1d3bf72e"
  },
  {
    "text": "As Lawmaker Claims Trump's Shooting Was Inside Job, G.O.P. Indulges Him  —  Representative Eli Crane, a first-term Arizona Republican, has emerged as the chief right-wing voice pushing conspiracy theories about the Trump assassination attempts.  —  He posits that there is a mole within … ",
    "url": "https://www.nytimes.com/2024/10/05/us/politics/as-lawmaker-claims-trumps-shooting-was-inside-job-gop-indulges-him.html"
  },
  {
    "text": "Election 2024 live updates: Trump rallies in Butler, PA, for first time since assassination attempt  —  Trump's running mate, Sen. JD Vance of Ohio, will attend the rally, in addition to Elon Musk, Lara Trump and other close allies of the former president. … Heightened security measures are in place for Trump's return to Butler",
    "url": "https://www.nbcnews.com/politics/2024-election/live-blog/-election-2024-trump-pa-rally-live-updates-rcna174023"
  },
  {
    "text": "Truth Social Users Are Losing Ridiculous Sums of Money to Scams  —  Read the complaints submitted to the FTC by users of Donald Trump's social media platform. … Donald Trump launched Truth Social in 2022 as a social media platform where the MAGA faithful could hang out without any liberals to spoil the fun.",
    "url": "https://gizmodo.com/truth-social-users-are-losing-ridiculous-sums-of-money-to-scams-2000506604"
  },
  {
    "text": "October 4, 2024  —  MAGA Republicans are now lying about the federal response to Hurricane Helene in much the same way they lied about Haitian migrants bringing chaos and disease to Springfield, Ohio.  Both disinformation efforts are flat-out lies, and both are designed to demonize immigrants.",
    "url": "https://heathercoxrichardson.substack.com/p/october-4-2024"
  },
  {
    "text": "What Really Happened On Tim Walz's Trips to China  —  Former students reflect on their time in China with the would-be vice president.  —  Tim Walz would like to take Donald Trump to China — or at least that is what he said during this week's vice-presidential debate.",
    "url": "https://www.politico.com/news/magazine/2024/10/05/what-really-happened-on-tim-walzs-trips-to-china-00179326"
  },
  {
    "text": "U.S. Wiretap Systems Targeted in China-Linked Hack  —  AT&T and Verizon are among the broadband providers that were breached  —  A cyberattack tied to the Chinese government penetrated the networks of a swath of U.S. broadband providers, potentially accessing information from systems … ",
    "url": "https://www.wsj.com/tech/cybersecurity/u-s-wiretap-systems-targeted-in-china-linked-hack-327fc63b?st=C5ywbp&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Melania Trump Reveals Why Donald Keeps Phoning Her Personal Doctor  —  ‘GENUINE AND CARING’  —  The former first lady opens about surprising aspects of her marriage in her forthcoming memoir and confirms she is an unrepentant election denier. … Melania Trump has opened up about a surprising aspect … ",
    "url": "https://www.thedailybeast.com/melania-trump-reveals-why-donald-keeps-phoning-her-personal-doctor-and-what-she-believes-about-2020-election"
  },
  {
    "text": "For First Time in 20 Years, Purdue Won't Have Election Day Polling Place on Campus  —  Purdue University in Indiana will not have an Election Day polling place this year.  The Tippecanoe County Election Board decided not to hold one, even though the campus has had one during the last four presidential elections.",
    "url": "https://www.democracydocket.com/news-alerts/for-first-time-in-20-years-purdue-wont-have-election-day-polling-place-on-campus/"
  },
  {
    "text": "Russia to remove Taliban terrorist status, envoy says  —  Russia is preparing to remove the terrorist designation from the Taliban, Russian envoy to Afghanistan Zamir Kamulov announced Friday, according to state media.  —  Kamulov said the Federal Security Service, Russia's security agency … ",
    "url": "https://thehill.com/policy/international/4917615-russia-taliban-remove-terrorist-designation/"
  },
  {
    "text": "Trump lost the respect of veterans - including me.  He's a risk to our democracy.  —  I am one of hundreds of former national security leaders who have endorsed Harris for president.  We have been concerned for some time about the truly troubling prospect of the return of Trump.",
    "url": "https://www.usatoday.com/story/opinion/voices/2024/10/05/trump-attacks-military-families-veterans-vote-harris/75458231007/"
  },
  {
    "text": "Who's Who in Jack Smith's Immunity Brief  —  Editors' notes: Readers may also be interested in an annotated version of the DOJ brief with names included.  Klasfeld's reporting is part of Just Security's Trump Trials Clearinghouse.  —  Special Counsel Jack Smith's massive legal brief detailing … ",
    "url": "https://www.justsecurity.org/103533/whos-who-jack-smith-immunity-brief/"
  },
  {
    "text": "Nevada politician guilty of using $70,000 meant for statue of slain officer for personal costs  —  A Nevada Republican politician who ran unsuccessfully two years ago for state treasurer was found guilty Thursday of using funds raised for a statue honoring a slain police officer for personal costs, including plastic surgery.",
    "url": "https://apnews.com/article/republican-michele-fiore-guilty-wire-fraud-nevada-5844d79dacf0bfd6b43d36e03eb6cd95"
  }
]