[
  {
    "text": "Romney stands by Trump criticism but says MAGA is now the Republican Party  —  Sen. Mitt Romney, a frequent Donald Trump critic who will soon retire from Congress, stood by his criticism of the president-elect's character but said Trump and his MAGA movement now define the Republican Party.",
    "url": "https://www.cnn.com/2024/12/15/politics/romney-trump-state-of-the-union"
  },
  {
    "text": "ABC to Pay $15 Million to Settle a Defamation Suit Brought by Trump  —  The outcome of the lawsuit marks an unusual victory for President-elect Donald J. Trump in his ongoing legal campaign against national news organizations.  —  ABC News is set to pay $15 million to settle a defamation lawsuit brought by Donald J. Trump.",
    "url": "https://www.nytimes.com/2024/12/14/business/media/trump-abc-settlement.html"
  },
  {
    "text": "ABC agrees to give $15 million to Donald Trump's presidential library to settle defamation lawsuit  —  ABC News has agreed to pay $15 million toward Donald Trump's presidential library to settle a lawsuit over anchor George Stephanopoulos' inaccurate on-air assertion that the president-elect … ",
    "url": "https://apnews.com/article/abc-trump-lawsuit-defamation-stephanopoulos-04aea8663310af39ae2a85f4c1a56d68"
  },
  {
    "text": "George Stephanopoulos and ABC apologize to Trump, are forced to pay $15 million to settle defamation suit  —  FIRST ON FOX- ABC News and its top anchor George Stephanopoulos have reached a settlement with Donald Trump in his defamation suit, which will result in the news network paying the president-elect $15 million.",
    "url": "https://www.foxnews.com/media/george-stephanopoulos-abc-apologize-trump-forced-pay-15-million-settle-defamation-suit"
  },
  {
    "text": "Devin Nunes, Pugnacious Trump Loyalist, to Lead Espionage Advisory Board  —  As chair of the House Intelligence Committee, he attacked the Russia inquiry and Donald J. Trump's first impeachment.  Now, Mr. Nunes runs Mr. Trump's social media company.  —  President-elect Donald J. Trump announced … ",
    "url": "https://www.nytimes.com/2024/12/14/us/devin-nunes-intelligence-advisory-board.html"
  },
  {
    "text": "Universities warn international students to return before Trump inauguration … They include the University of Southern California, Brown University, University of Pennsylvania, MIT and others.  — USC in an email to students on special visas said they are expected to be in class … ",
    "url": "https://www.axios.com/2024/12/15/trump-inauguration-international-students-warning"
  },
  {
    "text": "Elon Musk put $277 million into the election.  Now he's $200 billion richer.  —  The tech mogul made a big bet on Donald Trump.  By one measure, it has paid off handsomely.  —  Elon Musk's net worth has climbed by more than $200 billion in 2024, a massive increase in the same year … ",
    "url": "https://www.washingtonpost.com/business/2024/12/15/elon-musk-trump-election-wealth/"
  },
  {
    "text": "Patrick Soon-Shiong's controversial shakeup at the L.A. Times: ‘Bias meter,’ opinion upheaval and a call for growth  —  Patrick Soon-Shiong had become accustomed to making the news.  —  He was the doctor and medical technology innovator who built a fortune, the striving South African immigrant … ",
    "url": "https://www.latimes.com/california/story/2024-12-15/la-patrick-soon-shiong-interview"
  },
  {
    "text": "CEOs Want Trump to Change Course on Tariffs.  He Isn't Budging.  —  Companies mount a campaign to soften the president-elect's trade policies, but Trump's team tells consultants he is serious  —  Donald Trump's tariff threats have triggered a behind-the-scenes lobbying campaign to soften or alter the president-elect's plans.",
    "url": "https://www.wsj.com/economy/trade/trump-tariff-plan-business-lobbying-8f02ccea"
  },
  {
    "text": "Trump eyes privatizing U.S. Postal Service, citing financial losses  —  Trump feuded with the mail agency in his first term.  Privatizing it could shake up consumer shipping and business supply chains.",
    "url": "https://www.washingtonpost.com/business/2024/12/14/trump-usps-privatize-plan/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM0MTUyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM1NTM0Nzk5LCJpYXQiOjE3MzQxNTI0MDAsImp0aSI6IjgyYzBlYTQ3LTNjNzktNDQ5Ny1iYmI5LTVkZTNlODY2ODZmMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI0LzEyLzE0L3RydW1wLXVzcHMtcHJpdmF0aXplLXBsYW4vIn0.HRrFzjx5DnYHUZ9Vc9EKTfFi28fvV7NfdhoIU794ZUE&itid=gfta"
  },
  {
    "text": "Florida workers died in the heat.  Their deaths were kept from authorities  —  A Times investigation found twice as many workers have died across the state from heat than officials know.  —  It felt like 100 degrees on the job site by late afternoon.  —  “Truly unbearable,” … ",
    "url": "https://www.tampabay.com/investigations/2024/12/14/florida-workers-died-heat-their-deaths-were-kept-authorities/"
  },
  {
    "text": "Will anger at health insurers spur action?  Democrats pessimistic  —  Democrats are pessimistic that Congress will enact new rules around the health insurance industry, even as they try to appear responsive to growing calls for reform following the killing of UnitedHealthcare CEO Brian Thompson.",
    "url": "https://thehill.com/policy/healthcare/5040261-congress-health-insurance-reform/"
  },
  {
    "text": "Republicans make inroads in state legislative elections, teeing up high-stakes 2025 races  —  Republicans are expanding their footprint in statehouses across the country, reversing Democrats' earlier trend of high-profile wins just a year ago.  —  In the Midwest, the GOP successfully flipped … ",
    "url": "https://thehill.com/homenews/campaign/5040340-republicans-state-elections-2025/"
  },
  {
    "text": "Statement by Governor Kathy Hochul on Additional Drone Activity  —  “Last night, the runways at Stewart Airfield were shut down for approximately one hour due to drone activity in the airspace.  This has gone too far.  —  “In mid-November, I directed the New York State Intelligence Center … ",
    "url": "https://www.governor.ny.gov/news/statement-governor-kathy-hochul-additional-drone-activity"
  }
]