[
  {
    "text": "Trump Plans to Skip G.O.P. Debate for Interview With Tucker Carlson  —  The former president's apparent decision to skip the first debate is a major affront both to the Republican National Committee and to Fox News, which is hosting the event.  —  Former President Donald J. Trump plans … ",
    "url": "https://www.nytimes.com/2023/08/18/us/politics/trump-debate-tucker-carlson.html"
  },
  {
    "text": "Miami Mayor Francis Suarez claims he's qualified for GOP presidential debate, but RNC can't confirm  —  Miami Mayor Francis Suarez claimed on Friday that he has qualified for next week's Republican presidential debate and would become the ninth White House hopeful to meet the fundraising … ",
    "url": "https://apnews.com/article/francis-suarez-miami-mayor-republican-debate-president-5898b380b1d239a94d9de358e72253b7"
  },
  {
    "text": "Gen. Milley on Ukraine, Tuberville and ‘wokeness’  —  Good morning, Early Birds.  Sadly, a missed opportunity with this one-time real-life Barbie Dreamhouse.  But has anyone built the Mojo Dojo Casa House?  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.",
    "url": "https://www.washingtonpost.com/politics/2023/08/18/gen-milley-ukraine-tuberville-wokeness/"
  },
  {
    "text": "Christie Says DeSantis Should Drop Out if He Defends Trump at Debate  —  Mr. Christie needled his higher-polling rivals while campaigning in their home state of Florida.  —  Reporting from South Miami, Fla.  —  If Gov. Ron DeSantis follows political consultants' advice … ",
    "url": "https://www.nytimes.com/2023/08/18/us/politics/christie-desantis-trump-debate.html"
  },
  {
    "text": "James Buckley, conservative politician and U.S. senator, dies at 100  —  In political circles, Mr. Buckley was perhaps best remembered as the lead plaintiff in a landmark campaign finance lawsuit — Buckley v. Valeo — that in 1976 unraveled part of the post-Watergate regulation of political money",
    "url": "https://www.washingtonpost.com/obituaries/2023/08/18/james-buckley-valeo-obit/"
  },
  {
    "text": "Former Sen. James Buckley dies at 100  —  James Buckley, a former U.S. Senator from New York died Friday at the age of 100, according to The Washington Post.  —  Buckley's son confirmed his death to The Washington Post, but did not say the cause.  Born in New York, N.Y. in 1923 … ",
    "url": "https://thehill.com/homenews/senate/4158901-former-sen-james-buckley-dies-at-100/"
  },
  {
    "text": "Rudy Giuliani Was Never 'America's Mayor'  —  On Monday, Rudy Giuliani was indicted in Georgia for his role in what prosecutors called a conspiracy to overturn the results of the 2020 presidential election in that state.  —  The district attorney for Fulton County, Fani Willis … ",
    "url": "https://www.nytimes.com/2023/08/18/opinion/rudy-giuliani-trump-authoritarianism.html"
  },
  {
    "text": "A Jan. 6 defendant scheduled to be sentenced on Friday is now missing  —  WASHINGTON — Christopher Worrell, a Florida Proud Boy convicted on seven counts stemming from his actions during the Jan. 6 riot, was scheduled to be sentenced today in Washington, D.C, federal court but is now missing … ",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-defendant-scheduled-sentenced-friday-now-missing-rcna100677"
  },
  {
    "text": "Kenneth Chesebro, alleged architect of fake electors' plot, followed Alex Jones around Capitol grounds on January 6th  —  When conspiracy theorist Alex Jones marched his way to the US Capitol on January 6, 2021, riling up his legion of supporters, an unassuming middle-aged man in a red “Trump 2020” hat conspicuously tagged along.",
    "url": "https://www.cnn.com/2023/08/18/politics/kfile-kenneth-chesebro-followed-alex-jones-capitol-riot-jan-6/"
  },
  {
    "text": "A GOP challenger's frank talk about ‘sexual sin’  —  FITZPATRICK'S FOE DETAILS PORN ADDICTION  —  Pennsylvania Republican Mark Houck, who is challenging Rep. Brian Fitzpatrick from the right in a battleground district, revealed during a 2020 interview that he “struggled” … ",
    "url": "https://www.politico.com/newsletters/huddle/2023/08/18/a-gop-challengers-frank-talk-about-sexual-sin-00111808"
  },
  {
    "text": "Trump attorneys, Fulton County DA expected to meet next week: Sources  —  The attorneys and DA are expected to negotiate terms of Trump's bond package.  —  Attorneys for former President Donald Trump are expected to meet early next week with the Fulton County district attorney's office … ",
    "url": "https://abcnews.go.com/US/trump-attorneys-fulton-county-da-expected-meet-week/story?id=102369420"
  },
  {
    "text": "‘Lock Them Up’ is Now the Republican Party's Highest Goal … Donald Trump's supporters, as you might expect, have not taken his latest indictment in stride.  Charlie Kirk, writing in the Federalist, proposes a list of Democrats or liberal groups to charge in retaliation, proposing Hunter Biden … ",
    "url": "https://nymag.com/intelligencer/2023/08/lock-them-up-is-now-the-republican-partys-highest-goal.html"
  },
  {
    "text": "‘Pathetic’: Voters of color slam Biden's performance on the economy  —  “Our economy is the lowest it's been.”  —  In a focus group last week, eight men of color who voted for President Joe Biden in 2020 were asked to describe their feelings about the economy.  —  The answers were bleak.",
    "url": "https://www.politico.com/news/2023/08/18/bidens-reelection-economy-voters-of-color-00111730"
  },
  {
    "text": "Gavin Newsom's future hinges on San Francisco  —  Newsom has increasingly been moonlighting as a quasi-city executive of his hometown and approaching its woes as a litmus test for his success in Sacramento.  —  SAN FRANCISCO — Gavin Newsom hasn't been mayor of San Francisco for more than a decade … ",
    "url": "https://www.politico.com/news/2023/08/18/san-francisco-gavin-newsom-homeless-00111777"
  },
  {
    "text": "Microsoft says listing the Ottawa Food Bank as a tourist destination wasn't the result of ‘unsupervised AI’ … A Microsoft travel guide for Ottawa, Canada, prominently recommended tourists visit the Ottawa Food Bank, as spotted by Paris Marx until it was removed after this article was originally published.",
    "url": "https://www.theverge.com/2023/8/17/23836287/microsoft-ai-recommends-ottawa-food-bank-tourist-destination"
  },
  {
    "text": "California officer accused in probe of racist texts kept ‘gory’ police dog injury photos for himself, authorities say  —  Three officers “touted” their use of excessive force and collected “trophies,” according to an indictment unsealed Thursday.  —  Three Northern California police officers … ",
    "url": "https://www.nbcnews.com/news/us-news/california-officer-accused-probe-racist-texts-kept-gory-police-dog-inj-rcna100516"
  },
  {
    "text": "Science loses in Montana court  —  Would the weather in Montana change tomorrow if the state suddenly shut down all of its coal mines, natural gas power plants, and oil refineries?  Any honest scientist would tell you no.  —  But according to a far-left state judge, the wealthiest children … ",
    "url": "https://www.washingtonexaminer.com/opinion/editorials/science-loses-in-montana-court"
  },
  {
    "text": "Trump PAC foots bill for private investigator in Manhattan criminal case, E. Jean Carroll trial  —  As Donald Trump's New York legal troubles began to mount this spring, his lawyers and political action committee sought the help of Sean Crowley, a local private eye.",
    "url": "https://www.cbsnews.com/news/trump-pac-private-investigator-manhattan-criminal-case-e-jean-carroll-trial/"
  },
  {
    "text": "Threats, slurs and menace: Far-right websites target Fulton County grand jurors  —  Before many people had a chance to fully read through the Fulton County, Ga., indictment against former President Donald Trump and 18 co-defendants, malicious online actors had already done their work.",
    "url": "https://www.npr.org/2023/08/18/1194471162/trump-indictment-fulton-county-grand-jurors-threats"
  }
]