[
  {
    "text": "Donald Trump didn't sign loyalty oath for Illinois ballot that pledges not to ‘advocate the overthrow of the government’  —  In 2016 and 2020, before the Jan. 6 insurrection, Trump did sign.  President Joe Biden, who signed it, questioned why Trump “can't bring himself to sign a piece … ",
    "url": "https://chicago.suntimes.com/2024/1/6/24027720/donald-trump-loyalty-oath-illinois-ballot-advocate-overthrow-government-pledge-mccarthy-red-scare"
  },
  {
    "text": "Trump did not sign Illinois' loyalty oath that says he won't advocate for overthrowing the government  —  The pledge, a vestige of the McCarthy Red Scare era, is not mandatory, but has been signed by candidates for decades, including by Trump in 2020 and 2016.",
    "url": "https://www.wbez.org/stories/trump-did-not-sign-illinois-candidate-loyalty-oath/1d1fbaf4-261f-4c15-b466-8fb749d404e1"
  },
  {
    "text": "Trump mocks Biden over stutter  —  Making fun of Biden's childhood speech impediment marks the latest crass form of politics that Trump has exhibited throughout his career  —  Donald Trump ridiculed President Biden over the economy, immigration and foreign policy before turning to personal mockery during an Iowa event on Friday night.",
    "url": "https://www.washingtonpost.com/politics/2024/01/06/trump-biden-stutter/"
  },
  {
    "text": "Trump tries reappropriating ‘insurrection’ on Jan. 6 anniversary  —  In campaign speeches surrounding the third anniversary of the attack, the former president defended people charged in the riot and repeated baseless claims that left-wing or government interlopers caused the breach",
    "url": "https://www.washingtonpost.com/politics/2024/01/06/trump-insurrection-jan-6-comments/"
  },
  {
    "text": "Obama, worried about Trump, urges Biden circle to bolster campaign  —  The former president shared his thoughts about the reelection campaign during a private lunch with Biden at the White House  —  Former president Barack Obama has raised questions about the structure of President Biden's … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/06/obama-biden-meeting-campaign-2024/"
  },
  {
    "text": "Fanone says GOP lawmakers attempt to ‘whitewash’ Jan. 6 due to ‘politically inconvenient’ reality  —  Former D.C. police officer Michael Fanone lashed out against GOP lawmakers on Friday, blasting attempts to “whitewash” the Jan. 6 Capitol riots as something less than what they were as we reach … ",
    "url": "https://thehill.com/homenews/4393040-fanone-says-gop-lawmakers-attempt-whitewash-jan-6-due-to-politically-inconvenient-reality/"
  },
  {
    "text": "Pentagon didn't inform Biden, White House for days about Austin's hospitalization  —  The news came as a shock to top staff, including national security adviser Jake Sullivan.  —  The Pentagon did not tell President Joe Biden and other top officials about Defense Secretary Lloyd Austin's hospitalization … ",
    "url": "https://www.politico.com/news/2024/01/06/pentagon-took-3-days-to-inform-white-houses-nsc-of-austins-hospitalization-00134176"
  },
  {
    "text": "Secretary of Defense Lloyd Austin hospitalized amid Middle East missions  —  Austin was hospitalized Jan. 1 after complications from an elective procedure.  Deputy Secretary of Defense Kathleen Hicks has picked up his duties in the meantime, a senior defense official said.",
    "url": "https://www.nbcnews.com/news/us-news/secretary-defense-lloyd-austin-hospitalized-middle-east-missions-rcna132612"
  },
  {
    "text": "Statement from Pentagon Press Secretary Maj. Gen. Pat Ryder on Secretary of Defense Austin  —  Pentagon Press Secretary Maj. Gen. Pat Ryder provided the following statement on Secretary of Defense Austin:  —  On the evening of January 1, Secretary of Defense Lloyd J. Austin III was admitted … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3633270/statement-from-pentagon-press-secretary-maj-gen-pat-ryder-on-secretary-of-defen/"
  },
  {
    "text": "Hospitalized Pentagon Chief Was in Intensive Care Unit  —  Secretary of Defense Lloyd Austin remains hospitalized, but has resumed his full duties, officials say  —  Secretary of Defense Lloyd Austin spent time in an intensive care unit after entering a military hospital on New Year's Day … ",
    "url": "https://www.wsj.com/politics/national-security/hospitalized-pentagon-chief-was-in-intensive-care-unit-12b3f1a6?mod=followamazon"
  },
  {
    "text": "Three Years Since the Jan. 6 Attack on the Capitol  —  Saturday, January 6, 2024, marks three years - or 36 months - since the attack on the U.S. Capitol that disrupted a joint session of the U.S. Congress in the process of affirming the presidential election results.",
    "url": "https://www.justice.gov/usao-dc/36-months-jan-6-attack-capitol-0"
  },
  {
    "text": "Trump and his MAGA allies turn their fire on Haley  —  The Trump campaign and its allied super PAC are spending a combined $4.5 million on anti-Nikki Haley ads.  —  Donald Trump's political operation is seeking to bury Nikki Haley's presidential campaign just days before voting starts.",
    "url": "https://www.politico.com/news/2024/01/06/trump-ads-nikki-haley-00134175"
  },
  {
    "text": "Ex-AOC aide lined pockets with nearly $140K from his PAC while spending little on its mission  —  Corbin Trent founded the No Excuses PAC, which has funneled nearly $140,000 back to him in consulting payments  —  A former top aide to Rep. Alexandria Ocasio Cortez, D-N.Y. … ",
    "url": "https://www.foxnews.com/politics/ex-aoc-aide-lined-pockets-nearly-140k-his-pac-spending-little-on-its-mission?intcmp=tw_fnc"
  },
  {
    "text": "Academic celebrity Neri Oxman plagiarized from Wikipedia, scholars, a textbook, and other sources without any attribution  — Neri Oxman, a former star professor at MIT, admitted to lifting passages from other scholars' work in her dissertation.  — Business Insider found 28 additional instances … ",
    "url": "https://www.businessinsider.com/neri-oxman-plagiarize-wikipedia-mit-dissertation-2024-1"
  }
]