[
  {
    "text": "Trump compares himself to Mandela and rails against Biden after filing for New Hampshire primary  —  Former President Donald Trump compared himself to anti-apartheid activist Nelson Mandela on Monday as he cast himself as the victim of federal and state prosecutors he alleges are targeting him and his businesses for political reasons.",
    "url": "https://apnews.com/article/trump-new-hampshire-filing-8351611af96b54050f1e64d55d8648dc"
  },
  {
    "text": "Trump's lawyers argue DC fed'l charges unconstitutional, should be tossed  —  The lawyers argue the indictment violates the First Amendment, due process, and double jeopardy protections in one of four late-night filings Monday.  —  In a late-night filing Monday, Donald Trump's lawyers argued … ",
    "url": "https://www.lawdork.com/p/trump-dc-case-constitutional-dismissal-motion"
  },
  {
    "text": "Trump presses ‘presidential immunity’ defense in E. Jean Carroll's defamation suit  —  The argument resembles the aggressive immunity defense that Trump's lawyers are raising in one of his criminal cases.  —  NEW YORK — A lawyer for Donald Trump told a federal appeals court on Monday … ",
    "url": "https://www.politico.com/news/2023/10/23/trump-carroll-presidential-immunity-argument-00123072"
  },
  {
    "text": "Trump defiant as political and legal worlds collide  —  He lets loose after temporary gag order reprieve.  —  DERRY, N.H. — Other criminal defendants might play it safe when a gag order they've been subjected to gets temporarily lifted.  —  Donald Trump is not your average defendant.",
    "url": "https://www.politico.com/news/2023/10/23/trump-new-hampshire-gag-order-00123110"
  },
  {
    "text": "Trump Bizarrely Declares ‘I Was Never Indicted’ After Being Indicted Four Times  —  Former President Donald Trump took questions from reporters after officially filing for the GOP New Hampshire primary on Monday and oddly seemed to claim he was never indicted.",
    "url": "https://www.mediaite.com/politics/trump-bizarrely-declares-i-was-never-indicted-after-being-indicted-four-times/"
  },
  {
    "text": "Fact check: Trump falsely claims the US had no terrorist attacks during his presidency  —  Former President Donald Trump made numerous false claims in a campaign speech Monday in New Hampshire.  —  Trump falsely claimed that the United States had no terrorist attacks during his presidency.",
    "url": "https://www.cnn.com/2023/10/23/politics/fact-check-trump-speech-new-hampshire/"
  },
  {
    "text": "Playbook: The House's ‘Purge’ moment  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  DEBATE UPDATE — CHRIS CHRISTIE now says he has enough donors to qualify for the third GOP presidential debate, Natalie Allison scoops this morning.",
    "url": "https://www.politico.com/newsletters/playbook/2023/10/24/the-houses-purge-moment-00123137"
  },
  {
    "text": "Christie says he has enough donors to qualify for third debate  —  The former New Jersey governor had already met the RNC's polling threshold.  —  Chris Christie's campaign says he has met the criteria for the third Republican primary debate, securing a spot next month on what's expected to be a winnowed stage of candidates.",
    "url": "https://www.politico.com/news/2023/10/24/christie-says-he-has-enough-donors-to-qualify-for-third-debate-00123103"
  },
  {
    "text": "U.S. Raises Concerns About Israel's Plan of Action in Gaza, Officials Say  —  The Pentagon has sent officers to help the Israelis with the challenges of fighting an urban war.  —  The Biden administration is concerned that Israel lacks achievable military objectives in Gaza … ",
    "url": "https://www.nytimes.com/2023/10/23/us/politics/israel-us-gaza-invasion.html"
  },
  {
    "text": "U.S. readies plans for mass evacuations if Gaza war escalates  —  Officials said that the more than 600,000 Americans living in Israel and Lebanon are of particular concern, but they stressed that an operation of such magnitude is a worst-case scenario  —  CORRECTION",
    "url": "https://www.washingtonpost.com/national-security/2023/10/23/us-evacuation-plans-israel-lebanon-hamas-war/"
  },
  {
    "text": "Ramaswamy: U.S. pulling out of NATO is ‘reasonable,’ as is ‘reevaluating’ UN membership  —  His stance means at least two of the top four Republicans vying for the presidency are skeptical of America's involvement in post-World War II institutions.  —  One of the better-polling Republican … ",
    "url": "https://www.politico.com/news/2023/10/23/ramaswamy-nato-us-un-membership-00123119"
  },
  {
    "text": "Republicans can't govern.  Just ask them.  —  As the party flails in its search for a speaker, the GOP is increasingly acknowledging publicly that its discord is embarrassing — and even dangerous.  —  It's not clear yet that House Republicans' inability to elect a new speaker … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/23/gop-speaker-dangerous-discord/"
  },
  {
    "text": "Off-duty pilot charged with 83 counts of attempted murder for allegedly trying to shut off engines on Alaska Airlines flight  —  Joseph David Emerson was taken into custody, the Port of Portland confirmed.  —  An off-duty pilot is charged with 83 counts of attempted murder after he allegedly tried … ",
    "url": "https://abcnews.go.com/US/alaska-airlines-flight-diverted-after-credible-security-threat/story?id=104223059"
  },
  {
    "text": "Tom Emmer scrambles to fix his Trump problem  —  The majority whip is battling a whisper campaign questioning his past support for the ex-president.  —  As House Republicans sort through a field of short-timers and back-benchers to pick their next speaker, Majority Whip Tom Emmer stands out.",
    "url": "https://www.politico.com/news/2023/10/23/tom-emmer-trump-speaker-race-00122969"
  },
  {
    "text": "Congress officially avoided a shutdown — but GOP hardliners still caused one  —  It's not just political chaos in the Republican Party.  The speakership crisis has lopped off half the legislative branch while two wars rage overseas.",
    "url": "https://www.politico.com/live-updates/2023/10/23/congress/congress-avoided-a-shutdown-this-month-eight-republicans-shut-it-down-anyways-00123082"
  },
  {
    "text": "Santos says he isn't leaving.  Candidates are still lining up for his seat.  —  The indicted House Republican is due in court again Friday.  His Democratic and Republican rivals are preparing for a potential special election.  —  NEW YORK — The wait to replace indicted Rep. George Santos has lasted longer than his rivals expected.",
    "url": "https://www.politico.com/news/2023/10/24/george-santos-challengers-2024-00122837"
  },
  {
    "text": "Thoughts on Israel and Gaza  —  It's been 17 days since Hamas launched its horrific attack against Israel, killing over 1,400 Israeli citizens, including defenseless women, children and the elderly.  In the aftermath of such unspeakable brutality, the U.S. government and the American people … ",
    "url": "https://barackobama.medium.com/my-statement-on-israel-and-gaza-a6c397f09a30"
  },
  {
    "text": "‘I Mean, Is This My Party?’  —  A new book asks if even anti-Trumpers like Mitt Romney bear some blame for the rise of a man who has destroyed the GOP.  —  “I have learned through my life experience,” Mitt Romney said, “that it's human to rationalize what's in our best interest.”  J. Scott Applewhite/AP",
    "url": "https://www.politico.com/news/magazine/2023/10/24/mitt-romney-trump-rise-00123096"
  },
  {
    "text": "Ted Cruz to be at Game 7 despite Astros fan opposition  —  Some Houston Astros fans are begging Sen. Ted Cruz (R-Texas.) to not attend the Game 7 of their American League Championship Series (ALCS) against state rival the Texas Rangers due to bad luck.  —  Fans of the defending World Series … ",
    "url": "https://thehill.com/blogs/in-the-know/4271705-ted-cruz-to-be-at-game-7-despite-astro-fan-opposition/"
  }
]