[
  {
    "text": "Hard-right backtrack on spending levels leaves sour taste for colleagues  —  Fiscal fights have been at the heart of Republican conflict this year, including the debate over the top-line spending level for 2024  —  Under a sweltering July heat outside the Capitol, members … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/02/house-freedom-caucus-spending-plan/"
  },
  {
    "text": "McCarthy, Laboring to Adjust to Life After the Speakership, Eyes Exiting Congress  —  The California Republican is still angry at his ouster and has struggled to acclimate.  His colleagues expect him to retire, but he has taken his time deciding.  —  At an emotional evening news conference immediately … ",
    "url": "https://www.nytimes.com/2023/12/02/us/politics/mccarthy-house-speaker-republicans.html"
  },
  {
    "text": "Biden's EPA launches crackdown on planet-warming methane  —  The rule's 3 a.m. rollout was timed to coincide with the ongoing U.N. climate talks in Dubai.  —  The Environmental Protection Agency unveiled sweeping new regulations targeting methane emissions from the oil and gas sector on Saturday … ",
    "url": "https://www.politico.com/news/2023/12/02/bidens-epa-launches-crackdown-on-planet-warming-methane-00129433"
  },
  {
    "text": "Biden Administration Announces Rule to Cut Millions of Tons of Methane Emissions  —  The measure, which requires oil and gas producers to detect and fix leaks of the greenhouse gas, came as the U.S. vice president spoke at the COP28 climate summit.  —  Vice President Kamala Harris pledged … ",
    "url": "https://www.nytimes.com/2023/12/02/climate/biden-methane-climate-cop28.html"
  },
  {
    "text": "Henry Kissinger's (Maybe) Last Interview: Drop the Two-State Solution  —  In one of the final interviews before he died, the famous statesman said the two-state solution was no longer viable and that the U.S. must reconcile with China.  —  Former Secretary of State Henry Kissinger is introduced … ",
    "url": "https://www.politico.com/news/magazine/2023/12/02/henry-kissinger-interview-israel-hamas-war-00129374"
  },
  {
    "text": "Obamacare is even more popular than the last time Trump tried to kill it  —  The issue doesn't specifically motivate Republican voters, either.  —  Donald Trump couldn't repeal Obamacare in 2017, largely because it had become too popular.  It's even more popular now.",
    "url": "https://www.politico.com/news/2023/12/02/trump-obamacare-polling-support-00129721"
  },
  {
    "text": "Pelosi calls Santos a ‘coward’ for leaving chamber before expulsion vote closed  —  Former Speaker Nancy Pelosi took aim at ousted Rep. George Santos (R-N.Y.) after he exited the House chamber Friday before his expulsion vote had come to an end, calling him a “coward” for doing so.",
    "url": "https://thehill.com/homenews/house/4338547-pelosi-calls-santos-coward-for-leaving-chamber-expulsion-vote/"
  },
  {
    "text": "Chris Christie may not appear on Republican primary ballot in Maine  —  Former New Jersey Gov. Chris Christie is in danger of not appearing on Maine's primary ballot after he fell short of the minimum 2,000 signatures needed from Maine voters to qualify for the state's Republican presidential primary, state officials said Friday.",
    "url": "https://www.cbsnews.com/news/chris-christie-may-not-appear-on-republican-primary-ballot-in-maine/"
  },
  {
    "text": "Ohio Fails to Pass Restrictions on College Teaching About Climate Policies  —  The legislation, written to fight the “woke fiefdom” of higher education, doesn't have the votes to pass the Ohio House.  —  Ohio lawmakers have failed, at least for now, to pass a bill that would exert control over discussion of … ",
    "url": "https://insideclimatenews.org/news/02122023/ohio-higher-education-bill-fails/"
  },
  {
    "text": "Trump pardoned them.  Now they're helping him return to power.  —  FOUNTAIN HILLS, Ariz. — At a diner known for political chitchat and Coca-Cola memorabilia, former Maricopa County sheriff Joe Arpaio walked from table to table on a recent fall morning, asking voters to back him for mayor … ",
    "url": "https://www.washingtonpost.com/politics/interactive/2023/trump-pardon-power-2024-benefit/"
  },
  {
    "text": "Muslim Americans in swing states launch anti-Biden campaign  —  Muslim Americans in the several swing states are scheduled to gather in Michigan on Saturday to start a campaign they're calling #AbandonBiden, a reflection of their outrage over President Biden's handling of the Israel-Hamas war.",
    "url": "https://www.axios.com/2023/12/02/muslim-americans-swing-states-anti-biden-campaign"
  },
  {
    "text": "911 Call and Affidavit Reveal Chilling Claims in Florida GOP Chair Rape Probe  —  The woman told investigators he showed up at her home after she had cancelled plans with him.  —  The woman who accused Florida GOP chairman Christian Ziegler—husband of Moms for Liberty co-founder Bridget Ziegler … ",
    "url": "https://www.thedailybeast.com/911-call-released-in-florida-gop-chair-christian-ziegler-rape-probe"
  },
  {
    "text": "COP28: UN climate talks take aim at planet-warming food  —  World leaders have for the first time promised to tackle the huge responsibility that food and agriculture have in climate change.  —  More than 130 countries signed up to a declaration about food, on the second day of the UN climate summit COP28 … ",
    "url": "https://www.bbc.com/news/science-environment-67594303"
  },
  {
    "text": "Judge denies two of Trump's motions to dismiss his federal election interference case  —  The judge rejected arguments from Trump's lawyers, who cited the First Amendment and presidential immunity in pressing for dismissal of special counsel Jack Smith's case.",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-denies-two-trumps-motions-dismiss-federal-election-interference-rcna127720"
  }
]