[
  {
    "text": "The GOP's post-Trump lesson: Power isn't dependent on voting  —  Rep. Elise Stefanik (R-N.Y.) serves as Republican Conference chair, the party's third-highest leadership position in the House.  She earned that position in part by doing what her predecessor, former Wyoming congresswoman Liz Cheney … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/08/stefanik-trump-election-results/"
  },
  {
    "text": "Democrats question whether Biden should agree to debate Trump  —  Democratic lawmakers are leery about the prospect of President Biden debating former President Trump, fearing that putting the two on stage together would only elevate the likely GOP nominee.  —  Trump has skipped every … ",
    "url": "https://thehill.com/homenews/senate/4392333-democrats-question-whether-biden-should-agree-to-debate-trump/"
  },
  {
    "text": "Trump wants Georgia election subversion case dismissed, arguing he has presidential immunity  —  Former President Donald Trump is seeking to have the sweeping criminal conspiracy case against him in Georgia thrown out by arguing he is protected from prosecution under presidential immunity.",
    "url": "https://www.cnn.com/2024/01/08/politics/trump-fulton-county-georgia-immunity/"
  },
  {
    "text": "Trump urges Georgia judge to dismiss election interference case over presidential immunity  —  Former President Trump urged a Georgia judge to dismiss the election interference case against him there Monday, arguing he was acting in his role as president and is therefore immune from criminal prosecution.",
    "url": "https://thehill.com/regulation/court-battles/4395175-trump-urges-georgia-judge-to-dismiss-election-interference-case-over-presidential-immunity/"
  },
  {
    "text": "Biden won't accept an Austin resignation if offered  —  The president is not considering sacking his defense secretary, officials say.  —  President Joe Biden is not considering firing Defense Secretary Lloyd Austin after he did not tell the White House about his emergency hospitalization … ",
    "url": "https://www.politico.com/news/2024/01/08/biden-austin-resignation-00134280"
  },
  {
    "text": "Florida Republican Party ousts Christian Ziegler as chairman after rape allegation  —  The move was widely expected after news broke last month that Ziegler was under investigation by the Sarasota County Police Department.  —  The Republican Party of Florida on Monday formally voted … ",
    "url": "https://www.nbcnews.com/politics/politics-news/florida-republican-party-ousts-christian-ziegler-chairman-rape-allegat-rcna131936"
  },
  {
    "text": "Business Insider story on Harvard antagonist's wife draws owner's scrutiny  —  The news site's German owner, Axel Springer, plans to review a story about alleged plagiarism by former MIT professor Neri Oxman, whose billionaire husband, Bill Ackman, sought to oust Harvard's president for similar academic transgressions.",
    "url": "https://www.washingtonpost.com/style/media/2024/01/08/neri-oxman-ackman-axel-springer-business-insider/"
  },
  {
    "text": "‘Impossible’ to create AI tools like ChatGPT without copyrighted material, OpenAI says  —  Pressure grows on artificial intelligence firms over the content used to train their products  —  The developer OpenAI has said it would be impossible to create tools like its groundbreaking chatbot … ",
    "url": "https://www.theguardian.com/technology/2024/jan/08/ai-tools-chatgpt-copyrighted-material-openai"
  },
  {
    "text": "Tanya Chutkan, the judge overseeing Trump's federal election interference case, appears to be victim of ‘swatting’  —  Police and fire trucks responded to reports of a shooting at Chutkan's home, but police determined no shooting had taken place.  —  WASHINGTON — Police and fire trucks showed … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/tanya-chutkan-judge-overseeing-trumps-federal-election-interference-ca-rcna132856"
  },
  {
    "text": "To disqualify or not to disqualify: The Supreme Court confronts the ‘laugh test’  —  The reactionary Supreme Court is in a quandary as to how to decide the Trump disqualification case while retaining whatever credibility it has left.  The court just voted to review the Colorado Supreme Court decision, but it really didn't want to.",
    "url": "https://thehill.com/opinion/judiciary/4394601-to-disqualify-or-not-to-disqualify-the-supreme-court-confronts-the-laugh-test/"
  },
  {
    "text": "Trump Is Connecting With a Different Type of Evangelical Voter  —  They are not just the churchgoing, conservative activists who once dominated the G.O.P.  —  Karen Johnson went to her Lutheran church so regularly as a child that she won a perfect attendance award.  As an adult, she taught Sunday school.",
    "url": "https://www.nytimes.com/2024/01/08/us/politics/donald-trump-evangelicals-iowa.html"
  },
  {
    "text": "Rightwing Billionaires & Trump Want a Nation Where Everything is For Sale  —  Donald Trump and his fellow rightwing billionaires have a plan for America.  They want to turn the United States from a prosperous, middle-class nation into a country of paupers, where bribery is common and the wealthy can get away with anything.",
    "url": "https://hartmannreport.com/p/rightwing-billionaires-and-trump-77b"
  },
  {
    "text": "Gov. Newsom announces delayed special election for McCarthy seat  —  The election to finish out the rest of McCarthy's term will run parallel with the race to succeed him.  —  SACRAMENTO, Calif. — The special primary election to replace former House Speaker Kevin McCarthy will be held on March 19 … ",
    "url": "https://www.politico.com/news/2024/01/08/newsom-mccarthy-speaker-special-election-delayed-00134321"
  },
  {
    "text": "Why Iowa Turned So Red When Nearby States Went Blue  —  Over the past 15 years, the Upper Midwest has seen a remarkable state-by-state sorting of voters along partisan lines.  —  With the Iowa caucuses six days away, politicians will be crisscrossing the state, blowing through small-town Pizza Ranches … ",
    "url": "https://www.nytimes.com/2024/01/08/us/politics/iowa-republicans-red.html"
  },
  {
    "text": "House Republicans plot swift impeachment of Homeland Security Secretary Mayorkas as moderates signal support  —  House Republicans are plotting to swiftly impeach Homeland Security Secretary Alejandro Mayorkas early this year, as key swing-district Republicans express fresh openness … ",
    "url": "https://www.cnn.com/2024/01/08/politics/house-republicans-plot-swift-mayorkas-impeachment-as-moderates-signal-support"
  }
]