[
  {
    "text": "Trump Has Now Deported Multiple U.S. Citizen Children With Cancer  —  Two families — among them three U.S. citizens aged two, four, and seven — were abruptly deported under “troubling circumstances,” says the ACLU … One of the children was undergoing cancer treatment and one of the mothers is pregnant.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-deport-child-cancer-us-citizen-1235325778/"
  },
  {
    "text": "Judge says 2-year-old US citizen appears to have been deported with ‘no meaningful process’  —  The girl was deported Friday with her mother to Honduras, despite her father's efforts to keep her in the United States.  —  A federal judge is raising alarms that the Trump administration deported … ",
    "url": "https://www.politico.com/news/2025/04/25/us-citizen-deportation-donald-trump-00311631"
  },
  {
    "text": "ICE Deports 3 U.S. Citizen Children Held Incommunicado Prior to the Deportation  —  Families disappeared and isolated without legal access; one child with cancer deported without medication and pregnant mother deported as well  —  New Orleans, LA - Today, in the early hours of the morning … ",
    "url": "https://www.aclu.org/press-releases/ice-deports-3-u-s-citizen-children-held-incommunicado-prior-to-the-deportation"
  },
  {
    "text": "2-Year-Old U.S. Citizen Deported ‘With No Meaningful Process,’ Judge Suspects  —  A federal judge in Louisiana said the deportation of the child to Honduras with her mother, even though her father had filed an emergency petition, appeared to be “illegal and unconstitutional.”",
    "url": "https://www.nytimes.com/2025/04/25/us/politics/us-citizen-deported.html"
  },
  {
    "text": "Today's major stories must be seen in the context of President Donald Trump's dramatic losses in court and his plummeting poll numbers.  —  Yesterday, Trump told the Department of Justice to investigate ActBlue, the platform that handles the fundraising for almost all Democratic candidates and the issues Democrats support.",
    "url": "https://heathercoxrichardson.substack.com/p/april-25-2025"
  },
  {
    "text": "Trump Meets With Zelensky in Vatican City, White House Says  —  During his whirlwind trip to Italy, President Trump's interactions with world leaders, as they paid their respects to Francis, were being watched closely.  —  President Trump met privately with President Volodymyr Zelensky … ",
    "url": "https://www.nytimes.com/2025/04/26/world/europe/trump-pope-francis-funeral.html"
  },
  {
    "text": "How Trump Plays Into Putin's Hands, From Ukraine to Slashing U.S. Institutions  —  Many of President Trump's actions have been seen as benefiting Russia either directly or indirectly, so much so that Russian officials have celebrated some of his moves.  —  If President Vladimir V. Putin … ",
    "url": "https://www.nytimes.com/2025/04/26/us/politics/trump-putin-russia-ukraine.html?unlocked_article_code=1.Ck8.hbvQ.uAelxKo7ozqh&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Poll: Canadians despise Trump and distrust US  —  A new POLITICO/Focaldata poll finds Trump looms over the race, boosting Mark Carney and the Liberals as Canadians turn against the United States.  —  Three quarters of Canadians dislike President Donald Trump — and Conservatives appear likely … ",
    "url": "https://www.politico.com/news/2025/04/26/canada-election-poll-favorability-00311632"
  },
  {
    "text": "Among the meek and the mighty, Catholics bury their 'people's pope'  —  The pope's unadorned tomb, marked by a single Latin word — Franciscus — was intended, a cleric said, to reflect a life of “simplicity and essential things.”  —  VATICAN CITY — The Roman Catholic Church bid farewell … ",
    "url": "https://www.washingtonpost.com/world/2025/04/26/pope-francis-funeral-vatican/"
  },
  {
    "text": "Website For MAGA-Friendly Businesses Backfires As People Use It For Boycotts  —  Social media posts about PublicSquare have gone viral as Trump critics use it to find companies not to support - the opposite of what the site was set up for.  —  WASHINGTON - A few years ago … ",
    "url": "https://www.huffpost.com/entry/publicsquare-trump-critics-boycott-businesses_n_680900d2e4b00850c6839b0b"
  },
  {
    "text": "Trump Pardons Executive Whose Family Sought to Publicize Ashley Biden's Diary  —  The pardon of Paul Walczak, who had been convicted of tax crimes, comes as the president uses clemency to reward allies and swipe at perceived enemies.  —  President Trump on Wednesday pardoned … ",
    "url": "https://www.nytimes.com/2025/04/25/us/politics/trump-pardon-walczak-ashley-biden-diary.html"
  },
  {
    "text": "Virginia Giuffre, one of Jeffrey Epstein's most prominent abuse survivors, dies by suicide  —  Other Epstein victims credited Giuffre with giving them the courage to speak out.  —  Virginia Giuffre, one of the most prominent survivors of Jeffrey Epstein's sexual abuse, has died by suicide, her family said Friday.",
    "url": "https://www.nbcnews.com/news/us-news/virginia-giuffre-one-jeffrey-epsteins-prominent-abuse-survivors-dies-s-rcna203027"
  },
  {
    "text": "The Arrest Of A Milwaukee Judge: A Troubling Assault On The Judiciary  —  The recent arrest of a Milwaukee state court judge has raised serious legal and constitutional concerns.  In this commentary, I break down the core allegations, explain why the criminal case appears tenuous both factually and legally … ",
    "url": "https://weissmann.substack.com/p/the-arrest-of-a-milwaukee-judge-a"
  },
  {
    "text": "Trump Is Breaking the Rule That Every Barroom Brawler Knows  —  Provoking your enemies, alienating your friends and actively sabotaging your own defenses is no one's idea of a sound national security plan.  And yet, this is the playbook that President Trump has apparently followed over the first 100 days of his second term.",
    "url": "https://www.nytimes.com/2025/04/26/opinion/trump-national-security.html?unlocked_article_code=1.Ck8.rKtz._v22842CIdwE&smid=url-share"
  },
  {
    "text": "MAGA maximalism: Trump's base loves Wisconsin judge arrest  —  The FBI's arrest of a Wisconsin judge shocked the establishment.  But it's exactly the kind of escalation the MAGA base has been agitating for.  — “This is not the time for summer soldiers or sunshine patriots,” … ",
    "url": "https://www.axios.com/2025/04/26/maga-maximalism-trump-base-wisconsin-judge-arrest"
  },
  {
    "text": "I oversaw rigorous review of NSF-funded research on misinformation: Now the Trump administration is cancelling it  —  For the last three years, I was the director of the Science of Science: Discovery, Communication, and Impact program at the NSF.  This program funded research on the social science … ",
    "url": "https://donmoynihan.substack.com/p/i-oversaw-rigorous-review-of-nsf"
  },
  {
    "text": "As Trump destroys the economy, GOP and Wall Street execs stay mum  —  They seem to think they can pressure Trump privately.  It's not working.  —  President Donald Trump is torching the U.S. economy.  He's attacking our trade alliances and our ability to control inflation.",
    "url": "https://www.washingtonpost.com/opinions/2025/04/26/trump-economy-tariffs-federal-reserve-wall-street/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ1NjQwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ3MDIyMzk5LCJpYXQiOjE3NDU2NDAwMDAsImp0aSI6ImQ2M2QzZmY3LTU5MmEtNDJiNC1iN2M2LTIxMjcxZGNmNmExYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA0LzI2L3RydW1wLWVjb25vbXktdGFyaWZmcy1mZWRlcmFsLXJlc2VydmUtd2FsbC1zdHJlZXQvIn0.NvU2f4aFoangMJQgk720euqVuBSOWz5S4_iIPsPKjLQ&itid=gfta"
  },
  {
    "text": "Inherent Vice: Can America Come Back From Who We've Become?  —  At the richest moment in world history, in an unparalleled time of comforts and luxuries, we have elected self-harm and self-pity. … This extended quotation comes from the Greek historian Appian's account of the Punic Wars … ",
    "url": "https://www.liberalcurrents.com/inherent-vice-can-america-come-back-from-who-weve-become/"
  },
  {
    "text": "US to miss out on billions as Trump's policies deter overseas tourists  —  Number of visitors sinks 11.6% in March as deportations and tariffs make US a less appealing destination  —  Every summer, Cheryl travels to Iowa, from her home in St Kitts.  She rents a three-bedroom house for her and her US-based adult children.",
    "url": "https://www.theguardian.com/us-news/2025/apr/26/trump-tariffs-trade-war-tourism"
  },
  {
    "text": "Trump's Vicious Sewing Circle  —  I was already feeling queasy about the Trump administration when I saw that the Agriculture Department was withdrawing a Biden-era proposal meant to reduce salmonella in poultry.  —  So besides making us jittery — and “yippy” — the Trump gang is trying to make us actually sick.",
    "url": "https://www.nytimes.com/2025/04/26/opinion/trump-gender-roles-masculinity.html"
  },
  {
    "text": "Trump Officials Weaken Rules Insulating Government Workers From Politics  —  A reinterpretation of the Hatch Act announced by the administration lets officials wear campaign paraphernalia like MAGA hats, and removes an independent board's role in policing violations.",
    "url": "https://www.nytimes.com/2025/04/25/us/politics/trump-hatch-act.html"
  },
  {
    "text": "Sen. Chris Murphy's ‘emergency’ message about Trump is connecting with Democratic voters  —  Connecticut Sen. Chris Murphy isn't drawing stadium-size crowds like Vermont Sen. Bernie Sanders and New York Rep. Alexandria Ocasio-Cortez are as he tours the country talking to voters.",
    "url": "https://apnews.com/article/chris-murphy-democrats-trump-opposition-2026-senate-2209564b2e03d990e11abe2cb4987658"
  },
  {
    "text": "RFK Jr. isn't staying in his lane.  Trump is thrilled.  —  Robert F. Kennedy Jr. has expanded his authority well beyond the bounds of a traditional health secretary.  —  Robert F. Kennedy Jr. is fast becoming the most prominent face of the Trump administration's domestic agenda … ",
    "url": "https://www.politico.com/news/2025/04/26/rfk-jr-isnt-staying-in-his-lane-trump-is-thrilled-00310770"
  }
]