[
  {
    "text": "Romney says any Democrat would be ‘an upgrade’ over Trump in 2024  —  Sen. Mitt Romney (R-Utah) signaled that nearly any candidate in the 2024 field, of either party, would be an “upgrade” over another term for former President Trump.  —  “I'd be happy to support virtually any one of the Republicans … ",
    "url": "https://thehill.com/homenews/senate/4327061-romney-democrat-upgrade-over-trump-in-2024/"
  },
  {
    "text": "THE DANGER OF NOT CONFRONTING TRUMP  —  I believe we must question and confront Trump for democracy, for the rights of immigrants and, simply, for good journalism.  —  Due to the strong criticisms after Univision aired an interview with Donald Trump on Nov. 9 -that put in doubt the independence … ",
    "url": "https://jorgeramos.com/en/the-danger-of-not-confronting-trump-2/"
  },
  {
    "text": "Who Would Donald Trump  —  CHOOSE AS HIS RUNNING MATE?  —  Donald J. Trump hasn't won a single primary or caucus vote yet, let alone the Republican nomination, but his lead in the polls has left much of the political world viewing his nomination as all but inevitable.",
    "url": "https://www.nytimes.com/interactive/2023/us/politics/donald-trump-vp.html"
  },
  {
    "text": "Santos lashes out at colleagues as he stares down expulsion  —  Rep. George Santos (R-N.Y.) said Friday he won't resign from Congress but acknowledged he will likely be expelled as he lobbed salacious accusations at colleagues and called the chair of the Ethics Committee a “p***y”.",
    "url": "https://www.axios.com/2023/11/25/santos-lashes-out-expulsion-vote"
  },
  {
    "text": "Santos accuses colleagues of voting hungover, sleeping around in profanity-laden tirade against ethics report  —  Santos accused the Ethics Committee of targeting him unfairly while there are ‘felons galore’ in Congress  —  Embattled New York Republican Rep. George Santos delivered … ",
    "url": "https://www.foxnews.com/politics/santos-accuses-colleagues-voting-hungover-sleeping-profanity-laden-tirade-ethics-report?intcmp=tw_pols"
  },
  {
    "text": "Pro-Israel teacher hides in Queens high school as ‘radicalized’ students riot: ‘They want her fired’  —  Hundreds of “radicalized” kids rampaged through the halls of a Queens high school this week for nearly two hours after they discovered a teacher had attended a pro-Israel rally … ",
    "url": "https://nypost.com/2023/11/25/metro/jewish-teacher-hides-in-queens-high-school-as-students-riot/"
  },
  {
    "text": "Ex-officer Derek Chauvin, convicted in George Floyd's killing, stabbed in prison, AP source says  —  Derek Chauvin, the former Minneapolis police officer convicted of murdering George Floyd, was stabbed by another inmate and seriously injured Friday at a federal prison in Arizona … ",
    "url": "https://apnews.com/article/derek-chauvin-george-floyd-prison-stabbing-f24cde6aa28877d034530c2dc40ef7ea"
  },
  {
    "text": "Derek Chauvin stabbed, seriously injured in prison  —  The former Minneapolis police officer has been serving time in a medium-security prison in Arizona.  —  Former Minneapolis police officer Derek Chauvin was stabbed and seriously injured Friday by a fellow inmate at an Arizona federal prison … ",
    "url": "https://www.startribune.com/report-derek-chauvin-stabbed-seriously-injured-in-prison/600322234/"
  },
  {
    "text": "Gaza Civilians, Under Israeli Barrage, Are Being Killed at Historic Pace  —  In less than two months, more than twice as many women and children have been reported killed in Gaza than in Ukraine after two years of war.  —  Israel has cast the deaths of civilians in the Gaza Strip as a regrettable … ",
    "url": "https://www.nytimes.com/2023/11/25/world/middleeast/israel-gaza-death-toll.html"
  },
  {
    "text": "The polls keep getting worse for Biden  —  Trump's vote share in national polls is higher than at any time in the past year.  —  President Joe Biden's poll numbers keep getting worse.  —  November started with New York Times/Siena College polls showing Trump ahead in four of the six swing states … ",
    "url": "https://www.politico.com/news/2023/11/25/biden-polls-worse-trump-00128536"
  },
  {
    "text": "What we actually know about aliens, according to science  —  GREEN BANK, W.Va. — It came from space, hurtling at tremendous speed: a mystery object, reddish, rocky, shaped like a cigar.  Its velocity was so extreme it had to have come from somewhere far away, in the interstellar realm.",
    "url": "https://www.washingtonpost.com/science/2023/11/25/aliens-uaps-scientific-evidence/"
  },
  {
    "text": "A Troubling Trump Pardon and a Link to the Kushners  —  A commutation for a drug smuggler named Jonathan Braun had broader implications than previously known.  It puts new focus on how Donald Trump would use his clemency powers in a second term.  —  Even amid the uproar … ",
    "url": "https://www.nytimes.com/2023/11/26/us/politics/trump-pardon-braun.html"
  },
  {
    "text": "Trump slams evangelical leader who endorsed DeSantis as ‘scammer’  —  Former President Trump turned his ire onto influential Iowa evangelical leader Bob Vander Plaats, after he announced his endorsement of Florida Gov. Ron DeSantis earlier this week.  —  “Bob Vander Plaats … ",
    "url": "https://thehill.com/homenews/campaign/4327173-trump-desantis-evangelical-leader-endorsement-2024/"
  },
  {
    "text": "Trump Shows Off at Palmetto Bowl Football Faceoff on Nikki Haley's Home Turf to Mixed Reception  —  'You lost.  You're guilty.  Welcome to Columbia, Donald,' flashed two billboards that greeted him, sponsored by ‘vermin’  —  Former President Donald Trump came out to watch … ",
    "url": "https://themessenger.com/politics/trump-shows-off-at-palmetto-bowl-football-faceoff-on-nikki-haleys-home-turf-to-mixed-reception"
  },
  {
    "text": "Andrew Cuomo accused of sexual harassment in new lawsuit filed by former executive assistant Brittany Commisso  —  A former executive assistant to former New York Gov. Andrew Cuomo who had accused him of groping her has filed a lawsuit alleging sexual harassment.",
    "url": "https://www.cbsnews.com/news/andrew-cuomo-sued-sexual-assault-brittany-commisso-former-executive-assistant/"
  }
]