[
  {
    "text": "‘Bloody Saturday’ at Voice of America and other U.S.-funded networks  —  Journalists showed up at the Voice of America today to broadcast their programs only to be told they had been locked out: Federal officials had embarked on indefinite mass suspensions.  —  All full-time staffers … ",
    "url": "https://www.npr.org/2025/03/15/nx-s1-5329244/bloody-saturday-voiceofamerica-radio-free-asia-europe-trump-kari-lake"
  },
  {
    "text": "Continuing the Reduction of the Federal Bureaucracy  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  This order continues the reduction in the elements of the Federal bureaucracy … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/continuing-the-reduction-of-the-federal-bureaucracy/"
  },
  {
    "text": "Trump Orders Gutting of 7 Agencies, Including Voice of America's Parent  —  The order targeting the agencies, largely obscure entities that address issues like labor mediation and homelessness prevention, appeared to test the bounds of the president's power.",
    "url": "https://www.nytimes.com/2025/03/15/us/politics/trump-order-voice-of-america.html?unlocked_article_code=1.4E4.gU4N.aG0u4sAo_cSa&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump signs order to dismantle seven federal agencies focused on media, libraries, homelessness  —  President Trump on Friday signed an executive order that aims to eliminate seven federal agencies, including ones that focus on media, libraries, museums and ending homelessness.",
    "url": "https://thehill.com/homenews/administration/5196704-trump-executive-order-federal-agencies-eliminate/"
  },
  {
    "text": "How a Columbia Student Fled to Canada After ICE Came Looking for Her  —  Ranjani Srinivasan's student visa was revoked by U.S. immigration authorities.  That was just the start of her odyssey.  —  The first knock at the door came eight days ago, on a Friday morning.",
    "url": "https://www.nytimes.com/2025/03/15/nyregion/columbia-student-kristi-noem-video.html"
  },
  {
    "text": "‘It Is Facing a Campaign of Annihilation’: Three Columnists on Trump's War Against Academia  —  Patrick Healy, the deputy Opinion editor, hosted an online conversation with the Times Opinion columnists M. Gessen, Tressie McMillan Cottom and Bret Stephens about Donald Trump's attacks … ",
    "url": "https://www.nytimes.com/2025/03/15/opinion/trump-higher-education.html?unlocked_article_code=1.4E4.tp8k.8E09Vqh8-A0x&smid=url-share"
  },
  {
    "text": "Trump Expands Attacks on Law Firms, Singling Out Paul, Weiss  —  Experts have warned that the president's efforts threaten the ability of lawyers to do their jobs and private citizens to obtain legal counsel.  —  President Trump on Friday opened a third attack against a private law firm … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/trump-law-firm.html?unlocked_article_code=1.4E4.DSe8.9w4654cpMXpr&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Green card holder from New Hampshire ‘interrogated’ at Logan Airport, detained  —  A New Hampshire man with a green card was detained by immigration officers at Logan Airport and is being held by U.S. Immigration and Customs Enforcement at the Donald W. Wyatt detention facility in Central Falls, Rhode Island.",
    "url": "https://www.nhpr.org/nh-news/2025-03-14/green-card-holder-from-new-hampshire-interrogated-at-logan-airport-detained"
  },
  {
    "text": "Judge blocks Trump from deporting 5 Venezuelans in anticipation of administration invoking wartime law  —  U.S. District Judge James Boasberg issued the urgent ruling Saturday morning, citing “exigent circumstances.”  —  A federal judge has preemptively barred the Trump administration … ",
    "url": "https://www.politico.com/news/2025/03/15/trump-deportation-lawsuit-00232121"
  },
  {
    "text": "U.S. Launches Broad Attack on Militant Sites in Yemen  —  The air and naval strikes on targets controlled by Houthi fighters were intended to open up international shipping lanes in the Red Sea.  —  The United States began large-scale military strikes on Saturday against dozens of targets … ",
    "url": "https://www.nytimes.com/2025/03/15/us/politics/us-attack-houthis.html?unlocked_article_code=1.4E4.L_Jf.rG1ujfWb4AWs&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Trump Says He Ordered Military Action Against Houthis in Yemen  —  President Donald Trump says he ordered the US military to launch decisive and powerful action against the “Houthi terrorists” in Yemen.",
    "url": "https://www.bloomberg.com/news/articles/2025-03-15/trump-says-he-ordered-military-action-against-houthis-in-yemen"
  },
  {
    "text": "Keeping With Kennedy's Advice, Measles Patients Turn to Unproven Treatments  —  In West Texas, some with severe illness have not been taken to a doctor until their conditions worsened, officials said.  —  Struggling to contain a raging measles epidemic in West Texas, public health officials … ",
    "url": "https://www.nytimes.com/2025/03/15/health/measles-texas-kennedy.html?unlocked_article_code=1.4E4.k_it.5DRBXEbONfjO&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Musk Said No One Has Died Since Aid Was Cut.  That Isn't True.  —  Mr. Kristof reported from South Sudan and Nairobi, Kenya.  Ms. Fezehai is a photographer and visual journalist based in Kenya.  —  As the world's richest men slash American aid for the world's poorest children, they insist that all is well.",
    "url": "https://www.nytimes.com/interactive/2025/03/15/opinion/foreign-aid-cuts-impact.html?unlocked_article_code=1.4E4.H8Lx.GD39rucUfloD&smid=url-share"
  },
  {
    "text": "‘Do something, dammit!’:  Tim Walz says Democrats need to answer Americans' ‘primal scream’  —  Minnesota Gov. Tim Walz said he came to Iowa Friday to answer the “primal scream” coming from Americans demanding that elected officials do more to push back against President Donald Trump's sweeping, norm-defying agenda.",
    "url": "https://www.usatoday.com/story/news/politics/2025/03/15/tim-walz-iowa-democrats-donald-trump/82440491007/"
  },
  {
    "text": "Critics warn staff cuts at federal agencies overseeing US dams could put public safety at risk  —  Trump administration workforce cuts at federal agencies overseeing U.S. dams are threatening their ability to provide reliable electricity, supply farmers with water and protect communities from floods, employees and industry experts warn.",
    "url": "https://apnews.com/article/dams-fired-workers-electric-flood-control-irrigation-1369398af058b661d40ef6b68216c775"
  },
  {
    "text": "R.I. doctor prevented from returning to US after visiting her parents in Lebanon  —  Dr. Rasha Alawieh works at Brown Medicine and Rhode Island Hospital, and she had secured an H-1B visa, her lawyer said  —  PROVIDENCE — A Rhode Island doctor who had traveled to Lebanon to see her parents … ",
    "url": "https://www.bostonglobe.com/2025/03/14/metro/ri-doctor-prevented-from-returning-to-us-after-visiting-parents-in-lebanon/"
  },
  {
    "text": "Elon Musk Shared, Then Removed a Post Absolving Dictators for Genocide  —  The post falsely claimed that Joseph Stalin, Adolf Hitler and Mao Zedong were not responsible for the murders of millions of people, but rather public sector workers were.  —  Early on Friday, Elon Musk shared … ",
    "url": "https://www.nytimes.com/2025/03/14/technology/elon-musk-x-post-hitler-stalin-mao.html?unlocked_article_code=1.4E4.RW-P.VV-Qk7n8s5HK&smid=bs-share"
  },
  {
    "text": "Trump's Attempts to Muzzle the Press Look Familiar  —  Much of what the U.S. president has done to curb independent media echoes the Hungarian autocrat Viktor Orbán's playbook.  —  When Viktor Orbán gave a speech in 2022 at a Conservative Political Action Conference gathering in Budapest … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/03/trumps-press-freedom-hungary-orban/682060/?gift=mRAZp9i2kzMFnMrqWHt67ftlLTcyiNPHSa1ei9vlbOA&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Trump Administration Expels South Africa's Ambassador to the U.S.  —  Secretary of State Marco Rubio had lashed out on social media over comments critical of President Trump that the ambassador had made to a think tank in Johannesburg.  —  President Trump's administration … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/south-africa-ambassador-marco-rubio.html"
  },
  {
    "text": "A majority-Black town starts armed protection group after neo-Nazi rally  —  “I feel like it's more secure now,” one woman said.  “I know my son can walk home and be OK.”  —  LINCOLN HEIGHTS, Ohio — Nearly every morning for the last month, Jay has been waking up before sunrise to drive around … ",
    "url": "https://www.nbcnews.com/news/nbcblk/lincoln-heights-ohio-armed-protection-group-neo-nazi-rally-rcna196240"
  },
  {
    "text": "Addressing Risks from Paul Weiss  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Background.  Global law firms have for years played an outsized role in undermining the judicial process … ",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/03/addressing-risks-from-paul-weiss/"
  }
]