[
  {
    "text": "Trump Expected to Choose Brooke Rollins to Lead Agriculture Department  —  Rollins is a former domestic policy adviser to the president-elect  —  President-elect Donald Trump is expected to select Brooke Rollins, a former Trump administration policy adviser, to lead the Agriculture Department … ",
    "url": "https://www.wsj.com/politics/trump-expected-to-choose-brooke-rollins-to-lead-agriculture-department-50b6a3fd"
  },
  {
    "text": "Behind the Curtain: Trump's liberal cabinet … - As Axios' Zachary Basu told you, Trump's Cabinet increasingly resembles a European-style coalition government, staffed with a dizzying array of ideological rivals united — for now — by a grand MAGA vision.",
    "url": "https://www.axios.com/2024/11/23/trump-liberal-cabinet-rfk-tulsi-gabbard-bessent"
  },
  {
    "text": "Trump Transition Updates: Cabinet Nearly Full With Flurry of Friday Picks  —  Where Things Stand  — President-elect Donald J. Trump picked Scott Bessent on Friday to serve as Treasury secretary, tapping a billionaire hedge fund manager to lead an economic agenda that is expected to be built around raising tariffs and cutting taxes.",
    "url": "https://www.nytimes.com/live/2024/11/22/us/trump-cabinet-news"
  },
  {
    "text": "Elon Musk Is Now Cyberbullying Government Employees  —  Elon Musk is so excited to start his new gig ruining the federal government that he's getting an early start by goading his millions of followers to cyberbully government employees.  —  This week, Musk took aim at Ashley Thomas … ",
    "url": "https://newrepublic.com/post/188773/elon-musk-x-government-employees-call-out"
  },
  {
    "text": "Trump fills out his team of randos  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  INTERACTIVE DATA DIVE — “Where Kamala Harris lost big city voters in the battlegrounds,” by Jessica Piper, Paroma Soni and Brakkton Booker: “Blue cities represent the core of the Democratic base. ...",
    "url": "https://www.politico.com/newsletters/playbook/2024/11/23/trump-fills-out-his-team-of-randos-00191387"
  },
  {
    "text": "Where Kamala Harris lost big city voters in the battlegrounds  —  In the swing states, turnout in the major cities trailed the rest of the state.  The drops weren't the same across neighborhoods, though.  —  Kamala Harris was banking on a robust turnout in Philadelphia … ",
    "url": "https://www.politico.com/news/2024/11/23/city-turnout-black-hispanic-neighborhoods-00191354"
  },
  {
    "text": "Sharp elbows and raised voices: Inside Trump's bumpy transition  —  His freewheeling team has returned to the patterns of his first term in office — with shouting matches, expulsions from meetings and name-calling.  —  Donald Trump's attorney and adviser Boris Epshteyn showed up recently … ",
    "url": "https://www.washingtonpost.com/politics/2024/11/23/trump-team-rivals-mar-a-lago/"
  },
  {
    "text": "Trump AG Pick Pam Bondi Is About to Regret What She Just Signed Up For … Matt Gaetz's withdrawal from consideration as Donald Trump's attorney general is unquestionably a big victory for the rule of law.  But now that Trump has put forth Pam Bondi—the former Florida attorney general whose loyalty … ",
    "url": "https://newrepublic.com/article/188777/pam-bondi-trump-attorney-general-regret"
  },
  {
    "text": "Canada's top military commander calls out US senator for questioning a woman's role in combat  —  The first woman to command Canada's military called out a U.S. senator on Saturday for questioning the role of women in combat.  Gen. Jennie Carignan responded to comments made by Idaho Republican … ",
    "url": "https://apnews.com/article/woman-combat-canada-us-carignan-risch-23ad537fbfab4a63e41b5d4366f24d91"
  },
  {
    "text": "Fox hosts, cable news regulars and entertainment pros: Trump is casting a made-for-TV Cabinet  —  A common thread weaves through many of Donald Trump's picks for his incoming administration, a quality the president-elect values as highly as loyalty and perhaps even more than conventional qualifications: a flair for television.",
    "url": "https://www.cnn.com/2024/11/23/politics/trump-tv-cabinet/"
  },
  {
    "text": "Voters rejected historic election reforms across the US, despite more than $100M push  —  Two weeks before Election Day, activists from across the country gathered for an online rally heralding the historic number of state ballot initiatives seeking to change the way people vote.",
    "url": "https://apnews.com/article/ranked-choice-voting-open-primaries-election-reform-bc797f209e5f98a18afb2e5f784e63b6"
  },
  {
    "text": "I Watched Orbán Destroy Hungary's Democracy.  Here's My Advice for the Trump Era.  —  To dismantle the machinery of autocracy, you first need to understand how it works.  —  Many believed that after his first term as president, Donald Trump would end up in the dustbin of history.",
    "url": "https://www.politico.com/news/magazine/2024/11/23/trump-autocrat-elections-00191281"
  },
  {
    "text": "How Scott Bessent Won the ‘Knife Fight’ to Be Trump's Treasury Secretary  —  Longtime investor and his allies launched a public-relations campaign to cement his front-runner status",
    "url": "https://www.wsj.com/politics/how-scott-bessent-won-the-knife-fight-to-be-trumps-treasury-secretary-a0e5ce33"
  },
  {
    "text": "Team Trump Is Furious Hegseth Hid Sex Assault Claim: ‘This Is the F-king Pentagon!’  —  The president-elect is putting Republican senators to the test with a string of controversial administration picks … Hegseth was already facing an uphill confirmation battle to become the Secretary … ",
    "url": "https://www.rollingstone.com/politics/politics-features/pete-hegseth-hiding-sex-assault-claim-trump-team-1235178188/"
  },
  {
    "text": "Election Forecasts Try to Go Beyond the Polls.  Are They Helping?  —  The forecasts, like those from Decision Desk HQ, Nate Silver and 538, are now ubiquitous, but their accuracy is hard to measure.  —  In 2008, Nate Silver's election forecast model was so novel — and accurate … ",
    "url": "https://www.nytimes.com/2024/11/23/us/elections/election-forecasts-predictions.html"
  },
  {
    "text": "Musk, Ramaswamy ‘DOGE’ confidence in Supreme Court may be tested  —  Elon Musk and Vivek Ramaswamy are leaning on the conservative Supreme Court to support their ambitious plans to slash federal regulations and increase government efficiency.  —  Tapped by President-elect Trump … ",
    "url": "https://thehill.com/homenews/administration/5005220-elon-musk-vivek-ramaswamy-government-efficiency/"
  },
  {
    "text": "Supreme Court steps into fight over FCC's $8 billion subsidies for internet and phone services  —  The Supreme Court on Friday stepped into a major legal fight over the $8 billion a year the federal government spends to subsidize phone and internet services in schools, libraries and rural areas … ",
    "url": "https://apnews.com/article/supreme-court-fcc-subsidies-telecommunications-01fe0754c2bf71d17d34bde21a3825de"
  },
  {
    "text": "Texas approves new Bible-based curriculum for elementary schools  —  Teachers can opt in, but state is offering financial incentive of $60 a student for participating school districts  —  The Texas board of education voted 8-7 on Friday to approve a new Bible-based curriculum in elementary schools.",
    "url": "https://www.theguardian.com/us-news/2024/nov/22/texas-approves-bible-based-curriculum-elementary-schools"
  }
]