[
  {
    "text": "Joe Biden for President  —  I will do all that I can to see that President Biden is re-elected.  Why?  Despite my disagreements with him on particular issues, he has been the most effective president in the modern history of our country and is the strongest candidate to defeat Donald Trump — a demagogue and pathological liar.",
    "url": "https://www.nytimes.com/2024/07/13/opinion/joe-biden-president.html"
  },
  {
    "text": "Live Election Updates: Trump Returns to Pennsylvania as Biden Looks to Steady His Campaign  —  Vice President Kamala Harris and Jill Biden will also hold events in the key battleground state following the president's fiery speech in Detroit on Friday.  —  Trump will rally in Pennsylvania, as Biden allies hit the trail, too.",
    "url": "https://www.nytimes.com/live/2024/07/13/us/biden-trump-election"
  },
  {
    "text": "Trump heads to Pennsylvania for pre-convention rally as VP announcement looms  —  Donald Trump will have one last chance Saturday to unveil his vice presidential pick on a rally stage before the Republican National Convention kicks off in Milwaukee next week.",
    "url": "https://apnews.com/article/trump-vp-vance-rubio-7c7ba6b99b5f38d2d840ed95b2fdc3e5"
  },
  {
    "text": "The unusual legal risk Trump will have to navigate at the RNC  —  There's a high likelihood that others involved in Trump's alleged crimes could be in Milwaukee.  —  Donald Trump will be rubbing elbows in Milwaukee with a crowd that may include dozens of witnesses and alleged co-conspirators … ",
    "url": "https://www.politico.com/news/2024/07/13/trump-rnc-legal-risks-00167950"
  },
  {
    "text": "Peter Navarro, Trump ex-aide jailed for contempt of Congress, will address RNC, AP sources say  —  Former White House trade advisor Peter Navarro, who is currently in jail on contempt of Congress charges, is expected to speak at next week's Republican National Convention just hours after his release.",
    "url": "https://apnews.com/article/peter-navarro-trump-rnc-3d7bc64a3a578f09d36ea6b6d4ce04c5"
  },
  {
    "text": "Trump skeptics planning to skip the GOP convention … - Sens. Lisa Murkowski (Alaska), Susan Collins (Maine), Todd Young (Indiana), Mitt Romney (Utah) and Rand Paul (Kentucky) are all skipping the party's convention, according to the senators or their offices. … - “I always go to my state convention.",
    "url": "https://www.axios.com/2024/07/13/trump-skeptics-senate-republican-skip-republican-national-convention"
  },
  {
    "text": "Inside Ziklag, the Secret Organization of Wealthy Christians Trying to Sway the Election and Change the Country  —  Co-published with Documented  —  A network of ultrawealthy Christian donors is spending nearly $12 million to mobilize Republican-leaning voters and purge more than a million people … ",
    "url": "https://www.propublica.org/article/inside-ziklag-secret-christian-charity-2024-election"
  },
  {
    "text": "Inside Biden's sputtering campaign to restore Dems' confidence  —  Senate Democrats are sitting on their hands as the Biden campaign sputters.  —  Three of Joe Biden's senior aides entered a Senate Democratic lunch on Thursday armed with internal and external polls showing … ",
    "url": "https://www.politico.com/news/2024/07/13/democrats-biden-concerns-00167915"
  },
  {
    "text": "What Is Project 2025?  Inside the Far-Right Plan Threatening Everything from the Word ‘Gender’ to Public Education  —  Trump's allies started Project 2025 as a blueprint for marrying church and state at the highest levels of government if he's elected  —  A sweeping proposal for how Donald Trump … ",
    "url": "https://people.com/what-is-project-2025-inside-far-right-plan-trump-presidency-8622964"
  },
  {
    "text": "Musk Donates to Trump, Tapping Fortune to Swing 2024 Race  — Tech mogul contributed to group backing Trump in swing states  — Move demonstrates Musk's growing influence in Washington  —  Billionaire Elon Musk has donated to a super political action committee working to elect Donald Trump … ",
    "url": "https://www.bloomberg.com/news/articles/2024-07-12/elon-musk-donates-to-trump-tapping-vast-fortune-to-swing-2024-race"
  },
  {
    "text": "Israeli strike on Gaza targets, likely kills, Hamas leader Mohammad Deif  —  The IDF said that dozens of those killed in the strike on Deif were active Hamas terrorists.  —  Mohammad Deif, the leader of the Izzadin al-Qassam Brigades, Hamas's military wing, was targeted in an airstrike … ",
    "url": "https://www.jpost.com/breaking-news/article-810137"
  },
  {
    "text": "Dr. Ruth Westheimer, America's diminutive and pioneering sex therapist, dies at 96  —  Dr. Ruth Westheimer, the diminutive sex therapist who became a pop icon, media star and best-selling author through her frank talk about once-taboo bedroom topics, has died.  She was 96.",
    "url": "https://apnews.com/article/ruth-westheimer-dies-6d4af57b5f034bf9a90977de41b88735"
  },
  {
    "text": "The 75 Best Sci-Fi Books of All Time  —  See if your favorites made our expanded list.  —  Since time immemorial, mankind has been looking up at the stars and dreaming, but it was only centuries ago that we started turning those dreams into fiction.  And what remarkable dreams they are … ",
    "url": "https://www.esquire.com/entertainment/books/g39358054/best-sci-fi-books/"
  },
  {
    "text": "Unbowed by Jan. 6 Charges, Republicans Pursue Plans to Contest a Trump Defeat … Nearly four years ago, Mr. Trump's attempt to challenge the election results was chaotic and improvised.  This year, his allies are systematically searching for any vulnerability in the nation's election system.Scott McIntyre for The New York Times",
    "url": "https://www.nytimes.com/2024/07/13/us/politics/republican-election-campaign-2024.html"
  }
]