[
  {
    "text": "Trump's Trial Could Bring a Rarity: Consequences for His Words  —  The former president has spent decades spewing thousands and thousands of words, sometimes contradicting himself.  That tendency is now working against him in his Manhattan criminal case.  —  “So that's not true?  That's not true?”",
    "url": "https://www.nytimes.com/2024/04/28/us/politics/trump-trial-words.html"
  },
  {
    "text": "Biden roasts Trump (in a serious way) at annual press dinner  —  At the White House correspondents' dinner, the president chuckled at his opponent's expense but made it clear Donald Trump is no joke  —  There were some 2,600 people at Saturday's White House Correspondents' Association dinner.",
    "url": "https://www.washingtonpost.com/style/2024/04/28/biden-trump-white-house-correspondents-dinner-2024/"
  },
  {
    "text": "Biden will give election-year roast at annual correspondents' dinner as protests await over Gaza war  —  An election-year roast of President Joe Biden before journalists, celebrities and politicians at the annual White House correspondents' dinner Saturday butted up against growing public discord … ",
    "url": "https://apnews.com/article/biden-white-house-correspondents-dinner-colin-jost-5843271c1d3a868d700cfc525ddc7f8d"
  },
  {
    "text": "Pro-Israel Agitator Shouts ‘Kill the Jews,’ Gets Everyone Else Arrested  —  HATE SPEECH  —  Around 100 protesters were arrested on Saturday at a pro-Palestine encampment at Northeastern University, but not the one whose hate speech got everything shut down.",
    "url": "https://www.thedailybeast.com/pro-israel-agitator-shouts-kill-the-jews-gets-everyone-else-arrested"
  },
  {
    "text": "Dems, GOP bash Kristi Noem for shooting her dog  —  The South Dakota governor has seen her political caché skyrocket in recent years and is reportedly a top contender to become Donald Trump's 2024 running mate.  —  Both Democrats and Republicans are piling on after South Dakota … ",
    "url": "https://www.politico.com/news/2024/04/27/dems-gop-bash-kristi-noem-memoir-00154789"
  },
  {
    "text": "Kremlin Disputes Report Putin Didn't Order Navalny's Death  —  OWNING UP?  —  Dmitry Peskov said the report had “very empty reasoning.”  —  Russia has dismissed a report claiming Vladimir Putin did not order the killing of famed dissident Alexei Navalny, who died in an Arctic prison in February.",
    "url": "https://www.thedailybeast.com/kremlin-disputes-report-vladimir-putin-didnt-order-alexei-navalnys-death"
  },
  {
    "text": "Scoop: Gov. Doug Burgum moves up Trump's VP ladder … - In recent weeks, the sources said, Trump frequently has brought up Burgum's name in discussions with allies.  — Spokespeople for Trump and Burgum declined to comment. … - Those are similar to the traits Trump cited in 2016 … ",
    "url": "https://www.axios.com/2024/04/28/trump-burgum-vice-president-contender-election"
  },
  {
    "text": "GOP Campaign Aide's X Account Shared and Liked Racist Posts  —  RECEIPTS  —  Tim Sheehy, GOP candidate for Senate in Montana, hired a campaign staffer with social media accounts and public statements emblematic of the fringe far right. … At first glance, Caleb Oriet's social media accounts look typical … ",
    "url": "https://www.thedailybeast.com/tim-sheehy-gop-campaign-aides-x-account-shared-and-liked-racist-posts"
  },
  {
    "text": "Shocker From Top Conservative Judge: Trump Likely To Skate Completely  —  “I'm profoundly disturbed about the apparent direction of the court,” J. Michael Luttig told me.  “I now believe that it is unlikely Trump will ever be tried for the crimes he committed in attempting to overturn the 2020 election.”",
    "url": "https://newrepublic.com/article/181059/luttig-trump-january-6-case"
  },
  {
    "text": "A ‘coat hanger’ could unlock Mar-a-Lago storage room where Trump stored classified docs: Witness  —  The account was relayed to FBI agents by an unidentified aide to Trump.  —  In this March 5, 2024, file photo, Republican presidential candidate, former President Donald Trump attends … ",
    "url": "https://abcnews.go.com/US/coat-hanger-unlock-mar-lago-storage-room-trump/story?id=109716197"
  },
  {
    "text": "Arizona Dem says state is bluer ‘not because Arizona is necessarily a blue state,’ but from distaste for GOP ‘extremism’  — An Arizona lawmaker says GOP “extremism” has led many state voters to increasingly back Democrats.  — “The Republican party has become extreme in the age of Trumpism,” the state senator told Politico.",
    "url": "https://www.businessinsider.com/arizona-extreme-gop-abortion-ban-trump-biden-2024-4"
  },
  {
    "text": "Harvey Weinstein Isn't Alone.  Our Institutions Are Rapists  —  VOTE THEM OUT  —  In state after state, governments dominated by white men are dehumanizing and taking ownership over women's bodies.  Every branch of our government commodifies and devalues women.",
    "url": "https://www.thedailybeast.com/alyssa-milano-harvey-weinstein-isnt-alone-our-institutions-are-rapists"
  },
  {
    "text": "Press Conference: Under Israeli Pressure, Guinea Bissau Moves to Withdraw Flotilla Flags  —  ISTANBUL, TÜRK&Iabove;YE:  —  On Thursday afternoon, the Freedom Flotilla Coalition was contacted by the Guinea Bissau International Ships Registry (GBISR), requesting an inspection of our lead ship - Akdenez.",
    "url": "https://freedomflotilla.org/2024/04/27/press-conference-under-israeli-pressure-guinea-bissau-moves-to-withdraw-flotilla-flags/"
  },
  {
    "text": "Progressive NY Rep. Jamaal Bowman duped by fake ‘Chief rabbi of Gaza’  —  Rep. Jamaal Bowman and his campaign were duped by the parody social-media account of the fake “Chief Rabbi of Gaza.”  —  The phony X account of “Rabbi Linda Goldstein” is infamous for spouting anti-Zionist vitriol … ",
    "url": "https://nypost.com/2024/04/27/us-news/progressive-ny-rep-jamaal-bowman-duped-by-fake-rabbi-of-gaza/"
  }
]