[
  {
    "text": "White House lawyers who advised Reagan, Bush endorse Harris over Trump in 2024 showdown  —  FIRST ON FOX: A dozen Republican White House lawyers who served in the administrations of then-Presidents Ronald Reagan, George H.W. Bush and George W. Bush are endorsing Vice President Kamala Harris … ",
    "url": "https://www.foxnews.com/politics/white-house-lawyers-who-advised-reagan-bush-endorse-harris-over-trump-2024-showdown"
  },
  {
    "text": "Disaffected Republicans and former Trump officials spoke at the DNC.  Fox News didn't air a second of any of their speeches.  —  Fox News did not air a second of the speeches from alienated GOP leaders and former Trump officials who endorsed Vice President Kamala Harris at this week's Democratic National Convention.",
    "url": "https://www.mediamatters.org/fox-news/disaffected-republicans-and-former-trump-officials-spoke-dnc-fox-news-didnt-air-second-any"
  },
  {
    "text": "DNC ratings thump Trump as 29 million TV viewers watch Harris' acceptance speech  —  The momentum of Vice President Kamala Harris' presidential campaign helped push the ratings for the Democratic National Convention past the Republican festivities for former President Trump.",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2024-08-23/dnc-ratings-thump-trump-as-29-million-tv-viewers-watch-harriss-acceptance-speech"
  },
  {
    "text": "Democrats Find Confidence Without Complacency  —  It's a balance they didn't strike well in 2016, with tragic consequences  —  The lead Kamala Harris built over Donald Trump through the first month of her campaign was palpable in the thematic content of the Democratic national convention.",
    "url": "https://www.offmessage.net/p/democrats-show-confidence-without-complacency"
  },
  {
    "text": "There's a reason Adam Kinzinger defended Democrats' patriotism  —  Republicans are 25 times more likely to describe the Democratic Party as “anti-American” than to use the term “patriotic.”  —  Recognizing that the audience for Vice President Kamala Harris's acceptance speech would probably draw … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/23/theres-reason-adam-kinzinger-defended-democrats-patriotism/"
  },
  {
    "text": "Harris Crushes Trump by 22% in Convention Speech Ratings  —  MUCH BIGGER  —  The former president—who angrily posted throughout Harris' Thursday night speech—lost badly in the ratings contest that matters so much to him.  —  Newly-released TV ratings for Kamala Harris' speech at the DNC will likely have Donald Trump seething.",
    "url": "https://www.thedailybeast.com/kamala-harris-dnc-speech-crushed-ratings-for-donald-trumps-acceptance-address"
  },
  {
    "text": "Trump Fumes When Fox News Asks About Harris's Momentum After DNC … Donald Trump called in to Fox News to give his thoughts on Kamala Harris's speech at the Democratic National Convention Thursday night, and he wasn't taking it well.  —  Host Martha MacCallum asked Trump what he would do to regain … ",
    "url": "https://newrepublic.com/post/185231/trump-reaction-fox-news-call-kamala-harris-momentum"
  },
  {
    "text": "Cornel West can't be on Pennsylvania's presidential ballot, court decides  —  Independent presidential candidate Cornel West lost a legal challenge Friday in his bid to get on the ballot in the battleground state of Pennsylvania.  Commonwealth Court Judge Renee Cohn Jubelirer, in a 15-page opinion … ",
    "url": "https://apnews.com/article/pennsylvania-ballot-2024-independent-cornel-west-rfk-406dd1a46489e3049ab70e1633a28414"
  },
  {
    "text": "Foo Fighters Did Not Allow Donald Trump to Use ‘My Hero’ at Rally, Will Donate Any Royalties to Harris Campaign  —  Trump played the 1997 hit to bring Robert Kennedy Jr. to the stage in Glendale, Arizona.  —  Donald Trump may consider Robert F. Kennedy Jr. his hero, given he played … ",
    "url": "https://www.billboard.com/culture/politics/foo-fighters-donald-trump-my-hero-rally-1235760416/"
  },
  {
    "text": "Elon Musk's Lawyers Quietly Subpoena Public Interest Groups  —  The billionaire's legal war over lost X advertisers takes a “really cynical” turn.  —  Lawyers representing Elon Musk and X, previously known as Twitter, have quietly begun sending subpoenas to a host of public interest groups, Mother Jones has learned.",
    "url": "https://www.motherjones.com/politics/2024/08/twitter-x-subpoenas-elon-musk/"
  },
  {
    "text": "RFK Jr. Was My Drug Dealer  —  he leading third-party candidate for president—an environmental lawyer and activist, a son and nephew of legendary liberal Democratic politicians—just quit the race and announced that he is joining the campaign of the most anti-environment president … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/08/rfk-jr-endorse-trump-execute-drug-dealers/679597/?gift=_YJWRO9sT6lILBJDbj6IXBARrGSL_SiqmR7eWDgV4og"
  },
  {
    "text": "Alaska Republican drops out of three-way House race, dealing surprise blow to Democrats nationally  —  In what may be a surprise blow to Democrats' chances of holding a key red state seat in the U.S. House, Alaska Lt. Gov. Nancy Dahlstrom announced Friday she is suspending her campaign for Congress.",
    "url": "https://www.foxnews.com/politics/alaska-republican-drops-out-multi-way-house-race-dealing-surprise-blow-democrats-nationally"
  },
  {
    "text": "Kennedy siblings rip RFK Jr. for endorsing Trump: ‘A betrayal’ of family values  —  Video Player is loading.  —  Play Video  —  Unmute  —  Current Time 0:00 … Stream Type LIVE  —  Seek to live, currently behind liveLIVE  —  Playback Rate  —  Chapters  — Chapters  —  Descriptions",
    "url": "https://thehill.com/homenews/campaign/4844836-rfk-jr-family-trump-endorsement/"
  },
  {
    "text": "Texas, other GOP-led states sue over program to give immigrant spouses of US citizens legal status  —  Sixteen Republican-led states are suing to end a federal program that could potentially give nearly half a million immigrants without legal status who are married to U.S. citizens a path to citizenship.",
    "url": "https://apnews.com/article/immigration-citizen-spouse-biden-d02243b21b8490c912008b896a83bcd2"
  },
  {
    "text": "Ann Coulter Roast Goes Viral as Internet Gets Revenge for Gus Walz  —  BLOWING UP  —  The conservative firebrand told the Daily Beast that Democrats were actually to blame for her mocking Tim Walz's son.  —  Conservative political commentator Ann Coulter was hit by a blizzard of criticism … ",
    "url": "https://www.thedailybeast.com/ann-coulter-roast-goes-viral-as-internet-gets-revenge-for-gus-walz"
  },
  {
    "text": "Judge Blocks E.P.A. From Using Civil Rights Law in Pollution Case  —  The decision is a setback for a Biden administration strategy for protecting minority communities with numerous polluting industries nearby.  —  A federal court in Louisiana has dealt a serious blow to the Biden administration's effort … ",
    "url": "https://www.nytimes.com/2024/08/23/climate/epa-civil-rights-climate-justice.html?unlocked_article_code=1.FE4.FfWh.5yvlv9uXRZKc&smid=url-share"
  },
  {
    "text": "Doug Emhoff, modern-day sex symbol  —  Emhoff is secure enough with his own masculinity to sometimes prioritize his wife's ambitions over his own.  What.  A. Hunk.  —  Doug Emhoff has been called many things in recent years: Second Gentleman.  “Goofy dad.”  “Crappy Jew.”",
    "url": "https://www.washingtonpost.com/opinions/2024/08/23/emhoff-harris-sex-symbol/"
  }
]