[
  {
    "text": "Trump says he's ‘very angry’ and ‘pissed off’ at Putin during an NBC News interview  —  Trump said in an early-morning phone call that if he believes Russia is at fault for a ceasefire not being reached with Ukraine, he may impose secondary tariffs on Russian oil.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-angry-putin-zelenskyy-iran-sanctions-rcna198729"
  },
  {
    "text": "Trump says he 'couldn't care less' if automakers raise prices due to tariffs, says he believes it will make people buy American-made cars  —  In an interview with NBC News, President Donald Trump also said he would not fire anyone involved in the Signal group chat.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-says-couldnt-care-less-automakers-raise-prices-tariffs-rcna198731"
  },
  {
    "text": "Americans want Trump's focus more on prices, not tariffs; most approve of deportation efforts — CBS News poll  —  After a week that brought tough economic news and polling showing Americans' views of the economy are still sour, most say President Trump has focused too much on tariffs … ",
    "url": "https://www.cbsnews.com/news/opinion-poll-trump-economy-tariffs-deportation-immigration/"
  },
  {
    "text": "Trump says he 'couldn't care less' if auto prices rise because of his tariffs  —  He expressed confidence that the policy would prompt more Americans to buy cars and trucks made in the U.S.  —  Just now  —  President Donald Trump said on Saturday that he “couldn't care less” … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/29/trump-auto-tariffs-prices-rise/"
  },
  {
    "text": "Scoop: White House to take charge of briefing-room seating chart  —  The White House plans to impose its own seating chart for reporters in the briefing room in coming weeks, taking over a function long managed by the reporters themselves through the White House Correspondents' Association.",
    "url": "https://www.axios.com/2025/03/30/white-house-press-briefing-seating-chart"
  },
  {
    "text": "White House ordered firing of L.A. federal prosecutor on ex-Fatburger CEO case, sources say  —  A federal prosecutor in Los Angeles was fired Friday at the behest of the White House, after lawyers for a fast-food executive he was prosecuting pushed officials in Washington to drop all charges against him … ",
    "url": "https://www.latimes.com/california/story/2025-03-29/los-angeles-federal-prosecutor-fired"
  },
  {
    "text": "Over 200 ‘Tesla Takedown’ protests take place throughout US on ‘Global Day of Action’ against Elon Musk's role with DOGE  —  Hundreds of “Tesla Takedown” demonstrations are taking place in the United States, Canada and Europe as activists ramp up their opposition to CEO Elon Musk's efforts … ",
    "url": "https://cnn.com/2025/03/29/business/tesla-takedown-elon-musk-doge/"
  },
  {
    "text": "For God's Sake, Fellow Lawyers, Stand Up to Trump  —  President Trump this month issued an executive order clearly intended to destroy the venerable law firm Perkins Coie, a firm that has zealously represented clients large and small for more than a century.",
    "url": "https://www.nytimes.com/2025/03/30/opinion/perkins-coie-trump.html?unlocked_article_code=1.704.9pYt.a6WWtBIYt52n"
  },
  {
    "text": "Most US Institute of Peace workers get late-night word of their mass firing  —  Most employees at the U.S. Institute of Peace, a congressionally created and funded think tank now taken over by Elon Musk's Department of Government Efficiency, received email notices of their mass firing … ",
    "url": "https://apnews.com/article/us-institute-peace-trump-doge-mass-firing-746aa4fce9ad35fe17e8e22ce29417e3"
  },
  {
    "text": "SCOOP: ICE Revoking Students' Immigration Statuses Without Their or the University's Knowledge  —  In a developing story, it appears the Trump administration is quietly targeting even more students for deportation and doing so in a way that is taking universities and the students themselves completely by surprise.",
    "url": "https://zeteo.com/p/ice-manually-revoking-university-students-residency-status-middle-east"
  },
  {
    "text": "A Competitive Race for Mike Waltz's Seat Rattles Republicans  —  Democrats are hoping to do better in Florida's Sixth District than they did in November, when President Trump won it by 30 points.  —  Frank Curnow, a retired Navy veteran, had a question for the Republican Party volunteers … ",
    "url": "https://www.nytimes.com/2025/03/30/us/politics/a-competitive-race-for-mike-waltzs-seat-rattles-republicans.html"
  },
  {
    "text": "A.O.C. Wants the Democrats to Think Anew  —  It might surprise some people that Representative Alexandria Ocasio-Cortez, American politics' most dynamic progressive icon, wishes Democrats would stop thinking “that the power struggle within the party is between progressives and moderates,” as she told me recently.",
    "url": "https://www.nytimes.com/2025/03/30/opinion/aoc-bernie-sanders-democrats.html?unlocked_article_code=1.704.Bkmd.s7ohS_0MiAfU&smid=url-share"
  },
  {
    "text": "Lankford calls for inspector general to investigate Signalgate  —  The Oklahoma Republican is one of few members of his party publicly calling for further investigation into the national security situation.  —  Sen. James Lankford (R-Okla.) on Sunday said an independent investigation … ",
    "url": "https://www.politico.com/news/2025/03/30/lankford-inspector-general-signalgate-00259657"
  },
  {
    "text": "Trump seeks takeover of elections in a bid for more presidential power  —  Rooted in the president's false claims of election fraud, Trump's executive order is illustrative of governing through dictates rather than legislation.  —  Just now  —  Almost no part of government is immune … ",
    "url": "https://www.washingtonpost.com/politics/2025/03/30/trump-seeks-takeover-elections/"
  },
  {
    "text": "Trump quickly works to consolidate power and muzzle dissenting voices  —  From law firms and universities to the arts and the press, Trump has targeted these independent actors and tried to bend them to his worldview — willingly or not.  —  WASHINGTON — Moving at a rapid-fire clip … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-quickly-works-consolidate-power-muzzle-dissenting-voices-rcna197766"
  },
  {
    "text": "When ‘Make America Healthy Again’ Actually Means the Opposite  —  As part of a ‘painful period’ of cuts, Trump and RFK Jr. plan on dismantling the agency that focuses on substance abuse.  —  ONE OF THE BIGGEST ADVANCES in public health from the last few years is one that you've probably never heard about … ",
    "url": "https://www.thebulwark.com/p/when-make-america-healthy-again-actually-means-opposite-rfk-trump-opioid-overdose-hhs-samhsa-painful"
  },
  {
    "text": "‘Should I Fire Him?’  Inside Trump's Deliberations Over the Fate of Michael Waltz  —  In public, President Trump has defended his national security adviser.  But behind the scenes, he has been casting around for advice.  —  For much of this week, President Trump was consumed by a single question.",
    "url": "https://www.nytimes.com/2025/03/29/us/politics/trump-signal-michael-waltz.html?unlocked_article_code=1.7k4.mPYh.-3zVC5P5UD8M&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "After DOGE Targeted V.A., an Iraq Veteran Faced Uncertainty and Crisis … It had been six days since Joy Marver was locked out of her office at the U.S. Department of Veterans Affairs, five days since she checked herself into a hospital for emergency psychiatric care, and two days since … ",
    "url": "https://www.nytimes.com/2025/03/30/us/doge-iraq-veteran-fired.html"
  },
  {
    "text": "The Trump 2.0 resistance: Alive, but evolved  —  The resistance of 2025 may not be wearing a pink knitted cap — but it's alive in town halls, streets, campuses and car dealerships across the country.  —  The big picture: If the 2017 Women's March heralded a new era of protest, so too … ",
    "url": "https://www.axios.com/2025/03/30/trump-doge-protests-resistance-april-5"
  },
  {
    "text": "They Want More Babies.  Now They Have Friends in the White House. … The American conservative movement has long worked to put the nuclear family at the center of cultural and economic life.  Lately, it has added a twist.  It wants to make those families bigger.",
    "url": "https://www.nytimes.com/2025/03/30/business/economy/birthrate-politics-vance-musk.html"
  }
]