[
  {
    "text": "Live updates Jim Jordan fails to become House speaker on third ballot  —  Rep. Jim Jordan (R-Ohio) failed Friday on a third ballot to be elected House speaker after backing off a plan to empower a temporary speaker.  Jordan, a conservative firebrand and ally of former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2023/10/20/house-speaker-vote-live/"
  },
  {
    "text": "House GOP abandons Jordan for Speaker after secret ballot loss  —  The Republican conference on Friday voted to no longer back House Judiciary Chair Jim Jordan (R-Ohio) as Speaker.  —  The secret ballot vote came hours after Jordan's third failed ballot on the House floor.",
    "url": "https://thehill.com/homenews/house/4264545-house-gop-not-backing-jim-jordan-speaker/"
  },
  {
    "text": "House Speaker Election: Jordan Loses Secret Ballot to Remain G.O.P. Nominee for Speaker  —  The House plunged further into chaos after Republicans voted to drop Representative Jim Jordan as their nominee for the speakership.  Jordan on Friday was unable once again to win over opponents who have denied him this week.",
    "url": "https://www.nytimes.com/live/2023/10/20/us/house-speaker-vote-jim-jordan"
  },
  {
    "text": "Kenneth Chesebro: Pro-Trump lawyer pleads guilty in Georgia election subversion case, implicates Trump in fake elector conspiracy  —  Kenneth Chesebro, an attorney who helped orchestrate the Trump campaign's 2020 fake electors plot, pleaded guilty Friday in the Georgia election subversion case … ",
    "url": "https://www.cnn.com/2023/10/20/politics/kenneth-chesebro-georgia-election-subversion/"
  },
  {
    "text": "Team Trump Never Dreamed Sidney Powell Would Flip on Them  —  She was the ultimate MAGA conspiracy theorist.  Then she got charged with being part of a criminal conspiracy, and her tune started to change  —  Sidney Powell was the wildest of MAGA diehards — someone who swore long past … ",
    "url": "https://www.rollingstone.com/politics/politics-features/team-trump-sidney-powell-flip-rico-fulton-county-1234858576/"
  },
  {
    "text": "Trump aide Walt Nauta dismisses concerns over potential conflicts of interest in classified documents case  —  Fort Pierce, Florida CNN  —  After a mini-saga in the classified documents case against Donald Trump, both of the former president's co-defendants have waived concerns … ",
    "url": "https://www.cnn.com/2023/10/20/politics/classified-documents-nauta-trump/"
  },
  {
    "text": "Trump co-defendant Kenneth Chesebro pleads guilty in Georgia election case  —  Chesebro became the second former Trump lawyer to plead guilty in as many days, following Sidney Powell on Thursday.  —  ATLANTA — Kenneth Chesebro, a former lawyer for Donald Trump's campaign … ",
    "url": "https://www.washingtonpost.com/national-security/2023/10/20/chesebro-guilty-plea-trump-georgia/"
  },
  {
    "text": "Judge fines Donald Trump $5,000 after post maligning court staffer is found on campaign website  —  Former President Donald Trump was fined $5,000 on Friday after a disparaging social media post about a key court staffer in his New York civil fraud case was allowed to linger on his campaign website after the judge ordered it deleted.",
    "url": "https://apnews.com/article/donald-trump-letitia-james-fraud-contempt-new-york-ce593e3ee07d95bb6ec7e2de23f47dc9"
  },
  {
    "text": "Judge Fines Trump, Threatens Prison Time for ‘Blatantly’ Violating Gag Order  —  Trump's New York AG case isn't supposed to be a criminal case, but it may result in Trump getting thrown in jail anyway.  —  The judge overseeing Donald Trump's bank fraud trial threatened to throw the former president in jail … ",
    "url": "https://www.thedailybeast.com/judge-threatens-imprisoning-trump-for-blatantly-violating-gag-order"
  },
  {
    "text": "Supreme Court blocks restrictions on Biden administration efforts to remove contentious social media posts  —  The Biden administration had called a lower court injunction “unprecedented” for restricting officials' ability to raise concerns about problematic social media content on issues like Covid-19.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-blocks-biden-social-media-curbs-rcna105785"
  },
  {
    "text": "Supreme Court says White House can continue requests to tech companies  —  The Supreme Court on Friday temporarily allowed the Biden administration to continue its efforts to get social media companies to remove posts from their platforms that the government says are misleading.",
    "url": "https://www.washingtonpost.com/politics/2023/10/20/supreme-court-tech-companies-social-media-posts/"
  },
  {
    "text": "Supreme Court won't reinstate Missouri gun law as Thomas dissents  —  The Supreme Court declined to reinstate a Missouri law that prevents local police from working with the federal government to enforce certain gun laws.  —  The justices on Friday sided with the Biden administration … ",
    "url": "https://thehill.com/homenews/4250745-supreme-court-missouri-gun-law-2/"
  },
  {
    "text": "NEW: James Comer Finds Direct Payment to Joe Biden From His Family's Influence-Peddling Operation  —  The House Oversight Committee, which is currently investigating the Biden family's influence-peddling scheme, has uncovered a direct payment made to President Joe Biden.",
    "url": "https://redstate.com/bonchie/2023/10/20/new-house-gop-finds-direct-payment-to-joe-biden-from-biden-family-influence-peddling-operation-n2165354"
  },
  {
    "text": "President Biden Gaslights Americans in Oval Office Address on Ukraine, Israel  —  Why did President Joe Biden travel to Israel to meet with  Prime Minister Bibi Netanyahu?  So he could deliver an Oval Office address on Thursday night to beg Americans and a leaderless House of Representatives for more money for Ukraine.",
    "url": "https://pjmedia.com/news-and-politics/victoria-taft/2023/10/19/president-bidens-oval-office-gas-light-chat-on-ukraine-israel-n1736538"
  },
  {
    "text": "Elon Musk's X removes the New York Times' verification badge  —  The unexplained decision removes the only symbol distinguishing the news organization from impostors and comes amid a flood of false information related to the Israel-Gaza war, some of which Musk has personally endorsed.",
    "url": "https://www.washingtonpost.com/technology/2023/10/19/x-twitter-nyt-dispute-musk/"
  },
  {
    "text": "'It's astonishing': GOP ditches Jordan as speaker pick  —  It was an unexpectedly fast end to the Ohio conservative's candidacy to lead the chaos-ridden House GOP.",
    "url": "https://www.politico.com/live-updates/2023/10/20/congress/jordan-loses-00122781"
  },
  {
    "text": "Jack Smith uses Brett Kavanaugh law review article and Trump's own impeachment arguments to slap down Jan. 6 ‘presidential immunity’ claims  —  In a double serving of what could arguably be described as doses of one's own medicine, special counsel Jack Smith plucked apart Donald Trump's latest efforts … ",
    "url": "https://lawandcrime.com/trump/jack-smith-uses-brett-kavanaugh-law-review-article-and-trumps-own-impeachment-arguments-to-slap-down-jan-6-presidential-immunity-claims/"
  },
  {
    "text": "Mastodon Is the Good One  —  Join the newsletter to get the latest updates.  —  Success  —  Great!  Check your inbox and click the link.  —  Error  —  Please enter a valid email address.  —  Earlier this week, friend of 404 Media Katie Notopoulos, who is a great journalist and internet knower … ",
    "url": "https://www.404media.co/mastodon-is-the-good-one/"
  },
  {
    "text": "Chief prosecutor of Jan. 6 rioters describes ‘pervasive’ threats to his office  —  Matthew Graves, the U.S. attorney for the District of Columbia, described the threats in a closed-door interview with the House Judiciary Committee.  —  The federal prosecutors who have brought charges … ",
    "url": "https://www.politico.com/news/2023/10/20/jan-6-prosecutor-pervasive-threats-00122733"
  },
  {
    "text": "US intelligence report alleging Russia election interference shared with 100 countries  —  The United States on Friday released a U.S. intelligence assessment sent to more than 100 countries that found Moscow is using spies, social media and Russian state-run media to erode public faith … ",
    "url": "https://www.reuters.com/world/us/us-intelligence-report-alleging-russia-election-interference-shared-with-100-2023-10-20/"
  },
  {
    "text": "Alex Jones must pay $1.1 billion of Sandy Hook damages despite bankruptcy - court  —  Conspiracy theorist Alex Jones cannot use his personal bankruptcy to escape paying at least $1.1 billion in defamation damages stemming from his repeated lies about the 2012 Sandy Hook elementary school massacre, a U.S. bankruptcy judge ruled Thursday.",
    "url": "https://www.reuters.com/legal/alex-jones-cant-avoid-sandy-hook-verdicts-bankruptcy-judge-2023-10-19/"
  },
  {
    "text": "On Israel, Progressive Jews Feel Abandoned by Their Left-Wing Allies  —  Jewish leaders and voters said they were taken aback to discover that many of their ideological allies saw them as oppressors who deserved blame following the Israel attacks.  —  Progressive Jews who have spent years … ",
    "url": "https://www.nytimes.com/2023/10/20/us/politics/progressive-jews-united-states.html"
  }
]