[
  {
    "text": "Biden commutes most federal death row sentences to life in prison before Trump takes office  —  President Joe Biden announced Monday that he is taking 37 people off federal death row to serve out life sentences behind bars — a decision that leaves only three federal prisoners awaiting execution … ",
    "url": "https://www.cnn.com/2024/12/23/politics/biden-federal-death-row-trump"
  },
  {
    "text": "Biden gives life in prison to 37 of 40 federal death row inmates so Trump can't have them executed  —  President Joe Biden announced on Monday that he is commuting the sentences of 37 of the 40 people on federal death row, converting their punishments to life imprisonment just weeks … ",
    "url": "https://apnews.com/article/biden-death-row-commutations-trump-executions-f67b5e04453cd1aa6383c516bc14f300"
  },
  {
    "text": "Statement from President Joe Biden on Federal Death Row Commutations  —  I've dedicated my career to reducing violent crime and ensuring a fair and effective justice system.  —  Today, I am commuting the sentences of 37 of the 40 individuals on federal death row to life sentences without the possibility of parole.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/23/statement-from-president-joe-biden-on-federal-death-row-commutations/"
  },
  {
    "text": "Biden Commutes 37 Death Sentences Ahead of Trump's Plan to Resume Federal Executions  —  Those affected by the president's action on Monday are still subject to life imprisonment without the possibility of parole.  Three men will remain on federal death row.",
    "url": "https://www.nytimes.com/2024/12/23/us/politics/biden-commutes-37-death-sentences.html"
  },
  {
    "text": "Biden Commutes Sentences of 37 Death Row Inmates  —  ‘In good conscience, I cannot stand back and let a new administration resume executions that I halted,’ president said  —  WASHINGTON—President Biden, citing moral and policy objections to capital punishment, said he was commuting … ",
    "url": "https://www.wsj.com/politics/policy/biden-commutes-sentences-of-37-death-row-inmates-a3d663cf"
  },
  {
    "text": "Matt Gaetz ethics report says his drug use and sex with a minor violated state laws  —  Former Rep. Matt Gaetz, a Florida Republican who briefly stood to become President-elect Donald Trump's nominee to be attorney general, was found by congressional ethics investigators to have paid numerous women … ",
    "url": "https://www.cbsnews.com/news/matt-gaetz-ethics-report-released/"
  },
  {
    "text": "Trump Picks Callista Gingrich for Ambassador to Switzerland  —  In announcing his choice of various envoys, including ambassador to Denmark, the president-elect again floated the idea of the United States acquiring Greenland.  —  President-elect Donald J. Trump said on Sunday that he intended … ",
    "url": "https://www.nytimes.com/2024/12/22/us/politics/trump-callista-gingrich-ambassador-switzerland.html"
  },
  {
    "text": "Trump suggests he wants to buy Greenland … - He made the comments after demanding earlier in the weekend that Panamanian authorities lower fees for U.S. ships to transit the Panama Canal or return its control to the United States. … - “Ken will do a wonderful job in representing the interests of the United States.”",
    "url": "https://www.axios.com/2024/12/23/trump-buying-greenland-us-ownership-plan"
  },
  {
    "text": "Trump's big Mike Johnson decision  —  A messy Capitol Hill endgame has the president-elect pondering a change in House leadership.  —  After the House passed a shutdown-averting spending bill Friday, a very relieved Speaker Mike Johnson proclaimed to reporters that President-elect Donald Trump was “certainly happy about this outcome.”",
    "url": "https://www.politico.com/news/2024/12/23/mike-johnson-speaker-trump-limbo-00195854"
  },
  {
    "text": "GOP congressman says it feels like Elon Musk is ‘our prime minister’  —  Rep. Tony Gonzales, R-Texas, told CBS News on Sunday that he spoke to the tech billionaire multiple times during negotiations for the funding package.  —  Rep. Tony Gonzales, R-Texas, on Sunday compared tech mogul Elon Musk to a … ",
    "url": "https://www.nbcnews.com/politics/congress/gonzales-elon-musk-prime-minister-trump-rcna185165"
  },
  {
    "text": "Trump bristles at Musk's rocketing profile as Democrats play on the president-elect's vanity  —  Whether Elon Musk is the real “president,” merely the “prime minister” or just Donald Trump's multibillionaire enforcer, he's carving out an unprecedented role that could raise conflicts of interest for the new administration.",
    "url": "https://www.cnn.com/2024/12/23/politics/president-musk-trump-analysis/"
  },
  {
    "text": "Congress' age debate reignites over member living in retirement home … - “Since early September, my health challenges have progressed making frequent travel to Washington both difficult and unpredictable.”  — Granger's son Brandon told the Dallas Morning News that she has been “having some dementia issues late in the year.”",
    "url": "https://www.axios.com/2024/12/22/kay-granger-retirement-home-congress-age-debate"
  },
  {
    "text": "Joe Manchin torches Democrats on the way out the door  —  For more on Sen. Joe Manchin of West Virginia, watch CNN's “Inside Politics with Manu Raju” at 8 a.m. ET and 11 a.m. ET.  —  Washington CNN  —  As Joe Manchin prepares to leave Congress after nearly 15 years, the West Virginia senator … ",
    "url": "https://www.cnn.com/2024/12/22/politics/joe-manchin-congress-democratic-party/"
  },
  {
    "text": "Trump picks billionaire financier for deputy defense secretary  —  The choice of Stephen Feinberg of Cerberus Capital Management comes as Pete Hegseth continues to face questions in the confirmation process for the top Pentagon post.",
    "url": "https://www.washingtonpost.com/politics/2024/12/22/trump-defense-department-stephen-feinberg/"
  },
  {
    "text": "AOC Shuts Down Pregnancy Rumors After Being Approached by GOP Colleague  —  NO BABY ON BOARD  —  Rep. Alexandria Ocasio-Cortez is clearing up the pregnancy rumors after a Republican member asked her whether she was expecting on the House floor this week.  In an Instagram story video … ",
    "url": "https://www.thedailybeast.com/aoc-shuts-down-pregnancy-rumors-after-being-approached-by-gop-colleague/"
  },
  {
    "text": "FACT SHEET: President Biden Takes Action to Protect American Workers and Businesses from China's Unfair Trade Practices in the Semiconductor Sector  —  A resilient and secure supply of foundational semiconductors is critical to U.S. national and economic security.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/23/fact-sheet-president-biden-takes-action-to-protect-american-workers-and-businesses-from-chinas-unfair-trade-practices-in-the-semiconductor-sector/"
  },
  {
    "text": "New research shows the massive hole Dems are in  —  Even voters who previously backed Democrats cast the party as weak and overly focused on diversity and elites.  —  Democrats conducting post-mortems on their sweeping losses in 2024 are finding more reason for alarm.",
    "url": "https://www.politico.com/news/2024/12/22/democrats-2024-election-problem-focus-group-00195806"
  }
]