[
  {
    "text": "Henry Kissinger, who shaped world affairs under two presidents, dies at 100  —  The diplomat exercised an unparalleled control over U.S. international affairs and policymaking.  He was also the target of relentless critics, who deemed him unprincipled and amoral.",
    "url": "https://www.washingtonpost.com/obituaries/2023/11/29/henry-kissinger-dead-obituary/"
  },
  {
    "text": "Henry Kissinger Is Dead at 100; Shaped Nation's Cold War History  —  The most powerful secretary of state of the postwar era, he was both celebrated and reviled.  His complicated legacy still resonates in relations with China, Russia and the Middle East.  —  Henry A. Kissinger … ",
    "url": "https://www.nytimes.com/2023/11/29/us/henry-kissinger-dead.html"
  },
  {
    "text": "Henry Kissinger, America's Most Notorious War Criminal, Dies At 100  —  The titan of American foreign policy was complicit in millions of deaths — and never showed remorse for his decisions.  —  Henry Kissinger — who as a top American foreign policy official oversaw … ",
    "url": "https://www.huffpost.com/entry/henry-kissinger-dies_n_6376933ae4b0afce046cb44f"
  },
  {
    "text": "Dr. Henry Kissinger Dies at Age 100  —  Dr. Henry Kissinger, a respected American scholar and statesman, died today at his home in Connecticut.  —  Henry Kissinger was born in southern Germany in 1923, where his father was a teacher.  His family fled Nazi Germany and came to America in 1938.",
    "url": "https://www.prnewswire.com/news-releases/dr-henry-kissinger-dies-at-age-100-302001393.html"
  },
  {
    "text": "Henry Kissinger's bombing campaign likely killed hundreds of thousands of Cambodians − and set path for the ravages of the Khmer Rouge  —  Henry Kissinger, who died on Nov. 29, 2023 at the age of 100, stood as a colossus of U.S. foreign policy.  His influence on American politics lasted long beyond … ",
    "url": "https://theconversation.com/henry-kissingers-bombing-campaign-likely-killed-hundreds-of-thousands-of-cambodians-and-set-path-for-the-ravages-of-the-khmer-rouge-209353"
  },
  {
    "text": "Speaker Johnson singed by a blast of conservative fury  —  The right's ire toward the Louisiana Republican isn't universal.  But it's growing: One member called him a “joke,” and another deemed his performance “plummeting.”  —  Speaker Mike Johnson is edging closer to the same sort of clash … ",
    "url": "https://www.politico.com/news/2023/11/29/speaker-johnson-singed-by-a-blast-of-conservative-fury-00129180"
  },
  {
    "text": "GOP speculation mounts that McCarthy will exit Congress early … - “I have another week or so to decide because if I decide to run again, I have to know in my heart I'm giving 110%,” McCarthy said at The New York Times DealBook Summit on Wednesday, referring to California's Dec. 8 filing deadline.",
    "url": "https://www.axios.com/2023/11/30/kevin-mccarthy-speaker-might-leave-congress-gop"
  },
  {
    "text": "Attorney warned Trump 'it's going to be a crime' if he didn't comply with subpoena for classified docs: Sources  —  Trump attorney Jennifer Little spoke with federal investigators, sources said.  —  This image contained in a court filing by the Department of Justice on Aug. 30, 2022 … ",
    "url": "https://abcnews.go.com/US/attorney-warned-trump-crime-comply-subpoena-classified-docs/story?id=105228569"
  },
  {
    "text": "Trump Caught Moving Money Around to Pay Massive Tax Bill  —  Trump wasn't supposed to be moving significant amounts of money around without notifying a court-appointed auditor.  He just got caught paying himself so he could pay his taxes. … A court-ordered financial auditor … ",
    "url": "https://www.thedailybeast.com/trump-caught-moving-money-around-to-pay-massive-tax-bill"
  },
  {
    "text": "Top Ramaswamy aide leaves to join Trump campaign  —  A top aide to Republican presidential candidate Vivek Ramaswamy is joining former President Donald Trump's campaign, three sources familiar with the move tell CNN.  —  Brian Swensen formally resigned from his role as national political director … ",
    "url": "https://www.cnn.com/2023/11/29/politics/vivek-ramaswamy-aide-trump-campaign/"
  },
  {
    "text": "Court filing reveals Rep. Scott Perry's vast web of contacts in bid to reverse 2020 election  —  A federal appeals court on Wednesday released previously secret text messages from Perry — only to remove them from the public docket later in the day.  —  At 11:08 p.m. on Dec. 30, 2020 … ",
    "url": "https://www.politico.com/news/2023/11/29/scott-perry-texts-unsealed-00129195"
  },
  {
    "text": "Here's how much more you need to spend to maintain your living standard  —  The typical American household must spend an additional $11,434 annually just to maintain the same standard of living they enjoyed in January of 2021, right before inflation soared to 40-year highs, according to a recent analysis of government data.",
    "url": "https://www.cbsnews.com/news/inflation-households-need-extra-11400-these-states-its-even-higher/"
  },
  {
    "text": "EPA proposes rule to tighten lead pipeline standards  —  The Environmental Protection Agency proposed a new rule Thursday aimed at strengthening its existing lead and copper pipe standards as part of the administration's goal of lowering unsafe pollution levels and protecting vulnerable people from exposure to harmful drinking water.",
    "url": "https://www.washingtonexaminer.com/policy/energy-environment/epa-proposes-rule-to-tighten-lead-pipeline-standards"
  },
  {
    "text": "Scoop: Biden warned Bibi Israel can't operate in southern Gaza the way it did in north  —  President Biden told Israeli Prime Minister Benjamin Netanyahu last Sunday that he is concerned about a possible Israeli military operation in southern Gaza after the current pause in fighting ends, two U.S. officials told Axios.",
    "url": "https://www.axios.com/2023/11/29/biden-netanyahu-gaza-israel-military-palestinian-civilians"
  },
  {
    "text": "Trump unleashes grievances, warnings in wild 24 hours on Truth Social  —  Former President Trump has spent the last 24 hours on Truth Social unleashing a torrent of grievances, vengeful promises and links to online conspiracy theories about his political rivals.",
    "url": "https://www.axios.com/2023/11/29/trump-truth-social-posts"
  },
  {
    "text": "Bank official flagged Hunter Biden Chinese payments as ‘unusual,’ Comer says  —  A bank investigator raised concerns internally in 2018 about payments Hunter Biden received, saying the activity on his accounts appeared “unusual,” according to House Oversight Committee Chairman James Comer (R-KY).",
    "url": "https://www.washingtonexaminer.com/news/house/bank-official-hunter-biden-chinese-payments-comer"
  },
  {
    "text": "Scoop: No Labels abandons its in-person presidential convention … - Canceling its Dallas convention will give No Labels more flexibility — and more time — to make that determination.  — It will also allow more candidates to potentially emerge and challenge the status quo.",
    "url": "https://www.axios.com/2023/11/30/no-labels-presidential-convention-event-virtual"
  },
  {
    "text": "Fox Co-Hosts Call Out Jesse Watters After Remarks on Women, Cars  —  Watters also claimed that only “liberal, suburban house husbands” are in the market for electric vehicles.  —  Jesse Watters was called out Wednesday by his female colleagues during a discussion on electric vehicles … ",
    "url": "https://www.thedailybeast.com/fox-co-hosts-call-out-jesse-watters-after-remarks-on-women-cars"
  },
  {
    "text": "James Comer Seems to Forget He Said Hunter Biden Could ‘Choose’ Public Hearing  —  While Comer rejected Hunter Biden's offer to publicly testify, last month he declared it Biden's choice to testify in public or private.  —  House Oversight Committee Chairman James Comer (R-KY) … ",
    "url": "https://www.thedailybeast.com/james-comer-seems-to-forget-he-said-hunter-biden-could-choose-public-hearing"
  },
  {
    "text": "Trump will hold a closed-door fundraiser during the next Republican debate  —  It will be the first time he won't hold a public-facing counterprogramming event during one of the debates.  —  Former President Trump will host a closed-door fundraiser in Florida during the next week's Republican … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-will-hold-fundraiser-republican-debate-rcna127322"
  },
  {
    "text": "Leo Varadkar's Ireland is flirting with a new form of totalitarianism  —  Now the whole world can see that Ireland is poised to pass one of the most draconian pieces of legislation in modern times  —  Irish author Paul Lynch won the Booker Prize on Sunday.",
    "url": "https://www.telegraph.co.uk/news/2023/11/28/leo-varadkars-ireland-is-flirting-with-a-new-form-of-totali/"
  },
  {
    "text": "Trump tries to embrace Black Lives Matter, a group he previously said ‘hates our country’  —  Former president Donald Trump on Wednesday touted the support he has received from a Black Lives Matter activist, inaccurately claiming that he's receiving broader support from the group … ",
    "url": "https://www.washingtonpost.com/politics/2023/11/29/trump-blm-endorsement-dispute/"
  },
  {
    "text": "Mike Johnson to Keynote Far-Right Christian Nationalist Gala  —  The new Speaker will speak to the National Association of Christian Lawmakers — a group dedicated to giving a right-wing “biblical worldview” the force of law  —  IF ANYONE WAS trusting that Mike Johnson would cool … ",
    "url": "https://www.rollingstone.com/politics/politics-news/mike-johnson-keynote-far-right-christian-nationalist-gala-1234905433/"
  },
  {
    "text": "Arizona officials charged with allegedly conspiring to delay midterm election outcome  —  PHOENIX — Two Republican members of a county election board in southern Arizona were indicted by a state grand jury this week for allegedly flouting last year's deadline to formally accept the results of the November 2022 midterm election.",
    "url": "https://www.washingtonpost.com/politics/2023/11/29/cochise-county-arizona-midterm-election-criminal-charges/"
  }
]