[
  {
    "text": "Trump wants 25th Amendment changed to impeach vice presidents  —  He has repeatedly accused Kamala Harris and Democrats of hiding the state of Biden's health.  —  Donald Trump on Saturday floated changing the 25th Amendment to allow Congress to impeach a vice president for covering … ",
    "url": "https://www.politico.com/news/2024/09/07/trump-25th-amendment-kamala-harris-biden-00177868"
  },
  {
    "text": "Former President George W. Bush has no plans to endorse in the election  —  “President Bush retired from presidential politics years ago,” his office said in a statement to NBC News.  —  Former President George W. Bush does not plan to endorse a candidate for president, his office told NBC News on Saturday.",
    "url": "https://www.nbcnews.com/politics/2024-election/former-president-george-w-bush-no-plans-endorse-2024-election-rcna170055"
  },
  {
    "text": "Trump's allies fear he'll blow the debate — his best chance to regain ground against Harris  —  The challenge is getting the former president to stick to the script.  —  Tuesday's debate may be former President Donald Trump's best chance to regain his footing in the presidential race.",
    "url": "https://www.politico.com/news/2024/09/07/trump-allies-debate-fears-00177809"
  },
  {
    "text": "Nate Silver faces backlash for pro-Trump model skewing  —  X users say the FiveThirtyEight founder made some dubious data choices to boost Trump  —  Nate Silver, the celebrity statistician who gained notoriety for his FiveThirtyEight election models, is facing backlash over alleged skewing in his new model.",
    "url": "https://www.salon.com/2024/09/06/nate-silver-faces-backlash-for-pro-model-skewing/"
  },
  {
    "text": "Never-Before-Seen Details About Matt Gaetz's Alleged Sex Scandal May Soon Be Public — Thanks to a Friend  —  One of Matt Gaetz's friends sued a number of people in the alleged sex scandal, generating a number of juicy depositions.  Now those depositions could become public.  — Copy",
    "url": "https://www.notus.org/congress/never-before-seen-details-about-matt-gaetzs-alleged-sex-scandal-may-soon-be-public-thanks-to-a-friend"
  },
  {
    "text": "Trump threatens lawyers, donors and election officials with prison for ‘unscrupulous behavior’  —  Trump and his allies filed dozens of unsuccessful cases after the 2020 election in an attempt to overturn the results.  —  Former President Donald Trump, who makes frequent false claims … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-warns-prison-sentences-people-cheated-2024-rcna170088"
  },
  {
    "text": "Trump Claims Harris's Rallies Are Smaller.  We Counted.  —  Kalina Borkiewicz, Malika Khurana, Karthik Patanjali and Bedel Saget  —  The sizable support Vice President Kamala Harris has generated at her rallies has rattled former President Donald J. Trump, who has emphasized, and frequently exaggerated, his crowd sizes for years.",
    "url": "https://www.nytimes.com/interactive/2024/09/07/us/politics/harris-trump-rally-crowds-size.html"
  },
  {
    "text": "Ukraine's Kursk offensive has triggered doubts among Russian elite, spy chiefs say  —  CIA director Bill Burns and MI6 chief Richard Moore made first joint public appearance onstage at the FTWeekend festival in London  —  Watch the FT Weekend festival session here.",
    "url": "https://www.ft.com/content/56d16869-f9e1-4c82-8022-5f8d2044c5cd"
  },
  {
    "text": "Trump's rambling answer to a child care question, deconstructed  —  A version of this story appeared in CNN's What Matters newsletter.  To get it in your inbox, sign up for free here.  —  CNN  —  Former President Donald Trump and his running mate JD Vance were both asked essentially … ",
    "url": "https://www.cnn.com/2024/09/06/politics/child-care-trump-what-matters"
  },
  {
    "text": "North Carolina Lt. Gov. Mark Robinson says he wants abortion to be illegal at ‘zero’ weeks, in new audio released by Democrats  —  Robinson, who is running for governor as a Republican, has publicly backed the current ban in the state, which restricts abortion after 12 weeks.",
    "url": "https://www.nbcnews.com/politics/2024-election/north-carolina-lt-gov-mark-robinson-says-wants-abortion-illegal-zero-w-rcna170076"
  },
  {
    "text": "One of the things that came to light on Wednesday, in the paperwork the Justice Department unveiled to explain its seizure of 32 internet domains being used by Russian agents in foreign malign influence campaigns, was that the six right-wing U.S. influencers mentioned in the indictments … ",
    "url": "https://heathercoxrichardson.substack.com/p/september-6-2024"
  },
  {
    "text": "Heritage Foundation Spreads Deceptive Videos About Noncitizen Voters  —  The right-wing think tank has been pushing misinformation about voting into social media feeds.  The Georgia secretary of state's office called one video “a stunt.”  —  In July, two men went door to door … ",
    "url": "https://www.nytimes.com/2024/09/07/us/politics/heritage-foundation-2024-campaign-immigration.html?unlocked_article_code=1.I04.2-fB.WZKCR06mN41E&smid=url-share"
  },
  {
    "text": "Former President George W. Bush will not make formal election endorsement, office says  —  Dick Cheney, his vice president, announced Friday he's voting for Harris.  —  Former President George W. Bush doesn't plan to make an endorsement or voice how he or his wife Laura will vote in November, his office told ABC News Saturday.",
    "url": "https://abcnews.go.com/Politics/former-president-george-bush-make-formal-election-endorsement/story?id=113488609"
  },
  {
    "text": "Elon Musk is intrigued by the idea women can't think freely because of ‘low T’  —  Every time it seems he can't possibly sink any lower, the billionaire CEO grabs a shovel and starts digging  —  Maybe he's born with it, maybe it's ketamine  —  Every time I think Elon Musk can't possibly sink any lower … ",
    "url": "https://www.theguardian.com/commentisfree/article/2024/sep/07/elon-musk-women-testosterone"
  },
  {
    "text": "The unprecedented grand coalition  —  As Nicolle Wallace exclaimed on her show Friday, Liz Cheney and Dick Cheney, Alexandria Ocasio-Cortez and Bernie Sanders have all gathered together around a cause.  That cause is democracy and its standard bearer is Kamala Harris.",
    "url": "https://buzzmachine.com/2024/09/06/the-unprecedented-grand-coalition/"
  }
]