[
  {
    "text": "How Donald Trump's DOJ gave Biden a major assist in the coming impeachment probe  —  The department's 2020 opinion around Trump's impeachment trial could place some serious constraints on House Republicans now.  —  Joe Biden has a literal Trump card to play against the House's new impeachment inquiry.",
    "url": "https://www.politico.com/news/2023/09/12/trump-doj-assist-biden-impeachment-probe-00115393"
  },
  {
    "text": "President Biden should not run again in 2024  —  Joe Biden launched his candidacy for president in 2019 with the words “we are in the battle for the soul of this nation.”  He was right.  And though it wasn't obvious at first to many Democrats, he was the best person to wage that fight.",
    "url": "https://www.washingtonpost.com/opinions/2023/09/12/biden-trump-election-step-aside/"
  },
  {
    "text": "Trump privately discussed Biden impeachment with House GOPers  —  The former president talked with House GOP Conference Chair Elise Stefanik on Tuesday.  —  Donald Trump has been weighing in behind the scenes in support of the House GOP push to impeach President Joe Biden … ",
    "url": "https://www.politico.com/news/2023/09/12/trump-privately-discussed-biden-impeachment-with-house-gopers-00115357"
  },
  {
    "text": "Playbook: What we know about the Biden impeachment push  —  Presented by With help from Eli Okun and Garrett Ross  —  DRIVING THE DAY  —  THE NEW BROMANCE — “North Korea's Kim vows full support for Russia's ‘sacred fight’ after viewing launchpads with Putin,” by AP's Kim Tong-Hyung and Dasha Litvinova … ",
    "url": "https://www.politico.com/newsletters/playbook/2023/09/13/what-we-know-about-the-biden-impeachment-push-00115509"
  },
  {
    "text": "Assessing the allegations that triggered McCarthy's impeachment inquiry  —  On Tuesday morning, House Speaker Kevin McCarthy (R-Calif.) announced that he was authorizing an impeachment inquiry into President Biden.  —  In making the announcement, he delineated six predicates for taking the historic step.",
    "url": "https://www.washingtonpost.com/politics/2023/09/12/mccarthy-flawed-allegations-biden-impeachment/"
  },
  {
    "text": "GOP lawyer with ties to three Trump rivals enters 14th Amendment fray  —  The attorney represents a private individual, not any of the campaigns, as he explores whether Trump should be ruled ineligible to run for president  —  A Republican election lawyer with ties to three … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/12/trump-gop-lawyer-14th-amendment/"
  },
  {
    "text": "Judge rejects Trump's request to move Colorado ballot case to federal court  —  A lawsuit brought by a group of Colorado voters cited the Constitution's 14th Amendment in their effort to prevent Trump from getting on the state ballot in 2024.  —  A judge on Tuesday denied former President … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-rejects-trump-request-move-colorado-ballot-case-federal-court-rcna104758"
  },
  {
    "text": "Fox Sued by New York City Pension Funds Over Election Falsehoods  —  The funds accuse the Fox Corporation board of neglecting its responsibility to shareholders by leaving the company open to defamation lawsuits.  —  New York City's pension funds sued the Fox Corporation and its board on Tuesday … ",
    "url": "https://www.nytimes.com/2023/09/12/business/media/fox-shareholder-lawsuit.html"
  },
  {
    "text": "Lauren Boebert escorted out of “Beetlejuice” musical in Denver after “causing a disturbance”  —  Boebert campaign manager says congresswoman was just “enthusiastically” enjoying Sunday's show  —  U.S. Rep. Lauren Boebert was escorted out of a Sunday night performance of the “Beetlejuice” … ",
    "url": "https://www.denverpost.com/2023/09/12/lauren-boebert-removed-beetlejuice-musical-denver/"
  },
  {
    "text": "Child poverty is a choice  —  In 2022, the child poverty rate spiked to 12.4%, a dramatic increase of 7.2 percentage points from the previous year, according to data released Tuesday by the U.S. Census Bureau.  The increase in child poverty resulted in 5.28 million additional children living in poverty.",
    "url": "https://popular.info/p/child-poverty-is-a-choice"
  },
  {
    "text": "North Korea's Kim vows full support for Russia's ‘just fight’ after viewing launchpads with Putin  —  North Korean leader Kim Jong Un arrived at a cosmodrome in Russia's Far East on Wednesday for a meeting with Russian President Vladimir Putin that underscores how the two leaders' interests … ",
    "url": "https://apnews.com/article/north-korea-russia-kim-putin-missile-0d70f5190df1088ebe53e8ca19f8e9c9"
  },
  {
    "text": "Up to $135B in unemployment aid stolen during pandemic: watchdog  —  The U.S. Government Accountability Office (GAO) estimated that the amount of unemployment insurance (UI) fraud during the pandemic is likely between $100 billion and $135 billion, according to a report released Tuesday.",
    "url": "https://thehill.com/homenews/administration/4200337-up-to-135b-in-unemployment-aid-stolen-during-pandemic-watchdog/"
  },
  {
    "text": "Popular nasal decongestant doesn't actually relieve congestion, FDA advisers say  —  The leading decongestant used by millions of Americans looking for relief from a stuffy nose is likely no better than a dummy pill, according to government experts who reviewed the latest research on the long-questioned drug ingredient.",
    "url": "https://apnews.com/article/sudafed-decongestants-phenylephrine-pseudoephedrine-fda-0f140bafae9a500c5fba05fe764ecb66"
  },
  {
    "text": "Senior FBI agent disputes some whistleblowers' claims about Hunter Biden probe  —  Thomas Sobocinski, who manages the FBI team investigating Hunter Biden, was interviewed by the House Judiciary Committee  —  The FBI agent overseeing the investigation into Hunter Biden disputed whistleblower claims … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/12/hunter-biden-fbi-transcript-weiss-sobocinski/"
  },
  {
    "text": "The unconstitutional plan to stop women from traveling out of state for an abortion, explained  —  The age of travel bans is now upon us.  —  More than a year ago, anti-abortion activists appeared eager to prohibit anyone seeking an abortion in a state where it is banned from traveling to another state where it is legal.",
    "url": "https://www.vox.com/23868962/texas-abortion-travel-ban-unconstitutional"
  },
  {
    "text": "Drug kingpin El Chapo's wife Emma Coronel set to be released, say US authorities  —  Emma Coronel, the wife of imprisoned Mexican drug lord Joaquin “El Chapo” Guzman, will be freed in Los Angeles on Wednesday following her arrest in 2021 on drug trafficking charges, according to the U.S. Bureau of Prisons.",
    "url": "https://www.reuters.com/world/americas/drug-kingpin-el-chapos-wife-emma-coronel-set-be-released-say-us-authorities-2023-09-12/"
  },
  {
    "text": "Everyone should get a COVID booster this fall, CDC says  —  Not everyone is at the same risk, but advisors called for simplicity and equity.  —  The Centers for Disease Control and Prevention on Tuesday recommended that everyone ages six months and older get an updated COVID-19 vaccine booster shot this fall or winter.",
    "url": "https://arstechnica.com/health/2023/09/everyone-should-get-a-covid-booster-this-fall-cdc-says/"
  },
  {
    "text": "Newsom announces climate-focused trip to China  —  “You better believe I coordinated with the White House,” he said.  —  SACRAMENTO, Calif. — Gov. Gavin Newsom (D) will go to China next month to meet with officials on climate change, he said Tuesday.  —  “The imperative of maintaining … ",
    "url": "https://www.politico.com/news/2023/09/12/newsom-climate-trip-to-china-00115495"
  },
  {
    "text": "Trump and his cronies underestimated Fani Willis  —  Fulton County District Attorney Fani T. Willis has been the target of right-wing venom and legal second-guessing.  I was among those who doubted the wisdom of bringing a complex racketeering charge in Georgia, which complicated her opposition … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/12/fani-willis-underestimated/"
  }
]