[
  {
    "text": "Kamala Harris for President  —  The Vice-President has displayed the basic values and political skills that would enable her to help end, once and for all, a poisonous era defined by Donald Trump.  —  At the 1940 Republican National Convention, in Philadelphia, an uneasy affair marked by bomb scares … ",
    "url": "https://www.newyorker.com/magazine/2024/10/07/kamala-harris-for-president-endorsement?currentPage=all"
  },
  {
    "text": "Top Republicans disavow Trump's ‘mentally disabled’ attacks on Harris  —  Lindsey Graham pushes back on ex-president's remarks as Minnesota's Emmer says ‘we should stick on the issues’  —  Senior Republicans distanced themselves Sunday from comments made by Donald Trump at campaign stops … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/29/trump-republicans-mentally-disabled-comments-harris"
  },
  {
    "text": "‘Trump Is a Scab’: Harris Campaign Fumes Over Trump's Wild Anti-Overtime Rant  —  'I WOULDN'T PAY'  —  The former president admitted he “shouldn't say this” at a rally in Pennsylvania—just minutes before the Harris campaign highlighted the comments.  —  Former president Donald Trump openly admitted … ",
    "url": "https://www.thedailybeast.com/trump-is-a-scab-harris-campaign-fumes-over-trumps-wild-anti-overtime-rant"
  },
  {
    "text": "I help oversee federal elections.  Mike Johnson's words threaten our democracy.  —  It is disturbingly clear that the Republican Party is setting the stage to once again attempt to overturn a lawful American election.  —  It is disturbingly clear that the Republican Party … ",
    "url": "https://www.msnbc.com/opinion/msnbc-opinion/mike-johnson-election-denialism-congress-2024-results-rcna172657"
  },
  {
    "text": "Republicans lay legal groundwork for election challenges  —  In Arizona, one of seven competitive U.S. states that are expected to decide the 2024 presidential election, an advocacy group founded by Donald Trump adviser Stephen Miller is advancing a bold legal theory: that judges can throw … ",
    "url": "https://www.reuters.com/world/us/legal-blitz-republicans-lay-groundwork-us-election-challenges-2024-09-29/"
  },
  {
    "text": "Trump preps catalog of “cheating” claims for potential election loss … - Overseas voting: Trump falsely claimed Monday that Democrats are exploiting an overseas ballot program for expats and military members in order to circumvent “any citizenship check or verification of identity.”",
    "url": "https://www.axios.com/2024/09/29/trump-voter-fraud-2024-election"
  },
  {
    "text": "Kris Kristofferson, Country Music Legend and ‘A Star Is Born’ Leading Man, Dies at 88  —  Kris Kristofferson, who attained success as both a groundbreaking country music singer-songwriter and a Hollywood film and TV star, died Saturday at home in Maui, Hawaii.",
    "url": "https://variety.com/2024/film/obituaries-people-news/kris-kristofferson-dead-country-music-legend-actor-1236159472/"
  },
  {
    "text": "Trump says ‘violent day’ of policing will end crime  —  The remarks at a campaign rally Sunday did not amount to a policy proposal allowing police retaliation, the former president's campaign said.  —  Former President Donald Trump on Sunday called for “one real rough, nasty” and “violent day” … ",
    "url": "https://www.politico.com/news/2024/09/29/trump-violent-day-policing-crime-00181619"
  },
  {
    "text": "Trump Suggests Terrifying Solution To Ending Crime: The Purge  —  His dangerous solution came on the heels of him repeating the false, fearmongering claim that crime is skyrocketing.  —  LOADING  —  At a rally on Sunday in Erie, Pennsylvania, Trump casually seemed to suggest that one day of violence would put an end to crime.",
    "url": "https://www.huffpost.com/entry/donald-trump-solution-crime-the-purge_n_66f9b7c8e4b019aae3aa34a3"
  },
  {
    "text": "Kamala Harris may be the first Democratic presidential nominee to win seniors since Al Gore  —  We've heard a lot about the groups of voters that Kamala Harris seems to be struggling with — or at least not doing as well as Joe Biden did with them four years ago.",
    "url": "https://www.cnn.com/2024/09/29/politics/kamala-harris-senior-voters-election-analysis/"
  },
  {
    "text": "Rasmussen Found To Be Secretly Colluding With Trump Campaign  —  There's a reason why 538 doesn't use Rasmussen in their polling aggregates anymore, and this is just more evidence why: they can't be trusted.  Meanwhile, conservative sites like Real Clear Politics rely heavily on Rasmussen … ",
    "url": "https://crooksandliars.com/2024/09/rasmussen-found-be-secretly-colluding"
  },
  {
    "text": "Emmer: Vance to hold Walz ‘accountable’ during Tuesday's VP debate  —  House Majority Whip Tom Emmer (R-Minn.) said Sunday he expects Sen. JD Vance (R-Ohio), the GOP nominee for vice president, to hold his opponent, Minnesota Gov. Tim Walz (D), accountable on the debate stage on Tuesday.",
    "url": "https://thehill.com/homenews/campaign/4906299-tom-emmer-jd-vance-hold-tim-walz-accountable-vp-debate/"
  },
  {
    "text": "Kamala Harris Raises $55 Million in California Fundraisers  — Events in San Francisco, Los Angeles pad advantage over Trump  — Vice president urges celebrity attendees to activate networks  —  Kamala Harris raised about $55 million in high-dollar events in California this weekend … ",
    "url": "https://www.bloomberg.com/news/articles/2024-09-30/kamala-harris-raises-55-million-in-san-francisco-la-fundraisers"
  },
  {
    "text": "The 128 paths to the White House  —  From the Sun Belt to the Rust Belt, which maps are most likely?  —  ∙ Paid  —  Let's try something a little different today: basically, a two-for-one.  First, I'll give you what's essentially a full newsletter with some big-picture thoughts … ",
    "url": "https://www.natesilver.net/p/the-128-paths-to-the-white-house"
  },
  {
    "text": "Scoop: Rep. Elissa Slotkin warns Harris is “underwater” in Michigan … - FiveThirtyEight's average of polls has Harris up by about 2.4 points in Michigan. … - Michigan is also a top pickup opportunity for Senate Republicans, with millions of dollars now flooding the race between Slotkin and former Rep. Mike Rogers (R-Mich.).",
    "url": "https://www.axios.com/2024/09/29/michigan-senate-race-slotkin-harris"
  },
  {
    "text": "California's Gavin Newsom Vetoes Controversial AI Safety Bill  —  Governor seeks more encompassing rules than the bill opposed by OpenAI, Meta and supported by research scientists  —  California Gov. Gavin Newsom has vetoed a controversial artificial-intelligence safety bill that pitted … ",
    "url": "https://www.wsj.com/tech/ai/californias-gavin-newsom-vetoes-controversial-ai-safety-bill-d526f621?st=dPWfzZ&reflink=article_copyURL_share"
  },
  {
    "text": "We need a 21st Century Homesteading Act to help Americans displaced by climate change  —  As always, thank you for subscribing and amplifying Civic Texts, which will not be sustainable without you.  Many thanks to everyone who has supported my work, particularly folks who have subscribed to memberships since our soft launch in April.",
    "url": "https://civic-texts.ghost.io/we-need-a-21st-century-homesteading-act-to-help-americans-displaced-by-climate-change/"
  },
  {
    "text": "If Kamala Harris Keeps Wonking, She Will Lose  —  Fight, Don't Wonk  —  Let me preface the following with a clear notice that I am in favor of political wonkery.  We need policy wonks, we need leaders who either understand the wonky details of how to get things done or surround themselves … ",
    "url": "https://www.oliverexplains.com/p/if-kamala-harris-keeps-wonking-she"
  },
  {
    "text": "SCROLL TO CONTINUE  —  The table was set.  The pastries arranged.  A white tablecloth dangled placidly in the early morning mist, surrounded by 12 golden-hued high-backed chairs.  —  Five decades ago, a dozen friends gathered here, on the National Mall, for breakfast.",
    "url": "https://www.washingtonpost.com/dc-md-va/interactive/2024/national-mall-breakfast-1974-photo-recreation/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3NTgyNDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4OTY0Nzk5LCJpYXQiOjE3Mjc1ODI0MDAsImp0aSI6IjE1NGZiZWZjLWE4MzMtNGZjYy1iNzYwLWQ4NzAxN2Y4YWQwYyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9kYy1tZC12YS9pbnRlcmFjdGl2ZS8yMDI0L25hdGlvbmFsLW1hbGwtYnJlYWtmYXN0LTE5NzQtcGhvdG8tcmVjcmVhdGlvbi8ifQ.3jEvx739y3H1ME9IQH_sD4Gon-a2Qy-rzGPYX1tuzII&itid=gfta"
  }
]