[
  {
    "text": "Trump faces a revolt from his MAGA base over the Epstein files  —  The Epstein files — and calls for Attorney General Pam Bondi to be fired — dominated a conservative conference in Tampa this weekend.  —  TAMPA, Fla. — On the weekend President Donald Trump decided to pick his biggest political fight … ",
    "url": "https://www.nbcnews.com/politics/trump-administration/trump-faces-revolt-maga-base-epstein-files-rcna218385"
  },
  {
    "text": "Trump Pleads With Followers to Back Bondi in Dispute Over Epstein Inquiry  —  In a long social media post, President Trump praised Attorney General Pam Bondi and told his followers to “not waste Time and Energy” on the Jeffrey Epstein case.  —  President Trump on Saturday threw a political lifeline … ",
    "url": "https://www.nytimes.com/2025/07/12/us/politics/trump-bondi-epstein-bongino.html?unlocked_article_code=1.WE8.RFDy.jjKymSGwUuDS&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Bondi fires 20 Justice Dept. employees involved in Trump prosecutions  —  Those fired from the department include two prosecutors who worked under former special counsel Jack Smith.  —  Summary11  —  Attorney General Pam Bondi this week fired multiple Justice Department employees … ",
    "url": "https://www.washingtonpost.com/national-security/2025/07/12/bondi-trump-justice-fbi-firings/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzUyMjkyODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUzNjc1MTk5LCJpYXQiOjE3NTIyOTI4MDAsImp0aSI6ImUzZDc5NzZiLWQ5MDgtNDhhZi1hN2FjLTg1Y2FmODIxNzA4MiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA3LzEyL2JvbmRpLXRydW1wLWp1c3RpY2UtZmJpLWZpcmluZ3MvIn0.QW72Q4SJjYN9womUA9EMC2AcGS2k26-qp1JYMEVvxbw&itid=gfta"
  },
  {
    "text": "ICE memo outlines plan to deport migrants to countries where they are not citizens  —  The dramatic shift in policy could result in thousands of people being sent to places where they lack family ties or even a common language.  —  Federal immigration officers may deport immigrants … ",
    "url": "https://www.washingtonpost.com/immigration/2025/07/12/immigrants-deportations-trump-ice-memo/"
  },
  {
    "text": "ICE Set to Vastly Expand Its Reach With New Funds … Thousands of new deportation agents deployed into American cities.  A doubling of detention space to hold tens of thousands of immigrants before they are expelled.  Miles of new border wall, along with surveillance towers equipped with artificial intelligence.",
    "url": "https://www.nytimes.com/2025/07/12/us/politics/ice-expansion-concerns.html"
  },
  {
    "text": "GOP warning sign in new poll: Trump's voters don't love his tariffs … The survey is a warning sign for Republicans, given how much the president has focused on trade and the promises he's made to bring industries back to the U.S. Trump has also reignited global trade tensions in recent days … ",
    "url": "https://www.politico.com/news/2025/07/12/donald-trump-trade-poll-00449708"
  },
  {
    "text": "Trump threatens to strip Rosie O'Donnell of U.S. citizenship.  —  President Trump said he was weighing using the power of the government against one of his longtime entertainment world nemeses, the comedian and actress Rosie O'Donnell, threatening to revoke her citizenship.",
    "url": "https://www.nytimes.com/2025/07/12/us/politics/trump-rosie-odonnell-citizenship.html"
  },
  {
    "text": "Grok Chatbot Mirrored X Users' ‘Extremist Views’ in Antisemitic Posts, xAI Says  —  Elon Musk's artificial intelligence company said its Grok chatbot had also undergone a code update that caused it to share antisemitic messages this week.  —  Elon Musk's artificial intelligence company … ",
    "url": "https://www.nytimes.com/2025/07/12/technology/x-ai-grok-antisemitism.html"
  },
  {
    "text": "xAI issues lengthy apology for violent and antisemitic Grok social media posts  —  Elon Musk's artificial intelligence company xAI issued a lengthy apology Saturday for a series of violent and antisemitic posts from its Grok chatbot this week, blaming a system update.",
    "url": "https://cnn.com/2025/07/12/tech/xai-apology-antisemitic-grok-social-media-posts"
  },
  {
    "text": "Charges dropped against Utah doctor accused of throwing away $28,000 in COVID vaccine doses  —  The federal government on Saturday dismissed charges against a Utah plastic surgeon accused of throwing away COVID-19 vaccines, giving children saline shots instead of the vaccine and selling faked vaccination cards.",
    "url": "https://apnews.com/article/utah-doctor-covid-fraud-charges-dropped-41927573624f0e8e2ee08822633ca5de"
  },
  {
    "text": "California farmworker dies after chaotic federal immigration raid, family says  —  Jaime Alanis Garcia died days after falling some 30 feet during a chaotic raid on Glass House Farms in Camarillo, California, according to his family.  —  A cannabis farmworker who was critically injured during … ",
    "url": "https://www.nbcnews.com/news/us-news/california-farmworker-dies-immigration-raid-rcna218467"
  },
  {
    "text": "Trump Patience on Tariffs Runs Thin as Nations Jostle for Deals  —  US trading partners trying to navigate the final weeks of negotiations before President Donald Trump's so-called reciprocal tariffs hit are facing a leader who has made clear he's lost patience with talks.",
    "url": "https://www.bloomberg.com/news/articles/2025-07-12/trump-patience-on-tariffs-runs-thin-as-nations-jostle-for-deals"
  },
  {
    "text": "How the Tragedy at Camp Mystic Unfolded, Cabin by Cabin  —  Amid chaos from the flood, campers huddled with young counselors—many unaware of the devastation just yards away  —  Amelia Moore, 14, had been awakened about an hour earlier by a clap of thunder so near that it shook her cabin at Camp Mystic.",
    "url": "https://www.wsj.com/articles/camp-mystic-texas-flood-what-happened-9dbde882?st=LW2fd9&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Protesters clash with conservatives at Turning Point's Student Action Summit in Tampa Bay  —  Protesters rejecting Trump's agenda, chanted, ‘No fear, no hate, no ICE in our state,’ outside Turning Point USA Student Action Summit  —  Protesters lined the streets outside Turning Point USA's … ",
    "url": "https://www.foxnews.com/politics/protesters-clash-conservatives-turning-points-student-action-summit-tampa-bay"
  },
  {
    "text": "Lawmakers visit ‘Alligator Alcatraz’ after being blocked  —  Democratic lawmakers condemned Florida's new Everglades immigration detention center after visiting Saturday, describing it as crowded, unsanitary and bug-infested.  Republicans on the same tour said they saw nothing of the sort … ",
    "url": "https://apnews.com/article/alligator-alcatraz-immigration-detainees-florida-dd1cd271b864a72e6fed1f95d62ee8f7"
  },
  {
    "text": "‘Egregious.’ Brazen.' ‘Lawless.’ How 48 Judges Describe Trump's Actions, in Their Own Words  —  Dozens of judges, appointed by presidents of both parties, have stood up to the administration's lawlessness.  —  By THE EDITORIAL BOARD  —  GUEST ESSAY",
    "url": "https://www.nytimes.com/interactive/2025/07/12/opinion/editorials/federal-judges-quotes-trump-administration.html?unlocked_article_code=1.V08.A1qs.Bu0IZMlwJ46a&smid=url-share"
  }
]