[
  {
    "text": "Democrats question whether Biden should agree to debate Trump  —  Democratic lawmakers are leery about the prospect of President Biden debating former President Trump, fearing that putting the two on stage together would only elevate the likely GOP nominee.  —  Trump has skipped every … ",
    "url": "https://thehill.com/homenews/senate/4392333-democrats-question-whether-biden-should-agree-to-debate-trump/"
  },
  {
    "text": "Biden campaign raises $1M online in 24 hours after Jan. 6 speech  —  President Biden's reelection campaign raised more than $1 million through online fundraising alone in the 24 hours after the president's Jan. 6 anniversary speech, according to numbers exclusively provided to The Hill.",
    "url": "https://thehill.com/homenews/campaign/4394598-biden-campaign-raises-1m-online-in-24-hours-after-jan-6-speech/"
  },
  {
    "text": "Trump Says He Will Attend Presidential Immunity Hearing  —  The hearing is scheduled for Tuesday, Jan. 9  —  Former President Donald Trump early Monday morning announced he will atend his presidential immunity hearing in D.C. in person on Tuesday.  —  “Of course I was entitled … ",
    "url": "https://themessenger.com/politics/trump-says-he-will-attend-presidential-immunity-hearing"
  },
  {
    "text": "Biden won't accept an Austin resignation if offered  —  The president is not considering sacking his defense secretary, officials say.  —  President Joe Biden is not considering firing Defense Secretary Lloyd Austin after he did not tell the White House about his emergency hospitalization … ",
    "url": "https://www.politico.com/news/2024/01/08/biden-austin-resignation-00134280"
  },
  {
    "text": "Newsflash: America Actually Doesn't Need a Defense Secretary  —  Lloyd Austin was in the hospital for days; apparently, nobody knew.  He was in intensive care and is still hospitalized.  He was unable to perform his duties for much of that time, suggesting he was drugged or unconscious.",
    "url": "https://hotair.com/david-strom/2024/01/08/newsflash-america-actually-doesnt-need-a-defense-secretary-n603466"
  },
  {
    "text": "Trump Is Connecting With a Different Type of Evangelical Voter  —  They are not just the churchgoing, conservative activists who once dominated the G.O.P.  —  Karen Johnson went to her Lutheran church so regularly as a child that she won a perfect attendance award.  As an adult, she taught Sunday school.",
    "url": "https://www.nytimes.com/2024/01/08/us/politics/donald-trump-evangelicals-iowa.html"
  },
  {
    "text": "Rightwing Billionaires & Trump Want a Nation Where Everything is For Sale  —  Donald Trump and his fellow rightwing billionaires have a plan for America.  They want to turn the United States from a prosperous, middle-class nation into a country of paupers, where bribery is common and the wealthy can get away with anything.",
    "url": "https://hartmannreport.com/p/rightwing-billionaires-and-trump-77b"
  },
  {
    "text": "Hoping to govern in 2024, House Republicans fear a repeat of last year  —  2023 was marked by threats of a government shutdown, a speaker's ouster and a messy fight to replace him.  Now House Republicans are trying to make the case that they deserve to stay in charge.",
    "url": "https://www.washingtonpost.com/politics/2024/01/08/house-republicans-agenda-fragile-majority/"
  },
  {
    "text": "Trump urges Georgia judge to dismiss election interference case over presidential immunity  —  Former President Trump urged a Georgia judge to dismiss the election interference case against him there Monday, arguing he was acting in his role as president and is therefore immune from criminal prosecution.",
    "url": "https://thehill.com/regulation/court-battles/4395175-trump-urges-georgia-judge-to-dismiss-election-interference-case-over-presidential-immunity/"
  },
  {
    "text": "House Republicans release report recommending Hunter Biden be held in contempt of Congress  —  The report comes after the president's son defied a subpoena to testify behind closed doors and offered to testify at a public hearing instead.  —  House Republicans on the Judiciary and Oversight … ",
    "url": "https://www.nbcnews.com/politics/congress/house-republicans-release-report-recommending-hunter-biden-held-contem-rcna132800"
  },
  {
    "text": "To disqualify or not to disqualify: The Supreme Court confronts the ‘laugh test’  —  The reactionary Supreme Court is in a quandary as to how to decide the Trump disqualification case while retaining whatever credibility it has left.  The court just voted to review the Colorado Supreme Court decision, but it really didn't want to.",
    "url": "https://thehill.com/opinion/judiciary/4394601-to-disqualify-or-not-to-disqualify-the-supreme-court-confronts-the-laugh-test/"
  },
  {
    "text": "The changing congressional map is shifting the fight for control of the House  —  With primaries in some states just weeks away, there are still big unresolved questions of what some districts will look like.  —  The partisan tilt of a handful of districts could still change dramatically … ",
    "url": "https://www.politico.com/news/2024/01/08/house-redistricting-2024-elections-00134053"
  },
  {
    "text": "Supreme Court rejects taking up Alaska challenge to EPA's Pebble Mine decision  —  The Supreme Court won't take up a case that would have sought to revive a proposed gold and copper mine that was blocked by the Environmental Protection Agency (EPA) in 2021.  —  The court did not comment on its decision not to take up the case.",
    "url": "https://thehill.com/policy/energy-environment/4395196-supreme-court-rejects-taking-up-alaska-challenge-to-epas-pebble-mine-decision/"
  },
  {
    "text": "The US Is Dealing With an Israeli Leader Who's Losing Control  —  Benjamin Netanyahu is waging a war while struggling to avoid prison, salvage his legacy and keep his political partners happy.  —  Benjamin Netanyahu, whom many Israelis simply call “Bibi,” is Israel's longest-serving prime minister … ",
    "url": "https://www.politico.com/news/magazine/2024/01/08/netanyahu-israeli-leader-losing-control-00134146"
  },
  {
    "text": "Johnson strikes his first bipartisan deal — a $1.7T funding accord  —  Ahead of a government shutdown cliff on Jan. 19, angst among House Republicans could still derail efforts to avert a funding lapse.  —  Congressional leaders have clinched a deal on overall budget totals that could pave … ",
    "url": "https://www.politico.com/news/2024/01/07/congress-spending-deal-shutdown-00134200"
  },
  {
    "text": "Boebert's ex-husband calls police after fight with congresswoman  —  The representative from Colorado denies allegations that she punched her former spouse  —  Police were called to a restaurant in Silt, Colo., on Saturday night after Rep. Lauren Boebert (R-Colo.) and her ex-husband Jayson … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/07/lauren-boebert-ex-husband/"
  }
]