[
  {
    "text": "Trump won't rule out seeking a third term in the White House, tells NBC News ‘there are methods’ for doing so  —  President Donald Trump said in a Sunday-morning phone call that he was “not joking” about a third term, adding that “it is far too early to think about it.”",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-third-term-white-house-methods-rcna198752"
  },
  {
    "text": "Trump's Reciprocal Tariffs Set to Start With All Countries  —  President Donald Trump said he plans to start his reciprocal tariff push with “all countries,” tamping down speculation that he could limit the initial scope of tariffs set to be unveiled April 2.",
    "url": "https://www.bloomberg.com/news/articles/2025-03-31/trump-says-reciprocal-tariffs-set-to-start-with-all-countries"
  },
  {
    "text": "There's One Problem With Trump's Tariffs: They Make Absolutely No Sense  —  My local bookstore has been taking advantage of me for years.  I have run a trade deficit, giving it money with nothing but books in return.  At the same time I have been taking advantage of my employer … ",
    "url": "https://www.nytimes.com/2025/03/31/opinion/trump-tariffs-economy.html"
  },
  {
    "text": "White House Weighs Helping Farmers as Trump Escalates Trade War  —  The Trump administration has discussed providing financial aid for farmers who may be subject to retaliation by America's trading partners.  —  Ahead of President Trump's plan to impose sweeping tariffs across the globe this week … ",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/farmers-bailouts-trump-tariffs.html"
  },
  {
    "text": "Mike Waltz Is Losing Support Inside the White House  —  Although Trump decided not to fire his national security adviser over the Signal group chat, Waltz's position is tenuous, officials say  —  WASHINGTON—President Trump has decided for now not to fire his national security adviser … ",
    "url": "https://www.wsj.com/politics/policy/mike-waltz-is-losing-support-inside-the-white-house-2b17459c?st=taX7tv&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Elon Musk hands out $1 million payments after Wisconsin Supreme Court declines request to stop him  —  Elon Musk gave out $1 million checks on Sunday to two Wisconsin voters, declaring them spokespeople for his political group, ahead of a Wisconsin Supreme Court election that the tech billionaire cast … ",
    "url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-giveaway-cdea66e0dcbaa53dd183e1d10bee2b35"
  },
  {
    "text": "Trump's Latest Bid to Rewrite Reality  —  WHEN I WAS A TEENAGER, I won an award that I didn't understand, named for someone I'd never heard of: the Peter Goldin Memorial Award for Outstanding Achievement in Literature.  —  I still don't know who Peter Goldin was, but I like to think the award must … ",
    "url": "https://www.thebulwark.com/p/trump-latest-bid-to-rewrite-reality-smithsonian-statues-executive-order-history-whitewash"
  },
  {
    "text": "‘Climate of fear’: Montreal doctor says NYU cancelled her presentation  —  A Montreal doctor says her presentation at NYU was abruptly cancelled and believes the university did so out of fear of being pressured by the Donald Trump administration.  Dr. Joanne Liu, the former international president … ",
    "url": "https://www.ctvnews.ca/montreal/article/climate-of-fear-montreal-doctor-says-nyu-cancelled-her-presentation/"
  },
  {
    "text": "FBI raids home of prominent computer scientist who has gone incommunicado … A prominent computer scientist who has spent 20 years publishing academic papers on cryptography, privacy, and cybersecurity has gone incommunicado, had his professor profile, email account, and phone number removed … ",
    "url": "https://arstechnica.com/security/2025/03/computer-scientist-goes-silent-after-fbi-raid-and-purging-from-university-website/"
  },
  {
    "text": "Fire at New Mexico Republican Party Headquarters Being Investigated as Arson  —  Officials confirmed that the headquarters had been damaged in a fire, which the Republican Party called a “deliberate act of arson.”  —  The headquarters of the Republican Party of New Mexico in Albuquerque … ",
    "url": "https://www.nytimes.com/2025/03/30/us/politics/republican-party-new-mexico-fire-arson.html"
  },
  {
    "text": "The Democrats Who Are Fighting—and Winning—Against Trump in Court  —  State attorneys general have brought 11 lawsuits against the president and his administration; strategy carries political risk  —  As Democrats struggle to find their bearings after President Trump's return to the White House … ",
    "url": "https://www.wsj.com/politics/policy/trump-democrats-lawsuits-states-8b765117"
  },
  {
    "text": "Universities Should Challenge Trump's Speech-Based Deportations of Students in Court [Updated]  —  The Trump administration has been detaining and trying to deport immigrant and foreign students for their First-Amendment protected speech.  That includes even speech that does not actually support terrorism … ",
    "url": "https://reason.com/volokh/2025/03/30/universities-should-challenge-trumps-speech-based-deportations-of-students-in-court/"
  },
  {
    "text": "‘Mission South Africa’: How Trump Is Offering White Afrikaners Refugee Status  —  The United States has banned most refugees, including 20,000 people who were already approved for entry before President Trump took office.  But Mr. Trump is making one exception.",
    "url": "https://www.nytimes.com/2025/03/30/us/politics/trump-south-africa-white-afrikaners-refugee.html"
  },
  {
    "text": "I'm a Republican Who Still Supports Ukraine.  America Must Not Give In to Putin.  —  Three years on, the war for Ukraine continues to burn, consuming lives and the wealth of nations.  The diplomatic rupture last month in the Oval Office beamed live around the world ignited a fierce debate … ",
    "url": "https://www.nytimes.com/2025/03/31/opinion/ukraine-putin-trump-republicans.html"
  },
  {
    "text": "Universities Should Not be Afraid of Contentious Ideas  —  Cornell University recently hosted an event that any reputable P.R. firm would surely have advised against.  On a calm campus, in a semester unroiled by protest, we chose to risk stirring the waters by organizing a panel discussion … ",
    "url": "https://www.nytimes.com/2025/03/31/opinion/ideas-universities-controversey-protest.html"
  },
  {
    "text": "Trump calls ‘never ending’ Signal leak story ‘old and boring,’ blasts media  —  President Trump slammed the media for its “never ending” coverage of the Signal group chat leak, calling it “old and boring.”  —  In a post Sunday on Truth Social, Trump praised Sen. Markwayne Mullin (R-Okla.) … ",
    "url": "https://thehill.com/homenews/administration/5222684-trump-calls-never-ending-signal-leak-story-old-and-boring-blasts-media/"
  },
  {
    "text": "American progress in peril  —  The U.S. is freezing research funding, canceling projects, firing thousands of federal scientists and creating an atmosphere of uncertainty that scientists warn could slam the brakes on progress.  —  Why it matters: America has enjoyed decades of dominance … ",
    "url": "https://www.axios.com/2025/03/31/us-science-china-trump"
  },
  {
    "text": "As Trump Squeezes the Immigrant Work Force, Employers Seek Relief  —  Businesses that rely on immigrants are pushing for legislation to ensure an adequate, legal flow of laborers from abroad as deportations ramp up.  —  In recent weeks, managers of the nation's resorts, plant nurseries … ",
    "url": "https://www.nytimes.com/2025/03/31/business/economy/trump-immigrant-workers-visas.html"
  },
  {
    "text": "A Special Election That Was Supposed to Be a Snoozer Is Suddenly Buzzing  —  A House race in a deep-red Florida district is seeing millions of dollars in spending ahead of Tuesday's election.  Even in a loss, Democrats hope it will signal much-needed momentum.",
    "url": "https://www.nytimes.com/2025/03/31/us/politics/florida-special-election-fine-weil.html"
  }
]