[
  {
    "text": "Republicans reel as Dem over-performances hit a swing state and MAGA country  —  Democrats clinched a landslide victory in Wisconsin and made inroads in two deep-red Florida districts, spelling trouble for Republicans.  —  Republicans emerged from Tuesday's elections on shaky footing.",
    "url": "https://www.politico.com/news/2025/04/02/republicans-florida-special-wisconsin-supreme-court-midterms-029963"
  },
  {
    "text": "A Wakeup Call in Wisconsin  —  And a much needed one at that.  —  Democrats have done well in special elections since Donald Trump's inauguration, but until this week we hadn't had any statewide contests to really assess how the administration's radical reshaping of U.S. government was landing with the public.",
    "url": "https://www.thebulwark.com/p/wakeup-call-wisconsin-democrat-supreme-court-booker-crawford-booker-filibuster-musk"
  },
  {
    "text": "Does Higher Turnout Now Help Republicans?  A Data-Driven Analysis of Partisan Turnout Dynamics (Part 1)  —  Data analysis reveals Democrats' problem isn't high turnout—it's losing the mobilization battle  —  A provocative claim has been echoing through Democratic circles since the 2024 election … ",
    "url": "https://data4democracy.substack.com/p/does-higher-turnout-now-help-republicans"
  },
  {
    "text": "Liberal Wins Wisconsin Court Race, Despite Musk's Millions  —  Susan Crawford defeated Brad Schimel for a State Supreme Court seat in a race that shattered spending records and maintained a liberal majority on the court.  —  Susan Crawford, the liberal candidate for a pivotal seat … ",
    "url": "https://www.nytimes.com/2025/04/01/us/politics/wisconsin-supreme-court-crawford-schimel.html"
  },
  {
    "text": "Wisconsin Supreme Court Election Results  —  ‹ See all Wisconsin state results  —  Wisconsin voters will choose a new State Supreme Court justice in an election that will determine whether liberals retain a 4-to-3 majority or whether conservatives take control of the state's judiciary.",
    "url": "https://www.nytimes.com/interactive/2025/04/01/us/elections/results-wisconsin-supreme-court.html"
  },
  {
    "text": "Stop Looking for Methods in the Madness  —  From Apocalypse Now: … Today, according to Trump and co., is Liberation Day — the day Trump will announce big new tariffs on top of the substantial tariffs he's already slapped on steel, aluminum and autos.  —  Nobody knows much about the details … ",
    "url": "https://paulkrugman.substack.com/p/stop-looking-for-methods-in-the-madness"
  },
  {
    "text": "Trump Tariff Plans Still in Limbo Ahead of Rose Garden Event  —  President Donald Trump's deliberations over his plans to impose reciprocal tariffs are coming down to the wire, with his team said to be still finalizing the level and scope of new import taxes he is slated to unveil on Wednesday afternoon.",
    "url": "https://www.bloomberg.com/news/articles/2025-04-01/trump-weighing-tariff-options-as-rose-garden-event-nears"
  },
  {
    "text": "Val Kilmer, Film Star Who Played Batman and Jim Morrison, Dies at 65  —  A wide-ranging leading man who earned critical praise, he was known to be charismatic but unpredictable.  At one point he dropped out of Hollywood for a decade.  —  Val Kilmer, a homegrown Hollywood actor … ",
    "url": "https://www.nytimes.com/2025/04/01/movies/val-kilmer-dead.html?unlocked_article_code=1.8k4.kU71.-KagT79moRR2&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Frank Luntz: Booker marathon speech ‘may have changed the course of political history’  —  Longtime GOP pollster Frank Luntz said Sen. Cory Booker (D-N.J.) “may have changed the course of political history” with his marathon speech breaking the Senate's record for the longest floor speech in its history.",
    "url": "https://thehill.com/homenews/senate/5227463-cory-booker-senate-record/"
  },
  {
    "text": "Costa Rican former President Oscar Arias says US revoked his visa  —  Former Costa Rican President and Nobel Prize winner Oscar Arias said on Tuesday that the U.S. had revoked his visa to enter the country, weeks after he criticized U.S. President Donald Trump on social media saying he was behaving like “a Roman emperor.”",
    "url": "https://www.reuters.com/world/americas/costa-rican-former-president-oscar-arias-says-us-revoked-his-visa-2025-04-01/"
  },
  {
    "text": "Adam Schiff places hold on Ed Martin's nomination to be D.C. U.S. attorney  —  President Trump's controversial choice to be the top federal prosecutor in Washington, D.C., Ed Martin, faces an uncertain future, as a Senate Democrat plans to put an indefinite hold on his nomination.",
    "url": "https://www.cbsnews.com/news/trump-nominee-u-s-attorney-in-d-c-ed-martin-blocked-adam-schiff/"
  },
  {
    "text": "White House studying cost of Greenland takeover, long in Trump's sights  —  It's the most concrete effort yet to turn President Donald Trump's desire to acquire the Danish territory into actionable policy, despite widespread international outrage.  —  Just now",
    "url": "https://www.washingtonpost.com/politics/2025/04/01/trump-greenland-us-territory-cost/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzNDgwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0ODYyMzk5LCJpYXQiOjE3NDM0ODAwMDAsImp0aSI6ImQxYjNkZDNjLWJiMmUtNDQ3OS05NGQ3LWQ2NTc0NmJmMDUyYiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzA0LzAxL3RydW1wLWdyZWVubGFuZC11cy10ZXJyaXRvcnktY29zdC8ifQ.M7TA8wbOhnY6VNyZaznyQhC280Sua5mj0VvQh_NlDZo&itid=gfta"
  },
  {
    "text": "NYC Mayor Eric Adams corruption case dismissed with prejudice, judge rules  —  New York City Mayor Eric Adams' historic federal corruption case has been dropped.  —  Judge Dale Ho has agreed to the U.S. Department of Justice's request to drop the charges against Adams, but he did so “with prejudice.”",
    "url": "https://www.cbsnews.com/newyork/news/nyc-mayor-eric-adams-corruption-case-dropped/"
  },
  {
    "text": "Can I Teach the First Amendment If I Only Have a Green Card?  —  Protections on free speech look weaker than they did when I became a permanent resident.  —  Starting this week, I once again have the privilege of teaching law students about the First Amendment, a subject in which Americans rightly take great pride.",
    "url": "https://www.theatlantic.com/ideas/archive/2025/04/free-speech-deportation-crackdown/682258/"
  },
  {
    "text": "No Tariff Exemptions for American Farmers  —  They voted for the tariffs when they voted for Trump.  —  American farmers are pleading for exemptions from President Donald Trump's tariffs.  Republican members of Congress from farm states are working to deliver the relief farmers want.",
    "url": "https://www.theatlantic.com/politics/archive/2025/04/trump-tariff-carveout-farmers/682260/?gift=RsHHrMN1rwB-IvHsulacfHEv0N5NeSw1_Al5CJeAlow&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Tesla sales plunge: Biggest decline in history  —  Tesla sales plunged 13% in the first three months of this year, as the company reported the largest drop in deliveries in its history by far, amid backlash against CEO Elon Musk ﻿and as growing competition from other automakers' electric vehicles took … ",
    "url": "https://cnn.com/2025/04/02/business/tesla-sales/"
  },
  {
    "text": "US officials object to European push to buy weapons locally  —  U.S. officials have told European allies they want them to keep buying American-made arms, amid recent moves by the European Union to limit U.S. manufacturers' participation in weapons tenders, five sources familiar with the matter told Reuters.",
    "url": "https://www.reuters.com/world/us-officials-object-european-push-buy-weapons-locally-2025-04-02/"
  },
  {
    "text": "Waltz and staff used Gmail for government communications, officials say  —  Trump's national security adviser is trying to manage his way out of a crisis.  But new revelations about his team's operational security are piling up in the inbox.  —  Just now  —  Members of President Donald … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/01/waltz-national-security-council-signal-gmail/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQzNDgwMDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ0ODYyMzk5LCJpYXQiOjE3NDM0ODAwMDAsImp0aSI6ImNjNmE3ZmYzLTViMWYtNDdjZi05YTcwLTJlZTdjY2YxOGE1YSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzAxL3dhbHR6LW5hdGlvbmFsLXNlY3VyaXR5LWNvdW5jaWwtc2lnbmFsLWdtYWlsLyJ9.B_oXWbANc-R7inHV48C9AqkmVIA-41Ip1IVrDyYc60Y&itid=gfta"
  },
  {
    "text": "Supreme Court rules FDA properly rejected fruit-flavored vape liquids  —  Companies sued the Food and Drug Administration, saying the agency unfairly shifted its standards for approving e-cigarette liquids popular with teens.  —  The Supreme Court ruled unanimously Wednesday that the Food … ",
    "url": "https://www.washingtonpost.com/politics/2025/04/02/ecigarettes-vapes-supreme-court-case/"
  },
  {
    "text": "How the Trump administration took aim at Maine  —  Maine has faced investigations and arbitrary reversals of funding, turning it into a test case for the Trump administration's approach to perceived adversaries.",
    "url": "https://www.washingtonpost.com/nation/2025/04/02/maine-governor-trump-transgender/"
  },
  {
    "text": "Tesla (TSLA) announces 336,681 deliveries, far worse than expected  —  Tesla (TSLA) has released its Q1 2025 production and delivery numbers.  The automaker confirmed it delivered 336,681 electric vehicles during the first three months of the year — far below expectations.",
    "url": "https://electrek.co/2025/04/02/tesla-tsla-q1-deliveries-worse/"
  },
  {
    "text": "In a new book, top Biden aide describes ‘out of it’ president before Trump debate  —  Ron Klain tells author Chris Whipple then president could not focus and obsessed about foreign leaders ahead of debate that ended his campaign  —  In a new book, Joe Biden's former White House chief … ",
    "url": "https://www.theguardian.com/books/2025/apr/02/biden-ron-klain-trump-debate-prep-book-chris-whipple"
  },
  {
    "text": "‘We were lied to:’ Two women the Trump administration tried to send to El Salvador prison speak out  —  The women's accounts raise questions about the thoroughness of the administration's vetting of migrants it has sent to the notorious prison.  —  On March 15, the Trump administration loaded … ",
    "url": "https://www.nbcnews.com/politics/national-security/two-women-trump-admin-tried-send-el-salvador-prison-speak-rcna198958"
  },
  {
    "text": "Bice: Elon Musk group removes video from $1M winner after she says she got money to ‘vote’  — Elon Musk's super PAC replaced a video featuring a $1 million giveaway winner who said she got the money, in part, to vote.  — Experts suggest that offering money in exchange for voting … ",
    "url": "https://www.jsonline.com/story/news/politics/elections/2025/04/01/elon-musk-group-removes-video-of-1m-winner-under-bribery-concerns/82766242007/"
  },
  {
    "text": "‘One of the darkest days’: NIH purges agency leadership amid mass layoffs … - Max Kozlov  —  You can also search for this author in  —  PubMed Google Scholar  —  On health economist Jay Bhattacharya's first day as head of the US National Institutes of Health (NIH) … ",
    "url": "https://www.nature.com/articles/d41586-025-01016-z"
  },
  {
    "text": "Tariffs are a terrible policy.  The uncertainty around them is even worse  —  The day this article goes up, April 2, has been pegged by President Donald Trump as “Liberation Day”: the day his suite of tariffs will go into effect and thus, in some unspecified sense, liberate the United States.",
    "url": "https://www.vox.com/future-perfect/406453/trump-tariffs-china-shock"
  },
  {
    "text": "Inside Elite Law Firms, Protests and Quitting After Trump Deals  —  The discontent does not appear to be resonating with leaders at Paul Weiss and Skadden, but it could hamstring their recruitment efforts.  —  Ever since the elite law firms Paul Weiss and Skadden reached deals with President Trump … ",
    "url": "https://www.nytimes.com/2025/04/02/business/trump-law-firms-skadden-paul-weiss.html"
  },
  {
    "text": "Doctor Behind Award-Winning Parkinson's Research Among Scientists Purged From NIH  —  Leading scientists at the National Institutes of Health, the US's leading medical research agency, were swept up Tuesday in the Trump administration's latest firing blitz.  —  Several top scientists charged … ",
    "url": "https://www.wired.com/story/doctor-breakthrough-parkinsons-research-nih-purge/"
  },
  {
    "text": "McMorrow enters Michigan Senate race, citing ‘fear and anger and uncertainty right now’  —  Michigan state Sen. Mallory McMorrow (D) has formally entered the race for U.S. Senate after much speculation, citing the “fear and anger and uncertainty” facing the country as her motivation.",
    "url": "https://thehill.com/homenews/campaign/5227444-mallory-mcmorrow-michigan-senate-race/"
  }
]