[
  {
    "text": "Top House Democrats Throw Chuck Schumer Under The Bus Amid Funding Fight  —  “This false choice that some are buying instead of fighting is unacceptable,” Rep. Nancy Pelosi said as Schumer cast his vote for an extreme GOP spending bill.  —  WASHINGTON - Top House Democrats … ",
    "url": "https://www.huffpost.com/entry/nancy-pelosi-chuck-schumer-hakeem-jeffries-government-shutdown_n_67d473ece4b034e451a5db9f"
  },
  {
    "text": "Senate moves ahead on shutdown votes  —  Democrats agreed to speed up consideration of the bill to allow a vote on Friday in exchange for votes on four amendments.  —  Senate leaders struck a deal on Friday to pave the way for passage of the House GOP's seven-month stopgap spending bill and avoid a government shutdown.",
    "url": "https://www.politico.com/news/2025/03/14/senate-moves-ahead-on-shutdown-votes-00231437"
  },
  {
    "text": "Dem Civil War Erupts With ‘Screaming’ and Primary Threats Behind Closed Doors  —  Democrats are finally fighting amid MAGA 2.0—but it is with each other.  President Donald Trump picked a side in the party's burgeoning civil war Friday, praising his longtime foe, Senate Democratic leader Chuck Schumer … ",
    "url": "https://www.thedailybeast.com/dem-civil-war-erupts-over-government-shutdown-as-aoc-and-chuck-schumer-go-at-it/"
  },
  {
    "text": "Trump Administration Live Updates: Senate Approves Spending Bill to Avert Government Shutdown  —  Where Things Stand  — Shutdown averted: The Senate on Friday narrowly averted a government shutdown at midnight, passing a G.O.P.-written stopgap spending measure.",
    "url": "https://www.nytimes.com/live/2025/03/14/us/trump-government-shutdown-news"
  },
  {
    "text": "Senate passes spending bill to avoid a government shutdown  —  The Senate has approved a short-term spending bill to keep the government open through the end of September.  The measure was approved largely along party lines, but an earlier procedural vote exposed deep divisions among Democrats.",
    "url": "https://www.npr.org/2025/03/14/nx-s1-5328229/senate-spending-bill-vote-government-shutdown"
  },
  {
    "text": "Schumer Under Fire as Pelosi and Other Democrats Criticize Shutdown Retreat  —  Privately, many Senate Democrats conceded that their leader was doing his job by protecting his members from a tough vote and making a politically painful decision.  But the backlash from his party was intense.",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/schumer-trump-government-shutdown.html"
  },
  {
    "text": "The head of Trump's antisemitism task force just re-posted two antisemitic X accounts  —  Leo Terrell, the Department of Justice lawyer who heads the Federal Task Force to Combat Antisemitism, has made multiple appearances on the network and other conservative outlets to unapologetically press … ",
    "url": "https://www.rawstory.com/raw-investigates/leo-terrell/"
  },
  {
    "text": "Trump demands admissions overhaul and control of academic department at Columbia University  —  The Trump administration has delivered an extraordinary ultimatum to Columbia University, threatening to permanently end federal funding to the Ivy League school unless it cedes control … ",
    "url": "https://www.pbs.org/newshour/education/trump-demands-admissions-overhaul-and-control-of-academic-department-at-columbia-university"
  },
  {
    "text": "Trump calls his opponents ‘scum’ and lawbreakers in bellicose speech at Justice Department  —  For more than an hour, he delivered an insult-laden speech that shattered the traditional notion of DOJ independence.  —  President Donald Trump on Friday walked into the Department of Justice … ",
    "url": "https://www.politico.com/news/2025/03/14/trump-doj-speech-prison-opponents-00231438"
  },
  {
    "text": "Trump baselessly accuses news media of ‘illegal’ behavior and corruption in DOJ speech  —  President Donald Trump launched some of his harshest attacks yet on the media on Friday, using a speech at the Department of Justice to baselessly accuse outlets including CNN of illegal and corrupt behavior.",
    "url": "https://www.cnn.com/2025/03/14/media/trump-media-speech/"
  },
  {
    "text": "Trump Expands Attacks on Law Firms, Singling Out Paul, Weiss  —  Experts have warned that the president's efforts threaten the ability of lawyers to do their jobs and private citizens to obtain legal counsel.  —  President Trump on Friday opened a third attack against a private law firm … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/trump-law-firm.html?unlocked_article_code=1.4E4.DSe8.9w4654cpMXpr&smid=nytcore-ios-share&referringSource=articleShare"
  },
  {
    "text": "Marco Rubio Essentially Expels South Africa's U.S. Ambassador  —  The secretary of state lashed out on social media over comments the ambassador reportedly made in Johannesburg that were critical of the Trump administration.  —  As he flew back from the Group of 7 allies meeting in Canada on Friday … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/south-africa-ambassador-marco-rubio.html"
  },
  {
    "text": "Elon Musk Shared, Then Removed a Post Absolving Dictators for Genocide  —  The post falsely claimed that Joseph Stalin, Adolf Hitler and Mao Zedong were not responsible for the murders of millions of people, but rather public sector workers were.  —  Early on Friday, Elon Musk shared … ",
    "url": "https://www.nytimes.com/2025/03/14/technology/elon-musk-x-post-hitler-stalin-mao.html?unlocked_article_code=1.4E4.RW-P.VV-Qk7n8s5HK&smid=bs-share"
  },
  {
    "text": "Draft List for New Travel Ban Proposes Trump Target 43 Countries  —  A draft circulating inside the administration lists three tiers of countries whose citizens may face restrictions on entering the United States.  —  The Trump administration is considering targeting the citizens … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/trump-travel-ban.html"
  },
  {
    "text": "She saw family in Lebanon.  Now this Brown Medicine doctor is being held at Logan for deportation. … A Rhode Island doctor who traveled home to Lebanon to visit family was prevented by U.S. Customs officials from reentering the country on Thursday at Boston's Logan International Airport … ",
    "url": "https://www.providencejournal.com/story/news/local/2025/03/14/brown-medicine-doctor-told-shes-being-deported-after-trip-to-lebanon/82418182007/"
  },
  {
    "text": "The right dominates the online media ecosystem, seeping into sports, comedy, and other supposedly nonpolitical spaces  —  A new Media Matters analysis found 9 out of the 10 top online shows assessed are right-leaning … The 2024 presidential election has been dubbed the “podcast election” … ",
    "url": "https://www.mediamatters.org/google/right-dominates-online-media-ecosystem-seeping-sports-comedy-and-other-supposedly"
  },
  {
    "text": "Boehler withdraws nomination as special presidential envoy for hostages affairs  —  Adam Boehler, who oversaw unprecedented direct negotiations with Hamas on behalf of President Trump, has withdrawn his nomination for the position of special presidential envoy for hostage affairs, according to two White House officials.",
    "url": "https://www.axios.com/2025/03/15/adam-boehler-nomination-special-presidential-envoy-hostages"
  },
  {
    "text": "Kevin Drum, Influential Early Political Blogger, Dies at 66  —  Writing on his own and for Washington Monthly and Mother Jones, he earned a reputation as a serious policy thinker.  He also invented Friday cat blogging.  —  Kevin Drum, who gave up his day job in software marketing to write online … ",
    "url": "https://www.nytimes.com/2025/03/14/us/kevin-drum-dead.html?unlocked_article_code=1.304.ojLS.RMshLU9HeBBO&smid=url-share"
  },
  {
    "text": "US court allows Trump to enforce ban on DEI programs, for now  —  A U.S. appeals court on Friday temporarily paused a judge's ruling that had blocked the administration of President Donald Trump from implementing bans on diversity, equity and inclusion programs at federal agencies and businesses … ",
    "url": "https://www.reuters.com/world/us/us-court-allows-trump-enforce-ban-dei-programs-now-2025-03-14/"
  },
  {
    "text": "Canada reconsidering F-35 purchase amid tensions with Washington, says minister  —  Payment for first 16 aircraft already made  —  Canada is actively looking at potential alternatives to the U.S.-built F-35 stealth fighter and will hold conversations with rival aircraft makers … ",
    "url": "https://www.cbc.ca/news/politics/f35-blair-trump-1.7484477"
  },
  {
    "text": "Under Trump, AI Scientists Are Told to Remove ‘Ideological Bias’ From Powerful Models  —  A directive from the National Institute of Standards and Technology eliminates mention of “AI safety” and “AI fairness.”  —  The National Institute of Standards and Technology (NIST) … ",
    "url": "https://www.wired.com/story/ai-safety-institute-new-directive-america-first/"
  },
  {
    "text": "Crisis is the solution to the public attention problem  —  Liberals should not fear crisis in the Trump era.  They should understand it is their only tool against him.  —  The main paradox of modern American politics is that people are more connected to political news and information than ever before … ",
    "url": "https://stancilculture.substack.com/p/crisis-is-the-solution-to-the-public"
  },
  {
    "text": "Trump's quest to conquer Canada is confusing everyone  —  Canadians and Republicans alike are confounded as President Donald Trump increasingly links a trade war to his push to annex America's northern neighbor.  —  Eight years ago, President Donald Trump spoke about the U.S.-Canada relationship in glowing terms.",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-quest-conquer-canada-confusing-everyone-rcna195657"
  },
  {
    "text": "Trump Admin Nixed Contract Helping Kidnapped Ukrainian Children  —  Even as President Donald Trump and government-demolition czar Elon Musk appear to actively favor Russia's interests amid discussions of how to end the Russia-Ukraine war, Secretary of State Marco Rubio has struck a studiously neutral posture.",
    "url": "https://newrepublic.com/article/192790/trump-kidnapped-ukrainian-kids-nixed-contract"
  },
  {
    "text": "Mace sued for defamation by man she accused of abuse in floor speech  —  The legal action seeks to carve out an exception from the speech or debate clause of the Constitution.  —  Rep. Nancy Mace (R-S.C.) is facing a defamation lawsuit filed by one of the four men she has publicly accused … ",
    "url": "https://www.politico.com/news/2025/03/14/nancy-mace-defamation-lawsuit-025919"
  },
  {
    "text": "Trump moves to close facility that helps track planet-warming pollution  —  The lab is connected to the Mauna Loa Observatory, where scientists gather data to produce the Keeling Curve, a chart on the daily status of atmospheric carbon dioxide concentrations.",
    "url": "https://www.washingtonpost.com/climate-environment/2025/03/14/trump-cancels-greenhouse-gas-laboratory-lease/"
  },
  {
    "text": "A Close Elon Musk Friend Joins His Effort on Social Security  —  The involvement of Antonio Gracias, an investor who has known Elon Musk for two decades, suggests that Mr. Musk has made overhauling the Social Security Administration a priority.  —  A private equity investor … ",
    "url": "https://www.nytimes.com/2025/03/14/us/politics/elon-musk-antonio-gracias-social-security-administration.html?unlocked_article_code=1.304.3qGa.Mvo8u9YKWHD3&smid=nytcore-ios-share&referringSource=articleShare"
  }
]