[
  {
    "text": "US to Israel: Don't do something you'll regret  —  In private calls and public moves, President Joe Biden and his aides are pointing to reasons to look for an off-ramp.  —  The Biden administration's main message for Israel following Iran's aerial assault comes down to this: Stop and think.",
    "url": "https://www.politico.com/news/2024/04/14/us-israel-responding-iran-00152150"
  },
  {
    "text": "Forces intercepted nearly all 300 Iranian drones and missiles, Israel says  —  Iran launched more than 300 drones and missiles toward Israel in its first full-scale military assault against the country.  U.S. military forces in the region helped Israel intercept the strikes, President Biden said.",
    "url": "https://www.washingtonpost.com/world/2024/04/14/israel-iran-attack-war-drones-missiles-news/"
  },
  {
    "text": "American Anti-War Activists Cheer for Iran's War  —  At a left-wing conference in Chicago, activists believe Iran is ‘part of the arc of resistance because the enemies are Israel and the USA.’  —  CHICAGO — About 300 anti-war activists crowded into the basement of the Teamsters Union's headquarters … ",
    "url": "https://www.thefp.com/p/american-anti-war-activists-cheer"
  },
  {
    "text": "Statement from President Joe Biden on Iran's Attacks against the State of Israel  —  Earlier today, Iran—and its proxies operating out of Yemen, Syria and Iraq—launched an unprecedented air attack against military facilities in Israel.  I condemn these attacks in the strongest possible terms.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/13/statement-from-president-joe-biden-on-irans-attacks-against-the-state-of-israel/"
  },
  {
    "text": "Mark Cuban says he's proud to pay $288 million in taxes this year, unlike a certain former president  — Mark Cuban says he'll be paying $288 million in taxes to the IRS.  — “I pay what I owe,” Cuban wrote on X.  — The billionaire says he's “proud to pay my taxes every single year,” unlike one ex-president.",
    "url": "https://www.businessinsider.com/mark-cuban-proud-to-pay-taxes-unlike-certain-ex-president-2024-4"
  },
  {
    "text": "‘The damage is done’: Ruben Gallego says repealing Arizona's near-total abortion ban now would be too little, too late  —  Gallego argued a repeal through the state is just the first step in rectifying what he sees as injustice.  —  PHOENIX — Democratic Rep. Ruben Gallego argued this week … ",
    "url": "https://www.nbcnews.com/politics/2024-election/ruben-gallego-says-repealing-arizonas-total-abortion-ban-now-little-la-rcna147734"
  },
  {
    "text": "Scoop: Teamsters make another move toward GOP … - In the past, the PAC has given overwhelmingly to Democrats, but Hawley has made a point to align himself with the labor movement, joining picket lines with the Teamsters and the United Auto Workers.  — In total, Hawley's … ",
    "url": "https://www.axios.com/2024/04/14/teamsters-donation-josh-hawley-senate-republicans"
  },
  {
    "text": "COULD YOU JUDGE TRUMP IMPARTIALLY?  —  Here is what 12 New Yorkers said.  —  When Donald Trump walks into a Manhattan courtroom on Monday, it will kick off a process unprecedented in American history: jury selection for a former president's criminal trial.",
    "url": "https://www.washingtonpost.com/politics/interactive/2024/jury-trump-new-york-hush-money-trial/"
  },
  {
    "text": "Donald Trump's Rambling Rally Speech Raises Questions  —  Donald Trump's mention of the “beautiful” Battle of Gettysburg during a campaign rally in Schnecksville, Pennsylvania, on Saturday got the former president some attention on social media, with users wondering what his rambling “rant” was about.",
    "url": "https://www.newsweek.com/donald-trump-rambling-rally-speech-raises-questions-1890121"
  },
  {
    "text": "Migration's human toll overwhelms a border county in Texas  —  EAGLE PASS, Tex. — The undertaker lighted a cigarette and held it between his latex-gloved fingers as he stood over the bloated body bag lying in the bed of his battered pickup truck.  —  The woman had been fished out of the Rio Grande minutes earlier.",
    "url": "https://www.washingtonpost.com/nation/interactive/2024/texas-border-eagle-pass-migrant-deaths/"
  },
  {
    "text": "If convicted this year, Trump could lose the right to vote for himself  —  Pundits and analysts have spent much of the past year debating the political impact should Donald Trump be convicted before November's election of any of the 88 felony charges he faces.",
    "url": "https://npr.org/2024/04/14/1240672009/trump-conviction-voting-rights"
  },
  {
    "text": "Small-time investors in Trump's Truth Social reckon with stock collapse  —  Some Trump supporters who invested in his social media company have seen their share values plunge —  Jerry Dean McLain first bet on former president Donald Trump's Truth Social two years ago … ",
    "url": "https://www.washingtonpost.com/technology/2024/04/14/truth-social-investors-faith-trump/"
  },
  {
    "text": "These Mormon women are rejecting Trump, fraying GOP support in a key state  —  GILBERT — It was Annie Lewis' idea to put a “Republicans for Biden” sign in the front yard in the lead-up to 2020.  For her, it came down to civility.  As a teacher for over a decade, the mother of six little ones … ",
    "url": "https://npr.org/2024/04/14/1242051595/trump-arizona-mormon-lds-republican-voters"
  },
  {
    "text": "Trump supporters echo pro-Palestinian ‘genocide Joe’ chant  —  It's unclear what they meant by it, as Trump has pledged similarly strong support for Israel  —  SCHNECKSVILLE, Pa. — “Genocide Joe” is a phrase used by pro-Palestine protesters against President Biden because of his unconditional support … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/14/genocide-israel-gaza-iran-trump-biden/"
  }
]