[
  {
    "text": "Fani Willis can stay on Trump Georgia case, but only if Wade steps aside, judge says  —  ATLANTA — The judge overseeing the Georgia election interference case against former president Donald Trump and his allies ruled that Fulton County District Attorney Fani T. Willis (D) … ",
    "url": "https://www.washingtonpost.com/national-security/2024/03/15/fani-willis-trump-georgia-case/"
  },
  {
    "text": "Fulton County DA Fani Willis case against Trump can continue if she or special prosecutor Wade remove themselves, judge rules  —  Trump co-defendant Michael Roman accused Willis of misconduct for her “clandestine” relationship with Nathan Wade, whom she appointed as special counsel.",
    "url": "https://www.nbcnews.com/politics/donald-trump/fani-willis-trump-georgia-rcna139810"
  },
  {
    "text": "Live Updates: Judge Says Fani Willis Can Stay on Trump Case If Ex-Boyfriend Withdraws  —  The Atlanta district attorney's romantic relationship with the lead prosecutor she hired to oversee the case created an “appearance of impropriety,” the judge said, ruling that the prosecution can't proceed unless he leaves or she steps aside.",
    "url": "https://www.nytimes.com/live/2024/03/15/us/fani-willis-trump-georgia"
  },
  {
    "text": "Judge rules Fulton DA Willis can stay — if Wade steps aside  —  Fulton County District Attorney Fani Willis must either step aside or cut ties with her special prosecutor before the election interference case against Donald Trump can move forward, a judge ruled Friday.",
    "url": "https://www.ajc.com/politics/judge-rules-fulton-da-willis-can-stay-if-wade-steps-aside/3BDOOBKOEBHJBM3X2UOU7QKMXY/"
  },
  {
    "text": "Fulton County DA Fani Willis must step aside or remove special prosecutor in Trump case, judge says  —  ATLANTA (AP) — The judge in the Georgia election interference case against Donald Trump and others said Friday that Fulton County District Attorney Fani Willis must step aside from Trump case … ",
    "url": "https://apnews.com/article/georgia-election-indictment-fani-willis-trump-60b7dd9642fc9ef7c03d75980692334c"
  },
  {
    "text": "I Listened to Trump's Rambling, Unhinged, Vituperative Georgia Rally—and So Should You  —  The ex-President is building a whole new edifice of lies for 2024.  —  I'm sure you had better things to do on Saturday evening than watch Donald Trump rant for nearly two hours to an audience of cheering fans in Rome, Georgia.",
    "url": "https://www.newyorker.com/news/letter-from-bidens-washington/i-listened-to-trumps-rambling-unhinged-vituperative-georgia-rally-and-so-should-you"
  },
  {
    "text": "Biden's team to Speaker Johnson: Your impeachment inquiry is over … - House Republicans have spent the last year and a half on an impeachment probe that appears unlikely to end in charges against President Biden.  — The investigation — launched amid Republicans' allegations … ",
    "url": "https://www.axios.com/2024/03/15/biden-team-johnson-letter-impeachment-over"
  },
  {
    "text": "A majority of House Republicans retreat from their retreat  —  Good morning, Early Birds.  Congrats to NC State for knocking off Duke in the ACC men's basketball tournament.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.",
    "url": "https://www.washingtonpost.com/politics/2024/03/15/majority-house-republicans-retreat-their-retreat/"
  },
  {
    "text": "Powerful Realtor Group Agrees to Slash Commissions to Settle Lawsuits  —  The National Association of Realtors will pay $418 million in damages and will amend several rules that housing experts say will drive down housing costs.  —  American homeowners could see a significant drop in the cost … ",
    "url": "https://www.nytimes.com/2024/03/15/realestate/national-association-realtors-commission-settlement.html"
  },
  {
    "text": "Ginsburg family blasts plan to give RBG Award to Musk, Murdoch, others  —  The family of the late Ruth Bader Ginsburg and some of the Supreme Court justice's former colleagues have denounced this year's slate of honorees for an award that a philanthropic foundation bestows in the name of the liberal icon.",
    "url": "https://www.washingtonpost.com/style/power/2024/03/15/ruth-bader-ginsburg-award-backlash/"
  },
  {
    "text": "And the RBG Award goes to ... Elon Musk and Rupert Murdoch?  —  Four men — plus Martha Stewart — will receive the award named after the late Supreme Court justice, who championed liberal causes and women's rights  —  Since 2020, a foundation has honored prominent women … ",
    "url": "https://www.washingtonpost.com/style/power/2024/03/14/ruth-bader-ginsburg-award-elon-musk-martha-stewart/"
  },
  {
    "text": "Eight Possible Explanations — Many Bad, Some Good — for SDNY's Delay in Turning Over Cohen Files  —  As Adam Klasfeld and others reported yesterday, Trump is asking to delay his New York trial on charges that he engaged in fraud to cover up the hush payments he made to get elected in 2016.",
    "url": "https://www.emptywheel.net/2024/03/15/eight-possible-explanations-many-bad-some-good-for-sdnys-delay/"
  },
  {
    "text": "Schumer discusses ‘long-shot scenario’ with Manchin: Last-ditch Senate run in West Virginia  —  Hear more from Sen. Joe Manchin and the fight for control of the US Senate on “Inside Politics Sunday with Manu Raju” at 8 a.m. ET and 11 a.m. ET.  —  Senate Majority Leader Chuck Schumer recently discussed … ",
    "url": "https://www.cnn.com/2024/03/14/politics/joe-manchin-independent-senate-run/"
  },
  {
    "text": "Red flags raised about FBI's Biden informant as far back as 2016  —  Federal prosecutors were put on notice as far back as 2016 that Alexander Smirnov, the confidential FBI informant whose alleged lies about President Biden's business dealings fueled — and then damaged — a Republican impeachment effort … ",
    "url": "https://www.cbsnews.com/news/alexander-smirnov-fbi-informant-bidens-fraudster-in-prior-case/"
  },
  {
    "text": "The first ship to use a new sea route approaches Gaza with 200 tons of aid  —  A ship carrying 200 tons of aid for Palestinians was seen nearing Gaza on Friday.  The ship set sail for Gaza from Cyprus on Tuesday in a pilot program for the opening of a sea corridor to the territory … ",
    "url": "https://apnews.com/article/israel-hamas-war-news-03-15-2024-d4e2f9ed525914233e4cf16c217f5248"
  },
  {
    "text": "Supreme Court outlines when officials can be sued for blocking people on social media  —  Former President Donald Trump's frequent use of Twitter lurked in the background as the justices weighed whether an official's activities online can constitute government action.",
    "url": "https://www.nbcnews.com/politics/supreme-court/supreme-court-outlines-officials-can-sued-blocking-people-social-media-rcna135128"
  },
  {
    "text": "It's not just our democracy at stake, it's our freedom  —  Political journalists covering the 2024 presidential election are missing the big picture in a big way.  —  Most of them are covering it like a popularity contest or a horse race, which, given the stakes, is utterly inexcusable.",
    "url": "https://presswatchers.org/2024/03/its-not-just-our-democracy-at-stake-its-our-freedom/"
  },
  {
    "text": "Republicans don't actually want you to remember 4 years ago  —  This free edition of PN is made possible by paid subscribers.  If you aren't one already, hit the button and sign up to support our independent journalism.  —  ✍️ Subscribe to Public Notice ✍️",
    "url": "https://www.publicnotice.co/p/are-you-better-off-2024-election-gop-trump"
  },
  {
    "text": "RFK Jr.'s VP pick comes amid a big, difficult ballot access push  —  Independent candidates need to meet a patchwork of state requirements including petition signatures, filing fees — and, in many states, having running mates.  —  Robert F. Kennedy Jr. is set to announce his running mate … ",
    "url": "https://www.nbcnews.com/politics/2024-election/rfk-jrs-vp-pick-comes-big-difficult-ballot-access-push-rcna143321?taid=65f4627929a2b100015e8451"
  },
  {
    "text": "TikTok needs a conservative US buyer  —  The prospect of TikTok needing a U.S. buyer increased this week after the House of Representatives passed a bill that would require the social media app's parent company, ByteDance, to divest from the app or face a ban.",
    "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/2921601/tiktok-needs-conservative-us-buyer/"
  },
  {
    "text": "Bernie Sanders tangles with reporter over question on 32-hour workweek: ‘I can yell as loud as you’  —  Sanders snaps at FOX Business correspondent Hillary Vaughn over a question about his new ‘Thirty-Two Hour Workweek Act’  —  Sen. Bernie Sanders, I-Vt., lashed out at FOX Business correspondent … ",
    "url": "https://www.foxbusiness.com/politics/bernie-sanders-tangles-reporter-question-32-hour-workweek-yell-loud-you"
  }
]