[
  {
    "text": "Colorado Supreme Court justices face a flood of threats after disqualifying Trump from the ballot  —  The latest round of threats fits a familiar pattern: Trump faces a legal setback, and officials face threats.  —  In the 24 hours since the Colorado Supreme Court kicked former President Donald Trump off … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/colorado-justices-face-flood-threats-disqualifying-trump-ballot-rcna130720"
  },
  {
    "text": "Christie defies calls to bow out, leaving anti-Trump movement splintered  —  The former New Jersey governor and his allies argue that someone needs to take the fight to Trump and that he is best equipped for a one-on-one showdown  —  LONDONDERRY, N.H. — Chris Christie arrived … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/21/chris-christie-trump-republican-nomination/"
  },
  {
    "text": "Trump Asks Supreme Court to Put Off Hearing Case on Immunity Claim  —  The former president urged the justices to move slowly in his federal election interference case, an apparent attempt to delay the trial, set for March.  —  Former President Donald J. Trump urged the Supreme Court … ",
    "url": "https://www.nytimes.com/2023/12/20/us/politics/trump-supreme-court-immunity.html"
  },
  {
    "text": "Biden's team weighs how to talk to key voters about Trump  —  Biden aides are looking for a message that criticizes Trump without turning off some voters.  —  WASHINGTON — While President Joe Biden increasingly rallies his base with fiery rhetoric casting Donald Trump as the gravest threat … ",
    "url": "https://www.nbcnews.com/politics/white-house/president-bidens-team-weighs-talk-key-voters-donald-trump-rcna130335"
  },
  {
    "text": "Colorado GOP threatens to withdraw from or ignore state's presidential primary if Trump isn't on the ballot  —  The Colorado GOP is threatening to try to withdraw from Colorado's Republican presidential primary in March — or ignore the results — if Donald Trump isn't on the ballot … ",
    "url": "https://coloradosun.com/2023/12/20/colorado-republican-presidential-primary-withdraw/"
  },
  {
    "text": "Trump Vows to Amp Up the Hitler Talk  —  Trump plans to keep using the “poisoning the blood” line attacking immigrants, sources tell Rolling Stone.  If anything, he thinks he was being “too nice” … In response to the Adolf Hitler comparisons, Trump has privately vowed to further amp … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-says-immigrants-poison-blood-nation-1234934092/"
  },
  {
    "text": "Federal judge blocks California law that would have banned carrying firearms in most public places  —  A federal judge on Wednesday temporarily blocked a California law that would have banned carrying firearms in most public places, ruling that it violates the Second Amendment of the U.S. Constitution … ",
    "url": "https://apnews.com/article/california-gun-laws-concealed-carry-c7ebb8506ed99f41b59455350647c0b6"
  },
  {
    "text": "California law that would ban guns from most public places blocked by federal judge  —  A California law that would ban guns from most public spaces has been blocked by a federal judge.  —  U.S. District Judge Cormac Carney granted a preliminary injunction for plaintiffs, ruling the law violated the Second Amendment.",
    "url": "https://www.washingtonexaminer.com/policy/courts/california-law-ban-guns-public-blocked-judge"
  },
  {
    "text": "Jan. 6 rioter nabbed in Bumble dating app sting pleads guilty to assaulting officers  —  Andrew Taake was turned in by a Bumble user who used the dating app to try to illicit confessions from Donald Trump supporters who took part in the Capitol attack.  —  WASHINGTON — Nearly three years ago … ",
    "url": "https://www.nbcnews.com/politics/justice-department/jan-6-rioter-nabbed-bumble-dating-app-sting-pleads-guilty-assaulting-o-rcna130593"
  },
  {
    "text": "Speaker Mike Johnson and daughter were profiled attending ‘purity ball’ in 2015 German TV news segment  —  The unearthed segment is the latest example of Johnson's deeply held views.  —  A still image from a 2015 German news segment featuring Mike Johnson and his family.",
    "url": "https://abcnews.go.com/US/speaker-mike-johnson-daughter-profiled-attending-purity-ball/story?id=105785626"
  },
  {
    "text": "Scoop: Warner Bros. Discovery in talks to merge with Paramount Global  —  Warner Bros. Discovery CEO David Zaslav met with Paramount Global CEO Bob Bakish on Tuesday in New York City to discuss a possible merger, Axios has learned from multiple sources.",
    "url": "https://www.axios.com/2023/12/20/warner-bros-paramount-merger-discovery-streaming"
  },
  {
    "text": "Lieutenant Governor Eleni Kounalakis Calls for Secretary of State Weber to Explore Legal Options to Remove Former President Donald Trump from California's 2024 Presidential Primary Ballot  —  Contact: Press@ltg.ca.gov, (916) 803-2191  —  SACRAMENTO - Today, Lieutenant Governor Eleni Kounalakis sent … ",
    "url": "https://ltg.ca.gov/2023/12/20/lt-governor-kounalakis-calls-for-secretary-of-state-weber-to-explore-legal-options-to-remove-former-president-donald-trump-from-californias-2024-presidential-primary-ballot/"
  },
  {
    "text": "The NRA Is at Rock Bottom—And 15 Years of Tax Filings Tell the Story  —  Years of NRA tax returns obtained by The Daily Beast show that the gun group's revenue has been falling for years.  And last year was the NRA's weakest fundraising year since 2008. … Pay Dirt is a weekly foray into the pigpen of political funding.",
    "url": "https://www.thedailybeast.com/the-nra-is-at-rock-bottomand-15-years-of-tax-filings-tell-the-story"
  },
  {
    "text": "House Republicans land last-minute Ohio recruit for key House race  —  House Republicans launched a last-minute scramble to recruit state Rep. Derek Merrin.  —  House Republicans may have found a way to salvage their flailing prospects in a crucial swing seat.",
    "url": "https://www.politico.com/news/2023/12/20/derek-merrin-ohio-00132746"
  },
  {
    "text": "Statement from President Joe Biden on Securing the Release of Americans Detained in Venezuela  —  Today, ten Americans who have been detained in Venezuela have been released and are coming home, including all six wrongfully detained Americans.  These individuals have lost far too much precious … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/12/20/statement-from-president-joe-biden-on-securing-the-release-of-americans-detained-in-venezuela/"
  },
  {
    "text": "GOP voter-fraud crackdown overwhelmingly targets minorities, Democrats  —  Black and Hispanic people made up more than 75 percent of defendants and Democrats nearly 60 percent in a controversial push by Republicans to prosecute election cheating, according to a first-of-its-kind analysis by The Washington Post",
    "url": "https://www.washingtonpost.com/dc-md-va/2023/12/20/voter-fraud-prosecutions-2020/"
  }
]