[
  {
    "text": "DNC projects message tying Trump to Hitler on Madison Square Garden during rally  —  The Democratic National Committee is projecting digital messages on Madison Square Garden's exterior during former President Donald Trump's campaign rally on Sunday about recent reports that he once praised Adolf Hitler … ",
    "url": "https://www.cbsnews.com/news/trump-madison-square-garden-rally-dnc-projections/"
  },
  {
    "text": "A Trump Rally Speaker Trashed Puerto Ricans.  Harris Reached Out to Them.  —  Her campaign moved swiftly to highlight that even as a speaker at Donald Trump's rally in New York made offensive remarks about Puerto Rico and Latinos, she was visiting Puerto Rican voters in Philadelphia.",
    "url": "https://www.nytimes.com/2024/10/27/us/politics/kamala-harris-philadelphia-voters.html"
  },
  {
    "text": "Anti-Puerto Rico comments at Trump rally spur outrage as Bad Bunny supports Harris  —  The artist's gesture of support came as a number of speakers at a Trump event in New York made racist and disparaging comments about Puerto Ricans and other Latinos.  —  Bad Bunny, the Puerto Rican recording artist … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/27/harris-bad-bunny-puerto-rico-trump/"
  },
  {
    "text": "As Trump courts their vote, comedian at his rally makes racist jokes about Latinos and Puerto Rico  —  Comedian Tony Hinchcliffe made crude jokes about Latinos having babies and called Puerto Rico a “floating island of garbage.”  —  As former President Donald Trump courts the community's vote … ",
    "url": "https://www.nbcnews.com/politics/2024-election/comedian-trump-rally-makes-racist-jokes-latinos-puerto-rico-rcna177514?taid=671ebeec9303b30001fd3d81"
  },
  {
    "text": "MAGA speakers unleash ugly rhetoric at Trump's MSG rally … - The remarks at Trump's rally undermine his campaign's effort to soften the former president's image among voters who may like his policies but dislike his divisive and race-baiting rhetoric.",
    "url": "https://www.axios.com/2024/10/27/trump-madison-square-garden-rally"
  },
  {
    "text": "Bad Bunny shares Kamala Harris's video on Puerto Rico on Instagram  —  Puerto Rican rapper and superstar Bad Bunny posted a video from Vice President Harris on his Instagram story Sunday.  —  In the video, Harris talks to Puerto Ricans, saying that “this election is not just a choice between Donald Trump … ",
    "url": "https://thehill.com/blogs/in-the-know/4956229-bad-bunny-kamala-harris-video-puerto-rico-instagram/"
  },
  {
    "text": "Trump's New York homecoming sparks backlash over racist and vulgar remarks  —  A pro-Trump comedian's racist diatribe drew widespread condemnation.  —  NEW YORK  —  Donald Trump's rally at Madison Square Garden, billed as a triumphant homecoming, instead turned into a political fiasco … ",
    "url": "https://www.politico.com/news/2024/10/27/trumps-madison-square-garden-racist-00185770"
  },
  {
    "text": "Speaker at Trump rally compares Puerto Rico to ‘island of garbage’  —  A speaker at former President Trump's Madison Square Garden rally on Sunday spent a portion of his time attacking Puerto Rico, drawing backlash from Democrats and the Harris campaign.  —  Comedian Tony Hinchcliffe … ",
    "url": "https://thehill.com/homenews/campaign/4956120-tony-hinchcliffe-kill-tony-trump-rally-puerto-rico/"
  },
  {
    "text": "Donald Trump's Racist NYC Rally Was Vile.  It Was Also Political Suicide  —  FINAL ACT  —  The Madison Square Garden rally, operatic in its repulsive bigotry, will almost certainly alienate more voters who might have voted for Trump.  —  OPINION  —  To all those Republicans … ",
    "url": "https://www.thedailybeast.com/donald-trumps-racist-nyc-rally-was-vile-it-was-also-political-suicide/"
  },
  {
    "text": "Hochul says Trump's Madison Square Garden rally is a ‘white flag of surrender’  —  New York Gov. Kathy Hochul (D) said she thinks the Madison Square Garden rally former President Trump is hosting Sunday is a “white flag of surrender.”  —  “I think he's waving the white flag of surrender,” Hochul said Sunday on MSNBC's “The Weekend.”",
    "url": "https://thehill.com/homenews/campaign/4955966-hochul-trump-madison-square-garden-rally-white-flag-of-surrender/"
  },
  {
    "text": "‘Betrayal’: Marty Baron, former Washington Post editor, slams paper's non-endorsement  —  Jeff Bezos' decision to block the Washington Post's presidential endorsement has been met with a lot of strong reactions - including from the paper's own journalists and its legendary former Executive Editor Marty Baron.",
    "url": "https://www.msnbc.com/ali-velshi/watch/-betrayal-marty-baron-former-washington-post-editor-slams-paper-s-non-endorsement-222795333869"
  },
  {
    "text": "2 new polls show Harris leading Trump as the election nears.  Women continue to propel the VP's candidacy.  — Kamala Harris' strength with female voters is fueling her overall leads in two new national polls.  — A CBS News poll showed Harris up by one point, while an ABC News poll had her ahead by four points.",
    "url": "https://www.businessinsider.com/harris-trump-national-polls-women-gender-gap-election-2024-10"
  },
  {
    "text": "Trump ad depicts country ‘gone to hell’ — during Trump's presidency  —  Donald Trump's two-minute ad that aired during Sunday's Philadelphia Eagles game and said the country had “gone to hell” during the Biden and Harris administration featured an image from a protest during Trump's presidency, not Biden's.",
    "url": "https://www.politico.com/live-updates/2024/10/27/2024-elections-live-coverage-updates-analysis/gone-to-hell-when-00185767"
  },
  {
    "text": "Four Lessons From Nine Years of Being ‘Never Trump’  —  I've been wrong about many things, but here are two of the bigger whiffs of my professional life.  —  I thought Donald Trump wouldn't find any meaningful support in the Republican Party.  I watched his strange campaign announcement … ",
    "url": "https://www.nytimes.com/2024/10/27/opinion/never-trump-maga-evangelicals.html?unlocked_article_code=1.VU4.7iHw.z7LMXQQYw6l9&smid=url-share"
  },
  {
    "text": "Advisers Propose That Trump Give Security Clearances Without F.B.I. Vetting  —  A memo circulating in Donald Trump's orbit says that if elected he should use private firms to check appointees' backgrounds and give them immediate access to classified secrets after taking office.",
    "url": "https://www.nytimes.com/2024/10/27/us/politics/trump-security-clearances-fbi.html?unlocked_article_code=1.VU4.Fs3b.zE89AY4g-3Nz&smid=url-share"
  },
  {
    "text": "Melania Trump stuns Madison Square Garden with her first rally appearance ever to introduce husband Donald  — Elon Musk announced the former first lady, who was not on the list of speakers  — Appearance came as Trump and Harris are running even in the polls",
    "url": "https://www.dailymail.co.uk/news/article-14008881/Melania-Trump-donald-madison-square-garden.html"
  },
  {
    "text": "The Media Started Capitulating to Trump with Russia Russia Russia  —  I took a few days to go wander around Paris.  —  In the meantime (as Nicole and I discussed on Friday), the WaPo has subjugated itself to Donald Trump by spiking an endorsement of Kamala Harris.",
    "url": "https://www.emptywheel.net/2024/10/27/the-media-started-capitulating-to-trump-with-russia-russia-russia/"
  },
  {
    "text": "Pro-Harris Super PAC Raises Concerns About Focusing on Trump and Fascism  —  The group, Future Forward, warned that attacking Donald J. Trump as a fascist or questioning his character or stamina are less effective than highlighting Kamala Harris's proposals.",
    "url": "https://www.nytimes.com/2024/10/27/us/politics/harris-trump-campaign-fascism.html"
  },
  {
    "text": "Donald Trump's Dogwhistles Are Unmistakable  —  When someone attacks the messenger rather than the message, they're usually revealing something.  —  Friday night in Austin, Texas, the Republican presidential nominee, Donald Trump, fiercely criticized The Atlantic's editor in chief … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/trump-attacks-atlantics-jeffrey-goldberg-over-hitler/680422/"
  }
]