[
  {
    "text": "Family of woman found dead on highway angered by Trump's speech  —  GRAND RAPIDS, Mich. (WOOD) — The sister of murder victim Ruby Garcia said she and her family were home watching live, in disbelief, as former President Donald Trump told an audience in Grand Rapids that he had spoken with “some of her family.”",
    "url": "https://www.woodtv.com/news/target-8/family-of-woman-found-dead-on-highway-angered-by-trumps-speech/"
  },
  {
    "text": "Trump said he spoke to murder victim's family.  The victim's sister said it never happened.  —  GRAND RAPIDS, Mich. — Donald Trump used his campaign event in Michigan on Tuesday to denounce what he called “Biden's border bloodbath,” zeroing in on the case of a young woman killed … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/02/trump-ruby-garcia-michigan-murder/"
  },
  {
    "text": "‘Start the Steal’: Trump Once Again Planning to Overturn an Election  —  THERE IS A PLAN AFOOT to overturn the results of the November election, and for both parties it is fast becoming a major concern.  The scheme is being hatched by Republicans on behalf of Donald Trump, who seeks to steal the election if Joe Biden defeats him again.",
    "url": "https://plus.thebulwark.com/p/start-the-steal-trump-november-2024"
  },
  {
    "text": "Ex-Trump Election Lawyer John Eastman Has Lost His Law License  —  John Eastman, the former Donald Trump election lawyer behind the so-called “fake electors” scheme, officially lost his ability to practice law in the state of California on Tuesday.  —  The California State Bar recommended … ",
    "url": "https://www.mediaite.com/politics/just-in-ex-trump-election-lawyer-john-eastman-has-been-disbarred/"
  },
  {
    "text": "Statement from President Joe Biden on the Death of World Central Kitchen Workers in Gaza  —  I am outraged and heartbroken by the deaths of seven humanitarian workers from World Central Kitchen, including one American, in Gaza yesterday.  They were providing food to hungry civilians in the middle of a war.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/02/statement-from-president-joe-biden-on-the-death-of-world-central-kitchen-workers-in-gaza/"
  },
  {
    "text": "Why the strike killing World Central Kitchen workers is different  —  With help from Alex Ward, Paul McLeary, Lara Seligman and Phelim Kine  —  The Israeli airstrike that killed aid workers in Gaza is resonating especially in Washington national security circles for two reasons … ",
    "url": "https://www.politico.com/newsletters/national-security-daily/2024/04/02/why-the-strike-killing-world-central-kitchen-workers-is-different-00150205"
  },
  {
    "text": "Amazon Ditches ‘Just Walk Out’ Checkouts at Its Grocery Stores  —  Amazon Fresh is moving away from a feature of its grocery stores where customers could skip checkout altogether.  —  Amazon is phasing out its checkout-less grocery stores with “Just Walk Out” technology, first reported by The Information Tuesday.",
    "url": "https://gizmodo.com/amazon-reportedly-ditches-just-walk-out-grocery-stores-1851381116"
  },
  {
    "text": "Frustrated Prosecutors Ask Trump Documents Judge to Act on Key Claim  —  The push for a quick decision on one of the former president's most far-fetched claims is an unusual and risky move in a case Judge Aileen Cannon has allowed to become bogged down.  —  In an open display of frustration … ",
    "url": "https://www.nytimes.com/2024/04/03/us/politics/trump-documents-case-judge-cannon.html"
  },
  {
    "text": "House Republicans want to rename Virginia's Dulles Airport after Donald Trump  —  The bill seeks to rename the airport to “Donald J. Trump International Airport.”  —  Washington Dulles International Airport in Dulles, Va., on March 15, 2023.  —  House Republicans have introduced a bill … ",
    "url": "https://abcnews.go.com/Politics/house-republicans-rename-virginias-dulles-airport-after-donald/story?id=108759614"
  },
  {
    "text": "Sources: UT lays off at least 60 employees previously in DEI-related position, closes DCCE  —  A week after state Sen. Brandon Creighton warned Texas university system administrators about the state's expectations for higher education institutions to comply with Senate Bill 17 … ",
    "url": "https://www.statesman.com/story/news/politics/state/2024/04/02/texas-senate-bill-17-anti-dei-ut-fires-four-staff-related-positions-two-sources-confirm/73179902007/"
  },
  {
    "text": "Taylor Swift among 141 new billionaires in ‘amazing year for rich people’  —  Combined assets of $14.2tn are more than the GDP of every country except China and the US  —  There are more billionaires than ever before.  The world has 2,781 people with fortunes exceeding $1bn (£800m) … ",
    "url": "https://www.theguardian.com/business/2024/apr/02/world-gains-141-new-billionaires-in-amazing-year-for-rich-people"
  },
  {
    "text": "REI Fired A Popular Manager For Not Immediately Reporting Union Chatter  —  The incident shows how aggressively the liberal-branded retailer is responding to union organizing — and how low-level managers are caught in the middle.  —  When William Littig showed up for work at his REI store on Feb. 21 … ",
    "url": "https://www.huffpost.com/entry/rei-fired-manager-union-campaign_n_660b0c31e4b007c08f9e7a99"
  },
  {
    "text": "The Supreme Court May Give Us Another 2008 Financial Crisis  —  The United States Supreme Court will soon decide a case that could decimate consumer protections against abusive banking practices — potentially allowing banks to disregard state laws meant to prevent the kind of predatory lending that led to the 2008 financial crisis.",
    "url": "https://www.levernews.com/the-supreme-court-may-give-us-another-2008-financial-crisis/"
  },
  {
    "text": "Mandatory DEI Statements Are Ideological Pledges of Allegiance.  Time to Abandon Them.  —  Council on Academic Freedom at Harvard  —  On a posting for a position as an assistant professor in international and comparative education at the Harvard Graduate School of Education … ",
    "url": "https://www.thecrimson.com/column/council-on-academic-freedom-at-harvard/article/2024/4/2/kennedy-abandon-dei-statements/"
  },
  {
    "text": "Oklahoma official with white nationalist ties is ousted in recall vote  —  Judd Blevins, who marched alongside neo-Nazis in Charlottesville, Virginia, in 2017, lost his fight to remain on Enid's City Council.  —  ENID, Okla. — Voters in Enid decided by a nearly 20-point margin Tuesday … ",
    "url": "https://www.nbcnews.com/news/us-news/oklahoma-judd-blevins-enid-city-council-recall-election-rcna146029"
  },
  {
    "text": "President Biden is now posting into the fediverse  —  POTUS puts the ‘fed’ in ‘fediverse.’  —  The official US president Threads account, currently helmed by President Joe Biden, has begun using Meta's ActivityPub integration, making Biden the first sitting US president to post on the decentralized networking protocol.",
    "url": "https://www.theverge.com/2024/4/2/24119353/joe-biden-threads-mastodon-activitypub-fediverse"
  },
  {
    "text": "Uganda top court declines to block Anti-Homosexuality law but sees rights infringed  —  Uganda's constitutional court on Wednesday declined to nullify or suspend an Anti-Homosexuality law that prescribes the death penalty for certain same-sex acts, but found it inconsistent with certain fundamental rights.",
    "url": "https://www.reuters.com/world/africa/ugandas-constitutional-court-upholds-anti-homosexuality-law-2024-04-03/"
  },
  {
    "text": "Trump wants “Christian visibility day” … - “You know what it's going to be called? … - His supporters — who queued in a half mile long line in hail and freezing temperatures — shouted their approval. … - “We must make America pray again,” said Trump, who encouraged supporters … ",
    "url": "https://www.axios.com/2024/04/03/trump-wants-christian-visibility-day"
  },
  {
    "text": "Tommy Tuberville accuses Dems of being part of ‘a Satanic cult’  —  Republican Sen. Tommy Tuberville of Alabama has now declared, more than once, his belief that Democrats are “a Satanic cult.”  This isn't normal.  —  Sen. Tommy Tuberville recently campaigned for an ally in Utah … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/tommy-tuberville-accuses-dems-part-satanic-cult-rcna146033"
  },
  {
    "text": "Wisconsin becomes latest state to ban private funding of elections  —  The swing state's voters backed a measure to amend the Wisconsin Constitution following a Republican push to prohibit cash infusions of the sort that marked the 2020 vote  —  MADISON, Wis. — Wisconsin voters opted Tuesday … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/02/wisconsin-elections-private-money/"
  },
  {
    "text": "Microsoft faulted for ‘cascade’ of failures in Chinese hack  —  The independent Cyber Safety Review Board's report knocks the tech giant for shoddy cybersecurity practices, lax corporate culture and a deliberate lack of transparency  —  A review board, mandated by President Biden … ",
    "url": "https://www.washingtonpost.com/national-security/2024/04/02/microsoft-cyber-china-hack-report/"
  },
  {
    "text": "House Freedom Caucus chair backs Capitol rioter's bid for Congress … - Good said in a statement he is supporting former West Virginia legislator Derrick Evans, who was sentenced three months in prison for his role in the Jan. 6 attack, over Rep. Carol Miller (R-W.Va.).",
    "url": "https://www.axios.com/2024/04/02/bob-good-derrick-evans-endorsement-congress"
  },
  {
    "text": "Thai Court Accepts Petition to Disband Top Opposition Party  — Court previously ruled Move Forward guilty of charter breach  — Campaign to amend law protecting monarchy riles establishment  —  Thailand's Constitutional Court has accepted a petition to disband the nation's largest opposition party … ",
    "url": "https://www.bloomberg.com/news/articles/2024-04-03/thai-court-accepts-petition-to-disband-largest-opposition-party"
  },
  {
    "text": "Republicans pushing to embrace mail-in voting encounter widespread resistance  —  Trump's repeated attacks on mail-in voting have made it tougher for Republicans who see a desperate need for the GOP to encourage more ways to cast ballots.  —  When Donald Trump held a rally last year in Erie County … ",
    "url": "https://www.nbcnews.com/politics/2024-election/republicans-trump-mail-voting-resistance-rnc-rcna145599"
  }
]