[
  {
    "text": "Trump refers to AG Letitia James as having an “ugly mouth” and “low IQ” in Truth Social rant  —  With the deadline for his civil business-fraud judgment looming, Trump is rich with low blows  —  On Monday, Donald Trump will be called upon to pay the $454 million judgment in his New York fraud case … ",
    "url": "https://www.salon.com/2024/03/22/refers-to-ag-letitia-james-as-having-an-ugly-mouth-and-low-iq-in-truth-social-rant/"
  },
  {
    "text": "Trump stares down first derailment of his campaign-to-courthouse strategy  —  For days, Donald Trump's fury over the requirement to secure hundreds of millions of dollars in bond money by Monday has been bubbling behind the scenes and through a steady stream of social media posts.",
    "url": "https://www.cnn.com/2024/03/23/politics/trump-campaign-courthouse-bond/"
  },
  {
    "text": "Kevin O'Leary slams New York AG's attempts to seize Trump's assets: ‘This is not America’  —  “Shark Tank” host and investor Kevin O'Leary slammed New York Attorney General Letitia James' (D) attempts to seize assets from former President Trump in relation to his recent civil fraud trial Friday.",
    "url": "https://thehill.com/regulation/court-battles/4551425-oleary-slams-ny-ag-attempts-seize-trump-assets-this-is-not-america/"
  },
  {
    "text": "Stormy Daniels' Description of Sex With Trump Is All Too Familiar for Sex Workers  —  “I didn't want it, but I allowed it to happen,” the adult film star says in a new documentary that sheds lights on their fateful encounter. … Many things have been said about Stormy Daniels.",
    "url": "https://www.thedailybeast.com/stormy-daniels-description-of-sex-with-trump-is-all-too-familiar-for-sex-workers"
  },
  {
    "text": "Republicans livid as chaos threatens to cannibalize House majority … - The Republican-led House passed the spending bill just before noon Friday and sent it to the Senate — with more than half the House GOP conference, including many furious hardliners, voting against it.",
    "url": "https://www.axios.com/2024/03/23/house-republicans-chaos-majority-motion-vacate"
  },
  {
    "text": "Two suspects in Moscow attack detained, others flee after car chase, lawmaker says  —  Russia said on Saturday it had arrested all four gunmen suspected of carrying out a shooting massacre in a concert hall near Moscow, and President Vladimir Putin pledged to track down and punish those behind the attack.",
    "url": "https://www.reuters.com/world/europe/two-suspects-moscow-attack-detained-after-car-chase-lawmaker-2024-03-23/"
  },
  {
    "text": "Putin alleges gunmen in Moscow attack were en route for Ukraine  —  .  —  Russian President Vladimir Putin has claimed the gunmen involved in killing 115 people at a Moscow concert were on their way to Ukraine following their attack.  —  Putin responded to the mass shooting Saturday … ",
    "url": "https://www.washingtonexaminer.com/policy/foreign-policy/2935621/putin-alleges-gunmen-in-moscow-attack-were-en-route-for-ukraine/"
  },
  {
    "text": "13-year-old rape victim has baby amid confusion over state's abortion ban  —  Law enforcement used DNA from the baby to apprehend the suspect.  —  At just 13-years-old Ashley became a mother to a little baby boy nicknamed “Peanut.”  —  Regina, a mother of three daughters … ",
    "url": "https://abcnews.go.com/US/13-year-rape-victim-baby-amid-confusion-states/story?id=108351812"
  },
  {
    "text": "What happens when an AG dares to investigate Leonard Leo's network  —  Brian Schwalb's probe followed a complaint that nonprofit groups associated with the judicial activist violated their tax status.  —  Allies of Leonard Leo have mounted a monthslong offensive against the man investigating … ",
    "url": "https://www.politico.com/news/2024/03/23/brian-schwalb-leonard-leo-investigation-00148385"
  },
  {
    "text": "He entered Ohio's Senate GOP race a frontrunner.  He ended it an afterthought.  —  The Ohio Secretary of State took a distant third behind the establishment's pick and a MAGA warrior in the race to face Democratic Sen. Sherrod Brown.  —  SALEM, Ohio — When Donald Trump's team invited Ohio Secretary … ",
    "url": "https://www.politico.com/news/2024/03/23/frank-larose-ohio-gop-00148699"
  },
  {
    "text": "Republicans Who Do Not Regularly Watch Fox Are Less Likely to Back Trump  —  Survey data shows more of them believe he acted criminally.  —  Republicans who get their news from nonconservative mainstream media outlets are less likely to support Donald J. Trump than those who follow conservative outlets.",
    "url": "https://www.nytimes.com/2024/03/23/upshot/fox-republicans-trump.html"
  },
  {
    "text": "This Gen Z Democrat quit his job protecting elections to run against a fake elector  —  24-year-old Ashwin Ramaswami is running for the Georgia state Senate, taking on a Republican who was indicted alongside Donald Trump.  —  Ashwin Ramaswami spent the last three years working … ",
    "url": "https://www.nbcnews.com/politics/2024-election/gen-z-democrat-georgia-fake-elector-state-senate-rcna144294"
  },
  {
    "text": "Justice Department Launches the National Extreme Risk Protection Order Resource Center  —  For Immediate Release  —  The Justice Department launched the National Extreme Risk Protection Order (ERPO) Resource Center (the Center) which  will provide training and technical assistance … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-launches-national-extreme-risk-protection-order-resource-center"
  },
  {
    "text": "NBC News hires former GOP chairwoman Ronna McDaniel  —  Ronna McDaniel, who stepped down as chairwoman of the Republican National Committee this month, will join NBC News as a political analyst, angering media critics because of her work to overturn the results of the 2020 election.",
    "url": "https://www.washingtonpost.com/politics/2024/03/23/nbc-news-ronna-mcdaniel-rnc/"
  }
]