[
  {
    "text": "House Expels George Santos From Congress in Historic Vote  —  Mr. Santos, a New York Republican, is the sixth member of the House to be expelled in the body's history.  “To hell with this place,” he said after his colleagues ousted him.  —  Back  —  TRANSCRIPT  —  House Ousts George Santos From Office in Bipartisan Vote",
    "url": "https://www.nytimes.com/live/2023/12/01/nyregion/george-santos-expulsion-vote"
  },
  {
    "text": "How each House member voted on expelling George Santos from Congress  —  Supports 311 Opposes 114  —  Did not vote 8  —  Present 2  —  One-hundred and five Republicans and 206 Democrats voted to expel George Santos (R-N.Y.) from the House of Representatives on Friday.",
    "url": "https://www.washingtonpost.com/politics/interactive/2023/house-vote-george-santos-expulsion/"
  },
  {
    "text": "George Santos Accused Of Stealing House Member's Personal Credit Card Info  —  GOP Rep. Max Miller of Ohio made the allegation not long before Santos was expelled from Congress.  —  Rep. Max Miller (R-Ohio) accused his now-former GOP colleague George Santos of stealing his and his mother's … ",
    "url": "https://www.huffpost.com/entry/max-miller-george-santos-expelled_n_656a0ee7e4b066e398b77240"
  },
  {
    "text": "House Staffer Swiftly Changes Locks On George Santos' Office  —  The New York Republican was finally expelled from the chamber after a brief and scandalous tenure.  —  LOADING  —  The U.S. House wasted no time after its members voted to remove disgraced Rep. George Santos (R-N.Y.) … ",
    "url": "https://www.huffpost.com/entry/house-staffer-changes-locks-george-santos-office_n_656a369ae4b07b937ff4a3cc"
  },
  {
    "text": "Sparks flew behind the scenes at the Ron DeSantis and Gavin Newsom debate  —  While the candidates said they were happy to keep debating for longer than 90 minutes, an intervention from the California governor's wife put a stop to it.  —  Florida Gov. Ron DeSantis and California Gov. Gavin Newsom … ",
    "url": "https://www.nbcnews.com/politics/2024-election/gavin-newsom-fox-debate-rcna127563"
  },
  {
    "text": "Newsom camp: Hannity, DeSantis cheated.  They dispute the charges.  —  The messy prime-time event outside Atlanta between Gavin Newsom and Ron DeSantis didn't end when the Fox News cameras stopped.  Newsom's team says DeSantis and Fox broke several rules.  —  ALPHARETTA, Georgia — So much for that Newsom-Hannity bromance.",
    "url": "https://www.politico.com/news/2023/12/01/newsom-desanitis-debate-cheating-00129555"
  },
  {
    "text": "Judge denies two of Trump's motions to dismiss his federal election interference case  —  The judge rejected arguments from Trump's lawyers, who cited the First Amendment and presidential immunity in pressing for dismissal of special counsel Jack Smith's case.",
    "url": "https://www.nbcnews.com/politics/donald-trump/judge-denies-two-trumps-motions-dismiss-federal-election-interference-rcna127720"
  },
  {
    "text": "For Immediate Release  —  For Further Information Contact:  —  Retired Associate Justice of the Supreme Court of the United States Sandra Day O'Connor died this morning in Phoenix, Arizona, of complications related to advanced dementia, probably Alzheimer's, and a respiratory illness.",
    "url": "https://www.supremecourt.gov/publicinfo/press/pressreleases/pr_12-01-23"
  },
  {
    "text": "DeSantis Super PAC Suffers Another Big Staff Loss, This Time Its Chairman  —  The departure of Adam Laxalt, a longtime friend of the Florida governor, is the latest shake-up inside Never Back Down as it faces questions over the group's strategy and spending.",
    "url": "https://www.nytimes.com/2023/12/01/us/politics/desantis-super-pac-adam-laxalt.html"
  },
  {
    "text": "Gay Board Member Attacked by Zieglers Slams Their Hypocrisy Amid Sex Scandal  —  Bridget Ziegler refused to act when her openly gay colleague was labeled a groomer despite the Moms for Liberty co-founder allegedly engaging in her own same-sex relationship.  —  A lesser person than Tom Edwards … ",
    "url": "https://www.thedailybeast.com/bridget-ziegler-attacked-tom-edwards-for-being-gay-despite-alleged-threesome-with-christian-ziegler"
  },
  {
    "text": "911 Call and Affidavit Reveal Chilling Claims in Florida GOP Chair Rape Probe  —  The woman told investigators he showed up at her home after she had cancelled plans with him.  —  The woman who accused Florida GOP chairman Christian Ziegler—husband of Moms for Liberty co-founder Bridget Ziegler … ",
    "url": "https://www.thedailybeast.com/911-call-released-in-florida-gop-chair-christian-ziegler-rape-probe"
  },
  {
    "text": "Florida appeals court reverses ruling on DeSantis's congressional maps  —  A state appeals court in Florida reaffirmed Gov. Ron DeSantis's (R) congressional maps Friday, reversing a lower court ruling that labeled them unconstitutional.  —  The appeals court said the lower court misapplied precedent … ",
    "url": "https://thehill.com/homenews/state-watch/4338182-appeals-court-reverses-ruling-desantis-congressional-maps/"
  },
  {
    "text": "5th Circuit rules Texas must remove river border buoys  —  The barrier in the river border Texas shares with Mexico has been condemned by immigrant advocates, Democrats and the Mexican government.  —  A federal appeals court on Friday ruled that Texas must remove a series of buoys … ",
    "url": "https://www.politico.com/news/2023/12/01/texas-river-border-buoys-00129659"
  },
  {
    "text": "Boebert Enlists Dave Chappelle for Transphobic Photo Op  —  SAY CHEESE  —  Dave Chappelle obliged a number of starstruck lawmakers' requests for photos while at Capitol Hill on Thursday, among them Reps. Lauren Boebert (R-CO) and Anna Paulina Luna (R-FL).  “May we get a selfie with you?”",
    "url": "https://www.thedailybeast.com/lauren-boebert-snaps-a-selfie-with-dave-chappelle-on-capitol-hill"
  },
  {
    "text": "Rep. Smith Statement on Vandalism at His Home  —  WASHINGTON, D.C. -Representative Adam Smith (D-Wash.) today released the following statement on the vandalism against his home in Bellevue, Washington regarding the conflict in Israel and Gaza.  —  “Last night, my house was vandalized … ",
    "url": "https://adamsmith.house.gov/press-releases?ID=576CE593-C52E-4E14-A57E-F429245C2262"
  },
  {
    "text": "Walmart says it is not advertising on social platform X  —  Walmart (WMT.N) said on Friday it is not advertising on social media platform X, one of the latest brands to say it has dropped the Elon Musk-owned site.  —  “We aren't advertising on X as we've found other platforms to better reach our customers … ",
    "url": "https://www.reuters.com/business/retail-consumer/walmart-says-it-is-not-advertising-social-platform-x-2023-12-01/"
  },
  {
    "text": "Speaker Johnson wrote foreword for book filled with conspiracy theories and homophobic insults  —  Speaker of the House Mike Johnson wrote the foreword and publicly promoted a 2022 book that spread baseless and discredited conspiracy theories and used derogatory homophobic insults.",
    "url": "https://www.cnn.com/2023/12/01/politics/kfile-mike-johnson-conspiracy-theories-homophobic-slurs/"
  },
  {
    "text": "NY-03: With Santos Expulsion Likely, Toss Up Special Looms on Long Island  —  With nearly 90 House Republicans planning to vote to expel GOP Rep. George Santos (NY-03) per Politico's latest whip count, it looks like a matter of hours until the most infamous House member of the social media age is finally ousted.",
    "url": "https://www.cookpolitical.com/analysis/house/new-york-house/ny-03-santos-expulsion-likely-toss-special-looms-long-island"
  },
  {
    "text": "How religion plays into Ron DeSantis' public image — from ‘armor of God’ to a Bible ordered on Amazon  —  The Florida governor has never made his faith a major part of his public image, but he's having to talk about it more as he reaches out to conservative religious voters.",
    "url": "https://www.nbcnews.com/politics/2024-election/religion-ron-desantis-catholic-amazon-bible-rcna126855"
  },
  {
    "text": "Exclusive: Felicity Huffman speaks about college-admission scandal, promotes women's rehab group  —  In an exclusive interview with Eyewitness News, Felicity Huffman is speaking about her involvement in the college-admissions scandal.  —  LOS ANGELES (KABC) — One day in December 2017 actress … ",
    "url": "https://abc7.com/felicity-huffman-a-new-way-of-life-college-admissions-scandal-operation-varsity-blues/14124704/"
  }
]