[
  {
    "text": "Justice Clarence Thomas Acknowledges He Should Have Disclosed Free Trips From Billionaire Donor  —  The trips include vacations in Indonesia and at the exclusive, men's-only Bohemian Grove retreat, which were first reported by ProPublica last year.  —  Friends of the Court … ",
    "url": "https://www.propublica.org/article/clarence-thomas-gift-disclosures-harlan-crow"
  },
  {
    "text": "Trump plans to claim sweeping powers to cancel federal spending  —  In a second term, allies said the former president would look at unilateral funding cuts for the World Health Organization and green energy initiatives.  —  Donald Trump is vowing to wrest key spending powers from Congress … ",
    "url": "https://www.washingtonpost.com/business/2024/06/07/trump-budget-impoundment-congress/"
  },
  {
    "text": "Fifth Circuit blocks religious-liberty training order in Southwest Airlines case  —  The U.S. Court of Appeals for the Fifth Circuit blocked a district court judge's order that lawyers for Southwest Airlines attend “religious-liberty training” from Alliance Defending Freedom as part of a contempt order … ",
    "url": "https://www.lawdork.com/p/fifth-circuit-blocks-religious-liberty-training"
  },
  {
    "text": "Biden Administration Tightens Mileage Standards to Buoy E.V.s  —  The new measure requires automakers to achieve an average of 65 miles per gallon for all the car models they sell by 2031.  —  The Biden administration on Friday tightened vehicle fuel mileage standards … ",
    "url": "https://www.nytimes.com/2024/06/07/climate/biden-mileage-electric-vehicles.html"
  },
  {
    "text": "Revealed: Trump ally Kari Lake gave speech in front of Confederate flag  —  Video shows Arizona Senate candidate repeating election-fraud claims at event with Confederate flag behind her  —  The Republican Senate candidate Kari Lake addressed supporters with a Confederate flag displayed behind … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/07/kari-lake-confederate-flag"
  },
  {
    "text": "Hunter Biden trial live updates: Forensic chemist, DEA agent set to testify in gun case  —  Hunter Biden wiped away tears as his eldest daughter testified about being “proud” of him during his rehab stint. … Hunter Biden's defense to decide on last witness over the weekend",
    "url": "https://www.nbcnews.com/politics/politics-news/live-blog/hunter-biden-trial-live-updates-rcna155914"
  },
  {
    "text": "Covenant Killer Audrey Hale Wrote 3 Pages in Journal About ‘My Imaginary Penis’  —  Covenant School killer Audrey Elizabeth Hale, a biological female who identified as a transgender male at the time of her March 27, 2023 attack, wrote a three-page journal entry titled “My Imaginary Penis” … ",
    "url": "https://tennesseestar.com/news/covenant-killer-audrey-hale-wrote-3-pages-in-journal-about-my-imaginary-penis/tpappert/2024/06/06/"
  },
  {
    "text": "‘We Ride at Dawn’: The Federalist Came For Dolly Parton, Now Her Fans Are Coming For Them  —  When is The Federalist going to learn that it's a mistake to go after intensely popular and beloved pop stars just for the sake of contrarianism?  —  Not any time soon, going by their new attack on country music icon Dolly Parton.",
    "url": "https://www.mediaite.com/entertainment/we-ride-at-dawn-the-federalist-came-for-dolly-parton-now-her-fans-are-coming-for-them/"
  },
  {
    "text": "Scoop: Johnson seeks votes for bill to support Trump after guilty verdict … It's in direct response to Trump's conviction last week in New York.  — Johnson's leadership team is making calls to whip support for the measure, the No More Political Prosecutions Act, according to two lawmakers … ",
    "url": "https://www.axios.com/2024/06/07/scoop-johnson-seeks-votes-for-bill-to-support-trump-after-guilty-verdict"
  },
  {
    "text": "Homeowners Want Housing Prices to Go Up  —  This is ultimately the biggest hurdle for affordable-housing policy.  —  In a study, home prices appeared to be the biggest factor in vote-switching in the counties where partisan preferences changed from one election to the next.",
    "url": "https://prospect.org/infrastructure/housing/2024-06-07-homeowners-want-housing-prices-to-go-up/"
  },
  {
    "text": "How to cover an abnormal presidential race  —  Could the media coverage adhere closer to reality?  Hard questions must be asked. … This week, I look at the challenge of covering a presidential campaign, in which a major political party plans to nominate a felon.",
    "url": "https://www.washingtonpost.com/opinions/2024/06/07/coverage-abnormal-campaign-2024/"
  },
  {
    "text": "Convictions: The Many Crimes of Donald Trump: Bannon Banished  —  On July 1, three days before Independence Day, Stephen Kevin Bannon, the leprous-faced, multi-shirt-wearing, nihilistic windbag, must report to prison, to serve his four-month sentence for Contempt of Congress.",
    "url": "https://gregolear.substack.com/p/convictions-the-many-crimes-of-donald"
  },
  {
    "text": "Federal grand jury reviewing evidence as part of probe into Mayor Adams' campaign: sources  —  A federal grand jury is reviewing evidence as part of the Manhattan U.S. attorney's investigation into Mayor Adams' 2021 campaign ties to Turkey, and at least one person linked to the mayor has received … ",
    "url": "https://www.nydailynews.com/2024/06/07/federal-grand-jury-reviewing-evidence-as-part-of-probe-into-mayor-adams-campaign-sources-turkey/"
  },
  {
    "text": "Bailey Anne becomes first trans woman to be crowned Miss Maryland USA  —  MARYLAND (DC News Now) — Bailey Anne, the newly crowned Miss Maryland USA, joined DC News Now on Wednesday.  She is the first trans woman to hold the coveted title, along with being the first Asian-American and military officer's wife to represent the state.",
    "url": "https://www.dcnewsnow.com/news/local-news/maryland/bailey-anne-becomes-first-trans-woman-to-be-crowned-miss-maryland/"
  },
  {
    "text": "Operatives with GOP ties are helping Cornel West get on the ballot in a key state  —  Documents obtained by NBC News show operatives connected to a Colorado-based GOP firm helped the far-left presidential candidate in North Carolina.  —  Cornel West's independent presidential campaign is broke.",
    "url": "https://www.nbcnews.com/politics/2024-election/operatives-gop-ties-are-helping-cornel-west-get-ballot-key-state-rcna153110"
  },
  {
    "text": "It's 2024.  Elon Musk Rules X. And the Political World Is Still Addicted. … While former President Donald Trump was actively being convicted by a jury of his peers in New York City last week, Democratic strategist Tim Hogan did what just about everyone in politics, media … ",
    "url": "https://www.notus.org/media/elon-musk-x-politics-addicted-twitter"
  },
  {
    "text": "Trump Says ‘Sometimes Revenge Can Be Justified’ During Interview With Dr. Phil: ‘I Have to be Honest’  —  Former President Donald Trump told Dr. Phil McGraw on Thursday that “sometimes revenge can be justified” after the television host suggested Trump wouldn't “have time to get even” … ",
    "url": "https://www.mediaite.com/tv/trump-says-sometimes-revenge-can-be-justified-during-interview-with-dr-phil-i-have-to-be-honest/"
  },
  {
    "text": "Ex-Democratic presidential candidate Tulsi Gabbard meets with Wisconsin GOP groups  —  MADISON - Republicans in key Wisconsin counties will hear from what would have been an unlikely visitor just a few years ago — former Democratic congresswoman and 2020 presidential candidate Tulsi Gabbard.",
    "url": "https://www.jsonline.com/story/news/politics/2024/06/07/ex-democrat-tulsi-gabbard-meets-with-wisconsin-gop-groups/74000918007/"
  },
  {
    "text": "Businessman Tells Jury He Bribed Senator Menendez With a Mercedes-Benz  —  Jose Uribe said he had provided the car to Senator Robert Menendez's girlfriend in exchange for gaining his “power and influence.”  —  Until recently, Jose Uribe was an obscure New Jersey businessman who had been caught … ",
    "url": "https://www.nytimes.com/2024/06/07/nyregion/jose-uribe-menendez-trial-bribery.html"
  },
  {
    "text": "Apollo 8 astronaut Anders, who took ‘Earthrise’ photo, reported dead in plane crash  —  Retired astronaut William Anders, one of the first three humans to orbit the moon, who captured the “Earthrise” photo during NASA's Apollo 8 mission, died on Friday when the small plane he was piloting crashed … ",
    "url": "https://www.reuters.com/world/us/apollo-8-astronaut-anders-who-took-earthrise-photo-reported-dead-plane-crash-2024-06-08/"
  },
  {
    "text": "Democrat town council refuses to fly ‘racist’ Thin Blue Line flag for slain cop and instead flies LGBT rainbow banner  —  A Democrat-led town council in Connecticut has sparked fury after voting down a motion to fly the Thin Blue Line flag for a state trooper killed in the line of duty.",
    "url": "https://www.dailymail.co.uk/news/article-13503229/Democrat-town-council-blue-line-pride.html"
  }
]