[
  {
    "text": "Statement from President Joe Biden on Iran's Attacks against the State of Israel  —  Earlier today, Iran—and its proxies operating out of Yemen, Syria and Iraq—launched an unprecedented air attack against military facilities in Israel.  I condemn these attacks in the strongest possible terms.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/13/statement-from-president-joe-biden-on-irans-attacks-against-the-state-of-israel/"
  },
  {
    "text": "Forces intercepted nearly all 300 Iranian drones and missiles, Israel says  —  Iran launched more than 300 drones and missiles toward Israel in its first full-scale military assault against the country.  U.S. military forces in the region helped Israel intercept the strikes, President Biden said.",
    "url": "https://www.washingtonpost.com/world/2024/04/14/israel-iran-attack-war-drones-missiles-news/"
  },
  {
    "text": "Scoop: Biden told Bibi U.S. won't support an Israeli counterattack on Iran … - Iran launched attack drones and missiles against Israel on Saturday night local time in retaliation for an airstrike in Syria that killed a top Iranian general.  — “More than 200 drones … ",
    "url": "https://www.axios.com/2024/04/14/biden-netanyahu-iran-israel-us-wont-support"
  },
  {
    "text": "Iran strike live updates: Israel says over 300 drones, missiles were shot down during attack … China expresses ‘deep concern’ over Iranian attack  —  HONG KONG — China expressed “deep concern” over the Iranian attack on Israel, describing it as “the latest spillover of the Gaza conflict” … ",
    "url": "https://www.nbcnews.com/news/world/live-blog/iran-attack-israel-strikes-live-updates-rcna147738"
  },
  {
    "text": "US tells Israel it won't join counter-strike on Iran, urges caution  —  Washington wants to prevent the conflict from escalating.  —  President Joe Biden told Israeli Prime Minister Benjamin Netanyahu that the United States will not join an offensive counter-strike on Iran should Israel choose … ",
    "url": "https://www.politico.com/news/2024/04/14/biden-netanyahu-u-s-wont-join-counter-strike-iran-00152130"
  },
  {
    "text": "Small-time investors in Trump's Truth Social reckon with stock collapse  —  Some Trump supporters who invested in his social media company have seen their share values plunge —  Jerry Dean McLain first bet on former president Donald Trump's Truth Social two years ago … ",
    "url": "https://www.washingtonpost.com/technology/2024/04/14/truth-social-investors-faith-trump/"
  },
  {
    "text": "If convicted this year, Trump could lose the right to vote for himself  —  Pundits and analysts have spent much of the past year debating the political impact should Donald Trump be convicted before November's election of any of the 88 felony charges he faces.",
    "url": "https://npr.org/2024/04/14/1240672009/trump-conviction-voting-rights"
  },
  {
    "text": "Donald Trump's Rambling Rally Speech Raises Questions  —  Donald Trump's mention of the “beautiful” Battle of Gettysburg during a campaign rally in Schnecksville, Pennsylvania, on Saturday got the former president some attention on social media, with users wondering what his rambling “rant” was about.",
    "url": "https://www.newsweek.com/donald-trump-rambling-rally-speech-raises-questions-1890121"
  },
  {
    "text": "Migration's human toll overwhelms a border county in Texas  —  EAGLE PASS, Tex. — The undertaker lighted a cigarette and held it between his latex-gloved fingers as he stood over the bloated body bag lying in the bed of his battered pickup truck.  —  The woman had been fished out of the Rio Grande minutes earlier.",
    "url": "https://www.washingtonpost.com/nation/interactive/2024/texas-border-eagle-pass-migrant-deaths/"
  },
  {
    "text": "These Mormon women are rejecting Trump, fraying GOP support in a key state  —  GILBERT — It was Annie Lewis' idea to put a “Republicans for Biden” sign in the front yard in the lead-up to 2020.  For her, it came down to civility.  As a teacher for over a decade, the mother of six little ones … ",
    "url": "https://npr.org/2024/04/14/1242051595/trump-arizona-mormon-lds-republican-voters"
  },
  {
    "text": "Trump supporters echo pro-Palestinian ‘genocide Joe’ chant  —  It's unclear what they meant by it, as Trump has pledged similarly strong support for Israel  —  SCHNECKSVILLE, Pa. — “Genocide Joe” is a phrase used by pro-Palestine protesters against President Biden because of his unconditional support … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/14/genocide-israel-gaza-iran-trump-biden/"
  },
  {
    "text": "The Shady Right-Wing Threats to Keep Biden Off Some State Ballots  —  When the Supreme Court overturned a Colorado court ruling last month that had disqualified former President Donald Trump from the state ballot, the justices argued that it was necessary to avoid a “patchwork” of requirements for presidential candidates to meet.",
    "url": "https://newrepublic.com/article/180674/ohio-alabama-biden-convention-ballots"
  },
  {
    "text": "As Trump Ponders V.P. Contenders, He Asks: Can They Help Me Raise Cash?  —  Donald Trump's concerns about money may have entered his vice-presidential calculations, along with political considerations and which contenders he likes the look of.  —  As former President Donald J. Trump sifts … ",
    "url": "https://www.nytimes.com/2024/04/14/us/politics/trump-vice-president-pick.html"
  },
  {
    "text": "Chris Sununu stands by Jan. 6 criticism of Trump but now says convictions wouldn't be disqualifying  —  “For me, it's not solely about him,” the New Hampshire governor said.  —  In this April 25, 2023, file photo, Chris Sununu speaks onstage at the 2023 TIME100 Summit at Jazz at Lincoln Center in New York.",
    "url": "https://abcnews.go.com/Politics/chris-sununu-stands-jan-6-criticism-trump-now/story?id=109205941"
  }
]