[
  {
    "text": "How Much Is Biden's Support of Israel Hurting Him With Young Voters?  —  Donald Trump leads him among those 18 to 29, a new poll shows.  —  As recently as this summer, a poll with Donald J. Trump leading among young voters would have been eye-popping.  —  Now, it's increasingly familiar … ",
    "url": "https://www.nytimes.com/2023/12/19/upshot/poll-biden-trump-israel-youth.html"
  },
  {
    "text": "Poll Finds Wide Disapproval of Biden on Gaza, and Little Room to Shift Gears  —  Opinion is split between those wanting the war to end and those pressing for a definitive Israeli victory, and the divide is starkest among older and younger generations.  —  Opinion is split between those wanting … ",
    "url": "https://www.nytimes.com/2023/12/19/us/politics/biden-israel-gaza-poll.html"
  },
  {
    "text": "Playbook: Dropping the H-bomb on 2024  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  NEW NYT/SIENA POLL — Among registered voters: Trump beats Biden, 46% to 44%.  Among likely voters: Biden beats Trump, 47% to 45%.  Toplines ... Crosstabs",
    "url": "https://www.politico.com/newsletters/playbook/2023/12/19/dropping-the-h-bomb-on-2024-00132405"
  },
  {
    "text": "Why Biden's campaign keeps linking Trump to Hitler  —  The Biden campaign warns that Trump's rhetoric — from “vermin” to “poisoned” blood — could reflect history repeating.  —  Comparing your political opponent's words to Adolf Hitler's used to be controversial.",
    "url": "https://www.politico.com/news/2023/12/19/biden-trump-hitler-00132367"
  },
  {
    "text": "Trump Lawyers: Jack Smith ‘Unlawfully Attempted to Advance’ D.C. Election Case Despite Court-Ordered Pause  —  The special counsel's office said it delivered the material on Monday in anticipation of the case getting put back on track toward trial  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-discovery-dc-election-case-appeal-stay-pause-chutkan-smith"
  },
  {
    "text": "Trump Is Scrambling to Block One Particular Expert Witness in His New E. Jean Carroll Case  —  Donald Trump's lawyers want to bar the same expert witness who came up with a hefty calculation in Rudy Giuliani's defamation case from testifying in a new E. Jean Carroll lawsuit.",
    "url": "https://www.thedailybeast.com/donald-trump-scrambles-to-block-expert-witness-ashlee-humphreys-in-his-new-e-jean-carroll-case"
  },
  {
    "text": "Biden resists his age limitations, causing tension  —  President Biden's reluctance to acknowledge his physical limitations at age 81 is causing some tension on his team, as senior aides and First Lady Jill Biden push him to rest more and be vigilant about his health going into 2024.",
    "url": "https://www.axios.com/2023/12/19/biden-resistance-age-trump-election-2024"
  },
  {
    "text": "Cardin ‘angry,’ ‘disappointed’ with ex-staffer after sex tape reveal  —  Sen. Ben Cardin (D-Md.) on Monday said he is “angry” after a video emerged of a now-former staffer performing lewd acts in a Senate committee hearing room.  —  Cardin declined to delve into particulars about the staffer … ",
    "url": "https://thehill.com/homenews/senate/4366737-cardin-angry-disappointed-with-ex-staffer-after-sex-tape-reveal/"
  },
  {
    "text": "Gov. Greg Abbott signs bill making illegal immigration a state crime  —  The new law would authorize police to arrest people they suspect crossed the Rio Grande between ports of entry.  Abbott also signed a bill earmarking more than $1 billion for more border barriers.",
    "url": "https://www.texastribune.org/2023/12/18/texas-governor-abbott-bills-border-wall-illegal-entry-crime-sb3-sb4/"
  },
  {
    "text": "Toplines: December 2023 Times/Siena Poll of Registered Voters Nationwide  —  Donald Trump leads Joe Biden by 46 percent to 44 percent among registered voters.  —  Thinking ahead to next year's presidential general election, are you almost certain that you will vote, very likely to vote … ",
    "url": "https://www.nytimes.com/interactive/2023/12/19/us/elections/times-siena-national-poll-toplines.html"
  },
  {
    "text": "Fernandina Beach Man Pleads Guilty To Threatening To Kill A United States Supreme Court Justice  —  For Immediate Release  —  U.S. Attorney's Office, Middle District of Florida  —  Jacksonville, Florida - United States Attorney Roger B. Handberg announces that Neal Brij Sidhwaney (43 … ",
    "url": "https://www.justice.gov/usao-mdfl/pr/fernandina-beach-man-pleads-guilty-threatening-kill-united-states-supreme-court"
  },
  {
    "text": "Statement from Secretary of Defense Lloyd J. Austin III on Ensuring Freedom of Navigation in the Red Sea  —  The recent escalation in reckless Houthi attacks originating from Yemen threatens the free flow of commerce, endangers innocent mariners, and violates international law.",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3621110/statement-from-secretary-of-defense-lloyd-j-austin-iii-on-ensuring-freedom-of-n/"
  },
  {
    "text": "Former Miami Young Republicans director arrested over Jan. 6 charges  —  Balmaseda was an active GOP member in South Florida.  —  TALLAHASSEE, Florida — A South Florida woman with connection to the state Republican Party and GOP officials was arrested by federal authorities last week … ",
    "url": "https://www.politico.com/news/2023/12/18/miami-republican-jan-6-00132320"
  },
  {
    "text": "Trump Georgia Co-Defendant's Lawyers File Notice to Withdraw from RICO Case  —  Defense lawyers for Trevian Kutti, the former publicist for the rapper known as Kanye West, on Monday night filed notice they want to drop their client in the Fulton County case  —  JWPlayer",
    "url": "https://themessenger.com/politics/trump-georgia-trevian-kutti-codefendant-lawyers-notice-withdraw"
  },
  {
    "text": "Body found in Kentucky lake by fishermen in 1999 identified as fugitive wanted by FBI  —  Nearly a quarter century after fishermen discovered a body chained to the bottom of a lake in western Kentucky, authorities say advanced forensic testing helped identify the remains as a fugitive wanted by the FBI in the late 1990s.",
    "url": "https://www.cbsnews.com/news/roger-parham-body-found-kentucky-lake-fishermen-1999-identified-fugitive-wanted-fbi/"
  },
  {
    "text": "Women for America First Reportedly Lied to Interior Department About Jan. 6 Ellipse Protest Permit: Report  —  A report the Department of the Interior says that WFAF ‘intentionally failed to disclose information’ about the march to the Capitol when they submitted their permit to the National Park Service",
    "url": "https://themessenger.com/politics/women-for-america-first-reportedly-lied-to-interior-department-about-jan-6-ellipse-protest-permit-report"
  },
  {
    "text": "Meta Oversight Board says Israel-Hamas videos should not have been removed  —  Meta Platform's (META.O) Oversight Board said on Tuesday that the social media company erred in removing two videos depicting hostages and injured people in the Israel-Hamas conflict, saying the videos were valuable … ",
    "url": "https://www.reuters.com/technology/meta-oversight-board-says-israel-hamas-videos-should-not-have-been-removed-2023-12-19/"
  },
  {
    "text": "Inside The Russian Propaganda Mill Beaming Out Of A Florida Strip Mall  —  When Ben Swann delivers a news report, he looks and sounds like any other TV anchor:  conventionally attractive, slick hair, clad in an unremarkable but well-tailored suit.  —  But unlike thousands of TV reporters around … ",
    "url": "https://talkingpointsmemo.com/news/inside-the-russian-propaganda-mill-beaming-out-of-a-florida-strip-mall"
  }
]