[
  {
    "text": "Police officer fired gun while clearing protesters from Columbia building, prosecutors say  —  Body camera video shows police cutting chains, moving furniture at Columbia University  —  Demonstrators detained at UCLA as police dismantle encampment  —  Protesters arrested at Dartmouth College",
    "url": "https://apnews.com/article/israel-palestinian-campus-student-protests-war-ec3f62c51c08599f8fcecd99f7cf9e33"
  },
  {
    "text": "Don't Forget the Backlash to the '60s  —  Today's campus chaos carries a grim warning for Biden.  —  Mark Rudd, a leader of the student protest at Columbia University in New York, is interviewed outside Low Memorial Library, background, on April 25, 1968.  Students had occupied the building.  AP",
    "url": "https://www.politico.com/news/magazine/2024/05/02/why-campus-chaos-should-give-democrats-ptsd-00155537"
  },
  {
    "text": "Biden Calls Ally Japan ‘Xenophobic’ Along With China, Russia  — Remarks come weeks after Biden welcomed Japan's PM Kishida  — Immigration inches up in Japan, population still shrinking  —  US President Joe Biden included ally Japan along with rivals China and Russia in a list of countries he called … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-02/biden-now-calls-ally-japan-xenophobic-along-with-china-russia"
  },
  {
    "text": "Trump Auditions VP Picks Before Wealthy Donors in Palm Beach  — Vance, Rubio, Burgum and Scott among leading contenders  — Trump says he will likely announce running mate in July  —  Donald Trump is sharpening his focus on a possible running mate by taking a page from his days hosting reality show … ",
    "url": "https://www.bloomberg.com/news/articles/2024-05-02/trump-auditions-vp-picks-before-wealthy-donors-in-palm-beach"
  },
  {
    "text": "Trump keeps encouraging supporters to fight unsubstantiated claims of election fraud  —  Todd Spangler Clara Hendrickson Karissa WaddickUSA TODAY  —  Donald Trump has spent years railing against state-level voting operations, targeting vote-by-mail options and spreading conspiracy theories about rigged results in battleground states.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/05/02/trump-election-integrity/73541588007/"
  },
  {
    "text": "Lawmakers announce dog lovers caucus in wake of Noem news  —  Bipartisan lawmakers on Tuesday announced the start of a dog lovers caucus on Capitol Hill in the wake of a story about South Dakota Gov. Kristi Noem (R-S.D.) shooting and killing a family dog.  —  “In light of recent events … ",
    "url": "https://thehill.com/homenews/house/4638846-lawmakers-announce-dog-lovers-caucus-in-wake-of-noem-news/"
  },
  {
    "text": "Arizona Gov. Katie Hobbs signs repeal of 1864 abortion ban  —  The near-total abortion ban is still likely to go into effect for a period of time due to unique aspects of state law.  —  Arizona Gov. Katie Hobbs signed on Thursday a repeal of the state's near-total abortion ban … ",
    "url": "https://www.nbcnews.com/politics/arizona-governor-signs-repeal-1864-abortion-ban-rcna150364"
  },
  {
    "text": "Extremist Militias Are Coordinating in More Than 100 Facebook Groups  —  After lying low for years in the aftermath of January 6, exclusive reporting shows, militia extremist groups and profiles have been quietly reorganizing and ramping up recruitment and rhetoric on Facebook.",
    "url": "https://www.wired.com/story/extremist-militias-are-coordinating-on-facebook/"
  },
  {
    "text": "Alarm in Israel at reports of possible ICC legal action over Gaza  —  Israeli officials are increasingly concerned that the UN's top criminal court is planning to seek arrest warrants for their military and political leaders on suspicion of war crimes.  —  Reports suggest Prime Minister Benjamin Netanyahu could be among them.",
    "url": "https://www.bbc.com/news/world-middle-east-68938022"
  },
  {
    "text": "Sen. Lindsey Graham's phone being investigated for potential hack  —  The South Carolina senator said on Wednesday that the FBI was in possession of his phone.  —  WASHINGTON — Sen. Lindsey Graham said on Wednesday that the FBI was in possession of his phone after he received a message … ",
    "url": "https://www.nbcnews.com/politics/congress/sen-lindsey-grahams-phone-investigated-potential-hack-rcna150507"
  },
  {
    "text": "In interview, Trump doesn't commit to accepting Wisconsin election results if he loses  —  Alison Dirr Molly BeckMilwaukee Journal Sentinel  —  WAUKESHA - Former President Donald Trump on Wednesday didn't commit to accepting the results of Wisconsin's presidential election in November … ",
    "url": "https://www.jsonline.com/story/news/politics/elections/2024/05/02/trump-doesnt-commit-to-accepting-wisconsin-election-results/73520131007/"
  },
  {
    "text": "Man who bragged that he ‘fed’ an officer to the mob of Capitol rioters gets nearly 5 years in prison  —  Jack Whitton expressed remorse for his ‘horrible’ actions.  —  A Georgia business owner who bragged that he “fed” a police officer to a mob of rioters storming the U.S. Capitol on Jan. 6 … ",
    "url": "https://www.politico.com/news/2024/05/02/jack-whitton-5-year-prison-sentence-00155868"
  },
  {
    "text": "Schumer poised to join Johnson invite for Netanyahu address to Congress  —  Senate Majority Leader Chuck Schumer (D-N.Y.) is poised to join Speaker Mike Johnson (R-La.) in inviting Israeli Prime Minister Benjamin Netanyahu to deliver an address to Congress, despite tensions between … ",
    "url": "https://thehill.com/homenews/senate/4640068-schumer-johnson-netanyahu-invite/"
  },
  {
    "text": "Former Michigan House leader, wife plead not guilty to misusing political funds  —  The former leader of the Michigan House and his wife pleaded not guilty Thursday to financial charges arising from an investigation of how they spent money from unregulated political funds.",
    "url": "https://apnews.com/article/michigan-house-exlawmaker-charged-913f125eee550fadf896edbc9e06a5a9"
  },
  {
    "text": "Wyoming voids 28% of its voter registrations in mandatory purge  —  Thousands of Wyoming residents could be surprised on Election Day when they show up to cast a ballot only to discover they're no longer registered to vote.  —  There are currently about 83,500 fewer registered voters … ",
    "url": "https://wyofile.com/wyoming-voids-28-of-its-voter-registrations-in-mandatory-purge/"
  },
  {
    "text": "Menendez's attorneys reveal new argument for why senator had gold bar stash  —  .  —  Sen. Bob Menendez (D-NJ) has a new reason for having a treasure trove of gold and cash that law enforcement officers found during a raid on his home.  —  Menendez's attorneys argued that … ",
    "url": "https://www.washingtonexaminer.com/news/senate/2988540/menendez-attorneys-reveal-new-argument-for-gold-bar-stash/"
  },
  {
    "text": "Young voters are mad about Gaza.  But many don't see it driving their 2024 vote.  —  Focus groups of Wisconsin students exposed intense feelings about Israel's military campaign in Gaza — and how it fits into other issues that matter in the election.  —  Young people are deeply critical … ",
    "url": "https://www.nbcnews.com/politics/2024-election/young-voters-are-mad-gaza-many-dont-see-driving-2024-vote-rcna150387"
  },
  {
    "text": "Arkansas governor says state won't comply with new federal rules on treatment of trans students  —  Arkansas Gov. Sarah Huckabee Sanders declared Thursday that the state won't comply with a federal regulation that seeks to protect the rights of transgender students in the nation's schools … ",
    "url": "https://apnews.com/article/arkansas-title-ix-transgender-huckabee-sanders-bf44e0e7c6dc8f1e03149a790be3d2ef"
  },
  {
    "text": "Live Updates: Stormy Daniels's Lawyer Details Hush-Money Payment in Trump Trial  —  The lawyer who represented a porn star whose hush-money deal is at the case's center is now testifying.  The judge considered more statements by the former president that prosecutors said violated a gag order, but did not rule on them.",
    "url": "https://www.nytimes.com/live/2024/05/02/nyregion/trump-hush-money-trial"
  },
  {
    "text": "House Republicans launch multiple investigations into college protests  —  Four GOP committee chairs are probing pro-Palestinian campus activism.  —  House Republicans are deploying their oversight powers to scrutinize pro-Palestinian protests and antisemitism on college campuses … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/02/congress-republicans-investigate-campus-protests/"
  }
]