[
  {
    "text": "Liz Cheney, outspoken Trump critic, weighs third-party presidential run  —  The former congresswoman says she is determined to stop Trump.  Other Trump critics think a third-party candidacy could help him.  —  Liz Cheney, one of the most vociferous critics of Donald Trump in the Republican Party … ",
    "url": "https://www.washingtonpost.com/elections/2023/12/05/liz-cheney-trump-president-2024/"
  },
  {
    "text": "The anti-Trump alarm goes off  —  THE ANTI-TRUMP ALARM GOES OFF.  Around this time in 2015, some in the political commentary class had a collective realization: Donald Trump could win the 2016 Republican presidential nomination.  A freakout of sorts ensued, although many remained confident … ",
    "url": "https://www.washingtonexaminer.com/opinion/the-anti-trump-alarm-goes-off"
  },
  {
    "text": "Fewer young Americans plan to vote in 2024, Harvard youth poll finds  —  The potential decline in participation by young voters could hurt President Biden in a potential matchup with former president Donald Trump.  —  Fewer voters under age 30 plan to vote in the upcoming presidential election … ",
    "url": "https://www.washingtonpost.com/politics/2023/12/05/fewer-voters-harvard-youth-poll/"
  },
  {
    "text": "Trump Rips Drudge Report For Covering Him ‘Unfairly’: ‘Site Fell Apart’  —  The former president praised the aggregation news site's downfall: ‘I love it!’  —  Former President Donald Trump over the weekend slammed conservative news aggregation site the Drudge Report in a Truth Social post for … ",
    "url": "https://themessenger.com/politics/trump-rips-drudge-report-for-covering-him-unfairly-site-fell-apart"
  },
  {
    "text": "Ex-Trump State official Morgan Ortagus announces new SiriusXM show  —  Morgan Ortagus says that while many political consultants argue that presidential elections aren't focused on foreign policy, “2024 is going to be different.”  —  “I think that people feel a very deep unease about the fact … ",
    "url": "https://thehill.com/blogs/in-the-know/4341710-ex-trump-state-morgan-ortagus-siriusxm/"
  },
  {
    "text": "Nikki Haley wants to reform Social Security and Medicare.  Donors are paying attention  —  As she woos her party's wealthy donors, former South Carolina Gov. Nikki Haley is promoting a policy that sets her apart from her closest competitors for the 2024 Republican presidential nomination … ",
    "url": "https://www.cnn.com/2023/12/05/politics/nikki-haley-social-security-medicare-reform/"
  },
  {
    "text": "Fetterman mocks Speaker Johnson over Biden impeachment inquiry push: ‘Oh no!’  —  Sen. John Fetterman (D-Pa.) went after Speaker Mike Johnson (R-La.) on Monday, mocking his effort for an impeach inquiry of President Biden over unproven claims of illicit family business deals.  —  “Oh, no, please, please don't!”",
    "url": "https://thehill.com/homenews/senate/4342520-fetterman-speaker-johnson-biden-impeachment/"
  },
  {
    "text": "Gingrich Warns that GOP Votes Against Impeachment Will ‘Guarantee’ Primary Challenges  —  Speaker of the House Mike Johnson, R-La., announced on Fox and Friends over the weekend that he believed he has the votes for an impeachment inquiry  —  Former GOP House Speaker Newt Gingrich … ",
    "url": "https://themessenger.com/politics/gingrich-warns-that-gop-votes-against-impeachment-will-guarantee-primary-challenges"
  },
  {
    "text": "Congress provided $7.5B for electric vehicle chargers.  Built so far: Zero.  —  The sluggish rollout could undermine President Joe Biden's reelection messaging promoting electric vehicles.  —  Congress at the urging of the Biden administration agreed in 2021 to spend $7.5 billion to build tens … ",
    "url": "https://www.politico.com/news/2023/12/05/congress-ev-chargers-billions-00129996"
  },
  {
    "text": "Gold bars featured in Sen. Bob Menendez bribery case are linked to a 2013 robbery, records show  —  A businessman told police that he was the victim of a robbery in 2013, and asked them to recover the 22 gold bars stolen.  Four bars were found a decade later in Menendez's home.",
    "url": "https://www.nbcnews.com/politics/congress/gold-bars-featured-bob-menendez-bribery-case-linked-2013-robbery-recor-rcna128006"
  },
  {
    "text": "Top Democratic Donor, Reid Hoffman, Gives $250,000 to a Nikki Haley Super PAC  —  Mr. Hoffman, the co-founder of LinkedIn, has funded an array of anti-Trump candidates and causes.  —  When Jamie Dimon, the chief executive of JPMorgan Chase, urged Democratic donors last week to rally behind Nikki Haley … ",
    "url": "https://www.nytimes.com/2023/12/05/us/politics/nikki-haley-reid-hoffman-donation.html"
  },
  {
    "text": "Sen. Rick Scott: 'I Don't See How' Florida GOP Leader Can Serve Amid Rape Investigation  —  Florida Sen. Rick Scott suggested Tuesday that the state GOP's chair, Christian Ziegler, should step aside as he faces a rape investigation.  —  Scott's written statement stopped short of clearly calling for Ziegler to step down.",
    "url": "https://themessenger.com/politics/sen-rick-scott-i-dont-see-how-florida-gop-leader-can-serve-amid-rape-investigation"
  },
  {
    "text": "Tucker Carlson's longtime producer accused of 2008 sexual assault  —  The accuser, Andrew Delancey, alleges that Justin Wells lured him to his apartment in New York, and then pushed him onto a bed and forcibly grabbed his genitals.  —  Tucker Carlson's longtime executive producer at Fox News … ",
    "url": "https://www.nbcnews.com/news/us-news/tucker-carlsons-longtime-producer-accused-2008-sexual-assault-rcna128062"
  },
  {
    "text": "Comer Releases Direct Monthly Payments to Joe Biden from Hunter Biden's Business Entity  —  WASHINGTON—Today, House Committee on Oversight and Accountability Chairman James Comer (R-Ky.) released subpoenaed bank records revealing Hunter Biden's business entity, Owasco PC, made direct monthly payments to Joe Biden.",
    "url": "https://oversight.house.gov/release/comer-releases-direct-monthly-payments-to-joe-biden-from-hunter-bidens-business-entity%EF%BF%BC/"
  },
  {
    "text": "Indictments dropped against 17 Texas police officers over tactics used during 2020 George Floyd protests  —  Democratic Travis County District Attorney Jose Garza, who was elected months after the protests and ran on promises to hold police accountable in Austin, said his office … ",
    "url": "https://www.nbcnews.com/news/us-news/indictments-dropped-17-texas-police-officers-tactics-used-2020-george-rcna128069"
  },
  {
    "text": "“Someone tell me what to do”  —  Across the country, states require more training to prepare students and teachers for mass shootings than for those expected to protect them.  The differences were clear in Uvalde, where children and officers waited on opposite sides of the door.",
    "url": "https://www.texastribune.org/2023/12/05/uvalde-officer-student-trainings-mass-shootings/"
  },
  {
    "text": "Tech-focused lawmaker launches campaign for Silicon Valley House seat  —  Low leaned into his support from law enforcement and his work on tech issues, including chairing a caucus to advocate for one of California's signature industries.  —  California Assemblymember Evan Low launched … ",
    "url": "https://www.politico.com/news/2023/12/05/evan-low-congress-california-00130014"
  },
  {
    "text": "House Judiciary Committee looks into oversight of DOJ's Civil Rights division: Watch live  —  The House Judiciary Subcommittee on the Constitution and Limited Government is holding a hearing Tuesday morning to examine the work of the Civil Rights division of the Department of Justice (DOJ) … ",
    "url": "https://thehill.com/video-clips/4342562-house-judiciary-committee-dojs-civil-rights-division-watch-live/"
  }
]