[
  {
    "text": "Fetterman to be first sitting Democratic U.S. senator to visit Trump at Mar-a-Lago  —  Democratic Sen. John Fetterman of Pennsylvania has accepted an invitation from President-elect Donald Trump to meet with him at his Mar-a-Lago estate, according to multiple sources familiar with the plans.",
    "url": "https://www.cbsnews.com/news/fetterman-trump-mar-a-lago/"
  },
  {
    "text": "Democrats Are About to Surrender to Trump in a Hugely Damaging Way  —  By all indications, at least nine Senate Democrats will vote to advance the Laken Riley Act, a sweeping measure that mandates the detention of undocumented immigrants who have committed nonviolent crimes, all but ensuring that it will move forward.",
    "url": "https://newrepublic.com/article/190043/laken-riley-immigration-bill-trump-democrats-surrender"
  },
  {
    "text": "Inside Trump's Search for a Health Threat to Justify His Immigration Crackdown  —  President-elect Donald J. Trump's advisers have spent months trying to identify a disease that will help them build their case for closing the border.  —  President-elect Donald J. Trump is likely to justify … ",
    "url": "https://www.nytimes.com/2025/01/09/us/politics/trump-title-42-migrants.html?unlocked_article_code=1.n04.MOeP.WMVO9O2AF_cF&smid=url-share"
  },
  {
    "text": "Scoop: Trump's 100 executive orders … - Senators were given previews of some of what they were told would be 100 executive orders, two sources who were in the room told Axios.  — Stephen Miller, Trump's longtime immigration adviser, dove into how they intend to use executive power … ",
    "url": "https://www.axios.com/2025/01/09/trump-immigration-executive-orders-stephen-miller"
  },
  {
    "text": "Supreme Court refuses to delay Trump's hush money sentencing  —  President-elect Donald Trump turned to the Supreme Court in a last-ditch effort to stop the sentencing, citing the conservative majority's explosive immunity opinion.",
    "url": "https://www.washingtonpost.com/politics/2025/01/09/trump-sentencing-supreme-court-new/"
  },
  {
    "text": "Elon Musk and Donald Trump spread disinformation as wildfires rage in the LA area … As fires rage across Los Angeles and tens of thousands flee their homes, the usual suspects have decided to blame the blazes on their political enemies.  In a series of posts on Truth Social … ",
    "url": "https://www.theverge.com/2025/1/9/24339980/la-fires-pacific-palisades-disinformation-trump-musk"
  },
  {
    "text": "Supreme Court Denies Trump's Last-Ditch Effort to Avoid Sentencing  —  Donald J. Trump is scheduled to face a New York judge on Friday morning after being convicted of 34 felonies.  His punishment will be largely symbolic.  —  The U.S. Supreme Court on Thursday denied President-elect Donald … ",
    "url": "https://www.nytimes.com/2025/01/09/nyregion/trump-sentencing-supreme-court.html"
  },
  {
    "text": "Donald Trump Jr.'s visit was ‘staged,’ says Greenland lawmaker  —  A senior Greenlandic politician slammed Donald Trump Jr.'s visit to the island as “staged,” and warned the United States not to “invade us” given its historical treatment of Alaska's indigenous people.",
    "url": "https://www.politico.eu/article/donald-trump-junior-visit-was-staged-says-greenland-lawmaker/"
  },
  {
    "text": "Judge Rejects Biden's Title IX Rules, Scrapping Protections for Trans Students  —  The decision threw out the administration's proposed regulations, which prohibited discrimination based on gender identity.  —  A federal judge in Kentucky on Thursday struck down President Biden's effort … ",
    "url": "https://www.nytimes.com/2025/01/09/us/politics/biden-title-ix-ruling.html"
  },
  {
    "text": "Federal judge strikes down Biden Title IX rules  —  A federal judge in Kentucky struck down changes made to Title IX by the Biden administration Thursday, ruling that the new regulations, which had sought to expand nondiscrimination protections for LGBTQ students, violate the Constitution.",
    "url": "https://thehill.com/homenews/state-watch/5077271-kentucky-judge-rules-biden-title-ix/"
  },
  {
    "text": "CNN's Scott Jennings Makes L.A. Fire Hell All About DEI  —  Scott Jennings felt the ire of Rep. Jasmine Crockett (D-TX), who took a blowtorch to him after he appeared to suggest on CNN NewsNight that the southern California wildfires are worse because there are not enough white men working … ",
    "url": "https://www.thedailybeast.com/scott-jennings-says-la-firefighters-too-busy-promoting-diversity/"
  },
  {
    "text": "Candy Crush, Tinder, MyFitnessPal: See the Thousands of Apps Hijacked to Spy on Your Location  —  This article was produced with support from WIRED.  —  Some of the world's most popular apps are likely being co-opted by rogue members of the advertising industry to harvest sensitive location data … ",
    "url": "https://www.404media.co/candy-crush-tinder-myfitnesspal-see-the-thousands-of-apps-hijacked-to-spy-on-your-location/"
  },
  {
    "text": "Anita Bryant, Singer and Crusader Against Gay Rights, Dies at 84  —  She has hits with songs like “Paper Roses” and served as a spokesperson for Florida orange juice before her career came crashing down.  —  Anita Bryant, the pop singer and Oklahoma beauty queen who gained fame by convincing America that a … ",
    "url": "https://www.hollywoodreporter.com/news/music-news/anita-bryant-dead-singer-orange-juice-gay-rights-1236105715/"
  },
  {
    "text": "Karen Pence Snubs Donald Trump At Jimmy Carter's Funeral  —  This was the first time Mike Pence and Donald Trump have been together publicly since the insurrection.  —  LOADING  —  Former second lady Karen Pence appeared to snub President-elect Donald Trump on Thursday at former President Jimmy Carter's funeral.",
    "url": "https://www.huffpost.com/entry/karen-pence-snubs-donald-trump-jimmy-carter-funeral_n_677ff987e4b0dc0efd13adb0"
  },
  {
    "text": "Elon Musk says DOGE probably won't find $2 trillion in federal budget cuts  —  Musk previously said his Department of Government Efficiency would be able to recommend cuts to the federal budget of “at least $2 trillion.”  —  Tech billionaire Elon Musk said Wednesday that his budget-cutting effort … ",
    "url": "https://www.nbcnews.com/politics/politics-news/elon-musk-says-doge-probably-wont-find-2-trillion-federal-budget-cuts-rcna186924"
  },
  {
    "text": "Thousands of homes destroyed or damaged in Palisades firestorm, LAFD estimates  —  Los Angeles fire officials said Thursday that thousands of homes appear to have been damaged or destroyed in the firestorm in Pacific Palisades, an estimate that would significantly heighten the scale of the disaster.",
    "url": "https://www.latimes.com/california/story/2025-01-09/even-after-a-two-day-nightmare-l-a-girds-for-more-days-of-fire-weather"
  },
  {
    "text": "'It's Total Chaos Internally at Meta Right Now': Employees Protest Zuckerberg's Anti LGBTQ Changes  —  Meta employees are furious with the company's newly announced content moderation changes that will allow users to say that LGBTQ+ people have “mental illness,” according to internal conversations obtained … ",
    "url": "https://www.404media.co/its-total-chaos-internally-at-meta-right-now-employees-protest-zuckerbergs-anti-lgbtq-changes/"
  },
  {
    "text": "“Pizzagate” gunman dies in officer-involved shooting in North Carolina  —  Edgar Madison Welch was stopped by officers outside of Charlotte.  —  Signs of support hang on the building at Comet Ping Pong in Washington, D.C., on Dec. 6, 2016.  The business is set to reopen after Edgar Maddison Welch … ",
    "url": "https://abcnews.go.com/Politics/pizzagate-gunman-dies-officer-involved-shooting-north-carolina/story?id=117527334"
  },
  {
    "text": "Falsehoods around the L.A. fires are proliferating on the right  —  Anything to keep the realities of climate change from spreading.  —  There is nothing political about the wildfires that have annihilated thousands of buildings around Los Angeles this week, with two exceptions.",
    "url": "https://www.washingtonpost.com/politics/2025/01/09/los-angeles-fires-politics/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM2Mzk4ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3NzgxMTk5LCJpYXQiOjE3MzYzOTg4MDAsImp0aSI6ImE3N2IyYWJkLTVjYjItNDY3Yi04ZDBhLTBhNDI2Mjk0YmUzMiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI1LzAxLzA5L2xvcy1hbmdlbGVzLWZpcmVzLXBvbGl0aWNzLyJ9.joiSOVPm4sJK4Jtpvl0AmoakhBImvm0g3Bf3RYSuR3c&itid=gfta"
  },
  {
    "text": "Trump's talk of retaking Panama Canal becomes a GOP bill … - Rep. Marjorie Taylor Greene (R-Ga.) said Tuesday she plans to introduce a bill that would rename the Gulf of Mexico to the “Gulf of America.” … - The bill authorizes the president and secretary of state to … ",
    "url": "https://www.axios.com/2025/01/09/trump-panama-canal-house-republican-bill"
  },
  {
    "text": "More than 15,000 doctors sign letter urging Senate to reject RFK Jr. as health secretary  —  Their letter calls the choice of Robert F. Kennedy Jr., who is known for promoting false medical claims, “a slap in the face” to health care professionals.  —  More than 15,000 doctors have signed … ",
    "url": "https://www.nbcnews.com/news/us-news/rfk-jr-health-secretary-doctors-urge-senate-block-trump-administration-rcna186807"
  },
  {
    "text": "FBI informant who made up Biden bribe story gets 6 years in prison  —  Alexander Smirnov pleaded guilty to lying to the FBI about the Bidens accepting $10M in bribes from Ukrainian gas company Burisma  —  A former FBI informant who prosecutors say fabricated a phony story of President Biden … ",
    "url": "https://www.foxnews.com/politics/fbi-informant-who-made-up-biden-bribe-story-gets-6-years-prison"
  },
  {
    "text": "Google searches for deleting Facebook, Instagram explode after Meta ends fact-checking  —  Google searches for how to cancel and delete Facebook, Instagram, and Threads accounts have seen explosive rises in the U.S. since Meta CEO Mark Zuckerberg announced that the company will end … ",
    "url": "https://techcrunch.com/2025/01/09/google-searches-for-deleting-facebook-instagram-explode-after-meta-ends-fact-checking/"
  }
]