[
  {
    "text": "Washington Post bombshell: Washington Post buried Alito flag story for three years  —  Last week, many of us learned from The New York Times that an upside-down American flag had been temporarily raised over the Alito household in the days after January 6, 2021.",
    "url": "https://www.lawdork.com/p/washington-post-bombshell-washington"
  },
  {
    "text": "Wife of Justice Alito called upside-down flag ‘signal of distress’  —  In January 2021, Martha-Ann Alito said the flag, a symbol embraced by election deniers, was raised outside her home in response to a neighborhood dispute.  —  The wife of Supreme Court Justice Samuel A. Alito Jr. told … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/25/alito-flag-martha-ann-washington-post/"
  },
  {
    "text": "Trump booed and heckled by raucous crowd at Libertarian convention  —  Presidential candidate Donald Trump was booed and heckled by many in a raucous audience at the Libertarian National Convention on Saturday night, a marked change from the adulation he receives at rallies from his fervently loyal supporters.",
    "url": "https://www.reuters.com/world/us/trump-booed-heckled-by-raucous-crowd-libertarian-convention-2024-05-26/"
  },
  {
    "text": "‘No wannabe dictators!’:  Donald Trump booed at Libertarian convention  —  Jeers suggest Republican presidential candidate faces a challenge in broadening his appeal  —  Donald Trump, the former US president, has suffered the rare humiliation of getting booed and heckled during a raucous speech to the Libertarian National Convention.",
    "url": "https://www.theguardian.com/us-news/article/2024/may/26/no-wannabe-dictators-donald-trump-booed-at-libertarian-convention"
  },
  {
    "text": "Trump to announce plans to commute ‘Silk Road’ website operator Ross Ulbricht's prison sentence  —  The former president has previously called for the death penalty for some drug traffickers, depending on the severity of the crime.  —  WASHINGTON — Former President Donald Trump plans … ",
    "url": "https://www.nbcnews.com/politics/2024-election/trump-commute-silk-road-website-operator-ross-ulbrichts-life-prison-se-rcna154082"
  },
  {
    "text": "Hillary Clinton Has Some Tough Words for Democrats, and for Women  —  In an interview for a forthcoming book, Mrs. Clinton also suggested that if Donald Trump won in November “we may never have another actual election.”  —  Hillary Clinton criticized her fellow Democrats over what she described … ",
    "url": "https://www.nytimes.com/2024/05/25/us/politics/hillary-clinton-abortion.html"
  },
  {
    "text": "Netanyahu's split with Biden and the Democrats was years in the making  —  The Israeli leader's longtime strategy of aligning with the GOP has helped shatter the American consensus behind Israel.  —  When President Barack Obama hosted Prime Minister Benjamin Netanyahu in the Oval Office in 2014 … ",
    "url": "https://www.washingtonpost.com/politics/2024/05/26/netanyahu-embrace-republicans-strategy-israel-divisions/"
  },
  {
    "text": "Trump's new policy wonks are proteges of Stephen Miller and Newt Gingrich … - Haley and Worthington write the first drafts of scripts Trump uses to record policy videos as well as the text on how a second Trump administration would handle issues from education to energy and immigration.",
    "url": "https://www.axios.com/2024/05/26/trump-campaign-policy-stephen-miller-newt-gingrich"
  },
  {
    "text": "Even as Violent Crime Drops, Lawlessness Rises as an Election Issue  —  In most cities, rates of homicide and violent assault are down significantly from pandemic-era highs.  But property crimes have risen, fueling voter anxiety.  —  In mid-2020, the country was reeling from a surge … ",
    "url": "https://www.nytimes.com/2024/05/26/us/politics/crime-biden-trump.html"
  },
  {
    "text": "Russia Steps Up a Covert Sabotage Campaign Aimed at Europe  —  Russian military intelligence, the G.R.U., is behind arson attacks aimed at undermining support for Ukraine's war effort, security officials say.  —  U.S. and allied intelligence officials are tracking an increase … ",
    "url": "https://www.nytimes.com/2024/05/26/us/politics/russia-sabotage-campaign-ukraine.html"
  },
  {
    "text": "The Hard Problem of Bringing Trump Into Focus  —  For all the news that the former president makes, the Biden team is struggling to make the campaign about him.  —  The video shows Donald Trump standing at a gilded lectern in Mar-a-Lago.  It's December, a week or so before Christmas … ",
    "url": "https://www.nytimes.com/2024/05/26/magazine/trump-reaction-videos-biden-campaign.html"
  },
  {
    "text": "Lithuanians vote in presidential election overshadowed by Russia  —  Lithuania holds presidential elections on Sunday, with incumbent Gitanas Nauseda expected to win after a campaign dominated by security concerns in the post-Soviet state.  —  The Baltic nation of 2.8 million people … ",
    "url": "https://www.reuters.com/world/europe/lithuanians-vote-presidential-election-overshadowed-by-russia-2024-05-26/"
  },
  {
    "text": "Pronouns and tribal affiliations are now forbidden in South Dakota public university employee emails  —  A new South Dakota policy to stop the use of gender pronouns by public university faculty and staff in official correspondence is also keeping Native American employees from listing … ",
    "url": "https://apnews.com/article/pronouns-tribal-affiliation-south-dakota-66efb8c6a3c57a6a02da0bf4ed575a5f"
  },
  {
    "text": "Uvalde families sue Meta and Call of Duty maker on second anniversary of school attack  —  Families in Uvalde took more legal action Friday on the second anniversary of the Robb Elementary School attack, suing Meta Platforms, which owns Instagram, and the maker of the video game Call of Duty … ",
    "url": "https://apnews.com/article/uvalde-shooting-elementary-anniversary-texas-a20e7fefa9d66058a8ff6611fa808df8"
  }
]