[
  {
    "text": "Statement from President Joe Biden on House GOP's Baseless Impeachment of Secretary Mayorkas  —  History will not look kindly on House Republicans for their blatant act of unconstitutional partisanship that has targeted an honorable public servant in order to play petty political games.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/02/13/statement-from-president-joe-biden-on-house-gops-baseless-impeachment-of-secretary-mayorkas/"
  },
  {
    "text": "Democrats Propose Discharge Petition to Get Past Mike Johnson  —  Senior Democrats are suggesting that a discharge petition could be introduced to bring a $95-billion overseas aid bill to a vote in the House of Representatives if Speaker Mike Johnson refuses to introduce it.",
    "url": "https://www.newsweek.com/democrats-propose-discharge-petition-get-past-mike-johnson-1869521"
  },
  {
    "text": "House GOP impeaches Mayorkas by a single vote  —  Breaking: House impeaches Homeland Security Secretary Alejandro Mayorkas, succeeding on second try, in a rebuke of Biden's immigration policy.  The resolution is non-binding, however, and may not go very far in the Senate because even some Republicans … ",
    "url": "https://www.washingtonpost.com/politics/2024/02/13/mayorkas-impeachment-seccond-house-vote/"
  },
  {
    "text": "Here's the latest on the impeachment vote.  —  House Republicans Impeach Mayorkas for Border Policies  —  In a redo of their first failed attempt, Republicans pushed through the charges over solid Democratic opposition, making the homeland security secretary the first sitting cabinet member to be impeached.",
    "url": "https://www.nytimes.com/live/2024/02/13/us/mayorkas-impeachment"
  },
  {
    "text": "After facing off with Senate ‘Freedom Caucus’, McConnell urges Johnson on Ukraine  —  But the GOP leader did not push the speaker to bring up the Senate-passed foreign aid bill, specifically.  —  The Ukraine fight has been a painful one for Mitch McConnell, fueling conservative calls … ",
    "url": "https://www.politico.com/news/2024/02/13/mcconnell-johnson-ukraine-aid-senate-00141201"
  },
  {
    "text": "Republicans Are No Longer a Political Party  —  It's become yet another subsidiary of Trump Inc.  —  When historians chronicle the end of the Grand Old Party, they may mark 2024 as the turning point.  Something called the Republican Party will surely exist for years to come … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/02/republicans-are-no-longer-political-party/677437/"
  },
  {
    "text": "High School Girls Basketball Team Quits After Crowd Allegedly Spews Racial Slurs  —  School officials in Scarsdale and East Ramapo have announced an investigation into the incident.  —  A high school girls' basketball game in Scarsdale, New York came to an early finish on Saturday … ",
    "url": "https://www.thedailybeast.com/high-school-girls-basketball-team-quits-after-crowd-spews-racial-slurs-report-says"
  },
  {
    "text": "Racial slurs spewed at Scarsdale v. East Ramapo girls basketball game, officials say  —  Scarsdale and East Ramapo school officials are investigating a reported racially charged incident during a Feb. 10 girls basketball game at Scarsdale.  It's the latest investigation into slurs being spewed during a Section 1 sporting event.",
    "url": "https://www.lohud.com/story/news/local/westchester/scarsdale/2024/02/13/racial-slurs-scarsdale-east-ramapo-ny-basketball-game-reported-investigated/72570529007/"
  },
  {
    "text": "Democrats flip Santos's New York House seat in high-stakes special election  —  Former Rep. Tom Suozzi (D) has won back his old seat in the House, giving Democrats a critical pickup that will further narrow the GOP House majority, according to a projection from Decision Desk HQ.",
    "url": "https://thehill.com/homenews/campaign/4465973-tom-suozzi-democrats-mazi-pillip-george-santos-new-york/"
  },
  {
    "text": "It took me three tries to register to vote — and I'm a voting reporter  —  Votebeat is a nonprofit news organization reporting on voting access and election administration across the U.S.  —  A version of this post was originally distributed in Votebeat's free weekly newsletter.",
    "url": "https://www.votebeat.org/2024/02/12/natalia-contreras-register-to-vote-texas-roadblocks/"
  },
  {
    "text": "Bloodbath at CBS News claims senior correspondent embroiled in First Amendment case — and another who weathered HR probe: sources  —  Several CBS News reporters were caught up in layoffs at Paramount Global that claimed 800 jobs, including one who is embroiled in a high-stakes First Amendment fight … ",
    "url": "https://nypost.com/2024/02/13/media/bloodbath-at-cbs-news-includes-reporter-fighting-first-amendment-case/"
  },
  {
    "text": "‘Cowboys for Trump’ founder is hoping a Supreme Court ruling on ballot eligibility could help him too  —  Couy Griffin was thrown out of office in New Mexico under the same theory Colorado voters are seeking to use against former President Donald Trump.  —  WASHINGTON — Couy Griffin … ",
    "url": "https://www.nbcnews.com/politics/supreme-court/cowboys-trump-founder-supreme-court-rcna138476"
  },
  {
    "text": "Tesla worker killed in fiery crash may be first ‘Full Self-Driving’ fatality  —  Evidence suggests the advanced driver-assistance system was engaged during a fatal crash that killed recruiter Hans von Ohain in 2022  —  The following footage obtained by The Washington Post shows Colorado … ",
    "url": "https://www.washingtonpost.com/technology/interactive/2024/tesla-full-self-driving-fatal-crash/"
  },
  {
    "text": "Wisconsin lawmakers adopt new legislative maps that could undo gerrymandering  —  Votes by Republican-dominated state assembly and state senate signal that the years-long battle may be finally drawing to a close  —  The fight for democracy is supported by  —  Wisconsin lawmakers voted … ",
    "url": "https://www.theguardian.com/us-news/2024/feb/13/wisconsin-senate-new-voter-maps-gerrymandering"
  },
  {
    "text": "Marjorie Taylor Greene's Rant At ‘Curb Your Enthusiasm’ Is Comedy Gold  —  The far-right congresswoman better watch out for those “nasty commies” from California.  —  LOADING  —  Rep. Marjorie Taylor Greene (R-Ga.) took her far-right views to another dimension Tuesday in a wild screed against HBO's “Curb Your Enthusiasm.”",
    "url": "https://www.huffpost.com/entry/marjorie-taylor-greene-curb-your-enthusiasm_n_65cb92bfe4b01f4a8b026670"
  },
  {
    "text": "Democrats on track to maintain majority in Pennsylvania state House  —  Democratic school board member Jim Prokopiak appeared on track to represent Pennsylvania's 140th state House district in Tuesday's special election, signaling the party will likely maintain its majority in the state's lower chamber.",
    "url": "https://thehill.com/homenews/campaign/4466050-democrats-on-track-to-maintain-majority-in-pennsylvania-state-house/"
  },
  {
    "text": "Axios BFD: Kushner says he's not looking to return to White House  —  Jared Kushner said he plans to sit out a potential second Trump administration in an interview at the Axios BFD conference in Miami on Tuesday, saying he's committed to his work with his investment firm, Affinity Partners.",
    "url": "https://www.axios.com/2024/02/13/jared-kushner-trump-white-house-2024"
  },
  {
    "text": "Hunter Biden's phone contained multiple photos of cocaine, crack cocaine and drug paraphernalia: DOJ  —  Hunter Biden had images on his iPhone of his alleged illegal drug use  —  Join Fox News for access to this content  —  Plus get unlimited access to thousands of articles, videos and more with your free account!",
    "url": "https://www.foxnews.com/politics/hunter-bidens-phone-contained-multiple-photos-cocaine-crack-cocaine-drug-paraphernalia-doj"
  }
]