[
  {
    "text": "Robert F. Kennedy Jr. tried to meet with Kamala Harris to discuss Cabinet job  —  Harris has rebuffed the offer of an endorsement, while Kennedy has also had conversations with Republican nominee Donald Trump about a role in his administration.  —  Independent presidential candidate Robert … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/14/rfk-jr-kamala-harris-cabinet-trump/"
  },
  {
    "text": "Trump Allies Fear He's Sabotaging His Own Campaign  —  The former president can't get over feeling “cheated” by Joe Biden's exit from the race, says one source, while another speculates he might “have PTSD” following last month's assassination attempt.  —  In the hierarchy of Donald Trump's put-downs … ",
    "url": "https://www.vanityfair.com/news/story/trump-allies-fear-sabotaging-campaign"
  },
  {
    "text": "Trump Keeps Watching Clip of Himself Being Shot at: ‘May Legit Have PTSD’  —  ‘OVER AND OVER AGAIN’  —  Sources close to the ex-president's campaign have said he's particularly fixated on a single seven-second clip.  —  Those close to Donald Trump fear the former president “may have legit PTSD” … ",
    "url": "https://www.thedailybeast.com/trump-keeps-watching-clip-of-himself-being-shot-may-legit-have-ptsd"
  },
  {
    "text": "Fox News Poll: New matchup, same result — Trump bests Harris by one point  —  Highest share of voters in over two years rate their personal finances positively  —  Join Fox News for access to this content  —  No matter how many major events intervene, and goodness knows there have been several … ",
    "url": "https://www.foxnews.com/official-polls/fox-news-poll-new-matchup-same-result-trump-bests-harris-one-point"
  },
  {
    "text": "Where Harris has improved the most on Biden  —  She's doing much better than Biden in every swing state.  —  ∙ Paid  —  I'll have a story forthcoming for you later this week — if I can find the time in between the zillion podcasts I'm doing — on renewed GOP efforts to “unskew the polls”.",
    "url": "https://www.natesilver.net/p/where-harris-has-improved-the-most"
  },
  {
    "text": "Jump in Enthusiasm for 2024 Race  —  Harris picks up support among young voters and ‘double haters’  —  West Long Branch, NJ - Democrats' enthusiasm has skyrocketed since they swapped their presidential nominee.  The latest national Monmouth (\"Mon-muth\") University Poll finds voter support … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_us_081424/"
  },
  {
    "text": "JD Vance in 2020 agreed grandmothers raising children is ‘whole purpose of the postmenopausal female’  —  While appearing on “The Portal” podcast in April 2020, Sen. JD Vance (R-OH) agreed with host Eric Weinstein's claim that “postmenopausal females” exist just to help take care of children.",
    "url": "https://heartlandsignal.com/2024/08/14/jd-vance-in-2020-agreed-grandmothers-raising-children-is-whole-purpose-of-the-postmenopausal-female/"
  },
  {
    "text": "J.D. Vance's Weird Thoughts on Older Women Exposed in New Audio … J.D. Vance's views on gender and parenting have come back to haunt him, again.  —  In 2020, long before he entered politics, Vance appeared on a podcast where the host said that having grandmothers help raise children is … ",
    "url": "https://newrepublic.com/post/184888/jd-vance-weird-thoughts-older-women-postmenopausal-female-audio"
  },
  {
    "text": "Ukraine says it has taken more ground and prisoners during its advance into Russia border region  —  Russia says it thwarted Ukrainian charge to expand its incursion across border  —  Remnants of war left in border area as Ukraine claims more advances in Russia incursion",
    "url": "https://apnews.com/article/russia-ukraine-war-kursk-incursion-6f65e2d6b295e898f4a59118a2c0c735"
  },
  {
    "text": "Russians fleeing Ukraine's incursion say Putin has abandoned them  —  ‘Lies are causing civilians to die’, says resident of town captured by Kyiv's forces  —  On the day Ukrainian forces started rolling into Russia's Kursk region, a group of about 40 people, mostly women, filmed a video about what was happening in their town.",
    "url": "https://www.ft.com/content/c7c40edb-9eba-41c3-916d-566b6b036c29"
  },
  {
    "text": "Arizona court: Fetus can be referred to as ‘unborn human being’ in abortion measure voter pamphlet  —  PHOENIX (AP) — An informational pamphlet for voters who will decide whether to guarantee the constitutional right to an abortion can refer to a fetus as an “unborn human being,” the Arizona Supreme Court ruled Wednesday.",
    "url": "https://apnews.com/article/arizona-abortion-rights-ballot-measure-b0ea37c92692533da109fd74a07b25f7"
  },
  {
    "text": "Prepare for Trump to be sentenced to prison on September 18  —  The objective here is to enable VP Kamala Harris and the media-Democratic complex to label Trump ‘a convicted felon sentenced to prison’ as voting begins  —  To the surprise of no one, Judge Juan Merchan has yet again denied … ",
    "url": "https://www.foxnews.com/opinion/andrew-mccarthy-prepare-trump-sentenced-prison-september-18"
  },
  {
    "text": "Google says Iranian efforts to hack US presidential campaigns are ongoing and wide-ranging  —  Google said Wednesday that an alleged Iranian hacking operation aimed at US presidential campaigns is ongoing and more wide-ranging than previously known as the hackers continue to target … ",
    "url": "https://www.cnn.com/2024/08/14/politics/google-iran-hacking-presidential-election"
  },
  {
    "text": "George Helmy will be new U.S. Senator from New Jersey  —  Gov. Phil Murphy intends to appoint George S. Helmy, his former chief of staff, to the United States Senate to replace Bob Menendez, the New Jersey Globe has confirmed.  —  Murphy is expected to formally offer Helmy the post on Thursday … ",
    "url": "https://newjerseyglobe.com/congress/george-helmy-will-be-new-u-s-senator-from-new-jersey/"
  },
  {
    "text": "Donald Trump rally in Asheville live updates: Thomas Wolfe Auditorium is full  —  Former President Donald Trump is in Asheville today, Aug. 14, to hold a campaign rally in his bid to regain the presidency in the Nov. 5 general election.  It is Trump's first campaign visit to Asheville since September 2016 … ",
    "url": "https://www.citizen-times.com/story/news/local/2024/08/14/trump-asheville-rally-republican-live-coverage/74787771007/"
  },
  {
    "text": "Trump effort to push back oral arguments in case against Fani Willis denied … - Postponed oral arguments were requested by Trump's lawyer Steve Sadow to accommodate a pre-paid international trip with his wife to celebrate his 70th birthday and their 45th wedding anniversary, the Atlanta Journal-Constitution reported.",
    "url": "https://www.axios.com/2024/08/14/fani-willis-oral-arguments-december-trump"
  },
  {
    "text": "Former Trump aides claim Donald is in ‘meltdown’ and ‘feels the election is slipping from him’... so is ‘lighting up the campaign’  —  Donald Trump is ‘lighting up’ his campaign staffers as he hunkers down at Mar-a-Lago, two former aides have claimed.  —  The former president's reported meltdown comes … ",
    "url": "https://www.dailymail.co.uk/news/article-13741377/Inside-Trumps-meltdown-Ex-president-lighting-staff-hes-p-ssed-picking-JD-Vance-insiders-fear-hes-going-fire-two-extremely-talented-campaign-gurus.html"
  },
  {
    "text": "Biden harbors lingering frustration at Pelosi, Obama, Schumer  —  Ahead of the convention that's meant to unify the party, tensions still remain.  —  President Joe Biden is frustrated that Barack Obama wouldn't tell him to his face that he should leave the race.",
    "url": "https://www.politico.com/news/2024/08/14/biden-frustration-obama-pelosi-00173883"
  },
  {
    "text": "GOP pollster on Trump-Harris: 'I haven't seen anything like this'  —  Republican pollster Frank Luntz appears stunned at the current state of the Kamala Harris-Donald Trump matchup and this year's presidential election.  —  Luntz, who's been called “The Nostradamus of pollsters” … ",
    "url": "https://www.nj.com/politics/2024/08/gop-pollster-on-trump-harris-i-havent-seen-anything-like-this.html"
  },
  {
    "text": "South Korea's Yoon Offers Rare Olive Branch to Kim Jong Un  — Seoul to keep offering humanitarian aid to North, Yoon says  — Yoon proposes new group for talks and cooperation with North  —  South Korean President Yoon Suk Yeol offered aid, dialogue and a path to unification to North Korea … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-15/south-korea-s-yoon-offers-rare-olive-branch-to-kim-jong-un"
  }
]