[
  {
    "text": "Shadowing Trump's attacks on mental fitness — his own father's dementia  —  Trump avoids mention of his father's Alzheimer's disease as he lashes Biden for being ‘cognitively impaired’  —  Donald Trump invited his extended family to Mar-a-Lago in the mid-1990s.",
    "url": "https://www.washingtonpost.com/politics/2024/03/20/donald-trump-dementia-father-fred-alzheimers-biden/"
  },
  {
    "text": "Playbook: Sherrod Brown's dilemma  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  ABOUT LAST NIGHT — The biggest story from yesterday's elections was in Ohio, where former car dealer BERNIE MORENO … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/03/20/sherrod-browns-dilemma-00147970"
  },
  {
    "text": "3 takeaways from primaries in Illinois, Ohio and elsewhere  —  With the general-election matchup between President Biden and former president Donald Trump solidified as of last week, Tuesday began the process of filling out the ballot in some key House and Senate races.",
    "url": "https://www.washingtonpost.com/politics/2024/03/19/gop-primaries-ohio-illinois-election-takeaways/"
  },
  {
    "text": "Trump's “crazies” are back in his mix … - They're returning as Trump more aggressively touts Jan. 6 rioters as “patriots,” ramps up his racist, incendiary rhetoric — and embraces some of his most provocative loyalists. … - Trump's team is in talks to hire 2016 campaign advisers Paul Manafort … ",
    "url": "https://www.axios.com/2024/03/20/trump-far-righters-return"
  },
  {
    "text": "Trump-backed Bernie Moreno wins Ohio GOP Senate primary  —  Trump-backed candidate Bernie Moreno has won the Republican nomination for Senate in Ohio to face off against incumbent Sen. Sherrod Brown (D) this November, according to Decision Desk HQ.  —  Moreno, a former car dealership owner … ",
    "url": "https://thehill.com/homenews/campaign/4542855-bernie-moreno-donald-trump-ohio-primary-senate-matt-dolan/"
  },
  {
    "text": "Playbook: Ukraine loan gains steam in GOP  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  HAPPY ANNIVERSARY — Today marks the 45th anniversary of live gavel-to-gavel TV coverage of Congress, with C-SPAN first broadcasting the House of Representatives on March 19, 1979.",
    "url": "https://www.politico.com/newsletters/playbook/2024/03/19/ukraine-loan-gains-steam-in-gop-00147717"
  },
  {
    "text": "This state senator eviscerated Trump's voter fraud claims.  Now, he's back on the Trump train.  —  Ed McBroom, a GOP state senator in Michigan who batted down voter fraud claims as part of a lengthy 2021 probe, explained his endorsement in an interview with NBC News.",
    "url": "https://www.nbcnews.com/politics/2024-election/ed-mcbroom-trump-voter-fraud-2024-rcna143942"
  },
  {
    "text": "Trump saluted the J6 Prison Choir.  It likely included defendants who attacked cops  —  Former President Donald Trump's campaign rally in Ohio last Saturday began with an announcer asking the crowd to stand for the national anthem.  But this wasn't just a typical rendition of the … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/03/20/donald-trump-jan-6-hostages-campaign/73023337007/"
  },
  {
    "text": "Judge Aileen Cannon Could Get Herself Booted From Trump's Classified Documents Case  —  The Trump-friendly judge is so obviously putting her thumb on the scales of justice in favor of the ex-president that she might not end up adjudicating the trial at all.",
    "url": "https://www.thedailybeast.com/judge-aileen-cannon-could-get-herself-booted-from-trumps-classified-documents-case"
  },
  {
    "text": "Judge in Trump classified documents case proposes ‘insane’ jury instructions, experts say  —  U.S. District Judge Aileen Cannon proposed to instruct jurors a president has sole authority to declare records personal, which legal experts say would amount to dismissing the case against Trump.",
    "url": "https://www.usatoday.com/story/news/politics/2024/03/19/donald-trump-classified-documents-jury-instructions/73027873007/"
  },
  {
    "text": "Divided Supreme Court lifts stay on a Texas law giving police broad powers to arrest migrants  —  A divided Supreme Court on Tuesday allowed Texas to begin enforcing a law that gives police broad powers to arrest migrants suspected of crossing the border illegally while a legal battle over the measure plays out.",
    "url": "https://apnews.com/article/supreme-court-migrant-arrests-texas-13ffaed316d16f42e928f6958f0658f2"
  },
  {
    "text": "Mexico Condemns Texas Law, and Says It Will Not Accept Deportations From the State  —  Mexico's top diplomat for North America rejected the Supreme Court's ruling, saying that immigration policy was something to be negotiated between federal governments.  —  Mexico will not accept deportations … ",
    "url": "https://www.nytimes.com/2024/03/19/us/mexico-texas-border-immigration.html"
  },
  {
    "text": "McCaul apologizes after telling GOP colleague to ‘go f—’ himself at hearing  —  Rep. Michael McCaul (R-Texas) apologized for hurling an expletive at a GOP colleague after growing frustrated during a House committee hearing Tuesday.  —  McCaul told Rep. Darrell Issa (R-Calif.) to “go f … ",
    "url": "https://thehill.com/homenews/house/4543218-mccaul-apologizes-after-telling-gop-colleague-to-go-f-himself-at-hearing/"
  },
  {
    "text": "Arizona lawmaker says she announced plans to get abortion to underscore out-of-touch laws  —  Democratic Sen. Eva Burch of Mesa told fellow lawmakers in a floor speech she was going to get an abortion because her pregnancy is no longer viable.  —  PHOENIX — A pregnant Arizona lawmaker … ",
    "url": "https://www.politico.com/news/2024/03/19/arizona-lawmaker-says-she-announced-plans-to-get-abortion-to-underscore-out-of-touch-laws-00147899"
  },
  {
    "text": "Banning abortion was the first step, not the last  —  They also won't stop with ending privacy rights. … When the United States Supreme Court overturned Roe v. Wade in 2022's Dobbs v. Jackson Women's Health Organization, Justice Samuel Alito's majority opinion smugly declared that … ",
    "url": "https://www.publicnotice.co/p/scotus-banning-abortion-was-the-first-step"
  },
  {
    "text": "FACT SHEET: President Biden Announces Up To $8.5 Billion Preliminary Agreement with Intel under the CHIPS & Science Act  —  Funding catalyzes $100 billion in private investment from Intel to build and expand semiconductor facilities in Arizona, Ohio, New Mexico, and Oregon and create nearly 30,000 jobs",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/03/20/fact-sheet-president-biden-announces-up-to-8-5-billion-preliminary-agreement-with-intel-under-the-chips-science-act/"
  },
  {
    "text": "Gloomy youth pull US and western Europe down global happiness ranking  —  Rising unhappiness among younger people has caused the United States and some large western European countries to fall down a global wellbeing index, while Nordic nations retain their grip on the top spots.",
    "url": "https://www.reuters.com/lifestyle/gloomy-youth-pull-us-western-europe-down-global-happiness-ranking-2024-03-20/"
  },
  {
    "text": "Radicalized by the right: Elon Musk puts his conspiratorial thinking on display for the world to see  —  Editor's Note: A version of this article first appeared in the “Reliable Sources” newsletter.  Sign up for the daily digest chronicling the evolving media landscape here.",
    "url": "https://ca.finance.yahoo.com/news/radicalized-elon-musk-puts-conspiratorial-055858883.html"
  },
  {
    "text": "Obama-appointee and liberal Illinois federal judge rules illegal migrants can carry guns legally  — US District Judge Sharon Johnson Coleman ruled earlier this month that an illegal immigrant could not be charged for carrying a loaded firearm  — The ruling comes as the Biden administration continues … ",
    "url": "https://www.dailymail.co.uk/news/article-13214823/Obama-liberal-Illinois-judge-illegal-migrants-guns.html"
  },
  {
    "text": "Manchin warns Ukraine could be ‘worst atrocity in history’  —  Sen. Joe Manchin (D-W.Va.) urged Congress to pass Ukraine aid and warned that lack of assistance could lead to the embattled country facing the “worst atrocity in history.”  —  Machin's call for passing foreign assistance comes … ",
    "url": "https://thehill.com/homenews/senate/4543449-manchin-warns-ukraine-could-be-worst-atrocity-in-history/"
  }
]