[
  {
    "text": "Former U.S. President Jimmy Carter, 100, dies  —  Former President Jimmy Carter, a man who redefined what a post-presidency could be, died Sunday.  He was 100.  —  His son, Chip Carter confirmed that the former president died at his home in Plains about 3:45 p.m.",
    "url": "https://www.ajc.com/news/former-us-president-jimmy-carter-100-dies/3ODQTR5NHVDTDF2SXOU34MKNZM/"
  },
  {
    "text": "Jimmy Carter, 39th president and Nobel Peace Prize winner, dies at 100, his son says  —  The tenacious Southerner was turned out of office by disillusioned voters after a single term.  But he had a brilliant post-presidential career as a champion of health, peace and democracy.",
    "url": "https://www.washingtonpost.com/obituaries/2024/12/29/jimmy-carter-president-dead/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM1NDQ4NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM2ODMwNzk5LCJpYXQiOjE3MzU0NDg0MDAsImp0aSI6ImIyOGMzM2Y2LWRjMTEtNGU1Yi04MTdhLTM5NmJhMzZiZjlhZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vYml0dWFyaWVzLzIwMjQvMTIvMjkvamltbXktY2FydGVyLXByZXNpZGVudC1kZWFkLyJ9.5hacu3sUlxvwEvfhnZiok-C7ncbr5tSzNkNltovrmyg&itid=gfta"
  },
  {
    "text": "Statement by President Joe Biden and First Lady Jill Biden on the Passing of Former President Jimmy Carter  —  Today, America and the world lost an extraordinary leader, statesman, and humanitarian.  —  Over six decades, we had the honor of calling Jimmy Carter a dear friend.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/29/statement-by-president-joe-biden-and-first-lady-jill-biden-on-the-passing-of-former-president-jimmy-carter/"
  },
  {
    "text": "11 facts about Jimmy Carter that may surprise you  —  The peanut farmer-turned-president, who died Sunday at 100, put solar panels on the White House and once spent 89 seconds inside a melting nuclear reactor.  —  Jimmy Carter, the Georgia peanut farmer who became the 39th president of the United States … ",
    "url": "https://www.washingtonpost.com/nation/2024/12/29/jimmy-carter-facts-surprising/"
  },
  {
    "text": "Updates: Jimmy Carter Dies at 100  —  The former president, a peanut farmer and Democrat from Georgia, was known as much for his charity and diplomatic work later in life as he was for his single presidential term, which ended in 1981.  —  He lived longer than any other U.S. president.",
    "url": "https://www.nytimes.com/live/2024/12/29/us/jimmy-carter"
  },
  {
    "text": "Jimmy Carter, Peacemaking President Amid Crises, Is Dead at 100  —  Rising from Georgia farmland to the White House, he oversaw the historic Camp David peace accords, but his one-term presidency was waylaid by troubles at home and abroad.  —  Jimmy Carter, who rose from Georgia farmland … ",
    "url": "https://www.nytimes.com/2024/12/29/us/politics/jimmy-carter-dead.html"
  },
  {
    "text": "Biden lauds former President Jimmy Carter's decency and character in remarks  —  Biden remembered Carter, who died Sunday, as someone who “lived a life measured not by words, but by his deeds.”  —  President Joe Biden mourned the death of former President Jimmy Carter in an address … ",
    "url": "https://www.nbcnews.com/politics/joe-biden/biden-delivers-remarks-death-former-president-jimmy-carter-rcna185711"
  },
  {
    "text": "Former U.S. President Jimmy Carter Passes Away at 100  —  Jimmy Carter, 39th president of the United States and winner of the 2002 Nobel Peace Prize, died peacefully Sunday, Dec. 29, at his home in Plains, Georgia, surrounded by his family.  He was 100, the longest-lived president in U.S. history.",
    "url": "https://www.cartercenter.org/news/pr/2024/statement-on-president-jimmy-carter-122924.html"
  },
  {
    "text": "Statement by Vice President Kamala Harris on the Passing of Former President Jimmy Carter  —  President Jimmy Carter was guided by a deep and abiding faith — in God, in America, and in humanity.  —  Jimmy Carter's life is a testament to the power of service — as a Lieutenant in the United States Navy … ",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/12/29/statement-by-vice-president-kamala-harris-on-the-passing-of-former-president-jimmy-carter/"
  },
  {
    "text": "Proclamation Announcing the Death of James Earl Carter, Jr.  —  TO THE PEOPLE OF THE UNITED STATES:  —  It is my solemn duty to announce officially the death of James Earl Carter, Jr., the thirty-ninth President of the United States, on December 29, 2024.  —  President Carter was a man … ",
    "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2024/12/29/proclamation-announcing-the-death-of-james-earl-carter-jr/"
  },
  {
    "text": "Trump Finally Takes Sides in The Civil War Tearing MAGA Apart  —  President-elect Donald Trump finally spoke out on the civil war driving a wedge between growing factions in the MAGA movement—and he's thrown his weight behind his new pal Elon Musk.With Trump's inauguration still more than 20 days away … ",
    "url": "https://www.thedailybeast.com/trump-knifes-maga-loyalists-to-back-sidekick-musk-on-h-1b-visas/"
  },
  {
    "text": "Elon Musk Is a National Security Risk  —  It is now fair to ask the question: Is Elon Musk a national security risk?  —  According to numerous interviews and remarks, Mr. Musk's Department of Government Efficiency co-leader, Vivek Ramaswamy, once appeared to believe he was.",
    "url": "https://www.nytimes.com/2024/12/29/opinion/elon-musk-china-classified-secrets-national-security-russia-doge.html?unlocked_article_code=1.lE4.XzKs.DOmVI6bFotpM&smid=bs-share"
  },
  {
    "text": "The Speakership Election in the 119th Congress  — The 119th Congress officially begins at noon on Friday.  For the second Congress in a row, we are faced with the prospect of a contested Speakership election at the outset of the Congress.  Below are (1) some background materials … ",
    "url": "https://mattglassman.substack.com/p/the-speakership-election-in-the-119th"
  },
  {
    "text": "In shift, Trump downgrades soaring rhetoric on campaign promises  —  President-elect Trump on the campaign trail made grandiose promises to voters to bring down costs quickly, to end the war in Ukraine before he even took office and to use tariffs to bolster the U.S. economy and manufacturing.",
    "url": "https://thehill.com/homenews/administration/5051314-trump-campaign-promises-difficulties/"
  },
  {
    "text": "Trump blasts GOP, McCarthy over debt ceiling  —  President-elect Trump on Sunday harshly criticized the House GOP, and former Speaker Kevin McCarthy (R-Calif.), for voting to raise the debt ceiling in 2023 through Jan. 1, 2025.  —  Trump in a post on Truth Social called McCarthy … ",
    "url": "https://thehill.com/homenews/administration/5059408-trump-criticizes-house-gop-debt-ceiling/"
  },
  {
    "text": "Biden ‘deeply saddened’ by Jeju Air accident in South Korea  —  President Biden said he was “deeply saddened” by the Jeju Air accident in South Korea that left nearly 180 people dead.  —  “Jill and I are deeply saddened to learn of the loss of life that occurred as a result of the Jeju Airlines accident … ",
    "url": "https://thehill.com/policy/international/5059117-biden-deeply-saddened-by-jeju-airlines-accident-south-korea/"
  },
  {
    "text": "GOP Gov. Claims Musk Is Too Rich to Be Corrupted by Conflicts of Interest  —  “He's so rich he's removed from the potential financial influence,” Gov. Chris Sununu alleged  —  Republican Gov. Chris Sununu said that Elon Musk is “so rich” that he is “removed from the potential financial influence” … ",
    "url": "https://www.rollingstone.com/politics/politics-news/sununu-musk-too-rich-conflicts-of-interest-1235220668/"
  }
]