[
  {
    "text": "Special counsel probed Trump Mar-a-Lago trip that aides ‘kept quiet’ weeks before FBI search: Sources  —  One witness was told Trump was “checking on the boxes,” sources said.  —  In this June 9, 2017, file photo, President Donald Trump is shown at the White House in Washington, D.C.",
    "url": "https://abcnews.go.com/US/special-counsel-probed-trump-mar-lago-trip-aides/story?id=111334156"
  },
  {
    "text": "Texas abortion ban linked to 13% increase in infant and newborn deaths  —  “This might foreshadow what is happening in other states,” said Johns Hopkins public health researcher Alison Gemmill.  “Texas is basically a year ahead.”  —  A Texas law that banned abortions in early pregnancy … ",
    "url": "https://www.nbcnews.com/health/health-news/texas-abortion-ban-linked-rise-infant-newborn-deaths-rcna158375"
  },
  {
    "text": "Days before debate, Trump spokesperson clashes with CNN anchor on air  —  “We're going to stop this interview if you're going to keep attacking my colleagues,” Kasie Hunt said.  —  A Donald Trump spokesperson got into a tense exchange with CNN's Kasie Hunt over debate hosts Dana Bash … ",
    "url": "https://www.politico.com/news/2024/06/24/trump-debate-cnn-00164658"
  },
  {
    "text": "Bankruptcy trustee discloses plan to shut down Alex Jones' Infowars and liquidate assets  —  A U.S. bankruptcy court trustee is planning to shut down conspiracy theorist Alex Jones' Infowars media platform and liquidate its assets to help pay the $1.5 billion in lawsuit judgments Jones owes … ",
    "url": "https://apnews.com/article/alex-jones-infowars-bankruptcy-sandy-hook-e8bf9a3d11b9506abb18c285d3e7b138"
  },
  {
    "text": "What two years without Roe looks like, in 8 charts  —  For 49 years after Roe v. Wade, Americans had the right to obtain an abortion if they became pregnant.  Then, two years ago, with Dobbs v. Jackson Women's Health Organization, the Supreme Court put an end to it.",
    "url": "https://www.vox.com/explainers/356314/abortion-laws-roe-wade-dobbs-decision-mifepristone-supreme-court"
  },
  {
    "text": "Conservative-backed group is creating a list of federal workers it suspects could resist Trump plans  —  From his home office in small-town Kentucky, a seasoned political operative is quietly investigating scores of federal employees suspected of being hostile to the policies of Republican Donald Trump … ",
    "url": "https://apnews.com/article/trump-biden-president-project-2025-33d3fc2999a74f4aa424f1128dca2d16"
  },
  {
    "text": "The GOP's latest headache: A push to arrest Merrick Garland  —  This House GOP is about to add another item to their long list of abnormal events: voting to hold Attorney General Merrick Garland in “inherent contempt.”  Rep. Anna Paulina Luna (R-Fla.) said she will force a vote this week … ",
    "url": "https://www.politico.com/live-updates/2024/06/24/congress/explainer-inherent-contempt-garland-house-00164681"
  },
  {
    "text": "Lawsuit challenges new Louisiana law requiring classrooms to display the Ten Commandments  —  Civil liberties groups filed a lawsuit Monday to block Louisiana's new law that requires the Ten Commandments to be displayed in every public school classroom, a measure they contend is unconstitutional.",
    "url": "https://apnews.com/article/louisiana-ten-commandments-lawsuit-school-classroom-a1255c8383d06fc04c3bafe899b67816"
  },
  {
    "text": "Journalist shot by Minneapolis police at George Floyd protest in hospice care  —  Linda Tirado 'is at life's end' due to eye injury sustained while covering a protest in 2020  —  A journalist who was shot in the eye by Minneapolis police while covering the 2020 protests following the murder … ",
    "url": "https://www.theguardian.com/us-news/article/2024/jun/24/linda-tirado-journalist-shot-police-protests-hospice"
  },
  {
    "text": "Tennessee ban on gender transition care to be reviewed by Supreme Court  —  More than 20 states have passed bans or restrictions on gender transition care for minors since 2021.  —  The Supreme Court on Monday agreed to review a Tennessee law that bans gender transition care for people younger than 18.",
    "url": "https://www.washingtonpost.com/politics/2024/06/24/scotus-trans-minors-gender-care/"
  },
  {
    "text": "How Trump and Biden compare on running up debt … - Both candidates bear a share of the responsibility, as each added trillions to that tally while in office.  — But Trump's contribution was significantly higher, according to the fiscal watchdogs at the Committee for a Responsible Federal Budget … ",
    "url": "https://www.axios.com/2024/06/24/trump-biden-debt-deficits-election"
  },
  {
    "text": "Special counsel falters in push to limit Trump's attacks on FBI agents  —  Judge Cannon does not seem likely to rule ahead of this week's presidential debate on whether to bar Donald Trump from attacking agents involved in his case  —  FORT PIERCE, Fla. — Federal prosecutors struggled … ",
    "url": "https://www.washingtonpost.com/national-security/2024/06/24/trump-cannon-fbi-false-threats/"
  },
  {
    "text": "What Obama Is Whispering to Biden  —  The presidents' plan to save their legacy from Trump.  —  Joe Biden figured it was a good time to catch up with his old boss.  He knew Barack Obama was about to leave gray Washington for his annual Hawaiian Christmas vacation, so he invited him for lunch last December at the White House.",
    "url": "https://nymag.com/intelligencer/article/obama-biden-2024-election.html"
  },
  {
    "text": "Julian Assange has reached a plea deal with the U.S., allowing him to go free  —  The WikiLeaks founder has been held in a prison outside London for the last five years and fought extradition to the United States.  —  WASHINGTON — WikiLeaks founder Julian Assange plans to plead guilty … ",
    "url": "https://www.nbcnews.com/politics/justice-department/julian-assange-reached-plea-deal-us-allowing-go-free-rcna158695"
  },
  {
    "text": "Netanyahu walks back proposal for Gaza hostage-ceasefire deal endorsed by Biden … - More than 37,500 Palestinians have been killed in Gaza, according to local health officials.  — Netanyahu's comments contradicted statements by Biden administration officials who in recent days … ",
    "url": "https://www.axios.com/2024/06/24/netanyahu-walks-back-gaza-hostage-ceasefire-proposal"
  },
  {
    "text": "Law enforcement is spying on thousands of Americans' mail, records show  —  The Postal Service approves thousands of requests every year from police officers and federal agents seeking information from Americans' letters and packages. … The U.S. Postal Service has shared information … ",
    "url": "https://www.washingtonpost.com/technology/2024/06/24/post-office-mail-surveillance-law-enforcement/"
  },
  {
    "text": "Ethics office finds ‘substantial’ evidence Texas Republicans misused campaign funds  —  The House Ethics Committee released two reports on Monday from the Office of Congressional Ethics that conclude there is “substantial reason to believe” that Reps. Wesley Hunt (R-TX) and Ronny Jackson … ",
    "url": "https://www.washingtonexaminer.com/news/house/3057072/ethics-watchdog-substantial-evidence-texas-republicans-misused-campaign-funds/"
  },
  {
    "text": "Joe Biden's Climate Law Has Created More Than 300,000 Clean Energy Jobs  —  Donald Trump wants to gut the Inflation Reduction Act, which provides more than $369 billion in clean energy incentives.  —  LOADING  —  WASHINGTON ― U.S. companies have created more than 300,000 clean energy … ",
    "url": "https://www.huffpost.com/entry/joe-biden-300000-clean-energy-jobs_n_6679b2a6e4b097620199055e"
  }
]