[
  {
    "text": "House GOP in open warfare over doomed spending plan  —  One Republican summed up the situation neatly as leadership-empowered negotiators faceplanted with days to go before a shutdown: “It's a mess.”  —  As House Republicans began ripping apart their party's latest spending proposal … ",
    "url": "https://www.politico.com/news/2023/09/19/house-gop-spending-plan-00116631"
  },
  {
    "text": "Republicans postpone procedural vote on short-term funding deal  —  House Speaker Kevin McCarthy (R-Calif.) postponed a key procedural vote Tuesday on a measure aimed at averting a government shutdown, as Republican leaders continued to try to appease hard-right members of the party.",
    "url": "https://www.washingtonpost.com/politics/2023/09/19/house-republicans-spending-vote/"
  },
  {
    "text": "McCarthy gets tough with the right  —  Boxed in by conservatives as a shutdown looms, the embattled speaker is punching back.  —  After months tiptoeing around the conservatives who have made his speakership a constant high-wire act, House Speaker Kevin McCarthy appears to be fed up — and ready to fight.",
    "url": "https://www.politico.com/news/2023/09/19/mccarthy-gets-mean-00116702"
  },
  {
    "text": "Go ahead, gag Donald Trump  —  Special counsel Jack Smith recently filed for an extraordinary gag order against Donald Trump.  The prosecutor wants to limit Trump's ability to criticize the criminal case against him for trying to overturn his 2020 election loss.",
    "url": "https://www.washingtonpost.com/opinions/2023/09/19/donald-trump-gag-order/"
  },
  {
    "text": "‘Sound of Freedom’ Producer Felt the Naked Breasts of Apparently Underage Trafficking Victim  —  Files from a joint local and federal criminal investigation released to VICE News describe video evidence of the incident, which took place in Mexico on an Operation Underground Railroad mission.",
    "url": "https://www.vice.com/en/article/z3mq5w/sound-of-freedom-producer-underage-trafficking-victim"
  },
  {
    "text": "Marjorie Taylor Greene pens tell-all, ‘setting the record straight’  —  EXCLUSIVE — Rep. Marjorie Taylor Greene, the Georgia Republican who overcame Democratic silencing efforts to become one of the most effective voices on the Right, is getting ready to settle some scores with an autobiography … ",
    "url": "https://www.washingtonexaminer.com/news/washington-secrets/marjorie-taylor-greene-tell-all-book-autobiography"
  },
  {
    "text": "Witness testimony disputes IRS whistleblower allegations in Hunter Biden probe as Republicans begin impeachment inquiry  —  New testimony from a number of FBI and Internal Revenue Service officials casts doubt on key claims from an IRS whistleblower who alleges there was political interference … ",
    "url": "https://www.cnn.com/2023/09/19/politics/witness-testimony-disputes-irs-whistleblower-hunter-biden/"
  },
  {
    "text": "Ray Epps, subject of Tucker Carlson's Jan. 6 conspiracy theories, charged by DOJ  —  Epps entered Capitol grounds on Jan. 6 as a supporter of former President Donald Trump.  He told the Jan. 6 committee that the conspiracy theories about him ruined his life.",
    "url": "https://www.nbcnews.com/politics/justice-department/ray-epps-subject-tucker-carlsons-jan-6-conspiracy-theories-charged-doj-rcna99836"
  },
  {
    "text": "This is what taking on election deniers really looks like  —  Democrats won a whole lot of elections in 2022, in no small part on their vow to strengthen and defend democracy.  But if they hope to turn the issue into a sustained political winner, they have to deliver on that promise … ",
    "url": "https://www.washingtonpost.com/opinions/2023/09/19/josh-shapiro-automatic-voter-registration-pennsylvania-trump-maga/"
  },
  {
    "text": "‘I plan to wear a bikini’: Senate Republicans mock changes to dress code  —  The new dress code, implemented by Majority Leader Chuck Schumer, will allow Sen. John Fetterman to wear his trademark casual attire like hoodies and shorts on the Senate floor.  —  WASHINGTON — Republicans … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-republicans-mock-changes-dress-code-rcna105737"
  },
  {
    "text": "Ex-GOP Congressman Gets 22 Months in Prison for Insider Trading  — Stephen Buyer traded ahead of M&A deals after he left office  — Buyer represented Indiana in Congress between 1993 to 2011  —  A former Republican congressman from Indiana was ordered to spend 22 months in prison … ",
    "url": "https://www.bloomberg.com/news/articles/2023-09-19/ex-gop-congressman-gets-22-months-in-prison-for-insider-trading"
  },
  {
    "text": "Dr. Anthony Fauci and wife had $11 million net worth before he left government  —  Dr. Anthony Fauci and his spouse had a net worth of over $11 million when the then-director of the National Institute of Allergy and Infectious Diseases stepped down from his top government role, documents show.",
    "url": "https://www.washingtonexaminer.com/policy/healthcare/anthony-fauci-wife-net-worth-11-million"
  },
  {
    "text": "Lauren Boebert's sexy adventure: Blame conservatives' push for “traditional marriage”  —  Bari Weiss and Nicholas Kristof amplify GOP calls to marry young — that's just what the Colorado congresswoman did  —  It is a cycle as predictable as the sun rising and setting … ",
    "url": "https://www.salon.com/2023/09/19/lauren-boeberts-sexy-adventure-conservatives-push-for-traditional-marriage/"
  },
  {
    "text": "West Point sued by group behind Supreme Court affirmative action lawsuit  —  The group behind the lawsuits that led the Supreme Court to gut affirmative action at higher education institutions sued the U.S. Military Academy at West Point on Tuesday, seeking to end the school's race-conscious admissions policies.",
    "url": "https://thehill.com/regulation/court-battles/4212337-west-point-sued-by-group-behind-supreme-court-affirmative-action-lawsuit/"
  },
  {
    "text": "Biden Impeachment Probe Supported by Almost Half of Voters  —  Voters are divided over whether the impeachment investigation is largely due to evidence of wrongdoing by Biden or motivation to damage his political career.  —  Share of voters who said they support or oppose … ",
    "url": "https://pro.morningconsult.com/instant-intel/biden-impeachment-polling"
  },
  {
    "text": "Americans' Dismal Views of the Nation's Politics  —  65% say they always or often feel exhausted when thinking about politics  —  65% say they always or often feel exhausted when thinking about politics  —  How we did this  —  Americans have long been critical of politicians and skeptical of the federal government.",
    "url": "https://www.pewresearch.org/politics/2023/09/19/americans-dismal-views-of-the-nations-politics/"
  },
  {
    "text": "Hardeep Singh Nijjar: Canada accuses India of role in Sikh leader's murder  —  Canada has accused India of involvement in the killing of a Canadian Sikh leader, an allegation strongly denied by Delhi.  —  On Monday PM Justin Trudeau said Canada was looking at “credible allegations potentially linking” … ",
    "url": "https://www.bbc.com/news/uk-66848041"
  },
  {
    "text": "McCarthy scrambles: House punts key vote as rebellion rages - Live Updates  —  Speaker Kevin McCarthy has vowed to press toward a vote as soon as Thursday, but conservatives are still chafing.",
    "url": "https://www.politico.com/live-updates/2023/09/19/congress/gop-punts-vote-00116763"
  },
  {
    "text": "Maybe Matt Gaetz Is Right  —  The dysfunctional dance taking place in the House between Speaker Kevin McCarthy and his right flank has driven me to consider something I never imagined possible: that Matt Gaetz is right.  —  A House speaker can be successful only with the confidence … ",
    "url": "https://www.nytimes.com/2023/09/19/opinion/kevin-mccarthy-gaetz.html"
  },
  {
    "text": "Danish artist who ignored job and gave museum blank canvases ordered to give back over $70,000  —  Jens Haaning was given thousands to recreate two art pieces, which included bank notes attached to canvas.  Instead, he delivered empty frames.  —  A Danish artist who gave a museum … ",
    "url": "https://www.nbcnews.com/news/world/danish-artist-ignored-job-gave-museum-blank-canvases-ordered-give-back-rcna105841"
  },
  {
    "text": "Germany went from envy of the world to the worst-performing major developed economy.  What happened?  —  For most of this century, Germany racked up one economic success after another, dominating global markets for high-end products like luxury cars and industrial machinery … ",
    "url": "https://apnews.com/article/germany-economy-energy-crisis-russia-8a00eebbfab3f20c5c66b1cd85ae84ed"
  },
  {
    "text": "Alex Murdaugh Agrees to Plead Guilty to Federal Charges  —  He's charged with financial crimes related to bilking his law clients.  —  Alex Murdaugh, the disgraced South Carolina former lawyer convicted of murdering his wife and son to distract from massive fraud, has agreed to plead guilty … ",
    "url": "https://www.thedailybeast.com/alex-murdaugh-agrees-to-plead-guilty-to-federal-charges"
  },
  {
    "text": "House Republicans Downplay Meeting With Key Biden Aide  —  Former Hunter Biden business partner Eric Schwerin told the House oversight committee earlier this year that Joe Biden wasn't part of Hunter Biden's business.  —  LOADING  —  WASHINGTON — A close personal associate of Joe … ",
    "url": "https://www.huffpost.com/entry/eric-schwerin-oversight-committee-joe-biden_n_65098430e4b0d98f39e80e1d"
  },
  {
    "text": "House will hold first Biden impeachment inquiry hearing next Thursday  —  House Republicans are moving forward with their impeachment inquiry into President Biden as soon as next week  —  FIRST ON FOX — House Republicans will hold their first impeachment inquiry hearing investigating allegations … ",
    "url": "https://www.foxnews.com/politics/house-hold-first-biden-impeachment-inquiry-hearing-thursday"
  }
]