[
  {
    "text": "Taiwan voters dismiss China warnings and hand ruling party a historic third consecutive presidential win  —  Taiwan's ruling Democratic Progressive Party pulled off a historic third consecutive presidential victory on Saturday as voters shrugged off warnings by China that their re-election would increase the risk of conflict.",
    "url": "https://www.cnn.com/2024/01/13/asia/taiwan-presidential-election-results-intl-hnk"
  },
  {
    "text": "Trump Uses Mobster-Turned-Rat as Character Witness  —  The former president suggested two presiding justices could learn ethics from ex-mobster Sammy the Bull.  —  Donald Trump would like to thank former mob boss Salvatore Gravano aka “Sammy the Bull” for his support.",
    "url": "https://www.thedailybeast.com/trump-uses-mob-boss-sammy-the-bull-gravano-as-character-witness-on-truth-social"
  },
  {
    "text": "Utah Sen. Mike Lee endorses Trump  —  Lee is among at least 21 Republican senators who have endorsed Trump so far.  —  Utah Sen. Mike Lee endorsed former President Donald Trump, calling the presidential race a “binary choice.”  —  “Look, whether you like Donald Trump or not … ",
    "url": "https://www.politico.com/news/2024/01/13/utah-sen-mike-lee-endorses-trump-00135441"
  },
  {
    "text": "Scoop: John Kerry to leave Biden administration, help campaign  —  John Kerry, the U.S. special presidential envoy for climate, will leave the administration later this winter, and plans to help President Biden's campaign, Axios has learned. … - Kerry is working with White House Chief … ",
    "url": "https://www.axios.com/2024/01/13/john-kerry-biden-campaign-climate-2024"
  },
  {
    "text": "Tom Shales, Pulitzer-winning TV critic of fine-tuned wit, dies at 79  —  He spent nearly 40 years writing for The Washington Post and was known for his incisive and barbed commentary  —  Tom Shales, a Pulitzer Prize-winning television critic for The Washington Post who brought incisive … ",
    "url": "https://www.washingtonpost.com/obituaries/2024/01/13/tom-shales-washington-ppost-tv-critic-obituary-dead/"
  },
  {
    "text": "Ahead of Iowa Caucuses, Voters Fear the Prospect of Civil Unrest  —  As Monday's caucuses approach, voters casually throw around the prospect of World War III and civil unrest, anxious of divisions they fear are tearing the country apart.  —  Presidential elections traditionally speak to future aspirations … ",
    "url": "https://www.nytimes.com/2024/01/13/us/politics/iowa-caucuses-anxiety-fear.html"
  },
  {
    "text": "Ban on guns in post offices is unconstitutional, US judge rules  —  A federal judge in Florida on Friday ruled that a U.S. law that bars people from possessing firearms in post offices is unconstitutional, citing a landmark U.S. Supreme Court ruling from 2022 that expanded gun rights.",
    "url": "https://www.reuters.com/world/us/ban-guns-post-offices-is-unconstitutional-us-judge-rules-2024-01-13/"
  },
  {
    "text": "Biden campaign turns to a Jon Stewart vet for research help  —  The president's reelection effort is starting to fill out.  —  President Joe Biden's campaign is tapping a veteran of Jon Stewart's old show and a top aide from a progressive stalwart in the latest move to build out its national staff.",
    "url": "https://www.politico.com/news/2024/01/13/biden-campaign-2024-jon-stewart-00135448"
  },
  {
    "text": "Remarks by President Biden Before Marine One Departure  —  Q    Mr. President, do you have a reaction to the Taiwan election?  —  THE PRESIDENT:  We do not support independence.  (Inaudible.)  —  Q    Mr. President, would you call the situation on the southern border a “crisis”?",
    "url": "https://www.whitehouse.gov/briefing-room/speeches-remarks/2024/01/13/remarks-by-president-biden-before-marine-one-departure-41/"
  },
  {
    "text": "Donald Trump ordered to pay The New York Times and its reporters nearly $400,000 in legal fees  —  Former President Donald Trump was ordered Friday to pay nearly $400,000 in legal fees to The New York Times and three investigative reporters after he sued them unsuccessfully … ",
    "url": "https://apnews.com/article/trump-new-york-times-taxes-lawsuit-slapp-f39342501d9a2a5cfd36181f9f336215"
  },
  {
    "text": "Vivek Ramaswamy campaign still facing voter questions on race and religion days before Iowa  —  Apoorva Ramaswamy fielded several questions about her and her husband's race, ethnicity and beliefs during campaign stops across Iowa.  —  FORT MADISON, Iowa — Apoorva Ramaswamy had a simple ask … ",
    "url": "https://www.nbcnews.com/politics/2024-election/vivek-ramaswamy-campaign-still-facing-voter-questions-race-religion-da-rcna133721"
  },
  {
    "text": "Wenstrup Issues Key Takeaways from Interview with Dr. Francis Collins  —  WASHINGTON — Select Subcommittee on the Coronavirus Pandemic Chairman Brad Wenstrup (R-Ohio) released key takeaways after the Select Subcommittee's seven-hour transcribed interview with Dr. Francis Collins … ",
    "url": "https://oversight.house.gov/release/wenstrup-issues-key-takeaways-from-interview-with-dr-francis-collins/"
  },
  {
    "text": "Record winter storm upends plans in final Iowa caucus stretch  —  Freezing temperatures and record-level snowfall has battered the early-state ahead of its nominating contest, sparking concerns of turnout  —  DES MOINES — Republican presidential front-runner Donald Trump's campaign had planned … ",
    "url": "https://www.washingtonpost.com/politics/2024/01/12/record-winter-storm-iowa-caucus/"
  },
  {
    "text": "GOP Negotiator James Lankford Tries to Solve Border 'Rubik's Cube'  —  Senator takes on politically risky job as illegal crossings surge  —  Republican Sen. James Lankford of Oklahoma has taken on one of Congress's most thankless and politically risky jobs: leading negotiations to overhaul the country's immigration laws.",
    "url": "https://www.wsj.com/politics/policy/gop-negotiator-james-lankford-tries-to-solve-border-rubiks-cube-ac82cd00?mod=followamazon"
  }
]