[
  {
    "text": "Trump administration poised to accept ‘palace in the sky’ as a gift for Trump from Qatar: Sources  —  The luxury jumbo jet is to be used as Air Force One, sources told ABC News.  —  In what may be the most valuable gift ever extended to the United States from a foreign government … ",
    "url": "https://abcnews.go.com/Politics/trump-administration-poised-accept-palace-sky-gift-trump/story?id=121680511"
  },
  {
    "text": "Trump Administration Preparing to Accept Luxury Jet from Qatar's Royal Family: Report  —  The plane, reportedly worth $400 million, has been described as “a flying palace”  —  The Trump administration is getting ready to accept a super luxury Boeing 747-8 jumbo jet from the royal family … ",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-administration-luxury-jet-qatar-air-force-one-1235336629/"
  },
  {
    "text": "Trump fires director of U.S. Copyright Office, sources say  —  The Trump administration has fired the head of the U.S. Copyright Office, two sources familiar with the situation confirmed to CBS News Saturday.  —  The firing of Register of Copyrights Shira Perlmutter came after Perlmutter … ",
    "url": "https://www.cbsnews.com/news/trump-fires-director-of-u-s-copyright-office-shira-perlmutter-sources/"
  },
  {
    "text": "Morelle's Statement on Abrupt Firing of Shira Perlmutter, Register of Copyrights  —  WASHINGTON - Rep. Joe Morelle (NY-25), the top Democrat on the Committee on House Administration, issued this statement after Register of Copyrights and Director of the U.S. Copyright Office, Shira Perlmutter … ",
    "url": "https://democrats-cha.house.gov/media/press-releases/morelles-statement-abrupt-firing-shira-perlmutter-register-copyrights"
  },
  {
    "text": "Trump fires top US copyright official  —  Democrats are alleging foul play.  —  President Donald Trump continued a firing spree at the Library of Congress on Saturday when he dismissed the top copyright official in the nation — a position traditionally overseen by the legislative branch.",
    "url": "https://www.politico.com/news/2025/05/10/trump-u-s-copyright-official-00340306"
  },
  {
    "text": "Secretary of Defense Pete Hegseth '03 ‘plagiarized’ small portions of his senior thesis, experts say.  But how serious is it?  —  “After Card's whisper, Bush looked distracted and somber but continued to listen to the second-graders, joking that they ‘read like sixth-graders,’” … ",
    "url": "https://www.dailyprincetonian.com/article/2025/05/princeton-news-pete-hegseth-senior-thesis-plagiarism-allegations"
  },
  {
    "text": "Homeland Security Dept. accuses lawmakers of ‘storming’ an ICE facility despite oversight laws saying they could be there  —  The battle over immigration came to a dramatic head Friday afternoon when Democratic lawmakers faced off with Homeland Security Department officers as they tried to visit a Newark … ",
    "url": "https://cnn.com/2025/05/10/politics/dhs-lawmakers-ice-newark-mayor-arrest"
  },
  {
    "text": "Zelenskiy cautious after Putin proposes direct peace talks with Ukraine  —  Ukrainian President Volodymyr Zelenskiy responded guardedly on Sunday to a proposal from Russian President Vladimir Putin of rapid direct talks aimed at ending the war, saying Kyiv was willing to talk but only after Moscow agreed to a ceasefire.",
    "url": "https://www.reuters.com/world/europe/zelenskiy-cautious-after-putin-proposes-direct-peace-talks-with-ukraine-2025-05-11/"
  },
  {
    "text": "Being a mom in the federal government wasn't easy.  Trump made it “impossible.”  —  The Handbasket spoke to several moms about the series of painful choices they've had to make since January. … When Gabrielle was home on a recent Saturday morning, her older child sadly asked her if she had to go to work.",
    "url": "https://www.thehandbasket.co/p/moms-federal-government-trump-return-to-office"
  },
  {
    "text": "Republicans' partial tax plan estimated to cost $5 trillion  —  House Republicans released a partial text for the GOP tax bill on Friday and are expected to release the full text on Monday.  —  An early version of the House GOP's tax plan would cost nearly $5 trillion … ",
    "url": "https://www.politico.com/news/2025/05/10/republicans-partial-tax-plan-estimated-to-cost-5-trillion-00340347"
  },
  {
    "text": "Another equipment outage impacts flights at Newark Liberty International Airport  —  Another air traffic control equipment outage caused the FAA to implement a ground stop for Newark Liberty International Airport bound flights Sunday morning.  —  The ground stop, which means flights heading … ",
    "url": "https://cnn.com/2025/05/11/us/another-equipment-outage-impacts-newark-airport"
  },
  {
    "text": "The hidden ways Trump, DOGE are shutting down parts of the U.S. government  —  Limits on spending have incapacitated parts of agencies as varied as the National Park Service and the Pentagon.  —  At the Environmental Protection Agency, research at 11 laboratories has ground to a halt … ",
    "url": "https://www.washingtonpost.com/nation/2025/05/11/trump-government-operations-halt-funding-cuts/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ2OTM2MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ4MzE4Mzk5LCJpYXQiOjE3NDY5MzYwMDAsImp0aSI6IjY0NzcxZDliLTc5ZGUtNGQxMy1hZDk0LTg1MjExZDZiNDI1MCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb24vMjAyNS8wNS8xMS90cnVtcC1nb3Zlcm5tZW50LW9wZXJhdGlvbnMtaGFsdC1mdW5kaW5nLWN1dHMvIn0.UmcilYpN3kgfVtnfXSXiHlWr5JfXu6XkuCb0cgaxKGs&itid=gfta"
  },
  {
    "text": "'It's time for Joe Biden to go away': Democrats are triggered by Biden's return to the spotlight  —  Democrats are ready to move on even if their former standard bearer is not.  —  Joe Biden's return to the spotlight this week is igniting anger among Democrats who wish the former president … ",
    "url": "https://www.politico.com/news/2025/05/11/biden-go-away-00339909"
  },
  {
    "text": "FEMA cuts emergency training under Trump as hurricane season looms  —  The U.S. federal disaster agency FEMA has sharply reduced training for state and local emergency managers ahead of the start of the hurricane season on June 1, according to current and former officials, memos seen by Reuters … ",
    "url": "https://www.reuters.com/business/environment/fema-cuts-emergency-training-hurricane-season-looms-2025-05-11/"
  },
  {
    "text": "Utah students make a film about WWII incarceration at Topaz, and find a link to Trump's deportation policy  —  “When you forget your history, you repeat it,” says a 94-year-old Japanese American in the University of Utah student-made documentary.  —  This story is jointly published … ",
    "url": "https://www.sltrib.com/amplify-utah/2025/05/11/topaz-film-by-u-utah-students/"
  },
  {
    "text": "Judges say unsolicited pizza deliveries are meant to intimidate them  —  Judges in several states say they have faced threats and intimidation tactics associated with pizza deliveries.  —  Federal judges say unsolicited pizza deliveries to jurists' homes that began in February may number … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/11/justice-judges-threats-intimidation-pizza-deliveries/"
  },
  {
    "text": "Iran and the US begin a 4th round of negotiations over Tehran's nuclear program in Oman  —  Iran and the United States began a fourth round of negotiations Sunday over Tehran's rapidly advancing nuclear program, officials said, just ahead of a visit by President Donald Trump to the Middle East this week.",
    "url": "https://apnews.com/article/iran-us-nuclear-talks-oman-mideast-tensions-trump-1b47c24a5f97e20bfebbc34ad8047e90"
  },
  {
    "text": "Quebec riding of Terrebonne flips to Liberals after recount shows candidate won by single vote  —  Liberals now have 170 seats in House of Commons, two shy of a majority government  —  After a judicial recount, the Quebec riding of Terrebonne has flipped to the Liberals, who have beaten the Bloc Québécois by one vote.",
    "url": "https://www.cbc.ca/news/politics/terrebone-recount-liberal-1.7532136"
  },
  {
    "text": "A probation officer in Oregon was fired for using a Nazi salute at work.  An arbitrator restored his job  —  Wasco County's lead probation officer would frequently greet or bid farewell to a colleague of German descent with a Nazi salute and a “Mein Führer” address at work.",
    "url": "https://www.oregonlive.com/pacific-northwest-news/2025/05/a-probation-officer-in-oregon-was-fired-for-using-a-nazi-salute-at-work-an-arbitrator-restored-his-job.html"
  },
  {
    "text": "Even as pope, Leo XIV might have to deal with U.S. tax returns  —  As a U.S. citizen, the man formerly called Cardinal Robert Prevost is subject to the same IRS and Treasury reporting requirements as other Americans living abroad.  —  Pope Leo XIV, the newly elected pontiff, must answer to at least one more higher power: the IRS.",
    "url": "https://www.washingtonpost.com/business/2025/05/10/pope-salary-income-tax-us/"
  },
  {
    "text": "AOC Isn't Ruling Anything Out, Including the White House  —  Alexandria Ocasio-Cortez's rise to prominence worries some Democrats who say the base is taking the wrong lessons from the 2024 election  —  Rep. Alexandria Ocasio-Cortez (D., N.Y.) was standing in front of thousands of angry Democrats … ",
    "url": "https://www.wsj.com/politics/alexandria-ocasio-cortez-political-future-1b1ad7cc"
  },
  {
    "text": "Pentagon Furthers Crackdown on Diversity Policies With Fresh Order for Review of Library Books  —  The move is the latest denunciation by the Trump administration against anything related to diversity, equity and inclusion.  —  The Pentagon continued its purge of anything related to diversity … ",
    "url": "https://www.nytimes.com/2025/05/09/us/politics/pentagon-hegseth-dei-library-books.html"
  }
]