[
  {
    "text": "Democrats rage as Johnson restricts their ability to oust him … - “This makes it clear that they have no intention of working together to find common ground,” Rep. Jim McGovern (D-Mass.), the top Democrat on the House Rules Committee, said of the rules change in a statement.",
    "url": "https://www.axios.com/2025/01/02/mike-johnson-democrats-motion-to-vacate-rules"
  },
  {
    "text": "Trans rights to be marquee fight for House Republicans  —  How the GOP is responding to Rep.-elect Sarah McBride, the first openly transgender House member, is a preview of what's to come.  —  Republicans' first response to Sarah McBride's election to Congress was to ban her from using women's restrooms throughout the Capitol.",
    "url": "https://www.politico.com/news/2025/01/02/trans-rights-marquee-fight-house-republicans-00196013"
  },
  {
    "text": "Speaker Johnson faces narrowest House majority in nearly 100 years  —  Speaker Mike Johnson will face a major challenge in the new Congress - the narrowest House majority in nearly 100 years.  —  That is, if he can keep the gavel.  —  Republicans will soon control the House, Senate and White House.",
    "url": "https://www.cnn.com/politics/narrow-house-majority-congress-dg/"
  },
  {
    "text": "Trump plans ‘victory rally’ at Washington arena day before inauguration  —  President-elect Donald Trump plans to hold a “victory rally” at the Capital One Arena in Washington on Jan. 19, the day before he is sworn in, according to a sign-up page on his inaugural website.",
    "url": "https://www.washingtonpost.com/politics/2025/01/02/trump-administration-transition-johnson-speaker/"
  },
  {
    "text": "Trump blames ‘open borders’ for New Orleans, Las Vegas attacks  —  President-elect Trump blamed the situation at the U.S.-southern border for the recent attacks in New Orleans and Las Vegas, railing against President Biden for his immigration policies as both cases are being investigated.",
    "url": "https://thehill.com/homenews/administration/5063169-donald-trump-joe-biden-open-borders-new-orleans-las-vegas-attacks/"
  },
  {
    "text": "Liz Cheney Is Among 20 Chosen to Receive Presidential Citizens Medal  —  Two close advisers to President Biden will also be honored, in addition to career lawmakers who have worked across the aisle and advocates for liberal causes.  —  President Biden will award the Presidential Citizens Medal … ",
    "url": "https://www.nytimes.com/2025/01/02/us/politics/presidential-citizens-medal-liz-cheney.html"
  },
  {
    "text": "Biden is giving the 2nd highest civilian award to the leaders of the Jan. 6 congressional committee  —  President Joe Biden is bestowing the second highest civilian medal on Liz Cheney and Bennie Thompson, leaders of the congressional investigation into the Capitol riot who Donald Trump … ",
    "url": "https://apnews.com/article/biden-citizens-medals-jan-6-cheney-thompson-f725b7003ea11239b90962a8cf0d5305"
  },
  {
    "text": "Texas sues to impose bigotry on the rest of the country  —  Donald Trump and JD Vance spent the 2024 election spewing the most rank transphobia, a tactic that should have made them pariahs but instead helped win them the presidency.  Even though they haven't taken office yet … ",
    "url": "https://www.publicnotice.co/p/ken-paxton-ncaa-lawsuit-texas-trans-athletes"
  },
  {
    "text": "The huge stakes in a new Supreme Court case about pornography  —  Texas asks the justices to abandon longstanding First Amendment protections for sexual speech.﻿ … If you've studied First Amendment law, it's impossible not to experience déjà vu while reading the briefs … ",
    "url": "https://www.vox.com/scotus/391248/porn-supreme-court-free-speech-coalition-paxton-first-amendment"
  },
  {
    "text": "Something Surprising Happens When Kids Have to Set Their Own Goals  —  In a polarized nation, one point of agreement deserves more attention: Young adults say they feel woefully unprepared for life in the work force, and employers say they're right.  —  In a survey by Gallup … ",
    "url": "https://www.nytimes.com/2025/01/02/opinion/children-choices-goal-setting.html"
  },
  {
    "text": "Pornhub Is Now Blocked In Almost All of the U.S. South  —  Almost two years ago, Louisiana passed a law that started a wave that's since spread across the entire U.S. south, and has changed the way people there can access adult content.  As of today, Florida, Tennessee … ",
    "url": "https://www.404media.co/pornhub-is-now-blocked-in-almost-all-of-the-u-s-south/"
  },
  {
    "text": "Trump flunks 3 key tests following deadly New Orleans attack  —  Within hours of the New Year's attack in New Orleans, the president-elect simultaneously flunked tests of accuracy, decency and credibility.  —  As the public first started learning the details of the deadly attack in New Orleans … ",
    "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-flunks-3-key-tests-deadly-new-orleans-attack-rcna185965"
  },
  {
    "text": "The Rise Of Big Potato  —  Allegations of price collusions among the potato cartel reveal the new, sophisticated methods food corporations are using to keep prices high.  —  One afternoon in April 2022, Josh Saltzman, the owner of a sports bar in Washington, D.C., opened his inbox to find … ",
    "url": "https://www.levernews.com/the-rise-of-big-potato/"
  },
  {
    "text": "10 policies Republicans could use to pay for new tax cuts  —  Extending the expiring 2017 tax cuts could add $5 trillion to the national debt; Trump and GOP lawmakers are are considering these policies to offset that cost.  —  Advisers to President-elect Donald Trump and congressional Republicans … ",
    "url": "https://www.washingtonpost.com/business/2025/01/02/trump-budget-cuts-national-debt/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzM1Nzk0MDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzM3MTc2Mzk5LCJpYXQiOjE3MzU3OTQwMDAsImp0aSI6ImYxOWFlMjllLTE3MjktNGU2ZC04MzQ4LWZjOWQzNmZmMjljNiIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9idXNpbmVzcy8yMDI1LzAxLzAyL3RydW1wLWJ1ZGdldC1jdXRzLW5hdGlvbmFsLWRlYnQvIn0.zP-LMyjcYn7upLoPMEZsLJX9AL0AO4VnzALE2tB_kdA&itid=gfta"
  },
  {
    "text": "Musk defends demonetizing critics' content on X  —  Tech billionaire Elon Musk defended his move to demonetize his critics' content on the social media platform X and maintained the decision did not violate free speech.  —  “The first amendment is protection for ‘free speech’, not ‘paid speech’ ffs,” Musk wrote on X Wednesday.",
    "url": "https://thehill.com/policy/technology/5063009-elon-musk-defends-demonetize/"
  },
  {
    "text": "Inside terrorist Shamsud-Din Jabbar's squalid home where sheep and goats roam his yard — after his financial ruin  —  HOUSTON — The terrorist who killed 15 people when he plowed his truck down crowded Bourbon Street in New Orleans was an American-born military veteran who was living in a run … ",
    "url": "https://nypost.com/2025/01/01/us-news/inside-shamsud-din-jabbar-jabbars-squalid-home-where-sheep-and-goats-roam/"
  },
  {
    "text": "Here's What Trump's Mexico Invasion Plan Could Look Like  —  As Trump and his incoming administration threaten Mexican drug cartels, experts warn their plan could create more violence and put Americans in danger  —  A MQ-9 Reaper drone keeps watch above the caravan of SUVs as a pair of helicopters … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-mexico-invasion-plan-1235223266/"
  },
  {
    "text": "How Donald Trump single-handedly cured America's economic blues  —  It's generally a rare thing for the person you're interviewing to burst out laughing.  But that's what happened to me, recently, on a call with Ernie Tedeschi, the director of economics at the Yale Budget Lab who in March wrapped … ",
    "url": "https://www.businessinsider.com/vibecession-is-over-fake-politics-consumer-confidence-economy-feelings-sentiment-2025-1"
  }
]