[
  {
    "text": "Zelenskyy: ‘We will have a chance at victory’ thanks to weapons provided to Ukraine in new US aid package  —  Ukrainian President Volodymyr Zelenskyy thanked U.S. leaders for passing a $60.8 billion aid package through the House earlier in the weekend.  —  Ukrainian President Volodymyr Zelenskyy … ",
    "url": "https://www.nbcnews.com/politics/congress/ukrainian-president-volodymyr-zelenskyy-will-chance-victory-thaks-weap-rcna148684"
  },
  {
    "text": "Trump Deflates  —  It wasn't just Putin who lost in the House vote on Ukraine aid.  —  Ukraine won.  Trump lost.  —  The House vote to aid Ukraine renews hope that Ukraine can still win its war.  It also showed how and why Donald Trump should lose the 2024 election.",
    "url": "https://www.theatlantic.com/politics/archive/2024/04/trump-republican-vote-ukraine-aid/678148/"
  },
  {
    "text": "Johnson, Like Pence, Draws Praise for Defying His Party and Doing His Job  —  In the Republican Party of 2024, styled in the image of former President Donald J. Trump, a norm-preserving, consensus-driven act — even a basic one — can be a career-ending offense.",
    "url": "https://www.nytimes.com/2024/04/20/us/politics/johnson-pence-republicans-ukraine-aid.html"
  },
  {
    "text": "The House votes for possible TikTok ban in the US, but don't expect the app to go away anytime soon  —  The House passed legislation Saturday that would ban TikTok in the United States if the popular social media platform's China-based owner doesn't sell its stake within a year, but don't expect the app to go away anytime soon.",
    "url": "https://apnews.com/article/tiktok-us-ban-sale-china-congress-de12b4d22aa8095e62cb0982a6e62235"
  },
  {
    "text": "Trump Privately Rages About His Sketch Artist, Courtroom Nap Reports  —  The former president's anger during the first week of his New York hush money trial was “maxed out, even for him,” a source tells Rolling Stone  —  Donald Trump, if you take it from him, is cherishing the opportunity … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-trial-mad-haberman-sketch-artist-1235007794/"
  },
  {
    "text": "Trump's Trial Challenge: Being Stripped of Control  —  The mundanity of the courtroom has all but swallowed Donald Trump, who for decades has sought to project an image of bigness and a sense of power.  —  “Sir, can you please have a seat.”  —  Donald J. Trump had stood up to leave … ",
    "url": "https://www.nytimes.com/2024/04/21/us/politics/trump-trial-analysis.html"
  },
  {
    "text": "Proud Boys appear at Trump rally, drawing condemnation from Biden  —  Members of the violent extremist group were calling for the release of everyone charged in the Jan. 6, 2021, attack on the Capitol.  Trump has pledged to pardon rioters.  —  WILMINGTON, N.C. — At least 10 men wearing … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/20/trump-rally-proud-boys-north-carolina/"
  },
  {
    "text": "Netanyahu Condemns Reported US Plan to Blacklist Military Unit  —  Israeli Prime Minister Benjamin Netanyahu condemned a reported US plan to sanction an ultra-Orthodox army battalion over human rights abuses in the West Bank, a move which could fuel tensions over Israel's war against Hamas in Gaza.",
    "url": "https://www.bloomberg.com/news/articles/2024-04-21/netanyahu-condemns-reported-us-plan-to-blacklist-military-unit"
  },
  {
    "text": "Residents push for renaming of Trump Plaza to disassociate from ex-president  —  Tenants of the high-rise in New Rochelle, New York, want to abandon the name which has at times affected real estate value  —  While Donald Trump endures the ignominy of being the first former US president … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/21/trump-plaza-rename-real-estate-value"
  },
  {
    "text": "Trump's legal bills drain millions more from his political committees  —  The former president's legal bills account for more than a quarter of the spending by his political committees in March, new campaign finance filings show  —  Donald Trump is picking up his fundraising pace … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/20/trump-legal-bills-fundraising-reports/"
  },
  {
    "text": "Biden marks 25th anniversary of Columbine shooting  —  President Biden, joined by other members of his administration, on Saturday marked the 25th anniversary of the Columbine High School Massacre and attempted bombing.  —  On April 20, 1999, two twelfth-grade students murdered 12 students … ",
    "url": "https://thehill.com/homenews/administration/4608754-biden-marks-25th-anniversary-of-columbine-shooting/"
  },
  {
    "text": "Americans Who Want To Kill Americans  —  The Reframe is totally free for all readers, and is supported with voluntary subscriptions by about 5% of readers.  —  If you find value in these essays, and only if you can afford to, please consider becoming a paid sponsor.",
    "url": "https://www.the-reframe.com/americans-who-want-to-kill-americans/"
  },
  {
    "text": "Michael Avenatti says he's talking to Trump's legal team — and would testify for the ex-prez  —  Disgraced Stormy Daniels' attorney Michael Avenatti has been in contact with former President Trump's legal defense team and is ready and willing to testify against his former client, he told The Post in an interview from jail.",
    "url": "https://nypost.com/2024/04/20/us-news/michael-avenatti-says-hes-in-conversations-with-trump-legal-team/"
  },
  {
    "text": "Statement from President Joe Biden on House Passage of the National Security Package  —  Today, members of both parties in the House voted to advance our national security interests and send a clear message about the power of American leadership on the world stage.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/20/statement-from-president-joe-biden-on-house-passage-of-the-national-security-package/"
  },
  {
    "text": "Biden celebrates Tennessee Volkswagen plant's vote to join UAW  —  President Biden celebrated the “historic vote” Friday for workers at a Tennessee Volkswagen plant to join the United Auto Workers (UAW) union.  —  “Congratulations to the workers at Volkswagen in Chattanooga, Tennessee … ",
    "url": "https://thehill.com/homenews/state-watch/4608235-biden-celebrates-tennessee-volkswagen-plant-vote-join-uaw/"
  }
]