[
  {
    "text": "Hamas Official Ghazi Hamad: We Will Repeat The October 7 Attack, Time And Again, Until Israel Is Annihilated; We Are Victims - Everything We Do Is Justified  —  Ghazi Hamad of the Hamas political bureau said in an October 24, 2023 show on LBC TV (Lebanon) that Hamas is prepared to repeat the October 7 … ",
    "url": "https://www.memri.org/tv/hamas-official-ghazi-hamad-we-will-repeat-october-seven-until-israel-annihilated-victims-everything-we-do-justified"
  },
  {
    "text": "After Years of Vowing to Destroy Israel, Iran Faces a Dilemma  —  With Israel bent on crushing Iran's ally Hamas, Tehran must decide whether it and the proxy militias it arms and trains will live up to its fiery rhetoric.  —  For more than four decades, Iran's rulers have pledged to destroy Israel.",
    "url": "https://www.nytimes.com/2023/11/01/world/middleeast/iran-israel-hamas.html"
  },
  {
    "text": "Does New Speaker of the House Mike Johnson Have a Bank Account?  —  Speaker Mike Johnson has never listed a bank account on his financial disclosure.  In fact, on his newest disclosure he doesn't list a single asset at all. … Newly elected Speaker of the House Mike Johnson (R-LA) does not have a bank account.",
    "url": "https://www.thedailybeast.com/does-new-speaker-of-the-house-mike-johnson-have-a-bank-account"
  },
  {
    "text": "Netanyahu may not last, Biden and aides increasingly believe  —  The Israeli prime minister's political obituary has been written before.  But U.S. officials are already gauging potential successors.  —  Joe Biden and top aides have discussed the likelihood that Benjamin Netanyahu's political days … ",
    "url": "https://www.politico.com/news/2023/11/01/biden-administration-thinks-netanyahu-may-not-last-politically-00124849"
  },
  {
    "text": "A Virginia GOP State Rep. Built Her Political Career On A Story That Doesn't Add Up  —  Tara Durant claims an “angry mob” of Black Lives Matter protesters “assaulted” her car in 2020.  Newly obtained police reports suggest something different.  —  LOADING",
    "url": "https://www.huffpost.com/entry/tara-durant-black-lives-matter-protest-exaggerated_n_654143aae4b0ae2dc0b5a243"
  },
  {
    "text": "As the World Smolders, the New Speaker Trolls Biden  —  It didn't take long for the new House speaker, Mike Johnson, to demonstrate to the world that he will not be a serious partner for American allies or for those who still believe that governing is not a petty little game.",
    "url": "https://www.nytimes.com/2023/11/01/opinion/mike-johnson-israel-ukraine.html"
  },
  {
    "text": "G.O.P.'s Buck Won't Seek Re-Election, Citing His Party's Election Denialism  —  Representative Ken Buck, one of eight Republicans who moved to oust Kevin McCarthy as speaker, said his split with his party was too wide to remain in the House.  Others are likely to follow.",
    "url": "https://www.nytimes.com/2023/11/01/us/politics/ken-buck-election-republicans.html"
  },
  {
    "text": "Trump's Florida case timeline may need to be pushed back, Cannon says  —  FORT PIERCE, Fla. — The federal judge overseeing Donald Trump's indictment for allegedly mishandling national security secrets suggested at a hearing Wednesday that she might push back the planned trial timeline … ",
    "url": "https://www.washingtonpost.com/national-security/2023/11/01/trump-florida-trial-delay-cannon/"
  },
  {
    "text": "2024 Presidential Race Stays Static In The Face Of Major Events, Quinnipiac University National Poll Finds; RFK Jr. Receives 22% As Independent Candidate In 3-Way Race  —  mail_outline  —  Following a month marked by a war breaking out between Israel and Hamas, global tensions ratcheting up … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3881"
  },
  {
    "text": "GOP senator to confront Tuberville on military blockade  —  The move by Sen. Dan Sullivan marks the most significant challenge to the Alabama senator by Republicans yet.  —  Alaska Republican Dan Sullivan will lead a push to confirm a slate of military nominees Wednesday evening … ",
    "url": "https://www.politico.com/news/2023/11/01/gop-senator-to-confront-tuberville-on-military-blockade-00124877"
  },
  {
    "text": "Trump's Allies Want a New Style of Lawyer if He Returns to Power  —  Politically appointed lawyers sometimes frustrated Donald J. Trump's ambitions.  His allies are planning to install more aggressive legal gatekeepers if he regains the White House.  —  Close allies of Donald J. Trump … ",
    "url": "https://www.nytimes.com/2023/11/01/us/politics/trump-2025-lawyers.html"
  },
  {
    "text": "A judge could toss Trump in jail.  The question is whether one dares.  —  He transparently challenges gag orders as allies, as well as some critics, are girding for what that might portend  —  Donald Trump in a 2016 debate infamously warned Hillary Clinton that, if he were president, “you'd be in jail.”",
    "url": "https://www.washingtonpost.com/politics/2023/11/01/trump-gag-order-jail-analysis/"
  },
  {
    "text": "Speaker Johnson tells Senate GOP he backs Ukraine aid, funding path through Jan. 15  —  “He indicated he's supportive, but the way it's put together in a supplemental needs a lot of work,” said Sen. John Hoeven (R-N.D.) of Ukraine aid.",
    "url": "https://www.politico.com/live-updates/2023/11/01/congress/what-johnson-wants-ukraine-israel-funding-00124806"
  },
  {
    "text": "Largest Christian university in US fined record amount  —  The largest Christian university in the U.S. is facing a record-setting fine from the Department of Education for allegedly deceiving thousands of students about the cost of its doctoral programs.  —  The department announced … ",
    "url": "https://thehill.com/homenews/education/4287149-largest-christian-university-fine-record/"
  },
  {
    "text": "Trump 14th Amendment Disqualification Trial Can Continue, Judge Rules  —  Former President Donald J. Trump's team had argued that his words and actions leading up to the attack on the Capitol were protected by the First Amendment, and asked that the Colorado case be thrown out.",
    "url": "https://www.nytimes.com/2023/11/01/us/politics/trump-14th-amendment-case.html"
  },
  {
    "text": "“A kind of Stepford wife”: It's more than a prayer keeping Mike Johnson's wife suddenly out of view  —  The new speaker's Christian right radicalism really comes into view when looking at his marriage  —  When Rep. Mike Johnson, R-La., was elected Speaker of the House … ",
    "url": "https://www.salon.com/2023/11/01/a-kind-of-stepford-wife-its-more-than-a-prayer-keeping-mike-johnsons-wife-suddenly-out-of-view/"
  },
  {
    "text": "American Ornithological Society Will Change the English Names of Bird Species Named After People  —  Scientists Will Establish a New Multidisciplinary Naming Entity and Seek Public Input, Beginning with 70-80 Bird Species in the U.S. and Canada … FOR IMMEDIATE RELEASE  —  Contact:  media@americanornithology.org",
    "url": "https://americanornithology.org/american-ornithological-society-will-change-the-english-names-of-bird-species-named-after-people/"
  },
  {
    "text": "Statement by House Appropriations Chairwoman Kay Granger  —  WASHINGTON - Today, House Appropriations Chairwoman Kay Granger released the following statement.  —  “Today I am announcing that I will not seek re-election to the United States House of Representatives in 2024.",
    "url": "https://kaygranger.house.gov/2023/11/statement-by-house-appropriations-chairwoman-kay-granger"
  },
  {
    "text": "Who is Patrick Dai, Cornell student accused of threatening Jewish peers?  —  The Cornell University student accused of making violent threats against his Jewish peers is a 21-year-old engineering student who suffers from such “severe depression” that his mother worried he was on the brink of suicide just moments before his arrest.",
    "url": "https://nypost.com/2023/11/01/news/patrick-dai-cornell-student-accused-of-threatening-jewish-peers/"
  },
  {
    "text": "Transformed Trump family will take center stage in New York courtroom  —  Once Trump's right hand, daughter Ivanka has stepped back, while Trump sons Eric and Don Jr. defend his business and political legacy  —  Donald Trump had been a pariah on Wall Street for years when a banker … ",
    "url": "https://www.washingtonpost.com/nation/2023/10/31/trump-family-new-york-civil-trial/"
  },
  {
    "text": "Haley Meets With Miriam Adelson, G.O.P. Megadonor  —  As Nikki Haley has jumped in presidential polling, her campaign has stepped up its outreach efforts.  —  Nikki Haley, the former United Nations ambassador who has been climbing in Republican presidential polls, met with the casino mogul … ",
    "url": "https://www.nytimes.com/2023/11/01/us/politics/haley-miriam-adelson-trump-gop.html"
  }
]