[
  {
    "text": "Trump Whines About Fox News as Poll Numbers Keep Dropping  —  ‘WRONG!!’  —  “I don't have to make calls to go on TV, or anything else — They call me!” the former president posted on Sunday.  —  Journalist  —  With 71 days until the election, Donald Trump spent Sunday morning ranting … ",
    "url": "https://www.thedailybeast.com/trump-whines-about-fox-news-as-poll-numbers-keep-dropping"
  },
  {
    "text": "Scoop: Harris builds an army of House surrogates … - To many House members, the shift is evidence of their new importance under the leadership of Vice President Kamala Harris and Minnesota Gov. Tim Walz, a former House member. … - The center-left New Democrat Coalition polled … ",
    "url": "https://www.axios.com/2024/08/25/kamala-harris-campaign-biden-house-surrogates"
  },
  {
    "text": "Playbook: Scoop: The secret debate about the Trump-Harris debate  —  With help from Eli Okun, Garrett Ross and Bethany Irvine  —  DRIVING THE DAY  —  SCOOP: IS THIS THING ON?  — Last night, former President DONALD TRUMP posted on Truth Social, tearing into ABC News for a “This Week” … ",
    "url": "https://www.politico.com/newsletters/playbook/2024/08/26/scoop-the-secret-debate-about-the-trump-harris-debate-00176296"
  },
  {
    "text": "Trump suggests he might skip ABC debate with Harris  —  The Sept. 10 debate with ABC is the only one both campaigns have agreed to do with one of the major networks.  —  Former president Donald Trump suggested Sunday evening that he might skip a Sept. 10 ABC News debate with Vice President Kamala Harris … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/26/trump-harris-debate-abc/"
  },
  {
    "text": "Trump team prepares for sprint to November with ‘all hands on deck’ approach  —  Fresh off a week of daily counterprogramming events and an effort to steal the spotlight from his new opponent, Donald Trump and his campaign are seeking to harness that pace in the lead-up to November … ",
    "url": "https://www.cnn.com/2024/08/25/politics/donald-trump-vance-november-election/"
  },
  {
    "text": "Harris ramps up strategy for sprint to the election … - Harris' team hopes to continue riding a wave of good vibes and encouraging polls coming out of the Democratic convention by keeping the pressure on Trump — and encouraging Americans to buy into her optimism while turning the page from Trump's divisiveness.",
    "url": "https://www.axios.com/2024/08/26/kamala-harris-strategy-election-trump"
  },
  {
    "text": "Isaac Hayes Estate Marks Victory in Suit Against Trump  —  ‘SEE YOU IN COURT’  —  Isaac Hayes' estate filed a lawsuit this month over Donald Trump's unauthorized use of “Hold On, I'm Coming.”  —  ‘ON THE MEND’  —  According to a statement from the venue, T-Boz suffered “severe nausea, vomiting, and intense abdominal cramps.”",
    "url": "https://www.thedailybeast.com/isaac-hayes-estate-marks-victory-in-suit-against-trump"
  },
  {
    "text": "Donald Trump Just Got Served In Federal Isaac Hayes Estate Lawsuit  —  Isaac Hayes III posted on Sunday that Donald Trump and his campaign have been served in their federal lawsuit alleging 134 instances of copyright infringement.  —  The civil lawsuit alleges that Trump and his campaign used … ",
    "url": "https://www.politicususa.com/2024/08/25/trump-served-isaac-hayes-estate.html"
  },
  {
    "text": "Gen. McMaster's blistering account of the Trump White House  —  Until now, Lt. Gen. H.R. McMaster has held his fire about his stint in the Trump White House.  McMaster served with distinction in key American conflicts of the past decades: the Gulf War, the Iraq War and the war in Afghanistan … ",
    "url": "https://www.cnn.com/2024/08/25/politics/mcmaster-trump-book-account/"
  },
  {
    "text": "Kennedy Family Comes Out Swinging Against ‘Obscene’ RFK Jr. After Trump Defection  —  ‘WORSE THAN DISAPPOINTMENT’  —  Several prominent Kennedy siblings, including Kerry Kennedy and Max Kennedy, condemned their brother's decision to endorse the Republican nominee for president.",
    "url": "https://www.thedailybeast.com/kennedy-family-comes-out-swinging-against-obscene-rfk-jr"
  },
  {
    "text": "Biden keeps low profile on vacation as Democrats aim to capitalize on DNC  —  Only a matter of weeks ago it seemed inconceivable that Biden would watch someone else accepting the presidential nomination from a TV screen some 2,000 miles away.  —  SANTA YNEZ VALLEY, Calif. … ",
    "url": "https://www.washingtonpost.com/politics/2024/08/25/joe-biden-vacation-california-rehoboth-dnc/"
  },
  {
    "text": "Trump's economic gamble … - The former president is seizing on every negative bit of economic news to make the point that the economy is much worse than the Biden administration says. … It's a cherry-picking battle.  — Harris has a much more optimistic view of the economy.",
    "url": "https://www.axios.com/2024/08/26/trump-harris-economy-inflation"
  },
  {
    "text": "McConnell's big fear on the next budget fight … - In a recent meeting with other GOP offices about a short-term spending bill strategy, top McConnell staffers argued that adding a non-citizen voting bill would backfire.  — One fear is such a move would open the door for Democrats to tack … ",
    "url": "https://www.axios.com/2024/08/25/mcconnell-republicans-save-act-immigrant-voting"
  },
  {
    "text": "Watch: Scott Jennings laughed at on CNN for claiming 'People don't want to feel joy'  —  It did not take long on Sunday morning for conservative CNN political commentator Scott Jennings to realize he had stepped in it when he claimed, “People don't want to feel joy” during his appearance on “State of the Union.”",
    "url": "https://www.rawstory.com/scott-jennings-cnn-joy/"
  },
  {
    "text": "Scholz Vows Tighter Weapons Rules After Fatal Knife Attack  — Chancellor pledges faster deportation of failed asylum seekers  — Syrian man in custody accused of killing three, injuring eight  —  German Chancellor Olaf Scholz pledged to tighten weapons regulations and accelerate … ",
    "url": "https://www.bloomberg.com/news/articles/2024-08-26/scholz-promises-tighter-weapons-rules-after-fatal-knife-attack"
  },
  {
    "text": "Trump is expected to tie Harris to chaotic Afghanistan War withdrawal in speech to National Guard  —  In a speech Monday to National Guard soldiers in Michigan, former President Donald Trump is expected to promote his foreign policy record and tie Vice President Kamala Harris … ",
    "url": "https://apnews.com/article/trump-michigan-afghanistan-war-46eb2b0861939bf022747920c0ee0234"
  },
  {
    "text": "Sunday Snapshot: Trump's ambiguous abortion messaging … 1. GOP lawmakers struggle with Trump's abortion policies … - Philip Klein, the editor of the conservative National Review Online, wrote Friday in a piece titled “Trump's Abandonment of Pro-Lifers Is Complete,” that with his Truth Social post … ",
    "url": "https://www.axios.com/2024/08/25/trump-reproductive-rights-sunday-snapshot"
  }
]