[
  {
    "text": "Jim Jordan's allies tried strong-arming his GOP critics.  It backfired.  —  “The one thing that will never work with me — if you try to pressure me, if you try to threaten me, then I shut off,” GOP Rep. Mario Díaz-Balart said.  —  Jim Jordan's allies attempted to badger House Republicans into making him speaker.",
    "url": "https://www.politico.com/news/2023/10/17/conservative-pressure-jordan-speaker-bid-00122089"
  },
  {
    "text": "Congressman's Wife Receives Anonymous Texts Warning Husband to Vote For Jim Jordan: ‘Will Not Hold Any Political Office Ever Again’  —  The wife of Rep. Don Bacon (R-NE) reportedly received anonymous text messages and emails warning her husband to back Rep. Jim Jordan's (R-OH) House speakership campaign ahead of Tuesday's vote.",
    "url": "https://www.mediaite.com/politics/congressmans-wife-receives-anonymous-texts-warning-husband-to-vote-for-jim-jordan-will-not-hold-any-political-office-ever-again/"
  },
  {
    "text": "Jim Jordan's Speaker Bid Hanging by a Thread  —  Good afternoon and welcome to Press Pass.  Today's edition is free, so sign up below if you haven't already and please share this newsletter with someone who you think might benefit from a regular dose of informative pain.",
    "url": "https://plus.thebulwark.com/p/jim-jordans-speaker-bid-hanging-by"
  },
  {
    "text": "Who is Jim Jordan?  —  The Ohio Republican, who is vying to be speaker, has served in the House since 2007.  —  WASHINGTON — Rep. Jim Jordan, R-Ohio, is the only candidate in the race for House speaker, but he's still struggling to win over enough support from rank-and-file Republicans to get elected in a formal floor vote.",
    "url": "https://www.nbcnews.com/politics/congress/jim-jordan-rcna120790"
  },
  {
    "text": "The Wrestlers Trying to Stop Jim Jordan From Becoming House Speaker  —  They were abused in the '80s and '90s.  They say Jordan knew and did nothing.  —  Republican Ohio Rep. Jim Jordan is trying to become the next speaker of the House of Representatives.",
    "url": "https://slate.com/news-and-politics/2023/10/jim-jordan-wrestling-ohio-state-scandal-speaker-house-representatives.html"
  },
  {
    "text": "These California Republicans voted for Jim Jordan and against the good of the country.  Remember their names  —  Remember their names.  —  On Tuesday, 11 of California's 12 GOP House members put tribal loyalty above the country's best interests and heedlessly cast their votes to make Jim Jordan … ",
    "url": "https://www.latimes.com/politics/story/2023-10-17/jim-jordan-house-speaker-california-republicans-put-tribe-ahead-of-country"
  },
  {
    "text": "Israel-Hamas war: Israel bombs Gaza where civilians sought refuge  —  The Gaza Health Ministry said an Israeli airstrike Tuesday hit a Gaza City hospital packed with wounded and other Palestinians seeking shelter, killing hundreds.  If confirmed, the attack would be by far the deadliest Israeli airstrike in five wars fought since 2008.",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-biden-rafah-e062825a375d9eb62e95509cab95b80c"
  },
  {
    "text": "U.S. says thwarts drone attack on its troops in Iraq  —  The U.S. military thwarted an attack targeting its forces in Iraq early on Wednesday, intercepting two drones before they could strike, two U.S. officials told Reuters.  —  The officials, who spoke on condition of anonymity … ",
    "url": "https://www.reuters.com/world/us-says-thwarts-drone-attack-its-troops-iraq-2023-10-18/"
  },
  {
    "text": "Lebanon's Hezbollah denounces Gaza hospital strike, protests in Beirut  —  Lebanon's Hezbollah denounced what the group said was Israel's deadly attack on a Gaza hospital and called for “a day of unprecedented anger” on Wednesday, as protests erupted outside the U.S. embassy in Beirut just hours after the incident.",
    "url": "https://www.reuters.com/world/middle-east/lebanons-hezbollah-denounces-gaza-hospital-strike-protests-beirut-2023-10-17/"
  },
  {
    "text": "Russian sources disappeared after Trump declassified ex-spy's evidence, UK court told  —  Former MI6 officer's witness statement criticises ‘reckless’ publication of Mueller testimony about ex-president's Russia links  —  Donald Trump's decision to declassify evidence given by a former British spy … ",
    "url": "https://www.theguardian.com/us-news/2023/oct/17/russian-sources-disappeared-after-trump-declassified-ex-spys-evidence-uk-court-told"
  },
  {
    "text": "Department of Defense Releases Declassified Images, Videos of Coercive and Risky PLA Operational Behavior  —  The Department of Defense today released a collection of declassified images and videos depicting 15 recent cases of coercive and risky operational behavior by the People's Liberation Army … ",
    "url": "https://www.defense.gov/News/Releases/Release/Article/3559903/department-of-defense-releases-declassified-images-videos-of-coercive-and-risky/"
  },
  {
    "text": "Former GOP gubernatorial candidate Ryan Kelley sentenced to prison on Jan. 6 charges  —  The former candidate for Michigan governor was arrested during the Republican primary last year.  —  WASHINGTON — A former Republican candidate for Michigan governor was sentenced Tuesday to 60 days … ",
    "url": "https://www.nbcnews.com/politics/justice-department/republican-candidate-ryan-kelley-sentenced-prison-jan-6-rcna120679"
  },
  {
    "text": "Man, Wrongfully Imprisoned for 16 Years, Is Fatally Shot During Traffic Stop  —  Leonard Allan Cure, who was exonerated in 2020 after being convicted of armed robbery, was shot and killed by a sheriff's deputy in Georgia after being pulled over for speeding.",
    "url": "https://www.nytimes.com/2023/10/17/us/leonard-allan-cure-georgia-deputy-shooting.html"
  },
  {
    "text": "WATCH: Cornell Professor Says Hamas Atrocities Were ‘Exhilarating’  —  A Cornell University professor told a crowd of students that the Hamas terror attacks against Israeli citizens were “exhilarating” and “energizing.”  —  “It was exhilarating,” Russell Rickford, a history professor at Cornell … ",
    "url": "https://freebeacon.com/latest-news/watch-cornell-professor-says-hamas-atrocities-were-exhilarating/"
  },
  {
    "text": "IDF confirms Islamic Jihad failed rocket destroyed Gaza hospital  —  Rockets fired by factions in the Gaza Strip often fall short, with Palestinians killed in a number of past such incidents.  —  The IDF confirmed late Tuesday night that Islamic Jihad's failed rocket had destroyed a Gaza hospital … ",
    "url": "https://www.jpost.com/breaking-news/article-768879"
  },
  {
    "text": "North Carolina governor sues Republicans over election rules change  —  North Carolina Gov. Roy Cooper (D) sued Republicans over a state Senate bill that changed election rules in the state.  —  Cooper's lawsuit, filed against President Pro Tempore Phillip Berger, Speaker of the House Timothy Moore … ",
    "url": "https://thehill.com/homenews/state-watch/4261584-north-carolina-governor-sues-states-republicans/"
  },
  {
    "text": "Britney Spears Reveals She Had an Abortion Because Justin Timberlake 'Didn't Want to Be a Father' (Exclusive)  —  Britney Spears is sharing a painful experience she's kept private for 20 years.  —  In her upcoming memoir The Woman in Me, the pop icon, 41, reveals that when she dated Justin Timberlake … ",
    "url": "https://people.com/britney-spears-justin-timberlake-pregnancy-abortion-exclusive-8362622"
  },
  {
    "text": "Transgender female fencer scores world title over 14-time champion  —  Liz Kocab has won 8 world championships  —  A transgender female fencer picked up an eighth world championship on Sunday at the 2023 FIE Veteran Fencing World Championships.  —  Liz Kocab won in the Vet Women's Epee … ",
    "url": "https://www.foxnews.com/sports/transgender-female-fencer-scores-world-title-14-time-champion"
  },
  {
    "text": "This morning, the Justice Department announced that the United States has reached a settlement with the plaintiffs in the case of Ms. L. v. U.S. Immigration and Customs Enforcement, a class action lawsuit filed in 2018 over the Trump administration's policy of separating parents and children at the southwest border to deter migrants.",
    "url": "https://heathercoxrichardson.substack.com/p/october-16-2023"
  }
]