[
  {
    "text": "Lashing Out Over Russia and Jobs Data, Trump Displays His Volatile Side  —  The president had been on something of a winning streak.  But when faced with facts and foes that wouldn't bend to his will, he responded with impatience and disproportionate intensity.",
    "url": "https://www.nytimes.com/2025/08/02/us/politics/trump-russia-jobs.html"
  },
  {
    "text": "The Trump Economy Stumbles  —  The President has his new world tariff order in place, but jobs and growth don't look so good.  —  Click for Sound  —  President Trump has now imposed his new tariff regime on the world, and the triumphalism is palpable in MAGA land.",
    "url": "https://www.wsj.com/opinion/donald-trump-economy-tariffs-trade-jobs-growth-federal-reserve-a51eccaf?st=pTjusm&reflink=article_copyURL_share"
  },
  {
    "text": "Trump's authoritarian streak  —  A five-alarm fire tore through the economic establishment Friday after President Trump ousted the government's top labor statistician, accusing her — without evidence — of “rigging” a weak jobs report. … - But apply any of these five storylines … ",
    "url": "https://www.axios.com/2025/08/02/trump-authoritarian-jobs-report-bls-economy"
  },
  {
    "text": "Senate leaving Russia sanctions power fully in Trump's hands  —  Republican senators are getting ready to leave Washington without advancing a major sanctions bill against Russia, giving President Trump sole discretion over whether to follow through on his threats against Russian President Vladimir Putin … ",
    "url": "https://thehill.com/homenews/senate/5432717-senate-russia-bill-adjournment/"
  },
  {
    "text": "Republican senators raise concerns about Trump's firing of Labor Dept. official  —  Trump fired the head of the Bureau of Labor Statistics Friday after the agency released a jobs report that showed a significant slowdown in hiring in the U.S.  —  Some Republican senators have expressed concern … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/republican-senators-raise-concerns-trumps-firing-bls-commissioner-rcna222584"
  },
  {
    "text": "Trump, Claiming Weak Jobs Numbers Were ‘Rigged,’ Fires Labor Official  —  Economists said ousting the head of the Bureau of Labor Statistics could undermine confidence in government economic data.  — 1.2k  —  President Trump unleashed his fury about weakness in the labor market on Friday … ",
    "url": "https://www.nytimes.com/2025/08/01/business/economy/trump-bls-firing-jobs-report.html?unlocked_article_code=1.bE8.TTv7.w858vtQgywbr&smid=url-share"
  },
  {
    "text": "Trump's Domestic Use of Military Set to Get Worse, Leaked Memo Shows  —  President Donald Trump has already enmeshed the United States military in domestic law enforcement operations involving immigration to an unprecedented degree.  He has authorized a major military buildup at the border.",
    "url": "https://newrepublic.com/article/198708/trump-military-anti-immigration-dhs-leaked-memo"
  },
  {
    "text": "Department of Homeland Security Memo … HOMELAND SECURITY AND DOD MEETING  —  [The New Republic omitted logistical details here.]  —  STAFF: Chief, Deputy Chiefs of Staff, Steven Munoz, Troup Hemenway, and Joseph Guy, Acting Director of ICE, Todd Lyons, CBP Commissioner, Rodney Scott, Liaison Officer, DoD, Philip Hegseth",
    "url": "https://newrepublic.com/article/198689/department-homeland-security-memo"
  },
  {
    "text": "Federal judges side with Trump on ending union bargaining for federal workers  —  A federal appeals court on Friday sided with the Trump administration, lifting a temporary block on a March executive order that prevented government workers from union bargaining.",
    "url": "https://thehill.com/homenews/administration/5433509-federal-employees-trump-order-union-ruling/"
  },
  {
    "text": "Unmasked: the man behind one of the fastest growing far-right YouTube channels  —  Chris Booth's channel - rife with neo-Nazi ideology, antisemitism and racism - garnered 2.3m views and likely thousands of dollars from YouTube in about two months  —  The Guardian has identified the self-described … ",
    "url": "https://www.theguardian.com/us-news/2025/aug/02/christopher-booth-far-right-youtube-channel"
  },
  {
    "text": "Four people dead in Montana bar shooting, suspect at large  —  Four people are dead after a shooting at a bar in Anaconda, Montana, Friday morning, the Montana Division of Criminal Investigation said in a news release.  —  Anaconda-Deer Lodge County Law Enforcement Center said in a Facebook post … ",
    "url": "https://cnn.com/2025/08/01/us/anaconda-montana-shooting"
  },
  {
    "text": "Trump Administration Suspends UCLA Grants After Rights Probe  —  The federal government is suspending certain research funding to the University of California at Los Angeles over concerns about antisemitism and bias on campus, hitting one of the most prestigious public higher-education systems in the US.",
    "url": "https://www.bloomberg.com/news/articles/2025-08-01/trump-administration-suspends-ucla-grants-after-rights-probe"
  },
  {
    "text": "Judges Keep Restrictions on L.A. Immigration Arrests, in Setback for Trump Agenda  —  An appellate panel upheld a finding that federal agents appeared to rely exclusively on race and other factors, such as speaking Spanish, in making arrests.  —  The Trump administration's agenda suffered … ",
    "url": "https://www.nytimes.com/2025/08/02/us/los-angeles-immigration-raids-ruling.html"
  },
  {
    "text": "Breaking: Supreme Court, in Order Asking for Additional Briefing in Louisiana Voting Case, Appears to Put the Constitutionality of Section 2 of the Voting Rights Act into Question  —  The Supreme Court just issued this order:  —  Louisiana had to create that second majority-minority district … ",
    "url": "https://electionlawblog.org/?p=151301"
  },
  {
    "text": "Stagflation fears are back  —  America is showing new signs of stagflation — inflation running hotter, the job market suffering new weakness, and economists warning both are at risk of getting worse in the months ahead.  —  Why it matters: The word “stagflation” revives miserable memories of the 1970s … ",
    "url": "https://www.axios.com/2025/08/02/stagflation-economy-inflation-growth-trump"
  },
  {
    "text": "ChatGPT users shocked to learn their chats were in Google search results … Faced with mounting backlash, OpenAI removed a controversial ChatGPT feature that caused some users to unintentionally allow their private—and highly personal—chats to appear in search results.",
    "url": "https://arstechnica.com/tech-policy/2025/08/chatgpt-users-shocked-to-learn-their-chats-were-in-google-search-results/"
  },
  {
    "text": "Republican-led House committee postpones Ghislaine Maxwell deposition  —  Rep. James Comer, chair of the House Oversight Committee, indicated that next steps will be determined after the Supreme Court decides whether to review Maxwell's appeal.  —  Congressional testimony … ",
    "url": "https://www.nbcnews.com/politics/congress/house-oversight-committee-postpones-ghislaine-maxwell-deposition-rcna222571"
  },
  {
    "text": "HHS further constrains certain vaccine advisers to the CDC, limiting their input in evidence reviews  —  In a further jolt to the process of reviewing and recommending vaccines at the US Centers for Disease Control and Prevention, another group of outside advisers to the agency was abruptly sidelined this week.",
    "url": "https://cnn.com/2025/08/01/health/hhs-liaison-acip-vaccine-advisers-cdc"
  },
  {
    "text": "Donor List Suggests Scale of Trump's Pay-for-Access Operation  —  A new disclosure shows how corporations and individuals, including many in the crypto business, wrote big checks while seeking favor from the president.  —  When the cryptocurrency entrepreneur Eric Schiermeyer heard … ",
    "url": "https://www.nytimes.com/2025/08/02/us/politics/donor-list-suggests-scale-of-trumps-pay-for-access-operation.html?unlocked_article_code=1.bE8.Wn42.PdtHlbwcmiI0&smid=url-share"
  },
  {
    "text": "Not With a Bang, but With a Truth Social Post  —  The president is rattling a nuclear saber as a distraction.  —  Donald Trump, beset by a week of bad news, has decided to rattle the most dangerous saber of all.  In a post today on his Truth Social site, the president claimed that in response … ",
    "url": "https://www.theatlantic.com/ideas/archive/2025/08/trump-nuclear-threat/683748/?gift=otEsSHbRYKNfFYMngVFweFsucCt1MxiecWXagznU0ww&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Ex-Trump prosecutor Jack Smith under investigation by Office of Special Counsel after claims of playing politics: ‘No one is above the law’  —  The Office of Special Counsel has launched a formal investigation into Jack Smith, the first official legal probe into his conduct, The Post has learned.",
    "url": "https://nypost.com/2025/08/01/us-news/official-investigation-into-trump-prosecutor-jack-smith-launched/"
  }
]