[
  {
    "text": "Republicans ramp up search for an escape hatch from speaker chaos  —  A bipartisan solution to the GOP's leadership problems still sounds farfetched to most.  But then, so does Jim Jordan's prospects of winning next week.  —  Centrists are signaling they're open to a deal.  Democrats are outlining terms.",
    "url": "https://www.politico.com/news/2023/10/13/stopgap-speaker-00121409"
  },
  {
    "text": "GOP lawmaker plans to launch a bid for House speaker if Jim Jordan falls short  —  Rep. Mike Johnson, R-La., is laying the groundwork to seek the speaker's gavel if Rep. Jim Jordan, the party's current nominee, is unable to get the votes needed on the House floor.",
    "url": "https://www.nbcnews.com/politics/congress/mike-johnson-plans-launch-house-speaker-bid-jim-jordan-falters-rcna120403"
  },
  {
    "text": "Democrats refuse to help GOP out of House speaker mess, trashing Jim Jordan as an ‘insurrectionist’  —  Democratic leaders spoke on the steps of the Capitol and dialed up their rhetoric against Republicans for nominating a conservative firebrand to be the next House speaker.",
    "url": "https://www.nbcnews.com/politics/congress/democrats-refuse-help-republicans-house-speaker-mess-rcna120242"
  },
  {
    "text": "Israel-Hamas war: Palestinians flee within Gaza after Israel stages brief ground incursions  —  Israel Defense Forces release footage of assault on Gaza-adjacent outpost  —  Palestinians flee northern Gaza after Israel orders 1 million to evacuate as ground attack looms",
    "url": "https://apnews.com/article/israel-palestinians-gaza-hamas-war-785e0eb833715354cade4694e8ccbf67"
  },
  {
    "text": "Americans Might Leave Gaza on Saturday, Says US Official  — Israel and Egypt to allow opening of Rafah crossing: official  — It's unclear if Hamas will agree to that, the US official says  —  American citizens in the Gaza Strip may be allowed to leave on Saturday, according to a US official with knowledge of the situation.",
    "url": "https://www.bloomberg.com/news/articles/2023-10-14/americans-may-be-allowed-to-leave-gaza-on-saturday-us-official"
  },
  {
    "text": "Trump falsely characterized Israel's role in his administration's hit on Iran's Soleimani, say former U.S. officials  —  “They were never on board with it,” said a former senior White House official, referring to the Israelis.  “They always thought it was a dangerous and destabilizing idea.”",
    "url": "https://www.nbcnews.com/politics/national-security/trump-mischaracterized-israel-role-hit-iran-soleimani-rcna120368"
  },
  {
    "text": "Inside Trump's Backroom Effort to Lock Up the Nomination  —  As the former president dodges debates, it can seem as if he's bypassing the primary.  But he and his team have been working quietly to twist the delegate rules in their favor.  —  Not long after the new chairman of the Republican Party … ",
    "url": "https://www.nytimes.com/2023/10/14/us/politics/trump-delegate-strategy.html"
  },
  {
    "text": "‘Top secret’ Hamas documents show that terrorists intentionally targeted elementary schools and a youth center  —  Maps and documents recovered from the bodies of Hamas attackers reveal a coordinated plan to target children and take hostages inside an Israeli village near Gaza.",
    "url": "https://www.nbcnews.com/news/investigations/top-secret-hamas-documents-show-terrorists-intentionally-targeted-elem-rcna120310"
  },
  {
    "text": "Michael Cohen Set to Skip Trump Bank Fraud Trial Testimony  —  Cohen is poised to be a star witness in the New York AG's case against his former boss, but he is planning to skip his appearance next week. … Michael Cohen, the archenemy of Donald Trump, was set to be the star witness at the ex-president's ongoing bank fraud trial.",
    "url": "https://www.thedailybeast.com/michael-cohen-set-to-skip-donald-trump-new-york-bank-fraud-trial-testimony"
  },
  {
    "text": "France Deploys 7,000 Troops After a Fatal School Stabbing  —  France will mobilize up to 7,000 soldiers to increase security around the country after a teacher was fatally stabbed and three other people wounded in a school attack by a former student suspected of Islamic radicalization, the president's office said Saturday.",
    "url": "https://www.bloomberg.com/en/news/thp/2023-10-14/france-is-deploying-7-000-troops-after-a-deadly-school-stabbing-by-a-suspected-islamic-radical"
  },
  {
    "text": "The Real Danger in Robert F. Kennedy Jr.'s Independent Run  —  Most of the concern over the independent presidential campaigns of Robert F. Kennedy Jr., Cornel West and the No Labels party has focused on the risk that they could draw votes away from President Biden and throw the 2024 election to Donald Trump.",
    "url": "https://www.nytimes.com/2023/10/14/opinion/the-real-danger-in-robert-f-kennedy-jrs-independent-run.html"
  },
  {
    "text": "Israel Is Walking Into a Trap  —  Storming into Gaza will fulfill Hamas's wish.  —  It's a trap.  Hamas's ruthless and spectacular attack on southern Israel last Saturday was many things: an atrocity, a display of militant ingenuity, and a demonstration of the weakness of Israeli intelligence and defenses.",
    "url": "https://www.theatlantic.com/international/archive/2023/10/israel-hamas-war-iran-trap/675628/"
  },
  {
    "text": "How Kari Lake's Tactical Retreat on Abortion Could Point the Way for the G.O.P.  —  Kari Lake, along with other Republicans in battleground states, has come out against a national ban as candidates try to attract general election voters.  Anti-abortion activists aren't pleased.",
    "url": "https://www.nytimes.com/2023/10/14/us/politics/kari-lake-senate-republicans-abortion.html"
  },
  {
    "text": "4 Democratic centrists to McHenry: Let's make a deal  —  In a letter to McHenry that was obtained by POLITICO, the Democrats floated giving him “temporary, expanded authorities” — in exchange for concessions.",
    "url": "https://www.politico.com/live-updates/2023/10/13/congress/dems-to-mchenry-00121499"
  }
]