[
  {
    "text": "World Central Kitchen Says U.S. Citizen Among 7 Staff Killed in ‘Targeted’ Triple Israeli Attack  —  ‘UNFORGIVABLE’  —  José Andrés' international aid organization said it would pause its work in Gaza in the wake of the killings.  —  A dual U.S.-Canadian citizen … ",
    "url": "https://www.thedailybeast.com/world-central-kitchen-says-us-citizen-among-7-staff-killed-in-targeted-triple-israeli-attack"
  },
  {
    "text": "Blinken calls for ‘swift, impartial investigation’ into killing of aid workers in Gaza airstrike  —  U.S. Secretary of State says Israel must “do more” to protect civilians.  —  PARIS  — The U.S. has urged a speedy and independent investigation into an Israeli strike that killed seven staff members … ",
    "url": "https://www.politico.eu/article/blinken-calls-swift-impartial-investigation-killing-aid-workers-gaza/"
  },
  {
    "text": "House Republicans push to rename DC international airport after Trump  —  ‘In my lifetime, our nation has never been greater than under the leadership of President Donald J Trump’: Reschenthaler  —  FIRST ON FOX: A group of House Republicans is pushing to rename Washington, D.C.'s … ",
    "url": "https://www.foxnews.com/politics/house-republicans-push-rename-dc-international-airport-trump"
  },
  {
    "text": "House Republicans push to rename Dulles airport after Trump … - The airport is currently named for John Foster Dulles, a former secretary of state under President Dwight Eisenhower who fought against communism during the early stages of the Cold War.  — The bill was first reported by Breitbart News.",
    "url": "https://www.axios.com/2024/04/02/house-republicans-trump-dulles-airport"
  },
  {
    "text": "‘The threat is very real’: Trump's defense of his attacks is rejected  —  Donald Trump has and continues to benefit enormously from the overlap of his campaign and his legal travails.  —  For all of his complaints about the timing and his insistence that his various indictments and trials … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/02/trump-gag-order-politics-legal-cases/"
  },
  {
    "text": "Democrats eye Florida after abortion ruling  —  Good morning, Early Birds.  April is the cruelest month.  Tips: earlytips@washpost.com.  Was this forwarded to you?  Sign up here.  Thanks for waking up with us.  —  In today's edition ...  Nevadans are close to securing abortion ballot measure … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/02/democrats-eye-florida-after-abortion-ruling/"
  },
  {
    "text": "Arizona abortion rights amendment backers says they've gathered signatures needed for 2024 ballot  —  First to NBC News: Arizona for Abortion Access says it's exceeded the state petition signature threshold by over 120,000, with plans to keep gathering until a July 3 deadline.",
    "url": "https://www.nbcnews.com/politics/2024-election/arizona-abortion-rights-amendment-backers-says-gathered-signatures-nee-rcna145922"
  },
  {
    "text": "RFK Jr. rebuked for calling Biden bigger threat to democracy than Trump  —  Independent presidential candidate Robert F. Kennedy Jr. repeatedly advanced an argument Monday that President Biden poses a greater threat to democracy than Donald Trump, a comment that drew swift rebukes from several historians and experts.",
    "url": "https://www.washingtonpost.com/elections/2024/04/02/rfk-jr-biden-trump-democracy/"
  },
  {
    "text": "Misinformation-spouting RFK Jr. muses that Biden is threat to democracy  —  In late January 2021, with thousands of people dying from covid-19 each day and the first vaccines targeting the coronavirus rolling out, baseball legend Hank Aaron died.  —  Robert F. Kennedy Jr. … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/02/rfk-jr-biden-trump-threat/"
  },
  {
    "text": "The Republican party has become a full-fledged anti-sex movement  —  The conservative obsession with purity and control is being achieved by increasingly punitive means  —  The US supreme court justices Samuel Alito and Clarence Thomas cited the Comstock Act, named after the 19th-century … ",
    "url": "https://www.theguardian.com/commentisfree/2024/apr/02/the-republican-party-has-become-a-full-fledged-anti-sex-movement"
  },
  {
    "text": "Video shows California police fatally shooting teenager who was reported kidnapped  —  Revealed: Savannah Graziano, 15, shot by sheriff's deputies in 2022 while unarmed and following instructions to move toward them  —  Newly released law enforcement footage captures the moment California police fatally shot … ",
    "url": "https://www.theguardian.com/us-news/2024/apr/01/california-police-video-shooting-15-year-old-girl-savannah-graziano"
  },
  {
    "text": "Allies consider moving Ukraine arms group into NATO to shield it from Trump  —  Officials are expected to discuss gradually moving the organization — called the Ukraine Defense Contact Group — into the alliance's control.  —  The U.S. and other Western countries are considering transferring … ",
    "url": "https://www.politico.com/news/2024/04/02/allies-consider-moving-ukraine-arms-group-into-nato-to-shield-it-from-trump-00150151"
  },
  {
    "text": "Manufacturing discontent  —  How Dems can fight back against Republican resentment politics. … It's become something of a cottage industry to explore how white rural animus gives much-needed support to Republican candidates in local, state, and national elections.",
    "url": "https://www.publicnotice.co/p/white-maga-rural-rage-how-to-counter-it"
  },
  {
    "text": "The Russian Army Just Launched The Biggest Tank Assault Of The War  —  Forty-eight tanks and fighting vehicles attacked along a single road west of Avdiivka—and got massacred  —  On Saturday, the Russian army launched what may have been one of the largest-scale tank assaults of Russia's 25-month wider war on Ukraine.",
    "url": "https://www.forbes.com/sites/davidaxe/2024/03/31/the-russian-army-just-launched-the-biggest-tank-assault-of-the-war/"
  },
  {
    "text": "Corporate profit bonanza  —  In the last three months of 2023, after-tax corporate profits reached an all-time high of $2.8 trillion.  This is part of a long-term growth in corporate profits that began in the 1980s, picked up steam at the turn of the millennium, and exploded since 2020.",
    "url": "https://popular.info/p/corporate-profit-bonanza"
  },
  {
    "text": "A federal judge says migrants can sue the company that flew them to Martha's Vineyard  —  MIAMI — A federal judge in Boston has ruled that migrants flown from Texas to Martha's Vineyard in 2022 can proceed with a lawsuit against the Florida company that took them there.",
    "url": "https://www.npr.org/2024/04/01/1242131130/migrants-lawsuit-flown-marthas-vineyard-texas-florida-governor-ron-desantis"
  },
  {
    "text": "Readout of President Joe Biden's Call with President Xi Jinping of the People's Republic of China  —  President Joseph R. Biden, Jr. spoke today with President Xi Jinping of the People's Republic of China (PRC).  The call follows the two leaders' meeting in Woodside, California in November 2023.",
    "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/02/readout-of-president-joe-bidens-call-with-president-xi-jinping-of-the-peoples-republic-of-china/"
  },
  {
    "text": "Jon Stewart: Apple ‘Did Not Want’ Interview With FTC Chair Lina Khan  —  “They literally said, 'Please don't talk to her,'” Stewart recalled Apple telling him while speaking with Khan on Monday.  —  LOADING  —  Jon Stewart said Monday night that Apple asked him not to interview Lina Khan … ",
    "url": "https://www.huffpost.com/entry/jon-stewart-apple-lina-khan-interview_n_660c1c5ae4b09f580bc59700"
  },
  {
    "text": "Fire tears through nightclub and apartment building in Istanbul, killing at least 29 people: “I've lost four friends”  —  A fire that raged from the basement of a 16-story building in central Istanbul killed at least 29 people Tuesday, with flames and thick smoke billowing for hours despite a massive emergency response.",
    "url": "https://www.cbsnews.com/news/istanbul-fire-dozens-killed-nightclub-apartment-building/"
  },
  {
    "text": "Arizona Democrat announces cancer diagnoses  —  Rep. Raúl Grijalva (D-Ariz.) announced on Tuesday that he has been diagnosed with cancer.  —  Grijalva, who has represented Arizona's 7th Congressional District since 2003, said in a statement that he had sought treatment for a persistent cough several weeks ago.",
    "url": "https://thehill.com/homenews/house/4570157-arizona-democrat-grijalva-cancer/"
  },
  {
    "text": "Tulsi Gabbard turned down RFK Jr.'s offer to be his running mate, she says  —  “It didn't work out,” a source close to him said.  —  Tulsi Gabbard attends a live taping of Hannity at Fox News Channel Studios, Sept. 13, 2023, in New York.  Independent presidential candidate Robert F. Kennedy Jr. speaks … ",
    "url": "https://abcnews.go.com/Politics/tulsi-gabbard-turned-rfk-jrs-offer-running-mate/story?id=108723568"
  },
  {
    "text": "Fake right-wing panic about “trans” Easter is part of Trump's push for Christian nationalism  —  Phony claims that Democrats “mock your faith” are a cynical excuse to strip Americans of religious freedom  —  Most Americans spent Easter weekend with traditional activities like church or egg hunts … ",
    "url": "https://www.salon.com/2024/04/02/fake-right-wing-panic-about-trans-easter-is-part-of-push-for-christian-nationalism/"
  },
  {
    "text": "Biden administration announces requirement for 2-person crews on freight trains  —  The U.S. Department of Transportation issued a final rule Tuesday increasing the minimum size for train crews to two people, a longtime ask for rail worker unions, which nearly led to a strike in 2022.",
    "url": "https://thehill.com/policy/4569876-biden-administration-announces-requirement-two-person-crews-freight-trains/"
  },
  {
    "text": "With enthusiasm, Raffensperger advises Larry David to curb attacks on voter law  —  Top elections official responds to HBO show's brush with Georgia ban on distribution of food or drink to voters with pretty, pretty, pretty cutting letter  —  Larry David, heading into his final episode of HBO's … ",
    "url": "https://www.ajc.com/politics/with-enthusiasm-raffensperger-advises-larry-david-to-curb-attacks-on-voter-law/GW5XLU53EFE6BIOYRTLSZW2S7Y/"
  },
  {
    "text": "New York judge says FDNY booing of Letitia James, pro-Trump chants not about politics, ‘has to do with race’  —  Brooklyn federal judge suggests recent incident is evidence of racist culture at FDNY  —  Brooklyn Federal Court Judge Nicholas Garaufis reportedly cited the incident involving members … ",
    "url": "https://www.foxnews.com/politics/new-york-judge-says-fdny-booing-letitia-james-pro-trump-chants-not-about-politics-race"
  }
]