[
  {
    "text": "Sunday Snapshot: Trump's NSFW joke NBD for GOP … 1. Johnson: Trump's crude comment just rally “fun” … But now, they're brushing aside questions about his rhetoric, saying political dialogue should be about policy — even when the former president is speaking publicly about a golf pro's genitalia.",
    "url": "https://www.axios.com/2024/10/20/trump-arnold-palmer-snapshot"
  },
  {
    "text": "Mike Johnson Doesn't Want to Hear About Trump Discussing Arnold Palmer's Manhood  —  “Don't say it again.  We don't have to say it.  I get it,” the House speaker said testily when asked about the comments  —  House Speaker Mike Johnson doesn't want to hear about Arnold Palmer's johnson.",
    "url": "https://www.rollingstone.com/politics/politics-news/mike-johnson-trump-arnold-palmer-manhood-1235138445/"
  },
  {
    "text": "Speaker Johnson Refuses To Play Ball When Asked About Trump's Bizarre Arnold Palmer Penis Banter  —  During a Saturday rally, the former president shared a bizarre story that ended with his thoughts about the golfer's genitalia.  —  LOADING  —  Jake Tapper couldn't get a straight answer … ",
    "url": "https://www.huffpost.com/entry/mike-johnson-donald-trump-penis-comments_n_67152f00e4b03a110eb49674"
  },
  {
    "text": "GOP Gov. Sununu: 'I don't like' Trump's rhetoric, but it's ‘nothing new’  —  Voters have “heard that, that's established,” he said of Trump's behavior.  —  Gov. Chris Sununu, R-N.H., on “This Week.”  —  New Hampshire Gov. Chris Sununu, a Donald Trump supporter, said he isn't a fan … ",
    "url": "https://abcnews.go.com/Politics/gop-gov-sununu-trumps-rhetoric-new/story?id=114960034"
  },
  {
    "text": "Shapiro Wants Musk Investigated for Giving Cash to Registered Voters  —  The Pennsylvania governor suggested that law enforcement “take a look at” the billionaire's million dollar giveaway to registered voters who sign his PAC's petition … Musk has vowed to give away one million dollars each … ",
    "url": "https://www.rollingstone.com/politics/politics-news/shapiro-elon-musk-million-cash-giveaway-1235138501/"
  },
  {
    "text": "Pennsylvania Gov. Shapiro: Law enforcement should ‘take a look at’ Elon Musk voter payments  —  On Saturday, Musk announced that he would pay registered voters $1 million per day until Election Day to sign a petition circulated by his super PAC.  —  Pennsylvania Gov. Josh Shapiro on Sunday … ",
    "url": "https://www.nbcnews.com/politics/2024-election/pennsylvania-gov-shapiro-law-enforcement-take-look-elon-musk-voter-pay-rcna176279"
  },
  {
    "text": "Trump Makes Fries at McDonald's in Bizarre Attempt to Troll Harris  —  The former president contends — without any evidence — that his opponent never worked at the fast food restaurant as she has said  —  Donald Trump is spending part of his Sunday afternoon behind the counter at a Pennsylvania McDonald's.",
    "url": "https://www.rollingstone.com/politics/politics-news/trump-mcdonalds-troll-harris-1235138509/"
  },
  {
    "text": "The Very Real Scenario Where Trump Loses and Takes Power Anyway  —  If Trump overturns the 2024 election, here's how it could happen.  —  Four years ago, a sitting president — rejected by American voters — attempted to seize a second term anyway, plunging the nation into confusion, conflict and, in its last gasp, violence.",
    "url": "https://www.politico.com/news/magazine/2024/10/20/trump-overturn-2024-election-plan-00184103"
  },
  {
    "text": "This HAS To Be Normal  —  Nazism is on the ballot this year, and people who consider themselves Nazis know it, even if so many of the rest of us seem not to want to.  So it came to pass that Nazis came to the pro-Trump boat show in Jupiter Florida last week.",
    "url": "https://www.the-reframe.com/this-has-to-be-normal/"
  },
  {
    "text": "Sen. Lindsey Graham to Republicans supporting Harris: ‘What the hell are you doing?’  —  The senator on Sunday blasted those in the GOP who are backing the Vice President's campaign, saying “You're supporting the most radical nominee in the history of American politics.”",
    "url": "https://www.nbcnews.com/politics/2024-election/lindsey-graham-republicans-supporting-harris-hell-are-you-doing-rcna176277"
  },
  {
    "text": "Trump had little regard for the Constitution while in office.  He's an even bigger threat to the rule of law now.  —  Trump had little regard for the Constitution while in office.  He's an even bigger threat to the rule of law now.  Because of the Supreme Court's ill-conceived presidential immunity ruling … ",
    "url": "https://www.inquirer.com/opinion/editorials/inq2/trump-threat-putin-manchurian-candidate-rule-law-20241020.html#loaded"
  },
  {
    "text": "Trump Media Whistleblower Blasts Company for Outsourcing Jobs Abroad as Betrayal of “America First”  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  An internal whistleblower complaint … ",
    "url": "https://www.propublica.org/article/trump-media-whistleblower-complaint-devin-nunes"
  },
  {
    "text": "Harris has no current plans to campaign with Biden before Election Day  —  While Harris is set to campaign with the Obamas, the president plans to do behind-the-scenes outreach to labor leaders and White House events highlighting his record.  —  WASHINGTON — With just two weeks left in the 2024 campaign … ",
    "url": "https://www.nbcnews.com/politics/kamala-harris-no-current-plans-campaign-biden-election-day-rcna176254"
  },
  {
    "text": "The CIA analyst who triggered Trump's first impeachment asks: Was it worth it?  —  The whistleblower's lonely stand upended his career and put his life at risk.  Now he's speaking about it for the first time.  —  The young CIA analyst waited anxiously for Fiona Hill to pick up her phone.",
    "url": "https://www.washingtonpost.com/politics/2024/10/20/cia-analyst-whistleblower-trump-impeachment-ukraine/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI5Mzk2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzMwNzgyNzk5LCJpYXQiOjE3MjkzOTY4MDAsImp0aSI6IjM5NmZmZDc2LTA5NDctNDhmOC1iYzAwLTIyOGEyNmY4ZTYyNCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzEwLzIwL2NpYS1hbmFseXN0LXdoaXN0bGVibG93ZXItdHJ1bXAtaW1wZWFjaG1lbnQtdWtyYWluZS8ifQ.qhC77t1wZ4UCKBXFk9K-Wy_bKNAT-Spp-SxUKteiN5s&itid=gfta"
  },
  {
    "text": "Exclusive -Trump: Madison Square Garden Rally ‘Sold Out in Less than 3 Hours’, ‘Going to Be Fantastic’  —  Former President Donald Trump told Breitbart News in an exclusive interview on Sirius XM that his rally at Madison Square Garden next weekend sold out in mere hours.",
    "url": "https://www.breitbart.com/politics/2024/10/20/exclusive-trump-madison-square-garden-rally-sold-out-in-less-than-3-hours-going-to-be-fantastic/"
  },
  {
    "text": "VOICES: One vote for Sherrod Brown  —  I have always run for office under the banner of the Republican Party, am a conservative and usually vote a straight Republican ticket.  Although still a Republican, I will be making an exception this year in Ohio's U.S. Senate race by supporting Sherrod Brown.",
    "url": "https://www.daytondailynews.com/ideas-voices/voices-one-vote-for-sherrod-brown/FCBQW3SBFVCFXBRJK5LWTMN4SA/"
  },
  {
    "text": "Who's Mailing the Catholic Tribune?  It's Not the Church, It's Partisan Media.  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up for Dispatches, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.",
    "url": "https://www.propublica.org/article/church-no-affiliation-catholic-tribune-metric-media"
  },
  {
    "text": "At least 7 dead in Georgia dock collapse on US Atlantic coast  —  At least seven people were killed after part of a boat dock collapsed, sending at least 20 into the Atlantic waters off the coast of the U.S. state of Georgia.  —  U.S. Coast Guard ships were searching Saturday night for missing people.",
    "url": "https://www.reuters.com/world/us/least-7-dead-georgia-dock-collapse-us-atlantic-coast-2024-10-20/"
  }
]