[
  {
    "text": "Bragg Soldiers Who Cheered Trump's Political Attacks While in Uniform Were Checked for Allegiance, Appearance  —  It was supposed to be a routine appearance, a visit from the commander in chief to rally the troops, boost morale and celebrate the Army's 250th-birthday week … ",
    "url": "https://www.military.com/daily-news/2025/06/11/bragg-soldiers-who-cheered-trumps-political-attacks-while-uniform-were-checked-allegiance-appearance.html"
  },
  {
    "text": "Fulbright Board Resigns After Accusing Trump Aides of Political Interference  —  The board of the prestigious program told the State Department it had no right to cancel scholarships for nearly 200 American professors and researchers.  —  The dozen board members of the prestigious Fulbright program … ",
    "url": "https://www.nytimes.com/2025/06/11/us/politics/fulbright-board-resign-trump.html?unlocked_article_code=1.OE8.f7MK.2K1LptU6rpPw&smid=url-share"
  },
  {
    "text": "Entire Fulbright board quits in mass revolt over Trump assault  —  In a stunning institutional revolt against Donald Trump, the entire 12-member board overseeing America's most prestigious international scholarship program resigned en masse Wednesday, blasting the administration … ",
    "url": "https://www.rawstory.com/trump-quit-programs/"
  },
  {
    "text": "Majority Of Voters Oppose GOP Budget Bill, With Just 67% Of Republicans In Support, Quinnipiac University National Poll Finds; Trump Job Approval: 38%, His Handling Of Russia - Ukraine War Lowest Among List Of Issues  — mail_outline  —  As the Senate debates the GOP tax … ",
    "url": "https://poll.qu.edu/poll-release?releaseid=3924"
  },
  {
    "text": "Donald Trump responds to Elon Musk's late-night apology after ugly public feud  —  WASHINGTON — President Trump is feeling good about Elon Musk's apology after the former “first buddy” admitted late Tuesday he had gone “too far” in his personal attacks on the commander-in-chief.",
    "url": "https://nypost.com/2025/06/11/us-news/donald-trump-responds-to-elon-musks-apology-after-public-feud/"
  },
  {
    "text": "Some Trump Officials Now Fear Elon's ‘Burn Book’  —  “What does he have on us?”  —  It's been less than a week since the explosive, extremely public breakdown in relations between Donald Trump, the most powerful person on the planet, and Elon Musk, the world's richest man.",
    "url": "https://www.rollingstone.com/politics/politics-features/elon-musk-burn-book-anxiety-trump-officials-1235361614/"
  },
  {
    "text": "Capitol agenda: The GOP's latest megabill casualties  —  House Republicans will vote to make difficult changes to the GOP megabill Wednesday in an attempt to keep the bill on track in the Senate.  The House Rules Committee teed up a provision Tuesday night that would scrub the House-passed bill … ",
    "url": "https://www.politico.com/live-updates/2025/06/11/congress/republican-megabill-house-rules-committee-proposals-00398951"
  },
  {
    "text": "Trump's Fury at Gavin Newsom Backfires—and Reveals His Own Weakness  —  With President Donald Trump sending more troops into Los Angeles amid protests there, a remarkable image has gone viral on social media.  It shows members of the National Guard crowded into a sterile-looking office … ",
    "url": "https://newrepublic.com/article/196674/trump-gavin-newsom-fury-backfires-reveals-weakness"
  },
  {
    "text": "National Guard troops have temporarily detained civilians in LA protests, commander says  —  National Guard troops already have temporarily detained civilians in the Los Angeles protests over immigration raids, the commander in charge said Wednesday, but they quickly turned them over to law enforcement.",
    "url": "https://apnews.com/article/national-guard-immigration-raids-los-angeles-c9957a0d4ded48e40ce78efb0b7a8fbf"
  },
  {
    "text": "Guard Soldiers Deployed in Trump's LA Crackdown Aren't Getting Paid Yet  —  The 4,000 California National Guard soldiers who President Donald Trump surged into Los Angeles remain unpaid due to delays in issuing official activation orders, leaving compensation and benefits in limbo.",
    "url": "https://www.military.com/daily-news/2025/06/11/guard-soldiers-deployed-trumps-la-crackdown-arent-getting-paid-yet.html"
  },
  {
    "text": "Brian Wilson, Beach Boys visionary leader and summer's poet laureate, dies at 82  —  Brian Wilson, the Beach Boys' visionary and fragile leader whose genius for melody, arrangements and wide-eyed self-expression inspired “Good Vibrations,” “California Girls” and other summertime anthems … ",
    "url": "https://apnews.com/article/brian-wilson-dies-beach-boys-2272762e46c46820a7af09ffc73cb9a6"
  },
  {
    "text": "Trump Wants to Be a Strongman, but He's Actually a Weak Man  —  President Trump thinks it is a sign of strength to send in troops to deal with protesters in Los Angeles.  To that end, he has federalized a portion of the California National Guard and mobilized nearby Marines to support Immigration … ",
    "url": "https://www.nytimes.com/2025/06/11/opinion/trump-los-angeles-ice-strongman.html?unlocked_article_code=1.OE8.E5I6.RwfRanUrJCEw&smid=url-share"
  },
  {
    "text": "David Hogg to Exit D.N.C. After Backlash to His Primary Plan  —  Mr. Hogg said he would not run again for vice chair after the party voted for a new election.  Democrats have been furious at his plan to challenge the party's sitting lawmakers in primary races.",
    "url": "https://www.nytimes.com/2025/06/11/us/politics/david-hogg-dnc-democrats.html"
  },
  {
    "text": "GOP Senators Freak Out When Asked About Trump's Military Parade Costing $45 Million  —  Some ducked into elevators.  Some stared into space.  “I answered the question I wanted to answer!”  Sen. Todd Young (R-Ind.) snapped.  —  WASHINGTON - They snapped.  They stared off into space.",
    "url": "https://www.huffpost.com/entry/gop-senators-trump-military-parade-cost_n_6849b95de4b0cf5f0c9ad0ab"
  },
  {
    "text": "US prepares to order departure of all nonessential staff from Baghdad embassy, officials say  —  The State Department is preparing to order the departure of all nonessential personnel from the U.S. Embassy in Baghdad due to the potential for regional unrest, two U.S. officials said Wednesday.",
    "url": "https://apnews.com/article/state-department-embassy-baghdad-f892ebd6a50850ef5650f31819541bff"
  },
  {
    "text": "CDC backtracks on layoffs, rehires more than 400 people  —  Around half of those employees are in the National Center for HIV, Viral Hepatitis, STD, and Tuberculosis Prevention.  —  The Centers for Disease Control and Prevention is reinstating more than 400 people who had received layoff notices … ",
    "url": "https://www.politico.com/news/2025/06/11/cdc-backtracks-on-layoffs-rehires-more-than-400-people-00400404"
  },
  {
    "text": "EPA moves to repeal limits on greenhouse gas emissions by power plants  —  The EPA announced proposals to significantly loosen Biden-era regulations on pollution from power plants, including mercury and carbon dioxide.  —  The Environmental Protection Agency announced Wednesday a proposal … ",
    "url": "https://www.washingtonpost.com/climate-environment/2025/06/11/epa-climate-rollback-emissions/"
  },
  {
    "text": "Judge Opens Door to Releasing Mahmoud Khalil as Soon as This Week  —  Mr. Khalil, a legal permanent resident, has been held in Louisiana for more than three months.  The judge suggested he could be released as early as Friday unless the government successfully appeals.",
    "url": "https://www.nytimes.com/2025/06/11/nyregion/mahmoud-khalil-release-order.html"
  },
  {
    "text": "Where are the people the Trump administration has deported?  —  The Trump administration's aggressive immigration deportation efforts often have been carried out illegally.  What has happened to the people at the center of the cases?  —  In its first 150 days, the second Trump administration … ",
    "url": "https://www.lawdork.com/p/where-are-the-people-the-trump-administration"
  },
  {
    "text": "U.S. Image Declines in Many Nations Amid Low Confidence in Trump  —  Table of Contents Table of Contents  —  This Pew Research Center analysis focuses on public opinion of the United States and President Donald Trump in 24 countries across North America, Europe, the Middle East … ",
    "url": "https://www.pewresearch.org/global/2025/06/11/us-image-declines-in-many-nations-amid-low-confidence-in-trump/"
  },
  {
    "text": "ICE Arrests Illegal Alien for Molotov Cocktail Attack on Law Enforcement Caught on Video  —  This illegal alien has been charged with attempted murder  —  WASHINGTON - The Department of Homeland Security (DHS) announced Immigration and Customs Enforcement (ICE) arrested Emiliano Garduno-Galvez … ",
    "url": "https://www.dhs.gov/news/2025/06/11/ice-arrests-illegal-alien-molotov-cocktail-attack-law-enforcement-caught-video"
  },
  {
    "text": "The secret police descending on Small Town, U.S.A.  —  Masked immigration officials are storming towns and arresting people.  —  GREAT BARRINGTON, Mass. — Maybe they really were immigration officers, just as they claimed.  Or maybe they were a ragtag vigilante group, arbitrarily snatching brown-looking people off the street.",
    "url": "https://www.washingtonpost.com/opinions/2025/06/11/immigration-arrests-ice-raid-masks/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ5NjE0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzUwOTk2Nzk5LCJpYXQiOjE3NDk2MTQ0MDAsImp0aSI6ImIzYzNkZmY2LTM3OGUtNDE2OS05MzdjLTVlNWQwOTUyNGU5NyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9vcGluaW9ucy8yMDI1LzA2LzExL2ltbWlncmF0aW9uLWFycmVzdHMtaWNlLXJhaWQtbWFza3MvIn0.Y_FWR99bU09JQCwbWczWWN_YEnrAegE-dLLpuSmilqM&itid=gfta"
  },
  {
    "text": "Head of FEMA's storm response center leaving agency amid leadership exodus  —  The head of FEMA's National Response Coordination Center — a position responsible for the government's response to storms — submitted his resignation letter Wednesday and will formally depart the agency in two weeks.",
    "url": "https://www.cbsnews.com/news/jeremy-greenberg-fema-national-response-coordination-center-resigns/"
  },
  {
    "text": "‘No Kings’: Millions to Protest Trump's ‘Dictator-Style Birthday Parade’  —  A national day of protest is set for June 14.  Can non-violent resistance counter Trump's authoritarian show of force?  —  Even before Donald Trump militarized his crackdown on pro-immigrant protesters in Los Angeles … ",
    "url": "https://www.rollingstone.com/politics/politics-features/trump-no-kings-protests-june-14-los-angeles-1235359409/"
  },
  {
    "text": "Hegseth resists when pushed to explain Trump's Air Force One deal  —  Democrats demanded clarity on the president's rationale for pursuing the Qatari luxury jet, but his defiant defense chief gave them little in return.  —  Just now  —  Summary  —  Defense Secretary Pete Hegseth … ",
    "url": "https://www.washingtonpost.com/national-security/2025/06/11/hegseth-trump-air-force-one-qatar/"
  },
  {
    "text": "Dozens Of Journalists Targeted, Shot, Detained While Covering LA Protests, Press Org Says  —  “I never thought for one moment that I'd actually have to be fearful of law enforcement during a public protest,” said one photojournalist hospitalized after getting shot in the leg.",
    "url": "https://www.huffpost.com/entry/journalists-shot-detained-covering-la-immigration-protests_n_68482fd5e4b0c1bc4e818847"
  }
]