[
  {
    "text": "The Afterlife of Donald Trump … Pink.  An ovular rose.  Big and smooth.  A complex commonplace instrument.  And, as far as these things go, a rather nice one.  Isolated from the head and all that roils therein, and to which it is, famously and miraculously, still attached, you have to admit, if you can: It is beautiful.",
    "url": "https://nymag.com/intelligencer/article/donald-trump-ear-campaign-assassination-attempt.html"
  },
  {
    "text": "What If Trump Wins?  —  The chaos and lawlessness of the first term could pale in comparison to what comes next  —  Mark Peterson/Redux  —  Donald Trump was slamming his fist on the Resolute Desk and, once again, calling for blood.  —  It was the second year of his presidency … ",
    "url": "https://www.rollingstone.com/politics/politics-features/if-trump-wins-2024-election-1235096091/"
  },
  {
    "text": "Hypocrisy, Spinelessness, and the Triumph of Donald Trump … In the summer of 2015, back when he was still talking to traitorous reporters like me, I spent extended stretches with Donald Trump.  He was in the early phase of his first campaign for president, though he had quickly made himself … ",
    "url": "https://www.theatlantic.com/magazine/archive/2024/10/trump-gop-support-jd-vance-2024/679564/?gift=guxsrl_dAdXUP9zqbQPWxYJnBthoeKnPRywE75FVwBk&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "As Debate Looms, Trump Is Now the One Facing Questions About Age and Capacity  —  With President Biden no longer in the race, former President Donald J. Trump would be the oldest person ever to serve in the Oval Office.  But his rambling, sometimes incoherent public statements have stirred concern among voters.",
    "url": "https://www.nytimes.com/2024/09/09/us/politics/debate-trump-age-capacity.html?unlocked_article_code=1.JU4.aC9a.ymukJJk9m3W1&smid=url-share"
  },
  {
    "text": "Scoop: Generals come to Harris' defense on Afghanistan … - The push to defend Harris comes from retired military brass, including three with four-stars: Admiral Steve Abbot, who served as deputy homeland security advisor to George W. Bush, Gen. Lloyd W. Newton and Gen. Larry R. Ellis … ",
    "url": "https://www.axios.com/2024/09/09/generals-defend-harris-us-withdrawal-afghanistan"
  },
  {
    "text": "Trump is 78 and barely coherent.  Where's everyone who questioned Biden's age and fitness?  —  Where are the headlines screaming: ‘Deranged old man peddles nonsense while threatening violent deportation of immigrants’?  —  To the pundits and the Republicans who relentlessly decried President … ",
    "url": "https://www.usatoday.com/story/opinion/columnist/2024/09/09/trump-old-incoherent-biden-age-mental-fitness/75138026007/"
  },
  {
    "text": "Leaders of Transnational Terrorist Group Charged with Soliciting Hate Crimes, Soliciting the Murder of Federal Officials, and Conspiring to Provide Material Support to Terrorists  —  For Immediate Release  —  The Justice Department announced today that Dallas Humber, 34, of Elk Grove … ",
    "url": "https://www.justice.gov/opa/pr/leaders-transnational-terrorist-group-charged-soliciting-hate-crimes-soliciting-murder"
  },
  {
    "text": "US charges alleged white supremacist gangsters with trying to incite race war  —  U.S. prosecutors unveiled criminal charges on Monday against two alleged leaders of a white supremacist gang, accusing them of soliciting attacks on Black, Jewish, LGBTQ people and immigrants in hopes of inciting a race war.",
    "url": "https://www.reuters.com/world/us/us-charges-alleged-white-supremacist-gangsters-with-trying-incite-race-war-2024-09-09/"
  },
  {
    "text": "James Earl Jones, acclaimed actor and voice of Darth Vader, dies at 93  —  James Earl Jones, who overcame racial prejudice and a severe stutter to become a celebrated icon of stage and screen — eventually lending his deep, commanding voice to CNN, “The Lion King” and Darth Vader — has died.",
    "url": "https://apnews.com/article/james-earl-jones-dies-19ea259ff3f44b91b2ed8730b702c23f"
  },
  {
    "text": "James Earl Jones Dies: Revered ‘Field Of Dreams’ Star, Darth Vader Voice & Broadway Regular Was 93  —  James Earl Jones, the revered actor who voiced Star Wars villain Darth Vader, starred in Field of Dreams and many other films and Broadway shows and is an EGOT winner, died this morning at his home in Dutchess County, NY.",
    "url": "https://deadline.com/2024/09/james-earl-jones-dead-1236082801/"
  },
  {
    "text": "Tracking the 2024 Election: State by State  —  Ahead of the 2024 presidential election, Morning Consult is conducting thousands of surveys every day, asking U.S. voters if they plan to vote for Vice President Kamala Harris or former President Donald Trump in November.",
    "url": "https://pro.morningconsult.com/trackers/2024-election-state-polls"
  },
  {
    "text": "The right-wing bubble says Trump will save your cat from immigrants  —  False claims and baseless ones are politically useful, so they rocket to the social media accounts of prominent right-wing people.  —  Seemingly out of the blue Monday morning, supporters of former president Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2024/09/09/rumors-about-an-ohio-town-show-scale-right-wing-bubble/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI1ODU0NDAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI3MjM2Nzk5LCJpYXQiOjE3MjU4NTQ0MDAsImp0aSI6IjIxODE3M2M1LTg4MzktNDVjMi04OWYwLTQzYjE1NjNlNTM1OSIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9wb2xpdGljcy8yMDI0LzA5LzA5L3J1bW9ycy1hYm91dC1hbi1vaGlvLXRvd24tc2hvdy1zY2FsZS1yaWdodC13aW5nLWJ1YmJsZS8ifQ.XOey5m8tUaWw0RE0QfFVUpUCH-lKB3gLOhzyckkGIBE&itid=gfta"
  },
  {
    "text": "A New Way Forward  —  Together, we can finish the job for the American people.  Are you with us?  Join our campaign to re-elect Joe Biden today!",
    "url": "https://kamalaharris.com/issues/"
  },
  {
    "text": "When Your Little Ohio Town Becomes Port Au Prince and No One Cares UPDATE  —  The third world used to be something Americans used as a measuring stick to hold against other cities or countries we visited or dealt with.  When I would pull the newspapers back over a child sleeping in a doorway … ",
    "url": "https://hotair.com/tree-hugging-sister/2024/09/09/when-your-little-ohio-town-becomes-port-au-prince-and-no-one-cares-n3794246"
  },
  {
    "text": "Major outlets change standards for hacked emails, protect Trump  —  For weeks, major American media organizations — including The Washington Post, Politico, and the New York Times — have possessed internal Trump campaign documents.  What do these documents say?",
    "url": "https://popular.info/p/major-outlets-change-standards-for"
  },
  {
    "text": "Here is what will happen on day one of Trump's presidency, according to Project 2025  —  As Trump utters the last phrase of the oath of office - ‘so help me God’ - the first phase of what Project 2025's authors call ‘the playbook’ begins  —  It's a cold day in Washington DC in late January 2025.",
    "url": "https://www.theguardian.com/commentisfree/article/2024/sep/09/trump-presidency-day-one-project-2024"
  },
  {
    "text": "To the World, He Is an Anti-Trafficking Hero.  Women Tell a Different Story.  —  Tim Ballard's work on sex trafficking became the basis of the hit movie “Sound of Freedom.”  But a series of women, in lawsuits and interviews, have accused him of being a sex predator.",
    "url": "https://www.nytimes.com/2024/09/09/us/tim-ballard-sound-of-freedom-sex-trafficking.html?unlocked_article_code=1.JU4.JtdB.bz2QeLqu_hYU&smid=url-share"
  },
  {
    "text": "Is the press ‘sanewashing’ Trump?  —  There's a hot new term doing the rounds among media critics: “sanewashing.”  The term itself actually isn't new, and it wasn't born in media-criticism circles, per se; according to Urban Dictionary, it was coined in 2020 on a Reddit page for neoliberals … ",
    "url": "https://www.cjr.org/the_media_today/trump_incoherent_media_sanewashing.php"
  },
  {
    "text": "KFile: Harris told ACLU in 2019 she supports cuts to ICE funding and providing gender transition surgery to detained migrants  —  As Kamala Harris pivots to the political center in her campaign for president, a 2019 questionnaire from a leading civil rights organization spotlights her past support … ",
    "url": "https://www.cnn.com/2024/09/09/politics/kfile-harris-pledged-support-in-2019-to-cut-ice-funding-and-provide-transgender-surgery-to-detained-migrants/"
  },
  {
    "text": "NYPD commissioner expected to step down amid federal probe  —  Edward Caban and his twin brother are ensnared in a widening investigation.  —  NEW YORK — NYPD Commissioner Edward Caban is expected to resign his post in the coming days, following news of a federal investigation involving … ",
    "url": "https://www.politico.com/news/2024/09/09/nypd-commissioner-caban-resign-investigation-00177951"
  },
  {
    "text": "Conservative activist launches $1bn crusade to ‘crush’ liberal America  —  Leonard Leo was architect of effort to secure conservative supermajority on the Supreme Court  —  The conservative activist who led the crusade to overhaul the US legal system is making a $1bn push to “crush liberal dominance” … ",
    "url": "https://www.ft.com/content/0b38aaed-ec58-40cd-9047-0c7b7b83164a"
  },
  {
    "text": "Trump's Angry New Threats of Bloodshed and Revenge Should Alarm Us All  —  In an unhinged weekend rant on social media, Donald Trump made his most expansive threats yet to prosecute his enemies if he wins.  He also flatly threatened at a rally to unleash “bloody” mass removals of migrants.",
    "url": "https://newrepublic.com/article/185712/trumps-angry-new-threats-bloodshed-revenge-alarm-us"
  },
  {
    "text": "Maine Republican Austin Theriault Called Cops On Lawful Gun Owner  —  Theriault, who is running to unseat Rep. Jared Golden (D), says he is a better champion for the Second Amendment.  —  Maine state Rep. Austin Theriault, a Republican running for a critical U.S. House seat as a champion … ",
    "url": "https://www.huffpost.com/entry/austin-theriault-police-call-assault-rifle_n_66da4adee4b0abbb7b4442b1"
  },
  {
    "text": "Germany announces temporary controls on all land borders  —  Germany's government announced temporary border controls at all of the country's land borders on Monday in what it called an attempt to tackle irregular migration and protect the public from threats such as Islamist extremism.",
    "url": "https://www.reuters.com/world/europe/germany-put-temporary-controls-all-land-borders-source-says-2024-09-09/"
  }
]