[
  {
    "text": "Trump kicks off a Pennsylvania rally by talking about Arnold Palmer's genitalia  —  Donald Trump's campaign suggested he would begin previewing his closing argument Saturday night with Election Day barely two weeks away.  But the former president kicked off his rally with a detailed story … ",
    "url": "https://apnews.com/article/trump-arnold-palmer-closing-arguments-latrobe-pennsylvania-2bea9620c523e531a55259200215284e"
  },
  {
    "text": "‘Weak and pathetic’: Trump seethes as Mark Cuban campaigns for Harris … Former President Donald Trump on Saturday railed against fellow billionaire Mark Cuban, who has been vigorously campaigning for his Democratic opponent, Vice President Kamala Harris.  —  “Mark Cuban is a Loser,” Trump wrote in a Saturday Truth Social post.",
    "url": "https://www.cnbc.com/2024/10/19/trump-seethes-mark-cuban-campaigns-harris.html"
  },
  {
    "text": "Elon Musk's Fake Sites and Fake Texts Impersonating the Harris Campaign  —  There's deeply cynical and then there's things which might be illegal.  In the first category we have an Elon Musk-funded PAC microtargeting Jewish and Arab communities with diametrically opposed ads about Kamala Harris's support for Israel or Palestine.",
    "url": "https://talkingpointsmemo.com/edblog/elon-musks-fake-sites-and-texts-impersonating-the-harris-campaign"
  },
  {
    "text": "Montana GOP Senate Hopeful Accused Firefighters Of ‘Milking’ Infernos For Extra Pay  —  Tim Sheehy, who made his fortune in aerial firefighting, has argued that “a lot” of wildland firefighters want to let infernos burn in order to rack up overtime pay.  —  Montana GOP Senate hopeful Tim Sheehy … ",
    "url": "https://www.huffpost.com/entry/montana-gop-tim-sheehy-wildland-firefighters_n_6712a64ce4b03a110eb42f8c"
  },
  {
    "text": "Montana park ranger says Senate candidate Tim Sheehy lied about combat wound  —  Sheehy has claimed that he was wounded in Afghanistan, but ranger says he investigated accidental shooting in park in 2015  —  A former Montana park ranger has now publicly accused Tim Sheehy … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/19/tim-sheehy-gunshot-wound-montana-park-ranger"
  },
  {
    "text": "Exclusive: Trump ground game in key states flagged as potentially fake  —  Data suggests canvassers linked to Elon Musk's America Pac falsely claimed to have visited homes of potential voters  —  Donald Trump's campaign may be failing to reach thousands of voters they hope to turn out in Arizona and Nevada … ",
    "url": "https://www.theguardian.com/us-news/2024/oct/19/trump-campaign-leaked-data-voters-elon-musk"
  },
  {
    "text": "How Trump's Cockiness Could Cost Him Votes  —  The GOP loves to pretend they are winning, but Trump has a different challenge  —  It's that time of the year again — Republicans are declaring with certainty that they will win the election while Democrats anxiously wait for the sky to crash down on their heads.",
    "url": "https://www.messageboxnews.com/p/how-trumps-cockiness-could-cost-him"
  },
  {
    "text": "Leaked documents show US intelligence on Israel's plans to attack Iran, sources say  —  The US is investigating a leak of highly classified US intelligence about Israel's plans for retaliation against Iran, according to three people familiar with the matter.  One of the people familiar confirmed the documents' authenticity.",
    "url": "https://www.cnn.com/2024/10/19/politics/us-israel-iran-intelligence-documents/"
  },
  {
    "text": "Pro-Iranian account leaks alleged U.S. intel on Israel's attack plans … - The leak could be an attempt to disrupt the Israeli operation.  — The Pentagon and the Office of the Director of National Intelligence declined to comment on the leaked documents, but did not dispute their authenticity.",
    "url": "https://www.axios.com/2024/10/19/israel-iran-attack-telegram-leaked-intelligence"
  },
  {
    "text": "Why Election Day has irreversibly changed … - Early voting in person or by mail has exploded over the past 24 years. … - Early in-person voting is underway in nearly two dozen states, per USA Today. … - A majority of voters who have already voted early or are planning to do so support Harris.",
    "url": "https://www.axios.com/2024/10/19/early-voting-2024-trump-harris"
  },
  {
    "text": "At least 7 dead in Georgia dock collapse on US Atlantic coast  —  At least seven people were killed after part of a boat dock collapsed, sending at least 20 into the Atlantic waters off the coast of the U.S. state of Georgia.  —  U.S. Coast Guard ships were searching Saturday night for missing people.",
    "url": "https://www.reuters.com/world/us/least-7-dead-georgia-dock-collapse-us-atlantic-coast-2024-10-20/"
  },
  {
    "text": "The view from London of the 2024 presidential election  —  Aside from rushing to douse the flames of a possible diplomatic incident over Labour staffers campaigning for Kamala Harris, the U.K. government hasn't quite woken up yet to the presidential election.",
    "url": "https://www.politico.com/live-updates/2024/10/19/2024-elections-live-coverage-updates-analysis/the-view-from-london-00184486"
  },
  {
    "text": "Dominion ‘Monitoring’ Misinfo After Musk, MTG Revive Voting Machine Conspiracy Theories  —  The voting machine company reached a record-breaking settlement last year after suing Fox News for falsely claiming its machines were fraudulent.  —  LOADING  —  Dominion Voting Systems released … ",
    "url": "https://www.huffpost.com/entry/dominion-shares-statement-after-elon-musk-mtg-revive-election-conspiracy-theories_n_6713fa6ae4b03a110eb4738b"
  },
  {
    "text": "Here's why some Latinos are genuinely embracing the Republican Party  —  With the presidential election less than one month away, many people are still trying to make sense of why some Latinos support Donald Trump and the Republican Party, who display clear nativist stances.",
    "url": "https://thehill.com/opinion/4941672-latino-trump-support-republican-party/"
  },
  {
    "text": "What Elon Musk Really Wants  —  The Tesla and X mogul has long dreamed of redesigning the world in his own extreme image.  Trump may be his Trojan horse.  —  In Elon Musk's vision of human history, Donald Trump is the singularity.  If Musk can propel Trump back to the White House … ",
    "url": "https://www.theatlantic.com/books/archive/2024/10/donald-trump-is-elon-musks-trojan-horse/680309/"
  },
  {
    "text": "Here's how Trump, Harris and their allies have altered their ad spending strategies in October  —  In the first two weeks of October, Donald Trump and his allies directed about a third of all their spending on broadcast TV advertisements to ads about transgender health care … ",
    "url": "https://www.cnn.com/2024/10/19/politics/campaign-advertising-tv-trump-harris/"
  },
  {
    "text": "Obama: ‘You would be worried if your grandpa was acting’ like Trump  —  Former President Obama took a swipe at former President Trump's competence Friday, mocking the GOP nominee for his recent rhetoric.  —  “He called himself ‘the father IVF,’” Obama said during a rally in battleground Arizona.",
    "url": "https://thehill.com/homenews/campaign/4942571-barack-obama-donald-trump-competence-arizona/"
  }
]