[
  {
    "text": "Kremlin Says Trump Sent Putin Covid Tests While President  — Kremlin denies phone calls took place after Trump left office  — Trump campaign pushed back on claims in Bob Woodward's book  —  The Kremlin confirmed that former US President Donald Trump while in office sent Russian … ",
    "url": "https://www.bloomberg.com/news/articles/2024-10-09/kremlin-confirms-trump-sent-putin-covid-tests-while-president"
  },
  {
    "text": "Susan Rice: Trump's reported calls with Putin appear illegal  —  Former White House adviser and United Nations ambassador Susan Rice called out former President Trump over a report that he has spoken with Russian President Vladimir Putin at least seven times since leaving office, suggesting such calls would violate the Logan Act.",
    "url": "https://thehill.com/policy/international/4924145-susan-rice-trump-putin-logan-act/"
  },
  {
    "text": "Kremlin refutes Trump denial on sending Putin COVID tests … - Woodward also reported that Trump and Putin have had “as many as seven” personal conversations since Trump left office in 2021.  — Trump campaign spokesperson Steven Cheung said Tuesday that the allegations were “made up stories” … ",
    "url": "https://www.axios.com/2024/10/09/trump-putin-covid-testing-equipment-kremlin"
  },
  {
    "text": "Fox is totally ignoring Woodward's report that Trump is in contact with Putin  —  Fox News is completely ignoring a new report that former President Donald Trump has regularly communicated with Russian President Vladimir Putin since leaving office — the type of behavior that some of its star … ",
    "url": "https://www.mediamatters.org/trumprussia/fox-totally-ignoring-woodwards-report-trump-contact-putin"
  },
  {
    "text": "EXCLUSIVE: Poll Finds Large Chunk of Haley Voters Ready to Ditch Trump  —  A SIGNIFICANT CHUNK OF SELF-IDENTIFIED Nikki Haley voters say they will support Kamala Harris for president, according to a new survey shared exclusively with The Bulwark.  —  If the election were held today … ",
    "url": "https://www.thebulwark.com/p/exclusive-poll-finds-large-chunk"
  },
  {
    "text": "Exclusive: Harris widens lead over Trump to 47%-40%, Reuters/Ipsos poll finds  —  Democratic Vice President Kamala Harris leads Republican Donald Trump 47% to 40% in the race to win the Nov. 5 U.S. presidential election, as she appeared to blunt Trump's edge on the economy and jobs, a Reuters/Ipsos poll published on Tuesday found.",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/10/09/harris-trump-lead-reuters-poll/75584172007/"
  },
  {
    "text": "“The righteous hate what is false”: Mike Johnson betrays his faith by lying about immigrants voting  —  House Speaker Mike Johnson admits he has no data to support his claim that “illegals” vote by the “thousands”  —  House Speaker Mike Johnson is a man of faith — a “Bible-believing Christian … ",
    "url": "https://www.salon.com/2024/10/09/the-righteous-hate-what-is-false-mike-johnson-betrays-his-faith-by-lying-about-voting/"
  },
  {
    "text": "Trump has long blasted China's trade practices.  His ‘God Bless the USA’ Bibles were printed there  —  Thousands of copies of Donald Trump's “God Bless the USA” Bible were printed in a country that the former president has repeatedly accused of stealing American jobs and engaging in unfair trade practices — China.",
    "url": "https://apnews.com/article/trump-god-bless-usa-bible-china-32a80611605d4052d8238064bbcace4c"
  },
  {
    "text": "Florida Rep. says MTG needs her ‘head examined’ after weather posts  —  “Humans cannot create or control hurricanes,” Republican Rep. Carlos Gimenez wrote on social media.  —  Florida Rep. Carlos Gimenez said Wednesday that GOP Rep. Marjorie Taylor Greene and others who think like her that humans … ",
    "url": "https://www.politico.com/news/2024/10/09/florida-mtg-weather-posts-00183016"
  },
  {
    "text": "The fight for the House and Senate: Where things stand  —  Will both chambers flip?  Congress may once again have to work under the strain of divided government.  —  Congress may be headed for an Election Day double flip.  —  With less than four weeks to go, Republicans appear poised to win the Senate … ",
    "url": "https://www.washingtonpost.com/politics/2024/10/09/senate-house-race-who-wins/"
  },
  {
    "text": "Walz: ‘The Electoral College needs to go’  —  Minnesota Gov. Tim Walz, the Democratic Party's vice presidential nominee, suggested Tuesday night that the Electoral College should be abolished during two West Coast campaign stops.  —  Walz mentioned the concept during fundraisers in Seattle … ",
    "url": "https://thehill.com/homenews/campaign/4923526-minnesota-gov-walz-electoral-college/"
  },
  {
    "text": "The State Election Board is pushing election skeptics to monitor Fulton County's elections  —  Georgia's largest county says the Republican-led panel doesn't have the legal authority to appoint its monitors  —  The fight between the Georgia Election Board and Fulton County took dramatic twists Tuesday … ",
    "url": "https://www.ajc.com/politics/election/fulton-county-is-suing-the-state-election-board-after-it-pushed-election-skeptics-to-monitor-elections/KSEXUPVI5ZAO5ACSNB6ZOGEVRU/"
  },
  {
    "text": "Scoop: Trump allies plan ad blitz around Harris' viral quote on Biden … - “Expect to see this clip every single time you turn on the television between now and Nov. 5,” a top Trump ally told Axios. … - “I've been a part of most of the decisions that have had impact,” Harris said on … ",
    "url": "https://www.axios.com/2024/10/09/trump-ad-harris-biden-quote-the-view"
  },
  {
    "text": "The Moment of Truth … Last november, during a symposium at Mount Vernon on democracy, John Kelly, the retired Marine Corps general who served as Donald Trump's second chief of staff, spoke about George Washington's historic accomplishments—his leadership and victory in the Revolutionary War … ",
    "url": "https://www.theatlantic.com/magazine/archive/2024/11/george-washington-nightmare-donald-trump/679946/?gift=mBLCHcnsd_Gd3EecvWSKTVWmBt18XO-ATC6rbb2Qz0s&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Howard Stern endorses Kamala Harris during interview that touches on therapy, sexism and Trump  —  Stern revealed he is voting for the Democratic nominee halfway through an interview with the vice president  —  Vice President Kamala Harris has Howard Stern's vote, he announced during her appearance on his Sirius XM radio show Tuesday.",
    "url": "https://www.salon.com/2024/10/08/howard-stern-endorses-kamala-harris-during-interview-that-touches-on-therapy-sexism-and/"
  },
  {
    "text": "Economy Most Important Issue to 2024 Presidential Vote  —  WASHINGTON, D.C. — The economy ranks as the most important of 22 issues that U.S. registered voters say will influence their choice for president.  It is the only issue on which a majority of voters, 52%, say the candidates' positions on it are an … ",
    "url": "https://news.gallup.com/poll/651719/economy-important-issue-2024-presidential-vote.aspx"
  },
  {
    "text": "How FEMA tries to combat rumors and conspiracy theories about Milton and Helene  —  With a second massive hurricane set to hit the United States in less than two weeks, the Federal Emergency Management Agency also has to contend with a deluge of rumors and conspiracy theories about its response and policies.",
    "url": "https://www.npr.org/2024/10/09/nx-s1-5146475/milton-helene-fema-rumors-conspiracy-theories"
  },
  {
    "text": "Lawsuit filed against Jack Phillips dismissed by Colorado Supreme Court  —  The Colorado Supreme Court dismissed a lawsuit filed against Jack Phillips after he refused to bake a cake celebrating a gender transition.  —  In a 6-3 opinion, the court threw out the lawsuit on procedural grounds … ",
    "url": "https://www.washingtonexaminer.com/news/supreme-court/3182475/lawsuit-filed-against-jack-phillips-dismissed-colorado-supreme-court/"
  },
  {
    "text": "DOJ's radical and sweeping proposals risk hurting consumers, businesses, and developers  —  The U.S. Department of Justice (DOJ) today shared a broad outline of radical changes it may demand as part of its lawsuit over how we distribute Search.  This is the start of a long process … ",
    "url": "https://blog.google/outreach-initiatives/public-policy/doj-search-remedies-framework/"
  },
  {
    "text": "The Supreme Court's Dark Money Crisis: Wyden's Revolutionary Fix  —  The song that was inspired by this article is here.  —  My reading this article as an audio podcast is here.  —  My new book, The Hidden History of the American Dream, is now available here.  —  Share",
    "url": "https://hartmannreport.com/p/the-supreme-courts-dark-money-crisis-bbf"
  },
  {
    "text": "Florida threatens TV executive with jail time for airing ad in support of abortion rights  —  This November, Florida residents will decide whether to amend their state constitution to protect reproductive rights, overturning the state's near-total abortion ban after six weeks of pregnancy.",
    "url": "https://popular.info/p/florida-threatens-tv-executive-with"
  },
  {
    "text": "Kamala Harris Has Raised $1 Billion Since Entering 2024 Presidential Race  —  No presidential candidate is believed to have ever raised so much money so fast after entering a race.  The campaign has stopped trumpeting its fund-raising totals to keep Democrats from becoming complacent.",
    "url": "https://www.nytimes.com/2024/10/09/us/politics/harris-billion-dollar-fundraising.html"
  },
  {
    "text": "The Most Dramatic Shift in U.S. Public Opinion  —  America's immigration debate has taken a restrictionist turn.  Eight years ago, Donald Trump declared that “when Mexico sends its people, they're not sending their best,” and promised to build a “big, beautiful wall” on the southern border.",
    "url": "https://www.theatlantic.com/politics/archive/2024/10/immigration-public-opinion-reversal/680196/"
  }
]