[
  {
    "text": "Senate GOP leaders succeed in protecting Trump tariffs  —  The Senate on Wednesday killed a resolution that would have effectively reversed President Trump's 10% tariffs on all imported goods, with just three Republicans joining with Democrats in support of the measure.",
    "url": "https://www.axios.com/2025/04/30/senate-tariff-vote-gop"
  },
  {
    "text": "A bipartisan measure to undo Trump's global tariffs fails in the Senate  —  The resolution to rein in Trump's tariff authority stalled on a 49-49 tie, with two senators missing the vote.  —  WASHINGTON — A bipartisan measure that sought to undo the sweeping tariffs President Donald Trump imposed … ",
    "url": "https://www.nbcnews.com/politics/congress/senate-vote-measure-undo-trumps-global-tariffs-rcna203668"
  },
  {
    "text": "Trump says he ‘could’ bring Abrego Garcia back from El Salvador, but won't  —  President Donald Trump on Tuesday acknowledged that he could secure the return of Kilmar Armando Abrego Garcia, a Maryland man who was wrongly deported to El Salvador last month but refuses to do so.",
    "url": "https://cnn.com/2025/04/30/us/trump-could-bring-abrego-garcia-back-us-hnk/"
  },
  {
    "text": "Majority of public opposes GOP plan for Medicaid cuts: Poll  —  Large majorities of Americans, including Republicans, oppose federal funding cuts to Medicaid, according to a new poll from health policy research group KFF.  —  The results are yet another warning sign for congressional … ",
    "url": "https://thehill.com/policy/healthcare/5275399-gop-medicaid-cut-plan-opposition-kff-survey/"
  },
  {
    "text": "The GOP plan to fund Trump's agenda is running into a major roadblock: Trump  —  House Republicans are relying on deep cuts to the safety-net health program to finance their megabill.  But the president is deeply wary.  —  President Donald Trump is skeptical of congressional Republicans' emerging plans … ",
    "url": "https://www.politico.com/news/2025/04/30/donald-trump-medicaid-cuts-mike-johnson-00320262"
  },
  {
    "text": "Treasury Announces Agreement to Establish United States-Ukraine Reconstruction Investment Fund  —  WASHINGTON — On April 30, the United States and Ukraine signed an agreement to establish the United States-Ukraine Reconstruction Investment Fund.  In recognition of the significant financial … ",
    "url": "https://home.treasury.gov/news/press-releases/sb0126"
  },
  {
    "text": "DOGE Put a College Student in Charge of Using AI to Rewrite Regulations  —  A DOGE operative has been tasked with using AI to propose rewrites to the Department of Housing and Urban Development's regulations—an effort sources are told will roll out across government.",
    "url": "https://www.wired.com/story/doge-college-student-ai-rewrite-regulations-deregulation/"
  },
  {
    "text": "Tesla Board Opened Search for a CEO to Succeed Elon Musk  —  With profits and stock price sinking, board members told Musk he needed to spend more time at company  —  About a month ago, with Tesla's stock sinking and some investors irritated about Elon Musk's White House focus … ",
    "url": "https://www.wsj.com/business/autos/tesla-musk-ceo-search-board-0ce61af9?st=fzBa6i"
  },
  {
    "text": "Chris Krebs kicked off CBP's Global Entry program  —  Chris Krebs', President Donald Trump's former director of the Cybersecurity and Infrastructure Security Agency, membership in Global Entry has been revoked.  Krebs, who has repeatedly attested to the security of the 2020 election … ",
    "url": "https://cnn.com/2025/04/30/politics/chris-krebs-cbp-global-entry-revoked"
  },
  {
    "text": "RFK Jr.'s HHS Orders Lab Studying Deadly Infectious Diseases to Stop Research  —  NIAID's Integrated Research Facility is one of the few federal facilities charged with studying Ebola.  Tuesday afternoon, all of its work was put on indefinite pause by Robert F. Kennedy Jr.'s department.",
    "url": "https://www.wired.com/story/hhs-niaid-irf-ebola-disease-research-stop/"
  },
  {
    "text": "DOGE hits Trump country  —  Red states have borne the brunt of DOGE's targeting of AmeriCorps  —  Three months in, it's become abundantly clear that it's not just federal Washington-based programs and overseas aid that are feeling the wrath of Elon Musk and DOGE.",
    "url": "https://www.politico.com/news/2025/04/30/doge-hits-trump-country-00319654"
  },
  {
    "text": "Trump on possible toy shortage: “Maybe the children will have two dolls instead of 30”  —  President Trump appeared to acknowledge Wednesday that toy shortages are possible as his tariff hikes ripple through the economy.  —  Why it matters: American retailers are growing worried … ",
    "url": "https://www.axios.com/2025/04/30/trump-china-tariffs-toy-shortage-christmas-2025"
  },
  {
    "text": "Johnson fails to solve SALT problem after key meeting  —  House Republicans came away empty-handed Wednesday afternoon from a high-stakes meeting aimed at ending a yearslong standoff within their caucus over a $10,000 cap on state and local tax deductions.  The meeting between Speaker Mike Johnson … ",
    "url": "https://www.politico.com/live-updates/2025/04/30/congress/republicans-come-away-empty-handed-from-salt-summit-00319994"
  },
  {
    "text": "RFK Jr. will require shift in how new vaccines are tested, HHS says  —  The potential change outlined in a statement would require all new vaccines to undergo placebo testing, sparking concerns among medical experts.  —  Health and Human Services Secretary Robert F. Kennedy Jr. intends … ",
    "url": "https://www.washingtonpost.com/health/2025/04/30/rfk-jr-vaccine-testing/"
  },
  {
    "text": "NIH cancels participation in Safe to Sleep campaign that decreased infant deaths  —  Non-profits scramble to continue program despite ‘devastating’ loss of federal support  —  WASHINGTON — The Trump administration has cancelled federal participation in Safe to Sleep, a 30-year campaign … ",
    "url": "https://www.statnews.com/2025/04/30/nih-ends-participation-in-safe-to-sleep-campaign-to-prevent-infant-deaths/"
  },
  {
    "text": "Rwanda responds warmly to Trump request to take noncitizen deportees  —  The talks coincide with a U.S.-led effort to broker a peace agreement between Rwanda and the Democratic Republic of Congo.  —  The Trump administration's efforts to significantly broaden the number of countries willing … ",
    "url": "https://www.washingtonpost.com/national-security/2025/04/30/trump-rwanda-deportations/"
  },
  {
    "text": "House Republicans advance plan to cut federal worker benefits and undermine civil service protections  —  Republicans on the House Oversight and Government Reform Committee voted Wednesday mostly along party lines to advance a series of proposals that would require federal workers to pay … ",
    "url": "https://www.govexec.com/pay-benefits/2025/04/house-republicans-advance-plan-cut-federal-worker-benefits-and-undermine-civil-service-protections/404969/"
  },
  {
    "text": "‘Bumbling f-king idiot’ Steve Witkoff shouldn't be leading Iran, Russia negotiations, allies and insiders say  —  WASHINGTON — President Trump's special envoy to the Middle East, former real estate attorney and investor Steve Witkoff, has left administration insiders distressed by his approach … ",
    "url": "https://nypost.com/2025/04/30/us-news/bumbling-f-king-idiot-steve-witkoff-shouldnt-be-leading-iran-russia-negotiations-allies-and-insiders-say/"
  },
  {
    "text": "RFK Jr. rejects cornerstone of health science: Germ theory … With the rise of Robert F. Kennedy Jr., brain worms have gotten a bad rap.  —  A year ago, the long-time anti-vaccine advocate and current US health secretary famously told The New York Times that a parasitic worm “got into my brain and ate a portion of it and then died.”",
    "url": "https://arstechnica.com/health/2025/04/rfk-jr-s-anti-vaccine-stance-is-rooted-in-a-disbelief-in-germ-theory/"
  },
  {
    "text": "Trump ran on boosting prosperity.  Now an economic bust looms.  —  The messaging strategy does not appear to be working for a president whom voters returned to the White House largely to address economic concerns.  —  At a Tuesday night rally in Michigan, President Donald Trump … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/01/trump-economy-recession-tariffs/"
  },
  {
    "text": "Häagen-Dazs and Buddha: Elon Musk waxes philosophical on his time with Trump  —  Musk reflected on what it has been like at the center of the U.S. Doge Service.  At times, the man running the show wondered aloud how the show even started.  —  Elon Musk sat down in the Roosevelt Room … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/01/hagen-dazsand-buddha-elon-musk-waxes-philosophical-his-time-with-trump/"
  },
  {
    "text": "As Musk steps back, DOGE looks to Congress to finish what it started  —  The effort faces an uncertain future in a largely frozen Congress that has passed few bills since President Donald Trump took office in January.  —  Elon Musk arrived at the White House prepared to take a chainsaw … ",
    "url": "https://www.washingtonpost.com/politics/2025/05/01/musk-steps-back-doge-looks-congress-finish-what-it-started/"
  },
  {
    "text": "New Mideast Project Is Latest Trump Company Deal Tied to a Foreign Government  —  The Trump Organization agreed to partner on a real estate project in Qatar in the latest of a series of projects tied to foreign governments.  —  The Trump Organization has agreed to a new Middle East golf course … ",
    "url": "https://www.nytimes.com/2025/04/30/world/middleeast/trump-family-qatar-dubai.html?unlocked_article_code=1.Dk8.lMSj.0rYxsXDCJlg7&smid=url-share"
  }
]