[
  {
    "text": "Trump's New York Fraud Trial in Limbo After His Legal Gambit Works  —  Trump's lawyers are going after Judge Arthur F. Engoron, saying he's overstepped his bounds. … An appellate judge has taken the remarkable step of hitting pause on the New York Attorney General's upcoming bank fraud trial … ",
    "url": "https://www.thedailybeast.com/trump-turns-new-york-ag-case-against-judge-arthur-f-engoron"
  },
  {
    "text": "Judge temporarily halts NY fraud trial against Trump, pending appeal  —  A New York state appeals court judge on Thursday temporarily halted the scheduled Oct. 2 trial in New York Attorney General Letitia James' fraud lawsuit against Donald Trump and his family business, a spokesman for the court said.",
    "url": "https://www.reuters.com/world/us/judge-temporarily-halts-ny-fraud-trial-against-trump-pending-appeal-2023-09-14/"
  },
  {
    "text": "Trump says it's ‘very unlikely’ he'd pardon himself if elected  —  In an interview with NBC's “Meet the Press,” former President Donald Trump said that in his final days in office, he told people, “The last thing I'd ever do is give myself a pardon.”  —  Trump: ‘I could have had a pardon’ before leaving office",
    "url": "https://www.nbcnews.com/politics/donald-trump/trump-unlikely-pardon-convicted-presidency-meet-the-press-rcna104779"
  },
  {
    "text": "“Meet the Press” booking Trump for first show with new host is how FASCISM is normalized  —  Please call NBC to tell them this is wrong!  —  NBC's “Meet the Press” could've booked any political person for the debut this Sunday of the show's new moderator, Kristen Welker.",
    "url": "https://deanobeidallah.substack.com/p/meet-the-press-booking-trump-for"
  },
  {
    "text": "‘They did it to me’: Trump says Biden impeachment inquiry might be motivated by revenge  —  Trump told former Fox and NBC host Megyn Kelly that GOP attempts to indict Joe Biden could be next.  —  Former President Donald Trump has “no idea” whether Republicans will vote to impeach President Joe Biden.",
    "url": "https://www.politico.com/news/2023/09/14/trump-biden-impeachment-revenge-00116027"
  },
  {
    "text": "Double blow of inquiry and son's indictment create tough stretch for Biden  —  Hunter Biden was charged two days after launch of impeachment process, creating political and personal challenges for the president  —  In just over 48 hours this week, President Biden faced a double-barreled onslaught … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/biden-indictment-impeachment-double-blows/"
  },
  {
    "text": "Behind the scenes, Ron DeSantis is making things worse for Kevin McCarthy  —  The Florida governor strategized Wednesday with leaders of the House cadre pushing Speaker Kevin McCarthy to the brink.  —  In the high-stakes fight that is threatening to shut down the federal government next month … ",
    "url": "https://www.politico.com/news/2023/09/14/desantis-leans-into-shutdown-fight-00115892"
  },
  {
    "text": "McCarthy Pulls Back Pentagon Spending Bill, Inching Closer to a Shutdown  —  The House speaker abandoned efforts to move forward on a normally bipartisan military spending bill as far-right Republicans balked at the funding level, after pleading with his party to avert a shutdown.",
    "url": "https://www.nytimes.com/2023/09/14/us/politics/mccarthy-spending-bill-pentagon.html"
  },
  {
    "text": "Ukrainian President Volodymyr Zelensky to visit Washington next week  —  Zelensky's visit was coordinated with the Biden administration in a joint push to Congress to provide $24 billion in aid  —  Ukrainian President Volodymyr Zelensky is set to travel to Washington next week after a gathering … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/zelensky-washington-visit-ukraine-aid/"
  },
  {
    "text": "‘It will take years to recover’ from Tuberville blockade, top Navy nominee says  —  Adm. Lisa Franchetti, the Navy's No. 2 officer, has been leading the service on an acting basis because of the impasse.  —  President Joe Biden's nominee to be the Navy's top officer, Adm. Lisa Franchetti … ",
    "url": "https://www.politico.com/news/2023/09/14/tuberville-blockade-franchetti-00115936"
  },
  {
    "text": "UAW to target strikes at Ford, GM and Stellantis at midnight if no deal reached  —  United Auto Workers President Shawn Fain on Thursday night said the union will strike all the Big Three automakers - GM, Ford and Stellantis - at the same time as of midnight if the companies do not reach tentative labor deals with the auto workers.",
    "url": "https://www.cnn.com/2023/09/14/business/auto-workers-strike-deadline/"
  },
  {
    "text": "Judge severs Trump's Georgia election interference case, and 16 others, from trial starting in October  —  Kenneth Chesebro and Sidney Powell will be tried starting Oct. 23.  —  The judge overseeing the Georgia election interference case has severed the case, ordering that 17 defendants … ",
    "url": "https://abcnews.go.com/US/judge-severs-17-defendants-including-trump-oct-23/story?id=103185589"
  },
  {
    "text": "Wisconsin Republicans vote to fire elections director, who may not leave the job  —  The vote creates a dispute over who is in charge of overseeing elections in a state that is expected to play a critical role in next year's presidential campaign  —  MADISON, Wis. — Republicans … ",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/wisconsin-republicans-fire-election-director/"
  },
  {
    "text": "‘You sell yourself so cheap?’  Romney's stark indictment of GOP cowardice.  —  The headline Wednesday was that Sen. Mitt Romney of Utah is retiring — another Trump-critical GOP lawmaker heading for the exits in a party that is, relatedly, still dominated by Donald Trump.",
    "url": "https://www.washingtonpost.com/politics/2023/09/14/you-sell-yourself-so-cheap-romneys-stark-indictment-gop-cowardice/"
  },
  {
    "text": "Trump Pushing RNC to Change Third GOP Debate Venue (Exclusive)  —  The former president did not attend the first debate last month and has said he will skip the second debate, set for Sept. 27  —  A Facebook icon representing an external link to share the article on Facebook.A Twitter icon representing … ",
    "url": "https://themessenger.com/politics/trump-pushing-rnc-to-change-third-gop-debate-venue-exclusive"
  },
  {
    "text": "Gen Z Voices Lackluster Trust in Major U.S. Institutions  —  Members of Generation Z in the U.S. — those between the ages of 12 and 26 — generally lack trust in political and societal institutions, according to a new study from Gallup and Walton Family Foundation.",
    "url": "https://news.gallup.com/opinion/gallup/510395/gen-voices-lackluster-trust-major-institutions.aspx"
  },
  {
    "text": "Republican David McCormick plans to run for US Senate again in Pennsylvania, sources tell AP  —  Republican David McCormick is expected to announce his second bid for U.S. Senate in Pennsylvania, according to people familiar with his plans, taking on Democratic Sen. Bob Casey after narrowly losing … ",
    "url": "https://apnews.com/article/pennsylvania-senate-gop-mccormick-versus-casey-0b8e5e494e429e9e5c4f0a75ff12c5e4"
  },
  {
    "text": "Trump says he discussed pardoning himself but dismissed option  —  Former President Donald Trump said Thursday that he discussed pardoning himself in the final days of his presidency but dismissed the option to do so.  —  “I could've pardoned myself.  Do you know what?  I was given an option to pardon myself.",
    "url": "https://www.cnn.com/2023/09/14/politics/donald-trump-pardon/"
  },
  {
    "text": "New study brings MDMA as treatment for PTSD closer to FDA approval  —  MDMA, commonly referred to as “ecstasy” or “molly,” is on its way to becoming the first psychedelic to receive approval from the Food and Drug Administration (FDA) after a new study conducted by an industry-leading research group found … ",
    "url": "https://thehill.com/policy/healthcare/4205172-new-study-brings-mdma-as-treatment-for-ptsd-closer-to-fda-approval/"
  },
  {
    "text": "The House has rested its case against Ken Paxton after a chaotic day for the prosecution  —  The House prosecutors failed to call a star witness and battled with the defense attorneys over allegations the suspended attorney general had been bribed by Nate Paul.",
    "url": "https://www.texastribune.org/2023/09/13/ken-paxton-impeachment-trial-laura-olson-drew-wicker/"
  }
]