[
  {
    "text": "Jack Smith puts Judge Aileen Cannon on notice  —  Judge Aileen M. Cannon has left many legal experts dumbfounded with her handling of the criminal classified documents case against former president Donald Trump, the man who nominated her to the federal bench.  —  And special counsel Jack Smith appears to be losing patience with her.",
    "url": "https://www.washingtonpost.com/politics/2024/04/03/jack-smith-puts-judge-aileen-cannon-notice/"
  },
  {
    "text": "Why Judge Aileen Cannon is on thin ice in Trump's Mar-a-Lago case  —  Editor's Note: Norman Eisen, who served as counsel to House Democrats in the first Trump impeachment, is a senior fellow at Brookings.  E. Danya Perry, a founding partner of Perry Guha LLP, formerly served as a federal prosecutor … ",
    "url": "https://www.cnn.com/2024/04/03/opinions/aileen-cannon-trump-mar-a-lago-case-eisen-perry-kolb"
  },
  {
    "text": "Chef Jose Andres says Israel targeted his aid workers ‘systematically, car by car’  —  Celebrity chef Jose Andres told Reuters in an emotional interview on Wednesday that an Israeli attack that killed seven of his food aid workers in Gaza had targeted them “systematically, car by car.”",
    "url": "https://www.reuters.com/world/middle-east/chef-jose-andres-says-israel-targeted-his-aid-workers-systematically-car-by-car-2024-04-03/"
  },
  {
    "text": "‘The machine did it coldly’: Israel used AI to identify 37,000 Hamas targets  —  Israeli intelligence sources reveal use of ‘Lavender’ system in Gaza war and claim permission given to kill civilians in pursuit of low-ranking militants  —  The Israeli military's bombing campaign in Gaza used … ",
    "url": "https://www.theguardian.com/world/2024/apr/03/israel-gaza-ai-database-hamas-airstrikes"
  },
  {
    "text": "Judge Won't Delay Trump's Criminal Trial to Wait for Immunity Ruling  —  The former president had asked the judge to push back his Manhattan criminal trial, slated to begin April 15, until after the Supreme Court decides whether he is immune from prosecution.",
    "url": "https://www.nytimes.com/2024/04/03/nyregion/trump-merchan-immunity-ruling.html"
  },
  {
    "text": "Judge rejects Donald Trump's request to delay hush-money trial until Supreme Court rules on immunity  —  NEW YORK — A judge on Wednesday rejected Donald Trump's bid to delay his April 15 hush money criminal trial until the Supreme Court rules on presidential immunity claims he raised in another … ",
    "url": "https://www.washingtonpost.com/politics/2024/04/03/donald-trump-hush-money-criminal-trial-immunity/238332ee-f1fb-11ee-a4c9-88e569a98b58_story.html"
  },
  {
    "text": "Nebraska legislators buck Trump by blocking Electoral College vote change — for now  —  Former President Donald Trump and Republican Gov. Jim Pillen have called on lawmakers to change the state's Electoral College vote allocation to a winner-take-all system.",
    "url": "https://www.nbcnews.com/politics/2024-election/nebraska-legislators-buck-trump-blocking-electoral-college-vote-change-rcna146321"
  },
  {
    "text": "Rejected and ‘returned for correction’: Docs for Trump's $175M bond get bounced  —  A review of the New York County Supreme Court docket on Wednesday shows that paperwork for former President Donald Trump's newly-secured bond of $175 million was temporarily rejected and “returned for correction.”",
    "url": "https://lawandcrime.com/high-profile/rejected-and-returned-for-correction-docs-for-trumps-175m-bond-get-bounced/"
  },
  {
    "text": "Man who used megaphone to lead attack on police during Capitol riot gets more than 7 years in prison  —  A Washington state man who used a megaphone to orchestrate a mob's attack on police officers guarding the U.S. Capitol was sentenced on Wednesday to more than seven years in prison.",
    "url": "https://apnews.com/article/taylor-johnatakis-capitol-riot-sentencing-f97acd68b8860d36b212e408ac80abd4"
  },
  {
    "text": "Trump Spoke Recently With Saudi Leader  —  It is not clear what the former president discussed with Prince Mohammed bin Salman, but news of their call came amid Biden administration negotiations with the Saudis over a Middle East peace plan.  —  Former President Donald J. Trump spoke recently … ",
    "url": "https://www.nytimes.com/2024/04/03/us/politics/trump-spoke-recently-with-saudi-leader.html"
  },
  {
    "text": "Two Individuals Plead Guilty To Participating In Insider Trading Scheme Based On SPAC Merger With Trump Media & Technology Group  —  For Immediate Release  —  U.S. Attorney's Office, Southern District of New York  —  Michael Shvartsman and Gerald Shvartsman Made More Than $22 Million … ",
    "url": "https://www.justice.gov/usao-sdny/pr/two-individuals-plead-guilty-participating-insider-trading-scheme-based-spac-merger"
  },
  {
    "text": "Top Israeli official Ron Dermer began yelling during a meeting with U.S. officials about Gaza, officials say  —  The meeting grew tense after the Americans questioned an Israeli plan to evacuate more than 1 million Palestinian civilians from Rafah and house them in tents.",
    "url": "https://www.nbcnews.com/politics/national-security/top-israeli-official-ron-dermer-yelling-meeting-us-officials-gaza-rcna146293"
  },
  {
    "text": "Democratic tactics against RFK Jr. are rattling his campaign  —  Recent digital and in-person protests have prompted the independent campaign to enact some evasive maneuvers.  —  A billboard truck paid for by the DNC has been circling Robert F. Kennedy Jr.'s campaign events.",
    "url": "https://www.politico.com/news/2024/04/03/rfk-jr-democrats-third-party-00150497"
  },
  {
    "text": "Elon Musk's viral lie about the 2024 election uses bogus data  —  In October 2022, Elon Musk completed his purchase of Twitter.  He then dramatically changed the algorithm to boost his own tweets.  The new algorithm, according to a February 2023 report by Platformer, “artificially boosted Musk's tweets … ",
    "url": "https://popular.info/p/elon-musks-viral-lie-about-the-2024"
  },
  {
    "text": "New Bill Clinton memoir coming after November election … - “I knew as I entered this new chapter of my life that I'd keep score the way I always have,” Clinton says in the announcement.  — “Are people better off when you quit than when you started?",
    "url": "https://www.axios.com/2024/04/04/bill-clinton-book-citizen-november-2024-release"
  },
  {
    "text": "GOP Senate candidates cash out at Mar-a-Lago  —  Republican Senate candidates have flocked to Mar-a-Lago in recent months to raise funds for their campaigns, and the results have been lucrative, Axios has learned. … - Republican Bernie Moreno, who won a contentious GOP Senate primary in Ohio last month … ",
    "url": "https://www.axios.com/2024/04/03/trump-mar-a-lago-fundraising-republicans"
  },
  {
    "text": "‘Angry’ Biden not changing Israel policy after deadly strike on aid workers  —  It's another example of the United States criticizing Israel's conduct of the war against Hamas while remaining reluctant to use leverage to affect course corrections.  —  The Biden administration has no plans … ",
    "url": "https://www.politico.com/news/2024/04/03/biden-israel-strike-aid-workers-gaza-00150356"
  },
  {
    "text": "Greene says Speaker Johnson is a ‘Democrat,’ comparable to Nancy Pelosi  —  Rep. Marjorie Taylor Greene (R-Ga.) on Wednesday likened Speaker Mike Johnson (R-La.) to a Democrat as she doubled down on threats to push forward with an effort to oust him from his post.",
    "url": "https://thehill.com/homenews/4573642-greene-says-speaker-johnson-is-a-democrat-comparable-to-nancy-pelosi/"
  },
  {
    "text": "Youngkin mourns K-9 dog stabbed to death by ‘barbaric’ MS-13 gang members: ‘Will be held accountable’  —  The K-9 dog named Rivan was ‘repeatedly stabbed and kicked by the inmates’  —  FIRST ON FOX: Gov. Glenn Youngkin, R-Va., vows to hold a group of “barbaric” MS-13 members accountable … ",
    "url": "https://www.foxnews.com/politics/youngkin-mourns-dog-stabbed-ms-13-gang-members-held-accountable"
  },
  {
    "text": "NASA tasked with creating a time zone for the moon  —  The White House has asked NASA to create a new time zone for the moon.  —  Arati Prabhakar, the head of the White House Office of Science and Technology Policy (OSTP), said in a letter Tuesday that the office wants NASA to establish … ",
    "url": "https://thehill.com/homenews/4573225-nasa-tasked-creating-time-zone-moon/"
  },
  {
    "text": "Cable lobby vows “years of litigation” to avoid bans on blocking and throttling  —  FCC sets April 25 vote to restore net neutrality rules repealed under Ajit Pai.  —  The Federal Communications Commission has scheduled an April 25 vote to restore net neutrality rules similar … ",
    "url": "https://arstechnica.com/tech-policy/2024/04/fcc-democrats-schedule-net-neutrality-vote-making-cable-lobbyists-sad-again/"
  },
  {
    "text": "Nato plans $100bn ‘Trump-proof’ fund for Ukraine  —  Proposed five-year military aid package would shield Kyiv from ‘winds of political change’  —  Nato is drawing up plans to secure a five-year military aid package of up to $100bn, in an attempt to shield Ukraine from “winds of political change” … ",
    "url": "https://www.ft.com/content/254c3b86-2cb9-4c71-824b-dacacbbc9871"
  }
]