[
  {
    "text": "Gov. Shapiro and Family Evacuated After Arson at Pennsylvania Residence  —  The governor said the State Police banged on the door early on Sunday to wake him and his family after an arsonist set fire to the governor's official residence in Harrisburg.  —  The governor of Pennsylvania … ",
    "url": "https://www.nytimes.com/2025/04/13/us/politics/josh-shapiro-arson-attack-pennsylvania.html"
  },
  {
    "text": "Suspect in custody after overnight fire at Pennsylvania Gov. Josh Shapiro's residence  —  Shapiro said his family was evacuated from the official Harrisburg residence at 2 a.m. and that no one was injured.  —  One person is in custody in relation to the fire set to to Gov. Josh Shapiro's official residence … ",
    "url": "https://www.nbcnews.com/news/us-news/gov-josh-shapiro-residence-arson-investigation-rcna201044"
  },
  {
    "text": "Suspect Held in Pennsylvania Governor's Mansion Arson Attack  —  Pennsylvania police arrested a 38-year-old man who he said broke into the mansion of Governor Josh Shapiro and set it on fire with homemade incendiary devices.  —  Shapiro, who is Jewish, said the suspect's motives weren't known … ",
    "url": "https://www.bloomberg.com/news/articles/2025-04-13/pennsylvania-s-governor-says-arsonist-set-fire-to-his-residence"
  },
  {
    "text": "State Police Investigating Fire at Governor's Residence  —  Harrisburg, PA - On April 13, 2025, at approximately 2:00 a.m., members of the Harrisburg Bureau of Fire responded to the Governor's Residence, located on North Front Street, Harrisburg City, Dauphin County, for the report of a fire.",
    "url": "https://www.pa.gov/agencies/psp/newsroom/state-police-investigating-fire-at-governor-s-residence.html"
  },
  {
    "text": "Police say they are investigating an arson attack at the Pennsylvania governor's residence  —  Police said Sunday that officers evacuated Gov. Josh Shapiro and his family from the official governor's residence after someone set fire to the building.  No one was injured and the fire was extinguished, according to authorities.",
    "url": "https://apnews.com/article/josh-shapiro-arson-police-fire-pennsylvania-governor-2d17ec60c48f7d4d15123dda60c88699"
  },
  {
    "text": "Suspect arrested after fire at Pennsylvania Gov. Josh Shapiro's residence, police say  —  Pennsylvania State Police have detained Cody Balmer, 38 in connection with an early morning fire at the home of Gov. Josh Shapiro.  —  Balmer, who has not yet been charged, allegedly jumped the fence outside … ",
    "url": "https://www.npr.org/2025/04/13/nx-s1-5363707/fire-pennsylvania-governor-josh-shapiro-residence-arson"
  },
  {
    "text": "Trump plans separate levy on exempted electronics amid trade war, Lutnick says  —  U.S. Commerce Secretary Howard Lutnick said on Sunday that smartphones, computers and some other electronics, just exempted from steep tariffs on imports from China, would face separate new duties along with semiconductors within the next two months.",
    "url": "https://www.reuters.com/markets/trump-plans-separate-levy-exempted-electronics-amid-trade-war-lutnick-says-2025-04-13/"
  },
  {
    "text": "Trump Signals New Tariffs on Chips, Calling Exclusions Temporary  —  On Friday, the administration carved out an exception for a variety of electronics from the steep taxes now applied to Chinese imports.  —  President Trump signaled on Sunday that he would pursue new tariffs … ",
    "url": "https://www.nytimes.com/2025/04/13/us/politics/trump-tariffs-china-chips-technology.html"
  },
  {
    "text": "China Halts Critical Exports as Trade War Intensifies  —  Beijing has suspended exports of certain rare earth minerals and magnets that are crucial for the world's car, semiconductor and aerospace industries.  —  China has suspended exports of a wide range of critical minerals and magnets … ",
    "url": "https://www.nytimes.com/2025/04/13/business/china-rare-earths-exports.html?unlocked_article_code=1._U4.7FA3.WsbGOZqzHPWS&smid=bs-share"
  },
  {
    "text": "No evidence linking Tufts student to antisemitism or terrorism, State Dept. office found  —  An internal memo, prepared days before Rumeysa Ozturk was detained by ICE agents, raises doubts about the Trump administration's claims that she supports Hamas.  —  Just now",
    "url": "https://www.washingtonpost.com/national-security/2025/04/13/tufts-student-rumeysa-ozturk-rubio-trump/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzQ0NTE2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzQ1ODk5MTk5LCJpYXQiOjE3NDQ1MTY4MDAsImp0aSI6ImUxOGViZjAxLTdjZWUtNDY2Ni1iMDllLWRiZmE1NmEzMDIzZCIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS9uYXRpb25hbC1zZWN1cml0eS8yMDI1LzA0LzEzL3R1ZnRzLXN0dWRlbnQtcnVtZXlzYS1venR1cmstcnViaW8tdHJ1bXAvIn0.w9ScWurkqrxRu6P10aQmXl6ArBXvUe9CH2oTdp7fFjU&itid=gfta"
  },
  {
    "text": "Nostalgia for manufacturing will make the US poorer  —  Donald Trump's vision to onshore factory jobs reverses decades of progress  —  Welcome back.  Now that Donald Trump has paused his “reciprocal” tariff plans (as predicted in last week's newsletter), this edition will unpick … ",
    "url": "https://www.ft.com/content/845917ed-41a5-449f-946f-70263adbaeb7"
  },
  {
    "text": "Trump administration contends it has no duty to return illegally deported man to US  —  The administration's position suggests officials do not view the Supreme Court's order as compelling them to seek Abrego Garcia's return.  —  The Trump administration insisted Sunday that it has no legal obligation … ",
    "url": "https://www.politico.com/news/2025/04/13/abrego-garcia-el-salvador-trump-administration-00288502"
  },
  {
    "text": "American Rendition: Rümeysa Öztürk's Journey From Ph.D. Scholar to Trump Target Languishing in Louisiana Cell  — Odyssey: Rümeysa Öztürk's arrest and detention reveal what President Donald Trump's deportation campaign looks like on the street level.",
    "url": "https://www.propublica.org/article/rumeysa-ozturk-best-friend-inside-story-tufts-trump-louisiana-ice"
  },
  {
    "text": "Trump Has Added Risk to the Surest Bet in Global Finance … Investors buy U.S. Treasury bonds on the assumption that, come what may, the federal government will endure.Jason Andrew for The New York Times  —  There are not many certainties in the world of money, but this traditionally has been one of them … ",
    "url": "https://www.nytimes.com/2025/04/13/business/trump-risk-us-bonds.html?unlocked_article_code=1._U4.ESlJ.Av0nh-7KcMqJ"
  },
  {
    "text": "DOGE Is Far Short of Its Goal, and Still Overstating Its Progress  —  Elon Musk now says his group will produce only 15 percent of the savings it promised.  But even that estimate is inflated with errors and guesswork.  —  Last week, Elon Musk indicated for the first time that his Department … ",
    "url": "https://www.nytimes.com/2025/04/13/us/politics/doge-contracts-savings.html?unlocked_article_code=1._U4.jxBu.wPOiLoypY3tm"
  },
  {
    "text": "Trump tariff plans bring concern about prices, financial impact, but GOP base sees jobs long-term — CBS News poll  —  Amid a tumultuous week in the markets, the outlook on President Trump's trade and tariff policy hinges not just on what Americans think will happen, but when.",
    "url": "https://www.cbsnews.com/news/poll-trump-tariffs-13-04-2025/"
  },
  {
    "text": "JB Pritzker doubts Republican promises on Medicaid  —  “Medicaid is where most of us think they will go,” he said.  —  Illinois Gov. JB Pritzker on Sunday challenged House Speaker Mike Johnson's vow to protect Medicaid in the GOP's mission to reduce the budget deficit … ",
    "url": "https://www.politico.com/news/2025/04/13/pritzker-republicans-medicaid-promises-00288024"
  },
  {
    "text": "White House releases results from President Trump's physical  —  The White House released the results of President Trump's physical on Sunday, in which the White House physician detailed that the president “remains in excellent health.”  —  “His active lifestyle continues to contribute significantly … ",
    "url": "https://www.cbsnews.com/news/trump-physical-results-white-house-release/"
  },
  {
    "text": "The Attack on International Students  —  Marco Rubio's twitter bio used to boast that he was banned from China.  He won the honor partly for his criticism of how China suppressed pro-democracy advocates in Hong Kong and its dismal human rights record against Uyghur minorities.",
    "url": "https://donmoynihan.substack.com/p/the-attack-on-international-students"
  },
  {
    "text": "Russian Attack on Sumy in Ukraine Kills and Wounds Dozens  —  The midmorning strike hit as Ukrainians were celebrating Palm Sunday, officials said.  It appeared to be the deadliest attack on civilians this year and came as the Trump administration pushes for a cease-fire.",
    "url": "https://www.nytimes.com/2025/04/13/world/europe/sumy-ukraine-russia-strikes.html?unlocked_article_code=1._U4.VfkB.I1pmjfRa_ru_&smid=url-share"
  }
]