[
  {
    "text": "Israel-Gaza Conflict  —  Air-Raid Sirens in Israel Warn of Continued Strikes on Sunday  —  More than 450 people have been killed, according to Israeli and Palestinian officials.  Prime Minister Benjamin Netanyahu vowed to retaliate and turn Hamas strongholds “into rubble.”",
    "url": "https://www.nytimes.com/live/2023/10/07/world/israel-gaza-attack"
  },
  {
    "text": "Terrorist group's attack on Israel is yet another Biden geopolitical failure  —  How many billions of dollars does President Joe Biden want to send to countries that support terrorist groups?  It's an important question that needs answering after Hamas' attack on Israel on Saturday morning.",
    "url": "https://www.washingtonexaminer.com/opinion/terrorist-groups-attack-on-israel-is-yet-another-biden-geopolitical-failure"
  },
  {
    "text": "Israel confirms soldiers and civilians taken hostage by militants  —  Summary  — Dozens of Israelis are believed to have been captured by Palestinian militants in an unprecedented assault into Israeli territory  — “We are at war,” says Israel's PM Benjamin Netanyahu",
    "url": "https://www.bbc.com/news/live/world-middle-east-67037895"
  },
  {
    "text": "'There's Going to Be a Lot of Soul-Searching in Israel When This Is Over'  —  Former U.S. peace negotiator Dennis Ross weighs in on Hamas' attack on Israel and the “missed opportunities” that led to the war.  —  No American diplomat is more familiar with the long history of enmity between Israelis … ",
    "url": "https://www.politico.com/news/magazine/2023/10/07/israel-hamas-attack-00120498"
  },
  {
    "text": "The significance of why Hamas chose to attack Israel now  —  Former U.S. officials say the group and its Iranian backers tried to exploit Israeli political divisions and to derail historic negotiations between Saudi Arabia, Israel and the U.S.  —  Hamas's unprecedented attack on Israel comes … ",
    "url": "https://www.nbcnews.com/news/significance-hamas-chose-attack-israel-now-rcna119351"
  },
  {
    "text": "Blinken says US working to verify reports of several Americans dead in Israel  —  Secretary of State Antony Blinken said Sunday the US is “working overtime” to verify reports of missing and dead Americans overseas after Hamas launched an unprecedented attack against Israel.",
    "url": "https://www.cnn.com/2023/10/08/politics/blinken-israel-war-cnntv/"
  },
  {
    "text": "UK's Starmer Says He's ‘Bang on Schedule’ to Win Power  — Labour leader says party on track to return to government  — But polls indicate voters still unsure of Labour direction … UK Labour leader Keir Starmer said his party is on track to return to power at the next election … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-08/uk-s-starmer-says-he-s-bang-on-schedule-to-win-power"
  },
  {
    "text": "IDF troops battle gunmen in Kfar Aza, Magen; 2 Israeli tourists killed in Egypt  —  IDF hits Hamas targets, says more than 400 terrorists killed; rocket hits Ashkelon hospital; more than 500 Israelis dead, 2,048 wounded, dozens taken hostage in Gaza  —  Security cabinet confirms Israel at war … ",
    "url": "https://www.timesofisrael.com/liveblog-october-8-2023/"
  },
  {
    "text": "Factbox: Deadly Afghanistan earthquakes over the years  —  Powerful earthquakes in Afghanistan have killed more than 2,000 people and injured more than 9,000, the Taliban administration said on Sunday, in the deadliest tremors in years in the quake-prone country.",
    "url": "https://www.reuters.com/world/asia-pacific/deadly-afghanistan-earthquakes-over-years-2023-10-08/"
  },
  {
    "text": "Kenya's Ruto, AfDB's Adesina Say Tackling Climate Depends on Africa Debt Fix  — Kenya's President, AfDB call for pause in interest payments  — Africa is bearing the brunt of climate change, they say  —  Kenyan President William Ruto and the heads of two major finance and climate institutions … ",
    "url": "https://www.bloomberg.com/news/articles/2023-10-08/ruto-adesina-say-tackling-climate-depends-on-africa-debt-fix"
  },
  {
    "text": "Two Families Got Fed Up With Their States' Politics.  So They Moved Out.  —  The Nobles of Iowa moved to blue Minnesota.  The Huckinses of Oregon moved to red Missouri.  Their separate journeys, five weeks apart, illustrate the fracturing of America.  —  By Trip GabrielPhotographs by Hilary Swift",
    "url": "https://www.nytimes.com/2023/10/07/us/politics/politics-states-moving.html"
  },
  {
    "text": "So Much For “Peace”  —  The Palestinians who invaded Israel have focused on kidnapping civilians, mostly young women.  This was facilitated by the fact that there was a “rave for peace” going on near Gaza that many young people attended.  The Palestinians no doubt knew this, and planned to attack the event.",
    "url": "https://www.powerlineblog.com/archives/2023/10/so-much-for-peace.php"
  },
  {
    "text": "Pence slams Trump, GOP ‘voices of appeasement’ as Israel comes under attack  —  The former vice president called out Donald Trump, Ron DeSantis and Vivek Ramaswamy by name.  —  GLENWOOD, I.A. — Former Vice President Mike Pence tore into Donald Trump and pointed to isolationism … ",
    "url": "https://www.politico.com/news/2023/10/07/gop-presidential-hopefuls-reaffirm-support-for-israel-following-hamas-attack-00120481"
  },
  {
    "text": "Amazon's Alexa has been claiming the 2020 election was stolen  —  The popular voice assistant says the 2020 race was stolen, even as parent company Amazon promotes the tool as a reliable election news source — foreshadowing a new information battleground  —  Amid concerns the rise … ",
    "url": "https://www.washingtonpost.com/technology/2023/10/07/amazon-alexa-news-2020-election-misinformation/"
  },
  {
    "text": "How not to cover Donald Trump's bizarre 2024 campaign for president  —  The press should borrow a lyric from “The Sound of Music” and ask itself: “How do you solve a problem like Donald?”  Or, put another way, how should journalists cover Trump's unprecedented campaign for president … ",
    "url": "https://www.latimes.com/opinion/story/2023-10-07/donald-trump-2024-campaign-president-media-press-ron-desantis-primary-election"
  },
  {
    "text": "Family, community, and the rural social mobility advantage  —  https://doi.org/10.1016/j.rssm.2023.100 844 Get rights and content  —  Abstract  —  Children born into poverty in rural America achieve higher average income levels as adults than their urban peers.",
    "url": "https://www.sciencedirect.com/science/article/abs/pii/S0276562423000884"
  }
]