[
  {
    "text": "House passes stopgap bill to avert government shutdown  —  The House on Wednesday approved a three-month government funding bill to avoid an end-of-the-month shutdown, sending the package to the Senate for consideration.  —  The chamber cleared the legislation — which would fund the government … ",
    "url": "https://thehill.com/homenews/house/4899423-house-stopgap-bill-government-shutdown/"
  },
  {
    "text": "Trump makes last-minute push for alternative stopgap with voting provisions  —  Former President Trump is making a last-minute push for House Republicans to adopt a short-term government funding package that includes language pertaining to voting, multiple sources told The Hill.",
    "url": "https://thehill.com/homenews/house/4898953-trump-stopgap-funding-voting/"
  },
  {
    "text": "Yet Another Mark Robinson Eye-Popper  —  Donald Trump's legal troubles have been out of the news lately, but they may be coming back in a major way.  Per CNN: … Remember back when it was going to be a tentpole of this race that Donald Trump is a felon?  Hey, you never know.  Happy Wednesday.",
    "url": "https://www.thebulwark.com/p/yet-another-mark-robinson-eye-popper"
  },
  {
    "text": "Donald Trump's Sexual Assault Accusers Tell Their Stories in Chilling New Ads (Exclusive)  —  Ads launching on Wednesday, Sept. 25, feature two of the presidential nominee's accusers, including former PEOPLE reporter Natasha Stoynoff  —  George Conway, the ex-husband of former Donald Trump … ",
    "url": "https://people.com/donald-trump-sexual-assault-accuser-ads-8717764"
  },
  {
    "text": "‘I Tried to Push Him, He Kept Coming Back At Me’: Trump's Sexual Assault Accusers Speak Out in Chilling 2024 Election Ad  —  Former President Donald Trump declared this week that he would be a “protector” of women.  In a pair of campaign ads, two women described how the ex-president sexually assaulted them.",
    "url": "https://www.mediaite.com/trump/i-tried-to-push-him-he-kept-coming-back-at-me-trumps-sexual-assault-accusers-speak-out-in-chilling-2024-election-ad/"
  },
  {
    "text": "A Wisconsin Mayor Took Issue With a Ballot Drop Box Decision, So He Took the Drop Box  —  Mayor Doug Diny of Wausau, Wis., said the City Council should have been consulted before the installation.  The Wisconsin Supreme Court had said authority rested with the city clerk.",
    "url": "https://www.nytimes.com/2024/09/25/us/politics/wisconsin-mayor-ballot-box.html"
  },
  {
    "text": "Wausau mayor moves ballot box in controversial act  —  Wausau Mayor Doug Diny is facing scrutiny after video surveillance footage showed him carting the city's outdoor ballot drop box inside on Sunday while sporting a Department of Public Works jacket and hard hat.",
    "url": "https://wausaupilotandreview.com/2024/09/24/wausau-mayor-moves-ballot-box-in-controversial-act-public-outcry-and-potential-legal-consequences-loom/"
  },
  {
    "text": "Nice Little Jewish Community You Have Here  —  Donald Trump's former longtime adviser Michael Cohen has said of the ex-president, whom he has likened to a Mob boss: “He speaks in code.”  Trump used the code last week to send a warning to American Jews.  “If I don't win this election,” … ",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/trump-threat-to-american-jews-election/680023/?gift=Ut5zkH9vG00uzi0vmoT5fzD7bU8UVneQ1g_2ZcxCb1U&utm_source=copy-link&utm_medium=social&utm_campaign=share"
  },
  {
    "text": "Harris Casts Herself as a Pro-Business Pragmatist in a Broad Economic Pitch  —  Declaring “I am a capitalist” in a speech in Pittsburgh, Kamala Harris promised not to be “constrained by ideology” even as she said she would fiercely defend unions and the middle class.",
    "url": "https://www.nytimes.com/2024/09/25/us/politics/harris-economic-speech-pro-business.html"
  },
  {
    "text": "Secret Service agent under investigation for alleged sex assault on Harris aide … The U.S. Secret Service is investigating allegations that one of its agents sexually assaulted a female staff member of the office of Vice President Kamala Harris, the agency confirmed Wednesday.",
    "url": "https://www.cnbc.com/2024/09/25/secret-service-agent-investigated-for-sex-assault-harris-campaign-aide.html"
  },
  {
    "text": "Ocasio-Cortez Says Adams Should Resign ‘for the Good of the City’  —  Representative Alexandria Ocasio-Cortez became the most prominent elected official to call for Mayor Eric Adams to no longer lead New York City.  —  Representative Alexandria Ocasio-Cortez of New York on Wednesday … ",
    "url": "https://www.nytimes.com/2024/09/25/nyregion/aoc-eric-adams-resign.html"
  },
  {
    "text": "Biden insists he would have beaten “loser” Trump … - Polling after Biden's shaky June debate performance — before he suspended his campaign — also showed that the majority of voters believed that the Democratic Party would perform better with a different candidate atop the ticket.",
    "url": "https://www.axios.com/2024/09/25/biden-trump-view-2024-democrats-republicans"
  },
  {
    "text": "Neo-Nazi Telegram Users Panic Amid Crackdown and Arrest of Alleged Leaders of Online Extremist Group  —  ProPublica is a nonprofit newsroom that investigates abuses of power.  Sign up to receive our biggest stories as soon as they're published.  —  This story is part of a collaboration between FRONTLINE … ",
    "url": "https://www.propublica.org/article/telegram-terrorgram-collective-extremism-accelerationists-dallas-humber-matthew-allison"
  },
  {
    "text": "Trump's Hateful New Rants at Rally Are Harshly Debunked by Town Leader  —  They are taking from us.  At bottom, that's a key message that Donald Trump and his partner in slime, J.D. Vance, are running on when they falsely attack immigrants for eating pets, spreading diseases … ",
    "url": "https://newrepublic.com/article/186331/trump-hateful-rally-pennsylvania-debunked-town-leader"
  },
  {
    "text": "Independent Challenger Overtakes Nebraska's Republican Senator in New Poll, Drops Scathing New Ad  —  Independent candidate Dan Osborn's run to oust Nebraska Sen. Deb Fischer (R-NE) this November has grabbed national attention as polls have shown a surprisingly close race … ",
    "url": "https://www.mediaite.com/politics/independent-challenger-overtakes-nebraskas-republican-senator-in-new-poll-drops-scathing-new-ad/"
  },
  {
    "text": "Poll: Project 2025 is broadly known and severely unpopular with voters  —  Democrats have sought to tie Trump to the conservative policy roadmap linked to some of his top supporters, even as the Republican distances himself.  —  Nearly all voters who are familiar with Project 2025 … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-project-2025-broadly-known-severely-unpopular-voters-rcna172660"
  },
  {
    "text": "“The evidence will be powerful”: Legal experts say Jack Smith about to drop a bomb in Trump case  —  Legal scholars expect a bitter fight over what evidence may be redacted from the public  —  Special counsel Jack Smith is expected to submit an “oversized” brief in former President Donald … ",
    "url": "https://www.salon.com/2024/09/25/the-evidence-will-be-powerful-legal-experts-say-jack-smith-about-to-drop-a-bomb-in-case/"
  },
  {
    "text": "Trump's Most Misunderstood Policy Proposal  —  Donald Trump's proposal to impose tariffs as high as 60 percent on imports from China, and a global tariff of 10 to 20 percent, takes the right approach to addressing globalization's failures—but it has drawn resounding mockery from economists, and, in turn, from the mainstream media.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/economic-arguments-tariffs-trump/680015/"
  },
  {
    "text": "Alex Jones' Infowars Will Be Sold for Parts at Auction to Pay Sandy Hook Families  —  UNDER THE HAMMER  —  The sale is still only expected to raise a fraction of what he owes.  —  Conspiracy theorist Alex Jones' Infowars will be sold for parts to pay towards the more than $1 billion he owes … ",
    "url": "https://www.thedailybeast.com/alex-jones-infowars-will-be-sold-for-parts-at-auction-to-pay-sandy-hook-families"
  },
  {
    "text": "Russia's nuclear doctrine to include attacks on nonnuclear states  —  Russian President Vladimir Putin said non-nuclear states supported by nuclear ones could face Russia's nuclear deterrent in an expansion of its policy.  —  Russian President Vladimir Putin made a fresh nuclear threat … ",
    "url": "https://www.washingtonpost.com/world/2024/09/25/putin-nuclear-deterrent-ukraine-threat/?pwapi_token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJyZWFzb24iOiJnaWZ0IiwibmJmIjoxNzI3MjM2ODAwLCJpc3MiOiJzdWJzY3JpcHRpb25zIiwiZXhwIjoxNzI4NjE5MTk5LCJpYXQiOjE3MjcyMzY4MDAsImp0aSI6Ijc5YmU3ZTZiLTVmMDMtNDU5MC05MWUxLWY4Y2E5Njc0MTQzNyIsInVybCI6Imh0dHBzOi8vd3d3Lndhc2hpbmd0b25wb3N0LmNvbS93b3JsZC8yMDI0LzA5LzI1L3B1dGluLW51Y2xlYXItZGV0ZXJyZW50LXVrcmFpbmUtdGhyZWF0LyJ9.p_Yv9wez5qWQuxBOknNe0KJzTS2G2oc2n5Ptd7p5Mm4&itid=gfta"
  },
  {
    "text": "Trio of sex scandals create unwelcome September surprises for GOP  —  A trio of sex scandals are becoming September surprises for Republicans, creating unnecessary distractions as the party seeks to win control of the White House and Congress this fall.  —  It's unclear if any of the controversies … ",
    "url": "https://thehill.com/homenews/house/4899406-republican-sex-scandals-2022/"
  },
  {
    "text": "Donald Trump and Bernie Moreno rage at “crazy” female voters who refuse to fall in line  —  MAGA candidates can't hide their irritation that women are allowed to think for themselves  —  As Steve Kornacki of NBC News explained Monday, the polling gender gap between Vice President Kamala Harris and Donald Trump is “off the charts.”",
    "url": "https://www.salon.com/2024/09/25/donald-and-bernie-moreno-rage-at-crazy-female-refuse-to-fall-in-line/"
  },
  {
    "text": "Donald Trump Cut Ties to Some Online Fund-Raisers  —  The campaign also reduced the commission retained by the remaining vendors, as the former president falls behind Vice President Kamala Harris in the cash race.  —  Former President Donald J. Trump's campaign cut ties late last week … ",
    "url": "https://www.nytimes.com/2024/09/25/us/politics/trump-online-fund-raisers.html"
  },
  {
    "text": "Why Mark Zuckerberg thinks AR glasses will replace your phone  —  Meta's CEO on his first pair of AR glasses, partnering with Ray-Ban, why he's done with politics, and more. … We have a very special episode of Decoder today.  It's become a tradition every fall to have Verge deputy editor … ",
    "url": "https://www.theverge.com/24253481/meta-ceo-mark-zuckerberg-ar-glasses-orion-ray-bans-ai-decoder-interview"
  },
  {
    "text": "Nothing to See Here, Just a Man of the People Hangin' With the Soroses  —  Who in the world thought this would make a great photo op for Tim Walz?  —  Besides Donald Trump, that is?  —  Frankly, I'm surprised this is still up after a few hours.  Twitchy picked up Alex Soros' weird photo op overnight … ",
    "url": "https://hotair.com/ed-morrissey/2024/09/25/nothing-to-see-here-just-a-man-of-the-people-hangin-with-the-soroses-n3794977"
  },
  {
    "text": "Why News Outlets Are Sitting on Hacked Trump Documents  —  The pilfered VP-vetting materials failed the “newsworthy” test, says New York Times editor Joseph Kahn.  Politico and The Washington Post also passed on publishing docs from the breach, which—as Popular Information revealed Tuesday … ",
    "url": "https://www.vanityfair.com/news/story/donald-trump-hack-news-outlets"
  },
  {
    "text": "‘He should be doing better’: Even some Trump allies see him veering off course  —  While polls show an incredibly close race, some of Trump's allies are concerned about his lack of focus.  —  Donald Trump was meeting privately in mid-September with one of his oldest friends, Steve Wynn … ",
    "url": "https://www.politico.com/news/2024/09/25/trump-allies-warnings-00180869"
  },
  {
    "text": "Criminalizing Pregnancy: A Record Number of Women Were Prosecuted the Year After Dobbs  —  One night in March of 2023, Amari Marsh went to the bathroom and suffered a miscarriage.  “I screamed because I was scared, because I didn't know what was going on,” she recently recalled.",
    "url": "https://www.motherjones.com/politics/2024/09/criminalizing-pregnancy-a-record-number-of-pregnant-women-were-prosecuted-the-year-after-dobbs/"
  },
  {
    "text": "Republicans Have A Nazi Problem  —  The problem is that they're brimming with Nazis  —  Left intellectuals have argued in circles for years over whether it's academically valid to call Trump and his Republican devotees fascist.  —  The debate has mostly pitted practical thinkers … ",
    "url": "https://www.offmessage.net/p/republicans-have-a-nazi-problem"
  },
  {
    "text": "What does 21st century infrastructure look like in your community?  —  Good afternoon from clouded Washington, where I am watching the role artificial intelligence is playing in this weird, intense, and accelerating election season.  —  If the 2016 presidential race brought “fake news” … ",
    "url": "https://civic-texts.ghost.io/what-does-21st-century-infrastructure-look-like-in-your-community/"
  }
]