[
  {
    "text": "Vulgarities, insults, baseless attacks: Trump backers follow his lead  —  Many GOP voters are not just tolerating, but relishing and emulating Trump's often crass and cruel approach to politics  —  DES MOINES — Donald Trump was conspicuously absent at a conservative Christian forum here … ",
    "url": "https://www.washingtonpost.com/elections/2023/11/19/donald-trump-insults-vulgarities-republicans/"
  },
  {
    "text": "Poll: Biden's standing hits new lows amid Israel-Hamas war  —  Young voters are breaking from Biden, helping give Trump a narrow lead for the first time in NBC News polling, though the gap is within the margin of error.  —  President Joe Biden's approval rating has declined to the lowest level … ",
    "url": "https://www.nbcnews.com/politics/2024-election/poll-bidens-standing-hits-new-lows-israel-hamas-war-rcna125251"
  },
  {
    "text": "Texas Gov. Abbott endorses Trump for president during visit to southern border  —  Texas Gov. Greg Abbott (R) officially endorsed former President Trump for the GOP primary nomination at a Sunday event honoring service members stationed on the Texas border.  —  “Joe Biden is causing … ",
    "url": "https://thehill.com/homenews/campaign/4317570-texas-gov-abbott-endorses-trump-2024-during-visit-to-southern-border/"
  },
  {
    "text": "Biden says he's an optimist.  But his dire warnings about Trump have become central to his campaign  —  President Joe Biden ends nearly every speech by saying he's “never been more optimistic” about the country's direction.  But lately he also has begun painting a vision of a catastrophic future … ",
    "url": "https://apnews.com/article/biden-trump-democracy-election-2024-president-8ff0337afec92264ae6fbaf36f55e683"
  },
  {
    "text": "Former First Lady Rosalynn Carter Passes Away at Age 96  —  Former First Lady Rosalynn Carter, a passionate champion of mental health, caregiving, and women's rights, passed away Sunday, Nov. 19, at 2:10 p.m. at her home in Plains, Georgia, at the age of 96.  She died peacefully, with family by her side.",
    "url": "https://www.cartercenter.org/news/pr/2023/statement-rosalynn-carter-111923.html"
  },
  {
    "text": "Rosalynn Carter, former first lady and tireless humanitarian who advocated for mental health issues, dies at 96  —  Carter devoted herself to several social causes in the course of her public life, including programs that supported health care resources, human rights, social justice and the needs of elderly people.",
    "url": "https://www.nbcnews.com/news/obituaries/rosalynn-carter-former-first-lady-dies-rcna62862"
  },
  {
    "text": "Rosalynn Carter, First Lady and a Political Partner, Dies at 96  —  She helped propel Jimmy Carter from rural Georgia to the White House and became the most politically active first lady since Eleanor Roosevelt  —  Rosalynn Carter, a true life partner to Jimmy Carter who helped propel … ",
    "url": "https://www.nytimes.com/2023/11/19/us/politics/rosalynn-carter-dead.html"
  },
  {
    "text": "Antisemitism was rising online.  Then Elon Musk's X supercharged it.  —  The Israel-Gaza war has raised tensions over what had already been a growing presence on the web.  —  In the weeks following the Oct. 7 Hamas attack on Israel, Twitter user @breakingbaht criticized leftists, academics and … ",
    "url": "https://www.washingtonpost.com/technology/2023/11/19/antisemiticism-interent-elon-musk-israwl-war/"
  },
  {
    "text": "Yaccarino On Hot Seat As Ad Execs Urge Twitter CEO To Resign  —  In the aftermath of IBM, Disney, Apple and others pausing spending on X, formerly known as Twitter, top advertising executives made a personal appeal to CEO Linda Yaccarino.  —  X CEO Linda Yaccarino, the longtime NBC advertising … ",
    "url": "https://www.forbes.com/sites/johnpaczkowski/2023/11/19/linda-yaccarino-x-twitter-elon-musk-antisemitism-urged-to-resign/"
  },
  {
    "text": "Trump-like libertarian Javier Milei wins Argentina's presidency  —  BUENOS AIRES — A radical libertarian and admirer of Donald Trump rode a wave of voter rage to win Argentina's presidency on Sunday, crushing the political establishment and bringing the sharpest turn to the right in four decades of democracy in the country.",
    "url": "https://www.washingtonpost.com/world/2023/11/19/argentina-presidential-election-results-javier-milei/"
  },
  {
    "text": "‘How Many Are Feds?’  Sen. Mike Lee Pushes Jan. 6 Disinformation  —  The senator alleged that a man carrying a vape was actually flashing a law enforcement badge  —  Sen. Mike Lee perpetuated an unfounded conspiracy theory that federal agents or informants were among the rioters on Jan. 6 … ",
    "url": "https://www.rollingstone.com/politics/politics-news/sen-mike-lee-pushes-jan-6-disinformation-1234886704/"
  },
  {
    "text": "From airlines to ticket sellers, companies fight U.S. to keep junk fees  —  An array of powerful moneyed lobbyists have warred with the Biden administration over its new regulatory crackdown as they scramble to protect their profits  —  Frustrated with airlines that charge passengers steep fees … ",
    "url": "https://www.washingtonpost.com/business/2023/11/19/companies-lobbyists-fight-junk-fees/"
  },
  {
    "text": "Newsom ad targets DeSantis's 6-week abortion ban  —  California Gov. Gavin Newsom (D) on Sunday released a new ad digging into Florida Gov. Ron DeSantis's (R) six-week ban on abortion as the two governors prepare to debate one another later this month.  —  The ad, released by Newsom … ",
    "url": "https://thehill.com/homenews/campaign/4317453-newsom-ad-targets-desantis-six-week-abortion-ban/"
  },
  {
    "text": "Extra Fees Drive Assisted Living Profits  —  The add-ons pile up: $93 for medications, $50 for cable TV.  Prices soar as the industry leaves no service unbilled.  The housing option is out of reach for many families.  —  Assisted-living centers have become an appealing retirement option … ",
    "url": "https://www.nytimes.com/2023/11/19/health/long-term-care-assisted-living.html"
  },
  {
    "text": "Tucker Carlson spreads antisemitic message in interview with Candace Owens  —  A handful of influential right-wing talk show hosts have spread antisemitic tropes to their millions of followers.  CNN's Oliver Darcy has the story.  —  Top business news  16 videos",
    "url": "https://www.cnn.com/videos/media/2023/11/18/antisemitism-right-wing-media-darcy-dnt-lead-vpx.cnn"
  }
]