[
  {
    "text": "Mark Robinson burns hand at event, returns to campaign Saturday  —  (NewsNation) — North Carolina Lt. Gov. Mark Robinson was treated for second-degree burns on a hand Friday night after suffering the injury at a campaign event in Mt. Airy.  His campaign tells NewsNation that Robinson … ",
    "url": "https://www.newsnationnow.com/politics/sources-mark-robinson-hospitalized/"
  },
  {
    "text": "The Republican Freak Show  —  Like the man who leads it, the GOP is not just incidentally grotesque.  It is grotesque at its core.  —  the gop is a moral freak show, and freak shows attract freaks.  Which is why Mark Robinson fits in so well in today's Republican Party.",
    "url": "https://www.theatlantic.com/politics/archive/2024/09/mark-robinson-rfk-jr-trump/680064/"
  },
  {
    "text": "Hezbollah confirms its leader Hassan Nasrallah was killed in an Israeli airstrike  —  Lebanon's Hezbollah group confirmed on Saturday that its leader and one of its founders, Hassan Nasrallah, was killed in an Israeli airstrike in Beirut the previous day.  A statement said Nasrallah “has joined his fellow martyrs.”",
    "url": "https://apnews.com/article/lebanon-israel-hezbollah-airstrikes-28-september-2024-c4751957433ff944c4eb06027885a973"
  },
  {
    "text": "Israeli military says Hezbollah leader Hassan Nasrallah killed in Beirut strike  —  Hezbollah released statement confirming death of terror chief  —  Join Fox News for access to this content  —  The Israeli Defense Forces (IDF) confirmed the leader of the Hezbollah terrorist organization … ",
    "url": "https://www.foxnews.com/world/israeli-military-says-hezbollah-leader-hassan-nasrallah-killed-beirut-strike"
  },
  {
    "text": "5 takeaways from this week's Trump-Harris polls  —  The polls are coming thick and fast with less than six weeks to go before Election Day.  —  Vice President Harris has seen broadly favorable polling results this week — with some caveats.  —  Harris now leads former President Trump … ",
    "url": "https://thehill.com/homenews/campaign/4904478-vice-president-harris-polls/"
  },
  {
    "text": "Anti-Abortion GOP Candidate Borrows Friend's Wife and Daughters for Campaign Photo Op  —  Male GOP candidates who are worried about getting dragged down by the abortion issue in November are putting their wives front and center in their campaign ads.  That's hardly a new phenomenon … ",
    "url": "https://www.mediaite.com/election-2024/anti-abortion-gop-candidate-borrows-friends-wife-and-daughters-for-campaign-photo-op/"
  },
  {
    "text": "Who created the “constitutional sheriff” myth?  Hint: It's not in the Constitution  —  Author Jessica Pishko on how two Arizona sheriffs created an entire mythology — and a dangerous movement  —  Four years ago, George Floyd's murder and the resulting months of demonstrations brought unprecedented scrutiny … ",
    "url": "https://www.salon.com/2024/09/28/created-the-constitutional-sheriff-myth-hint-its-not-in-the-constitution/"
  },
  {
    "text": "America's youngest voters turn right … - The younger generation of men is more likely to identify as conservative than as liberal, a stunning flip. … - 26% of men ages 18-24 say they identify as conservative — five points higher than 25-to-29-year-old men.",
    "url": "https://www.axios.com/2024/09/28/gen-z-men-conservative-poll"
  },
  {
    "text": "Tim Snyder: Trump reveals what a bad negotiator he is in Zelenskyy meeting  —  Yale University history professor Tim Snyder joins MSNBC's Ali Velshi to discuss former President Trump's meeting with Ukrainian President Volodymyr Zelenskyy and Trump's lie that he can negotiate a deal … ",
    "url": "https://www.msnbc.com/the-last-word/watch/tim-snyder-trump-reveals-what-a-bad-negotiator-he-is-in-zelenskyy-meeting-220352069588"
  },
  {
    "text": "Trump continues to warn about election ‘cheating.’ His supporters are ready to move on  —  Arpan Lobo Clara HendricksonDetroit Free Press  —  Four years ago, some of former President Donald Trump's supporters were so certain he won that they sued or breached the U.S. Capitol to stop the certification of the election.",
    "url": "https://www.freep.com/story/news/politics/elections/2024/09/28/trump-supporters-2024-election-results/75411198007/"
  },
  {
    "text": "Five things to know about Social Security reforms being considered in Congress  —  Legislation that would reform some aspects of Social Security is gaining steam in Congress.  —  The measure, dubbed the Social Security Fairness Act, seeks to do away with tax rules that proponents say have led … ",
    "url": "https://thehill.com/business/budget/4904464-social-security-reform-bill/"
  },
  {
    "text": "Exclusive: Kamala Harris campaign launches ‘Athletes for Harris’  —  There's “Swifties for Harris” and “Cat Ladies for Kamala” and “White Dudes for Harris.”  You can add one more to the list: “Athletes for Harris.”  —  The Harris campaign says it's launching “Athletes for Harris” … ",
    "url": "https://www.usatoday.com/story/sports/columnist/mike-freeman/2024/09/28/athletes-for-kamala-harris/75415123007/"
  },
  {
    "text": "Florida university to host extremist after DeSantis-led lurch to right  —  Next month, New College of Florida will welcome activist and writer Steve Sailer, a ‘proponent of scientific racism’  —  New College of Florida (NCF) will host the extremist writer Steve Sailer, who has been described as a … ",
    "url": "https://www.theguardian.com/us-news/2024/sep/28/new-college-of-florida-hosting-extremist-writer-steve-sailer"
  },
  {
    "text": "WATCH: Harris Barely Bothers to Speak During Her 1st Visit to the Border in AZ; Arizonan Calls Her ‘Liar’  —  Democrat presidential nominee Kamala Harris is in my home state of Arizona Friday, to visit Cochise County, and the border city of Douglas—a city split by the U.S.-Mexico border.",
    "url": "https://redstate.com/beccalower/2024/09/27/harris-az-border-remarks-n2179874"
  },
  {
    "text": "Major Conservative Poll Cited by Media Secretly Worked With Trump Team … A major polling organization is reportedly giving Donald Trump's campaign previews of its results before the public sees them.  —  On Thursday, American Muckrakers posted about emails it received detailing … ",
    "url": "https://newrepublic.com/post/186444/conservative-poll-rasmussen-secretly-worked-trump-team"
  },
  {
    "text": "Vance has a new media strategy: Drown them in boos  —  When Vance takes questions from the press, supporters jeer the questions and cheer him on.  —  TRAVERSE CITY, Michigan —  JD Vance had built a human wall of supporters behind him, and the press here was about to pay for it.",
    "url": "https://www.politico.com/news/2024/09/28/jd-vance-press-hostile-00181455"
  },
  {
    "text": "One last time: Terminally ill cancer patient casts final vote for Kamala Harris  —  When Catherine Crews' doctor told her in May that she had six months to live, she cried.  —  Then she asked her husband to call the courthouse.  —  A politically active Democrat, Crews had been watching … ",
    "url": "https://www.usatoday.com/story/news/politics/2024/09/28/cancer-patient-kamala-harris-vote/75364423007/"
  },
  {
    "text": "Justice Department Sues Alabama for Violating Federal Law's Prohibition on Systematic Efforts to Remove Voters Within 90 Days of an Election  —  For Immediate Release  —  The Justice Department announced today that it has filed a lawsuit against the State of Alabama and the Alabama Secretary … ",
    "url": "https://www.justice.gov/opa/pr/justice-department-sues-alabama-violating-federal-laws-prohibition-systematic-efforts-remove"
  }
]