[
  {
    "text": "Trump's legal advisers urge him to cancel press conference to refute Georgia allegations: Sources  —  Trump had announced a plan to release info on alleged election interference.  —  Former President Donald Trump's promised press conference to refute the allegations in the indictment handed … ",
    "url": "https://abcnews.go.com/US/trumps-legal-advisers-urge-cancel-press-conference-refute/story?id=102336380"
  },
  {
    "text": "Ex-Trump Aide Says Trump's Use Of Word ‘Riggers’ Is A Racist Dog Whistle  —  “I do think that's deliberate,” said Alyssa Farah Griffin, Trump's former White House communications director.  —  LOADING  —  Former White House communications director Alyssa Farah Griffin said she believes … ",
    "url": "https://www.huffpost.com/entry/alyssa-farah-griffin-trump-riggers-racist_n_64ddf04de4b0b74956e4493d"
  },
  {
    "text": "Indicted Ex-Trump Official's Weird ‘Witches’ Gripe Gets The Treatment Online … LOADING",
    "url": "https://www.huffpost.com/entry/jeff-clark-witches-post_n_64de19c1e4b0ce7f01200d7c"
  },
  {
    "text": "Defend Trump and ‘Hammer’ Ramaswamy: DeSantis Allies Reveal Debate Strategy  —  Hundreds of pages of blunt advice, memos and internal polling were posted online by the main super PAC backing the Florida governor, offering an extraordinary glimpse into his operation's thinking.",
    "url": "https://www.nytimes.com/2023/08/17/us/politics/desantis-debate-strategy.html"
  },
  {
    "text": "How Republicans overhype the findings of their Hunter Biden probe  —  The Fact Checker … — Rep. James Comer (R-Ky.), chairman of the House Oversight Committee, interview on Fox Business, May 11 … — Comer, interview on Newsmax, Aug. 10  —  The House Oversight Committee, led by Comer … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/17/how-republicans-overhype-findings-their-hunter-biden-probe/"
  },
  {
    "text": "Why Democrat Dean Phillips says Biden shouldn't run  —  The Minnesota Democrat said he is worried a Biden candidacy will lead to another Donald Trump presidency  —  Rep. Dean Phillips has nothing but good things to say about President Biden's time in office, supporting his policies … ",
    "url": "https://www.washingtonpost.com/politics/2023/08/17/phillips-biden-trump/"
  },
  {
    "text": "As Xitter's Lawyer Stalled DOJ, Elon Musk Met with Jim Jordan (Twice!) and Kevin McCarthy  —  Elon Musk has been eerily quiet about being held in contempt by Beryl Howell since the DC Circuit opinion was first released on August 9.  —  It's not like him to pass up the opportunity to make an obnoxious comment.",
    "url": "https://www.emptywheel.net/2023/08/17/as-xitters-lawyer-stalled-doj-elon-musk-met-with-jim-jordan-twice-and-kevin-mccarthy/"
  },
  {
    "text": "‘Squad’ Democrat Ilhan Omar's World Cup trip funded by Hamas-tied Qatar  —  “Squad” Rep. Ilhan Omar (D-MN), who has come under fire from Democrats and Republicans for anti-Israel remarks, had her 2022 World Cup trip paid for by the government of Qatar, an Arab country that has been a top funder of the terrorist group Hamas.",
    "url": "https://www.washingtonexaminer.com/news/house/squad-democrat-ilhan-omars-world-cup-trip-funded-qatar"
  },
  {
    "text": "Rudy Giuliani pocketed $300,000 from farmers investing in anti-Biden documentary that was never made, lawsuit claims  — A lawsuit claims Rudy Giuliani was paid $300,000 while pitching investors on an anti-Biden film.  — Giuliani allegedly said it would be a “kill shot” that would sink Joe Biden's campaign.",
    "url": "https://www.businessinsider.com/rudy-giuliani-biden-documentary-scam-money-lawsuit-2023-8?op=1"
  },
  {
    "text": "Dual citizen of France and Canada who mailed ricin to Trump sentenced to nearly 22 years in prison  —  A dual citizen of France and Canada who sent letters containing homemade ricin to then-President Donald Trump and eight Texas law enforcement officials was sentenced Thursday to nearly 22 years in prison.",
    "url": "https://www.cnn.com/2023/08/17/politics/ricin-trump-pascale-cecile-veronique-ferrier-sentenced/"
  },
  {
    "text": "Texas woman charged with threatening to kill judge overseeing Trump case, Democratic congresswoman  —  Abigail Jo Shry, of Alvin, Texas, is accused of threatening to harm U.S. District Judge Tanya S. Chutkan and Rep. Sheila Jackson Lee (D-TX).  —  WASHINGTON — A Texas woman faces federal charges … ",
    "url": "https://www.wusa9.com/article/news/national/capitol-riots/texas-woman-charged-with-threatening-to-kill-judge-overseeing-trump-case-democrat-congresswoman-sheila-jackson-lee-tanya-chutkan/65-34a5a7c1-d049-4919-836a-755150d10ea7"
  },
  {
    "text": "Newsmax Pundit Urges Conservatives to ‘Be More Homophobic’  —  “We need to take it up a notch because these people have continued to do this because we failed to shame them,” she added.  —  Conservatives need to “be more homophobic” and “take it up a notch,” a right-wing pundit said Wednesday night … ",
    "url": "https://www.thedailybeast.com/newsmax-pundit-shemeka-michelle-tells-conservatives-to-be-more-homophobic"
  },
  {
    "text": "Rudy Giuliani made desperate appeal to Trump to pay his legal bills in Mar-a-Lago meeting  —  With his attorney in tow, Rudy Giuliani traveled to Mar-a-Lago in recent months on a mission to make a personal and desperate appeal to former President Donald Trump to pay his legal bills.",
    "url": "https://www.cnn.com/2023/08/16/politics/giuliani-trump-legal-bills/"
  },
  {
    "text": "Menendez Rating Drops  —  West Long Branch, NJ - Public opinion of federal officeholders in New Jersey has dipped in the past year, but U.S. Sen. Bob Menendez is the only one who has lost ground with fellow Democrats.  The latest Monmouth (\"Mon-muth\") University Poll finds that most residents feel … ",
    "url": "https://www.monmouth.edu/polling-institute/reports/monmouthpoll_NJ_081723/"
  },
  {
    "text": "You Could See The Appeals Court Ruling on the Abortion Pill Coming From a Mile Away  —  Now, all the lawyers seeking to ban mifepristone will need to do is talk very fast and use the word “abortifacient” a lot.  —  Cassandra got a very raw deal.  She was always right and her curse … ",
    "url": "https://www.esquire.com/news-politics/politics/a44833443/mifepristone-appeals-court-ruling-restrictions-ban/"
  },
  {
    "text": "Inside the Russian effort to build 6,000 attack drones with Iran's help  —  Leaked documents show that Moscow is progressing toward its goal of mass-producing UAVs it could use to pummel Ukrainian cities  —  The engineers at a once-bustling industrial hub deep inside Russia were busy planning.",
    "url": "https://www.washingtonpost.com/investigations/2023/08/17/russia-iran-drone-shahed-alabuga/"
  },
  {
    "text": "Democratic Group Plans $10 Million Push to Protect Election Officials  —  The group is starting a new venture that will focus on five battleground states: Georgia, Arizona, North Carolina, Nevada and Wisconsin.  —  A group that works to elect Democrats as the top election officials … ",
    "url": "https://www.nytimes.com/2023/08/17/us/politics/democrats-election-officials-value-the-vote.html"
  },
  {
    "text": "How Trump Could Pull Off the Ultimate Upstage of the Republican Debate  —  He has 10 days to surrender and one of those days would crush the first debate.  —  ∙ Paid  —  1. Prime Time  —  From the time of his (latest) indictment, Donald Trump has 10 days to surrender himself to the authorities in Fulton County.",
    "url": "https://thetriad.thebulwark.com/p/what-if-trump-upstages-the-republican"
  },
  {
    "text": "Pence world poised for a showdown with Trump  —  'We've been waiting for this for a while,' the former vice president's senior adviser told POLITICO.  —  INDIANAPOLIS — Mike Pence tosses out a now well-honed line whenever he's asked how he could go from loyally defending Donald Trump to throwing spears at him on the debate stage.",
    "url": "https://www.politico.com/news/2023/08/17/pence-debate-showdown-trump-00111589"
  },
  {
    "text": "Hawaiian Electric Knew of Wildfire Threat, but Waited Years to Act  —  Four years ago, the utility said it needed to do more to prevent its power lines from emitting sparks.  It made little progress, focusing on a shift to clean energy.",
    "url": "https://www.wsj.com/us-news/wildfire-risk-maui-hawaiian-electric-7beed21e"
  },
  {
    "text": "World chess body bars trans women from competing in women's events  —  The International Chess Federation's new guidelines also strip transgender men of previously won women's titles.  —  The international governing body of competitive chess is effectively banning transgender women … ",
    "url": "https://www.nbcnews.com/nbc-out/out-news/world-chess-body-bars-trans-women-competing-womens-events-rcna100372"
  }
]