[
  {
    "text": "Trump Says He Will Consider Exempting Some U.S. Companies From Tariffs  —  President Trump said Wednesday that he's considering granting some U.S. companies an exemption from his tariff program.  “There are some that have been hard,” Trump told reporters when asked about companies requesting exemptions.",
    "url": "https://www.wsj.com/livecoverage/stock-market-trump-tariffs-trade-war-04-09-25/card/trump-says-he-will-consider-exempting-some-u-s-companies-from-tariffs-BXfdUETG5o197ZivMbn0"
  },
  {
    "text": "From ‘Be Cool!’ to ‘Getting Yippy’: Inside Trump's Reversal on Tariffs  —  Economic turmoil, particularly a rapid rise in government bond yields, caused President Trump to reverse course on the steep levies.  —  For the past week, President Trump has been urging calm in the face … ",
    "url": "https://www.nytimes.com/2025/04/09/us/politics/trump-tariff-pause-be-cool.html"
  },
  {
    "text": "Why Trump Blinked on Tariffs Just Hours After They Went Into Effect  —  Treasury secretary helped persuade president to take time to negotiate with trading partners in face of pressure from business leaders  —  President Trump finally blinked.  —  It took a week for the plunge in the stock … ",
    "url": "https://www.wsj.com/politics/policy/why-trump-blinked-on-tariffs-b588aea8?st=jQ73FX&reflink=desktopwebshare_permalink"
  },
  {
    "text": "Trump's ‘buy’ tip on social media before his tariffs pause made money for investors who listened  —  When Donald Trump offered some financial advice Wednesday morning, stocks were wavering between gains and losses.  But that was about to change.  —  “THIS IS A GREAT TIME TO BUY!!!",
    "url": "https://apnews.com/article/trump-truth-social-djt-tesla-musk-tariffs-pause-fccfa6b06c8f1ec0cd7844641ca52669"
  },
  {
    "text": "Adam Schiff Calls For Insider Trading Investigation into Trump Over Tariff Pause … The California Senator has long been one of Trump's fiercest critics.  He served as the lead prosecutor in Trump's first impeachment trial, and as a central figure in the congressional response to the Justice Department's Russia investigation.",
    "url": "https://time.com/7276234/trump-tariff-insider-trading-schiff/"
  },
  {
    "text": "Trump Orders DOJ To Investigate Prominent Critic in Shocking Oval Office Remarks: 'I Think He's Guilty of Treason'  —  President Donald Trump directed the Justice Department to investigate former Homeland Security official Miles Taylor over his “anonymous” essay and book hammering Trump during his first term.",
    "url": "https://www.mediaite.com/news/trump-orders-doj-to-investigate-prominent-critic-in-shocking-oval-office-remarks-i-think-hes-guilty-of-treason/"
  },
  {
    "text": "Fact Sheet: President Donald J. Trump Addresses Risks from Chris Krebs and Government Censorship  —  RESTORING TRUST IN GOVERNMENT: Today, President Donald J. Trump signed a Presidential Memorandum revoking any active security clearance held by Chris Krebs and his associates.",
    "url": "https://www.whitehouse.gov/fact-sheets/2025/04/fact-sheet-president-donald-j-trump-addresses-risks-from-chris-krebs-and-government-censorship/"
  },
  {
    "text": "Addressing Risks from Chris Krebs and Government Censorship  —  MEMORANDUM FOR THE HEADS OF EXECUTIVE DEPARTMENTS AND AGENCIES  —  The Federal Government has a constitutional duty and a moral responsibility to respect and promote the free speech rights of Americans.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/addressing-risks-from-chris-krebs-and-government-censorship/"
  },
  {
    "text": "4/10/25 ☀️ AM: … Johnson and House GOP leaders delayed a vote on a compromise budget resolution, yielding to conservative hardliners who want deeper spending cuts than the Senate can likely stomach.  —  At the end of the day, Johnson had more than a dozen holdouts.",
    "url": "https://punchbowl.news/archive/41025-am/"
  },
  {
    "text": "Newsmax defamed Dominion Voting Systems, judge rules  —  Right-wing cable channel Newsmax defamed Dominion Voting Systems by falsely reporting that the company was involved in rigging the 2020 presidential election, a Delaware judge ruled Wednesday.  —  Damages will be decided by a jury … ",
    "url": "https://www.latimes.com/entertainment-arts/business/story/2025-04-09/newsmax-defamed-dominion-voting-systems-judge-says"
  },
  {
    "text": "Rejected at her door, ICE nabs a Maryland woman in her car after smashing her window  —  The arrest was captured on camera by her daughter  —  This Monday started off like any other day for Karen Cruz Berrios.  —  The 18-year-old and her mother — Elsy Noemi Berrios, 52 … ",
    "url": "https://www.thebaltimorebanner.com/community/local-news/video-ice-arrest-wesminster-elsy-noemi-berrios-QJ7CIME76ZGPZEBW5C3REEPZ6E/"
  },
  {
    "text": "The Pool Filter  —  Some White House pool reports are no longer making it to the official distribution list, Status has learned—an unsettling development in the Trump administration's escalating war on the press.  —  At approximately six-thirty on Tuesday evening, Joseph Morton … ",
    "url": "https://www.status.news/p/white-house-censors-pool-reports"
  },
  {
    "text": "Maintaining Acceptable Water Pressure in Showerheads  —  By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered:  —  Section 1.  Purpose.  Overregulation chokes the American economy and stifles personal freedom.",
    "url": "https://www.whitehouse.gov/presidential-actions/2025/04/maintaining-acceptable-water-pressure-in-showerheads/"
  },
  {
    "text": "H.R. McMaster receives accidental call from President Trump  —  Just over a month ago, retired Lt. Gen. H.R. McMaster received an unexpected call on his personal cell, four sources told CBS News.  It was from the White House and he was instructed by the voice on the other end to stand by for the president.",
    "url": "https://www.cbsnews.com/news/h-r-mcmaster-trump-accidental-call/"
  },
  {
    "text": "US DOGE Service Agreement With Department of Labor Shows $1.3 Million Fee—and Details Its Mission  —  The unsigned agreement between the US DOGE Service and the Department of Labor provides significant insight into DOGE's work with federal agencies.  —  An unsigned agreement between the US DOGE Service … ",
    "url": "https://www.wired.com/story/department-of-labor-doge-usds-payment/"
  },
  {
    "text": "Read the DOJ memo barring employees from participating in American Bar Ass'n events  —  The following memorandum, issued on April 9, 2025 by Deputy Attorney General Todd Blanche, was obtained by Law Dork and is being published here in full.  —  Share  —  U.S. Department of Justice",
    "url": "https://www.lawdork.com/p/read-the-doj-memo-barring-employees"
  },
  {
    "text": "Tulsi Gabbard declared her residency in Texas.  Then she voted in Hawaii  —  As Tulsi Gabbard completed her transformation from a Hawaii Democratic politician to a MAGA surrogate last year, she put down stakes in a far redder state.  Gabbard and her husband bought a home outside of Austin … ",
    "url": "https://cnn.com/2025/04/09/politics/tulsi-gabbard-texas-hawaii-voting-residency-invs/"
  },
  {
    "text": "NIH freezes all research grants to Columbia University  —  Trump administration fires staff for flagship U.S. climate assessment  —  After April Fools' Day purge, U.S. health agencies spiral into chaos  —  Sifter  —  Gene editing fixes DNA—and treats incurable lung and liver disease",
    "url": "https://www.science.org/content/article/nih-freezes-all-research-grants-columbia-university"
  },
  {
    "text": "Kash Patel Quietly Removed as Acting ATF Director After Ghosting Gig  —  CANNED  —  He has been replaced by Army Secretary Daniel Driscoll after he reportedly did not show face in an ATF facility for weeks.  —  FBI Director Kash Patel has been quietly removed as the acting director … ",
    "url": "https://www.thedailybeast.com/kash-patel-reportedly-removed-as-acting-atf-director-after-ghosting-gig/"
  },
  {
    "text": "Social Security backs off cuts to phone services amid outcry  —  After weeks of confusion and outcry, the Social Security Administration said it is backing off its announced drastic cuts to phone services.  —  Why it matters: The changes would've strained an already backlogged agency … ",
    "url": "https://www.axios.com/2025/04/09/social-security-cuts-doge"
  },
  {
    "text": "Trans pilot falsely blamed in D.C. plane crash sues conservative influencer  —  Military pilot Jo Ellis said she had to hire private armed security for her family because of the false claims, which went viral on social media.  —  A transgender military pilot filed a defamation lawsuit Wednesday … ",
    "url": "https://www.nbcnews.com/feature/nbc-out/trans-pilot-falsely-blamed-potomac-plane-crash-sues-conservative-influ-rcna200474"
  },
  {
    "text": "American Is Arrested in Thailand on Charges of Criticizing Royalty  —  The U.S. State Department said it was alarmed at the arrest of Paul Chambers, a lecturer in civil-military relations, under Thailand's strict lèse-majesté laws.  —  The arrest of an American academic … ",
    "url": "https://www.nytimes.com/2025/04/09/us/paul-chambers-thailand-monarchy-arrest.html"
  }
]