[
  {
    "text": "Trump is injured but ‘fine’ after apparent assassination attempt leaves rally-goer and gunman dead  —  Donald Trump was whisked off the stage at a rally in Butler, Pennsylvania after apparent gunshots rang through the crowd.  He quickly ducked behind the podium as agents from his protective detail rushed … ",
    "url": "https://apnews.com/article/trump-rally-assassination-attempt-db24c5bfbbe7d09fa2437c3c836bb434"
  },
  {
    "text": "Live updates: New details emerge about Trump rally shooting suspect  —  Law enforcement officials are working to learn more about the 20-year-old who tried to assassinate former President Donald Trump at a rally in Butler, Pennsylvania, on Saturday.  —  In a briefing Sunday … ",
    "url": "https://apnews.com/live/election-biden-trump-campaign-updates-07-13-2024#00000190-b27e-dc4e-ab9d-ba7eb1060000"
  },
  {
    "text": "FBI probing motives, background of Thomas Matthew Crooks, the Western Pa. gunman behind Donald Trump assassination attempt  —  A defiant Donald Trump called for unity and resilience a day after surviving an attempted assassination at a campaign rally in Western Pennsylvania … ",
    "url": "https://www.inquirer.com/news/pennsylvania/thomas-matthew-crooks-trump-shooter-id-butler-20240714.html"
  },
  {
    "text": "Local officer retreated from shooter at Trump rally before shots were fired  —  A local law enforcement officer reportedly encountered the shooter who attempted to assassinate former President Donald Trump before he started shooting.  —  Officials who spoke to the Associated Press on condition … ",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3082010/local-officer-retreated-from-shooter-at-trump-rally-before-shots-were-fired/"
  },
  {
    "text": "‘Massive security breach’: Secret Service under scrutiny after gunman got clear shot at Trump  —  How a gunman could scale a roof where Trump was speaking prompts calls for investigation.  —  The attempted assassination of Donald Trump represents a glaring failure by the Secret Service … ",
    "url": "https://www.politico.com/news/2024/07/14/secret-service-trump-shooting-rally-00168158"
  },
  {
    "text": "Donald Trump and the language of violence  —  In a shocking act on July 13, a man attempted to assassinate Donald Trump at a campaign rally in Butler, Pennsylvania.  Trump will recover from his wound but, tragically, a 50-year-old man attending the rally was shot and killed.",
    "url": "https://www.theframelab.org/donald-trump-language-of-violence/"
  },
  {
    "text": "The Gunman and the Would-Be Dictator  —  Violence stalks the president who has rejoiced in violence to others.  —  When a madman hammered nearly to death the husband of then-House Speaker Nancy Pelosi, Donald Trump jeered and mocked.  One of Trump's sons and other close Trump supporters … ",
    "url": "https://www.theatlantic.com/ideas/archive/2024/07/donald-trump-democracy-dictator/679006/"
  },
  {
    "text": "MAGA Narratives about the Trump Assassination Attempt  —  Welcome back to Lucid, and hello to all new subscribers.  I am “on vacation” in Italy, but the dramatic news from the U.S. has drawn me back to the computer.  —  I am not going to comment on the facts of the attempted assassination … ",
    "url": "https://lucid.substack.com/p/maga-narratives-about-the-trump-assassination"
  },
  {
    "text": "An Expert on Political Violence Sees a Way Out of America's Crisis  —  Despite the bitter atmosphere, there are real ways to ease political tensions  —  The attempted assassination of former President Donald Trump shocked the nation — but not everyone was totally surprised.",
    "url": "https://www.politico.com/news/magazine/2024/07/14/how-to-curb-political-violence-qa-00168105"
  },
  {
    "text": "Trump rally shooting upends Democrats' Biden crisis … - “We're all just focused on expressing condolences ... and keeping our teams safe,” said one House Democrat who has been fiercely critical of Biden.  — A senior House Democrat suggested the post shooting atmosphere in the party is too … ",
    "url": "https://www.axios.com/2024/07/14/house-democrats-biden-trump-rally-shooting"
  },
  {
    "text": "Democrats fret about the political fallout from the Trump rally shooting  —  “The presidential contest ended last night,” said a veteran Democratic consultant.  —  MILWAUKEE — In the hours after a would-be assassin fired a bullet through former President Donald Trump's ear, Panfilo DiCenzo … ",
    "url": "https://www.nbcnews.com/politics/2024-election/democrats-fret-political-fallout-trump-rally-shooting-rcna161789"
  },
  {
    "text": "Trump rewrites Republican convention speech to focus on unity not Biden  —  WORLD EXCLUSIVE — Former President Donald Trump has completely rewritten his convention speech in light of the assassination attempt against him on Saturday and will call on Thursday for a new effort at national unity.",
    "url": "https://www.washingtonexaminer.com/news/campaigns/presidential/3082180/trump-rewrites-republican-convention-speech-focus-unity-not-biden/"
  },
  {
    "text": "Kevin McCarthy shares conversation with Trump about shooting injury  —  Former Speaker Kevin McCarthy says former President Donald Trump “came so close to losing his life” but somehow remains upbeat.  He shared his conversation with Trump following Saturday's shooting at a Pennsylvania rally.",
    "url": "https://www.cbsnews.com/video/former-speaker-kevin-mccarthy-trump-shooting-injury-conversation/"
  },
  {
    "text": "Secret Service under scrutiny over gunman's access to a clear Trump view  —  Lawmakers call on agency director to testify before Congress while some current and former agents express shock at the apparent security lapse.",
    "url": "https://www.washingtonpost.com/nation/2024/07/14/secret-service-trump-rally-shooting/"
  },
  {
    "text": "Top Democratic strategist pushed reporters to consider ‘staged’ shooting  —  The Scoop  —  The top political adviser to Democratic mega-donor Reid Hoffman suggested that the attack on Donald Trump could have been “staged,” even as Hoffman was criticized for joking before Saturday's attack about Trump becoming a “martyr.”",
    "url": "https://www.semafor.com/article/07/14/2024/top-democrat-pushed-reporters-to-consider-staged-shooting"
  },
  {
    "text": "Former fire chief shot, killed at Trump rally  —  PITTSBURGH — The former fire chief for Buffalo Township, Corey Comperatore, was the person killed in the crowd at the Trump rally in Butler County, Channel 11 has learned.  —  Trump injured in assassination attempt at rally in Butler; 1 attendee, suspected shooter killed",
    "url": "https://www.wpxi.com/news/local/former-fire-chief-shot-killed-trump-rally/HJXCL4CSN5AZJIPZCT6GWFQ4JE/"
  },
  {
    "text": "RNC speakers told to leave speeches unchanged in wake of Trump assassination attempt  —  There are conversations about which specific speakers will discuss the assassination, an attempt to make sure the incident is not brought up by every person.  —  MILWAUKEE — Speakers … ",
    "url": "https://www.nbcnews.com/politics/donald-trump/rnc-speakers-speeches-unchanged-trump-assassination-attempt-rcna161814"
  }
]