[
  {
    "text": "Do You Remember the Ecstasy of Electing Joe Biden?  —  How the coalition that defeated Donald Trump crumbled.  —  We danced in the streets when Joe Biden was elected.  Do you remember?  American cities staged the greatest spontaneous outpouring of joy since V-J Day with cars honking … ",
    "url": "https://nymag.com/intelligencer/article/can-joe-biden-win-2024-presidential-election-anti-trump-coalition.html"
  },
  {
    "text": "Judge Threatens to Kick Trump Out of E. Jean Carroll Defamation Trial if He Disrupts Court  —  Trump told the judge he would ‘love it’ if he threw him out of the courtroom  —  The federal judge presiding over Donald Trump's defamation trial on Wednesday warned the former president … ",
    "url": "https://themessenger.com/politics/trump-e-jean-carroll-judge-kaplan-defamation-trial"
  },
  {
    "text": "DeSantis Super PAC Begins Layoffs, Even as He Projects Confidence  —  The number of layoffs at the super PAC, Never Back Down, was unclear on Wednesday morning, but an official said that those being laid off were being paid through the end of January.  —  The super PAC supporting Gov. Ron DeSantis … ",
    "url": "https://www.nytimes.com/2024/01/17/us/politics/desantis-layoffs-super-pac.html"
  },
  {
    "text": "Florida Democrats flip Republican House seat in Special Election  —  ORANGE COUNY, Fla. — Florida Democrats scored a win Tuesday night in a special election to fill a vacant House seat with Tom Keen defeating Erika Booth in a closely watched race that saw major outside spending and an avalanche of mailers and TV ads.",
    "url": "https://www.wftv.com/news/local/florida-democrats-flip-republican-house-seat-special-election/BDGBNIJ3CZECRMX6NTSZQVYZX4/"
  },
  {
    "text": "Democrat Keen wins state House 35 special election over GOP's Booth  —  In a race seen as a bellwether for Democratic chances in November, Democrat Tom Keen flipped what had been a Republican state House seat in Central Florida in a special election held Tuesday.",
    "url": "https://www.orlandosentinel.com/2024/01/16/democrat-keen-wins-state-house-35-special-election-over-gops-booth/"
  },
  {
    "text": "Johnson: Now is not ‘the time for comprehensive immigration reform’  —  Speaker Mike Johnson (R-La.) voiced his skepticism of a deal being crafted in the Senate to pair border and migration policy changes with Ukraine aid, and said that now is not the time for comprehensive immigration reform.",
    "url": "https://thehill.com/homenews/house/4413501-mike-johnson-immigration-reform/"
  },
  {
    "text": "Johnson Digs In Against Border Deal to Unlock Ukraine Aid, Defying Biden  —  Hours before a scheduled meeting at the White House about how to break the stalemate in Congress over aid to Ukraine, the Republican speaker signaled a compromise was not possible.  —  Speaker Mike Johnson … ",
    "url": "https://www.nytimes.com/2024/01/17/us/politics/johnson-biden-border-ukraine.html"
  },
  {
    "text": "David Weiss Buries Bill Barr Right Alongside Tony Bobulinski  —  For a second time, David Weiss' Special Counsel team has buried an inconvenient (some)body to avoid accounting for the politicization of the investigation they claim is not political.  —  This time, it's Bill Barr.",
    "url": "https://www.emptywheel.net/2024/01/17/david-weiss-buries-bill-barr-right-alongside-tony-bobulinski/"
  },
  {
    "text": "The ‘Sleeping Giant’ Case that Could Upend Jack Smith's Prosecution of Trump  —  The Supreme Court has agreed to consider a case that doesn't mention the former president, but that could invalidate half of the Jan. 6 charges against him.  —  There's been a lot of attention paid … ",
    "url": "https://www.politico.com/news/magazine/2024/01/17/supreme-court-case-trump-prosecution-00135852"
  },
  {
    "text": "Judge Aileen Cannon Is Quietly Sabotaging the Trump Classified Documents Case  —  On Friday, District Judge Aileen Cannon issued a new order in the Donald Trump classified documents case adding to the mountain of evidence that she is firmly in the former president's pocket.",
    "url": "https://slate.com/news-and-politics/2024/01/judge-aileen-cannon-trump-classifed-sabotage.html"
  },
  {
    "text": "E&C Investigation Uncovers Earliest Known SARS-CoV-2 Sequence Released Outside of China  —  Discovery that shows virus sequence existed two weeks earlier than previously known undercuts China's timeline of events  —  Washington, D.C. — The House Energy and Commerce Committee's investigation … ",
    "url": "https://energycommerce.house.gov/posts/e-and-c-investigation-uncovers-earliest-known-sars-co-v-2-sequence-released-outside-of-china"
  },
  {
    "text": "Right-wing media mogul buys the Baltimore Sun  —  David D. Smith, the executive chairman of Sinclair Broadcast Group (Sinclair), purchased the Baltimore Sun — the largest newspaper in Maryland — for an undisclosed sum.  The acquisition means another powerful media outlet will be under … ",
    "url": "https://popular.info/p/right-wing-media-mogul-buys-the-baltimore"
  },
  {
    "text": "Blinken Stranded After Boeing 737 Breaks Down on Davos Trip  —  US Secretary of State Antony Blinken was unable to fly home from Davos as scheduled on Wednesday due to a critical error with his aircraft. … An oxygen leak detected previously could not be remedied.",
    "url": "https://www.bloomberg.com/news/articles/2024-01-17/blinken-stranded-after-boeing-plane-breaks-down-on-davos-trip"
  },
  {
    "text": "New Biden rule cracks down on insurers' use of prior authorization  —  A new Biden administration rule released Wednesday aims to streamline the prior authorization process used by insurers to approve medical procedures and treatments.  —  Prior authorization is a common tool used by insurers … ",
    "url": "https://thehill.com/policy/healthcare/4413508-biden-rule-health-insurer-prior-authorization/"
  },
  {
    "text": "The Suicide of an Alabama Mayor Shows That Pre-Stonewall Horrors Aren't Just Coming Back.  They're Here.  — Many Queers Can't Bring Themselves to Face the Emotion They're Really Feeling Right Now.  We Must.  —  The practice of press outlets terrorizing gender-nonconforming people … ",
    "url": "https://slate.com/human-interest/2024/01/bubba-copeland-lgbtq-trans-outing-stonewall-history.html"
  },
  {
    "text": "China's Population Shrank Again in 2023 as Births Continue to Fall  —  Faced with falling births, China's efforts to stabilize a shrinking population and maintain economic growth are failing.  —  阅读.体中文.閱讀.體中文.",
    "url": "https://www.nytimes.com/2024/01/16/business/china-birth-rate-2023.html"
  },
  {
    "text": "The big reason banks despise the Fed's capital rule  —  Editor's note: Morning Money is a free version of POLITICO Pro Financial Services morning newsletter, which is delivered to our subscribers each morning at 5:15 a.m. The POLITICO Pro platform combines the news you need with tools you can use … ",
    "url": "https://www.politico.com/newsletters/morning-money/2024/01/17/the-big-reason-banks-despise-the-feds-capital-rule-00136009"
  },
  {
    "text": "Let's Look at the Iowa Results With a Cold Eye  —  It was a huge win for Trump.  Don't tell me it's all going to work out fine in November.  —  Let us be completely honest.  There is no silver lining to the results of Monday's Iowa caucuses.  What coverage I watched on TV—truth be told … ",
    "url": "https://www.esquire.com/news-politics/politics/a46410329/iowa-caucuses-results-trump-victory/"
  },
  {
    "text": "Iran comes to town  —  GREETINGS!  First up, Global Playbook has a bit of vital good news from the World Economic Forum in Davos: The snow showers stayed away long enough to allow choppers to land on the helipad near the lake, so the world's billionaires weren't forced to schlep up the mountain by road like the rest of us plebs.",
    "url": "https://www.politico.eu/newsletter/global-playbook/iran-comes-to-town/"
  }
]