[
  {
    "text": "Corruption Law Allows Gifts to State and Local Officials, Supreme Court Rules  —  The court, which has limited the sweep of several anti-corruption laws, distinguished after-the-fact rewards from before-the-fact bribes.  —  The Supreme Court limited the sweep of a federal law on Wednesday aimed … ",
    "url": "https://www.nytimes.com/2024/06/26/us/politics/supreme-court-corruption-bribery.html"
  },
  {
    "text": "The Supreme Court rules that state officials can engage in a little corruption, as a treat  —  On a 6-3 party-line vote, the Supreme Court ruled on Wednesday that state officials may accept “gratuities” from people who wish to reward them for their official actions, despite a federal anti-corruption statute … ",
    "url": "https://www.vox.com/scotus/357170/supreme-court-snyder-united-states-corruption"
  },
  {
    "text": "Scoop: Biden seizes debate limelight for “Project 2025” push … - The Trump campaign points instead to the Agenda47 website for policies explicitly endorsed by former President Trump. … - Google search interest in “Project 2025” surged earlier this month, and a John Oliver segment … ",
    "url": "https://www.axios.com/2024/06/27/biden-project-2025-trump-debate"
  },
  {
    "text": "What to Watch at the First Trump-Biden Debate  —  Both candidates have been eager for this rematch, with President Biden aiming to focus on their starkly different visions for America, and Donald Trump keen to attack his rival's record.  —  The candidates are the same.  The circumstances are very different.",
    "url": "https://www.nytimes.com/2024/06/27/us/politics/trump-biden-debate-preview.html"
  },
  {
    "text": "Supreme Court Poised to Allow Emergency Abortions in Idaho  — Opinion was briefly posted on the court's website and removed  — Hospitals would be allowed to protect pregnant mother's health  —  The US Supreme Court is poised to allow abortions in medical emergencies in Idaho … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-26/us-supreme-court-poised-to-allow-emergency-abortions-in-idaho"
  },
  {
    "text": "Errant SCOTUS abortion case document posting sparks confusion  —  On Wednesday afternoon, Bloomberg sent shockwaves throughout the country, reporting that a document appeared on the opinions page of the U.S. Supreme Court's website briefly Wednesday morning that, for all intents and purposes … ",
    "url": "https://www.lawdork.com/p/emtala-document-scotus-corruption-decision"
  },
  {
    "text": "A coup attempt is feared in Bolivia as troops pour into the streets  —  LA PAZ, Bolivia (AP) — Armored vehicles rammed into the doors of Bolivia's government palace Wednesday as a top government official warned of a coup attempt and President Luis Arce said “irregular” deployment of troops was taking place in the capital.",
    "url": "https://apnews.com/article/bolivia-military-deployment-arce-coup-fears-028cd88f3be1fb02164c05deb0faa099"
  },
  {
    "text": "The presidential election isn't a toss-up  —  As our model launches, either Biden or Trump could easily win — but the odds are in the ex-president's favor.  —  ∙ Paid … We hope all of this will prove to be worth your time — and money — and you can sign up using the link below.",
    "url": "https://www.natesilver.net/p/the-presidential-election-isnt-a"
  },
  {
    "text": "Trump Pulls Ahead In Presidential Race, Vast Majority Of Voters Plan To Watch Debate, 16% Open To Changing Choice For President, Quinnipiac University National Poll Finds; Voters Support Social Media Warning Label And Banning Smartphones In The Classroom  —  mail_outline",
    "url": "https://poll.qu.edu/poll-release?releaseid=3900"
  },
  {
    "text": "25+ Years of Daily Show Clips Gone as Paramount Axes Comedy Central Site  —  First on LateNighter: One of the richest repositories of late-night videos is no longer.  —  ComedyCentral.com had been home to clips from every episode of The Daily Show since 1999, and the entire run of The Colbert Report … ",
    "url": "https://latenighter.com/news/paramount-axes-comedy-central-website-show-clips-library/"
  },
  {
    "text": "SCOTUS Puntalooza: Court Rejects Challenge to Government-Directed Censorship  —  Consider today a very disappointing day at the Supreme Court.  Not only did the court publish only two of the outstanding opinions in unresolved cases this term, they also chose to punt on one of the most important.",
    "url": "https://hotair.com/ed-morrissey/2024/06/26/scotus-palooza-n3790961"
  },
  {
    "text": "EXCLUSIVE: VA Senate candidate says he was ‘blown up’ in combat.  His record doesn't show that.  —  Elizabeth Beyer Tom Vanden BrookUSA TODAY  —  WASHINGTON — The Republican candidate for U.S. Senate in Virginia, a decorated Navy veteran, has made repeated references to becoming disabled after he was … ",
    "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/26/hung-cao-military-record-purple-heart/74220141007/"
  },
  {
    "text": "How right-wing media is legitimizing a nonsensical and nonexistent lawsuit  —  This is a special joint edition of Public Notice and Judd Legum's Popular Information.  You can subscribe to Popular Information here.  —  On June 20, Missouri Attorney General Andrew Bailey announced on X … ",
    "url": "https://www.publicnotice.co/p/andrew-bailey-new-york-lawsuit-trump-sinclair"
  },
  {
    "text": "7 in 10 think Supreme Court justices prioritize ideology: AP poll  —  WASHINGTON (AP) — A solid majority of Americans say Supreme Court justices are more likely to be guided by their own ideology rather than serving as neutral arbiters of government authority, a new poll finds … ",
    "url": "https://apnews.com/article/supreme-court-trump-presidential-immunity-abortion-gun-2918d3af5e37e44bbad9c3526506c66d"
  },
  {
    "text": "Pluralistic: Cleantech has an enshittification problem (26 Jun 2024)  — Cleantech has an enshittification problem: Who's gonna make a 25-year purchase from a startup with six months' worth of runway?  — Hey look at this: Delights to delectate.  — This day in history: 2004, 2009, 2014, 2019",
    "url": "https://pluralistic.net/2024/06/26/unplanned-obsolescence/"
  },
  {
    "text": "What Trump And Biden Really Mean When They Fight About Electric Vehicles  —  The argument is about a lot more than Detroit and cars.  —  LOADING  —  President Joe Biden sketched out his vision for the future of America's auto industry during a visit to Detroit in late 2021.",
    "url": "https://www.huffpost.com/entry/biden-trump-auto-industry-electric-vehicle-future_n_667c6d35e4b07cb66c6c9d74"
  },
  {
    "text": "What Kind of ‘Psycho’ Calls Dead Americans ‘Losers’ and ‘Suckers’?  —  Trump's denial of his own well-documented remarks is a tell.  —  Perhaps you've noticed lately that Donald Trump, a man not known for subtlety, has been testing the limits of the Streisand effect.",
    "url": "https://www.theatlantic.com/politics/archive/2024/06/what-kind-of-psycho-calls-dead-americans-losers-and-suckers/678807/"
  },
  {
    "text": "Honduras ex-President Hernandez sentenced to 45 years in prison on US drug conviction  —  Former Honduran President Juan Orlando Hernandez was sentenced by a U.S. judge on Wednesday to 45 years in prison for his conviction on drug and firearm offenses.  —  The sentence means Hernandez, 55 … ",
    "url": "https://www.reuters.com/world/americas/honduras-ex-president-hernandez-faces-long-prison-term-after-us-drug-conviction-2024-06-26/"
  },
  {
    "text": "New charges: Feeding Our Future juror was followed for days, given list of instructions with $120k in cash to acquit  —  Five people, including three who were on trial, are now being charged.  —  The defendants carefully chose the juror and followed her home, watching her for days … ",
    "url": "https://www.startribune.com/new-charges-feeding-our-future-juror-was-followed-for-days-given-list-of-instructions-with-120k-in-cash-to-acquit/600376357/"
  },
  {
    "text": "China Ousts Two Ex-Defense Ministers from Party on Corruption  — Both men took bribes, set a bad example, says state media  — President Xi's campaign to clean forces rolls on after decade  —  China's ruling Communist Party expelled two former defense ministers on corruption charges … ",
    "url": "https://www.bloomberg.com/news/articles/2024-06-27/china-expels-former-defense-minister-from-party-on-corruption"
  }
]