[
  {
    "text": "Trump federal election trial set for March 4, 2024  — The federal judge presiding over Donald Trump's criminal election interference case shut down a bid by the former president to set his trial more than two-and-a-half years away.  — But the judge also said that she would reject … ",
    "url": "https://www.cnbc.com/2023/08/28/trump-special-counsel-to-clash-over-trial-date-in-dc-election-case.html"
  },
  {
    "text": "Judge Sets Trial Date in March for Trump's Federal Election Case  —  Judge Tanya S. Chutkan rejected efforts by the former president's legal team to postpone the trial until 2026.  —  The federal judge overseeing former President Donald J. Trump's prosecution on charges of conspiring … ",
    "url": "https://www.nytimes.com/2023/08/28/us/politics/trump-trial-date-jan-6.html"
  },
  {
    "text": "Biden is widely seen as too old for office, an AP-NORC poll finds.  Trump has problems of his own  —  Americans actually agree on something in this time of raw discord: Joe Biden is too old to be an effective president in a second term.  Only a few years his junior, Donald Trump raises strikingly less concern about his age.",
    "url": "https://apnews.com/article/biden-age-poll-trump-2024-620e0a5cfa0039a6448f607c17c7f23e"
  },
  {
    "text": "‘Joe The Plumber,’ who rose to fame after confronting Barack Obama on the 2008 campaign trail, dead at 49  —  Joe Wurzelbacher, a plumber by trade, became a key part of Republican John McCain's presidential campaign  —  Samuel Joseph Wurzelbacher, who became known as “Joe the Plumber” … ",
    "url": "https://www.foxnews.com/politics/joe-plumber-rose-fame-confronting-obama-2008-campaign-trail-dead-49"
  },
  {
    "text": "Samuel Wurzelbacher, Celebrated as ‘Joe the Plumber,’ Dies at 49  —  For Republicans in 2008, he briefly became a symbol of Middle America when he questioned the presidential candidate Barack Obama in an impromptu televised encounter.  —  Samuel Joseph Wurzelbacher, who briefly became … ",
    "url": "https://www.nytimes.com/2023/08/28/us/politics/samuel-wurzelbacher-joe-the-plumber-dead.html"
  },
  {
    "text": "DeSantis booed at vigil for victims of racist shooting in Florida  —  Florida Gov. Ron DeSantis, a GOP presidential candidate, was met with boos while speaking late Sunday at a vigil held for the three victims of a racially motivated shooting in Jacksonville.",
    "url": "https://thehill.com/homenews/state-watch/4174426-desantis-booed-at-vigil-for-victims-of-racist-shooting-in-florida/"
  },
  {
    "text": "A federal hate crime probe is underway after 3 people were killed in a racist rampage in Jacksonville, officials say.  Here's what we know  —  A federal hate crime investigation is underway after a White gunman with a swastika-emblazoned assault rifle killed three Black people at a Dollar General store … ",
    "url": "https://www.cnn.com/2023/08/28/us/jacksonville-florida-shooting-what-we-know/"
  },
  {
    "text": "GOP activist, lawyer stabbed to death in his Durham, NH, home  —  A suspicious death investigation that was underway this weekend in Durham, New Hampshire, has been ruled a homicide after an autopsy was completed on the victim.  —  The New Hampshire Attorney General's Office said in a statement Sunday … ",
    "url": "https://www.nbcboston.com/news/local/41-year-old-man-fatally-stabbed-in-durham-nh-identified/3122099/"
  },
  {
    "text": "Killing of ‘Staunch’ GOP Activist in New Hampshire Under Investigation  —  A colleague called Alexander Talcott “an exceptionally skilled champion for the rule of law and the importance of fair and honest elections.”  —  A Republican Party activist and lawyer died after he was fatally stabbed … ",
    "url": "https://www.thedailybeast.com/gop-activist-alexander-talcotts-killing-in-new-hampshire-under-investigation"
  },
  {
    "text": "Trump, co-defendants to be arraigned in Georgia on Sept. 6  —  Former President Trump will be arraigned next Wednesday in Georgia over charges he and 18 co-defendants sought to overturn the state's election results.  —  Trump's arraignment has been set for Sept. 6 at 9:30 a.m. … ",
    "url": "https://thehill.com/regulation/court-battles/4174548-trump-co-defendants-to-be-arraigned-in-georgia-on-sept-6/"
  },
  {
    "text": "August 2023 National Poll: Trump Debate Snub May Open Door for Other Candidates  —  Home Polls August 2023 National Poll: Trump Debate Snub May Open Door for Other Candidates  —  Hunter Biden Legal Issues Offsetting Trump Indictments for Independents  —  A new Emerson College Polling survey … ",
    "url": "https://emersoncollegepolling.com/august-2023-national-poll-trump-debate-snub-may-open-door-for-other-candidates/"
  },
  {
    "text": "Riley Gaines Wrecks Nebraska Democrat for Tone-Deaf Statement About Women's Sports  —  For a party that claims to be the women looking out for women, the Democrats sure are doing a lot to erase them in favor of some transgender agenda.  —  While you can see a demonstration a day … ",
    "url": "https://redstate.com/brandon_morse/2023/08/28/riley-gaines-wrecks-nebraska-democrat-for-tone-deaf-statement-about-womens-sports-n2163132"
  },
  {
    "text": "The Federalist Society's mugshots  —  This entirely free edition of Public Notice is made possible by paid subscribers.  If you appreciate our work and aren't already one, please support us by signing up.  Just click the button below for a free trial.  —  Sign up for Public Notice free trial",
    "url": "https://www.publicnotice.co/p/jeffrey-clark-eastman-charges-federalist-society"
  },
  {
    "text": "“We call that kind of love a cult”: Experts on the latest disturbing poll of Trump supporters  —  New poll reveals that members of the MAGA cult trust Trump most: He “provides the kind of love they crave”  —  As I have previously explored in a series of conversations with cult … ",
    "url": "https://www.salon.com/2023/08/28/we-call-that-kind-of-love-a-cult-experts-on-the-latest-disturbing-poll-of-supporters/"
  },
  {
    "text": "Sadistic California Cops Bragged About ‘Violating Civil Rights’  —  Feds allege officers collected photos of K-9 attacks and crafted an American flag with spent munitions … But what happens when these same police become agents of wanton violence?  A new federal indictment pulls … ",
    "url": "https://www.rollingstone.com/politics/politics-features/antioch-cops-morteza-amiri-eric-rombough-devon-wenger-1234812466/"
  }
]